
&НаКлиенте
Перем ПрежнееНаименование; // №12909

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	УправлениеФормой();
	
	//++ №9160
	ОбновитьСписокИзображений();
	Если ЗначениеЗаполнено(Объект.ФайлКартинки) И СписокИзображений.НайтиПоЗначению(Объект.ФайлКартинки) = Неопределено Тогда
		// в текущем изображении - изображение не от данной номенклатуры
		Объект.ФайлКартинки = ПредопределенноеЗначение("Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка");
		Модифицированность = Истина;
	КонецЕсли;
	ТекущееИзображение = Объект.ФайлКартинки;
	ОбновитьНадписьТекущегоИзображения();
	//-- №9160
	
	// №7722 изображение теперь хранится в справочнике
	//ТекОб = РеквизитФормыВЗначение("Объект");
	//Фото = ПоместитьВоВременноеХранилище(ТекОб.Фото.Получить(),УникальныйИдентификатор);
	Если НЕ Объект.ФайлКартинки.Пустая() Тогда
		
		Фото = ПоместитьВоВременноеХранилище(Объект.ФайлКартинки.ФайлХранилище.Получить(), УникальныйИдентификатор);
		
	КонецЕсли;
	
	СтараяПлощадьПотолка = Объект.Потолок_КоличествоПродукция;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	КонтрольЗаполненияРеквизитов.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	Элементы.СтраницаКратность.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольКратностиЕдиницИзмерения");
	
	Файлы.Параметры.УстановитьЗначениеПараметра("ВладелецФайла", Объект.Ссылка);
	
	ОбновитьВычисляемыеПоляПараметровПродукцииСервер(); 
	
	//nva+++
	НаборРГМинимальныеОстатки = ДанныеФормыВЗначение(МинимальныеОстатки, Тип("РегистрСведенийНаборЗаписей.МинимальныеОстаткиНоменклатуры"));
    НаборРГМинимальныеОстатки.Отбор.Номенклатура.Использование = Истина;
    НаборРГМинимальныеОстатки.Отбор.Номенклатура.ВидСравнения = ВидСравнения.Равно;
    НаборРГМинимальныеОстатки.Отбор.Номенклатура.Значение = Объект.Ссылка;
    НаборРГМинимальныеОстатки.Прочитать();   
    ЗначениеВДанныеФормы(НаборРГМинимальныеОстатки,МинимальныеОстатки);
	//nva---	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПрежнееНаименование = Объект.Наименование; // №12909
	мВидПродукции = Объект.ВидПродукции;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	КонтрольЗаполненияРеквизитов.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Объект, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Если НЕ Объект.ОсновнаяСпецификация.Пустая() Тогда
	//	Если НЕ Объект.ОсновнаяСпецификация.Владелец = Объект.Ссылка Тогда
	//		Сообщить("В карточке номенклатуры необходимо перевыбрать основную спецификацию");
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	//++ №7722 комментируем, т.к. изменен принцип обработки выбранного основного файла и теперь изображения хранятся в справочнике
	//Врем = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	//ТекущийОбъект.Фото = Врем;
	//-- №7722
	
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//++ Латыпов Р.Р. 2023-03-13  №14456
	// проверка номенклатуры на значение реквизита "Архивная"
	СписокСпецификаций = СодержитсяВСпецификациях();
	Если СписокСпецификаций <> "" И СписокСпецификаций <> Неопределено Тогда // Требуется разрешение на запись
		// Проверка разрешения на запись
		Если НЕ ПараметрыЗаписи.Свойство("ОтказЗаписи") Тогда
			ДиалогСВопросом("ВНИМАНИЕ!" + Символы.ПС +  "Данная номенклатура используется в следующих спецификациях:" + Символы.ПС + Символы.ПС + СписокСпецификаций + Символы.ПС);
			Отказ=Истина; // Отказ, так как запись не подверждена
		Иначе 
			Отказ=ПараметрыЗаписи.ОтказЗаписи; // Устанавливаем статус записи
		КонецЕсли;
	КонецЕсли;
	//-- Латыпов Р.Р. 2023-03-13  №14456
	
	//nva+++
	МассивСкладов = Новый Массив;
	Если НЕ Отказ Тогда
		Для Каждого СтрокаЯчейки Из Объект.СкладскиеЯчейки Цикл
			Если МассивСкладов.Найти(СтрокаЯчейки.Склад) = Неопределено Тогда 
				МассивСкладов.Добавить(СтрокаЯчейки.Склад);
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю("Имеются повторяющиеся склады в ""Складских ячейках""!",Объект.Ссылка,"СкладскиеЯчейки",,Отказ); 
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	//nva---
КонецПроцедуры

&НаКлиенте
Процедура ДиалогСВопросом(ТестВопроса)
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект); 
    ПоказатьВопрос(Оповещение,ТестВопроса, РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да,"Сохранить номенклатуру с признаком АРХИВНЫЙ?");    
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    ПараметрыЗаписи=Новый Структура;
    ПараметрыЗаписи.Вставить("ОтказЗаписи", ?(Результат = КодВозвратаДиалога.Да, Ложь, Истина));
    Записать(ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// №7722 по новому пишем вырбанную картинку
	Если ЗначениеЗаполнено(ДанныеФайлаКартинки) Тогда
		
		ПрисоединенныйФайл = Справочники.НоменклатураПрисоединенныеФайлы.ПустаяСсылка();
		Если ОбщийМодульВызовСервера.СохранитьПрикрепленныеДанные(Объект.Ссылка, ДанныеФайлаКартинки.ИмяБезРасширения, ДанныеФайлаКартинки.Расширение, ОбщийМодуль.Сериализовать(ПолучитьИзВременногоХранилища(Фото)), новый Структура("НоменклатураПрисоединенныеФайлы", Истина), ПрисоединенныйФайл) Тогда
			ТекущийОбъект.ФайлКартинки = ПрисоединенныйФайл;
		КонецЕсли;
		
		ДанныеФайлаКартинки = Неопределено;
		
		ТекущийОбъект.Записать();
		Прочитать();
		
	КонецЕсли;
	
	Файлы.Параметры.УстановитьЗначениеПараметра("ВладелецФайла", Объект.Ссылка);
	
	УправлениеФормой();
	
	ОбновитьВычисляемыеПоляПараметровПродукцииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если НЕ СтараяПлощадьПотолка = Объект.Потолок_КоличествоПродукция Тогда
		Парам = Новый Структура;
		Парам.Вставить("Номенклатура", Объект.Ссылка);
		Парам.Вставить("НоваяПлощадьПотолка", Объект.Потолок_КоличествоПродукция);
		Оповестить("ИзменениеПлощадиПотолкаВКарточкеНоменклатуры", Парам, "Номенклатура");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмениласьОсновнаяСпецификация" и Источник = "СпецификацииНоменклатуры" Тогда
		Прочитать();
		// №7722 назначение основного изображения теперь происходит через оповещение
		// форма, которая оповещает блокирует весь интерфейс, поэтому без проверки на владельца
	ИначеЕсли ИмяСобытия = "УстановкаОсновногоИзображенияТовара" Тогда
		Фото = УстановитьОсновноеИзображениеНоменклатуры(Параметр);
		Модифицированность = Истина;
		
		//++ №9160
		ОбновитьСписокИзображений();
		ОбновитьНадписьТекущегоИзображения();
		//-- №9160
		
	//++ #16971
	ИначеЕсли ИмяСобытия = "Запись_ВидыПродукции" И Источник = Объект.ВидПродукции Тогда
		ОбновитьПараметрыПродукцииКлиент();
	//-- #16971
	
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	ВидНоменклатурыПриИзмененииНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ВидНоменклатурыПриИзмененииНаСервере()	
	
	УправлениеФормой();
	КонтрольЗаполненияРеквизитов.ПриИзмененииВлияющихРеквизитов(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	ОбновитьЭлементыДополнительныхРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//++ 15627 2023-04-04
&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Объект не сохранен!");
		Возврат;
	КонецЕсли;
	
	СсылкаНаОбъект = Объект.Ссылка;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаВРегистрЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ДействиеПослеПрикрепления", ОписаниеОповещения);
	
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(СсылкаНаОбъект, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрикрепленияФайлаВРегистрЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
	Если СтруктураРезультата.Результат Тогда
		Элементы.Файлы.Обновить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
	// Ищем расширение Файла из полного имени файла
	МС = СтрРазделить(ТекущиеДанные.ПолноеИмяФайла, ".", Ложь);
	Расширение = МС[МС.Количество()-1];
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		АдресФайла = ПолучитьДанные(ТекущиеДанные.СсылкаНаОбъект, ТекущиеДанные.ИмяФайла);
		Если НЕ АдресФайла = Неопределено Тогда // №7253
			ВременноеИмя = ПолучитьИмяВременногоФайла(Расширение);
	    	ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные(СсылкаНаОбъект, ИмяФайла)
	Возврат ОбщийМодульВызовСервера.ПолучитьДанныеФайла(СсылкаНаОбъект, ИмяФайла,, ЭтаФорма.УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Файлы.Обновить();
КонецПроцедуры

//-- 15627 2023-04-04


&НаКлиенте
Процедура ВыполнитьОтчет1(Команда)	
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
	Новый Структура("Номенклатура", СформироватьМассивСсылок()), 
	"ВедомостьПоТоварамНаСкладах", 
	Истина);
	
	ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладах.Форма", 
	ПараметрыФормы, 
	ЭтаФорма, 
	Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтчет2(Команда)
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
	Новый Структура("Номенклатура", СформироватьМассивСсылок()), 
	"ВедомостьПоТоварамНаСкладахССебестоимостью", 
	Истина);
	
	ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладахССебестоимостью.Форма", 
	ПараметрыФормы, 
	ЭтаФорма, 
	Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеФайлаИмпорта(Команда)
	
	Парам = Новый Структура;
	Парам.Вставить("ДанныеФайлаИмпорта",Объект.Потолок_ДанныеФайлаИмпорта);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаДанныхИмпорта",Парам);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзДанныхФайлаИмпорта(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Номенклатуру необходимо предварительно записать");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Потолок_ДанныеФайлаИмпорта) Тогда
		Сообщить("Данные файла импорта не заполнены");
		Возврат;
	КонецЕсли;
	
	ОбновитьИзДанныхФайлаИмпортаНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзДанныхФайлаИмпортаНаСервере()
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");	
	ОбменСEasyCeiling.ОбновитьКарточкуНоменклатурыИзДанныхФайлаИмпорта(ОбъектФормы, Объект.Ссылка);
	ЗначениеВРеквизитФормы(ОбъектФормы, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзПостроителя(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Номенклатуру необходимо предварительно записать");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзПостроителяПослеВыбораФайлов", ЭтотОбъект);
	ОбщийМодульКлиент.ВыборФайловПостроителя(ЭтаФорма, Оповещение, Ложь, Истина);
	
КонецПроцедуры

// #14463
&НаКлиенте
Процедура НайтиСсылки(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаменяемыеЗначения = Новый Массив;
	ЗаменяемыеЗначения.Добавить(Новый Структура("ЧтоЗаменять, НаЧтоЗаменять", 
	Объект.Ссылка, 
	ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка")));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаменяемыеЗначения", ЗаменяемыеЗначения);
	ПараметрыФормы.Вставить("НайтиСсылкиПриОткрытии", Истина);
	ОткрытьФорму("Обработка.ПоискИЗаменаЗначений.Форма", ПараметрыФормы, , Новый УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ВкладкаПродукция

&НаКлиенте
Процедура ВидПродукцииПриИзменении(Элемент)
	
	Если Объект.ПараметрыПродукции.Количество() = 0 Тогда
		ВидПродукцииПриИзмененииСервер();
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВидПродукцииПриИзмененииЗавершение", ЭтотОбъект); 
	ТекстВопроса = "Таблица параметров продукции будет очищена. Продолжить?";
    ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВидПродукцииПриИзмененииСервер();
	Иначе
		Объект.ВидПродукции = мВидПродукции;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииПриИзмененииСервер()
	
	мВидПродукции = Объект.ВидПродукции;
	
	Объект.ПараметрыПродукции.Очистить();
	
	Если Не ЗначениеЗаполнено(Объект.ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПараметрыПродукции.Загрузить(Объект.ВидПродукции.УчитываемыеПараметрыПродукции.Выгрузить());
	
	ОбновитьВычисляемыеПоляПараметровПродукцииСервер();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродукцииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродукцииПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродукцииПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ПараметрыПродукции.ТекущиеДанные;
	ОписаниеТ = ТипПараметра(ТекущиеДанные.ПараметрПродукции);
	Элементы.ПараметрыПродукцииЗначение.ОграничениеТипа = ОписаниеТ;
	
КонецПроцедуры

&НаСерверебезКонтекста
Функция ТипПараметра(Параметр)

	Возврат Параметр.ТипЗначения;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПараметрыПродукцииКлиент()
	
	ОбновитьПараметрыПродукцииНаСервере();
	ОбновитьВычисляемыеПоляПараметровПродукцииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыПродукцииНаСервере()
		
	Если Не ЗначениеЗаполнено(Объект.ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеПараметрыПродукции = Объект.ПараметрыПродукции.Выгрузить();
	ТекущийМассивПараметров = ТекущиеПараметрыПродукции.ВыгрузитьКолонку("ПараметрПродукции");
	
	Объект.ПараметрыПродукции.Загрузить(Объект.ВидПродукции.УчитываемыеПараметрыПродукции.Выгрузить());
	ЕстьИзменения = НЕ Объект.ПараметрыПродукции.Количество() = ТекущиеПараметрыПродукции.Количество();
	
	Для каждого СтрокаТЧ из Объект.ПараметрыПродукции Цикл
		СтрокаТЗ = ТекущиеПараметрыПродукции.Найти(СтрокаТЧ.ПараметрПродукции, "ПараметрПродукции");
		Если СтрокаТЗ = Неопределено Тогда
			ЕстьИзменения = Истина;	
		Иначе
			СтрокаТЧ.Значение = СтрокаТЗ.Значение;	
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВычисляемыеПоляПараметровПродукцииСервер()
		
	Для каждого СтрокаТЧ из Объект.ПараметрыПродукции Цикл
		КЧ = СтрокаТЧ.ПараметрПродукции.ТипЗначения.КвалификаторыЧисла;
		Если КЧ.Разрядность > 0 Тогда
			СтрокаТЧ.Точность = КЧ.РазрядностьДробнойЧасти;
		Иначе
			СтрокаТЧ.Точность = -1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВкладкаКратность

&НаКлиенте
Процедура КратностьЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(Объект.Ссылка);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьНазваниеМесяца(НомерМесяца) 
	
	Результат = "";
	
	Если НомерМесяца = 1 Тогда
		Результат = "Январь";
	ИначеЕсли НомерМесяца = 2 Тогда
		Результат = "Февраль";
	ИначеЕсли НомерМесяца = 3 Тогда
		Результат = "Март";
	ИначеЕсли НомерМесяца = 4 Тогда
		Результат = "Апрель";
	ИначеЕсли НомерМесяца = 5 Тогда
		Результат = "Май";
	ИначеЕсли НомерМесяца = 6 Тогда
		Результат = "Июнь";
	ИначеЕсли НомерМесяца = 7 Тогда
		Результат = "Июль";
	ИначеЕсли НомерМесяца = 8 Тогда
		Результат = "Август";
	ИначеЕсли НомерМесяца = 9 Тогда
		Результат = "Сентябрь";
	ИначеЕсли НомерМесяца = 10 Тогда
		Результат = "Октябрь";
	ИначеЕсли НомерМесяца = 11 Тогда
		Результат = "Ноябрь";
	ИначеЕсли НомерМесяца = 12 Тогда
		Результат = "Декабрь";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПолучитьДанныеПоЗакупкамИПостроитьГрафик()
	
	//Если Элементы.ГруппаДанныеПоЗакупкам.Видимость Тогда
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЗакупки Тогда
		
		ДокументыЗакупок.Очистить();
		
		//собираем данные
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("Год", Новый ОписаниеТипов("число"));
		ТаблицаДанных.Колонки.Добавить("НомерМесяца", Новый ОписаниеТипов("число"));
		ТаблицаДанных.Колонки.Добавить("КоличествоОборот", Новый ОписаниеТипов("число"));
		ТаблицаДанных.Колонки.Добавить("СуммаОборот", Новый ОписаниеТипов("число"));
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗакупкиОбороты.Регистратор КАК Ссылка,
		|	ЗакупкиОбороты.Контрагент КАК Поставщик,
		|	ЗакупкиОбороты.КоличествоОборот,
		|	ЗакупкиОбороты.СуммаОборот,
		|	ЗакупкиОбороты.Период КАК Дата,
		|	ВЫБОР
		|		КОГДА ЗакупкиОбороты.КоличествоОборот <> 0
		|			ТОГДА ЗакупкиОбороты.СуммаОборот / ЗакупкиОбороты.КоличествоОборот
		|		ИНАЧЕ ЗакупкиОбороты.СуммаОборот
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	РегистрНакопления.Закупки.Обороты(, , Регистратор, 
		|		Номенклатура = &Номенклатура
		//++ №9914
		|		И ВЫБОР
		|			КОГДА &Организация = Значение(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Организация = &Организация
		|		КОНЕЦ
		//-- №9914
		|	) КАК ЗакупкиОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		Запрос.УстановитьПараметр("Номенклатура",Объект.Ссылка);
		Запрос.УстановитьПараметр("Организация", ОтборОрганизация); //++ №9914
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ДокументыЗакупок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			НоваяСтрока = ТаблицаДанных.Добавить();
			НоваяСтрока.Год = Год(Выборка.Дата);
			НоваяСтрока.НомерМесяца = Месяц(Выборка.Дата);
			НоваяСтрока.КоличествоОборот = Выборка.КоличествоОборот;
			НоваяСтрока.СуммаОборот = Выборка.СуммаОборот;
		КонецЦикла;
		
		ТаблицаДанных.Свернуть("Год, НомерМесяца","КоличествоОборот, СуммаОборот");
		ТаблицаДанных.Колонки.Добавить("Цена");
		Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл
			Если НЕ ТекущаяСтрока.КоличествоОборот = 0 Тогда
				ТекущаяСтрока.Цена = Окр(ТекущаяСтрока.СуммаОборот / ТекущаяСтрока.КоличествоОборот,2);
			КонецЕсли;
		КонецЦикла;
		
		//строим диаграмму
		
		Диаграмма = ДиаграммаЗакупочныхЦен;
		Диаграмма.Очистить();
		
		Диаграмма.Обновление = Ложь;
		
		Диаграмма.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
		Диаграмма.ОтображатьЛегенду = Ложь;
		
		Серия1 = Диаграмма.Серии.Добавить("СредняяЦена");
		Если Выборка.Количество() = 0 Тогда
			Серия1.Цвет = Новый Цвет(192, 192, 192);
			Диаграмма.Точки.Добавить("Январь");
			Диаграмма.Точки.Добавить("Февраль");
			Диаграмма.Точки.Добавить("Март");
			Диаграмма.Точки.Добавить("Апрель");
			Диаграмма.Точки.Добавить("Май");
			Диаграмма.Точки.Добавить("Июнь");
			Диаграмма.Точки.Добавить("Июль");
			Диаграмма.Точки.Добавить("Август");
			Диаграмма.Точки.Добавить("Сентябрь");
			Диаграмма.Точки.Добавить("Октябрь");
			Диаграмма.Точки.Добавить("Ноябрь");
			Диаграмма.Точки.Добавить("Декабрь");
		Иначе
			Диаграмма.ОтображатьЗаголовок = Ложь;
			ВсегоСтрок = ТаблицаДанных.Количество();
			Если ВсегоСтрок > 12 Тогда
				ВсегоСтрок = 12;
			КонецЕсли;
			ТекущаяСтрока = ВсегоСтрок;
			Для НомерСтроки=0 По ВсегоСтрок-1 Цикл
				Точка = Диаграмма.Точки.Добавить(ПолучитьНазваниеМесяца(ТаблицаДанных[ТекущаяСтрока-1].НомерМесяца) + " " +  СтрЗаменить(ТаблицаДанных[ТекущаяСтрока-1].Год,Символ(160),""));
				Диаграмма.УстановитьЗначение(Точка, Серия1,ТаблицаДанных[ТекущаяСтрока-1].Цена,, " ");
				ТекущаяСтрока = ТекущаяСтрока - 1;
			КонецЦикла;
		КонецЕсли;
		Серия1.Маркер = ТипМаркераДиаграммы.Нет;
		
		Диаграмма.Обновление = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФотоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//++ №7722 комментируем, т.к. поменялся принцип
	//АдресФайла = ОткрытьФотоНаСервере();
	//Если Не АдресФайла = Неопределено Тогда
	//	ПолучитьФайл(АдресФайла, СокрЛП(Объект.Наименование) + ".jpg");
	//Иначе
	//	Если Вопрос("Изображение отсутствует. Загрузить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	//		ИзменитьФото(Неопределено);
	//	КонецЕсли;
	//КонецЕсли;
	//-- №7722
	
	// №7722 по новому
	ДобавитьИзображениеНаКлиенте();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(Данные, ИдентификаторФормы)
	Хранилище = Новый ХранилищеЗначения(Данные);
	АдресКартинки = ПоместитьВоВременноеХранилище(Хранилище.Получить(), ИдентификаторФормы);
	Возврат АдресКартинки;
КонецФункции

&НаКлиенте
Процедура ДобавитьОсновноеИзображение(Команда)
	
	//++ №7722 комментируем, т.к. поменялся принцип
	//Режим = РежимДиалогаВыбораФайла.Открытие;
	//ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	//ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	//ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	//ДиалогОткрытияФайла.Фильтр = "Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
	//	                            //+ "|Все файлы(*.*)|*.*" №7722 разрешено прикреплять только картинки
	//	                            + "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
	//	                            + "|Формат GIF(*.gif*)|*.gif"
	//	                            + "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
	//	                            + "|Формат PNG(*.png*)|*.png"
	//	                            + "|Формат TIFF(*.tif)|*.tif"
	//	                            + "|Формат icon(*.ico)|*.ico"
	//	                            + "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf";
	//ДиалогОткрытияФайла.Заголовок = "Выберите изображение";
	//Если ДиалогОткрытияФайла.Выбрать() Тогда
	//	МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
	//	Для Каждого ИмяФайла Из МассивФайлов Цикл
	//		Попытка
	//			Фото = НавигационнаяСсылкаКартинки(Новый ДвоичныеДанные(ИмяФайла), УникальныйИдентификатор);
	//		Исключение
	//			Сообщить("Не удалось прикрепить изображение! " + ОписаниеОшибки(), СтатусСообщения.Важное);
	//		КонецПопытки;
	//	КонецЦикла;
	//Иначе
	//	ПоказатьПредупреждение(, "Изображение не выбрано!");
	//КонецЕсли;
	//-- №7722
	
	// №7722 по новому
	ДобавитьИзображениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыЗакупокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПараметрыНовойФормы = Новый Структура("Ключ",Элементы.ДокументыЗакупок.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Документ.ПоступлениеТоваровИУслуг.Форма.ФормаДокумента",ПараметрыНовойФормы);
КонецПроцедуры

&НаКлиенте
Процедура НадписьДанныеПоЗакупкамНажатие(Элемент)
	Элементы.ГруппаДанныеПоЗакупкам.Видимость = НЕ Элементы.ГруппаДанныеПоЗакупкам.Видимость;
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура Потолок_МногфактурныйПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УправлениеФормой();
	
	//++ #16971
	Если ТекущаяСтраница.Имя = "СтраницаПродукция" Тогда
		ОбновитьПараметрыПродукцииКлиент();		
	КонецЕсли;
	//-- #16971
	
	// СтандартныеПодсистемы.Свойства
	Если ТекущаяСтраница.Имя = "ГруппаДополнительныеРеквизиты"
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);		
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Функция СформироватьМассивСсылок()
	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(Объект.Ссылка);
	Возврат МассивНоменклатуры;
КонецФункции

&НаКлиенте
Процедура ДанныеПотолкаИзмененыПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
		
	//
	Для Индекс = 0 По 7 Цикл
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПараметрыПродукцииЗначение.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПараметрыПродукции.Точность");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Индекс;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Формат", СтрШаблон("ЧДЦ=%1", Формат(Индекс, "ЧГ=")));		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Если Параметры.Ключ.Пустая() Тогда
		Элементы.АльтернативнаяЕдиницаИзмерения.Доступность = Ложь;
	Иначе
		Элементы.АльтернативнаяЕдиницаИзмерения.Доступность = Истина;
	КонецЕсли;	
	
	Если (Объект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок)
		или (Объект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез)
		или (Объект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ТиповойОтрез) Тогда
		Элементы.ГруппаПотолок.Видимость = Истина;
	Иначе
		Элементы.ГруппаПотолок.Видимость = Ложь;
	КонецЕсли;
		
	//данные по закупкам
	ПолучитьДанныеПоЗакупкамИПостроитьГрафик();
	
	Если Константы.ВсяНоменклатураПоУмолчаниюВСреднемЧеке.Получить() Тогда
		Элементы.УчитыватьВСреднемЧеке.Заголовок = "НЕ учитывать в среднем чеке";
	Иначе
		Элементы.УчитыватьВСреднемЧеке.Заголовок = "Учитывать в среднем чеке";
	КонецЕсли;
	
	Если Объект.ДанныеПотолкаИзменены Тогда
		Элементы.ГруппаХарактеристикиПотолка.ТолькоПросмотр = Ложь;
		Элементы.ДанныеПотолкаИзменены.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ГруппаХарактеристикиПотолка.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ГруппаДоходовРасходов.Видимость = ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов;
	
	// №7722 определенные кнопки для работы с изображениями
	Элементы.ВыбратьИзображениеИзПрикрепленныхФайлов.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	
	Элементы.ШиринаПолотна.Видимость = (Объект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно); // №8266
	
	// #6265
	Если Объект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
		Элементы.СтраницаПродукция.Видимость = Истина;
		ЭтоУникальнаяПродукция = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидПродукции, "УникальнаяПродукция");
		//ЭтоУникальнаяПродукция = Неопределено, если   Объект.ВидПродукции - пустой
		Элементы.ГруппаДанныеПродукции.Видимость = (ЭтоУникальнаяПродукция = Истина);
		Элементы.ГруппаПараметрыПродукции.Видимость = (ЭтоУникальнаяПродукция = Ложь);
	Иначе
		Элементы.СтраницаПродукция.Видимость = Ложь;
	КонецЕсли;
	
	// №13889 заголовок вкладки "Потолок"
	Элементы.ГруппаПотолок.Заголовок = ?(Объект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез, "Отрез", "Потолок");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзПостроителяПослеВыбораФайлов(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранноеИмяФайла = ВыбранныеФайлы[0];
	
	//СписокПутейКФайлам = Новый СписокЗначений;
	СписокПутейКФайламКУдалению = Новый СписокЗначений;
	СписокДвоичныхДанныхФайлов = Новый СписокЗначений;
	
	СтруктураФайла = ОбменСПостроителемКлиентСервер.ПрочитатьФайлПостроителя(ВыбранноеИмяФайла);	
	ОбменСПостроителемКлиентСервер.СформироватьСписокПутейКФайлам(СтруктураФайла, СписокПутейКФайламКУдалению, СписокДвоичныхДанныхФайлов);
	
	Если НЕ ОбработатьВыборФайлаEasyCeilingНаСервере(СтруктураФайла, СписокДвоичныхДанныхФайлов) = Неопределено Тогда
		Состояние("Данные загружены");
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьВыборФайлаEasyCeilingНаСервере(СтруктураФайла, СписокДвоичныхДанныхФайлов)
	
	//Об = РеквизитФормыВЗначение("Объект");        	
	Результат = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(СтруктураФайла, СписокДвоичныхДанныхФайлов, Объект, Ложь);
	Если НЕ Результат = Неопределено Тогда
		//#12982
		//Если Объект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок Тогда
		//	Объект.Наименование = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(
		//									Объект.Потолок_НомерРасчета, Объект.Потолок_МатериалЦвет, Объект.Потолок_МатериалМатериал,
		//									?(Объект.Потолок_Фактура.Количество() > 1, Истина, Ложь), 
		//									?(Объект.Потолок_ПлощадьФотопечати > 0, Истина, Ложь),Объект.Потолок_ШиринаПолотна);
		//ИначеЕсли Объект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез Тогда
		//	Объект.Наименование = ОбменСEasyCeiling.ПолучитьНаименованиеОтреза(Объект.Потолок_НомерРасчета, Объект.Потолок_МатериалЦвет, Объект.Потолок_МатериалМатериал);
		////ИначеЕсли Объект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ТиповойОтрез Тогда
		////	Объект.Наименование = ОбменСEasyCeiling.ПолучитьНаименованиеТиповогоОтреза(Объект.Потолок_НомерРасчета, Объект.Потолок_МатериалЦвет, Объект.Потолок_МатериалМатериал);
		//КонецЕсли;
		
		Если Объект.Потолок_Фактура.Количество() > 0 Тогда
			ДанныеФактуры = Объект.Потолок_Фактура[0];
			Если Объект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок Тогда
				Объект.Наименование = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(
				Объект.Потолок_НомерРасчета, ДанныеФактуры.Фактура_МатериалЦвет, ДанныеФактуры.Фактура_МатериалМатериал,
				?(Объект.Потолок_Фактура.Количество() > 1, Истина, Ложь), 
				?(Объект.Потолок_ПлощадьФотопечати > 0, Истина, Ложь),ДанныеФактуры.Фактура_ШиринаПолотна);
			ИначеЕсли Объект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез Тогда
				Объект.Наименование = ОбменСEasyCeiling.ПолучитьНаименованиеОтреза(Объект.Потолок_НомерРасчета, ДанныеФактуры.Фактура_МатериалЦвет, ДанныеФактуры.Фактура_МатериалМатериал);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	//ЗначениеВРеквизитФормы(Об, "Объект");
	Возврат Результат;	
	
КонецФункции

&НаСервере
Функция СодержитсяВСпецификациях()
	Если Объект.Архивная Тогда
		СписокСпецификаций = "";
		ОбъектСохраненный = Объект.Ссылка.ПолучитьОбъект();
		Если НЕ ОбъектСохраненный.Архивная Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СпецификацииСостав.Номенклатура КАК Номенклатура,
			|	СпецификацииСостав.Ссылка.Владелец КАК Владелец,
			|	СпецификацииСостав.Ссылка.ВидСпецификации КАК ВидСпецификации,
			|	СпецификацииСостав.Ссылка.Наименование КАК НаименованиеСпецификации
			|ИЗ
			|	Справочник.Спецификации.Состав КАК СпецификацииСостав
			|ГДЕ
			|	СпецификацииСостав.Номенклатура = &Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВидСпецификации";
			Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			
			// Формируем список спецификаций
			Пока Выборка.Следующий() Цикл
				СписокСпецификаций = СписокСпецификаций + "- " + Выборка.Владелец + ", " + Выборка.ВидСпецификации + ": " + Выборка.НаименованиеСпецификации + Символы.ПС;
			КонецЦикла;
			СписокСпецификаций = СтрЗаменить(СписокСпецификаций," ", Символы.НПП);
			Возврат СписокСпецификаций; 
		КонецЕсли;	
	КонецЕсли;
КонецФункции	

#КонецОбласти

&НаКлиенте
Процедура ВыбратьИзображениеИзПрикрепленныхФайлов(Команда)
	
	ОП = Новый ОписаниеОповещения("ВыбратьИзображениеИзПрикрепленныхФайловЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.НоменклатураПрисоединенныеФайлы.Форма.ПрисоединенныеФайлы", новый Структура("ВладелецФайла, ОсновноеИзображение", Объект.Ссылка, Объект.ФайлКартинки),,,,, ОП, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзображениеИзПрикрепленныхФайловЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("ДанныеФормыСтруктура") Тогда
		Фото = УстановитьОсновноеИзображениеНоменклатуры(Результат.Ссылка);
		Модифицированность = Истина;
	КонецЕсли;
	
	//++ №9160
	ОбновитьСписокИзображений();
	ОбновитьНадписьТекущегоИзображения();
	//-- №9160
	
КонецПроцедуры

&НаСервере
Функция УстановитьОсновноеИзображениеНоменклатуры(СсылкаНаИзображение)
	
	Объект.ФайлКартинки = СсылкаНаИзображение;
	ТекущееИзображение = Объект.ФайлКартинки; //++ №9160
	
	Возврат ПоместитьВоВременноеХранилище(СсылкаНаИзображение.ФайлХранилище.Получить(), ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОчиститьИзображение(Команда)
	
	Объект.ФайлКартинки = ПредопределенноеЗначение("Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка");
	Фото = "";
	ДанныеФайлаКартинки = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиенте()
	
	Перем ИдентификаторФайла;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбораФайла.Фильтр = ОбщийМодульКлиентСервер.ФильтрФайловИзображений();
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
		"ДобавлениеФайлаДиалогЗавершение",
		ЭтотОбъект,
		Новый Структура("ИмяРеквизита", "ДанныеФайлаКартинки"));
		
		ДиалогВыбораФайла.Показать(ОписаниеОповещения);
		
	Иначе
		
		ПрисоединенныйФайл = ПредопределенноеЗначение("Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
		ДопПараметры = Новый Структура("ТолькоИзображения, НоменклатураПрисоединенныеФайлы, ВыводитьСообщенияПриУспешномРезультате, ДействиеПослеПрикрепления", 
		Истина, Истина, Ложь, ОписаниеОповещения);
		ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(Объект.Ссылка, ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрикрепленияФайлаЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРезультата.Результат Тогда
		//++ №9160 проверка того, что основное фото ещё не установлено
		Если Объект.ФайлКартинки.Пустая() И СтруктураРезультата.ПрисоединенныеФайлы.Количество() > 0 Тогда			 
			Фото = УстановитьОсновноеИзображениеНоменклатуры( СтруктураРезультата.ПрисоединенныеФайлы[0]);
			Модифицированность = Истина;
			//++ №9160 покажем пользователю, что изображения успешно были добавлены
		Иначе
			ПоказатьОповещениеПользователя("Изображения добавлены.");
		КонецЕсли;
		
		ОбновитьСписокИзображений();
		ОбновитьНадписьТекущегоИзображения();
		//-- №9160
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеФайлаДиалогЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = ВыбранныеФайлы[0];
	ДополнительныеПараметры.Вставить("ИмяФайла", ИмяФайла);
	
	ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита] =
	Новый Структура("ИмяБезРасширения, Расширение, ВремяИзменения, УниверсальноеВремяИзменения");
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ДобавлениеФайлаИнициализацияФайла",
	ЭтотОбъект,
	ДополнительныеПараметры);
	
	Файл = Новый Файл;
	Файл.НачатьИнициализацию(ОписаниеОповещения, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеФайлаИнициализацияФайла(Файл, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Вставить("Файл", Файл);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ДобавлениеФайлаСуществованияФайла",
	ЭтотОбъект,
	ДополнительныеПараметры);
	
	ДополнительныеПараметры.Файл.НачатьПроверкуСуществования(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеФайлаСуществованияФайла(Существует, ДополнительныеПараметры) Экспорт
	
	Если НЕ Существует Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Файл не найден'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита], ДополнительныеПараметры.Файл);
	
	ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита].Расширение =
	СтрЗаменить(ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита].Расширение, ".", "");
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ДобавлениеФайлаПолучениеВремениИзменения",
	ЭтотОбъект,
	ДополнительныеПараметры);
	
	ДополнительныеПараметры.Файл.НачатьПолучениеВремениИзменения(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеФайлаПолучениеВремениИзменения(ВремяИзменения, ДополнительныеПараметры) Экспорт
	
	ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита].ВремяИзменения = ВремяИзменения;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ДобавлениеФайлаПолучениеУниверсальногоВремениИзменения",
	ЭтотОбъект,
	ДополнительныеПараметры);
	
	ДополнительныеПараметры.Файл.НачатьПолучениеУниверсальногоВремениИзменения(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеФайлаПолучениеУниверсальногоВремениИзменения(ВремяИзменения, ДополнительныеПараметры) Экспорт
	
	ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита].УниверсальноеВремяИзменения = ВремяИзменения;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ДополнительныеПараметры.ИмяФайла);
	АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	Фото = АдресФайлаВХранилище;
	
КонецПроцедуры

//++ №9160
&НаСервере
Процедура ОбновитьСписокИзображений()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатураПрисоединенныеФайлы.Ссылка
	|ИЗ
	|	Справочник.НоменклатураПрисоединенныеФайлы КАК СправочникНоменклатураПрисоединенныеФайлы
	|ГДЕ
	|	СправочникНоменклатураПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|
	|УПОРЯДОЧИТЬ ПО
	|	СправочникНоменклатураПрисоединенныеФайлы.ДатаСоздания";
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	СписокИзображений.Очистить();
	СписокИзображений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьТекущегоИзображения()
	
	Элементы.ДекорацияИзображение.Заголовок = "";
	Элементы.ОсновноеИзображение.Доступность = Ложь;
	
	Если Не ТекущееИзображение.Пустая() Тогда
		
		Элементы.ДекорацияИзображение.Заголовок = СтрШаблон("%1 (%2 из %3)", ТекущееИзображение.Наименование, СписокИзображений.Индекс(СписокИзображений.НайтиПоЗначению(ТекущееИзображение))+1, СписокИзображений.Количество());
		Фото = ПоместитьВоВременноеХранилище(ТекущееИзображение.ФайлХранилище.Получить(), УникальныйИдентификатор);
		
		ОсновноеИзображение = (ТекущееИзображение = Объект.ФайлКартинки);
		Элементы.ОсновноеИзображение.Доступность = НЕ ОсновноеИзображение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СледующееИзображение(Команда)
	
	Если НЕ ТекущееИзображение.Пустая() Тогда
		
		НомерТекущего = СписокИзображений.Индекс(СписокИзображений.НайтиПоЗначению(ТекущееИзображение))+1;
		НовыйНомер = Мин(НомерТекущего+1, СписокИзображений.Количество());
		ТекущееИзображение = СписокИзображений.Получить(НовыйНомер-1).Значение;
		
		ОбновитьНадписьТекущегоИзображения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущееИзображение(Команда)
	
	Если НЕ ТекущееИзображение.Пустая() Тогда
		
		НомерТекущего = СписокИзображений.Индекс(СписокИзображений.НайтиПоЗначению(ТекущееИзображение))+1;
		НовыйНомер = Макс(НомерТекущего-1, 1);
		ТекущееИзображение = СписокИзображений.Получить(НовыйНомер-1).Значение;
		
		ОбновитьНадписьТекущегоИзображения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеИзображениеПриИзменении(Элемент)
	
	Если Не ТекущееИзображение.Пустая() Тогда
		Объект.ФайлКартинки = ТекущееИзображение;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры
//-- №9160

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

//++ №12909
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	// "Наименование для печати" = "Наименование", если:
	//	- создается новая карточка номенклатуры
	//	- при редактировании существующей карточки, до редактирования наименование для печати было как наименование
	Если Объект.Ссылка.Пустая() Или (НЕ Объект.Ссылка.Пустая() И ПрежнееНаименование = Объект.НаименованиеДляПечати) Тогда
		Объект.НаименованиеДляПечати = Объект.Наименование;
	КонецЕсли;
	
	ПрежнееНаименование = Объект.Наименование;
	
КонецПроцедуры

&НаСервере
Процедура МинимальныеОстаткиПриИзмененииНаСервере(ТекДанные)

    Запись = РегистрыСведений.МинимальныеОстаткиНоменклатуры.СоздатьМенеджерЗаписи();
    Запись.Склад = ТекДанные.Склад;
    Запись.Номенклатура = Объект.Ссылка;
    Запись.ХарактеристикаНоменклатуры = ТекДанные.ХарактеристикаНоменклатуры;
	//Запись.Прочитать();
	//Если Запись.Выбран() Тогда
    	Запись.Количество = ТекДанные.Количество;
		Запись.КоличествоМаксимум = ТекДанные.КоличествоМаксимум;
    	Запись.Записать(
        Истина // Удалим старые записи и запишем вместо них новые.
    	);
	//Иначе	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МинимальныеОстаткиПриИзменении(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ТекДанныеСтруктура = Новый Структура("Количество, КоличествоМаксимум, Склад, ХарактеристикаНоменклатуры",
		Элемент.ТекущиеДанные.Количество, Элемент.ТекущиеДанные.КоличествоМаксимум, Элемент.ТекущиеДанные.Склад,Элемент.ТекущиеДанные.ХарактеристикаНоменклатуры);
		Если ЗначениеЗаполнено(ТекДанныеСтруктура.Склад) Тогда
			МинимальныеОстаткиПриИзмененииНаСервере(ТекДанныеСтруктура);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура МинимальныеОстаткиУдалитьЗаписьНаСервере(ТекДанные)

	НаборЗаписей = РегистрыСведений.МинимальныеОстаткиНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Объект.Ссылка);
	НаборЗаписей.Отбор.Склад.Установить(ТекДанные.Склад);
	НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(ТекДанные.ХарактеристикаНоменклатуры);
	НаборЗаписей.Записать();

КонецПроцедуры

&НаКлиенте
Процедура МинимальныеОстаткиПередУдалением(Элемент, Отказ)
	ТекДанныеСтруктура = Новый Структура("Количество, КоличествоМаксимум, Склад, ХарактеристикаНоменклатуры",
	Элемент.ТекущиеДанные.Количество, Элемент.ТекущиеДанные.КоличествоМаксимум, Элемент.ТекущиеДанные.Склад,Элемент.ТекущиеДанные.ХарактеристикаНоменклатуры);
	Если ЗначениеЗаполнено(ТекДанныеСтруктура.Склад) Тогда
		МинимальныеОстаткиУдалитьЗаписьНаСервере(ТекДанныеСтруктура);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура МинимальныеОстаткиПередНачаломИзменения(Элемент, Отказ)
	Если Модифицированность = Истина Тогда
		ТекстСообщения = "Перед изменением надо записать элемент!";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, , , Отказ);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура МинимальныеОстаткиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Модифицированность = Истина Тогда
		ТекстСообщения = "Перед добавлением надо записать элемент!";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, , , Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МинимальныеОстаткиСкладОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Для Каждого СтрокаМинимальныеОстатки Из МинимальныеОстатки Цикл
		Если СтрокаМинимальныеОстатки.Склад = ВыбранноеЗначение Тогда
			ТекстСообщения = "Такой склад уже есть в списке!";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);	
			СтандартнаяОбработка = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

//-- №12909

