&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтправитьНовоеСообщение = Параметры.ОтправитьНовоеСообщение;
	НомерТелефонаНовогоСообщения = Параметры.НомерТелефонаНовогоСообщения;
	
	Элементы.ТекущийКанал.СписокВыбора.Очистить();
	ХранилищеИзКонстанты = Константы.КаналыВатсап.Получить();
    МассивКаналов = ХранилищеИзКонстанты.Получить();    
	Если НЕ МассивКаналов = Неопределено Тогда
		Для НомерЗаписи = 0 По МассивКаналов.Количество()-1 Цикл
			Элементы.ТекущийКанал.СписокВыбора.Добавить(МассивКаналов[НомерЗаписи].ИД, МассивКаналов[НомерЗаписи].НомерТелефона);
		КонецЦикла;
	КонецЕсли;
	
	Если Элементы.ТекущийКанал.СписокВыбора.Количество() > 0 Тогда
		ТекущийКанал = Элементы.ТекущийКанал.СписокВыбора[0].Представление;
		ИДТекущегоКанала = Элементы.ТекущийКанал.СписокВыбора[0].Значение;
	Иначе 
		ТекущийКанал = "";
		ИДТекущегоКанала = "";
	КонецЕсли;
	
	ЗаполнитьСписокКонтактовНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыеСообщенияНаСервере(лПервыйЗапуск = Истина)
	
	ЕстьНовыеСообщения = Ложь;
	
	кДатаПоследнегоСообщенияВатсапUNIX = Константы.УДАЛИТЬ_ДатаПоследнегоСообщенияВатсапUNIX.Получить();
	Если ДатаПоследнегоСообщенияВатсапUNIX < кДатаПоследнегоСообщенияВатсапUNIX Тогда
		МассивСообщений = РаботаСВатсап.ПолучитьПоследниеСообщения();
		Если МассивСообщений.Количество() > 0 Тогда
			
			МассивКонтактов = РаботаСВатсап.ПолучитьСписокКонтактов(ИДТекущегоКанала);
			Для НомерКонтакта = 0 По МассивКонтактов.Количество()-1 Цикл
				Отбор=Новый Структура;
				Отбор.Вставить("ИдЧата",  МассивКонтактов[НомерКонтакта].ИдЧата);
				НайденныеСтроки = СписокКонтактов.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТекущаяСтрока = НайденныеСтроки[0];
				Иначе
					ТекущаяСтрока = СписокКонтактов.Добавить();
				КонецЕсли;
				
				ТекущаяСтрока.ИдЧата = МассивКонтактов[НомерКонтакта].ИдЧата;
				ТекущаяСтрока.ИмяАвтора = МассивКонтактов[НомерКонтакта].ИмяАвтора;
				ТекущаяСтрока.ДатаСообщенияUNIX = МассивКонтактов[НомерКонтакта].ДатаСообщенияUNIX;
				
				Если Не ПустаяСтрока(ТекущаяСтрока.ИмяАвтора) Тогда
					ТекущаяСтрока.Представление = СокрЛП(ТекущаяСтрока.ИмяАвтора) + "(" + ТекущаяСтрока.ИдЧата + ")";
				Иначе
					ТекущаяСтрока.Представление = СокрЛП(ТекущаяСтрока.ИдЧата);
				КонецЕсли;
			КонецЦикла;
			СписокКонтактов.Сортировать("ДатаСообщенияUNIX Убыв");
			Для чНом=0 По СписокКонтактов.Количество()-1 Цикл
				СписокКонтактов[чНом].НовоеСообщение = Ложь;
			КонецЦикла;
			
			
			Для чНом=0 По МассивСообщений.Количество()-1 Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("ИД", МассивСообщений[чНом].Ид);
				НайденныеСтроки = СообщенияВатсап.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТекущаяСтрока = НайденныеСтроки[0];
				Иначе
					ТекущаяСтрока = СообщенияВатсап.Добавить();
					//Если НЕ лПервыйЗапуск Тогда
					//	ТекущаяСтрока.НовоеСообщение = Истина;
					//	ЕстьНовыеСообщения = Истина;
					//КонецЕсли;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, МассивСообщений[чНом]);
				ТекущаяСтрока.Текст = ТекущаяСтрока.Текст + ?(ПустаяСтрока(ТекущаяСтрока.Текст),"",Символы.ПС) + МассивСообщений[чНом].МедиаКонтент;
				СообщенияВатсап.Сортировать("ДатаСообщенияUNIX Возр");
				Если НЕ лПервыйЗапуск Тогда
					Если ДатаПоследнегоСообщенияВатсапUNIX < ТекущаяСтрока.ДатаСообщенияUNIX Тогда
						ДатаПоследнегоСообщенияВатсапUNIX = ТекущаяСтрока.ДатаСообщенияUNIX;
					КонецЕсли;
				КонецЕсли;
				
				Если НЕ ТекущаяСтрока.ПрочитаноПользователем Тогда
					Отбор=Новый Структура;
					Отбор.Вставить("ИдЧата",  МассивСообщений[чНом].ИдЧата);
					НайденныеСтроки = СписокКонтактов.НайтиСтроки(Отбор);
					Если НайденныеСтроки.Количество() > 0 Тогда
						НайденныеСтроки[0].НовоеСообщение = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьНовыеСообщения;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьНовыеСообщенияПервыйЗапуск()
	ПолучитьНовыеСообщенияНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНовыеСообщения() Экспорт
	Если ПолучитьНовыеСообщенияНаСервере(Ложь) Тогда 
		ОбновитьЭлементыПриСменеТекущегоЧата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ РаботаСВатсап.СервисДоступен() Тогда
		ПоказатьПредупреждение(,"Сервис интеграции с WHATSAPP не подключен. Подключите сервис в личном кабинете SmartCeilings");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьСоответствиеКлючейAPI() Тогда
		КлючиAPIНеСовпадаетОбновитьЭлементы();
		Возврат;
	КонецЕсли;
	
	ПолучитьНовыеСообщенияПервыйЗапуск();
	
	ТекущиеДанные = Элементы.СписокКонтактов.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если НЕ ТекущийИДЧата = ТекущиеДанные.ИДЧата Тогда
			ТекущийИДЧата = ТекущиеДанные.ИДЧата;
			ТекущиеДанные.НовоеСообщение = Ложь;
			ОбновитьЭлементыПриСменеТекущегоЧата();
		КонецЕсли;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПолучитьНовыеСообщения",1);
	
	Если ОтправитьНовоеСообщение Тогда
		Парам = Новый Структура;
		Парам.Вставить("НомерТелефона", НомерТелефонаНовогоСообщения);
		Если ПроверитьСоответствиеКлючейAPI() Тогда
			ОткрытьФорму("Обработка.РаботаСВатсап.Форма.НовыйЧат",Парам,ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеЗакрытияОкнаНовогоЧата",ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			КлючиAPIНеСовпадаетОбновитьЭлементы();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьСоответствиеКлючейAPI()
	
	Возврат РаботаСВатсап.КлючиAPIСовпадают();
	
КонецФункции

&НаКлиенте
Процедура ТекущийКаналОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для чНом=0 По Элементы.ТекущийКанал.СписокВыбора.Количество()-1 Цикл
		Если ВыбранноеЗначение = Элементы.ТекущийКанал.СписокВыбора[чНом].Значение Тогда
			ТекущийКанал = Элементы.ТекущийКанал.СписокВыбора[чНом].Представление;
			ИДТекущегоКанала = Элементы.ТекущийКанал.СписокВыбора[чНом].Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКонтактовНаСервере()
	
	МассивКонтактов = РаботаСВатсап.ПолучитьСписокКонтактов(ИДТекущегоКанала);
	
	СписокКонтактов.Очистить();
	Для чНом = 0 По МассивКонтактов.Количество()-1 Цикл
		
		НоваяСтрока = СписокКонтактов.Добавить();
		НоваяСтрока.ИдЧата = МассивКонтактов[чНом].ИдЧата;
		НоваяСтрока.ИмяАвтора = МассивКонтактов[чНом].ИмяАвтора;
		НоваяСтрока.ДатаСообщенияUNIX = МассивКонтактов[чНом].ДатаСообщенияUNIX;
		
		Если Не ПустаяСтрока(НоваяСтрока.ИмяАвтора) Тогда
			НоваяСтрока.Представление = СокрЛП(НоваяСтрока.ИмяАвтора) + "(" + НоваяСтрока.ИдЧата + ")";
		Иначе
			НоваяСтрока.Представление = СокрЛП(НоваяСтрока.ИдЧата);
		КонецЕсли;
		
		СтрокиСообщений = СообщенияВатсап.НайтиСтроки(Новый Структура("ИдЧата", МассивКонтактов[чНом].ИдЧата));
		Для НомерСообщения=0 По СтрокиСообщений.Количество()-1 Цикл
			Если СтрокиСообщений[НомерСообщения].НовоеСообщение Тогда
				НоваяСтрока.НовоеСообщение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	СписокКонтактов.Сортировать("ДатаСообщенияUNIX Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКаналПриИзменении(Элемент)
	ЗаполнитьСписокКонтактовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтактовПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.СписокКонтактов.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если НЕ ТекущийИДЧата = ТекущиеДанные.ИДЧата Тогда
			ТекущийИДЧата = ТекущиеДанные.ИДЧата;
			//ТекущиеДанные.НовоеСообщение = Ложь;
			ОбновитьЭлементыПриСменеТекущегоЧата();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыПриСменеТекущегоЧата()
	ИдентификаторПоследнейСтроки = Неопределено;
	ТекущийЧат.Очистить();
	Отбор = Новый Структура;
	Отбор.Вставить("ИДЧата",ТекущийИДЧата);
	НайденныеСтроки = СообщенияВатсап.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Для чНом = 0 По НайденныеСтроки.Количество()-1 Цикл
			НоваяСтрока = ТекущийЧат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[чНом]);
			НоваяСтрока.Представление = НоваяСтрока.Текст;
			НайденныеСтроки[чНом].НовоеСообщение = Ложь;
			ИдентификаторПоследнейСтроки = НоваяСтрока.ПолучитьИдентификатор();
		КонецЦикла;
	КонецЕсли;
	Элементы.ТекущийЧат.ТекущаяСтрока = ИдентификаторПоследнейСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	Если НЕ ПустаяСтрока(СообщениеКОтправке) Тогда
		ОтправитьНовоеСообщениеИДобавитьВТекущийЧат(ИДТекущегоКанала, ТекущийИДЧата, СообщениеКОтправке);
		СообщениеКОтправке = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНовоеСообщениеИДобавитьВТекущийЧат(лИДТекущегоКанала, лТекущийИДЧата, СообщениеКОтправке)
	Ответ = РаботаСВатсап.ОтправитьСообщение(ИДТекущегоКанала, лТекущийИДЧата, СообщениеКОтправке);
	Если Ответ.Результат = Ложь Тогда
		ПоказатьПредупреждение(,"Не удалось отправить сообщение: " + Ответ.ОписаниеОшибки);
	Иначе
		НоваяСтрока = СообщенияВатсап.Добавить();
		НоваяСтрока.Ид = Ответ.ИД;
		НоваяСтрока.ИДКанала = лИДТекущегоКанала;
		НоваяСтрока.ИДЧата = лТекущийИДЧата;
		НоваяСтрока.Текст = СообщениеКОтправке;
		НоваяСтрока.ТипАвтора = 9;
		НоваяСтрока.ДатаСообщенияUNIX = 999999999999999;
		
		НоваяСтрока = ТекущийЧат.Добавить();
		НоваяСтрока.Ид = Ответ.ИД;
		НоваяСтрока.Текст = СообщениеКОтправке;
		НоваяСтрока.ТипАвтора = 9;
		НоваяСтрока.Представление = НоваяСтрока.Текст;
		НоваяСтрока.ДатаСообщенияUNIX = 999999999999999;
		
		СообщениеКОтправке = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовыйЧат(Команда)
	
	Если ПроверитьСоответствиеКлючейAPI() Тогда
		ОткрытьФорму("Обработка.РаботаСВатсап.Форма.НовыйЧат",,ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеЗакрытияОкнаНовогоЧата",ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		КлючиAPIНеСовпадаетОбновитьЭлементы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючиAPIНеСовпадаетОбновитьЭлементы()
	
	ПоказатьПредупреждение(,"Ключ API программы не совпадает с адресом отправки webhook wazzup
	|Обновите адрес отправки вебхук в настройках и перезапустите форму");
	
	Элементы.ГруппаВерхняяПанель.Доступность = Ложь;
	Элементы.ГруппаСредняяПанель.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗакрытияОкнаНовогоЧата(Парам1, Парам2) Экспорт
	
	Если НЕ Парам1 = Неопределено Тогда
		Если ТипЗнч(Парам1) = Тип("Структура") Тогда
			Если Парам1.Отправить Тогда
				
				ТекущийИДЧата = СтрЗаменить(Парам1.Получатель,"+","");
				ОтправитьНовоеСообщениеИДобавитьВТекущийЧат(ИДТекущегоКанала, ТекущийИДЧата, Парам1.Текст);
				ПослеЗакрытияОкнаНовогоЧатаНаСервере(ТекущийИДЧата);
				ОбновитьЭлементыПриСменеТекущегоЧата();
				
				МассивСтрок = СписокКонтактов.НайтиСтроки(Новый Структура("ИДЧата", ТекущийИДЧата));
				Если МассивСтрок.Количество() > 0 Тогда
					Элементы.СписокКонтактов.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗакрытияОкнаНовогоЧатаНаСервере(лТекущийИДЧата)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдЧата", лТекущийИДЧата);
	НайденныеСтроки = СписокКонтактов.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		//такой контакт уже был
	Иначе
		НоваяСтрока = СписокКонтактов.Добавить();
		НоваяСтрока.ИдЧата = лТекущийИДЧата;
		НоваяСтрока.Представление = СокрЛП(НоваяСтрока.ИдЧата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийЧатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.ТекущийЧат.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = Неопределено И НЕ ПустаяСтрока(ТекущаяСтрока.МедиаКонтент) Тогда
		ЗапуститьПриложение(ТекущаяСтрока.МедиаКонтент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьКакПрочитанные(Команда)
	
	МассивИД = Новый Массив;
	Для Каждого ТекущаяСтрока Из ТекущийЧат Цикл
		Если НЕ ТекущаяСтрока.ПрочитаноПользователем Тогда
			МассивИД.Добавить(ТекущаяСтрока.ИД);
		КонецЕсли;
	КонецЦикла;
	РаботаСВатсап.ОтметитьСообщенияКакПрочитанные(МассивИД);
	
	ДатаПоследнегоСообщенияВатсапUNIX = 0;
	ПолучитьНовыеСообщения();
	ОбновитьЭлементыПриСменеТекущегоЧата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодробнуюИнформациюПоСообщению(Команда)
	ТекущиеДанные = Элементы.ТекущийЧат.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ПодробнаяИнформация = РаботаСВатсап.ПолучитьСведенияОСообщении(ТекущиеДанные.ИД);
		ОткрытьФорму("Обработка.РаботаСВатсап.Форма.ПодробноОСообщении", ПодробнаяИнформация, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры
