
&НаСервере
Функция СформироватьНаСервере()
	
	Возврат МодульОтчетов.СформироватьОтчетПоВходящимКонтактамВРазрезеМенеджеров(Отчет.ДатаНачала, Отчет.ДатаОкончания);
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Анализ = СформироватьНаСервере();
	ОбновитьОтображениеДанных();
	
	Элементы.Анализ.ОтображатьГруппировки = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Отчет.ДатаНачала = Дата("00010101") Тогда
		Отчет.ДатаНачала = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	Если Отчет.ДатаОкончания = Дата("00010101") Тогда
		Отчет.ДатаОкончания = КонецМесяца(ТекущаяДата());
	КонецЕсли;
КонецПроцедуры
