
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	//Закрыть(КодВозвратаДиалога.ОК);
	Струк = Новый Структура;
	Струк.Вставить("СписокДобавленныхФайлов", СписокДобавленныхФайлов.ВыгрузитьЗначения());
	
	мФайлы = Новый Массив;
		
	Для Каждого Стр Из Файлы Цикл
		мСтрук = Новый Структура;
		мСтрук.Вставить("Имя",Стр.Имя);
		мСтрук.Вставить("Дата",Стр.Дата);
		мФайлы.Добавить(мСтрук);
	КонецЦикла;
	
	Струк.Вставить("СписокДобавленныхФайлов", СписокДобавленныхФайлов.ВыгрузитьЗначения());
	Струк.Вставить("Файлы", мФайлы);
	Струк.Вставить("КодВозврата",КодВозвратаДиалога.ОК);
	Закрыть(Струк);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБезСохранения(Команда)
	Закрыть(КодВозвратаДиалога.Отмена);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	ПутьКФайлу = ПолучитьПутьКФайлу();
	Если ПутьКФайлу = "" Тогда
		Сообщить("В настройках не указан путь к хранению файлов!", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
		
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ДобавитьФайлЗавершение1", ЭтотОбъект), ,, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлЗавершение1(Результат, Адрес, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
	
	
	Если Результат Тогда
		
		ФайлНаДискеСуществует = Ложь;
		КаталогНаДиске = "";
		
		ПоместитьФайлОбъектаНачало(Номер, Адрес, ВыбранноеИмя, ФайлНаДискеСуществует, КаталогНаДиске);  //ФайлНаДискеСуществует, КаталогНаДиске будут возвращены
		
		ВыбранныйВариантДействия = Неопределено;
		Если ФайлСуществует(КаталогНаДиске, ВыбранноеИмя) Тогда
			
			ВариантыДействий = Новый СписокЗначений;
			ВариантыДействий.Добавить(2, "Заменить");
			ВариантыДействий.Добавить(1, "Сохранить оба файла");
			ВариантыДействий.Добавить(0, "Отменить загрузку");
			
			дп = новый Структура("АдресВременногоХранилища,КаталогНаДиске,ВыбранноеИмя",Адрес,КаталогНаДиске,ВыбранноеИмя);
			ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьФайлЗавершение", ЭтотОбъект,дп), "Файл "+ВыбранноеИмя+" уже существует!"+Символы.ПС+"Выберите действие которое надо совершить.", ВариантыДействий);     
			Возврат;
			
		КонецЕсли;
		
		ПоместитьФайлОбъектаОкончание(Адрес, КаталогНаДиске, ВыбранноеИмя, ВыбранныйВариантДействия);
		
		Модифицированность = истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыбранныйВариантДействия = РезультатВопроса;
	ПоместитьФайлОбъектаОкончание(ДополнительныеПараметры.АдресВременногоХранилища, ДополнительныеПараметры.КаталогНаДиске, ДополнительныеПараметры.ВыбранноеИмя, ВыбранныйВариантДействия);
	Модифицированность = Истина;

КонецПроцедуры



//Веб
&НаКлиенте
Процедура НачатьПодключениеРасширенияРаботыСФайламиЗавершение(Подключено, ДополнительныеПараметры) Экспорт    
    Если Не Подключено Тогда
        Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияРаботыСФайламиЗавершение", ЭтаФорма, ДополнительныеПараметры);
        ТекстСообщения = НСтр("ru='Для продолжении работы необходимо установить расширение для веб-клиента ""1С:Предприятие"". Установить?'");
        ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет); 
    Иначе
		ОткрытьФайлЗавершение(Неопределено);
    КонецЕсли;    
КонецПроцедуры

//Веб
&НаКлиенте
Процедура НачатьУстановкуРасширенияРаботыСФайламиЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        НачатьУстановкуРасширенияРаботыСФайлами();
    КонецЕсли;    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	Если Элементы.Файлы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтаФорма,);
		НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	#Иначе
		ОткрытьФайлЗавершение(Неопределено);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлЗавершение(ДополнительныеПараметры) Экспорт
    имяФайла = Элементы.Файлы.ТекущиеДанные.Имя;
	АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(имяФайла);
	Если ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		врИмяФайла = КаталогВременныхФайлов() + имяФайла;
		#Если ВебКлиент Тогда
			ПолучитьФайл(АдресВременногоХранилища,врИмяФайла, истина);
		#Иначе
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
			ДвоичныеДанные.Записать(врИмяФайла);
			ЗапуститьПриложение(врИмяФайла);
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)	
	Если Элементы.Файлы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	#Если ВебКлиент Тогда
	    Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтаФорма);
	    НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	#Иначе
		СохранитьФайлЗавершение(Неопределено);
	#КонецЕсли
	
			
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлЗавершение(ДополнительныеПараметры) Экспорт
    Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Элементы.Файлы.ТекущиеДанные.Имя;
	ДиалогОткрытияФайла.Заголовок = "Сохранение файла";
	Расширение = Сред(Элементы.Файлы.ТекущиеДанные.Имя,Найти(Элементы.Файлы.ТекущиеДанные.Имя, ".")+1);
	Фильтр = "(*."+ Расширение +")|*."+Расширение+"";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Расширение = Расширение;	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		ВыбранныйКаталог = Новый Файл(ДиалогОткрытияФайла.Каталог);
		
		АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(Элементы.Файлы.ТекущиеДанные.Имя);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		
		Попытка
			ДвоичныеДанные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПутьКФайлу()
	Возврат Константы.ИА_КаталогХраненияФайлов.Получить();
КонецФункции

// проверка наличия файла и его версий в рекурсии
&НаСервере
Процедура ПроверитьСуществованиеФайла(ИмяКаталога, ИмяФайла, Сч) 
    КаталогНаДиске = Новый Файл(ИмяКаталога+ИмяФайла);  
	Имя = КаталогНаДиске.ИмяБезРасширения; Расширение = КаталогНаДиске.Расширение;
    Если КаталогНаДиске.Существует() Тогда
		Позиция = Найти(Имя, "_"); 
		Если Позиция > 0 Тогда Имя = Лев(Имя, Позиция-1); КонецЕсли; 
		Сч = Сч + 1; ИмяФайла = Имя + "_" + Сч + Расширение;
		ПроверитьСуществованиеФайла(ИмяКаталога, ИмяФайла, Сч);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПоместитьТекущийФайлВБуфер(ВыбранноеИмя)
	
	КаталогХранения	= ПолучитьПолноеИмяФайла(ВыбранноеИмя); 
	ФайлДляПередачи = Новый ДвоичныеДанные(КаталогХранения);
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ФайлДляПередачи, УникальныйИдентификатор);
	
	Возврат АдресВременногоХранилища;
	
КонецФункции

&НаСервере
Функция ПолучитьПолноеИмяФайла(ВыбранноеИмя)
	
	КаталогХранения = Константы.ИА_КаталогХраненияФайлов.Получить();
	КаталогХранения = КаталогХранения + СОКРЛП(Номер) + "\";
	
	КаталогХранения = КаталогХранения + ВыбранноеИмя;
	
	Возврат КаталогХранения;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номер = "";
	Параметры.Свойство("Номер", Номер);
	
	мФайлы = Новый Массив;
	Если Параметры.Свойство("Файлы", мФайлы) Тогда 
		Для Каждого Эл Из мФайлы Цикл 
			Стр = Файлы.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Эл);
		КонецЦикла;
	КонецЕсли;
			
КонецПроцедуры

//Арчил	Тваладзе 18.04.2016 добавление файла.
&НаСервереБезКонтекста
Процедура ПоместитьФайлОбъектаНачало(Номер, АдресВременногоХранилища, ВыбранноеИмя, ФайлНаДискеСуществует = Ложь, КаталогХранения = "")
	
	Если Найти(ВыбранноеИмя,"\")>0 или Найти(ВыбранноеИмя,"/")>0 Тогда
		Сч = СтрДлина(ВыбранноеИмя);
		Поз = 0;
		Пока Сч > 0 Цикл
			Симв = Сред(ВыбранноеИмя, Сч, 1);
			если Симв = "\" или Симв = "/" Тогда
				Поз = Сч;
				Прервать;
			КонецЕсли;
			Сч = Сч - 1;
		КонецЦикла;
		
		ВыбранноеИмя = Сред(ВыбранноеИмя, сч + 1);
	КонецЕсли;
	
	КаталогХранения = ПолучитьПутьКФайлу();
	
	КаталогХранения = КаталогХранения + СОКРЛП(Номер) + "\"; КаталогФайлов = КаталогХранения;
	
	КаталогНаДиске = Новый Файл(КаталогХранения);
	
	Если НЕ КаталогНаДиске.Существует() Тогда
		СоздатьКаталог(КаталогХранения);
	КонецЕсли;
	
	ФайлНаДискеСуществует = ФайлСуществует(КаталогХранения, ВыбранноеИмя);
	
КонецПроцедуры
	
&НаСервере
Процедура ПоместитьФайлОбъектаОкончание(АдресВременногоХранилища, КаталогФайлов, ВыбранноеИмя, ВыбранныйВариантДействия = 0)
	
	Если ВыбранныйВариантДействия = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	МодифицироватьФайлПоВыбранномуДействию(КаталогФайлов, ВыбранноеИмя, ВыбранныйВариантДействия); 
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	КаталогХранения = КаталогФайлов + ВыбранноеИмя;
	ДвоичныеДанные.Записать(КаталогХранения);
	
	СписокдобавленныхФайлов.Добавить(КаталогХранения);    //на случай, если задачу не сохранят и файлы придется удалять
	
	МассивСтрок = Файлы.НайтиСтроки(Новый Структура("Имя", ВыбранноеИмя));
	
	Если МассивСтрок.Количество()=0 Тогда
		НоваяСтрока = Файлы.Добавить();
	иначе 
		НоваяСтрока = МассивСтрок[0];
	КонецЕсли;
	
	НоваяСтрока.Имя = ВыбранноеИмя;
	НоваяСтрока.Дата = ТекущаяДата();
	НоваяСтрока.КаталогХранения = КаталогХранения;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФайлСуществует(ИмяКаталога, ИмяФайла)
	
	КаталогНаДиске =  Новый Файл(ИмяКаталога+ИмяФайла);
	
	ФайлСуществует = КаталогНаДиске.Существует();
	
	КаталогНаДиске =Неопределено;
	
	Возврат ФайлСуществует;
	
КонецФункции

&НаСервере
Процедура МодифицироватьФайлПоВыбранномуДействию(ИмяКаталога, ИмяФайла, ВыбранныйВариантДействия = 0) 
	
	КаталогНаДиске =  Новый Файл(ИмяКаталога+ИмяФайла);
 
	ИмяФайлаБезРасширения = КаталогНаДиске.ИмяБезРасширения; 
	Расширение = КаталогНаДиске.Расширение;
	НовоеИмяФайла = ИмяФайла;
	Сч =0;
	
	Если ВыбранныйВариантДействия = 2 Тогда //Замещаем файл на диске
		
	ИначеЕсли ВыбранныйВариантДействия = 1 Тогда // Добавляем к имени файла _<сч>
		
		Пока КаталогНаДиске.Существует() Цикл
			
			Сч = Сч + 1; 
			НовоеИмяФайла = ИмяФайлаБезРасширения + "_" + Сч + Расширение;
			КаталогНаДиске = Новый Файл(ИмяКаталога + НовоеИмяФайла);
			
			//навсякий случай прерывание.
			Если Сч = 1000000000 тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Слишком много файлов в каталоге! Выберите другой каталог!"; 
				Сообщение.Сообщить();
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;	
		
	Иначе    //отмена добавления файла
		Возврат;
	КонецЕсли;
	
	ИмяФайла = НовоеИмяФайла;
	
КонецПроцедуры


&НаКлиенте
Процедура Удалить(Команда)
	тд = Элементы.Файлы.ТекущиеДанные;
	Если тд<>Неопределено и тд.КаталогХранения<> "" и СписокДобавленныхФайлов.НайтиПоЗначению(тд.КаталогХранения)<>Неопределено Тогда
		файлы.Удалить(Элементы.Файлы.ТекущаяСтрока);
		УдалитьФайлНаСервере(тд.КаталогХранения);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьФайлНаСервере(ИмяФайла)
	
	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры

