
&НаКлиенте
Процедура ВвестиНаОснованииИнкассовоеПоручениеПолученное(Команда)
	
	СтрокаСписка = Элементы.Список.ТекущиеДанные;
	
	Если не СтрокаСписка = Неопределено Тогда
		П = Новый Структура;
		
		П.Вставить("Основание", СтрокаСписка.Ссылка);
		
		ОткрытьФорму("Документ.ИнкассовоеПоручениеПолученное.ФормаОбъекта", П);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНаОснованииПлатежноеПоручениеИсходящее(Команда)
	СтрокаСписка = Элементы.Список.ТекущиеДанные;
	Если не СтрокаСписка = Неопределено Тогда
		П = Новый Структура;
		
		П.Вставить("Основание", СтрокаСписка.Ссылка);
		
		ОткрытьФорму("Документ.ПлатежноеПоручениеИсходящее.ФормаОбъекта", П);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНаОснованииПлатежноеТребованиеПолученное(Команда)
	СтрокаСписка = Элементы.Список.ТекущиеДанные;
	Если не СтрокаСписка = Неопределено Тогда
		П = Новый Структура;
		
		П.Вставить("Основание", СтрокаСписка.Ссылка);
		
		ОткрытьФорму("Документ.ПлатежноеТребованиеПолученное.ФормаОбъекта", П);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНаОснованииПлатежныйОрдерСписаниеДенежныхСредств(Команда)
	СтрокаСписка = Элементы.Список.ТекущиеДанные;
	Если не СтрокаСписка = Неопределено Тогда
		П = Новый Структура;
		
		П.Вставить("Основание", СтрокаСписка.Ссылка);
		
		ОткрытьФорму("Документ.ПлатежныйОрдерСписаниеДенежныхСредств.ФормаОбъекта", П);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНаОснованииРасходныйКассовыйОрдер(Команда)
	СтрокаСписка = Элементы.Список.ТекущиеДанные;
	Если не СтрокаСписка = Неопределено Тогда
		П = Новый Структура;
		
		П.Вставить("Основание", СтрокаСписка.Ссылка);
		
		ОткрытьФорму("Документ.РасходныйКассовыйОрдер.ФормаОбъекта", П);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВвестиНаОснованииСписаниеСРасчетногоСчета(Команда)
	СтрокаСписка = Элементы.Список.ТекущиеДанные;
	Если не СтрокаСписка = Неопределено Тогда
		П = Новый Структура;
		
		П.Вставить("Основание", СтрокаСписка.Ссылка);
		
		ОткрытьФорму("Документ.СписаниеСРасчетногоСчета.ФормаОбъекта", П);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИА_ФП.ВидимостьЭлементовФормыНастройкиОрганизаций(ЭтаФорма);
	ВидимостьЭлементовФорм();

	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ложь);

КонецПроцедуры

&НаСервере
Процедура ВидимостьЭлементовФорм()
	
	РазделятьНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	ИспользоватьВидДССправочно = Константы.ИА_ФП_ИспользоватьВидДССправочно.Получить();
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	
	Элементы.Подразделение.Видимость = ИспПодразделения;
	Элементы.ВидДССправочно.Видимость = ИспользоватьВидДССправочно;

КонецПроцедуры

&НаКлиенте
Процедура Отчеты(Команда)
	сп = новый СписокЗначений;
	сп.Добавить("КСУ_НезакрытыеЗаказы","Незакрытые заказы");
	сп.Добавить("КСУ_РасходыПоПодразделениям","Расходы по подразделениям");
	сп.Добавить("ИА_КонтрольПлатежейВнеФондов","Контроль платежей вне фондов");
	сп.Добавить("КСУ_ДвиженияПоФондам","Движение по фондам");
	сп.Добавить("КСУ_СостояниеФондов","Остатки на счетах и фондах");
	
	оп = новый ОписаниеОповещения("ВыбОтчет", ЭтотОбъект);
	ПоказатьВыборИзСписка(оп, сп, Элементы.Декорация5);
КонецПроцедуры

&НаКлиенте
Процедура ВыбОтчет(выбЗн, ДопПарам) Экспорт
	Если выбЗн <> Неопределено Тогда
		ОткрытьФорму("Отчет."+выбЗн.Значение+".Форма");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Для каждого стр из Строки Цикл
		стрД = стр.Значение.Данные;    
		стрД.ПредметЗаказа = ВРЕГ(стрД.ПредметЗаказа);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОСтатусах(Команда)
	ОткрытьФорму("Документ.ИА_ЗаказНаПриобретение.Форма.ОСтатусах");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПомеченные(Команда)
	Элементы.КомандаПоказатьПомеченные.Пометка = не Элементы.КомандаПоказатьПомеченные.Пометка;
	
	УстОтборПомеченных(Элементы.КомандаПоказатьПомеченные.Пометка);
КонецПроцедуры

&НаСервере
Процедура УстОтборПомеченных(ТекЗн)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ТекЗн);
КонецПроцедуры
