Процедура ЗавершитьЗадачуОснование(задачаПлана) Экспорт
	ЗадачаОснование = ИА_Планы.ЗначениеРеквизита(задачаПлана,"ЗадачаОснование");
	
	Если ИА_Планы.ЗначениеРеквизита(задачаПлана,"Выполнено") и ЗначениеЗаполнено(ЗадачаОснование) Тогда
		
		Если ТипЗнч(ЗадачаОснование) = тип("СправочникСсылка.ИА_СтратегическоеУправление") и не ИА_Планы.ЗначениеРеквизита(ЗадачаОснование,"Выполнено") Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗавершитьЗадачуОснованиеЗавершение", ЭтотОбъект, Новый Структура("задачаПлана,ЗадачаОснование", задачаПлана,ЗадачаОснование)), "Завершить задачу программы?", РежимДиалогаВопрос.ДаНет);
		ИначеЕсли ТипЗнч(ЗадачаОснование) = тип("ЗадачаСсылка.ИА_ЗадачаПланаДействий") и не ИА_Планы.ЗначениеРеквизита(ЗадачаОснование,"Выполнена") Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗавершитьЗадачуОснованиеЗавершение1", ЭтотОбъект, Новый Структура("задачаПлана,ЗадачаОснование", задачаПлана,ЗадачаОснование)), "Завершить задачу КЦ?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

Процедура ЗавершитьЗадачуОснованиеЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	задачаПлана = ДополнительныеПараметры.задачаПлана;
	ЗадачаОснование = ДополнительныеПараметры.ЗадачаОснование;
	
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		нуженДоклад = ИА_Планы.НуженДокладПоЗадачеКЦ(ЗадачаОснование);
		Если нуженДоклад Тогда
			доклад = "";
			ПоказатьВводСтроки(Новый ОписаниеОповещения("ЗавершитьЗадачуОснованиеЗавершение1Завершение", ЭтотОбъект, Новый Структура("задачаПлана, доклад,ЗадачаОснование", задачаПлана, доклад,ЗадачаОснование)), доклад,"Введите доклад об исполнении",,Истина);
		Иначе
			ИА_Планы.ЗАвершитьЗадачуКЦ(ЗадачаОснование);
			Оповестить("КСУ_ОбновитьКорзины");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗавершитьЗадачуОснованиеЗавершение1Завершение(Строка, ДополнительныеПараметры1) Экспорт
	
	задачаПлана = ДополнительныеПараметры1.задачаПлана;
	ЗадачаОснование = ДополнительныеПараметры1.ЗадачаОснование;
	
	доклад = ?(Строка = Неопределено, ДополнительныеПараметры1.доклад, Строка);
	
	
	Если (Строка <> Неопределено) Тогда
		Если СокрЛП(доклад) <> "" Тогда
			ИА_Планы.ЗАвершитьЗадачуКЦ(ЗадачаОснование,доклад);
			Оповестить("КСУ_ОбновитьКорзины");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗавершитьЗадачуОснованиеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	задачаПлана = ДополнительныеПараметры.задачаПлана;
	ЗадачаОснование = ДополнительныеПараметры.ЗадачаОснование;
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		задачаС = ЗадачаОснование;
		
		Программа = ИА_АдминшкалаСервер.ПолучитьПрограммуЗадачи(задачаС);	
		Отв = ИА_АдминшкалаСервер.ПолучитьОтветственногоПрограммы(Программа);
		
		Если ИА_АдминшкалаСервер.МожноВыполнитьЗадачу(задачаС) или отв.Пустая() Тогда
			ИА_АдминшкалаСервер.ЗавершитьЗадачуАШ(задачаС);
		Иначе   // доклад об исполнении
			
			НаименованиеЗадачи = СокрЛП(ИА_АдминшкалаСервер.ПолучитьСодержание(задачаС));
			Если СтрДлина(НаименованиеЗадачи)>70 Тогда
				НаименованиеЗадачи = лев(НаименованиеЗадачи,70)+"...";
			КонецЕсли;
			НаименованиеЗадачи = СтрЗаменить(НаименованиеЗадачи, Символы.ПС, " ");
			
			НаименованиеПрограммы = ИА_АдминшкалаСервер.ПолучитьНаименованиеПрограммы(Программа);
			
			СодержаниеЗ = "Задача """+НаименованиеЗадачи+""" из программы """+НаименованиеПрограммы+""" выполнена. Прошу подтвердить. "+Символы.ПС+"Доказательства (напишите текст или прикрепите файл или объект базы данных):"+Символы.ПС ;
			ПользЗ = ИА_ОбщиеПроцедурыКЦиОргсхема.ПолучитьПользователяНаПосту(Отв);
			НаименованиеЗ = "Доклад об исполнении задачи: "+НаименованиеЗадачи;
			Парам = Новый структура("ЗадачаСУ,Наименование,Пост,Пользователь,Содержание",задачаС,НаименованиеЗ,Отв,ПользЗ,СодержаниеЗ);
			
			ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.ФормаОбъекта",Парам,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

функция ВремяВЧисло(пВр) Экспорт
	возврат 60*60*час(пВр) + 60*Минута(пвр);
КонецФункции