
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//#14259
	Если Параметры.Свойство("УстановкаЦенНаПродукцию") 
		ИЛИ Параметры.Свойство("УстановкаИндивидуальныхЦенНаПродукцию") Тогда
		Элементы.ГруппаПоСебестоимости.Видимость      = Ложь;
		Элементы.ГруппаПоПокупкеБезДоставки.Видимость = Ложь;
		Элементы.ГруппаПоПокупкеСДоставкой.Видимость  = Ложь;
	
	    Если Параметры.Свойство("УстановкаЦенНаПродукцию") Тогда
			ВидИсходныхДанных = 3;
		Иначе
			ВидИсходныхДанных = 4;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("УстановкаИндивидуальныхЦенНоменклатуры") 
		ИЛИ Параметры.Свойство("УстановкаИндивидуальныхЦенНаПродукцию") Тогда
		УстановкаИндивидуальныхЦен = Истина;
		Элементы.ГруппаПоТекущейЦенеДокумента.Видимость = Ложь;
		Элементы.КонечныйВидЦенСписок.Видимость = Ложь;
	КонецЕсли;
	
	ИспользуемыеВидыЦен.ЗагрузитьЗначения(Параметры.РазрешенныеВидыЦен.ВыгрузитьЗначения());
	//Элементы.КонечныйВидЦен.СписокВыбора.ЗагрузитьЗначения(Параметры.ИспользуемыеВидыЦен.ВыгрузитьЗначения());
	//Если Элементы.КонечныйВидЦен.СписокВыбора.Количество() = 1 Тогда
	//	КонечныйВидЦен = Элементы.КонечныйВидЦен.СписокВыбора[0].Значение;
	//КонецЕсли;
	Элементы.ИсходныйВидЦенДокумента.СписокВыбора.ЗагрузитьЗначения(Параметры.ИспользуемыеВидыЦен.ВыгрузитьЗначения());
	Элементы.ИсходныйВидЦен.СписокВыбора.ЗагрузитьЗначения(Параметры.ВсеВидыЦен.ВыгрузитьЗначения());
	
	Если ИспользуемыеВидыЦен.Количество() = 1 Тогда
		КонечныйВидЦенСписок.ЗагрузитьЗначения(ИспользуемыеВидыЦен.ВыгрузитьЗначения());
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидИсходныхДанныхПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура КонечныйВидЦенСписокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//#13646
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИспользуемыеВидыЦен",	ИспользуемыеВидыЦен.ВыгрузитьЗначения());
	ПараметрыФормы.Вставить("ВыбранныеВидыЦен",		КонечныйВидЦенСписок.ВыгрузитьЗначения());
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодборЦенЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыЦен.Форма.ФормаПодбора", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура ПодборЦенЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонечныйВидЦенСписок.ЗагрузитьЗначения(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РассчитатьЦены(Команда)
	
	//#13646
	//Если НЕ ЗначениеЗаполнено(КонечныйВидЦен) Тогда
	//	Сообщить("Не указан ""Конечный вид цен""");
	//	Возврат;
	//КонецЕсли;
	Если КонечныйВидЦенСписок.Количество() = 0 И НЕ УстановкаИндивидуальныхЦен Тогда
		Сообщить("Не указан ""Конечный вид цен""");
		Возврат;
	КонецЕсли;
	
	Если ВидИсходныхДанных = 3 И НЕ ЗначениеЗаполнено(ИсходныйВидЦенДокумента) Тогда
		Сообщить("Не указан ""Вид цен""");
		Возврат;
	КонецЕсли;
	
	Если ВидИсходныхДанных = 4 И НЕ ЗначениеЗаполнено(ИсходныйВидЦен) Тогда
		Сообщить("Не указан ""Вид цен""");
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ВидИсходныхДанных", 		ВидИсходныхДанных);
	Результат.Вставить("ИсходныйВидЦен", 			ИсходныйВидЦен);
	Результат.Вставить("ИсходныйВидЦенДокумента", 	ИсходныйВидЦенДокумента);
	//#13646
	//Результат.Вставить("КонечныйВидЦен", 			КонечныйВидЦен);
	Результат.Вставить("КонечныйВидЦен", 			КонечныйВидЦенСписок.ВыгрузитьЗначения());
	Результат.Вставить("ПроцентНаценки", 			ПроцентНаценки);
	Результат.Вставить("СкладОстатков", 			СкладОстатков);
	Результат.Вставить("Организация", 				Организация);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ИсходныйВидЦенДокумента.Доступность = (ВидИсходныхДанных = 3);
	Элементы.ИсходныйВидЦен.Доступность = (ВидИсходныхДанных = 4);	
	Элементы.СкладОстатков.Доступность = (ВидИсходныхДанных = 0);
	Элементы.Организация.Видимость = (ВидИсходныхДанных = 0 ИЛИ ВидИсходныхДанных = 1 ИЛИ ВидИсходныхДанных = 2);

КонецПроцедуры

#КонецОбласти



