&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	Элементы.УчитыватьСтоимостьДоставки.Видимость = (ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг"));
	//ДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДокументПриИзмененииНаСервере()
	
	//ТаблицаРезультата.Очистить();
	////Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг")
	//// ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
	//Для каждого Товар Из Документ.Товары Цикл
	//	НовыйТовар = ТаблицаРезультата.Добавить();
	//	НовыйТовар.Номенклатура = Товар.Номенклатура;
	//	НовыйТовар.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
	//	НовыйТовар.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
	//	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
	//		НовыйТовар.Цена = Товар.Цена;	
	//	КонецЕсли;
	//КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьТоварыИзДокумента(Команда)
	СформироватьТаблицуРезультатаНаСервере();
	// закрыть в форму с передачей результата
	Закрыть(ТаблицаРезультата);
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицуРезультатаНаСервере()
	
	ТаблицаРезультата.Очистить();
	
	Для каждого Товар Из Документ.Товары Цикл
		НовыйТовар = ТаблицаРезультата.Добавить();
		НовыйТовар.Номенклатура = Товар.Номенклатура;
		НовыйТовар.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		НовыйТовар.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
			Если НЕ ВключатьСтоимостьДоставки Тогда
				НовыйТовар.Цена = Товар.Цена;
			Иначе
				Коэффициент = 0;
				Если НЕ Документ.Товары.Итог("Сумма") = 0 Тогда
					Коэффициент = Товар.Сумма / Документ.Товары.Итог("Сумма");
				КонецЕсли;
				НовыйТовар.Цена = Товар.Цена + Окр(Документ.СтоимостьДоставки * Коэффициент / Товар.Количество, 2); 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 	
	
КонецПроцедуры

