
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    Отбор           = Новый Структура("БизнесПроцесс, ИА_ИсключенаИзОбработки", ПараметрКоманды, Ложь);
    
    ПараметрыФормы  = Новый Структура("Отбор", Отбор);
    
    ОткрытьФорму("Обработка.ИА_БПМенеджер.Форма.ФормаСпискаЗадач", 
    ПараметрыФормы, 
    ПараметрыВыполненияКоманды.Источник, 
    ПараметрыВыполненияКоманды.Уникальность, 
    ПараметрыВыполненияКоманды.Окно, 
    ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
