
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ОтборПериодЗначение) Тогда
		ОтборПериодЗначение.Вариант = ВариантСтандартногоПериода.Месяц;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрПериодичность) Тогда
		ПараметрПериодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя");
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("СФормироватьПриОткрытии", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура ПараметрПериодичностьПриИзменении(Элемент)
	
	ОбновитьДиаграммуНовыеПоПериодам();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаНовыеОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВРег(Расшифровка) = ВРег("Новые") Тогда
		ПризнакРасшифровки = НСтр("ru = 'Новые'");
		ЗаголовокФормы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Анализ базы лидов (расшифровка %1)'"),
			НСтр("ru = 'новых'"));
	ИначеЕсли ВРег(Расшифровка) = ВРег("Существующие") Тогда
		ПризнакРасшифровки = НСтр("ru = 'Существующие'");
		ЗаголовокФормы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Анализ базы лидов (расшифровка %1)'"),
			НСтр("ru = 'существующих'"));
	КонецЕсли;
	
	ТекстОтборов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 лиды за период: с %2 по %3%4%5%6'"),
		ПризнакРасшифровки,
		Формат(?(ВРег(Расшифровка) = ВРег("Новые"), ОтборПериодЗначение.ДатаНачала, ОтборПериодСравнения.ДатаНачала), "ДФ=dd.MM.yyyy"),
		Формат(?(ВРег(Расшифровка) = ВРег("Новые"), ОтборПериодЗначение.ДатаОкончания, ОтборПериодСравнения.ДатаОкончания), "ДФ=dd.MM.yyyy"),
		?(ЗначениеЗаполнено(ОтборСтатус), ", со статусом: " + ОтборСтатус, ""),
		?(ОтборВидКонтакта.Количество() > 0, ", с видом контакта: " + Строка(ОтборВидКонтакта), ""),
		?(ОтборРекламныйИсточник.Количество() > 0, ", с рекламным источником: " + Строка(ОтборРекламныйИсточник), ""),
		?(ОтборРекламнаяАкция.Количество() > 0, ", с рекламной акцией: " + Строка(ОтборРекламнаяАкция), ""),
		?(ОтборТочкаПродаж.Количество() > 0, ", с точкой продаж: " + Строка(ОтборТочкаПродаж), ""),
		?(ОтборМенеджеры.Количество() > 0, ", по менеджерам: " + Строка(ОтборМенеджеры), ""));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", ЗаголовокФормы);
	ПараметрыФормы.Вставить("ПредставлениеОтборов", Новый ФорматированнаяСтрока(ТекстОтборов, Новый Шрифт(,,Истина)));
	ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуНовых(Расшифровка));
	
	ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаНовыеПоПериодамОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВРег(ПараметрПериодичность) = ВРег("День") Тогда
		ПредставлениеПериода = Формат(Расшифровка, "ДФ=dd.MM.yyyy");
	ИначеЕсли ВРег(ПараметрПериодичность) = ВРег("Неделя") Тогда
		ПредставлениеПериода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'неделю с %1 по %2'"),
			Формат(Расшифровка, "ДФ=dd.MM.yyyy"),
			Формат(КонецНедели(Расшифровка), "ДФ=dd.MM.yyyy"));
	ИначеЕсли ВРег(ПараметрПериодичность) = ВРег("Месяц") Тогда
		ПредставлениеПериода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'месяц с %1 по %2'"),
			Формат(Расшифровка, "ДФ=dd.MM.yyyy"),
			Формат(КонецМесяца(Расшифровка), "ДФ=dd.MM.yyyy"));
	ИначеЕсли ВРег(ПараметрПериодичность) = ВРег("Год") Тогда
		ПредставлениеПериода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'год с %1 по %2'"),
			Формат(Расшифровка, "ДФ=dd.MM.yyyy"),
			Формат(КонецГода(Расшифровка), "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	ТекстОтборов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Новые лиды за %1 %2%3%4'"),
		ПредставлениеПериода,
		?(ЗначениеЗаполнено(ОтборСтатус), ", со статусом: " + ОтборСтатус, ""),
		?(ОтборВидКонтакта.Количество() > 0, ", с видом контакта: " + Строка(ОтборВидКонтакта), ""),
		?(ОтборРекламныйИсточник.Количество() > 0, ", с рекламным источником: " + Строка(ОтборРекламныйИсточник), ""),
		?(ОтборРекламнаяАкция.Количество() > 0, ", с рекламной акцией: " + Строка(ОтборРекламнаяАкция), ""),
		?(ОтборТочкаПродаж.Количество() > 0, ", с точкой продаж: " + Строка(ОтборТочкаПродаж), ""),
		?(ОтборМенеджеры.Количество() > 0, ", по менеджерам: " + Строка(ОтборМенеджеры), ""));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Анализ базы лидов (расшифровка новых за период)'"));
	ПараметрыФормы.Вставить("ПредставлениеОтборов", Новый ФорматированнаяСтрока(ТекстОтборов, Новый Шрифт(,,Истина)));
	ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуНовыхЗаПериод(Расшифровка));
	
	ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаПоМенеджерамОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекстОтборов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Лиды менеджера: %1'"),
		?(ТипЗнч(Расшифровка) = Тип("Массив"), "<сводно>", Расшифровка),
		?(ЗначениеЗаполнено(ОтборСтатус), ", со статусом: " + ОтборСтатус, ""),
		?(ОтборВидКонтакта.Количество() > 0, ", с видом контакта: " + Строка(ОтборВидКонтакта), ""),
		?(ОтборРекламныйИсточник.Количество() > 0, ", с рекламным источником: " + Строка(ОтборРекламныйИсточник), ""),
		?(ОтборРекламнаяАкция.Количество() > 0, ", с рекламной акцией: " + Строка(ОтборРекламнаяАкция), ""),
		?(ОтборТочкаПродаж.Количество() > 0, ", с точкой продаж: " + Строка(ОтборТочкаПродаж), ""));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Анализ базы лидов (расшифровка по менеджерам)'"));
	ПараметрыФормы.Вставить("ПредставлениеОтборов", Новый ФорматированнаяСтрока(ТекстОтборов, Новый Шрифт(,,Истина)));
	ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуПоМенеджерам(Расшифровка));
	
	ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерыЛегендаДиаграммыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылка = "ПоказатьОстальные" Тогда
		Если ПустаяСтрока(МенеджерыОстальныеОтображение) Тогда
			МенеджерыОстальныеОтображение = МенеджерыОстальные;
		Иначе
			МенеджерыОстальныеОтображение = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура СформироватьОтчет()
	
	ОбновитьДиаграммуНовые();
	ОбновитьДиаграммуНовыеПоПериодам();
	ОбновитьДиаграммуПоМенеджерам();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуНовые()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	КОЛИЧЕСТВО(Лиды.Ссылка) КАК КоличествоВсего,
		|	СУММА(ВЫБОР
		|			КОГДА Лиды.Дата МЕЖДУ &НовыеНачало И &НовыеКонец
		|				ТОГДА 0
		|			КОГДА Лиды.Дата МЕЖДУ &СуществующиеНачало И &СуществующиеКонец
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоВсего,
		|	СУММА(ВЫБОР
		|			КОГДА Лиды.Дата МЕЖДУ &НовыеНачало И &НовыеКонец
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоНовых
		|ИЗ
		|	Документ.Лид КАК Лиды
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ";
		
	Если ЗначениеЗаполнено(ОтборСтатус) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.ТекущийСтатус = &ОтборСтатус";
		Запрос.УстановитьПараметр("ОтборСтатус", ОтборСтатус);
	КонецЕсли;
	
	Если ОтборВидКонтакта.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.ВидКонтакта В (&ОтборВидКонтакта)";
		Запрос.УстановитьПараметр("ОтборВидКонтакта", ОтборВидКонтакта);
	КонецЕсли;
	
	Если ОтборРекламныйИсточник.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.РекламныйИсточник В (&ОтборРекламныйИсточник)";
		Запрос.УстановитьПараметр("ОтборРекламныйИсточник", ОтборРекламныйИсточник);
	КонецЕсли;
	
	Если ОтборРекламнаяАкция.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.РекламнаяАкция В (&ОтборРекламнаяАкция)";
		Запрос.УстановитьПараметр("ОтборРекламнаяАкция", ОтборРекламнаяАкция);
	КонецЕсли;
	
	Если ОтборТочкаПродаж.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.ТочкаПродаж В (&ОтборТочкаПродаж)";
		Запрос.УстановитьПараметр("ОтборТочкаПродаж", ОтборТочкаПродаж);
	КонецЕсли;
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.Автор В (&ОтборМенеджеры)";
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НовыеНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("НовыеКонец", ОтборПериодЗначение.ДатаОкончания);
	
	Запрос.УстановитьПараметр("СуществующиеНачало", ОтборПериодСравнения.ДатаНачала);
	Запрос.УстановитьПараметр("СуществующиеКонец", ?(ОтборПериодСравнения.ДатаОкончания = Дата(1,1,1), ТекущаяДатаСеанса(), ОтборПериодСравнения.ДатаОкончания));
	
	ВыборкаОбщийИтог = Запрос.Выполнить().Выбрать();
	Если ВыборкаОбщийИтог.Следующий() Тогда
		Новых = ?(ВыборкаОбщийИтог.КоличествоНовых = Null, 0, ВыборкаОбщийИтог.КоличествоНовых);
		//Существующих = ?(ВыборкаОбщийИтог.КоличествоВсего = Null, 0, ВыборкаОбщийИтог.КоличествоВсего - Новых);
		Существующих = ?(ВыборкаОбщийИтог.КоличествоВсего = Null, 0, ВыборкаОбщийИтог.КоличествоВсего);
	Иначе
		Новых = 0;
		Существующих = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПериодЗначение.ДатаНачала) И ЗначениеЗаполнено(ОтборПериодЗначение.ДатаОкончания) Тогда
		Элементы.ЗаголовокНовые.Заголовок = НСтр("ru = 'Новые лиды за период: '") + Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=dd.MM.yy") + " - " + Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yy");
	Иначе
		Элементы.ЗаголовокНовые.Заголовок = НСтр("ru = 'Новые лиды за: (период не указан)'");
	КонецЕсли;
	
	ДиаграммаНовые.Обновление = Ложь;
	ДиаграммаНовые.Очистить();
	ДиаграммаНовые.АвтоТранспонирование = Ложь;
	ДиаграммаНовые.МаксимумСерий = МаксимумСерий.НеЗадано;
	ДиаграммаНовые.ВидПодписей = ВидПодписейКДиаграмме.СерияЗначение;
	ДиаграммаНовые.РазделительПодписей = ": ";
	ДиаграммаНовые.ШрифтПодписей = Новый Шрифт(ШрифтыСтиля.МелкийШрифтТекста, , , Истина);
	ДиаграммаНовые.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	
	Точка = ДиаграммаНовые.Точки.Добавить("Количество");
	Точка.Текст = "Количество";
	Точка.ПриоритетЦвета = Ложь;
	
	СерияНовые = ДиаграммаНовые.Серии.Добавить("Новые");
	Подсказка = НСтр("ru = 'Создано новых лидов за период: '") + Новых;
	ДиаграммаНовые.УстановитьЗначение(Точка, СерияНовые, Новых, "Новые", Подсказка);
	
	СерияСуществующие = ДиаграммаНовые.Серии.Добавить("Существующие");
	Подсказка = НСтр("ru = 'Существующих лидов: '") + Существующих;
	ДиаграммаНовые.УстановитьЗначение(Точка, СерияСуществующие, Существующих, "Существующие", Подсказка);
	
	ДиаграммаНовые.АвтоТранспонирование = Истина;
	ДиаграммаНовые.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуНовыеПоПериодам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(Лиды.Дата, НЕДЕЛЯ) КАК Дата,
		|	Лиды.Ссылка КАК Новый
		|ИЗ
		|	Документ.Лид КАК Лиды
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ
		|	И Лиды.Дата МЕЖДУ &НовыеНачало И &НовыеКонец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ
		|	КОЛИЧЕСТВО(Новый)
		|ПО
		|	Дата ПЕРИОДАМИ(НЕДЕЛЯ, &НовыеНачало, &НовыеКонец)";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕДЕЛЯ", ВРег(Строка(ПараметрПериодичность)));
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	Если ЗначениеЗаполнено(ОтборСтатус) Тогда
		ОтборЗапроса.Добавить("Лиды.ТекущийСтатус = &ОтборСтатус");
		Запрос.УстановитьПараметр("ОтборСтатус", ОтборСтатус);
	КонецЕсли;
	
	Если ОтборВидКонтакта.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.ВидКонтакта В (&ОтборВидКонтакта)");
		Запрос.УстановитьПараметр("ОтборВидКонтакта", ОтборВидКонтакта);
	КонецЕсли;
	
	Если ОтборРекламныйИсточник.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.РекламныйИсточник В (&ОтборРекламныйИсточник)");
		Запрос.УстановитьПараметр("ОтборРекламныйИсточник", ОтборРекламныйИсточник);
	КонецЕсли;
	
	Если ОтборРекламнаяАкция.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.РекламнаяАкция В (&ОтборРекламнаяАкция)");
		Запрос.УстановитьПараметр("ОтборРекламнаяАкция", ОтборРекламнаяАкция);
	КонецЕсли;
	
	Если ОтборТочкаПродаж.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.ТочкаПродаж В (&ОтборТочкаПродаж)");
		Запрос.УстановитьПараметр("ОтборТочкаПродаж", ОтборТочкаПродаж);
	КонецЕсли;
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.Автор В (&ОтборМенеджеры)");
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("НовыеНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("НовыеКонец", ОтборПериодЗначение.ДатаОкончания);
	
	ВыборкаДата = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Дата", "Все");
	
	ДиаграммаНовыеПоПериодам.Обновление = Ложь;
	ДиаграммаНовыеПоПериодам.Очистить();
	ДиаграммаНовыеПоПериодам.АвтоТранспонирование = Ложь;
	ДиаграммаНовыеПоПериодам.МаксимумСерий = МаксимумСерий.НеЗадано;
	ДиаграммаНовыеПоПериодам.ВидПодписей = ВидПодписейКДиаграмме.Значение;
	ДиаграммаНовыеПоПериодам.ШрифтПодписей = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
	ДиаграммаНовыеПоПериодам.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	ДиаграммаНовыеПоПериодам.ФорматЗначенийВПодписях = "ЧДЦ=; ЧН=' '";
	ДиаграммаНовыеПоПериодам.АвтоУстановкаТекстаТочек = Ложь;
	ДиаграммаНовыеПоПериодам.ОбластьПостроения.ОтображатьПодписиШкалыТочек = Истина;
	ДиаграммаНовыеПоПериодам.ОбластьПостроения.Шрифт = Новый Шрифт(ШрифтыСтиля.МелкийШрифтТекста, , 7);
	
	Серия = ДиаграммаНовыеПоПериодам.Серии.Добавить("Новые");
	Серия.Линия = Новый Линия(ТипЛинииДиаграммы.Сплошная, 2);
	Серия.Маркер = ТипМаркераДиаграммы.Круг;
	Серия.ПриоритетЦвета = Истина;
	
	Пока ВыборкаДата.Следующий() Цикл
		Текст = Формат(ВыборкаДата.Дата, "ДФ=dd.MM.yy");
		Точка = ДиаграммаНовыеПоПериодам.Точки.Добавить(Текст);
		Подсказка = НСтр("ru = 'Создано '") + ВыборкаДата.Новый + НСтр("ru = ' лидов '") + Текст;
		ДиаграммаНовыеПоПериодам.УстановитьЗначение(Точка, Серия, ?(ВыборкаДата.Новый = Null, 0, ВыборкаДата.Новый), ВыборкаДата.Дата, Подсказка);
	КонецЦикла;
	
	ДиаграммаНовыеПоПериодам.АвтоТранспонирование = Истина;
	ДиаграммаНовыеПоПериодам.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуПоМенеджерам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(Лиды.Ссылка) КАК Лиды,
		|	Лиды.Автор КАК Автор,
		|	Лиды.Автор.Представление КАК АвторПредставление
		|ИЗ
		|	Документ.Лид КАК Лиды
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ
		|	И Лиды.Дата МЕЖДУ &НовыеНачало И &НовыеКонец
		|
		|СГРУППИРОВАТЬ ПО
		|	Лиды.Автор,
		|	Лиды.Автор.Представление
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лиды УБЫВ,
		|	Лиды.Автор.Наименование";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	Если ЗначениеЗаполнено(ОтборСтатус) Тогда
		ОтборЗапроса.Добавить("Лиды.ТекущийСтатус = &ОтборСтатус");
		Запрос.УстановитьПараметр("ОтборСтатус", ОтборСтатус);
	КонецЕсли;
	
	Если ОтборВидКонтакта.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.ВидКонтакта В (&ОтборВидКонтакта)");
		Запрос.УстановитьПараметр("ОтборВидКонтакта", ОтборВидКонтакта);
	КонецЕсли;
	
	Если ОтборРекламныйИсточник.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.РекламныйИсточник В (&ОтборРекламныйИсточник)");
		Запрос.УстановитьПараметр("ОтборРекламныйИсточник", ОтборРекламныйИсточник);
	КонецЕсли;
	
	Если ОтборРекламнаяАкция.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.РекламнаяАкция В (&ОтборРекламнаяАкция)");
		Запрос.УстановитьПараметр("ОтборРекламнаяАкция", ОтборРекламнаяАкция);
	КонецЕсли;
	
	Если ОтборТочкаПродаж.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.ТочкаПродаж В (&ОтборТочкаПродаж)");
		Запрос.УстановитьПараметр("ОтборТочкаПродаж", ОтборТочкаПродаж);
	КонецЕсли;
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.Автор В (&ОтборМенеджеры)");
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("НовыеНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("НовыеКонец", ОтборПериодЗначение.ДатаОкончания);
	
	ВыборкаАвтор = Запрос.Выполнить().Выбрать();
	
	// Для диаграммы используем свой механизм сводной серии, иначе не вывести произвольную легенду
	
	ДиаграммаПоМенеджерам.Обновление = Ложь;
	ДиаграммаПоМенеджерам.Очистить();
	ДиаграммаПоМенеджерам.АвтоТранспонирование = Ложь;
	ДиаграммаПоМенеджерам.МаксимумСерий = МаксимумСерий.НеЗадано;
	ДиаграммаПоМенеджерам.ВидПодписей = ВидПодписейКДиаграмме.СерияПроцент;
	ДиаграммаПоМенеджерам.ШрифтПодписей = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
	ДиаграммаПоМенеджерам.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	ДиаграммаПоМенеджерам.ФорматПроцентовВПодписях = "ЧДЦ=";
	ДиаграммаПоМенеджерам.ОбластьПостроения.Шрифт = ШрифтыСтиля.МелкийШрифтТекста;
	
	Точка = ДиаграммаПоМенеджерам.Точки.Добавить("Количество");
	Точка.Текст = "Количество";
	Точка.ПриоритетЦвета = Ложь;
	
	СтрокиЛегенды = Новый Массив;
	СтрокиОстальные = Новый Массив;
	ПорядковыйНомерСерии = 0;
	МаксимумСерийДиаграммы = 6;
	МассивЦветов=ДиаграммаПоМенеджерам.ПолучитьПалитру();
	
	Пока ВыборкаАвтор.Следующий() Цикл
		
		Если ПорядковыйНомерСерии < МаксимумСерийДиаграммы Тогда
			
			ПредставлениеМенеджера = ?(ЗначениеЗаполнено(ВыборкаАвтор.Автор), ВыборкаАвтор.АвторПредставление, НСтр("ru = '<Менеджер не указан>'"));
			Серия = ДиаграммаПоМенеджерам.Серии.Добавить(ПредставлениеМенеджера);
			Подсказка = ПредставлениеМенеджера + НСтр("ru = ', лидов: '") + ВыборкаАвтор.Лиды;
			ДиаграммаПоМенеджерам.УстановитьЗначение(Точка, Серия, ВыборкаАвтор.Лиды, ВыборкаАвтор.Автор, Подсказка);
			
			ЛегендаДиаграммы = Новый ФорматированнаяСтрока("█", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, "@Arial Unicode MS"), МассивЦветов[ПорядковыйНомерСерии]);
			ФорматированнаяСтрока = Новый ФорматированнаяСтрока(Подсказка, ШрифтыСтиля.ОбычныйШрифтТекста);
			СтрокаЛегенды = Новый ФорматированнаяСтрока(ЛегендаДиаграммы, Символы.НПП, ФорматированнаяСтрока, Символы.ПС);
			СтрокиЛегенды.Добавить(СтрокаЛегенды);
			
		Иначе
			
			ПредставлениеМенеджера = НСтр("ru = '<Остальные>'");
			
			Серия = ДиаграммаПоМенеджерам.Серии.Получить(ДиаграммаПоМенеджерам.Серии.Количество() - 1);
			Серия.Текст = ПредставлениеМенеджера;
			
			СводноеЗначение = ДиаграммаПоМенеджерам.ПолучитьЗначение(Точка, Серия);
			
			ПредыдущаяПодсказка = СводноеЗначение.Подсказка;
			Подсказка = ПредставлениеМенеджера + НСтр("ru = ', лидов: '") + (СводноеЗначение.Значение + ВыборкаАвтор.Лиды);
			
			Расшифровка = СводноеЗначение.Расшифровка;
			Если ТипЗнч(Расшифровка) = Тип("Массив") Тогда
				Расшифровка.Добавить(ВыборкаАвтор.Автор);
			Иначе
				Расшифровка = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Расшифровка);
				Расшифровка.Добавить(ВыборкаАвтор.Автор);
			КонецЕсли;
			
			ДиаграммаПоМенеджерам.УстановитьЗначение(Точка, Серия, СводноеЗначение.Значение + ВыборкаАвтор.Лиды, Расшифровка, Подсказка);
			
			ЛегендаДиаграммы = Новый ФорматированнаяСтрока("█", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, "@Arial Unicode MS"), Серия.Цвет);
			ФорматированнаяСтрока = Новый ФорматированнаяСтрока(Подсказка, ШрифтыСтиля.ОбычныйШрифтТекста, , , "ПоказатьОстальные");
			СтрокаЛегенды = Новый ФорматированнаяСтрока(ЛегендаДиаграммы, Символы.НПП, ФорматированнаяСтрока, Символы.ПС);
			СтрокиЛегенды[СтрокиЛегенды.ВГраница()] = СтрокаЛегенды;
			
			Если ПорядковыйНомерСерии = МаксимумСерийДиаграммы Тогда
				ФорматированнаяСтрока = Новый ФорматированнаяСтрока(ПредыдущаяПодсказка, ШрифтыСтиля.ОбычныйШрифтТекста);
				СтрокаОстальные = Новый ФорматированнаяСтрока(Символы.НПП + Символы.НПП, ФорматированнаяСтрока, Символы.ПС);
				СтрокиОстальные.Добавить(СтрокаОстальные);
			КонецЕсли;
			
			ТекстПодробно = ?(ЗначениеЗаполнено(ВыборкаАвтор.Автор), ВыборкаАвтор.АвторПредставление, НСтр("ru = '<Менеджер не указан>'"))
				+ НСтр("ru = ', лидов: '") + ВыборкаАвтор.Лиды;
			ФорматированнаяСтрока = Новый ФорматированнаяСтрока(ТекстПодробно, ШрифтыСтиля.ОбычныйШрифтТекста);
			СтрокаОстальные = Новый ФорматированнаяСтрока(Символы.НПП + Символы.НПП, ФорматированнаяСтрока, Символы.ПС);
			СтрокиОстальные.Добавить(СтрокаОстальные);
			
		КонецЕсли;
		
		ПорядковыйНомерСерии = ПорядковыйНомерСерии + 1;
		
	КонецЦикла;
	
	ДиаграммаПоМенеджерам.АвтоТранспонирование = Истина;
	ДиаграммаПоМенеджерам.Обновление = Истина;
	
	МенеджерыЛегендаДиаграммы = Новый ФорматированнаяСтрока(СтрокиЛегенды);
	МенеджерыОстальные = Новый ФорматированнаяСтрока(СтрокиОстальные);
	МенеджерыОстальныеОтображение = "";
	
КонецПроцедуры

&НаСервере
Функция СформироватьРасшифровкуНовых(Признак)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НовыеЛиды";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НовыеЛиды";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	СтруктураОбластей = Новый Структура;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("ПФ_MXL_ЛидыРасшифровка");
	
	СтруктураОбластей.Вставить("Шапка",	 Макет.ПолучитьОбласть("Шапка"));
	СтруктураОбластей.Вставить("Строка", Макет.ПолучитьОбласть("Строка"));
	СтруктураОбластей.Вставить("Итог",	 Макет.ПолучитьОбласть("Итог"));
	СтруктураОбластей.Вставить("Отступ", Макет.ПолучитьОбласть("Отступ"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лиды.Ссылка КАК Лид,
		|	ВЫБОР
		|		КОГДА Лиды.Дата МЕЖДУ &НовыеНачало И &НовыеКонец
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Новый,
		|	Лиды.Автор КАК Менеджер,
		|	Лиды.Дата КАК Создан,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Ссылка) КАК ПредставлениеЛида,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Автор) КАК ПредставлениеМенеджера,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.ТекущийСтатус) КАК Статус,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.ВидКонтакта) КАК ВидКонтакта,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.РекламныйИсточник) КАК РекламныйИсточник,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.РекламнаяАкция) КАК РекламнаяАкция,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.ТочкаПродаж) КАК ТочкаПродаж
		|ИЗ
		|	Документ.Лид КАК Лиды
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Создан УБЫВ";
		
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	Если ВРег(Признак) = ВРег("Новые") Тогда
		ОтборЗапроса.Добавить("Лиды.Дата МЕЖДУ &НовыеНачало И &НовыеКонец");
	ИначеЕсли ВРег(Признак) = ВРег("Существующие") Тогда
		ОтборЗапроса.Добавить("НЕ (Лиды.Дата МЕЖДУ &НовыеНачало И &НовыеКонец)");
		ОтборЗапроса.Добавить("Лиды.Дата МЕЖДУ &СуществующиеНачало И &СуществующиеКонец");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСтатус) Тогда
		ОтборЗапроса.Добавить("Лиды.ТекущийСтатус = &ОтборСтатус");
		Запрос.УстановитьПараметр("ОтборСтатус", ОтборСтатус);
	КонецЕсли;
	
	Если ОтборВидКонтакта.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.ВидКонтакта В (&ОтборВидКонтакта)");
		Запрос.УстановитьПараметр("ОтборВидКонтакта", ОтборВидКонтакта);
	КонецЕсли;
	
	Если ОтборРекламныйИсточник.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.РекламныйИсточник В (&ОтборРекламныйИсточник)");
		Запрос.УстановитьПараметр("ОтборРекламныйИсточник", ОтборРекламныйИсточник);
	КонецЕсли;
	
	Если ОтборРекламнаяАкция.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.РекламнаяАкция В (&ОтборРекламнаяАкция)");
		Запрос.УстановитьПараметр("ОтборРекламнаяАкция", ОтборРекламнаяАкция);
	КонецЕсли;
	
	Если ОтборТочкаПродаж.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.ТочкаПродаж В (&ОтборТочкаПродаж)");
		Запрос.УстановитьПараметр("ОтборТочкаПродаж", ОтборТочкаПродаж);
	КонецЕсли;
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.Автор В (&ОтборМенеджеры)");
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("НовыеНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("НовыеКонец", ОтборПериодЗначение.ДатаОкончания);
	
	Запрос.УстановитьПараметр("СуществующиеНачало", ОтборПериодСравнения.ДатаНачала);
	Запрос.УстановитьПараметр("СуществующиеКонец", ?(ОтборПериодСравнения.ДатаОкончания = Дата(1,1,1), ТекущаяДатаСеанса(), ОтборПериодСравнения.ДатаОкончания));
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Шапка);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	НовыйИтог = 0;

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураОбластей.Строка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(СтруктураОбластей.Строка);
		
		НовыйИтог = НовыйИтог + Число(Выборка.Новый);
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	СтруктураОбластей.Итог.Параметры.НовыйИтог = НовыйИтог;
	ТабличныйДокумент.Вывести(СтруктураОбластей.Итог);
	
	Возврат ПоместитьВоВременноеХранилище(ТабличныйДокумент, ЭтотОбъект.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция СформироватьРасшифровкуНовыхЗаПериод(ДатаРасшифровки)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НовыеЛидыЗаПериод";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НовыеЛидыЗаПериод";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	СтруктураОбластей = Новый Структура;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("ПФ_MXL_ЛидыРасшифровка");
	
	СтруктураОбластей.Вставить("Шапка",	 Макет.ПолучитьОбласть("Шапка"));
	СтруктураОбластей.Вставить("Строка", Макет.ПолучитьОбласть("Строка"));
	СтруктураОбластей.Вставить("Итог",	 Макет.ПолучитьОбласть("Итог"));
	СтруктураОбластей.Вставить("Отступ", Макет.ПолучитьОбласть("Отступ"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лиды.Ссылка КАК Лид,
		|	ИСТИНА КАК Новый,
		|	Лиды.Автор КАК Менеджер,
		|	Лиды.Дата КАК Создан,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Ссылка) КАК ПредставлениеЛида,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Автор) КАК ПредставлениеМенеджера,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.ТекущийСтатус) КАК Статус,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.ВидКонтакта) КАК ВидКонтакта,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.РекламныйИсточник) КАК РекламныйИсточник,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.РекламнаяАкция) КАК РекламнаяАкция,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.ТочкаПродаж) КАК ТочкаПродаж
		|ИЗ
		|	Документ.Лид КАК Лиды
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ
		|	И НАЧАЛОПЕРИОДА(Лиды.Дата, НЕДЕЛЯ) = &ДатаРасшифровки
		|	И Лиды.Дата МЕЖДУ &НовыеНачало И &НовыеКонец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Создан УБЫВ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕДЕЛЯ", ВРег(Строка(ПараметрПериодичность)));
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	Если ЗначениеЗаполнено(ОтборСтатус) Тогда
		ОтборЗапроса.Добавить("Лиды.ТекущийСтатус = &ОтборСтатус");
		Запрос.УстановитьПараметр("ОтборСтатус", ОтборСтатус);
	КонецЕсли;
	
	Если ОтборВидКонтакта.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.ВидКонтакта В (&ОтборВидКонтакта)");
		Запрос.УстановитьПараметр("ОтборВидКонтакта", ОтборВидКонтакта);
	КонецЕсли;
	
	Если ОтборРекламныйИсточник.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.РекламныйИсточник В (&ОтборРекламныйИсточник)");
		Запрос.УстановитьПараметр("ОтборРекламныйИсточник", ОтборРекламныйИсточник);
	КонецЕсли;
	
	Если ОтборРекламнаяАкция.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.РекламнаяАкция В (&ОтборРекламнаяАкция)");
		Запрос.УстановитьПараметр("ОтборРекламнаяАкция", ОтборРекламнаяАкция);
	КонецЕсли;
	
	Если ОтборТочкаПродаж.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.ТочкаПродаж В (&ОтборТочкаПродаж)");
		Запрос.УстановитьПараметр("ОтборТочкаПродаж", ОтборТочкаПродаж);
	КонецЕсли;
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.Автор В (&ОтборМенеджеры)");
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("НовыеНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("НовыеКонец", ОтборПериодЗначение.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаРасшифровки", ДатаРасшифровки);
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Шапка);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	НовыйИтог = 0;

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураОбластей.Строка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(СтруктураОбластей.Строка);
		
		НовыйИтог = НовыйИтог + Число(Выборка.Новый);
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	СтруктураОбластей.Итог.Параметры.НовыйИтог = НовыйИтог;
	ТабличныйДокумент.Вывести(СтруктураОбластей.Итог);
	
	Возврат ПоместитьВоВременноеХранилище(ТабличныйДокумент, ЭтотОбъект.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция СформироватьРасшифровкуПоМенеджерам(Менеджеры)
	
	Если ТипЗнч(Менеджеры) <> Тип("Массив") Тогда
		Менеджеры = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Менеджеры);
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ЛидыПоМенеджерам";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЛидыПоМенеджерам";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	СтруктураОбластей = Новый Структура;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("ПФ_MXL_ЛидыРасшифровка");
	
	СтруктураОбластей.Вставить("Шапка",	 Макет.ПолучитьОбласть("Шапка"));
	СтруктураОбластей.Вставить("Строка", Макет.ПолучитьОбласть("Строка"));
	СтруктураОбластей.Вставить("Итог",	 Макет.ПолучитьОбласть("Итог"));
	СтруктураОбластей.Вставить("Отступ", Макет.ПолучитьОбласть("Отступ"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лиды.Ссылка КАК Лид,
		|	ВЫБОР
		|		КОГДА Лиды.Дата МЕЖДУ &НовыеНачало И &НовыеКонец
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Новый,
		|	Лиды.Автор КАК Менеджер,
		|	Лиды.Дата КАК Создан,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Ссылка) КАК ПредставлениеЛида,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Автор) КАК ПредставлениеМенеджера,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.ТекущийСтатус) КАК Статус,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.ВидКонтакта) КАК ВидКонтакта,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.РекламныйИсточник) КАК РекламныйИсточник,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.РекламнаяАкция) КАК РекламнаяАкция,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.ТочкаПродаж) КАК ТочкаПродаж
		|ИЗ
		|	Документ.Лид КАК Лиды
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ
		|	И Лиды.Автор В(&Менеджеры)
		|	И Лиды.Дата МЕЖДУ &НовыеНачало И &НовыеКонец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Создан УБЫВ";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	Если ЗначениеЗаполнено(ОтборСтатус) Тогда
		ОтборЗапроса.Добавить("Лиды.ТекущийСтатус = &ОтборСтатус");
		Запрос.УстановитьПараметр("ОтборСтатус", ОтборСтатус);
	КонецЕсли;
	
	Если ОтборВидКонтакта.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.ВидКонтакта В (&ОтборВидКонтакта)");
		Запрос.УстановитьПараметр("ОтборВидКонтакта", ОтборВидКонтакта);
	КонецЕсли;
	
	Если ОтборРекламныйИсточник.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.РекламныйИсточник В (&ОтборРекламныйИсточник)");
		Запрос.УстановитьПараметр("ОтборРекламныйИсточник", ОтборРекламныйИсточник);
	КонецЕсли;
	
	Если ОтборРекламнаяАкция.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.РекламнаяАкция В (&ОтборРекламнаяАкция)");
		Запрос.УстановитьПараметр("ОтборРекламнаяАкция", ОтборРекламнаяАкция);
	КонецЕсли;
	
	Если ОтборТочкаПродаж.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.ТочкаПродаж В (&ОтборТочкаПродаж)");
		Запрос.УстановитьПараметр("ОтборТочкаПродаж", ОтборТочкаПродаж);
	КонецЕсли;
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.Автор В (&ОтборМенеджеры)");
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("НовыеНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("НовыеКонец", ОтборПериодЗначение.ДатаОкончания);
	Запрос.УстановитьПараметр("Менеджеры", Менеджеры);
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Шапка);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	НовыйИтог = 0;

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураОбластей.Строка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(СтруктураОбластей.Строка);
		
		НовыйИтог = НовыйИтог + Число(Выборка.Новый);
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	СтруктураОбластей.Итог.Параметры.НовыйИтог = НовыйИтог;
	ТабличныйДокумент.Вывести(СтруктураОбластей.Итог);
	
	Возврат ПоместитьВоВременноеХранилище(ТабличныйДокумент, ЭтотОбъект.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура СФормироватьПриОткрытии()
	
	СформироватьОтчет();
	
КонецПроцедуры

#КонецОбласти
