
&НаСервере
Процедура ПоказатьЗадачиВРаботеНаСервере()
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Выполнена");
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Выполнена");
	ЭО.ПравоеЗначение=Ложь;
	ЭО.Использование=Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВРаботе(Команда)
	ПоказатьЗадачиВРаботеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоказатьВсеЗадачиНаСервере()
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Выполнена");
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВсеЗадачи(Команда)
	ПоказатьВсеЗадачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь",  ПараметрыСеанса.ТекущийПользователь);
	ПоказатьЗадачиВРаботеНаСервере();
КонецПроцедуры
