Функция ПолучитьПутьФайлаЗаписи_Sipuni(ИДЗаписи, НомерВАТС, ДоменAPI, КлючAPI) Экспорт
	
	Схема = "https://";
	Результат="";
	Если Не ЗначениеЗаполнено(ИДЗаписи) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НомерВАТС) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДанныеJSON="{'user':'"+НомерВАТС+"','id':'"+ИДЗаписи+"'}";
	Подпись=ПодписатьПакет_Sipuni(ДанныеJSON, КлючAPI);
	ДанныеJSON=СортироватьПоляПакета_Sipuni(ДанныеJSON);
	ДанныеJSON="{"+ДанныеJSON+",'hash':'"+Подпись+"'}";
	ДанныеJSON=СофтФонКлиентСервер.Stringify(ДанныеJSON);
	Результат="/api/statistic/record?"+СофтФонКлиентСервер.JSON2URL(ДанныеJSON);
	
	Результат=Схема+ДоменAPI+Результат;
	
	Возврат Результат;
	
КонецФункции

Функция ПодписатьПакет_Sipuni(JSONПакет, КлючAPI) Экспорт
	
	Результат=""; Разделитель="+";
	
	Данные=СофтФонКлиентСервер.ПолучитьДанныеJSON(JSONПакет,Истина);
	Если Не ТипЗнч(Данные)=Тип("Соответствие") Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОписаниеСтроки=Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки());
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Ключ",ОписаниеСтроки);
	ТЗ.Колонки.Добавить("Значение",ОписаниеСтроки);
	
	Для каждого Элемент Из Данные Цикл
	
		СтрТЗ=ТЗ.Добавить();
		СтрТЗ.Ключ=Элемент.Ключ;
		СтрТЗ.Значение=Элемент.Значение;
	
	КонецЦикла;
	ТЗ.Сортировать("Ключ Возр");
	
	Для каждого Элемент Из ТЗ Цикл
		Результат=Результат+Элемент.Значение+Разделитель;
	КонецЦикла;
	Результат=Результат+КлючAPI;
	Результат=MD5(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция СортироватьПоляПакета_Sipuni(JSONПакет) Экспорт
	
	Данные=СофтФонКлиентСервер.ПолучитьДанныеJSON(JSONПакет,Истина);
	Если Не ТипЗнч(Данные)=Тип("Соответствие") Тогда
		Возврат JSONПакет;
	КонецЕсли;
	
	ОписаниеСтроки=Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки());
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Ключ",ОписаниеСтроки);
	ТЗ.Колонки.Добавить("Значение",ОписаниеСтроки);
	
	Для каждого Элемент Из Данные Цикл
	
		СтрТЗ=ТЗ.Добавить();
		СтрТЗ.Ключ=Элемент.Ключ;
		СтрТЗ.Значение=Элемент.Значение;
	
	КонецЦикла;
	ТЗ.Сортировать("Ключ Возр");
	
	Пакет=""; Разделитель=","; 
	Для каждого Элемент Из ТЗ Цикл
		Пакет=Пакет+"'"+Элемент.Ключ+"':'"+Элемент.Значение+"'"+Разделитель;
	КонецЦикла;
	Пакет=Лев(Пакет,СтрДлина(Пакет)-1);
	
	Возврат Пакет;
	
КонецФункции

Функция MD5(СтрХеширования) Экспорт

	MD5=Новый ХешированиеДанных(ХешФункция.MD5);
	MD5.Добавить(СтрХеширования);
	ДанныеMD5=НРег(СтрЗаменить(Строка(MD5.ХешСумма)," ",""));
	Возврат ДанныеMD5;

КонецФункции

Функция КодироватьДанныеПакета(ДанныеПакета) Экспорт
	Возврат КодироватьСтроку(ДанныеПакета,СпособКодированияСтроки.КодировкаURL);
КонецФункции

// Размещает команду Позвонить на форме.
//
// Параметры:
//   Форма                            - УправляемаяФорма - форма, в которой необходимо разместить кнопку.
//   МестоРазмещенияКомандПоУмолчанию - ЭлементФормы - группа, в которую необходимо разместить кнопку,
//                                                     по умолчанию размещается в командную панель формы.
//#6969
Процедура ПриСозданииНаСервере(Форма, МестоРазмещения = Неопределено, СуффиксКоманды = "") Экспорт //, Действие = Неопределено) Экспорт
	
	Если НЕ Софтфон.ДоступныИсходящиеЗвонки() 
		ИЛИ НЕ ПараметрыСеанса.ТелефонияВыполняетИсходящиеЗвонки Тогда // №9362 раньше было: ПараметрыСеанса.ТелефонияПринимаетВходящиеЗвонки
	    Возврат;
	КонецЕсли;
	
	Если МестоРазмещения = Неопределено Тогда
		МестоРазмещения = Форма.КоманднаяПанель;
	КонецЕсли;	
	
	ИмяКоманды = "ВыполнитьИсходящийЗвонок" + СуффиксКоманды;	
	Действие   = "Подключаемый_ВыполнитьИсходящийЗвонок";
	
	КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
	КомандаФормы.Подсказка = "Выполнить исходящий звонок";
	КомандаФормы.Заголовок = "Выполнить исходящий звонок";
	КомандаФормы.Отображение = ОтображениеКнопки.Картинка;
	КомандаФормы.Картинка = БиблиотекаКартинок.Позвонить;
	КомандаФормы.Действие = Действие;	
	
	ИмяРеквизита = "Форма" + ИмяКоманды;
	КнопкаФормы = Форма.Элементы.Добавить(ИмяРеквизита, Тип("КнопкаФормы"), МестоРазмещения); 		
	КнопкаФормы.ИмяКоманды = ИмяКоманды;		
	Если МестоРазмещения.Вид = ВидГруппыФормы.КоманднаяПанель ИЛИ МестоРазмещения.Вид = ВидГруппыФормы.ГруппаКнопок Тогда
		КнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Иначе
		КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КонецЕсли;
	
КонецПроцедуры

Функция ДатаИзСтроки(Знач СтрДата) Экспорт
	
	//"2018-03-22 15:11:13" -> Дата
	
	СтрДата=СтрЗаменить(СтрДата,"-","");
	СтрДата=СтрЗаменить(СтрДата,":","");
	СтрДата=СтрЗаменить(СтрДата," ","");
	СтрДата=Лев(СтрДата,14);
	
	Попытка
		Дата=Дата(СтрДата);
	Исключение
		Дата='00010101';
	КонецПопытки; 
	
	Возврат Дата;
	
КонецФункции