#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	//#16346
	Поля.Добавить("ВидЗаказа");
 	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	СтандартнаяОбработка = Ложь;
 
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	//#16346
	СтандартнаяОбработка = Ложь;
	
	СоответствиеПредставлений = Новый Соответствие;
	СоответствиеПредставлений.Вставить(Справочники.ВидыЗаказДоговоров.ПустаяСсылка(), "Заказ клиента");
	СоответствиеПредставлений.Вставить(Справочники.ВидыЗаказДоговоров.Договор, "Заказ клиента (договор)");
	СоответствиеПредставлений.Вставить(Справочники.ВидыЗаказДоговоров.Продажа, "Заказ клиента (продажа)");
	СоответствиеПредставлений.Вставить(Справочники.ВидыЗаказДоговоров.Рекламация, "Заказ клиента (рекламация)");
	СоответствиеПредставлений.Вставить(Справочники.ВидыЗаказДоговоров.СервиснаяЗаявка, "Заказ клиента (сервисная заявка)");
	
    Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
        НСтр("ru = '%1 №%2 от %3'"),
        СоответствиеПредставлений.Получить(Данные.ВидЗаказа),
        Данные.Номер,
        Данные.Дата
	);
		
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Договор
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
    КомандаПечати.Идентификатор = "Договор";
    КомандаПечати.Представление = НСтр("ru = 'Договор'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 10;
	
	//Договор в рассрочку
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
    КомандаПечати.Идентификатор = "ДоговорРассрочка";
    КомандаПечати.Представление = НСтр("ru = 'Договор (рассрочка)'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 20;
		
	//Приложение (по комнатам)
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
    КомандаПечати.Идентификатор = "Смета";
    КомандаПечати.Представление = НСтр("ru = 'Смета'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 30;
	
	Если ПолучитьФункциональнуюОпцию("ПечатьФормМонтажаИзЗаказДоговора") Тогда
		//Акт выполненных работ 
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
		КомандаПечати.Идентификатор = "АктВыполненныхРабот";
		КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
		КомандаПечати.Порядок = 40;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыМонтажаБезСкидок") Тогда
			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
			КомандаПечати.Идентификатор = "АктВыполненныхРабот_ПересчетЦены";
			КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ (пересчет цены по скидке)'");
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.Порядок = 45;
		КонецЕсли;
		
		//Гарантийный талон 
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
		КомандаПечати.Идентификатор = "ГарантийныйТалон";
		КомандаПечати.Представление = НСтр("ru = 'Гарантийный талон'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
		КомандаПечати.Порядок = 50;
		
		//Комплект для монтажников
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
		КомандаПечати.Идентификатор = "КомплектДляМонтажников";
		КомандаПечати.Представление = НСтр("ru = 'Комплект для монтажников'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
		КомандаПечати.Порядок = 70;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыМонтажаБезСкидок") Тогда
			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
			КомандаПечати.Идентификатор = "КомплектДляМонтажников_ПересчетЦены";
			КомандаПечати.Представление = НСтр("ru = 'Комплект для монтажников (пересчет цены по скидке)'");
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.Порядок = 75;
		КонецЕсли;
	КонецЕсли;

	//Комплект для клиента
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
    КомандаПечати.Идентификатор = "КомплектДляКлиента";
    КомандаПечати.Представление = НСтр("ru = 'Комплект для клиента'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 60;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыМонтажаБезСкидок") Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
		КомандаПечати.Идентификатор = "КомплектДляКлиента_ПересчетЦены";
		КомандаПечати.Представление = НСтр("ru = 'Комплект для клиента (пересчет цены по скидке)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 65;
	КонецЕсли;
	
	//#14602
	Если ПолучитьФункциональнуюОпцию("ЗаполнениеМатериаловРозницы") = 0 Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
		КомандаПечати.Идентификатор = "Материалы";
		КомандаПечати.Представление = НСтр("ru = 'Материалы'");
		КомандаПечати.Порядок = 77; 
		КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Материалы'");	
	КонецЕсли;
	
	//Счет на оплату
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
    КомандаПечати.Идентификатор = "СчетНаОплату";
    КомандаПечати.Представление = НСтр("ru = 'Счет на оплату'");
	КомандаПечати.Порядок = 80;
    //КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Счет на оплату'");
	
	// Счет на оплату (с печатью и подписями) 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
	КомандаПечати.Идентификатор  = "СчетНаОплатуСПечатью";
	КомандаПечати.Представление  = НСтр("ru = 'Счет на оплату (с печатью и подписями) '");
	КомандаПечати.Порядок = 85;
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Счет на оплату'");
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Договор") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "Договор",
        НСтр("ru = 'Договор'"),
        ПечатьДоговор(МассивОбъектов, ОбъектыПечати),
        ,
        "Документ.ЗаказДоговор.ПФ_MXL_Договор");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорРассрочка") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "ДоговорРассрочка",
        НСтр("ru = 'Договор (рассрочка)'"),
        ПечатьДоговор(МассивОбъектов, ОбъектыПечати, Истина),
        ,
        "Документ.ЗаказДоговор.ПФ_MXL_ДоговорРассрочка");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктВыполненныхРабот") Тогда 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктВыполненныхРабот", НСтр("ru = 'Акт выполненных работ'"),
	    	ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктВыполненныхРабот_ПересчетЦены") Тогда 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктВыполненныхРабот_ПересчетЦены", НСтр("ru = 'Акт выполненных работ (пересчет цены по скидке)'"),
	    	ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати, Истина));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Смета") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "Смета",
        НСтр("ru = 'Смета'"),
        ПечатьПриложениеПоКомнатам(МассивОбъектов, ОбъектыПечати),
        ,
		"Документ.ЗаказДоговор.ПФ_MXL_СметаСоСкидкой");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ГарантийныйТалон") Тогда 
	    УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	    КоллекцияПечатныхФорм,
	    "ГарантийныйТалон",
	    НСтр("ru = 'Гарантийный талон'"),
	    ПечатьГарантийныйТалон(МассивОбъектов, ОбъектыПечати),
	    ,
	    "Документ.Монтаж.ПФ_MXL_ГарантийныйТалон");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КомплектДляКлиента") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КомплектДляКлиента", НСтр("ru = 'Комплект для клиента'"),
        	ПечатьКомплектДляКлиента(МассивОбъектов, ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КомплектДляКлиента_ПересчетЦены") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КомплектДляКлиента_ПересчетЦены", НСтр("ru = 'Комплект для клиента (пересчет цены по скидке)'"),
        	ПечатьКомплектДляКлиента(МассивОбъектов, ОбъектыПечати, Истина));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КомплектДляМонтажников") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КомплектДляМонтажников", НСтр("ru = 'Комплект для монтажников'"),
        		ПечатьКомплектДляМонтажников(МассивОбъектов, ОбъектыПечати));				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КомплектДляМонтажников_ПересчетЦены") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КомплектДляМонтажников_ПересчетЦены", НСтр("ru = 'Комплект для монтажников (пересчет цены по скидке)'"),
        		ПечатьКомплектДляМонтажников(МассивОбъектов, ОбъектыПечати, Истина));
				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплату") Тогда		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетНаОплату", НСтр("ru = 'Счет на оплату'"),
        		ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати));		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплатуСПечатью") Тогда		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетНаОплатуСПечатью", НСтр("ru = 'Счет на оплату (с печатью и подписями)'"),
        		ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, Истина));
				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Материалы") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Материалы", НСтр("ru = 'Материалы'"),
        	ОбщийМодульСервер.ПечатьРозницаМатериалы(МассивОбъектов, ОбъектыПечати, "Документ.ЗаказДоговор.ПФ_MXL_Материалы"));
			
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекстЗапроса(СДаннымиПоМонтажу=Ложь)
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументЗаказДоговор.Ссылка,
	|	ДокументЗаказДоговор.ВерсияДанных,
	|	ДокументЗаказДоговор.ПометкаУдаления,
	|	ДокументЗаказДоговор.Номер,
	|	ДокументЗаказДоговор.Дата КАК ДатаДокумента,
	|	ВЫРАЗИТЬ("""" КАК Строка(15)) КАК Дата,
	|	ДокументЗаказДоговор.Проведен,
	|	ДокументЗаказДоговор.Адрес,
	|	ДокументЗаказДоговор.Валюта,
	|	ДокументЗаказДоговор.ВидСкидки,
	|	ДокументЗаказДоговор.ИсполнительЗамера,
	|	ДокументЗаказДоговор.Комментарий,
	|	ДокументЗаказДоговор.Контрагент,
	|	ВЫБОР КОГДА НЕ ДокументЗаказДоговор.Контрагент.НаименованиеПолное = """"
	|		ТОГДА
	|			ДокументЗаказДоговор.Контрагент.НаименованиеПолное
	|		ИНАЧЕ
	|			ДокументЗаказДоговор.Контрагент.Наименование
	|		КОНЕЦ КАК ПредставлениеКонтрагента,	
	|	ДокументЗаказДоговор.Контрагент.КонтактноеЛицоПодписант КАК КонтрагентПодписант,
	|	ДокументЗаказДоговор.Контрагент.КонтактноеЛицоПодписант.Должность КАК КонтрагентПодписантДолжность,
	|	ДокументЗаказДоговор.Менеджер,
	|	ДокументЗаказДоговор.НомерДоговора,
	|	ДокументЗаказДоговор.Основание,
	|	ДокументЗаказДоговор.Автор,
	|	ДокументЗаказДоговор.СуммаДокумента,
	|	ДокументЗаказДоговор.ДоговорРассторгнут,
	|	СоглашениеОРасторженииДоговора.ПричинаРасторженияДоговора,
	|	ДокументЗаказДоговор.Организация КАК Организация,
	|	ДокументЗаказДоговор.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
	|	ДокументЗаказДоговор.Организация.ЯвляетсяПлательщикомНДС КАК ЯвляетсяПлательщикомНДС,
	|	ДокументЗаказДоговор.Организация.Руководитель КАК ОрганизацияПодписант,
	|	ДокументЗаказДоговор.Организация.Руководитель.Должность КАК ОрганизацияПодписантДолжность,
	|	ДокументЗаказДоговор.ВидЦен,
	|	ДокументЗаказДоговор.ТоварыУслуги.(
	|		Ссылка,
	|		НомерСтроки,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|		Количество,
	|		ЕдиницаИзмерения,
	|		Коэффициент,
	|		Цена,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС,
	|		Спецификация,
	|		ПроцентСкидки,
	|		СуммаСкидки,
	//|		ЦветФактуры,
	|		НомерПотолка,
	|		Комната
	|	) КАК ТоварыУслуги,
	|	ДокументЗаказДоговор.Материалы.(
	|		Ссылка,
	|		НомерСтроки,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|		Количество,
	|		ЕдиницаИзмерения,
	|		Коэффициент
	|	) КАК Материалы,
	|	ДокументЗаказДоговор.Представители.(
	|		Ссылка,
	|		НомерСтроки,
	|		ФИО,
	|		КонтактныйТелефон,
	|		Комментарий
	|	),
	|	ДокументЗаказДоговор.ГрафикОплат.(
	|		Ссылка,
	|		НомерСтроки,
	|		ДатаПлатежа КАК ДатаПлатежаДокумент,
	|		""текстовая строка"" КАК ДатаПлатежа,
	|		Сумма
	|	) КАК ГрафикОплат,
	|	ДокументЗаказДоговор.Представление,
	|	ДокументЗаказДоговор.МоментВремени,
	|	РасчетыПоЗаказамОстатки.СуммаОстаток КАК ДолгПоДоговору,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК ОбщийДолг,
	|	ДокументыУдостоверяющиеЛичность.Вид КАК ПаспортВид,
	|	ДокументыУдостоверяющиеЛичность.Серия КАК ПаспортСерия,
	|	ДокументыУдостоверяющиеЛичность.Номер КАК ПаспортНомер,
	|	ДокументыУдостоверяющиеЛичность.КемВыдан КАК ПаспортКемВыдан,
	|	ДокументыУдостоверяющиеЛичность.ДатаВыдачи КАК ПаспортДатаВыдачи,
	|	ВалютаУчета.Значение.Ссылка КАК ВалютаУчета";
	
	Если СДаннымиПоМонтажу Тогда
		ТекстЗапроса = ТекстЗапроса +
		",
		|	Монтаж.Бригада КАК Бригада,
		|	Монтаж.Бригадир КАК Бригадир,
		|	Монтаж.ДатаМонтажа КАК ДатаМонтажа,
		|	Монтаж.ВремяНачала КАК ВремяНачала,
		|	Монтаж.ВремяОкончания КАК ВремяОкончания,
		|	""01.01.0001"" КАК ДатаМонтажаФормат,
		|	""00:00:00"" КАК ВремяНачалаФормат,
		|	""00:00:00"" КАК ВремяОкончанияФормат";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	" ИЗ
	|	Документ.ЗаказДоговор КАК ДокументЗаказДоговор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
    |		ПО ДокументЗаказДоговор.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
    |			И ДокументЗаказДоговор.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыУдостоверяющиеЛичность КАК ДокументыУдостоверяющиеЛичность
	|		ПО ДокументЗаказДоговор.Контрагент.ДокументУдостоверяющийЛичность = ДокументыУдостоверяющиеЛичность.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
    |		ПО ДокументЗаказДоговор.Ссылка = РасчетыПоЗаказамОстатки.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СоглашениеОРасторженииДоговора КАК СоглашениеОРасторженииДоговора
	|		ПО ДокументЗаказДоговор.Ссылка = СоглашениеОРасторженииДоговора.ЗаказДоговор";
	
	Если СДаннымиПоМонтажу Тогда
		ТекстЗапроса = ТекстЗапроса +
		"		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Монтаж КАК Монтаж
		|		ПО (Монтаж.Основание = ДокументЗаказДоговор.Ссылка)
		|		И НЕ Монтаж.ПометкаУдаления";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + ", Константа.ВалютаУчета КАК ВалютаУчета";
	
	ТекстЗапроса = ТекстЗапроса +
	" ГДЕ
	|	ДокументЗаказДоговор.Ссылка В(&МассивОбъектов)";	

	Возврат ТекстЗапроса;
КонецФункции

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, ВключатьДанныеМонтажей = Истина) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВключатьДанныеМонтажей", ВключатьДанныеМонтажей);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());
	Запрос.Текст = 	
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДокументЗаказДоговор.Ссылка КАК Ссылка,
    |	ДокументЗаказДоговор.ВерсияДанных КАК ВерсияДанных,
    |	ДокументЗаказДоговор.ПометкаУдаления КАК ПометкаУдаления,
    |	ДокументЗаказДоговор.Номер КАК Номер,
	
    |	ДокументЗаказДоговор.Дата КАК ДатаДокумента,
	|	ДокументЗаказДоговор.ДатаДоговора КАК ДатаДоговора,
	//#16268
	//|	ДокументЗаказДоговор.Дата КАК Дата,
	|	ДокументЗаказДоговор.ДатаДоговора КАК Дата,
	
    |	ДокументЗаказДоговор.Проведен КАК Проведен,
    |	ДокументЗаказДоговор.Адрес КАК Адрес,
    |	ДокументЗаказДоговор.Валюта КАК Валюта,
    |	ДокументЗаказДоговор.ВидСкидки КАК ВидСкидки,
    |	ДокументЗаказДоговор.ИсполнительЗамера КАК ИсполнительЗамера,
    |	ДокументЗаказДоговор.Комментарий КАК Комментарий,
    |	ДокументЗаказДоговор.Контрагент КАК Контрагент,
    |	ВЫБОР
    |		КОГДА НЕ ДокументЗаказДоговор.Контрагент.НаименованиеПолное = """"
    |			ТОГДА ДокументЗаказДоговор.Контрагент.НаименованиеПолное
    |		ИНАЧЕ ДокументЗаказДоговор.Контрагент.Наименование
    |	КОНЕЦ КАК ПредставлениеКонтрагента,
    |	ДокументЗаказДоговор.Контрагент.КонтактноеЛицоПодписант КАК КонтрагентПодписант,
    |	ДокументЗаказДоговор.Контрагент.КонтактноеЛицоПодписант.Должность КАК КонтрагентПодписантДолжность,
    |	ДокументЗаказДоговор.Менеджер КАК Менеджер,
    |	ДокументЗаказДоговор.НомерДоговора КАК НомерДоговора,
    |	ДокументЗаказДоговор.Основание КАК Основание,
    |	ДокументЗаказДоговор.Автор КАК Автор,
    |	ДокументЗаказДоговор.Менеджер КАК МенеджерДоговора,
    |	ДокументЗаказДоговор.СуммаДокумента КАК СуммаДокумента,
	|	""текст расшифровки НДС"" КАК НДС,
	|	0 КАК СуммаНДС,
	|	0 КАК СуммаСкидки,
	|	0 КАК Скидка,
	|	0 КАК СуммаИтогСкидка,
	|	0 КАК СуммаТоваров,
	|	0 КАК СуммаУслуг,
	|	0 КАК ПлощадьПотолков,
	|	0 КАК ПлощадьЗаказа,
	|	0 КАК КоличествоКомнат,
	|	0 КАК КолвоПозиций,
	|	0 КАК ИтогоСуммаСкидки,
	|	0 КАК ИтогоСуммаНДС,
	|	0 КАК ИтогоСумма,
    |	ДокументЗаказДоговор.СуммаДокумента КАК Сумма,
    |	ДокументЗаказДоговор.ДоговорРассторгнут КАК ДоговорРассторгнут,
    |	СоглашениеОРасторженииДоговора.ПричинаРасторженияДоговора КАК ПричинаРассторженияДоговора,
    |	СоглашениеОРасторженииДоговора.ПричинаРасторженияДоговора КАК ПричинаРасторженияДоговора,
    |	ДокументЗаказДоговор.Организация КАК Организация,
    |	ВЫБОР
    |		КОГДА НЕ ДокументЗаказДоговор.Организация.ПолноеНаименование = """"
    |			ТОГДА ДокументЗаказДоговор.Организация.ПолноеНаименование
    |		ИНАЧЕ ДокументЗаказДоговор.Организация.Наименование
    |	КОНЕЦ КАК ПредставлениеОрганизации,
    |	ДокументЗаказДоговор.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
    |	ДокументЗаказДоговор.Организация.ЯвляетсяПлательщикомНДС КАК ЯвляетсяПлательщикомНДС,
    |	ДокументЗаказДоговор.Организация.Руководитель КАК ОрганизацияПодписант,
    |	ДокументЗаказДоговор.Организация.Руководитель.Должность КАК ОрганизацияПодписантДолжность,
    |	ДокументЗаказДоговор.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
    |	ДокументЗаказДоговор.Организация.ОсновнойБанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
    |	ДокументЗаказДоговор.Организация.ОсновнойБанковскийСчет.БИК КАК БанковскийСчетБИК,
    |	ДокументЗаказДоговор.Организация.ОсновнойБанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
    |	ДокументЗаказДоговор.Организация.ОсновнойБанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
    |	ДокументЗаказДоговор.Организация.ЯвляетсяПлательщикомНДС КАК ОрганизацияЯвляетсяПлательщикомНДС,
    |	"""" КАК ИнтернетОплатаСсылка,
    |	"""" КАК ИнтернетОплатаНомерТелефонаПлательщика,
    |	"""" КАК ИнтернетОплатаЭлектроннаяПочтаПлательщика,
    |	ДокументЗаказДоговор.Организация.ИНН КАК ИНН,
    |	ДокументЗаказДоговор.Организация.КПП КАК КПП,
    |	ВЫБОР
    |		КОГДА НЕ ДокументЗаказДоговор.Контрагент.НаименованиеПолное = """"
    |			ТОГДА ДокументЗаказДоговор.Контрагент.НаименованиеПолное
    |		ИНАЧЕ ДокументЗаказДоговор.Контрагент.Наименование
    |	КОНЕЦ КАК КонтрагентНаименованиеПолное,
    |	ДокументЗаказДоговор.Контрагент.ИНН КАК КонтрагентИНН,
    |	ДокументЗаказДоговор.ВидЦен КАК ВидЦен,
    |	ДокументЗаказДоговор.Представление КАК Представление,
    |	ДокументЗаказДоговор.МоментВремени КАК МоментВремени,
    |	ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК ДолгПоДоговору,
    |	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК ОбщийДолг,
    |	ДокументыУдостоверяющиеЛичность.Вид КАК ПаспортВид,
    |	ДокументыУдостоверяющиеЛичность.Серия КАК ПаспортСерия,
    |	ДокументыУдостоверяющиеЛичность.Номер КАК ПаспортНомер,
    |	ДокументыУдостоверяющиеЛичность.КемВыдан КАК ПаспортКемВыдан,
    |	ДокументыУдостоверяющиеЛичность.ДатаВыдачи КАК ПаспортДатаВыдачи,
    |	ВалютаУчета.Значение.Ссылка КАК ВалютаУчета,
    |	Монтаж.Бригада КАК Бригада,
    |	Монтаж.Бригадир КАК Бригадир,
    |	Монтаж.ДатаМонтажа КАК ДатаМонтажа,
    |	Монтаж.ВремяНачала КАК ВремяНачала,
    |	Монтаж.ВремяОкончания КАК ВремяОкончания
    |ИЗ
    |	Документ.ЗаказДоговор КАК ДокументЗаказДоговор
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
    |		ПО ДокументЗаказДоговор.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
    |			И ДокументЗаказДоговор.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация
    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыУдостоверяющиеЛичность КАК ДокументыУдостоверяющиеЛичность
    |		ПО ДокументЗаказДоговор.Контрагент.ДокументУдостоверяющийЛичность = ДокументыУдостоверяющиеЛичность.Ссылка
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
    |		ПО ДокументЗаказДоговор.Ссылка = РасчетыПоЗаказамОстатки.Заказ
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СоглашениеОРасторженииДоговора КАК СоглашениеОРасторженииДоговора
    |		ПО ДокументЗаказДоговор.Ссылка = СоглашениеОРасторженииДоговора.ЗаказДоговор
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Монтаж КАК Монтаж
    |		ПО (&ВключатьДанныеМонтажей)
    |			И (Монтаж.Основание = ДокументЗаказДоговор.Ссылка)
    |			И (НЕ Монтаж.ПометкаУдаления),
    |	Константа.ВалютаУчета КАК ВалютаУчета
    |ГДЕ
    |	ДокументЗаказДоговор.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДокументЗаказДоговор.Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ДанныеТабличнойЧасти.Комната КАК Комната,
	|	ДанныеТабличнойЧасти.Комната КАК КоличествоКомнат,
    |	ВЫБОР
    |		КОГДА &КолонкаАртикул
    |			ТОГДА ДанныеТабличнойЧасти.Номенклатура.Артикул
    |		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Код
    |	КОНЕЦ КАК Код,
    |	ДанныеТабличнойЧасти.Номенклатура.Артикул КАК Артикул,
    |	ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
    |	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ДанныеТабличнойЧасти.Цена КАК Цена,
    |	ДанныеТабличнойЧасти.СуммаСкидки КАК СуммаСкидки,
    |	ДанныеТабличнойЧасти.Сумма КАК Сумма,
    |	ДанныеТабличнойЧасти.СтавкаНДС КАК СтавкаНДС,
    |	ДанныеТабличнойЧасти.СуммаНДС КАК СуммаНДС,
    |	ДанныеТабличнойЧасти.ПроцентСкидки КАК ПроцентСкидки,
    |	ДанныеТабличнойЧасти.Сумма + ДанныеТабличнойЧасти.СуммаСкидки КАК СуммаБезСкидки,
    |	ДанныеТабличнойЧасти.СуммаСкидки КАК Скидка,
    |	ДанныеТабличнойЧасти.Сумма - ДанныеТабличнойЧасти.СуммаНДС КАК СуммаБезНДС,
    |	ДанныеТабличнойЧасти.Сумма КАК СуммаСНДС,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
    |	ВЫБОР
    |		КОГДА ДанныеТабличнойЧасти.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности
    |				ИЛИ ДанныеТабличнойЧасти.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
    |				ИЛИ ДанныеТабличнойЧасти.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
    |				ИЛИ ДанныеТабличнойЧасти.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЭтоПотолок,
	|	ВЫБОР
    |		КОГДА ДанныеТабличнойЧасти.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности
    |				ИЛИ ДанныеТабличнойЧасти.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
    |				ИЛИ ДанныеТабличнойЧасти.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
    |				ИЛИ ДанныеТабличнойЧасти.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
    |			ТОГДА ДанныеТабличнойЧасти.Количество
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК ПлощадьПотолков,
    |	ВЫБОР
    |		КОГДА ДанныеТабличнойЧасти.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал)
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЭтоТовар,
	|	ВЫБОР
    |		КОГДА ДанныеТабличнойЧасти.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал)
    |			ТОГДА ДанныеТабличнойЧасти.Сумма
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК СуммаТоваров,
    |	ВЫБОР
    |		КОГДА ДанныеТабличнойЧасти.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЭтоУслуга,
	|	ВЫБОР
    |		КОГДА ДанныеТабличнойЧасти.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
    |			ТОГДА ДанныеТабличнойЧасти.Сумма
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК СуммаУслуг
    |ИЗ
    |	Документ.ЗаказДоговор.ТоварыУслуги КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	СУММА(СуммаСкидки),
	|	СУММА(СуммаТоваров),
	|	СУММА(СуммаУслуг),
	|	СУММА(ПлощадьПотолков),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоКомнат)
	|ПО
    |	Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ДанныеТабличнойЧасти.Номенклатура.Артикул КАК Артикул,
    |	ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
    |	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ДанныеТабличнойЧасти.Комната КАК Комната,
    |	ДанныеТабличнойЧасти.УИСтроки КАК УИСтроки,
    |	ДанныеТабличнойЧасти.НоменклатураТоваров КАК НоменклатураТоваров
    |ИЗ
    |	Документ.ЗаказДоговор.Материалы КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ДанныеТабличнойЧасти.ДатаПлатежа КАК ДатаПлатежа,
    |	ДанныеТабличнойЧасти.Сумма КАК Сумма
    |ИЗ
    |	Документ.ЗаказДоговор.ГрафикОплат КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ДанныеТабличнойЧасти.ФИО КАК ФИО,
    |	ДанныеТабличнойЧасти.КонтактныйТелефон КАК КонтактныйТелефон,
    |	ДанныеТабличнойЧасти.Комментарий КАК Комментарий
    |ИЗ
    |	Документ.ЗаказДоговор.Представители КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка";
    	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[1];
	РезультатПоТабличнойЧастиМатериалы = МассивРезультатов[2];
	РезультатПоТабличнойЧастиГрафик = МассивРезультатов[3];
	РезультатПоТабличнойЧастиПредставители = МассивРезультатов[4];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти, РезультатПоТабличнойЧастиТовары, РезультатПоТабличнойЧастиМатериалы, РезультатПоТабличнойЧастиГрафик, РезультатПоТабличнойЧастиПредставители",
	                                               РезультатПоШапке, РезультатПоТабличнойЧасти, РезультатПоТабличнойЧасти,       РезультатПоТабличнойЧастиМатериалы, РезультатПоТабличнойЧастиГрафик, РезультатПоТабличнойЧастиПредставители);
	
	Возврат СтруктураДанныхДляПечати;
    
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам=Неопределено) Экспорт
	
	РезультатЗапроса.Колонки.Добавить("ДатаФормат");
	РезультатЗапроса.Колонки.Добавить("ДатаДокументаФормат");
	РезультатЗапроса.Колонки.Добавить("ДатаДоговораФормат");
	
	РезультатЗапроса.Колонки.Добавить("ПредставлениеРеквизитов"); //++ 2019-04-04
	РезультатЗапроса.Колонки.Добавить("ПредставлениеЮридическогоАдреса"); //++ 2019-04-04
	РезультатЗапроса.Колонки.Добавить("ПаспортПредставление");
	//РезультатЗапроса.Колонки.Добавить("СуммаИтогСкидка");
	//РезультатЗапроса.Колонки.Добавить("СуммаНДС");
	
	//РезультатЗапроса.Колонки.Добавить("ИтогоСумма");
	//РезультатЗапроса.Колонки.Добавить("ИтогоСуммаСкидки");
	РезультатЗапроса.Колонки.Добавить("ИтогоСуммаБезСкидки");
	РезультатЗапроса.Колонки.Добавить("ИтоговаяСтрока");
	
	РезультатЗапроса.Колонки.Добавить("СуммаДокументаБезСкидки");   
	РезультатЗапроса.Колонки.Добавить("СуммаПредоплаты");
	РезультатЗапроса.Колонки.Добавить("СуммаКОплате");	
	РезультатЗапроса.Колонки.Добавить("СуммаДокументаПрописью");   
	РезультатЗапроса.Колонки.Добавить("СуммаПредоплатыПрописью"); 
	//РезультатЗапроса.Колонки.Добавить("ПлощадьЗаказа");

	Если РезультатЗапроса.Колонки.Найти("ДатаМонтажаФормат") = Неопределено Тогда
		РезультатЗапроса.Колонки.Добавить("ДатаМонтажаФормат");
	КонецЕсли;
	Если РезультатЗапроса.Колонки.Найти("ВремяНачалаФормат") = Неопределено Тогда
		РезультатЗапроса.Колонки.Добавить("ВремяНачалаФормат");
	КонецЕсли;
	Если РезультатЗапроса.Колонки.Найти("ВремяОкончанияФормат") = Неопределено Тогда
		РезультатЗапроса.Колонки.Добавить("ВремяОкончанияФормат");
	КонецЕсли;
	
	РезультатЗапроса.Колонки.Добавить("ЗамерщикКонтактныйТелефон");
	РезультатЗапроса.Колонки.Добавить("ЗамерщикЛичныйТелефон");
	
	РезультатЗапроса.Колонки.Добавить("ДатаПечати");
	РезультатЗапроса.Колонки.Добавить("ВремяФормированияПФ");
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ТекущаяСтрока.ДатаФормат = Формат(ТекущаяСтрока.Дата, "ДЛФ=D");
		ТекущаяСтрока.ДатаДокументаФормат = Формат(ТекущаяСтрока.ДатаДокумента, "ДЛФ=D");
		ТекущаяСтрока.ДатаДоговораФормат = Формат(ТекущаяСтрока.ДатаДоговора, "ДЛФ=D");
		
		Если НЕ РезультатЗапроса.Колонки.Найти("ГрафикОплат") = Неопределено Тогда
			Для Каждого ПодСтрока Из ТекущаяСтрока.ГрафикОплат Цикл
				ПодСтрока.ДатаПлатежа = Формат(ПодСтрока.ДатаПлатежаДокумент, "ДЛФ=D");
			КонецЦикла;
		КонецЕсли;	
		
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
		Попытка	
		    ТекущаяСтрока.ДатаМонтажаФормат = Формат(ТекущаяСтрока.ДатаМонтажа,"ДЛФ=Д");
			ТекущаяСтрока.ВремяНачалаФормат = Формат(ТекущаяСтрока.ВремяНачала, "ДФ=""ЧЧ:мм:сс""");
			ТекущаяСтрока.ВремяОкончанияФормат = Формат(ТекущаяСтрока.ВремяОкончания, "ДФ=""ЧЧ:мм:сс""");
		Исключение
		КонецПопытки;
		Если ТекущаяСтрока.Контрагент.ВидКонтрагента = Перечисления.ВидКонтрагента.ФизЛицо Тогда
			Если НЕ ПустаяСтрока(ТекущаяСтрока.ПаспортНомер) Тогда
				ТекущаяСтрока.ПаспортПредставление = "Документ: " + ТекущаяСтрока.ПаспортВид + " серия: " + ТекущаяСтрока.ПаспортСерия
					+ " номер: " + ТекущаяСтрока.ПаспортНомер + ", выдан: " + ТекущаяСтрока.ПаспортКемВыдан + " " + Формат(ТекущаяСтрока.ПаспортДатаВыдачи,"ДЛФ=Д");
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ВыборкаПоТоварам = Неопределено Тогда
			СтруктураПоиска = Новый Структура("Ссылка", ТекущаяСтрока.Ссылка);
			ВыборкаПоТоварам.Сбросить();
			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда
				ТекущаяСтрока.СуммаСкидки = ВыборкаПоТоварам.СуммаСкидки;
				ТекущаяСтрока.Скидка = ВыборкаПоТоварам.СуммаСкидки;
				ТекущаяСтрока.СуммаИтогСкидка = ВыборкаПоТоварам.СуммаСкидки;
				ТекущаяСтрока.ИтогоСуммаСкидки = ВыборкаПоТоварам.СуммаСкидки;
				ТекущаяСтрока.СуммаТоваров = ВыборкаПоТоварам.СуммаТоваров;
				ТекущаяСтрока.СуммаУслуг = ВыборкаПоТоварам.СуммаУслуг;
				ТекущаяСтрока.ПлощадьПотолков = ВыборкаПоТоварам.ПлощадьПотолков;
				ТекущаяСтрока.ПлощадьЗаказа = ВыборкаПоТоварам.ПлощадьПотолков;
				ТекущаяСтрока.КоличествоКомнат = ВыборкаПоТоварам.КоличествоКомнат;	
				ТекущаяСтрока.КолвоПозиций = ВыборкаПоТоварам.НомерСтроки;
				ТекущаяСтрока.СуммаНДС = ВыборкаПоТоварам.СуммаНДС;
				ТекущаяСтрока.ИтогоСуммаНДС = ВыборкаПоТоварам.СуммаНДС;
				ТекущаяСтрока.ИтогоСумма = ВыборкаПоТоварам.Сумма;
			КонецЕсли;						
		КонецЕсли;
		//ТекущаяСтрока.СуммаНДС = ТекущаяСтрока.Ссылка.ТоварыУслуги.Итог("СуммаНДС");
		//ТекущаяСтрока.ИтогоСуммаНДС = ТекущаяСтрока.Ссылка.ТоварыУслуги.Итог("СуммаНДС");
		//ТекущаяСтрока.ИтогоСумма = ТекущаяСтрока.Ссылка.ТоварыУслуги.Итог("Сумма");
		
		//ТекущаяСтрока.СуммаИтогСкидка = ТекущаяСтрока.Ссылка.ТоварыУслуги.Итог("СуммаСкидки");
		ТекущаяСтрока.ИтогоСуммаСкидки = ТекущаяСтрока.СуммаИтогСкидка;
		ТекущаяСтрока.СуммаДокументаБезСкидки = ТекущаяСтрока.СуммаДокумента + ТекущаяСтрока.СуммаИтогСкидка;
		
		ТекущаяСтрока.ИтогоСуммаБезСкидки = ТекущаяСтрока.ИтогоСумма + ТекущаяСтрока.ИтогоСуммаСкидки; 
		
		ТекущаяСтрока.СуммаПредоплаты = ПолучитьСуммуПоступленийНаДатуВыполненияМонтажа(ТекущаяСтрока.Ссылка);
		ТекущаяСтрока.СуммаКОплате = ТекущаяСтрока.СуммаДокумента - ТекущаяСтрока.СуммаПредоплаты;
		
		ТекущаяСтрока.СуммаДокументаПрописью = РаботаСВалютой.СформироватьЧислоПрописью(ТекущаяСтрока.СуммаДокумента, ТекущаяСтрока.Валюта, Ложь);		
		ТекущаяСтрока.СуммаПредоплатыПрописью = РаботаСВалютой.СформироватьЧислоПрописью(ТекущаяСтрока.СуммаПредоплаты, ТекущаяСтрока.Валюта, Ложь);

		СведенияОКонтрагенте = ОбщийМодульСервер.СведенияОКонтрагенте(ТекущаяСтрока.Контрагент);
		
		ТекущаяСтрока.ПредставлениеЮридическогоАдреса = ОбщийМодульСервер.ПредставлениеЮридическогоАдреса(СведенияОКонтрагенте.ЮридическийАдрес, (ТекущаяСтрока.Контрагент.ВидКонтрагента = Перечисления.ВидКонтрагента.ЮрЛицо));
	
		Если ТекущаяСтрока.Контрагент.ВидКонтрагента = Перечисления.ВидКонтрагента.ЮрЛицо Тогда
			Сведения = "ИНН, КПП, НомерСчета, Банк, БИК, КоррСчет, ТекстКорреспондента";
			ТекущаяСтрока.ПредставлениеРеквизитов = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте, Сведения); 
		Иначе
			Сведения = "ИНН";
			ПредставлениеРеквизитов = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте, Сведения);
			Если НЕ ПустаяСтрока(ТекущаяСтрока.ПаспортПредставление) Тогда		
				ПредставлениеРеквизитов = ПредставлениеРеквизитов + ?(ПустаяСтрока(ПредставлениеРеквизитов), "", ", ") + ТекущаяСтрока.ПаспортПредставление;
			КонецЕсли;
			ТекущаяСтрока.ПредставлениеРеквизитов = ПредставлениеРеквизитов;
		КонецЕсли;
		
		//ТекущаяСтрока.ПлощадьЗаказа = РассчитатьПлощадьПотолков(ТекущаяСтрока.Ссылка.ТоварыУслуги);
		
		ТекущаяСтрока.ИтоговаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Всего наименований %1, на сумму %2 %3'"),
			//ТекущаяСтрока.Ссылка.ТоварыУслуги.Количество(),
			ТекущаяСтрока.КолвоПозиций,
			Формат(ТекущаяСтрока.СуммаДокумента, "ЧДЦ=2"),
			ТекущаяСтрока.Валюта);	
			
		Если ТекущаяСтрока.ИтогоСуммаНДС = 0 Тогда			
			ТекущаяСтрока.НДС = "Без налога (НДС)";		
		Иначе			
			ТекущаяСтрока.НДС = "В том числе НДС:";	
		КонецЕсли;

		ТекущаяСтрока.ЗамерщикКонтактныйТелефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущаяСтрока.ИсполнительЗамера, Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника);
		ТекущаяСтрока.ЗамерщикЛичныйТелефон     = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущаяСтрока.ИсполнительЗамера, Справочники.ВидыКонтактнойИнформации.ЛичныйТелефонСотрудника);
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);
		
		ТекущаяСтрока.ДатаПечати = Формат(ТекущаяДатаСеанса(), "ДЛФ=Д");
		ТекущаяСтрока.ВремяФормированияПФ = ТекущаяДатаСеанса();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПечатьДоговор(МассивОбъектов, ОбъектыПечати, ДоговорВРассрочку = Ложь)
	
    // Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ЗаказДоговор";
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();

	// №6303 определяем из какого документа получить данные ЗД или СоРД
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбъектов[0]);
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, Истина);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	МенеджерОбъекта.ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	ВыборкаПоТоварам 	 	 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаПоГрафику = Неопределено;
	ВыборкаПоПредставителям = Неопределено;
	Если СтруктураДанныхДляПечати.Свойство("РезультатПоТабличнойЧастиГрафик") Тогда
		ВыборкаПоГрафику         = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиГрафик.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	Если СтруктураДанныхДляПечати.Свойство("РезультатПоТабличнойЧастиПредставители") Тогда
		ВыборкаПоПредставителям  = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиПредставители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	// №6303 определяем из какого документа получить данные ЗД или СоРД
	//ПечатьИзДоговора = (МассивОбъектов.Количество() > 0 И ТипЗнч(МассивОбъектов[0]) = Тип("ДокументСсылка.ЗаказДоговор"));
	
	Если НЕ ДоговорВРассрочку Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказДоговор.ПФ_MXL_Договор");
	Иначе	
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказДоговор.ПФ_MXL_ДоговорРассрочка");
	КонецЕсли;
    // Получаем запросом необходимые данные.
	//Запрос = Новый Запрос();
	//Если ПечатьИзДоговора Тогда
	//	Запрос.Текст = ПолучитьТекстЗапроса(Истина);
	//Иначе
	//	Запрос.Текст = Документы.СоглашениеОРасторженииДоговора.ПолучитьТекстЗапроса(Истина);
	//КонецЕсли;
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	//подготовим итоговую таблицу с данными
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//
	//ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса);
	    
    ПервыйДокумент = Истина;
    Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСекция_СтрокаТабличнойЧастиТовары = Ложь;
		ЕстьСекция_СтрокаТабличнойЧастиПредставители = Ложь;
		ЕстьСекция_СтрокаТабличнойЧастиГрафикПлатежей = Ложь;		
		
		Попытка
			ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаТабличнойЧастиТовары");
			ЕстьСекция_СтрокаТабличнойЧастиТовары = Истина;
		Исключение
		КонецПопытки;
		Попытка
			ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаТабличнойЧастиПредставители");
			ЕстьСекция_СтрокаТабличнойЧастиПредставители = Истина;
		Исключение
		КонецПопытки;
		Попытка
			ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаТабличнойЧастиГрафикПлатежей");
			ЕстьСекция_СтрокаТабличнойЧастиГрафикПлатежей = Истина;
		Исключение
		КонецПопытки;
		
		//шапка 
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			//если номер договора заполнен подставим его
			Если ЗначениеЗаполнено(ДанныеПечати.НомерДоговора) Тогда
				Попытка
					ОбластьМакета.Параметры.Номер = ДанныеПечати.НомерДоговора;
				Исключение
				КонецПопытки;
			КонецЕсли;	
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		// Изменения размера колоноки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		//таблица товаров и услуг
		Если ЕстьСекция_СтрокаТабличнойЧастиТовары Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыТовары|НомерСтроки");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыТовары|Артикул");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыТовары|Данные");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда						
					Выборка = ВыборкаПоТоварам.Выбрать();
					Пока Выборка.Следующий() Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧастиТовары|НомерСтроки");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Если ВыводитьАртикул Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧастиТовары|Артикул");
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(Выборка);
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;
						
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧастиТовары|Данные");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						
						//++ №12909
						//ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
						ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);
						//-- №12909
						
						ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЦикла;
				КонецЕсли;
			
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТабличнойЧастиТовары|НомерСтроки");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТабличнойЧастиТовары|Артикул");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТабличнойЧастиТовары|Данные");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);

			Исключение
			КонецПопытки
		КонецЕсли;
		
		//таблица график платежей
		Если ЕстьСекция_СтрокаТабличнойЧастиГрафикПлатежей И НЕ ВыборкаПоГрафику = Неопределено Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыГрафикПлатежей");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				СтрокаДолгНаНачало = ДанныеПечати.СуммаДокумента;
				СтрокаДолгНаКонец  = ДанныеПечати.СуммаДокумента;
				Если ВыборкаПоГрафику.НайтиСледующий(СтруктураПоиска) Тогда						
					Выборка = ВыборкаПоГрафику.Выбрать();
					Пока Выборка.Следующий() Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧастиГрафикПлатежей");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						Попытка											
							ОбластьМакета.Параметры.СтрокаДолгНаНачало = СтрокаДолгНаНачало;
							СтрокаДолгНаНачало = СтрокаДолгНаНачало - Выборка.Сумма;
						Исключение					
						КонецПопытки;
						Попытка					
							СтрокаДолгНаКонец = СтрокаДолгНаКонец - Выборка.Сумма;
							ОбластьМакета.Параметры.СтрокаДолгНаКонец = СтрокаДолгНаКонец;										
						Исключение					
						КонецПопытки;
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЦикла;
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТабличнойЧастиГрафикПлатежей");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			Исключение
			КонецПопытки
		КонецЕсли;
		
		//таблица представителей
		Если ЕстьСекция_СтрокаТабличнойЧастиПредставители И НЕ ВыборкаПоПредставителям = Неопределено Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПредставители");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыборкаПоПредставителям.НайтиСледующий(СтруктураПоиска) Тогда						
					Выборка = ВыборкаПоТоварам.Выбрать();
					Пока Выборка.Следующий() Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧастиПредставители");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЦикла;
				КонецЕсли;
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТабличнойЧастиПредставители");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			Исключение
			КонецПопытки
		КонецЕсли;
		
		//подвал
		Попытка 
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
		
    Возврат ТабличныйДокумент;
	
КонецФункции

// не используется
Функция СформироватьПечатнуюФормуПриложения(Ссылка, ВыводитьМатериалы = Ложь) Экспорт
	
	Таб = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказДоговор.Номер,
	|	ЗаказДоговор.Дата,
	|	ЗаказДоговор.Валюта,
	|	ЗаказДоговор.ТоварыУслуги.(
	|		НомерСтроки,
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		Количество,
	|		ЕдиницаИзмерения,
	|		Коэффициент,
	|		Цена,
	|		Сумма,
	|		ПроцентСкидки,
	|		СуммаСкидки,
	//|		ЦветФактуры,
	|		НомерПотолка,
	|		Комната
	|	),
	|	ЗаказДоговор.Организация.ПолноеНаименование КАК Организация,
	|	ЗаказДоговор.Контрагент,
	|	ВЫБОР КОГДА НЕ ЗаказДоговор.Контрагент.НаименованиеПолное = """"
	|		ТОГДА
	|			ЗаказДоговор.Контрагент.НаименованиеПолное
	|		ИНАЧЕ
	|			ЗаказДоговор.Контрагент.Наименование
	|		КОНЕЦ КАК ПредставлениеКонтрагента,	
	|	ЗаказДоговор.Адрес,
	|	ЗаказДоговор.НомерДоговора,
	|	ЗаказДоговор.Материалы.(
	|		НомерСтроки,
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		Количество,
	|		ЕдиницаИзмерения,
	|		Коэффициент
	|	)

	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	ЗаказДоговор.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Шапка = Запрос.Выполнить().Выбрать();
	
	Пока Шапка.Следующий() Цикл
		
		ЕстьСкидка = Ложь;
		ВремТовары = Шапка.ТоварыУслуги.Выгрузить();
		Если НЕ ВремТовары.Итог("СуммаСкидки") = 0 тогда
			ЕстьСкидка = Истина;
		КонецЕсли;
		
		Если ЕстьСкидка Тогда
			Макет = ПолучитьМакет("ПриложениеКДоговоруСоСкидками");
		Иначе
			Макет = ПолучитьМакет("ПриложениеКДоговору");
		КонецЕсли;
		
		ТекстЗаголовка = "Заказ-договор №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер) + " от " + Формат(Шапка.Дата, "ДЛф=Д");
	
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		Таб.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ОбластьМакета.Параметры.Организация = Шапка.Организация;
		ОбластьМакета.Параметры.НомерДоговора = Шапка.НомерДоговора;
		Таб.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.Контрагент = Шапка.Контрагент;
		ОбластьМакета.Параметры.Адрес = Шапка.Адрес;
		Таб.Вывести(ОбластьМакета);
	
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаНоменклатура");
		Таб.Вывести(ОбластьМакета);
		Если ЕстьСкидка Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаСкидка");
			Таб.Присоединить(ОбластьМакета);
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаСумма");
		Таб.Присоединить(ОбластьМакета);
		
		Сумма = 0;
		Товары = Шапка.ТоварыУслуги.Выбрать();
		Пока Товары.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаНоменклатура");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
			ПредставлениеНоменклатуры = Строка(Товары.Номенклатура) + Строка(ОбщийМодульСервер.ПредставлениеХарактеристики(Товары.ХарактеристикаНоменклатуры));
			ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
			Таб.Вывести(ОбластьМакета);
			
			Если ЕстьСкидка Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаСкидка");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
				Таб.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаСумма");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
			Таб.Присоединить(ОбластьМакета);
			
			Сумма = Сумма + Товары.Сумма;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого|КолонкаНоменклатура");
		ОбластьМакета.Параметры.Сумма = Сумма;
		ОбластьМакета.Параметры.Валюта = Шапка.Валюта;
		Таб.Вывести(ОбластьМакета);
		
		Если ЕстьСкидка Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|КолонкаСкидка");
			Таб.Присоединить(ОбластьМакета);
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Итого|КолонкаСумма");
		Таб.Присоединить(ОбластьМакета);
		
		Если ВыводитьМатериалы Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаМатериалы");
			Таб.Вывести(ОбластьМакета);
			Материалы = Шапка.Материалы.Выбрать();
			НомерСтроки = 1;
			Пока Материалы.Следующий() Цикл
				Если НЕ Материалы.Номенклатура.Пустая() Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Материалы);
					ПредставлениеНоменклатуры = Строка(Материалы.Номенклатура) + Строка(ОбщийМодульСервер.ПредставлениеХарактеристики(Материалы.ХарактеристикаНоменклатуры));
					ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					Таб.Вывести(ОбластьМакета);
					НомерСтроки = НомерСтроки + 1;
				КонецЕсли;
			КонецЦикла;
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМатериалы");
			Таб.Вывести(ОбластьМакета);
		КонецЕсли;

		
	КонецЦикла;
	
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Возврат Таб;
	
КонецФункции

Функция ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати, ПересчетЦеныПоСкидке = Ложь)
	
	Возврат ОбщийМодульСервер.ПечатьРозницаАктВыполненныхРабот(МассивОбъектов, ОбъектыПечати, ПересчетЦеныПоСкидке);
	
    // Создаем табличный документ и устанавливаем имя параметров печати.
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_АктВыполненныхРабот";
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_АктВыполненныхРабот");
	//ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	//
	//// Получаем запросом необходимые данные.
	//Запрос = Новый Запрос();
	//Запрос.Текст = ПолучитьТекстЗапроса(Истина);
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	//
	////подготовим итоговую таблицу с данными
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса);
	//    
	//ПервыйДокумент = Истина;
	//Для Каждого Шапка Из РезультатЗапроса Цикл
	//    Если Не ПервыйДокумент Тогда
	//        // Все документы нужно выводить на разных страницах.
	//        ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//    КонецЕсли;
	//    ПервыйДокумент = Ложь;
	//    // Запомним номер строки, с которой начали выводить текущий документ.
	//    НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	//	
	//	ЕстьСекцияТабличнойЧасти = Ложь;
	//	ЕстьСекцияОднойУслуги = Ложь;
	//	
	//	Попытка
	//		ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти");
	//		ЕстьСекцияТабличнойЧасти = Истина;
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		//если номер договора заполнен подставим его
	//		Попытка
	//			Если ЗначениеЗаполнено(Шапка.НомерДоговора) Тогда
	//				ОбластьМакета.Параметры.Номер = Шапка.НомерДоговора;
	//			КонецЕсли;
	//		Исключение
	//		КонецПопытки;
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	// Изменения размера колоноки, в зависимости от вывода Артикула
	//	Если Не ВыводитьАртикул Тогда
	//		Попытка
	//			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//	
	//	//заполнение свойств
	//	Если ЕстьСекцияТабличнойЧасти Тогда
	//		//есть секции услуг, выводим шапку таблицы
	//		Попытка
	//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Вывести(ОбластьМакета);
	//			
	//			Если ВыводитьАртикул Тогда
	//				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//				ТабличныйДокумент.Присоединить(ОбластьМакета);
	//			КонецЕсли;
	//			
	//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Присоединить(ОбластьМакета);
	//				
	//		Исключение
	//		КонецПопытки;
	//		Если ЕстьСекцияТабличнойЧасти Тогда
	//			ИмяКомната = "";
	//			//выводим секцию с табличной частью
	//			Для Каждого ВыборкаТоваровУслуг Из Шапка.ТоварыУслуги Цикл
	//				
	//				//НАЧАЛО Хаматов А.Р. 2017-08-31 выводим заголовок комнаты 
	//				Если ИмяКомната <> ВыборкаТоваровУслуг.Комната Тогда
	//					
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|НомерСтроки");
	//					ТабличныйДокумент.Вывести(ОбластьМакета);
	//					
	//					Если ВыводитьАртикул Тогда
	//						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|Артикул");
	//						ТабличныйДокумент.Присоединить(ОбластьМакета);
	//					КонецЕсли;
	//					
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|Данные");
	//					ИмяКомната = ВыборкаТоваровУслуг.Комната;
	//					ОбластьМакета.Область().Шрифт = Новый Шрифт (ОбластьМакета.Область().Шрифт,,,Истина,Истина);  // жирный наклонный шрифт
	//					ОбластьМакета.Параметры.Номенклатура = ИмяКомната;
	//					ТабличныйДокумент.Присоединить(ОбластьМакета);
	//				КонецЕсли;
	//				//КОНЕЦ Хаматов А.Р. 2017-08-31 выводим заголовок комнаты
	//									
	//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|НомерСтроки");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаТоваровУслуг);
	//				ТабличныйДокумент.Вывести(ОбластьМакета);
	//				
	//				Если ВыводитьАртикул Тогда
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|Артикул");
	//					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаТоваровУслуг);
	//					ТабличныйДокумент.Присоединить(ОбластьМакета);
	//				КонецЕсли;
	//				
	//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|Данные");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаТоваровУслуг);
	//				ПредставлениеНоменклатуры = Строка(ВыборкаТоваровУслуг.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(ВыборкаТоваровУслуг.ХарактеристикаНоменклатуры));
	//				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
	//				ТабличныйДокумент.Присоединить(ОбластьМакета);
	//			КонецЦикла;
	//		КонецЕсли;
	//	Иначе
	//		//секций товаров и услуг нет. не выводим ни шапку ни строки
	//	КонецЕсли;
	//	
	//	Попытка 
	//		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Если НЕ Шапка.ЯвляетсяПлательщикомНДС Тогда
	//			ОбластьМакета.Параметры.СтавкаНДС = "Без НДС.";
	//		КонецЕсли;
	//		ОбластьМакета.Параметры.СуммаДокументаПрописью = РаботаСВалютой.СформироватьЧислоПрописью(Шапка.СуммаДокумента, Шапка.Валюта, Ложь);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//    // В табличном документе необходимо задать имя области, в которую был 
	//    // выведен объект. Нужно для возможности печати комплектов документов.
	//    УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
	//        НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	//КонецЦикла;
	//Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьПриложениеПоКомнатам(МассивОбъектов, ОбъектыПечати)
    
    ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПриложениеПоКомнатам";
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	// №6303 определяем из какого документа получить данные ЗД или СоРД
	//ПечатьИзДоговора = (МассивОбъектов.Количество() > 0 И ТипЗнч(МассивОбъектов[0]) = Тип("ДокументСсылка.ЗаказДоговор"));
	
	//печать по ЗД или СоРД 
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбъектов[0]);
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, Ложь);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ВыборкаПоТоварам 	 	 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	МенеджерОбъекта.ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
	
	ТаблицаКомнат = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выгрузить();
	ТаблицаКомнат.Свернуть("Ссылка, Комната", "Сумма");
	
	// Получаем запросом необходимые данные.
	//Запрос = Новый Запрос();
	//Если ПечатьИзДоговора Тогда
	//	Запрос.Текст = ПолучитьТекстЗапроса();
	//Иначе
	//	Запрос.Текст = Документы.СоглашениеОРасторженииДоговора.ПолучитьТекстЗапроса();
	//КонецЕсли;
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	//подготовим итоговую таблицу с данными
	//ТаблицаДанныеПечати = Запрос.Выполнить().Выгрузить();	
	//ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);	
    
    ПервыйДокумент = Истина;
    Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		//ТаблицаТоваров = Шапка.ТоварыУслуги.Скопировать();
		//СуммаСкидки = ТаблицаТоваров.Итог("СуммаСкидки");
		//ЕстьСкидка = (СуммаСкидки > 0);
		ЕстьСкидки = ДанныеПечати.ИтогоСуммаСкидки > 0;
		ЕстьНДС    = ДанныеПечати.ЯвляетсяПлательщикомНДС;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказДоговор.ПФ_MXL_СметаСоСкидкой");
		
		СуффиксОбластиСтроки  = ?(ЕстьНДС, "СНДС", "") + ?(ЕстьСкидки, "СоСкидкой", "");
		СуффиксОбластиКолонки = ?(ЕстьСкидки И ЕстьНДС, "СоСкидкойСНДС", ?(ЕстьСкидки Или ЕстьНДС, "СоСкидкойИлиСНДС", ""));
		
		//ТаблицаКомнат = ТаблицаТоваров.Скопировать();
		//ТаблицаКомнат.Свернуть("Комната","Сумма");
		
		//шапка макета
		СтруктураДанныхШапки = Новый Структура;
		СведенияОбОрганизации = ОбщийМодульСервер.СведенияОбОрганизации(ДанныеПечати.Организация);
		СведенияОКонтрагенте  = ОбщийМодульСервер.СведенияОКонтрагенте(ДанныеПечати.Контрагент);
		
		ПредставлениеОрганизации = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ЮридическийАдрес,Телефоны");
		ПредставлениеПолучателя	 = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте,	"ПолноеНаименование");
		ПредставлениеПолучателя  = ПредставлениеПолучателя + ?(ПустаяСтрока(ДанныеПечати.ПредставлениеРеквизитов), "", ", " + ДанныеПечати.ПредставлениеРеквизитов);
		СтруктураДанныхШапки.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		СтруктураДанныхШапки.Вставить("ПредставлениеПолучателя",  ПредставлениеПолучателя);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
			
		//если номер договора заполнен подставим его
		Если ЗначениеЗаполнено(ДанныеПечати.НомерДоговора) Тогда
			Попытка
				ОбластьМакета.Параметры.Номер = ДанныеПечати.НомерДоговора;
			Исключение
			КонецПопытки;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Изменения размера колонки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("КолонкаАртикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ОбластьНомера  = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикул = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТовар   = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанных  = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
			ОбластьНомераСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикулСтроки= Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТоварСтроки  = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанныхСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
			ОбластьНомераКомната = Макет.ПолучитьОбласть("СтрокаКомнаты" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикулКомната= Макет.ПолучитьОбласть("СтрокаКомнаты" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТоварКомната  = Макет.ПолучитьОбласть("СтрокаКомнаты" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанныхКомната = Макет.ПолучитьОбласть("СтрокаКомнаты" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
		Исключение
			Возврат новый ТабличныйДокумент;
		КонецПопытки;
		
		//шапка таблицы
		ОбластьНомера.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьАртикул Тогда
			ОбластьАртикул.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьАртикул);
		КонецЕсли;
		
		ОбластьТовар.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		ОбластьДанных.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоТоварам.Сбросить();

		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда
						
			ИмяКомната = "";
			//выводим секцию с табличной частью
			
			ВыборкаТоваровУслуг = ВыборкаПоТоварам.Выбрать();
			Пока ВыборкаТоваровУслуг.Следующий() Цикл					 
				Если ИмяКомната <> ВыборкаТоваровУслуг.Комната Тогда
					
					//Комнаты
					НайденныеКомнаты = ТаблицаКомнат.НайтиСтроки(Новый Структура("Ссылка, Комната", ДанныеПечати.Ссылка, ВыборкаТоваровУслуг.Комната));
					ТекущаяКомната = НайденныеКомнаты[0];					
					
					ОбластьНомераКомната.Параметры.Заполнить(ТекущаяКомната);
					ТабличныйДокумент.Вывести(ОбластьНомераКомната);
					
					Если ВыводитьАртикул Тогда
						ОбластьАртикулКомната.Параметры.Заполнить(ТекущаяКомната);
						ТабличныйДокумент.Присоединить(ОбластьАртикулКомната);
					КонецЕсли;
					
					ОбластьТоварКомната.Параметры.Заполнить(ТекущаяКомната);
					ТабличныйДокумент.Присоединить(ОбластьТоварКомната);
					
					ОбластьДанныхКомната.Параметры.Заполнить(ТекущаяКомната);
					ТабличныйДокумент.Присоединить(ОбластьДанныхКомната);
					
					ИмяКомната = ВыборкаТоваровУслуг.Комната;
			
				КонецЕсли;
				
				//товары в комнате
				ОбластьНомераСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
				ТабличныйДокумент.Вывести(ОбластьНомераСтроки);
				
				Если ВыводитьАртикул Тогда
					ОбластьАртикулСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
					ТабличныйДокумент.Присоединить(ОбластьАртикулСтроки);
				КонецЕсли;
				
				ДопДанныеСтроки = Новый Структура;
				//++ №12909
				//ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", 
				//						ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Строка(ВыборкаТоваровУслуг.Номенклатура), Строка(ВыборкаТоваровУслуг.ХарактеристикаНоменклатуры)));
				ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", 
										ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ВыборкаТоваровУслуг.Номенклатура, ВыборкаТоваровУслуг.ХарактеристикаНоменклатуры));
				//-- №12909
				                                                      				
				ОбластьТоварСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
				ОбластьТоварСтроки.Параметры.Заполнить(ДопДанныеСтроки);
				ТабличныйДокумент.Присоединить(ОбластьТоварСтроки);
				
				ОбластьДанныхСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
				ТабличныйДокумент.Присоединить(ОбластьДанныхСтроки);
				
			КонецЦикла;
		КонецЕсли;
		
		// подвал таблицы 
		ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
		ОбластьАртикул = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
		ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
		ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьАртикул Тогда
			ТабличныйДокумент.Присоединить(ОбластьАртикул);
		КонецЕсли;
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		ОбластьДанных.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		// Выводим ИтогоНДС
		Попытка
			ЦенаВключаетНДС = Истина;
			Область = Макет.ПолучитьОбласть("ПодвалНДС");
			СтруктураДанныхПодвалНДС = Новый Структура;
			СтруктураДанныхПодвалНДС.Вставить("ИтогоСуммаНДС", ДанныеПечати.ИтогоСуммаНДС);
			Если ЕстьНДС Тогда
				СтруктураДанныхПодвалНДС.Вставить("НДС", ?(ЦенаВключаетНДС, НСтр("ru='В том числе НДС:'"), НСтр("ru='Сумма НДС:'")));
			Иначе
				СтруктураДанныхПодвалНДС.Вставить("НДС", НСтр("ru='Без налога (НДС)'"));
			КонецЕсли;
			Область.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
			ТабличныйДокумент.Присоединить(Область);
		Исключение
		КонецПопытки;
		
		// Выводим Сумму прописью
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		
		// Выводим подвал с подписями
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);		
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
		
    Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьГарантийныйТалон(МассивОбъектов, ОбъектыПечати)
	
	Возврат ОбщийМодульСервер.ПечатьРозницаГарантийныйТалон(МассивОбъектов, ОбъектыПечати);
	
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ГарантийныйТалон";
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_ГарантийныйТалон");
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = ПолучитьТекстЗапроса(Истина);
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	////подготовим итоговую таблицу с данными
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса);
	//	
	//ПервыйДокумент = Истина;
	//Для Каждого Шапка Из РезультатЗапроса Цикл
	//	
	//	Если Не ПервыйДокумент Тогда
	//		// Все документы нужно выводить на разных страницах.
	//		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	ПервыйДокумент = Ложь;
	//	// Запомним номер строки, с которой начали выводить текущий документ.
	//	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");		
	//	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	// В табличном документе необходимо задать имя области, в которую был 
	//	// выведен объект. Нужно для возможности печати комплектов документов.
	//	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
	//	НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	//	
	//КонецЦикла;
	//		
	//Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьКомплектДляКлиента(МассивОбъектов, ОбъектыПечати, ПересчетЦеныПоСкидке = Ложь)
    
    ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_КомплектДляКлиента";
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	// №6303 определяем из какого документа получить данные ЗД или СоРД
	//ПечатьИзДоговора = (МассивОбъектов.Количество() > 0 И ТипЗнч(МассивОбъектов[0]) = Тип("ДокументСсылка.ЗаказДоговор"));
	
	//печать по ЗД или СоРД 
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбъектов[0]);
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, Ложь);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	МенеджерОбъекта.ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	ВыборкаПоТоварам 	 	 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ТипЗнч(МенеджерОбъекта) = Тип("ДокументМенеджер.ЗаказДоговор") Тогда
		ВыборкаПоГрафику 	 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиГрафик.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати из ТаблицаДанныеПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСкидкиВДокументе = ДанныеПечати.ИтогоСуммаСкидки > 0;
		ЕстьСкидки = ЕстьСкидкиВДокументе И НЕ ПересчетЦеныПоСкидке;
		ЕстьНДС    = ДанныеПечати.ЯвляетсяПлательщикомНДС;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказДоговор.ПФ_MXL_КомплектДляКлиента");
		
		ЕстьСекция_Товары = Ложь;
		ЕстьСекция_ГрафикПлатежей = Ложь;
				
		Попытка
			ОбластьМакета  = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ЕстьСекция_Товары = Истина;
		Исключение
		КонецПопытки;
		Попытка
			ОбластьМакета  = Макет.ПолучитьОбласть("ШапкаТаблицыГрафикПлатежей");
			ЕстьСекция_ГрафикПлатежей = Истина;
		Исключение
		КонецПопытки;
		
		СуффиксОбластиСтроки = ?(ЕстьНДС, "СНДС", "") + ?(ЕстьСкидки, "СоСкидкой", "");
		СуффиксОбластиКолонки = ?(ЕстьСкидки И ЕстьНДС, "СоСкидкойСНДС", ?(ЕстьСкидки Или ЕстьНДС, "СоСкидкойИлиСНДС", ""));
		
		СтруктураДанныхШапки = Новый Структура;
		СведенияОбОрганизации = ОбщийМодульСервер.СведенияОбОрганизации(ДанныеПечати.Организация);
		СведенияОКонтрагенте  = ОбщийМодульСервер.СведенияОКонтрагенте(ДанныеПечати.Контрагент);
		
		ПредставлениеОрганизации = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ЮридическийАдрес,Телефоны");
		ПредставлениеКонтрагента	 = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте,	"ПолноеНаименование");
		ПредставлениеКонтрагента  = ПредставлениеКонтрагента + ?(ПустаяСтрока(ДанныеПечати.ПредставлениеРеквизитов), "", ", " + ДанныеПечати.ПредставлениеРеквизитов);
		СтруктураДанныхШапки.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		СтруктураДанныхШапки.Вставить("ПредставлениеКонтрагента",  ПредставлениеКонтрагента);
		
		//шапка 
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//заголовок			
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка			
				ТекстЗаголовка = "Заказ-договор №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + ДанныеПечати.ДатаФормат;
				ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		// Изменения размера колонки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("КолонкаАртикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ОбластьНомера  = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикул = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТовар   = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанных  = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
			ОбластьНомераСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикулСтроки= Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТоварСтроки  = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанныхСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
		Исключение
			Возврат Новый ТабличныйДокумент;
		КонецПопытки;
		
		Если ЕстьСекция_Товары Тогда
			Попытка
				//шапка таблицы
				ОбластьНомера.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьНомера);
				
				Если ВыводитьАртикул Тогда
					ОбластьАртикул.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Присоединить(ОбластьАртикул);
				КонецЕсли;
				
				ОбластьТовар.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьТовар);
				
				ОбластьДанных.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьДанных);
			Исключение
			КонецПопытки;
			
			СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
			ВыборкаПоТоварам.Сбросить();
			
			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда
				
				//выводим секцию с табличной частью				
				ВыборкаТоваровУслуг = ВыборкаПоТоварам.Выбрать();
				Пока ВыборкаТоваровУслуг.Следующий() Цикл
					
					Попытка
						//товары
						ОбластьНомераСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
						ТабличныйДокумент.Вывести(ОбластьНомераСтроки);
						
						Если ВыводитьАртикул Тогда
							ОбластьАртикулСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
							ТабличныйДокумент.Присоединить(ОбластьАртикулСтроки);
						КонецЕсли;
						
						ДопДанныеСтроки = Новый Структура;
						//++ №12909
						//ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", 
						//	ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Строка(ВыборкаТоваровУслуг.Номенклатура), Строка(ВыборкаТоваровУслуг.ХарактеристикаНоменклатуры)));
						ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", 
							ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ВыборкаТоваровУслуг.Номенклатура, ВыборкаТоваровУслуг.ХарактеристикаНоменклатуры));
						//-- №12909
						
						ОбластьТоварСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
						ОбластьТоварСтроки.Параметры.Заполнить(ДопДанныеСтроки);
						ТабличныйДокумент.Присоединить(ОбластьТоварСтроки);						
						
						ОбластьДанныхСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
						//#10947
						Если ЕстьСкидкиВДокументе И ПересчетЦеныПоСкидке Тогда
							ДопДанныеСтроки = Новый Структура;
							ДопДанныеСтроки.Вставить("Цена", ?(ВыборкаТоваровУслуг.Количество = 0, 0, ВыборкаТоваровУслуг.Сумма / ВыборкаТоваровУслуг.Количество));
							ОбластьДанныхСтроки.Параметры.Заполнить(ДопДанныеСтроки);
						КонецЕсли;
						ТабличныйДокумент.Присоединить(ОбластьДанныхСтроки);
					Исключение
					КонецПопытки;
					
				КонецЦикла;
			КонецЕсли;
			
			Попытка
				// подвал таблицы 
				ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
				ОбластьАртикул = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
				ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
				ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
				
				ТабличныйДокумент.Вывести(ОбластьНомера);
				
				Если ВыводитьАртикул Тогда
					ТабличныйДокумент.Присоединить(ОбластьАртикул);
				КонецЕсли;
				
				ТабличныйДокумент.Присоединить(ОбластьТовар);
				
				ОбластьДанных.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьДанных);
			Исключение
			КонецПопытки;
			
			// Выводим ИтогоНДС
			Попытка
				ЦенаВключаетНДС = Истина;
				Область = Макет.ПолучитьОбласть("ПодвалНДС");
				СтруктураДанныхПодвалНДС = Новый Структура;
				СтруктураДанныхПодвалНДС.Вставить("ИтогоСуммаНДС", ДанныеПечати.ИтогоСуммаНДС);
				Если ЕстьНДС Тогда
					СтруктураДанныхПодвалНДС.Вставить("НДС", ?(ЦенаВключаетНДС, НСтр("ru='В том числе НДС:'"), НСтр("ru='Сумма НДС:'")));
				Иначе
					СтруктураДанныхПодвалНДС.Вставить("НДС", НСтр("ru='Без налога (НДС)'"));
				КонецЕсли;
				Область.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
				ТабличныйДокумент.Присоединить(Область);
			Исключение
			КонецПопытки;
			
			// Выводим Сумму прописью
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;			
			
		КонецЕсли;
		
		//таблица график платежей
		Если ТипЗнч(МенеджерОбъекта) = Тип("ДокументМенеджер.ЗаказДоговор") Тогда
			
			СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
			ВыборкаПоГрафику.Сбросить();
			
			Если ВыборкаПоГрафику.НайтиСледующий(СтруктураПоиска) И ЕстьСекция_ГрафикПлатежей Тогда
				
				Попытка
					ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыГрафикПлатежей");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					ВыборкаСтрокГрафика = ВыборкаПоГрафику.Выбрать();
					Пока ВыборкаСтрокГрафика.Следующий() Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧастиГрафикПлатежей");
						ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокГрафика);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЦикла;
					
					ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТабличнойЧастиГрафикПлатежей");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакета);				
				Исключение
				КонецПопытки
			КонецЕсли;
			
		КонецЕсли;
		
		// Выводим подвал с подписями
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);		
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;		
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьКомплектДляМонтажников(МассивОбъектов, ОбъектыПечати, ПересчетЦеныПоСкидке = Ложь)
	
	Возврат ОбщийМодульСервер.ПечатьРозницаКомплектДляМонтажников(МассивОбъектов, ОбъектыПечати, ПересчетЦеныПоСкидке);
	
	//Таб = Новый ТабличныйДокумент;
	//Таб.ИмяПараметровПечати = "ПараметрыПечати_КомплектДляМонтажников";
	//ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = ПолучитьТекстЗапроса(Истина);
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	////подготовим итоговую таблицу с данными
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//РезультатЗапроса.Колонки.Добавить("ПаспортПредставление");
	//РезультатЗапроса.Колонки.Добавить("СуммаИтогСкидка");           
	//РезультатЗапроса.Колонки.Добавить("СуммаДокументаБезСкидки");
	//РезультатЗапроса.Колонки.Добавить("СуммаПредоплаты");
	//РезультатЗапроса.Колонки.Добавить("СуммаКОплате");
	//РезультатЗапроса.Колонки.Добавить("ПлощадьЗаказа");
	//
	//Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
	//	ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента,"ДЛФ=Д");
	//	Для Каждого ПодСтрока Из ТекущаяСтрока.ГрафикОплат Цикл
	//		ПодСтрока.ДатаПлатежа = Формат(ПодСтрока.ДатаПлатежаДокумент,"ДЛФ=Д");
	//	КонецЦикла;
	//	Попытка
	//		ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ТекущаяСтрока.Номер);
	//	Исключение
	//	КонецПопытки;
	//	Попытка	
	//	    ТекущаяСтрока.ДатаМонтажаФормат = Формат(ТекущаяСтрока.ДатаМонтажа,"ДЛФ=D");
	//		ТекущаяСтрока.ВремяНачалаФормат = Формат(ТекущаяСтрока.ВремяНачала, "ДЛФ=T");
	//		ТекущаяСтрока.ВремяОкончанияФормат = Формат(ТекущаяСтрока.ВремяОкончания, "ДЛФ=T");
	//	Исключение
	//	КонецПопытки;
	//	Если ТекущаяСтрока.Контрагент.ВидКонтрагента = Перечисления.ВидКонтрагента.ФизЛицо Тогда
	//		ТекущаяСтрока.ПаспортПредставление = "Документ: " + ТекущаяСтрока.ПаспортВид + " серия: " + ТекущаяСтрока.ПаспортСерия
	//			+ " номер: " + ТекущаяСтрока.ПаспортНомер + ", выдан: " + ТекущаяСтрока.ПаспортКемВыдан + " " + Формат(ТекущаяСтрока.ПаспортДатаВыдачи,"ДЛФ=Д");
	//	КонецЕсли;
	//		
	//	ТекущаяСтрока.СуммаИтогСкидка = ТекущаяСтрока.ТоварыУслуги.Итог("СуммаСкидки");
	//	ТекущаяСтрока.СуммаДокументаБезСкидки = ТекущаяСтрока.СуммаДокумента + ТекущаяСтрока.СуммаИтогСкидка;
	//	
	//	ТекущаяСтрока.СуммаПредоплаты = ПолучитьСуммуПоступленийНаДатуВыполненияМонтажа(ТекущаяСтрока.Ссылка);
	//	ТекущаяСтрока.СуммаКОплате = ТекущаяСтрока.СуммаДокумента - ТекущаяСтрока.СуммаПредоплаты;
	//	
	//	ПлощадьЗаказа = 0;
	//	Для Каждого ПодСтрока Из ТекущаяСтрока.ТоварыУслуги Цикл
	//		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ПодСтрока.Номенклатура) Тогда
	//			ПлощадьЗаказа = ПлощадьЗаказа + ПодСтрока.Количество;
	//		КонецЕсли;
	//	КонецЦикла;
	//	ТекущаяСтрока.ПлощадьЗаказа = ПлощадьЗаказа;

	//КонецЦикла;
	//
	//ПервыйДокумент = Истина;
	//Для Каждого Шапка Из РезультатЗапроса Цикл
	//	
	//	Если Не ПервыйДокумент Тогда
	//		// Все документы нужно выводить на разных страницах.
	//		Таб.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	ПервыйДокумент = Ложь;
	//	// Запомним номер строки, с которой начали выводить текущий документ.
	//	НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
	//	
	//	ЕстьСкидка = Ложь;
	//	Для Каждого ВремТовары Из Шапка.ТоварыУслуги Цикл
	//		Если ВремТовары.СуммаСкидки > 0 тогда
	//			ЕстьСкидка = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если ЕстьСкидка Тогда
	//		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_КомплектДляМонтажниковСоСкидкой");
	//	Иначе
	//		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_КомплектДляМонтажников");
	//	КонецЕсли;
	//	
	//	//шапка 
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;		
	//			
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//		Попытка
	//			ТекстЗаголовка = "Заказ-договор №" + ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер) + " от " + Формат(Шапка.Дата, "ДЛф=Д");
	//			ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	//		Исключение
	//		КонецПопытки;		
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ОбластьМакета.Параметры.Организация = Шапка.Организация;
	//		ОбластьМакета.Параметры.НомерДоговора = Шапка.НомерДоговора;
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ОбластьМакета.Параметры.Контрагент = Шапка.Контрагент;
	//		ОбластьМакета.Параметры.Адрес = Шапка.Адрес;
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	// Изменения размера колоноки, в зависимости от вывода Артикула
	//	Если Не ВыводитьАртикул Тогда
	//		Попытка
	//			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
	//			Макет.Область("мПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("мПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("мАртикул").ШиринаКолонки;
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Присоединить(ОбластьМакета);
	//		
	//		Если ЕстьСкидка Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаСкидка");
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаСумма");
	//		Таб.Присоединить(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	Сумма = 0;
	//	ИмяКомната = "";
	//	Попытка
	//		Для Каждого Товары из  Шапка.ТоварыУслуги Цикл
	//			//НАЧАЛО Хаматов А.Р. 2017-05-24 выводим заголовок комнаты 
	//			Если ИмяКомната <> Товары.Комната Тогда
	//				
	//				ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	//				Таб.Вывести(ОбластьМакета);
	//				
	//				Если ВыводитьАртикул Тогда
	//					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
	//					Таб.Присоединить(ОбластьМакета);
	//				КонецЕсли;
	//				
	//				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
	//				ИмяКомната = Товары.Комната;
	//				// жирный наклонный шрифт
	//				ШрифтКомнаты = Новый Шрифт (ОбластьМакета.Область().Шрифт,,,Истина,Истина);
	//				ОбластьМакета.Область().Шрифт = ШрифтКомнаты;
	//				ОбластьМакета.Параметры.Номенклатура = ИмяКомната;
	//				Таб.Присоединить(ОбластьМакета);
	//				
	//				Если ЕстьСкидка Тогда
	//					ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаСкидка");
	//					Таб.Присоединить(ОбластьМакета);
	//				КонецЕсли;
	//				
	//				ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаСумма");
	//				Таб.Присоединить(ОбластьМакета);
	//				
	//			КонецЕсли;
	//			//КОНЕЦ Хаматов А.Р. 2017-05-24 выводим заголовок комнаты
	//			
	//			ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
	//			Таб.Вывести(ОбластьМакета);
	//			
	//			Если ВыводитьАртикул Тогда
	//				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
	//				Таб.Присоединить(ОбластьМакета);
	//			КонецЕсли;
	//			
	//			ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
	//			ПредставлениеНоменклатуры = Строка(Товары.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Товары.ХарактеристикаНоменклатуры));
	//			ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
	//			Таб.Присоединить(ОбластьМакета);
	//			
	//			Если ЕстьСкидка Тогда
	//				ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаСкидка");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
	//				Таб.Присоединить(ОбластьМакета);
	//			КонецЕсли;
	//			
	//			ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаСумма");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
	//			Таб.Присоединить(ОбластьМакета);
	//			
	//			Сумма = Сумма + Товары.Сумма;
	//		КонецЦикла;
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
	//		Таб.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
	//		Попытка
	//			ОбластьМакета.Параметры.Сумма = Сумма;
	//			ОбластьМакета.Параметры.Валюта = Шапка.Валюта;			
	//		Исключение			
	//		КонецПопытки;			
	//		Таб.Присоединить(ОбластьМакета);
	//		
	//		Если ЕстьСкидка Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("Итого|КолонкаСкидка");
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("Итого|КолонкаСумма");
	//		Таб.Присоединить(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	ВидНомен = "";
	//	Попытка
	//		//НАЧАЛО Хаматов А.Р. 2017-05-24 объединяем Товары и Материалы 
	//		тзТоварыМатериалы = Шапка.ТоварыУслуги;
	//		Для каждого Материалы Из Шапка.Материалы Цикл 
	//			Если ЗначениеЗаполнено(Материалы.Номенклатура) Тогда		
	//				ЗаполнитьЗначенияСвойств(тзТоварыМатериалы.Добавить(), Материалы);
	//			КонецЕсли;
	//		КонецЦикла;
	//		тзТоварыМатериалы.Сортировать("ВидНоменклатуры Возр");
	//		тзТоварыМатериалы.Свернуть("ВидНоменклатуры,Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Коэффициент", "Количество");
	//		//НАЧАЛО Хаматов А.Р. 2017-05-24 
	//					
	//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаМатериалы|мНомерСтроки");
	//		Таб.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаМатериалы|мАртикул");
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаМатериалы|мДанные");
	//		Таб.Присоединить(ОбластьМакета);
	//		
	//		НомерСтроки = 1;
	//		//Для Каждого Материалы Из Шапка.Материалы Цикл
	//		Для Каждого Материалы Из тзТоварыМатериалы Цикл
	//			
	//			Если НЕ Материалы.Номенклатура.Пустая() 
	//				И Материалы.ВидНоменклатуры <> Справочники.ВидыНоменклатуры.Услуга Тогда
	//				
	//				//НАЧАЛО Хаматов А.Р. 2017-05-24 выводим заголовок вида номенклатуры 
	//				Если ВидНомен <> Материалы.ВидНоменклатуры Тогда
	//					
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мНомерСтроки");
	//					Таб.Вывести(ОбластьМакета);
	//					
	//					Если ВыводитьАртикул Тогда
	//						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мАртикул");
	//						Таб.Присоединить(ОбластьМакета);
	//					КонецЕсли;
	//					
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мДанные");
	//					ВидНомен = Материалы.ВидНоменклатуры;
	//					// жирный наклонный шрифт
	//					ШрифтВидНомен = Новый Шрифт (ОбластьМакета.Область().Шрифт,,,Истина,Истина);
	//					ОбластьМакета.Область().Шрифт = ШрифтВидНомен;
	//					ОбластьМакета.Параметры.Номенклатура = ВидНомен;
	//					Таб.Присоединить(ОбластьМакета);
	//					
	//				КонецЕсли;
	//				//КОНЕЦ Хаматов А.Р. 2017-05-24 выводим заголовок номенклатуры
	//									
	//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мНомерСтроки");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Материалы);
	//				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
	//				Таб.Вывести(ОбластьМакета);
	//				
	//				Если ВыводитьАртикул Тогда
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мАртикул");
	//					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Материалы);
	//					Таб.Присоединить(ОбластьМакета);
	//				КонецЕсли;	
	//				
	//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мДанные");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Материалы);
	//				ПредставлениеНоменклатуры = Строка(Материалы.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Материалы.ХарактеристикаНоменклатуры));
	//				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
	//				Таб.Присоединить(ОбластьМакета);				
	//				
	//				НомерСтроки = НомерСтроки + 1;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМатериалы|мНомерСтроки");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМатериалы|мАртикул");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМатериалы|мДанные");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Присоединить(ОбластьМакета);
	//		
	//	Исключение
	//	КонецПопытки;
	//			
	//	//подвал
	//	Попытка 
	//		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	// В табличном документе необходимо задать имя области, в которую был 
	//	// выведен объект. Нужно для возможности печати комплектов документов.
	//	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(Таб, 
	//	НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	//	
	//КонецЦикла;
	//
	//Возврат Таб;
	
КонецФункции

Функция ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, СПечатью = Ложь, ВВалюте = Ложь)
	
	Возврат ОбщийМодульСервер.ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, СПечатью, ВВалюте);
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ВыплатаЗарплатыВНатуральнойФорме.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ЗаказДоговор.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ЗаказПокупателя.ДобавитьКомандуСоздатьНаОснованииДляДокументаРозницы(КомандыСозданияНаОсновании, "ОбеспеченностьРозницыПоЗаказДоговорам");
	
	Документы.ЗаказПоставщику.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, "ОбеспеченностьРозницыПоЗаказДоговорам");
	
	Документы.Замена.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	Документы.Лид.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.Монтаж.ДобавитьКомандуСоздатьНаОснованииРеализациюКлиенту(КомандыСозданияНаОсновании);
	//Документы.Монтаж.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	//Документы.Монтаж.ДобавитьКомандуСоздатьНаОснованииВидОперацииРекламация(КомандыСозданияНаОсновании);
	//Документы.Монтаж.ДобавитьКомандуСоздатьНаОснованииВидОперацииСервиснаяЗаявка(КомандыСозданияНаОсновании);
	//Документы.Монтаж.ДобавитьКомандуСоздатьНаОснованииВидОперацииПродажа(КомандыСозданияНаОсновании);
	
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОснованииОплатаКредитомМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.ПлатежноеПоручениеИсходящее.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПоступлениеНаРасчетныйСчет.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.ПоступлениеТоваровИУслуг.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, "ОбеспеченностьРозницыПоЗаказДоговорам");
	
	Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	// 16346 убрано
	//Документы.РеализацияТоваровИУслуг.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	//++ №13982 пока комментируем
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьРезервирование") Тогда
	//	Документы.Резервирование.ДобавитьКомандуСоздатьНаОснованииДокументаРозницы(КомандыСозданияНаОсновании); // отдельная обработка на клиенте
	//	Документы.СнятиеРезервов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	//КонецЕсли;
	//-- №13982
	
	Документы.СоглашениеОРасторженииДоговора.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.СписаниеСРасчетногоСчета.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.СчетНаОплату.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.Штраф.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
		
КонецПроцедуры

// Добавляет команду создания документа "Заказ-договор".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаказДоговор) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаказДоговор.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ЗаказДоговор.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


Функция ПолучитьСуммуПоступленийНаДатуВыполненияМонтажа(ДокументСсылка)
	
	// определим дату выполнения монтажа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(Монтаж.Дата) КАК ДатаВыполнения
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Основание = &Заказ
	|	И НЕ Монтаж.ПометкаУдаления <> ИСТИНА
	|	И Монтаж.Дата <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И (Монтаж.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Выполнен)
	|			ИЛИ Монтаж.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Закрыт))";
	
	Запрос.УстановитьПараметр("Заказ", ДокументСсылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаВыполненияМонтажа = Выборка.ДатаВыполнения
	КонецЕсли;
	
	// если дата не найдена, берем все по текущую дату
	ДатаВыполненияМонтажа = ?(ЗначениеЗаполнено(ДатаВыполненияМонтажа), ДатаВыполненияМонтажа, КонецДня(ТекущаяДатаСеанса()));  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоЗаказамОбороты.СуммаРасход
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Обороты(, &Дата,, Заказ = &Заказ) КАК РасчетыПоЗаказамОбороты";
	
	Запрос.УстановитьПараметр("Заказ", 	ДокументСсылка);
	Запрос.УстановитьПараметр("Дата", ДатаВыполненияМонтажа);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаРасход;
	КонецЕсли;
	
	Возврат 0;	
	
КонецФункции
	
Функция РассчитатьПлощадьПотолков(ТабличнаяЧасть) Экспорт
	
	ПлощадьПотолков = 0;
	Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаТабличнойЧасти.Номенклатура) Тогда
			ПлощадьПотолков = ПлощадьПотолков + СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
	КонецЦикла;
	Возврат ПлощадьПотолков;
	
КонецФункции

Функция ПолучитьМассивКомнатДоговора(ЗаказСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаКомнат = ЗаказСсылка.ТоварыУслуги.Выгрузить(, "Комната");
	ТаблицаКомнат.Свернуть("Комната");
	ТаблицаКомнат.ВыгрузитьКолонку("Комната");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТаблицаКомнат.ВыгрузитьКолонку("Комната");
	
КонецФункции

Функция ПолучитьПотолокОснованияПоНомеру(ТабличнаяЧастьЗаказДоговора, НомерПотолка) Экспорт
	
	Если НЕ ПустаяСтрока(НомерПотолка) Тогда
		Для Каждого ТекущаяСтрока Из ТабличнаяЧастьЗаказДоговора Цикл
			Если ТекущаяСтрока.Номенклатура.Потолок_НомерРасчета = НомерПотолка Тогда
				Возврат ТекущаяСтрока.Номенклатура;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

Процедура ПроверитьКомнатыПоЗаказу(ДокументОбъект, Отказ, РежимЗаписи) Экспорт
	
	ДокументЗаказ = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "Основание") Тогда
		ДокументЗаказ = ДокументОбъект.Основание;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ДокументОснование") Тогда
		ДокументЗаказ = ДокументОбъект.ДокументОснование;
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.ЗаказДоговор") И ЗначениеЗаполнено(ДокументЗаказ) Тогда			
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокумента.Комната КАК Комната
		|ИЗ
		|	Документ." + ДокументОбъект.Метаданные().Имя + ".Товары КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &Ссылка
		|	И НЕ ДанныеДокумента.Комната В (&Комната)
		|	И ДанныеДокумента.Комната <> """"
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДокумента.Комната";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
		Запрос.УстановитьПараметр("Комната", ПолучитьМассивКомнатДоговора(ДокументЗаказ));
		
		Выборка = Запрос.Выполнить().Выбрать();	
		ТекстОшибки = "";
		Пока Выборка.Следующий() Цикл
			ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", ", ") + Выборка.Комната;
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
			ТекстОшибки = "Комнаты " + ТекстОшибки + " отсутствуют в основании заказ-договоре!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект); //, , , Отказ); пока без запрета проведения	
		КонецЕсли;
				
	КонецЕсли;
				
КонецПроцедуры			

// Функция - СоздатьНоменклатуруПоФайлуНаСервере
//
// Параметры:
//  ДокументОбъект				 - 	 - 
//  Данные						 - 	 номенклатура или структура файла построителя 
//  СписокДвоичныхДанныхЧертежей - 	 список двоичных данных приложенных файлов 
//  Комната						 - 	 наименвание комнаты 
//  УчитыватьНДС				 - 	 - 
//  ВМатериалы					 - 	 - 
//  ОписаниеОшибки				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
// Вызовы: 
// - форма документа "Заказ-договор" 
// - общая форма "ФормаЗагрузкиИзПостроителя"
//
Функция СоздатьНоменклатуруПоФайлуНаСервере(ДокументОбъект, Знач Данные, 
											Знач СписокДвоичныхДанныхЧертежей = Неопределено, 
											Знач Комната = Неопределено, 
											УчитыватьНДС=Ложь, 
											ВМатериалы = Ложь,
											ОписаниеОшибки = "") Экспорт  // #12872 +ОписаниеОшибки
	
	//ОписаниеОшибки = "";
	СтруктураПотолок = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(Данные, СписокДвоичныхДанныхЧертежей,,,,,, ОписаниеОшибки); 
	Если СтруктураПотолок = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		//Сообщить(ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;
	СтруктураПотолок.Вставить("Организация", ДокументОбъект.Организация);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "Контрагент") Тогда
		СтруктураПотолок.Вставить("Контрагент", ДокументОбъект.Контрагент);
	Иначе
		СтруктураПотолок.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	КонецЕсли;
	
	ВидЗаказа = ?(ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.Монтаж"), Перечисления.ВидыЗаказов.Монтаж, Перечисления.ВидыЗаказов.ЗаказДоговор); // №5793 
	//#6413 при загрузке потолка не учитываем интеркампани, привязываемся к ВидуЦен
	//ТабличныеЧастиДляДокумента = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураПотолок,ДокументОбъект.ТочкаПродаж.ОсновнаяНастройкаИнтеркампани,
	//ТабличныеЧастиДляДокумента = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураПотолок,,
	//																		ДокументОбъект.ВидЦен, ДокументОбъект.Валюта, ДокументОбъект.Дата, 
	//																		ВидЗаказа, УчитыватьНДС,, ДокументОбъект.ДоговорКонтрагента);
	ДоговорКонтрагента = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ДоговорКонтрагента") Тогда
		ДоговорКонтрагента = ДокументОбъект.ДоговорКонтрагента	
	КонецЕсли;
	ДанныеЗаказа = ОбменСEasyCeiling.СтруктураДанныхЗаказа(ДокументОбъект.Организация, ДокументОбъект.Подразделение, , ДокументОбъект.ВидЦен, ДокументОбъект.Валюта, ДокументОбъект.Дата, УчитыватьНДС, , ДоговорКонтрагента);
	ТабличныеЧастиДляДокумента = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураПотолок, ВидЗаказа, ДанныеЗаказа);
	
	Если ТабличныеЧастиДляДокумента = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	// добавляем потолок
	Потолок = Новый Структура("Номенклатура, Комната,Количество,ЕдиницаИзмерения,Коэффициент,НомерПотолка,ЦветФактуры,ЗагруженоИзПостроителя",
	                               	ТабличныеЧастиДляДокумента.ПродукцияНоменклатура, Комната, ТабличныеЧастиДляДокумента.Количество, 
									ТабличныеЧастиДляДокумента.ПродукцияНоменклатура.БазоваяЕдиницаИзмерения, 1,
	                             	СтруктураПотолок.НомерРасчетаЗаказа, СтруктураПотолок.Фактуры[0].ПродукцияЦвет, Истина);
	//Новый параметры Продукции	
	ЗагружатьКалькуляциюВЗаказДоговорИзПостроителя = Константы.ЗагружатьКалькуляциюВЗаказДоговорИзПостроителя.Получить();
	Если ЗагружатьКалькуляциюВЗаказДоговорИзПостроителя Тогда
		Потолок.Вставить("Цена", 		  СтруктураПотолок.ЦенаПродукция);
		Потолок.Вставить("ПроцентСкидки", СтруктураПотолок.ПроцентСкидкиПродукция);
		Потолок.Вставить("СуммаСкидки",   СтруктураПотолок.СуммаСкидкиПродукция);
		Потолок.Вставить("Сумма", 		  СтруктураПотолок.СуммаПродукция);
	КонецЕсли;
	
	Потолок.Вставить("УИСтроки", Строка(Новый УникальныйИдентификатор));
	
	Если НЕ ВМатериалы Тогда
		
		//++ #15176		
		Для Каждого ТекущаяСтрока Из ДокументОбъект.ТоварыУслуги Цикл			
			Если ТекущаяСтрока.Номенклатура = Потолок.Номенклатура 
				И НЕ ТекущаяСтрока.Комната = Потолок.Комната Тогда
				ОписаниеОшибки = СтрШаблон("Продукция ""%1"" уже имеется в комнате ""%2"".", Потолок.Номенклатура, ТекущаяСтрока.Комната);
				Возврат Неопределено;				
			КонецЕсли;			
		КонецЦикла;
		//--
		
		НоваяСтрокаДокумента = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьПотолокВТЧДокументаРозницы(ДокументОбъект, "ТоварыУслуги", Потолок);
		//НоваяСтрокаДокумента.КоличествоВыработка = ПолучитьКоличествоВыработка(НоваяСтрокаДокумента.Количество);
		ОбработкаТабличныхЧастейСервер.ПроставитьИРассчитатьДанныеПоПрайсу(НоваяСтрокаДокумента);
		
		//Начало добавлен при переходе на 2.0
		//Услуги и товары относящиеся к потолку загоним во временную ТЗ, чтобы потом лишнее удалить
		Врем_ТЗ = новый ТаблицаЗначений;
		Врем_ТЗ.Колонки.Добавить("Номенклатура");	
		Врем_ТЗ.Колонки.Добавить("НомерПотолка");
		
		Для Каждого ТекущаяСтрока Из ДокументОбъект.ТоварыУслуги Цикл			
			
			Если ТекущаяСтрока.НомерПотолка = Потолок.НомерПотолка И ТекущаяСтрока.Номенклатура <> Потолок.Номенклатура Тогда
				
				//Услуга или товар потолка
				НоваяСтрока = Врем_ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				
			КонецЕсли;	
			
		КонецЦикла;
		//Конец добавлен при переходе на 2.0
		
		ИтогСуммаТовары = 0;
		Для Каждого ТекЭлемент Из ТабличныеЧастиДляДокумента.Товары Цикл
			Если ТекЭлемент.ЭтоУслугаРаскроя Тогда
				ИтогСуммаТовары = ИтогСуммаТовары + ТекЭлемент.Сумма;
			КонецЕсли;
		КонецЦикла;
		ИтогСуммаУслуги = 0;
		Для Каждого ТекЭлемент Из ТабличныеЧастиДляДокумента.Услуги Цикл
			Если ТекЭлемент.ЭтоУслугаРаскроя Тогда
				ИтогСуммаУслуги = ИтогСуммаУслуги + ТекЭлемент.Сумма;
			КонецЕсли;
		КонецЦикла;
		
		//Если включена настройка загружать калькуляцию из файла, то строго грузим потолок, его цены, скидки, суммы из файла (заполнение было выше), услуги раскроя не участвуют
		Если НЕ ЗагружатьКалькуляциюВЗаказДоговорИзПостроителя Тогда
			
			//теперь определим итоговую стоимость потолка и цену за 1 ед.
			Если НЕ Константы.ВыделятьУслугиРаскрояИзПотолкаПриЗагрузкеИзПостроителяВЗаказДоговор.Получить() Тогда //ТабличныеЧастиДляДокумента.ВыделятьУслугиРаскрояИзПотолка Тогда
				//потолок содержит стоимость услуг		
				НоваяСтрокаДокумента.Сумма = ТабличныеЧастиДляДокумента.Сумма + ИтогСуммаУслуги + ИтогСуммаТовары;
				Если НЕ НоваяСтрокаДокумента.Количество = 0 Тогда
					НоваяСтрокаДокумента.Цена = НоваяСтрокаДокумента.Сумма / НоваяСтрокаДокумента.Количество;
					ОбработкаТабличныхЧастейСервер.ПроставитьИРассчитатьДанныеПоПрайсу(НоваяСтрокаДокумента);				
				КонецЕсли;		
			Иначе
				//услуги раскроя выделяются отдельно
				НоваяСтрокаДокумента.Сумма = ТабличныеЧастиДляДокумента.Сумма;		
				Если НЕ НоваяСтрокаДокумента.Количество = 0 Тогда
					НоваяСтрокаДокумента.Цена = НоваяСтрокаДокумента.Сумма / НоваяСтрокаДокумента.Количество;
					ОбработкаТабличныхЧастейСервер.ПроставитьИРассчитатьДанныеПоПрайсу(НоваяСтрокаДокумента);
				КонецЕсли;		
				
				Для Каждого ТекУслуга Из ТабличныеЧастиДляДокумента.Услуги Цикл
					Если ТекУслуга.ЭтоУслугаРаскроя Тогда
						ДанныеСтроки = Новый Структура("Комната, НомерПотолка, Цена, ЦенаПоПрайсу, ЗагруженоИзПостроителя, УИСтроки",
														Комната, СтруктураПотолок.НомерРасчетаЗаказа, ТекУслуга.Цена, ТекУслуга.Цена, Истина, Строка(Новый УникальныйИдентификатор));								
						НоваяСтрокаДокумента = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьСтрокуВТЧЗаказДоговора(ДокументОбъект.ТоварыУслуги, ТекУслуга, ДанныеСтроки);
						//НоваяСтрокаДокумента.КоличествоВыработка = ПолучитьКоличествоВыработка(НоваяСтрокаДокумента.Количество);
						ОбработкаТабличныхЧастейСервер.ПроставитьИРассчитатьДанныеПоПрайсу(НоваяСтрокаДокумента);
						
						//Начало добавлен при переходе на 2.0
						//Удалим из Врем_ТЗ услугу, если найдем (она там должна быть)
						УдалитьУслугиТоварКПотолкуИзВремТЗ(Потолок.НомерПотолка, ТекУслуга.Номенклатура, Врем_ТЗ);
						//Конец добавлен при переходе на 2.0
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого ТекУслуга Из ТабличныеЧастиДляДокумента.Товары Цикл
					Если ТекУслуга.ЭтоУслугаРаскроя Тогда
						ДанныеСтроки = Новый Структура("Комната, НомерПотолка, Цена, ЦенаПоПрайсу, ЗагруженоИзПостроителя, УИСтроки",
														Комната, СтруктураПотолок.НомерРасчетаЗаказа, ТекУслуга.Цена, ТекУслуга.Цена, Истина, Строка(Новый УникальныйИдентификатор));								
						НоваяСтрокаДокумента = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьСтрокуВТЧЗаказДоговора(ДокументОбъект.ТоварыУслуги, ТекУслуга, ДанныеСтроки);
						//НоваяСтрокаДокумента.КоличествоВыработка = ПолучитьКоличествоВыработка(НоваяСтрокаДокумента.Количество);
						ОбработкаТабличныхЧастейСервер.ПроставитьИРассчитатьДанныеПоПрайсу(НоваяСтрокаДокумента);
						
						//Начало добавлен при переходе на 2.0
						//Удалим из Врем_ТЗ услугу, если найдем (она там должна быть)
						УдалитьУслугиТоварКПотолкуИзВремТЗ(Потолок.НомерПотолка, ТекУслуга.Номенклатура, Врем_ТЗ);
						//Конец добавлен при переходе на 2.0
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;	
		
		//прочие товары и услуги
		Для Каждого ТекУслуга Из ТабличныеЧастиДляДокумента.Товары Цикл
			Если НЕ ТекУслуга.ЭтоУслугаРаскроя Тогда
				ДанныеСтроки = Новый Структура("Комната ,НомерПотолка, Цена, ЦенаПоПрайсу,ЗагруженоИзПостроителя, УИСтроки",
												Комната, СтруктураПотолок.НомерРасчетаЗаказа, ТекУслуга.Цена, ТекУслуга.Цена, Истина, Строка(Новый УникальныйИдентификатор));								
				НоваяСтрокаДокумента = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьСтрокуВТЧЗаказДоговора(ДокументОбъект.ТоварыУслуги, ТекУслуга, ДанныеСтроки);
				//НоваяСтрокаДокумента.КоличествоВыработка = ПолучитьКоличествоВыработка(НоваяСтрокаДокумента.Количество);
				ОбработкаТабличныхЧастейСервер.ПроставитьИРассчитатьДанныеПоПрайсу(НоваяСтрокаДокумента);
				
				//Начало добавлен при переходе на 2.0
				//Удалим из Врем_ТЗ услугу, если найдем (она там должна быть)
				УдалитьУслугиТоварКПотолкуИзВремТЗ(Потолок.НомерПотолка, ТекУслуга.Номенклатура, Врем_ТЗ);
				//Конец добавлен при переходе на 2.0
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекУслуга Из ТабличныеЧастиДляДокумента.Услуги Цикл
			Если НЕ ТекУслуга.ЭтоУслугаРаскроя Тогда
				ДанныеСтроки = Новый Структура("Комната, НомерПотолка, Цена, ЦенаПоПрайсу, ЗагруженоИзПостроителя, УИСтроки",
												Комната, СтруктураПотолок.НомерРасчетаЗаказа, ТекУслуга.Цена, ТекУслуга.Цена, Истина, Строка(Новый УникальныйИдентификатор));								
				НоваяСтрокаДокумента = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьСтрокуВТЧЗаказДоговора(ДокументОбъект.ТоварыУслуги, ТекУслуга, ДанныеСтроки);
				//НоваяСтрокаДокумента.КоличествоВыработка = ПолучитьКоличествоВыработка(НоваяСтрокаДокумента.Количество);
				ОбработкаТабличныхЧастейСервер.ПроставитьИРассчитатьДанныеПоПрайсу(НоваяСтрокаДокумента);
				
				//Начало добавлен при переходе на 2.0
				//Удалим из Врем_ТЗ услугу, если найдем (она там должна быть)
				УдалитьУслугиТоварКПотолкуИзВремТЗ(Потолок.НомерПотолка, ТекУслуга.Номенклатура, Врем_ТЗ);
				//Конец добавлен при переходе на 2.0
			КонецЕсли;
		КонецЦикла;
		
		//2.0
		// применим при необходимости округление
		ПорядокОкругления = Константы.ПорядокОкругленияЧисломСтоимостиПотолковРозница.Получить();
		//ТребуетсяОкругление = (ПорядокОкругления > 0);
		ТребуетсяОкругление = Константы.ОкруглятьСтоимостьПотолка.Получить() И (ПорядокОкругления > 0);
		Если ТребуетсяОкругление Тогда		
			ОкруглятьВБольшуюСторону = Константы.ОкруглятьВБольшуюСторонуСтоимостьПотолковРозница.Получить();
			СпособОкругления = Константы.СпособОкругленияСтоимостиПотолковРозница.Получить();
			ВариантОкругления = Константы.ВариантОкругленияСтоимостиПотолковРозница.Получить();
			ТребуетсяОкруглениеСоставляющих = ТребуетсяОкругление И СпособОкругления = 1;
			ТребуетсяОкруглениеПотолка    = ТребуетсяОкругление И СпособОкругления = 0;
			НайденныеСтроки = ДокументОбъект.ТоварыУслуги.НайтиСтроки(Новый Структура("НомерПотолка", СтруктураПотолок.НомерРасчетаЗаказа));
			
			Если ТребуетсяОкруглениеСоставляющих Тогда
				Для каждого СтрокаТЧ из НайденныеСтроки Цикл
					ОбработкаТабличныхЧастейСервер.ОкруглитьСтрокуТЧ(СтрокаТЧ, ПорядокОкругления, ОкруглятьВБольшуюСторону, ВариантОкругления, "ПроцентСкидки", "СуммаСкидки");
				КонецЦикла;
			ИначеЕсли ТребуетсяОкруглениеПотолка Тогда
				ИтоговаяСуммаПотолка = 0;
				Для каждого СтрокаТЧ из НайденныеСтроки Цикл
					ИтоговаяСуммаПотолка = ИтоговаяСуммаПотолка + СтрокаТЧ.Сумма;
				КонецЦикла;
				ОкругленнаяИтоговаяСуммаПотолка = ОбщийМодуль.ОкруглитьЧисло(ИтоговаяСуммаПотолка, ПорядокОкругления, ОкруглятьВБольшуюСторону);
				НайденнаяСтрокаПотолка = ДокументОбъект.ТоварыУслуги.НайтиСтроки(Новый Структура("Номенклатура", ТабличныеЧастиДляДокумента.ПродукцияНоменклатура));
				Если НайденнаяСтрокаПотолка.Количество() > 0  Тогда
					НайденнаяСтрокаПотолка[0].Сумма = НайденнаяСтрокаПотолка[0].Сумма - (ИтоговаяСуммаПотолка - ОкругленнаяИтоговаяСуммаПотолка); 
					
					Если ВариантОкругления = 0 Тогда
						//изменять цену после округления
						Если НЕ НайденнаяСтрокаПотолка[0].Количество = 0 Тогда
							СуммаБезСкидки = НайденнаяСтрокаПотолка[0].Сумма + НайденнаяСтрокаПотолка[0].СуммаСкидки;
							НайденнаяСтрокаПотолка[0].Цена = Окр(СуммаБезСкидки / НайденнаяСтрокаПотолка[0].Количество, 2);
						КонецЕсли;
					Иначе
						//изменять сумму ручной скидки
						НайденнаяСтрокаПотолка[0].СуммаСкидки = НайденнаяСтрокаПотолка[0].СуммаСкидки + (ИтоговаяСуммаПотолка - ОкругленнаяИтоговаяСуммаПотолка);
						ОбработкаТабличныхЧастейСервер.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(НайденнаяСтрокаПотолка[0], "ПроцентСкидки", "СуммаСкидки");					
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Начало добавлен при переходе на 2.0
		//Удалим товары и услуги в ТЧ Товары позиции, которые относятся к потолку и сейчас не были загружены
		Если Врем_ТЗ.Количество() > 0 Тогда	
			Для Каждого ТекСтрока Из Врем_ТЗ Цикл				
				СтруктураПоиска = новый Структура("Номенклатура, НомерПотолка", ТекСтрока.Номенклатура, ТекСтрока.НомерПотолка);
				НайденныеСтроки = ДокументОбъект.ТоварыУслуги.НайтиСтроки(СтруктураПоиска);		
				Если НайденныеСтроки.Количество() > 0 Тогда
					Для Сч = НайденныеСтроки.Количество()-1 По 0 Цикл						
						ДокументОбъект.ТоварыУслуги.Удалить(НайденныеСтроки[Сч]);						
					КонецЦикла;					
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли;
		//Конец добавлен при переходе на 2.0
		
		// РезультатРасширеннойОбработки по материалам
		ЕстьРеквизитСлужебныйЗаполнениеМатериаловРозницы = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "СлужебныйЗаполнениеМатериаловРозницы"); 
		Если (ЕстьРеквизитСлужебныйЗаполнениеМатериаловРозницы И ДокументОбъект.СлужебныйЗаполнениеМатериаловРозницы = 0) //#5456 ЗаполнениеМатериаловПоЗаказам = (СлужебныйЗаполнениеМатериаловРозницы = 0);
			ИЛИ НЕ ЕстьРеквизитСлужебныйЗаполнениеМатериаловРозницы  // предварительный расчет
			Тогда
			ТЧМатериалыСлужебная = ?(ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЗаказДоговор"), ДокументОбъект.МатериалыСлужебная, Неопределено);
			ОбработкаТабличныхЧастейСервер.ОбработатьЗагрузкуМатериаловВДокументРозницы(ТабличныеЧастиДляДокумента.ПродукцияНоменклатура, Комната, ДокументОбъект.Материалы, ТЧМатериалыСлужебная, ТабличныеЧастиДляДокумента.Материалы);			
		КонецЕсли;
	Иначе
		// добавление потолка в Материалы
		
		//++ #15176		
		Для Каждого ТекущаяСтрока Из ДокументОбъект.Материалы Цикл			
			Если ТекущаяСтрока.Номенклатура = Потолок.Номенклатура 
				И НЕ ТекущаяСтрока.Комната = Потолок.Комната Тогда
				ОписаниеОшибки = СтрШаблон("Продукция ""%1"" уже имеется в комнате ""%2"".", Потолок.Номенклатура, ТекущаяСтрока.Комната);
				Возврат Неопределено;				
			КонецЕсли;			
		КонецЦикла;
		//--

		// пока только сам потолок
		//Потолок.Вставить("УИСтроки", Новый УникальныйИдентификатор); - перенесено выше
		НоваяСтрокаДокумента = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьПотолокВТЧДокументаРозницы(ДокументОбъект, "Материалы", Потолок);
		
		// №5793 расширенные правила загрузки для монтажа, только ТЧ Материалы
		Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.Монтаж") Тогда
			ОбработкаТабличныхЧастейСервер.ОбработатьЗагрузкуМатериаловВМонтаж(ТабличныеЧастиДляДокумента.ПродукцияНоменклатура, Комната, ДокументОбъект.Материалы, ТабличныеЧастиДляДокумента.Материалы);
		КонецЕсли;
		
	КонецЕсли;

	Возврат ТабличныеЧастиДляДокумента.ПродукцияНоменклатура;
	
КонецФункции

Процедура УдалитьУслугиТоварКПотолкуИзВремТЗ(НомерПотолка, Номенклатура, Врем_ТЗ)
	
	//Удалим из Врем_ТЗ услугу, если найдем (она там должна быть)
	СтруктураПоиска = новый Структура("Номенклатура, НомерПотолка", Номенклатура, НомерПотолка);
	НайденныеСтрокиВрем = Врем_ТЗ.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтрокиВрем.Количество() > 0 Тогда								
		Для Сч = НайденныеСтрокиВрем.Количество()-1 По 0 Цикл		
			Врем_ТЗ.Удалить(НайденныеСтрокиВрем[Сч]);		
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

Функция ВсеТоварыПоЗаказуОтгружены1(СсылкаНаЗаказ, ТоварыТЧ) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Описание", Истина, "");
	
	//проверим сколько отгружено по заказу. Если отгружено больше чем заказано в заказе - отказываем в проведении (защита от удаления товаров из заказа после его отгрузки)
	//в регистре заказы покупателей получим все расходы где участвует данный заказ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		ЗаказыПокупателейОбороты.Номенклатура,
	|		СУММА(ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0)) КАК Отгружено	
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Обороты(, , Регистратор, ЗаказНаПроизводство = &ДокументЗаказ) КАК ЗаказыПокупателейОбороты
	|
	//++ №10764 добавлен регистратор и исключение рекламационных и сервисных монтажей
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ЗаказыПокупателейОбороты.Регистратор ССЫЛКА Документ.Монтаж 
	|				И (ЗаказыПокупателейОбороты.Регистратор.ВидОперации = Значение(Справочник.ВидыМонтажа.Рекламация)
	|					ИЛИ ЗаказыПокупателейОбороты.Регистратор.ВидОперации = Значение(Справочник.ВидыМонтажа.СервиснаяЗаявка))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПокупателейОбороты.Номенклатура
	//-- №10764
	|";
	Запрос.УстановитьПараметр("ДокументЗаказ", СсылкаНаЗаказ);
	
	//создадим временную таблицу куда поместим все товары, услуги
	Временная_ТЗ = новый ТаблицаЗначений;
	Временная_ТЗ.Колонки.Добавить("Номенклатура",,"Номенклатура");	
	Временная_ТЗ.Колонки.Добавить("Количество",,"Количество");
	
	//поместим товары и услуги
	Для Каждого ТекСтрока Из ТоварыТЧ Цикл
		НоваяСтрока = Временная_ТЗ.Добавить();
		НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
		НоваяСтрока.Количество = ТекСтрока.Количество * ТекСтрока.Коэффициент;
	КонецЦикла;	
	
	//свернем временную таблицу со всеми товарами, услугами, продукцией, потолками
	Временная_ТЗ.Свернуть("Номенклатура", "Количество");
	
	//теперь пройдемся по всем полученным расходным движениям и 
	//если количество расход больше текущего количества в заказе, отказ в проведении
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//нужно найти номенлатуру во временной ТЗ
		СтруктураПоиска = новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
		НайденноеЗначение = Временная_ТЗ.НайтиСтроки(СтруктураПоиска);
		
		Если НайденноеЗначение.Количество() = 0 Тогда
			//в расходе есть а в текущем заказе нет, отказ
			СтруктураВозврата.Результат = Ложь;
			СтруктураВозврата.Описание = СтруктураВозврата.Описание +
			"По данному заказу номенклатуры """ + Выборка.Номенклатура + """ отгружено на " + Выборка.Отгружено + " ед. больше, чем заказано." + Символы.ПС;			
		Иначе
			Перегруз = Выборка.Отгружено - НайденноеЗначение[0].Количество;
			Если Перегруз > 0 Тогда
				СтруктураВозврата.Результат = Ложь;
				СтруктураВозврата.Описание = СтруктураВозврата.Описание + 
				"По данному заказу номенклатуры """ + Выборка.Номенклатура + """ отгружено на " + Перегруз + " ед. больше, чем заказано." + Символы.ПС;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ВсеТоварыПоЗаказуОтгружены2(СсылкаНаЗаказ, ТоварыТЧ) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Описание", Истина, "");

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыУслугиЗД.Номенклатура,
	|	ЕСТЬNULL(ТоварыУслугиЗД.Количество, 0) КАК Количество
	|
	|ПОМЕСТИТЬ ВТ_ТоварыУслугиЗДВрем
	|
	|ИЗ
	|  	&ТоварыУслугиЗД КАК ТоварыУслугиЗД
	|
	|;
	|///////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыУслугиЗД.Номенклатура,
	|	СУММА(ЕСТЬNULL(ТоварыУслугиЗД.Количество, 0)) КАК Количество
	|
	|ПОМЕСТИТЬ ВТ_ТоварыУслугиЗД
	|
	|ИЗ
	|  	ВТ_ТоварыУслугиЗДВрем КАК ТоварыУслугиЗД
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыУслугиЗД.Номенклатура
	|
	|;
	|///////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыУслугиЗД.Номенклатура,
	|	ЕСТЬNULL(ТоварыУслугиЗД.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0) КАК Отгружено,
	|	ЕСТЬNULL(ТоварыУслугиЗД.Количество, 0) - ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0) КАК Остаток
	|ИЗ
	|	ВТ_ТоварыУслугиЗД КАК ТоварыУслугиЗД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Обороты(, , , ЗаказНаПроизводство = &ДокументЗаказ) КАК ЗаказыПокупателейОбороты
	|		ПО ТоварыУслугиЗД.Номенклатура = ЗаказыПокупателейОбороты.Номенклатура
	|ГДЕ
	|	(ЕСТЬNULL(ТоварыУслугиЗД.Количество, 0) - ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0)) > 0";
	
	Запрос.УстановитьПараметр("ДокументЗаказ",  СсылкаНаЗаказ);
	Запрос.УстановитьПараметр("ТоварыУслугиЗД", ТоварыТЧ.Выгрузить(, "Номенклатура, Количество"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда			
		ТекстОшибки = "По данному заказу отгружены не все позиции:";			
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл			
			ТекстОшибки = ТекстОшибки + Символы.ПС + Выборка.Номенклатура + " в заказе " + Выборка.Количество + " ед., отгружено " + Выборка.Отгружено + " ед., остаток " + Выборка.Остаток + " ед.";				
		КонецЦикла;
		
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.Описание = ТекстОшибки;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ЕстьСоглашениеОРасторжении(СсылкаНаЗаказ) Экспорт
	
	СтруктураВозврата = новый Структура("СуммаРасторжения, ЕстьСоглашениеОРасторжении, Документ", 0, Ложь, Документы.СоглашениеОРасторженииДоговора.ПустаяСсылка());
		
	УстановитьПривилегированныйРежим(Истина);
	Запрос = новый Запрос;		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоглашениеОРасторженииДоговора.Ссылка,
	|	СоглашениеОРасторженииДоговора.СуммаДокумента
	|ИЗ
	|   Документ.СоглашениеОРасторженииДоговора КАК СоглашениеОРасторженииДоговора
	|ГДЕ
	|	СоглашениеОРасторженииДоговора.ЗаказДоговор = &ЗаказДоговор
	|	И СоглашениеОРасторженииДоговора.Проведен";
	Запрос.УстановитьПараметр("ЗаказДоговор", СсылкаНаЗаказ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.ЕстьСоглашениеОРасторжении = Истина;
		СтруктураВозврата.СуммаРасторжения = Выборка.СуммаДокумента;
		СтруктураВозврата.Документ = Выборка.Ссылка;
	КонецЕсли;	
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ЕстьПроведенныйМонтажВРаботеИлиВыполнен(СсылкаНаЗаказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = новый Запрос;		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Выполнен), ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Закрыт), ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.ВРаботе), ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.ЧастичноВыполнен))
	|	И ДанныеДокумента.Основание = &ЗаказДоговор
	|	И ДанныеДокумента.Проведен";
	Запрос.УстановитьПараметр("ЗаказДоговор", СсылкаНаЗаказ);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

#Область Прочее

Функция ПолучитьМассивРеквизитовПоЦенам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ДеревоТоваровЦена");
	МассивИменЭлементов.Добавить("ДеревоТоваровСумма");
	
	Возврат МассивИменЭлементов;
	
КонецФункции
	
Функция ПолучитьМассивРеквизитовПоСкидкам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ДеревоТоваровПроцентСкидки");
	МассивИменЭлементов.Добавить("ДеревоТоваровСуммаСкидки");
	
	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуНаПотолок");
	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуНаУслуги");
	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуТовары");
	МассивИменЭлементов.Добавить("ДеревоТоваровОчиститьСкидки");
	
	МассивИменЭлементов.Добавить("ИзменитьСуммуДоговора");
	МассивИменЭлементов.Добавить("ВидСкидки");
	
	Возврат МассивИменЭлементов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
