#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();	
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
		
	СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
	ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.ВРаботе;
	//++#10640
	//Если НЕ Константы.НеЗаполнятьМенеджераЗаказДоговораПриЕгоСоздании.Получить() Тогда
	//#13943 закомментировано
	//Если ПараметрыСеанса.ТекущийПользователь.АвтоматическиЗаполнятьМенеджераВЗаказДоговоре Тогда
	//	Менеджер = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	//КонецЕсли;
	//--#10640
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Основание") Тогда			
			//#16242
			ВидЗаказа = Справочники.ВидыЗаказДоговоров.Договор;
			Если ДанныеЗаполнения.Свойство("ВидЗаказа")  Тогда
				ВидЗаказа = ДанныеЗаполнения.ВидЗаказа;
			КонецЕсли;
			
			Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.Лид") Тогда
				ЗаполнитьПоЛиду(ДанныеЗаполнения.Основание);
				ДанныеЗаполнения.Свойство("Исполнитель", ИсполнительЗамера);
				ДанныеЗаполнения.Свойство("Адрес", Адрес);
				ДанныеЗаполнения.Свойство("Геометка", Геометка);
				//ПараметрыНовогоДокумента.Вставить("Сумма", 		Объект.ПоследняяСуммаДоговораНаЗамере);
				//ПараметрыНовогоДокумента.Вставить("ИмяКлиента", 	Объект.ИмяКлиента);
				ДанныеЗаполнения.Свойство("ИдентификаторЗамера", ИдентификаторЗамера); // №11768
				
			КонецЕсли;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("ВидЗаказа") Тогда
			ВидЗаказа = ДанныеЗаполнения.ВидЗаказа;
				
		КонецЕсли;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		
		Основание = ДанныеЗаполнения;
		ЗаказДоговорОснование = ДанныеЗаполнения; // заполняем всегда, ПередЗаписью для ЗКД или ЗКП зачищаем 
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента = Контрагент.ОсновнойДоговор;
		Адрес = ДанныеЗаполнения.Адрес; // #16867
		ВидЦен = ДанныеЗаполнения.ВидЦен;
		Валюта = ДанныеЗаполнения.Валюта;
		ДисконтнаяКарта = ДанныеЗаполнения.ДисконтнаяКарта;
		ТочкаПродаж = ДанныеЗаполнения.ТочкаПродаж;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ВидСкидки = ДанныеЗаполнения.ВидСкидки;
		ВидЗаказа = Справочники.ВидыЗаказДоговоров.ПустаяСсылка();
	
	КонецЕсли;
	
	//добавим первую комнату, если товаров нет
	Если НЕ Константы.ИспользоватьСправочникКомнатВРознице.Получить() И ТоварыУслуги.Количество() = 0 Тогда
		НоваяСтрока = ТоварыУслуги.Добавить();
		НоваяСтрока.Комната = "Комната 1";
	КонецЕсли;
	
	//#13943
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию()	
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты();
	ДозаполнитьПоУмолчанию();
	 
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//#6524
	Если ДоговорБезЗамера 
		ИЛИ НЕ ВидЗаказа = Справочники.ВидыЗаказДоговоров.Договор
		Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ИсполнительЗамера"));	
	КонецЕсли;
	
	// #13826 
	Для Индекс = 0 по Материалы.Количество()-1 Цикл
		СтрокаТабличнойЧасти = Материалы[Индекс];
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаТабличнойЧасти.Номенклатура) Тогда
			// №14925 в текст ошибки добавляем номенклатуру
			//ТекстОшибки = "В строке " + Строка(Индекс+1) + " таблицы ""Материалы"" выбрана номенклатура-услуга";
			ТекстОшибки = СтрШаблон("В строке %1 таблицы ""Материалы"" выбрана номенклатура ""%2"" с видом ""Услуга"".", Строка(Индекс+1), Материалы[Индекс].Номенклатура);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Материалы["+Формат(Индекс, "ЧГ=0")+"].Номенклатура", , Отказ);
		КонецЕсли;
	КонецЦикла;
	
	//Если ВидЗаказа = Справочники.ВидыЗаказДоговоров.Договор
	//	ИЛИ ВидЗаказа = Справочники.ВидыЗаказДоговоров.СервиснаяЗаявка
	//	ИЛИ ВидЗаказа = Справочники.ВидыЗаказДоговоров.Рекламация
	//	Тогда
	//	ПроверяемыеРеквизиты.Добавить("Адрес");
	//КонецЕсли;
	Если ВидЗаказа = Справочники.ВидыЗаказДоговоров.Продажа Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Адрес"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() Тогда
		ЗаполнятьУИСтрок = Истина;
	КонецЕсли;
	
	Если СлужебныйЗаполнениеМатериаловРозницы = 1 Тогда
		//Материалы.Очистить(); //#5456
		
		Для каждого СтрокаТовара из ТоварыУслуги Цикл
			СтрокаТовара.Спецификация = Справочники.Спецификации.ПустаяСсылка();
		КонецЦикла;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#11323
	// #13078 добавлено условие "ЭтоНовый()": настройку "Разрешить создавать несколько договор по лиду" при записи договора проверять только если это создается новый документ.
	Если ЭтоНовый() И НЕ Константы.РазрешитьНесколькоДоговоровПоЛиду.Получить() Тогда
		ЕстьДругиеЗаказыПоЛиду = ОбщийМодульСервер.ПроверитьНаличиеДругихЗаказовПоЛиду(Основание, Ссылка);
		Если ЕстьДругиеЗаказыПоЛиду Тогда
			ТекстСообщения = "Настройками программы запрещено создание нескольких заказ-договоров по лиду!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЕсли;	
	КонецЕсли;
	
	//#16346 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И (ВидЗаказа = Справочники.ВидыЗаказДоговоров.Договор ИЛИ ВидЗаказа = Справочники.ВидыЗаказДоговоров.Продажа)
		Тогда
		ЗаказДоговорОснование = Документы.ЗаказДоговор.ПустаяСсылка();
	КонецЕсли;
	
	//#16346 
	Если НЕ ЭтоНовый() 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение
		И НЕ ВидЗаказа = Ссылка.ВидЗаказа Тогда
		// определяем каким должны быть монтажи
		ВидОперацииМонтажа = ОбщийМодульСервер.ВидОперацииМонтажаПоВидуЗаказа(Ссылка.ВидЗаказа);
		// ищем связанные выполненные монтажи
		ЕстьМонтажиПоВиду = ОбщийМодульСервер.ПроверитьНаличиеМонтажейПоВиду(ВидОперацииМонтажа, Ссылка, Истина, Истина);
		Если ЕстьМонтажиПоВиду Тогда
			ТекстСообщения = "Измененный вид заказа не соответствует виду операции в выполненных монтажа! Проведение запрещено.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВидЗаказа", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	//#16346
	Если ВидЗаказа = Справочники.ВидыЗаказДоговоров.Рекламация Тогда
		ГрафикОплат.Очистить();		
		Для каждого СтрокаТовара из ТоварыУслуги Цикл
			СтрокаТовара.Цена = 0;
			СтрокаТовара.Сумма = 0;
			СтрокаТовара.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
			СтрокаТовара.СуммаНДС = 0;
		КонецЦикла;
	КонецЕсли;
	
	// №6303
	СтруктураСоглашениеОРасторжении = Документы.ЗаказДоговор.ЕстьСоглашениеОРасторжении(Ссылка);
	ЕстьСоглашениеОРасторжении = СтруктураСоглашениеОРасторжении.ЕстьСоглашениеОРасторжении;
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Если ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.Отменен 
			//#16242
			И ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Договор")
			Тогда
			// при переводе в статус расторгнут, обязательно должен быть проведенный документ Расторжения		
			Если НЕ ЕстьСоглашениеОРасторжении Тогда
				Сообщить("Перевод в статус ""Отменен"" разрешен только при наличии проведенного документа ""Соглашение о расторжении договора"".");
				Отказ = Истина;
			КонецЕсли;
			
			// Установим сумму документа из суммы СОРД
			Если Не Отказ Тогда
				СуммаДокумента = СтруктураСоглашениеОРасторжении.СуммаРасторжения;
			КонецЕсли;
		Иначе
			// Запретить записывать ЗД в любом статусе кроме "Отменен" если есть СоРД.
			Если ЕстьСоглашениеОРасторжении Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         			НСтр("ru = 'По документу имеется соглашение о расторжении. Разрешен только статус ""Отменен""!'"), ЭтотОбъект,"ТекущийСтатус",,Отказ);
			КонецЕсли;
		КонецЕсли;
	Иначе
		//отмена проведения, запись
		Если ЕстьСоглашениеОРасторжении Тогда
			ТекстСообщения = НСтр("ru = 'По документу %1 имеется проведенное соглашение о расторжении. Изменение документа запрещено");
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         			ТекстСообщения, ЭтотОбъект,"ТекущийСтатус",,Отказ);
		КонецЕсли; 
	КонецЕсли;
	
	// №14925 проверка спецификаций на владельца
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.Спецификация) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ТекущаяСтрока.Номенклатура = ТекущаяСтрока.Спецификация.Владелец Тогда
				
				ТекстСообщения = СтрШаблон("В строке %1 таблицы ""Товары и услуги"" по номенклатуре ""%2"" указана спецификация, у которой владелец другая номенклатура.", ТекущаяСтрока.НомерСтроки, ТекущаяСтрока.Номенклатура);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//#16242
	Если ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.Отменен 
		И (ВидЗаказа = Справочники.ВидыЗаказДоговоров.Рекламация
			ИЛИ ВидЗаказа = Справочники.ВидыЗаказДоговоров.СервиснаяЗаявка
			//ИЛИ ВидЗаказа = Справочники.ВидыЗаказДоговоров.Продажа
			)
		Тогда
		
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Основание) 
		И ТипЗнч(Основание) = Тип("ДокументСсылка.Лид")
		И ВидЗаказа = Справочники.ВидыЗаказДоговоров.Договор //#16821
		Тогда
		
		// регистр ЗаключениеЗаказаДоговора
		Попытка
			ЗаключениеДоговора = РегистрыСведений.ЗаключениеЗаказаДоговора.СоздатьНаборЗаписей();
			ЗаключениеДоговора.Отбор.Замер.Установить(Основание);
			ЗаключениеДоговора.Прочитать();
			Если ЗаключениеДоговора.Количество() = 0 Тогда
				НовыйДоговор = ЗаключениеДоговора.Добавить();
			Иначе
				НовыйДоговор = ЗаключениеДоговора[0];
			КонецЕсли;
			НовыйДоговор.Замер = Основание;
			НовыйДоговор.ОформленЗаказДоговор = Истина;
			ЗаключениеДоговора.Записать(Истина);
		Исключение
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
		// регистр КонверсияВходящихКонтактов		
		Движения.КонверсияВходящихКонтактов.Записывать = Истина;
		Движение = Движения.КонверсияВходящихКонтактов.Добавить();
		Движение.Период = Дата;
		Движение.Контакт = Основание;
		Движение.РекламныйИсточник = Основание.РекламныйИсточник;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.КоличествоДоговоров = 1;
				
	КонецЕсли;
	
	Если НЕ ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.Отменен Тогда // №12975
		
		ТоварыУслугиСумма = ТоварыУслуги.Итог("Сумма");
		
		// регистр РасчетыПоЗаказам Приход
		Если НЕ ТоварыУслугиСумма = 0
			И Константы.ВестиРасчетыПоЗаказамПоЗаказДоговору.Получить() Тогда
			Движения.РасчетыПоЗаказам.Записывать = Истина;
			Движение = Движения.РасчетыПоЗаказам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Заказ = Ссылка;
			// №6303 сумму в регистр запишем по ТЧ, т.к. при установке суммы при проведении документа СОРД, сумма будет из СОРД 
			// и обратные движения сделанные СОРДом не сойдутся с ЗД
			//Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТоварыУслуги.Итог("Сумма")); //СуммаДокумента);
			Движение.Сумма = ТоварыУслугиСумма;  //#13457 в регистр пишем сумму без преобразования по валютам
			Движение.Контрагент = Контрагент; // №6496 добавлен контрагент в измерение
		КонецЕсли;	
		
		//регистр ПродажиПоЗаказДоговорам
		//ВремТочкаПродаж = Справочники.ТочкиПродаж.ПустаяСсылка();
		МенеджерПродажи = Справочники.Пользователи.ПустаяСсылка();
		//ТехнологЗамера = Справочники.Сотрудники.ПустаяСсылка(); // №6524 замерщика берем из ЗД
		Если НЕ Основание = Неопределено Тогда
			//Если ТипЗнч(Основание) = Тип("ДокументСсылка.Замер") Тогда
			//	Если НЕ Основание.Пустая() Тогда
			//		Если НЕ Основание.Основание = Неопределено Тогда
			//			Если ТипЗнч(Основание.Основание) = ТипЗнч(Документы.ВходящийКонтакт.ПустаяСсылка()) Тогда
			//				//ВремТочкаПродаж = Основание.Основание.ТочкаПродаж;
			//				МенеджерПродажи = Основание.Основание.Ответственный;
			//			КонецЕсли;
			//		КонецЕсли;
			//		//ТехнологЗамера = Основание.Исполнитель;  // №6524 замерщика берем из ЗД
			//	КонецЕсли;
			//Иначе
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.Лид") Тогда
				//ВремТочкаПродаж = Основание.ТочкаПродаж;
				МенеджерПродажи = Основание.Автор;
				//ТехнологЗамера = Основание.ПоследнийИсполнительЗамера;  // №6524 замерщика берем из ЗД
			КонецЕсли;
		КонецЕсли;
		Движения.ПродажиПоЗаказДоговорам.Записывать = Истина;
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			Движение = Движения.ПродажиПоЗаказДоговорам.Добавить();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры; // №10772
			Движение.МенеджерКонтакта = МенеджерПродажи;
			Движение.ТочкаПродаж = ТочкаПродаж;
			Движение.ТехнологЗамера = ИсполнительЗамера; // №6524 замерщика берем из ЗД, был ТехнологЗамера;
			Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
		КонецЦикла;
		
		//регистр ДолгиПоРассрочкам
		Если ГрафикОплат.Количество() > 0 Тогда
			Движения.ДолгиПоРассрочкам.Записывать = Истина;
			Для Каждого ТекущаяСтрока Из ГрафикОплат Цикл
				Движение = Движения.ДолгиПоРассрочкам.Добавить();
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.СрокПлатежа = ТекущаяСтрока.ДатаПлатежа;
				Движение.ЗаказДоговор = Ссылка;
				Движение.Сумма = ТекущаяСтрока.Сумма;
			КонецЦикла;
		КонецЕсли;
		
		//заказы покупателей
		Движения.ЗаказыПокупателей.Записывать = Истина;
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			Движение = Движения.ЗаказыПокупателей.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.ЗаказНаПроизводство = Ссылка;
			Движение.Организация = Организация;
			Движение.Контрагент = Контрагент;
			Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
			Движение.Сумма = ТекущаяСтрока.Сумма; //#9777
		КонецЦикла;	
		
	КонецЕсли;
	
	// №6303 закомментировано - переведен в документ "Расторжение договора"
	//ИначеЕсли ДоговорРассторгнут Тогда
	//	
	//	// Списание задолженности, товаров и материалов
	//	Если РасторжениеБезВозвратаДенегКлиенту Тогда
	//		
	//		// Необходимо получить сумму оплат по данному ЗД
	//		// если были оплаты, необходимо их закрыть
	//		Запрос = новый Запрос;
	//		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//           |	Оплаты.Заказ КАК Заказ,
	//           |	СУММА(ЕСТЬNULL(Оплаты.СуммаРасход, 0)) КАК Оплачено
	//           |ИЗ
	//           |	РегистрНакопления.РасчетыПоЗаказам.Обороты(, , Авто, Заказ = &ЗаказДоговор) КАК Оплаты
	//           |ГДЕ
	//           |	Оплаты.Регистратор <> &ЗаказДоговор
	//           |
	//           |СГРУППИРОВАТЬ ПО
	//           |	Оплаты.Заказ";
	//		Запрос.УстановитьПараметр("ЗаказДоговор", Ссылка);
	//		
	//		Выборка = Запрос.Выполнить().Выбрать();
	//		
	//		СуммаОплат = 0;
	//		Если Выборка.Следующий() Тогда
	//			СуммаОплат = Выборка.Оплачено;
	//		КонецЕсли;
	//		
	//		Если СуммаОплат > 0 Тогда
	//			
	//			// РасчетыПоЗаказам
	//			Движения.РасчетыПоЗаказам.Записывать = Истина;
	//			Движение = Движения.РасчетыПоЗаказам.Добавить();
	//			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//			Движение.Период = Дата;
	//			Движение.Заказ = Ссылка;
	//			Движение.Сумма = СуммаОплат;				
	//		
	//			// регистр ВзаиморасчетыСКонтрагентами Приход
	//			Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	//			Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	//			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//			Движение.Период = Дата;
	//			Движение.Организация = Организация;
	//			Движение.Контрагент = Контрагент;
	//			Движение.Договор = ДоговорКонтрагента;
	//			Движение.Документ = Ссылка;
	//			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаОплат);
	//			
	//			//Взаиморасчеты с контрагентами в валюте
	//			Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	//			Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
	//			Движение.ВидДвижения =ВидДвиженияНакопления.Приход;
	//			Движение.Период = Дата;
	//			Движение.Организация = Организация;
	//			Движение.Контрагент = Контрагент;
	//			Движение.Договор = ДоговорКонтрагента;
	//			Движение.Валюта = Валюта;
	//			Движение.Сумма = СуммаОплат;
	//			
	//			// регистр ВзаиморасчетыСКонтрагентамиПоЗаказам Приход
	//			Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Записывать = Истина;				
	//			Движение = Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Добавить();
	//			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//			Движение.Период = Дата;
	//			Движение.Заказ = Ссылка;
	//			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаОплат);			
	//							
	//		КонецЕсли;
	//		
	//		Движения.ТоварыНаСкладах.Записывать = Истина;
	//	
	//		// Списание материалов
	//		Если РасторжениеСписатьМатериалы И НЕ РасторжениеСкладСписанияМатериалов.Пустая() Тогда
	//			
	//			ТаблицаСписанияМатериалы = Материалы.Выгрузить();
	//			ТаблицаСписанияМатериалы.Очистить();
	//			Для Каждого ТекущаяСтрока Из Материалы Цикл
	//				Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
	//					НоваяСтрока = ТаблицаСписанияМатериалы.Добавить();
	//					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	//				КонецЕсли;
	//			КонецЦикла;
	//			
	//			Если НЕ ТаблицаСписанияМатериалы.Количество() = 0 Тогда
	//				Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, Организация, РасторжениеСкладСписанияМатериалов, ТаблицаСписанияМатериалы, Дата);
	//				Если Отказ Тогда
	//					Возврат;
	//				Иначе
	//					Для Каждого Товар Из ТаблицаСписанияМатериалы Цикл
	//						Расход = Движения.ТоварыНаСкладах.Добавить();
	//						Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
	//						Расход.Период = Дата;
	//						Расход.Организация = Организация;
	//						Расход.Склад = РасторжениеСкладСписанияМатериалов;
	//						Расход.Номенклатура = Товар.Номенклатура;
	//						Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;						
	//						Расход.Количество = Товар.Количество * Товар.Коэффициент;
	//						Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(Дата, Организация, РасторжениеСкладСписанияМатериалов, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
	//					КонецЦикла;
	//				КонецЕсли;
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//		
	//		// Списание товаров
	//		Если РасторжениеСписатьТовары И НЕ РасторжениеСкладСписанияТоваров.Пустая() Тогда
	//			
	//			ТаблицаСписанияТовары = ТоварыУслуги.Выгрузить();
	//			ТаблицаСписанияТовары.Очистить();
	//			Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
	//				Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
	//					НоваяСтрока = ТаблицаСписанияТовары.Добавить();
	//					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);					
	//				КонецЕсли;
	//			КонецЦикла;
	//					
	//			Если НЕ ТаблицаСписанияТовары.Количество() = 0 Тогда
	//				Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, Организация, РасторжениеСкладСписанияТоваров, ТаблицаСписанияТовары, Дата);
	//				Если Отказ Тогда
	//					Возврат;
	//				Иначе
	//					Для Каждого Товар Из ТаблицаСписанияТовары Цикл
	//						Расход = Движения.ТоварыНаСкладах.Добавить();
	//						Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
	//						Расход.Период = Дата;
	//						Расход.Организация = Организация;
	//						Расход.Склад = РасторжениеСкладСписанияТоваров;
	//						Расход.Номенклатура = Товар.Номенклатура;
	//						Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;						
	//						Расход.Количество = Товар.Количество * Товар.Коэффициент;
	//						Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(Дата, Организация, РасторжениеСкладСписанияТоваров, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);											
	//					КонецЦикла;
	//				КонецЕсли;
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	
	//КонецЕсли;
	
	//заказы розницы в производстве
	Если НЕ ТочкаПродаж.ОсновнаяНастройкаИнтеркампани.ОрганизацияПроизводствоПотолков.Пустая() Тогда
		КоличествоПотолковСНомерами = 0;
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			Если НЕ ПустаяСтрока(ТекущаяСтрока.НомерПотолка) Тогда
				КоличествоПотолковСНомерами = КоличествоПотолковСНомерами + 1;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоПотолковСНомерами > 0 Тогда
			Движения.ЗаказыРозницыВПроизводстве.Записывать = Истина;
			Движение = Движения.ЗаказыРозницыВПроизводстве.Добавить();
			Движение.ЗаказДоговор = Ссылка;
			Движение.Период = Дата;
			Движение.Потребность = КоличествоПотолковСНомерами;
		КонецЕсли;
	КонецЕсли;				
	
	//если нужно, поставим лид в очередь на выгрузку в ройстат
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Лид") Тогда
		Если НЕ Основание.Пустая() Тогда
			Если Константы.ИспользуетсяИнтеграцияСРойстат.Получить() Тогда
				НаборЗаписей = РегистрыСведений.ЛидыДляВыгрузкиВРойстат.СоздатьНаборЗаписей(); 
				НаборЗаписей.Отбор.Лид.Установить(Основание); 
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() = 0 Тогда
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Лид = Основание;
				КонецЕсли;
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//#13969
	Если ДополнительныеСвойства.Свойство("ДатаСоздания") Тогда
		// при программном создании / записи заказа свойство заполняется в "ИнициализироватьСлужебныеРеквизиты"
		// при создании через форму в "ПередЗаписьюНаСервере"
		ТекстКомментария = "Создан новый заказ";
		РегистрыСведений.ИсторияЗаказа.ДобавитьЗаписьВИсторию(Ссылка, ДополнительныеСвойства.ДатаСоздания, Пользователи.ТекущийПользователь(), ТекстКомментария);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	ДатаДоговора = ТекущаяДатаСеанса();
	ВидЗаказа = Справочники.ВидыЗаказДоговоров.Договор;
	
	ЗаполнятьУИСтрок = Истина; //автоматически устанавливаем только для новых документов. у старых документов это значение может быть не заполнено
	
	СлужебныйЗаполнениеМатериаловРозницы = ПолучитьФункциональнуюОпцию("ЗаполнениеМатериаловРозницы");
	//СлужебныйОбеспечениеПоДокументу = ПолучитьФункциональнуюОпцию("ОбеспеченностьРозницыПоЗаказДоговорам");
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
	ДополнительныеСвойства.Вставить("ДатаСоздания", ТекущаяДатаСеанса());
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	Если Константы.СпособЗаполненияМенеджераВЗаказДоговоре.Получить() = Перечисления.ВариантыЗаполненияМенеджера.ЗаполнятьСотрудникомПользователя 
		И ЗначениеЗаполнено(Автор) Тогда
		Менеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Автор, "Сотрудник");
		
	ИначеЕсли Константы.СпособЗаполненияМенеджераВЗаказДоговоре.Получить() = Перечисления.ВариантыЗаполненияМенеджера.ЗаполнятьМенеджеромДокументаОснования
		И ЗначениеЗаполнено(Основание)
		И ТипЗнч(Основание) = Тип("ДокументСсылка.Лид") Тогда
		Менеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Менеджер");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЛиду(ДанныеЗаполнения)
	
	//#11323
	Если НЕ Константы.РазрешитьНесколькоДоговоровПоЛиду.Получить() Тогда
		ЕстьДругиеЗаказыПоЛиду = ОбщийМодульСервер.ПроверитьНаличиеДругихЗаказовПоЛиду(ДанныеЗаполнения, Ссылка);
		Если ЕстьДругиеЗаказыПоЛиду Тогда
			Текст = "Настройками программы запрещено создание нескольких заказ-договоров по лиду!";			
			ВызватьИсключение Текст;
		КонецЕсли;
	КонецЕсли;
	
	Основание = ДанныеЗаполнения;
	
	//++ №10184 предварительный расчет выведен в отдельный документ (данные реквизита теперь там)
	//ВидЦен = ДанныеЗаполнения.ВидЦен;
	//ВидСкидки = ДанныеЗаполнения.ВидСкидки;
	//Валюта = ДанныеЗаполнения.Валюта;
	//СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;	
	//ОсновнойПредварительныйРасчет = ДанныеЗаполнения.ОсновнойПредварительныйРасчет;
	ОсновнойПредварительныйРасчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ОсновнойПредварительныйРасчет", Истина);
	Если ЗначениеЗаполнено(ОсновнойПредварительныйРасчет) Тогда
		РеквизитыПР = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновнойПредварительныйРасчет, "Ссылка, Организация, Подразделение, Контрагент,
																								|ВидЦен, ВидСкидки, Валюта, СуммаДокумента", Истина);
		Если ЗначениеЗаполнено(РеквизитыПР.Ссылка) Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыПР);
		КонецЕсли;
		//#16308
		Если ЗначениеЗаполнено(Контрагент) Тогда
			ДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ОсновнойДоговор", Истина);;
		КонецЕсли;
	КонецЕсли;
	//-- №10184 предварительный расчет выведен в отдельный документ (данные реквизита теперь там)
	
	ТочкаПродаж = ДанныеЗаполнения.ТочкаПродаж;
	ОжидаемоеВремяОтгрузки = ДанныеЗаполнения.ПредполагаемыйМонтажВремя;
	ОжидаемаяДатаОтгрузки = ДанныеЗаполнения.ПредполагаемыйМонтажДата; 
	ПредполагаемыйМонтажДатаМонтажаНеОпределена = ДанныеЗаполнения.ПредполагаемыйМонтажДатаМонтажаНеОпределена;
	
	//++ №8429 комментируем, т.к. в лиде добавили реквизит Подразделение, заполняем по нему а не по точке продаж
	//Если НЕ ТочкаПродаж.Пустая() Тогда
	//	Если НЕ ТочкаПродаж.Подразделение.Пустая() Тогда
	//		Подразделение = ТочкаПродаж.Подразделение;
	//	Иначе
	//		Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
	//	КонецЕсли;
	//Иначе
	//	Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
	//КонецЕсли;
	//-- №8429
	
	//++ №8429 заполнение подразделения по новому (Если в лиде заполнено из него, иначе из нового реквизита ПодразделениеРозница пользователя)
	Если НЕ ЗначениеЗаполнено(Подразделение) И ЗначениеЗаполнено(ДанныеЗаполнения.Подразделение) Тогда
		Подразделение = ДанныеЗаполнения.Подразделение;
	//Иначе
	//	Подразделение = ПараметрыСеанса.ТекущийПользователь.ПодразделениеРозница;
	КонецЕсли;
	//-- №8429	
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
	
	Если ЗначениеЗаполнено(ОсновнойПредварительныйРасчет) 
		И ЗначениеЗаполнено(РеквизитыПР.Ссылка) 
		И НЕ ВидЗаказа = Справочники.ВидыЗаказДоговоров.Рекламация
		И НЕ ВидЗаказа = Справочники.ВидыЗаказДоговоров.СервиснаяЗаявка
		Тогда
		Для Каждого СтрокаТаблицы Из ОсновнойПредварительныйРасчет.ТоварыУслуги Цикл //++ №10184 предварительный расчет выведен в отдельный документ (данные реквизита теперь там), было: Для Каждого СтрокаТаблицы Из ДанныеЗаполнения.ТоварыУслуги Цикл
			НоваяСтрока = ТоварыУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.УИСтроки = Новый УникальныйИдентификатор;
			НоваяСтрока.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
			НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчитыватьНДС, , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		КонецЦикла;
		
		Для Каждого СтрокаТаблицы Из ОсновнойПредварительныйРасчет.Материалы Цикл //++ №10184 предварительный расчет выведен в отдельный документ (данные реквизита теперь там), было: Для Каждого СтрокаТаблицы Из ДанныеЗаполнения.Материалы Цикл
			НоваяСтрока = Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.УИСтроки = Новый УникальныйИдентификатор;
		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьСписокКОбеспечениюРозницы()
	
	НастройкаИнтеркампани = ОбщийМодуль.ПолучитьНастройкуИнтеркампани(ТочкаПродаж, Подразделение, Организация);
	
	СписокКОбеспечению = ТоварыУслуги.Выгрузить(, "Комната, Номенклатура, ХарактеристикаНоменклатуры, Количество");
	СписокКОбеспечению.Очистить();	
	СписокКОбеспечению.Колонки.Добавить("Назначение", новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(25)));
	
	Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			// строка комнаты
			Продолжить;
		КонецЕсли;
			
		Если  Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СписокКОбеспечению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.Назначение = "Товары";
		
	КонецЦикла;
	
	Если НастройкаИнтеркампани.ЗаказПоставщикуЗаказыватьМатериалы Тогда
		Для Каждого ТекущаяСтрока Из Материалы Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				// строка комнаты
				Продолжить;
			КонецЕсли;		
			
			Если  Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда 
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = СписокКОбеспечению.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Назначение = "Материалы";		
			
		КонецЦикла;	
	КонецЕсли;
	
	Возврат СписокКОбеспечению;	

КонецФункции	

#КонецОбласти

#КонецЕсли