
&НаКлиенте
Процедура Выполнено(Команда)
	Объект.Выполнена = Истина;
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НеВыполнено(Команда)
	Объект.Выполнена = Ложь;
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеЗадачиПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = Объект.ОписаниеЗадачи;
	КонецЕсли;
КонецПроцедуры
