
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АдресСайтаКСУ = "https://in-al.intraservice.ru";
	
	#ЕСЛИ ВебКлиент Тогда
		Элементы.ВложенияСделатьСнимокЭкрана.Видимость = ложь;
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Логин = Константы.ИА_ЛогинСистемыЗаявок.Получить();
	Пароль = Константы.ИА_ПарольСистемыЗаявок.Получить();
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Тема = СокрЛП(Тема);
	Содержание = СокрЛП(Содержание);
	Если Тема = "" или Содержание = "" Тогда
		ПоказатьПредупреждение(,"Тема и содержание должны быть заполнены!");
		возврат;
	КонецЕсли;
	
	ОтправитьОбращение();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьОбращение()
		
	Профиль = новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = Константы.ИА_СерверПочты.Получить();
	Профиль.ПользовательSMTP = Константы.ИА_ПользовательПочты.Получить();
	Профиль.ПарольSMTP = Константы.ИА_ПарольПочты.Получить(); 
	ПРофиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	ПРофиль.ИспользоватьSSLSMTP = Константы.ИА_ИспользоватьSSL.Получить();
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Отправитель = Константы.ИА_АдресОтправителя.Получить();
	
	Сообщение.Тема = Тема;
	Текст = Содержание + Символы.ПС+"---------------------------"+Символы.ПС+ПараметрыСеанса.ТекущийПользователь+" "+ТекущаяДата();
	
	Сообщение.Получатели.Добавить("ksu-support@in-al.ru");
	Сообщение.Тексты.Добавить(Текст);
	
	// вложения
	Для каждого стр из вложения цикл
		дд = ПолучитьИзВременногоХранилища(стр.Значение);
		Сообщение.Вложения.Добавить(дд,стр.Представление);
	КонецЦикла;
	//
	
	Почта = Новый ИнтернетПочта;
	Попытка 
		Почта.Подключиться(Профиль);
		Почта.Послать(Сообщение);
		
		Сообщить("Обращение отправлено!");
		
		Тема = "";
		Содержание = "";
		Вложения.Очистить();
	Исключение
		опОш = ОписаниеОшибки();
		Сообщить("Ошибка отправки: " + опОш);
	КонецПопытки; 			

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложение(Команда)
	ОпОп = Новый ОписаниеОповещения("ДобавитьВложениеЗавершение",ЭтотОбъект);
	НачатьПомещениеФайла(ОпОп, , , Истина, ЭтаФорма.УникальныйИдентификатор) 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложениеЗавершение(Результат, Адрес, ВыбранноеИмяФайла, удалить) Экспорт
	Если не Результат ТОгда
		возврат;
	КонецЕсли;
	
	ф = Новый Файл(ВыбранноеИмяФайла);
	Вложения.Добавить(Адрес, ф.Имя);
	
	Если удалить = истина Тогда
		УдалитьФайлы(ВыбранноеИмяФайла);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СделатьСнимокЭкрана(Команда)
	
	#ЕСЛИ НЕ ВебКлиент Тогда
		
	Кат = КаталогВременныхФайлов();
	двиг = кат+"prntScr.exe";
	
	дд = ПолучитьУтилиту();
	дд.Записать(двиг);
	
	н = Вложения.Количество()+1;
	двиг = двиг + " savescreenshot shot_ksu"+н+".png";
	ЗапуститьПриложение(двиг,Кат,истина);
	
	УдалитьФайлы(кат+"prntScr.exe");
	
	КартинкаФ = кат+"shot_ksu"+н+".png";

	ОпОп = Новый ОписаниеОповещения("ДобавитьВложениеЗавершение",ЭтотОбъект,истина);
	НачатьПомещениеФайла(ОпОп, ,КартинкаФ, ложь, ЭтаФорма.УникальныйИдентификатор) 
	#КонецЕсли
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУтилиту()
	Возврат ПолучитьОбщийМакет("ИА_ПриложениеСкриншот");
КонецФункции
