
#Область СлужебныйПрограммныйИнтерфейс

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииСоставаНастроекПодключаемыхОбъектов
Процедура ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса) Экспорт
	Настройка = НастройкиПрограммногоИнтерфейса.Добавить();
	Настройка.Ключ          = "ДобавитьКомандыОбработкиОбновления";
	Настройка.ОписаниеТипов = Новый ОписаниеТипов("Булево");
КонецПроцедуры


// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя         = ВидКоманды();
	Вид.ИмяПодменю  = "ПерваяГруппаКнопокКП";
	Вид.Заголовок   = НСтр("ru = 'Выполнить обработку обновления'");
	Вид.Порядок     = 60;
	Вид.Картинка    = БиблиотекаКартинок.ОбновитьСиний;
	Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
КонецПроцедуры

Процедура ПриВыводеКоманды(Команда, КомандаФормы, КнопкаФормы) Экспорт
	
	Если ТипЗнч(Команда.ДополнительныеПараметры) = Тип("Структура") Тогда
		Если Команда.ДополнительныеПараметры.Свойство("Подсказка") Тогда
			КомандаФормы.Подсказка = Команда.ДополнительныеПараметры.Подсказка;	
		КонецЕсли;
		Если Команда.ДополнительныеПараметры.Свойство("ЦветФона") Тогда
			КнопкаФормы.ЦветФона = Команда.ДополнительныеПараметры.ЦветФона;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	КомандыПервойГруппы = Команды.СкопироватьКолонки();
	КомандыПервойГруппы.Колонки.Добавить("Обработана", Новый ОписаниеТипов("Булево"));
	КомандыПервойГруппы.Индексы.Добавить("Обработана");
	
	СтандартнаяОбработка = Истина; //Источники.Строки.Количество() > 0;
	КомандыПервойГруппы.ЗаполнитьЗначения(Истина, "Обработана");
	
	ДопустимыеТипы = Новый Массив; // Типы источников, которые пользователь может изменять (см. ниже проверку права "Изменение").
	Если СтандартнаяОбработка Тогда
		// 1. Выполнение обработки обновления объектов 
		ОбъектыСКомандамиВыполненияОбработки = ОбъектыСКомандамиВыполненияОбработкиОбновления();
		Для Каждого Источник Из Источники.Строки Цикл
			
			Если НастройкиФормы.ИмяФормы = "Документ.Лид.Форма.ФормаДокумента"
				И Источник.ТипСсылкиДанных = Тип("ДокументСсылка.ПредварительныйРасчетЗаказДоговора") Тогда
				Возврат;
			КонецЕсли;
			
			Для Каждого ДокументРегистратор Из Источник.Строки Цикл
 
				ПодключаемыеКоманды.ДополнитьМассивТипов(ДопустимыеТипы, ДокументРегистратор.ТипСсылкиДанных);
				
				СтандартнаяОбработка = Истина;
					
				Если СтандартнаяОбработка И ОбъектыСКомандамиВыполненияОбработки[ДокументРегистратор.Метаданные.ПолноеИмя()] <> Неопределено Тогда
					ПриДобавленииКомандОбработкиОбновления(КомандыПервойГруппы, ДокументРегистратор, НастройкиФормы);
				КонецЕсли;
				
			КонецЦикла;
			
			ПодключаемыеКоманды.ДополнитьМассивТипов(ДопустимыеТипы, Источник.ТипСсылкиДанных);
			
			СтандартнаяОбработка = Истина;
					
			Если СтандартнаяОбработка И ОбъектыСКомандамиВыполненияОбработки[Источник.Метаданные.ПолноеИмя()] <> Неопределено Тогда
				ПриДобавленииКомандОбработкиОбновления(КомандыПервойГруппы, Источник, НастройкиФормы);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ДопустимыеТипы.Количество() = 0 Тогда
		Возврат; // Все закрыто и команд расширений с допустимыми типами тоже не будет.
	КонецЕсли;
	
	Найденные = ПодключенныеОтчетыИОбработки.НайтиСтроки(Новый Структура("ДобавитьКомандыОбработкиОбновления", Истина));
	Для Каждого ПодключенныйОбъект Из Найденные Цикл
		ПриДобавленииКомандОбработкиОбновления(КомандыПервойГруппы, ПодключенныйОбъект, НастройкиФормы, ДопустимыеТипы);
	КонецЦикла;
	
	Для Каждого КомандаПервойГруппы Из КомандыПервойГруппы Цикл
		Команда = Команды.Добавить();
		ЗаполнитьЗначенияСвойств(Команда, КомандаПервойГруппы);
		Команда.Вид = ВидКоманды();
		Если Команда.Порядок = 0 Тогда
			Команда.Порядок = 50;
		КонецЕсли;
		Если Команда.РежимЗаписи = "" Тогда
			Команда.РежимЗаписи = "Записывать";
		КонецЕсли;
		Если Команда.МножественныйВыбор = Неопределено Тогда
			Команда.МножественныйВыбор = Ложь;
		КонецЕсли;
		Если Команда.ПараметрыФормы = Неопределено Тогда
			Команда.ПараметрыФормы = Новый Структура;
		КонецЕсли;
		
		// реквизит формы объекта
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ТребуетсяВыводКомандыОбработкиОбновления", Истина, ВидСравненияКомпоновкиДанных.Равно);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Список объектов, в которых используется команда "Выполнить обработку обновления".
//
// Возвращаемое значение:
//   Массив из ОбъектМетаданных - Объекты метаданных с командой.
//
Функция ОбъектыСКомандамиВыполненияОбработкиОбновления() Экспорт
	
	Возврат Новый Соответствие(КомандыОбработкаОбновленийПовтИсп.ОбъектыСКомандами());
	
КонецФункции

Процедура ПриДобавленииКомандОбработкиОбновления(Команды, СведенияОбОбъекте, НастройкиФормы, ДопустимыеТипы = Неопределено) Экспорт
	
	КомандаОбработкиОбновления = Команды.Добавить();
	КомандаОбработкиОбновления.Обработчик = "ОбщийМодульКлиент.ВыполнитьОбработкуОбновления";
	КомандаОбработкиОбновления.Представление = "Выполнить обработку обновления";
	КомандаОбработкиОбновления.Картинка = БиблиотекаКартинок.ОбновитьСиний;
	
	Подсказка = "Наличие данной кнопки указывает на то, что объект требует обработки после обновления";
	
	ДобавленныеКоманды = Команды.НайтиСтроки(Новый Структура("Обработана", Ложь));
	
	Для Каждого Команда Из ДобавленныеКоманды Цикл
		Если Не ЗначениеЗаполнено(Команда.Менеджер) Тогда
			Команда.Менеджер = СведенияОбОбъекте.ПолноеИмя;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Команда.ТипПараметра) Тогда
			Команда.ТипПараметра = СведенияОбОбъекте.ТипСсылкиДанных;
		КонецЕсли;
		Если ДопустимыеТипы <> Неопределено И Не ОбщийМодульСервер.ТипВМассиве(Команда.ТипПараметра, ДопустимыеТипы) Тогда
			Команды.Удалить(Команда);
			Продолжить;
		КонецЕсли;
		Найденные = Команды.НайтиСтроки(Новый Структура("Обработана, Представление", Истина, Команда.Менеджер));
		Если Найденные.Количество() > 0 Тогда
			Найденные[0].ТипПараметра = ОбщийМодульСервер.ОбъединитьТипы(Найденные[0].ТипПараметра, Команда.ТипПараметра);
			Команды.Удалить(Команда);
			Продолжить;
		КонецЕсли;
		Команда.Обработана = Истина;
		Если Не ЗначениеЗаполнено(Команда.Обработчик) И Не ЗначениеЗаполнено(Команда.ИмяФормы) Тогда
			Команда.ИмяФормы = "ФормаОбъекта";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Команда.ИмяПараметраФормы) Тогда
			Команда.ИмяПараметраФормы = "";
		КонецЕсли;
		
		Команда.ВидимостьВФормах = "ФормаДокумента,ФормаЭлемента";
		
		//Если Не ЗначениеЗаполнено(Команда.Группа) Тогда
		//	Команда.Группа = "ПерваяГруппаКнопокКП";
		//КонецЕсли;
		
		Команда.ДополнительныеПараметры.Вставить("Подсказка", Подсказка);
		Команда.ДополнительныеПараметры.Вставить("ЦветФона", WebЦвета.Золотой);	
		
		Команда.ЕстьУсловияВидимости = Истина;
		//ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ТребуетсяОбработкаОбновления", Истина);
		
	КонецЦикла;
КонецПроцедуры


Функция ВидКоманды()
	
	Возврат "ОбработкаОбновления";
	
КонецФункции

#КонецОбласти
