
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УстановкаПроцентаВыработкиПроизводства
	Движения.УДАЛИТЬ_УстановкаПроцентаВыработкиПроизводства.Записывать = Истина;
	Движение = Движения.УДАЛИТЬ_УстановкаПроцентаВыработкиПроизводства.Добавить();
	Движение.Период = Дата;
	Движение.Дата = Дата;
	Движение.ПроцентЗаЗаказНаПроизводствоДляЗарплатыРаскройщика = ПроцентЗаЗаказНаПроизводствоДляЗарплатыРаскройщика;
	Движение.ПроцентЗаЗаказНаПроизводствоДляЗарплатыМенеджера = ПроцентЗаЗаказНаПроизводствоДляЗарплатыМенеджера;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
