
&НаКлиенте
Перем мПредыдущийИдентификатор;

&НаКлиенте
Перем мНоменклатура;

&НаКлиенте
Перем мСпецификация;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		// перенесено в модуль объекта
		
	ИначеЕсли Параметры.Перезаполнить И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		Если НЕ Параметры.Основание.Пустая() Тогда
			
			ТекущийОбъект = РеквизитФормыВЗначение("Объект");
			ТекущийОбъект.Материалы.Очистить();		
			ТекущийОбъект.Продукция.Очистить();
			ТекущийОбъект.Услуги.Очистить();
			ТекущийОбъект.Заполнить(Параметры.Основание);
			ТекущийОбъект.ОбновитьДату(); //#14923
			ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
			
			Модифицированность = Истина;
			
		КонецЕсли;
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//++ №6687 теперь способ определяется в документе
	//Если Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить() Тогда
	//Если Объект.СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации Тогда
	////-- №6687
	//	Элементы.ГруппаИсполнителиПоОперациям.Видимость = Истина;
	//	Элементы.ГруппаИсполнители.Видимость = Ложь;
	//Иначе
	//	Элементы.ГруппаИсполнителиПоОперациям.Видимость = Ложь;
	//	Элементы.ГруппаИсполнители.Видимость = Истина;
	//КонецЕсли;
	
	// №6687
	Элементы.СпособНачисленияВыработки.Доступность = ПараметрыСеанса.Пользователь.РазрешеноМенятьСпособНачисленияВыработкиВДокументеВыпускПродукции;
	
	Если НЕ Константы.ИспользоватьПроизводственныеБригады.Получить() Тогда
		Элементы.Бригада.Видимость = Ложь;
	КонецЕсли;	
	
	ОбновитьДанныеДокумента();
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	//Если Объект.Проведен Тогда
	//	ЭтаФорма.ИспользоватьРежимПроведения=ИспользованиеРежимаПроведения.Неоперативный;
	//КонецЕсли;
	
	//#4644
	Выработка.Параметры.УстановитьЗначениеПараметра("ОбъектВыработки", Объект.Ссылка);
	ОбщийМодульСервер.УстановитьВидимостьГруппыВыработки(Элементы, Объект.Ссылка);
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("ПродукцияНоменклатураАртикул");
	МассивЭлементов.Добавить("УслугиНоменклатураАртикул");
	МассивЭлементов.Добавить("МатериалыНоменклатураАртикул");
	МассивЭлементов.Добавить("ВыработкаНоменклатураАртикул");
	МассивЭлементов.Добавить("ОбъектВыработкаНоменклатураАртикул");
	МассивЭлементов.Добавить("ВыработкаПлановаяНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
	// №6283 видимость колонок и расчет процента в ТЧ ИсполнителиПоОперациям
	ОбщийМодульСервер.УстановитьВидимостьКолонокВТабличнойЧастиИсполнителиПоОперациям(ЭтаФорма);
	ПересчитатьПроцентУчастияИсполнителейПоОперациям();
	ПересчитатьПроцентУчастияКТУИсполнителей();
	
	// №10877
	ВключитьПредпросмотрФайлов = НЕ Константы.ВыключитьПредпросмотрПрикрепленныхФайловВДокументах.Получить();
	Элементы.ГруппаФайлыПредпросмотр.Видимость = ВключитьПредпросмотрФайлов;
	ОбновитьСписокФайлов();
	
	ВидСпецификацииПоУмолчанию = Перечисления.ВидыСпецификации.СпецификацияПродукции;
	
	// #14189
	Элементы.МатериалыПодобратьОстаткиПленки.Видимость = Константы.ИспользоватьПоштучныйУчетОстатковПленки.Получить();
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// при создании вкладку Материалы устанавливаем по умолчанию
	Если Параметры.Ключ.Пустая() Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаМатериалы;
	КонецЕсли;
	
	ОбновитьИнформациюПоПотолку(); // №9892
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаТиповаяПродукция 
		или Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаПродукция Тогда
		Элементы.ГруппаИнформацияПоПотолку.Видимость = Ложь;
	Иначе
		Элементы.ГруппаИнформацияПоПотолку.Видимость = Истина;
	КонецЕсли;
	
	ВывестиПотолокВТабличнойЧасти(); // №9892
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// №1083 очищаем таблицу выработки, если выключена галочка "Ручная корректировка"
	Если НЕ Объект.РучнаяКорректировкаВыработки Тогда
		Объект.Выработка.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если НЕ Объект.Основание = Неопределено тогда
			Если НЕ Объект.Основание.Пустая() Тогда
				Если НЕ Объект.Основание.Проведен Тогда
					Сообщить("Документ-основание не проведен. Проведение документа отменено");
					Отказ = истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// перенесено в ОбработкаПроверкиЗаполнения
		//Если Объект.НесколькоТочекПроизводства И Объект.Цех.Пустая() Тогда
		//	Отказ = Истина;
		//	ТекстОшибки = НСтр("ru='Следует заполнить поле ""Цех""'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, "Цех", , Отказ);
		//	Возврат;
		//КонецЕсли;
		
		//проверим, что количество к выработке МАТЕРИАЛЫ соответствует количеству к выработке заказа на производство
		Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") И НЕ Объект.Основание.Пустая() Тогда
			
			//++ №14311 комментируем, т.к. ниже новый вариант контроля
			//КВыработкеЗаказ = Объект.Основание.Материалы.Итог("КоличествоКВыработке"); - раньше проверялось общее количество, теперь нужно проверять по видам
			//КВыработкеВыпуск = Объект.Материалы.Итог("КоличествоКВыработке");
			//
			//Если НЕ КВыработкеВыпуск = КВыработкеЗаказ Тогда
			//	Сообщить("В выпуске продукции количество материалов к выработке должно совпадать с количеством к выработке заказа на производство. В выпуске указано количество " + КВыработкеВыпуск 
			//	+ ". В заказе на производство указано количество " + КВыработкеЗаказ);
			//	Отказ = истина;
			//	Возврат;
			//КонецЕсли;
			
			//Запрос = новый Запрос;
			//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//   |	ВЫБОР
			//   |		КОГДА МатериалыВыпуска.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Полотно)
			//   |				ИЛИ МатериалыВыпуска.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ОстатокПленки)
			//   //++ №7839 потолоки, отрезы и типовые отрезы относим к пленке
			//   |				ИЛИ МатериалыВыпуска.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
			//   |				ИЛИ МатериалыВыпуска.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
			//   |				ИЛИ МатериалыВыпуска.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
			//   //-- №7839
			//   |			ТОГДА ""Полотно и остаток плёнки""
			//   |		ИНАЧЕ МатериалыВыпуска.ВидНоменклатурыНаименование
			//   |	КОНЕЦ КАК ПредставлениеВидаНоменклатуры,
			//   |	ЕСТЬNULL(МатериалыВыпуска.КоличествоКВыработке, 0) КАК КоличествоВВыпуске
			//   |ПОМЕСТИТЬ ВТ_МатериалыВыпуска_Пред
			//   |ИЗ
			//   |	&МатериалыВыпуска КАК МатериалыВыпуска               
			//   |;
			//   |
			//   |////////////////////////////////////////////////////////////////////////////////
			//   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//   |	МатериалыВыпуска.ПредставлениеВидаНоменклатуры КАК ПредставлениеВидаНоменклатуры,
			//   |	СУММА(ЕСТЬNULL(МатериалыВыпуска.КоличествоВВыпуске, 0)) КАК КоличествоВВыпуске
			//   |ПОМЕСТИТЬ ВТ_МатериалыВыпуска
			//   |ИЗ
			//   |	ВТ_МатериалыВыпуска_Пред КАК МатериалыВыпуска
			//   |
			//   |СГРУППИРОВАТЬ ПО
			//   |	МатериалыВыпуска.ПредставлениеВидаНоменклатуры
			//   |;
			//   |
			//   |////////////////////////////////////////////////////////////////////////////////
			//   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//   |	ВЫБОР
			//   |		КОГДА МатериалыЗаказа.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Полотно)
			//   |				ИЛИ МатериалыЗаказа.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ОстатокПленки)
			//   //++ №7839 потолоки, отрезы и типовые отрезы относим к пленке
			//   |				ИЛИ МатериалыЗаказа.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
			//   |				ИЛИ МатериалыЗаказа.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
			//   |				ИЛИ МатериалыЗаказа.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
			//   //-- №7839
			//   |			ТОГДА ""Полотно и остаток плёнки""
			//   |		ИНАЧЕ МатериалыЗаказа.Номенклатура.ВидНоменклатуры.Наименование
			//   |	КОНЕЦ КАК ПредставлениеВидаНоменклатуры,
			//   |	ЕСТЬNULL(МатериалыЗаказа.КоличествоКВыработке, 0) КАК КоличествоВЗаказе
			//   |ПОМЕСТИТЬ ВТ_МатериалыЗаказа_Пред
			//   |ИЗ
			//   |	Документ.ЗаказНаПроизводство.Материалы КАК МатериалыЗаказа
			//   |ГДЕ
			//   |	МатериалыЗаказа.Ссылка = &Основание
			//   |;
			//   |
			//   |////////////////////////////////////////////////////////////////////////////////
			//   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//   |	МатериалыЗаказа.ПредставлениеВидаНоменклатуры КАК ПредставлениеВидаНоменклатуры,
			//   |	СУММА(ЕСТЬNULL(МатериалыЗаказа.КоличествоВЗаказе, 0)) КАК КоличествоВЗаказе
			//   |ПОМЕСТИТЬ ВТ_МатериалыЗаказа
			//   |ИЗ
			//   |	ВТ_МатериалыЗаказа_Пред КАК МатериалыЗаказа
			//   |
			//   |СГРУППИРОВАТЬ ПО
			//   |	МатериалыЗаказа.ПредставлениеВидаНоменклатуры
			//   |;
			//   |
			//   |////////////////////////////////////////////////////////////////////////////////
			//   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//   |	МатериалыВыпуска.ПредставлениеВидаНоменклатуры КАК ПредставлениеВидаНоменклатуры,
			//   |	ЕСТЬNULL(МатериалыВыпуска.КоличествоВВыпуске, 0) КАК КоличествоВВыпуске,
			//   |	ЕСТЬNULL(МатериалыЗаказа.КоличествоВЗаказе, 0) КАК КоличествоВЗаказе
			//   |ИЗ
			//   |	ВТ_МатериалыВыпуска КАК МатериалыВыпуска
			//   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МатериалыЗаказа КАК МатериалыЗаказа
			//   |		ПО МатериалыВыпуска.ПредставлениеВидаНоменклатуры = МатериалыЗаказа.ПредставлениеВидаНоменклатуры
			//   |ГДЕ
			//   |	ЕСТЬNULL(МатериалыВыпуска.КоличествоВВыпуске, 0) <> ЕСТЬNULL(МатериалыЗаказа.КоличествоВЗаказе, 0)";
			//
			//МатериалыВыпуска = Объект.Материалы.Выгрузить(, "Номенклатура, КоличествоКВыработке");
			//МатериалыВыпуска.Колонки.Добавить("ВидНоменклатуры");
			//МатериалыВыпуска.Колонки.Добавить("ВидНоменклатурыНаименование");
			//Для Каждого ТекущаяСтрока Из МатериалыВыпуска Цикл
			//	ТекущаяСтрока.ВидНоменклатуры = ТекущаяСтрока.Номенклатура.ВидНоменклатуры;
			//	ТекущаяСтрока.ВидНоменклатурыНаименование = ТекущаяСтрока.ВидНоменклатуры.Наименование;
			//КонецЦикла;						
			//Запрос.УстановитьПараметр("МатериалыВыпуска", МатериалыВыпуска);
			//Запрос.УстановитьПараметр("Основание", Объект.Основание);
			//Выборка = Запрос.Выполнить().Выбрать();
			//
			//ЧастьТекстаОшибки = "";
			//Пока Выборка.Следующий() Цикл
			//	Отказ = Истина;
			//	ЧастьТекстаОшибки = ЧастьТекстаОшибки 
			//		+ ?(ЗначениеЗаполнено(ЧастьТекстаОшибки), Символы.ПС, "")
			//		+ "По виду номенклатуры """ + Выборка.ПредставлениеВидаНоменклатуры 
			//		+ """: в выпуске указано количество " + Выборка.КоличествоВВыпуске 
			//		+ ", в заказе на производство указано количество " + Выборка.КоличествоВЗаказе + ".";
			//КонецЦикла;
			//Если Отказ Тогда
			//	Сообщить("В выпуске продукции количество материалов к выработке должно совпадать с количеством к выработке заказа на производство." 
			//		+ Символы.ПС
			//		+ ЧастьТекстаОшибки);					
			//	Возврат;
			//КонецЕсли;
			//** №14311 комментируем, т.к. ниже новый вариант контроля
			
			//++ №14311 контроль материалов в производстве по документу настройки
			ОбщийМодульСервер.ВыполнитьКонтрольМатериаловВПроизводстве(
				Объект.Дата,
				Объект.Организация,
				Объект.Материалы.Выгрузить(),
				Объект.Основание.Материалы.Выгрузить(),
				Отказ,
				Перечисления.ВидыДокументовКонтроляМатериаловВПроизводстве.ВыпускПродукции
			);
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			//-- №14311
	
		КонецЕсли;
		
		//проверим, что количество к выработке УСЛУГИ соответствует количеству к выработке заказа на производство
		Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
			КВыработкеЗаказ = Объект.Основание.Услуги.Итог("КоличествоКВыработке");
			КВыработкеВыпуск = Объект.Услуги.Итог("КоличествоКВыработке");
			Если НЕ КВыработкеВыпуск = КВыработкеЗаказ Тогда
				Отказ = Истина;
			Иначе
				Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
					Если НЕ ТекущаяСтрока.КоличествоКВыработке = 0 Тогда
						Отбор = Новый Структура;
						Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
						Отбор.Вставить("КоличествоКВыработке", ТекущаяСтрока.КоличествоКВыработке);
						НайденныеСтроки = Объект.Основание.Услуги.НайтиСтроки(Отбор);
						Если НайденныеСтроки.Количество() = 0 Тогда
							Отказ = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Отказ Тогда
				Сообщить("Состав и количество услуг с выработкой в выпуске продукции и в заказе на производство должны совпадать.");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Отказ = НЕ ПраваПользователей.РазрешеноПриходоватьНаСклад(Объект.СкладПродукции);
			Если Отказ Тогда
				Сообщить("У текущего пользователя нет прав для оформления прихода на склад """ + Объект.СкладПродукции + """");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Отказ = НЕ ПраваПользователей.РазрешеноРасходоватьСоСклада(Объект.СкладМатериалов);
			Если Отказ Тогда
				Сообщить("У текущего пользователя нет прав для оформления расхода по складу """ + Объект.СкладМатериалов + """");
				Возврат;
			КонецЕсли;
		КонецЕсли;
	    
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьАРМПроизводства",,"ВыпускПродукции");
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		Оповестить("Запись_ВыпускПродукцииПоЗаказу", Объект.Основание, "ВыпускПродукции");
	КонецЕсли;
	Оповестить("Запись_ВыпускПродукции", Объект.Ссылка);
	
	Выработка.Параметры.УстановитьЗначениеПараметра("ОбъектВыработки", Объект.Ссылка); // для новых документов ссылка могла быть пустой
	Элементы.Выработка.Обновить();
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	//Если Объект.Проведен Тогда
	//	ЭтаФорма.ИспользоватьРежимПроведения=ИспользованиеРежимаПроведения.Неоперативный;
	//КонецЕсли;
	
	//++ №6283
	ПересчитатьПроцентУчастияИсполнителейПоОперациям();
	ПересчитатьПроцентУчастияКТУИсполнителей();
	//-- №6283
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда
		Если ПараметрРежимПодбора = 0 Тогда
			ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		ИначеЕсли ПараметрРежимПодбора = 1 Тогда
			ОбработкаВыбораПодборОстатковНаКлиенте(ВыбранноеЗначение);		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПодразделениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
	
	Если НЕ Объект.Подразделение.ОсновнойСклад.Пустая() Тогда
		Объект.СкладМатериалов = Объект.Подразделение.ОсновнойСклад;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БригадаПриИзменении(Элемент)
	ЗаполнитьИсполнителейПоСмене(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаПриИзменении(Элемент)
	
	ОбновитьДанныеДокумента();
	ОбновитьИнформациюПоПотолку(); // №9892
	ВывестиПотолокВТабличнойЧасти(); // №9892
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = новый СписокЗначений;	
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказовНаПроизводство.ТиповоеПроизводство"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиСобытийВкладкиПродукцияТиповая

&НаКлиенте
Процедура ПродукцияПриИзменении(Элемент)
	
	ОбновитьИнформациюПоПотолку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПередУдалением(Элемент, Отказ)
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Продукция.ВыделенныеСтроки Цикл		
		ТекущиеДанные = Объект.Продукция.НайтиПоИдентификатору(ВыделеннаяСтрока);
		УдалитьМатериалыОтносящиесяКПозицииНаСервере(ТекущиеДанные.Номенклатура);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПослеУдаления(Элемент)
	
	ОбновитьСписокФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПередНачаломИзменения(Элемент, Отказ)
	
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	мСпецификация = СтрокаТабличнойЧасти.Спецификация;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	//СтруктураДанные = Новый Структура("Номенклатура, ВидСпецификации", СтрокаТабличнойЧасти.Номенклатура, ВидСпецификацииПоУмолчанию);
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти("Продукция", СтрокаТабличнойЧасти);
	СтруктураДанные.Вставить("ВидСпецификации", ВидСпецификацииПоУмолчанию);
	
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	СтруктураДанные.Вставить("Количество", 1);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, Количество, Спецификация");
		
	ОбновитьСписокФайлов();
	
	Если НЕ СтрокаТабличнойЧасти.Спецификация.Пустая() Тогда
		ЗадатьВопросОПерезаполненииМатериаловПоСпецификации(СтруктураДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	
	Если НЕ СтрокаТабличнойЧасти.Спецификация.Пустая() Тогда
		СтруктураСтроки = СтруктураДанныхПоСтрокеТабличнойЧасти("Продукция", СтрокаТабличнойЧасти);
		ЗадатьВопросОПерезаполненииМатериаловПоСпецификации(СтруктураСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСпецификацияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	
	//Если очистили спецификацию, удаляем материалы
	Если мСпецификация <> Неопределено 
		И НЕ мСпецификация.Пустая()
		И СтрокаТабличнойЧасти.Спецификация.Пустая() Тогда
		
		УдалитьМатериалыОтносящиесяКПозицииНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	КонецЕсли;
	
	Если НЕ СтрокаТабличнойЧасти.Спецификация.Пустая() Тогда		
		СтруктураСтроки = СтруктураДанныхПоСтрокеТабличнойЧасти("Продукция", СтрокаТабличнойЧасти);
		ЗадатьВопросОПерезаполненииМатериаловПоСпецификации(СтруктураСтроки);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиПродукцияПотолок

&НаКлиенте
Процедура ПотолокНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Потолок.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	ТекущиеДанные.Коэффициент = 1;
	
	ПеренестиПотолокИзТабличнойЧасти(ТекущиеДанные);
	ОбновитьИнформациюПоПотолку();
	ОбновитьСписокФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолокЕдиницаИзмеренияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Потолок.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущиеДанные.Коэффициент = 1;
	Иначе
		ТекущиеДанные.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ТекущиеДанные.ЕдиницаИзмерения);
	КонецЕсли;
	
	ПеренестиПотолокИзТабличнойЧасти(ТекущиеДанные);
	ОбновитьИнформациюПоПотолку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолокЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Потолок.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолокЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Потолок.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущиеДанные.Коэффициент = 1;
	Иначе
		ТекущиеДанные.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
	ПеренестиПотолокИзТабличнойЧасти(Элементы.Потолок.ТекущиеДанные);
	ОбновитьИнформациюПоПотолку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолокКоличествоПриИзменении(Элемент)
	
	ПеренестиПотолокИзТабличнойЧасти(Элементы.Потолок.ТекущиеДанные);
	ОбновитьИнформациюПоПотолку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолокНомерРасчетаПриИзменении(Элемент)
	
	ПеренестиПотолокИзТабличнойЧасти(Элементы.Потолок.ТекущиеДанные);
	ОбновитьИнформациюПоПотолку();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиУслуги

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Коэффициент = 1;
	СтрокаТабличнойЧасти.Количество = 1;
	//СтрокаТабличнойЧасти.КоличествоКВыработке = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	//СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	//СтрокаТабличнойЧасти.КоличествоКВыработке = СтрокаТабличнойЧасти.Количество;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУслугиПоОснованию(Команда)
	
	ЗаполнитьУслугиПоОснованиюНаСервере();
	ПоказатьПредупреждение(,"Услуги перезаполнены");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУслугиПоОснованиюНаСервере()
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		Объект.Услуги.Очистить();
		Для Каждого СтрокаЗаказа Из Объект.Основание.Услуги Цикл
			СтрокаВыпуска = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВыпуска, СтрокаЗаказа);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиМатериалы

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	//ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	мНоменклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущийМатериал = ТекущиеДанные.Номенклатура;
	мНоменклатура = ТекущиеДанные.Номенклатура;
		
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьЕдиницуИзмеренияДляПроизводства(СтрокаТабличнойЧасти.Номенклатура);
	
	Если ЗначениеЗаполнено(мНоменклатура) И СтрокаТабличнойЧасти.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ОстаткиПленки") Тогда
		//#14457
		СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Коэффициент;
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе				
		Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			СтрокаТабличнойЧасти.Коэффициент = 1;
		ИначеЕсли ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
			СтрокаТабличнойЧасти.Коэффициент = ОбщийМодульВызовСервера.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		КонецЕсли;
	КонецЕсли;
	
	//++ №8266 при изменении номенклатуры пленки, если ширина предыдущей и текущей разные, то очищаем колонку "Количество"
	ПроверитьШиринуПолотнаНоменклатурыИОчиститьКоличествоПриРазличии(СтрокаТабличнойЧасти.Количество, СтрокаТабличнойЧасти.Номенклатура, ПредыдущийМатериал);
	ПредыдущийМатериал = СтрокаТабличнойЧасти.Номенклатура;
	//-- №8266

КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МатериалыПродукцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого ТекущаяСтрока Из Объект.Продукция Цикл
		ДанныеВыбора.Добавить(ТекущаяСтрока.Номенклатура);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьМатериалы(Команда)
	
	ПараметрРежимПодбора = 0;
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	ПараметрыПодбора.Вставить("Склад",					Объект.СкладМатериалов);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыТовары());
	ПараметрыПодбора.Вставить("НеЗапрашиватьЦену",		Истина);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
		НоваяСтрока = Объект.Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);	
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьМатериалыПоЗаказуНаПроизводство(Команда)
	
	Если Объект.Материалы.Количество() > 0 Тогда
		ОП = новый ОписаниеОповещения("ПослеВопросаОбОчисткеТабличнойЧастиМатериалы", ЭтотОбъект);
		ПоказатьВопрос(ОП, "При продолжении табличная часть ""Материалы"" будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьМатериалыПоЗаказуНаПроизводствоНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеТабличнойЧастиМатериалы(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьМатериалыПоЗаказуНаПроизводствоНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоЗаказуНаПроизводствоНаСервере()
	
	Объект.Материалы.Очистить();
	
	Для Каждого ТекущаяСтрока Из Объект.Основание.Материалы Цикл
		НоваяСтрока = Объект.Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСпецификациям(Команда)
	
	ЗаполнитьМатериалыПоСпецификациямНаСервере(ПолучитьСписокПозицийДляПерезаполненияМатериаловПоСпецификации());
	//ОбновитьДанныеДокумента();
	
КонецПроцедуры

// Процедура - Заполнить материалы по спецификациям на сервере
//
// Параметры:
//  СписокПозиций	 - массив структур ("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество, Коэффициент, Спецификация" 
//  ОчиститьТЧ		 - необходимость очистки  
//
&НаСервере
Процедура ЗаполнитьМатериалыПоСпецификациямНаСервере(МассивПозиций, ОчиститьТЧ = Истина)
	
	// #15041 - добавлено заполнение колонки "Продукция" (с версии 3.0.9)

	Если ОчиститьТЧ Тогда
		Объект.Материалы.Очистить();
	КонецЕсли;
	
	ВременнаяТаблица = Новый ТаблицаЗначений; //хранит общее количество необходимых материалов по спецификации после округления общего количества товаров
	ВременнаяТаблица.Колонки.Добавить("Номенклатура");
	ВременнаяТаблица.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ВременнаяТаблица.Колонки.Добавить("ОкруглятьВБольшуюСторону");
	ВременнаяТаблица.Колонки.Добавить("ПорядокОкругленияЧислом");
	ВременнаяТаблица.Колонки.Добавить("КоличествоДоОкругления");
	ВременнаяТаблица.Колонки.Добавить("КоличествоПослеОкругления");
	ВременнаяТаблица.Колонки.Добавить("Продукция"); // #15041
	
	ТаблицаМатериалов = Новый ТаблицаЗначений;
	ТаблицаМатериалов.Колонки.Добавить("Номенклатура");
	ТаблицаМатериалов.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаМатериалов.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаМатериалов.Колонки.Добавить("Коэффициент");
	ТаблицаМатериалов.Колонки.Добавить("Количество");
	ТаблицаМатериалов.Колонки.Добавить("Продукция"); // #15041
	
	Для Каждого ТекущаяСтрока Из МассивПозиций Цикл //Объект.Продукция Цикл // #15041
		//НоваяСтрока = ТаблицаМатериалов.Добавить();
		Если НЕ ТекущаяСтрока.Спецификация.Пустая() Тогда
			Для Каждого СтрокаСпецификации Из ТекущаяСтрока.Спецификация.Состав Цикл
				КоэффициентИзменения = ?(СтрокаСпецификации.ФиксированноеКоличество, 1, ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент);
				КоличествоКДобавлению = ОбщийМодуль.ОкруглитьЧисло(КоэффициентИзменения * СтрокаСпецификации.Количество,СтрокаСпецификации.ПорядокОкругленияЧислом,СтрокаСпецификации.ОкруглятьВБольшуюСторону); 
				Если КоличествоКДобавлению > 0 Тогда
					НоваяСтрока = ТаблицаМатериалов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСпецификации);
					НоваяСтрока.Количество = КоличествоКДобавлению;
					НоваяСтрока.Продукция = ТекущаяСтрока.Номенклатура;    // #15041
					
					НоваяВремСтрока = ВременнаяТаблица.Добавить();
					НоваяВремСтрока.Номенклатура = СтрокаСпецификации.Номенклатура;
					НоваяВремСтрока.ХарактеристикаНоменклатуры = СтрокаСпецификации.ХарактеристикаНоменклатуры;
					НоваяВремСтрока.ОкруглятьВБольшуюСторону = СтрокаСпецификации.ОкруглятьВБольшуюСторону;
					НоваяВремСтрока.ПорядокОкругленияЧислом = СтрокаСпецификации.ПорядокОкругленияЧислом;
					НоваяВремСтрока.КоличествоДоОкругления = КоэффициентИзменения * СтрокаСпецификации.Количество;
					НоваяВремСтрока.КоличествоПослеОкругления = 0;
					НоваяВремСтрока.Продукция = ТекущаяСтрока.Номенклатура; // #15041
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаМатериалов.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Продукция",                    // #15041 +Продукция
							   "Количество");
	ВременнаяТаблица.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ОкруглятьВБольшуюСторону, ПорядокОкругленияЧислом, Продукция", // #15041 +Продукция
							  "КоличествоДоОкругления, КоличествоПослеОкругления");
	
	//посчитаем сколько какого материала должно быть итого с применением округления
	Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
		ТекущаяСтрока.КоличествоПослеОкругления = ОбщийМодуль.ОкруглитьЧисло(ТекущаяСтрока.КоличествоДоОкругления,ТекущаяСтрока.ПорядокОкругленияЧислом,ТекущаяСтрока.ОкруглятьВБольшуюСторону);
	КонецЦикла;
	
	//получаем итоговое количество каждого материала после всех округлений
	ВременнаяТаблица.Свернуть("Номенклатура, ХарактеристикаНоменклатуры", "КоличествоПослеОкругления");
	
	//перезаполняем количество в результирующей таблице на основании того, сколько должно было бы получиьтся при общем итоге после округления
	Для Каждого ТекущийМатериал Из ТаблицаМатериалов Цикл
		КоличествоБыло = ТекущийМатериал.Количество;
		ТекущийМатериал.Количество = 0;
		Для Каждого ТекущийИтогМатериала Из ВременнаяТаблица Цикл
			Если ТекущийМатериал.Номенклатура = ТекущийИтогМатериала.Номенклатура 
				И ТекущийМатериал.ХарактеристикаНоменклатуры = ТекущийИтогМатериала.ХарактеристикаНоменклатуры Тогда
				
				Если ТекущийИтогМатериала.КоличествоПослеОкругления >= КоличествоБыло Тогда
					ТекущийМатериал.Количество = КоличествоБыло;
					ТекущийИтогМатериала.КоличествоПослеОкругления = ТекущийИтогМатериала.КоличествоПослеОкругления - КоличествоБыло;
				Иначе
					ТекущийМатериал.Количество = ТекущийИтогМатериала.КоличествоПослеОкругления;
					ТекущийИтогМатериала.КоличествоПослеОкругления = 0;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла
	КонецЦикла;
	
	//переносим таблицу в документ
	Для Каждого ТекущийМатериал Из ТаблицаМатериалов Цикл
		Если НЕ ТекущийМатериал.Количество = 0 Тогда
			НоваяСтрока = Объект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийМатериал);
			НоваяСтрока.КоличествоКВыработке = НоваяСтрока.Количество;
		КонецЕсли;
	КонецЦикла;
	
	// закомментировано: типовые отрезу не используются
	//находим в списке материалов типовые отрезы и меняем их на соответствующую пленку
	//Для Каждого СтрокаМатериала Из Объект.Материалы Цикл
	//	Если СтрокаМатериала.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ТиповойОтрез Тогда
	//		НоменклатураОтреза = СтрокаМатериала.Номенклатура;
	//		КоличествоОтреза = СтрокаМатериала.Количество;
	//		ЕдиницаИзмеренияОтреза = СтрокаМатериала.ЕдиницаИзмерения;
	//		
	//		ВремНоменклатура = Справочники.Номенклатура.ПолучитьОсновнуюФактуруИЦветПотолка(НоменклатураОтреза).ПродукцияЦвет.Номенклатура;
	//		Если НЕ ВремНоменклатура.Пустая() Тогда
	//			СтрокаМатериала.Номенклатура = ВремНоменклатура;
	//			СтрокаМатериала.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаМатериала.Номенклатура);
	//			СтрокаМатериала.Коэффициент = 1;
	//			Если СтрокаМатериала.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.МетрПогонный Тогда
	//				ШиринаПолотна = НоменклатураОтреза.Фактура.ШиринаПолотна / 100;
	//				Если НЕ ШиринаПолотна = 0 Тогда
	//					СтрокаМатериала.Количество = Окр(КоличествоОтреза / ШиринаПолотна,2);
	//				Иначе
	//					СтрокаМатериала.Количество = 0;
	//				КонецЕсли;
	//			Иначе
	//				СтрокаМатериала.Количество = КоличествоОтреза;
	//			КонецЕсли;
	//			СтрокаМатериала.КоличествоКВыработке = КоличествоОтреза;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиИсполнители

&НаКлиенте
Процедура ИсполнителиПриИзменении(Элемент)
	
	//ОбновитьДанныеДокумента();
	ПересчитатьПроцентУчастияКТУИсполнителей(); // №6283
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоОперациямПриИзменении(Элемент)
	
	ПересчитатьПроцентУчастияИсполнителейПоОперациям();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоОперациямСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИсполнителиПоОперациям.ТекущиеДанные;
	
	НомерСотрудника = Прав(Элемент.Имя, 1);
	
	Если ТекущиеДанные["Коэффициент" + НомерСотрудника] = 0 Тогда
		ТекущиеДанные["Коэффициент" + НомерСотрудника] = 1;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиВыработки

&НаКлиенте
Процедура РучнаяКорректировкаВыработкиПриИзменении(Элемент)
	
	ОбщийМодульКлиент.РучнаяКорректировкаВыработкиПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыработкуПоУстановленнымПравиламРасчета(Команда)
	
	ОбъектФормы = ЭтаФорма.Объект;
	ОбщийМодульВызовСервера.ЗаполнитьВыработкуВДокументе(ОбъектФормы);
	КопироватьДанныеФормы(ОбъектФормы, Объект);
	Модифицированность = Истина;
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаКоличествоПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСтоимостьВСтрокеТЧ(Элементы.ОбъектВыработка.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаЦенаПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСтоимостьВСтрокеТЧ(Элементы.ОбъектВыработка.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаСуммаПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьЦенуПоСтоимостиВСтрокеТЧ(Элементы.ОбъектВыработка.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ОбъектВыработка.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьЕдиницуИзмеренияДляПроизводства(СтрокаТабличнойЧасти.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаВидНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидыИсполнителей = новый СписокЗначений;
	ОбщийМодульКлиент.СформироватьДанныеВыбораВидаИсполнителя(ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции"), ВидыИсполнителей, , Ложь);
	ОбщийМодульВызовСервера.СформироватьДанныеВыбораВидаНачисленияПоВидамИсполнителей(ДанныеВыбора, ВидыИсполнителей, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ОбъектВыработка.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаПриИзменении(Элемент)
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ВыработкаВыбор(Элемент, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПлановаяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ВыработкаПлановаяВыбор(Элемент, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ВкладкаФайлы

&НаСервере
Процедура ОбновитьСписокФайлов()
	
	Файлы.Очистить();
	
	СписокНоменклатуры = Новый СписокЗначений;
	Если ЗначениеЗаполнено(Объект.ПродукцияНоменклатура) Тогда
		СписокНоменклатуры.Добавить(Объект.ПродукцияНоменклатура);
	КонецЕсли;
	 
	Для Каждого Строка Из Объект.Продукция Цикл
		СписокНоменклатуры.Добавить(Строка.Номенклатура);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК Номенклатура,
	|	ПрикрепленныеДанные.ИмяФайла,
	|	ПрикрепленныеДанные.Расширение,
	|	ПрикрепленныеДанные.ИмяФайла + ""."" + ПрикрепленныеДанные.Расширение КАК НаименованиеФайла,
	|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя,
	|	ПрикрепленныеДанные.Период КАК ДатаПрикрепления
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект В(&СсылкаНаОбъект)";
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СписокНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Файлы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Если Файлы.Количество() > 0 Тогда
		Элементы.ТаблицаФайлы.Заголовок = "Файлы (" + Файлы.Количество() + ")";
	Иначе
		Элементы.ТаблицаФайлы.Заголовок = "Файлы";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные(СсылкаНаОбъект, ИмяФайла)
	
	Возврат ОбщийМодульВызовСервера.ПолучитьДанныеФайла(СсылкаНаОбъект, ИмяФайла, , ЭтаФорма.УникальныйИдентификатор);	
	
КонецФункции

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресФайла = ПолучитьДанные(Элементы.Файлы.ТекущиеДанные.Номенклатура, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	ВременноеИмя=ПолучитьИмяВременногоФайла(Элементы.Файлы.ТекущиеДанные.Расширение);
    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	СписокПотолков = ПолучитьСписокПотолков();
	Если НЕ СписокПотолков.Количество() = 0 Тогда
		Оп = Новый ОписаниеОповещения("ВыборПотолкаДляПрикрепленияФайла", ЭтаФорма);
		ПоказатьВыборИзМеню(Оп, СписокПотолков, Элементы.ФайлыДобавитьФайл);
	Иначе
		ПоказатьПредупреждение(,"В продукции и товарах нет потолков и отрезов");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПотолков()
	
	СписокНоменклатуры = Новый СписокЗначений;
	Если ЗначениеЗаполнено(Объект.ПродукцияНоменклатура) Тогда
		СписокНоменклатуры.Добавить(Объект.ПродукцияНоменклатура);
	КонецЕсли;
	 
	Для Каждого Строка Из Объект.Продукция Цикл
		Если СписокНоменклатуры.НайтиПоЗначению(Строка.Номенклатура) = Неопределено Тогда 
			СписокНоменклатуры.Добавить(Строка.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ВыборПотолкаДляПрикрепленияФайла(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ДействиеПослеПрикрепления", ОписаниеОповещения);
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(ВыбранныйЭлемент.Значение, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрикрепленияФайлаЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРезультата.Результат Тогда
		ОбновитьДанныеДокумента();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьФайл(Команда)
	
	ВыбранныеЭлементы = Элементы.Файлы.ВыделенныеСтроки;
	
	Если ВыбранныеЭлементы.Количество() > 0 Тогда
		Для каждого ЭлементДляПечати из ВыбранныеЭлементы Цикл
			СтрФайл = Файлы.НайтиПоИдентификатору(ЭлементДляПечати);
			
			АдресФайла = ПолучитьДанные(СтрФайл.Номенклатура, СтрФайл.ИмяФайла);
			ВременноеИмя = ПолучитьИмяВременногоФайла(СтрФайл.Расширение);
			ПолучитьФайл(АдресФайла, ВременноеИмя, Ложь);
			
			Shell = Новый COMОбъект("Shell.Application");
			Shell.ShellExecute(ВременноеИмя, "", "", "print", 0);
		КонецЦикла;
	Иначе
		ПоказатьПредупреждение(,"Выберите файл(ы) в списке");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	Если НЕ ВключитьПредпросмотрФайлов ИЛИ Элементы.Файлы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если мПредыдущийИдентификатор = Элементы.Файлы.ТекущиеДанные.ПолучитьИдентификатор() Тогда
		Возврат;
	Иначе
		мПредыдущийИдентификатор = Элементы.Файлы.ТекущиеДанные.ПолучитьИдентификатор();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияФайлыПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияФайлыПриАктивизацииСтроки()
	
	Если Элементы.Файлы.ТекущиеДанные.Номенклатура.Пустая() Тогда
		АдресФайла = ПолучитьДанные(Объект.Ссылка, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	Иначе
		АдресФайла = ПолучитьДанные(Элементы.Файлы.ТекущиеДанные.Номенклатура, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	КонецЕсли;
	
	ОбщийМодульКлиент.ПредпросмотрФайла(АдресФайла, Элементы.Файлы.ТекущиеДанные.Расширение, Предпросмотр, Элементы.Предпросмотр);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// процедура экспортная из-за вызова из ОбщийМодульКлиент.РучнаяКорректировкаВыработкиПриИзменении
&НаСервере
Процедура ОбновитьДанныеДокумента() Экспорт
	
	//Если Объект.Материалы.Количество() > 0 тогда
	//	Элементы.ГруппаМатериалы.Заголовок = "Материалы ("+Объект.Материалы.Количество()+")";
	//Иначе
	//	Элементы.ГруппаМатериалы.Заголовок = "Материалы";
	//КонецЕсли;
	//Если Объект.Исполнители.Количество() > 0 тогда
	//	Элементы.ГруппаИсполнители.Заголовок = "Исполнители ("+Объект.Исполнители.Количество()+")";
	//Иначе
	//	Элементы.ГруппаИсполнители.Заголовок = "Исполнители";
	//КонецЕсли;
	//Если Объект.ИсполнителиПоОперациям.Количество() > 0 тогда
	//	Элементы.ГруппаИсполнителиПоОперациям.Заголовок = "Исполнители по операциям ("+Объект.ИсполнителиПоОперациям.Количество()+")";
	//Иначе
	//	Элементы.ГруппаИсполнителиПоОперациям.Заголовок = "Исполнители по операциям";
	//КонецЕсли;
	//Если Объект.Услуги.Количество() > 0 тогда
	//	Элементы.ГруппаУслуги.Заголовок = "Услуги ("+Объект.Услуги.Количество()+")";
	//Иначе
	//	Элементы.ГруппаУслуги.Заголовок = "Услуги";
	//КонецЕсли;
	
	Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
		Элементы.ГруппаПродукция.Видимость = Ложь;
		Элементы.ГруппаТиповаяПродукция.Видимость = Истина;
		Элементы.МатериалыПродукция.Видимость = Истина;
		Элементы.МатериалыЗаполнитьМатериалыПоСпецификациям.Видимость = Истина;
		//#15041 
		Элементы.Основание.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ГруппаПродукция.Видимость = Истина;
		Элементы.ГруппаТиповаяПродукция.Видимость = Ложь;
		Элементы.МатериалыПродукция.Видимость = Ложь;
		Элементы.МатериалыЗаполнитьМатериалыПоСпецификациям.Видимость = Ложь;
		//#15041 
		Элементы.Основание.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Элементы.Цех.Видимость = Объект.НесколькоТочекПроизводства;
	
	// №1083 видимость определенных таблиц по выработке
	ОбщийМодульСервер.ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог(ЭтаФорма);
	
	// №6687 видимость ТЧ исполнителей по способу начисления
	Элементы.ГруппаИсполнителиПоОперациям.Видимость = (Объект.СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации);
	Элементы.ГруппаИсполнители.Видимость = (Объект.СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.Бригадная);
	
	ОбновитьСписокФайлов();
	
	// №12997 заказ на производство и выпуск с видом "Производство уникальной продукции" и документ основание проведен
	Элементы.Потолок.ТолькоПросмотр = (ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство")
		И ЗначениеЗаполнено(Объект.Основание)
		И Объект.Основание.Проведен
		И Объект.Основание.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка
		И Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка
	);
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураДанныхПоСтрокеТабличнойЧасти(ИмяТаблицы, СтрокаТабличнойЧасти)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",			ИмяТаблицы);                          
	СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);  
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 	СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 			СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Коэффициент", 		СтрокаТабличнойЧасти.Коэффициент);
	Если ИмяТаблицы = "Продукция" Тогда
		СтруктураДанные.Вставить("Спецификация", 		СтрокаТабличнойЧасти.Спецификация);
	КонецЕсли;
	//СтруктураДанные.Вставить("Дата", 				Объект.Дата);
	//СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	//СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	//СтруктураДанные.Вставить("Организация",			Объект.Организация);
	//СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	//СтруктураДанные.Вставить("Контрагент",			Объект.Контрагент);
	//СтруктураДанные.Вставить("ДоговорКонтрагента", 	Объект.ДоговорКонтрагента);
	//СтруктураДанные.Вставить("ДопВалюта", 			ДопВалютаУчета);
	//СтруктураДанные.Вставить("ЦеныВДопВалюте", 		Объект.ЦенаВДополнительнойВалютеУчетаЗапасов);
	//СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);
	
	Возврат СтруктураДанные;
	
КонецФункции

#Область РаботаСоСпецификациями

&НаСервере
Функция ПолучитьСписокПозицийДляПерезаполненияМатериаловПоСпецификации()
	
	МассивПозиций = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Объект.Продукция Цикл			
		Если НЕ ТекущаяСтрока.Спецификация.Пустая() Тогда
			МассивПозиций.Добавить(новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество, Коэффициент, Спецификация",
				ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения,
				ТекущаяСтрока.Количество, ТекущаяСтрока.Коэффициент, ТекущаяСтрока.Спецификация));				
		КонецЕсли;
	КонецЦикла;	
	
	Возврат МассивПозиций;
	
КонецФункции

&НаКлиенте
Процедура ЗадатьВопросОПерезаполненииМатериаловПоСпецификации(СтруктураСтроки)
	
	ДополнительныеПараметры = Новый Структура;	
	ДополнительныеПараметры.Вставить("СтруктураСтроки", СтруктураСтроки);	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаНаВопросПерезаполненииМатериаловПоСпецификации", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, "Перезаполнить материалы по спецификации текущей позиции?", РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаВопросПерезаполненииМатериаловПоСпецификации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработкаОтветаНаВопросПерезаполненииМатериаловПоСпецификацииНаСервере(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОтветаНаВопросПерезаполненииМатериаловПоСпецификацииНаСервере(ДополнительныеПараметры)	
		
	//Сначало удалим
	УдалитьМатериалыОтносящиесяКПозицииНаСервере(ДополнительныеПараметры.СтруктураСтроки.Номенклатура);
		
	МассивПозиций = Новый Массив;
	МассивПозиций.Добавить(ДополнительныеПараметры.СтруктураСтроки);
	
	//Теперь заполним		
	ЗаполнитьМатериалыПоСпецификациямНаСервере(МассивПозиций, Ложь);	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМатериалыОтносящиесяКПозицииНаСервере(Продукция)
	
	КоличествоЗаписей = Объект.Материалы.Количество();
	Для Сч = 1 По КоличествоЗаписей Цикл
		
		Если Объект.Материалы.Получить(КоличествоЗаписей-Сч).Продукция = Продукция Тогда
			Объект.Материалы.Удалить(КоличествоЗаписей-Сч);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПересчитатьПроцентУчастияИсполнителейПоОперациям()
	
	ОбщийМодульСервер.ПересчитатьПроцентУчастияИсполнителейПоОперациям(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПроцентУчастияКТУИсполнителей()
	
	// по аналогии с модулем зарплаты
	ОбщийМодульСервер.ПересчитатьПроцентУчастияКТУИсполнителей(Объект);
			
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаСервере
Процедура ПодобратьНоменклатуруПродукцияНаСервере()
	
	НаименованиеНоменклатурыДляПоиска = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(Объект.ПродукцияНомерРасчета, Объект.ПродукцияЦвет, Объект.ПродукцияЦвет.Владелец);
	ГруппаНоменклатурыДляПоиска = Константы.ГруппаНоменклатурыПродукция.Получить();
	
	ИскомаяНоменклатура = ОбменСEasyCeiling.НайтиНоменклатуруПотолка(Объект.ПродукцияНомерРасчета, НаименованиеНоменклатурыДляПоиска, ГруппаНоменклатурыДляПоиска);
	Объект.ПродукцияНоменклатура = ИскомаяНоменклатура;
	Объект.ПродукцияНоменклатураКоличество = Объект.ПродукцияКоличество;
	Объект.ПродукцияНоменклатураКоэффициент = 1;
	Объект.ПродукцияНоменклатураЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Объект.ПродукцияНоменклатура);
	
КонецПроцедуры

&НаСервере
Функция СоздатьНоменклатуруПродукцияНаСервере()
	
КонецФункции

&НаКлиенте
Процедура ПодобратьНоменклатуруПродукция(Команда)
	
	Если НЕ Объект.ПродукцияНоменклатура.Пустая() Тогда
		Если Вопрос("Очистить введенные ранее данные?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПодобратьНоменклатуруПродукцияНаСервере();
	Если Объект.ПродукцияНоменклатура.Пустая() Тогда
		Если Вопрос("Подходящая по фактуре номенклатура не найдена, создать новую?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Результат = СоздатьНоменклатуруПродукцияНаСервере();
			Состояние(Результат);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНоменклатура1ПриИзменении(Элемент)
	
	Объект.ПродукцияНоменклатураЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Объект.ПродукцияНоменклатура);
	Объект.ПродукцияНоменклатураКоэффициент = 1;
	
	ОбновитьИнформациюПоПотолку(); // №9892
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНоменклатураЕдиницаИзмеренияПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.ПродукцияНоменклатураЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Объект.ПродукцияНоменклатураКоэффициент = 1;
	Иначе
		Объект.ПродукцияНоменклатураКоэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(Объект.ПродукцияНоменклатураЕдиницаИзмерения);
	КонецЕсли;
	
	ОбновитьИнформациюПоПотолку(); // №9892
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНоменклатураЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(Объект.ПродукцияНоменклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНоменклатураЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Объект.ПродукцияНоменклатураКоэффициент = 1;
	Иначе
		Объект.ПродукцияНоменклатураКоэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиСотрудникПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Исполнители.ТекущиеДанные;
	СтрокаТабличнойЧасти.Коэффициент = 1;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоСмене(Команда)
	
	ОчиститьСообщения();
	
	//++ №6687 теперь способ определяется в документе
	//Если НЕ ИсполнителиПоОперациям() Тогда
	Если Объект.СпособНачисленияВыработки = ПредопределенноеЗначение("Перечисление.СпособыНачисленияВыработки.Бригадная") Тогда
	//-- №6687
		Если Объект.Исполнители.Количество() > 0 Тогда
			Если Вопрос("Очистить табличную часть исполнителей?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
				Объект.Исполнители.Очистить();
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Объект.ИсполнителиПоОперациям.Количество() > 0 Тогда
			Если Вопрос("Очистить табличную часть исполнителей?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
				Объект.ИсполнителиПоОперациям.Очистить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьИсполнителейПоСменеНаСервере();
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсполнителейПоСменеНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ЗаполнитьИсполнителейПоСмене();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
	//++ №6283
	ПересчитатьПроцентУчастияИсполнителейПоОперациям(); 
	ПересчитатьПроцентУчастияКТУИсполнителей();
	//-- №6283
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВидовНоменклатурыТовары()
	
	Возврат Справочники.Номенклатура.ПолучитьСписокВидовНоменклатурыТовары();
		
КонецФункции

&НаКлиенте
Процедура ДобавитьРулонПоНомеру(Команда)
	
	Перем ВыбЗнач;
	Массив = Новый Массив;
	//Массив.Добавить(Тип("Число"));
	//КЧ = Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный);
	//ОписаниеТипов = Новый ОписаниеТипов(Массив, КЧ);
	Массив.Добавить(Тип("Строка"));
	КС = Новый КвалификаторыСтроки(150);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);

	Оповещение = Новый ОписаниеОповещения("ПослеВводаНомераРулона", ЭтаФорма, Параметры);
	// #5951 в тексте заголовка "номер/наименование" заменено на "наименование"
	ТекстЗаголовкаОкнаВвода = "Введите наименование рулона (серии номенклатуры)" + Символы.ПС + "или отсканируйте его штрих-код";
	ПоказатьВводЗначения(Оповещение, ВыбЗнач, ТекстЗаголовкаОкнаВвода, ОписаниеТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНомераРулона(НаименованиеРулона, Параметры) Экспорт
	Если НаименованиеРулона<>Неопределено Тогда
		НомерРулона = 0;
		Попытка
			НомерРулона = Число(НаименованиеРулона);
		Исключение	
		КонецПопытки;
		ДобавитьВМатериалыРулонПоНомеру(НомерРулона, НаименованиеРулона);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьВМатериалыРулонПоНомеру(Знач НомерРулона, Знач НаименованиеРулона)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СерииНоменклатуры.Владелец КАК Владелец,
	|	СерииНоменклатуры.Ссылка КАК Ссылка,
	|	СерииНоменклатуры.Владелец.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения,
	|	СерииНоменклатуры.Владелец.АльтернативнаяЕдиницаИзмерения КАК АльтЕдИзм,
	|	ЕСТЬNULL(СерииНоменклатуры.Владелец.АльтернативнаяЕдиницаИзмерения.Коэффициент, 0) КАК КоэффициентАльтЕдИзм
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	НЕ СерииНоменклатуры.ПометкаУдаления
	|	И (
	|	СерииНоменклатуры.Наименование = &Наименование
	//#5951 ищем только по наименованию
	//|			ИЛИ &Номер > 0
	//|				И СерииНоменклатуры.НомерСерии = &Номер
	|	)
	|";
	//Запрос.УстановитьПараметр("Номер", НомерРулона);
	Запрос.УстановитьПараметр("Наименование", СокрЛП(НаименованиеРулона));
	
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоРулонов = Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Материалы.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Владелец;
		НоваяСтрока.СерияНоменклатуры = Выборка.Ссылка;
		НоваяСтрока.ЕдиницаИзмерения = Выборка.БазоваяЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = 1;
		
		//проверим характеристики. если только одна - укажем ее тоже
		ЗапросХарактеристики = Новый Запрос;
		ЗапросХарактеристики.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХарактеристикиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ";
		ЗапросХарактеристики.УстановитьПараметр("Владелец",Выборка.Владелец);
		ВыборкаХарактеристики = ЗапросХарактеристики.Выполнить().Выгрузить();
		Если ВыборкаХарактеристики.Количество() = 1 Тогда
			НоваяСтрока.ХарактеристикаНоменклатуры = ВыборкаХарактеристики[0].Ссылка;
		КонецЕсли;
		
		//Количество рулона по полотну из заказа на производство с учётом коэффициента
		Если КоличествоРулонов = 1 И Объект.Материалы.Количество() = 1
			И Объект.Основание <> Неопределено
			И НЕ Объект.Основание.Пустая() Тогда
			
			//Нужно в заказе на производство, найти полотно и если есть поставить количество первого			
			Для Каждого Материал Из Объект.Основание.Материалы Цикл
				Если Материал.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
					//количество будет рассчитано с учетом коэффициента
					КоэффициентАльтЕдИзм = ?(Выборка.КоэффициентАльтЕдИзм > 0, Выборка.КоэффициентАльтЕдИзм, 1);					
					Если Материал.Коэффициент = 1 Тогда
						РулонКоличество = Материал.Количество;
					Иначе						
						РулонКоличество = (Материал.Количество * ?(Материал.Коэффициент > 0, Материал.Коэффициент, 1))
										/ КоэффициентАльтЕдИзм;
					КонецЕсли;
					
					Если Выборка.АльтЕдИзм <> Неопределено И НЕ Выборка.АльтЕдИзм.Пустая() Тогда
						НоваяСтрока.ЕдиницаИзмерения = Выборка.АльтЕдИзм;					
					КонецЕсли;	
					НоваяСтрока.Коэффициент = КоэффициентАльтЕдИзм;					
					НоваяСтрока.Количество = РулонКоличество;
					НоваяСтрока.КоличествоКВыработке = Материал.КоличествоКВыработке;	
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
					
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьРулонПоНомеру(Команда)
	
	Перем ВыбЗнач;
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Необходимо выбрать позицию для замены рулона!");
		Возврат;
	Иначе	
		
		Массив = Новый Массив;
		//Массив.Добавить(Тип("Число"));
		//КЧ = Новый КвалификаторыЧисла(12);
		//ОписаниеТипов = Новый ОписаниеТипов(Массив, КЧ);
		Массив.Добавить(Тип("Строка"));
		КС = Новый КвалификаторыСтроки(150);
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		Оповещение = Новый ОписаниеОповещения("ПослеВводаНомераРулонаЗамена", ЭтаФорма);
		// #5951 в тексте заголовка "номер/наименование" заменено на "наименование"
		ТекстЗаголовкаОкнаВвода = "Введите наименование рулона (серии номенклатуры)" + Символы.ПС + "или отсканируйте его штрих-код";
		ПоказатьВводЗначения(Оповещение, ВыбЗнач, ТекстЗаголовкаОкнаВвода, ОписаниеТипов);

	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНомераРулонаЗамена(НаименованиеРулона, ДопПараметры) Экспорт
	Если НаименованиеРулона<>Неопределено Тогда
		НомерРулона = 0;
		Попытка
			НомерРулона = Число(НаименованиеРулона);
		Исключение	
		КонецПопытки;
		
		ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
		Если ЗаменитьВМатериалыРулонПоНомеру(НомерРулона, НаименованиеРулона, ТекущиеДанные.Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, ТекущиеДанные.СерияНоменклатуры) Тогда
			МатериалыНоменклатураПриИзменении(Неопределено);
		КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаменитьВМатериалыРулонПоНомеру(Знач НомерРулона, НаименованиеРулона, ТекущиеДанныеНоменклатура, ТекущиеДанныеХарактеристикаНоменклатуры, ТекущиеДанныеСерияНоменклатуры)	
	
	Результат = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СерииНоменклатуры.Владелец КАК Владелец,
	|	СерииНоменклатуры.Ссылка КАК Ссылка,
	|	СерииНоменклатуры.Владелец.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения,
	|	СерииНоменклатуры.Владелец.АльтернативнаяЕдиницаИзмерения КАК АльтЕдИзм,
	|	ЕСТЬNULL(СерииНоменклатуры.Владелец.АльтернативнаяЕдиницаИзмерения.Коэффициент, 0) КАК КоэффициентАльтЕдИзм
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	НЕ СерииНоменклатуры.ПометкаУдаления
	|	И (СерииНоменклатуры.Наименование = &Наименование
	//#5951 ищем только по наименованию
	//|			ИЛИ &Номер > 0
	//|				И СерииНоменклатуры.НомерСерии = &Номер
	|	)
	|";
	//Запрос.УстановитьПараметр("Номер", НомерРулона);
	Запрос.УстановитьПараметр("Наименование", СокрЛП(НаименованиеРулона));
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Следующий() Тогда
				
		ТекущиеДанныеНоменклатура = Выборка.Владелец;
		ТекущиеДанныеХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		ТекущиеДанныеСерияНоменклатуры = Выборка.Ссылка;
		
		//проверим характеристики. если только одна - укажем ее тоже
		ЗапросХарактеристики = Новый Запрос;
		ЗапросХарактеристики.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХарактеристикиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ";
		ЗапросХарактеристики.УстановитьПараметр("Владелец",Выборка.Владелец);
		ВыборкаХарактеристики = ЗапросХарактеристики.Выполнить().Выгрузить();
		Если ВыборкаХарактеристики.Количество() = 1 Тогда
			ТекущиеДанныеХарактеристикаНоменклатуры = ВыборкаХарактеристики[0].Ссылка;
		КонецЕсли;
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ДобавитьОстатокВМатериалы(ЗаменитьПолотна = Ложь, Знач ЭтоОстаток = Истина)
	
	ОбщийМодульСервер.ИзменитьПолотнаВМатериалах(Объект, ЗаменитьПолотна, ЭтоОстаток);
	Модифицированность = Истина; 
		
КонецПроцедуры

&НаКлиенте
Процедура СделаноИзОстатков(Команда)
	
	Если Объект.Материалы.Количество() > 0 Тогда
		ВремПарам = Новый Структура("ЭтоОстаток",Истина);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаменеПолотен",ЭтаФорма, ВремПарам) ,"Заменить полотна на ""Остаток""? При нажатии ""Нет"" будет добавлена строка.", РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ДобавитьОстатокВМатериалы(Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗаменеПолотен(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        ДобавитьОстатокВМатериалы(Истина, Параметры.ЭтоОстаток);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ДобавитьОстатокВМатериалы(Ложь, Параметры.ЭтоОстаток);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СделаноИзМатериалаЗаказчика(Команда)
	Если Объект.Материалы.Количество() > 0 Тогда
		ВремПарам = Новый Структура("ЭтоОстаток",Ложь);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаменеПолотен",ЭтаФорма, ВремПарам) ,"Заменить полотна на ""Материал заказчика""? При нажатии ""Нет"" будет добавлена строка.", РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ДобавитьОстатокВМатериалы(Ложь, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОстаткиПленки(Команда)
	
	Если Объект.Материалы.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаменеПолотенНаОстатокПоштучно",ЭтаФорма) ,"Заменить полотна на ""Остаток""?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ВызватьДиалогПодбораОстатков(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗаменеПолотенНаОстатокПоштучно(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
        ВызватьДиалогПодбораОстатков(Истина);
	Иначе
		ВызватьДиалогПодбораОстатков(Ложь);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ВызватьДиалогПодбораОстатков(ЗаменитьПолотнаВДокументе)
	
	ПараметрРежимПодбора = 1;
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	ПараметрыПодбора.Вставить("Склад",					Объект.СкладМатериалов);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыОстаткиПленки());
	ПараметрыПодбора.Вставить("ТолькоВНаличии",			Истина);
	ПараметрыПодбора.Вставить("НеЗапрашиватьЦену",		Истина);
	ПараметрыПодбора.Вставить("ВАльтернативнойЕдиницеИзмерения",		Истина);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборОстатковНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборОстатковНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПодборОстатковНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	ВременнаяТаблица = Новый ТаблицаЗначений;
	ВременнаяТаблица.Колонки.Добавить("Номенклатура");
	ВременнаяТаблица.Колонки.Добавить("Количество");
	ВременнаяТаблица.Колонки.Добавить("ЕдиницаИзмерения");
	ВременнаяТаблица.Колонки.Добавить("Коэффициент");
	ВременнаяТаблица.Колонки.Добавить("Цена");
	ВременнаяТаблица.Колонки.Добавить("Сумма");
	ВременнаяТаблица.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ВременнаяТаблица.Колонки.Добавить("Фактура");
	ВременнаяТаблица.Колонки.Добавить("Цвет");
	ВременнаяТаблица.Колонки.Добавить("НоменклатураКЗамене", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	Для Каждого ТекСтрока Из ТаблицаТоваров Цикл
		НоваяСтрока = ВременнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;	
	
	Для Каждого ТекМатериал Из Объект.Материалы Цикл
		Если ТекМатериал.Номенклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Полотно") Тогда
			Для Каждого ТекОстаток Из ВременнаяТаблица Цикл
				Если ТекОстаток.НоменклатураКЗамене.Пустая() Тогда
					ТекОстаток.НоменклатураКЗамене = ТекМатериал.Номенклатура;					
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока из ВременнаяТаблица Цикл
		Если ТекущаяСтрока.НоменклатураКЗамене.Пустая() Тогда
			НоваяСтрока = Объект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		Иначе
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", ТекущаяСтрока.НоменклатураКЗамене);
			НайденныеСтроки = Объект.Материалы.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], ТекущаяСтрока);
				НайденныеСтроки[0].ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				НайденныеСтроки[0].СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокВидовНоменклатурыОстаткиПленки()
	
	Список = Новый СписокЗначений;
	Список.Добавить(Справочники.ВидыНоменклатуры.ОстатокПленки);
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ЗаменитьМатериал(Команда)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,,,,, новый ОписаниеОповещения("ПослеВыбораНоменклатурыЗаменитьМатериал", ЭтотОбъект, новый Структура("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор())));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНоменклатурыЗаменитьМатериал(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаменитьМатериалНаСервере(ВыбранноеЗначение, ДопПараметры.ИдентификаторСтроки);
	МатериалыНоменклатураПриИзменении(Неопределено);
	
КонецПроцедуры	

&НаСервере
Процедура ЗаменитьМатериалНаСервере(НовыйМатериал, ИдентификаторСтроки)
	
	ТекущаяСтрока = Объект.Материалы.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	//++ №8266 при изменении номенклатуры пленки, если ширина предыдущей и текущей разные, то очищаем колонку "Количество"
	ПроверитьШиринуПолотнаНоменклатурыИОчиститьКоличествоПриРазличии(ТекущаяСтрока.Количество, НовыйМатериал, ТекущаяСтрока.Номенклатура);
	//-- №8266
	
	ТекущаяСтрока.Номенклатура = НовыйМатериал;
		
	Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
		ТекущаяСтрока.Количество = ТекущаяСтрока.Номенклатура.Потолок_КоличествоПродукция;
	КонецЕсли;
	
КонецПроцедуры

//++ №8266 при изменении номенклатуры пленки, если ширина предыдущей и текущей разные, то очищаем колонку "Количество"
&НаСервере
Процедура ПроверитьШиринуПолотнаНоменклатурыИОчиститьКоличествоПриРазличии(Количество, НовыйМатериал, ПредыдущийМатериал)
	
	Если Константы.ПриЗаменеПленкиВВыпускеПродукцииНаПленкуДругойШириныОчищатьКоличествоКСписанию.Получить() 
		И НовыйМатериал.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно
		И ПредыдущийМатериал.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно
		И НЕ ПредыдущийМатериал.ШиринаПолотна = НовыйМатериал.ШиринаПолотна
	Тогда	
		
		Количество = 0;
	
	КонецЕсли;
	
КонецПроцедуры	
//-- №8266

&НаКлиенте
Процедура СпособНачисленияВыработкиПриИзменении(Элемент)
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаТиповаяПродукция 
		или Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаПродукция Тогда
		Элементы.ГруппаИнформацияПоПотолку.Видимость = Ложь;
	Иначе
		Элементы.ГруппаИнформацияПоПотолку.Видимость = Истина;
	КонецЕсли;
	
	Если НЕ ТекущаяСтраница.Имя = "ТаблицаФайлы" Тогда
		Элементы.Предпросмотр.Вид = ВидПоляФормы.ПолеКартинки;
	КонецЕсли;
	
КонецПроцедуры

//++ №9892
&НаКлиенте
Процедура ОбновитьИнформациюПоПотолку()
	
	ИнформацияПоПотолку.Очистить();
	
	Если Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка") И ЗначениеЗаполнено(Объект.ПродукцияНоменклатура) Тогда
		
		// Потолок
		НоваяСтрока = ИнформацияПоПотолку.Добавить();
		НоваяСтрока.НомерРасчета = Объект.ПродукцияНомерРасчета;
		НоваяСтрока.Номенклатура = Объект.ПродукцияНоменклатура;
		НоваяСтрока.Количество = Объект.ПродукцияНоменклатураКоличество;
		НоваяСтрока.ЕдиницаИзмерения = Объект.ПродукцияНоменклатураЕдиницаИзмерения;
		
	ИначеЕсли Объект.Продукция.Количество() > 0 Тогда
		
		// Типовое производство
		НоваяСтрока = ИнформацияПоПотолку.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Объект.Продукция[0]);
		НоваяСтрока.НомерРасчета = ПолучитьНомерРасчетаПродукции(НоваяСтрока.Номенклатура);
		
	КонецЕсли;
		
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерРасчетаПродукции(Номенклатура)
	
	Возврат Номенклатура.Потолок_НомерРасчета;
	
КонецФункции

&НаКлиенте
Процедура ПродукцияНоменклатураКоличествоПриИзменении(Элемент)
	
	ОбновитьИнформациюПоПотолку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНомерРасчетаПриИзменении(Элемент)
	
	ОбновитьИнформациюПоПотолку();
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПотолокВТабличнойЧасти()
	
	Потолок.Очистить();
	
	Если Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка") Тогда
		
		// Потолок
		НоваяСтрока = Потолок.Добавить();
		НоваяСтрока.НомерСтроки = 1;
		НоваяСтрока.НомерРасчета = Объект.ПродукцияНомерРасчета;
		НоваяСтрока.Номенклатура = Объект.ПродукцияНоменклатура;
		НоваяСтрока.Количество = Объект.ПродукцияНоменклатураКоличество;
		НоваяСтрока.ЕдиницаИзмерения = Объект.ПродукцияНоменклатураЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = Объект.ПродукцияНоменклатураКоэффициент;
		
	КонецЕсли;
		
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиПотолокИзТабличнойЧасти(ТекущиеДанные)
	
	Объект.ПродукцияНомерРасчета = ТекущиеДанные.НомерРасчета;
	Объект.ПродукцияНоменклатура = ТекущиеДанные.Номенклатура;
	Объект.ПродукцияНоменклатураКоличество = ТекущиеДанные.Количество;
	Объект.ПродукцияНоменклатураЕдиницаИзмерения = ТекущиеДанные.ЕдиницаИзмерения;
	Объект.ПродукцияНоменклатураКоэффициент = ТекущиеДанные.Коэффициент;
	
КонецПроцедуры

//-- №9892
