#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		Валюта 		= ДанныеЗаполнения.Валюта;
		ВидЦеныПоставщика = ДанныеЗаполнения.ВидЦеныПоставщика;
		Контрагент 	= ДанныеЗаполнения.Контрагент;
		Основание 	= ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Товары.Количество() = 0 Тогда 
		Сообщить ("Таблица товаров пустая");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЦеныПоставщиков
	Движения.ЦеныПоставщиков.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ЦеныПоставщиков.Добавить();
		Движение.Период 			= Дата;
		Движение.Валюта 			= Валюта;
		Движение.Поставщик 			= Контрагент;
		Движение.ВидЦеныПоставщика 	= ВидЦеныПоставщика;
		Движение.Номенклатура 		= ТекСтрокаТовары.Номенклатура;
		Движение.ХарактеристикаНоменклатуры 		= ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		Движение.ЕдиницаИзмерения 	= ТекСтрокаТовары.ЕдиницаИзмерения;
		Движение.Цена 				= ТекСтрокаТовары.Цена;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли