
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого ЭлементМассива из Параметры.МассивСсылок Цикл
		НоваяСтрока = ТаблицаДокументов.Добавить();
		НоваяСтрока.ДокументСсылка = ЭлементМассива;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(Элементы.ТаблицаДокументов.ТекущиеДанные.ДокументСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокумент(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаДокументов.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда	
		Закрыть(Элементы.ТаблицаДокументов.ТекущиеДанные.ДокументСсылка);
	Иначе
		Сообщить("Не выбран документ");
	КонецЕсли;
	
КонецПроцедуры

