&НаКлиенте
Перем мНоменклатура, мХарактеристика, мКоличество;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КодФормы = "ФормаПодбораНоменклатуры";
	УстановитьЗначенияПоНастройкамФормы();
	
	Организация = Параметры.Организация;
	ОрганизацияЦены = Параметры.Организация;
	Склад = Параметры.Склад;
	//ВидЦены = Параметры.ВидЦены;	
	
	//#15122
	ДатаЦен = КонецДня(ТекущаяДатаСеанса());
	Если Параметры.Свойство("Дата") И ЗначениеЗаполнено(Параметры.Дата) Тогда
		ДатаЦен = КонецДня(Параметры.Дата);
	КонецЕсли;
	
	ВидЦены = Параметры.ВидЦены;
	Если ВидЦены.Пустая() Тогда
		ВидЦены = ПолучитьОсновнойТипЦенПродажи();
	КонецЕсли;
	
	ВидЦеныПоставщика = Параметры.ВидЦеныПоставщика;
	Если ВидЦеныПоставщика.Пустая() Тогда
		ВидЦеныПоставщика = Справочники.ВидыЦенПоставщиков.ПустаяСсылка();
	КонецЕсли;
	
	Валюта = Параметры.Валюта;
	Если Валюта.Пустая() Тогда
		Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	
	Подразделение = Параметры.Подразделение;
	
	Поставщик = Параметры.Поставщик;
	ИспользоватьЦеныПоставщиков = Параметры.ИспользоватьЦеныПоставщиков;
	
	Если Константы.ОбщиеСклады.Получить() Тогда
		Организация = Неопределено;
		Элементы.Организация.Доступность = Ложь;
	КонецЕсли;
	
	// определяется настройкой пользователя или параметром вызова формы	
	Если НЕ ТолькоВНаличии Тогда // если выше не было получено значение из настроек пользователя
		ТолькоВНаличии = Параметры.ТолькоВНаличии; //#12555
	КонецЕсли;
	ТолькоВНаличииПриИзмененииНаСервере();
	
	МассивВидовНоменклатур = новый Массив;
	ОтборПоВидуНоменклатуры = Ложь;
	Если ТипЗнч(Параметры.ВидНоменклатуры) = Тип("СписокЗначений") Тогда
		Если Параметры.ВидНоменклатуры.Количество() > 0 Тогда
			ОтборПоВидуНоменклатуры = Истина;
			МассивВидовНоменклатур = Параметры.ВидНоменклатуры.ВыгрузитьЗначения();
		КонецЕсли;
	КонецЕсли;
	Элементы.ДекорацияОтборПоВидамНоменклатуры.Видимость = ОтборПоВидуНоменклатуры;
	Элементы.ДекорацияОтборПоВидамНоменклатуры.Заголовок = "Отбор по видам номенклатуры: " + СтрСоединить(МассивВидовНоменклатур, ",");	
	
	Контрагент = Параметры.Контрагент;
	ДоговорКонтрагента = Параметры.ДоговорКонтрагента;
		
	ВАльтернативнойЕдиницеИзмерения = Параметры.ВАльтернативнойЕдиницеИзмерения;
	Элементы.ДекорацияОстаткиВАльтернативнойЕдиницеИзмерения.Видимость = ВАльтернативнойЕдиницеИзмерения;
	
	УстановитьЗначенияПараметровСпискаНоменклатуры(СписокНоменклатуры, МассивВидовНоменклатур);
	УстановитьЗначенияПараметровСпискаНоменклатуры(СписокАналогов, МассивВидовНоменклатур);
	
		
	УстановитьЗначенияПараметровСпискаХарактеристик(СписокХарактеристик);
	УстановитьЗначенияПараметровСпискаХарактеристик(СписокХарактеристикАналогов);
	
	//++ №12232 не даем выбрать "Типовой отрез"
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокНоменклатуры
		, "ВидНоменклатуры"
		, Справочники.ВидыНоменклатуры.ТиповойОтрез
		, ВидСравненияКомпоновкиДанных.НеРавно
		,
		, Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокАналогов
		, "ВидНоменклатуры"
		, Справочники.ВидыНоменклатуры.ТиповойОтрез
		, ВидСравненияКомпоновкиДанных.НеРавно
		,
		, Истина);
	//-- №12232

	Элементы.СписокНоменклатурыЦена.Заголовок = "Цена, " + Валюта.Наименование;
	
	ЗапрашиватьЦену = НЕ Параметры.НеЗапрашиватьЦену;
	ЗапрашиватьКоличество = НЕ Параметры.НеЗапрашиватьКоличество;
	ЗапретРедактированияЦен = Параметры.ЗапретРедактированияЦен;
	
	ПодборТиповых = Параметры.ПодборТиповых;
	
	Параметры.Свойство("ТипДокумента", ТипДокумента);
	
	Если Параметры.Свойство("ТипДокумента") И Параметры.Свойство("Назначение") Тогда
		
		Если Параметры.ТипДокумента = "ЗаказДоговор"
			И Параметры.Назначение = "Товары"
			И ПолучитьФункциональнуюОпцию("ОграничитьВыборТоваровВЗаказДоговор")
		Тогда
					
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьОтбор(1, СписокНоменклатуры, "НоменклатураСсылка");	
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьОтбор(1, СписокАналогов, "НоменклатураСсылка");
			
			////++ №11160
			//Если ПолучитьФункциональнуюОпцию("ВариантОтображенияСпискаТоваровПриОграниченииВЗаказДоговоре") = Перечисления.ВариантОтображенияСпискаПриОграничении.ВВидеСпискаБезИерархии Тогда
			//	ВыводитьСписокБезИерархии = Истина;
			//КонецЕсли;
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьУсловноеОформлениеНедоступныеГруппы(1, СписокНоменклатуры, "НоменклатураСсылка");
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьУсловноеОформлениеНедоступныеГруппы(1, СписокАналогов, "НоменклатураСсылка");
			////-- №11160
			
		ИначеЕсли (Параметры.ТипДокумента = "ЗаказДоговор"
				Или Параметры.ТипДокумента = "Монтаж") // №11160
			И Параметры.Назначение = "Материалы"
			И ПолучитьФункциональнуюОпцию("ОграничитьВыборМатериаловВЗаказДоговор")
		Тогда
				
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьОтбор(2, СписокНоменклатуры, "НоменклатураСсылка");
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьОтбор(2, СписокАналогов, "НоменклатураСсылка");
			
			//++ №11160
			//Если ПолучитьФункциональнуюОпцию("ВариантОтображенияСпискаМатериаловПриОграниченииВЗаказДоговоре") = Перечисления.ВариантОтображенияСпискаПриОграничении.ВВидеСпискаБезИерархии Тогда
			//	
			//	ВыводитьСписокБезИерархии = Истина;
			//	
			//ИначеЕсли ПолучитьФункциональнуюОпцию("ВариантОтображенияСпискаМатериаловПриОграниченииВЗаказДоговоре") = Перечисления.ВариантОтображенияСпискаПриОграничении.ИерархияТолькоДоступныхПапок Тогда
			//	
			//	
			//	РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьУсловноеОформлениеНедоступныеГруппы(2, Список);
			//	
			//КонецЕсли;
			
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьУсловноеОформлениеНедоступныеГруппы(2, СписокНоменклатуры, "НоменклатураСсылка");
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьУсловноеОформлениеНедоступныеГруппы(2, СписокАналогов, "НоменклатураСсылка");
			
			//-- №11160
				
		КонецЕсли;
			
	КонецЕсли;
	
	//#2792
	ВидДокументаПроверкиКратности = Параметры.ВидДокументаПроверкиКратности;
	
	Элементы.ПоказыватьАналоги.Пометка = ПоказыватьАналоги;
	Элементы.ГруппаАналоги.Видимость = ПоказыватьАналоги;
	
	Элементы.ВыбраннаяНоменклатураЦена.ТолькоПросмотр  = ЗапретРедактированияЦен;
	Элементы.ВыбраннаяНоменклатураСумма.ТолькоПросмотр = ЗапретРедактированияЦен;
	
	// №6193
	ИспользуетсяРезервирование = Константы.ИспользоватьРезервирование.Получить();
	
	//++ №6744
	УстановитьОтборАрхивнаяНоменклатура(ЭтотОбъект);
	УстановитьОтборАрхивнаяХарактеристика(ЭтотОбъект);
	//-- №6744
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ВыбраннаяНоменклатураСтатьяДоходов");
	МассивЭлементов.Добавить("ВыбраннаяНоменклатураСтатьяРасходов");
	ФинансыСервер.УстановитьВидимостьКолонокСтатейДиРВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
	// №14840
	Параметры.Свойство("ПредлагатьСопутствующиеТоварыПриПодборе", ПредлагатьСопутствующиеТоварыПриПодборе);
	
	//#16835 
	Если ТипДокумента = "ЗаказДоговор" ИЛИ ТипДокумента = "ПредварительныйРасчет" Тогда
		ПодборВРозницу = Истина;
		ИспользуетсяПодборСТ = Истина;
		СтруктураДействийПоСТ = СопутствующиеТоварыСервер.СтруктураДействийПоСопутствующимТоварамВРознице();	
	КонецЕсли;
	//nva+++
	НачалоПериода = ДобавитьМесяц(НачалоДня(ТекущаяДата())-60*60*24,- 3);
	КонецПериода = КонецДня(ТекущаяДата()) - 60*60*24;
	НачалоПериодаПоследнийМесяц = НачалоМесяца(КонецПериода);
	НачалоПериодаПоследнийМесяц_1 = ДобавитьМесяц(НачалоПериодаПоследнийМесяц,-1);
	НачалоПериодаПоследнийМесяц_2 = ДобавитьМесяц(НачалоПериодаПоследнийМесяц_1,-1);
	НачалоПериодаПоследнийМесяц_3 = ДобавитьМесяц(НачалоПериодаПоследнийМесяц_2,-1);
	ГоризонтПланирования = КонецДня(ДобавитьМесяц(ТекущаяДата(),1));
	//nva---
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПараметрыЗапроса();
	ОбновитьЭлементыФормы();
	
	ОбновитьВидимостьГруппыПредпросмотрИзображения(); // №9160
	
	//++ №11160
	Если ВыводитьСписокБезИерархии Тогда
		
		Элементы.СписокНоменклатуры.Отображение = ОтображениеТаблицы.Список;
		Элементы.СписокНоменклатурыРежимПросмотра.Видимость = Ложь;
		Элементы.СписокНоменклатурыКонтекстноеМенюРежимПросмотра.Видимость = Ложь;
		Элементы.СписокНоменклатурыИерархическийСписок.Видимость = Ложь;
		Элементы.СписокНоменклатурыСписок.Видимость = Ложь;
		Элементы.СписокАналоговКонтекстноеМенюРежимПросмотра.Видимость = Ложь;
		
	КонецЕсли;
	//-- №11160
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	СохранитьНастройкиФормыНаСервере();
	Если ПеренестиВДокумент И НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		АдресВХранилище = ЗаписатьПодборВХранилище(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	Иначе
		АдресВХранилище = Неопределено;
	КонецЕсли;
	
	Если АдресВХранилище <> Неопределено Тогда
		Структура = Новый Структура("АдресВХранилище", АдресВХранилище);
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// №14840
	Если ИсточникВыбора.ИмяФормы = "РегистрСведений.СопутствующиеТоварыИУслуги.Форма.ФормаПодбора" Тогда
		ОбработкаПодбораСопутствующихТоваров(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти 

#Область ОбработчикиЭлементовФормы
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьПараметрыЗапроса()
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбновитьПараметрыЗапроса()
КонецПроцедуры

&НаКлиенте
Процедура ТолькоВНаличииПриИзменении(Элемент)
	
	ТолькоВНаличииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТолькоВНаличииПриИзмененииНаСервере()
	
	// Для списка номенклатуры
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТолькоВНаличии", ТолькоВНаличии);
		
	// Для списка характеристик	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокХарактеристик.Отбор,
		"Количество", 0, ВидСравненияКомпоновкиДанных.Больше,,ТолькоВНаличии);
		
	// Для списка аналогов номенклатуры
	СписокАналогов.Параметры.УстановитьЗначениеПараметра("ТолькоВНаличии", ТолькоВНаличии);
	
	// Для списка характеристик	аналогов
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокХарактеристикАналогов.Отбор,
		"Количество", 0, ВидСравненияКомпоновкиДанных.Больше,,ТолькоВНаличии);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВКорзину(Команда)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	Если ЭтоГруппа(ТекущиеДанные.НоменклатураСсылка) Тогда
		Возврат;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
		
	ДобавитьНоменклатуруВКорзину(ТекущиеДанные);
		
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
		
	ПеренестиВДокумент = Истина;
	Закрыть(ВыбраннаяНоменклатура);  //Закрыть(КодВозвратаДиалога.OK); если будет убрано модальной открытие 
	
КонецПроцедуры

&НаКлиенте
Процедура НавигацияСписковНоменклатураХарактеристики(Команда)
	Если Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаНоменклатура Тогда		
		ДанныеТекущейСтроки = Элементы.СписокНоменклатуры.ТекущиеДанные;
		Если НЕ ДанныеТекущейСтроки = Неопределено Тогда
			Если ДанныеТекущейСтроки.ИмеютсяХарактеристики Тогда		
				ПерейтиКСпискуХарактеристикНоменклатуры(ДанныеТекущейСтроки.НоменклатураСсылка);			
			КонецЕсли;	
		КонецЕсли;	
	Иначе		
		ПерейтиКСпискуНоменклатуры();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКСпискуНоменклатуры(Команда)
	ПерейтиКСпискуНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКСпискуАналогов(Команда)
	Элементы.СтраницыАналогов.ТекущаяСтраница = Элементы.СтраницаАналогиНоменклатура;
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьАналоги(Команда)
	
	ПоказыватьАналоги = НЕ ПоказыватьАналоги;
	Элементы.ПоказыватьАналоги.Пометка = ПоказыватьАналоги;
	Элементы.ГруппаАналоги.Видимость = ПоказыватьАналоги;
	
	ПодключитьОбработчикОжидания("ПодборТаблицаПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НастройкиФормыПодбора()
	
	НастройкиФормы = Новый Структура;	
	НастройкиФормы.Вставить("ПоказыватьАналоги", ПоказыватьАналоги);
	НастройкиФормы.Вставить("ТолькоВНаличии", ТолькоВНаличии); // #14376
	
	Возврат НастройкиФормы;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначенияПоНастройкамФормы();
	// Если есть сохраненные настройки, то установить значения по настройкам.
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КодФормы,  "");
	
	Если Настройки <> Неопределено Тогда
		
		Если Настройки.Свойство("ПоказыватьАналоги") Тогда
			ПоказыватьАналоги = Настройки.ПоказыватьАналоги;
		КонецЕсли;
		
		// #14376
		Если Настройки.Свойство("ТолькоВНаличии") Тогда
			ТолькоВНаличии = Настройки.ТолькоВНаличии;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормыНаСервере()
	
	НастройкиФормы = НастройкиФормыПодбора();
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КодФормы, "", НастройкиФормы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПараметровСпискаНоменклатуры(ДинамическийСписок, МассивВидовНоменклатур)
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ОтборПоВидуНоменклатуры", ОтборПоВидуНоменклатуры);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ВидыНоменклатуры", МассивВидовНоменклатур);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ТолькоВНаличии", ТолькоВНаличии);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ВАльтернативнойЕдиницеИзмерения", ВАльтернативнойЕдиницеИзмерения);
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ДатаЦен", ДатаЦен); // #15122
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ВидЦены", ВидЦены);	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Валюта", Валюта);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Поставщик", Поставщик);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ВидЦеныПоставщика", ВидЦеныПоставщика);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ИспользуютсяОбщиеСклады", Константы.ОбщиеСклады.Получить());
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ИспользоватьИндивидуальныеЦены", ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены"));
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Если ДинамическийСписок = СписокАналогов Тогда
		ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("НоменклатураРодительАналога", Справочники.Номенклатура.ПустаяСсылка());	
	КонецЕсли;
	
	// №6193
	Если НЕ ДинамическийСписок = СписокАналогов Тогда
		ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ИспользоватьРезервирование", Константы.ИспользоватьРезервирование.Получить());
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПараметровСпискаХарактеристик(ДинамическийСписок)
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ДатаЦен", ДатаЦен); // #15122
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ВидЦены", ВидЦены);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ВидЦеныПоставщика", ВидЦеныПоставщика);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Валюта", Валюта);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Поставщик", Поставщик);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ИспользуютсяОбщиеСклады", Константы.ОбщиеСклады.Получить());
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ИспользоватьИндивидуальныеЦены", ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены"));
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ДоговорКонтрагента", ДоговорКонтрагента);
	
	// №6193
	Если НЕ ДинамическийСписок = СписокХарактеристикАналогов Тогда
		ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ИспользоватьРезервирование", Константы.ИспользоватьРезервирование.Получить());
		ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ВАльтернативнойЕдиницеИзмерения", ВАльтернативнойЕдиницеИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыЗапроса()
	
	//++ №11422
	ОтборПоСкладу = ЗначениеЗаполнено(Склад);
	ОтборПоОрганизации = ЗначениеЗаполнено(Организация);
	//-- №11422
	
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	
	//++ №11422
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ОтборПоСкладу", ОтборПоСкладу);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ОтборПоОрганизации", ОтборПоОрганизации);
	//-- №11422
	
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	
	//++ №11422
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("ОтборПоСкладу", ОтборПоСкладу);
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("ОтборПоОрганизации", ОтборПоОрганизации);
	//-- №11422
	
	СписокАналогов.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	СписокАналогов.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	
	//++ №11422
	СписокАналогов.Параметры.УстановитьЗначениеПараметра("ОтборПоСкладу", ОтборПоСкладу);
	СписокАналогов.Параметры.УстановитьЗначениеПараметра("ОтборПоОрганизации", ОтборПоОрганизации);
	//-- №11422
	
	СписокХарактеристикАналогов.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	СписокХарактеристикАналогов.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	
	//++ №11422
	СписокХарактеристикАналогов.Параметры.УстановитьЗначениеПараметра("ОтборПоСкладу", ОтборПоСкладу);
	СписокХарактеристикАналогов.Параметры.УстановитьЗначениеПараметра("ОтборПоОрганизации", ОтборПоОрганизации);
	//-- №11422
	
	//nva+++
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ИспользоватьПланирование", ИспользоватьПланирование);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("НачалоПериода", НачалоПериода); 
	НачалоПериодаПоследнийМесяц = НачалоМесяца(КонецПериода);        
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("НачалоПериодаПоследнийМесяц", НачалоПериодаПоследнийМесяц); 
	НачалоПериодаПоследнийМесяц_1 = ДобавитьМесяц(НачалоПериодаПоследнийМесяц,-1);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("НачалоПериодаПоследнийМесяц_1", НачалоПериодаПоследнийМесяц_1);
	НачалоПериодаПоследнийМесяц_2 = ДобавитьМесяц(НачалоПериодаПоследнийМесяц_1,-1);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("НачалоПериодаПоследнийМесяц_2", НачалоПериодаПоследнийМесяц_2);
	НачалоПериодаПоследнийМесяц_3 = ДобавитьМесяц(НачалоПериодаПоследнийМесяц_2,-1);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("НачалоПериодаПоследнийМесяц_3", НачалоПериодаПоследнийМесяц_3);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("КонецПериода", КонецДня(КонецПериода));
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ГоризонтПланирования", ГоризонтПланирования);
	//nva---
	
	Элементы.СписокНоменклатуры.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	Если ПодборТиповых Тогда		
		Элементы.СписокНоменклатурыЦена.Видимость 			= Ложь;
		Элементы.СписокНоменклатурыЦенаПоставщика.Видимость = Ложь;
		Элементы.СписокАналоговЦена.Видимость 				= Ложь;
		Элементы.СписокАналоговЦенаПоставщика.Видимость 	= Ложь;
		
		Элементы.ВыбраннаяНоменклатураКоличество.Заголовок  = "Длина";		
		Элементы.ВыбраннаяНоменклатураЦена.Видимость 		= Ложь;
		Элементы.ВыбраннаяНоменклатураКоэффициент.Видимость = Ложь;
		Элементы.ВыбраннаяНоменклатураСумма.Видимость 	 	= Ложь;
		Элементы.ВыбраннаяНоменклатураХарактеристика.Видимость = Ложь;
		Элементы.ВыбраннаяНоменклатураЕдиницаИзмерения.Видимость = Ложь;
		Элементы.НавигацияСписковНоменклатураХарактеристики.Видимость = Ложь;
	Иначе		
		Элементы.ВыбраннаяНоменклатураКоличество.Заголовок  = "Количество";	
		
		//Элементы.СписокНоменклатурыКоличество.Видимость 	= ЗапрашиватьКоличество;
		Элементы.СписокНоменклатурыЦена.Видимость 			= ЗапрашиватьЦену И НЕ ИспользоватьЦеныПоставщиков;
		//Элементы.СписокАналоговКоличество.Видимость 		= ЗапрашиватьКоличество;
		Элементы.СписокАналоговЦена.Видимость 				= ЗапрашиватьЦену И НЕ ИспользоватьЦеныПоставщиков;
		
		Элементы.ВыбраннаяНоменклатураКоличество.Видимость  = ЗапрашиватьКоличество;
		Элементы.ВыбраннаяНоменклатураЦена.Видимость 		= ЗапрашиватьЦену;
		Элементы.ВыбраннаяНоменклатураКоэффициент.Видимость = ЗапрашиватьЦену;
		Элементы.ВыбраннаяНоменклатураСумма.Видимость 	 	= ЗапрашиватьЦену;
		Элементы.ВыбраннаяНоменклатураФактура.Видимость  	= Ложь;
		Элементы.ВыбраннаяНоменклатураЦвет.Видимость 	 	= Ложь;
		Элементы.СписокНоменклатурыЦенаПоставщика.Видимость = ЗапрашиватьЦену И ИспользоватьЦеныПоставщиков;
		Элементы.СписокАналоговЦенаПоставщика.Видимость 	= ЗапрашиватьЦену И ИспользоватьЦеныПоставщиков;
		
		Элементы.СписокХарактеристикЦена.Видимость 			= ЗапрашиватьЦену;
		Элементы.СписокХарактеристикЦенаПоставщика.Видимость = ЗапрашиватьЦену И ИспользоватьЦеныПоставщиков;
		Элементы.СписокХарактеристикАналоговЦена.Видимость 			= ЗапрашиватьЦену;
		Элементы.СписокХарактеристикАналоговЦенаПоставщика.Видимость = ЗапрашиватьЦену И ИспользоватьЦеныПоставщиков;
		
		// №6193
		Элементы.СписокНоменклатурыКоличествоВРезерве.Видимость	 = ЗапрашиватьКоличество И ИспользуетсяРезервирование;
		Элементы.СписокНоменклатурыКоличествоДоступно.Видимость	 = ЗапрашиватьКоличество И ИспользуетсяРезервирование;
		//Элементы.СписокХарактеристикКоличество.Видимость 	     = ЗапрашиватьКоличество И ИспользуетсяРезервирование;
		Элементы.СписокХарактеристикКоличествоВРезерве.Видимость = ЗапрашиватьКоличество И ИспользуетсяРезервирование;
		Элементы.СписокХарактеристикКоличествоДоступно.Видимость = ЗапрашиватьКоличество И ИспользуетсяРезервирование;
		
		//nva+++
		Элементы.ОжидаемыйРасходКГоризонтуПланирования.Видимость =  ИспользоватьПланирование; 
		Элементы.ГруппаДатыПланирования.Видимость =  ИспользоватьПланирование; 
		Элементы.ОжидаемыйОстаток.Видимость =  ИспользоватьПланирование;
		Если ИспользоватьПланирование Тогда
			//переименовываем колонки по названиям месяцев в периоде
			ДатаМесяц = НачалоМесяца(КонецПериода);
			А = 0;
			Пока А <= 3 Цикл 
				Элементы["РасходПоследнийМесяц_" + А].Видимость = ИспользоватьПланирование;
				Элементы["РасходПоследнийМесяц_" + А].Заголовок = Формат(ДатаМесяц, "ДФ='MMMM yy'");
				ДатаМесяц = ДобавитьМесяц(ДатаМесяц,-1); 
				А = А + 1;
			КонецЦикла;
		Иначе
			А = 0;
			Пока А <= 3 Цикл
				Элементы["РасходПоследнийМесяц_" + А].Видимость = ИспользоватьПланирование;
				А = А + 1;
			КонецЦикла;
		КонецЕсли;	
		//nva---
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Функция ПараметрыТовара() 
	
	ПараметрыТовара = Новый Структура();
	ПараметрыТовара.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	ПараметрыТовара.Вставить("ХарактеристикаНоменклатуры", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	ПараметрыТовара.Вставить("СХарактеристикой", Ложь);
	ПараметрыТовара.Вставить("ЕдиницаИзмерения");
	ПараметрыТовара.Вставить("Количество",0);
	ПараметрыТовара.Вставить("Коэффициент",1);
	ПараметрыТовара.Вставить("Цена",0);
	ПараметрыТовара.Вставить("Сумма",0);
	ПараметрыТовара.Вставить("Фактура", ПредопределенноеЗначение("Справочник.Фактура.ПустаяСсылка"));
	ПараметрыТовара.Вставить("Цвет", ПредопределенноеЗначение("Справочник.ЦветФактуры.ПустаяСсылка"));
	ПараметрыТовара.Вставить("СтатьяРасходов", ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ПустаяСсылка"));
	ПараметрыТовара.Вставить("СтатьяДоходов", ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ПустаяСсылка"));
	ПараметрыТовара.Вставить("ЭтоСопутствующийТовар", Ложь);
	
	Возврат ПараметрыТовара;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьНоменклатуруВКорзину(ТекущиеДанные, СХарактеристикой = Ложь)
	
	Если ЗапрашиватьКоличество ИЛИ ЗапрашиватьЦену Тогда 	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Номенклатура",			 ТекущиеДанные.НоменклатураСсылка); 
		
		//nva+++                      
		Если ИспользоватьПланирование Тогда
			Если ТекущиеДанные.ОжидаемыйОстаток < 0 Тогда
				ЗапрашиваемоеКоличество = (-1) * ТекущиеДанные.ОжидаемыйОстаток;
			Иначе
				ЗапрашиваемоеКоличество = ТекущиеДанные.ОжидаемыйОстаток;
			КонецЕсли;
			Кратность = ПолучитьКратностьЕдиницыИзмерения(ТекущиеДанные.НоменклатураСсылка, ТекущиеДанные.ЕдиницаИзмерения);
			Если Цел(ЗапрашиваемоеКоличество/Кратность) = ЗапрашиваемоеКоличество/Кратность И ЗапрашиваемоеКоличество <> 0 Тогда 
				ЗапрашиваемоеКоличество = Цел(ЗапрашиваемоеКоличество/Кратность) * Кратность
			Иначе
				ЗапрашиваемоеКоличество = (Цел(ЗапрашиваемоеКоличество/Кратность) + 1) * Кратность;
			КонецЕсли;	
		Иначе
			ЗапрашиваемоеКоличество = 1;
		КонецЕсли;
		//nva---
		ПараметрыФормы.Вставить("Количество",			 ЗапрашиваемоеКоличество);
		Если ЗапрашиватьЦену Тогда
			//nva+++
			ЦенаЗакупки = ПолучитьЦенуЗакупки(ТекущиеДанные);
			Если ЦенаЗакупки = 0 И ЗапрашиватьЦену И ИспользоватьЦеныПоставщиков Тогда
				ЦенаЗакупки = ТекущиеДанные.СписокНоменклатурыЦенаПоставщика;
			КонецЕсли;
			//nva---
			ПараметрыФормы.Вставить("Цена",					 ?(НЕ ИспользоватьЦеныПоставщиков, ТекущиеДанные.Цена, ЦенаЗакупки));//nva	ТекущиеДанные.ЦенаПоставщика		
		КонецЕсли;
		ПараметрыФормы.Вставить("ЗапрашиватьКоличество", ЗапрашиватьКоличество);
		ПараметрыФормы.Вставить("ЗапрашиватьЦену",		 ЗапрашиватьЦену И НЕ ЗапретРедактированияЦен);
		
		ПараметрыТовара = ПараметрыТовара();
		ЗаполнитьЗначенияСвойств(ПараметрыТовара, ТекущиеДанные);
		ПараметрыТовара.Номенклатура = ТекущиеДанные.НоменклатураСсылка;
		ПараметрыТовара.СХарактеристикой = СХарактеристикой;
		
		ОткрытьФорму(
			"ОбщаяФорма.ЗапросКоличестваИЦены", 
			ПараметрыФормы, 
			ЭтаФорма,
			,
			,
			,
			Новый ОписаниеОповещения("ДобавитьНоменклатуруВКорзинуПослеВыбораКоличества", ЭтотОбъект, ПараметрыТовара),
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		//ВозвращенноеЗначение = ОткрытьФормуМодально("ОбщаяФорма.ЗапросКоличестваИЦены",ПараметрыФормы);
		//
		//Если НЕ ВозвращенноеЗначение = Неопределено Тогда
		//	НоваяСтрока = ВыбраннаяНоменклатура.Добавить();
		//	НоваяСтрока.Номенклатура = ТекущиеДанные.НоменклатураСсылка;
		//	НоваяСтрока.Цена = ВозвращенноеЗначение.Цена;
		//	Если СХарактеристикой Тогда
		//		НоваяСтрока.ХарактеристикаНоменклатуры = ТекущиеДанные.ХарактеристикаНоменклатуры;	
		//	КонецЕсли;
		//	НоваяСтрока.Количество = ВозвращенноеЗначение.Количество;
		//	Если НЕ ВАльтернативнойЕдиницеИзмерения Тогда
		//		НоваяСтрока.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмерения(НоваяСтрока.Номенклатура);
		//		НоваяСтрока.Коэффициент = 1;
		//	Иначе
		//		НоваяСтрока.ЕдиницаИзмерения = ПолучитьАльтернативнуюЕдиницуИзмерения(НоваяСтрока.Номенклатура);
		//		НоваяСтрока.Коэффициент = ПолучитьКоэффициентАльтернативнойЕдиницыИзмерения(НоваяСтрока.Номенклатура);
		//	КонецЕсли;
		//	НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
		//КонецЕсли;
	Иначе
		НоваяСтрока = ПараметрыТовара(); //ВыбраннаяНоменклатура.Добавить();
		НоваяСтрока.Номенклатура = ТекущиеДанные.НоменклатураСсылка;
		Если СХарактеристикой Тогда
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекущиеДанные.ХарактеристикаНоменклатуры;	
		КонецЕсли;
		Если НЕ ВАльтернативнойЕдиницеИзмерения Тогда
			НоваяСтрока.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмерения(НоваяСтрока.Номенклатура);
		Иначе 
			НоваяСтрока.ЕдиницаИзмерения = ПолучитьАльтернативнуюЕдиницуИзмерения(НоваяСтрока.Номенклатура);
			НоваяСтрока.Коэффициент = ПолучитьКоэффициентАльтернативнойЕдиницыИзмерения(НоваяСтрока.Номенклатура);
		КонецЕсли;
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
		СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанные, "СтатьяДоходов, СтатьяРасходов");
		
		ДобавитьНоменклатуруВКорзинуЗавершение(НоваяСтрока);
	КонецЕсли;
	//СвернутьТаблицуВыбранныхНоменклатур();
	
КонецПроцедуры

//nva+++
Функция ПолучитьЦенуЗакупки(Данные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Закупки.Период КАК Период,
		|	Закупки.Номенклатура КАК Номенклатура,
		|	Закупки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Закупки.Контрагент КАК Контрагент,
		|	Закупки.Количество КАК Количество,
		|	Закупки.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА Закупки.Количество > 0
		|			ТОГДА ЕСТЬNULL(Закупки.Сумма, 0) / Закупки.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	РегистрНакопления.Закупки КАК Закупки
		|ГДЕ
		|	Закупки.Номенклатура = &Номенклатура
		|	И Закупки.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|	И Закупки.Контрагент = &Контрагент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Закупки.Период,
		|	Закупки.Номенклатура,
		|	Закупки.ХарактеристикаНоменклатуры,
		|	Закупки.Контрагент,
		|	Закупки.Количество,
		|	Закупки.Сумма,
		|	ВЫБОР
		|		КОГДА Закупки.Количество > 0
		|			ТОГДА ЕСТЬNULL(Закупки.Сумма, 0) / Закупки.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.Закупки КАК Закупки
		|ГДЕ
		|	Закупки.Номенклатура = &Номенклатура
		|	И Закупки.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 5
		|	ТоварыНаСкладах.Период,
		|	ТоварыНаСкладах.Номенклатура,
		|	ТоварыНаСкладах.ХарактеристикаНоменклатуры,
		|	"""",
		|	ТоварыНаСкладах.Количество,
		|	ТоварыНаСкладах.Сумма,
		|	ВЫБОР
		|		КОГДА ТоварыНаСкладах.Количество > 0
		|			ТОГДА ЕСТЬNULL(ТоварыНаСкладах.Сумма, 0) / ТоварыНаСкладах.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		|ГДЕ
		|	ТоварыНаСкладах.Номенклатура = &Номенклатура
		|	И ТоварыНаСкладах.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|	И ТИПЗНАЧЕНИЯ(ТоварыНаСкладах.Регистратор) = ТИП(Документ.ОприходованиеТоваров)
		|	И ВЫБОР
		|			КОГДА ТоварыНаСкладах.Количество > 0
		|				ТОГДА ЕСТЬNULL(ТоварыНаСкладах.Сумма, 0) / ТоварыНаСкладах.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка()); //поставщики могут быть разные, а не только те, которые выбраны в номенклатуре
	Запрос.УстановитьПараметр("Номенклатура", Данные.НоменклатураСсылка);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()); //Характеристики не учитываем
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции	
//nva---

&НаКлиенте
Процедура ДобавитьНоменклатуруВКорзинуПослеВыбораКоличества(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ПараметрыТовара();
	НоваяСтрока.Номенклатура = ДополнительныеПараметры.Номенклатура;
	НоваяСтрока.Цена = Результат.Цена;
	Если ДополнительныеПараметры.СХарактеристикой Тогда
		НоваяСтрока.ХарактеристикаНоменклатуры = ДополнительныеПараметры.ХарактеристикаНоменклатуры;	
	КонецЕсли;
	НоваяСтрока.Количество = Результат.Количество;
	Если НЕ ВАльтернативнойЕдиницеИзмерения Тогда
		НоваяСтрока.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмерения(НоваяСтрока.Номенклатура);
		НоваяСтрока.Коэффициент = 1;
	Иначе
		НоваяСтрока.ЕдиницаИзмерения = ПолучитьАльтернативнуюЕдиницуИзмерения(НоваяСтрока.Номенклатура);
		НоваяСтрока.Коэффициент = ПолучитьКоэффициентАльтернативнойЕдиницыИзмерения(НоваяСтрока.Номенклатура);
	КонецЕсли;
	НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
		
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанные, "СтатьяДоходов, СтатьяРасходов");
	
	ДобавитьНоменклатуруВКорзинуЗавершение(НоваяСтрока);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ДобавитьНоменклатуруВКорзинуЗавершение(ПараметрыТовара, СопутствующийТовар = Ложь)
	
	ОчиститьСообщения();
	
	НоваяСтрока = ВыбраннаяНоменклатура.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыТовара);	
	
	// #16835
	Если ПодборВРозницу Тогда
		НоваяСтрока.УИСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;

	СвернутьТаблицуВыбранныхНоменклатур();
	 
	//#2792
	Если ЗначениеЗаполнено(ВидДокументаПроверкиКратности) Тогда
		Для Индекс = 1 По ВыбраннаяНоменклатура.Количество() Цикл
			СтрокаТабличнойЧасти = ВыбраннаяНоменклатура[Индекс-1];
			СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, Индекс);
			ОтказВИзмененииКоличества = Ложь;
			КоличествоПриИзмененииНаСервере(СтруктураДанные, ОтказВИзмененииКоличества);
			Если ОтказВИзмененииКоличества Тогда
				СтрокаТабличнойЧасти.Количество = 0;
			КонецЕсли;
			СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
		КонецЦикла;
	КонецЕсли;
	
	// №14840
	Если ПредлагатьСопутствующиеТоварыПриПодборе И НЕ СопутствующийТовар Тогда
		
		ПараметрыПодбора = Новый Структура;
		ПараметрыПодбора.Вставить("Номенклатура",				НоваяСтрока.Номенклатура);
		ПараметрыПодбора.Вставить("ХарактеристикаНоменклатуры",	НоваяСтрока.ХарактеристикаНоменклатуры);
		ПараметрыПодбора.Вставить("Количество",					НоваяСтрока.Количество);
		ПараметрыПодбора.Вставить("СФормыПодбора",				Истина);
		
		ОткрытьФорму("РегистрСведений.СопутствующиеТоварыИУслуги.Форма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
		
	КонецЕсли;
	
	//++ #16835
	ДобавитьСопутствующиеТовары("Добавление", НоваяСтрока);	
	//-- #16835 
	
КонецПроцедуры

&НаСервере
Функция ЭтоГруппа(СсылкаНаЭлемент)
	Возврат СсылкаНаЭлемент.ЭтоГруппа;
КонецФункции

&НаКлиенте
Процедура ДобавитьОтрезВКорзину(ТекущиеДанные)
	
	НоваяСтрока = ВыбраннаяНоменклатура.Добавить();
	НоваяСтрока.Номенклатура = ТекущиеДанные.НоменклатураСсылка;
	ЗаполнитьФактуруИЦветПоНоменклатуре(НоваяСтрока.Цвет, НоваяСтрока.Фактура, НоваяСтрока.Номенклатура);
	НоваяСтрока.Количество = 1;
	
	//СвернутьТаблицуВыбранныхНоменклатур();
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьПодборВХранилище(УникальныйИдентификаторВладельца) 
		
	АдресВХранилище = Неопределено;	
	Если ПеренестиВДокумент Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(ВыбраннаяНоменклатура.Выгрузить(), УникальныйИдентификаторВладельца);	
	КонецЕсли;
	
	Возврат АдресВХранилище;
	
КонецФункции

&НаСервере
Функция ПолучитьБазовуюЕдиницуИзмерения(Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаСервере
Функция ПолучитьАльтернативнуюЕдиницуИзмерения(Номенклатура)
	Возврат Номенклатура.АльтернативнаяЕдиницаИзмерения;
КонецФункции

&НаСервере
Функция ПолучитьКоэффициентАльтернативнойЕдиницыИзмерения(Номенклатура)
	Возврат Номенклатура.АльтернативнаяЕдиницаИзмерения.Коэффициент;
КонецФункции

&НаСервере
Процедура СвернутьТаблицуВыбранныхНоменклатур()
	
	ВременнаяТаблица = Новый ТаблицаЗначений;
	ВременнаяТаблица.Колонки.Добавить("Номенклатура");
	ВременнаяТаблица.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ВременнаяТаблица.Колонки.Добавить("Фактура");
	ВременнаяТаблица.Колонки.Добавить("Цвет");
	ВременнаяТаблица.Колонки.Добавить("Количество");
	ВременнаяТаблица.Колонки.Добавить("ЕдиницаИзмерения");
	ВременнаяТаблица.Колонки.Добавить("Коэффициент");
	ВременнаяТаблица.Колонки.Добавить("Цена");
	ВременнаяТаблица.Колонки.Добавить("Сумма");
	ВременнаяТаблица.Колонки.Добавить("СтатьяДоходов");
	ВременнаяТаблица.Колонки.Добавить("СтатьяРасходов");
	ВременнаяТаблица.Колонки.Добавить("ЭтоСопутствующийТовар"); // №14840
	ВременнаяТаблица.Колонки.Добавить("УИСтроки", 			Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(36)));
	ВременнаяТаблица.Колонки.Добавить("УИСтрокиРодителя", 	Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(36)));
	
	Для Каждого ТекущаяСтрока Из ВыбраннаяНоменклатура Цикл
		НоваяСтрока = ВременнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	ВременнаяТаблица.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, Фактура, Цвет, ЕдиницаИзмерения, Коэффициент, 
							  |Цена, СтатьяДоходов, СтатьяРасходов, ЭтоСопутствующийТовар,
							  |УИСтроки, УИСтрокиРодителя",
							  "Количество, Сумма");
	
	ВыбраннаяНоменклатура.Очистить();
	
	Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
		НоваяСтрока = ВыбраннаяНоменклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновнойТипЦенПродажи()
	Возврат Справочники.ВидыЦен.ОсновнаяЦенаПродажи;
КонецФункции

&НаСервере
Процедура ЗаполнитьФактуруИЦветПоНоменклатуре(Цвет, Фактура, Номенклатура)
	
	Если Номенклатура.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦветФактуры.Ссылка,
	|	ЦветФактуры.Владелец
	|ИЗ
	|	Справочник.ЦветФактуры КАК ЦветФактуры
	|ГДЕ
	|	ЦветФактуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Цвет = Выборка.Ссылка;
		Фактура = Выборка.Владелец;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
Функция СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, НомерСтроки=-1)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",			"ВыбраннаяНоменклатура");
	СтруктураДанные.Вставить("ПредставлениеТаблицы","Выбранная номенклатура");
	СтруктураДанные.Вставить("ПолеДанныхПрефикс", 	"");
	СтруктураДанные.Вставить("НомерСтроки",			?(НЕ НомерСтроки=-1, НомерСтроки, ВыбраннаяНоменклатура.Индекс(СтрокаТабличнойЧасти)+1));
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 	СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 			СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 				ТекущаяДата());
	СтруктураДанные.Вставить("ВидЦен", 				ВидЦены);
	СтруктураДанные.Вставить("Валюта", 				Валюта);
	СтруктураДанные.Вставить("Организация",			Организация);
	//СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	СтруктураДанные.Вставить("Контрагент",			Контрагент);
	СтруктураДанные.Вставить("ДоговорКонтрагента", 	ДоговорКонтрагента);

	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("Цена", ПолучитьЦенуНоменклатуры(СтруктураДанные.Номенклатура, СтруктураДанные.ХарактеристикаНоменклатуры, СтруктураДанные.ЕдиницаИзмерения, СтруктураДанные.Количество));
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры = Неопределено, ЕдиницаИзмерения = Неопределено, Количество = 1)
													
	Возврат ЦеныКомпании.ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество,
												ДатаЦен, ВидЦены, Валюта, 												 
												ОрганизацияЦены, Подразделение, 
												Контрагент, ДоговорКонтрагента);
												
КонецФункции

//++ №14840
&НаКлиенте
Процедура ОбработкаПодбораСопутствующихТоваров(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	МассивТоваров = ПолучитьСопутствующиеТоварыИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	Для Каждого ТекущаяСтрока из МассивТоваров Цикл
		
		НоваяСтрока = ПараметрыТовара();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
		СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанные, "СтатьяДоходов, СтатьяРасходов");
		
		НоваяСтрока.ЭтоСопутствующийТовар = Истина;
		
		ДобавитьНоменклатуруВКорзинуЗавершение(НоваяСтрока, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСопутствующиеТоварыИзВременногоХранилища(АдресВХранилище)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		
		ТекущаяСтрока.Цена = РегистрыСведений.ЦеныНоменклатуры.ПолучитьЦенуНоменклатуры(
			ТекущаяСтрока.Номенклатура,
			ТекущаяСтрока.ХарактеристикаНоменклатуры,
			ТекущаяСтрока.ЕдиницаИзмерения,
			ТекущаяДатаСеанса(),
			ВидЦены,
			Валюта,
			Контрагент,
			ДоговорКонтрагента
		);
		
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
																		   
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	
КонецФункции
//-- №14840

#КонецОбласти

#Область ГруппаНоменклатура

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЭтоГруппа(ТекущиеДанные.НоменклатураСсылка) Тогда
		Возврат;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если ПодборТиповых Тогда
		ДобавитьОтрезВКорзину(ТекущиеДанные);
	Иначе	
		Если ТекущиеДанные.ИмеютсяХарактеристики Тогда
			ПерейтиКСпискуХарактеристикНоменклатуры(ТекущиеДанные.НоменклатураСсылка);
		Иначе
			ДобавитьНоменклатуруВКорзину(ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСпискуНоменклатуры()
	
	Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаНоменклатура;
	Элементы.НавигацияСписковНоменклатураХарактеристики.Заголовок = НСтр("ru ='Характеристики'");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСпискуХарактеристикНоменклатуры(НоменклатураСсылка, ПоАналогам = Ложь)
	
	ПолеОтбора = "НоменклатураСсылка";
	ЭлементОтбора = Неопределено;
	Список = ?(НЕ ПоАналогам, СписокХарактеристик, СписокХарактеристикАналогов);
	
	Для каждого ЭлементФиксОтбора Из Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы Цикл	
		Если ТипЗнч(ЭлементФиксОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ЭлементФиксОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеОтбора) Тогда
				ЭлементОтбора = ЭлементФиксОтбора;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элемент = ?(НЕ ЭлементОтбора = Неопределено, ЭлементОтбора, Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеОтбора);
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = НоменклатураСсылка;	
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Элемент.Использование = Истина;
	
	Если НЕ ПоАналогам Тогда
		Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаХарактеристики;
		Элементы.НавигацияСписковНоменклатураХарактеристики.Заголовок = НСтр("ru ='Номенклатура'");
	Иначе
		Элементы.СтраницыАналогов.ТекущаяСтраница = Элементы.СтраницаАналогиХарактеристики;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПодборТаблицаПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПодборТаблицаПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;

	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Если НЕ ТекущиеДанные.НоменклатураСсылка = ТекущаяНоменклатура Тогда
			
			ТекущаяНоменклатура = ТекущиеДанные.НоменклатураСсылка;
			
			Если ПоказыватьАналоги Тогда
				ВернутьсяКСпискуАналогов(Неопределено);
				УстановитьОтборПоАналогам(ТекущиеДанные.НоменклатураСсылка);
			КонецЕсли;
			
			//++ №9160
			Если ПоказыватьИзображенияНоменклатуры Тогда
				ПодключитьОбработчикОжидания("ОбработчикОжиданияФайлыПриАктивизацииСтроки", 0.1, Истина);
			КонецЕсли;	
			//-- №9160
			
		КонецЕсли;	
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриСменеТекущегоРодителя(Элемент)
	// фикс для платформы 8.3.10: не работает прокрутка колесиком мыши, недоступны кнопки управления списком в правом нижнем углу	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда // по заявке №4797, добавлена проверка, что в группе есть элементы, иначе курсор сбивается
		Элементы.СписокНоменклатуры.Обновить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокХарактеристикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ДобавитьНоменклатуруВКорзину(ТекущиеДанные, Истина);

КонецПроцедуры

#КонецОбласти

#Область ГруппаВыбраннаяНоменклатура

&НаКлиенте
Процедура ВыбраннаяНоменклатураПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ВыбраннаяНоменклатура.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	мНоменклатура = ТекущиеДанные.Номенклатура;
	мХарактеристика = ТекущиеДанные.ХарактеристикаНоменклатуры;
	мКоличество = ТекущиеДанные.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураПередУдалением(Элемент, Отказ)
	
	Если НЕ Отказ
		И ИспользуетсяПодборСТ
		И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги Тогда
		
		МассивСопутствующихТоваровНаУдаление = Новый Массив;
		ВыбранныеСтроки = Элементы.ВыбраннаяНоменклатура.ВыделенныеСтроки;
		
		Для Каждого ВыделеннаяСтрока Из ВыбранныеСтроки Цикл
			ТекущиеДанные = ВыбраннаяНоменклатура.НайтиПоИдентификатору(ВыделеннаяСтрока);			
			СопутствующиеТоварыКлиент.НайтиСвязанныеСтрокиПоСопуствующимТоварамПоТаблице(ВыбраннаяНоменклатура, ВыбранныеСтроки, ТекущиеДанные.УИСтроки, МассивСопутствующихТоваровНаУдаление);
		КонецЦикла;
			
		Если МассивСопутствующихТоваровНаУдаление.Количество() > 0 Тогда 		
			Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриУдаленииНоменклатуры Тогда
				ДопПараметры = Новый Структура("МассивСопутствующихТоваровНаУдаление", МассивСопутствующихТоваровНаУдаление);
				ПоказатьВопрос(Новый ОписаниеОповещения("ВопросУдалениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Удалить сопутствующие товары и услуги для выбранных строк?", РежимДиалогаВопрос.ДаНет);			
			Иначе
				СопутствующиеТоварыКлиент.УдалитьСопутствующиеТоварыПоТаблице(ВыбраннаяНоменклатура, МассивСопутствующихТоваровНаУдаление);
				МассивСопутствующихТоваровНаУдаление.Очистить();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ВыбраннаяНоменклатура.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена");		
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	
	//++ #16835
	Если НЕ мНоменклатура = СтрокаТабличнойЧасти.Номенклатура 
		И ИспользуетсяПодборСТ		
		И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги Тогда
		
		МассивСопутствующихТоваровНаУдаление = Новый Массив;
		ВыбранныеСтроки = Элементы.ВыбраннаяНоменклатура.ВыделенныеСтроки;
		
		СопутствующиеТоварыКлиент.НайтиСвязанныеСтрокиПоСопуствующимТоварамПоТаблице(ВыбраннаяНоменклатура, ВыбранныеСтроки, СтрокаТабличнойЧасти.УИСтроки, МассивСопутствующихТоваровНаУдаление);
		
		Если МассивСопутствующихТоваровНаУдаление.Количество() > 0 Тогда 
			Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииНоменклатуры Тогда
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("МассивСопутствующихТоваровНаУдаление", МассивСопутствующихТоваровНаУдаление);
				ДопПараметры.Вставить("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти);
				ОписаниеОповещения = Новый ОписаниеОповещения("ДобавлениеСопутствующейНоменклатурыПриИзмененииНоменклатуры", ЭтотОбъект, ДопПараметры);
				ДопПараметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ВопросУдалениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры);
				
				ТекстВопроса = СтрШаблон("Удалить сопутствующие товары и услуги %1 измененной номенклатуры ""%2""?", Символы.ПС, 
								СопутствующиеТоварыКлиентСервер.ПредставлениеНоменклатуры(мНоменклатура, мХарактеристика));
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);							

			Иначе
				СопутствующиеТоварыКлиент.УдалитьСопутствующиеТоварыПоТаблице(ВыбраннаяНоменклатура, МассивСопутствующихТоваровНаУдаление);
				МассивСопутствующихТоваровНаУдаление.Очистить();
				
				НоменклатураПриИзмененииЗавершение(СтрокаТабличнойЧасти);
			КонецЕсли; 
		Иначе
			НоменклатураПриИзмененииЗавершение(СтрокаТабличнойЧасти);
		КонецЕсли;
				
	КонецЕсли;
	//-- #16835
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзмененииЗавершение(СтрокаТабличнойЧасти)

	Если ИспользуетсяПодборСТ Тогда
		
		// если номенклатуру изменили, то отвязываем ее от "родителя"
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.УИСтрокиРодителя) Тогда
			СтрокаТабличнойЧасти.УИСтроки = Строка(Новый УникальныйИдентификатор);
			СтрокаТабличнойЧасти.УИСтрокиРодителя = Неопределено;
		КонецЕсли;
		ДобавитьСопутствующиеТовары("Изменение", СтрокаТабличнойЧасти);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ВыбраннаяНоменклатура.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена");		
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	
	//++ #16835
	Если НЕ мХарактеристика = СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры 
		И ИспользуетсяПодборСТ		
		И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги Тогда
		
		МассивСопутствующихТоваровНаУдаление = Новый Массив;
		ВыбранныеСтроки = Элементы.ВыбраннаяНоменклатура.ВыделенныеСтроки;
		
		СопутствующиеТоварыКлиент.НайтиСвязанныеСтрокиПоСопуствующимТоварамПоТаблице(ВыбраннаяНоменклатура, ВыбранныеСтроки, СтрокаТабличнойЧасти.УИСтроки, МассивСопутствующихТоваровНаУдаление);
		
		Если МассивСопутствующихТоваровНаУдаление.Количество() > 0 Тогда 
			Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииНоменклатуры Тогда
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("МассивСопутствующихТоваровНаУдаление", МассивСопутствующихТоваровНаУдаление);
				ДопПараметры.Вставить("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти);
				ОписаниеОповещения = Новый ОписаниеОповещения("ДобавлениеСопутствующейНоменклатурыПриИзмененииХарактеристики", ЭтотОбъект, ДопПараметры);
				ДопПараметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ВопросУдалениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры);
				
				ТекстВопроса = СтрШаблон("Удалить сопутствующие товары и услуги %1 измененной номенклатуры ""%2""?", Символы.ПС, 
								СопутствующиеТоварыКлиентСервер.ПредставлениеНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, мХарактеристика));
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);							

			Иначе
				СопутствующиеТоварыКлиент.УдалитьСопутствующиеТоварыПоТаблице(ВыбраннаяНоменклатура, МассивСопутствующихТоваровНаУдаление);
				МассивСопутствующихТоваровНаУдаление.Очистить();
				
				ХарактеристикаПриИзмененииЗавершение(СтрокаТабличнойЧасти);
			КонецЕсли; 
		Иначе
			ХарактеристикаПриИзмененииЗавершение(СтрокаТабличнойЧасти);
		КонецЕсли;
				
	КонецЕсли;
	//-- #16835
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзмененииЗавершение(СтрокаТабличнойЧасти)

	Если ИспользуетсяПодборСТ Тогда
		
		// если характеристику изменили, то отвязываем ее от "родителя"
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.УИСтрокиРодителя) Тогда
			СтрокаТабличнойЧасти.УИСтроки = Строка(Новый УникальныйИдентификатор);
			СтрокаТабличнойЧасти.УИСтрокиРодителя = Неопределено;
		КонецЕсли;
		ДобавитьСопутствующиеТовары("Изменение", СтрокаТабличнойЧасти);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураКоличествоПриИзменении(Элемент)
	
	ОчиститьСообщения();
	СтрокаТабличнойЧасти = Элементы.ВыбраннаяНоменклатура.ТекущиеДанные;
	
	//#2792
	Если ЗначениеЗаполнено(ВидДокументаПроверкиКратности) Тогда
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
		ОтказВИзмененииКоличества = Ложь;
		КоличествоПриИзмененииНаСервере(СтруктураДанные, ОтказВИзмененииКоличества);
		Если ОтказВИзмененииКоличества Тогда
			СтрокаТабличнойЧасти.Количество = 0;
		КонецЕсли;
	КонецЕсли;
	
	ПослеИзмененияКоличестваТоваров(СтрокаТабличнойЧасти);
	
	//++ #16835
	Если НЕ мКоличество = СтрокаТабличнойЧасти.Количество 
		И ИспользуетсяПодборСТ		
		И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги Тогда
		
		МассивСопутствующихТоваров = Новый Массив;
		ВыбранныеСтроки = Элементы.ВыбраннаяНоменклатура.ВыделенныеСтроки;
		
		СопутствующиеТоварыКлиент.НайтиСвязанныеСтрокиПоСопуствующимТоварамПоТаблице(ВыбраннаяНоменклатура, ВыбранныеСтроки, СтрокаТабличнойЧасти.УИСтроки, МассивСопутствующихТоваров);
		
		КоличествоСопутствующихТоваровВРегистре = ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, Истина);
		
		ТребуетсяДополнить = ?(МассивСопутствующихТоваров.Количество() < КоличествоСопутствующихТоваровВРегистре, Истина, Ложь);
		
		Если МассивСопутствующихТоваров.Количество() > 0 Тогда
			// если есть сопутствующие товары
			Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииКоличества Тогда
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("Номенклатура", 					СтрокаТабличнойЧасти.Номенклатура); 
				ДопПараметры.Вставить("ХарактеристикаНоменклатуры", 	СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры); 
				ДопПараметры.Вставить("УИСтроки", 						СтрокаТабличнойЧасти.УИСтроки); 
				ДопПараметры.Вставить("Количество", 					СтрокаТабличнойЧасти.Количество); 
				
				ДопПараметры.Вставить("ТребуетсяДополнить", ТребуетсяДополнить);
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ВопросИзменениеКоличестваСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры);
				
				ТекстВопроса = СтрШаблон("Изменить количество сопутствующих товаров и услуг %1 для номенклатуры ""%2""?", Символы.ПС, 
								СопутствующиеТоварыКлиентСервер.ПредставлениеНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры));
								
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Иначе
				Если ТребуетсяДополнить Тогда
					ДобавитьСопутствующиеТовары("Добавление", СтрокаТабличнойЧасти, Истина);
				КонецЕсли;	
				// Изменяем количество сопутсвующей номенклатуры с дополнением отсутствующей
				ИзмененныеСтроки = СопутствующиеТоварыКлиент.ИзменитьКоличествоСопутствущихТоваровПоТаблице(ВыбраннаяНоменклатура, СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.Количество, СтрокаТабличнойЧасти.УИСтроки);
				Для каждого СтрокаТовара Из ИзмененныеСтроки Цикл
					ПослеИзмененияКоличестваТоваров(СтрокаТовара);
				КонецЦикла;	
			КонецЕсли;
		Иначе
			Если ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
				ДобавитьСопутствующиеТовары("Добавление", СтрокаТабличнойЧасти, Истина);				
			КонецЕсли;	
		КонецЕсли;
	
	КонецЕсли;
	//-- #16835
	
КонецПроцедуры

&НаСервере
Процедура КоличествоПриИзмененииНаСервере(СтруктураДанные, ОтказВИзмененииКоличества)
		
	ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(ОтказВИзмененииКоличества, СтруктураДанные, ВидДокументаПроверкиКратности);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияКоличестваТоваров(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВыбраннаяНоменклатура.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураСуммаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВыбраннаяНоменклатура.ТекущиеДанные;
	Если НЕ ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Цена = ТекущиеДанные.Сумма / ТекущиеДанные.Количество;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ГруппаАналоговНоменклатуры

&НаКлиенте
Процедура СписокАналоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЭтоГруппа(ТекущиеДанные.НоменклатураСсылка) Тогда
		Возврат;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если ПодборТиповых Тогда
		ДобавитьОтрезВКорзину(ТекущиеДанные);
	Иначе	
		Если ТекущиеДанные.ИмеютсяХарактеристики Тогда
			ПерейтиКСпискуХарактеристикНоменклатуры(ТекущиеДанные.НоменклатураСсылка, Истина);
		Иначе
			ДобавитьНоменклатуруВКорзину(ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоАналогам(НоменклатураСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналогиНоменклатуры.Аналог КАК Номенклатура
	|ИЗ
	|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
	|ГДЕ
	|	АналогиНоменклатуры.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АналогиНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
	|ГДЕ
	|	АналогиНоменклатуры.Аналог = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	МассивНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");;
	
	СписокАналогов.Параметры.УстановитьЗначениеПараметра("НоменклатураРодительАналога", НоменклатураСсылка);
	
	// фильтр удаляем/добавляем, поскольку УстановитьЭлементОтбораДинамическогоСписка затирает другие наложенные фильтры по НоменклатураСсылка (например отбор по разрешенной в рознице)
	// при удалении не передаем ИмяПоля, поиск только по наименованию отбора, иначе тоже затирает
	ОбластьОтбора = СписокАналогов.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокАналогов, , "ОтборПоАналогам");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ОбластьОтбора, "НоменклатураСсылка", ВидСравненияКомпоновкиДанных.ВСписке, МассивНоменклатуры, "ОтборПоАналогам", Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокХарактеристикАналоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ДобавитьНоменклатуруВКорзину(ТекущиеДанные, Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокХарактеристикПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// №6193
	Для Каждого ТекущаяСтрока Из Строки Цикл
		ТекущаяСтрока.Значение.Данные["КоличествоДоступно"] = ТекущаяСтрока.Значение.Данные["Количество"] - Макс(ТекущаяСтрока.Значение.Данные["КоличествоВРезерве"], 0);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

#КонецОбласти

#Область СопутствующиеТовары
// #16835

&НаКлиенте
Процедура ВопросДобавлениеСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(ДополнительныеПараметры.Номенклатура, ДополнительныеПараметры.ХарактеристикаНоменклатуры, 
															ДополнительныеПараметры.Количество, ДополнительныеПараметры.УИСтроки, 0);
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьСопутствующуюНоменклатуру(Номенклатура, 
										  Характеристика = Неопределено,										   
										  Количество = 1,
										  УИСтрокиРодителя,
										  Уровень, 
										  МассивДобавленнойСП = Неопределено)
	
	Если МассивДобавленнойСП = Неопределено Тогда
		МассивДобавленнойСП = Новый Массив;
	КонецЕсли;
	
	Если Уровень < СтруктураДействийПоСТ.ДопустимаяГлубинаВложенностиСопутствующихТоваров Тогда
		МассивЗаписей = ОбщийМодульВызовСервера.ПолучитьСписокСопутствующихТоваров(Номенклатура, Характеристика, Количество);
		Для Каждого Запись из МассивЗаписей Цикл
			ВозвращеннаяСтрока = ДобавитьСопутствующуюНоменклатуруВКорзину(Запись, УИСтрокиРодителя);
			Если ВозвращеннаяСтрока.Новая  Тогда
				ДобавленнаяСтрока = ВозвращеннаяСтрока.Строка;
				МассивДобавленнойСП.Добавить(ДобавленнаяСтрока);
				ДобавитьСопутствующуюНоменклатуру(ДобавленнаяСтрока.Номенклатура, ДобавленнаяСтрока.ХарактеристикаНоменклатуры, ДобавленнаяСтрока.Количество, 
												  ДобавленнаяСтрока.УИСтроки, Уровень+1, МассивДобавленнойСП);
			Иначе
				СуществующаяСтрока = ВозвращеннаяСтрока.Строка;
				ДобавитьСопутствующуюНоменклатуру(СуществующаяСтрока.Номенклатура, СуществующаяСтрока.ХарактеристикаНоменклатуры, СуществующаяСтрока.Количество, 
												  СуществующаяСтрока.УИСТроки, Уровень+1, МассивДобавленнойСП);
			КонецЕсли;		
		КонецЦикла;		
	КонецЕсли;
	Возврат МассивДобавленнойСП;
	
КонецФункции

&НаКлиенте
Функция ДобавитьСопутствующуюНоменклатуруВКорзину(ДанныеСтроки, УИСтрокиРодителя)

	ВозвращаемСтроку = Новый Структура;
	
	// Проверяем наличие сопуствующей номенклатуры, чтобы не добавить дубликат или чтобы не затереть параметры номенклатуры
	Для каждого СтрокаТЗ Из ВыбраннаяНоменклатура Цикл 
		Если СтрокаТЗ.Номенклатура = ДанныеСтроки.Номенклатура 
			И СтрокаТЗ.ХарактеристикаНоменклатуры = ДанныеСтроки.Характеристика 
			И СтрокаТЗ.ЕдиницаИзмерения = ДанныеСтроки.ЕдиницаИзмерения
			И СтрокаТЗ.УИСтрокиРодителя = УИСтрокиРодителя Тогда
			ВозвращаемСтроку.Вставить("Строка", СтрокаТЗ);
			ВозвращаемСтроку.Вставить("Новая", Ложь);
			Возврат ВозвращаемСтроку;
		КонецЕсли;	
	КонецЦикла;
	
	СтрокаТабличнойЧасти = ВыбраннаяНоменклатура.Добавить();
	СтрокаТабличнойЧасти.Номенклатура = ДанныеСтроки.Номенклатура;
	СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ДанныеСтроки.Характеристика;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ДанныеСтроки.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Коэффициент = ДанныеСтроки.Коэффициент;
	
	СтрокаТабличнойЧасти.УИСтроки = Строка(Новый УникальныйИдентификатор);
	СтрокаТабличнойЧасти.УИСтрокиРодителя = УИСтрокиРодителя;
	СтрокаТабличнойЧасти.Количество = ДанныеСтроки.Количество;
	
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);

	//СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	//ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, Количество, ВидНоменклатуры, Спецификация, УчитыватьКакПотолок");
	
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена"); 
		
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	
	ВозвращаемСтроку.Вставить("Строка", СтрокаТабличнойЧасти);
	ВозвращаемСтроку.Вставить("Новая", Истина);
	
	Возврат ВозвращаемСтроку;

КонецФункции

&НаКлиенте
Процедура ВопросУдалениеСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СопутствующиеТоварыКлиент.УдалитьСопутствующиеТоварыПоТаблице(ВыбраннаяНоменклатура, ДополнительныеПараметры.МассивСопутствующихТоваровНаУдаление);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеСопутствующейНоменклатурыПриИзмененииНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	

	НоменклатураПриИзмененииЗавершение(ДополнительныеПараметры.СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеСопутствующейНоменклатурыПриИзмененииХарактеристики(РезультатВопроса, ДополнительныеПараметры) Экспорт	

	ХарактеристикаПриИзмененииЗавершение(ДополнительныеПараметры.СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСопутствующиеТовары(ОписаниеДействия, СтрокаТабличнойЧасти, БезПроверкиУсловий = Ложь)
	
	Если НЕ ИспользуетсяПодборСТ Тогда
		Возврат;	
	КонецЕсли;
	
	ЗапрашиватьПодтверждение = Неопределено;
	Если ОписаниеДействия = "Добавление" Тогда
		ЗапрашиватьПодтверждение = СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриДобавленииНоменклатуры;
		
	ИначеЕсли ОписаниеДействия = "Изменение" Тогда 
		ЗапрашиватьПодтверждение = СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииНоменклатуры;
		
	КонецЕсли;
	
	Если БезПроверкиУсловий
		ИЛИ (СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги
		     И ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры)) Тогда
		
		Если ЗапрашиватьПодтверждение Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура); 
			ДопПараметры.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры); 
			ДопПараметры.Вставить("УИСтроки", СтрокаТабличнойЧасти.УИСтроки); 
			ДопПараметры.Вставить("Количество", СтрокаТабличнойЧасти.Количество); 
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросДобавлениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры);
			ТекстВопроса = СтрШаблон("Добавить сопутствующие товары и услуги %1 для номенклатуры: ""%2""?", 
									  Символы.ПС, СопутствующиеТоварыКлиентСервер.ПредставлениеНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры));
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.Количество, СтрокаТабличнойЧасти.УИСтроки, 0);										  
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросИзменениеКоличестваСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	
	// Если не нужно изменять количество сопутствующей номенклатуры и не требуется дополнять недостающую номенклатуру
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да 
		И НЕ ДополнительныеПараметры.ТребуетсяДополнить Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ИзмененныеСтроки = СопутствующиеТоварыКлиент.ИзменитьКоличествоСопутствущихТоваровПоТаблице(ВыбраннаяНоменклатура, 
														ДополнительныеПараметры.Номенклатура, ДополнительныеПараметры.ХарактеристикаНоменклатуры, 
														ДополнительныеПараметры.Количество, ДополнительныеПараметры.УИСтроки);
		Для каждого СтрокаТовара Из ИзмененныеСтроки Цикл
			ПослеИзмененияКоличестваТоваров(СтрокаТовара);
		КонецЦикла;	
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяДополнить Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросДобавлениеНедостающейСопутствующейНоменклатуры", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = СтрШаблон("Добавить недостающие сопутствующие товары и услуги %1 для номенклатуры: ""%2""?", 
									  Символы.ПС, СопутствующиеТоварыКлиентСервер.ПредставлениеНоменклатуры(ДополнительныеПараметры.Номенклатура, ДополнительныеПараметры.ХарактеристикаНоменклатуры));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросДобавлениеНедостающейСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(ДополнительныеПараметры.Номенклатура, ДополнительныеПараметры.ХарактеристикаНоменклатуры, ДополнительныеПараметры.Количество, ДополнительныеПараметры.УИСтроки, 0);					
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПоказыватьАрхивную(Команда)
	
	Элементы.СписокНоменклатурыПоказыватьАрхивную.Пометка = Не Элементы.СписокНоменклатурыПоказыватьАрхивную.Пометка;
	
	УстановитьОтборАрхивнаяНоменклатура(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборАрхивнаяНоменклатура(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокНоменклатуры,
		"Архивная",
		Ложь,
		,
		,
		Не Форма.Элементы.СписокНоменклатурыПоказыватьАрхивную.Пометка);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокНоменклатуры,
		"Архивная",
		Ложь,
		,
		,
		Не Форма.Элементы.СписокНоменклатурыПоказыватьАрхивную.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьАрхивнуюХарактеристику(Команда)
	
	Элементы.СписокХарактеристикПоказыватьАрхивнуюХарактеристику.Пометка = Не Элементы.СписокХарактеристикПоказыватьАрхивнуюХарактеристику.Пометка;
	
	УстановитьОтборАрхивнаяХарактеристика(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборАрхивнаяХарактеристика(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокХарактеристик,
		"Архивная",
		Ложь,
		,
		,
		Не Форма.Элементы.СписокХарактеристикПоказыватьАрхивнуюХарактеристику.Пометка);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокХарактеристик,
		"Архивная",
		Ложь,
		,
		,
		Не Форма.Элементы.СписокХарактеристикПоказыватьАрхивнуюХарактеристику.Пометка);
	
КонецПроцедуры

//++ №9160
&НаКлиенте
Процедура ОбновитьВидимостьГруппыПредпросмотрИзображения()
	
	Элементы.ГруппаФайлыПредпросмотр.Видимость = ПоказыватьИзображенияНоменклатуры;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьИзображенияНоменклатурыПриИзменении(Элемент)
	
	ОбновитьВидимостьГруппыПредпросмотрИзображения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияФайлыПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ИзображениеСтруктура = ПоместитьДанныеВХранилище(ТекущиеДанные);
	Если ИзображениеСтруктура.ЕстьИзображение Тогда
		ОбщийМодульКлиент.ПредпросмотрФайла(ИзображениеСтруктура.Хранилище, ИзображениеСтруктура.Расширение, Предпросмотр, Элементы.Предпросмотр);
	Иначе	
		Предпросмотр = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВХранилище(ТекущиеДанные)
	
	Данные = новый Структура();
	Данные.Вставить("ЕстьИзображение", (НЕ ТекущиеДанные.НоменклатураСсылка.ФайлКартинки.ФайлХранилище.Получить() = Неопределено));
	Данные.Вставить("Хранилище", ПоместитьВоВременноеХранилище(ТекущиеДанные.НоменклатураСсылка.ФайлКартинки.ФайлХранилище.Получить(), ЭтаФорма.УникальныйИдентификатор));
	Данные.Вставить("Расширение", ТекущиеДанные.НоменклатураСсылка.ФайлКартинки.Расширение);
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура ИспользоватьПланированиеПриИзменении(Элемент)
	
	Элементы.ОжидаемыйРасходКГоризонтуПланирования.Видимость =  ИспользоватьПланирование; 
	Элементы.ГруппаДатыПланирования.Видимость =  ИспользоватьПланирование;
	Элементы.ОжидаемыйОстаток.Видимость =  ИспользоватьПланирование;
	
	ОбновитьПараметрыЗапроса();
	
	//nva+++
	ОбновитьЭлементыФормы();
	//nva---
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ОбновитьПараметрыЗапроса();
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	ОбновитьПараметрыЗапроса();
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ГоризонтПланированияПриИзменении(Элемент)
	ОбновитьПараметрыЗапроса();
КонецПроцедуры

//nva+++
&НаСервере
Функция ПолучитьКратностьЕдиницыИзмерения(Номенклатуры, ЕдИзм)
	
	Кратность = 1;
	
	Для Каждого СтрокаКратность Из Номенклатуры.Кратность Цикл
		Если СтрокаКратность.ЕдиницаИзмерения = ЕдИзм Тогда
			Кратность = СтрокаКратность.Кратность;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Кратность;
	
КонецФункции	

&НаСервереБезКонтекста
Процедура СписокНоменклатурыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	УстановитьПривилегированныйРежим(Истина); // nva отключаем РЛС иначе подбор очень тормозит
КонецПроцедуры
//nva---
//-- №9160

