
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОперацияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Доступность = Истина;
	
	ТекстСообщения = ?(РезультатВыполнения.Результат, НСтр("ru='Операция успешно завершена.'"), РезультатВыполнения.ОписаниеОшибки);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
	ПолучитьСостояниеПоследнейСмены();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСмену(Команда)
	
	ОчиститьСообщения();
	
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
	ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
	ПоддерживаемыеТипыВО.Добавить("ККТ");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьСменуПослеВыбораУстройства", ЭтотОбъект);
	МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальное устройство'"), 
		НСтр("ru='Фискальное устройство не подключено.'"), 
		НСтр("ru='Фискальное устройство не выбрано.'"), 
		Истина);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьСменуПослеВыбораУстройства(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Доступность = Ложь;
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперации();
	Кассир = "";
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, СтандартнаяОбработка); 
	ПараметрыОперации.Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
	
	ДополнительныеПараметры = Новый Структура();
	Если МенеджерОборудованияКлиентПовтИсп.ИспользуетсяПодсистемыФискальныхУстройств() Тогда
		МодульКассовыеСменыКлиентПереопределяемый = МенеджерОборудованияКлиентПовтИсп.ОбщийМодуль("КассовыеСменыКлиентПереопределяемый");
		МодульКассовыеСменыКлиентПереопределяемый.УправлениеФУЗаполнитьДополнительныеПараметрыПередОткрытиемСмены(РезультатВыбора, ДополнительныеПараметры);
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, РезультатВыбора,, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСмену(Команда)
	
	ОчиститьСообщения();
	
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
	ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
	ПоддерживаемыеТипыВО.Добавить("ККТ");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьСменуПослеВыбораУстройства", ЭтотОбъект);
	МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальное устройство'"), 
		НСтр("ru='Фискальное устройство не подключено.'"), 
		НСтр("ru='Фискальное устройство не выбрано.'"), 
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуПослеВыбораУстройства(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Доступность = Ложь;
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперации();
	Кассир = "";
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, СтандартнаяОбработка); 
	ПараметрыОперации.Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОТекущемСостоянииРасчетов(Команда)
	
	ОчиститьСообщения();
	Доступность = Ложь;
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперации();
	Кассир = "";
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, СтандартнаяОбработка); 
	ПараметрыОперации.Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьФормированиеОтчетаОТекущемСостоянииРасчетов(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетБезГашения(Команда)
	
	ОчиститьСообщения();
	Доступность = Ложь;
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперации();
	Кассир = "";
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, СтандартнаяОбработка); 
	ПараметрыОперации.Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьФормированиеОтчетаБезГашения(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации);
	
КонецПроцедуры

#КонецОбласти


#Область ПотолкиМодификация

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыбратьОборудование();	
	ПолучитьСостояниеПоследнейСмены();
КонецПроцедуры

&НаКлиенте
Процедура ВыборРабочегоМеста(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборРабочегоМестаЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.ПредложитьВыборРабочегоМеста(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРабочегоМестаЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("РабочееМесто") Тогда 
		МенеджерОборудованияКлиент.УстановитьРабочееМесто(Результат.РабочееМесто);
		//При ручном указании РМК, запишем в карточку пользователя саму РМК, чтобы при старте программы утановить его		
		СохранитьРМКВКарточкеПользователя(Результат.РабочееМесто);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРМКВКарточкеПользователя(РМК)
	Попытка
		ОбъектПользователь = ПараметрыСеанса.Пользователь.Ссылка.ПолучитьОбъект();
		ОбъектПользователь.РМК = РМК;
		ОбъектПользователь.Записать();
	Исключение
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостоянияСмены(Команда)
	ПолучитьСостояниеПоследнейСмены();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОформлениеСостояниеСмены()
	
	Элементы.ГруппаСостояниеСмены.Видимость = (НЕ ИдентификаторОборудования.Пустая());
	
	//Состояние смены в 1С
	Состояние = "";
	ЦветСмены1С = WebЦвета.Красный;
	Если СтатусКассовойСмены.Пустая() Тогда
		Состояние = "не открыта"
	ИначеЕсли СменаОткрыта И Ошибка24Часа Тогда
		Состояние = "истекла (прошло 24 часа), " + Формат(ДатаИзмененияСтатуса, "ДЛФ=DDT");
	ИначеЕсли СменаОткрыта Тогда
		Состояние = "открыта, " + Формат(ДатаИзмененияСтатуса, "ДЛФ=DDT");
		ЦветСмены1С = WebЦвета.ЗеленыйЛес;
	ИначеЕсли НЕ СменаОткрыта Тогда
		Состояние = "закрыта, " + Формат(ДатаИзмененияСтатуса, "ДЛФ=DDT");
	КонецЕсли;			
	Элементы.ДекорацияСмена1С.Заголовок = "Смена в 1С: " + Состояние;
	Элементы.ДекорацияСмена1С.ЦветТекста = ЦветСмены1С;
	
	//Состояние смены на ККТ
	ЦветСменыККТ = WebЦвета.Красный;
	СостояниеККТ = "";
	Если СтатусСменыККТ = 1 Тогда
		СостояниеККТ = "закрыта";
	ИначеЕсли СтатусСменыККТ = 2 Тогда
		СостояниеККТ = "открыта";
		ЦветСменыККТ = WebЦвета.ЗеленыйЛес;
	ИначеЕсли СтатусСменыККТ = 3 Тогда
		СостояниеККТ = "истекла (прошло 24 часа)";	
	КонецЕсли;	
	Элементы.ДекорацияСменаККТ.Заголовок = "Смена на ККТ: " + СостояниеККТ;
	Элементы.ДекорацияСменаККТ.ЦветТекста = ЦветСменыККТ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСостояниеПоследнейСмены()

	СтатусКассовойСмены = ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.ПустаяСсылка");
	СтатусСменыККТ = 0;
	
	Если ИдентификаторОборудования.Пустая() Тогда
		ОбновитьОформлениеСостояниеСмены();
		Возврат;
	КонецЕсли;
	
	ПолучитьСостояниеСменыНаККТ();	
	ПолучитьСостояниеСмены1С();
	
	ОбновитьОформлениеСостояниеСмены();
			
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСостояниеСменыНаККТ()
	
	Если ИдентификаторОборудования.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура;	
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , Неопределено);
	Контекст.Вставить("ВыполняемаяКоманда"      , "GetCurrentStatus");
	Контекст.Вставить("ИдентификаторУстройства" , ИдентификаторОборудования);	
	Контекст.Вставить("ОповещениеПриЗавершении" , новый ОписаниеОповещения("Завершение_СостояниеСменыНаККТ", ЭтотОбъект));
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПодключениеЗавершение", ЭтотОбъект, Контекст);
	
	НачатьПолучениеТекущегоСостоянияФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторОборудования);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеТекущегоСостоянияФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено) Экспорт
		
	Если ИдентификаторУстройства = Неопределено Тогда
		Возврат;
	Иначе		
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоИдентификатору(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыполнениеКоманды_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыполнитьКомандуЗавершение", МенеджерОборудованияКлиент, Параметры);
		МенеджерОборудованияКлиент.НачатьВыполнениеКоманды(ОписаниеОповещения, Параметры.ИдентификаторУстройства, Параметры.ВыполняемаяКоманда, Параметры.ВходныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Завершение_СостояниеСменыНаККТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Результат Тогда
		
		Попытка
			СтатусСменыККТ = Результат.ВыходныеПараметры[2];
		Исключение
			СтатусСменыККТ = 0;
		КонецПопытки;	
				
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСостояниеСмены1С()
	
	Если ИдентификаторОборудования.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСостояниеКассовойСмены = ПотолкиКассыОнлайн.ПолучитьСостояниеКассовойСмены(ИдентификаторОборудования);
	СтатусКассовойСмены  = СтруктураСостояниеКассовойСмены.СтатусКассовойСмены;
	Ошибка24Часа	     = СтруктураСостояниеКассовойСмены.Ошибка24Часа;
	ДатаИзмененияСтатуса = СтруктураСостояниеКассовойСмены.ДатаИзмененияСтатуса;
	СменаОткрыта 		 = СтруктураСостояниеКассовойСмены.СменаОткрыта;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОборудование()
	
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
	ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
	ПоддерживаемыеТипыВО.Добавить("ККТ");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Завершение_ВыбратьОборудование", ЭтотОбъект);
	МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальное устройство'"), 
		НСтр("ru='Фискальное устройство не подключено.'"), 
		НСтр("ru='Фискальное устройство не выбрано.'"), 
		Истина); 	
	
КонецПроцедуры

&НаКлиенте
Процедура Завершение_ВыбратьОборудование(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОборудования = РезультатВыбора;	
	
КонецПроцедуры

#КонецОбласти
