&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(Команда)

	Попытка
		Если ПустаяСтрока(Объект.ТекстЗапроса) Тогда 
			КонструкторЗапроса = Новый КонструкторЗапроса();
		Иначе
			КонструкторЗапроса = Новый КонструкторЗапроса(Объект.ТекстЗапроса);
		КонецЕсли;	
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки; 
	
	КонструкторЗапроса.Показать(Новый ОписаниеОповещения("ПриЗакрытииКонструктораЗапроса", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииКонструктораЗапроса(ТЗ, ДополнительныеПараметры) Экспорт
	
	Если ТЗ = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ТЗ = Объект.ТекстЗапроса Тогда
		Возврат; 
	КонецЕсли; 
	
	Модифицированность = Истина;
	Объект.ТекстЗапроса = ТЗ;
	
	ТекстЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(ТЗ));

КонецПроцедуры

&НаКлиенте
Функция ПолучитьРаскрашенныйТекст(Знач ТЗ) Экспорт 

	Цвет_КлючевыеСлова = WebЦвета.Синий;
	Цвет_Функции = WebЦвета.ТемноБордовый;
	Цвет_Комментарии = WebЦвета.Зеленый;
	Цвет_Параметр = WebЦвета.ЦианНейтральный;
	Цвет_Число = WebЦвета.Фуксия;
	Цвет_Текст = WebЦвета.Черный;
	
	СимволыНПП = Символы.НПП;
	
	ТЗ = СтрЗаменить(ТЗ, Символы.Таб, "    ");
	ТЗ = СтрЗаменить(ТЗ, СимволыНПП, " ");
	МассивФМС = Новый Массив;
	
	МассивСтрок = ИзСтрокиСРазделителями(ТЗ, Символы.ПС);
	КолСтрок = МассивСтрок.Количество();
	Для индСтрока = 0 По КолСтрок - 1 Цикл
		
		стрСтрока = МассивСтрок[индСтрока];
		
		Если Лев(СокрЛ(стрСтрока), 2)	= "//" Тогда
			МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСтрока, Цвет_Комментарии));
		Иначе
			ПроверяемаяСтрока = ВРег(стрСтрока);
			Если форматирование_ЭтоПолноеКлючевоеСлово(ПроверяемаяСтрока) Тогда
				МассивФМС.Добавить(Новый Структура("Строка, Цвет", ПроверяемаяСтрока, Цвет_КлючевыеСлова));
			Иначе
				
				МассивСлов = ПолучитьСписокСлов(стрСтрока);
				КолСлов = МассивСлов.Количество();
				Для индСлово = 0 По КолСлов - 1 Цикл
					
					стрСлово = МассивСлов[индСлово];
					
					Если ТипЗнч(стрСлово) = Тип("Структура") Тогда
						МассивФМС.Добавить(стрСлово);
						Продолжить;
					КонецЕсли;
					
					ПроверяемоеСлово = ВРег(стрСлово);
					
					Если форматирование_ЭтоПараметр(стрСлово) Тогда
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_Параметр));
					ИначеЕсли форматирование_ЭтоКлючевоеСлово(ПроверяемоеСлово) Тогда
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", ПроверяемоеСлово, Цвет_КлючевыеСлова));
					ИначеЕсли форматирование_ЭтоФункция(ПроверяемоеСлово) Тогда
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", ПроверяемоеСлово,Цвет_Функции));
					ИначеЕсли форматирование_ЭтоЧисло(стрСлово) Тогда
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_Число));
					Иначе  
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_Текст));
					КонецЕсли; 
					
				КонецЦикла;
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если индСтрока < КолСтрок - 1 Тогда
			МассивФМС.Добавить(Новый Структура("Строка, Цвет", Символы.ПС, ""));
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если МассивФМС.Количество() = 0 Тогда
		Возврат Новый ФорматированнаяСтрока("");
	КонецЕсли;
	
	ФМС_Строка = "";
	ПредЦвет = МассивФМС[0].Цвет;
	Если ПредЦвет = "" Тогда
		ПредЦвет = Цвет_Текст;
	КонецЕсли;
	ФМС = Новый ФорматированнаяСтрока("");
	МассивФМСРез= Новый Массив;
	
	Для Каждого стрСлово Из МассивФМС Цикл
		Если стрСлово.Цвет = "" ИЛИ ПредЦвет = стрСлово.Цвет Тогда
			ФМС_Строка = ФМС_Строка + стрСлово.Строка;	
		Иначе
			Если ПредЦвет = Цвет_Текст Тогда
				МассивФМСРез.Добавить(ФМС_Строка);
			Иначе
				МассивФМСРез.Добавить(Новый ФорматированнаяСтрока(ФМС_Строка,,ПредЦвет));
			КонецЕсли;
			
			ФМС_Строка = стрСлово.Строка;
			ПредЦвет = стрСлово.Цвет;
		КонецЕсли; 
	КонецЦикла;
	Если ПредЦвет = Цвет_Текст Тогда
		МассивФМСРез.Добавить(ФМС_Строка);
	Иначе
		МассивФМСРез.Добавить(Новый ФорматированнаяСтрока(ФМС_Строка,,ПредЦвет));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(МассивФМСРез);

КонецФункции

&НаКлиенте
Функция ИзСтрокиСРазделителями(Знач вхСтр, вхРазделитель)
	
	Массив = Новый Массив;
	вхСтр = СтрЗаменить(вхСтр, вхРазделитель, Символы.ПС);
	ЧислоСтрок = СтрЧислоСтрок(вхСтр);
	Для Счетчик = 1 По ЧислоСтрок Цикл 
		Массив.Добавить(СтрПолучитьСтроку(вхСтр, Счетчик));
	КонецЦикла;
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокСлов(Знач вхСтр)
	
	Цвет_КлючевыеСлова = WebЦвета.Синий;
	Цвет_Строка = WebЦвета.Красный;
	
	МассивРезультат = Новый Массив;
	
	ТекущееСлово = "";
	СтрДлинаСтр = СтрДлина(вхСтр);
	
	Для Поз = 1 По СтрДлинаСтр Цикл
		ТекущийСимвол = Сред(вхСтр, Поз, 1);
		
		Если ТекущийСимвол = " " Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
				ТекущееСлово = "";
			КонецЕсли;
			
			Пока ТекущийСимвол = " " и Поз <= СтрДлинаСтр Цикл
				ТекущееСлово = ТекущееСлово + Символы.НПП;
				Поз = Поз + 1;
				ТекущийСимвол = Сред(вхСтр, Поз, 1);
			КонецЦикла;
			МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущееСлово, ""));
			
			ТекущееСлово = "";
			
		КонецЕсли;
			
		Если Найти(",()=+-*<>'", ТекущийСимвол) > 0 Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
			КонецЕсли;
			
			Если ТекущийСимвол = ">" Тогда
				МассивРезультат.Добавить(Новый Структура("Строка, Цвет", "&gt;", Цвет_КлючевыеСлова));
			Иначе
				МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущийСимвол, Цвет_КлючевыеСлова));
			КонецЕсли; 
			
			ТекущееСлово = "";
			
		ИначеЕсли ТекущийСимвол = """" Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
				ТекущееСлово = "";
			КонецЕсли;
			
			ТекущееСлово = """";
			Поз = Поз + 1;
			ТекущийСимвол = Сред(вхСтр, Поз, 1);

			Пока ТекущийСимвол <> """" и Поз <= СтрДлинаСтр Цикл
				ТекущееСлово = ТекущееСлово + ТекущийСимвол;
				Поз = Поз + 1;
				ТекущийСимвол = Сред(вхСтр, Поз, 1);
			КонецЦикла;
			МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущееСлово + """", Цвет_Строка));
			
			ТекущееСлово = "";
			
		Иначе
			
			ТекущееСлово = ТекущееСлово + ТекущийСимвол;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекущееСлово) Тогда
		МассивРезультат.Добавить(ТекущееСлово);
	КонецЕсли; 

	Возврат МассивРезультат;
	
КонецФункции

&НаКлиенте
Функция форматирование_ЭтоПараметр(стрСлово)
	Возврат Лев(стрСлово,1) = "&"; 
КонецФункции

&НаКлиенте
Функция форматирование_ЭтоФункция(стрСлово)

	СписокКлючевыхСлов = ";ПРЕДСТАВЛЕНИЕССЫЛКИ;ДОБАВИТЬКДАТЕ;РАЗНОСТЬДАТ;И;ИЛИ;НЕ;ИСТИНА;ЛОЖЬ;NULL;НЕОПРЕДЕЛЕНО;МЕЖДУ;В;ИЕРАРХИИ;ЕСТЬ;ПОДОБНО;СПЕЦСИМВОЛ;СУММА;МАКСИМУМ;МИНИМУМ;СРЕДНЕЕ;КОЛИЧЕСТВО;ДАТАВРЕМЯ;ПОДСТРОКА;ГОД;МЕСЯЦ;ДЕНЬ;ЧАС;МИНУТА;СЕКУНДА;КВАРТАЛ;НЕДЕЛЯ;ДЕНЬГОДА;ДЕНЬНЕДЕЛИ;НАЧАЛОПЕРИОДА;КОНЕЦПЕРИОДА;ЕСТЬNULL;ВЫБОР;КОГДА;ТОГДА;ИНАЧЕ;КОНЕЦ;ВЫРАЗИТЬ;ЗНАЧЕНИЕ;ПРЕДСТАВЛЕНИЕ;OR;AND;NOT;TRUE;FALSE;UNDIFENED;BETWEEN;IN;HIERARCHY;REF;IS;LIKE;ESCAPE;SUM;MAX;MIN;AVD;COUNT;DATATIME;SUBSTRING;YEAR;MOUNT;DAY;HOUR;MINUTE;SECOND;QUARTER;WEEK;DAYYEAR;DAYWEEK;BEGINOFPERIOD;ENDOFPERIOD;ISNULL;CASE;WHEN;THEN;ELSE;END;CAST;VALUE;PRESENTATION;";
	Возврат Найти(СписокКлючевыхСлов, ";"+стрСлово+";");
	
КонецФункции

&НаКлиенте
Функция форматирование_ЭтоПолноеКлючевоеСлово(стрСлово)
	
	ПроверяемоеСлово = СокрЛП(стрСлово);
	
	Если 
		ПроверяемоеСлово = "ВЫБРАТЬ" ИЛИ 
		ПроверяемоеСлово = "ИЗ" ИЛИ 
		ПроверяемоеСлово = "ГДЕ" ИЛИ 
		ПроверяемоеСлово = "ОБЪЕДИНИТЬ ВСЕ" ИЛИ 
		ПроверяемоеСлово = "СГРУППИРОВАТЬ ПО" ИЛИ 
		ПроверяемоеСлово = "УПОРЯДОЧИТЬ ПО" ИЛИ 
		ПроверяемоеСлово = "ИТОГИ ПО" ИЛИ 
		ПроверяемоеСлово = "ВЫБРАТЬ РАЗЛИЧНЫЕ" ИЛИ 
		ПроверяемоеСлово = "ДЛЯ ИЗМЕНЕНИЯ" ИЛИ 
		ПроверяемоеСлово = "ИНДЕКСИРОВАТЬ ПО"  
		Тогда
		
		Возврат Истина; 
		
	КонецЕсли;
	
	Возврат Ложь; 

КонецФункции
	
&НаКлиенте
Функция форматирование_ЭтоКлючевоеСлово(стрСлово)

	ПроверяемоеСлово = СокрЛП(стрСлово);
	
	СписокКлючевыхСлов = ";КАК;СОЕДИНЕНИЕ;ЛЕВОЕ;ВЫБРАТЬ;РАЗЛИЧНЫЕ;ПЕРВЫЕ;ИЗ;ГДЕ;УПОРЯДОЧИТЬ;ПО;АВТОУПОРЯДОЧИВАНИЕ;СГРУППИРОВАТЬ;ИТОГИ;ОБЩИЕ;ПРАВОЕ;ПОЛНОЕ;ВНЕШНЕЕ;ВНУТРЕННЕЕ;УБЫВ;ВОЗР;ИМЕЮЩИЕ;ОБЪЕДИНИТЬ;ВСЕ;ДЛЯ;ИЗМЕНЕНИЯ;ПОМЕСТИТЬ;ИНДЕКСИРОВАТЬ;УНИЧТОЖИТЬ;БУЛЕВО;ЧИСЛО;ТОЛЬКО;ИЕРАРХИЯ;ПЕРИОДАМИ;ТИПЗНАЧЕНИЯ;SELECT;DESTINCT;TOP;FROM;WHERE;AS;ORDER;BY;AUTOORDER;GROUP;TOTALS;OVERALL;LEFT;RIGHT;FULL;OUTER;INNER;JOIN;ON;DESC;ASK;HAVING;UNION;ALL;FOR;UPDATE;OF;INTO;INDEX;DROP;BOOLEAN;NUMBER;ONLY;HIERARCHY;PERIODS;";
	Возврат Найти(СписокКлючевыхСлов, ";"+ПроверяемоеСлово+";");
	
КонецФункции

&НаКлиенте
Функция форматирование_ЭтоЧисло(стрСлово)
	
	ЛевСимв = Лев(стрСлово, 1);
	Если ЛевСимв >= "0" и ЛевСимв <= "9" Тогда
		Возврат Истина; 
	КонецЕсли; 
	
	Возврат Ложь; 

КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СокрЛП(Объект.ТекстЗапроса) <>"" Тогда
		ТекстЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(Объект.ТекстЗапроса));
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТекстЗапросаПриИзменении(Элемент)
	Модифицированность = Истина;
	Объект.ТекстЗапроса = СтрЗаменить(ТекстЗапроса.ПолучитьТекст(), Символы.НПП, " ");
	ТекстЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(Объект.ТекстЗапроса));
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПараметры(Команда)
    ЗаполнитьПараметрыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаСервере()
    Запрос = Новый Запрос(Объект.ТекстЗапроса);	
	
	Попытка
		мПараметрыЗапроса = Запрос.НайтиПараметры();
    Исключение
        ИА_БФКС.СообщениеОбОшибке(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Для Каждого ПараметрЗапроса Из мПараметрыЗапроса Цикл
		
		ИмяПараметра =  ПараметрЗапроса.Имя;
		М = СписокПараметров.НайтиСтроки(Новый Структура("ИмяПараметра", ИмяПараметра));
        Если М.Количество() > 0 Тогда
            СтрокаПараметров = М[0];
        Иначе
        	СтрокаПараметров = СписокПараметров.Добавить();
            СтрокаПараметров.ИмяПараметра = ИмяПараметра;
        КонецЕсли; 
		СтрокаПараметров.Значение = ПараметрЗапроса.ТипЗначения.ПривестиЗначение(СтрокаПараметров.Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровПриИзменении(Элемент)
	Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.СписокПараметров.ТекущиеДанные;
	Если тд.Значение = Неопределено Тогда
		Элемент.ВыбиратьТип = Истина;
	Иначе
		Элемент.ВыбиратьТип = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровЗначениеОчистка(Элемент, СтандартнаяОбработка)
	Элемент.ВыбиратьТип = Истина;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	тзПараметры = РеквизитФормыВЗначение("СписокПараметров");
	Хранилище = Новый ХранилищеЗначения(тзПараметры);
	ТекущийОбъект.ТабПараметровЗапроса = Хранилище;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыЗапросаНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Хранилище = Об.ТабПараметровЗапроса;
	Знч = Хранилище.Получить();
	Если НЕ Знч = Неопределено Тогда
		ЗначениеВРеквизитФормы(Знч,"СписокПараметров");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьПараметрыЗапросаНаСервере();
КонецПроцедуры


