&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодДатаНачала = Параметры.ПериодДатаНачала;
	ПериодДатаОкончания = Параметры.ПериодДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВФормеДокумента(Команда)
	
	Если ПериодДатаНачала > ПериодДатаОкончания Тогда
		ПоказатьПредупреждение(Неопределено, "Дата начала периода больше даты окончания!");
		Возврат;
	Иначе
		ПараметрыЗакрытия = Новый Структура("ПериодДатаНачала, ПериодДатаОкончания", ПериодДатаНачала, ПериодДатаОкончания);
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры


