
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.Настройки;
	//#14828
	ОтчетыПотолки.НастроитьОтображениеГруппировкиПодразделение(Настройки);
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	КлючВарианта = Неопределено;	
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючВарианта", КлючВарианта);
	
	Если КлючВарианта = "ДоходыРасходы" Тогда
		// выводим вторую диаграмму в зависимости от вывода первой диаграммы (имя параметра задается через "Свойства элемента пользовательских настроек" первой диаграмммы)
		ЭтоПерваяДиаграмма = Истина;
		ПризнакИспользования = Истина;
		Для каждого ЭлементСтруктуры Из НастройкиОтчета.Структура Цикл
			Если ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
				Если ЭтоПерваяДиаграмма Тогда
					ЭтоПерваяДиаграмма = Ложь;
					ПризнакИспользования = ЭлементСтруктуры.Использование;
				Иначе
					ЭлементСтруктуры.Использование = ПризнакИспользования;
				КонецЕсли;			
			КонецЕсли;
		КонецЦикла;
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	
	ИначеЕсли КлючВарианта = "ДинамикаДоходовРасходов" Тогда
		
		ПолеПериодичность = Новый ПараметрКомпоновкиДанных("Периодичность"); 
		ПараметрПериодичность = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы.Найти(ПолеПериодичность);
		//ПараметрПериодичность = Неопределено;
		//Для каждого ЭлементНастройки из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		//	Попытка
		//		Если ЭлементНастройки.Параметр = ПолеПериодичность Тогда
		//			ПараметрПериодичность = ЭлементНастройки;
		//		КонецЕсли;
		//	Исключение
		//	конецПопытки;
		//КонецЦикла;
		
		Если ПараметрПериодичность = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ПараметрПериодичность.Использование Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПараметрПериодичность.Значение) Тогда
			ПараметрПериодичность.Значение = Перечисления.Периодичность.Месяц;
		КонецЕсли;
		
		ИскомоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ДинамическийПериод");
		
		Если ИскомоеПоле = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаДлительностьПериода = ОбщегоНазначения.ИмяЗначенияПеречисления(ПараметрПериодичность.Значение);
		ИскомоеПоле.Выражение = "Период" + СтрокаДлительностьПериода;
		ИскомоеПоле.Заголовок = СтрокаДлительностьПериода;
		
		ПараметрОформленияФормат = ИскомоеПоле.Оформление.Элементы.Найти("Формат");
		ПараметрОформленияФормат.Значение = МодульОтчетов.ФорматнаяСтрокаДинамическогоПериода(ПараметрПериодичность.Значение);
		ПараметрОформленияФормат.Использование = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
