// Форма вызывается из:
// Документ.НачислениеЗарплаты.ФормаДокумента
// Документ.ЗаявкаНаРасходованиеДенежныхСредств.ФормаДокумента
// Документ.РасходныйКассовыйОрдер.ФормаДокумента

////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ОбработкаОжидания()
	
	Для каждого ВыделеннаяДата Из Элементы.ДатаКалендаря.ВыделенныеДаты Цикл
		
		ДатаКалендаря = ВыделеннаяДата;
		
	КонецЦикла;
	
	ОповеститьОВыборе(ДатаКалендаря);
	
КонецПроцедуры // ОбработкаОжидания()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДатаКалендаря", ДатаКалендаря)
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ДатаКалендаряПриАктивизацииДаты(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработкаОжидания", 0.2, Истина);
	
КонецПроцедуры // ДатаКалендаряПриАктивизацииДаты()



