
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ДвДанные = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьШаблонИнструкции();
	Если ДвДанные = Неопределено Тогда
		Режим = РежимДиалогаВыбораФайла.Открытие;
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
		ДиалогОткрытияФайла.ПолноеИмяФайла = "";
		Фильтр = "MS Word(*.doc)|*.doc";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = "Выберите файл с шаблоном";
		Если Не ДиалогОткрытияФайла.Выбрать() Тогда
			Возврат;	
		КонецЕсли;
		
		ДвДанные = Новый ДвоичныеДанные(ДиалогОткрытияФайла.ПолноеИмяФайла);
		
	КонецЕсли;
	
	ВрКат = КаталогВременныхФайлов()+"ksu_template\";
	СоздатьКаталог(ВрКат);
	ПолныйПутьДокФайл = ВрКат + "templateInstr.doc";
	ДвДанные.Записать(ПолныйПутьДокФайл);
	
	ЗапуститьПриложение(ПолныйПутьДокФайл);
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ВрКат, ПолныйПутьДокФайл", ВрКат, ПолныйПутьДокФайл)), "Когда закончите редактирование и закроете редактор, нажмите ОК для принятия изменений или Отмена, для отказа от изменений.", РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВрКат = ДополнительныеПараметры.ВрКат;
	ПолныйПутьДокФайл = ДополнительныеПараметры.ПолныйПутьДокФайл;
	
	
	Если РезультатВопроса=КодВозвратаДиалога.ОК Тогда
		ДвДанные = Новый ДвоичныеДанные(ПолныйПутьДокФайл);
		УстановитьШаблон(ДвДанные);
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ВрКат);
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура УстановитьШаблон(ДвДанные)
	Константы.ИА_ДИ_Шаблон.Установить(Новый ХранилищеЗначения(ДвДанные));
КонецПроцедуры