
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредставлениеВидаНоменклатурыПолотно = ОбщийМодульСервер.ПолучитьПредствлениеВидаНоменклатурыПолотноДляКонтроляМатериалов();
	
	УстановитьУсловноеОформление();
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Проверки при проведении
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		// Проверка на задвоение вида номенклатуры
		ВремТаблица = Объект.ВидНоменклатуры.Выгрузить();
		
		ВремТаблица.Колонки.Добавить("Количество");
		ВремТаблица.ЗаполнитьЗначения(1, "Количество");
		
		ВремТаблица.Свернуть("ВидНоменклатуры", "Количество");
		
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			
			Если ТекущаяСтрока.Количество > 1 Тогда
				
				Сообщить(СтрШаблон("В таблице ""Вид номенклатуры"" задвоены записи по виду ""%1""",
					?(ТекущаяСтрока.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно, ПредставлениеВидаНоменклатурыПолотно, ТекущаяСтрока.ВидНоменклатуры))
				);
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Проверка на задвоение номенклатуры
		ВремТаблица = Объект.Номенклатура.Выгрузить();
		
		ВремТаблица.Колонки.Добавить("Количество");
		ВремТаблица.ЗаполнитьЗначения(1, "Количество");
		
		ВремТаблица.Свернуть("Номенклатура", "Количество");
		
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			
			Если ТекущаяСтрока.Количество > 1 Тогда
				
				Сообщить(СтрШаблон("В таблице ""Номенклатура"" задвоены записи по %1 ""%2""",
					?(ЭтоГруппаНоменклатуры(ТекущаяСтрока.Номенклатура), "группе", "номенклатуре"),
					ТекущаяСтрока.Номенклатура)
				);
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	// в ТЧ "Вид номенклатуры" для вида "Полотно" изменим текстовку
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВидНоменклатурыВидНоменклатуры.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидНоменклатуры.ВидНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.ВидыНоменклатуры.Полотно;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ПредставлениеВидаНоменклатурыПолотно);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ВидНоменклатурыВидНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = новый СписокЗначений;
	
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Полотно"), ПредставлениеВидаНоменклатурыПолотно);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Номенклатура.ТекущиеДанные;
	
	Если НЕ ЭтоГруппаНоменклатуры(ТекущиеДанные.Номенклатура) Тогда
		ТекущиеДанные.ПопозиционныйКонтроль = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУмолчаниюВидНоменклатуры(Команда)
	
	Если Объект.ВидНоменклатуры.Количество() > 0 Тогда
		
		ОписаниеОповещения = новый ОписаниеОповещения("ЗаполнитьПоУмолчаниюВидНоменклатурыФрагмент", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Табличная часть ""Вид номенклатуры"" не пустая, при продолжении будет очищена.
			|Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаполнитьПоУмолчаниюВидНоменклатурыЗавершение()
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчаниюВидНоменклатурыФрагмент(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоУмолчаниюВидНоменклатурыЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчаниюВидНоменклатурыЗавершение()
	
	Объект.ВидНоменклатуры.Очистить();
	
	МассивВидовНоменклатуры = новый Массив;
	МассивВидовНоменклатуры.Добавить(ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция"));
	МассивВидовНоменклатуры.Добавить(ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"));
	МассивВидовНоменклатуры.Добавить(ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Полотно"));
	
	Для Каждого ВидНоменклатуры Из МассивВидовНоменклатуры Цикл
		
		НоваяСтрока = Объект.ВидНоменклатуры.Добавить();
		
		НоваяСтрока.ВидНоменклатуры = ВидНоменклатуры;
		
		// ставим все галочки
		НоваяСтрока.КонтролироватьВыработку 	= Истина;
		НоваяСтрока.КонтролироватьКоличество 	= Истина;
		НоваяСтрока.ПопозиционныйКонтроль 		= Истина;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЭтоГруппаНоменклатуры(Номенклатура)
	
	Возврат Номенклатура.ЭтоГруппа;
	
КонецФункции


#КонецОбласти

