
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыСеанса.ОграничиватьПереченьДоступныхКатегорийКонтрагентов Тогда
		//если у пользователя стоит ограничение по виду цен, покажем только доступные ему виды цен
		ДоступныеКатегории = Новый Массив;
		ЗапросДоступныеКатегории = Новый Запрос;
		ЗапросДоступныеКатегории.Текст = 
		"ВЫБРАТЬ
		|	ДоступныеКатегорииКонтрагентов.Категория.Ссылка КАК Ссылка,
		|	ДоступныеКатегорииКонтрагентов.Категория.Код КАК Код
		|ИЗ
		|	Справочник.Пользователи.ДоступныеКатегорииКонтрагентов КАК ДоступныеКатегорииКонтрагентов
		|ГДЕ
		|	ДоступныеКатегорииКонтрагентов.Ссылка = &ТекущийПользователь";
		ЗапросДоступныеКатегории.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
		
		Выборка = ЗапросДоступныеКатегории.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДоступныеКатегории.Добавить(Выборка.ССылка);
		КонецЦикла;
		
		Список.ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КатегорииКонтрагентов.Ссылка,
		|	КатегорииКонтрагентов.ПометкаУдаления,
		|	КатегорииКонтрагентов.Код,
		|	КатегорииКонтрагентов.Наименование,
		|	КатегорииКонтрагентов.ВидЦен,
		|	КатегорииКонтрагентов.Предопределенный,
		|	КатегорииКонтрагентов.ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.КатегорииКонтрагентов КАК КатегорииКонтрагентов
		|ГДЕ
		|	КатегорииКонтрагентов.Ссылка В ИЕРАРХИИ(&ДоступныеКатегории)";
		Список.Параметры.УстановитьЗначениеПараметра("ДоступныеКатегории", ДоступныеКатегории);
		Список.ОсновнаяТаблица = "Справочник.КатегорииКонтрагентов";
		
	КонецЕсли;
	
КонецПроцедуры
