#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	//#13035
	ВедутсяРасчетыПоДокументу = Константы.ВестиРасчетыПоЗаказамПоЗаказДоговору.Получить();
	Элементы.СостояниеОплаты.Видимость = ВедутсяРасчетыПоДокументу;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаСписка(ЭтотОбъект, Элементы.Список);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	// колонки пока убраны
	//Элементы.СтатусЗаказаРозницыНаПроизводство.Видимость = ПолучитьФункциональнуюОпцию("ОбеспеченностьРозницыПоЗаказДоговорам");
	//Элементы.СтатусЗаказаРозницыПоставщикам.Видимость    = ПолучитьФункциональнуюОпцию("ОбеспеченностьРозницыПоЗаказДоговорам");
	
	// отборы заказ-договоров
	Элементы.ЗаказДоговорОтборПоПодразделению.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	СписокЗаказДоговоровТекстЗапроса = Список.ТекстЗапроса;
	ЗаказДоговорОтборПоОплате = -9;
	ЗаказДоговорОтборПоПозициямВМонтажах = -9;
	ЗаказДоговорОтборПоВыполнениюМонтажей = -9;
	УстановитьОтборЗаказДоговоров();
	
	//#16281: на форме списка документов "Заказ-договор" убрать все поля быстрых фильтров
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытаФормаМонтажа" и Источник = "Монтаж" Тогда
		Элементы.Список.Обновить();
		
	ИначеЕсли ИмяСобытия = "Запись_ДокументОплаты" Тогда
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаСписка(ИмяСобытия, ЭтотОбъект, Элементы.Список);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриПолученииДанныхНаСервере(Строки); 
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	МассивСсылок = Строки.ПолучитьКлючи();
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//КэшКолонок = Новый Структура;
	//СтрокаДС = Строки.Получить(МассивСсылок[0]);
	//КэшКолонок.Вставить("ЕстьКолонкаСостояниеОтгрузки",  СтрокаДС.Данные.Свойство("СостояниеОтгрузки"));
	
	// когда ЕстьОтборПо..., то заменяется текст запроса и колонка вычисляется в запросе
	ЕстьОтборПоСостояниюВыполненияМонтажей = Настройки.ДополнительныеСвойства.Свойство("ОтборПоСостояниюВыполненияМонтажей") И НЕ Настройки.ДополнительныеСвойства.ОтборПоСостояниюВыполненияМонтажей = -9;
	ЕстьОтборПоСостояниюПозицийВМонтажах = Настройки.ДополнительныеСвойства.Свойство("ОтборПоСостояниюПозицийВМонтажах") И НЕ Настройки.ДополнительныеСвойства.ОтборПоСостояниюПозицийВМонтажах = -9;

	КэшКолонок = Новый Структура;
	СтрокаДС = Строки.Получить(МассивСсылок[0]);
	КэшКолонок.Вставить("ЕстьКолонкаСтатусЗаказаРозницыНаПроизводство", СтрокаДС.Данные.Свойство("СтатусЗаказаРозницыНаПроизводство"));
	КэшКолонок.Вставить("ЕстьКолонкаСтатусЗаказаРозницыПоставщикам", СтрокаДС.Данные.Свойство("СтатусЗаказаРозницыПоставщикам"));
	
	КэшКолонок.Вставить("ЕстьКолонкаСостояниеВыполненияМонтажей", СтрокаДС.Данные.Свойство("СостояниеВыполненияМонтажей") И НЕ ЕстьОтборПоСостояниюВыполненияМонтажей);	
	КэшКолонок.Вставить("ЕстьКолонкаСостояниеПозицийВМонтажах", СтрокаДС.Данные.Свойство("СостояниеПозицийВМонтажах") И НЕ ЕстьОтборПоСостояниюПозицийВМонтажах);	
		
	ОбщийМодульСервер.РозницаПриПолученииДанныхНаСервере(Строки, "ЗаказДоговор", КэшКолонок);

	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	//Запрос.Текст =
	//
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ДанныеДокумента.Ссылка КАК Ссылка,
	//|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	//|ПОМЕСТИТЬ ВТ_Заказы
	//|ИЗ
	//|	Документ.ЗаказДоговор КАК ДанныеДокумента
	//|ГДЕ
	//|	ДанныеДокумента.Ссылка В(&МассивСсылок)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ДанныеРегистра.Заказ КАК Ссылка,
	//|	ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) КАК Оплачено,
	//|	ЕСТЬNULL(ДанныеРегистра.СуммаПриход, 0) - ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) КАК КОплате,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) = 0
	//|				ИЛИ ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) = 0
	//|			ТОГДА 2
	//|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) = ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0)
	//|				И ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) > 0
	//|			ТОГДА 0
	//|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) < ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0)
	//|				И ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) > 0
	//|			ТОГДА 7
	//|		ИНАЧЕ 1
	//|	КОНЕЦ КАК СостояниеОплаты
	//|ИЗ
	//|	ВТ_Заказы КАК ВТ_Заказы
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Обороты(, , , Заказ В (&МассивСсылок)) КАК ДанныеРегистра
	//|		ПО ВТ_Заказы.Ссылка = ДанныеРегистра.Заказ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ДанныеРегистра.ЗаказНаПроизводство КАК Ссылка,
	//|	ВЫБОР
	//|		КОГДА ДанныеРегистра.КоличествоРасход = 0
	//|			ТОГДА 2
	//|		КОГДА ДанныеРегистра.КоличествоПриход > 0
	//|				И ДанныеРегистра.КоличествоРасход = ДанныеРегистра.КоличествоПриход
	//|			ТОГДА 0
	//|		ИНАЧЕ 1
	//|	КОНЕЦ КАК СостояниеОтгрузки
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , , ЗаказНаПроизводство В (&МассивСсылок)) КАК ДанныеРегистра";
	//РезультатЗапроса = Запрос.ВыполнитьПакет();
	//
	////Если КэшКолонок.ЕстьКолонкаСостояниеОплаты Тогда
	////	ВыборкаОплачено = РезультатЗапроса[1].Выбрать();
	////	Пока ВыборкаОплачено.Следующий() Цикл
	////		СтрокаСписка = Строки[ВыборкаОплачено.Ссылка];
	////		СтрокаСписка.Данные["СостояниеОплаты"] = ВыборкаОплачено.СостояниеОплаты;
	////	КонецЦикла;
	////КонецЕсли;
	//	
	//Если КэшКолонок.ЕстьКолонкаСостояниеОтгрузки Тогда
	//	ВыборкаОтгружено = РезультатЗапроса[2].Выбрать();
	//	Пока ВыборкаОтгружено.Следующий() Цикл
	//		СтрокаСписка = Строки[ВыборкаОтгружено.Ссылка];
	//		СтрокаСписка.Данные["СостояниеОтгрузки"] = ВыборкаОтгружено.СостояниеОтгрузки;
	//	КонецЦикла;
	//	
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.СписокВыбор(Поле.Имя, ЭтотОбъект, Элементы.Список, СтандартнаяОбработка);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗаказКлиента(Команда)
	
	ОбщийМодульКлиент.СоздатьЗаказКлиента(Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ПоляОтборов

&НаКлиенте
Процедура ЗаказДоговорОтборПоПодразделениюПриИзменении(Элемент)
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоКонтрагентуПриИзменении(Элемент)
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоВидуПриИзменении(Элемент)
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоСтатусуПриИзменении(Элемент)
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоМенеджеруПриИзменении(Элемент)
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрДоговорыРассрочки(Команда)
	
	ЗаказДоговорОтборРассрочки = НЕ ЗаказДоговорОтборРассрочки;
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФильтраДоговорыВсе(Команда)
		
	//ФильтрДоговорыТребуетсяДополнительныйМонтаж = Ложь;
	ЗаказДоговорОтборРассрочки = Ложь;
	//ФильтрДоговорыМонтажНеНазначен = Ложь;
	//ФильтрДоговорыМонтажНазначен = Ложь;
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоОплатеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаказДоговорОтборПоОплате = -9;
	
	ЗаказДоговорОтборПоОплатеПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоОплатеПриИзменении(Элемент)
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоВыполнениюМонтажейПриИзменении(Элемент)
	
	ЗаказДоговорОсобыйОтборПриИзмененииНаСервере();	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоВыполнениюМонтажейОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаказДоговорОтборПоВыполнениюМонтажей = -9;
	
	ЗаказДоговорОтборПоВыполнениюМонтажейПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоПозициямВМонтажахПриИзменении(Элемент)
	
	ЗаказДоговорОсобыйОтборПриИзмененииНаСервере();	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоПозициямВМонтажахОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаказДоговорОтборПоПозициямВМонтажах = -9;
	
	ЗаказДоговорОтборПоПозициямВМонтажахПриИзменении(Элемент);
	
КонецПроцедуры

// #14593 группа отборов, требующих подмены текста запроса Динамического списка "ЗаказДоговоры"
&НаСервере
Процедура ЗаказДоговорОсобыйОтборПриИзмененииНаСервере()
			
	ПоляОтбора = Новый Структура;  
	ПоляОтбора.Вставить("ЗаказДоговорОтборПоВыполнениюМонтажей", ЗаказДоговорОтборПоВыполнениюМонтажей);
	ПоляОтбора.Вставить("ЗаказДоговорОтборПоПозициямВМонтажах", ЗаказДоговорОтборПоПозициямВМонтажах);

	ОбщийМодульСервер.ЗаказДоговорОсобыйОтборПриИзменении(Список, СписокЗаказДоговоровТекстЗапроса, ПоляОтбора);
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
&НаКлиенте
Процедура Подключаемый_ОбновитьКомандыСостоянияОригинала()
    
    ОбновитьКомандыСостоянияОригинала()
   
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомандыСостоянияОригинала()
    
	// Код из обработчика события ПриСозданииНаСервере этой формы по подключению команд
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры
//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Нет отбора по оплатам";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоОплате");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоОплате");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -9;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Нет отбора по позициям заказа в монтажах";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоПозициямВМонтажах");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоПозициямВМонтажах");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -9;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Нет отбора по выполнению монтажей";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоВыполнениюМонтажей");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоВыполнениюМонтажей");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -9;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборЗаказДоговоров()
	
	ЗаказДоговоры = Список;
	
	ЗаказДоговоры.Отбор.Элементы.Очистить();
	
	//Элементы.ФильтрДоговорыДопМонтаж.Пометка = ФильтрДоговорыТребуетсяДополнительныйМонтаж;
	Элементы.ФильтрДоговорыРассрочки.Пометка = ЗаказДоговорОтборРассрочки;
	//Элементы.УстановкаФильтраДоговорыМонтажНеНазначен.Пометка = ФильтрДоговорыМонтажНеНазначен;
	//Элементы.УстановкаФильтраДоговорыМонтажНазначен.Пометка = ФильтрДоговорыМонтажНазначен;	
	//
	//Если ФильтрДоговорыМонтажНазначен 
	//	ИЛИ ФильтрДоговорыМонтажНеНазначен 
	//	ИЛИ ФильтрДоговорыТребуетсяДополнительныйМонтаж Тогда
	//	
	//	ЗаказДоговорОтборПоСтатусу = Справочники.СтатусыЗаказДоговоров.ВРаботе;
	//КонецЕсли;
	//								
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
	//		"ТребуетсяДополнительныйМонтаж", ФильтрДоговорыТребуетсяДополнительныйМонтаж, ВидСравненияКомпоновкиДанных.Равно,, ФильтрДоговорыТребуетсяДополнительныйМонтаж);
	//
	//Если ФильтрДоговорыМонтажНеНазначен Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
	//		"СтатусЗаказаРозницыМонтаж", 0, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	//ИначеЕсли ФильтрДоговорыМонтажНазначен Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
	//		"СтатусЗаказаРозницыМонтаж", 1, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	//Иначе
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
	//		"СтатусЗаказаРозницыМонтаж", -1, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	//КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"Подразделение", ЗаказДоговорОтборПоПодразделению, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЗаказДоговорОтборПоПодразделению.Пустая());										
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"Контрагент", ЗаказДоговорОтборПоКонтрагенту, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЗаказДоговорОтборПоКонтрагенту.Пустая());
	
	//#16242
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"ВидЗаказа", ЗаказДоговорОтборПоВиду, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЗаказДоговорОтборПоВиду.Пустая());
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"ТекущийСтатус", ЗаказДоговорОтборПоСтатусу, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЗаказДоговорОтборПоСтатусу.Пустая());										
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"Менеджер", ЗаказДоговорОтборПоМенеджеру, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЗаказДоговорОтборПоМенеджеру.Пустая());
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"СостояниеОплаты", ЗаказДоговорОтборПоОплате, ВидСравненияКомпоновкиДанных.Равно,, ЗаказДоговорОтборПоОплате >= -1);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"ЭтоРассрочка", ЗаказДоговорОтборРассрочки, ВидСравненияКомпоновкиДанных.Равно,, ЗаказДоговорОтборРассрочки);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"СостояниеВыполненияМонтажей", ЗаказДоговорОтборПоВыполнениюМонтажей, ВидСравненияКомпоновкиДанных.Равно,, ЗаказДоговорОтборПоВыполнениюМонтажей >= -1);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"СостояниеПозицийВМонтажах", ЗаказДоговорОтборПоПозициямВМонтажах, ВидСравненияКомпоновкиДанных.Равно,, ЗаказДоговорОтборПоПозициямВМонтажах >= -1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйРасчет(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ЗаказДоговор", Элементы.Список.ТекущаяСтрока);
	ОткрытьФорму("Отчет.ПредварительнаяСебестоимостьЗаказДоговора.ФормаОбъекта", ПараметрыОтчета);
КонецПроцедуры

#КонецОбласти
