
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая() Тогда
		//#15983
		//Элементы.ДекорацияВалюта.Заголовок = "";
		Валюта = Константы.ВалютаУчета.Получить();
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИспользуетсяПериодРегистрации = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();
	ОтображениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	Элементы.ОтображениеПериодаРегистрации.Видимость = ИспользуетсяПериодРегистрации;
	
	ГруппировкаПоВидуНачисления = Истина;
	ГруппировкаПоВидуНачисленияНастройка = ХранилищеОбщихНастроек.Загрузить("ДокументНачислениеЗарплаты", "ГруппировкаПоВидуНачисления");
	Если НЕ ГруппировкаПоВидуНачисленияНастройка = Неопределено Тогда
		ГруппировкаПоВидуНачисления = ГруппировкаПоВидуНачисленияНастройка;
	КонецЕсли;
	Элементы.ДеревоНачисленийГруппировкаПоВидуНачисления.Пометка = ГруппировкаПоВидуНачисления;
	Элементы.ДеревоНачисленийВидНачисления.Видимость  = ГруппировкаПоВидуНачисления;
	Элементы.ДеревоНачисленийВидНачисления1.Видимость = НЕ ГруппировкаПоВидуНачисления;	
	
	ЗагрузитьТабличнуюЧастьВДерево();
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

	ФинансыСервер.УстановитьОтметкуНезаполненныхСтатейДоходовРасходов(Элементы);
	
	//++ №9919
	Если НЕ Объект.СлужебныйИспользоватьНачислениеЗаработнойПлатыНаОснованииМонтажа Тогда
		
		ТипыОснования = Метаданные.Документы.НачислениеЗарплаты.Реквизиты.Основание.Тип;
		Элементы.Основание.ОграничениеТипа = новый ОписаниеТипов(ТипыОснования,, "ДокументСсылка.Монтаж");
		
	КонецЕсли;
	//-- №9919
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
	// вызов оставлять последним	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ОбновитьСуммуИНадписьНачисления();
	РассчитатьСуммыСтрокИДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И СтрНайти(ИсточникВыбора.ИмяФормы, "ФормаКалендаря") > 0 Тогда
		
		Объект.ПериодРегистрации 		= НачалоМесяца(ВыбранноеЗначение);
		ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПоместитьНачисленияВТабличнуюЧасть(ТекущийОбъект);
	
	// проверяем заполненность статей доходов/расходов
	ФинансыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// #14544 на случай если включат данную настройку, чтобы в документе был корректный период = дате документа
	Если НЕ ИспользуетсяПериодРегистрации И ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРегистрации = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), 
							ДобавитьМесяц(Объект.ПериодРегистрации, Направление),
							ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), Направление));							
	Объект.ПериодРегистрации 		= НачалоМесяца(Объект.ПериодРегистрации);
	ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	 = Ложь;	
	ДатаКалендаряПриОткрытии = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), Объект.ПериодРегистрации, ТекущаяДата());
	СтруктураПараметров 	 = Новый Структура("ДатаКалендаря, ЗакрыватьПриВыборе, МножественныйВыбор", ДатаКалендаряПриОткрытии, Истина, Ложь);
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьСписаниеСРасчетногоСчета(Команда)
	
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Документ предварительно должен быть записан!");	
	КонецЕсли;
	
	Если Объект.ЗарплатныйПроект Тогда
		//один документ списание с р/с
		ПараметрыЗаполнения = новый Структура;
		ПараметрыЗаполнения.Вставить("Ссылка", Объект.Ссылка);			
		
		ПараметрыФормы = новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
		ОткрытьФорму("Документ.СписаниеСРасчетногоСчета.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
	Иначе
		//на каждого сотрудника свой документ списание с р/с
		СоздатьСписаниеСРасчетногоСчетаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСписаниеСРасчетногоСчетаНаСервере()
	ВременнаяТаблица = Новый ТаблицаЗначений;
	ВременнаяТаблица.Колонки.Добавить("Сотрудник");	
	ВременнаяТаблица.Колонки.Добавить("Сумма");
	ВременнаяТаблица.Колонки.Добавить("Валюта");
	
	Для Каждого ТекущаяСтрока Из Объект.Начисление Цикл
		НоваяСтрока = ВременнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	ВременнаяТаблица.Свернуть("Сотрудник, Валюта", "Сумма");
	
	Для Каждого ТекСотрудник Из ВременнаяТаблица Цикл
		Если ТекСотрудник.Сотрудник.Пустая() Тогда
			Сообщить("В строке " + ТекСотрудник.НомерСтроки + " не заполнен сотрудник, документ списание с р/с для него создан не будет!");
			Продолжить;
		КонецЕсли;	
		НовыйДокумент = Документы.СписаниеСРасчетногоСчета.СоздатьДокумент();
		НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику;
		НовыйДокумент.Основание = Объект.Ссылка;
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.Организация = Объект.Организация;
		НовыйДокумент.Подразделение = Объект.Подразделение; // №12857
		НовыйДокумент.Валюта = ТекСотрудник.Валюта;
		НовыйДокумент.Контрагент = ТекСотрудник.Сотрудник;
		НовыйДокумент.СчетКонтрагента = ФинансыСервер.ПолучитьСчетСотрудника(ТекСотрудник.Сотрудник);
		НовыйДокумент.Сумма = ТекСотрудник.Сумма;
		НовыйДокумент.ОчередностьПлатежа = 3;
		НовыйДокумент.ПериодРегистрации = Объект.ПериодРегистрации;
		Попытка
			НовыйДокумент.Записать();
			Сообщить("Создан и записан документ списание с р/с для сотрудника " + ТекСотрудник.Сотрудник);
		Исключение	
			Сообщить(ОписаниеОшибки());
		КонецПопытки;	
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область УДАЛИТЬ_ОбработчикиЭлементовТаблицыНачислений

&НаКлиенте
Процедура НачислениеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Начисление.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.Валюта.Пустая() тогда
			ТекущиеДанные.Валюта = ПолучитьВалютуУчета();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеСуммаПриИзменении(Элемент)
	ОбновитьСуммуИНадписьНачисления();
КонецПроцедуры

&НаКлиенте
Процедура НачислениеВалютаПриИзменении(Элемент)
	ОбновитьСуммуИНадписьНачисления();
КонецПроцедуры

&НаКлиенте
Процедура НачислениеПослеУдаления(Элемент)
	ОбновитьСуммуИНадписьНачисления();
КонецПроцедуры

#КонецОбласти

#Область УДАЛИТЬ_СлужебныеПроцедурыТаблицаНачислений

&НаКлиенте
Процедура ОбновитьСуммуИНадписьНачисления()
		
	ОбновитьСуммуКНачислению();	
	ОбновитьНадписьВалюты(); 
	
КонецПроцедуры

//Сумма к начислению высчитывается если валюта во всех строках задана одинаковая. 
//Если хотя бы одна строка отличается - Сумма не выводится.
&НаСервере
Процедура ОбновитьСуммуКНачислению()
	
	//Проверим, все ли валюты одинаковы
	Если Объект.Начисление.Количество() = 0 Тогда		
		СуммаКНачислению = 0;
		Возврат;
	КонецЕсли;
		
	//Сравниваем валюты всех строк с валютой первой строки.	
	ВалютаОдинаковая = Истина;
	Для Каждого СтрокаТаблицы из Объект.Начисление Цикл
		Если не СтрокаТаблицы.Валюта = Объект.Начисление[0].Валюта Тогда 
			ВалютаОдинаковая = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	//Если валюты одинаковые, вычисляем сумму и обновляем надпись 
	//если не одинаковые, сумму обнуляем, обработку прирываем
	Если ВалютаОдинаковая Тогда 
		СуммаКНачислению = Объект.Начисление.Итог("Сумма");		
	Иначе				
		СуммаКНачислению = 0;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьВалюты()
	Если СуммаКНачислению = 0 Тогда 
		Элементы.СуммаКНачислению.Видимость = Ложь;
		Элементы.ДекорацияВалюта.Заголовок = "";
	Иначе
		Элементы.ДекорацияВалюта.Заголовок = Объект.Начисление[0].Валюта;
		Элементы.СуммаКНачислению.Видимость = Истина;		
	КонецЕсли;  	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуУчета()
	Возврат Константы.ВалютаУчета.Получить();
КонецФункции

#КонецОбласти

#Область ОбработчикиЭлементовДереваНачислений

&НаКлиенте
Процедура ДеревоНачисленийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("Валюта", ОбщийМодульВызовСервера.ВалютаУчета());
	Если Копирование Тогда
		Если ТекущиеДанные = Неопределено Тогда
			//
		ИначеЕсли ТекущиеДанные.Уровень = 1 Тогда
			ПараметрыФормы.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
			
		ИначеЕсли ТекущиеДанные.Уровень = 2 Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.Валюта) Тогда
				ПараметрыФормы.Вставить("Валюта", ТекущиеДанные.Валюта);
			КонецЕсли;
			Если ГруппировкаПоВидуНачисления Тогда
				ПараметрыФормы.Вставить("ВидНачисления", ТекущиеДанные.ВидНачисления);
				СотрудникЭлемента = ТекущиеДанные.ПолучитьРодителя();
				ПараметрыФормы.Вставить("Сотрудник", СотрудникЭлемента.Сотрудник);
			Иначе
				СотрудникЭлемента = ТекущиеДанные.ПолучитьРодителя();
				ПараметрыФормы.Вставить("Сотрудник", СотрудникЭлемента.Сотрудник);
			КонецЕсли;
			
		ИначеЕсли ТекущиеДанные.Уровень = 3 Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.Валюта) Тогда
				ПараметрыФормы.Вставить("Валюта", ТекущиеДанные.Валюта);
			КонецЕсли;
			ВидНачисленияЭлемента = ТекущиеДанные.ПолучитьРодителя();
			ПараметрыФормы.Вставить("ВидНачисления", ВидНачисленияЭлемента.ВидНачисления);		
			СотрудникЭлемента = ВидНачисленияЭлемента.ПолучитьРодителя();
			ПараметрыФормы.Вставить("Сотрудник", СотрудникЭлемента.Сотрудник);
			
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДеревоНачисленийПередНачаломДобавленияЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.НачислениеЗарплаты.Форма.ФормаДобавленияСтроки", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНачисленийПередНачаломДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Валюта = ДополнительныеПараметры;
	
	Если ГруппировкаПоВидуНачисления Тогда
		СтрокаСотрудникДобавление 		= НайтиСтрокуДереваПоЗначениюПоля(ДеревоНачислений, 		 	 "Сотрудник", 	  Результат.Сотрудник, 1);
		СтрокаВидНачисленияДобавление 	= НайтиСтрокуДереваПоЗначениюПоля(СтрокаСотрудникДобавление, 	 "ВидНачисления", Результат.ВидНачисления, 2);
		СтрокаДокументДобавление 	    = НайтиСтрокуДереваПоЗначениюПоля(СтрокаВидНачисленияДобавление, "ОбъектВыработки", Результат.ОбъектВыработки, 3);
	Иначе
	    СтрокаСотрудникДобавление 		= НайтиСтрокуДереваПоЗначениюПоля(ДеревоНачислений, 		 	 "Сотрудник", 	  Результат.Сотрудник, 1);
		//СтрокаДокументДобавление 	    = НайтиСтрокуДереваПоЗначениюПоля(СтрокаСотрудникДобавление, 	 "ОбъектВыработки", Результат.ОбъектВыработки, 2);
		СтрокаДокументДобавление        = СтрокаСотрудникДобавление.ПолучитьЭлементы().Добавить();
		СтрокаДокументДобавление.ОбъектВыработки = Результат.ОбъектВыработки;
		СтрокаДокументДобавление.Уровень = 2;
	КонецЕсли;
	СтрокаДокументДобавление.Сумма  = Результат.Сумма; 
	СтрокаДокументДобавление.Валюта = Результат.Валюта;
	СтрокаДокументДобавление.ВидНачисления = Результат.ВидНачисления;
	
	РассчитатьСуммыСтрокИДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНачисленийПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УровеньУдаляемойСтроки = ТекущиеДанные.Уровень;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНачисленийПослеУдаления(Элемент)
	
	ТекущиеДанные = Элемент.Текущиеданные;
	Если ТекущиеДанные = Неопределено Тогда 
		РассчитатьСуммыСтрокИДокумента();
		Возврат;
	КонецЕсли;
	
	УровеньТекущейСтроки = ТекущиеДанные.Уровень; // если 1,2 то удаляем все что выше
	Если УровеньУдаляемойСтроки = УровеньТекущейСтроки Тогда
		РассчитатьСуммыСтрокИДокумента();
		Возврат;		
	КонецЕсли;

	ИдентификаторСтроки = Элемент.ТекущаяСтрока;
	ТекущаяСтрока       = ДеревоНачислений.НайтиПоИдентификатору(ИдентификаторСтроки);	
	
	Если (УровеньТекущейСтроки <= 2 И ГруппировкаПоВидуНачисления)
		ИЛИ (УровеньТекущейСтроки <= 1 И НЕ ГруппировкаПоВидуНачисления) Тогда
		СтрокаРодитель = ТекущиеДанные;
		
		Пока НЕ СтрокаРодитель = Неопределено Цикл
			
			СтрокаРодитель      = ТекущаяСтрока.ПолучитьРодителя();			
			Если СтрокаРодитель = Неопределено Тогда
				ДеревоНачислений.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
			Иначе
				ЭлементыДерева = СтрокаРодитель.ПолучитьЭлементы();
				ЭлементыДерева.Удалить(ТекущаяСтрока);
				ТекущаяСтрока = СтрокаРодитель;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	РассчитатьСуммыСтрокИДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНачисленийВидНачисленияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоНачислений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЭлементыДокумент = ТекущиеДанные.ПолучитьЭлементы();
	Для Каждого СтрокаДокумент Из ЭлементыДокумент Цикл
		СтрокаДокумент.ВидНачисления = ТекущиеДанные.ВидНачисления;					
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНачисленийСуммаПриИзменении(Элемент)
	РассчитатьСуммыСтрокИДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНачисленийВалютаПриИзменении(Элемент)
	РассчитатьСуммыСтрокИДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачисления(Команда)
	
	//Если Объект.Начисление.Количество() > 0 Тогда
	Если ДеревоНачислений.ПолучитьЭлементы().Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбОчисткеДляЗаполненияПоПериоду", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Перед заполнением табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);	
	Иначе
	    ОткрытьФормуЗаполненияНачисления();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеДляЗаполненияПоПериоду(Результат, ДополнительныеПараметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Да Тогда
        ОткрытьФормуЗаполненияНачисления();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаполненияНачисления()
	
	Объект.Начисление.Очистить();
	
	ПараметрыФормы = Новый Структура("ПериодРегистрации", Объект.ПериодРегистрации);
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеЗакрытияФормыЗаполнить", ЭтотОбъект);
	ОткрытьФорму("Документ.НачислениеЗарплаты.Форма.ФормаЗаполненияНачисления", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗакрытияФормыЗаполнить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗаполнитьНачисленияНаСервере(Результат.ТипНачисления, Результат.ДатаС, Результат.ДатаПо);
		РассчитатьСуммыСтрокИДокумента();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНачисленияНаСервере(ТипНачисления, ДатаС, ДатаПо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Выработка.Сотрудник КАК Сотрудник,
	|	Выработка.ВидНачисления КАК ВидНачисления,
	|	Выработка.СтоимостьОборот КАК Сумма,
	//#7426
	|	Выработка.ОбъектВыработки КАК ОбъектВыработки
	|ПОМЕСТИТЬ ВТ_Выработка
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейРозницы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Выработка
	|ГДЕ
	|	&ТипНачисления = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Выработка.Сотрудник,
	|	Выработка.ВидНачисления,
	|	Выработка.СтоимостьОборот,
	//#7426
	|	Выработка.ОбъектВыработки
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейПроизводства.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Выработка
	|ГДЕ
	|	&ТипНачисления = 0
	|
	//++ №14125 комментируем, т.к. регистр больше не используется
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	Выработка.Сотрудник,
	//|	ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ШтрафЗаБрак),
	//|	-Выработка.СуммаОборот,
	////#7426
	//|	Выработка.Регистратор
	//|ИЗ
	//|	РегистрНакопления.ОтветственностьЗаБракиНаПроизводстве.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК Выработка
	//|ГДЕ
	//|	&ТипНачисления = 0
	//-- №14125
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Выработка.Сотрудник КАК Сотрудник,
	|	ВТ_Выработка.ВидНачисления КАК ВидНачисления,
	|	ВТ_Выработка.ОбъектВыработки КАК ОбъектВыработки,
	|	СУММА(ВТ_Выработка.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_Выработка КАК ВТ_Выработка
	//++ #7426
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплаты.Начисление КАК НачисленоРанее
	|		ПО (НачисленоРанее.Ссылка.Проведен)
	|			И (НачисленоРанее.Ссылка.ПериодРегистрации = &ПериодРегистрации)
	|			И (НачисленоРанее.Сотрудник = ВТ_Выработка.Сотрудник)
	|			И (НачисленоРанее.ВидНачисления = ВТ_Выработка.ВидНачисления)
	|			И (НачисленоРанее.ОбъектВыработки = ВТ_Выработка.ОбъектВыработки)
	|ГДЕ
	|	НачисленоРанее.Ссылка ЕСТЬ NULL ИЛИ &ПериодРегистрации = НЕОПРЕДЕЛЕНО
	//-- #7426
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Выработка.Сотрудник,
	|	ВТ_Выработка.ВидНачисления,
	|	ВТ_Выработка.ОбъектВыработки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Выработка.Сотрудник,
	|	ВТ_Выработка.ВидНачисления";
	
	Запрос.УстановитьПараметр("ТипНачисления", ТипНачисления);
	Если Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить() Тогда
		Запрос.УстановитьПараметр("ПериодРегистрации", Объект.ПериодРегистрации);
	Иначе
		Запрос.УстановитьПараметр("ПериодРегистрации", Неопределено);
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДатаС));
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ДатаПо));
		
	Выборка = Запрос.Выполнить().Выбрать();
	ВалютаУчета = ПолучитьФункциональнуюОпцию("ВалютаУчета");
		
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Начисление.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Валюта = ВалютаУчета;
	КонецЦикла;
	
	ЗагрузитьТабличнуюЧастьВДерево();
	
КонецПроцедуры	

&НаКлиенте
Процедура ГруппировкаПоВидуНачисления(Команда)
	ГруппировкаПоВидуНачисленияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппировкаПоВидуНачисленияНаСервере()
	
	ПоместитьНачисленияВТабличнуюЧасть(Объект);
	
	ГруппировкаПоВидуНачисления = НЕ ГруппировкаПоВидуНачисления;
	Элементы.ДеревоНачисленийГруппировкаПоВидуНачисления.Пометка = ГруппировкаПоВидуНачисления;
	ХранилищеОбщихНастроек.Сохранить("ДокументНачислениеЗарплаты", "ГруппировкаПоВидуНачисления", ГруппировкаПоВидуНачисления);
	
	Элементы.ДеревоНачисленийВидНачисления.Видимость  = ГруппировкаПоВидуНачисления;
	Элементы.ДеревоНачисленийВидНачисления1.Видимость = НЕ ГруппировкаПоВидуНачисления;
		
	ЗагрузитьТабличнуюЧастьВДерево();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыДеревоНачислений

&НаСервере
Процедура ЗагрузитьТабличнуюЧастьВДерево()
	
	ТаблицаНачислений = Объект.Начисление.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаНачислений", ТаблицаНачислений);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаНачислений.Сотрудник КАК Сотрудник,
	|	ТаблицаНачислений.ВидНачисления КАК ВидНачисления,
	|	ТаблицаНачислений.Валюта КАК Валюта,
	|	ТаблицаНачислений.ОбъектВыработки КАК ОбъектВыработки,
	|	ТаблицаНачислений.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТаблицаНачислений
	|ИЗ
	|	&ТаблицаНачислений КАК ТаблицаНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаНачислений.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаНачислений.Валюта КАК Валюта,
	|	ВТ_ТаблицаНачислений.ВидНачисления КАК ВидНачисления,
	|	ВТ_ТаблицаНачислений.ОбъектВыработки КАК ОбъектВыработки,
	|	ВТ_ТаблицаНачислений.Сумма КАК Сумма
	|ИЗ
	|	ВТ_ТаблицаНачислений КАК ВТ_ТаблицаНачислений
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	Сотрудник,
	|	ВидНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаНачислений.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаНачислений.Валюта КАК Валюта,
	|	ВТ_ТаблицаНачислений.ВидНачисления КАК ВидНачисления,
	|	ВТ_ТаблицаНачислений.ОбъектВыработки КАК ОбъектВыработки,
	|	ВТ_ТаблицаНачислений.Сумма КАК Сумма
	|ИЗ
	|	ВТ_ТаблицаНачислений КАК ВТ_ТаблицаНачислений
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	Сотрудник
	|";
	
	ЭлементыДерева = ДеревоНачислений.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если ГруппировкаПоВидуНачисления Тогда
		ВыборкаСотрудников = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСотрудников.Следующий() Цикл
			СтрокаСотрудник = ЭлементыДерева.Добавить();	
			ЗаполнитьЗначенияСвойств(СтрокаСотрудник, ВыборкаСотрудников, "Сотрудник, Сумма");
			СтрокаСотрудник.Уровень = 1;
			
			ВыборкаВидов = ВыборкаСотрудников.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ЭлементыСотрудник = СтрокаСотрудник.ПолучитьЭлементы();
			Пока ВыборкаВидов.Следующий() Цикл
				СтрокаВид = ЭлементыСотрудник.Добавить();	
				ЗаполнитьЗначенияСвойств(СтрокаВид, ВыборкаВидов, "ВидНачисления, Сумма");
				СтрокаВид.Уровень = 2;
				
				Выборка = ВыборкаВидов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ЭлементыВид = СтрокаВид.ПолучитьЭлементы();
				Пока Выборка.Следующий() Цикл
					СтрокаДокумент = ЭлементыВид.Добавить();	
					ЗаполнитьЗначенияСвойств(СтрокаДокумент, Выборка, "ОбъектВыработки, ВидНачисления, Сумма, Валюта");
					СтрокаДокумент.Уровень = 3;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		ВыборкаСотрудников = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСотрудников.Следующий() Цикл
			СтрокаСотрудник = ЭлементыДерева.Добавить();	
			ЗаполнитьЗначенияСвойств(СтрокаСотрудник, ВыборкаСотрудников, "Сотрудник, Сумма");
			СтрокаСотрудник.Уровень = 1;
			
			Выборка = ВыборкаСотрудников.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ЭлементыСотрудник = СтрокаСотрудник.ПолучитьЭлементы();
			Пока Выборка.Следующий() Цикл
				СтрокаДокумент = ЭлементыСотрудник.Добавить();	
				ЗаполнитьЗначенияСвойств(СтрокаДокумент, Выборка, "ОбъектВыработки, ВидНачисления, Сумма, Валюта");
				СтрокаДокумент.Уровень = 2;
			КонецЦикла;
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьНачисленияВТабличнуюЧасть(ТекущийОбъект)
	
	ТекущийОбъект.Начисление.Очистить();
	
	Если ГруппировкаПоВидуНачисления Тогда
		
		ЭлементыСотрудник = ДеревоНачислений.ПолучитьЭлементы();
		Для Каждого СтрокаСотрудник Из ЭлементыСотрудник Цикл		
			ЭлементыВид = СтрокаСотрудник.ПолучитьЭлементы();
			Для Каждого СтрокаВид Из ЭлементыВид Цикл				
				ЭлементыДокумент = СтрокаВид.ПолучитьЭлементы();
				Для Каждого СтрокаДокумент Из ЭлементыДокумент Цикл
					НоваяСтрока = ТекущийОбъект.Начисление.Добавить();
					НоваяСтрока.Сотрудник = СтрокаСотрудник.Сотрудник;
					НоваяСтрока.ВидНачисления = СтрокаВид.ВидНачисления;
					НоваяСтрока.ОбъектВыработки = СтрокаДокумент.ОбъектВыработки;
					НоваяСтрока.Сумма = СтрокаДокумент.Сумма;
					НоваяСтрока.Валюта = СтрокаДокумент.Валюта;					
				КонецЦикла;				
			КонецЦикла;		 		
		КонецЦикла;
		
	Иначе
		
		ЭлементыСотрудник = ДеревоНачислений.ПолучитьЭлементы();
		Для Каждого СтрокаСотрудник Из ЭлементыСотрудник Цикл			
			ЭлементыДокумент = СтрокаСотрудник.ПолучитьЭлементы();
			Для Каждого СтрокаДокумент Из ЭлементыДокумент Цикл
				НоваяСтрока = ТекущийОбъект.Начисление.Добавить();
				НоваяСтрока.Сотрудник = СтрокаСотрудник.Сотрудник;
				НоваяСтрока.ВидНачисления = СтрокаДокумент.ВидНачисления;
				НоваяСтрока.ОбъектВыработки = СтрокаДокумент.ОбъектВыработки;
				НоваяСтрока.Сумма = СтрокаДокумент.Сумма;
				НоваяСтрока.Валюта = СтрокаДокумент.Валюта;					
			КонецЦикла;			
		КонецЦикла;
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоНачислений(Команда)
	
	КоллекцияЭлементовДерева = ДеревоНачислений.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл       
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();     
		Элементы.ДеревоНачислений.Развернуть(ИдентификаторСтроки, Истина);      
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоНачислений(Команда)
	
	КоллекцияЭлементовДерева = ДеревоНачислений.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл       
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();     
		Элементы.ДеревоНачислений.Свернуть(ИдентификаторСтроки);      
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуДереваПоЗначениюПоля(Родитель, ИмяПоля, ИскомоеЗначение, Уровень)
	
	ЭлементыДерева = Родитель.ПолучитьЭлементы();
	СтрокаПоиска = Неопределено;
	Для Каждого СтрокаДерева Из ЭлементыДерева Цикл
		Если СтрокаДерева[ИмяПоля] = ИскомоеЗначение Тогда
			СтрокаПоиска = СтрокаДерева;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаПоиска = Неопределено Тогда
		СтрокаПоиска = ЭлементыДерева.Добавить();
		СтрокаПоиска[ИмяПоля] = ИскомоеЗначение;
		СтрокаПоиска.Уровень = Уровень;
	КонецЕсли;
	
	Возврат СтрокаПоиска;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммыСтрокИДокумента() //#15983
	
	СуммаДокумента = 0;
	Если ГруппировкаПоВидуНачисления Тогда
		ЭлементыСотрудник = ДеревоНачислений.ПолучитьЭлементы();
		Для Каждого СтрокаСотрудник Из ЭлементыСотрудник Цикл
			СуммаПоСотруднику = 0;
			ЭлементыВид = СтрокаСотрудник.ПолучитьЭлементы();
			Для Каждого СтрокаВид Из ЭлементыВид Цикл				
				ЭлементыДокумент = СтрокаВид.ПолучитьЭлементы();
				СуммаПоВиду = 0;
				Для Каждого СтрокаДокумент Из ЭлементыДокумент Цикл
					СуммаДокумента      = СуммаДокумента + СтрокаДокумент.Сумма;
					СуммаПоВиду 		= СуммаПоВиду + СтрокаДокумент.Сумма;					
					СуммаПоСотруднику 	= СуммаПоСотруднику + СтрокаДокумент.Сумма;
				КонецЦикла;
				СтрокаВид.Сумма = СуммаПоВиду;
			КонецЦикла;
			СтрокаСотрудник.Сумма = СуммаПоСотруднику;
		КонецЦикла;
	Иначе
		ЭлементыСотрудник = ДеревоНачислений.ПолучитьЭлементы();
		Для Каждого СтрокаСотрудник Из ЭлементыСотрудник Цикл
			СуммаПоСотруднику = 0;				
			ЭлементыДокумент = СтрокаСотрудник.ПолучитьЭлементы();			
			Для Каждого СтрокаДокумент Из ЭлементыДокумент Цикл
				СуммаДокумента      = СуммаДокумента + СтрокаДокумент.Сумма;					
				СуммаПоСотруднику 	= СуммаПоСотруднику + СтрокаДокумент.Сумма;
			КонецЦикла;			
			СтрокаСотрудник.Сумма = СуммаПоСотруднику;
		КонецЦикла;
	КонецЕсли;	
	
	Объект.СуммаДокумента = СуммаДокумента;
	
КонецПроцедуры

//#15983
//&НаКлиенте
//Процедура РассчитатьСуммыСтрокИДокумента()
//	Валюта = Неопределено;
//	ВалютаОдинаковая = Истина;
//	
//	СуммаДокумента = 0;
//	Если ГруппировкаПоВидуНачисления Тогда
//		ЭлементыСотрудник = ДеревоНачислений.ПолучитьЭлементы();
//		Для Каждого СтрокаСотрудник Из ЭлементыСотрудник Цикл
//			СуммаПоСотруднику = 0;
//			ЭлементыВид = СтрокаСотрудник.ПолучитьЭлементы();
//			Для Каждого СтрокаВид Из ЭлементыВид Цикл				
//				ЭлементыДокумент = СтрокаВид.ПолучитьЭлементы();
//				СуммаПоВиду = 0;
//				Для Каждого СтрокаДокумент Из ЭлементыДокумент Цикл
//					СуммаДокумента      = СуммаДокумента + СтрокаДокумент.Сумма;
//					СуммаПоВиду 		= СуммаПоВиду + СтрокаДокумент.Сумма;					
//					СуммаПоСотруднику 	= СуммаПоСотруднику + СтрокаДокумент.Сумма;
//					
//					Если Валюта = Неопределено Тогда
//						Валюта = СтрокаДокумент.Валюта;
//					ИначеЕсли НЕ Валюта = СтрокаДокумент.Валюта Тогда
//						ВалютаОдинаковая = Ложь;
//					КонецЕсли;		
//				КонецЦикла;
//				СтрокаВид.Сумма = СуммаПоВиду;
//			КонецЦикла;
//			СтрокаСотрудник.Сумма = СуммаПоСотруднику;
//		КонецЦикла;
//	Иначе
//		ЭлементыСотрудник = ДеревоНачислений.ПолучитьЭлементы();
//		Для Каждого СтрокаСотрудник Из ЭлементыСотрудник Цикл
//			СуммаПоСотруднику = 0;				
//			ЭлементыДокумент = СтрокаСотрудник.ПолучитьЭлементы();			
//			Для Каждого СтрокаДокумент Из ЭлементыДокумент Цикл
//				СуммаДокумента      = СуммаДокумента + СтрокаДокумент.Сумма;					
//				СуммаПоСотруднику 	= СуммаПоСотруднику + СтрокаДокумент.Сумма;
//				
//				Если Валюта = Неопределено Тогда
//					Валюта = СтрокаДокумент.Валюта;
//				ИначеЕсли НЕ Валюта = СтрокаДокумент.Валюта Тогда
//					ВалютаОдинаковая = Ложь;
//				КонецЕсли;		
//			КонецЦикла;			
//			СтрокаСотрудник.Сумма = СуммаПоСотруднику;
//		КонецЦикла;
//	КонецЕсли;	
//	
//	//Если валюты одинаковые, вычисляем сумму и обновляем надпись 
//	//если не одинаковые, сумму обнуляем, обработку прирываем
//	Если ВалютаОдинаковая Тогда 
//		СуммаКНачислению = СуммаДокумента;		
//	Иначе				
//		СуммаКНачислению = 0;		
//	КонецЕсли;
//	
//	//ОбновитьНадписьВалюты()
//	Если СуммаКНачислению = 0 Тогда 
//		Элементы.СуммаКНачислению.Видимость = Ложь;
//		Элементы.ДекорацияВалюта.Заголовок = "";
//	Иначе
//		Элементы.ДекорацияВалюта.Заголовок = Валюта;
//		Элементы.СуммаКНачислению.Видимость = Истина;		
//	КонецЕсли; 
//			
//КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	//Только просмотр Уровень 1
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийВидНачисления.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийВидНачисления1.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийОбъектВыработки.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийСумма.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийВалюта.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоНачислений.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//Только просмотр Уровень 2 (по виду начисления)
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийСотрудник.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийОбъектВыработки.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийСумма.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийВалюта.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоНачислений.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	                                 
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГруппировкаПоВидуНачисления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//Только просмотр Уровень 2
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийСотрудник.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийВалюта.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоНачислений.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	                                 
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГруппировкаПоВидуНачисления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//Только просмотр Уровень 3
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийСотрудник.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийВидНачисления.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНачисленийВалюта.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоНачислений.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 3;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоОснованию(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Основание) Тогда
		ПоказатьПредупреждение(, "Основание документа не указано!");
		Возврат;
	КонецЕсли;
	
	Если ДеревоНачислений.ПолучитьЭлементы().Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбОчисткеПерезаполнениеПоОснованию", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Перед заполнением табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);	
	Иначе
	    ПерезаполнитьПоОснованиюНаСервере();
		РассчитатьСуммыСтрокИДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеПерезаполнениеПоОснованию(Результат, ДополнительныеПараметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПерезаполнитьПоОснованиюНаСервере();
		РассчитатьСуммыСтрокИДокумента();
		
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоОснованиюНаСервере()
	
	Объект.Начисление.Очистить();
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ЗаполнитьТабличнуюЧастьПоРегиструВыработки(мОбъект.Основание);
	
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
	
	ЗагрузитьТабличнуюЧастьВДерево();
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, , Ложь);
КонецПроцедуры

#КонецОбласти

