
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	access_token = Параметры.access_token;
	uid = Параметры.uid;
	mid = Параметры.mid;
	chat_id = Параметры.chat_id;
	
	Для Каждого ТекущаяЗапись Из Параметры.Пользователи Цикл
		НоваяСтрока = Пользователи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяЗапись);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСообщенияБеседы()
	
	Если НЕ ПустаяСтрока(access_token) и НЕ ПустаяСтрока(uid) Тогда
		
		Если НЕ Элементы.Беседа.ТекущиеДанные = Неопределено Тогда
			ТекущийMid = Элементы.Беседа.ТекущиеДанные.mid;
		КонецЕсли;
		
		Беседа.Очистить();
		Если Не ПустаяСтрока(chat_id) Тогда
			СписокСообщений = РаботаССайтомВКонтакте.ПолучитьСообщенияБеседы(access_token,,200,СтрЗаменить(2000000000+chat_id,Символ(160),""));
		Иначе
			СписокСообщений = РаботаССайтомВКонтакте.ПолучитьСообщенияБеседы(access_token,,200,uid);
		КонецЕсли;
		Для НомерСообщения = 0 По СписокСообщений.Количество()-1 Цикл
			НоваяСтрока = Беседа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СписокСообщений[НомерСообщения]);
			НоваяСтрока.body = СтрЗаменить(НоваяСтрока.body, "<br>", Символы.ПС);
			НоваяСтрока.Дата = Дата(1970,1,1,1,0,0) + НоваяСтрока.date;
		КонецЦикла;
		
		//получим ФИО пользователей мультидиалога еще раз, т.к. в нем состоят неизвестные нам ранее пользователи
		Если НЕ ПустаяСтрока(chat_id) Тогда
			СписокПользователей = "";
			Для Каждого Сообщение Из Беседа Цикл
				Если НЕ ПустаяСтрока(СписокПользователей) Тогда
					СписокПользователей = СписокПользователей + ", ";
				КонецЕсли;
				СписокПользователей = СписокПользователей + Сообщение.uid;
			КонецЦикла;
			СписокПользователей = РаботаССайтомВКонтакте.ПолучитьИнформациюОПользователях(access_token, СписокПользователей);
			Для НомерЗаписи = 0 По СписокПользователей.Количество()-1 Цикл
				НоваяСтрока = Пользователи.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СписокПользователей[НомерЗаписи]);
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Запись Из Беседа Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("uid", Запись.uid);
			ЗаписиФИО = Пользователи.НайтиСтроки(Отбор);
			Если ЗаписиФИО.Количество() > 0 Тогда
				Запись.Пользователь = "" + ЗаписиФИО[0].first_name + " " + ЗаписиФИО[0].last_name;
			КонецЕсли;
		КонецЦикла;
		
		Отбор = Новый Структура;
		Отбор.Вставить("uid", uid);
		ЗаписиФИО = Пользователи.НайтиСтроки(Отбор);
		Если ЗаписиФИО.Количество() > 0 Тогда
			Пользователь = "" + ЗаписиФИО[0].first_name + " " + ЗаписиФИО[0].last_name;
		КонецЕсли;
		ЭтаФорма.Заголовок = "Беседа с " + Пользователь;
		
		Если НЕ Беседа.НайтиСтроки(Новый Структура ("mid", ТекущийMid)).Количество() = 0  Тогда
			Ид = Беседа.НайтиСтроки(Новый Структура ("mid", ТекущийMid))[0].ПолучитьИдентификатор();
			Элементы.Беседа.ТекущаяСтрока = Ид;
		КонецЕсли;
		
		Беседа.Сортировать("mid Возр"); //мы получаем сообщения в обратном порядке
		
		ОтметитьСообщенияКакПрочитанные();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолучитьСообщенияБеседы();
	ПодключитьОбработчикОжидания("ПолучитьСообщенияБеседы", 15);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьСообщенияКакПрочитанные()
	
	Если НЕ ПустаяСтрока(access_token) и НЕ ПустаяСтрока(uid) Тогда
		//отметим сообщения как прочитанные
		Для Каждого Запись Из Беседа Цикл
			СписокЗаписей = "";
			Если Запись.read_state = "0" Тогда
				Если НЕ ПустаяСтрока(СписокЗаписей) Тогда
					СписокЗаписей = СписокЗаписей + ", ";
				КонецЕсли;
				СписокЗаписей = СписокЗаписей + Запись.mid;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ПустаяСтрока(СписокЗаписей) Тогда
			РаботаССайтомВКонтакте.ПометитьСообщенияКакПрочитанные(access_token,СписокЗаписей);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Если НЕ ПустаяСтрока(access_token) и НЕ ПустаяСтрока(uid) и НЕ ПустаяСтрока(new_message) Тогда
		
		attachments = "";
		Если Не ПустаяСтрока(file_name) Тогда
			
			Попытка
				ВремФайл = Новый Файл(file_name);
				ПараметрыДокумента = РаботаССайтомВКонтакте.ЗагрузитьДокумент(access_token, , Новый ДвоичныеДанные(file_name), ВремФайл.Имя);
				ДанныеОДокументе = РаботаССайтомВКонтакте.СохранитьЗагруженныйДокумент(access_token,
				ПараметрыДокумента.file);
				attachments = "doc" + ДанныеОДокументе.owner_id + "_" + ДанныеОДокументе.did;
			Исключение
				Сообщить("Ошибка при загрузке документа: " + ОписаниеОшибки());
				Возврат;
			КонецПопытки;
			
		КонецЕсли;

		new_message = СтрЗаменить(new_message, Символы.ПС, "<br>");
		РаботаССайтомВКонтакте.ОтправитьСообщение(access_token, uid,,,,mid,,new_message,,,attachments);
		new_message = "";
		file_name = "";
		ПолучитьСообщенияБеседы();
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Показать(Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект));
КонецПроцедуры


&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДопПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		file_name = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		
		ОтметитьСообщенияКакПрочитанные();
		
	КонецЕсли;
	
КонецПроцедуры
