
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыАвторизации = Параметры.ПараметрыАвторизации;
	Если НЕ ТипЗнч(ПараметрыАвторизации) = Тип("Структура") Тогда 
		Сообщить("Необходимо выполнить настройки авторизации Яндекс API.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
функция ПолучитьНастройки()
	
	СтруктураНастроек = новый Структура;	
	СтруктураНастроек.Вставить("ТокенОбновления", ТокенОбновления);
	СтруктураНастроек.Вставить("ТокенДоступа", ТокенДоступа);
	СтруктураНастроек.Вставить("ВремяЖизниТокенаAPI", ВремяЖизниТокенаAPI);
	
	Возврат СтруктураНастроек;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Авторизоваться();
КонецПроцедуры

&НаКлиенте
Процедура Авторизоваться()
	
	ЧастьЗапроса = "response_type=code"+"&";
	ЧастьЗапроса = ЧастьЗапроса + "client_id="+ ПараметрыАвторизации.ИдентификаторКлиента + "&";
	ЧастьЗапроса = ЧастьЗапроса + "display=popup";
	
	АдресАвторизации = "https://oauth.yandex.ru/authorize?";
	ПолныйАдресАвторизации = АдресАвторизации + ЧастьЗапроса;
    
    HTML_Поле = ПолныйАдресАвторизации;	
	
КонецПроцедуры

&НаКлиенте
Процедура HTML_ПолеДокументСформирован(Элемент)
	
	Попытка
		ПолеДляЧтения = Элементы.HTML_Поле.Документ.documentURI;
	Исключение
		ПолеДляЧтения = Элементы.HTML_Поле.Документ.URLUnencoded;
	КонецПопытки;
	
	ПоискВхождения = СтрНайти(ПолеДляЧтения, "code=");
	
	Если ПоискВхождения = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	КодДоступа = Сред(ПолеДляЧтения, ПоискВхождения+5, СтрДлина(ПолеДляЧтения) - СтрНайти(ПолеДляЧтения, "&",, ПоискВхождения-1));
	Если НЕ ПолучитьТокены() Тогда 
		Возврат;
	КонецЕсли;	
	
	ЗавершитьАвторизацию();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТокены()
	
	СтрокаЗапроса = СтрШаблон("grant_type=authorization_code&code=%1&client_id=%2&client_secret=%3",
		КодДоступа,
		ПараметрыАвторизации.ИдентификаторКлиента, 
		ПараметрыАвторизации.СекретныйКодКлиента, 
		);

	Соединение = Новый HTTPСоединение(ПараметрыАвторизации.СерверАвторизации, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL);

	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	ЗапросХТТП = Новый HTTPЗапрос(ПараметрыАвторизации.РесурсАвторизации, Заголовки);
	ЗапросХТТП.УстановитьТелоИзСтроки(СтрокаЗапроса);

	Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросХТТП);
	
	Если Не Ответ.КодСостояния = 200 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка получения параметров авторизации: %1", Ответ.ПолучитьТелоКакСтроку()));		
		Возврат Ложь; 
	КонецЕсли;

	Строка = Ответ.ПолучитьТелоКакСтроку();
	
    Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(Строка);

	Фабрика = ФабрикаXDTO.ПрочитатьJSON(Чтение);
	
    Чтение.Закрыть();
	
    ТокенДоступа 		= Фабрика.access_token;
	ТокенОбновления 	= Фабрика.refresh_token;	
	ВремяЖизниТокенаAPI = ТекущаяДата() + Число(Фабрика.expires_in) - 25;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьАвторизацию()
	
	Если ЭтаФорма.Открыта() Тогда 
		
		СтруктураНастроек = ПолучитьНастройки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Параметры успешно сохранены.");	
		ЭтаФорма.Закрыть(СтруктураНастроек);
		
	КонецЕсли;	
	
КонецПроцедуры



