//#15955 
Функция ПричинаПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ПричиныОтказаЗамера.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПричиныОтказаЗамера КАК ПричиныОтказаЗамера
	|ГДЕ
	|	НЕ ПричиныОтказаЗамера.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 1 Тогда	
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ПричиныОтказаЗамера.ПустаяСсылка();
	
КонецФункции