
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыСеанса.ОграничиватьПереченьДоступныхВидовЦен Тогда
		
		//если у пользователя стоит ограничение по виду цен, покажем только доступные ему виды цен		
		Список.ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СправочникВидыЦен.Ссылка КАК Ссылка,
		|	СправочникВидыЦен.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникВидыЦен.Код КАК Код,
		|	СправочникВидыЦен.Наименование КАК Наименование,
		|	СправочникВидыЦен.Предопределенный КАК Предопределенный,
		|	СправочникВидыЦен.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	СправочникВидыЦен.СсылочныйВидЦены КАК СсылочныйВидЦены
		|ИЗ
		|	Справочник.ВидыЦен КАК СправочникВидыЦен
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.ДоступныеВидыЦен КАК ПользователиДоступныеВидыЦен
		|		ПО (ПользователиДоступныеВидыЦен.ВидЦены = СправочникВидыЦен.Ссылка)
		|			И (ПользователиДоступныеВидыЦен.Ссылка = &ТекущийПользователь)";
		
		Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", Пользователи.ТекущийПользователь());
		Список.ОсновнаяТаблица = "Справочник.ВидыЦен";
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СписокУсловноеОформление = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	// Неактивный элемент
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Ссылочный вид цены'");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СсылочныйВидЦены");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НавахоБелый);

КонецПроцедуры
