
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ДополнительныйКлючОтчета", "ЭффективностьРекламныхИсточников");
	//ПараметрыФормы.Вставить("ОтчетНаименование", "Эффективность рекламных источников");
	
	ОткрытьФорму("Отчет.ЭффективностьРекламныхИсточников.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
