
// Обработчик динамически подключаемой команды 
//
// Команда  - КомандаФормы - подключаемая команда формы.
// Источник - ТаблицаФормы, ДанныеФормыСтруктура - источник объектов печати (Форма.Объект, Форма.Элементы.Список)
Процедура ВыполнитьКомандуОтправитьСообщениеМессенджер(Знач Команда, Знач Форма, Знач Источник) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТелефонаЗавершение", ЭтотОбъект, Команда.Имя);
	
	ПараметрыФормы = Новый Структура("ВыборДляМессенджера", Истина);
	
	Если ТипЗнч(Источник) = Тип("ДанныеФормыСтруктура") Тогда
		ПараметрыФормы.Вставить("СсылкаОбъект", Источник.Ссылка);        // с формы объекта		
		Если Источник.Свойство("Контрагент") Тогда
			ПараметрыФормы.Вставить("СсылкаОбъект", Источник.Контрагент);	
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ТаблицаФормы") Тогда
		ПараметрыФормы.Вставить("СсылкаОбъект", Источник.ТекущаяСтрока); // с формы списка
		
	ИначеЕсли ТипЗнч(Источник) = Тип("Строка") Тогда	
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Источник);		 // передан номер телефона
		Возврат;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.Сотрудники") Тогда	
		ПараметрыФормы.Вставить("СсылкаОбъект", Источник);		 		 // замерщик с формы заказ-договора
		
	Иначе
		Возврат;
		
	КонецЕсли;	
 	
	ОткрытьФорму("Обработка.ПанельСофтФонУниверсальная.Форма.ФормаВыбораКонтакта", ПараметрыФормы, ,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ВыборТелефонаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НомерТелефона = Результат;
	Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = ДополнительныеПараметры; //Команда.Имя
	
	НомерТелефона = ПодготовитьНомерДляЗвонка(СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(НомерТелефона));
	
	ИмяВнешнейКоманды = "";
	Если СтрНайти(ИмяКоманды, "ОтправитьСообщениеTelegram") > 0 Тогда
		ВариантВызова = ОбщийМодульВызовСервера.ПолучитьЗначениеКонстанты("ВариантВызоваTelegram");
		Если ВариантВызова = ПредопределенноеЗначение("Перечисление.ВариантыВызоваМессенджеров.ДиалогВПриложении") Тогда
			ИмяВнешнейКоманды = "tg://t.me/" + НомерТелефона;
		Иначе			
			ИмяВнешнейКоманды = "https://t.me/" + НомерТелефона;
		КонецЕсли;
		
	ИначеЕсли СтрНайти(ИмяКоманды, "ОтправитьСообщениеViber") > 0 Тогда
		ИмяВнешнейКоманды = "viber://chat?number=" + НомерТелефона;
		
	ИначеЕсли СтрНайти(ИмяКоманды, "ОтправитьСообщениеWhatsApp") > 0 Тогда
		ВариантВызова = ОбщийМодульВызовСервера.ПолучитьЗначениеКонстанты("ВариантВызоваWhatsApp");
		Если ВариантВызова = ПредопределенноеЗначение("Перечисление.ВариантыВызоваМессенджеров.ДиалогВПриложении") Тогда
			ИмяВнешнейКоманды = "whatsapp://send?phone=" + НомерТелефона;
		Иначе			
			//ИмяВнешнейКоманды = "https://wa.me/" + НомерТелефона;
			ИмяВнешнейКоманды = "https://web.whatsapp.com/send?phone=" + НомерТелефона;        
		КонецЕсли;
	КонецЕсли;	  
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", СофтФонКлиент);
	НачатьЗапускПриложения(ОписаниеОповещения, ИмяВнешнейКоманды);
		
КонецПроцедуры

Функция ПодготовитьНомерДляЗвонка(Знач Номер)
	
	ТолькоЦифры="";
	Для Индекс=1 По СтрДлина(Номер) Цикл
		Символ=Сред(Номер,Индекс,1);
		Если (КодСимвола(Символ)>47 И КодСимвола(Символ)<58) ИЛИ Символ = "+" Тогда
			ТолькоЦифры=ТолькоЦифры+Символ;
		КонецЕсли; 
	КонецЦикла; 
	Возврат ТолькоЦифры;

КонецФункции

Процедура ЗавершитьЗапускПриложения(КодВозврата, ДополнительныеПараметры) Экспорт
	//не удалять
		
КонецПроцедуры

