#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// резервное копирование
	Элементы.ГруппаРезервноеКопирование.Видимость = Параметры.ПоказыватьУведомлениеОРезервномКопировании;
	Если Элементы.ГруппаРезервноеКопирование.Видимость Тогда
		СформироватьТабличныйДокумент();	
	КонецЕсли;
	
	// Экспресс проверка учета
	Элементы.ГруппаЭкспрессПроверка.Видимость = Параметры.ПоказыватьУведомлениеОЗапускеЭкспрессПроверки;
	
	// Мобильный клиент
	Элементы.ГруппаМобильныйКлиентSmartCeilings.Видимость = Параметры.ПоказатьСостояниеПубликацииДляМобильногоКлиента;	
	РезультатПроверкиМобильногоКлиента = Параметры.РезультатПроверкиМобильногоКлиента;	
	Если ТипЗнч(РезультатПроверкиМобильногоКлиента) = Тип("Структура") Тогда
		
		Если НЕ РезультатПроверкиМобильногоКлиента.МобильныйЗамерщик_ПроверкаТребуется Тогда
			Элементы.ГруппаМобильныйЗамерщик.Видимость = Ложь;
		Иначе
			Если РезультатПроверкиМобильногоКлиента.МобильныйЗамерщик_Результат Тогда
				Элементы.ДекорацияМобильныйЗамерщикИстина.Видимость = Истина;
				Элементы.ДекорацияМобильныйЗамерщикЛожь.Видимость = Ложь;
			Иначе
				Элементы.ДекорацияМобильныйЗамерщикИстина.Видимость = Ложь;
				Элементы.ДекорацияМобильныйЗамерщикЛожь.Видимость = Истина;
			КонецЕсли;
			Элементы.ДекорацияМобильныйЗамерщикТекст.Заголовок = РезультатПроверкиМобильногоКлиента.МобильныйЗамерщик_ТекстОтвета;
		КонецЕсли;
		
		Если НЕ РезультатПроверкиМобильногоКлиента.МобильныйМонтажник_ПроверкаТребуется Тогда
			Элементы.ГруппаМобильныйМонтажника.Видимость = Ложь;
		Иначе
			Если РезультатПроверкиМобильногоКлиента.МобильныйМонтажник_Результат Тогда
				Элементы.ДекорацияМобильныйМонтажникИстина.Видимость = Истина;
				Элементы.ДекорацияМобильныйМонтажникЛожь.Видимость = Ложь;
			Иначе
				Элементы.ДекорацияМобильныйМонтажникИстина.Видимость = Ложь;
				Элементы.ДекорацияМобильныйМонтажникЛожь.Видимость = Истина;
			КонецЕсли;
			Элементы.ДекорацияМобильныйМонтажникТекст.Заголовок = РезультатПроверкиМобильногоКлиента.МобильныйМонтажник_ТекстОтвета;
		КонецЕсли;
		
		Если НЕ РезультатПроверкиМобильногоКлиента.ПроверкаПотолка_ПроверкаТребуется Тогда
			Элементы.ГруппаПроверкиПотолка.Видимость = Ложь;
		Иначе
			Если РезультатПроверкиМобильногоКлиента.ПроверкаПотолка_Результат Тогда
				Элементы.ДекорацияПроверкаПотолкаИстина.Видимость = Истина;
				Элементы.ДекорацияПроверкаПотолкаЛожь.Видимость = Ложь;
			Иначе
				Элементы.ДекорацияПроверкаПотолкаИстина.Видимость = Ложь;
				Элементы.ДекорацияПроверкаПотолкаЛожь.Видимость = Истина;
			КонецЕсли;
			Элементы.ДекорацияПроверкаПотолкаТекст.Заголовок = РезультатПроверкиМобильногоКлиента.ПроверкаПотолка_ТекстОтвета;
		КонецЕсли;
		
	КонецЕсли;
	
	//#7399 наличие объектов к обработке после обновления
	Элементы.ГруппаОбъектыПослеОбновления.Видимость = Параметры.ПоказыватьУведомлениеОбОбработкеПослеОбновления;
	Элементы.ПерейтиКСпискуДокументов.Видимость = РольДоступна("АдминистраторСистемы") ИЛИ РольДоступна("ПолныеПрава");
	
	// №9396 превышение объема прикрепленных данных
	Элементы.ГруппаПревышениеОбъемаПрикрепленныхДанных.Видимость = Параметры.ПоказыватьУведомлениеОПревышенииОбъемаПрикрепленныхДанных;
	СтруктураПрикрепленныхДанных = ОбщийМодуль.ПолучитьСтруктуруПрикрепленныхДанных();
	Элементы.ДекорацияПревышениеОбъема.Заголовок = СтруктураПрикрепленныхДанных.ТекстСообщения;
	
	// #10449
	ПоказыватьУведомлениеПоСервисам = Параметры.ПоказыватьУведомлениеПоСервисам;
	Элементы.ГруппаСервисы.Видимость = ПоказыватьУведомлениеПоСервисам;
	Элементы.ДекорацияОшибкаПроверкиСервисов.Видимость = Ложь;
	Элементы.ДекорацияПредставлениеОшибкаПроверкиСервисов.Видимость = Ложь;
	Элементы.ДекорацияПроверкиСервисовУспешно.Видимость = Ложь;
	
	// №13835
	Элементы.ДекорацияКонтрольОстатковПоСкладам.Видимость = Константы.НеКонтролироватьОстаткиНаСкладах.Получить();
	
	//++16352
	Если (НЕ ПолучитьПроверкуСложностиПаролейПользователей() ИЛИ ПолучитьМинимальнуюДлинуПаролейПользователей() =0) И ПараметрыСеанса.ЭтоОблако Тогда
		Элементы.ГруппаПолитикаСложностиПаролей.Видимость = Истина;
	Иначе
		Элементы.ГруппаПолитикаСложностиПаролей.Видимость = Ложь;
	КонецЕсли;	
	//--16352
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПоказыватьУведомлениеПоСервисам Тогда
		ПодключитьОбработчикОжидания("ЗапуститьПроверкуСервисов", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РезервноеКопирование

&НаСервере
Процедура СформироватьТабличныйДокумент()
	
	Макет = ПолучитьОбщийМакет("УведомлениеОРезервномКопировании");
	Таб = Новый ТабличныйДокумент;	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	Таб.Вывести(ОбластьМакета);
	
	Результат.Очистить();
	Результат.Вывести(Таб);
	
КонецПроцедуры

&НаСервере
Процедура НеПоказыватьПриИзмененииНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.УведомлениеОРезервномКопировании.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Версия = ОбщийМодуль.ПолучитьВерсиюКонфигурации();
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.НеПоказывать = НеПоказывать;	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НеПоказыватьПриИзменении(Элемент)
	НеПоказыватьПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ЭкспрессПроверка

&НаКлиенте
Процедура ОткрытьЭкспрессПроверку(Команда)
	ОткрытьФорму("Отчет.ЭкспрессПроверкаУчета.Форма");	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьЭкспрессПроверку(Команда)
	ПараметрыОткрытияОтчета = Новый Структура("ЗапускатьПриОткрытии", Истина);
	ОткрытьФорму("Отчет.ЭкспрессПроверкаУчета.Форма", ПараметрыОткрытияОтчета);	
КонецПроцедуры

#КонецОбласти

#Область ОбъектыКОбработкеПослеОбновления

&НаКлиенте
Процедура ПерейтиКСпискуДокументов(Команда)
	
	ПараметрыФормыНастроек = Новый Структура;
	ПараметрыФормыНастроек.Вставить("ТекущаяСтраница", "ГруппаОбновление");	
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.ФормаНастроек", ПараметрыФормыНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область ОбъектыКОбработкеПослеОбновления

&НаКлиенте
Процедура ЗапуститьПроверкуСервисов()
	
	ОчиститьСообщения();	
	
	ИДЗаданияПроверкиСервисов = Неопределено;
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	СтруктураФоновогоЗадания = ЗапуститьПроверкуСервисовНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	ИДЗаданияПроверкиСервисов = СтруктураФоновогоЗадания.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал = 2;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанныеПроверкиСервисов", ЭтотОбъект), ПараметрыОжидания);
	
	Если НЕ ПроверкаСервисовЗавершена Тогда
		ПодключитьОбработчикОжидания("ПроверитьАктивностьФоновогоЗаданияПроверкиСервисов", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьПроверкуСервисовНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)

	НаименованиеЗадания = НСтр("ru = 'Запуск длительной операции'");
	
	ВыполняемыйМетод = "ОбщийМодульСервер.ПроверкаРасширенныхСервисовПоФоновомуЗаданию";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьДанныеПроверкиСервисов(Результат, ДополнительныеПараметры) Экспорт
	
	ОтключитьОбработчикОжидания("ПроверитьАктивностьФоновогоЗаданияПроверкиСервисов");
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ЗафиксироватьПроблемуПроверкиСервисов(Результат.ПодробноеПредставлениеОшибки);
		
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		// обрабатываем результат
		Элементы.ГруппаСервисыСтраницы.ТекущаяСтраница = Элементы.ГруппаСервисыРезультатПроверки;
		РезультатЭтапа = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		ПроверкаСервисовЗавершена = Истина;
		//++16714
		//Если РезультатЭтапа.ЕстьОшибкаПроверки Тогда
		//	ЗафиксироватьПроблемуПроверкиСервисов(, РезультатЭтапа.Сообщения);			
		//Иначе	
		//	Элементы.ДекорацияПроверкиСервисовУспешно.Видимость = Истина;
		//КонецЕсли;
		//++16714
		ЗафиксироватьПроблемуПроверкиСервисов(, РезультатЭтапа.Сообщения);			
				
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьПроблемуПроверкиСервисов(ТекстОшибки = "", Сообщения = Неопределено)
	
	Элементы.ГруппаСервисыСтраницы.ТекущаяСтраница = Элементы.ГруппаСервисыРезультатПроверки;
	//++16714  Элементы.ДекорацияОшибкаПроверкиСервисов.Видимость = Истина;
	Элементы.ДекорацияПредставлениеОшибкаПроверкиСервисов.Видимость = НЕ ПустаяСтрока(ТекстОшибки);
	Элементы.ДекорацияПредставлениеОшибкаПроверкиСервисов.Заголовок = ТекстОшибки;
	
	Если НЕ Сообщения = Неопределено Тогда
		Счетчик = 1;
		Для каждого ЭлементМассива из Сообщения Цикл				
			Элемент = Элементы.Добавить("ДекорацияНадписьОшибкаРасшСервис" + Счетчик, Тип("ДекорацияФормы"), Элементы.ГруппаСервисыРезультатПроверкиСообщения);
			Элемент.Вид = ВидДекорацииФормы.Надпись;
			Элемент.Заголовок = ЭлементМассива.ТекстСообщения;
			Элемент.АвтоМаксимальнаяШирина = Ложь; 
			Элемент.ЦветТекста = ЭлементМассива.ЦветСообщения;
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАктивностьФоновогоЗаданияПроверкиСервисов()
	
	СостояниеЗадания = ТекущееСостояниеФоновогоЗадания(ИДЗаданияПроверкиСервисов);
	
	Если ЗначениеЗаполнено(СостояниеЗадания.ТекстОшибки) Тогда
		
		ЗафиксироватьПроблемуПроверкиСервисов(СостояниеЗадания.ТекстОшибки);
		
	ИначеЕсли СостояниеЗадания.Отменено ИЛИ СостояниеЗадания.ЗавершеноАварийно ИЛИ СостояниеЗадания.НеНайдено Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Фоновое задание расчета %1.'"),
			?(СостояниеЗадания.Отменено,
				НСтр("ru='отменено администратором'"),
				?(СостояниеЗадания.ЗавершеноАварийно,
					НСтр("ru='завершено аварийно'"),
					НСтр("ru='не найдено в списке заданий'"))));
		
		ЗафиксироватьПроблемуПроверкиСервисов(ТекстОшибки);
		
	КонецЕсли;
	
	Если СостояниеЗадания.Активно Тогда // запущен расчет
		
	 	ПодключитьОбработчикОжидания("ПроверитьАктивностьФоновогоЗаданияПроверкиСервисов", 1, Истина);
		Возврат;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущееСостояниеФоновогоЗадания(ИдентификаторЗадания, ДляЧтенияНаКлиенте = Истина)
	
	СостояниеЗадания = ОбщийМодульСервер.ТекущееСостояниеФоновогоЗадания(ИдентификаторЗадания);
	
	Если ДляЧтенияНаКлиенте Тогда
		СостояниеЗадания.Удалить("Задание"); // тип значения этого свойства недоступен на клиенте
	КонецЕсли;
	
	Возврат СостояниеЗадания;
	
КонецФункции

#КонецОбласти