
#Область ПрограммныйИнтерфейс

// Заполняет параметры клиента перед началом работы приложения.
// См. ОбщегоНазначенияКлиентПереопределяемый.ПередНачаломРаботыСистемы
Процедура ПередНачаломРаботыСистемы() Экспорт

	ЗаполнитьПараметрыКлиента();

КонецПроцедуры

#КонецОбласти

#Область РаботаСДатамиИПериодами

Процедура ПересчитатьДатуОкончания(пФормаИлиСтрока, пИмяРеквизитаНачало, пИмяРеквизитаОкончание, пИспользоватьСтрокуТЧ = Ложь) Экспорт
	
	Если пИспользоватьСтрокуТЧ Тогда
		ДанныеДляИзменения = пФормаИлиСтрока;
	Иначе
		ДанныеДляИзменения = пФормаИлиСтрока.Объект;
	КонецЕсли;

	Дельта = ДанныеДляИзменения[пИмяРеквизитаОкончание] - пФормаИлиСтрока.НачалоСобытияПередИзменением;
	ДанныеДляИзменения[пИмяРеквизитаОкончание] = ДанныеДляИзменения[пИмяРеквизитаНачало] + Дельта;
	пФормаИлиСтрока.НачалоСобытияПередИзменением = ДанныеДляИзменения[пИмяРеквизитаНачало];
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьИсключениеПриПолученииТекстаФайла(ДополнительныеПараметры, ИмяФайлаИзНастройки)

	ИмяФайла = ДополнительныеПараметры.ПутьДоФайла1;
	
	Если ДополнительныеПараметры.Свойство("ВыполнитьДействияЕслиФайлНеПрочитан") И ДополнительныеПараметры.ВыполнитьДействияЕслиФайлНеПрочитан Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка чтения файла %Файл%.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Файл%", ИмяФайла);
		Если ИмяФайлаИзНастройки Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = 'Возможно файл, который указан в настройках обмена, не существует.'");
		КонецЕсли;
		ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = 'Выберите другой файл.'");
		
		ПоказатьПредупреждение(
			Новый ОписаниеОповещения("ВыполнитьДействияЕслиФайлНеПрочитан", ЭтотОбъект, ДополнительныеПараметры),
			ТекстСообщения);
		
	Иначе
		ТекстСообщения = НСтр("ru = 'Ошибка чтения файла %Файл%.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Файл%", ИмяФайла);
		Если ИмяФайлаИзНастройки Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = 'Возможно файл, который указан в настройках обмена, не существует. Выбрать другой файл можно в настройках (кнопка в правом верхнем углу).'");
		КонецЕсли;
		
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ЗаполнитьПараметрыКлиента()
	
	ИмяПараметра = "УНФРТ.ПараметрыОбработчиковОжидания";
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
		ПараметрыПриложения.Вставить(ИмяПараметра, Новый Структура());
		ВремяОжидания = ВремяОжиданияДляРежимаРаботы();
		ПараметрыПриложения[ИмяПараметра].Вставить("ВремяОжидания", ВремяОжидания);
	КонецЕсли;
	
КонецПроцедуры

Функция ВремяОжиданияДляРежимаРаботы()
	
	Если ОбщегоНазначенияКлиент.РазделениеВключено() Тогда
		ВремяОжидания = 0.7;
	Иначе
		ВремяОжидания = 0.3;
	КонецЕсли;
	
	Возврат ВремяОжидания;
	
КонецФункции

#КонецОбласти