
Функция СтруктураДействийПоСопутствующимТоварамВРознице() Экспорт

	НаборКонстант = Константы.СоздатьНабор("АвтоматическиДобавлятьСопутствующиеТоварыИУслуги,
	                                |ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг,
									|ЗапрашиватьПодтверждениеПриДобавленииНоменклатурыСТ,
									|ЗапрашиватьПодтверждениеПриИзмененииНоменклатурыСТ,
									|ЗапрашиватьПодтверждениеПриИзмененииКоличестваСТ,
									|ЗапрашиватьПодтверждениеПриУдаленииНоменклатурыСТ");

	НаборКонстант.Прочитать();
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("АвтоматическиДобавлятьСопутствующиеТоварыИУслуги", 		НаборКонстант.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги);
	СтруктураДействий.Вставить("ДопустимаяГлубинаВложенностиСопутствующихТоваров", 		НаборКонстант.ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг);
	СтруктураДействий.Вставить("ЗапрашиватьПодтверждениеПриДобавленииНоменклатуры", 	НаборКонстант.ЗапрашиватьПодтверждениеПриДобавленииНоменклатурыСТ);
	СтруктураДействий.Вставить("ЗапрашиватьПодтверждениеПриИзмененииНоменклатуры", 	НаборКонстант.ЗапрашиватьПодтверждениеПриИзмененииНоменклатурыСТ);
	СтруктураДействий.Вставить("ЗапрашиватьПодтверждениеПриИзмененииКоличества", 		НаборКонстант.ЗапрашиватьПодтверждениеПриИзмененииКоличестваСТ);
	СтруктураДействий.Вставить("ЗапрашиватьПодтверждениеПриУдаленииНоменклатуры", 		НаборКонстант.ЗапрашиватьПодтверждениеПриУдаленииНоменклатурыСТ);
	
	Возврат СтруктураДействий;
	
КонецФункции
