
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_Города", Новый Структура, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьКодКЛАДР(Команда)
	
	ОчиститьСообщения();
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	МассивГородов = ПолучитьГородаНаселенныеПунктыПоНаименованию();
	Если МассивГородов.Количество() = 0 Тогда
		Сообщить("Не найден город по наименованию!");
		Возврат;
	КонецЕсли;
	
	СписокГородов = Новый СписокЗначений;
	Для каждого ЭлементМассива из МассивГородов Цикл
		СписокГородов.Добавить(ЭлементМассива.КодКладр, СтрШаблон("%1", ЭлементМассива.Представление));
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораГорода", ЭтотОбъект);
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокГородов); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораГорода(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.КодКЛАДР = Результат.Значение;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьГородаНаселенныеПунктыПоНаименованию()
	
	Возврат ОбщийМодульСервер.ПолучитьПредставленияНаселенныхПунктовПоНаименованию(Объект.Наименование);
	
КонецФункции

