
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаНоменклатурыДляПоиска = Константы.ГруппаНоменклатурыПродукция.Получить();
	Если НЕ Параметры.ПоНомеруДоговора Тогда
		НомерПотолка = ОбщийМодуль.ПолучитьНомерНовогоРасчетаПотолка();
	Иначе
		СтрокаНомерМесяца = ?(Месяц(ТекущаяДатаСеанса()) < 10, "0" + Месяц(ТекущаяДатаСеанса()), Строка(Месяц(ТекущаяДатаСеанса())));
		СтрокаНомерГода = Прав(Строка(Год(ТекущаяДатаСеанса())),2);
		НомерПотолка = СокрЛП(СтрокаНомерМесяца) + СтрокаНомерГода + СокрЛП(Параметры.НомерДоговора) + "-" + СтрЗаменить(Строка(Параметры.КоличествоПотолковВДокументе+1), Символ(160),"");
	КонецЕсли;
	ПолучитьНаименованиеПотолка();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Номенклатура.Пустая() Тогда
		Номенклатура = СоздатьНоменклатуруПродукцияНаСервере(НомерПотолка, Цвет, Фактура);
	КонецЕсли;
	
	Если НЕ Номенклатура.Пустая() Тогда
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("НомерПотолка",НомерПотолка);
		СтруктураОтвета.Вставить("Фактура",Фактура);
		СтруктураОтвета.Вставить("Цвет",Цвет);
		СтруктураОтвета.Вставить("Номенклатура",Номенклатура);
		Закрыть(СтруктураОтвета);
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Процедура ПолучитьНаименованиеПотолка()
	
	НаименованиеПотолка = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(НомерПотолка, Цвет, Фактура);
	
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеПотолка, Истина, ГруппаНоменклатурыДляПоиска);
	Если НЕ Номенклатура.Пустая() Тогда
		
		Элементы.Номенклатура.Видимость = Истина;
		Элементы.НаименованиеПотолка.Видимость = Ложь;
	Иначе
		Элементы.Номенклатура.Видимость = Ложь;
		Элементы.НаименованиеПотолка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПотолкаПриИзменении(Элемент)
	ПолучитьНаименованиеПотолка();
КонецПроцедуры

&НаКлиенте
Процедура ФактураПриИзменении(Элемент)
	ПолучитьНаименованиеПотолка();
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	ПолучитьНаименованиеПотолка();
КонецПроцедуры


&НаСервере
Функция СоздатьНоменклатуруПродукцияНаСервере(НомерПотолка, ЦветФактуры, Фактура)
	
	БазоваяЕдИзм = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
	Если БазоваяЕдИзм.Пустая() Тогда
		Сообщить("Ошибка!"+Символы.ПС+"В справочнике ""Классификатор единиц измерения"" не найдена единица с наименованием ""м2""");
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Отказ = Ложь;
	Если ПустаяСтрока(НомерПотолка) Тогда
		Отказ = Истина;
		Сообщить("Не указан номер создаваемого потолка");
	КонецЕсли;
	Если Отказ Тогда
		Сообщить("Номенклатура не создана");
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	НаименованиеНоменклатурыДляСоздания = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(НомерПотолка, ЦветФактуры, Фактура);
	ГруппаНоменклатурыДляСоздания = Константы.ГруппаНоменклатурыПродукция.Получить();
	
	Попытка
		НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
		НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
		НоваяНоменклатура.БазоваяЕдиницаИзмерения = БазоваяЕдИзм.Ссылка;
		НоваяНоменклатура.Наименование = НаименованиеНоменклатурыДляСоздания;
		НоваяНоменклатура.Родитель = ГруппаНоменклатурыДляСоздания;
		НоваяНоменклатура.Потолок_НомерРасчета = НомерПотолка;
		
		НоваяНоменклатура.Потолок_Фактура.Очистить();
		НоваяСтрока = НоваяНоменклатура.Потолок_Фактура.Добавить();
		НоваяСтрока.Основная = Истина;
		НоваяСтрока.ПродукцияФактура = ЦветФактуры.Владелец;
		НоваяСтрока.ПродукцияЦвет = ЦветФактуры;
		
		НоваяНоменклатура.Записать();
	
		
		Возврат НоваяНоменклатура.Ссылка;
	Исключение
		Сообщить("Ошибка!" + Символы.ПС + ОписаниеОшибки());
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции
