#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику;
		ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента;
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Основание = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = Документы.ЗаказПоставщику.СуммаКОплате(ДанныеЗаполнения); //ДанныеЗаполнения.СуммаДокумента; //#14377
		ВалютаДокумента = ДанныеЗаполнения.Валюта;
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения.Ссылка;
		НоваяСтрока.Сумма = СуммаДокумента;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		СуммаДокумента = ДанныеЗаполнения.Начисление.Итог("Сумма");
		Организация = ДанныеЗаполнения.Организация;
		Основание = ДанныеЗаполнения.Ссылка;
		ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам;
		ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам;
		ПериодРегистрации = ДанныеЗаполнения.ПериодРегистрации;
		Для Каждого ТекСтрокаНачисление Из ДанныеЗаполнения.Начисление Цикл
			НоваяСтрока = ЗарплатаСотрудникам.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаНачисление.Сотрудник;
			//НоваяСтрока.УДАЛИТЬ_ВидНачисления = ТекСтрокаНачисление.ВидНачисления; //#6576
			НоваяСтрока.Сумма = ТекСтрокаНачисление.Сумма;
			НоваяСтрока.СчетСотрудника = ФинансыСервер.ПолучитьСчетСотрудника(ТекСтрокаНачисление.Сотрудник);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента;
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Основание = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		ВалютаДокумента = ДанныеЗаполнения.Валюта;
		Счет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
		
		//НазначениеПлатежа = "По " + Строка(Договор) + ". Сумма " + Формат(Сумма, "ЧДЦ=2; ЧРД=-; ЧГ=0" ) + ". Без налога (НДС)";
	
	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
	//	ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
	//	ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
	//	Договор = ДанныеЗаполнения.Ссылка;
	//	Контрагент = ДанныеЗаполнения.Контрагент;
	//	Организация = ДанныеЗаполнения.Организация;
	//	Основание = ДанныеЗаполнения.Ссылка;
	//	ВалютаДокумента = ДанныеЗаполнения.Валюта;
	//	
	//	//предложим к заполнению сумму равную сумму нашего долга на текущий момент
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	РасчетыПоЗаказамОстатки.СуммаОстаток
	//	|ИЗ
	//	|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ = &ЗаказДоговор) КАК РасчетыПоЗаказамОстатки";
	//	Запрос.УстановитьПараметр("ЗаказДоговор", ДанныеЗаполнения.Ссылка);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		СуммаДокумента = Выборка.СуммаОстаток * -1;
	//	КонецЕсли;
	//	
	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Замена") Тогда
	//	ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
	//	ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
	//	Организация = ДанныеЗаполнения.Основание.Организация;
	//	//Комментарий = ДанныеЗаполнения.Основание.Комментарий; //#5849
	//	Контрагент = ДанныеЗаполнения.Основание.Контрагент;		
	//	Договор = ДанныеЗаполнения.Основание.ДоговорКонтрагента;
	//	ВалютаДокумента = ДанныеЗаполнения.Основание.Валюта;
	//	СуммаДокумента = ?(ДанныеЗаполнения.СуммаДокумента < 0, -ДанныеЗаполнения.СуммаДокумента, 0);
	//	Основание = ДанныеЗаполнения.Ссылка;
	//	
	//	Если СуммаДокумента > 0 И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
	//		НоваяСтрока = РаспределениеПлатежа.Добавить();
	//		НоваяСтрока.Документ = ДанныеЗаполнения.Основание;
	//		НоваяСтрока.Сумма = СуммаДокумента;
	//	КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаДоставку") Тогда
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		Основание = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Экспедитор;
		Договор = ДанныеЗаполнения.Экспедитор.ОсновнойДоговор;
		СуммаДокумента = ДанныеЗаполнения.СтоимостьДоставки;
		ВалютаДокумента = ДанныеЗаполнения.Валюта;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		Основание = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Контрагент.ОсновнойДоговор;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		ВалютаДокумента = ДанныеЗаполнения.Валюта;
		
	//++ №14125
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратПродукции") Тогда
		
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		Основание = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Контрагент.ОсновнойДоговор;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		ВалютаДокумента = ДанныеЗаполнения.Валюта;
		
	//-- №14125
		
	//++ №8498
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ПрочееСписание;
		ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПрочееСписание;
		
		Организация = ДанныеЗаполнения.Организация;
		Основание 	= ДанныеЗаполнения;
		
	//-- №8498
	КонецЕсли;
	
	Если СуммаДокумента > 0 И ЗначениеЗаполнено(Организация) Тогда
		УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
		СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
		СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СуммаДокумента,
	                                          УчитыватьНДС, ,
	                                          УчетНДС.ПолучитьСтавкуНДС(СтавкаНДС));
	КонецЕсли;								

	ФинансыСервер.ДокументРасходаОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ВидОперацииРКО.Пустая() Тогда
		ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику;
	КонецЕсли;
	
	Если ВидОперацииСРС.Пустая() Тогда
		ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
	КонецЕсли;
	
	Если ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, ВидОперацииРКО, Ложь);
		СтатьяРасходовПоНачислению = СтатьяРасходов; //#9708
	Иначе
		СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, ВидОперацииСРС, Ложь);
		СтатьяРасходовПоНачислению = СтатьяРасходов; //#9708
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты();
	
	Автор = Пользователи.ТекущийПользователь();
	СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.НеУтвержден;
	ЖелательнаяДатаПлатежа = Дата(1, 1, 1);
	Основание = Неопределено;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПолеСтатьяДДСОбязательно = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();	
	Если НЕ ЗначениеЗаполнено(Статья) И ПолеСтатьяДДСОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         	НСтр("ru = 'Не заполнена статья движения денежных средств!'"), ЭтотОбъект,
        	"Статья",,Отказ);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда
		Если Ссылка.СтатусУтвержденияПлатежа <> СтатусУтвержденияПлатежа Тогда 
			ОтветственныйУтвердил = Пользователи.ТекущийПользователь();
		КонецЕсли;
	Иначе
		ОтветственныйУтвердил = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	КассовыйДокумент = (ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные);
	ВидОперации = ?(КассовыйДокумент, ВидОперацииРКО, ВидОперацииСРС);
	ФинансыСервер.ДокументРасходаПередЗаписью(ЭтотОбъект, КассовыйДокумент, ВидОперации, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ДенежныеСредстваКВыплате Приход
	Движения.ДенежныеСредстваКВыплате.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваКВыплате.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Заявка = Ссылка;
	Движение.Сумма  = СуммаДокумента;

КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
