Процедура ПроверитьВозможностьВводаНаОснованииЗаявки(ДокументЗаявка, ПлатежНаличные = Неопределено) Экспорт
	
	Если НЕ ДокументЗаявка.Проведен Тогда				
		ТекстОшибки = НСтр("ru='Документ %Документ% не проведен. Ввод на основании разрешен только в проведенном состоянии'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаявка);	
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Если НЕ ДокументЗаявка.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда				
		ТекстОшибки = НСтр("ru='Документ %Документ% находится в статусе ""%Статус%"". Ввод на основании разрешен только в статусе ""Утвержден""'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаявка);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Статус%",   ДокументЗаявка.СтатусУтвержденияПлатежа);	
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если ТипЗнч(ДокументЗаявка) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств")
		И НЕ ПлатежНаличные = Неопределено Тогда
		Если ДокументЗаявка.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные И НЕ ПлатежНаличные Тогда
			ТекстОшибки = НСтр("ru='По документу с типом ДС ""Наличные"" разрешен ввод только расходного кассового ордера'");
			ВызватьИсключение ТекстОшибки;			
		КонецЕсли;
		Если ДокументЗаявка.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные И ПлатежНаличные Тогда
			ТекстОшибки = НСтр("ru='По документу с типом ДС ""Безналичные"" разрешен ввод только списания с расчетного счета'");
			ВызватьИсключение ТекстОшибки;		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеНаОснованииЗаявкиНаПеремещение(ДокументОбъект, Отказ, РежимЗаписи) Экспорт
	
	Если ДокументОбъект.СлужебныйКонтролироватьЗаполнениеЗаявки
		И ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств") Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Основание) ИЛИ ТипЗнч(ДокументОбъект.Основание) <> Тип("ДокументСсылка.ЗаявкаНаПеремещениеДенежныхСредств") Тогда
			ТекстОшибки = "Сохранение/изменение документа разрешено только на основании заявки на перемещение ДС";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , , Отказ);		
		Иначе
			Если ТипЗнч(ДокументОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаНаПеремещениеДенежныхСредств") Тогда
				Если ДокументОбъект.Основание.СтатусУтвержденияПлатежа <> Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда				
					ТекстОшибки = НСтр("ru='Документ %Документ% находится в статусе ""%Статус%"". Ввод на основании разрешен только в статусе ""Утвержден""'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументОбъект.Основание);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Статус%",   ДокументОбъект.Основание.СтатусУтвержденияПлатежа);	
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
				КонецЕсли;
				
				Если ДокументОбъект.Основание.ЖелательнаяДатаПлатежа <> Дата(1, 1, 1) 
					И НачалоДня(ДокументОбъект.Основание.ЖелательнаяДатаПлатежа) <> НачалоДня(ДокументОбъект.Дата) Тогда
					ТекстОшибки = "Дата документа не совпадает с желательной датой заявки на перемещение ДС";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , , Отказ);
				КонецЕсли;
				
				ОстатокКВыплате = РегистрыНакопления.ДенежныеСредстваКВыплате.ОпределитьОстатокКВыплате(ДокументОбъект.Основание, ДокументОбъект.Ссылка);
				Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
					И ОстатокКВыплате - ДокументОбъект.Сумма < 0 Тогда
					ТекстОшибки = НСтр("ru='Сумма перемещений на основании %Документ% превышает сумму заявки'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументОбъект.Основание);					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , , Отказ);	
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеНаОснованииЗаявкиНаРасходование(ДокументОбъект, Отказ, РежимЗаписи) Экспорт
	
	Если ДокументОбъект.СлужебныйКонтролироватьЗаполнениеЗаявки
		И ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств") 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если (НЕ ЗначениеЗаполнено(ДокументОбъект.Основание) ИЛИ ТипЗнч(ДокументОбъект.Основание) <> Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств")) Тогда
			ТекстОшибки = "Проведение документа разрешено только на основании заявки на расходование ДС";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , , Отказ);		
		Иначе
			Если ТипЗнч(ДокументОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
				Если ДокументОбъект.Основание.СтатусУтвержденияПлатежа <> Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда				
					ТекстОшибки = НСтр("ru='Документ %Документ% находится в статусе ""%Статус%"". Ввод на основании разрешен только в статусе ""Утвержден""'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументОбъект.Основание);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Статус%",   ДокументОбъект.Основание.СтатусУтвержденияПлатежа);	
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
				КонецЕсли;
				
				Если ДокументОбъект.Основание.ЖелательнаяДатаПлатежа <> Дата(1, 1, 1) 
					И НачалоДня(ДокументОбъект.Основание.ЖелательнаяДатаПлатежа) <> НачалоДня(ДокументОбъект.Дата) Тогда
					ТекстОшибки = "Дата документа не совпадает с желательной датой заявки на перемещение ДС";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , , Отказ);
				КонецЕсли;
				
				ОстатокКВыплате = РегистрыНакопления.ДенежныеСредстваКВыплате.ОпределитьОстатокКВыплате(ДокументОбъект.Основание, ДокументОбъект.Ссылка);
				Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
					И ОстатокКВыплате - ДокументОбъект.Сумма < 0 Тогда
					ТекстОшибки = НСтр("ru='Сумма расхода на основании %Документ% превышает сумму заявки'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументОбъект.Основание);					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , , Отказ);	
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//проверяем, что распределяемая сумма по типам документов не превышает суммы документа (ПКО, ОБК, ПнРС) (РКО, СсРС, ППИ)
Процедура ПроверитьСуммуРаспределенияПоТипамДокументов(ДокументОбъект, ИмяТЧ = "РаспределениеПлатежа", СуммаРаспределения, Отказ, РежимЗаписи, ЭтоПКО = Ложь) Экспорт
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ТаблицаПроверки = Новый ТаблицаЗначений;
		ТаблицаПроверки.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов("Строка"));
		ТаблицаПроверки.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		
		//++ №7928
		ПроверитьСуммуЗарплатыСотрудникамПоСуммеДокумента(ДокументОбъект, Отказ, РежимЗаписи);
		//-- №7928
		
		Для Каждого ТекущаяСтрока Из ДокументОбъект[ИмяТЧ] Цикл
			ПредставлениеТипа = Строка(ТипЗнч(ТекущаяСтрока.Документ));
			
			Если НЕ ПустаяСтрока(ПредставлениеТипа) Тогда
				НоваяСтрока = ТаблицаПроверки.Добавить();
				НоваяСтрока.ТипДокумента = ПредставлениеТипа;
				НоваяСтрока.Сумма 		 = ТекущаяСтрока.Сумма;
			КонецЕсли;
		КонецЦикла;
		
		ЗапретитьПроводитьПКОПриНеПолномРаспределенииСуммыПоВидуЗаказа = Константы.ЗапретитьПроводитьПКОПриНеПолномРаспределенииСуммыПоВидуЗаказа.Получить();
		
		ТаблицаПроверки.Свернуть("ТипДокумента", "Сумма");
		Для Каждого ТекущаяСтрока Из ТаблицаПроверки Цикл
			Если ТекущаяСтрока.Сумма > СуммаРаспределения Тогда
				ТекстСообщения = "По типам документов """ + ТекущаяСтрока.ТипДокумента + """ распределяется сумма " + ТекущаяСтрока.Сумма + " " + ДокументОбъект.Валюта + ", что больше суммы поступления денег: " + Формат(СуммаРаспределения, "ЧДЦ=2; ЧГ=0") + " . Проведение отменено";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
			Если ЭтоПКО И ЗапретитьПроводитьПКОПриНеПолномРаспределенииСуммыПоВидуЗаказа И ТекущаяСтрока.Сумма < ДокументОбъект.Сумма Тогда
				ТекстСообщения = "По видам документов """ + ТекущаяСтрока.ТипДокумента + """ распределяется сумма " + ТекущаяСтрока.Сумма + " " + ДокументОбъект.Валюта + ", что меньше самого документа поступления денег. Проведение отменено";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьНадписиРаспеределениеПлатежа(УправляемаяФорма, Объект, ИмяТЧ = "РаспределениеПлатежа", ВалютаУчета, ВалютаЗаказаРавнаВалютеДокумента = Истина) Экспорт
	
	//Нужно сначало занулить на форме все надписи, т.к. могли удалить один тип документа и по нему сумма останется
	МассивТипов = новый Массив;
	МассивТипов.Добавить("ЗаказПокупателя");
	МассивТипов.Добавить("ЗаказДоговор");
	МассивТипов.Добавить("СчетНаОплату");
	МассивТипов.Добавить("РеализацияТоваровИУслуг");
	МассивТипов.Добавить("Монтаж");
	
	Для Каждого ТекущаяСтрока Из МассивТипов Цикл
		ИмяЭлемента = "НадписьРаспределение"+ТекущаяСтрока;
		ЭлементФормы = УправляемаяФорма.Элементы.Найти(ИмяЭлемента);
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭлементФормы.Заголовок = Формат(0, "ЧДЦ=2; ЧРГ=; ЧН=0,00");
		КонецЕсли;
	КонецЦикла;	
	
	ТаблицаПроверки = Новый ТаблицаЗначений;
	ТаблицаПроверки.Колонки.Добавить("ВидДокумента", новый ОписаниеТипов("строка"));
	ТаблицаПроверки.Колонки.Добавить("Сумма", новый ОписаниеТипов("число"));
	Для Каждого ТекущаяСтрока Из Объект[ИмяТЧ] Цикл
		ПредставлениеТипа = "";
		Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ПредставлениеТипа = "ЗаказПокупателя";
		ИначеЕсли ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			ПредставлениеТипа = "ЗаказДоговор";		
		ИначеЕсли ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.СчетНаОплату") Тогда
			ПредставлениеТипа = "СчетНаОплату";
		ИначеЕсли ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
			ПредставлениеТипа = "РеализацияТоваровИУслуг";			
		ИначеЕсли ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.Монтаж") Тогда
			ПредставлениеТипа = "Монтаж";	
		КонецЕсли;
		Если НЕ ПустаяСтрока(ПредставлениеТипа) Тогда
			НоваяСтрока = ТаблицаПроверки.Добавить();
			НоваяСтрока.ВидДокумента = ПредставлениеТипа;
			НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПроверки.Свернуть("ВидДокумента","Сумма");
	Для Каждого ТекущаяСтрока Из ТаблицаПроверки Цикл
		ИмяЭлемента = "НадписьРаспределение" + ТекущаяСтрока.ВидДокумента;
		ЭлементФормы = УправляемаяФорма.Элементы.Найти(ИмяЭлемента);
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭлементФормы.Заголовок = Формат(ТекущаяСтрока.Сумма, "ЧДЦ=2; ЧРГ=; ЧН=0,00");
		КонецЕсли;
	КонецЦикла;
	
	//в случае, если валюта поступления ДС отличается от валюты учета
	Если НЕ (Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента) Тогда
		УправляемаяФорма.Элементы[ИмяТЧ + "СуммаДокумента"].Заголовок = "Сумма документа, в " + Объект.Валюта.Наименование;
		УправляемаяФорма.Элементы[ИмяТЧ + "ОсталосьРаспределить"].Заголовок = "Осталось распределить, в " + Объект.Валюта.Наименование;
		УправляемаяФорма.Элементы[ИмяТЧ + "Сумма"].Заголовок = "Сумма распределения, в " + Объект.Валюта.Наименование;
		УправляемаяФорма.Элементы[ИмяТЧ + "СуммаДокументаВВалютеДокумента"].Видимость = Истина;
		УправляемаяФорма.Элементы[ИмяТЧ + "ВалютаДокумента"].Видимость = Истина;
		УправляемаяФорма.Элементы[ИмяТЧ + "СуммаВВалютеДокумента"].Видимость = Истина;
	Иначе
		УправляемаяФорма.Элементы[ИмяТЧ + "СуммаДокумента"].Заголовок = "Сумма документа";
		УправляемаяФорма.Элементы[ИмяТЧ + "ОсталосьРаспределить"].Заголовок = "Осталось распределить";
		УправляемаяФорма.Элементы[ИмяТЧ + "Сумма"].Заголовок = "Сумма распределения";
		УправляемаяФорма.Элементы[ИмяТЧ + "СуммаДокументаВВалютеДокумента"].Видимость = Ложь;
		УправляемаяФорма.Элементы[ИмяТЧ + "ВалютаДокумента"].Видимость = Ложь;
		УправляемаяФорма.Элементы[ИмяТЧ + "СуммаВВалютеДокумента"].Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры	

Функция ОпределитьРазличиеВалютыЗаказаИВалютыДокумента(Объект, ИмяТЧ = "РаспределениеПлатежа") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаЗаказаРавнаВалютеДокумента = Истина;
	Для Каждого СтрокаРаспределения Из Объект[ИмяТЧ] Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаРаспределения.Документ) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ СтрокаРаспределения.Документ.Валюта = Объект.Валюта Тогда
			ВалютаЗаказаРавнаВалютеДокумента = Ложь
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВалютаЗаказаРавнаВалютеДокумента;
	
КонецФункции

Процедура КонтрольОстатковДС(ДокументОбъект, ВКассе = Истина, Отказ) Экспорт
	
	Если НЕ Константы.НеКонтролироватьОстатокДенежныхСредств.Получить() Тогда
		//контроль остатка денежных средств
		ДатаДокумента = ДокументОбъект.Дата;
		СчетКасса = ?(ВКассе, ДокументОбъект.Касса, ДокументОбъект.Счет);
		Если ДатаДокумента = Дата(1,1,1) Тогда
			ДатаДокумента = ТекущаяДатаСеанса();
		КонецЕсли;
		Сумма = 0;
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаДокумента", ДокументОбъект.Метаданные()) Тогда
			Сумма = ДокументОбъект.СуммаДокумента;
		Иначе
		    Сумма = ДокументОбъект.Сумма;
		КонецЕсли;
		СуммаОстаток = 0;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(
		|			&ДатаОстатков,
		|			Валюта = &Валюта
		|				И Организация = &Организация
		|				И СчетКасса = &СчетКасса) КАК ДенежныеСредстваОстатки";
		Запрос.УстановитьПараметр("ДатаОстатков",	ДатаДокумента);
		Запрос.УстановитьПараметр("Валюта",			ДокументОбъект.Валюта);
		Запрос.УстановитьПараметр("Организация",	ДокументОбъект.Организация);
		Запрос.УстановитьПараметр("СчетКасса",		СчетКасса);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СуммаОстаток = Выборка.СуммаОстаток;
		КонецЦикла;
		Если СуммаОстаток < Сумма Тогда
			ТекстСообщения = "" + ?(ВКассе, "В кассе ", "На расчетном счете ") + СчетКасса + " организации " + ДокументОбъект.Организация + " остаток средств = " + СуммаОстаток + " " + ДокументОбъект.Валюта + 
							 ". Не хватает " + (Сумма - СуммаОстаток)+ " " + ДокументОбъект.Валюта;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДокументРасходаОбработкаЗаполнения(ДокументОбъект, ДанныеЗаполнения) Экспорт
	
	ЭтоЗаявка = (ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств"));
	ЭтоКассовыйДокумент = (ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		СуммаДокумента = -РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(ДанныеЗаполнения);
		СуммаДокумента = ?(СуммаДокумента < 0, 0, СуммаДокумента);
		Если ЭтоЗаявка Тогда
			ДокументОбъект.ВидОперацииРКО 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.ВидОперацииСРС 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.ВалютаДокумента 	 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.СуммаДокумента 	 = СуммаДокумента;
		ИначеЕсли ЭтоКассовыйДокумент Тогда
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.Сумма 		 = СуммаДокумента;
		Иначе
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.Сумма 		 = СуммаДокумента;
		КонецЕсли;
		//ДокументОбъект.Ответственный = ДанныеЗаполнения.Ответственный; //#8871 закомментировано
		ДокументОбъект.Договор 		 = ДанныеЗаполнения.ДоговорКонтрагента;
		ДокументОбъект.Контрагент  	 = ДанныеЗаполнения.Контрагент;
		ДокументОбъект.Организация 	 = ДанныеЗаполнения.Организация;
		Если ЭтоЗаявка ИЛИ НЕ ЭтоКассовыйДокумент Тогда
			ДокументОбъект.Счет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
			ДокументОбъект.СчетКонтрагента = ДанныеЗаполнения.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;
		
		ДобавитьОснование(ДокументОбъект, ДанныеЗаполнения);
		
		НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения;
		НоваяСтрока.Сумма = СуммаДокумента;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		СуммаДокумента = -РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(ДанныеЗаполнения);
		СуммаДокумента = ?(СуммаДокумента < 0, 0, СуммаДокумента);
		Если ЭтоЗаявка Тогда
			ДокументОбъект.ВидОперацииРКО 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.ВидОперацииСРС 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.ВалютаДокумента 	 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.СуммаДокумента 	 = СуммаДокумента;
		ИначеЕсли ЭтоКассовыйДокумент Тогда
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.Сумма 		 = СуммаДокумента;
		Иначе
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.Сумма 		 = СуммаДокумента;
		КонецЕсли;
		//ДокументОбъект.Ответственный = ДанныеЗаполнения.Ответственный; //#8871 закомментировано
		ДокументОбъект.Договор 		 = ДанныеЗаполнения.ДоговорКонтрагента;
		ДокументОбъект.Контрагент  	 = ДанныеЗаполнения.Контрагент;
		ДокументОбъект.Организация 	 = ДанныеЗаполнения.Организация;
		Если ЭтоЗаявка ИЛИ НЕ ЭтоКассовыйДокумент Тогда
			ДокументОбъект.Счет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
			ДокументОбъект.СчетКонтрагента = ДанныеЗаполнения.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;
		
		ДобавитьОснование(ДокументОбъект, ДанныеЗаполнения);		
		
		НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения;
		НоваяСтрока.Сумма = СуммаДокумента;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		СуммаДокумента = -РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(ДанныеЗаполнения);
		СуммаДокумента = ?(СуммаДокумента < 0, 0, СуммаДокумента);
		Если ЭтоЗаявка Тогда
			ДокументОбъект.ВидОперацииРКО 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.ВидОперацииСРС 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.ВалютаДокумента 	 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.СуммаДокумента 	 = СуммаДокумента;
		ИначеЕсли ЭтоКассовыйДокумент Тогда
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.Сумма 		 = СуммаДокумента;
		Иначе
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.Сумма 		 = СуммаДокумента;
		КонецЕсли;
		//ДокументОбъект.Ответственный = ДанныеЗаполнения.Ответственный; //#8871 закомментировано
		ДокументОбъект.Договор 		 = ДанныеЗаполнения.ДоговорКонтрагента;
		ДокументОбъект.Контрагент  	 = ДанныеЗаполнения.Контрагент;
		ДокументОбъект.Организация 	 = ДанныеЗаполнения.Организация;
		Если ЭтоЗаявка ИЛИ НЕ ЭтоКассовыйДокумент Тогда
			ДокументОбъект.Счет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
			ДокументОбъект.СчетКонтрагента = ДанныеЗаполнения.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;
		
		ДобавитьОснование(ДокументОбъект, ДанныеЗаполнения);
		
		НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения;
		НоваяСтрока.Сумма = СуммаДокумента;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		СуммаДокумента = -РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(ДанныеЗаполнения);
		СуммаДокумента = ?(СуммаДокумента < 0, 0, СуммаДокумента);
		Если ЭтоЗаявка Тогда
			ДокументОбъект.ВидОперацииРКО 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.ВидОперацииСРС 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.ВалютаДокумента 	 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.СуммаДокумента 	 = СуммаДокумента;
		ИначеЕсли ЭтоКассовыйДокумент Тогда
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.Сумма 		 = СуммаДокумента;
		Иначе
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.Сумма 		 = СуммаДокумента;
		КонецЕсли;
		//ДокументОбъект.Ответственный = ДанныеЗаполнения.Ответственный; //#8871 закомментировано
		ДокументОбъект.Договор 		 = ДанныеЗаполнения.ДоговорКонтрагента;
		ДокументОбъект.Контрагент  	 = ДанныеЗаполнения.Контрагент;
		ДокументОбъект.Организация 	 = ДанныеЗаполнения.Организация;
		Если ЭтоЗаявка ИЛИ НЕ ЭтоКассовыйДокумент Тогда
			ДокументОбъект.Счет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
			ДокументОбъект.СчетКонтрагента = ДанныеЗаполнения.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;
		
		ДобавитьОснование(ДокументОбъект, ДанныеЗаполнения);
		
		НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения;
		НоваяСтрока.Сумма = СуммаДокумента;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		СуммаДокумента = -РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(ДанныеЗаполнения);
		СуммаДокумента = ?(СуммаДокумента < 0, 0, СуммаДокумента);
		Если ЭтоЗаявка Тогда
			ДокументОбъект.ВидОперацииРКО 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.ВидОперацииСРС 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.ВалютаДокумента 	 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.СуммаДокумента 	 = СуммаДокумента;
		ИначеЕсли ЭтоКассовыйДокумент Тогда
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.Сумма 		 = СуммаДокумента;
		Иначе
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Валюта;
			ДокументОбъект.Сумма 		 = СуммаДокумента;
		КонецЕсли;
		//ДокументОбъект.Ответственный = ДанныеЗаполнения.Ответственный; //#8871 закомментировано
		ДокументОбъект.Договор 		 = ДанныеЗаполнения.ДоговорКонтрагента;
		ДокументОбъект.Контрагент  	 = ДанныеЗаполнения.Контрагент;
		ДокументОбъект.Организация 	 = ДанныеЗаполнения.Организация;
		Если ЭтоЗаявка ИЛИ НЕ ЭтоКассовыйДокумент Тогда
			ДокументОбъект.Счет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
			ДокументОбъект.СчетКонтрагента = ДанныеЗаполнения.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;
		
		ДобавитьОснование(ДокументОбъект, ДанныеЗаполнения);
		
		НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения;
		НоваяСтрока.Сумма = СуммаДокумента;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Замена") Тогда
		СуммаДокумента = ?(ДанныеЗаполнения.СуммаДокумента < 0, -ДанныеЗаполнения.СуммаДокумента, 0);
		Если ЭтоЗаявка Тогда
			ДокументОбъект.ВидОперацииРКО 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.ВидОперацииСРС 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.СуммаДокумента 	 = СуммаДокумента;
			ДокументОбъект.ВалютаДокумента   = ДанныеЗаполнения.Основание.Валюта;
		ИначеЕсли ЭтоКассовыйДокумент Тогда
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
			ДокументОбъект.Сумма	 	 = СуммаДокумента;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Основание.Валюта;
		Иначе
			ДокументОбъект.ВидОперации 	 = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю;
			ДокументОбъект.Сумма	 	 = СуммаДокумента;
			ДокументОбъект.Валюта 		 = ДанныеЗаполнения.Основание.Валюта;
		КонецЕсли;
		ДокументОбъект.Договор 		= ДанныеЗаполнения.Основание.ДоговорКонтрагента;
		ДокументОбъект.Контрагент 	= ДанныеЗаполнения.Основание.Контрагент;
		ДокументОбъект.Организация 	= ДанныеЗаполнения.Основание.Организация;
		Если ЭтоЗаявка ИЛИ НЕ ЭтоКассовыйДокумент Тогда
			ДокументОбъект.Счет = ДанныеЗаполнения.Основание.Организация.ОсновнойБанковскийСчет;
			ДокументОбъект.СчетКонтрагента = ДанныеЗаполнения.Основание.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;
		
		ДобавитьОснование(ДокументОбъект, ДанныеЗаполнения);
		
		Если СуммаДокумента > 0 И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ДанныеЗаполнения.Основание;
			НоваяСтрока.Сумма = СуммаДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДокументРасходаПередЗаписью(ДокументОбъект, КассовыйДокумент = Истина, ВидОперации, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если КассовыйДокумент Тогда
		Если НЕ ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику 
			И НЕ ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю Тогда
			ДокументОбъект.РаспределениеПлатежа.Очистить();
		КонецЕсли;
		//#12545
		Если ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.Инкассация Тогда
			ДокументОбъект.СтатьяРасходов = Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам Тогда
			ДокументОбъект.ПериодРегистрации = Дата(1,1,1);
			ДокументОбъект.ЗарплатаСотрудникам.Очистить();
		КонецЕсли;
		
	Иначе
		Если НЕ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику 
			И НЕ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю Тогда
			ДокументОбъект.РаспределениеПлатежа.Очистить();
		КонецЕсли;
		
		Если Не (ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику
			Или ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам
			Или ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику) Тогда
			ДокументОбъект.КодВидаДохода = "";
		КонецЕсли;
		
		Если НЕ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику 
			И НЕ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам Тогда
			ДокументОбъект.ПериодРегистрации = Дата(1,1,1);
		КонецЕсли;
		
		//#12545
		Если ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ИнкассацияИзБанка Тогда
			ДокументОбъект.СтатьяРасходов = Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();
		КонецЕсли;
		
		//#13333
		Если ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам Тогда
			ДокументОбъект.Контрагент = Неопределено;
		Иначе
			ДокументОбъект.ЗарплатаСотрудникам.Очистить();
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДокументПриходаПередЗаписью(ДокументОбъект, КассовыйДокумент = Истина, ВидОперации, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если КассовыйДокумент Тогда		
		Если НЕ ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя 
			И НЕ ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПоставщика
			И НЕ ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ПолучениеКредита
			И НЕ ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратЗайма Тогда
			ДокументОбъект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			ДокументОбъект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			
			ДокументОбъект.РаспределениеПлатежа.Очистить();
		КонецЕсли;
		
		Если НЕ ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПодотчетника Тогда
			ДокументОбъект.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
		КонецЕсли;
		
		//#12545
		Если ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ПолучениеНаличныхИзБанка Тогда
			ДокументОбъект.СтатьяДоходов = Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();
		КонецЕсли;
	Иначе		
		//#12545
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ИнкассацияВБанк Тогда
			ДокументОбъект.СтатьяДоходов = Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаголовокНадписиОстатковДС(СчетКасса, Организация, ОстатокДенежныхСредств = 0, Знач Валюта = Неопределено) Экспорт
	
	КрупныйШрифт = Новый Шрифт(,11);
	МелкийШрифт  = Новый Шрифт(,8);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетКасса", СчетКасса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПоВсемВалютам", Валюта = Неопределено);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваОстатки.Валюта КАК Валюта,
	|	ДенежныеСредстваОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(
	|			,
	|			Организация = &Организация
	|				И СчетКасса = &СчетКасса
	|				И (&ПоВсемВалютам
	|					ИЛИ Валюта = &Валюта)) КАК ДенежныеСредстваОстатки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сумма = Выборка.Сумма;
		Валюта = Выборка.Валюта;
	Иначе
		Сумма = 0;
		Если ТипЗнч(СчетКасса) = Тип("СправочникСсылка.Кассы") Тогда
			Валюта = СчетКасса.Валюта;
		ИначеЕсли ТипЗнч(СчетКасса) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			Валюта = СчетКасса.Валюта;
		КонецЕсли;
	КонецЕсли;
	
	ОстатокДенежныхСредств = Сумма;
	
	КомпонентыФС = Новый Массив;
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Остаток'") + " ", КрупныйШрифт));
	
	СуммаСтрокой = Формат(Сумма, "ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0,00");
	ПозицияРазделителя = СтрНайти(СуммаСтрокой, ",");
	КомпонентыЧисла = Новый Массив;
	КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Лев(СуммаСтрокой, ПозицияРазделителя), КрупныйШрифт));
	КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Сред(СуммаСтрокой, ПозицияРазделителя+1), МелкийШрифт));
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(КомпонентыЧисла));
	
	КомпонентыФС.Добавить(" " + Валюта.Наименование);
	
	Возврат Новый ФорматированнаяСтрока(КомпонентыФС, , WebЦвета.ТусклоСерый);
	
КонецФункции

Процедура ОбновитьВидимостьИКурсВалюты(Форма, РеквизитВалюта = "Валюта") Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Элементы.Найти("ПредставлениеКурсаВалюты") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	 
	КрупныйШрифт = Новый Шрифт(,11);
	МелкийШрифт  = Новый Шрифт(,8);

	ВалютаУчета = ПолучитьФункциональнуюОпцию("ВалютаУчета");
	ВалютаДокумента = Объект[РеквизитВалюта];
	Если ВалютаДокумента = ВалютаУчета Тогда
		Элементы.ПредставлениеКурсаВалюты.Видимость = Ложь;
	Иначе
		Элементы.ПредставлениеКурсаВалюты.Видимость = Истина;
		ДатаКурса = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
		Курс = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаДокумента, ВалютаУчета, ДатаКурса, 1);
		
		КомпонентыФС = Новый Массив;
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Курс'") + " ", КрупныйШрифт));
		
		//СуммаСтрокой = Формат(Курс, "ЧДЦ=4; ЧРД=,; ЧРГ=' '; ЧН=0,0000");
		//ПозицияРазделителя = СтрНайти(СуммаСтрокой, ",");
		//КомпонентыЧисла = Новый Массив;
		//КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Лев(СуммаСтрокой, ПозицияРазделителя), КрупныйШрифт));
		//КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Сред(СуммаСтрокой, ПозицияРазделителя+1), МелкийШрифт));
		//КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(КомпонентыЧисла));
		//
		//КомпонентыФС.Добавить(" " + ВалютаУчета.Наименование);
		//
		//Элементы.ПредставлениеКурсаВалюты.Заголовок = Новый ФорматированнаяСтрока(КомпонентыФС, , WebЦвета.ЗеленыйЛес);
		
		СуммаСтрокой = Формат(Курс, "ЧДЦ=4; ЧРД=,; ЧРГ=' '; ЧН=0,0000");		
		Элементы.ПредставлениеКурсаВалюты.Заголовок = "1 " + ВалютаДокумента.Наименование + " = " + СуммаСтрокой + " " + ВалютаУчета.Наименование;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОснование(ДокументОбъект, ДанныеЗаполнения) Экспорт
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Основание", ДокументОбъект.Метаданные()) Тогда
		ДокументОбъект.Основание = ДанныеЗаполнения;
		
	ИначеЕсли НЕ ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Основания") = Неопределено Тогда
		НоваяСтрока = ДокументОбъект.Основания.Добавить();
		НоваяСтрока.Основание = ДанныеЗаполнения;
		
	КонецЕсли;
	
КонецПроцедуры
	
#Область СтатьяДоходовРасходов

Процедура УстановитьВидимостьКолонокСтатейДиРВТабличнойЧасти(Форма, МассивЭлементов, УчитыватьНекассовыйМетод = Ложь, УчитыватьКассовыйМетод = Ложь) Экспорт
	
	ВыводитьСтатью = ПолучитьФункциональнуюОпцию("ИспользоватьВедениеУчетаДоходовРасходовПострочно");
	Если ВыводитьСтатью И УчитыватьНекассовыйМетод И НЕ ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов Тогда 
		ВыводитьСтатью = Ложь;
	КонецЕсли;
	Если ВыводитьСтатью И УчитыватьКассовыйМетод И НЕ ПараметрыСеанса.ФинРезультатКассовыйМетодВеденияУчетаДоходовРасходов Тогда 
		ВыводитьСтатью = Ложь;
	КонецЕсли;
		
	Для Каждого ТекущийЭлемент Из МассивЭлементов Цикл
		Попытка
			Форма.Элементы[ТекущийЭлемент].Видимость = ВыводитьСтатью;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтатьюДоходовРасходов(Знач ФормаОбъект, Знач ВидОперации = Неопределено, ЭтоДоход = Истина, Знач Организация = Неопределено, Знач Подразделение = Неопределено) Экспорт
	
	Если НЕ ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		Возврат Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();
	КонецЕсли;
	
	//НаборЗаписей = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.ТипДокумента.Установить(ИмяДокумента);
	//НаборЗаписей.Отбор.ВидОперации.Установить(ВидОперации);
	//НаборЗаписей.Прочитать();
	//МассивРезультата = НаборЗаписей.ВыгрузитьКолонку("СтатьяДоходовРасходов"); 
	//Если МассивРезультата.Количество() > 0 Тогда
	//	//ВыбСтатья = МассивРезультата[0];
	//	Для каждого ВыбСтатья из МассивРезультата Цикл
	//		Если (ЭтоДоход И ВыбСтатья.ИспользуетсяВУчетеДоходов)
	//			ИЛИ (НЕ ЭтоДоход И ВыбСтатья.ИспользуетсяВУчетеРасходов) Тогда
	//			Возврат ВыбСтатья;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	Если ТипЗнч(ФормаОбъект) = Тип("ДанныеФормыСтруктура") Тогда
		МетаданныеОбъекта = ФормаОбъект.Ссылка.Метаданные();
	Иначе
		МетаданныеОбъекта = ФормаОбъект.Метаданные();
	КонецЕсли;
	ИмяДокумента = МетаданныеОбъекта.Имя;
	
	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.ПустаяСсылка();
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеОбъекта) Тогда
			Организация = ФормаОбъект["Организация"];	
		КонецЕсли;
	КонецЕсли;
	Если Подразделение = Неопределено Тогда
		Подразделение = Справочники.Подразделения.ПустаяСсылка();
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", МетаданныеОбъекта) Тогда
			Подразделение = ФормаОбъект["Подразделение"];	
		КонецЕсли;
	КонецЕсли;
	
	ТипСтатьи = ?(ЭтоДоход, Перечисления.ТипыСтатейДоходовРасходов.Доход, Перечисления.ТипыСтатейДоходовРасходов.Расход); 
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеОбъекта) Тогда
		Контрагент = ФормаОбъект["Контрагент"];	
		Если НЕ ЭтоДоход И Контрагент <> Неопределено И ЗначениеЗаполнено(Контрагент.СтатьяРасходов) Тогда
			Возврат Контрагент.СтатьяРасходов;
		КонецЕсли;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипДокумента", ИмяДокумента);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	Запрос.УстановитьПараметр("ТипСтатьи", ТипСтатьи);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Приоритет,
	|	ДанныеРегистра.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.НастройкиСтатейДоходовРасходовПоУмолчанию КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ТипДокумента = &ТипДокумента
	|	И (ДанныеРегистра.ВидОперации = &ВидОперации ИЛИ &ВидОперации = Неопределено)
	|	И ДанныеРегистра.ТипСтатьи = &ТипСтатьи
	|	И НЕ ДанныеРегистра.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И НЕ ДанныеРегистра.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ДанныеРегистра.Организация = &Организация
	|	И ДанныеРегистра.Подразделение = &Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ДанныеРегистра.СтатьяДоходовРасходов
	|ИЗ
	|	РегистрСведений.НастройкиСтатейДоходовРасходовПоУмолчанию КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ТипДокумента = &ТипДокумента
	|	И (ДанныеРегистра.ВидОперации = &ВидОперации ИЛИ &ВидОперации = Неопределено)
	|	И ДанныеРегистра.ТипСтатьи = &ТипСтатьи
	|	И ДанныеРегистра.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И НЕ ДанныеРегистра.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ДанныеРегистра.Подразделение = &Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ДанныеРегистра.СтатьяДоходовРасходов
	|ИЗ
	|	РегистрСведений.НастройкиСтатейДоходовРасходовПоУмолчанию КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ТипДокумента = &ТипДокумента
	|	И (ДанныеРегистра.ВидОперации = &ВидОперации ИЛИ &ВидОперации = Неопределено)
	|	И ДанныеРегистра.ТипСтатьи = &ТипСтатьи
	|	И НЕ ДанныеРегистра.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ДанныеРегистра.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ДанныеРегистра.Организация = &Организация
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ДанныеРегистра.СтатьяДоходовРасходов
	|ИЗ
	|	РегистрСведений.НастройкиСтатейДоходовРасходовПоУмолчанию КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ТипДокумента = &ТипДокумента
	|	И (ДанныеРегистра.ВидОперации = &ВидОперации ИЛИ &ВидОперации = Неопределено)
	|	И ДанныеРегистра.ТипСтатьи = &ТипСтатьи
	|	И ДанныеРегистра.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ДанныеРегистра.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатьяДоходовРасходов;
	КонецЕсли;
	
	Возврат Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();
	
КонецФункции

// Процедура устанавливает отметку незаполненности в зависимости от настроек системы.
//
// Параметры:
// 		ЭлементыФормы - ВсеЭлементыФормы - элементы формы документа
// 		ИмяЭлемента - Строка - имя элемента формы договора.
//
Процедура УстановитьОтметкуНезаполненныхСтатейДоходовРасходов(ЭлементыФормы) Экспорт
	
	//ЗаполнениеОбязательно = ПолучитьФункциональнуюОпцию("ИспользоватьВедениеУчетаДоходовРасходов") И ПолучитьФункциональнуюОпцию("НекассовыйМетодВеденияУчетаДоходовРасходов");
	ЗаполнениеОбязательно = ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, "СтатьяДоходов",  "АвтоОтметкаНезаполненного", ЗаполнениеОбязательно);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, "СтатьяРасходов", "АвтоОтметкаНезаполненного", ЗаполнениеОбязательно);
	Если Не ЗаполнениеОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, "СтатьяДоходов",  "ОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, "СтатьяРасходов", "ОтметкаНезаполненного", Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет заполнение статей доходов/расходов.
// Вызывается из обработчика ПередЗаписьюНаСервере формы объекта.
//
// Параметры:
//  Форма         - УправляемаяФорма 
//  ТекущийОбъект - Объект 
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, ПроверятьСтатьюДоходов = Истина, ПроверятьСтатьюРасходов = Истина) Экспорт
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущийОбъект, "СтатьяДоходов") И ПроверятьСтатьюДоходов Тогда
			Если ТекущийОбъект.СтатьяДоходов.Пустая() 
				И ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов Тогда
				ТекстОшибки = "Поле ""Статья доходов"" не заполнено, в проведении отказано!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "Объект.СтатьяДоходов", , Отказ);			
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущийОбъект, "СтатьяРасходов") И ПроверятьСтатьюРасходов Тогда
			Если ТекущийОбъект.СтатьяРасходов.Пустая() 
				И ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов Тогда
				ТекстОшибки = "Поле ""Статья расходов"" не заполнено, в проведении отказано!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "Объект.СтатьяРасходов", , Отказ);			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеПроцедурыДляППИ_СсРС

Процедура УказатьСуммуИНДСВНазначенииПлатежа(Объект, УчитыватьНДС) Экспорт
	
	ПозицияСуммы = СтрНайти(Объект.НазначениеПлатежа, "Сумма ");
	Если ПозицияСуммы = 0 И ЗначениеЗаполнено(Объект.НазначениеПлатежа) Тогда
		ТекстНазначение = Объект.НазначениеПлатежа;
	Иначе
		ТекстНазначение = СокрЛП(Лев(Объект.НазначениеПлатежа, ПозицияСуммы - 1));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекстНазначение) Тогда
		ТекстНазначение = Объект.НазначениеПлатежа;
	КонецЕсли;
	
	ТекстСумма = Строка(Формат(Объект.Сумма, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
	
	ТекстНДС = "";
	ЧислоСтавкаНДС = УчетНДС.ПолучитьСтавкуНДС(Объект.СтавкаНДС);
	
	Если УчитыватьНДС И ЗначениеЗаполнено(Объект.СтавкаНДС) И ЧислоСтавкаНДС > 0 Тогда
		ТекстНДС = НСтр("ru = 'НДС(%СтавкаНДС%) %СуммаНДС%'");
		ТекстНДС = СтрЗаменить(ТекстНДС, "%СтавкаНДС%", Строка(Объект.СтавкаНДС));
		ТекстНДС = СтрЗаменить(ТекстНДС, "%СуммаНДС%", Строка(Формат(Объект.СуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")));
	КонецЕсли;
	
	Если УчитыватьНДС Тогда
		ТекстНазначениеПлатежа = НСтр("ru = '%ТекстНазначение% %ТекстСумма% %ЗначениеСтавкиНДС% %ТекстНДС%'");
	Иначе
		ТекстНазначениеПлатежа = НСтр("ru = '%ТекстНазначение% %ТекстСумма%'");
	КонецЕсли;
	
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ТекстНазначение%", ТекстНазначение);
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ТекстСумма%", "Сумма "+ТекстСумма);
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ЗначениеСтавкиНДС%", ?(ЧислоСтавкаНДС > 0, НСтр("ru = 'в т.ч.'"), НСтр("ru = 'Без налога (НДС)'")));
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ТекстНДС%", ТекстНДС);
	
	Объект.НазначениеПлатежа = СокрЛП(ТекстНазначениеПлатежа);
	
КонецПроцедуры

Функция ПолучитьСчетСотрудника(Сотрудник) Экспорт
	
	Если Сотрудник.Пустая() Тогда
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Сотрудник
	|	И НЕ БанковскиеСчета.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	БанковскиеСчета.Код УБЫВ";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Печать

Функция СформироватьПечатнуюФормуПлатежногоПоручения(МассивОбъектов, ОбъектыПечати) Экспорт

	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ПлатежноеПоручение");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПлатежноеПоручение";
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбъектов[0]);
	
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	МенеджерОбъекта.ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ПервыйДокумент = Истина;
    Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);		
		ОбластьМакета.Параметры.НаименованиеНомер = "ПЛАТЕЖНОЕ ПОРУЧЕНИЕ № " + Строка(ДанныеПечати.Номер);
		//ОбластьМакета.Параметры.ДатаДокумента = Формат(Объект.Дата, "ДЛФ=Д");
		//ОбластьМакета.Параметры.СуммаПрописью = РаботаСВалютой.СформироватьЧислоПрописьюВсп(Объект.Сумма, Объект.Валюта, "Л = ru_RU; ДП = Ложь");
		//ОбластьМакета.Параметры.СуммаЧислом = Формат(Объект.Сумма, "ЧДЦ=2; ЧРД=-");
	
		// плательщик
		//ОбластьМакета.Параметры.ТекстПлательщика = Объект.Организация.ПолноеНаименование;
		//ОбластьМакета.Параметры.НомерСчетаПлательщика = Объект.Счет.НомерСчета;
		//ОбластьМакета.Параметры.ИННПлательщика = "ИНН " + ДанныеПечати.ОрганизацияИНН;
		//ОбластьМакета.Параметры.КПППлательщика = "КПП " + ДанныеПечати.ОрганизацияКПП;
	
		//ОбластьМакета.Параметры.БИКБанкаПлательщика = Объект.Счет.БИК;
		//ОбластьМакета.Параметры.СчетБанкаПлательщика = Объект.Счет.Коррсчет;
		Попытка
			ОбластьМакета.Параметры.НаименованиеБанкаПлательщика = ДанныеПечати.НаименованиеБанкаПлательщика + " " + ДанныеПечати.ГородБанкаПлательщика;
		Исключение	  
		КонецПопытки;
		
		// получатель
		//Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		//	Попытка
		//		ОбластьМакета.Параметры.ТекстПолучателя = ?(НЕ ПустаяСтрока(Объект.Контрагент.НаименованиеПолное), Объект.Контрагент.НаименованиеПолное, Объект.Контрагент.Наименование);
		//		ОбластьМакета.Параметры.КПППолучателя = "КПП " + ДанныеПечати.КонтрагентКПП;		
		//	Исключение
		//	КонецПопытки;	
		//ИначеЕсли ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Сотрудники") Тогда
		//	Попытка	
		//		ОбластьМакета.Параметры.ТекстПолучателя = Объект.Контрагент.Наименование;
		//	Исключение
		//	КонецПопытки;	
		//КонецЕсли;
		
		Попытка
			//ОбластьМакета.Параметры.ИННПолучателя = "ИНН " + Объект.Контрагент.ИНН;
			//ОбластьМакета.Параметры.НомерСчетаПолучателя = Объект.СчетКонтрагента.НомерСчета;
			//
			//ОбластьМакета.Параметры.БИКБанкаПолучателя = Объект.СчетКонтрагента.БИК;
			//ОбластьМакета.Параметры.СчетБанкаПолучателя = Объект.СчетКонтрагента.Коррсчет;
			ОбластьМакета.Параметры.НаименованиеБанкаПолучателя = ДанныеПечати.НаименованиеБанкаПолучателя + " " + ДанныеПечати.ГородБанкаПолучателя;
		Исключение	  
		КонецПопытки;
		
		//ОбластьМакета.Параметры.НазначениеПлатежа = Объект.НазначениеПлатежа;
		
		//Если Объект.ПеречислениеВБюджет Тогда
		//	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Объект, "СтатусСоставителя,КодБК,КодОКАТО,ПоказательОснования,ПоказательПериода,ПоказательНомера,ПоказательДаты");	
		//КонецЕсли;
		
		//ОбластьМакета.Параметры.ИдентификаторПлатежа = Объект.ИдентификаторПлатежа;
		//ОбластьМакета.Параметры.Очередность = Объект.ОчередностьПлатежа;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
		
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуПриложения(МассивОбъектов, ОбъектыПечати) Экспорт
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПриложениеСписокСотрудников");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПлатежноеПоручение_Приложение";
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбъектов[0]);
	
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ВыборкаПоЗарплате 		 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиЗарплата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	МенеджерОбъекта.ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ПервыйДокумент = Истина;
    Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;	
	
		Если НЕ ДанныеПечати.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Ошибка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			Продолжить;
			//Возврат ТабличныйДокумент;
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			//ОбластьМакета.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Объект.Номер);
			ОбластьМакета.Параметры.Дата = Формат(ДанныеПечати.Дата, "ДЛФ=Д");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
	
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоЗарплате.Сбросить();
		Если ВыборкаПоЗарплате.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоЗарплате.Выбрать();			
			Пока Выборка.Следующий() Цикл				
				Попытка
					ОбластьМакета = Макет.ПолучитьОбласть("Строка");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);	
					ТабличныйДокумент.Вывести(ОбластьМакета);
				Исключение
				КонецПопытки;
			КонецЦикла;		
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
		
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

// №7928 осуществляет сверку суммы таблицы ЗапралатаСотрудникам с суммой документа (РКО, Списание с р/с, Заявка на расходование ДС, Платежное поручение исх.)
Процедура ПроверитьСуммуЗарплатыСотрудникамПоСуммеДокумента(ДокументОбъект, Отказ, РежимЗаписи) Экспорт
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если (ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") И ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам)
			ИЛИ (ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") И ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам)
			ИЛИ (ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") И (ДокументОбъект.ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам ИЛИ ДокументОбъект.ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам))
			ИЛИ (ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") И ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам)
		Тогда	
		
			СуммаДокумента = 0;
			Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
				СуммаДокумента = ДокументОбъект.СуммаДокумента;
			Иначе
				СуммаДокумента = ДокументОбъект.Сумма;
			КонецЕсли;	
				
			СуммаЗарплаты = ДокументОбъект.ЗарплатаСотрудникам.Итог("Сумма");
			
			Если НЕ СуммаЗарплаты = СуммаДокумента Тогда
				ТекстСообщения = "Распределенная сумма зарплаты по сотрудникам " + СуммаЗарплаты + " " + ДокументОбъект.Валюта + ", не равняется сумме самого документа. Проведение отменено.";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОбщиеПроцедурыДляДокументовПоступленияОплат

Процедура ДобавитьОснованиеЗаказаВРаспределениеПлатежа(Знач ДокументЗаказ, ТабличнаяЧасть_РаспределениеПлатежа, СуммаДокумента) Экспорт
	
	СписокДокументовКДобавлению = Новый ТаблицаЗначений;
	СписокДокументовКДобавлению.Колонки.Добавить("Документ");
	СписокДокументовКДобавлению.Колонки.Добавить("СуммаДокумента");
	
	Если ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.СчетНаОплату")
		или ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.ЗаказДоговор")
		или ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") 
		или ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.Монтаж")
		или ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") 
		Тогда
		НоваяСтрока = СписокДокументовКДобавлению.Добавить();
		НоваяСтрока.Документ = ДокументЗаказ;
		НоваяСтрока.СуммаДокумента = ДокументЗаказ.СуммаДокумента;
	ИначеЕсли ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.Замена") Тогда
		НоваяСтрока = СписокДокументовКДобавлению.Добавить();
		НоваяСтрока.Документ = ДокументЗаказ.Основание;
		НоваяСтрока.СуммаДокумента = ДокументЗаказ.СуммаДокумента;
		ДокументЗаказ = ДокументЗаказ.Основание;
	КонецЕсли;
	
	Если ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		Если ТипЗнч(ДокументЗаказ.Основание) = Тип("ДокументСсылка.СчетНаОплату")
			или ТипЗнч(ДокументЗаказ.Основание) = Тип("ДокументСсылка.ЗаказДоговор")
			или ТипЗнч(ДокументЗаказ.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			Если НЕ ДокументЗаказ.Основание.Пустая() Тогда
				НоваяСтрока = СписокДокументовКДобавлению.Добавить();
				НоваяСтрока.Документ = ДокументЗаказ.Основание;
				НоваяСтрока.СуммаДокумента = ДокументЗаказ.Основание.СуммаДокумента;
			КонецЕсли;
			Для Каждого СтрокаОснований Из ДокументЗаказ.ДокументыОснования Цикл
				Если ТипЗнч(СтрокаОснований.Документ) = Тип("ДокументСсылка.СчетНаОплату")
					или ТипЗнч(СтрокаОснований.Документ) = Тип("ДокументСсылка.ЗаказДоговор")
					или ТипЗнч(СтрокаОснований.Документ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					
					Если НЕ СтрокаОснований.Документ.Пустая() Тогда
						НоваяСтрока = СписокДокументовКДобавлению.Добавить();
						НоваяСтрока.Документ = СтрокаОснований.Документ;
						НоваяСтрока.СуммаДокумента = СтрокаОснований.Документ.СуммаДокумента;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		Если ТипЗнч(ДокументЗаказ.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату")
			или ТипЗнч(ДокументЗаказ.ДокументОснование) = Тип("ДокументСсылка.ЗаказДоговор")
			или ТипЗнч(ДокументЗаказ.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			Если НЕ ДокументЗаказ.ДокументОснование.Пустая() Тогда
				НоваяСтрока = СписокДокументовКДобавлению.Добавить();
				НоваяСтрока.Документ = ДокументЗаказ.ДокументОснование;
				НоваяСтрока.СуммаДокумента = ДокументЗаказ.ДокументОснование.СуммаДокумента;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.Монтаж") Тогда
		Если НЕ ДокументЗаказ.Основание = Неопределено Тогда
			Если ТипЗНЧ(ДокументЗаказ.Основание) = Тип("ДокументСсылка.ЗаказДоговор") И НЕ ДокументЗаказ.Основание.Пустая() Тогда
				НоваяСтрока = СписокДокументовКДобавлению.Добавить();
				НоваяСтрока.Документ = ДокументЗаказ.Основание;
				НоваяСтрока.СуммаДокумента = ДокументЗаказ.Основание.СуммаДокумента;
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		Если ТипЗнч(ДокументЗаказ.Основание) = Тип("ДокументСсылка.СчетНаОплату")
			или ТипЗнч(ДокументЗаказ.Основание) = Тип("ДокументСсылка.ЗаказДоговор")
			или ТипЗнч(ДокументЗаказ.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			Если НЕ ДокументЗаказ.Основание.Пустая() Тогда
				НоваяСтрока = СписокДокументовКДобавлению.Добавить();
				НоваяСтрока.Документ = ДокументЗаказ.Основание;
				НоваяСтрока.СуммаДокумента = ДокументЗаказ.Основание.СуммаДокумента;
			КонецЕсли;
			
			Для Каждого ТекСтрокаТЧ Из ДокументЗаказ.Товары Цикл
				Если ТипЗнч(ТекСтрокаТЧ.Заказ) = Тип("ДокументСсылка.СчетНаОплату")
					или ТипЗнч(ТекСтрокаТЧ.Заказ) = Тип("ДокументСсылка.ЗаказДоговор")
					или ТипЗнч(ТекСтрокаТЧ.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					
					Если НЕ ТекСтрокаТЧ.Заказ.Пустая() Тогда
						НоваяСтрока = СписокДокументовКДобавлению.Добавить();
						НоваяСтрока.Документ = ТекСтрокаТЧ.Заказ;
						НоваяСтрока.СуммаДокумента = НоваяСтрока.Документ.СуммаДокумента;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Для Каждого ТекСтрокаТЧ Из ДокументЗаказ.Услуги Цикл
				Если ТипЗнч(ТекСтрокаТЧ.Заказ) = Тип("ДокументСсылка.СчетНаОплату")
					или ТипЗнч(ТекСтрокаТЧ.Заказ) = Тип("ДокументСсылка.ЗаказДоговор")
					или ТипЗнч(ТекСтрокаТЧ.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					
					Если НЕ ТекСтрокаТЧ.Заказ.Пустая() Тогда
						НоваяСтрока = СписокДокументовКДобавлению.Добавить();
						НоваяСтрока.Документ = ТекСтрокаТЧ.Заказ;
						НоваяСтрока.СуммаДокумента = НоваяСтрока.Документ.СуммаДокумента;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	СписокДокументовКДобавлению.Свернуть("Документ, СуммаДокумента",);
	
	СписокПоВидамДокументов = СписокДокументовКДобавлению.Скопировать();
	СписокПоВидамДокументов.Колонки.Добавить("Вид", Новый ОписаниеТипов("строка"));
	Для Каждого ТекСтрокаВида Из СписокПоВидамДокументов Цикл
		ТекСтрокаВида.Вид = ТипЗнч(ТекСтрокаВида.Документ);
		ТекСтрокаВида.СуммаДокумента = СуммаДокумента;
	КонецЦикла;
	СписокПоВидамДокументов.Свернуть("Вид,СуммаДокумента");
	
	Для Каждого ДокументКДобавлению Из СписокДокументовКДобавлению Цикл
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Документ",ДокументКДобавлению.Документ);
		Если ТабличнаяЧасть_РаспределениеПлатежа.НайтиСтроки(ПараметрыПоиска).Количество() = 0 Тогда
			НоваяСтрока = ТабличнаяЧасть_РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ДокументКДобавлению.Документ;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Вид", Строка(ТипЗнч(НоваяСтрока.Документ)));
			СтрокаПоВиду = СписокПоВидамДокументов.НайтиСтроки(Отбор);
			Если СтрокаПоВиду.Количество() > 0 Тогда
				СуммаДолга = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ);
				Если СтрокаПоВиду[0].СуммаДокумента > 0 Тогда
					НоваяСтрока.Сумма = Мин(СтрокаПоВиду[0].СуммаДокумента, СуммаДолга);
					НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
					СтрокаПоВиду[0].СуммаДокумента = СтрокаПоВиду[0].СуммаДокумента - НоваяСтрока.Сумма;
				Иначе
					//нечего распределять
				КонецЕсли;
			Иначе
				НоваяСтрока.Сумма = СуммаДокумента;
				НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла
	
КонецПроцедуры

Функция ПолучитьДатыОплатыПоДоговоруРассрочки(СсылкаНаЗаказ) Экспорт
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДолгиПоРассрочкамОстаткиИОбороты.ЗаказДоговор КАК ЗаказДоговор,
	|	ДолгиПоРассрочкамОстаткиИОбороты.СрокПлатежа КАК ДатаПлатежа,
	|	СУММА(ДолгиПоРассрочкамОстаткиИОбороты.СуммаПриход) КАК Долг,
	|	СУММА(ДолгиПоРассрочкамОстаткиИОбороты.СуммаРасход) КАК Оплата,
	|	СУММА(ДолгиПоРассрочкамОстаткиИОбороты.СуммаПриход - ДолгиПоРассрочкамОстаткиИОбороты.СуммаРасход) КАК ОстатокДолга
	|ИЗ
	|	РегистрНакопления.ДолгиПоРассрочкам.ОстаткиИОбороты(, , Авто, , ЗаказДоговор = &Ссылка) КАК ДолгиПоРассрочкамОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолгиПоРассрочкамОстаткиИОбороты.ЗаказДоговор,
	|	ДолгиПоРассрочкамОстаткиИОбороты.СрокПлатежа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПлатежа";

	Запрос.УстановитьПараметр("Ссылка", СсылкаНаЗаказ);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОстатокДолга <= 0 Тогда
			Результат.Добавить(Выборка.ДатаПлатежа, Формат(Выборка.ДатаПлатежа,"ДЛФ=Д"),,БиблиотекаКартинок.ЗеленыйПолный);
		ИначеЕсли Выборка.Оплата = 0 Тогда 
			Результат.Добавить(Выборка.ДатаПлатежа, Формат(Выборка.ДатаПлатежа,"ДЛФ=Д"),,БиблиотекаКартинок.ЗеленыйПустой);
		Иначе
			Результат.Добавить(Выборка.ДатаПлатежа, Формат(Выборка.ДатаПлатежа,"ДЛФ=Д"),,БиблиотекаКартинок.ЗеленыйЧастичный);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПолучитьОстатокДолгаПоЗаказу(Документ) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоЗаказамОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ = &Заказ) КАК РасчетыПоЗаказамОстатки";
	Запрос.УстановитьПараметр("Заказ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
		
КонецФункции

//#7709
Процедура ДобавитьДокументыПродажиПоЗаказам(ДокументОбъект, Знач ДокументЗаказ) Экспорт
	
	СписокДокументовКДобавлению = Новый ТаблицаЗначений;
	СписокДокументовКДобавлению.Колонки.Добавить("Документ");
	СписокДокументовКДобавлению.Колонки.Добавить("СуммаДокумента");
	
	Если ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Основание", ДокументЗаказ);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Монтаж.Ссылка КАК Ссылка,
		|	Монтаж.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.Монтаж КАК Монтаж
		|ГДЕ
		|	Монтаж.Основание = &Основание";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл		
			НоваяСтрока = СписокДокументовКДобавлению.Добавить();
			НоваяСтрока.Документ = Выборка.Ссылка;
			НоваяСтрока.СуммаДокумента = Выборка.СуммаДокумента;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Основание", ДокументЗаказ);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеализацияТоваровИУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровИУслуг.СуммаДокумента КАК СуммаДокумента
		|ПОМЕСТИТЬ ВТ_Документы
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
		|ГДЕ
		|	РеализацияТоваровИУслуг.Основание = &Основание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровИУслугОснования.Ссылка,
		|	РеализацияТоваровИУслугОснования.Ссылка.СуммаДокумента
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг.Основания КАК РеализацияТоваровИУслугОснования
		|ГДЕ
		|	РеализацияТоваровИУслугОснования.Основание = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Документы.Ссылка КАК Ссылка,
		|	ВТ_Документы.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	ВТ_Документы КАК ВТ_Документы";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл		
			НоваяСтрока = СписокДокументовКДобавлению.Добавить();
			НоваяСтрока.Документ = Выборка.Ссылка;
			НоваяСтрока.СуммаДокумента = Выборка.СуммаДокумента;
		КонецЦикла;

	Иначе
		Возврат;
	КонецЕсли;
		
	СписокПоВидамДокументов = СписокДокументовКДобавлению.Скопировать();
	СписокПоВидамДокументов.Колонки.Добавить("Вид", Новый ОписаниеТипов("Строка"));
	Для Каждого ТекСтрокаВида Из СписокПоВидамДокументов Цикл
		ТекСтрокаВида.Вид = Строка(ТипЗнч(ТекСтрокаВида.Документ));
		ТекСтрокаВида.СуммаДокумента = ДокументОбъект.Сумма;
	КонецЦикла;
	СписокПоВидамДокументов.Свернуть("Вид,СуммаДокумента");
	
	Для Каждого ДокументКДобавлению Из СписокДокументовКДобавлению Цикл
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Документ",ДокументКДобавлению.Документ);
		Если ДокументОбъект.РаспределениеПлатежа.НайтиСтроки(ПараметрыПоиска).Количество() = 0 Тогда
			НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ДокументКДобавлению.Документ;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Вид", Строка(ТипЗнч(НоваяСтрока.Документ)));
			СтрокаПоВиду = СписокПоВидамДокументов.НайтиСтроки(Отбор);
			Если СтрокаПоВиду.Количество() > 0 Тогда
				СуммаДолга = ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ);
				Если СтрокаПоВиду[0].СуммаДокумента > 0 Тогда
					НоваяСтрока.Сумма = Мин(СтрокаПоВиду[0].СуммаДокумента, СуммаДолга);
					НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
					СтрокаПоВиду[0].СуммаДокумента = СтрокаПоВиду[0].СуммаДокумента - НоваяСтрока.Сумма;
					
				Иначе
					//нечего распределять
				КонецЕсли;
			Иначе
				НоваяСтрока.Сумма = ДокументОбъект.Сумма;
				НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
			КонецЕсли;
			
			//добавим в основания
			НайденныеСтрокиОснования = ДокументОбъект.Основания.НайтиСтроки(Новый Структура("Основание", ДокументКДобавлению.Документ));
			Если НайденныеСтрокиОснования.Количество() = 0 Тогда
				НоваяСтрокаОснования = ДокументОбъект.Основания.Добавить();
				НоваяСтрокаОснования.Основание = ДокументКДобавлению.Документ;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла
	
КонецПроцедуры

// Определяет дату начала действия указания Банка России 5286-У
//
// Возвращаемое значение:
//    Дата - Дата начала действия указания
//
Функция НачалоДействияУказания2019_5286У() Экспорт
	
	// Указание ЦБ РФ N 5286-У от 14 октября 2019 г
	Возврат '20200601';
	
КонецФункции

// Определяет перечень кодов видов дохода согласно указанию Банка России 5286-У
//
// Параметры:
//     ВыплатаЗарплаты - Булево - Признак выплаты зарплаты
//
// Возвращаемое значение:
//    СписокЗначений - Коды видов дохода
//
Функция КодыВидовДохода(ВыплатаЗарплаты = Ложь) Экспорт
	
	Коды = Новый СписокЗначений;
	
	Если Не ВыплатаЗарплаты Тогда
		Коды.Добавить("", НСтр("ru = '(не заполняется) Не является доходом физического лица, взыскания не ограничиваются'"));
	КонецЕсли;
	Коды.Добавить("1", НСтр("ru = '1 - Разрешено удержание по исполнительному листу с ограничением по сумме'"));
	Коды.Добавить("2", НСтр("ru = '2 - Запрещено удержание по исполнительному листу'"));
	Коды.Добавить("3", НСтр("ru = '3 - Запрещено удержание по исполнительному листу с оговорками для алиментов'"));
	
	Возврат Коды;
	
КонецФункции

Процедура ЗаполнитьСписокКодовВидаДохода(ЭлементКодВидаДохода, ВидОперации) Экспорт
	
	ЭлементКодВидаДохода.СписокВыбора.Очистить();
	Для каждого ЭлементСписка Из КодыВидовДохода(
		ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику
		Или ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам) Цикл
		ЭлементКодВидаДохода.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
КонецПроцедуры

Функция ВозможноВзысканиеСПеречисленияФизлицу(Дата, ВидОперации) Экспорт
	
	ПрименяетсяКодВидаДохода = (Дата >= НачалоДействияУказания2019_5286У());
	
	ВозможноПеречислениеСотруднику = (ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику
		Или ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам
		Или ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику);
	
	Возврат ПрименяетсяКодВидаДохода И ВозможноПеречислениеСотруднику;
	
КонецФункции
