&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.Период.ДатаНачала = ТекущаяДата();
	Объект.Период.ДатаОкончания = ТекущаяДата();
	ПериодПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьВсемПриИзменении(Элемент)
	Элементы.Замерщики.Доступность = НЕ Объект.ОтправлятьВсем;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ШаблонЗаголовка = "Замеры на %1 - %2";
	Если НачалоДня(Объект.Период.ДатаНачала) = НачалоДня(Объект.Период.ДатаОкончания) Тогда
		ШаблонЗаголовка = "Замеры на %1";	
	КонецЕсли;
	Объект.ЗаголовокПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, 
	                                                    	Формат(Объект.Период.ДатаНачала, "ДЛФ=D"),
															Формат(Объект.Период.ДатаОкончания, "ДЛФ=D"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамерщикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МассивЗамерщиков", Замерщики.ВыгрузитьЗначения());
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	
	ОповещениеОЗакрытииПодбора = Новый ОписаниеОповещения("ФормаПодбораПослеЗакрытия", ЭтаФорма, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.УведомлениеЗамерщиковОЗамерах.Форма.ФормаПодбораЗамерщиков", ПараметрыОткрытия, Элемент,,,, ОповещениеОЗакрытииПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПодбораПослеЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.Свойство("Элемент") Тогда		
		Возврат;		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Элемент = Элементы.Замерщики Тогда	
		Замерщики.ЗагрузитьЗначения(Результат);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьПисьма(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ОтКого) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""От кого""", , "Объект.ОтКого");
		Возврат	;
	КонецЕсли;
	
	Если Объект.Письма.Количество() > 0 Тогда
		ТекстВопроса = "Табличная часть не пуста. Очистить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ПодготовитьПисьмаЗавершение", ЭтаФорма), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ПодготовитьПисьмаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьПисьмаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Письма.Очистить();
	КонецЕсли;
		
	ПодготовитьПисьмаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПисьмаНаСервере()
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НачалоПериода", 	НачалоДня(Объект.Период.ДатаНачала));
	ДопПараметры.Вставить("КонецПериода",  	КонецДня(Объект.Период.ДатаОкончания));

	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("НачалоПериода", 		НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода",  		КонецДня(Объект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ОтборПоЗамерщикам", 	НЕ Объект.ОтправлятьВсем);
	Запрос.УстановитьПараметр("МассивСотрудников", 	Замерщики.ВыгрузитьЗначения());

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Замеры.ДокументЗамер.Дата КАК ДатаДокумента,
	|	Замеры.ДокументЗамер.Номер КАК НомерДокумента,
	|	Замеры.Дата КАК ДатаЗамера,
	|	Замеры.ВремяНачала КАК ВремяНачала,
	|	Замеры.ВремяОкончания КАК ВремяОкончания,
	|	Замеры.Сотрудник КАК Сотрудник,
	|	Замеры.Адрес КАК Адрес,
	|	Замеры.Комментарий КАК КомментарийКЗамеру,
	|	Замеры.ДокументЗамер.Комментарий КАК Комментарий,
	|	Замеры.ИмяКлиента КАК ИмяКлиента,
	|	Замеры.ТелефонКлиента КАК ТелефонКлиента,
	|	Замеры.ДокументЗамер.Телефоны КАК Телефоны,
	|	Замеры.ДокументЗамер.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Замеры.Результат.Ссылка ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА &ОтборПоЗамерщикам
	|				ТОГДА Замеры.Сотрудник В (&МассивСотрудников)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Замеры.Дата,
	|	ВремяНачала
	|ИТОГИ ПО
	|	Сотрудник";
	
	ВыборкаПоСотрудникам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоСотрудникам.Следующий() Цикл
		
		АдресПолучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаПоСотрудникам.Сотрудник, Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника);
		Если ПустаяСтрока(АдресПолучателя) Тогда
			Продолжить;
		КонецЕсли;
		ТекстHTML = СформироватьТекстHTMLПисьма(ВыборкаПоСотрудникам, ДопПараметры);			
		ПисьмоСсылка = РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмо(Объект.ЗаголовокПисьма, , , , АдресПолучателя, ТекстHTML, Объект.ОтКого);
		
		НоваяСтрока = Объект.Письма.Добавить();
		НоваяСтрока.ЭлектронноеПисьмо = ПисьмоСсылка;
		НоваяСтрока.Сотрудник = ВыборкаПоСотрудникам.Сотрудник;
		НоваяСтрока.Кому = АдресПолучателя;
		НоваяСтрока.Пометка = НЕ ПустаяСтрока(НоваяСтрока.Кому);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция СформироватьТекстHTMLПисьма(ВыборкаПоСотрудникам, ДопПараметры)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_УведомлениеЗамерщиковОЗамерах");
	ТабличныйДокумент = Новый ТабличныйДокумент;
		
	Попытка
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ДопПараметры);
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоСотрудникам);
		ТабличныйДокумент.Вывести(ОбластьМакета);
	Исключение
	КонецПопытки;
	
	Выборка = ВыборкаПоСотрудникам.Выбрать();
	НомерСтроки = 1 ;
	Пока Выборка.Следующий() Цикл
		ДопПараметры.Вставить("НомерСтроки", НомерСтроки);
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамера");
			ОбластьМакета.Параметры.Заполнить(ДопПараметры);
			ОбластьМакета.Параметры.Заполнить(ВыборкаПоСотрудникам);
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Попытка
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ДопПараметры);
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоСотрудникам);
		ТабличныйДокумент.Вывести(ОбластьМакета);
	Исключение
	КонецПопытки;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML5);
	ТекстПисьма = Новый ТекстовыйДокумент;
    ТекстПисьма.Прочитать(ИмяВременногоФайла);        
    ТекстХТМЛ = ТекстПисьма.ПолучитьТекст();
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	// преобразовать картинки
	НачальнаяПозицияПоиска = 1;    
    Для Каждого РисунокТабличногоДокумента Из ТабличныйДокумент.Рисунки Цикл     
        Картинка = РисунокТабличногоДокумента.Картинка;
        Если Картинка.Формат() <> ФорматКартинки.PNG Тогда
            Картинка = Картинка.Преобразовать(ФорматКартинки.PNG);
        КонецЕсли;        
        ДвоичныеДанныеКартинки = Картинка.ПолучитьДвоичныеДанные();
        ДвоичныеДанныеКартинкиКакСтрока = Base64Строка(ДвоичныеДанныеКартинки);
    
        Тег_IMG = "<IMG ";
        ПозицияОткрытияТега = СтрНайти(ТекстХТМЛ, Тег_IMG,, НачальнаяПозицияПоиска);
        Если ПозицияОткрытияТега<>0 Тогда
            
            НачальнаяПозицияПоиска = ПозицияОткрытияТега+1;
            
            ПозицияКавычки_НачалоАдреса = СтрНайти(ТекстХТМЛ, """", , ПозицияОткрытияТега);
            Если ПозицияКавычки_НачалоАдреса <> 0 Тогда
                ПозицияКавычки_ОкончаниеАдреса = СтрНайти(ТекстХТМЛ, """", , ПозицияКавычки_НачалоАдреса+1);
                Если ПозицияКавычки_ОкончаниеАдреса<>0 Тогда
                    
                    НовыйАдрес = "data:image/png;base64,"+ДвоичныеДанныеКартинкиКакСтрока;
                        
                    ТекстХТМЛ = Лев(ТекстХТМЛ, ПозицияКавычки_НачалоАдреса)
                        + НовыйАдрес
                        + Сред(ТекстХТМЛ, ПозицияКавычки_ОкончаниеАдреса);
                        
                КонецЕсли;
            КонецЕсли;            
        КонецЕсли;         
    КонецЦикла;
	
	Возврат ТекстХТМЛ;
	
КонецФункции

&НаКлиенте
Процедура Отправить(Команда)
	
	ТекстВопроса = "Подтверждаете отправку писем?";
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтправитьЗавершение", ЭтаФорма), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = КодВозвратаДиалога.Да Тогда 	
		ОтправитьНаСервере(); 	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	Для каждого СтрокаПисьма из Объект.Письма Цикл
		Если НЕ СтрокаПисьма.Пометка Тогда
			Продолжить;
		КонецЕсли;
		СтатусОтправки = Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(СтрокаПисьма.ЭлектронноеПисьмо);
		СтрокаПисьма.Пометка = НЕ ПустаяСтрока(СтатусОтправки);
		СтрокаПисьма.СтатусОтправки = ?(ПустаяСтрока(СтатусОтправки), "Отправлено", СтатусОтправки);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	Для каждого СтрокаПисьма из Объект.Письма Цикл
		СтрокаПисьма.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	Для каждого СтрокаПисьма из Объект.Письма Цикл
		СтрокаПисьма.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
