
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    
	НастройкиП = КомпоновщикНастроек.ПолучитьНастройки();
	Настройки = КомпоновщикНастроек.Настройки;	
	
	// поставщик
	ПараметрПоставщикОтбор = НастройкиП.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПоставщикОтбор"));
	ПараметрПоставщик 	   = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Поставщик"));
	
	ПоставщикОтбор = Справочники.Контрагенты.ПустаяСсылка();
	Если ПараметрПоставщикОтбор.Использование Тогда
		ПоставщикОтбор = ПараметрПоставщикОтбор.Значение;
	КонецЕсли;
	ПараметрПоставщик.Значение = ПоставщикОтбор;
	ПараметрПоставщик.Использование = (НЕ ПоставщикОтбор = Справочники.Контрагенты.ПустаяСсылка());

	// вид цены поставщика
	ПараметрВидЦеныПоставщикаОтбор = НастройкиП.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидЦеныПоставщикаОтбор"));
	ПараметрВидЦеныПоставщика 	   = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидЦеныПоставщика"));
	
	ВидЦеныПоставщикаОтбор = Справочники.ВидыЦенПоставщиков.ПустаяСсылка();
	Если ПараметрВидЦеныПоставщикаОтбор.Использование Тогда
		ВидЦеныПоставщикаОтбор = ПараметрВидЦеныПоставщикаОтбор.Значение;
	КонецЕсли;
	ПараметрВидЦеныПоставщика.Значение = ВидЦеныПоставщикаОтбор;
	ПараметрВидЦеныПоставщика.Использование = (НЕ ВидЦеныПоставщикаОтбор = Справочники.ВидыЦенПоставщиков.ПустаяСсылка());
	
КонецПроцедуры
