
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
                                    Новый Структура("ЗаказПоставщику", ПараметрКоманды), 
                                    "Основной", 
                                    Истина);

	ОткрытьФорму("Отчет.АнализЗаказовПоставщикам.Форма", 
				 ПараметрыФормы, 
				 ПараметрыВыполненияКоманды.Источник, 
				 Новый УникальныйИдентификатор, //ПараметрыВыполненияКоманды.Уникальность, 
				 ПараметрыВыполненияКоманды.Окно, 
				 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
				 
КонецПроцедуры