
&НаКлиенте
Перем мПредыдущийИдентификатор;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВключитьПредпросмотрФайлов = НЕ Константы.ВыключитьПредпросмотрПрикрепленныхФайловВДокументах.Получить();
	Элементы.ГруппаФайлыПредпросмотр.Видимость = ВключитьПредпросмотрФайлов;
	
	Если Параметры.СсылкаНаДокумент <> Неопределено И НЕ Параметры.СсылкаНаДокумент.Пустая() Тогда
		
		СсылкаНаДокумент = Параметры.СсылкаНаДокумент;
		
		ОбновитьСписокФайлов();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	Для Каждого ТекущаяСтрока Из Файлы Цикл
		ТекущаяСтрока.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого ТекущаяСтрока Из Файлы Цикл
		ТекущаяСтрока.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокФайлов()
	
	Файлы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Истина КАК Пометка,
	|	ПрикрепленныеДанные.СсылкаНаОбъект,
	|	ПрикрепленныеДанные.ИмяФайла,
	|	ПрикрепленныеДанные.Расширение,
	|	ПрикрепленныеДанные.Период КАК ДатаПрикрепления,
	|	ПрикрепленныеДанные.Размер КАК Размер
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект = &СсылкаНаОбъект";
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Файлы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	Если НЕ ВключитьПредпросмотрФайлов ИЛИ Элементы.Файлы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если мПредыдущийИдентификатор = Элементы.Файлы.ТекущиеДанные.ПолучитьИдентификатор() Тогда
		Возврат;
	Иначе
		мПредыдущийИдентификатор = Элементы.Файлы.ТекущиеДанные.ПолучитьИдентификатор();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияФайлыПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияФайлыПриАктивизацииСтроки()
	
	Если Элементы.Файлы.ТекущиеДанные.СсылкаНаОбъект.Пустая() Тогда
		АдресФайла = ПолучитьДанные(СсылкаНаДокумент, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	Иначе
		АдресФайла = ПолучитьДанные(Элементы.Файлы.ТекущиеДанные.СсылкаНаОбъект, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	КонецЕсли;
	
	ОбщийМодульКлиент.ПредпросмотрФайла(АдресФайла, Элементы.Файлы.ТекущиеДанные.Расширение, Предпросмотр, Элементы.Предпросмотр);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные(СсылкаНаОбъект, ИмяФайла)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.Данные
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект = &Ссылка
	|	И ПрикрепленныеДанные.ИмяФайла = &ИмяФайла";
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИмяФайла",ИмяФайла);
	
	
	Данные = Неопределено;
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() > 0 тогда
		Данные = Выборка[0].Данные.Получить();
	КонецЕсли;
	 
	Возврат ПоместитьВоВременноеХранилище(Данные, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура Скопировать(Команда)
	
	МассивФайлов = новый Массив;
		
	Для Каждого ТекущаяСтрока Из Файлы Цикл
		Если НЕ ТекущаяСтрока.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		МассивФайлов.Добавить(Новый Структура("СсылкаНаОбъект, ИмяФайла, Расширение, ДатаПрикрепления",
				ТекущаяСтрока.СсылкаНаОбъект, ТекущаяСтрока.ИмяФайла, ТекущаяСтрока.Расширение, ТекущаяСтрока.ДатаПрикрепления));
	КонецЦикла;
			
	Если МассивФайлов.Количество() = 0 Тогда
		МассивФайлов = Неопределено;
	КонецЕсли;			
			
	Закрыть(МассивФайлов);		
		
КонецПроцедуры
