&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Если ТипЗнч(Элемент.ВыделенныеСтроки) = Тип("Массив") Тогда
		ПодключитьОбработчикОжидания("ПроверкаЗакрытияЗаказов", 0.3, истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗакрытияЗаказов()

	МассивЗаказов = СформироватьМассивОснованийНаСервере(Элементы.Список.ВыделенныеСтроки);
	Если МассивЗаказов.Количество() > 0 Тогда
		Оповестить("ЗакрытиеЗаказа", МассивЗаказов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьМассивОснованийНаСервере(Знач МассивРеализаций)
	
	МассивЗаказов = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("АвтоматическиПереводитьЗаказПокупателяВСтатусВыполненПриПолнойОтгрузке") Тогда
		Для каждого СсылкаНаРеализацию из МассивРеализаций Цикл
			Если СсылкаНаРеализацию.Проведен Тогда
				Если ЗначениеЗаполнено(СсылкаНаРеализацию.Основание) И ТипЗнч(СсылкаНаРеализацию.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					МассивЗаказов.Добавить(СсылкаНаРеализацию.Основание);
				КонецЕсли;	
				Для каждого СтрокаОснования из СсылкаНаРеализацию.Основания Цикл
					Если ТипЗнч(СтрокаОснования.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
						МассивЗаказов.Добавить(СтрокаОснования.Основание);
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат МассивЗаказов;
	
КонецФункции
