
&НаКлиенте
Процедура ВыборКонтакта(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		ОповеститьОбИсполненииЗаказа = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЛицензионныйКлюч = Параметры.ЛицензионныйКлюч;
	
	СтруктураКлиента = ОбщийМодуль.ПолучениеДанныхПоКлиентуПоЛицензионномуКлючу(ЛицензионныйКлюч);
	Если НЕ СтруктураКлиента = Неопределено Тогда
		Код = СтруктураКлиента.Код;
		КодКлиента = СтруктураКлиента.КодКлиента;
	КонецЕсли;
	
	Дерево = ДанныеФормыВЗначение(ТекущиеЗаказы, Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
		
	СтруктураТекущихЗаказов = ОбщийМодуль.ПолучениеТекущихЗаказовПоЛицензионномуКлючу(ЛицензионныйКлюч);
	Если НЕ СтруктураТекущихЗаказов = Неопределено Тогда
		МассивЗаказов = СтруктураТекущихЗаказов.Заказы;
		Для НомерЗаказа=0 По МассивЗаказов.Количество()-1 Цикл
			НовыйЗаказ = Дерево.Строки.Добавить();
			НовыйЗаказ.Валюта = МассивЗаказов[НомерЗаказа].Получить("Валюта");
			НовыйЗаказ.Исполнен = МассивЗаказов[НомерЗаказа].Получить("Исполнен");
			НовыйЗаказ.Сумма = МассивЗаказов[НомерЗаказа].Получить("Сумма");
			НовыйЗаказ.Оплачен = МассивЗаказов[НомерЗаказа].Получить("Оплачен");
			НовыйЗаказ.Статус = МассивЗаказов[НомерЗаказа].Получить("Статус");
			НовыйЗаказ.Заказ = "Заказ №" + МассивЗаказов[НомерЗаказа].Получить("Номер") + " от " + МассивЗаказов[НомерЗаказа].Получить("Дата");
			
			МассивТоваров = МассивЗаказов[НомерЗаказа].Получить("Товары");
			Для НомерТовара = 0 По МассивТоваров.Количество()-1 Цикл
				НовыйТовар = НовыйЗаказ.Строки.Добавить();
				НовыйТовар.Заказ = МассивТоваров[НомерТовара].Получить("Номенклатура");
				НовыйТовар.Количество = МассивТоваров[НомерТовара].Получить("Количество");
				НовыйТовар.Сумма = МассивТоваров[НомерТовара].Получить("Сумма");
				НовыйТовар.Валюта = МассивТоваров[НомерТовара].Получить("Валюта");
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ЗначениеВДанныеФормы(Дерево, ТекущиеЗаказы);
	
	ТЗУслуг = Новый ТаблицаЗначений;
	ТЗУслуг.Колонки.Добавить("Код");
	ТЗУслуг.Колонки.Добавить("Наименование");
	ТЗУслуг.Колонки.Добавить("Сумма");
	ТЗУслуг.Колонки.Добавить("ИмяГруппы");
	ТЗУслуг.Колонки.Добавить("ИмяЭлемента");
	
	МассивУслуг = ОбщийМодуль.ПолучениеМассиваУслугДляСамостоятельногоОформленияСчета();
	
	Если НЕ МассивУслуг = Неопределено Тогда
		МассивУслуг = МассивУслуг.Услуги;
		Для чНом=0 По МассивУслуг.Количество()-1 Цикл
			НоваяСтрока = ТЗУслуг.Добавить();
			НоваяСтрока.Код = МассивУслуг[чНом].Получить("Код");
			НоваяСтрока.Наименование = МассивУслуг[чНом].Получить("Наименование");
			НоваяСтрока.Сумма = МассивУслуг[чНом].Получить("Сумма");
			НоваяСтрока.ИмяГруппы = МассивУслуг[чНом].Получить("ИмяГруппы");
			НоваяСтрока.ИмяЭлемента = МассивУслуг[чНом].Получить("ИмяЭлемента");
		КонецЦикла;
	КонецЕсли;
	
	ТЗГрупп = ТЗУслуг.Скопировать();
	ТЗГрупп.Свернуть("ИмяГруппы");
	
	Дерево = ДанныеФормыВЗначение(Услуги, Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
	
	Для Каждого ТекГруппа Из ТЗГрупп Цикл
		НоваяГруппа = Дерево.Строки.Добавить();
		НоваяГруппа.ИмяЭлемента = ТекГруппа.ИмяГруппы;
		Для Каждого ТекЭлемент Из ТЗУслуг Цикл
			Если ТекЭлемент.ИмяГруппы = ТекГруппа.ИмяГруппы Тогда
				НовыйЭлемент = НоваяГруппа.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, ТекЭлемент);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВДанныеФормы(Дерево, Услуги);
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница3;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПлательщика(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		Плательщик = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница3 Тогда
		Элементы.КомандаНазад.Видимость = Ложь;
		ЭтаФорма.Заголовок = "Мои заказы на продление лицензии";
		Элементы.КомандаДалее.Заголовок = "Создать новый";
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница1 Тогда
		Элементы.КомандаНазад.Видимость = Истина;
		ЭтаФорма.Заголовок = "Создание нового заказа на продление лицензии";
		Элементы.КомандаДалее.Заголовок = "Далее";
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница2 Тогда
		Элементы.КомандаНазад.Видимость = Истина;
		ЭтаФорма.Заголовок = "Создание нового заказа на продление лицензии";
		Элементы.КомандаДалее.Заголовок = "Готово";
	Иначе
		//
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДалее(Команда)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница1 Тогда
		Если ПустаяСтрока(Код) Тогда
			ПоказатьПредупреждение(,"Не удалось идентифицировать владельца текущей лицензии. Просим обратиться в отдел продаж CRM&ERP SmartCeilings");
			Возврат;
		КонецЕсли;
		Если Плательщик.Пустая() Тогда
			ПоказатьПредупреждение(,"Выберите плательщика для выставления счета");
			Возврат;
		КонецЕсли;
		Если Элементы.Услуги.ТекущаяСтрока = Неопределено
			ИЛИ ПустаяСтрока(Элементы.Услуги.ТекущиеДанные.Код)
			Тогда
			ПоказатьПредупреждение(,"Выберите тариф в соответствующей таблице");
			Возврат;
		КонецЕсли;
		
		НаименованиеУслуги = Элементы.Услуги.ТекущиеДанные.Наименование;
		СтоимостьУслуги = Элементы.Услуги.ТекущиеДанные.Сумма;
		КодУслуги = Элементы.Услуги.ТекущиеДанные.Код;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница2 Тогда
		Ответ = ОбщийМодуль.ОтправитьЗапросНаСозданиеСчетаНаПродлениеТарифа(Код, КодУслуги, ОповеститьОбИсполненииЗаказа, РеквизитыПлательщикаВСтроку()); 
		Если НЕ Ответ = Неопределено Тогда
			Оп = Новый ОписаниеОповещения("ПослеСозданияЗаказа", ЭтаФорма);
			ПоказатьПредупреждение(Оп,Ответ.Сообщение);
		КонецЕсли;
	КонецЕсли;
	СледующаяСтраница();
КонецПроцедуры

&НаСервере
Функция РеквизитыПлательщикаВСтроку()
	
	Если Плательщик.Вид = Перечисления.ВидКонтрагента.ЮрЛицо Тогда
		
		Результат = 
		"\nНаименование: " + Плательщик.Наименование
		+ "\nСтрана: " + Плательщик.Страна
		+ "\nГород: " + Плательщик.Город
		+ "\nВид контрагента: " + Плательщик.Вид
		+ "\nИНН: " + Плательщик.ИНН
		+ "\nКПП: " + Плательщик.КПП
		+ "\nЮрАдрес: " + Плательщик.ЮридическийАдрес
		+ "\nПочтовыйАдрес: " + Плательщик.ПочтовыйАдрес
		+ "\nТелефон: " + Плательщик.Телефон
		+ "\ne-mail: " + Плательщик.ЭлектроннаяПочта
		+ "\nКомментарий к заказу: " + КомментарийКЗаказу;
		
	Иначе
		
		Результат = 
		"\nНаименование: " + Плательщик.Наименование
		+ "\nСтрана: " + Плательщик.Страна
		+ "\nГород: " + Плательщик.Город
		+ "\nВид контрагента: " + Плательщик.Вид
		+ "\nПочтовыйАдрес: " + Плательщик.ПочтовыйАдрес
		+ "\nТелефон: " + Плательщик.Телефон
		+ "\ne-mail: " + Плательщик.ЭлектроннаяПочта
		+ "\nКомментарий к заказу: " + КомментарийКЗаказу;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеСозданияЗаказа(Парам1) Экспорт
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура СледующаяСтраница()
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница3 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница1;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница1 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница2;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница2 Тогда
		//
	Иначе
		//
	КонецЕсли;
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ПредыдущаяСтраница()
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница3 Тогда
		//
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница1 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница3;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница2 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница1;
	Иначе
		//
	КонецЕсли;
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	ПредыдущаяСтраница();
КонецПроцедуры

&НаСервере
Процедура ПлательщикПриИзмененииНаСервере()
	ОповеститьОбИсполненииЗаказа = Плательщик.ЭлектроннаяПочта;
	КомментарийКЗаказу = Плательщик.Комментарий;
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
	ПлательщикПриИзмененииНаСервере();
КонецПроцедуры
