
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Проверки при проведении
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		// Проверка на задвоение по ключам "ВидНоменклатуры, Категория, ВидЦены"
		ВремТаблица = Объект.НастройкиПоВидамНоменклатуры.Выгрузить();
		
		ВремТаблица.Колонки.Добавить("Количество");
		ВремТаблица.ЗаполнитьЗначения(1, "Количество");
		
		ВремТаблица.Свернуть("ВидНоменклатуры, Категория, ВидЦены", "Количество");
		
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			
			Если ТекущаяСтрока.Количество > 1 Тогда
				
				Сообщить(СтрШаблон("Задвоены записи по ключам: %1%2%3 вид цены ""%4"".",
					?(ЗначениеЗаполнено(ТекущаяСтрока.ВидНоменклатуры), "вид номенклатуры """ + ТекущаяСтрока.ВидНоменклатуры + """,", ""),
					?(ЗначениеЗаполнено(ТекущаяСтрока.ВидНоменклатуры) И ЗначениеЗаполнено(ТекущаяСтрока.Категория), ", ", ""),
					?(ЗначениеЗаполнено(ТекущаяСтрока.Категория), "категория """ + ТекущаяСтрока.Категория + """,", ""),
					ТекущаяСтрока.ВидЦены
				));
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Проверка на задвоение по ключам "Номенклатура, ВидЦены"
		ВремТаблица = Объект.НастройкиПоНоменклатуре.Выгрузить();
		
		ВремТаблица.Колонки.Добавить("Количество");
		ВремТаблица.ЗаполнитьЗначения(1, "Количество");
		
		ВремТаблица.Свернуть("Номенклатура, ВидЦены", "Количество");
		
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			
			Если ТекущаяСтрока.Количество > 1 Тогда
				
				Сообщить(СтрШаблон("Задвоены записи по ключам: %1 вид цены ""%2"".",
					ТекущаяСтрока.Номенклатура,
					ТекущаяСтрока.ВидЦены
				));
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


