
&НаКлиенте
Процедура ОК(Команда)
    Результат = Новый Структура("Вид, ИД, Текст", "РедакторТекста", ИД, Текст);
    ОповеститьОВыборе(Результат);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Параметры.Свойство("Текст") Тогда
    	Текст = Параметры.Текст;
    КонецЕсли;
    
    Если Параметры.Свойство("ИД") Тогда
    	ИД = Параметры.ИД;
    Иначе
        ИД = ИА_БФКС.СформироватьУИД();
    КонецЕсли;
    
    Если Параметры.Свойство("ТекстСправки") И ЗначениеЗаполнено(Параметры.ТекстСправки) Тогда
        ТекстСправки = Параметры.ТекстСправки;
    Иначе
        Элементы.ТекстСправки.Видимость = Ложь;
    КонецЕсли;
КонецПроцедуры
