Функция ПолучитьЦенуВыработкиНоменклатуры(Дата, ВидНоменклатурыПотолка, Номенклатура, ЕдиницаИзмерения) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьВыработкиПроизводстваСрезПоследних.Стоимость
	|ИЗ
	|	РегистрСведений.СтоимостьВыработкиПроизводства.СрезПоследних(
	|			&ДатаЗапроса,
	|			ВидНоменклатурыПотолка = &ВидНоменклатурыПотолка
	|				И Номенклатура = &Номенклатура
	|				И ЕдиницаИзмерения = &ЕдиницаИзмерения) КАК СтоимостьВыработкиПроизводстваСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЗапроса",КонецДня(Дата));
	Запрос.УстановитьПараметр("ВидНоменклатурыПотолка",ВидНоменклатурыПотолка);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Стоимость;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьЦенуВыработкиНоменклатурыЗаПозициюМенеджеру(Дата, ВидНоменклатурыПотолка) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьВыработкиПроизводстваСрезПоследних.СтоимостьДляМенеджера КАК Стоимость
	|ИЗ
	|	РегистрСведений.СтоимостьВыработкиПроизводства.СрезПоследних(
	|			&ДатаЗапроса,
	|			ВидНоменклатурыПотолка = &ВидНоменклатурыПотолка
	|				И Номенклатура ЕСТЬ NULL
	|				И ЕдиницаИзмерения ЕСТЬ NULL) КАК СтоимостьВыработкиПроизводстваСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЗапроса",КонецДня(Дата));
	Запрос.УстановитьПараметр("ВидНоменклатурыПотолка",ВидНоменклатурыПотолка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Стоимость;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьЦенуВыработкиНоменклатурыЗаПозициюРаскройщику(Дата, ВидНоменклатурыПотолка) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьВыработкиПроизводстваСрезПоследних.Стоимость
	|ИЗ
	|	РегистрСведений.СтоимостьВыработкиПроизводства.СрезПоследних(
	|			&ДатаЗапроса,
	|			ВидНоменклатурыПотолка = &ВидНоменклатурыПотолка
	|				И Номенклатура ЕСТЬ NULL
	|				И ЕдиницаИзмерения ЕСТЬ NULL) КАК СтоимостьВыработкиПроизводстваСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЗапроса",КонецДня(Дата));
	Запрос.УстановитьПараметр("ВидНоменклатурыПотолка",ВидНоменклатурыПотолка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Стоимость;
	КонецЦикла;
	
КонецФункции