
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицуПереходов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаОшибкиПодключения.Видимость = Ложь;
	Элементы.ГруппаОшибкиНастройкиСинхронизации.Видимость = Ложь;
	УстановитьПорядковыйНомерПерехода(1);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура COMКаталогИнформационнойБазыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбменДаннымиКлиент.ОбработчикВыбораФайловогоКаталога(ЭтотОбъект, "COMКаталогИнформационнойБазы", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура COMКаталогИнформационнойБазыОткрытие(Элемент, СтандартнаяОбработка)
	
	ОбменДаннымиКлиент.ОбработчикОткрытияФайлаИлиКаталога(ЭтотОбъект, "COMКаталогИнформационнойБазы", СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура COMВариантРаботыИнформационнойБазыПриИзменении(Элемент)
	
	ВариантРаботыИнформационнойБазыПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантРаботыИнформационнойБазыПриИзменении()
	
	ТекущаяСтраница = ?(COMВариантРаботыИнформационнойБазы = 0, Элементы.СтраницаВариантРаботыФайловый, Элементы.СтраницаВариантРаботыКлиентСерверный);
	
	Элементы.ВариантыРаботыИнформационнойБазы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеCOM(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПроверитьПодключениеCOMЗавершение", ЭтотОбъект);
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("СсылкаНового");
	СтруктураНастроек.Вставить("COMАутентификацияОперационнойСистемы");
	СтруктураНастроек.Вставить("COMВариантРаботыИнформационнойБазы");
	СтруктураНастроек.Вставить("COMИмяИнформационнойБазыНаСервере1СПредприятия");
	СтруктураНастроек.Вставить("COMИмяПользователя");
	СтруктураНастроек.Вставить("COMИмяСервера1СПредприятия");
	СтруктураНастроек.Вставить("COMКаталогИнформационнойБазы");
	СтруктураНастроек.Вставить("COMПарольПользователя");
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтотОбъект);
	
	Запросы = СоздатьЗапросНаИспользованиеВнешнихРесурсов(СтруктураНастроек, Истина, Ложь, Ложь, Ложь);
	РаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(Запросы, ЭтотОбъект, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеCOMЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Элементы.ГруппаОшибкиПодключения.Видимость = Ложь;
		ОчиститьСообщения();
		
		Если СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая Тогда
			
			ОбщегоНазначенияКлиент.ЗарегистрироватьCOMСоединитель(Ложь);
			
		КонецЕсли;
		
		ТекстСообщения = ПроверитьПодключениеCOMНаСервере();
		
		Если ПустаяСтрока(ТекстСообщения) Тогда
			ТекстСообщения = НСтр("ru = 'Проверка подключения успешно завершена.'");
			Если НЕ ДополнительныеПараметры = "ПроверкаПриПереходе" Тогда
				ПоказатьПредупреждение(,ТекстСообщения);
			Иначе
				ПорядковыйНомерПерехода = ПорядковыйНомерПерехода + 1;
				ПорядковыйНомерПереходаПриИзменении(Ложь);
			КонецЕсли;
		Иначе
			Элементы.ГруппаОшибкиПодключения.Видимость = Истина;
			ЭтоОшибкаРегистрацииКомпоненты = Найти(ТекстСообщения, "2147221164") > 0;
			ТекстРегистрацияКомпоненты = "";
			Если ЭтоОшибкаРегистрацииКомпоненты Тогда
				ЭтоФайловаяИБ = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая;
				ТекстРегистрацияКомпоненты = Символы.ПС
					+ НСтр("ru = 'Возможно, необходимо зарегистрировать COM-компоненту comcntr.dll'")
					+ ?(ЭтоФайловаяИБ, ".", НСтр("ru = ', после чего выполнить перезапуск сервера 1С:Предприятие.'"))
			КонецЕсли;
			
			Элементы.ТекстОшибкиПроверкиПодключения.Заголовок = ТекстСообщения + ТекстРегистрацияКомпоненты;
			
			Если ДополнительныеПараметры = "ПроверкаПриПереходе" Тогда
				//УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПодключениеCOMНаСервере()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("COMАутентификацияОперационнойСистемы");
	СтруктураНастроек.Вставить("COMВариантРаботыИнформационнойБазы");
	СтруктураНастроек.Вставить("COMИмяИнформационнойБазыНаСервере1СПредприятия");
	СтруктураНастроек.Вставить("COMИмяПользователя");
	СтруктураНастроек.Вставить("COMИмяСервера1СПредприятия");
	СтруктураНастроек.Вставить("COMКаталогИнформационнойБазы");
	СтруктураНастроек.Вставить("COMПарольПользователя");
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтотОбъект);
	
	Результат = ОбменДаннымиСервер.УстановитьВнешнееСоединениеСБазой(СтруктураНастроек);
	Если Результат.Соединение = Неопределено Тогда
		Возврат Результат.КраткоеОписаниеОшибки;
	КонецЕсли;
	Возврат ""; // успешно
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьЗапросНаИспользованиеВнешнихРесурсов(Знач Объект, ЗапрашиватьCOM,
	ЗапрашиватьFILE, ЗапрашиватьWS, ЗапрашиватьFTP)
	
	Запись = РегистрыСведений.НастройкиТранспортаОбмена.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Объект);
	Запись.Узел = Объект.СсылкаНового;
	
	ЗапросыРазрешений = Новый Массив;
	
	РегистрыСведений.НастройкиТранспортаОбмена.ЗапросНаИспользованиеВнешнихРесурсов(ЗапросыРазрешений,
		Запись, ЗапрашиватьCOM, ЗапрашиватьFILE, ЗапрашиватьWS, ЗапрашиватьFTP);
	Возврат ЗапросыРазрешений;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// Поставляемая часть

&НаКлиенте
Процедура КомандаДалее(Команда)
	
	ИзменитьПорядковыйНомерПерехода(+1);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	
	ПользовательОтветилДаНаВопросОСопоставлении = Ложь;
	ИзменитьПорядковыйНомерПерехода(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	//ВыполнитьКомандуГотово();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьПорядковыйНомерПерехода(Итератор)
	
	ОчиститьСообщения();
	
	УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + Итератор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПорядковыйНомерПерехода(Знач Значение)
	
	ЭтоПереходДалее = (Значение > ПорядковыйНомерПерехода);
	
	ПорядковыйНомерПерехода = Значение;
	
	Если ПорядковыйНомерПерехода < 1 Тогда
		
		ПорядковыйНомерПерехода = 1;
		
	КонецЕсли;
	
	ПорядковыйНомерПереходаПриИзменении(ЭтоПереходДалее);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядковыйНомерПереходаПриИзменении(Знач ЭтоПереходДалее)
	
	// Выполняем обработчики событий перехода.
	ВыполнитьОбработчикиСобытийПерехода(ЭтоПереходДалее);
	
	// Устанавливаем отображение страниц.
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	Элементы.ПанельВариантыНастроек.ТекущаяСтраница  = Элементы[СтрокаПереходаТекущая.ИмяОсновнойСтраницы];
	Элементы.ПанельНавигации.ТекущаяСтраница = Элементы[СтрокаПереходаТекущая.ИмяСтраницыНавигации];
	
	// Устанавливаем текущую кнопку по умолчанию.
	КнопкаДалее = ПолучитьКнопкуФормыПоИмениКоманды(Элементы.ПанельНавигации.ТекущаяСтраница, "КомандаДалее");
	
	Если КнопкаДалее <> Неопределено Тогда
		
		КнопкаДалее.КнопкаПоУмолчанию = Истина;
		
	Иначе
		
		КнопкаГотово = ПолучитьКнопкуФормыПоИмениКоманды(Элементы.ПанельНавигации.ТекущаяСтраница, "КомандаГотово");
		
		Если КнопкаГотово <> Неопределено Тогда
			
			КнопкаГотово.КнопкаПоУмолчанию = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоПереходДалее И СтрокаПереходаТекущая.ДлительнаяОперация Тогда
		
		ПодключитьОбработчикОжидания("ВыполнитьОбработчикДлительнойОперации", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработчикиСобытийПерехода(Знач ЭтоПереходДалее)
	
	// Обработчики событий переходов.
	Если ЭтоПереходДалее Тогда
		
		СтрокиПерехода = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода - 1));
		
		Если СтрокиПерехода.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаПерехода = СтрокиПерехода[0];
		
		// Обработчик ПриПереходеДалее.
		Если Не ПустаяСтрока(СтрокаПерехода.ИмяОбработчикаПриПереходеДалее)
			И Не СтрокаПерехода.ДлительнаяОперация Тогда
			
			ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ)";
			ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПерехода.ИмяОбработчикаПриПереходеДалее);
			
			Отказ = Ложь;
			
			РезультатВычисления = Вычислить(ИмяПроцедуры);
			
			Если Отказ Тогда
				
				УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		СтрокиПерехода = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода + 1));
		
		Если СтрокиПерехода.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаПерехода = СтрокиПерехода[0];
		
		// Обработчик ПриПереходеНазад.
		Если Не ПустаяСтрока(СтрокаПерехода.ИмяОбработчикаПриПереходеНазад)
			И Не СтрокаПерехода.ДлительнаяОперация Тогда
			
			ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ)";
			ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПерехода.ИмяОбработчикаПриПереходеНазад);
			
			Отказ = Ложь;
			
			РезультатВычисления = Вычислить(ИмяПроцедуры);
			
			Если Отказ Тогда
				
				УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	Если СтрокаПереходаТекущая.ДлительнаяОперация И Не ЭтоПереходДалее Тогда
		
		УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
		Возврат;
	КонецЕсли;
	
	// обработчик ПриОткрытии
	Если Не ПустаяСтрока(СтрокаПереходаТекущая.ИмяОбработчикаПриОткрытии) Тогда
		
		ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ, ПропуститьСтраницу, ЭтоПереходДалее)";
		ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПереходаТекущая.ИмяОбработчикаПриОткрытии);
		
		Отказ = Ложь;
		ПропуститьСтраницу = Ложь;
		
		РезультатВычисления = Вычислить(ИмяПроцедуры);
		
		Если Отказ Тогда
			
			УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
			
			Возврат;
			
		ИначеЕсли ПропуститьСтраницу Тогда
			
			Если ЭтоПереходДалее Тогда
				
				УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
				
				Возврат;
				
			Иначе
				
				УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКнопкуФормыПоИмениКоманды(ЭлементФормы, ИмяКоманды)
	
	Для Каждого Элемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			
			ЭлементФормыПоИмениКоманды = ПолучитьКнопкуФормыПоИмениКоманды(Элемент, ИмяКоманды);
			
			Если ЭлементФормыПоИмениКоманды <> Неопределено Тогда
				
				Возврат ЭлементФормыПоИмениКоманды;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("КнопкаФормы")
			И СтрНайти(Элемент.ИмяКоманды, ИмяКоманды) > 0 Тогда
			
			Возврат Элемент;
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуПереходов()
	
	ТаблицаПереходов.Очистить();
	
	НовыйПереход = ТаблицаПереходов.Добавить();
	НовыйПереход.ПорядковыйНомерПерехода = 1;
	НовыйПереход.ИмяОсновнойСтраницы  = "СтраницаМастераНачало";
	НовыйПереход.ИмяСтраницыНавигации = "СтраницаНавигацииНачало";
	НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаМастераНачало_ПриПереходеДалее";

	НовыйПереход = ТаблицаПереходов.Добавить();
	НовыйПереход.ПорядковыйНомерПерехода = 2;
	НовыйПереход.ИмяОсновнойСтраницы  = "СтраницаМастераСопоставлениеДанных";
	НовыйПереход.ИмяСтраницыНавигации = "СтраницаНавигацииПродолжение";
	НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаМастераСопоставлениеДанных_ПриПереходеДалее";

	НовыйПереход = ТаблицаПереходов.Добавить();
	НовыйПереход.ПорядковыйНомерПерехода = 3;
	НовыйПереход.ИмяОсновнойСтраницы  = "СтраницаМастераОжиданиеСозданияНастройкиОбменаДанными";
	НовыйПереход.ИмяСтраницыНавигации = "СтраницаНавигацииОжидание";
	//НовыйПереход.ДлительнаяОперация = Истина;
	//НовыйПереход.ИмяОбработчикаДлительнойОперации = "СтраницаМастераОжиданиеПроверкиПодключенияВнешнегоСоединения_ОбработкаДлительнойОперации";
	НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаМастераОжиданиеСозданияНастройкиОбменаДанными_ПриОткрытии";

	НовыйПереход = ТаблицаПереходов.Добавить();
	НовыйПереход.ПорядковыйНомерПерехода = 4;
	НовыйПереход.ИмяОсновнойСтраницы  = "СтраницаМастераГотово";
	НовыйПереход.ИмяСтраницыНавигации = "СтраницаНавигацииГотово";
	//НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаМастераНастройкаПараметровДляВнешнегоСоединенияПервойБазы_ПриПереходеДалее";
	//НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаМастераНастройкаПараметровДляВнешнегоСоединенияПервойБазы_ПриОткрытии";

	//НовыйПереход = ТаблицаПереходов.Добавить();
	//НовыйПереход.ПорядковыйНомерПерехода = 5;
	//НовыйПереход.ИмяОсновнойСтраницы  = "СтраницаМастераНастройкаПараметровДляВнешнегоСоединенияВторойБазы";
	//НовыйПереход.ИмяСтраницыНавигации = "СтраницаНавигацииПродолжение";
	//НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаМастераНастройкаПараметровДляВнешнегоСоединенияВторойБазы_ПриПереходеДалее";
	//НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаМастераНастройкаПараметровДляВнешнегоСоединенияВторойБазы_ПриОткрытии";

	//НовыйПереход = ТаблицаПереходов.Добавить();
	//НовыйПереход.ПорядковыйНомерПерехода = 6;
	//НовыйПереход.ИмяОсновнойСтраницы  = "СтраницаМастераИтогНастройкиОбмена";
	//НовыйПереход.ИмяСтраницыНавигации = "СтраницаНавигацииПродолжение";
	//НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаМастераИтогНастройкиОбмена_ПриОткрытии_ВнешнееСоединение";

	//НовыйПереход = ТаблицаПереходов.Добавить();
	//НовыйПереход.ПорядковыйНомерПерехода = 7;
	//НовыйПереход.ИмяОсновнойСтраницы  = "СтраницаМастераОжиданиеСозданияНастройкиОбменаДанными";
	//НовыйПереход.ИмяСтраницыНавигации = "СтраницаНавигацииОжидание";
	//НовыйПереход.ДлительнаяОперация = Истина;
	//НовыйПереход.ИмяОбработчикаДлительнойОперации = "СтраницаМастераОжиданиеСозданияНастройкиОбменаДаннымиЧерезВнешнееСоединение_ОбработкаДлительнойОперации";

	//НовыйПереход = ТаблицаПереходов.Добавить();
	//НовыйПереход.ПорядковыйНомерПерехода = 8;
	//НовыйПереход.ИмяОсновнойСтраницы  = "СтраницаМастераОкончаниеСОбменомПоВнешнемуСоединению";
	//НовыйПереход.ИмяСтраницыНавигации = "СтраницаНавигацииОкончание";
	
КонецПроцедуры

&НаКлиенте
Функция Подключаемый_СтраницаМастераНачало_ПриПереходеДалее(Отказ)
	
	Если ПустаяСтрока(COMКаталогИнформационнойБазы) И ПустаяСтрока(COMИмяСервера1СПредприятия) Тогда 
		Сообщить("Не заполнены данные подключения");
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
		
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПроверитьПодключениеCOMЗавершение", ЭтотОбъект, "ПроверкаПриПереходе");
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("СсылкаНового");
	СтруктураНастроек.Вставить("COMАутентификацияОперационнойСистемы");
	СтруктураНастроек.Вставить("COMВариантРаботыИнформационнойБазы");
	СтруктураНастроек.Вставить("COMИмяИнформационнойБазыНаСервере1СПредприятия");
	СтруктураНастроек.Вставить("COMИмяПользователя");
	СтруктураНастроек.Вставить("COMИмяСервера1СПредприятия");
	СтруктураНастроек.Вставить("COMКаталогИнформационнойБазы");
	СтруктураНастроек.Вставить("COMПарольПользователя");
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтотОбъект);
	
	Запросы = СоздатьЗапросНаИспользованиеВнешнихРесурсов(СтруктураНастроек, Истина, Ложь, Ложь, Ложь);
	РаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(Запросы, ЭтотОбъект, ОповещениеОЗакрытии);
	
	Отказ = Истина;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаМастераСопоставлениеДанных_ПриПереходеДалее(Отказ)
	
	Если ПустаяСтрока(ОрганизацияКод) 
		ИЛИ ПустаяСтрока(КонтрагентКод)
		ИЛИ НЕ ЗначениеЗаполнено(ОрганизацияПоступления) 
		ИЛИ НЕ ЗначениеЗаполнено(КонтрагентПоступления)
		ИЛИ НЕ ЗначениеЗаполнено(СкладПоступления) Тогда
		Сообщить("Не заполнены данные");
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	//Элементы.ГруппировкаСообщения.Видимость = Истина;
	//Элементы.ГруппаОшибкиНастройкиСинхронизации.Видимость = Ложь;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаМастераОжиданиеСозданияНастройкиОбменаДанными_ПриОткрытии(Отказ, ПропуститьСтраницу, ЭтоПереходДалее)
	
	РезультатНастройки = НастроитьСинхронизациюДанныхНаСервере();
	Если НЕ ПустаяСтрока(РезультатНастройки) Тогда
		Сообщить(РезультатНастройки);
		Отказ = Истина;
	Иначе
		ИзменитьПорядковыйНомерПерехода(+1);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НастроитьСинхронизациюДанныхНаСервере()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("COMАутентификацияОперационнойСистемы");
	СтруктураНастроек.Вставить("COMВариантРаботыИнформационнойБазы");
	СтруктураНастроек.Вставить("COMИмяИнформационнойБазыНаСервере1СПредприятия");
	СтруктураНастроек.Вставить("COMИмяПользователя");
	СтруктураНастроек.Вставить("COMИмяСервера1СПредприятия");
	СтруктураНастроек.Вставить("COMКаталогИнформационнойБазы");
	СтруктураНастроек.Вставить("COMПарольПользователя");
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтотОбъект);
	
	Результат = ОбменДаннымиСервер.УстановитьВнешнееСоединениеСБазой(СтруктураНастроек);
	Если Результат.Соединение = Неопределено Тогда
		Возврат Результат.КраткоеОписаниеОшибки;
	КонецЕсли;
	
	ВнешнееСоединение = Результат.Соединение;
	
	Если ВнешнееСоединение.Метаданные.ПланыОбмена.Найти("ОбменБазаПроизводстваБазаРозницы") = Неопределено Тогда
		ТекстОшибки = "В удаленной базе отсутствует план обмена ""Обмен База производства и База розницы"". Возможно требуется обновление базы.";
		Возврат ТекстОшибки; 
	КонецЕсли;
	
	// проверим наличие организации и контрагента по кодам
	COMКонтрагентРозницы = ВнешнееСоединение.Справочники.Контрагенты.НайтиПоКоду(КонтрагентКод);
	Если COMКонтрагентРозницы.Пустая() Тогда
		ТекстОшибки = "В удаленной базе не найден контрагент с кодом " + КонтрагентКод;
		Возврат ТекстОшибки;	
	КонецЕсли;
	COMОрганизацияПроизводства = ВнешнееСоединение.Справочники.Организации.НайтиПоКоду(ОрганизацияКод);
	Если COMОрганизацияПроизводства.Пустая() Тогда
		ТекстОшибки = "В удаленной базе не найдена организация с кодом " + ОрганизацияКод;
		Возврат ТекстОшибки;	
	КонецЕсли;
	
	Отказ = Ложь;
	ТекстОшибки= "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		Код = КодНовогоУзла(ВнешнееСоединение);
		НаименованиеОбмена = "Обмен База производства и База розницы (" + Код + ")";
		
		// 1. создаем узел обмена в текущей базе
		ПланОбменаСсылка = ПланыОбмена.ОбменБазаПроизводстваБазаРозницы.ЭтотУзел();
		Если ПустаяСтрока(ПланОбменаСсылка.Код) Тогда
			ПланОбменаОбъект = ПланОбменаСсылка.ПолучитьОбъект();
		Иначе
			ПланОбменаОбъект = ПланыОбмена.ОбменБазаПроизводстваБазаРозницы.СоздатьУзел();
		КонецЕсли;
		ПланОбменаОбъект.Код = Код;
		ПланОбменаОбъект.Наименование = НаименованиеОбмена;
		ЗаполнитьЗначенияСвойств(ПланОбменаОбъект, ЭтотОбъект, "ОрганизацияКод, КонтрагентКод, ОрганизацияПоступления, КонтрагентПоступления, СкладПоступления");
		ПланОбменаОбъект.ОбменДанными.Загрузка = Истина;
		ПланОбменаОбъект.Записать();		
		
		// 2. сохраняем настройки подключения
		СтруктураНастроек.Вставить("Узел", ПланОбменаОбъект.Ссылка);
		СтруктураНастроек.Вставить("ВидТранспортаСообщенийОбменаПоУмолчанию", Перечисления.ВидыТранспортаСообщенийОбмена.COM);
		РегистрыСведений.НастройкиТранспортаОбмена.ДобавитьЗапись(СтруктураНастроек);
		
		// 3. создаем узел обмена в удаленной базе
		COMПланОбменаОбъект = ВнешнееСоединение.ПланыОбмена.ОбменБазаПроизводстваБазаРозницы.СоздатьУзел();
		COMПланОбменаОбъект.Код = Код;
		COMПланОбменаОбъект.Наименование = НаименованиеОбмена;
		COMПланОбменаОбъект.ЭтоБазаПроизводства = Истина;
		COMПланОбменаОбъект.ОрганизацияПроизводства = COMОрганизацияПроизводства;
		COMПланОбменаОбъект.КонтрагентРозницы = COMКонтрагентРозницы;
		COMПланОбменаОбъект.ДатаНачалаВыгрузкиДокументов = ДатаНачалаВыгрузкиДокументов;
		COMПланОбменаОбъект.ОбменДанными.Загрузка = Истина;
		COMПланОбменаОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ТекстОшибки = ОписаниеОшибки(); //ИнформацияОбОшибке();
		ОтменитьТранзакцию();
		Отказ = Истина;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	
	Возврат ""; // успешно
	
КонецФункции

&НаСервере
Функция КодНовогоУзла(ВнешнееСоединение)
	
	НовыйКод = "000";
	Для Индекс = 1 по 99 Цикл
		НовыйКод = Формат(Индекс, "ЧЦ=3; ЧВН=; ЧГ=0");
		
		ПланСсылка = ПланыОбмена.ОбменБазаПроизводстваБазаРозницы.НайтиПоКоду(НовыйКод);		
		COMПланСсылка = ВнешнееСоединение.ПланыОбмена.ОбменБазаПроизводстваБазаРозницы.НайтиПоКоду(НовыйКод);
		
		Если ПланСсылка.Пустая() И COMПланСсылка.Пустая() Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовыйКод;
	
КонецФункции
	
#КонецОбласти
