
#Область НаСервереПредопределенные


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕстьПравоРедактированияОргСхемы    = ПравоДоступа("Редактирование",Метаданные.Справочники.ОргСхема);
	ЕстьПравоСозданияНастроекСтатистик =
	ПравоДоступа("Редактирование",Метаданные.Справочники.ИА_НастройкиРабочегоСтолаСтатистик)
	И 
	ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Справочники.ИА_НастройкиРабочегоСтолаСтатистик);
КонецПроцедуры


#КонецОбласти


#Область НаСервере


&НаСервере
Процедура СоздатьСтандартнуюНаСервере(НаимОрг, ЭтоВложеннаяОргсхема)
	белЦвет = Новый Цвет(255,255,255);
	
	// организация
	Спроб = Справочники.ОргСхема.СоздатьГруппу();
	Спроб.Наименование = НаимОрг; 
	Спроб.НаименованиеДляОргсхемы = НаимОрг;
	Спроб.Ширина = 40;
	Спроб.Высота = 20;
	Спроб.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Организация;
	Спроб.ЦветФона = Новый ХранилищеЗначения(белЦвет);
	Спроб.ЭтоВложеннаяОргсхема = ЭтоВложеннаяОргсхема;
	Спроб.Записать();
	
	РодительСсылка = Спроб.Ссылка;
	
	Если не ЭтоВложеннаяОргсхема Тогда
		// Учредители
		Спроб = Справочники.ОргСхема.СоздатьГруппу();
		Спроб.Родитель = РодительСсылка;
		Спроб.Наименование = "УЧРЕДИТЕЛИ"; 
		Спроб.НаименованиеДляОргсхемы = "УЧРЕДИТЕЛИ";
		Спроб.Ширина = 40;
		Спроб.Высота = 20;
		Спроб.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Учредитель;
		Спроб.ЦветФона = Новый ХранилищеЗначения(белЦвет);
		Спроб.Записать();
		
		РодительСсылка = Спроб.Ссылка;
		// 7 отделение
		Спроб = Справочники.ОргСхема.СоздатьГруппу();
		Спроб.Родитель = РодительСсылка;
		Спроб.Наименование = "7 ОТДЕЛЕНИЕ"; 
		Спроб.НаименованиеДляОргсхемы = "7 ОТДЕЛЕНИЕ";
		Спроб.Ширина = 40;
		Спроб.Высота = 20;
		Спроб.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент;
		Спроб.ПорядокВСхеме = 0;
		Спроб.ЦветФона = Новый ХранилищеЗначения(белЦвет);
		Спроб.Записать();
		// отделы 7 отделения
		счОтделов = 1;
		сч = 7;
		Пока счОтделов <= 3 Цикл
			Спроб1 = Справочники.ОргСхема.СоздатьГруппу();
			Спроб1.Родитель = Спроб.Ссылка;
			номерОтдела = (сч-1)*3 + счОтделов;
			Спроб1.Наименование = строка(номерОтдела) + " ОТДЕЛ"; 
			Спроб1.НаименованиеДляОргсхемы = строка(номерОтдела) + " ОТДЕЛ";
			Спроб1.Ширина = 40;
			Спроб1.Высота = 20;
			Спроб1.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел;
			Спроб1.ПорядокВСхеме = номерОтдела;
			Спроб1.ЦветФона = Новый ХранилищеЗначения(белЦвет);
			Спроб1.Записать();
			
			счОтделов = счОтделов + 1;
		КонецЦикла;
		
		
		// ГЕНДИР
		Спроб = Справочники.ОргСхема.СоздатьГруппу();
		Спроб.Родитель = РодительСсылка;
		Спроб.Наименование = "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР"; 
		Спроб.НаименованиеДляОргсхемы = "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР";
		Спроб.Ширина = 40;
		Спроб.Высота = 20;
		Спроб.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.РуководящийСостав;
		Спроб.ПорядокВСхеме = 1;
		Спроб.ЦветФона = Новый ХранилищеЗначения(белЦвет);
		Спроб.Записать();
		
		РодительСсылка = Спроб.Ссылка;
	КонецЕсли;

	// отделения
	сч = 1;
	Пока сч <= 6 Цикл
		Спроб = Справочники.ОргСхема.СоздатьГруппу();
		Спроб.Родитель = РодительСсылка;
		Спроб.Наименование = строка(сч) + " ОТДЕЛЕНИЕ"; 
		Спроб.НаименованиеДляОргсхемы = строка(сч) + " ОТДЕЛЕНИЕ";
		Спроб.Ширина = 40;
		Спроб.Высота = 20;
		Спроб.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент;
		Спроб.ПорядокВСхеме = сч;
		Спроб.ЦветФона = Новый ХранилищеЗначения(белЦвет);
		Спроб.Записать();
		
		РодительСсылкаДеп = Спроб.Ссылка;
		счОтделов = 1;
		Пока счОтделов <= 3 Цикл
			Спроб = Справочники.ОргСхема.СоздатьГруппу();
			Спроб.Родитель = РодительСсылкаДеп;
			номерОтдела = (сч-1)*3 + счОтделов;
			Спроб.Наименование = строка(номерОтдела) + " ОТДЕЛ"; 
			Спроб.НаименованиеДляОргсхемы = строка(номерОтдела) + " ОТДЕЛ";
			Спроб.Ширина = 40;
			Спроб.Высота = 20;
			Спроб.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел;
			Спроб.ПорядокВСхеме = номерОтдела;
			Спроб.ЦветФона = Новый ХранилищеЗначения(белЦвет);
			Спроб.Записать();
			
			счОтделов = счОтделов + 1;
		КонецЦикла;
		
		сч = сч + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВПостНастройкуСтатистик(Пост, НС)
	Спр = Пост.ПолучитьОбъект();
	Спр.НастройкаСтатистик = НС;
	Спр.Записать();
КонецПроцедуры

&НаСервере
Функция ДоступноРедактирование()
	Возврат ПравоДоступа("Добавление", Метаданные.Справочники.ОргСхема);
КонецФункции

&НаСервере
Функция	СкопироватьИерархию(Источник, Имя)
	
	
	Родители  = Новый Соответствие(); 
	ТекстЛога = ""; 
	Ошибка = Ложь;	
	
	СоздатьИерархию = Истина; 
	Приемник = Справочники.ОргСхема.ПустаяСсылка();
	
	// создание элемента
	Элем = Источник.Скопировать(); 
	Элем.Наименование = Имя; 
	Элем.НаименованиеДляОргсхемы  = Имя;
	
	//Арчил Тваладзе 19.04.2016   
	//метод Скопировать() не копирует пометку удаления.
	Элем.ПометкаУдаления = Источник.ПометкаУдаления;
	
	//Добавим флаг Копирование что бы не пересчитываелись свойства при копировнаии 
	ЭлемДополнительныеСвойства = Элем.ДополнительныеСвойства;
	ЭлемДополнительныеСвойства.Вставить("Копирование", Истина);
	//конец Арчил Тваладзе 19.04.2016			

	Попытка	
		Элем.Записать(); 
		Приемник = Элем.Ссылка;
	Исключение
		ТекстЛога = ТекстЛога+"Ошибка записи схемы!"+Символы.ПС+ОписаниеОшибки(); СоздатьИерархию = Ложь;	
	КонецПопытки;
	
	// копирование иерархии
	Если СоздатьИерархию Тогда 
		//НачатьТранзакцию();
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	Спр.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОргСхема КАК Спр
		|ГДЕ
		|	Спр.Ссылка В ИЕРАРХИИ(&Родитель)
		|	И Спр.Ссылка <> &Родитель
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ");
		Запрос.УстановитьПараметр("Родитель", Источник);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		ТекЭлементы = Новый Соответствие();
		ТекЭлементы.Вставить(Источник, Приемник);
		
		Для Каждого Стр Из ТЗ  Цикл
			
			ТекОбъект = Стр.Ссылка.ПолучитьОбъект();
			Если ЗначениеЗаполнено(ТекОбъект.Родитель) Тогда
				НовыйРодитель = ТекЭлементы[ТекОбъект.Родитель];
				Если Не ЗначениеЗаполнено(НовыйРодитель) Тогда
					
					ТекстЛога = ТекстЛога+" Ошибка, не найдено соответствие для элемента: " + ТекОбъект.Родитель; 
					
					Ошибка = Истина; 
					Прервать;
					
				КонецЕсли;
			Иначе
				НовыйРодитель = Справочники.ОргСхема.ПустаяСсылка();
			КонецЕсли;
			
			НовыйОбъект = ТекОбъект.Скопировать();
			НовыйОбъект.Родитель = НовыйРодитель;
			
			//Арчил Тваладзе 19.04.2016   
			//метод Скопировать() не копирует пометку удаления.
			НовыйОбъект.ПометкаУдаления = ТекОбъект.ПометкаУдаления;
			
			//Добавим флаг Копирование что бы не пересчитываелись свойства при копировнаии 
			НовыйОбъектДополнительныеСвойства = НовыйОбъект.ДополнительныеСвойства;
			НовыйОбъектДополнительныеСвойства.Вставить("Копирование", Истина);
			//конец Арчил Тваладзе 19.04.2016			
			
			НовыйОбъект.Записать();
			ТекЭлементы.Вставить(Стр.Ссылка, НовыйОбъект.Ссылка);		
			
		КонецЦикла;
		
		Если Ошибка Тогда
			//ОтменитьТранзакцию();  
			ТекстЛога = ТекстЛога+" Отмена транзакции: "+ОписаниеОшибки();
		Иначе
			//ЗафиксироватьТранзакцию();
			ТекстЛога = ТекстЛога+" Копирование иерархии завершено...";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстЛога;
	
КонецФункции


#КонецОбласти




#Область НаКлиентеПредопределенные

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступноРедактирование = ДоступноРедактирование();
	Элементы.ФормаСоздатьСтандартную.Доступность = ДоступноРедактирование;
	Элементы.ФормаКопироватьСИерархией.Доступность = ДоступноРедактирование;
КонецПроцедуры

#КонецОбласти


#Область НаКлиенте

&НаКлиенте
Процедура СоздатьСтандартную(Команда)
	
	НаимОрг = "";	
	парам = Новый Структура("ЭтоВложеннаяОргсхема", ложь);
	ПоказатьВводЗначения(Новый ОписаниеОповещения("СоздатьСтандартнуюОбработка", ЭтаФорма, парам), НаимОрг, "Введите название организации"); 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтандартнуюОбработка(Значение, ДополнительныеПараметры) Экспорт
	
		
	Если Значение = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	СоздатьСтандартнуюНаСервере(Значение,ДополнительныеПараметры.ЭтоВложеннаяОргсхема);
	
	Элементы.Список.Обновить();
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле <> Неопределено И Поле.Имя = "НастройкаСтатистик" Тогда
		СтандартнаяОбработка = Ложь;
		НС = Элемент.ТекущиеДанные.НастройкаСтатистик;
		
		Если ЗначениеЗаполнено(НС) Тогда
			ПоказатьЗначение(, НС);	
		ИначеЕсли ЕстьПравоРедактированияОргСхемы И ЕстьПравоСозданияНастроекСтатистик Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("СписокВыборЗавершение", ЭтотОбъект, Новый Структура("ВыбраннаяСтрока", ВыбраннаяСтрока)), "Настройки статистик нет. Создать ?", РежимДиалогаВопрос.ОКОтмена); 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыбраннаяСтрока = ДополнительныеПараметры.ВыбраннаяСтрока;
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат
	Иначе
		Форма = ПолучитьФорму("Справочник.ИА_НастройкиРабочегоСтолаСтатистик.ФормаОбъекта");
		Форма.Объект.Наименование = "Настройка для """ + ВыбраннаяСтрока + """";
		Форма.Объект.СлужебнаяНастройка = Истина;
		Форма.ОткрытьМодально();
		НС = Форма.Объект.Ссылка;
		Если НЕ ЗначениеЗаполнено(НС) Тогда                    
			Возврат;
		КонецЕсли; 
		УстановитьВПостНастройкуСтатистик(ВыбраннаяСтрока, НС);
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КопироватьСИерархией(Команда)
	ТекЭлем = Элементы.Список.ТекущаяСтрока;
	Если НЕ ТекЭлем = Неопределено Тогда
		Имя = СокрЛП(Строка(ТекЭлем));
		
		ПоказатьВводЗначения(Новый ОписаниеОповещения("КопироватьСИерархиейОбработка", ЭтаФорма, новый Структура("ТекЭлем",ТекЭлем)), Имя, "Введите название организации"); 		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КопироватьСИерархиейОбработка(Значение, ДополнительныеПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	Ответ = СкопироватьИерархию(ДополнительныеПараметры.ТекЭлем, Значение); 
	Элементы.Список.Обновить(); 
	ПоказатьПредупреждение(,Ответ);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьОргсхемуСекции(Команда)
	НаимОрг = "";	
	парам = Новый Структура("ЭтоВложеннаяОргсхема", истина);
	ПоказатьВводЗначения(Новый ОписаниеОповещения("СоздатьСтандартнуюОбработка", ЭтаФорма, парам), НаимОрг, "Введите название организации"); 
КонецПроцедуры


#КонецОбласти 
