
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = Константы.ИспользоватьПодключаемоеОборудование.Получить();
	ИспользоватьСтатусы = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыСборкиЗаказовПокупателей");
	
	ТекущийЭлемент = Элементы.ИмитацияШК;
	
	//++ №13830
	ИспользоватьСтатусыСборкиЗаказовПокупателей = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыСборкиЗаказовПокупателей");
	ИспользоватьСтатусЗакрытВЗаказеПокупателя = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусЗакрытВЗаказеПокупателя"); // №14078
	
	Элементы.ГруппаЗаказПокупателяОтборыПоСтатусамСборки.Видимость = (ИспользоватьСтатусыСборкиЗаказовПокупателей);
	Элементы.ОтборСтатусЗаказаЗакрыт.Видимость = ИспользоватьСтатусЗакрытВЗаказеПокупателя; // №14078
	
	ВосстановитьНастройкиФормы();
	
	УстановитьОтборЗаказовПокупателей();
	//-- №13830
	
	// №14078
	ОбщийМодульСервер.УстановитьПериодАвтоОбновленияДляВсехДинамическихСписков(ЭтаФорма, ОбщийМодульСервер.НастройкаПользователя("ЧастотаАвтоматическогоОбновленияСписковВРабочемМестеСотрудникаСклада"));
	
	// #14908
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ДействияВРабочемМестеРаботникаСклада КАК ДанныеСправочника
	|ГДЕ
	|	(НЕ ДанныеСправочника.ЭтапОтображения = ЗНАЧЕНИЕ(Перечисление.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКЗаказаПокупателя)
	|		ИЛИ НЕ ДанныеСправочника.Доступно)
	|	И ДанныеСправочника.Предопределенный";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл 
		Элементы[Выборка.ИмяПредопределенныхДанных].Видимость = Ложь;
		
	    // видимость кнопок регулируется опционально
		Если ИспользоватьСтатусы Тогда
			Если Выборка.ИмяПредопределенныхДанных = "ЗаказПокупателяИзменитьСборщика" Тогда
				Элементы[Выборка.ИмяПредопределенныхДанных].Видимость = Ложь;	
			КонецЕсли;
		Иначе
			Если Выборка.ИмяПредопределенныхДанных = "ЗаказПокупателяСобранЧастично" 
				ИЛИ Выборка.ИмяПредопределенныхДанных = "ЗаказПокупателяСобранПолностью" Тогда
				Элементы[Выборка.ИмяПредопределенныхДанных].Видимость = Ложь;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	КнопокВНижнемРяду = 0;
	Для каждого Элемент из Элементы.ГруппаКнопкиНижнийРяд.ПодчиненныеЭлементы Цикл
		Если Элемент.Видимость Тогда
			КнопокВНижнемРяду = КнопокВНижнемРяду + 1;
		КонецЕсли;
	КонецЦикла;
	Если КнопокВНижнемРяду > 1 Тогда
		Элементы.Отмена.Видимость = Ложь;
	Иначе
		Элементы.Отмена1.Видимость = Ложь;
	КонецЕсли;
	
	//nva+++
	//ЭлементУО = УсловноеОформление.Элементы.Добавить();
	//
	//ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СписокЗаказыПокупателей.КоличествоЗаявокНаДоставку");
	//ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	////ОтборУО.ПравоеЗначение = "1";
	//
	//ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокЗаказыПокупателей");
	//
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	лУсловноеОформление = СписокЗаказыПокупателей.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы;
	МассивНастроекОформления = Новый Массив;
	НомерНастройки = 0;
	Для Каждого ЭлементУсловногоОформления Из лУсловноеОформление Цикл
		ЦветФона = Неопределено;
		Для Каждого ЭлементОформления Из ЭлементУсловногоОформления.Оформление.Элементы Цикл
			Если ЭлементОформления.Параметр = Новый ПараметрКомпоновкиДанных("ЦветФона") И ЭлементОформления.Использование Тогда
				ЦветФона = ЭлементОформления.Значение;
			КонецЕсли;	
		КонецЦикла;
		Если ЦветФона = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		НастройкаЦвета = Новый Структура("Настройка, Цвет, Подсказка, Использовать", "НастройкаОформления" + НомерНастройки, ЦветФона, ЭлементУсловногоОформления.Представление, Истина);
		МассивНастроекОформления.Добавить(НастройкаЦвета);
		НомерНастройки = НомерНастройки + 1;
	КонецЦикла;	
	Для каждого НастройкаЦвета из МассивНастроекОформления Цикл
		//НастройкаЦвета = Структура("Настройка, Цвет, Подсказка, Использовать"
		
		ИмяНастройки = НастройкаЦвета.Настройка;		
		
		Группа = Элементы.Добавить("ГруппаЗаказПокупателейОформление" + ИмяНастройки, Тип("ГруппаФормы"), Элементы.ГруппаЗаказПокупателейОформление);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
		Элемент = Элементы.Добавить("ДекорацияЦвет" + ИмяНастройки, Тип("ДекорацияФормы"), Группа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = "";
		Элемент.Ширина = 2;
		Элемент.Высота = 1;
		Элемент.ЦветФона = НастройкаЦвета.Цвет;
		
		Элемент = Элементы.Добавить("ДекорацияНадпись" + ИмяНастройки, Тип("ДекорацияФормы"), Группа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = НастройкаЦвета.Подсказка;
		Элемент.АвтоМаксимальнаяШирина = Ложь;
	КонецЦикла;
	//nva---
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	ВыделитьКнопкиОтбораСтатусаСборки(); // №13830
	ВыделитьКнопкиОтбораСтатусаЗаказа(); // №14078
	ВыделитьКнопкиОтбораСтатусаОбеспечения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	//СохранитьНастройкиФормы(); // №13830  // #14403 перенесено в процедуру нажатия кнопок, так как не сохраняется при закрытии через завершение работы
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда 
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияПотолкиКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
			
			ПодключитьОбработчикОжидания("УстановитьТекущийЭлемент", 0.1, Истина);
		КонецЕсли;	
	КонецЕсли; 
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИмитацияШКПриИзменении(Элемент)
	
	ПараметрыКОтправке = Новый Массив;
	ПараметрыКОтправке.Добавить(ИмитацияШК);
	ПараметрыКОтправке.Добавить(Неопределено);
	ОбработкаОповещения("ScanData", ПараметрыКОтправке, "ПодключаемоеОборудование");
	ИмитацияШК = "";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборДействия(Команда)
	
	Действие = Команда.Имя;
	
	ПараметрыФормы = Новый Структура("ДокументСсылка, Действие", ДокументСсылка, Действие);
	
	Если ДействиеТребуетУказаниеСотрудника(Действие) Тогда		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборДействияПоДокументуЗавершение", ЭтотОбъект, ПараметрыФормы);
		ОткрытьФорму("Обработка.РабочееМестоСотрудникаСклада.Форма.ШКСотрудника", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
	Иначе		
		Результат = Новый Структура("Действие", Действие);
		ДополнительныеПараметры = Новый Структура("ДокументСсылка, Сотрудник", ДокументСсылка, Неопределено);
		ВыборДействияПоДокументуЗавершение(Результат, ДополнительныеПараметры);		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ВернутьсяНаНачальнуюСтраницу();
	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНачальнаяСтраница Тогда
		// штрихкод документа
		МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
		Если ЗначениеЗаполнено(МассивСсылок) Тогда
			Если МассивСсылок.Количество() = 1 Тогда
				ВыборДокументаИзСпискаЗавершение(МассивСсылок[0], Неопределено);
			Иначе
				ПараметрыФормы = Новый Структура("МассивСсылок", МассивСсылок);
				ОписаниеОповещения = Новый ОписаниеОповещения("ВыборДокументаИзСпискаЗавершение", ЭтотОбъект);
				ОткрытьФорму("Обработка.РабочееМестоСотрудникаСклада.Форма.ФормаСпискаДокументовПоСсылкам", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
			КонецЕсли;			
		Иначе
			ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДокумент Тогда
		// штрихкод сотрудника
		ОчиститьСообщения();
		ДанныеПоШК = ШтрихкодированиеПотолкиКлиент.ОбработатьШтрихкод(Данные.Штрихкод, 1);		
		Если НЕ ДанныеПоШК = Неопределено Тогда
			//#14908 закомментировано
			//Если ДанныеПоШК.Операция = ПредопределенноеЗначение("Справочник.ОперацииНадДокументами.СборкаЗаказаПокупателя") Тогда				
				ПараметрыФормы = Новый Структура("ДокументСсылка, Сотрудник", ДокументСсылка, ДанныеПоШК.Сотрудник);
				ОписаниеОповещения = Новый ОписаниеОповещения("ВыборДействияПоДокументуЗавершение", ЭтотОбъект, ПараметрыФормы);
				ОткрытьФорму("Обработка.РабочееМестоСотрудникаСклада.Форма.ФормаВыбораДействияНадДокументом", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
			//КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	
	Менеджеры = Новый Массив;
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ПеремещениеТоваров.ПустаяСсылка")); //nva
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	
КонецФункции

&НаКлиенте
Процедура ВыборДокументаИзСпискаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;		                          	
	КонецЕсли;
	
	ДокументСсылка = Результат;
	//nva+++
	Если ТипЗнч(Результат) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ОткрытьЗначение(Результат);
		Возврат;
	КонецЕсли;
	//nva---
	ДанныеДокумента = ОбщийМодульВызовСервера.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Контрагент, СуммаДокумента, Валюта, Сборщик, Сборщик2");
	Сборщик = ДанныеДокумента.Сборщик;
	Сборщик2 = ДанныеДокумента.Сборщик2;
	ПредставлениеПолейДокумента = СтрШаблон("Контрагент: %1, сумма %2 %3", ДанныеДокумента.Контрагент, ДанныеДокумента.СуммаДокумента, ДанныеДокумента.Валюта);
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДокумент;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборДействияПоДокументуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;		                          	
	КонецЕсли; 
	
	ВернутьсяНаНачальнуюСтраницу();
	
	// на случай использования оповещения после вызова формы "ШКСотрудника"
	Если Результат.Свойство("Сотрудник") Тогда
		ДополнительныеПараметры.Вставить("Сотрудник", Результат.Сотрудник);	
	КонецЕсли;
	
	Если Результат.Действие = "ОткрытьЗаказПокупателя" Тогда
		ОткрытьЗаказПокупателя(ДополнительныеПараметры.ДокументСсылка);
	ИначеЕсли Результат.Действие = "ПечатьЗаказПокупателя" Тогда
		ПечатьЗаказПокупателя(ДополнительныеПараметры.ДокументСсылка);
		Если ПолучитьСтатусЗаказа(ДополнительныеПараметры.ДокументСсылка) = ПредопределенноеЗначение("Справочник.СтатусыСборкиЗаказов.ВыполнитьСборку") Тогда
			ИзменитьСтатусСборкиНаидетСборка(ДополнительныеПараметры.ДокументСсылка);
		КонецЕсли;		
	ИначеЕсли Результат.Действие = "ПечатьЗаказПокупателяИУстановитьСтатусИдетСборка" Тогда
		ПечатьЗаказПокупателя(ДополнительныеПараметры.ДокументСсылка);
		
	ИначеЕсли Результат.Действие = "ОтгрузитьЗаказПокупателя" Тогда
		ОтгрузитьЗаказПокупателя(ДополнительныеПараметры.ДокументСсылка);
		
	ИначеЕсли Результат.Действие = "ЗаказПокупателяИдетСборка"
		ИЛИ Результат.Действие = "ЗаказПокупателяСобранЧастично"
		ИЛИ Результат.Действие = "ЗаказПокупателяСобранПолностью"
		ИЛИ Результат.Действие = "ЗаказПокупателяСобранПолностьюОтгрузить"
		ИЛИ Результат.Действие = "ЗаказПокупателяИзменитьСборщика"
		ИЛИ Результат.Действие = "ЗаказПокупателяДобавитьСборщика"
		Тогда
		
		Если НЕ Результат.Свойство("ДобавитьСборщика") Тогда
			Если Результат.Действие = "ЗаказПокупателяИдетСборка"
				ИЛИ Результат.Действие = "ЗаказПокупателяСобранЧастично"
				ИЛИ Результат.Действие = "ЗаказПокупателяСобранПолностью"
				ИЛИ Результат.Действие = "ЗаказПокупателяСобранПолностьюОтгрузить" Тогда
					Результат.Вставить("ДобавитьСборщика", Истина);
			Иначе
				Результат.Вставить("ДобавитьСборщика", Ложь)
			КонецЕсли;	
		КонецЕсли;
		
		РезультатЗаполнения = ЗаполнитьЗаказПокупателя(ДополнительныеПараметры.ДокументСсылка, ДополнительныеПараметры.Сотрудник, 
													   Результат.ИзменитьСтатусСборки, Результат.СтатусСборки, Результат.ДобавитьСборщика);
		Если РезультатЗаполнения Тогда
			ПоказатьОповещениеПользователя("Документ сохранен", , "Сборщик в документе изменен");
			
			// #14607
			Если Результат.Отгрузить Тогда
				ОтгрузитьЗаказПокупателя(ДополнительныеПараметры.ДокументСсылка);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ВернутьсяНаНачальнуюСтраницу()
	
	ИмитацияШК = "";
	ДокументСсылка = ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка");
	Сборщик        = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНачальнаяСтраница;
	
	УстановитьТекущийЭлемент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказПокупателя(Знач ДокументСсылка)

	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ПоказатьЗначение(Неопределено, ДокументСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЗаказПокупателя(ДокументСсылка, Сотрудник, ИзменитьСтатусСборки, СтатусСборки, ДобавитьСборщика)

	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	ДокументИзменен = Ложь;
	ДокОбъект = ДокументСсылка.ПолучитьОбъект();
		
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		//nva+++
		Если ЗначениеЗаполнено(ДокОбъект.Сборщик) Тогда
			Если ДобавитьСборщика Тогда
				Если ДокОбъект.Сборщик <> Сотрудник И ДокОбъект.Сборщик2 <> Сотрудник Тогда
					ДокОбъект.Сборщик2 = Сотрудник;
					ДокументИзменен = Истина;
				КонецЕсли;	
			Иначе	
				Если ДокОбъект.Сборщик <> Сотрудник И ДокОбъект.Сборщик2 <> Сотрудник Тогда 
					ДокОбъект.Сборщик2 = Сотрудник;
					ДокументИзменен = Истина;
				ИначеЕсли ДокОбъект.Сборщик = Сотрудник И ДокОбъект.Сборщик2 <> Сотрудник Тогда
					ДокОбъект.Сборщик = ДокОбъект.Сборщик2;
					ДокОбъект.Сборщик2 = "";
					ДокументИзменен = Истина;
				ИначеЕсли ДокОбъект.Сборщик <> Сотрудник И ДокОбъект.Сборщик2 = Сотрудник Тогда
					ДокОбъект.Сборщик2 = "";
					ДокументИзменен = Истина;	
				КонецЕсли;
			КонецЕсли;	
		Иначе	
			ДокОбъект.Сборщик = Сотрудник;
			ДокументИзменен = Истина;
		КонецЕсли;
		//nva---
	КонецЕсли;
	Если ИзменитьСтатусСборки Тогда
		ДокОбъект.СтатусСборки = СтатусСборки;
		ДокументИзменен = Истина;
	КонецЕсли;

	Если ДокументИзменен Тогда
		Попытка
			ДокОбъект.Записать();		
			Сборщик = Сотрудник;
			Возврат Истина;
		Исключение		
			ТекстОшибки = ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не удалось записать документ: %1'"),
			ТекстОшибки));		
		КонецПопытки;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ОтгрузитьЗаказПокупателя(ЗаказСсылка)
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(ЗаказСсылка);
	
	ПараметрыВыполнения = Новый Структура("ЭтоФормаОбъекта", Ложь);
	ДополнительныеПараметры = Новый Структура;
	ПараметрыВыполнения.Вставить("ОписаниеКоманды", Новый Структура("ДополнительныеПараметры", ДополнительныеПараметры));
	СозданиеНаОснованииПотолкиКлиент.РеализацияТоваровИУслугСоздатьНаОснованииЗаказаПокупателя(МассивСсылок, ПараметрыВыполнения);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущийЭлемент()
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНачальнаяСтраница Тогда
		ТекущийЭлемент = Элементы.ИмитацияШК;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДокумент Тогда
		ТекущийЭлемент = Элементы.ИмитацияШК1;		
	КонецЕсли;
	
КонецПроцедуры

//++ №13830
&НаСервере
Процедура СохранитьНастройкиФормы()

	ПользовательскийОтбор = Новый ОтборКомпоновкиДанных();
	ОбщийМодульСервер.НовыйОтбор(ПользовательскийОтбор, "СтатусСборки", ЗаказПокупателяОтборПоСтатусуСборки);
	ОбщийМодульСервер.НовыйОтбор(ПользовательскийОтбор, "ТекущийСтатус", ЗаказПокупателяОтборПоТекущемуСтатусу); // №14078
	ОбщийМодульСервер.НовыйОтбор(ПользовательскийОтбор, "СтатусОбеспечения", ЗаказПокупателяОтборПоСтатусуОбеспечения);
	
	СтруктураНастроек = Новый Структура;	
	СтруктураНастроек.Вставить("НастройкиОтбораЗП",  Новый ХранилищеЗначения(ПользовательскийОтбор));
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("РабочееМестоСотрудникаСклада", "НастройкиФормыСписка", СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()

	СтруктураНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РабочееМестоСотрудникаСклада", "НастройкиФормыСписка");
	
	Если НЕ ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		Возврат;	
	КонецЕсли;
	
	ПользовательскийОтбор = СтруктураНастроек.НастройкиОтбораЗП.Получить();	
	
	МассивРеквизитовСтатусыСборки = ПолучитьМассивРеквизитовСтатусыСборки();
	МассивРеквизитовСтатусыЗаказа = ПолучитьМассивРеквизитовСтатусыЗаказа(ИспользоватьСтатусЗакрытВЗаказеПокупателя); // №14078
	МассивРеквизитовСтатусыобеспечения = Новый Массив;
	МассивРеквизитовСтатусыобеспечения.Добавить("Не обеспечен");
	МассивРеквизитовСтатусыобеспечения.Добавить("Обеспечен");
	
	Для Каждого НастройкаОтбора Из ПользовательскийОтбор.Элементы Цикл
		
		// Статусы Обеспечения
		Если НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусОбеспечения") Тогда
			
			Для Каждого ЭлементСписка Из НастройкаОтбора.ПравоеЗначение Цикл
				
				Если НЕ МассивРеквизитовСтатусыобеспечения.Найти(ЭлементСписка.Значение) = Неопределено Тогда
					
					ЗаказПокупателяОтборПоСтатусуОбеспечения.Добавить(ЭлементСписка.Значение);
					
					Если ЭлементСписка.Значение = "Не обеспечен" Тогда
						Элементы["СписокЗаказыПокупателейОтборСтатус" + "НеОбеспечен"].Пометка = Истина;
					ИначеЕсли ЭлементСписка.Значение = "Обеспечен" Тогда	
					    Элементы["СписокЗаказыПокупателейОтборСтатус" + "Обеспечен"].Пометка = Истина;
					КонецЕсли;	
				КонецЕсли;
				
			КонецЦикла;

		КонецЕсли;
		
		// Статусы сборки
		Если НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусСборки") Тогда
			
			Для Каждого ЭлементСписка Из НастройкаОтбора.ПравоеЗначение Цикл
				
				Если НЕ МассивРеквизитовСтатусыСборки.Найти(ЭлементСписка.Значение.ИмяПредопределенныхДанных) = Неопределено Тогда
					
					ЗаказПокупателяОтборПоСтатусуСборки.Добавить(ЭлементСписка.Значение);
					
					Элементы["СписокЗаказыПокупателейОтборСтатус" + ЭлементСписка.Значение.ИмяПредопределенныхДанных].Пометка = Истина;
					
				ИначеЕсли ЭлементСписка.Значение = Справочники.СтатусыСборкиЗаказов.ПустаяСсылка() Тогда
					
					ЗаказПокупателяОтборПоСтатусуСборки.Добавить(ЭлементСписка.Значение);
					
					Элементы["СписокЗаказыПокупателейОтборСтатусНеУказан"].Пометка = Истина;
					
				КонецЕсли;
				
			КонецЦикла;

		КонецЕсли;
		
		//++ №14078 статусы заказа
		Если НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТекущийСтатус") Тогда
			
			Для Каждого ЭлементСписка Из НастройкаОтбора.ПравоеЗначение Цикл
				
				Если НЕ МассивРеквизитовСтатусыЗаказа.Найти(ЭлементСписка.Значение.ИмяПредопределенныхДанных) = Неопределено Тогда
					
					ЗаказПокупателяОтборПоТекущемуСтатусу.Добавить(ЭлементСписка.Значение);
					
					Элементы["ОтборСтатусЗаказа" + ЭлементСписка.Значение.ИмяПредопределенныхДанных].Пометка = Истина;
					
				КонецЕсли;
				
			КонецЦикла;

		КонецЕсли;
		//-- №14078
		
	КонецЦикла;
	
КонецПроцедуры 
//-- №13830

&НаСервереБезКонтекста
Функция ДействиеТребуетУказаниеСотрудника(Действие)
	
	СпрСсылка = Справочники.ДействияВРабочемМестеРаботникаСклада[Действие];
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпрСсылка, "ТребуетсяУказатьСотрудника");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатусЗаказа(Заказ)
	Возврат Заказ.СтатусСборки;	
КонецФункции

&НаСервере
Процедура ИзменитьСтатусСборкиНаидетСборка(Заказ) 
	
	Если НЕ ЗначениеЗаполнено(Заказ) ИЛИ ТипЗнч(Заказ) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ЗаказОбъект = Заказ.ПолучитьОбъект();
		ЗаказОбъект.Заблокировать();
		ЗаказОбъект.СтатусСборки = Справочники.СтатусыСборкиЗаказов.ИдетСборка;
		ЗаказОбъект.Записать();
		ЗаказОбъект.Разблокировать();
	Исключение
		Сообщить(НСтр("ru = 'Невозможно заблокировать документ.';"
     + " en = 'Can't lock the document.'"));
	КонецПопытки;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	

#КонецОбласти

#Область ОтборЗаказыПокупателей

//++ №13830
&НаКлиенте
Процедура СписокЗаказыПокупателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокЗаказыПокупателей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыборДокументаИзСпискаЗавершение(ТекущиеДанные.Ссылка, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусНеУказан(Команда)
	
	Элементы.СписокЗаказыПокупателейОтборСтатусНеУказан.Пометка = НЕ Элементы.СписокЗаказыПокупателейОтборСтатусНеУказан.Пометка;
	
	ВыделитьКнопкиОтбораСтатусаСборки();
	ОтборСтатусСборки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусВыполнитьСборку(Команда)
	
	Элементы.СписокЗаказыПокупателейОтборСтатусВыполнитьСборку.Пометка = НЕ Элементы.СписокЗаказыПокупателейОтборСтатусВыполнитьСборку.Пометка;
	
	ВыделитьКнопкиОтбораСтатусаСборки();
	ОтборСтатусСборки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусСобранЧастично(Команда)
	
	Элементы.СписокЗаказыПокупателейОтборСтатусСобранЧастично.Пометка = НЕ Элементы.СписокЗаказыПокупателейОтборСтатусСобранЧастично.Пометка;
	
	ВыделитьКнопкиОтбораСтатусаСборки();
	ОтборСтатусСборки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусСобранПолностью(Команда)
	
	Элементы.СписокЗаказыПокупателейОтборСтатусСобранПолностью.Пометка = НЕ Элементы.СписокЗаказыПокупателейОтборСтатусСобранПолностью.Пометка;
	
	ВыделитьКнопкиОтбораСтатусаСборки();
	ОтборСтатусСборки();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьМассивРеквизитовСтатусыСборки()
	
	МассивРеквизитов = новый Массив;
	МассивРеквизитов.Добавить("НеУказан");
	МассивРеквизитов.Добавить("ВыполнитьСборку");
	МассивРеквизитов.Добавить("СобранЧастично");
	МассивРеквизитов.Добавить("СобранПолностью");
	
	Возврат МассивРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ОтборСтатусСборки()
	
	МассивРеквизитов = ПолучитьМассивРеквизитовСтатусыСборки();
	
	ЗаказПокупателяОтборПоСтатусуСборки.Очистить();
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		Если Элементы["СписокЗаказыПокупателейОтборСтатус" + ИмяРеквизита].Пометка Тогда
			
			Если ИмяРеквизита = "НеУказан" Тогда
				ЗаказПокупателяОтборПоСтатусуСборки.Добавить(ПредопределенноеЗначение("Справочник.СтатусыСборкиЗаказов.ПустаяСсылка"));
			Иначе
				ЗаказПокупателяОтборПоСтатусуСборки.Добавить(ПредопределенноеЗначение("Справочник.СтатусыСборкиЗаказов." + ИмяРеквизита));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьОтборЗаказовПокупателей();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьКнопкиОтбораСтатусаСборки()
	
	МассивРеквизитов = ПолучитьМассивРеквизитовСтатусыСборки();
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		ЭлементКнопка = Элементы["СписокЗаказыПокупателейОтборСтатус" + ИмяРеквизита];
		
		Если ЭлементКнопка.Пометка Тогда
			ЭлементКнопка.ЦветФона = WebЦвета.Оранжевый;
		Иначе
			ЭлементКнопка.ЦветФона = WebЦвета.СветлоЖелтыйЗолотистый;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//-- №13830

//++ №14078
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьМассивРеквизитовСтатусыЗаказа(ИспользоватьСтатусЗакрыт)
	
	МассивРеквизитов = новый Массив;
	МассивРеквизитов.Добавить("Новый");
	МассивРеквизитов.Добавить("ВРаботе");
	МассивРеквизитов.Добавить("Выполнен");
	МассивРеквизитов.Добавить("Отменен");
	
	Если ИспользоватьСтатусЗакрыт Тогда
		МассивРеквизитов.Добавить("Закрыт");
	КонецЕсли;
	
	Возврат МассивРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ОтборСтатусЗаказаНовый(Команда)
	
	Элементы.ОтборСтатусЗаказаНовый.Пометка = НЕ Элементы.ОтборСтатусЗаказаНовый.Пометка;
	
	ВыделитьКнопкиОтбораСтатусаЗаказа();
	ОтборСтатусЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусЗаказаВРаботе(Команда)
	
	Элементы.ОтборСтатусЗаказаВРаботе.Пометка = НЕ Элементы.ОтборСтатусЗаказаВРаботе.Пометка;
	
	ВыделитьКнопкиОтбораСтатусаЗаказа();
	ОтборСтатусЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусЗаказаВыполнен(Команда)
	
	Элементы.ОтборСтатусЗаказаВыполнен.Пометка = НЕ Элементы.ОтборСтатусЗаказаВыполнен.Пометка;
	
	ВыделитьКнопкиОтбораСтатусаЗаказа();
	ОтборСтатусЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусЗаказаЗакрыт(Команда)
	
	Элементы.ОтборСтатусЗаказаЗакрыт.Пометка = НЕ Элементы.ОтборСтатусЗаказаЗакрыт.Пометка;
	
	ВыделитьКнопкиОтбораСтатусаЗаказа();
	ОтборСтатусЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусЗаказаОтменен(Команда)
	
	Элементы.ОтборСтатусЗаказаОтменен.Пометка = НЕ Элементы.ОтборСтатусЗаказаОтменен.Пометка;
	
	ВыделитьКнопкиОтбораСтатусаЗаказа();
	ОтборСтатусЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусЗаказа()
	
	МассивРеквизитов = ПолучитьМассивРеквизитовСтатусыЗаказа(ИспользоватьСтатусЗакрытВЗаказеПокупателя);
	
	ЗаказПокупателяОтборПоТекущемуСтатусу.Очистить();
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		Если Элементы["ОтборСтатусЗаказа" + ИмяРеквизита].Пометка Тогда
			
			ЗаказПокупателяОтборПоТекущемуСтатусу.Добавить(ПредопределенноеЗначение("Справочник.СтатусыЗаказовПокупателей." + ИмяРеквизита));
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьОтборЗаказовПокупателей();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьКнопкиОтбораСтатусаЗаказа()
	
	МассивРеквизитов = ПолучитьМассивРеквизитовСтатусыЗаказа(ИспользоватьСтатусЗакрытВЗаказеПокупателя);
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		ЭлементКнопка = Элементы["ОтборСтатусЗаказа" + ИмяРеквизита];
		
		Если ЭлементКнопка.Пометка Тогда
			ЭлементКнопка.ЦветФона = WebЦвета.Оранжевый;
		Иначе
			ЭлементКнопка.ЦветФона = WebЦвета.СветлоЖелтыйЗолотистый;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//-- №14078

&НаКлиенте
Процедура ОтборСтатусНеОбеспечен(Команда)
	
	Элементы.СписокЗаказыПокупателейОтборСтатусНеОбеспечен.Пометка = НЕ Элементы.СписокЗаказыПокупателейОтборСтатусНеОбеспечен.Пометка;
	
	ВыделитьКнопкиОтбораСтатусаОбеспечения();
	
	ОтборСтатусОбеспечения();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусОбеспечен(Команда)
	Элементы.СписокЗаказыПокупателейОтборСтатусОбеспечен.Пометка = НЕ Элементы.СписокЗаказыПокупателейОтборСтатусОбеспечен.Пометка;
	
	ВыделитьКнопкиОтбораСтатусаОбеспечения();
	
	ОтборСтатусОбеспечения();
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьКнопкиОтбораСтатусаОбеспечения()
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("НеОбеспечен");
	МассивРеквизитов.Добавить("Обеспечен");
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		ЭлементКнопка = Элементы["СписокЗаказыПокупателейОтборСтатус" + ИмяРеквизита];
		
		Если ЭлементКнопка.Пометка Тогда
			ЭлементКнопка.ЦветФона = WebЦвета.Оранжевый;
		Иначе
			ЭлементКнопка.ЦветФона = WebЦвета.СветлоЖелтыйЗолотистый;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусОбеспечения()
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("НеОбеспечен");
	МассивРеквизитов.Добавить("Обеспечен");
	
	ЗаказПокупателяОтборПоСтатусуОбеспечения.Очистить();
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		Если Элементы["СписокЗаказыПокупателейОтборСтатус" + ИмяРеквизита].Пометка Тогда
			Если ИмяРеквизита = "Обеспечен" Тогда
				ЗаказПокупателяОтборПоСтатусуОбеспечения.Добавить("Обеспечен");
			ИначеЕсли ИмяРеквизита = "НеОбеспечен" Тогда	
			    ЗаказПокупателяОтборПоСтатусуОбеспечения.Добавить("Не обеспечен");
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьОтборЗаказовПокупателей();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборЗаказовПокупателей()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказыПокупателей,
			"СтатусСборки", ЗаказПокупателяОтборПоСтатусуСборки, ВидСравненияКомпоновкиДанных.ВСписке,, ЗаказПокупателяОтборПоСтатусуСборки.Количество() > 0);
	
	//++ №14078
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказыПокупателей,
			"ТекущийСтатус", ЗаказПокупателяОтборПоТекущемуСтатусу, ВидСравненияКомпоновкиДанных.ВСписке,, ЗаказПокупателяОтборПоТекущемуСтатусу.Количество() > 0);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказыПокупателей,
			"СтатусОбеспечения", ЗаказПокупателяОтборПоСтатусуОбеспечения, ВидСравненияКомпоновкиДанных.ВСписке,, ЗаказПокупателяОтборПоСтатусуОбеспечения.Количество() > 0);

	//-- №14078
	
	СохранитьНастройкиФормы(); // #14403
	
КонецПроцедуры


#КонецОбласти

#Область Печать

//++ №13830
&НаКлиенте
Процедура ПечатьЗаказПокупателя(ЗаказСсылка)

	СтруктураПечати = ПолучитьСтруктуруПечати();
	
	Если НЕ СтруктураПечати.ПечатнаяФормаУказана Тогда
		
		ПоказатьПредупреждение(, "В настройках пользователя не указана печатная форма заказа покупателя для рабочего места кладовщика.");
		Возврат;
		
	ИначеЕсли НЕ СтруктураПечати.ПечатнаяФормаНайдена Тогда
		
		ПоказатьПредупреждение(, "Не удалось найти печатную форму для заказа покупателя, указанную в настройках пользователя, необходимо выбрать актуальную печатную форму в настройках пользователя.");
		Возврат;
		
	КонецЕсли;
	
	МассивОбъектов = новый Массив;
	МассивОбъектов.Добавить(ЗаказСсылка);
	
	Если СтруктураПечати.МенеджерПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" Тогда
		
		//СтруктураПечати.Вставить("Форма", ЭтаФорма);		
		//ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеПечатнойФормыЗавершение(МассивОбъектов, СтруктураПечати);
		
		УправлениеПечатьюСлужебныйКлиент.ВыполнитьОткрытиеПечатнойФормы( 
			СтруктураПечати.ВыполняемаяКоманда.Ссылка,
			СтруктураПечати.ВыполняемаяКоманда.Идентификатор,
			МассивОбъектов,
			ЭтотОбъект,
			Истина);
		
	Иначе		
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(СтруктураПечати.МенеджерПечати, 
			СтруктураПечати.Идентификатор,
			МассивОбъектов,
			ЭтотОбъект);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПечати()
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("ПечатнаяФорма", ОбщийМодульСервер.НастройкаПользователя("ПечатнаяФормаЗаказаПокупателяВРабочемМестеКладовщика"));
	СтруктураДанных.Вставить("ПечатнаяФормаУказана", ЗначениеЗаполнено(СтруктураДанных.ПечатнаяФорма));
	
	Если Не СтруктураДанных.ПечатнаяФормаУказана Тогда
		Возврат СтруктураДанных;
	КонецЕсли;
	
	КомандыПечатиЗаказаПокупателя = УправлениеПечатью.КомандыПечатиФормы("Документ.ЗаказПокупателя.Форма.ФормаДокумента").Скопировать();
	
	НайденныеСтроки = КомандыПечатиЗаказаПокупателя.НайтиСтроки(новый Структура("Идентификатор", СтруктураДанных.ПечатнаяФорма));
	
	СтруктураДанных.Вставить("ПечатнаяФормаНайдена", НайденныеСтроки.Количество() > 0);
	
	Если НЕ СтруктураДанных.ПечатнаяФормаНайдена Тогда
		Возврат СтруктураДанных;
	КонецЕсли;
	
	ДанныеКоманды = НайденныеСтроки[0];
	
	СтруктураДанных.Вставить("Идентификатор", ДанныеКоманды.Идентификатор);
	СтруктураДанных.Вставить("МенеджерПечати", ДанныеКоманды.МенеджерПечати);
	
	ВыполняемаяКоманда = новый Структура;
	
	Если СтруктураДанных.МенеджерПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" И ТипЗнч(ДанныеКоманды.ДополнительныеПараметры) = Тип("Структура") Тогда
		
		ВыполняемаяКоманда.Вставить("Ссылка", ДанныеКоманды.ДополнительныеПараметры.Ссылка);
		ВыполняемаяКоманда.Вставить("Идентификатор", ДанныеКоманды.Идентификатор);
		
	КонецЕсли;
	
	СтруктураДанных.Вставить("ВыполняемаяКоманда", ВыполняемаяКоманда);
	
	Возврат СтруктураДанных;
	
КонецФункции



//-- №13830

#КонецОбласти

