
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// СтандартнаяОбработка = Ложь;
	
	СтПериод = Неопределено;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтПериод");
	Если Параметр <> Неопределено  Тогда
		Элемент = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		Если Элемент <> Неопределено И Элемент.Использование Тогда
			СтПериод = Элемент;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СтПериод = Неопределено Тогда
		Если НЕ СтПериод.Значение.ДатаОкончания = Дата(1,1,1) Тогда
			КонецТекущегоПериода = СтПериод.Значение.ДатаОкончания;
		Иначе
			КонецТекущегоПериода = ТекущаяДата();		
		КонецЕсли;
	Иначе
		КонецТекущегоПериода = ТекущаяДата();	
	КонецЕсли;	
		
	//КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецТекущегоПериода", КонецТекущегоПериода);
		
	ПараметрРасчета = Новый ПараметрКомпоновкиДанных("КонецТекущегоПериода");
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрРасчета, КонецТекущегоПериода);
	
КонецПроцедуры