
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыМонтажа.Ссылка КАК Ссылка,
	|	ВидыМонтажа.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыМонтажа КАК ВидыМонтажа
	|ГДЕ
	|	НЕ ВидыМонтажа.ПометкаУдаления
	// #12721 временно скрываем элемент
	//|	И НЕ ВидыМонтажа.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Продажа)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);		
	КонецЦикла;
	
КонецПроцедуры
