
&НаКлиенте
Процедура ВидыПлатежныхКартОсновнаяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВидыПлатежныхКарт.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если ТекущиеДанные.Основная Тогда
			Для каждого СтрокаТЧ из объект.ВидыПлатежныхКарт Цикл
				Если СтрокаТЧ.НомерСтроки <> ТекущиеДанные.НомерСтроки Тогда
					СтрокаТЧ.Основная = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

//++ №9147
&НаКлиенте
Процедура ИспользоватьБезПодключенияОборудованияПриИзменении(Элемент)
	
	Если Объект.ИспользоватьБезПодключенияОборудования Тогда
		Элементы.ПодключаемоеОборудование.Доступность = Ложь;
		Объект.ПодключаемоеОборудование = Неопределено;
	Иначе
		Элементы.ПодключаемоеОборудование.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ ИспользоватьПодключаемоеОборудование Тогда
			Объект.ИспользоватьБезПодключенияОборудования = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		Элементы.ПодключаемоеОборудование.Доступность = Не Объект.ИспользоватьБезПодключенияОборудования;
	Иначе
		Элементы.ИспользоватьБезПодключенияОборудования.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

//-- №9147