
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УзелОбмена = ПараметрКоманды;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УзелОбмена", УзелОбмена);
	ПараметрыФормы.Вставить("ВыгружатьТолькоИзменения", Истина);

	ПроверитьНастройкиУзла(УзелОбмена, ПараметрыФормы);
	Если НЕ ПараметрыФормы.ОбменЗаказами Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'В выбранном узле не включен обмен заказами. Выполните необходимые настройки по обмену заказами.'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ПланОбмена.ОбменССайтом.Форма.ФормаВыполнениеОбмена", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, УзелОбмена);
	
КонецПроцедуры

Процедура ПроверитьНастройкиУзла(УзелОбмена, ПараметрыФормы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОбменССайтом.ОбменТоварами КАК ОбменТоварами,
	|	ОбменССайтом.ОбменЗаказами КАК ОбменЗаказами
	|ИЗ
	|	ПланОбмена.ОбменССайтом КАК ОбменССайтом
	|ГДЕ
	|	ОбменССайтом.Ссылка = &УзелОбмена";
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПараметрыФормы.Вставить("ОбменТоварами", Ложь);
		ПараметрыФормы.Вставить("ОбменЗаказами", Выборка.ОбменЗаказами);
	КонецЦикла;
	
КонецПроцедуры