#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	//++ №9324 если не установлена галочка "Создан при использовании статуса "Закрыт" в списке возможных статусов документа не показывать к выбору статус "Закрыт"
	// По умолчанию смотрим на константу
	ИспользоватьСтатусЗакрытВЗаказеПокупателя = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусЗакрытВЗаказеПокупателя");
	
	// Если выбираем статус из формы заказа покупателя, то в параметрах ожидаем признак
	Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("СозданПриИспользованииСтатусаЗакрыт") Тогда
		ИспользоватьСтатусЗакрытВЗаказеПокупателя = Параметры.СозданПриИспользованииСтатусаЗакрыт;
	КонецЕсли;
	//-- №9324
	
	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ИспользуетсяСтатусНовый", ПолучитьФункциональнуюОпцию("ИспользоватьСтатусНовыйВЗаказеПокупателя"));
	Запрос.УстановитьПараметр("ИспользуетсяСтатусЗакрыт", ИспользоватьСтатусЗакрытВЗаказеПокупателя); // №9324 меняем на новый признак, ранее было: ПолучитьФункциональнуюОпцию("ИспользоватьСтатусЗакрытВЗаказеПокупателя"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЗаказовПокупателей.Ссылка КАК ВидСтатуса,
	|	СтатусыЗаказовПокупателей.Наименование КАК Наименование
	//|	ВЫБОР
	//|		КОГДА СтатусыЗаказовПокупателей.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.Новый)
	//|			ТОГДА 1
	//|		ИНАЧЕ 2
	//|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.СтатусыЗаказовПокупателей КАК СтатусыЗаказовПокупателей
	|ГДЕ
	//#13253
	//|	НЕ СтатусыЗаказовПокупателей.ПометкаУдаления
	|	СтатусыЗаказовПокупателей.Использовать
	//|	И ВЫБОР
	//|			КОГДА &ИспользуетсяСтатусНовый
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ СтатусыЗаказовПокупателей.Ссылка <> ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.Новый)
	//|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользуетсяСтатусЗакрыт
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ СтатусыЗаказовПокупателей.Ссылка <> ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.Закрыт)
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	//#13253
	//|	Приоритет,
	|	РеквизитДопУпорядочивания,
	|	Наименование";
	
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл		
		ДанныеВыбора.Добавить(Выборка.ВидСтатуса, Выборка.Наименование);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция НачальныйСтатус() Экспорт
	
	// #13253
	//Возврат ?(ПолучитьФункциональнуюОпцию("ИспользоватьСтатусНовыйВЗаказеПокупателя"), Справочники.СтатусыЗаказовПокупателей.Новый, Справочники.СтатусыЗаказовПокупателей.ВРаботе);
	Возврат ?(Справочники.СтатусыЗаказовПокупателей.Новый.Использовать, Справочники.СтатусыЗаказовПокупателей.Новый, Справочники.СтатусыЗаказовПокупателей.ВРаботе);

КонецФункции

Функция НачальныйСтатусПоИнтеркампани(НастройкаИнтеркампани) Экспорт
	
	// #13253
	//Возврат ?(ПолучитьФункциональнуюОпцию("ИспользоватьСтатусНовыйВЗаказеПокупателя"), Справочники.СтатусыЗаказовПокупателей.Новый, Справочники.СтатусыЗаказовПокупателей.ВРаботе);
	Возврат ?(Справочники.СтатусыЗаказовПокупателей.Новый.Использовать, Справочники.СтатусыЗаказовПокупателей.Новый, Справочники.СтатусыЗаказовПокупателей.ВРаботе);
		
КонецФункции

Функция СписокСтатусов() Экспорт
	
	СписокСтатусов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИспользуетсяСтатусЗакрыт", ПолучитьФункциональнуюОпцию("ИспользоватьСтатусЗакрытВЗаказеПокупателя"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Статусы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыЗаказовПокупателей КАК Статусы
	|ГДЕ
	|	Статусы.Использовать
	|	И ВЫБОР
	|			КОГДА &ИспользуетсяСтатусЗакрыт
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Статусы.Ссылка <> ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.Закрыт)
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статусы.РеквизитДопУпорядочивания";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСтатусов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СписокСтатусов;
	
КонецФункции

Функция СписокСтатусовВРаботе() Экспорт
	
	СписокСтатусов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Статусы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыЗаказовПокупателей КАК Статусы
	|ГДЕ
	|	Статусы.Использовать
	|	И (НЕ Статусы.Предопределенный
	|			ИЛИ Статусы.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статусы.РеквизитДопУпорядочивания";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСтатусов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СписокСтатусов;
	
КонецФункции

Функция СтатусВРаботе(ТекущийСтатус) Экспорт
	
	Возврат ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.ВРаботе ИЛИ НЕ ТекущийСтатус.Предопределенный;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

// #13253
// Процедура заполняет справочник по умолчанию
//
Процедура ЗаполнитьПоставляемыеСтатусы() Экспорт
	
	СтатусОбъект = Справочники.СтатусыЗаказовПокупателей.Новый.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 10;
	СтатусОбъект.Использовать = Константы.УДАЛИТЬ_ИспользоватьСтатусНовыйВЗаказеПокупателя.Получить(); // в версии 2.8.15
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЗаказовПокупателей.ВРаботе.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 20;
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЗаказовПокупателей.Выполнен.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 30;
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЗаказовПокупателей.Закрыт.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 40;
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЗаказовПокупателей.Отменен.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 50;
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.Записать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Статусы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыЗаказовПокупателей КАК Статусы
	|ГДЕ
	|	НЕ Статусы.Предопределенный";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтатусОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтатусОбъект.РеквизитДопУпорядочивания = 99999;
		СтатусОбъект.Использовать = Истина;
		СтатусОбъект.Записать();		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли