
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(СтатусыЗаказовПокупателей.РеквизитДопУпорядочивания) КАК РеквизитДопУпорядочивания
	|ИЗ
	|	Справочник.СтатусыЗаказовПокупателей КАК СтатусыЗаказовПокупателей";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		РеквизитДопУпорядочивания = Выборка.РеквизитДопУпорядочивания + 10;
	КонецЕсли;

КонецПроцедуры
