
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Печать(ПараметрКоманды);
	Если ТабДок<>Неопределено Тогда
		ТабДок.Показать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Печать(СсылкаНаОбъект)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗНО";
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
		
	Макет = Документы.ИА_ЗаявкаНаОбязательства.ПолучитьМакет("ЗНО");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОблШапка.Параметры.Дата = Формат(СсылкаНаОбъект.Дата, "ДФ='dd MMMM yyyy ""г.""'");
	ОблШапка.Параметры.Подразделение = СсылкаНаОбъект.Подразделение;
	ОблШапка.Параметры.СОСТАВИТЕЛЬ = "СОСТАВИТЕЛЬ: " + СсылкаНаОбъект.Сотрудник;
	ОблШапка.Параметры.СТОИМОСТЬ = "СТОИМОСТЬ: " + СсылкаНаОбъект.Сумма;
	ОблШапка.Параметры.ТОВАРУСЛУГА = "ТОВАР/УСЛУГА: " + СсылкаНаОбъект.ПредметЗаказа;
	ОблШапка.Параметры.СТАТЬЯРАСХОДОВ = "СТАТЬЯ РАСХОДОВ: " + СсылкаНаОбъект.Фонд;
	ОблШапка.Параметры.СРОКОПЛАТЫ = "СРОК ОПЛАТЫ: " + Формат(СсылкаНаОбъект.ДатаОплаты, "ДФ=dd.MM.yyyy");
	ОблШапка.Параметры.СИТУАЦИЯ = "СИТУАЦИЯ: " + СсылкаНаОбъект.СИТУАЦИЯ;
	ОблШапка.Параметры.Данные = "ДАННЫЕ: " + СсылкаНаОбъект.Данные;
	ОблШапка.Параметры.РЕШЕНИЕ = "РЕШЕНИЕ: " + СсылкаНаОбъект.РЕШЕНИЕ;
		
	ТабДокумент.Вывести(ОблШапка);
	
	ТабДокумент.АвтоМасштаб=Истина;
	
	Возврат ТабДокумент;
	
	
КонецФункции