////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы (CRM:Потолки)
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                  Обработчики обновления таких библиотек должны быть вызваны ранее
//                                  обработчиков обновления данной библиотеки.
//                                  При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                  порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                  в процедуре ПриДобавленииПодсистем общего модуля ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПоследняяАктивностьПользователяПриЗаписи(Источник, Отказ) Экспорт
	
	НаборЗаписей = РегистрыСведений.АктивностьПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователи.ТекущийПользователь());
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Пользователь = Пользователи.ТекущийПользователь(); 
	НоваяЗапись.ДатаПоследнегоДействия = ТекущаяДатаСеанса(); 
	НоваяЗапись.НомерСессии = ПараметрыСеанса.ТекущийПользовательНомерСессииНаСервере;
	
	НаборЗаписей.Записать(Истина);
		
КонецПроцедуры

Процедура ПоследняяАктивностьПользователяПросмотрОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	НаборЗаписей = РегистрыСведений.АктивностьПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователи.ТекущийПользователь());
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Пользователь = Пользователи.ТекущийПользователь(); 
	НоваяЗапись.ДатаПоследнегоДействия = ТекущаяДатаСеанса();
	НоваяЗапись.НомерСессии = ПараметрыСеанса.ТекущийПользовательНомерСессииНаСервере;
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

Процедура ЗаписатьИсториюВерсий(Версия)
	
	НаборЗаписей = РегистрыСведений.ИсторияВерсий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Версия.Установить(Версия);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Версия = Версия; 
		НоваяЗапись.ДатаУстановки = ТекущаяДатаСеанса(); 
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя	= "Потолки";
	
	Описание.Версия = "3.1.17.0";	//++ 2023-12-05
	//Описание.Версия = "3.1.16.0";	//++ 2023-11-09
	//Описание.Версия = "3.1.15.0";	//++ 2023-10-31
	//Описание.Версия = "3.1.14.0";	//++ 2023-10-30
	//Описание.Версия = "3.1.13.0";	//++ 2023-10-16
	//Описание.Версия = "3.1.12.0";	//++ 2023-10-13
	//Описание.Версия = "3.1.11.0";	//++ 2023-10-09
	//Описание.Версия = "3.1.10.0";	//++ 2023-10-03
	//Описание.Версия = "3.1.9.0";	//++ 2023-09-28
	//Описание.Версия = "3.1.8.0";	//++ 2023-09-12
	//Описание.Версия = "3.1.7.0";	//++ 2023-09-01
	//Описание.Версия = "3.1.6.0";	//++ 2023-08-31
	//Описание.Версия = "3.1.5.0";	//++ 2023-08-24
	//Описание.Версия = "3.1.4.0";	//++ 2023-08-21
	//Описание.Версия = "3.1.3.0";	//++ 2023-08-08
	//Описание.Версия = "3.1.2.0";	//++ 2023-06-29
	//Описание.Версия = "3.1.1.0";	//++ 2023-06-24
	//Описание.Версия = "3.1.0.0";	//++ 2023-06-17
	
	//Описание.Версия = "3.0.100.0"; //++ 2023-06-17 //техническая версия, обязательная к установке перед обновлением на 3.1.0.0
	//Описание.Версия = "3.0.25.0";	//++ 2023-08-31
	//Описание.Версия = "3.0.24.0";	//++ 2023-08-21
	//Описание.Версия = "3.0.23.0";	//++ 2023-08-14
	//Описание.Версия = "3.0.20.0";	//++ 2023-06-08
	//Описание.Версия = "3.0.19.0";	//++ 2023-05-23
	//Описание.Версия = "3.0.18.0";	//++ 2023-04-27
	//Описание.Версия = "3.0.17.0";	//++ 2023-04-12
	//Описание.Версия = "3.0.16.0";	//++ 2023-04-03
	//Описание.Версия = "3.0.15.0";	//++ 2023-03-03
	//Описание.Версия = "3.0.14.0";	//++ 2023-02-14
	//Описание.Версия = "3.0.13.0";	//++ 2023-02-02
	//Описание.Версия = "3.0.12.0";	//++ 2023-01-31
	//Описание.Версия = "3.0.11.0";	//++ 2023-01-18
	//Описание.Версия = "3.0.10.0";	//++ 2022-12-12
	//Описание.Версия = "3.0.9.0";	//++ 2022-11-25
	//Описание.Версия = "3.0.8.0";	//++ 2022-11-10
	//Описание.Версия = "3.0.7.0";	//++ 2022-10-25
	//Описание.Версия = "3.0.6.0";	//++ 2022-10-04
	//Описание.Версия = "3.0.5.0";	//++ 2022-10-03
	//Описание.Версия = "3.0.4.0";	//++ 2022-09-28
	//Описание.Версия = "3.0.3.0";	//++ 2022-09-27
	//Описание.Версия = "3.0.2.0";	//++ 2022-09-15
	//Описание.Версия = "3.0.1.0";	//++ 2022-09-12
	//Описание.Версия = "3.0.0.0";	//++ 2022-09-02
	
	//Описание.Версия = "2.8.36.0";	//++ 2022-07-21
	//Описание.Версия = "2.8.35.0";	//++ 2022-07-18
	//Описание.Версия = "2.8.34.0";	//++ 2022-07-13
	//Описание.Версия = "2.8.33.0";	//++ 2022-07-08
	//Описание.Версия = "2.8.32.0";	//++ 2022-06-24
	//Описание.Версия = "2.8.31.0";	//++ 2022-06-20
	//Описание.Версия = "2.8.30.0";	//++ 2022-06-07
	//Описание.Версия = "2.8.29.0";	//++ 2022-06-01
	//Описание.Версия = "2.8.28.0";	//++ 2022-05-31
	//Описание.Версия = "2.8.27.0";	//++ 2022-05-20
	//Описание.Версия = "2.8.26.0";	//++ 2022-05-06
	//Описание.Версия = "2.8.25.0";	//++ 2022-05-04
	//Описание.Версия = "2.8.24.0";	//++ 2022-04-12
	//Описание.Версия = "2.8.23.0";	//++ 2022-04-07
	//Описание.Версия = "2.8.22.0";	//++ 2022-04-04
	//Описание.Версия = "2.8.21.0";	//++ 2022-03-29
	//Описание.Версия = "2.8.20.0";	//++ 2022-03-25
	//Описание.Версия = "2.8.19.0";	//++ 2022-03-16
	//Описание.Версия = "2.8.18.0";	//++ 2022-03-10
	//Описание.Версия = "2.8.17.0";	//++ 2022-03-01
	//Описание.Версия = "2.8.16.0";	//++ 2022-02-28
	//Описание.Версия = "2.8.15.0";	//++ 2022-02-25
	//Описание.Версия = "2.8.14.0";	//++ 2022-02-21
	//Описание.Версия = "2.8.13.0";	//++ 2022-02-18
	//Описание.Версия = "2.8.12.0";	//++ 2022-02-16
	//Описание.Версия = "2.8.11.0";	//++ 2022-02-10
	//Описание.Версия = "2.8.10.0";	//++ 2022-02-04
	//Описание.Версия = "2.8.9.0";	//++ 2022-02-03
	//Описание.Версия = "2.8.8.0";	//++ 2022-01-28
	//Описание.Версия = "2.8.7.0";	//++ 2022-01-22
	//Описание.Версия = "2.8.6.0";	//++ 2021-12-29
	//Описание.Версия = "2.8.5.0";	//++ 2021-12-24
	//Описание.Версия = "2.8.4.0";	//++ 2021-12-23
	//Описание.Версия = "2.8.3.0";	//++ 2021-12-21
	//Описание.Версия = "2.8.2.0";	//++ 2021-12-17
	//Описание.Версия = "2.8.1.0";	//++ 2021-12-15
	//Описание.Версия = "2.8.0.0";	//++ 2021-12-04
	//Описание.Версия = "2.7.37.0";	//++ 2021-12-01
	//Описание.Версия = "2.7.36.0";	//++ 2021-11-29
	//Описание.Версия = "2.7.35.0";	//++ 2021-11-19
	//Описание.Версия = "2.7.34.0";	//++ 2021-11-16
	//Описание.Версия = "2.7.33.0";	//++ 2021-11-12
	//Описание.Версия = "2.7.32.0";	//++ 2021-11-11
	//Описание.Версия = "2.7.31.0";	//++ 2021-11-08
	//Описание.Версия = "2.7.30.0";	//++ 2021-11-03
	//Описание.Версия = "2.7.29.0";	//++ 2021-11-02
	//Описание.Версия = "2.7.28.0";	//++ 2021-11-01
	//Описание.Версия = "2.7.27.0";	//++ 2021-10-22
	//Описание.Версия = "2.7.26.0";	//++ 2021-10-16
	//Описание.Версия = "2.7.25.0";	//++ 2021-10-13
	//Описание.Версия = "2.7.24.0";	//++ 2021-09-29
	//Описание.Версия = "2.7.23.0";	//++ 2021-09-24
	//Описание.Версия = "2.7.22.0";	//++ 2021-09-17
	//Описание.Версия = "2.7.21.0";	//++ 2021-09-16
	//Описание.Версия = "2.7.20.0";	//++ 2021-09-09
	//Описание.Версия = "2.7.19.0";	//++ 2021-09-06
	//Описание.Версия = "2.7.18.0";	//++ 2021-09-01
	//Описание.Версия = "2.7.17.0";	//++ 2021-08-18
	//Описание.Версия = "2.7.16.0";	//++ 2021-08-11
	//Описание.Версия = "2.7.15.0";	//++ 2021-07-28
	//Описание.Версия = "2.7.14.0";	//++ 2021-07-26
	//Описание.Версия = "2.7.13.0";	//++ 2021-07-19
	//Описание.Версия = "2.7.12.0";	//++ 2021-07-07
	//Описание.Версия = "2.7.11.0";	//++ 2021-07-02
	//Описание.Версия = "2.7.10.0";	//++ 2021-06-30
	//Описание.Версия = "2.7.9.0";	//++ 2021-06-25
	//Описание.Версия = "2.7.8.0";	//++ 2021-06-18
	//Описание.Версия = "2.7.7.0";	//++ 2021-06-10
	//Описание.Версия = "2.7.6.0";	//++ 2021-06-08
	//Описание.Версия = "2.7.5.0";	//++ 2021-06-02
	//Описание.Версия = "2.7.4.0";	//++ 2021-05-31
	//Описание.Версия = "2.7.3.0";	//++ 2021-05-27
	//Описание.Версия = "2.7.2.0";	//++ 2021-05-25
	//Описание.Версия = "2.7.1.0";	//++ 2021-05-21
	//Описание.Версия = "2.7.0.0";	//++ 2021-05-15
	//Описание.Версия = "2.6.20.0";	//++ 2021-05-21
	//Описание.Версия = "2.6.19.0";	//++ 2021-04-22
	//Описание.Версия = "2.6.18.0";	//++ 2021-04-14
	//Описание.Версия = "2.6.17.0";	//++ 2021-04-06
	//Описание.Версия = "2.6.16.0";	//++ 2021-03-18
	//Описание.Версия = "2.6.15.0";	//++ 2021-03-11
	//Описание.Версия = "2.6.14.0";	//++ 2021-03-05
	//Описание.Версия = "2.6.13.0";	//++ 2021-02-26
	//Описание.Версия = "2.6.12.0";	//++ 2021-02-25
	//Описание.Версия = "2.6.11.0";	//++ 2021-02-11
	//Описание.Версия = "2.6.10.0";	//++ 2021-02-04
	//Описание.Версия = "2.6.9.0";	//++ 2021-01-14
	//Описание.Версия = "2.6.8.0";	//++ 2020-12-11
	//Описание.Версия = "2.6.7.0";	//++ 2020-12-09
	//Описание.Версия = "2.6.6.0";	//++ 2020-12-02
	//Описание.Версия = "2.6.5.0";	//++ 2020-11-30	
	//Описание.Версия = "2.6.4.0";	//++ 2020-11-26
	//Описание.Версия = "2.6.3.0";	//++ 2020-11-19
	//Описание.Версия = "2.6.2.0";	//++ 2020-11-16	
	//Описание.Версия = "2.6.1.0";	//++ 2020-11-13
	//Описание.Версия = "2.6.0.0";	//++ 2020-11-03
	//Описание.Версия = "2.5.12.0";	//++ 2020-08-25
	//Описание.Версия = "2.5.11.0";	//++ 2020-07-22
	//Описание.Версия = "2.5.10.0";	//++ 2020-07-20
	//Описание.Версия = "2.5.9.0";	//++ 2020-07-13
	//Описание.Версия = "2.5.8.0";	//++ 2020-06-30
	//Описание.Версия = "2.5.7.0";	//++ 2020-06-27
	//Описание.Версия = "2.5.6.0";	//++ 2020-06-19
	//Описание.Версия = "2.5.5.0";	//++ 2020-06-11
	//Описание.Версия = "2.5.4.0";	//++ 2020-06-09
	//Описание.Версия = "2.5.3.0";	//++ 2020-06-03
	//Описание.Версия = "2.5.2.0";	//++ 2020-05-29
	//Описание.Версия = "2.5.1.0";	//++ 2020-05-27
	//Описание.Версия = "2.5.0.0";	//++ 2020-05-16
	//Описание.Версия = "2.4.12.0";	//++ 2020-05-07
	//Описание.Версия = "2.4.11.0";	//++ 2020-04-27
	//Описание.Версия = "2.4.10.0"; //++ 2020-04-22
	//Описание.Версия = "2.4.9.0"; 	//++ 2020-04-17
	//Описание.Версия = "2.4.8.0"; 	//++ 2020-04-09
	//Описание.Версия = "2.4.7.0"; 	//++ 2020-04-07
	//Описание.Версия = "2.4.6.0"; 	//++ 2020-03-30
	//Описание.Версия = "2.4.5.0"; 	//++ 2020-03-20
	//Описание.Версия = "2.4.4.0"; 	//++ 2020-03-06
	//Описание.Версия = "2.4.3.0"; 	//++ 2020-02-28
	//Описание.Версия = "2.4.2.0"; 	//++ 2020-02-20
	//Описание.Версия = "2.4.1.0"; 	//++ 2020-02-15
	//Описание.Версия = "2.4.0.0"; 	//++ 2020-02-09
	//Описание.Версия = "2.0.3.0"; 	//++ 2019-12-07
	//Описание.Версия = "2.0.2.0"; 	//++ 2019-09-14
	//Описание.Версия = "2.0.1.0"; 	//++ 2019-06-18
	//Описание.Версия = "2.0.0.0"; 	//++ 2018-12-19
	//Описание.Версия = "1.1.1.0"; 	//++ 2018-09-23
	//Описание.Версия = "1.1.0.0"; 	//++ 2018-07-25
	//Описание.Версия = "1.0.9.0"; 	//++ 2018-06-13
	//Описание.Версия = "1.0.8.1"; 	//++ 2018-05-19
	//Описание.Версия = "1.0.8.0"; 	//++ 2018-04-29
	//Описание.Версия = "1.0.7.3"; 	//++ 2018-04-07
	//Описание.Версия = "1.0.7.2"; 	//++ 2018-04-04
	//Описание.Версия = "1.0.7.1"; 	//++ 2018-04-03
	//Описание.Версия = "1.0.7.0"; 	//++ 2018-03-28
	//Описание.Версия = "1.0.6.0"; 	//++ 2018-03-06
	//Описание.Версия = "1.0.5.0"; 	//++ 2018-02-01
	//Описание.Версия = "1.0.4.0"; 	//++ 2017-12-26
	//Описание.Версия = "1.0.3.0"; 	//++ 2017-12-14
	//Описание.Версия = "1.0.2.0"; 	//++ 2017-11-29
	//Описание.Версия = "1.0.1.0"; 	//++ 2017-11-15
	//Описание.Версия = "1.0.0.0"; 	//++ 2017-11-02
	//Описание.Версия = "0.9.11.1"; 	//++ 2017-10-18
	//Описание.Версия = "0.9.11.0"; 	//++ 2017-10-10
	//Описание.Версия = "0.9.10.0"; //++ 2017-09-27
	//Описание.Версия = "0.9.9.0"; 	//++ 2017-09-19
	//Описание.Версия = "0.9.8.0"; 	//++ 2017-09-04
	//Описание.Версия = "0.9.7.0"; 	//++ 2017-08-22
	//Описание.Версия = "0.9.6.0"; 	//++ 2017-08-01
	//Описание.Версия = "0.9.5.0"; 	//++ 2017-07-24
	//Описание.Версия = "0.9.4.0"; 	//++ 2017-07-19
	//Описание.Версия = "0.9.3.0"; 	//++ 2017-07-10
	//Описание.Версия = "0.9.2.0"; 	//++ 2017-06-27
	//Описание.Версия = "0.9.1.0"; 	//++ 2017-06-21
	//Описание.Версия = "0.9.0.1"; 	//++ 2017-06-17 промежуточная техническая версия
	//Описание.Версия = "0.9.0.0"; 	//++ 2017-06-14
	//Описание.Версия = "0.8.13.0"; 	//++ 2017-06-05
	//Описание.Версия = "0.8.12.0"; 	//++ 2017-05-21
	//Описание.Версия = "0.8.11.0"; 	//++ 2017-05-15
	//Описание.Версия = "0.8.10.0"; 	//++ 2017-05-09
	//Описание.Версия = "0.8.9.0"; 	//++ 2017-05-02
	//Описание.Версия = "0.8.8.0"; 	//++ 2017-04-24
	//Описание.Версия = "0.8.7.0"; 	//++ 2017-04-17
	//Описание.Версия = "0.8.6.0"; 	//++ 2017-04-10
	//Описание.Версия = "0.8.5.0"; 	//++ 2017-03-28
	//Описание.Версия = "0.8.4.0"; 	//++ 2017-03-20
	//Описание.Версия = "0.8.3.0"; 	//++ 2017-03-13
	//Описание.Версия = "0.8.2.0"; 	//++ 2017-03-05
	//Описание.Версия = "0.8.1.1"; 	//++ 2017-02-28 //исправление ошибок
	//Описание.Версия = "0.8.1.0"; 	//++ 2017-02-26
	//Описание.Версия = "0.8.0.0"; 	//++ 2017-02-06
	//Описание.Версия = "0.7.8.0"; 	//++ 2017-01-23
	//Описание.Версия = "0.7.7.0"; 	//++ 2017-01-11
	//Описание.Версия = "0.7.6.0"; 	//++ 2016-12-22
	//Описание.Версия = "0.7.5.0"; 	//++ 2016-12-05
	//Описание.Версия = "0.7.4.3"; 	//++ 2016-11-29
	//Описание.Версия = "0.7.4.2"; 	//++ 2016-11-26 промежуточная техническая версия
	//Описание.Версия = "0.7.4.1"; 	//++ 2016-11-21
	//Описание.Версия = "0.7.4.0"; 	//++ 2016-11-16
	//Описание.Версия = "0.7.3.1"; 	//++ 2016-11-06
	//Описание.Версия = "0.7.3.0"; 	//++ 2016-11-06
	//Описание.Версия = "0.7.2.0"; 	//++ 2016-10-30
	//Описание.Версия = "0.7.1.0"; 	//++ 2016-10-26
	//Описание.Версия = "0.7.0.0"; 	//++ 2016-10-16
	//Описание.Версия = "0.6.6.2"; 	//++ 2016-10-04
	//Описание.Версия = "0.6.6.1"; 	//++ 2016-09-21
	//Описание.Версия = "0.6.6.0"; 	//++ 2016-09-12
	//Описание.Версия = "0.6.5.0"; 	//++ 2016-08-26
	//Описание.Версия = "0.6.4.1"; 	//++ 2016-08-16
	//Описание.Версия = "0.6.4.0"; 	//++ 2016-08-06
	//Описание.Версия = "0.6.3.0"; 	//++ 2016-07-31
	//Описание.Версия = "0.6.2.0"; 	//++ 2016-07-24
	//Описание.Версия = "0.6.1.0"; 	//++ 2016-07-15
	//Описание.Версия = "0.6.0.0"; 	//++ 2016-07-02
	//Описание.Версия = "0.5.13.0"; //++ 2016-06-04
	//Описание.Версия = "0.5.12.0"; //++ 2016-05-21
	//Описание.Версия = "0.5.11.0"; //++ 2016-04-24
	//Описание.Версия = "0.5.10.0"; //++ 2016-04-17
	//Описание.Версия = "0.5.9.0"; 	//++ 2016-04-09
	//Описание.Версия = "0.5.8.1"; 	//++ 2016-04-03
	//Описание.Версия = "0.5.8.0"; 	//++ 2016-03-27
	//Описание.Версия = "0.5.7.0"; 	//++ 2016-03-21
	//Описание.Версия = "0.5.6.5"; 	//++ 2016-03-17
	//Описание.Версия = "0.5.6.4"; 	//++ 2016-03-12
	//Описание.Версия = "0.5.6.3"; 	//++ 2016-03-07
	//Описание.Версия = "0.5.6.2"; 	//++ 2016-02-29
	//Описание.Версия = "0.5.6.1"; 	//++ 2016-02-19
	//Описание.Версия = "0.5.6.0"; 	//++ 2016-02-11
	//Описание.Версия = "0.5.5.3"; 	//++ 2016-01-29
	//Описание.Версия = "0.5.5.2"; 	//++ 2016-01-19
	//Описание.Версия = "0.5.5.1"; 	//++ 2016-01-14
	//Описание.Версия = "0.5.5.0"; 	//++ 2015-12-20
	//Описание.Версия = "0.5.4.0"; 	//++ 2015-12-13
	//Описание.Версия = "0.5.3.0"; 	//++ 2015-12-06
	//Описание.Версия = "0.5.2.0"; 	//++ 2015-11-17
	//Описание.Версия = "0.5.1.0"; 	//++ 2015-11-04
	//Описание.Версия = "0.5.0.0"; 	//++ 2015-10-30
	//Описание.Версия = "0.0.4.0";	//++ год-месяц-число 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - описание полей 
//                                  см. в процедуре ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.0.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_0_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//  Обработчик.Опциональный        = Истина;
// 
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	ОбщийМодуль.УстановитьЛицензионноеСоглашениеНеПринято();
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.0.4.0";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ПервыйЗапуск";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.0.4.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ЗаполнениеВидаНоменклатуры";
	Обработчик.Комментарий = НСтр("ru = 'Обновление справочника номенклатура. 
		|Начиная с версии 0.0.4.0 в справочнике номенклатура имеется реквизит ""Тип номенклатуры"" который определяет способ использования номенклатуры'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.5.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ПерепроведениеДокументовРеализации";
	Обработчик.Комментарий = НСтр("ru = 'перепроведение документов реализации. 
		|В версии 0.5.0.0 исправлена ошибка по движения документа Реализация по регистрам'");
		
		
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.5.3.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ПерепроведениеДокументовОплатаБанковскойКартой";
	Обработчик.Комментарий = НСтр("ru = 'перепроведение документов оплаты банковской картой. 
		|В версии 0.5.3.0 добавлена дополнительная аналитика по регистру РасчетыПоЭквайрингу'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.5.3.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ПерепроведениеДокументовПоступлениеНаРасчетныйСчет";
	Обработчик.Комментарий = НСтр("ru = 'перепроведение документов поступления на расчетный счет. 
		|В версии 0.5.3.0 добавлена дополнительная аналитика по регистру РасчетыПоЭквайрингу'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.5.5.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ЗаполнитьВидОперацииПриходныйКассовыйОрдер";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение вида операции документа Приходный кассовый ордер. 
		|В версии 0.5.5.2 добавлен вид операции документа Приходный кассовый ордер'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.5.10.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ПерезаполнитьДокументУстановкиЦенНоменклатуры_0_5_10";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение документов Установка цен номенклатуры (для продажи). 
		|В версии 0.5.10.0 реализована возможность в документе Установка цен номенклатуры (для продажи) устанавливать цены одновременно по нескольким видам цен'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.5.12.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ЗаполнитьИсточникЗаказовПокупателей_0_5_12";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение документов Заказ покупателя. 
		|В версии 0.5.12.0 в документ Заказ покупателя добавлен реквизит - Источник заказа'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.6.2.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ЗаполнитьВалютуВДокументеУстановкиЦен_0_6_2_0";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение документов Установка цен номенклатуры (для продажи). 
		|В версии 0.6.2.0 для возможности формировать валютные прайсы в документ Установка цен номенклатуры (для продажи) добавлен реквизит - Валюта'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.6.4.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_6_4_0";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение документов Установка цен материалов (для производства), справочника Цены услуг раскроя, перепроведение документов приходный кассовый ордер.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.6.4.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_6_4_1";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение документов Внутреннее перемещение денежных средств, перепроведение документов Поступление товаров и услуг'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.6.6.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_6_6_0";
	Обработчик.Комментарий = НСтр("ru = 'Перепроведение документов Замер и Монтаж для определения воронки по первоначальным контактам'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.6.6.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_6_6_1";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение поля Организация в документах Заказ-Договор'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.7.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_7_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение поля Комната в документах Заказ-Договор'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.7.1.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_7_1_0";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение поля ""Состояние"" в документах ""Заказ поставщику""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.7.2.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_7_2_0";
	Обработчик.Комментарий = НСтр("ru = 'Перепроведение документов ЗаказПоставщику и ПоступлениеТоваровИУслуг'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.7.4.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_7_4_0";
	Обработчик.Комментарий = НСтр("ru = 'Установка дополнительных настроек'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.7.4.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_7_4_3";
	Обработчик.Комментарий = НСтр("ru = 'Установка дополнительных настроек'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.7.5.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_7_5_0";
	Обработчик.Комментарий = НСтр("ru = 'Установка дополнительных настроек'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.7.6.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_7_6_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка документов ""Заказ-договор""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.7.7.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_7_7_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка документов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.7.8.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_7_8_0";
	Обработчик.Комментарий = НСтр("ru = 'Настройка программы'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.8.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_8_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Перепроведение документов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.8.1.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_8_1_0";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение денежных документов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.8.3.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_8_3_0";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение справочника цен услуг раскроя'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.8.4.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_8_4_0";
	Обработчик.Комментарий = НСтр("ru = 'Перепроведение документов реализации'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.8.5.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_8_5_0";
	Обработчик.Комментарий = НСтр("ru = 'Перепроведение документов по регистру взаиморасчетов в валюте'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.8.6.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_8_6_0";
	Обработчик.Комментарий = НСтр("ru = 'Перепроведение документов по регистрам контроля оплаты заказов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.8.10.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_8_10_0";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение дат в документе ""Монтаж""");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.8.12.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_8_12_0";
	Обработчик.Комментарий = НСтр("ru = 'Перепроведение документов ""Внутреннее перемещение денежных средств"" и ""Расходный кассовый ордер""");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.9.1.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_9_1_0";
	Обработчик.Комментарий = НСтр("ru = 'Перепроведение документов ""Заказ покупателя"", ""Приходный кассовый ордер"", ""Оплата банковской картой"", ""Поступление на расчетный счет""");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.9.3.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_9_3_0";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение документов ""Заказ на производство"", ""Выпуск продукции"", ""Заказ-договор""");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.9.5.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_9_5_0";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение документов ""Заказ на производство"" и карточек номенклатуры");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.9.6.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_9_6_0";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение документов");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.9.7.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_9_7_0";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение документов");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.9.8.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_9_8_0";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение документов");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.9.9.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_9_9_0";
	Обработчик.Комментарий = НСтр("ru = 'Перепроведение документов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.9.10.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_9_10_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.9.11.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_9_11_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "0.9.11.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_0_9_11_1";
	Обработчик.Комментарий = НСтр("ru = 'Обновление данных в регистрах'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.0.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_0_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.0.1.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_0_1_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.0.2.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_0_2_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.0.3.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_0_3_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.0.4.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_0_4_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.0.5.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_0_5_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.0.6.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_0_6_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.0.7.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_0_7_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.0.8.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_0_8_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.0.9.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_0_9_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.1.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_1_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.1.1.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_1_1_1_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.0.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_0_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.0.1.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_0_1_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.0.2.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_0_2_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.0.3.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_0_3_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.4.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_4_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.4.2.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_4_2_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.4.3.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_4_3_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.4.5.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_4_5_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.4.11.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_4_11_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.4.12.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_4_12_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.5.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_5_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.5.2.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_5_2_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.5.3.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_5_3_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.5.4.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_5_4_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.5.6.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_5_6_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.5.7.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_5_7_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.5.9.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_5_9_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.5.11.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_5_11_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.5.12.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_5_12_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.6.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_6_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.6.2.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_6_2_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.6.3.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_6_3_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.6.5.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_6_5_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.6.6.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_6_6_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.6.9.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_6_9_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.6.10.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_6_10_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.6.15.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_6_15_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.6.18.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_6_18_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.6.20.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_6_20_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.2.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_2_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.5.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_5_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.17.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_17_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.19.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_19_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.21.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_21_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.22.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_22_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.23.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_23_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.24.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_24_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.25.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_25_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.27.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_27_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.29.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_29_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.31.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_31_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.32.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_32_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.35.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_35_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.7.37.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_7_37_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.5.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_5_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.7.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_7_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.8.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_8_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.9.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_9_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.12.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_12_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.15.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_15_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.19.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_19_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.20.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_20_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.21.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_21_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.22.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_22_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.25.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_25_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.28.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_28_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.29.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_29_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.30.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_30_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.31.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_31_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.33.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_33_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.34.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_34_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.35.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_35_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.36.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_36_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "2.8.37.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_2_8_37_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.1.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_1_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.2.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_2_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.3.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_3_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.5.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_5_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.6.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_6_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.7.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_7_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.8.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_8_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.9.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_9_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.10.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_10_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.11.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_11_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.12.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_12_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.13.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_13_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.14.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_14_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.15.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_15_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.16.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_16_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.18.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_18_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.19.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_19_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.20.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_20_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.23.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_23_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.25.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_25_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.0.100.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_0_100_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_0_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.1.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_1_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.2.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_2_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.3.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_3_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.4.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_4_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.5.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_5_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.6.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_6_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.8.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_8_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.9.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_9_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.10.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_10_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.12.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_12_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.13.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_13_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.17.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_17_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "3.1.18.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПотолки.ОбработкаОбновления_3_1_18_0";
	Обработчик.Комментарий = НСтр("ru = 'Обработка данных'");
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	//ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	//ПараметрыНабора.Используется = Истина;
	//УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Номенклатура", ПараметрыНабора);
	//
	//ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	//ПараметрыНабора.Используется = Истина;
	//УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Номенклатура_Общие", ПараметрыНабора);
	//
	//ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	//ПараметрыНабора.Используется = Истина;
	//УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Контрагенты", ПараметрыНабора);
	//
	//ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	//ПараметрыНабора.Используется = Истина;
	//УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Контрагенты_Общие", ПараметрыНабора);
	//
	//ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	//ПараметрыНабора.Используется = Истина;
	//УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_Монтаж", ПараметрыНабора);
	//
	//ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	//ПараметрыНабора.Используется = Истина;
	//УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_Лид", ПараметрыНабора);
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - (возвращаемое значение) если установить Истина,
//                                то будет выведена форма с описанием обновлений. По умолчанию, Истина.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример обхода выполненных обработчиков обновления:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
	   //запишем дату установки версии в БД
	ЗаписатьИсториюВерсий(ТекущаяВерсия);
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	
	
КонецПроцедуры // ПриДобавленииОбработчиковПереходаСДругойПрограммы()

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// Обработчики первого запуска (УНФ)

// Процедура заполняет пустую ИБ.
//
Процедура ПервыйЗапуск() Экспорт
	
	//здесь описываем первоначальные настройки конфигурации при первом запуске
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = Истина;
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Номенклатура", ПараметрыНабора);
	
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = Истина;
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Контрагенты", ПараметрыНабора);
	
	
	//создадим службеного пользователя для установки обновлений
	// #7604 закомментировано
	//ИмяПользователя = "УстановкаОбновлений";
	//Пароль = "7845";
	//
	//ИскомыйПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	//Если НЕ ИскомыйПОльзователь = Неопределено Тогда
	//	ИскомыйПОльзователь.Пароль = Пароль;
	//	Если НЕ ИскомыйПОльзователь.Роли.Содержит(Метаданные.Роли.Найти("АдминистраторСистемы")) Тогда
	//		ИскомыйПОльзователь.Роли.Добавить(Метаданные.Роли.Найти("АдминистраторСистемы"));
	//	КонецЕсли;
	//	ИскомыйПОльзователь.Записать();
	//Иначе
	//	Пользователи.СоздатьПользователя(ИмяПользователя, Ложь);
	//	НовыйАдминистратор = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	//	Если НЕ НовыйАдминистратор = Неопределено Тогда
	//		НовыйАдминистратор.Пароль = Пароль;
	//		НовыйАдминистратор.Записать();
	//	КонецЕсли;
	//КонецЕсли;
	
	//создадим пользователя Администратор
	//++ №8209 переименовываем пользователя Администратор
	//ИскомыйПОльзователь = ПользователиИнформационнойБазы.НайтиПоИмени("Администратор");
	ИскомыйПОльзователь = ПользователиИнформационнойБазы.НайтиПоИмени("Support");
	//-- №8209
	Если ИскомыйПОльзователь = Неопределено Тогда
		Пользователи.СоздатьАдминистратора(Неопределено);
		//++ №8209 переименовываем пользователя Администратор
		//НовыйАдминистратор = ПользователиИнформационнойБазы.НайтиПоИмени("Администратор");
		НовыйАдминистратор = ПользователиИнформационнойБазы.НайтиПоИмени("Support");
		//-- №8209
		Если НЕ НовыйАдминистратор = Неопределено Тогда
			//++ №8209 устанавливаем полное имя и убираем из списка выбора
			НовыйАдминистратор.ПолноеИмя = "Служба поддержки SmartCeilings";
			НовыйАдминистратор.ПоказыватьВСпискеВыбора = Ложь;
			//-- №8209
			Если НЕ НовыйАдминистратор.Роли.Содержит(Метаданные.Роли.АдминистраторСистемы) Тогда
				НовыйАдминистратор.Роли.Добавить(Метаданные.Роли.АдминистраторСистемы);
			КонецЕсли;
			НовыйАдминистратор.Записать();
		КонецЕсли;
	КонецЕсли;
	
	// Контактная информация
	КонтактнаяИнформацияПотолки.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации();
	
КонецПроцедуры // ПервыйЗапуск()


/////////////////////////////////////////////////////////////////////////////////
// Обработчики при обновлении

Процедура ПоместитьВРегистрКОбработке(ВерсияПрограммы, ОбъектСсылка, ОбъектДата, ОписаниеОшибки = "", Порядок = 999) Экспорт
	
	ВерсияПрограммыЧисло = ОбщийМодульСервер.ПолучитьНомерВерсииЧислом(ВерсияПрограммы, Порядок); // №13455
	
	НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы);
	НаборЗаписей.Отбор.ВерсияПрограммыЧисло.Установить(ВерсияПрограммыЧисло);
	НаборЗаписей.Отбор.Документ.Установить(ОбъектСсылка);
	
	НоваяЗапись 						= НаборЗаписей.Добавить(); 
	НоваяЗапись.ВерсияПрограммы 		= ВерсияПрограммы;
	НоваяЗапись.ВерсияПрограммыЧисло 	= ВерсияПрограммыЧисло;
	НоваяЗапись.Документ 				= ОбъектСсылка;
	НоваяЗапись.ДокументДата 			= ОбъектДата;
	НоваяЗапись.РезультатОбработки 		= ОписаниеОшибки;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, ОбъектСсылка, ОбъектДата, ОписаниеОшибки = "", Порядок = 999) Экспорт
	
	ВерсияПрограммыЧисло = ОбщийМодульСервер.ПолучитьНомерВерсииЧислом(ВерсияПрограммы, Порядок); // №13455
	
	НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияОбязательные.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы);
	НаборЗаписей.Отбор.ВерсияПрограммыЧисло.Установить(ВерсияПрограммыЧисло);
	НаборЗаписей.Отбор.ОбъектСсылка.Установить(ОбъектСсылка);
	
	НоваяЗапись 						= НаборЗаписей.Добавить(); 
	НоваяЗапись.ВерсияПрограммы 		= ВерсияПрограммы; 
	НоваяЗапись.ВерсияПрограммыЧисло 	= ВерсияПрограммыЧисло;
	НоваяЗапись.ОбъектСсылка 			= ОбъектСсылка; 
	НоваяЗапись.ОбъектДата 				= ОбъектДата;
	НоваяЗапись.РезультатОбработки 		= ОписаниеОшибки; // №13380
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#Область Обновление_0_0_4_0

Процедура ЗаполнениеВидаНоменклатуры() Экспорт
	
	НачатьТранзакцию();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.УдалитьЭтоУслуга
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = Ложь";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоменклатураОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если НоменклатураОбъект.УдалитьЭтоУслуга Тогда
			НоменклатураОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга;
		Иначе
			НоменклатураОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал;
		КонецЕсли;
		НоменклатураОбъект.Записать();
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_5_0_0

Процедура ПерепроведениеДокументовРеализации() Экспорт
	
	НачатьТранзакцию();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Проведен = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_5_3_0

Процедура ПерепроведениеДокументовОплатаБанковскойКартой() Экспорт
	
	НачатьТранзакцию();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаБанковскойКартой.Ссылка
	|ИЗ
	|	Документ.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой
	|ГДЕ
	|	ОплатаБанковскойКартой.Проведен = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура ПерепроведениеДокументовПоступлениеНаРасчетныйСчет() Экспорт
	
	НачатьТранзакцию();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры


#КонецОбласти


#Область Обновление_0_5_5_2

Процедура ЗаполнитьВидОперацииПриходныйКассовыйОрдер() Экспорт
	
	НачатьТранзакцию();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Проведен = Истина
	|	И ПриходныйКассовыйОрдер.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_5_10_0

Процедура ПерезаполнитьДокументУстановкиЦенНоменклатуры_0_5_10() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенНоменклатуры.Ссылка,
	|	УстановкаЦенНоменклатуры.Проведен
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если ДокументОбъект.ВидыЦен.Количество() = 0 Тогда
			НоваяСтрокаВидЦен = ДокументОбъект.ВидыЦен.Добавить();
			НоваяСтрокаВидЦен.ВидЦены = ДокументОбъект.УдалитьВидЦены;
		КонецЕсли;
		
		Для Каждого СтрокаДокумента Из ДокументОбъект.Товары Цикл
			Если СтрокаДокумента.ВидЦены.Пустая() Тогда
				СтрокаДокумента.ВидЦены = ДокументОбъект.УдалитьВидЦены;
			КонецЕсли;
		КонецЦикла;
		
		Если Выборка.Проведен Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_5_12_0

Процедура ЗаполнитьИсточникЗаказовПокупателей_0_5_12() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен = ИСТИНА
	|	И ЗаказПокупателя.ИсточникЗаказа = &ИсточникЗаказа";
	Запрос.УстановитьПараметр("ИсточникЗаказа",Перечисления.ИсточникиЗаказовПокупателей.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ИсточникЗаказа = Перечисления.ИсточникиЗаказовПокупателей.Терминал;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_6_2_0

Процедура ЗаполнитьВалютуВДокументеУстановкиЦен_0_6_2_0() Экспорт
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенНоменклатуры.Ссылка
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|ГДЕ
	|	УстановкаЦенНоменклатуры.Валюта = &Валюта
	|	И УстановкаЦенНоменклатуры.Проведен";
	Запрос.УстановитьПараметр("Валюта",Справочники.Валюты.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Валюта = ВалютаУчета;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_6_4_0

Процедура ОбработкаОбновления_0_6_4_0() Экспорт
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенМатериалов.Ссылка
	|ИЗ
	|	Документ.УстановкаЦенМатериалов КАК УстановкаЦенМатериалов
	|ГДЕ
	|	УстановкаЦенМатериалов.Валюта = &Валюта
	|	И УстановкаЦенМатериалов.Проведен";
	Запрос.УстановитьПараметр("Валюта",Справочники.Валюты.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Валюта = ВалютаУчета;
		ДокументОбъект.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныУслугРаскроя.Ссылка
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя КАК ЦеныУслугРаскроя
	|ГДЕ
	|	НЕ ЦеныУслугРаскроя.ПометкаУдаления
	|	И ЦеныУслугРаскроя.Валюта = &Валюта";
	Запрос.УстановитьПараметр("Валюта",Справочники.Валюты.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЭлементОбъект.Валюта = ВалютаУчета;
		ЭлементОбъект.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Записать();
	КонецЦикла;
	
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_6_4_1

Процедура ОбработкаОбновления_0_6_4_1() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутреннееПеремещениеДенежныхСредств.Ссылка
	|ИЗ
	|	Документ.ВнутреннееПеремещениеДенежныхСредств КАК ВнутреннееПеремещениеДенежныхСредств
	|ГДЕ
	|	ВнутреннееПеремещениеДенежныхСредств.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ВалютаПолучатель = ДокОбъект.Валюта;
		ДокОбъект.СуммаПолучатель = ДокОбъект.Сумма;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИУслуг.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
	|ГДЕ
	|	ПоступлениеТоваровИУслуг.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_6_6_0

Процедура ОбработкаОбновления_0_6_6_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Замер.Ссылка
	|ИЗ
	|	Документ.УДАЛИТЬ_Замер КАК Замер
	|ГДЕ
	|	Замер.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести " + Выборка.Ссылка + ". " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Монтаж.Ссылка
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести " + Выборка.Ссылка + ". " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_6_6_1

Процедура ОбработкаОбновления_0_6_6_1() Экспорт
	
	Организация = Справочники.Организации.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организации.Код УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Организация = Выборка.Ссылка;
	КонецЦикла;
	
	Если НЕ Организация.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказДоговор.Ссылка
		|ИЗ
		|	Документ.ЗаказДоговор КАК ЗаказДоговор
		|ГДЕ
		|	ЗаказДоговор.Проведен";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Ссылка.Организация.Пустая() Тогда
				ДокОбъект = Выборка.ССылка.ПолучитьОбъект();
				ДокОбъект.Организация = Организация;
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_7_0_0

Процедура ОбработкаОбновления_0_7_0_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказДоговор.Ссылка
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	ЗаказДоговор.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Проводить = Ложь;
		Для Каждого ТекущаяСтрока Из ДокОбъект.ТоварыУслуги Цикл
			Если ПустаяСтрока(ТекущаяСтрока.Комната) Тогда
				ТекущаяСтрока.Комната = "Комната 1";
				Проводить = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Проводить Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_7_1_0

Процедура ОбработкаОбновления_0_7_1_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.ТекущийСтатус = &ТекущийСтатус";
	Запрос.УстановитьПараметр("ТекущийСтатус",Справочники.СтатусыЗаказовПоставщику.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ТекущийСтатус = Справочники.СтатусыЗаказовПоставщику.ВРаботе;
		ДокОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_7_2_0

Процедура ОбработкаОбновления_0_7_2_0() Экспорт
	
	//очищаем РС УДАЛИТЬ_СостоянияЗаказовПоставщику
	МенеджерЗаписей = РегистрыСведений.УДАЛИТЬ_СостоянияЗаказовПоставщику.СоздатьМенеджерЗаписи();
	МенеджерЗаписей.Прочитать();
	МенеджерЗаписей.Удалить();
	
	//перепроводим ЗаказПоставщику
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	//перепроводим ПоступлениеТоваровИУслуг
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИУслуг.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
	|ГДЕ
	|	ПоступлениеТоваровИУслуг.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;

	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_7_4_0

Процедура ОбработкаОбновления_0_7_4_0() Экспорт
	
	Константы.ИспользоватьДатыЗапретаЗагрузки.Установить(Истина);
	Константы.ИспользоватьДатыЗапретаИзменения.Установить(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_7_4_3

Процедура ОбработкаОбновления_0_7_4_3() Экспорт
	
	//настройка констант
	Если Константы.ЕВостокИспользоватьОтправкуСМС.Получить() Или Константы.СМСFlyИспользоватьОтправкуСМС.Получить() Тогда
		Константы.АвтоматическаяРассылкаСМС.Установить(Истина);
	КонецЕсли;
	
	//настройка документов "Заказ покупателя"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен
	|	И ЗаказПокупателя.ТекущийСтатус = &ТекущийСтатус";
	Запрос.УстановитьПараметр("ТекущийСтатус",Справочники.СтатусыЗаказовПокупателей.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.ВРаботе;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	//настройка документов "Установка цен выработки производства"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаСтоимостиВыработкиПроизводства.Ссылка
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПроизводства КАК УстановкаСтоимостиВыработкиПроизводства
	|ГДЕ
	|	УстановкаСтоимостиВыработкиПроизводства.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Изменен = Ложь;
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого ТекущаяСтрока Из ДокОбъект.СтоимостьВыработки Цикл
			Если ТекущаяСтрока.ЕдиницаИзмерения = Неопределено Тогда
				Изменен = Истина;
				ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
			КонецЕсли;
		КонецЦикла;
		Если Изменен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_7_5_0

Процедура ОбработкаОбновления_0_7_5_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенМатериалов.Ссылка
	|ИЗ
	|	Документ.УстановкаЦенМатериалов КАК УстановкаЦенМатериалов
	|ГДЕ
	|	УстановкаЦенМатериалов.Проведен
	|	И УстановкаЦенМатериалов.ВидНоменклатуры = &ВидНоменклатуры";
	Запрос.УстановитьПараметр("ВидНоменклатуры",Справочники.ВидыНоменклатуры.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаСтоимостиВыработкиПроизводства.Ссылка
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПроизводства КАК УстановкаСтоимостиВыработкиПроизводства
	|ГДЕ
	|	УстановкаСтоимостиВыработкиПроизводства.Проведен
	|	И УстановкаСтоимостиВыработкиПроизводства.ВидНоменклатурыПотолка = &ВидНоменклатуры";
	Запрос.УстановитьПараметр("ВидНоменклатуры",Справочники.ВидыНоменклатуры.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ВидНоменклатурыПотолка = Справочники.ВидыНоменклатуры.Потолок;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	

	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_7_6_0

Процедура ОбработкаОбновления_0_7_6_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказДоговор.Ссылка
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.ВРаботе;
		НаименованиеКомнаты = "Общее";
		Если ДокОбъект.ТоварыУслуги.Количество() > 0 Тогда
			НаименованиеКомнаты = ДокОбъект.ТоварыУслуги[0].Комната;
		КонецЕсли;
		Для Каждого ТекущаяСтрока Из ДокОбъект.Материалы Цикл
			ТекущаяСтрока.Комната = НаименованиеКомнаты;
		КонецЦикла;
		ДокОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_7_7_0

Процедура ОбработкаОбновления_0_7_7_0() Экспорт
	
	//заполнение валюты в документах "УсановкаЦенПоставщика"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенПоставщика.Ссылка
	|ИЗ
	|	Документ.УстановкаЦенПоставщика КАК УстановкаЦенПоставщика
	|ГДЕ
	|	УстановкаЦенПоставщика.Валюта = &Валюта";
	Запрос.УстановитьПараметр("Валюта",Справочники.Валюты.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.Валюта = ВалютаУчета;
		ДокОбъект.Записать();
	КонецЦикла;
	
	//заполняем розничную организацию пользователей
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ОрганизацияРозницы = &ОрганизацияРозницы";
	Запрос.УстановитьПараметр("ОрганизацияРозницы",Справочники.Организации.ПустаяСсылка());
	
	ОрганизацияРозницы = Константы.УДАЛИТЬ_ОрганизацияРозничныеПродажи.Получить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ОрганизацияРозницы = ОрганизацияРозницы;
		ДокОбъект.Записать();
	КонецЦикла;
	
	//настраиваем документы "Возврат продукции"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратПродукции.Ссылка
	|ИЗ
	|	Документ.ВозвратПродукции КАК ВозвратПродукции
	|ГДЕ
	|	ВозвратПродукции.БракПроизводства";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.УменьшитьДолгКонтрагента = ДокОбъект.БракПроизводства;
		ДокОбъект.Записать();
	КонецЦикла;

	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_7_8_0

Процедура ОбработкаОбновления_0_7_8_0() Экспорт
	
	СпрОбъект = Справочники.ВидыФайловПрограммыПостроителя.ЧертежПокупатель.ПолучитьОбъект();
	СпрОбъект.Загружать = Истина;
	СпрОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_8_0_0

Процедура ОбработкаОбновления_0_8_0_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказДоговор.Ссылка
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	ЗаказДоговор.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Монтаж.Ссылка
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИУслуг.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
	|ГДЕ
	|	ПоступлениеТоваровИУслуг.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_8_1_0

Процедура ОбработкаОбновления_0_8_1_0() Экспорт
	
	//поступление на расчетный счет
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка,
	|	ПоступлениеНаРасчетныйСчет.Проведен
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.ССылка.ПолучитьОбъект();
		ДокументОбъект.РаспределениеПлатежа.Очистить();
		Если НЕ ДокументОбъект.УДАЛИТЬЗаказДоговор = Неопределено Тогда
			Если НЕ ДокументОбъект.УДАЛИТЬЗаказДоговор.Пустая() Тогда
				НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
				НоваяСтрока.Документ = ДокументОбъект.УДАЛИТЬЗаказДоговор;
				НоваяСтрока.Сумма = ДокументОбъект.Сумма;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ДокументОбъект.УДАЛИТЬСчетНаОплату = Неопределено Тогда
			Если НЕ ДокументОбъект.УДАЛИТЬСчетНаОплату.Пустая() Тогда
				НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
				НоваяСтрока.Документ = ДокументОбъект.УДАЛИТЬСчетНаОплату;
				НоваяСтрока.Сумма = ДокументОбъект.Сумма;
			КонецЕсли;
		КонецЕсли;
		Для Каждого ТекущаяСтрока Из ДокументОбъект.УДАЛИТЬЗаказыНаПроизводство Цикл
			НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ТекущаяСтрока.Документ;
			НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
		КонецЦикла;
		ДокументОбъект.РаспределениеПлатежа.Свернуть("Документ,Сумма");
		
		Если Выборка.Проведен Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокументОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	//оплата наличными
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ПриходныйКассовыйОрдер.Проведен
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.ССылка.ПолучитьОбъект();
		ДокументОбъект.РаспределениеПлатежа.Очистить();
		Если НЕ ДокументОбъект.УДАЛИТЬЗаказДоговор = Неопределено Тогда
			Если НЕ ДокументОбъект.УДАЛИТЬЗаказДоговор.Пустая() Тогда
				НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
				НоваяСтрока.Документ = ДокументОбъект.УДАЛИТЬЗаказДоговор;
				НоваяСтрока.Сумма = ДокументОбъект.Сумма;
				Если НЕ ДокументОбъект.УДАЛИТЬДатаПлатежаПоРассрочке = Дата(1,1,1) Тогда
					НоваяСтрока.ДатаПлатежаПоРассрочке = ДокументОбъект.УДАЛИТЬДатаПлатежаПоРассрочке;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ДокументОбъект.УДАЛИТЬСчетНаОплату = Неопределено Тогда
			Если НЕ ДокументОбъект.УДАЛИТЬСчетНаОплату.Пустая() Тогда
				НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
				НоваяСтрока.Документ = ДокументОбъект.УДАЛИТЬСчетНаОплату;
				НоваяСтрока.Сумма = ДокументОбъект.Сумма;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ДокументОбъект.Основание = Неопределено Тогда
			Если НЕ ДокументОбъект.Основание.Пустая() Тогда
				НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
				НоваяСтрока.Документ = ДокументОбъект.Основание;
				НоваяСтрока.Сумма = ДокументОбъект.Сумма;
			КонецЕсли;
		КонецЕсли;
		ДокументОбъект.РаспределениеПлатежа.Свернуть("Документ,Сумма,ДатаПлатежаПоРассрочке");
		
		
		Если Выборка.Проведен Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокументОбъект.Записать();
		КонецЕсли;
	КонецЦикла;

	
	//оплата банковской картой
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаБанковскойКартой.Ссылка,
	|	ОплатаБанковскойКартой.Проведен
	|ИЗ
	|	Документ.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.ССылка.ПолучитьОбъект();
		ДокументОбъект.РаспределениеПлатежа.Очистить();
		Если ТипЗнч(ДокументОбъект.Договор) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Если НЕ ДокументОбъект.Договор.Пустая() Тогда
				НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
				НоваяСтрока.Документ = ДокументОбъект.Договор;
				НоваяСтрока.Сумма = ДокументОбъект.Сумма;
				Если НЕ ДокументОбъект.УДАЛИТЬДатаПлатежаПоРассрочке = Дата(1,1,1) Тогда
					НоваяСтрока.ДатаПлатежаПоРассрочке = ДокументОбъект.УДАЛИТЬДатаПлатежаПоРассрочке;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ДокументОбъект.УДАЛИТЬСчетНаОплату = Неопределено Тогда
			Если НЕ ДокументОбъект.УДАЛИТЬСчетНаОплату.Пустая() Тогда
				НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
				НоваяСтрока.Документ = ДокументОбъект.УДАЛИТЬСчетНаОплату;
				НоваяСтрока.Сумма = ДокументОбъект.Сумма;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ДокументОбъект.Основание = Неопределено Тогда
			Если НЕ ДокументОбъект.Основание.Пустая() Тогда
				НоваяСтрока = ДокументОбъект.РаспределениеПлатежа.Добавить();
				НоваяСтрока.Документ = ДокументОбъект.Основание;
				НоваяСтрока.Сумма = ДокументОбъект.Сумма;
			КонецЕсли;
		КонецЕсли;
		ДокументОбъект.РаспределениеПлатежа.Свернуть("Документ,Сумма,ДатаПлатежаПоРассрочке");
		
		
		Если Выборка.Проведен Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокументОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_8_3_0

Процедура ОбработкаОбновления_0_8_3_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныУслугРаскроя.Ссылка
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя КАК ЦеныУслугРаскроя";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.ДлинаШвовМногофактурный.Количество() = 0 Тогда
			ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого ТекущаяСтрока Из ЭлементОбъект.ДлинаШвов Цикл
				НоваяСтрока = ЭлементОбъект.ДлинаШвовМногофактурный.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			КонецЦикла;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
				
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_8_4_0

Процедура ОбработкаОбновления_0_8_4_0() Экспорт
	
	ВидНоменклатуры = Новый СписокЗначений;
	ВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Услуга);
	//ВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.УслугаРаскрояКривых);
	//ВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.УслугаРаскрояУглов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.Номенклатура.ВидНоменклатуры В(&ВидНоменклатуры)
	|	И ПродажиОбороты.Подразделение = &ПустоеПодразделение
	|	И ПродажиОбороты.Регистратор.Подразделение <> &ПустоеПодразделение";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	Запрос.УстановитьПараметр("ПустоеПодразделение",Справочники.Подразделения.ПустаяСсылка());
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	ТаблицаДокументов.Свернуть("Регистратор",);
	Для Каждого ТекущаяСтрока Из ТаблицаДокументов Цикл
		Попытка
			ДокОбъект = ТекущаяСтрока.Регистратор.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки
	КонецЦикла;
				
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_8_5_0

Процедура ОбработкаОбновления_0_8_5_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПродажиОбороты.Регистратор.Дата";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокОбъект = Выборка.Регистратор.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки
	КонецЦикла;
				
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_8_6_0

Процедура ОбработкаОбновления_0_8_6_0() Экспорт
	
	//перепроводим все выполненные монтажи
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Монтаж.Ссылка
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Результат = &Результат
	|	И Монтаж.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Монтаж.Дата";
	Запрос.УстановитьПараметр("Результат",Справочники.РезультатыМонтажа.Выполнен);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки
	КонецЦикла;
	
	//перепроводим все документы, что должны быть регистраторами регистра "РасчетыПоЗаказам"
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетНаОплату.Ссылка,
	|	СчетНаОплату.Дата КАК Дата
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату
	|ГДЕ
	|	СчетНаОплату.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказДоговор.Ссылка,
	|	ЗаказДоговор.Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	ЗаказДоговор.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка,
	|	ЗаказНаПроизводство.Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ПриходныйКассовыйОрдер.Дата
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Ссылка,
	|	РасходныйКассовыйОрдер.Дата
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка,
	|	ПоступлениеНаРасчетныйСчет.Дата
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОплатаБанковскойКартой.Ссылка,
	|	ОплатаБанковскойКартой.Дата
	|ИЗ
	|	Документ.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой
	|ГДЕ
	|	ОплатаБанковскойКартой.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки
	КонецЦикла;

	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_8_10_0

Процедура ОбработкаОбновления_0_8_10_0() Экспорт
	
	//перепроводим все выполненные монтажи
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Монтаж.Ссылка
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.ДатаСоздания = &ПустаяДата";
	Запрос.УстановитьПараметр("ПустаяДата",Дата(1,1,1));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.ДатаСоздания = ДокОбъект.Дата;
			Если ДокОбъект.Результат = Справочники.РезультатыМонтажа.Выполнен Тогда
				ДокОбъект.Дата = ДокОбъект.УДАЛИТЬ_ДатаВыполнения;
			КонецЕсли;
			ДокОбъект.Записать();
		Исключение
		КонецПопытки
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_8_12_0

Процедура ОбработкаОбновления_0_8_12_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать();
		Исключение
		КонецПопытки
	КонецЦикла;
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутреннееПеремещениеДенежныхСредств.Ссылка
	|ИЗ
	|	Документ.ВнутреннееПеремещениеДенежныхСредств КАК ВнутреннееПеремещениеДенежныхСредств
	|ГДЕ
	|	ВнутреннееПеремещениеДенежныхСредств.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать();
		Исключение
		КонецПопытки
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_9_1_0

Процедура ОбработкаОбновления_0_9_1_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать();
		Исключение
		КонецПопытки
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать();
		Исключение
		КонецПопытки
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаБанковскойКартой.Ссылка
	|ИЗ
	|	Документ.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой
	|ГДЕ
	|	ОплатаБанковскойКартой.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать();
		Исключение
		КонецПопытки
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать();
		Исключение
		КонецПопытки
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_9_3_0

Процедура ОбработкаОбновления_0_9_3_0() Экспорт
	
	ВремВалюта = Константы.ВалютаУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка,
	|	ЗаказНаПроизводство.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка,
	|	ВыпускПродукции.Дата
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказДоговор.Ссылка,
	|	ЗаказДоговор.Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.ССылка) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
			Если Выборка.ССылка.ВидЗаказа.Пустая() Тогда
				ДокОбъект = Выборка.ССылка.ПолучитьОбъект();
				Если ДокОбъект.ЗаказНаПродажу Тогда
					ДокОбъект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ЗаказНаПродажу;
				Иначе
					ДокОбъект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка;
				КонецЕсли;
				Попытка
					ДокОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Выборка.ССылка) = Тип("ДокументСсылка.ВыпускПродукции") Тогда
			Если Выборка.ССылка.Проведен Тогда
				ДокОбъект = Выборка.ССылка.ПолучитьОбъект();
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Выборка.ССылка) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Если Выборка.ССылка.СуммаДокументаПоПрайсу = 0 Тогда
				ДокОбъект = Выборка.ССылка.ПолучитьОбъект();
				Для Каждого ТекущаяСтрока Из ДокОбъект.ТоварыУслуги Цикл
					ТекущаяСтрока.ЦенаПоПрайсу = ЦеныКомпании.ПолучитьЦенуНоменклатуры(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения, ТекущаяСтрока.Количество,
																					   ДокОбъект.Дата, ДокОбъект.ВидЦен, ДокОбъект.Валюта);
					ТекущаяСтрока.СуммаПоПрайсу = ТекущаяСтрока.ЦенаПоПрайсу * ТекущаяСтрока.Количество;
				КонецЦикла;
				ДокОбъект.СуммаДокументаПоПрайсу = ДокОбъект.ТоварыУслуги.Итог("СуммаПоПрайсу");
				Попытка
					ДокОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_9_5_0

Процедура ОбработкаОбновления_0_9_5_0() Экспорт
	
	ВремВалюта = Константы.ВалютаУчета.Получить();
	
	//заказ на производство
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка,
	|	NULL КАК Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	НЕ ЗаказНаПроизводство.УДАЛИТЬ_ПродукцияФактура = &УДАЛИТЬ_ПродукцияФактура";
	Запрос.УстановитьПараметр("УДАЛИТЬ_ПродукцияФактура",Справочники.Фактура.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
	
		ТаблицаФактур = Новый ТаблицаЗначений;
		ТаблицаФактур = ДокОбъект.ФактураПотолка.Выгрузить();
		
		ДокОбъект.ФактураПотолка.Очистить();
		
		НоваяСтрока = ДокОбъект.ФактураПотолка.Добавить();
		НоваяСтрока.Основная = Истина;
		НоваяСтрока.ПродукцияФактура = ДокОбъект.УДАЛИТЬ_ПродукцияФактура;
		НоваяСтрока.ПродукцияЦвет = ДокОбъект.УДАЛИТЬ_ПродукцияЦвет;
		НоваяСтрока.ПродукцияКоличество = ДокОбъект.УДАЛИТЬ_ПродукцияКоличество;
		
		Для Каждого ТекущаяСтрока Из ТаблицаФактур Цикл
			НоваяСтрока = ДокОбъект.ФактураПотолка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		
		ДокОбъект.УДАЛИТЬ_ПродукцияКоличество = 0;
		ДокОбъект.УДАЛИТЬ_ПродукцияФактура = Справочники.Фактура.ПустаяСсылка();
		ДокОбъект.УДАЛИТЬ_ПродукцияЦвет = Справочники.ЦветФактуры.ПустаяСсылка();
		
		Попытка
			ДокОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	//номенклатура
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.УДАЛИТЬ_Фактура = &УДАЛИТЬ_Фактура";
	Запрос.УстановитьПараметр("УДАЛИТЬ_Фактура",Справочники.Фактура.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ТаблицаФактур = Новый ТаблицаЗначений;
		ТаблицаФактур = ДокОбъект.Потолок_Фактура.Выгрузить();
		
		ДокОбъект.Потолок_Фактура.Очистить();
		
		НоваяСтрока = ДокОбъект.Потолок_Фактура.Добавить();
		НоваяСтрока.Основная = Истина;
		НоваяСтрока.ПродукцияФактура = ДокОбъект.УДАЛИТЬ_Фактура;
		НоваяСтрока.ПродукцияЦвет = ДокОбъект.УДАЛИТЬ_ЦветФактуры;
		НоваяСтрока.ПродукцияКоличество = ДокОбъект.Потолок_КоличествоРасход;
		
		Для Каждого ТекущаяСтрока Из ТаблицаФактур Цикл
			НоваяСтрока = ДокОбъект.Потолок_Фактура.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		
		ДокОбъект.УДАЛИТЬ_Фактура = Справочники.Фактура.ПустаяСсылка();
		ДокОбъект.УДАЛИТЬ_ЦветФактуры = Справочники.ЦветФактуры.ПустаяСсылка();
		
		Попытка
			ДокОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_9_6_0

Процедура ОбработкаОбновления_0_9_6_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОплатаБанковскойКартой.Ссылка
	|ИЗ
	|	Документ.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой
	|ГДЕ
	|	ОплатаБанковскойКартой.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗапросДвижения = Новый Запрос;
		ЗапросДвижения.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоЗаказамОбороты.Заказ КАК Документ,
		|	РасчетыПоЗаказамОбороты.СуммаРасход КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыПоЗаказам.Обороты(, , Регистратор, ) КАК РасчетыПоЗаказамОбороты
		|ГДЕ
		|	РасчетыПоЗаказамОбороты.Регистратор = &Регистратор
		|	И РасчетыПоЗаказамОбороты.СуммаРасход > 0";
		ЗапросДвижения.УстановитьПараметр("Регистратор",Выборка.Ссылка);
		ТаблицаДвижения = ЗапросДвижения.Выполнить().Выгрузить();
		ТаблицаДвижения.Колонки.Добавить("ДатаПлатежаПоРассрочке", Новый ОписаниеТипов);
		
		Если НЕ ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
			Для Каждого СтрокаДокумента Из Выборка.Ссылка.РаспределениеПлатежа Цикл
				Если НЕ СтрокаДокумента.ДатаПлатежаПоРассрочке = Дата(1,1,1) Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("Документ",СтрокаДокумента.Документ);
					НайденныеСтроки = ТаблицаДвижения.НайтиСтроки(Отбор);
					Если НайденныеСтроки.Количество() > 0 Тогда
						НайденныеСтроки[0].ДатаПлатежаПоРассрочке = СтрокаДокумента.ДатаПлатежаПоРассрочке;
					Иначе
						НоваяСтрока = ТаблицаДвижения.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.РаспределениеПлатежа.Очистить();
		Для Каждого СтрокаДвижения Из ТаблицаДвижения Цикл
			НоваяСтрока = ДокОбъект.РаспределениеПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДвижения);
		КонецЦикла;
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	//=========================================================
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка,
	|	УчетныеЗаписиЭлектроннойПочты.УДАЛИТЬ_НаименованиеПоля_ИмяКлиента,
	|	УчетныеЗаписиЭлектроннойПочты.УДАЛИТЬ_НаименованиеПоля_ТелефонКлиента,
	|	УчетныеЗаписиЭлектроннойПочты.УДАЛИТЬ_НаименованиеПоля_EmailКлиента,
	|	УчетныеЗаписиЭлектроннойПочты.УДАЛИТЬ_НаименованиеПоля_НазваниеАкции,
	|	УчетныеЗаписиЭлектроннойПочты.УДАЛИТЬ_НаименованиеПоля_РекламныйИсточник,
	|	УчетныеЗаписиЭлектроннойПочты.УДАЛИТЬ_ТемаПисьмаСЗаявкой,
	|	УчетныеЗаписиЭлектроннойПочты.УДАЛИТЬ_НаименованиеПоля_ID,
	|	УчетныеЗаписиЭлектроннойПочты.УДАЛИТЬ_ТекстПисьмаСЗаявкой
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ ПустаяСтрока(СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ИмяКлиента) Тогда
			НоваяСтрока = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ИмяКлиента.Добавить();
			НоваяСтрока.Текст = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ИмяКлиента;
			СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ИмяКлиента = "";
		КонецЕсли;
		//
		Если НЕ ПустаяСтрока(СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ТелефонКлиента) Тогда
			НоваяСтрока = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ТелефонКлиента.Добавить();
			НоваяСтрока.Текст = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ТелефонКлиента;
			СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ТелефонКлиента = "";
		КонецЕсли;
		//
		Если НЕ ПустаяСтрока(СпрОбъект.УДАЛИТЬ_НаименованиеПоля_EmailКлиента) Тогда
			НоваяСтрока = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_EmailКлиента.Добавить();
			НоваяСтрока.Текст = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_EmailКлиента;
			СпрОбъект.УДАЛИТЬ_НаименованиеПоля_EmailКлиента = "";
		КонецЕсли;
		//
		Если НЕ ПустаяСтрока(СпрОбъект.УДАЛИТЬ_НаименованиеПоля_НазваниеАкции) Тогда
			НоваяСтрока = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_НазваниеАкции.Добавить();
			НоваяСтрока.Текст = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_НазваниеАкции;
			СпрОбъект.УДАЛИТЬ_НаименованиеПоля_НазваниеАкции = "";
		КонецЕсли;
		//
		Если НЕ ПустаяСтрока(СпрОбъект.УДАЛИТЬ_НаименованиеПоля_РекламныйИсточник) Тогда
			НоваяСтрока = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_РекламныйИсточник.Добавить();
			НоваяСтрока.Текст = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_РекламныйИсточник;
			СпрОбъект.УДАЛИТЬ_НаименованиеПоля_РекламныйИсточник = "";
		КонецЕсли;
		//
		Если НЕ ПустаяСтрока(СпрОбъект.УДАЛИТЬ_ТемаПисьмаСЗаявкой) Тогда
			НоваяСтрока = СпрОбъект.УДАЛИТЬ_ТемаПисьмаСЗаявкой.Добавить();
			НоваяСтрока.Текст = СпрОбъект.УДАЛИТЬ_ТемаПисьмаСЗаявкой;
			СпрОбъект.УДАЛИТЬ_ТемаПисьмаСЗаявкой = "";
		КонецЕсли;
		//
		Если НЕ ПустаяСтрока(СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ID) Тогда
			НоваяСтрока = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ID.Добавить();
			НоваяСтрока.Текст = СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ID;
			СпрОбъект.УДАЛИТЬ_НаименованиеПоля_ID = "";
		КонецЕсли;
		//
		Если НЕ ПустаяСтрока(СпрОбъект.УДАЛИТЬ_ТекстПисьмаСЗаявкой) Тогда
			НоваяСтрока = СпрОбъект.УДАЛИТЬ_ТекстПисьмаСЗаявкой.Добавить();
			НоваяСтрока.Текст = СпрОбъект.УДАЛИТЬ_ТекстПисьмаСЗаявкой;
			СпрОбъект.УДАЛИТЬ_ТекстПисьмаСЗаявкой = "";
		КонецЕсли;
		
		Попытка
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	//================================================
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка,
	|	ВыпускПродукции.Дата КАК Дата
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_9_7_0

Процедура ОбработкаОбновления_0_9_7_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Невыходы.Ссылка
	|ИЗ
	|	Документ.УДАЛИТЬ_Невыходы КАК Невыходы
	|ГДЕ
	|	Невыходы.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Док = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Док = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Ссылка
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Проведен
	|	И РасходныйКассовыйОрдер.Основание ССЫЛКА Документ.ЗаказПоставщику";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Док = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеСРасчетногоСчета.Ссылка
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|ГДЕ
	|	СписаниеСРасчетногоСчета.Проведен
	|	И СписаниеСРасчетногоСчета.Основание ССЫЛКА Документ.ЗаказПоставщику";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Док = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;



	
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_9_8_0

Процедура ОбработкаОбновления_0_9_8_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	//================================================================
	
	//Начало исключен при переходе на 2.0 - чтобы не было конфликтов, т.к. реквизит НеОбновлятьПриЗагрузкиИзПостроителя удален
	//СпрОбъект = Справочники.СтатусыЗаказовНаПроизводство.Произведен.ПолучитьОбъект();
	//СпрОбъект.НеОбновлятьПриЗагрузкиИзПостроителя = Истина;
	//Попытка
	//	СпрОбъект.Записать();
	//Исключение
	//КонецПопытки;
	//СпрОбъект = Справочники.СтатусыЗаказовНаПроизводство.Отгружен.ПолучитьОбъект();
	//СпрОбъект.НеОбновлятьПриЗагрузкиИзПостроителя = Истина;
	//Попытка
	//	СпрОбъект.Записать();
	//Исключение
	//КонецПопытки;
	//Конец исключен при переходе на 2.0
	
	//================================================================
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенМатериалов.Ссылка
	|ИЗ
	|	Документ.УстановкаЦенМатериалов КАК УстановкаЦенМатериалов";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Для Каждого ТекущаяСтрока Из ДокОбъект.Материалы Цикл
			ТекущаяСтрока.ЦенаСФотопечатью = ТекущаяСтрока.Цена;
		КонецЦикла;
		
		Попытка
			Если ДокОбъект.Проведен Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокОбъект.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	//================================================================
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Ссылка
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК УстановкаСтоимостиВыработкиПоНоменклатуре
	|ГДЕ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Основание = Выборка.Ссылка;
		
		//основание - ЗаказДоговор
		НовыйДок = Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.СоздатьДокумент();
		НовыйДок.Комментарий = "#Создан при обновлении на 0.9.8.0 копированием документа " + Основание;
		НовыйДок.Дата = Основание.Дата;
		НовыйДок.Организация = Основание.Организация;
		НовыйДок.ВнутренниеПродажи = Основание.ВнутренниеПродажи;
		НовыйДок.ВидДокументаРасчета = Основание.ВидДокументаРасчета;
		НовыйДок.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказДоговор; //!!
		НовыйДок.ВидИсполнителя = Основание.ВидИсполнителя;
		//НовыйДок.Ответственный = Основание.Ответственный;
		Для Каждого ТекущаяСтрока Из Основание.ВыработкаПоВидамНоменклатуры Цикл
			НоваяСтрока = НовыйДок.ВыработкаПоВидамНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из Основание.ВыработкаПоНоменклатуре Цикл
			НоваяСтрока = НовыйДок.ВыработкаПоВидамНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Попытка
			Если Основание.Проведен Тогда
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				НовыйДок.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		//основание - ЗаказНаПроизводство
		НовыйДок = Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.СоздатьДокумент();
		НовыйДок.Комментарий = "#Создан при обновлении на 0.9.8.0 копированием документа " + Основание;
		НовыйДок.Дата = Основание.Дата;
		НовыйДок.Организация = Основание.Организация;
		НовыйДок.ВнутренниеПродажи = Основание.ВнутренниеПродажи;
		НовыйДок.ВидДокументаРасчета = Основание.ВидДокументаРасчета;
		НовыйДок.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказНаПроизводство; //!!
		НовыйДок.ВидИсполнителя = Основание.ВидИсполнителя;
		//НовыйДок.Ответственный = Основание.Ответственный;
		Для Каждого ТекущаяСтрока Из Основание.ВыработкаПоВидамНоменклатуры Цикл
			НоваяСтрока = НовыйДок.ВыработкаПоВидамНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из Основание.ВыработкаПоНоменклатуре Цикл
			НоваяСтрока = НовыйДок.ВыработкаПоВидамНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Попытка
			Если Основание.Проведен Тогда
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				НовыйДок.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		//основание - ЗаказПокупателя
		НовыйДок = Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.СоздатьДокумент();
		НовыйДок.Комментарий = "#Создан при обновлении на 0.9.8.0 копированием документа " + Основание;
		НовыйДок.Дата = Основание.Дата;
		НовыйДок.Организация = Основание.Организация;
		НовыйДок.ВнутренниеПродажи = Основание.ВнутренниеПродажи;
		НовыйДок.ВидДокументаРасчета = Основание.ВидДокументаРасчета;
		НовыйДок.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказПокупателя; //!!
		НовыйДок.ВидИсполнителя = Основание.ВидИсполнителя;
		//НовыйДок.Ответственный = Основание.Ответственный;
		Для Каждого ТекущаяСтрока Из Основание.ВыработкаПоВидамНоменклатуры Цикл
			НоваяСтрока = НовыйДок.ВыработкаПоВидамНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из Основание.ВыработкаПоНоменклатуре Цикл
			НоваяСтрока = НовыйДок.ВыработкаПоВидамНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Попытка
			Если Основание.Проведен Тогда
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				НовыйДок.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		//основание - ЗаказПокупателя
		НовыйДок = Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.СоздатьДокумент();
		НовыйДок.Комментарий = "#Создан при обновлении на 0.9.8.0 копированием документа " + Основание;
		НовыйДок.Дата = Основание.Дата;
		НовыйДок.Организация = Основание.Организация;
		НовыйДок.ВнутренниеПродажи = Основание.ВнутренниеПродажи;
		НовыйДок.ВидДокументаРасчета = Основание.ВидДокументаРасчета;
		НовыйДок.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ПеремещениеТоваров; //!!
		НовыйДок.ВидИсполнителя = Основание.ВидИсполнителя;
		//НовыйДок.Ответственный = Основание.Ответственный;
		Для Каждого ТекущаяСтрока Из Основание.ВыработкаПоВидамНоменклатуры Цикл
			НоваяСтрока = НовыйДок.ВыработкаПоВидамНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из Основание.ВыработкаПоНоменклатуре Цикл
			НоваяСтрока = НовыйДок.ВыработкаПоВидамНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Попытка
			Если Основание.Проведен Тогда
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				НовыйДок.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		//основание - ПоступлениеТоваровИУслуг
		НовыйДок = Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.СоздатьДокумент();
		НовыйДок.Комментарий = "#Создан при обновлении на 0.9.8.0 копированием документа " + Основание;
		НовыйДок.Дата = Основание.Дата;
		НовыйДок.Организация = Основание.Организация;
		НовыйДок.ВнутренниеПродажи = Основание.ВнутренниеПродажи;
		НовыйДок.ВидДокументаРасчета = Основание.ВидДокументаРасчета;
		НовыйДок.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ПоступлениеТоваровИУслуг; //!!
		НовыйДок.ВидИсполнителя = Основание.ВидИсполнителя;
		//НовыйДок.Ответственный = Основание.Ответственный;
		Для Каждого ТекущаяСтрока Из Основание.ВыработкаПоВидамНоменклатуры Цикл
			НоваяСтрока = НовыйДок.ВыработкаПоВидамНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из Основание.ВыработкаПоНоменклатуре Цикл
			НоваяСтрока = НовыйДок.ВыработкаПоВидамНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Попытка
			Если Основание.Проведен Тогда
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				НовыйДок.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;

		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Обновление_0_9_9_0

Процедура ОбработкаОбновления_0_9_9_0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Монтаж.Ссылка
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Проведен
	|	И Монтаж.Результат = &Результат";
	Запрос.УстановитьПараметр("Результат", Справочники.РезультатыМонтажа.Выполнен);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти


#Область Обновление_0_9_10_0

Процедура ОбработкаОбновления_0_9_10_0() Экспорт
	
	// перенести все прикрепленные данные из документов "Заказ на производство" в их номенклатуру-потолок, 
	// если вид заказа - производство потолка.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК Ссылка,
	|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя,
	|	ПрикрепленныеДанные.ИмяФайла,
	|	ПрикрепленныеДанные.Период
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПрикрепленныеДанные.СсылкаНаОбъект) = ТИП(Документ.ЗаказНаПроизводство)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если НЕ Выборка.Ссылка = Неопределено и НЕ Выборка.Ссылка.Пустая() Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если ДокОбъект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка 
				И ЗначениеЗаполнено(ДокОбъект.ПродукцияНоменклатура) Тогда
				ТекЗапись = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
				ТекЗапись.ВидФайлаПрограммыПостроителя = Выборка.ВидФайлаПрограммыПостроителя;
				ТекЗапись.СсылкаНаОбъект = Выборка.Ссылка;
				ТекЗапись.ИмяФайла = Выборка.ИмяФайла;
				ТекЗапись.Период = Выборка.Период;
				ТекЗапись.Прочитать();
				
				ТекЗапись.СсылкаНаОбъект  = ДокОбъект.ПродукцияНоменклатура;
				Попытка
					ТекЗапись.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	//перепровести все расходно-кассовые ордера с видом операции "Возврат покупателю"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Ссылка
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.ВидОперации = &ВидОперации
	|	И РасходныйКассовыйОрдер.Проведен";
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_9_11_0

Процедура ОбработкаОбновления_0_9_11_0() Экспорт
	
	//перезаполняем стоимость производственных операций
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственныеОперации.Ссылка
	|ИЗ
	|	Справочник.ПроизводственныеОперации КАК ПроизводственныеОперации";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлемОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого ТекущаяСтрока Из ЭлемОбъект.УДАЛИТЬ_СписокНоменклатуры Цикл
			ТекущаяСтрока.СтоимостьВыработкиПотолок = ЭлемОбъект.УДАЛИТЬСтоимостьВыработкиПотолок;
			ТекущаяСтрока.СтоимостьВыработкиОтрез =  ЭлемОбъект.УДАЛИТЬСтоимостьВыработкиОтрез;
			ТекущаяСтрока.СтоимостьВыработкиМногофактурныйПотолок =  ЭлемОбъект.УДАЛИТЬСтоимостьВыработкиМногофактурныйПотолок;
			ТекущаяСтрока.СтоимостьВыработкиМногофактурныйОтрез =  ЭлемОбъект.УДАЛИТЬСтоимостьВыработкиМногофактурныйОтрез;
		КонецЦикла;
		Попытка
			ЭлемОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Обновление_0_9_11_0",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось сохранить элемент ""Производственные операции"" "+Выборка.Ссылка+" : " +ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	//перезаполняем настройки интеркампани
	Попытка
		Константы.УДАЛИТЬ_КонтрагентПроизводствоПотолков.Установить(Константы.УДАЛИТЬ_ОрганизацияПроизводствоПотолков.Получить().УДАЛИТЬКонтрагент);
		Константы.УДАЛИТЬ_КонтрагентРозничныеПродажи.Установить(Константы.УДАЛИТЬ_ОрганизацияРозничныеПродажи.Получить().УДАЛИТЬКонтрагент);
	Исключение
		ЗаписьЖурналаРегистрации("Обновление_0_9_11_0",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось установить в настройках программы контрагентов для организаций производящей и продающей потолки"+Выборка.Ссылка+" : " +ОписаниеОшибки());
	КонецПопытки;
	
	//перепроводим все заказы на производство, у которых основание = "Заказ покупателя"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.Проведен
	|	И ЗаказНаПроизводство.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации("Обновление_0_9_11_0",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось провести документ "+Выборка.Ссылка+" : " +ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	//перепроводим все выпуски продукции, у которых основание = "Заказ на производство", у которых основание = "Заказ покупателя"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Проведен
	|	И ВыпускПродукции.Основание.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации("Обновление_0_9_11_0",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось провести документ "+Выборка.Ссылка+" : " +ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	//переносим услуги в товары для всех документов "Заказ покупателя"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого ТекСтрока Из ДокОбъект.УДАЛИТЬ_Услуги Цикл
			НоваяСтрока = ДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
		ДокОбъект.УДАЛИТЬ_Услуги.Очистить();
		ДокОбъект.СуммаДокумента = ДокОбъект.Товары.Итог("Сумма");
		Попытка
			Если ДокОбъект.Проведен Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокОбъект.Записать();
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации("Обновление_0_9_11_0",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось перенести услуги в товары в документе "+Выборка.Ссылка+" : " +ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_0_9_11_1

Процедура ОбработкаОбновления_0_9_11_1() Экспорт
	
	ВерсияПрограммы = "0.9.11.1";
	
	// перепроводим все документы РТиУ, чтобы они записали в РасчетыПоЗаказам	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РТиУ.Ссылка,
	|	РТиУ.Дата
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РТиУ
	|ГДЕ
	|	РТиУ.Проведен";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//Попытка
		//	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ЗаписьЖурналаРегистрации("Обновление_0_9_11_1",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось провести документ "+Выборка.Ссылка+" : " +ОписаниеОшибки());
		//КонецПопытки;
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	//перепроводим все заказы на производство, созданные на основании заказа покупателя
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка,
	|	ЗаказНаПроизводство.Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.Проведен
	|	И ЗаказНаПроизводство.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//Попытка
		//	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ЗаписьЖурналаРегистрации("Обновление_0_9_11_1",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось провести документ "+Выборка.Ссылка+" : " +ОписаниеОшибки());
		//КонецПопытки;
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//перепроводим все выполненные монтажи
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Монтаж.Ссылка,
	|	Монтаж.Дата
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Проведен
	|	И Монтаж.Результат = &Результат";
	Запрос.УстановитьПараметр("Результат", Справочники.РезультатыМонтажа.Выполнен);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//Попытка
		//	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ЗаписьЖурналаРегистрации("Обновление_0_9_11_1",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось провести документ "+Выборка.Ссылка+" : " +ОписаниеОшибки());
		//КонецПопытки;
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//добавим основания реализаций в распаределение платежа по ПКО, если в нем есть реализация
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ПриходныйКассовыйОрдер.Дата
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		////Проводить = Ложь;
		//ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//СписокЗаказов = Новый ТаблицаЗначений;
		//СписокЗаказов.Колонки.Добавить("Заказ");
		//СписокЗаказов.Колонки.Добавить("Сумма");
		//Для Каждого ТекСтрокаДокумента Из Выборка.Ссылка.РаспределениеПлатежа Цикл
		//	Если ТипЗнч(ТекСтрокаДокумента.Документ) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда 
		//		Если ТипЗнч(ТекСтрокаДокумента.Документ.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") 
		//			или ТипЗнч(ТекСтрокаДокумента.Документ.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		//			Если НЕ ТекСтрокаДокумента.Документ.Основание.ПУстая() Тогда
		//				НоваяСтрока = СписокЗаказов.Добавить();
		//				НоваяСтрока.Заказ = ТекСтрокаДокумента.Документ.Основание;
		//				НоваяСтрока.Сумма = ТекСтрокаДокумента.Сумма;
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла;
		//
		//Для Каждого ТекСтрокаСпискаЗаказов Из СписокЗаказов Цикл
		//	Нашли = Ложь;
		//	Для Каждого ТекСтрокаДокумента Из Выборка.Ссылка.РаспределениеПлатежа Цикл
		//		Если ТекСтрокаДокумента.Документ = ТекСтрокаСпискаЗаказов.Заказ Тогда
		//			Нашли = Истина;
		//		КонецЕсли;
		//	КонецЦикла;
		//	
		//	Если НЕ Нашли Тогда
		//		НоваяСтрокаДокумента = ДокОбъект.РаспределениеПлатежа.Добавить();
		//		НоваяСтрокаДокумента.Документ = ТекСтрокаСпискаЗаказов.Заказ;
		//		НоваяСтрокаДокумента.Сумма = ТекСтрокаСпискаЗаказов.Сумма;
		//		//Проводить = Истина;
		//	КонецЕсли;
		//КонецЦикла;
		//
		////Если Проводить Тогда
		//	Попытка
		//		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//	Исключение
		//		ЗаписьЖурналаРегистрации("Обновление_0_9_11_1",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось провести документ "+Выборка.Ссылка+" : " +ОписаниеОшибки());
		//	КонецПопытки;
		////КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	//перепроводим все оплаты банковской картой
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаБанковскойКартой.Ссылка,
	|	ОплатаБанковскойКартой.Дата
	|ИЗ
	|	Документ.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой
	|ГДЕ
	|	ОплатаБанковскойКартой.Проведен";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//Попытка
		//	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ЗаписьЖурналаРегистрации("Обновление_0_9_11_1",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось провести документ "+Выборка.Ссылка+" : " +ОписаниеОшибки());
		//КонецПопытки;
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//перепроводим все поступления на расчетный счет
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка,
	|	ПоступлениеНаРасчетныйСчет.Дата
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//Попытка
		//	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ЗаписьЖурналаРегистрации("Обновление_0_9_11_1",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось провести документ "+Выборка.Ссылка+" : " +ОписаниеОшибки());
		//КонецПопытки;
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти


#Область Обновление_1_0_0_0

Процедура ОбработкаОбновления_1_0_0_0() Экспорт
	
	//переназначение ролей
	СписокПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для НомерПользователя = 0 По СписокПользователей.Количество()-1 Цикл
		ТекПользователь = СписокПользователей[НомерПользователя];
		Если ТекПользователь.Имя = "Администратор" или ТекПользователь.Роли.Содержит(Метаданные.Роли.АдминистраторСистемы) Тогда
			//снимаем все роли и ставим роли: Полные права, Администрирование
			ТекПользователь.Роли.Очистить();
			ТекПользователь.Роли.Добавить(Метаданные.Роли.АдминистраторСистемы);
			ТекПользователь.Записать();
		Иначе
			//снимаем все роли и ставим роль Полные права
			ТекПользователь.Роли.Очистить();
			ТекПользователь.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
			ТекПользователь.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ВерсияПрограммы = "1.0.0.0";
	
	//перезаполним документы "Состав производственной смены"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоставПроизводственнойСмены.Ссылка,
	|	СоставПроизводственнойСмены.Проведен,
	|	СоставПроизводственнойСмены.Дата
	|ИЗ
	|	Документ.СоставПроизводственнойСмены КАК СоставПроизводственнойСмены";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//Для Каждого ТекСотрудник Из ДокОбъект.Сотрудники Цикл
		//	Если ТекСотрудник.Коэффициент = 0 Тогда
		//		ТекСотрудник.Коэффициент = 1;
		//	КонецЕсли;
		//КонецЦикла;
		//Попытка
		//	Если Выборка.Проведен Тогда
		//		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//	Иначе
		//		ДокОбъект.Записать();
		//	КонецЕсли;
		//Исключение
		//	ЗаписьЖурналаРегистрации("Обновление_1_0_0_0",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось провести документ "+Выборка.Ссылка+" : " +ОписаниеОшибки());
		//КонецПопытки;
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_0_1_0

Процедура ОбработкаОбновления_1_0_1_0() Экспорт
	
	ВерсияПрограммы = "1.0.1.0";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказДоговор.Ссылка,
	|	ЗаказДоговор.Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	ЗаказДоговор.ТочкаПродаж = &ТочкаПродаж";
	Запрос.УстановитьПараметр("ТочкаПродаж", Справочники.ТочкиПродаж.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка,
	|	ПоступлениеНаРасчетныйСчет.Дата
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеСРасчетногоСчета.Ссылка,
	|	СписаниеСРасчетногоСчета.Дата
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|ГДЕ
	|	СписаниеСРасчетногоСчета.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_0_2_0

Процедура ОбработкаОбновления_1_0_2_0() Экспорт
	
	//переименовываем номенклатуру пленки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦветФактуры.Ссылка КАК Цвет,
	|	ЦветФактуры.Владелец КАК Фактура,
	|	ЦветФактуры.Номенклатура,
	|	ЦветФактуры.Владелец.ШиринаПолотна КАК ШиринаПолотна
	|ИЗ
	|	Справочник.ЦветФактуры КАК ЦветФактуры";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.Номенклатура.Пустая() Тогда
			НомОбъект = Выборка.Номенклатура.ПолучитьОбъект();
			НомОбъект.Наименование = ОбменСEasyCeiling.ПолучитьНаименованиеПленки(Выборка.Цвет, Выборка.Фактура, Выборка.ШиринаПолотна);
			Попытка
				НомОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Обновление_1_0_2_0",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось изменить наименование для номенклатуры пленки ["+Выборка.Номенклатура+"] : " +ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	//переименовываем номенклатуру потолка
	Если Константы.ПорядокФормированияНаименованияПотолка.Получить() = 1 Тогда
		//только для варианта ["Потолок " + НомерПотолка + " " + Цвет + " " + Фактура]
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	Номенклатура.Потолок_Многфактурный,
		|	Номенклатура.Потолок_Фактура.(
		|		Ссылка,
		|		НомерСтроки,
		|		ПродукцияФактура,
		|		ПродукцияЦвет,
		|		ПродукцияКоличество,
		|		Основная
		|	),
		|	Номенклатура.Потолок_НомерРасчета,
		|	Номенклатура.Потолок_ПлощадьФотопечати
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ВидНоменклатуры = &ВидНоменклатуры";
		Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВидыНоменклатуры.Потолок);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ВремФактура = Неопределено;
			ВремЦвет = Неопределено;
			СтрокаФактура = Выборка.Потолок_Фактура.Выбрать();
			Пока СтрокаФактура.Следующий() Цикл
				Если СтрокаФактура.Основная Тогда
					ВремФактура = СтрокаФактура.ПродукцияФактура;
					ВремЦвет = СтрокаФактура.ПродукцияЦвет;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НЕ ВремФактура = Неопределено И НЕ ВремЦвет = Неопределено Тогда
				НомОб = Выборка.Ссылка.ПолучитьОбъект();
				НомОб.Наименование = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(Выборка.Потолок_НомерРасчета, ВремЦвет, ВремФактура, Выборка.Потолок_Многфактурный,?(Выборка.Потолок_ПлощадьФотопечати > 0 ,Истина, Ложь)); 
				Попытка
					НомОб.Записать();
				Исключение
					ЗаписьЖурналаРегистрации("Обновление_1_0_2_0",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось изменить наименование для элемента номенклатуры потолка ["+Выборка.Ссылка+"] : " +ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВерсияПрограммы = "1.0.2.0";
	
	//запоминаем заказы на производство - их нужно будет перезаполнить
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка,
	|	ЗаказНаПроизводство.Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//запоминаем выпуски продукции - их нужно будет перезаполнить
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка,
	|	ВыпускПродукции.Дата
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;

	
		
КонецПроцедуры

#КонецОбласти


#Область Обновление_1_0_3_0

Процедура ОбработкаОбновления_1_0_3_0() Экспорт
	
	ВерсияПрограммы = "1.0.3.0";
	
	//переименовываем наименование материала в элементах справочника "Фактуры"
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	Ссылка
	|ИЗ
	|	Справочник.Фактура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СсылкаНаОбъект = Выборка.Ссылка;
		ТекОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		Если Не ТекОбъект.ЭтоГруппа Тогда
			ТекОбъект.Материал = ОбщийМодуль.ПолучитьНаименованиеМатериалаВФактуре(ТекОбъект.Наименование);
			Попытка
				ТекОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Обновление_1_0_3_0",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось изменить наименование материала для элемента справочника Фактуры ["+Выборка.Ссылка+"] : " +ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;				
	КонецЦикла;
	
	
	//удаление из регистра сведений ПрикрепленныеДанные записи с пустыми СсылкамиНаОбъект документа ЗаявкаНаДоставку
	Запрос = новый Запрос;
	Запрос.Текст = "Выбрать
	|	Период,
	|	СсылкаНаОбъект,
	|	ИмяФайла
	|ИЗ РегистрСведений.ПрикрепленныеДанные
	|ГДЕ СсылкаНаОбъект = &ПустаяСсылка
	|";
	Запрос.УстановитьПараметр("ПустаяСсылка", Документы.ЗаявкаНаДоставку.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		Попытка
			НаборЗаписей = РегистрыСведений.ПрикрепленныеДанные.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(Выборка.СсылкаНаОбъект);
			НаборЗаписей.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Обновление_1_0_3_0",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось удалить запись из регистра сведений ПрикрепленныеФайлы с пустой ссылкой ["+Строка(Выборка.Период)+" "+Строка(Выборка.ИмяФайла)+"] : " +ОписаниеОшибки());
		КонецПопытки;	
	КонецЦикла;
	
	//перезаполняем справочник "НастройкаИнтеркампани" (константы в будущем будут удалены)
	НастройкиИнтеркампани = Справочники.НастройкиИнтеркампани.Выбрать();
	Пока НастройкиИнтеркампани.Следующий() Цикл
		Если НЕ НастройкиИнтеркампани.ЭтоГруппа Тогда
			СпрОб = НастройкиИнтеркампани.ПолучитьОбъект();
			СпрОб.ОрганизацияПроизводствоПотолков = Константы.УДАЛИТЬ_ОрганизацияПроизводствоПотолков.Получить();
			СпрОб.ОрганизацияРозничныеПродажи = Константы.УДАЛИТЬ_ОрганизацияРозничныеПродажи.Получить();
			СпрОб.КонтрагентПроизводствоПотолков = Константы.УДАЛИТЬ_КонтрагентПроизводствоПотолков.Получить();
			СпрОб.КонтрагентРозничныеПродажи = Константы.УДАЛИТЬ_КонтрагентРозничныеПродажи.Получить();
			//СпрОб.НеУчитыватьСтоимостьВЗаказахНаПроизводство = Константы.УДАЛИТЬ_НеУчитыватьСтоимостьВЗаказахНаПроизводство.Получить();
			//СпрОб.УДАЛИТЬ_ПередачаПотолковВРозницуБезПродажи = Константы.УДАЛИТЬ_ПередачаПотолковВРозницуБезПродажи.Получить();
			СпрОб.Записать();
		КонецЕсли;
	КонецЦикла;
	
	//запоминаем заказы на производство - их нужно будет перезаполнить
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка,
	|	ЗаказНаПроизводство.Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.ДокументОснование ССЫЛКА Документ.ЗаказДоговор
	|	И ЗаказНаПроизводство.НастройкаИнтеркампани = &ПустаяНастройкаИнтеркампани";
	Запрос.УстановитьПараметр("ПустаяНастройкаИнтеркампани", Справочники.НастройкиИнтеркампани.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//если стоит галочка "Общие склады" - все документы что двигают РН "ТоварыНаСкладах" нужно пеерпровести - изменилась логика движения по этому регистру
	Если Константы.ОбщиеСклады.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОбороты.Регистратор КАК Ссылка,
		|	ТоварыНаСкладахОбороты.Регистратор.Дата КАК Дата
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, ) КАК ТоварыНаСкладахОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыНаСкладахОбороты.Период";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
			НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
			НоваяЗапись.Документ = Выборка.Ссылка; 
			НоваяЗапись.ДокументДата = Выборка.Дата; 
			
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_0_4_0

Процедура ОбработкаОбновления_1_0_4_0() Экспорт
	
	ВерсияПрограммы = "1.0.4.0";
	
	//закомментировано на версии 2.7 в связи с удалением реквизитов
	
	//во всех карточках контрагентов заполним поле "ОсновнойТелефон_ТолькоЦифры", если есть "ОсновнойТелефон"
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Контрагенты.Ссылка
	//|ИЗ
	//|	Справочник.Контрагенты КАК Контрагенты
	//|ГДЕ
	//|	НЕ Контрагенты.ЭтоГруппа";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Если НЕ ПустаяСтрока(Выборка.Ссылка.ОсновнойТелефон) Тогда
	//		Попытка
	//			СпрОб = Выборка.Ссылка.ПолучитьОбъект();
	//			СпрОб.ОсновнойТелефон_ТолькоЦифры = СофтФон.ОставитьТолькоЦифры(СпрОб.ОсновнойТелефон);
	//			СпрОб.Записать();
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_0_5_0

Процедура ОбработкаОбновления_1_0_5_0() Экспорт
	
	ВерсияПрограммы = "1.0.5.0";
	
	// отбор документов для заполнения нового реквизита "ЗаказНаПроизводство" в ТЧ заказ-договора
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказДоговорТоварыУслуги.Ссылка КАК Ссылка,
		|	ЗаказДоговорТоварыУслуги.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.ЗаказДоговор.ТоварыУслуги КАК ЗаказДоговорТоварыУслуги
		|ГДЕ
		|	ЗаказДоговорТоварыУслуги.НомерПотолка <> """"
		|	И ЗаказДоговорТоварыУслуги.ЗаказНаПроизводство = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
		|	И (ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
		|			ИЛИ ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок))
		|	И ЗаказДоговорТоварыУслуги.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказДоговорТоварыУслуги.Ссылка,
		|	ЗаказДоговорТоварыУслуги.Ссылка.Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//////////////////////////////////////////////
	//#4450 Константы.СоздаватьНовыйЛидЕслиПоТекущемуЛидуУжеЕстьДоговор.Установить(Истина);
	//////////////////////////////////////////////
	
	//возвраты товаров от покупателя
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратТовараОтПокупателя.Ссылка,
	|	ВозвратТовараОтПокупателя.Дата
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя КАК ВозвратТовараОтПокупателя
	|ГДЕ
	|	ВозвратТовараОтПокупателя.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//возвраты продукции
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратПродукции.Ссылка,
	|	ВозвратПродукции.Дата
	|ИЗ
	|	Документ.ВозвратПродукции КАК ВозвратПродукции
	|ГДЕ
	|	ВозвратПродукции.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_0_6_0

Процедура ОбработкаОбновления_1_0_6_0() Экспорт
	
	ВерсияПрограммы = "1.0.6.0";
	
	Справочники.СтатьиДоходовИРасходов.ЗаполнитьИспользованиеСтатейВУчетеДоходовИРасходовПоУмолчанию();
	РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.ЗаполнитьНастройкиПоУмолчанию();
	
	//выпуск продукции
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка,
	|	ВыпускПродукции.Дата
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//монтажи 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Монтаж.Ссылка,
	|	Монтаж.Дата
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Проведен
	|	И Монтаж.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Выполнен)
	|	И Монтаж.Склад <> Монтаж.СкладТоваров";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//добавление категорий номенклатукры в доступные группы свойств
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорияНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.КатегорияНоменклатуры КАК КатегорияНоменклатуры";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ЭлОбъект.НаборСвойств.Пустая() Тогда
			УправлениеСвойствами.ПередЗаписьюВидаОбъекта(ЭлОбъект, "Справочник_Номенклатура");
			ЭлОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	//добавление категорий контрагентов в доступные группы свойств
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.КатегорииКонтрагентов КАК КатегорииКонтрагентов";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ЭлОбъект.НаборСвойств.Пустая() Тогда
			УправлениеСвойствами.ПередЗаписьюВидаОбъекта(ЭлОбъект, "Справочник_Контрагенты");
			ЭлОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	//////////////////////////////////////////////
	Константы.ЗарплатныйПроект.Установить(Ложь);
	//////////////////////////////////////////////
	
	//Замена "Услуга раскроя кривых" и "Услуга раскроя углов" на "Услуга"
	УслугаРаскрояКривых = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000006");
	УслугаРаскрояУглов = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000005");
	Услуга = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000004");
	
	Если НЕ УслугаРаскрояКривых.ПометкаУдаления Тогда
		СпрОбъект = УслугаРаскрояКривых.ПолучитьОбъект();
		СпрОбъект.УстановитьПометкуУдаления(Истина);
		Попытка
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	Если НЕ УслугаРаскрояУглов.ПометкаУдаления Тогда
		СпрОбъект = УслугаРаскрояУглов.ПолучитьОбъект();
		СпрОбъект.УстановитьПометкуУдаления(Истина);
		Попытка
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если НЕ УслугаРаскрояКривых.Пустая() И НЕ УслугаРаскрояУглов.Пустая() И НЕ Услуга.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ВидНоменклатуры = &УслугаРаскрояКривых
		|	ИЛИ Номенклатура.ВидНоменклатуры = &УслугаРаскрояУглов";
		Запрос.УстановитьПараметр("УслугаРаскрояКривых",УслугаРаскрояКривых);
		Запрос.УстановитьПараметр("УслугаРаскрояУглов",УслугаРаскрояУглов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если СпрОбъект.ВидНоменклатуры = УслугаРаскрояКривых Тогда
				СпрОбъект.ВидПроизводственнойУслуги = Справочники.ВидыПроизводственныхУслуг.КриволинейныйУчасток;
			ИначеЕсли СпрОбъект.ВидНоменклатуры = УслугаРаскрояУглов Тогда
				СпрОбъект.ВидПроизводственнойУслуги = Справочники.ВидыПроизводственныхУслуг.Углы;
			КонецЕсли;
			СпрОбъект.ВидНоменклатуры = Услуга;
			Попытка
				СпрОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Обновление_1_0_6_0",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось изменить вид для номенклатуры ["+Выборка.Ссылка+"] : " +ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Обновление_1_0_7_0

Процедура ОбработкаОбновления_1_0_7_0() Экспорт
	
	ВерсияПрограммы = "1.0.7.0";
	
	Константы.УДАЛИТЬ_НеИспользоватьПрефиксОрганизацииВНомереДокумента.Установить(Истина);
	
	//лиды
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лид.Ссылка,
	|	Лид.Дата
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_0_8_0

Процедура ОбработкаОбновления_1_0_8_0() Экспорт
	
	ВерсияПрограммы = "1.0.8.0";
			
	ВремЗнач = Константы.ПрефиксНаименованияПотолка.Получить();
	Если ПустаяСтрока(ВремЗнач) Тогда
		Константы.ПрефиксНаименованияПотолка.Установить("Потолок");
	КонецЕсли;
	
	ВремЗнач = Константы.СуффиксАртПотолок.Получить();
	Если ПустаяСтрока(ВремЗнач) Тогда
		Константы.СуффиксАртПотолок.Установить("арт");
	КонецЕсли;
	
	ВремЗнач = Константы.СуффиксМногофактурныйПотолок.Получить();
	Если ПустаяСтрока(ВремЗнач) Тогда
		Константы.СуффиксМногофактурныйПотолок.Установить("мф");
	КонецЕсли;
	
	//Начало исключен при переходе на 2.0 - т.к. константа удалена
	//Константы.ИспользоватьСтатусПодтвержденВПроизводстве.Установить(Истина);
	//Конец исключен при переходе на 2.0
	
	//Установка стоимости выработки по номенклатуре (монтаж с пустым видом монтажа). Обрабатываем сразу.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Ссылка,
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Дата
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК УстановкаСтоимостиВыработкиПоНоменклатуре
	|ГДЕ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Проведен
	|	И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = &Монтаж
	//|	И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидМонтажа = &ПустойВидМонтажа
	|";
	Запрос.УстановитьПараметр("Монтаж",Справочники.ВидыДокументовРасчетаВыработки.Монтаж);
	Запрос.УстановитьПараметр("ПустойВидМонтажа",Справочники.ВидыМонтажа.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ВидОперации = Справочники.ВидыМонтажа.Монтаж;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//обработчик исключений не добавляем, чтобы сразу выявить все "косячные" документы и отказать в обновлении.
		
	КонецЦикла;
	
	
	//выпуск продукции
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка,
	|	ВыпускПродукции.Дата
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//реализация товаров и услуг
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслуг.Ссылка,
	|	РеализацияТоваровИУслуг.Дата
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//Монтаж (с пустым видом монтажа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Монтаж.Ссылка,
	|	Монтаж.Дата
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.ВидОперации = &ПустойВидМонтажа";
	Запрос.УстановитьПараметр("ПустойВидМонтажа",Справочники.ВидыМонтажа.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Обновление_1_0_9_0

Процедура ОбработкаОбновления_1_0_9_0() Экспорт
	
	ВерсияПрограммы = "1.0.9.0";
			
	//РТИУ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслуг.Ссылка,
	|	РеализацияТоваровИУслуг.Дата
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Проведен
	|	И РеализацияТоваровИУслуг.СуммаБонусовКНачислениюПоДисконтнойКарте > 0
	|	И РеализацияТоваровИУслуг.СуммаБонусовКСписаниюПоДисконтнойКарте > 0";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	// константа по гарпуну в Расширенные настройки
	ЭлементГарпуна = Константы.УДАЛИТЬ_ЭлементГарпун.Получить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПравилаОбработкиФайлаПрограммыПостроителя.ПараметрФайла
		|ИЗ
		|	РегистрСведений.ПравилаОбработкиФайлаПрограммыПостроителя КАК ПравилаОбработкиФайлаПрограммыПостроителя
		|ГДЕ
		|	ПравилаОбработкиФайлаПрограммыПостроителя.ПараметрФайла = ЗНАЧЕНИЕ(Справочник.ПараметрыФайлаПрограммыПостроителя.КоличествоГарпун)";
				
	РезультатЗапроса = Запрос.Выполнить();		
		
	Если РезультатЗапроса.Пустой() И ЗначениеЗаполнено(ЭлементГарпуна) Тогда
		МенеджерЗаписи = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.ПараметрФайла = Справочники.ПараметрыФайлаПрограммыПостроителя.КоличествоГарпун; 
		МенеджерЗаписи.Номенклатура = ЭлементГарпуна;
		МенеджерЗаписи.ЕдиницаИзмерения = ЭлементГарпуна.БазоваяЕдиницаИзмерения;
		МенеджерЗаписи.ВидЗаказа = Перечисления.ВидыЗаказов.ЗаказНаПроизводство;
		МенеджерЗаписи.ТабличнаяЧастьЗаказа	= "Материалы";
		МенеджерЗаписи.Коэффициент             = 1;	
		МенеджерЗаписи.ВариантОпределенияКоличества = 1;
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
		КонецПопытки;
 		
	КонецЕсли;
	
	//НАЧАЛО Переход на 2,0
	// константы по упаковке
	//ЭлементУпаковкаНоменклатура = Константы.УпаковкаНоменклатура.Получить();
	//		
	//Если ЗначениеЗаполнено(ЭлементУпаковкаНоменклатура) Тогда
	//	МенеджерЗаписи = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьМенеджерЗаписи(); 
	//	МенеджерЗаписи.ЭтоПравилоБезПараметра 		= Истина; 
	//	МенеджерЗаписи.Номенклатура 				= ЭлементУпаковкаНоменклатура;
	//	МенеджерЗаписи.ЕдиницаИзмерения 			= Константы.УпаковкаЕдиницаИзмерения.Получить();
	//	МенеджерЗаписи.ВариантОпределенияКоличества = 2;
	//	МенеджерЗаписи.ОбщееКоличество 				= Константы.УпаковкаКоличество.Получить();	
	//	МенеджерЗаписи.ВидЗаказа 					= Перечисления.ВидыЗаказов.ЗаказНаПроизводство;
	//	МенеджерЗаписи.ТабличнаяЧастьЗаказа			= "Товары";	
	//	КоэффициентВТЧ = 1;
	//	Если ТипЗнч(МенеджерЗаписи.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
	//		КоэффициентВТЧ = МенеджерЗаписи.ЕдиницаИзмерения.Коэффициент;
	//	КонецЕсли;
	//	МенеджерЗаписи.Коэффициент            		= КоэффициентВТЧ;	
	//	
	//	Попытка
	//		МенеджерЗаписи.Записать();
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//
	//ЭлементУпаковкаНоменклатураУслуга = Константы.УпаковкаУслугаНоменклатура.Получить();
	//		
	//Если ЗначениеЗаполнено(ЭлементУпаковкаНоменклатураУслуга) Тогда
	//	МенеджерЗаписи = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьМенеджерЗаписи(); 
	//	МенеджерЗаписи.ЭтоПравилоБезПараметра 		= Истина; 
	//	МенеджерЗаписи.Номенклатура 				= ЭлементУпаковкаНоменклатураУслуга;
	//	МенеджерЗаписи.ЕдиницаИзмерения 			= Константы.УпаковкаУслугаЕдиницаИзмерения.Получить();
	//	МенеджерЗаписи.ВариантОпределенияКоличества = 2;
	//	МенеджерЗаписи.ОбщееКоличество 				= Константы.УпаковкаУслугаКоличество.Получить();		
	//	МенеджерЗаписи.ВидЗаказа 					= Перечисления.ВидыЗаказов.ЗаказНаПроизводство;
	//	МенеджерЗаписи.ТабличнаяЧастьЗаказа			= "Услуги";		
	//	КоэффициентВТЧ = 1;
	//	Если ТипЗнч(МенеджерЗаписи.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
	//		КоэффициентВТЧ = МенеджерЗаписи.ЕдиницаИзмерения.Коэффициент;
	//	КонецЕсли;
	//	МенеджерЗаписи.Коэффициент            		= КоэффициентВТЧ;
	//	
	//	Попытка
	//		МенеджерЗаписи.Записать();
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//КОНЕЦ Переход на 2,0
	
	// новый файл из построителя
	Попытка
		СпрОбъект = Справочники.ВидыФайловПрограммыПостроителя.Макет.ПолучитьОбъект();
		СпрОбъект.Загружать = Истина;
		СпрОбъект.Записать();
	Исключение
	КонецПопытки;
	
	//Остатки пленки приведем к соответсвующему виду
	Попытка
		НоменклатураОстаткиПленки = Справочники.Номенклатура.ОстаткиПленки.Ссылка.ПолучитьОбъект();
		НоменклатураОстаткиПленки.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ОстатокПленки;
		НоменклатураОстаткиПленки.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;	
		НоменклатураОстаткиПленки.Записать();
	Исключение
		//
	КонецПопытки;
	
	//Создан новый предопределенный элемент "Повторный клиент" в справочнике Рекламный источник 
	//Нужно существующий с таким же кодом перенумеровать
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РекламныеИсточники.Ссылка				  
	               |ИЗ
	               |	Справочник.РекламныеИсточники КАК РекламныеИсточники
	               |ГДЕ
	               |	НЕ РекламныеИсточники.Предопределенный
				   |	И РекламныеИсточники.Код = ""000000001""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();			
			СпрОбъект.УстановитьНовыйКод();			
			СпрОбъект.Записать();
		Исключение
			//
		КонецПопытки;
	КонецЦикла;
	
	// статья доходов для нового документа
	МенеджерЗаписи = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипДокумента 			= "Штраф"; 
	МенеджерЗаписи.ВидОперации 			= Неопределено; 
	МенеджерЗаписи.СтатьяДоходовРасходов 	= Справочники.СтатьиДоходовИРасходов.ПрочиеДоходы;	
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
	
	// новая константа
	Константы.ИспользоватьУчетПоСтатьямДДС.Установить(Истина);
	
	// константа по номенклатуре услуги центровки шва в справочник
	ЭлементРаскройЦентровкаШва = Константы.УДАЛИТЬ_ЭлементРаскройЦентровкаШва.Получить();
	ПроцентЦентровкаШва = Константы.УДАЛИТЬ_СтоимостьУслугиЦентровкиШва.Получить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныУслугРаскроя.Ссылка,
		|	ЦеныУслугРаскроя.СтоимостьУслугиЦентровкиШва КАК ПроцентУслуги
		|ИЗ
		|	Справочник.ЦеныУслугРаскроя КАК ЦеныУслугРаскроя
		|ГДЕ
		|	НЕ ЦеныУслугРаскроя.ПометкаУдаления";
		
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		 Попытка
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();			
			СпрОбъект.НоменклатураУслугиЦентровкиШва = ЭлементРаскройЦентровкаШва;
			Если Выборка.ПроцентУслуги = 0 Тогда
				СпрОбъект.СтоимостьУслугиЦентровкиШва = ПроцентЦентровкаШва;
			КонецЕсли;
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныУслугРаскрояПоставщиков.Ссылка,
		|	ЦеныУслугРаскрояПоставщиков.ПроцентНаценкиЗаЦентровкуШва КАК ПроцентУслуги
		|ИЗ
		|	Справочник.ЦеныУслугРаскрояПоставщиков КАК ЦеныУслугРаскрояПоставщиков
		|ГДЕ
		|	НЕ ЦеныУслугРаскрояПоставщиков.ПометкаУдаления";
		
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		 Попытка
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();			
			СпрОбъект.НоменклатураУслугиЦентровкиШва = ЭлементРаскройЦентровкаШва;
			Если Выборка.ПроцентУслуги = 0 Тогда
				СпрОбъект.ПроцентНаценкиЗаЦентровкуШва = ПроцентЦентровкаШва;
			КонецЕсли;
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	#Область ПереносДокументовЗППроизводства
	// перенос документов "Установка стоимости выработки на производстве" 
	// в документ "Установка стоимости выработки"
	НачислятьВыработкуПроизводстваМенеджеруКонтрагента = Константы.УДАЛИТЬ_НачислятьВыработкуПроизводстваМенеджеруКонтрагента.Получить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УстановкаСтоимостиВыработкиПроизводства.Ссылка,
		|	УстановкаСтоимостиВыработкиПроизводства.ВерсияДанных,
		|	УстановкаСтоимостиВыработкиПроизводства.Номер,
		|	УстановкаСтоимостиВыработкиПроизводства.Дата,
		|	УстановкаСтоимостиВыработкиПроизводства.ВидНоменклатурыПотолка,
		|	УстановкаСтоимостиВыработкиПроизводства.Комментарий,
		|	УстановкаСтоимостиВыработкиПроизводства.Ответственный,
		|	УстановкаСтоимостиВыработкиПроизводства.СтоимостьЗаПозициюПродукцииРаскройщику,
		|	УстановкаСтоимостиВыработкиПроизводства.СтоимостьЗаПозициюПродукцииМенеджеру,
		|	УстановкаСтоимостиВыработкиПроизводства.УстановитьСтоимостьЗаПозициюВВыпуске,
		|	УстановкаСтоимостиВыработкиПроизводства.СтоимостьЗаПозициюДелитсяНаВсехРаспройщиков,
		|	УстановкаСтоимостиВыработкиПроизводства.СтоимостьВыработки.(
		|		Ссылка,
		|		НомерСтроки,
		|		ЕдиницаИзмерения,
		|		Номенклатура,
		|		ПоВыработке,
		|		Стоимость,
		|		СтоимостьДляМенеджера
		|	)
		|ИЗ
		|	Документ.УДАЛИТЬ_УстановкаСтоимостиВыработкиПроизводства КАК УстановкаСтоимостиВыработкиПроизводства
		|ГДЕ
		|	УстановкаСтоимостиВыработкиПроизводства.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления";
	
	РезультатЗапросаОбщий = Запрос.ВыполнитьПакет();
	РезультатЗапроса = РезультатЗапросаОбщий[0].Выгрузить();
	РезультатПоОрганизациям = РезультатЗапросаОбщий[1].Выгрузить();
		
	Для каждого Выборка из РезультатЗапроса Цикл
		Для каждого СтрокаОрганизация из РезультатПоОрганизациям Цикл
			// для раскройщиков
			НовыйДокументРаскройщики = Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.СоздатьДокумент();
			НовыйДокументРаскройщики.Дата = Выборка.Дата;
			НовыйДокументРаскройщики.Организация = СтрокаОрганизация.Ссылка;
			НовыйДокументРаскройщики.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции;
			НовыйДокументРаскройщики.ВидИсполнителя = Справочники.ВидыИсполнителей.Раскройщики;
			НовыйДокументРаскройщики.ВидНоменклатурыПотолка = Выборка.ВидНоменклатурыПотолка;
			НовыйДокументРаскройщики.Комментарий = "#Создан при обновлении на 1.0.9.0 по документу " + Строка(Выборка.Ссылка);
			//НовыйДокументРаскройщики.Ответственный = Выборка.Ответственный;
			Для каждого СтрокаТЧ из Выборка.СтоимостьВыработки Цикл		
				НоваяСтрокаТЧ = НовыйДокументРаскройщики.ВыработкаПоНоменклатуре.Добавить();
				НоваяСтрокаТЧ.Номенклатура = СтрокаТЧ.Номенклатура;
				НоваяСтрокаТЧ.СтоимостьСуммой = СтрокаТЧ.Стоимость;
				Если НоваяСтрокаТЧ.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
					НоваяСтрокаТЧ.ПоВыработке = Истина;
				Иначе
					НоваяСтрокаТЧ.ПоВыработке = СтрокаТЧ.ПоВыработке;
				КонецЕсли;
				//Если Выборка.УстановитьСтоимостьЗаПозициюВВыпуске Тогда 
				//	НоваяСтрокаТЧ.СтоимостьЗаФактПрисутствия = Выборка.СтоимостьЗаПозициюПродукцииРаскройщику;
				//	НоваяСтрокаТЧ.ДелитсяНаВсех = Выборка.СтоимостьЗаПозициюДелитсяНаВсехРаспройщиков;
				//КонецЕсли;
			КонецЦикла;
			
			Если Выборка.УстановитьСтоимостьЗаПозициюВВыпуске И Выборка.СтоимостьЗаПозициюПродукцииРаскройщику > 0 Тогда
				НоваяСтрокаТЧ = НовыйДокументРаскройщики.ВыработкаПоВидамНоменклатуры.Добавить();
				НоваяСтрокаТЧ.ВидНоменклатуры = Выборка.ВидНоменклатурыПотолка;
				НоваяСтрокаТЧ.СтоимостьЗаФактПрисутствия = Выборка.СтоимостьЗаПозициюПродукцииРаскройщику;
				НоваяСтрокаТЧ.ДелитсяНаВсех = Выборка.СтоимостьЗаПозициюДелитсяНаВсехРаспройщиков;
			КонецЕсли;
			
			Попытка
				НовыйДокументРаскройщики.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				НовыйДокументРаскройщики.Записать(РежимЗаписиДокумента.Запись);
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
			
			//для менеджеров
			НовыйДокументМенеджер = Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.СоздатьДокумент();
			НовыйДокументМенеджер.Дата = Выборка.Дата; 
			НовыйДокументМенеджер.Организация = СтрокаОрганизация.Ссылка;
			НовыйДокументМенеджер.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции;
			Если НачислятьВыработкуПроизводстваМенеджеруКонтрагента Тогда
				НовыйДокументМенеджер.ВидИсполнителя = Справочники.ВидыИсполнителей.МенеджерКонтрагента;
			Иначе
				НовыйДокументМенеджер.ВидИсполнителя = Справочники.ВидыИсполнителей.ОтветственныйВОснованииЗаказа;
			КонецЕсли;
			НовыйДокументМенеджер.ВидНоменклатурыПотолка = Выборка.ВидНоменклатурыПотолка;
			НовыйДокументМенеджер.Комментарий = "#Создан при обновлении на 1.0.9.0 по документу " + Строка(Выборка.Ссылка);
			//НовыйДокументМенеджер.Ответственный = Выборка.Ответственный;
			Для каждого СтрокаТЧ из Выборка.СтоимостьВыработки Цикл		
				НоваяСтрокаТЧ = НовыйДокументМенеджер.ВыработкаПоНоменклатуре.Добавить();
				НоваяСтрокаТЧ.Номенклатура = СтрокаТЧ.Номенклатура;
				НоваяСтрокаТЧ.СтоимостьСуммой = СтрокаТЧ.СтоимостьДляМенеджера;
				Если НоваяСтрокаТЧ.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
					НоваяСтрокаТЧ.ПоВыработке = Истина;
				Иначе
					НоваяСтрокаТЧ.ПоВыработке = СтрокаТЧ.ПоВыработке;
				КонецЕсли;
				//Если Выборка.УстановитьСтоимостьЗаПозициюВВыпуске Тогда 
				//	НоваяСтрокаТЧ.СтоимостьЗаФактПрисутствия = Выборка.СтоимостьЗаПозициюПродукцииМенеджеру;
				//КонецЕсли;
			КонецЦикла;
			
			Если Выборка.УстановитьСтоимостьЗаПозициюВВыпуске И Выборка.СтоимостьЗаПозициюПродукцииМенеджеру > 0 Тогда
				НоваяСтрокаТЧ = НовыйДокументМенеджер.ВыработкаПоВидамНоменклатуры.Добавить();
				НоваяСтрокаТЧ.ВидНоменклатуры = Выборка.ВидНоменклатурыПотолка;
				НоваяСтрокаТЧ.СтоимостьЗаФактПрисутствия = Выборка.СтоимостьЗаПозициюПродукцииМенеджеру;
			КонецЕсли;
			
			Попытка
				НовыйДокументМенеджер.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				НовыйДокументМенеджер.Записать(РежимЗаписиДокумента.Запись);
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	#КонецОбласти
	
	//Виды начисления Удаленные: Процент за потолки (код 000000006), Процент за товары (код 000000004), Процент за услуги (код 000000005)
	СписокУдаленныхВидовНачислений = новый СписокЗначений;
	ПроцентЗаТовары = Справочники.ВидыНачислений.НайтиПоКоду("000000004").Ссылка;
	ПроцентЗаУслуги = Справочники.ВидыНачислений.НайтиПоКоду("000000005").Ссылка; 
	ПроцентЗаПотолки = Справочники.ВидыНачислений.НайтиПоКоду("000000006").Ссылка;
	СписокУдаленныхВидовНачислений.Добавить(ПроцентЗаТовары);
	СписокУдаленныхВидовНачислений.Добавить(ПроцентЗаУслуги);
	СписокУдаленныхВидовНачислений.Добавить(ПроцентЗаПотолки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачисленияЗарплаты.Ссылка,
		|	ВЫБОР
		|	КОГДА НачисленияЗарплаты.Ссылка.ПометкаУдаления = ИСТИНА
		|		ТОГДА 2
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НачисленияЗарплаты.Ссылка.Проведен = ИСТИНА
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|   Документ.НачислениеЗарплаты.Начисление КАК НачисленияЗарплаты
		|ГДЕ
		|   НачисленияЗарплаты.ВидНачисления В (&СписокУдаленныхВидовНачислений)";
	Запрос.УстановитьПараметр("СписокУдаленныхВидовНачислений", СписокУдаленныхВидовНачислений);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЕстьИзменения = Ложь;
		Для Каждого ТекСтрока Из ДокументОбъект.Начисление Цикл
			Если ТекСтрока.ВидНачисления = ПроцентЗаТовары
					ИЛИ ТекСтрока.ВидНачисления = ПроцентЗаУслуги
					ИЛИ ТекСтрока.ВидНачисления = ПроцентЗаПотолки Тогда
				ЕстьИзменения = Истина;
				ТекСтрока.ВидНачисления = Справочники.ВидыНачислений.Процент;
			КонецЕсли;			
		КонецЦикла;
		Если ЕстьИзменения Тогда
			Попытка
				Если Выборка.СостояниеДокумента = 0 ИЛИ Выборка.СостояниеДокумента = 2 Тогда
					ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				ИначеЕсли Выборка.СостояниеДокумента = 1 Тогда
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				//
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла;	
	
	//------
	Зарплата.НастроитьВидыНачисленийПоРолямСотрудников();
	
	//создадим службеного пользователя для установки обновлений
	// #7604 закомментировано
	//ИмяПользователя = "УстановкаОбновлений";
	//Пароль = "7845";
	//
	//ИскомыйПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	//Если НЕ ИскомыйПОльзователь = Неопределено Тогда
	//	ИскомыйПОльзователь.Пароль = Пароль;
	//	Если НЕ ИскомыйПОльзователь.Роли.Содержит(Метаданные.Роли.Найти("АдминистраторСистемы")) Тогда
	//		ИскомыйПОльзователь.Роли.Добавить(Метаданные.Роли.Найти("АдминистраторСистемы"));
	//	КонецЕсли;
	//	ИскомыйПОльзователь.Записать();
	//Иначе
	//	Пользователи.СоздатьПользователя(ИмяПользователя, Ложь);
	//	НовыйАдминистратор = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	//	Если НЕ НовыйАдминистратор = Неопределено Тогда
	//		НовыйАдминистратор.Пароль = Пароль;
	//		НовыйАдминистратор.Записать();
	//	КонецЕсли;
	//КонецЕсли;
	
	//создадим пользователя Администратор
	ИскомыйПОльзователь = ПользователиИнформационнойБазы.НайтиПоИмени("Администратор");
	Если ИскомыйПОльзователь = Неопределено Тогда
		Пользователи.СоздатьАдминистратора(Неопределено);
		НовыйАдминистратор = ПользователиИнформационнойБазы.НайтиПоИмени("Администратор");
		Если НЕ НовыйАдминистратор = Неопределено Тогда
			Если НЕ НовыйАдминистратор.Роли.Содержит(Метаданные.Роли.АдминистраторСистемы) Тогда
				НовыйАдминистратор.Роли.Добавить(Метаданные.Роли.АдминистраторСистемы);
			КонецЕсли;
			НовыйАдминистратор.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_1_0_0

Процедура ОбработкаОбновления_1_1_0_0() Экспорт
	
	ВерсияПрограммы = "1.1.0.0";
	
	// рекламные источники
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РекламныеИсточники.Ссылка
	|ИЗ
	|	Справочник.РекламныеИсточники КАК РекламныеИсточники
	|ГДЕ
	|	НЕ РекламныеИсточники.ЭтоГруппа";	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.ДоступенВРознице = Истина;
		
		Попытка
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	//Устанавливаем константы Ведение расчетов по заказам (Монтаж новый для распределения, его не устанавливаем)
	Константы.ВестиРасчетыПоЗаказамПоЗаказДоговору.Установить(Истина);
	//Константы.ВестиРасчетыПоЗаказамПоЗаказуНаПроизводство.Установить(Истина); //Переход на 2.0
	Константы.ВестиРасчетыПоЗаказамПоЗаказуПокупателя.Установить(Истина);	
	Константы.ВестиРасчетыПоЗаказамПоРТиУ.Установить(Истина);
	Константы.ВестиРасчетыПоЗаказамПоСчетуНаОплату.Установить(Истина);
	
	//Справочник Результаты Монтажа нужно установить у всех доступность, кроме статуса Закрыт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезультатыМонтажа.Ссылка
		|ИЗ
		|	Справочник.РезультатыМонтажа КАК РезультатыМонтажа
		|ГДЕ
		|	НЕ РезультатыМонтажа.Ссылка = Значение(Справочник.РезультатыМонтажа.Закрыт)";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		Попытка
			Статус = Выборка.Ссылка.ПолучитьОбъект();
			Статус.Доступен = Истина;
			Статус.Записать();
		Исключение
		КонецПопытки
	КонецЦикла;
	
	//Нужно перепровести документы регистраторы в Регистре накполения Заказы покупателей
	//Заказ договор
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказДоговор.Ссылка,
	|	ЗаказДоговор.Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	ЗаказДоговор.Проведен
	|	И НЕ ЗаказДоговор.ТекущийСтатус = Значение(Справочник.СтатусыЗаказДоговоров.Отменен)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//Заказ на производство
	СписокСтатусовПроизводство = новый СписокЗначений;
	//Начало исключен при переходе на 2.0
	//СписокСтатусовПроизводство.Добавить(Справочники.СтатусыЗаказовНаПроизводство.Подтвержден);	
	//Конец исключен при переходе на 2.0
	СписокСтатусовПроизводство.Добавить(Справочники.СтатусыЗаказовНаПроизводство.ВПроизводстве);
	СписокСтатусовПроизводство.Добавить(Справочники.СтатусыЗаказовНаПроизводство.Произведен);
	//Начало исключен при переходе на 2.0
	//СписокСтатусовПроизводство.Добавить(Справочники.СтатусыЗаказовНаПроизводство.Отгружен);
	//СписокСтатусовПроизводство.Добавить(Справочники.СтатусыЗаказовНаПроизводство.Новый);
	//Конец исключен при переходе на 2.0
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка,
	|	ЗаказНаПроизводство.Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.Проведен
	|	И ЗаказНаПроизводство.ТекущийСтатус В (&СписокСтатусовПроизводство)";
	Запрос.УстановитьПараметр("СписокСтатусовПроизводство", СписокСтатусовПроизводство);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//Заказ покупателя
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.Дата
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//Монтаж
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Монтаж.Ссылка,
	|	Монтаж.Дата
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Проведен
	|	И НЕ Монтаж.Результат = Значение(Справочник.РезультатыМонтажа.Отменен)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//РТиУ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслуг.Ссылка,
	|	РеализацияТоваровИУслуг.Дата
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//создадим службеного пользователя для установки обновлений
	// #7604 закомментировано
	//ИмяПользователя = "УстановкаОбновлений";
	//Пароль = "7845";
	//
	//ИскомыйПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	//Если НЕ ИскомыйПОльзователь = Неопределено Тогда
	//	ИскомыйПОльзователь.Пароль = Пароль;
	//	Если НЕ ИскомыйПОльзователь.Роли.Содержит(Метаданные.Роли.Найти("АдминистраторСистемы")) Тогда
	//		ИскомыйПОльзователь.Роли.Добавить(Метаданные.Роли.Найти("АдминистраторСистемы"));
	//	КонецЕсли;
	//	ИскомыйПОльзователь.Записать();
	//Иначе
	//	Пользователи.СоздатьПользователя(ИмяПользователя, Ложь);
	//	НовыйАдминистратор = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	//	Если НЕ НовыйАдминистратор = Неопределено Тогда
	//		НовыйАдминистратор.Пароль = Пароль;
	//		НовыйАдминистратор.Записать();
	//	КонецЕсли;
	//КонецЕсли;
	
	//создадим пользователя Администратор
	ИскомыйПОльзователь = ПользователиИнформационнойБазы.НайтиПоИмени("Администратор");
	Если ИскомыйПОльзователь = Неопределено Тогда
		Пользователи.СоздатьАдминистратора(Неопределено);
		НовыйАдминистратор = ПользователиИнформационнойБазы.НайтиПоИмени("Администратор");
		Если НЕ НовыйАдминистратор = Неопределено Тогда
			Если НЕ НовыйАдминистратор.Роли.Содержит(Метаданные.Роли.АдминистраторСистемы) Тогда
				НовыйАдминистратор.Роли.Добавить(Метаданные.Роли.АдминистраторСистемы);
			КонецЕсли;
			НовыйАдминистратор.Записать();
		КонецЕсли;
	КонецЕсли;
	
	
	#Область ВидыЦенПоставщиков
	
	// Установка цен на услуги производства поставщиков (для расчета стоимости потолка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.Ссылка
		|ИЗ
		|	Справочник.ЦеныУслугРаскрояПоставщиков КАК ДанныеСправочника
		|ГДЕ
		|	НЕ ДанныеСправочника.ПометкаУдаления
		|	И НЕ ДанныеСправочника.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.ВидЦеныПоставщика = Справочники.ВидыЦенПоставщиков.ПриОбновленииПолучитьВидЦены(СпрОбъект.Контрагент);
		Если СпрОбъект.Дата = Дата(1,1,1) Тогда
			СпрОбъект.Дата = Дата(1901,1,1);
		КонецЕсли;
		Попытка
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	// Настройки предварительной себестоимости заказа в рознице
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.Ссылка
		|ИЗ
		|	Справочник.НастройкиПредварительногоРасчетаЗаказаВРознице КАК ДанныеСправочника
		|ГДЕ
		|	НЕ ДанныеСправочника.ПометкаУдаления
		|	И ДанныеСправочника.ПотолкиЗакупаютсяУПоставщика
		|	И НЕ ДанныеСправочника.Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.ВидЦеныПоставщика = Справочники.ВидыЦенПоставщиков.ПриОбновленииПолучитьВидЦены(СпрОбъект.Поставщик);
		Попытка
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Константы.ИспользоватьДатыЗапретаИзменения.Установить(Ложь);
	
	// Документы Установка цен материалов поставщиков (для расчета стоимости потолка)
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокумента.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенМатериаловПоставщиков КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Проведен";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ВидЦеныПоставщика = Справочники.ВидыЦенПоставщиков.ПриОбновленииПолучитьВидЦены(ДокОбъект.Контрагент);
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	// Документы Установка цен поставщика (на простые товары)
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокумента.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенМатериаловПоставщиков КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Проведен";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ВидЦеныПоставщика = Справочники.ВидыЦенПоставщиков.ПриОбновленииПолучитьВидЦены(ДокОбъект.Контрагент);
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Константы.ИспользоватьДатыЗапретаИзменения.Установить(Истина);
	
	// Справочник ДоговорКонтрагента
	Запрос.УстановитьПараметр("ДатаОтбора", ТекущаяДатаСеанса() - 365*86400); 
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.ДоговорКонтрагента
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И ДанныеДокумента.Дата > &ДатаОтбора
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.ДоговорКонтрагента
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента2.Контрагент,
		|	ДанныеДокумента2.ДоговорКонтрагента
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг КАК ДанныеДокумента2
		|ГДЕ
		|	ДанныеДокумента2.Проведен
		|	И ДанныеДокумента2.Дата > &ДатаОтбора
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДокумента2.Контрагент,
		|	ДанныеДокумента2.ДоговорКонтрагента";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидЦеныПоставщика = Справочники.ВидыЦенПоставщиков.ПриОбновленииПолучитьВидЦены(Выборка.Контрагент);
		СпрОбъект = Выборка.ДоговорКонтрагента.ПолучитьОбъект();
		СпрОбъект.ВидЦеныПоставщика = ВидЦеныПоставщика;
		Попытка
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	#КонецОбласти
	
	// возвраты
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЕстьОснование = Ложь;
		Если ЗначениеЗаполнено(ДокОбъект.Основание) Тогда
			Если ТипЗнч(ДокОбъект.Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
				ЕстьОснование = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Для каждого ЭлементТЧ из ДокОбъект.Товары Цикл
			Если  ЕстьОснование Тогда
				ЭлементТЧ.ДокументПродажи = ДокОбъект.Основание;
			Иначе
				ЭлементТЧ.СебестоимостьЗаЕдиницу = ЭлементТЧ.Цена;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			ДокОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры	

#КонецОбласти

#Область Обновление_1_1_1_0

Процедура ОбработкаОбновления_1_1_1_0() Экспорт
	
	ВерсияПрограммы = "1.1.1.0";
	
	//переименовываем наименование материала в элементах справочника "Фактуры"
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Фактура.Ссылка
	               |ИЗ
	               |	Справочник.Фактура КАК Фактура
				   |ГДЕ
				   |   НЕ Фактура.ЭтоГруппа
				   |";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();		
		ТекОбъект.Материал = ОбщийМодуль.ПолучитьНаименованиеМатериалаВФактуре(ТекОбъект.Наименование);
		Попытка
			ТекОбъект.Записать();
		Исключение			
		КонецПопытки;		
	КонецЦикла;
	
	//заполняем значения новых констант
	//Если Константы.ОтправлятьСМСКонтрагентуПоПКО.Получить() 
	//	И НЕ ЗначениеЗаполнено(Константы.ОтправлятьСМСКонтрагентуПоПКОДатаНачала.Получить()) Тогда		
	//	Константы.ОтправлятьСМСКонтрагентуПоПКОДатаНачала.Установить(ТекущаяДатаСеанса());
	//КонецЕсли;
	//Если Константы.ОтправлятьСМСКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен.Получить() 
	//	И НЕ ЗначениеЗаполнено(Константы.ОтправлятьСМСКонтрагентуПриПереводеЗНПВСтатусПроизведенДатаНачала.Получить()) Тогда	
	//	Константы.ОтправлятьСМСКонтрагентуПриПереводеЗНПВСтатусПроизведенДатаНачала.Установить(ТекущаяДатаСеанса());
	//КонецЕсли;  
	//Если (Константы.ОтправлятьСМСКлиентуПриПланированииЗамера.Получить() 
	//	ИЛИ Константы.ОтправлятьСМСЗамерщикуПриПланированииЗамера.Получить())
	//	И НЕ ЗначениеЗаполнено(Константы.ОтправлятьСМСПриПланированииЗамераДатаНачала.Получить()) Тогда	
	//	Константы.ОтправлятьСМСПриПланированииЗамераДатаНачала.Установить(ТекущаяДатаСеанса());
	//КонецЕсли;
	//Если Константы.ОтправлятьСМСПриИзмененииДатыМонтажа.Получить() 
	//	И НЕ ЗначениеЗаполнено(Константы.УДАЛИТЬ_ОтправлятьСМСПриИзмененииДатыМонтажаГраницаНачалаОтправки.Получить()) Тогда	
	//	Константы.УДАЛИТЬ_ОтправлятьСМСПриИзмененииДатыМонтажаГраницаНачалаОтправки.Установить(1);
	//КонецЕсли;
	//Если Константы.ОтправлятьСМСОЗапланированномМонтаже.Получить() 
	//	И НЕ ЗначениеЗаполнено(Константы.ОтправлятьСМСОЗапланированномМонтажеГраницаНачалаОтправки.Получить()) Тогда	
	//	Константы.ОтправлятьСМСОЗапланированномМонтажеГраницаНачалаОтправки.Установить(1);
	//КонецЕсли;
	
	//Регистры СМС нужно указать признак
	НаборЗаписей = РегистрыСведений.СМСКОтправке.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ПризнакСМС = Перечисления.ПризнакиСМС.Новая;
	КонецЦикла;	
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;	
	
	НаборЗаписей = РегистрыСведений.СМСОтправленные.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.Период = Запись.ДатаОтправки;
		Запись.ПризнакСМС = Перечисления.ПризнакиСМС.Новая;
	КонецЦикла;	
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
	
	// новые правила
	Константы.ПорядокФормированияНаименованияОтреза.Установить(Константы.ПорядокФормированияНаименованияПотолка.Получить());
	Константы.ПрефиксНаименованияОтреза.Установить(Константы.ПрефиксНаименованияПотолка.Получить());
	
	//запоминаем документы, которые нужно перепровести для формирования движений по регистру ВзаиморасчетыСКонтрагентамиПоЗаказам
	ВерсияПрограммы = "1.1.1.0";
	//монтаж
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСсылка.Ссылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Монтаж КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен
	|	И ДокументСсылка.Результат = &Результат";
	Запрос.УстановитьПараметр("Результат",Справочники.РезультатыМонтажа.Выполнен);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//РасходныйКассовыйОрдер
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСсылка.Ссылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//СписаниеСРасчетногоСчета
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСсылка.Ссылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//ОплатаБанковскойКартой
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСсылка.Ссылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОплатаБанковскойКартой КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//ПоступлениеНаРасчетныйСчет
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСсылка.Ссылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//ПриходныйКассовыйОрдер
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСсылка.Ссылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//Замена
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСсылка.Ссылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Замена КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область Обновление_2_0_0_0

Процедура ОбработкаОбновления_2_0_0_0() Экспорт
	
	ВерсияПрограммы = "2.0.0.0";
	
	// Порядки для версии
	//1 2.0.0.$3
	//2 2.0.0.$5
	//3 2.0.0.$7
	//4 2.0.0.$a
	//5 2.0.0.$b
	//6 2.0.0.$c
	//7 2.0.0.$d
	//8 2.0.0.$e
	//99 2.0.0.0
	//101 2.0.0.1
	//201 2.0.0.2
	
	//заполняем значения новых констант
	//Если Константы.ОтправлятьСМСКонтрагентуПоПКО.Получить() 
	//	И НЕ ЗначениеЗаполнено(Константы.ОтправлятьСМСКонтрагентуПоПКОДатаНачала.Получить()) Тогда		
	//	Константы.ОтправлятьСМСКонтрагентуПоПКОДатаНачала.Установить(ТекущаяДатаСеанса());
	//КонецЕсли;
	//Если Константы.ОтправлятьСМСКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен.Получить() 
	//	И НЕ ЗначениеЗаполнено(Константы.ОтправлятьСМСКонтрагентуПриПереводеЗНПВСтатусПроизведенДатаНачала.Получить()) Тогда	
	//	Константы.ОтправлятьСМСКонтрагентуПриПереводеЗНПВСтатусПроизведенДатаНачала.Установить(ТекущаяДатаСеанса());
	//КонецЕсли;  
	//Если (Константы.ОтправлятьСМСКлиентуПриПланированииЗамера.Получить() 
	//	ИЛИ Константы.ОтправлятьСМСЗамерщикуПриПланированииЗамера.Получить())
	//	И НЕ ЗначениеЗаполнено(Константы.ОтправлятьСМСПриПланированииЗамераДатаНачала.Получить()) Тогда	
	//	Константы.ОтправлятьСМСПриПланированииЗамераДатаНачала.Установить(ТекущаяДатаСеанса());
	//КонецЕсли;
	//Если Константы.ОтправлятьСМСПриИзмененииДатыМонтажа.Получить() 
	//	И НЕ ЗначениеЗаполнено(Константы.УДАЛИТЬ_ОтправлятьСМСПриИзмененииДатыМонтажаГраницаНачалаОтправки.Получить()) Тогда	
	//	Константы.УДАЛИТЬ_ОтправлятьСМСПриИзмененииДатыМонтажаГраницаНачалаОтправки.Установить(1);
	//КонецЕсли;
	//Если Константы.ОтправлятьСМСОЗапланированномМонтаже.Получить() 
	//	И НЕ ЗначениеЗаполнено(Константы.ОтправлятьСМСОЗапланированномМонтажеГраницаНачалаОтправки.Получить()) Тогда	
	//	Константы.ОтправлятьСМСОЗапланированномМонтажеГраницаНачалаОтправки.Установить(1);
	//КонецЕсли;
	
	Константы.ВариантФормированияПФЗаказаПоставщику.Установить(4);
	
	//Перемещения товаров, которые созданы автоматически по монтажу
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСсылка.Ссылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДокументСсылка
	|ГДЕ
	|	НЕ ДокументСсылка.ПометкаУдаления
	|	И (ДокументСсылка.УДАЛИТЬ_ТаблицаНазначения = ""Товары""
	|		ИЛИ ДокументСсылка.УДАЛИТЬ_ТаблицаНазначения = ""Материалы"")";	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.ВерсияПрограммыЧисло = ОбщийМодульСервер.ПолучитьНомерВерсииЧислом(ВерсияПрограммы, 99);
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;	
	
	//Нужно заполнить реквизит "Документ" в Регистре накопления Взаиморасчеты с контрагентами
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентами.Регистратор КАК Ссылка,
	|	ВзаиморасчетыСКонтрагентами.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	|УПОРЯДОЧИТЬ ПО 
	|	ТипЗначения(ВзаиморасчетыСКонтрагентами.Регистратор)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.ВерсияПрограммыЧисло = ОбщийМодульСервер.ПолучитьНомерВерсииЧислом(ВерсияПрограммы, 99);
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	
	//запоминаем документы, которые нужно перепровести для формирования движений по регистру Продажи, для заполнения 2 новых измерений и 2 новых реквизитов
	//РТИУ, возвраты продукции и возвраты от покупателей
	//а так же у всех РТиУ, у которых в ТЧ "Товары" указана ссылка на заказ на производство, будет эта ссылка заменена на ссылку на заказ покуптеля, являющего основанием данного заказа на производство
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСсылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументСсылка.Дата,
	|	ДокументСсылка.Ссылка
	|ИЗ
	|	Документ.ВозвратПродукции КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументСсылка.Дата,
	|	ДокументСсылка.Ссылка
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.ВерсияПрограммыЧисло = ОбщийМодульСервер.ПолучитьНомерВерсииЧислом(ВерсияПрограммы, 99);
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//добавим все заказ-договоры для перевода на использование УИСтроки, а так же для очистки реквизитов "УДАЛИТЬ_ЗаказНаПроизводство"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказДоговор.Ссылка КАК Ссылка,
	|	ЗаказДоговор.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	НЕ ЗаказДоговор.ЗаполнятьУИСтрок";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.ВерсияПрограммыЧисло = ОбщийМодульСервер.ПолучитьНомерВерсииЧислом(ВерсияПрограммы, 99);
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//Начало ЗнП для создания по ним ЗП	
	//МенеджерВТ = Новый МенеджерВременныхТаблиц;
	//
	//ЗапросВТ = Новый Запрос;
	//ЗапросВТ.МенеджерВременныхТаблиц = МенеджерВТ;
	//ЗапросВТ.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Док.Ссылка КАК Ссылка,
	//|	Док.ТекущийСтатус КАК СтатусЗНП,
	//|	Док.ДокументОснование КАК ДокументОснование,
	//|	ВЫБОР
	//|		КОГДА Док.ПометкаУдаления
	//|			ТОГДА 2
	//|		КОГДА Док.Проведен
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК Состояние
	//|ПОМЕСТИТЬ ВТ_ЗНП_КОбработке
	//|ИЗ
	//|	Документ.ЗаказНаПроизводство КАК Док
	//|ГДЕ
	//|	(Док.ДокументОснование = НЕОПРЕДЕЛЕНО
	//|			ИЛИ Док.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	//|				И Док.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|			ИЛИ Док.ДокументОснование ССЫЛКА Документ.ЗаказДоговор
	//|			ИЛИ Док.ДокументОснование ССЫЛКА Документ.ЗаказНаПроизводство)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ДанныеТаблицы.Ссылка КАК Ссылка,
	//|	ДанныеТаблицы.Заказ КАК Заказ,
	//|	ДанныеТаблицы.Сумма КАК СуммаРТИУ
	//|ПОМЕСТИТЬ ВТ_ГрупповыеОтгрузкиВрем
	//|ИЗ
	//|	Документ.РеализацияТоваровИУслуг.Товары КАК ДанныеТаблицы
	//|ГДЕ
	//|	ДанныеТаблицы.Ссылка.ГрупповаяОтгрузка
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ДанныеТаблицы.Ссылка,
	//|	ДанныеТаблицы.Заказ,
	//|	ДанныеТаблицы.Сумма
	//|ИЗ
	//|	Документ.РеализацияТоваровИУслуг.Услуги КАК ДанныеТаблицы
	//|ГДЕ
	//|	ДанныеТаблицы.Ссылка.ГрупповаяОтгрузка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ГрупповыеОтгрузкиВрем.Ссылка КАК Ссылка,
	//|	ВТ_ГрупповыеОтгрузкиВрем.Заказ КАК Заказ,
	//|	СУММА(ВТ_ГрупповыеОтгрузкиВрем.СуммаРТИУ) КАК СуммаРТИУ
	//|ПОМЕСТИТЬ ВТ_ГрупповыеОтгрузки
	//|ИЗ
	//|	ВТ_ГрупповыеОтгрузкиВрем КАК ВТ_ГрупповыеОтгрузкиВрем
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ГрупповыеОтгрузкиВрем.Ссылка,
	//|	ВТ_ГрупповыеОтгрузкиВрем.Заказ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	РеализацияТоваровИУслуг.Ссылка КАК ДокРтиу,
	//|	РеализацияТоваровИУслуг.Основание КАК ДокОснование,
	//|	РеализацияТоваровИУслуг.СуммаДокумента КАК СуммаРТИУ
	//|ПОМЕСТИТЬ ВТ_ДокументыРеализацииВрем
	//|ИЗ
	//|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	//|ГДЕ
	//|	НЕ РеализацияТоваровИУслуг.ГрупповаяОтгрузка
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_ГрупповыеОтгрузки.Ссылка,
	//|	ВТ_ГрупповыеОтгрузки.Заказ,
	//|	ВТ_ГрупповыеОтгрузки.СуммаРТИУ
	//|ИЗ
	//|	ВТ_ГрупповыеОтгрузки КАК ВТ_ГрупповыеОтгрузки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ДокументыРеализацииВрем.ДокОснование КАК ДокОснование,
	//|	КОЛИЧЕСТВО(ВТ_ДокументыРеализацииВрем.ДокРтиу) КАК КоличествоРеализаций,
	//|	СУММА(ВТ_ДокументыРеализацииВрем.СуммаРТИУ) КАК СуммаРтиу
	//|ПОМЕСТИТЬ ВТ_ДокументыРеализации
	//|ИЗ
	//|	ВТ_ДокументыРеализацииВрем КАК ВТ_ДокументыРеализацииВрем
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ДокументыРеализацииВрем.ДокОснование";
	//
	//ЗапросВТ.Выполнить();
	//
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВТ_ЗНП_КОбработке.Ссылка КАК Ссылка,
	//|	ВТ_ЗНП_КОбработке.Состояние КАК СостояниеЗНП,
	//|	ВТ_ЗНП_КОбработке.СтатусЗНП КАК СтатусЗНП,
	//|	ЕСТЬNULL(ВТ_ДокументыРеализации.СуммаРтиу, 0) КАК СуммаРТИУ,
	//|	ВТ_ЗНП_КОбработке.Ссылка.СуммаДокумента КАК СуммаЗаказа
	//|ИЗ
	//|	ВТ_ЗНП_КОбработке КАК ВТ_ЗНП_КОбработке
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыРеализации КАК ВТ_ДокументыРеализации
	//|		ПО ВТ_ЗНП_КОбработке.Ссылка = ВТ_ДокументыРеализации.ДокОснование
	//|ГДЕ
	//|	ЕСТЬNULL(ВТ_ДокументыРеализации.КоличествоРеализаций, 0) = 1
	//|	И ЕСТЬNULL(ВТ_ДокументыРеализации.СуммаРтиу, 0) = ВТ_ЗНП_КОбработке.Ссылка.СуммаДокумента";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
	//	НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
	//		
	//	НоваяЗапись = НаборЗаписей.Добавить(); 
	//	НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
	//	НоваяЗапись.Документ = Выборка.Ссылка; 
	//	НоваяЗапись.ДокументДата = Выборка.Дата; 
	//	
	//	НаборЗаписей.Записать(Истина);		
	//	
	//КонецЦикла;	
	//
	//Запрос = Новый Запрос;	
	//Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВТ_ЗНП_КОбработке.Ссылка КАК Ссылка,
	//|	ВТ_ЗНП_КОбработке.Состояние КАК СостояниеЗНП,
	//|	ВТ_ЗНП_КОбработке.СтатусЗНП КАК СтатусЗНП,
	//|	ЕСТЬNULL(ВТ_ДокументыРеализации.КоличествоРеализаций, 0) КАК КоличествоРеализаций,
	//|	ЕСТЬNULL(ВТ_ДокументыРеализации.СуммаРтиу, 0) КАК СуммаРТИУ,
	//|	ВТ_ЗНП_КОбработке.Ссылка.СуммаДокумента КАК СуммаЗаказа
	//|ИЗ
	//|	ВТ_ЗНП_КОбработке КАК ВТ_ЗНП_КОбработке
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыРеализации КАК ВТ_ДокументыРеализации
	//|		ПО ВТ_ЗНП_КОбработке.Ссылка = ВТ_ДокументыРеализации.ДокОснование
	//|ГДЕ
	//|	ЕСТЬNULL(ВТ_ДокументыРеализации.КоличествоРеализаций, 0) > 1
	//|	И ЕСТЬNULL(ВТ_ДокументыРеализации.СуммаРтиу, 0) = ВТ_ЗНП_КОбработке.Ссылка.СуммаДокумента";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
	//	НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
	//		
	//	НоваяЗапись = НаборЗаписей.Добавить(); 
	//	НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
	//	НоваяЗапись.Документ = Выборка.Ссылка; 
	//	НоваяЗапись.ДокументДата = Выборка.Дата; 
	//	
	//	НаборЗаписей.Записать(Истина);			
	//	
	//КонецЦикла;
	//Конец ЗнП для создания по ним ЗП	
	
	//переделаем расширенные правила загрузки из построителя, если они были определены для ТЧ Товары ЗнП - теперь они долдны использваться для ЗП
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ПараметрФайла КАК ПараметрФайла,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.Номенклатура КАК Номенклатура,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ВидЗаказа КАК ВидЗаказа,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ТабличнаяЧастьЗаказа КАК ТабличнаяЧастьЗаказа,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ПараметрФайлаДляОбработкиЗначения КАК ПараметрФайлаДляОбработкиЗначения,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ЗначениеПараметраДляОбработки КАК ЗначениеПараметраДляОбработки,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ЭтоПравилоБезПараметра КАК ЭтоПравилоБезПараметра,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.Коэффициент КАК Коэффициент,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ОбщееКоличество КАК ОбщееКоличество,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.НеДействует КАК НеДействует,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ОкруглятьКоличество КАК ОкруглятьКоличество,
	//|	ПравилаОбработкиФайлаПрограммыПостроителя.ПорядокОкругления КАК ПорядокОкругления,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ВариантОпределенияКоличества КАК ВариантОпределенияКоличества,
	|	ПравилаОбработкиФайлаПрограммыПостроителя.КлючУникальности КАК КлючУникальности
	|ИЗ
	|	РегистрСведений.ПравилаОбработкиФайлаПрограммыПостроителя КАК ПравилаОбработкиФайлаПрограммыПостроителя
	|ГДЕ
	|	ПравилаОбработкиФайлаПрограммыПостроителя.ВидЗаказа = &ВидЗаказа";
	// обрабатывает все ТЧ
	//|	И (ПравилаОбработкиФайлаПрограммыПостроителя.ТабличнаяЧастьЗаказа = &ТЧ_Товары ИЛИ ПравилаОбработкиФайлаПрограммыПостроителя.ТабличнаяЧастьЗаказа = &ТЧ_Услуги)";
	Запрос.УстановитьПараметр("ВидЗаказа",Перечисления.ВидыЗаказов.ЗаказНаПроизводство);
	Запрос.УстановитьПараметр("ТЧ_Товары","Товары");
	Запрос.УстановитьПараметр("ТЧ_Услуги","Услуги");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
		
		 	НаборЗаписей = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьНаборЗаписей();
           	НаборЗаписей.Отбор.ПараметрФайла.Установить(Выборка.ПараметрФайла);
			НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			НаборЗаписей.Отбор.ВидЗаказа.Установить(Выборка.ВидЗаказа);
			НаборЗаписей.Отбор.ТабличнаяЧастьЗаказа.Установить(Выборка.ТабличнаяЧастьЗаказа);
			НаборЗаписей.Отбор.ПараметрФайлаДляОбработкиЗначения.Установить(Выборка.ПараметрФайлаДляОбработкиЗначения);
			НаборЗаписей.Отбор.ЗначениеПараметраДляОбработки.Установить(Выборка.ЗначениеПараметраДляОбработки);
			НаборЗаписей.Отбор.ЕдиницаИзмерения.Установить(Выборка.ЕдиницаИзмерения);
			НаборЗаписей.Отбор.ЭтоПравилоБезПараметра.Установить(Выборка.ЭтоПравилоБезПараметра);
			НаборЗаписей.Прочитать();
			
            НовыйНабор = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьНаборЗаписей();
           	НовыйНабор.Отбор.ПараметрФайла.Установить(Выборка.ПараметрФайла);
			НовыйНабор.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			НовыйНабор.Отбор.ВидЗаказа.Установить(Перечисления.ВидыЗаказов.ЗаказПокупателя);
			Если Выборка.ТабличнаяЧастьЗаказа = "Услуги" Тогда
				НовыйНабор.Отбор.ТабличнаяЧастьЗаказа.Установить("Товары");
			Иначе
				НовыйНабор.Отбор.ТабличнаяЧастьЗаказа.Установить(Выборка.ТабличнаяЧастьЗаказа);
			КонецЕсли;
			НовыйНабор.Отбор.ПараметрФайлаДляОбработкиЗначения.Установить(Выборка.ПараметрФайлаДляОбработкиЗначения);
			НовыйНабор.Отбор.ЗначениеПараметраДляОбработки.Установить(Выборка.ЗначениеПараметраДляОбработки);
			НовыйНабор.Отбор.ЕдиницаИзмерения.Установить(Выборка.ЕдиницаИзмерения);
			НовыйНабор.Отбор.ЭтоПравилоБезПараметра.Установить(Выборка.ЭтоПравилоБезПараметра);

            ВременнаяТаблица = НаборЗаписей.Выгрузить();
            ВременнаяТаблица.ЗаполнитьЗначения(Перечисления.ВидыЗаказов.ЗаказПокупателя, "ВидЗаказа");
			Если Выборка.ТабличнаяЧастьЗаказа = "Услуги" Тогда
				ВременнаяТаблица.ЗаполнитьЗначения("Товары", "ТабличнаяЧастьЗаказа");
			КонецЕсли;
            НовыйНабор.Загрузить(ВременнаяТаблица);
			
			НаборЗаписей.Очистить();
			
			НовыйНабор.Записать();
            НаборЗаписей.Записать();
			
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	#Область ЗаказПокупателей_НомераПотолков
	
	//поместим все заказы покупателей в версию после обработки основных изменений на 2.0, чтобы по ним были заполнены УИСтроки и УИСтрокиРодителя, если по какой-то причине этого не было сделано до этого
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить("2.0.0.$e"); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = "2.0.0.$e"; 
		НоваяЗапись.ВерсияПрограммыЧисло = ОбщийМодульСервер.ПолучитьНомерВерсииЧислом(ВерсияПрограммы, 8);
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;

	
	//добавим все заказы покупателей, чтобы перезаполнить в них реквизит "НомераПотолков"
	//так же заполним количество к выработке в ЗП по данным ЗНП
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.Дата КАК Дата,
	|	ЗаказПокупателя.ТекущийСтатус КАК ТекущийСтатус
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияПрограммы.Установить(ВерсияПрограммы); 
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка); 
			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВерсияПрограммы = ВерсияПрограммы; 
		НоваяЗапись.ВерсияПрограммыЧисло = ОбщийМодульСервер.ПолучитьНомерВерсииЧислом(ВерсияПрограммы);
		НоваяЗапись.Документ = Выборка.Ссылка; 
		НоваяЗапись.ДокументДата = Выборка.Дата; 
		
		НаборЗаписей.Записать(Истина);
		
		//если заказ в работе, сразу заполним в нем "количество к выработке"
		Если Выборка.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.ВРаботе Тогда
			ОбщийМодуль.ЗаполнитьВыработкуВЗаказеПокупателяПоЗаказуНаПроизводство(Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	#КонецОбласти
	
	
	#Область Корректировка_1
	
	//"Установка стоимости выработки" что создавались для РТиУ с основанием = ЗнП сменим основание на ЗП, 
	//т.к. РТиУ по ЗНП больше не будут оформляться, во всех ранее созданных по ЗнП РТиУ основание будет сменено на ЗП
	Запрос = Новый Запрос;
	Запрос.Текст= 
	"ВЫБРАТЬ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК УстановкаСтоимостиВыработкиПоНоменклатуре
	|ГДЕ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = &ВидДокументаРасчета
	|	И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаОснования = &ВидДокументаОснования
	|	И УстановкаСтоимостиВыработкиПоНоменклатуре.Проведен";
	Запрос.УстановитьПараметр("ВидДокументаРасчета",Справочники.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг);
	Запрос.УстановитьПараметр("ВидДокументаОснования",Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказНаПроизводство);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Попытка
		//	ДокОбъект = Выборка.Ссылка;
		//	ДокОбъект.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказПокупателя;
		//	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//КонецПопытки;
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказПокупателя;
		Попытка		
			Если ДокОбъект.Проведен Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Иначе
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			//ЗаписатьВИсторию("Записан документ " + Выборка.Ссылка);
		Исключение
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//ЗаписатьВИсторию("Ошибка изменения документа " + Выборка.Ссылка + ": " + ОписаниеОшибки(), Истина);
		КонецПопытки;
	КонецЦикла;
	
	#КонецОбласти
	
	
	// переход на 2.0
	
	#Область ОбеспечениеРозницы
	//попытка заполнения для РН ОбеспеченностьЗаказовРозницы 	
	// 2019-02-05 закомментирован статус, обрабатываем все ЗД
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказПокупателя КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И НЕ Док.Основание = ЗНАЧЕНИЕ(Документ.ЗаказДоговор.ПустаяСсылка)
	//|	И Док.Основание.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказДоговоров.ВРаботе)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Док.Ссылка,
	|	Док.Дата
	|ИЗ
	|	Документ.ЗаказПоставщику КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И НЕ Док.Основание = ЗНАЧЕНИЕ(Документ.ЗаказДоговор.ПустаяСсылка)
	//|	И Док.Основание.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказДоговоров.ВРаботе)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Док.Ссылка,
	|	Док.Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И НЕ Док.Основание = ЗНАЧЕНИЕ(Документ.ЗаказДоговор.ПустаяСсылка)
	//|	И Док.Основание.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказДоговоров.ВРаботе)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();		
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.$3", Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;

	#КонецОбласти

	
	#Область Замена_ЗнП_ЗП
	
	#Область ПерезаполнениеМатериалов
	//Перезаполнение материалов в документе ЗП, по ЗнП с видом Потолок и Типовой отрез	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	|	И НЕ Док.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И (Док.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка)
	|			ИЛИ Док.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ТиповоеПроизводство))";
	
	Выборка = Запрос.Выполнить().Выбрать();		
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.$5", Выборка.Ссылка, Выборка.Дата,, 2);				
	КонецЦикла;

	#КонецОбласти
	
	#Область ПоискЗНПБезРТИУНаСервере	
	
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ОбработкаОбновлений.ПолучитьЗНПКОбработке(МенеджерВТ);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ЗНП_КОбработке.Ссылка КАК СсылкаЗаказНаПроизводство,
	|	ВТ_ЗНП_КОбработке.Состояние КАК СостояниеЗНП,
	|	ВТ_ЗНП_КОбработке.СтатусЗНП КАК СтатусЗНП,
	|	ЕСТЬNULL(ВТ_ДокументыРеализации.СуммаРтиу, 0) КАК СуммаРТИУ,
	|	ВТ_ЗНП_КОбработке.Ссылка.СуммаДокумента КАК СуммаЗаказа
	|ИЗ
	|	ВТ_ЗНП_КОбработке КАК ВТ_ЗНП_КОбработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыРеализации КАК ВТ_ДокументыРеализации
	|		ПО ВТ_ЗНП_КОбработке.Ссылка = ВТ_ДокументыРеализации.ДокОснование
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ДокументыРеализации.КоличествоРеализаций, 0) = 0";
	
	Выборка = Запрос.Выполнить().Выбрать();		
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.$a", Выборка.СсылкаЗаказНаПроизводство, Выборка.СсылкаЗаказНаПроизводство.Дата,, 4);
	КонецЦикла;

	#КонецОбласти
	
	#Область ПроверкаНекашерныхЗнПИРТиУНаСервереВариант2	
	
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ОбработкаОбновлений.ПолучитьЗНПКОбработке(МенеджерВТ);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ЗНП_КОбработке.Ссылка КАК СсылкаЗаказНаПроизводство,
	|	ВТ_ЗНП_КОбработке.Состояние КАК СостояниеЗНП,
	|	ВТ_ЗНП_КОбработке.СтатусЗНП КАК СтатусЗНП,
	|	ЕСТЬNULL(ВТ_ДокументыРеализации.КоличествоРеализаций, 0) КАК КоличествоРеализаций,
	|	ЕСТЬNULL(ВТ_ДокументыРеализации.СуммаРтиу, 0) КАК СуммаРТИУ,
	|	ВТ_ЗНП_КОбработке.Ссылка.СуммаДокумента КАК СуммаЗаказа
	|ИЗ
	|	ВТ_ЗНП_КОбработке КАК ВТ_ЗНП_КОбработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыРеализации КАК ВТ_ДокументыРеализации
	|		ПО ВТ_ЗНП_КОбработке.Ссылка = ВТ_ДокументыРеализации.ДокОснование
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ДокументыРеализации.КоличествоРеализаций, 0) >= 1
	|	И ЕСТЬNULL(ВТ_ДокументыРеализации.СуммаРтиу, 0) <> ВТ_ЗНП_КОбработке.Ссылка.СуммаДокумента";
	
	Выборка = Запрос.Выполнить().Выбрать();		
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.$b", Выборка.СсылкаЗаказНаПроизводство, Выборка.СсылкаЗаказНаПроизводство.Дата,, 5);				
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ПоискЗНПОдинРТИУНаСервере
	
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ОбработкаОбновлений.ПолучитьЗНПКОбработке(МенеджерВТ);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ЗНП_КОбработке.Ссылка КАК СсылкаЗаказНаПроизводство,
	|	ВТ_ЗНП_КОбработке.Состояние КАК СостояниеЗНП,
	|	ВТ_ЗНП_КОбработке.СтатусЗНП КАК СтатусЗНП,
	|	ЕСТЬNULL(ВТ_ДокументыРеализации.СуммаРтиу, 0) КАК СуммаРТИУ,
	|	ВТ_ЗНП_КОбработке.Ссылка.СуммаДокумента КАК СуммаЗаказа
	|ИЗ
	|	ВТ_ЗНП_КОбработке КАК ВТ_ЗНП_КОбработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыРеализации КАК ВТ_ДокументыРеализации
	|		ПО ВТ_ЗНП_КОбработке.Ссылка = ВТ_ДокументыРеализации.ДокОснование
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ДокументыРеализации.КоличествоРеализаций, 0) = 1
	|	И ЕСТЬNULL(ВТ_ДокументыРеализации.СуммаРтиу, 0) = ВТ_ЗНП_КОбработке.Ссылка.СуммаДокумента";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.$c", Выборка.СсылкаЗаказНаПроизводство, Выборка.СсылкаЗаказНаПроизводство.Дата,, 6);				
	КонецЦикла;

	#КонецОбласти
	
	#Область ПоискЗНПНесколькоРТИУНаСервере
		
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ОбработкаОбновлений.ПолучитьЗНПКОбработке(МенеджерВТ);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ЗНП_КОбработке.Ссылка КАК СсылкаЗаказНаПроизводство,
	|	ВТ_ЗНП_КОбработке.Состояние КАК СостояниеЗНП,
	|	ВТ_ЗНП_КОбработке.СтатусЗНП КАК СтатусЗНП,
	|	ЕСТЬNULL(ВТ_ДокументыРеализации.КоличествоРеализаций, 0) КАК КоличествоРеализаций,
	|	ЕСТЬNULL(ВТ_ДокументыРеализации.СуммаРтиу, 0) КАК СуммаРТИУ,
	|	ВТ_ЗНП_КОбработке.Ссылка.СуммаДокумента КАК СуммаЗаказа
	|ИЗ
	|	ВТ_ЗНП_КОбработке КАК ВТ_ЗНП_КОбработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыРеализации КАК ВТ_ДокументыРеализации
	|		ПО ВТ_ЗНП_КОбработке.Ссылка = ВТ_ДокументыРеализации.ДокОснование
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ДокументыРеализации.КоличествоРеализаций, 0) > 1
	|	И ЕСТЬNULL(ВТ_ДокументыРеализации.СуммаРтиу, 0) = ВТ_ЗНП_КОбработке.Ссылка.СуммаДокумента";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.$d", Выборка.СсылкаЗаказНаПроизводство, Выборка.СсылкаЗаказНаПроизводство.Дата,, 7);				
	КонецЦикла; 
	
	#КонецОбласти
	
	#КонецОбласти
	
	//в спр.УчетныеЗаписиЭлектронойПочты добавился реквизит настройки способа определения рекланмого источника. проставим значение по умолчанию
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка,
	|	УчетныеЗаписиЭлектроннойПочты.РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя КАК РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя,
	|	УчетныеЗаписиЭлектроннойПочты.РекламныйИсточник_Статичный КАК РекламныйИсточник_Статичный,
	|	УчетныеЗаписиЭлектроннойПочты.РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма КАК РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.СоздаватьВходящиеКонтакты";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя
			И НЕ Выборка.РекламныйИсточник_Статичный
			И НЕ Выборка.РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма
			Тогда
			Попытка
				СпрОб = Выборка.Ссылка.ПолучитьОбъект();
				СпрОб.РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма = Истина;
				СпрОб.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ИспользоватьОтправкуСМС = РаботаССМС.ИспользоватьОтправкуСМС();
	Если ИспользоватьОтправкуСМС Тогда
		// признак отправки смс по ЗНП
		СМСОтправлятьПриПереводеВСтатусПроизведен = РаботаССМС.ОтправлятьСМСКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен();
		Если СМСОтправлятьПриПереводеВСтатусПроизведен Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаказНаПроизводство КАК Док
			|ГДЕ
			|	Док.Проведен
			|	И Док.ТекущийСтатус В (
			|		ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Новый), 
			|		ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.ВПроизводстве), 
			|		ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Подтвержден)
			|)";
			
			Выборка = Запрос.Выполнить().Выбрать();	
			Пока Выборка.Следующий() Цикл			
				ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ДокОбъект.СМСОтправлятьПриПереводеВСтатусПроизведен = Истина;
				Попытка						
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);				
				Исключение
				КонецПопытки;			
			КонецЦикла
		КонецЕсли;
		
		// признак отправки смс по монтажам
		СМСОтправлятьПриНазначенииМонтажа    = РаботаССМС.ОтправлятьСМСОЗапланированномМонтаже();
		СМСОтправлятьПриИзмененииДатыМонтажа = РаботаССМС.ОтправлятьСМСПриИзмененииДатыМонтажа();
		
		Если СМСОтправлятьПриНазначенииМонтажа ИЛИ СМСОтправлятьПриИзмененииДатыМонтажа Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.Монтаж КАК Док
			|ГДЕ
			|	Док.Проведен
			|	И Док.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.ВРаботе))";
			
			Выборка = Запрос.Выполнить().Выбрать();	
			Пока Выборка.Следующий() Цикл			
				ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ДокОбъект.СМСОтправлятьПриНазначенииМонтажа = СМСОтправлятьПриНазначенииМонтажа;
				ДокОбъект.СМСОтправлятьПриИзмененииДатыМонтажа = СМСОтправлятьПриИзмененииДатыМонтажа;
				Попытка						
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);				
				Исключение
				КонецПопытки;			
			КонецЦикла
		КонецЕсли;
		
		// признак отправки смс по лидам
		СМСОтправлятьЗамерщикуПриПланированииЗамера = Константы.ОтправлятьСМСЗамерщикуПриПланированииЗамера.Получить();
		СМСОтправлятьКлиентуПриПланированииЗамера   = Константы.ОтправлятьСМСКлиентуПриПланированииЗамера.Получить();
		
		Если СМСОтправлятьПриНазначенииМонтажа ИЛИ СМСОтправлятьПриИзмененииДатыМонтажа Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.Лид КАК Док
			|ГДЕ
			|	Док.Проведен
			|	И Док.ТекущийСтатус В (
			|		ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера), 
			|		ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НазначитьЗамер), 
			|		ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор), 
			|		ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер),
			|		ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОформитьДоговор)
			|)";
			
			Выборка = Запрос.Выполнить().Выбрать();	
			Пока Выборка.Следующий() Цикл			
				ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ДокОбъект.СМСОтправлятьЗамерщикуПриПланированииЗамера = СМСОтправлятьЗамерщикуПриПланированииЗамера;
				ДокОбъект.СМСОтправлятьКлиентуПриПланированииЗамера = СМСОтправлятьКлиентуПриПланированииЗамера;
				Попытка						
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);				
				Исключение
				КонецПопытки;			
			КонецЦикла
		КонецЕсли;
		
	КонецЕсли;
	
	// ЗнП в статусе "Отгружен" переводим в статус "Произведен"
	// ЗнП в статусе "Новый", "Подтвержден" переводим в статус "ВПроизвостве"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЗНП_КОбработке.Ссылка КАК Ссылка,
	|	ВТ_ЗНП_КОбработке.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ВТ_ЗНП_КОбработке
	|ГДЕ
	|	ВТ_ЗНП_КОбработке.Проведен
	|	И ВТ_ЗНП_КОбработке.ТекущийСтатус В (ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Новый), 
	|										ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Подтвержден), ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Отгружен))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.0", Выборка.Ссылка, Выборка.Дата,, 99);				
	КонецЦикла;
	
	//для всех лидов "в работе" заполним РС "История лида" и очистим историю в самом документе.
	//а так же перенесем по ним автоматические скидки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.УДАЛИТЬ_ИсторияЛида.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Дата КАК Дата,
	|		Пользователь КАК Пользователь,
	|		Комментарий КАК Комментарий
	|	) КАК УДАЛИТЬ_ИсторияЛида,
	|	Док.УДАЛИТЬ_Звонки.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ID КАК ID,
	|		Дата КАК Дата
	|	) КАК УДАЛИТЬ_Звонки
	|ИЗ
	|	Документ.Лид КАК Док
	|ГДЕ
	|	Док.ТекущийСтатус В (ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера), ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НазначитьЗамер), ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор), ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер), ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОформитьДоговор))";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		ВыборкаИстории = Выборка.УДАЛИТЬ_ИсторияЛида.Выбрать();
		Пока ВыборкаИстории.Следующий() Цикл
			РегистрыСведений.ИсторияЛида.ДобавитьЗаписьВИсториюЛида(Выборка.Ссылка, ВыборкаИстории.Дата, ВыборкаИстории.Пользователь, Новый УникальныйИдентификатор, ВыборкаИстории.Комментарий);
		КонецЦикла;
		ВыборкаЗвонки = Выборка.УДАЛИТЬ_Звонки.Выбрать();
		Пока ВыборкаЗвонки.Следующий() Цикл
			РегистрыСведений.ЗвонкиЛида.ДобавитьЗаписьВЗвонкиЛида(Выборка.Ссылка, ВыборкаЗвонки.Дата, ВыборкаЗвонки.ID);
		КонецЦикла;
		
		ЛидОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЛидОбъект.УДАЛИТЬ_ИсторияЛида.Очистить();
		ЛидОбъект.УДАЛИТЬ_Звонки.Очистить();
		
		ЛидОбъект.Записать();
		
		ОбработкаОбновлений.ПеренестиАвтоматическиеСкидкиПослеОбновленияНа20(ЛидОбъект.ССылка);
	КонецЦикла;
	
	//все лиды не "в работе" поставим в очередь на перенос истории в РС после обновления.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата
	|ИЗ
	|	Документ.Лид КАК Док
	|ГДЕ
	|	Док.ТекущийСтатус НЕ В (ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера),
	|	ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НазначитьЗамер),
	|	ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор),
	|	ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер),
	|	ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОформитьДоговор))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.0", Выборка.Ссылка, Выборка.Дата,, 99);				
	КонецЦикла;
	
	//2019-01-11
	// РКО Выдача подотчетнику и Авансовый отчет для заполнения нового измерения регистра Расчеты с подотчетниками
	// + добавлены ПКО возврат от подотчетника и списание с Р/С выдача подотчетнику
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.0", Выборка.Ссылка, Выборка.Дата,, 99);				
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата
	|ИЗ
	|	Документ.АвансовыйОтчет КАК Док
	|ГДЕ
	|	Док.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.0", Выборка.Ссылка, Выборка.Дата,, 99);				
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПодотчетника)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.0", Выборка.Ссылка, Выборка.Дата,, 99);				
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.0", Выборка.Ссылка, Выборка.Дата,, 99);				
	КонецЦикла;
	
	// НастройкиСтатейДоходовРасходовПоУмолчанию
	Если Константы.ИспользоватьВедениеУчетаДоходовРасходов.Получить() Тогда
		РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.ЗаполнитьИзмерениеТипСтатьи();
		РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.ЗаполнитьРесурсСтатьяПоУмолчанию();
		РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.ЗаполнитьНастройкиПоУмолчанию(Ложь);
	КонецЕсли;
	
	//Заказы поставщикам и Поступление товаров, для новых движений в регистр накопления "Заказы розницы поставщикам"
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказПоставщику КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И НЕ Док.Основание = Значение(Документ.ЗаказДоговор.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.0", Выборка.Ссылка, Выборка.Дата,, 99);				
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И (Док.Основание ССЫЛКА Документ.ЗаказДоговор
	|		И НЕ Док.Основание = Значение(Документ.ЗаказДоговор.ПустаяСсылка))
	|	ИЛИ (Док.Основание.Основание ССЫЛКА Документ.ЗаказДоговор
	|		И НЕ Док.Основание.Основание = Значение(Документ.ЗаказДоговор.ПустаяСсылка))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.0.0", Выборка.Ссылка, Выборка.Дата,, 99);				
	КонецЦикла;
	
	//возврат товара поставщику для создания движений по регистру ЗаказыПоставщикам
	// ниже имеется более широкая обработка ОбработкаОбновлений.ДобавитьДокументыРНЗаказыПоставщикам_Версия2000();
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Док.Ссылка КАК Ссылка,
	//|	Док.Дата КАК Дата
	//|ИЗ
	//|	Документ.ВозвратТовараПоставщику КАК Док
	//|ГДЕ
	//|	Док.Проведен
	//|	И ТИПЗНАЧЕНИЯ(Док.Основание) = ТИП(Документ.ПоступлениеТоваровИУслуг)
	//|	И НЕ Док.Основание = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровИУслуг.ПустаяСсылка)
	//|	И ТИПЗНАЧЕНИЯ(Док.Основание.Основание) = ТИП(Документ.ЗаказПоставщику)
	//|	И НЕ Док.Основание.Основание = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	ПоместитьВРегистрКОбработке("2.0.0.0", Выборка.Ссылка, Выборка.Дата);				
	//КонецЦикла;
	
	// ЗнП и ВП для обновление записей регистра ЗаказыПокупателейВПроизводстве
	ОбработкаОбновлений.ДобавитьЗНПиВП_Версия2001();
	
	// ЗнП и ВП для обновленеи записей регистра ЗаказыПокупателейВПроизводстве
	ОбработкаОбновлений.ДобавитьЗаказыПокупателейРаботе_Версия2001();
	
	//для замены ссылки на ЗНП в ТЧ "Товары" РТиУ на основание данного ЗНП - ЗП
	ОбработкаОбновлений.ДобавитьРТиУсЗНП_Версия2001();
	
	// для заполнения служебных реквизитов по учету бонусов
	ОбработкаОбновлений.ДобавитьРТиУСБонусами_Версия200S7();
	
	// Заполнить реквизит "СуммаВВалюдеДокумента" в ТЧ "Распределение платежа" для ППВ, ПКО, ОБК
	// Заполнить реквизит "Валюта" в ОБК
	ОбработкаОбновлений.ДобавитьДокументыОплат_Версия200S7();
	
	ОбработкаОбновлений.ДобавитьДокументыПродаж_Версия2002();
	
	//заполнение новых измерений РН ЗаказыПоставщикам
	ОбработкаОбновлений.ДобавитьДокументыРНЗаказыПоставщикам_Версия2000();
	
	// Заполнить реквизит "СлужебныйКонтролироватьЗаполнениеЗаявки" 
	ОбработкаОбновлений.ДобавитьДокументыПоЗаявкамНаРасходДС_Версия200S7();
	
КонецПроцедуры	

#КонецОбласти

#Область Обновление_2_0_1_0

Процедура ОбработкаОбновления_2_0_1_0() Экспорт
	
	ВерсияПрограммы = "2.0.1.0";
	
	
	// #4990
	ОбработатьРеквизитыПорядокОкругления();
	
	// заявка 4160
	Константы.ЗапретПроведенияДокументовБудущимЧислом.Установить(Истина); 
		
	//Во всех документах Установка выработки необходимо убрать галочку "От прибыли"	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ	
	|	ДокументСсылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен";	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокСсылка = Выборка.Ссылка;
		
		ТребуетсяЗапись = Ложь;
		Для Каждого ТекущаяСтрока Из ДокСсылка.ВыработкаПоВидамНоменклатуры Цикл
			Если ТекущаяСтрока.ОтПрибыли Тогда			
				ТребуетсяЗапись = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если НЕ ТребуетсяЗапись Тогда
			Для Каждого ТекущаяСтрока Из ДокСсылка.ВыработкаПоНоменклатуре Цикл
				Если ТекущаяСтрока.ОтПрибыли Тогда
					ТребуетсяЗапись = Истина;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
		
		Если ТребуетсяЗапись Тогда
			ПоместитьВРегистрКОбработке("2.0.1.0", Выборка.Ссылка, Выборка.Дата);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Константы.УДАЛИТЬ_ЗавершатьОдноименныеСессии.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.Наименование = ""Администратор""
		|	И НЕ Пользователи.Наименование = ""УстановкаОбновлений""";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СпрОб = Выборка.Ссылка.ПолучитьОбъект();
			СпрОб.ЗавершатьОдноименныеСеансыПользователяНаСервере = Истина;
			СпрОб.Записать();
		КонецЦикла;
	КонецЕсли;
	
	// Замеры в документе Лид у которых реквизит Отменен был = ИСТИНА и результат замера был пустой, проставить значение реквизита "РезультатЗамера" = "Замер отменен"
	// UPD: Все лиды, по которым есть замеры
	// Так же в ТЧ "Замеры" при записи будет заполнен реквизит УИСтроки для присвоения каждому замеру УникальногоИдентификатора для мобильного клиента
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ	
	|	ДокументСсылка.Ссылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лид.Замеры КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Ссылка.Проведен";
	//|	И ДокументСсылка.УДАЛИТЬ_Отменен // UPD: Все лиды, по которым есть замеры
	//|	И ДокументСсылка.РезультатЗамера = Значение(Справочник.РезультатЗамераЛида.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке("2.0.1.0", Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// Новое измерение "КоличествоПоФакту" в РН ОбеспечениеЗаказовРозницы	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ	
	|	ДокументСсылка.Дата КАК Дата,
	|	ДокументСсылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВозвратТовараПоставщику КАК ДокументСсылка
	|ГДЕ
	|	ДокументСсылка.Проведен
	|	И ДокументСсылка.Основание ССЫЛКА Документ.ПоступлениеТоваровИУслуг
	|	И НЕ ДокументСсылка.Основание = Значение(Документ.ПоступлениеТоваровИУслуг.ПустаяСсылка)
	|	И ДокументСсылка.Основание.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И НЕ ДокументСсылка.Основание.Основание = Значение(Документ.ЗаказДоговор.ПустаяСсылка)
	|
	| ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ	
	|	ДокументСсылка1.Дата КАК Дата,
	|	ДокументСсылка1.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДокументСсылка1
	|ГДЕ
	|	ДокументСсылка1.Проведен
	|	И ДокументСсылка1.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И НЕ ДокументСсылка1.Основание = Значение(Документ.ЗаказДоговор.ПустаяСсылка)	
	|
	| ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ	
	|	ДокументСсылка2.Дата КАК Дата,
	|	ДокументСсылка2.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ДокументСсылка2
	|ГДЕ
	|	ДокументСсылка2.Проведен
	|	И ДокументСсылка2.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И НЕ ДокументСсылка2.Основание = Значение(Документ.ЗаказДоговор.ПустаяСсылка)
	|
	| ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ	
	|	ДокументСсылка3.Дата КАК Дата,
	|	ДокументСсылка3.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ДокументСсылка3
	|ГДЕ
	|	ДокументСсылка3.Проведен
	|	И ДокументСсылка3.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И НЕ ДокументСсылка3.Основание = Значение(Документ.ЗаказДоговор.ПустаяСсылка)";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.1.0", Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// заполнение реквизита СлужебныйКоличествоКСписаниюНеСоответствуетКоличествуПроданного для документа Монтаж
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке("2.0.1.0", Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;

	// ВозвратТовараОтПокупателя - заполнение реквизита "Вариант распределения себестоимости" в ТЧ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке("2.0.1.0", Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// выпуски с ОстатокПленки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыпускПродукцииМатериалы.Ссылка.Дата КАК Дата,
	|	ВыпускПродукцииМатериалы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции.Материалы КАК ВыпускПродукцииМатериалы
	|ГДЕ
	|	ВыпускПродукцииМатериалы.ЕдиницаИзмерения = ЗНАЧЕНИЕ(справочник.единицыизмерений.пустаяссылка)
	|	И ВыпускПродукцииМатериалы.Номенклатура = ЗНАЧЕНИЕ(справочник.номенклатура.ОстаткиПленки)
	|	И ВыпускПродукцииМатериалы.Ссылка.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке("2.0.1.0", Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// документы оплаты для переноса реквизита "УДАЛИТЬ_Основание"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.УДАЛИТЬ_Основание.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.ОплатаБанковскойКартой КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.УДАЛИТЬ_Основание.Ссылка ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке("2.0.1.0", Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// заполнение нового измерения "Документ начисления"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейРозницы КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ОбъектВыработки.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.Регистратор.Дата
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейПроизводства КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ОбъектВыработки.Ссылка ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// в документе "Оплата банковской картой" заполняем новый реквизит ВидОперации
	Запрос = новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Док.Ссылка,
		|	Док.Дата
		|ИЗ
		|   Документ.ОплатаБанковскойКартой КАК Док		
		|ГДЕ
		|   Док.ВидОперации = Значение(Перечисление.ВидыОперацийОплатаБанковскойКартой.ПустаяСсылка)
		|   И Док.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// #4548	
	//// Установка статей доходов по виду операций для ОБК 
	//// В предыдущей без операции, устанавливаем вид операции ОБК
	//НаборЗаписей = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.ТипДокумента.Установить("ОплатаБанковскойКартой");	
	//НаборЗаписей.Отбор.ТипСтатьи.Установить(Перечисления.ТипыСтатейДоходовРасходов.Доход);
	//НаборЗаписей.Прочитать();
	//	
	//Для Каждого ТекущаяСтрока Из НаборЗаписей Цикл
	//	Если ТекущаяСтрока.ВидОперации = Неопределено Тогда
	//		НоваяЗапись = НаборЗаписей[0]; 		
	//		НоваяЗапись.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой; 		
	//		НаборЗаписей.Записать();
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//
	////Добавляем новую операцию
	//НаборЗаписей = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.ТипДокумента.Установить("ОплатаБанковскойКартой");
	//НаборЗаписей.Отбор.ВидОперации.Установить(Перечисления.ВидыОперацийОплатаБанковскойКартой.Кредит);	
	//НаборЗаписей.Отбор.ТипСтатьи.Установить(Перечисления.ТипыСтатейДоходовРасходов.Доход);
	//
	//Если НаборЗаписей.Количество() = 0 Тогда
	//	НоваяЗапись = НаборЗаписей.Добавить(); 
	//	НоваяЗапись.ТипДокумента 			= "ОплатаБанковскойКартой"; 
	//	НоваяЗапись.ВидОперации 			= Перечисления.ВидыОперацийОплатаБанковскойКартой.Кредит; 		
	//	НоваяЗапись.ТипСтатьи 				= Перечисления.ТипыСтатейДоходовРасходов.Доход;
	//	НоваяЗапись.СтатьяДоходовРасходов 	= Справочники.СтатьиДоходовИРасходов.Продажи;
	//	НоваяЗапись.СтатьяДоходовРасходовПоУмолчанию = Справочники.СтатьиДоходовИРасходов.Продажи;
	//	НаборЗаписей.Записать();
	//КонецЕсли;
	
	// #5245 Пока закомментировали код выше по заявке 4548, т.к. решили выполнить общую команду по установке всех статей по умолчанию
	РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.ЗаполнитьНастройкиПоУмолчанию(Истина);
	Справочники.СтатьиДоходовИРасходов.ЗаполнитьИспользованиеСтатейВУчетеДоходовИРасходовПоУмолчанию();
	
	// #2109 Лиды из регистра "Замеры", для заполнения нового реквизита "Дата назначения замера"
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Замеры.Регистратор КАК Ссылка,
		|	Замеры.Регистратор.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.Замеры КАК Замеры
		|ГДЕ
		|	Замеры.Регистратор ССЫЛКА Документ.Лид";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;	
	
	
КонецПроцедуры

Процедура ОбработатьРеквизитыПорядокОкругления() Экспорт
	
	// константы
	Если ЗначениеЗаполнено(Константы.УДАЛИТЬ_ПорядокОкругленияСтоимостиПотолков.Получить()) Тогда			
		Порядок = Число(Строка(Константы.УДАЛИТЬ_ПорядокОкругленияСтоимостиПотолков.Получить()));				
		Константы.ПорядокОкругленияЧисломСтоимостиПотолков.Установить(Порядок);
	КонецЕсли;	
	Если ЗначениеЗаполнено(Константы.УДАЛИТЬ_ПорядокОкругленияСтоимостиПотолковРозница.Получить()) Тогда			
		Порядок = Число(Строка(Константы.УДАЛИТЬ_ПорядокОкругленияСтоимостиПотолковРозница.Получить()));				
		Константы.ПорядокОкругленияЧисломСтоимостиПотолковРозница.Установить(Порядок);
	КонецЕсли;
	
	//переделаем расширенные правила загрузки из построителя
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.ПараметрФайла КАК ПараметрФайла,
	|	ДанныеРегистра.Номенклатура КАК Номенклатура,
	|	ДанныеРегистра.ВидЗаказа КАК ВидЗаказа,
	|	ДанныеРегистра.ТабличнаяЧастьЗаказа КАК ТабличнаяЧастьЗаказа,
	|	ДанныеРегистра.ПараметрФайлаДляОбработкиЗначения КАК ПараметрФайлаДляОбработкиЗначения,
	|	ДанныеРегистра.ЗначениеПараметраДляОбработки КАК ЗначениеПараметраДляОбработки,
	|	ДанныеРегистра.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеРегистра.ЭтоПравилоБезПараметра КАК ЭтоПравилоБезПараметра
	|ИЗ
	|	РегистрСведений.ПравилаОбработкиФайлаПрограммыПостроителя КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.УДАЛИТЬ_ПорядокОкругления <> ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругления.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПараметрФайла.Установить(Выборка.ПараметрФайла);
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		НаборЗаписей.Отбор.ВидЗаказа.Установить(Выборка.ВидЗаказа);
		НаборЗаписей.Отбор.ТабличнаяЧастьЗаказа.Установить(Выборка.ТабличнаяЧастьЗаказа);
		НаборЗаписей.Отбор.ПараметрФайлаДляОбработкиЗначения.Установить(Выборка.ПараметрФайлаДляОбработкиЗначения);
		НаборЗаписей.Отбор.ЗначениеПараметраДляОбработки.Установить(Выборка.ЗначениеПараметраДляОбработки);
		НаборЗаписей.Отбор.ЕдиницаИзмерения.Установить(Выборка.ЕдиницаИзмерения);
		НаборЗаписей.Отбор.ЭтоПравилоБезПараметра.Установить(Выборка.ЭтоПравилоБезПараметра);
		НаборЗаписей.Прочитать();
		
		Для каждого Запись из НаборЗаписей Цикл		
			Если ЗначениеЗаполнено(Запись.УДАЛИТЬ_ПорядокОкругления) Тогда			
				Порядок = Число(Строка(Запись.УДАЛИТЬ_ПорядокОкругления));				
				Запись.ПорядокОкругленияЧислом = Порядок;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	// спецификации
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Спецификации.Состав КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.УДАЛИТЬ_ПорядокОкругления <> ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругления.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для каждого СтрокаТЧ из СпрОбъект.Состав Цикл		
			Если ЗначениеЗаполнено(СтрокаТЧ.УДАЛИТЬ_ПорядокОкругления) Тогда			
				Порядок = Число(Строка(СтрокаТЧ.УДАЛИТЬ_ПорядокОкругления));				
				СтрокаТЧ.ПорядокОкругленияЧислом = Порядок;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			СпрОбъект.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры	
		
#КонецОбласти

#Область Обновление_2_0_2_0

Процедура ОбработкаОбновления_2_0_2_0() Экспорт
	
	ВерсияПрограммы = "2.0.2.0";
	
	// #5142
	Константы.ИспользоватьОбщиеДополнительныеЗначения.Установить(Истина);
	Константы.ИспользоватьОбщиеДополнительныеРеквизитыИСведения.Установить(Истина);
	
	// Заполнить реквизит Валюта регистра СоответствиеВидовЦенЦенамУслугРаскроя
	НаборЗаписей = РегистрыСведений.СоответствиеВидовЦенЦенамУслугРаскроя.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Для каждого ЗаписьРегистра из НаборЗаписей Цикл
		ЗаписьРегистра.Валюта = ЗаписьРегистра.ЦеныУслугРаскроя.Валюта;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
	// #5610 обнулить цены в установках цен услуг производства по интеркампани с одной организацией производства
	// просто перезаписываем, вся обработка в процедуре ПередЗаписью справочника
	// пока убрано (в рамках той же заявки)
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЦеныУслугРаскроя.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.ЦеныУслугРаскроя КАК ЦеныУслугРаскроя
	//	|ГДЕ
	//	|	ЦеныУслугРаскроя.ДляИнтеркампани
	//	|	И ЦеныУслугРаскроя.НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков";
	//	
	//Выборка = Запрос.Выполнить().Выбрать();	
	//Пока Выборка.Следующий() Цикл
	//	Попытка
	//		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
	//		СпрОбъект.Записать();
	//	Исключение
	//	КонецПопытки;
	//КонецЦикла;
	
	//#5456 Заполнение новой константы
	Константы.ОбеспеченностьРозницыПоЗаказДоговорам.Установить(Истина);
	
	//#5456 Заполнение служебного реквизита
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ОбеспечениеЗаказовРозницы.Заказ КАК Ссылка,
	//|	ОбеспечениеЗаказовРозницы.Заказ.Дата КАК Дата
	//|ИЗ
	//|	РегистрНакопления.ОбеспечениеЗаказовРозницы КАК ОбеспечениеЗаказовРозницы
	//|ГДЕ
	//|	ОбеспечениеЗаказовРозницы.Заказ ССЫЛКА Документ.ЗаказДоговор
	//|	И НЕ ОбеспечениеЗаказовРозницы.Заказ.Ссылка ЕСТЬ NULL";
	//
	//Выборка = Запрос.Выполнить().Выбрать();	
	//Пока Выборка.Следующий() Цикл
	//	ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	//КонецЦикла;           	

	//#5457 Заполнение новой константы
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Основание ССЫЛКА Документ.Монтаж
	|	И НЕ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеТоваров.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Константы.ИспользоватьВыдачуВозвратВДокументеМонтаж.Установить(Истина);
	КонецЕсли;	
	
	//#5768
	//Материал заказчика приведем к соответствующему виду
	НоменклатураПолотноЗаказчика = Справочники.Номенклатура.ПолотноЗаказчика;
	Если НЕ ЗначениеЗаполнено(НоменклатураПолотноЗаказчика.ВидНоменклатуры) ИЛИ НЕ ЗначениеЗаполнено(НоменклатураПолотноЗаказчика.БазоваяЕдиницаИзмерения) Тогда	
		НоменклатураОбъект = НоменклатураПолотноЗаказчика.ПолучитьОбъект();
		Если НЕ ЗначениеЗаполнено(НоменклатураПолотноЗаказчика.ВидНоменклатуры) Тогда
			НоменклатураОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоменклатураПолотноЗаказчика.БазоваяЕдиницаИзмерения) Тогда
			НоменклатураОбъект.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
		КонецЕсли;	
		Попытка
			НоменклатураОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	//#5768	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказПокупателя.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.ЕдиницаИзмерения = ДанныеДокумента.Номенклатура.БазоваяЕдиницаИзмерения
	|	И ДанныеДокумента.Номенклатура В (ЗНАЧЕНИЕ(Справочник.Номенклатура.ОстаткиПленки), ЗНАЧЕНИЕ(Справочник.Номенклатура.ПолотноЗаказчика))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.ЕдиницаИзмерения = ДанныеДокумента.Номенклатура.БазоваяЕдиницаИзмерения
	|	И ДанныеДокумента.Номенклатура В (ЗНАЧЕНИЕ(Справочник.Номенклатура.ОстаткиПленки), ЗНАЧЕНИЕ(Справочник.Номенклатура.ПолотноЗаказчика))";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// №5793
	НаборЗаписей = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидЗаказа.Установить(Перечисления.ВидыЗаказов.ЗаказДоговор);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		
		Для Каждого ТекущаяСтрока Из НаборЗаписей Цикл
			Если ТекущаяСтрока.ТабличнаяЧастьЗаказа = "Товары" ИЛИ ТекущаяСтрока.ТабличнаяЧастьЗаказа = "Услуги" Тогда
				ТекущаяСтрока.ТабличнаяЧастьЗаказа = "ТоварыУслуги";
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	//#5442
	Константы.ПереноситьВАрхивРасчетыПостроителяПроизводство.Установить(Истина);
	Константы.ПапкиОпределяютсяВКарточкеПользователяРозница.Установить(Константы.ИндивидуальныеКаталогиЗагрузкиЧертежейИзEasyCeiling.Получить());
	Константы.КаталогиЗагрузкиИзПостроителяУказываютНаПапкиСервера.Установить(НЕ Константы.УДАЛИТЬ_ИндивидуальныеКаталогиДляЗагрузкиИзПостроителяУказываютНаПапкиКлиента.Получить());
	
	//#5869	
	ЧасовойПоясПрограммы = Константы.ЧасовойПоясОбластиДанных.Получить();
	Если ПустаяСтрока(ЧасовойПоясПрограммы) Тогда
		ЧасовойПоясПрограммы = ЧасовойПояс();
	КонецЕсли;
	Если ЧасовойПоясПрограммы <> ПолучитьЧасовойПоясИнформационнойБазы() Тогда 
		//УстановитьПривилегированныйРежим(Истина);
		Попытка
			//ОбщегоНазначения.ЗаблокироватьИБ();
			УстановитьЧасовойПоясИнформационнойБазы(ЧасовойПоясПрограммы);
			Константы.ЧасовойПоясОбластиДанных.Установить(ЧасовойПоясПрограммы);
			//ОбщегоНазначения.РазблокироватьИБ();
			
			УстановитьЧасовойПоясСеанса(ЧасовойПоясПрограммы);
		Исключение
			ОбщегоНазначения.РазблокироватьИБ();
			ВызватьИсключение;
		КонецПопытки;
		//УстановитьПривилегированныйРежим(Ложь);		
	КонецЕсли;
	
	// №5782
	//Создан новый предопределенный элемент "КонтрагентРозницы" и "КонтрагентОпта" в справочнике "ГруппыДоступаККонтрагентам"
	//Нужно существующий с таким же кодом перенумеровать
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГруппыДоступаККонтрагентам.Ссылка				  
	               |ИЗ
	               |	Справочник.ГруппыДоступаККонтрагентам КАК ГруппыДоступаККонтрагентам
	               |ГДЕ
	               |	НЕ ГруппыДоступаККонтрагентам.Предопределенный
				   |	И (ГруппыДоступаККонтрагентам.Код = ""000000001""
				   |		ИЛИ ГруппыДоступаККонтрагентам.Код = ""000000002"")";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();			
			СпрОбъект.УстановитьНовыйКод();			
			СпрОбъект.Записать();
		Исключение
			//
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_0_3_0

Процедура ОбработкаОбновления_2_0_3_0() Экспорт
	
	ВерсияПрограммы = "2.0.3.0";
	
	// Порядки для версии
	//1 2.0.3.0
	//2 2.0.3.1
	//3 2.0.3.2
	//4 2.0.3.6
	//5 2.0.3.7
	
	Константы.РазрешитьРезервированиеОтсутствующегоТовара.Установить(Ложь);
	
	// #4645
	ПричинаНетДома = Справочники.ПричиныОтказаЗамера.НайтиПоНаименованию("Нет дома", Истина);
	Если ПричинаНетДома.Пустая() Тогда
		НовыйЭлемент = Справочники.ПричиныОтказаЗамера.СоздатьЭлемент();
		НовыйЭлемент.Наименование = "Нет дома";
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	// №5782
	//Создан новый предопределенный элемент "КонтрагентРозницы" и "КонтрагентОпта" в справочнике "ГруппыДоступаККонтрагентам"
	//Нужно существующий с таким же кодом перенумеровать
	// + №6293 добавлен новый предопределенный элемент "Общие"	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГруппыДоступаККонтрагентам.Ссылка				  
	               |ИЗ
	               |	Справочник.ГруппыДоступаККонтрагентам КАК ГруппыДоступаККонтрагентам
	               |ГДЕ
	               |	НЕ ГруппыДоступаККонтрагентам.Предопределенный
				   |	И (ГруппыДоступаККонтрагентам.Код = ""000000001""
				   |		ИЛИ ГруппыДоступаККонтрагентам.Код = ""000000002""
				   |		ИЛИ ГруппыДоступаККонтрагентам.Код = ""000000003"")
				   |";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();			
			СпрОбъект.УстановитьНовыйКод();			
			СпрОбъект.Записать();
		Исключение
			//
		КонецПопытки;
	КонецЦикла;
	
	// №1842 нужно у существующих документов установки стоимости выработки с видом Выпуск продукции и Вид потолка = Потолок
	// проставить галочки "ОднофактурныйПотолок" и "МногофактурныйПотолок"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Ссылка,
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Дата
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК УстановкаСтоимостиВыработкиПоНоменклатуре
	|ГДЕ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = Значение(Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции)
	|	И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидНоменклатурыПотолка = Значение(Справочник.ВидыНоменклатуры.Потолок)
	|   И УстановкаСтоимостиВыработкиПоНоменклатуре.Проведен";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	// №1842 нужно из справочника ПроизводственныеОперации перенести данные в документ Установка стоимости выработки
	ОбщийМодульСервер.ПереводСправочникаПроизводственныеОперацииВДокумент(ВерсияПрограммы);
	
	//#5263
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.ВидЦенПроизводство = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|	И НЕ ДанныеСправочника.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СпрОбъект.ВидЦенПроизводство = СпрОбъект.ВидЦен;
		Попытка			
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
		
	// #3762
	// распроведение документов "Поступление на расчетный счет" и "Списание с расчетного счета", у которых не стояла галочка "Оплачено".
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийГод", Год(ТекущаяДатаСеанса()));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.УДАЛИТЬ_Оплачено
	|	И ДанныеДокумента.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК ДанныеДокумента
	|ГДЕ
	|	(НЕ ДанныеДокумента.УДАЛИТЬ_Оплачено
	|	 И ДанныеДокумента.Проведен)
	|	ИЛИ НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ГОД) = &ТекущийГод"; // На основе найденных документов за текущий год создаются документы «Платежные поручения (исходящие)» (для сохранения сквозной нумерации при обмене с банком).

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	//#6233  в имени файла только имя, в расширении - только расширение, в расширении не должно быть точки.
	ЗапросМенеджер = Новый Запрос;
	ЗапросМенеджер.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПрикрепленныеДанные.Период КАК Период,
	//|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя КАК ВидФайлаПрограммыПостроителя,
	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК СсылкаНаОбъект
	//,
	//|	ПрикрепленныеДанные.ИмяФайла КАК ИмяФайла,
	//|	ПрикрепленныеДанные.Расширение КАК Расширение
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|
	//|УПОРЯДОЧИТЬ ПО
	//|	Период
	|";
	
	Выборка = ЗапросМенеджер.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// перенесено в пост-обработку
		ПоместитьВРегистрКОбработке("2.0.3.6", Выборка.СсылкаНаОбъект, ТекущаяДатаСеанса(),, 4);
		
		//МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
		//ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаМенеджер);
		//МенеджерЗаписи.Прочитать();	
		//
		//СтрДлинаРасширения = СтрДлина(МенеджерЗаписи.Расширение);
		//Если Прав(МенеджерЗаписи.ИмяФайла, СтрДлинаРасширения) = МенеджерЗаписи.Расширение Тогда
		//	МенеджерЗаписи.ИмяФайла = Лев(МенеджерЗаписи.ИмяФайла, СтрДлина(МенеджерЗаписи.ИмяФайла)-СтрДлинаРасширения);
		//КонецЕсли;
		//Если Лев(МенеджерЗаписи.Расширение, 1) = "." Тогда
		//	МенеджерЗаписи.Расширение = Сред(МенеджерЗаписи.Расширение, 2);	
		//КонецЕсли;
		//МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
	
	//#6233 
	// При обновлении на 2.0.3. анализировать прикрепленные файлы в рамках одного объекта и, если есть одноименные файлы, то переименовывать их добавляя индекс файла через дефис
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоФайлов,
	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК СсылкаНаОбъект,
	|	ПрикрепленныеДанные.ИмяФайла КАК ИмяФайла,
	|	ПрикрепленныеДанные.Расширение КАК Расширение
	|ПОМЕСТИТЬ ВТ_Файлы
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя = ЗНАЧЕНИЕ(Справочник.ВидыФайловПрограммыПостроителя.пустаяссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрикрепленныеДанные.СсылкаНаОбъект,
	|	ПрикрепленныеДанные.ИмяФайла,
	|	ПрикрепленныеДанные.Расширение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Файлы.КоличествоФайлов КАК КоличествоФайлов,
	|	ВТ_Файлы.СсылкаНаОбъект КАК СсылкаНаОбъект,
	|	ВТ_Файлы.ИмяФайла КАК ИмяФайла,
	|	ВТ_Файлы.Расширение КАК Расширение
	|ИЗ
	|	ВТ_Файлы КАК ВТ_Файлы
	|ГДЕ
	|	ВТ_Файлы.КоличествоФайлов > 1";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		// перенесено в пост-обработку
		ПоместитьВРегистрКОбработке("2.0.3.7", Выборка.СсылкаНаОбъект, ТекущаяДатаСеанса(),, 5);
		
	//	ЗапросМенеджер = Новый Запрос;
	//	ЗапросМенеджер.УстановитьПараметр("СсылкаНаОбъект", Выборка.СсылкаНаОбъект);
	//	ЗапросМенеджер.УстановитьПараметр("ИмяФайла", Выборка.ИмяФайла);
	//	ЗапросМенеджер.УстановитьПараметр("Расширение", Выборка.Расширение);
	//	ЗапросМенеджер.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПрикрепленныеДанные.Период КАК Период,
	//	|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя КАК ВидФайлаПрограммыПостроителя,
	//	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК СсылкаНаОбъект,
	//	|	ПрикрепленныеДанные.ИмяФайла КАК ИмяФайла,
	//	|	ПрикрепленныеДанные.Данные КАК Данные,
	//	|	ПрикрепленныеДанные.Расширение КАК Расширение
	//	|ИЗ
	//	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	//	|ГДЕ
	//	|	ПрикрепленныеДанные.СсылкаНаОбъект = &СсылкаНаОбъект
	//	|	И ПрикрепленныеДанные.ИмяФайла = &ИмяФайла
	//	|	И ПрикрепленныеДанные.Расширение = &Расширение
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Период";
	//	
	//	ВыборкаМенеджер = ЗапросМенеджер.Выполнить().Выбрать();
	//	Пока ВыборкаМенеджер.Следующий() Цикл			
	//		МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
	//		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаМенеджер);
	//		МенеджерЗаписи.Прочитать();	
	//
	//		МенеджерЗаписи.ИмяФайла = ОбщийМодульСервер.ПолучитьИмяФайлаПрикрепленныхДанных(МенеджерЗаписи.СсылкаНаОбъект, МенеджерЗаписи.ИмяФайла, МенеджерЗаписи.Расширение);
	//		МенеджерЗаписи.Записать(Истина);		
	//	КонецЦикла;
	КонецЦикла;	
	
	//#6347
	// В справочнике "Виды начислений" добавить реквизит "Неактивный". При обновлении на версию всем НЕ предопределенным значениям проставить Неактивный = Истина.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыНачислений КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.Предопределенный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.Неактивный = Истина;
		Попытка			
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	//#6347 При обновлении на версию поставить галочку "Не активный" для следующих предопределенных элементов видов исполнителей:
	//Ответственный в документе-основании заказа
	//Ответсвенный в документе
	//Менеджер в документе заказа
	//Менеджер в документе продажи
	//Монтажники....
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыИсполнителей КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.Ссылка В (ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.МенеджерВДокументеЗаказа), ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.МенеджерВДокументеПродажи), ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.Монтажники), ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.ОтветственныйВДокументеПродажи), ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.ОтветственныйВДокументеЗаказа), ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.ОтветственныйВОснованииЗаказа))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.Неактивный = Истина;
		Попытка			
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	//#6347 При обновлении на версию вид исполнителя "Млонтажник (...." переименовать в "Монтажник" как в конфигурторе, так и в режиме "Предприятие"
	//При обновлении на версию вид исполнителя "Раскройщики" переименовать в "Сотрудник производства" как в конфигурторе, так и в режиме "Предприятие"
	//При обновлении на версию вид исполнителя "Замерщик" переименовать в "Замерщик заказ-договора" как в конфигурторе, так и в режиме "Предприятие"
	СпрОбъект = Справочники.ВидыИсполнителей.Монтажник.ПолучитьОбъект();
	СпрОбъект.Наименование = "Монтажник";
	Попытка			
		СпрОбъект.Записать();
	Исключение
	КонецПопытки;
	СпрОбъект = Справочники.ВидыИсполнителей.СотрудникПроизводства.ПолучитьОбъект();
	СпрОбъект.Наименование = "Сотрудник производства";
	Попытка			
		СпрОбъект.Записать();
	Исключение
	КонецПопытки;СпрОбъект = Справочники.ВидыИсполнителей.ЗамерщикЗаказДоговора.ПолучитьОбъект();
	СпрОбъект.Наименование = "Замерщик заказ-договора";
	Попытка			
		СпрОбъект.Записать();
	Исключение
	КонецПопытки;
		
	//#6347 При обновлени на версию у всех ранее созданных документов "Установка стоимости выработки" по виду документа "Выпуск продукции", 
	//где стоял вид исполнителя "Ответственный в документе-основании заказа" заменить его на "Ответсвенный в заказе покупателя"
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции, 
		Справочники.ВидыИсполнителей.ОтветственныйВОснованииЗаказа, 
		Справочники.ВидыИсполнителей.АвторВЗаказеПокупателя);
		
	//#6347 При обновлени на версию у всех ранее созданных документов "Установка стоимости выработки" по виду документа "Заказ покупателя", 
	//где стоял вид исполнителя "Ответственный в документе" заменить его на "Ответсвенный в заказе покупателя"
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.ЗаказПокупателя, 
		Справочники.ВидыИсполнителей.ОтветственныйВДокументеПродажи, 
		Справочники.ВидыИсполнителей.АвторВЗаказеПокупателя);
		
	//#6347 При обновлении на версию 
	//у всех ранее созданных документов "Установка стоимости выработки" по виду документа "Лид", 
	//где стоял вид исполнителя "Ответственный в документе" заменить его на "Ответсвенный в лиде"
	//
	//у всех ранее созданных документов "Установка стоимости выработки" по виду документа "Монтаж", 
	//где стоял вид исполнителя "Ответственный в документе-основании заказа" заменить его на "Ответсвенный в лиде"
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.Лид, 
		Справочники.ВидыИсполнителей.ОтветственныйВДокументеПродажи, 
		Справочники.ВидыИсполнителей.АвторВЛиде);
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.Монтаж, 
		Справочники.ВидыИсполнителей.ОтветственныйВОснованииЗаказа, 
		Справочники.ВидыИсполнителей.АвторВЛиде);
		
	//#6347 При обновлени на версию у всех ранее созданных документов "Установка стоимости выработки" по виду документа "Монтаж", 
	//где стоял вид исполнителя "Ответсвенный в документе заказа" заменить его на "Ответсвенный заказ-договора"
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.Монтаж, 
		Справочники.ВидыИсполнителей.ОтветственныйВДокументеПродажи, 
		Справочники.ВидыИсполнителей.АвторВМонтаже);
		
	//#6347 При обновлени на версию у всех ранее созданных документов "Установка стоимости выработки" по виду документа "Монтаж", 
	//где стоял вид исполнителя "Ответсвенный в документе заказа" заменить его на "Ответсвенный заказ-договора"
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.Монтаж, 
		Справочники.ВидыИсполнителей.ОтветственныйВДокументеЗаказа, 
		Справочники.ВидыИсполнителей.АвторВЗаказДоговоре);
		
	//#6347 При обновлени на версию у всех ранее созданных документов "Установка стоимости выработки" по виду документа "Монтаж", 
	//где стоял вид исполнителя "Менеджер в документе заказа" заменить его на "Менеджер в заказ-договоре"
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.Монтаж, 
		Справочники.ВидыИсполнителей.МенеджерВДокументеЗаказа, 
		Справочники.ВидыИсполнителей.МенеджерЗаказДоговора);
		
	//#6347
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.Монтаж, 
		Справочники.ВидыИсполнителей.Монтажник, 
		Справочники.ВидыИсполнителей.Монтажник, Новый Структура("СпособРаспределенияВыработкиПоМонтажникам", Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.Индивидуально));
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.Монтаж, 
		Справочники.ВидыИсполнителей.Монтажники, 
		Справочники.ВидыИсполнителей.Монтажник, Новый Структура("СпособРаспределенияВыработкиПоМонтажникам", Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.ПоКоэффициентам));
		
	//#6347 При обновлени на версию у всех ранее созданных документов "Установка стоимости выработки" по виду документа "РТиУ", 
	//где стоял вид исполнителя "Ответсвенный в документе продажи" заменить его на "Ответсвенный в реализации"
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг, 
		Справочники.ВидыИсполнителей.ОтветственныйВДокументеПродажи, 
		Справочники.ВидыИсполнителей.АвторВРеализации);
	
	//#6347 При обновлени на версию у всех ранее созданных документов "Установка стоимости выработки" по виду документа "РТиУ",
	//где стоял вид исполнителя "Менеджер в документе" заменить его на "Менеджер в реализации"
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг, 
		Справочники.ВидыИсполнителей.МенеджерВДокументеПродажи, 
		Справочники.ВидыИсполнителей.МенеджерВРеализации);
		
	//#6347 При обновлени на версию у всех ранее созданных документов "Установка стоимости выработки" по виду документа "РТиУ", 
	//где стоял вид исполнителя "Ответственный в заказе" заменить его на "Ответсвенный в заказе покупателя"
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг, 
		Справочники.ВидыИсполнителей.ОтветственныйВДокументеЗаказа, 
		Справочники.ВидыИсполнителей.АвторВЗаказеПокупателя);

	//#6347 При обновлени на версию у всех ранее созданных документов "Установка стоимости выработки" по виду документа "РТиУ",
	//где стоял вид исполнителя "Менеджер в документе заказа" заменить его на "Менеджер в заказе покупателя"
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг, 
		Справочники.ВидыИсполнителей.МенеджерВДокументеЗаказа, 
		Справочники.ВидыИсполнителей.МенеджерВЗаказеПокупателя);
		
	//++ При обновлени на версию у всех ранее созданных документов "Установка стоимости выработки" по виду документа "РТиУ",
	//где стоял вид исполнителя "Ответственный в документе-основании заказа" заменить его на "Ответственный в заказе покупателя"
	Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ИзменитьВидИсполнителяВДокументах(
		Справочники.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг, 
		Справочники.ВидыИсполнителей.ОтветственныйВОснованииЗаказа, 
		Справочники.ВидыИсполнителей.ОтветственныйВЗаказеПокупателя);
	//--
		
	//#6347
	//перенумеруем элементы справочника ВидыНачислений	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыНачислений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыНачислений КАК ВидыНачислений
	|ГДЕ
	|	НЕ ВидыНачислений.Предопределенный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();			
			СпрОбъект.УстановитьНовыйКод();			
			СпрОбъект.Записать();
		Исключение
			//
		КонецПопытки;
	КонецЦикла;
	
	//#6347
	Константы.СпособРаспределенияВыработкиПоМонтажуПоУмолчанию.Установить(Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.ПоКоэффициентам);
	
	//#6347
	//При обновлении на 2.0.3 во всех монтажах заполнить реквизит "Вид бригады"
	//При обновлении на версию во всех монтажах проставить способ распределения выработки «Общая сумма выработки делится на всех монтажников согласно коэффициентам»
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	//#6347
	// При обновлении на 2.0.3 пометить на удаление документы УСВ по условиям
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Ссылка КАК Ссылка,
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Дата КАК Дата
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК УстановкаСтоимостиВыработкиПоНоменклатуре
	|ГДЕ
	|	НЕ УстановкаСтоимостиВыработкиПоНоменклатуре.ПометкаУдаления
	|	И (УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.Монтаж)
	|				И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидИсполнителя = ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.СотрудникПроизводства)
	|			ИЛИ УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.Монтаж)
	|				И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидИсполнителя = ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.МенеджерВДокументеПродажи)
	|			ИЛИ УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг)
	|				И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидИсполнителя = ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.Бригадир)
	|			ИЛИ УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг)
	|				И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидИсполнителя = ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.ЗамерщикЗаказДоговора)
	|			ИЛИ УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг)
	|				И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидИсполнителя = ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.МенеджерЗаказДоговора)
	|			ИЛИ УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг)
	|				И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидИсполнителя = ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.Монтажник)
	|			ИЛИ УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг)
	|				И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидИсполнителя = ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.Монтажники)
	|			ИЛИ УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг)
	|				И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидИсполнителя = ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.НазначилЗамерВЛиде)
	|			ИЛИ УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг)
	|				И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидИсполнителя = ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.СотрудникПроизводства)
	//|			ИЛИ УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг)
	//|				И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидИсполнителя = ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.АвторВОснованииЗаказа)
	|		)
	|";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.3.1", Выборка.Ссылка, Выборка.Дата,, 2); //в обработку с спец.номером версии
	КонецЦикла;
	
	//#6347
	// При обновлении на 2.0.3. проверить все записи РН выработки производства и розницы, смотреть к какому виду исполнителя относится вид начисления в записи, 
	// смотреть какой вид исполнителя должен быть по новым правилам (по ранее сделанным заменам) и ставить вид начисления относящийся к новому виду исполнителя.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейПроизводства КАК ДанныеРегистра
	|ГДЕ
	|	НЕ ДанныеРегистра.ВидНачисления.Предопределенный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.Период
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейРозницы КАК ДанныеРегистра
	|ГДЕ
	|	НЕ ДанныеРегистра.ВидНачисления.Предопределенный";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.3.1", Выборка.Ссылка, Выборка.Дата,, 2); //в обработку с спец.номером версии
	КонецЦикла;	
	
	// №6293 перевод галочек Опт, Розница из карточки контрагента в группы доступа к контрагентам
	Справочники.Контрагенты.ПеревестиПризнакиОптРозницаВГруппыДоступаККонтрагентам();
	
	// №6388 в ТЧ Услуги документа РТиУ добавлен реквизит "Характеристика номенклатуры"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДокументРеализации.Ссылка КАК Ссылка,
	|	ДокументРеализации.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|	
	|   	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровИУслуг.Услуги КАК ДокументРеализации
	|		ПО ДокументРеализации.Заказ = ЗаказПокупателяТовары.Ссылка
	|ГДЕ
	|	ЗаказПокупателяТовары.Номенклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.Услуга)
	|	И НЕ ЗаказПокупателяТовары.ХарактеристикаНоменклатуры = Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	И ДокументРеализации.ХарактеристикаНоменклатуры = Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	И НЕ ДокументРеализации.Ссылка.ПометкаУдаления";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
		
	//#5461
	// При обновлении на версию создать элементы справочника "Производители" с наименованием соответствующего контрагента 
	//и выполнить замену с контрагента на производителя в карточках серий и фактур
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Ссылка,
	|	СерииНоменклатуры.УДАЛИТЬ_Производитель КАК Производитель,
	|	СерииНоменклатуры.УДАЛИТЬ_Производитель.Наименование КАК Наименование,
	|	СерииНоменклатуры.УДАЛИТЬ_Производитель.НаименованиеПолное КАК НаименованиеПолное,
	|	ВЫРАЗИТЬ(СерииНоменклатуры.УДАЛИТЬ_Производитель.Дополнительно КАК СТРОКА(1000)) КАК Комментарий
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	НЕ СерииНоменклатуры.УДАЛИТЬ_Производитель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Фактура.Ссылка,
	|	Фактура.УДАЛИТЬ_Производитель,
	|	Фактура.УДАЛИТЬ_Производитель.Наименование,
	|	Фактура.УДАЛИТЬ_Производитель.НаименованиеПолное,
	|	ВЫРАЗИТЬ(Фактура.УДАЛИТЬ_Производитель.Дополнительно КАК СТРОКА(1000))
	|ИЗ
	|	Справочник.Фактура КАК Фактура
	|ГДЕ
	|	НЕ Фактура.УДАЛИТЬ_Производитель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.Наименование КАК Наименование,
	|	ВТ.НаименованиеПолное КАК НаименованиеПолное,
	|	ВТ.Комментарий КАК Комментарий
	|ИЗ
	|	ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Наименование КАК Наименование
	|ИЗ
	|	ВТ КАК ВТ";

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаПроизводителей = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаПроизводителей.Следующий() Цикл
		НовыйЭлемент = Справочники.Производители.СоздатьЭлемент();
		НовыйЭлемент.УстановитьНовыйКод();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ВыборкаПроизводителей);
		НовыйЭлемент.Записать();
	КонецЦикла;
	
	ВыборкаСерийИФактур = РезультатЗапроса[2].Выбрать();	
	Пока ВыборкаСерийИФактур.Следующий() Цикл
		СпрОбъект = ВыборкаСерийИФактур.Ссылка.ПолучитьОбъект();
		СпрОбъект.Производитель = Справочники.Производители.НайтиПоНаименованию(ВыборкаСерийИФактур.Наименование, Истина);
		СпрОбъект.Записать();
	КонецЦикла;


	// #6361
	// перепроведение документов "РКО", у которых основание - заказ-договор с добавлением заказа в таблицу распределения.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийГод", Год(ТекущаяДатаСеанса()));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю)
	|	И ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказДоговор"; 

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	// №5796 в "Задачи" добавлен реквизит "ТочкаПродаж"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Задачи.Ссылка КАК Ссылка,
	|	Задачи.Дата КАК Дата
	|ИЗ
	|	Задача.Задачи КАК Задачи
	|ГДЕ
	|	НЕ Задачи.ПометкаУдаления
	|	И НЕ ЕСТЬNULL(ПредметЗадачи.ТочкаПродаж, Значение(Справочник.ТочкиПродаж.ПустаяСсылка)) = Значение(Справочник.ТочкиПродаж.ПустаяСсылка)";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТребуетсяЗапись = Ложь;
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(ЗадачаОбъект.ПредметЗадачи) И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЗадачаОбъект.ПредметЗадачи, "ТочкаПродаж") Тогда
			ЗадачаОбъект.ТочкаПродаж = ЗадачаОбъект.ПредметЗадачи.ТочкаПродаж;
			ТребуетсяЗапись = Истина;
		КонецЕсли;
		
		Если ТребуетсяЗапись Тогда
			Попытка
				ЗадачаОбъект.Записать()
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	//#6576
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.РасчетыСПерсоналом КАК ДанныеРегистра"; 

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	// №6303 по ЗД в статусе "Отменен" нужно создать документ СОРД
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Договор.Ссылка КАК Ссылка,
	|	Договор.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК Договор
	|ГДЕ
	|	Договор.Проведен
	|	И Договор.ТекущийСтатус = Значение(Справочник.СтатусыЗаказДоговоров.Отменен)";
	// ЗД может быть расторгнут без галочек, по нему также нужно создать документ соглашение о расторжении
	//|	И (Договор.УДАЛИТЬ_РасторжениеБезВозвратаДенегКлиенту ИЛИ Договор.УДАЛИТЬ_РасторжениеСписатьТовары ИЛИ Договор.УДАЛИТЬ_РасторжениеСписатьМатериалы)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	// №6496 в регистр накопления "РасчетыПоЗаказам" добавлено измерение "Контрагент" его необходимо заполнить
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Контрагент.Ссылка ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	// №6303 статья доходов для нового документа "СоглашениеОРасторженииДоговора"
	МенеджерЗаписи = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипДокумента = "СоглашениеОРасторженииДоговора"; 
	МенеджерЗаписи.ВидОперации 	= Неопределено; 
	МенеджерЗаписи.ТипСтатьи    = Перечисления.ТипыСтатейДоходовРасходов.Доход;
	МенеджерЗаписи.СтатьяДоходовРасходов = Справочники.СтатьиДоходовИРасходов.ПрочиеДоходы;
	МенеджерЗаписи.Записать();
	
	МенеджерЗаписи = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипДокумента = "СоглашениеОРасторженииДоговора"; 
	МенеджерЗаписи.ВидОперации 	= Неопределено; 
	МенеджерЗаписи.ТипСтатьи    = Перечисления.ТипыСтатейДоходовРасходов.Расход;
	МенеджерЗаписи.СтатьяДоходовРасходов = Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы;
	МенеджерЗаписи.Записать();
	
	// №6627 новая константа
	Константы.ПриВходящемЗвонкеОткрыватьКарточкуЛидаВРаботе.Установить(Истина);
	
	// №6761 если включено использование ведения учета доходов и расходов и кассовый метод, необходимо документы ОБК с заполненной статьей доходов перепровести, чтобы они сформировали движения в регистр ДоходыРасходы
	Если Константы.ИспользоватьВедениеУчетаДоходовРасходов.Получить() И Константы.КассовыйМетодВеденияУчетаДоходовРасходов.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОплатаБанковскойКартой.Ссылка КАК Ссылка,
		|	ОплатаБанковскойКартой.Дата КАК Дата
		|ИЗ
		|	Документ.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой
		|ГДЕ
		|	ОплатаБанковскойКартой.Проведен
		|	И НЕ ОплатаБанковскойКартой.СтатьяДоходов = Значение(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл		
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
		КонецЦикла;
	КонецЕсли;
	
	// №6819 нужно у всех пользователей снять помеченные на удаление роли
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникПользователи.Ссылка,
		|	СправочникПользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
		|ИЗ
		|	Справочник.Пользователи КАК СправочникПользователи";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		СвойстваПользователя = Неопределено;
		Если Пользователи.ПрочитатьПользователяИБ(Выборка.ИдентификаторПользователяИБ, СвойстваПользователя) Тогда
			
			ТребуетсяЗапись = Ложь;
			КоличествоРолей = СвойстваПользователя.Роли.Количество()-1;
			Для Сч = 0 По КоличествоРолей Цикл
				Если Врег(Лев(СвойстваПользователя.Роли[КоличествоРолей-Сч], 7)) = Врег("Удалить") Тогда
					СвойстваПользователя.Роли.Удалить(КоличествоРолей-Сч);
					ТребуетсяЗапись = Истина;
				КонецЕсли;	
			КонецЦикла;
			
			Если ТребуетсяЗапись Тогда
				Пользователи.ЗаписатьПользователяИБ(Выборка.ИдентификаторПользователяИБ, СвойстваПользователя);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//#7042
	// При обновлении на версию в документе "Установка стоимости выработки" не заполнилась "Вид начисления"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Ссылка КАК Ссылка,
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Дата КАК Дата
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК УстановкаСтоимостиВыработкиПоНоменклатуре
	|ГДЕ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка)
	|	И НЕ УстановкаСтоимостиВыработкиПоНоменклатуре.ВидИсполнителя = ЗНАЧЕНИЕ(Справочник.ВидыИсполнителей.ПустаяСсылка)";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.0.3.2", Выборка.Ссылка, Выборка.Дата,, 3); //в обработку с спец.номером версии
	КонецЦикла;
	
	// №4742 перенумерация Лидов, теперь периодчиность номера "Непериодический"
	Если Метаданные.Документы.Лид.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Непериодический Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лид.Ссылка КАК Ссылка,
		|	Лид.Номер КАК Номер,
		|	Лид.Дата КАК Дата
		|ИЗ
		|	Документ.Лид КАК Лид
		|ГДЕ
		|	ВЫРАЗИТЬ(ГОД(Лид.Дата) КАК Число(4)) = 2020
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лид.Номер";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.УстановитьНовыйНомер();
			
			ДокументОбъект.Записать();
			
		КонецЦикла;
		
		ОбновитьНумерациюОбъектов(Метаданные.Документы.Лид);
		
	КонецЕсли;
	
	// №6952 в регистр "Замеры" добавлено новое измерение "НазначилЗамер" и ресурс "ПричинаОтказа", нужно перепровести Лиды
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Замеры.Регистратор КАК Ссылка,
		|	Замеры.Регистратор.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.Замеры КАК Замеры
		|ГДЕ
		|   НЕ Замеры.ЭтоВыезд
		|   И Замеры.Регистратор ССЫЛКА Документ.Лид";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_4_0_0

Процедура ОбработкаОбновления_2_4_0_0() Экспорт
	
	ВерсияПрограммы = "2.4.0.0";
	
	// №6876 при начислении бонусов по ОБК изменился принцип получения настройки начисления с кассы на эквайринговый терминал
	// Получим список документов ОБК у которых:
	//  - сумма бонусов к начислению больше 0
	//	- заполнена касса
	//	- установлена галочка НачислятьБонусы
	//	- вид операции "ОБК"
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОплатаБанковскойКартой.Ссылка КАК Ссылка,
		|	ОплатаБанковскойКартой.Организация КАК Организация,
		|	ОплатаБанковскойКартой.Контрагент.Категория КАК КатегорияКонтрагента,
		|	ОплатаБанковскойКартой.Дата КАК Дата,
		|	ОплатаБанковскойКартой.Касса КАК Касса,
		|	ОплатаБанковскойКартой.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал
		|ИЗ
		|	Документ.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой
		|ГДЕ
		|	ОплатаБанковскойКартой.СуммаБонусовКНачислениюПоДисконтнойКарте > 0
		|	И НЕ ОплатаБанковскойКартой.Касса = Значение(Справочник.Кассы.ПустаяСсылка)
		|	И ОплатаБанковскойКартой.НачислятьБонусы
		|	И ОплатаБанковскойКартой.ВидОперации = Значение(Перечисление.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Необходимо найти настройку срезом последних и дополнить документ эквайрингом
		подЗапрос = новый Запрос;
		подЗапрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.Регистратор,
		|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.Организация,
		|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.КатегорияКонтрагента,	
		|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.БонусПроцентом
		|ИЗ
		|	РегистрСведений.НастройкиНачисленияБонусовПоПродажам.СрезПоследних(&Дата, ) КАК НастройкиНачисленияБонусовПоПродажамСрезПоследних
		|ГДЕ
		|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.Организация = &Организация
		|	И НастройкиНачисленияБонусовПоПродажамСрезПоследних.КатегорияКонтрагента = &КатегорияКонтрагента
		|	И НастройкиНачисленияБонусовПоПродажамСрезПоследних.ВидДокумента = Значение(Справочник.ВидыДокументовНачисленияБонусов.ОплатаБанковскойКартой)
		|	И НастройкиНачисленияБонусовПоПродажамСрезПоследних.СчетКасса = &СчетКасса";
		подЗапрос.УстановитьПараметр("Дата", Выборка.Дата);
		подЗапрос.УстановитьПараметр("Организация", Выборка.Организация);
		подЗапрос.УстановитьПараметр("КатегорияКонтрагента", Выборка.КатегорияКонтрагента);
		подЗапрос.УстановитьПараметр("СчетКасса", Выборка.Касса);
			
		подВыборка = подЗапрос.Выполнить().Выбрать();
		Если подВыборка.Следующий() Тогда
			
			ДокументОбъект = подВыборка.Регистратор.ПолучитьОбъект();
			
			// В документе попробуем сперва найти Эквайринг, может он уже задан
			НайденныеСтроки = ДокументОбъект.СчетаИКассы.НайтиСтроки(новый Структура("СчетКасса", Выборка.ЭквайринговыйТерминал));
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = ДокументОбъект.СчетаИКассы.Добавить();
				НоваяСтрока.СчетКасса = Выборка.ЭквайринговыйТерминал;
				
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	//#7052
	Если Константы.ПереноситьВАрхивРасчетыПостроителяПроизводство.Получить() И Константы.ИндивидуальныеКаталогиЗагрузкиЧертежейИзEasyCeiling.Получить() Тогда
		//всем пользователям, у кого указан каталог резервных копий для файлов построителя (производство) взведем галочку необходимости выполнять это резервное копирование
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг КАК КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления
		|	И НЕ Пользователи.Недействителен";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ПустаяСтрока(Выборка.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг) Тогда
				ПользовательОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ПользовательОбъект.ПереноситьВАрхивРасчетыПостроителяПроизводство = Истина;
				ПользовательОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Константы.ПереноситьФайлыВАрхивПриЗагрузкеПотолкаИзПостроителяВРознице.Получить() И Константы.ПапкиОпределяютсяВКарточкеПользователяРозница.Получить() Тогда
		//всем пользователям, у кого указан каталог резервных копий для файлов построителя (розница) взведем галочку необходимости выполнять это резервное копирование
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница КАК КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления
		|	И НЕ Пользователи.Недействителен";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ПустаяСтрока(Выборка.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница) Тогда
				ПользовательОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ПользовательОбъект.ПереноситьФайлыВАрхивПриЗагрузкеПотолкаИзПостроителяВРознице = Истина;
				ПользовательОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//#7342
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ОплатаБанковскойКартой КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаРасчетныйСчет.ПоступлениеПоБанковскимКартам)
	|	И ДанныеДокумента.Проведен
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_4_2_0

Процедура ОбработкаОбновления_2_4_2_0() Экспорт
	
	ВерсияПрограммы = "2.4.2.0";
	
	// №1083
	//!!! Внимание документы Монтаж и Заказы покупателей не добавлять в обработку версии 2.4.2.0, чтобы они не пересеклись с документами по другим датам
	// В монтаже и заказе покупателя добавлена галочка "СозданПриИспользованииСтатусаЗакрыт"
	// При обновлении на версию, если используется статус «Закрыт» в настройках программы, 
	// находить самый первый документ в этом статусе и ему и всем последующим документам ставить галочку «Создан при использовании статуса закрыт».
		
	Если Константы.ИспользоватьСтатусЗакрытВЗаказеПокупателя.Получить() Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата
		|
		|ПОМЕСТИТЬ ВТ_ПервыйДокументВСтатусе
		|
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И ДанныеДокумента.ТекущийСтатус = Значение(Справочник.СтатусыЗаказовПокупателей.Закрыт)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеДокумента.Дата Возр
		|;
		|/////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ДанныеДокумента
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервыйДокументВСтатусе КАК ПервыйДокументВСтатусе
		|		ПО ИСТИНА = ИСТИНА
		|ГДЕ
		|	ПервыйДокументВСтатусе.Дата ЕСТЬ НЕ NULL
		|	И ДанныеДокумента.Дата >= ПервыйДокументВСтатусе.Дата
		|";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл		
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Константы.ИспользоватьСтатусЗакрытВМонтаже.Получить() Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата
		|
		|ПОМЕСТИТЬ ВТ_ПервыйДокументВСтатусе
		|
		|ИЗ
		|	Документ.Монтаж КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И ДанныеДокумента.Результат = Значение(Справочник.РезультатыМонтажа.Закрыт)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеДокумента.Дата Возр
		|;
		|/////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата
		|ИЗ
		|	Документ.Монтаж КАК ДанныеДокумента
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервыйДокументВСтатусе КАК ПервыйДокументВСтатусе
		|		ПО ИСТИНА = ИСТИНА
		|ГДЕ
		|	ПервыйДокументВСтатусе.Дата ЕСТЬ НЕ NULL
		|	И ДанныеДокумента.Дата >= ПервыйДокументВСтатусе.Дата
		|";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл		
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_4_3_0

Процедура ОбработкаОбновления_2_4_3_0() Экспорт
	
	ВерсияПрограммы = "2.4.3.0";
	
	// №7722 прикрпеленные изображения номенклатуры хранятся в отдельном справочнике НоменклатураПрисоединенныеФайлы
	// Если у номенклатуры указано изображение в старом реквизите "Фото" его необходимо перенести в справочник и очистить в карточке номенклатуры
	// В запросе мы не можем узнать заполненность типа "ХранилищеЗначений", поэтмому проверку будем делать в постобработке, сейчас выгружать все элементы
	Запрос = новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникНоменклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК СправочникНоменклатура
		|ГДЕ
		|	НЕ СправочникНоменклатура.ЭтоГруппа
		|	И СправочникНоменклатура.ФайлКартинки = Значение(Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_4_5_0

Процедура ОбработкаОбновления_2_4_5_0() Экспорт
	
	ВерсияПрограммы = "2.4.5.0";
	
	// №7955 необходимо очистить регистр сведений УДАЛИТЬ_СтоимостьВыработкиНоменклатурыИВида, использовался в версиях ранее
	Запрос = новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УДАЛИТЬ_СтоимостьВыработкиНоменклатурыИВида.Регистратор КАК Ссылка
		|ИЗ
		|	РегистрСведений.УДАЛИТЬ_СтоимостьВыработкиНоменклатурыИВида КАК УДАЛИТЬ_СтоимостьВыработкиНоменклатурыИВида";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		НаборЗаписей = РегистрыСведений.УДАЛИТЬ_СтоимостьВыработкиНоменклатурыИВида.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Ссылка);
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//#7904 при обновлении по справочнику при включенной настройке обмена создать элемент плана обмена
	ВремНастройкаОбмена = Константы.УДАЛИТЬ_ОбменССайтомCMLНастройкаОбмена.Получить();
	Если Константы.ОбменССайтомCMLИспользовать.Получить()
		И ЗначениеЗаполнено(ВремНастройкаОбмена) Тогда
		НовыйОбмен = ПланыОбмена.ОбменССайтом.СоздатьУзел();
		НовыйОбмен.Заполнить(Неопределено);
		НовыйОбмен.УстановитьНовыйКод();
		
		Запрос = новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиОбмена.Наименование КАК Наименование,
		|	НастройкиОбмена.АдресДляОбменаССайтом КАК АдресСайта,
		|	НастройкиОбмена.ИмяПользователя КАК ИмяПользователя,
		|	НастройкиОбмена.Пароль КАК Пароль,
		|	НастройкиОбмена.ВыгружатьКартинки КАК ВыгружатьКартинки,
		|	НастройкиОбмена.КаталогНаДиске КАК КаталогВыгрузки,
		|	НастройкиОбмена.ГруппаНоменклатуры КАК ГруппаНоменклатуры,
		|	НастройкиОбмена.Организация КАК ВладелецКаталога,
		|	НастройкиОбмена.СкладОстатков КАК СкладОстатков,
		|	НастройкиОбмена.ВыгружатьНоменклатуру КАК ОбменТоварами,
		|	НастройкиОбмена.ЗагружатьЗаказы КАК ОбменЗаказами,
		|	НЕ НастройкиОбмена.НеОтправлятьНаСайт КАК ВыгружатьНаСайт,
		|	НастройкиОбмена.РекламныйИсточник КАК РекламныйИсточник
		|ИЗ
		|	Справочник.УДАЛИТЬ_НастройкиОбменаССайтомCML КАК НастройкиОбмена";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(НовыйОбмен, Выборка);
			
			// Создаем и сохраняем таблицу каталогов.			
			ТаблицаКаталогов = Новый ТаблицаЗначений;			
			ТаблицаКаталогов.Колонки.Добавить("Каталог");
			ТаблицаКаталогов.Колонки.Добавить("Группы");
			ТаблицаКаталогов.Колонки.Добавить("ИдентификаторКаталога");
			ТаблицаКаталогов.Колонки.Добавить("ХранилищеНастроекКомпоновки");
			
			СписокГруппНоменклатуры = Новый СписокЗначений;
			Если ЗначениеЗаполнено(Выборка.ГруппаНоменклатуры) Тогда
				СписокГруппНоменклатуры.Добавить(Выборка.ГруппаНоменклатуры);
			КонецЕсли;
			
			КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;			
			СхемаВыгрузкиТоваров = ПланыОбмена.ОбменССайтом.ПолучитьМакет("СхемаВыгрузкиТоваров");		
			АдресСхемы = ПоместитьВоВременноеХранилище(СхемаВыгрузкиТоваров, Новый УникальныйИдентификатор);
			КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаВыгрузкиТоваров.НастройкиПоУмолчанию);
			
			НоваяСтрока = ТаблицаКаталогов.Добавить();
			НоваяСтрока.Каталог = НСтр("ru = 'Основной каталог товаров'");
			НоваяСтрока.Группы = СписокГруппНоменклатуры;
			НоваяСтрока.ИдентификаторКаталога = Строка(Новый УникальныйИдентификатор);
			НоваяСтрока.ХранилищеНастроекКомпоновки = Новый ХранилищеЗначения(КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки());
			
			НовыйОбмен.СохраненнаяТаблицаКаталогов = Новый ХранилищеЗначения(ТаблицаКаталогов);
			
		КонецЕсли;
		
		ВыборкаЦен = Справочники.ВидыЦен.Выбрать();
		Пока ВыборкаЦен.Следующий() Цикл
			НоваяСтрокаВидаЦен = НовыйОбмен.ВидыЦен.Добавить();	
			НоваяСтрокаВидаЦен.ВидЦен = ВыборкаЦен.Ссылка;			
		КонецЦикла;
		
		Попытка
			НовыйОбмен.Записать();
		Исключение
			//Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	//#8030 все монтажи в регистр для заполнения ИДМонтажа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Монтажи.Регистратор КАК Ссылка,
	|	Монтажи.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.Монтажи КАК Монтажи";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_4_11_0

Процедура ОбработкаОбновления_2_4_11_0() Экспорт
	
	ВерсияПрограммы = "2.4.11.0";
	
	// №8373 у всех старых РТиУ, которые делали движения в РН очереди на создание ПТиУ взвести соответствующую галочку
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОтгрузкиСПроизодстваДляРозницы.Реализация КАК Ссылка,
	|	ОтгрузкиСПроизодстваДляРозницы.Реализация.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ОтгрузкиСПроизодстваДляРозницы.Обороты() КАК ОтгрузкиСПроизодстваДляРозницы";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_4_12_0

Процедура ОбработкаОбновления_2_4_12_0() Экспорт
	
	ВерсияПрограммы = "2.4.12.0";
	
	// №8454 у рег. задания "ПроверкаРекламныхЭлектронныхЯщиков" установим в расписании ПовторятьКаждые = 1
	Задание = РегламентныеЗаданияСервер.Задание(Метаданные.РегламентныеЗадания.ПроверкаРекламныхЭлектронныхЯщиков);
	Задание.Расписание.ПериодПовтораДней = 1;
	Задание.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_5_0_0

Процедура ОбработкаОбновления_2_5_0_0() Экспорт
	
	ВерсияПрограммы = "2.5.0.0";
	
	//#7771 заполняем новый реквизит
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ДополнительныеПраваЗапретРедактированияЦенВДокументах";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.ДополнительныеПраваЗапретПримененияСкидок = Истина;
		Попытка
			СпрОбъект.Записать();
		Исключение
			//Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	//#6384 заполняем новые реквизиты
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.УДАЛИТЬ_ФильтроватьНаГрафикеЗамеровИМонтажейПоТочкеПродаж";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.ФильтроватьГрафикЗамеровПоТочкеПродаж  = Истина;
		СпрОбъект.ФильтроватьГрафикМонтажейПоТочкеПродаж = Истина;
		Попытка
			СпрОбъект.Записать();
		Исключение
			//Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	//#7796 заполняем новый реквизит
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПредварительногоРасчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиПредварительногоРасчетаЗаказаВРознице КАК НастройкиПредварительногоРасчета
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.УчитыватьВыработку = Истина;
		Попытка
			СпрОбъект.Записать();
		Исключение
			//Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	//#8090 пока не надо
	//Запрос = новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ИсторияЛида.Лид КАК Ссылка,
	//|	МИНИМУМ(ИсторияЛида.Дата) КАК Дата
	//|ИЗ
	//|	РегистрСведений.ИсторияЛида КАК ИсторияЛида
	//|ГДЕ
	//|	ИсторияЛида.Комментарий ПОДОБНО ""Создан лид по входящему звонку%""
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ИсторияЛида.Лид";
	//
	//РезультатЗапроса = Запрос.Выполнить();	
	//Выборка = РезультатЗапроса.Выбрать();	
	//Пока Выборка.Следующий() Цикл
	//	ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	//КонецЦикла;
	
	//#8261
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.Закупки КАК ДанныеРегистра
	|ГДЕ
	|	НЕ ДанныеРегистра.Регистратор.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// №8209 переименовываем пользователя Администратор в Support
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени("Администратор");
	Если НЕ ПользовательИБ = Неопределено Тогда
		
		ПользовательИБ.Имя = "Support";
		ПользовательИБ.ПолноеИмя = "Служба поддержки SmartCeilings";
		ПользовательИБ.ПоказыватьВСпискеВыбора = Ложь;
		ПользовательИБ.Записать();
		
		Если ПользователиСлужебный.ПользовательПоИдентификаторуСуществует(ПользовательИБ.УникальныйИдентификатор) Тогда
			
			Пользователь = Справочники.Пользователи.НайтиПоРеквизиту(
			"ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
			
			Если ЗначениеЗаполнено(Пользователь) Тогда
				
				ПользовательОбъект = Пользователь.ПолучитьОбъект();
				ПользовательОбъект.Наименование = ПользовательИБ.ПолноеИмя;
				ПользовательОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// №5011 запишем в общую константу, чтобы можно было управлять функциональной опцией
	Константы.ИспользуетсяИнтеграцияСIPАТС.Установить(СофтФон.ИспользуетсяИнтеграцияСIPАТС());
	
	// №8429 во всех лидах заполнить значение подразделение значением подразделение точки продаж лида
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лид.Ссылка КАК Ссылка,
	|	Лид.Дата КАК Дата
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	НЕ ЕСТЬNULL(Лид.ТочкаПродаж.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// №8266 новый реквизит ШиринаПолотна в карточке Номенклатуры для вида номенклатуры "Полотно"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ГДЕ
	|	НЕ СправочникНоменклатура.ЭтоГруппа
	|	И СправочникНоменклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.Полотно)";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
	// #6384 по документу Невыходы создаем 2 новых документа
	// отбираем только 1 документ - обработка будет производиться по регистру Невыходы
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Невыходы.Ссылка КАК Ссылка,
	|	Невыходы.Дата КАК Дата
	|ИЗ
	|	Документ.УДАЛИТЬ_Невыходы КАК Невыходы
	|ГДЕ
	|	Невыходы.Проведен";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_5_2_0

Процедура ОбработкаОбновления_2_5_2_0() Экспорт
	
	ВерсияПрограммы = "2.5.2.0";
	
	// #7556 заполняем новые реквизиты
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказДоговор.Ссылка КАК Ссылка,
	|	ЗаказДоговор.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_5_3_0

Процедура ОбработкаОбновления_2_5_3_0() Экспорт
	
	ВерсияПрограммы = "2.5.3.0";
	
	// #8756 удаление пустых замеров
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Замеры.Регистратор КАК Ссылка,
	|	Замеры.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И Замеры.НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И Замеры.ВремяНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И Замеры.ВремяОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// #8742 заполнение нового ресурса
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыПоставщикам.Регистратор КАК Ссылка,
	|	ЗаказыПоставщикам.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_5_4_0

Процедура ОбработкаОбновления_2_5_4_0() Экспорт
	
	ВерсияПрограммы = "2.5.4.0";
	
	// №8814 получим список одинаковых потолков
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Наименование,
	|	Номенклатура.Потолок_НомерРасчета,
	|	Номенклатура.Потолок_ИндексПотолка,
	|	СУММА(1) КАК ОдинаковыхНоменклатур
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.Потолок_НомерРасчета = """"
	|	И НЕ Номенклатура.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.Наименование,
	|	Номенклатура.Потолок_НомерРасчета,
	|	Номенклатура.Потолок_ИндексПотолка
	|
	|;
	|/////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Наименование,
	|	Номенклатура.Потолок_НомерРасчета,
	|	Номенклатура.Потолок_ИндексПотолка,
	|	Номенклатура.ОдинаковыхНоменклатур КАК ОдинаковыхНоменклатур
	|ИЗ
	|	ВТ КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ОдинаковыхНоменклатур > 1";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		// в регистр к обработке добавим только одну номенклатуру с ключами "Наименование, Номер расчета и Индекс потолока", т.к. потом запросом получим все позиции с таким ключем
		ЗапросПозиции = новый Запрос;
		ЗапросПозиции.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Номенклатура.Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Наименование = &Наименование
			|	И Номенклатура.Потолок_НомерРасчета = &Потолок_НомерРасчета
			|	И Номенклатура.Потолок_ИндексПотолка = &Потолок_ИндексПотолка
			|	И НЕ Номенклатура.ПометкаУдаления
			|";
		ЗапросПозиции.УстановитьПараметр("Наименование", Выборка.Наименование);
		ЗапросПозиции.УстановитьПараметр("Потолок_НомерРасчета", Выборка.Потолок_НомерРасчета);
		ЗапросПозиции.УстановитьПараметр("Потолок_ИндексПотолка", Выборка.Потолок_ИндексПотолка);
		
		ВыборкаПозиции = ЗапросПозиции.Выполнить().Выбрать();
		Если ВыборкаПозиции.Следующий() Тогда
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, ВыборкаПозиции.Ссылка, ТекущаяДатаСеанса());
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_5_6_0

Процедура ОбработкаОбновления_2_5_6_0() Экспорт
	
	ВерсияПрограммы = "2.5.6.0";
	
	// #8731 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Ссылка КАК Ссылка,
	|	Монтаж.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.ВидОперации В (ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.СервиснаяЗаявка), ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Рекламация))";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
	// №8747 нужно заполнить служебный реквизит "ВключатьВыработкуСотрудниковПроизводстваВСебестоимостьПродукции"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыпускПродукции.Ссылка КАК Ссылка,
	|	ВыпускПродукции.Дата КАК Дата
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_5_7_0

Процедура ОбработкаОбновления_2_5_7_0() Экспорт
	
	ВерсияПрограммы = "2.5.7.0";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лид.Ссылка КАК Ссылка,
	|	Лид.Дата КАК Дата
	|ИЗ
	|	Документ.Лид КАК Лид";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_5_9_0

Процедура ОбработкаОбновления_2_5_9_0() Экспорт
	
	ВерсияПрограммы = "2.5.9.0";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратПродукции.Ссылка КАК Ссылка,
	|	ВозвратПродукции.Дата КАК Дата
	|ИЗ
	|	Документ.ВозвратПродукции КАК ВозвратПродукции
	|ГДЕ
	|	ВозвратПродукции.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТовараОтПокупателя.Ссылка,
	|	ВозвратТовараОтПокупателя.Дата
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя КАК ВозвратТовараОтПокупателя
	|ГДЕ
	|	ВозвратТовараОтПокупателя.Проведен
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_5_11_0

Процедура ОбработкаОбновления_2_5_11_0() Экспорт
	
	ВерсияПрограммы = "2.5.11.0";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭквайринговыеТерминалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	|ГДЕ
	|	НЕ ЭквайринговыеТерминалы.ИспользоватьБезПодключенияОборудования
	|	И ЭквайринговыеТерминалы.ПодключаемоеОборудование = ЗНАЧЕНИЕ(Справочник.ПодключаемоеОборудование.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.ИспользоватьБезПодключенияОборудования = Истина;
		СпрОбъект.Записать();		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_5_12_0

Процедура ОбработкаОбновления_2_5_12_0() Экспорт
	
	ВерсияПрограммы = "2.5.12.0";
	
	//#9426 выполнить перепроведение всех заказов покупателей у которых признак "Создан при использовании статуса "Закрыт"" = Ложь 
	//и при этом в глобальных настройках программы установлено использование статуса "Закрыт".
	Если Константы.ИспользоватьСтатусЗакрытВЗаказеПокупателя.Получить() Тогда
		ЗапросДаты = Новый Запрос;
		ЗапросДаты.Текст =		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДанныеДокумента.Дата КАК Дата
		|ИЗ
		|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.ЗаказПокупателя)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеДокумента.Дата";
		
		ВыборкаДаты = ЗапросДаты.Выполнить().Выбрать();	
		Если ВыборкаДаты.Следующий() Тогда			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДатаЗаказа", ВыборкаДаты.Дата);
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеДокумента.Ссылка КАК Ссылка,
			|	ДанныеДокумента.Дата КАК Дата
			|ИЗ
			|	Документ.ЗаказПокупателя КАК ДанныеДокумента
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.Дата >= &ДатаЗаказа
			|	И ДанныеДокумента.СозданПриИспользованииСтатусаЗакрыт = ЛОЖЬ";
			
			Выборка = Запрос.Выполнить().Выбрать();	
			Пока Выборка.Следующий() Цикл
				ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_6_0_0

Процедура ОбработкаОбновления_2_6_0_0() Экспорт
	
	ВерсияПрограммы = "2.6.0.0";
	
	// Порядки версий
	//1 2.6.0.0
	//101 2.6.0.1
	
	//#7256 заполняем новые виды документов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.УДАЛИТЬ_УстановкаИндивидуальныхЦен КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		//ПоместитьВРегистрКОбработке("2.6.0.$a", Выборка.Ссылка, Выборка.Дата);
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	//#7256 реквизит документа в табличную часть
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.УстановкаЦенМатериалов КАК ДанныеДокумента
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		//ПоместитьВРегистрКОбработке("2.6.0.$b", Выборка.Ссылка, Выборка.Дата);
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	//#9756 реквизиты документа в табличную часть
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Лид КАК ДанныеДокумента
	|ГДЕ
	|	(НЕ ДанныеДокумента.УДАЛИТЬ_ГуглID = """"
	|			ИЛИ НЕ ДанныеДокумента.УДАЛИТЬ_ЛидID = """"
	|			ИЛИ НЕ ДанныеДокумента.УДАЛИТЬ_ИД_Битрикс24 = """"
	|			ИЛИ НЕ ДанныеДокумента.УДАЛИТЬ_ЯндексID = """"
	|			ИЛИ НЕ (ВЫРАЗИТЬ(ДанныеДокумента.УДАЛИТЬ_ЭлектроннаяПочтаИД КАК СТРОКА(10))) = """")";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		//ПоместитьВРегистрКОбработке("2.6.0.$d", Выборка.Ссылка, Выборка.Дата);
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	// №9853 Лиды: всем ранее созданным выездам проставить галочку "Адрес выезда отличается от адреса лида"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.Замеры КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Регистратор ССЫЛКА Документ.Лид
	|	И ДанныеРегистра.ЭтоВыезд";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		//ПоместитьВРегистрКОбработке("2.6.0.$f", Выборка.Ссылка, Выборка.Дата);
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	// №6283 
	Константы.МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию.Установить(4);
	
	// №6377 новый реквизит "Дата создания" у контрагента
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СправочникКонтрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК СправочникКонтрагенты
	|ГДЕ
	|	НЕ СправочникКонтрагенты.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса(),, 1);
	КонецЦикла;
	
	//++ #7604 удаляем пользователя "УстановкаОбновлений"
	ПользовательУОИБ = ПользователиИнформационнойБазы.НайтиПоИмени("УстановкаОбновлений");
	Если НЕ ПользовательУОИБ = Неопределено Тогда
		ПользовательУОИБ.Удалить();
	КонецЕсли;
	
	ПользовательУО = Справочники.Пользователи.НайтиПоНаименованию("УстановкаОбновлений", Истина);		
	Если НЕ ПользовательУО.Пустая() Тогда		
		МенеджерЗаписи = РегистрыСведений.НеобходимостьОбновленияАРМРозницы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = ПользовательУО;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.СоставыГруппПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ПользовательУО);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(ПользовательУО);
		ТабСсылок = НайтиПоСсылкам(МассивСсылок);
		Если ТабСсылок.Количество() = 0 Тогда
			Попытка	
				ПользовательУО.ПолучитьОбъект().Удалить();
			Исключение
			КонецПопытки;
		Иначе
			Спробъект = ПользовательУО.ПолучитьОбъект();
			Спробъект.ПометкаУдаления = Истина;
			Спробъект.Недействителен  = Истина;			
			Попытка	
				Спробъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	//-- #7604
	
	//++ #7764
	ОсновнойСкладРозницы = Константы.УДАЛИТЬ_ОсновнойСкладРозницы.Получить();
	Если ЗначениеЗаполнено(ОсновнойСкладРозницы) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиИнтеркампани.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиИнтеркампани КАК НастройкиИнтеркампани
		|ГДЕ
		|	НЕ НастройкиИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков";
		
		Выборка = Запрос.Выполнить().Выбрать();	
		Пока Выборка.Следующий() Цикл
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СпрОбъект.СкладРозницыПриПоступленииТоваровОтПроизводства = ОсновнойСкладРозницы;
			СпрОбъект.Записать();
		КонецЦикла;
		
		НаборЗаписей = РегистрыСведений.СвязкиОрганизацийПроизводстваКонтрагентРозницы.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		Для каждого Запись из НаборЗаписей Цикл
			Запись.СкладПоступления = ОсновнойСкладРозницы;
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	//-- #7764
	
	//#7635
	Константы.УчетнаяЗаписьЭлектроннойПочтыДляАвтоматическихРассылок.Установить(Константы.УчетнаяЗаписьЭлектроннойПочтыПоУмолчанию.Получить());
	
	//#7806
	НастройкаИнтеркампаниДляВнутреннихЗаказов = Константы.УДАЛИТЬ_НастройкаИнтеркампаниДляВнутреннихЗаказов.Получить();
	Если Константы.ИспользоватьВнутренниеЗаказы.Получить() И НЕ НастройкаИнтеркампаниДляВнутреннихЗаказов.Пустая() Тогда
		
		Константы.ОтображатьКонтрагентаВоВнутреннихЗаказах.Установить(		
			Константы.УДАЛИТЬ_НастройкаИнтеркампаниДляВнутреннихЗаказов.Получить().ОднаОрганизацияПроизводстваИПродажиПотолков
			И Константы.УДАЛИТЬ_НастройкаИнтеркампаниДляВнутреннихЗаказов.Получить().УказыватьКонтрагентаРозницыВЗаказахНаПроизводство);
			
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НастройкаИнтеркампаниДляВнутреннихЗаказов", НастройкаИнтеркампаниДляВнутреннихЗаказов);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныУслугРаскроя.Ссылка КАК Ссылка,
		|	ЦеныУслугРаскроя.Дата КАК Дата
		|ИЗ
		|	Справочник.ЦеныУслугРаскроя КАК ЦеныУслугРаскроя
		|ГДЕ
		|	ЦеныУслугРаскроя.УДАЛИТЬ_ДляИнтеркампани
		|	И ЦеныУслугРаскроя.НастройкаИнтеркампани = &НастройкаИнтеркампаниДляВнутреннихЗаказов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныУслугРаскроя.Ссылка КАК Ссылка,
		|	ЦеныУслугРаскроя.Дата КАК Дата
		|ИЗ
		|	Справочник.ЦеныУслугРаскроя КАК ЦеныУслугРаскроя
		|ГДЕ
		|	ЦеныУслугРаскроя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ДляВнутреннихЗаказов)";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ЦеныДляВнутреннихЗаказов = РезультатЗапроса[1].Выгрузить();
		Выборка = РезультатЗапроса[0].Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			НайденныеСтроки = ЦеныДляВнутреннихЗаказов.НайтиСтроки(Новый Структура("Дата", Выборка.Дата));
			Если НайденныеСтроки.Количество() > 0 Тогда
				СпрОбъект = НайденныеСтроки[0].Ссылка.ПолучитьОбъект();
			Иначе
				СпрОбъект = Справочники.ЦеныУслугРаскроя.СоздатьЭлемент();
			КонецЕсли;
			СпрОбъект.Заполнить(Выборка.Ссылка);
			СпрОбъект.УстановитьНовыйКод();
			
			СпрОбъект.УДАЛИТЬ_ДляИнтеркампани = Ложь;
			СпрОбъект.НастройкаИнтеркампани = Справочники.НастройкиИнтеркампани.ПустаяСсылка();
			СпрОбъект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ДляВнутреннихЗаказов;
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				СпрОбъект.Записать();
			Исключение
				ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса(),, 1);
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
	//#7806 заполняем новый реквизит
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныУслугРаскроя.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЦеныУслугРаскроя.УДАЛИТЬ_ДляИнтеркампани
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоИнтеркампани)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен)
	|	КОНЕЦ КАК ВидОперации
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя КАК ЦеныУслугРаскроя
	|ГДЕ
	|	ЦеныУслугРаскроя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.ВидОперации = Выборка.ВидОперации;
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			СпрОбъект.Записать();
		Исключение
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса(),, 1);
		КонецПопытки;
	КонецЦикла;
	//#7806 обработка ЗП / ЗНП: для внутренних заказов очистить настройку интеркампани
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВнутреннийЗаказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	|	И ДанныеДокумента.ДокументОснование.ВнутреннийЗаказ";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;	
	
	//#9168 заполнить новый реквизит "ИдентификаторСтрокой" в регистрах Монтажи и Замеры
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.Монтажи КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ИдентификаторСтрокой = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.Регистратор.Дата
	|ИЗ
	|	РегистрСведений.Замеры КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ИдентификаторСтрокой = """"		
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;	
	
	// №7938 у роли "АРМ Розницы" сняли разрешение на чтение и просмотр документов Лид, Монтаж, Заказ-договор, Эл. письмо
	// нужно пользователям с ролью "АРМ Розницы" установить на чтение по документам
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникПользователи.Ссылка,
		|	СправочникПользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
		|ИЗ
		|	Справочник.Пользователи КАК СправочникПользователи";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		//СвойстваПользователя = Неопределено;
		//Если Пользователи.ПрочитатьПользователяИБ(Выборка.ИдентификаторПользователяИБ, СвойстваПользователя) Тогда
		СвойстваПользователя = Пользователи.СвойстваПользователяИБ(Выборка.ИдентификаторПользователяИБ);	
			ТребуетсяЗапись = Ложь;
			Если НЕ СвойстваПользователя.Роли.Найти("АРМРозницы") = Неопределено Тогда
				
				// Лид
				Если СвойстваПользователя.Роли.Найти("ДокументЛидЧтение") = Неопределено Тогда
					СвойстваПользователя.Роли.Добавить("ДокументЛидЧтение");
					ТребуетсяЗапись = Истина;
				КонецЕсли;
				
				// Монтаж
				Если СвойстваПользователя.Роли.Найти("ДокументМонтажЧтение") = Неопределено Тогда
					СвойстваПользователя.Роли.Добавить("ДокументМонтажЧтение");
					ТребуетсяЗапись = Истина;
				КонецЕсли;
				
				// Заказ-договор
				Если СвойстваПользователя.Роли.Найти("ДокументЗаказДоговорЧтение") = Неопределено Тогда
					СвойстваПользователя.Роли.Добавить("ДокументЗаказДоговорЧтение");
					ТребуетсяЗапись = Истина;
				КонецЕсли;
				
				// Электронное письмо
				Если СвойстваПользователя.Роли.Найти("ДокументЭлектронноеПисьмоЧтение") = Неопределено Тогда
					СвойстваПользователя.Роли.Добавить("ДокументЭлектронноеПисьмоЧтение");
					ТребуетсяЗапись = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТребуетсяЗапись Тогда
				//Пользователи.ЗаписатьПользователяИБ(Выборка.ИдентификаторПользователяИБ, СвойстваПользователя);
				Пользователи.УстановитьСвойстваПользователяИБ(Выборка.ИдентификаторПользователяИБ, СвойстваПользователя);
			КонецЕсли;
			
		//КонецЕсли;
		
	КонецЦикла;	
	
	//#9320 заполняем новый реквизит Валюта и движения по Продажам при проведении
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ЧекККМ КАК ДанныеДокумента";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;	
	
	//++ №6687 добавлен реквит Способ начисления выработки
	//	документы: ВыпускПродукции, ЗаказНаПроизводство, СоставПроизводственнойСмены, УстановкаСтоимостиВыработкиПоНоменклатуре
	// 	Выпуски выбираем только с пустым основанием, т.к. выпуски будут обрабатываться в связке ЗнП - Выпуск
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК ДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.СоставПроизводственнойСмены КАК ДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ВыпускПродукции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Основание = Значение(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	//-- №6687
	
	//#6305
	РегистрыСведений.ПорядокПереводаСтатусаЛида.ЗаполнитьНастройкиПоУмолчанию();
	Справочники.СтатусыЛида.ЗаполнитьПоставляемыеСтатусы();
	
	//#9380
	Справочники.Валюты.ЗаполнитьПоставляемыеВалюты();
	
	// №9385 добавлен реквит "Дата выполнения" в заказе покупателя
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И (ДанныеДокумента.ТекущийСтатус = Значение(Справочник.СтатусыЗаказовПокупателей.Выполнен)
	|		ИЛИ ДанныеДокумента.ТекущийСтатус = Значение(Справочник.СтатусыЗаказовПокупателей.Закрыт))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	// №9386 принудительно установить константу "Запрет проведения документов будущим числом" = ИСТИНА
	Константы.ЗапретПроведенияДокументовБудущимЧислом.Установить(Истина);
	
	// №9362 для всех пользователей у кого стояла галка ТелефонияПринимаетВходящиеЗвонки
	// выставить галку ТелефонияВыполняетИсходящиеЗвонки, если в настройках программы выбран вид АТС, для которой реализованы исходящие звонки
	Если СофтФон.ДоступныИсходящиеЗвонки() Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникПользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК СправочникПользователи
		|ГДЕ
		|	СправочникПользователи.ТелефонияПринимаетВходящиеЗвонки";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ПользовательОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПользовательОбъект.ТелефонияВыполняетИсходящиеЗвонки = Истина;
			
			Попытка
				ПользовательОбъект.Записать();
			Исключение
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//#7080
	СпрОбъект = Справочники.СтатьиДоходовИРасходов.ВозвратДСОтПоставщика.ПолучитьОбъект();
	СпрОбъект.ИспользуетсяВУчетеДоходов = Истина;
	СпрОбъект.Записать();
	
	РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.ЗаполнитьНастройкиПоУмолчанию();
	
	//Создан новый предопределенный элемент "ВозвратДСОтПоставщика" в справочнике  
	//Нужно существующий с таким же кодом перенумеровать
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеСправочника.Ссылка				  
	               |ИЗ
	               |	Справочник.СтатьиДоходовИРасходов КАК ДанныеСправочника
	               |ГДЕ
	               |	НЕ ДанныеСправочника.Предопределенный
				   |	И ДанныеСправочника.Код = ""000000012""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();			
			СпрОбъект.УстановитьНовыйКод();			
			СпрОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	// №9396 поместим одну запись с подверсией 2.6.0.1 из регистра ПрикрепленныеДанные
	// чтобы в последующем выполнить расчет размера файлов в модуле ОбработкаОбновлений
	// 2020-11-19 помещаем все объекты регистра, так как по одной записи очень долго обрабатывается 
	Запрос = новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.Размер = 0";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.6.0.1", Выборка.Ссылка, ТекущаяДатаСеанса(),, 101);
	КонецЦикла;
	
	//++ #4051
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.РасшифровкаПодписи = СпрОбъект.Наименование;
		СпрОбъект.Записать();
	КонецЦикла;
	//-- #4051
	
	//#3751, 4653 Контактная информация
	КонтактнаяИнформацияПотолки.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации();
	
	//#9557
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка,
	|	ДанныеСправочника.ПрефиксОрганизации КАК ПрефиксОрганизации
	|ИЗ
	|	Справочник.Организации КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ПрефиксОрганизации = """"
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СтрДлина(Выборка.ПрефиксОрганизации) = 1 Тогда
			Попытка
				СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();			
				СпрОбъект.ПрефиксОрганизации = "0" + СпрОбъект.ПрефиксОрганизации;			
				СпрОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	//#7635
	Константы.УчетнаяЗаписьЭлектроннойПочты54ФЗ.Установить(Константы.УчетнаяЗаписьЭлектроннойПочтыПоУмолчанию.Получить());
	
	// #9777 в регистр накопления "ЗаказыПокупателей" добавлен ресурс "Сумма"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ДанныеРегистра
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 1);
	КонецЦикла;
	
	// Нужно очистить удаленную ТЧ в справочнике "Производственные операции"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроизводственныеОперации.Ссылка
	|ИЗ
	|	Справочник.ПроизводственныеОперации КАК ПроизводственныеОперации";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.УДАЛИТЬ_СписокНоменклатуры.Очистить();
		СправочникОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_6_2_0

Процедура ОбработкаОбновления_2_6_2_0() Экспорт
	
	//++ №10123, по заявке #9777 был добавлен в регистр накопления "ЗаказыПокупателей" ресурс "Сумма", обработка документа "РТиУ" происходила не корректно
	//ВАЖНО! к обработке поместим версию 2.6.0.0
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Регистратор ССЫЛКА Документ.РеализацияТоваровИУслуг
	|	И ДанныеРегистра.Сумма = 0
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке("2.6.0.0", Выборка.Ссылка, Выборка.Дата); //! Версия к обработке должна быть 2.6.0.0 - т.к. там есть обработчик данного события
	КонецЦикла;
	//-- №10123
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_6_3_0

Процедура ОбработкаОбновления_2_6_3_0() Экспорт
	
	//ВАЖНО! к обработке поместим версию 2.6.0.1
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.Размер = 0";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке("2.6.0.1", Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
	// обработка документа "РТиУ" происходила некорректно - пометки от 2020-11-19 
	//ВАЖНО! к обработке поместим версию 2.6.0.0
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Регистратор ССЫЛКА Документ.РеализацияТоваровИУслуг
	|	И ДанныеРегистра.Сумма = 0
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке("2.6.0.0", Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_6_5_0

Процедура ОбработкаОбновления_2_6_5_0() Экспорт
	
	//++ №10263 в настройках загрузки сделок Битрикс24 инвертирована галочка "Не загружать" в "Загружать"
	ОбъектНастройкаБ24ЗагрузкаЛидов = Справочники.НастройкиСинхронизацииСБитрикс24.Основная.ПолучитьОбъект();
	ХранилищеНастроек = ОбъектНастройкаБ24ЗагрузкаЛидов.ХранилищеНастроек.Получить();
	
	Если ТипЗнч(ХранилищеНастроек) = Тип("Структура") И ХранилищеНастроек.Свойство("НастройкиСинхронизацииЛидов") Тогда
		
		НастройкиСинхронизацииЛидов = ХранилищеНастроек.НастройкиСинхронизацииЛидов;
			
		Если НастройкиСинхронизацииЛидов.Свойство("ИнформацияОСтатусах") И НастройкиСинхронизацииЛидов.ИнформацияОСтатусах.Свойство("СтатусыСписок") Тогда
			
			СтатусыСписок = НастройкиСинхронизацииЛидов.ИнформацияОСтатусах.СтатусыСписок;
			
			Если НЕ СтатусыСписок.Колонки.Найти("НеЗагружать") = Неопределено Тогда
			
				// Сначала просто инвертируем значение
				Для Каждого ТекущийСтатус Из СтатусыСписок Цикл
					ТекущийСтатус.НеЗагружать = НЕ ТекущийСтатус.НеЗагружать;
				КонецЦикла;
				
				// Переименуем колонку
				СтатусыСписок.Колонки.Найти("НеЗагружать").Заголовок = "Загружать";
				СтатусыСписок.Колонки.Найти("НеЗагружать").Имя = "Загружать";
				
				ОбъектНастройкаБ24ЗагрузкаЛидов.ХранилищеНастроек = Новый ХранилищеЗначения(ХранилищеНастроек);
				ОбъектНастройкаБ24ЗагрузкаЛидов.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- №10263
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_6_6_0

Процедура ОбработкаОбновления_2_6_6_0() Экспорт
	
	ВерсияПрограммы = "2.6.6.0";
	
	//#10333
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Лид КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.СпособСоздания = ЗНАЧЕНИЕ(Перечисление.СпособыСозданияЛида.АвтоматическиПриВходящемЗвонке)
	|	И НЕ ДанныеДокумента.ДатаЗвонкаСоздавшегоЛид = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// обработка документов "РТиУ" и возвратов - в части бонусов 
	//ВАЖНО! к обработке поместим версию 2.6.0.0
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Регистратор ССЫЛКА Документ.РеализацияТоваровИУслуг
	|	И ДанныеРегистра.Регистратор.СуммаБонусовКСписаниюПоДисконтнойКарте > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.Регистратор.Дата
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ДанныеРегистра
	|ГДЕ
	|	(ДанныеРегистра.Регистратор ССЫЛКА Документ.ВозвратПродукции
	|			ИЛИ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВозвратТовараОтПокупателя)
	|	И ДанныеРегистра.Регистратор.СуммаБонусовКНачислениюПоДисконтнойКарте > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке("2.6.0.0", Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_6_9_0

Процедура ОбработкаОбновления_2_6_9_0() Экспорт
	
	ВерсияПрограммы = "2.6.9.0";
	
	// №10680 документ "Возврат продукции" с галочкой "Назначить ответсвенных за брак" не должен формировать движений по доходам и расходам
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ВозвратПродукции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.БракПроизводства
	|	И ДанныеДокумента.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_6_10_0

Процедура ОбработкаОбновления_2_6_10_0() Экспорт

	ВерсияПрограммы = "2.6.10.0";
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_6_15_0

Процедура ОбработкаОбновления_2_6_15_0() Экспорт

	ВерсияПрограммы = "2.6.15.0";
	
	// #11129
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Регистратор КАК Ссылка,
	|	ДанныеДокумента.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.ДоходыРасходы.Обороты(, , Регистратор, ) КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Регистратор ССЫЛКА Документ.ОплатаБанковскойКартой";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_6_18_0

Процедура ОбработкаОбновления_2_6_18_0() Экспорт

	ВерсияПрограммы = "2.6.18.0";
	
	// №11305 ПТиУ с доставкой некорректно делали запись суммы в регистр накопления "Закупки"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.СтоимостьДоставки > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_6_20_0

Процедура ОбработкаОбновления_2_6_20_0() Экспорт

	ВерсияПрограммы = "2.6.20.0";
	
	ОбщийМодульСервер.СохранитьВариантыОтчетовПриПереходеСВерсии_2_6_НаВерсию_2_7(); // №11598
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_6_21_0

// !!! ВАЖНО вызов процедуры ОбщийМодульСервер.СохранитьВариантыОтчетовПриПереходеСВерсии_2_6_НаВерсию_2_7
// необходимо переносить дальше в подверсии 2.6. и сразу создать шаблон процедуры ОбработкаОбновления_2_6_N, чтобы не забыть потом.
//Процедура ОбработкаОбновления_2_6_21_0() Экспорт

//	ВерсияПрограммы = "2.6.21.0";
//	
//	ОбщийМодульСервер.СохранитьВариантыОтчетовПриПереходеСВерсии_2_6_НаВерсию_2_7();	
//	
//КонецПроцедуры

#КонецОбласти
	
#Область Обновление_2_7_0_0

Процедура ОбработкаОбновления_2_7_0_0() Экспорт
	
	ВерсияПрограммы = "2.7.0.0";
	
	Если НЕ ЗначениеЗаполнено(Константы.НижняяГраницаДиапазонаSKU.Получить()) Тогда
		Константы.НижняяГраницаДиапазонаSKU.Установить(100);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Константы.ВерхняяГраницаДиапазонаSKU.Получить()) Тогда
		Константы.ВерхняяГраницаДиапазонаSKU.Установить(99999);
	КонецЕсли;
	
	//#7273
	ВариантыОтчетов.ЗагрузитьПользовательские();
	
	//#6265 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции)";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		//ПоместитьВРегистрКОбработке("2.7.0.$a", Выборка.Ссылка, Выборка.Дата);
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#7273	
	// для переноса контактной информации в ТЧ	
	КонтактнаяИнформацияПотолки.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.УДАЛИТЬ_НомерСотовогоТелефона = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК ДанныеСправочника
	|ГДЕ
	|	(НЕ ДанныеСправочника.УДАЛИТЬ_КонтактныйТелефон = """"
	|			ИЛИ НЕ ДанныеСправочника.УДАЛИТЬ_ЛичныйТелефон = """"
	|			ИЛИ НЕ ДанныеСправочника.УДАЛИТЬ_ОсновнойEMail = """"
	|			ИЛИ НЕ ДанныеСправочника.УДАЛИТЬ_ЛичныйEMail = """"
	|			ИЛИ НЕ (ВЫРАЗИТЬ(ДанныеСправочника.УДАЛИТЬ_АдресФактическогоПроживания КАК СТРОКА(10))) = """")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка
	|ИЗ
	|	Справочник.Организации КАК ДанныеСправочника
	|ГДЕ
	|	(НЕ (ВЫРАЗИТЬ(ДанныеСправочника.УДАЛИТЬ_ОсновнойСайт КАК СТРОКА(10))) = """"
	|			ИЛИ НЕ (ВЫРАЗИТЬ(ДанныеСправочника.УДАЛИТЬ_ОсновнаяЭлектроннаяПочта КАК СТРОКА(10))) = """"
	|			ИЛИ НЕ (ВЫРАЗИТЬ(ДанныеСправочника.УДАЛИТЬ_ОсновнойТелефон КАК СТРОКА(10))) = """"
	|			ИЛИ НЕ (ВЫРАЗИТЬ(ДанныеСправочника.УДАЛИТЬ_ФактическийАдрес КАК СТРОКА(10))) = """"
	|			ИЛИ НЕ (ВЫРАЗИТЬ(ДанныеСправочника.УДАЛИТЬ_ЮридическийАдрес КАК СТРОКА(10))) = """")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка
	|ИЗ
	|	Справочник.КонтактныеЛица КАК ДанныеСправочника
	|ГДЕ
	|	(НЕ ДанныеСправочника.УДАЛИТЬ_Email = """"
	|			ИЛИ НЕ ДанныеСправочника.УДАЛИТЬ_Телефон = """")";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		//ПоместитьВРегистрКОбработке("2.7.0.$z", Выборка.Ссылка, ТекущаяДатаСеанса());
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
	//#7273	
	// для переноса контактной информации в ТЧ	
	КонтактнаяИнформацияПотолки.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		
	|	ДанныеСправочника.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК ДанныеСправочника
	|ГДЕ
	|	(НЕ (ВЫРАЗИТЬ(ДанныеСправочника.УДАЛИТЬ_ОсновнойEMail КАК СТРОКА(10))) = """"
	|			ИЛИ НЕ (ВЫРАЗИТЬ(ДанныеСправочника.УДАЛИТЬ_ОсновнойТелефон КАК СТРОКА(10))) = """"
	|			ИЛИ НЕ (ВЫРАЗИТЬ(ДанныеСправочника.УДАЛИТЬ_ФактическийАдрес КАК СТРОКА(10))) = """"
	|			ИЛИ НЕ (ВЫРАЗИТЬ(ДанныеСправочника.УДАЛИТЬ_ЮридическийАдрес КАК СТРОКА(10))) = """")
	|
	//! без ВСЕ
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка
	|ИЗ
	|	Справочник.Контрагенты.УДАЛИТЬ_АдресаДоставки КАК ДанныеСправочника
	
	//#10640
	//! без ВСЕ
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК ДанныеСправочника
	|ГДЕ
	|	НЕ Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		//ПоместитьВРегистрКОбработке("2.7.0.$z", Выборка.Ссылка, ТекущаяДатаСеанса());
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыДляКонтроля.Объект КАК Объект,
	|	РеквизитыДляКонтроля.ИмяРеквизита КАК ИмяРеквизита,
	|	РеквизитыДляКонтроля.ПредставлениеРеквизита КАК ПредставлениеРеквизита,
	|	РеквизитыДляКонтроля.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно,
	|	РеквизитыДляКонтроля.Уникален КАК Уникален
	|ИЗ
	|	РегистрСведений.РеквизитыДляКонтроля КАК РеквизитыДляКонтроля
	|ГДЕ
	|	(РеквизитыДляКонтроля.ЗаполнятьОбязательно
	|			ИЛИ РеквизитыДляКонтроля.Уникален)
	|	И (РеквизитыДляКонтроля.ИмяРеквизита = ""ОсновнойТелефон""
	|			ИЛИ РеквизитыДляКонтроля.ИмяРеквизита = ""ОсновнойEMail"")";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.РеквизитыДляКонтроля.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		Если Выборка.ИмяРеквизита = "ОсновнойТелефон" Тогда
			МенеджерЗаписи.ИмяРеквизита = "Контактная информация.Телефон";
			МенеджерЗаписи.ПредставлениеРеквизита = "Контактная информация.Телефон";
		ИначеЕсли Выборка.ИмяРеквизита = "ОсновнойEMail" Тогда
			МенеджерЗаписи.ИмяРеквизита = "Контактная информация.Email";
			МенеджерЗаписи.ПредставлениеРеквизита = "Контактная информация.Email";			
		Иначе
			Продолжить;
		КонецЕсли;
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;	
	
	//#7273
	// для заполнения новых служебных реквизитов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК ДанныеСправочника
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
	//++ №6629 в документах резервирования и снятие с резервов заполнить новые реквизиты "Вид табличной части"
	//	+ в регистре "Товары в резервах на складах" с документом "Реализация товаров и услуг"
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Резервирование КАК ДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.СнятиеРезервов КАК ДанныеДокумента
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Регистратор ССЫЛКА Документ.РеализацияТоваровИУслуг";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	//-- №6629
	
	//++ №10184 по документу Лид предварительный расчет выведен в отдельный документ:
	//	1. Если был измененный макет ПФ "Коммерческое предложение" по лиду, заменим его для нового документа "Предварительный расчет"
	//	2. По лидам, у которых есть заполненная ТЧ ТоварыУслуги или Материалы, нужно создать документ предварительного расчёта
	НаборЗаписей = РегистрыСведений.ПользовательскиеМакетыПечати.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИмяМакета.Установить("ПФ_MXL_КоммерческоеПредложение");
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 1 Тогда
		
		НаборЗаписей[0].Объект = "Документ.ПредварительныйРасчетЗаказДоговора";
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Ссылка.Дата КАК Дата
	|
	|ПОМЕСТИТЬ ВТ	
	|
	|ИЗ
	|	Документ.Лид.УДАЛИТЬ_ТоварыУслуги КАК ДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата
	|ИЗ
	|	Документ.Лид.УДАЛИТЬ_Материалы КАК ДанныеДокумента
	|	
	|;
	|//////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	ВТ КАК ДанныеДокумента";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	//-- №10184
	
	
	//#10385
	ИспользоватьВедениеУчетаДоходовРасходовПострочно = Ложь;
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ДанныеСправочника.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.Номенклатура КАК ДанныеСправочника
	//|ГДЕ
	//|	(НЕ ДанныеСправочника.СтатьяДоходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	//|			ИЛИ НЕ ДанныеСправочника.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка))";
	//
	//Выборка = Запрос.Выполнить().Выбрать();	
	//Если Выборка.Следующий() Тогда
	//	ИспользоватьВедениеУчетаДоходовРасходовПострочно = Истина;
	//КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоходыРасходы.Регистратор КАК Ссылка,
	|	ДоходыРасходы.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ДоходыРасходы КАК ДоходыРасходы
	|ГДЕ
	|	НЕ ДоходыРасходы.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|	И ДоходыРасходы.Метод = ЗНАЧЕНИЕ(Перечисление.МетодыВеденияУчетаДоходовРасходов.Некассовый)
	|	И (ДоходыРасходы.СуммаДоходов <> 0
	|				И ДоходыРасходы.Регистратор.СтатьяДоходов <> ДоходыРасходы.Статья
	|			ИЛИ ДоходыРасходы.СуммаРасходов <> 0
	|				И ДоходыРасходы.Регистратор.СтатьяРасходов <> ДоходыРасходы.Статья)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ИспользоватьВедениеУчетаДоходовРасходовПострочно = Истина;
	КонецЕсли;
	Если ИспользоватьВедениеУчетаДоходовРасходовПострочно И Константы.НекассовыйМетодВеденияУчетаДоходовРасходов.Получить() Тогда
		Константы.ИспользоватьВедениеУчетаДоходовРасходовПострочно.Установить(ИспользоватьВедениеУчетаДоходовРасходовПострочно);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Период);
	КонецЦикла;
	
	// №10663 документ "Заявка на доставку" реквизит "Текущий статус" заменен тип (предыдущий реквизит помечен на удаление, создан новый)
	// и реквизит "Основание" переделена на табличную часть
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаявкаНаДоставку КАК ДанныеДокумента";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// №10772 в регистре "ПродажиПоЗаказДоговорам" добавлена характеристика, фиксируем по документам "Заказ-договор" и "Монтаж"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.СоглашениеОРасторженииДоговора КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;

	Константы.ШаблонНаименованияПродукции.Установить("Конструкция, [НаименованиеШаблона], [НомерРасчета]");
	
	// №10802 в справочнике пользователи добавилась галочка "При запуске программы запускать терминал самообслуживания"
	//	нужно пользователям с установленной ролью "Терминал самообслуживания" установить данную галочку
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникПользователи.Ссылка,
	|	СправочникПользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК СправочникПользователи";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НеЗаполнятьМенеджераЗаказДоговора = Константы.УДАЛИТЬ_НеЗаполнятьМенеджераЗаказДоговораПриЕгоСоздании.Получить();  //#10640
	Пока Выборка.Следующий() Цикл
	    ПользовательОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЕстьИзменения = Ложь;
		
		//СвойстваПользователя = Неопределено;
		//Если Пользователи.ПрочитатьПользователяИБ(Выборка.ИдентификаторПользователяИБ, СвойстваПользователя) Тогда
		СвойстваПользователя = Пользователи.СвойстваПользователяИБ(Выборка.ИдентификаторПользователяИБ);
			Если НЕ СвойстваПользователя.Роли.Найти("ТерминалСамообслуживания") = Неопределено Тогда				
				//ПользовательОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ПользовательОбъект.ПриЗапускеПрограммыЗапускатьТерминалСамообслуживания = Истина;
				ЕстьИзменения = Истина;
				//ПользовательОбъект.Записать();				
			КонецЕсли;			
		//КонецЕсли;
		
		//#10640
		Если НЕ НеЗаполнятьМенеджераЗаказДоговора Тогда
			ПользовательОбъект.АвтоматическиЗаполнятьМенеджераВЗаказДоговоре = Истина;
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			Попытка
				ПользовательОбъект.Записать();	
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	// №10663 в справочнике "Города" добавились галочки "ИспользуетсяВРознице" и "ИспользуетсяВПроизводстве", по умолчанию включим обе
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникГорода.Ссылка
		|ИЗ
		|	Справочник.Города КАК СправочникГорода";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ИспользуетсяВРознице = Истина;
		СправочникОбъект.ИспользуетсяВПроизводстве = Истина;
		
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Записать();
		
	КонецЦикла;
	
	// #10991 заполняем новое измерение регистра
	НаборЗаписей = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Для каждого Запись из НаборЗаписей Цикл
		Если Запись.ВидПравила.Пустая() Тогда
			Запись.ВидПравила = Перечисления.ВидыПравилОбработкиФайлаПрограммыПостроителя.ДобавлениеНоменклатурыВДокумент;
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
	//#11332
	Справочники.СтатусыЛида.ЗаполнитьПоставляемыеСтатусы();	
	// очистка по статусу
	НаборЗаписей = РегистрыСведений.ПорядокПереводаСтатусаЛида.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТекущийСтатус.Установить(Справочники.СтатусыЛида.УДАЛИТЬ_Рекламация);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	НаборЗаписей = РегистрыСведений.ПорядокПереводаСтатусаЛида.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТекущийСтатус.Установить(Справочники.СтатусыЛида.УДАЛИТЬ_Сервис);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	НаборЗаписей = РегистрыСведений.ПорядокПереводаСтатусаЛида.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СледующийСтатус.Установить(Справочники.СтатусыЛида.УДАЛИТЬ_Рекламация);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	НаборЗаписей = РегистрыСведений.ПорядокПереводаСтатусаЛида.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СледующийСтатус.Установить(Справочники.СтатусыЛида.УДАЛИТЬ_Сервис);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Лид КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.УДАЛИТЬ_Рекламация)
	|	ИЛИ ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.УДАЛИТЬ_Сервис)";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#10837 для заполнения нового реквизита поступления "Адрес монтажа"	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Основание ССЫЛКА Документ.РеализацияТоваровИУслуг
	|	И НЕ ДанныеДокумента.Основание = ЗНАЧЕНИЕ(Документ.РеализацияТоваровИУслуг.ПустаяСсылка)
	|	И НЕ (ВЫРАЗИТЬ(ВЫРАЗИТЬ(ДанныеДокумента.Основание КАК Документ.РеализацияТоваровИУслуг).АдресМонтажа КАК СТРОКА(10))) = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказПокупателя
	|	И НЕ ДанныеДокумента.Основание = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И НЕ (ВЫРАЗИТЬ(ВЫРАЗИТЬ(ДанныеДокумента.Основание КАК Документ.ЗаказПокупателя).АдресМонтажа КАК СТРОКА(10))) = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_2_0

Процедура ОбработкаОбновления_2_7_2_0() Экспорт
	
	ВерсияПрограммы = "2.7.2.0";
		
	//#11650 для заполнения реквизита ВидДляСписка 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойВидКонтактнойИнформации", Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ВидДляСписка = &ПустойВидКонтактнойИнформации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтактныеЛица.Ссылка
	|ИЗ
	|	Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.ВидДляСписка = &ПустойВидКонтактнойИнформации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК Организации
	|ГДЕ
	|	Организации.ВидДляСписка = &ПустойВидКонтактнойИнформации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Сотрудники.КонтактнаяИнформация КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ВидДляСписка = &ПустойВидКонтактнойИнформации";
			
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

#Область Обновление_2_7_5_0

Процедура ОбработкаОбновления_2_7_5_0() Экспорт
	
	ВерсияПрограммы = "2.7.5.0";
		
	//#11666 заполнения измерения решстра ХарактеристикаНоменклатуры 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыПоступления.Ссылка КАК Ссылка,
	|	ДокументыПоступления.Дата КАК Дата
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеТоваровИУслугТовары.Ссылка КАК Ссылка,
	|		ПоступлениеТоваровИУслугТовары.Ссылка.Дата КАК Дата
	|	ИЗ
	|		Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровИУслугТовары
	|	ГДЕ
	|		ПоступлениеТоваровИУслугТовары.Ссылка.Проведен
	|		И НЕ ПоступлениеТоваровИУслугТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		И ПоступлениеТоваровИУслугТовары.Ссылка.Основание ССЫЛКА Документ.ЗаказПоставщику
	|		И НЕ ПоступлениеТоваровИУслугТовары.Ссылка.Основание = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеТоваровИУслугУслуги.Ссылка,
	|		ПоступлениеТоваровИУслугУслуги.Ссылка.Дата
	|	ИЗ
	|		Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеТоваровИУслугУслуги
	|	ГДЕ
	|		ПоступлениеТоваровИУслугУслуги.Ссылка.Проведен
	|		И НЕ ПоступлениеТоваровИУслугУслуги.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		И ПоступлениеТоваровИУслугУслуги.Ссылка.Основание ССЫЛКА Документ.ЗаказПоставщику
	|		И НЕ ПоступлениеТоваровИУслугУслуги.Ссылка.Основание = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)) КАК ДокументыПоступления";
			
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#11632
	НастройкаИзмененияДатыСледующегоКонтактаЛида = Константы.НастройкаИзмененияДатыСледующегоКонтактаЛида.Получить().Получить();
	Если НастройкаИзмененияДатыСледующегоКонтактаЛида = Неопределено Тогда	
		НастройкиИзменения = Новый ТаблицаЗначений;
		НастройкиИзменения.Колонки.Добавить("ИмяСобытия", 	Новый ОписаниеТипов("Строка"));
		НастройкиИзменения.Колонки.Добавить("Сдвиг", 		Новый ОписаниеТипов("Дата", ,,,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
		
		СтрокаНастройки = НастройкиИзменения.Добавить();
		СтрокаНастройки.ИмяСобытия = "ПриЗакрытииЗамераБезВыполненияЗамера";
		КоличествоЧасовПерезвонить = Константы.УДАЛИТЬ_КоличествоЧасовПерезвонитьПриЗамерНевыполнен.Получить();	
		СтрокаНастройки.Сдвиг = Дата(1, 1, 1) + КоличествоЧасовПерезвонить*60*60;
		
		СтрокаНастройки = НастройкиИзменения.Добавить();
		СтрокаНастройки.ИмяСобытия = "ПриОтказеЗаключитьДоговорНаЗамере";
		КоличествоЧасовПерезвонить = Константы.УДАЛИТЬ_КоличествоЧасовПерезвонитьПриОтказеНаЗамере.Получить();	
		СтрокаНастройки.Сдвиг = Дата(1, 1, 1) + КоличествоЧасовПерезвонить*60*60; 
		
		Константы.НастройкаИзмененияДатыСледующегоКонтактаЛида.Установить(Новый ХранилищеЗначения(НастройкиИзменения));
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область Обновление_2_7_17_0

Процедура ОбработкаОбновления_2_7_17_0() Экспорт
	
	ВерсияПрограммы = "2.7.17.0";

	МенеджерЗаписи = РегистрыСведений.ПорядокПереводаСтатусаЛида.СоздатьМенеджерЗаписи();			
	МенеджерЗаписи.ТекущийСтатус 	= Справочники.СтатусыЛида.НазначитьЗамер; 
	МенеджерЗаписи.СледующийСтатус 	= Справочники.СтатусыЛида.Обращение; 
	МенеджерЗаписи.Разрешено 		= Истина;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_19_0

Процедура ОбработкаОбновления_2_7_19_0() Экспорт
	
	ВерсияПрограммы = "2.7.19.0";

	// №12223
	// убрано в 2.7.23
	//ОбработатьЦеныУслугПроизводства();
	
КонецПроцедуры

Процедура ОбработатьЦеныУслугПроизводства()
	
	// №12223 добавлены реквизиты "Вариант оценки" в справочник "Установка цен на услуги производства"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныУслугРаскроя.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя КАК ЦеныУслугРаскроя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УстановкаИндивидуальныхЦенНаУслугиПроизводства.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УстановкаИндивидуальныхЦенНаУслугиПроизводства КАК УстановкаИндивидуальныхЦенНаУслугиПроизводства";
			
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// №12223 по углам по другому
		ОбрабатываемыйОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ОбрабатываемыйОбъект.ВариантОценкиВнутренниеВырезы 			= Перечисления.ВариантыОценкиСтоимостиУслугПроизводства.ОценкаПоКаждомуЗаданномуДиапазону;
		ОбрабатываемыйОбъект.ВариантОценкиВырезыApply 				= Перечисления.ВариантыОценкиСтоимостиУслугПроизводства.ОценкаПоКаждомуЗаданномуДиапазону;
		ОбрабатываемыйОбъект.ВариантОценкиДлинаПользовательскихШвов = Перечисления.ВариантыОценкиСтоимостиУслугПроизводства.ОценкаПоКаждомуЗаданномуДиапазону;
		ОбрабатываемыйОбъект.ВариантОценкиДлинаШвов 				= Перечисления.ВариантыОценкиСтоимостиУслугПроизводства.ОценкаПоКаждомуЗаданномуДиапазону;
		ОбрабатываемыйОбъект.ВариантОценкиДлинаШвовМногофактурный 	= Перечисления.ВариантыОценкиСтоимостиУслугПроизводства.ОценкаПоКаждомуЗаданномуДиапазону;
		ОбрабатываемыйОбъект.ВариантОценкиКривые 					= Перечисления.ВариантыОценкиСтоимостиУслугПроизводства.ОценкаПоКаждомуЗаданномуДиапазону;
		ОбрабатываемыйОбъект.ВариантОценкиУглы 						= Перечисления.ВариантыОценкиСтоимостиУслугПроизводства.РазбивкаУслугиНаЗаданныеДиапазоны;
		ОбрабатываемыйОбъект.ВариантОценкиФотопечать 				= Перечисления.ВариантыОценкиСтоимостиУслугПроизводства.ОценкаПоКаждомуЗаданномуДиапазону;
		
		//!
		ОбрабатываемыйОбъект.ОбменДанными.Загрузка = Истина;
		
		ОбрабатываемыйОбъект.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_21_0

Процедура ОбработкаОбновления_2_7_21_0() Экспорт
	
	ВерсияПрограммы = "2.7.21.0";

	ОписаниеОшибки = "Создан при использовании функционала отличающегося проданного количества потолков от реального, который отсутствует в версии 2.8.0";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.СлужебныйКоличествоКСписаниюНеСоответствуетКоличествуПроданного";	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, ОписаниеОшибки);
	КонецЦикла;
	
	//!!! Ещё не точно войдёт в данную версию, пока комментируем
	//!!! Нужно будет написать обработчик под версию, с текстом ошибки "Номенклатура имеет вид ""Типовой отрез"" который отсутствует в новых версиях программы."
	//// №12232 всю номенклатуру с видом "Типовой отрез" помещаем в очередь, однако процедуры обработки этих объектов не делать, т.е. объекты висят всегда и убираются оттуда только вручную
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Номенклатура.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|ГДЕ
	//|	Номенклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.ТиповойОтрез)
	//|";
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	//КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_22_0

Процедура ОбработкаОбновления_2_7_22_0() Экспорт
	
	ВерсияПрограммы = "2.7.22.0";
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_23_0

Процедура ОбработкаОбновления_2_7_23_0() Экспорт
	
	ВерсияПрограммы = "2.7.23.0";

	// №12223
	ОбработатьЦеныУслугПроизводства();
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_24_0

Процедура ОбработкаОбновления_2_7_24_0() Экспорт
	
	ВерсияПрограммы = "2.7.24.0";

	// #12320 добавлен реквизит "Распределение выработки по монтажникам"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиРасчета.Ссылка КАК Ссылка,
	|	НастройкиРасчета.ВидМонтажнойБригады КАК ВидБригады
	|ИЗ
	|	Справочник.НастройкиПредварительногоРасчетаЗаказаВРознице КАК НастройкиРасчета";
			
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбрабатываемыйОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ОбрабатываемыйОбъект.СпособРаспределенияВыработкиПоМонтажникам = ?(ЗначениеЗаполнено(Выборка.ВидБригады), 
											Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.ПоКоэффициентам, 
											Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.Индивидуально);
											
		ОбрабатываемыйОбъект.ОбменДанными.Загрузка = Истина;		
		ОбрабатываемыйОбъект.Записать();		
	КонецЦикла;
	
	// №12345 добавить проверку всех установок цен на услуги производства в т.ч. индивидуальные на пересечение диапазонов в углах. 
	// Если такие объекты находятся, помещаем их в список в важные объекты к обработке после обновления.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныУслугРаскроя.Ссылка КАК Ссылка,
	|	&ТекущаяДата КАК Дата
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя КАК ЦеныУслугРаскроя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УстановкаИндивидуальныхЦенНаУслугиПроизводства.Ссылка,
	|	УстановкаИндивидуальныхЦенНаУслугиПроизводства.Дата
	|ИЗ
	|	Документ.УстановкаИндивидуальныхЦенНаУслугиПроизводства КАК УстановкаИндивидуальныхЦенНаУслугиПроизводства";
			
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбрабатываемыйОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Отказ = Ложь;
		МетаданныеОбъекта = Метаданные.Справочники.ЦеныУслугРаскроя;
		Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.УстановкаИндивидуальныхЦенНаУслугиПроизводства") Тогда
			МетаданныеОбъекта = Метаданные.Документы.УстановкаИндивидуальныхЦенНаУслугиПроизводства;
		КонецЕсли;
		
		ОбщийМодульСервер.ПроверитьПересечениеИнтерваловВЦенахНаУслугиПроизводства(ОбрабатываемыйОбъект, МетаданныеОбъекта, Отказ, Ложь);		
		Если Отказ Тогда
			ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);	
		КонецЕсли;
		
	КонецЦикла;
	
	// №12232 всю номенклатуру с видом "Типовой отрез" помещаем в очередь, однако процедуры обработки этих объектов не делать, т.е. объекты висят всегда и убираются оттуда только вручную
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.ТиповойОтрез)
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_25_0

Процедура ОбработкаОбновления_2_7_25_0() Экспорт
	
	ВерсияПрограммы = "2.7.25.0";

	// #12338 добавлен реквизит
	Если Константы.ВариантХраненияИсторииЗвонковAsterisk.Получить() = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskCDRViewerModMySql Тогда
		СпрОбъект = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskCDRViewerModMySql.ПолучитьОбъект();
	    СпрОбъект.КонтекстыВходящихЗвонков = "incoming;";
		СпрОбъект.Записать();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_27_0

Процедура ОбработкаОбновления_2_7_27_0() Экспорт
	
	ВерсияПрограммы = "2.7.27.0";

	//#12474
	Справочники.Валюты.ЗаполнитьПоставляемыеВалюты();	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_29_0

Процедура ОбработкаОбновления_2_7_29_0() Экспорт
	
	ВерсияПрограммы = "2.7.29.0";

	//#12523 #12532 закомментировано
	//Константы.ПравилоОпределенияОтреза.Установить(Справочники.ПравилаОпределенияВидаПотолка.Отрез);	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_31_0

Процедура ОбработкаОбновления_2_7_31_0() Экспорт
	
	ВерсияПрограммы = "2.7.31.0";

	//#12539
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказДоговор.ТоварыУслуги КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.УДАЛИТЬ_ЦветФактуры = ЗНАЧЕНИЕ(Справочник.ЦветФактуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата
	|ИЗ
	|	Документ.ПредварительныйРасчетЗаказДоговора.ТоварыУслуги КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.УДАЛИТЬ_ЦветФактуры = ЗНАЧЕНИЕ(Справочник.ЦветФактуры.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#12535
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_32_0

Процедура ОбработкаОбновления_2_7_32_0() Экспорт
	
	ВерсияПрограммы = "2.7.32.0";

	//#12545
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийРасходныйКассовыйОрдер.Инкассация)
	|	И НЕ ДанныеДокумента.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперацииРКО = ЗНАЧЕНИЕ(перечисление.ВидыОперацийРасходныйКассовыйОрдер.Инкассация)
	|	И НЕ ДанныеДокумента.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ИнкассацияИзБанка)
	|	И НЕ ДанныеДокумента.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперацииСРС = ЗНАЧЕНИЕ(перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ИнкассацияИзБанка)
	|	И НЕ ДанныеДокумента.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ИнкассацияИзБанка)
	|	И НЕ ДанныеДокумента.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийПоступлениеНаРасчетныйСчет.ИнкассацияВБанк)
	|	И НЕ ДанныеДокумента.СтатьяДоходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_35_0

Процедура ОбработкаОбновления_2_7_35_0() Экспорт
	
	ВерсияПрограммы = "2.7.35.0";

	// №12375
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УстановкаЦенМатериалов КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
		
		ДокументОбъект.Записать(?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_7_37_0

Процедура ОбработкаОбновления_2_7_37_0() Экспорт
	
	ВерсияПрограммы = "2.7.37.0";

	// #12667
	////ОписаниеОшибки = "В заказ-договоре для товаров используются спецификации, что недоступно с версии 2.8.";
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ДанныеДокумента.Ссылка КАК Ссылка,
	//|	ДанныеДокумента.Ссылка.Дата КАК Дата,
	//|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	//|	ДанныеДокумента.Спецификация КАК Спецификация
	//|ИЗ
	//|	Документ.ЗаказДоговор.ТоварыУслуги КАК ДанныеДокумента
	//|ГДЕ
	//|	НЕ ДанныеДокумента.Спецификация = ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка)
	//|	И НЕ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)";
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата); //, ОписаниеОшибки + " (" + Выборка.Номенклатура + " / " + Выборка.Спецификация + ")");
	//КонецЦикла;
	//
	////ОписаниеОшибки = "В монтаже для товаров используются спецификации, что недоступно с версии 2.8.";
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ДанныеДокумента.Ссылка КАК Ссылка,
	//|	ДанныеДокумента.Ссылка.Дата КАК Дата,
	//|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	//|	ДанныеДокумента.Спецификация КАК Спецификация
	//|ИЗ
	//|	Документ.Монтаж.ТоварыУслуги КАК ДанныеДокумента
	//|ГДЕ
	//|	ДанныеДокумента.Ссылка.СлужебныйЗаполнениеМатериаловРозницы = 1
	//|	И НЕ ДанныеДокумента.Спецификация = ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка)
	//|	И НЕ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ДанныеДокумента.Ссылка,
	//|	ДанныеДокумента.Ссылка.Дата,
	//|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	//|	ДанныеДокумента.Спецификация КАК Спецификация
	//|ИЗ
	//|	Документ.Монтаж.ТоварыУслуги КАК ДанныеДокумента
	//|ГДЕ
	//|	НЕ ДанныеДокумента.Спецификация = ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка)
	//|	И НЕ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
	//|	И (НЕ ДанныеДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Монтаж)
	//|			ИЛИ НЕ ДанныеДокумента.Ссылка.Основание ССЫЛКА Документ.ЗаказДоговор
	//|			ИЛИ НЕ ВЫРАЗИТЬ(ДанныеДокумента.Ссылка.Основание КАК Документ.ЗаказДоговор).ЗаполнятьУИСтрок)";
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата); //, ОписаниеОшибки + " (" + Выборка.Номенклатура + " / " + Выборка.Спецификация + ")");
	//КонецЦикла;
	
	// #12465 поле "Автор" заполнить значением поля "Ответственный". Заполнять в процедуре после обновления без перепроведения документов.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ДанныеДокумента.Ссылка КАК Ссылка,  ДанныеДокумента.Дата КАК Дата
	|ИЗ Документ.ВозвратМатериаловИзЭксплуатации КАК ДанныеДокумента ГДЕ НЕ ДанныеДокумента.Автор = ДанныеДокумента.УДАЛИТЬ_Ответственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ДанныеДокумента.Ссылка КАК Ссылка,  ДанныеДокумента.Дата КАК Дата
	|ИЗ Документ.ВозвратПродукции КАК ДанныеДокумента ГДЕ НЕ ДанныеДокумента.Автор = ДанныеДокумента.УДАЛИТЬ_Ответственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ДанныеДокумента.Ссылка КАК Ссылка,  ДанныеДокумента.Дата КАК Дата
	|ИЗ Документ.ВозвратТовараОтПокупателя КАК ДанныеДокумента ГДЕ НЕ ДанныеДокумента.Автор = ДанныеДокумента.УДАЛИТЬ_Ответственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ДанныеДокумента.Ссылка КАК Ссылка,  ДанныеДокумента.Дата КАК Дата
	|ИЗ Документ.ВозвратТовараПоставщику КАК ДанныеДокумента ГДЕ НЕ ДанныеДокумента.Автор = ДанныеДокумента.УДАЛИТЬ_Ответственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ДанныеДокумента.Ссылка КАК Ссылка,  ДанныеДокумента.Дата КАК Дата
	|ИЗ Документ.ЗаказПокупателя КАК ДанныеДокумента ГДЕ НЕ ДанныеДокумента.Автор = ДанныеДокумента.УДАЛИТЬ_Ответственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ДанныеДокумента.Ссылка КАК Ссылка,  ДанныеДокумента.Дата КАК Дата
	|ИЗ Документ.ПередачаМатериаловВЭксплуатацию КАК ДанныеДокумента ГДЕ НЕ ДанныеДокумента.Автор = ДанныеДокумента.УДАЛИТЬ_Ответственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ДанныеДокумента.Ссылка КАК Ссылка,  ДанныеДокумента.Дата КАК Дата
	|ИЗ Документ.ПоступлениеТоваровИУслуг КАК ДанныеДокумента ГДЕ НЕ ДанныеДокумента.Автор = ДанныеДокумента.УДАЛИТЬ_Ответственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ДанныеДокумента.Ссылка КАК Ссылка,  ДанныеДокумента.Дата КАК Дата
	|ИЗ Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента ГДЕ НЕ ДанныеДокумента.Автор = ДанныеДокумента.УДАЛИТЬ_Ответственный	
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
	
#Область Обновление_2_8_0_0

Процедура ОбработкаОбновления_2_8_0_0() Экспорт
	
	ВерсияПрограммы = "2.8.0.0";
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	// Порядки версий
	//999 2.8.0.0
	//1 2.8.0.$a  (ОбработкаОбновлений.Обработка_2_8_0_0_Обязательные помещается версия тут)
	
	// №10807 в документе "Монтаж" добавлен реквизит "ЗаказДоговор"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И НЕ ДанныеДокумента.Основание = Значение(Документ.ЗаказДоговор.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#12333
	Если ЗначениеЗаполнено(Константы.УДАЛИТЬ_НастройкаПредварительногоРасчетаЗаказаВРозницеПоУмолчанию.Получить()) Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеОбъекта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК ДанныеОбъекта
		|ГДЕ
		|	НЕ ДанныеОбъекта.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();	
		Пока Выборка.Следующий() Цикл
			ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
		КонецЦикла;
	КонецЕсли;
	
	//#11632
	НастройкаИзмененияДатыСледующегоКонтактаЛида = Константы.НастройкаИзмененияДатыСледующегоКонтактаЛида.Получить().Получить();
	Если НастройкаИзмененияДатыСледующегоКонтактаЛида = Неопределено Тогда	
		НастройкиИзменения = Новый ТаблицаЗначений;
		НастройкиИзменения.Колонки.Добавить("ИмяСобытия", 	Новый ОписаниеТипов("Строка"));
		НастройкиИзменения.Колонки.Добавить("Сдвиг", 		Новый ОписаниеТипов("Дата", ,,,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
		
		СтрокаНастройки = НастройкиИзменения.Добавить();
		СтрокаНастройки.ИмяСобытия = "ПриЗакрытииЗамераБезВыполненияЗамера";
		КоличествоЧасовПерезвонить = Константы.УДАЛИТЬ_КоличествоЧасовПерезвонитьПриЗамерНевыполнен.Получить();	
		СтрокаНастройки.Сдвиг = Дата(1, 1, 1) + КоличествоЧасовПерезвонить*60*60;
		
		СтрокаНастройки = НастройкиИзменения.Добавить();
		СтрокаНастройки.ИмяСобытия = "ПриОтказеЗаключитьДоговорНаЗамере";
		КоличествоЧасовПерезвонить = Константы.УДАЛИТЬ_КоличествоЧасовПерезвонитьПриОтказеНаЗамере.Получить();	
		СтрокаНастройки.Сдвиг = Дата(1, 1, 1) + КоличествоЧасовПерезвонить*60*60; 
		
		Константы.НастройкаИзмененияДатыСледующегоКонтактаЛида.Установить(Новый ХранилищеЗначения(НастройкиИзменения));
	КонецЕсли;
	
	// №11868
	Справочники.СтатусыЗаявокНаДоставку.ЗаполнитьПоставляемыеСтатусы(); 
	
	//#11670 #12523 частично закомментировано в части типовых отрезов
	//Константы.ПравилоОпределенияТиповогоотреза.Установить(Справочники.ПравилаОпределенияВидаПотолка.ТиповойОтрез);
	//Константы.ПрефиксНаименованияТиповогоОтреза.Установить(Константы.ПрефиксНаименованияОтреза.Получить());
	//Константы.ПорядокФормированияНаименованияТиповогоОтреза.Установить(Константы.ПорядокФормированияНаименованияОтреза.Получить());
	Константы.ПорядокФормированияНаименованияОстатковПленки.Установить(1);
	//Константы.ПрефиксНаименованияТиповогоОтреза.Установить("Отрез");
	Константы.ПрефиксНаименованияОстатковПленки.Установить("Остаток");
	Константы.ПорядокФормированияНомераОстатковПленки.Установить(0);
	//Константы.ПорядокФормированияНомераОстатковПленки.Установить(Константы.ПорядокФормированияНомераТиповогоОтреза.Получить());	

	НаборЗаписей = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл
		Если НЕ ЗначениеЗаполнено(Запись.ВидСоздаваемойНоменклатуры) Тогда
			Запись.ВидСоздаваемойНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
		КонецЕсли;
	КонецЦикла;	
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
	
	//#12079
	Попытка
		НоменклатураПолотноЗаказчика = Справочники.Номенклатура.ПолотноЗаказчика.ПолучитьОбъект();
		НоменклатураПолотноЗаказчика.ВидНоменклатуры = Справочники.ВидыНоменклатуры.УДАЛИТЬ_МатериалЗаказчика;	
		НоменклатураПолотноЗаказчика.Записать();
	Исключение
	КонецПопытки;
	Попытка
		НоменклатураОбъект = Справочники.Номенклатура.ПрофильЗаказчика.ПолучитьОбъект();
		НоменклатураОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.УДАЛИТЬ_МатериалЗаказчика;
		НоменклатураОбъект.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.МетрПогонный;	
		НоменклатураОбъект.Записать();
	Исключение
	КонецПопытки;
	
	//#12065 
	ПорядокОкругленияПотолка = Константы.ПорядокОкругленияЧисломСтоимостиПотолков.Получить();
	Константы.ОкруглятьСтоимостьПотолка.Установить(ПорядокОкругленияПотолка > 0);
	
	//++ №11768 в заказ-договоре привязывается ссылка на замер
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Основание ССЫЛКА Документ.Лид
	|	И НЕ ДанныеДокумента.Основание = Значение(Документ.Лид.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	//-- №11768
	
	// #12157 для заполнения реквизита НомераПотолков
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ДанныеДокумента.Ссылка КАК Ссылка,
	//|	ДанныеДокумента.Дата КАК Дата
	//|ИЗ
	//|	Документ.ЗаказНаПроизводство КАК ДанныеДокумента
	//|ГДЕ
	//|	НЕ ДанныеДокумента.ПометкаУдаления";
	//
	//Выборка = Запрос.Выполнить().Выбрать();	
	//Пока Выборка.Следующий() Цикл
	//	ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	//КонецЦикла;
	
	// #12131 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Рекламация)
	|	И ДанныеДокумента.СуммаДокумента <> 0";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#12127	
	Константы.КоличествоТоваровКСписаниюВМонтажеНеСоответствуетКоличествуПроданногоТовара.Установить(Ложь);
	// этот кусок перенесен в 2.7.21
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ДанныеДокумента.Ссылка КАК Ссылка,
	//|	ДанныеДокумента.Дата КАК Дата
	//|ИЗ
	//|	Документ.Монтаж КАК ДанныеДокумента
	//|ГДЕ
	//|	ДанныеДокумента.СлужебныйКоличествоКСписаниюНеСоответствуетКоличествуПроданного";	
	//Выборка = Запрос.Выполнить().Выбрать();	
	//Пока Выборка.Следующий() Цикл
	//	ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	//КонецЦикла;
	
	//#12358
	Константы.ИспользоватьСтатусыОтгрузки.Установить(Константы.УДАЛИТЬ_ВестиУчетВыдачиТоваровПоДокументуРеализации.Получить());
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.УДАЛИТЬ_Выдано";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#12367 Нужно заполнить новое измерение "Склад" в регистре накопления "Продажи"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Продажи.Регистратор КАК Ссылка,
	|	Продажи.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#9989
	Константы.ОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетов.Установить(Константы.УДАЛИТЬ_ОтправлятьДетализациюВзаиморасчетовПриВыполненииЗаказа.Получить());
	
	// №11160 варианты отображения списка по умолчанию
	Константы.ВариантОтображенияСпискаТоваровПриОграниченииВЗаказДоговоре.Установить(Перечисления.ВариантОтображенияСпискаПриОграничении.ВВидеСпискаБезИерархии);
	Константы.ВариантОтображенияСпискаМатериаловПриОграниченииВЗаказДоговоре.Установить(Перечисления.ВариантОтображенияСпискаПриОграничении.ВВидеСпискаБезИерархии);
	
	// #11632 в документе "Лид" перезаполнить ПоследняяДатаПерезвонить  = ПоследняяДатаПерезвонить  + УДАЛИТЬ_ПоследнееВремяПерезвонить 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Лид КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.ПоследняяДатаПерезвонить = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#12518
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.НачислениеБонусовКонтрагентам.Бонусы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Проведен
	|	И ДанныеДокумента.Сумма < 0";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// №12232 всю номенклатуру с видом "Типовой отрез" помещаем в очередь, однако процедуры обработки этих объектов не делать, т.е. объекты висят всегда и убираются оттуда только вручную
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.ТиповойОтрез)
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса);
	КонецЦикла;
	
	ОписаниеОшибки = "Создан при использовании функционала отличающегося проданного количества потолков от реального, который отсутствует в версии 2.8.0";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.СлужебныйКоличествоКСписаниюНеСоответствуетКоличествуПроданного";	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, ОписаниеОшибки);
	КонецЦикла;

	//#12615
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.УстановкаЦенМатериалов.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.Цена = ДанныеДокумента.ЦенаСФотопечатью
	|	И НЕ ДанныеДокумента.Ссылка.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Продукция)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата
	|ИЗ
	|	Документ.УстановкаИндивидуальныхЦенМатериалов.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.Цена = ДанныеДокумента.ЦенаСФотопечатью
	|	И НЕ ДанныеДокумента.Ссылка.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Продукция)";
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, ОписаниеОшибки);
	КонецЦикла;
	
	//#12660
	Константы.ЗагружатьАдресМонтажаИзПостроителя.Установить(Истина);
	Константы.ЗагружатьДатуОжидаемойОтгрузкиИзПостроителя.Установить(Истина);
	
	// #12667
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ 
	|	ДанныеСправочника.Ссылка
	|ИЗ
	|	Справочник.Спецификации КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.ВидСпецификации = ЗНАЧЕНИЕ(Перечисление.ВидыСпецификации.ПустаяСсылка)
	|";
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_5_0

Процедура ОбработкаОбновления_2_8_5_0() Экспорт
	
	ВерсияПрограммы = "2.8.0.0";
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	ВыполнитьИсправлениеДрайверов();
	
КонецПроцедуры

Процедура ВыполнитьИсправлениеДрайверов()
	// Обновить поставляемые драйверы в составе конфигурации. 	
	// Сканеры штрихкода
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодСканерыШтрихкода, "AddIn.ScancodeScanner", , Истина, , Истина);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода, "AddIn.Scaner45", , Истина, , Истина);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкода, "AddIn.Scanner", "Драйвер1ССканерШтрихкода", Ложь, "8.1.9.1");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкодаNative, "AddIn.InputDevice", "Драйвер1СУстройстваВводаNative", Ложь, "9.0.4.9");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикГексагонСканерыШтрихкода, "AddIn.ProtonScanner", "ДрайверГексагонСканерШтрихкода", Ложь);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода8X, "AddIn.ATOL_Scaners_1CInt", "ДрайверАТОЛУстройстваВвода8X", Ложь);
	// Конец Сканеры штрихкода
		
	// Фискальные регистраторы
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СФискальныйРегистраторЭмулятор, "AddIn.EmulatorFP1C", , Истина,, Истина);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СРарусФискальныеРегистраторыФеликс, "AddIn.fr_feliksRMK1c82", "Драйвер1СРарусФискальныеРегистраторыФеликс", Ложь, "1.2.3.9");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СРарусФискальныеРегистраторыМебиус, "AddIn.fr_moebius1c82", "Драйвер1СРарусФискальныеРегистраторыМебиус", Ложь, "1.1.1.5");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторы, "AddIn.ATOL_KKM_1C", , Истина, , Истина);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторыУниверсальный, "AddIn.ATOL_KKM_1C", , Истина, , Истина);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторы8X, "AddIn.ATOL_KKM_1C82", "ДрайверАТОЛФискальныеРегистраторы8X", Ложь);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВерсияТФискальныеРегистраторы, "AddIn.KSBFR1K1C", , Истина, ,Истина);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикККСФискальныеРегистраторы, "AddIn.SparkTF", "ДрайверККСФискальныеРегистраторы", Ложь);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМФискальныеРегистраторы, "AddIn.DrvFR1C", , Истина, , Истина);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМФискальныеРегистраторыУниверсальный, "AddIn.SMDrvFR1C", "ДрайверШтрихМФискальныеРегистраторы", Ложь);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикОРИОНФискальныеРегистраторы, "AddIn.OrionFR_1C8", , Истина, ,Истина);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикКристаллСервисФискальныеРегистраторыPirit, "AddIn.PiritK", "ДрайверКристаллСервисФискальныеРегистраторыPirit", Ложь, "4.02");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикДримкасФискальныеРегистраторыVikiPrint, "AddIn.VikiP", "ДрайверДримкасФискальныеРегистраторыVikiPrint", Ложь, "4.02");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИскраФискальныеРегистраторыПрим, "AddIn.IskraFR", "ДрайверИскраФискальныеРегистраторыПрим", Ложь, "1.0.0.5");
	// Конец Фискальные регистраторы.
	
	// ККТ с передачей данных                                                                                                                            
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолККТ54ФЗ , "AddIn.ATOL_KKM_1C82_54FZ", , Ложь, , Истина);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолККТ54ФЗ9X , "AddIn.ATOL_KKT_1C83_V9", "ДрайверАтолККТ54ФЗ9X", Ложь);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолККТ54ФЗ10X, "AddIn.ATOL_KKT_1C83_V10", "ДрайверАтолККТ54ФЗ10X", Ложь);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМККТ54ФЗ, "AddIn.SMDrvFR1C22", "ДрайверШтрихМККТ54ФЗ", Ложь);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВерсияТK1Ф54ФЗ, "AddIn.VT_KKT_1CInt", "ДрайверВерсияТK1Ф54ФЗ", Ложь);
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИскраККТ54ФЗ, "AddIn.IskraKKT", "ДрайверИскраККТ54ФЗ", Ложь, "2.0.3.5");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикККСККТ54ФЗ, "AddIn.Spark115F", "ДрайверККСККТ54ФЗ", Ложь, "1.0.0.1");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикMSTARККТ54ФЗ, "AddIn.AlfaFiscalPrinter", "ДрайверMSTARККТ54ФЗ", Ложь, "1.3.6");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСчетмашККТ54ФЗ, "AddIn.fr_feliksrmf1c83", "ДрайверСчетмашККТ54ФЗ", Ложь, "1.1.16.28");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикNEWTONККТ54ФЗ, "AddIn.NewtonMicroFR54FZ", "ДрайверNEWTONККТ54ФЗ",  Ложь, "1.0.5.6");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикARSККТ54ФЗ, "AddIn.Ars1CFiscalDriver", "ДрайверARSККТ54ФЗ",  Ложь, "1.0.9");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикДримкасККТ54ФЗ, "AddIn.VikiP", "ДрайверДримкасККТ54ФЗ",  Ложь, "1.4.2.0");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИнитпроККТ54ФЗ, "AddIn.NKR_KKT", "ДрайверИнитпроККТ54ФЗ",  Ложь, "1.0.5.4");
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикFITККТ54ФЗ, "AddIn.FIT_KKT_1C83_V10", "ДрайверFITККТ54ФЗ",  Ложь, "1.09");
	// Конец ККТ с передачей данных                                                                                              
	
	// Принтеры чеков
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СПринтерЧеков, "AddIn.ReceiptPrinterNative", "Драйвер1СПринтерЧеков", Ложь, "3.0.2.0");
	// Конец Принтеры чеков.
		
	// Эквайринговые терминалы
	ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикARCUS2ЭквайринговыеТерминалыIngenico, "AddIn.IngenicoDriver1C", "ДрайверARCUS2ЭквайринговыеТерминалыIngenico", Ложь, "1.0.0.1");
	
	// удалим не используемые
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДрайверыОборудования.Ссылка КАК Ссылка,
	|	ДрайверыОборудования.Предопределенный КАК Предопределенный
	|ИЗ
	|	Справочник.ДрайверыОборудования КАК ДрайверыОборудования
	|ГДЕ
	|	ДрайверыОборудования.Предопределенный 
	|	И ДрайверыОборудования.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ПустаяСсылка)";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивСсылок = Новый массив;
		МассивСсылок.Добавить(Выборка.Ссылка);
		Если НайтиПоСсылкам(МассивСсылок).Количество() = 0 Тогда
			
			СпрОБъект = Выборка.Ссылка.ПолучитьОбъект();
			СпрОБъект.ИмяпредопределенныхДанных = "";
			Попытка
				СпрОБъект.Записать();
				СпрОБъект.Удалить();
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныйЭлемент(ОбработчикДрайвера, ИдентификаторОбъекта = Неопределено, ИмяМакетаДрайвера = Неопределено, 
	ПоставляетсяДистрибутивом = Ложь, ВерсияДрайвера = Неопределено, СнятСПоддержки = Ложь) Экспорт
	
	ПараметрыОборудования = МенеджерОборудованияВызовСервера.ПараметрыДрайвераПоОбработчику(Строка(ОбработчикДрайвера));
	
	ВремИмяЭлемента = СтрЗаменить(ПараметрыОборудования.Имя, "Обработчик", "Драйвер");
	
	Попытка
		Драйвер = МенеджерОборудованияВызовСервера.ПредопределенныйЭлемент("Справочник.ДрайверыОборудования." + ВремИмяЭлемента);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.ДрайверыОборудования." + ВремИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецПопытки;
	
	Если Драйвер = Неопределено Тогда  
		
	Иначе 
		Драйвер = Драйвер.ПолучитьОбъект();
		НужнаЗапись = Ложь;
		Если (Драйвер.ТипОборудования <> ПараметрыОборудования.ТипОборудования) Тогда
			Драйвер.ТипОборудования           = ПараметрыОборудования.ТипОборудования;
			Драйвер.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_7_0

Процедура ОбработкаОбновления_2_8_7_0() Экспорт

	ВерсияПрограммы = "2.8.7.0";
	
	//#12948
	Если Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеРегистра.Регистратор КАК Ссылка,
		|	ДанныеРегистра.Регистратор.Дата КАК Дата
		|ИЗ
		|	РегистрНакопления.РасчетыСПерсоналом КАК ДанныеРегистра"; 
		
		Выборка = Запрос.Выполнить().Выбрать();	
		Пока Выборка.Следующий() Цикл
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		КонецЦикла;
	КонецЕсли;
	
	// №12975 СОРД в связке с заказ-договором нужно перепровести, поменялись движения
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.СоглашениеОРасторженииДоговора КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_8_0

Процедура ОбработкаОбновления_2_8_8_0() Экспорт

	ВерсияПрограммы = "2.8.8.0";
	
	//#12975 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ПродажиПоЗаказДоговорам КАК ДанныеРегистра"; 
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	// №12800
	Константы.ИспользоватьПрефиксОрганизацииВНомереДокумента.Установить(НЕ Константы.УДАЛИТЬ_НеИспользоватьПрефиксОрганизацииВНомереДокумента.Получить());
	
	// №12909 новый реквизит "Наименование для печати" в карточке номенклатуры
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ГДЕ
	|	НЕ СправочникНоменклатура.ЭтоГруппа
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса);
	КонецЦикла;
	
	//#12950 исправить владельца фото номенклатуры
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	СпрНоменклатура.ФайлКартинки КАК ФайлКартинки,
	|	СпрНоменклатура.ФайлКартинки.ВладелецФайла КАК ФайлКартинкиВладелецФайла
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	НЕ СпрНоменклатура.Ссылка = СпрНоменклатура.ФайлКартинки.ВладелецФайла";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Номенклатура.ПолучитьОбъект();
		СпрОбъект.ФайлКартинки = Справочники.НоменклатураПрисоединенныеФайлы.ПустаяСсылка();
		
		СпрОбъект.Записать();
	КонецЦикла;
	
	//#12822 удалить движения «Возврат продукции» по регистру "Заказы покупателей".
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Регистратор ССЫЛКА Документ.ВозвратПродукции"; 
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#12822 заполнить новый реквизит "Компенсация по возврату"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя КАК ДанныеДокумента"; 
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// №12802 в монтажах со статусами "Выполнен" или "Закрыт" дату выполнения сделать равной дате документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	(ДанныеДокумента.Результат = Значение(Справочник.РезультатыМонтажа.Выполнен)
	|		Или ДанныеДокумента.Результат = Значение(Справочник.РезультатыМонтажа.Закрыт))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_9_0

Процедура ОбработкаОбновления_2_8_9_0() Экспорт

	ВерсияПрограммы = "2.8.9.0";
	
	//#13028 инвертировать реквизит
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.УказыватьEmailОтправителяКакEmailКлиента = НЕ СпрОбъект.УДАЛИТЬ_НеУказыватьEmailОтправителяКакEmailКлиента;
		
		СпрОбъект.Записать();
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_12_0

Процедура ОбработкаОбновления_2_8_12_0() Экспорт

	ВерсияПрограммы = "2.8.12.0";
	
	//#13068 очистить измерение 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Период КАК Дата,
	|	ДанныеРегистра.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(, , Регистратор, НЕ УДАЛИТЬ_ЗаказНаПроизводство = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)) КАК ДанныеРегистра";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_15_0

Процедура ОбработкаОбновления_2_8_15_0() Экспорт

	ВерсияПрограммы = "2.8.15.0";
	
	//#13253
	Справочники.СтатусыЗаказовПокупателей.ЗаполнитьПоставляемыеСтатусы();	
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_19_0

Процедура ОбработкаОбновления_2_8_19_0() Экспорт

	ВерсияПрограммы = "2.8.19.0";
	
	//#13344
	Справочники.СтатусыСборкиЗаказов.ЗаполнитьПоставляемыеСтатусы();	
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_20_0

Процедура ОбработкаОбновления_2_8_20_0() Экспорт

	ВерсияПрограммы = "2.8.20.0";
	
	// №13388
	ВыборкаПользователи = Справочники.Пользователи.Выбрать();
	
	Пока ВыборкаПользователи.Следующий() Цикл
		
		ПользовательОбъект = ВыборкаПользователи.ПолучитьОбъект();
		
		ПользовательОбъект.ЧастотаАвтоматическогоОбновленияСписковВАРМПроизводства = 60;
		ПользовательОбъект.ЧастотаАвтоматическогоОбновленияСписковВАРМРозницы = 60;
		
		ПользовательОбъект.ОбменДанными.Загрузка = Истина;
		ПользовательОбъект.Записать();
		
	КонецЦикла;
	
	// №13380 одинаковые записи МинимальнаяСтоимостьПродукции
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МинимальнаяСтоимостьПродукции.Период КАК Период,
	|	МинимальнаяСтоимостьПродукции.Организация КАК Организация,
	|	МинимальнаяСтоимостьПродукции.Валюта КАК Валюта,
	|	МинимальнаяСтоимостьПродукции.ВидНоменклатуры КАК ВидНоменклатуры,
	|	МинимальнаяСтоимостьПродукции.ВидЦены КАК ВидЦены,
	|	МинимальнаяСтоимостьПродукции.Фактура КАК Фактура,
	|	МинимальнаяСтоимостьПродукции.ЦветФактуры КАК ЦветФактуры,
	|	МинимальнаяСтоимостьПродукции.Шаблон КАК Шаблон,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.МинимальнаяСтоимостьПродукции КАК МинимальнаяСтоимостьПродукции

	|СГРУППИРОВАТЬ ПО
	|	МинимальнаяСтоимостьПродукции.Период,
	|	МинимальнаяСтоимостьПродукции.Организация,
	|	МинимальнаяСтоимостьПродукции.Валюта,
	|	МинимальнаяСтоимостьПродукции.ВидНоменклатуры,
	|	МинимальнаяСтоимостьПродукции.ВидЦены,
	|	МинимальнаяСтоимостьПродукции.Фактура,
	|	МинимальнаяСтоимостьПродукции.ЦветФактуры,
	|	МинимальнаяСтоимостьПродукции.Шаблон
	|	
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|;
	|///////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МинимальнаяСтоимостьПродукции.Период КАК Дата,
	|	МинимальнаяСтоимостьПродукции.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрСведений.МинимальнаяСтоимостьПродукции КАК МинимальнаяСтоимостьПродукции

	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО МинимальнаяСтоимостьПродукции.Период = ВТ.Период
	|			И МинимальнаяСтоимостьПродукции.Организация = ВТ.Организация
	|			И МинимальнаяСтоимостьПродукции.Валюта = ВТ.Валюта
	|			И МинимальнаяСтоимостьПродукции.ВидНоменклатуры = ВТ.ВидНоменклатуры
	|			И МинимальнаяСтоимостьПродукции.ВидЦены = ВТ.ВидЦены
	|			И МинимальнаяСтоимостьПродукции.Фактура = ВТ.Фактура
	|			И МинимальнаяСтоимостьПродукции.ЦветФактуры = ВТ.ЦветФактуры
	|			И МинимальнаяСтоимостьПродукции.Шаблон = ВТ.Шаблон
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, "Одинаковые документы по установке минимальной стоимости продукции на одну дату.");
	КонецЦикла;
	
	// №13407
	РегЗадание = РегламентныеЗадания.НайтиПредопределенное("ОбновлениеИндексаППД");
	РегЗадание.Использование = Ложь;
	РегЗадание.Записать();
	
	РегЗадание = РегламентныеЗадания.НайтиПредопределенное("СлияниеИндексаППД");
	РегЗадание.Использование = Ложь;
	РегЗадание.Записать();
	
	ПолнотекстовыйПоиск.УстановитьРежимПолнотекстовогоПоиска(РежимПолнотекстовогоПоиска.Запретить);
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_21_0

Процедура ОбработкаОбновления_2_8_21_0() Экспорт

	ВерсияПрограммы = "2.8.21.0";
	
	// #13426
	Если Софтфон.ИспользуетсяИнтеграцияСIPАТС() Тогда
		Константы.ВариантБиблиотекиТелефонии.Установить(1);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_22_0

Процедура ОбработкаОбновления_2_8_22_0() Экспорт

	ВерсияПрограммы = "2.8.22.0";
	
	// #13457
	//ЗД в РН "Расчеты по заказам" сумму должен помещать в валюте заказа
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПоЗаказамобороты.Заказ КАК Ссылка,
	|	РасчетыПоЗаказамобороты.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Заказ ССЫЛКА Документ.ЗаказДоговор
	|				И НЕ ВЫРАЗИТЬ(Заказ КАК Документ.ЗаказДоговор).Валюта = &ВалютаУчета) КАК РасчетыПоЗаказамобороты";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_25_0

Процедура ОбработкаОбновления_2_8_25_0() Экспорт

	ВерсияПрограммы = "2.8.25.0";
	
	Константы.ИспользоватьСервисSmartConnector.Установить(СофтФон.ИспользуетсяИнтеграцияСIPАТС() 
															И Константы.ВариантБиблиотекиТелефонии.Получить() = 0
															И НЕ Константы.ИспользоватьROMAsterisk.Получить());
	
	// #13511 перенос отдельных реквизитов в шапку
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводОстатков.Ссылка КАК Ссылка,
	|	ВводОстатков.Дата КАК Дата
	|ИЗ
	|	Документ.ВводОстатков КАК ВводОстатков
	|ГДЕ
	|	ВводОстатков.Проведен
	|	И ВводОстатков.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// #13536
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникПользователи.Ссылка,
	|	СправочникПользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК СправочникПользователи";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		//СвойстваПользователя = Неопределено;
		//Если Пользователи.ПрочитатьПользователяИБ(Выборка.ИдентификаторПользователяИБ, СвойстваПользователя) Тогда
		СвойстваПользователя = Пользователи.СвойстваПользователяИБ(Выборка.ИдентификаторПользователяИБ); 
			Если НЕ СвойстваПользователя.Роли.Найти("АРМПроизводства") = Неопределено
				И СвойстваПользователя.Роли.Найти("АРМСотрудникаПроизводства") = Неопределено Тогда
				
				СвойстваПользователя.Роли.Добавить("АРМСотрудникаПроизводства");					
				//Пользователи.ЗаписатьПользователяИБ(Выборка.ИдентификаторПользователяИБ, СвойстваПользователя);
				Пользователи.УстановитьСвойстваПользователяИБ(Выборка.ИдентификаторПользователяИБ, СвойстваПользователя);	
			КонецЕсли;			
		//КонецЕсли;		
	КонецЦикла;
	
	// №13460
	ВалютаОбъект = Справочники.Валюты.KZT.ПолучитьОбъект();
	ВалютаОбъект.Наименование = "KZT";	
	ВалютаОбъект.Записать();
	
	ВыборкаВалюты = Справочники.Валюты.Выбрать();
	
	Пока ВыборкаВалюты.Следующий() Цикл
		
		Если ВыборкаВалюты.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаВалюты.Ссылка = Константы.ВалютаУчета.Получить()
			ИЛИ ВыборкаВалюты.Ссылка = Константы.ВалютаДополнительногоУчетаЗапасов.Получить()
		    ИЛИ ВыборкаВалюты.Ссылка = Константы.ОсновнаяВалютаПересчетаЦены.Получить() Тогда
			
			ВалютаОбъект = ВыборкаВалюты.Ссылка.ПолучитьОбъект();
			ВалютаОбъект.Используется = Истина;		
			ВалютаОбъект.Записать();
			
			Продолжить;
		
		КонецЕсли;
			
		МассивСсылок = новый Массив;
		МассивСсылок.Добавить(ВыборкаВалюты.Ссылка);
		
		НайденныеСсылки = НайтиПоСсылкам(МассивСсылок);
		
		Если НайденныеСсылки.Количество() = 0 Тогда
			
			ВалютаОбъект = ВыборкаВалюты.Ссылка.ПолучитьОбъект();
			ВалютаОбъект.Используется = Ложь;		
			ВалютаОбъект.Записать();

			Продолжить;
		КонецЕсли;
		
		ВалютаОбъект = ВыборкаВалюты.Ссылка.ПолучитьОбъект();
		ВалютаОбъект.Используется = Истина;		
		ВалютаОбъект.Записать();
		
	КонецЦикла;
	
	// №13299
	Если Константы.УчитыватьБонусы.Получить() Тогда
		Константы.СписыватьБонусыПоДокументуРеализацияТоваровИУслуг.Установить(Истина);
	КонецЕсли;
	
	// №13299 новый реквизит "СписыватьБонусы" в реализациях, нужно установить если установлена галочка СлужебныйУчитыватьБонусы
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.СлужебныйУчитыватьБонусы";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_28_0

Процедура ОбработкаОбновления_2_8_28_0() Экспорт

	ВерсияПрограммы = "2.8.28.0";
	
	// #13511 
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
		|	ВводОстатковТоварыНаСкладах.Ссылка КАК Ссылка,
		|	ВводОстатковТоварыНаСкладах.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.ВводОстатков.ТоварыНаСкладах КАК ВводОстатковТоварыНаСкладах
		|ГДЕ
		|	ВводОстатковТоварыНаСкладах.ЕдиницаИзмерения = НЕОПРЕДЕЛЕНО
		|	И ВводОстатковТоварыНаСкладах.Ссылка.Комментарий ПОДОБНО ""%#Создан%""
		|	И ВводОстатковТоварыНаСкладах.Ссылка.Проведен
		|ИТОГИ ПО
		|	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Ссылка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_29_0

Процедура ОбработкаОбновления_2_8_29_0() Экспорт

	ВерсияПрограммы = "2.8.29.0";
	
	// #13742 заполнение нового реквизита 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникПользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК СправочникПользователи
	|ГДЕ
	|	СправочникПользователи.ОграничиватьДоступПоКассамИБанковскимСчетамОрганизаций
	|	И НЕ СправочникПользователи.Недействителен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.ВидОграниченияДоступаПоКассамИБанковскимСчетам = Перечисления.ВидыОграниченияДоступа.ВсеЗапрещеныКромеУказанных;
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			СпрОбъект.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_30_0

Процедура ОбработкаОбновления_2_8_30_0() Экспорт

	ВерсияПрограммы = "2.8.30.0";
	
	// #13821 перезаполнение реквизита: ИсторияВыполнения больше не используется 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Задание.Ссылка КАК Ссылка
	|ИЗ
	|	БизнесПроцесс.Задание КАК Задание
	|ГДЕ
	|	НЕ Задание.Завершен";
		
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
		СпрОбъект.РезультатИсполнения = Спробъект.ИсторияВыполнения;
		
		Попытка
			СпрОбъект.Записать();
		Исключение			
		КонецПопытки;
		
	КонецЦикла;
	
	// #13821 заполнение новых реквизитов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Задание.Ссылка КАК Ссылка,
	|	Задание.Дата КАК Дата
	|ИЗ
	|	БизнесПроцесс.Задание КАК Задание
	|ГДЕ
	|	Задание.Завершен";	
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// отмененные заказы покупателей с движениями в регистре "Заказы покупателей"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаказыПокупателей.Регистратор КАК Ссылка,
	|	ЗаказыПокупателей.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	|ГДЕ
	|	ЗаказыПокупателей.Регистратор ССЫЛКА Документ.ЗаказПокупателя
	|	И ЗаказыПокупателей.Регистратор.ТекущийСтатус = Значение(Справочник.СтатусыЗаказовПокупателей.Отменен)";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#13885
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ЗаказНаПроизводство.Продукция КАК ДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Сумма
	|ИЗ
	|	Документ.ЗаказНаПроизводство.Товары КАК ДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Сумма
	|ИЗ
	|	Документ.ЗаказНаПроизводство.Услуги КАК ДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.ПродукцияСумма
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ДанныеДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Ссылка.Дата КАК Дата
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка,
	|	ВТ.Ссылка.Дата
	|
	|ИМЕЮЩИЕ
	|	НЕ ВТ.Ссылка.СуммаДокумента = СУММА(ВТ.Сумма)";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_31_0

Процедура ОбработкаОбновления_2_8_31_0() Экспорт

	ВерсияПрограммы = "2.8.31.0";
	
	// #12982 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Потолок_Фактура КАК СправочникНоменклатураПотолок_Фактура
	|		ПО СправочникНоменклатура.Ссылка = СправочникНоменклатураПотолок_Фактура.Ссылка
	|ГДЕ
	|	СправочникНоменклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез))
	|	И СправочникНоменклатураПотолок_Фактура.НомерСтроки ЕСТЬ NULL
	|	И (НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалКаталог = """"
	|		ИЛИ НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалМатериал = """"
	|		ИЛИ НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалЦвет = """"
	|		ИЛИ НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_ШиринаПолотна = 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Потолок_Фактура КАК СправочникНоменклатураПотолок_Фактура
	|		ПО СправочникНоменклатура.Ссылка = СправочникНоменклатураПотолок_Фактура.Ссылка
	|			И (СправочникНоменклатураПотолок_Фактура.НомерСтроки = 1)
	|ГДЕ
	|	СправочникНоменклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез))

	|	И (     (НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалКаталог = """" 
	|		    И НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалКаталог = СправочникНоменклатураПотолок_Фактура.Фактура_МатериалКаталог)
	|		ИЛИ (НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалМатериал = """"
	|			И НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалМатериал = СправочникНоменклатураПотолок_Фактура.Фактура_МатериалМатериал)
	|		ИЛИ (НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалЦвет = """"
	|			И НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалЦвет = СправочникНоменклатураПотолок_Фактура.Фактура_МатериалЦвет)
	|		ИЛИ (НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_ШиринаПолотна = 0
	|			И НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_ШиринаПолотна = СправочникНоменклатураПотолок_Фактура.Фактура_ШиринаПолотна)
	|	)
	|";
		
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса(), , 900);		
	КонецЦикла;
	
	// #12982 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Потолок_Фактура КАК СправочникНоменклатураПотолок_Фактура
	|		ПО СправочникНоменклатура.Ссылка = СправочникНоменклатураПотолок_Фактура.Ссылка
	|			И (СправочникНоменклатураПотолок_Фактура.НомерСтроки = 1)
	|ГДЕ
	|	СправочникНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	|	И (СправочникНоменклатура.Потолок_КоличествоВыработка = 0
	|		ИЛИ СправочникНоменклатураПотолок_Фактура.Фактура_КоличествоВыработка = 0)";
		
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса(), , 901);		
	КонецЦикла;
	
	// #13763 заполнение новых измерений и ресурсов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.РасходМатериаловНаПроизводстве КАК ДанныеРегистра
	|ГДЕ
	|	(ДанныеРегистра.КоличествоВБазовыхЕдиницах = 0
	|			ИЛИ ДанныеРегистра.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_33_0

Процедура ОбработкаОбновления_2_8_33_0() Экспорт

	ВерсияПрограммы = "2.8.33.0";
	
	// №14035 в УСВ по монтажу появилось применение к ТЧ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Ссылка КАК Ссылка,
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Дата КАК Дата
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК УстановкаСтоимостиВыработкиПоНоменклатуре
	|ГДЕ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = Значение(Справочник.ВидыДокументовРасчетаВыработки.Монтаж)";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// №14124 исправление выпусков с пустым видом заказа
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка КАК Ссылка,
	|	ВыпускПродукции.Дата КАК Дата
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.ВидЗаказа = Значение(Перечисление.ВидыЗаказовНаПроизводство.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// №13388
	ВыборкаПользователи = Справочники.Пользователи.Выбрать();
	
	Пока ВыборкаПользователи.Следующий() Цикл
		
		ПользовательОбъект = ВыборкаПользователи.ПолучитьОбъект();
		
		ПользовательОбъект.ЧастотаАвтоматическогоОбновленияСписковВРабочемМестеСотрудникаСклада = 60;
		
		ПользовательОбъект.ОбменДанными.Загрузка = Истина;
		ПользовательОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_34_0

Процедура ОбработкаОбновления_2_8_34_0() Экспорт

	ВерсияПрограммы = "2.8.34.0";
	
	// №13196 исправляем наименование для печати у потолков и отрезов
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.ВидНоменклатуры В (Значение(Справочник.ВидыНоменклатуры.Потолок), Значение(Справочник.ВидыНоменклатуры.Отрез))
	|	И НЕ СпрНоменклатура.Наименование = СпрНоменклатура.НаименованиеДляПечати
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
	// №14125 для всех документов "Возврат уникальной продукции" скопировать движения из РН "Ответственность за браки" в РН "Выработка исполнителей производства"
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтветственностьЗаБракиНаПроизводстве.Регистратор КАК Ссылка,
	|	ОтветственностьЗаБракиНаПроизводстве.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.УДАЛИТЬ_ОтветственностьЗаБракиНаПроизводстве КАК ОтветственностьЗаБракиНаПроизводстве
	|ГДЕ
	|	ОтветственностьЗаБракиНаПроизводстве.Регистратор ССЫЛКА Документ.ВозвратПродукции
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 100);
	КонецЦикла;
	
	//// №14125 Все документы "Возврат уникальной продукции", у которых есть введенные на основании документы "Штраф"
	//// поместить в очередь к обработке после обновления с текстом "Документ "Возврат уникальной продукции" имеет дублирующее начисление отрицательной выработки документом "Штраф"
	//Запрос = новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Штраф.Основание КАК Ссылка,
	//|	Штраф.Основание.Дата КАК Дата
	//|ИЗ
	//|	Документ.Штраф КАК Штраф
	//|ГДЕ
	//|	Штраф.Проведен
	//|	И Штраф.Основание ССЫЛКА Документ.ВозвратПродукции
	//|	И НЕ Штраф.Основание = Значение(Документ.ВозвратПродукции.ПустаяСсылка)
	//|";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	ТекстОшибки = "Документ ""Возврат уникальной продукции"" имеет дублирующее начисление отрицательной выработки документом ""Штраф"".";
	//	//ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, ТекстОшибки, 200);
	//	ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, ТекстОшибки, 200);
	//КонецЦикла;
	
	// #13834 
	БонусыСервер.ОбработчикиПриОбновленииНаВерсию_2_8_34();
	// при обновлении поместить все документы, которые начислили бонусы в очередь к обработке после обновления 
	// для дальнейшей сверки суммы бонусов по новой и старой схеме
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	БонусыКонтрагентовОбороты.Период КАК Дата,
	|	БонусыКонтрагентовОбороты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.БонусыКонтрагентов.Обороты(, , Регистратор, ) КАК БонусыКонтрагентовОбороты
	|ГДЕ
	|	БонусыКонтрагентовОбороты.СуммаПриход > 0
	|	И (БонусыКонтрагентовОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровИУслуг
	|		ИЛИ БонусыКонтрагентовОбороты.Регистратор ССЫЛКА Документ.ОплатаБанковскойКартой
	|		ИЛИ БонусыКонтрагентовОбороты.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|		ИЛИ БонусыКонтрагентовОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|		ИЛИ БонусыКонтрагентовОбороты.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	|      )
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;

	// #14174 версия "2.8.33.0" содержит баг по зп
	МенеджерЗаписи = РегистрыСведений.ИсторияВерсий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Версия = "2.8.33.0";
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаВерсии33", МенеджерЗаписи.ДатаУстановки);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыпускПродукции.Ссылка КАК Ссылка,
		|	ВыпускПродукции.Дата КАК Дата
		|ИЗ
		|	Документ.ВыпускПродукции КАК ВыпускПродукции
		|ГДЕ
		|	ВыпускПродукции.Проведен
		|	И ВыпускПродукции.Дата >= &ДатаВерсии33
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка,
		|	ЗаказПокупателя.Дата
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Проведен
		|	И (ЗаказПокупателя.ДатаЗакрытия >= &ДатаВерсии33
		|			ИЛИ ЗаказПокупателя.ДатаВыполнения >= &ДатаВерсии33)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Лид.Ссылка,
		|	Лид.Дата
		|ИЗ
		|	Документ.Лид КАК Лид
		|ГДЕ
		|	Лид.Проведен
		|	И Лид.Дата >= &ДатаВерсии33";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_35_0

Процедура ОбработкаОбновления_2_8_35_0() Экспорт

	ВерсияПрограммы = "2.8.35.0";
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_36_0

Процедура ОбработкаОбновления_2_8_36_0() Экспорт

	ВерсияПрограммы = "2.8.36.0";
	
	// #13763 заполнение новых измерений и ресурсов
	// #14216 при обновлении не включены изменения ОбработкаПроведения, поэтому повторно в очередь с номром версии "2.8.31.0", для нее есть обработчик
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.РасходМатериаловНаПроизводстве КАК ДанныеРегистра
	|ГДЕ
	|	(ДанныеРегистра.КоличествоВБазовыхЕдиницах = 0
	|			ИЛИ ДанныеРегистра.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке("2.8.31.0", Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// в БонусыКонтрагентов добавлен реквизит "КатегорияКонтрагента" 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.БонусыКонтрагентов КАК ДанныеРегистра
	|ГДЕ
	|	НЕ ДанныеРегистра.ДокументНАНБ = ЗНАЧЕНИЕ(Документ.НастройкаАвтоматическихНачисленийБонусов.ПустаяСсылка)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_2_8_37_0

Процедура ОбработкаОбновления_2_8_37_0() Экспорт

	ВерсияПрограммы = "2.8.37.0";
	
	//версия "2.8.31.0" - был баг с помещением объектов к обработке: именно у тех, у кого устанавливалась эта версия. с 2.8.32 было исправлено
	МенеджерЗаписи = РегистрыСведений.ИсторияВерсий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Версия = "2.8.31.0";
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		ОбработкаОбновления_2_8_31_0();
	КонецЕсли;
	
	// №14262 в документе "Состав производственной смены" появился реквизит "Организация"
	Документы.СоставПроизводственнойСмены.ЗаполнитьНовоеПолеОрганизация(ВерсияПрограммы);
	
	// нужно очистить измерение "Документ" 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВзаиморасчетыСКонтрагентами.Регистратор КАК Ссылка,
	|	ВзаиморасчетыСКонтрагентами.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
	
#Область Обновление_3_0_0_0

Процедура ОбработкаОбновления_3_0_0_0() Экспорт
	
	ВерсияПрограммы = "3.0.0.0";
	
	//++ №13851 Слияние нумераторов расчета в один регистр
	// 1. В регистре "НомераРасчетов" удалены измерения "НомерРасчета", "НомерМесяца", "НомерГода", которые были строковым
	// вместо них добавлены числовые измерения "НомерЧислом", "Месяц" и "Год" (по аналогии с регистром "Номера конструкций") + добавлен признак вида номенклатуры
	// поэтому сначала перенесем из строки в число, потом по номеру расчета попытаемся найти номенклатуру для определения её вида
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(НомераРасчетов.УДАЛИТЬ_НомерМесяца,0) КАК УДАЛИТЬ_НомерМесяца,
	|	ЕСТЬNULL(НомераРасчетов.УДАЛИТЬ_НомерГода,0) КАК УДАЛИТЬ_НомерГода,
	|	ЕСТЬNULL(НомераРасчетов.УДАЛИТЬ_НомерРасчета,0) КАК УДАЛИТЬ_НомерРасчета,
	|	НомераРасчетов.Дата КАК Дата,
	|	НомераРасчетов.Ответственный КАК Ответственный,
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Потолок_НомерРасчета КАК Потолок_НомерРасчета,
	|	ЕСТЬNULL(Номенклатура.ВидНоменклатуры, Значение(Справочник.ВидыНоменклатуры.ПустаяСсылка)) КАК ВидНоменклатуры
	|ИЗ
	|	РегистрСведений.НомераРасчетов КАК НомераРасчетов
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ((ВЫРАЗИТЬ(НомераРасчетов.УДАЛИТЬ_НомерМесяца + НомераРасчетов.УДАЛИТЬ_НомерГода + ""-"" + НомераРасчетов.УДАЛИТЬ_НомерРасчета КАК СТРОКА(30))) = Номенклатура.Потолок_НомерРасчета)
	|			И (Номенклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.Потолок) Или Номенклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.Отрез))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.НомераРасчетов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.УДАЛИТЬ_НомерМесяца.Установить(Выборка.УДАЛИТЬ_НомерМесяца);
			НаборЗаписей.Отбор.УДАЛИТЬ_НомерГода.Установить(Выборка.УДАЛИТЬ_НомерГода);
			НаборЗаписей.Отбор.УДАЛИТЬ_НомерРасчета.Установить(Выборка.УДАЛИТЬ_НомерРасчета);
			
			НаборЗаписей.Прочитать();
			
			Для Каждого Запись Из НаборЗаписей Цикл
				
				Запись.Месяц = Число(Запись.УДАЛИТЬ_НомерМесяца);
				Запись.Год = 2000 + Число(Запись.УДАЛИТЬ_НомерГода);
				Запись.НомерЧислом = Число(Запись.УДАЛИТЬ_НомерРасчета);
				Запись.ВидНоменклатуры = Выборка.ВидНоменклатуры;
				
			КонецЦикла;
			
			НаборЗаписей.Записать();
			
		Исключение
			ЗаписьЖурналаРегистрации("ОбработкаОбновления_3_0_0_0", УровеньЖурналаРегистрации.Ошибка, РегистрыСведений.НомераРасчетов,,
			"Ошибка преобразования номера расчета в число." 
			+ Символы.ПС + "Месяц = " + Выборка.УДАЛИТЬ_НомерМесяца
			+ Символы.ПС + "Год = " + Выборка.УДАЛИТЬ_НомерГода
			+ Символы.ПС + "НомерЧислом = " + Выборка.УДАЛИТЬ_НомерРасчета
			+ Символы.ПС + "ВидНоменклатуры = " + Выборка.ВидНоменклатуры
			+ Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		
	КонецЦикла;
	
	// 2. Переносим данные из регистра "Номера конструкций" в "Номера расчетов"
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НомераКонструкций.Месяц КАК Месяц,
	|	НомераКонструкций.Год КАК Год,
	|	НомераКонструкций.НомерЧислом КАК НомерЧислом,
	|	НомераКонструкций.Дата КАК Дата,
	|	НомераКонструкций.Ответственный КАК Ответственный,
	|	Значение(Справочник.ВидыНоменклатуры.Продукция) КАК ВидНоменклатуры
	|ИЗ
	|	РегистрСведений.УДАЛИТЬ_НомераКонструкций КАК НомераКонструкций";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.НомераРасчетов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	// 3. Помещаем дубли номенклатур по номерам расчетов (исключая типовые отрезы) для ручного исправления
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Потолок_НомерРасчета КАК НомерРасчета,
	|	Номенклатура.Потолок_ИндексПотолка КАК ИндексПотолка,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_ДублиНомеров
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	(НЕ Номенклатура.Потолок_НомерРасчета = """" Или НЕ Номенклатура.Потолок_ИндексПотолка = """")
	|	И НЕ Номенклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.ТиповойОтрез)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.Потолок_НомерРасчета,
	|	Номенклатура.Потолок_ИндексПотолка
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|	
	|;
	|////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Потолок_НомерРасчета КАК НомерРасчета,
	|	Номенклатура.Потолок_ИндексПотолка КАК ИндексПотолка,
	|	ДублиНомеров.Количество КАК КоличествоНоменклатур
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДублиНомеров КАК ДублиНомеров
	|		ПО Номенклатура.Потолок_НомерРасчета = ДублиНомеров.НомерРасчета
	|			И Номенклатура.Потолок_ИндексПотолка = ДублиНомеров.ИндексПотолка
	|";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеОшибки = СтрШаблон("В справочнике ""Номенклатура"" имеется %1 карточки с одинаковым номером расчета %2%3",
			Выборка.КоличествоНоменклатур,
			Выборка.НомерРасчета,
			?(ЗначениеЗаполнено(Выборка.ИндексПотолка), " и индексом " + Выборка.ИндексПотолка, "")
		);
		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса(), ОписаниеОшибки);
		
	КонецЦикла;
	//-- №13851
	
	//++ №13930 в документе "Ввод остатков" для операций "Товары на складах" и "Материалы в эксплуатации" добавлена колонка "Цена"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводОстатков.Ссылка КАК Ссылка,
	|	ВводОстатков.Дата КАК Дата
	|ИЗ
	|	Документ.ВводОстатков КАК ВводОстатков
	|ГДЕ
	|	ВводОстатков.ТипОперации В (Значение(Перечисление.ТипыОперацийВводаОстатков.ТоварыНаСкладах), Значение(Перечисление.ТипыОперацийВводаОстатков.МатериалыВЭксплуатации))
	|";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	//-- №13930
	
	//++ #13943 для заполнения нового реквизита Менеджер
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Лид КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Менеджер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ДанныеДокумента.Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#13943
	Константы.СпособЗаполненияМенеджераВЛиде.Установить(Перечисления.ВариантыЗаполненияМенеджера.ЗаполнятьСотрудникомПользователя);
	Константы.СпособЗаполненияМенеджераВЗаказДоговоре.Установить(Перечисления.ВариантыЗаполненияМенеджера.ЗаполнятьСотрудникомПользователя);
	Константы.СпособЗаполненияМенеджераВЗаказеПокупателя.Установить(Перечисления.ВариантыЗаполненияМенеджера.ЗаполнятьСотрудникомПользователя);
	Константы.СпособЗаполненияМенеджераВРеализации.Установить(Перечисления.ВариантыЗаполненияМенеджера.ЗаполнятьМенеджеромДокументаОснования);
	
	//++ #13943 для заполнения нового реквизита ОтветственныйМенеджер
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.УДАЛИТЬ_ОтветственныйМенеджер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ДанныеСправочника.УДАЛИТЬ_ОтветственныйПользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
	// №13942 пока УБРАНО заполнение при обновлении
	// в РС Замеры добавлено измерение "НазначилЗамерПользователь"
	//Запрос = новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	Замеры.ДокументЗамер КАК Ссылка,
	//|	Замеры.ДокументЗамер.Дата КАК Дата
	//|ИЗ
	//|	РегистрСведений.Замеры КАК Замеры
	//|ГДЕ
	//|	Замеры.ДокументЗамер ССЫЛКА Документ.Лид
	//|	И НЕ Замеры.НазначилЗамер = Значение(Справочник.Сотрудники.ПустаяСсылка)
	//|";
	//
	//РезультатЗапроса = Запрос.Выполнить();	
	//Выборка = РезультатЗапроса.Выбрать();	
	//
	//Пока Выборка.Следующий() Цикл
	//	ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата,, 100);
	//КонецЦикла;
	
	// №14311 на каждую организацию, у которой есть хотя бы один документ ЗП, ЗНП или Выпуск продукции создается новый документ "Настройка контроля материалов в производстве"
	Документы.НастройкаКонтроляМатериаловВПроизводстве.СоздатьНовыеДокументы();
	
	// В документах "Начисление и списание бонусов" если у всех записей указана дисконтная карта
	// и снят флаг "(служебный) Учет бонусов по дисконтным картам" - нужно его установить
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НачислениеБонусовКонтрагентамБонусы.Ссылка КАК Ссылка,
	|	МАКСИМУМ(НачислениеБонусовКонтрагентамБонусы.Ссылка.СлужебныйУчетБонусовПоДисконтнымКартам) КАК СлужебныйУчетБонусовПоДисконтнымКартам,
	|	СУММА(ВЫБОР
	|		КОГДА НачислениеБонусовКонтрагентамБонусы.ДисконтнаяКарта = Значение(Справочник.ДисконтныеКарты.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоличествоПусто,
	|	СУММА(ВЫБОР
	|		КОГДА НЕ НачислениеБонусовКонтрагентамБонусы.ДисконтнаяКарта = Значение(Справочник.ДисконтныеКарты.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоличествоЗаполнено
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.НачислениеБонусовКонтрагентам.Бонусы КАК НачислениеБонусовКонтрагентамБонусы
	|	
	|СГРУППИРОВАТЬ ПО 
	|	НачислениеБонусовКонтрагентамБонусы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеБонусовКонтрагентамСписаниеБонусов.Ссылка КАК Ссылка,
	|	МАКСИМУМ(НачислениеБонусовКонтрагентамСписаниеБонусов.Ссылка.СлужебныйУчетБонусовПоДисконтнымКартам) КАК СлужебныйУчетБонусовПоДисконтнымКартам,
	|	СУММА(ВЫБОР
	|		КОГДА НачислениеБонусовКонтрагентамСписаниеБонусов.ДисконтнаяКарта = Значение(Справочник.ДисконтныеКарты.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоличествоПусто,
	|	СУММА(ВЫБОР
	|		КОГДА НЕ НачислениеБонусовКонтрагентамСписаниеБонусов.ДисконтнаяКарта = Значение(Справочник.ДисконтныеКарты.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоличествоЗаполнено
	|ИЗ
	|	Документ.НачислениеБонусовКонтрагентам.СписаниеБонусов КАК НачислениеБонусовКонтрагентамСписаниеБонусов
	|	
	|СГРУППИРОВАТЬ ПО 
	|	НачислениеБонусовКонтрагентамСписаниеБонусов.Ссылка
	|	
	|;
	|////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Ссылка.Дата КАК Дата
	|Из
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка,
	|	ВТ.СлужебныйУчетБонусовПоДисконтнымКартам
	|ИМЕЮЩИЕ СУММА(ВТ.КоличествоПусто) = 0
	|	И СУММА(ВТ.КоличествоЗаполнено) > 0
	|	И НЕ ВТ.СлужебныйУчетБонусовПоДисконтнымКартам
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// #14300 нужно заполнить новое измерение "ЕдиницаИзмерения" и ресурс "КоличествоВЕдиницахДокумента" в регистре накопления "Продажи"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Продажи.Регистратор КАК Ссылка,
	|	Продажи.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//++ №14311
	// Предопределленной номенклатуре "ПолотноЗаказчика" поставить вид номенклатуры = "Полотно" и "Материал заказчика" = ИСТИНА
	НоменклатураОбъект = Справочники.Номенклатура.ПолотноЗаказчика.ПолучитьОбъект();
	НоменклатураОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно;
	НоменклатураОбъект.МатериалЗаказчика = Истина;
	
	НоменклатураОбъект.ОбменДанными.Загрузка = Истина;
	НоменклатураОбъект.Записать();
	
	// Предопределленной номенклатуре "ПрофильЗаказчика" поставить вид номенклатуры = "Товары и материалы" и "Материал заказчика" = ИСТИНА
	НоменклатураОбъект = Справочники.Номенклатура.ПрофильЗаказчика.ПолучитьОбъект();
	НоменклатураОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал;
	НоменклатураОбъект.МатериалЗаказчика = Истина;
	
	НоменклатураОбъект.ОбменДанными.Загрузка = Истина;
	НоменклатураОбъект.Записать();
	
	// Для всех пользовательских номенклатур, с видом "Материал заказчика" поставить вид = "Товары и материалы" и "Материал заказчика" = ИСТИНА
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.УДАЛИТЬ_МатериалЗаказчика)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	//-- №14311
	
	//#14300 остался только 1 вариант отчета
	Если Константы.ОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетов.Получить()
		И НЕ Константы.ИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.Получить() = "По заказам покупателя" Тогда
	    Константы.ИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.Установить("По заказам покупателя");
	КонецЕсли;
	
	// №14537 В документах УСВ с видом документа расчета "Заказ покупателя" во всех ТЧ снять галочку "По выработке", если она была установлена.
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК УстановкаСтоимостиВыработкиПоНоменклатуре
	|ГДЕ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = Значение(Справочник.ВидыДокументовРасчетаВыработки.ЗаказПокупателя)
	|	И (УстановкаСтоимостиВыработкиПоНоменклатуре.ВыработкаПоВидамНоменклатуры.ПоВыработке
	|		ИЛИ УстановкаСтоимостиВыработкиПоНоменклатуре.ВыработкаПоНоменклатуре.ПоВыработке)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Для Каждого ТекущаяСтрока Из ДокументОбъект.ВыработкаПоВидамНоменклатуры Цикл
			ТекущаяСтрока.ПоВыработке = Ложь;
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из ДокументОбъект.ВыработкаПоНоменклатуре Цикл
			ТекущаяСтрока.ПоВыработке = Ложь;
		КонецЦикла;
		
		ДокументОбъект.Записать();
		
	КонецЦикла;
	
	//#14544
	Если НЕ Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокумента.ПериодРегистрации КАК ПериодРегистрации,
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата
		|ИЗ
		|	Документ.НачислениеЗарплаты КАК ДанныеДокумента
		|ГДЕ
		|	НЕ ДанныеДокумента.ПериодРегистрации = НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, МЕСЯЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.ПериодРегистрации,
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам)
		|	И НЕ ДанныеДокумента.ПериодРегистрации = НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, МЕСЯЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.ПериодРегистрации,
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее КАК ДанныеДокумента
		|ГДЕ
		|	(ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам)
		|			ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику))
		|	И НЕ ДанныеДокумента.ПериодРегистрации = НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, МЕСЯЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.ПериодРегистрации,
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета КАК ДанныеДокумента
		|ГДЕ
		|	(ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам)
		|			ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику))
		|	И НЕ ДанныеДокумента.ПериодРегистрации = НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, МЕСЯЦ)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		КонецЦикла;
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_1_0

Процедура ОбработкаОбновления_3_0_1_0() Экспорт
	
	ВерсияПрограммы = "3.0.1.0";
	
	//++ #14573 заполение нового реквизита ВидНоменклатуры
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.УстановкаИндивидуальныхЦенНаУслугиПроизводства КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_2_0

Процедура ОбработкаОбновления_3_0_2_0() Экспорт
	
	ВерсияПрограммы = "3.0.2.0";
	
	// №14604 при копировании номенклатуры, реквизиты "ОсновнаяСпецификацияКомплектация" и "ОсновнаяСпецификацияСопутствующиеМатериалы" не очищались
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	(НЕ Номенклатура.ОсновнаяСпецификацияКомплектация = Значение(Справочник.Спецификации.ПустаяСсылка)
	|		ИЛИ НЕ Номенклатура.ОсновнаяСпецификацияСопутствующиеМатериалы = Значение(Справочник.Спецификации.ПустаяСсылка))
	|	И (НЕ Номенклатура.ОсновнаяСпецификацияКомплектация.Владелец = Номенклатура.Ссылка
	|		ИЛИ НЕ Номенклатура.ОсновнаяСпецификацияСопутствующиеМатериалы.Владелец = Номенклатура.Ссылка)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоменклатураОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(НоменклатураОбъект.ОсновнаяСпецификацияКомплектация) И НЕ НоменклатураОбъект.ОсновнаяСпецификацияКомплектация.Владелец = НоменклатураОбъект.Ссылка Тогда
			НоменклатураОбъект.ОсновнаяСпецификацияКомплектация = Справочники.Спецификации.ПустаяСсылка();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоменклатураОбъект.ОсновнаяСпецификацияСопутствующиеМатериалы) И НЕ НоменклатураОбъект.ОсновнаяСпецификацияСопутствующиеМатериалы.Владелец = НоменклатураОбъект.Ссылка Тогда
			НоменклатураОбъект.ОсновнаяСпецификацияСопутствующиеМатериалы = Справочники.Спецификации.ПустаяСсылка();
		КонецЕсли;
		
		НоменклатураОбъект.ОбменДанными.Загрузка = Истина;
		
		НоменклатураОбъект.Записать();
		
	КонецЦикла;
	
	// №14608 создаём группы в справочнике "Виды файлов программы построителя" и раскидываем предопределенные элементы по группам
	Справочники.ВидыФайловПрограммыПостроителя.РазместитьПреопределенныеЭлементыПоГруппам();
			
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_3_0

Процедура ОбработкаОбновления_3_0_3_0() Экспорт
	
	ВерсияПрограммы = "3.0.3.0";
	
	//#14642
	Константы.СрокАктуальностиСМСВДнях.Установить(3);
	
	// №14649 у всех выездов лида:
	// а) у которых стоит галочка "ЗамерВыполнен" поставить результат = РезультатыВыездаЛида.ВыездВыполнен
	// б) заполнить новый реквизит дата назначения
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЛидВыезды.Ссылка КАК Ссылка,
	|	ЛидВыезды.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.Лид.Выезды КАК ЛидВыезды";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
	// №14649
	Константы.ВариантИзмененияОтветственногоВЛиде.Установить(Перечисления.ВариантыИзмененияОтветственногоВЛиде.НеЗаполнять);
			
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_5_0

Процедура ОбработкаОбновления_3_0_5_0() Экспорт
	
	ВерсияПрограммы = "3.0.5.0";
	
	//#14171
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка,
	|	НЕ Пользователи.УДАЛИТЬ_ДополнительныеПраваЗапретПечатиНепроведенныхДокументов КАК НовоеЗначение
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПользовательОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПользовательОбъект.РазрешеноПечататьНепроведенныеДокументы = Выборка.НовоеЗначение;
		ПользовательОбъект.ОбменДанными.Загрузка = Истина;
		ПользовательОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_6_0

Процедура ОбработкаОбновления_3_0_6_0() Экспорт
	
	ВерсияПрограммы = "3.0.6.0";
	
	// №14571 в настройках обмена с Б24 (у которых указан адрес портала) галочка "СинхронизацияСделок" устанавливается в значение «Истина».
	СправочникОбъект = Справочники.НастройкиСинхронизацииСБитрикс24.Основная.ПолучитьОбъект();
	Если ЗначениеЗаполнено(СправочникОбъект.Портал) Тогда
		СправочникОбъект.СинхронизацияСделок = Истина;
		СправочникОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_7_0

Процедура ОбработкаОбновления_3_0_7_0() Экспорт
	
	ВерсияПрограммы = "3.0.7.0";
	
	// #14675 
	Константы.УчетОбеспеченностиРозницыПоКомнатам.Установить(Истина);
	
	// #14675
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказовРозницы КАК ДанныеРегистра";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
	// Константа "ИспользоватьНачислениеЗаработнойПлатыНаОснованииМонтажа" будет сохраняться в реквизите документа
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НачислениеЗарплаты.Ссылка КАК Ссылка,
	|	НачислениеЗарплаты.Дата КАК Дата
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	НачислениеЗарплаты.Основание ССЫЛКА Документ.Монтаж
	|	И НЕ НачислениеЗарплаты.Основание = Значение(Документ.Монтаж.ПустаяСсылка)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
	// #14793 заполнение нового реквизита ВидПеремещения
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Основание ССЫЛКА Документ.Монтаж
	|	И НЕ ДанныеДокумента.Основание = ЗНАЧЕНИЕ(Документ.Монтаж.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
	// #14760 для заполнения нового реквизита
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.СоставПроизводственнойСмены КАК ДанныеДокумента
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
	// #14828
	#Область Заявка14828
	ИспользоватьПодразделения = Ложь;
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	Данные.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Подразделения КАК Данные";	
	ВыборкаПодразделений = Запрос.Выполнить().Выбрать();
	Если ВыборкаПодразделений.Количество() > 1 Тогда
		// имеются элементы кроме предопределенного 
		ИспользоватьПодразделения = Истина;
	    Константы.ИспользоватьПодразделения.Установить(Истина);	
	КонецЕсли;
	ПорядокВерсии = 10;
	Если ИспользоватьПодразделения Тогда		
		ШаблонЗапроса = 	
		"ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата
		|ИЗ
		|	Документ.%ИмяДокумента КАК ДанныеДокумента
		|";
	Иначе
		// очистим в документах
		ПорядокВерсии = 20;
		ШаблонЗапроса = 	
		"ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата
		|ИЗ
		|	Документ.%ИмяДокумента КАК ДанныеДокумента
		|ГДЕ
		|	НЕ ДанныеДокумента.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|";
	КонецЕсли;
	
	ТекстОбъединитьВсе =
	"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	ТекстЗапроса = "";
	ПервыйДокумент = Истина;
	Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
		Если НЕ МетаданныеДокумента.Реквизиты.Найти("СозданПриИспользованииПодразделений") = Неопределено Тогда
			Если Не ПустаяСтрока(ТекстЗапроса) Тогда
				ТекстЗапроса = ТекстЗапроса + ТекстОбъединитьВсе;
			КонецЕсли;
			ТекстПодзапроса = СтрЗаменить(ШаблонЗапроса, "%ИмяДокумента", МетаданныеДокумента.Имя);
			ТекстЗапроса = ТекстЗапроса + ТекстПодзапроса;				
		КонецЕсли;
	КонецЦикла;
	
	// ОЧЕНЬ ДОЛГИЙ ПРОЦЕСС
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// почти все документы, поэтому с особым порядком
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, , ПорядокВерсии);		
	КонецЦикла;
			
	#КонецОбласти
	
	// №14571 в настройках синхронизации контрагентов Битрикс24 добавлено сопоставление видов контрагентов с сущностями Б24
	ОбъектНастройка = Справочники.НастройкиСинхронизацииСБитрикс24.Основная.ПолучитьОбъект();
	ХранилищеНастроек = ОбъектНастройка.ХранилищеНастроек.Получить();
	
	Если ТипЗнч(ХранилищеНастроек) = Тип("Структура") И ХранилищеНастроек.Свойство("НастройкиСинхронизацииКонтрагентов") Тогда
		
		НастройкиСинхронизацииКонтрагентов = ХранилищеНастроек.НастройкиСинхронизацииКонтрагентов;
			
		ВидыКонтрагентовКакКомпании = новый Массив;;
		ВидыКонтрагентовКакКомпании.Добавить(Перечисления.ВидКонтрагента.ЮрЛицо);
		ВидыКонтрагентовКакКомпании.Добавить(Перечисления.ВидКонтрагента.ИндивидуальныйПредприниматель);
		
		НастройкиСинхронизацииКонтрагентов.Вставить("ВидыКонтрагентовКакКомпании", ВидыКонтрагентовКакКомпании);
			
		ВидыКонтрагентовКакКонтакты = новый Массив;
		ВидыКонтрагентовКакКонтакты.Добавить(Перечисления.ВидКонтрагента.ФизЛицо);
		
		НастройкиСинхронизацииКонтрагентов.Вставить("ВидыКонтрагентовКакКонтакты", ВидыКонтрагентовКакКонтакты);
		
		ОбъектНастройка.ХранилищеНастроек = Новый ХранилищеЗначения(ХранилищеНастроек);
		ОбъектНастройка.Записать();
		
	КонецЕсли;
	
	// #14865
	Если Константы.ОтображатьКнопкуОтправитьTelegram.Получить() Тогда
		Константы.ВариантВызоваTelegram.Установить(Перечисления.ВариантыВызоваМессенджеров.ДиалогВБраузере);	
	КонецЕсли;
	Если Константы.ОтображатьКнопкуОтправитьWhatsApp.Получить() Тогда
		Константы.ВариантВызоваWhatsApp.Установить(Перечисления.ВариантыВызоваМессенджеров.ДиалогВБраузере);	
	КонецЕсли;
	
	//++ №14857 в версии 3.0.7. исправлено помещение объектов к обработке в один регистр, одного объекта, с разным порядком
	// порядок обработки появился с версии 2.8.22, возможные пересечения есть в версии 2.8.31 по номенклатуре (потолок, отрез) заявка #12982
	// поэтому, если номенклатуры есть для исправления, они также будут помещены в версию 2.8.31
	// код ниже из обработки версии 2.8.31
	ВерсияПрограммыПовторно = "2.8.31.0";
	
	// #12982 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Потолок_Фактура КАК СправочникНоменклатураПотолок_Фактура
	|		ПО СправочникНоменклатура.Ссылка = СправочникНоменклатураПотолок_Фактура.Ссылка
	|ГДЕ
	|	СправочникНоменклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез))
	|	И СправочникНоменклатураПотолок_Фактура.НомерСтроки ЕСТЬ NULL
	|	И (НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалКаталог = """"
	|		ИЛИ НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалМатериал = """"
	|		ИЛИ НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалЦвет = """"
	|		ИЛИ НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_ШиринаПолотна = 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Потолок_Фактура КАК СправочникНоменклатураПотолок_Фактура
	|		ПО СправочникНоменклатура.Ссылка = СправочникНоменклатураПотолок_Фактура.Ссылка
	|			И (СправочникНоменклатураПотолок_Фактура.НомерСтроки = 1)
	|ГДЕ
	|	СправочникНоменклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез))

	|	И (     (НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалКаталог = """" 
	|		    И НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалКаталог = СправочникНоменклатураПотолок_Фактура.Фактура_МатериалКаталог)
	|		ИЛИ (НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалМатериал = """"
	|			И НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалМатериал = СправочникНоменклатураПотолок_Фактура.Фактура_МатериалМатериал)
	|		ИЛИ (НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалЦвет = """"
	|			И НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_МатериалЦвет = СправочникНоменклатураПотолок_Фактура.Фактура_МатериалЦвет)
	|		ИЛИ (НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_ШиринаПолотна = 0
	|			И НЕ СправочникНоменклатура.УДАЛИТЬ_Потолок_ШиринаПолотна = СправочникНоменклатураПотолок_Фактура.Фактура_ШиринаПолотна)
	|	)
	|";
		
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммыПовторно, Выборка.Ссылка, ТекущаяДатаСеанса(), , 900);		
	КонецЦикла;
	
	// #12982 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Потолок_Фактура КАК СправочникНоменклатураПотолок_Фактура
	|		ПО СправочникНоменклатура.Ссылка = СправочникНоменклатураПотолок_Фактура.Ссылка
	|			И (СправочникНоменклатураПотолок_Фактура.НомерСтроки = 1)
	|ГДЕ
	|	СправочникНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	|	И (СправочникНоменклатура.Потолок_КоличествоВыработка = 0
	|		ИЛИ СправочникНоменклатураПотолок_Фактура.Фактура_КоличествоВыработка = 0)";
		
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммыПовторно, Выборка.Ссылка, ТекущаяДатаСеанса(), , 901);		
	КонецЦикла;
	//-- №14857

	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_8_0

Процедура ОбработкаОбновления_3_0_8_0() Экспорт
	
	ВерсияПрограммы = "3.0.8.0";
	
	// #14948 настройки объединены
	Константы.РазрешитьРедактированиеФактурИЦветовФактур.Установить(Константы.РазрешитьРедактированиеФактурИЦветовФактур.Получить()
																ИЛИ Константы.УДАЛИТЬ_РазрешитьРучноеСозданиеФактурИЦветовФактур.Получить());
																
	// #14908 
	Справочники.ДействияВРабочемМестеРаботникаСклада.ЗаполнитьПоставляемыеДанные();
	
	Справочники.ПорядокЗаполненияПолейЛида.ЗаполнитьПоставляемыеДанные();
	
	// особый случай с документом УстановкаМинимальнойСтоимостиПродукции
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.УстановкаМинимальнойСтоимостиПродукции КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.УДАЛИТЬ_Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)";	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
		
	// #14988 подразделения - часть 2
	// очистим в документах, если было заполнено предопределенным элементом
	#Область Заявка14988
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Данные.Ссылка КАК Ссылка,
	|	Данные.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Подразделения КАК Данные";	
	ВыборкаПодразделений = Запрос.Выполнить().Выбрать();
	Если ВыборкаПодразделений.Количество() = 1
		И НЕ Константы.ИспользоватьПодразделения.Получить() Тогда	
		
		// константы
		Если ЗначениеЗаполнено(Константы.ПодразделениеПроизводстваДляРозницы.Получить()) Тогда
			Константы.ПодразделениеПроизводстваДляРозницы.Установить(Справочники.Подразделения.ПустаяСсылка());	
		КонецЕсли;
		
		ПорядокВерсии = 20;
		// документы
		ШаблонЗапросаПервый = 	
		"ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.%ИмяДокумента КАК ДанныеДокумента
		|ГДЕ
		|	НЕ ДанныеДокумента.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|";
		
		ШаблонЗапроса = 	
		"ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата
		|ИЗ
		|	Документ.%ИмяДокумента КАК ДанныеДокумента
		|ГДЕ
		|	НЕ ДанныеДокумента.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|";
	
		ТекстОбъединитьВсе =
		"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
		
		ТекстЗапроса = "";
		ПервыйДокумент = Истина;
		Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
			Если НЕ МетаданныеДокумента.Реквизиты.Найти("СозданПриИспользованииПодразделений") = Неопределено Тогда
				Если ПустаяСтрока(ТекстЗапроса) Тогда
					Шаблон = ШаблонЗапросаПервый;
				Иначе
					Шаблон = ШаблонЗапроса;
					ТекстЗапроса = ТекстЗапроса + ТекстОбъединитьВсе;
				КонецЕсли;
				ТекстПодзапроса = СтрЗаменить(Шаблон, "%ИмяДокумента", МетаданныеДокумента.Имя);
				ТекстЗапроса = ТекстЗапроса + ТекстПодзапроса;				
			КонецЕсли;
		КонецЦикла;
		
		// убираем если уже обрабатывается в 3.0.7
		ТекстЗапроса = ТекстЗапроса +
		";
		|////////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.Ссылка КАК Ссылка,
		|	ВТ.Ссылка.Дата КАК Дата
		|ИЗ
		|	ВТ КАК ВТ
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые КАК ОбъектыКОбработкеПослеОбновленияРекомендуемые
		|		ПО ВТ.Ссылка = ОбъектыКОбработкеПослеОбновленияРекомендуемые.Документ
		|		И ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы = ""3.0.7.0""
		|		И ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммыЧисло = 3000007020
		|ГДЕ
		|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.Документ ЕСТЬ NULL	
		|";
	
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;	
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			// почти все документы, поэтому с особым порядком
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, , ПорядокВерсии);		
		КонецЦикла; 
		
		// справочники
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Бригады КАК ДанныеСправочника
		|ГДЕ
		|	НЕ ДанныеСправочника.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСправочника.Ссылка
		|ИЗ
		|	Справочник.НастройкиИнтеркампани КАК ДанныеСправочника
		|ГДЕ
		|	НЕ ДанныеСправочника.ПроизводствоПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСправочника.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК ДанныеСправочника
		|ГДЕ
		|	(НЕ ДанныеСправочника.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|			ИЛИ НЕ ДанныеСправочника.ПодразделениеРозница = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСправочника.Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК ДанныеСправочника
		|ГДЕ
		|	НЕ ДанныеСправочника.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСправочника.Ссылка
		|ИЗ
		|	Справочник.ТочкиПродаж КАК ДанныеСправочника
		|ГДЕ
		|	НЕ ДанныеСправочника.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)";

		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;	
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл	
			ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
		КонецЦикла;
		
		// независимые регистры
		НаборЗаписей = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Подразделение = Справочники.Подразделения.ПустаяСсылка();	
		КонецЦикла;
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
		КонецПопытки;
		
		// и подразделение с более высокой версией
		ВыборкаПодразделений.Следующий();
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, ВыборкаПодразделений.Ссылка, ТекущаяДатаСеанса(), , 30);		
		
	Иначе
		Пока ВыборкаПодразделений.Следующий() Цикл
			Если ВыборкаПодразделений.Наименование = "Основное подразделение" Тогда
				СпрОбъект = ВыборкаПодразделений.Ссылка.ПолучитьОбъект();
				СпрОбъект.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	// дополнительно 
	ПорядокВерсии = 20;
	// документы
	ШаблонЗапросаПервый = 	
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.%ИмяДокумента КАК ДанныеДокумента
	|ГДЕ
	|   НЕ ДанныеДокумента.СозданПриИспользованииПодразделений
	|	И НЕ ДанныеДокумента.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|";
	
	ШаблонЗапроса = 	
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.%ИмяДокумента КАК ДанныеДокумента
	|ГДЕ
	|   НЕ ДанныеДокумента.СозданПриИспользованииПодразделений
	|	И НЕ ДанныеДокумента.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|";
	
	ТекстОбъединитьВсе =
	"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	ТекстЗапроса = "";
	ПервыйДокумент = Истина;
	Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
		Если НЕ МетаданныеДокумента.Реквизиты.Найти("СозданПриИспользованииПодразделений") = Неопределено Тогда
			Если ПустаяСтрока(ТекстЗапроса) Тогда
				Шаблон = ШаблонЗапросаПервый;
			Иначе
				Шаблон = ШаблонЗапроса;
				ТекстЗапроса = ТекстЗапроса + ТекстОбъединитьВсе;
			КонецЕсли;
			ТекстПодзапроса = СтрЗаменить(Шаблон, "%ИмяДокумента", МетаданныеДокумента.Имя);
			ТекстЗапроса = ТекстЗапроса + ТекстПодзапроса;				
		КонецЕсли;
	КонецЦикла;
	
	// убираем если уже обрабатывается в 3.0.7
	ТекстЗапроса = ТекстЗапроса +
	";
	|////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Ссылка.Дата КАК Дата
	|ИЗ
	|	ВТ КАК ВТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые КАК ОбъектыКОбработкеПослеОбновленияРекомендуемые
	|		ПО ВТ.Ссылка = ОбъектыКОбработкеПослеОбновленияРекомендуемые.Документ
	|		И ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы = ""3.0.7.0""
	|		И (ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммыЧисло = 3000007010 			
	|			ИЛИ ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммыЧисло = 3000007020 )
	|ГДЕ
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.Документ ЕСТЬ NULL	
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// почти все документы, поэтому с особым порядком
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, , ПорядокВерсии);		
	КонецЦикла;
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_9_0

Процедура ОбработкаОбновления_3_0_9_0() Экспорт
	
	ВерсияПрограммы = "3.0.9.0";
	
	// ИспользоватьКонтрольКратностиЕдиницИзмерения
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура.Кратность КАК ДанныеСправочника";
		
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Константы.ИспользоватьКонтрольКратностиЕдиницИзмерения.Установить(Истина);
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_10_0

Процедура ОбработкаОбновления_3_0_10_0() Экспорт
	
	ВерсияПрограммы = "3.0.10.0";

	//#14947
	Если Константы.СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.СкладПродукции КАК СкладПродукции,
		|	Пользователи.Склад КАК Склад
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
		
		Выборка = Запрос.Выполнить().Выбрать();		
		Пока Выборка.Следующий() Цикл
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СпрОбъект.СкладПродукции = Выборка.Склад;
			СпрОбъект.Склад = Выборка.СкладПродукции;
			Попытка
				СпрОбъект.Записать();
			Исключение
			КонецПопытки;			
		КонецЦикла;		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_11_0

Процедура ОбработкаОбновления_3_0_11_0() Экспорт
	
	ВерсияПрограммы = "3.0.11.0";
		
	// №14932 настройка "Номенклатура и виды номенклатуры, которые предлагаются к производству при создании заказа на производство на основании заказа покупателя"
	// при обновлении добавляем: потолки, отрезы, конструкции и если была включена галочка "Предлагать к производству товары из заказа покупателя.." добавляем "Товары и материалы"
	ОбщийМодульСервер.ОпределитьНастройкиВидовНоменклатурыКакПродукция(Истина);
	
	//#15127
	НаборЗаписей = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Для каждого Запись из НаборЗаписей Цикл
		Запись.ВидСравненияПараметраДляОбработки = Перечисления.ВидыСравнений.Содержит;	
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
	//#13359 
	Константы.ВидБонуснойСистемы.Установить(Перечисления.ВидыБонусныхСистем.Внутренняя);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.СлужебныйУчитыватьБонусы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.СлужебныйУчитыватьБонусы";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
	//#15278
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК ДанныеСправочника
	|ГДЕ
	|	(НЕ ДанныеСправочника.Потолок_КоличествоГарпун = 0
	|			ИЛИ НЕ ДанныеСправочника.УДАЛИТЬ_Потолок_МатериалГарпун = """")";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_12_0

Процедура ОбработкаОбновления_3_0_12_0() Экспорт
	
	ВерсияПрограммы = "3.0.12.0";
	
	//#15354
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ВводОстатков КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийВводаОстатков.ВзаиморасчетыСКонтрагентами)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_13_0

Процедура ОбработкаОбновления_3_0_13_0() Экспорт
	
	ВерсияПрограммы = "3.0.13.0";
	
	МенеджерЗаписи11 = РегистрыСведений.ИсторияВерсий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи11.Версия = "3.0.11.0";
	МенеджерЗаписи11.Прочитать();
	МенеджерЗаписи12 = РегистрыСведений.ИсторияВерсий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи12.Версия = "3.0.12.0";
	МенеджерЗаписи12.Прочитать();

	Если МенеджерЗаписи11.Выбран() ИЛИ МенеджерЗаписи12.Выбран() Тогда
		
		НаименованиеБезГарпунаИзПравила = "";	
		Правило = Справочники.ПравилаОпределенияВидаПотолка.Отрез;
		Для каждого СтрокаТЧ из Правило.Параметры Цикл
			Если СтрокаТЧ.Использовать И СтрокаТЧ.Имя = "МатериалГарпун" Тогда
				НаименованиеБезГарпунаИзПравила = СтрокаТЧ.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(НаименованиеБезГарпунаИзПравила) Тогда		
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("НаименованиеБезГарпунаИзПравила", НаименованиеБезГарпунаИзПравила);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НоменклатураПотолок_Гарпун.Ссылка КАК Ссылка,
			|	НоменклатураПотолок_Гарпун.Ссылка.Код КАК Код
			|ИЗ
			|	Справочник.Номенклатура.Потолок_Гарпун КАК НоменклатураПотолок_Гарпун
			|ГДЕ
			|	НоменклатураПотолок_Гарпун.Материал = &НаименованиеБезГарпунаИзПравила
			|	И НоменклатураПотолок_Гарпун.Количество = 0
			|	И НЕ НоменклатураПотолок_Гарпун.Ссылка.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СтруктураПродукции = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(Выборка.Ссылка, , , 
					Ложь, Ложь, Истина, 
					Ложь, , , 
					, Истина);
					
				ВидНоменклатурыПотолка = Справочники.ПравилаОпределенияВидаПотолка.ВидНоменклатурыПотолка(СтруктураПродукции);
				
				//Если СтруктураПродукции.ВидНоменклатурыПотолка = Справочники.ВидыНоменклатуры.Отрез Тогда				 
				Если ВидНоменклатурыПотолка = Справочники.ВидыНоменклатуры.Отрез Тогда
					ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
				КонецЕсли;
				
			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_14_0

Процедура ОбработкаОбновления_3_0_14_0() Экспорт
	
	ВерсияПрограммы = "3.0.14.0";
	
	ОбработкаОбновления_3_0_13_0(); // отрезы не помещались в пост-обработку: из-за сравнения СтруктураПродукции.ВидНоменклатурыПотолка, в к-м всегда приходил Потолок 
		
	//#15416 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.СоздаватьВходящиеКонтакты";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_15_0

Процедура ОбработкаОбновления_3_0_15_0() Экспорт
	
	ВерсияПрограммы = "3.0.15.0";

	//#15471
	Если Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить() Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.ВозвратТовараОтПокупателя.Товары КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка.Проведен
		|	И НЕ ДанныеДокумента.ДокументПродажи = ЗНАЧЕНИЕ(Документ.РеализацияТоваровИУслуг.ПустаяСсылка)
		|	И НЕ ДанныеДокумента.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|	И ДанныеДокумента.КомпенсацияПоВозврату = ЗНАЧЕНИЕ(Перечисление.ВариантыКомпенсацииПоВозврату.ОтгрузитьПовторно)";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		КонецЦикла;			
	КонецЕсли;			
				
	//#15395
	Если Константы.УДАЛИТЬ_ВозвратПродукцииОтветственностьИсполнителейПоСебестоимости.Получить() Тогда
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Пользователи.Ссылка КАК Ссылка
		//|ИЗ
		//|	Справочник.Пользователи КАК Пользователи
		//|ГДЕ
		//|	НЕ Пользователи.ПометкаУдаления
		//|	И НЕ Пользователи.Недействителен";
		//Выборка = Запрос.Выполнить().Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	ПользовательОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//	ПользовательОбъект.СпособОпределенияОтветственностиПоВозврату = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПоСебестоимости;
		//	ПользовательОбъект.Записать();
		//КонецЦикла;
		
		Константы.СпособОпределенияОтветственностиПоВозврату.Установить(Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПоСебестоимости);
	Иначе
		Константы.СпособОпределенияОтветственностиПоВозврату.Установить(Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПоСумме);
	КонецЕсли;
	
	//#15395  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ВозвратПродукции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_16_0

Процедура ОбработкаОбновления_3_0_16_0() Экспорт
	
	ВерсияПрограммы = "3.0.16.0";

	//#15628  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.ВозвратПродукции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен 
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_18_0

Процедура ОбработкаОбновления_3_0_18_0() Экспорт
	
	ВерсияПрограммы = "3.0.18.0";

	//#15868  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратТовараОтПокупателяТовары.Ссылка КАК Ссылка,
	|	ВозвратТовараОтПокупателяТовары.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя.Товары КАК ВозвратТовараОтПокупателяТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратТовараОтПокупателяТовары.Ссылка,
	|	ВозвратТовараОтПокупателяТовары.Ссылка.Дата
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВозвратТовараОтПокупателяТовары.БонусыКНачислению) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТовараОтПокупателяТовары.Ссылка,
	|	ВозвратТовараОтПокупателяТовары.Ссылка.Дата
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя.Товары КАК ВозвратТовараОтПокупателяТовары
	|ГДЕ
	|	НЕ (ВЫРАЗИТЬ(ВозвратТовараОтПокупателяТовары.UDS_ИдентификаторОперации КАК СТРОКА(10))) = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратТовараОтПокупателяТовары.Ссылка,
	|	ВозвратТовараОтПокупателяТовары.Ссылка.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата
	|ИЗ
	|	Документ.ВозвратПродукции.Товары КАК ДанныеДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеДокумента.БонусыКНачислению) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата
	|ИЗ
	|	Документ.ВозвратПродукции.Товары КАК ДанныеДокумента
	|ГДЕ
	|	НЕ (ВЫРАЗИТЬ(ДанныеДокумента.UDS_ИдентификаторОперации КАК СТРОКА(10))) = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_19_0

Процедура ОбработкаОбновления_3_0_19_0() Экспорт
	
	ВерсияПрограммы = "3.0.19.0";
	
	//#15885
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	СУММА(ДанныеДокумента.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя.Товары КАК ДанныеДокумента
	|ГДЕ
	|	(ДанныеДокумента.КомпенсацияПоВозврату = ЗНАЧЕНИЕ(Перечисление.ВариантыКомпенсацииПоВозврату.ЗачестьВернуть)
	|			ИЛИ ДанныеДокумента.КомпенсацияПоВозврату = ЗНАЧЕНИЕ(Перечисление.ВариантыКомпенсацииПоВозврату.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратТовараОтПокупателя.Дата КАК Дата,
	|	ВозвратТовараОтПокупателя.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя КАК ВозвратТовараОтПокупателя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО (ВТ.Ссылка = ВозвратТовараОтПокупателя.Ссылка)
	|ГДЕ
	|	ВозвратТовараОтПокупателя.Проведен
	|	И НЕ ВозвратТовараОтПокупателя.СуммаАванса = ВТ.Сумма";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#15919
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеТЧ.Ссылка КАК Ссылка,
	|	ДанныеТЧ.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК ДанныеТЧ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеТЧ.Ссылка,
	|	ДанныеТЧ.Сумма
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Услуги КАК ДанныеТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Ссылка КАК Ссылка,
	|	СУММА(ВТ.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ВТ2.Сумма КАК СуммаПоТЧ
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
	|		ПО (ВТ2.Ссылка = ДанныеДокумента.Ссылка)
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И НЕ ВТ2.Сумма = ДанныеДокумента.СуммаДокумента";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#15994
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказДоговор.Ссылка КАК Ссылка,
	|	ЗаказДоговор.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	ЗаказДоговор.ОжидаемаяДатаОтгрузки = &ПустаяДата
	|	И ЗаказДоговор.УДАЛИТЬ_ПредполагаемыйМонтажДата <> &ПустаяДата";
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#15983
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЗарплаты.Ссылка КАК Ссылка,
	|	НачислениеЗарплаты.Дата КАК Дата
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_20_0

Процедура ОбработкаОбновления_3_0_20_0() Экспорт
	
	ВерсияПрограммы = "3.0.20.0";
	
	//#16036
	Константы.ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг.Установить(1);
	
	//#16306
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДата());
	КонецЦикла;

	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_23_0

Процедура ОбработкаОбновления_3_0_23_0() Экспорт
	
	ВерсияПрограммы = "3.0.23.0";
	
	// сверка выработки - подготовка к 3.1
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И НЕ ДанныеДокумента.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Отменен)
	|	И НЕ ДанныеДокумента.РучнаяКорректировкаВыработки
	|	И ДанныеДокумента.ВидОперации В (ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Рекламация), ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.СервиснаяЗаявка))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// проверка
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И НЕ ДанныеДокумента.Основание = ЗНАЧЕНИЕ(Документ.ЗаказДоговор.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_25_0

Процедура ОбработкаОбновления_3_0_25_0() Экспорт
	
	ВерсияПрограммы = "3.0.25.0";
	
	//16608
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Монтаж.Ссылка КАК Ссылка,
		|	Монтаж.Дата КАК Дата
		|ИЗ
		|	Документ.Монтаж КАК Монтаж
		|ГДЕ
		|	Монтаж.ПриРасчетеВыработкиУчитыватьПроцентОтклоненияОтПрайса";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_100_0

Процедура ОбработкаОбновления_3_0_100_0() Экспорт
	
	ВерсияПрограммы = "3.0.100.0";
	
	// запомним используемые регионы
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.КодСубъектаРФ КАК КодСубъектаРФ
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК ДанныеРегистра
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.КодСубъектаРФ
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ДанныеРегистра.Идентификатор) > 3";
	
	Выборка = Запрос.Выполнить().Выбрать();
	КодыСубъектов = "";
	Пока Выборка.Следующий() Цикл
		КодыСубъектов = КодыСубъектов + ?(ПустаяСтрока(КодыСубъектов), "", ",") + Выборка.КодСубъектаРФ;	
	КонецЦикла;
	Константы.СлужебнаяНастройка.Установить(Новый ХранилищеЗначения(КодыСубъектов));
	
	// очищаем адресные регистры
	НаборЗаписей = РегистрыСведений.АдресныеОбъекты.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.ИсторияАдресныхОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.ДомаЗданияСтроения.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_0_0

Процедура ОбработкаОбновления_3_1_0_0() Экспорт
	
	ВерсияПрограммы = "3.1.0.0";
	
	УправлениеСвойствамиПотолки.ПеренестиДопРеквизитыПриОбновленииБСП_3_1_1_151();
	
	// адаптация настройки НастройкиКомпоновкиПоНоменклатуреКПроизводству
	НастройкиКомпоновкиДанных = Константы.НастройкиКомпоновкиПоНоменклатуреКПроизводству.Получить().Получить();	
	Если НЕ НастройкиКомпоновкиДанных = Неопределено Тогда
		
		ОтборНоменклатуры = Неопределено;
		ОтборНоменклатурыВидСравнения = Неопределено; 
		ОтборВидов = Неопределено;
		ОтборВидовВидСравнения = Неопределено;
		
		ЭлементыОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы;
		Для каждого ЭлементОтбора из ЭлементыОтбора Цикл
			
			Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура") Тогда
					ОтборНоменклатуры = ЭлементОтбора.ПравоеЗначение;
					ОтборНоменклатурыВидСравнения = ЭлементОтбора.ВидСравнения;
				ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидНоменклатуры") Тогда
					ОтборВидов = ЭлементОтбора.ПравоеЗначение;
					ОтборВидовВидСравнения = ЭлементОтбора.ВидСравнения;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ОтборНоменклатуры = Неопределено
			ИЛИ НЕ ОтборВидов = Неопределено Тогда			
					
			// сбрасываем на стандартные настройки
			СхемаКД = ПолучитьОбщийМакет("СхемаНастроекПоНоменклатуреКПроизводству");
			АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКД, Новый УникальныйИдентификатор);
		
			КомпоновщикНастроекПоНоменклатуреКПроизводству = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроекПоНоменклатуреКПроизводству.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
			КомпоновщикНастроекПоНоменклатуреКПроизводству.ЗагрузитьНастройки(СхемаКД.НастройкиПоУмолчанию);
			
			ЭлементыОтбора = КомпоновщикНастроекПоНоменклатуреКПроизводству.Настройки.Отбор.Элементы;
			
			// устанавливаем настроенные ранее
			Для каждого ЭлементОтбора из ЭлементыОтбора Цикл
				Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
					Для каждого ЭлементОтбора2 из ЭлементОтбора.Элементы Цикл
						Если ТипЗнч(ЭлементОтбора2) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
							
							Если ЭлементОтбора2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидНоменклатуры") Тогда
								ЭлементОтбора2.ВидСравнения = ОтборВидовВидСравнения;
								ЭлементОтбора2.ПравоеЗначение = ОтборВидов;
							ИначеЕсли ЭлементОтбора2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура") Тогда
								ЭлементОтбора2.ВидСравнения = ОтборНоменклатурыВидСравнения;
								ЭлементОтбора2.ПравоеЗначение = ОтборНоменклатуры;							
							КонецЕсли;
						
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			Константы.НастройкиКомпоновкиПоНоменклатуреКПроизводству.Установить(Новый ХранилищеЗначения(КомпоновщикНастроекПоНоменклатуреКПроизводству.ПолучитьНастройки()));
			
		КонецЕсли;
	КонецЕсли;
	
	// #16000 
	Справочники.ДетализацияУчетаЛидов.ЗаполнитьПоставляемыеДанные();
	// #16640 дополнение после выхода 3.1.6
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения") Тогда
		ТаблицаЗаполненияЛида = ОбщийМодульСервер.ПолучитьНастройкуОбязательныхПолейКЗаполнениюЛида();
		НС = ТаблицаЗаполненияЛида.НайтиСтроки(Новый Структура("ИмяПоля", "Подразделение"));
		Если НС.Количество() = 1 Тогда
			Если НС[0].Заполнять = Истина Тогда				
				СпрОбъект = Справочники.ДетализацияУчетаЛидов.Подразделение.ПолучитьОбъект();
				СпрОбъект.Использовать = Истина;
				СпрОбъект.Записать();				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// заполним адресные регистры
	ИспользуемыеРегионы = Константы.СлужебнаяНастройка.Получить().Получить();
	Если ТипЗнч(ИспользуемыеРегионы) = Тип("Строка") Тогда
		ИспользуемыеРегионыМассив = СтрРазделить(ИспользуемыеРегионы, ",", Ложь);
		Для каждого КодСубъекта из ИспользуемыеРегионыМассив Цикл
			ОбщийМодульСервер.ЗагрузитьАдресаРегионаФиас2(КодСубъекта);	
		КонецЦикла;
	КонецЕсли;
	//ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, ТекущаяДатаСеанса());	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_1_0

Процедура ОбработкаОбновления_3_1_1_0() Экспорт
	
	ВерсияПрограммы = "3.1.1.0";
	
	//#16235
	Константы.УчитыватьЛидыВСтатусеНовыйПриСозданииЛидаПоПропущенномуЗвонку.Установить(Истина);
		
	//#16242 Заполнение нового реквизита
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Договор.Ссылка КАК Ссылка,
	|	Договор.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Договор.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказДоговоров.ВРаботе)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Обязательный
	|ИЗ
	|	Документ.ЗаказДоговор КАК Договор
	|ГДЕ
	|	Договор.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Обязательный Тогда
			ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		Иначе
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		КонецЕсли;
	КонецЦикла;
	
	//#16242 Заполнение нового реквизита
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.ВРаботе)
	|				ИЛИ ДанныеДокумента.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.ЧастичноВыполнен)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Обязательный
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации В (ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Рекламация), ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.СервиснаяЗаявка))
	//|	И НЕ ДанныеДокумента.Основание Ссылка Документ.ЗаказДоговор
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Если Выборка.Обязательный Тогда
		//	ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		//Иначе
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		//КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_2_0

Процедура ОбработкаОбновления_3_1_2_0() Экспорт
	
	ВерсияПрограммы = "3.1.2.0";
	
	//#16283
	Справочники.ВидыПродукции.ЗаполнитьПоставляемыеСтатусы();
		
	//#16283 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныПродукции КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ЭтоГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Продукция)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
	//#16288 
	//ВидПродажа = Справочники.ВидыЗаказДоговоров.НайтиПоНаименованию("Продажа", Истина);
	//Если ЗначениеЗаполнено(ВидПродажа) Тогда
	//	ПоместитьВРегистрКОбработке(ВерсияПрограммы, ВидПродажа, ТекущаяДатаСеанса());
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("ВидПродажа", ВидПродажа);
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	Договор.Ссылка КАК Ссылка,
	//	|	Договор.Дата КАК Дата
	//	|ИЗ
	//	|	Документ.ЗаказДоговор КАК Договор
	//	|ГДЕ
	//	|	Договор.ВидЗаказа = &ВидПродажа";
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	//	КонецЦикла;
	//КонецЕсли;

	//#16268
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Договор.Ссылка КАК Ссылка,
	|	Договор.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК Договор
	|ГДЕ
	|	Договор.ДатаДоговора = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, , 2);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_3_0

Процедура ОбработкаОбновления_3_1_3_0() Экспорт
	
	ВерсияПрограммы = "3.1.3.0";
	
	// 16289
	Константы.АвтоматическиЗаполнятьДатуПодписанияДокументовВМонтаже.Установить(Перечисления.ВариантыЗаполненияДатыПодписанияВМонтаже.НеЗаполнять); 
	
	// #16283
	ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Справочники.ВидыПродукции.Конструкция, ТекущаяДатаСеанса());
	
	//#16268 заполнение нового реквизита
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции)
	|	И ДанныеДокумента.ВидНоменклатурыПотолка = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Продукция)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, , 10);
	КонецЦикла;
	
	//если используется мобильный клиент замерщика и используются сметы (раньше всегда был общий реквизит теперь может быть индивидуальный) и используются индивидуальные настройки пользователей, то пользователям нужно поставить флаг использования смет индивидуально
	Если Константы.ИспользуетсяМобильныйКлиентЗамерщика.Получить() 
		И Константы.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаДляПользователей.Получить() 
		И Константы.ИспользуетсяПредварительныйРасчетВМобильномКлиентеЗамерщика.Получить() Тогда
		ВыборкаПользователи = Справочники.Пользователи.Выбрать();
		Пока ВыборкаПользователи.Следующий() Цикл
			
			СпрОбъект = ВыборкаПользователи.ПолучитьОбъект();
			ОбъектМодифицирован = Ложь;
			
			Если ВыборкаПользователи.МобильныйКлиентЗамерщикаПоказыватьЗамерыВсехЗамерщиков
				или ВыборкаПользователи.МобильныйКлиентЗамерщикаПоказыватьЗамерыВРаботеЗаПрошлыйПериод
				или ВыборкаПользователи.МобильныйКлиентЗамерщикаПоказыватьЗамерыВРаботеСегодня
				или ВыборкаПользователи.МобильныйКлиентЗамерщикаПоказыватьЗамерыВРаботеЗаБудущийПериод
				или ВыборкаПользователи.МобильныйКлиентЗамерщикаПоказыватьЗакрытыеЗамерыЗаПрошлыйПериод
				или ВыборкаПользователи.МобильныйКлиентЗамерщикаПоказыватьЗакрытыеЗамерыСегодня
				или ВыборкаПользователи.МобильныйКлиентЗамерщикаПоказыватьЗакрытыеЗамерыЗаБудущийПериод
				Тогда
				//была включена одна из настроек отображения замеров, значит пользуется мобильным замерщиком
				//Попытка
				//	СпрОбъект = ВыборкаПользователи.ПолучитьОбъект();
				//	СпрОбъект.ИспользуетсяПредварительныйРасчетВМобильномКлиентеЗамерщика = Истина;
				//	СпрОбъект.Записать();
				//Исключение
				//КонецПопытки;
				ОбъектМодифицирован = Истина;
				СпрОбъект.ИспользуетсяПредварительныйРасчетВМобильномКлиентеЗамерщика = Истина;
			КонецЕсли;
			
			Если НЕ ВыборкаПользователи.УДАЛИТЬ_МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию.Пустая() Тогда
				//СпрОбъект = ВыборкаПользователи.ПолучитьОбъект();
				//СпрОбъект.УДАЛИТЬ_МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию = Справочники.Организации.ПустаяСсылка();
				//СпрОбъект.Записать();
				ОбъектМодифицирован = Истина;
				СпрОбъект.УДАЛИТЬ_МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию = Справочники.Организации.ПустаяСсылка();
			КонецЕсли;
			
			Если ОбъектМодифицирован Тогда
				Попытка
					СпрОбъект.ОбменДанными.Загрузка = Истина;
					СпрОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла;
		Константы.УДАЛИТЬ_МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию.Установить(Справочники.Организации.ПустаяСсылка());
		Константы.ИспользуетсяПредварительныйРасчетВМобильномКлиентеЗамерщика.Установить(Ложь);
	КонецЕсли;
	
	//#16346 
	Справочники.ВидыДокументовРасчетаВыработки.ЗаполнитьПоставляемыеДанные();
	
	//#16346 изменение вида монтажа
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ДанныеДокумента.Ссылка КАК Ссылка,
	//|	ДанныеДокумента.Дата КАК Дата
	//|ИЗ
	//|	Документ.Монтаж КАК ДанныеДокумента
	//|ГДЕ
	//|	ДанныеДокумента.ВидОперации В (ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Рекламация), ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.СервиснаяЗаявка))";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	//КонецЦикла;
	
	//#16346 заполнение нового реквизита "Направление деятельности"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.ВидДокументаРасчета = ЗНАЧЕНИЕ(Справочник.ВидыДокументовРасчетаВыработки.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, , 20);
	КонецЦикла;
	
	//#16346 заполнение нового реквизита "ВидОперацииМонтажа"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиПредварительногоРасчетаЗаказаВРознице КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.УчитыватьВыработку";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
	// #16346 сверка выработки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И НЕ ДанныеДокумента.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Отменен)
	|	И НЕ ДанныеДокумента.РучнаяКорректировкаВыработки
	|	И ДанныеДокумента.ВидОперации В (ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Рекламация), ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.СервиснаяЗаявка))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// #16346 очистка реквизита "Заказ-договор"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.ЗаказДоговор = ЗНАЧЕНИЕ(Документ.ЗаказДоговор.ПустаяСсылка)
	|	И ДанныеДокумента.ВидОперации В (ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Монтаж), ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Продажа))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, , 10);
	КонецЦикла;
		
	//#16427
	Справочники.СтатусыЗаявокНаДоставку.ЗаполнитьПоставляемыеСтатусы();
	
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыКонтактов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактов КАК ВидыКонтактов
	|ГДЕ
	|	ВидыКонтактов.Наименование = &Наименование
	|	И НЕ ВидыКонтактов.Предопределенный";
	
	Запрос.УстановитьПараметр("Наименование", "Телефон");
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСсылок = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;

	Если СофтФон.ИспользуетсяИнтеграцияСIPАТС()
		И Константы.ИнтервалПроверкиПодключенияКАТС.Получить() = 0
		И Константы.ВариантБиблиотекиТелефонии.Получить() = 0
		Тогда
		Константы.ИнтервалПроверкиПодключенияКАТС.Установить(60);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_4_0

Процедура ОбработкаОбновления_3_1_4_0() Экспорт
	
	ВерсияПрограммы = "3.1.4.0";
	
	//#15531 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасходныйКассовыйОрдер.Ссылка КАК Ссылка,
	|	РасходныйКассовыйОрдер.Дата КАК Дата
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	НЕ РасходныйКассовыйОрдер.УДАЛИТЬ_Основание.Ссылка ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка,  Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_5_0

Процедура ОбработкаОбновления_3_1_5_0() Экспорт
	
	ВерсияПрограммы = "3.1.5.0";
	
	//15925 
	Константы.СпособДобавленияПродукцииЗагрузитьИзПостроителя.Установить(Истина); 
	Константы.СпособДобавленияПродукцииВыбратьПотолок.Установить(Истина);
	Константы.СпособДобавленияПродукцииСоздатьПотолок.Установить(Истина);
	Константы.СпособДобавленияПродукцииСоздатьПродукцию.Установить(Истина);
	Константы.СпособДобавленияПродукцииСоздатьКонструкцию.Установить(Истина);
	
	//++16164
	Если Константы.СпособДобавленияПродукцииСоздатьКонструкцию.Получить() Тогда
		Константы.СпособДобавленияПродукцииСоздатьПродукцию.Установить(Истина);
	КонецЕсли;	
	//--16164
	
	//#16579 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Ссылка.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре.ВыработкаПоВидамНоменклатуры КАК ДанныеДокумента
	|ГДЕ
	|	(НЕ ДанныеДокумента.СкидкаВПроцентахОт = 0
	|			ИЛИ НЕ ДанныеДокумента.СкидкаВПроцентахОт = 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре.ВыработкаПоНоменклатуре КАК ДанныеДокумента
	|ГДЕ
	|	(НЕ ДанныеДокумента.СкидкаВПроцентахОт = 0
	|			ИЛИ НЕ ДанныеДокумента.СкидкаВПроцентахОт = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Дата КАК Дата
	|ИЗ
	|	ВТ КАК ВТ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//#16579 заполнение новых реквизитов "Цена по прайсу", "Сумма по прайсу" 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И НЕ ДанныеДокумента.Основание = ЗНАЧЕНИЕ(Документ.ЗаказДоговор.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_6_0

Процедура ОбработкаОбновления_3_1_6_0() Экспорт
	
	ВерсияПрограммы = "3.1.6.0";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыКонтактов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактов КАК ВидыКонтактов
	|ГДЕ
	|	ВидыКонтактов.Предопределенный = ЛОЖЬ
	|   И ВидыКонтактов.ПометкаУдаления
	|	И ВидыКонтактов.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", "Телефон");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_8_0

Процедура ОбработкаОбновления_3_1_8_0() Экспорт
	
	ВерсияПрограммы = "3.1.8.0";
	
	// Помещаем ЗД
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказДоговор.Дата КАК Дата,
	|	ЗаказДоговор.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	НЕ ЗаказДоговор.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
	ПорядокВерсии = 20;
	// Помещаем Монтажи
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Дата КАК Дата,
	|	Монтаж.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	НЕ Монтаж.ПометкаУдаления
	|	И НЕ Монтаж.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Отменен)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, , ПорядокВерсии);		
	КонецЦикла;
	
	ПорядокВерсии = 30;
	// Помещаем Монтажи где ДатаПодписанияДокументов заполнена
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Дата КАК Дата,
	|	Монтаж.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	НЕ Монтаж.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата, , ПорядокВерсии);		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_9_0

Процедура ОбработкаОбновления_3_1_9_0() Экспорт
	
	ВерсияПрограммы = "3.1.9.0";
	
	//#16706
	Если Константы.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги.Получить()
	     И Константы.ЗапрашиватьПодтверждениеПриДобавленииНоменклатурыСТ.Получить()
		 И Константы.ЗапрашиватьПодтверждениеПриИзмененииКоличестваСТ.Получить()
		 И Константы.ЗапрашиватьПодтверждениеПриУдаленииНоменклатурыСТ.Получить() Тогда
		    Константы.ЗапрашиватьПодтверждениеПриИзмененииНоменклатурыСТ.Установить(Истина);
	КонецЕсли;	 
	
	// #16656
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(ПредварительныйРасчетЗаказДоговора.Ссылка) КАК Ссылка,
	|	ПредварительныйРасчетЗаказДоговора.ИДДокументаВМобильномПриложении КАК ИДДокументаВМобильномПриложении
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ПредварительныйРасчетЗаказДоговора КАК ПредварительныйРасчетЗаказДоговора
	|ГДЕ
	|	НЕ ПредварительныйРасчетЗаказДоговора.ИДДокументаВМобильномПриложении = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредварительныйРасчетЗаказДоговора.ИДДокументаВМобильномПриложении
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ПредварительныйРасчетЗаказДоговора.Ссылка) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПредварительныйРасчетЗаказДоговора.Ссылка КАК Ссылка,
	|	ПредварительныйРасчетЗаказДоговора.Дата КАК Дата,
	|	ПредварительныйРасчетЗаказДоговора.ИДДокументаВМобильномПриложении КАК ИДДокументаВМобильномПриложении
	|ИЗ
	|	Документ.ПредварительныйРасчетЗаказДоговора КАК ПредварительныйРасчетЗаказДоговора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО (ВТ.ИДДокументаВМобильномПриложении = ПредварительныйРасчетЗаказДоговора.ИДДокументаВМобильномПриложении)
	|ИТОГИ ПО
	|	ИДДокументаВМобильномПриложении";
	
	ВыборкаИД = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИД.Следующий() Цикл
		ПервыйДокумент = Истина;
		Выборка = ВыборкаИД.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ПервыйДокумент Тогда
				ПервыйДокумент = Ложь;
				Продолжить;
			КонецЕсли;
			
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		КонецЦикла;
	КонецЦикла;	
	 
	// #16755
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.Ответственный.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 80;
	СпрОбъект.Использовать = Истина;
	СпрОбъект.Записать();
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.Замерщик.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 90;
	СпрОбъект.Использовать = Ложь;
	СпрОбъект.Записать();
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.Технолог.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 100;
	СпрОбъект.Использовать = Ложь;
	СпрОбъект.Записать();

	//#16755
	Константы.ВариантИзмененияЗамерщикаВЛиде.Установить(Перечисления.ВариантыИзмененияЗамерщикаВЛиде.НеЗаполнять);
	Константы.ВариантИзмененияТехнологаВЛиде.Установить(Перечисления.ВариантыИзмененияТехнологаВЛиде.НеЗаполнять);
	
	//#16658 исправления по датам запрета
	ОчиститьПредопределенныеЭлементыРазделовДатЗапрета();
	ДатыЗапретаИзмененияСлужебный.ЗаменитьРазделыДатЗапретаНаНовые();
	
	//#16741 для тех, кто уже обновился на 3.1.8 и заполнил поле 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Дата КАК Дата,
	|	Монтаж.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	НЕ Монтаж.ПометкаУдаления
	|	И НЕ Монтаж.УДАЛИТЬ_ВариантыЗаполненияДатыПодписанияДокументов В (0, 99)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
	
	//#16821
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказДоговор КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И НЕ ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);		
	КонецЦикла;
		
КонецПроцедуры

// на базе процедуры  ДатыЗапретаИзмененияСлужебный.ОчиститьПредопределенныеЭлементыРазделовДатЗапрета
// при обновлении почему-то не отработало заполнение поля "УдалитьНоваяСсылка"
Процедура ОчиститьПредопределенныеЭлементыРазделовДатЗапрета() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	ПланВидовХарактеристик.РазделыДатЗапретаИзменения КАК Разделы
	|ГДЕ
	//|	Разделы.ИмяПредопределенныхДанных <> """"";
	|	Разделы.ПометкаУдаления <> Ложь";
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваРазделов = ДатыЗапретаИзмененияСлужебный.СвойстваРазделов();
	ИменаПредопределенных =
		Метаданные.ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПолучитьИменаПредопределенных();
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("ПланВидовХарактеристик.РазделыДатЗапретаИзменения");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Разделы.Ссылка КАК Ссылка,
	|	Разделы.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	ПланВидовХарактеристик.РазделыДатЗапретаИзменения КАК Разделы
	|ГДЕ
	//|	Разделы.ИмяПредопределенныхДанных <> """"";
	|	Разделы.ПометкаУдаления <> Ложь";
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		//ОбновитьРазделыДатЗапретаИзменения();
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПВХОбъект = Выборка.Ссылка.ПолучитьОбъект();
			//Если ИменаПредопределенных.Найти(Выборка.ИмяПредопределенныхДанных) <> Неопределено Тогда
			//	Приставка = "Удалить";
			//	Если Не СтрНачинаетсяС(Выборка.ИмяПредопределенныхДанных, Приставка) Тогда
			//		Объект.ПометкаУдаления = Истина;
			//	Иначе
					ИскомоеИмя = СтрЗаменить(Строка(Выборка.Ссылка), " ", "");
					ИскомоеИмя = СтрЗаменить(ИскомоеИмя, "-", "");
					МД = Метаданные.Документы.Найти(ИскомоеИмя);
					Если МД = Неопределено ТОгда
						//Сообщить("Не найден МД: " + ИскомоеИмя);
					Иначе					
						СвойстваРаздела = СвойстваРазделов.Разделы.Получить(МД.Имя); 
					
						Если СвойстваРаздела = Неопределено Тогда
				        	//Сообщить("Не найден раздел: " + МД.Имя);
							//Объект.ПометкаУдаления = Истина;
						
						ИначеЕсли Выборка.Ссылка <> СвойстваРаздела.Ссылка Тогда
							ПВХОбъект.УдалитьНоваяСсылка = СвойстваРаздела.Ссылка;
							ПВХОбъект.Наименование = "(" + НСтр("ru = 'не используется'") + ") " + СвойстваРаздела.Представление;
						КонецЕсли;
					КонецЕсли;
			//ИначеЕсли СвойстваРазделов.Разделы.Получить(Выборка.Ссылка) = Неопределено Тогда
			//	Объект.ПометкаУдаления = Истина;
			//КонецЕсли;
			//Объект.ИмяПредопределенныхДанных = "";
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПВХОбъект, Ложь);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_10_0

Процедура ОбработкаОбновления_3_1_10_0() Экспорт
	
	ВерсияПрограммы = "3.1.10.0";
	
	// #16643
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0) КАК Ожидается
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(, ) КАК ЗаказыПоставщикамОстатки
	|		ПО (ЗаказыПоставщикамОстатки.ЗаказПоставщику = ДанныеДокумента.Ссылка)
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ожидается > 0 Тогда
			ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		Иначе
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_12_0

Процедура ОбработкаОбновления_3_1_12_0() Экспорт
	
	ВерсияПрограммы = "3.1.12.0";
	
	// новые регионы в макете
	РегистрыСведений.АдресныеОбъекты.ОбновитьСоставСубъектовРФПоКлассификатору(Истина);
	
	// #16875
	Справочники.СтатусыЛида.ЗаполнитьПоставляемыеСтатусы(Ложь);	
	
	// #16971
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыПродукции КАК ДанныеСправочника";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
	// #16971
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.УстановкаЦенМатериалов КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Продукция)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.УстановкаИндивидуальныхЦенМатериалов КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Продукция)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_13_0

Процедура ОбработкаОбновления_3_1_13_0() Экспорт
	
	ВерсияПрограммы = "3.1.13.0";

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Рекламация)
	|	И ДанныеДокумента.СуммаДокумента <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата
	|ИЗ
	|	Документ.Монтаж.ТоварыУслуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Рекламация)
	|	И ДанныеДокумента.ЦенаПоПрайсу <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Рекламация)
	|	И (ДанныеДокумента.СуммаДокумента <> 0
	|			ИЛИ ДанныеДокумента.СуммаДокументаПоПрайсу <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата
	|ИЗ
	|	Документ.ЗаказДоговор.ТоварыУслуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Рекламация)
	|	И (ДанныеДокумента.Сумма <> 0
	|			ИЛИ ДанныеДокумента.СуммаПоПрайсу <> 0)"
	;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// 16983
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.СоставПроизводственнойСмены КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// 16983
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.СоставПроизводственнойСмены КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.УДАЛИТЬ_ВидПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыПроизводства.ТиповоеПроизводство)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	// #17014
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Города КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.КодКЛАДР = 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДатаСеанса());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_17_0

Процедура ОбработкаОбновления_3_1_17_0() Экспорт
	
	ВерсияПрограммы = "3.1.17.0";

	//#16764
	Если Справочники.ВидыФайловПрограммыПостроителя.Макет.Загружать Тогда
		СпрОбъект = Справочники.ВидыФайловПрограммыПостроителя.Макет.ПолучитьОбъект();	
		СпрОбъект.Загружать = Ложь;
		СпрОбъект.ЗагружатьКакИзображениеНоменклатуры = Истина;
		СпрОбъект.Записать();
	КонецЕсли;
	Если Справочники.ВидыФайловПрограммыПостроителя.ЧертежПокупатель.Загружать Тогда
		СпрОбъект = Справочники.ВидыФайловПрограммыПостроителя.ЧертежПокупатель.ПолучитьОбъект();	
		СпрОбъект.Загружать = Ложь;
		СпрОбъект.ЗагружатьКакИзображениеНоменклатуры = Истина;
		СпрОбъект.Записать();
	КонецЕсли;
	
	//#16861
	Константы.ВремяНачалаСледующегоКонтакта.Установить(Константы.НачалоРабочегоВремениЗамеров.Получить());
	Константы.ВремяОкончанияСледующегоКонтакта.Установить(Константы.КонецРабочегоВремениЗамеров.Получить());
	Константы.ШагВремениВыбораСледующегоКонтакта.Установить(1);
	
	// #16971 заполнение нового реквизита "Способ определения стоимости"
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Ссылка,
	|	&ТекущаяДата КАК Дата
	|ИЗ
	|	Справочник.ВидыПродукции КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.СпособОпределенияСтоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСтоимостиПродукции.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.УстановкаЦенМатериалов КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.СпособОпределенияСтоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСтоимостиПродукции.ПустаяСсылка)
	|	И НЕ ДанныеДокумента.ВидПродукции = ЗНАЧЕНИЕ(Справочник.ВидыПродукции.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|ИЗ
	|	Документ.УстановкаИндивидуальныхЦенМатериалов КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.СпособОпределенияСтоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСтоимостиПродукции.ПустаяСсылка)
	|	И НЕ ДанныеДокумента.ВидПродукции = ЗНАЧЕНИЕ(Справочник.ВидыПродукции.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//++ 16971 новое измерение в регистре
	НаборЗаписей = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидСоздаваемойНоменклатуры.Установить(Справочники.ВидыНоменклатуры.Продукция);
	НаборЗаписей.Прочитать();
	
	ТаблицаПравил = НаборЗаписей.Выгрузить();
	
	Для каждого Запись из НаборЗаписей Цикл
		Если НЕ ЗначениеЗаполнено(Запись.ВидПродукции) Тогда
			Запись.ВидПродукции = Справочники.ВидыПродукции.Конструкция;
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
	Выборка = Справочники.ВидыПродукции.Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка = Справочники.ВидыПродукции.Конструкция Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого СтрокаПравила из ТаблицаПравил Цикл
			Если ЗначениеЗаполнено(СтрокаПравила.ВидПродукции) Тогда
				Продолжить;	
			КонецЕсли;
			МенеджерЗаписи = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаПравила);
			МенеджерЗаписи.ВидПродукции = Выборка.Ссылка;
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
	КонецЦикла;
	//-- 16971 новое измерение в регистре
	
	// ошибка в движениях в части услуг
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровИУслугУслуги.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровИУслугУслуги.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеТоваровИУслугУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам КАК регистрЗаказыПоставщикам
	|		ПО (регистрЗаказыПоставщикам.Регистратор = ПоступлениеТоваровИУслугУслуги.Ссылка)
	|			И (регистрЗаказыПоставщикам.Номенклатура = ПоступлениеТоваровИУслугУслуги.Номенклатура)
	|			И (регистрЗаказыПоставщикам.Цена = ПоступлениеТоваровИУслугУслуги.Цена)
	|ГДЕ
	|	ПоступлениеТоваровИУслугУслуги.НомерСтроки = 1
	|	И ПоступлениеТоваровИУслугУслуги.Ссылка.Основание ССЫЛКА Документ.ЗаказПоставщику
	|	И НЕ ПоступлениеТоваровИУслугУслуги.Ссылка.Основание = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И регистрЗаказыПоставщикам.Регистратор ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Ссылка КАК Ссылка,
	|	Монтаж.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	НЕ Монтаж.ПометкаУдаления
	|	И Монтаж.Результат НЕ В (ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.ВРаботе), ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.ЧастичноВыполнен))";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Ссылка КАК Ссылка,
	|	Монтаж.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	НЕ Монтаж.ПометкаУдаления
	|	И Монтаж.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.ВРаботе), ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.ЧастичноВыполнен))";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказДоговор.Ссылка КАК Ссылка,
	|	ЗаказДоговор.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	НЕ ЗаказДоговор.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.УДАЛИТЬ_РазрешеноРедактироватьМатериалыЗаказаНаПроизводство
	|	И НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, ТекущаяДата());
	КонецЦикла;
	
	//#17179
	ПравилоПоискаИсторииОбращений = Константы.ПравилоПоискаИсторииОбращений.Получить().Получить();
	Если НЕ ПравилоПоискаИсторииОбращений = Неопределено 
		И ТипЗнч(ПравилоПоискаИсторииОбращений) = Тип("Структура")
		И НЕ ПравилоПоискаИсторииОбращений.Свойство("ПоТелефону") 
		Тогда
		НовоеПравилоПоискаИсторииОбращений = Новый Структура;
		НовоеПравилоПоискаИсторииОбращений.Вставить("ПоТелефону", ПравилоПоискаИсторииОбращений.ПоОсновномуТелефону ИЛИ ПравилоПоискаИсторииОбращений.ПоДополнительномуТелефону);
		НовоеПравилоПоискаИсторииОбращений.Вставить("ПоАдресуЭлектроннойПочты", ПравилоПоискаИсторииОбращений.ПоАдресуЭлектроннойПочты);
		Константы.ПравилоПоискаИсторииОбращений.Установить(Новый ХранилищеЗначения(НовоеПравилоПоискаИсторииОбращений));
	КонецЕсли;	
	
	//#17179
	СтатусыЛидовВРаботе = Новый Массив; 
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.НазначитьЗамер); // Новый ЛИД
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера);	
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОтложенныйНазначитьЗамер);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОформитьДоговор);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ДоговорОформлен);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.РасчетДоЗамера);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОбработкаПослеЗамера);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.Обращение);
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатусыЛидовВРаботе", СтатусыЛидовВРаботе);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ТекущийСтатус В (&СтатусыЛидовВРаботе)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбязательнаяОбработка
	|ИЗ
	|	Документ.Лид КАК ДанныеДокумента
	|ГДЕ
	|	(НЕ (ВЫРАЗИТЬ(ДанныеДокумента.УДАЛИТЬ_ОсновнойТелефонКлиента КАК СТРОКА(10))) = """"
	|			ИЛИ (ВЫРАЗИТЬ(ДанныеДокумента.УДАЛИТЬ_ДополнительныйТелефонКлиента КАК СТРОКА(10))) = """"
	|			ИЛИ (ВЫРАЗИТЬ(ДанныеДокумента.УДАЛИТЬ_ЭлектроннаяПочтаКлиента КАК СТРОКА(10))) = """")";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОбязательнаяОбработка Тогда
			ПоместитьВРегистрОбязательныеКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		Иначе
			ПоместитьВРегистрКОбработке(ВерсияПрограммы, Выборка.Ссылка, Выборка.Дата);
		КонецЕсли;
	КонецЦикла;
	
	//16681
	МассивПрочиеИсполнители = новый Массив;
	МассивПрочиеИсполнители.Добавить("МенеджерВЛиде");
	МассивПрочиеИсполнители.Добавить("НазначилЗамерВЛиде");
	МассивПрочиеИсполнители.Добавить("МенеджерЗаказДоговора");
	МассивПрочиеИсполнители.Добавить("ЗамерщикЗаказДоговора");
	МассивПрочиеИсполнители.Добавить("МенеджерКонтрагента");
	Константы.ОтображатьПрочихИсполнителей.Установить(Новый ХранилищеЗначения(МассивПрочиеИсполнители));
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_18_0

Процедура ОбработкаОбновления_3_1_18_0() Экспорт
	
	ВерсияПрограммы = "3.1.18.0";

КонецПроцедуры

#КонецОбласти


#Область Обновление_3_2_0_0

Процедура ОбработкаОбновления_3_2_0_0() Экспорт
	
	ВерсияПрограммы = "3.2.0.0";
	
КонецПроцедуры

#КонецОбласти

