
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидыЦен.Очистить();
	ВидыЦен.ЗагрузитьЗначения(Параметры.ВидыЦен.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	Для НомерЭлемента = 0 По ВидыЦен.Количество()-1 Цикл
		ДанныеВыбора.Добавить(ВидыЦен.Получить(НомерЭлемента).Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ВидЦены.Пустая() Тогда
		ПоказатьПредупреждение(,"Укажите вид цен для заполнения");
		Возврат;
	КонецЕсли;
	
	ПараметрыОтвета = Новый Структура;
	ПараметрыОтвета.Вставить("ВидЦены", ВидЦены);
	Закрыть(ПараметрыОтвета);
	
КонецПроцедуры
