#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ДокументВладелец, ПараметрКоманды", ПараметрКоманды, ПараметрКоманды);
	
	ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", 
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор,
			ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти