#Область ОбработкаСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	Валюта = Константы.ВалютаУчета.Получить();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		// для случая вызова с формы списка регистра "Цены номенклатуры (индивидуальные)"
		Если ДанныеЗаполнения.Свойство("Номенклатура") Тогда
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ДанныеЗаполнения.Номенклатура;	
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Валюта.Пустая() Тогда
		Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	
	// проверка на дублирующиеся строки
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена Тогда
			ТекСтрокаТовары.Цена = 0;
			ТекСтрокаТовары.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка(); //#7274
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаТовары.ВидЦены) Тогда
			ТекСтрокаТовары.Цена = 0;                                     //#7274
		КонецЕсли;
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("Номенклатура", ТекСтрокаТовары.Номенклатура);
		СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", ТекСтрокаТовары.ХарактеристикаНоменклатуры);
		СтруктураПоиска.Вставить("ЕдиницаИзмерения", ТекСтрокаТовары.ЕдиницаИзмерения);
		РезПоиска = Товары.НайтиСтроки(СтруктураПоиска);
		Если РезПоиска.Количество()  > 1 Тогда
			Сообщить("Обнаружена дублирующаяся строка для позиции: " + ТекСтрокаТовары.Номенклатура +
			         " (" + ТекСтрокаТовары.ВидЦены + ", ед.изм. - " + ТекСтрокаТовары.ЕдиницаИзмерения +
			         ")");		
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЦеныНоменклатурыИндивидуальные	
	Движения.ЦеныНоменклатурыИндивидуальные.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если НеРегистрироватьНулевыеЦены И ТекСтрокаТовары.Цена = 0 И НЕ ЗначениеЗаполнено(ТекСтрокаТовары.ВидЦены)
			И НЕ ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена Тогда
			Продолжить;
		КонецЕсли;
		//На родителя у которого есть характеристики, но характеристика не указана цены не записываем
		Если Справочники.Номенклатура.ИспользуютсяХарактеристикиНоменклатуры(ТекСтрокаТовары.Номенклатура) 
			И ТекСтрокаТовары.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ЦеныНоменклатурыИндивидуальные.Добавить();
		Движение.Период 					= Дата;
		Движение.Валюта 					= Валюта;
		Движение.Контрагент 				= Контрагент;
		Движение.ДоговорКонтрагента 		= ДоговорКонтрагента;
		Движение.Номенклатура 				= ТекСтрокаТовары.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		Движение.ЕдиницаИзмерения 			= ТекСтрокаТовары.ЕдиницаИзмерения;
		Движение.Цена 						= ТекСтрокаТовары.Цена;
		Движение.ВидЦены 					= ТекСтрокаТовары.ВидЦены;
		Движение.Наценка 					= ТекСтрокаТовары.Наценка;
		Движение.Отменена					= (ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена);
		Движение.Автор 						= Автор;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
