// СпособОкругления  - Округление сумм по строкам(0), Округление цен по строкам(1), Округление общей суммы(2)
// ВариантОкругления - Изменять цену(0), Изменять сумму ручной скидки(1)

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПорядокОкругленияЧислом = 0.01; //Перечисления.ПорядкиОкругления.Окр1;
	
	КодФормы = "";
	Если Параметры.Свойство("ТипВладельца") Тогда
		КодФормы = "ОбщаяФорма_ФормаНастроекОкругления_" + Параметры.ТипВладельца;
		
		Если Параметры.ТипВладельца = "УстановкаЦенНоменклатуры" Тогда
			Элементы.ГруппаРасширенныеНастройки.Видимость = Ложь;
		КонецЕсли;		
	КонецЕсли;	
	
	Если НЕ Параметры.ЗапретИзмененияЦен Тогда //#15422
		Элементы.ВариантОкругления.СписокВыбора.Добавить(0, "Изменять цену");
	КонецЕсли;
	Если НЕ Параметры.ЗапретСкидок Тогда //#15422
		Элементы.ВариантОкругления.СписокВыбора.Добавить(1, "Изменять сумму ручной скидки");
	КонецЕсли;
	
	УстановитьЗначенияПоНастройкамФормы();
	
	ОбщийМодульСервер.ЗаполнитьПредопределенныеПорядкиОкругления(Элементы.ПорядокОкругления);
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьВДокументе(Команда)
	
	СохранитьНастройкиФормыНаСервере();
	Результат = Новый Структура("ПорядокОкругления, ОкруглятьВБольшуюСторону, СпособОкругления, ВариантОкругления", ПорядокОкругленияЧислом, ОкруглятьВБольшуюСторону, СпособОкругления, ВариантОкругления);
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособОкругленияПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ВариантОкругления.Видимость = НЕ (СпособОкругления = 1);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормыНаСервере()
	
	НастройкиФормы = НастройкиФормы();
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КодФормы, "", НастройкиФормы);
	
КонецПроцедуры

&НаСервере
Функция НастройкиФормы()
	
	НастройкиФормы = Новый Структура;	
	НастройкиФормы.Вставить("ВариантОкругления", 		ВариантОкругления);	
	НастройкиФормы.Вставить("ОкруглятьВБольшуюСторону", ОкруглятьВБольшуюСторону);
	//НастройкиФормы.Вставить("ПорядокОкругления", 		ПорядокОкругления);
	НастройкиФормы.Вставить("ПорядокОкругленияЧислом", 	ПорядокОкругленияЧислом);
	НастройкиФормы.Вставить("СпособОкругления", 		СпособОкругления);
	Возврат НастройкиФормы;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначенияПоНастройкамФормы()
	Если ПустаяСтрока(КодФормы) Тогда
		Возврат;
	КонецЕсли;
	// Если есть сохраненные настройки, то установить значения по настройкам.
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КодФормы,  "");
	
	Если Настройки <> Неопределено Тогда
		
		Если Настройки.Свойство("ВариантОкругления") Тогда
			Если НЕ Элементы.ВариантОкругления.СписокВыбора.НайтиПоЗначению(Настройки.ВариантОкругления) = Неопределено Тогда  //#15422
				ВариантОкругления = Настройки.ВариантОкругления;
			КонецЕсли;
		КонецЕсли;
		Если Настройки.Свойство("ОкруглятьВБольшуюСторону") Тогда
			ОкруглятьВБольшуюСторону = Настройки.ОкруглятьВБольшуюСторону;
		КонецЕсли;
		Если Настройки.Свойство("ПорядокОкругленияЧислом") Тогда
			ПорядокОкругленияЧислом = Настройки.ПорядокОкругленияЧислом;
		КонецЕсли;
		Если Настройки.Свойство("СпособОкругления") Тогда
			СпособОкругления = Настройки.СпособОкругления;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
