
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументУСВ = Параметры.ДокументУСВ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК ДокументРасчетаВыработки
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейРозницы КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ДокументУСВ = &ДокументУСВ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период,
	|	ДанныеРегистра.Регистратор
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейПроизводства КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ДокументУСВ = &ДокументУСВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ.Период КАК Период,
	|	ВТ.ДокументРасчетаВыработки КАК ДокументРасчетаВыработки
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("ДокументУСВ", ДокументУСВ);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, Элемент.ТекущиеДанные.ДокументРасчетаВыработки);
	
КонецПроцедуры
