
#Область ОбработчикиОбновления

//++ №14262
Процедура ЗаполнитьНовоеПолеОрганизация(Версия) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыпускПродукции.Организация КАК Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	НЕ ВыпускПродукции.ПометкаУдаления
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивОрганизаций = новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивОрганизаций.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если МассивОрганизаций.Количество() > 0 Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СоставПроизводственнойСмены.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СоставПроизводственнойСмены КАК СоставПроизводственнойСмены
		|ГДЕ
		|	НЕ СоставПроизводственнойСмены.ПометкаУдаления
		|";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДокументОбъект.Организация = МассивОрганизаций[0];
			
			// Если организация одна, сразу записываем
			Если МассивОрганизаций.Количество() = 1 Тогда
				
				Попытка
					ДокументОбъект.Записать();
				Исключение
					Сообщить("Не удалось установить организацию: " + ДокументОбъект.Организация + " в документе: " + ДокументОбъект.Ссылка);
				КонецПопытки;
				
			Иначе
				
				// Создаём копии на каждую организацию (в транзакции) и фиксируем в основном документе
			    НачатьТранзакцию();
				
				КоличествоОрганизаций = МассивОрганизаций.Количество() - 1;
				
				Успешно = Истина;
				
				Для Сч = 1 По КоличествоОрганизаций Цикл
					
					НовыйДокументОбъект = ДокументОбъект.Скопировать();
					
					НовыйДокументОбъект.Организация = МассивОрганизаций[Сч];
					НовыйДокументОбъект.Дата = ДокументОбъект.Дата;
					
					НовыйДокументОбъект.Комментарий = СтрШаблон("#Создан автоматически при обновлении на версию %1, исходный документ №%2 от %3#", Версия, ДокументОбъект.Номер, ДокументОбъект.Дата);
					
					Попытка
						
						НовыйДокументОбъект.Записать(?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
						
					Исключение
						
						Успешно = Ложь;
						ОтменитьТранзакцию();
						
						Сообщить("Не удалось создать новый документ состав производственной смены по организации: " + НовыйДокументОбъект.Организация + " при копировании по документу: " + ДокументОбъект.Ссылка);
						Прервать;
						
					КонецПопытки;
					
				КонецЦикла;
				
				Попытка
					
					ДокументОбъект.Записать();
					
				Исключение
					
					Успешно = Ложь;
					ОтменитьТранзакцию();
					
					Сообщить("Не удалось установить организацию: " + ДокументОбъект.Организация + " в документе: " + ДокументОбъект.Ссылка);
					
				КонецПопытки;
				
				Если Успешно И ТранзакцияАктивна() Тогда
					ЗафиксироватьТранзакцию();
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
//-- №14262

#КонецОбласти

