#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ЭтоНовый() Тогда
		
		// №6687
		СпособНачисленияВыработки = ?(Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить(), Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации, Перечисления.СпособыНачисленияВыработки.Бригадная);
		
		// №6283
		ИспользоватьКТУВПроизводственныхОперациях = Константы.ИспользоватьКТУВПроизводственныхОперациях.Получить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидыПродукции.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не введено ни одной строки в список ""Виды продукции""", , , , Отказ); 	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли