&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборФормы = Новый Структура; 
	Если Параметры.Свойство("Отбор", ОтборФормы) Тогда
		ОтборФормы.Свойство("Номенклатура", ОтборНоменклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаЦенНоменклатуры(Команда)
	//Форма = ПолучитьФорму("Документ.УстановкаЦенНоменклатуры.ФормаОбъекта");
	//
	//Если ЭтаФорма.Окно <> Неопределено Тогда	
	//	ОбъектНоменклатура = Неопределено;
	//	Для Индекс = 0 По ЭтаФорма.Окно.Содержимое.Количество() - 1 Цикл
	//		Попытка		
	//			Если ТипЗнч(ЭтаФорма.Окно.Содержимое[Индекс].Объект.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
	//				ОбъектНоменклатура = ЭтаФорма.Окно.Содержимое[Индекс].Объект.Ссылка;
	//				Прервать;
	//			КонецЕсли;	
	//		Исключение				
	//		КонецПопытки;			
	//	КонецЦикла;
	//	
	//	Если ОбъектНоменклатура <> Неопределено Тогда
	//		ДанныеФормы = Форма.ЦеныДерево;
	//		ЗаполнитьДокументНаСервере(ДанныеФормы, ЭтаФорма.Окно.Содержимое[0].Объект.Ссылка);
	//		КопироватьДанныеФормы(ДанныеФормы, Форма.ЦеныДерево);
	//	КонецЕсли;		
	//КонецЕсли;
	//
	//Форма.Открыть();
	
	ПараметрыЗаполнения = Новый Структура;
 	ПараметрыЗаполнения.Вставить("Номенклатура", ОтборНоменклатура); 
 	ПараметрыФормыУЦН = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
 	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.ФормаОбъекта", ПараметрыФормыУЦН, ЭтаФорма);
	
КонецПроцедуры

//&НаСервере
//Функция ЗаполнитьДокументНаСервере(ДанныеФормы, ОбъектНоменклатура);
//	Дерево = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДеревоЗначений"));
//	Стр = Дерево.Строки.Добавить();
//	Стр.Номенклатура = ОбъектНоменклатура;	
//	ЗначениеВДанныеФормы(Дерево, ДанныеФормы);
//КонецФункции 

