
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ДекорацияСостояние.Заголовок = СтрШаблон(Элементы.ДекорацияСостояние.Заголовок, Параметры.ДокументСсылка, Параметры.Сотрудник);
	
	Сотрудник = Параметры.Сотрудник;
	
	ИспользоватьСтатусы = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыСборкиЗаказовПокупателей");
		
	Если ИспользоватьСтатусы Тогда
		Элементы.ГруппаКнопки.ТекущаяСтраница = Элементы.ГруппаСтатусы;
		Элементы.ЗаказПокупателяСобранПолностью.КнопкаПоУмолчанию = Истина;
		ГруппаНижнихКнопок = Элементы.ГруппаСтатусы;
	Иначе
		Элементы.ГруппаКнопки.ТекущаяСтраница = Элементы.ГруппаБезСтатусов;
		Элементы.ЗаказПокупателяИзменитьСборщика.КнопкаПоУмолчанию = Истина;
		ГруппаНижнихКнопок = Элементы.ГруппаБезСтатусов;
	КонецЕсли;
	
	// #14908
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ДействияВРабочемМестеРаботникаСклада КАК ДанныеСправочника
	|ГДЕ
	|	(НЕ ДанныеСправочника.ЭтапОтображения = ЗНАЧЕНИЕ(Перечисление.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКСотрудника)
	|		ИЛИ НЕ ДанныеСправочника.Доступно)
	|	И ДанныеСправочника.Предопределенный";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл		
		Элементы[Выборка.ИмяПредопределенныхДанных].Видимость = Ложь;
		ИмяЭлементаДублера = Выборка.ИмяПредопределенныхДанных + "1";
		Если НЕ Элементы.Найти(ИмяЭлементаДублера) = Неопределено Тогда
			Элементы[ИмяЭлементаДублера].Видимость = Ложь;	
		КонецЕсли;
	КонецЦикла;
	КнопокВНижнемРяду = 0;
	Для каждого Элемент из ГруппаНижнихКнопок.ПодчиненныеЭлементы Цикл
		Если Элемент.Видимость Тогда
			КнопокВНижнемРяду = КнопокВНижнемРяду + 1;
		КонецЕсли;
	КонецЦикла;
	Если КнопокВНижнемРяду > 1 Тогда
		Элементы.Отмена2.Видимость = Ложь;
	Иначе
		Элементы.Отмена1.Видимость = Ложь;
		Элементы.Отмена.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДействия(Команда)
	
	
	СтруктураРезультата = ОбщийМодульКлиент.РМРаботникаСклада_ОписаниеДействия(Команда.Имя, ИспользоватьСтатусы, Сотрудник);
		
	Закрыть(СтруктураРезультата);
	
КонецПроцедуры


