
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//++ №12611 выводим программно чтобы использовать свой макет оформления
	//	т.к. заголовок таблицы (заголовок 2 уровня) не меняется через условное оформление СКД
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	// заголовок
	ЗначениеЗаголовка = НастройкиОтчета.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заголовок"));
	ЗначениеЗаголовка.Значение = "Детализация взаиморасчетов";
	ЗначениеЗаголовка.Использование = Истина;
	
	СтПериод = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтПериод"));
	Если СтПериод.Использование Тогда
		ЗначениеПараметра = СтПериод.Значение;
		Если ТипЗнч(ЗначениеПараметра) = Тип("СтандартныйПериод") Тогда
    		ЗначениеЗаголовка.Значение = СтрШаблон("Детализация взаиморасчетов с %1 по %2", 
													Формат(ЗначениеПараметра.ДатаНачала, "ДЛФ=D"), Формат(ЗначениеПараметра.ДатаОкончания, "ДЛФ=D"));											
		КонецЕсли;
	КонецЕсли;     
	
	// вывод бонусов
	ПроверитьОтключитьКолонкиБонусы(НастройкиОтчета); // №13246
	
	МакетОформления = ПолучитьМакет("МакетОформления");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки, МакетОформления);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ТабличныйДокумент = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//-- №12611
	
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетПустой", Ложь);
	
	ПослеКомпоновкиРезультата(ТабличныйДокумент);
	
КонецПроцедуры

// вызывается в том числе из ОбщийМодульСервер.СформироватьИОтправитьОтчетДетализацииВзаиморасчетов
Процедура ПослеКомпоновкиРезультата(ТабличныйДокумент) Экспорт
	
	//++ #14300 объединить ячейки в строках "Начальный долг" / "Долг контрагента"
	КолонкаУвД = 0;
	КолонкаУмД = 0;
	НайденнаяОбласть = ТабличныйДокумент.НайтиТекст("Увеличение долга");
	Если НЕ НайденнаяОбласть = Неопределено Тогда
		КолонкаУвД = НайденнаяОбласть.Лево;
	КонецЕсли;
	НайденнаяОбласть = ТабличныйДокумент.НайтиТекст("Уменьшение долга");
	Если НЕ НайденнаяОбласть = Неопределено Тогда
		КолонкаУмД = НайденнаяОбласть.Лево;
	КонецЕсли;
	Если НЕ КолонкаУмД = 0 И НЕ КолонкаУмД = 0 Тогда
		
		ПодстрокаПоиска = "Начальный остаток";
		НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска);		
		Пока НЕ НайденнаяОбласть = Неопределено Цикл			
			Область = ТабличныйДокумент.Область(НайденнаяОбласть.Верх, КолонкаУвД, НайденнаяОбласть.Низ, КолонкаУмД);
			Область.Объединить();			
			НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска, НайденнаяОбласть);			
		КонецЦикла;
		
		ПодстрокаПоиска = "Конечный остаток";
		НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска);		
		Пока НЕ НайденнаяОбласть = Неопределено Цикл			
			Область = ТабличныйДокумент.Область(НайденнаяОбласть.Верх, КолонкаУвД, НайденнаяОбласть.Низ, КолонкаУмД);
			Область.Объединить();			
			НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска, НайденнаяОбласть);			
		КонецЦикла;
		
	КонецЕсли;
	//-- #14300
	
	//++ №14538 объединить ячейки в строках по бонусам (начальные и конечные остатки)
	КолонкаУвД = 0;
	КолонкаУмД = 0;
	
	НайденнаяОбласть = ТабличныйДокумент.НайтиТекст("Начисление бонусов");
	Если НЕ НайденнаяОбласть = Неопределено Тогда
		КолонкаУвД = НайденнаяОбласть.Лево;
	КонецЕсли;
	
	НайденнаяОбласть = ТабличныйДокумент.НайтиТекст("Списание бонусов");
	Если НЕ НайденнаяОбласть = Неопределено Тогда
		КолонкаУмД = НайденнаяОбласть.Лево;
	КонецЕсли;
	
	Если НЕ КолонкаУмД = 0 И НЕ КолонкаУмД = 0 Тогда
		
		ПодстрокаПоиска = "Начальный остаток";
		НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска);
		Пока НЕ НайденнаяОбласть = Неопределено Цикл
			
			Область = ТабличныйДокумент.Область(НайденнаяОбласть.Верх, КолонкаУвД, НайденнаяОбласть.Низ, КолонкаУмД);
			Область.Объединить();			
			
			НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска, НайденнаяОбласть);
			
		КонецЦикла;
		
		ПодстрокаПоиска = "Конечный остаток";
		НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска);		
		Пока НЕ НайденнаяОбласть = Неопределено Цикл
			
			Область = ТабличныйДокумент.Область(НайденнаяОбласть.Верх, КолонкаУвД, НайденнаяОбласть.Низ, КолонкаУмД);
			Область.Объединить();
			
			НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска, НайденнаяОбласть);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Строки "Начальный остаток", "Обороты", "Конечный остаток" выделяем жирным шрифтом
	МассивПодстрокПоиска = новый Массив;
	МассивПодстрокПоиска.Добавить("Начальный остаток");
	МассивПодстрокПоиска.Добавить("Обороты за период");
	МассивПодстрокПоиска.Добавить("Конечный остаток");
	
	Для Каждого ПодстрокаПоиска Из МассивПодстрокПоиска Цикл
		
		НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска);
		Пока НЕ НайденнаяОбласть = Неопределено Цикл
			
			Область = ТабличныйДокумент.Область(НайденнаяОбласть.Верх,, НайденнаяОбласть.Низ);
			Область.Шрифт = новый Шрифт(НайденнаяОбласть.Шрифт,,, Истина);
			
			НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска, НайденнаяОбласть);
			
		КонецЦикла;
		
	КонецЦикла;
	//-- №14538

КонецПроцедуры

//++ №13246
Процедура ПроверитьОтключитьКолонкиБонусы(НастройкиОтчета, ПользовательскиеНастройки = Неопределено) Экспорт
	
	УчетБонусов = ПолучитьФункциональнуюОпцию("УчетБонусов");
	
	//ИдентификаторПользовательскойНастройки = "";
	
	// Меняем структуру (только отключаем колонки связанные с бонусами, если они выключены в настройках)
	Если ТипЗнч(НастройкиОтчета) = Тип("НастройкиКомпоновкиДанных") Тогда
		
		Попытка
			
			Для Каждого ЭлКолонки Из НастройкиОтчета.Выбор.Элементы Цикл
				
				Если ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("СуммаБонусовПриход")
					Или ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("СуммаБонусовРасход")
					//++ №14592
					Или ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("ОР_БонусыСуммаНачальныйОстаток")
					Или ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("СуммаБонусовНачальныйОстаток")
					Или ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("СуммаБонусовКонечныйОстаток")
					Или ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("ОР_БонусыСуммаКонечныйОстаток")
					//-- №14592
				Тогда
					
					Если Не УчетБонусов Тогда
						ЭлКолонки.Использование = Ложь;
						ЭлКолонки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
					КонецЕсли;
					
					//Если ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("СуммаБонусовПриход") Тогда
					//	ИдентификаторПользовательскойНастройки = НастройкиОтчета.Выбор.ИдентификаторПользовательскойНастройки;
					//КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	//// Меняем пользовательские настройки
	//Если ТипЗнч(ПользовательскиеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
	//	
	//	Попытка
	//		
	//		Для Каждого ЭлементПН Из ПользовательскиеНастройки.Элементы Цикл
	//			
	//			Если НЕ ТипЗнч(ЭлементПН) = Тип("ВыбранныеПоляКомпоновкиДанных") Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			ЕстьПолеСуммаБонусов = Ложь;
	//			
	//			Для Каждого ВыбранноеПолеПН Из ЭлементПН.Элементы Цикл
	//				
	//				Если ВыбранноеПолеПН.Поле = Новый ПолеКомпоновкиДанных("СуммаБонусовОборот") Тогда
	//					
	//					ЕстьПолеСуммаБонусов = Истина;
	//					
	//					Если НЕ УчетБонусов Тогда
	//						ЭлементПН.Элементы.Удалить(ВыбранноеПолеПН);
	//					КонецЕсли;
	//					
	//				КонецЕсли;
	//				
	//			КонецЦикла;
	//			
	//			// Если бонусы включены, но в пользовательской настройке нету поля бонусы, добавляем его (в зависимости от таблицы)
	//			Если УчетБонусов И НЕ ЕстьПолеСуммаБонусов Тогда
	//				
	//				Если НЕ ЭлементПН.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки Тогда
	//					Продолжить;
	//				КонецЕсли;
	//					
	//				НовоеПоле = ЭлементПН.Элементы.Вставить(0, Тип("ВыбранноеПолеКомпоновкиДанных"));
	//				НовоеПоле.Поле = новый ПолеКомпоновкиДанных("СуммаБонусовОборот");
	//				НовоеПоле.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	//				
	//			КонецЕсли;
	//			
	//		КонецЦикла;
	//		
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЕсли;
	
	//++ Вариант "Когда выбранные поля в отдельных таблицах"
	//УчетБонусов = ПолучитьФункциональнуюОпцию("УчетБонусов");
	//
	//ИдентификаторПользовательскойНастройкиВзаиморасчеты = "";
	//ИдентификаторПользовательскойНастройкиОжидаемыеРасчеты = "";
	//
	//// Меняем структуру (только отключаем колонки связанные с бонусами, если они выключены в настройках)
	//Если ТипЗнч(НастройкиОтчета) = Тип("НастройкиКомпоновкиДанных") Тогда
	//	
	//	Попытка
	//		
	//		СтруктураВерхняяКонтрагент = НастройкиОтчета.Структура[0];
	//		
	//		Для Каждого ЭлементСтруктуры Из СтруктураВерхняяКонтрагент.Структура Цикл
	//			
	//			Если Не ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			Для Каждого СтрокаТаблицы Из ЭлементСтруктуры.Строки Цикл
	//				
	//				Для Каждого ЭлКолонки Из СтрокаТаблицы.Выбор.Элементы Цикл
	//					
	//					Если ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("СуммаБонусовОборот") Или ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("ОР_СуммаБонусов") Тогда
	//						
	//						Если Не УчетБонусов Тогда
	//							ЭлКолонки.Использование = Ложь;
	//							ЭлКолонки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//						КонецЕсли;
	//						
	//						Если ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("СуммаБонусовОборот") Тогда
	//							ИдентификаторПользовательскойНастройкиВзаиморасчеты = СтрокаТаблицы.Выбор.ИдентификаторПользовательскойНастройки;
	//						КонецЕсли;
	//						
	//						Если ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("ОР_СуммаБонусов") Тогда
	//							ИдентификаторПользовательскойНастройкиОжидаемыеРасчеты = СтрокаТаблицы.Выбор.ИдентификаторПользовательскойНастройки;
	//						КонецЕсли;
	//						
	//					КонецЕсли;
	//					
	//				КонецЦикла;
	//				
	//			КонецЦикла;
	//			
	//		КонецЦикла;
	//		
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЕсли;
	//
	//// Меняем пользовательские настройки
	//Если ТипЗнч(ПользовательскиеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
	//	
	//	Попытка
	//		
	//		Для Каждого ЭлементПН Из ПользовательскиеНастройки.Элементы Цикл
	//			
	//			Если НЕ ТипЗнч(ЭлементПН) = Тип("ВыбранныеПоляКомпоновкиДанных") Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			ЕстьПолеСуммаБонусов = Ложь;
	//			
	//			Для Каждого ВыбранноеПолеПН Из ЭлементПН.Элементы Цикл
	//				
	//				Если ВыбранноеПолеПН.Поле = Новый ПолеКомпоновкиДанных("СуммаБонусовОборот") Или ВыбранноеПолеПН.Поле = Новый ПолеКомпоновкиДанных("ОР_СуммаБонусов") Тогда
	//					
	//					ЕстьПолеСуммаБонусов = Истина;
	//					
	//					Если НЕ УчетБонусов Тогда
	//						ЭлементПН.Элементы.Удалить(ВыбранноеПолеПН);
	//					КонецЕсли;
	//					
	//				КонецЕсли;
	//				
	//			КонецЦикла;
	//			
	//			// Если бонусы включены, но в пользовательской настройке нету поля бонусы, добавляем его (в зависимости от таблицы)
	//			Если УчетБонусов И НЕ ЕстьПолеСуммаБонусов Тогда
	//				
	//				НазваниеПоля = "";
	//				
	//				Если ЭлементПН.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройкиВзаиморасчеты Тогда
	//					
	//					// В таблице "Взаиморасчеты"
	//					НазваниеПоля = "СуммаБонусовОборот";
	//					
	//				ИначеЕсли ЭлементПН.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройкиОжидаемыеРасчеты Тогда
	//					
	//					// В таблице "Ожидаемые расчёты"
	//					НазваниеПоля = "ОР_СуммаБонусов";
	//					
	//				КонецЕсли;
	//				
	//				Если НазваниеПоля = "" Тогда
	//					Продолжить;
	//				КонецЕсли;
	//				
	//				НовоеПоле = ЭлементПН.Элементы.Вставить(0, Тип("ВыбранноеПолеКомпоновкиДанных"));
	//				НовоеПоле.Поле = новый ПолеКомпоновкиДанных(НазваниеПоля);
	//				НовоеПоле.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	//				
	//			КонецЕсли;
	//			
	//		КонецЦикла;
	//		
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЕсли;
	//-- Вариант "Когда выбранные поля в отдельных таблицах"
	
КонецПроцедуры
//-- №13246

#КонецОбласти

#КонецЕсли
