#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	//НеРегистрировытьНулевыеЦены = Истина; // указано в свойствах реквизита
	Валюта = Константы.ВалютаУчета.Получить();

	//++ №14786 заполнение по контролю цен
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ПоКонтролюЦен") Тогда
		
		//Дата = ДанныеЗаполнения.Основание.Дата;
		Основание = ДанныеЗаполнения.Основание;
		Валюта = ДанныеЗаполнения.Валюта;
		
		Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.МассивЦен Цикл
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			// Вид цены
			Если ВидыЦен.НайтиСтроки(новый Структура("ВидЦены", ТекущаяСтрока.ВидЦены)).Количество() = 0 Тогда
				
				НоваяСтрокаВидЦен = ВидыЦен.Добавить();
				НоваяСтрокаВидЦен.ВидЦены = ТекущаяСтрока.ВидЦены;
				
			КонецЕсли;
			
		КонецЦикла;
		
	//-- №14786
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		// для случая вызова с формы списка регистра "Цены номенклатуры"
		НоменклатураДляДобавления = Справочники.Номенклатура.ПустаяСсылка();
		ДанныеЗаполнения.Свойство("Номенклатура", НоменклатураДляДобавления);
		Если НЕ НоменклатураДляДобавления = Справочники.Номенклатура.ПустаяСсылка() Тогда
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = НоменклатураДляДобавления;	
			НоваяСтрока.ЕдиницаИзмерения = НоменклатураДляДобавления.БазоваяЕдиницаИзмерения;
		КонецЕсли;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		// Заполнение шапки
		Основание = ДанныеЗаполнения;
		Валюта = ДанныеЗаполнения.Валюта;
		//НеРегистрировытьНулевыеЦены = Истина;
		// Заполнение Типов цен
		УстановкаЦенСервер.ЗаполнитьИспользуемыеВидыЦен(ЭтотОбъект);

		// Заполнение товаров
		Для каждого СтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			Для каждого СтрокаВидЦены из ВидыЦен Цикл
				// сначала товары, затем цены, чтобы при открытии документы корректно сттоилось дерево
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
				НоваяСтрока.ВидЦены = СтрокаВидЦены.ВидЦены;
				
				//2017-11-14
				Если ДанныеЗаполнения.СтоимостьДоставки > 0 Тогда				
					Коэффициент = 0;
					Если НЕ ДанныеЗаполнения.Товары.Итог("Сумма") = 0 Тогда
						Коэффициент = СтрокаТовары.Сумма / ДанныеЗаполнения.Товары.Итог("Сумма");
					КонецЕсли;
					НоваяСтрока.Цена = СтрокаТовары.Цена + Окр(ДанныеЗаполнения.СтоимостьДоставки * Коэффициент / СтрокаТовары.Количество, 2); 
				КонецЕсли;
		
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// проверка на дублирующиеся строки
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("Номенклатура", ТекСтрокаТовары.Номенклатура);
		СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", ТекСтрокаТовары.ХарактеристикаНоменклатуры);
		СтруктураПоиска.Вставить("ВидЦены", ТекСтрокаТовары.ВидЦены);
		СтруктураПоиска.Вставить("ЕдиницаИзмерения", ТекСтрокаТовары.ЕдиницаИзмерения);
		РезПоиска = Товары.НайтиСтроки(СтруктураПоиска);
		Если РезПоиска.Количество()  > 1 Тогда
			Сообщить("Обнаружена дублирующаяся строка для позиции: " + ТекСтрокаТовары.Номенклатура +
			         " (" + ТекСтрокаТовары.ВидЦены + ", ед.изм. - " + ТекСтрокаТовары.ЕдиницаИзмерения +
			         ")");
			
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		// #12829 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаТоваров", Товары.Выгрузить());
		Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаТоваров.ВидЦены КАК ВидЦены
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатуры.Регистратор КАК Регистратор
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО (ЦеныНоменклатуры.Период = &Период)
		|			И (ЦеныНоменклатуры.Номенклатура = ВТ.Номенклатура)
		|			И (ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ВТ.ХарактеристикаНоменклатуры)
		|			И (ЦеныНоменклатуры.ЕдиницаИзмерения = ВТ.ЕдиницаИзмерения)
		|			И (ЦеныНоменклатуры.ВидЦены = ВТ.ВидЦены)
		|			И (НЕ ЦеныНоменклатуры.Регистратор = &Ссылка)";
		
		РезультатЗапроса = Запрос.Выполнить();	
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = "Для позиции %1 (%2) уже имеется установленная цена ""%3"" за дату %4 документом %5";
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
			Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры, Выборка.ВидЦены, Формат(Дата, "ДЛФ=D"), Выборка.Регистратор);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЦеныНоменклатуры
	ВалютаЦен = Валюта;
	Если ВалютаЦен.Пустая() Тогда
		ВалютаЦен = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если НеРегистрировытьНулевыеЦены и ТекСтрокаТовары.Цена = 0 Тогда
			Продолжить;
		КонецЕсли;
		//пропускать не нужно, т.к. пустая характеристика - это тоже характеристика
		////На родителя у которого есть характеристики, но характеристика не указана цены не записываем
		//Если Справочники.Номенклатура.ИспользуютсяХарактеристикиНоменклатуры(ТекСтрокаТовары.Номенклатура) И ТекСтрокаТовары.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда
		//	Продолжить;
		//КонецЕсли;
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Валюта = ВалютаЦен;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		Движение.ВидЦены = ТекСтрокаТовары.ВидЦены;
		Движение.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
		Движение.Цена = ТекСтрокаТовары.Цена;
		Движение.Автор = Автор;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти