
&НаСервере
Процедура ДобавитьПравилоПоГарпунуНаСервере()
	
	ЭлементГарпуна = Неопределено;
	Попытка
		ЭлементГарпуна = Константы.УДАЛИТЬ_ЭлементГарпун.Получить();
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ЭлементГарпуна) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ПравилаОбработкиФайлаПрограммыПостроителя.СоздатьНаборЗаписей();
	
	НаборЗаписей.Прочитать();
		
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.ПараметрФайла 			= Справочники.ПараметрыФайлаПрограммыПостроителя.КоличествоГарпун; 
	НоваяЗапись.Номенклатура 			= ЭлементГарпуна; 
	НоваяЗапись.ЕдиницаИзмерения 		= ЭлементГарпуна.БазоваяЕдиницаИзмерения;
	НоваяЗапись.ВидЗаказа 				= Перечисления.ВидыЗаказов.ЗаказНаПроизводство;
	НоваяЗапись.ТабличнаяЧастьЗаказа	= "Материалы";
	НоваяЗапись.ВариантОпределенияКоличества = 1;
	НоваяЗапись.Коэффициент             = 1;
		
	НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПравилоПоГарпуну(Команда)
	ДобавитьПравилоПоГарпунуНаСервере();
КонецПроцедуры
