
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ (Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить() И Константы.ИспользоватьУчетПоСтатьямДДС.Получить()) Тогда
		Если НЕ ПроверяемыеРеквизиты.Найти("СтатьяДДСПриПродаже") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СтатьяДДСПриПродаже"));
		КонецЕсли;
		Если НЕ ПроверяемыеРеквизиты.Найти("СтатьяДДСПриВозврате") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СтатьяДДСПриВозврате"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
