
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    П = Новый Структура("Карта", ПараметрКоманды);
    Режим = РежимДиалогаВопрос.ОКОтмена;    
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, П);
    ПоказатьВопрос(Оповещение, "Продолжить выполнение операции?", Режим);
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.ОК Тогда
        ПерезаполнитьПлановыеДаты(Параметры.Карта);
    КонецЕсли;
КонецПроцедуры    

&НаСервере
Процедура ПерезаполнитьПлановыеДаты(Карта)
	БизнесПроцессы.ИА_БПНоситель.ПересчитатьПлановыеДаты(Неопределено, Карта);
КонецПроцедуры
 