#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВидНоменклатурыПотолка(ПараметрыПотолка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПравилаОпределенияВидаПотолкаПараметры.Ссылка КАК Ссылка,
	|	ПравилаОпределенияВидаПотолкаПараметры.Имя КАК Имя,
	|	ПравилаОпределенияВидаПотолкаПараметры.Значение КАК Значение
	|ИЗ
	|	Справочник.ПравилаОпределенияВидаПотолка.Параметры КАК ПравилаОпределенияВидаПотолкаПараметры
	|ГДЕ
	|	ПравилаОпределенияВидаПотолкаПараметры.Использовать
	|	И ПравилаОпределенияВидаПотолкаПараметры.Ссылка = &Правило";
	
	//проверяем на отрез
	//Правило = Константы.ПравилоОпределенияОтреза.Получить(); #12532 закомментировано	
	//Если НЕ Правило.Пустая() Тогда
	Запрос.УстановитьПараметр("Правило", Справочники.ПравилаОпределенияВидаПотолка.Отрез);
	РезультатЗапроса = Запрос.Выполнить();		
	
	ЭтоОтрез = Истина;
	Если РезультатЗапроса.Пустой() Тогда
		ЭтоОтрез = Ложь;
	Иначе
		Выборка = РезультатЗапроса.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			Если СокрЛП(Выборка.Имя) = "МатериалГарпун" Тогда					
				Если ПараметрыПотолка.Гарпуны.Количество() = 1 Тогда
					Если НЕ СокрЛП(Выборка.Значение) = ПараметрыПотолка.Гарпуны[0].Материал Тогда
						ЭтоОтрез = Ложь;
						Прервать;	
					КонецЕсли;
				Иначе
					// многогарпунная продукция не может быть отрезом
					ЭтоОтрез = Ложь;
					Прервать;
				КонецЕсли;
			Иначе					
				Если НЕ СокрЛП(Выборка.Значение) = СокрЛП(ОбменСEasyCeiling.ПолучитьЗначениеРеквизита(ПараметрыПотолка, Выборка.Имя)) Тогда
					ЭтоОтрез = Ложь;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоОтрез Тогда
		Возврат Справочники.ВидыНоменклатуры.Отрез;
	КонецЕсли;
	//КонецЕсли;
	
	//#12523 закомментировано 
	//проверяем на типовой отрез
	//Правило = Константы.ПравилоОпределенияТиповогоОтреза.Получить();	
	//Если НЕ Правило.Пустая() Тогда

	//	Запрос.УстановитьПараметр("Правило", Правило);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	ЭтоОтрез = Истина;
	//	Пока Выборка.Следующий() Цикл			
	//		Если НЕ СокрЛП(Выборка.Значение) = СокрЛП(ОбменСEasyCeiling.ПолучитьЗначениеРеквизита(ПараметрыПотолка, Выборка.Имя)) Тогда
	//			ЭтоОтрез = Ложь;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если ЭтоОтрез Тогда
	//		Возврат Справочники.ВидыНоменклатуры.ТиповойОтрез;
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат Справочники.ВидыНоменклатуры.Потолок;
	
КонецФункции

#КонецОбласти

#КонецЕсли
