Функция ПолучитьСостояниеСофтФонПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекущееСостояниеПользователей.СофтФонПодключен КАК СофтФонПодключен
	|ИЗ
	|	РегистрСведений.ТекущееСостояниеПользователей КАК ТекущееСостояниеПользователей
	|ГДЕ
	|	ТекущееСостояниеПользователей.Пользователь = &Пользователь
	|	И ТекущееСостояниеПользователей.ДатаАктуальности >= &ДатаАктуальности";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса() - 60*5);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СофтФонПодключен;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции