
Функция ПолучитьНомерЗначения(Значение) Экспорт 
	
	Если Значение = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День") Тогда
		 Возврат 1;
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя") Тогда
		 Возврат 2;
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Месяц") Тогда
		 Возврат 3;
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Квартал") Тогда
		 Возврат 4;
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Год") Тогда
		 Возврат 5;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции
