&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПериодРегистрации") Тогда
		ДатаС = НачалоМесяца(Параметры.ПериодРегистрации);
		ДатаПо = КонецМесяца(Параметры.ПериодРегистрации);
	Иначе
		ДатаС = НачалоМесяца(ТекущаяДатаСеанса());
		ДатаПо = КонецМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ВозвращаемыеЗначения = Новый Структура;
	ВозвращаемыеЗначения.Вставить("ДатаС", ДатаС);
	ВозвращаемыеЗначения.Вставить("ДатаПо", ДатаПо);
	ВозвращаемыеЗначения.Вставить("ТипНачисления", ТипНачисления);
	Закрыть(ВозвращаемыеЗначения);
	
КонецПроцедуры

