&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Подразделение.Видимость = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	Элементы.НастроитьИнтеркампани.Доступность = НЕ Объект.ОсновнаяНастройкаИнтеркампани.Пустая();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИнтеркампани(Команда)
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("Ключ", Объект.ОсновнаяНастройкаИнтеркампани);
	ОткрытьФорму("Справочник.НастройкиИнтеркампани.ФормаОбъекта", ПараметрыНовойФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяНастройкаИнтеркампаниПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры
