#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПредставлениеПоказателя(КлючТекущегоВарианта = "") Экспорт
	
	Возврат "Замерщик";
	
КонецФункции

Функция ТипДанныхПоказателяСтрокой() Экспорт
	
	Возврат "СправочникСсылка.Сотрудники";
	
КонецФункции

// основная функция, где описываются разделы, показатели, тексты запросов для их вычисления
Функция ТаблицаДоступныхПоказателей(Знач ПолеПоказателя="", Знач ТипПоказателя="") Экспорт
	
	Возврат ОтчетыЭффективности.ТаблицаДоступныхПоказателейПоЗамерщикам(ПолеПоказателя, ТипПоказателя);
	
КонецФункции

Функция ДополнитьТекстЗапросаВТ(ТекстЗапроса) Экспорт

	// общие таблицы
	ОтчетыЭффективности.ДополнитьТекстЗапросаВТ(ТекстЗапроса);
	
КонецФункции
	
Функция НастройкиВариантаОтчета(ОтчетСсылка, КлючВарианта, Предопределенный) Экспорт
	
	Результат = ОтчетыЭффективности.ПустаяТаблицаПоказателей();
	
	ТаблицаДоступныхПоказателей = ТаблицаДоступныхПоказателей();
	
	// настройки предопределенных храним "внутри" отчета
	Если Предопределенный Тогда		
		
		Если КлючВарианта = "ВсеПоказатели" Тогда
			Для каждого СтрокаТЗ из ТаблицаДоступныхПоказателей Цикл
				НоваяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			КонецЦикла;
			
		ИначеЕсли КлючВарианта = "АнализЗамеровПоЗамерам" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеров", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоНеЗакрытыхЗамеров", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеров", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоВыполненныхЗамеровСДоговором", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоВыполненныхЗамеровБезДоговора", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровНевыполнен", Результат);			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровНаЗамерах", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровНаЗамерах", Результат);
			//++ №14841
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровПоВыполненнымЗамерам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровПоНазначеннымЗамерам", Результат);
			//-- №14841
						
		ИначеЕсли КлючВарианта = "АнализДоговоровПоЗамерам" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоров", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоров", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоПотолков", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "Площадь", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднееКоличествоПотолков", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСуммаДоговора", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийЧек", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСтоимостьМетра", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяПлощадь", Результат);
			//++ #15996
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоОформленныхДоговоровПоВыполненнымЗамерам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоОформленныхДоговоровПоНазначеннымЗамерам", Результат);
			//-- #15996
			
		ИначеЕсли КлючВарианта = "АнализДоговоров" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоПотолковПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднееКоличествоПотолковПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСуммаДоговораПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийЧекПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСтоимостьМетраПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяПлощадьПоДоговорам", Результат);
			//++ #15996
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоОформленныхДоговоровПоДоговорамПоВыполненнымЗамерам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоОформленныхДоговоровПоДоговорамПоНазначеннымЗамерам", Результат);
			//-- #15996
			
		ИначеЕсли КлючВарианта = "АнализПрайсаПоЗамерам" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоров", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоПрайсу", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаОтклоненияОтПрайса", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентОтклоненияОтПрайса", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаСкидкиДоговоров", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийПроцентСкидкиДоговоров", Результат);
			
		ИначеЕсли КлючВарианта = "АнализПрайсаПоДоговорам" Тогда
			// когда важен порядок
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДоговорамПоПрайсу", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаОтклоненияПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентОтклоненияОтПрайсаПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаСкидкиДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийПроцентСкидкиДоговоровПоДоговорам", Результат);
			
		ИначеЕсли КлючВарианта = "АнализМонтажей" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаМонтажейПоДатеЗамера", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПотолковМонтажейПоДатеЗамера", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаМонтажейПоДатеДоговора", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПотолковМонтажейПоДатеДоговора", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаМонтажейПоДатеМонтажа", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПотолковМонтажейПоДатеМонтажа", Результат);
						
		КонецЕсли;
		
	Иначе
		
		ОтчетыЭффективности.ЗаполнитьНастройкиПользовательскогоВариантаОтчета(ОтчетСсылка, КлючВарианта, ТаблицаДоступныхПоказателей, Результат);
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
