
&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Регистратор);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Период", Параметры.Период);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ВДПС", Параметры.ВДПС);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ФильтрОрг", константы.ИА_ФП_ВестиФППоОрганизациям.Получить());
КонецПроцедуры
