#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.ДатаНачала = Дата("00010101") Тогда
		Отчет.ДатаНачала = Параметры.ДатаНачала;
	Иначе 
		Отчет.ДатаНачала = НачалоНедели(ТекущаяДатаСеанса());		
	КонецЕсли;
	
	Если НЕ Параметры.ДатаОкончания = Дата("00010101") Тогда
		Отчет.ДатаОкончания = Параметры.ДатаОкончания;
	Иначе
		Отчет.ДатаОкончания = КонецНедели(ТекущаяДатаСеанса());
	КонецЕсли;
	Если Параметры.ДатаНачала = Дата("00010101") И Параметры.ДатаОкончания = Дата("00010101") Тогда
		Элементы.УстановитьНеделя.Пометка = Истина;	
	КонецЕсли;
	
	// ВариантОтображенияГрафика 
	СписокВариантов = МодульОтчетов.ПолучитьСписокВариантовГрафикаМонтажей();
	Для каждого ТекЭлемент из СписокВариантов Цикл
		Элементы.Вариант.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	ВариантОтображенияГрафикаПоУмолчанию = ?(ПолучитьФункциональнуюОпцию("ИспользоватьПулМонтажей"), 4, 2); // #9168
	ВариантОтображенияГрафикаНастройка = ХранилищеОбщихНастроек.Загрузить("ОтчетГрафикМонтажей", "ВариантОтображенияГрафика");
	//#9168
	//Вариант = ?(ВариантОтображенияГрафикаНастройка = Неопределено, 1, ВариантОтображенияГрафикаНастройка);
	Если ВариантОтображенияГрафикаНастройка = Неопределено Тогда
		Вариант = ВариантОтображенияГрафикаПоУмолчанию;
	ИначеЕсли СписокВариантов.НайтиПоЗначению(ВариантОтображенияГрафикаНастройка) = Неопределено Тогда
		Вариант = ВариантОтображенияГрафикаПоУмолчанию;
	Иначе
		Вариант = ВариантОтображенияГрафикаНастройка;
	КонецЕсли;
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ФильтроватьГрафикМонтажейПоТочкеПродаж, ТочкаПродаж");
	
	Если РеквизитыПользователя.ФильтроватьГрафикМонтажейПоТочкеПродаж Тогда
		ФильтрТочкаПродаж = РеквизитыПользователя.ТочкаПродаж;
	КонецЕсли;
	Элементы.ГруппаОписаниеБригад.Видимость = Ложь;
	
	ОписаниеБригадHTML = Документы.Монтаж.СформироватьОписаниеБригадHTML(ФильтрТочкаПродаж);
	
	//#6985
	НастройкаОформленияГрафикаМонтажей = ОбщийМодульСервер.ПолучитьНастройкуОформленияГрафикаМонтажей(); 
	НастройкиОформленияГрафикаМонтажей = ОбщийМодульСервер.ПолучитьНастройкиОформленияГрафикаМонтажей(НастройкаОформленияГрафикаМонтажей);
	ОбщийМодульСервер.ЗаполнитьГруппуГрафикОформление(ЭтаФорма, НастройкиОформленияГрафикаМонтажей, Элементы.ГруппаГрафикОформление);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//#9869
	ПодключитьОбработчикОжидания("СформироватьПриЗапуске", 0.3, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СформироватьПриЗапуске()
	Сформировать(Неопределено);
КонецПроцедуры

&НаСервере
Функция СформироватьГрафикМонтажейПроизвольныйПериод(ДатаНачала, ДатаОкончания)	
	Возврат МодульОтчетов.СформироватьГрафикМонтажейПроизвольныйПериод(ДатаНачала, ДатаОкончания, ФильтрТочкаПродаж);
КонецФункции

&НаСервере
Процедура СформироватьГрафикМонтажейКалендарьНаСервере(Развертка)	
	
	МодульОтчетов.СформироватьГрафикМонтажейКалендарь(РезультатПланировщик, Отчет.ДатаНачала, Отчет.ДатаОкончания, Развертка, ФильтрТочкаПродаж);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьГрафикПоПлануКалендарьНаСервере(Развертка, НеВыводитьРеальныеБригады = Ложь)	
	
	МодульОтчетов.СформироватьГрафикМонтажейПоПлануКалендарь(РезультатПланировщик, Отчет.ДатаНачала, Отчет.ДатаОкончания, Развертка, НеВыводитьРеальныеБригады, ФильтрТочкаПродаж);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Элементы.ДекорацияНетОтчета.Видимость = Ложь;
	Если Вариант = 1 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		СформироватьГрафикМонтажейКалендарьНаСервере(0);	
	ИначеЕсли Вариант = 2 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		СформироватьГрафикМонтажейКалендарьНаСервере(1);
	//#13361 
	ИначеЕсли Вариант = 7 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		СформироватьГрафикМонтажейКалендарьНаСервере(2);
		
	// пул (без реальных бригад)
	ИначеЕсли Вариант = 5 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		СформироватьГрафикПоПлануКалендарьНаСервере(0, Истина);	
	ИначеЕсли Вариант = 6 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		СформироватьГрафикПоПлануКалендарьНаСервере(1, Истина);
	//#13361 
	ИначеЕсли Вариант = 8 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		СформироватьГрафикПоПлануКалендарьНаСервере(2, Истина);
		
	// распределение монтажей
	ИначеЕсли Вариант = 3 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		СформироватьГрафикПоПлануКалендарьНаСервере(0);	
	ИначеЕсли Вариант = 4 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		СформироватьГрафикПоПлануКалендарьНаСервере(1);
	//#13361 
	ИначеЕсли Вариант = 9 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		СформироватьГрафикПоПлануКалендарьНаСервере(2);
		
	КонецЕсли; 
	ОбновитьОтображениеДанных();
	
	СформироватьОписаниеБригадHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДень(Команда)
	
	//#9869
	//Отчет.ДатаНачала = ТекущаяДата();
	//Отчет.ДатаОкончания = ТекущаяДата();
	//ОбновитьВидимостьЭлементов();
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.УстановитьПериодГрафикаДень(ЭтотОбъект, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНеделя(Команда)
	
	//#9869
	//Отчет.ДатаНачала = ТекущаяДата();
	//Отчет.ДатаОкончания = ТекущаяДата() + 60*60*24*6;
	//ОбновитьВидимостьЭлементов();
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.УстановитьПериодГрафикаНеделя(ЭтотОбъект, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМесяц(Команда)
	
	//#9869
	//Отчет.ДатаНачала = ТекущаяДата();
	//Отчет.ДатаОкончания = Добавитьмесяц(ТекущаяДата(), 1);
	//ОбновитьВидимостьЭлементов();
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.УстановитьПериодГрафикаМесяц(ЭтотОбъект, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	Элементы.ДекорацияНетОтчета.Видимость = Истина;
	Элементы.ГруппаРезультатПланировщик.Видимость = Ложь;
КонецПроцедуры
		
&НаКлиенте
Процедура ВариантПриИзменении(Элемент)
	
	ВариантОтображенияГрафикаПриИзмененииНаСервере();
	ОбновитьВидимостьЭлементов();
	// #13361
	Сформировать(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ВариантОтображенияГрафикаПриИзмененииНаСервере()
	ХранилищеОбщихНастроек.Сохранить("ОтчетГрафикМонтажей", "ВариантОтображенияГрафика", Вариант);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	//#9869
	//ОбновитьВидимостьЭлементов();
	ОбщийМодульКлиент.ПриИзмененииДатыНачалаГрафика(ЭтотОбъект);
	ДатаИнтервалаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	//#9869
	//ОбновитьВидимостьЭлементов();
	ОбщийМодульКлиент.ПриИзмененииДатыОкончанияГрафика(ЭтотОбъект);
	ДатаИнтервалаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИнтервалаПриИзменении()

	//СохранитьЗначенияНастроекОтчета();
	Сформировать(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДатИнтервала(Результат, ДополнительныеПараметры) Экспорт
	
	ДатаИнтервалаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ОписаниеОповещенияПослеВыбораПериода = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьДиалогВыбораПериода(ЭтотОбъект, ОписаниеОповещенияПослеВыбораПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьИнтервалВлево(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.СдвинутьДатуГрафика(ЭтотОбъект, -1, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьИнтервалВправо(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.СдвинутьДатуГрафика(ЭтотОбъект, 1, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти


#Область СобытияПланировщика

&НаКлиенте
Процедура РезультатПланировщикПриАктивизации(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикВыбор(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не Элементы.РезультатПланировщик.ВыделенныеЭлементы.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныйЭлемент = Элементы.РезультатПланировщик.ВыделенныеЭлементы[0];
	СтруктураМонтаж = ВыделенныйЭлемент.Значение;
	ДокументМонтаж = СтруктураМонтаж.Регистратор;
		
	Если Не ЗначениеЗаполнено(ДокументМонтаж) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ДокументМонтаж);
	
	Если ТипЗнч(ДокументМонтаж) = Тип("ДокументСсылка.Монтаж") Тогда
		ОткрытьФорму("Документ.Монтаж.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	//Выполнение = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	
	ОчиститьСообщения();
	
	Если Элемент.ВыделенныеЭлементы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Элемент.ВыделенныеЭлементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ВыделенныеЭлементы[0];
		
	ПараметрыЭлемента = Новый Структура("ИндексСтроки, МонтажСсылка, Начало, Конец, ДатаМонтажа, ВремяНачала, ВремяОкончания, Бригада, ИДМонтажа",
											ТекущиеДанные.Значение.ИндексСтроки, 
											ТекущиеДанные.Значение.Регистратор, 
											ТекущиеДанные.Начало, ТекущиеДанные.Конец,
											НачалоДня(ТекущиеДанные.Начало),
											Дата(1,1,1, Час(ТекущиеДанные.Начало), Минута(ТекущиеДанные.Начало), Секунда(ТекущиеДанные.Начало)),
											Дата(1,1,1, Час(ТекущиеДанные.Конец),  Минута(ТекущиеДанные.Конец),  Секунда(ТекущиеДанные.Конец)),
											ТекущиеДанные.ЗначенияИзмерений["Бригада"],
											ТекущиеДанные.Значение.ИДМонтажа);
											
	// проверки возможности изменения
	СтруктураПроверки = ВозможноИзменениеМонтажа(ПараметрыЭлемента);
	Если НЕ СтруктураПроверки.Результат Тогда
		Для каждого ТекстОшибки из СтруктураПроверки.ОписаниеОшибок Цикл
			Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли;
		КонецЦикла;
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли; 									
	
	// проверим свободный интервал		
	Если НЕ ПроверитьСвободныйИнтервалМонтажей(ПараметрыЭлемента, Вариант, ФильтрТочкаПродаж) Тогда	
		//Если НЕ СвободныйИнтервалМонтажей(ПараметрыЭлемента) Тогда									
		//	Сообщить("Выбранный интервал занят");
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли; 
	
	// проверим есть ли изменения
	ЕстьИзменения = ЕстьИзмененияВМонтаже(ПараметрыЭлемента);
	Если ЕстьИзменения Тогда
		ПослеСдвигаМонтажа = Новый ОписаниеОповещения("ПослеСдвигаМонтажа", ЭтаФорма, ПараметрыЭлемента);
		ПоказатьВопрос(ПослеСдвигаМонтажа, "Сохранить изменения в документе монтажа?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСдвигаМонтажа(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		//отказались от сохранения результата. Перестроим отчет по документам монтажа
        Сформировать(Неопределено);
		Возврат;
	КонецЕсли;
	
	ПослеСдвигаМонтажаНаСервере(ДополнительныеПараметры);
	Сформировать(Неопределено);

КонецПроцедуры

&НаСервере
Процедура ПослеСдвигаМонтажаНаСервере(ПараметрыМонтажа)
		
	ДокОбъект = ПараметрыМонтажа.МонтажСсылка.ПолучитьОбъект();
	ДокОбъект.Бригада = ПараметрыМонтажа.Бригада;
	
	РеквизитыБригады = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокОбъект.Бригада, "Бригадир, ВидБригады");
	ДокОбъект.Бригадир = РеквизитыБригады.Бригадир;
	
	//++ #12356	
	//ДокОбъект.Склад = ДокОбъект.Бригада.Склад;
	ДокОбъект.ЗаполнитьСкладыПоБригаде();
	ДокОбъект.ВидБригады = РеквизитыБригады.ВидБригады;
	//-- #12356
	
	ДокОбъект.Исполнители.Очистить();
	Для Каждого ТекущийСотрудник Из ДокОбъект.Бригада.Сотрудники Цикл
		НоваяСтрока = ДокОбъект.Исполнители.Добавить();
		НоваяСтрока.Сотрудник = ТекущийСотрудник.Сотрудник;
		НоваяСтрока.Коэффициент = 1;
	КонецЦикла;
	
	ДатаМонтажа    = Дата(Год(ПараметрыМонтажа.Начало),Месяц(ПараметрыМонтажа.Начало), День(ПараметрыМонтажа.Начало));
	ВремяНачала    = Дата(1, 1, 1, Час(ПараметрыМонтажа.Начало), Минута(ПараметрыМонтажа.Начало), Секунда(ПараметрыМонтажа.Начало));
	ВремяОкончания = Дата(1, 1, 1, Час(ПараметрыМонтажа.Конец),  Минута(ПараметрыМонтажа.Конец),  Секунда(ПараметрыМонтажа.Конец));	
	
	Если НЕ ДокОбъект.СрокМонтажа = Перечисления.СрокиМонтажа.МонтажНаНесколькоДней Тогда
		ДокОбъект.ДатаМонтажа = ДатаМонтажа;
		ДокОбъект.ВремяНачала = ВремяНачала;
		ДокОбъект.ВремяОкончания = ВремяОкончания;
	Иначе
		Если ДокОбъект.ГрафикМонтажей.Количество() >= ПараметрыМонтажа.ИндексСтроки Тогда
			ДанныеМонтажа = ДокОбъект.ГрафикМонтажей[ПараметрыМонтажа.ИндексСтроки-1];
			ДанныеМонтажа.ДатаМонтажа = ДатаМонтажа;
			ДанныеМонтажа.ВремяНачала = ВремяНачала;
			ДанныеМонтажа.ВремяОкончания = ВремяОкончания;
		КонецЕсли;
	КонецЕсли;
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Не удалось изменить " + ПараметрыМонтажа.МонтажСсылка + ". Ошибка: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
		// например при прокрутке ролика мыши
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
КонецПроцедуры

#КонецОбласти

#Область ОписаниеБригадHTML 

&НаСервере
Процедура СформироватьОписаниеБригадHTML()
	
	ОписаниеБригадHTML = Документы.Монтаж.СформироватьОписаниеБригадHTML(ФильтрТочкаПродаж);
	
КонецПроцедуры	

&НаКлиенте
Процедура ОписаниеБригадHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВРег(ДанныеСобытия.Element.tagName) = "A" Тогда
		
		СсылкаТекст = Сред(ДанныеСобытия.Element.href, 4);
		СсылкаБригада = БригадаПоВнутреннемуПредставлению(СсылкаТекст);
		Если НЕ СсылкаБригада.Пустая()  Тогда 
			ПоказатьЗначение(, СсылкаБригада);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция БригадаПоВнутреннемуПредставлению(СсылкаТекст) 
	Возврат ЗначениеИзСтрокиВнутр(СсылкаТекст);
КонецФункции

&НаКлиенте
Процедура ПоказатьОписаниеБригадНажатие(Элемент)
	
	Если Элементы.ГруппаОписаниеБригад.Видимость Тогда
		Элементы.ГруппаОписаниеБригад.Видимость = Ложь;
		Элементы.ПоказатьОписаниеБригад.Заголовок = "Показать описание бригад";
	Иначе
		Элементы.ГруппаОписаниеБригад.Видимость = Истина;
		Элементы.ПоказатьОписаниеБригад.Заголовок = "Скрыть описание бригад";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции 

&НаСервереБезКонтекста
Функция ПроверитьСвободныйИнтервалМонтажей(ПараметрыНовогоМонтажа, ВариантГрафика, ФильтрТочкаПродаж)
	
	Результат = Истина;
	
	ШаблонТекстаОшибки = "Интервал %1 %2-%3 для бригады ""%4"" занят!";
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПулМонтажей") Тогда
		Результат = МодульОтчетов.ПроверитьСвободныйИнтервалМонтажей(ПараметрыНовогоМонтажа, ВариантГрафика, ФильтрТочкаПродаж);
		Если НЕ Результат Тогда
			Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Формат(ПараметрыНовогоМонтажа.ДатаМонтажа, "ДЛФ=D"), Формат(ПараметрыНовогоМонтажа.ВремяНачала, "ДЛФ=T"), Формат(ПараметрыНовогоМонтажа.ВремяОкончания, "ДЛФ=T"), ПараметрыНовогоМонтажа.Бригада));
			Возврат Результат;
		КонецЕсли;

	Иначе
		Если ПараметрыНовогоМонтажа.ИндексСтроки = 0 Тогда	
			Результат = МодульОтчетов.ПроверитьСвободныйИнтервалМонтажей(ПараметрыНовогоМонтажа, ВариантГрафика, ФильтрТочкаПродаж);
			Если НЕ Результат Тогда
				Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Формат(ПараметрыНовогоМонтажа.ДатаМонтажа, "ДЛФ=D"), Формат(ПараметрыНовогоМонтажа.ВремяНачала, "ДЛФ=T"), Формат(ПараметрыНовогоМонтажа.ВремяОкончания, "ДЛФ=T"), ПараметрыНовогоМонтажа.Бригада));
				Возврат Результат;
			КонецЕсли;
		Иначе		
			// Проверка: для монтажей на несколько дней надо проверить свободный интервал на каждый промежуток
			Для каждого СтрокаМонтажа из ПараметрыНовогоМонтажа.МонтажСсылка.ГрафикМонтажей Цикл
				Если СтрокаМонтажа.НомерСтроки = ПараметрыНовогоМонтажа.ИндексСтроки Тогда
					Результат = МодульОтчетов.ПроверитьСвободныйИнтервалМонтажей(ПараметрыНовогоМонтажа, ВариантГрафика, ФильтрТочкаПродаж);
					Если НЕ Результат Тогда
						Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Формат(ПараметрыНовогоМонтажа.ДатаМонтажа, "ДЛФ=D"), Формат(ПараметрыНовогоМонтажа.ВремяНачала, "ДЛФ=T"), Формат(ПараметрыНовогоМонтажа.ВремяОкончания, "ДЛФ=T"), ПараметрыНовогоМонтажа.Бригада));
						Возврат Результат;
					КонецЕсли;
					
				Иначе
					ПараметрыПроверкиМонтажа = Новый Структура("ИндексСтроки, МонтажСсылка, ДатаМонтажа, ВремяНачала, ВремяОкончания, Бригада, ИДМонтажа",
																СтрокаМонтажа.НомерСтроки, 
																ПараметрыНовогоМонтажа.МонтажСсылка,
																СтрокаМонтажа.ДатаМонтажа,
																СтрокаМонтажа.ВремяНачала, СтрокаМонтажа.ВремяОкончания,
																ПараметрыНовогоМонтажа.Бригада,
																СтрокаМонтажа.ИДМонтажа);
					Результат = МодульОтчетов.ПроверитьСвободныйИнтервалМонтажей(ПараметрыПроверкиМонтажа, ВариантГрафика, ФильтрТочкаПродаж);							
					
					Если НЕ Результат Тогда
						Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Формат(ПараметрыПроверкиМонтажа.ДатаМонтажа, "ДЛФ=D"), Формат(ПараметрыПроверкиМонтажа.ВремяНачала, "ДЛФ=T"), Формат(ПараметрыПроверкиМонтажа.ВремяОкончания, "ДЛФ=T"), ПараметрыПроверкиМонтажа.Бригада));
						Возврат Результат;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВозможноИзменениеМонтажа(ПараметрыМонтажа)
	
	ОписаниеОшибок = Новый Массив;
	СтруктураПроверки = Новый Структура("Результат, ОписаниеОшибок", Истина, ОписаниеОшибок);

	// Проверка: является ли выбранный элемент монтажем, может быть Невыход
	Если ТипЗнч(ПараметрыМонтажа.МонтажСсылка) <> Тип("ДокументСсылка.Монтаж") Тогда
		СтруктураПроверки.Результат = Ложь;
		Возврат СтруктураПроверки;
		
	Иначе
		//#9168
		Если (ПараметрыМонтажа.МонтажСсылка.Результат = Справочники.РезультатыМонтажа.Выполнен ИЛИ ПараметрыМонтажа.МонтажСсылка.Результат = Справочники.РезультатыМонтажа.Закрыт)
			И НЕ ТипЗнч(ПараметрыМонтажа.Бригада) = Тип("СправочникСсылка.Бригады") Тогда
			ОписаниеОшибок.Добавить("Запрещен перенос в пул по выполненным монтажам!");
			СтруктураПроверки.Результат = Ложь;
			Возврат СтруктураПроверки;
		КонецЕсли;
	КонецЕсли;
	
	//#9168 - можно сбрасывать в пул или назначать из пула 
	//Если ПараметрыМонтажа.ИндексСтроки <> 0 И ПараметрыМонтажа.МонтажСсылка.ГрафикМонтажей.Количество() > 1 Тогда
	//	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПулМонтажей") Тогда
			// реализован перенос
			//Если НЕ ПараметрыМонтажа.Бригада = ПараметрыМонтажа.МонтажСсылка.Бригада Тогда
			//	ОписаниеОшибок.Добавить("Для монтажей на несколько дней нельзя менять бригаду!");
			//	СтруктураПроверки.Результат = Ложь;
			//КонецЕсли;
	//	Иначе
			//Если (ТипЗнч(ПараметрыМонтажа.Бригада) = Тип("Строка") И ТипЗнч(ПараметрыМонтажа.МонтажСсылка.Бригада) = Тип("СправочникСсылка.Бригады"))
			//Если (ТипЗнч(ПараметрыМонтажа.Бригада) = Тип("СправочникСсылка.Бригады") И НЕ ПараметрыМонтажа.Бригада = ПараметрыМонтажа.МонтажСсылка.Бригада)
			//	ИЛИ (ТипЗнч(ПараметрыМонтажа.Бригада) = Тип("СправочникСсылка.Бригады") И ПараметрыМонтажа.МонтажСсылка.Бригада = Справочники.Бригады.ПустаяСсылка())
			//	ИЛИ (ТипЗнч(ПараметрыМонтажа.Бригада) = Тип("Строка") И ТипЗнч(ПараметрыМонтажа.МонтажСсылка.Бригада) = Тип("СправочникСсылка.Бригады"))
				//Тогда
				// движение по пулу
				//СтруктураПроверки.Результат = Ложь;
			//КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат СтруктураПроверки;
	
КонецФункции
				
&НаСервереБезКонтекста
Функция ЕстьИзмененияВМонтаже(ПараметрыМонтажа)
	
	Результат = Истина;
	
	Если ПараметрыМонтажа.ИндексСтроки = 0 Тогда
		// монтаж на 1 день
		ДанныеМонтажа = ПараметрыМонтажа.МонтажСсылка;
		Если (ДанныеМонтажа.ДатаМонтажа + (ДанныеМонтажа.ВремяНачала - Дата(1, 1, 1))) = ПараметрыМонтажа.Начало
			И (ДанныеМонтажа.ДатаМонтажа + (ДанныеМонтажа.ВремяОкончания - Дата(1, 1, 1))) = ПараметрыМонтажа.Конец
			И ПараметрыМонтажа.МонтажСсылка.Бригада = ПараметрыМонтажа.Бригада Тогда
			Результат = Ложь;
		КонецЕсли;
	Иначе
		// монтаж на несколько дней
		Если ПараметрыМонтажа.МонтажСсылка.ГрафикМонтажей.Количество() >= ПараметрыМонтажа.ИндексСтроки Тогда
			ДанныеМонтажа = ПараметрыМонтажа.МонтажСсылка.ГрафикМонтажей[ПараметрыМонтажа.ИндексСтроки-1];
			Если (ДанныеМонтажа.ДатаМонтажа + (ДанныеМонтажа.ВремяНачала - Дата(1, 1, 1))) = ПараметрыМонтажа.Начало
				И (ДанныеМонтажа.ДатаМонтажа + (ДанныеМонтажа.ВремяОкончания - Дата(1, 1, 1))) = ПараметрыМонтажа.Конец
				И ПараметрыМонтажа.МонтажСсылка.Бригада = ПараметрыМонтажа.Бригада Тогда
				Результат = Ложь;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти