#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();	
	НастройкиВыбор = НастройкиОтчета.Выбор.Элементы;
	
	ПолеПараметр = Новый ПараметрКомпоновкиДанных("Показатель");
	ПараметрПоказатель = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(ПолеПараметр);
	
	ПолеПараметр = Новый ПараметрКомпоновкиДанных("Периодичность");
	ПараметрПериодичность = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
		
	Если НЕ ПараметрПоказатель = Неопределено Тогда
		// общие Выбранные поля
		Для каждого СтрокаВыбора из НастройкиВыбор Цикл
			Если НЕ ТипЗнч(СтрокаВыбора) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаВыбора.Поле = Новый ПолеКомпоновкиДанных("Сумма")
				ИЛИ СтрокаВыбора.Поле = Новый ПолеКомпоновкиДанных("СуммаРазница")
				ИЛИ СтрокаВыбора.Поле = Новый ПолеКомпоновкиДанных("СуммаПрирост")
				Тогда
				СтрокаВыбора.Использование = (ПараметрПоказатель.Значение = 0);
				
			ИначеЕсли СтрокаВыбора.Поле = Новый ПолеКомпоновкиДанных("Количество") 
				ИЛИ СтрокаВыбора.Поле = Новый ПолеКомпоновкиДанных("КоличествоРазница")
				ИЛИ СтрокаВыбора.Поле = Новый ПолеКомпоновкиДанных("КоличествоПрирост")
				Тогда
				СтрокаВыбора.Использование = НЕ (ПараметрПоказатель.Значение = 0);
				
			КонецЕсли;				
		КонецЦикла;
		
		// для диаграммы
		Для каждого ЭлементСтруктуры Из НастройкиОтчета.Структура Цикл
			Если ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
				НастройкиВыборДиаграмма = ЭлементСтруктуры.Выбор.Элементы;
				Для каждого СтрокаВыбора из НастройкиВыбор Цикл
					Если НЕ ТипЗнч(СтрокаВыбора) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
						Продолжить;
					КонецЕсли;
					
					Если СтрокаВыбора.Поле = Новый ПолеКомпоновкиДанных("Сумма") Тогда
						СтрокаВыбора.Использование = (ПараметрПоказатель.Значение = 0);
						
					ИначеЕсли СтрокаВыбора.Поле = Новый ПолеКомпоновкиДанных("Количество") Тогда
						СтрокаВыбора.Использование = НЕ (ПараметрПоказатель.Значение = 0);
						
					КонецЕсли;				
				КонецЦикла;
				Прервать; // дальше таблица
			КонецЕсли;
		КонецЦикла;
	
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	КонецЕсли;
				
	Если ПараметрПериодичность = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ПараметрПериодичность.Использование Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ПараметрПериодичность.Значение) Тогда
		ПараметрПериодичность.Значение = Перечисления.Периодичность.Месяц;
	КонецЕсли;
	
	ИскомоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ДинамическийПериод");
	
	Если ИскомоеПоле = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДлительностьПериода = ОбщегоНазначения.ИмяЗначенияПеречисления(ПараметрПериодичность.Значение);
	ИскомоеПоле.Выражение = "Период" + СтрокаДлительностьПериода;
	ИскомоеПоле.Заголовок = СтрокаДлительностьПериода;
	
	ПараметрОформленияФормат = ИскомоеПоле.Оформление.Элементы.Найти("Формат");
	ПараметрОформленияФормат.Значение = МодульОтчетов.ФорматнаяСтрокаДинамическогоПериода(ПараметрПериодичность.Значение);
	ПараметрОформленияФормат.Использование = Истина;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
