
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ДокументРезерва = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДокументРезерва = Параметры.ДокументРезерва;
	ЭтоЗаказ = (ТипЗнч(ДокументРезерва) = Тип("ДокументСсылка.ЗаказДоговор"));
	
	Если ЭтоЗаказ Тогда
		//#13982
		СкладТоваров    = ПараметрыСеанса.Пользователь.СкладРозница;
		СкладМатериалов = ПараметрыСеанса.Пользователь.СкладМатериаловРозница;
		
	Иначе // монтаж
		Элементы.СкладТоваров.ТолькоПросмотр = Истина;
		Элементы.СкладМатериалов.ТолькоПросмотр = Истина;
		
		//++ №11431 склад подставляется теперь по настройке
		Если Константы.СкладРезервированияТоваровПоУмолчанию.Получить() = 0 Тогда // Склад розницы по умолчанию
			СкладТоваров = Константы.СкладПриходРасходПриПеремещенииИзМонтажаБригадам.Получить();
		Иначе
			//-- №11431
			СкладТоваров = ДокументРезерва.СкладТоваров; // Склад списания
		КонецЕсли;
		
		//++ №11431 склад подставляется теперь по настройке
		Если Константы.СкладРезервированияМатериаловПоУмолчанию.Получить() = 0 Тогда // Склад розницы по умолчанию
			СкладМатериалов = Константы.СкладПриходРасходПриПеремещенииИзМонтажаБригадам.Получить();
		Иначе
			//-- №11431
			СкладМатериалов = ДокументРезерва.Склад; // Склад списания
		КонецЕсли;
	КонецЕсли;
	
	СписокКЗаполнению = Документы.Резервирование.ПолучитьСписокТоваровКЗаполнению(ДокументРезерва);
	
	Для Каждого ТекущаяСтрока Из СписокКЗаполнению Цикл
		
		НоваяСтрока = СписокТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);		
		НоваяСтрока.КоличествоМаксимум = НоваяСтрока.Количество;
		
		Если НоваяСтрока.ВидТабличнойЧасти = Перечисления.ВидыТабличнойЧасти.Товары Тогда
			НоваяСтрока.СкладРезерва = СкладТоваров;
		Иначе
			НоваяСтрока.СкладРезерва = СкладМатериалов;
		КонецЕсли;
		
		НоваяСтрока.ЭтоПотолок = Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(НоваяСтрока.Номенклатура);
		
	КонецЦикла;
	
	ОбновитьИнформационнуюНадпись();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладТоваровПриИзменении(Элемент)
	
	Для каждого СтрокаТЧ из СписокТоваров Цикл
		Если СтрокаТЧ.ВидТабличнойЧасти = ПредопределенноеЗначение("Перечисление.ВидыТабличнойЧасти.Товары") Тогда
			СтрокаТЧ.СкладРезерва = СкладТоваров;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СкладМатериаловПриИзменении(Элемент)
	
	Для каждого СтрокаТЧ из СписокТоваров Цикл
		Если СтрокаТЧ.ВидТабличнойЧасти = ПредопределенноеЗначение("Перечисление.ВидыТабличнойЧасти.Материалы") Тогда
			СтрокаТЧ.СкладРезерва = СкладМатериалов;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокТоваров.ТекущиеДанные;
	
	Если ТекущиеДанные.Количество > ТекущиеДанные.КоличествоМаксимум Тогда
		ТекущиеДанные.Количество = ТекущиеДанные.КоличествоМаксимум;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьСтроки(Назначение = "Все", Отметка = Истина)
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		
		Если НЕ Назначение = "Все" И Назначение = "Товары" И НЕ ТекущаяСтрока.ВидТабличнойЧасти = ПредопределенноеЗначение("Перечисление.ВидыТабличнойЧасти.Товары") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Назначение = "Все" И Назначение = "Материалы" И НЕ ТекущаяСтрока.ВидТабличнойЧасти = ПредопределенноеЗначение("Перечисление.ВидыТабличнойЧасти.Материалы") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Назначение = "Все" И Назначение = "Потолки" И НЕ ТекущаяСтрока.ЭтоПотолок Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока.Отметка = Отметка;
		
	КонецЦикла;
	
	ОбновитьИнформационнуюНадпись();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ОтметитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСоВсех(Команда)
	
	ОтметитьСтроки(, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьТовары(Команда)
	
	ОтметитьСтроки("Товары");

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьМатериалы(Команда)
	
	ОтметитьСтроки("Материалы");
		
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьПотолки(Команда)
	
	ОтметитьСтроки("Потолки");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокТоваровНоменклатура" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыВыбора = Новый Структура("Ключ", Элемент.ТекущиеДанные.Номенклатура);
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ПараметрыВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформационнуюНадпись()
	
	ВыбранныеСклады = СписокТоваров.Выгрузить(, "СкладРезерва, Отметка");
	ВыбранныеСклады.Свернуть("СкладРезерва", "Отметка");
	
	Сч = 0;
	Для Каждого ТекущаяСтрока Из ВыбранныеСклады Цикл
		
		Если ТекущаяСтрока.Отметка > 0 Тогда
			Сч = Сч + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ДекорацияИнформация.Заголовок = "Количество документов к созданию: " + Сч;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровСкладРезерваПриИзменении(Элемент)
	
	ОбновитьИнформационнуюНадпись();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровОтметкаПриИзменении(Элемент)
	
	ОбновитьИнформационнуюНадпись();
	
КонецПроцедуры

&НаКлиенте
Процедура Зарезервировать(Команда)
	
	МассивСозданныхДокументов = новый Массив;
	
	ЗарезервироватьНаСервере(МассивСозданныхДокументов);
	
	Для Каждого СозданныйДокумент Из МассивСозданныхДокументов Цикл
		
		ОткрытьФорму("Документ.Резервирование.ФормаОбъекта", новый Структура("Ключ", СозданныйДокумент));
		
	КонецЦикла;
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗарезервироватьНаСервере(МассивСозданныхДокументов)
	
	ВыбранныеСклады = СписокТоваров.Выгрузить(, "СкладРезерва, Отметка");
	ВыбранныеСклады.Свернуть("СкладРезерва", "Отметка");
	
	// На каждый выбранный склад создаем отдельные документы резервирования
	Для Каждого ТекущаяСтрока Из ВыбранныеСклады Цикл
		
		Если ТекущаяСтрока.Отметка <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйДокумент = Документы.Резервирование.СоздатьДокумент();
		НовыйДокумент.Заполнить(Неопределено);
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		
		НовыйДокумент.Контрагент 		= ДокументРезерва.Контрагент;
		НовыйДокумент.Организация 		= ДокументРезерва.Организация;
		НовыйДокумент.Склад 	 		= ТекущаяСтрока.СкладРезерва;
		НовыйДокумент.ДокументРезерва 	= ДокументРезерва;
		
		СписокКЗаполнению = СписокТоваров.НайтиСтроки(новый Структура("СкладРезерва, Отметка", ТекущаяСтрока.СкладРезерва, Истина));
		
		Для Каждого ТекущаяСтрока Из СписокКЗаполнению Цикл
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);		
		КонецЦикла;
		
		Попытка
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			МассивСозданныхДокументов.Добавить(НовыйДокумент.Ссылка);
			
		Исключение
			Сообщить("Не удалось создать документ резервирования для склада: " + ТекущаяСтрока.СкладРезерва + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры


