#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#11866
	ОбщийМодульСервер.ПроверитьПересечениеИнтерваловВЦенахНаУслугиПроизводства(ЭтотОбъект, Метаданные.Справочники.ЦеныУслугРаскрояПоставщиков, Отказ);
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		НаборЗаписей = РегистрыСведений.СоответствиеВидовЦенПоставщиковЦенамУслугРаскроя.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВидЦеныПоставщика.Установить(ВидЦеныПоставщика);
		НаборЗаписей.Отбор.Период.Установить(Дата);
		НаборЗаписей.Записать(Истина);
	Иначе
		НоваяЗапись = РегистрыСведений.СоответствиеВидовЦенПоставщиковЦенамУслугРаскроя.СоздатьМенеджерЗаписи();
		
		НоваяЗапись.Период 						= Дата;
		НоваяЗапись.ВидЦеныПоставщика 			= ВидЦеныПоставщика;
		НоваяЗапись.ЦеныУслугРаскрояПоставщика 	= Ссылка;
		
		НоваяЗапись.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
