
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		// #14948 настройки объединены
		//Если НЕ Константы.РазрешитьРучноеСозданиеФактурИЦветовФактур.Получить() Тогда
		Если НЕ Константы.РазрешитьРедактированиеФактурИЦветовФактур.Получить() Тогда
			Сообщить("В настройках программы запрещено ручное создание фактуры и цвета");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	Иначе
		ЭтаФорма.ТолькоПросмотр = НЕ Константы.РазрешитьРедактированиеФактурИЦветовФактур.Получить();
	КонецЕсли;
	
	ЦеныМатериалов.Параметры.УстановитьЗначениеПараметра("ЦветФактуры", Объект.Ссылка);
	
	Элементы.ГруппаМобильныйПостроитель.Видимость = Константы.ИспользоватьОбменСПорталом.Получить();
	
КонецПроцедуры
