
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОчисткаДаты") Тогда
		Элементы.ДатаСледующегоКонтакта.Доступность = Ложь;
		Элементы.ВремяСледующегоКонтакта.Доступность = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Комментарий") Тогда
		Комментарий = Параметры.Комментарий;	
	КонецЕсли;
	
	//#16861
	Если Элементы.ВремяСледующегоКонтакта.Доступность Тогда	    	
		Элементы.ВремяСледующегоКонтакта.СписокВыбора.Очистить();
		СписокИнтервалов = ОбщийМодульСервер.ПолучитьИнтервалыВремениСледующегоКонтакта();
		Элементы.ВремяСледующегоКонтакта.КнопкаВыпадающегоСписка = СписокИнтервалов.Количество() > 0;
		Для каждого КлючПредставление из СписокИнтервалов Цикл
			Элементы.ВремяСледующегоКонтакта.СписокВыбора.Добавить(КлючПредставление.Значение, КлючПредставление.Представление);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("Комментарий, ДатаСледующегоКонтакта", Комментарий, ОбщийМодульКлиентСервер.СоединитьДатуИВремя(ДатаСледующегоКонтакта, ВремяСледующегоКонтакта)));
	
КонецПроцедуры


