#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачальныйСтатусЗП = Справочники.СтатусыЗаказовПокупателей.НачальныйСтатус();
	//#13253
	СписокСтатусовЗаказовПокупателей = Справочники.СтатусыЗаказовПокупателей.СписокСтатусов();

	//#13387
	НастройкиПользователяИнициированы = Ложь;
	ВосстановитьНастройкиФормы(НастройкиПользователяИнициированы);	
	
	Если НЕ НастройкиПользователяИнициированы Тогда
		ЗаказПокупателяОтборПоСтатусу.Добавить(НачальныйСтатусЗП);
	КонецЕсли;	
	
	Для каждого ЭлементСписка из ЗаказПокупателяОтборПоСтатусу Цикл		
		НачЭлементСписка = СписокСтатусовЗаказовПокупателей.НайтиПоЗначению(ЭлементСписка.Значение);
		Если НЕ НачЭлементСписка = Неопределено Тогда
			НачЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
			
	////УстановитьОтбор(ЭтаФорма, "Список", "ТекущийСтатус",  ОтборПоСтатусу, Истина, "ТекущийСтатус");
	//ОбщийМодуль.УстановитьОтборДинамическогоСписка(ЭтаФорма, "Список", "ТекущийСтатус", ФильтрСтатус);
	
	//Список.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДатаСеанса());
	//Список.Параметры.УстановитьЗначениеПараметра("ТекущийСтатус", Справочники.СтатусыЗаявокНаДоставку.Заявка); // №10663 заменено на справочник, было: Перечисления.СтатусыДоставкиТовара.Заявка);
	
	//#13035
	ВедутсяРасчетыПоДокументу = Константы.ВестиРасчетыПоЗаказамПоЗаказуПокупателя.Получить();
	Элементы.СостояниеОплаты.Видимость = ВедутсяРасчетыПоДокументу;
	Элементы.Оплачено.Видимость = ВедутсяРасчетыПоДокументу;
	Элементы.КОплате.Видимость = ВедутсяРасчетыПоДокументу;
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаСписка(ЭтотОбъект, Элементы.Список);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ИспользоватьПодключаемоеОборудование = Константы.ИспользоватьПодключаемоеОборудование.Получить();
	
	//Элементы.СМСОтправлено.Видимость = Константы.АвтоматическаяРассылкаСМС.Получить();#12778 убрано
	//Элементы.ФормаОтправитьСМС.Видимость = Элементы.СМСОтправлено.Видимость;
	
	//Элементы.ПотолкиВНаличии.Видимость = Константы.СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции.Получить(); #12778 убрано

	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.СписокКоманднаяПанель);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	//УстановитьФильтрыСписка(Неопределено); // №11277
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	//#13387
	СохранитьНастройкиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
		
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияПотолкиКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияПотолкиКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаСписка(ИмяСобытия, ЭтотОбъект, Элементы.Список);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	Если ИмяСобытия = "ОбновитьАРМПроизводства" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.СписокВыбор(Поле.Имя, ЭтотОбъект, Элементы.Список, СтандартнаяОбработка);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

КонецПроцедуры


&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриПолученииДанныхНаСервере(Строки); 
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	МассивСсылок = Строки.ПолучитьКлючи();
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КэшКолонок = Новый Структура;
	СтрокаДС = Строки.Получить(МассивСсылок[0]);
	КэшКолонок.Вставить("ЕстьКолонкаОплачено", 	СтрокаДС.Данные.Свойство("Оплачено"));
	КэшКолонок.Вставить("ЕстьКолонкаКОплате",  	СтрокаДС.Данные.Свойство("КОплате"));
	КэшКолонок.Вставить("ЕстьКолонкаСостояниеОплаты",  	СтрокаДС.Данные.Свойство("СостояниеОплаты"));
	КэшКолонок.Вставить("ЕстьКолонкиОплат",    	КэшКолонок.ЕстьКолонкаОплачено ИЛИ КэшКолонок.ЕстьКолонкаКОплате ИЛИ КэшКолонок.ЕстьКолонкаСостояниеОплаты);	
	КэшКолонок.Вставить("ЕстьКолонкаДолг",  	СтрокаДС.Данные.Свойство("ДолгКонтрагента"));
	КэшКолонок.Вставить("ЕстьКолонкаОтгружен",  СтрокаДС.Данные.Свойство("Отгружен"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТекущийСтатусДоставки", Справочники.СтатусыЗаявокНаДоставку.Заявка); // №10663 заменено на справочник, было: Перечисления.СтатусыДоставкиТовара.Заявка);
	МассивНеобходимыхЗапросов = Новый Массив;
	Если КэшКолонок.ЕстьКолонкиОплат Тогда
		МассивНеобходимыхЗапросов.Добавить(0); // оплаты
	КонецЕсли;
	Если КэшКолонок.ЕстьКолонкаДолг Тогда
		МассивНеобходимыхЗапросов.Добавить(1); // долг контрагента
	КонецЕсли;
	
	Если КэшКолонок.ЕстьКолонкаОтгружен Тогда
		МассивНеобходимыхЗапросов.Добавить(3); // состояние отгрузки
	КонецЕсли;
	
	Если МассивНеобходимыхЗапросов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос.Текст = Документы.ЗаказПокупателя.ПолучитьТекстЗапросаСписка(МассивНеобходимыхЗапросов);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	УказательЗапроса = 1;

	//#12778 убраны индикаторы
	//ВыборкаОтгружено 			= РезультатЗапроса[0].Выбрать();	
	////ВыборкаПроизведен 		= РезультатЗапроса[1].Выбрать();
	//ВыборкаСМСОтправлено 		= РезультатЗапроса[2].Выбрать();	
	//ВыборкаПотолкиВНаличии 		= РезультатЗапроса[4].Выбрать();
	//ВыборкаСтатусПроизводства 	= РезультатЗапроса[7].Выбрать();
	
	Если КэшКолонок.ЕстьКолонкиОплат Тогда
		ВыборкаОплачено = РезультатЗапроса[УказательЗапроса].Выбрать();
		Пока ВыборкаОплачено.Следующий() Цикл
			СтрокаСписка = Строки[ВыборкаОплачено.Ссылка];
			Если КэшКолонок.ЕстьКолонкаОплачено Тогда
				СтрокаСписка.Данные["Оплачено"] = ВыборкаОплачено.Оплачено;
			КонецЕсли;
			Если КэшКолонок.ЕстьКолонкаКОплате Тогда
				СтрокаСписка.Данные["КОплате"] = ВыборкаОплачено.КОплате;
			КонецЕсли;
			Если КэшКолонок.ЕстьКолонкаСостояниеОплаты Тогда
				СтрокаСписка.Данные["СостояниеОплаты"] = ВыборкаОплачено.СостояниеОплаты;
			КонецЕсли;
		КонецЦикла;
		
		УказательЗапроса = УказательЗапроса + 1;
	КонецЕсли;
	
	Если КэшКолонок.ЕстьКолонкаДолг Тогда
		УказательЗапроса = УказательЗапроса + 1; // в запросе есть вспомогательный запрос
		ВыборкаДолг = РезультатЗапроса[УказательЗапроса].Выбрать();
		Пока ВыборкаДолг.Следующий() Цикл
			СтрокаСписка = Строки[ВыборкаДолг.Ссылка];
			СтрокаСписка.Данные["ДолгКонтрагента"] = ВыборкаДолг.ДолгКонтрагента;
		КонецЦикла;
		
		УказательЗапроса = УказательЗапроса + 1;
	КонецЕсли;
	
	Если КэшКолонок.ЕстьКолонкаОтгружен Тогда
		ВыборкаОтгружено = РезультатЗапроса[УказательЗапроса].Выбрать();
		Пока ВыборкаОтгружено.Следующий() Цикл
			СтрокаСписка = Строки[ВыборкаОтгружено.Ссылка];
			СтрокаСписка.Данные["Отгружен"] = ВыборкаОтгружено.Отгружен;
		КонецЦикла;
		
		УказательЗапроса = УказательЗапроса + 1;
	КонецЕсли;
	
	//#12778 убраны индикаторы
	//Пока ВыборкаСтатусПроизводства.Следующий() Цикл
	//	СтрокаСписка = Строки[ВыборкаСтатусПроизводства.Ссылка];
	//	Если СтрокаСписка.Данные.Свойство("СтатусПроизводства") Тогда
	//		СтрокаСписка.Данные["СтатусПроизводства"] = ВыборкаСтатусПроизводства.СтатусПроизводства;
	//	Иначе
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Пока ВыборкаСМСОтправлено.Следующий() Цикл
	//	СтрокаСписка = Строки[ВыборкаСМСОтправлено.Ссылка];
	//	Если СтрокаСписка.Данные.Свойство("СМСОтправлено") Тогда
	//		СтрокаСписка.Данные["СМСОтправлено"] = ВыборкаСМСОтправлено.СМСОтправлено;
	//	Иначе
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Пока ВыборкаПотолкиВНаличии.Следующий() Цикл
	//	СтрокаСписка = Строки[ВыборкаПотолкиВНаличии.Ссылка];
	//	Если СтрокаСписка.Данные.Свойство("ПотолкиВНаличии") Тогда
	//		СтрокаСписка.Данные["ПотолкиВНаличии"] = ВыборкаПотолкиВНаличии.ПотолкиВНаличии;
	//		//Иначе
	//		//	Прервать;
	//	КонецЕсли;
	//	Если СтрокаСписка.Данные.Свойство("ЗаказанВПроизводство") Тогда
	//		СтрокаСписка.Данные["ЗаказанВПроизводство"] = ВыборкаПотолкиВНаличии.ЗаказанВПроизводство;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)

	ТекШтрихкод = "";

	ОбработкаЗавершения = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект,
		Новый Структура("ТекШтрихкод", ТекШтрихкод));

	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));

КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, Параметры) Экспорт

	Если Результат = Неопределено Тогда
		ТекШтрихкод = СокрЛП(Параметры.ТекШтрихкод);
	Иначе
		ТекШтрихкод = СокрЛП(Результат);
	КонецЕсли;
		
	Если ПустаяСтрока(ТекШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("Штрихкод", ТекШтрихкод);
	Данные.Вставить("Количество", 1);
	
	ОбработатьШтрихкоды(Данные);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	Если ЗначениеЗаполнено(МассивСсылок) Тогда
		Если МассивСсылок.Количество() = 1 Тогда
			ВыборДокументаИзСпискаЗавершение(МассивСсылок[0], Неопределено);
		Иначе
			ПараметрыФормы = Новый Структура("МассивСсылок", МассивСсылок);
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборДокументаИзСпискаЗавершение", ЭтотОбъект);
			ОткрытьФорму("ОбщаяФорма.ФормаСпискаДокументовПоСсылкам", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
		КонецЕсли;
	Иначе
		ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	
	Менеджеры = Новый Массив;
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка"));
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	
КонецФункции

&НаКлиенте
Процедура ВыборДокументаИзСпискаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;		                          	
	КонецЕсли;
	
	Элементы.Список.ТекущаяСтрока = Результат;
	ПоказатьЗначение(Неопределено, Результат);
		
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
&НаКлиенте
Процедура Подключаемый_ОбновитьКомандыСостоянияОригинала()
    
    ОбновитьКомандыСостоянияОригинала()
   
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомандыСостоянияОригинала()
    
	// Код из обработчика события ПриСозданииНаСервере этой формы по подключению команд
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры
//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

#КонецОбласти

&НаСервере
Процедура СохранитьНастройкиФормы()

	ПользовательскийОтбор = Новый ОтборКомпоновкиДанных();
	ОбщийМодульСервер.НовыйОтбор(ПользовательскийОтбор, "Подразделение", 	ФильтрПодразделение);
	ОбщийМодульСервер.НовыйОтбор(ПользовательскийОтбор, "ИсточникЗаказа", 	ФильтрИсточникЗаказа);
	ОбщийМодульСервер.НовыйОтбор(ПользовательскийОтбор, "ТекущийСтатус", 	ЗаказПокупателяОтборПоСтатусу);
	ОбщийМодульСервер.НовыйОтбор(ПользовательскийОтбор, "Контрагент", 		ФильтрКонтрагент);
	ОбщийМодульСервер.НовыйОтбор(ПользовательскийОтбор, "НомераПотолков", 	ФильтрНомерПотолка);
	
	СтруктураНастроек = Новый Структура;	
	СтруктураНастроек.Вставить("НастройкиОтбора", Новый ХранилищеЗначения(ПользовательскийОтбор));
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("СписокЗаказовПокупателей", "НастройкиФормыСписка", СтруктураНастроек);
	
КонецПроцедуры 

&НаСервере
Процедура ВосстановитьНастройкиФормы(НастройкиПользователяИнициированы)

	СтруктураНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("СписокЗаказовПокупателей", "НастройкиФормыСписка");
	Если НЕ ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		Возврат;	
	КонецЕсли;
	
	ПользовательскийОтбор = СтруктураНастроек.НастройкиОтбора.Получить();
	НастройкиПользователяИнициированы = Истина;
	Для каждого НастройкаОтбора из ПользовательскийОтбор.Элементы Цикл
		Если НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") Тогда
			ФильтрПодразделение = НастройкаОтбора.ПравоеЗначение;
			
		ИначеЕсли НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИсточникЗаказа") Тогда
			ФильтрИсточникЗаказа = НастройкаОтбора.ПравоеЗначение;			
			
		ИначеЕсли НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент") Тогда
			ФильтрКонтрагент = НастройкаОтбора.ПравоеЗначение;
			
		ИначеЕсли НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НомераПотолков") Тогда
			ФильтрНомерПотолка = НастройкаОтбора.ПравоеЗначение;
			
		ИначеЕсли НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТекущийСтатус") Тогда
			Для каждого ЭлементСписка из НастройкаОтбора.ПравоеЗначение Цикл
				Если НЕ СписокСтатусовЗаказовПокупателей.НайтиПоЗначению(ЭлементСписка.Значение) = Неопределено Тогда
					ЗаказПокупателяОтборПоСтатусу.Добавить(ЭлементСписка.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьНаОснованииПриходныйКассовыйОрдер(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда	
		Основание = Элементы.Список.ТекущиеДанные.Ссылка;	
		СписокОснований = Новый СписокЗначений;
		Для НомерСтроки = 0 По Элементы.Список.ВыделенныеСтроки.Количество()-1 Цикл
			СсылкаЗаказ = Элементы.Список.ВыделенныеСтроки.Получить(НомерСтроки);
			Если Основание <> СсылкаЗаказ Тогда
				СписокОснований.Добавить(Элементы.Список.ВыделенныеСтроки.Получить(НомерСтроки));		
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыНовойФормы = Новый Структура;
		ПараметрыНовойФормы.Вставить("Основание", Основание);
		Если СписокОснований.Количество() > 0 Тогда
			ПараметрыНовойФормы.Вставить("СписокОснований", СписокОснований);
		КонецЕсли;
		ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.ФормаОбъекта", ПараметрыНовойФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	Если ОбщийМодульВызовСервера.ЕстьТелефонКонтрагента(Элементы.Список.ТекущиеДанные.Ссылка) Тогда	
		Парам = Новый Структура;
		Парам.Вставить("Основание", Элементы.Список.ТекущиеДанные.Ссылка);
		ОткрытьФорму("Документ.ОтправкаСМС.Форма.ФормаДокумента",Парам);		
	Иначе
		ПоказатьОповещениеПользователя("У контрагента в карточке не указан номер телефона. СМС не создана");
	КонецЕсли;
КонецПроцедуры

//++ №11277
&НаКлиенте
Процедура УстановитьФильтрыСписка(Элемент)
	
	// Подразделение
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список
		, "Подразделение"
		, ФильтрПодразделение
		, ВидСравненияКомпоновкиДанных.Равно
		,
		, ЗначениеЗаполнено(ФильтрПодразделение)
	);
	
	// Источник
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список
		, "ИсточникЗаказа"
		, ФильтрИсточникЗаказа
		, ВидСравненияКомпоновкиДанных.Равно
		,
		, ЗначениеЗаполнено(ФильтрИсточникЗаказа)
	);
	
	// Статус
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	//	Список
	//	, "ТекущийСтатус"
	//	, ФильтрСтатус
	//	, ВидСравненияКомпоновкиДанных.Равно
	//	,
	//	, ЗначениеЗаполнено(ФильтрСтатус)
	//);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"ТекущийСтатус", ЗаказПокупателяОтборПоСтатусу, ВидСравненияКомпоновкиДанных.ВСписке,, ЗаказПокупателяОтборПоСтатусу.Количество() > 0);
	
	// Контрагент
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список
		, "Контрагент"
		, ФильтрКонтрагент
		, ВидСравненияКомпоновкиДанных.Равно
		,
		, ЗначениеЗаполнено(ФильтрКонтрагент)
	);
	
	// Номер потолка
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список
		, "НомераПотолков"
		, ФильтрНомерПотолка
		, ВидСравненияКомпоновкиДанных.Содержит
		,
		, ЗначениеЗаполнено(ФильтрНомерПотолка)
	);
	
КонецПроцедуры

//-- №11277

&НаКлиенте
Процедура ЗаказПокупателяОтборПоСтатусуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//#13253
	СтандартнаяОбработка = Ложь;
	Обработчик = Новый ОписаниеОповещения("ЗаказПокупателяОтборПоСтатусуЗавершениеВыбора", ЭтотОбъект);
	ЗаголовокДиалога = НСтр("ru = 'Выберите статусы к отбору'");
	СписокСтатусовЗаказовПокупателей.ПоказатьОтметкуЭлементов(Обработчик, ЗаголовокДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПокупателяОтборПоСтатусуЗавершениеВыбора(ПредставлениеСтатуса, Переменные) Экспорт

	Если ПредставлениеСтатуса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказПокупателяОтборПоСтатусу.Очистить();
	Для каждого КлючЗначение из ПредставлениеСтатуса Цикл
		Если КлючЗначение.Пометка Тогда
			ЗаказПокупателяОтборПоСтатусу.Добавить(КлючЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьФильтрыСписка(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПокупателяОтборПоСтатусуОчистка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ЗаказПокупателяОтборПоСтатусу.Очистить();
	УстановитьФильтрыСписка(Неопределено);
	Для каждого КлючЗначение из СписокСтатусовЗаказовПокупателей Цикл
		КлючЗначение.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры



