Процедура ДобавитьЗаписьВИсториюЛида(Лид, Дата, Пользователь, ИДЗаписи, Комментарий, ТекстПисьмаТекст="", ТекстПисьмаHTML="") Экспорт
	
	НаборЗаписей = РегистрыСведений.ИсторияЛида.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Лид.Установить(Лид); 
	НаборЗаписей.Отбор.Дата.Установить(Дата); 
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь); 
	НаборЗаписей.Отбор.ИДЗаписи.Установить(ИДЗаписи); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Лид = Лид; 
	НоваяЗапись.Дата = Дата;
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.ИДЗаписи = ИДЗаписи;
	
	НоваяЗапись.Комментарий = Комментарий;
	НоваяЗапись.ТекстПисьмаТекст = ТекстПисьмаТекст;
	НоваяЗапись.ТекстПисьмаHTML = ТекстПисьмаHTML;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры