&НаСервере
Процедура Заполнить_ТабКэшДанных()
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Т.Ссылка КАК Точка,
    |   Т.Тип,
    |   Т.Имя,
    |   Т.Ответственный,
    |   Т.ВариантДлительности,
    |   Т.ДлительностьВыполнения,
    |   Т.Описание,
    |   Т.Ответственный КАК Пояснение
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута КАК Т
    |ГДЕ
    |   Т.Владелец = &Владелец";
    Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
    ТЗ = Запрос.Выполнить().Выгрузить();
    ТабКэшДанных.Загрузить(ТЗ);    
КонецПроцедуры

&НаСервере
Процедура СформироватьКоличествоБП()
    Колво = 0;
	Если НЕ Объект.Ссылка.Пустая() Тогда
    	М = Справочники.ИА_БПКартыМаршрутов.ПолучитьСписокБППоКартеМаршрута(Объект.Ссылка, "Стартован И НЕ Завершен");
        Колво = М.Количество();
    КонецЕсли;
    
    Если Колво = 0 Тогда
    	Элементы.НадписьБП.Заголовок = "Выполняемых процессов нет";
    Иначе
        Элементы.НадписьБП.Заголовок = "Выполняемых процессов: " + Колво;
    КонецЕсли; 
    
КонецПроцедуры
 

//_____________________________________________________________

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Элементы.ПолеГрафСхема.ТолькоПросмотр = НЕ РежимРедактирования;
    Элементы.ГруппаНастройкиБлока.Видимость = НЕ РежимРедактирования;
    
    ////ГрафСхема.РежимОтрисовкиСетки = ?(РежимРедактирования
    ////, РежимОтрисовкиСеткиГрафическойСхемы.ШахматнаяСетка
    ////, РежимОтрисовкиСеткиГрафическойСхемы.Точки
    ////);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвязанныеРеквизиты(ИмяЭлемента)
    Если РежимРедактирования Тогда
    	Возврат;
    КонецЕсли;
    АктивныйЭлемент = ИмяЭлемента;
    Ответственный = Неопределено;
	Подсказка = "";
    
    Эл = ГрафСхема.ЭлементыГрафическойСхемы.Найти(АктивныйЭлемент);
    Если Эл = Неопределено
        ИЛИ НЕ ЗначениеЗаполнено(ИмяЭлемента)
        Тогда
    	Возврат;
    КонецЕсли; 
    
    М = ТабКэшДанных.НайтиСтроки(Новый Структура("Имя", ИмяЭлемента));
    Если М.Количество() = 0 Тогда
    	Заполнить_ТабКэшДанных();
        М = ТабКэшДанных.НайтиСтроки(Новый Структура("Имя", ИмяЭлемента));
    КонецЕсли; 
    
    Если М.Количество() > 0 Тогда
    	СтрокаК = М[0];
        ТочкаМаршрута = СтрокаК.Точка;
    //    Ответственный = СтрокаК.Ответственный;        
    //	Подсказка = СтрокаК.Описание;
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТочку(ИмяТочки)
    Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
    	ЭтаФорма.Записать();
    КонецЕсли; 
    
    Если НЕ Объект.Ссылка.Пустая() Тогда
        Точка = ПолучитьТочкуНаСервере(ИмяТочки);
        П = Новый Структура("ТолькоПросмотр, Ключ", ЭтаФорма.ТолькоПросмотр, Точка);
        ОткрытьФорму("Справочник.ИА_БПТочкиМаршрута.ФормаОбъекта", П);
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьТочкуНаСервере(ИмяТочки)
    Точка = Справочники.ИА_БПКартыМаршрутов.ПолучитьТочку(Объект.Ссылка, ИмяТочки);
    Возврат Точка;    
КонецФункции
 
&НаСервере
Процедура ЗаполнитьГрафСхему()
    Для каждого Эл Из ГрафСхема.ЭлементыГрафическойСхемы Цикл
        Если ИА_БФКС.РеквизитЕсть(Эл, "Пояснение") Тогда
            М = ТабКэшДанных.НайтиСтроки(Новый Структура("Имя", Эл.Имя) );
            Если М.Количество() > 0 Тогда
                Эл.Пояснение = М[0].Пояснение;
            КонецЕсли; 
        КонецЕсли; 
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеГрафСхемыНачать()
    ГрафСхемаКопия = ГрафСхема;
    ГрафСхема = Неопределено;
    ПодключитьОбработчикОжидания("ОбновлениеГрафСхемыЗакончить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеГрафСхемыЗакончить()
    ГрафСхема = ГрафСхемаКопия;
КонецПроцедуры

//_____________________________________________________________


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если НЕ ИА_Защита_Общий.ЛицензияДоступна("НФ", Отказ) Тогда Возврат КонецЕсли; 
    
    Если Параметры.Свойство("ЗначениеКопирования") Тогда
    	ОбъектКопирования = Параметры.ЗначениеКопирования;
    КонецЕсли;
    
    Если Параметры.Свойство("ТолькоПросмотр")
        И ТипЗнч(Параметры.ТолькоПросмотр) = Тип("Булево") Тогда
    	Элементы.РежимРедактирования.ТолькоПросмотр = Параметры.ТолькоПросмотр;
    КонецЕсли; 
    
    Заполнить_ТабКэшДанных();
    ЗаполнитьГрафСхемуИзМД();
    СформироватьКоличествоБП();
    
    Контекст = Новый Структура("Параметры, Объект, Форма", Параметры, Объект, ЭтаФорма);
    ИА_БПСПереопределяемый.Формы_Карта_Маршрут_ПриСозданииНаСервере(Контекст);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафСхемуИзМД()
    Об = РеквизитФормыВЗначение("Объект");
    Карта = Об.Карта.Получить();
    Если Карта <> Неопределено Тогда
        ГрафСхема = Карта;	
    ИначеЕсли ЗначениеЗаполнено(ОбъектКопирования) Тогда
        СтараяКарта = ОбъектКопирования.ПолучитьОбъект().Карта.Получить();
        Если СтараяКарта = Неопределено Тогда
            ГрафСхема = Новый ГрафическаяСхема;
        Иначе
            ГрафСхема = СтараяКарта;
        КонецЕсли; 
    Иначе
        ГрафСхема = Новый ГрафическаяСхема;
    КонецЕсли;
    
    ЗаполнитьГрафСхему();
КонецПроцедуры
 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    ТекущийОбъект.Карта = Новый ХранилищеЗначения(ГрафСхема);
    Если ЗначениеЗаполнено(ОбъектКопирования) Тогда
        ТекущийОбъект.ДополнительныеСвойства.Вставить("ИА_ОбъектКопирования", ОбъектКопирования);
        ОбъектКопирования = Неопределено;
    КонецЕсли;        
КонецПроцедуры


&НаКлиенте
Процедура ГрафСхемаВыбор(Элемент)
    Если НЕ РежимРедактирования
        И Элемент.ТекущийЭлемент <> Неопределено
        Тогда
    	ОткрытьТочку(Элемент.ТекущийЭлемент.Имя);
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ГрафСхемаПриАктивизации(Элемент)
    Если РежимРедактирования Тогда
    	Возврат;
    КонецЕсли; 
    Эл = Элемент.ТекущийЭлемент;
    Если Эл <> Неопределено Тогда
        Имя = Эл.Имя;
    Иначе
        Имя = "";
    КонецЕсли; 
    ЗаполнитьСвязанныеРеквизиты(Имя);
КонецПроцедуры

&НаКлиенте
Процедура РежимРедактированияПриИзменении(Элемент)
    Модифицированность = Истина;    
    УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    СформироватьКоличествоБП();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ИмяСобытия = "ОбновитьКарты" И Объект.Ссылка = Параметр Тогда
        Заполнить_ТабКэшДанных();
        ЗаполнитьГрафСхемуИзМД();
        ГрафСхемаПриАктивизации(Элементы.ПолеГрафСхема);
        
        ОбновлениеГрафСхемыНачать();
    КонецЕсли; 
КонецПроцедуры


 

&НаСервере
Функция ПолучитьВсеТочкиНаСервере()
	Запрос = Новый Запрос(
    "ВЫБРАТЬ
    |	ИА_БПТочкиМаршрута.Ссылка
    |ИЗ
    |	Справочник.ИА_БПТочкиМаршрута КАК ИА_БПТочкиМаршрута
    |ГДЕ
    |	ИА_БПТочкиМаршрута.Владелец = &Владелец");
    Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
    Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    Возврат Результат;
КонецФункции
 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    МассивТочек = ПолучитьВсеТочкиНаСервере();
    Для каждого Точка Из МассивТочек Цикл
    	ОповеститьОбИзменении(Точка);
    КонецЦикла; 
    Оповестить("ОбновитьКарты", Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеДанные(Команда)
    Элементы.ГруппаМаршрут.ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
    Если НЕ Объект.Ссылка.Пустая() Тогда
        Отбор = Новый Структура("ИА_КартаМаршрутаБП, Стартован, Завершен"
        , Объект.Ссылка, Истина, Ложь);
        
        П = Новый Структура("Отбор", Отбор);
        ОткрытьФорму("БизнесПроцесс.ИА_БПНоситель.ФормаСписка", П,,ЭтаФорма.УникальныйИдентификатор);
    КонецЕсли; 
КонецПроцедуры

