Функция ПолучитьЦветИФактуруНоменклатуры(ВыбраннаяНоменклатура) Экспорт
	
	СтруктураРезультата = Новый Структура(
							"Результат, ЦветФактуры, Фактура",
	                        Ложь,
							Справочники.ЦветФактуры.ПустаяСсылка(),
	                        Справочники.Фактура.ПустаяСсылка());
							
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЦветФактуры.Ссылка,
		|	ЦветФактуры.Владелец
		|ИЗ
		|	Справочник.ЦветФактуры КАК ЦветФактуры
		|ГДЕ
		|	ЦветФактуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", ВыбраннаяНоменклатура);	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураРезультата.Результат 	= Истина;
		СтруктураРезультата.ЦветФактуры = Выборка.Ссылка;
		СтруктураРезультата.Фактура 	= Выборка.Владелец;
	КонецЕсли;
	
	Возврат СтруктураРезультата;

КонецФункции
