
&НаСервере
Процедура ЗагрузуитьОбразецПодписиНаСервере(ДанныеФайла) 
	
	//Объект = РеквизитФормыВЗначение("Запись");
	//Объект.Подпись = Новый ХранилищеЗначения(ДанныеФайла);
	//ЗначениеВРеквизитФормы(Объект, "Запись");
	ОбразецПодписи = Новый Картинка(ДанныеФайла);
	СтрокаКартинка = ПоместитьВоВременноеХранилище(ОбразецПодписи);
	
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект = РеквизитФормыВЗначение("Запись");
	
	ДанныеКартинки = Объект.Подпись.Получить();
	Если ДанныеКартинки<>Неопределено Тогда
		ОбразецПодписи = Новый Картинка(ДанныеКартинки);
		СтрокаКартинка = ПоместитьВоВременноеХранилище(ОбразецПодписи);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбразецПодписиНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = ложь;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Текст = "ru = ""Изображения""; en = ""Images""";
	Фильтр = НСтр(Текст)+"(*.jpg)|*.jpg";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл с подписью";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Данные = Новый ДвоичныеДанные(ДиалогОткрытияФайла.ПолноеИмяФайла);
		ЗагрузуитьОбразецПодписиНаСервере(Данные);
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	
	
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ТекущийОбъект.Подпись = Новый ХранилищеЗначения(ОбразецПодписи.ПолучитьДвоичныеДанные());
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Подпись = Новый ХранилищеЗначения(ОбразецПодписи.ПолучитьДвоичныеДанные());
КонецПроцедуры


&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	СотрудникПриИзмененииНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	
	Если Метаданные.РегистрыСведений.Найти("ФИОФизЛиц")<>Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФИОФизЛицСрезПоследних.Фамилия,
			|	ФИОФизЛицСрезПоследних.Имя,
			|	ФИОФизЛицСрезПоследних.Отчество
			|ИЗ
			|	РегистрСведений.ФИОФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних";

		Запрос.УстановитьПараметр("ФизЛицо", Запись.Сотрудник);

		Результат = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Запись.ФИО = ВыборкаДетальныеЗаписи.Фамилия + " " + лев(ВыборкаДетальныеЗаписи.Имя,1)+". " + лев(ВыборкаДетальныеЗаписи.Отчество,1)+".";
		КонецЦикла;
	Иначе
		
		// не ФИО, занит разбираем наименование
		
		СписокФИО = Запись.Сотрудник.Наименование;
		// уборка двойных пробелов
		Пока Найти(СписокФИО, "  ")<>0 Цикл
			СписокФИО = СтрЗаменить(СписокФИО,"  ","");
		КонецЦикла;
		
		СписокФИО = СтрЗаменить(СокрЛП(СписокФИО)," ",Символы.ПС);
		Если СтрЧислоСтрок(СписокФИО) < 3 Тогда
			Возврат;
		КонецЕсли;
		
		Запись.ФИО = "";
		Для Н = 1 по СтрЧислоСтрок(СписокФИО) - 2 Цикл
			
			Запись.ФИО = Запись.ФИО + ?(Запись.ФИО="",""," ") + СтрПолучитьСтроку(СписокФИО, Н);
			
			
		КонецЦикла;
		
		Запись.ФИО = Запись.ФИО + " " + Лев(СтрПолучитьСтроку(СписокФИО, СтрЧислоСтрок(СписокФИО) - 1),1)+"."; // Имя
		Запись.ФИО = Запись.ФИО + " " + Лев(СтрПолучитьСтроку(СписокФИО, СтрЧислоСтрок(СписокФИО) - 0),1)+"."; // Отчество
		
	КонецЕсли;
		
КонецПроцедуры
