&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ДекорацияЕстьНезавершенныеЗамеры.Видимость = Параметры.ЕстьНезавершенныеЗамеры;
	//#8113
	ИнформацияОСтатусеЛида = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Статус лида: %1 -> %2", Параметры.ТекущийСтатус, Параметры.СтатусПерехода);
	
	// №9558
	ИнформацияОДатеСледующегоКонтакта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Дата следующего контакта: %1 -> %2", Параметры.ДатаСледующегоКонтакта, """Очистится""");
	Элементы.ИнформацияОДатеСледующегоКонтакта.Видимость = (НЕ ПустаяСтрока(Параметры.ДатаСледующегоКонтакта));
	
	//#15955 
	ПричинаОтказа = Справочники.ПричиныОтказа.ПричинаПоУмолчанию();
	ПроверятьКомментарий = Константы.КонтролироватьЗаполнениеКомментарияПриОтказеПоЛиду.Получить(); 
	Элементы.Комментарий.АвтоОтметкаНезаполненного = ПроверятьКомментарий;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Отказ=Ложь;
	Если ПричинаОтказа.Пустая() Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Не указана причина");
	КонецЕсли;
	//#15955
	Если ПроверятьКомментарий И ПустаяСтрока(Комментарий) Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Не указан комментарий");
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПараметрОтвета = Новый Структура;
		ПараметрОтвета.Вставить("ПричинаОтказа",ПричинаОтказа);
		ПараметрОтвета.Вставить("Комментарий",Комментарий);
		Закрыть(ПараметрОтвета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
