
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Год = Год(ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)	
	
	Элементы.МенеджерПродаж.Видимость 	= (ВыбранноеЗначение = "МенеджерПродаж");
	Элементы.Технолог.Видимость 		= (ВыбранноеЗначение = "Технолог");
	Элементы.ТочкаПродаж.Видимость 		= (ВыбранноеЗначение = "ТочкаПродаж");
		
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ВидОтчета = "" Тогда 
		ПоказатьПредупреждение(,"Необходимо заполнить поле ""Вид отчета"".");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ТекОбъект = ЭтаФорма.РеквизитФормыВЗначение("Отчет");
	
	ФильтрПоказатель = Неопределено;
	Если ВидОтчета = "МенеджерПродаж" Тогда
		ФильтрПоказатель = Отчет.МенеджерПродаж;
	ИначеЕсли ВидОтчета = "Технолог" Тогда
		ФильтрПоказатель = Отчет.Технолог;
	ИначеЕсли ВидОтчета = "ТочкаПродаж" Тогда
		ФильтрПоказатель = Отчет.ТочкаПродаж;
	КонецЕсли;
	
	Макет = ТекОбъект.ПолучитьМакет("Макет");
	ТабличныйДокумент = МодульОтчетов.СформироватьОтчетИсполнениеПланаПродаж(Макет, Отчет.Год, ФильтрПоказатель, ВидОтчета);
	
КонецПроцедуры



