#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Инвентаризация";
    КомандаПечати.Идентификатор = "Инвентаризация";
    КомандаПечати.Представление = НСтр("ru = 'Инвентаризация товаров'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 1;	

КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Инвентаризация") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "Инвентаризация",
        НСтр("ru = 'Инвентаризация товаров'"),
        СформироватьПечатнуюФормуИнвентаризации(МассивОбъектов, ОбъектыПечати),
        ,
        "Документ.Инвентаризация.ПФ_MXL_Инвентаризация");
    КонецЕсли;	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК НомерДокумента,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Организация) КАК ОрганизацияПредставление,
	|	ДанныеДокумента.Склад КАК Склад,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Склад) КАК ПодразделениеПредставление,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.Автор.Сотрудник КАК АвторСотрудник,
	|	ДанныеДокумента.Автор.Сотрудник.Должность КАК ДолжностьМОЛ,
	|	ДанныеДокумента.Автор.Сотрудник.Наименование КАК ФИОМОЛ,
	|	ДанныеДокумента.ПодписьМОЛ1.РасшифровкаПодписи КАК РасшифровкаПодписиМОЛ1,
	|	ДанныеДокумента.ПодписьМОЛ2.РасшифровкаПодписи КАК РасшифровкаПодписиМОЛ2,
	|	0 КАК СуммаВсего,
	|	0 КАК СуммаФактВсего
	|ИЗ
	|	Документ.Инвентаризация КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.КоличествоФакт КАК КоличествоФакт,
	|	ДанныеДокумента.КоличествоОтклонение КАК КоличествоОтклонение,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаФакт КАК СуммаФакт,
	|	ДанныеДокумента.Ячейка КАК Ячейка
	|ИЗ
	|	Документ.Инвентаризация.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаФакт)
	|ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиТовары = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиТовары);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам = Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		Если НЕ ВыборкаПоТоварам = Неопределено Тогда		
			СтруктураПоиска = Новый Структура("Ссылка", ТекущаяСтрока.Ссылка);
			ВыборкаПоТоварам.Сбросить();
			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда
				ТекущаяСтрока.СуммаВсего = ВыборкаПоТоварам.Сумма;
				ТекущаяСтрока.СуммаФактВсего = ВыборкаПоТоварам.СуммаФакт;
			КонецЕсли;
		КонецЕсли;
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуИнвентаризации(МассивОбъектов, ОбъектыПечати)
	
    // Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
    ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНВЕНТАРИЗАЦИЯ";
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Инвентаризация.ПФ_MXL_Инвентаризация");
	
	// Получаем запросом необходимые данные.
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);	
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Попытка
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеПечати);
			ТекстЗаголовка = "Инвентаризация товаров на складе №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.НомерДокумента) + " от " + Формат(ДанныеПечати.ДатаДокумента, "ДЛф=Д");
			ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		Исключение
		КонецПопытки;

		// Изменения размера колоноки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
					
		Попытка			
			ОбластьШапки = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьШапки.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьШапки);
			
			Если ВыводитьАртикул Тогда
				ОбластьШапки = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
				ОбластьШапки.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьШапки);
			КонецЕсли;
			
			ОбластьШапки = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			ОбластьШапки.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьШапки);
		Исключение
		КонецПопытки;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				Попытка
					ОбластьСтрока = Макет.ПолучитьОбласть("Строка|НомерСтроки");
					ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
					ОбластьСтрока.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Вывести(ОбластьСтрока);
					
					Если ВыводитьАртикул Тогда
						ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Артикул");
						ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
						ОбластьСтрока.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Присоединить(ОбластьСтрока);
					КонецЕсли;
					
					ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Данные");
					ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
					ОбластьСтрока.Параметры.Заполнить(Выборка);
					
					//++ №12909
					//ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
					ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);;
					//-- №12909
					
					ОбластьСтрока.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;			
					ТабличныйДокумент.Присоединить(ОбластьСтрока);
				Исключение
				КонецПопытки;	
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			ОбластьИтого = Макет.ПолучитьОбласть("Итого|НомерСтроки");
			ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьИтого);
			
			Если ВыводитьАртикул Тогда
				ОбластьИтого = Макет.ПолучитьОбласть("Итого|Артикул");
				ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьИтого);
			КонецЕсли;
			
			ОбластьИтого = Макет.ПолучитьОбласть("Итого|Данные");
			ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
			//Попытка
			//	ОбластьИтого.Параметры.СуммаВсего = Шапка.Товары.Итог("Сумма");
			//	ОбластьИтого.Параметры.СуммаФактВсего = Шапка.Товары.Итог("СуммаФакт");		
			//Исключение
			//КонецПопытки;		
			ТабличныйДокумент.Присоединить(ОбластьИтого);
		Исключение
		КонецПопытки;

		Попытка
			ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
			ОбластьПодписи.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьПодписи);
		Исключение
		КонецПопытки;
				
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
    КонецЦикла;
    Возврат ТабличныйДокумент;
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ОприходованиеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.СписаниеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.Штраф.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли