#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИнициализироватьТовары();	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ИнициализироватьТовары() Экспорт

	Для каждого СтрокаТЧ из ЭтотОбъект.Товары Цикл
		СтрокаТЧ.Количество = 0;
		СтрокаТЧ.КоличествоОтклонение = -СтрокаТЧ.КоличествоФакт;
		СтрокаТЧ.Цена = 0;
		СтрокаТЧ.Сумма = 0;
		СтрокаТЧ.СуммаФакт = 0;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли