Процедура ЗаписатьДанныеВПланВходящихКонтактов(ТочкаПродаж, НомерГод, НомерМесяц, Количество) Экспорт
	
	ДатаПериода = НачалоМесяца(Дата(НомерГод,НомерМесяц,1,0,0,1));
	ПланНаборЗаписей = РегистрыСведений.ПланВходящихКонтактов.СоздатьНаборЗаписей();
	ПланНаборЗаписей.Отбор.Год.Установить(НомерГод);
	ПланНаборЗаписей.Отбор.Месяц.Установить(ДатаПериода);
	ПланНаборЗаписей.Отбор.ТочкаПродаж.Установить(ТочкаПродаж);
	ПланНаборЗаписей.Прочитать();
	Если ПланНаборЗаписей.Количество() = 0 Тогда
		НовыйПлан = ПланНаборЗаписей.Добавить();
	Иначе
		НовыйПлан = ПланНаборЗаписей[0];
	КонецЕсли;
	НовыйПлан.Год = НомерГод;
	НовыйПлан.Месяц = ДатаПериода;
	НовыйПлан.ТочкаПродаж = ТочкаПродаж;
	НовыйПлан.Количество = Количество;
	ПланНаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьДанныеИзПланаВходящихКонтактов(ТочкаПродаж, НомерГод, НомерМесяц) Экспорт
	
	ДатаПериода = НачалоМесяца(Дата(НомерГод,НомерМесяц,1,0,0,1));
	ПланНаборЗаписей = РегистрыСведений.ПланВходящихКонтактов.СоздатьНаборЗаписей();
	ПланНаборЗаписей.Отбор.Год.Установить(НомерГод);
	ПланНаборЗаписей.Отбор.Месяц.Установить(ДатаПериода);
	ПланНаборЗаписей.Отбор.ТочкаПродаж.Установить(ТочкаПродаж);
	ПланНаборЗаписей.Прочитать();
	ПланНаборЗаписей.Удалить(0);
	ПланНаборЗаписей.Записать();
	
КонецПроцедуры