// Размещает команды на форме.
//
// Параметры:
//   Форма                            - УправляемаяФорма - форма, в которой необходимо разместить кнопку.
//   МестоРазмещенияКомандПоУмолчанию - ЭлементФормы - группа, в которую необходимо разместить кнопку,
//                                                     по умолчанию размещается в командную панель формы.
//#13754
Процедура ПриСозданииНаСервере(Форма, МестоРазмещения = Неопределено, СуффиксКоманды = "") Экспорт //, ИмяКоманды=Неопределено, Действие = Неопределено) Экспорт
	
	НаборКонстант = Константы.СоздатьНабор("ОтображатьКнопкуОтправитьTelegram, ОтображатьКнопкуОтправитьViber, ОтображатьКнопкуОтправитьWhatsApp");
	НаборКонстант.Прочитать();
		
	Если НЕ НаборКонстант.ОтображатьКнопкуОтправитьTelegram
		И НЕ НаборКонстант.ОтображатьКнопкуОтправитьViber
		И НЕ НаборКонстант.ОтображатьКнопкуОтправитьWhatsApp
		Тогда 
	    Возврат;
	КонецЕсли;
	
	Если МестоРазмещения = Неопределено Тогда
		МестоРазмещения = Форма.КоманднаяПанель;
	КонецЕсли;

	Действие = "Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер";
		
	Если НаборКонстант.ОтображатьКнопкуОтправитьTelegram Тогда
		
		ДобавитьКомандуИКнопку(Форма, МестоРазмещения,
								"ОтправитьСообщениеTelegram" + СуффиксКоманды, Действие,
		 						"Отправить сообщение Telegram через приложение",
								"Отправить сообщение Telegram через приложение",
								БиблиотекаКартинок.MessengerTelegram);
								
			КонецЕсли;
	
	Если НаборКонстант.ОтображатьКнопкуОтправитьViber Тогда
		
		ДобавитьКомандуИКнопку(Форма, МестоРазмещения,
								"ОтправитьСообщениеViber" + СуффиксКоманды, Действие,
		 						"Отправить сообщение Viber через приложение",
								"Отправить сообщение Viber через приложение",
								БиблиотекаКартинок.MessengerViber);

	КонецЕсли;
							
	Если НаборКонстант.ОтображатьКнопкуОтправитьWhatsApp Тогда
		
		ДобавитьКомандуИКнопку(Форма, МестоРазмещения,
								"ОтправитьСообщениеWhatsApp" + СуффиксКоманды, Действие,
		 						"Отправить сообщение WhatsApp через приложение",
								"Отправить сообщение WhatsApp через приложение",
								БиблиотекаКартинок.MessengerWhatsApp);

	КонецЕсли;
								
КонецПроцедуры

Процедура ДобавитьКомандуИКнопку(Форма, МестоРазмещения, ИмяКоманды, Действие, Заголовок, Подсказка, Картинка)
	
	Если НЕ Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
	КомандаФормы.Подсказка = Подсказка; 
	КомандаФормы.Заголовок = Заголовок; 
	КомандаФормы.Отображение = ОтображениеКнопки.Картинка;
	КомандаФормы.Картинка = Картинка;
	КомандаФормы.Действие = Действие;	
	
	ИмяРеквизита = "Форма" + ИмяКоманды;
	КнопкаФормы = Форма.Элементы.Добавить(ИмяРеквизита, Тип("КнопкаФормы"), МестоРазмещения); 		
	КнопкаФормы.ИмяКоманды = ИмяКоманды;		
	Если МестоРазмещения.Вид = ВидГруппыФормы.КоманднаяПанель ИЛИ МестоРазмещения.Вид = ВидГруппыФормы.ГруппаКнопок Тогда
		КнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Иначе
		КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КонецЕсли;
	
КонецПроцедуры
