
// Получение значения константы.
//
// Параметры:
//  ИмяКонстанты - Строка - наименование константы.
//
// Возвращаемое значение:
//  Значение - значение константы.
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт

	Возврат Константы[ИмяКонстанты].Получить();

КонецФункции

#Область РаботаСЗаказами

//процедуры перевода статуса Заказа на производство
Функция ОснованимЗаказаНаПроизводствоЯвляетсяЗаказПокупателя(СсылкаНаЗаказНаПроизводство) Экспорт
	
	Если ТипЗнч(СсылкаНаЗаказНаПроизводство) = Тип("ДокументСсылка.ЗаказНаПроизводство") 
		И ТипЗнч(СсылкаНаЗаказНаПроизводство.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
		И НЕ СсылкаНаЗаказНаПроизводство.ДокументОснование.Пустая() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
			
КонецФункции

Функция ЗаказНаПроизводствоСвязанСЗаказомПокупателя(СсылкаЗаказНаПроизводство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаЗаказНаПроизводство", СсылкаЗаказНаПроизводство);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументЗаказНаПроизводство.Ссылка 
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ДокументЗаказНаПроизводство
	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ТоварыЗП
	|		ПО (ТоварыЗП.Ссылка = ДокументЗаказНаПроизводство.ДокументОснование)
	|			И (ТоварыЗП.ЗаказНаПроизводство = ДокументЗаказНаПроизводство.Ссылка)
	|           И ТоварыЗП.Ссылка.Проведен
	
	|ГДЕ
	|	ДокументЗаказНаПроизводство.Ссылка = &СсылкаЗаказНаПроизводство
	|	И ДокументЗаказНаПроизводство.Проведен
	|	И НЕ ДокументЗаказНаПроизводство.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Отменен)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СоздатьЗаказыПокупателейНаПроизводствоРозница(СтруктураДанных, ДополнительныеПараметры) Экспорт
	
	Возврат ОбщийМодульСервер.СоздатьЗаказыПокупателейНаПроизводствоИзРозницы(ДополнительныеПараметры.ДокументСсылка, СтруктураДанных.СписокЗаказать, 
																			  ДополнительныеПараметры.НастройкаИнтеркампани, СтруктураДанных);
	
КонецФункции

#КонецОбласти

#Область РаботаСАдресами

//#17014
Функция СписокАвтоподбораУлицы(Текст, ПараметрыАвтоподбора) Экспорт
	
	Результат = Обработки.РасширенныйВводКонтактнойИнформации.СписокАвтоподбораУлицы(Текст, ПараметрыАвтоподбора);
	УправлениеКонтактнойИнформациейСлужебный.ФорматированиеРезультатовАвтоподбора(Результат.Данные, Текст);
	Возврат Результат;
	
КонецФункции

//++ №14051
//Функция ПолучитьСписокУлицПоЧастиНаименования(Знач ЧастьНаименования, КодГорода, КодНасПункта, КодСубъектаРФ) Экспорт
Функция ПолучитьСписокУлицПоЧастиНаименования(Знач ЧастьНаименования, КодГорода, КодНасПункта, КодСубъектаРФ, ИдентификаторРодителя) Экспорт
//-- №14051

	СписокУлиц = Новый СписокЗначений;
	
	Если ПустаяСтрока(ЧастьНаименования) Или (НЕ ЗначениеЗаполнено(КодГорода) И НЕ ЗначениеЗаполнено(КодНасПункта) И НЕ ЗначениеЗаполнено(КодСубъектаРФ)) Тогда
		Возврат СписокУлиц;
	КонецЕсли;
	
	//++ №14051 поиск по идентификатору родителя
	Если ЗначениеЗаполнено(ИдентификаторРодителя) Тогда
		
		//Результат = Обработки.РасширенныйВводКонтактнойИнформации.СписокАвтоподбораУлицы(Текст, ПараметрыАвтоподбора);
		//УправлениеКонтактнойИнформациейСлужебный.ФорматированиеРезультатовАвтоподбора(Результат.Данные, Текст);
	
	
		Уровни = новый Массив;
		Уровни.Добавить(7);
		//Уровни.Добавить(90);
		//Уровни.Добавить(91);
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоФразы", "%" + Строка(ЧастьНаименования) + "%");
		//Запрос.УстановитьПараметр("КодГорода", КодГорода);
		//Запрос.УстановитьПараметр("КодНасПункта", КодНасПункта);
		Запрос.УстановитьПараметр("КодСубъектаРФ", КодСубъектаРФ);
		Запрос.УстановитьПараметр("ИдентификаторРодителя", ИдентификаторРодителя);
		Запрос.УстановитьПараметр("Уровни", Уровни);

		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АдресныеОбъекты.Наименование КАК Наименование,
		|	АдресныеОбъекты.Сокращение КАК Сокращение,
		|	АдресныеОбъекты.Идентификатор КАК Идентификатор
		|ИЗ
		//|	РегистрСведений.АдресныеОбъекты КАК РодительскийОбъект
		|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
		|
		//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
		//|	ПО АдресныеОбъекты.КодСубъектаРФ = РодительскийОбъект.КодСубъектаРФ
		//|	И АдресныеОбъекты.Идентификатор <> РодительскийОбъект.Идентификатор
		//|	И ВЫБОР
		//|	КОГДА РодительскийОбъект.Уровень = 2 ТОГДА
		//|		  АдресныеОбъекты.КодОкруга = РодительскийОбъект.КодОкруга
		//|		  
		//|	КОГДА РодительскийОбъект.Уровень = 3 ТОГДА
		//|		  АдресныеОбъекты.КодОкруга = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона = РодительскийОбъект.КодРайона
		//|	
		//|	КОГДА РодительскийОбъект.Уровень = 4 ТОГДА
		//|		  АдресныеОбъекты.КодОкруга  = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона  = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодГорода  = РодительскийОбъект.КодГорода
		//|		
		//|	КОГДА РодительскийОбъект.Уровень = 5 ТОГДА
		//|		  АдресныеОбъекты.КодОкруга  = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона  = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодГорода  = РодительскийОбъект.КодГорода
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = РодительскийОбъект.КодВнутригородскогоРайона
		//|		
		//|	КОГДА РодительскийОбъект.Уровень = 6 ТОГДА
		//|		  АдресныеОбъекты.КодОкруга  = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона  = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодГорода  = РодительскийОбъект.КодГорода
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = РодительскийОбъект.КодВнутригородскогоРайона
		//|		И АдресныеОбъекты.КодНаселенногоПункта       = РодительскийОбъект.КодНаселенногоПункта
		//|	
		//|	КОГДА РодительскийОбъект.Уровень = 7 ТОГДА
		//|		  АдресныеОбъекты.КодОкруга  = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона  = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодГорода  = РодительскийОбъект.КодГорода
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = РодительскийОбъект.КодВнутригородскогоРайона
		//|		И АдресныеОбъекты.КодНаселенногоПункта       = РодительскийОбъект.КодНаселенногоПункта
		//|		И АдресныеОбъекты.КодУлицы                   = РодительскийОбъект.КодУлицы
		//|
		//|	КОГДА РодительскийОбъект.Уровень = 90 ТОГДА
		//|		  АдресныеОбъекты.КодОкруга  = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона  = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодГорода  = РодительскийОбъект.КодГорода
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = РодительскийОбъект.КодВнутригородскогоРайона
		//|		И АдресныеОбъекты.КодНаселенногоПункта       = РодительскийОбъект.КодНаселенногоПункта
		//|		И АдресныеОбъекты.КодУлицы                   = РодительскийОбъект.КодУлицы
		//|		И АдресныеОбъекты.КодДополнительногоЭлемента = РодительскийОбъект.КодДополнительногоЭлемента
		//|	
		//|	КОГДА РодительскийОбъект.Уровень = 91 ТОГДА
		//|		  АдресныеОбъекты.КодОкруга  = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона  = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодГорода  = РодительскийОбъект.КодГорода
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = РодительскийОбъект.КодВнутригородскогоРайона
		//|		И АдресныеОбъекты.КодНаселенногоПункта       = РодительскийОбъект.КодНаселенногоПункта
		//|		И АдресныеОбъекты.КодУлицы                   = РодительскийОбъект.КодУлицы
		//|		И АдресныеОбъекты.КодДополнительногоЭлемента = РодительскийОбъект.КодДополнительногоЭлемента
		//|		И АдресныеОбъекты.КодПодчиненногоЭлемента    = РодительскийОбъект.КодПодчиненногоЭлемента
		//|	
		//|	ИНАЧЕ ИСТИНА
		//|КОНЕЦ
		//|	И ВЫБОР
		//|	КОГДА АдресныеОбъекты.Уровень = 2 ТОГДА	// Округ
		//|		  АдресныеОбъекты.КодРайона = 0
		//|		И АдресныеОбъекты.КодГорода = 0
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = 0
		//|		И АдресныеОбъекты.КодНаселенногоПункта       = 0
		//|		И АдресныеОбъекты.КодУлицы                   = 0
		//|		И АдресныеОбъекты.КодДополнительногоЭлемента = 0
		//|		И АдресныеОбъекты.КодПодчиненногоЭлемента    = 0
		//|		
		//|	КОГДА АдресныеОбъекты.Уровень = 2 ТОГДА	// Район
		//|		  АдресныеОбъекты.КодОкруга = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодГорода = 0
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = 0
		//|		И АдресныеОбъекты.КодНаселенногоПункта       = 0
		//|		И АдресныеОбъекты.КодУлицы                   = 0
		//|		И АдресныеОбъекты.КодДополнительногоЭлемента = 0
		//|		И АдресныеОбъекты.КодПодчиненногоЭлемента    = 0
		//|		
		//|	КОГДА АдресныеОбъекты.Уровень = 4 ТОГДА	// Город
		//|		  АдресныеОбъекты.КодОкруга = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = 0
		//|		И АдресныеОбъекты.КодНаселенногоПункта       = 0
		//|		И АдресныеОбъекты.КодУлицы                   = 0
		//|		И АдресныеОбъекты.КодДополнительногоЭлемента = 0
		//|		И АдресныеОбъекты.КодПодчиненногоЭлемента    = 0
		//|		
		//|	КОГДА АдресныеОбъекты.Уровень = 5 ТОГДА	// Внутригородской район
		//|		  АдресныеОбъекты.КодОкруга = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодГорода = РодительскийОбъект.КодГорода
		//|		И АдресныеОбъекты.КодНаселенногоПункта       = 0
		//|		И АдресныеОбъекты.КодУлицы                   = 0
		//|		И АдресныеОбъекты.КодДополнительногоЭлемента = 0
		//|		И АдресныеОбъекты.КодПодчиненногоЭлемента    = 0
		//|	
		//|	КОГДА АдресныеОбъекты.Уровень = 6 ТОГДА	// Населенный пункт
		//|		  АдресныеОбъекты.КодОкруга = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодГорода = РодительскийОбъект.КодГорода
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = РодительскийОбъект.КодВнутригородскогоРайона
		//|		И АдресныеОбъекты.КодУлицы                   = 0
		//|		И АдресныеОбъекты.КодДополнительногоЭлемента = 0
		//|		И АдресныеОбъекты.КодПодчиненногоЭлемента    = 0
		//|		
		//|	КОГДА АдресныеОбъекты.Уровень = 7 ТОГДА	// Улица
		//|		  АдресныеОбъекты.КодОкруга = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодГорода = РодительскийОбъект.КодГорода
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = РодительскийОбъект.КодВнутригородскогоРайона
		//|		И АдресныеОбъекты.КодНаселенногоПункта       = РодительскийОбъект.КодНаселенногоПункта
		//|		И АдресныеОбъекты.КодДополнительногоЭлемента = 0
		//|		И АдресныеОбъекты.КодПодчиненногоЭлемента    = 0
		//|		
		//|	КОГДА АдресныеОбъекты.Уровень = 90 ТОГДА	// Дополнительный
		//|		  АдресныеОбъекты.КодОкруга = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодГорода = РодительскийОбъект.КодГорода
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = РодительскийОбъект.КодВнутригородскогоРайона
		//|		И АдресныеОбъекты.КодНаселенногоПункта       = РодительскийОбъект.КодНаселенногоПункта
		//|		И АдресныеОбъекты.КодУлицы                   = РодительскийОбъект.КодУлицы
		//|		И АдресныеОбъекты.КодПодчиненногоЭлемента    = 0
		//|		
		//|	КОГДА АдресныеОбъекты.Уровень = 91 ТОГДА	// Подчиненный
		//|		  АдресныеОбъекты.КодОкруга = РодительскийОбъект.КодОкруга
		//|		И АдресныеОбъекты.КодРайона = РодительскийОбъект.КодРайона
		//|		И АдресныеОбъекты.КодГорода = РодительскийОбъект.КодГорода
		//|		И АдресныеОбъекты.КодВнутригородскогоРайона  = РодительскийОбъект.КодВнутригородскогоРайона
		//|		И АдресныеОбъекты.КодНаселенногоПункта       = РодительскийОбъект.КодНаселенногоПункта
		//|		И АдресныеОбъекты.КодУлицы                   = РодительскийОбъект.КодУлицы
		//|		И АдресныеОбъекты.КодДополнительногоЭлемента = РодительскийОбъект.КодДополнительногоЭлемента
		//|		
		//|	ИНАЧЕ ИСТИНА
		//|КОНЕЦ
		|
		|ГДЕ
		|	АдресныеОбъекты.РодительскийИдентификатор = &ИдентификаторРодителя
		
		|	И АдресныеОбъекты.КодСубъектаРФ = &КодСубъектаРФ
		|	И АдресныеОбъекты.Уровень В (&Уровни)
		|	И АдресныеОбъекты.Наименование ПОДОБНО &НачалоФразы
		
		//|	И НЕ АдресныеОбъекты.Идентификатор ЕСТЬ NULL
		//|	И ВЫБОР
		//|		КОГДА НЕ &КодГорода = 0
		//|			ТОГДА АдресныеОбъекты.КодГорода = &КодГорода
		//|       КОГДА НЕ &КодНасПункта = 0 
		//|			ТОГДА АдресныеОбъекты.КодНаселенногоПункта = &КодНасПункта
		//|       КОГДА НЕ &КодСубъектаРФ = 0 
		//|			ТОГДА АдресныеОбъекты.КодСубъектаРФ = &КодСубъектаРФ
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ
		//|	И НЕ АдресныеОбъекты.Идентификатор ЕСТЬ NULL
		|";
				
	//-- №14051 поиск по идентификатору родителя
	Иначе
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоФразы", "%" + Строка(ЧастьНаименования) + "%");
		Запрос.УстановитьПараметр("КодГорода", КодГорода);
		Запрос.УстановитьПараметр("КодНасПункта", КодНасПункта);
		Запрос.УстановитьПараметр("КодСубъектаРФ", КодСубъектаРФ);

		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АдресныеОбъекты.Наименование КАК Наименование,
		|	АдресныеОбъекты.Сокращение КАК Сокращение,
		|	АдресныеОбъекты.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
		|ГДЕ		
		|	АдресныеОбъекты.Уровень > 6
		|	И АдресныеОбъекты.Наименование ПОДОБНО &НачалоФразы
		//--Ришат. Зачем исключаем филтры если они по 0? Если нам надо найти все улицы одного города, то КодНасПункта=0 и в поиске выпадут лишние улицы
		//|	И ВЫБОР
		//|		КОГДА НЕ &КодГорода = 0
		//|			ТОГДА АдресныеОбъекты.КодГорода = &КодГорода
		//|       КОГДА НЕ &КодНасПункта = 0 
		//|			ТОГДА АдресныеОбъекты.КодНаселенногоПункта = &КодНасПункта
		//|       КОГДА НЕ &КодСубъектаРФ = 0 
		//|			ТОГДА АдресныеОбъекты.КодСубъектаРФ = &КодСубъектаРФ
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ
		
		//|	И АдресныеОбъекты.КодКЛАДР = &КодГорода
		//|	И АдресныеОбъекты.КодКЛАДР = &КодНасПункта
		|	И АдресныеОбъекты.КодСубъектаРФ = &КодСубъектаРФ";
				
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Представление = Выборка.Сокращение + " " + Выборка.Наименование;
		
		Структ = Новый Структура;
		Структ.Вставить("Представление",Представление);
		Структ.Вставить("Идентификатор",Выборка.Идентификатор);
		
		СписокУлиц.Добавить(Структ, Представление);
	КонецЦикла;
	
	Возврат СписокУлиц;
	
КонецФункции

//Функция ПолучитьСписокДомов(ИдентификаторУлицы) Экспорт
Функция СписокАвтоподбораДомов(ИдентификаторУлицы) Экспорт
	
	СписокДомов = Новый СписокЗначений;	
	ТаблицаДомов = Обработки.РасширенныйВводКонтактнойИнформации.СписокДомов(ИдентификаторУлицы);
	
	Если ТипЗнч(ТаблицаДомов) = Тип("ТаблицаЗначений") Тогда		
		Для Каждого ТекущийДом Из ТаблицаДомов Цикл			
			СтрокаДом = СтрЗаменить(НРег(ТекущийДом.Представление), ",", "");
			СписокДомов.Добавить(Новый Структура("Представление, ЭтоДом", СтрокаДом, Истина), СтрокаДом);			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат СписокДомов;
	
КонецФункции

#КонецОбласти

#Область ЕдиницыИзмерения

Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура) Экспорт
	
	Если ЗначениеЗаполнено(Номенклатура) ТОгда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "БазоваяЕдиницаИзмерения");
	КонецЕсли;
	
	Возврат Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьКоэффициентЕдиницыИзмерения(ЕдиницаИзмерения) Экспорт
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "Коэффициент");
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьЕдиницуИзмеренияДляПроизводства(Знач Номенклатура) Экспорт
	
	Если ЗначениеЗаполнено(Номенклатура) ТОгда
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "БазоваяЕдиницаИзмерения, ВидНоменклатуры, АльтернативнаяЕдиницаИзмерения");
				
		ЕдиницаИзмерения = РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения;
		
		Если РеквизитыНоменклатуры.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
			Если Константы.ИспользоватьАльтернативнуюЕдиницуИзмеренияМатериалаПриЗагрузкеИзИзиСилинг.Получить() Тогда
				Если НЕ РеквизитыНоменклатуры.АльтернативнаяЕдиницаИзмерения.Пустая() Тогда
					ЕдиницаИзмерения = РеквизитыНоменклатуры.АльтернативнаяЕдиницаИзмерения;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
		Возврат ЕдиницаИзмерения;
	КонецЕсли;

	Возврат Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

Функция ПолучитьСсылкуНаОснование(СсылкаНаЗаказНаПроизводство) Экспорт
	Возврат СсылкаНаЗаказНаПроизводство.ДокументОснование; 
КонецФункции

Функция ЭтоПроизводствоУникальнойПродукции(ЗаказНаПроизводство) Экспорт
	
	Результат = Ложь;
	
	Если ТипЗнч(ЗаказНаПроизводство) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		Если ЗаказНаПроизводство.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиДокументВыпускаПродукции(СсылкаНаЗаказНаПроизводство) Экспорт
	
	Результат = Документы.ВыпускПродукции.ПустаяСсылка();
	
	Если СсылкаНаЗаказНаПроизводство.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
		//подберем последний документ выпуска продукции по данному заказу на производство
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыНаПроизводствоОбороты.Регистратор
		|ИЗ
		|	РегистрНакопления.ЗаказыНаПроизводство.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыНаПроизводствоОбороты
		|ГДЕ
		|	ЗаказыНаПроизводствоОбороты.КоличествоРасход > 0
		|	И ЗаказыНаПроизводствоОбороты.ЗаказНаПроизводство.ПродукцияНоменклатура = &ПродукцияНоменклатура";
		Запрос.УстановитьПараметр("ЗаказНаПроизводство",СсылкаНаЗаказНаПроизводство);
		Запрос.УстановитьПараметр("ПродукцияНоменклатура",СсылкаНаЗаказНаПроизводство.ПродукцияНоменклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ВыпускПродукции = Выборка.Регистратор;
			Результат = Выборка.Регистратор;
		КонецЦикла;
	Иначе
		//подберем последний документ выпуска продукции по данному заказу на производство
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыНаПроизводствоОбороты.Регистратор
		|ИЗ
		|	РегистрНакопления.ЗаказыНаТиповоеПроизводство.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыНаПроизводствоОбороты
		|ГДЕ
		|	ЗаказыНаПроизводствоОбороты.КоличествоРасход > 0";
		Запрос.УстановитьПараметр("ЗаказНаПроизводство",СсылкаНаЗаказНаПроизводство);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ВыпускПродукции = Выборка.Регистратор;
			Результат = Выборка.Регистратор;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДокументПроведен(Документ) Экспорт
	Возврат Документ.Проведен;
КонецФункции

Функция ИзменяетсяСтатусПроведения(Знач ДокументОбъект, Знач РежимЗаписи) Экспорт
	
	Возврат (НЕ ДокументОбъект.Ссылка.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение)
			ИЛИ (ДокументОбъект.Ссылка.Проведен И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения);
			
КонецФункции

Функция ЕстьНеПроведенныйДокументВыпускаПоЭтомуЗаказу(СсылкаНаЗаказНаПроизводство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыпускПродукции.Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Основание = &СсылкаНаЗаказНаПроизводство
	|	И НЕ ВыпускПродукции.ПометкаУдаления
	|	И НЕ ВыпускПродукции.Проведен";
	Запрос.УстановитьПараметр("СсылкаНаЗаказНаПроизводство",СсылкаНаЗаказНаПроизводство);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Документы.ВыпускПродукции.ПустаяСсылка();
	Иначе
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			Возврат ВыборкаЗапроса.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция ВыпускСоответствуетЗаказу(Выпуск, Заказ) Экспорт
	
	Если Заказ.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
		Если Выпуск.ПродукцияНоменклатура = Заказ.ПродукцияНоменклатура
			и Выпуск.ПродукцияНомерРасчета = Заказ.ПродукцияНомерРасчета Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТаблицаВыпуска = Выпуск.Продукция.Выгрузить();
		ТаблицаВыпуска.Свернуть("Номенклатура, ЕдиницаИзмерения","Количество");
		ТаблицаВыпуска.Сортировать("Номенклатура Возр, ЕдиницаИзмерения Возр, Количество Возр");
		ТаблицаЗаказа = Заказ.Продукция.Выгрузить();
		ТаблицаЗаказа.Свернуть("Номенклатура, ЕдиницаИзмерения","Количество");
		ТаблицаЗаказа.Сортировать("Номенклатура Возр, ЕдиницаИзмерения Возр, Количество Возр");
		Если НЕ ТаблицаВыпуска.Количество() = ТаблицаЗаказа.Количество() Тогда
			Возврат Ложь;
		Иначе
			Для НомерСтроки = 0 По ТаблицаВыпуска.Количество()-1 Цикл
				Если НЕ ТаблицаВыпуска[НомерСтроки].Номенклатура = ТаблицаЗаказа[НомерСтроки].Номенклатура
					ИЛИ НЕ ТаблицаВыпуска[НомерСтроки].ЕдиницаИзмерения = ТаблицаЗаказа[НомерСтроки].ЕдиницаИзмерения
					ИЛИ НЕ ТаблицаВыпуска[НомерСтроки].Количество = ТаблицаЗаказа[НомерСтроки].Количество Тогда
						Возврат Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ВозВрат Истина;
	КонецЕсли;
	
КонецФункции

Функция ИзменитьСтатусЗаказаНаПроизводствоНаПроизведен(Заказ = Неопределено, Номер="", Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказНаПроизводство.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	(ЗаказНаПроизводство.Номер = &Номер
	|				И ЗаказНаПроизводство.Дата = &Дата
	|			ИЛИ ЗаказНаПроизводство.Ссылка = &Заказ)";
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Дата",  Дата);
	Запрос.УстановитьПараметр("Заказ", Заказ);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ДокументОбъект.ПроверитьЗаполнение() Тогда
			ДокументОбъект.ТекущийСтатус = Справочники.СтатусыЗаказовНаПроизводство.Произведен;
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);				
			Исключение
				Возврат Ложь;				
			КонецПопытки;
			//сформируем электронное письмо
			Если РаботаСЭлектроннойПочтой.ОтправлятьEMailКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен() Тогда
				СсылкаНаЭлектронноеПисьмо = Документы.ЗаказНаПроизводство.СформироватьЭлектронноеПисьмоКонтрагентуОПереводеВСтатусПроизведен(Выборка.Ссылка);
				Если НЕ СсылкаНаЭлектронноеПисьмо.Пустая() Тогда
					РезультатОтправки = Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(СсылкаНаЭлектронноеПисьмо);
					Если НЕ ПустаяСтрока(РезультатОтправки) Тогда
						Сообщить("Ошибка отправки электронного письма контрагенту: " + РезультатОтправки);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПотолокЗаказаНаПроизводство(СсылкаНаЗаказНаПроизводство) Экспорт
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Потолок", Справочники.Номенклатура.ПустаяСсылка());
	СтруктураОтвета.Вставить("УИСтроки", "");
	
	Если СсылкаНаЗаказНаПроизводство.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
		
		СтруктураОтвета.Вставить("Потолок", СсылкаНаЗаказНаПроизводство.ПродукцияНоменклатура);
		СтруктураОтвета.Вставить("УИСтроки", СсылкаНаЗаказНаПроизводство.ПродукцияУИСтроки);
	
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

// вызов из модуля СозданиеНаОснованииПотолкиКлиент
Функция СоздатьОбновитьВыпускПродукции(ДанныеЗаполнения, СсылкаНаДокументВыпуска, ОписаниеОшибки) Экспорт
	
	Если СсылкаНаДокументВыпуска <> Неопределено И НЕ СсылкаНаДокументВыпуска.Пустая() Тогда
		ВыпускОбъект = СсылкаНаДокументВыпуска.ПолучитьОбъект();
		ВыпускОбъект.ОбновитьДату(); //#14923
	Иначе
		ВыпускОбъект = Документы.ВыпускПродукции.СоздатьДокумент();
		ВыпускОбъект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ВыпускОбъект.Заполнить(ДанныеЗаполнения);
	
	//nva+++
	//Если выпуск из остатков или из материалов заказчика то надо в заказе на производства тоже поменять ТЧ
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Заказ) Тогда
		ЗаказОбъект = ДанныеЗаполнения.Заказ.ПолучитьОбъект();
		Если ДанныеЗаполнения.Свойство("ВыпускИзОстатков") И ДанныеЗаполнения.ВыпускИзОстатков Тогда
			ОбщийМодульСервер.ИзменитьПолотнаВМатериалах(ЗаказОбъект, Истина, Истина);
			ЗаказОбъект.РучнаяКорректировкаМатериалов = Истина;
			Попытка
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);			
			Исключение	
				//ОписаниеОшибки = ОписаниеОшибки();
				МассивСообщений = ПолучитьСообщенияПользователю(Ложь); //Истина);
				ОписаниеОшибки = "Ошибки при проведении документа: ";
				Для каждого Сообщение из МассивСообщений Цикл
					ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + Сообщение.Текст; 
				КонецЦикла;
			КонецПопытки;
		КонецЕсли;
		//#13345
		Если ДанныеЗаполнения.Свойство("ВыпускИзМатериаловЗаказчика") И ДанныеЗаполнения.ВыпускИзМатериаловЗаказчика Тогда
			ОбщийМодульСервер.ИзменитьПолотнаВМатериалах(ЗаказОбъект, Истина, Ложь);
			ЗаказОбъект.РучнаяКорректировкаМатериалов = Истина;
			Попытка
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);			
			Исключение	
				//ОписаниеОшибки = ОписаниеОшибки();
				МассивСообщений = ПолучитьСообщенияПользователю(Ложь); //Истина);
				ОписаниеОшибки = "Ошибки при проведении документа: ";
				Для каждого Сообщение из МассивСообщений Цикл
					ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + Сообщение.Текст; 
				КонецЦикла;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	//nva---
	
	Если ВыпускОбъект.ПроверитьЗаполнение() Тогда		
		Попытка
			ВыпускОбъект.Записать(РежимЗаписиДокумента.Проведение);			
			Возврат ВыпускОбъект.Ссылка;
		Исключение	
			//ОписаниеОшибки = ОписаниеОшибки();
			МассивСообщений = ПолучитьСообщенияПользователю(Ложь); //Истина);
			ОписаниеОшибки = "Ошибки при проведении документа: ";
			Для каждого Сообщение из МассивСообщений Цикл
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + Сообщение.Текст; 
			КонецЦикла;
			Возврат Документы.ВыпускПродукции.ПустаяСсылка();
		КонецПопытки;
	Иначе
		МассивСообщений = ПолучитьСообщенияПользователю(Ложь); //Истина);
		ОписаниеОшибки = "Ошибки при проверке заполнения документа: ";
		Для каждого Сообщение из МассивСообщений Цикл
			ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + Сообщение.Текст; 
		КонецЦикла;	
		Возврат Документы.ВыпускПродукции.ПустаяСсылка();	
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьСтруктуруТовараПоШтрихКоду(СтруктураТовара) Экспорт
	
	Если ЗначениеЗаполнено(СтруктураТовара.ШтрихКод) Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Штрихкоды.Номенклатура КАК Номенклатура,
		|	Штрихкоды.Характеристика КАК ХарактеристикаНоменклатуры,
		|	Штрихкоды.Серия КАК СерияНоменклатуры,
		|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Штрихкоды.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Штрихкод = &Штрихкод";
		Запрос.УстановитьПараметр("Штрихкод", СтруктураТовара.ШтрихКод);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураТовара, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокЗаказовНаПроизводствоКОтмене(МассивЗаказовПокупателей) Экспорт
	
	МассивЗаказов = Новый Массив;
	
	//найдем все ЗнП по ЗП
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументЗаказ.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ЗаказыНаПроизводствоОбороты.КоличествоРасход, 0) КАК КоличествоРасход
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ДокументЗаказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПроизводство.Обороты КАК ЗаказыНаПроизводствоОбороты
	|		ПО ДокументЗаказ.Ссылка = ЗаказыНаПроизводствоОбороты.ЗаказНаПроизводство
	|ГДЕ
	|	ДокументЗаказ.Проведен
	|	И НЕ ДокументЗаказ.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Отменен)
	|	И ДокументЗаказ.ДокументОснование В(&МассивЗаказовПокупателей)";
	
	Запрос.УстановитьПараметр("МассивЗаказовПокупателей", МассивЗаказовПокупателей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоРасход = 0 Тогда
			МассивЗаказов.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЗаказов;
	
КонецФункции

Функция ИзменитьСтатусЗаказНаПроизводство(ЗаказНаПроизводство, УстановитьСтатус) Экспорт
	
	Если ЗаказНаПроизводство.ТекущийСтатус = УстановитьСтатус Тогда
		Возврат Истина;
	КонецЕсли;

	Попытка
		ДокОбъект = ЗаказНаПроизводство.ПолучитьОбъект();
		ДокОбъект.ТекущийСтатус = УстановитьСтатус;
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокОбъект.Записать();
		КонецЕсли;
		Возврат Истина;
	Исключение
		Возврат Ложь
	КонецПопытки;
	
КонецФункции

// процедура изменяет статусы заказов в массиве, если изменение статуса не удалось, то заказ удаляется из массива
Процедура ИзменитьСтатусЗаказовПокупателей(Форма, МассивВыполненныхЗаказов, УстановитьСтатус, ПроверятьБлокировку = Истина) Экспорт
	
	Колво = МассивВыполненныхЗаказов.Количество();
	Для Инд = 1 по Колво Цикл
		ЗаказСсылка = МассивВыполненныхЗаказов[Колво-Инд];
		Если ЗаказСсылка.ТекущийСтатус = УстановитьСтатус Тогда
			Продолжить;
		КонецЕсли;
		
		ПродолжитьИзменение = Ложь;
		
		Если ПроверятьБлокировку Тогда
			Если БлокировкаОбъекта(Форма, ЗаказСсылка, Истина) Тогда
				БлокировкаОбъекта(Форма, ЗаказСсылка, Ложь);
				ПродолжитьИзменение = Истина;
			КонецЕсли;
		Иначе
			ПродолжитьИзменение = Истина;
		КонецЕсли;
		
		Если ПродолжитьИзменение Тогда	
			ДокОбъект = ЗаказСсылка.ПолучитьОбъект();
			ДокОбъект.ТекущийСтатус = УстановитьСтатус;
			Попытка
				Если ДокОбъект.Проведен Тогда
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					ДокОбъект.Записать();
				КонецЕсли;
			Исключение
				МассивВыполненныхЗаказов.Удалить(Колво-Инд);	
			КонецПопытки;
		Иначе
			МассивВыполненныхЗаказов.Удалить(Колво-Инд);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьСтатусЗаказДоговоров(Форма, МассивВыполненныхЗаказов, УстановитьСтатус, ПроверятьБлокировку = Истина) Экспорт
	
	Колво = МассивВыполненныхЗаказов.Количество();
	Для Инд = 1 по Колво Цикл
		ЗаказСсылка = МассивВыполненныхЗаказов[Колво-Инд];
		Если ЗаказСсылка.ТекущийСтатус = УстановитьСтатус Тогда
			Продолжить;
		КонецЕсли;
		
		ПродолжитьИзменение = Ложь;
		
		Если ПроверятьБлокировку Тогда
			Если БлокировкаОбъекта(Форма, ЗаказСсылка, Истина) Тогда
				БлокировкаОбъекта(Форма, ЗаказСсылка, Ложь);
				ПродолжитьИзменение = Истина;
			КонецЕсли;
		Иначе
			ПродолжитьИзменение = Истина;
		КонецЕсли;
		
		Если ПродолжитьИзменение Тогда	
			ДокОбъект = ЗаказСсылка.ПолучитьОбъект();
			ДокОбъект.ТекущийСтатус = УстановитьСтатус;
			Попытка
				Если ДокОбъект.Проведен Тогда
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					ДокОбъект.Записать();
				КонецЕсли;
			Исключение
				МассивВыполненныхЗаказов.Удалить(Колво-Инд);	
			КонецПопытки;
		Иначе
			МассивВыполненныхЗаказов.Удалить(Колво-Инд);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Функция БлокировкаОбъекта(Форма, ОбъектСсылка, Заблокировать) Экспорт
	
	Если Заблокировать Тогда
		Попытка
			ЗаблокироватьДанныеДляРедактирования(ОбъектСсылка,, Форма.УникальныйИдентификатор);
		Исключение
			Возврат Ложь;
		КонецПопытки;		
	Иначе
		РазблокироватьДанныеДляРедактирования(ОбъектСсылка, Форма.УникальныйИдентификатор);	
	КонецЕсли;	
	Возврат Истина;	
	
КонецФункции

//Работа с файлами
Функция ПолучитьДанныеФайла(СсылкаНаОбъект, ИмяФайла, Знач Номенклатура = Неопределено, УникальныйИдентификатор) Экспорт
	
	Если Номенклатура = Неопределено Тогда
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.Данные,
	//++ №7253
	|	ПрикрепленныеДанные.СсылкаНаОбъект,
	|	ПрикрепленныеДанные.ИмяФайла,
	|	ПрикрепленныеДанные.Расширение,
	|	ПрикрепленныеДанные.Архивирован,
	|	ПрикрепленныеДанные.ВариантАрхивации,
	|	ПрикрепленныеДанные.ПутьАрхивации,
	|	ПрикрепленныеДанные.ДатаАрхивации,
	|	ПрикрепленныеДанные.ИдентификаторФайлаGD,
	|	ПрикрепленныеДанные.ИдентификаторПапкиGD
	//-- №7253
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект = &Ссылка
	|	И ПрикрепленныеДанные.ИмяФайла = &ИмяФайла";
	Запрос.УстановитьПараметр("Ссылка", ?(Номенклатура = Справочники.Номенклатура.ПустаяСсылка(), СсылкаНаОбъект, Номенклатура));
	Запрос.УстановитьПараметр("ИмяФайла", ИмяФайла);
	
	
	Данные = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		// №7253 если архивирован, нужно получить из архива
		Если Выборка.Архивирован Тогда
			
			Данные = ПолучитьФайлИзАрхива(Выборка);
			
		Иначе
			
			Данные = Выборка.Данные.Получить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	// №7253 если Данные = Неопределено возвращаем как есть, чтобы пропустить файл (там откуда вызывается функция)
	Если Данные = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
	КонецЕсли;
	
КонецФункции

//++ №7253
Функция ПолучитьФайлИзАрхива(СтруктураФайла) Экспорт
	
	Если СтруктураФайла.ВариантАрхивации = Перечисления.ВариантыАрхивацииПрикрепленныхДанных.ЛокальныйДиск Тогда
		
		ПолныйПутьКФайлу = СтруктураФайла.ПутьАрхивации + "\" + СтруктураФайла.СсылкаНаОбъект.УникальныйИдентификатор() + "\" + СтруктураФайла.ИмяФайла + "." + СтруктураФайла.Расширение;
		ФайлНаДиске = новый Файл(ПолныйПутьКФайлу);
		Если ФайлНаДиске.Существует() Тогда
			Возврат Новый ДвоичныеДанные(ФайлНаДиске.ПолноеИмя);
		Иначе
			Сообщить("Не удалось получить файл из локального архива: " + ПолныйПутьКФайлу);
		КонецЕсли;
		
	ИначеЕсли СтруктураФайла.ВариантАрхивации = Перечисления.ВариантыАрхивацииПрикрепленныхДанных.GoogleDrive Тогда
		
		Возврат РаботаСGoogleAPIВызовСервера.ПолучитьФайлПоID(СтруктураФайла.ИдентификаторФайлаGD);
		
	ИначеЕсли СтруктураФайла.ВариантАрхивации = Перечисления.ВариантыАрхивацииПрикрепленныхДанных.ЯндексДиск Тогда
		
		ПолныйПутьКФайлу = СтруктураФайла.ПутьАрхивации + "/" + СтруктураФайла.ИмяФайла + "." + СтруктураФайла.Расширение;
		Возврат РаботаСЯндексAPIВызовСервера.ПолучитьФайлПолномуПути(ПолныйПутьКФайлу);
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
//-- №7253

Функция СохранитьПрикрепленныеДанные(Ссылка, ИмяФайла, Расширение, Данные, ДополнительныеПараметры = Неопределено, ПрисоединенныйФайл = Неопределено) Экспорт
	
	// №7722 для изображений номенклатуры используется справочник
	НоменклатураПрисоединенныеФайлы = Ложь;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("НоменклатураПрисоединенныеФайлы") Тогда
		НоменклатураПрисоединенныеФайлы = ДополнительныеПараметры.НоменклатураПрисоединенныеФайлы;
	КонецЕсли;
	
	Результат = Истина;
	
	// №9396 проверка превышения объема
	СтруктураПрикрепленныхДанных = ОбщийМодуль.ПолучитьСтруктуруПрикрепленныхДанных();
	Если СтруктураПрикрепленныхДанных.ОбъемПревышен ИЛИ СтруктураПрикрепленныхДанных.ОбъемПредупреждение Тогда
		Сообщить(СтруктураПрикрепленныхДанных.ТекстСообщения);
		Если СтруктураПрикрепленныхДанных.ОбъемПревышен Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если НоменклатураПрисоединенныеФайлы Тогда
		
		Попытка
		
			СправочникОбъект = Справочники.НоменклатураПрисоединенныеФайлы.СоздатьЭлемент();
			СправочникОбъект.ФайлХранилище = Новый ХранилищеЗначения(ОбщийМодуль.Десериализовать(Данные));
			СправочникОбъект.Наименование = ИмяФайла;
			СправочникОбъект.Расширение = Расширение;
			СправочникОбъект.ДатаСоздания = ТекущаяДатаСеанса();
			СправочникОбъект.ВладелецФайла = Ссылка;
			
			СправочникОбъект.Записать();
			ПрисоединенныйФайл = СправочникОбъект.Ссылка;
			
		Исключение
			
			Результат = Ложь;
			Сообщить(" " + ОписаниеОшибки());
			
		КонецПопытки;
		
	Иначе	
	
		Попытка
			
			МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			МенеджерЗаписи.Данные = Новый ХранилищеЗначения(ОбщийМодуль.Десериализовать(Данные));
			МенеджерЗаписи.ИмяФайла = ОбщийМодульСервер.ПолучитьИмяФайлаПрикрепленныхДанных(Ссылка, ИмяФайла, Расширение); //ИмяФайла;
			МенеджерЗаписи.Расширение = Расширение;
			МенеджерЗаписи.СсылкаНаОбъект = Ссылка;
			МенеджерЗаписи.Записать(Ложь);
			
		Исключение
			Результат = Ложь;
			Сообщить(" " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция СкопироватьЭкземплярПрикрепленныхДанных(ИсточникСсылка, ПриемникСсылка, ИмяФайла, Расширение, ДатаПрикрепления) Экспорт
	
	Результат = Истина;
	Попытка
		
		НаборЗаписей = РегистрыСведений.ПрикрепленныеДанные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(ИсточникСсылка);
		НаборЗаписей.Отбор.ИмяФайла.Установить(ИмяФайла);
		НаборЗаписей.Отбор.Период.Установить(ДатаПрикрепления);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			
			СтрокаНабора = НаборЗаписей[0];		
		
			МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			МенеджерЗаписи.Данные = СтрокаНабора.Данные;
			МенеджерЗаписи.ИмяФайла =  ОбщийМодульСервер.ПолучитьИмяФайлаПрикрепленныхДанных(ПриемникСсылка, СтрокаНабора.ИмяФайла, СтрокаНабора.Расширение); //СтрокаНабора.ИмяФайла;
			МенеджерЗаписи.Расширение = СтрокаНабора.Расширение;
			МенеджерЗаписи.СсылкаНаОбъект = ПриемникСсылка;
			МенеджерЗаписи.Записать(Ложь);
			
		КонецЕсли;		
		
	Исключение
		Результат = Ложь;
		Сообщить(" " + ОписаниеОшибки());
	КонецПопытки;
	Возврат Результат;
	
КонецФункции

Процедура УдалитьФайлыВДереве(МассивФайловКУдалению) Экспорт
	
	Для каждого ЭлементМассива из МассивФайловКУдалению	Цикл
		МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЭлементМассива); 					
		Попытка
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Удалить();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;		
	КонецЦикла;
	
КонецПроцедуры

//Проверка монтажа по выбранным позициям заказ договора
Функция ПроверкаМонтажСоответствуетВыбраннымПозициямЗаказДоговора(Монтаж, ЗаказДоговор) Экспорт
	
	МассивРазличийЗД = Новый Массив;
	МассивРазличийМонтаж  = Новый Массив;
	
	СтруктураВозврата = Новый Структура("Результат, МассивРазличийЗД, МассивРазличийМонтаж, МассивЗД, МассивМонтаж", Истина, МассивРазличийЗД, МассивРазличийМонтаж);
	
	ТаблицаЗаказДоговора = ОбщийМодуль.ПустаяТаблицаДляСравненияЗаказов();	
	ТаблицаМотажа = ОбщийМодуль.ПустаяТаблицаДляСравненияЗаказов();
			
	//добавляем ТоварыУслуги Монтажа
	Для Каждого ТекущаяСтрока Из Монтаж.ТоварыУслуги Цикл
		НоваяСтрока = ТаблицаМотажа.Добавить();
		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура; 
		НоваяСтрока.Количество = ТекущаяСтрока.Количество;
		НоваяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
		НоваяСтрока.Спецификация = ТекущаяСтрока.Спецификация;
		НоваяСтрока.Коэффициент = ТекущаяСтрока.Коэффициент;
		НоваяСтрока.ПроцентРучнойСкидки = ТекущаяСтрока.ПроцентСкидки;
		НоваяСтрока.СуммаРучнойСкидки = ТекущаяСтрока.СуммаСкидки;
		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
		НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
		НоваяСтрока.УИСтроки = ТекущаяСтрока.УИСтроки;		
		НоваяСтрока.Назначение = "Товары и услуги";
	Конеццикла;
	
	//добавляем материалы Монтажа
	Для Каждого ТекущаяСтрока Из Монтаж.Материалы Цикл
		НоваяСтрока = ТаблицаМотажа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.Назначение = "Материалы";		
	КонецЦикла;
	
	//добавляем ТоварыУслуги Заказ-договора, которые присутствуют в монтаже
	Для Каждого ТекущаяСтрока Из ЗаказДоговор.ТоварыУслуги Цикл
		Если НЕ Монтаж.ТоварыУслуги.Найти(ТекущаяСтрока.УИСтроки, "УИСтроки") = Неопределено Тогда
			НоваяСтрока = ТаблицаЗаказДоговора.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Назначение = "Товары и услуги";
		КонецЕсли;		
	КонецЦикла;
	
	//добавляем материалы Заказ-договора, которые присутствуют в монтаже
	Для Каждого ТекущаяСтрока Из ЗаказДоговор.Материалы Цикл
		Если НЕ Монтаж.Материалы.Найти(ТекущаяСтрока.УИСтроки, "УИСтроки") = Неопределено Тогда
			НоваяСтрока = ТаблицаЗаказДоговора.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Назначение = "Материалы";
		КонецЕсли;
	КонецЦикла;
	
	//////////////////////////////
		
	//сравниваем полученные таблицы
	Для Каждого СтрокаМонтажа Из ТаблицаМотажа Цикл
		Если НЕ СтрокаМонтажа.Найдено Тогда
			Для Каждого СтрокаЗаказДоговора Из ТаблицаЗаказДоговора Цикл
				Если НЕ СтрокаЗаказДоговора.Найдено Тогда
					Если СтрокаМонтажа.Номенклатура = СтрокаЗаказДоговора.Номенклатура
						И СтрокаМонтажа.ХарактеристикаНоменклатуры = СтрокаЗаказДоговора.ХарактеристикаНоменклатуры 
						И СтрокаМонтажа.Количество = СтрокаЗаказДоговора.Количество
						И СтрокаМонтажа.ЕдиницаИзмерения = СтрокаЗаказДоговора.ЕдиницаИзмерения
						И СтрокаМонтажа.Коэффициент = СтрокаЗаказДоговора.Коэффициент
						И СтрокаМонтажа.ПроцентРучнойСкидки = СтрокаЗаказДоговора.ПроцентРучнойСкидки
						И СтрокаМонтажа.СуммаРучнойСкидки = СтрокаЗаказДоговора.СуммаРучнойСкидки
						И СтрокаМонтажа.Цена = СтрокаЗаказДоговора.Цена
						И СтрокаМонтажа.Сумма = СтрокаЗаказДоговора.Сумма
						И СтрокаМонтажа.КоличествоКВыработке = СтрокаЗаказДоговора.КоличествоКВыработке
						Тогда
						СтрокаМонтажа.Найдено = Истина;
						СтрокаЗаказДоговора.Найдено = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаМонтажа Из ТаблицаМотажа Цикл
		Если НЕ СтрокаМонтажа.Найдено Тогда
			// пустую структуру получаем каждый раз
			СтруктураКолонок = ОбщийМодуль.ПустаяСтруктураПоКолонкамТаблицыЗначений(ТаблицаМотажа.СкопироватьКолонки());
			ЗаполнитьЗначенияСвойств(СтруктураКолонок, СтрокаМонтажа);
			МассивРазличийМонтаж.Добавить(СтруктураКолонок);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаЗаказДоговора Из ТаблицаЗаказДоговора Цикл
		Если НЕ СтрокаЗаказДоговора.Найдено Тогда
			СтруктураКолонок = ОбщийМодуль.ПустаяСтруктураПоКолонкамТаблицыЗначений(ТаблицаЗаказДоговора.СкопироватьКолонки());
			ЗаполнитьЗначенияСвойств(СтруктураКолонок, СтрокаЗаказДоговора);
			МассивРазличийЗД.Добавить(СтруктураКолонок);
		КонецЕсли;
	КонецЦикла;
	СтруктураВозврата.МассивРазличийМонтаж = МассивРазличийМонтаж;
	СтруктураВозврата.МассивРазличийЗД  = МассивРазличийЗД;
	СтруктураВозврата.МассивМонтаж = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаМотажа);
	СтруктураВозврата.МассивЗД  = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗаказДоговора);
	
	ТаблицаМотажа.Свернуть("Найдено");
	ТаблицаЗаказДоговора.Свернуть("Найдено");
	
	Для Каждого ТекСтрока Из ТаблицаМотажа Цикл
		Если НЕ ТекСтрока.Найдено Тогда
			СтруктураВозврата.Результат = Ложь;
		КонецЕсли;
	КонецЦИкла;
	Для Каждого ТекСтрока Из ТаблицаЗаказДоговора Цикл
		Если НЕ ТекСтрока.Найдено Тогда
			СтруктураВозврата.Результат = Ложь;
		КонецЕсли;
	КонецЦИкла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

//Скидки по виду скидки
Функция ПолучитьСкидкуПоВидуСкидки(ВидСкидки) Экспорт	
	Возврат ВидСкидки.Процент;	
КонецФункции

Функция ПолучитьДанныеБлокировки(ИнформацияОбОшибке)
	
	Результат  = Новый Структура("ВремяНачалаБлокировки,ИмяПользователяЗаблокировавшегоДок,ЗаблокированВТекущемСеансе");
	СистемИнфо = Новый СистемнаяИнформация;
	ВерсияПлатформы = СистемИнфо.ВерсияПриложения;
	ИмяПользователяЗаблокировавшегоДок = "";
	ВремяНачалаБлокировки = "";
	ЗаблокированВТекущемСеансе = Ложь;
	АктивныеСеансы = ПолучитьСеансыИнформационнойБазы();
	//НомерТекущегоСеансаСтрокой = Строка(НомерСеансаИнформационнойБазы());

	//++ №7388 закомментировано, т.к. в пределах одной версии платформы может быть разный формат ошибки
	//Если Найти(ВерсияПлатформы, "8.3.10.") <> 0 
	//	ИЛИ Найти(ВерсияПлатформы, "8.3.11.") <> 0 
	//	ИЛИ Найти(ВерсияПлатформы, "8.3.12.") <> 0 
	//	ИЛИ Найти(ВерсияПлатформы, "8.3.13.") <> 0 Тогда // 8.3.13.1644 возвращает в таком виде			
	//-- №7388 закомментировано
	
	// №7388 новая логика получения данных из ошибки
	Ошибка = ИнформацияОбОшибке.Причина.Описание;
	Если Найти(Ошибка, "сеанс") > 0 Тогда
		ОбрезанаОшибка = Сред(Ошибка, Найти(Ошибка, "сеанс:")+6);
		НомерСеансаСтрокой = Сред(ОбрезанаОшибка, 0 , Найти(ОбрезанаОшибка,", начат:")-1);
	Иначе
		НомерСеансаСтрокой = Сред(Ошибка, СтрНайти(Ошибка, ", ", НаправлениеПоиска.СКонца)+2);
	КонецЕсли;
	
	//НомерСеанса = Число(Сред(ОбрезанаОшибка, 0 , Найти(ОбрезанаОшибка,", начат:")-1));
	
	Попытка
		НомерСеанса = Число(НомерСеансаСтрокой);
	Исключение
		НомерСеанса = 0;
	КонецПопытки;
	
	Если НомерСеанса <> НомерСеансаИнформационнойБазы() Тогда
		
		Для Каждого Элемент Из АктивныеСеансы Цикл
			Если Элемент.НомерСеанса = НомерСеанса Тогда
				ИмяПользователяЗаблокировавшегоДок = Элемент.Пользователь.ПолноеИмя;
				ВремяНачалаБлокировки = Сред(ОбрезанаОшибка, Найти(ОбрезанаОшибка,", начат:"));
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЗаблокированВТекущемСеансе = Истина;
	КонецЕсли;		
		
	//++ №7388 закомментировано, т.к. в пределах одной версии платформы может быть разный формат ошибки	
	//Иначе // для платформ выше в ОписаниеОшибки строка в формате "Компьютер, Пользователь, НомерСеанса"		
	//	Если Найти(Ошибка, НомерТекущегоСеансаСтрокой) = 0 Тогда
	//		Для Каждого Элемент Из АктивныеСеансы Цикл
	//			Если Найти(Ошибка, Строка(Элемент.НомерСеанса)) <> 0 Тогда
	//				ИмяПользователяЗаблокировавшегоДок = Элемент.Пользователь.ПолноеИмя;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//	Иначе
	//		ЗаблокированВТекущемСеансе = Истина;
	//	КонецЕсли;	
	//КонецЕсли;
	//-- №7388 закомментировано
	
	Результат.ВремяНачалаБлокировки = ВремяНачалаБлокировки;
	Результат.ИмяПользователяЗаблокировавшегоДок = ИмяПользователяЗаблокировавшегоДок;
	Результат.ЗаблокированВТекущемСеансе = ЗаблокированВТекущемСеансе;
	
	Возврат Результат;	

КонецФункции
		
//блокировки документов для запрета одновременного создания на основании
Процедура ЗаблокироватьОбъектДляРедактирования(Знач Ссылка, Знач Форма, ГруппаЭлементовСоздатьНаОсновании=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Ссылка,, Форма.УникальныйИдентификатор);
	Исключение
		Ошибка = ИнформацияОбОшибке(); // №7388 было ОписаниеОшибки();
		ДанныеБлокировки = ПолучитьДанныеБлокировки(Ошибка);
				
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Лид") Тогда
			Сообщить("Внимание! Форма данного лида так же открыта у пользователя: " + ДанныеБлокировки.ИмяПользователяЗаблокировавшегоДок + ДанныеБлокировки.ВремяНачалаБлокировки+ "
				|Сохранение документа может привести к потере несохранненых этим пользователем данных.");			
		Иначе
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
				Форма.ТолькоПросмотр = Истина;
			КонецЕсли;
			Сообщить("Объект заблокирован пользователем: " + ДанныеБлокировки.ИмяПользователяЗаблокировавшегоДок + ДанныеБлокировки.ВремяНачалаБлокировки);
		КонецЕсли;
				
		Если НЕ ГруппаЭлементовСоздатьНаОсновании = Неопределено И НЕ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ГруппаЭлементовСоздатьНаОсновании.Доступность = Ложь;
		КонецЕсли;	
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПроверкаОбъектЗаблокирован(Знач Ссылка) Экспорт
	
	СтруктураПроверки = новый Структура;
	СтруктураПроверки.Вставить("Заблокирован", Ложь);
	СтруктураПроверки.Вставить("ЗаблокированВТекущемСеансе", Ложь);
	СтруктураПроверки.Вставить("ПользовательИДата", "");	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Ссылка);
	Исключение
		Ошибка = ИнформацияОбОшибке(); // №7388 было ОписаниеОшибки();
		ДанныеБлокировки = ПолучитьДанныеБлокировки(Ошибка);
		
		СтруктураПроверки.Вставить("Заблокирован", Истина);
		СтруктураПроверки.Вставить("ЗаблокированВТекущемСеансе", ДанныеБлокировки.ЗаблокированВТекущемСеансе);
		СтруктураПроверки.Вставить("ПользовательИДата", ДанныеБлокировки.ИмяПользователяЗаблокировавшегоДок + ДанныеБлокировки.ВремяНачалаБлокировки);		
		
	КонецПопытки;
	Попытка
		РазблокироватьДанныеДляРедактирования(Ссылка);
	Исключение
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураПроверки;
	
КонецФункции	

Функция ПолучитьКонтрагентаПоНомеруТелефона(мНомерТелефона) Экспорт
	
	КВозврату = Справочники.Контрагенты.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(мНомерТелефона) Тогда
		Возврат КВозврату;
	КонецЕсли;
	мНомерТелефона = СофтФон.ОставитьТолькоЦифры(мНомерТелефона);		
	НомерТелефона = Прав(мНомерТелефона, СтрДлина(мНомерТелефона)-1);
	
	Если ПустаяСтрока(НомерТелефона) Тогда
		Возврат КВозврату;
	КонецЕсли;

	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   КонтактнаяИнформация.Ссылка
	|ИЗ 
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|   КонтактнаяИнформация.НомерТелефона ПОДОБНО &НомерТелефона
	|   И НЕ КонтактнаяИнформация.Ссылка.ПометкаУдаления
	|";
	Запрос.УстановитьПараметр("НомерТелефона", "%"+НомерТелефона);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КВозврату = Выборка.Ссылка;		
	КонецЕсли;
	
	Возврат КВозврату;
	
КонецФункции

Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);

КонецФункции

Функция ПолучитьТелефонИзКонтактнойИнформации(Объект, ДополнительнаяКИ = Ложь) Экспорт
	
	Если ДополнительнаяКИ Тогда
		Возврат УправлениеКонтактнойИнформациейПотолки.ПолучитьТелефонИзКонтактнойИнформацииОбъекта(Объект, Истина);
	Иначе
		Возврат ОбщийМодульСервер.ПолучитьТелефонИзКонтактнойИнформации(Объект);
	КонецЕсли;

КонецФункции
	
Функция ОбъектПомеченНаУдаление(Объект) Экспорт	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ПометкаУдаления");
КонецФункции

Функция ПолучитьСтруктуруУведомлений() Экспорт 
	
	СтруктураВозврата = Новый Структура;
	ПоказыватьУведомлениеОРезервномКопировании 		= ПоказыватьУведомлениеОРезервномКопировании();
	ПоказыватьУведомлениеОЗапускеЭкспрессПроверки 	= ПоказыватьУведомлениеОЗапускеЭкспрессПроверки();
	//#7399
	ПоказыватьУведомлениеОбОбработкеПослеОбновления = ПоказыватьУведомлениеОбОбработкеПослеОбновления();
	//ОтветПоказыватьУведомлениеОПроверкеПубликацииДляМобильногоКлиента = ПоказыватьУведомлениеОПроверкеПубликацииДляМобильногоКлиента();
	
	// №9396
	ПоказыватьУведомлениеОПревышенииОбъемаПрикрепленныхДанных = ПоказыватьУведомлениеОПревышенииОбъемаПрикрепленныхДанных();
	
	//#10449
	ПоказыватьУведомлениеПоСервисам = ПоказыватьУведомлениеПоСервисам();
	
	ТребуетсяУведомление = ПоказыватьУведомлениеОРезервномКопировании                                          // дополнять при новых событиях
							ИЛИ ПоказыватьУведомлениеОЗапускеЭкспрессПроверки
							ИЛИ ПоказыватьУведомлениеОбОбработкеПослеОбновления
							//ИЛИ ОтветПоказыватьУведомлениеОПроверкеПубликацииДляМобильногоКлиента.Показывать; 
							ИЛИ ПоказыватьУведомлениеОПревышенииОбъемаПрикрепленныхДанных
							ИЛИ ПоказыватьУведомлениеПоСервисам;
	
	СтруктураВозврата.Вставить("ПоказыватьУведомлениеОРезервномКопировании", ПоказыватьУведомлениеОРезервномКопировании);
	СтруктураВозврата.Вставить("ПоказыватьУведомлениеОЗапускеЭкспрессПроверки", ПоказыватьУведомлениеОЗапускеЭкспрессПроверки);
	СтруктураВозврата.Вставить("ПоказыватьУведомлениеОбОбработкеПослеОбновления", ПоказыватьУведомлениеОбОбработкеПослеОбновления);
	//СтруктураВозврата.Вставить("ПоказатьСостояниеПубликацииДляМобильногоКлиента", ОтветПоказыватьУведомлениеОПроверкеПубликацииДляМобильногоКлиента.Показывать);
	//СтруктураВозврата.Вставить("РезультатПроверкиМобильногоКлиента", ОтветПоказыватьУведомлениеОПроверкеПубликацииДляМобильногоКлиента.РезультатПроверкиМобильногоКлиента);
	СтруктураВозврата.Вставить("ПоказыватьУведомлениеОПревышенииОбъемаПрикрепленныхДанных", ПоказыватьУведомлениеОПревышенииОбъемаПрикрепленныхДанных);
	СтруктураВозврата.Вставить("ПоказыватьУведомлениеПоСервисам", ПоказыватьУведомлениеПоСервисам);
	СтруктураВозврата.Вставить("ТребуетсяУведомление", ТребуетсяУведомление);
	
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПоказыватьУведомлениеОРезервномКопировании()
	
	Если НЕ РольДоступна("АдминистраторСистемы") И НЕ РольДоступна("ПолныеПрава") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РезультатПроверки = ОбщийМодуль.ОпределитьМассивПеременныхСеанса();
	Если РезультатПроверки.Коробка = 1 Тогда
		//не коробка
		Возврат Ложь;
	КонецЕсли;
	
	ПоказыватьУведомление = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УведомлениеОРезервномКопировании.НеПоказывать КАК НеПоказывать
	|ИЗ
	|	РегистрСведений.УведомлениеОРезервномКопировании КАК УведомлениеОРезервномКопировании
	|ГДЕ
	|	УведомлениеОРезервномКопировании.Версия = &Версия
	|	И УведомлениеОРезервномКопировании.Пользователь = &Пользователь
	|	И УведомлениеОРезервномКопировании.НеПоказывать";
	
	Запрос.УстановитьПараметр("Версия", ОбщийМодуль.ПолучитьВерсиюКонфигурации());
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПоказыватьУведомление = Ложь;
	КонецЕсли;
	
	Возврат ПоказыватьУведомление;
	
КонецФункции

Функция ПоказыватьУведомлениеОЗапускеЭкспрессПроверки()
	//nva+++ надоело - отключил
	Возврат Ложь;
	//nva---
	Если НЕ РольДоступна("АдминистраторСистемы") И НЕ РольДоступна("ПолныеПрава") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДатаЗапуска = ОбщийМодульСервер.ПолучитьДатуПоследнегоЗапускаОтчетаЭкспрессПроверки();
	// если в регистре нет ни одной записи, то зафиксируем точку отчета как текущее время
	Если ДатаЗапуска = Дата(1,1,1) Тогда
		ОбщийМодульСервер.ОтметитьЗапускОтчетаЭкспрессПроверки();
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекущаяДатаСеанса() - ДатаЗапуска > 86400*7 Тогда
		Возврат Истина;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПоказыватьУведомлениеОПревышенииОбъемаПрикрепленныхДанных()
	
	СтруктураПрикрепленныхДанных = ОбщийМодуль.ПолучитьСтруктуруПрикрепленныхДанных();
	
	Возврат СтруктураПрикрепленныхДанных.ОбъемПредупреждение ИЛИ СтруктураПрикрепленныхДанных.ОбъемПревышен;
	
КонецФункции

Функция ПоказыватьУведомлениеПоСервисам()
	
	Если НЕ РольДоступна("АдминистраторСистемы") И НЕ РольДоступна("ПолныеПрава") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОбщийМодульСервер.ИспользуютсяРасширенныеСервисы();
	
КонецФункции

//Функция ПоказыватьУведомлениеОПроверкеПубликацииДляМобильногоКлиента()
//	
//	СтруктураОтвета = Новый Структура;
//	СтруктураОтвета.Вставить("Показывать",Ложь);
//	СтруктураОтвета.Вставить("РезультатПроверкиМобильногоКлиента", "");
//	
//	Если РольДоступна("АдминистраторСистемы") Тогда
//	
//		РезультатПроверки = МобильныйКлиент.ПроверитьПубликациюБазы();
//		Если    (РезультатПроверки.МобильныйЗамерщик_ПроверкаТребуется  И НЕ РезультатПроверки.МобильныйЗамерщик_Результат)
//			ИЛИ (РезультатПроверки.МобильныйМонтажник_ПроверкаТребуется И НЕ РезультатПроверки.МобильныйМонтажник_Результат)
//			ИЛИ	(РезультатПроверки.ПроверкаПотолка_ПроверкаТребуется    И НЕ РезультатПроверки.ПроверкаПотолка_Результат)
//			Тогда
//				
//			СтруктураОтвета.Вставить("Показывать", Истина);
//			СтруктураОтвета.Вставить("РезультатПроверкиМобильногоКлиента", РезультатПроверки);
//				
//		Иначе				
//			СтруктураОтвета.Вставить("Показывать", Ложь);
//				
//		КонецЕсли;
//	
//	Иначе	
//		СтруктураОтвета.Вставить("Показывать",Ложь);
//	
//	КонецЕсли;
//		
//	Возврат СтруктураОтвета;
//	
//КонецФункции

Функция ПоказыватьУведомлениеОбОбработкеПослеОбновления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы КАК ВерсияПрограммы
	|ИЗ
	|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые КАК ОбъектыКОбработкеПослеОбновленияРекомендуемые";
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Процедура УстановитьСрокиНеНапоминатьОЗавершенииТехПоддержки(Дней) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.ДатыНеНапоминатьОТехническойПоддержке.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();		
		МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
		МенеджерЗаписи.НеУведомлятьДо = ТекущаяДатаСеанса() + (Дней * 86400);
		МенеджерЗаписи.Записать(Истина);
		
	Исключение		
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПроверитьСрокиНеНапоминатьОЗавершенииТехПоддержки() Экспорт
	
	// Истина - нужно напомнить
	// Ложь - установлена острочка на напоминание
	КВозврату = Истина;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыНеНапоминатьОТехническойПоддержке.Пользователь,
		|	ДатыНеНапоминатьОТехническойПоддержке.НеУведомлятьДо
		|ИЗ
		|   РегистрСведений.ДатыНеНапоминатьОТехническойПоддержке КАК ДатыНеНапоминатьОТехническойПоддержке
		|ГДЕ
		|	ДатыНеНапоминатьОТехническойПоддержке.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КВозврату = (Выборка.НеУведомлятьДо < ТекущаяДатаСеанса());
	КонецЕсли;
	
	Возврат КВозврату;
	
КонецФункции

Функция ЭтоЗаказИнтеркампаниСОднойОрганизацией(СсылкаЗаказПокупателя) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, ТекстОшибки", Ложь, "");
	
	Если ЗначениеЗаполнено(СсылкаЗаказПокупателя.НастройкаИнтеркампани) Тогда
		Если СсылкаЗаказПокупателя.НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
			ТекстОшибки = "%Документ% оформлен по настройке интеркампани, которая не подразумевает необходимость создания документа реализации. Реализация не создана";
			СтруктураВозврата.ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", СсылкаЗаказПокупателя);
			СтруктураВозврата.Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьРеализациюПоЗаказу(ЗаказСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейОбороты.Регистратор.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Регистратор, ЗаказНаПроизводство = &Заказ) КАК ЗаказыПокупателейОбороты
	|ГДЕ
	|	ЗаказыПокупателейОбороты.КоличествоРасход > 0";
	Запрос.УстановитьПараметр("Заказ", ЗаказСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьОсновнуюСпецификациюНоменклатуры(Номенклатура, ВидСпецификации) Экспорт
	
	//#12667 переделано с учетом ВидСпецификации
	//Возврат Номенклатура.ОсновнаяСпецификация;
	
	Результат = Справочники.Спецификации.ПустаяСсылка();
	НеобходимыеРеквизиты = "ОсновнаяСпецификация, ОсновнаяСпецификацияКомплектация, ОсновнаяСпецификацияСопутствующиеМатериалы";
	ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, НеобходимыеРеквизиты);
	Если ВидСпецификации = Перечисления.ВидыСпецификации.СпецификацияПродукции Тогда
		Результат = ДанныеНоменклатуры.ОсновнаяСпецификация;
	ИначеЕсли ВидСпецификации = Перечисления.ВидыСпецификации.СопутствующиеМатериалы Тогда
		Результат = ДанныеНоменклатуры.ОсновнаяСпецификацияСопутствующиеМатериалы;
	ИначеЕсли ВидСпецификации = Перечисления.ВидыСпецификации.Комплектация Тогда
		Результат = ДанныеНоменклатуры.ОсновнаяСпецификацияКомплектация;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ВидСпецификацииРезультата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат, "ВидСпецификации");
		Если НЕ ВидСпецификацииРезультата = ВидСпецификации Тогда
			Результат = Справочники.Спецификации.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные) Экспорт
	
	НеобходимыеРеквизиты = "БазоваяЕдиницаИзмерения, СтатьяДоходов, СтатьяРасходов, 
							|ВидНоменклатуры, 
							|Потолок_ПериметрПомещения, Потолок_КоличествоВыработка, УчитыватьКакПотолокВОтчетахПоЭффективности,
							|Потолок_НомерРасчета, Потолок_ИндексПотолка,
							|СтавкаНДС"; //nva
	ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанные.Номенклатура, НеобходимыеРеквизиты);
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", ДанныеНоменклатуры.БазоваяЕдиницаИзмерения);
	СтруктураДанные.Вставить("Коэффициент", 1);
	СтруктураДанные.Вставить("ВидНоменклатуры", ДанныеНоменклатуры.ВидНоменклатуры);
	СтруктураДанные.Вставить("ПериметрПомещения", ДанныеНоменклатуры.Потолок_ПериметрПомещения);
	СтруктураДанные.Вставить("НомерРасчета", ДанныеНоменклатуры.Потолок_НомерРасчета);
	СтруктураДанные.Вставить("ИндексПотолка", ДанныеНоменклатуры.Потолок_ИндексПотолка);
	СтруктураДанные.Вставить("СтавкаНДС", ДанныеНоменклатуры.СтавкаНДС); //nva

	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедениеУчетаДоходовРасходовПострочно") Тогда
		СтруктураДанные.Вставить("СтатьяДоходов",  ДанныеНоменклатуры.СтатьяДоходов);	
		СтруктураДанные.Вставить("СтатьяРасходов", ДанныеНоменклатуры.СтатьяРасходов);
	Иначе
		СтруктураДанные.Вставить("СтатьяДоходов",  Справочники.СтатьиДоходовИРасходов.ПустаяСсылка());	
		СтруктураДанные.Вставить("СтатьяРасходов", Справочники.СтатьиДоходовИРасходов.ПустаяСсылка());
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ВидСпецификации") Тогда
		ОсновнаяСпецификация = ПолучитьОсновнуюСпецификациюНоменклатуры(СтруктураДанные.Номенклатура, СтруктураДанные.ВидСпецификации);
		СтруктураДанные.Вставить("Спецификация", ОсновнаяСпецификация);
	КонецЕсли;
	
	СтруктураДанные.Вставить("Потолок_КоличествоВыработка", ДанныеНоменклатуры.Потолок_КоличествоВыработка);
	
	СтруктураДанные.Вставить("УчитыватьКакПотолок", ДанныеНоменклатуры.УчитыватьКакПотолокВОтчетахПоЭффективности); // №14690
	
	Возврат СтруктураДанные;
	
КонецФункции

Функция ИспользуютсяХарактеристикиНоменклатуры(Номенклатура) Экспорт
	Возврат Справочники.Номенклатура.ИспользуютсяХарактеристикиНоменклатуры(Номенклатура);
КонецФункции

Функция КоличествоНоменклатурыПоПризнакуПотолка(Номенклатура) Экспорт
	
	Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(Номенклатура) Тогда
		Возврат Номенклатура.Потолок_КоличествоПродукция;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

Функция ЗапретРедактированияЦен() Экспорт
	Возврат ОбщийМодульСервер.НастройкаПользователя("ДополнительныеПраваЗапретРедактированияЦенВДокументах");	
КонецФункции

Функция ЗапретПримененияСкидок() Экспорт
	Возврат ОбщийМодульСервер.НастройкаПользователя("ДополнительныеПраваЗапретПримененияСкидок");	
КонецФункции

Функция ЗаписьJSONВСтруктуру(Знач СтруктураЗначений) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураЗначений);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ЧтениеJSONВСтруктуру(Знач СтруктураВСтроке, ВернутьСоответствие = Истина) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтруктураВСтроке);
	
	Возврат ПрочитатьJSON(ЧтениеJSON, ВернутьСоответствие);

КонецФункции

// Возвращает структуру с данными отбора для журнала регистрации.
//
Функция ДанныеОтбораЖурналаРегистрации(УзелИнформационнойБазы, Знач ДействиеПриОбмене) Экспорт
	
	Если ТипЗнч(ДействиеПриОбмене) = Тип("Строка") Тогда
		
		ДействиеПриОбмене = Перечисления.ДействияПриОбмене[ДействиеПриОбмене];
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СостоянияОбменовДанными = ОбменДаннымиСервер.СостоянияОбменовДанными(УзелИнформационнойБазы, ДействиеПриОбмене);
	
	Отбор = Новый Структура;
	Отбор.Вставить("СобытиеЖурналаРегистрации", ОбменДаннымиСервер.КлючСообщенияЖурналаРегистрации(УзелИнформационнойБазы, ДействиеПриОбмене));
	Отбор.Вставить("ДатаНачала",                СостоянияОбменовДанными.ДатаНачала);
	Отбор.Вставить("ДатаОкончания",             СостоянияОбменовДанными.ДатаОкончания);
	
	Возврат Отбор;
	
КонецФункции

#Область Штрихкодирование

Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт

	Четн   = 0;
	Нечетн = 0;

	КоличествоИтераций = ?(Тип = 13, 6, 4);

	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) и (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;

	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;

	КонтЦифра = 10 - (Четн + Нечетн) % 10;

	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));

КонецФункции

Функция ПолучитьШтрихКодНаПечать(ТипШтрихкода, ЗначениеШтрихкода, ЗаголовокШтрихкода) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("ШтрихкодЭталон");

	Штрихкод = ЗначениеШтрихкода;
	ТипКодаЧислом = 1;
	Если ТипШтрихкода = Перечисления.ТипыШтрихкодов.EAN13 Тогда
		ТипКодаЧислом = 1;
		//Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
		Если НЕ СтрДлина(Штрихкод) = 13 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Наименование = "Некорректный штрихкод EAN13";
			ТабличныйДокумент.Вывести(ОбластьМакета);
			Возврат ТабличныйДокумент;
		КонецЕсли;
	ИначеЕсли ТипШтрихкода = Перечисления.ТипыШтрихкодов.Code39 Тогда
		ТипКодаЧислом = 3;
	ИначеЕсли ТипШтрихкода = Перечисления.ТипыШтрихкодов.Code128 Тогда
		ТипКодаЧислом = 4;
	ИначеЕсли ТипШтрихкода = Перечисления.ТипыШтрихкодов.QR Тогда
		ТипКодаЧислом = 16;
	КонецЕсли;	
	
	Если НЕ ПустаяСтрока(ЗаголовокШтрихкода) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Наименование = ЗаголовокШтрихкода;
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШК");
	ИмяКартинкиШтрихкода = "КартинкаШтрихкода";
	Если ТипШтрихкода = Перечисления.ТипыШтрихкодов.QR Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ШК_QR");
		ИмяКартинкиШтрихкода = "КартинкаШтрихкодаQR";
	КонецЕсли;
	
	КоличествоМиллиметровВПикселе = 0.16;
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",          Окр(ОбластьМакета.Рисунки[ИмяКартинкиШтрихкода].Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",          Окр(ОбластьМакета.Рисунки[ИмяКартинкиШтрихкода].Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",        Штрихкод);
	ПараметрыШтрихкода.Вставить("ТипКода",         ТипКодаЧислом);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    14);
	
	ОбластьМакета.Рисунки[ИмяКартинкиШтрихкода].Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

Функция ПолучитьНастройкиХраненияЗаписейАТС() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыХраненияИсторииЗвонковАТС.ВариантДоступаКЗаписям КАК ВариантДоступаКЗаписям,
		|	ВариантыХраненияИсторииЗвонковАТС.ЗаписиСтрокаЗапроса КАК ЗаписиСтрокаЗапроса,
		|	ВариантыХраненияИсторииЗвонковАТС.ЗаписиНачальныйКаталог КАК ЗаписиНачальныйКаталог,
		|	ВариантыХраненияИсторииЗвонковАТС.ЗаписиФорматИерархииПапок КАК ЗаписиФорматИерархииПапок,
		|	ВариантыХраненияИсторииЗвонковАТС.ЗаписиХост КАК ЗаписиХост,
		|	ВариантыХраненияИсторииЗвонковАТС.ЗаписиПорт КАК ЗаписиПорт,
		|	ВариантыХраненияИсторииЗвонковАТС.ЗаписиЛогин КАК ЗаписиЛогин,
		|	ВариантыХраненияИсторииЗвонковАТС.ЗаписиПароль КАК ЗаписиПароль,
		|	ВЫБОР КОГДА ВариантыХраненияИсторииЗвонковАТС.РежимFTP = 0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК РежимFTPПассивный
		|ИЗ
		|	Справочник.ВариантыХраненияИсторииЗвонковАТС КАК ВариантыХраненияИсторииЗвонковАТС
		|ГДЕ
		|	ВариантыХраненияИсторииЗвонковАТС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Константы.ВариантХраненияИсторииЗвонковAsterisk.Получить());	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураНастроекПолученияЗаписей = Новый Структура("ВариантДоступаКЗаписям, ЗаписиСтрокаЗапроса, ЗаписиНачальныйКаталог, ЗаписиХост, ЗаписиПорт, ЗаписиЛогин, ЗаписиПароль, РежимFTPПассивный");
		
	Если Выборка.Следующий() Тогда		
		ЗаполнитьЗначенияСвойств(СтруктураНастроекПолученияЗаписей, Выборка);
	КонецЕсли;
	
	Возврат СтруктураНастроекПолученияЗаписей;
	
КонецФункции


#Область ПроцедурыИФункцииРМК

// Получает последний порядковый номер документа (чека) для КассыККМ.
//
// Параметры:
//  Ссылка - ДокументСсылка.ЧекККМ - ссылка на документ для получения номера.
// 
// Возвращаемое значение:
//  Число - номер последнего документа.
//
Функция ПоследнийНомерДокументаКассыККМ(КассаККМ) Экспорт

	Запрос = Новый Запрос("
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЕСТЬNULL(МАКСИМУМ(ОплатаОтПокупателяПлатежнойКартой.НомерЧекаККМ), 0) КАК НомерЧекаККМ
	//|ПОМЕСТИТЬ ТаблицаПоследнихДокументов
	//|ИЗ
	//|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
	//|ГДЕ
	//|	ОплатаОтПокупателяПлатежнойКартой.КассаККМ = &КассаККМ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(МАКСИМУМ(ПриходныйКассовыйОрдер.НомерЧекаККМ), 0)
	//|ИЗ
	//|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	//|ГДЕ
	//|	ПриходныйКассовыйОрдер.КассаККМ = &КассаККМ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(МАКСИМУМ(РасходныйКассовыйОрдер.НомерЧекаККМ), 0)
	//|ИЗ
	//|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	//|ГДЕ
	//|	РасходныйКассовыйОрдер.КассаККМ = &КассаККМ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(МАКСИМУМ(ЧекККМ.НомерЧекаККМ), 0) КАК НомерЧекаККМ
	|ПОМЕСТИТЬ ТаблицаПоследнихДокументов
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.КассаККМ = &КассаККМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ТаблицаПоследнихДокументов.НомерЧекаККМ), 0) КАК НомерЧекаККМ
	|ПОМЕСТИТЬ ТаблицаПоследнихНомеров
	|ИЗ
	|	ТаблицаПоследнихДокументов КАК ТаблицаПоследнихДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПоследнихНомеров.НомерЧекаККМ КАК НомерЧекаККМ
	|ИЗ
	|	ТаблицаПоследнихНомеров КАК ТаблицаПоследнихНомеров
	|ГДЕ
	|	ТаблицаПоследнихНомеров.НомерЧекаККМ <> 0
	|");
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НомерЧекаККМ = Выборка.НомерЧекаККМ + 1;
		КонецЦикла; 
	КонецЕсли; 

	Возврат НомерЧекаККМ;
	
КонецФункции

//++ №9147
// Получает параметры кассы ККМ.
//
// Параметры:
//  КассаККМ - СправочникСсылка.КассыККМ - касса ККМ по которой необходимо получить параметры.
//
// Возвращаемое значение:
//  Структура - параметры кассы ККМ.
// 
Функция ПараметрыКассыККМ(КассаККМ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассыККМ.ПодключаемоеОборудование КАК ИдентификаторУстройства,
	|	КассыККМ.Магазин КАК Магазин,
	|	КассыККМ.Владелец КАК Организация,
	|	КассыККМ.ИспользоватьБезПодключенияОборудования КАК ИспользоватьБезПодключенияОборудования
	//|	КассыККМ.НастройкаРаспределенияВыручкиПоСекциям,
	//|	КассыККМ.ЭлектронныйЧекSMSПередаютсяПрограммой1С,
	//|	КассыККМ.ЭлектронныйЧекEmailПередаютсяПрограммой1С
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", КассаККМ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Новый Структура("ИдентификаторУстройства,
								|Магазин,
								|Организация,
								|ИспользоватьБезПодключенияОборудования",
								//|РаспределениеВыручкиПоСекциям,
								//|ЭлектронныйЧекSMSПередаютсяПрограммой1С,
								//|ЭлектронныйЧекEmailПередаютсяПрограммой1С",
								Выборка.ИдентификаторУстройства,
								Выборка.Магазин,
								Выборка.Организация,
								Выборка.ИспользоватьБезПодключенияОборудования
								//ПодключаемоеОборудованиеРТВызовСервера.РаспределениеВыручкиПоСекциям(Выборка.НастройкаРаспределенияВыручкиПоСекциям),
								//Выборка.ЭлектронныйЧекSMSПередаютсяПрограммой1С,
								//Выборка.ЭлектронныйЧекEmailПередаютсяПрограммой1С
				);
		
	Иначе
		
		Возврат Новый Структура("ИдентификаторУстройства,
								|Магазин,
								|Организация,
								|ИспользоватьБезПодключенияОборудования",
								//|РаспределениеВыручкиПоСекциям,
								//|ЭлектронныйЧекSMSПередаютсяПрограммой1С,
								//|ЭлектронныйЧекEmailПередаютсяПрограммой1С",
								Справочники.ПодключаемоеОборудование.ПустаяСсылка(),
								Справочники.Магазины.ПустаяСсылка(),
								Справочники.Организации.ПустаяСсылка(),
								Истина
								//ПодключаемоеОборудованиеРТВызовСервера.РаспределениеВыручкиПоСекциям(Неопределено),
								//Ложь,
								//Ложь
				);
		
	КонецЕсли;
	
КонецФункции // ПараметрыКассыККМ()

// Получает параметры ЭТ.
//
// Параметры:
//  ЭквайринговыйТерминал - СправочникСсылка.ЭквайринговыйТерминалы - ЭТ по которому необходимо получить параметры.
//
// Возвращаемое значение:
//  Структура - параметры ЭТ.
//
Функция ПараметрыЭТ(ЭквайринговыйТерминал) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭквайринговыеТерминалы.ПодключаемоеОборудование КАК ИдентификаторУстройства,
		|	ЭквайринговыеТерминалы.ИспользоватьБезПодключенияОборудования КАК ИспользоватьБезПодключенияОборудования
		|ИЗ
		|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
		|ГДЕ
		|	ЭквайринговыеТерминалы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭквайринговыйТерминал);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Новый Структура("ПодключаемоеОборудование,
								|ИспользоватьБезПодключенияОборудования",
								Выборка.ИдентификаторУстройства,
								Выборка.ИспользоватьБезПодключенияОборудования
				);
		
	Иначе
		
		Возврат Новый Структура("ПодключаемоеОборудование,
								|ИспользоватьБезПодключенияОборудования",
								Справочники.ПодключаемоеОборудование.ПустаяСсылка(),
								Истина
				);
		
	КонецЕсли;
	
КонецФункции
//-- №9147

#КонецОбласти

#Область РаботаСЗаказДоговоромИПредварительнымРасчетом

Функция Розница_ПолучитьНаименованиеНовойКомнаты(МассивКомнат, НазваниеНовойКомнаты) Экспорт
	
	ТаблицаНомеров = Новый ТаблицаЗначений;
	ТаблицаНомеров.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число"));	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НазваниеКомнат.Наименование КАК НазКомнаты
	|ИЗ
	|	Справочник.НазваниеКомнат КАК НазваниеКомнат";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Для Каждого Комната Из МассивКомнат Цикл
		НоваяСтрока = ТаблицаНомеров.Добавить();
		Попытка
			//#14049 если в названии комнат есть фраза "Комната", то ломается нумерация, данная замена перенесена ниже: сначала убираем названия из справочника
			//СтрокаЗамены = СтрЗаменить(Комната, "Комната ", "");
			СтрокаЗамены = Комната;
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл
				Если Найти(СтрокаЗамены, Выборка.НазКомнаты) Тогда
					СтрокаЗамены = СтрЗаменить(СтрокаЗамены, " - " + Выборка.НазКомнаты, "");
					СтрокаЗамены = СтрЗаменить(СтрокаЗамены, Выборка.НазКомнаты, "");
					СтрокаЗамены = СтрЗаменить(СтрокаЗамены, " ", "");
				КонецЕсли;
			КонецЦикла;
			СтрокаЗамены = СтрЗаменить(СтрокаЗамены, "Комната", "");			
			 
			НоваяСтрока.Номер = Число(СтрокаЗамены);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ТаблицаНомеров.Свернуть("Номер");
	ТаблицаНомеров.Сортировать("Номер Убыв");
	
	Если НЕ НазваниеНовойКомнаты = Неопределено Тогда
		Если ТаблицаНомеров.Количество() > 0 Тогда
			Возврат "Комната " + СтрЗаменить(Строка(ТаблицаНомеров[0].Номер+1), Символ(160), "") + " - " + НазваниеНовойКомнаты;
		Иначе
			Возврат "Комната 1" + " - " + НазваниеНовойКомнаты;
		КонецЕсли;
	Иначе
		Если ТаблицаНомеров.Количество() > 0 Тогда
			Возврат "Комната " + СтрЗаменить(Строка(ТаблицаНомеров[0].Номер+1), Символ(160), "");
		Иначе
			Возврат "Комната 1";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Выработка

Процедура РучнаяКорректировкаВыработкиПриИзмененииНаСервере(Объект) Экспорт
	
	// Если включили ручную корректировку, необходимо заполнить так, как начислилось бы автоматически
	Если Объект.РучнаяКорректировкаВыработки Тогда
		ЗаполнитьВыработкуВДокументе(Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВыработкуВДокументе(Объект) Экспорт
	
	Объект.Выработка.Очистить();
	НаборЗаписейПоВыработке = Зарплата.РассчитатьВыработкуПоДокументу(Объект.Ссылка);
		
	Для Каждого СтрокаВыработки Из НаборЗаписейПоВыработке Цикл
		НоваяСтрока = Объект.Выработка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыработки);
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДанныеВыбораВидаНачисленияПоВидамИсполнителей(ДанныеВыбора, ВидыИсполнителей, СтандартнаяОбработка) Экспорт
	
	Если ВидыИсполнителей.Количество() > 0 Тогда
		
		ДанныеВыбора = новый СписокЗначений;
		МассивИмяПредопределенных = новый Массив;
		СтандартнаяОбработка = Ложь;
		
		Для Каждого ТекущаяСтрока Из ВидыИсполнителей Цикл
			МассивИмяПредопределенных.Добавить(ТекущаяСтрока.Значение.ИмяПредопределенныхДанных);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыНачислений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыНачислений КАК ВидыНачислений
		|ГДЕ
		|	ВидыНачислений.ИмяПредопределенныхДанных В (&МассивИмяПредопределенных)";
		
		Запрос.УстановитьПараметр("МассивИмяПредопределенных", МассивИмяПредопределенных);	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьВыработкаПроизводстваПоДокументу(ДокументСсылка) Экспорт
	
	НаборЗаписей = РегистрыНакопления.ВыработкаИсполнителейПроизводства.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	Возврат (НаборЗаписей.Количество() > 0);
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииФормированияКомандныхПанелейФорм

Функция ПолучитьДанныеИзРегистровОбработкиОбновления(ОбъектСсылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ОбъектСсылка КАК ОбъектСсылка,
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ВерсияПрограммы КАК ВерсияПрограммы,
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ВерсияПрограммыЧисло КАК ВерсияПрограммыЧисло,
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ОбъектДата КАК ОбъектДата,
	|	ИСТИНА КАК ОбязательнаяОбработка
	|ИЗ
	|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияОбязательные КАК ОбъектыКОбработкеПослеОбновленияОбязательные
	|ГДЕ
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ОбъектСсылка = &ОбъектСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.Документ,
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы,
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммыЧисло,
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ДокументДата,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые КАК ОбъектыКОбработкеПослеОбновленияРекомендуемые
	|ГДЕ
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.Документ = &ОбъектСсылка";
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
		
КонецФункции

// если необходимо управлять выводом команды по каким-либо условиям
//
Функция ТребуетсяВыводКомандыПодключеннойКОбъекту(Ссылка, Команда) Экспорт
	
	Если Команда.Вид = "ОбработкаОбновления" Тогда
		Возврат ОбработкаОбновлений.ТребуетсяВыводКомандыПодключеннойКОбъекту(Ссылка);
		
	////#14923 на форме ЗнП убираем кнопку "Выпуск продукции (массовый выпуск)"
	//ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказНаПроизводство.Форма.ФормаДокумента" 
	//	И Команда.Обработчик = "СозданиеНаОснованииПотолкиКлиент.ВыпускПродукцииМассовыйСоздатьНаОснованииЗаказаНаПроизводство" Тогда
	//    Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

Функция ЭтоНоменклатураПотолкаРозницы(Номенклатура) Экспорт
	
	Возврат Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности ИЛИ Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Номенклатура);
	
КонецФункции

Функция ЭтоНоменклатураПродукция(Номенклатура) Экспорт
	
	Возврат Справочники.ВидыНоменклатуры.ЭтоНоменклатураПродукция(Номенклатура);
	
КонецФункции

Функция ВалютаУчета() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ВалютаУчета");	
КонецФункции

Функция УжеЕстьДокументНачисленияЗарплатыПоМонтажу(МонтажСсылка, ТекущийДокументНачисления = Неопределено) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачислениеЗарплаты.Ссылка
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	НачислениеЗарплаты.Основание = &МонтажСсылка
	|	И НЕ НачислениеЗарплаты.ПометкаУдаления
	|	И НЕ НачислениеЗарплаты.Ссылка = &ТекущийДокументНачисления
	|";
	Запрос.УстановитьПараметр("МонтажСсылка", МонтажСсылка);
	Запрос.УстановитьПараметр("ТекущийДокументНачисления", ТекущийДокументНачисления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.НачислениеЗарплаты.ПустаяСсылка();
	
КонецФункции

Функция ЕстьТелефонКонтрагента(ОбъектСсылка) Экспорт
	
	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОбъектСсылка, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	Иначе
		НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОбъектСсылка.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	КонецЕсли;
	Возврат НЕ ПустаяСтрока(НомерТелефона);

КонецФункции

#Область КонтактнаяИнформация

// Актуализирует значения полей КИ из ее представления.
//
//  Параметры:
//		Представление - Строка - представление КИ
//		ЗначенияПолей - Строка - служебная информация, значения полей КИ
//		ТипКИ - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип контактной информации.
//
Процедура ЗаполнитьЗначенияПолейКИПоПредставлению(Представление, ЗначенияПолей, ТипКИ = Неопределено) Экспорт
	
	ОбщийМодульСервер.ЗаполнитьЗначенияПолейКИПоПредставлению(Представление, ЗначенияПолей, ТипКИ);
	
КонецПроцедуры

#КонецОбласти

#Область Доставка

Функция СпособДоставкиПоУмолчанию() Экспорт
	
	Если ПолучитьФункциональнуюОпцию("УчитыватьДоставкуТовара") Тогда
		ПредопределенноеЗначение("Справочник.СпособыДоставкиТовара.Самовывоз");
	Иначе
		ПредопределенноеЗначение("Справочник.СпособыДоставкиТовара.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ИзменениеСтатусаЗаявкиНаДоставку

//++ №10663 статусы заявок на доставку
Функция ВернутьСписокСтатустовЗаявокНаДоставку() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЗаявокНаДоставку.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыЗаявокНаДоставку КАК СтатусыЗаявокНаДоставку
	|ГДЕ
	|	НЕ СтатусыЗаявокНаДоставку.ПометкаУдаления";
	
	СтатусыСписок = новый СписокЗначений;
	СтатусыСписок.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат СтатусыСписок;
	
КонецФункции

&НаСервере
Процедура ИзменитьСтатусДокументовНаСервере(МассивДокументов, Статус) Экспорт
	
	Для Каждого ТекущийДокумент Из МассивДокументов Цикл
		
		ДокОбъект = ТекущийДокумент.ПолучитьОбъект();
		ДокОбъект.Результат = Статус;
		
		Попытка
			Если ДокОбъект.Проведен Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокОбъект.Записать();
			КонецЕсли;
		Исключение
			Сообщить("Не удалось изменить статус у документа " + ТекущийДокумент + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
//-- №10663

#КонецОбласти

#Область РучнаяОбработкаДокументовПослеОбновленияВспомогательныеПроцедурыИФункции

Функция ПолучитьИнформациюПоСвязкеЗамераЛидаИЗаказДоговора(ДокументСсылка) Экспорт
	
	СтруктураОтвета = новый Структура("УказанЗамер, ЗамерщикСовпадает", Ложь, Ложь);
	
	Если НЕ ТипЗнч(ДокументСсылка.Основание) = Тип("ДокументСсылка.Лид") Тогда
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	Замеры = ДокументСсылка.Основание.Замеры;
	
	СтруктураОтвета.УказанЗамер = (ЗначениеЗаполнено(ДокументСсылка.ИдентификаторЗамера));
	
	// проверка что в заказ-договоре указан замер (ИД) и замерщик замера совпадает с замерщиком договора
	Если ЗначениеЗаполнено(ДокументСсылка.ИдентификаторЗамера)
		И Замеры.НайтиСтроки(новый Структура("ИДЗамера", ДокументСсылка.ИдентификаторЗамера)).Количество() > 0
		И Замеры.НайтиСтроки(новый Структура("ИДЗамера", ДокументСсылка.ИдентификаторЗамера))[0].ИсполнительЗамера = ДокументСсылка.ИсполнительЗамера Тогда
		
		СтруктураОтвета.ЗамерщикСовпадает = Истина;
		
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Процедура ЗафиксироватьУспешнуюОбработку(ВерсияПрограммы, ВерсияПрограммыЧисло, ОбъектСсылка, ОбработкаОбязательныхОбъектов) Экспорт
	
	ОбработкаОбновлений.ЗафиксироватьУспешнуюОбработку(ВерсияПрограммы, ВерсияПрограммыЧисло, ОбъектСсылка, ОбработкаОбязательныхОбъектов);
	
КонецПроцедуры

#КонецОбласти

#Область Штрихкодирование

Функция ПолучитьПроизводственнуюОперациюПоКоду(КодОперации) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникПроизводственныеОперации.Ссылка
	|ИЗ
	|   Справочник.ПроизводственныеОперации КАК СправочникПроизводственныеОперации
	|ГДЕ
	|   СправочникПроизводственныеОперации.Код = &Код
	|	И НЕ СправочникПроизводственныеОперации.ПометкаУдаления
	|";
	Запрос.УстановитьПараметр("Код", КодОперации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат "Не найдена производственная операция с кодом: " + КодОперации;
	КонецЕсли;
	
	Возврат Справочники.ПроизводственныеОперации.ПустаяСсылка();
	
КонецФункции 

//#14908 закомментировано
//Функция ПолучитьОперациюНадДокументомПоКоду(КодОперации) Экспорт
//	
//	Запрос = новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	СправочникОперацииНадДокументами.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.ОперацииНадДокументами КАК СправочникОперацииНадДокументами
//	|ГДЕ
//	|	СправочникОперацииНадДокументами.Код = &Код
//	|	И НЕ СправочникОперацииНадДокументами.ПометкаУдаления";
//	Запрос.УстановитьПараметр("Код", КодОперации);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		Возврат Выборка.Ссылка;
//	Иначе
//		Возврат "Не найдена операция надо документами с кодом: " + КодОперации;
//	КонецЕсли;
//	
//	Возврат Справочники.ОперацииНадДокументами.ПустаяСсылка();
//	
//КонецФункции 

Функция ПолучитьСотрудникаПоКоду(КодСотрудника) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникСотрудники.Ссылка
	|ИЗ
	|   Справочник.Сотрудники КАК СправочникСотрудники
	|ГДЕ
	|   СправочникСотрудники.Код = &Код
	|	И НЕ СправочникСотрудники.ПометкаУдаления
	|	И НЕ СправочникСотрудники.ЭтоГруппа
	|";
	Запрос.УстановитьПараметр("Код", КодСотрудника);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат "Не найден сотрудник с кодом: " + КодСотрудника;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

Функция ЗначениеСтрокиВВалиднуюСтрокуJSON(Знач ИсходнаяСтрока) Экспорт
	
	ИтоговаяСтрока = СтрЗаменить(ИсходнаяСтрока, """", "");
	ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "{", "");
	ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "}", "");
	ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "[", "");
	ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "]", "");
	Возврат ИтоговаяСтрока;
	
КонецФункции

Процедура НастроитьРолиПользователя() Экспорт
	
	//#12942	
	Если ПараметрыСеанса.ЭтоОблако
		И ПравоДоступа("Администрирование", Метаданные) 
		Тогда
		РольИнтерактивноеОткрытие = Метаданные.Роли.ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок;
		ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей(); 
		Для каждого ПользовательИБ из ПользователиИБ Цикл
			Если НРег(ПользовательИБ.Имя) = "support" Тогда
				Продолжить;
			КонецЕсли;			
			Если ПользовательИБ.Роли.Содержит(РольИнтерактивноеОткрытие) Тогда
				ПользовательИБ.Роли.Удалить(РольИнтерактивноеОткрытие);
				ПользовательИБ.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ВерсияКонфигурациии() Экспорт
	
	Возврат Метаданные.Версия;
	
КонецФункции

Функция ЗапретПечатиНепроведенныхДокументов() Экспорт
	
	//Возврат ПараметрыСеанса.ТекущийПользователь.ДополнительныеПраваЗапретПечатиНепроведенныхДокументов;
	Возврат НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешеноПечататьНепроведенныеДокументы");
	
КонецФункции

Функция РазрешеноПечататьНепроведенныеДокументы() Экспорт
	
	Возврат ОбщийМодульСервер.НастройкаПользователя("РазрешеноПечататьНепроведенныеДокументы");
	
КонецФункции

//++ №13407
Процедура ПроверитьВключениеПолнотекстовогоПоиска() Экспорт
	
	Если НЕ ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		Возврат;
	КонецЕсли;
	
	// Если полнотекстовый поиск включен, нужно проверить включить рег. задания
	УстановитьПривилегированныйРежим(Истина);
	
	РегЗадание = РегламентныеЗадания.НайтиПредопределенное("ОбновлениеИндексаППД");
	Если НЕ РегЗадание = Неопределено И НЕ РегЗадание.Использование Тогда
		
		Попытка
			РегЗадание.Использование = Истина;
			РегЗадание.Записать();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	РегЗадание = РегламентныеЗадания.НайтиПредопределенное("СлияниеИндексаППД");
	Если НЕ РегЗадание = Неопределено И НЕ РегЗадание.Использование Тогда
		
		Попытка
			РегЗадание.Использование = Истина;
			РегЗадание.Записать();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
//-- №13407

//++ №13833 перенесено из АРМПроизводства
Функция ПолучитьМассивФайловЗНП(ДокументСсылка) Экспорт
	
	Файлы = Новый Массив;
	
	СписокНоменклатуры = Новый СписокЗначений;
	Если ЗначениеЗаполнено(ДокументСсылка.ПродукцияНоменклатура) Тогда
		СписокНоменклатуры.Добавить(ДокументСсылка.ПродукцияНоменклатура);
	КонецЕсли;
	 
	Для Каждого Строка Из ДокументСсылка.Продукция Цикл
		СписокНоменклатуры.Добавить(Строка.Номенклатура);
	КонецЦикла;
	
	Для Каждого Строка Из ДокументСсылка.Товары Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Строка.Номенклатура) Тогда
			СписокНоменклатуры.Добавить(Строка.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	МассивДоступныхРасширений = Новый Массив;
	МассивДоступныхРасширений.Добавить("pdf");  //++ 2020-08-06	
	МассивДоступныхРасширений.Добавить("jpg");  //#10734
	МассивДоступныхРасширений.Добавить("jpeg"); //#10734

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК Номенклатура,
	|	ПрикрепленныеДанные.ИмяФайла,
	|	ПрикрепленныеДанные.Расширение,
	|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя,
	|	ПрикрепленныеДанные.Период КАК ДатаПрикрепления
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект В(&СсылкаНаОбъект)
	|	И ПрикрепленныеДанные.Расширение В(&МассивДоступныхРасширений)
	|";
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СписокНоменклатуры);
	Запрос.УстановитьПараметр("МассивДоступныхРасширений", МассивДоступныхРасширений);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураФайл = Новый Структура;
		СтруктураФайл.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураФайл.Вставить("ИмяФайла", Выборка.ИмяФайла);
		СтруктураФайл.Вставить("Расширение", Выборка.Расширение);
		СтруктураФайл.Вставить("ВидФайлаПрограммыПостроителя", Выборка.ВидФайлаПрограммыПостроителя);
		СтруктураФайл.Вставить("ДатаПрикрепления", Выборка.ДатаПрикрепления);
		
		Файлы.Добавить(СтруктураФайл);
		
	КонецЦикла;
	
	Возврат Файлы;
	
КонецФункции
//-- №13833 перенесено из АРМПроизводства

// №14991
Функция ПроверитьПользователяТехподдержки(НаименованиеДляСверки) Экспорт
	
	НаименованиеПользователяПоддержки = НРег("Служба поддержки SmartCeilings");
	
	Структура = новый Структура;
	
	Структура.Вставить("ЭтоКарточкаТехподдержки", (НРег(НаименованиеДляСверки) = НаименованиеПользователяПоддержки));
	Структура.Вставить("ТекущийСеансПоддержки", (НРег(Пользователи.ТекущийПользователь()) = НаименованиеПользователяПоддержки));
	
	Возврат Структура;
	
КонецФункции

Функция ПолучитьПолноеИмяОбъектаПоМетаданным(ОбъектСсылка) Экспорт
	Возврат ОбъектСсылка.Метаданные().ПолноеИмя();
КонецФункции


#Область ФункцииСопутствующейНоменклатуры

Функция ЕстьСопутствующаяНоменклатураВРегистре(Номенклатура, Характеристика, ПолучитьКоличество=Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СопутствующиеТоварыИУслуги.СопутствующийТовар КАК СопутствующийТовар,
	|	СопутствующиеТоварыИУслуги.ХарактеристикаСопутствующегоТовара КАК ХарактеристикаСопутствующегоТовара
	|ИЗ
	|	РегистрСведений.СопутствующиеТоварыИУслуги КАК СопутствующиеТоварыИУслуги
	|ГДЕ
	|	СопутствующиеТоварыИУслуги.Номенклатура = &Номенклатура
	|	И СопутствующиеТоварыИУслуги.Характеристика = &Характеристика";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ ПолучитьКоличество Тогда
		Возврат Выборка.Количество() > 0;	
	КонецЕсли;
	
	МассивСопутствующейНоменклатурыВРегистре = Новый Массив;
	Уровень = 1;
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			ДанныеПоНоменклатуре = Новый Структура;
			ДанныеПоНоменклатуре.Вставить("Родитель", Номенклатура);
			ДанныеПоНоменклатуре.Вставить("ХарактеристикаРодителя", Характеристика);
			ДанныеПоНоменклатуре.Вставить("Номенклатура", Выборка.СопутствующийТовар);
			ДанныеПоНоменклатуре.Вставить("Характеристика", Выборка.ХарактеристикаСопутствующегоТовара);
			МассивСопутствующейНоменклатурыВРегистре.Добавить(ДанныеПоНоменклатуре);
			ПолучитьВложенныеСопутствующиеТовары(МассивСопутствующейНоменклатурыВРегистре, Уровень);
		КонецЦикла;
	КонецЕсли;	
	Возврат МассивСопутствующейНоменклатурыВРегистре.Количество();
	
КонецФункции	

Процедура ПолучитьВложенныеСопутствующиеТовары(МассивСопутствующейНоменклатурыВРегистре, Уровень)
	
	Если Уровень < ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СопутствующиеТоварыИУслуги.СопутствующийТовар КАК СопутствующийТовар,
		|	СопутствующиеТоварыИУслуги.ХарактеристикаСопутствующегоТовара КАК ХарактеристикаСопутствующегоТовара
		|ИЗ
		|	РегистрСведений.СопутствующиеТоварыИУслуги КАК СопутствующиеТоварыИУслуги
		|ГДЕ
		|	СопутствующиеТоварыИУслуги.Номенклатура = &Номенклатура
		|	И СопутствующиеТоварыИУслуги.Характеристика = &Характеристика";
		Запрос.УстановитьПараметр("Номенклатура", МассивСопутствующейНоменклатурыВРегистре[МассивСопутствующейНоменклатурыВРегистре.Количество()-1].Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", МассивСопутствующейНоменклатурыВРегистре[МассивСопутствующейНоменклатурыВРегистре.Количество()-1].Характеристика);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДанныеПоНоменклатуре = Новый Структура;
			ДанныеПоНоменклатуре.Вставить("Родитель", МассивСопутствующейНоменклатурыВРегистре[МассивСопутствующейНоменклатурыВРегистре.Количество()-1].Номенклатура);
			ДанныеПоНоменклатуре.Вставить("ХарактеристикаРодителя", МассивСопутствующейНоменклатурыВРегистре[МассивСопутствующейНоменклатурыВРегистре.Количество()-1].Характеристика);
			ДанныеПоНоменклатуре.Вставить("Номенклатура", Выборка.СопутствующийТовар);
			ДанныеПоНоменклатуре.Вставить("Характеристика", Выборка.ХарактеристикаСопутствующегоТовара);
			МассивСопутствующейНоменклатурыВРегистре.Добавить(ДанныеПоНоменклатуре);
			ПолучитьВложенныеСопутствующиеТовары(МассивСопутствующейНоменклатурыВРегистре, Уровень+1);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг() Экспорт
	Возврат Константы.ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг.Получить();
КонецФункции

Функция ПолучитьСписокСопутствующихТоваров(Номенклатура, Характеристика = Неопределено, Количество, УИСтрокиРодителя=Неопределено, Уровень=0) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СопутствующиеТоварыИУслуги.Номенклатура КАК Номенклатура,
	|	СопутствующиеТоварыИУслуги.Характеристика КАК Характеристика,
	|	СопутствующиеТоварыИУслуги.СопутствующийТовар КАК СопутствующийТовар,
	|	СопутствующиеТоварыИУслуги.ХарактеристикаСопутствующегоТовара КАК ХарактеристикаСопутствующегоТовара,
	|	СопутствующиеТоварыИУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СопутствующиеТоварыИУслуги.Коэффициент КАК Коэффициент,
	|	СопутствующиеТоварыИУслуги.Количество КАК Количество,
	|	СопутствующиеТоварыИУслуги.ФиксированноеКоличество КАК ФиксированноеКоличество,
	|	СопутствующиеТоварыИУслуги.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
	|	СопутствующиеТоварыИУслуги.ПорядокОкругленияЧислом КАК ПорядокОкругленияЧислом
	|ИЗ
	|	РегистрСведений.СопутствующиеТоварыИУслуги КАК СопутствующиеТоварыИУслуги
	|ГДЕ
	|	СопутствующиеТоварыИУслуги.Номенклатура = &Номенклатура
	|	И СопутствующиеТоварыИУслуги.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ?(Характеристика = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), Характеристика));
	
	НаборЗаписей = Запрос.Выполнить().Выгрузить();
	МассивЗаписей = Новый Массив;	
	Для Каждого Запись из НаборЗаписей Цикл
		СтруктураЗаписи =  Новый Структура;
		СтруктураЗаписи.Вставить("Номенклатура", 			Запись.СопутствующийТовар);
		СтруктураЗаписи.Вставить("Характеристика", 			Запись.ХарактеристикаСопутствующегоТовара);
		СтруктураЗаписи.Вставить("ЕдиницаИзмерения",		Запись.ЕдиницаИзмерения);
		СтруктураЗаписи.Вставить("Коэффициент", 			Запись.Коэффициент);
		СтруктураЗаписи.Вставить("УИСтроки", 					Строка(Новый УникальныйИдентификатор()));
		СтруктураЗаписи.Вставить("УИСтрокиРодителя", 	Строка(	УИСтрокиРодителя));
		СтруктураЗаписи.Вставить("Уровень", 						Уровень+1);
		
		Если Запись.ФиксированноеКоличество Тогда
			СтруктураЗаписи.Вставить("Количество", Запись.Количество);
		ИначеЕсли Запись.ПорядокОкругленияЧислом > 0 Тогда
			//Округляем до точности указанной в "ПорядокОкругленияЧислом" 
			РасчетноеКоличество = Запись.Количество * Количество;
			КратПоПорядкуОкругления = Окр(РасчетноеКоличество/Запись.ПорядокОкругленияЧислом, 0);
			ОкругленноеКоличество = КратПоПорядкуОкругления * Запись.ПорядокОкругленияЧислом;
			Остаток = РасчетноеКоличество - ОкругленноеКоличество;
			Если Остаток > 0 И (Остаток > Запись.ПорядокОкругленияЧислом/2 ИЛИ Запись.ОкруглятьВБольшуюСторону) Тогда
				ОкругленноеКоличество = ОкругленноеКоличество + Запись.ПорядокОкругленияЧислом;
			КонецЕсли;	
			СтруктураЗаписи.Вставить("Количество", ОкругленноеКоличество);
		Иначе
			СтруктураЗаписи.Вставить("Количество", Запись.Количество * Количество);
		КонецЕсли;
		
		МассивЗаписей.Добавить(СтруктураЗаписи);
	КонецЦикла;
	
	Возврат МассивЗаписей;
	
КонецФункции

#КонецОбласти
