#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Статусы.Ссылка КАК Ссылка,
	|	Статусы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.СтатусыСборкиЗаказов КАК Статусы
	|ГДЕ
	|	НЕ Статусы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статусы.РеквизитДопУпорядочивания";
	
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл		
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция СписокСтатусов() Экспорт
	
	СписокСтатусов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Статусы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыСборкиЗаказов КАК Статусы
	|ГДЕ
	|	НЕ Статусы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статусы.РеквизитДопУпорядочивания";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСтатусов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СписокСтатусов;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

// Процедура заполняет справочник по умолчанию
//
Процедура ЗаполнитьПоставляемыеСтатусы() Экспорт
	
	//#13384 статус удален
	//СтатусОбъект = Справочники.СтатусыСборкиЗаказов.СборкаНеТребуется.ПолучитьОбъект();
	//СтатусОбъект.РеквизитДопУпорядочивания = 10;
	//СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыСборкиЗаказов.ВыполнитьСборку.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 20;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыСборкиЗаказов.СобранЧастично.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 30;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыСборкиЗаказов.СобранПолностью.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 40;
	СтатусОбъект.Записать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Статусы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыСборкиЗаказов КАК Статусы
	|ГДЕ
	|	НЕ Статусы.Предопределенный";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтатусОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтатусОбъект.РеквизитДопУпорядочивания = 99999;
		СтатусОбъект.Записать();		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли