#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗапуститьИнициализациюВЛК();
	ОбщийМодуль.ЗапуститьРегламентноеЗаданиеПроверкиДоступностиРасширенныхСервисов();
	
	УстановитьУсловноеОформление();
	
	// запретим сортировку по указанным полям, иначе возможны "зависания"
	ЗапрещенныеПоляСортировки = Новый Массив;
	ЗапрещенныеПоляСортировки.Добавить("Документ");
	СписокОбъектовКОбработке.УстановитьОграниченияИспользованияВПорядке(ЗапрещенныеПоляСортировки);
	ЗапрещенныеПоляСортировки.Очистить();
	ЗапрещенныеПоляСортировки.Добавить("ОбъектСсылка");
	СписокОбязательныхОбъектовКОбработке.УстановитьОграниченияИспользованияВПорядке(ЗапрещенныеПоляСортировки);	
	
	//новый метод работ с константами (используется частично)
	Набор = РеквизитФормыВЗначение("НаборКонстант");
    Набор.Прочитать();
    ЗначениеВРеквизитФормы(Набор, "НаборКонстант");
	
	ЗаполнитьСпискиПравилФормированияНаименованийПотолкаПленкиФактуры();
	ЗаполнитьСпискиПравилФормированияСМСПриПереводеЗаказаНаПроизводствоВСтатусПроизведен();
	ЗаполнитьСписокВариантовФормированияПФЗаказаПокупателя();
	ЗаполнитьСписокВариантовФормированияПФСчетаНаОплату();
	ЗаполнитьСписокВариантовФормированияПФРТИУ();
	ЗаполнитьСписокВариантовФормированияПФЗаказаПоставщику();
	ЗаполнитьСписокВариантовФормированияПФПеремещения();
	ЗаполнитьСписокВариантовФормированияПФМатериалы();
	
	ЗаполнитьСписокВариантовПеремещенияТоваровИзЗаказДоговора();
	ЗаполнитьСписокВариантовТекстаНаГрафикеЗамеров();
	ЗаполнитьСписокВариантовТекстаНаГрафикеМонтажей();
	ЗаполнитьСписокВариантовСкладаРезервированияПоУмолчанию();
	
	ОбщийМодульСервер.ЗаполнитьПредопределенныеПорядкиОкругления(Элементы.НаборКонстантПорядокОкругленияЧисломСтоимостиПотолков);
	ОбщийМодульСервер.ЗаполнитьПредопределенныеПорядкиОкругления(Элементы.НаборКонстантПорядокОкругленияЧисломСтоимостиПотолковРозница);
	
	//Основные
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Элементы.ВалютаУчета.Доступность = ВалютаУчета.Пустая();	
	ОсновнаяВалютаПересчетаЦены = Константы.ОсновнаяВалютаПересчетаЦены.Получить();
	//Объект.ИспользоватьДополнительныеРеквизитыИСведения = Константы.ИспользоватьДополнительныеРеквизитыИСведения.Получить();
	Объект.ИспользоватьОбщиеДополнительныеЗначения = Константы.ИспользоватьОбщиеДополнительныеЗначения.Получить();
	Объект.ИспользоватьОбщиеДополнительныеРеквизитыИСведения = Константы.ИспользоватьОбщиеДополнительныеРеквизитыИСведения.Получить();	
	// №12800 Объект.НеИспользоватьПрефиксОрганизацииВНомереДокумента = Константы.НеИспользоватьПрефиксОрганизацииВНомереДокумента.Получить();
	//ПолучитьНастройкуПотолки("ПолФизЛицаОбязателенКЗаполнению");
	//ПолучитьНастройкуПотолки("ВыключитьПредпросмотрПрикрепленныхФайловВДокументах");
	//ПолучитьНастройкуПотолки("ЗапретПроведенияДокументовБудущимЧислом");
	//ПолучитьНастройкуПотолки("ОтображатьЗадолженностьКонтрагентаВВалюте");
	//ПолучитьНастройкуПотолки("ВалютаОтображенияЗадолженностиКонтрагента");
	УправлениеВидимостьюИсточникКурсаВалют();
	СписокEmailСтрокой = Константы.СписокEmailПоКонтролюПравокЗаднимЧислом.Получить();
	СписокEmailПоКонтролюПравокЗаднимЧислом.ЗагрузитьЗначения(СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокEmailСтрокой, ";", Истина, Истина)); 
	
	ЗаполнитьЧасовыеПояса();
	ЧасовойПоясПрограммы = ПолучитьЧасовойПоясИнформационнойБазы();
	//Элементы.ЧасовойПоясПрограммы.СписокВыбора.Добавить(ЧасовойПоясПрограммы);
	
	Если Не ЗначениеЗаполнено(НаборКонстант.АрхивироватьПрикрепленныеДанныеСтарше) Тогда
		НаборКонстант.АрхивироватьПрикрепленныеДанныеСтарше = 24;
	КонецЕсли;
	
	// вкладка "Лиды"
	ПравилоПоискаИсторииОбращений = Константы.ПравилоПоискаИсторииОбращений.Получить().Получить();
	Если НЕ ПравилоПоискаИсторииОбращений = Неопределено Тогда
		ПравилоПоискаИсторииОбращений.Свойство("ПоТелефону", ПравилоПоискаИсторииОбращенийПоТелефону);
		ПравилоПоискаИсторииОбращений.Свойство("ПоАдресуЭлектроннойПочты", ПравилоПоискаИсторииОбращенийПоАдресуЭлектроннойПочты);
	КонецЕсли;
	
	Для Каждого ЭлементПеречисления Из Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида Цикл
		НоваяСтрока = НастройкиИзмененияДатыСледующегоКонтактаЛида.Добавить();
		НоваяСтрока.Событие = ЭлементПеречисления;		
		НоваяСтрока.Индекс = Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида.Индекс(ЭлементПеречисления);
		
		Если ЭлементПеречисления = Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида.ПриПереводеНаКонечныйСтатус
			ИЛИ ЭлементПеречисления = Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида.ПриЗакрытииВСтатусеОбращение
			Тогда
			НоваяСтрока.ОчисткаДаты = Истина;
		КонецЕсли;
	КонецЦикла; 
	НастройкиИзмененияДатыСледующегоКонтактаЛида.Сортировать("Индекс");
	НастройкаИзмененияДатыСледующегоКонтактаЛида = Константы.НастройкаИзмененияДатыСледующегоКонтактаЛида.Получить().Получить();
	Если НЕ НастройкаИзмененияДатыСледующегоКонтактаЛида = Неопределено Тогда
		Для каждого СтрокаНастройки из НастройкаИзмененияДатыСледующегоКонтактаЛида Цикл
			Событие = Неопределено;
			Попытка
				Событие = Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида[СтрокаНастройки.ИмяСобытия];
			Исключение
				Продолжить;
			КонецПопытки;
			Если НЕ Событие = Неопределено Тогда
				НайденныеСтроки = НастройкиИзмененияДатыСледующегоКонтактаЛида.НайтиСтроки(Новый Структура("Событие", Событие));
				Если НайденныеСтроки.Количество() > 0 Тогда
					НайденныеСтроки[0].Сдвиг = СтрокаНастройки.Сдвиг;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	//мобильный клиент
	Объект.ОтображатьЗамерыБудущейДатыВМобильномКлиентеЗамерщика = Константы.ОтображатьЗамерыБудущейДатыВМобильномКлиентеЗамерщика.Получить();
	ОбщиеНастройкиМКЗамерщика = НЕ НаборКонстант.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаДляПользователей;
	ОбщиеНастройкиМКМонтажника = НЕ НаборКонстант.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаМонтажникаДляПользователей;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МобильныйКлиентЗамерщикаДоступныеВидыЦен.ВидЦены КАК ВидЦены,
	|	МобильныйКлиентЗамерщикаДоступныеВидыЦен.ПоУмолчанию КАК ПоУмолчанию
	|ИЗ
	|	РегистрСведений.МобильныйКлиентЗамерщикаДоступныеВидыЦен КАК МобильныйКлиентЗамерщикаДоступныеВидыЦен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = МобильныйКлиентЗамерщикаДоступныеВидыЦен.Добавить();
		НоваяСтрока.ВидЦены = Выборка.ВидЦены;
		НоваяСтрока.ПоУмолчанию = Выборка.ПоУмолчанию;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МобильныйКлиентЗамерщикаДоступныеВидыСкидок.ВидСкидки КАК ВидСкидки
	|ИЗ
	|	РегистрСведений.МобильныйКлиентЗамерщикаДоступныеВидыСкидок КАК МобильныйКлиентЗамерщикаДоступныеВидыСкидок";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = МобильныйКлиентЗамерщикаДоступныеВидыСкидок.Добавить();
		НоваяСтрока.ВидСкидки = Выборка.ВидСкидки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МобильныйКлиентЗамерщикаДоступнаяНоменклатура.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.МобильныйКлиентЗамерщикаДоступнаяНоменклатура КАК МобильныйКлиентЗамерщикаДоступнаяНоменклатура";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = МобильныйКлиентЗамерщикаДоступнаяНоменклатура.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
	КонецЦикла;
	
	//замеры
	НастройкаОформленияГрафикаЗамеров = ОбщийМодульСервер.ПолучитьНастройкуОформленияГрафикаЗамеров();
	
	//монтажи
	НастройкаОформленияГрафикаМонтажей = ОбщийМодульСервер.ПолучитьНастройкуОформленияГрафикаМонтажей();

	//софтфон
	ТелефонияАдминистраторЛогин = Константы.ТелефонияАдминистраторЛогин.Получить();
	//ТелефонияАдминистраторПароль = Константы.ТелефонияАдминистраторПароль.Получить();
	//ТелефонияАдресСервера = Константы.ТелефонияАдресСервера.Получить();
	ТелефонияНомерПорта = Константы.ТелефонияНомерПорта.Получить();
	//ТелефонияSimplitЛогин = Константы.ТелефонияSimplitЛогин.Получить();
	//ТелефонияSimplitПароль = Константы.ТелефонияSimplitПароль.Получить();
	ПолучитьНастройкуПотолки("ТелефонияСтрана");
	
	//производство
	//ГруппаНоменклатурыПродукция = Константы.ГруппаНоменклатурыПродукция.Получить();
	//Объект.СуффиксАртПотолок = Константы.СуффиксАртПотолок.Получить();
	//Объект.СуффиксМногофактурныйПотолок = Константы.СуффиксМногофактурныйПотолок.Получить();
	//Объект.ПорядокФормированияНомераТиповогоОтреза = Константы.ПорядокФормированияНомераТиповогоОтреза.Получить();
	//Объект.ГруппаНоменклатурыДляОстатков = Константы.ГруппаНоменклатурыДляОстатков.Получить();
	//Объект.КонтролироватьМаксимальноеКоличествоПотолковВЧасКОтгрузке = Константы.КонтролироватьМаксимальноеКоличествоПотолковВЧасКОтгрузке.Получить();
	//Объект.МаксимальноеКоличествоПотолковВЧасКОтгрузке = Константы.МаксимальноеКоличествоПотолковВЧасКОтгрузке.Получить();
	// №14932 ПолучитьНастройкуПотолки("ЗаказыватьТоварыПриОформленииЗаказаНаПроизводствоНаОснованииЗаказаПокупателя");
	
	НастройкаОформленияЗаказов = ОбщийМодульСервер.ПолучитьНастройкуОформленияЗаказов();
	ПолучитьНастройкуПотолки("ВремяПодсветкиЗнППоДатеОжидаемойОтгрузки", Ложь);
	ПолучитьНастройкуПотолки("ВремяПодсветкиЗППоДатеОжидаемойОтгрузки", Ложь);
	
	//розница
	//Объект.ГруппаНовыхКонтрагентовРозницы = Константы.ГруппаНовыхКонтрагентовРозницы.Получить();
	Объект.ПорядокФормированияНаименованияПотолкаРозницы = Константы.ПорядокФормированияНаименованияПотолкаРозницы.Получить();
	//Объект.ЗаказПоставщикуВыделятьУслугиРаскрояИзПотолка = Константы.ЗаказПоставщикуВыделятьУслугиРаскрояИзПотолка.Получить();
	
	//Объект.АвтоматическиПрисваиватьНомерДоговораВЗаказДоговоре = Константы.АвтоматическиПрисваиватьНомерДоговораВЗаказДоговоре.Получить();
	ОбщийМодуль.ПолучитьДанныеПоШаблонуНомераДоговора(ТекущаяДатаСеанса(), ШаблонНомераДоговора, ПериодичностьНомераДоговора);	
	Элементы.ДекорацияШаблонНомераДоговора.Заголовок = ШаблонНомераДоговора;
	
	Объект.ИспользоватьВерсионированиеОбъектов = Константы.ИспользоватьВерсионированиеОбъектов.Получить();
	
	//Объект.ИспользоватьСправочникКомнатВРознице = Константы.ИспользоватьСправочникКомнатВРознице.Получить();
	
	//Объект.ИспользоватьМаскуВводаТелефона = Константы.ИспользоватьМаскуВводаТелефона.Получить();
	//Объект.НастройкаПредварительногоРасчетаЗаказаВРозницеПоУмолчанию = Константы.НастройкаПредварительногоРасчетаЗаказаВРозницеПоУмолчанию.Получить();
	
	//загрузка из построителя
	//ГруппаНоменклатурДляФактуры = Константы.ГруппаНоменклатурДляФактуры.Получить();
	//АвтоматическиЗагружатьВБазуЧертежПотолкаИзИзиСилинг = Константы.АвтоматическиЗагружатьВБазуЧертежПотолкаИзИзиСилинг.Получить();
	//Объект.ПорядокФормированияНаименованияПотолка = Константы.ПорядокФормированияНаименованияПотолка.Получить();
	Объект.ПорядокФормированияНаименованияПленки = Константы.ПорядокФормированияНаименованияПленки.Получить();
	//ПравилоОпределенияОтреза = Справочники.ПравилаОпределенияВидаПотолка.Отрез; //#12532
	Объект.ВыделятьУслугиРаскрояИзПотолкаПриЗагрузкеИзПостроителяВЗаказДоговор = Константы.ВыделятьУслугиРаскрояИзПотолкаПриЗагрузкеИзПостроителяВЗаказДоговор.Получить();
	ТекущийПорядокФормированияНаименованияПленки = Объект.ПорядокФормированияНаименованияПленки;
	//Объект.ПрефиксНаименованияПотолка = Константы.ПрефиксНаименованияПотолка.Получить();
	ПолучитьНастройкуПотолки("ПорядокФормированияНаименованияФактуры");
	ТекущийПорядокФормированияНаименованияФактуры = Объект.ПорядокФормированияНаименованияФактуры;
	//ПолучитьНастройкуПотолки("ПорядокФормированияНаименованияОтреза");
	//ПолучитьНастройкуПотолки("ПрефиксНаименованияОтреза");
	
	//смс
	ЕВостокСМСЛогин = Константы.ЕВостокСМСЛогин.Получить();
	ЕВостокСМСПароль = Константы.ЕВостокСМСПароль.Получить();
	ЕВостокСМСНомерСервиса = Константы.ЕВостокСМСНомерСервиса.Получить();
	ЕВостокСМСПодпись = Константы.ЕВостокСМСПодпись.Получить();
	
	АвтоматическиСоздаватьПоздравленияСДнемРожденияПоСМС = Константы.АвтоматическиСоздаватьПоздравленияСДнемРожденияПоСМС.Получить();
	ШаблонСМСПоздравленияНаДеньРождения = Константы.ШаблонСМСПоздравленияНаДеньРождения.Получить();
	ГруппаКонтрагентовДляПоздравленияСДнемРожденияЧерезСМС = Константы.ГруппаКонтрагентовДляПоздравленияСДнемРожденияЧерезСМС.Получить();
	
	//ЕВостокОтправлятьСМСЗамерщикуПриПланированииЗамера = Константы.ОтправлятьСМСЗамерщикуПриПланированииЗамера.Получить();
	//ЕВостокОтправлятьСМСКлиентуПриПланированииЗамера = Константы.ОтправлятьСМСКлиентуПриПланированииЗамера.Получить();
	//ЕВостокШаблонТекстаСМСОЗамереЗамерщику = Константы.ШаблонТекстаСМСОЗамереЗамерщику.Получить();
	//ЕВостокШаблонТекстаСМСОЗамереКлиенту = Константы.ШаблонТекстаСМСОЗамереКлиенту.Получить();
	
	Объект.НомерШаблонаТекстаСМСКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен = Константы.НомерШаблонаТекстаСМСКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен.Получить();	
	ЕВостокОтправлятьСМСОЗапланированномМонтаже = Константы.ОтправлятьСМСОЗапланированномМонтаже.Получить();
	ЕВостокШаблонТекстаСМСОМонтажеКлиенту = Константы.ШаблонТекстаСМСОМонтажеКлиенту.Получить();
	ЕВостокШаблонТекстаСМСОМонтажеМонтажнику = Константы.ШаблонТекстаСМСОМонтажеМонтажнику.Получить();
	СМСРуAPIID = Константы.СМСРуAPIID.Получить();
	ОтправлятьСМСВсемКонтрагентамКромеПризнака = Константы.ОтправлятьСМСВсемКонтрагентамКромеПризнака.Получить();
	ОтправлятьСМСТолькоКонтрагентамСПризнаком = Константы.ОтправлятьСМСТолькоКонтрагентамСПризнаком.Получить();	
	Объект.ОтправлятьСМСКонтрагентуПоПКО = Константы.ОтправлятьСМСКонтрагентуПоПКО.Получить();
	//Объект.ШаблонСМСКонтрагентуПоПКО = Константы.ШаблонСМСКонтрагентуПоПКО.Получить();
	Объект.ШаблонТекстаСМСПоЗаявкеНаДоставку = Константы.ШаблонТекстаСМСПоЗаявкеНаДоставку.Получить();	
	Объект.ШаблонТекстаСМСПоЗаказуПокупателя = Константы.ШаблонТекстаСМСПоЗаказуПокупателя.Получить();
	ОтправлятьСМСПриИзмененииДатыМонтажа = Константы.ОтправлятьСМСПриИзмененииДатыМонтажа.Получить();
	ШаблонТекстаСМСОИзмененииДатыМонтажаКлиенту = Константы.ШаблонТекстаСМСОИзмененииДатыМонтажаКлиенту.Получить();
	ШаблонТекстаСМСОИзмененииДатыМонтажаМонтажнику = Константы.ШаблонТекстаСМСОИзмененииДатыМонтажаМонтажнику.Получить();
	ГруппаКонтрагентовДляОтправкиСМСПоДолгамЗначения = Константы.ГруппаКонтрагентовДляОтправкиСМСПоДолгам.Получить().Получить();
	Если ТипЗнч(ГруппаКонтрагентовДляОтправкиСМСПоДолгамЗначения) = Тип("СписокЗначений") Тогда
		ГруппаКонтрагентовДляОтправкиСМСПоДолгам.ЗагрузитьЗначения(ГруппаКонтрагентовДляОтправкиСМСПоДолгамЗначения.ВыгрузитьЗначения());
	КонецЕсли;
	ПолучитьИспользованиеРегламентногоЗаданияСмсПоДолгам();
	
	//Интеграции
	ИспользоватьПотолкиОнлайн = Константы.ИспользоватьПотолкиОнлайн.Получить();
	АдресДилерскогоСайта = Константы.АдресДилерскогоСайта.Получить();
	
	Объект.ИспользоватьОбменСПорталом = Константы.ИспользоватьОбменСПорталом.Получить();
	
	//интеграции - ВКонтакте
	Объект.ВКонтакте_access_token = Константы.ВКонтакте_access_token.Получить();
	Объект.ВКонтакте_app_id = Константы.ВКонтакте_app_id.Получить();
	Объект.ВКонтакте_ПраваДоступа = Константы.ВКонтакте_ПраваДоступа.Получить();
	Если ПустаяСтрока(Объект.ВКонтакте_ПраваДоступа) Тогда
		Объект.ВКонтакте_ПраваДоступа = "wall,offline,messages";
	КонецЕсли;
	
	//ройстат
	Объект.РойстатПароль = Константы.РойстатПароль.Получить();
	СтрокаПодключенияРойстат = "http://ВАШ_ДОМЕН/ИМЯ_ОПУБЛИКОВАННОЙ_БАЗЫ/hs/roistat/v1/integration";
	Объект.АдресВебхуковРойстат = Константы.АдресВебхуковРойстат.Получить();
	
	//скидки и бонусы
	//ИспользоватьАвтоматическиеСкидки = Константы.ИспользоватьАвтоматическиеСкидки.Получить();
	//ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат = Константы.ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат.Получить();
	//Объект.МаксимальныйРазмерБонусовКСписаниюПоДокументу = Константы.МаксимальныйРазмерБонусовКСписаниюПоДокументу.Получить();
	//Объект.НачислятьБонусыПоДисконтнойКартеПриЗачетеБонусовКакСкидку = Константы.НачислятьБонусыПоДисконтнойКартеПриЗачетеБонусовКакСкидку.Получить();
	//Объект.АвтоматическоеНачислениеБонусов = Константы.АвтоматическоеНачислениеБонусов.Получить();
	//Объект.УчитыватьБонусы = Константы.УчитыватьБонусы.Получить();
	
	СписокПолучателейБонусов = Новый СписокЗначений;
	Элементы.ДержательБонусов.СписокВыбора.Добавить(0,"Контрагент");
	Элементы.ДержательБонусов.СписокВыбора.Добавить(1,"Дисконтная карта");
	
	Если Константы.УчетБонусовПоДисконтнымКартам.Получить() Тогда
		Объект.ДержательБонусов = 1;
	Иначе
		Объект.ДержательБонусов = 0;
	КонецЕсли;
	
	Если Константы.ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг.Получить() = 0 Тогда
		Константы.ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг.Установить(1);
		НаборКонстант.ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг = 1;
	КонецЕсли;

	Если НаборКонстант.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги Тогда
		Элементы.ГруппаНастроекАвтоматическогоДобавления.Доступность = Истина;
	Иначе
		НаборКонстант.ЗапрашиватьПодтверждениеПриДобавленииНоменклатурыСТ = Ложь;
		НаборКонстант.ЗапрашиватьПодтверждениеПриИзмененииКоличестваСТ = Ложь;
		НаборКонстант.ЗапрашиватьПодтверждениеПриУдаленииНоменклатурыСТ = Ложь;
		Элементы.ГруппаНастроекАвтоматическогоДобавления.Доступность = Ложь;
	КонецЕсли;	
	
	//расширенные сервисы
	КаналыWazzup.Очистить();
	ХранилищеИзКонстанты = Константы.КаналыВатсап.Получить();
    МассивКаналов = ХранилищеИзКонстанты.Получить();    
	Если НЕ МассивКаналов = Неопределено Тогда
		Для НомерЗаписи = 0 По МассивКаналов.Количество()-1 Цикл
			НоваяСтрока = КаналыWazzup.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивКаналов[НомерЗаписи]);
		КонецЦикла;
	КонецЕсли;
	
	//МобильныйКлиентЗамерщикаЛоготипОрганизацииПоле = ПолучитьНавигационнуюСсылку(НаборКонстант.МобильныйКлиентЗамерщикаЛоготипОрганизации, "Файл");
	//МобильныйКлиентЗамерщикаПечатьОрганизацииПоле = ПолучитьНавигационнуюСсылку(НаборКонстант.МобильныйКлиентЗамерщикаПечатьОрганизации, "Файл");
	
	//лиды
	ОбязательныеПоляКЗаполнениюЛида.Загрузить(ОбщийМодульСервер.ПолучитьНастройкуОбязательныхПолейКЗаполнениюЛида());
	
	//Монтажи
	ОтображатьПрочихИсполнителей.Загрузить(ОбщийМодульСервер.ПолучитьНастройкуОтображатьПрочихИсполнителей());
	
	//++ №12763
	НастройкиВремениРеакцииПоЛидам.Загрузить(РегистрыСведений.НастройкиВремениРеакцииПоЛидам.ПолучитьНастройкуВремениРеакцииПоЛидам());
	ПолучателиУведомленийОПросроченныхЛидах.Загрузить(РегистрыСведений.ПолучателиУведомленийОПросроченныхЛидах.ПолучитьСписокПользователей());
	//-- №12763
	
	//выставляем настройки на форме в зависимости от регламентных заданий
	Попытка
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Метаданные","СозданиеПоступленийТоваровОтПроизводства");
		МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(СтруктураОтбора);
		Для НомерЗадания = 0 По МассивЗаданий.Количество()-1 Цикл
			АвтоматическиСоздаватьДокументыПоступленийТоваровОтПроизводстваНаРозницу = МассивЗаданий[НомерЗадания].Использование;
		КонецЦикла;
	Исключение
		Сообщить("Не удалось получить состояние регламентного задания ""Создание поступлений товаров от производства (по интеркампани)"". " + ОписаниеОшибки());
	КонецПопытки;
	Попытка
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Метаданные","СозданиеПоступленийТоваровОтПроизводстваПоРучнымЗаказам");
		МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(СтруктураОтбора);
		Для НомерЗадания = 0 По МассивЗаданий.Количество()-1 Цикл
			АвтоматическиСоздаватьДокументыПоступленийПоРучнымЗаказам = МассивЗаданий[НомерЗадания].Использование;
		КонецЦикла;
	Исключение
		Сообщить("Не удалось получить состояние регламентного задания ""Создание поступлений товаров от производства (по заказам, созданных вручную)"". " + ОписаниеОшибки());
	КонецПопытки;
	Попытка
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Метаданные","СозданиеПоступленийТоваровОтПроизводстваПоУдаленнойБазе");
		МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(СтруктураОтбора);
		Для НомерЗадания = 0 По МассивЗаданий.Количество()-1 Цикл
			АвтоматическиСоздаватьДокументыПоступленийПоУдаленнойБазе = МассивЗаданий[НомерЗадания].Использование;
		КонецЦикла;
	Исключение
		Сообщить("Не удалось получить состояние регламентного задания ""Создание поступлений товаров от производства (удаленное подключение)"". " + ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное("АрхивацияПрикрепленныхДанных");
		НаборКонстант.ВыполнятьАрхивациюПрикрепленныхДанных = РегЗадание.Использование;
	Исключение
		Сообщить("Не удалось получить состояние регламентного задания ""Архивация прикрепленных данных"". " + ОписаниеОшибки());
	КонецПопытки;
	
	ОбновитьЭлементыФормыНаСервере("Все");
	
	Если Параметры.Свойство("ТекущаяСтраница") Тогда
		ИмяСтраницы = Параметры.ТекущаяСтраница;
		Если Элементы.Найти(ИмяСтраницы) <> Неопределено Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ИмяСтраницы];
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(НаборКонстант.ИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
		ВариантДетализацииВзаиморасчетов = 1;
	КонецЕсли;
	УправлениеПолемИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки();
	
	Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.СписокВыбора.Очистить();
	Если ТипЗнч(НаборКонстант.ИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДополнительныеОтчетыИОбработки");
		ВариантДетализацииВзаиморасчетов = 1;
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.КнопкаВыбора = Истина;
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.РежимВыбораИзСписка = Ложь;
	Иначе
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.КнопкаВыбора = Ложь;
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.РежимВыбораИзСписка = Истина;
		СхемаКомпоновкиДанныхДВК = Отчеты.ДетализацияВзаиморасчетовСКонтрагентом.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		Для каждого ВариантОтчета из СхемаКомпоновкиДанныхДВК.ВариантыНастроек Цикл
			//++ #14300
			Если ВариантОтчета.Имя = "9194_Детальный по документам" Тогда
				Продолжить;
			КонецЕсли;
			//-- #14300
			Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.СписокВыбора.Добавить(ВариантОтчета.Имя, ВариантОтчета.Представление);
		КонецЦикла;
	КонецЕсли;

	// #13426 пока скрываем	
	Элементы.СофтФонРарус.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "АвторизацияНаСайте_ПолученКлючДоступа" Тогда
		Объект.ВКонтакте_access_token = Параметр;
		
	ИначеЕсли ИмяСобытия = "Запись_ДетализацияУчетаЛидов" Тогда
		ОбновитьЭлементыФормыНаСервере("Лиды");

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИПроцедурыСохранения

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьБезЗакрытия(Команда)
	СохранитьНаКлиенте(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(ЗакрытьФормуНастроек = Истина)

	Если НастройкиСделаныКорректно() Тогда
		ЕстьИзменения = НЕ ТекущийПорядокФормированияНаименованияПленки = Объект.ПорядокФормированияНаименованияПленки
		                ИЛИ НЕ ТекущийПорядокФормированияНаименованияФактуры = Объект.ПорядокФормированияНаименованияФактуры;
		Если ЕстьИзменения Тогда
			ДополнительныеПараметры = Новый Структура("ЗакрытьФормуНастроек", ЗакрытьФормуНастроек);
			Если НЕ ТекущийПорядокФормированияНаименованияПленки = Объект.ПорядокФормированияНаименованияПленки Тогда
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПереименоватьСуществующуюПленку", ЭтаФорма, ДополнительныеПараметры);
				ПоказатьВопрос(Оповещение,"Изменилось правило формирования наименования пленки. Переименовать существующую номенклатуру пленки?", РежимДиалогаВопрос.ДаНет, 0);
			КонецЕсли;
			Если НЕ ТекущийПорядокФормированияНаименованияФактуры = Объект.ПорядокФормированияНаименованияФактуры Тогда			
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПереименоватьСуществующуюФактуру", ЭтаФорма, ДополнительныеПараметры);
				ПоказатьВопрос(Оповещение,"Изменилось правило формирования наименования фактуры. Переименовать существующую фактуру?", РежимДиалогаВопрос.ДаНет, 0);
			КонецЕсли;
		Иначе
			СохранитьНаСервере();
			Оповестить("Запись_НастройкиПрограммы");
			ОбновитьИнтерфейс();
			Если ЗакрытьФормуНастроек Тогда
				ЭтаФорма.Закрыть();
			Иначе
				ОбновитьЭлементыФормы();
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
		
	Набор = РеквизитФормыВЗначение("НаборКонстант");
    Набор.Записать();
	
	// вкладка "Лиды"
	НастройкиИзменения = НастройкиИзмененияДатыСледующегоКонтактаЛида.Выгрузить(, "Событие, Сдвиг");
	НастройкиИзменения.Колонки.Добавить("ИмяСобытия", Новый ОписаниеТипов("Строка"));
	Для Каждого СтрокаНастройки Из НастройкиИзменения Цикл
		ИндексЗначения = Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида.Индекс(СтрокаНастройки.Событие);
		СтрокаНастройки.ИмяСобытия = Метаданные.Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида.ЗначенияПеречисления[ИндексЗначения].Имя; 
	КонецЦикла;
	НастройкиИзменения.Колонки.Удалить("Событие");
	Константы.НастройкаИзмененияДатыСледующегоКонтактаЛида.Установить(Новый ХранилищеЗначения(НастройкиИзменения));	
	
	// вкладка "Замеры"
	Константы.ОформлениеГрафикаЗамеров.Установить(Новый ХранилищеЗначения(НастройкаОформленияГрафикаЗамеров));
	
	//мобильный клиент
	Константы.ОтображатьЗамерыБудущейДатыВМобильномКлиентеЗамерщика.Установить(Объект.ОтображатьЗамерыБудущейДатыВМобильномКлиентеЗамерщика);
	
	НаборЗаписей = РегистрыСведений.МобильныйКлиентЗамерщикаДоступныеВидыЦен.СоздатьНаборЗаписей();
	Для Каждого СтрокаТаблицы Из МобильныйКлиентЗамерщикаДоступныеВидыЦен Цикл 
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВидЦены = СтрокаТаблицы.ВидЦены; 
		НоваяЗапись.ПоУмолчанию = СтрокаТаблицы.ПоУмолчанию; 
	КонецЦикла; 
	НаборЗаписей.Записать(); 
	
	НаборЗаписей = РегистрыСведений.МобильныйКлиентЗамерщикаДоступныеВидыСкидок.СоздатьНаборЗаписей();
	Для Каждого СтрокаТаблицы Из МобильныйКлиентЗамерщикаДоступныеВидыСкидок Цикл 
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ВидСкидки = СтрокаТаблицы.ВидСкидки; 
	КонецЦикла; 
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.МобильныйКлиентЗамерщикаДоступнаяНоменклатура.СоздатьНаборЗаписей();
	Для Каждого СтрокаТаблицы Из МобильныйКлиентЗамерщикаДоступнаяНоменклатура Цикл 
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Номенклатура = СтрокаТаблицы.Номенклатура; 
	КонецЦикла; 
	НаборЗаписей.Записать();
	
	//монтажи
	//Нужно у статуса "Закрыт" установить доступность
	Попытка
		СтатусЗакрыт = Справочники.РезультатыМонтажа.Закрыт.ПолучитьОбъект();
		Если НЕ СтатусЗакрыт.Доступен = НаборКонстант.ИспользоватьСтатусЗакрытВМонтаже Тогда
			СтатусЗакрыт.Доступен = НаборКонстант.ИспользоватьСтатусЗакрытВМонтаже;			
			СтатусЗакрыт.Записать();
		КонецЕсли;
	Исключение		
	КонецПопытки;
	Константы.ОформлениеГрафикаМонтажей.Установить(Новый ХранилищеЗначения(НастройкаОформленияГрафикаМонтажей));
	
	//софтфон
	Константы.ТелефонияАдминистраторЛогин.Установить(СокрЛП(ТелефонияАдминистраторЛогин));
	//Константы.ТелефонияАдминистраторПароль.Установить(СокрЛП(ТелефонияАдминистраторПароль));
	//Константы.ТелефонияАдресСервера.Установить(СокрЛП(ТелефонияАдресСервера));
	Константы.ТелефонияНомерПорта.Установить(СокрЛП(ТелефонияНомерПорта));
	//Константы.ТелефонияSimplitЛогин.Установить(СокрЛП(ТелефонияSimplitЛогин));
	//Константы.ТелефонияSimplitПароль.Установить(СокрЛП(ТелефонияSimplitПароль));
	СохранитьНастройкуПотолки("ТелефонияСтрана");
	Константы.ИспользуетсяИнтеграцияСIPАТС.Установить(СофтФон.ИспользуетсяИнтеграцияСIPАТС());
	Константы.ИспользоватьСервисSmartConnector.Установить(СофтФон.ИспользуетсяИнтеграцияСIPАТС() 
															И Константы.ВариантБиблиотекиТелефонии.Получить() = 0
															И НЕ Константы.ИспользоватьROMAsterisk.Получить());	
	//производство
	//Константы.ГруппаНоменклатурыПродукция.Установить(ГруппаНоменклатурыПродукция);
	//Константы.СуффиксАртПотолок.Установить(Объект.СуффиксАртПотолок);
	//Константы.СуффиксМногофактурныйПотолок.Установить(Объект.СуффиксМногофактурныйПотолок);
	//Константы.ПорядокФормированияНомераТиповогоОтреза.Установить(Объект.ПорядокФормированияНомераТиповогоОтреза);
	//Константы.ГруппаНоменклатурыДляОстатков.Установить(Объект.ГруппаНоменклатурыДляОстатков);
	//Константы.КонтролироватьМаксимальноеКоличествоПотолковВЧасКОтгрузке.Установить(Объект.КонтролироватьМаксимальноеКоличествоПотолковВЧасКОтгрузке);
	//Константы.МаксимальноеКоличествоПотолковВЧасКОтгрузке.Установить(Объект.МаксимальноеКоличествоПотолковВЧасКОтгрузке);
	// №14932 СохранитьНастройкуПотолки("ЗаказыватьТоварыПриОформленииЗаказаНаПроизводствоНаОснованииЗаказаПокупателя");
	Константы.ОформлениеЗаказовПокупателей.Установить(Новый ХранилищеЗначения(НастройкаОформленияЗаказов));
	СохранитьНастройкуПотолки("ВремяПодсветкиЗнППоДатеОжидаемойОтгрузки", Ложь);
	СохранитьНастройкуПотолки("ВремяПодсветкиЗППоДатеОжидаемойОтгрузки", Ложь);
	
	//розница
	//Константы.ГруппаНовыхКонтрагентовРозницы.Установить(Объект.ГруппаНовыхКонтрагентовРозницы);
	Константы.ПорядокФормированияНаименованияПотолкаРозницы.Установить(Объект.ПорядокФормированияНаименованияПотолкаРозницы);
	//Константы.ЗаказПоставщикуВыделятьУслугиРаскрояИзПотолка.Установить(Объект.ЗаказПоставщикуВыделятьУслугиРаскрояИзПотолка);
	
	//Константы.АвтоматическиПрисваиватьНомерДоговораВЗаказДоговоре.Установить(Объект.АвтоматическиПрисваиватьНомерДоговораВЗаказДоговоре);		
	НовыйШаблон = РегистрыСведений.ШаблоныНомеровДоговоров.СоздатьМенеджерЗаписи();
	НовыйШаблон.Период = НачалоДня(ТекущаяДатаСеанса());
	НовыйШаблон.ШаблонНомераДоговора = ШаблонНомераДоговора;
	НовыйШаблон.ПериодичностьНомераДоговора = ПериодичностьНомераДоговора;
	НовыйШаблон.Записать();
	
	Константы.ИспользоватьВерсионированиеОбъектов.Установить(Объект.ИспользоватьВерсионированиеОбъектов);
	//Константы.ИспользоватьСправочникКомнатВРознице.Установить(Объект.ИспользоватьСправочникКомнатВРознице);
	//Константы.ИспользоватьМаскуВводаТелефона.Установить(Объект.ИспользоватьМаскуВводаТелефона);
	//Константы.НастройкаПредварительногоРасчетаЗаказаВРозницеПоУмолчанию.Установить(Объект.НастройкаПредварительногоРасчетаЗаказаВРозницеПоУмолчанию);
	
	//загрузка из построителя
	//Константы.ГруппаНоменклатурДляФактуры.Установить(ГруппаНоменклатурДляФактуры);
	//Константы.АвтоматическиЗагружатьВБазуЧертежПотолкаИзИзиСилинг.Установить(АвтоматическиЗагружатьВБазуЧертежПотолкаИзИзиСилинг);
	//Константы.ПорядокФормированияНаименованияПотолка.Установить(Объект.ПорядокФормированияНаименованияПотолка);
	Константы.ПорядокФормированияНаименованияПленки.Установить(Объект.ПорядокФормированияНаименованияПленки);
	//Константы.ПравилоОпределенияОтреза.Установить(Объект.ПравилоОпределенияОтреза);
	Константы.ВыделятьУслугиРаскрояИзПотолкаПриЗагрузкеИзПостроителяВЗаказДоговор.Установить(Объект.ВыделятьУслугиРаскрояИзПотолкаПриЗагрузкеИзПостроителяВЗаказДоговор);
	//Константы.ПрефиксНаименованияПотолка.Установить(Объект.ПрефиксНаименованияПотолка);
	СохранитьНастройкуПотолки("ПорядокФормированияНаименованияФактуры");
	//СохранитьНастройкуПотолки("ПорядокФормированияНаименованияОтреза");
	//СохранитьНастройкуПотолки("ПрефиксНаименованияОтреза");
	
	//смс
	Константы.ЕВостокСМСЛогин.Установить(ЕВостокСМСЛогин);
	Константы.ЕВостокСМСПароль.Установить(ЕВостокСМСПароль);
	Константы.ЕВостокСМСНомерСервиса.Установить(ЕВостокСМСНомерСервиса);
	Константы.ЕВостокСМСПодпись.Установить(ЕВостокСМСПодпись);
	Константы.АвтоматическиСоздаватьПоздравленияСДнемРожденияПоСМС.Установить(АвтоматическиСоздаватьПоздравленияСДнемРожденияПоСМС);
	Константы.ШаблонСМСПоздравленияНаДеньРождения.Установить(ШаблонСМСПоздравленияНаДеньРождения);
	Константы.ГруппаКонтрагентовДляПоздравленияСДнемРожденияЧерезСМС.Установить(ГруппаКонтрагентовДляПоздравленияСДнемРожденияЧерезСМС);
	//Константы.ОтправлятьСМСЗамерщикуПриПланированииЗамера.Установить(ЕВостокОтправлятьСМСЗамерщикуПриПланированииЗамера);
	//Константы.ОтправлятьСМСКлиентуПриПланированииЗамера.Установить(ЕВостокОтправлятьСМСКлиентуПриПланированииЗамера);
	//Константы.ШаблонТекстаСМСОЗамереЗамерщику.Установить(ЕВостокШаблонТекстаСМСОЗамереЗамерщику);
	//Константы.ШаблонТекстаСМСОЗамереКлиенту.Установить(ЕВостокШаблонТекстаСМСОЗамереКлиенту);
	Константы.НомерШаблонаТекстаСМСКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен.Установить(Объект.НомерШаблонаТекстаСМСКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен);
	Константы.ОтправлятьСМСОЗапланированномМонтаже.Установить(ЕВостокОтправлятьСМСОЗапланированномМонтаже);
	Константы.ШаблонТекстаСМСОМонтажеКлиенту.Установить(ЕВостокШаблонТекстаСМСОМонтажеКлиенту);
	Константы.ШаблонТекстаСМСОМонтажеМонтажнику.Установить(ЕВостокШаблонТекстаСМСОМонтажеМонтажнику);
	Константы.СМСРуAPIID.Установить(СМСРуAPIID);
	Константы.ОтправлятьСМСВсемКонтрагентамКромеПризнака.Установить(ОтправлятьСМСВсемКонтрагентамКромеПризнака);	
	Константы.ОтправлятьСМСТолькоКонтрагентамСПризнаком.Установить(ОтправлятьСМСТолькоКонтрагентамСПризнаком);
	Константы.ОтправлятьСМСКонтрагентуПоПКО.Установить(Объект.ОтправлятьСМСКонтрагентуПоПКО);
	//Константы.ШаблонСМСКонтрагентуПоПКО.Установить(Объект.ШаблонСМСКонтрагентуПоПКО);
	Константы.ШаблонТекстаСМСПоЗаявкеНаДоставку.Установить(Объект.ШаблонТекстаСМСПоЗаявкеНаДоставку);
	Константы.ШаблонТекстаСМСПоЗаказуПокупателя.Установить(Объект.ШаблонТекстаСМСПоЗаказуПокупателя);
	Константы.ОтправлятьСМСПриИзмененииДатыМонтажа.Установить(ОтправлятьСМСПриИзмененииДатыМонтажа);
	Константы.ШаблонТекстаСМСОИзмененииДатыМонтажаКлиенту.Установить(ШаблонТекстаСМСОИзмененииДатыМонтажаКлиенту);
	Константы.ШаблонТекстаСМСОИзмененииДатыМонтажаМонтажнику.Установить(ШаблонТекстаСМСОИзмененииДатыМонтажаМонтажнику);
	
	Константы.ГруппаКонтрагентовДляОтправкиСМСПоДолгам.Установить(новый ХранилищеЗначения(ГруппаКонтрагентовДляОтправкиСМСПоДолгам));
	
	//Интеграции
	Константы.ИспользоватьПотолкиОнлайн.Установить(ИспользоватьПотолкиОнлайн);
	Константы.АдресДилерскогоСайта.Установить(АдресДилерскогоСайта);
	Константы.ИспользоватьОбменСПорталом.Установить(Объект.ИспользоватьОбменСПорталом);
	
	//Основные
	Константы.ВалютаУчета.Установить(ВалютаУчета);
	//Константы.ИспользоватьДополнительныеРеквизитыИСведения.Установить(Объект.ИспользоватьДополнительныеРеквизитыИСведения);
	Константы.ИспользоватьОбщиеДополнительныеЗначения.Установить(Объект.ИспользоватьОбщиеДополнительныеЗначения);
	Константы.ИспользоватьОбщиеДополнительныеРеквизитыИСведения.Установить(Объект.ИспользоватьОбщиеДополнительныеРеквизитыИСведения);
	// №12800 Константы.НеИспользоватьПрефиксОрганизацииВНомереДокумента.Установить(Объект.НеИспользоватьПрефиксОрганизацииВНомереДокумента);
	//Константы.ПолФизЛицаОбязателенКЗаполнению.Установить(Объект.ПолФизЛицаОбязателенКЗаполнению);
	//СохранитьНастройкуПотолки("ВыключитьПредпросмотрПрикрепленныхФайловВДокументах");
	//СохранитьНастройкуПотолки("ЗапретПроведенияДокументовБудущимЧислом");
	//СохранитьНастройкуПотолки("ОтображатьЗадолженностьКонтрагентаВВалюте");
	//СохранитьНастройкуПотолки("ВалютаОтображенияЗадолженностиКонтрагента");
	//СписокEmailСтрокой = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(СписокEmailПоКонтролюПравокЗаднимЧислом.ВыгрузитьЗначения(), ";", Истина);
	СписокEmailСтрокой = СтрСоединить(СписокEmailПоКонтролюПравокЗаднимЧислом.ВыгрузитьЗначения(), ";");
	Константы.СписокEmailПоКонтролюПравокЗаднимЧислом.Установить(СписокEmailСтрокой);
		
	//лицензии
	
	//ройстат
	Константы.РойстатЛогин.Установить("");
	Константы.РойстатПароль.Установить(Объект.РойстатПароль);
	Константы.АдресВебхуковРойстат.Установить(Объект.АдресВебхуковРойстат);
	
	//интеграции - ВКонтакте
	Константы.ВКонтакте_access_token.Установить(Объект.ВКонтакте_access_token);
	Константы.ВКонтакте_app_id.Установить(Объект.ВКонтакте_app_id);
	Константы.ВКонтакте_ПраваДоступа.Установить(Объект.ВКонтакте_ПраваДоступа);
	
	//скидки и бонусы
	//Константы.ИспользоватьАвтоматическиеСкидки.Установить(ИспользоватьАвтоматическиеСкидки);
	//Константы.ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат.Установить(ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат);
	
	//Константы.УчитыватьБонусы.Установить(Объект.УчитыватьБонусы);
	//Константы.АвтоматическоеНачислениеБонусов.Установить(Объект.АвтоматическоеНачислениеБонусов);
	//Константы.МаксимальныйРазмерБонусовКСписаниюПоДокументу.Установить(Объект.МаксимальныйРазмерБонусовКСписаниюПоДокументу);
	//Константы.НачислятьБонусыПоДисконтнойКартеПриЗачетеБонусовКакСкидку.Установить(Объект.НачислятьБонусыПоДисконтнойКартеПриЗачетеБонусовКакСкидку);
	Если НаборКонстант.УчитыватьБонусы Тогда
		Если Объект.ДержательБонусов = 0 Тогда
			Константы.УчетБонусовПоДисконтнымКартам.Установить(Ложь);
			Константы.УчетБонусовПоКонтрагентам.Установить(Истина);
		Иначе
			Константы.УчетБонусовПоДисконтнымКартам.Установить(Истина);
			Константы.УчетБонусовПоКонтрагентам.Установить(Ложь);
		КонецЕсли;
	Иначе
		Константы.УчетБонусовПоДисконтнымКартам.Установить(Ложь);
		Константы.УчетБонусовПоКонтрагентам.Установить(Ложь);
	КонецЕсли;
	
	//лиды
	ОбщийМодульСервер.СохранитьНастройкуОбязательныхПолейКЗаполнениюЛида(ОбязательныеПоляКЗаполнениюЛида);
	
	//++16681
	//Монтажи
	ОбщийМодульСервер.СохранитьНастройкуОтображатьПрочихИсполнителей(ОтображатьПрочихИсполнителей); 
	//--16681
	
	//++ №12763
	РегистрыСведений.НастройкиВремениРеакцииПоЛидам.СохранитьНастройкуВремениРеакцииПоЛидам(НастройкиВремениРеакцииПоЛидам);
	РегистрыСведений.ПолучателиУведомленийОПросроченныхЛидах.СохранитьСписокПользователей(ПолучателиУведомленийОПросроченныхЛидах);
	//-- №12763
	
	//расширенные сервисы
	МассивКаналовВатсап = Новый Массив;
	Для Каждого ТекущаяЗапись Из КаналыWazzup Цикл
		СтруктураКанала = Новый Структура;
		СтруктураКанала.Вставить("ИД", ТекущаяЗапись.ИД);
		СтруктураКанала.Вставить("Тип", ТекущаяЗапись.Тип);
		СтруктураКанала.Вставить("НомерТелефона", ТекущаяЗапись.НомерТелефона);
		СтруктураКанала.Вставить("Состояние", ТекущаяЗапись.Состояние);
		МассивКаналовВатсап.Добавить(СтруктураКанала);
	КонецЦикла;
	ХранилищеВКонстанту = Новый ХранилищеЗначения(МассивКаналовВатсап, Новый СжатиеДанных(9));
	Константы.КаналыВатсап.Установить(ХранилищеВКонстанту);
	
	//включим/отключим регламентные задания
	Попытка
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Метаданные","ОтправкаСМС");
		МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(СтруктураОтбора);
		Для НомерЗадания = 0 По МассивЗаданий.Количество()-1 Цикл
			МассивЗаданий[НомерЗадания].Использование = НаборКонстант.АвтоматическаяРассылкаСМС;
			МассивЗаданий[НомерЗадания].Записать();
		КонецЦикла;
	Исключение
		Сообщить("Не удалось настроить регламентное задание ""ОтправкаСМС"". " + ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Метаданные","ПроверкаРекламныхЭлектронныхЯщиков");
		МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(СтруктураОтбора);
		Для НомерЗадания = 0 По МассивЗаданий.Количество()-1 Цикл
			МассивЗаданий[НомерЗадания].Использование = НаборКонстант.СоздаватьВходящиеКонтактыПоВходящимЭлектроннымПисьмам;
			МассивЗаданий[НомерЗадания].Записать();
		КонецЦикла;
	Исключение
		Сообщить("Не удалось настроить регламентное задание ""ПроверкаРекламныхЭлектронныхЯщиков"". " + ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное("АрхивацияПрикрепленныхДанных");
		РегЗадание.Использование = НаборКонстант.ВыполнятьАрхивациюПрикрепленныхДанных;
		РегЗадание.Записать();
	Исключение
		Сообщить("Не удалось настроить регламентное задание ""Архивация прикрепленных данных"". " + ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Метаданные","СозданиеПоступленийТоваровОтПроизводства");
		МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(СтруктураОтбора);
		Для НомерЗадания = 0 По МассивЗаданий.Количество()-1 Цикл
			МассивЗаданий[НомерЗадания].Использование = АвтоматическиСоздаватьДокументыПоступленийТоваровОтПроизводстваНаРозницу;
			МассивЗаданий[НомерЗадания].Записать();
		КонецЦикла;
	Исключение
		Сообщить("Не удалось настроить регламентное задание ""Создание поступлений товаров от производства (по интеркампани)"". " + ОписаниеОшибки());
	КонецПопытки;
	Попытка
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Метаданные","СозданиеПоступленийТоваровОтПроизводстваПоРучнымЗаказам");
		МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(СтруктураОтбора);
		Для НомерЗадания = 0 По МассивЗаданий.Количество()-1 Цикл
			МассивЗаданий[НомерЗадания].Использование = АвтоматическиСоздаватьДокументыПоступленийПоРучнымЗаказам;
			МассивЗаданий[НомерЗадания].Записать();
		КонецЦикла;
	Исключение
		Сообщить("Не удалось настроить регламентное задание ""Создание поступлений товаров от производства (по заказам, созданных вручную)"". " + ОписаниеОшибки());
	КонецПопытки;
	Константы.СоздаватьДокументыПоступленийПоРучнымЗаказам.Установить(НаборКонстант.РучнойЗапускОбработкиСозданияДокументовПоступленийПоРучнымЗаказам 
																	  ИЛИ АвтоматическиСоздаватьДокументыПоступленийПоРучнымЗаказам);	
																	  
	Попытка
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Метаданные","СозданиеПоступленийТоваровОтПроизводстваПоУдаленнойБазе");
		МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(СтруктураОтбора);
		Для НомерЗадания = 0 По МассивЗаданий.Количество()-1 Цикл
			МассивЗаданий[НомерЗадания].Использование = АвтоматическиСоздаватьДокументыПоступленийПоУдаленнойБазе;
			МассивЗаданий[НомерЗадания].Записать();
		КонецЦикла;
	Исключение
		Сообщить("Не удалось настроить регламентное задание ""Создание поступлений товаров от производства (удаленное подключение)"". " + ОписаниеОшибки());
	КонецПопытки;
	Константы.СоздаватьДокументыПоступленийПоУдаленнойБазе.Установить(НаборКонстант.РучнойЗапускОбработкиСозданияДокументовПоступленийПоУдаленнойБазе 
																	  ИЛИ АвтоматическиСоздаватьДокументыПоступленийПоУдаленнойБазе);
																	  
	ПравилоПоискаИсторииОбращений = Новый Структура;
	ПравилоПоискаИсторииОбращений.Вставить("ПоТелефону", ПравилоПоискаИсторииОбращенийПоТелефону);
	ПравилоПоискаИсторииОбращений.Вставить("ПоАдресуЭлектроннойПочты", ПравилоПоискаИсторииОбращенийПоАдресуЭлектроннойПочты);		
	Константы.ПравилоПоискаИсторииОбращений.Установить(Новый ХранилищеЗначения(ПравилоПоискаИсторииОбращений));
	
	Если ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента Тогда
		МобильныйКлиент.ОбновитьФлагАктуальностиНоменклатуры(Неопределено);
	КонецЕсли;
	
	Попытка
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное("ОтправкаПисемПоЗаданиям");
		РегЗадание.Использование = НаборКонстант.ОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетов;
		РегЗадание.Записать();
	Исключение
		Сообщить("Не удалось настроить регламентное задание ""Отправка писем по заданиям"". " + ОписаниеОшибки());
	КонецПопытки;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Функция НастройкиСделаныКорректно()
	
	Результат = Истина;
	
	// проверки на сервере
	Результат = НастройкиСделаныКорректноНаСервере();
	Если НЕ Результат Тогда
		Возврат Результат;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НастройкиСделаныКорректноНаСервере()
	
	Результат = Истина;
	
	//Если НаборКонстант.ИспользоватьВнутренниеЗаказы Тогда
	//	Если ЗначениеЗаполнено(НаборКонстант.НастройкаИнтеркампаниДляВнутреннихЗаказов) Тогда
	//		Если НЕ НаборКонстант.НастройкаИнтеркампаниДляВнутреннихЗаказов.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
	//			Сообщить("Раздел ""Производство"": выбрана неправильная настройка интеркампани для внутренних заказов: в настройке НЕ одна организация производства и продажи");
	//			Возврат Ложь;
	//		КонецЕсли;
	//	Иначе
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Производство"": не указана настройка интеркампани для внутренних заказов", , "НаборКонстант.НастройкаИнтеркампаниДляВнутреннихЗаказов");
	//		Возврат Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если НаборКонстант.ПереноситьВАрхивРасчетыПостроителяПроизводство
		И НЕ НаборКонстант.ИндивидуальныеКаталогиЗагрузкиЧертежейИзEasyCeiling 
		И ПустаяСтрока(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Загрузка из построителя"": не указана ""Папка резервных копий""", , "НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг");
			Возврат Ложь;
	КонецЕсли;
		
	Если НаборКонстант.ПереноситьФайлыВАрхивПриЗагрузкеПотолкаИзПостроителяВРознице
		И НЕ НаборКонстант.ПапкиОпределяютсяВКарточкеПользователяРозница 
		И ПустаяСтрока(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Загрузка из построителя"": не указана ""Папка резервных копий""", , "НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница");
			Возврат Ложь;
	КонецЕсли;
	
	//#8288
	Если НаборКонстант.ДополнительнаяОценкаЗапасовВВалюте
		И НЕ ЗначениеЗаполнено(НаборКонстант.ВалютаДополнительногоУчетаЗапасов) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Основные"": не указана ""Валюта дополнительного учета""", , "НаборКонстант.ВалютаДополнительногоУчетаЗапасов");
			Возврат Ложь;
	КонецЕсли;
		
	//#11670   #12523 закомментировано
	//Если ЗначениеЗаполнено(НаборКонстант.ПравилоОпределенияОтреза) 
	//	И НаборКонстант.ПравилоОпределенияОтреза = НаборКонстант.ПравилоОпределенияТиповогоОтреза Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Загрузка из построителя"": правила определения отреза и типового отреза не могут иметь одинаковые значения", , "НаборКонстант.ПравилоОпределенияТиповогоОтреза");
	//		Возврат Ложь;
	//КонецЕсли;	
	
	ВремТаблицаВидовЦенМобильногоЗамерщика = МобильныйКлиентЗамерщикаДоступныеВидыЦен.Выгрузить();
	ВремТаблицаВидовЦенМобильногоЗамерщика.Колонки.Добавить("Количество", Новый ОписаниеТипов("число"));
	Для Каждого ТекСтрока Из ВремТаблицаВидовЦенМобильногоЗамерщика Цикл
		ТекСтрока.Количество = 1;
	КонецЦикла;
	ВремТаблицаВидовЦенМобильногоЗамерщика.Свернуть("ВидЦены", "Количество");
	Для Каждого ТекСтрока Из ВремТаблицаВидовЦенМобильногоЗамерщика Цикл
		Если ТекСтрока.Количество > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Расширенные сервисы"": доступные виды цен мобильного замерщика - вид цены """+ТекСтрока.ВидЦены+""" указан более одного раза", , "МобильныйКлиентЗамерщикаДоступныеВидыЦен");
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ВремМобильныйКлиентЗамерщикаДоступныеВидыСкидок = МобильныйКлиентЗамерщикаДоступныеВидыСкидок.Выгрузить();
	ВремМобильныйКлиентЗамерщикаДоступныеВидыСкидок.Колонки.Добавить("Количество", Новый ОписаниеТипов("число"));
	Для Каждого ТекСтрока Из ВремМобильныйКлиентЗамерщикаДоступныеВидыСкидок Цикл
		ТекСтрока.Количество = 1;
	КонецЦикла;
	ВремМобильныйКлиентЗамерщикаДоступныеВидыСкидок.Свернуть("ВидСкидки", "Количество");
	Для Каждого ТекСтрока Из ВремМобильныйКлиентЗамерщикаДоступныеВидыСкидок Цикл
		Если ТекСтрока.Количество > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Расширенные сервисы"": доступные виды скидок мобильного замерщика - вид скидки """+ТекСтрока.ВидСкидки+""" указан более одного раза", , "МобильныйКлиентЗамерщикаДоступныеВидыСкидок");
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ВремМобильныйКлиентЗамерщикаДоступнаяНоменклатура = МобильныйКлиентЗамерщикаДоступнаяНоменклатура.Выгрузить();
	ВремМобильныйКлиентЗамерщикаДоступнаяНоменклатура.Колонки.Добавить("Количество", Новый ОписаниеТипов("число"));
	Для Каждого ТекСтрока Из ВремМобильныйКлиентЗамерщикаДоступнаяНоменклатура  Цикл
		ТекСтрока.Количество = 1;
	КонецЦикла;
	ВремМобильныйКлиентЗамерщикаДоступнаяНоменклатура.Свернуть("Номенклатура", "Количество");
	Для Каждого ТекСтрока Из ВремМобильныйКлиентЗамерщикаДоступнаяНоменклатура  Цикл
		Если ТекСтрока.Количество > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Расширенные сервисы"": доступная номенклатура мобильного замерщика - """+ТекСтрока.Номенклатура+""" указана более одного раза", , "МобильныйКлиентЗамерщикаДоступнаяНоменклатура");
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	//#13221
	Если НаборКонстант.ВестиЛоггированиеСобытийАТС
		И НЕ ЗначениеЗаполнено(НаборКонстант.ЛогСобытийАТСОтключитьПосле) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""IP телефония"": не указана ""Дата окончания"" при включенной настройке логирования событий АТС", , "НаборКонстант.ЛогСобытийАТСОтключитьПосле");
		Возврат Ложь;
	КонецЕсли;
	Если НаборКонстант.ВестиЛогированиеЗапросовРойстат
		И НЕ ЗначениеЗаполнено(НаборКонстант.ЛогРойстатОтключитьПосле) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Расширенные сервисы"": не указана ""Дата окончания"" при включенной настройке логирования запросов Ройстат", , "НаборКонстант.ЛогРойстатОтключитьПосле");
		Возврат Ложь;
	КонецЕсли;	
	
	// #13536
	Если НаборКонстант.ИспользоватьШтрихкодированиеВПечатныхФормах
		И НЕ ЗначениеЗаполнено(НаборКонстант.ВидШтрихкодаДокументовВПечатныхФормах) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Печатные формы"": не указан ""Вид штрихкода документов""", , "НаборКонстант.ВидШтрихкодаДокументовВПечатныхФормах");
		Возврат Ложь;
	КонецЕсли;
	
	Если НаборКонстант.ВидБонуснойСистемы = Перечисления.ВидыБонусныхСистем.UDS
		И НЕ НаборКонстант.UDS_ИспользоватьИнтеграцию Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Интеграции"": не включена настройка ""Использовать интеграцию UDS"" при виде бонусной системы ""UDS""", , "НаборКонстант.UDS_ИспользоватьИнтеграцию");
		Возврат Ложь;
	КонецЕсли;
	
	// №14145 проверка заполнения вида цены и номенклатуры для мобильного клиента замерщика
	Если ОбщиеНастройкиМКЗамерщика Тогда
		
		//Если НаборКонстант.ИспользуетсяПредварительныйРасчетВМобильномКлиентеЗамерщика И НаборКонстант.МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию.Пустая() Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Расширенные сервисы"": не заполнена организация замерщика (мобильный клиент замерщика)",, "НаборКонстантМобильныйКлиентЗамерщикаОрганизацияПоУмолчанию");
		//	Результат = Ложь;
		//КонецЕсли;
		
		НомерСтроки = 1;
		Для Каждого ТекущаяСтрока Из МобильныйКлиентЗамерщикаДоступныеВидыЦен Цикл
			
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Расширенные сервисы"": Не заполнена колонка ""Вид цены"" в строке " + НомерСтроки + " списка ""Доступные виды цен""",, "МобильныйКлиентЗамерщикаДоступныеВидыЦен");
				Результат = Ложь;
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		НомерСтроки = 1;
		Для Каждого ТекущаяСтрока Из МобильныйКлиентЗамерщикаДоступнаяНоменклатура Цикл
			
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Расширенные сервисы"": Не заполнена колонка ""Номенклатура"" в строке " + НомерСтроки + " списка ""Доступная номенклатура""",, "МобильныйКлиентЗамерщикаДоступнаяНоменклатура");
				Результат = Ложь;
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
			
	КонецЕсли;
	
	//#16861
	Если ЗначениеЗаполнено(НаборКонстант.ВремяНачалаСледующегоКонтакта)
		И ЗначениеЗаполнено(НаборКонстант.ВремяОкончанияСледующегоКонтакта) Тогда
		
		Если НаборКонстант.ВремяНачалаСледующегоКонтакта > НаборКонстант.ВремяОкончанияСледующегоКонтакта Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Розница"": ""Время начала следующего контакта"" превышает ""Время окончания следующего контакта""", , "НаборКонстант.ВремяНачалаСледующегоКонтакта");
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НаборКонстант.ШагВремениВыбораСледующегоКонтакта) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Розница"": не заполнена настройка ""Шаг времени в часах в поле выбора времени следующего контакта""", , "НаборКонстант.ШагВремениВыбораСледующегоКонтакта");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ОбновитьЭлементыФормыНаСервере(ИмяВкладки = Неопределено)
	
	Если ИмяВкладки = Неопределено Тогда
		ИмяВкладки = "Все";
	КонецЕсли;
	
	// только при открытии формы
	//Если ИмяВкладки = "Все" Тогда
	//	ОтправлятьДетализациюВзаиморасчетов = НаборКонстант.ОтправлятьДетализациюВзаиморасчетовПриВыполненииЗаказа ИЛИ НаборКонстант.ОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетов; 
	//КонецЕсли;
	
	Если ИмяВкладки = "Основные" ИЛИ ИмяВкладки = "Все" Тогда
		
		Если НаборКонстант.ДополнительнаяОценкаЗапасовВВалюте Тогда
			Если НЕ ЗначениеЗаполнено(НаборКонстант.ВалютаДополнительногоУчетаЗапасов) Тогда				
				Элементы.НаборКонстантВалютаДополнительногоУчетаЗапасов.Доступность = Истина;
			Иначе
				Запрос = Новый Запрос;				
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	ТоварыНаСкладах.Номенклатура КАК Номенклатура
				|ИЗ
				|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
				|ГДЕ
				|	ТоварыНаСкладах.СуммаВал <> 0";
				УстановитьПривилегированныйРежим(Истина);
				РезультатЗапроса = Запрос.Выполнить();
				УстановитьПривилегированныйРежим(Ложь);
				Элементы.НаборКонстантВалютаДополнительногоУчетаЗапасов.Доступность = РезультатЗапроса.Пустой();
			КонецЕсли;
		Иначе
			НаборКонстант.ВалютаДополнительногоУчетаЗапасов = Справочники.Валюты.ПустаяСсылка();
			Элементы.НаборКонстантВалютаДополнительногоУчетаЗапасов.Доступность = Ложь;	
		КонецЕсли;
		
		Если НаборКонстант.ИспользоватьДополнительныеРеквизитыИСведения Тогда
			Элементы.ДополнительныеРеквизитыИСведения.Видимость = Истина;
		Иначе
			Элементы.ДополнительныеРеквизитыИСведения.Видимость = Ложь;
			Объект.ИспользоватьОбщиеДополнительныеЗначения = Ложь;
			Объект.ИспользоватьОбщиеДополнительныеРеквизитыИСведения = Ложь;
		КонецЕсли;
		
		// журнал правок задним числом
		Элементы.ГруппаЖурналПравокЗаднимЧисломНастройки.Доступность = НаборКонстант.ВестиЖурналПравокЗаднимЧислом;
		Элементы.ГруппаEmailПоКонтролюПравокЗаднимЧисломОбщая.Видимость = НаборКонстант.ВестиЖурналПравокЗаднимЧислом; // №1680
		
		Элементы.ГруппаАрхивацияПрикрепленныхДанныхДоп.Доступность = НаборКонстант.ВыполнятьАрхивациюПрикрепленныхДанных;
		
		ИмяСтраницыАрхивации = "ЛокальныйДиск";
		Если НаборКонстант.ВариантАрхивацииПрикрепленныхДанных = Перечисления.ВариантыАрхивацииПрикрепленныхДанных.GoogleDrive Тогда
			ИмяСтраницыАрхивации = "GoogleDrive";
		ИначеЕсли НаборКонстант.ВариантАрхивацииПрикрепленныхДанных = Перечисления.ВариантыАрхивацииПрикрепленныхДанных.ЯндексДиск Тогда
			ИмяСтраницыАрхивации = "ЯндексДиск";
		КонецЕсли;
			
		Элементы.ГруппаСтраницыАрхивации.ТекущаяСтраница = Элементы["ГруппаСтраницаАрхивации" + ИмяСтраницыАрхивации];
		
		Если ИмяВкладки = "Основные" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "ПечатныеФормы" ИЛИ ИмяВкладки = "Все" Тогда

		Элементы.ГруппаПараметрыИспользоватьШтрихкодированиеВПечатныхФормах.Доступность = НаборКонстант.ИспользоватьШтрихкодированиеВПечатныхФормах;		
		Элементы.ДекорацияПредупреждениеШтрихкодПрефикс.Видимость = НаборКонстант.ИспользоватьШтрихкодированиеВПечатныхФормах
															И НЕ НаборКонстант.ВидШтрихкодаДокументовВПечатныхФормах = Перечисления.ВидыШтрихкодаВПечатныхФормах.УникальнаяСсылка;
															
		Если ИмяВкладки = "ПечатныеФормы" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
														
	Если ИмяВкладки = "Запасы" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.ДекорацияКонтрольОстатков.Видимость = НаборКонстант.НеКонтролироватьОстаткиНаСкладах;
		Элементы.ДекорацияОбщиеСклады.Видимость = НаборКонстант.ОбщиеСклады;
		
		Элементы.НаборКонстантВариантОтображенияПредыдущейЦеныВДокументахЗакупки.Доступность = НаборКонстант.ОтображатьПредыдущуюЦенуПоступленияВДокументахЗакупки;
		
		Элементы.ГруппаНастроекДоставки.Видимость = НаборКонстант.УчитыватьДоставкуТовара;
		
		Если ИмяВкладки = "Запасы" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "Лиды" ИЛИ ИмяВкладки = "Все" Тогда
		
		// №12763 Элементы.УДАЛИТЬ_НастройкиВремениРеакцииПоЛидам.Видимость = НаборКонстант.КонтролироватьВремяРеакцииПоЛидам;	
		Элементы.ПолучателиУведомленийОПросроченныхЛидах.Видимость = НаборКонстант.КонтролироватьВремяРеакцииПоЛидам;
		
		Элементы.НаборКонстантДатаНачалаАвтоматическогоСозданияЛидовПоПропущеннымЗвонкам.Доступность = 
			НаборКонстант.АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкам;
		//Элементы.НаборКонстантАвтоматическиСоздаватьЛидыПоПропущеннымЗвонкамТолькоСРекламнымИсточником.Доступность = НаборКонстант.АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкам; // №6369
		Элементы.ГруппаЛидыПоПропущеннымЗвонкамВертикально.Доступность = НаборКонстант.АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкам; // №6369
		
		// #16235
		Элементы.ГруппаЛидыПоПринятымЗвонкамОффлайнВертикально.Доступность = НаборКонстант.АвтоматическиСоздаватьЛидыПоПринятымЗвонкамОффлайн;  
		Элементы.НаборКонстантДатаНачалаАвтоматическогоСозданияЛидовПоПринятымЗвонкамОффлайн.Доступность = 
			НаборКонстант.АвтоматическиСоздаватьЛидыПоПринятымЗвонкамОффлайн;
			
		//#16755
		МенеджерОбъектаДетализации = Справочники.ДетализацияУчетаЛидов;
		Элементы.НаборКонстантВариантИзмененияОтветственногоВЛиде.Видимость = МенеджерОбъектаДетализации.Ответственный.Использовать;
		Элементы.НаборКонстантВариантИзмененияЗамерщикаВЛиде.Видимость = МенеджерОбъектаДетализации.Замерщик.Использовать;
		Элементы.НаборКонстантВариантИзмененияТехнологаВЛиде.Видимость = МенеджерОбъектаДетализации.Технолог.Использовать;	
	
		Если ИмяВкладки = "Лиды" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "Розница" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.НаборКонстантНачислятьВыработкуВРозницеПоПроданномуКоличествуТовара.Доступность = НаборКонстант.КоличествоТоваровКСписаниюВМонтажеНеСоответствуетКоличествуПроданногоТовара;
		
		Элементы.ИзменитьШаблонНомераДоговора.Доступность = НаборКонстант.АвтоматическиПрисваиватьНомерДоговораВЗаказДоговоре;
		Если НЕ НаборКонстант.АвтоматическиПрисваиватьНомерДоговораВЗаказДоговоре Тогда
			НаборКонстант.БлокироватьРедактированиеНомераДоговораДляНовыхЗаказДоговоров = Ложь;
		КонецЕсли;
		Элементы.НаборКонстантБлокироватьРедактированиеНомераДоговораДляНовыхЗаказДоговоров.Доступность = НаборКонстант.АвтоматическиПрисваиватьНомерДоговораВЗаказДоговоре;
		
		Элементы.ГруппаЗадаватьВопрос.Доступность = НаборКонстант.АвтоматическиЗаполнятьМатериалыПоСпецификациям;
		Если НЕ НаборКонстант.АвтоматическиЗаполнятьМатериалыПоСпецификациям Тогда
			НаборКонстант.ЗадаватьВопросПриДобавленииНоменклатурыСоСпецификацией = Ложь;
	        НаборКонстант.ЗадаватьВопросПриИзмененииКоличестваТовараСУказаннойСпецификацией = Ложь;
			НаборКонстант.ЗадаватьВопросПриИзмененииСпецификации = Ложь;
			НаборКонстант.ЗадаватьВопросПриУдаленииТовараСУказаннойСпецификацией = Ложь;
		КонецЕсли;
		
		Элементы.РазрешеннаяНоменклатураТовары.Доступность = НаборКонстант.ОграничитьВыборТоваровВЗаказДоговор;
		Элементы.РазрешеннаяНоменклатураматериалы.Доступность = НаборКонстант.ОграничитьВыборМатериаловВЗаказДоговор;
		
		Элементы.УДАЛИТЬ_НаборКонстантВариантОтображенияСпискаТоваровПриОграниченииВЗаказДоговоре.Доступность = НаборКонстант.ОграничитьВыборТоваровВЗаказДоговор;
		Элементы.УДАЛИТЬ_НаборКонстантВариантОтображенияСпискаМатериаловПриОграниченииВЗаказДоговоре.Доступность = НаборКонстант.ОграничитьВыборМатериаловВЗаказДоговор;
		
		Если ИмяВкладки = "Розница" Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяВкладки = "Производство" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.НаборКонстантЗапретитьПереводЗаказаВСтатусЗакрытПриНеполнойОплате.Доступность = НаборКонстант.ИспользоватьСтатусЗакрытВЗаказеПокупателя;
		//Элементы.НаборКонстантПереводитьЗаказПриОткрытииВСтатусВРаботе.Доступность = НаборКонстант.ИспользоватьСтатусНовыйВЗаказеПокупателя;
		
		// убрано по заявке #13536
		//Элементы.ШКПоОперациям.Доступность  = НаборКонстант.РасчетЗарплатыПроизводстваПоОперациям;
		//Элементы.СформироватьШК.Доступность = НаборКонстант.ШтрихкодСотрудникаСодержитКодОперации;
		
		Элементы.РасчетЗарплатыПоПроизводственнымОперациямДоп.Видимость = НаборКонстант.РасчетЗарплатыПроизводстваПоОперациям; // №6283
		
		Элементы.ГруппаВнутренниеЗаказыНастройки.Доступность = НаборКонстант.ИспользоватьВнутренниеЗаказы;
		
		Элементы.ДекорацияШаблонНаименованияПродукцииНеЗадан.Видимость  = НЕ ЗначениеЗаполнено(НаборКонстант.ШаблонНаименованияПродукции);
		
		Элементы.ГруппаОкруглениеПотолки.Доступность = НаборКонстант.ОкруглятьСтоимостьПотолка;
		
		Элементы.ГруппаМаксимальноеКоличествоПотолков.Доступность = НаборКонстант.КонтролироватьМаксимальноеКоличествоПотолковВЧасКОтгрузке;
		
		//#13441 
		Элементы.ГруппаКонтрольЗаполненияИсполнителейВВыпуске.Видимость = НаборКонстант.КонтролироватьЗаполнениеИсполнителейВВыпуске И НаборКонстант.РасчетЗарплатыПроизводстваПоОперациям;
		
		Если ИмяВкладки = "Производство" Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;
	
	Если ИмяВкладки = "Бонусы" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.НаборКонстантИспользоватьАвтоматическиеСкидкиВРазрезеКомнат.Доступность = НаборКонстант.ИспользоватьАвтоматическиеСкидки;
		
		Элементы.ГруппаБонусыНастройкиВнутреннейСистемы.Видимость = НаборКонстант.УчитыватьБонусы
												И (НаборКонстант.ВидБонуснойСистемы = ПредопределенноеЗначение("Перечисление.ВидыБонусныхСистем.Внутренняя")); //#13359 

		//++ №13299 Элементы.НаборКонстантНачислятьБонусыПоДисконтнойКартеПриЗачетеБонусовКакСкидку.Доступность = Объект.АвтоматическоеНачислениеБонусов;

		Элементы.ГруппаСписыватьБонусыПоДокументам.ТолькоПросмотр = Ложь;
		// по UDS с бонусами работаем только в РТиУ. В ЗП можно узнать остаток
		Если НаборКонстант.ВидБонуснойСистемы = Перечисления.ВидыБонусныхСистем.UDS Тогда
			Элементы.ГруппаСписыватьБонусыПоДокументам.ТолькоПросмотр = Истина;
			НаборКонстант.СписыватьБонусыПоДокументуЗаказПокупателя = Ложь;
			НаборКонстант.СписыватьБонусыПоДокументуРеализацияТоваровИУслуг = Истина;
		КонецЕсли;
		
		Если ИмяВкладки = "Бонусы" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "Интеркампани" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.ГруппаИнтеркампаниОсновнаяНастройка.Видимость = (НаборКонстант.ИсточникНастроекИнтеркампани = 3);
		         				 
		Элементы.ГруппаНастройкаСозданияДокументовИнтеркампани.Доступность = НаборКонстант.ИспользоватьИнтеркампани;
		Элементы.ГруппаОбработкаЗаказовВручную.Доступность = НаборКонстант.ИспользоватьИнтеркампани;
		Элементы.ГруппаИнтеркампаниУдаленноеПодключениеПрочее.Доступность = НаборКонстант.ИспользоватьИнтеркампани;
		Элементы.ДекорацияНастройкиПодключенияРозница.Доступность = НаборКонстант.ИспользоватьИнтеркампани;
		
		Элементы.НаборКонстантСтоимостьПотолкаВключаетУслугиРаскрояПриПокупкеДляРозницы.Доступность = НаборКонстант.ИспользоватьИнтеркампани;
		
		Элементы.НастроитьРасписаниеСозданияПоступленийИнтеркампани1.Доступность = АвтоматическиСоздаватьДокументыПоступленийТоваровОтПроизводстваНаРозницу;
		Элементы.НастроитьРасписаниеСозданияПоступленийИнтеркампани2.Доступность = АвтоматическиСоздаватьДокументыПоступленийПоРучнымЗаказам;
		Элементы.НастроитьРасписаниеСозданияПоступленийИнтеркампани3.Доступность = АвтоматическиСоздаватьДокументыПоступленийПоУдаленнойБазе;
		
		Если ИмяВкладки = "Интеркампани" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "ЗагрузкаИзПостроителя" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.ГруппаКаталогВыгрузокИзИзиСилингПроизводство.Доступность = НЕ НаборКонстант.ИндивидуальныеКаталогиЗагрузкиЧертежейИзEasyCeiling;
		
		Элементы.КаталогВыгрузокИзИзиСилингРозница.Доступность = НЕ НаборКонстант.ПапкиОпределяютсяВКарточкеПользователяРозница;
		
		Элементы.НаборКонстантКаталогиЗагрузкиИзПостроителяУказываютНаПапкиСервера.Доступность = НаборКонстант.ПакетнаяЗагрузкаРасчетовИзИзиСилинг;
		Элементы.НаборКонстантОбновлятьРеквизитыЗаказаПокупателяПриПовторнойПакетнойЗагрузкеИзПостроителя.Доступность = НаборКонстант.ПакетнаяЗагрузкаРасчетовИзИзиСилинг;
		
		Элементы.НаборКонстантПереноситьФайлыВАрхивПриЗагрузкеПотолкаИзПостроителяВРознице.Доступность = НЕ НаборКонстант.ПапкиОпределяютсяВКарточкеПользователяРозница;
		Элементы.ГруппаКаталогРезервныхКопийРоница.Доступность = НЕ НаборКонстант.ПапкиОпределяютсяВКарточкеПользователяРозница И НаборКонстант.ПереноситьФайлыВАрхивПриЗагрузкеПотолкаИзПостроителяВРознице;
		
		Элементы.НаборКонстантПереноситьВАрхивРасчетыПостроителяПроизводство.Доступность = НЕ НаборКонстант.ИндивидуальныеКаталогиЗагрузкиЧертежейИзEasyCeiling;
		Элементы.ГруппаКаталогДляРезеврныхКопийВыгрузокИзИзиСилинг.Доступность = НЕ НаборКонстант.ИндивидуальныеКаталогиЗагрузкиЧертежейИзEasyCeiling И НаборКонстант.ПереноситьВАрхивРасчетыПостроителяПроизводство;
		
		Элементы.НаборКонстантПерерасходПленкиНоменклатура.Доступность = НЕ (НаборКонстант.ПерерасходПленкиКоэффициент = 0);
		
		Элементы.ДекорацияИменованияПотолков.Видимость	= (НаборКонстант.ПорядокФормированияНаименованияПотолка = 2);
		Элементы.ДекорацияИменованияОтрезов.Видимость	= (НаборКонстант.ПорядокФормированияНаименованияОтреза = 2);
		//Элементы.ДекорацияИменованияТиповыхОтрезов.Видимость = (НаборКонстант.ПорядокФормированияНаименованияТиповогоОтреза = 2);
	    Элементы.ДекорацияИменованияОстатковПленки.Видимость = (НаборКонстант.ПорядокФормированияНаименованияОстатковПленки = 2);
		
		Элементы.НаборКонстантУстанавливатьДатуОжидаемойОтгрузкиТекущейДатойЕслиВПостроителеУказанаДатаРанее.Доступность = НаборКонстант.ЗагружатьДатуОжидаемойОтгрузкиИзПостроителя; // №4562
		
		Если ИмяВкладки = "ЗагрузкаИзПостроителя" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "СМС" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.ГруппаПараметрыОтправкиСМС.Доступность = НаборКонстант.АвтоматическаяРассылкаСМС;
		Элементы.ГруппаНастроекСМС.Видимость = НаборКонстант.АвтоматическаяРассылкаСМС;		
		
		Элементы.ЕВостокСМСНомерСервиса.Видимость = НаборКонстант.ЕВостокИспользоватьОтправкуСМС;
		Элементы.СМСРуAPIID.Видимость = НаборКонстант.СМСРуИспользоватьОтправкуСМС;
		Элементы.ЕВостокСМСЛогин.Видимость = НЕ НаборКонстант.СМСРуИспользоватьОтправкуСМС;
		Элементы.ЕВостокСМСПароль.Видимость = НЕ НаборКонстант.СМСРуИспользоватьОтправкуСМС;
		Элементы.ЕВостокСМСПодпись.Видимость = НЕ НаборКонстант.СМСРуИспользоватьОтправкуСМС И НЕ НаборКонстант.ИспользоватьОтправкуСМСRocketSMSBy;
		Элементы.ПроверитьБалансСМС.Доступность = НЕ НаборКонстант.КазИнфоТехИспользоватьОтправкуСМС;
		
		Элементы.ГруппаСМСОИзмененииМонтажа.Доступность = ЕВостокОтправлятьСМСОЗапланированномМонтаже;
		
		Если АвтоматическиСоздаватьПоздравленияСДнемРожденияПоСМС Тогда
			Элементы.ШаблонСМСПоздравленияНаДеньРождения.Видимость = Истина;
			Элементы.ГруппаКонтрагентовДляПоздравленияСДнемРожденияЧерезСМС.Видимость = Истина;
		Иначе
			Элементы.ШаблонСМСПоздравленияНаДеньРождения.Видимость = Ложь;
			Элементы.ГруппаКонтрагентовДляПоздравленияСДнемРожденияЧерезСМС.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.ГруппаПоДолгамПодчиненная.Доступность = НаборКонстант.ОтправлятьСМСОДолгеКонтрагентам;
		
		Элементы.НомерШаблонаТекстаСМСКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен.Видимость = НаборКонстант.ОтправлятьСМСКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен;
		
		Если ИмяВкладки = "СМС" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "Монтажи" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.НаборКонстантОбзвонВидОпросаПослеВыполненияМонтажа.Доступность 		= НаборКонстант.ОбзвонСоздаватьПослеВыполненияМонтажа;
		Элементы.НаборКонстантОбзвонКоличествоДнейПослеВыполненияМонтажа.Доступность = НаборКонстант.ОбзвонСоздаватьПослеВыполненияМонтажа;
		Если НЕ НаборКонстант.ОбзвонСоздаватьПослеВыполненияМонтажа Тогда
			НаборКонстант.ОбзвонВидОпросаПослеВыполненияМонтажа = Справочники.ВидыОбзвоновКлиентов.ПустаяСсылка();
			НаборКонстант.ОбзвонКоличествоДнейПослеВыполненияМонтажа = 0;
		КонецЕсли;
		
		Элементы.ГруппаНастройкиАвтоматическогоСозданияПеремещений.Доступность = НаборКонстант.ИспользоватьВыдачуВозвратВДокументеМонтаж;

		Элементы.НаборКонстантОсуществлятьПеремещениеПоМонтажамСВидомВозврат.Доступность = НаборКонстант.АвтоматическиСоздаватьДокументыПеремещенияНаОснованииМонтажа;
		Элементы.НаборКонстантОсуществлятьПеремещениеПоМонтажамСВидомВыдача.Доступность = НаборКонстант.АвтоматическиСоздаватьДокументыПеремещенияНаОснованииМонтажа;
		
		Элементы.ИсключенияВыдачиВозвратМатериаловПоМонтажам.Доступность = НаборКонстант.ИспользоватьИсключенияИзКонтроляВыдачиВозвратаПоМонтажам;
		
		Если ИмяВкладки = "Монтажи" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "Зарплата" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.НаборКонстантВестиТабельСотрудниковВРучномРежиме.Доступность = НаборКонстант.ВестиТабельСотрудников;
		Если НЕ НаборКонстант.ВестиТабельСотрудников Тогда
			НаборКонстант.ВестиТабельСотрудниковВРучномРежиме = Ложь;
		КонецЕсли;

		Если ИмяВкладки = "Зарплата" Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяВкладки = "Финансы" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.ДекорацияКонтрольДенег.Видимость = НаборКонстант.НеКонтролироватьОстатокДенежныхСредств;
		
		Если НЕ НаборКонстант.ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
			НаборКонстант.ДоступноИзменениеКассыВДокументахНаОснованииЗаявки   	   = Ложь;
			НаборКонстант.ДоступноИзменениеОрганизацииВДокументахНаОснованииЗаявки = Ложь;
		КонецЕсли;
		
		Элементы.НаборКонстантДоступноИзменениеКассыВДокументахНаОснованииЗаявки.Доступность   	   = НаборКонстант.ИспользоватьЗаявкиНаРасходованиеДенежныхСредств;
		Элементы.НаборКонстантДоступноИзменениеОрганизацииВДокументахНаОснованииЗаявки.Доступность = НаборКонстант.ИспользоватьЗаявкиНаРасходованиеДенежныхСредств;

		Элементы.НаборКонстантКассовыйМетодВеденияУчетаДоходовРасходов.Доступность   = НаборКонстант.ИспользоватьВедениеУчетаДоходовРасходов;
		Элементы.НаборКонстантНекассовыйМетодВеденияУчетаДоходовРасходов.Доступность = НаборКонстант.ИспользоватьВедениеУчетаДоходовРасходов;
		Элементы.НаборКонстантИспользоватьВедениеУчетаДоходовРасходовПострочно.Доступность = НаборКонстант.НекассовыйМетодВеденияУчетаДоходовРасходов;
		Элементы.НастройкиСтатейДоходовРасходовПоУмолчанию.Доступность  = НаборКонстант.ИспользоватьВедениеУчетаДоходовРасходов И НЕ ЭтаФорма.Модифицированность;
		
		Элементы.НаборКонстантОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Доступность  = НаборКонстант.ИспользоватьУчетПоСтатьямДДС;
		
		Элементы.ДекорацияКонтрольПеремещенийДС.Видимость = НаборКонстант.РазрешитьПеремещениеДенежныхСредствМеждуОрганизациями;
		
		Если ИмяВкладки = "Финансы" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "Интеграции" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.ГруппаНастроекRevvy.Доступность = НаборКонстант.RVY_ИспользоватьИнтеграцию;
		
		Элементы.ГруппаНастроекUDS.Доступность = НаборКонстант.UDS_ИспользоватьИнтеграцию;
			
		Если ИмяВкладки = "Интеграции" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "РасширенныеСервисы" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.ГруппаНастройкиМобильногоКлиентаЗамерщика.Доступность = НаборКонстант.ИспользуетсяМобильныйКлиентЗамерщика;		
		Элементы.ГруппаОбщихНастроекМобильногоКлиентаЗамерщика.Доступность = НЕ НаборКонстант.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаДляПользователей;
				
		Элементы.ГруппаНастройкиМобильногоКлиентаМонтажника.Доступность = НаборКонстант.ИспользуетсяМобильныйКлиентМонтажника;		
		Элементы.ГруппаОбщихНастроекМобильногоКлиентаМонтажника.Доступность = НЕ НаборКонстант.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаМонтажникаДляПользователей;
		
		Элементы.ЛКЛогин_ИнтернетПлатежи.Доступность = НаборКонстант.ИспользоватьИнтернетПлатежи;
		Элементы.ЛКПароль_ИнтернетПлатежи.Доступность = НаборКонстант.ИспользоватьИнтернетПлатежи;
		
		ОбщийМодуль.ЗадатьЗаголовокФлагаВключенияСервиса(Элементы.НаборКонстантИспользуетсяМобильныйКлиентЗамерщика);
		ОбщийМодуль.ЗадатьЗаголовокФлагаВключенияСервиса(Элементы.НаборКонстантИспользуетсяМобильныйКлиентМонтажника);
		ОбщийМодуль.ЗадатьЗаголовокФлагаВключенияСервиса(Элементы.НаборКонстантИспользуетсяСервисПроверкиПотолков);
		ОбщийМодуль.ЗадатьЗаголовокФлагаВключенияСервиса(Элементы.НаборКонстантИспользуетсяИнтеграцияСРойстат);
		ОбщийМодуль.ЗадатьЗаголовокФлагаВключенияСервиса(Элементы.НаборКонстантИспользоватьОбменСБитрикс24);
		ОбщийМодуль.ЗадатьЗаголовокФлагаВключенияСервиса(Элементы.НаборКонстантОбменССайтомCMLИспользовать);
		ОбщийМодуль.ЗадатьЗаголовокФлагаВключенияСервиса(Элементы.ИспользоватьИнтернетПлатежи);
		//ОбщийМодуль.ЗадатьЗаголовокФлагаВключенияСервиса(Элементы.НаборКонстантИспользоватьИнтеграциюВатсап);
		ОбщийМодуль.ЗадатьЗаголовокФлагаВключенияСервиса(Элементы.НаборКонстантИспользоватьОбменСWikki);
		
		Элементы.ГруппаНастройкиИнтеграцииСРойстатПолучениеВебхукПоЗвонкам.Доступность = НаборКонстант.ИспользуетсяИнтеграцияСРойстат;
		Элементы.НастроитьРегламентноеЗаданиеПолученияВебхукРойстатПоЗвонкам.Доступность = НаборКонстант.ПолучатьВебхукиРойстат;
		Элементы.ГруппаНастройкиИнтеграцииСРойстатПолучениеВебхукПоЗвонкамДетали.Доступность = НаборКонстант.ПолучатьВебхукиРойстат;
		
		Элементы.ОткрытьНастройкиБитрикс24.Доступность = НаборКонстант.ИспользоватьОбменСБитрикс24;
		
		//Элементы.ГруппаНастройкиИнтеграцииСВатсап.Доступность = НаборКонстант.УДАЛИТЬ_ИспользоватьИнтеграциюВатсап;
		
		Элементы.ОткрытьНастройкиОбменССайтом.Доступность  = НаборКонстант.ОбменССайтомCMLИспользовать;
		
		Элементы.НаборКонстантИспользуетсяПредварительныйРасчетВМобильномКлиентеЗамерщика.Доступность = НЕ НаборКонстант.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаДляПользователей;
		Элементы.ГруппаМобильныйЗамерщикНастройкиПредварительныхРасчетов.Видимость = НаборКонстант.ИспользуетсяПредварительныйРасчетВМобильномКлиентеЗамерщика И НЕ НаборКонстант.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаДляПользователей;
		
		ОбновитьНадписьБудетВыгруженоНоменклатурыВМобильныйКлиент(); // №14535
		
		
		
		// Обмен с Wikki
		Элементы.ОткрытьНастройкиОбменаСWikki.Доступность  = НаборКонстант.ИспользоватьОбменСWikki;
		
		Если ИмяВкладки = "РасширенныеСервисы" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "Телефония" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.ДекорацияSmartConnector.Видимость = (НаборКонстант.ВариантБиблиотекиТелефонии = 0);
		Элементы.ДекорацияSimplit.Видимость        = (НаборКонстант.ВариантБиблиотекиТелефонии = 1);
		
		// закомментировано: версия 93.1 реализована только на новой форме панели
		//Элементы.НаборКонстантВариантБиблиотекиТелефонии.Доступность = НЕ НаборКонстант.ИспользоватьROMAsterisk;
		
		ИспользуетсяАТС = НаборКонстант.ИспользоватьROMAsterisk
							ИЛИ НаборКонстант.ИспользоватьROMHMAC
							ИЛИ НаборКонстант.ИспользоватьМегафон 
							ИЛИ НаборКонстант.ИспользоватьUIS 
							ИЛИ НаборКонстант.ИспользоватьDomRu 
							ИЛИ НаборКонстант.ИспользоватьSipuni
							ИЛИ НаборКонстант.ИспользоватьBinotel
							ИЛИ НаборКонстант.ИспользоватьMango
							ИЛИ НаборКонстант.ИспользоватьPhonet
							ИЛИ НаборКонстант.ИспользоватьБилайн
							;
		
		Элементы.ГруппаНастройкиАТС.Видимость             = ИспользуетсяАТС;
		Элементы.ГруппаПолучениеИсторииЗвонков.Видимость  = ИспользуетсяАТС;
		Элементы.ГруппаПрочиеНастройкиТелефонии.Видимость = ИспользуетсяАТС;
		
		Элементы.СтраницаНастроекAsterisk.Видимость = Ложь;
		Элементы.СтраницаНастроекПрочихАТС.Видимость = Ложь;
		Если ИспользуетсяАТС Тогда
			Если НаборКонстант.ИспользоватьROMAsterisk Тогда
				Элементы.СтраницаНастроекAsterisk.Видимость = Истина;
			Иначе
				Элементы.СтраницаНастроекПрочихАТС.Видимость = Истина;
				
				Элементы.ГруппаSmartConnector.Видимость = (НаборКонстант.ВариантБиблиотекиТелефонии = 0);
				Элементы.ГруппаСимплит.Видимость = (НаборКонстант.ВариантБиблиотекиТелефонии = 1);
				
				//Элементы.НаборКонстантИнтервалПроверкиПодключенияКАТС.Видимость = (НаборКонстант.ВариантБиблиотекиТелефонии = 1);
			КонецЕсли;			
		КонецЕсли;

		//Элементы.ГруппаНастройкаСофтФонROMAsterisk.Видимость = НаборКонстант.ИспользоватьROMAsterisk;
		//
		//Элементы.СтраницаНастроекПрочихАТС.Видимость =  НаборКонстант.ИспользоватьROMHMAC
		//											ИЛИ НаборКонстант.ИспользоватьМегафон 
		//											ИЛИ НаборКонстант.ИспользоватьUIS 
		//											ИЛИ НаборКонстант.ИспользоватьDomRu 
		//											ИЛИ НаборКонстант.ИспользоватьSipuni
		//											ИЛИ НаборКонстант.ИспользоватьBinotel
		//											ИЛИ НаборКонстант.ИспользоватьMango
		//											ИЛИ НаборКонстант.ИспользоватьPhonet
		//											;
		Элементы.ГруппаOnlinePBX.Видимость = НаборКонстант.ИспользоватьROMHMAC;										
		Элементы.НаборКонстантТелефонияАдминистраторПароль2.Видимость = НЕ НаборКонстант.ИспользоватьMango;		
		Элементы.ГруппаSipuni.Видимость = НаборКонстант.ИспользоватьSipuni;
		Элементы.НаборКонстантТелефонияПарольAPI.Видимость = НаборКонстант.ИспользоватьBinotel;
		Элементы.ГруппаMango.Видимость = НаборКонстант.ИспользоватьMango;
		
		Элементы.ГруппаЛидыПоПропущеннымЗвонкам.Видимость = ИспользуетсяАТС;
		Если НЕ Элементы.ГруппаЛидыПоПропущеннымЗвонкам.Видимость Тогда
			НаборКонстант.АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкам = Ложь;
		КонецЕсли;
			
		ТелефонияТаргет	= "";
		Если НаборКонстант.ИспользоватьROMHMAC Тогда
			ТелефонияТаргет = "onlinepbx";	
		ИначеЕсли НаборКонстант.ИспользоватьМегафон Тогда
			ТелефонияТаргет = "megafon";							
		ИначеЕсли НаборКонстант.ИспользоватьUIS Тогда 
			ТелефонияТаргет = "uis";
		ИначеЕсли НаборКонстант.ИспользоватьDomRu Тогда
			ТелефонияТаргет = "domru";
		ИначеЕсли НаборКонстант.ИспользоватьSipuni Тогда
			ТелефонияТаргет = "sipuni";
		ИначеЕсли НаборКонстант.ИспользоватьBinotel Тогда
			ТелефонияТаргет = "binotel";
		ИначеЕсли НаборКонстант.ИспользоватьMango Тогда
			ТелефонияТаргет = "mango";
		ИначеЕсли НаборКонстант.ИспользоватьPhonet Тогда
			ТелефонияТаргет = "phonet";
		ИначеЕсли НаборКонстант.ИспользоватьБилайн Тогда
			ТелефонияТаргет = "beeline";
		КонецЕсли;
		АдресВнешнейСистемыДляВАТС = СофтФонКлиентСервер.АдресВнешнейСистемыДляВАТС(ТелефонияТаргет, НаборКонстант.КлючAPI);
		//СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(	
		//									"https://api.smartceilings.ru/webhooks?target=%1&apikey=%2",
		//                                    ТелефонияТаргет,
		//                                    НаборКонстант.КлючAPI);
		ОбщийМодуль.ЗадатьЗаголовокФлагаВключенияСервиса(Элементы.ДекорацияСрокДействияКоннектор);

		Если ИмяВкладки = "Телефония" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяВкладки = "ЭлектроннаяПочта" ИЛИ ИмяВкладки = "Все" Тогда
		
		Элементы.ГруппаEmailПоКонтролюПравокЗаднимЧислом.Доступность = НаборКонстант.ОтправлятьEmailПоКонтролюПравокЗаднимЧислом;
		
		Элементы.ГруппаEmailДетализацияВзаиморасчетов.Доступность = НаборКонстант.ОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетов; //ОтправлятьДетализациюВзаиморасчетов; 
		
		Если ИмяВкладки = "ЭлектроннаяПочта" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ИмяВкладки = "Лицензия" ИЛИ ИмяВкладки = "Все" Тогда
		
		ОбновитьСписокСерийныхНомеров();
			
		Если ИмяВкладки = "Лицензия" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ИмяВкладки = "Обновление" ИЛИ ИмяВкладки = "Все" Тогда
		//отображение элементов обновления программы		
		//получим текущую версию программы
		Элементы.ДекорацияВерсияПрограммы.Заголовок = Метаданные.Версия;
		
		//определим необходимость выполнения процедур после обновления
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы КАК ВерсияПрограммы,
		|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммыЧисло,
		|	КОЛИЧЕСТВО(ОбъектыКОбработкеПослеОбновленияРекомендуемые.Документ) КАК КоличествоОбъектов
		|ИЗ
		|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые КАК ОбъектыКОбработкеПослеОбновленияРекомендуемые
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы,
		|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммыЧисло
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммыЧисло
		|
		|;
		|///////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбъектыКОбработкеПриОбновлении.ВерсияПрограммы,
		|	ОбъектыКОбработкеПриОбновлении.ВерсияПрограммыЧисло,
		|	КОЛИЧЕСТВО(ОбъектыКОбработкеПриОбновлении.ОбъектСсылка) КАК КоличествоОбъектов
		|ИЗ
		|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияОбязательные КАК ОбъектыКОбработкеПриОбновлении
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыКОбработкеПриОбновлении.ВерсияПрограммы,
		|	ОбъектыКОбработкеПриОбновлении.ВерсияПрограммыЧисло
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектыКОбработкеПриОбновлении.ВерсияПрограммыЧисло
		|";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет(); //.Выгрузить();
		
		ТаблицаОбъектов = РезультатЗапроса[0].Выгрузить();
		ТаблицаОбъектовОбязательные = РезультатЗапроса[1].Выгрузить();
		
		ЕстьОбязательныеОбъектыКОбработкеПослеОбновления = (ТаблицаОбъектовОбязательные.Количество() > 0);
		
		Если ТаблицаОбъектов.Количество() = 0 И ТаблицаОбъектовОбязательные.Количество() = 0 Тогда
			
			//все хорошо, выполнять дополнительные операции не требуется
			Элементы.ГруппаОбновление.Картинка = Новый Картинка();
			Элементы.ГруппаДокументыКОбработке.Видимость = Ложь;
			Элементы.ДекорацияОбновленияВыполнены.Видимость = Истина;
			
		Иначе
			
			//имеются необработанные документы
			Элементы.ГруппаОбновление.Картинка = ?(ЕстьОбязательныеОбъектыКОбработкеПослеОбновления, БиблиотекаКартинок.КритическаяОшибка, БиблиотекаКартинок.Предупреждение);
			Элементы.ГруппаДокументыКОбработке.Видимость = Истина;
			Элементы.ДекорацияОбновленияВыполнены.Видимость = Ложь;
			
			//РезультатЗапроса.Сортировать("ВерсияПрограммы Возр");
			НадписьСпискаДокументов = "Объекты к обработке:
			|";
			НадписьСпискаДокументовОбязательные = "Обязательные объекты к обработке:
			|";
			
			Для Каждого ТекущаяВерсия Из ТаблицаОбъектов Цикл
				НадписьСпискаДокументов = НадписьСпискаДокументов + "Версия: " + ТекущаяВерсия.ВерсияПрограммы + " Объектов к обработке: " + ТекущаяВерсия.КоличествоОбъектов + Символы.ПС;
			КонецЦикла;
			
			Для Каждого ТекущаяВерсия Из ТаблицаОбъектовОбязательные Цикл
				НадписьСпискаДокументовОбязательные = НадписьСпискаДокументовОбязательные + "Версия: " + ТекущаяВерсия.ВерсияПрограммы + " Объектов к обработке: " + ТекущаяВерсия.КоличествоОбъектов + Символы.ПС;
			КонецЦикла;
			
			Элементы.ДекорацияДокументыКОбработке.Заголовок = НадписьСпискаДокументов;
			Элементы.ДекорацияДокументыКОбработкеОбязательные.Заголовок = НадписьСпискаДокументовОбязательные;
			
			Элементы.ДекорацияДокументыКОбработке.Видимость = (ТаблицаОбъектов.Количество() > 0);
			Элементы.ДекорацияДокументыКОбработкеОбязательные.Видимость = (ТаблицаОбъектовОбязательные.Количество() > 0);
			
		КонецЕсли;
		
		Элементы.СтраницаОбязательныеОбъектыКОбработкеПриОбновлении.Видимость = ЕстьОбязательныеОбъектыКОбработкеПослеОбновления;
		Если НЕ ЕстьОбязательныеОбъектыКОбработкеПослеОбновления
			И Элементы.СтраницыОбъектыКОбработкеПриОбновлении.ТекущаяСтраница = Элементы.СтраницаОбязательныеОбъектыКОбработкеПриОбновлении Тогда
			Элементы.СтраницыОбъектыКОбработкеПриОбновлении.ТекущаяСтраница = Элементы.СтраницаОбъектыКОбработкеПриОбновлении;
		КонецЕсли;
		
		Если ИмяВкладки = "Обновление" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	СрокПоддержки = ОбщийМодуль.ПолучитьСрокЗавершенияПоддержки();
	Если СрокПоддержки = 0 Тогда
		Элементы.ДекорацияНадписьПоддержка.Заголовок = "Вышел срок технической поддержки! Обратитесь к разработчику!";
		Элементы.ДекорацияНадписьПоддержка.ЦветТекста = WebЦвета.Красный;
	ИначеЕсли СрокПоддержки <= 30 Тогда
		Элементы.ДекорацияНадписьПоддержка.Заголовок = "Срок поддержки завершится через "+СрокПоддержки+" дней. Обратитесь к разработчику!";
		Элементы.ДекорацияНадписьПоддержка.ЦветТекста = WebЦвета.ОранжевоКрасный;
	Иначе
		Элементы.ДекорацияНадписьПоддержка.Заголовок = "Ваша конфигурация будет находится на поддержке еще "+СрокПоддержки+" дней.";
		Элементы.ДекорацияНадписьПоддержка.ЦветТекста = WebЦвета.Зеленый;
	КонецЕсли;
	
	Элементы.ОткрытьУзлыОбмена.Видимость = Объект.ИспользоватьОбменСПорталом;
	
	Элементы.ГруппаНастройкиМобильногоКлиентаЗамерщика.Доступность = НаборКонстант.ИспользуетсяМобильныйКлиентЗамерщика;
	
	Элементы.НаборКонстантРазрешитьРезервированиеОтсутствующегоТовара.Доступность = НаборКонстант.ИспользоватьРезервирование;
		
	ОбновитьЭлементыФормыНаСервере("Все");
	
КонецПроцедуры

#Область ОбработкаВкладкиОсновные

&НаКлиенте
Процедура ТелефонияСтранаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокСтран = СофтФон.ПолучитьСписокСтранДляиспользованияТелефонии();
	
	Оп = Новый ОписаниеОповещения("ВыборСтраныТелефонии", ЭтаФорма);
	ПоказатьВыборИзМеню(Оп, СписокСтран, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСтраныТелефонии(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.ТелефонияСтрана = ВыбранныйЭлемент.Значение;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаУчетаПриИзменении(Элемент)
	Если НаборКонстант.ОсновнаяВалютаПересчетаЦены.Пустая() Тогда
		НаборКонстант.ОсновнаяВалютаПересчетаЦены = ВалютаУчета;
	КонецЕсли;
	
	УправлениеВидимостьюИсточникКурсаВалют();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюИсточникКурсаВалют()
	//Элементы.НаборКонстантИсточникЗагрузкиКурсовВалют.Видимость = (ВалютаУчета = Справочники.Валюты.USD ИЛИ ВалютаУчета = Справочники.Валюты.EUR);
	//Элементы.ОсновнаяВалютаПересчетаЦены.Видимость = Элементы.НаборКонстантИсточникЗагрузкиКурсовВалют.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантДополнительнаяОценкаЗапасовВВалютеПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Основные");	
КонецПроцедуры

&НаКлиенте
Процедура ЧасовойПоясПрограммыПриИзменении(Элемент)
	
	УстановитьЧасовойПоясНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЧасовойПоясНаСервере()
	
	Если ЧасовойПоясПрограммы <> ПолучитьЧасовойПоясИнформационнойБазы() Тогда
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			УстановитьМонопольныйРежим(Истина);
			УстановитьЧасовойПоясИнформационнойБазы(ЧасовойПоясПрограммы);
			Константы.ЧасовойПоясОбластиДанных.Установить(ЧасовойПоясПрограммы);
			УстановитьМонопольныйРежим(Ложь);
		Исключение
			УстановитьМонопольныйРежим(Ложь);
			ВызватьИсключение;
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
		УстановитьЧасовойПоясСеанса(ЧасовойПоясПрограммы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВремяТекущегоСеанса(Команда)
	
	ПоказатьПредупреждение(,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Время сеанса: %1
				|На сервере: %2
				|На клиенте: %3
				|
				|Время сеанса - это время сервера,
				|приведенное к часовому поясу клиента.'"),
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДЛФ=T"),
			Формат(ДатаСервера(), "ДЛФ=T"),
			Формат(ТекущаяДата(), "ДЛФ=T")));
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьДополнительныеРеквизитыИСведенияПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Основные");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВестиЖурналПравокЗаднимЧисломПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Основные");		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСпискаДокументовКонтроляПравокЗаднимЧислом(Команда)
	Если НЕ ВестиЖурналПравокЗаднимЧислом() И Модифицированность Тогда
		Сообщить("Для настройки предварительно требуется сохранить настройки программы");
		Возврат;
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.НастройкиЖурналаПравокЗаднимЧислом.ФормаСписка");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВестиЖурналПравокЗаднимЧислом()
	Возврат ПолучитьФункциональнуюОпцию("ВестиЖурналПравокЗаднимЧислом");	
КонецФункции

&НаКлиенте
Процедура НастроитьРегламентноеЗаданиеУведомленияПоКонтролюПравокЗаднимЧислом(Команда)
	
	Идентификатор = ПолучитьИдентификаторРегламентногоЗадания("УведомлениеПоКонтролюПравокЗаднимЧислом");
	Если НЕ Идентификатор = Неопределено Тогда
		ПараметрыОбработки = Новый Структура;
		ПараметрыОбработки.Вставить("Идентификатор", Идентификатор);
		ПараметрыОбработки.Вставить("Действие", "Изменить");
		ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание", ПараметрыОбработки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольРеквизитов(Команда)
	ОткрытьФорму("РегистрСведений.РеквизитыДляКонтроля.ФормаСписка");
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиПечатныеФормы

&НаКлиенте
Процедура НаборКонстантИспользоватьШтрихкодированиеВПечатныхФормахПриИзменении(Элемент)
	
	ОбновитьЭлементыФормыНаСервере("ПечатныеФормы");
															
КонецПроцедуры

&НаКлиенте
Процедура НастройкаШКПоТипамДокументов(Команда)
	
	ОткрытьФорму("РегистрСведений.ИспользованиеШтрихкодированияВПечатныхФормахДокументов.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВидШтрихкодаДокументовВПечатныхФормахПриИзменении(Элемент)
	
	ОбновитьЭлементыФормыНаСервере("ПечатныеФормы");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиЗапасы

&НаКлиенте
Процедура НаборКонстантНеКонтролироватьОстаткиНаСкладахПриИзменении(Элемент)
	//ОбновитьЭлементыФормы();
	ОбновитьЭлементыФормыНаСервере("Запасы");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОбщиеСкладыПриИзменении(Элемент)
	//#11633 ПоказатьПредупреждение убираем, выводим надпись
	//ПоказатьПредупреждение(,"ВНИМАНИЕ! При изменении этой настройки вам следует вручную перепровести все складские документы!");
	ОбновитьЭлементыФормыНаСервере("Запасы");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьРезервированиеПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОтображатьПредыдущуюЦенуПоступленияВДокументахЗакупкиПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Запасы");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантУчитыватьДоставкуТовараПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Запасы");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантДоставкаОтправлятьЕмайлПриИзменении(Элемент)
	Если НаборКонстант.ДоставкаОтправлятьЕмайл тогда
		НаборКонстант.ДоставкаОтправлятьЕмайл = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантДоставкаОтправлятьСМСПриИзменении(Элемент)
	Если НаборКонстант.ДоставкаОтправлятьСМС тогда
		НаборКонстант.ДоставкаОтправлятьСМС = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДействийРМРаботникаСклада(Команда)
	
	ОткрытьФорму("Обработка.РабочееМестоСотрудникаСклада.Форма.НастройкаДействий");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиЛиды

&НаКлиенте
Процедура ПравилаПереводаЛидовМеждуСтатусами(Команда)
	ОткрытьФорму("РегистрСведений.ПорядокПереводаСтатусаЛида.Форма.ФормаРедактированияПравил", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПорядокЗаполненияПолейЛида(Команда)
	ОткрытьФорму("Справочник.ПорядокЗаполненияПолейЛида.ФормаСписка", , ЭтотОбъект, УникальныйИдентификатор);	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияУчетаЛидов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИспользоватьПодразделения", НаборКонстант.ИспользоватьПодразделения);
	ОткрытьФорму("Справочник.ДетализацияУчетаЛидов.Форма.ФормаРедактированияДетализации", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантСоздаватьВходящиеКонтактыПоВходящимЭлектроннымПисьмамПриИзменении(Элемент)
	Если НаборКонстант.СоздаватьВходящиеКонтактыПоВходящимЭлектроннымПисьмам тогда
		НаборКонстант.СоздаватьВходящиеКонтактыПоВходящимЭлектроннымПисьмам = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВестиЛогированиеСобытийПолученияПисемПриИзменении(Элемент)
	Если НаборКонстант.ВестиЛогированиеСобытийПолученияПисем тогда
		НаборКонстант.ВестиЛогированиеСобытийПолученияПисем = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантКонтролироватьВремяРеакцииПоЛидамПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Лиды");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВремениРеакцииПоЛидам(Команда)
	ОткрытьФорму("РегистрСведений.НастройкиВремениРеакцииПоЛидам.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИзмененияДатыСледующегоКонтактаЛидаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИзмененияДатыСледующегоКонтактаЛидаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантАвтоматическиСоздаватьЛидыПоПропущеннымЗвонкамПриИзменении(Элемент)
	
	ОбновитьЭлементыФормыНаСервере("Телефония");
	ОбновитьЭлементыФормыНаСервере("Лиды");

	Если НаборКонстант.АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкам Тогда
		
		НаборКонстант.ДатаНачалаАвтоматическогоСозданияЛидовПоПропущеннымЗвонкам = ТекущаяДата();
		
	Иначе
		
		НаборКонстант.ДатаНачалаАвтоматическогоСозданияЛидовПоПропущеннымЗвонкам = Дата(1,1,1);
		
		НаборКонстант.АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкамТолькоСРекламнымИсточником = Ложь; //++ №6369
		
	КонецЕсли;
	   
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантАвтоматическиСоздаватьЛидыПоПринятымЗвонкамОффлайнПриИзменении(Элемент)
	
	Если НаборКонстант.АвтоматическиСоздаватьЛидыПоПринятымЗвонкамОффлайн Тогда		
		НаборКонстант.ДатаНачалаАвтоматическогоСозданияЛидовПоПринятымЗвонкамОффлайн = ТекущаяДата();		
	Иначе		
		НаборКонстант.ДатаНачалаАвтоматическогоСозданияЛидовПоПринятымЗвонкамОффлайн = Дата(1,1,1);		
	КонецЕсли;
	
	ОбновитьЭлементыФормыНаСервере("Лиды");
	   
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиЗамеры

&НаКлиенте
Процедура НаборКонстантРазмерИнтервалаВГрафикеЗамеровПриИзменении(Элемент)
	Если НаборКонстант.РазмерИнтервалаВГрафикеЗамеров = 30 ИЛИ НаборКонстант.РазмерИнтервалаВГрафикеЗамеров = 60 Тогда
	Иначе
		НаборКонстант.РазмерИнтервалаВГрафикеЗамеров = 30;
		ПоказатьОповещениеПользователя("Размер интервала может быть 30 или 60 минут");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЦветовОформленияГрафикаЗамеров(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ГрафикЗамеров", Истина);
	ПараметрыФормы.Вставить("НастройкиОформления", ПолучитьНастройкиОформленияГрафикаЗамеров());
	Оповещение = Новый ОписаниеОповещения("НастройкаЦветовОформленияГрафикаЗамеровЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.НастройкаПодсветки", ПараметрыФормы, ЭтаФорма,,,, Оповещение);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОформленияГрафикаЗамеров()
	
	Возврат ОбщийМодульСервер.ПолучитьНастройкиОформленияГрафикаЗамеров(НастройкаОформленияГрафикаЗамеров);
			
КонецФункции

&НаКлиенте
Процедура НастройкаЦветовОформленияГрафикаЗамеровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда		
		НастройкаОформленияГрафикаЗамеров = Результат;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиМонтажи

&НаКлиенте
Процедура ОбзвонСоздаватьПослеВыполненияМонтажаПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Монтажи");
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбзвонВидОпросаПослеВыполненияМонтажаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбзвонКоличествоДнейПослеВыполненияМонтажаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЦветовОформленияГрафикаМонтажей(Команда)
	//#6985
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ГрафикМонтажей", Истина);
	ПараметрыФормы.Вставить("НастройкиОформления", ПолучитьНастройкиОформленияГрафикаМонтажей());
	Оповещение = Новый ОписаниеОповещения("НастройкаЦветовОформленияГрафикаМонтажейЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.НастройкаПодсветки", ПараметрыФормы, ЭтаФорма,,,, Оповещение);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОформленияГрафикаМонтажей()
	
	Возврат ОбщийМодульСервер.ПолучитьНастройкиОформленияГрафикаМонтажей(НастройкаОформленияГрафикаМонтажей);
			
КонецФункции

&НаКлиенте
Процедура НастройкаЦветовОформленияГрафикаМонтажейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда		
		НастройкаОформленияГрафикаМонтажей = Результат;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьИсключенияИзКонтроляВыдачиВозвратаМатериаловПоМонтажамПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Монтажи");
КонецПроцедуры

&НаКлиенте
Процедура ИсключенияВыдачиВозвратМатериаловПоМонтажам(Команда)
	
	ОткрытьФорму("РегистрСведений.ИсключенияИзКонтроляВыдачиВозвратаМатериаловПоМонтажам.ФормаСписка", , , Новый УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПрочихИсполнителейПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПрочихИсполнителейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиРозница

&НаКлиенте
Процедура АвтоматическиПрисваиватьНомерДоговораВЗаказДоговореПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Розница");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьШаблонНомераДоговора(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипШаблона", "НомерЗаказДоговора");
	ПараметрыФормы.Вставить("ШаблонНомераДоговора", ШаблонНомераДоговора);
	ПараметрыФормы.Вставить("ПериодичностьНомераДоговора", ПериодичностьНомераДоговора);

	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьШаблонНомераДоговораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.ФормаНастройкиШаблонаНомера", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьШаблонНомераДоговораЗавершение(ПараметрыОтвета, ДополнительныеПараметры) Экспорт

	Если ПараметрыОтвета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонНомераДоговора = ПараметрыОтвета.ШаблонНомера;
	Элементы.ДекорацияШаблонНомераДоговора.Заголовок = ШаблонНомераДоговора;
	ПериодичностьНомераДоговора = ПараметрыОтвета.ПериодичностьНомераДоговора;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиВерсионирования(Команда)	
	ОткрытьФорму("РегистрСведений.НастройкиВерсионированияОбъектов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникКомнат(Команда)
	ОткрытьФорму("Справочник.НазваниеКомнат.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантАвтоматическиЗаполнятьМатериалыПоСпецификациямПриИзменении(Элемент)	
	ОбновитьЭлементыФормыНаСервере("Розница");	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОграничитьВыборТоваровВЗаказДоговорПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Розница");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОграничитьВыборМатериаловВЗаказДоговорПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Розница");
КонецПроцедуры

&НаКлиенте
Процедура РазрешеннаяНоменклатура(Команда)
	
	ЗначениеОтбора = Новый Структура("Назначение", ?(Команда.Имя = "РазрешеннаяНоменклатураМатериалы", "Материалы", "Товары"));
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.РазрешеннаяНоменклатураРозницы.ФормаСписка", ПараметрыВыбора, , новый УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработкаВкладкиПроизводство

//&НаКлиенте
//Процедура НаборКонстантИспользоватьСтатусНовыйВЗаказеПокупателяПриИзменении(Элемент)
//	Если НЕ НаборКонстант.ИспользоватьСтатусНовыйВЗаказеПокупателя Тогда
//		НаборКонстант.ПереводитьЗаказПриОткрытииВСтатусВРаботе = Ложь;
//	КонецЕсли;
//	ОбновитьЭлементыФормыНаСервере("Производство");
//КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтатусыЗаказовПокупателей(Команда)
	ОткрытьФорму("Справочник.СтатусыЗаказовПокупателей.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьСтатусЗакрытВЗаказеПокупателяПриИзменении(Элемент)
	Если НЕ НаборКонстант.ИспользоватьСтатусЗакрытВЗаказеПокупателя Тогда
		НаборКонстант.ЗапретитьПереводЗаказаВСтатусЗакрытПриНеполнойОплате = Ложь;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Производство");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантРасчетЗарплатыПроизводстваПоОперациямПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Производство");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантШтрихкодСотрудникаСодержитКодОперацииПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Производство");
КонецПроцедуры

//#13536 закомментировано
//&НаКлиенте
//Процедура СформироватьШК(Команда)
//	ОткрытьФорму("ОбщаяФорма.ФормированиеШтрихкодаПоОперациям", новый Структура(), ЭтотОбъект);
//КонецПроцедуры

&НаКлиенте
Процедура НастройкаЦветовОформленияЗаказов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заказы", Истина);
	ПараметрыФормы.Вставить("НастройкиОформления", ПолучитьНастройкиОформленияЗаказов());
	ПараметрыФормы.Вставить("ВремяПодсветкиЗнППоДатеОжидаемойОтгрузки", ВремяПодсветкиЗнППоДатеОжидаемойОтгрузки);
	ПараметрыФормы.Вставить("ВремяПодсветкиЗППоДатеОжидаемойОтгрузки",  ВремяПодсветкиЗППоДатеОжидаемойОтгрузки);
	Оповещение = Новый ОписаниеОповещения("НастройкиОформленияЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.НастройкаПодсветки", ПараметрыФормы, ЭтаФорма,,,, Оповещение);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОформленияЗаказов()
	
	Возврат ОбщийМодульСервер.ПолучитьНастройкиОформленияЗаказов(НастройкаОформленияЗаказов);
			
КонецФункции

&НаКлиенте
Процедура НастройкиОформленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда		
		НастройкаОформленияЗаказов = Результат.НастройкиОформления;
		ВремяПодсветкиЗнППоДатеОжидаемойОтгрузки = Результат.ВремяПодсветкиЗнППоДатеОжидаемойОтгрузки;
		ВремяПодсветкиЗППоДатеОжидаемойОтгрузки  = Результат.ВремяПодсветкиЗППоДатеОжидаемойОтгрузки;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура НаборКонстантНастройкаИнтеркампаниДляВнутреннихЗаказовПриИзмененииНаСервере()
//	
//	Если ЗначениеЗаполнено(НаборКонстант.НастройкаИнтеркампаниДляВнутреннихЗаказов) Тогда
//		Если НЕ НаборКонстант.НастройкаИнтеркампаниДляВнутреннихЗаказов.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
//			НаборКонстант.НастройкаИнтеркампаниДляВнутреннихЗаказов = Справочники.НастройкиИнтеркампани.ПустаяСсылка();	
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура НаборКонстантНастройкаИнтеркампаниДляВнутреннихЗаказовПриИзменении(Элемент)
//	НаборКонстантНастройкаИнтеркампаниДляВнутреннихЗаказовПриИзмененииНаСервере();
//КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьВнутренниеЗаказыПриИзменении(Элемент)
	
	Если НЕ НаборКонстант.ИспользоватьВнутренниеЗаказы Тогда
		НаборКонстант.ОтображатьКонтрагентаВоВнутреннихЗаказах = Ложь;
		НаборКонстант.ОтображатьЦеныВоВнутреннихЗаказах = Ложь;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Производство");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантШаблонНаименованияПродукцииНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипШаблона", "ШаблонНаименованияПродукции");
	ПараметрыФормы.Вставить("Шаблон", НаборКонстант.ШаблонНаименованияПродукции);

	ОписаниеОповещения = Новый ОписаниеОповещения("НаборКонстантШаблонНаименованияПродукцииОбработкаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.ФормаНастройкиШаблонаНомера", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантШаблонНаименованияПродукцииОбработкаЗавершение(ПараметрыОтвета, ДополнительныеПараметры) Экспорт

	Если ПараметрыОтвета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборКонстант.ШаблонНаименованияПродукции = ПараметрыОтвета.ШаблонНомера;
	Модифицированность = Истина;
	ОбновитьЭлементыФормыНаСервере("Производство");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОкруглятьСтоимостьПотолкаПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Производство");	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантКонтролироватьМаксимальноеКоличествоПотолковВЧасКОтгрузкеПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Производство");
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиСкидкиБонусы

&НаКлиенте
Процедура НаборКонстантИспользоватьАвтоматическиеСкидкиПриИзменении(Элемент)
	
	Если НЕ НаборКонстант.ИспользоватьАвтоматическиеСкидки Тогда 
		НаборКонстант.ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат = Ложь;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Бонусы");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеВнутреннейСистемыБонусовПриИзменении()
	
	Если НЕ НаборКонстант.УчитыватьБонусы 
		//#13359 
		ИЛИ НЕ НаборКонстант.ВидБонуснойСистемы = ПредопределенноеЗначение("Перечисление.ВидыБонусныхСистем.Внутренняя") Тогда
		НаборКонстант.НачислятьБонусыПоДисконтнойКартеПриЗачетеБонусовКакСкидку = Ложь;
		НаборКонстант.АвтоматическиНачислятьБонусы                              = Ложь;
		НаборКонстант.СписыватьБонусыПоДокументуЗаказПокупателя                 = Ложь;
		НаборКонстант.СписыватьБонусыПоДокументуРеализацияТоваровИУслуг         = Ложь;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Бонусы");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантУчитыватьБонусыПриИзменении(Элемент)
	
	ИспользованиеВнутреннейСистемыБонусовПриИзменении()
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВидБонуснойСистемыПриИзменении(Элемент)
	
	ИспользованиеВнутреннейСистемыБонусовПриИзменении()
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантАвтоматическоеНачислениеБонусовПриИзменении(Элемент)
	
	// №13299 убрана привязка
	//Если НЕ НаборКонстант.АвтоматическоеНачислениеБонусов Тогда
	//	НаборКонстант.НачислятьБонусыПоДисконтнойКартеПриЗачетеБонусовКакСкидку = Ложь;
	//КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Бонусы");
	
КонецПроцедуры

//++ №13299
&НаКлиенте
Процедура НаборКонстантСписыватьБонусыПоДокументуЗаказПокупателяПриИзменении(Элемент)
	
	Если НаборКонстант.СписыватьБонусыПоДокументуЗаказПокупателя Тогда
		НаборКонстант.СписыватьБонусыПоДокументуРеализацияТоваровИУслуг = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантСписыватьБонусыПоДокументуРеализацияТоваровИУслугПриИзменении(Элемент)
	
	Если НаборКонстант.СписыватьБонусыПоДокументуРеализацияТоваровИУслуг Тогда
		НаборКонстант.СписыватьБонусыПоДокументуЗаказПокупателя = Ложь;
	КонецЕсли;
		
КонецПроцедуры
//-- №13299

#КонецОбласти

#Область ОбработкаВкладкиЗагрузкаИзПостроителя

&НаСервере
Функция ПолучитьОписаниеОбменаСEasyCeiling()
	
	Текст = ПолучитьобщийМакет("ОписаниеОбменаСEasyCeiling");
	Текст.ПолучитьТекст();
	
	Возврат Текст;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОписаниеФорматаОбменаСEasyCeiling(Команда)
	
	ПолучитьОписаниеОбменаСEasyCeiling().Показать("Описание формата обмена с EasyCeiling");
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенныеПравилаЗагрузкиИзПостроителя(Команда)
	ОткрытьФорму("РегистрСведений.ПравилаОбработкиФайлаПрограммыПостроителя.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПорядокФормированияНаименованияПотолкаПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("ЗагрузкаИзПостроителя");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПорядокФормированияНаименованияОтрезаПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("ЗагрузкаИзПостроителя");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПорядокФормированияНаименованияТиповогоОтрезаПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("ЗагрузкаИзПостроителя");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПорядокФормированияНаименованияОстатковПленкиПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("ЗагрузкаИзПостроителя");	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПерерасходПленкиКоэффициентПриИзменении(Элемент)
	
	Если НаборКонстант.ПерерасходПленкиКоэффициент = 0 Тогда
		НаборКонстант.ПерерасходПленкиНоменклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("ЗагрузкаИзПостроителя");
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилоОпределенияОтреза(Команда)
	ПоказатьЗначение(, ПредопределенноеЗначение("Справочник.ПравилаОпределенияВидаПотолка.Отрез"));
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиИнтеркампани

&НаКлиенте
Процедура НаборКонстантИспользоватьИнтеркампаниПриИзменении(Элемент)
	
	Если НЕ НаборКонстант.ИспользоватьИнтеркампани Тогда
		НаборКонстант.РучнойЗапускОбработкиСозданияДокументовПоступленийПоРучнымЗаказам = Ложь;	
		НаборКонстант.РучнойЗапускОбработкиСозданияДокументовПоступленийПотолковВРозницеОтПроизводства = Ложь;
		НаборКонстант.РучнойЗапускОбработкиСозданияДокументовПоступленийПоУдаленнойБазе = Ложь;
		АвтоматическиСоздаватьДокументыПоступленийТоваровОтПроизводстваНаРозницу = Ложь;
		АвтоматическиСоздаватьДокументыПоступленийПоРучнымЗаказам = Ложь;
		АвтоматическиСоздаватьДокументыПоступленийПоУдаленнойБазе = Ложь;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Интеркампани");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИсточникНастроекИнтеркампаниПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Интеркампани");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОсновнаяНастройкаИнтеркампаниПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Интеркампани");
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИнтеркампани(Команда)
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("Ключ", НаборКонстант.ОсновнаяНастройкаИнтеркампани);
	ОткрытьФорму("Справочник.НастройкиИнтеркампани.ФормаОбъекта", ПараметрыНовойФормы);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкиПодключенияРозницаНажатие(Элемент)
	
	ОткрытьФорму("ПланОбмена.ОбменБазаПроизводстваБазаРозницы.Форма.СписокНастроенныхОбменов", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкиПодключенияПроизводствоНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭтоБазаПроизводства", Истина);
	ОткрытьФорму("ПланОбмена.ОбменБазаПроизводстваБазаРозницы.Форма.СписокНастроенныхОбменов", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиСоздаватьДокументыПоступленийТоваровОтПроизводстваНаРозницуПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Интеркампани");
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиСоздаватьДокументыПоступленийПоРучнымЗаказамПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Интеркампани");	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиСоздаватьДокументыПоступленийПоУдаленнойБазеПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Интеркампани");
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеСозданияПоступленийИнтеркампани(Команда)
	
	ИмяРегламентногоЗадания = "";
	Если Команда.Имя = "НастроитьРасписаниеСозданияПоступленийИнтеркампани1" Тогда
		ИмяРегламентногоЗадания = "СозданиеПоступленийТоваровОтПроизводства";
	ИначеЕсли Команда.Имя = "НастроитьРасписаниеСозданияПоступленийИнтеркампани2" Тогда
		ИмяРегламентногоЗадания = "СозданиеПоступленийТоваровОтПроизводстваПоРучнымЗаказам";
	ИначеЕсли Команда.Имя = "НастроитьРасписаниеСозданияПоступленийИнтеркампани3" Тогда
		ИмяРегламентногоЗадания = "СозданиеПоступленийТоваровОтПроизводстваПоУдаленнойБазе";
	Иначе
		Возврат;
	КонецЕсли;
	
	#Если Не МобильныйКлиент Тогда
		
	РасписаниеРегламентногоЗадания = ПолучитьРасписаниеРегламентногоЗадания(ИмяРегламентногоЗадания);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьРасписаниеСозданияПоступленийИнтеркампаниЗавершение", ЭтотОбъект, ИмяРегламентногоЗадания);
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	Диалог.Показать(ОписаниеОповещения);
	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеСозданияПоступленийИнтеркампаниЗавершение(НовоеРасписание, ИмяРегламентногоЗадания) Экспорт

	Если НовоеРасписание <> Неопределено Тогда
		СохранитьРасписаниеРегламентногоЗадания(ИмяРегламентногоЗадания, НовоеРасписание);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиФинансы

&НаКлиенте
Процедура НаборКонстантНеКонтролироватьОстатокДенежныхСредствПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Финансы");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьЗаявкиНаРасходованиеДенежныхСредствПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Финансы");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьУчетПоСтатьямДДСПриИзменении(Элемент)
	
	Если НЕ НаборКонстант.ИспользоватьУчетПоСтатьямДДС Тогда
		НаборКонстант.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах = Ложь;
	КонецЕсли;	
	ОбновитьЭлементыФормыНаСервере("Финансы");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьВедениеУчетаДоходовРасходовПриИзменении(Элемент)
	
	Если НЕ НаборКонстант.ИспользоватьВедениеУчетаДоходовРасходов Тогда
		НаборКонстант.КассовыйМетодВеденияУчетаДоходовРасходов   = Ложь;
		НаборКонстант.НекассовыйМетодВеденияУчетаДоходовРасходов = Ложь;
		НаборКонстант.ИспользоватьВедениеУчетаДоходовРасходовПострочно = Ложь;
	КонецЕсли;	
	ОбновитьЭлементыФормыНаСервере("Финансы");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантНекассовыйМетодВеденияУчетаДоходовРасходовПриИзменении(Элемент)
	
	Если НЕ НаборКонстант.НекассовыйМетодВеденияУчетаДоходовРасходов Тогда
		НаборКонстант.ИспользоватьВедениеУчетаДоходовРасходовПострочно = Ложь;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Финансы");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСтатейДоходовРасходовПоУмолчанию(Команда)
	ОткрытьФорму("РегистрСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.Форма.ФормаРедактированияНастроек");
КонецПроцедуры

&НаКлиенте
Процедура ВестиРасчетыПоЗаказамПриИзменении(Элемент)
	ПоказатьПредупреждение(,"ВНИМАНИЕ! При изменении этой настройки вам следует вручную перепровести все документы данного вида и документы оплаты, которые делали по ним движения!");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантРазрешитьПеремещениеДенежныхСредствМеждуОрганизациямиПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Финансы");
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиЗарплата

&НаКлиенте
Процедура НаборКонстантВестиТабельСотрудниковПриИзменении(Элемент)
	
	//#12261
	ОчиститьСообщения();
	Если НЕ НаборКонстант.ВестиТабельСотрудников И ЕстьОткрытыеСменыУчетаРабочегоВремени() Тогда
		НаборКонстант.ВестиТабельСотрудников = НЕ НаборКонстант.ВестиТабельСотрудников;
		Сообщить("Имеются незакрытые смены учета рабочего времени: изменение настройки невозможно");
		Возврат;
	КонецЕсли;
	
	ОбновитьЭлементыФормыНаСервере("Зарплата");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВестиТабельСотрудниковВРучномРежимеПриИзменении(Элемент)
	
	//#12261
	ОчиститьСообщения();
	Если ЕстьОткрытыеСменыУчетаРабочегоВремени() Тогда
		НаборКонстант.ВестиТабельСотрудниковВРучномРежиме = НЕ НаборКонстант.ВестиТабельСотрудниковВРучномРежиме;
		Сообщить("Имеются незакрытые смены учета рабочего времени: изменение настройки невозможно");
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере 
Функция ЕстьОткрытыеСменыУчетаРабочегоВремени()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабельСотрудников.Период КАК Период,
	|	ТабельСотрудников.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.ТабельСотрудников КАК ТабельСотрудников
	|ГДЕ
	|	ТабельСотрудников.КонецСмены = ДАТАВРЕМЯ(1, 1, 1)";

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();	

КонецФункции

#КонецОбласти

#Область ОбработкаВкладкиРасширенныеСервисы

&НаКлиенте
Процедура СгенерироватьКлючAPI(Команда)
	
	НаборКонстант.КлючAPI = Строка(Новый УникальныйИдентификатор);
	
	ОбновитьЭлементыФормыНаСервере("Телефония"); // для формирования адреса внешней системы
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПубликациюБазы(Команда)
	
	//Если Модифицированность Тогда
	//	ПоказатьПредупреждение(,"Предварительно необходимо сохранить настройки");
	//	Возврат;
	//КонецЕсли;
	//
	//Если ПустаяСтрока(НаборКонстант.ПутьКПубликацииБазыДляМобильногоКлиентаSmartCeilings) Тогда
	//	ПоказатьПредупреждение(,"Не указан ""Путь к публикации базы""");
	//	Возврат;
	//КонецЕсли;	
	//
	//Если ПустаяСтрока(НаборКонстант.КлючAPI) Тогда
	//	ПоказатьПредупреждение(,"Не указан ключ API");
	//	Возврат;
	//КонецЕсли;	
	//
	//РезультатПроверки = МобильныйКлиент.ПроверитьПубликациюБазы();	
	//Парам = Новый Структура;
	//Парам.Вставить("РезультатПроверки",РезультатПроверки);
	//ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.ФормаПроверкиПубликацииБазы", Парам, ЭтаФорма, ,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяМобильныйКлиентЗамерщикаПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользуетсяМобильныйКлиентЗамерщика Тогда
		НаборКонстант.ИспользуетсяМобильныйКлиентЗамерщика = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаДляПользователейПриИзменении(Элемент)
	
	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
	
	ОбщиеНастройкиМКЗамерщика = НЕ НаборКонстант.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаДляПользователей;
	Если НаборКонстант.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаДляПользователей Тогда
		НаборКонстант.РазрешитьЗвонкиКонтрагентуСМобильногоКлиентаНапрямую = Ложь;
		Объект.ОтображатьЗамерыБудущейДатыВМобильномКлиентеЗамерщика = Ложь;
		НаборКонстант.ИспользуетсяПредварительныйРасчетВМобильномКлиентеЗамерщика = Ложь;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеНастройкиМКЗамерщикаПриИзменении(Элемент)
	
	НаборКонстант.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаДляПользователей = НЕ ОбщиеНастройкиМКЗамерщика;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользуетсяМобильныйКлиентМонтажникаПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользуетсяМобильныйКлиентМонтажника Тогда
		НаборКонстант.ИспользуетсяМобильныйКлиентМонтажника = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
			
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаМонтажникаДляПользователейПриИзменении(Элемент)
	
	ОбщиеНастройкиМКМонтажника = НЕ НаборКонстант.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаМонтажникаДляПользователей;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеНастройкиМКМонтажникаПриИзменении(Элемент)
	
	НаборКонстант.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаМонтажникаДляПользователей = НЕ ОбщиеНастройкиМКМонтажника;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");

КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользуетсяСервисПроверкиПотолковПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользуетсяСервисПроверкиПотолков Тогда
		НаборКонстант.ИспользуетсяСервисПроверкиПотолков = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВестиЛогированиеЗапросовРойстатПриИзменении(Элемент)
	
	НаборКонстантВестиЛогированиеЗапросовРойстатПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаборКонстантВестиЛогированиеЗапросовРойстатПриИзмененииНаСервере()
	
	Если НаборКонстант.ВестиЛогированиеЗапросовРойстат = Истина Тогда
		НаборКонстант.ЛогРойстатОтключитьПосле = ТекущаяДата() + 3*60*60; // именно ТекущаяДата(), нужно серверное время
	Иначе
		НаборКонстант.ЛогРойстатОтключитьПосле = Дата(1, 1, 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменССайтомCMLИспользоватьПриИзменении(Элемент)
	
	Если НаборКонстант.ОбменССайтомCMLИспользовать тогда
		НаборКонстант.ОбменССайтомCMLИспользовать = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЛогОбменаССайтомНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.ЛогОбменаССайтом.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиОбменССайтом(Команда)
	
	ОткрытьФорму("ПланОбмена.ОбменССайтом.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьОбменСWikkiПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьОбменСWikki тогда
		НаборКонстант.ИспользоватьОбменСWikki = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиОбменаСWikki(Команда)
	
	ОткрытьФорму("ПланОбмена.ОбменСWikki.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЛогОбменаСWikkiНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.ЛогОбменаСWikki.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиТелефония

&НаКлиенте
Процедура НаборКонстантИспользоватьСофтФонПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьСофтФон тогда
		НаборКонстант.ИспользоватьСофтФон = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьСофтФон Тогда
		НаборКонстант.ИспользоватьROMAsterisk = Ложь;
		НаборКонстант.ИспользоватьROMHMAC = Ложь;
		НаборКонстант.ИспользоватьМегафон = Ложь;
		НаборКонстант.ИспользоватьUIS = Ложь;
		НаборКонстант.ИспользоватьDomRu = Ложь;
		НаборКонстант.ИспользоватьSipuni = Ложь;
		НаборКонстант.ИспользоватьBinotel = Ложь;
		НаборКонстант.ИспользоватьMango = Ложь;
		НаборКонстант.ИспользоватьPhonet = Ложь;
		НаборКонстант.ИспользоватьБилайн = Ложь;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьROMAsteriskПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьROMAsterisk тогда
		НаборКонстант.ИспользоватьROMAsterisk = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьROMAsterisk Тогда
		НаборКонстант.ИспользоватьСофтФон = Ложь;
		НаборКонстант.ИспользоватьROMHMAC = Ложь;
		НаборКонстант.ИспользоватьМегафон = Ложь;
		НаборКонстант.ИспользоватьUIS = Ложь;
		НаборКонстант.ИспользоватьDomRu = Ложь;
		НаборКонстант.ИспользоватьSipuni = Ложь;
		НаборКонстант.ИспользоватьBinotel = Ложь;
		НаборКонстант.ИспользоватьMango = Ложь;
		НаборКонстант.ИспользоватьPhonet = Ложь;
		НаборКонстант.ИспользоватьБилайн = Ложь;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантТелефонияКонтекстИсходящихЗвонковПриИзменении(Элемент)
	НаборКонстант.ТелефонияКонтекстИсходящихЗвонков = СокрЛП(НаборКонстант.ТелефонияКонтекстИсходящихЗвонков);	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьROMHMACПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьROMHMAC тогда
		НаборКонстант.ИспользоватьROMHMAC = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьROMHMAC Тогда
		НаборКонстант.ИспользоватьROMAsterisk = Ложь;
		НаборКонстант.ИспользоватьСофтФон = Ложь;
		НаборКонстант.ИспользоватьМегафон = Ложь;
		НаборКонстант.ИспользоватьUIS = Ложь;
		НаборКонстант.ИспользоватьDomRu = Ложь;
		НаборКонстант.ИспользоватьSipuni = Ложь;
		НаборКонстант.ИспользоватьBinotel = Ложь;
		НаборКонстант.ИспользоватьMango = Ложь;
		НаборКонстант.ИспользоватьPhonet = Ложь;
		НаборКонстант.ИспользоватьБилайн = Ложь;
		
		НаборКонстант.ТелефонияАдресСервера = "*.onpbx.ru";
		НаборКонстант.ИнтервалЗапросаИсторииЗвонков = 180;
		НаборКонстант.ИнтервалПроверкиПодключенияКАТС = 60;
		//НаборКонстант.ВерсияИсторииАТС = 1;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьМегафонПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьМегафон тогда
		НаборКонстант.ИспользоватьМегафон = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьМегафон Тогда
		НаборКонстант.ИспользоватьROMAsterisk = Ложь;
		НаборКонстант.ИспользоватьСофтФон = Ложь;
		НаборКонстант.ИспользоватьROMHMAC = Ложь;		
		НаборКонстант.ИспользоватьUIS = Ложь;
		НаборКонстант.ИспользоватьDomRu = Ложь;
		НаборКонстант.ИспользоватьSipuni = Ложь;
		НаборКонстант.ИспользоватьBinotel = Ложь;
		НаборКонстант.ИспользоватьMango = Ложь;
		НаборКонстант.ИспользоватьPhonet = Ложь;
		НаборКонстант.ИспользоватьБилайн = Ложь;
		
		НаборКонстант.ТелефонияАдресСервера = "vats*.megapbx.ru";
		НаборКонстант.ИнтервалЗапросаИсторииЗвонков = 180;
		НаборКонстант.ИнтервалПроверкиПодключенияКАТС = 60;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьUISПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьUIS тогда
		НаборКонстант.ИспользоватьUIS = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьUIS Тогда
		НаборКонстант.ИспользоватьROMAsterisk = Ложь;
		НаборКонстант.ИспользоватьСофтФон = Ложь;
		НаборКонстант.ИспользоватьROMHMAC = Ложь;		
		НаборКонстант.ИспользоватьМегафон = Ложь;
		НаборКонстант.ИспользоватьDomRu = Ложь;
		НаборКонстант.ИспользоватьSipuni = Ложь;
		НаборКонстант.ИспользоватьBinotel = Ложь;
		НаборКонстант.ИспользоватьMango = Ложь;
		НаборКонстант.ИспользоватьPhonet = Ложь;
		НаборКонстант.ИспользоватьБилайн = Ложь;
		
		НаборКонстант.ТелефонияАдресСервера = "dataapi.uiscom.ru";
		НаборКонстант.ИнтервалЗапросаИсторииЗвонков = 180;
		НаборКонстант.ИнтервалПроверкиПодключенияКАТС = 60;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьDomRuПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьDomRu тогда
		НаборКонстант.ИспользоватьDomRu = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьDomRu Тогда
		НаборКонстант.ИспользоватьROMAsterisk = Ложь;
		НаборКонстант.ИспользоватьСофтФон = Ложь;
		НаборКонстант.ИспользоватьROMHMAC = Ложь;
		НаборКонстант.ИспользоватьМегафон = Ложь;
		НаборКонстант.ИспользоватьUIS = Ложь;
		НаборКонстант.ИспользоватьSipuni = Ложь;
		НаборКонстант.ИспользоватьBinotel = Ложь;
		НаборКонстант.ИспользоватьMango = Ложь;
		НаборКонстант.ИспользоватьPhonet = Ложь;
		НаборКонстант.ИспользоватьБилайн = Ложь;
		
		НаборКонстант.ТелефонияАдресСервера = "";
		НаборКонстант.ИнтервалЗапросаИсторииЗвонков = 180;
		НаборКонстант.ИнтервалПроверкиПодключенияКАТС = 60;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьSipuniПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьSipuni тогда
		НаборКонстант.ИспользоватьSipuni = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьSipuni Тогда
		НаборКонстант.ИспользоватьROMAsterisk = Ложь;
		НаборКонстант.ИспользоватьСофтФон = Ложь;
		НаборКонстант.ИспользоватьROMHMAC = Ложь;
		НаборКонстант.ИспользоватьМегафон = Ложь;
		НаборКонстант.ИспользоватьUIS = Ложь;
		НаборКонстант.ИспользоватьDomRu = Ложь;
		НаборКонстант.ИспользоватьBinotel = Ложь;
		НаборКонстант.ИспользоватьMango = Ложь;
		НаборКонстант.ИспользоватьPhonet = Ложь;
		НаборКонстант.ИспользоватьБилайн = Ложь;
		
		НаборКонстант.ТелефонияАдресСервера = "*.sipuni.com";
		НаборКонстант.ИнтервалЗапросаИсторииЗвонков = 180;
		НаборКонстант.ИнтервалПроверкиПодключенияКАТС = 60;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьBinotelПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьBinotel тогда
		НаборКонстант.ИспользоватьBinotel = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьBinotel Тогда
		НаборКонстант.ИспользоватьROMAsterisk = Ложь;
		НаборКонстант.ИспользоватьСофтФон = Ложь;
		НаборКонстант.ИспользоватьROMHMAC = Ложь;
		НаборКонстант.ИспользоватьМегафон = Ложь;
		НаборКонстант.ИспользоватьUIS = Ложь;
		НаборКонстант.ИспользоватьDomRu = Ложь;
		НаборКонстант.ИспользоватьSipuni = Ложь;
		НаборКонстант.ИспользоватьMango = Ложь;
		НаборКонстант.ИспользоватьPhonet = Ложь;
		НаборКонстант.ИспользоватьБилайн = Ложь;
		
		//НаборКонстант.ТелефонияАдресСервера = "my.binotel.ua";
		НаборКонстант.ТелефонияАдресСервера = "api.binotel.com";
		НаборКонстант.ИнтервалЗапросаИсторииЗвонков = 180;
		НаборКонстант.ИнтервалПроверкиПодключенияКАТС = 60;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьMangoПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьMango тогда
		НаборКонстант.ИспользоватьMango = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьMango Тогда
		НаборКонстант.ИспользоватьROMAsterisk = Ложь;
		НаборКонстант.ИспользоватьСофтФон = Ложь;
		НаборКонстант.ИспользоватьROMHMAC = Ложь;
		НаборКонстант.ИспользоватьМегафон = Ложь;
		НаборКонстант.ИспользоватьUIS = Ложь;
		НаборКонстант.ИспользоватьDomRu = Ложь;
		НаборКонстант.ИспользоватьSipuni = Ложь;
		НаборКонстант.ИспользоватьBinotel = Ложь;
		НаборКонстант.ИспользоватьPhonet = Ложь;
		НаборКонстант.ИспользоватьБилайн = Ложь;
		
		НаборКонстант.ТелефонияАдресСервера = "app.mango-office.ru"; ///vpbx/"; //api.simplit.io/ВАШ_ЛОГИН/mango";
		НаборКонстант.ИнтервалЗапросаИсторииЗвонков = 180;
		НаборКонстант.ИнтервалПроверкиПодключенияКАТС = 60;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьPhonetПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьPhonet тогда
		НаборКонстант.ИспользоватьPhonet = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьPhonet Тогда
		НаборКонстант.ИспользоватьROMAsterisk = Ложь;
		НаборКонстант.ИспользоватьСофтФон = Ложь;
		НаборКонстант.ИспользоватьROMHMAC = Ложь;
		НаборКонстант.ИспользоватьМегафон = Ложь;
		НаборКонстант.ИспользоватьUIS = Ложь;
		НаборКонстант.ИспользоватьDomRu = Ложь;
		НаборКонстант.ИспользоватьSipuni = Ложь;
		НаборКонстант.ИспользоватьBinotel = Ложь;
		НаборКонстант.ИспользоватьMango = Ложь;
		НаборКонстант.ИспользоватьБилайн = Ложь;
		
		НаборКонстант.ТелефонияАдресСервера = "*.phonet.com.ua"; // ВАШ_ЛОГИН.phonet.com.ua";
		НаборКонстант.ИнтервалЗапросаИсторииЗвонков = 180;
		НаборКонстант.ИнтервалПроверкиПодключенияКАТС = 60;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьБилайнПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьБилайн тогда
		НаборКонстант.ИспользоватьБилайн = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьБилайн Тогда
		НаборКонстант.ИспользоватьROMAsterisk = Ложь;
		НаборКонстант.ИспользоватьСофтФон = Ложь;
		НаборКонстант.ИспользоватьROMHMAC = Ложь;
		НаборКонстант.ИспользоватьМегафон = Ложь;
		НаборКонстант.ИспользоватьUIS = Ложь;
		НаборКонстант.ИспользоватьDomRu = Ложь;
		НаборКонстант.ИспользоватьSipuni = Ложь;
		НаборКонстант.ИспользоватьBinotel = Ложь;
		НаборКонстант.ИспользоватьPhonet = Ложь;
		
		НаборКонстант.ТелефонияАдресСервера = "cloudpbx.beeline.ru";
		НаборКонстант.ИнтервалЗапросаИсторииЗвонков = 180;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВариантБиблиотекиТелефонииПриИзменении(Элемент)

	ОбновитьЭлементыФормыНаСервере("Телефония");
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьАдресВнешнейСистемыДляВАТС(Команда)
	ОбщийМодульКлиент.СкопироватьВБуферОбмена(АдресВнешнейСистемыДляВАТС, НСтр("ru = 'Адрес скопирован'"));	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИнтервалЗапросаИсторииЗвонковПриИзменении(Элемент)
	Если НаборКонстант.ИнтервалЗапросаИсторииЗвонков > 0 
		И НаборКонстант.ИнтервалЗапросаИсторииЗвонков < 180 
		И НЕ НаборКонстант.ИспользоватьROMAsterisk Тогда
		НаборКонстант.ИнтервалЗапросаИсторииЗвонков = 180;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомераТелефоновИсключений(Команда)
	ОткрытьФорму("РегистрСведений.НомераТелефоновИсключений.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВестиЛоггированиеСобытийАТСПриИзменении(Элемент)
	
	НаборКонстантВестиЛоггированиеСобытийАТСПриИзмененииНаСервере();
	//Если НаборКонстант.ВестиЛоггированиеСобытийАТС = Истина Тогда
	//	НаборКонстант.ЛогСобытийАТСОтключитьПосле = ТекущаяДата() + 3*60*60;
	//Иначе
	//	НаборКонстант.ЛогСобытийАТСОтключитьПосле = Дата(1, 1, 1);
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НаборКонстантВестиЛоггированиеСобытийАТСПриИзмененииНаСервере()
	
	Если НаборКонстант.ВестиЛоггированиеСобытийАТС = Истина Тогда
		НаборКонстант.ЛогСобытийАТСОтключитьПосле = ТекущаяДата() + 3*60*60; // именно ТекущаяДата()
	Иначе
		НаборКонстант.ЛогСобытийАТСОтключитьПосле = Дата(1, 1, 1);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиИнтеграции

&НаКлиенте
Процедура НаборКонстантRVY_ИспользоватьИнтеграциюПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Интеграции");
КонецПроцедуры

&НаКлиенте
Процедура RVY_Аутентификация(Команда)
	
	ДанныеТокена = RVY_ОбщийМодульКлиентСервер.ОбновитьТокен(НаборКонстант.RVY_Логин, НаборКонстант.RVY_Пароль);
	Если ТипЗнч(ДанныеТокена) = Тип("Структура") Тогда
		НаборКонстант.RVY_Токен = ДанныеТокена.Токен;
		НаборКонстант.RVY_ДатаПолученияТокена = ДанныеТокена.ДатаПолучения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура RVY_Регистр(Команда)
	
	ОткрытьФорму("РегистрСведений.RVY_Вебхуки.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОтображатьКнопкуОтправитьWhatsAppПриИзменении(Элемент)
	
	Если НаборКонстант.ОтображатьКнопкуОтправитьWhatsApp Тогда
		НаборКонстант.ВариантВызоваWhatsApp = ПредопределенноеЗначение("Перечисление.ВариантыВызоваМессенджеров.ДиалогВБраузере");	
	Иначе
		НаборКонстант.ВариантВызоваWhatsApp = ПредопределенноеЗначение("Перечисление.ВариантыВызоваМессенджеров.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОтображатьКнопкуОтправитьTelegramПриИзменении(Элемент)
	
	Если НаборКонстант.ОтображатьКнопкуОтправитьTelegram Тогда
		НаборКонстант.ВариантВызоваTelegram = ПредопределенноеЗначение("Перечисление.ВариантыВызоваМессенджеров.ДиалогВБраузере");	
	Иначе
		НаборКонстант.ВариантВызоваTelegram = ПредопределенноеЗначение("Перечисление.ВариантыВызоваМессенджеров.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантUDS_ИспользоватьИнтеграциюПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Интеграции");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиUDS(Команда)
	
	ОткрытьФорму("Справочник.UDS_Настройки.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиОтправкаСМС

&НаКлиенте
Процедура АвтоматическаяРассылкаСМСПриИзменении(Элемент)
	
	Если НаборКонстант.АвтоматическаяРассылкаСМС тогда
		НаборКонстант.АвтоматическаяРассылкаСМС = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("СМС");

КонецПроцедуры

&НаКлиенте
Функция ОтметитьСервисСМС(ИмяСервисаНастройки)
	
	МассивСервисов = Новый Массив;
	МассивСервисов.Добавить("ЕВостокИспользоватьОтправкуСМС");
	МассивСервисов.Добавить("СМСFlyИспользоватьОтправкуСМС");
	МассивСервисов.Добавить("КазИнфоТехИспользоватьОтправкуСМС");
	МассивСервисов.Добавить("СМСРуИспользоватьОтправкуСМС");
	МассивСервисов.Добавить("ИспользоватьОтправкуСМСRocketSMSBy"); //2020-04-02
	МассивСервисов.Добавить("ИспользоватьОтправкуСМСProstorSMS"); // №8533
	
	Для каждого ИмяСервиса из МассивСервисов Цикл
		Если НЕ (ИмяСервиса = ИмяСервисаНастройки) Тогда
			НаборКонстант[ИмяСервиса] = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьЭлементыФормыНаСервере("СМС");
		
КонецФункции

&НаКлиенте
Процедура ИспользоватьОтправкуСМСЕВостокПриИзменении(Элемент)
	
	ОтметитьСервисСМС("ЕВостокИспользоватьОтправкуСМС");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтправкуСМССМСFlyПриИзменении(Элемент)
	
	ОтметитьСервисСМС("СМСFlyИспользоватьОтправкуСМС");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтправкуСМСКазИнфоТехПриИзменении(Элемент)
	
	ОтметитьСервисСМС("КазИнфоТехИспользоватьОтправкуСМС");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтправкуСМСSMSRuПриИзменении(Элемент)
	
	ОтметитьСервисСМС("СМСРуИспользоватьОтправкуСМС");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтправкуСМСRocketSMSByПриИзменении(Элемент)
	
	ОтметитьСервисСМС("ИспользоватьОтправкуСМСRocketSMSBy");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьОтправкуСМСProstorSMSПриИзменении(Элемент)
	
	ОтметитьСервисСМС("ИспользоватьОтправкуСМСProstorSMS");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьБалансСМС(Команда)
	Если НаборКонстант.СМСРуИспользоватьОтправкуСМС И НЕ ЗначениеЗаполнено(СМСРуAPIID) Тогда
		Сообщить("Введите API ID");
		Возврат;
	КонецЕсли;	
	Сообщить("Текущий баланс = " + ПроверитьБалансСМСНаСервере(ЕВостокСМСЛогин, ЕВостокСМСПароль, ЕВостокСМСНомерСервиса));
КонецПроцедуры

&НаСервере
Функция ПроверитьБалансСМСНаСервере(Логин, Пароль, НомерСервиса)	
	Возврат РаботаССМС.ПолучитьБаланс(Логин,Пароль,НомерСервиса,,,СМСРуAPIID);
КонецФункции

&НаКлиенте
Процедура АвтоматическиСоздаватьПоздравленияСДнемРожденияПоСМСПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьСМСВсемКонтрагентамКромеПризнакаПриИзменении(Элемент)
	Если ОтправлятьСМСВсемКонтрагентамКромеПризнака Тогда 
		ОтправлятьСМСТолькоКонтрагентамСПризнаком = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьСМСТолькоКонтрагентамСПризнакомПриИзменении(Элемент)
	Если ОтправлятьСМСТолькоКонтрагентамСПризнаком Тогда 
		ОтправлятьСМСВсемКонтрагентамКромеПризнака = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьСМСКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроиведенПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВкладкиЭлектроннаяПочта

&НаКлиенте
Процедура НаборКонстантУчетнаяЗаписьЭлектроннойПочтыПоУмолчаниюПриИзменении(Элемент)
	Если НЕ НаборКонстант.УчетнаяЗаписьЭлектроннойПочтыПоУмолчанию.Пустая() И НЕ ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала() Тогда
		НаборКонстант.УчетнаяЗаписьЭлектроннойПочтыПоУмолчанию = ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантУчетнаяЗаписьЭлектроннойПочтыДляАвтоматическихРассылокПриИзменении(Элемент)
	
	Если НЕ НаборКонстант.УчетнаяЗаписьЭлектроннойПочтыДляАвтоматическихРассылок.Пустая() И НЕ ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала() Тогда
		НаборКонстант.УчетнаяЗаписьЭлектроннойПочтыДляАвтоматическихРассылок = ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка");
	КонецЕсли;
	
	ОбновитьЭлементыФормыНаСервере("ЭлектроннаяПочта");
	
	Если НаборКонстант.УчетнаяЗаписьЭлектроннойПочтыДляАвтоматическихРассылок.Пустая() Тогда
		НаборКонстант.ОтправлятьEMailКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен = Ложь;	
		НаборКонстант.ОтправлятьEmailЗамерщикуПриПланированииЗамера = Ложь;
		НаборКонстант.УведомленияНаЕмайлПоЗадачам = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОтправлятьEMailКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведенПриИзменении(Элемент)
	Если НаборКонстант.ОтправлятьEMailКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен Тогда
		НаборКонстант.ОтправлятьEMailКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОтправлятьEmailЗамерщикуПриПланированииЗамераПриИзменении(Элемент)
	Если НаборКонстант.ОтправлятьEmailЗамерщикуПриПланированииЗамера Тогда
		НаборКонстант.ОтправлятьEmailЗамерщикуПриПланированииЗамера = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантУведомленияНаЕмайлПоЗадачамПриИзменении(Элемент)
	Если НаборКонстант.УведомленияНаЕмайлПоЗадачам тогда
		НаборКонстант.УведомленияНаЕмайлПоЗадачам = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОтправлятьEmailПоКонтролюПравокЗаднимЧисломПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("ЭлектроннаяПочта");
КонецПроцедуры

//&НаКлиенте
//Процедура ОтправлятьДетализациюВзаиморасчетовПриИзменении(Элемент)
//	НаборКонстант.ОтправлятьДетализациюВзаиморасчетовПриВыполненииЗаказа = ОтправлятьДетализациюВзаиморасчетов;
//	НаборКонстант.ОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетов = ОтправлятьДетализациюВзаиморасчетов;
//	ОбновитьЭлементыФормыНаСервере("ЭлектроннаяПочта");	
//КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетовПриИзменении(Элемент)
	//ОтправлятьДетализациюВзаиморасчетов = НаборКонстант.ОтправлятьДетализациюВзаиморасчетовПриВыполненииЗаказа ИЛИ НаборКонстант.ОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетов; 
	ОбновитьЭлементыФормыНаСервере("ЭлектроннаяПочта");	
КонецПроцедуры

//&НаКлиенте
//Процедура НаборКонстантОтправлятьДетализациюВзаиморасчетовПриВыполненииЗаказаПриИзменении(Элемент)
//	ОтправлятьДетализациюВзаиморасчетов = НаборКонстант.ОтправлятьДетализациюВзаиморасчетовПриВыполненииЗаказа ИЛИ НаборКонстант.ОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетов;
//	ОбновитьЭлементыФормыНаСервере("ЭлектроннаяПочта");	
//КонецПроцедуры

&НаКлиенте
Процедура НастроитьРегламентноеЗаданиеОтправкиДетализацииВзаиморасчетов(Команда)
	
	Идентификатор = ПолучитьИдентификаторРегламентногоЗадания("ОтправкаПисемПоЗаданиям");
	Если НЕ Идентификатор = Неопределено Тогда
		ПараметрыОбработки = Новый Структура;
		ПараметрыОбработки.Вставить("Идентификатор", Идентификатор);
		ПараметрыОбработки.Вставить("Действие", "Изменить");
		ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание", ПараметрыОбработки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВариантДетализацииВзаиморасчетовПриИзменении(Элемент)
	
	УправлениеПолемИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки();
	
	Если ВариантДетализацииВзаиморасчетов = 1 Тогда 
		НаборКонстант.ИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки = ПредопределенноеЗначение("Справочник.ДополнительныеОтчетыИОбработки.ПустаяСсылка");
	Иначе
		НаборКонстант.ИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки = Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.СписокВыбора[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеПолемИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки()
	
	Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.СписокВыбора.Очистить();
	Если ВариантДетализацииВзаиморасчетов = 1 Тогда 
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДополнительныеОтчетыИОбработки");
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.КнопкаВыбора = Истина;
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.РежимВыбораИзСписка = Ложь;
	Иначе
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.КнопкаВыбора = Ложь;
		Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.РежимВыбораИзСписка = Истина;
		
		СхемаКомпоновкиДанныхДВК = Отчеты.ДетализацияВзаиморасчетовСКонтрагентом.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		Для каждого ВариантОтчета из СхемаКомпоновкиДанныхДВК.ВариантыНастроек Цикл
			//++ #14300
			Если ВариантОтчета.Имя = "9194_Детальный по документам" Тогда
				Продолжить;
			КонецЕсли;
			//-- #14300
			Элементы.НаборКонстантИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.СписокВыбора.Добавить(ВариантОтчета.Имя, ВариантОтчета.Представление);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОтчетДетализация(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьОтчетДетализацияПослеВыбораКонтрагента", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", , ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОтчетДетализацияПослеВыбораКонтрагента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТабличныйДокумент = ПроверитьОтчетДетализацияСервер(Результат);
	ТабличныйДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьОтчетДетализацияСервер(Контрагент)
	
	Возврат ОбщийМодульСервер.СформироватьИОтправитьОтчетДетализацииВзаиморасчетов(НаборКонстант.ИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки, 
																							   НаборКонстант.ПериодОтчетаДетализацииВзаиморасчетовДляОтправки, 
																							   Контрагент, Истина);		
КонецФункции

#КонецОбласти

#Область ОбработкаВкладкиОбновление

&НаКлиенте
Процедура ОбработатьДокументыПослеОбновления(Команда)
	
	Если ЕстьОбязательныеОбъектыКОбработкеПослеОбновления 
		И Элементы.СтраницыОбъектыКОбработкеПриОбновлении.ТекущаяСтраница = Элементы.СтраницаОбъектыКОбработкеПриОбновлении Тогда
		Оповещение = Новый ОписаниеОповещения("ПерейтиНаСтраницуОбязательныеОбъектыКОбработке", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, "Имеются обязательные объекты к обработке");
		Возврат;
	КонецЕсли;
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.Да, 		"Да");
	СписокКнопок.Добавить(КодВозвратаДиалога.Нет, 		"Нет, только выбранные");
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, 	"Отмена");
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбработкиДокументов", ЭтотОбъект);
	//ТекстСообщения = "Произвести обработку всех объектов? При выборе ""Нет"" будут обработаны только выделенные объекты";
	//ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНетОтмена, 0);
	ТекстСообщения = "Произвести обработку всех объектов?";
	ПоказатьВопрос(Оповещение, ТекстСообщения, СписокКнопок, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуОбязательныеОбъектыКОбработке(ДополнительныеПараметры) Экспорт
	Элементы.СтраницыОбъектыКОбработкеПриОбновлении.ТекущаяСтраница = Элементы.СтраницаОбязательныеОбъектыКОбработкеПриОбновлении;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбработкиДокументов(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Отмена Тогда
        Возврат;
	КонецЕсли;
	
	ИмяРеквизита = "СписокОбъектовКОбработке";
	ИмяРеквизитаОбъект = "Документ";
	ИмяРеквизитаДата = "ДокументДата";
	Если Элементы.СтраницыОбъектыКОбработкеПриОбновлении.ТекущаяСтраница = Элементы.СтраницаОбязательныеОбъектыКОбработкеПриОбновлении Тогда
		ИмяРеквизита = "СписокОбязательныхОбъектовКОбработке";
		ИмяРеквизитаОбъект = "ОбъектСсылка";
		ИмяРеквизитаДата = "ОбъектДата";
	КонецЕсли;	

	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ОбработкаОбязательныхОбъектов", ИмяРеквизита = "СписокОбязательныхОбъектовКОбработке");
	Если Результат = КодВозвратаДиалога.Нет Тогда
		//ТекущиеДанные = Элементы.СписокОбъектовКОбработке.ТекущиеДанные;
		Если Элементы[ИмяРеквизита].ВыделенныеСтроки.Количество() = 0 Тогда
			Сообщить("Не выбраны строки с объектами");
			Возврат;
		КонецЕсли;
		ВыборочныеОбъектыКОбработке = Новый Массив;
		Для каждого ВыделеннаяСтрока из Элементы[ИмяРеквизита].ВыделенныеСтроки Цикл
			ВыборочныеОбъектыКОбработке.Добавить(ПолучитьДанныеСтрокиРегистраОбъектовКОбработке(ВыделеннаяСтрока, ИмяРеквизитаОбъект, ИмяРеквизитаДата, ПараметрыОбработки.ОбработкаОбязательныхОбъектов)); 
			//Новый Структура("ВерсияПрограммы, ОбъектСсылка, ОбъектДата", ВыделеннаяСтрока.ВерсияПрограммы, ВыделеннаяСтрока[ИмяРеквизитаОбъект], ВыделеннаяСтрока[ИмяРеквизитаДата]));	
		КонецЦикла;		
	
		ПараметрыОбработки.Вставить("ВыборочнаяОбработка", Истина);
		ПараметрыОбработки.Вставить("ВыборочныеОбъектыКОбработке", ВыборочныеОбъектыКОбработке);
		//ПараметрыОбработки.Вставить("ВерсияПрограммы", ТекущиеДанные.ВерсияПрограммы);
		//ПараметрыОбработки.Вставить("Документ", ТекущиеДанные.Документ);
		//ПараметрыОбработки.Вставить("ДокументДата", ТекущиеДанные.ДокументДата);
	КонецЕсли;
	
	ОповещениеПослеОбработкиДокументов = Новый ОписаниеОповещения("ПослеОбработкиДокументов", ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.ОбработкаДокументовПослеОбновления", ПараметрыОбработки, ЭтаФорма, , , , ОповещениеПослеОбработкиДокументов);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСтрокиРегистраОбъектовКОбработке(КлючЗаписи, ИмяРеквизитаОбъект, ИмяРеквизитаДата, ОбязательнаяОбработка)

	Возврат Новый Структура("ВерсияПрограммы, ВерсияПрограммыЧисло, ОбъектСсылка, ОбъектДата, ОбязательнаяОбработка", КлючЗаписи.ВерсияПрограммы, КлючЗаписи.ВерсияПрограммыЧисло, КлючЗаписи[ИмяРеквизитаОбъект], КлючЗаписи[ИмяРеквизитаДата], ОбязательнаяОбработка);
	
КонецФункции

&НаКлиенте
Процедура ПослеОбработкиДокументов(Результат, Параметры) Экспорт
	
	ОбновитьВкладкуОбновление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДокументовКОбработке(Команда)
	
	ОбновитьВкладкуОбновление();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовКОбновлениюОбновлятьАвтоматическиПриИзменении(Элемент)
	
	Если СписокДокументовКОбновлениюИнтервалАвтоматическогоОбновления = 0 Тогда
		СписокДокументовКОбновлениюИнтервалАвтоматическогоОбновления = 1;
	КонецЕсли;
	
	Если СписокДокументовКОбновлениюОбновлятьАвтоматически И НЕ СписокДокументовКОбновлениюИнтервалАвтоматическогоОбновления = 0 Тогда
		ПодключитьОбработчикОжидания("АвтоматическиОбновитьСписокДокументовКОбработке", СписокДокументовКОбновлениюИнтервалАвтоматическогоОбновления);
	Иначе
		ОтключитьОбработчикОжидания("АвтоматическиОбновитьСписокДокументовКОбработке");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиОбновитьСписокДокументовКОбработке() Экспорт
	
	ОбновитьВкладкуОбновление();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовКОбновлениюИнтервалАвтоматическогоОбновленияПриИзменении(Элемент)
	
	Если СписокДокументовКОбновлениюИнтервалАвтоматическогоОбновления = 0 Тогда
		ОтключитьОбработчикОжидания("АвтоматическиОбновитьСписокДокументовКОбработке");
	Иначе
		ОтключитьОбработчикОжидания("АвтоматическиОбновитьСписокДокументовКОбработке");
		ПодключитьОбработчикОжидания("АвтоматическиОбновитьСписокДокументовКОбработке", СписокДокументовКОбновлениюИнтервалАвтоматическогоОбновления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВкладкуОбновление()
	
	ОбновитьЭлементыФормыНаСервере("Обновление");	
	Элементы.СписокОбъектовКОбработке.Обновить();
	Элементы.СписокОбязательныхОбъектовКОбработке.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторРегламентногоЗадания(НаименованиеЗадания)
	
	РегЗадание = РегламентныеЗадания.НайтиПредопределенное(НаименованиеЗадания);
	Если РегЗадание <> Неопределено Тогда
		Возврат РегЗадание.УникальныйИдентификатор;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРасписаниеРегламентногоЗадания(ИмяРегламентногоЗадания)
	
	Задание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(Метаданные.РегламентныеЗадания[ИмяРегламентногоЗадания]);
	Возврат Задание.Расписание;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьРасписаниеРегламентногоЗадания(ИмяРегламентногоЗадания, НовоеРасписание);
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Расписание", НовоеРасписание);
		
	Задание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(Метаданные.РегламентныеЗадания[ИмяРегламентногоЗадания]);
	РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, ПараметрыЗадания);

КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьБудетВыгруженоНоменклатурыВМобильныйКлиент()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(ССЫЛКА) КАК Количество
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ (&Номенклатура)
	|";
	Запрос.УстановитьПараметр("Номенклатура", МобильныйКлиентЗамерщикаДоступнаяНоменклатура.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура"));
	
	Количество = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Количество;
	КонецЕсли;
	
	РекомендуемоеКоличество = 1000;
	
	Элементы.ДекорацияБудетВыгруженоНоменклатуры.Заголовок = СтрШаблон("Будет выгружено %1 элементов номенклатуры. Рекомендуемое количество - не более %2 элементов.", Количество, РекомендуемоеКоличество);
	
	Элементы.ДекорацияБудетВыгруженоНоменклатуры.ЦветТекста = ?(Количество > РекомендуемоеКоличество, ЦветаСтиля.ЦветОсобогоТекста, ЦветаСтиля.ТекстИнформационнойНадписи);
	Элементы.ДекорацияБудетВыгруженоНоменклатуры.Шрифт = Новый Шрифт(,, ?(Количество > РекомендуемоеКоличество, Истина, Ложь));
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьСпискиПравилФормированияСМСПриПереводеЗаказаНаПроизводствоВСтатусПроизведен()
	
	СписокШалоновСМС = РаботаССМС.ПолучитьСписокПорядковФормированияТекстаСМСОПереводеЗаказаНаПроизводствоВСтатусПроизведен();
	
	Для НомерЭлемента = 0 По СписокШалоновСМС.Количество()-1 Цикл
		ТекЭлемент = СписокШалоновСМС.Получить(НомерЭлемента);
		Элементы.НомерШаблонаТекстаСМСКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиПравилФормированияНаименованийПотолкаПленкиФактуры()
	
	СписокПленка = ОбменСEasyCeiling.ПолучитьСписокПорядковФормированияНаименованийПленки();
	СписокПотолки = ОбменСEasyCeiling.ПолучитьСписокПорядковФормированияНаименованийПотолков();
	
	СписокПотолкиРозница = ОбщийМодуль.ПолучитьСписокПорядковФормированияНаименованийПотолковРозницы();
	СписокНомерТиповогоОтреза = ОбменСEasyCeiling.ПолучитьСписокПорядковФормированияНомераТиповогоОтреза();
	СписокФактура = ОбменСEasyCeiling.ПолучитьСписокПорядковФормированияНаименованийФактуры();
	
	СписокОтрезы = ОбменСEasyCeiling.ПолучитьСписокПорядковФормированияНаименованийОтреза(); // №12523
	
	Для НомерЭлемента = 0 По СписокПленка.Количество()-1 Цикл
		ТекЭлемент = СписокПленка.Получить(НомерЭлемента);
		Элементы.СписокПорядокФормированияНаименованияПленки.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
	Для НомерЭлемента = 0 По СписокПотолки.Количество()-1 Цикл
		ТекЭлемент = СписокПотолки.Получить(НомерЭлемента);
		Элементы.НаборКонстантПорядокФормированияНаименованияПотолка.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);

		// №12523 теперь свои порядки наименования Элементы.НаборКонстантПорядокФормированияНаименованияОтреза.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
		Элементы.НаборКонстантПорядокФормированияНаименованияТиповогоОтреза.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
		Элементы.НаборКонстантПорядокФормированияНаименованияОстатковПленки.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
	//++ №12523
	Для НомерЭлемента = 0 По СписокОтрезы.Количество()-1 Цикл
		
		ТекЭлемент = СписокОтрезы.Получить(НомерЭлемента);
		Элементы.НаборКонстантПорядокФормированияНаименованияОтреза.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
		
	КонецЦикла;
	//-- №12523
	
	Для НомерЭлемента = 0 По СписокПотолкиРозница.Количество()-1 Цикл
		ТекЭлемент = СписокПотолкиРозница.Получить(НомерЭлемента);
		Элементы.СписокПорядокФормированияНаименованияПотолкаРозницы.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
	Для НомерЭлемента = 0 По СписокНомерТиповогоОтреза.Количество()-1 Цикл
		ТекЭлемент = СписокНомерТиповогоОтреза.Получить(НомерЭлемента);
	//	Элементы.НаборКонстантПорядокФормированияНомераТиповогоОтреза.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
		Элементы.НаборКонстантПорядокФормированияНомераОстатковПленки.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
	Для НомерЭлемента = 0 По СписокФактура.Количество()-1 Цикл
		ТекЭлемент = СписокФактура.Получить(НомерЭлемента);
		Элементы.ПорядокФормированияНаименованияФактуры.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВариантовФормированияПФЗаказаПокупателя()	
	СписокВариантов = ОбщийМодульСервер.ПолучитьВариантыФормированияПФЗаказаПокупателя();
	Для НомерЭлемента = 0 По СписокВариантов.Количество()-1 Цикл
		ТекЭлемент = СписокВариантов.Получить(НомерЭлемента);
		Элементы.НаборКонстантВариантФормированияПФЗаказаПокупателя.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВариантовФормированияПФМатериалы()
	
	СписокВариантов = ОбщийМодульСервер.ПолучитьВариантыФормированияПФМатериалыРозница();
	Для каждого ЭлементСписка из СписокВариантов Цикл
		Элементы.НаборКонстантВариантФормированияПФМатериалыЗаказДоговора.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		Элементы.НаборКонстантВариантФормированияПФМатериалыМонтажа.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВариантовФормированияПФЗаказаПоставщику()	
	СписокВариантов = ОбщийМодульСервер.ПолучитьВариантыФормированияПФЗаказаПоставщику();
	Для НомерЭлемента = 0 По СписокВариантов.Количество()-1 Цикл
		ТекЭлемент = СписокВариантов.Получить(НомерЭлемента);
		Элементы.НаборКонстантВариантФормированияПФЗаказаПоставщику.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВариантовФормированияПФПеремещения()	
	СписокВариантов = ОбщийМодульСервер.ПолучитьВариантыФормированияПФПеремещения();
	Для НомерЭлемента = 0 По СписокВариантов.Количество()-1 Цикл
		ТекЭлемент = СписокВариантов.Получить(НомерЭлемента);
		Элементы.НаборКонстантВариантФормированияПФПеремещения.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВариантовФормированияПФСчетаНаОплату()	
	СписокВариантов = ОбщийМодульСервер.ПолучитьВариантыФормированияПФСчетаНаОплату();
	Для НомерЭлемента = 0 По СписокВариантов.Количество()-1 Цикл
		ТекЭлемент = СписокВариантов.Получить(НомерЭлемента);
		Элементы.НаборКонстантВариантФормированияПФСчетаНаОплату.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВариантовФормированияПФРТИУ()	
	СписокВариантов = ОбщийМодульСервер.ПолучитьВариантыФормированияПФРТИУ();
	Для НомерЭлемента = 0 По СписокВариантов.Количество()-1 Цикл
		ТекЭлемент = СписокВариантов.Получить(НомерЭлемента);
		Элементы.НаборКонстантВариантФормированияПФРТИУ.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВариантовПеремещенияТоваровИзЗаказДоговора()	
	СписокВариантов = ОбщийМодуль.ПолучитьВариантыПеремещенияТоваровИзЗаказДоговора();
	Для НомерЭлемента = 0 По СписокВариантов.Количество()-1 Цикл
		ТекЭлемент = СписокВариантов.Получить(НомерЭлемента);
		Элементы.НаборКонстантВариантПеремещенияТоваровИзЗаказДоговора.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВариантовТекстаНаГрафикеЗамеров()	
	СписокВариантов = ОбщийМодуль.ПолучитьСписокВариантовТекстаНаГрафикеЗамеров();
	Для НомерЭлемента = 0 По СписокВариантов.Количество()-1 Цикл
		ТекЭлемент = СписокВариантов.Получить(НомерЭлемента);
		Элементы.НаборКонстантВариантТекстаНаГрафикеЗамеров.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВариантовТекстаНаГрафикеМонтажей()	
	СписокВариантов = ОбщийМодуль.ПолучитьСписокВариантовТекстаНаГрафикеМонтажей();
	Для НомерЭлемента = 0 По СписокВариантов.Количество()-1 Цикл
		ТекЭлемент = СписокВариантов.Получить(НомерЭлемента);
		Элементы.НаборКонстантВариантТекстаНаГрафикеМонтажей.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	//
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НаборКонстантНастройкаИнтеркампаниДляВнутреннихЗаказов");
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НаборКонстант.ИспользоватьВнутренниеЗаказы");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Истина;
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НаборКонстант.НастройкаИнтеркампаниДляВнутреннихЗаказов");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СерийныеНомера");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СерийныеНомера.Текущая");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина));
	Элемент.Использование = Истина;
	
	// #11632
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаИзмененияДатыСледующегоКонтактаЛидаСдвиг.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкиИзмененияДатыСледующегоКонтактаЛида.ОчисткаДаты");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Очищается>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиИзмененияДатыСледующегоКонтактаЛида");
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкиИзмененияДатыСледующегоКонтактаЛида.ОчисткаДаты");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Истина;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Новый Шрифт(, , Истина));
	//Элемент.Использование = Истина;	

КонецПроцедуры

//&НаКлиенте
//Процедура ИспользоватьЗагрузкуИзИзиСилингПриИзменении(Элемент)
//	ОбновитьЭлементыФормы();
//КонецПроцедуры

&НаКлиенте
Процедура ПакетнаяЗагрузкаРасчетовИзИзиСилингПриИзменении(Элемент)
	Если НЕ НаборКонстант.ПакетнаяЗагрузкаРасчетовИзИзиСилинг Тогда
		НаборКонстант.КаталогиЗагрузкиИзПостроителяУказываютНаПапкиСервера = Ложь;
		НаборКонстант.ОбновлятьРеквизитыЗаказаПокупателяПриПовторнойПакетнойЗагрузкеИзПостроителя = Ложь;
	КонецЕсли;

	ОбновитьЭлементыФормыНаСервере("ЗагрузкаИзПостроителя");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантКаталогВыгрузокИзИзиСилингПриИзменении(Элемент)
	Если Не ПустаяСтрока(НаборКонстант.КаталогВыгрузокИзИзиСилинг) Тогда
		Если НЕ Прав(НаборКонстант.КаталогВыгрузокИзИзиСилинг,1) = "\" Тогда
			НаборКонстант.КаталогВыгрузокИзИзиСилинг = СокрЛП(НаборКонстант.КаталогВыгрузокИзИзиСилинг) + "\";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантКаталогДляРезеврныхКопийВыгрузокИзИзиСилингПриИзменении(Элемент)
	Если Не ПустаяСтрока(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг) Тогда
		Если НЕ Прав(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг,1) = "\" Тогда
			НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг = СокрЛП(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг) + "\";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВыбратьКаталогНаКлиенте(Каталог) 
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = Каталог; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	
	Если ДиалогОткрытия.Выбрать() Тогда 
		Возврат ?(Прав(ДиалогОткрытия.Каталог, 1) = "\", ДиалогОткрытия.Каталог, ДиалогОткрытия.Каталог+ "\"); 
	КонецЕсли;
	Возврат Каталог;	
КонецФункции

&НаКлиенте
Процедура НаборКонстантКаталогВыгрузокИзИзиСилингНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НаборКонстант.КаталогВыгрузокИзИзиСилинг = ВыбратьКаталогНаКлиенте(НаборКонстант.КаталогВыгрузокИзИзиСилинг);
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантКаталогДляРезеврныхКопийВыгрузокИзИзиСилингНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг = ВыбратьКаталогНаКлиенте(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг);
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПапкиОпределяютсяВКарточкеПользователяРозницаПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("ЗагрузкаИзПостроителя");	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПереноситьФайлыВАрхивПриЗагрузкеПотолкаИзПостроителяВРозницеПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("ЗагрузкаИзПостроителя");	
КонецПроцедуры

&НаКлиенте
Процедура ЧасовойПоясПрограммыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Если Элемент.СписокВыбора.Количество() < 2 Тогда
	//	ЗаполнитьЧасовыеПояса();
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЧасовыеПояса()
	
	//#13067
	//Элементы.ЧасовойПоясПрограммы.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопустимыеЧасовыеПояса());
	
	ТаблицаПоясов = НОвый таблицаЗначений;
	ТаблицаПоясов.Колонки.Добавить("ОписаниеЧасовогоПояса", Новый ОписаниеТипов("Строка")); 
	ТаблицаПоясов.Колонки.Добавить("Смещение", Новый ОписаниеТипов("Число"));
	ТаблицаПоясов.Колонки.Добавить("ПредставлениеЧасовогоПояса", Новый ОписаниеТипов("Строка"));
	Для Каждого ОписаниеЧасовогоПояса Из ПолучитьДопустимыеЧасовыеПояса() Цикл
		
		//Смещение = СмещениеСтандартногоВремени(ОписаниеЧасовогоПояса); // не работает
		Смещение = МестноеВремя(ТекущаяУниверсальнаяДата(), ОписаниеЧасовогоПояса) - ТекущаяУниверсальнаяДата();
		
		СмещениеДатой = Дата(1, 1, 1) + ?(Смещение >= 0, Смещение, -Смещение);		
		
		ПредставлениеСмещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("(UTC%1%2)",
		                                                                                ?(Смещение >= 0, "+", "-"),
																						Формат(СмещениеДатой, "ДФ=HH:mm; ДП=00:00;"));
		
		ПредставлениеЧасовогоПояса = ПредставлениеСмещения + " " + ОписаниеЧасовогоПояса;
		
		НоваяСтрока = ТаблицаПоясов.Добавить();
		НоваяСтрока.ОписаниеЧасовогоПояса = ОписаниеЧасовогоПояса;
		НоваяСтрока.Смещение = Смещение;
		НоваяСтрока.ПредставлениеЧасовогоПояса = ПредставлениеЧасовогоПояса;
		//Элементы.ЧасовойПоясПрограммы.СписокВыбора.Добавить(ОписаниеЧасовогоПояса, ПредставлениеЧасовогоПояса);
		
	КонецЦикла;
	
	ТаблицаПоясов.Сортировать("Смещение, ОписаниеЧасовогоПояса");
	Для каждого СтрокаТЗ из ТаблицаПоясов Цикл
		Элементы.ЧасовойПоясПрограммы.СписокВыбора.Добавить(СтрокаТЗ.ОписаниеЧасовогоПояса, СтрокаТЗ.ПредставлениеЧасовогоПояса);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаСервера()
	
	Возврат ТекущаяДата();
	
КонецФункции

&НаКлиенте
Процедура НаборКонстантИндивидуальныеКаталогиЗагрузкиЧертежейИзEasyCeilingПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("ЗагрузкаИзПостроителя");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПереноситьВАрхивРасчетыПостроителяПроизводствоПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("ЗагрузкаИзПостроителя");	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыФайловИзПрограммыПостроителя(Команда)
	ОткрытьФорму("Справочник.ВидыФайловПрограммыПостроителя.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйКлючПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура СписокПорядокФормированияНаименованияПленкиПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПереименоватьСуществующуюПленку(Результат, ДополнительныеПараметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Да Тогда
        УспешноПереименовали = ПереименоватьПленкуНаСервере();
		Если УспешноПереименовали Тогда
			ПоказатьОповещениеПользователя("Номенклатура пленки переименована");
			ТекущийПорядокФормированияНаименованияПленки = Объект.ПорядокФормированияНаименованияПленки;
			СохранитьНаСервере();
			ОбновитьИнтерфейс();
			Если ДополнительныеПараметры.ЗакрытьФормуНастроек Тогда
				ЭтаФорма.Закрыть();
			КонецЕсли;
		Иначе
			Объект.ПорядокФормированияНаименованияПленки = ТекущийПорядокФормированияНаименованияПленки;
			ПоказатьПредупреждение(,"Не удалось переименовать номенклатуру пленки. Настройки не сохранены.");
		КонецЕсли;
	Иначе
		Объект.ПорядокФормированияНаименованияПленки = ТекущийПорядокФормированияНаименованияПленки;
		ПоказатьПредупреждение(,"Новое правило формирования наименования пленки не применено");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПереименоватьПленкуНаСервере()
	
	Результат = Истина;
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Номенклатура");
	ТаблицаРезультата.Колонки.Добавить("СтароеНаименование");
	ТаблицаРезультата.Колонки.Добавить("Цвет");
	ТаблицаРезультата.Колонки.Добавить("Фактура");
	ТаблицаРезультата.Колонки.Добавить("ШиринаПолотна");
	ТаблицаРезультата.Колонки.Добавить("НовоеНаименование");
	ТаблицаРезультата.Колонки.Добавить("КоличествоНоменклатурСНовымНаименованием");
	ТаблицаРезультата.Колонки.Добавить("Переименован", Новый ОписаниеТипов("булево"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦветФактуры.Ссылка,
	|	ЦветФактуры.Владелец КАК Фактура,
	|	ЦветФактуры.Владелец.ШиринаПолотна КАК ШиринаПолотна,
	|	ЦветФактуры.Номенклатура.Ссылка КАК Номенклатура,
	|	ЦветФактуры.Владелец.Материал КАК Материал,
	|	ЦветФактуры.Наименование КАК Цвет
	|ИЗ
	|	Справочник.ЦветФактуры КАК ЦветФактуры
	|ГДЕ
	|	ЦветФактуры.Номенклатура <> &ПустаяНоменклатура";
	Запрос.УстановитьПараметр("ПустаяНоменклатура",Справочники.Номенклатура.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.СтароеНаименование = Выборка.Номенклатура.Наименование;
		НоваяСтрока.НовоеНаименование = ОбменСEasyCeiling.ПолучитьНаименованиеПленки(Выборка.Цвет, Выборка.Фактура.Материал, Выборка.ШиринаПолотна, Объект.ПорядокФормированияНаименованияПленки);
		НоваяСтрока.КоличествоНоменклатурСНовымНаименованием = 1;
		
	КонецЦикла;
	
	ТаблицаДляПроверки = ТаблицаРезультата.Скопировать();
	ТаблицаДляПроверки.Свернуть("НовоеНаименование","КоличествоНоменклатурСНовымНаименованием");
	Для Каждого СтрокаПроверки Из ТаблицаДляПроверки Цикл
		Если СтрокаПроверки.КоличествоНоменклатурСНовымНаименованием > 1 Тогда
			Результат = Ложь;
			Сообщить("После смены правила наименования, в справочнике номенклатуры будет " + СтрокаПроверки.КоличествоНоменклатурСНовымНаименованием + " элементов с наименованием: " + СтрокаПроверки.НовоеНаименование);
		КонецЕсли;
	КонецЦикла;
	
	ЕстьОшибкиЗаписиНоменклатуры = Ложь;
	Если Результат Тогда
		Для Каждого ТекущаяСтока Из ТаблицаРезультата Цикл
			Попытка
				НоменклатураОбъект = ТекущаяСтока.Номенклатура.ПолучитьОбъект();
				НоменклатураОбъект.Наименование = ТекущаяСтока.НовоеНаименование;
				НоменклатураОбъект.Записать();
				ТекущаяСтока.Переименован = Истина;
			Исключение
				Результат = Ложь;
				ЕстьОшибкиЗаписиНоменклатуры = Истина;
				Сообщить("Не удалось записать номенклатуру " + ТекущаяСтока.Номенклатура + ". Ошибка: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Иначе
		Сообщить("Переименование номенклатуры пленки отменено");
	КонецЕсли;
	
	Если ЕстьОшибкиЗаписиНоменклатуры Тогда
		//откатываем изменения
		Для Каждого ТекущаяСтока Из ТаблицаРезультата Цикл
			Если ТекущаяСтока.Переименован Тогда
				НоменклатураОбъект = ТекущаяСтока.Номенклатура.ПолучитьОбъект();
				НоменклатураОбъект.Наименование = ТекущаяСтока.СтароеНаименование;
				НоменклатураОбъект.Записать();
				ТекущаяСтока.Переименован = Ложь;
			КонецЕсли;
		КонецЦикла;
		Сообщить("При выполнении операции переименования номенклатуры произошла ошибка. Переименование отменено, номенклатурам возвращено старое наименование");
	КонецЕсли;
	
	Возврат Результат
	
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаПереименоватьСуществующуюФактуру(Результат, ДополнительныеПараметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Да Тогда
        УспешноПереименовали = ПереименоватьФактуруНаСервере();
		Если УспешноПереименовали Тогда
			ПоказатьОповещениеПользователя("Фактуры переименованы");
			ТекущийПорядокФормированияНаименованияФактуры = Объект.ПорядокФормированияНаименованияФактуры;
			ОбновитьИнтерфейс();
			СохранитьНаСервере();
			Если ДополнительныеПараметры.ЗакрытьФормуНастроек Тогда
				ЭтаФорма.Закрыть();
			КонецЕсли;
		Иначе
			Объект.ПорядокФормированияНаименованияФактуры = ТекущийПорядокФормированияНаименованияФактуры;
			ПоказатьПредупреждение(,"Не удалось переименовать фактуру. Настройки не сохранены.");
		КонецЕсли;
	Иначе
		Объект.ПорядокФормированияНаименованияФактуры = ТекущийПорядокФормированияНаименованияФактуры;
		ПоказатьПредупреждение(,"Новое правило формирования наименования фактуры не применено");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПереименоватьФактуруНаСервере()
	
	Результат = Истина;
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Фактура");
	ТаблицаРезультата.Колонки.Добавить("СтароеНаименование");
	ТаблицаРезультата.Колонки.Добавить("Материал");
	ТаблицаРезультата.Колонки.Добавить("ШиринаПолотна");
	ТаблицаРезультата.Колонки.Добавить("НовоеНаименование");
	ТаблицаРезультата.Колонки.Добавить("Переименован", Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка
	|ИЗ
	|	Справочник.Фактура КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ЭтоГруппа
	|	И ((ВЫРАЗИТЬ(ДанныеСправочника.Материал КАК СТРОКА(100))) = """"
	|			ИЛИ ДанныеСправочника.ШиринаПолотна = 0)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить("Для фактуры " + Выборка.Ссылка + " не указан материал или ширина!");
		Результат = Ложь;
	КонецЦикла;
	Если НЕ Результат Тогда
		Сообщить("Переименование отменено!");
		Возврат Результат;
	КонецЕсли;
		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Фактура,
	|	ДанныеСправочника.Материал КАК Материал,
	|	ДанныеСправочника.ШиринаПолотна КАК ШиринаПолотна,
	|	ДанныеСправочника.Наименование КАК СтароеНаименование
	|ИЗ
	|	Справочник.Фактура КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.НовоеНаименование = ОбменСEasyCeiling.ПолучитьНаименованиеФактуры(Выборка.Материал, Выборка.ШиринаПолотна, Объект.ПорядокФормированияНаименованияФактуры);

	КонецЦикла;
		
	ЕстьОшибкиЗаписи = Ложь;
	Если Результат Тогда
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			Попытка
				СпрОбъект = ТекущаяСтрока.Фактура.ПолучитьОбъект();
				СпрОбъект.Наименование = ТекущаяСтрока.НовоеНаименование;
				СпрОбъект.Записать();
				ТекущаяСтрока.Переименован = Истина;
			Исключение
				Результат = Ложь;
				ЕстьОшибкиЗаписи = Истина;
				Сообщить("Не удалось записать фактуру " + ТекущаяСтрока.Фактура + ". Ошибка: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Иначе
		Сообщить("Переименование фактуры отменено");
	КонецЕсли;
	
	Если ЕстьОшибкиЗаписи Тогда
		//откатываем изменения
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			Если ТекущаяСтрока.Переименован Тогда
				СпрОбъект = СпрОбъект.Фактура.ПолучитьОбъект();
				СпрОбъект.Наименование = СпрОбъект.СтароеНаименование;
				СпрОбъект.Записать();
				ТекущаяСтрока.Переименован = Ложь;
			КонецЕсли;
		КонецЦикла;
		Сообщить("При переименовании фактур произошла ошибка. Переименование отменено, фактурам возвращено старое наименование");
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

//&НаСервере
//Процедура ВыполнитьОбменССайтомНаСервере()
//	ОбработкаОбмена = Обработки.ОбменССайтомCML.Создать();
//	ОбработкаОбмена.ВыполнитьОбменССайтом();
//КонецПроцедуры

//&НаКлиенте
//Процедура ВыполнитьОбменССайтом(Команда)
//	Если НЕ Модифицированность Тогда
//		ВыполнитьОбменССайтомНаСервере();
//	Иначе
//		ПоказатьПредупреждение(,"Предварительно необходимо сохранить настройки");
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбменССайтомCMLНастройкаОбменаПриИзменении(Элемент)
//	Модифицированность = Истина;
//КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРойстат(Команда)
	ЗапуститьПриложение("https://cloud.roistat.com/");
КонецПроцедуры
	
&НаКлиенте
Процедура ВКонтакте_ПолучитьТокен(Команда)	
	
	Если НЕ ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала() тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыАвторизации = Новый Структура("IDПриложения,ПраваДоступа", Объект.ВКонтакте_app_id, Объект.ВКонтакте_ПраваДоступа);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.Форма_ВКонтакте_Авторизация", ПараметрыАвторизации, ЭтаФорма, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукцииПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОднаОрганизацияПроизводстваИПродажиПотолковПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантКаталогВыгрузокИзИзиСилингРозницаПриИзменении(Элемент)
	Если Не ПустаяСтрока(НаборКонстант.КаталогВыгрузокИзИзиСилингРозница) Тогда
		Если НЕ Прав(НаборКонстант.КаталогВыгрузокИзИзиСилингРозница,1) = "\" Тогда
			НаборКонстант.КаталогВыгрузокИзИзиСилингРозница = СокрЛП(НаборКонстант.КаталогВыгрузокИзИзиСилингРозница) + "\";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантКаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозницаПриИзменении(Элемент)
	Если Не ПустаяСтрока(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница) Тогда
		Если НЕ Прав(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница,1) = "\" Тогда
			НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница = СокрЛП(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница) + "\";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантКаталогВыгрузокИзИзиСилингРозницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НаборКонстант.КаталогВыгрузокИзИзиСилингРозница = ВыбратьКаталогНаКлиенте(НаборКонстант.КаталогВыгрузокИзИзиСилингРозница);
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантКаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница = ВыбратьКаталогНаКлиенте(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница);
КонецПроцедуры

//&НаКлиенте
//Процедура ИспользоватьМаскуВводаТелефонаПриИзменении(Элемент)
//	ОбновитьЭлементыФормы();
//КонецПроцедуры

//&НаКлиенте
//Процедура ВключитьМинимальнаяСтоимостьМонтажаСдельнаяПриИзменении(Элемент)
//	Если Объект.ВключитьМинимальнаяСтоимостьМонтажаСдельная Тогда 
//		Элементы.МинимальнаяСтоимостьМонтажаСдельная.Видимость = Истина;
//	Иначе	
//		Элементы.МинимальнаяСтоимостьМонтажаСдельная.Видимость = Ложь;
//	КонецЕсли;	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПрефиксНомераТелефонаУЛидаПриИзменении(Элемент)
//	УбратьНедопустимыеСимволыВПрефиксеТелефона();
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриводитьНомераТелефоновУЛидовКЕдиномуПрефиксуПриИзменении(Элемент)
//	ОбновитьЭлементыФормы();
//КонецПроцедуры

&НаКлиенте
Процедура СоздаватьНовыйЛидЕслиПоТекущемуЛидуУжеЕстьДоговорПриИзменении(Элемент)
	//#4450 Объект.СоздаватьНовыйЛидЕслиПоТекущемуЛидуУжеЕстьДоговорВСтатусеВыполнен = НЕ Объект.СоздаватьНовыйЛидЕслиПоТекущемуЛидуУжеЕстьДоговор;
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьНовыйЛидЕслиПоТекущемуЛидуУжеЕстьДоговорВСтатусеВыполненПриИзменении(Элемент)
	// Закомментировано по №6627
	//Если Объект.СоздаватьНовыйЛидЕслиПоТекущемуЛидуУжеЕстьДоговорВСтатусеВыполнен тогда
	//	Объект.СоздаватьНовыйЛидЕслиПоТекущемуЛидуУжеЕстьДоговорВСтатусеВыполнен = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРеквизитовИСвойств(Команда)
	ОткрытьФорму("Справочник.НаборыДополнительныхРеквизитовИСведений.Форма.ФормаСписка");
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуПотолки(ИмяНастройки, ПоОбъекту = Истина)
	 
	Константы[ИмяНастройки].Установить(?(ПоОбъекту, Объект[ИмяНастройки], ЭтаФорма[ИмяНастройки]));
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкуПотолки(ИмяНастройки, ПоОбъекту = Истина)
	
	Если ПоОбъекту Тогда
		Объект[ИмяНастройки] = Константы[ИмяНастройки].Получить();
	Иначе
		ЭтаФорма[ИмяНастройки] = Константы[ИмяНастройки].Получить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОбменСПорталомПриИзменении(Элемент)
	Если Объект.ИспользоватьОбменСПорталом тогда
		Объект.ИспользоватьОбменСПорталом = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУзлыОбмена(Команда)
	ОткрытьФорму("ПланОбмена.Портал.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьАвтоматическуюНумерациюСерийНоменклатурыПриИзменении(Элемент)
	Если НаборКонстант.ИспользоватьАвтоматическуюНумерациюСерийНоменклатуры и ПустаяСтрока(НаборКонстант.ШаблонНаименованияСерииНоменклатуры) Тогда
		НаборКонстант.ШаблонНаименованияСерииНоменклатуры = "[НомерПоПорядку]";
	КонецЕсли;
	//ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗапретПроведенияДокументовБудущимЧисломПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьСМСОДолгеКонтрагентамПриИзменении(Элемент)
	Модифицированность = Истина;
	ОбновитьЭлементыФормы();	
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьСМСОЗапланированномМонтажеПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

//Начало исключен при переходе на 2.0
//&НаКлиенте
//Процедура ИспользоватьСтатусПодтвержденПодсказка(Команда)
//	ПоказатьПредупреждение(,"Если используется статус ""Подтвержден"", то:
//|1. Заказ на производство в статусе ""Новый"" считается ""черновиком"". Будет доступен дополнительный статус заказа на производство ""Подтвержден"".
//|2. Будет запрещена отгрузка на основании заказа на производство в статусе ""Новый"".
//|3. В АРМ Производства будет отображаться вкладка ""Подтвержденные"" со всеми заказами на производство в данном статусе.
//|4. В АРМ Производства на вкладке ""К отгрузке"" заказы на производство с видом ""Перезаказ"" и ""Комплектующие"" будут отображаться только в статусе ""Подтвержден""
//|5. В отчете ""Детализация взаиморасчетов с контрагентом (производство)"" заказ на производство будет отображаться в таблице ""Ожидаемые расчеты"" только в статусе ""Подтвержден"", наряду со статусами ""В производстве"" и ""Произведен"", а не в статусе ""Новый"".");


//КонецПроцедуры
//Конец исключен при переходе на 2.0

&НаКлиенте
Процедура АвтоматическиСоздаватьДокументыПеремещенияНаОснованииМонтажаПриИзменении(Элемент)
	
	Если НЕ НаборКонстант.АвтоматическиСоздаватьДокументыПеремещенияНаОснованииМонтажа Тогда
		НаборКонстант.ОсуществлятьПеремещениеПоМонтажамСВидомВыдача = Ложь;
		НаборКонстант.ОсуществлятьПеремещениеПоМонтажамСВидомВозврат = Ложь;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Монтажи");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентноеЗаданиеСМСПоДолгамПриИзменении(Элемент)
	ИспользоватьРегламентноеЗаданиеСМСПоДолгамПриИзмененииНаСервере();
	
	Если ИспользоватьРегламентноеЗаданиеСМСПоДолгам Тогда
		ВыполнитьНастройкуРасписанияОбмена();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьРегламентноеЗаданиеСМСПоДолгамПриИзмененииНаСервере()
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное("УведомлениеКонтрагентаОДолгеПоСМС");
	РегламентноеЗадание.Использование = ИспользоватьРегламентноеЗаданиеСМСПоДолгам;
	
	Попытка
		РегламентноеЗадание.Записать();
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеРегЗаданияСМСПоДолгам(Команда)
	
	ВыполнитьНастройкуРасписанияОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписанияОбмена()
	
	Если РасписаниеРегламентногоЗаданияСМСПоДолгам = Неопределено Тогда
		РасписаниеРегламентногоЗаданияСМСПоДолгам = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьРасписаниеСМСПоДогам", ЭтотОбъект);
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗаданияСМСПоДолгам);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасписаниеСМСПоДогам(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("РасписаниеРегламентногоЗадания") Тогда
		РасписаниеРегламентногоЗаданияСМСПоДолгам = Результат;
		
		ИспользоватьРегламентноеЗаданиеСМСПоДолгам = Истина;
		УстановитьРасписаниеРегламентногоЗаданияСмсПоДолгам(РасписаниеРегламентногоЗаданияСМСПоДолгам);
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРасписаниеРегламентногоЗаданияСмсПоДолгам(РасписаниеРегламентногоЗаданияСМСПоДолгам)
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное("УведомлениеКонтрагентаОДолгеПоСМС");
	РегламентноеЗадание.Расписание = РасписаниеРегламентногоЗаданияСМСПоДолгам;
	
	Попытка
		РегламентноеЗадание.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИспользованиеРегламентногоЗаданияСмсПоДолгам()
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное("УведомлениеКонтрагентаОДолгеПоСМС");
	
	ИспользоватьРегламентноеЗаданиеСМСПоДолгам = РегламентноеЗадание.Использование;
	Если ИспользоватьРегламентноеЗаданиеСМСПоДолгам Тогда
		
		РасписаниеРегламентногоЗаданияСМСПоДолгам = РегламентноеЗадание.Расписание;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантКоличествоТоваровКСписаниюВМонтажеНеСоответствуетКоличествуПроданногоТовараПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("Розница");
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьЛицензию(Команда)
	
	ТекущиеДанные = Элементы.СерийныеНомера.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеДобавленияПродленияЛицензии", ЭтотОбъект);
		ПараметрыФормыКлюча = Новый Структура;
		ПараметрыФормыКлюча.Вставить("Продление", Истина);
		ПараметрыФормыКлюча.Вставить("РегистрационныйНомер", ТекущиеДанные.РегистрационныйНомер);
		ОткрытьФорму("ОбщаяФорма.ЗапросСерийногоКлюча", ПараметрыФормыКлюча, ЭтаФорма, , , ,Оповещение);
	Иначе
		ПоказатьОповещениеПользователя("Не выбран рег.номер");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЛицензию(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеДобавленияПродленияЛицензии", ЭтотОбъект);
	ПараметрыФормыКлюча = Новый Структура;
	ПараметрыФормыКлюча.Вставить("Добавление", Истина);
	ОткрытьФорму("ОбщаяФорма.ЗапросСерийногоКлюча", ПараметрыФормыКлюча, ЭтаФорма, ,,,Оповещение);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияПродленияЛицензии(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьЭлементыФормы(); // для обновления надписи
	ПолучитьИВывестиДополнительныеСведенияПоЛицензии();
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантМобильныйКлиентМонтажникаПоказыватьМонтажиВРаботеПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантМобильныйКлиентМонтажникаПоказыватьВыполненныеМонтажиПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьВыдачуВозвратВДокументеМонтажПриИзменении(Элемент)
	Если НЕ НаборКонстант.ИспользоватьВыдачуВозвратВДокументеМонтаж Тогда
		НаборКонстант.АвтоматическиСоздаватьДокументыПеремещенияНаОснованииМонтажа = Ложь;
		НаборКонстант.ОсуществлятьПеремещениеПоМонтажамСВидомВыдача = Ложь;
		НаборКонстант.ОсуществлятьПеремещениеПоМонтажамСВидомВозврат = Ложь;
		НаборКонстант.ИспользоватьИсключенияИзКонтроляВыдачиВозвратаПоМонтажам = Ложь;
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("Монтажи");
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПотолкиОнлайнПриИзменении(Элемент)
	Если ИспользоватьПотолкиОнлайн тогда
		ИспользоватьПотолкиОнлайн = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КлючAPIЯндексКартыПриИзменении(Элемент)
	Если НЕ ПустаяСтрока(НаборКонстант.КлючAPIЯндексКарты) тогда
		Если НЕ ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала() Тогда
			НаборКонстант.КлючAPIЯндексКарты = "";
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбменСРойстатПриИзменении(Элемент)
	Если Объект.ОбменСРойстат тогда
		Объект.ОбменСРойстат = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаПоказыватьЗамерыВРаботеПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаПоказыватьЗакрытыеЗамерыПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИнтернетПлатежиПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьИнтернетПлатежи Тогда
		НаборКонстант.ИспользоватьИнтернетПлатежи = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайлыВКаталоге(Путь)
	
	КоличествоФайлов = 0;
	
	Попытка
		Если НЕ ПустаяСтрока(Путь) Тогда
			МассивНайденныхФайлов = НайтиФайлы(Путь,"*", Ложь);
			Для Каждого Файл Из МассивНайденныхФайлов Цикл
				Если НЕ Файл.ЭтоКаталог() Тогда
					УдалитьФайлы(Путь,Файл.Имя);
					КоличествоФайлов = КоличествоФайлов + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ПоказатьПредупреждение(,"Удалено файлов: " + КоличествоФайлов);
	Исключение
		ПоказатьПредупреждение(,"Ошибка удаления файлов: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьФайлыВКаталогеНаСервере(Путь)
	
	КоличествоФайлов = 0;
	
	Попытка
		Если НЕ ПустаяСтрока(Путь) Тогда
			МассивНайденныхФайлов = НайтиФайлы(Путь,"*", Ложь);
			Для Каждого Файл Из МассивНайденныхФайлов Цикл
				Если НЕ Файл.ЭтоКаталог() Тогда
					УдалитьФайлы(Путь,Файл.Имя);
					КоличествоФайлов = КоличествоФайлов + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Сообщить("Удалено файлов: " + КоличествоФайлов);
	Исключение
		Сообщить("Ошибка удаления файлов: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУдаленииФайловВКаталоге(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Параметры.НаСервере Тогда
			УдалитьФайлыВКаталогеНаСервере(Параметры.Путь);
		Иначе
        	УдалитьФайлыВКаталоге(Параметры.Путь);
		КонецЕсли;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьПодтверждениеУдаленияФайловВКаталоге(Путь, НаСервере)
	
	Парам = Новый Структура;
	Парам.Вставить("Путь", Путь);
	Парам.Вставить("НаСервере", НаСервере);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУдаленииФайловВКаталоге", ЭтаФорма, Парам);
	ПоказатьВопрос(Оповещение, "Удалить все файлы в папке " 
	+ Символы.ПС
	+ Символы.ПС
	+ Путь + " ?"
	+ Символы.ПС
	+ Символы.ПС + "ВНИМАНИЕ! Файлы будут удалены безвозвратно!", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогРезервныхКопийРозница(Команда)
	
	ЗапроситьПодтверждениеУдаленияФайловВКаталоге(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогВыгрузкиИзПостроителяРозница(Команда)
	
	ЗапроситьПодтверждениеУдаленияФайловВКаталоге(НаборКонстант.КаталогВыгрузокИзИзиСилингРозница, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогРезервныхКопийПроизводство(Команда)
	
	ЗапроситьПодтверждениеУдаленияФайловВКаталоге(НаборКонстант.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг, НаборКонстант.КаталогиЗагрузкиИзПостроителяУказываютНаПапкиСервера);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогВыгрузкиИзПостроителяПроизводство(Команда)
	
	ЗапроситьПодтверждениеУдаленияФайловВКаталоге(НаборКонстант.КаталогВыгрузокИзИзиСилинг, НаборКонстант.КаталогиЗагрузкиИзПостроителяУказываютНаПапкиСервера);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользуетсяИнтеграцияСРойстатПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользуетсяИнтеграцияСРойстат Тогда
		НаборКонстант.ИспользуетсяИнтеграцияСРойстат = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуРегистрацииИнформационнойБазы(Команда)
	ОП = Новый ОписаниеОповещения("ОбновитьЭлементыФормыПослеЗакрытияДиалога",ЭтаФорма);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.ФормаРегистрацииИнформационнойБазы",,,,,,ОП,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормыПослеЗакрытияДиалога(Парам1, Парам2) Экспорт
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкаОбменаССайтамиНажатие(Элемент)
	ОткрытьФорму("ПланОбмена.ОбменССайтом.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьОбменСБитрикс24ПриИзменении(Элемент)
	
	Если НаборКонстант.ИспользоватьОбменСБитрикс24 Тогда
		НаборКонстант.ИспользоватьОбменСБитрикс24 = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	КонецЕсли;
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРегламентноеЗаданиеПолученияВебхукРойстатПоЗвонкам(Команда)
	Идентификатор = ПолучитьИдентификаторРегламентногоЗадания("ПолучениеИОбработкаВебхуковРойстатПоЗвонкам");
	Если НЕ Идентификатор = Неопределено Тогда
		Парам = Новый Структура;
		Парам.Вставить("Идентификатор", Идентификатор);
		Парам.Вставить("Действие","Изменить");
		ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание", Парам);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПолучатьВебхукиРойстатПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокСерийныхНомеров()
	
	СерийныеНомера.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерийныеНомера.РегистрационныйНомер КАК РегистрационныйНомер,
	|	СерийныеНомера.PINКод КАК PINКод
	|ИЗ
	|	РегистрСведений.СерийныеНомера КАК СерийныеНомера";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СерийныеНомера.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	ОбщийМодуль.ОпределитьТекущийРегистрационныйНомерВТаблице(СерийныеНомера);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВыполнятьАрхивациюПрикрепленныхДанныхПриИзменении(Элемент)
	
	ОбновитьЭлементыФормыНаСервере("Основные");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВариантАрхивацииПрикрепленныхДанныхПриИзменении(Элемент)
	
	ОбновитьЭлементыФормыНаСервере("Основные");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПутьАрхивацииПрикрепленныхДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите путь к папке архивации";
	
	ДиалогОткрытияФайла.Показать(новый ОписаниеОповещения("ПослеВыбораПутиАрхивации", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПутиАрхивации(ВыбранныеФайлы, Параметры) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0  Тогда
		НаборКонстант.ПутьАрхивацииПрикрепленныхДанных = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиGoogle(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкиПараметровGoogleAPI");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРегламентноеЗаданиеАрхивацияПрикрепленныхДанных(Команда)
	
	Идентификатор = ПолучитьИдентификаторРегламентногоЗадания("АрхивацияПрикрепленныхДанных");
	Если НЕ Идентификатор = Неопределено Тогда
		Парам = Новый Структура;
		Парам.Вставить("Идентификатор", Идентификатор);
		Парам.Вставить("Действие", "Изменить");
		ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание", Парам);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиБитрикс24(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, "Предварительно необходимо сохранить настройки.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", ПредопределенноеЗначение("Справочник.НастройкиСинхронизацииСБитрикс24.Основная"));
	ОткрытьФорму("Справочник.НастройкиСинхронизацииСБитрикс24.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиЯндекс(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкиПараметровЯндексAPI");
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИВывестиДополнительныеСведенияПоЛицензии()
	
	ЕстьДанные = Ложь;
	ТипЛицензии = "";
	КоличествоПользователей = "";
	СрокДействия = Дата(1,1,1);
	
	СоответствиеЛицензия = ОбщийМодуль.ПолучитьДополнительныеСведенияПоЛицензии();
	Если НЕ СоответствиеЛицензия = Неопределено Тогда
		Попытка
			КоличествоПользователей = СоответствиеЛицензия.Получить("count");
			СрокДействия = СоответствиеЛицензия.Получить("expdate");
			ТипЛицензии = СоответствиеЛицензия.Получить("type");
			ЕстьДанные = Истина;
		Исключение
			Элементы.ДекорацияНадписьЛицензия.Видимость = Ложь;
			Возврат;
		КонецПопытки;
		
		Если ЕстьДанные Тогда
			Элементы.ДекорацияНадписьЛицензия.Заголовок = "
			|Дополнительные сведения о лицензии
			|Тип лицензии: "+ ТипЛицензии + "
			|Количество пользователей: " + КоличествоПользователей + "
			|Срок действия: " + Формат(СрокДействия,"ДЛФ=D") + " (включительно)
			|";
			Элементы.ДекорацияНадписьЛицензия.Видимость = Истина;
			Если НачалоДня(СрокДействия) >= ТекущаяДатаСеанса() Тогда
				Элементы.ДекорацияНадписьЛицензия.ЦветТекста = WebЦвета.Зеленый;
			Иначе
				Элементы.ДекорацияНадписьЛицензия.ЦветТекста = WebЦвета.Красный;
			КонецЕсли;
		Иначе
			Элементы.ДекорацияНадписьЛицензия.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ДекорацияНадписьЛицензия.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаЛицензия Тогда
		ПолучитьИВывестиДополнительныеСведенияПоЛицензии();
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаРасширенныеСервисы Тогда
		ОбновитьНадписьБудетВыгруженоНоменклатурыВМобильныйКлиент(); // №14535
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАрхивацию(Команда)
	
	ВыполнитьАрхивациюНаСервере();
	
	ПоказатьОповещениеПользователя("Архивация выполнена.");
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьАрхивациюНаСервере()
	
	ОбщийМодульСервер.АрхивацияПрикрепленныхДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуФормированияСчетаНаПродлениеЛицензии(Команда)
	
	ПараметрыНовойФормы = Новый Структура;
	Для Каждого ТекущаяСтрока Из СерийныеНомера Цикл
		Если ТекущаяСтрока.Текущая Тогда
			ПараметрыНовойФормы.Вставить("ЛицензионныйКлюч", ТекущаяСтрока.PINКод);
		КонецЕсли;
	КонецЦикла;
	
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.ФормаФормированияСчетаНаПродлениеЛицензии",ПараметрыНовойФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

//++ №11431
&НаСервере
Процедура ЗаполнитьСписокВариантовСкладаРезервированияПоУмолчанию()	
	
	Элементы.НаборКонстантВариантСкладаРезервированияТоваровПоУмолчанию.СписокВыбора.Добавить(0, "Склад розницы по умолчанию");
	Элементы.НаборКонстантВариантСкладаРезервированияТоваровПоУмолчанию.СписокВыбора.Добавить(1, "Склад списания");
	
	Элементы.НаборКонстантВариантСкладаРезервированияМатериаловПоУмолчанию.СписокВыбора.Добавить(0, "Склад розницы по умолчанию");
	Элементы.НаборКонстантВариантСкладаРезервированияМатериаловПоУмолчанию.СписокВыбора.Добавить(1, "Склад списания");
	
КонецПроцедуры
//-- №11431

&НаКлиенте
Процедура УстановитьНовыйАдресОтправкиВебхук(Команда)
	
	//Если НЕ РаботаСВатсап.СервисДоступен() Тогда
	//	ПоказатьПредупреждение(,"Сервис интеграции с WHATSAPP не подключен. Подключите сервис в личном кабинете SmartCeilings");
	//	Возврат;
	//КонецЕсли;
	//
	//Результат = РаботаСВатсап.УстановитьАдресОтправкиВебхук();
	//НаборКонстант.АдресВебхуковВатсап = РаботаСВатсап.ПолучитьАдресОтправкиВебхук();
	//ПоказатьПредупреждение(,Результат);
	//Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАдресОтправкиВебхук(Команда)
	
	//Если НЕ РаботаСВатсап.СервисДоступен() Тогда
	//	ПоказатьПредупреждение(,"Сервис интеграции с WHATSAPP не подключен. Подключите сервис в личном кабинете SmartCeilings");
	//	Возврат;
	//КонецЕсли;
	//
	//НаборКонстант.АдресВебхуковВатсап = РаботаСВатсап.ПолучитьАдресОтправкиВебхук();
	//Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокКаналовWAZZUP(Команда)
	
	//Если НЕ РаботаСВатсап.СервисДоступен() Тогда
	//	ПоказатьПредупреждение(,"Сервис интеграции с WHATSAPP не подключен. Подключите сервис в личном кабинете SmartCeilings");
	//	Возврат;
	//КонецЕсли;
	//
	//МассивОтвета = РаботаСВатсап.ПолучитьСписокКаналов();
	//
	//КаналыWazzup.Очистить();
	//Для НомерЗаписи = 0 По МассивОтвета.Количество()-1 Цикл
	//	НоваяСтрока = КаналыWazzup.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивОтвета[НомерЗаписи]);
	//КонецЦикла;
	//
	//Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьИнтеграциюВатсапПриИзменении(Элемент)
	//Если НаборКонстант.ИспользоватьИнтеграциюВатсап Тогда
	//	НаборКонстант.ИспользоватьИнтеграциюВатсап = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала() и РаботаСВатсап.СервисДоступен();
	//КонецЕсли;
	//ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользуетсяФункционалСметМобильногоЗамерщикаПриИзменении(Элемент)
	ОбновитьЭлементыФормыНаСервере("РасширенныеСервисы");
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаДоступныеВидыЦенПоУмолчаниюПриИзменении(Элемент)
	ТекущиеДанные = Элементы.МобильныйКлиентЗамерщикаДоступныеВидыЦен.ТекущиеДанные;
	Если ТекущиеДанные.ПоУмолчанию Тогда
		Для Каждого ТекСтрока Из МобильныйКлиентЗамерщикаДоступныеВидыЦен Цикл
			Если ТекСтрока.ВидЦены = ТекущиеДанные.ВидЦены Тогда
				ТекСтрока.ПоУмолчанию = Истина;
			Иначе
				ТекСтрока.ПоУмолчанию = Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ТекСтрока Из МобильныйКлиентЗамерщикаДоступныеВидыЦен Цикл
			ТекСтрока.ПоУмолчанию = Ложь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

//++ №12087
&НаКлиенте
Процедура УдалитьЛицензию(Команда)
	
	ТекущиеДанные = Элементы.СерийныеНомера.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеВопросаОбУдаленииЛицензии", ЭтотОбъект, новый Структура("ТекущиеДанные", ТекущиеДанные));
	
	ПоказатьВопрос(ОписаниеОповещения, "Вы действительно намерены удалить лицензию?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбУдаленииЛицензии(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	УдалитьЛицензиюНаСервере(ТекущиеДанные.РегистрационныйНомер, ТекущиеДанные.PINКод);
	
	ОбновитьЭлементыФормы();
	ПолучитьИВывестиДополнительныеСведенияПоЛицензии();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьЛицензиюНаСервере(РегистрационныйНомер, PINКод)
	
	НаборЗаписей = РегистрыСведений.СерийныеНомера.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегистрационныйНомер.Установить(РегистрационныйНомер);
	
	НаборЗаписей.Прочитать();
	
	КоличествоЗаписей = НаборЗаписей.Количество() - 1;
	
	Для Сч = 0 По КоличествоЗаписей Цикл
		
		Если НаборЗаписей[КоличествоЗаписей - Сч].PINКод = PINКод Тогда
			
			НаборЗаписей.Удалить(КоличествоЗаписей - Сч);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
//-- №12087

//++ №12763
&НаКлиенте
Процедура ПолучателиУведомленийОПросроченныхЛидахПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Удаляем дубли и пустые
	МассивСотрудников = новый Массив;
	
	КоличествоСтрок = ПолучателиУведомленийОПросроченныхЛидах.Количество() - 1;
	
	Для Сч = 0 По КоличествоСтрок Цикл
		
		ТекущаяСтрока = ПолучателиУведомленийОПросроченныхЛидах[КоличествоСтрок - Сч];
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Пользователь)
			Или НЕ МассивСотрудников.Найти(ТекущаяСтрока.Пользователь) = Неопределено
		Тогда
		
			ПолучателиУведомленийОПросроченныхЛидах.Удалить(КоличествоСтрок - Сч);
			
		КонецЕсли;
		
		МассивСотрудников.Добавить(ТекущаяСтрока.Пользователь);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаДоступныеВидыЦенПриИзменении(Элемент)
	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаДоступныеВидыСкидокПриИзменении(Элемент)
	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаДоступнаяНоменклатураПриИзменении(Элемент)
	
	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
	
	ОбновитьНадписьБудетВыгруженоНоменклатурыВМобильныйКлиент(); // №14535
	
КонецПроцедуры
//-- №12763

//++ №13563

&НаКлиенте
Процедура ДекорацияЛогРойстатНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.ЛогРОЙСТАТ.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВебхукиРойстатНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.ВебхукиРойстат.ФормаСписка");
	
КонецПроцедуры



&НаКлиенте
Процедура ДекорацияЛогАТСНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.ЛогАТС.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИсторияЗвонковНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.ИсторияЗвонковАТС.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВестиЛогированиеОбменаССайтомПриИзменении(Элемент)
	
	Если НаборКонстант.ВестиЛогированиеОбменаССайтом Тогда
		НаборКонстант.ЛогОбменаССайтомОтключитьПосле = ТекущаяДата() + 3*60*60; // именно ТекущаяДата()
	Иначе
		НаборКонстант.ЛогОбменаССайтомОтключитьПосле = Дата(1, 1, 1);
	КонецЕсли;
	
КонецПроцедуры
//-- №13563

//++ №4562
&НаКлиенте
Процедура НаборКонстантЗагружатьДатуОжидаемойОтгрузкиИзПостроителяПриИзменении(Элемент)
	
	ОбновитьЭлементыФормыНаСервере("ЗагрузкаИзПостроителя");
	
КонецПроцедуры

//&НаСервере
//Процедура НаборКонстантМобильныйКлиентЗамерщикаОрганизацияПоУмолчаниюПриИзмененииНаСервере()
	//НаборКонстант.МобильныйКлиентЗамерщикаПредставлениеОрганизации = НаборКонстант.МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию.ПолноеНаименование;
	
	//НовыйФайл = Справочники.ОрганизацииФайлы.СоздатьЭлемент();
	//НовыйФайл.Файл = Новый ХранилищеЗначения(НаборКонстант.МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию.ФайлЛоготип.Файл.Получить());
	//НовыйФайл.Записать();
	//
	//Если НаборКонстант.МобильныйКлиентЗамерщикаЛоготипОрганизации.Пустая() = Ложь и НаборКонстант.МобильныйКлиентЗамерщикаЛоготипОрганизации.ПолучитьОбъект()<>Неопределено Тогда		
	//	Попытка
	//		СтарыйФайл = НаборКонстант.МобильныйКлиентЗамерщикаЛоготипОрганизации.ПолучитьОбъект();
	//		СтарыйФайл.Удалить();
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//
	//НаборКонстант.МобильныйКлиентЗамерщикаЛоготипОрганизации = НовыйФайл.Ссылка;
	//МобильныйКлиентЗамерщикаЛоготипОрганизацииПоле = ПолучитьНавигационнуюСсылку(НовыйФайл, "Файл");
	//
	//НовыйФайл = Справочники.ОрганизацииФайлы.СоздатьЭлемент();
	//НовыйФайл.Файл = Новый ХранилищеЗначения(НаборКонстант.МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию.ФайлПечать.Файл.Получить());
	//НовыйФайл.Записать();
	//
	//Если НаборКонстант.МобильныйКлиентЗамерщикаПечатьОрганизации.Пустая() = Ложь и НаборКонстант.МобильныйКлиентЗамерщикаПечатьОрганизации.ПолучитьОбъект()<>Неопределено Тогда		
	//	Попытка
	//		СтарыйФайл = НаборКонстант.МобильныйКлиентЗамерщикаПечатьОрганизации.ПолучитьОбъект();
	//		СтарыйФайл.Удалить();
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//
	//НаборКонстант.МобильныйКлиентЗамерщикаПечатьОрганизации = НовыйФайл.Ссылка;
	//МобильныйКлиентЗамерщикаПечатьОрганизацииПоле = ПолучитьНавигационнуюСсылку(НовыйФайл, "Файл");
//КонецПроцедуры

//&НаКлиенте
//Процедура НаборКонстантМобильныйКлиентЗамерщикаОрганизацияПоУмолчаниюПриИзменении(Элемент)
//	НаборКонстантМобильныйКлиентЗамерщикаОрганизацияПоУмолчаниюПриИзмененииНаСервере();
//	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
//КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантМобильныйКлиентЗамерщикаПредставлениеОрганизацииПриИзменении(Элемент)
	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры
//-- №4562

//&НаКлиенте
//Процедура ЗагрузитьОчиститьЛоготип(Команда)
//	ЗагрузитьОчиститьКартинку(МобильныйКлиентЗамерщикаЛоготипОрганизацииПоле, НаборКонстант.МобильныйКлиентЗамерщикаЛоготипОрганизации);	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗагрузитьОчиститьКартинку(ПолеКартинки, ОбъектКартинки)	
//	Если ОбъектКартинки.Пустая() Тогда
//		ЗагрузитьКартинку(ПолеКартинки, ОбъектКартинки);
//	Иначе
//		ОчиститьКартинку(ПолеКартинки, ОбъектКартинки);
//	КонецЕсли;	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОчиститьКартинку(ПолеКартинки, ОбъектКартинки)
//	Если ОбъектКартинки.Пустая() = Ложь Тогда		
//		УдалитьКартинку(ОбъектКартинки);
//		ОбъектКартинки = Неопределено;
//		ПолеКартинки = "";
//	конецесли;
//КонецПроцедуры

//&НаСервере
//Процедура УдалитьКартинку(ОбъектКартинки)
//	Попытка
//		СтарыйФайл = ОбъектКартинки.ПолучитьОбъект();
//		СтарыйФайл.Удалить();
//	Исключение
//	КонецПопытки;
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗагрузитьКартинку(ПолеКартинки, ОбъектКартинки)
//	ИмяФайла = "";
//	ПутьФайла = "";
//	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда	
//		ПолеКартинки = ПутьФайла;

//		УстановитьКартинку(ПолеКартинки, ОбъектКартинки);
//		Модифицированность=Истина;
//	КонецЕсли; 
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьКартинку(ПолеКартинки, ОбъектКартинки)
//	НовыйФайл = Справочники.ОрганизацииФайлы.СоздатьЭлемент();
//	НовыйФайл.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ПолеКартинки));
//	ПолеКартинки = ПоместитьВоВременноеХранилище(НовыйФайл.Файл.Получить());
//	НовыйФайл.Записать();
//	
//	Если ОбъектКартинки.Пустая() = Ложь и ОбъектКартинки.ПолучитьОбъект()<>Неопределено Тогда		
//		СтарыйФайл = ОбъектКартинки.ПолучитьОбъект();
//		СтарыйФайл.Удалить();
//	КонецЕсли;

//	ОбъектКартинки = НовыйФайл.Ссылка;
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗагрузитьОчиститьПечатьМобильныйКлиентЗамерщика(Команда)
//	ЗагрузитьОчиститьКартинку(МобильныйКлиентЗамерщикаПечатьОрганизацииПоле, НаборКонстант.МобильныйКлиентЗамерщикаПечатьОрганизации);	
//КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантМобильныйКлиентЗамерщикаРучнаяУстановкаЦенПриИзменении(Элемент)
	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры


&НаКлиенте
Процедура НастройкаНоменклатурыКакПродукция(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкиНоменклатурыКакПродукция");
	
КонецПроцедуры


&НаКлиенте
Процедура НаборКонстантАвтоматическиДобавлятьСопутствующиеТоварыИУслугиПриИзменении(Элемент)
	Если НаборКонстант.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги Тогда
		Элементы.ГруппаНастроекАвтоматическогоДобавления.Доступность = Истина;
	Иначе
		НаборКонстант.ЗапрашиватьПодтверждениеПриДобавленииНоменклатурыСТ = Ложь;
		НаборКонстант.ЗапрашиватьПодтверждениеПриИзмененииКоличестваСТ = Ложь;
		НаборКонстант.ЗапрашиватьПодтверждениеПриУдаленииНоменклатурыСТ = Ложь;
		НаборКонстант.ЗапрашиватьПодтверждениеПриИзмененииНоменклатурыСТ = Ложь;
		Элементы.ГруппаНастроекАвтоматическогоДобавления.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантМобильныйКлиентПредлагатьСопутствующиеТоварыПриИзменении(Элемент)
	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантДопустимаяГлубинаВложенностиСопутствующихТоваровИУслугПриИзменении(Элемент)
	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантМобильныйКлиентИзменятьСопутствующиеТоварыПриИзменении(Элемент)
	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантМобильныйКлиентУдалятьСопутствующиеТоварыПриИзменении(Элемент)
	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры






