&НаКлиенте
Перем СтараяНоменклатура; // Используется в механизмах обработчиков событий табличной части Товары
&НаКлиенте
Перем СтараяХарактеристика; // Используется в механизмах обработчиков событий табличной части Товары

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая() Тогда
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
		
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	УстановитьВидимость();
	
	УстановитьУсловноеОформление();
	ЗагрузитьТабличнуюЧастьТовары();
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("ДеревоЦенНоменклатураАртикул");
	МассивЭлементов.Добавить("УглыНоменклатураАртикул");
	МассивЭлементов.Добавить("ВырезыApplyНоменклатураАртикул");
	МассивЭлементов.Добавить("ФотопечатьНоменклатураАртикул");
	МассивЭлементов.Добавить("ДлинаШвовНоменклатураАртикул");
	МассивЭлементов.Добавить("ДлинаШвовМногофактурныйНоменклатураАртикул");
	МассивЭлементов.Добавить("ДлинаПользовательскихШвовНоменклатураАртикул");
	МассивЭлементов.Добавить("ВнутренниеВырезыНоменклатураАртикул");
	МассивЭлементов.Добавить("КривыеНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПоместитьЦеныВТабличнуюЧасть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораФактуры" Тогда	
		ОбработкаПодбораФактурыНаКлиенте(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда	
		ОбработкаПодбораНоменклатурыНаКлиенте(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ДобавитьНоменклатуруНаСервере(Номенклатура)
	Дерево = ДанныеФормыВЗначение(ДеревоЦен, Тип("ДеревоЗначений"));
	
	ЗапросХарактеристики = Новый Запрос;
	ЗапросХарактеристики.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	ЗапросХарактеристики.УстановитьПараметр("Владелец", Номенклатура);
	РезультатЗапросаХарактеристики = ЗапросХарактеристики.Выполнить();
	
	//по всем единицам измерений по данной номенклатуре
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕдиницыИзмерений.Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерений КАК ЕдиницыИзмерений
	|ГДЕ
	|	ЕдиницыИзмерений.Владелец = &Владелец
	|	И ЕдиницыИзмерений.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	МассивЕдИзмерений = новый Массив;
	МассивЕдИзмерений.Добавить(ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Номенклатура));
	Пока Выборка.Следующий() Цикл
		МассивЕдИзмерений.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Для Каждого ЕдИзм Из МассивЕдИзмерений Цикл
		
		Если Дерево.Строки.НайтиСтроки(Новый Структура("Номенклатура, ЕдиницаИзмерения",Номенклатура, ЕдИзм)).Количество()=0 Тогда		
			Стр = Дерево.Строки.Добавить();
			Стр.Номенклатура = Номенклатура;
			Стр.ЕдиницаИзмерения = ЕдИзм;
			ВыборкаХарактеристики = РезультатЗапросаХарактеристики.Выбрать();
			ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(Стр);
			Если ВыборкаХарактеристики.Количество() > 0 Тогда								
			Стр.ХарактеристикиИспользуются = Истина;	
				Пока ВыборкаХарактеристики.Следующий() Цикл
					СтрДеревоВид = Стр.Строки.Добавить();
					СтрДеревоВид.Номенклатура = Стр.Номенклатура;
					СтрДеревоВид.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.Ссылка;
					СтрДеревоВид.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
					СтрДеревоВид.ХарактеристикиИспользуются = Истина;
					ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(СтрДеревоВид);
				КонецЦикла;
			КонецЕсли;						
		КонецЕсли;
		
	КонецЦикла;

	ЗначениеВДанныеФормы(Дерево, ДеревоЦен); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварамиИзДокумента(Команда)
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаЗаполненияИзДокумента",,ЭтаФорма,,,,
		Новый ОписаниеОповещения("ЗаполнитьТоварамиИзДокументаПриЗавершенииВыбора",ЭтотОбъект));
КонецПроцедуры		

&НаКлиенте
Процедура ЗаполнитьТоварамиИзДокументаПриЗавершенииВыбора(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьТоварамиИзДокументаНаСервере(Результат);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварамиИзДокументаНаСервере(ВозвращенноеЗначение)
	
	//ВозвращенноеЗначение.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерений");
	Объект.Товары.Очистить();
	ПоместитьЦеныВТабличнуюЧасть();
	Для Каждого ТекущаяСтрока Из ВозвращенноеЗначение Цикл
		//Попробуем найти в ТЧ Товары
		Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения",
			ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения);						
		НайденноеЗначение = Объект.Товары.НайтиСтроки(Отбор);
		Если НайденноеЗначение.Количество() > 0 Тогда
			НоваяСтрокаТЧ = НайденноеЗначение[0];
		Иначе	
			НоваяСтрокаТЧ = Объект.Товары.Добавить();
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, ТекущаяСтрока);
	КонецЦикла;
	ДеревоЦен.ПолучитьЭлементы().Очистить();
	ЗагрузитьТабличнуюЧастьТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиЦенами(Команда)
	Если ДеревоЦен.ПолучитьЭлементы().Количество() = 0 Тогда 
		Сообщить("Таблица цен пуста, установка цен не выполнена");
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Контрагент) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Сообщить("Не указан контрагент или договор контрагента");
	Иначе
		ЗаполнитьТекущимиЦенамиНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущимиЦенамиНаСервере()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент",Объект.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦенаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЦенаНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦенаНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦенаНоменклатуры.Цена КАК Цена,
	|	ЦенаНоменклатуры.ВидЦены КАК ВидЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыИндивидуальные.СрезПоследних(&Дата, ) КАК ЦенаНоменклатуры
	|ГДЕ
	|	ЦенаНоменклатуры.Валюта = &Валюта
	|	И ЦенаНоменклатуры.Контрагент = &Контрагент
	|	И ЦенаНоменклатуры.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	
	Дерево = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из Дерево Цикл	
		ЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
		Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения",
				СтрокаДерева.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), СтрокаДерева.ЕдиницаИзмерения);
		НайденныеСтроки = ТаблицаЦен.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева.Цена = НайденныеСтроки[0].Цена;			
			СтрокаДерева.ВидЦены = НайденныеСтроки[0].ВидЦены;
		КонецЕсли;
		// характеристики
		Для Каждого Стр из ЭлементыСтроки Цикл
			Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения",
						Стр.Номенклатура, Стр.ХарактеристикаНоменклатуры, Стр.ЕдиницаИзмерения);
			НайденныеСтроки = ТаблицаЦен.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Стр.Цена = НайденныеСтроки[0].Цена;
				Стр.ВидЦены = НайденныеСтроки[0].ВидЦены;
			КонецЕсли; 	
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщуюЦену(Команда)
	
	УстановкаЦенКлиент.УстановитьОбщуюЦенуНаНоменклатуру(ЭтаФорма, "УстановитьОбщуюЦенуНаНоменклатуруПослеВыбораЦены");
			
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщуюЦенуНаНоменклатуруПослеВыбораЦены(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ЭлементНоменклатура = ДополнительныеПараметры.ДеревоЦен.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из ЭлементНоменклатура Цикл	
		
		СтрокаДерева.Цена = ВыбранноеЗначение;
		СтрокаДерева.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		
		ЭлементХарактеристика = СтрокаДерева.ПолучитьЭлементы();
		// характеристики
		Для Каждого Стр из ЭлементХарактеристика Цикл
			Стр.Цена = ВыбранноеЗначение;
			Стр.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсеЗначенияНаСумму(Команда)
	
	ПослеВводаСуммыДляИзмененияВсехСтрок = Новый ОписаниеОповещения("ПослеВводаСуммыДляИзмененияВсехСтрок", ЭтаФорма);
	ПоказатьВводЧисла(ПослеВводаСуммыДляИзмененияВсехСтрок,0,"Введите сумму",15,2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСуммыДляИзмененияВсехСтрок(Число, Параметры) Экспорт
	Если Число = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Дерево = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из Дерево Цикл	
		ЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
		Если СтрокаДерева.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка") Тогда
			СтрокаДерева.Цена = СтрокаДерева.Цена + Число;
		КонецЕсли;
		
		// характеристики
		Для Каждого Стр из ЭлементыСтроки Цикл
			Если Стр.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка") Тогда
				Стр.Цена = Стр.Цена + Число;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПоказатьОповещениеПользователя("Цены изменены");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсеЗначенияНаПроцент(Команда)
	ПослеВводаПроцентаДляИзмененияВсехСтрок = Новый ОписаниеОповещения("ПослеВводаПроцентаДляИзмененияВсехСтрок", ЭтаФорма);
	ПоказатьВводЧисла(ПослеВводаПроцентаДляИзмененияВсехСтрок,0,"Введите %",15,2);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПроцентаДляИзмененияВсехСтрок(Число, Параметры) Экспорт
	Если  Число = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Дерево = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из Дерево Цикл	
		ЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
		Если СтрокаДерева.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка") Тогда
			СтрокаДерева.Цена = СтрокаДерева.Цена + СтрокаДерева.Цена*(Число/100);
		КонецЕсли;
		
		// характеристики
		Для Каждого Стр из ЭлементыСтроки Цикл
			Если Стр.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка") Тогда
				Стр.Цена = СтрокаДерева.Цена + Стр.Цена*(Число/100);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПоказатьОповещениеПользователя("Цены изменены");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщийВидЦены(Команда)
	
	ОткрытьФорму("Справочник.ВидыЦен.ФормаВыбора",,ЭтаФорма,,,,
		Новый ОписаниеОповещения("УстановитьОбщийВидЦеныПриЗавершенииВыбора",ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщийВидЦеныПриЗавершенииВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьОбщийВидЦеныЗавершение", ЭтаФорма, Результат);
	ТекстВопроса = "Установить выбранный ""Вид цены"" для всех строк? При выборе ""Нет"" будет установлено только для выделенных строк.";
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОбщийВидЦеныЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВидЦены = ДополнительныеПараметры;
	ТолькоВыделенныеСтроки = Ложь;	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ТолькоВыделенныеСтроки = Истина;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ТолькоВыделенныеСтроки = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если НЕ ТолькоВыделенныеСтроки Тогда
		
		ЭлементыНоменклатура = ДеревоЦен.ПолучитьЭлементы();
		Для Каждого ЭлементНоменклатура из ЭлементыНоменклатура Цикл			
			ЭлементНоменклатура.ВидЦены = ВидЦены;
			ЭлементНоменклатура.Цена = 0;
			
			ЭлементыХарактеристики = ЭлементНоменклатура.ПолучитьЭлементы();
			Для Каждого ЭлементХарактеристика из ЭлементыХарактеристики Цикл
				ЭлементХарактеристика.ВидЦены = ВидЦены;
				ЭлементХарактеристика.Цена = 0;			
			КонецЦикла;
		КонецЦикла;
	
	Иначе
	
		Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоЦен.ВыделенныеСтроки Цикл
			
			СтрокаТаблицыЦен = ДеревоЦен.НайтиПоИдентификатору(ВыделеннаяСтрока);				
			СтрокаТаблицыЦен.ВидЦены = ВидЦены;
			СтрокаТаблицыЦен.Цена = 0;
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицыЦен.ХарактеристикаНоменклатуры) Тогда	
				ЭлементыХарактеристики = СтрокаТаблицыЦен.ПолучитьЭлементы();				
				Для Каждого ЭлементХарактеристика Из ЭлементыХарактеристики Цикл
					ЭлементХарактеристика.ВидЦены = ВидЦены;
					ЭлементХарактеристика.Цена = 0;
				КонецЦикла;				
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиЦеныНоменклатуры

&НаКлиенте
Процедура ИндивидуальныеЦеныНоменклатурыПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

#Область ОбработчикиСобытийДереваЦен

&НаКлиенте
Процедура ДеревоЦенПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// для запрета ввода по Insert
	Если НЕ Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.ДеревоЦен.ТекущиеДанные;
	СтараяНоменклатура = ТекущиеДанные.Номенклатура;
	СтараяХарактеристика = ТекущиеДанные.ХарактеристикаНоменклатуры;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекущиеДанные = Элементы.ДеревоЦен.ТекущиеДанные;
	
	Если ТекущиеДанные.Номенклатура <> СтараяНоменклатура Тогда
		
		ЭлементыНоменклатура = ДеревоЦен.ПолучитьЭлементы();
		Для Каждого ЭлементНоменклатура Из ЭлементыНоменклатура Цикл
			Если ЭлементНоменклатура.Номенклатура = ТекущиеДанные.Номенклатура Тогда
				Если ТекущиеДанные.ПолучитьИдентификатор() <> ЭлементНоменклатура.ПолучитьИдентификатор() Тогда
					Если Не ОтменаРедактирования Тогда
						Отказ = Истина;
						ОчиститьСообщения();
						Сообщить(НСтр("ru = 'Такая номенклатура уже введена.'"));
					Иначе
						ТекущиеДанные.Номенклатура = СтараяНоменклатура;
						ТекущиеДанные.ХарактеристикаНоменклатуры = СтараяХарактеристика;
					КонецЕсли;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
		ДеревоЦен.ПолучитьЭлементы().Удалить(ТекущиеДанные);
		ДобавитьНоменклатуруНаСервере(ТекущиеДанные.Номенклатура);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Если Не ОтменаРедактирования Тогда
			Отказ = Истина;
			ОчиститьСообщения();
			Сообщить(НСтр("ru = 'Номенклатура не выбрана.'"));
		Иначе
			ТекущиеДанные.Номенклатура = СтараяНоменклатура;
			ТекущиеДанные.ХарактеристикаНоменклатуры = СтараяХарактеристика;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущиеДанные.ХарактеристикаНоменклатуры <> СтараяХарактеристика Тогда
		
		ЭлементыХарактеристики = ДеревоЦен.НайтиПоИдентификатору(Элементы.ДеревоЦен.ТекущаяСтрока);
		
		Если ЭлементыХарактеристики.ПолучитьРодителя() = Неопределено Тогда
			ЭлементыХарактеристики = ЭлементыХарактеристики.ПолучитьЭлементы();
		Иначе
			ЭлементыХарактеристики = ЭлементыХарактеристики.ПолучитьРодителя().ПолучитьЭлементы();
		КонецЕсли;
		Для Каждого ЭлементХарактеристика Из ЭлементыХарактеристики Цикл
			Если ЭлементХарактеристика.ХарактеристикаНоменклатуры = ТекущиеДанные.ХарактеристикаНоменклатуры Тогда
				Если ТекущиеДанные.ПолучитьИдентификатор() <> ЭлементХарактеристика.ПолучитьИдентификатор() Тогда
					Если Не ОтменаРедактирования Тогда
						Отказ = Истина;
						ОчиститьСообщения();
						Сообщить(НСтр("ru = 'Такая характеристика для данной номенклатуры уже введена.'"));
					Иначе
						ТекущиеДанные.Номенклатура = СтараяНоменклатура;
						ТекущиеДанные.ХарактеристикаНоменклатуры = СтараяХарактеристика;
					КонецЕсли;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(Элемент.ТекущиеДанные); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ДеревоЦен.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоЦен.ТекущиеДанные;
	ТекущаяСтрока = ДеревоЦен.НайтиПоИдентификатору(ТекущиеДанные.ПолучитьИдентификатор());
	ИмяТекущейКолонки  = СтрЗаменить(Элемент.Имя, "ДеревоЦен", "");
	
	ТекущиеДанные.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		//Цену поставили у родителя, нужно проставить у подчиненных
		ТекущееЗначение = ТекущиеДанные[ИмяТекущейКолонки];
		ЭлементыХарактеристики = ТекущаяСтрока.ПолучитьЭлементы();
		
		Для Каждого ЭлементХарактеристика Из ЭлементыХарактеристики Цикл			
			ЭлементХарактеристика[ИмяТекущейКолонки] = ТекущееЗначение;
			ЭлементХарактеристика.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		КонецЦикла;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенВидЦеныПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоЦен.ТекущиеДанные;
	ТекущаяСтрока = ДеревоЦен.НайтиПоИдентификатору(ТекущиеДанные.ПолучитьИдентификатор());
	ИмяТекущейКолонки  = СтрЗаменить(Элемент.Имя, "ДеревоЦен", "");
	
	ТекущиеДанные.Цена = 0;
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		//Цену поставили у родителя, нужно проставить у подчиненных
		ТекущееЗначение = ТекущиеДанные[ИмяТекущейКолонки];
		ЭлементыХарактеристики = ТекущаяСтрока.ПолучитьЭлементы();
		
		Для Каждого ЭлементХарактеристика Из ЭлементыХарактеристики Цикл			
			ЭлементХарактеристика[ИмяТекущейКолонки] = ТекущееЗначение;
			ЭлементХарактеристика.Цена = 0;
		КонецЦикла;		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура РазвернутьДеревоДокумента(Команда)
	
	УстановкаЦенКлиент.РазвернутьДеревоЦен(Элементы, ДеревоЦен);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоЦенДокумента(Команда)
	
	УстановкаЦенКлиент.СвернутьДеревоЦен(Элементы, ДеревоЦен);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,ЭтаФорма,,,,
		Новый ОписаниеОповещения("ДобавитьНоменклатуруПриЗавершенииВыбора",ЭтотОбъект));
КонецПроцедуры
	
&НаКлиенте
Процедура ДобавитьНоменклатуруПриЗавершенииВыбора(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДобавитьНоменклатуруНаСервере(Результат);
	Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристику(Команда)
	
	ТекущиеДанные = Элементы.ДеревоЦен.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Для того, чтобы выбрать характеристику Вам необходимо предварительно выбрать номенклатуру.'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ИспользуютсяХарактеристикиНоменклатуры(ТекущиеДанные.Номенклатура) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Для данной номенклатуры характеристики не используются.'"));
		Возврат;
	КонецЕсли;	
	
	Отбор = новый Структура;
	Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
	
	ПараметрыФормыВыбора = Новый Структура;	
	ПараметрыФормыВыбора.Вставить("Отбор", Отбор);	
	
	ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора", ПараметрыФормыВыбора,,,,, Новый ОписаниеОповещения("ДобавитьХарактеристикуЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристикуЗавершение(Результат, ДопПараметры)  Экспорт
	
	ТекущиеДанные = ДопПараметры.ТекущиеДанные;    
    
    Характеристика = Результат;
    Если Характеристика = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ЭлементыХарактеристики = ДеревоЦен.НайтиПоИдентификатору(Элементы.ДеревоЦен.ТекущаяСтрока);
    Если ЭлементыХарактеристики.ПолучитьРодителя() = Неопределено Тогда
        ЭлементыХарактеристики = ЭлементыХарактеристики.ПолучитьЭлементы();
    Иначе
        ЭлементыХарактеристики = ЭлементыХарактеристики.ПолучитьРодителя().ПолучитьЭлементы();
    КонецЕсли;
    Для Каждого ЭлементХарактеристика Из ЭлементыХарактеристики Цикл
        Если ЭлементХарактеристика.ХарактеристикаНоменклатуры = Характеристика Тогда
            Элементы.ДеревоЦен.ТекущаяСтрока = ЭлементХарактеристика.ПолучитьИдентификатор();;
            ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Такая характеристика для данной номенклатуры уже введена.'"));
            Возврат;
        КонецЕсли;
    КонецЦикла;
    
    ТекущийРодитель = ТекущиеДанные.ПолучитьРодителя();
    Если ТекущийРодитель = Неопределено Тогда
        ТекущийРодитель = ТекущиеДанные;
    КонецЕсли;
    НоваяСтрока = ТекущийРодитель.ПолучитьЭлементы().Добавить();
    Элементы.ДеревоЦен.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
    
    ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийРодитель, , "ХарактеристикаНоменклатуры");
    
    НоваяСтрока.ХарактеристикаНоменклатуры = Характеристика;    
    //НоваяСтрока.ИндексКартинки = 2;
	ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(НоваяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
		
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатуры());
	ПараметрыПодбора.Вставить("НеЗапрашиватьЦену",			Истина);
	ПараметрыПодбора.Вставить("НеЗапрашиватьКоличество",	Истина);
	
	УстановкаЦенКлиент.ОткрытьФормуПодбораНоменклатуры(ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораНоменклатурыНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаПодбораНоменклатурыНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаПодбораНоменклатурыНаСервере(ВыбранноеЗначение)
	
	ТаблицаНоменклатуры = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	УстановкаЦенСервер.ДобавитьНоменклатуруВДеревоЦен(ЭтаФорма, ТаблицаНоменклатуры);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоГруппеНоменклатуры(Команда)
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",,ЭтаФорма,,,,
		Новый ОписаниеОповещения("ЗаполнитьПоГруппеПриЗавершенииВыбора",ЭтотОбъект));
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьПоГруппеПриЗавершенииВыбора(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьПоГруппеНоменклатурыНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГруппеНоменклатурыНаСервере(ГруппаНоменклатуры)
	
	УстановкаЦенСервер.ЗаполнитьНоменклатуруПоГруппе(ЭтаФорма, ГруппаНоменклатуры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиЦеныУслугРаскроя

&НаКлиенте
Процедура ИндивидуальныеЦеныРаскрояПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	//Определим вкладку
	ТекущаяВкладка = Элементы.ГруппаЦеныУслугРаскроя.ТекущаяСтраница.Имя;
	
	//"ГруппаУглы" - "Углы"
	ТЧ = Прав(ТекущаяВкладка, СтрДлина(ТекущаяВкладка)-6);
	
	Если НЕ ЗначениеЗаполнено(ТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект[ТЧ].Количество() = 0 Тогда
		ДобавитьУслугиПоУмолчанию(ТЧ);
	Иначе
		ОП = новый ОписаниеОповещения("ПослеВопросаОбОчисткеТабличнойЧасти", ЭтотОбъект, новый Структура("ТЧ", ТЧ));
		ПоказатьВопрос(ОП, "Табличная часть " + ТЧ + " будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеТабличнойЧасти(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект[ДопПараметры.ТЧ].Очистить();
		ДобавитьУслугиПоУмолчанию(ДопПараметры.ТЧ);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУслугиПоУмолчанию(ТЧ)
	
	Если ТЧ = "Углы" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Углы (раскрой)");
		Номенклатура2 = Справочники.Номенклатура.НайтиПоНаименованию("Угол бесплатный (раскрой)");		
	ИначеЕсли ТЧ = "ВырезыApply" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Apply вырез");
	ИначеЕсли ТЧ = "Фотопечать" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Фотопечать");
	ИначеЕсли ТЧ = "ДлинаШвов" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Прямолинейный шов");
	ИначеЕсли ТЧ = "ДлинаШвовМногофактурный" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Прямолинейный шов");
	ИначеЕсли ТЧ = "ДлинаПользовательскихШвов" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Криволинейный шов");
	ИначеЕсли ТЧ = "ВнутренниеВырезы" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Внутренний вырез (раскрой)");
	ИначеЕсли ТЧ = "Кривые" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Криволинейный участок (раскрой)");	
	КонецЕсли;
	
	Если ТЧ = "Углы" И Номенклатура2 <> Неопределено И НЕ Номенклатура2.Пустая() Тогда
		НоваяСтрока = Объект[ТЧ].Добавить();
		НоваяСтрока.Номенклатура = Номенклатура2;
		НоваяСтрока.КоличествоДо = 4;
	КонецЕсли;
	
	Если Номенклатура1 <> Неопределено И НЕ Номенклатура1.Пустая() Тогда
		НоваяСтрока = Объект[ТЧ].Добавить();
		НоваяСтрока.Номенклатура = Номенклатура1;
		НоваяСтрока.КоличествоДо = 999999;
		Если ТЧ = "Углы" Тогда
			НоваяСтрока.КоличествоОт = 5;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиЦеныНаПродукцию
//#7256 

&НаКлиенте
Процедура ИндивидуальныеЦеныНаПродукциюПриИзменении(Элемент)
	
	ИндивидуальныеЦеныНаПродукциюПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИндивидуальныеЦеныНаПродукциюПриИзмененииНаСервере()
	
	УстановитьВидимость();
	
	МассивВидов = Новый Массив;
	МассивВидов.Добавить(Справочники.ВидыНоменклатуры.Отрез);
	МассивВидов.Добавить(Справочники.ВидыНоменклатуры.ТиповойОтрез);
	МассивВидов.Добавить(Справочники.ВидыНоменклатуры.Потолок);
	
	Для каждого ЭлементМассива из МассивВидов Цикл
		НайденныеСтроки = Объект.ВидыНоменклатурыПотолка.НайтиСтроки(Новый Структура("ВидНоменклатуры", ЭлементМассива));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.ВидыНоменклатурыПотолка.Добавить();	
			НоваяСтрока.ВидНоменклатуры = ЭлементМассива;
			НоваяСтрока.КлючСвязи = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанные = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбран вид номенклатуры потолка!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		ТекущиеДанныеВиды = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;	
		Элемент.ТекущиеДанные.КлючСвязи = ТекущиеДанныеВиды.КлючСвязи;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыНоменклатурыПотолкаПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ВидыНоменклатурыПотолкаПриАктивизацииСтрокиОбработчикОжидания", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыНоменклатурыПотолкаПриАктивизацииСтрокиОбработчикОжидания()
	
	СтрокаВида = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	Если СтрокаВида = Неопределено тогда
		Элементы.Материалы.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСвязи", NULL);
	Иначе
		Элементы.Материалы.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаВида.КлючСвязи);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьМатериалы(Команда)
	
	ТекущиеДанные = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбран вид номенклатуры потолка!");
		Возврат;
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура;
	УстановкаЦенКлиент.ОткрытьФормуПодбораФактуры(ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораФактурыНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаПодбораФактурыНаСервере(ВыбранноеЗначение, ТекущиеДанные.КлючСвязи);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаПодбораФактурыНаСервере(ВыбранноеЗначение, КлючСвязи)
	
	ТаблицаФактур = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	УстановкаЦенСервер.ОбработкаВыбораПодбораФактуры(ТаблицаФактур, Объект.Материалы, Новый Структура("КлючСвязи", КлючСвязи));

КонецФункции

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСправочнику(Команда)
	
	ТекущиеДанные = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбран вид номенклатуры потолка!");
		Возврат;
	КонецЕсли;
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоСправочникуФактур(ЭтаФорма, Объект.Материалы, Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи));
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСправочникуФактурЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
	
   	ЗаполнитьМатериалыПоСправочникуФактурНаСервере(ДополнительныеПараметры.ДополнительныеПараметрыЗаполнения);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоСправочникуФактурНаСервере(ДополнительныеПараметрыЗаполнения)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Объект.Материалы, , ДополнительныеПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоГруппеСправочника(Команда)
	
	ТекущиеДанные = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбран вид номенклатуры потолка!");
		Возврат;
	КонецЕсли;
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоГруппеФактур(ЭтаФорма, Объект.Материалы, Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоГруппеФактурПослеВыбораГруппы(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМатериалыПоГруппеНаСервере(ВыбранноеЗначение, ДополнительныеПараметры);
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоГруппеНаСервере(ГруппаФактур, ДополнительныеПараметрыЗаполнения)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Объект.Материалы, ГруппаФактур, ДополнительныеПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныМатериаловТекущимиЦенами(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Сообщить("Не указан контрагент или договор контрагента");
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбран вид номенклатуры потолка!");
		Возврат;
	КонецЕсли;
	
	СтруктураОтбораСтрок = Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи);
	КоллекцияДанных = Объект.Материалы.НайтиСтроки(СтруктураОтбораСтрок);
	Если КоллекцияДанных.Количество() = 0 Тогда
		Сообщить("Не заполнена таблица фактур и цветов!");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьЦеныМатериаловТекущимиЦенамиЗавершение", ЭтаФорма, СтруктураОтбораСтрок);
	ПоказатьВопрос(ОписаниеОповещенияВопрос, "Очистить цены и заполнить текущими значениями?", РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныМатериаловТекущимиЦенамиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
    Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьЦеныМатериаловТекущимиЦенамиНаСервере(ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныМатериаловТекущимиЦенамиНаСервере(СтруктураОтбораСтрок)
	
	//ДатаЦены = Объект.Дата;
	//Если ДатаЦены = Дата(1,1,1) Тогда
	//	ДатаЦены = ТекущаяДатаСеанса();
	//КонецЕсли;
	
	КоллекцияДанных = Объект.Материалы.НайтиСтроки(СтруктураОтбораСтрок);
	Для Каждого ТекущаяСтрока Из КоллекцияДанных Цикл
		ТекущаяСтрока.Цена 				= 0;
		ТекущаяСтрока.ЦенаСФотопечатью  = 0;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент",			Объект.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Дата", 				ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Валюта", 			Объект.Валюта);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныМатериалов.Фактура КАК Фактура,
	|	ЦеныМатериалов.ЦветФактуры КАК ЦветФактуры,
	|	ЦеныМатериалов.Цена КАК Цена,
	|	ЦеныМатериалов.ЦенаСФотопечатью КАК ЦенаСФотопечатью,
	|	ЦеныМатериалов.Отменена КАК Отменена
	|ИЗ
	|	РегистрСведений.ЦеныМатериаловИндивидуальные.СрезПоследних(
	|			&Дата,
	|			Валюта = &Валюта
	|				И Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК ЦеныМатериалов";
	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяСтрока Из КоллекцияДанных Цикл
		Отбор = Новый Структура("Фактура, ЦветФактуры", ТекущаяСтрока.Фактура, ТекущаяСтрока.ЦветФактуры);
		НайденныеСтроки = ТаблицаЦен.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если НЕ НайденныеСтроки[0].Отменена Тогда
				ТекущаяСтрока.Цена = НайденныеСтроки[0].Цена;			
				ТекущаяСтрока.ЦенаСФотопечатью = НайденныеСтроки[0].ЦенаСФотопечатью;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщуюЦенуНаМатериалы(Команда)
	
	ТекущиеДанные = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбран вид номенклатуры потолка!");
		Возврат;
	КонецЕсли;
	
	УстановкаЦенКлиент.УстановитьОбщуюЦенуНаМатериалы(Объект.Материалы, Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщуюЦенуСФотопечатьюНаМатериалы(Команда)
	
	ТекущиеДанные = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбран вид номенклатуры потолка!");
		Возврат;
	КонецЕсли;
	
	УстановкаЦенКлиент.УстановитьОбщуюЦенуНаМатериалы(Объект.Материалы, Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи), "Установить общую цену на все фактуры и цвета с фотопечатью?", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦеныМатериаловНаПроцент(Команда)
	
	ТекущиеДанные = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбран вид номенклатуры потолка!");
		Возврат;
	КонецЕсли;
	
	УстановкаЦенКлиент.ИзменитьЦеныМатериаловНаПроцент(Объект.Материалы, Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦеныМатериаловНаСумму(Команда)
	
	ТекущиеДанные = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбран вид номенклатуры потолка!");
		Возврат;
	КонецЕсли;
	
	УстановкаЦенКлиент.ИзменитьЦеныМатериаловНаСумму(ЭтаФорма, Объект.Материалы, Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункцииПроцедуры

&НаСервере
Процедура ЗагрузитьТабличнуюЧастьТовары()
	
	ТаблицаТоваров = Объект.Товары.Выгрузить();	
	КЭШ = СоздатьТаблицуНоменклатуры();
	КЭШ.Колонки.Добавить("СтрокаДереваЦен");
	КЭШ.Индексы.Добавить("Номенклатура, ЕдиницаИзмерения");
	
	Если ТипЗнч(ДеревоЦен) = Тип("ДанныеФормыКоллекция") Тогда
		ЭлементыДереваЦен = ДеревоЦен;
	Иначе
		ЭлементыДереваЦен = ДеревоЦен.ПолучитьЭлементы();		
	КонецЕсли;
	
	Для Каждого ТекНоменклатура Из ТаблицаТоваров Цикл
		
		ИспользуютсяХарактеристики = ИспользуютсяХарактеристикиНоменклатуры(ТекНоменклатура.Номенклатура);
		НайденнаяСтрока = НайтиСтрокуДереваЦен(ТекНоменклатура, КЭШ);
		Если НайденнаяСтрока <> Неопределено Тогда
			ЭлементНоменклатура = НайденнаяСтрока.СтрокаДереваЦен;
		Иначе
			ЭлементНоменклатура = ЭлементыДереваЦен.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементНоменклатура, ТекНоменклатура);
			ЭлементНоменклатура.ХарактеристикиИспользуются = ИспользуютсяХарактеристики;
			ЭлементНоменклатура.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(ЭлементНоменклатура);
			НоваяСтрокаТЗ = КЭШ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, ЭлементНоменклатура);
			НоваяСтрокаТЗ.СтрокаДереваЦен = ЭлементНоменклатура;
		КонецЕсли;
		
		Если ИспользуютсяХарактеристики Тогда
			Родитель = ЭлементНоменклатура;
			НайденнаяСтрокаХарактеристики = НайтиСтрокуДереваЦен(ТекНоменклатура, КЭШ, Истина);
			Если НайденнаяСтрокаХарактеристики <> Неопределено Тогда
				ЭлементНоменклатура = НайденнаяСтрокаХарактеристики.СтрокаДереваЦен;
			Иначе	
				ЭлементНоменклатура = ЭлементНоменклатура.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(ЭлементНоменклатура, ТекНоменклатура);
				ЭлементНоменклатура.ХарактеристикаНоменклатуры = ТекНоменклатура.ХарактеристикаНоменклатуры;
				ЭлементНоменклатура.ХарактеристикиИспользуются = ИспользуютсяХарактеристики;
				ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(ЭлементНоменклатура);
				НоваяСтрокаТЗ = КЭШ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, ЭлементНоменклатура);
				НоваяСтрокаТЗ.СтрокаДереваЦен = ЭлементНоменклатура
			КонецЕсли;		
			
		КонецЕсли;	
					
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьТаблицуНоменклатуры() Экспорт
	
	ТаблицаЗначений = Новый ТаблицаЗначений();
	
	ТаблицаЗначений.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаЗначений.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	МассивТипов = новый Массив;
	МассивТипов.Добавить("СправочникСсылка.ЕдиницаИзмерения");
	МассивТипов.Добавить("СправочникСсылка.КлассификаторЕдиницИзмерения");
	ТаблицаЗначений.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов(МассивТипов));	
	
	Возврат ТаблицаЗначений;
	
КонецФункции

&НаСервере
Функция НайтиСтрокуДереваЦен(ДанныеПоиска, КЭШ, ПоискХарактеристики = Ложь)

	Отбор = Новый Структура("Номенклатура, ЕдиницаИзмерения", ДанныеПоиска.Номенклатура, ДанныеПоиска.ЕдиницаИзмерения);
	Если ПоискХарактеристики Тогда
    	Отбор.Вставить("ХарактеристикаНоменклатуры", ДанныеПоиска.ХарактеристикаНоменклатуры);
	КонецЕсли;				
	
	МассивСтрок = КЭШ.НайтиСтроки(Отбор);
	Если МассивСтрок.Количество() > 0 Тогда
		Возврат МассивСтрок[0];			
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПоместитьЦеныВТабличнуюЧасть()
	
	Объект.Товары.Очистить();	
	
	ЭлементыНоменклатура = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого ТекЭлементНоменклатура Из ЭлементыНоменклатура Цикл
		
		ПоместитьСтрокуЦенВТабличнуюЧасть(ТекЭлементНоменклатура);
				
		ЭлементыХарактеристики = ТекЭлементНоменклатура.ПолучитьЭлементы();
		Для Каждого ТекЭлементХарактеристика Из ЭлементыХарактеристики Цикл
			
			ПоместитьСтрокуЦенВТабличнуюЧасть(ТекЭлементХарактеристика);
						
		КонецЦикла;
		
	КонецЦикла;		
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьСтрокуЦенВТабличнуюЧасть(СтрокаЦен)
	
	НоваяСтрока = Объект.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЦен);			
	
КонецПроцедуры

&НаСервере
Функция ИспользуютсяХарактеристикиНоменклатуры(Номенклатура)
	
	Возврат Справочники.Номенклатура.ИспользуютсяХарактеристикиНоменклатуры(Номенклатура);	
	
КонецФункции

&НаСервере
Функция ПолучитьСписокВидовНоменклатуры()
	
	Список = Новый СписокЗначений;
	Список.Добавить(Справочники.ВидыНоменклатуры.Материал);
	Список.Добавить(Справочники.ВидыНоменклатуры.Полотно);
	Список.Добавить(Справочники.ВидыНоменклатуры.Потолок);
	Список.Добавить(Справочники.ВидыНоменклатуры.Отрез);
	Список.Добавить(Справочники.ВидыНоменклатуры.Услуга);
	Возврат Список;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	//Отметка незаполненного у номенклатур с характеристиками
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЦенХарактеристикаНоменклатуры.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ИндексКартинки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ХарактеристикаНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина); 
	
	//Только просмотр для номенклатуры подчиненных элементов, чтобы только характеристику можно было изменить
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЦенНоменклатура.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ИндексКартинки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//Только просмотр для характеристики у родителя
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЦенХарактеристикаНоменклатуры.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ИндексКартинки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//Характеристика не используется
	УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма, "ДеревоЦенХарактеристикаНоменклатуры", "ДеревоЦен.ХарактеристикиИспользуются");
	
	//Подсветка операции Отмена
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВидОперации.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидОперации");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеХарактеристикНоменклатуры(Форма, ИмяПоляВводаХарактеристики, ПутьКПолюОтбора) Экспорт
						
	НовУсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = НовУсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаХарактеристики].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьИндексКартинкиСтрокиДереваЦен(СтрокаДереваЦен)
//	
//	Если ТипЗнч(СтрокаДереваЦен) = Тип("ДанныеФормыЭлементДерева") Тогда
//		Если СтрокаДереваЦен.ПолучитьРодителя() = Неопределено Тогда
//			СтрокаДереваЦен.ИндексКартинки = 0;
//			Если СтрокаДереваЦен.Номенклатура.ПометкаУдаления Тогда
//				СтрокаДереваЦен.ИндексКартинки = 1;
//			КонецЕсли;
//		Иначе
//			СтрокаДереваЦен.ИндексКартинки = 2;
//			Если СтрокаДереваЦен.ХарактеристикаНоменклатуры.ПометкаУдаления Тогда
//				СтрокаДереваЦен.ИндексКартинки = 3;
//			КонецЕсли;
//		КонецЕсли;
//	ИначеЕсли ТипЗнч(СтрокаДереваЦен) = Тип("СтрокаДереваЗначений") Тогда
//		Если СтрокаДереваЦен.Родитель = Неопределено Тогда
//			СтрокаДереваЦен.ИндексКартинки = 0;
//			Если СтрокаДереваЦен.Номенклатура.ПометкаУдаления Тогда
//				СтрокаДереваЦен.ИндексКартинки = 1;
//			КонецЕсли;
//		Иначе
//			СтрокаДереваЦен.ИндексКартинки = 2;
//			Если СтрокаДереваЦен.ХарактеристикаНоменклатуры.ПометкаУдаления Тогда
//				СтрокаДереваЦен.ИндексКартинки = 3;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Функция ПолучитьИндексКартинкиСтрокиДереваЦен(СтрокаДереваЦен)
//	
//	ИндексКартинки = 0;
//	Если ТипЗнч(СтрокаДереваЦен) = Тип("ДанныеФормыЭлементДерева") Тогда
//		Если СтрокаДереваЦен.ПолучитьРодителя() = Неопределено Тогда
//			ИндексКартинки = 0;
//			Если СтрокаДереваЦен.Номенклатура.ПометкаУдаления Тогда
//				ИндексКартинки = 1;
//			КонецЕсли;
//		Иначе
//			ИндексКартинки = 2;
//			Если СтрокаДереваЦен.ХарактеристикаНоменклатуры.ПометкаУдаления Тогда
//				ИндексКартинки = 3;
//			КонецЕсли;
//		КонецЕсли;
//	ИначеЕсли ТипЗнч(СтрокаДереваЦен) = Тип("СтрокаДереваЗначений") Тогда
//		Если СтрокаДереваЦен.Родитель = Неопределено Тогда
//			ИндексКартинки = 0;
//			Если СтрокаДереваЦен.Номенклатура.ПометкаУдаления Тогда
//				ИндексКартинки = 1;
//			КонецЕсли;
//		Иначе
//			ИндексКартинки = 2;
//			Если СтрокаДереваЦен.ХарактеристикаНоменклатуры.ПометкаУдаления Тогда
//				ИндексКартинки = 3;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат ИндексКартинки;
//	
//КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАльтернативнуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.АльтернативнаяЕдиницаИзмерения;
КонецФункции

&НаСервере
Функция УстановитьВидимость()
	
	Элементы.ДеревоЦенГруппаСпособУточненияЦены.Видимость = НЕ Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена;
	Элементы.МатериалыГруппаЦены.Видимость = НЕ Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена;
	
	Элементы.ГруппаЦеныНоменклатуры.Видимость = Объект.ИндивидуальныеЦеныНоменклатуры;
	Элементы.ГруппаЦеныУслугРаскроя.Видимость = Объект.ИндивидуальныеЦеныРаскроя
	                                            И НЕ Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена;
												
	Элементы.ГруппаЦеныНаПродукцию.Видимость = Объект.ИндивидуальныеЦеныНаПродукцию;
	
КонецФункции

#КонецОбласти

