&НаКлиенте
Перем мПредыдущийИдентификатор;

&НаКлиенте
Перем РазрешитьРедактированиеСтроки;

&НаКлиенте
Перем мСпецификация;

&НаКлиенте
Перем мНоменклатура;

&НаКлиенте
Перем СтрокаМатериаловДобавлена;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	УстановитьЗаголовокФормы();
	
	ВключитьПредпросмотрФайлов = НЕ Константы.ВыключитьПредпросмотрПрикрепленныхФайловВДокументах.Получить();
	Элементы.ГруппаФайлыПредпросмотр.Видимость = ВключитьПредпросмотрФайлов;
	
	УОТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	
	ИспользоватьКонтрольКратности = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольКратностиЕдиницИзмерения");
	
	ОтключитьДоступностьГруппыПечать = Ложь;
	Если Параметры.Ключ.Пустая() Тогда
		ЭтоНовый = Истина;
		НомерЛида = ПолучитьНомерЛидаОснования();
		
		ДатаСоздания = ТекущаяДатаСеанса();
		
		ПриСозданииЧтенииНаСервере();
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
		ЭтоНовый = Ложь;
		
		СтруктураСоглашениеОРасторжении = Документы.ЗаказДоговор.ЕстьСоглашениеОРасторжении(Объект.Ссылка);
		СоглашениеОРасторженииДоговора = СтруктураСоглашениеОРасторжении.Документ;
		Если НЕ ЭтаФорма.ТолькоПросмотр И СтруктураСоглашениеОРасторжении.ЕстьСоглашениеОРасторжении Тогда
			ТолькоПросмотр = Истина;
			ОтключитьДоступностьГруппыПечать = Истина;
		КонецЕсли;
		//1.1.1.0
		Если НЕ ЭтаФорма.ТолькоПросмотр Тогда
			ОбщийМодульВызовСервера.ЗаблокироватьОбъектДляРедактирования(Объект.Ссылка, ЭтаФорма, Элементы.ПодменюСоздатьНаОсновании);
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураДействийПоСпецификациям = ОбщийМодульСервер.СтруктураДействийПоСпецификациямВЗаказДоговоре();
	СтруктураДействийПоСТ = СопутствующиеТоварыСервер.СтруктураДействийПоСопутствующимТоварамВРознице();
	
	//++15925
	СтруктураСпособовДобавленияПродукции = ОбщийМодульСервер.СтруктураСпособовДобавленияПродукции();
	Элементы.ДеревоТоваровЗагрузитьПотолокИзEasyCeiling.Видимость = СтруктураСпособовДобавленияПродукции.СпособДобавленияПродукцииЗагрузитьИзПостроителя; 
	Элементы.ДеревоТоваровДобавитьУстановкуПотолка.Видимость = СтруктураСпособовДобавленияПродукции.СпособДобавленияПродукцииВыбратьПотолок;
	Элементы.ДеревоТоваровДобавитьПотолок.Видимость = СтруктураСпособовДобавленияПродукции.СпособДобавленияПродукцииСоздатьПотолок;
	Элементы.ДеревоТоваровДобавитьПродукцию.Видимость = СтруктураСпособовДобавленияПродукции.СпособДобавленияПродукцииСоздатьПродукцию;
	Элементы.ДеревоТоваровДобавитьКонструкцию.Видимость = СтруктураСпособовДобавленияПродукции.СпособДобавленияПродукцииСоздатьКонструкцию;
	//--15925
	
	//ПроверитьОтсутствиеКомнатВМатериалах(); убрано в процедуру ПерестроитьДеревоНаФорме
		
	//построим дерево
	ПерестроитьДеревоНаФорме();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаПодвалПрочее);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	//#8481
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияЗаказа, "Заказ", Объект.Ссылка, , , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаЗвонокЗамерщику, "Замерщику");
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ДоступнаУстановкаПроцентаЗамерщику, 
							|ДополнительныеПраваЗапретРедактированияЦенВДокументах, ДополнительныеПраваЗапретПримененияСкидок,
							|РазрешеноМенятьДатуЗаказДоговора, РазрешитьНулевыеЦены, РазрешеноМенятьМенеджераВЗаказДоговоре");
	
	Элементы.КомандаПроцентЗамерщику.Видимость = РеквизитыПользователя.ДоступнаУстановкаПроцентаЗамерщику;
	Если Элементы.ГруппаЗвонокЗамерщику.ПодчиненныеЭлементы.Количество() = 0 И НЕ Элементы.КомандаПроцентЗамерщику.Видимость Тогда
		Элементы.ИсполнительЗамера.АвтоМаксимальнаяШирина = Истина;
	ИначеЕсли Элементы.ГруппаЗвонокЗамерщику.ПодчиненныеЭлементы.Количество() = 0 И Элементы.КомандаПроцентЗамерщику.Видимость Тогда
		Элементы.ИсполнительЗамера.АвтоМаксимальнаяШирина = Ложь;
		Элементы.ИсполнительЗамера.МаксимальнаяШирина = 30;
	ИначеЕсли Элементы.ГруппаЗвонокЗамерщику.ПодчиненныеЭлементы.Количество() > 0 И Элементы.КомандаПроцентЗамерщику.Видимость Тогда
		Элементы.ИсполнительЗамера.АвтоМаксимальнаяШирина = Ложь;
		Элементы.ИсполнительЗамера.МаксимальнаяШирина = 26;
	ИначеЕсли Элементы.ГруппаЗвонокЗамерщику.ПодчиненныеЭлементы.Количество() > 0 И НЕ Элементы.КомандаПроцентЗамерщику.Видимость Тогда
		Элементы.ИсполнительЗамера.АвтоМаксимальнаяШирина = Ложь;
		Элементы.ИсполнительЗамера.МаксимальнаяШирина = 36;
	КонецЕсли;
	
	//управление доступностью элементов
	Если РеквизитыПользователя.ДополнительныеПраваЗапретРедактированияЦенВДокументах Тогда
		МассивИменЭлементов = Документы.ЗаказДоговор.ПолучитьМассивРеквизитовПоЦенам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
	//#7771
	Если РеквизитыПользователя.ДополнительныеПраваЗапретПримененияСкидок Тогда
		МассивИменЭлементов = Документы.ЗаказДоговор.ПолучитьМассивРеквизитовПоСкидкам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
	
	//Изменять дату можно только у нового документа либо с разрешением
	Если ЗначениеЗаполнено(Объект.Ссылка) И НЕ РеквизитыПользователя.РазрешеноМенятьДатуЗаказДоговора Тогда
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	ПроверитьСоответствиеМонтажей();
	
	ПереключательНаНазваниеКомнат = Константы.ИспользоватьСправочникКомнатВРознице.Получить();
	
	RVY_ИспользоватьИнтеграцию = Константы.RVY_ИспользоватьИнтеграцию.Получить();
	
	Если РольДоступна("ОтчетПредварительнаяСебестоимостьЗаказДоговораПросмотр") 
		или РольДоступна("АдминистраторСистемы") 
		или РольДоступна("ПолныеПрава") Тогда
		Элементы.ФормаПредварительныйРасчет.Видимость = Истина;
	Иначе
		Элементы.ФормаПредварительныйРасчет.Видимость = Ложь;
	КонецЕсли;
	
	УправлениеФормойПоВидуЗаказа();
	УправлениеФормойПоЗаказу();
	
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию, , 32);
		
	Элементы.ДеревоТоваровБесплатно.ТолькоПросмотр = НЕ РеквизитыПользователя.РазрешитьНулевыеЦены;
	
	//++ №11768
	//Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Лид") И ЗначениеЗаполнено(Объект.Основание) Тогда
	//	ИмяКлиентаЛида = Объект.Основание.ИмяКлиента;
	//	АдресКлиентаЛида = Объект.Основание.Адрес;
	//	СуммаДоговораНаЗамере = Объект.Основание.ПоследняяСуммаДоговораНаЗамере;
	//КонецЕсли;
	ОбновитьИнформациюПоЗамеруЛида();
	//-- №11768
	
	ОбновитьДопИнформацию();
	
	Элементы.ФормаПеревестиДокументВВерсию20.Доступность = НЕ Объект.ЗаполнятьУИСтрок;
	
	ИспользоватьПодключаемоеОборудование = Константы.ИспользоватьПодключаемоеОборудование.Получить();
	
	ОбщийМодульСервер.ДобавитьИндикаторРаботыСоСканерамиШК(ЭтотОбъект);
	
	Элементы.ДопИнфоПлощадьПотолка.Заголовок = "";
	
	//#5456
	ЗаполнениеМатериаловПоЗаказам = (Объект.СлужебныйЗаполнениеМатериаловРозницы = 0);
	Элементы.ГруппаМатериалы.Видимость 			 = ЗаполнениеМатериаловПоЗаказам;
	Элементы.ДеревоТоваровСпецификация.Видимость = ЗаполнениеМатериаловПоЗаказам;
	
	//#5456
	// при переходе на 3.1 перенесено в процедуры формирования меню
	//ФлагСоздатьНаОсновании = ПолучитьФункциональнуюОпцию("ОбеспеченностьРозницыПоЗаказДоговорам");
	//Элементы.ФормаОформитьЗаказПокупателя.Видимость = ФлагСоздатьНаОсновании И ПравоДоступа("Изменение", Метаданные.Документы.ЗаказПокупателя);
	//Элементы.ФормаОформитьЗаказПоставщику.Видимость = ФлагСоздатьНаОсновании И ПравоДоступа("Изменение", Метаданные.Документы.ЗаказПоставщику);
	//Если ПравоДоступа("Изменение", Метаданные.Документы.ПоступлениеТоваровИУслуг) Тогда // проверка для типовой команды
	//	Элементы.ФормаДокументПоступлениеТоваровИУслугСоздатьНаОсновании.Видимость = ФлагСоздатьНаОсновании;
	//КонецЕсли;
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("ДеревоТоваровНоменклатураАртикул");
	МассивЭлементов.Добавить("ДеревоМатериаловНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
	Если ОтключитьДоступностьГруппыПечать Тогда
		Элементы.ПодменюПечать.Доступность = Ложь;
		Элементы.ДеревоТоваров.ТолькоПросмотр = Истина;
		Элементы.ДеревоМатериалов.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	УстановитьОтметкуНезаполненногоИсполнителяЗамера();
	УстановитьОтметкуНезаполненногоАдреса();
	
	ЗаполнитьСсылкиНаМонтажи(); // №9868
	
	ИспользоватьКартыЯндекс = НЕ ПустаяСтрока(Константы.КлючAPIЯндексКарты.Получить());
	Если ИспользоватьКартыЯндекс 
		ИЛИ Константы.ИспользуетсяМобильныйКлиентЗамерщика.Получить()
		ИЛИ Константы.ИспользуетсяМобильныйКлиентМонтажника.Получить()
		Тогда
		Элементы.УказатьГеометку.Видимость = Истина;
		ОбновитьКратинкуКнопкиГеометкиВШапкеДокумента();
	Иначе 
		Элементы.УказатьГеометку.Видимость = Ложь;
	КонецЕсли;
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	ВидСпецификацииПоУмолчанию = Перечисления.ВидыСпецификации.СопутствующиеМатериалы;
	
	//#13943
	Элементы.Менеджер.ТолькоПросмотр = НЕ РеквизитыПользователя.РазрешеноМенятьМенеджераВЗаказДоговоре;
	
	ДоговорДоИзменения = Объект.ДоговорКонтрагента; // №14073
	
	//#14675
	УчетОбеспеченностиРозницыПоКомнатам = Константы.УчетОбеспеченностиРозницыПоКомнатам.Получить();
	Элементы.ДеревоТоваровЗаказано.Видимость = УчетОбеспеченностиРозницыПоКомнатам;
	Элементы.ДеревоМатериаловЗаказано.Видимость = УчетОбеспеченностиРозницыПоКомнатам;
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьКолонкуГрафикОплатОплачено();
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ЭтоРекламация = (Объект.ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Рекламация"));
	
	ЗаполнитьСтавкуНДСПоОрганизацииСервер();
	ИспользоватьАвтоматическиеСкидки = ПолучитьЗначениеКонстантыАвтоматическихСкидок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	//мИспользоватьАвтоматическиеСкидки = ПолучитьЗначениеКонстантыАвтоматическихСкидок();
	ОбновитьОтображениеЭлементовФормы();
	РазвернутьДеревоМатериалов();
	
	//ОбновитьКолонкуГрафикОплатОплачено();
	
	Если НЕ Объект.ЗаполнятьУИСтрок Тогда
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " (Версия документа 1.1)";
	КонецЕсли;
	
	//Если НЕ ТолькоПросмотр Тогда // #10508  // закомментировано: перенесено в параметр функции
	РассчитатьИтоговыеПоказателиКлиент(ТолькоПросмотр);
	//КонецЕсли;
	
	//#13148
	Если RVY_ИспользоватьИнтеграцию Тогда
		RVY_ОбновитьСтатус();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЭтоРекламация Тогда
		Для Каждого СтрокаКомнаты из ДеревоТоваров.ПолучитьЭлементы() Цикл		
			Для Каждого СтрокаТовара Из СтрокаКомнаты.ПолучитьЭлементы() Цикл
				СтрокаТовара.Цена = 0;
				СтрокаТовара.ЦенаПоПрайсу = 0;
				СтрокаТовара.Сумма = 0;
				СтрокаТовара.СуммаПоПрайсу = 0;
				СтрокаТовара.ПроцентСкидки = 0;
				СтрокаТовара.СуммаСкидки = 0;
				СтрокаТовара.СуммаНДС = 0;
			КонецЦикла;
		КонецЦикла;
		РассчитатьИтоговыеПоказателиКлиент();
	КонецЕсли;

	ПеренестиДеревоВТабличнуюЧасть();
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Контрагент""", , "Контрагент", "Объект", Отказ);
		КонецЕсли;
		// перенесено в ОбработкаПроверкиЗаполнения
		//Если ПустаяСтрока(Объект.Адрес) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан адрес по договору", , "Адрес", "Объект", Отказ);
		//КонецЕсли;
		Если Объект.ГрафикОплат.Количество() > 0 Тогда
			Если НЕ Объект.ГрафикОплат.Итог("Сумма") = Объект.СуммаДокумента Тогда
				Сообщить("Итоговая сумма по графику оплат не совпадает с суммой документа!",СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		// №6303 закомментировано - переведен в документ "Расторжение договора"
		//Если Объект.ДоговорРассторгнут Тогда
		//	Если ПустаяСтрока(Объект.ПричинаРассторженияДоговора) Тогда
		//		Сообщить("Не указана причина рассторжения договора");
		//		Отказ = Истина;
		//	КонецЕсли;
		//КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.НомерДоговора) Тогда
		Если АвтоматическиПрисваиватьНомерДоговораВЗаказДоговоре() Тогда
			//Объект.НомерДоговора = ОбщийМодуль.ПолучитьНовыйНомерДоговораРозницы();
			Объект.НомерДоговора = ОбщийМодуль.ПолучитьНовыйНомерДоговораРозницыПоШаблону(Объект.Организация, Объект.Дата, Объект.Основание);
		КонецЕсли;
	КонецЕсли;
	
	// №6303 закомментировано - переведен в документ "Расторжение договора"
	//// Проверка на перевод в статус расторгнут
	//Если НЕ Объект.Ссылка.Пустая() И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен") Тогда
	//	
	//	Статусы = новый Массив;
	//	Статусы.Добавить(ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Выполнен"));
	//	Статусы.Добавить(ПредопределенноеЗначение("Справочник.РезультатыМонтажа.ЧастичноВыполнен"));
	//	Статусы.Добавить(ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Закрыт"));
	//	
	//	ВыполненныеМонтажи = ПолучитьМонтажиВСтатусе(Статусы);
	//	
	//	Если ВыполненныеМонтажи.Количество() > 0 Тогда
	//		Отказ = Истина;
	//		ПоказатьПредупреждение(, "По заказ-договору имеются выполненные (закрытые) монтажи. Перевеод в статус ""Растрогнут"" отменен.");			
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Статусы.Очистить();
	//	Статусы.Добавить(ПредопределенноеЗначение("Справочник.РезультатыМонтажа.ВРаботе"));
	//	
	//	МонтажиВРаботе = ПолучитьМонтажиВСтатусе(Статусы);
	//	
	//	Если МонтажиВРаботе.Количество() > 0 Тогда
	//		Отказ = Истина;
	//		ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОбОтменеМонтажейВРаботе", ЭтотОбъект, новый Структура("МонтажиВРаботе", МонтажиВРаботе)), "По заказ-договору имеются монтажи в работе. Для перевода в статус ""Отменен"" необходимо их отменить.
	//			|Отменить монтажи по данному заказ-договору в работе?", РежимДиалогаВопрос.ДаНет);
	//		Возврат;			
	//	КонецЕсли;
	//	
	//КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	//#16345
	Если ИспользоватьКонтрольКратности Тогда
		ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(Отказ, Объект, Перечисления.ВидыДокументовПроверкиКратности.ЗаказКлиента);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЕстьИзмененияВТЧ = Ложь;
	Для каждого СтрокаТЧ из Объект.ТоварыУслуги Цикл
		СтруктураПоиска = ПолучитьСтруктуруСтрокиТЧ();
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
	 	НайденныеСтроки = Объект.Ссылка.ТоварыУслуги.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			ЕстьИзмененияВТЧ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЕстьИзмененияВТЧ Тогда
		Для каждого СтрокаТЧ из Объект.Ссылка.ТоварыУслуги Цикл
			СтруктураПоиска = ПолучитьСтруктуруСтрокиТЧ();
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
			НайденныеСтроки = Объект.ТоварыУслуги.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ЕстьИзмененияВТЧ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Если Объект.Ссылка.Пустая() Тогда
		Если ПолучитьФункциональнуюОпцию("ОграничитьВыборТоваровВЗаказДоговор") Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("МассивНоменклатуры", Объект.ТоварыУслуги.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
			Запрос.УстановитьПараметр("Назначение", 1);
			Запрос.Текст = ОбщийМодульСервер.ПолучитьТекстЗапросаРазрешеннаяНоменклатураРозницы();
			// №7114 комментируем, т.к. этот запрос не учитывает группы номенклатуры и дублируется ниже
			//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//|	ДанныеСправочника.Ссылка КАК Ссылка
			//|ИЗ
			//|	Справочник.Номенклатура КАК ДанныеСправочника
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазрешеннаяНоменклатураРозницы КАК РазрешеннаяНоменклатураРозницы
			//|		ПО (РазрешеннаяНоменклатураРозницы.Номенклатура = ДанныеСправочника.Ссылка)
			//|ГДЕ
			//|	ДанныеСправочника.Ссылка В(&МассивНоменклатуры)
			//|	И ДанныеСправочника.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга))
			//|	И РазрешеннаяНоменклатураРозницы.Номенклатура ЕСТЬ NULL";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекстСообщения = "В списке товаров имеется неразрешенная позиция: " + Выборка.Ссылка;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЦикла;
						
		КонецЕсли;
		Если ПолучитьФункциональнуюОпцию("ОграничитьВыборМатериаловВЗаказДоговор") Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("МассивНоменклатуры", Объект.Материалы.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
			Запрос.УстановитьПараметр("Назначение", 2);
			Запрос.Текст = ОбщийМодульСервер.ПолучитьТекстЗапросаРазрешеннаяНоменклатураРозницы();
			// №7114 комментируем, т.к. этот запрос не учитывает группы номенклатуры и дублируется выше
			//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//|	ДанныеСправочника.Ссылка КАК Ссылка
			//|ИЗ
			//|	Справочник.Номенклатура КАК ДанныеСправочника
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазрешеннаяНоменклатураРозницы КАК РазрешеннаяНоменклатураРозницы
			//|		ПО (РазрешеннаяНоменклатураРозницы.Номенклатура = ДанныеСправочника.Ссылка)
			//|ГДЕ
			//|	ДанныеСправочника.Ссылка В(&МассивНоменклатуры)
			//|	И ДанныеСправочника.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга))
			//|	И РазрешеннаяНоменклатураРозницы.Номенклатура ЕСТЬ NULL";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекстСообщения = "В списке материалов имеется неразрешенная позиция: " + Выборка.Ссылка;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЦикла;

		КонецЕсли;
	КонецЕсли; 	
		
	//проверки
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ДеревоТовары = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
		ДеревоМатериалы = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
		
		Для Каждого ТекущаяКомната из ДеревоТовары.Строки Цикл
			Для Каждого ТекущаяНоменклатура из ТекущаяКомната.Строки Цикл
				
				Если НЕ ЭтоРекламация Тогда
					ТекстСообщения = ("Товары и услуги. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указана цена");
					СтруктураПараметров = Новый Структура("Ссылка, ТабличнаяЧасть, ИмяТабличнойЧасти, ТекстСообщения", Объект.Ссылка, "ТоварыУслуги", "", ТекстСообщения);
					ОбработкаТабличныхЧастейСервер.ПроверитьЦенуСтроки(ТекущаяНоменклатура, СтруктураПараметров, Отказ);
				КонецЕсли;
				
				Если ТекущаяНоменклатура.Количество = 0 Тогда
					ТекстСообщения = "Товары и услуги. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не заполнено поле ""Количество""";
					//Отказ = Истина;
					//Сообщить(ТекстСообщения);
					ПолеДанных = "ДеревоТоваров"; //[" + Формат(1, "ЧГ=0") + "].Количество";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, , ПолеДанных, Отказ);
				КонецЕсли;
				Если ПустаяСтрока(ТекущаяНоменклатура.ЕдиницаИзмерения) Тогда
					Отказ = Истина;
					Сообщить("Товары и услуги. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указана единица измерения");
				КонецЕсли;
				Если ТекущаяНоменклатура.Коэффициент = 0 Тогда
					Отказ = Истина;
					Сообщить("Товары и услуги. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указан коэффициент единицы измерения");
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
		Для Каждого ТекущаяКомната из ДеревоМатериалы.Строки Цикл
			Для Каждого ТекущаяНоменклатура из ТекущаяКомната.Строки Цикл
				Если ТекущаяНоменклатура.Количество = 0 Тогда
					Отказ = Истина;
					Сообщить("Материалы. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указано количество");
				КонецЕсли;
				Если ПустаяСтрока(ТекущаяНоменклатура.ЕдиницаИзмерения) Тогда
					Отказ = Истина;
					Сообщить("Материалы. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указана единица измерения");
				КонецЕсли;
				Если ТекущаяНоменклатура.Коэффициент = 0 Тогда
					Отказ = Истина;
					Сообщить("Материалы. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указан коэффициент единицы измерения");
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Отказ И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ Объект.Ссылка.Пустая() Тогда
		
		СтруктураПроверки = Документы.ЗаказДоговор.ВсеТоварыПоЗаказуОтгружены1(Объект.Ссылка, Объект.ТоварыУслуги);
		Отказ = НЕ СтруктураПроверки.Результат;
		
		Если Отказ Тогда
			Сообщить(СтруктураПроверки.Описание, СтатусСообщения.Важное);
			Сообщить("Документ не проведен");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	//Проверка на полную отгрузку по документу
	Если НЕ Отказ И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Объект.ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.Выполнен Тогда
		
		СтруктураПроверки = Документы.ЗаказДоговор.ВсеТоварыПоЗаказуОтгружены2(Объект.Ссылка, Объект.ТоварыУслуги);
		Отказ = НЕ СтруктураПроверки.Результат;
		
		Если Отказ Тогда
			Сообщить(СтруктураПроверки.Описание, СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДатаСоздания", ДатаСоздания);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОтменеМонтажейВРаботе(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		//Необходимо перевести монтажи в работе в статус "Отменен"
		ПеревестиМонтажиВРаботеВСтатусОтменен(ДопПараметры.МонтажиВРаботе);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеревестиМонтажиВРаботеВСтатусОтменен(МонтажиВРаботе)
	
	Успешно = Истина;
	
	Для Каждого Монтаж Из МонтажиВРаботе Цикл
		ДокОбъект = Монтаж.ПолучитьОбъект();
		ДокОбъект.Результат = Справочники.РезультатыМонтажа.Отменен;
		Попытка
			ДокОбъект.Записать();
		Исключение
			Успешно = Ложь;
			Сообщить("Ошибка при переводе монтажа " + Монтаж + " в статус ""Отменен"": " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;	
		
	Если Успешно Тогда
		Сообщить("Монтажи в работе успешно переведены в статус ""Отменен"".");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМонтажиВСтатусе(Статусы)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Монтажи.Ссылка
		|ИЗ
		|   Документ.Монтаж КАК Монтажи
		|ГДЕ
		|   Монтажи.Основание = &ЗаказДоговор
		|	И Монтажи.Результат В (&Статусы)
		|	И НЕ Монтажи.ПометкаУдаления";
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.Ссылка);
	
	Запрос.УстановитьПараметр("Статусы", Статусы);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьТекущегоДолгаКонтрагента();
	//Если ПроверитьНеобходимостьОтменыМонтажей Тогда
	//	Если Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен") Тогда
	//		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбОтменеМонтажей", ЭтаФорма, Параметры);
	//		ПоказатьВопрос(Оповещение, "Отменить все запланированные но не выполненные монтажи по договору?", РежимДиалогаВопрос.ДаНет, 0);
	//	КонецЕсли;
	//КонецЕсли;

	РазвернутьДеревоТоваров();
	РазвернутьДеревоМатериалов();
	
	Если НЕ Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено Тогда 
		ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
		ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
		ОбновитьОтображениеЭлементовФормы(ТекущаяКомната, ТекущаяНоменклатура);
	Иначе 
		ОбновитьОтображениеЭлементовФормы();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияЗаказа, "Заказ", Объект.Ссылка, , , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Элементы.ИсторияЗаказа.Обновить();
	
	// №5574 занести запись о соответствии в регистр
	ЗанестиЗаписьОСоответствииЗаказДоговору();
	
	Если ЕстьИзмененияВТЧ Тогда
		Оповестить("ОбновлениеТЧТоварыИУслугиЗаказДоговора",,Объект.Ссылка);
	КонецЕсли;
	
	Если ЭтоНовый Тогда		
		Если Объект.Ссылка.Пустая() Тогда 
			Оповестить("ЗаказДоговорНеСоздан",НомерЛида);
		Иначе
			Оповестить("ЗаказДоговорСоздан",НомерЛида);
		КонецЕсли;
		ЭтоНовый = Ложь;
	КонецЕсли;
	Оповестить("ЗакрытаФормаЗаказДоговора",,"ЗаказДоговор");

КонецПроцедуры

&НаСервере
Процедура ЗанестиЗаписьОСоответствииЗаказДоговору()
	
	ПолностьюСоответствуют = Истина;
	МассивМонтажейНеСоответствуют = новый Массив;
		
	//++16703
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтажи.Ссылка КАК Монтаж
	|ИЗ
	|	Документ.Монтаж КАК Монтажи
	|ГДЕ
	|	Монтажи.Основание = &ЗаказДоговор
	|	И НЕ Монтажи.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Отменен)
	|	И НЕ Монтажи.ПометкаУдаления";
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.Ссылка);
	ВыборкаМонтажи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаМонтажи.Количество() >  0 Тогда
		Пока ВыборкаМонтажи.Следующий() Цикл	
			МонтажОбъект = ВыборкаМонтажи.Монтаж.ПолучитьОбъект();
			Если Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Договор и НЕ (МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Монтаж  ИЛИ МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Продажа) Тогда
				ПолностьюСоответствуют = Ложь;
				МассивМонтажейНеСоответствуют.Добавить(ВыборкаМонтажи.Монтаж);
			КонецЕсли;
			Если Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Продажа и НЕ МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Продажа Тогда
				ПолностьюСоответствуют = Ложь;
				МассивМонтажейНеСоответствуют.Добавить(ВыборкаМонтажи.Монтаж);
			КонецЕсли;
			Если Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Рекламация и НЕ (МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Рекламация  ИЛИ МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Продажа) Тогда
				ПолностьюСоответствуют = Ложь;
				МассивМонтажейНеСоответствуют.Добавить(ВыборкаМонтажи.Монтаж);
			КонецЕсли;
			Если Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.СервиснаяЗаявка и НЕ (МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.СервиснаяЗаявка ИЛИ МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Продажа) Тогда
				ПолностьюСоответствуют = Ложь;
				МассивМонтажейНеСоответствуют.Добавить(ВыборкаМонтажи.Монтаж);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	//--16703
	
	// Получим данные монтажей для сверки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыУслугиМонтажа.Ссылка,
	|	ТоварыУслугиМонтажа.УИСтроки,
	|	ТоварыУслугиМонтажа.Комната,
	|	ТоварыУслугиМонтажа.Номенклатура,
	|	ТоварыУслугиМонтажа.ХарактеристикаНоменклатуры,
	|	ТоварыУслугиМонтажа.Цена,
	|	ТоварыУслугиМонтажа.ПроцентСкидки,
	|	СУММА(ТоварыУслугиМонтажа.Количество * ТоварыУслугиМонтажа.Коэффициент) КАК Количество,
	|	СУММА(ТоварыУслугиМонтажа.Сумма) КАК Сумма,
	|	СУММА(ТоварыУслугиМонтажа.СуммаСкидки) КАК СуммаСкидки
	|ИЗ
	|	Документ.Монтаж.ТоварыУслуги КАК ТоварыУслугиМонтажа
	|ГДЕ
	|	ТоварыУслугиМонтажа.Ссылка.Основание = &ЗаказДоговор
	|	И НЕ ТоварыУслугиМонтажа.Ссылка.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Отменен)
	|	И НЕ ТоварыУслугиМонтажа.Ссылка.ПометкаУдаления
	// #12246
	//|	И ТоварыУслугиМонтажа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Монтаж) //#БезЗаявки. теперь сверяем для всех видов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыУслугиМонтажа.Ссылка,
	|	ТоварыУслугиМонтажа.УИСтроки,
	|	ТоварыУслугиМонтажа.Комната,
	|	ТоварыУслугиМонтажа.Номенклатура,
	|	ТоварыУслугиМонтажа.ХарактеристикаНоменклатуры,
	|	ТоварыУслугиМонтажа.Цена,
	|	ТоварыУслугиМонтажа.ПроцентСкидки
	|
	|ИТОГИ ПО ТоварыУслугиМонтажа.Ссылка";
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.Ссылка);
	ВыборкаМонтажи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	
	// Если есть монтажи, подготовим позиции ЗД для сверки
	Если ВыборкаМонтажи.Количество() > 0 Тогда
		
		ТаблицаТоваровИУслуг = Новый ТаблицаЗначений;
		ТаблицаТоваровИУслуг.Колонки.Добавить("УИСтроки");
		ТаблицаТоваровИУслуг.Колонки.Добавить("Комната");
		ТаблицаТоваровИУслуг.Колонки.Добавить("Номенклатура");
		ТаблицаТоваровИУслуг.Колонки.Добавить("Количество");
		ТаблицаТоваровИУслуг.Колонки.Добавить("Сумма");
		ТаблицаТоваровИУслуг.Колонки.Добавить("Цена");
		ТаблицаТоваровИУслуг.Колонки.Добавить("ПроцентСкидки");
		ТаблицаТоваровИУслуг.Колонки.Добавить("СуммаСкидки");
		ТаблицаТоваровИУслуг.Колонки.Добавить("ХарактеристикаНоменклатуры");
		
		ВремДеревоТоваров = РеквизитФормыВЗначение("ДеревоТоваров");
		Для Каждого СтрокаКомнаты Из ВремДеревоТоваров.Строки Цикл
			Для Каждого СтрокаНоменклатуры Из СтрокаКомнаты.Строки Цикл
				НоваяСтрока = ТаблицаТоваровИУслуг.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНоменклатуры);
				НоваяСтрока.Количество = СтрокаНоменклатуры.Количество * СтрокаНоменклатуры.Коэффициент;
			КонецЦикла;
		КонецЦикла;
		
		ТаблицаТоваровИУслуг.Свернуть("УИСтроки, Комната, Номенклатура, Цена, ПроцентСкидки, ХарактеристикаНоменклатуры", "Количество, Сумма, СуммаСкидки");
		ТаблицаТоваровИУслуг.Колонки.Добавить("Разобран", Новый ОписаниеТипов("Булево"));
		
	КонецЕсли;	
	
	// Сверяем по монтажам
	Пока ВыборкаМонтажи.Следующий() Цикл
		
		ВыборкаПозицийМонтажа = ВыборкаМонтажи.Выбрать();
		
		Пока ВыборкаПозицийМонтажа.Следующий() Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("УИСтроки", ВыборкаПозицийМонтажа.УИСтроки);
			Отбор.Вставить("Комната", ВыборкаПозицийМонтажа.Комната);
			Отбор.Вставить("Номенклатура", ВыборкаПозицийМонтажа.Номенклатура);
			Отбор.Вставить("Цена", ВыборкаПозицийМонтажа.Цена);
			Отбор.Вставить("ПроцентСкидки", ВыборкаПозицийМонтажа.ПроцентСкидки);
			Отбор.Вставить("ХарактеристикаНоменклатуры", ВыборкаПозицийМонтажа.ХарактеристикаНоменклатуры);
			Отбор.Вставить("Количество", ВыборкаПозицийМонтажа.Количество);
			Отбор.Вставить("Сумма", ВыборкаПозицийМонтажа.Сумма);
			Отбор.Вставить("СуммаСкидки", ВыборкаПозицийМонтажа.СуммаСкидки);
			Отбор.Вставить("Разобран", Ложь);
			НайденныеСтроки = ТаблицаТоваровИУслуг.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 тогда
				МассивМонтажейНеСоответствуют.Добавить(ВыборкаМонтажи.Ссылка);
				ПолностьюСоответствуют = Ложь;
				Прервать;
			Иначе
				НайденныеСтроки[0].Разобран = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	// если не соответствует Монтажам, нужно записать в регистр
	// если соответствует, удалить записи из регистра
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.СоответствиеДоговораИМонтажей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаказДоговор.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	// Соответствует
	Если ПолностьюСоответствуют Тогда			
		
		// Очищаем записи по ЗД
		НаборЗаписей.Записать();
		
	Иначе // Не соответствует
		
		Для Каждого ТекущаяМонтаж Из МассивМонтажейНеСоответствуют Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ЗаказДоговор = Объект.Ссылка;
			НоваяЗапись.Монтаж = ТекущаяМонтаж;			
						
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьЗаголовокФормы();
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	Если Объект.Проведен Тогда
		//ЭтаФорма.ИспользоватьРежимПроведения=ИспользованиеРежимаПроведения.Неоперативный;
		ПроверитьСоответствиеМонтажей();
	КонецЕсли;
	
	ОбновитьКолонкуГрафикОплатОплачено();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
		
	//++ №11171 разблокировка объекта, если не завершение работы
	РазблокироватьОбъект(Объект.Ссылка, ЭтаФорма.УникальныйИдентификатор); 
		
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
	
	//#9067 - перенесено в ПослеЗаписи
	//Если ЭтоНовый Тогда		
	//	Если Объект.Ссылка.Пустая() Тогда 
	//		Оповестить("ЗаказДоговорНеСоздан",НомерЛида);
	//	Иначе
	//		Оповестить("ЗаказДоговорСоздан",НомерЛида);
	//	КонецЕсли;
	//	ЭтоНовый = Ложь;
	//КонецЕсли;
	//Оповестить("ЗакрытаФормаЗаказДоговора",,"ЗаказДоговор");
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И ЗначениеЗаполнено(Объект.Основание)
		И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Лид") 
		И Объект.Проведен Тогда
		Оповестить("ЗакрытаФормаЗаказДоговора", Объект.Основание, Новый Структура("Номер, Дата, Вид", Объект.Номер, Объект.Дата, Объект.ВидЗаказа));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаДобавленияПрофиля" Тогда	
		ОбработкаДобавленияПрофиляСервер(ВыбранноеЗначение);	
		ПеренестиДеревоВТабличнуюЧасть();
		РазвернутьДеревоМатериалов();
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Контрагенты") Тогда
		Объект.Контрагент = ВыбранноеЗначение;
		КонтрагентПриИзменении(Неопределено);
	
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда	
		Если НЕ ПодборВМатериалы Тогда
			ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, "Подбор");
		Иначе
			ПодборВМатериалы = Ложь;
			ОбработкаВыбораПодборМатериаловНаКлиенте(ВыбранноеЗначение);
		КонецЕсли;
	
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ШаблоныКомнатДляЗаказДоговора.Форма.ФормаПодбора" Тогда		 
		ОповещениеЗаполнитьКомнатуПоШаблонуЗавершение = Новый ОписаниеОповещения("ЗаполнитьКомнатуПоШаблонуЗавершение", ЭтотОбъект);
		ОбщийМодульКлиент.Розница_ОбработкаВыбораЗаполненияПоШаблону(ЭтотОбъект, ОповещениеЗаполнитьКомнатуПоШаблонуЗавершение, ВыбранноеЗначение);
		
	// #10992
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.НазваниеКомнат.Форма.ФормаВыбора" И ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ОбщийМодульКлиент.Розница_ДобавитьКомнатуЗавершение(Новый Структура("Форма", ЭтаФорма), ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "РегистрСведений.СопутствующиеТоварыИУслуги.Форма.ФормаПодбора" Тогда	
		
		//Удаляем сопутствующие товары для текущей номенклатуры без подтверждения
		МассивСопутствующихТоваровНаУдаление = ОбщийМодульКлиент.ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(Элементы.ДеревоТоваров, ДеревоТоваров);
		ОбщийМодульКлиент.УдалитьСопутствующиеТовары(ДеревоТоваров, МассивСопутствующихТоваровНаУдаление);
	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, "ДобавлениеСопутки", Ложь, Истина);

	КонецЕсли;
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)	
		
	Если ИмяСобытия = "ОповеститьПриИзмененииВерсииДокумента" Тогда
		ПерестроитьДеревоНаФорме();
	ИначеЕсли ИмяСобытия = "ЗаписьМонтажа" и ТипЗнч(Источник) = Тип("ДокументСсылка.Монтаж") И Параметр = Объект.Ссылка Тогда
		
		ТекущаяКомната = Неопределено;
		ТекущаяНоменклатура = Неопределено;
		Если НЕ Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено Тогда
			Если ТекущаяКомната = Неопределено Тогда
				ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
			КонецЕсли;
			Если ТекущаяНоменклатура = Неопределено Тогда
				ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
			КонецЕсли;
		КонецЕсли;
		
		//ПерестроитьДеревоНаФорме();
		ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
		РазвернутьДеревоТоваров(ТекущаяКомната, ТекущаяНоменклатура);
		
		ПроверитьСоответствиеМонтажей();
		ОбновитьОтображениеЭлементовФормы(ТекущаяКомната, ТекущаяНоменклатура);
		
		ЗаполнитьСсылкиНаМонтажи(); // №9868
		
	ИначеЕсли ИмяСобытия = "Запись_ЗаказПокупателя" И Параметр = Объект.Ссылка Тогда
		
		ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
		РазвернутьДеревоТоваров(ТекущаяКомната, ТекущаяНоменклатура);
		
	ИначеЕсли ИмяСобытия = "ЗаписанЗаказПоставщику" И Параметр = Объект.Ссылка
		ИЛИ ИмяСобытия = "ЗаписанПоступлениеТоваровИУслуг" И Параметр = Объект.Ссылка
		Тогда
		ПолучитьВсеПодчиненныеДокументыПоПотолкам();
		
	ИначеЕсли ИмяСобытия = "ЗаказПокупателяСоздатьНаОснованииДокументаРозницыЗавершение" И Источник = Объект.Ссылка Тогда
		ЗаказПокупателяСоздатьНаОснованииДокументаРозницыЗавершение(Параметр);
		
	ИначеЕсли ИмяСобытия = "ЗаписьДокументаОбеспеченияРозницы" И Параметр = Объект.Ссылка Тогда
		
		ТекущаяКомната = Неопределено;
		ТекущаяНоменклатура = Неопределено;
		Если НЕ Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено Тогда
			Если ТекущаяКомната = Неопределено Тогда
				ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
			КонецЕсли;
			Если ТекущаяНоменклатура = Неопределено Тогда
				ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
			КонецЕсли;
		КонецЕсли;
		
		ТекущаяКомнатаМатериалы = Неопределено;
		ТекущаяНоменклатураМатериалы = Неопределено;
		Если НЕ Элементы.ДеревоМатериалов.ТекущиеДанные = Неопределено Тогда
			Если ТекущаяКомнатаМатериалы = Неопределено Тогда
				ТекущаяКомнатаМатериалы = Элементы.ДеревоМатериалов.ТекущиеДанные.Комната;
			КонецЕсли;
			Если ТекущаяНоменклатураМатериалы = Неопределено Тогда
				ТекущаяНоменклатураМатериалы = Элементы.ДеревоМатериалов.ТекущиеДанные.Номенклатура;
			КонецЕсли;
		КонецЕсли;
		
		//ПерестроитьДеревоНаФорме();
		ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
		РазвернутьДеревоТоваров(ТекущаяКомната, ТекущаяНоменклатура);
		
		ЗаполнитьВычисляемыеДанныеПоМатериалам();
		РазвернутьДеревоМатериалов(ТекущаяКомнатаМатериалы, ТекущаяНоменклатураМатериалы);

	ИначеЕсли Источник = "ПодключаемоеОборудование" И ИмяСобытия = "ScanData" И ВводДоступен() И НЕ ЭтаФорма.ТолькоПросмотр Тогда		
		ОбработатьШтрихкод(Параметр);
		
	ИначеЕсли ИмяСобытия = "ЗакрытиеЗаказДоговораОтЦентраСобытий" 
		И Параметр = Объект.Ссылка
		И Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.ВРаботе") Тогда
		ПеревестиЗаказВСтатусВыполнен();
		Оповестить("ОбновитьАРМРозницы",,"ЗаказДоговор");
		
	ИначеЕсли ИмяСобытия = "ОбновитьСписокФайлов" Тогда
		ОбновитьСписокФайлов();
		
	ИначеЕсли ИмяСобытия = "РасторжениеЗаказДоговораОтЦентраСобытий" 
		И Параметр = Объект.Ссылка
		И НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен") Тогда
		// Параметр - Ссылка на заказ
		// Источник - СОРД
		ПеревестиЗаказВСтатусРасторгнут(Источник);
		
	//#13148
	ИначеЕсли ИмяСобытия = "ОтправитьДокументВRevvy" 
		И Параметр = Объект.Ссылка Тогда
		RVY_ОбновитьСтатус();
	КонецЕсли;	
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	УстановитьЗаголовокФормы();
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаПриИзменении(Элемент)
	
	УстановитьЗаголовокФормы();
	УправлениеФормойПоВидуЗаказа();
	УстановитьОтметкуНезаполненногоИсполнителяЗамера();
	УстановитьОтметкуНезаполненногоАдреса();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ПеренестиДеревоВТабличнуюЧасть();
	ЗадатьВопросОПересчетеЦен();
		
	ВалютаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()

	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьСтавкуНДСПоОрганизацииКлиент();
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
	ДоговорКонтрагентаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию, , 32);
	Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор;
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	
	Если ПраваПользователей.ВидЦенДоступенПользователю(Объект.ВидЦен) Тогда
		ПеренестиДеревоВТабличнуюЧасть();
		ЗадатьВопросОПересчетеЦен();
	Иначе
		Объект.ВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//ДанныеВыбора = ПолучитьСписокДоступныхСтатусов(Объект.ТекущийСтатус);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСтатусПриИзменении(Элемент)
	
	Объект.ДоговорРассторгнут = Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен");
	ОбновитьОтображениеЭлементовФормы();
	ПроверитьНеобходимостьОтменыМонтажей = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	//++ №14073 если договор не изменился, ничего не меняем дальше
	Если ДоговорДоИзменения = Объект.ДоговорКонтрагента Тогда
		Возврат;
	КонецЕсли;
		
	ДоговорДоИзменения = Объект.ДоговорКонтрагента;
	//-- №14073	
	
	Если УстановитьВидЦенНаОснованииДоговора() Тогда
		ВидЦенПриИзменении(Неопределено);
	КонецЕсли;
	
	ОбновитьНадписьТекущегоДолгаКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорПриИзменении(Элемент)
	
	УправлениеФормойПоЗаказу();
	
	//#16867
	Если ЗначениеЗаполнено(Объект.ЗаказДоговорОснование) 
		//И ПустаяСтрока(Объект.Адрес) 
		Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАдресПоОснованиюПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Заполнить адрес из заказа клиента (договора)?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресПоОснованиюПослеВопроса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Адрес = ОбщийМодульВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ЗаказДоговорОснование, "Адрес");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаказДоговорНачалоВыбораНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаказДоговорНачалоВыбораНаСервере()

	Массив = Новый Массив;	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Массив.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.Контрагент"));
	КонецЕсли;	
	Элементы.ЗаказДоговор.СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьАдрес(Команда)
	
	ОбработкаВыбораАдреса = Новый ОписаниеОповещения("ОбработкаВыбораАдреса", ЭтаФорма);
	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("Представление",Объект.Адрес);
	ПараметрыАдреса.Вставить("ОткрытаПоСценарию", Истина);
	ПараметрыАдреса.Вставить("ВидКонтактнойИнформации", Новый Структура("ПроверятьКорректность", Ложь));

	//ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводАдреса",ПараметрыАдреса,ЭтаФорма,,,,ОбработкаВыбораАдреса);
	ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса",ПараметрыАдреса,ЭтаФорма,,,,ОбработкаВыбораАдреса);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдрес(Команда)
	
	Список = Новый СписокЗначений;
	Список.Добавить("ИзФактическогоАдреса", "Из фактического адреса контрагента");
	Список.Добавить("ИзЮридическогоАдреса", "Из юридического адреса контрагента");
	ОповещениеМеню = Новый ОписаниеОповещения("ЗаполнитьАдресПослеВыбораИзМеню", ЭтотОбъект, Параметры);
	ПоказатьВыборИзМеню(ОповещениеМеню, Список, Элементы.ЗаполнитьАдрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресПослеВыбораИзМеню(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПоказатьОповещениеПользователя("Не выбран контрагент!");
		Возврат;
	КонецЕсли;
	
	Объект.Адрес = АдресКонтрагента(Объект.Контрагент, ВыбранныйЭлемент.Значение);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	
	Если Прав(Команда.Имя , 9) = "Замерщику" Тогда
		СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект.ИсполнительЗамера);
	Иначе
		СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура RVY_Отправить(Команда)
	RVY_ОбщийМодульКлиент.ОтправитьДокументВRevvy(Объект.Ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьОплатыГрафика(Команда)
	
	//#16286 	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПараметровГрафикаОплат", ЭтотОбъект);
	ПараметрыФормыРГ = Новый Структура("ДатаНачала, СуммаДокумента, Валюта", Объект.ДатаДоговора, Объект.СуммаДокумента, Объект.Валюта);
	ОткрытьФорму("Документ.ЗаказДоговор.Форма.ФормаРаспределенияГрафикаОплат", ПараметрыФормыРГ, ЭтаФорма, , , , ОписаниеОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПараметровГрафикаОплат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат.Вставить("Сумма", Объект.СуммаДокумента);
	ГрафикРаспределения = ОбщийМодульКлиентСервер.РаспределитьГрафикОплат(Результат);

	Если Объект.ГрафикОплат.Количество() > 0 Тогда
		КнопкиВопроса = Новый СписокЗначений;
		КнопкиВопроса.Добавить(КодВозвратаДиалога.Да, "Очистить");
		КнопкиВопроса.Добавить(КодВозвратаДиалога.Нет, "Нет, дополнить таблицу");
		КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РаспределитьОплатыГрафикаПослеВопроса", ЭтотОбъект, ГрафикРаспределения);
		ПоказатьВопрос(ОписаниеОповещения, "Очистить таблицу ""График оплат""?", КнопкиВопроса, , КодВозвратаДиалога.Да);
		
	Иначе
		РаспределитьОплатыГрафикаЗавершение(ГрафикРаспределения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаспределитьОплатыГрафикаПослеВопроса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ГрафикОплат.Очистить();
		РаспределитьОплатыГрафикаЗавершение(ДополнительныеПараметры);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		РаспределитьОплатыГрафикаЗавершение(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьОплатыГрафикаЗавершение(ГрафикРаспределения)

	Для каждого ЭлементМассива из ГрафикРаспределения Цикл
		НоваяСтрока = Объект.ГрафикОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийДереваТоваров

&НаКлиенте
Процедура ДеревоТоваровПриИзменении(Элемент)
	
	//в этом методе нелья вызывать ПеренестиДеревоВТабличнуюЧасть(), т.к. иначе если при обрабтке изменения значения реквизита вызвать асинхронный дилог вопроса, то 
	//к тому времени как пользователь даст ответ на вопрос, его внесенные данные будут затерты в дереве
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Элемент = Неопределено И Поле.Имя = "ДеревоТоваровМонтаж" Тогда
		СсылкаМонтаж = Элементы.ДеревоТоваров.ТекущиеДанные.Монтаж;
		Если НЕ СсылкаМонтаж = Неопределено И НЕ СсылкаМонтаж.Пустая() Тогда
			ПарамДок = Новый Структура;
			ПарамДок.Вставить("Ключ", СсылкаМонтаж);
			ОткрытьФорму("Документ.Монтаж.ФормаОбъекта",ПарамДок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ДопИнфоПлощадьПотолка.Заголовок = "";
		Возврат;
	КонецЕсли;
	
	// корневая строка
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДопИнфоПлощадьПотолка.Заголовок = "";
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = ПолучитьДанныеНоменклатуры(ТекущиеДанные.Номенклатура);
	Если СтруктураДанных.ЭтоПотолок Тогда		
		Элементы.ДопИнфоПлощадьПотолка.Заголовок = "Площадь выбранного потолка: " + Строка(СтруктураДанных.Потолок_КоличествоПродукция);
	Иначе
		Элементы.ДопИнфоПлощадьПотолка.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		//#10932
		Если Элемент.ТекущийЭлемент.Имя = "ДеревоТоваровБесплатно" Тогда
			// разрешаем ставить галку "Бесплатно" на комнате	
		Иначе
			Отказ = Истина;
			Возврат;	
		КонецЕсли;		
	КонецЕсли;
	
	//Если ТекущиеДанные.Номенклатура.Пустая() Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	мСпецификация = ТекущиеДанные.Спецификация;
	мНоменклатура = ТекущиеДанные.Номенклатура;
	
	//запрещаем редактировать строки, у которых статус монтажа = "Выполнен" или "Закрыт"
	Если ТекущиеДанные.МонтажСтатус = ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Выполнен") или ТекущиеДанные.МонтажСтатус = ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Закрыт") Тогда
		ПоказатьПредупреждение(,"Запрещено редактировать строки по выполненным или закрытым монтажам");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//// #5185 событие установки пометки удаления заказа покупателя
	//Если ПроверитьНеобходимостьОбновитьДанныеПослеУдаленияЗаказаПокупателя() Тогда
	//	СнятьПризнакНеобходимостиОбновленияДанныхПослеУдаленияЗаказаПокупателя();
	ТекущиеДанные.ЕстьЗаказПокупателяПоПотолку = ПолучитьПризнакЕстьЗаказПокупателяПоПотолку(ТекущиеДанные.Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, ТекущиеДанные.НомерПотолка);
	//КонецЕсли;
	
	//НАЧАЛО переход на 2.0
	Если ТекущиеДанные.ЕстьЗаказПокупателяПоПотолку	Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"По данному потолку имеется заказ покупателя (на производство). Редактирование не доступно." + Символы.ПС + "Предварительно следует отменить заказ покупателя.");
		//Возврат;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекущиеДанные.НомерПотолка) Тогда 
		
		Потолок = ПолучитьНоменклатуруПотолкаДереваПоНомеруПотолка(ТекущиеДанные.НомерПотолка);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Потолок", Потолок);
		НайденныеСтроки = ПодчиненныеДокументыПоПотолку.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ТекстВопроса = "По " + Потолок + " имеются проведенные документы: " + Символы.ПС;
			Для чНом = 0 По НайденныеСтроки.Количество() - 1 Цикл
				ТекстВопроса = ТекстВопроса + НайденныеСтроки[чНом].Документ + Символы.ПС;
			КонецЦикла;
			ТекстВопроса = ТекстВопроса + "Продолжить?";
			
			ЗадатьВопросПередИзменениемСтроки(Отказ, Элемент, ТекстВопроса);
			
		КонецЕсли;
		
	Иначе
		Отбор = Новый Структура;
		Отбор.Вставить("Потолок", ТекущиеДанные.Номенклатура);
		НайденныеСтроки = ПодчиненныеДокументыПоПотолку.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ТекстВопроса = "По " + ТекущиеДанные.Номенклатура + " имеются проведенные документы: " + Символы.ПС;
			Для чНом = 0 По НайденныеСтроки.Количество() - 1 Цикл
				ТекстВопроса = ТекстВопроса + НайденныеСтроки[чНом].Документ + Символы.ПС;
			КонецЦикла;
			ТекстВопроса = ТекстВопроса + "Продолжить?";
			
			ЗадатьВопросПередИзменениемСтроки(Отказ, Элемент, ТекстВопроса);
			
		КонецЕсли;
	КонецЕсли;
	//КОНЕЦ переход на 2.0
	
	//++ №12269 запрещаем редактировать количество если "Площадь потолка" заполнена
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоТоваровКоличество" И ВНоменклатуреУказанаПлощадьПотолка(ТекущиеДанные.Номенклатура) Тогда
		Отказ = Истина;
	КонецЕсли;
	//-- №12269
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РассчитатьИтоговыеПоказателиКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПередУдалением(Элемент, Отказ)
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоТоваров.ВыделенныеСтроки Цикл
		ТекущиеДанные = ДеревоТоваров.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		Если ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 Тогда
			//не даем удалить саму комнату, иначе нижние проверки не сработают
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		мСпецификация = ТекущиеДанные.Спецификация;
		мНоменклатура = ТекущиеДанные.Номенклатура;
		
		//запрещаем удалять строки, у которых статус монтажа = "Выполнен" или "Закрыт"
		Если ТекущиеДанные.МонтажСтатус = ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Выполнен") или ТекущиеДанные.МонтажСтатус = ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Закрыт") Тогда
			ПоказатьПредупреждение(,"Запрещено редактировать строки по выполненным или закрытым монтажам");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		// #5185 событие установки пометки удаления заказа покупателя
		Если ПроверитьНеобходимостьОбновитьДанныеПослеУдаленияЗаказаПокупателя() Тогда
			СнятьПризнакНеобходимостиОбновленияДанныхПослеУдаленияЗаказаПокупателя();
			ТекущиеДанные.ЕстьЗаказПокупателяПоПотолку = ПолучитьПризнакЕстьЗаказПокупателяПоПотолку(ТекущиеДанные.Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, ТекущиеДанные.НомерПотолка);
		КонецЕсли;
		
		//НАЧАЛО переход на 2.0
		Если ТекущиеДанные.ЕстьЗаказПокупателяПоПотолку	Тогда
			Отказ = Истина;
			ПоказатьПредупреждение(,"По данному потолку имеется заказ покупателя (на производство). Редактирование не доступно." + Символы.ПС + "Предварительно следует отменить заказ покупателя.");
			Возврат;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекущиеДанные.НомерПотолка) Тогда 
			
			Потолок = ПолучитьНоменклатуруПотолкаДереваПоНомеруПотолка(ТекущиеДанные.НомерПотолка);
			
			Отбор = Новый Структура;
			Отбор.Вставить("Потолок", Потолок);
			НайденныеСтроки = ПодчиненныеДокументыПоПотолку.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				ТекстВопроса = "По " + Потолок + " имеются проведенные документы: " + Символы.ПС;
				Для чНом = 0 По НайденныеСтроки.Количество() - 1 Цикл
					ТекстВопроса = ТекстВопроса + НайденныеСтроки[чНом].Документ + Символы.ПС;
				КонецЦикла;
				ТекстВопроса = ТекстВопроса + "Продолжить?";
				
				Отказ = Истина;
				ПредупредитьОбУдаленииСтрокиДереваТовары("ДеревоТоваров", Элементы.ДеревоТоваров.ТекущаяСтрока, ТекстВопроса);
				
			КонецЕсли;
			
		Иначе
			Отбор = Новый Структура;
			Отбор.Вставить("Потолок", ТекущиеДанные.Номенклатура);
			НайденныеСтроки = ПодчиненныеДокументыПоПотолку.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				ТекстВопроса = "По " + ТекущиеДанные.Номенклатура + " имеются проведенные документы: " + Символы.ПС;
				Для чНом = 0 По НайденныеСтроки.Количество() - 1 Цикл
					ТекстВопроса = ТекстВопроса + НайденныеСтроки[чНом].Документ + Символы.ПС;
				КонецЦикла;
				ТекстВопроса = ТекстВопроса + "Продолжить?";
				
				Отказ = Истина;
				ПредупредитьОбУдаленииСтрокиДереваТовары("ДеревоТоваров", Элементы.ДеревоТоваров.ТекущаяСтрока, ТекстВопроса);
				
			КонецЕсли;
		КонецЕсли;
		
		//КОНЕЦ переход на 2.0
		
		Если Объект.ЗаполнятьУИСтрок И НЕ ТекущиеДанные.Спецификация.Пустая() И ЗаполнениеМатериаловПоЗаказам Тогда
			ЗадатьВопросОбУдаленииМатериаловПоСпецификации(ТекущиеДанные.Номенклатура, ТекущиеДанные.УИСтроки);
		КонецЕсли;
		
		ВремТекущаяКомната = ТекущиеДанные.Комната;
		ВремТекущаяНоменклатура = ТекущиеДанные.Номенклатура;
		
	КонецЦикла;
	
	СтруктураОтвета = ПолучитьКомнатуИНоменклатуруСледущийСтроки();
	ВремТекущаяКомната = СтруктураОтвета.ТекущаяКомната;
	ВремТекущаяНоменклатура = СтруктураОтвета.ТекущаяНоменклатура;
	
	Если НЕ Отказ И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги	Тогда
		МассивСопутствующихТоваровНаУдаление = ОбщийМодульКлиент.ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(Элементы.ДеревоТоваров, ДеревоТоваров);
		Если МассивСопутствующихТоваровНаУдаление.Количество() > 0 Тогда 		
			Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриУдаленииНоменклатуры Тогда
				ДопПараметры = Новый Структура("МассивСопутствующихТоваровНаУдаление", МассивСопутствующихТоваровНаУдаление);
				Если ЗначениеЗаполнено(ТекущиеДанные.ХарактеристикаНоменклатуры) Тогда
					ДляВопросаОНоменклатуре = ", характеристика: """ + ТекущиеДанные.ХарактеристикаНоменклатуры + """";
				Иначе
					ДляВопросаОНоменклатуре = "";
				КонецЕсли;
				ПоказатьВопрос(Новый ОписаниеОповещения("ВопросУдалениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Удалить сопутствующие товары и услуги для номенклатуры: """ + ТекущиеДанные.Номенклатура + """" + ДляВопросаОНоменклатуре + "?", РежимДиалогаВопрос.ДаНет);			
			Иначе
				ОбщийМодульКлиент.УдалитьСопутствующиеТовары(ДеревоТоваров, МассивСопутствующихТоваровНаУдаление);
				МассивСопутствующихТоваровНаУдаление.Очистить();
				РассчитатьИтоговыеПоказателиКлиент();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	
	// Если номенклатура фактически не изменилась тогда ничего не делаем
	Если  СтрокаТабличнойЧасти.Номенклатура = ВыбранноеЗначение Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
	
	Если СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги	Тогда
		МассивСопутствующихТоваровНаУдаление = ОбщийМодульКлиент.ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(Элементы.ДеревоТоваров, ДеревоТоваров);
		Если МассивСопутствующихТоваровНаУдаление.Количество() > 0 Тогда 		
			Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииНоменклатуры Тогда
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("МассивСопутствующихТоваровНаУдаление", МассивСопутствующихТоваровНаУдаление);
				ДопПараметры.Вставить("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти);
				ПоказатьВопрос(Новый ОписаниеОповещения("ВопросУдалениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Удалить сопутствующие товары и услуги" + Символы.ПС + "измененной номенклатуры """ + СтрокаТабличнойЧасти.Номенклатура + """" +  ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры), Символы.ПС + "Характеристика """ + СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры + """", "") + "?", РежимДиалогаВопрос.ДаНет);			
				СтрокаТабличнойЧасти.Номенклатура = ВыбранноеЗначение;
				СтандартнаяОбработка = Ложь;
			Иначе
				ОбщийМодульКлиент.УдалитьСопутствующиеТовары(ДеревоТоваров, МассивСопутствующихТоваровНаУдаление);
				МассивСопутствующихТоваровНаУдаление.Очистить();
				РассчитатьИтоговыеПоказателиКлиент();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдалениеСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОбщийМодульКлиент.УдалитьСопутствующиеТовары(ДеревоТоваров, ДополнительныеПараметры.МассивСопутствующихТоваровНаУдаление);
		РассчитатьИтоговыеПоказателиКлиент();
	КонецЕсли;
	Если ДополнительныеПараметры.Свойство("СтрокаТабличнойЧасти") Тогда
		    Элементы.ДеревоТоваров.ТекущаяСтрока = ДополнительныеПараметры.СтрокаТабличнойЧасти.ПолучитьИдентификатор();
			ДеревоТоваровНоменклатураПриИзменении(ДополнительныеПараметры.СтрокаТабличнойЧасти);
	КонецЕсли;	
	Если ДополнительныеПараметры.Свойство("СтрокаХарактеристикиТабличнойЧасти") Тогда
		    Элементы.ДеревоТоваров.ТекущаяСтрока = ДополнительныеПараметры.СтрокаХарактеристикиТабличнойЧасти.ПолучитьИдентификатор();
			ДеревоТоваровХарактеристикаНоменклатурыПриИзменении(ДополнительныеПараметры.СтрокаХарактеристикиТабличнойЧасти);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПослеУдаления(Элемент)
	
	ПеренестиДеревоВТабличнуюЧасть();
	//ПерестроитьДеревоНаФорме();
	//ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	//РазвернутьДеревоТоваров(ВремТекущаяКомната, ВремТекущаяНоменклатура);
	//РазвернутьДеревоМатериалов();
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Неопределено;
	
	//корневые строки редактировать нельзя
	Если СтрокаТабличнойЧасти.ПолучитьРодителя() = Неопределено Тогда
		СтрокаТабличнойЧасти.Номенклатура = Неопределено;
		Возврат;
	КонецЕсли;
	
	Если Объект.ЗаполнятьУИСтрок И мСпецификация <> Неопределено И НЕ мСпецификация.Пустая() И ЗаполнениеМатериаловПоЗаказам Тогда
		УдалитьМатериалыОтносящиесяКПозицииНаСервере(мНоменклатура, СтрокаТабличнойЧасти.УИСтроки);
		СтрокаТабличнойЧасти.Спецификация = ПредопределенноеЗначение("Справочник.Спецификации.ПустаяСсылка");
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Количество = ПолучитьКоличествоНоменклатуры(СтрокаТабличнойЧасти.Номенклатура); //1;
	
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, ВидНоменклатуры, УчитыватьКакПотолок");
	
	//Если СтруктураДанные.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга") Тогда // #12667 спецификация только для услуг, в рамках той же заявки отменено 
	СтрокаТабличнойЧасти.Спецификация = ?(ЗаполнениеМатериаловПоЗаказам, СтруктураДанные.Спецификация, ПредопределенноеЗначение("Справочник.Спецификации.ПустаяСсылка"));
	//КонецЕсли;
	
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена, ЦенаПоПрайсу, ПроцентСкидки, Количество"); //#16345 добавлено Количество 
	
	СтрокаТабличнойЧасти.Бесплатно = Ложь;
	//СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	//СтрокаТабличнойЧасти.ПроцентСкидки = ПолучитьПроцентСкидки(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Количество);
	//СтрокаТабличнойЧасти.ЦенаПоПрайсу = СтрокаТабличнойЧасти.Цена;
	СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
	СтрокаТабличнойЧасти.УИСтрокиРодителя = Новый УникальныйИдентификатор;
	РассчитатьСуммуСтроки(СтрокаТабличнойЧасти);
	
	Если Объект.ЗаполнятьУИСтрок И НЕ СтрокаТабличнойЧасти.Спецификация.Пустая() И ЗаполнениеМатериаловПоЗаказам Тогда
		ПерезаполнитьМатериалыПоСпецификации(СтрокаТабличнойЧасти, , "ДобавлениеНоменклатуры");
	КонецЕсли;
	
	СтрокаКомнаты = СтрокаТабличнойЧасти;
	Если НЕ СтрокаТабличнойЧасти.ПолучитьРодителя() = Неопределено Тогда	
		СтрокаКомнаты = СтрокаТабличнойЧасти.ПолучитьРодителя();
	КонецЕсли;
	ИдКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
	
	Если НЕ СтрокаТабличнойЧасти = Неопределено
		И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги
		И ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
		Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииНоменклатуры Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура); 
			ДопПараметры.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры); 
			ДопПараметры.Вставить("УИСтроки", СтрокаТабличнойЧасти.УИСтроки); 
			ДопПараметры.Вставить("Количество", СтрокаТабличнойЧасти.Количество); 
			ДопПараметры.Вставить("ИДКомнаты", ИдКомнаты);
			ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Добавить сопутствующие товары и услуги для номенклтатуры: """ + СтрокаТабличнойЧасти.Номенклатура + """?", РежимДиалогаВопрос.ДаНет);
		Иначе
			ПодборСопутствующейНоменклатуры(ИдКомнаты);
			
			//МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.УИСтроки, 	СтрокаТабличнойЧасти.Количество, ИДКомнаты, 0);
			//Для каждого ЭлементДерева Из 	МассивДобавленнойСП Цикл
			//	//ОбновитьОтображениеЭлементовФормы(ЭлементДерева.Комната, ЭлементДерева.Номенклатура);	
			//	Если Объект.ЗаполнятьУИСтрок И НЕ ЭлементДерева.Спецификация.Пустая() И ЗаполнениеМатериаловПоЗаказам Тогда
			//		ПерезаполнитьМатериалыПоСпецификации(ЭлементДерева, , "ДобавлениеНоменклатуры");
			//	КонецЕсли;
			//КонецЦикла;										  
			
		КонецЕсли;
	КонецЕсли;	
	
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровХарактеристикаНоменклатурыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	// Необходимо для обработки выбора пустого значения.
	Если ПараметрыПолученияДанных.СтрокаПоиска="" И НЕ СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка")  Тогда
		Элементы.ДеревоТоваров.ЗакончитьРедактированиеСтроки (Ложь); 
		ДеревоТоваровХарактеристикаНоменклатурыОбработкаВыбора(Элемент, ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"), СтандартнаяОбработка);
		//СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровХарактеристикаНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	// Если характеристика фактически не изменилась тогда ничего не делаем
	Если СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры <> ВыбранноеЗначение Тогда
		Если СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги	Тогда
			МассивСопутствующихТоваровНаУдаление = ОбщийМодульКлиент.ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(Элементы.ДеревоТоваров, ДеревоТоваров);	
			Если МассивСопутствующихТоваровНаУдаление.Количество() > 0 Тогда 
				Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииНоменклатуры Тогда
					ДопПараметры = Новый Структура;
					ДопПараметры.Вставить("МассивСопутствующихТоваровНаУдаление", МассивСопутствующихТоваровНаУдаление);
					ДопПараметры.Вставить("СтрокаХарактеристикиТабличнойЧасти", СтрокаТабличнойЧасти);
					ПоказатьВопрос(Новый ОписаниеОповещения("ВопросУдалениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Удалить сопутствующие товары и услуги" + Символы.ПС + "измененной номенклатуры """ + СтрокаТабличнойЧасти.Номенклатура + """" +  ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры), Символы.ПС + "Характеристика """ + СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры + """", "") + "?", РежимДиалогаВопрос.ДаНет);			
					СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ВыбранноеЗначение;
					СтандартнаяОбработка = Ложь;
				Иначе
					ОбщийМодульКлиент.УдалитьСопутствующиеТовары(ДеревоТоваров, МассивСопутствующихТоваровНаУдаление);
					МассивСопутствующихТоваровНаУдаление.Очистить();
					РассчитатьИтоговыеПоказателиКлиент();
				КонецЕсли;
			Иначе
				СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ВыбранноеЗначение;
				ДеревоТоваровХарактеристикаНоменклатурыПриИзменении(СтрокаТабличнойЧасти);
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		Иначе
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ВыбранноеЗначение;
			ДеревоТоваровХарактеристикаНоменклатурыПриИзменении(СтрокаТабличнойЧасти);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;	
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтрокаТабличнойЧасти.ЦенаПоПрайсу = СтрокаТабличнойЧасти.Цена;
	СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
	СтрокаТабличнойЧасти.УИСтрокиРодителя = Неопределено;
	РассчитатьСуммуСтроки(СтрокаТабличнойЧасти);
	
	СтрокаКомнаты = СтрокаТабличнойЧасти;
	Если НЕ СтрокаТабличнойЧасти.ПолучитьРодителя() = Неопределено Тогда	
		СтрокаКомнаты = СтрокаТабличнойЧасти.ПолучитьРодителя();
	КонецЕсли;
	ИдКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
	
	Если НЕ СтрокаТабличнойЧасти = Неопределено
		И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги
		И ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
		Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриДобавленииНоменклатуры Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура); 
			ДопПараметры.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры); 
			ДопПараметры.Вставить("УИСтроки", СтрокаТабличнойЧасти.УИСтроки); 
			ДопПараметры.Вставить("Количество", СтрокаТабличнойЧасти.Количество); 
			ДопПараметры.Вставить("ИДКомнаты", ИдКомнаты);
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
				ДляВопросаОНоменклатуре = ", характеристика: """ + СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры + """";
			Иначе
				ДляВопросаОНоменклатуре = "";
			КонецЕсли;
			ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Добавить сопутствующие товары и услуги для" + Символы.ПС + "номенклатуры: """ + СтрокаТабличнойЧасти.Номенклатура + """" + ДляВопросаОНоменклатуре + "?", РежимДиалогаВопрос.ДаНет);
		Иначе
			ПодборСопутствующейНоменклатуры(ИдКомнаты);
			
			//МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.УИСтроки, 	СтрокаТабличнойЧасти.Количество, ИДКомнаты, 0);
			//Для каждого ЭлементДерева Из МассивДобавленнойСП Цикл
			//	//ОбновитьОтображениеЭлементовФормы(ЭлементДерева.Комната, ЭлементДерева.Номенклатура);	
			//	Если Объект.ЗаполнятьУИСтрок И НЕ ЭлементДерева.Спецификация.Пустая() И ЗаполнениеМатериаловПоЗаказам Тогда
			//		ПерезаполнитьМатериалыПоСпецификации(ЭлементДерева, , "ДобавлениеНоменклатуры");
			//	КонецЕсли;
			//КонецЦикла;										  
			
		КонецЕсли;
	КонецЕсли;	
	
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЕдиницаИзмеренияПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.ЕдиницаИзмерения = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	
	//корневые строки редактировать нельзя
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		ТекущиеДанные.Количество = 0;
		Возврат;
	КонецЕсли;
	
	РодительЭлемент = ТекущиеДанные.ПолучитьРодителя();
	ИдКомнаты = РодительЭлемент.ПолучитьИдентификатор();
	
	//#16345
	Если ИспользоватьКонтрольКратности Тогда
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(ТекущиеДанные);
		ОтказВИзмененииКоличества = Ложь;
		ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества);
		Если ОтказВИзмененииКоличества Тогда
			ТекущиеДанные.Количество = 0;
		КонецЕсли;
	КонецЕсли;
	
	ПроцентАвтоматическойСкидки = ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Объект.Дата, ТекущиеДанные.Номенклатура, ТекущиеДанные.Количество);
	Если НЕ ПроцентАвтоматическойСкидки = 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОбИзмененииАвтоматическойСкидки",ЭтаФорма, ТекущиеДанные), "Изменить скидку согласно настроек автоматических скидок?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ПослеИзмененияКоличестваТоваров(ТекущиеДанные, Ложь);
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.Спецификация.Пустая() 
		//И ЕстьМатериалыПоТекущейПозиции(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.УИСтроки) 
		И ЗаполнениеМатериаловПоЗаказам Тогда
		ПерезаполнитьМатериалыПоСпецификации(ТекущаяСтрока, , "ИзменениеКоличества");
	КонецЕсли;
	
	Если СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги	Тогда
		МассивСопутствующихТоваров = ОбщийМодульКлиент.ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(Элементы.ДеревоТоваров, ДеревоТоваров);
		КоличествоСопутствующихТоваровВРегистре = ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(ТекущиеДанные.Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, Истина);
		ТребуетсяДополнить = ?(МассивСопутствующихТоваров.Количество() < КоличествоСопутствующихТоваровВРегистре, Истина, Ложь);
		Если МассивСопутствующихТоваров.Количество() > 0 Тогда		
			Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииКоличества Тогда
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура); 
				ДопПараметры.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры); 
				ДопПараметры.Вставить("УИСтроки", ТекущаяСтрока.УИСтроки); 
				ДопПараметры.Вставить("Количество", ТекущаяСтрока.Количество); 
				ДопПараметры.Вставить("ИДКомнаты", ИДкомнаты);
				ДопПараметры.Вставить("ТребуетсяДополнить", ТребуетсяДополнить);
				Если ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) Тогда
					ДляВопросаОНоменклатуре = ", характеристика: """ + ТекущаяСтрока.ХарактеристикаНоменклатуры + """";
				Иначе
					ДляВопросаОНоменклатуре = "";
				КонецЕсли;
				ПоказатьВопрос(Новый ОписаниеОповещения("ВопросИзменениеКоличестваСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Изменить количество сопутствующих товаров и услуг для" + Символы.ПС + "номенклатуры: """ + ТекущаяСтрока.Номенклатура + """" + ДляВопросаОНоменклатуре + "?", РежимДиалогаВопрос.ДаНет);
			Иначе
				Если ТребуетсяДополнить Тогда
					Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриДобавленииНоменклатуры Тогда
						ДопПараметры = Новый Структура;
						ДопПараметры.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура); 
						ДопПараметры.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры); 
						ДопПараметры.Вставить("УИСтроки", ТекущаяСтрока.УИСтроки); 
						ДопПараметры.Вставить("Количество", ТекущаяСтрока.Количество); 
						ДопПараметры.Вставить("ИДКомнаты", ИдКомнаты);
						ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Добавить сопутствующие товары и услуги для номенклтатуры: """ + ТекущаяСтрока.Номенклатура + """?", РежимДиалогаВопрос.ДаНет);
					Иначе
						ПодборСопутствующейНоменклатуры(ИДКомнаты);
						ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
						РассчитатьИтоговыеПоказателиКлиент();
					КонецЕсли;
				КонецЕсли;	
				// Изменяем количество сопуттвующей номенклатуры с дополнением отсутствующей
				ИзмененныеСтроки = ОбщийМодульКлиент.ИзменитьКоличествоСопутствущихТоваров(ДеревоТоваров, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.УИСтроки, ТекущаяСтрока.Количество, ИдКомнаты);
				Для каждого СтрокаТовара Из ИзмененныеСтроки Цикл
					ПослеИзмененияКоличестваТоваров(СтрокаТовара, Ложь);
				КонецЦикла;	
			КонецЕсли;
		Иначе
			Если ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры) Тогда
				Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриДобавленииНоменклатуры Тогда
					ДопПараметры = Новый Структура;
					ДопПараметры.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура); 
					ДопПараметры.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры); 
					ДопПараметры.Вставить("УИСтроки", ТекущаяСтрока.УИСтроки); 
					ДопПараметры.Вставить("Количество", ТекущаяСтрока.Количество); 
					ДопПараметры.Вставить("ИДКомнаты", ИДкомнаты);
					Если ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) Тогда
						ДляВопросаОНоменклатуре = ", характеристика: """ + ТекущаяСтрока.ХарактеристикаНоменклатуры + """";
					Иначе
						ДляВопросаОНоменклатуре = "";
					КонецЕсли;
					ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Добавить сопутствующие товары и услуги для" + Символы.ПС + "номенклатуры: """ + ТекущаяСтрока.Номенклатура + """" + ДляВопросаОНоменклатуре +"?", РежимДиалогаВопрос.ДаНет);
				Иначе
					ПодборСопутствующейНоменклатуры(ИДКомнаты);
					ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
					РассчитатьИтоговыеПоказателиКлиент();	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВопросИзменениеКоличестваСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	
	// Если не нужно изменять количество сопутствующей номенклатуры и не требуется дополнять недостающую номенклатуру
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да И НЕ ДополнительныеПараметры.ТребуетсяДополнить Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ИзмененныеСтроки = ОбщийМодульКлиент.ИзменитьКоличествоСопутствущихТоваров(ДеревоТоваров, ДополнительныеПараметры.Номенклатура, ДополнительныеПараметры.ХарактеристикаНоменклатуры, ДополнительныеПараметры.УИСтроки, ДополнительныеПараметры.Количество, ДополнительныеПараметры.ИдКомнаты);
		Для каждого СтрокаТовара Из ИзмененныеСтроки Цикл
			ПослеИзмененияКоличестваТоваров(СтрокаТовара, Ложь);
		КонецЦикла;	
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяДополнить Тогда
		Если ЗначениеЗаполнено(ДополнительныеПараметры.ХарактеристикаНоменклатуры) Тогда
			ДляВопросаОНоменклатуре = ", характеристика: """ + ДополнительныеПараметры.ХарактеристикаНоменклатуры + """";
		Иначе
			ДляВопросаОНоменклатуре = "";
		КонецЕсли;
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеНедостающейСопутствующейНоменклатуры", ЭтотОбъект, ДополнительныеПараметры), "Добавить недостающие сопутствующие товары и услуги для" + Символы.ПС + "номенклатуры: """ + ДополнительныеПараметры.Номенклатура + """" + ДляВопросаОНоменклатуре + "?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросДобавлениеНедостающейСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да  Тогда
		// МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(ДополнительныеПараметры.Номенклатура, ДополнительныеПараметры.ХарактеристикаНоменклатуры, ДополнительныеПараметры.УИСтроки, ДополнительныеПараметры.Количество, ДополнительныеПараметры.ИДКомнаты, 0);
		ПодборСопутствующейНоменклатуры(ДополнительныеПараметры.ИДКомнаты);
		//Для каждого ЭлементДерева Из МассивДобавленнойСП Цикл
		//	//ОбновитьОтображениеЭлементовФормы(ЭлементДерева.Комната, ЭлементДерева.Номенклатура);	
		//	Если Объект.ЗаполнятьУИСтрок И НЕ ЭлементДерева.Спецификация.Пустая() И ЗаполнениеМатериаловПоЗаказам Тогда
		//		ПерезаполнитьМатериалыПоСпецификации(ЭлементДерева, , "ДобавлениеНоменклатуры");
		//	КонецЕсли;
		//КонецЦикла;
		ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
		РассчитатьИтоговыеПоказателиКлиент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандДереваТоваров

&НаКлиенте
Процедура ДобавитьКомнату(Команда)
	
	ПараметрыДобавления = Новый Структура;
	ПараметрыДобавления.Вставить("Форма", ЭтаФорма);
	ПараметрыДобавления.Вставить("ПереключательНаНазваниеКомнат", ПереключательНаНазваниеКомнат);
	ОбщийМодульКлиент.Розница_ДобавитьКомнату(ПараметрыДобавления);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьНоменклатуру(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;	
	
	Если ПустаяСтрока(ТекущиеДанные.Комната) Тогда		
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	ПараметрыПодбора = ПараметрыПодбора();
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

// вызывается:
// - по ОбработкаВыбора из формы подбора                      ИсточникВызова = "Подбор"
// - по ЗаполнитьКомнатуПоШаблонуЗавершение                                    "ЗаполнениеПоШаблону"
// - по ОбработкаВыбора из формы СопутствующиеТоварыИУслуги                    "ДобавлениеСопутки"
&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, ИсточникВызова, ЗаполнятьПоСпецификации = Истина, ПерезаполнятьЦены = Ложь)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	ТекущаяКомната = ТекущаяСтрока.Комната;	
	
	//Удаляем сопутствующие товары для текущей номенклатуры без подтверждения
	//МассивСопутствующихТоваровНаУдаление = ОбщийМодульКлиент.ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(Элементы.ДеревоТоваров, ДеревоТоваров);
	//ОбщийМодульКлиент.УдалитьСопутствующиеТовары(ДеревоТоваров, МассивСопутствующихТоваровНаУдаление);
	
	МассивНоменклатурДляЗаполненияПоСпецификации = ОбработатьПодборНаСервере(ВыбранноеЗначение, ТекущаяКомната, ИсточникВызова, ПерезаполнятьЦены);
		
	ПеренестиДеревоВТабличнуюЧасть();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	РазвернутьДеревоТоваров(ТекущаяКомната);
	РассчитатьИтоговыеПоказателиКлиент();
	ОбновитьОтображениеЭлементовФормы(ТекущаяКомната, Неопределено);
	
	Если ЗаполнятьПоСпецификации
		И Объект.ЗаполнятьУИСтрок 
		И МассивНоменклатурДляЗаполненияПоСпецификации.Количество() > 0 
		И ЗаполнениеМатериаловПоЗаказам Тогда
		ПерезаполнитьМатериалыПоСпецификации(ТекущаяСтрока, МассивНоменклатурДляЗаполненияПоСпецификации, "ДобавлениеНоменклатуры");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьПодборНаСервере(ВыбранноеЗначение, ИмяТекущейКомнаты, ИсточникВызова, ПерезаполнятьЦены = Ложь)
	
	МассивНоменклатурДляЗаполненияПоСпецификации = Новый Массив;
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	//++ #16036 
	//ТаблицаТоваров.Колонки.Добавить("Уровень");
	//ТаблицаТоваров.Колонки.Добавить("Родитель");
	//Для каждого Строка из ТаблицаТоваров Цикл
	//	Строка.Уровень = 0;
	//КонецЦикла;	
	//
	//Индекс = 0;
	//Если ДобавлятьСопуствующуюНоменклатуру Тогда
	//	Пока Индекс < ТаблицаТоваров.Количество() Цикл
	//		Если ТаблицаТоваров[Индекс].Уровень < Константы.ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг.Получить() Тогда
	//			ДобавитьСопуствующуюНоменклатуру(ТаблицаТоваров, Индекс);
	//		КонецЕсли;
	//		Индекс =Индекс + 1;
	//	КонецЦикла
	//КонецЕсли;
	//-- #16036 
		
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	СтрокиКомнат = Дерево.Строки;
	
	СтрокаКомнаты = СтрокиКомнат.Найти(ИмяТекущейКомнаты, "Комната", Ложь);
	
	УИСтрокиПодбора = Неопределено;
	
	//Для Каждого Строка из Дерево.Строки Цикл
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
		Если ИсточникВызова = "ДобавлениеСопутки" Тогда
			// комнату определяем на каждом шаге, так как могла выделить разные позиции разных комнат
			СтрокаРодителяСТ = СтрокиКомнат.Найти(ТекущаяСтрока.УИСтрокиРодителя, "УИСтроки", Истина);
			СтрокаКомнаты = СтрокаРодителяСТ.Родитель;
			
			Если НЕ ТекущаяСтрока.УИСтрокиПодбора = УИСтрокиПодбора Тогда
				УИСтрокиПодбора = ТекущаяСтрока.УИСтрокиПодбора;
				ИндексСтроки = СтрокаКомнаты.Строки.Индекс(СтрокаРодителяСТ) + 1;
			Иначе
				ИндексСтроки = ИндексСтроки + 1;
			КонецЕсли;			
		КонецЕсли;
		
		СтрокиПозиций = СтрокаКомнаты.Строки;
		
		Если ИсточникВызова = "ДобавлениеСопутки" Тогда
			СтрокаТабличнойЧасти = СтрокиПозиций.Вставить(ИндексСтроки);
		Иначе
			СтрокаТабличнойЧасти = СтрокиПозиций.Добавить();			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ТекущаяСтрока);
		СтрокаТабличнойЧасти.Комната = СтрокаКомнаты.Комната;
		СтрокаТабличнойЧасти.Уровень = 1;
		
		//СтруктураДанные = Новый Структура("Номенклатура, ВидСпецификации", СтрокаТабличнойЧасти.Номенклатура, ВидСпецификацииПоУмолчанию);
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧастиСервер(СтрокаТабличнойЧасти);
		СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ВидНоменклатуры, УчитыватьКакПотолок");
		
		СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
		Если ИсточникВызова = "Подбор" ИЛИ ИсточникВызова = "ДобавлениеСопутки" Тогда //ЭтоПодбор Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЦенаПоПрайсу, ПроцентСкидки");
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЦенаПоПрайсу, ПроцентСкидки, Количество"); //#16345 добавлено количество
		КонецЕсли;
		
		//СтрокаТабличнойЧасти.ПроцентСкидки = ПолучитьПроцентСкидки(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Количество);
		//Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаТабличнойЧасти.Номенклатура) Тогда // #12667 спецификация только для услуг, в рамках той же заявки отменено
		СтрокаТабличнойЧасти.Спецификация = ?(ЗаполнениеМатериаловПоЗаказам, СтруктураДанные.Спецификация, ПредопределенноеЗначение("Справочник.Спецификации.ПустаяСсылка"));				
		//КонецЕсли;
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаТабличнойЧасти.Номенклатура) 
			ИЛИ ПерезаполнятьЦены Тогда
			СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
		КонецЕсли;
		
		Если УчитыватьНДС Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = Объект.СтавкаНДС;
		КонецЕсли;
		
		//РассчитатьСуммуСтрокиНаСервере(Стр);
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(СтрокаТабличнойЧасти, "ПроцентСкидки", "СуммаСкидки");
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, "СуммаСкидки");
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуПоПрайсуВСтрокеТЧ(СтрокаТабличнойЧасти);
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
		
		Если ПустаяСтрока(СтрокаТабличнойЧасти.УИСтроки) Тогда
			// при подборе сопутствующих уже заполнено
			СтрокаТабличнойЧасти.УИСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		Если НЕ СтрокаТабличнойЧасти.Спецификация.Пустая() Тогда
			МассивНоменклатурДляЗаполненияПоСпецификации.Добавить(
					Новый Структура("Комната, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество, Коэффициент, Спецификация, УИСтроки",
			СтрокаТабличнойЧасти.Комната, СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения,
			СтрокаТабличнойЧасти.Количество, СтрокаТабличнойЧасти.Коэффициент, СтрокаТабличнойЧасти.Спецификация, СтрокаТабличнойЧасти.УИСтроки));					
		КонецЕсли;
										
	КонецЦикла;			

	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);	
	
	Возврат МассивНоменклатурДляЗаполненияПоСпецификации;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКомнатуПоШаблону(Команда)
	
	ОбщийМодульКлиент.Розница_ЗаполнитьКомнатуПоШаблону(ЭтотОбъект, ЗапретРедактированияЦен());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомнатуПоШаблонуЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
			
	ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, "ЗаполнениеПоШаблону");
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСопутствующиеТовары(Команда)
	
	СопутствующиеТоварыКлиент.ОткрытьФормуПодбора(ЭтотОбъект);
	// Обработка ответа формы на ОбработкаВыбораПодборНаКлиенте
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийДереваМатериалов

&НаКлиенте
Процедура ДеревоМатериаловПриИзменении(Элемент)

	Если ПустаяСтрока(Элементы.ДеревоМатериалов.ТекущиеДанные.УИСтроки) Тогда
		Элементы.ДеревоМатериалов.ТекущиеДанные.УИСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	//++ №12269 запрещаем редактировать количество если "Площадь потолка" заполнена
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоМатериаловКоличество" И ВНоменклатуреУказанаПлощадьПотолка(ТекущиеДанные.Номенклатура) Тогда
		Отказ = Истина;
	КонецЕсли;
	//-- №12269
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловПередУдалением(Элемент, Отказ)
	
	//ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоМатериалов.ВыделенныеСтроки Цикл
		ТекущиеДанные = ДеревоМатериалов.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		//Если ТекущиеДанные.Номенклатура.Пустая() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	
	// Новая строка добавлена программно.
	// При отмене редактирования ее требуется удалить.
	Если СтрокаМатериаловДобавлена И ОтменаРедактирования Тогда
		ДеревоМатериалов.ПолучитьЭлементы().Удалить(ТекущиеДанные);
		СтрокаМатериаловДобавлена = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловПослеУдаления(Элемент)
	
	ПеренестиДеревоВТабличнуюЧасть(Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловНоменклатураПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоМатериалов.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоМатериалов.ТекущиеДанные.Номенклатура = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы.ДеревоМатериалов.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Коэффициент = 1;
	СтрокаТабличнойЧасти.Количество = ПолучитьКоличествоНоменклатуры(СтрокаТабличнойЧасти.Номенклатура); //1;
	СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловЕдиницаИзмеренияПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоМатериалов.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоМатериалов.ТекущиеДанные.ЕдиницаИзмерения = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы.ДеревоМатериалов.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ДеревоМатериалов.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандДереваМатериалов

&НаКлиенте
Процедура ДобавитьМатериал(Команда)
	
	ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено  Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущиеДанные.Комната) = Неопределено  Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ТипДокумента",		"ЗаказДоговор");
	ПараметрыПодбора.Вставить("Назначение",			"Материалы");
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыПодбора,,,,,Новый ОписаниеОповещения("ПослеВыбораНоменклатурыМатериала",ЭтаФорма,ТекущиеДанные.Комната));
	
	// вариант добавления непосредственно через форму, но не учитывается "Назначение"
	//СтрокаКомнаты = ДеревоМатериалов.НайтиПоИдентификатору(Элементы.ДеревоМатериалов.ТекущаяСтрока);
	//Если НЕ СтрокаКомнаты.ПолучитьРодителя() = Неопределено Тогда
	//	СтрокаКомнаты = СтрокаКомнаты.ПолучитьРодителя();
	//КонецЕсли;
	//
	//НоваяСтрока = СтрокаКомнаты.ПолучитьЭлементы().Добавить();
	//НоваяСтрока.Комната = ТекущиеДанные.Комната;
	//НоваяСтрока.УИСтроки = Новый УникальныйИдентификатор;
	//Элементы.ДеревоМатериалов.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	//
	//Элементы.ДеревоМатериалов.ТекущийЭлемент = Элементы.ДеревоМатериаловНоменклатура;
	//Элементы.ДеревоМатериалов.ИзменитьСтроку();	
	//СтрокаМатериаловДобавлена = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьМатериалы(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;	
	
	Если ПустаяСтрока(ТекущиеДанные.Комната) Тогда		
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	ПодборВМатериалы = Истина;
	ПараметрыПодбора = ПараметрыПодбора();
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборМатериаловНаКлиенте(ВыбранноеЗначение)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ДеревоМатериалов.ТекущиеДанные;
	ТекущаяКомната = ТекущаяСтрока.Комната;
	
	ОбработатьПодборМатериаловНаСервере(ВыбранноеЗначение, ТекущаяКомната);
	ПеренестиДеревоВТабличнуюЧасть();
	ЗаполнитьВычисляемыеДанныеПоМатериалам();
			
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборМатериаловНаСервере(ВыбранноеЗначение, ТекущаяКомната)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Если Строка.Комната = ТекущаяКомната Тогда
			Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
				Стр = Строка.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(Стр, ТекущаяСтрока);
				Стр.Комната = ТекущаяКомната;
				Стр.УИСтроки = Новый УникальныйИдентификатор;
			КонецЦикла;
			
			ЗначениеВДанныеФормы(Дерево, ДеревоМатериалов);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()  
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект, Элементы.ДекорацияСостояниеОригинала);   
КонецПроцедуры
//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	НачалоЗаголовка = "Заказ клиента";
	Если Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Договор Тогда
		НачалоЗаголовка = "Заказ клиента (договор)";
	ИначеЕсли Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Рекламация Тогда
		НачалоЗаголовка = "Заказ клиента (рекламация)";
	ИначеЕсли Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.СервиснаяЗаявка Тогда
		НачалоЗаголовка = "Заказ клиента (сервисная заявка)";
	ИначеЕсли Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Продажа Тогда
		НачалоЗаголовка = "Заказ клиента (продажа)";
	КонецЕсли;
	
	ВерсияЗаказа  = "";
	Если НЕ Объект.ЗаполнятьУИСтрок Тогда
		ВерсияЗаказа = "(Версия документа 1.1)";
	КонецЕсли;
	 
	ЭтаФорма.Заголовок = СокрЛП(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2 %3",
						НачалоЗаголовка, 
						?(Объект.Ссылка.Пустая(), "(создание)", Объект.Номер + " от " + Объект.Дата), 
						ВерсияЗаказа));
	
КонецПроцедуры
					
&НаСервереБезКонтекста
Процедура РазблокироватьОбъект(Знач Ссылка, Знач УникальныйИдентификатор)
	
	РазблокироватьДанныеДляРедактирования(Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормойПоВидуЗаказа()
	
	ЭтоДоговор    = (Объект.ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Договор"));
	ЭтоРекламация = (Объект.ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Рекламация"));
	ЭтоСервис     = (Объект.ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.СервиснаяЗаявка"));
	ЭтоПродажа    = (Объект.ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Продажа"));

	Элементы.ЗаказДоговорОснование.Видимость = НЕ ЭтоДоговор;
	
	Элементы.ГруппаДоговор.Видимость = ЭтоДоговор ИЛИ ЭтоПродажа;
	Элементы.ЗаказДоговор.Видимость = ЭтоРекламация ИЛИ ЭтоСервис;
	
	// Рекламация - это бесплатно
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("ГруппаГрафикОплат");
	МассивРеквизитов.Добавить("ГруппаПодвалИтогиСтрока2");
	
	МассивРеквизитов.Добавить("ВидЦен");
	МассивРеквизитов.Добавить("ВидСкидки");
	МассивРеквизитов.Добавить("ГруппаСуммаДокументаИСуммаДолга");
	МассивРеквизитов.Добавить("СтавкаНДС");
	
	МассивРеквизитов.Добавить("ДеревоТоваровИзменитьСкидкуНаПотолок");
	МассивРеквизитов.Добавить("ДеревоТоваровИзменитьСкидкуНаУслуги");
	МассивРеквизитов.Добавить("ДеревоТоваровИзменитьСкидкуТовары");
	МассивРеквизитов.Добавить("ДеревоТоваровИзменитьСкидкуНаВсе");
	МассивРеквизитов.Добавить("ДеревоТоваровОчиститьСкидки");
	
	МассивРеквизитов.Добавить("ДеревоТоваровЦена");
	МассивРеквизитов.Добавить("ДеревоТоваровПроцентСкидки");
	МассивРеквизитов.Добавить("ДеревоТоваровСуммаСкидки");
	МассивРеквизитов.Добавить("ДеревоТоваровСумма");
	МассивРеквизитов.Добавить("ДеревоТоваровСуммаПоПрайсу");
	МассивРеквизитов.Добавить("ДеревоТоваровБесплатно");
	МассивРеквизитов.Добавить("ДеревоТоваровСтавкаНДС");
	МассивРеквизитов.Добавить("ДеревоТоваровСуммаНДС");
		
	ОбщийМодульСервер.УстановитьВидимостьЭлементовПоМассиву(
		Элементы,
		МассивРеквизитов,
		?(ЭтоРекламация, Неопределено, МассивРеквизитов));
		
КонецПроцедуры

&НаСервере
Процедура УправлениеФормойПоЗаказу()
	
	ЕстьЗаказДоговор = (НЕ Объект.ЗаказДоговорОснование.Пустая());
	Элементы.ДоговорКонтрагента.Доступность = НЕ ЕстьЗаказДоговор;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПодбора()
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",						Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",				Объект.Организация);
	ПараметрыПодбора.Вставить("ВидЦены",					Объект.ВидЦен);
	ПараметрыПодбора.Вставить("Валюта",						Объект.Валюта);
	ПараметрыПодбора.Вставить("ТипДокумента",				"ЗаказДоговор");
	ПараметрыПодбора.Вставить("ЗапретРедактированияЦен",	ЗапретРедактированияЦен());
	
	Если ПодборВМатериалы Тогда
		
		ПараметрыПодбора.Вставить("Назначение",			"Материалы");
		ПараметрыПодбора.Вставить("НеЗапрашиватьЦену",  Истина);
		ПараметрыПодбора.Вставить("Склад", 				ОбщийМодульСервер.НастройкаПользователя("СкладМатериаловРозница")); // №14875
		
	Иначе	
		
		ПараметрыПодбора.Вставить("Назначение",			"Товары");
		ПараметрыПодбора.Вставить("Склад", 				ОбщийМодульСервер.НастройкаПользователя("СкладРозница")); // №14875
		ПараметрыПодбора.Вставить("НеЗапрашиватьЦену",  ЭтоРекламация);
		//#16345
		Если ИспользоватьКонтрольКратности Тогда
			ПараметрыПодбора.Вставить("ВидДокументаПроверкиКратности",ПредопределенноеЗначение("Перечисление.ВидыДокументовПроверкиКратности.ЗаказКлиента")); 
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПараметрыПодбора;
	
КонецФункции
	
&НаКлиенте
Процедура ЗаполнитьСтавкуНДСПоОрганизацииКлиент(ИзменятьСтавку = Истина)
	
	ЗаполнитьСтавкуНДСПоОрганизацииСервер();
	Если ИзменятьСтавку Тогда
		ЗаполнитьСтавкуНДСВДеревеТоваров(СтавкаНДСПоУмолчанию);
		РассчитатьИтоговыеПоказателиКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтавкуНДСВДеревеТоваров(СтавкаНДС, ПропускатьСтрокиСВыполненнымиМонтажами = Ложь)		
	
	ЕстьСтрокиСВыполненнымиМонтажами = Ложь;
	
	СтрокиКомнат = ДеревоТоваров.ПолучитьЭлементы();
	Для Каждого СтрокаКомнаты из СтрокиКомнат Цикл
		СтрокиТоваров = СтрокаКомнаты.ПолучитьЭлементы();	
		Для Каждого СтрокаТовара Из СтрокиТоваров Цикл
			
			Если ПропускатьСтрокиСВыполненнымиМонтажами
				И (СтрокаТовара.МонтажСтатус = ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Выполнен")
			      ИЛИ СтрокаТовара.МонтажСтатус = ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Закрыт")) Тогда
				ЕстьСтрокиСВыполненнымиМонтажами = Истина;
				Продолжить;
			КонецЕсли;
			СтрокаТовара.СтавкаНДС = СтавкаНДС;
			ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТовара, УчитыватьНДС);
		КонецЦикла;
	КонецЦикла;
		
	Если ЕстьСтрокиСВыполненнымиМонтажами Тогда
		Сообщить("При изменении ставки НДС были пропущены строки с выполненными и закрытыми монтажами");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизацииСервер()
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
	СтавкаНДСПоУмолчанию = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);
	
	Элементы.ДеревоТоваровСтавкаНДС.Видимость 	= УчитыватьНДС;
	Элементы.ДеревоТоваровСуммаНДС.Видимость 	= УчитыватьНДС;
	Элементы.СтавкаНДС.Видимость 				= УчитыватьНДС;
	
КонецПроцедуры

&НаКлиенте
Процедура RVY_ОбновитьСтатус()
	
	RVY_СостояниеДокумента = RVY_ОбщийМодульВызовСервера.ПолучитьСостояниеДокумента(Объект.Ссылка);
	
	Если RVY_СостояниеДокумента.Состояние = 0 Тогда
		Элементы.RVY_Отправить.Картинка = БиблиотекаКартинок.RVY_Логотип;
	ИначеЕсли RVY_СостояниеДокумента.Состояние = 1 Тогда
		Элементы.RVY_Отправить.Картинка = БиблиотекаКартинок.RVY_Подготовлено;
	ИначеЕсли RVY_СостояниеДокумента.Состояние = 2 Тогда
		Элементы.RVY_Отправить.Картинка = БиблиотекаКартинок.RVY_Отправлено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",						"ТоварыУслуги");                          
	//СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);  
	СтруктураДанные.Вставить("ВидСпецификации",					ВидСпецификацииПоУмолчанию); 	
	СтруктураДанные.Вставить("Номенклатура",					СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", 		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 				СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 						СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 							Объект.Дата);
	//СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	//СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	//СтруктураДанные.Вставить("Организация",			Объект.Организация);
	//СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	//СтруктураДанные.Вставить("Контрагент",			Объект.);
	СтруктураДанные.Вставить("ИспользоватьАвтоматическиеСкидки",ИспользоватьАвтоматическиеСкидки);
	СтруктураДанные.Вставить("ВидСкидки", 						Объект.ВидСкидки);
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);
										
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция СтруктураДанныхПоСтрокеТабличнойЧастиСервер(СтрокаТабличнойЧасти)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",						"ТоварыУслуги");                          
	//СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);  
	СтруктураДанные.Вставить("ВидСпецификации",					ВидСпецификацииПоУмолчанию); 		
	СтруктураДанные.Вставить("Номенклатура",					СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", 		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 				СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 						СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 							Объект.Дата);
	//СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	//СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	//СтруктураДанные.Вставить("Организация",			Объект.Организация);
	//СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	//СтруктураДанные.Вставить("Контрагент",			Объект.Контрагент);
	СтруктураДанные.Вставить("ИспользоватьАвтоматическиеСкидки",ИспользоватьАвтоматическиеСкидки);
	СтруктураДанные.Вставить("ВидСкидки", 						Объект.ВидСкидки);
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Процедура ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества)
	
	ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(ОтказВИзмененииКоличества, СтруктураДанные, Перечисления.ВидыДокументовПроверкиКратности.ЗаказКлиента);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресКонтрагента(Контрагент, ТипАдресаСтрокой)
	
	ВидКИ = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	Если ТипАдресаСтрокой = "ИзЮридическогоАдреса" Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;	
	КонецЕсли;
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, ВидКИ, , Истина);
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ПеревестиЗаказВСтатусВыполнен() 	
	
	ТекущаяКомната = Неопределено;
	ТекущаяНоменклатура = Неопределено;
	Если НЕ Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено Тогда
		Если ТекущаяКомната = Неопределено Тогда
			ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
		КонецЕсли;
		Если ТекущаяНоменклатура = Неопределено Тогда
			ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Выполнен");
	ЭтотОбъект.Записать();
	
	ПерестроитьДеревоНаФорме();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	РазвернутьДеревоТоваров(ТекущаяКомната, ТекущаяНоменклатура);

КонецПроцедуры

&НаКлиенте
Процедура ПеревестиЗаказВСтатусРасторгнут(ДокументСОРД) 	
	
	ТекущаяКомната = Неопределено;
	ТекущаяНоменклатура = Неопределено;
	Если НЕ Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено Тогда
		Если ТекущаяКомната = Неопределено Тогда
			ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
		КонецЕсли;
		Если ТекущаяНоменклатура = Неопределено Тогда
			ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	СоглашениеОРасторженииДоговора = ДокументСОРД;
	Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен");
	ЭтотОбъект.Записать();
	ТолькоПросмотр = Истина;
			
	ПерестроитьДеревоНаФорме();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	РазвернутьДеревоТоваров(ТекущаяКомната, ТекущаяНоменклатура);

КонецПроцедуры

&НаСервере
Процедура ОбработкаДобавленияПрофиляСервер(МассивМатериалов)
	
	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
	Для каждого ЭлементМассива из МассивМатериалов Цикл
		ДобавленоПоКомнате = Ложь;
			
		Для Каждого Строка из Дерево.Строки Цикл
			Если НЕ ДобавленоПоКомнате И Строка.Комната = ЭлементМассива.Комната Тогда
				Стр = Строка.Строки.Добавить();
				Стр.Номенклатура = ЭлементМассива.Номенклатура;
				Стр.Комната = ЭлементМассива.Комната;
				Стр.Количество = ЭлементМассива.Количество;
				
				Стр.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Стр.Номенклатура);
				Стр.Коэффициент = 1;
				
				Стр.УИСтроки = Новый УникальныйИдентификатор;
				ДобавленоПоКомнате = Истина;					
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоМатериалов);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьСтавкуНДСВТабличнойЧастиДокумента()
	
	ЕстьСтрокиСВыполненнымиМонтажами = Ложь;
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Для Каждого СтрНоменклатура из Строка.Строки Цикл
			Если СтрНоменклатура.МонтажСтатус = Справочники.РезультатыМонтажа.Выполнен или СтрНоменклатура.МонтажСтатус = Справочники.РезультатыМонтажа.Закрыт Тогда
				ЕстьСтрокиСВыполненнымиМонтажами = Истина;
			Иначе
				СтрНоменклатура.СтавкаНДС = Объект.СтавкаНДС;
				СтрНоменклатура.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрНоменклатура.Сумма, УчитыватьНДС, , УчетНДС.ПолучитьСтавкуНДС(СтрНоменклатура.СтавкаНДС));
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	ПеренестиДеревоВТабличнуюЧасть();
	
	Если ЕстьСтрокиСВыполненнымиМонтажами Тогда
		Сообщить("При изменении ставки НДС были пропущены строки с выполненными и закрытыми монтажами");
	КонецЕсли;

КонецПроцедуры

//&НаСервере
//Процедура ПроверитьОтсутствиеКомнатВМатериалах()
//	//проверим и перезаполним комнаты в материалах, если их там нет
//	Если Объект.Материалы.Количество() = 0 Тогда
//		ВременнаяТаблица = Объект.ТоварыУслуги.Выгрузить();
//		ВременнаяТаблица.Свернуть("Комната");
//		Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
//			Если НЕ ПустаяСтрока(ТекущаяСтрока.Комната) Тогда
//				НоваяСтрока = Объект.Материалы.Добавить();
//				НоваяСтрока.Комната = ТекущаяСтрока.Комната;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//		
//КонецПроцедуры

//ПРОЦЕДУРЫ И ФУНКЦИИ НА СЕРВЕРЕ

//&НаСервере
//Функция ПолучитьСуммуИтогоПоКомнате(Комната, ИмяПоляСумма)
//	
//	Если ПустаяСтрока(Комната) тогда
//		Возврат "";
//	КонецЕсли;
//	
//	ВременнаяТаблица = Объект.ТоварыУслуги.Выгрузить();
//	ВременнаяТаблица.Свернуть("Комната", ИмяПоляСумма);
//	
//	Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
//		Если ТекущаяСтрока.Комната = Комната Тогда
//			Возврат ТекущаяСтрока[ИмяПоляСумма];
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат "";
//	
//КонецФункции

&НаСервере
Процедура ПерестроитьДеревоНаФорме()
	//ТОВАРЫ И УСЛУГИ
	//ключ строки дерева: комната
	
	//#5010 добавляем все комнаты из товаров и материалов
	ТЗКомнаты = Объект.ТоварыУслуги.Выгрузить(, "Комната");
	Для Каждого Стр из Объект.Материалы Цикл
		НоваяСтрока = ТЗКомнаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	ТЗКомнаты.Свернуть("Комната");
	// сортировку не делаем, при наличии комнат более 10 будет сортировка по строкам, а не по числам, что приведет к "проблеме"
		
	Комната = "";
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
	
	Для каждого СтрокаКомнаты из ТЗКомнаты Цикл
		СтрДерево = Дерево.Строки.Добавить();
		СтрДерево.Комната = СтрокаКомнаты.Комната;
		Комната = СтрокаКомнаты.Комната;
	КонецЦикла;
	
	КоличествоСтрокТоваров = 0;
	Для Каждого Стр из Объект.ТоварыУслуги Цикл
		//Если Стр.Комната <> Комната Тогда
		//	СтрДерево = Дерево.Строки.Добавить();
		//	СтрДерево.Комната = Стр.Комната;
		//	Комната = Стр.Комната;
		//КонецЕсли;
		СтрДерево = Дерево.Строки.Найти(Стр.Комната, "Комната");
		Если НЕ Стр.Номенклатура.Пустая() Тогда
			СтрДеревоВид = СтрДерево.Строки.Добавить();
			СтрДеревоВид.Уровень = 1;
			ЗаполнитьЗначенияСвойств(СтрДеревоВид, Стр);
			Если Стр.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок Тогда
				//НАЧАЛО Переход на 2.0 R2
				//СтрДеревоВид.СтатусПроизводства = ПолучитьСтатусПроизводства(Стр.Номенклатура, Стр.ЗаказНаПроизводство);
				СтрДеревоВид.СтатусПроизводства = ПолучитьСтатусПроизводства(Стр.Номенклатура);
				//КОНЕЦ  Переход на 2.0 R2
			КонецЕсли;
			СтрДеревоВид.ВидНоменклатуры = Стр.Номенклатура.ВидНоменклатуры;
			СтрДеревоВид.УчитыватьКакПотолок = Стр.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности; // №14690;
			Если ПустаяСтрока(Стр.УИСтроки) Тогда
				//по какой-то причине УИ пустой - заполним
				Стр.УИСтроки = Новый УникальныйИдентификатор;
				СтрДерево.УИСтроки = Стр.УИСтроки;
			КонецЕсли;
			КоличествоСтрокТоваров = КоличествоСтрокТоваров + 1;
		КонецЕсли;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	
	//МАТЕРИАЛЫ
	
	
	ДеревоТ = Дерево;	
	Комната = "";
	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
	
	//принудительно добавим все комнаты из дерева товаров - замена процедуре ПроверитьОтсутствиеКомнатВМатериалах
	Для Каждого СтрТовары Из ДеревоТ.Строки Цикл
		Нашли=Ложь;
		Для Каждого СтрМатериалы Из Дерево.Строки Цикл
			Если СтрТовары.Комната = СтрМатериалы.Комната Тогда
				Нашли = Истина;
			КонецЕсли;
		КонецЦикла;
		Если НЕ Нашли Тогда
			СтрДерево = Дерево.Строки.Добавить();
			СтрДерево.Комната = СтрТовары.Комната;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоСтрокМатериалов = 0;

	Для Каждого Стр из Объект.Материалы Цикл
		СтрДерево = Дерево.Строки.Найти(Стр.Комната, "Комната");
		Если СтрДерево = Неопределено Тогда
			СтрДерево = Дерево.Строки.Добавить();
			СтрДерево.Комната = Стр.Комната;
			Комната = Стр.Комната;
		КонецЕсли;
		
		Если НЕ Стр.Номенклатура.Пустая() Тогда
			СтрДеревоВид = СтрДерево.Строки.Добавить();
			СтрДеревоВид.Уровень = 1;
			ЗаполнитьЗначенияСвойств(СтрДеревоВид, Стр);			
			Если ПустаяСтрока(Стр.УИСтроки) Тогда
				//по какой-то причине УИ пустой - заполним
				Стр.УИСтроки = Новый УникальныйИдентификатор;
				СтрДерево.УИСтроки = Стр.УИСтроки;
			КонецЕсли;
			КоличествоСтрокМатериалов = КоличествоСтрокМатериалов + 1;
		КонецЕсли;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоМатериалов);
	
КонецПроцедуры

&НаСервере
Процедура ПерестроитьДеревоМатериалыНаФорме()
	
	//МАТЕРИАЛЫ	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	ДеревоТ = Дерево;	
	Комната = "";
	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
	
	//принудительно добавим все комнаты из дерева товаров - замена процедуре ПроверитьОтсутствиеКомнатВМатериалах
	Для Каждого СтрТовары Из ДеревоТ.Строки Цикл
		Нашли=Ложь;
		Для Каждого СтрМатериалы Из Дерево.Строки Цикл
			Если СтрТовары.Комната = СтрМатериалы.Комната Тогда
				Нашли = Истина;
			КонецЕсли;
		КонецЦикла;
		Если НЕ Нашли Тогда
			СтрДерево = Дерево.Строки.Добавить();
			СтрДерево.Комната = СтрТовары.Комната;
		КонецЕсли;
	КонецЦикла;

	КоличествоСтрокМатериалов = 0; // №10963 добавлено вычисление для шапки
	
	Для Каждого Стр из Объект.Материалы Цикл
		СтрДерево = Дерево.Строки.Найти(Стр.Комната, "Комната");
		Если СтрДерево = Неопределено Тогда
			СтрДерево = Дерево.Строки.Добавить();
			СтрДерево.Комната = Стр.Комната;
			Комната = Стр.Комната;
		КонецЕсли;
		
		Если НЕ Стр.Номенклатура.Пустая() Тогда
			СтрДеревоВид = СтрДерево.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДеревоВид, Стр);			
			Если ПустаяСтрока(Стр.УИСтроки) Тогда
				//по какой-то причине УИ пустой - заполним
				Стр.УИСтроки = Новый УникальныйИдентификатор;
				СтрДерево.УИСтроки = Стр.УИСтроки;
			КонецЕсли;
			КоличествоСтрокМатериалов = КоличествоСтрокМатериалов + 1; // №10963 добавлено вычисление для шапки
		КонецЕсли;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоМатериалов);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусПроизводства(Номенклатура)
	//НАЧАЛО Переход на 2.0 R2
	//, ЗаказНаПроизводство)
	//КОНЕЦ  Переход на 2.0 R2

	//НАЧАЛО Переход на 2.0 R2
	//Если ТипЗнч(ЗаказНаПроизводство) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
	//	Если НЕ ЗаказНаПроизводство.Пустая() Тогда
	//		Возврат ЗаказНаПроизводство.ТекущийСтатус;
	//	КонецЕсли;
	//КонецЕсли;
	//КОНЕЦ  Переход на 2.0 R2
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказНаПроизводство.Ссылка КАК Ссылка,
	|	ЗаказНаПроизводство.ТекущийСтатус КАК ТекущийСтатус
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.ПродукцияНоменклатура = &Номенклатура
	|	И НЕ ЗаказНаПроизводство.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПоставщикуТовары.Ссылка,
		|	ЗаказПоставщикуТовары.Ссылка.ТекущийСтатус
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Номенклатура = &Номенклатура
		|	И НЕ ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда 
			Возврат Справочники.СтатусыЗаказовНаПроизводство.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ТекущийСтатус;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция СформироватьНадписьПредварительныеДанныеЗамера()
	
	ЗаголовокНадписи = "";
	
	//++ №11768 комментируем, т.к. новый заголовок
	//ЗаголовокНадписи = ЗаголовокНадписи + ?(ПустаяСтрока(ИмяКлиентаЛида), "", "Клиент: " + ИмяКлиентаЛида);
	//ЗаголовокНадписи = ЗаголовокНадписи + ?(НЕ ПустаяСтрока(ЗаголовокНадписи), "; ", "");
	//ЗаголовокНадписи = ЗаголовокНадписи + ?(Объект.ПредполагаемыйМонтажДатаМонтажаНеОпределена, "монтаж по звонку ", "");
	//ЗаголовокНадписи = ЗаголовокНадписи + ?(ЗначениеЗаполнено(Объект.ПредполагаемыйМонтажДата), Формат(Объект.ПредполагаемыйМонтажДата, "ДЛФ=D"), "");
	//ЗаголовокНадписи = ЗаголовокНадписи + ?(ЗначениеЗаполнено(Объект.ПредполагаемыйМонтажВремя), " " + Формат(Объект.ПредполагаемыйМонтажВремя, "ДЛФ=T"), "");
	//ЗаголовокНадписи = ЗаголовокНадписи + ?(НЕ ПустаяСтрока(ЗаголовокНадписи), "; ", "");
	//ЗаголовокНадписи = ЗаголовокНадписи + ?(СуммаДоговораНаЗамере > 0, "сумма на замере: " + СуммаДоговораНаЗамере, "");
	
	//Элементы.ДекорацияДанныеЗамера.Заголовок = "Данные замера: " + ?(НЕ ПустаяСтрока(ЗаголовокНадписи), ЗаголовокНадписи, "(отсутствуют)");
	//-- №11768
	
	//++ №11768 заголовок по новому
	ЗаголовокНадписи = ЗаголовокНадписи + ?(ЗначениеЗаполнено(ДатаЗамера), Формат(ДатаЗамера + (ВремяНачалаЗамера - НачалоДня(ВремяНачалаЗамера)), "ДФ='dd.MM.yyyy HH:mm'"), "");
	ЗаголовокНадписи = ЗаголовокНадписи + ?(ЗначениеЗаполнено(РезультатЗамера), " " + РезультатЗамера, "");
	
	Элементы.ДекорацияДанныеЗамера.Заголовок = "Замер " + ?(НЕ ПустаяСтрока(ЗаголовокНадписи), ЗаголовокНадписи, "не указан")
	//-- №11768
		
КонецФункции

&НаСервере
Процедура ЗаполнитьМатериалыПоСпецификацииНаСервере(СписокПозиций, ОчиститьТЧ = Истина)
	
	Если ОчиститьТЧ Тогда
		Объект.Материалы.Очистить();
	КонецЕсли;
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	
	//заполним гуиды строк по ключу Номенклатура+Характеристика+Комната
	ТаблицаУИдов = Новый ТаблицаЗначений;
	ТаблицаУИдов.Колонки.Добавить("Комната");
	ТаблицаУИдов.Колонки.Добавить("Номенклатура");
	ТаблицаУИдов.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаУИдов.Колонки.Добавить("УИСтроки");
	ДеревоМ = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
	Для Каждого ТекущаяСтрокаКомнаты Из ДеревоМ.Строки Цикл
		Для Каждого ТекущаяСтрока Из ТекущаяСтрокаКомнаты.Строки Цикл
			НоваяСтрока = ТаблицаУИдов.Добавить();
			НоваяСтрока.Комната = ТекущаяСтрока.Комната;
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			НоваяСтрока.УИСтроки = ТекущаяСтрока.УИСтроки;
		КонецЦикла;
	КонецЦикла;
	
	ВременнаяТаблица = Новый ТаблицаЗначений; //хранит общее количество необходимых материалов по спецификации после округления общего количества товаров
	ВременнаяТаблица.Колонки.Добавить("Номенклатура");
	ВременнаяТаблица.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ВременнаяТаблица.Колонки.Добавить("ОкруглятьВБольшуюСторону");
	ВременнаяТаблица.Колонки.Добавить("ПорядокОкругленияЧислом");
	ВременнаяТаблица.Колонки.Добавить("КоличествоДоОкругления");
	ВременнаяТаблица.Колонки.Добавить("КоличествоПослеОкругления");
	ВременнаяТаблица.Колонки.Добавить("НоменклатураТоваров");
	ВременнаяТаблица.Колонки.Добавить("УИСтроки");
	
	ТаблицаМатериалов = Новый ТаблицаЗначений;
	ТаблицаМатериалов.Колонки.Добавить("Комната");
	ТаблицаМатериалов.Колонки.Добавить("Номенклатура");
	ТаблицаМатериалов.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаМатериалов.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаМатериалов.Колонки.Добавить("Коэффициент");
	ТаблицаМатериалов.Колонки.Добавить("Количество");
	ТаблицаМатериалов.Колонки.Добавить("НоменклатураТоваров");
	ТаблицаМатериалов.Колонки.Добавить("УИСтроки");	
	
	Для Каждого ТекущаяСтрока Из СписокПозиций Цикл
		НоваяСтрока = ТаблицаМатериалов.Добавить();
		НоваяСтрока.Комната = ТекущаяСтрока.Комната;		
		Для Каждого СтрокаСпецификации Из ТекущаяСтрока.Спецификация.Состав Цикл
			КоэффициентИзменения = ?(СтрокаСпецификации.ФиксированноеКоличество, 1, ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент);
			КоличествоКДобавлению = ОбщийМодуль.ОкруглитьЧисло(КоэффициентИзменения * СтрокаСпецификации.Количество, СтрокаСпецификации.ПорядокОкругленияЧислом, СтрокаСпецификации.ОкруглятьВБольшуюСторону); 
			Если КоличествоКДобавлению > 0 Тогда
				НоваяСтрока = ТаблицаМатериалов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСпецификации);
				НоваяСтрока.Комната = ТекущаяСтрока.Комната;
				НоваяСтрока.Количество = КоличествоКДобавлению;
				НоваяСтрока.НоменклатураТоваров = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.УИСтроки = ТекущаяСтрока.УИСтроки;
				
				НоваяВремСтрока = ВременнаяТаблица.Добавить();
				НоваяВремСтрока.Номенклатура = СтрокаСпецификации.Номенклатура;
				НоваяВремСтрока.ХарактеристикаНоменклатуры = СтрокаСпецификации.ХарактеристикаНоменклатуры;
				НоваяВремСтрока.ОкруглятьВБольшуюСторону = СтрокаСпецификации.ОкруглятьВБольшуюСторону;
				НоваяВремСтрока.ПорядокОкругленияЧислом = СтрокаСпецификации.ПорядокОкругленияЧислом;
				НоваяВремСтрока.КоличествоДоОкругления = КоэффициентИзменения * СтрокаСпецификации.Количество;
				НоваяВремСтрока.КоличествоПослеОкругления = 0;
				НоваяВремСтрока.НоменклатураТоваров = ТекущаяСтрока.Номенклатура;
				НоваяВремСтрока.УИСтроки = ТекущаяСтрока.УИСтроки;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;	
	
	ТаблицаМатериалов.Свернуть("Комната, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, НоменклатураТоваров, УИСтроки","Количество");
	ВременнаяТаблица.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ОкруглятьВБольшуюСторону, ПорядокОкругленияЧислом, НоменклатураТоваров, УИСтроки", "КоличествоДоОкругления, КоличествоПослеОкругления");
	
	//посчитаем сколько какого материала должно быть итого с применением округления
	Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
		ТекущаяСтрока.КоличествоПослеОкругления = ОбщийМодуль.ОкруглитьЧисло(ТекущаяСтрока.КоличествоДоОкругления,ТекущаяСтрока.ПорядокОкругленияЧислом,ТекущаяСтрока.ОкруглятьВБольшуюСторону);
	КонецЦикла;
	
	//получаем итоговое количество каждого материала после всех округлений
	ВременнаяТаблица.Свернуть("Номенклатура, ХарактеристикаНоменклатуры", "КоличествоПослеОкругления");
	
	//перезаполняем количество в результирующей таблице на основании того, сколько должно было бы получиьтся при общем итоге после округления
	Для Каждого ТекущийМатериал Из ТаблицаМатериалов Цикл
		КоличествоБыло = ТекущийМатериал.Количество;
		ТекущийМатериал.Количество = 0;
		Для Каждого ТекущийИтогМатериала Из ВременнаяТаблица Цикл
			Если ТекущийМатериал.Номенклатура = ТекущийИтогМатериала.Номенклатура
				И ТекущийМатериал.ХарактеристикаНоменклатуры = ТекущийИтогМатериала.ХарактеристикаНоменклатуры Тогда //Добавлено условие по характеристике
				
				Если ТекущийИтогМатериала.КоличествоПослеОкругления >= КоличествоБыло Тогда
					ТекущийМатериал.Количество = КоличествоБыло;
					ТекущийИтогМатериала.КоличествоПослеОкругления = ТекущийИтогМатериала.КоличествоПослеОкругления - КоличествоБыло;
				Иначе
					ТекущийМатериал.Количество = ТекущийИтогМатериала.КоличествоПослеОкругления;
					ТекущийИтогМатериала.КоличествоПослеОкругления = 0;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//переносим таблицу в документ
	Если ЗаполнениеМатериаловПоЗаказам Тогда
		Для Каждого ТекущийМатериал Из ТаблицаМатериалов Цикл
			Если НЕ ТекущийМатериал.Количество = 0 Тогда
				НоваяСтрока = Объект.Материалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийМатериал);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//ПроверитьОтсутствиеКомнатВМатериалах();  убрано в процедуру ПерестроитьДеревоНаФорме
	
	//++ №10963 вместо перестроения всех деревьев, делаем перестроение Материалов, т.к. перестраивать дерево Товаров не нужно (раньше оно предварительно помещалось в ТЧ Товары, сейчас нет)
	//ПерестроитьДеревоНаФорме();
	ПерестроитьДеревоМатериалыНаФорме();
	//-- №10963
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры = Неопределено, ЕдиницаИзмерения = Неопределено, 
	//#12539 Фактура = "", ЦветФактуры = "", 
	Количество = 1)
	
	Возврат ЦеныКомпании.ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество,
												Объект.Дата, Объект.ВидЦен, Объект.Валюта, 												 
												Объект.Организация, Объект.Подразделение, 
												Объект.Контрагент, Объект.ДоговорКонтрагента);	
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКоличествоНоменклатуры(Номенклатура)
	
	Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Номенклатура) Тогда
		Если Номенклатура.Потолок_КоличествоПродукция > 0 Тогда
			Возврат Номенклатура.Потолок_КоличествоПродукция;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПроцентВидаСкидки(ВидСкидки)
	Если ВидСкидки.Пустая() Тогда
		Возврат 0;
	Иначе
		Возврат ВидСкидки.Процент;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьСуммуТекущегоДолга()
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыПоЗаказамОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|ГДЕ
	|	РасчетыПоЗаказамОстатки.Заказ = &ЗаказДоговор";
	Запрос.УстановитьПараметр("ЗаказДоговор",Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.СуммаОстаток;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСуммуТекущегоОбщегоДолга()
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(, Контрагент = &Контрагент) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	Запрос.УстановитьПараметр("Контрагент",Объект.Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.СуммаОстаток;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//ПРОЦЕДУРЫ И ФУНКЦИИ НА КЛИЕНТЕ
&НаКлиенте
Процедура РазвернутьДеревоТоваров(Комната = Неопределено, Номенклатура = Неопределено, ИдСтроки = Неопределено)
	
	Если Номенклатура = Неопределено Тогда
		Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	Если Комната = Неопределено Тогда
		Комната = "";
	КонецЕсли;
	
	КоллекцияЭлементовДерева = ЭтаФорма.ДеревоТоваров.ПолучитьЭлементы();
	Если НЕ ИдСтроки = Неопределено Тогда
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Элементы.ДеревоТоваров.Развернуть(ИдентификаторСтроки, Истина);
		КонецЦикла;	
		Элементы.ДеревоТоваров.ТекущаяСтрока = ИдСтроки;
	Иначе		
		ИдТекущейСтроки = Неопределено;
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Для Каждого СтрокаВКомнате Из Строка.ПолучитьЭлементы() Цикл
				Если СтрокаВКомнате.Комната = Комната И СтрокаВКомнате.Номенклатура = Номенклатура Тогда
					ИдТекущейСтроки = СтрокаВКомнате.ПолучитьИдентификатор();
				КонецЕсли;
			КонецЦикла;
			// для случаев добавления новой комнаты / переименования
			Если Строка.Комната = Комната И (Строка.ПолучитьЭлементы().Количество() = 0 ИЛИ Номенклатура = Неопределено ИЛИ Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка")) Тогда
				ИдТекущейСтроки = ИдентификаторСтроки;			
			КонецЕсли;
			Элементы.ДеревоТоваров.Развернуть(ИдентификаторСтроки, Истина);
		КонецЦикла;
		Элементы.ДеревоТоваров.ТекущаяСтрока = ИдТекущейСтроки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоМатериалов(Комната = Неопределено, Номенклатура = Неопределено, ИдСтроки = Неопределено)
	
	Если Номенклатура = Неопределено Тогда
		Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	Если Комната = Неопределено Тогда
		Комната = "";
	КонецЕсли;
	
	КоллекцияЭлементовДерева = ЭтаФорма.ДеревоМатериалов.ПолучитьЭлементы();
	Если НЕ ИдСтроки = Неопределено Тогда
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Элементы.ДеревоТоваров.Развернуть(ИдентификаторСтроки, Истина);
		КонецЦикла;	
		Элементы.ДеревоТоваров.ТекущаяСтрока = ИдСтроки;
	Иначе
		ИдТекущейСтроки = Неопределено;
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Если Строка.Комната = Комната И Строка.Номенклатура = Номенклатура Тогда
				ИдТекущейСтроки = ИдентификаторСтроки;
			КонецЕсли;
			Элементы.ДеревоМатериалов.Развернуть(ИдентификаторСтроки, Истина);
		КонецЦикла;
		Элементы.ДеревоМатериалов.ТекущаяСтрока = ИдТекущейСтроки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьТекущегоДолгаКонтрагента()
	ТекущийДолг = ПолучитьСуммуТекущегоДолга();
	ТекущийДолгОбщий = ПолучитьСуммуТекущегоОбщегоДолга();
	Если ТекущийДолг > 0 Тогда
		Элементы.ТекущийДолг.ЦветТекста = WebЦвета.Красный;
		Элементы.ТекущийДолг.Шрифт = Новый Шрифт(Элементы.ТекущийДолг.Шрифт, ,,Истина);
	Иначе
		Элементы.ТекущийДолг.ЦветТекста = WebЦвета.ТемноЗеленый;
		Элементы.ТекущийДолг.Шрифт = Новый Шрифт(Элементы.ТекущийДолг.Шрифт, ,,Ложь);
	КонецЕсли;
	Если ТекущийДолгОбщий > 0 Тогда
		Элементы.ТекущийДолгОбщий.ЦветТекста = WebЦвета.Красный;
		Элементы.ТекущийДолгОбщий.Шрифт = Новый Шрифт(Элементы.ТекущийДолгОбщий.Шрифт, ,,Истина);
	Иначе
		Элементы.ТекущийДолгОбщий.ЦветТекста = WebЦвета.ТемноЗеленый;
		Элементы.ТекущийДолгОбщий.Шрифт = Новый Шрифт(Элементы.ТекущийДолгОбщий.Шрифт, ,,Ложь);
	КонецЕсли;
	
	Если РаботаСВалютой.ОтображатьЗадолженностьКонтрагентаВВалюте() Тогда
		Элементы.ДолгВВалюте.Видимость = Истина;
		ДолгВВалюте = РаботаСВалютой.ПолучитьТекстНадписиДолгаКонтрагентаВВалютеОтображенияЗадолженности(, Объект.Контрагент, Объект.Организация);
	Иначе
		Элементы.ДолгВВалюте.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементовФормы(Знач ТекущаяКомната = Неопределено, Знач ТекущаяНоменклатура = Неопределено)
	
	СформироватьНадписьПредварительныеДанныеЗамера();
	//Элементы.ДекорацияИмяКлиента.Заголовок = "Имя клиента: " + ПолучитьИмяКлиентаЗамера() + " Адрес: " + ПолучитьАдресКлиентаЗамера();
	//Элементы.ДекорацияДатаВремяМонтажа.Заголовок = ПолучитьНадписьДатаИВремяМонтажаПоЗамеру();
	//Элементы.ДекорацияСуммаДоговораВЗамере.Заголовок = ПолучитьНадписьСумаДоговораВЗамере();
	//Если Объект.ПредполагаемыйМонтажДатаМонтажаНеОпределена Тогда
	//	Элементы.ГруппаДатаВремяМонтажа.Видимость = Ложь;
	//	Элементы.ГруппаДатаПоЗвонку.Видимость = Истина;
	//Иначе
	//	Элементы.ГруппаДатаПоЗвонку.Видимость = Ложь;
	//	Элементы.ГруппаДатаВремяМонтажа.Видимость = Истина;
	//КонецЕсли;	
	
	ОбновитьНадписьТекущегоДолгаКонтрагента();
	
	//Элементы.ВвестиВозвратДенегПоДоговору.Доступность = Объект.ДоговорРассторгнут;
	
	//обновим отображение деревьев - выполнятеся в РассчитатьИтоговыеПоказателиКлиент
	//ЭлементыДерева = ДеревоТоваров.ПолучитьЭлементы();
	//Для Каждого ТекущаяСтрока Из ЭлементыДерева Цикл
	//	ТекущаяСтрока.Сумма = ПолучитьСуммуИтогоПоКомнате(ТекущаяСтрока.Комната, "Сумма");		
	//	ТекущаяСтрока.СуммаПоПрайсу = ПолучитьСуммуИтогоПоКомнате(ТекущаяСтрока.Комната, "СуммаПоПрайсу"); 
	//КонецЦикла;
	
	//Если мИспользоватьАвтоматическиеСкидки Тогда 
	//	Элементы.ДеревоТоваровПроцентАвтоматическойСкидки.Видимость = Истина;
	//	Элементы.ДеревоТоваровСуммаАвтоматическойСкидки.Видимость = Истина;
	//КонецЕсли;
	
	Если НЕ Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено Тогда
		Если ТекущаяКомната = Неопределено Тогда
			ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
		КонецЕсли;
		Если ТекущаяНоменклатура = Неопределено Тогда
			ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();	
	РазвернутьДеревоТоваров(ТекущаяКомната,ТекущаяНоменклатура); 
	
	//НАЧАЛО Переход на 2.0 R2	
	ЗаполнитьВычисляемыеДанныеПоМатериалам();	
	РазвернутьДеревоМатериалов();
	//КОНЕЦ  Переход на 2.0 R2
	
	Если Объект.ПроцентЗамерщику = 0 Тогда 
		Элементы.КомандаПроцентЗамерщику.Заголовок = "Установить %";
	Иначе
		Элементы.КомандаПроцентЗамерщику.Заголовок = "Начислить: " + Строка(Объект.ПроцентЗамерщику) + " %";
	КонецЕсли;
	
	КомандаОбновитьСписокФайлов(Неопределено);
	
	Элементы.ПоказатьОтчетСравнениеСМонтажами.Видимость = ПоказатьКнопкуОтчетаСравненияСМонтажами;
	Элементы.RVY_Отправить.Видимость = RVY_ИспользоватьИнтеграцию;
	ТекущийСтатусМаксимальнаяШирина = 40;
	ТекущийСтатусМаксимальнаяШирина = ТекущийСтатусМаксимальнаяШирина - ?(ПоказатьКнопкуОтчетаСравненияСМонтажами, 4, 0);
	ТекущийСтатусМаксимальнаяШирина = ТекущийСтатусМаксимальнаяШирина - ?(RVY_ИспользоватьИнтеграцию, 4, 0);
	Элементы.ТекущийСтатус.МаксимальнаяШирина = ТекущийСтатусМаксимальнаяШирина;
	
	//УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
	//Элементы.СтавкаНДС.Видимость 				= УчитыватьНДС;
	//Элементы.ДеревоТоваровСтавкаНДС.Видимость 	= УчитыватьНДС;
	//Элементы.ДеревоТоваровСуммаНДС.Видимость 	= УчитыватьНДС;
	//Элементы.ГруппаНДС.Видимость				= УчитыватьНДС;
	//Если УчитыватьНДС Тогда
	//	Элементы.ИтогиВсегоНДС.Заголовок = Объект.ТоварыУслуги.Итог("СуммаНДС");
	//КонецЕсли;
	
	Элементы.ДеревоТоваровМонтаж.Видимость = Объект.ЗаполнятьУИСтрок;
	
	ПолучитьВсеПодчиненныеДокументыПоПотолкам();
	
	// №6303 закомментировано - переведен в документ "Расторжение договора"
	//// Расторжение
	//Элементы.ГруппаРасторжениеТовары.Видимость 				= Объект.РасторжениеБезВозвратаДенегКлиенту;
	//Элементы.ГруппаРасторжениеМатериалы.Видимость 			= Объект.РасторжениеБезВозвратаДенегКлиенту;
	//Элементы.РасторжениеСкладСписанияТоваров.Доступность 	= Объект.РасторжениеСписатьТовары;
	//Элементы.РасторжениеСкладСписанияМатериалов.Доступность = Объект.РасторжениеСписатьМатериалы;	
	//Элементы.ГруппаРасторжение.Видимость 					= (Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен"));
		
	//Если ПустаяСтрока(Объект.ПричинаРассторженияДоговора) Тогда
	//	Элементы.ГруппаРасторжение.Картинка = БиблиотекаКартинок.Предупреждение;
	//Иначе
	//	Элементы.ГруппаРасторжение.Картинка = Новый Картинка;
	//КонецЕсли;
	
	// №6828
	Если Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен") 
		//#16242
		И Объект.ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Договор") Тогда
		Если ЗначениеЗаполнено(СоглашениеОРасторженииДоговора) Тогда  // #12168
			Элементы.ДекорацияДоговорРасторгнут.Видимость = Истина;
			Элементы.ГруппаТекущийСтатус.Видимость = Ложь;
			Элементы.ДекорацияДоговорРасторгнут.Заголовок = "Отменен: " + СоглашениеОРасторженииДоговора;
		Иначе	
			Элементы.ДекорацияДоговорРасторгнут.Видимость = Ложь;
			Элементы.ГруппаТекущийСтатус.Видимость = Истина;
			Сообщить("Заказ-договор в статусе ""Отменен"", но не найдено проведенное соглашение о расторжении договора");
		КонецЕсли;
	Иначе
		Элементы.ДекорацияДоговорРасторгнут.Видимость = Ложь;
		Элементы.ГруппаТекущийСтатус.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстовоеПредставлениеСостоянияПроизводстваПотолка(ЗаказДоговор)
	
	Заказан = 0;
	Произведен = 0;
	Отгружен = 0;
	Получен = 0;
	Потребность = 0;
	
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыРозницыВПроизводствеОбороты.ЗаказанОборот КАК Заказан,
	|	ЗаказыРозницыВПроизводствеОбороты.ПроизведенОборот КАК Произведен,
	|	ЗаказыРозницыВПроизводствеОбороты.ОтгруженОборот КАК Отгружен,
	|	ЗаказыРозницыВПроизводствеОбороты.ПолученОборот КАК Получен,
	|	ЗаказыРозницыВПроизводствеОбороты.ПотребностьОборот КАК Потребность
	|ИЗ
	|	РегистрНакопления.ЗаказыРозницыВПроизводстве.Обороты(, , , ЗаказДоговор = &ЗаказДоговор) КАК ЗаказыРозницыВПроизводствеОбороты";
	Запрос.УстановитьПараметр("ЗаказДоговор",ЗаказДоговор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Заказан 	= Выборка.Заказан;
		Произведен 	= Выборка.Произведен;
		Отгружен 	= Выборка.Отгружен;
		Получен 	= Выборка.Получен;
		Потребность = Выборка.Потребность;
	КонецЦикла;
	
	Если Потребность = 0 Тогда
		//на производство ничего не собирались заказывать
		Возврат "";
	Иначе
		Если Получен >= Потребность Тогда
			Возврат "получен на склад";
		ИначеЕсли Отгружен >= Потребность Тогда
			Возврат "отгружен с производства";
		ИначеЕсли Произведен >= Потребность Тогда
			Возврат "произведен на производстве";
		ИначеЕсли Заказан >= Потребность Тогда
			Возврат "заказан в производство";
		Иначе
			Возврат "требуется оформить заказ на производство";
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ПеренестиДеревоВТабличнуюЧасть(ПеренестиТовары = Истина, ПеренестиМатериалы = Истина)
	
	//ТОВАРЫ И УСЛУГИ
	//ЗаполнитьПустыеУИСДерева(ДеревоТоваров);
	Если ПеренестиТовары Тогда
		Объект.ТоварыУслуги.Очистить();
		Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
		ЗаполнитьПустыеУИСДерева(Дерево);
		Для Каждого Строка из Дерево.Строки Цикл
			Для Каждого СтрНоменклатура из Строка.Строки Цикл
				Если НЕ СтрНоменклатура.Номенклатура.Пустая() Тогда				
					Стр = Объект.ТоварыУслуги.Добавить();
					ЗаполнитьЗначенияСвойств(Стр, СтрНоменклатура);
					Стр.СуммаПоПрайсу = Стр.ЦенаПоПрайсу * Стр.Количество;
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
		ПересчитатьСуммуДокументаНаСервере();
		КоличествоСтрокТоваров    = Объект.ТоварыУслуги.Количество();
	КонецЕсли;
	
	//КомнатыТоваров = Объект.ТоварыУслуги.Выгрузить(); //нужна для отслеживания удаленных комнат в товарах
	//КомнатыТоваров.Свернуть("Комната");
	
	//МАТЕРИАЛЫ
	Если ПеренестиМатериалы Тогда
		Объект.Материалы.Очистить();
		Если ЗаполнениеМатериаловПоЗаказам Тогда
			Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
			ЗаполнитьПустыеУИСДерева(Дерево);
			Для Каждого Строка из Дерево.Строки Цикл
				//НайденнаяКомната = КомнатыТоваров.Найти(Строка.Комната, "Комната");
				//Если НЕ НайденнаяКомната = Неопределено Тогда //переносим данные только по тем комнатам, что есть в товарах  // #5010 не только
				Для Каждого СтрНоменклатура из Строка.Строки Цикл
					Если НЕ СтрНоменклатура.Номенклатура.Пустая() Тогда
						Стр = Объект.Материалы.Добавить();
						ЗаполнитьЗначенияСвойств(Стр, СтрНоменклатура);
					КонецЕсли;
				КонецЦикла;	
				//КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		КоличествоСтрокМатериалов = Объект.Материалы.Количество();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция АвтоматическиПрисваиватьНомерДоговораВЗаказДоговоре()
	Возврат Константы.АвтоматическиПрисваиватьНомерДоговораВЗаказДоговоре.Получить();
КонецФункции

&НаСервере 
Функция ПолучитьЗначениеКонстантыАвтоматическихСкидок()
	Возврат Константы.ИспользоватьАвтоматическиеСкидки.Получить();
КонецФункции

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСпецификации(Команда)
	
	Если Объект.Материалы.Количество() > 0 тогда
		НовоеОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОбОчисткеМатериалов",ЭтаФорма);
		ПоказатьВопрос(НовоеОписаниеОповещения, "Табличная часть ""Материалы"" будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе		
		ЗаполнитьМатериалыПоСпецификацииНаСервере(ПолучитьСписокПозицийДляПерезаполненияМатериаловПоСпецификации());
		РазвернутьДеревоМатериалов();
		РазвернутьДеревоТоваров();
		ОбновитьОтображениеЭлементовФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеМатериалов(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьМатериалыПоСпецификацииНаСервере(ПолучитьСписокПозицийДляПерезаполненияМатериаловПоСпецификации());
	РазвернутьДеревоМатериалов();
	РазвернутьДеревоТоваров();
	ОбновитьОтображениеЭлементовФормы();

КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуДокументаНаСервере()
	Объект.СуммаДокумента = Объект.ТоварыУслуги.Итог("Сумма");
	Объект.СуммаДокументаПоПрайсу = Объект.ТоварыУслуги.Итог("СуммаПоПрайсу");
	
	ОбновитьДопИнформацию();
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьДопИнформацию()
	
	ДопИнфоПлощадьЗаказа = Документы.ЗаказДоговор.РассчитатьПлощадьПотолков(Объект.ТоварыУслуги);
	ДопИнфоСтоимостьКВМ  = ?(ДопИнфоПлощадьЗаказа = 0, 0, Объект.СуммаДокумента / ДопИнфоПлощадьЗаказа);

КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Коэффициент = 1;
	СтрокаТабличнойЧасти.Количество = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Функция РазрешеноЗаказыватьПоставщикуНеуникальныеПотолки()
//	Возврат Константы.РазрешеноЗаказыватьПоставщикуНеуникальныеПотолки.Получить();
//КонецФункции

//&НаКлиенте
//Процедура ОформитьЗаказПоставщику(Команда)
//	СоздатьЗаказПоставщику = Ложь;
//	
//	// #12540 удалено
//	//Если НЕ ВсеПотолкиПодготовленыДляПроизводства() Тогда
//	//	Если НЕ РазрешеноЗаказыватьПоставщикуНеуникальныеПотолки() Тогда
//	//		ПоказатьПредупреждение(,"Перед заказом поставщику, необходимо всем потолкам присвоить номера и создать соответствующую номенклатуру",,"Отказ");
//	//	Иначе
//	//		СоздатьЗаказПоставщику = Истина;
//	//	КонецЕсли;
//	//Иначе
//		СоздатьЗаказПоставщику = Истина;
//	//КонецЕсли;
//	
//	Если СоздатьЗаказПоставщику Тогда
//		ПараметрыНовогоДокумента = Новый Структура;
//		ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
//		ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ФормаДокумента", ПараметрыНовогоДокумента);
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ВвестиОплатуНаличными(Команда)
//	ОповещениеПослеПринятияОплаты = Новый ОписаниеОповещения("ПослеПринятияОплаты",ЭтаФорма);
//	
//	ПараметрыНовогоДокумента = Новый Структура;
//	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
//	ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокумента", ПараметрыНовогоДокумента,,,,,ОповещениеПослеПринятияОплаты);
//КонецПроцедуры

&НаКлиенте
Процедура ВвестиОплатуРассрочки(Наличными = Истина)
	
	ТекущиеДанные = Элементы.ГрафикОплат.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Сумма = ТекущиеДанные.Оплачено Тогда
		Предупреждение("По данной строке оплата полностью произведена. Выберите другую строку!");
		Возврат;	
	КонецЕсли;
		
	ОповещениеПослеПринятияОплаты = Новый ОписаниеОповещения("ПослеПринятияОплаты",ЭтаФорма);
		
	ПараметрыНовогоДокумента = Новый Структура;
	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
	ПараметрыНовогоДокумента.Вставить("РассрочкаДатаПлатежа", Элементы.ГрафикОплат.ТекущиеДанные.ДатаПлатежа);
	ПараметрыНовогоДокумента.Вставить("РассрочкаСумма", Элементы.ГрафикОплат.ТекущиеДанные.Сумма - Элементы.ГрафикОплат.ТекущиеДанные.Оплачено);
	ПараметрыЗаполнения = Новый Структура("ЗначенияЗаполнения", ПараметрыНовогоДокумента);

	ИмяФормыОснования = "Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокумента";
	Если НЕ Наличными Тогда
		ИмяФормыОснования = "Документ.ОплатаБанковскойКартой.Форма.ФормаДокумента";
	КонецЕсли;
	ОткрытьФорму(ИмяФормыОснования, ПараметрыЗаполнения,,,,,ОповещениеПослеПринятияОплаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиОплатуНаличнымиРассрочки(Команда)
	
	ВвестиОплатуРассрочки();
		
КонецПроцедуры

&НаКлиенте
Процедура ВвестиОплатуКартойРассрочки(Команда)
	
	ВвестиОплатуРассрочки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПринятияОплаты(Парам, Парам2) Экспорт
	ОбновитьОтображениеЭлементовФормы();
	ОбновитьКолонкуГрафикОплатОплачено();
КонецПроцедуры

&НаСервере
Процедура ВидСкидкиПриИзмененииНаСервере()
	
	ЕстьСтрокиСВыполненнымиМонтажами = Ложь;
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Для Каждого СтрНоменклатура из Строка.Строки Цикл
			Если СтрНоменклатура.Бесплатно Тогда
				Продолжить;
			КонецЕсли;
			Если СтрНоменклатура.МонтажСтатус = Справочники.РезультатыМонтажа.Выполнен или СтрНоменклатура.МонтажСтатус = Справочники.РезультатыМонтажа.Закрыт Тогда
				ЕстьСтрокиСВыполненнымиМонтажами = Истина;
			Иначе
				СтрНоменклатура.ПроцентСкидки = ПолучитьПроцентВидаСкидки(Объект.ВидСкидки) + ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Объект.Дата, СтрНоменклатура.Номенклатура, СтрНоменклатура.Количество);
				РассчитатьСуммуСтрокиНаСервере(СтрНоменклатура);
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	ПеренестиДеревоВТабличнуюЧасть();
	
	Если ЕстьСтрокиСВыполненнымиМонтажами Тогда
		Сообщить("При изменении скидки были пропущены строки с выполненными и закрытыми монтажами");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСкидкиПриИзменении(Элемент)
	ВидСкидкиПриИзмененииНаСервере();
	РассчитатьИтоговыеПоказателиКлиент();
	ОбновитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаСервере
Функция ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат()
	Возврат Константы.ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат.Получить();	
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущаяСтрока, НеПересчитыватьСуммуРучнойСкидки = Ложь)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущаяСтрока.ПроцентСкидки = 100 Тогда
		ТекущаяСтрока.Сумма = 0;
		Если НЕ НеПересчитыватьСуммуРучнойСкидки Тогда
			ТекущаяСтрока.СуммаСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		КонецЕсли;
	Иначе
		Если НЕ ТекущаяСтрока.ПроцентСкидки = 0 Тогда
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * (1 - ТекущаяСтрока.ПроцентСкидки / 100);
			Если НЕ НеПересчитыватьСуммуРучнойСкидки Тогда
				ТекущаяСтрока.СуммаСкидки = (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена) - ТекущаяСтрока.Сумма;
			КонецЕсли;
		Иначе
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			Если НЕ НеПересчитыватьСуммуРучнойСкидки Тогда
				ТекущаяСтрока.СуммаСкидки = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	ТекущаяСтрока.СуммаПоПрайсу = ТекущаяСтрока.ЦенаПоПрайсу * ТекущаяСтрока.Количество;	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуСтрокиНаСервере(СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.ТоварыУслуги.ТекущиеДанные;
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(СтрокаТабличнойЧасти, "ПроцентСкидки", "СуммаСкидки");
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, "СуммаСкидки");
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуПоПрайсуВСтрокеТЧ(СтрокаТабличнойЧасти);
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
	//Если ТекущаяСтрока.ПроцентСкидки = 100 Тогда
	//	ТекущаяСтрока.Сумма = 0;
	//	ТекущаяСтрока.СуммаСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	//Иначе
	//	Если НЕ ТекущаяСтрока.ПроцентСкидки = 0 Тогда
	//		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * (1 - ТекущаяСтрока.ПроцентСкидки / 100);
	//		ТекущаяСтрока.СуммаСкидки = (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена) - ТекущаяСтрока.Сумма;
	//	Иначе
	//		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	//		ТекущаяСтрока.СуммаСкидки = 0;
	//	КонецЕсли;
	//КонецЕсли;
	//ТекущаяСтрока.СуммаПоПрайсу = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаПоПрайсу;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Дата, Номенклатура, Количество)
	//ВыборкаСкидок = РегистрыСведений.ЗначенияАвтоматическихСкидок.ПолучитьПоследнее(Объект.Дата, Новый Структура("Номенклатура", Номенклатура));
	
	Скидка = 0;
	
	Если ИспользоватьАвтоматическиеСкидки Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияАвтоматическихСкидокСрезПоследних.КоличествоОт,
		|	ЗначенияАвтоматическихСкидокСрезПоследних.РазмерСкидки
		|ИЗ
		|	РегистрСведений.ЗначенияАвтоматическихСкидок.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЗначенияАвтоматическихСкидокСрезПоследних";
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда 
			Возврат Скидка;
		КонецЕсли;
		
		ТаблицаСкидок = РезультатЗапроса.Выгрузить();
		ТаблицаСкидок.Сортировать("КоличествоОт");
		Для Каждого Стр из ТаблицаСкидок Цикл
			Если Количество >= Стр.КоличествоОт Тогда 
				Скидка = Стр.РазмерСкидки;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
	Возврат Скидка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПроцентСкидки(ИспользоватьАвтоматическиеСкидки, ВидСкидки, Дата, Номенклатура, Количество)
	Возврат ПолучитьПроцентВидаСкидки(ВидСкидки) + ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Дата, Номенклатура, Количество);
КонецФункции
		
&НаКлиенте
Процедура ТоварыУслугиПроцентСкидкиПриИзменении(Элемент)
	РассчитатьСуммуСтроки(Элементы.ТоварыУслуги.ТекущиеДанные);
	РассчитатьИтоговыеПоказателиКлиент();
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыМонтажаПоЗамеру()
	
	ПараметрыНовогоДокумента = Новый Структура;
	ПараметрыНовогоДокумента.Вставить("ЗаполнениеНаОсновании", Истина);
	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
	ПараметрыНовогоДокумента.Вставить("Адрес", Объект.Адрес);
	ПараметрыНовогоДокумента.Вставить("Сумма", Объект.СуммаДокумента);
	ПараметрыНовогоДокумента.Вставить("Контрагент", Объект.Контрагент);
	
	//Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Замер") Тогда
	//	ПараметрыНовогоДокумента.Вставить("ДатаМонтажа", Объект.Основание.ДатаМонтажа);
	//	ПараметрыНовогоДокумента.Вставить("ВремяНачала", Объект.Основание.ВремяМонтажа);
	//Иначе
	//Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Лид") Тогда
		ПараметрыНовогоДокумента.Вставить("ДатаМонтажа", Объект.ОжидаемаяДатаОтгрузки);
		ПараметрыНовогоДокумента.Вставить("ВремяНачала", Объект.ОжидаемоеВремяОтгрузки);
	//КонецЕсли;
	
	Возврат ПараметрыНовогоДокумента;
	
КонецФункции

//&НаКлиенте
//Процедура ЗапланироватьМонтаж(Команда)
//	
//	Если Объект.СуммаДокумента = 0 Тогда
//		Сообщить("Не указана сумма договора!",СтатусСообщения.Важное);
//		Возврат;
//	КонецЕсли;
//	
//	Попытка
//		//ПараметрыНовогоДокумента = ПолучитьПараметрыМонтажаПоЗамеру();
//		ПараметрыНовогоДокумента = Новый Структура("ЗначенияЗаполнения", Новый Структура("Основание, ВидОперации", Объект.Ссылка, ПредопределенноеЗначение("Справочник.ВидыМонтажа.Монтаж")));
//		ОткрытьФорму("Документ.Монтаж.ФормаОбъекта", ПараметрыНовогоДокумента);
//	Исключение
//		Сообщить(ОписаниеОшибки());
//	КонецПопытки;
//	

//КонецПроцедуры

// #12540 удалено
//&НаСервере
//Функция ВсеПотолкиПодготовленыДляПроизводства()
//	
//	Результат = Истина;
//	
//	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
//	Для Каждого ТекСтрокаДерева Из Дерево.Строки Цикл
//		Для Каждого ТекущаяСтрока Из ТекСтрокаДерева.Строки Цикл
//			Если ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.Потолок Тогда
//				Результат = Ложь;
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции

//&НаСервере
//Функция ПодготовитьСписокТоваровДляВыбораПользователемКПроизводствуНаСервере()
//	
//	СписокТоваров = ОбщийМодульСервер.ПодготовитьСписокТоваровДляВыбораПользователемКПроизводствуИзРозницы(Объект.Ссылка);
//	МассивСообщений = Новый Массив;
//	Если НЕ ОбщийМодульСервер.ПроверитьСписокТоваровКПроизводствуИзРозницы(СписокТоваров, МассивСообщений) Тогда
//		Для каждого ТекстОшибки из МассивСообщений Цикл
//			Сообщить(ТекстОшибки);	
//		КонецЦикла;
//		Возврат Неопределено;
//	КонецЕсли;
//	Возврат СписокТоваров;
//	
//КонецФункции

//&НаКлиенте
//Процедура ВвестиОплатуБанковскойКартой(Команда)
//	ОповещениеПослеПринятияОплаты = Новый ОписаниеОповещения("ПослеПринятияОплаты",ЭтаФорма);
//	
//	ПараметрыНовогоДокумента = Новый Структура;
//	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
//	ОткрытьФорму("Документ.ОплатаБанковскойКартой.Форма.ФормаДокумента", ПараметрыНовогоДокумента,,,,,ОповещениеПослеПринятияОплаты);
//КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОплатыПоРассрочке(Команда)
	
КонецПроцедуры

&НаСервере
Процедура ДоговорРассторгнутПриИзмененииНаСервере()
	
	Если Объект.ДоговорРассторгнут Тогда
		Объект.ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.Отменен;
	Иначе
		Объект.ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.ВРаботе;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорРассторгнутПриИзменении(Элемент)
	ДоговорРассторгнутПриИзмененииНаСервере();
	ОбновитьОтображениеЭлементовФормы();
	ПроверитьНеобходимостьОтменыМонтажей = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОПересчетеЦен()
	
	Если Объект.ТоварыУслуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПересчетеЦен", ЭтотОбъект);	
	ПоказатьВопрос(ОписаниеОповещения, "Изменился вид цен или валюта документа. Пересчитать цены товаров и услуг?", РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПересчетеЦен(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьЦеныПоВидуЦен();
		ОбновитьОтображениеЭлементовФормы();
		РассчитатьИтоговыеПоказателиКлиент();
		РазвернутьДеревоТоваров();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЦеныПоВидуЦен()
	//Начало изменен при переходе на 2.0
	//Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	//Для Каждого ТекущаяСтрока Из Дерево.Строки Цикл
	//	Для Каждого СтрСтрока Из ТекущаяСтрока.Строки Цикл
	//		СтрСтрока.Цена = ПолучитьЦенуНоменклатуры(СтрСтрока.Номенклатура, СтрСтрока.ХарактеристикаНоменклатуры, СтрСтрока.ЕдиницаИзмерения);
	//		СтрСтрока.ЦенаПоПрайсу = СтрСтрока.Цена;
	//		РассчитатьСуммуСтрокиНаСервере(СтрСтрока);
	//	КонецЦикла;
	//КонецЦикла;
	//ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	//ПеренестиДеревоВТабличнуюЧасть();
	
	//Перезагрузим потолоки для переоценки
	Врем_Потолки = новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.ТоварыУслуги Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.НомерПотолка) 
			И Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) 
			И ТекущаяСтрока.ЗагруженоИзПостроителя Тогда
			Врем_Потолки.Добавить(Новый Структура("Номенклатура, Комната", ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Комната));
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого Потолок Из Врем_Потолки Цикл
		ОписаниеОшибки = "";
		Документы.ЗаказДоговор.СоздатьНоменклатуруПоФайлуНаСервере(Объект, Потолок.Номенклатура,, Потолок.Комната, УчитыватьНДС, , ОписаниеОшибки);
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			Сообщить(ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;				
	
	//Переоценим товары не относящиеся к потолкам
	Для Каждого ТекущаяСтрока Из Объект.ТоварыУслуги Цикл
		Если ТекущаяСтрока.Бесплатно Тогда
			Продолжить;
		КонецЕсли;
		//++#6986
		// цена на простые потолки
		Если (ЗначениеЗаполнено(ТекущаяСтрока.НомерПотолка) 
			И Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) 
			И НЕ ТекущаяСтрока.ЗагруженоИзПостроителя)		
		//--#6986
			ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.НомерПотолка) Тогда
			ТекущаяСтрока.Цена = ПолучитьЦенуНоменклатуры(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения);
			ТекущаяСтрока.ЦенаПоПрайсу = ТекущаяСтрока.Цена;
			РассчитатьСуммуСтрокиНаСервере(ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	ПерестроитьДеревоНаФорме();	
	//Конец изменен при переходе на 2.0
КонецФункции

&НаКлиенте
Процедура ТоварыУслугиСуммаСкидкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТоварыУслуги.ТекущиеДанные;
	Если НЕ ТекущаяСтрока.СуммаСкидки = 0 Тогда
		Если НЕ ТекущаяСтрока.Количество = 0 и НЕ ТекущаяСтрока.Цена = 0 Тогда
			ТекущаяСтрока.ПроцентСкидки = Окр((ТекущаяСтрока.СуммаСкидки / (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена)) * 100,2);
			РассчитатьСуммуСтроки(ТекущаяСтрока);
		Иначе
			ТекущаяСтрока.ПроцентСкидки = 100;
			РассчитатьСуммуСтроки(ТекущаяСтрока);
		КонецЕсли;
	Иначе 
		ТекущаяСтрока.ПроцентСкидки = 0;
		РассчитатьСуммуСтроки(ТекущаяСтрока);
	КонецЕсли;
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

//&НаСервере
//Функция ЭтоТовар(Номенклатура)
//	Если Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал Тогда
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;
//КонецФункции

//&НаСервере
//Функция ЭтоУслуга(Номенклатура)
//	Если Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;
//КонецФункции

&НаСервере
Функция ЭтоПотолок(Номенклатура)
	Возврат Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Номенклатура);
КонецФункции

//&НаСервере
//Процедура ПроцедураПослеВВодаСкидкиНаСервере(ВыбЗнач, Параметры)
//	
//	ЕстьСтрокиСВыполненнымиМонтажами = Ложь;
//	
//	Если ВыбЗнач<>Неопределено Тогда
//		Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
//		Предмет = "";
//		Если Параметры.Свойство("Предмет",Предмет) Тогда
//			Если Предмет = "Товары" Тогда
//				Для Каждого ТекСтрокаДерева Из Дерево.Строки Цикл
//					Для Каждого ТекущаяСтрока Из ТекСтрокаДерева.Строки Цикл
//						Если ЭтоТовар(ТекущаяСтрока.Номенклатура) Тогда
//							Если ТекущаяСтрока.МонтажСтатус = Справочники.РезультатыМонтажа.Выполнен или ТекущаяСтрока.МонтажСтатус = Справочники.РезультатыМонтажа.Закрыт Тогда
//								ЕстьСтрокиСВыполненнымиМонтажами = Истина;
//							Иначе
//								ТекущаяСтрока.ПроцентСкидки = ВыбЗнач;
//								РассчитатьСуммуСтрокиНаСервере(ТекущаяСтрока);
//							КонецЕсли;
//						КонецЕсли;
//					КонецЦикла;
//				КонецЦикла;
//			ИначеЕсли Предмет = "Услуги" Тогда
//				Для Каждого ТекСтрокаДерева Из Дерево.Строки Цикл
//					Для Каждого ТекущаяСтрока Из ТекСтрокаДерева.Строки Цикл
//						Если ЭтоУслуга(ТекущаяСтрока.Номенклатура) Тогда
//							Если ТекущаяСтрока.МонтажСтатус = Справочники.РезультатыМонтажа.Выполнен или ТекущаяСтрока.МонтажСтатус = Справочники.РезультатыМонтажа.Закрыт Тогда
//								ЕстьСтрокиСВыполненнымиМонтажами = Истина;
//							Иначе
//								ТекущаяСтрока.ПроцентСкидки = ВыбЗнач;
//								РассчитатьСуммуСтрокиНаСервере(ТекущаяСтрока);
//							КонецЕсли;
//						КонецЕсли;
//					КонецЦикла;
//				КонецЦикла;
//			ИначеЕсли Предмет = "Потолок" Тогда
//				Для Каждого ТекСтрокаДерева Из Дерево.Строки Цикл
//					Для Каждого ТекущаяСтрока Из ТекСтрокаДерева.Строки Цикл
//						Если ЭтоПотолок(ТекущаяСтрока.Номенклатура) Тогда
//							Если ТекущаяСтрока.МонтажСтатус = Справочники.РезультатыМонтажа.Выполнен или ТекущаяСтрока.МонтажСтатус = Справочники.РезультатыМонтажа.Закрыт Тогда
//								ЕстьСтрокиСВыполненнымиМонтажами = Истина;
//							Иначе
//								ТекущаяСтрока.ПроцентСкидки = ВыбЗнач;
//								РассчитатьСуммуСтрокиНаСервере(ТекущаяСтрока);
//							КонецЕсли;
//						КонецЕсли;
//					КонецЦикла;
//				КонецЦикла;
//			КонецЕсли;
//		КонецЕсли;
//		ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
//		Модифицированность = Истина;
//	КонецЕсли;
//	
//	Если ЕстьСтрокиСВыполненнымиМонтажами Тогда
//		Сообщить("При установке скидки были пропуцщены строки по выполненным и закрытым монтажам");
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПроцедураПослеВВодаСкидки(ВыбЗнач, Параметры) Экспорт
//	
//	ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
//	ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
//	
//	ПроцедураПослеВВодаСкидкиНаСервере(ВыбЗнач, Параметры);
//	ПеренестиДеревоВТабличнуюЧасть();
//	РассчитатьИтоговыеПоказателиКлиент();
//	Состояние("Скидка установлена");
//	
//	ОбновитьОтображениеЭлементовФормы(ТекущаяКомната, ТекущаяНоменклатура);
//	
//КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуНаПотолок(Команда)
	
	//УстановитьСкидку = 0;
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Форма", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ЭтоЗаказ", Истина);
	ПараметрыПроцедуры.Вставить("Предмет", "Потолок");
	ПараметрыПроцедуры.Вставить("ТекстСообщения", "Введите % скидки на полотно");
	ОповещениеПослеИзмененияСкидки = Новый ОписаниеОповещения("ИзменитьСкидкуПослеИзмененияСкидки", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ОповещениеПослеИзмененияСкидки", ОповещениеПослеИзмененияСкидки);
		
	ОбщийМодульКлиент.Розница_ИзменитьСкидку(ПараметрыПроцедуры);	
	//ПроцедураПослеВВодаСкидки = Новый ОписаниеОповещения("ПроцедураПослеВВодаСкидки", ЭтаФорма, ПараметрыПроцедуры);
	//ПоказатьВводЗначения(ПроцедураПослеВВодаСкидки, УстановитьСкидку, "Введите % скидки на полотно");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуТовары(Команда)
	
	//УстановитьСкидку = 0;
	//ПараметрыПроцедуры = Новый Структура;
	//ПараметрыПроцедуры.Вставить("Предмет","Товары");
	//ПроцедураПослеВВодаСкидки = Новый ОписаниеОповещения("ПроцедураПослеВВодаСкидки", ЭтаФорма, ПараметрыПроцедуры);
	//ПоказатьВводЗначения(ПроцедураПослеВВодаСкидки, УстановитьСкидку, "Введите % скидки на товары");
	//
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Форма", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ЭтоЗаказ", Истина);
	ПараметрыПроцедуры.Вставить("Предмет", "Товары");
	ПараметрыПроцедуры.Вставить("ТекстСообщения", "Введите % скидки на товары");
	ОповещениеПослеИзмененияСкидки = Новый ОписаниеОповещения("ИзменитьСкидкуПослеИзмененияСкидки", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ОповещениеПослеИзмененияСкидки", ОповещениеПослеИзмененияСкидки);
		
	ОбщийМодульКлиент.Розница_ИзменитьСкидку(ПараметрыПроцедуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуНаВсе(Команда)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Форма", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ЭтоЗаказ", Ложь);
	ПараметрыПроцедуры.Вставить("Предмет", "Все");
	ПараметрыПроцедуры.Вставить("ТекстСообщения", "Введите % скидки на все");
	ОповещениеПослеИзмененияСкидки = Новый ОписаниеОповещения("ИзменитьСкидкуПослеИзмененияСкидки", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ОповещениеПослеИзмененияСкидки", ОповещениеПослеИзмененияСкидки);
		
	ОбщийМодульКлиент.Розница_ИзменитьСкидку(ПараметрыПроцедуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуНаУслуги(Команда)
	
	//УстановитьСкидку = 0;
	//ПараметрыПроцедуры = Новый Структура;
	//ПараметрыПроцедуры.Вставить("Предмет","Услуги");
	//ПроцедураПослеВВодаСкидки = Новый ОписаниеОповещения("ПроцедураПослеВВодаСкидки", ЭтаФорма, ПараметрыПроцедуры);
	//ПоказатьВводЗначения(ПроцедураПослеВВодаСкидки, УстановитьСкидку, "Введите % скидки на услуги");
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Форма", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ЭтоЗаказ", Истина);
	ПараметрыПроцедуры.Вставить("Предмет", "Услуги");
	ПараметрыПроцедуры.Вставить("ТекстСообщения", "Введите % скидки на услуги");
	ОповещениеПослеИзмененияСкидки = Новый ОписаниеОповещения("ИзменитьСкидкуПослеИзмененияСкидки", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ОповещениеПослеИзмененияСкидки", ОповещениеПослеИзмененияСкидки);
		
	ОбщийМодульКлиент.Розница_ИзменитьСкидку(ПараметрыПроцедуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуПослеИзмененияСкидки(Результат, ДополнительныеПараметры) Экспорт
	
	РассчитатьИтоговыеПоказателиКлиент();
	Состояние("Скидка установлена");
	
	Если Результат = Истина Тогда // ЕстьСтрокиСВыполненнымиМонтажами
		Сообщить("При изменении скидки были пропущены строки по выполненным и закрытым монтажам");
	КонецЕсли;
		
КонецПроцедуры
	


//&НаКлиенте
//Процедура ПослеВыбораКомнаты(Результат, ДопПараметры)  Экспорт
//	
//    Если Результат = Неопределено Тогда
//        Возврат;
//	КонецЕсли;	
//	ДобавитьКомнатуЗавершение(Результат);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДобавитьКомнатуЗавершение(ДанныеВыборкаКомнаты)
//	
//	//добавим комнату в товары
//	ИмяНовойКомнаты = "";
//	Если ДанныеВыборкаКомнаты = Неопределено Тогда
//		// простое добавление комнаты с номером
//		ИмяНовойКомнаты = ПолучитьНаименованиеНовойКомнаты(Неопределено);
//	Иначе
//		// добавление из справочника		
//		ИмяНовойКомнаты = СокрЛП(ДанныеВыборкаКомнаты.Комната);
//		Если НЕ ДанныеВыборкаКомнаты.НеДобавлятьПрефиксКомнаты Тогда
//			// с префиксом "Комната Х ..."
//			ИмяНовойКомнаты = ПолучитьНаименованиеНовойКомнаты(ДанныеВыборкаКомнаты.Комната);
//		КонецЕсли;
//	КонецЕсли;
//	
//	КомнатыТоваров = ДеревоТоваров.ПолучитьЭлементы();
//	Для каждого КомнатаТовара из КомнатыТоваров Цикл
//		Если КомнатаТовара.Комната = ИмяНовойКомнаты Тогда
//			ТекстСообщения = "Комната с наименованием """ + ИмяНовойКомнаты + """ уже имеется в заказе";
//			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
//			ПоказатьПредупреждение(, ТекстСообщения);
//			Возврат;
//		КонецЕсли;
//	КонецЦикла;
//	
//	НоваяСтрокаТовары = ДеревоТоваров.ПолучитьЭлементы().Добавить();
//	НоваяСтрокаТовары.Комната = ИмяНовойКомнаты;
//	Элементы.ДеревоТоваров.ТекущаяСтрока = НоваяСтрокаТовары.ПолучитьИдентификатор();

//	//добавим комнату в материалах
//	Если ЗаполнениеМатериаловПоЗаказам Тогда
//		НоваяСтрокаМатериалы = ДеревоМатериалов.ПолучитьЭлементы().Добавить();
//		НоваяСтрокаМатериалы.Комната = ИмяНовойКомнаты;
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиКлиент();

//КонецПроцедуры

//&НаСервере
//Функция ПолучитьНаименованиеНовойКомнаты(НазваниеКомнаты)
//	
//	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
//	
//	ТаблицаНомеров = Новый ТаблицаЗначений;
//	ТаблицаНомеров.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число"));	
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	НазваниеКомнат.Наименование КАК НазКомнаты
//	|ИЗ
//	|	Справочник.НазваниеКомнат КАК НазваниеКомнат";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Для Каждого ТекущаяСтрока Из Дерево.Строки Цикл
//		НоваяСтрока = ТаблицаНомеров.Добавить();
//		Попытка
//			СтрокаЗамены = СтрЗаменить(ТекущаяСтрока.Комната, "Комната ", "");
//			Выборка.Сбросить();
//			Пока Выборка.Следующий() Цикл
//				Если Найти(СтрокаЗамены, Выборка.НазКомнаты) Тогда
//					СтрокаЗамены = СтрЗаменить(СтрокаЗамены, " - " + Выборка.НазКомнаты, "");
//					СтрокаЗамены = СтрЗаменить(СтрокаЗамены, Выборка.НазКомнаты, "");
//					СтрокаЗамены = СтрЗаменить(СтрокаЗамены, " ", "");
//				КонецЕсли;
//			 КонецЦикла;
//			 
//			 НоваяСтрока.Номер = Число(СтрокаЗамены);
//			
//			//НоваяСтрока.Номер = Число(СтрЗаменить(ТекущаяСтрока.Комната, "Комната ", ""));
//		Исключение
//		КонецПопытки;
//	КонецЦикла;
//	
//	ТаблицаНомеров.Свернуть("Номер");
//	ТаблицаНомеров.Сортировать("Номер Убыв");
//	
//	Если НЕ НазваниеКомнаты = Неопределено Тогда
//		Если ТаблицаНомеров.Количество() > 0 Тогда
//			Возврат "Комната " + СтрЗаменить(Строка(ТаблицаНомеров[0].Номер+1), Символ(160), "") + " - " + НазваниеКомнаты;
//		Иначе
//			Возврат "Комната 1" + " - " + НазваниеКомнаты;
//		КонецЕсли;
//	Иначе
//		Если ТаблицаНомеров.Количество() > 0 Тогда
//			Возврат "Комната " + СтрЗаменить(Строка(ТаблицаНомеров[0].Номер+1), Символ(160), "");
//		Иначе
//			Возврат "Комната 1";
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецФункции

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если НЕ ОбщийМодульКлиент.Розница_КомнатаЗаполнена(ТекущиеДанные) Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	СтрокаКомнаты = ТекущиеДанные;
	Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда	
		СтрокаКомнаты = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	ИдКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораНоменклатуры", ЭтотОбъект, ИдКомнаты);
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ТипДокумента",		"ЗаказДоговор");
	ПараметрыПодбора.Вставить("Назначение",			"Товары");
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыПодбора,,,,,ОписаниеОповещения);
		
	Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНоменклатуры(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		//ДобавитьНоменклатуруВДеревоНаСервере(ВыбЗнач, ДополнительныеПараметры.Комната, ДополнительныеПараметры.Количество);
		//ИмяКомнаты = ДополнительныеПараметры.Комната;
		//Если НЕ ВыбранноеЗначение.Свойство("УИСтроки")  Тогда
		//	ВыбранноеЗначение.Вставить("УИСтроки", Неопределено);
		//КонецЕсли;
		ВозвращеннаяСтрока = ДобавитьНоменклатуруВДеревоТоваровКлиент(ВыбранноеЗначение.Номенклатура, , ВыбранноеЗначение.Количество, Неопределено, ДополнительныеПараметры);
		ДобавленнаяСтрока = ВозвращеннаяСтрока.Строка;
	Иначе
		// ДополнительныеПараметры = Имя комнаты
		//ДобавитьНоменклатуруВДеревоНаСервере(ВыбЗнач, ДополнительныеПараметры);
		//ИмяКомнаты = ДополнительныеПараметры;
		ВозвращеннаяСтрока = ДобавитьНоменклатуруВДеревоТоваровКлиент(ВыбранноеЗначение, , , , ДополнительныеПараметры);
		ДобавленнаяСтрока = ВозвращеннаяСтрока.Строка;
	КонецЕсли;
	
	ПеренестиДеревоВТабличнуюЧасть();	
	
	//ДобавленнаяСтрока = НайтиСтрокуДерева(ДеревоТоваров, ИмяКомнаты, ВыбЗнач);
	Если НЕ ДобавленнаяСтрока = Неопределено Тогда
		//Элементы.ДеревоТоваров.ТекущаяСтрока = ДобавленнаяСтрока.ПолучитьИдентификатор();
		//2017-10-18
		//ОбновитьОтображениеЭлементовФормы(Элементы.ДеревоТоваров.ТекущиеДанные.Комната, Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура);	
		Если Объект.ЗаполнятьУИСтрок И НЕ ДобавленнаяСтрока.Спецификация.Пустая() И ЗаполнениеМатериаловПоЗаказам Тогда
			ПерезаполнитьМатериалыПоСпецификации(ДобавленнаяСтрока, , "ДобавлениеНоменклатуры");
		КонецЕсли;
	КонецЕсли;		
	
	//++ #16036
	Если НЕ ДобавленнаяСтрока = Неопределено
		И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги
		И ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(ДобавленнаяСтрока.Номенклатура, ДобавленнаяСтрока.ХарактеристикаНоменклатуры) Тогда
		Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриДобавленииНоменклатуры Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Номенклатура", ДобавленнаяСтрока.Номенклатура); 
			ДопПараметры.Вставить("ХарактеристикаНоменклатуры", ДобавленнаяСтрока.ХарактеристикаНоменклатуры); 
			ДопПараметры.Вставить("УИСтроки", ДобавленнаяСтрока.УИСтроки); 
			ДопПараметры.Вставить("Количество", ДобавленнаяСтрока.Количество); 
			ДопПараметры.Вставить("ИДКомнаты", ДополнительныеПараметры);
			ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Добавить сопутствующие товары и услуги для" + Символы.ПС + "номенклатуры: """ + ДобавленнаяСтрока.Номенклатура + """?", РежимДиалогаВопрос.ДаНет);
		Иначе
			ПодборСопутствующейНоменклатуры(ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;	
	//-- #16036
	
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросДобавлениеСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПодборСопутствующейНоменклатуры(ДополнительныеПараметры.ИДКомнаты);
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	РассчитатьИтоговыеПоказателиКлиент();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСопутствующейНоменклатуры(ИДКомнаты)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	ИдентификаторСтрокиРодителя = ТекущиеДанные.ПолучитьИдентификатор();
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Позиция = Новый Структура;
	Позиция.Вставить("Номенклатура",								ТекущиеДанные.Номенклатура);
	Позиция.Вставить("ХарактеристикаНоменклатуры",		ТекущиеДанные.ХарактеристикаНоменклатуры);
	Позиция.Вставить("УИСтроки",										ТекущиеДанные.УИСтроки);
	Позиция.Вставить("Количество",									ТекущиеДанные.Количество);
	
	ТаблицаСопутствующейНоменклатуры = СопутствующиеТоварыВызовСервера.ПодборСопутствующейНоменклатурыНаСервере(Позиция);
	ОбработатьДобавлениеСННаСервере(ТаблицаСопутствующейНоменклатуры, ТекущиеДанные.УИСтроки);
	РазвернутьДеревоТоваров();
	
	Элементы.ДеревоТоваров.ТекущаяСтрока =  ОбщийМодульКлиент.ПолучитьИдентификаторПоУИстроки(ДеревоТоваров, Позиция.УИСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьДобавлениеСННаСервере(ТаблицаТоваров, УИСтрокиРодителя)
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	СтрокиКомнат = Дерево.Строки;
	ИндексСтроки = 0;
	СтрокаТекущегоРодителя = СтрокиКомнат.Найти(УИСтрокиРодителя, "УИСтроки", Истина);
	СтрокаКомнаты = СтрокаТекущегоРодителя.Родитель;
	ИндексСтроки = СтрокаКомнаты.Строки.Индекс(СтрокаТекущегоРодителя) + 1;
	
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
		// Проверяем наличие номенклатуры в дереве (в случае добавления недостающей номенклатуры)
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Номенклатура",ТекущаяСтрока.Номенклатура);
		ПараметрыПоиска.Вставить("ХарактеристикаНоменклатуры",ТекущаяСтрока.Характеристика);
		ПараметрыПоиска.Вставить("УИСтрокиРодителя",ТекущаяСтрока.УИСтрокиРодителя);
		//поиск строк
		СтрокиСТВДереве = СтрокиКомнат.НайтиСтроки(ПараметрыПоиска, Истина);
		Если СтрокиСТВДереве.Количество() > 0 Тогда
				СтрокиСТВДереве[0].УИСтроки = ТекущаяСтрока.УИСтроки;
			   ИндексСтроки = ИндексСтроки + 1;
			   Продолжить;
		КонецЕсли;	
		
		СтрокаРодителя = Дерево.Строки.Найти(ТекущаяСтрока.УИСтрокиРодителя, "УИСтроки", Истина);
		Если НЕ СтрокаТекущегоРодителя = СтрокаРодителя Тогда
			СтрокаТекущегоРодителя = СтрокиКомнат.Найти(ТекущаяСтрока.УИСтрокиРодителя, "УИСтроки", Истина);
			ИндексСтроки = СтрокаКомнаты.Строки.Индекс(СтрокаТекущегоРодителя) + 1;
		Иначе
			ИндексСтроки = ИндексСтроки + 1;
		КонецЕсли;	
		
		СтрокиПозиций = СтрокаКомнаты.Строки;
		СтрокаТабличнойЧасти = СтрокиПозиций.Вставить(ИндексСтроки);
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ТекущаяСтрока);
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ТекущаяСтрока.Характеристика;
		СтрокаТабличнойЧасти.Комната = СтрокаКомнаты.Комната;
		
		СтрокаТабличнойЧасти.Уровень = 1;
		
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧастиСервер(СтрокаТабличнойЧасти);
		СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ВидНоменклатуры, Спецификация, УчитыватьКакПотолок");
		
		СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
		
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЦенаПоПрайсу, ПроцентСкидки");
		РассчитатьСуммуСтрокиНаСервере(СтрокаТабличнойЧасти);
		
		Если ПустаяСтрока(СтрокаТабличнойЧасти.УИСтроки) Тогда
			// при подборе сопутствующих уже заполнено
			СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
		
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
КонецПроцедуры


&НаКлиенте
Функция ДобавитьСопутствующуюНоменклатуру(Номенклатура, Характеристика = Неопределено, УИСтрокиРодителя, Количество = 1, ИДкомнаты, Уровень, МассивДобавленнойСП = Неопределено)
	Если МассивДобавленнойСП = Неопределено Тогда
		МассивДобавленнойСП = Новый Массив;
	КонецЕсли;	
	Если Уровень < СтруктураДействийПоСТ.ДопустимаяГлубинаВложенностиСопутствующихТоваров Тогда
		МассивЗаписей = ОбщийМодульВызовСервера.ПолучитьСписокСопутствующихТоваров(Номенклатура, Характеристика, Количество);
		Если МассивЗаписей.Количество() > 0 Тогда
			Для Каждого Запись из МассивЗаписей Цикл
				ВозвращеннаяСтрока = ДобавитьНоменклатуруВДеревоТоваровКлиент(Запись.Номенклатура, Запись.Характеристика, Запись.Количество, УИСтрокиРодителя, ИДкомнаты);
				Если ВозвращеннаяСтрока.Новая  Тогда
					ДобавленнаяСтрока = ВозвращеннаяСтрока.Строка;
					МассивДобавленнойСП.Добавить(ДобавленнаяСтрока);
					ДобавитьСопутствующуюНоменклатуру(ДобавленнаяСтрока.Номенклатура, ДобавленнаяСтрока.ХарактеристикаНоменклатуры, ДобавленнаяСтрока.УИСтроки, ДобавленнаяСтрока.Количество, ИДкомнаты, Уровень+1, МассивДобавленнойСП);
				Иначе
					СуществующаяСтрока = ВозвращеннаяСтрока.Строка;
					ДобавитьСопутствующуюНоменклатуру(СуществующаяСтрока.Номенклатура, СуществующаяСтрока.ХарактеристикаНоменклатуры, СуществующаяСтрока.УИСТроки, СуществующаяСтрока.Количество, ИДкомнаты, Уровень+1, МассивДобавленнойСП);
				КонецЕсли;		
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	Возврат МассивДобавленнойСП;
КонецФункции

&НаКлиенте
Функция ДобавитьНоменклатуруВДеревоТоваровКлиент(Номенклатура, Характеристика = Неопределено, Количество = 1, УИСтрокиРодителя, ИдКомнаты)
	
	ВозвращаемСтроку = Новый Структура;
	СтрокаКомнаты = ДеревоТоваров.НайтиПоИдентификатору(ИдКомнаты);	
	СтрокиНоменклатуры = СтрокаКомнаты.ПолучитьЭлементы();
	
	// Проверяе наличие сопуствующей номенклатуры в дереве чтобы не добавить дубликат или чтобц не затереть параметры номенклатуры в дереве
	Для каждого Строка	Из СтрокиНоменклатуры Цикл 
		Если Строка.Номенклатура = Номенклатура И Строка.ХарактеристикаНоменклатуры = Характеристика И Строка.УИСтрокиРодителя = УИСтрокиРодителя Тогда
			ВозвращаемСтроку.Вставить("Строка", Строка);
			ВозвращаемСтроку.Вставить("Новая", Ложь);
			Возврат ВозвращаемСтроку;
		КонецЕсли;	
	КонецЦикла;
	
	СтрокаТабличнойЧасти = СтрокиНоменклатуры.Добавить();
	СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
	СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Характеристика;
	СтрокаТабличнойЧасти.УИСтрокиРодителя = УИСтрокиРодителя;
	СтрокаТабличнойЧасти.Комната = СтрокаКомнаты.Комната;
	
	//СтруктураДанные = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ВидСпецификации, Количество, ВидСкидки", 
	//								СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, ВидСпецификацииПоУмолчанию, Количество, Объект.ВидСкидки);
	СтрокаТабличнойЧасти.Количество = Количество;
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
	СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, Количество, ВидНоменклатуры, Спецификация, УчитыватьКакПотолок");
	
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена, ЦенаПоПрайсу, ПроцентСкидки, СтавкаНДС, Количество"); //#16345 добавлено Количество 
	
	//++ №13814
	Если ТипЗнч(ИдКомнаты) = Тип("Структура") И ИдКомнаты.Свойство("УИСтроки") Тогда
		СтрокаТабличнойЧасти.УИСтроки = ИдКомнаты.УИСтроки;
	//-- №13814
	Иначе
		СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	РассчитатьСуммуСтроки(СтрокаТабличнойЧасти);
	
	Элементы.ДеревоТоваров.ТекущаяСтрока = СтрокаТабличнойЧасти.ПолучитьИдентификатор();
	
	ВозвращаемСтроку.Вставить("Строка", СтрокаТабличнойЧасти);
	ВозвращаемСтроку.Вставить("Новая", Истина);
	Возврат ВозвращаемСтроку;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные)
	
	Если ЭтоРекламация Тогда
		СтруктураДанные.Вставить("Цена", 0);
	Иначе
		СтруктураДанные.Вставить("Цена", ПолучитьЦенуНоменклатуры(СтруктураДанные.Номенклатура, СтруктураДанные.ХарактеристикаНоменклатуры, СтруктураДанные.ЕдиницаИзмерения));
	КонецЕсли;
	//СтруктураДанные.Вставить("ПроцентСкидки", ПолучитьПроцентВидаСкидки(СтруктураДанные.ВидСкидки));
	СтруктураДанные.Вставить("ЦенаПоПрайсу", СтруктураДанные.Цена);
	СтруктураДанные.Вставить("СтавкаНДС", ?(УчитыватьНДС, Объект.СтавкаНДС, Перечисления.СтавкиНДС.ПустаяСсылка()));
	
	//#16345
	Если СтруктураДанные.ИспользоватьКонтрольКратности 
		И НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешитьНесоответствиеКратностиЕдиницИзмерения") Тогда
		
		СтруктураПоиска = Новый Структура("ВидДокумента, ЕдиницаИзмерения", Перечисления.ВидыДокументовПроверкиКратности.ЗаказКлиента, СтруктураДанные.ЕдиницаИзмерения);
		НайденныеСтроки = СтруктураДанные.Номенклатура.Кратность.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда		
			СтруктураДанные.Вставить("Количество", 0); //#16345
		Иначе
			СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
		КонецЕсли;
	Иначе
		СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
	КонецЕсли;
	
	СтруктураДанные.Вставить("ПроцентСкидки", ПолучитьПроцентСкидки(СтруктураДанные.ИспользоватьАвтоматическиеСкидки, СтруктураДанные.ВидСкидки, СтруктураДанные.Дата, СтруктураДанные.Номенклатура, СтруктураДанные.Количество));
	
	Возврат СтруктураДанные;
	
КонецФункции

//&НаСервере
//Процедура ДобавитьНоменклатуруВДеревоНаСервере(НоменклатураСсылка, ИмяКомнаты, Количество = 1)
//	
//	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
//	Для Каждого Строка из Дерево.Строки Цикл
//		Если Строка.Комната = ИмяКомнаты Тогда
//			Стр = Строка.Строки.Добавить();
//			Стр.Номенклатура = НоменклатураСсылка;
//			Стр.Комната = ИмяКомнаты;
//			
//			СтруктураДанные = Новый Структура("Номенклатура, ВидСпецификации", Стр.Номенклатура, ВидСпецификацииПоУмолчанию);
//			СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
//			ЗаполнитьЗначенияСвойств(Стр, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, ВидНоменклатуры");
//			
//			//Стр.ВидНоменклатуры = Стр.Номенклатура.ВидНоменклатуры; //2017-05-18
//			//Стр.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Стр.Номенклатура);
//			//Стр.Коэффициент = 1;
//			//Если НЕ Стр.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда // №12667 для конструкция спецификацию не заполняем
//			//Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(Стр.Номенклатура) Тогда  // #12667 спецификация только для услуг, в рамках той же заявки отменено
//			Стр.Спецификация = ?(ЗаполнениеМатериаловПоЗаказам, СтруктураДанные.Спецификация, ПредопределенноеЗначение("Справочник.Спецификации.ПустаяСсылка"));
//			//КонецЕсли;
//			Стр.Количество = Количество;
//			Стр.Цена = ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Стр.ХарактеристикаНоменклатуры, Стр.ЕдиницаИзмерения, Стр.Количество);
//			Стр.ПроцентСкидки = ПолучитьПроцентВидаСкидки(Объект.ВидСкидки) + ПолучитьПроцентАвтоматическойСкидкиСервер(Стр.Номенклатура, Стр.Количество);
//			Стр.ЦенаПоПрайсу = Стр.Цена;
//			РассчитатьСуммуСтрокиНаСервере(Стр);
//			//Стр.КоличествоВыработка = ПолучитьКоличествоВыработка(Стр.Количество);
//			Стр.УИСтроки = Новый УникальныйИдентификатор;
//			
//			ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
//			Возврат;
//		КонецЕсли
//	КонецЦикла;	
//	
//КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУстановкуПотолка(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если НЕ ОбщийМодульКлиент.Розница_КомнатаЗаполнена(ТекущиеДанные) Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	СтрокаКомнаты = ТекущиеДанные;
	Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда	
		СтрокаКомнаты = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	ИдКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораНоменклатуры", ЭтотОбъект, ИдКомнаты);
	ОткрытьФорму("Справочник.ЦветФактуры.Форма.ФормаВыбораУстановкиПотолка",,,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Функция ЗапретРедактированияЦен()
	Возврат ОбщийМодульСервер.НастройкаПользователя("ДополнительныеПраваЗапретРедактированияЦенВДокументах");	
КонецФункции

&НаКлиенте
Процедура ПослеВопросаОбИзмененииАвтоматическойСкидки(Результат, ТекущаяСтрока) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        ПослеИзмененияКоличестваТоваров(ТекущаяСтрока, Ложь);
	Иначе
		ПослеИзмененияКоличестваТоваров(ТекущаяСтрока, Истина);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияКоличестваТоваров(ТекущаяСтрока, Знач ПерезаполнитьСкидки = Истина)
	
	//проставим автоматическую скидку + скидку вида
	Если ПерезаполнитьСкидки Тогда
		ТекущаяСтрока.ПроцентСкидки = ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Объект.Дата, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Количество) + ПолучитьПроцентВидаСкидки(Объект.ВидСкидки);
	КонецЕсли;
	
	//Если мИспользоватьАвтоматическиеСкидки Тогда
	//	Если ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат() Тогда 
	//		РассчитатьСуммуСтроки(Элементы.ДеревоТоваров.ТекущиеДанные);
	//	Иначе			
	//		РасчетПроцентаАвтоматическойСкидки(Элементы.ДеревоТоваров.ТекущиеДанные);
	//	КонецЕсли;		
	//Иначе
	РассчитатьСуммуСтроки(ТекущаяСтрока);
	//КонецЕсли;
	
	//ТекущаяСтрока.КоличествоВыработка = ПолучитьКоличествоВыработка(ТекущаяСтрока.Количество);

	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		ТекущиеДанные.Цена = 0;
		Возврат;
	КонецЕсли;

	ТекущиеДанные.Бесплатно = Ложь;

	РассчитатьСуммуСтроки(ТекущиеДанные);	
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПроцентСкидкиПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.ПроцентСкидки = 0;
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуСтроки(Элементы.ДеревоТоваров.ТекущиеДанные);
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;	
	ОбщийМодульКлиент.Розница_ТоварыСуммаПриИзменении(ЭтотОбъект, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровСуммаСкидкиПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.СуммаСкидки = 0;
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если НЕ ТекущаяСтрока.СуммаСкидки = 0 Тогда
		Если НЕ ТекущаяСтрока.Количество = 0 и НЕ ТекущаяСтрока.Цена = 0 Тогда
			ТекущаяСтрока.ПроцентСкидки = Окр((ТекущаяСтрока.СуммаСкидки / (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена)) * 100,2);
			РассчитатьСуммуСтроки(ТекущаяСтрока, Истина);
		Иначе
			ТекущаяСтрока.ПроцентСкидки = 100;
			РассчитатьСуммуСтроки(ТекущаяСтрока, Истина);
		КонецЕсли;
	Иначе 
		ТекущаяСтрока.ПроцентСкидки = 0;
		РассчитатьСуммуСтроки(ТекущаяСтрока, Истина);
	КонецЕсли;
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаСервере
Функция ДобавитьПотолокНаСервере(ДопПараметры, Номенклатура = "", Количество, НомерПотолка = "", Фактура = "", Цвет = "", УИСтроки)
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Если Строка.Комната = ДопПараметры Тогда
			Стр = Строка.Строки.Добавить();
			Стр.Уровень = 1;
			
			//Если НЕ ПустаяСтрока(Номенклатура) Тогда
			Стр.Номенклатура = Номенклатура;
			//Иначе
			//	Стр.Номенклатура = Справочники.Номенклатура.Потолок;  // #12540 удалено
			//КонецЕсли;
			Стр.Комната = ДопПараметры;
			
			Стр.НомерПотолка = НомерПотолка;
			//Стр.НомерПотолка = Фактура;
			//Стр.ЦветФактуры = Цвет; //#12539
			
			СтруктураДанные = Новый Структура("Номенклатура, ВидСпецификации", Стр.Номенклатура, ВидСпецификацииПоУмолчанию);
			СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
			ЗаполнитьЗначенияСвойств(Стр, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, ВидНоменклатуры, УчитыватьКакПотолок");
			
			//Стр.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Стр.Номенклатура);
			//Стр.Коэффициент = 1;
			//Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(Стр.Номенклатура) Тогда // #12667 спецификация только для услуг, в рамках той же заявки отменено
			Стр.Спецификация = ?(ЗаполнениеМатериаловПоЗаказам, СтруктураДанные.Спецификация, ПредопределенноеЗначение("Справочник.Спецификации.ПустаяСсылка"));
			//КонецЕсли;	
			Стр.Количество = Количество;
			Стр.Цена = ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Стр.ХарактеристикаНоменклатуры, Стр.ЕдиницаИзмерения); //, Цвет.Владелец, Цвет);
			Стр.ПроцентСкидки = ПолучитьПроцентВидаСкидки(Объект.ВидСкидки);
			Стр.ЦенаПоПрайсу = Стр.Цена;
			Стр.СтавкаНДС = Объект.СтавкаНДС;
			РассчитатьСуммуСтрокиНаСервере(Стр);
			//Стр.КоличествоВыработка = ПолучитьКоличествоВыработка(Стр.Количество);
			Стр.УИСтроки = УИСтроки; //Новый УникальныйИдентификатор;
			//Стр.ВидНоменклатуры = Стр.Номенклатура.ВидНоменклатуры;
			
			ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
			Возврат Стр.Номенклатура;
		КонецЕсли
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция НаименованиеПотолкаСодержитНомерДоговора()
	Если Константы.ПорядокФормированияНаименованияПотолкаРозницы.Получить() = 1 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьКоличествоПотолковВДокументе()
	Результат = 0;
	Для Каждого ТекущаяСтрока Из Объект.ТоварыУслуги Цикл
		Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок
			или ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез Тогда
			Результат = Результат + 1;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
		Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок
			или ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез Тогда
			Результат = Результат + 1;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ДобавитьПотолок(Команда)
	
	ВМатериалы = (СтрНайти(Команда.Имя, "ВМатериалы") > 0);
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;	
	Если ВМатериалы Тогда
		ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	КонецЕсли;
	
	Если НЕ ОбщийМодульКлиент.Розница_КомнатаЗаполнена(ТекущиеДанные) Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	НаименованиеПотолкаПоНомеруДоговора = НаименованиеПотолкаСодержитНомерДоговора();
	КоличествоПотолковВДокументе = 0;
	Если НаименованиеПотолкаПоНомеруДоговора Тогда
		Если ПустаяСтрока(Объект.НомерДоговора) Тогда
			ПоказатьПредупреждение(,"Не заполнен номер договора. Если номера договора присваиваются автоматически, вам следует сначала записать документ");
			Возврат;
		Иначе
			КоличествоПотолковВДокументе = ПолучитьКоличествоПотолковВДокументе();
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПоНомеруДоговора",НаименованиеПотолкаПоНомеруДоговора);
	СтруктураПараметров.Вставить("НомерДоговора",Объект.НомерДоговора);
	СтруктураПараметров.Вставить("КоличествоПотолковВДокументе",КоличествоПотолковВДокументе);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДанныхПотолка", ЭтотОбъект, ВМатериалы);
	ОткрытьФорму("ОбщаяФорма.ФормаДобавленияПродукции", СтруктураПараметров, ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДанныхПотолка(СтруктураОтвета, ДопПараметры) Экспорт
	
	Если НЕ СтруктураОтвета = Неопределено Тогда
		
		Модифицированность = Истина;
		
		ВМатериалы = ДопПараметры;
		ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;	
		Если ВМатериалы Тогда
			ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
		КонецЕсли;
		
		УИСтроки = Новый УникальныйИдентификатор;
		СтруктураОтвета.Вставить("УИСтроки", УИСтроки);
	    ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ЗаказДоговор");
		
		ТекущаяКомната = ТекущиеДанные.Комната;
		Если НЕ ВМатериалы Тогда			
			ДобавленнаяНоменклатура = ДобавитьПотолокНаСервере(Элементы.ДеревоТоваров.ТекущиеДанные.Комната, СтруктураОтвета.Номенклатура, СтруктураОтвета.Количество, СтруктураОтвета.НомерПотолка, СтруктураОтвета.Фактура, СтруктураОтвета.Цвет, УИСтроки);	
			//#11670
			ОбщийМодульКлиент.РасширеннаяОбработкаДобавленнойПродукции(ЭтаФорма, ВидЗаказа, ВМатериалы, ТекущиеДанные.Комната, СтруктураОтвета);
			
			ПеренестиДеревоВТабличнуюЧасть();			
			ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
			РазвернутьДеревоТоваров(ТекущаяКомната, ДобавленнаяНоменклатура);
			ОбновитьОтображениеЭлементовФормы();
			РассчитатьИтоговыеПоказателиКлиент();
			ДобавленнаяСтрока = НайтиСтрокуДерева(ДеревоТоваров, ТекущаяКомната, ДобавленнаяНоменклатура);
			Если НЕ ДобавленнаяСтрока = Неопределено Тогда
				Элементы.ДеревоТоваров.ТекущаяСтрока = ДобавленнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
		Иначе
			ДобавитьМатериалНаКлиенте(Новый Структура("Номенклатура, Комната", СтруктураОтвета.Номенклатура, ТекущаяКомната));
			//#11670
			ОбщийМодульКлиент.РасширеннаяОбработкаДобавленнойПродукции(ЭтаФорма, ВидЗаказа, ВМатериалы, ТекущиеДанные.Комната, СтруктураОтвета);
			ПеренестиДеревоВТабличнуюЧасть();			
			
			//РазвернутьДеревоМатериалов(ТекущаяКомната, СтруктураОтвета.Номенклатура);
			ОбновитьОтображениеЭлементовФормы();
			//ДобавленнаяСтрока = НайтиСтрокуДерева(ДеревоМатериалов, ТекущаяКомната, СтруктураОтвета.Номенклатура);
			//Если НЕ ДобавленнаяСтрока = Неопределено Тогда
			//	Элементы.ДеревоМатериалов.ТекущаяСтрока = ДобавленнаяСтрока.ПолучитьИдентификатор();
			//КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭтоНоменклатураПотолка(ВыбраннаяНоменклатура)
	Возврат Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ВыбраннаяНоменклатура);
КонецФункции

&НаКлиенте
Функция НайтиСтрокуДерева(ДеревоПоиска, Комната, Номенклатура, Характеристика = Неопределено, ЕдиницаИзмерения = Неопределено)
	ЭлементыДерева = ДеревоПоиска.ПолучитьЭлементы();
	Для Каждого ТекЭлемент из ЭлементыДерева Цикл
		ПодчиненныеСтроки = ТекЭлемент.ПолучитьЭлементы();
		Для Каждого ПодчиненыйЭлемент Из ПодчиненныеСтроки Цикл
			Если СокрЛП(ПодчиненыйЭлемент.Комната) = СокрЛП(Комната)
				и ПодчиненыйЭлемент.Номенклатура = Номенклатура
				//Добавлено услове по ед. измерения и характестики при добавлении по ШК
				И (?(Характеристика = Неопределено, Истина, ПодчиненыйЭлемент.ХарактеристикаНоменклатуры = Характеристика И ПодчиненыйЭлемент.ЕдиницаИзмерения = ЕдиницаИзмерения))
			Тогда
				Возврат ПодчиненыйЭлемент;
			КонецеСли;
		КонецЦикла;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Функция НайтиСтрокуДереваМатериалов(Комната, Номенклатура, Характеристика = Неопределено, ЕдиницаИзмерения = Неопределено)
	ЭлементыДерева = ДеревоМатериалов.ПолучитьЭлементы();
	Для Каждого ТекЭлемент из ЭлементыДерева Цикл
		ПодчиненныеСтроки = ТекЭлемент.ПолучитьЭлементы();
		Для Каждого ПодчиненыйЭлемент Из ПодчиненныеСтроки Цикл
			Если СокрЛП(ПодчиненыйЭлемент.Комната) = СокрЛП(Комната)
				и ПодчиненыйЭлемент.Номенклатура = Номенклатура
				//Добавлено услове по ед. измерения и характестики при добавлении по ШК
				И (?(Характеристика = Неопределено, Истина, ПодчиненыйЭлемент.ХарактеристикаНоменклатуры = Характеристика И ПодчиненыйЭлемент.ЕдиницаИзмерения = ЕдиницаИзмерения))
			Тогда
				Возврат ПодчиненыйЭлемент;
			КонецеСли;
		КонецЦикла;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ДобавитьПродукцию(Команда)
	
	ВМатериалы = (СтрНайти(Команда.Имя, "ВМатериалы") > 0);
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;	
	Если ВМатериалы Тогда
		ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	КонецЕсли;
	
	Если НЕ ОбщийМодульКлиент.Розница_КомнатаЗаполнена(ТекущиеДанные) Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;	
		
	СтруктураПараметров = Новый Структура;	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаДанныхПродукцииПоВиду", ЭтотОбъект, ВМатериалы);
	ОткрытьФорму("ОбщаяФорма.ФормаДобавленияПродукцииПоВиду", СтруктураПараметров, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДанныхПродукцииПоВиду(СтруктураОтвета, ДополнительныеПараметры) Экспорт
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ВМатериалы = ДополнительныеПараметры;
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;	
	Если ВМатериалы Тогда
		ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	КонецЕсли;
	
	ТекущаяКомната = ТекущиеДанные.Комната;
	
	//++ №13814
	УИСтроки = Новый УникальныйИдентификатор;
	СтруктураОтвета.Вставить("УИСтроки", УИСтроки);
	ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ЗаказДоговор");
	//-- №13814
	
	Если НЕ ВМатериалы Тогда
		
		СтрокаКомнаты = ТекущиеДанные;
		Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда	
			СтрокаКомнаты = ТекущиеДанные.ПолучитьРодителя();
		КонецЕсли;
		
		ИдКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
	
		ДополнительныеПараметрыДобавления = Новый Структура("Комната, Количество", ТекущаяКомната, СтруктураОтвета.Количество);
		
		// №13814
		ОбщийМодульКлиент.РасширеннаяОбработкаДобавленнойПродукции(ЭтаФорма, ВидЗаказа, ВМатериалы, ТекущиеДанные.Комната, СтруктураОтвета, Истина);
		
		ПослеВыбораНоменклатуры(СтруктураОтвета, ИдКомнаты);
		
	Иначе		
		
		ДобавитьМатериалНаКлиенте(Новый Структура("Комната, Номенклатура, Количество", ТекущаяКомната, СтруктураОтвета.Номенклатура, СтруктураОтвета.Количество));
		
		// №13814
		ОбщийМодульКлиент.РасширеннаяОбработкаДобавленнойПродукции(ЭтаФорма, ВидЗаказа, ВМатериалы, ТекущиеДанные.Комната, СтруктураОтвета, Истина);
		
		ПеренестиДеревоВТабличнуюЧасть();			

		ОбновитьОтображениеЭлементовФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровКоэффициентПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Коэффициент = 0;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровСпецификацияПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Спецификация = Неопределено;
		Возврат;
	КонецЕсли;
	
	ПеренестиДеревоВТабличнуюЧасть();
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	
	//Если очистили спецификацию, нужно удалить материалы
	Если Объект.ЗаполнятьУИСтрок Тогда
		Если мСпецификация <> Неопределено И НЕ мСпецификация.Пустая()
			И ТекущиеДанные.Спецификация.Пустая()
			И ЕстьМатериалыПоТекущейПозиции(ТекущиеДанные.Номенклатура, ТекущиеДанные.УИСтроки) Тогда
			
			ЗадатьВопросОбУдаленииМатериаловПоСпецификации(ТекущиеДанные.Номенклатура, ТекущиеДанные.УИСтроки);
			//УдалитьМатериалыОтносящиесяКПозицииНаСервере(ТекущиеДанные.Номенклатура, ТекущиеДанные.УИСтроки);
			
		ИначеЕсли НЕ ТекущиеДанные.Спецификация.Пустая() Тогда		
			
			ПерезаполнитьМатериалыПоСпецификации(ТекущиеДанные, ,"ИзменениеСпецификации");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоТоваровЦветФактурыПриИзменении(Элемент)
//	//корневые строки редактировать нельзя
//	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
//		Элементы.ДеревоТоваров.ТекущиеДанные.ЦветФактуры = Неопределено;
//		Возврат;
//	КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровНомерПотолкаПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.НомерПотолка = "";
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДетализацияВзаиморасчетов(Команда)
	ПараметрыОтчета = Новый Структура("Отбор, СформироватьПриОткрытии", 
                                    Новый Структура("Контрагент", Объект.Контрагент), 
                                    Истина);
	//ПараметрыОтчета = Новый Структура;
	//ПараметрыОтчета.Вставить("Контрагент",Объект.Контрагент);
	ОткрытьФорму("Отчет.ВедомостьВзаиморасчетовПоЗаказам.Форма",ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораАдреса(ЗначениеВыбора, Источник) Экспорт

	Если НЕ ЗначениеВыбора = Неопределено Тогда
    	Объект.Адрес = ЗначениеВыбора.Представление;
	КонецЕсли;

КонецПроцедуры

//&НаКлиенте
//Процедура ОформитьСчетНаОплату(Команда)
//	ПараметрыНовогоДокумента = Новый Структура;
//	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
//	ОткрытьФорму("Документ.СчетНаОплату.Форма.ФормаДокумента", ПараметрыНовогоДокумента);
//КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьИспользованиеКомнатыВДокументах(ЗаказСсылка, НаименованиеКомнаты)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", ЗаказСсылка);
	Запрос.УстановитьПараметр("Комната", НаименованиеКомнаты);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбеспечениеЗаказовРозницы.Регистратор КАК Регистратор,
		|	ОбеспечениеЗаказовРозницы.Комната КАК Комната
		|ИЗ
		|	РегистрНакопления.ОбеспечениеЗаказовРозницы КАК ОбеспечениеЗаказовРозницы
		|ГДЕ
		|	ОбеспечениеЗаказовРозницы.Заказ = &Заказ
		|	И ОбеспечениеЗаказовРозницы.Комната = &Комната";
	
		
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Регистратор,
	|	ДанныеДокумента.Комната КАК Комната
	|ИЗ
	|	Документ.Монтаж.ТоварыУслуги КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.Ссылка.ПометкаУдаления
	|	И ДанныеДокумента.Ссылка.Основание = &Заказ
	|	И ДанныеДокумента.Комната = &Комната
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Комната
	|ИЗ
	|	Документ.Монтаж.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.Ссылка.ПометкаУдаления
	|	И ДанныеДокумента.Ссылка.Основание = &Заказ
	|	И ДанныеДокумента.Комната = &Комната";
		
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПереименоватьКомнату(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	ИдТекущейСтрокиКомнаты = ТекущиеДанные.ПолучитьИдентификатор();
	Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		ИдТекущейСтрокиКомнаты = ТекущиеДанные.ПолучитьРодителя().ПолучитьИдентификатор();
	КонецЕсли;

	ТекущееНаименование = ТекущиеДанные.Комната;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РезультатОтказ = ПроверитьИспользованиеКомнатыВДокументах(Объект.Ссылка, ТекущееНаименование);
		Если РезультатОтказ Тогда
			ПоказатьПредупреждение(Неопределено, "По данной комнате имеются оформленные документы, переименование недоступно!");
			Возврат;	
		КонецЕсли;		
	КонецЕсли;
	
	ПараметрыПереименования = Новый Структура;
	ПараметрыПереименования.Вставить("Форма", ЭтаФорма);
	ПараметрыПереименования.Вставить("СтароеНаименование", ТекущееНаименование);
	ПараметрыПереименования.Вставить("ИдТекущейСтрокиКомнаты", ИдТекущейСтрокиКомнаты);
	
	ОбщийМодульКлиент.Розница_ПереименоватьКомнату(ПараметрыПереименования);
	
	//ПослеВводаНовогоНаименованияКомнаты = Новый ОписаниеОповещения("ПослеВводаНовогоНаименованияКомнаты",ЭтаФорма,ПараметрыПереименования);
	//ПоказатьВводСтроки(ПослеВводаНовогоНаименованияКомнаты,ТекущееНаименование,"Введите название комнаты");
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПослеВводаНовогоНаименованияКомнаты(Результат, Параметры) Экспорт
//	
//	Если Результат = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//    //проверим на наличие такого наименования
//	ПараметрыПереименования = Новый Структура;
//	ПараметрыПереименования.Вставить("НовоеНаименование",		Результат);
//	ПараметрыПереименования.Вставить("СтароеНаименование",		Параметры.СтароеНаименование);
//	ПараметрыПереименования.Вставить("ИдТекущейСтрокиКомнаты",	Параметры.ИдТекущейСтрокиКомнаты);
//	 
//	//Отбор = Новый Структура("Комната", Результат);
//	//НайденныеСтроки = Объект.ТоварыУслуги.НайтиСтроки(Отбор);
//	//Если НайденныеСтроки.Количество() > 0 Тогда
//	ИдИмеющейсяСтрокиКомнаты = 0;
//	ЕстьКомната = Ложь;
//	СтрокиКомнат = ДеревоТоваров.ПолучитьЭлементы();
//	Для каждого СтрокаКомнаты из СтрокиКомнат Цикл
//		Если СтрокаКомнаты.Комната = Результат Тогда
//			ЕстьКомната = Истина;
//			ИдИмеющейсяСтрокиКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
//			Прервать;
//		КонецЕсли;
//	КонецЦикла;
//	
//	ПараметрыПереименования.Вставить("ИдИмеющейсяСтрокиКомнаты", ИдИмеющейсяСтрокиКомнаты);
//	ПараметрыПереименования.Вставить("ЕстьКомната",				 ЕстьКомната);
//	
//	Если ЕстьКомната Тогда
//		ПереименоватьКомнатуПодтверждение = Новый ОписаниеОповещения("ПереименоватьКомнатуПодтверждение", ЭтаФорма, ПараметрыПереименования);
//		ПоказатьВопрос(ПереименоватьКомнатуПодтверждение,"В документе уже есть комната """+Результат+""""+Символы.ПС
//		+"Если присвоить такое же наименование, все товары текущей комнаты будут добавлены к существующей."
//		+Символы.ПС+"Продолжить?",РежимДиалогаВопрос.ДаНет)
//	Иначе
//		ПереименоватьКомнатуПодтверждение(КодВозвратаДиалога.Да, ПараметрыПереименования);
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ПереименоватьКомнатуПодтверждение(Результат, ДополнительныеПараметры) Экспорт
//	
//    Если НЕ Результат = КодВозвратаДиалога.Да Тогда
//        Возврат;
//	КонецЕсли;
//	
//	//#9373
//	// переделано на клиентские методы
//	//ПереименоватьКомнатуПодтверждениеНаСервере(ДополнительныеПараметры);
//	//РазвернутьДеревоТоваров(Параметры.НовоеНаименование, );	
//	//РазвернутьДеревоМатериалов();

//	Если НЕ ДополнительныеПараметры.ЕстьКомната Тогда
//		//товары
//		СтрокаКомнаты = ДеревоТоваров.НайтиПоИдентификатору(ДополнительныеПараметры.ИдТекущейСтрокиКомнаты);	
//		СтрокаКомнаты.Комната = ДополнительныеПараметры.НовоеНаименование;
//		СтрокиТоваров = СтрокаКомнаты.ПолучитьЭлементы();
//		Для каждого СтрокаТовара из СтрокиТоваров Цикл
//			СтрокаТовара.Комната = ДополнительныеПараметры.НовоеНаименование;	
//		КонецЦикла;
//		
//		//материалы
//		Для Каждого ТекущаяСтрокаДерева Из ДеревоМатериалов.ПолучитьЭлементы() Цикл
//			Если ТекущаяСтрокаДерева.Комната = ДополнительныеПараметры.СтароеНаименование Тогда
//				ТекущаяСтрокаДерева.Комната = ДополнительныеПараметры.НовоеНаименование;				
//				Для Каждого ТекущаяСтрока Из ТекущаяСтрокаДерева.ПолучитьЭлементы() Цикл
//					Если ТекущаяСтрока.Комната = ДополнительныеПараметры.СтароеНаименование Тогда
//						ТекущаяСтрока.Комната = ДополнительныеПараметры.НовоеНаименование;
//					КонецЕсли;
//				КонецЦикла;
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//	Иначе
//		
//		//товары
//		СтрокаКомнаты = ДеревоТоваров.НайтиПоИдентификатору(ДополнительныеПараметры.ИдТекущейСтрокиКомнаты);
//		СтрокаНовойКомнаты = ДеревоТоваров.НайтиПоИдентификатору(ДополнительныеПараметры.ИдИмеющейсяСтрокиКомнаты);
//		СтрокиТоваров = СтрокаКомнаты.ПолучитьЭлементы();
//		Для каждого СтрокаТовара из СтрокиТоваров Цикл
//			НоваяСтрокаТовара = СтрокаНовойКомнаты.ПолучитьЭлементы().Добавить();
//			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовара, СтрокаТовара);
//			НоваяСтрокаТовара.Комната = ДополнительныеПараметры.НовоеНаименование;	
//		КонецЦикла;
//		ДеревоТоваров.ПолучитьЭлементы().Удалить(СтрокаКомнаты);
//		Элементы.ДеревоТоваров.ТекущаяСтрока = ДополнительныеПараметры.ИдИмеющейсяСтрокиКомнаты;
//		
//		//материалы
//		СтрокаКомнатыМатериалов = Неопределено;
//		СтрокаНовойКомнатыМатериалов = Неопределено;
//		Для Каждого ТекущаяСтрокаДерева Из ДеревоМатериалов.ПолучитьЭлементы() Цикл
//			Если ТекущаяСтрокаДерева.Комната = ДополнительныеПараметры.СтароеНаименование Тогда
//				СтрокаКомнатыМатериалов = ТекущаяСтрокаДерева;	
//			КонецЕсли;
//			Если ТекущаяСтрокаДерева.Комната = ДополнительныеПараметры.НовоеНаименование Тогда
//				СтрокаНовойКомнатыМатериалов = ТекущаяСтрокаДерева;
//			КонецЕсли;
//		КонецЦикла;
//		
//		Если НЕ СтрокаКомнатыМатериалов = Неопределено И НЕ СтрокаНовойКомнатыМатериалов = Неопределено Тогда			
//			Для каждого СтрокаМатериала из СтрокаКомнатыМатериалов.ПолучитьЭлементы() Цикл
//				НоваяСтрокаМатериала = СтрокаНовойКомнатыМатериалов.ПолучитьЭлементы().Добавить();
//				ЗаполнитьЗначенияСвойств(НоваяСтрокаМатериала, СтрокаМатериала);
//				НоваяСтрокаМатериала.Комната = ДополнительныеПараметры.НовоеНаименование;	
//			КонецЦикла;
//			ДеревоМатериалов.ПолучитьЭлементы().Удалить(СтрокаКомнатыМатериалов);
//		КонецЕсли;
//		
//		РассчитатьИтоговыеПоказателиКлиент();

//	КонецЕсли;
//	
//	Модифицированность = Истина;

//КонецПроцедуры

//&НаСервере
//Процедура ПереименоватьКомнатуПодтверждениеНаСервере(Параметры) Экспорт
//	
//	//товары и услуги
//	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
//	Для Каждого ТекущаяСтрокаДерева Из Дерево.Строки Цикл
//		Если ТекущаяСтрокаДерева.Комната = Параметры.СтароеНаименование Тогда
//			ТекущаяСтрокаДерева.Комната = Параметры.НовоеНаименование;
//		КонецЕсли;
//		Для Каждого ТекущаяСтрока Из ТекущаяСтрокаДерева.Строки Цикл
//			Если ТекущаяСтрока.Комната = Параметры.СтароеНаименование Тогда
//				ТекущаяСтрока.Комната = Параметры.НовоеНаименование;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;
//	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
//	
//	//материалы
//	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
//	Для Каждого ТекущаяСтрокаДерева Из Дерево.Строки Цикл
//		Если ТекущаяСтрокаДерева.Комната = Параметры.СтароеНаименование Тогда
//			ТекущаяСтрокаДерева.Комната = Параметры.НовоеНаименование;
//		КонецЕсли;
//		Для Каждого ТекущаяСтрока Из ТекущаяСтрокаДерева.Строки Цикл
//			Если ТекущаяСтрока.Комната = Параметры.СтароеНаименование Тогда
//				ТекущаяСтрока.Комната = Параметры.НовоеНаименование;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;
//	ЗначениеВДанныеФормы(Дерево, ДеревоМатериалов);
//	
//	ПеренестиДеревоВТабличнуюЧасть();
//	Модифицированность = Истина;

//КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДругуюКомнату(Команда)
	
	ВыделенныеСтроки = Элементы.ДеревоТоваров.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выберите товар или услугу комнаты, который нужно перенести");
		Возврат;
	КонецЕсли;
	
	ТекущаяКомната = Неопределено;
	
	Для каждого ТекущаяСтрока из ВыделенныеСтроки Цикл
		СтрокаТЧ = ДеревоТоваров.НайтиПоИдентификатору(ТекущаяСтрока);

		Если ТекущаяКомната = Неопределено Тогда
			ТекущаяКомната = СтрокаТЧ.Комната;
		КонецЕсли;
		Если НЕ ТекущаяКомната = СтрокаТЧ.Комната Тогда
			ПоказатьПредупреждение(,"Выберите товары / услуги из одной комнаты!");
			Возврат;
		КонецЕсли;		
				
		Если СтрокаТЧ.Номенклатура.Пустая() Тогда
			ПоказатьПредупреждение(,"Выберите товар или услугу комнаты, который нужно скопировать");
			Возврат;
		КонецЕсли;	
	КонецЦикла;		
	
	ПараметрыПереносаПозиции = Новый Структура;
	ПараметрыПереносаПозиции.Вставить("Форма", ЭтаФорма);
	ПараметрыПереносаПозиции.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	ПараметрыПереносаПозиции.Вставить("ТекущаяКомната",  ТекущаяКомната);
	
	ОбщийМодульКлиент.Розница_ПеренестиПозициюВДругуюКомнату(ПараметрыПереносаПозиции);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПеренестиВДругуюКомнатуПодтверждение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
//	
//	Если ВыбранныйЭлемент = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//    //ПеренестиВДругуюКомнатуПодтверждениеНаСервере(ВыбранныйЭлемент.Значение, ДополнительныеПараметры);
//	
//	ИмяКомнаты = ВыбранныйЭлемент.Значение;
//	Если ИмяКомнаты = Неопределено ИЛИ ИмяКомнаты = ДополнительныеПараметры.ТекущаяКомната Тогда
//		Возврат;
//	КонецЕсли; 
//	
//	// добавляем новую строку
//	УИСтроки = Элементы.ДеревоТоваров.ТекущиеДанные.УИСтроки;
//	ЭлементыДерева = ДеревоТоваров.ПолучитьЭлементы();
//	Для Каждого ТекЭлемент из ЭлементыДерева Цикл		
//		Если СокрЛП(ТекЭлемент.Комната) = СокрЛП(ИмяКомнаты) Тогда
//			НоваяСтрока = ТекЭлемент.ПолучитьЭлементы().Добавить();
//			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элементы.ДеревоТоваров.ТекущиеДанные, , "Комната");
//			НоваяСтрока.Комната = ИмяКомнаты;
//		КонецЕсли;
//	КонецЦикла;
//	
//	// удаляем перенесенную
//	ИдентификаторСтроки = Элементы.ДеревоТоваров.ТекущаяСтрока;
//	ТекущаяСтрока       = ДеревоТоваров.НайтиПоИдентификатору(ИдентификаторСтроки);
//	РодительКомната     = ТекущаяСтрока.ПолучитьРодителя();	
//	РодительКомната.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
//	
//	// перенесем материалы, относящиеся к товару
//	НоваяКомнатаМатериалов = Неопределено;
//	ЭлементыДереваМатериалов = ДеревоМатериалов.ПолучитьЭлементы();
//	Для Каждого СтрокаКомнаты из ЭлементыДереваМатериалов Цикл
//		Если СокрЛП(СтрокаКомнаты.Комната) = СокрЛП(ИмяКомнаты) Тогда
//			НоваяКомнатаМатериалов = СтрокаКомнаты.ПолучитьЭлементы();
//		КонецЕсли;
//	КонецЦикла;
//	Если НЕ НоваяКомнатаМатериалов = Неопределено Тогда
//		//добавляем
//		Для Каждого СтрокаКомнаты из ЭлементыДереваМатериалов Цикл		
//			Если СокрЛП(СтрокаКомнаты.Комната) = СокрЛП(ДополнительныеПараметры.ТекущаяКомната) Тогда
//				Для Каждого СтрокаМатериала Из СтрокаКомнаты.ПолучитьЭлементы() Цикл
//					Если СтрокаМатериала.УИСтроки = УИСтроки Тогда
//						НоваяСтрока = НоваяКомнатаМатериалов.Добавить();
//						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМатериала, , "Комната");
//						НоваяСтрока.Комната = ИмяКомнаты;
//					КонецЕсли;
//				КонецЦикла;
//			КонецЕсли;
//		КонецЦикла;
//		//удаляем
//		Для Каждого СтрокаКомнаты из ЭлементыДереваМатериалов Цикл		
//			Если СокрЛП(СтрокаКомнаты.Комната) = СокрЛП(ДополнительныеПараметры.ТекущаяКомната) Тогда
//				СтрокиМатериалов = СтрокаКомнаты.ПолучитьЭлементы();
//				КоличествоСтрокМатериалов = СтрокиМатериалов.Количество();
//				//обратный обход для удаления
//				Для Индекс = 1 По КоличествоСтрокМатериалов Цикл
//					СтрокаМатериала = СтрокиМатериалов[КоличествоСтрокМатериалов-Индекс];
//					Если СтрокаМатериала.УИСтроки = УИСтроки Тогда
//						
//						ИдентификаторСтроки = СтрокаМатериала.ПолучитьИдентификатор();
//						ТекущаяСтрока       = ДеревоМатериалов.НайтиПоИдентификатору(ИдентификаторСтроки);	
//						РодительКомната     = ТекущаяСтрока.ПолучитьРодителя();	
//						РодительКомната.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
//						
//					КонецЕсли;
//				КонецЦикла;
//			КонецЕсли;
//		КонецЦикла;				
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиКлиент();
//	//ПеренестиДеревоВТабличнуюЧасть();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПеренестиВДругуюКомнатуПодтверждениеНаСервере(ВыбранныйЭлемент, СписокПараметров)
//    Если ВыбранныйЭлемент <> Неопределено Тогда
//		Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
//		
//		//Нужно найти родителя
//		РодительНовойКомнаты = Неопределено;
//		Для Каждого ТекущаяСтрокаДерева Из Дерево.Строки Цикл
//			Если ТекущаяСтрокаДерева.Комната = ВыбранныйЭлемент Тогда 
//				РодительНовойКомнаты = ТекущаяСтрокаДерева;
//			КонецЕсли;
//		КонецЦикла;
//		
//		Если РодительНовойКомнаты = Неопределено Тогда
//			Возврат;
//		КонецЕсли;
//		
//		Для Каждого ТекущаяСтрокаДерева Из Дерево.Строки Цикл
//			Для Каждого ТекущаяСтрока Из ТекущаяСтрокаДерева.Строки Цикл
//				Если (ТекущаяСтрока.Комната = СписокПараметров.ТекущаяКомната)
//					и (ТекущаяСтрока.Номенклатура = СписокПараметров.ТекущаяНоменклатура) Тогда
//					
//					ТекущаяСтрока.Комната = ВыбранныйЭлемент;												
//					НоваяСтрока = РодительНовойКомнаты.Строки.Добавить();
//					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
//					
//					ТекущаяСтрокаДерева.Строки.Удалить(ТекущаяСтрока);
//					
//				КонецЕсли;
//			КонецЦикла;
//		КонецЦикла;
//			
//		ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
//		ПеренестиДеревоВТабличнуюЧасть();
//		Модифицированность = Истина;
//    КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВДругуюКомнату(Команда)
		
	ВыделенныеСтроки = Элементы.ДеревоТоваров.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выберите товар или услугу комнаты, который нужно скопировать");
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущаяСтрока из ВыделенныеСтроки Цикл
		СтрокаТЧ = ДеревоТоваров.НайтиПоИдентификатору(ТекущаяСтрока);
		
		Если СтрокаТЧ.Номенклатура.Пустая() Тогда
			ПоказатьПредупреждение(,"Выберите товар или услугу комнаты, который нужно скопировать");
			Возврат;
		КонецЕсли;
	
		ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(СтрокаТЧ.Номенклатура);
		Если ДанныеНоменклатуры.ЭтоУникальныйПотолок Тогда
			ПоказатьПредупреждение(,"Копирование потолков запрещено!");
			Возврат;
		КонецЕсли;
	КонецЦикла;	
	
	СписокКомнат = ОбщийМодульКлиент.ПолучитьСписокКомнатПоДереву(ДеревоТоваров);	
	ДопПараметры = Новый Структура;
	
	СкопироватьВДругуюКомнатуПодтверждение = Новый ОписаниеОповещения("СкопироватьВДругуюКомнатуПодтверждение", ЭтаФорма, ДопПараметры);
	СписокКомнат.ПоказатьВыборЭлемента(СкопироватьВДругуюКомнатуПодтверждение, "Выберите комнату");
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВДругуюКомнатуПодтверждение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКомнаты = Результат.Значение;
	Если ИмяКомнаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Неопределено;
	ЭлементыДерева = ДеревоТоваров.ПолучитьЭлементы();
	Для Каждого ТекЭлемент из ЭлементыДерева Цикл
		Если СокрЛП(ТекЭлемент.Комната) = СокрЛП(ИмяКомнаты) Тогда			
			ВыделенныеСтроки = Элементы.ДеревоТоваров.ВыделенныеСтроки;	
			Для каждого ТекущаяСтрока из ВыделенныеСтроки Цикл
				СтрокаТЧ = ДеревоТоваров.НайтиПоИдентификатору(ТекущаяСтрока);
				
				НоваяСтрока = ТекЭлемент.ПолучитьЭлементы().Добавить();
				//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , "Комната, Спецификация, УИСтроки");
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , "Комната, УИСтроки, МонтажСтатус, Монтаж, КоличествоВМонтажах, Заказано");
				НоваяСтрока.Комната = ИмяКомнаты;
				НоваяСтрока.УИСтроки = Новый УникальныйИдентификатор;
				
				Если Объект.ЗаполнятьУИСтрок И НЕ НоваяСтрока.Спецификация.Пустая() И ЗаполнениеМатериаловПоЗаказам Тогда
					ПерезаполнитьМатериалыПоСпецификации(НоваяСтрока, , "ДобавлениеНоменклатуры");
				КонецЕсли;
			КонецЦикла;
			
			// на случай, если в комнате не было позиций
			ИдентификаторСтроки = ТекЭлемент.ПолучитьИдентификатор();
			Элементы.ДеревоТоваров.Развернуть(ИдентификаторСтроки);
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьИтоговыеПоказателиКлиент();
	//ПеренестиДеревоВТабличнуюЧасть();
	
	//Если НоваяСтрока = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если Объект.ЗаполнятьУИСтрок И НЕ НоваяСтрока.Спецификация.Пустая() И ЗаполнениеМатериаловПоЗаказам Тогда
	//	ПерезаполнитьМатериалыПоСпецификации(НоваяСтрока, , "ДобавлениеНоменклатуры");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьМатериалыВДругуюКомнату(Команда)
		
	ВыделенныеСтроки = Элементы.ДеревоМатериалов.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выберите материалы, которые нужно скопировать");
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущаяСтрока из ВыделенныеСтроки Цикл
		СтрокаТЧ = ДеревоМатериалов.НайтиПоИдентификатору(ТекущаяСтрока);
		
		Если СтрокаТЧ.Номенклатура.Пустая() Тогда
			ПоказатьПредупреждение(,"Выберите материалы, которые нужно скопировать");
			Возврат;
		КонецЕсли;
	
		ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(СтрокаТЧ.Номенклатура);
		Если ДанныеНоменклатуры.ЭтоУникальныйПотолок Тогда
			ПоказатьПредупреждение(,"Копирование потолков запрещено!");
			Возврат;
		КонецЕсли;
	КонецЦикла;	
	
	СписокКомнат = ОбщийМодульКлиент.ПолучитьСписокКомнатПоДереву(ДеревоТоваров);	
	ДопПараметры = Новый Структура;
	
	СкопироватьВДругуюКомнатуПодтверждение = Новый ОписаниеОповещения("СкопироватьМатериалыВДругуюКомнатуПодтверждение", ЭтаФорма, ДопПараметры);
	СписокКомнат.ПоказатьВыборЭлемента(СкопироватьВДругуюКомнатуПодтверждение, "Выберите комнату");
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьМатериалыВДругуюКомнатуПодтверждение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКомнаты = Результат.Значение;
	Если ИмяКомнаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Неопределено;
	ЭлементыДерева = ДеревоМатериалов.ПолучитьЭлементы();
	Для Каждого ТекЭлемент из ЭлементыДерева Цикл
		Если СокрЛП(ТекЭлемент.Комната) = СокрЛП(ИмяКомнаты) Тогда			
			ВыделенныеСтроки = Элементы.ДеревоМатериалов.ВыделенныеСтроки;	
			Для каждого ТекущаяСтрока из ВыделенныеСтроки Цикл
				СтрокаТЧ = ДеревоМатериалов.НайтиПоИдентификатору(ТекущаяСтрока);
				
				НоваяСтрока = ТекЭлемент.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , "Комната, УИСтроки, КоличествоВМонтажах");
				НоваяСтрока.Комната = ИмяКомнаты;
				НоваяСтрока.УИСтроки = Новый УникальныйИдентификатор;
			КонецЦикла;
			
			// на случай, если в комнате не было позиций
			ИдентификаторСтроки = ТекЭлемент.ПолучитьИдентификатор();
			Элементы.ДеревоМатериалов.Развернуть(ИдентификаторСтроки);
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПеренестиДеревоВТабличнуюЧасть();
	
	Если НоваяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНоменклатурыМатериала(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьМатериалНаКлиенте(Новый Структура("Номенклатура, Комната", ВыбранноеЗначение, ДопПараметры), , Истина);
	ПеренестиДеревоВТабличнуюЧасть();
	//РазвернутьДеревоМатериалов();
	//ДобавленнаяСтрока = НайтиСтрокуДереваМатериалов(ДопПараметры, ВыбЗнач);
	//Если НЕ ДобавленнаяСтрока = Неопределено Тогда
	//	Элементы.ДеревоМатериалов.ТекущаяСтрока = ДобавленнаяСтрока.ПолучитьИдентификатор();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМатериалНаКлиенте(ДанныеСтроки, ПереходНаСтроку = Истина, РежимИзмененияСтроки = Ложь)
	
	ОбщийМодульКлиент.Розница_ДобавитьСтрокуВДеревоМатериалов(ЭтаФорма, ДанныеСтроки, ПереходНаСтроку, РежимИзмененияСтроки); // №12433 было: ОбщийМодульКлиент.Розница_ДобавитьСтрокуВДеревоТоваров(ЭтаФорма, ДанныеСтроки, ПереходНаСтроку, РежимИзмененияСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварНаКлиенте(ДанныеСтроки, ПереходНаСтроку = Истина, РежимИзмененияСтроки = Ложь)
	
	ОбщийМодульКлиент.Розница_ДобавитьСтрокуВДеревоМатериалов(ЭтаФорма, ДанныеСтроки, ПереходНаСтроку, РежимИзмененияСтроки);
	
КонецПроцедуры



//&НаСервере
//Процедура ДобавитьМатериалНаСервере(НоменклатураМатериала, Комната)
//	
//	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
//	Для Каждого Строка из Дерево.Строки Цикл
//		Если Строка.Комната = Комната Тогда
//			Стр = Строка.Строки.Добавить();
//			Стр.Номенклатура = НоменклатураМатериала;
//			Стр.Комната = Комната;
//			
//			Стр.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Стр.Номенклатура);
//			Стр.Коэффициент = 1;
//			Стр.Количество = 1;
//			
//			Стр.УИСтроки = Новый УникальныйИдентификатор;
//			
//			ЗначениеВДанныеФормы(Дерево, ДеревоМатериалов);
//			Возврат;
//		КонецЕсли
//	КонецЦикла;	
//	
//КонецПроцедуры

//++ #12539 закомментировано

//&НаКлиенте
//Процедура ДеревоТоваровЦветФактурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
//	Если НЕ ЭтоНоменклатураПотолка(ТекущиеДанные.Номенклатура) Тогда
//		СтандартнаяОбработка = Ложь;
//		ПоказатьПредупреждение(,"Цвет можно задавать только для номенклатуры-потолка");
//		Возврат;
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура СоздатьНоменклатуруПотолков(Команда)
//	Если ЭтаФорма.Модифицированность Тогда
//		ПоказатьПредупреждение(,"Предварительно следует записать документ");
//		Возврат;
//	Иначе
//		ОповещениеСоздатьНоменклатуруПотолковПодтверждение = Новый ОписаниеОповещения("СоздатьНоменклатуруПотолковПодтверждение",ЭтаФорма);
//		ПоказатьВопрос(ОповещениеСоздатьНоменклатуруПотолковПодтверждение,"Для всех строк, где указана номенклатура ""Потолок"" будут созданы соответствующие позиции потолков. Продолжить?",РежимДиалогаВопрос.ДаНет,);
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура СоздатьНоменклатуруПотолковПодтверждение(Результат, Параметры) Экспорт
//    Если Результат = КодВозвратаДиалога.Нет Тогда
//        Возврат;
//    КонецЕсли;

//    //сначала проверим заполнение всех необходимых параметров
//	ЕстьОшибки = Ложь;
//	Для Каждого ТекущаяСтрока Из Объект.ТоварыУслуги Цикл
//		Если ТекущаяСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.Потолок") Тогда
//			Если ПустаяСтрока(ТекущаяСтрока.НомерПотолка) Тогда
//				Сообщить("В комнате " + ТекущаяСтрока.Комната + " для потолка не указан его номер" );
//				ЕстьОшибки = Истина;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	Если ЕстьОшибки Тогда
//		ПоказатьПредупреждение(,"Создание номенклатур потолков отменено");
//	Иначе
//		ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
//		СоздатьНоменклатуруПотолковНаСервере();
//		ЭтаФорма.Модифицированность = Истина;
//		
//		СтруктураЗаписи = Новый Структура;
//		СтруктураЗаписи.Вставить("РежимЗаписи",РежимЗаписиДокумента.Проведение);
//		ЭтаФорма.Записать();
//		
//		РазвернутьДеревоТоваров(ТекущаяКомната);
//		ОбновитьОтображениеЭлементовФормы();
//		ПоказатьПредупреждение(,"Создание номенклатур потолков завершено");
//	КонецЕсли;
//	
//	

//КонецПроцедуры

//&НаСервере
//Процедура СоздатьНоменклатуруПотолковНаСервере()
//	
//	Для Каждого ТекущаяСтрока Из Объект.ТоварыУслуги Цикл
//		Если ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.Потолок Тогда
//			НаименованиеНоменклатурыДляПоиска = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(ТекущаяСтрока.НомерПотолка, ТекущаяСтрока.ЦветФактуры, ТекущаяСтрока.ЦветФактуры.Владелец);
//			ГруппаНоменклатурыДляПоиска = Константы.ГруппаНоменклатурыПродукция.Получить();
//			ИскомаяНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеНоменклатурыДляПоиска, Истина, ГруппаНоменклатурыДляПоиска);
//			Если ИскомаяНоменклатура.Пустая() Тогда
//				ИскомаяНоменклатура = СоздатьНоменклатуруПродукцияНаСервере(ТекущаяСтрока.НомерПотолка, ТекущаяСтрока.ЦветФактуры);
//			КонецЕсли;
//			Если НЕ ИскомаяНоменклатура.Пустая() Тогда
//				ТекущаяСтрока.Номенклатура = ИскомаяНоменклатура;
//				ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	
//	ПерестроитьДеревоНаФорме();
//	
//КонецПроцедуры

//&НаСервере
//Функция СоздатьНоменклатуруПродукцияНаСервере(НомерПотолка, ЦветФактуры)
//	
//	БазоваяЕдИзм = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
//	Если БазоваяЕдИзм.Пустая() Тогда
//		Сообщить("Ошибка!"+Символы.ПС+"В справочнике ""Классификатор единиц измерения"" не найдена единица с наименованием ""м2""");
//		Возврат Справочники.Номенклатура.ПустаяСсылка();
//	КонецЕсли;
//	
//	Отказ = Ложь;
//	Если ПустаяСтрока(НомерПотолка) Тогда
//		Отказ = Истина;
//		Сообщить("Не указан номер создаваемого потолка");
//	КонецЕсли;
//	Если Отказ Тогда
//		Сообщить("Номенклатура не создана");
//		Возврат Справочники.Номенклатура.ПустаяСсылка();
//	КонецЕсли;
//	
//	НаименованиеНоменклатурыДляСоздания = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(НомерПотолка, ЦветФактуры, ЦветФактуры.Владелец);
//	ГруппаНоменклатурыДляСоздания = Константы.ГруппаНоменклатурыПродукция.Получить();
//	
//	Попытка
//		НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
//		НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
//		НоваяНоменклатура.БазоваяЕдиницаИзмерения = БазоваяЕдИзм.Ссылка;
//		НоваяНоменклатура.Наименование = НаименованиеНоменклатурыДляСоздания;
//		НоваяНоменклатура.Родитель = ГруппаНоменклатурыДляСоздания;
//		НоваяНоменклатура.Потолок_НомерРасчета = НомерПотолка;
//		
//		НоваяНоменклатура.Потолок_Фактура.Очистить();
//		НоваяСтрока = НоваяНоменклатура.Потолок_Фактура.Добавить();
//		НоваяСтрока.Основная = Истина;
//		НоваяСтрока.ПродукцияФактура = ЦветФактуры.Владелец;
//		НоваяСтрока.ПродукцияЦвет = ЦветФактуры;
//		
//		НоваяНоменклатура.Записать();
//	
//		
//		Возврат НоваяНоменклатура.Ссылка;
//	Исключение
//		Сообщить("Ошибка!" + Символы.ПС + ОписаниеОшибки());
//		Возврат Справочники.Номенклатура.ПустаяСсылка();
//	КонецПопытки;
//	
//КонецФункции

//-- #12539 закомментировано

&НаКлиенте
Процедура ЗагрузитьПотолокИзEasyCeiling(Команда)
	
	ПеренестиДеревоВТабличнуюЧасть();
	
	ВМатериалы = (СтрНайти(Команда.Имя, "ВМатериалы") > 0);
	ОбщийМодульКлиент.ЗагрузитьПотолокИзПостроителя(ЭтотОбъект, "ЗаказДоговор", ВМатериалы);
	
	//Если НЕ ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала() тогда
	//	Возврат;
	//КонецЕсли;
	//	
	//ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;	
	//Если ВМатериалы Тогда
	//	ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	//КонецЕсли;
	//
	//Если ТекущиеДанные = Неопределено Тогда
	//	ПоказатьОповещениеПользователя("Выберите комнату");
	//	Возврат;
	//КонецЕсли;
	//
	//Если ПустаяСтрока(ТекущиеДанные.Комната) Тогда
	//	ПоказатьОповещениеПользователя("Выберите комнату");
	//	Возврат;
	//КонецЕсли;
	//
	//ТекущаяКомната = ТекущиеДанные.Комната;
	//ДополнительныеПараметры = Новый Структура("ТекущаяКомната, ВМатериалы", ТекущаяКомната, ВМатериалы);
	//	
	//Оповещение = Новый ОписаниеОповещения("ЗагрузитьПотолокИзПостроителяПослеВыбораФайлов", ЭтотОбъект, ДополнительныеПараметры);
	//НачальныйКаталог = ОбщийМодуль.ПолучитьКаталогВыгрузиИзПостроителяДляТекущегоПользователя(Истина);
	//
	//Если ОбменСEasyCeiling.ИспользоватьСтандартныйДиалогWindowsДляВыбораФайлаВыгрузкиИзПостроителяй() Тогда		
	//	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//	Диалог.Каталог = НачальныйКаталог;
	//	Фильтр = "Выгрузка из построителя (*.ini)|*.ini";
	//	Диалог.Фильтр = Фильтр;
	//	Диалог.МножественныйВыбор = Истина;
	//	Диалог.Заголовок = "Выберите файлы";	
	//	Диалог.Показать(Оповещение);		
	//Иначе
	//	ОткрытьФорму("ОбщаяФорма.ФормаВыбораФайла", Новый Структура("НачальныйКаталог", НачальныйКаталог),ЭтаФорма,,,,Оповещение);					
	//КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ЗагрузитьПотолокИзПостроителяПослеВыбораФайлов(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
//	
//	Если ВыбранныеФайлы = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если ВыбранныеФайлы.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ПеренестиДеревоВТабличнуюЧасть();
//	
//	ОповещениеПослеЗакрытия = Новый ОписаниеОповещения("ЗагрузитьПотолокИзПостроителяЗавершение", ЭтаФорма, ДополнительныеПараметры);			
//	ПараметрыФормыЗагрузки = Новый Структура;
//	ПараметрыФормыЗагрузки.Вставить("ЗапускатьПриОткрытии", Истина);
//	ПараметрыФормыЗагрузки.Вставить("НаКлиенте", Истина);
//	СписокФайлов = Новый СписокЗначений;
//	СписокФайлов.ЗагрузитьЗначения(ВыбранныеФайлы);
//	ПараметрыФормыЗагрузки.Вставить("СписокФайлов", СписокФайлов);
//	ПараметрыФормыЗагрузки.Вставить("ПоВладельцу", Истина);
//	
//	ПараметрыФормыЗагрузки.Вставить("ЭтоРозница", Истина);
//	ПараметрыФормыЗагрузки.Вставить("УчитыватьНДС", УчитыватьНДС);
//	ПараметрыФормыЗагрузки.Вставить("Комната", ДополнительныеПараметры.ТекущаяКомната);	
//	ПараметрыФормыЗагрузки.Вставить("ВМатериалы", ДополнительныеПараметры.ВМатериалы);
//	
//	ОткрытьФорму("ОбщаяФорма.ФормаЗагрузкиИзПостроителя", ПараметрыФормыЗагрузки, ЭтаФорма,,,,ОповещениеПослеЗакрытия);

//КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПотолокИзПостроителяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Модифицированность = Истина;
	
	ПерестроитьДеревоНаФорме();
	
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Номенклатура") Тогда
		РазвернутьДеревоТоваров(ДополнительныеПараметры.ТекущаяКомната, Результат);
		РассчитатьИтоговыеПоказателиКлиент();
		ДобавленнаяСтрока = НайтиСтрокуДерева(ДеревоТоваров, ДополнительныеПараметры.ТекущаяКомната, Результат);
		Если НЕ ДобавленнаяСтрока = Неопределено Тогда
			Элементы.ДеревоТоваров.ТекущаяСтрока = ДобавленнаяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
		Оповестить("ОбновитьСписокФайлов", Результат); //#6233
	КонецЕсли;
		
	ПоказатьОповещениеПользователя("Данные загружены");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВНоменклатуреУказанаПлощадьПотолка(Номенклатура)
	
	Возврат ЗначениеЗаполнено(Номенклатура.Потолок_КоличествоПродукция);
	
КонецФункции

&НаСервере
Функция ПолучитьПризнакЕстьЗаказПокупателяПоПотолку(Номенклатура, ХарактеристикаНоменклатуры, НомерПотолка)
	
	КВозврату = Ложь;
	
	Если Не ЗначениеЗаполнено(НомерПотолка) Тогда
		Возврат КВозврату;
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоПотолкам.Номенклатура КАК Номенклатура,
	|	ЗаказыПоПотолкам.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ЗаказыПоПотолкам.КоличествоПриход, 0) > 0 КАК ЕстьЗаказПокупателяПоПотолку
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ЗаказНаПроизводство <> &ЗаказДоговор
	|				И Номенклатура.Потолок_НомерРасчета = &НомерПотолка
	|				И Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)) КАК ЗаказыПоПотолкам
	|ГДЕ
	|	ЗаказыПоПотолкам.Регистратор ССЫЛКА Документ.ЗаказПокупателя
	|	И ЗаказыПоПотолкам.Регистратор.Основание = &ЗаказДоговор";
	
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ЗаказыПоПотолкам.Номенклатура КАК Номенклатура,
	//	|	ЗаказыПоПотолкам.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,	
	//	|	ЕСТЬNULL(ЗаказыПоПотолкам.КоличествоПриход, 0) > 0 КАК ЕстьЗаказПокупателяПоПотолку,
	//	|	ЕСТЬNULL(СправочникНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Потолок
	//	|ИЗ
	//	|	РегистрНакопления.ЗаказыПокупателей.Обороты(, ,Регистратор , ЗаказНаПроизводство <> &ЗаказДоговор) КАК ЗаказыПоПотолкам
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	//	|		ПО (СправочникНоменклатура.Потолок_НомерРасчета = &НомерПотолка)
	//	|			И (СправочникНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок))
	//	|ГДЕ	
	//	|	ЗаказыПоПотолкам.Номенклатура = &Номенклатура
	//	|   И ЗаказыПоПотолкам.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	//	|	И ЕСТЬNULL(СправочникНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//	|   И ЗаказыПоПотолкам.Регистратор ССЫЛКА Документ.ЗаказПокупателя
	//	|   И ЗаказыПоПотолкам.Регистратор.Основание = &ЗаказДоговор";
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("НомерПотолка", НомерПотолка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КВозврату = Выборка.ЕстьЗаказПокупателяПоПотолку;
	КонецЕсли;
	
	Возврат КВозврату;

КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьНеобходимостьОбновитьДанныеПослеУдаленияЗаказаПокупателя()
	
	КВозврату = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	Настройка = ХранилищеОбщихНастроек.Загрузить("УстановленаПометкаУдаленияНаЗаказПокупателя",,, Строка(Пользователи.ТекущийПользователь()));	
	Если ТипЗнч(Настройка) = Тип("Булево") Тогда
		КВозврату = Настройка;	
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КВозврату;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СнятьПризнакНеобходимостиОбновленияДанныхПослеУдаленияЗаказаПокупателя()
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("УстановленаПометкаУдаленияНаЗаказПокупателя",, Ложь,, Строка(Пользователи.ТекущийПользователь()));
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросПередИзменениемСтроки(Отказ, Элемент, ТекстВопроса)
	
	Если НЕ РазрешитьРедактированиеСтроки Тогда
		
        Отказ            = Истина;
        
        ПараметрыОповещения    = Новый Структура;
        ПараметрыОповещения.Вставить("Элемент", Элемент);
        
        Оповещение        = Новый ОписаниеОповещения("ПослеОтветаПользователяПередИзменениемСтроки", ЭтаФорма, ПараметрыОповещения);
        ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеОтветаПользователяПередИзменениемСтроки(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
        РазрешитьРедактированиеСтроки    = Истина;
        
        ТекЭлемент    = ДополнительныеПараметры.Элемент;    
        ТекЭлемент.ИзменитьСтроку();
		
		РазрешитьРедактированиеСтроки    = Ложь;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОплатПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ГрафикОплат.ТекущиеДанные;
		ТекущиеДанные.Сумма = Объект.СуммаДокумента - Объект.ГрафикОплат.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтрагента(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВопросаОСозданииКонтрагента", ЭтотОбъект);	
	ПоказатьВопрос(ОповещениеОЗакрытии, "Создать нового контрагента?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСозданииКонтрагента(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда			
		ПараметрыНовогоКонтрагента = ПараметрыНовогоКонтрагентаНаСервере();
		ПараметрыФормы = Новый Структура("Основание, ВыборНового", ПараметрыНовогоКонтрагента, Истина);
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор); //, ЭтаФорма.Окно);
		// получение контрагента в процедуре ОбработкаВыбора				
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПараметрыНовогоКонтрагентаНаСервере()

	ПараметрыНовогоКонтрагента = Новый Структура;
	ПараметрыНовогоКонтрагента.Вставить("Родитель", Константы.ГруппаНовыхКонтрагентовРозницы.Получить());
	ПараметрыНовогоКонтрагента.Вставить("Розница", Истина);
	ПараметрыНовогоКонтрагента.Вставить("Покупатель", Истина); // #6381
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Лид") И ЗначениеЗаполнено(Объект.Основание) Тогда	
		РеквизитыЛида = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание, "ИмяКлиента, Город, Адрес");
		ПараметрыНовогоКонтрагента.Вставить("Наименование", 		 РеквизитыЛида.ИмяКлиента);
		ГородЛида = Строка(РеквизитыЛида.Город);
		АдресЛида = СтрШаблон("%1%2", ?(ПустаяСтрока(ГородЛида), "", ГородЛида + ", "), РеквизитыЛида.Адрес);
		//ПараметрыНовогоКонтрагента.Вставить("ЮридическийАдрес", 	 АдресЛида);  // #16044 закомментировано
		ПараметрыНовогоКонтрагента.Вставить("ФактическийАдрес", 	 АдресЛида);
		ПараметрыНовогоКонтрагента.Вставить("ДополнительнаяКонтактнаяИнформация", ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.Основание.ДополнительнаяКонтактнаяИнформация.Выгрузить()));
	КонецЕсли;
	Возврат ПараметрыНовогоКонтрагента;
	
КонецФункции

&НаСервере
Функция ПолучитьНомерЛидаОснования()
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Лид") Тогда
		Возврат Объект.Основание.Номер;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам()
	
	//заполняем данные по остаткам на складах
	
	МассивТоваров = Новый Массив;
	Для Каждого ТекущаяСтрокаКомната Из ДеревоТоваров.ПолучитьЭлементы() Цикл
		Для Каждого ТекущаяСтрока Из ТекущаяСтрокаКомната.ПолучитьЭлементы() Цикл
			НоваяСтрока = Новый Структура("Комната, Номенклатура, ХарактеристикаНоменклатуры, Коэффициент, НомерПотолка, Количество, УИСтроки");			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			МассивТоваров.Добавить(НоваяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	ПоказателиПоТовару = ПолучитьПоказателиПоТоваруСервер(Объект.Организация, Объект.Ссылка, МассивТоваров, Объект.ЗаполнятьУИСтрок);
		
	Для Каждого ТекущаяСтрокаКомната Из ДеревоТоваров.ПолучитьЭлементы() Цикл
		Для Каждого ТекущаяСтрока Из ТекущаяСтрокаКомната.ПолучитьЭлементы() Цикл
			
			СтрокаТовара = Новый Структура("Комната, Номенклатура, ХарактеристикаНоменклатуры, УИСтроки");
			ЗаполнитьЗначенияСвойств(СтрокаТовара, ТекущаяСтрока);
			
			Для каждого СтрокаПоказателейТЗ из ПоказателиПоТовару Цикл
				СтрокаПоказателя = Новый Структура("Комната, Номенклатура, ХарактеристикаНоменклатуры, УИСтроки");			
				ЗаполнитьЗначенияСвойств(СтрокаПоказателя, СтрокаПоказателейТЗ);
			
				Если ОбщийМодульКлиентСервер.СтруктурыСовпадают(СтрокаТовара, СтрокаПоказателя) Тогда
					ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаПоказателейТЗ, "КОтгрузке, ОстатокНаСкладе, Доступно, ВРезерве, ЕстьЗаказПокупателяПоПотолку, Монтаж, МонтажСтатус, Заказано, КоличествоВМонтажах");	
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоказателиПоТоваруСервер(Организация, ТекущийЗаказ, МассивТоваров, ЗаполнятьУИСтрок)
	
	ТаблицаТоваров = Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("Комната", 						Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25)));
	ТаблицаТоваров.Колонки.Добавить("Номенклатура", 				Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры", 	Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТоваров.Колонки.Добавить("Коэффициент", 					Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10, 4)));
	ТаблицаТоваров.Колонки.Добавить("НомерПотолка", 				Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50)));
	ТаблицаТоваров.Колонки.Добавить("Количество", 					Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("УИСтроки", 					Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(36)));
	
	Для Каждого ТекущаяСтрока Из МассивТоваров Цикл
		НоваяСтрока = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	ВремТаблицаТоваров = ТаблицаТоваров.Скопировать();
	ВремТаблицаТоваров.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, Коэффициент, НомерПотолка", "Количество");
	
	ТаблицаТоваров.Колонки.Добавить("КОтгрузке", 					Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("ОстатокНаСкладе", 				Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("Доступно", 					Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("ВРезерве", 					Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("ЕстьЗаказПокупателяПоПотолку", Новый ОписаниеТипов("Булево"));
	ТаблицаТоваров.Колонки.Добавить("Монтаж", 						Новый ОписаниеТипов("ДокументСсылка.Монтаж"));
	ТаблицаТоваров.Колонки.Добавить("МонтажСтатус", 				Новый ОписаниеТипов("СправочникСсылка.РезультатыМонтажа"));
	ТаблицаТоваров.Колонки.Добавить("Заказано", 					Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("КоличествоВМонтажах", 			Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2))); 	
	
	// сбор данных
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ВремТаблицаТоваров);
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("Склад",						ОбщийМодульСервер.НастройкаПользователя("СкладРозница"));
	Запрос.УстановитьПараметр("ЗаказДоговор",				ТекущийЗаказ);
	Запрос.УстановитьПараметр("ИспользуютсяОбщиеСклады",	Константы.ОбщиеСклады.Получить());
	Запрос.УстановитьПараметр("ИспользоватьРезервирование", Константы.ИспользоватьРезервирование.Получить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ТЗЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТЗЗаказПокупателяТовары.Количество КАК Количество,
	|	ТЗЗаказПокупателяТовары.Коэффициент КАК Коэффициент,
	|	ТЗЗаказПокупателяТовары.НомерПотолка КАК НомерПотолка
	|ПОМЕСТИТЬ ВремЗаказПокупателяТоварыДоп
	|ИЗ
	|	&ТаблицаДокумента КАК ТЗЗаказПокупателяТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремЗаказПокупателяТоварыДоп.Номенклатура КАК Номенклатура,
	|	ВремЗаказПокупателяТоварыДоп.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВремЗаказПокупателяТоварыДоп.Количество КАК Количество,
	|	ВремЗаказПокупателяТоварыДоп.Коэффициент КАК Коэффициент,
	|	ВремЗаказПокупателяТоварыДоп.НомерПотолка КАК НомерПотолка,
	|	ЕСТЬNULL(СправочникНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Потолок
	|ПОМЕСТИТЬ ВремЗаказПокупателяТовары
	|ИЗ
	|	ВремЗаказПокупателяТоварыДоп КАК ВремЗаказПокупателяТоварыДоп
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО (СправочникНоменклатура.Потолок_НомерРасчета = ВремЗаказПокупателяТоварыДоп.НомерПотолка)
	|			И (СправочникНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок))
	|			И (НЕ ВремЗаказПокупателяТоварыДоп.НомерПотолка = """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.Потолок КАК Потолок,
	|	ЕСТЬNULL(ЗаказыПоПотолкам.КоличествоПриход, 0) > 0 КАК ЕстьЗаказПокупателяПоПотолку,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|			ТОГДА ТоварыНаСкладахОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
	|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
	|	КОНЕЦ КАК ОстатокНаСкладе,
	|	ЕСТЬNULL(ВЫБОР		
	|		КОГДА &ИспользоватьРезервирование
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|						ТОГДА ВРезервеОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
	|					ИНАЧЕ ВРезервеОстатки.КоличествоОстаток
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ, 0) КАК ВРезерве,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|			ТОГДА ЗаказПокупателяТовары.Количество - ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0) / ЗаказПокупателяТовары.Коэффициент
	|		ИНАЧЕ ЗаказПокупателяТовары.Количество - ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0)
	|	КОНЕЦ КАК КОтгрузке
	|ИЗ
	|	ВремЗаказПокупателяТовары КАК ЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ
	|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО ЗаказПокупателяТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Обороты(, , , ЗаказНаПроизводство = &ЗаказДоговор) КАК ЗаказыПокупателейОбороты
	|		ПО ЗаказПокупателяТовары.Номенклатура = ЗаказыПокупателейОбороты.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Обороты(, , , ЗаказНаПроизводство <> &ЗаказДоговор) КАК ЗаказыПоПотолкам
	|		ПО ЗаказПокупателяТовары.Потолок = ЗаказыПоПотолкам.Номенклатура
	|			И (НЕ ЗаказПокупателяТовары.Потолок = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(,
	|				Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ) КАК ВРезервеОстатки
	|		ПО (ЗаказПокупателяТовары.Номенклатура = ВРезервеОстатки.Номенклатура)
	|			И (ЗаказПокупателяТовары.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры)";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",ТекущаяСтрока.Номенклатура);
		Отбор.Вставить("ХарактеристикаНоменклатуры",ТекущаяСтрока.ХарактеристикаНоменклатуры);
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, НайденныеСтроки[0],
				"КОтгрузке, ОстатокНаСкладе, ЕстьЗаказПокупателяПоПотолку, ВРезерве");
			ТекущаяСтрока.Доступно = ТекущаяСтрока.ОстатокНаСкладе - ТекущаяСтрока.ВРезерве;
		КонецЕсли;
	КонецЦикла;
	
	
	Если ЗначениеЗаполнено(ТекущийЗаказ) Тогда
		
		//заполняем данные по документам "Монтаж" которых использовалась строка документа
		Если ЗаполнятьУИСтрок Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МонтажТоварыУслуги.Ссылка КАК Ссылка,
			|	МонтажТоварыУслуги.УИСтроки КАК УИСтроки,
			|	МонтажТоварыУслуги.Ссылка.Результат КАК Результат
			|ИЗ
			|	Документ.Монтаж.ТоварыУслуги КАК МонтажТоварыУслуги
			|ГДЕ
			|	МонтажТоварыУслуги.Ссылка.Основание = &Основание
			|	И НЕ МонтажТоварыУслуги.Ссылка.ПометкаУдаления";
			Запрос.УстановитьПараметр("Основание", ТекущийЗаказ);
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
				Если ПустаяСтрока(ТекущаяСтрока.УИСтроки) Тогда
					Продолжить;
				КонецЕсли;
				Отбор = Новый Структура;
				Отбор.Вставить("УИСтроки", ТекущаяСтрока.УИСтроки);
				НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТекущаяСтрока.Монтаж = НайденныеСтроки[0].Ссылка;
					ТекущаяСтрока.МонтажСтатус = НайденныеСтроки[0].Результат;
				КонецЕсли;			
			КонецЦикла;
			
		КонецЕсли;		
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗаказДоговор", ТекущийЗаказ);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбеспечениеЗаказовРозницы.Комната КАК Комната,
		|	ОбеспечениеЗаказовРозницы.Номенклатура КАК Номенклатура,
		|	ОбеспечениеЗаказовРозницы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ОбеспечениеЗаказовРозницы.КоличествоПоФакту) КАК Заказано
		|ИЗ
		|	РегистрНакопления.ОбеспечениеЗаказовРозницы КАК ОбеспечениеЗаказовРозницы
		|ГДЕ
		|	ОбеспечениеЗаказовРозницы.Заказ = &ЗаказДоговор
		|	И ОбеспечениеЗаказовРозницы.Назначение = ""Товары""
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбеспечениеЗаказовРозницы.Комната,
		|	ОбеспечениеЗаказовРозницы.Номенклатура,
		|	ОбеспечениеЗаказовРозницы.ХарактеристикаНоменклатуры";
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		Если РезультатЗапроса.Количество() > 0 Тогда
			Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("Комната", ТекущаяСтрока.Комната);
				Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
				Отбор.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
				НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(ТекущаяСтрока, НайденныеСтроки[0],	"Заказано");			
				КонецЕсли;
			КонецЦикла;			
		КонецЕсли;	
		
		//КоличествоМонтажах
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Основание", ТекущийЗаказ);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(МонтажТоварыУслуги.Количество) КАК Количество,
		|	МонтажТоварыУслуги.УИСтроки КАК УИСтроки,
		|	""Товары"" КАК Назначение
		|ИЗ
		|	Документ.Монтаж.ТоварыУслуги КАК МонтажТоварыУслуги
		|ГДЕ
		|	МонтажТоварыУслуги.Ссылка.Проведен
		|	И МонтажТоварыУслуги.Ссылка.Основание = &Основание
		|	И МонтажТоварыУслуги.УИСтроки <> """"
		|
		|СГРУППИРОВАТЬ ПО
		|	МонтажТоварыУслуги.УИСтроки";
		
		ТаблицаИспользованияВДругихМонтажах = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекущаяНоменклатура Из ТаблицаТоваров Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("УИСтроки", ТекущаяНоменклатура.УИСтроки);
			Отбор.Вставить("Назначение","Товары");
			НайденныеСтроки = ТаблицаИспользованияВДругихМонтажах.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ТекущаяНоменклатура.КоличествоВМонтажах = НайденныеСтроки[0].Количество;				
			Иначе
				ТекущаяНоменклатура.КоличествоВМонтажах = 0;
			КонецЕсли;
		КонецЦикла;
		
		
	КонецЕсли; //Если ЗначениеЗаполнено(ТекущийЗаказ) Тогда
		
	//ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);

КонецФункции

&НаСервере
Процедура ЗаполнитьВычисляемыеДанныеПоМатериалам()
			
	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
	
	//НАЧАЛО Переход на 2.0 R2
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбеспечениеЗаказовРозницы.Комната КАК Комната,
	|	ОбеспечениеЗаказовРозницы.Номенклатура КАК Номенклатура,
	|	ОбеспечениеЗаказовРозницы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОбеспечениеЗаказовРозницы.КоличествоПоФакту) КАК Заказано
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказовРозницы КАК ОбеспечениеЗаказовРозницы
	|ГДЕ
	|	ОбеспечениеЗаказовРозницы.Заказ = &ЗаказДоговор
	|	И ОбеспечениеЗаказовРозницы.Назначение = ""Материалы""
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбеспечениеЗаказовРозницы.Комната,
	|	ОбеспечениеЗаказовРозницы.Номенклатура,
	|	ОбеспечениеЗаказовРозницы.ХарактеристикаНоменклатуры";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() > 0 Тогда
		Для Каждого ТекущаяСтрокаКомната Из Дерево.Строки Цикл
			Для Каждого ТекущаяСтрока Из ТекущаяСтрокаКомната.Строки Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("Комната",ТекущаяСтрока.Комната);
				Отбор.Вставить("Номенклатура",ТекущаяСтрока.Номенклатура);
				Отбор.Вставить("ХарактеристикаНоменклатуры",ТекущаяСтрока.ХарактеристикаНоменклатуры);
				НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(ТекущаяСтрока, НайденныеСтроки[0],	"Заказано");			
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	//КОНЕЦ  Переход на 2.0 R2	
	
	//КоличествоМонтажах
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(МонтажМатериалы.Количество) КАК Количество,
	|	МонтажМатериалы.Номенклатура КАК Номенклатура,
	|	МонтажМатериалы.УИСтроки КАК УИСтроки,
	|	""Материалы"" КАК Назначение
	|ИЗ
	|	Документ.Монтаж.Материалы КАК МонтажМатериалы
	|ГДЕ
	|	МонтажМатериалы.Ссылка.Проведен
	|	И МонтажМатериалы.Ссылка.Основание = &Основание
	|	И МонтажМатериалы.УИСтроки <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	МонтажМатериалы.Номенклатура, 
	|	МонтажМатериалы.УИСтроки";
	
	ТаблицаИспользованияВДругихМонтажах = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяКомната Из Дерево.Строки Цикл
		Если ТекущаяКомната.Номенклатура = Неопределено Или ТекущаяКомната.Номенклатура.Пустая() Тогда
			Для Каждого ТекущаяНоменклатура Из ТекущаяКомната.Строки Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("УИСтроки", ТекущаяНоменклатура.УИСтроки);
				Отбор.Вставить("Номенклатура",ТекущаяНоменклатура.Номенклатура);
				Отбор.Вставить("Назначение","Материалы");
				НайденныеСтроки = ТаблицаИспользованияВДругихМонтажах.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТекущаяНоменклатура.КоличествоВМонтажах = НайденныеСтроки[0].Количество;				
				Иначе
					ТекущаяНоменклатура.КоличествоВМонтажах = 0;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВДанныеФормы(Дерево, ДеревоМатериалов);

КонецПроцедуры

&НаСервере
Функция УстановитьВидЦенНаОснованииДоговора()
	
	//++ №14073 комментируем, т.к. если дальше нигде не указан, обнуляется
	//сначала берем из карточки пользователя (низший приоритет)
	//ВидЦен = ПараметрыСеанса.ТекущийПользователь.ВидЦен;
	//-- №14073
	
	ВидЦен = Объект.ВидЦен; // №14073 запоминаем текущий вид цен, перед возможным изменением
	
	//если задан вид цен в категории контрагента, то берем из него (средний приоритет)
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Если НЕ Объект.Контрагент.Категория.ВидЦен.Пустая() Тогда
			ВидЦен = Объект.Контрагент.Категория.ВидЦен;
		КонецЕсли;
	КонецЕсли;
	//если задан вид цен в договоре, то берем из него (высший приоритет)
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Если НЕ Объект.ДоговорКонтрагента.ВидЦен.Пустая() Тогда
			ВидЦен = Объект.ДоговорКонтрагента.ВидЦен;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидЦен = ВидЦен Тогда
		Возврат Ложь;
	Иначе
		Объект.ВидЦен = ВидЦен;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции  

&НаКлиенте
Процедура ПослеВопросаОбОтменеМонтажей(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        ОтменитьНевыполненныеМонтажиНаСервере();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтменитьНевыполненныеМонтажиНаСервере()
	
	НетОшибок = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Ссылка
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Основание = &Основание
	|	И Монтаж.Результат = &Результат
	|	И НЕ Монтаж.ПометкаУдаления";
	Запрос.УстановитьПараметр("Основание",Объект.Ссылка);
	Запрос.УстановитьПараметр("Результат",Справочники.РезультатыМонтажа.ВРаботе);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.Результат = Справочники.РезультатыМонтажа.Отменен;
		Попытка
			Если Выборка.Ссылка.Проведен Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокОбъект.Записать();
			КонецЕсли;
			Сообщить("ОТМЕНЕН " + Выборка.Ссылка);
		Исключение
			Сообщить("Не удалось отменить " + Выборка.Ссылка + " - " + ОписаниеОшибки());
			НетОшибок = Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Если НетОшибок Тогда
		ПроверитьНеобходимостьОтменыМонтажей = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСуммуДоговора(Команда)
	ОповещениеПослеВводаНовойСуммыДокумента = Новый ОписаниеОповещения("ПослеВводаНовойСуммыДокумента", ЭтаФорма);
	//ПоказатьВводЧисла(ОповещениеПослеВводаНовойСуммыДокумента, Объект.СуммаДокумента, "Введите новую сумму документа", 15, 2);
	ПараметрыФормыИзмененияСуммы = Новый Структура("СуммаДокумента", Объект.СуммаДокумента);
	ОткрытьФорму("ОбщаяФорма.ИзменениеСуммыДокумента", ПараметрыФормыИзмененияСуммы, ЭтаФорма, , , , ОповещениеПослеВводаНовойСуммыДокумента);
КонецПроцедуры

//&НаКлиенте
//Процедура ПослеВводаНовойСуммыДокумента(НоваяСуммаДокумента, Параметры) Экспорт
//	Если НЕ НоваяСуммаДокумента = Неопределено Тогда
//		Если НЕ НоваяСуммаДокумента = Объект.СуммаДокумента Тогда
//			
//			ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
//			ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
//			
//			ПослеВводаНовойСуммыДокументаНаСервере(НоваяСуммаДокумента);
//			ПеренестиДеревоВТабличнуюЧасть();
//			Состояние("Сумма документа изменена");
//			
//			ОбновитьОтображениеЭлементовФормы(ТекущаяКомната, ТекущаяНоменклатура);
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНовойСуммыДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НоваяСуммаДокумента = Результат.НоваяСуммаДокумента; 
	СброситьРанееУстановленныеСкидки = Результат.СброситьРанееУстановленныеСкидки;
	ПрименятьСкидкуНаПотолки = Результат.ПрименятьСкидкуНаПотолки;	
	ПрименятьСкидкуНаТовары = Результат.ПрименятьСкидкуНаТовары;	
	ПрименятьСкидкуНаУслуги = Результат.ПрименятьСкидкуНаУслуги;	
	
	Если НоваяСуммаДокумента = Объект.СуммаДокумента Тогда
		Возврат;
	КонецЕсли;
			
	//ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
	//ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;	
	ТекущаяКомната = Неопределено;
	ТекущаяНоменклатура = Неопределено;	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда			
		ТекущаяКомната 		= ТекущиеДанные.Комната;
		ТекущаяНоменклатура = ТекущиеДанные.Номенклатура;
	КонецЕсли;
	
	ПослеВводаНовойСуммыДокументаНаСервере(НоваяСуммаДокумента, СброситьРанееУстановленныеСкидки, ПрименятьСкидкуНаПотолки, ПрименятьСкидкуНаТовары, ПрименятьСкидкуНаУслуги);
	ПеренестиДеревоВТабличнуюЧасть();
	ПоказатьОповещениеПользователя("Сумма документа изменена");
			
	ОбновитьОтображениеЭлементовФормы(ТекущаяКомната, ТекущаяНоменклатура);
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаСервере
Процедура ПослеВводаНовойСуммыДокументаНаСервере(НоваяСуммаДокумента, СброситьСкидки, СкидкаПотолки, СкидкаТовары, СкидкаУслуги)
	
	Если СброситьСкидки Тогда
		Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
		
		СтрокаСНаибольшейСуммой = Неопределено;
		НаибольшаяСумма = 0;
		СуммаДокументаПослеИзменения = 0;
		
		//сначала переопределим скидку по шапке документа
		СуммаДокумента = 0;
		СуммаДокументаПоСкидочнымПозициям = 0;
		
		Для Каждого Строка из Дерево.Строки Цикл
			Для Каждого СтрНоменклатура из Строка.Строки Цикл
				СтрНоменклатура.ПроцентСкидки = ПолучитьПроцентВидаСкидки(Объект.ВидСкидки);
				РассчитатьСуммуСтрокиНаСервере(СтрНоменклатура);
				//РассчитатьСуммуНДСТабЧастиНаСервере(СтрНоменклатура);
				ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрНоменклатура, УчитыватьНДС);
				
				СуммаДокумента = СуммаДокумента + СтрНоменклатура.Сумма;
				
				Если (СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок"))
					ИЛИ (СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"))
					ИЛИ (СкидкаТовары И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"))	
					ИЛИ (СкидкаУслуги И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга")) Тогда
					СуммаДокументаПоСкидочнымПозициям = СуммаДокументаПоСкидочнымПозициям + СтрНоменклатура.Сумма;
				КонецЕсли;
								
			КонецЦикла;	
		КонецЦикла;
		
		СуммаДокументаДоИзменения = СуммаДокумента;
		Разница = СуммаДокументаДоИзменения - НоваяСуммаДокумента;
		
		Если СуммаДокументаПоСкидочнымПозициям = 0 Тогда
			Сообщить("В данном документе отсутствуют позиции выбранного вида. Изменение суммы документа отменено");
			Возврат;
		КонецЕсли;	
		
		Если СуммаДокументаПоСкидочнымПозициям < Разница Тогда
			Сообщить("Объем скидки больше суммы товаров и услуг по выбранным категориям");
			СуммаДокументаПоСкидочнымПозициям = 0;
		КонецЕсли;	
		
		//изменим скидки
		Если НЕ СуммаДокументаПоСкидочнымПозициям = 0 Тогда 
			КоэффициентИзменения = Разница / СуммаДокументаПоСкидочнымПозициям;
			Для Каждого ТекущаяКомната Из Дерево.Строки Цикл
				Для Каждого ТекущийТовар Из ТекущаяКомната.Строки Цикл
					
					Если (СкидкаПотолки И ТекущийТовар.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок"))
					 ИЛИ (СкидкаПотолки И ТекущийТовар.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"))	
					 ИЛИ (СкидкаТовары И ТекущийТовар.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"))	
					 ИЛИ (СкидкаУслуги И ТекущийТовар.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга")) Тогда
						Если ТекущийТовар.Сумма >= НаибольшаяСумма Тогда
							НаибольшаяСумма = ТекущийТовар.Сумма;
							СтрокаСНаибольшейСуммой = ТекущийТовар;
						КонецЕсли;
						ТекущийТовар.ПроцентСкидки = ТекущийТовар.ПроцентСкидки + (КоэффициентИзменения*100);
						РассчитатьСуммуСтрокиНаСервере(ТекущийТовар);
						//РассчитатьСуммуНДСТабЧастиНаСервере(ТекущийТовар);
						ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущийТовар, УчитыватьНДС);
						СуммаДокументаПослеИзменения = СуммаДокументаПослеИзменения + ТекущийТовар.Сумма;
					Иначе
						РассчитатьСуммуСтрокиНаСервере(ТекущийТовар);
						ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущийТовар, УчитыватьНДС);
						СуммаДокументаПослеИзменения = СуммаДокументаПослеИзменения + ТекущийТовар.Сумма;
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
			
			//пересчитаем строку с наибольшей суммой, если после пересчета по строкам итог не сошелся с желаемым
			Если НЕ СуммаДокументаПослеИзменения = НоваяСуммаДокумента Тогда
				Если НЕ СтрокаСНаибольшейСуммой = Неопределено Тогда
					Разница = НоваяСуммаДокумента - СуммаДокументаПослеИзменения;
					СтрокаСНаибольшейСуммой.Сумма = СтрокаСНаибольшейСуммой.Сумма + Разница;
					//СуммаБезРучнойСкидки = СтрокаСНаибольшейСуммой.Цена * СтрокаСНаибольшейСуммой.Количество - (СтрокаСНаибольшейСуммой.Цена * СтрокаСНаибольшейСуммой.Количество * (СтрокаСНаибольшейСуммой.ПроцентАвтоматическойСкидки/100));
					СуммаБезРучнойСкидки = СтрокаСНаибольшейСуммой.Цена * СтрокаСНаибольшейСуммой.Количество;
					Если НЕ СуммаБезРучнойСкидки = 0 Тогда
						СтрокаСНаибольшейСуммой.ПроцентСкидки = 100 - (СтрокаСНаибольшейСуммой.Сумма / СуммаБезРучнойСкидки)*100;
						СтрокаСНаибольшейСуммой.СуммаСкидки = СуммаБезРучнойСкидки * СтрокаСНаибольшейСуммой.ПроцентСкидки / 100;
					КонецЕсли;
					//РассчитатьСуммуНДСТабЧастиНаСервере(СтрокаСНаибольшейСуммой);
					ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаСНаибольшейСуммой, УчитыватьНДС);
				КонецЕсли;
			КонецЕсли;
			
			ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
			Модифицированность = Истина;
		КонецЕсли;
		
	Иначе
		//#5374
		Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
				
		//определим сумму строк, участвующих в пересчете
		// Скидку 100% и выше не увеличивать.
		СуммаДокументаПоСкидочнымПозициям = 0;
		СуммаКРаспределению = НоваяСуммаДокумента; // в этой переменной учтем новую сумму документа с учетом строк, не участвующих в изменении
		СуммаДокумента = 0;
		КоличествоИзменяемыхСтрок = 0 ;
		КоличествоИзменяемыхСтрокПоКатегориям = 0 ;
		Для Каждого Строка из Дерево.Строки Цикл
			Для Каждого СтрНоменклатура из Строка.Строки Цикл
				
				Если СтрНоменклатура.ПроцентСкидки >= 100 ИЛИ НЕ ((СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок"))
					ИЛИ (СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"))
					ИЛИ (СкидкаТовары И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"))	
					ИЛИ (СкидкаУслуги И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга"))) Тогда
					СуммаКРаспределению  = СуммаКРаспределению - СтрНоменклатура.Сумма;
				Иначе
					КоличествоИзменяемыхСтрок = КоличествоИзменяемыхСтрок + 1;
				КонецЕсли;
				
				Если ((СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок"))
					ИЛИ (СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"))
					ИЛИ (СкидкаТовары И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"))	
					ИЛИ (СкидкаУслуги И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга"))) Тогда
					КоличествоИзменяемыхСтрокПоКатегориям = КоличествоИзменяемыхСтрокПоКатегориям + 1;
				КонецЕсли;
				
				СуммаДокумента = СуммаДокумента + СтрНоменклатура.Сумма;
				
			КонецЦикла;	
		КонецЦикла;
		СуммаПропорции = СуммаДокумента - (НоваяСуммаДокумента - СуммаКРаспределению); // сумма старых строк, участвующих в изменении
		Если КоличествоИзменяемыхСтрок = 0 Тогда
			Если КоличествоИзменяемыхСтрокПоКатегориям = 0 Тогда
				Сообщить("В данном документе отсутствуют позиции выбранного вида. Изменение суммы документа отменено");
			Иначе
				Сообщить("Во всех строках выбранных категорий указаны скидки более 100%, изменение не выполнено");
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		ПозицияИзменяемойСтроки = 1;
		КоэффициентИзменения = СуммаКРаспределению / СуммаПропорции;
		Для Каждого Строка из Дерево.Строки Цикл
			Для Каждого СтрНоменклатура из Строка.Строки Цикл
				
				Если СтрНоменклатура.ПроцентСкидки >= 100 ИЛИ НЕ ((СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок"))
					ИЛИ (СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"))
					ИЛИ (СкидкаТовары И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"))	
					ИЛИ (СкидкаУслуги И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга"))) Тогда
						// ничего не делаем
					Иначе
						Если ПозицияИзменяемойСтроки = КоличествоИзменяемыхСтрок Тогда  // исправить ошибку в сумме распределения
							СтрНоменклатура.Сумма = СуммаКРаспределению;
						Иначе
							СтрНоменклатура.Сумма = СтрНоменклатура.Сумма * КоэффициентИзменения;
						КонецЕсли;
						СтрНоменклатура.СуммаСкидки = СтрНоменклатура.Цена * СтрНоменклатура.Количество - СтрНоменклатура.Сумма;
						ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(СтрНоменклатура, "ПроцентСкидки", "СуммаСкидки");
						ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрНоменклатура, УчитыватьНДС);
						ПозицияИзменяемойСтроки = ПозицияИзменяемойСтроки + 1;					
						СуммаКРаспределению = СуммаКРаспределению - СтрНоменклатура.Сумма;				
					КонецЕсли;
				
			КонецЦикла;	
		КонецЦикла;
		
		ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетПоОплатам(Команда)
	// 2017-06-23
	Если Элементы.ГрафикОплат.ТекущиеДанные <> Неопределено Тогда
		УсловияОтбора  = Новый Структура("ЗаказДоговор", Объект.Ссылка);
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
		ОткрытьФорму("Отчет.ВедомостьДолговПоРассрочкам.Форма", ПараметрыФормы, ,  Объект.Ссылка.УникальныйИдентификатор()); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьКолонкуГрафикОплатОплачено()
	//2017-06-23
	// для заполнения добавленных вручную колонок "Оплачено" и "Дата оплаты" 
	//Запрос = Новый Запрос(	
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ДолгиПоРассрочкамОстаткиИОбороты.СрокПлатежа КАК СрокПлатежа,
	//|	ДолгиПоРассрочкамОстаткиИОбороты.СуммаРасход КАК Оплачено,
	//|	ДолгиПоРассрочкамОстаткиИОбороты.ПериодДень КАК ДатаОплаты
	//|ИЗ
	//|	РегистрНакопления.ДолгиПоРассрочкам.ОстаткиИОбороты(, , Авто, , ) КАК ДолгиПоРассрочкамОстаткиИОбороты
	//|ГДЕ
	//|	ДолгиПоРассрочкамОстаткиИОбороты.ЗаказДоговор В(&ЗаказДоговор)
	//|УПОРЯДОЧИТЬ ПО
	//|	СрокПлатежа
	//|");
	Запрос = Новый Запрос(	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДолгиПоРассрочкамОстаткиИОбороты.СрокПлатежа КАК СрокПлатежа,
	|	СУММА(ДолгиПоРассрочкамОстаткиИОбороты.СуммаРасход) КАК Оплачено,
	|	МАКСИМУМ(ДолгиПоРассрочкамОстаткиИОбороты.ПериодДень) КАК ДатаОплаты
	|ИЗ
	|	РегистрНакопления.ДолгиПоРассрочкам.ОстаткиИОбороты(, , Авто, , ) КАК ДолгиПоРассрочкамОстаткиИОбороты
	|ГДЕ
	|	ДолгиПоРассрочкамОстаткиИОбороты.ЗаказДоговор В(&ЗаказДоговор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолгиПоРассрочкамОстаткиИОбороты.СрокПлатежа
	|
	|УПОРЯДОЧИТЬ ПО
	|	СрокПлатежа");
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Для Каждого Стр Из Объект.ГрафикОплат Цикл
		Если Выборка.НайтиСледующий(Стр.ДатаПлатежа, "СрокПлатежа") Тогда
			Стр.Оплачено = Выборка.Оплачено;
			Стр.ДатаОплаты = Выборка.ДатаОплаты;
		Иначе
			Стр.Оплачено = 0;
			Стр.ДатаОплаты = Неопределено;
		КонецЕсли;
		Выборка.Сбросить();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроцентЗамерщику(Команда)
	ПослеВводаПроцентаЗамерщику = Новый ОписаниеОповещения("ПослеВводаПроцентаЗамерщику", ЭтаФорма);
	ПоказатьВводЧисла(ПослеВводаПроцентаЗамерщику, Объект.ПроцентЗамерщику, "Введите % от суммы продажи по договору замерщику", 15, 2);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПроцентаЗамерщику(Число, Параметры) Экспорт
    Если НЕ Число = Неопределено Тогда
        Объект.ПроцентЗамерщику = Число;
		Модифицированность = Истина;
		ОбновитьОтображениеЭлементовФормы();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДоступныхСтатусов(ТекущийСтатус)
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЗаказДоговоров.Ссылка
	|ИЗ
	|	Справочник.СтатусыЗаказДоговоров КАК СтатусыЗаказДоговоров
	|ГДЕ
	|	СтатусыЗаказДоговоров.Ссылка <> ЗНАЧЕНИЕ(Справочник.СтатусыЗаказДоговоров.Отменен)";
	Запрос.УстановитьПараметр("Ссылка", ТекущийСтатус);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область ВкладкаФайлы

&НаСервере
Процедура ОбновитьСписокФайлов()
	
	ФайлыДерево.ПолучитьЭлементы().Очистить();
	
	СписокСсылок = Новый СписокЗначений;
	ВремДеревоТоваров = РеквизитФормыВЗначение("ДеревоТоваров");
	Для Каждого СтрокаКомнат Из ВремДеревоТоваров.Строки Цикл
		Для Каждого СтрокаНоменклатура Из СтрокаКомнат.Строки Цикл
			СписокСсылок.Добавить(СтрокаНоменклатура.Номенклатура);
		КонецЦикла;
	КонецЦикла;
	ВремДеревоМатериалов = РеквизитФормыВЗначение("ДеревоМатериалов");
	Для Каждого СтрокаКомнат Из ВремДеревоМатериалов.Строки Цикл
		Для Каждого СтрокаНоменклатура Из СтрокаКомнат.Строки Цикл
			СписокСсылок.Добавить(СтрокаНоменклатура.Номенклатура);
		КонецЦикла;
	КонецЦикла;
	
	////Добавлен ЗД, нужно по нему также вывести прикрепленные данные  - перенесено в процедуру ДополнитьСписокСсылокНаФайлы
	//СписокНоменклатуры.Добавить(Объект.Ссылка);
	////Добавлен Лид и Монтажи
	//Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Лид") И НЕ Объект.Основание.Пустая() Тогда
	//	СписокНоменклатуры.Добавить(Объект.Основание);
	//КонецЕсли;
	
	ДополнитьСписокСсылокНаФайлы(СписокСсылок, Истина);
	ОбщийМодульСервер.ОбновитьСписокФайлов(ЭтотОбъект, СписокСсылок);
	
	//Запрос = Новый Запрос; - перенесено в ОбщийМодульСервер.ОбновитьСписокФайлов
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ВЫБОР
	//|		КОГДА ПрикрепленныеДанные.СсылкаНаОбъект ССЫЛКА Справочник.Номенклатура
	//|			ТОГДА &ЭтотДокумент
	//|       ИНАЧЕ ПрикрепленныеДанные.СсылкаНаОбъект
	//|   КОНЕЦ КАК СсылкаНаОбъект,
	//|	ВЫБОР
	//|		КОГДА ПрикрепленныеДанные.СсылкаНаОбъект ССЫЛКА Справочник.Номенклатура
	//|			ТОГДА ПрикрепленныеДанные.СсылкаНаОбъект
	//|       ИНАЧЕ Значение(Справочник.Номенклатура.ПустаяСсылка)
	//|   КОНЕЦ КАК Номенклатура,
	//|	ПрикрепленныеДанные.ИмяФайла,
	//|	ПрикрепленныеДанные.Расширение,
	//|	ПрикрепленныеДанные.Период КАК ДатаПрикрепления
	//|ИЗ
	//|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	//|ГДЕ
	//|	ПрикрепленныеДанные.СсылкаНаОбъект В(&СписокСсылок)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ПрикрепленныеДанные.СсылкаНаОбъект";
	//Запрос.УстановитьПараметр("СписокСсылок", СписокНоменклатуры);
	//Запрос.УстановитьПараметр("ЭтотДокумент", Объект.Ссылка);
	//
	//ТаблицаФайлов = Запрос.Выполнить().Выгрузить();
	//ТаблицаДокументов = ТаблицаФайлов.Скопировать(, "СсылкаНаОбъект");
	//ТаблицаДокументов.Свернуть("СсылкаНаОбъект");
	//
	//КоличествоФайлов = 0;	
	//Дерево = ДанныеФормыВЗначение(ФайлыДерево, Тип("ДеревоЗначений"));
	//Для Каждого ТекущийДокумент из ТаблицаДокументов Цикл
	//	
	//	КореньДерева = Дерево.Строки.Добавить();
	//	КореньДерева.Документ = ТекущийДокумент.СсылкаНаОбъект;
	//	Если ТекущийДокумент.СсылкаНаОбъект = Объект.Ссылка Тогда
	//		КореньДерева.ЭтотДокумент = Истина;
	//	КонецЕсли;
	//	
	//	//Найдем все файлы по текущему документу
	//	НайденныеФайлы = ТаблицаФайлов.НайтиСтроки(Новый Структура("СсылкаНаОбъект", ТекущийДокумент.СсылкаНаОбъект));
	//	Для Каждого ТекущаяСтрока Из НайденныеФайлы Цикл
	//		ПодчиненнаяСтрока = КореньДерева.Строки.Добавить();
	//		ПодчиненнаяСтрока.Документ = ТекущийДокумент.СсылкаНаОбъект;
	//		ПодчиненнаяСтрока.ПодчиненнаяСтрока = Истина;
	//		ЗаполнитьЗначенияСвойств(ПодчиненнаяСтрока, ТекущаяСтрока);
	//		
	//		КоличествоФайлов = КоличествоФайлов + 1;
	//	КонецЦикла;
	//	
	//КонецЦикла;	
	//ЗначениеВДанныеФормы(Дерево, ФайлыДерево);

	//
	//Если КоличествоФайлов > 0 Тогда
	//	Элементы.ТаблицаФайлы.Заголовок = "Файлы (" + КоличествоФайлов + ")";
	//Иначе
	//	Элементы.ТаблицаФайлы.Заголовок = "Файлы";
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьСписокСсылокНаФайлы(СписокСсылок, СписокДляПросмотра = Ложь)
	// если СписокДляПросмотра, то получаем список ссылок для формирования списка файлов
	// иначе                       получаем список ссылок для добавления файлов (добавление только к текущему документу)
	
	//Текущий документ
	СписокСсылок.Добавить(Объект.Ссылка, Объект.Ссылка); //"Текущий документ");
	
	Если СписокДляПросмотра Тогда
		// добавление Лида
		Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Лид") И НЕ Объект.Основание.Пустая() Тогда
			СписокСсылок.Добавить(Объект.Основание);
		КонецЕсли;	
		
		// добавление монтажей
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Монтажи.Ссылка
		|ИЗ
		|	Документ.Монтаж КАК Монтажи
		|ГДЕ
		|   Монтажи.Основание = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СписокСсылок.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ФайлыДерево.ТекущиеДанные;
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайла = ОбщийМодульВызовСервера.ПолучитьДанныеФайла(ТекущиеДанные.Документ, ТекущиеДанные.ИмяФайла, ТекущиеДанные.Номенклатура, ЭтотОбъект.УникальныйИдентификатор);
	
	Если НЕ АдресФайла = Неопределено Тогда // №7253
		ВременноеИмя = ПолучитьИмяВременногоФайла(ТекущиеДанные.Расширение);
	    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	Если НЕ ВключитьПредпросмотрФайлов ИЛИ Элементы.ФайлыДерево.ТекущиеДанные = Неопределено Тогда //ИЛИ Элементы.ФайлыДерево.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если мПредыдущийИдентификатор = Элементы.ФайлыДерево.ТекущиеДанные.ПолучитьИдентификатор() Тогда
		Возврат;
	Иначе
		мПредыдущийИдентификатор = Элементы.ФайлыДерево.ТекущиеДанные.ПолучитьИдентификатор();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияФайлыПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДеревоПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияФайлыПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.ФайлыДерево.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда			
			АдресФайла = ОбщийМодульВызовСервера.ПолучитьДанныеФайла(ТекущиеДанные.Документ, ТекущиеДанные.ИмяФайла, ТекущиеДанные.Номенклатура, ЭтотОбъект.УникальныйИдентификатор);	
			ОбщийМодульКлиент.ПредпросмотрФайла(АдресФайла, ТекущиеДанные.Расширение, Предпросмотр, Элементы.Предпросмотр);
		Иначе
			Элементы.Предпросмотр.Вид = ВидПоляФормы.ПолеHTMLДокумента;
			Предпросмотр = "";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Документ не сохранен!");
		Возврат;
	КонецЕсли;
	
	СписокПотолков = ПолучитьСписокПотолков();
	ДополнитьСписокСсылокНаФайлы(СписокПотолков);
	Если НЕ СписокПотолков.Количество() = 0 Тогда
		Оп = Новый ОписаниеОповещения("ПослеВыбораСсылкиДляПрикрепленияФайла", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оп, СписокПотолков, Элементы.ФайлыДобавитьФайл);
		ОбновитьОтображениеЭлементовФормы();
	//Иначе
	//	ПоказатьПредупреждение(,"В товарах и материалах нет потолков и отрезов");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПотолков()
	
	СписокНоменклатуры = Новый СписокЗначений;
	ВремДеревоТоваров = РеквизитФормыВЗначение("ДеревоТоваров");
	Для Каждого СтрокаКомнат Из ВремДеревоТоваров.Строки Цикл
		Для Каждого СтрокаНоменклатура Из СтрокаКомнат.Строки Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаНоменклатура.Номенклатура) Тогда
				СписокНоменклатуры.Добавить(СтрокаНоменклатура.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ВремДеревоМатериалов = РеквизитФормыВЗначение("ДеревоМатериалов");
	Для Каждого СтрокаКомнат Из ВремДеревоМатериалов.Строки Цикл
		Для Каждого СтрокаНоменклатура Из СтрокаКомнат.Строки Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаНоменклатура.Номенклатура) Тогда
				СписокНоменклатуры.Добавить(СтрокаНоменклатура.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораСсылкиДляПрикрепленияФайла(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ДействиеПослеПрикрепления", ОписаниеОповещения);
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(ВыбранныйЭлемент.Значение, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрикрепленияФайлаЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРезультата.Результат Тогда
		ОбновитьОтображениеЭлементовФормы();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьФайл(Команда)
	
	ВыбранныеЭлементы = Элементы.ФайлыДерево.ВыделенныеСтроки;
	
	//Если НЕ Элементы.Файлы.ТекущиеДанные = Неопределено Тогда
	Если ВыбранныеЭлементы.Количество() > 0 Тогда
		Для каждого ЭлементДляПечати из ВыбранныеЭлементы Цикл
			СтрФайл = ФайлыДерево.НайтиПоИдентификатору(ЭлементДляПечати);
			
			// если выделен корень дерева, то пропускаем
			Если СтрФайл.ПолучитьРодителя() = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			АдресФайла = ОбщийМодульВызовСервера.ПолучитьДанныеФайла(СтрФайл.Документ, СтрФайл.ИмяФайла, СтрФайл.Номенклатура, ЭтотОбъект.УникальныйИдентификатор);
			Если НЕ АдресФайла = Неопределено Тогда // №7253
				ВременноеИмя = ПолучитьИмяВременногоФайла(СтрФайл.Расширение);
				ПолучитьФайл(АдресФайла, ВременноеИмя, Ложь);
				
				Shell = Новый COMОбъект("Shell.Application");
				Shell.ShellExecute(ВременноеИмя, "", "", "print", 0);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ПоказатьПредупреждение(,"Выберите файл(ы) в списке");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписокФайлов(Команда)
	
	//Запомним текущую строку
	ТекущиеДанные = Элементы.ФайлыДерево.ТекущиеДанные;
	
	ОбновитьСписокФайлов();
	
	ИдТекущейСтроки = Неопределено;
	КоллекцияЭлементовДерева = ЭтаФорма.ФайлыДерево.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Для Каждого ПодчиненнаяСтрока Из Строка.ПолучитьЭлементы() Цикл
			Если ТекущиеДанные <> Неопределено И ПодчиненнаяСтрока.Документ = ТекущиеДанные.Документ И ПодчиненнаяСтрока.Номенклатура = ТекущиеДанные.Номенклатура И ПодчиненнаяСтрока.ИмяФайла = ТекущиеДанные.ИмяФайла Тогда
				ИдТекущейСтроки = ПодчиненнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЦикла;
		Если ИдТекущейСтроки = Неопределено Тогда
			ИдТекущейСтроки = ИдентификаторСтроки;			
		КонецЕсли;
		Элементы.ФайлыДерево.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
	Элементы.ФайлыДерево.ТекущаяСтрока = ИдТекущейСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайл(Команда)
	
	ОбщийМодульКлиент.УдалитьФайлыВДереве(ЭтаФорма, ФайлыДерево, Элементы.ФайлыДерево);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбУдаленииФайловВДереве(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	ОбщийМодульВызовСервера.УдалитьФайлыВДереве(Параметры.МассивФайловКУдалению);	
	КомандаОбновитьСписокФайлов(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьВсеФайлы(Команда)
	
	ОбщийМодульКлиент.ПросмотретьВсеФайлы(ФайлыДерево, "Заказ-договор " + Объект.Номер, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлыДляПросмотра(Команда)
	
	Элементы.ФайлыДеревоПометкаДляВыбора.Видимость = Истина;
	Элементы.ГруппаФайлыКнопкиВыбораФайлов.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьВыбранныеФайлы(Команда)
	
	ОбщийМодульКлиент.ПросмотретьВсеФайлы(ФайлыДерево, "Заказ-договор " + Объект.Номер, УникальныйИдентификатор, Истина);
	
	Элементы.ФайлыДеревоПометкаДляВыбора.Видимость = Ложь;
	Элементы.ГруппаФайлыКнопкиВыбораФайлов.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыборФайлов(Команда)
	
	Элементы.ФайлыДеревоПометкаДляВыбора.Видимость = Ложь;
	Элементы.ГруппаФайлыКнопкиВыбораФайлов.Видимость = Ложь;
	
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура ПредварительныйРасчет(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ЗаказДоговор", Объект.Ссылка);
	ОткрытьФорму("Отчет.ПредварительнаяСебестоимостьЗаказДоговора.ФормаОбъекта", ПараметрыОтчета);
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////

//проверяет соответствие товаров и услуг монтажей товарам и услугам заказ-договора
//если монтажей еще нет, поле "Текущий статус" окрашивается в желтый цвет
//если количество и состав номенклатуры по комнатам полностью соответствует заказ договору, поле "Текущий статус" окрашивается в зеленый цвет, иначе - в красный
&НаСервере
Процедура ПроверитьСоответствиеМонтажей()
	
	
	Запрос = Новый Запрос;
	//Запрос.Текст = - из-за RLS выборку делаем из документов + этот регистр теперь больше не используется (раньше использовался в АРМ Розницы для формирования заголовков по фильтрам) 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ВыполнениеМонтажейПоДоговорамОбороты.Регистратор КАК Монтаж
	//|ИЗ
	//|	РегистрНакопления.ВыполнениеМонтажейПоДоговорам.Обороты(, , Регистратор, ЗаказДоговор = &ЗаказДоговор) КАК ВыполнениеМонтажейПоДоговорамОбороты";
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтажи.Ссылка КАК Монтаж
	|ИЗ
	|	Документ.Монтаж КАК Монтажи
	|ГДЕ
	|	Монтажи.Основание = &ЗаказДоговор
	|	И НЕ Монтажи.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Отменен)
	|	И НЕ Монтажи.ПометкаУдаления";
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.Ссылка);
	ВыборкаМонтажи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаМонтажи.Количество() = 0 Тогда
		
		// закомментировано в рамках заявки #16346
		//Элементы.ТекущийСтатус.ЦветФона = WebЦвета.Желтый;
		
	Иначе
		
		ТаблицаТоваровИУслуг = Новый ТаблицаЗначений;
		ТаблицаТоваровИУслуг.Колонки.Добавить("Комната");
		ТаблицаТоваровИУслуг.Колонки.Добавить("Номенклатура");
		ТаблицаТоваровИУслуг.Колонки.Добавить("Количество");
		//++ №10821 единица и коэффициент, так же участвуют в сопоставлении
		ТаблицаТоваровИУслуг.Колонки.Добавить("ЕдиницаИзмерения");
		ТаблицаТоваровИУслуг.Колонки.Добавить("Коэффициент");
		//-- №10821
		ТаблицаТоваровИУслуг.Колонки.Добавить("Сумма");
		
		ВремДеревоТоваров = РеквизитФормыВЗначение("ДеревоТоваров");
		Для Каждого СтрокаКомнаты Из ВремДеревоТоваров.Строки Цикл
			Для Каждого СтрокаНоменклатуры Из СтрокаКомнаты.Строки Цикл
				НоваяСтрока = ТаблицаТоваровИУслуг.Добавить();
				НоваяСтрока.Комната = СтрокаНоменклатуры.Комната;
				НоваяСтрока.Номенклатура = СтрокаНоменклатуры.Номенклатура;
				//++ №10821
				//НоваяСтрока.Количество = СтрокаНоменклатуры.Количество * СтрокаНоменклатуры.Коэффициент;
				НоваяСтрока.Количество = СтрокаНоменклатуры.Количество;
				НоваяСтрока.ЕдиницаИзмерения = СтрокаНоменклатуры.ЕдиницаИзмерения;
				НоваяСтрока.Коэффициент = СтрокаНоменклатуры.Коэффициент;
				//-- №10821
				НоваяСтрока.Сумма = СтрокаНоменклатуры.Сумма;
			КонецЦикла;
		КонецЦикла;
		
		ТаблицаТоваровИУслуг.Свернуть("Комната, Номенклатура, ЕдиницаИзмерения, Коэффициент", "Количество, Сумма"); // №10821 добавлена единица и коэффициет
		
		Пока ВыборкаМонтажи.Следующий() Цикл
			
			//++16703
			МонтажОбъект = ВыборкаМонтажи.Монтаж.ПолучитьОбъект();
			Если Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Договор И НЕ (МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Монтаж ИЛИ МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Продажа) Тогда
				ПоказатьКнопкуОтчетаСравненияСМонтажами = Истина;
				Возврат;
			КонецЕсли;
			Если Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Продажа И НЕ МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Продажа Тогда
				ПоказатьКнопкуОтчетаСравненияСМонтажами = Истина;
				Возврат;
			КонецЕсли;
			Если Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Рекламация И НЕ (МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Рекламация ИЛИ МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Продажа)   Тогда
				ПоказатьКнопкуОтчетаСравненияСМонтажами = Истина;
				Возврат;
			КонецЕсли;
			Если Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.СервиснаяЗаявка И НЕ (МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.СервиснаяЗаявка ИЛИ МонтажОбъект.ВидОперации = Справочники.ВидыМонтажа.Продажа)  Тогда
				ПоказатьКнопкуОтчетаСравненияСМонтажами = Истина;
				Возврат;
			КонецЕсли;
			//++16703
			
			Для Каждого СтрокаТоварыМонтажа Из ВыборкаМонтажи.Монтаж.ТоварыУслуги Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("Комната",СтрокаТоварыМонтажа.Комната);
				Отбор.Вставить("Номенклатура",СтрокаТоварыМонтажа.Номенклатура);
				//++ №10821
				Отбор.Вставить("ЕдиницаИзмерения", СтрокаТоварыМонтажа.ЕдиницаИзмерения);
				Отбор.Вставить("Коэффициент", СтрокаТоварыМонтажа.Коэффициент);
				//-- №10821
				НайденныеСтроки = ТаблицаТоваровИУслуг.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 тогда
					НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество - СтрокаТоварыМонтажа.Количество; // №10821 перемножать на коэффициент теперь не нужно *СтрокаТоварыМонтажа.Коэффициент;
					НайденныеСтроки[0].Сумма = НайденныеСтроки[0].Сумма - СтрокаТоварыМонтажа.Сумма;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ПолноеСоответсвтие = Истина;
		Для Каждого ТекущаяСтрока Из ТаблицаТоваровИУслуг Цикл
			Если Не ТекущаяСтрока.Количество = 0 или НЕ ТекущаяСтрока.Сумма = 0 Тогда
				ПолноеСоответсвтие = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПолноеСоответсвтие Тогда
			//Элементы.ТекущийСтатус.ЦветФона = WebЦвета.БледноЗеленый;
			ПоказатьКнопкуОтчетаСравненияСМонтажами = Ложь;
		Иначе
			//Элементы.ТекущийСтатус.ЦветФона = WebЦвета.Лосось;
			ПоказатьКнопкуОтчетаСравненияСМонтажами = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчетСравнениеСМонтажами(Команда)
	ПараметрыОтчета  = Новый Структура;
	ПараметрыОтчета.Вставить("ЗаказДоговор", Объект.Ссылка);
	ОткрытьФорму("Отчет.СравнениеЗаказДоговораСМонтажами.ФормаОбъекта", ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаименованиеВременныхПотолков(Команда)
	Если НЕ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Лид") или Объект.Основание.Пустая() Тогда
		ПоказатьПредупреждение(,"Не указан лид-основание. Переименование невозможно");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(Объект.НомерДоговора) Тогда
		ПоказатьПредупреждение(,"Не указан номер договора. Переименование невозможно");
		Возврат;
	КонецЕсли;
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Предварительно следует записать документ");
		Возврат;
	КонецЕсли;
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ПослеОтветаНаВопросОПереименованииВременныхПотолков", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещенияВопрос, "Изменить временные наименования потолков, присвоенные в расчете лида?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОПереименованииВременныхПотолков(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
        ИзменитьНаименованиеВременныхПотолковНаСервере();
		Для Каждого ТекущаяСтрока Из Объект.ТоварыУслуги Цикл
			ОповеститьОбИзменении(ТекущаяСтрока.Номенклатура);
		КонецЦикла;
		ПоказатьПредупреждение(,"Переименование потолков завершено");
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьНаименованиеВременныхПотолковНаСервере()
	
	НомерДляПоиска = "л" + Объект.Основание.Номер;
	
	Для Каждого ТекущаяСтрока Из Объект.ТоварыУслуги Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			Если СтрНайти(ТекущаяСтрока.Номенклатура.Наименование, НомерДляПоиска) > 0 Тогда
				//переименовываем
				спрОбъект = ТекущаяСтрока.Номенклатура.ПолучитьОбъект();
				СтароеНаименование = спрОбъект.Наименование;
				
				НовоеНаименование = Сред(СтароеНаименование,13,СтрДлина(СтароеНаименование)-1); //Убираем из наименования часть строки вида "Потолок 1017"
				НовоеНаименование = СтрЗаменить(НовоеНаименование,НомерДляПоиска,Объект.НомерДоговора);
				
				спрОбъект.Наименование = НовоеНаименование;
				Попытка
					спрОбъект.Записать();
					Сообщить("[" + СтароеНаименование + "] переименован в [" + НовоеНаименование + "]");
				Исключение
					Сообщить("Не удалось переименовать [" + СтароеНаименование + "]. " + ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПредупредитьОбУдаленииСтрокиДереваТовары(ТабличнаяЧасть, ИндексСтроки, ТекстВопроса)
   
   ПоказатьВопрос(Новый ОписаниеОповещения("ПредупредитьОбУдаленииСтрокиДереваТоварыЗавершение", ЭтотОбъект, 
                   Новый Структура("ТабличнаяЧасть, ИндексСтроки", ТабличнаяЧасть, ИндексСтроки)),
                   ТекстВопроса,РежимДиалогаВопрос.ДаНет); 
   
КонецПроцедуры                       
 
&НаКлиенте
Процедура ПредупредитьОбУдаленииСтрокиДереваТоварыЗавершение(Ответ, Параметры) Экспорт
 
   ОтказОтУдаления = (Ответ = КодВозвратаДиалога.Да);
   Если Ответ = КодВозвратаДиалога.Да Тогда
	   ИдентификаторСтроки = Параметры.ИндексСтроки;
	   ТекущаяСтрока       = ДеревоТоваров.НайтиПоИдентификатору(ИдентификаторСтроки);
	   СтрокаРодитель      = ТекущаяСтрока.ПолучитьРодителя();
	   
	   Если СтрокаРодитель = Неопределено Тогда
		   ДеревоТоваров.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
	   Иначе
		   СтрокаРодитель.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
	   КонецЕсли;
	   
	   ПеренестиДеревоВТабличнуюЧасть();
	   ПерестроитьДеревоНаФорме();
	   РазвернутьДеревоТоваров(ВремТекущаяКомната, ВремТекущаяНоменклатура);
	   РазвернутьДеревоМатериалов();
	   
   КонецЕсли; 
   
КонецПроцедуры

&НаСервере
Функция ПолучитьКомнатуИНоменклатуруСледущийСтроки()
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ТекущаяКомната","");
	СтруктураОтвета.Вставить("ТекущаяНоменклатура",Неопределено);
	Нашли = Ложь;
	
	ВремДеревоТоваров = РеквизитФормыВЗначение("ДеревоТоваров");
	Для Каждого ТекущаяСтрокаКомната Из ВремДеревоТоваров.Строки Цикл
		Если ТекущаяСтрокаКомната.Комната = ВремТекущаяКомната и ТекущаяСтрокаКомната.Номенклатура = ВремТекущаяНоменклатура Тогда
			Нашли = Истина;
			Продолжить;
		Иначе
			Если Нашли Тогда
				СтруктураОтвета.ТекущаяКомната = ТекущаяСтрокаКомната.Комната;
				СтруктураОтвета.ТекущаяНоменклатура = Неопределено;
				Возврат СтруктураОтвета;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрокаНоменклатура Из ТекущаяСтрокаКомната.Строки Цикл
			Если ТекущаяСтрокаНоменклатура.Комната = ВремТекущаяКомната и ТекущаяСтрокаНоменклатура.Номенклатура = ВремТекущаяНоменклатура Тогда
				Нашли = Истина;
			Иначе
				Если Нашли Тогда
					СтруктураОтвета.ТекущаяКомната = ТекущаяСтрокаНоменклатура.Комната;
					СтруктураОтвета.ТекущаяНоменклатура = ТекущаяСтрокаНоменклатура.Номенклатура;
					Возврат СтруктураОтвета;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//случай удаления самой последней строки дерева
	Для Каждого ТекущаяСтрокаКомната Из ВремДеревоТоваров.Строки Цикл
		
		Если ТекущаяСтрокаКомната.Комната = ВремТекущаяКомната и ТекущаяСтрокаКомната.Номенклатура = ВремТекущаяНоменклатура Тогда
			Продолжить;
		Иначе
			СтруктураОтвета.ТекущаяКомната = ТекущаяСтрокаКомната.Комната;
			СтруктураОтвета.ТекущаяНоменклатура = Неопределено;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрокаНоменклатура Из ТекущаяСтрокаКомната.Строки Цикл
			Если ТекущаяСтрокаНоменклатура.Комната = ВремТекущаяКомната и ТекущаяСтрокаНоменклатура.Номенклатура = ВремТекущаяНоменклатура Тогда
			Иначе
				СтруктураОтвета.ТекущаяКомната = ТекущаяСтрокаНоменклатура.Комната;
				СтруктураОтвета.ТекущаяНоменклатура = ТекущаяСтрокаНоменклатура.Номенклатура;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СтруктураОтвета;
	
КонецФункции



//&НаКлиенте
//Процедура ОформитьЗамену(Команда)
//	ПараметрыНовогоДокумента = Новый Структура;
//	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
//	ОткрытьФорму("Документ.Замена.Форма.ФормаДокумента", ПараметрыНовогоДокумента);
//КонецПроцедуры

//&НаКлиенте
//Процедура ОформитьЛид(Команда)
//	ПараметрыНовогоДокумента = Новый Структура;
//	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
//	ОткрытьФорму("Документ.Лид.Форма.ФормаДокумента", ПараметрыНовогоДокумента);
//КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКотрагентаПоДисконтнойКарте(Команда)
	ОП = Новый ОписаниеОповещения("ПослеПолученияКонтрагентаПоДисконтноКарте", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ПолучитьКонтрагентаПоДисконтнойКарте",,,,,,ОП);
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияКонтрагентаПоДисконтноКарте(ПараметрыВозврата, ДопПараметры) Экспорт
	
	Если НЕ ПараметрыВозврата = Неопределено Тогда
		Объект.Контрагент = ПараметрыВозврата.Контрагент;
		Объект.ДисконтнаяКарта = ПараметрыВозврата.ДисконтнаяКарта;
		
		КонтрагентПриИзмененииНаСервере();
		ОбновитьНадписьТекущегоДолгаКонтрагента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредполагаемыйМонтажДатаБудетОпределенаПоЗвонкуПриИзменении(Элемент)
	Если Объект.ПредполагаемыйМонтажДатаМонтажаНеОпределена Тогда
		Элементы.ГруппаДатаВремяМонтажа.Видимость = Ложь;
		Элементы.ГруппаДатаПоЗвонку.Видимость = Истина;
	Иначе
		Элементы.ГруппаДатаПоЗвонку.Видимость = Ложь;
		Элементы.ГруппаДатаВремяМонтажа.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура ОформитьЗаказПокупателя(Команда)
//	
//	Если Модифицированность Тогда
//		ПоказатьПредупреждение(,"Предварительно следует записать документ",,"Отказ");
//		Возврат;
//	КонецЕсли;
//	// #12540 удалено
//	//Если НЕ ВсеПотолкиПодготовленыДляПроизводства() Тогда
//	//	ПоказатьПредупреждение(,"Перед заказом на производство необходимо всем потолкам присвоить номера и создать соответствующую номенклатуру",,"Отказ");
//	//	Возврат;
//	//КонецЕсли;
//	
//	НастройкаИнтеркампани = ОбщийМодуль.ПолучитьНастройкуИнтеркампани(Объект.ТочкаПродаж, Объект.Подразделение, Объект.Организация);
//	Если НастройкаИнтеркампани.Пустая() Тогда
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не включено использование интеркампани или в настройках программы / текущего пользователя / точке продаж не заданы настройки интеркампани по умолчанию. Заказы не могут быть созданы.");
//		Возврат;
//	КонецЕсли;
//	
//	СписокТоваров = ПодготовитьСписокТоваровДляВыбораПользователемКПроизводствуНаСервере();
//	Если СписокТоваров = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("СписокТоваров", СписокТоваров);
//	ПараметрыФормы.Вставить("НастройкаИнтеркампани", НастройкаИнтеркампани);
//	ПараметрыФормы.Вставить("ДоступныАналогиМатериалов", Истина);
//	
//	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораТоваровКЗаказуПокупателяНаПроизводство", ЭтаФорма, НастройкаИнтеркампани);
//	ОткрытьФорму("ОбщаяФорма.ФормаЗаказаНаПроизводствоИзРозницы", ПараметрыФормы, ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,ОповещениеОЗакрытии);
//	
//КонецПроцедуры

&НаКлиенте
//Процедура ПослеВыбораТоваровКЗаказуПокупателяНаПроизводство(Результат, ДополнительныеПараметры) Экспорт
Процедура ЗаказПокупателяСоздатьНаОснованииДокументаРозницыЗавершение(Результат)	
	
	//Если ТипЗнч(Результат) = Тип("Структура") Тогда
	//	Если Результат.СписокЗаказать.Количество() > 0 Тогда
	//		СтруктураВозврата = СоздатьЗаказыПокупателейНаПроизводствоНаСервере(Результат, ДополнительныеПараметры);
	//		Если НЕ СтруктураВозврата = Неопределено Тогда
	//			ПоказатьПредупреждение(,"Создание заказов покупателя на производство завершено" 
	//			+ Символы.ПС + "Создано новых заказов: " + СтруктураВозврата.СозданоНовых
	//			+ Символы.ПС + "Обновлено ранее оформленных заказов: " + СтруктураВозврата.Обновлено,,"Выполнено");
				
				// проверим и произведем при необходимости замену материалов на аналоги
				ЕстьЗаменаМатериаловНаАналоги = Ложь;
				Для каждого ЭлементМассива из Результат.СписокЗаказать Цикл
					Если ЭлементМассива.Назначение = "Материалы" И ЭлементМассива.НомерСтроки > 0 Тогда
						СтрокаМатериалов = Объект.Материалы[ЭлементМассива.НомерСтроки-1];
						Если ЭлементМассива.Номенклатура <> СтрокаМатериалов.Номенклатура Тогда						
							ЗаполнитьЗначенияСвойств(СтрокаМатериалов, ЭлементМассива, 
							"Номенклатура, ХарактеристикаНоменклатуры, 
							| Количество, ЕдиницаИзмерения, Коэффициент");
							ЕстьЗаменаМатериаловНаАналоги = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если ЕстьЗаменаМатериаловНаАналоги Тогда
					ПерестроитьДеревоМатериалыНаФорме();
					ПоказатьОповещениеПользователя("Замена аналогов",, "Произведена замена аналогов в материалах");
				КонецЕсли;
				
				Модифицированность = Истина;
				
				Оповестить("ОбновитьАРМПроизводства",,"ЗаказДоговор");
	//			
	//		КонецЕсли;
	//	Иначе
	//		ПоказатьПредупреждение(,"Товар к заказу не выбран");
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	//ПерестроитьДеревоНаФорме();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();	
	РазвернутьДеревоТоваров();
	
	Записать();
	
КонецПроцедуры

&НаСервере
Функция СоздатьЗаказыПокупателейНаПроизводствоНаСервере(СтруктураДанных, НастройкаИнтеркампани)
		
	Возврат ОбщийМодульСервер.СоздатьЗаказыПокупателейНаПроизводствоИзРозницы(Объект.Ссылка, СтруктураДанных.СписокЗаказать, НастройкаИнтеркампани, СтруктураДанных);
	
КонецФункции

&НаКлиенте
Процедура ОчиститьСкидки(Команда)
	Объект.ВидСкидки = ПредопределенноеЗначение("Справочник.ВидыСкидок.ПустаяСсылка");
	ВидСкидкиПриИзмененииНаСервере();
	ОбновитьОтображениеЭлементовФормы();
	РассчитатьИтоговыеПоказателиКлиент();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьПрофиль(Команда)
	МассивДляДобавленияПрофиля = ПодготовитьМассивДляДобавленияПрофиля();
	Если МассивДляДобавленияПрофиля.Количество() = 0 Тогда
		Сообщить("Для возможности автоматического добавления профиля, предварительно необходимо добавить потолки с заполненным периметром помещения в товары");
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МассивДляДобавленияПрофиля", МассивДляДобавленияПрофиля);
		
		ОткрытьФорму("ОбщаяФорма.ФормаДобавленияПрофиля", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьМассивДляДобавленияПрофиля()
	
	РезультатТЗ = Новый ТаблицаЗначений;
	РезультатТЗ.Колонки.Добавить("Комната");
	РезультатТЗ.Колонки.Добавить("Количество"); 
	Для каждого СтрокаТЧ из Объект.ТоварыУслуги Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаТЧ.Номенклатура) Тогда
			Если НЕ СтрокаТЧ.Номенклатура.Потолок_ПериметрПомещения = 0 Тогда
				НоваяСтрока = РезультатТЗ.Добавить();
				НоваяСтрока.Комната = СтрокаТЧ.Комната;
				НоваяСтрока.Количество = СтрокаТЧ.Номенклатура.Потолок_ПериметрПомещения;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	РезультатТЗ.Свернуть("Комната", "Количество");	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатТЗ);
	
КонецФункции

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	ЗаполнитьСтавкуНДСВДеревеТоваров(Объект.СтавкаНДС, Истина);
	РассчитатьИтоговыеПоказателиКлиент();
	
	//ПерезаполнитьСтавкуНДСВТабличнойЧастиДокумента();	
	//ТекущаяКомната = Неопределено;
	//ТекущаяНоменклатура = Неопределено;
	//Если НЕ Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено Тогда
	//	Если ТекущаяКомната = Неопределено Тогда
	//		ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
	//	КонецЕсли;
	//	Если ТекущаяНоменклатура = Неопределено Тогда
	//		ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
	//	КонецЕсли;
	//КонецЕсли;	
	//ПерестроитьДеревоНаФорме();
	//ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();	
	//ОбновитьОтображениеЭлементовФормы(); 	
	//РазвернутьДеревоТоваров(ТекущаяКомната, ТекущаяНоменклатура);
	
КонецПроцедуры

//&НаКлиенте
//Процедура РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти)
//	СтрокаТабличнойЧасти.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма,
//	                                                   УчитыватьНДС, ,
//	                                                   УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));	
//	ПеренестиДеревоВТабличнуюЧасть();												   
//	Если УчитыватьНДС Тогда
//		Элементы.ИтогиВсегоНДС.Заголовок = Объект.ТоварыУслуги.Итог("СуммаНДС");
//	КонецЕсли;												   
//КонецПроцедуры
												   
//&НаСервере
//Процедура РассчитатьСуммуНДСТабЧастиНаСервере(СтрокаТабличнойЧасти)
//	СтрокаТабличнойЧасти.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма,
//	                                                   УчитыватьНДС, ,
//	                                                   УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));	
//КонецПроцедуры

												   
//&НаСервере
//Функция ПолучитьКоличествоВыработка(Количество)
//	
//	ПорядокОкругления = Константы.ПорядокОкругленияКоличестваВМонтажахДляВыработки.Получить();
//	ОкруглятьВБольшуюСторону = Константы.ОкруглятьВсегдаВБольшуюСторонуКоличествоВМонтажахДляВыработки.Получить();
//	
//	Если НЕ ПорядокОкругления.Пустая() Тогда
//		Возврат ОбщийМодуль.ОкруглитьЧисло(Количество,ПорядокОкругления,ОкруглятьВБольшуюСторону);
//	Иначе
//		Возврат Количество;
//	КонецЕсли;
//	
//КонецФункции

&НаСервере
Функция ПолучитьНоменклатуруПотолкаДереваПоНомеруПотолка(НомерПотолка)
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого ВерхняяСтрока Из Дерево.Строки Цикл
		Если СокрЛП(ВерхняяСтрока.Номенклатура.Потолок_НомерРасчета) = СокрЛП(НомерПотолка) Тогда
			Возврат ВерхняяСтрока.Номенклатура;
		КонецЕсли;
		Для Каждого НижняяСтрока Из ВерхняяСтрока.Строки Цикл
			Если СокрЛП(НижняяСтрока.Номенклатура.Потолок_НомерРасчета) = СокрЛП(НомерПотолка) Тогда
				Возврат НижняяСтрока.Номенклатура;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ПолучитьВсеПодчиненныеДокументыПоПотолкам()
	
	ПодчиненныеДокументыПоПотолку.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;	
	КонецЕсли;
	
	МассивПотолков = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Объект.ТоварыУслуги Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			Если МассивПотолков.Найти(ТекущаяСтрока.Номенклатура) = Неопределено Тогда
				МассивПотолков.Добавить(ТекущаяСтрока.Номенклатура); 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтрокиКомнат = ДеревоТоваров.ПолучитьЭлементы();
	Для Каждого СтрокаКомнаты Из СтрокиКомнат Цикл
		СтрокиТоваров = СтрокаКомнаты.ПолучитьЭлементы();
		Для Каждого СтрокаТовара Из СтрокиТоваров Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаТовара.Номенклатура) Тогда
				Если МассивПотолков.Найти(СтрокаТовара.Номенклатура) = Неопределено Тогда
					МассивПотолков.Добавить(СтрокаТовара.Номенклатура); 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если МассивПотолков.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	// #16790 убираем запрос в модуль с привилегированным получением данных
	// в результате в ПодчиненныеДокументыПоПотолку могут быть "Объект не найден ..."
	ОбщийМодульСервер.ЗаполнитьПодчиненныеДокументыПоПотолкам(Объект.Ссылка, МассивПотолков, ПодчиненныеДокументыПоПотолку);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаказПоставщикуТовары.Ссылка КАК Документ,
	//|	ЗаказПоставщикуТовары.Номенклатура КАК Потолок
	//|ИЗ
	//|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	//|ГДЕ
	//|	ЗаказПоставщикуТовары.Номенклатура В(&Номенклатура)
	//|	И ЗаказПоставщикуТовары.Ссылка.Проведен
	//|	И ЗаказПоставщикуТовары.Ссылка.Основание = &Основание
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПоступлениеТоваровИУслуг.Ссылка,
	//|	ПоступлениеТоваровИУслуг.Номенклатура
	//|ИЗ
	//|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровИУслуг
	//|ГДЕ
	//|	ПоступлениеТоваровИУслуг.Номенклатура В(&Номенклатура)
	//|	И ПоступлениеТоваровИУслуг.Ссылка.Проведен
	//|	И ПоступлениеТоваровИУслуг.Ссылка.Основание = &Основание";
	////|
	////|ОБЪЕДИНИТЬ ВСЕ
	////|
	////|ВЫБРАТЬ
	////|	ЗаказНаПроизводство.Ссылка КАК Документ,
	////|	ЗаказНаПроизводство.ПродукцияНоменклатура
	////|ИЗ
	////|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	////|ГДЕ
	////|	ЗаказНаПроизводство.Проведен
	////|	И ЗаказНаПроизводство.ПродукцияНоменклатура В(&Номенклатура)";
	//Запрос.УстановитьПараметр("Номенклатура", СписокПотолков);
	//Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	НоваяСтрока = ПодчиненныеДокументыПоПотолку.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДанныеЗамераНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТолькоПросмотр",               ТолькоПросмотр);
	//++ №11768 комментируем, т.к. информация будет в отдельной форме
	//ПараметрыФормы.Вставить("ИмяКлиентаЛида",               ИмяКлиентаЛида);
	//ПараметрыФормы.Вставить("АдресКлиентаЛида",           	АдресКлиентаЛида);
	//ПараметрыФормы.Вставить("СуммаДоговораНаЗамере",        СуммаДоговораНаЗамере);
	//-- №11768 комментируем, т.к. информация будет в отдельной форме
	ПараметрыФормы.Вставить("ПредполагаемыйМонтажДатаМонтажаНеОпределена", Объект.ПредполагаемыйМонтажДатаМонтажаНеОпределена);
	ПараметрыФормы.Вставить("ПредполагаемыйМонтажДата",     Объект.ОжидаемаяДатаОтгрузки);
	ПараметрыФормы.Вставить("ПредполагаемыйМонтажВремя",    Объект.ОжидаемоеВремяОтгрузки);
	
	//++ №11768
	ПараметрыФормы.Вставить("ИдентификаторЗамера", Объект.ИдентификаторЗамера);
	ПараметрыФормы.Вставить("Лид", Объект.Основание);
	ПараметрыФормы.Вставить("ЗамерщикВДоговоре", Объект.ИсполнительЗамера);
	//-- №11768
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("НадписьДанныеЗамераНажатиеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.ЗаказДоговор.Форма.ФормаДанныеЗамера", 
		ПараметрыФормы,
		ЭтаФорма,,,,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
&НаКлиенте
Процедура НадписьДанныеЗамераНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Модифицированность = Истина;
		
		Объект.ОжидаемаяДатаОтгрузки  = Результат.ПредполагаемыйМонтажДата;
		Объект.ОжидаемоеВремяОтгрузки = Результат.ПредполагаемыйМонтажВремя;
		Объект.ПредполагаемыйМонтажДатаМонтажаНеОпределена = Результат.ПредполагаемыйМонтажДатаМонтажаНеОпределена;
		
		//++ №11768
		Объект.ИдентификаторЗамера = Результат.ИдентификаторЗамера;
		
		Если ЗначениеЗаполнено(Результат.Замерщик) Тогда
			Объект.ИсполнительЗамера = Результат.Замерщик;
		КонецЕсли;
		
		ОбновитьИнформациюПоЗамеруЛида();
		//-- №11768
		
		СформироватьНадписьПредварительныеДанныеЗамера();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаСервере
Процедура Был_ЗаполнитьПустыеУИСДерева(ДеревоНоменклатуры)
	Если Объект.ЗаполнятьУИСтрок Тогда
		ЭлементыДерева = ДеревоНоменклатуры.ПолучитьЭлементы();
		Для Каждого ТекЭлемент из ЭлементыДерева Цикл
			ПодчиненныеСтроки = ТекЭлемент.ПолучитьЭлементы();
			Для Каждого ПодчиненыйЭлемент Из ПодчиненныеСтроки Цикл			
				Если НЕ ПодчиненыйЭлемент.Номенклатура.Пустая() И ПустаяСтрока(ПодчиненыйЭлемент.УИСтроки) Тогда
					//по какой-то причине УИ пустой - заполним
					ПодчиненыйЭлемент.УИСтроки = Новый УникальныйИдентификатор;
				КонецЕсли;			
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеУИСДерева(ДеревоНоменклатуры)
	Если Объект.ЗаполнятьУИСтрок Тогда
		
		Для Каждого Строка из ДеревоНоменклатуры.Строки Цикл
			Для Каждого СтрНоменклатура из Строка.Строки Цикл
				Если НЕ СтрНоменклатура.Номенклатура.Пустая() И ПустаяСтрока(СтрНоменклатура.УИСтроки) Тогда				
					//по какой-то причине УИ пустой - заполним
					СтрНоменклатура.УИСтроки = Новый УникальныйИдентификатор;
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиДокументВВерсию20(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Предварительно следует записать документ");
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = ПроверитьЧтоЗаказДоговорМожноПеревестиВВерсию20();
	Если НЕ РезультатПроверки.МожноПереводитьВ20 Тогда
		ПоказатьПредупреждение(,"Данный документ нельзя перевести в версию 2.0:" + Символы.ПС + РезультатПроверки.Причина);
	Иначе
		РезультатОбработки = ПеревестиЗаказДоговорВВерсию20();
		Если РезультатОбработки.Успешно Тогда
			ПоказатьПредупреждение(,"Успешно выполнен перевод документа в версию 2.0");
			Прочитать();
			ОбновитьОтображениеЭлементовФормы();
		Иначе
			ПоказатьПредупреждение(,"Ошибка перевода в версию 2.0: " + Символы.ПС + РезультатОбработки.ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЧтоЗаказДоговорМожноПеревестиВВерсию20()
	//проверим что ЗД можно переводить в версию 2.0
	Возврат ОбработкаОбновлений.ЗаказДоговорМожноПеревестиВВерсию20(Объект.Ссылка);
КонецФункции

&НаСервере
Функция ПеревестиЗаказДоговорВВерсию20()
	Возврат ОбработкаОбновлений.ПеревестиЗаказДоговорВВерсию20(Объект.Ссылка);
КонецФункции

&НаКлиенте
Процедура СформироватьОтчетСравненияЗаказДоговораСМонтажами(Команда)
	ПараметрыОтчета  = Новый Структура;
	ПараметрыОтчета.Вставить("ЗаказДоговор", Объект.Ссылка);
	ОткрытьФорму("Отчет.СравнениеЗаказДоговораСМонтажами.ФормаОбъекта", ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЗаказаноПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровБесплатноПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		// комната
		СтрокиТоваров = ТекущиеДанные.ПолучитьЭлементы();
		Для каждого СтрокаТовара из СтрокиТоваров Цикл
			СтрокаТовара.Бесплатно = ТекущиеДанные.Бесплатно;
			Если ТекущиеДанные.Бесплатно Тогда
				СтрокаТовара.Цена = 0;
				СтрокаТовара.ПроцентСкидки = 0;
				СтрокаТовара.СуммаСкидки = 0;
				СтрокаТовара.Сумма = 0;
				СтрокаТовара.СуммаНДС = 0;
			Иначе                            
				СтрокаТовара.Цена = ПолучитьЦенуНоменклатуры(СтрокаТовара.Номенклатура, СтрокаТовара.ХарактеристикаНоменклатуры, СтрокаТовара.ЕдиницаИзмерения);
				СтрокаТовара.ПроцентСкидки = ПолучитьПроцентВидаСкидки(Объект.ВидСкидки) + ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Объект.Дата, СтрокаТовара.Номенклатура, СтрокаТовара.Количество);
				РассчитатьСуммуСтроки(СтрокаТовара);
			КонецЕсли;	
		КонецЦикла;
	Иначе
		// номенклатура
		Если ТекущиеДанные.Бесплатно Тогда
			ТекущиеДанные.Цена = 0;
			ТекущиеДанные.ПроцентСкидки = 0;
			ТекущиеДанные.СуммаСкидки = 0;
			ТекущиеДанные.Сумма = 0;
			ТекущиеДанные.СуммаНДС = 0;
		Иначе                            
			ТекущиеДанные.Цена = ПолучитьЦенуНоменклатуры(ТекущиеДанные.Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, ТекущиеДанные.ЕдиницаИзмерения);
			ТекущиеДанные.ПроцентСкидки = ПолучитьПроцентВидаСкидки(Объект.ВидСкидки) + ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Объект.Дата, ТекущиеДанные.Номенклатура, ТекущиеДанные.Количество);
			РассчитатьСуммуСтроки(ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьМатериалыПоТекущейПозиции(Номенклатура, УИСтроки)
	
	Есть = Ложь;
	
	Для Каждого	ТекущаяСтрока Из Объект.Материалы Цикл
		Если ТекущаяСтрока.НоменклатураТоваров = Номенклатура И ТекущаяСтрока.УИСтроки = УИСтроки Тогда
			Есть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;		
		
	Возврат Есть;	
	
КонецФункции

// ПерезаполнитьМатериалыПоСпецификации
// Параметры
// ТекущаяСтрока - добавляемая или изменяемая строка. В случае подбора позиция текущей комнаты
// МассивНоменклатур - в случае подбора добавляемые позиции
// ОписаниеДействия - одно из значений "ДобавлениеНоменклатуры", "ИзменениеКоличества", "ИзменениеСпецификации"
&НаКлиенте
Процедура ПерезаполнитьМатериалыПоСпецификации(ТекущаяСтрока, МассивНоменклатур = Неопределено, ОписаниеДействия)
	
	Если НЕ СтруктураДействийПоСпецификациям.АвтоматическиЗаполнятьМатериалы Тогда
		Возврат;
	КонецЕсли;
	
	Позиция = Новый Структура;
	// 2 параметра нужны всегда для разворота дерева после обновления
	Позиция.Вставить("Комната", 		 ТекущаяСтрока.Комната);
	Позиция.Вставить("Номенклатура", 	 ТекущаяСтрока.Номенклатура);
	Если МассивНоменклатур = Неопределено Тогда
		Позиция.Вставить("УИСтроки", 		 ТекущаяСтрока.УИСтроки);
		Позиция.Вставить("Количество", 	  	 ТекущаяСтрока.Количество);
		Позиция.Вставить("Коэффициент", 	 ТекущаяСтрока.Коэффициент);
		Позиция.Вставить("ЕдиницаИзмерения", ТекущаяСтрока.ЕдиницаИзмерения);
		Позиция.Вставить("Спецификация", 	 ТекущаяСтрока.Спецификация);
	КонецЕсли;
	
	Парам = новый Структура;
	Парам.Вставить("ТекущаяСтрока", 	Позиция);
	Парам.Вставить("МассивНоменклатур", МассивНоменклатур);
	
	Если (ОписаниеДействия = "ДобавлениеНоменклатуры" И СтруктураДействийПоСпецификациям.ПодтверждениеПриДобавленииНоменклатуры) 
		 ИЛИ (ОписаниеДействия = "ИзменениеКоличества" И СтруктураДействийПоСпецификациям.ПодтверждениеПриИзмененииКоличества)
		 ИЛИ (ОписаниеДействия = "ИзменениеСпецификации" И СтруктураДействийПоСпецификациям.ПодтверждениеПриИзмененииСпецификации)
		Тогда
			
		ПослеВопросаОПерезаполненииМатериаловПоСпецификаци = Новый ОписаниеОповещения("ОбработкаОтветаНаВопросПерезаполненииМатериаловПоСпецификации", ЭтотОбъект, Парам);
		ПоказатьВопрос(ПослеВопросаОПерезаполненииМатериаловПоСпецификаци, "Перезаполнить материалы по спецификации текущей позиции?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ПерезаполнитьМатериалыПоСпецификацииНаСервере(Парам);
		РазвернутьДеревоТоваров(ТекущаяСтрока.Комната, ТекущаяСтрока.Номенклатура);
		РазвернутьДеревоМатериалов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаВопросПерезаполненииМатериаловПоСпецификации(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПерезаполнитьМатериалыПоСпецификацииНаСервере(ДопПараметры);
		РазвернутьДеревоТоваров(ДопПараметры.ТекущаяСтрока.Комната, ДопПараметры.ТекущаяСтрока.Номенклатура);
		РазвернутьДеревоМатериалов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьМатериалыПоСпецификацииНаСервере(ДопПараметры)
	
	ПеренестиДеревоВТабличнуюЧасть(Ложь,Истина);
	
	Если ДопПараметры.МассивНоменклатур = Неопределено Тогда
		// при добавлении одной позиции, изменении количества/спецификации
		//Сначало удалим
		УдалитьМатериалыОтносящиесяКПозицииНаСервере(ДопПараметры.ТекущаяСтрока.Номенклатура, ДопПараметры.ТекущаяСтрока.УИСтроки);
		
		МассивПозиций = Новый Массив;	
		МассивПозиций.Добавить(ДопПараметры.ТекущаяСтрока);		
	Иначе
		// при подборе
		МассивПозиций = ДопПараметры.МассивНоменклатур;
	КонецЕсли;	
	
	//Теперь заполним		
	ЗаполнитьМатериалыПоСпецификацииНаСервере(МассивПозиций, Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОбУдаленииМатериаловПоСпецификации(Номенклатура, УИСтроки)
	
	Если НЕ СтруктураДействийПоСпецификациям.АвтоматическиЗаполнятьМатериалы Тогда
		Возврат;
	КонецЕсли;
	
	Парам = Новый Структура;
	Парам.Вставить("Номенклатура", 	Номенклатура);
	Парам.Вставить("УИСтроки", 		УИСтроки);
	
	Если СтруктураДействийПоСпецификациям.ПодтверждениеПриУдалении Тогда			
		ПослеВопросаОбУдаленииМатериаловПоСпецификации = Новый ОписаниеОповещения("ОбработкаОтветаНаВопросУдаленияМатериаловПоСпецификации", ЭтотОбъект, Парам);
		ПоказатьВопрос(ПослеВопросаОбУдаленииМатериаловПоСпецификации, "Удалить материалы по спецификации позиции """ + Строка(Номенклатура) + """?", РежимДиалогаВопрос.ДаНет);
	Иначе
		УдалитьМатериалыОтносящиесяКПозицииНаСервере(Номенклатура, УИСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаВопросУдаленияМатериаловПоСпецификации(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УдалитьМатериалыОтносящиесяКПозицииНаСервере(ДопПараметры.Номенклатура, ДопПараметры.УИСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМатериалыОтносящиесяКПозицииНаСервере(Номенклатура, УИСтроки)
	
	КоличествоЗаписей = Объект.Материалы.Количество();
	Для Сч = 1 По КоличествоЗаписей Цикл
		
		Если Объект.Материалы.Получить(КоличествоЗаписей-Сч).НоменклатураТоваров = Номенклатура
			И Объект.Материалы.Получить(КоличествоЗаписей-Сч).УИСтроки = УИСтроки Тогда
			Объект.Материалы.Удалить(КоличествоЗаписей-Сч);
		КонецЕсли;
		
	КонецЦикла;
	ПерестроитьДеревоМатериалыНаФорме();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПозицийДляПерезаполненияМатериаловПоСпецификации()
	
	СписокПозиций = Новый Массив;
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	
	Для Каждого ТекущаяСтрокаКомнаты Из Дерево.Строки Цикл
		Для Каждого ТекущаяСтрока Из ТекущаяСтрокаКомнаты.Строки Цикл			
			Если НЕ ТекущаяСтрока.Спецификация.Пустая() Тогда
				СписокПозиций.Добавить(новый Структура("Комната, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество, Коэффициент, Спецификация, УИСтроки",
					ТекущаяСтрока.Комната, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения,
					ТекущаяСтрока.Количество, ТекущаяСтрока.Коэффициент, ТекущаяСтрока. Спецификация, ТекущаяСтрока.УИСтроки));				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
	Возврат СписокПозиций;
	
КонецФункции

&НаКлиенте
Процедура СкопироватьФайлыИзЛида(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОП = новый ОписаниеОповещения("ПослеВыборкаФайловЛида", ЭтотОбъект);
		
		ОткрытьФорму("РегистрСведений.ПрикрепленныеДанные.Форма.ФормаВыбораФайлов", Новый Структура("СсылкаНаДокумент", Объект.Основание)
					,ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор,,, ОП);
	Иначе
		ПоказатьПредупреждение(, "Предварительно документ необходимо записать");
	КонецЕсли;	
	
КонецПроцедуры
			
&НаКлиенте
Процедура ПослеВыборкаФайловЛида(ВозвращенноеЗначение, ДопПараметры) Экспорт
	
	Если ВозвращенноеЗначение <> Неопределено И ТипЗнч(ВозвращенноеЗначение) = Тип("Массив") Тогда
		ПрисоединитьФайлыИзЛидаНаСервере(ВозвращенноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединитьФайлыИзЛидаНаСервере(СписокФайлов)
	
	Успешно = Истина;
	
	Для Каждого ТекущаяСтрока Из СписокФайлов Цикл
		Если НЕ ОбщийМодульВызовСервера.СкопироватьЭкземплярПрикрепленныхДанных(ТекущаяСтрока.СсылкаНаОбъект, Объект.Ссылка, ТекущаяСтрока.ИмяФайла, ТекущаяСтрока.Расширение, ТекущаяСтрока.ДатаПрикрепления) Тогда
			Успешно = Ложь;		
		КонецЕсли;
	КонецЦикла;
	
	Если Успешно Тогда
		Сообщить("Файлы успешно прикреплены");
		ОбновитьОтображениеЭлементовФормы();
	Иначе
		Сообщить("Не удалось прикрепить файл(ы)!", СтатусСообщения.Важное);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьПоМонтажу(Команда)
	
	СписокМонтажей = ПолучитьСписокМонтажей();

	Если НЕ СписокМонтажей.Количество() = 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборМонтажаДляВыделенияСтрок", ЭтотОбъект);
		//СП: В качестве этого параметра нельзя указывать кнопки, расположенные в командной панели или подменю. 
		//ПоказатьВыборИзМеню(ОписаниеОповещения, СписокМонтажей, Элементы.ДеревоТоваровВыделитьПоМонтажу);
		// поэтому используем форму
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("ДоступныеЗначения", СписокМонтажей);
		ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", ПараметрыФормыВыбора, ЭтаФорма, , , , ОписаниеОповещения);	
		//ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", , ЭтаФорма, , , , ОписаниеОповещения);
	Иначе
		ПоказатьПредупреждение(,"Отсутствуют монтажи по договору");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокМонтажей()
	
	СписокМонтажей = Новый СписокЗначений;
	ВремДеревоТоваров = РеквизитФормыВЗначение("ДеревоТоваров");
	Для Каждого СтрокаКомнат Из ВремДеревоТоваров.Строки Цикл
		Для Каждого СтрокаНоменклатура Из СтрокаКомнат.Строки Цикл
			Если ЗначениеЗаполнено(СтрокаНоменклатура.Монтаж) Тогда
				Если СписокМонтажей.НайтиПоЗначению(СтрокаНоменклатура.Монтаж) = Неопределено Тогда
				ПредставлениеМонтажа = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаНоменклатура.Монтаж.Номер) + " от " + Формат(СтрокаНоменклатура.Монтаж.Дата, "ДЛФ=Д");
				СписокМонтажей.Добавить(СтрокаНоменклатура.Монтаж, ПредставлениеМонтажа);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокМонтажей;
	
КонецФункции

&НаКлиенте
Процедура ВыборМонтажаДляВыделенияСтрок(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйМонтаж = Результат;	
	Элементы.ДеревоТоваров.ВыделенныеСтроки.Очистить();
	
	КоллекцияЭлементовДерева = ЭтаФорма.ДеревоТоваров.ПолучитьЭлементы();
	Для Каждого СтрокаКомната Из КоллекцияЭлементовДерева Цикл    
		Для Каждого СтрокаНоменклатура Из СтрокаКомната.ПолучитьЭлементы() Цикл
			Если СтрокаНоменклатура.Монтаж = ВыбранныйМонтаж Тогда
				Элементы.ДеревоТоваров.ВыделенныеСтроки.Добавить(СтрокаНоменклатура.ПолучитьИдентификатор());
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Параметр)
	
	//Сперва проверим что комната введена
	Если Элементы.ГруппаТабличныеЧасти.ТекущаяСтраница.Имя = "ГруппаМатериалы" Тогда
		//В материалах
		Если Элементы.ДеревоМатериалов.ТекущиеДанные = Неопределено ИЛИ  ПустаяСтрока(Элементы.ДеревоМатериалов.ТекущиеДанные.Комната) Тогда		
			ПоказатьОповещениеПользователя("Выберите комнату");		
			Возврат;		
		КонецЕсли;
		ТекущаяКомната = Элементы.ДеревоМатериалов.ТекущиеДанные.Комната;
	Иначе
		//В товарах
		Если Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено ИЛИ  ПустаяСтрока(Элементы.ДеревоТоваров.ТекущиеДанные.Комната) Тогда		
			ПоказатьОповещениеПользователя("Выберите комнату");		
			Возврат;		
		КонецЕсли;
		ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
	КонецЕсли;	
	
	СтруктураТовара = ОбщийМодульКлиент.ПолучитьНоменклатуруПоШтрихКоду(МенеджерОборудованияКлиентПереопределяемый.ПреобразоватьДанныеСоСканераВМассив(Параметр));
	СтруктураТовара.Вставить("Комната", ТекущаяКомната);
	
	Если НЕ СтруктураТовара.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда
		
		Если Элементы.ГруппаТабличныеЧасти.ТекущаяСтраница.Имя = "ГруппаМатериалы" Тогда
			
			//Добавление в материалы
			ДобавитьПозициюВМатериалыПоШтрихКоду(СтруктураТовара);			
						
		Иначе
			
			//Добавление в товары			
			ДобавитьПозициюВТоварыПоШтрихКоду(СтруктураТовара);
						
		КонецЕсли;		
		
		Модифицированность = Истина;
	Иначе
		Сообщить("Не удалось найти номенклатуру со штрих-кодом " + СтруктураТовара.ШтрихКод);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПозициюВТоварыПоШтрихКоду(СтруктураТовара) 
	
	ДобавитьПозициюВТоварыПоШтрихКодуНаСервере(СтруктураТовара);
	ПеренестиДеревоВТабличнуюЧасть();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	РазвернутьДеревоТоваров();
	РассчитатьИтоговыеПоказателиКлиент();
	ДобавленнаяСтрока = НайтиСтрокуДерева(ДеревоТоваров, СтруктураТовара.Комната, СтруктураТовара.Номенклатура, СтруктураТовара.ХарактеристикаНоменклатуры, СтруктураТовара.ЕдиницаИзмерения);
	Если НЕ ДобавленнаяСтрока = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущаяСтрока = ДобавленнаяСтрока.ПолучитьИдентификатор();			
		ОбновитьОтображениеЭлементовФормы(Элементы.ДеревоТоваров.ТекущиеДанные.Комната, Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура);	
		Если Объект.ЗаполнятьУИСтрок И НЕ ДобавленнаяСтрока.Спецификация.Пустая() И ЗаполнениеМатериаловПоЗаказам Тогда
			ПерезаполнитьМатериалыПоСпецификации(ДобавленнаяСтрока, , "ДобавлениеНоменклатуры");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПозициюВТоварыПоШтрихКодуНаСервере(СтруктураТовара)
	
	ЭтоНоваяСтрока = Истина;
	ТекущаяКомната = Неопределено;
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Если Строка.Комната = СтруктураТовара.Комната Тогда
			//Запомним текущую строку с комнатой
			ТекущаяКомната = Строка;
			//Попробуем найти позицию в дереве, если уже есть, обновим её иначе добавим новую строку
			Для Каждого ТекущаяСтрока Из Строка.Строки Цикл
				Если ТекущаяСтрока.Номенклатура = СтруктураТовара.Номенклатура 
					И ТекущаяСтрока.ЕдиницаИзмерения = СтруктураТовара.ЕдиницаИзмерения
					И ТекущаяСтрока.ХарактеристикаНоменклатуры = СтруктураТовара.ХарактеристикаНоменклатуры
				Тогда
					ЭтоНоваяСтрока = Ложь;
					ТекущаяСтрока.Количество = ТекущаяСтрока.Количество + 1;					
					РассчитатьСуммуСтрокиНаСервере(ТекущаяСтрока);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли
	КонецЦикла;
	
	Если ТекущаяКомната <> Неопределено И ЭтоНоваяСтрока Тогда
		Стр = ТекущаяКомната.Строки.Добавить();		
		ЗаполнитьЗначенияСвойств(Стр, СтруктураТовара);
		
		СтруктураДанные = Новый Структура("Номенклатура, ВидСпецификации", Стр.Номенклатура, ВидСпецификацииПоУмолчанию);
		СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
		ЗаполнитьЗначенияСвойств(Стр, СтруктураДанные, "ВидНоменклатуры, Спецификация, УчитыватьКакПотолок");
	
		//Стр.ВидНоменклатуры = Стр.Номенклатура.ВидНоменклатуры;
		Стр.Количество = 1;
		Если ТипЗнч(Стр.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			Стр.Коэффициент = 1;
		Иначе
			Стр.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(Стр.ЕдиницаИзмерения);
		КонецЕсли;
		//Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(Стр.Номенклатура) Тогда // #12667 спецификация только для услуг
		Стр.Спецификация = ?(ЗаполнениеМатериаловПоЗаказам, СтруктураДанные.Спецификация, ПредопределенноеЗначение("Справочник.Спецификации.ПустаяСсылка"));
		//КонецЕсли;
		Стр.Цена = ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Стр.ХарактеристикаНоменклатуры, Стр.ЕдиницаИзмерения);
		Стр.ПроцентСкидки = ПолучитьПроцентВидаСкидки(Объект.ВидСкидки) + ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Объект.Дата, Стр.Номенклатура, Стр.Количество);
		Стр.ЦенаПоПрайсу = Стр.Цена;
		//Стр.КоличествоВыработка = ПолучитьКоличествоВыработка(Стр.Количество);
		Стр.УИСтроки = Новый УникальныйИдентификатор;	
		РассчитатьСуммуСтрокиНаСервере(Стр);
	КонецЕсли;
		
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПозициюВМатериалыПоШтрихКоду(СтруктураТовара) 
	
	ДобавитьПозициюВМатериалыПоШтрихКодуНаСервере(СтруктураТовара);
	ПеренестиДеревоВТабличнуюЧасть();
	РазвернутьДеревоМатериалов();
	ДобавленнаяСтрока = НайтиСтрокуДереваМатериалов(СтруктураТовара.Комната, СтруктураТовара.Номенклатура, СтруктураТовара.ХарактеристикаНоменклатуры, СтруктураТовара.ЕдиницаИзмерения);
	Если НЕ ДобавленнаяСтрока = Неопределено Тогда
		Элементы.ДеревоМатериалов.ТекущаяСтрока = ДобавленнаяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПозициюВМатериалыПоШтрихКодуНаСервере(СтруктураТовара)
	
	ЭтоНоваяСтрока = Истина;
	ТекущаяКомната = Неопределено;
	
	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Если Строка.Комната = СтруктураТовара.Комната Тогда
			//Запомним текущую строку с комнатой
			ТекущаяКомната = Строка;
			//Попробуем найти позицию в дереве, если уже есть, обновим её иначе добавим новую строку
			Для Каждого ТекущаяСтрока Из Строка.Строки Цикл
				Если ТекущаяСтрока.Номенклатура = СтруктураТовара.Номенклатура 
					И ТекущаяСтрока.ЕдиницаИзмерения = СтруктураТовара.ЕдиницаИзмерения
					И ТекущаяСтрока.ХарактеристикаНоменклатуры = СтруктураТовара.ХарактеристикаНоменклатуры
				Тогда
					ЭтоНоваяСтрока = Ложь;
					ТекущаяСтрока.Количество = ТекущаяСтрока.Количество + 1;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли
	КонецЦикла;	
	
	Если ТекущаяКомната <> Неопределено И ЭтоНоваяСтрока Тогда
		Стр = ТекущаяКомната.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, СтруктураТовара);
		Стр.Количество = 1;
		Если ТипЗнч(Стр.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			Стр.Коэффициент = 1;
		Иначе
			Стр.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(Стр.ЕдиницаИзмерения);
		КонецЕсли;
		Стр.УИСтроки = Новый УникальныйИдентификатор;		
	КонецЕсли;	
	
	ЗначениеВДанныеФормы(Дерево, ДеревоМатериалов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаРассторженияДоговораПриИзменении(Элемент)
	ОбновитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатуры(ПозицияНоменклатуры)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ЭтоПотолок", Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ПозицияНоменклатуры));
	СтруктураОтвета.Вставить("ЭтоУникальныйПотолок", Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ПозицияНоменклатуры));
	СтруктураОтвета.Вставить("Потолок_КоличествоПродукция", ПозицияНоменклатуры.Потолок_КоличествоПродукция);
	Возврат СтруктураОтвета;
	
КонецФункции

&НаКлиенте
Процедура РасторжениеСписатьТоварыПриИзменении(Элемент)
	ОбновитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура РасторжениеСписатьМатериалыПриИзменении(Элемент)
	ОбновитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура РасторжениеБезВозвратаДенегКлиентуПриИзменении(Элемент)
	ОбновитьОтображениеЭлементовФормы();
КонецПроцедуры

//&НаКлиенте
//Процедура ВвестиОплатуКредитом(Команда)
//	ОткрытьФорму("Документ.ОплатаБанковскойКартой.Форма.ФормаДокумента", новый Структура("ЗначенияЗаполнения", новый Структура("Основание, ВидОперации", Объект.Ссылка, ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаБанковскойКартой.Кредит"))));
//КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруСтрокиТЧ() 
	
	СтруктураСтроки = Новый Структура;
	Для каждого РеквизитТЧ из Метаданные.Документы.ЗаказДоговор.ТабличныеЧасти.ТоварыУслуги.Реквизиты Цикл
		СтруктураСтроки.Вставить(РеквизитТЧ.Имя);	
	КонецЦикла;
	
	Возврат СтруктураСтроки;
	
КонецФункции

&НаКлиенте
Процедура ДекорацияДоговорРасторгнутНажатие(Элемент)
	
	Если НЕ СоглашениеОРасторженииДоговора.Пустая() Тогда
		ОткрытьФорму("Документ.СоглашениеОРасторженииДоговора.Форма.ФормаДокумента", новый Структура("Ключ", СоглашениеОРасторженииДоговора));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорБезЗамераПриИзменении(Элемент)
	УстановитьОтметкуНезаполненногоИсполнителяЗамера();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкуНезаполненногоИсполнителяЗамера()
	
	ЗаполнениеОбязательно = НЕ Объект.ДоговорБезЗамера;
	Если ЗаполнениеОбязательно 
		И НЕ Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Договор Тогда
		ЗаполнениеОбязательно = Ложь;	
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсполнительЗамера",  "АвтоОтметкаНезаполненного", ЗаполнениеОбязательно);
	Если Не ЗаполнениеОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсполнительЗамера",  "ОтметкаНезаполненного", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкуНезаполненногоАдреса()
	
	ЗаполнениеОбязательно = НЕ Объект.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Продажа;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Адрес", "АвтоОтметкаНезаполненного", ЗаполнениеОбязательно);
	Если Не ЗаполнениеОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Адрес", "ОтметкаНезаполненного", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтоговыеПоказателиКлиент(ФормаТолькоПросмотр = Ложь) Экспорт
	//#7556
		
	ИтогСумма = 0;
	ИтогСуммаБезСкидки = 0;
	ИтогСуммаПоПрайсу = 0;
	ИтогСуммаНДС = 0;
	ИтогСуммаСкидки = 0;
	ИтогКоличествоКомнат = 0;
	
	ИтогКоличествоПотолков = 0; // реквизит формы
	ИтогПлощадьПотолков = 0; // реквизит формы
	
	ЭлементыДерева = ДеревоТоваров.ПолучитьЭлементы();
	ИтогКоличествоКомнат = ЭлементыДерева.Количество();
	
	Для Каждого СтрокаКомнаты из ЭлементыДерева Цикл
		
		СуммаПоКомнате = 0;
		СуммаПоПрайсуКомнате = 0;
		ИтогБесплатноПоКомнате = 0;
		ИтогПлатноПоКомнате = 0;
		
		Для Каждого СтрокаТовара Из СтрокаКомнаты.ПолучитьЭлементы() Цикл
			ИтогСумма = ИтогСумма + СтрокаТовара.Сумма;
			ИтогСуммаБезСкидки = ИтогСуммаБезСкидки + СтрокаТовара.Количество * СтрокаТовара.Цена;
			ИтогСуммаПоПрайсу = ИтогСуммаПоПрайсу + СтрокаТовара.СуммаПоПрайсу;
			ИтогСуммаНДС = ИтогСуммаНДС + СтрокаТовара.СуммаНДС;
			ИтогСуммаСкидки = ИтогСуммаСкидки + СтрокаТовара.СуммаСкидки;			
			Если ЗначениеЗаполнено(СтрокаТовара.Номенклатура) И ОбщийМодульВызовСервера.ЭтоНоменклатураПотолкаРозницы(СтрокаТовара.Номенклатура) Тогда
				ИтогКоличествоПотолков = ИтогКоличествоПотолков + 1; 
				ИтогПлощадьПотолков = ИтогПлощадьПотолков + СтрокаТовара.Количество;	
			КонецЕсли;
			
			СуммаПоКомнате = СуммаПоКомнате + СтрокаТовара.Сумма;
			СуммаПоПрайсуКомнате = СуммаПоПрайсуКомнате + СтрокаТовара.СуммаПоПрайсу;			
			ИтогБесплатноПоКомнате = ИтогБесплатноПоКомнате + ?(СтрокаТовара.Бесплатно, 1, 0);
			ИтогПлатноПоКомнате    = ИтогПлатноПоКомнате    + ?(СтрокаТовара.Бесплатно, 0, 1);
		КонецЦикла;
		
		СтрокаКомнаты.Сумма = СуммаПоКомнате;
		СтрокаКомнаты.СуммаПоПрайсу = СуммаПоПрайсуКомнате;
		СтрокаКомнаты.Бесплатно = (ИтогБесплатноПоКомнате > 0 И ИтогПлатноПоКомнате = 0);
	КонецЦикла;
	ИтогОтклонениеОтПрайса = ИтогСумма - ИтогСуммаПоПрайсу; //как в отчете по эффективностям
	
	Если НЕ ФормаТолькоПросмотр Тогда
		Если Объект.КоличествоКомнат <> ИтогКоличествоКомнат Тогда
			Объект.КоличествоКомнат = ИтогКоличествоКомнат;
			Модифицированность = Истина;
		КонецЕсли;
		
		Если Объект.СуммаДокумента <> ИтогСумма И НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен") Тогда // для расторгнутых сумма документа устанавливается из суммы СОРД (модуль объекта)
			Объект.СуммаДокумента = ИтогСумма;
			Модифицированность = Истина;
		КонецЕсли;
		Если Объект.СуммаДокументаПоПрайсу <> ИтогСуммаПоПрайсу Тогда
			Объект.СуммаДокументаПоПрайсу = ИтогСуммаПоПрайсу;
			Модифицированность = Истина;
		КонецЕсли;
		Если Объект.ОтклонениеОтПрайса <> ИтогОтклонениеОтПрайса Тогда
			Объект.ОтклонениеОтПрайса = ИтогОтклонениеОтПрайса;
			Модифицированность = Истина;
		КонецЕсли;
		Если Объект.СуммаСкидки <> ИтогСуммаСкидки Тогда
			Объект.СуммаСкидки = ИтогСуммаСкидки;
			Объект.ПроцентСкидки = ИтогСуммаСкидки;
			Если ИтогСуммаБезСкидки <> 0 Тогда
				Объект.ПроцентСкидки = Окр(100*ИтогСуммаСкидки / (ИтогСуммаБезСкидки), 2);
			Иначе
				Объект.ПроцентСкидки = 0;
			КонецЕсли;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;

	СуммаНДС = ИтогСуммаНДС;	
	//Если УчитыватьНДС Тогда
	//	Элементы.ИтогиВсегоНДС.Заголовок = Формат(ИтогСуммаНДС, "ЧРГ=; ЧН=0,00");
	//КонецЕсли;
		
КонецПроцедуры

//++ №9868
&НаСервере
Процедура ЗаполнитьСсылкиНаМонтажи()
	
	Монтажи.Очистить();
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументМонтаж.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Монтаж КАК ДокументМонтаж
	|ГДЕ
	|	ДокументМонтаж.Основание = &ЗаказДоговор
	|	И НЕ ДокументМонтаж.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументМонтаж.ДатаМонтажа";
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.Ссылка);
	
	Монтажи.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	// Если монтажей нет, выводим декорацию
	Элементы.ДекорацияМонтажиНеНазначены.Видимость = (Монтажи.Количество() = 0);
	
	// Существующие элементы декорации скроем (если они есть уже)
	Для Каждого ТекущаяСтрока Из Элементы.ГруппаСсылкиНаМонтажи.ПодчиненныеЭлементы Цикл
		
		Если СтрНайти(ТекущаяСтрока.Имя, "ДекорацияСсылкаНаМонтажНомер") > 0 Тогда
			ТекущаяСтрока.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	// Прорисуем элементы формы
	Сч = 0;
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ТекущаяСтрока Из Монтажи Цикл
		
		ИмяЭлемента = "ДекорацияСсылкаНаМонтажНомер_" + Сч;
		
		Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ДекорацияФормы"), Элементы.ГруппаСсылкиНаМонтажи);
		Иначе
			НовыйЭлемент = Элементы[ИмяЭлемента];
		КонецЕсли;
		
		МонтажСсылка = ТекущаяСтрока.Значение;
		
		ДатаЗаголовка = "";
		
		//++ №12721
		МонтажПродажа = (МонтажСсылка.ВидОперации = Справочники.ВидыМонтажа.Продажа);
		
		Если МонтажСсылка.ВидОперации = Справочники.ВидыМонтажа.Продажа Тогда
			ДатаЗаголовка = Формат(МонтажСсылка.Дата, "ДФ=dd.MM.yyyy");
		//-- №12721
		ИначеЕсли МонтажСсылка.СрокМонтажа = Перечисления.СрокиМонтажа.ДатаМонтажаНеОпределена Тогда
			ДатаЗаголовка = "(дата не определена)"; // №11843 было: "(по звонку)";
		Иначе
			ДатаЗаголовка = Формат(МонтажСсылка.ДатаМонтажа, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		НовыйЭлемент.Видимость = Истина;
		НовыйЭлемент.Заголовок = ?(МонтажПродажа, "Продажа от ", "Монтаж на ") + ДатаЗаголовка;
		НовыйЭлемент.Гиперссылка = Истина;
		
		НовыйЭлемент.УстановитьДействие("Нажатие", "ДекорацияСсылкаНаМонтажНажатие");
		
		Сч = Сч + 1;
		
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНаМонтажНажатие(Элемент)
	
	// в названии элемента нужно найти номер в списке монтажей
	Позиция = СтрНайти(Элемент.Имя, "Номер_");
	
	Если Позиция = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		НомерСтроки = Число(Сред(Элемент.Имя, Позиция + 6));
	Исключение
		Возврат;
	КонецПопытки;
	
	Если НомерСтроки <= Монтажи.Количество()-1 Тогда
		
		СсылкаНаМонтаж = Монтажи.Получить(НомерСтроки);
		ОткрытьФорму("Документ.Монтаж.ФормаОбъекта", новый Структура("Ключ", СсылкаНаМонтаж.Значение));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияМонтажиНеНазначеныНажатие(Элемент)
	
	//ЗапланироватьМонтаж(Неопределено);
	ПараметрыНовогоДокумента = Новый Структура("ЗначенияЗаполнения", Новый Структура("Основание, ВидОперации", Объект.Ссылка, ПредопределенноеЗначение("Справочник.ВидыМонтажа.Монтаж")));
	ОткрытьФорму("Документ.Монтаж.ФормаОбъекта", ПараметрыНовогоДокумента);
	
КонецПроцедуры
//-- №9868

&НаКлиенте
Процедура ИзменениеДатыСледующегоКонтактаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьЗаписьВИсториюКлиент(Результат.Комментарий, Результат.ДатаСледующегоКонтакта);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаписьВИсторию(Команда)
	
	СтруктураИстории = Новый Структура;
	СтруктураИстории.Вставить("ИмяРеквизита", "НовыйКомментарий");

	ОбщийМодульКлиент.ДобавитьЗаписьВИсториюДокумента(ЭтаФорма, СтруктураИстории);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаписьВИсториюДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДобавитьЗаписьВИсториюКлиент(Результат.ТекстЗаписиИстории);
	НовыйКомментарий = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаписьВИсториюКлиент(ТекстЗаписиИстории, ДатаСледующегоКонтакта = Неопределено)

	ДобавитьЗаписьВИсториюСервер(ТекстЗаписиИстории, ДатаСледующегоКонтакта, Истина);
	Элементы.ИсторияЗаказа.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьВИсториюСервер(Знач ТекстЗаписиИстории, ДатаСледующегоКонтакта, ИзменениеДатыСледующегоКонтакта = Ложь)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	Объект.ПоследнийКомментарий = ТекстЗаписиИстории;	
	Если ИзменениеДатыСледующегоКонтакта Тогда			
		Объект.ПоследняяДатаКонтакта           = ТекущаяДата;	
		Объект.ПоследняяДатаСледующегоКонтакта = ДатаСледующегоКонтакта;
		Если ЗначениеЗаполнено(ДатаСледующегоКонтакта) Тогда			
			ТекстЗаписиИстории = СтрШаблон("Указана дата следующего контакта: %1. Комментарий: %2", 
											Формат(ДатаСледующегоКонтакта, "ДФ='dd.MM.yyyy HH:mm'"),
											ТекстЗаписиИстории);
		КонецЕсли;
	КонецЕсли;

	РегистрыСведений.ИсторияЗаказа.ДобавитьЗаписьВИсторию(Объект.Ссылка, ТекущаяДата, Пользователи.ТекущийПользователь(), ТекстЗаписиИстории, , ДатаСледующегоКонтакта);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуСледующегоКонтакта(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Заказ должен быть записан!");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ИзменениеДатыСледующегоКонтакта", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеДатыСледующегоКонтактаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Документ.ЗаказДоговор.Форма.ФормаДобавленияЗаписиИстории", , ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДатуСледующегоКонтакта(Команда)
	
	Если ЗначениеЗаполнено(Объект.ПоследняяДатаСледующегоКонтакта) Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ПоказатьПредупреждение(, "Заказ должен быть записан!");
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОчисткаДаты", Истина);
		ПараметрыФормы.Вставить("Комментарий", "Отмена даты следующего контакта: ");
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеДатыСледующегоКонтактаЗавершение", ЭтотОбъект);
		ОткрытьФорму("Документ.ЗаказДоговор.Форма.ФормаДобавленияЗаписиИстории", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
		
	Иначе
		Сообщить("Дата следующего контакта не заполнена");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКратинкуКнопкиГеометкиВШапкеДокумента()
	
	Если ПустаяСтрока(Объект.Геометка) Тогда
		Элементы.УказатьГеометку.Картинка = БиблиотекаКартинок.СераяМеткаКарты;
	Иначе
		Элементы.УказатьГеометку.Картинка = БиблиотекаКартинок.КраснаяМеткаКарты;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьГеометку(Команда)
	
	ОП = Новый ОписаниеОповещения("ПослеЗакрытияОкнаВыбораГеометки", ЭтотОбъект);
	
	Парам = Новый Структура;
	Парам.Вставить("Адрес",Объект.Адрес);
	Парам.Вставить("ИспользоватьКартыЯндекс",ИспользоватьКартыЯндекс);
	Парам.Вставить("Геометка",Объект.Геометка);
	
	ОткрытьФорму("Документ.Лид.Форма.ФормаУстановкиГеометки", Парам, ЭтаФорма,,,,ОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОкнаВыбораГеометки(ПолученнаяГеометка, ДопПараметры) Экспорт
	
	Если НЕ ПолученнаяГеометка = Неопределено Тогда
		Объект.Геометка = ПолученнаяГеометка;
		Модифицированность = Истина;
	КонецЕсли;
	
	ОбновитьКратинкуКнопкиГеометкиВШапкеДокумента();
	
КонецПроцедуры

//++ №11768
&НаСервере
Процедура ОбновитьИнформациюПоЗамеруЛида()
	
	ДатаЗамера 			= Дата(1, 1, 1);
	ВремяНачалаЗамера 	= Дата(1, 1, 1);
	РезультатЗамера 	= Справочники.РезультатЗамераЛида.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторЗамера) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Лид") И ЗначениеЗаполнено(Объект.Основание) Тогда
		
		НайденнаяСтрока = Объект.Основание.Замеры.НайтиСтроки(новый Структура("ИДЗамера", Объект.ИдентификаторЗамера));
		Если НайденнаяСтрока.Количество() > 0 Тогда
			
			ДатаЗамера 			= НайденнаяСтрока[0].ДатаЗамера;
			ВремяНачалаЗамера 	= НайденнаяСтрока[0].ВремяНачалаЗамера;
			РезультатЗамера 	= НайденнаяСтрока[0].РезультатЗамера;
			
		КонецЕсли;
		
		//++ #15107 от 28.11.2022
		Если Параметры.Ключ.Пустая() Тогда
			Объект.ОжидаемаяДатаОтгрузки = Объект.Основание.ПредполагаемыйМонтажДата;
			Объект.ОжидаемоеВремяОтгрузки = Объект.Основание.ПредполагаемыйМонтажВремя;
		КонецЕсли;
		//-- #15107 от 28.11.2022
		
	КонецЕсли;
	
	Элементы.ИсполнительЗамера.ТолькоПросмотр = (ЗначениеЗаполнено(Объект.ИдентификаторЗамера));
	
КонецПроцедуры
//-- №11768

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

//++16450
&НаКлиенте
Процедура ЗаполнитьПоПредварительномуРасчету(Команда)
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Лид") Тогда
		ОповещениеПослеВыбораПР = Новый ОписаниеОповещения("ПослеВыбораПредварительногоРасчета", ЭтаФорма);
		ПараметрыФормыВПР = Новый Структура("Лид", Объект.Основание);
		ОткрытьФорму("Документ.ЗаказДоговор.Форма.ФормаВыбораПредварительногоРасчета", ПараметрыФормыВПР, ЭтаФорма, , , , ОповещениеПослеВыбораПР);
	Иначе
		Сообщить("Документ " + Объект.Ссылка + " не имеет связанного документа ""Лид""");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПредварительногоРасчета(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьДокументПоПредварительномуРасчету(Результат.ПредварительныйРасчет);
	РазвернутьДеревоТоваров();
	РазвернутьДеревоМатериалов();
	РассчитатьИтоговыеПоказателиКлиент();
	ОбновитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДокументПоПредварительномуРасчету(ПредварительныйРасчет)
	Если ЗначениеЗаполнено(ПредварительныйРасчет) Тогда
		РеквизитыПР = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПредварительныйРасчет, "Ссылка, Организация, Подразделение, ВидЦен, ВидСкидки, Валюта, СуммаДокумента", Истина);;
		Если ЗначениеЗаполнено(РеквизитыПР.Ссылка) Тогда
			//ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыПР);
			ЗаполнитьЗначенияСвойств(Объект, РеквизитыПР);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПредварительныйРасчет) И ЗначениеЗаполнено(РеквизитыПР.Ссылка) Тогда
		Объект.ТоварыУслуги.Очистить();;
		Для Каждого СтрокаТаблицы Из ПредварительныйРасчет.ТоварыУслуги Цикл
			НоваяСтрока = Объект.ТоварыУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.УИСтроки = Новый УникальныйИдентификатор;
			НоваяСтрока.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);
			НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчитыватьНДС, , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		КонецЦикла;
		Объект.Материалы.Очистить();
		Для Каждого СтрокаТаблицы Из ПредварительныйРасчет.Материалы Цикл
			НоваяСтрока = Объект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.УИСтроки = Новый УникальныйИдентификатор;
		КонецЦикла;	
	КонецЕсли;
	ПерестроитьДеревоНаФорме();
КонецФункции	

&НаКлиенте
Процедура ДобавитьКонструкцию(Команда)
	
	ВМатериалы = (СтрНайти(Команда.Имя, "ВМатериалы") > 0);
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;	
	Если ВМатериалы Тогда
		ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	КонецЕсли;
	
	Если НЕ ОбщийМодульКлиент.Розница_КомнатаЗаполнена(ТекущиеДанные) Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура("РежимДобавленияКонструкции", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаДанныхПродукцииПоВиду", ЭтотОбъект, ВМатериалы);
	ОткрытьФорму("ОбщаяФорма.ФормаДобавленияПродукцииПоВиду", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

//--16450



РазрешитьРедактированиеСтроки = Ложь;
СтрокаМатериаловДобавлена = Ложь;