
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ДокументСсылка") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ВыбраннаяФорма = "Форма";
	
	Если Не Параметры.Свойство("ПодключенноеОборудование") Тогда
		
		ПодключенноеОборудование = ПодключаемоеОборудованиеПотолкиВызовСервера.ОборудованиеПодключенноеПоОрганизации(Параметры.Организация);
		Параметры.Вставить(
		"ПодключенноеОборудование",
		ПодключенноеОборудование);
		
		Если ПодключенноеОборудование.ККТ.Количество() = 0 Тогда
			ВыбраннаяФорма = "ОшибкаПодключенияККТ";
		КонецЕсли;
		
	КонецЕсли;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		ВалютаРегл = Константы.ВалютаУчета.Получить();
		
		Если ТипЗнч(Параметры.ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровИУслуг")
			Или ТипЗнч(Параметры.ДокументСсылка) = Тип("ДокументСсылка.Монтаж")
			Или ТипЗнч(Параметры.ДокументСсылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
			
			Если Параметры.ДокументСсылка.Валюта <> ВалютаРегл Тогда
				ВыбраннаяФорма = "ОшибкаИспользуемойВалюты";
			КонецЕсли;			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти