
Функция Печать() Экспорт
	
	ФПпоТБ = ИА_ФП_ПовторИсп.ФП_по_ТБ(СсылкаНаОбъект.Дата);
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИА_ФинансовоеПланирование_Директива_Расшифровка";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодЗапрос.Подразделение КАК Подразделение,
	               |	ПодЗапрос.Фонд КАК Фонд,
	               |	ПодЗапрос.Заказ КАК Заказ,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокБезНал) КАК ДоФП_ОстатокБезнал,
	               |	СУММА(ПодЗапрос.ДоФП_РезервБезНал) КАК ДоФП_РезервБезнал,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокБезНал) + СУММА(ПодЗапрос.ДоФП_РезервБезНал) КАК ДоФП_Остаток_Итого,
	               |	СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ФП_РезервБезнал,
	               |	СУММА(ПодЗапрос.ФП_ПриходБезнал) КАК ФП_ПриходБезнал,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокБезНал) + СУММА(ПодЗапрос.ФП_ПриходБезнал) - СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ПослеФП_ОстатокБезнал,
	               |	СУММА(ПодЗапрос.ДоФП_РезервБезНал) + СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ПослеФП_РезервБезнал,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокБезНал) + СУММА(ПодЗапрос.ФП_ПриходБезнал) + СУММА(ПодЗапрос.ДоФП_РезервБезНал) КАК ПослеФП_Остаток_Итого
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЕСТЬNULL(ДенежныеСредстваОстатки.Подразделение, ДенежныеСредстваВРезервеОстатки.Подразделение) КАК Подразделение,
	               |		ЕСТЬNULL(ДенежныеСредстваОстатки.Фонд, ДенежныеСредстваВРезервеОстатки.Фонд) КАК Фонд,
	               |		&ПустойЗаказ КАК Заказ,
	               |		ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаБезналОстаток,0) - ЕСТЬNULL(ДенежныеСредстваВРезервеОстатки.СуммаБезналОстаток, 0) КАК ДоФП_ОстатокБезНал,
	               |		ЕСТЬNULL(ДенежныеСредстваВРезервеОстатки.СуммаБезналОстаток, 0) КАК ДоФП_РезервБезНал,
	               |		0 КАК ФП_РезервБезнал,
	               |		0 КАК ФП_ПриходБезнал
	               |	ИЗ
	               |		РегистрНакопления.ИА_СредстваНаФондах.Остатки(
	               |				&ДатаДо,
	               |				Организация = &Организация
	               |					ИЛИ &НеРазделять) КАК ДенежныеСредстваОстатки
	               |			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(
	               |					&ДатаДо,
	               |					Организация = &Организация
	               |						ИЛИ &НеРазделять) КАК ДенежныеСредстваВРезервеОстатки
	               |			ПО ДенежныеСредстваОстатки.Подразделение = ДенежныеСредстваВРезервеОстатки.Подразделение
	               |				И ДенежныеСредстваОстатки.Фонд = ДенежныеСредстваВРезервеОстатки.Фонд
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИА_СредстваВРезервеНаФондах.Подразделение,
	               |		ИА_СредстваВРезервеНаФондах.Фонд,
	               |		ИА_СредстваВРезервеНаФондах.ЗП,
	               |		0,
	               |		0,
	               |		ИА_СредстваВРезервеНаФондах.СуммаБезнал,
	               |		0
	               |	ИЗ
	               |		РегистрНакопления.ИА_СредстваВРезервеНаФондах КАК ИА_СредстваВРезервеНаФондах
	               |	ГДЕ
	               |		ИА_СредстваВРезервеНаФондах.Регистратор = &ТекДок
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИА_СредстваНаФондахОбороты.Подразделение,
	               |		ИА_СредстваНаФондахОбороты.Фонд,
	               |		&ПустойЗаказ,
	               |		0,
	               |		0,
	               |		0,
	               |		ИА_СредстваНаФондахОбороты.СуммаБезналОборот
	               |	ИЗ
	               |		РегистрНакопления.ИА_СредстваНаФондах.Обороты(, , Регистратор, ) КАК ИА_СредстваНаФондахОбороты
	               |	ГДЕ
	               |		ИА_СредстваНаФондахОбороты.Регистратор = &ТекДок) КАК ПодЗапрос
	               |ГДЕ
	               |	ПодЗапрос.Фонд <> &ПустойФонд
	               |	И (ПодЗапрос.ДоФП_ОстатокБезНал <> 0
	               |			ИЛИ ПодЗапрос.ДоФП_РезервБезНал <> 0
	               |			ИЛИ ПодЗапрос.ФП_РезервБезнал <> 0
	               |			ИЛИ ПодЗапрос.ФП_ПриходБезнал <> 0)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПодЗапрос.Подразделение,
	               |	ПодЗапрос.Фонд,
	               |	ПодЗапрос.Заказ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	%Порядок%
	               |ИТОГИ
	               |	СУММА(ДоФП_ОстатокБезнал),
	               |	СУММА(ДоФП_РезервБезнал),
	               |	СУММА(ДоФП_Остаток_Итого),
	               |	СУММА(ФП_РезервБезнал),
	               |	СУММА(ФП_ПриходБезнал),
	               |	СУММА(ПослеФП_ОстатокБезнал),
	               |	СУММА(ПослеФП_РезервБезнал),
	               |	СУММА(ПослеФП_Остаток_Итого)
	               |ПО
	               |	ОБЩИЕ,
	               |	%итог% ";
	
		
	упор = "ПодЗапрос.Подразделение.Наименование,	ПодЗапрос.Фонд.Код";
	итогиПо = "Подразделение,	Фонд, Заказ";
	Если не ИспПодразделения ТОгда
		упор = "ПодЗапрос.Фонд.Код";
		итогиПо = "Фонд,Заказ";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Порядок%", упор);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%итог%", итогиПо);
	
	ФППоОрганизациям              = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	Запрос.УстановитьПараметр("НеРазделять", не ФППоОрганизациям);
	
	Запрос.УстановитьПараметр("ТекДок", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Организация", СсылкаНаОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаДо", СсылкаНаОбъект.Дата);
	Запрос.УстановитьПараметр("ДатаПосле", СсылкаНаОбъект.Дата + 1);
	Запрос.УстановитьПараметр("ПустойЗаказ", Документы.ИА_ЗаказНаПриобретение.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойФонд", Справочники.ИА_Фонды.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЭтоРСФ", иа_фп.ЭтоРСФ());
	
	Если Константы.ИА_ФП_РазделятьНалИБезнал.Получить() Тогда
		Макет = ПолучитьМакет("СостояниеФондов");
	Иначе
		Макет = ПолучитьМакет("СостояниеФондовСвернуто");
	КонецЕсли;
    
    ДатаНачалаОтчета =  ?(СсылкаНаОбъект.НачалоПланирования,СсылкаНаОбъект.Дата,СсылкаНаОбъект.Дата + 60*60*24);

	
	Если ФПпоТБ Тогда
		ОблШапка = Макет.ПолучитьОбласть("Шапка1");
		ОблШапка.Параметры.Номер = СсылкаНаОбъект.Номер;
		ОблШапка.Параметры.Дата = Формат(СсылкаНаОбъект.Дата, "ДФ='dd MMMM yyyy ""г.""'");    
		ТабДокумент.Вывести(ОблШапка);
	Иначе
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ОблШапка.Параметры.Номер = Число(Прав(СсылкаНаОбъект.Номер,5));
	    
		ОблШапка.Параметры.ДатаНачала = Формат(ДатаНачалаОтчета, "ДФ='dd MMMM yyyy ""г.""'");    
		ОблШапка.Параметры.ДатаКонца = Формат(ДатаНачалаОтчета + 60*60*24*6 , "ДФ='dd MMMM yyyy ""г.""'");
		ОблШапка.Параметры.СуммаКРаспределению = СсылкаНаОбъект.СуммаКРаспределениюСОстаткомНал + СсылкаНаОбъект.СуммаКРаспределениюСОстаткомБезнал;
		ОблШапка.Параметры.Организация = ВРЕГ(СсылкаНаОбъект.Организация);
		ТабДокумент.Вывести(ОблШапка);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВыводитьИтог =Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
			Продолжить;
		КонецЕсли;
		
		ВыводитьИтог = Истина;
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
			ОблСтрокаИтог = Макет.ПолучитьОбласть("СтрокаИтог");
			ОблСтрокаИтог.Параметры.Заполнить(Выборка);
			Продолжить;
		КонецЕсли;
				
		Если Выборка.Фонд = null Тогда // Подразделение
			ОблСтрока = Макет.ПолучитьОбласть("СтрокаПодразделение");
		ИначеЕсли Выборка.Фонд <> null и Выборка.Заказ  = null Тогда // фонд
			Если ИспПодразделения Тогда
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаФондПодр");
			Иначе
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаФонд");
			КонецЕсли;
		Иначе
			Если Выборка.Заказ.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			
			Если ИспПодразделения Тогда
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаЗаказПодр");			
			Иначе
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаЗаказ");			
			КонецЕсли;
			ОблСтрока.Параметры.описание = Выборка.Заказ.ПредметЗаказа;
		КонецЕсли;
		
		ОблСтрока.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(ОблСтрока);
	КонецЦикла;
	
	Если ВыводитьИтог Тогда
		ТабДокумент.Вывести(ОблСтрокаИтог);
	КонецЕсли;
	
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОблПодвал);
	
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб=Истина;
	
	Возврат ТабДокумент;
	
	//ВыборкаРКО = ПолучитьСписокРКО();
	
КонецФункции