#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаказыватьОтрезы = Истина;
	ЗаказыватьПотолки = Истина;
	ЗаказыватьТиповыеОтрезы = Истина;
	ЗаказыватьТовары = Истина;
	ЗаказыватьПродукцию = Истина; //#6265
	
	СкладыОтличаются = Константы.СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции.Получить();
	НесколькоТочекПроизводства = Константы.НесколькоТочекПроизводства.Получить();
	//Параметры.Свойство("Склад", СкладОтгрузки);
	
	//#10918
	РегистрироватьВыпуск = ПолучитьФункциональнуюОпцию("АвтоматическиРегистрироватьВыпускПриЗаказеНаПроизводство");
	Элементы.СписокТоваровРегистрироватьВыпуск.Видимость = РегистрироватьВыпуск;
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("Склад, СкладПродукции, Цех");

	Если НЕ Параметры.СписокПотолков = Неопределено Тогда
		МассивПотолков = Параметры.СписокПотолков;
		Для НомерСтроки = 0 По МассивПотолков.Количество() - 1 Цикл
			НоваяСтрока = СписокТоваровИзначальный.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивПотолков[НомерСтроки], 
				"СкладОтгрузки, ЗаказНаПроизводство, СтатусПроизводства,
				|НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Коэффициент, ПроцентРучнойСкидки, СуммаРучнойСкидки, Цена, Сумма, 
				|Спецификация, Потолок, УИСтроки, Назначение, КоличествоКВыработке, Заказ, АдресМонтажа, Срочно");
			НоваяСтрока.ВидНоменклатуры = НоваяСтрока.Номенклатура.ВидНоменклатуры;
			//НоваяСтрока.СкладОтгрузки = СкладОтгрузки; //2021-09-17 берем из таблицы
			
			Если НЕ Параметры.НастройкаИнтеркампани.Пустая() Тогда 
				НоваяСтрока.СкладПродукции = Параметры.НастройкаИнтеркампани.ПроизводствоСклад;
				
			ИначеЕсли СкладыОтличаются Тогда
				//НоваяСтрока.СкладПродукции = ПараметрыСеанса.ТекущийПользователь.Склад;
				//НоваяСтрока.СкладПродукции = РеквизитыПользователя.СкладПродукции; 
				НоваяСтрока.СкладПродукции = МассивПотолков[НомерСтроки].Заказ.СкладМатериалов;
			КонецЕсли;
			
			Если НесколькоТочекПроизводства Тогда
				НоваяСтрока.Цех = РеквизитыПользователя.Цех;
			КонецЕсли;
			
			//++ №7875 в колонке "Склад продукции" ставить склад из цеха, если он указан
			Если СкладыОтличаются И НесколькоТочекПроизводства И ЗначениеЗаполнено(НоваяСтрока.Цех.СкладГотовойПродукции) Тогда
				НоваяСтрока.СкладПродукции = НоваяСтрока.Цех.СкладГотовойПродукции;
			КонецЕсли;
			//-- №7875
			
			//++ №13265
			Если ЗначениеЗаполнено(НоваяСтрока.Заказ.ОжидаемаяДатаОтгрузки) Тогда				
				НоваяСтрока.ДатаОтгрузки = НоваяСтрока.Заказ.ОжидаемаяДатаОтгрузки + (НоваяСтрока.Заказ.ОжидаемоеВремяОтгрузки - Дата(1,1,1));				
			Иначе
				// 2022-05-23 Ильнур, закомментировано
				//ПланируемаяДата = ОбменСEasyCeiling.ПолучитьЗначениеРеквизита(НоваяСтрока.Номенклатура, "Потолок_ПланируемаяДата");
				//ПланируемоеВремя = ОбменСEasyCeiling.ПолучитьЗначениеРеквизита(НоваяСтрока.Номенклатура, "Потолок_ПланируемоеВремя");
				//
				//НоваяСтрока.ДатаОтгрузки = ПланируемаяДата + (ПланируемоеВремя - Дата(1,1,1));				
			КонецЕсли;
			//-- №13265
			
			//НоваяСтрока.РегистрироватьВыпуск = РегистрироватьВыпуск; //#10918
									
			//добавляем подчиненные строки по услугам
			МассивУслуг = Параметры.СписокУслуг;
			Для НомерСтрокиУслуги = 0 По МассивУслуг.Количество() - 1 Цикл
				Если МассивУслуг[НомерСтрокиУслуги].Потолок = НоваяСтрока.Номенклатура
					И МассивУслуг[НомерСтрокиУслуги].УИСтроки = НоваяСтрока.УИСтроки
					Тогда
					НоваяПодчиненнаяСтрока = СписокТоваровИзначальный.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяПодчиненнаяСтрока, МассивУслуг[НомерСтрокиУслуги]);
					НоваяПодчиненнаяСтрока.ВидНоменклатуры = НоваяПодчиненнаяСтрока.Номенклатура.ВидНоменклатуры;
					НоваяПодчиненнаяСтрока.ПодчиненнаяСтрока = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Параметры.СписокУслуг = Неопределено Тогда
		МассивУслуг = Параметры.СписокУслуг;
		Для НомерСтроки = 0 По МассивУслуг.Количество() - 1 Цикл
			НоваяСтрока = СписокУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивУслуг[НомерСтроки]);
			НоваяСтрока.ВидНоменклатуры = НоваяСтрока.Номенклатура.ВидНоменклатуры;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Параметры.СписокМатериалов = Неопределено Тогда
		МассивМатериалов = Параметры.СписокМатериалов;
		Для НомерСтроки = 0 По МассивМатериалов.Количество() - 1 Цикл
			НоваяСтрока = СписокМатериалов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивМатериалов[НомерСтроки]);
			НоваяСтрока.ВидНоменклатуры = НоваяСтрока.Номенклатура.ВидНоменклатуры;
		КонецЦикла;
	КонецЕсли;
	
	//Начало исключен при переходе на 2.0
	//Элементы.СписокТоваровОтметитьТовары.Видимость = Параметры.ЗаказыватьТовары;
	//Конец исключен при переходе на 2.0
	
	Элементы.СписокТоваровЗаполнитьСкладПродукции.Видимость = СкладыОтличаются;
	Элементы.СписокТоваровСкладПродукции.Видимость = СкладыОтличаются;
	
	//++ №7875 закомментировано, т.к. склад показываем всегда, просто меняем заголовок
	//Элементы.СписокТоваровСкладОтгрузки.Видимость = СкладыОтличаются;
	Элементы.СписокТоваровСкладОтгрузки.Заголовок = ?(СкладыОтличаются, "Склад отгрузки", "Склад отгрузки и продукции");
	//-- №7875
	
	Элементы.СписокТоваровЦех.Видимость = НесколькоТочекПроизводства;
	Элементы.СписокТоваровЗаполнитьЦех.Видимость = НесколькоТочекПроизводства;
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("СписокТоваровНоменклатураАртикул");
	МассивЭлементов.Добавить("СписокМатериаловНоменклатураАртикул");
	МассивЭлементов.Добавить("СписокУслугНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПерестроитьСписокТоваровНаФорме();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗаказыватьОтрезыПриИзменении(Элемент)
	ПерестроитьСписокТоваровНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыватьПотолкиПриИзменении(Элемент)
	ПерестроитьСписокТоваровНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыватьТиповыеОтрезыПриИзменении(Элемент)
	ПерестроитьСписокТоваровНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыватьТоварыПриИзменении(Элемент)
	ПерестроитьСписокТоваровНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыватьКонструкцииПриИзменении(Элемент)
	//#6265
	ПерестроитьСписокТоваровНаФорме();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ОтметитьСтроки(, Истина);
	//Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
	//	ТекущаяСтрока.Заказывать = Истина;
	//	Если РегистрироватьВыпуск Тогда
	//		ТекущаяСтрока.РегистрироватьВыпуск = ТекущаяСтрока.Заказывать;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСоВсех(Команда)
	
	ОтметитьСтроки(, Ложь);	
	//Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
	//	ТекущаяСтрока.Заказывать = Ложь;
	//	Если РегистрироватьВыпуск Тогда
	//		ТекущаяСтрока.РегистрироватьВыпуск = ТекущаяСтрока.Заказывать;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьПометки(Команда)
	
	ОтметитьСтроки(, , Истина);
	//Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
	//	ТекущаяСтрока.Заказывать = НЕ ТекущаяСтрока.Заказывать;
	//	Если РегистрироватьВыпуск Тогда
	//		ТекущаяСтрока.РегистрироватьВыпуск = НЕ ТекущаяСтрока.РегистрироватьВыпуск ;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьСтрокиПоВидуНоменклатуры(Команда)
	
	Назначение = СтрЗаменить(Команда.Имя, "Отметить", "");	
	ОтметитьСтроки(Назначение, Истина);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОтметитьСтроки(Назначение = "Все", Заказывать = Истина, Инвертировать = Ложь)
	
	Если Назначение = "Все" Тогда		
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			ЗначениеГалки = ?(Инвертировать, НЕ ТекущаяСтрока.Заказывать, Заказывать); 
			ТекущаяСтрока.Заказывать = ЗначениеГалки;
			Если РегистрироватьВыпуск Тогда
				ТекущаяСтрока.РегистрироватьВыпуск = ЗначениеГалки;
			КонецЕсли;
		КонецЦикла;
	
	Иначе
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			Если (ТекущаяСтрока.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал") И Назначение = "Товары")
				ИЛИ (ТекущаяСтрока.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок") И Назначение = "Потолки")
				ИЛИ (ТекущаяСтрока.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез") И Назначение = "Отрезы")
				ИЛИ (ТекущаяСтрока.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция") И Назначение = "Продукцию")
				Тогда
				
				ТекущаяСтрока.Заказывать = Заказывать;
				Если РегистрироватьВыпуск Тогда
					ТекущаяСтрока.РегистрироватьВыпуск = Заказывать;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСкладПродукции(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораСклада", ЭтаФорма);
	ОткрытьФорму("Справочник.Склады.ФормаВыбора",,,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСклада(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Для каждого СтрокаТабличнойЧасти из СписокТоваров Цикл
			СтрокаТабличнойЧасти.СкладПродукции = Результат;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦех(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЦеха", ЭтаФорма);
	ОткрытьФорму("Справочник.Цехи.ФормаВыбора",,,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЦеха(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Для каждого СтрокаТабличнойЧасти из СписокТоваров Цикл
			СтрокаТабличнойЧасти.Цех = Результат;
			СтрокаТабличнойЧасти.СкладПродукции = ПолучитьСкладПриИзмененииЦехаНаСервере(СтрокаТабличнойЧасти.Цех, СтрокаТабличнойЧасти.СкладПродукции); // №7875
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//++ №13265
&НаКлиенте
Процедура ЗаполнитьДатуОтгрузки(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораДатыОтгрузки", ЭтаФорма);
	ПоказатьВводДаты(Оповещение, ТекущаяДата(),, ЧастиДаты.ДатаВремя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДатыОтгрузки(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока из СписокТоваров Цикл
		ТекущаяСтрока.ДатаОтгрузки = Результат;
	КонецЦикла;
	
КонецПроцедуры
//-- №13265

&НаКлиенте
Процедура Заказать(Команда)
	
	//#13249
	Отказ = Ложь;
	//Если НесколькоТочекПроизводства Тогда
		Для Индекс = 0 По СписокТоваров.Количество()-1 Цикл
			ТекущаяСтрока = СписокТоваров[Индекс];
			Если ТекущаяСтрока.Заказывать И НЕ ТекущаяСтрока.ПодчиненнаяСтрока Тогда
				//Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Цех) Тогда
				//	ТекстСообщения = "В строке " + Строка(Индекс+1) + " не заполнено значение колонки ""Цех""";
				//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "СписокТоваров[" + Строка(Индекс) + "].Цех", , Отказ);
				//КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.СкладПродукции)
					И СкладыОтличаются // №13855
				Тогда
					ТекстСообщения = "В строке " + Строка(Индекс+1) + " не заполнено значение колонки ""Склад продукции""";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "СписокТоваров[" + Строка(Индекс) + "].СкладПродукции", , Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	//КонецЕсли;
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	СписокЗаказать = Новый Массив;
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		Если ТекущаяСтрока.Заказывать И НЕ ТекущаяСтрока.ПодчиненнаяСтрока Тогда
			СтруктураТовара = Новый Структура;
			СтруктураТовара.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
			СтруктураТовара.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
			СтруктураТовара.Вставить("Количество", ТекущаяСтрока.Количество);
			СтруктураТовара.Вставить("ЕдиницаИзмерения", ТекущаяСтрока.ЕдиницаИзмерения);
			СтруктураТовара.Вставить("Спецификация", ТекущаяСтрока.Спецификация);
			СтруктураТовара.Вставить("НомерСтроки", ТекущаяСтрока.НомерСтроки);
			СтруктураТовара.Вставить("ЗаказНаПроизводство", ТекущаяСтрока.ЗаказНаПроизводство);
			СтруктураТовара.Вставить("Коэффициент", ТекущаяСтрока.Коэффициент);
			СтруктураТовара.Вставить("ПроцентРучнойСкидки", ТекущаяСтрока.ПроцентРучнойСкидки);
			СтруктураТовара.Вставить("Цена", ТекущаяСтрока.Цена);
			СтруктураТовара.Вставить("СуммаРучнойСкидки", ТекущаяСтрока.СуммаРучнойСкидки);
			СтруктураТовара.Вставить("Сумма", ТекущаяСтрока.Сумма);
			СтруктураТовара.Вставить("Потолок", ТекущаяСтрока.Потолок);
			СтруктураТовара.Вставить("УИСтроки", ТекущаяСтрока.УИСтроки);
			СтруктураТовара.Вставить("КоличествоКВыработке",ТекущаяСтрока.КоличествоКВыработке); //Переход на 2.0
			СтруктураТовара.Вставить("Заказ", ТекущаяСтрока.Заказ); //Переход на 2.0
			СтруктураТовара.Вставить("СкладПродукции", ТекущаяСтрока.СкладПродукции);
			СтруктураТовара.Вставить("Цех", ТекущаяСтрока.Цех);
			СтруктураТовара.Вставить("РегистрироватьВыпуск", ТекущаяСтрока.РегистрироватьВыпуск); //#10918
			СтруктураТовара.Вставить("АдресМонтажа", ТекущаяСтрока.АдресМонтажа); //#10994
			СтруктураТовара.Вставить("ДатаОтгрузки", ТекущаяСтрока.ДатаОтгрузки); // №13265
			СтруктураТовара.Вставить("Срочно", ТекущаяСтрока.Срочно); // №13803
			
			СписокЗаказать.Добавить(СтруктураТовара);
			
			
			//Услуги - Не нужно их передавать ведь?
			//Если НЕ ЭтоПотолок(ТекущаяСтрока.Номенклатура) Тогда
			//	Для каждого СтрокаУслуг из СписокУслуг Цикл   
			//		Если СтрокаУслуг.Потолок = ТекущаяСтрока.Номенклатура Тогда // Продукция = ТекущаяСтрока.Номенклатура
			//			СтруктураТовара = Новый Структура;
			//			СтруктураТовара.Вставить("Номенклатура", СтрокаУслуг.Номенклатура);
			//			СтруктураТовара.Вставить("ХарактеристикаНоменклатуры", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
			//			СтруктураТовара.Вставить("Количество", СтрокаУслуг.Количество);
			//			СтруктураТовара.Вставить("ЕдиницаИзмерения", СтрокаУслуг.ЕдиницаИзмерения);
			//			СтруктураТовара.Вставить("НомерСтроки", СтрокаУслуг.НомерСтроки);
			//			СтруктураТовара.Вставить("ЗаказНаПроизводство", СтрокаУслуг.ЗаказНаПроизводство);
			//			СтруктураТовара.Вставить("Коэффициент", СтрокаУслуг.Коэффициент);
			//			СтруктураТовара.Вставить("ПроцентРучнойСкидки", СтрокаУслуг.ПроцентРучнойСкидки);
			//			СтруктураТовара.Вставить("Цена", СтрокаУслуг.Цена);
			//			СтруктураТовара.Вставить("СуммаРучнойСкидки", СтрокаУслуг.СуммаРучнойСкидки);
			//			СтруктураТовара.Вставить("Сумма", СтрокаУслуг.Сумма);
			//			СтруктураТовара.Вставить("Потолок", СтрокаУслуг.Потолок);
			//			СтруктураТовара.Вставить("КоличествоКВыработке",СтрокаУслуг.КоличествоКВыработке); //Переход на 2.0
			//			СписокЗаказать.Добавить(СтруктураТовара);
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
						
		КонецЕсли;
	КонецЦикла;
	Закрыть(СписокЗаказать);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСрочность(Команда)
	
	Для Каждого ТекущаяСтрока из СписокТоваров Цикл
		ТекущаяСтрока.Срочно = Истина;
	КонецЦикла;
		
//	ТолькоВыделенные = Ложь;
//	Если Команда.Имя = "ЗаполнитьСрочностьПоВыделеннымСтрокам" Тогда
//		ТолькоВыделенные = Истина;	
//	КонецЕсли;
//	
//	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораЗначенияСрочности", ЭтаФорма, ТолькоВыделенные);
//	ПоказатьВводЗначения(ОписаниеОповещения, Истина, "Срочно", Новый ОписаниеТипов("Булево"));
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПослеВыбораЗначенияСрочности(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если Результат = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ТолькоВыделенные = ДополнительныеПараметры;
//	
//	Если ТолькоВыделенные Тогда
//		Для каждого ИдСтроки из Элементы.СписокТоваров.ВыделенныеСтроки Цикл
//			ТекущаяСтрока =  СписокТоваров.НайтиПоИдентификатору(ИдСтроки);
//			ТекущаяСтрока.Срочно = Результат;			
//		КонецЦикла;
//	Иначе
		//Для Каждого ТекущаяСтрока из СписокТоваров Цикл
		//	ТекущаяСтрока.Срочно = Результат;
		//КонецЦикла;
	//КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийСпискаТоваров

&НаКлиенте
Процедура СписокТоваровПриИзменении(Элемент)
	
	ТекДанные = Элементы.СписокТоваров.ТекущиеДанные;
	Если ЭтоПотолок(ТекДанные.Номенклатура) Тогда
		ОтметитьУслугиИТоварыПотолка(ТекДанные.Заказывать, ТекДанные.Номенклатура, ТекДанные.УИСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокТоваров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отбор = Новый Структура("Потолок", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	Иначе
		Отбор = Новый Структура("Потолок,УИстроки", ТекущиеДанные.Номенклатура, ТекущиеДанные.УИСтроки);
	КонецЕсли;	
		
	Элементы.СписокМатериалов.ОтборСтрок = новый ФиксированнаяСтруктура(Отбор);
	
	
	Если ТекущиеДанные = Неопределено Тогда
		Отбор = Новый Структура("Потолок", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	Иначе
		Отбор = Новый Структура("Потолок,УИстрокиРодителя", ТекущиеДанные.Номенклатура, ТекущиеДанные.УИСтроки);
	КонецЕсли;
	
	Элементы.СписокУслуг.ОтборСтрок = новый ФиксированнаяСтруктура(Отбор);

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровЗаказыватьПриИзменении(Элемент)
	
	ТекДанные = Элементы.СписокТоваров.ТекущиеДанные;
	Если РегистрироватьВыпуск Тогда
		ТекДанные.РегистрироватьВыпуск = ТекДанные.Заказывать;
	КонецЕсли;
	Если ЭтоПотолок(ТекДанные.Номенклатура) Тогда
		ОтметитьУслугиИТоварыПотолка(ТекДанные.Заказывать, ТекДанные.Номенклатура, ТекДанные.УИСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровЦехПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокТоваров.ТекущиеДанные;
	ТекущиеДанные.СкладПродукции = ПолучитьСкладПриИзмененииЦехаНаСервере(ТекущиеДанные.Цех, ТекущиеДанные.СкладПродукции);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтметитьУслугиИТоварыПотолка(Заказывать, Потолок, УИСтроки)
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		Если ТекущаяСтрока.Потолок = Потолок 
			И ТекущаяСтрока.УИСтроки = УИСтроки
			Тогда
			ТекущаяСтрока.Заказывать = Заказывать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерестроитьСписокТоваровНаФорме()
	
	//таблица нужна, чтобы вернуть установленную ранее галочку, если позиция после перестроения так и остается на форме и у нее была галочка
	ВремСписокТоваров.Очистить();
	Для Каждого ТекСтрока Из СписокТоваров Цикл
		НоваяСтрока = ВремСписокТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
		
	СписокТоваров.Очистить();
	Для Каждого ТекущаяСтрока Из СписокТоваровИзначальный Цикл
		Если ТекущаяСтрока.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал") И ЗаказыватьТовары
			или ТекущаяСтрока.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок") И ЗаказыватьПотолки
			или ТекущаяСтрока.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез") И ЗаказыватьОтрезы
			или ТекущаяСтрока.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.ТиповойОтрез") И ЗаказыватьТиповыеОтрезы
			или ТекущаяСтрока.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция") И ЗаказыватьПродукцию
			Тогда
			
			НоваяСтрока = СписокТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			Отбор = Новый Структура;
			Отбор.Вставить("УИСтроки",НоваяСтрока.УИСтроки);
			НайденныеСтроки = ВремСписокТоваров.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НоваяСтрока.Заказывать = НайденныеСтроки[0].Заказывать;
			КонецЕсли;
		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСкладПриИзмененииЦехаНаСервере(Цех, СкладПродукции)
	
	СкладПродукцииПользователя = ОбщийМодульСервер.НастройкаПользователя("СкладПродукции");
	
	Если ЗначениеЗаполнено(Цех.СкладГотовойПродукции) Тогда
		Возврат Цех.СкладГотовойПродукции;
	//++ #14947
	//ИначеЕсли ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь.Склад) Тогда
		//Возврат ПараметрыСеанса.ТекущийПользователь.Склад;
	ИначеЕсли ЗначениеЗаполнено(СкладПродукцииПользователя) Тогда
		Возврат СкладПродукцииПользователя;
	//-- #14947
	ИначеЕсли ЗначениеЗаполнено(СкладПродукции) Тогда
		Возврат СкладПродукции;

	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЭтоПотолок(Номенклатура)
	Возврат Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Номенклатура);
КонецФункции

&НаКлиенте
Процедура СписокТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//++ №12001
	ТекущиеДанные = Элементы.СписокТоваров.ТекущиеДанные;
	
	Если Элемент.ТекущийЭлемент.Имя = "СписокТоваровСтатусПроизводства"
		И НЕ ТекущиеДанные = Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.ЗаказНаПроизводство)
	Тогда
	
		ОткрытьФорму("Документ.ЗаказНаПроизводство.ФормаОбъекта", новый Структура("Ключ", ТекущиеДанные.ЗаказНаПроизводство));
		
	КонецЕсли;
	//-- №12001
	
КонецПроцедуры


#КонецОбласти



