Функция MobileMontajGET(Запрос)
	
	СтруктураОтвета = Новый Структура;
	
	Если Не Константы.ИспользуетсяМобильныйКлиентМонтажника.Получить() Тогда
		
		Ответ = Новый HTTPСервисОтвет(200);
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("message", "Интеграция с мобильным клиентом в программе не подключена");
		СтруктураОтвета.Вставить("error", СтруктураОшибки);
		
	Иначе
		
		Ответ = Новый HTTPСервисОтвет(200);
		ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
		ПользовательБД = ПараметрыСеанса.ТекущийПользователь;
		
		СтруктураОтвета = Новый Структура;
		
		//ОБРАБОТКА ЗАПРОСОВ
		Если НРЕГ(ИмяМетода) = "montajlist" Тогда
			//получение списка монтажей
			СтруктураОтвета = МобильныйКлиент.ПолучитьСписокМонтажейПользователяДляJSON(ПользовательБД);
		//#11814	
		ИначеЕсли НРЕГ(ИмяМетода) = "getmontaj" Тогда
			//получение данных по одному монтажу
			ИДМонтажа = Запрос.ПараметрыЗапроса.Получить("id");
			СтруктураОтвета = МобильныйКлиент.ПолучитьСписокМонтажейПользователяДляJSON(ПользовательБД, ИДМонтажа);
			
		//--теперь классификатор валют приходит вместе со списком монтажей
		//ИначеЕсли НРЕГ(ИмяМетода) = "currency" Тогда
		//	//получение классификатора валют
		//	СтруктураОтвета = МобильныйКлиент.ПолучитьСписокВалютJSON();
		
		ИначеЕсли НРЕГ(ИмяМетода) = "getfile" Тогда
			
			//получение файла прикрепленного к монтажу. у этой ветки условия свой ответ - после выполнения сразу выходим из процедуры
			ИдМонтажа = Запрос.ПараметрыЗапроса.Получить("id");
			ИмяФайла = СокрЛП(Запрос.ПараметрыЗапроса.Получить("filename"));
			РасширениеФайла = СокрЛП(Запрос.ПараметрыЗапроса.Получить("fileext"));
			
			Ответ = Новый HTTPСервисОтвет(200);
			
			ХранилищеФайла = МобильныйКлиент.ПолучитьПрикрепленныйФайлКМонтажу(ИдМонтажа, ИмяФайла, РасширениеФайла, СтруктураОтвета);
			Если ТипЗнч(ХранилищеФайла) = Тип("ХранилищеЗначения") Тогда
				//пришло хранилище значения с данными файла
				Ответ.УстановитьТелоИзДвоичныхДанных(ХранилищеФайла.Получить());
				Ответ.Заголовки.Вставить("Content-Type", "application/octet-stream");
				Ответ.Заголовки.Вставить("Content-Disposition", "attachment; filename=" + КодироватьСтроку(ИмяФайла+"."+РасширениеФайла, СпособКодированияСтроки.КодировкаURL));
				Возврат Ответ;
			Иначе
				//пришёл текст с ошибкой
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("message", ХранилищеФайла);
				СтруктураОтвета.Вставить("error", СтруктураОшибки);
			КонецЕсли;
		ИначеЕсли НРЕГ(ИмяМетода) = "montajprintform" Тогда
			//получение файла печатной формы монтажа
			
			ГуидМонтажа = Запрос.ПараметрыЗапроса.Получить("montajguid");
			ИдентификаторФормы = Запрос.ПараметрыЗапроса.Получить("id");
			ГуидВнешнейОбработки = Запрос.ПараметрыЗапроса.Получить("formguid");
						
			Ответ = Новый HTTPСервисОтвет(200);
			
			ХранилищеФайла = МобильныйКлиент.ПолучитьПечатнуюФормуДокументаМонтаж(ГуидМонтажа, ИдентификаторФормы, ГуидВнешнейОбработки);
			Если ТипЗнч(ХранилищеФайла) = Тип("ХранилищеЗначения") Тогда
				//пришло хранилище значения с данными файла
				Ответ.УстановитьТелоИзДвоичныхДанных(ХранилищеФайла.Получить());
				Ответ.Заголовки.Вставить("Content-Type", "application/octet-stream");
				Ответ.Заголовки.Вставить("Content-Disposition", "attachment; filename=" + КодироватьСтроку(ИмяФайла, СпособКодированияСтроки.КодировкаURL));
				Возврат Ответ;
			Иначе
				//пришёл текст с ошибкой
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("message", ХранилищеФайла);
				СтруктураОтвета.Вставить("error", СтруктураОшибки);
			КонецЕсли;
			
		ИначеЕсли НРЕГ(ИмяМетода) = "getadditionalfile" Тогда
			
			//получение файла прикрепленного к лиду или заказ-договору. у этой ветки условия свой ответ - после выполнения сразу выходим из процедуры
			ТипДокумента = Запрос.ПараметрыЗапроса.Получить("documenttype");
			ИдДокумента = Запрос.ПараметрыЗапроса.Получить("id");
			ИмяФайла = СокрЛП(Запрос.ПараметрыЗапроса.Получить("filename"));
			РасширениеФайла = СокрЛП(Запрос.ПараметрыЗапроса.Получить("fileext"));
			
			Ответ = Новый HTTPСервисОтвет(200);
			
			ХранилищеФайла = МобильныйКлиент.ПолучитьДополнительныйФайлМонтажа(ТипДокумента, ИдДокумента, ИмяФайла, РасширениеФайла, СтруктураОтвета);
			Если ТипЗнч(ХранилищеФайла) = Тип("ХранилищеЗначения") Тогда
				//пришло хранилище значения с данными файла
				Ответ.УстановитьТелоИзДвоичныхДанных(ХранилищеФайла.Получить());
				Ответ.Заголовки.Вставить("Content-Type", "application/octet-stream");
				Ответ.Заголовки.Вставить("Content-Disposition", "attachment; filename=" + КодироватьСтроку(ИмяФайла+"."+РасширениеФайла, СпособКодированияСтроки.КодировкаURL));
				Возврат Ответ;
			Иначе
				//пришёл текст с ошибкой
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("message", ХранилищеФайла);
				СтруктураОтвета.Вставить("error", СтруктураОшибки);
			КонецЕсли;

			
		Иначе
			//пришел запрос на неизвестный метод
			Ответ.КодСостояния = 200;
			
			СтруктураОшибки = Новый Структура;
			СтруктураОшибки.Вставить("message", "Получен неизвестный запрос. Вероятно вам следует обновить вашу конфигурацию CRM&ERP SmartCeilings");
			СтруктураОтвета.Вставить("error", СтруктураОшибки);
		КонецЕсли; 
		
	КонецЕсли;
	
	//формируем jSON ответ
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета,КодировкаТекста.UTF8);	
	
	Возврат Ответ;

КонецФункции

Функция MobileMontajPOST(Запрос)
	
	СтруктураОтвета = Новый Структура;
	
	Если Не Константы.ИспользуетсяМобильныйКлиентМонтажника.Получить() Тогда
		
		Ответ = Новый HTTPСервисОтвет(200);
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("message", "Интеграция с мобильным клиентом в программе не подключена");
		СтруктураОтвета.Вставить("error", СтруктураОшибки);
		
	Иначе
		
		Ответ = Новый HTTPСервисОтвет(200);
		
		ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
		ПользовательБД = ПараметрыСеанса.ТекущийПользователь;
		
		//ОБРАБОТКА ЗАПРОСОВ
		Если НРЕГ(ИмяМетода = "montajhistory") Тогда
			//запрос на внесение результатов замеров
			
			ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
			
			Ответ.КодСостояния = 200;
			СтруктураОтвета = МобильныйКлиент.ЗаписатьИсториюМонтажа(ЗапросОтКлиента, ПользовательБД);
			
		ИначеЕсли НРЕГ(ИмяМетода = "montajfile") Тогда
			//запрос на передачу прикрепленных к замерам файлов
			СтруктураОтвета = МобильныйКлиент.СохранитьПрикрепленныеДанныеМонтажа(Запрос);
			
		Иначе
			
			//пришел запрос на неизвестный метод
			Ответ.КодСостояния = 200;
			
			СтруктураОшибки = Новый Структура;
			СтруктураОшибки.Вставить("message", "Получен неизвестный запрос. Вероятно вам следует обновить вашу конфигурацию CRM&ERP SmartCeilings");
			СтруктураОтвета.Вставить("error", СтруктураОшибки);
			
		КонецЕсли;
	КонецЕсли;
	
	//формируем jSON ответ
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета,КодировкаТекста.UTF8);	
	
	Возврат Ответ;
	
КонецФункции
