Процедура ПозвонитьПоНомеру(ТелефонКлиента, ИмяКлиента = "") Экспорт
	
	Если ПустаяСтрока(ТелефонКлиента) Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		ПанельСофтФон = Неопределено;
		ПанельRomAsterisk = Неопределено;
		Состояние("СофтФон не доступен в WEB-Клиенте");
	#Иначе
		Оповестить("ВыполнитьИсходящийЗвонок", Новый Структура("ТелефонКлиента, ИмяКлиента", ТелефонКлиента, ИмяКлиента));
		//Если СофтФон.ИспользуютсяСофтФон() Тогда
		//	Если НЕ ПанельСофтФон = Неопределено Тогда
		//		Если НЕ ПанельСофтФон.MakeCall("", ТелефонКлиента, , ИмяКлиента, ИмяКлиента,) = 0 Тогда
		//			Состояние("Не удалось соединиться с СофтФон");
		//		КонецЕсли;
		//	Иначе
		//		Состояние("Не удалось соединиться с СофтФон");
		//	КонецЕсли;
		//ИначеЕсли СофтФон.ИспользуетсяROMAsterisk() Тогда
		//	
		//	Контекст = СофтФон.ПолучитьКонтекстИсходящихЗвонков();
		//	ВнутреннийНомер = СофтФон.ПолучитьВнутреннийНомерПользователя();
		//	Если Не ЗначениеЗаполнено(ВнутреннийНомер) Тогда
		//		Состояние("Не указан внутренний номер, с которого выполняется звонок");
		//		Возврат;
		//	КонецЕсли;
		//	
		//	СтрокаНабораЦифры = ПодготовитьНомерДляЗвонка(ТелефонКлиента);
		//	Если ПустаяСтрока(СтрокаНабораЦифры) Тогда
		//		Состояние("Телефонный номер должен содержать цифры");
		//		Возврат;
		//	КонецЕсли;
		//	
		//	//отправим комнду проверки на наличие запущенного программного телефона или подключенного аппаратного. ответ поймает и отработает функция в обработке "СофтФон"
		//	CRLF=Chars.CR+Chars.LF;
		//	ТекстКоманды=	"Action: Command"+CRLF+
		//	"Command: sip show peer 118"+CRLF+CRLF;
		//	ПанельRomAsterisk.ВыполнитьКоманду(ТекстКоманды);
		//	
		//	//отправляем команду звонка
		//	CRLF=Chars.CR+Chars.LF;
		//	ТекстКоманды="Action: Originate"+CRLF+
		//	"Channel: SIP/"+ВнутреннийНомер+CRLF+
		//	"Context: "+Контекст+CRLF+
		//	"Exten: "+СтрокаНабораЦифры+CRLF+
		//	"Priority: 1"+CRLF+
		//	"Callerid: "+ВнутреннийНомер+CRLF+
		//	"Timeout: 30000"+CRLF+CRLF;
		//	
		//	ПанельRomAsterisk.ВыполнитьКоманду(ТекстКоманды);
		//	
		//ИначеЕсли СофтФон.ИспользуетсяROMHMAC() Тогда
		//	
		//	ВнутреннийНомер = СофтФон.ПолучитьВнутреннийНомерПользователя();
		//	Номер=СофтФон.ОставитьТолькоЦифры(ТелефонКлиента);
		//	Если Не ЗначениеЗаполнено(Номер) Тогда
		//		Состояние("Не указан номер, куда выполняется звонок");
		//		Возврат;
		//	КонецЕсли; 
		//	Если Не ЗначениеЗаполнено(ВнутреннийНомер) Тогда
		//		Состояние("Не указан внутренний номер");
		//		Возврат;
		//	КонецЕсли; 
		//	
		//	ДоменAPI = СофтФон.ПолучитьТелефонияАдресСервера();
		//	
		//	ДанныеJSON=
		//	"{
		//	|'from':'"+ВнутреннийНомер+"',
		//	|'to':'"+Номер+"',
		//	|'from_orig_number':'"+Номер+"',
		//	|'from_orig_name':'"+Номер+"',
		//	|'domain_to':'"+ДоменAPI+"',
		//	|'from_name':'"+ВнутреннийНомер+"'
		//	|}";
		//	
		//	Пакет=СформироватьПакетOnPBX(ДанныеJSON,"make_call");
		//	ПанельRomHMac.Отправить(Пакет);
		//	
		//КонецЕсли;
	#КонецЕсли
КонецПроцедуры

Функция ПодготовитьНомерДляЗвонка(Знач Номер) Экспорт
	
	Номер = СтрЗаменить(Номер, "+7", "8");
	ТолькоЦифры="";
	Для Индекс=1 По СтрДлина(Номер) Цикл
		Символ=Сред(Номер,Индекс,1);
		Если КодСимвола(Символ)>47 и КодСимвола(Символ)<58 Тогда
			ТолькоЦифры=ТолькоЦифры+Символ;
		КонецЕсли; 
	КонецЦикла; 
	Возврат ТолькоЦифры;

КонецФункции

Функция ПроверитьНаличиеЗаписи(ИДВАТС, ЕстьЗапись, ФайлЗаписиСсылка)
	
	// для мегафон и uis слушаем с сервера операторов
	Если ИДВАТС = "megafon" 
		ИЛИ ИДВАТС = "uis" ИЛИ ИДВАТС = "domru" 
		ИЛИ ИДВАТС = "sipuni" ИЛИ ИДВАТС = "phonet"
		ИЛИ ИДВАТС = "beeline"
		Тогда
		Если Не ЕстьЗапись Тогда
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ИДВАТС = "onlinepbx" Тогда
		Если ПустаяСтрока(ФайлЗаписиСсылка) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ИДВАТС = "asterisk" Тогда
		Если ПустаяСтрока(ФайлЗаписиСсылка) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

// открываем ссылку на запись звонка "как есть" (запуск браузера / проигрывателя)
Процедура ОткрытьЗаписьЗвонкаПоСсылке(ИДВАТС, ИДЗвонка, ЕстьЗапись, ФайлЗаписиСсылка) Экспорт
	
	Если НЕ ПроверитьНаличиеЗаписи(ИДВАТС, ЕстьЗапись, ФайлЗаписиСсылка) Тогда
		Сообщить("Отсутствует запись по звонку");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ИДВАТС", ИДВАТС);
	ПараметрыЗаписи.Вставить("ФайлЗаписиСсылка", ФайлЗаписиСсылка);
	ПараметрыЗаписи.Вставить("ИДЗвонка", ИДЗвонка);
	ПараметрыЗаписи.Вставить("Каталог", КаталогВременныхФайлов());
	
	Если ИДВАТС = "megafon" ИЛИ ИДВАТС = "domru" ИЛИ ИДВАТС = "sipuni" ИЛИ ИДВАТС = "phonet" Тогда		
		Если ЗначениеЗаполнено(ФайлЗаписиСсылка) Тогда
			НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтотОбъект), ФайлЗаписиСсылка);
		КонецЕсли;
		
	ИначеЕсли ИДВАТС = "uis" Тогда
		Если ЗначениеЗаполнено(ФайлЗаписиСсылка) Тогда
			Если СтрНайти(ФайлЗаписиСсылка, ";") Тогда
				МассивЗаписей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФайлЗаписиСсылка, ";", Истина, Ложь);				
				Если МассивЗаписей.Количество() > 0 Тогда
					ДополнительныеПараметры = Новый Структура("ИДВАТС, МассивЗаписей, НомерТекущейЗаписи", ИДВАТС, МассивЗаписей, 1);
					ДополнительныеПараметры.Вставить("ДождатьсяЗавершения", Истина);
					НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтотОбъект, ДополнительныеПараметры), МассивЗаписей[0], , Истина);
				КонецЕсли;
			Иначе
				НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтотОбъект), ФайлЗаписиСсылка);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИДВАТС = "binotel" Тогда
		ПолучитьСсылкуНаЗаписьBinotel(ПараметрыЗаписи, Ложь);
		
	ИначеЕсли ИДВАТС = "mango" Тогда
		ПолучитьСсылкуНаЗаписьMango(ПараметрыЗаписи, Ложь);
		
	ИначеЕсли ИДВАТС = "beeline" Тогда
		ПолучитьСсылкуНаЗаписьBeeline(ПараметрыЗаписи, Ложь);
		
	ИначеЕсли ИДВАТС = "onlinepbx" Тогда
		ПолучитьСсылкуНаЗаписьOnPbx(ПараметрыЗаписи, Ложь);	
		
	ИначеЕсли ИДВАТС = "asterisk" Тогда
		
		НастройкиХраненияЗаписейАТС = ОбщийМодульВызовСервера.ПолучитьНастройкиХраненияЗаписейАТС();
		Если НастройкиХраненияЗаписейАТС.ВариантДоступаКЗаписям = 0 ИЛИ НастройкиХраненияЗаписейАТС.ВариантДоступаКЗаписям = 3 Тогда // dl.php или строка запроса
			НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтотОбъект), ФайлЗаписиСсылка);
			
		ИначеЕсли НастройкиХраненияЗаписейАТС.ВариантДоступаКЗаписям = 1 Тогда  // ftp
			ПолучитьФайлЗаписиПоFtp(ПараметрыЗаписи, НастройкиХраненияЗаписейАТС);
	
		ИначеЕсли НастройкиХраненияЗаписейАТС.ВариантДоступаКЗаписям = 2 Тогда  // samba
			ПолныйПутьКФайлу = НастройкиХраненияЗаписейАТС.ЗаписиНачальныйКаталог + ФайлЗаписиСсылка;
			ВыбФайл = Новый Файл(ПолныйПутьКФайлу);		
			Если ВыбФайл.Существует() Тогда
				НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтотОбъект), ПолныйПутьКФайлу);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// скачиваем файл в папку, указанную пользователем 
Процедура СкачатьЗаписьЗвонка(ИДВАТС, ИДЗвонка, ЕстьЗапись, ФайлЗаписиСсылка) Экспорт

	Если НЕ ПроверитьНаличиеЗаписи(ИДВАТС, ЕстьЗапись, ФайлЗаписиСсылка) Тогда
		Сообщить("Отсутствует запись по звонку");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИДВАТС", ИДВАТС);
	ДополнительныеПараметры.Вставить("ИДЗвонка", ИДЗвонка);
	//ДополнительныеПараметры.Вставить("ЕстьЗапись", ЕстьЗапись);
	ДополнительныеПараметры.Вставить("ФайлЗаписиСсылка", ФайлЗаписиСсылка);
	
	Каталог = КаталогВременныхФайлов();
	ОписаниеОповещения = Новый ОписаниеОповещения("СкачатьЗаписьЗвонкаПослеВыбораКаталога", ЭтотОбъект, ДополнительныеПараметры);
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог = Каталог; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	ДиалогОткрытия.Показать(ОписаниеОповещения);
	
КонецПроцедуры

Процедура СкачатьЗаписьЗвонкаПослеВыбораКаталога(ВыбранныйКаталог, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйКаталог = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Каталог", ВыбранныйКаталог[0] + "\"); 	
	ДополнительныеПараметры.Вставить("ЗапуститьПослеСкачивания", Ложь);
	СкачатьЗапуститьЗаписьЗвонка(ДополнительныеПараметры);
	
КонецПроцедуры

// скачиваем файл во временную папку и запускаем проигрывание файла
Процедура ПрослушатьЗаписьЗвонка(ИДВАТС, ИДЗвонка, ЕстьЗапись, ФайлЗаписиСсылка, Форма = Неопределено) Экспорт
		
	Если НЕ ПроверитьНаличиеЗаписи(ИДВАТС, ЕстьЗапись, ФайлЗаписиСсылка) Тогда
		Сообщить("Отсутствует запись по звонку");
		Возврат;
	КонецЕсли;
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИДВАТС", ИДВАТС);
	ДополнительныеПараметры.Вставить("ИДЗвонка", ИДЗвонка);
	//ДополнительныеПараметры.Вставить("ЕстьЗапись", ЕстьЗапись);
	ДополнительныеПараметры.Вставить("ФайлЗаписиСсылка", ФайлЗаписиСсылка);
	ДополнительныеПараметры.Вставить("Каталог", КаталогВременныхФайлов());
	ДополнительныеПараметры.Вставить("ЗапуститьПослеСкачивания", Истина);
	
	СкачатьЗапуститьЗаписьЗвонка(ДополнительныеПараметры);
	
КонецПроцедуры

// скачиваем запись звонка, если ПараметрыЗаписи.ЗапуститьПослеСкачивания = Истина, то запускаем скачанный файл
Процедура СкачатьЗапуститьЗаписьЗвонка(ПараметрыЗаписи)
	
	ИДВАТС = ПараметрыЗаписи.ИДВАТС;
	ФайлЗаписиСсылка = ПараметрыЗаписи.ФайлЗаписиСсылка;
	
	Если ИДВАТС = "megafon" ИЛИ ИДВАТС = "domru" ИЛИ ИДВАТС = "sipuni" ИЛИ ИДВАТС = "phonet" Тогда
		ПолучитьФайлЗаписиПоHttpСсылке(ПараметрыЗаписи);
		
	ИначеЕсли ИДВАТС = "uis" Тогда
		Если ЗначениеЗаполнено(ФайлЗаписиСсылка) Тогда
			Если СтрНайти(ФайлЗаписиСсылка, ";") Тогда
				МассивСсылок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФайлЗаписиСсылка, ";", Истина, Ложь);
				ПолучитьФайлыЗаписиПоHttpСсылкам(ПараметрыЗаписи, МассивСсылок);				
			Иначе
				ПолучитьФайлЗаписиПоHttpСсылке(ПараметрыЗаписи);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИДВАТС = "binotel" Тогда
		// запрашиваем ссылку на запись у АТС
		//ПолучитьСсылкуНаЗаписьBinotel(ИДЗвонка, Истина);
		ПолучитьСсылкуНаЗаписьBinotel(ПараметрыЗаписи, Истина);
		
	ИначеЕсли ИДВАТС = "mango" Тогда
		// запрашиваем ссылку на запись у АТС
		ПолучитьСсылкуНаЗаписьMango(ПараметрыЗаписи, Истина);
		
	ИначеЕсли ИДВАТС = "beeline" Тогда
		ПолучитьСсылкуНаЗаписьBeeline(ПараметрыЗаписи, Ложь);
		
	ИначеЕсли ИДВАТС = "onlinepbx" Тогда
		// запрашиваем ссылку на запись у АТС
		//ПолучитьСсылкуНаЗаписьOnPbx(ИДЗвонка, Истина);	
		ПолучитьСсылкуНаЗаписьOnPbx(ПараметрыЗаписи, Истина);
		
	ИначеЕсли ИДВАТС = "asterisk" Тогда
		
		НастройкиХраненияЗаписейАТС = ОбщийМодульВызовСервера.ПолучитьНастройкиХраненияЗаписейАТС();
		Если НастройкиХраненияЗаписейАТС.ВариантДоступаКЗаписям = 0 ИЛИ НастройкиХраненияЗаписейАТС.ВариантДоступаКЗаписям = 3 Тогда // dl.php или строка запроса
			ДанныеАвторизации = Неопределено;
			Если ЗначениеЗаполнено(НастройкиХраненияЗаписейАТС.ЗаписиЛогин) Тогда
				// #12338 
				ДанныеАвторизации = Новый Структура;
				ДанныеАвторизации.Вставить("Логин", НастройкиХраненияЗаписейАТС.ЗаписиЛогин);
				ДанныеАвторизации.Вставить("Пароль", НастройкиХраненияЗаписейАТС.ЗаписиПароль);
			КонецЕсли;
			ПолучитьФайлЗаписиПоHttpСсылке(ПараметрыЗаписи, , ДанныеАвторизации);
			
		ИначеЕсли НастройкиХраненияЗаписейАТС.ВариантДоступаКЗаписям = 1 Тогда  // ftp
			ПолучитьФайлЗаписиПоFtp(ПараметрыЗаписи, НастройкиХраненияЗаписейАТС);
	
		ИначеЕсли НастройкиХраненияЗаписейАТС.ВариантДоступаКЗаписям = 2 Тогда  // samba
			ПолныйПутьКФайлу = НастройкиХраненияЗаписейАТС.ЗаписиНачальныйКаталог + ФайлЗаписиСсылка;
			ВыбФайл = Новый Файл(ПолныйПутьКФайлу);		
			Если ВыбФайл.Существует() Тогда
				НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтотОбъект), ПолныйПутьКФайлу);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПолучитьФайлыЗаписиПоHttpСсылкам(ПараметрыЗаписи, МассивСсылок)
	
	// скачиваем все файлы	
	Если МассивСсылок.Количество() > 0 Тогда
		МассивЗаписей = Новый Массив;
		ДополнительныеПараметры = Новый Структура("ИДВАТС, ПараметрыЗаписи, МассивСсылок, НомерТекущейЗаписи, МассивЗаписей", ПараметрыЗаписи.ИДВАТС, ПараметрыЗаписи, МассивСсылок, 1, МассивЗаписей);
		ДополнительныеПараметры.Вставить("ДождатьсяЗавершения", Ложь);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаписиФайлаИзМассива", ЭтотОбъект, ДополнительныеПараметры);
		ДополнительныеПараметры.ПараметрыЗаписи.Вставить("ФайлЗаписиСсылка", МассивСсылок[0]);
		ПолучитьФайлЗаписиПоHttpСсылке(ДополнительныеПараметры.ПараметрыЗаписи, ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписиФайлаИзМассива(ДополнительныеПараметры) Экспорт
		
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ИДВАТС") И ДополнительныеПараметры.ИДВАТС = "uis" Тогда			
			Если ДополнительныеПараметры.НомерТекущейЗаписи < ДополнительныеПараметры.МассивСсылок.Количество() Тогда
				НомерТекущейЗаписи = ДополнительныеПараметры.НомерТекущейЗаписи;
				ДополнительныеПараметры.НомерТекущейЗаписи = НомерТекущейЗаписи + 1;
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаписиФайлаИзМассива", ЭтотОбъект, ДополнительныеПараметры);
				ДополнительныеПараметры.ПараметрыЗаписи.Вставить("ФайлЗаписиСсылка", ДополнительныеПараметры.МассивСсылок[НомерТекущейЗаписи]);
				ПолучитьФайлЗаписиПоHttpСсылке(ДополнительныеПараметры.ПараметрыЗаписи, ОписаниеОповещения);
			Иначе
				// все файлы скачаны
				Если ДополнительныеПараметры.МассивЗаписей.Количество() > 0 Тогда
					ДополнительныеПараметры.НомерТекущейЗаписи = 1;
					ДополнительныеПараметры.ДождатьсяЗавершения = Ложь;
					ДополнительныеПараметры.Вставить("ЗапуститьПослеСкачивания", ДополнительныеПараметры.ПараметрыЗаписи.ЗапуститьПослеСкачивания);
					Если ДополнительныеПараметры.ПараметрыЗаписи.ЗапуститьПослеСкачивания Тогда
						НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтотОбъект, ДополнительныеПараметры), ДополнительныеПараметры.МассивЗаписей[0]);//, , Истина);
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// получает файл записи по http-ссылке
// ПараметрыЗаписи - структура с данными записи: ФайлЗаписиСсылка - http-ссылка
// ОписаниеОповещенияПослеЗаписиФайла - ОписаниеОповещения, если после скачивание требуется что-то сделать
//										Для uis записи могут приходить массивом, скачиваем попеременно
// ДанныеАвторизации - структура(Логин, Пароль), если надо авторизоваться для скачивания файла
Процедура ПолучитьФайлЗаписиПоHttpСсылке(ПараметрыЗаписи, 
										Знач ОписаниеОповещенияПослеЗаписиФайла = Неопределено, 
										ДанныеАвторизации = Неопределено) Экспорт
	
	ФайлЗаписиСсылка = ПараметрыЗаписи.ФайлЗаписиСсылка;
	Адрес="";
	РазделительСхемы = "://"; 
	ПозицияСхемы = СтрНайти(ПараметрыЗаписи.ФайлЗаписиСсылка, РазделительСхемы);
	Если ПозицияСхемы = 0 Тогда
		Возврат;
	КонецЕсли; 
	Схема = Лев(ФайлЗаписиСсылка, ПозицияСхемы-1) + РазделительСхемы;
	
	ПутьСсылки = СтрЗаменить(ФайлЗаписиСсылка,Схема,"");	
	Колво = СтрЧислоВхождений(ПутьСсылки,"/");
	Для Индекс=1 По Колво Цикл		
		Позиция = СтрНайти(ПутьСсылки,"/");
		Если Позиция > 0 Тогда				
			Если Индекс=1 Тогда
				Адрес = Лев(ПутьСсылки, Позиция-1);
			КонецЕсли;		
			ПутьСсылки = Сред(ПутьСсылки, Позиция+1);			
		КонецЕсли;	
	КонецЦикла;
	
	Таймаут=10;
	ssl = Новый ЗащищенноеСоединениеOpenSSL;
	
	Если Схема="https://" Тогда	
		HTTPСоединение=Новый HTTPСоединение(Адрес,,,,,,ssl);
	ИначеЕсли Схема="http://" Тогда
		HTTPСоединение=Новый HTTPСоединение(Адрес);
	Иначе
		Возврат;
	КонецЕсли;
	
	Заголовки = Новый Соответствие();
	//#12338 
	Если НЕ ДанныеАвторизации = Неопределено Тогда
   		Заголовки.Вставить("Authorization", "Basic " + ПолучитьBase64ЗаголовокАвторизации(ДанныеАвторизации.Логин, ДанныеАвторизации.Пароль));
	КонецЕсли;
	 
	АдресПуть = СтрЗаменить(ФайлЗаписиСсылка, Схема+Адрес, "");
	HTTPЗапрос = Новый HTTPЗапрос(АдресПуть, Заголовки);
	//HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос); // post	
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);                // get
	
	Если ПараметрыЗаписи.Свойство("ИДВАТС") И ПараметрыЗаписи.ИДВАТС = "phonet" Тогда
		// может быть несколько редиректов
		МаксРедирект = 0;
		Пока Истина Цикл
			МаксРедирект = МаксРедирект + 1;
			Если HTTPОтвет.КодСостояния > 300 И HTTPОтвет.КодСостояния < 309 Тогда
				
				ПутьРедиректа = HTTPОтвет.Заголовки.Получить("Location");
				Если ЗначениеЗаполнено(ПутьРедиректа) Тогда
					
					ПозицияСхемы=СтрНайти(ПутьРедиректа,"://");
					Если ПозицияСхемы>0 Тогда
						ПозицияСхемы=ПозицияСхемы+3;
						ПозицияПути=СтрНайти(ПутьРедиректа,"/",,ПозицияСхемы);
						Если ПозицияПути>0 Тогда
							
							ДоменРедиректа=Сред(ПутьРедиректа,ПозицияСхемы,ПозицияПути-ПозицияСхемы);
							ПутьРедиректа=Сред(ПутьРедиректа,ПозицияПути);
							
							HTTPСоединение=Новый HTTPСоединение(ДоменРедиректа,,,,,Таймаут,ssl);
							HTTPЗапрос=Новый HTTPЗапрос(ПутьРедиректа);					
							HTTPОтвет=HTTPСоединение.Получить(HTTPЗапрос); 
							
						КонецЕсли; 
						
					КонецЕсли;			
				КонецЕсли;
			Иначе
				Прервать;
			КонецЕсли;
			
			Если МаксРедирект > 10 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Если HTTPОтвет.КодСостояния = 200 Тогда
		ФайлЗаписи = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
		
		//#12338 
		Контент = HTTPОтвет.Заголовки.Получить("Content-Disposition");
		Если НЕ Контент = Неопределено Тогда
			//attachment; filename="ИмяФайла.mp3"
			Поз1 = СтрНайти(Контент, "filename=""");
			Если НЕ Поз1 = 0 Тогда
				Поз2 = СтрНайти(Контент, """", , Поз1 + 11);
				Если НЕ Поз2 = 0 Тогда
					ПутьСсылки = Сред(Контент, Поз1 + 10, Поз2 - (Поз1+10));
				КонецЕсли;
			Иначе	
				Поз1 = СтрНайти(Контент, "filename="); // uis вариант без кавычек
				Если НЕ Поз1 = 0 Тогда
					ПутьСсылки = Сред(Контент, Поз1 + 9);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ПутьСсылки = СтрЗаменить(ПутьСсылки, ":", "_"); // OnlinePBX
		
		ПозЗнак = СтрНайти(ПутьСсылки, "?"); // sipuni
		Если ПозЗнак > 0 Тогда 
			ПутьСсылки = Лев(ПутьСсылки, ПозЗнак-1) + ".mp3";	
		КонецЕсли;
		
		Каталог = ПараметрыЗаписи.Каталог; //КаталогВременныхФайлов();
		Если НЕ Прав(Каталог, 1) = "\" Тогда
			Каталог = Каталог + "\";	
		КонецЕсли;
		Если ПустаяСтрока(ПутьСсылки) Тогда
			ПутьКФайлу = ПолучитьИмяВременногоФайла("mp3"); // uis 
		Иначе
			ПутьКФайлу = Каталог + ПутьСсылки;
		КонецЕсли;
		
		//++ №12346 если расширение не указано, присваиваем mp3
		// считаем нормой, если указано 3 или 4 символа и точка
		ЧислоСимволовПослеТочкиВКонце = (СтрДлина(ПутьКФайлу) - СтрНайти(ПутьКФайлу, ".", НаправлениеПоиска.СКонца));
		
		Если НЕ (ЧислоСимволовПослеТочкиВКонце = 3 Или ЧислоСимволовПослеТочкиВКонце = 4) Тогда
			
			ПутьКФайлу = ПутьКФайлу + ".mp3";
			
		КонецЕсли;
		//-- №12346
		
		ПараметрыЗаписи.Вставить("ПолныйПутьКФайлу", ПутьКФайлу);
		Если ОписаниеОповещенияПослеЗаписиФайла = Неопределено Тогда
			ФайлЗаписи.НачатьЗапись(Новый ОписаниеОповещения("ПослеЗаписиФайла", ЭтотОбъект, ПараметрыЗаписи), ПутьКФайлу);
		Иначе
			ОписаниеОповещенияПослеЗаписиФайла.ДополнительныеПараметры.МассивЗаписей.Добавить(ПутьКФайлу);
			ФайлЗаписи.НачатьЗапись(ОписаниеОповещенияПослеЗаписиФайла, ПутьКФайлу);
		КонецЕсли;
	Иначе
		//#12338
		Сообщить("Ошибка получения файла записи: код " + HTTPОтвет.КодСостояния);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьФайлЗаписиПоFtp(ПараметрыЗаписи, НастройкиХраненияЗаписейАТС)
	
	Соединение = Неопределено;
	Попытка
		Соединение = Новый FTPСоединение(
			НастройкиХраненияЗаписейАТС.ЗаписиХост, // адрес ftp сервера
			НастройкиХраненияЗаписейАТС.ЗаписиПорт, // порт сервера
			НастройкиХраненияЗаписейАТС.ЗаписиЛогин, // имя пользователя
			НастройкиХраненияЗаписейАТС.ЗаписиПароль, // пароль пользователя
			Неопределено, // прокси не используется
			НастройкиХраненияЗаписейАТС.РежимFTPПассивный, //Истина, // пассивный режим работы
			0, // таймаут (0 - без ограничений)
			Неопределено); // незащищенное соединение
	Исключение
	КонецПопытки;
	Если НЕ Соединение = Неопределено Тогда
		Соединение.УстановитьТекущийКаталог(?(ПустаяСтрока(НастройкиХраненияЗаписейАТС.ЗаписиНачальныйКаталог), "/", НастройкиХраненияЗаписейАТС.ЗаписиНачальныйКаталог));
		
		ИмяФайла = ПараметрыЗаписи.ФайлЗаписиСсылка;
		ПозСлеш = СтрНайти(ИмяФайла, "\", НаправлениеПоиска.СКонца);
		Если ПозСлеш > 0 Тогда				 
			ИмяФайла = Прав(ИмяФайла, СтрДлина(ИмяФайла) - ПозСлеш);
		КонецЕсли;
		ИмяФайла = ПараметрыЗаписи.Каталог + ИмяФайла;
		// использовать прямые слеши /
		Соединение.Получить(
			СтрЗаменить(ПараметрыЗаписи.ФайлЗаписиСсылка, "\", "/"), // что качаем
			СтрЗаменить(ИмяФайла, "\", "/") // куда качаем
			);
		НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтотОбъект), ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСсылкуНаЗаписьOnPbx(ПараметрыЗаписи, Скачать)
	
	//используем ПараметрыЗаписи.ИдЗвонка
	Если Скачать Тогда
		Оповестить("ПолучитьСсылкуНаЗаписьOnPbxСкачать", ПараметрыЗаписи);
	Иначе
		Оповестить("ПолучитьСсылкуНаЗаписьOnPbxОткрыть", ПараметрыЗаписи);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСсылкуНаЗаписьBinotel(ПараметрыЗаписи, Скачать)
	
	//используем ПараметрыЗаписи.ИдЗвонка
	Если Скачать Тогда
		Оповестить("ПолучитьСсылкуНаЗаписьBinotelСкачать", ПараметрыЗаписи);
	Иначе
		Оповестить("ПолучитьСсылкуНаЗаписьBinotelОткрыть", ПараметрыЗаписи);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСсылкуНаЗаписьMango(ПараметрыЗаписи, Скачать)
	
	// ПараметрыЗаписи.ФайлЗаписиСсылка = ФайлЗаписиИД
	Если Скачать Тогда
		Оповестить("ПолучитьСсылкуНаЗаписьMangoСкачать", ПараметрыЗаписи);
	Иначе
		Оповестить("ПолучитьСсылкуНаЗаписьMangoОткрыть", ПараметрыЗаписи);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСсылкуНаЗаписьBeeline(ПараметрыЗаписи, Скачать)
	
	// ПараметрыЗаписи.ФайлЗаписиСсылка = ФайлЗаписиИД
	Если Скачать Тогда
		Оповестить("ПолучитьСсылкуНаЗаписьBeelineСкачать", ПараметрыЗаписи);
	Иначе
		Оповестить("ПолучитьСсылкуНаЗаписьBeelineОткрыть", ПараметрыЗаписи);
	КонецЕсли;
	
КонецФункции

Процедура ПослеЗаписиФайла(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ЗапуститьПослеСкачивания") И ДополнительныеПараметры.ЗапуститьПослеСкачивания Тогда
		НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтотОбъект), ДополнительныеПараметры.ПолныйПутьКФайлу);
	Иначе
		ПоказатьОповещениеПользователя("Файл скачан", , ДополнительныеПараметры.ПолныйПутьКФайлу);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершитьЗапускПриложения(КодВозврата, ДополнительныеПараметры) Экспорт
	//не удалять
	
	// "uis" - попеременное открытие ссылок или открытие скачанных файлов 
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ИДВАТС") И ДополнительныеПараметры.ИДВАТС = "uis" Тогда			
			Если ДополнительныеПараметры.НомерТекущейЗаписи < ДополнительныеПараметры.МассивЗаписей.Количество() Тогда
				НомерТекущейЗаписи = ДополнительныеПараметры.НомерТекущейЗаписи;
				ДополнительныеПараметры.НомерТекущейЗаписи = НомерТекущейЗаписи + 1;
				Если ДополнительныеПараметры.Свойство("ЗапуститьПослеСкачивания") Тогда 
					Если ДополнительныеПараметры.ЗапуститьПослеСкачивания Тогда
						НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтотОбъект, ДополнительныеПараметры), ДополнительныеПараметры.МассивЗаписей[НомерТекущейЗаписи], , ДополнительныеПараметры.ДождатьсяЗавершения);
					Иначе
						ПоказатьОповещениеПользователя("Файл скачан", , ДополнительныеПараметры.МассивЗаписей[НомерТекущейЗаписи]);
					КонецЕсли;
				Иначе
					НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтотОбъект, ДополнительныеПараметры), ДополнительныеПараметры.МассивЗаписей[НомерТекущейЗаписи], , ДополнительныеПараметры.ДождатьсяЗавершения);					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// функция нужна на клиенте при разных часовых поясах
// например для OnlinePBX
Функция ДатаИзUT(UT) Экспорт
	
	// UnixTime -> Дата
	ДатаЧисло=0;
	Попытка
		ДатаЧисло=Число(UT);
	Исключение
	КонецПопытки;
	
	Возврат МестноеВремя(Дата('19700101000000')+ДатаЧисло);
	
КонецФункции

// Обработчик динамически подключаемой команды звонка
//
// Команда  - КомандаФормы - подключаемая команда формы.
// Источник - ТаблицаФормы, ДанныеФормыСтруктура - источник объектов печати (Форма.Объект, Форма.Элементы.Список)
Процедура ВыполнитьИсходящийЗвонок(Знач Команда, Знач Форма, Знач Источник) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПозвонитьЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	Если ТипЗнч(Источник) = Тип("ДанныеФормыСтруктура") Тогда
		ПараметрыФормы.Вставить("СсылкаОбъект", Источник.Ссылка);        // с формы объекта
		Если Источник.Свойство("Контрагент") Тогда
			ПараметрыФормы.Вставить("СсылкаОбъект", Источник.Контрагент);	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник) = Тип("ТаблицаФормы") Тогда
		ПараметрыФормы.Вставить("СсылкаОбъект", Источник.ТекущаяСтрока); // с формы списка
	ИначеЕсли ТипЗнч(Источник) = Тип("Строка") Тогда	
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Источник);		 // передан номер телефона
		Возврат;
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.Сотрудники") Тогда	
		ПараметрыФормы.Вставить("СсылкаОбъект", Источник);		 		 // замерщик с формы заказ-договора
	Иначе
		Возврат;
	КонецЕсли;	
 	
	ОткрытьФорму("Обработка.ПанельСофтФонУниверсальная.Форма.ФормаВыбораКонтакта", ПараметрыФормы, ,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПозвонитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НомерТелефона = Результат;
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		ПозвонитьПоНомеру(НомерТелефона); 
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьBase64ЗаголовокАвторизации(ИмяПользователя, Пароль)

    КодировкаФайла = КодировкаТекста.UTF8;
    ВременныйФайл = ПолучитьИмяВременногоФайла();
    Запись = Новый ЗаписьТекста(ВременныйФайл, КодировкаФайла);
    Запись.Записать(ИмяПользователя+":"+Пароль);
    Запись.Закрыть();

    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
    Результат = Base64Строка(ДвДанные);
    УдалитьФайлы(ВременныйФайл);

    Результат = Сред(Результат,5);

    Возврат Результат;

КонецФункции
