
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЗаказДоговоров.Ссылка КАК Ссылка,
	|	ВидыЗаказДоговоров.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыЗаказДоговоров КАК ВидыЗаказДоговоров
	|ГДЕ
	|	НЕ ВидыЗаказДоговоров.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);		
	КонецЦикла;
	
КонецПроцедуры
