&НаКлиенте
Процедура ПанельНастроек(Команда)
    Эл = Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек;
    Эл.Пометка = Не Эл.Пометка;
    Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Эл.Пометка;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек.Пометка = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
    Элементы.ВариантОтчета.Заголовок = "Вариант отчета: " + ПредставлениеТекущегоВарианта;
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
    Эл = Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек;
    Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Эл.Пометка;
КонецПроцедуры