
#Область ПеременныеФормы

&НаСервере
Перем СписокКонтрагентов, СписокНоменклатуры, СписокСотрудников, СписокСкладов, СписокДоговоров;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Объект.ВидыДокументов.Добавить("АвансовыйОтчет", 				"Авансовый отчет");
	Объект.ВидыДокументов.Добавить("ВозвратТовараОтПокупателя", 	"Возврат товаров от покупателя"); //#14475
	Объект.ВидыДокументов.Добавить("ВозвратТовараПоставщику", 		"Возврат товара поставщику"); // #15677
	Объект.ВидыДокументов.Добавить("ВыпускПродукции", 				"Выпуск продукции");
	Объект.ВидыДокументов.Добавить("КорректировкаДолга", 			"Корректировка долга"); // #15677
	Объект.ВидыДокументов.Добавить("Монтаж", 						"Монтаж"); // №12409
	Объект.ВидыДокументов.Добавить("ОплатаБанковскойКартой", 		"Оплата банковской картой"); // #15677
	Объект.ВидыДокументов.Добавить("ОприходованиеТоваров", 			"Оприходование товаров"); // №12409
	Объект.ВидыДокументов.Добавить("ПоступлениеНаРасчетныйСчет", 	"Поступление на расчетный счет");
	Объект.ВидыДокументов.Добавить("ПоступлениеТоваровИУслуг", 		"Поступление товаров и услуг");
	Объект.ВидыДокументов.Добавить("ПриходныйКассовыйОрдер", 		"Приходный кассовый ордер");
	Объект.ВидыДокументов.Добавить("РасходныйКассовыйОрдер", 		"Расходный кассовый ордер");
	Объект.ВидыДокументов.Добавить("РеализацияТоваровИУслуг", 		"Реализация товаров и услуг");
	Объект.ВидыДокументов.Добавить("СписаниеСРасчетногоСчета", 		"Списание с расчетного счета");
	Объект.ВидыДокументов.Добавить("СписаниеТоваров", 				"Списание товаров"); // №12409
	Объект.ВидыДокументов.Добавить("СчетФактураВыданный", 			"Счет-фактура выданный");
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	ВыбранныеТипыДокументов = Новый СписокЗначений;
	Для каждого СтрокаСЗ из Объект.ВидыДокументов Цикл
		Если СтрокаСЗ.Пометка Тогда
			ВыбранныеТипыДокументов.Добавить(СтрокаСЗ.Значение);	
		КонецЕсли;
	КонецЦикла;
	Настройки.Вставить("ВыбранныеТипыДокументов", ВыбранныеТипыДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ТипЗнч(Настройки) = Тип("Соответствие") Тогда
		ВыбранныеТипыДокументов = Настройки.Получить("ВыбранныеТипыДокументов");
		Если НЕ ВыбранныеТипыДокументов = Неопределено Тогда
			Для каждого СтрокаСЗ из ВыбранныеТипыДокументов Цикл
				СтрокаВидаДокумента = Объект.ВидыДокументов.НайтиПоЗначению(СтрокаСЗ.Значение);
				Если НЕ СтрокаВидаДокумента = Неопределено Тогда
					СтрокаВидаДокумента.Пометка = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДокументыCRMПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДокументыCRM.ТекущиеДанные;
	Если ТекущиеДанные.ЕстьКритичныеОшибки И ТекущиеДанные.Пометка Тогда
		ТекущиеДанные.Пометка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыCRMВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(,  Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// 
	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента 		= ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных("ДокументыCRM");
	
	ГруппаОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"Объект.ДокументыCRM.НеНайденаНоменклатура", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
		ГруппаОтбора2 = ГруппаОтбора.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
					
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора2,
			"Объект.ДокументыCRM.Контрагент", ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора2,
			"Объект.ДокументыCRM.НеТребуетсяКонтрагент", ВидСравненияКомпоновкиДанных.Равно, Ложь);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	//
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДокументыCRM");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ДокументыCRM.ЕстьКритичныеОшибки", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина));
	
	//
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДокументыCRMПометка");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ДокументыCRM.ЕстьКритичныеОшибки", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность",    Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
КонецПроцедуры

&НаСервере
Функция ИмяПоЗначениюПеречисления(ИмяПеречисления, ЗначениеПеречисления)
		
	ИндексЗначения = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);	
	ИмяЗначения    = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления.Получить(ИндексЗначения).Имя;
	Возврат ИмяЗначения;	
		
КонецФункции

//++ #15677
&НаСервере
Функция ДобавитьИерархиюНоменклатуры(НоменклатураСсылка, СписокНоменклатуры)
	
	ТекНоменклатура = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураСсылка, "Родитель");
	Если ЗначениеЗаполнено(ТекНоменклатура) Тогда
		Если СписокНоменклатуры.НайтиПоЗначению(ТекНоменклатура) = Неопределено Тогда				
			СписокНоменклатуры.Добавить(ТекНоменклатура);
			ДобавитьИерархиюНоменклатуры(ТекНоменклатура, СписокНоменклатуры);	
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
//-- #15677

#КонецОбласти

&НаКлиенте
Процедура ВидыДокументовПометкаПриИзменении(Элемент)
	
	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ДокументыCRM Цикл
		Если СтрокаТЧ.ЕстьКритичныеОшибки Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого Строка Из Объект.ДокументыCRM Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДокументы(Команда)
	ПолучитьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДокументыНаСервере()
	
	Объект.ДокументыCRM.Очистить();
	//Объект.Товары.Очистить();
	//Объект.Услуги.Очистить();
	
	Для Каждого ВидДок Из Объект.ВидыДокументов Цикл
		
		Если Не ВидДок.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = новый Запрос;
		Запрос.УстановитьПараметр("ИНН", Объект.Организация.ИНН);
		Запрос.УстановитьПараметр("НачПериода", НачалоДня(Объект.ПериодОтбора.ДатаНачала));
		Запрос.УстановитьПараметр("КонПериода", КонецДня(Объект.ПериодОтбора.ДатаОкончания));
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументДляЗагрузки.Ссылка КАК Ссылка,
		|	ДокументДляЗагрузки.Дата КАК Дата,
		|	ДокументДляЗагрузки.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА ДокументДляЗагрузки.ПометкаУдаления = ИСТИНА
		|			ТОГДА 2
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ДокументДляЗагрузки.Проведен = ИСТИНА
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК СостояниеДокумента,
		|	ПРЕДСТАВЛЕНИЕ(ТИПЗНАЧЕНИЯ(ДокументДляЗагрузки.Ссылка)) КАК ВидДокумента,
		|	ДокументДляЗагрузки.Организация.ИНН КАК Организация,";
		
		//++ №12409 поля смотрим по метаданным, чтобы не делать кучу условий по видам документов (кроме обращения через точку)
		ВозможныеПоля = новый Соответствие;
		ВозможныеПоля.Вставить("Контрагент", 		"Контрагент");
		ВозможныеПоля.Вставить("СуммаДокумента",	"Сумма");
		ВозможныеПоля.Вставить("Сумма",				"Сумма");
		ВозможныеПоля.Вставить("ВхНомер",			"НомерВходящегоДокумента");
		ВозможныеПоля.Вставить("ВхДата",	 		"ДатаВходящегоДокумента");
		ВозможныеПоля.Вставить("Комментарий", 		"Комментарий");
		ВозможныеПоля.Вставить("Сотрудник", 		"Сотрудник");
		
		Для Каждого ВозможноеПоле Из ВозможныеПоля Цикл
			
			Если Метаданные.Документы[СокрЛП(ВидДок.Значение)].Реквизиты.Найти(ВозможноеПоле.Ключ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос.Текст = Запрос.Текст + СтрШаблон("
			|	ДокументДляЗагрузки.%1 КАК %2,", ВозможноеПоле.Ключ, ВозможноеПоле.Значение);
			
		КонецЦикла;
		//-- №12409
		
		//++ №12409 комментируем, т.к. выше реализовано по новому
		//Если Не ВидДок.Значение = "АвансовыйОтчет" И НЕ ВидДок.Значение = "ВыпускПродукции" Тогда
		//	Запрос.Текст = Запрос.Текст + "
		//	|	ДокументДляЗагрузки.Контрагент КАК Контрагент,";
		//	Если ВидДок.Значение = "РеализацияТоваровИУслуг" Тогда
		//		Запрос.Текст = Запрос.Текст + "
		//		|	ДокументДляЗагрузки.СуммаДокумента КАК Сумма,";
		//	ИначеЕсли ВидДок.Значение = "ПоступлениеТоваровИУслуг" Тогда
		//		Запрос.Текст = Запрос.Текст + "
		//		|	ДокументДляЗагрузки.СуммаДокумента КАК Сумма,
		//		|	ДокументДляЗагрузки.ВхНомер КАК НомерВходящегоДокумента,
		//		|	ДокументДляЗагрузки.ВхДата КАК ДатаВходящегоДокумента,";
		//	ИначеЕсли НЕ ВидДок.Значение = "СчетФактураВыданный" Тогда
		//		Запрос.Текст = Запрос.Текст + "
		//		|	ДокументДляЗагрузки.Сумма КАК Сумма,";
		//	КонецЕсли;
		//	Запрос.Текст = Запрос.Текст + "
		//	|	ДокументДляЗагрузки.Комментарий КАК Комментарий,"
		//КонецЕсли;
		//
		//Если ВидДок.Значение = "АвансовыйОтчет" ИЛИ ВидДок.Значение = "ПриходныйКассовыйОрдер" ИЛИ ВидДок.Значение = "РасходныйКассовыйОрдер" Тогда
		//	Запрос.Текст = Запрос.Текст + "
		//	|	ДокументДляЗагрузки.Сотрудник КАК Сотрудник,";
		//КонецЕсли;
		//-- №12409 комментируем, т.к. выше реализовано по новому
		
		Если НЕ ВидДок.Значение = "ВыпускПродукции"
			И НЕ ВидДок.Значение = "СписаниеТоваров" // №12409
			И НЕ ВидДок.Значение = "КорректировкаДолга"
		Тогда
			
		    Запрос.Текст = Запрос.Текст + "
			|	ДокументДляЗагрузки.Валюта.Код КАК Валюта,";
			
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "		
		|	Истина КАК Пометка
		//|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДокументДляЗагрузки.Ссылка) КАК Представление
		|ИЗ
		|	Документ." + СокрЛП(ВидДок.Значение) + " КАК ДокументДляЗагрузки
		|ГДЕ
		|	ДокументДляЗагрузки.Организация.ИНН = &ИНН
		|	И ДокументДляЗагрузки.Дата МЕЖДУ &НачПериода И &КонПериода";		
		
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаДокумента = Объект.ДокументыCRM.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, Выборка);
			СтрокаДокумента.Организация = Объект.Организация;
			
			СтрокаДокумента.НеТребуетсяКонтрагент = (СтрокаДокумента.ВидДок = "ВыпускПродукции" 
												 ИЛИ СтрокаДокумента.ВидДок = "КорректировкаДолга");
			
			Попытка
				СтрокаДокумента.Контрагент = Выборка.Контрагент;
			Исключение
			КонецПопытки;
			
			Если НЕ ЗначениеЗаполнено(СтрокаДокумента.Контрагент) Тогда
				Попытка
					СтрокаДокумента.Контрагент = Выборка.Сотрудник;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			//НовДок.Валюта = Справочники.Валюты.НайтиПоКоду(СокрЛП(Выборка.Валюта));
			СтрокаДокумента.ВидДок = ВидДок.Значение;
			
			//получим табличные части документа
			//Если НовДок.ВидДок = "АвансовыйОтчет" 
			//	ИЛИ НовДок.ВидДок = "РеализацияТоваровИУслуг"
			//	ИЛИ НовДок.ВидДок = "ПоступлениеТоваровИУслуг" Тогда
			//	
			//	//товары
			//	ПодЗапрос = новый Запрос;
			//	ПодЗапрос.Текст = 
			//	"ВЫБРАТЬ
			//	|	ТабличнаяЧастьДокумента.Номенклатура.Наименование КАК НоменклатураСтрокой,
			//	|	ТабличнаяЧастьДокумента.Номенклатура.Код КАК НоменклатураСтрокойКод,
			//	|	ТабличнаяЧастьДокумента.Количество * ТабличнаяЧастьДокумента.Коэффициент КАК Количество,
			//	|	ТабличнаяЧастьДокумента.Цена КАК Цена,
			//	|	ТабличнаяЧастьДокумента.Сумма КАК Сумма,
			//	|	ТабличнаяЧастьДокумента.СтавкаНДС КАК СтавкаНДС,
			//	|	ТабличнаяЧастьДокумента.СуммаНДС КАК СуммаНДС
			//	|	ИЗ
			//	|		Документ."+НовДок.ВидДок+".Товары КАК ТабличнаяЧастьДокумента
			//	|	ГДЕ
			//	|		ТабличнаяЧастьДокумента.Ссылка ССЫЛКА Документ."+НовДок.ВидДок+"
			//	|		И ТабличнаяЧастьДокумента.Ссылка.Номер = &Номер
			//	|		И ТабличнаяЧастьДокумента.Ссылка.Дата = &Дата";
			//	ПодЗапрос.УстановитьПараметр("Номер", НовДок.Номер);
			//	ПодЗапрос.УстановитьПараметр("Дата", НовДок.Дата);
			//	
			//	ПодВыборка = ПодЗапрос.Выполнить().Выбрать();
			//	Пока ПодВыборка.Следующий() Цикл
			//		НоваяСтрока = Объект.Товары.Добавить();
			//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПодВыборка);
			//		НоваяСтрока.Номер = НовДок.Номер;
			//		НоваяСтрока.Дата = НовДок.Дата;
			//		НоваяСтрока.ВидДок = НовДок.ВидДок;
			//		НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НоваяСтрока.НоменклатураСтрокой);
			//		Если НоваяСтрока.Номенклатура.Пустая() Тогда
			//			НовДок.НеНайденаНоменклатура = Истина;
			//		КонецЕсли;
			//		НоваяСтрока.ИндексСтроки = Объект.Товары.Количество();
			//	КонецЦикла;
			//	
			//	//услуги
			//	ПодЗапрос = новый Запрос;;
			//	ПодЗапрос.Текст = 
			//	"ВЫБРАТЬ
			//	|	ТабличнаяЧастьДокумента.Номенклатура.Наименование КАК НоменклатураСтрокой,
			//	|	ТабличнаяЧастьДокумента.Номенклатура.Код КАК НоменклатураСтрокойКод,
			//	|	ТабличнаяЧастьДокумента.Количество * ТабличнаяЧастьДокумента.Коэффициент КАК Количество,
			//	|	ТабличнаяЧастьДокумента.Цена КАК Цена,
			//	|	ТабличнаяЧастьДокумента.Сумма КАК Сумма,
			//	|	ТабличнаяЧастьДокумента.СтавкаНДС КАК СтавкаНДС,
			//	|	ТабличнаяЧастьДокумента.СуммаНДС КАК СуммаНДС
			//	|	ИЗ
			//	|		Документ."+НовДок.ВидДок+".Услуги КАК ТабличнаяЧастьДокумента
			//	|	ГДЕ
			//	|		ТабличнаяЧастьДокумента.Ссылка ССЫЛКА Документ."+НовДок.ВидДок+"
			//	|		И ТабличнаяЧастьДокумента.Ссылка.Номер = &Номер
			//	|		И ТабличнаяЧастьДокумента.Ссылка.Дата = &Дата";
			//	ПодЗапрос.УстановитьПараметр("Номер", НовДок.Номер);
			//	ПодЗапрос.УстановитьПараметр("Дата", НовДок.Дата);
			//	
			//	ПодВыборка = ПодЗапрос.Выполнить().Выбрать();
			//	Пока ПодВыборка.Следующий() Цикл
			//		НоваяСтрока = Объект.Услуги.Добавить();
			//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПодВыборка);
			//		НоваяСтрока.Номер = НовДок.Номер;
			//		НоваяСтрока.Дата = НовДок.Дата;
			//		НоваяСтрока.ВидДок = НовДок.ВидДок;
			//		НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НоваяСтрока.НоменклатураСтрокой);
			//		Если НоваяСтрока.Номенклатура.Пустая() Тогда
			//			НовДок.НеНайденаНоменклатура = Истина;
			//		КонецЕсли;
			//		НоваяСтрока.ИндексСтроки = Объект.Услуги.Количество();
			//	КонецЦикла;
			//	
			//КонецЕсли;
			//
			////получим материалы выпуска продукции
			//Если НовДок.ВидДок = "ВыпускПродукции" Тогда
			//	
			//	//товары
			//	ПодЗапрос = новый Запрос;;
			//	ПодЗапрос.Текст = "ВЫБРАТЬ
			//	|	ТабличнаяЧастьДокумента.Номенклатура.Наименование КАК НоменклатураСтрокой,
			//	|	ТабличнаяЧастьДокумента.Номенклатура.Код КАК НоменклатураСтрокойКод,
			//	|	ТабличнаяЧастьДокумента.КоличествоКВыработке КАК Количество				
			//	|	ИЗ
			//	|		Документ."+НовДок.ВидДок+".Материалы КАК ТабличнаяЧастьДокумента
			//	|	ГДЕ
			//	|		ТабличнаяЧастьДокумента.Ссылка ССЫЛКА Документ."+НовДок.ВидДок+"
			//	|		И ТабличнаяЧастьДокумента.Ссылка.Номер = &Номер
			//	|		И ТабличнаяЧастьДокумента.Ссылка.Дата = &Дата";
			//	ПодЗапрос.УстановитьПараметр("Номер", НовДок.Номер);
			//	ПодЗапрос.УстановитьПараметр("Дата", НовДок.Дата);
			//	
			//	ПодВыборка = ПодЗапрос.Выполнить().Выбрать();
			//	Пока ПодВыборка.Следующий() Цикл
			//		НоваяСтрока = Объект.Товары.Добавить();
			//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПодВыборка);
			//		НоваяСтрока.Номер = НовДок.Номер;
			//		НоваяСтрока.Дата = НовДок.Дата;
			//		НоваяСтрока.ВидДок = НовДок.ВидДок;
			//		НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НоваяСтрока.НоменклатураСтрокой);
			//		Если НоваяСтрока.Номенклатура.Пустая() Тогда
			//			НовДок.НеНайденаНоменклатура = Истина;
			//		КонецЕсли;
			//		НоваяСтрока.ИндексСтроки = Объект.Товары.Количество();
			//	КонецЦикла;
			//КонецЕсли;
			
			// проверка на "критичность"
			Если СтрокаДокумента.ВидДок = "ВозвратТовараОтПокупателя" Тогда
		
				ПодЗапрос = новый Запрос;
				ПодЗапрос.УстановитьПараметр("Ссылка", Выборка.Ссылка);
				ПодЗапрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ТабличнаяЧастьДокумента.ДокументПродажи КАК ДокументПродажи
				|ИЗ
				|	Документ.ВозвратТовараОтПокупателя.Товары КАК ТабличнаяЧастьДокумента
				|ГДЕ
				|	ТабличнаяЧастьДокумента.Ссылка = &Ссылка";				
				
				ПодВыборка = ПодЗапрос.Выполнить().Выбрать();
				Если ПодВыборка.Количество() > 1 Тогда
					СтрокаДокумента.ЕстьКритичныеОшибки = Истина;
					СтрокаДокумента.ОписаниеОшибки = "в документе несколько реализаций, такой документ не может быть перенесен";
				КонецЕсли;
			КонецЕсли;
			
			// проверка на "критичность"
			Если СтрокаДокумента.ВидДок = "КорректировкаДолга" Тогда
	
				ПодЗапрос = новый Запрос;
				ПодЗапрос.УстановитьПараметр("Ссылка", Выборка.Ссылка);
				ПодЗапрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ТабличнаяЧастьДокумента.Контрагент КАК Контрагент
				|ПОМЕСТИТЬ ВТ
				|ИЗ
				|	Документ.КорректировкаДолга.УвеличениеДолга КАК ТабличнаяЧастьДокумента
				|ГДЕ
				|	ТабличнаяЧастьДокумента.Ссылка = &Ссылка
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ТабличнаяЧастьДокумента.Контрагент
				|ИЗ
				|	Документ.КорректировкаДолга.УменьшениеДолга КАК ТабличнаяЧастьДокумента
				|ГДЕ
				|	ТабличнаяЧастьДокумента.Ссылка = &Ссылка
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ТабличнаяЧастьДокумента.Контрагент
				|ИЗ
				|	Документ.КорректировкаДолга.УвеличениеДолгаПоставщиков КАК ТабличнаяЧастьДокумента
				|ГДЕ
				|	ТабличнаяЧастьДокумента.Ссылка = &Ссылка
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ТабличнаяЧастьДокумента.Контрагент
				|ИЗ
				|	Документ.КорректировкаДолга.УменьшениеДолгаПоставщиков КАК ТабличнаяЧастьДокумента
				|ГДЕ
				|	ТабличнаяЧастьДокумента.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТ.Контрагент КАК Контрагент
				|ИЗ
				|	ВТ КАК ВТ";				
				
				ПодВыборка = ПодЗапрос.Выполнить().Выбрать();
				Если ПодВыборка.Количество() > 1 Тогда
					СтрокаДокумента.ЕстьКритичныеОшибки = Истина;
					СтрокаДокумента.ОписаниеОшибки = "в документе несколько контрагентов, такой документ не может быть перенесен";
				КонецЕсли;
			КонецЕсли;
			
			СтрокаДокумента.Пометка = НЕ СтрокаДокумента.ЕстьКритичныеОшибки;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДокументы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Необходимо указать расположение файла для выгрузки данных!");
		Возврат;
	КонецЕсли;
	
	Данные = СформироватьДанныеНаСервере();
	
	//формируем jSON с данными
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(Объект.ПутьКФайлу, КодировкаТекста.UTF8,, новый ПараметрыЗаписиJSON(, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	ЗаписьJSON.Закрыть();
	
	ПоказатьОповещениеПользователя("Выгрузка завершена успешно.");
	
КонецПроцедуры

&НаСервере
Функция СформироватьДанныеНаСервере()
	
	СписокКонтрагентов 	= новый СписокЗначений;
	СписокНоменклатуры 	= новый СписокЗначений;
	СписокСотрудников  	= новый СписокЗначений;
	СписокСкладов  		= новый СписокЗначений;
	СписокДоговоров     = новый СписокЗначений;
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("Документы", 	новый Соответствие);
	СтруктураДанных.Вставить("Справочники", новый Соответствие);
	
	ВидыДокументовКВыгрузке = Объект.ДокументыCRM.Выгрузить(, "ВидДок, Пометка");
	ВидыДокументовКВыгрузке.Свернуть("ВидДок", "Пометка");
	
	Для Каждого ТекущаяСтрока Из ВидыДокументовКВыгрузке Цикл
		
		Если НЕ ТекущаяСтрока.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		СписокДокументовПоВиду = Объект.ДокументыCRM.НайтиСтроки(новый Структура("Пометка, ВидДок", Истина, ТекущаяСтрока.ВидДок));
		
		МассивСсылок = новый Массив;
		
		Для Каждого Док Из СписокДокументовПоВиду Цикл
			МассивСсылок.Добавить(Док.Ссылка);
		КонецЦикла;
		
		Выполнить("СформироватьДанныеПо_" + СокрЛП(ТекущаяСтрока.ВидДок) + "(СтруктураДанных, МассивСсылок)");
		
	КонецЦикла;
	
	// Выгрузка ссылочных объектов, участвующих в документах
	СформироватьДанныеПоУчаствующимОбъектамВДокументах(СтруктураДанных);
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "obmen_SmartCeilings_" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + ".txt";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Введите название сохраняемого файла";
	
	Фильтр =  "Файл txt|*.txt";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	
	ДиалогОткрытияФайла.Показать(новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, Параметры) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0  Тогда
		Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_ПоступлениеТоваровИУслуг(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
		|	Представление(Док.Ссылка) КАК Ссылка,
		|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
		|	Док.Дата КАК Дата,
		|	Представление(Док.Номер) КАК Номер,
	|	""00000000-0000-0000-0000-000000000000"" КАК СкладГУИД,
	|	Док.Склад КАК Склад,
		|	Представление(Док.Комментарий) КАК Комментарий,
		|	Представление(Док.Организация) КАК Организация,
		|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
	|	""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|	Док.ДоговорКонтрагента КАК Договор,
	|	Представление(ЕСТЬNULL(Док.ДоговорКонтрагента, """")) КАК ПредставлениеДоговора,
		|	Док.Контрагент КАК Контрагент,
		|	Док.Товары.(
		|		Номенклатура КАК Номенклатура,
		|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
		|		Количество * Коэффициент КАК Количество,
		|		Цена,
		|		Сумма,
		|		СтавкаНДС,
		|		СуммаНДС) КАК мТовары,
		|	Док.Услуги.(
		|		Номенклатура КАК Номенклатура,
		|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
		|		Количество * Коэффициент КАК Количество,
		|		Цена,
		|		Сумма,
		|		СтавкаНДС,
		|		СуммаНДС) КАК мУслуги,
		|	Представление(Док.СуммаДокумента) КАК Сумма,
		|	Представление(Док.ВхНомер) КАК НомерВходящегоДокумента,
		|	Док.ВхДата КАК ДатаВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА Док.ПометкаУдаления = ИСТИНА
		|			ТОГДА 2
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Док.Проведен = ИСТИНА
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|  	Документ.ПоступлениеТоваровИУслуг КАК Док
		|ГДЕ
		|   Док.Ссылка В (&МассивСсылок)
		|
		|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("ПоступлениеТоваровИУслуг", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_РеализацияТоваровИУслуг(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
	|	Представление(Док.Ссылка) КАК Ссылка,
	|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
	|	Док.Дата КАК Дата,
	|	Представление(Док.Номер) КАК Номер,
	|	""00000000-0000-0000-0000-000000000000"" КАК СкладГУИД,
	|	Док.Склад КАК Склад,
	|	Представление(Док.Комментарий) КАК Комментарий,
	|	Представление(Док.Организация) КАК Организация,
	|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
	|	""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|	Док.ДоговорКонтрагента КАК Договор,
	|	Представление(ЕСТЬNULL(Док.ДоговорКонтрагента, """")) КАК ПредставлениеДоговора,
	|	Док.Контрагент КАК Контрагент,
	|	Док.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
	|		Количество * Коэффициент КАК Количество,
	|		Цена,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС) КАК мТовары,
	|	Док.Услуги.(
	|		Номенклатура КАК Номенклатура,
	|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
	|		Количество * Коэффициент КАК Количество,
	|		Цена,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС) КАК мУслуги,
	|	Представление(Док.СуммаДокумента) КАК Сумма,
	|	ВЫБОР
	|		КОГДА Док.ПометкаУдаления = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеДокумента
	|ИЗ
	|  	Документ.РеализацияТоваровИУслуг КАК Док
	|ГДЕ
	|   Док.Ссылка В (&МассивСсылок)
	|
	|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("РеализацияТоваровИУслуг", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_ВозвратТовараОтПокупателя(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
	|	ПРЕДСТАВЛЕНИЕ(Док.Ссылка) КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
	|	Док.Дата КАК Дата,
	|	ПРЕДСТАВЛЕНИЕ(Док.Номер) КАК Номер,
	|	""00000000-0000-0000-0000-000000000000"" КАК СкладГУИД,
	|	Док.Склад КАК Склад,
	|	ПРЕДСТАВЛЕНИЕ(Док.Комментарий) КАК Комментарий,
	|	ПРЕДСТАВЛЕНИЕ(Док.Организация) КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Док.Организация.ИНН) КАК ОрганизацияИНН,
	|	""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|	Док.ДоговорКонтрагента КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(Док.ДоговорКонтрагента, """")) КАК ПредставлениеДоговора,
	|	Док.Контрагент КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(Док.СуммаДокумента) КАК Сумма,
	|	ВЫБОР
	|		КОГДА Док.ПометкаУдаления = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеДокумента,
	|	Док.Товары.(
	|		""00000000-0000-0000-0000-000000000000"" КАК ДокументПродажиГУИД,
	|		ДокументПродажи КАК ДокументПродажи,
	|		Номенклатура КАК Номенклатура,
	|		ПРЕДСТАВЛЕНИЕ(Док.Товары.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|		ПРЕДСТАВЛЕНИЕ(Док.Товары.ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
	|		Док.Товары.Количество * Док.Товары.Коэффициент КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		СтавкаНДС КАК СтавкаНДС,
	|		СуммаНДС КАК СуммаНДС,
	|		0 КАК Себестоимость
	|	) КАК мТовары
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя КАК Док
	|ГДЕ
	|	Док.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОбороты.Регистратор КАК Регистратор,
	|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОбороты.КоличествоРасход КАК Количество,
	|	ТоварыНаСкладахОбороты.СуммаРасход КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыНаСкладахОбороты.КоличествоРасход = 0
	|			ТОГДА ТоварыНаСкладахОбороты.СуммаРасход / ТоварыНаСкладахОбороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Себестоимость
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, ) КАК ТоварыНаСкладахОбороты
	|ГДЕ
	|	ТоварыНаСкладахОбороты.Регистратор В(&МассивСсылок)";

	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаДанных = РезультатЗапроса[0].Выгрузить();
	
	//++ #15677
	ТаблицаСебестоимости = РезультатЗапроса[1].Выгрузить();
	Для Каждого СтрокаДокумента Из ТаблицаДанных Цикл
		Для Каждого СтрокаТаблицы Из СтрокаДокумента.мТовары Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументПродажи) Тогда
				НайденныеСтроки = ТаблицаСебестоимости.НайтиСтроки(Новый Структура("Регистратор, Номенклатура", СтрокаДокумента.СсылкаКУдалению, СтрокаТаблицы.Номенклатура));	
				Если НайденныеСтроки.Количество() > 0 Тогда
					СтрокаТаблицы.Себестоимость = НайденныеСтроки[0].Себестоимость;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	//-- #15677
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("ВозвратТовараОтПокупателя", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_ВыпускПродукции(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасходМатериаловНаПроизводствеОбороты.ДокументСписания КАК ДокументСписания,
	|	СУММА(РасходМатериаловНаПроизводствеОбороты.СуммаОборот) КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.РасходМатериаловНаПроизводстве.Обороты(, , , ДокументСписания В (&МассивСсылок)) КАК РасходМатериаловНаПроизводствеОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходМатериаловНаПроизводствеОбороты.ДокументСписания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
	|	ПРЕДСТАВЛЕНИЕ(Док.Ссылка) КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
	|	Док.Дата КАК Дата,
	|	ПРЕДСТАВЛЕНИЕ(Док.Номер) КАК Номер,
	|	""00000000-0000-0000-0000-000000000000"" КАК СкладГУИД,
	|	Док.СкладПродукции КАК Склад,
	|	ПРЕДСТАВЛЕНИЕ(Док.Комментарий) КАК Комментарий,
	|	ПРЕДСТАВЛЕНИЕ(Док.Организация) КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Док.Организация.ИНН) КАК ОрганизацияИНН,
	|	ПРЕДСТАВЛЕНИЕ(Док.Подразделение) КАК Подразделение,
	|	Док.Материалы.(
	|		Номенклатура КАК Номенклатура,
	|		ПРЕДСТАВЛЕНИЕ(Док.Материалы.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|		ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(Док.Материалы.ЕдиницаИзмерения.Код, """")) КАК ЕдиницаИзмеренияКод,
	|		КоличествоКВыработке КАК Количество
	|	) КАК мТовары,
	|	ВЫБОР
	|		КОГДА Док.ПометкаУдаления = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеДокумента,
	|	Док.ПродукцияНоменклатура КАК ПродукцияНоменклатура,
	|	Док.ПродукцияНоменклатураКоличество КАК ПродукцияНоменклатураКоличество,
	|	Док.ПродукцияНоменклатураКоэффициент КАК ПродукцияНоменклатураКоэффициент,
	|	ЕСТЬNULL(РасходМатериаловНаПроизводствеОбороты.СуммаОборот, 0) КАК ПродукцияНоменклатураСуммаПлановая
	|ИЗ
	|	Документ.ВыпускПродукции КАК Док
	// #15090 получаем из ВТ, так как дублировались строки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходМатериаловНаПроизводстве.Обороты КАК РасходМатериаловНаПроизводствеОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК РасходМатериаловНаПроизводствеОбороты
	|		ПО Док.Ссылка = РасходМатериаловНаПроизводствеОбороты.ДокументСписания
	|ГДЕ
	|	Док.Ссылка В(&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("ВыпускПродукции", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_АвансовыйОтчет(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
	|	Представление(Док.Ссылка) КАК Ссылка,
	|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
	|	Док.Дата КАК Дата,
	|	Представление(Док.Номер) КАК Номер,
	|	""00000000-0000-0000-0000-000000000000"" КАК СкладГУИД,
	|	Док.Склад КАК Склад,
	|	Представление(Док.Комментарий) КАК Комментарий,
	|	Представление(Док.Организация) КАК Организация,
	|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
	|	Док.Сотрудник КАК Сотрудник,
	|	Док.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
	|		Количество * Коэффициент КАК Количество,
	|		Цена,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС) КАК мТовары,
	|	Док.Услуги.(
	|		Номенклатура КАК Номенклатура,
	|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
	|		Количество * Коэффициент КАК Количество,
	|		Цена,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС) КАК мУслуги,
	|	Представление(Док.СуммаДокумента) КАК Сумма,
	|	ВЫБОР
	|		КОГДА Док.ПометкаУдаления = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеДокумента
	|ИЗ
	|  	Документ.АвансовыйОтчет КАК Док
	|ГДЕ
	|   Док.Ссылка В (&МассивСсылок)
	|
	|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("АвансовыйОтчет", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_СчетФактураВыданный(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
	|	Представление(Док.Ссылка) КАК Ссылка,
	|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
	|	Док.Дата КАК Дата,
	|	Представление(Док.Номер) КАК Номер,
	|	Представление(Док.Комментарий) КАК Комментарий,
	|	Представление(Док.Организация) КАК Организация,
	|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
	|	Представление(Док.Валюта) КАК Валюта,
	|	Представление(ЕСТЬNULL(Док.Валюта.Код, """")) КАК ВалютаКод,
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДатаВыставления КАК ДатаВыставления,
	|	Док.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	Док.ПлатежноРасчетныеДокументы.(
	|		НомерПлатежноРасчетногоДокумента КАК НомерПлатежноРасчетногоДокумента,
	|		ДатаПлатежноРасчетногоДокумента КАК ДатаПлатежноРасчетногоДокумента
	|	) КАК мПлатежноРасчетныеДокументы,
	|	ЕСТЬNULL(Док.Основание.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ОснованиеДата,
	|	Представление(ЕСТЬNULL(Док.Основание.Номер, """")) КАК ОснованиеНомер,
	|	Представление(ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Док.Основание, """"))) КАК ОснованиеВидДок,
	|	""00000000-0000-0000-0000-000000000000"" КАК ОснованиеГУИД,
	|	Док.Основание КАК Основание,
	|	ВЫБОР
	|		КОГДА Док.ПометкаУдаления = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеДокумента
	|ИЗ
	|  	Документ.СчетФактураВыданный КАК Док
	|ГДЕ
	|   Док.Ссылка В (&МассивСсылок)
	|
	|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("СчетФактураВыданный", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_ПриходныйКассовыйОрдер(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
	|	Представление(Док.Ссылка) КАК Ссылка,
	|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
	|	Представление(Док.ВидОперации) КАК ВидОперации,
	|	Док.Дата КАК Дата,
	|	Представление(Док.Номер) КАК Номер,
	|	Представление(Док.Комментарий) КАК Комментарий,
	|	Представление(Док.Организация) КАК Организация,
	|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
	|	Представление(Док.Валюта) КАК Валюта,
	|	Представление(ЕСТЬNULL(Док.Валюта.Код, """")) КАК ВалютаКод,
	|	Док.Контрагент КАК Контрагент,
	|	""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|	Док.Договор КАК Договор,
	|	Представление(ЕСТЬNULL(Док.Договор, """")) КАК ПредставлениеДоговора,
	|	Представление(Док.Сумма) КАК Сумма,
	|	Док.СтавкаНДС КАК СтавкаНДС,
	|	Представление(Док.СуммаНДС) КАК СуммаНДС,
	|	Представление(Док.Статья) КАК Статья,
	|	Док.Сотрудник КАК Сотрудник,
	//++ #16065
	|	ВЫБОР 
	|		КОГДА Док.Контрагент.НаименованиеПолное = """" 
	|			ТОГДА Док.Контрагент.Наименование 
	|		ИНАЧЕ Док.Контрагент.НаименованиеПолное
	|	КОНЕЦ КАК ПринятоОт,
	|	ПРЕДСТАВЛЕНИЕ(Док.Договор) КАК ОснованиеСтрокой,
	|	Док.Комментарий КАК Приложение,
	|	Док.РаспределениеПлатежа.(
	|		ПРЕДСТАВЛЕНИЕ(Документ) КАК ПредставлениеДокумента,
	|		Сумма КАК Сумма
	|	) КАК мРаспределениеПлатежа,
	|	Док.Основания.(
	|		ПРЕДСТАВЛЕНИЕ(Основание) КАК ОснованиеСтрокой
	|	) КАК мОснования,
	//-- #16065
	|	ВЫБОР
	|		КОГДА Док.ПометкаУдаления = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеДокумента
	|ИЗ
	|  	Документ.ПриходныйКассовыйОрдер КАК Док
	|ГДЕ
	|   Док.Ссылка В (&МассивСсылок)
	|
	|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("ПриходныйКассовыйОрдер", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_ПоступлениеНаРасчетныйСчет(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
		|	Представление(Док.Ссылка) КАК Ссылка,
		|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
		|	Представление(Док.ВидОперации) КАК ВидОперации,
		|	Док.Дата КАК Дата,
		|	Представление(Док.Номер) КАК Номер,
		|	Представление(Док.Комментарий) КАК Комментарий,
		|	Представление(Док.Организация) КАК Организация,
		|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
		|	Представление(Док.Валюта) КАК Валюта,
		|	Представление(ЕСТЬNULL(Док.Валюта.Код, """")) КАК ВалютаКод,
		|	Док.Контрагент КАК Контрагент,
	|	""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|	Док.Договор КАК Договор,
	|	Представление(ЕСТЬNULL(Док.Договор, """")) КАК ПредставлениеДоговора,
	|	Представление(Док.Сумма) КАК Сумма,
	|	Док.СтавкаНДС КАК СтавкаНДС,
	|	Представление(Док.СуммаНДС) КАК СуммаНДС,
		|	Представление(Док.Статья) КАК Статья,
		|	Док.ВхДата КАК ДатаВходящегоДокумента,
		|	Док.ВхНомер КАК НомерВходящегоДокумента,
		|	Док.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ЕСТЬNULL(Док.Счет.НомерСчета, """") КАК НомерСчета,
		|	ВЫБОР
		|		КОГДА Док.ПометкаУдаления = ИСТИНА
		|			ТОГДА 2
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Док.Проведен = ИСТИНА
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|  	Документ.ПоступлениеНаРасчетныйСчет КАК Док
		|ГДЕ
		|   Док.Ссылка В (&МассивСсылок)
		|
		|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("ПоступлениеНаРасчетныйСчет", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_РасходныйКассовыйОрдер(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
	|	Представление(Док.Ссылка) КАК Ссылка,
	|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
	|	Представление(Док.ВидОперации) КАК ВидОперации,
	|	Док.Дата КАК Дата,
	|	Представление(Док.Номер) КАК Номер,
	|	Представление(Док.Комментарий) КАК Комментарий,
	|	Представление(Док.Организация) КАК Организация,
	|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
	|	Представление(Док.Валюта) КАК Валюта,
	|	Представление(ЕСТЬNULL(Док.Валюта.Код, """")) КАК ВалютаКод,
	|	Док.Контрагент КАК Контрагент,
	|	""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|	Док.Договор КАК Договор,
	|	Представление(ЕСТЬNULL(Док.Договор, """")) КАК ПредставлениеДоговора,
	|	Представление(Док.Сумма) КАК Сумма,
	|	Док.СтавкаНДС КАК СтавкаНДС,
	|	Представление(Док.СуммаНДС) КАК СуммаНДС,
	|	Представление(Док.Статья) КАК Статья,
	|	Док.Сотрудник КАК Сотрудник,
	//++ #16065
	|	ВЫБОР 
	|		КОГДА Док.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА Док.Контрагент.НаименованиеПолное = """" 
	|			ТОГДА Док.Контрагент.Наименование 
	|		ИНАЧЕ Док.Контрагент.НаименованиеПолное
	|	КОНЕЦ КАК Выдать,
	|	ПРЕДСТАВЛЕНИЕ(Док.Договор) КАК ОснованиеСтрокой,
	|	Док.Комментарий КАК Приложение,
	|	Док.Контрагент.ДокументУдостоверяющийЛичность КАК ДУЛ, 
	|	Док.РаспределениеПлатежа.(
	|		ПРЕДСТАВЛЕНИЕ(Документ) КАК ПредставлениеДокумента,
	|		Сумма КАК Сумма
	|	) КАК мРаспределениеПлатежа,
	//-- #16065
	|	Док.ЗарплатаСотрудникам.(
	|		Сотрудник КАК Сотрудник,
	|		Сумма КАК Сумма
	|	) КАК мЗарплатаСотрудникам,
	|	ВЫБОР
	|		КОГДА Док.ПометкаУдаления = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеДокумента
	|ИЗ
	|  	Документ.РасходныйКассовыйОрдер КАК Док
	|ГДЕ
	|   Док.Ссылка В (&МассивСсылок)
	|
	|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("РасходныйКассовыйОрдер", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_СписаниеСРасчетногоСчета(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
		|	Представление(Док.Ссылка) КАК Ссылка,
		|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
		|	Представление(Док.ВидОперации) КАК ВидОперации,
		|	Док.Дата КАК Дата,
		|	Представление(Док.Номер) КАК Номер,
		|	Представление(Док.Комментарий) КАК Комментарий,
		|	Представление(Док.Организация) КАК Организация,
		|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
		|	Представление(Док.Валюта) КАК Валюта,
		|	Представление(ЕСТЬNULL(Док.Валюта.Код, """")) КАК ВалютаКод,
		|	ВЫБОР
		|		КОГДА Док.Контрагент ССЫЛКА Справочник.Контрагенты
		|			ТОГДА Док.Контрагент
		|		ИНАЧЕ Значение(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ  КАК Контрагент,
	|	""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|	Док.Договор КАК Договор,
	|	Представление(ЕСТЬNULL(Док.Договор, """")) КАК ПредставлениеДоговора,
	|	Представление(Док.Сумма) КАК Сумма,
	|	Док.СтавкаНДС КАК СтавкаНДС,
	|	Представление(Док.СуммаНДС) КАК СуммаНДС,
		|	Представление(Док.Статья) КАК Статья,
		|	ВЫБОР
		|		КОГДА Док.Контрагент ССЫЛКА Справочник.Сотрудники
		|			ТОГДА Док.Контрагент
		|		ИНАЧЕ Значение(Справочник.Сотрудники.ПустаяСсылка)
		|	КОНЕЦ КАК Сотрудник,
		|	Док.ИсхДата КАК ДатаВходящегоДокумента,
		|	Док.ИсхНомер КАК НомерВходящегоДокумента,
		|	ЕСТЬNULL(Док.Счет.НомерСчета, """") КАК НомерСчета,
		|	Док.ПеречислениеВБюджет КАК ПеречислениеВБюджет,
		|	Док.КодБК КАК КодБК,
		|	Док.ПоказательПериода КАК ПоказательПериода,
		|	Док.НазначениеПлатежа КАК НазначениеПлатежа,
		|	Док.ЗарплатаСотрудникам.(
		|		Сотрудник КАК Сотрудник,
		|		Сумма КАК Сумма
		|	) КАК мЗарплатаСотрудникам,
		|	ВЫБОР
		|		КОГДА Док.ПометкаУдаления = ИСТИНА
		|			ТОГДА 2
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Док.Проведен = ИСТИНА
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|  	Документ.СписаниеСРасчетногоСчета КАК Док
		|ГДЕ
		|   Док.Ссылка В (&МассивСсылок)
		|
		|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("СписаниеСРасчетногоСчета", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

//++ №12409
&НаСервере
Процедура СформироватьДанныеПо_ОприходованиеТоваров(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
		|	Представление(Док.Ссылка) КАК Ссылка,
		|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
		|	Док.Дата КАК Дата,
		|	Представление(Док.Номер) КАК Номер,
	|	""00000000-0000-0000-0000-000000000000"" КАК СкладГУИД,
	|	Док.Склад КАК Склад,
		|	Представление(Док.Комментарий) КАК Комментарий,
		|	Представление(Док.Организация) КАК Организация,
		|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
		|	Док.Товары.(
		|		Номенклатура КАК Номенклатура,
		|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
		|		Количество * Коэффициент КАК Количество,
		|		Цена,
		|		Сумма) КАК мТовары,
		|	Представление(Док.СуммаДокумента) КАК Сумма,
		|	ВЫБОР
		|		КОГДА Док.ПометкаУдаления = ИСТИНА
		|			ТОГДА 2
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Док.Проведен = ИСТИНА
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|  	Документ.ОприходованиеТоваров КАК Док
		|ГДЕ
		|   Док.Ссылка В (&МассивСсылок)
		|
		|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("ОприходованиеТоваров", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_СписаниеТоваров(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
		|	Представление(Док.Ссылка) КАК Ссылка,
		|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
		|	Док.Дата КАК Дата,
		|	Представление(Док.Номер) КАК Номер,
	|	""00000000-0000-0000-0000-000000000000"" КАК СкладГУИД,
	|	Док.Склад КАК Склад,
		|	Представление(Док.Комментарий) КАК Комментарий,
		|	Представление(Док.Организация) КАК Организация,
		|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
		|	Док.Товары.(
		|		Номенклатура КАК Номенклатура,
		|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
		|		Количество * Коэффициент КАК Количество) КАК мТовары,
		|	ВЫБОР
		|		КОГДА Док.ПометкаУдаления = ИСТИНА
		|			ТОГДА 2
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Док.Проведен = ИСТИНА
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|  	Документ.СписаниеТоваров КАК Док
		|ГДЕ
		|   Док.Ссылка В (&МассивСсылок)
		|
		|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("СписаниеТоваров", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_Монтаж(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
		|	Представление(Док.Ссылка) КАК Ссылка,
		|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
		|	Док.Дата КАК Дата,
		|	Представление(Док.Номер) КАК Номер,
		
	|	""00000000-0000-0000-0000-000000000000"" КАК СкладГУИД,
	|	Док.СкладТоваров КАК Склад,
	|	""00000000-0000-0000-0000-000000000000"" КАК СкладМатериаловГУИД,
	|	Док.Склад КАК СкладМатериалов,
	
		|	Представление(Док.Комментарий) КАК Комментарий,
		|	Представление(Док.Организация) КАК Организация,
		|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
		|	Док.Контрагент КАК Контрагент,
	|	""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|	Док.ДоговорКонтрагента КАК Договор,
	|	Представление(ЕСТЬNULL(Док.ДоговорКонтрагента, """")) КАК ПредставлениеДоговора,
		|	Док.ТоварыУслуги.(
		|		Номенклатура КАК Номенклатура,
		|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
		|		Количество * Коэффициент КАК Количество,
		|		Цена,
		|		Сумма) КАК мТовары,
		|	Док.ТоварыУслуги.(
		|		Номенклатура КАК Номенклатура,
		|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
		|		Количество * Коэффициент КАК Количество,
		|		Цена,
		|		Сумма) КАК мУслуги,
		|	Док.Материалы.(
		|		Номенклатура КАК Номенклатура,
		|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
		|		Количество * Коэффициент КАК Количество) КАК мМатериалы,
		|	Представление(Док.СуммаДокумента) КАК Сумма,
		|	ВЫБОР
		|		КОГДА Док.ПометкаУдаления = ИСТИНА
		|			ТОГДА 2
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Док.Проведен = ИСТИНА
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|  	Документ.Монтаж КАК Док
		|ГДЕ
		|   Док.Ссылка В (&МассивСсылок)
		|
		|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	// На входе две одинаковые ТЧ с разными названиями, нужно оставить товары в товарах, услуги в услугах
	Для Каждого ТекущийДокумент Из ТаблицаДанных Цикл
		
		КоличествоСтрок = ТекущийДокумент.мТовары.Количество() - 1;
		Для Сч = 0 По КоличествоСтрок Цикл
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущийДокумент.мТовары[КоличествоСтрок - Сч].Номенклатура) Тогда
				ТекущийДокумент.мТовары.Удалить(КоличествоСтрок - Сч);
			Иначе
				ТекущийДокумент.мУслуги.Удалить(КоличествоСтрок - Сч);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("Монтаж", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры
//-- №12409

//++ #15677
&НаСервере
Процедура СформироватьДанныеПо_ОплатаБанковскойКартой(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
	|	Представление(Док.Ссылка) КАК Ссылка,
	|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
	|	Представление(Док.ВидОперации) КАК ВидОперации,
	|	Док.Дата КАК Дата,
	|	Представление(Док.Номер) КАК Номер,
	|	Представление(Док.Комментарий) КАК Комментарий,
	|	Представление(Док.Организация) КАК Организация,
	|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
	|	Представление(Док.Валюта) КАК Валюта,
	|	Представление(ЕСТЬNULL(Док.Валюта.Код, """")) КАК ВалютаКод,
	|	Док.Контрагент КАК Контрагент,
	|	""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|	Док.Договор КАК Договор,
	|	Представление(ЕСТЬNULL(Док.Договор, """")) КАК ПредставлениеДоговора,
	
	|	Представление(ЕСТЬNULL(Док.ЭквайринговыйТерминал, """")) КАК ЭквайринговыйТерминал,
	|	""00000000-0000-0000-0000-000000000000"" КАК ЭквайрерГУИД,
	|	Док.ЭквайринговыйТерминал.Эквайрер КАК Эквайрер,
	|	""00000000-0000-0000-0000-000000000000"" КАК ДоговорЭквайрингаГУИД,
	|	Док.ЭквайринговыйТерминал.Договор КАК ДоговорЭквайринга,
	|	Представление(ЕСТЬNULL(Док.ЭквайринговыйТерминал.Договор, """")) КАК ПредставлениеДоговораЭквайринга,
	
	|	Представление(Док.Сумма) КАК Сумма,
	|	Док.СтавкаНДС КАК СтавкаНДС,
	|	Представление(Док.СуммаНДС) КАК СуммаНДС,
	|	Представление(Док.СтатьяДоходов) КАК Статья,
	|	ВЫБОР
	|		КОГДА Док.ПометкаУдаления = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеДокумента
	|ИЗ
	|  	Документ.ОплатаБанковскойКартой КАК Док
	|ГДЕ
	|   Док.Ссылка В (&МассивСсылок)
	|
	|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("ОплатаБанковскойКартой", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_КорректировкаДолга(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
	|	Представление(Док.Ссылка) КАК Ссылка,
	|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
	|	Док.Дата КАК Дата,
	|	Представление(Док.Номер) КАК Номер,
	|	Представление(Док.Комментарий) КАК Комментарий,
	|	Представление(Док.Организация) КАК Организация,
	|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
	
	|	ВЫБОР
	|		КОГДА Док.ПометкаУдаления = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеДокумента,
	|	Док.УвеличениеДолга.(
	|       ""Покупатель"" КАК ХарактерОтношений,
	|       ""Увеличение"" КАК ХарактерИзменений,
	|		Контрагент КАК Контрагент,
	|		""00000000-0000-0000-0000-000000000000"" КАК КонтрагентГУИД,
	|		""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|		Договор КАК Договор,
	|		Представление(Договор) КАК ПредставлениеДоговора,
	|		Представление(Валюта) КАК Валюта,
	|		Представление(Валюта.Код) КАК ВалютаКод,
	|		Сумма) КАК мУвеличениеДолгаПокупателей,
	|	Док.УменьшениеДолга.(
	|       ""Покупатель"" КАК ХарактерОтношений,
	|       ""Уменьшение"" КАК ХарактерИзменений,
	|		Контрагент КАК Контрагент,
	|		""00000000-0000-0000-0000-000000000000"" КАК КонтрагентГУИД,
	|		""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|		Договор КАК Договор,
	|		Представление(Договор) КАК ПредставлениеДоговора,
	|		Представление(Валюта) КАК Валюта,
	|		Представление(Валюта.Код) КАК ВалютаКод,
	|		Сумма) КАК мУменьшениеДолгаПокупателей,
	|	Док.УвеличениеДолгаПоставщиков.(
	|       ""Поставщик"" КАК ХарактерОтношений,
	|       ""Увеличение"" КАК ХарактерИзменений,
	|		Контрагент КАК Контрагент,
	|		""00000000-0000-0000-0000-000000000000"" КАК КонтрагентГУИД,
	|		""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|		Договор КАК Договор,
	|		Представление(Договор) КАК ПредставлениеДоговора,
	|		Представление(Валюта) КАК Валюта,
	|		Представление(Валюта.Код) КАК ВалютаКод,
	|		Сумма) КАК мУвеличениеДолгаПоставщиков,
	|	Док.УменьшениеДолгаПоставщиков.(
	|       ""Поставщик"" КАК ХарактерОтношений,
	|       ""Уменьшение"" КАК ХарактерИзменений,
	|		Контрагент КАК Контрагент,
	|		""00000000-0000-0000-0000-000000000000"" КАК КонтрагентГУИД,
	|		""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|		Договор КАК Договор,
	|		Представление(Договор) КАК ПредставлениеДоговора,
	|		Представление(Валюта) КАК Валюта,
	|		Представление(Валюта.Код) КАК ВалютаКод,
	|		Сумма) КАК мУменьшениеДолгаПоставщиков

	|ИЗ
	|  	Документ.КорректировкаДолга КАК Док
	|ГДЕ
	|   Док.Ссылка В (&МассивСсылок)
	|
	|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("КорректировкаДолга", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПо_ВозвратТовараПоставщику(СтруктураДанных, МассивСсылок)
	
	// Запросом получаем все данные
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Док.Ссылка КАК СсылкаКУдалению,
	|	Представление(Док.Ссылка) КАК Ссылка,
	|	Представление(ТИПЗНАЧЕНИЯ(Док.Ссылка)) КАК ВидДокумента,
	|	Док.Дата КАК Дата,
	|	Представление(Док.Номер) КАК Номер,
	|	""00000000-0000-0000-0000-000000000000"" КАК СкладГУИД,
	|	Док.Склад КАК Склад,
	|	Представление(Док.Комментарий) КАК Комментарий,
	|	Представление(Док.Организация) КАК Организация,
	|	Представление(Док.Организация.ИНН) КАК ОрганизацияИНН,
	|	""00000000-0000-0000-0000-000000000000"" КАК ОснованиеГУИД,
	|	Док.Основание КАК Основание,	
	|	ЕСТЬNULL(Док.Основание.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ОснованиеДата,
	|	Представление(ЕСТЬNULL(Док.Основание.Номер, """")) КАК ОснованиеНомер,
	|	Представление(ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Док.Основание, """"))) КАК ОснованиеВидДок,
	|	Док.Контрагент КАК Контрагент,
	|	""00000000-0000-0000-0000-000000000000"" КАК ДоговорГУИД,
	|	Док.ДоговорКонтрагента КАК Договор,
	|	Представление(ЕСТЬNULL(Док.ДоговорКонтрагента, """")) КАК ПредставлениеДоговора,
	|	Представление(Док.СуммаДокумента) КАК Сумма,
	|	ВЫБОР
	|		КОГДА Док.ПометкаУдаления = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеДокумента,
	|	Док.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		Представление(ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|		Представление(ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияКод,
	|		Количество * Коэффициент КАК Количество,
	|		Цена,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС) КАК мТовары		
	|ИЗ
	|  	Документ.ВозвратТовараПоставщику КАК Док
	|ГДЕ
	|   Док.Ссылка В (&МассивСсылок)
	|
	|";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	СтруктураДанных.Документы.Вставить("ВозвратТовараПоставщику", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
КонецПроцедуры
//-- #15677

&НаСервере
Процедура ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных)
	
	// Колонки:
	// - с ссылочным типом, будут перед выгрузкой удаляться, предварительно перенеся их ГУИДы
	// - таблицы значений, будут преобразовываться в массив со структурой, перед выгрузкой удаляться
	КолонкиКУдалению = новый Массив;
	
	ЕстьКолонкаСсылкаКУдалению = (НЕ ТаблицаДанных.Колонки.Найти("СсылкаКУдалению") = Неопределено);
	ЕстьКолонкаОснование = (НЕ ТаблицаДанных.Колонки.Найти("Основание") = Неопределено);
	ЕстьКолонкаКонтрагент = (НЕ ТаблицаДанных.Колонки.Найти("Контрагент") = Неопределено);
	ЕстьКолонкаДоговор = (НЕ ТаблицаДанных.Колонки.Найти("Договор") = Неопределено);
	ЕстьКолонкаСклад = (НЕ ТаблицаДанных.Колонки.Найти("Склад") = Неопределено);
	ЕстьКолонкаСкладМатериалов = (НЕ ТаблицаДанных.Колонки.Найти("СкладМатериалов") = Неопределено);
	ЕстьКолонкаТовары = (НЕ ТаблицаДанных.Колонки.Найти("мТовары") = Неопределено);
	ЕстьКолонкаУслуги = (НЕ ТаблицаДанных.Колонки.Найти("мУслуги") = Неопределено);
	ЕстьКолонкаМатериалы = (НЕ ТаблицаДанных.Колонки.Найти("мМатериалы") = Неопределено); // №12409
	ЕстьКолонкаПродукция = (НЕ ТаблицаДанных.Колонки.Найти("ПродукцияНоменклатура") = Неопределено);
	ЕстьКолонкаСотрудник = (НЕ ТаблицаДанных.Колонки.Найти("Сотрудник") = Неопределено);
	ЕстьКолонкамПлатежноРасчетныеДокументы = (НЕ ТаблицаДанных.Колонки.Найти("мПлатежноРасчетныеДокументы") = Неопределено);
	ЕстьКолонкаЗарплатаСотрудникам = (НЕ ТаблицаДанных.Колонки.Найти("мЗарплатаСотрудникам") = Неопределено);	
	ЕстьКолонкаКонтактнаяИнформация = (НЕ ТаблицаДанных.Колонки.Найти("мКонтактнаяИнформация") = Неопределено);
	ЕстьКолонкаЭквайрер = (НЕ ТаблицаДанных.Колонки.Найти("Эквайрер") = Неопределено);
	ЕстьКолонкаДолги = (НЕ ТаблицаДанных.Колонки.Найти("мУвеличениеДолгаПокупателей") = Неопределено);
	ЕстьКолонкаСтавкаНДС = (НЕ ТаблицаДанных.Колонки.Найти("СтавкаНДС") = Неопределено);		
	//++ #16065
	ЕстьКолонкаРаспределениеПлатежа = (НЕ ТаблицаДанных.Колонки.Найти("мРаспределениеПлатежа") = Неопределено);
	ЕстьКолонкаОснования = (НЕ ТаблицаДанных.Колонки.Найти("мОснования") = Неопределено);
	ЕстьКолонкаДУЛ = (НЕ ТаблицаДанных.Колонки.Найти("ДУЛ") = Неопределено);
	//-- #16065
	
	//++ #15677
	Если ЕстьКолонкаСсылкаКУдалению Тогда
		КолонкиКУдалению.Добавить("СсылкаКУдалению");
	КонецЕсли;
	Если ЕстьКолонкаОснование Тогда
		КолонкиКУдалению.Добавить("Основание");
	КонецЕсли;
	Если ЕстьКолонкаСклад Тогда
		КолонкиКУдалению.Добавить("Склад");
	КонецЕсли;
	Если ЕстьКолонкаСкладМатериалов Тогда
		КолонкиКУдалению.Добавить("СкладМатериалов");
	КонецЕсли;
	//-- #15677
	
	Если ЕстьКолонкаКонтрагент Тогда
		КолонкиКУдалению.Добавить("Контрагент");
		ТаблицаДанных.Колонки.Добавить("КонтрагентГУИД", новый ОписаниеТипов("Строка"));
	КонецЕсли;
	Если ЕстьКолонкаДоговор Тогда
		КолонкиКУдалению.Добавить("Договор");
	КонецЕсли;
	
	//++ #15677
	Если ЕстьКолонкаЭквайрер Тогда
		КолонкиКУдалению.Добавить("Эквайрер");
		КолонкиКУдалению.Добавить("ДоговорЭквайринга");
	КонецЕсли;
	//-- #15677
	
	Если ЕстьКолонкаТовары Тогда
		КолонкиКУдалению.Добавить("мТовары");
		ТаблицаДанных.Колонки.Добавить("Товары", новый ОписаниеТипов("Массив"));
	КонецЕсли;
	
	Если ЕстьКолонкаУслуги Тогда
		КолонкиКУдалению.Добавить("мУслуги");
		ТаблицаДанных.Колонки.Добавить("Услуги", новый ОписаниеТипов("Массив"));
	КонецЕсли;
	
	//++ №12409
	Если ЕстьКолонкаМатериалы Тогда
		КолонкиКУдалению.Добавить("мМатериалы");
		ТаблицаДанных.Колонки.Добавить("Материалы", новый ОписаниеТипов("Массив"));
	КонецЕсли;
	//-- №12409
	
	Если ЕстьКолонкаПродукция Тогда
		КолонкиКУдалению.Добавить("ПродукцияНоменклатура");
		ТаблицаДанных.Колонки.Добавить("ПродукцияГУИД", новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	Если ЕстьКолонкаСотрудник Тогда
		КолонкиКУдалению.Добавить("Сотрудник");
		ТаблицаДанных.Колонки.Добавить("СотрудникГУИД", новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	Если ЕстьКолонкамПлатежноРасчетныеДокументы Тогда
		КолонкиКУдалению.Добавить("мПлатежноРасчетныеДокументы");
		ТаблицаДанных.Колонки.Добавить("ПлатежноРасчетныеДокументы", новый ОписаниеТипов("Массив"));
	КонецЕсли;
	
	Если ЕстьКолонкаЗарплатаСотрудникам Тогда
		КолонкиКУдалению.Добавить("мЗарплатаСотрудникам");
		ТаблицаДанных.Колонки.Добавить("ЗарплатаСотрудникам", новый ОписаниеТипов("Массив"));
	КонецЕсли;
	
	Если ЕстьКолонкаКонтактнаяИнформация Тогда
		КолонкиКУдалению.Добавить("мКонтактнаяИнформация");
		ТаблицаДанных.Колонки.Добавить("КонтактнаяИнформация", Новый ОписаниеТипов("Массив"));
	КонецЕсли;
	
	Если ЕстьКолонкаСтавкаНДС Тогда
		КолонкиКУдалению.Добавить("СтавкаНДС");
		ТаблицаДанных.Колонки.Добавить("СтавкаНДСИмя", новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	//++ #15677
	Если ЕстьКолонкаДолги Тогда
		КолонкиКУдалению.Добавить("мУвеличениеДолгаПокупателей");
		КолонкиКУдалению.Добавить("мУменьшениеДолгаПокупателей");
		КолонкиКУдалению.Добавить("мУвеличениеДолгаПоставщиков");
		КолонкиКУдалению.Добавить("мУменьшениеДолгаПоставщиков");
		ТаблицаДанных.Колонки.Добавить("УвеличениеДолгаПокупателей", Новый ОписаниеТипов("Массив"));
		ТаблицаДанных.Колонки.Добавить("УменьшениеДолгаПокупателей", Новый ОписаниеТипов("Массив"));
		ТаблицаДанных.Колонки.Добавить("УвеличениеДолгаПоставщиков", Новый ОписаниеТипов("Массив"));
		ТаблицаДанных.Колонки.Добавить("УменьшениеДолгаПоставщиков", Новый ОписаниеТипов("Массив"));
	КонецЕсли;
	//-- #15677
	
	//++ #16065
	Если ЕстьКолонкаРаспределениеПлатежа Тогда
		КолонкиКУдалению.Добавить("мРаспределениеПлатежа");
		ТаблицаДанных.Колонки.Добавить("РаспределениеПлатежа", Новый ОписаниеТипов("Массив"));
	КонецЕсли;
	Если ЕстьКолонкаОснования Тогда
		КолонкиКУдалению.Добавить("мОснования");
		ТаблицаДанных.Колонки.Добавить("Основания", Новый ОписаниеТипов("Массив"));
	КонецЕсли;
	Если ЕстьКолонкаДУЛ Тогда
		КолонкиКУдалению.Добавить("ДУЛ");
		ТаблицаДанных.Колонки.Добавить("ПредставлениеДУЛ", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	//-- #16065
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Строка"));
	МассивТипов.Добавить(Тип("Null"));
	ТипСтрокаРасширенный = Новый ОписаниеТипов(МассивТипов);

	МассивПолейЭкранирования = Новый Массив;
	Для каждого КолонкаТЗ из ТаблицаДанных.Колонки Цикл
		Если КолонкаТЗ.ТипЗначения = Новый ОписаниеТипов("Строка")
			ИЛИ КолонкаТЗ.ТипЗначения = ТипСтрокаРасширенный
			Тогда
			МассивПолейЭкранирования.Добавить(КолонкаТЗ.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл
		
		//++ #15677
		Если ЕстьКолонкаСсылкаКУдалению Тогда
			ТекущаяСтрока.ГУИД = Строка(ТекущаяСтрока.СсылкаКУдалению.УникальныйИдентификатор());
		КонецЕсли;
		Если ЕстьКолонкаОснование Тогда
			ТекущаяСтрока.ОснованиеГУИД = Строка(ТекущаяСтрока.Основание.УникальныйИдентификатор());
		КонецЕсли;
		Если ЕстьКолонкаСклад Тогда
			ТекущаяСтрока.СкладГУИД = Строка(ТекущаяСтрока.Склад.УникальныйИдентификатор());
			Если СписокСкладов.НайтиПоЗначению(ТекущаяСтрока.Склад) = Неопределено Тогда				
				СписокСкладов.Добавить(ТекущаяСтрока.Склад);				
			КонецЕсли;
		КонецЕсли;
		Если ЕстьКолонкаСкладМатериалов Тогда
			ТекущаяСтрока.СкладМатериаловГУИД = Строка(ТекущаяСтрока.СкладМатериалов.УникальныйИдентификатор());
			Если СписокСкладов.НайтиПоЗначению(ТекущаяСтрока.СкладМатериалов) = Неопределено Тогда				
				СписокСкладов.Добавить(ТекущаяСтрока.СкладМатериалов);				
			КонецЕсли;
		КонецЕсли;
		Если ЕстьКолонкаСтавкаНДС И ЗначениеЗаполнено(ТекущаяСтрока.СтавкаНДС) Тогда
			ТекущаяСтрока.СтавкаНДСИмя = ИмяПоЗначениюПеречисления("СтавкиНДС", ТекущаяСтрока.СтавкаНДС);
		КонецЕсли;
		//-- #15677
		
		// Обработка контрагента
		Если ЕстьКолонкаКонтрагент Тогда		
			Если СписокКонтрагентов.НайтиПоЗначению(ТекущаяСтрока.Контрагент) = Неопределено Тогда				
				СписокКонтрагентов.Добавить(ТекущаяСтрока.Контрагент);				
			КонецЕсли;			
			ТекущаяСтрока.КонтрагентГУИД = ТекущаяСтрока.Контрагент.УникальныйИдентификатор();
		КонецЕсли;
		
		Если ЕстьКолонкаДоговор Тогда
			Если СписокДоговоров.НайтиПоЗначению(ТекущаяСтрока.Договор) = Неопределено Тогда				
				СписокДоговоров.Добавить(ТекущаяСтрока.Договор);				
			КонецЕсли;
			ТекущаяСтрока.ДоговорГУИД = ТекущаяСтрока.Договор.УникальныйИдентификатор();
		КонецЕсли;
		
		//++ #15677 
		Если ЕстьКолонкаЭквайрер И ЗначениеЗаполнено(ТекущаяСтрока.Эквайрер) Тогда	
			Если СписокКонтрагентов.НайтиПоЗначению(ТекущаяСтрока.Эквайрер) = Неопределено Тогда				
				СписокКонтрагентов.Добавить(ТекущаяСтрока.Эквайрер);				
			КонецЕсли;			
			ТекущаяСтрока.ЭквайрерГУИД = ТекущаяСтрока.Эквайрер.УникальныйИдентификатор();			
			ТекущаяСтрока.ДоговорЭквайрингаГУИД = ТекущаяСтрока.ДоговорЭквайринга.УникальныйИдентификатор();
		КонецЕсли;	
		//-- #15677
		
		// Обработка табличной части Товары
		Если ЕстьКолонкаТовары Тогда
			
			ТекущаяСтрока.мТовары.Колонки.Добавить("НоменклатураГУИД", новый ОписаниеТипов("Строка"));
			ТекущаяСтрока.мТовары.Колонки.Добавить("СтавкаНДСИмя", Новый ОписаниеТипов("Строка"));
			
			ЕстьСтавкаНДС = (НЕ ТекущаяСтрока.мТовары.Колонки.Найти("СтавкаНДС") = Неопределено);
			ЕстьДокументПродажи = (НЕ ТекущаяСтрока.мТовары.Колонки.Найти("ДокументПродажи") = Неопределено);
			
			// В табличной части по номенклатуре укажем ГУИД
			Для Каждого СтрокаТаблицы Из ТекущаяСтрока.мТовары Цикл				
				
				Если СписокНоменклатуры.НайтиПоЗначению(СтрокаТаблицы.Номенклатура) = Неопределено Тогда
					ДобавитьИерархиюНоменклатуры(СтрокаТаблицы.Номенклатура, СписокНоменклатуры);
					СписокНоменклатуры.Добавить(СтрокаТаблицы.Номенклатура); 					
				КонецЕсли;
				
				СтрокаТаблицы.НоменклатураГУИД = СтрокаТаблицы.Номенклатура.УникальныйИдентификатор();
				
				Если ЕстьСтавкаНДС И ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
					СтрокаТаблицы.СтавкаНДСИмя = ИмяПоЗначениюПеречисления("СтавкиНДС", СтрокаТаблицы.СтавкаНДС);
				КонецЕсли;
				Если ЕстьДокументПродажи И ЗначениеЗаполнено(СтрокаТаблицы.ДокументПродажи) Тогда
					СтрокаТаблицы.ДокументПродажиГУИД = Строка(СтрокаТаблицы.ДокументПродажи.УникальныйИдентификатор());
				КонецЕсли;
				
			КонецЦикла;
			
			ТекущаяСтрока.мТовары.Колонки.Удалить(ТекущаяСтрока.мТовары.Колонки.Найти("Номенклатура"));
			Если ЕстьСтавкаНДС Тогда
				ТекущаяСтрока.мТовары.Колонки.Удалить(ТекущаяСтрока.мТовары.Колонки.Найти("СтавкаНДС"));
			КонецЕсли;
			Если ЕстьДокументПродажи Тогда
				ТекущаяСтрока.мТовары.Колонки.Удалить(ТекущаяСтрока.мТовары.Колонки.Найти("ДокументПродажи"));
			КонецЕсли;
			
			ТекущаяСтрока.Товары = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущаяСтрока.мТовары);
			
		КонецЕсли;	
		
		// Обработка Табличной части Услуги
		Если ЕстьКолонкаУслуги Тогда
			
			ТекущаяСтрока.мУслуги.Колонки.Добавить("НоменклатураГУИД", новый ОписаниеТипов("Строка"));
			ТекущаяСтрока.мУслуги.Колонки.Добавить("СтавкаНДСИмя", Новый ОписаниеТипов("Строка"));
			
			ЕстьСтавкаНДС = (НЕ ТекущаяСтрока.мУслуги.Колонки.Найти("СтавкаНДС") = Неопределено);
			
			// В табличной части по номенклатуре укажем ГУИД
			Для Каждого СтрокаТаблицы Из ТекущаяСтрока.мУслуги Цикл
				
				Если СписокНоменклатуры.НайтиПоЗначению(СтрокаТаблицы.Номенклатура) = Неопределено Тогда
					ДобавитьИерархиюНоменклатуры(СтрокаТаблицы.Номенклатура, СписокНоменклатуры);
					СписокНоменклатуры.Добавить(СтрокаТаблицы.Номенклатура);					
				КонецЕсли;
				
				СтрокаТаблицы.НоменклатураГУИД = СтрокаТаблицы.Номенклатура.УникальныйИдентификатор();
				
				Если ЕстьСтавкаНДС И ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
					СтрокаТаблицы.СтавкаНДСИмя = ИмяПоЗначениюПеречисления("СтавкиНДС", СтрокаТаблицы.СтавкаНДС);
				КонецЕсли;
			КонецЦикла;
			
			ТекущаяСтрока.мУслуги.Колонки.Удалить(ТекущаяСтрока.мУслуги.Колонки.Найти("Номенклатура"));
			Если ЕстьСтавкаНДС Тогда
				ТекущаяСтрока.мУслуги.Колонки.Удалить(ТекущаяСтрока.мУслуги.Колонки.Найти("СтавкаНДС"));
			КонецЕсли;
			
			ТекущаяСтрока.Услуги = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущаяСтрока.мУслуги)
			
		КонецЕсли;
		
		//++ №12409
		// Обработка Табличной части Материалы
		Если ЕстьКолонкаМатериалы Тогда
			
			ТекущаяСтрока.мМатериалы.Колонки.Добавить("НоменклатураГУИД", новый ОписаниеТипов("Строка"));
			
			// В табличной части по номенклатуре укажем ГУИД
			Для Каждого СтрокаТаблицы Из ТекущаяСтрока.мМатериалы Цикл
				
				Если СписокНоменклатуры.НайтиПоЗначению(СтрокаТаблицы.Номенклатура) = Неопределено Тогда
					ДобавитьИерархиюНоменклатуры(СтрокаТаблицы.Номенклатура, СписокНоменклатуры);
					СписокНоменклатуры.Добавить(СтрокаТаблицы.Номенклатура);					
				КонецЕсли;
				
				СтрокаТаблицы.НоменклатураГУИД = СтрокаТаблицы.Номенклатура.УникальныйИдентификатор();
				
			КонецЦикла;
			
			ТекущаяСтрока.мМатериалы.Колонки.Удалить(ТекущаяСтрока.мМатериалы.Колонки.Найти("Номенклатура"));
			
			ТекущаяСтрока.Материалы = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущаяСтрока.мМатериалы)
			
		КонецЕсли;
		//-- №12409
		
		// Обработка Продукции (Выпуск продукции)
		Если ЕстьКолонкаПродукция Тогда
		
			Если СписокНоменклатуры.НайтиПоЗначению(ТекущаяСтрока.ПродукцияНоменклатура) = Неопределено Тогда
				ДобавитьИерархиюНоменклатуры(ТекущаяСтрока.ПродукцияНоменклатура, СписокНоменклатуры);
				СписокНоменклатуры.Добавить(ТекущаяСтрока.ПродукцияНоменклатура);				
			КонецЕсли;
			
			ТекущаяСтрока.ПродукцияГУИД = ТекущаяСтрока.ПродукцияНоменклатура.УникальныйИдентификатор();
			
		КонецЕсли;
		
		// Обработка сотрудника
		Если ЕстьКолонкаСотрудник Тогда
		
			Если СписокСотрудников.НайтиПоЗначению(ТекущаяСтрока.Сотрудник) = Неопределено Тогда
				
				СписокСотрудников.Добавить(ТекущаяСтрока.Сотрудник);
				
			КонецЕсли;
			
			ТекущаяСтрока.СотрудникГУИД = ТекущаяСтрока.Сотрудник.УникальныйИдентификатор();
			
		КонецЕсли;
		
		// Обработка табличной части ПлатежноРасчетныеДокументы
		Если ЕстьКолонкамПлатежноРасчетныеДокументы Тогда
			
			ТекущаяСтрока.ПлатежноРасчетныеДокументы = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущаяСтрока.мПлатежноРасчетныеДокументы);
			
		КонецЕсли;
		
		// Обработка табличной части ЗарплатаСотрудникам
		Если ЕстьКолонкаЗарплатаСотрудникам Тогда
			
			ТекущаяСтрока.мЗарплатаСотрудникам.Колонки.Добавить("СотрудникГУИД", новый ОписаниеТипов("Строка"));
			
			// В табличной части по сотруднику укажем ГУИД
			Для Каждого СтрокаТаблицы Из ТекущаяСтрока.мЗарплатаСотрудникам Цикл
				
				Если СписокСотрудников.НайтиПоЗначению(СтрокаТаблицы.Сотрудник) = Неопределено Тогда
					
					СписокСотрудников.Добавить(СтрокаТаблицы.Сотрудник);
					
				КонецЕсли;
				
				СтрокаТаблицы.СотрудникГУИД = СтрокаТаблицы.Сотрудник.УникальныйИдентификатор();
				
			КонецЦикла;
			
			ТекущаяСтрока.мЗарплатаСотрудникам.Колонки.Удалить(ТекущаяСтрока.мЗарплатаСотрудникам.Колонки.Найти("Сотрудник"));
			
			ТекущаяСтрока.ЗарплатаСотрудникам = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущаяСтрока.мЗарплатаСотрудникам);
			
		КонецЕсли;
		
		Если ЕстьКолонкаКонтактнаяИнформация Тогда			
			ТекущаяСтрока.КонтактнаяИнформация = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущаяСтрока.мКонтактнаяИнформация);			
		КонецЕсли;
		
		//++ #15677 
		Если ЕстьКолонкаДолги Тогда
			СтруктураОбработки = Новый Структура;
			СтруктураОбработки.Вставить("мУвеличениеДолгаПокупателей" ,"УвеличениеДолгаПокупателей");
			СтруктураОбработки.Вставить("мУменьшениеДолгаПокупателей", "УменьшениеДолгаПокупателей");
			СтруктураОбработки.Вставить("мУвеличениеДолгаПоставщиков", "УвеличениеДолгаПоставщиков");
			СтруктураОбработки.Вставить("мУменьшениеДолгаПоставщиков", "УменьшениеДолгаПоставщиков");
				
			// В табличной части заполним ГУИД
			Для каждого КЗ из СтруктураОбработки Цикл
				Для Каждого СтрокаТаблицы Из ТекущаяСтрока[КЗ.Ключ] Цикл				
					Если СписокКонтрагентов.НайтиПоЗначению(СтрокаТаблицы.Контрагент) = Неопределено Тогда					
						СписокКонтрагентов.Добавить(СтрокаТаблицы.Контрагент);					
					КонецЕсли;				
					СтрокаТаблицы.КонтрагентГУИД = СтрокаТаблицы.Контрагент.УникальныйИдентификатор();				
					СтрокаТаблицы.ДоговорГУИД = СтрокаТаблицы.Договор.УникальныйИдентификатор();
				КонецЦикла;
				
				ТекущаяСтрока[КЗ.Ключ].Колонки.Удалить(ТекущаяСтрока[КЗ.Ключ].Колонки.Найти("Контрагент"));
				ТекущаяСтрока[КЗ.Ключ].Колонки.Удалить(ТекущаяСтрока[КЗ.Ключ].Колонки.Найти("Договор"));
				
				ТекущаяСтрока[КЗ.Значение] = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущаяСтрока[КЗ.Ключ]);
			КонецЦикла;
		КонецЕсли;	
		//-- #15677
		
		//++ #16065
		Если ЕстьКолонкаРаспределениеПлатежа Тогда			
			ТекущаяСтрока.РаспределениеПлатежа = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущаяСтрока.мРаспределениеПлатежа);			
		КонецЕсли;
		Если ЕстьКолонкаОснования Тогда			
			ТекущаяСтрока.Основания = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущаяСтрока.мОснования);			
		КонецЕсли;
		Если ЕстьКолонкаДУЛ Тогда
			Если ЗначениеЗаполнено(ТекущаяСтрока.ДУЛ) Тогда
				РеквизитыДУЛ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСтрока.ДУЛ, "Вид, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения");
				ТекущаяСтрока.ПредставлениеДУЛ = СтрШаблон("%1 серия: %2 номер: %3, выдан: %4 %5", РеквизитыДУЛ.Вид, РеквизитыДУЛ.Серия, РеквизитыДУЛ.Номер,
																								   РеквизитыДУЛ.КемВыдан, Формат(РеквизитыДУЛ.ДатаВыдачи,"ДЛФ=Д")); 
			КонецЕсли;
		КонецЕсли;
		//-- #16065
		
		Для каждого ПолеЭкр из МассивПолейЭкранирования Цикл
			ТекущаяСтрока[ПолеЭкр] = ОбщийМодульКлиентСервер.ЭкранироватьСимволыJSON(ТекущаяСтрока[ПолеЭкр]);
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого Колонка Из КолонкиКУдалению Цикл
		ТаблицаДанных.Колонки.Удалить(ТаблицаДанных.Колонки.Найти(Колонка));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПоУчаствующимОбъектамВДокументах(СтруктураДанных)
	
	// Контрагенты
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) КАК ГУИД,
	|	Спр.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(Спр.Код) КАК Код,
	|	ПРЕДСТАВЛЕНИЕ(Спр.Наименование) КАК Наименование,
	|	ПРЕДСТАВЛЕНИЕ(Спр.НаименованиеПолное) КАК НаименованиеПолное,
	|	ПРЕДСТАВЛЕНИЕ(Спр.ИНН) КАК ИНН,
	|	ПРЕДСТАВЛЕНИЕ(Спр.ВидКонтрагента) КАК ВидКонтрагента,
	|	Спр.КонтактнаяИнформация.(
	|		ПРЕДСТАВЛЕНИЕ(Спр.КонтактнаяИнформация.Тип) КАК Тип,
	|		Представление(ЕСТЬNULL(Вид.ИмяПредопределенныхДанных, """")) КАК Вид,
	|		Представление КАК Представление
	|	) КАК мКонтактнаяИнформация
	|ИЗ
	|	Справочник.Контрагенты КАК Спр
	|ГДЕ
	|	Спр.Ссылка В(&СписокСсылок)";
	Запрос.УстановитьПараметр("СписокСсылок", СписокКонтрагентов);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	// Заполняем ГУИДы
	Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл
		
		ТекущаяСтрока.ГУИД = ТекущаяСтрока.Ссылка.УникальныйИдентификатор();

	КонецЦикла;
	
	// Удаляем колонку ссылка
	ТаблицаДанных.Колонки.Удалить(ТаблицаДанных.Колонки.Найти("Ссылка"));
	
	// Для обработки мКонтактнаяИнформация
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	 
	// Выгружаем в файл
	СтруктураДанных.Справочники.Вставить("Контрагенты", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Номенклатура
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИДРодителя,
	|	Спр.Ссылка КАК Ссылка,
	|	Спр.Родитель КАК Родитель,
	|	ПРЕДСТАВЛЕНИЕ(Спр.Код) КАК Код,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(Спр.Артикул, """")) КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(Спр.Наименование) КАК Наименование,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(Спр.ВидНоменклатуры, """")) КАК ВидНоменклатуры,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(Спр.БазоваяЕдиницаИзмерения, """")) КАК БазоваяЕдиницаИзмерения,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(Спр.БазоваяЕдиницаИзмерения.Код, """")) КАК БазоваяЕдиницаИзмеренияКод,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(Спр.НоменклатурнаяГруппа, """")) КАК НоменклатурнаяГруппа,
	|	Спр.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Справочник.Номенклатура КАК Спр
	|ГДЕ
	|	Спр.Ссылка В(&СписокСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Спр.ЭтоГруппа ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("СписокСсылок", СписокНоменклатуры);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	// Заполняем ГУИДы
	Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл 		
		ТекущаяСтрока.ГУИД = Строка(ТекущаяСтрока.Ссылка.УникальныйИдентификатор());
		Если ЗначениеЗаполнено(ТекущаяСтрока.Родитель) Тогда
			ТекущаяСтрока.ГУИДРодителя = ТекущаяСтрока.Родитель.УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
	// Удаляем колонку ссылка
	ТаблицаДанных.Колонки.Удалить(ТаблицаДанных.Колонки.Найти("Ссылка"));
	ТаблицаДанных.Колонки.Удалить(ТаблицаДанных.Колонки.Найти("Родитель"));
	
	// Выгружаем в файл
	СтруктураДанных.Справочники.Вставить("Номенклатура", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Сотрудники
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ("""" КАК Строка(36)) КАК ГУИД,
	|	Спр.Ссылка КАК Ссылка,
	|	Представление(Спр.Код) КАК Код,
	|	Представление(Спр.Наименование) КАК Наименование,
	|	Спр.КонтактнаяИнформация.(
	|		ПРЕДСТАВЛЕНИЕ(Спр.КонтактнаяИнформация.Тип) КАК Тип,
	|		Вид.ИмяПредопределенныхДанных КАК Вид,
	|		Представление КАК Представление
	|	) КАК мКонтактнаяИнформация
	|ИЗ
	|  	Справочник.Сотрудники КАК Спр
	|ГДЕ
	|   Спр.Ссылка В (&СписокСсылок)
	|
	|";
	Запрос.УстановитьПараметр("СписокСсылок", СписокСотрудников);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	// Заполняем ГУИДы
	Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл
		
		ТекущаяСтрока.ГУИД = ТекущаяСтрока.Ссылка.УникальныйИдентификатор();
		
	КонецЦикла;
	
	// Удаляем колонку ссылка
	ТаблицаДанных.Колонки.Удалить(ТаблицаДанных.Колонки.Найти("Ссылка"));
	
	// Для обработки мКонтактнаяИнформация
	ОбработатьТаблицуДанныхПередВыгрузкой(ТаблицаДанных);
	
	// Выгружаем в файл
	СтруктураДанных.Справочники.Вставить("Сотрудники", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Склады
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("СписокСсылок", СписокСкладов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Спр.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(Спр.Наименование) КАК Наименование
	|ИЗ
	|	Справочник.Склады КАК Спр
	|ГДЕ
	|	Спр.Ссылка В(&СписокСсылок)";	
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	// Заполняем ГУИДы
	Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл 		
		ТекущаяСтрока.ГУИД = Строка(ТекущаяСтрока.Ссылка.УникальныйИдентификатор());
	КонецЦикла;
	
	// Удаляем колонку "Ссылка"
	ТаблицаДанных.Колонки.Удалить(ТаблицаДанных.Колонки.Найти("Ссылка"));
	
	// Выгружаем в файл
	СтруктураДанных.Справочники.Вставить("Склады", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Договоры
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("СписокСсылок", СписокДоговоров);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК ГУИД,
	|	Спр.Ссылка КАК Ссылка,
	|	""00000000-0000-0000-0000-000000000000"" КАК КонтрагентГУИД,
	|	Спр.Владелец КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(Спр.Наименование) КАК Наименование
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Спр
	|ГДЕ
	|	Спр.Ссылка В(&СписокСсылок)";	
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	// Заполняем ГУИДы
	Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл 		
		ТекущаяСтрока.ГУИД = Строка(ТекущаяСтрока.Ссылка.УникальныйИдентификатор());
		ТекущаяСтрока.КонтрагентГУИД = Строка(ТекущаяСтрока.Контрагент.УникальныйИдентификатор());
	КонецЦикла;
	
	// Удаляем колонку "Ссылка"
	ТаблицаДанных.Колонки.Удалить(ТаблицаДанных.Колонки.Найти("Ссылка"));
	ТаблицаДанных.Колонки.Удалить(ТаблицаДанных.Колонки.Найти("Контрагент"));
	
	// Выгружаем в файл
	СтруктураДанных.Справочники.Вставить("Договоры", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных));
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
КонецПроцедуры

