
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ДополнительныйКлючОтчета", "ЭффективностьТочекПродаж");
	//ПараметрыФормы.Вставить("ОтчетНаименование", "Эффективность точек продаж");
	
	ОткрытьФорму("Отчет.ЭффективностьТочекПродаж.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
