
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если не Объект.ВидСтатистики.Пустая() Тогда
		Если не Объект.ВидСтатистики.Аналитика1.Пустая() Тогда
			Элементы.Аналитика1.Заголовок = Объект.ВидСтатистики.Аналитика1.Наименование;
			Элементы.Аналитика1.Доступность = Истина;
		Конецесли;
		
		Если не ЗначениеЗаполнено(Объект.Аналитика1) Тогда
			УстановитьТип(Объект.ВидСтатистики.Аналитика1.ТипАналитикиПолный,Элементы.Аналитика1, Объект.Аналитика1);
		КонецЕсли;
		
		Если не Объект.ВидСтатистики.Аналитика2.Пустая() Тогда
			Элементы.Аналитика2.Заголовок = Объект.ВидСтатистики.Аналитика2.Наименование;
			Элементы.Аналитика2.Доступность = Истина;
		Конецесли;
		
		Если не ЗначениеЗаполнено(Объект.Аналитика2) Тогда
			УстановитьТип(Объект.ВидСтатистики.Аналитика2.ТипАналитикиПолный,Элементы.Аналитика2, Объект.Аналитика2);
		КонецЕсли;
		
		Если не Объект.ВидСтатистики.Аналитика3.Пустая() Тогда
			Элементы.Аналитика3.Заголовок = Объект.ВидСтатистики.Аналитика3.Наименование;
			Элементы.Аналитика3.Доступность = Истина;
		Конецесли;
		
		Если не ЗначениеЗаполнено(Объект.Аналитика3) Тогда
			УстановитьТип(Объект.ВидСтатистики.Аналитика3.ТипАналитикиПолный,Элементы.Аналитика3, Объект.Аналитика3);
		КонецЕсли;
		
	КонецЕсли;
	
	ВопросыПроверочногоСпискаУстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТип(ЗначТип,ЭлФормы,Рекв)
	Если ЗначТип = "" Тогда
		Возврат
	КонецЕсли;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип(ЗначТип));       
	Стр = Новый ОписаниеТипов(Массив);
	ЭлФормы.ОграничениеТипа = Стр;                 
	ЭлФормы.ОграничениеТипа.ПривестиЗначение();
	
	ЗначТип1 = ЗначТип;
	ЗначТип1 = СтрЗаменить(ЗначТип1, "СправочникСсылка", "Справочники");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ДокументСсылка", "Документы");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ПеречислениеСсылка", "Перечисления");
	Если ЗначТип1 = "" Тогда 		
		Рекв = Справочники.ИА_ЗначениеАналитики.ПустаяСсылка();
	ИначеЕсли ЗначТип1 = "Булево" тогда 
		Рекв = Ложь;
	ИначеЕсли  ЗначТип1 = "Строка" тогда	
		Рекв = "";
	ИначеЕсли ЗначТип1 = "Число" тогда
		Рекв = 0;
	ИначеЕсли ЗначТип1 = "Дата" тогда
		Рекв = Дата("01010001");
	Иначе
		Рекв = Вычислить(ЗначТип1+".ПустаяСсылка()");
	КонецЕсли;
	
	ЭлФормы.ВыбиратьТип = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВидСтатистикиПриИзменении(Элемент)
	Элементы.Аналитика1.Заголовок = "Аналитика1:";
	Элементы.Аналитика2.Заголовок = "Аналитика2:";
	Элементы.Аналитика3.Заголовок = "Аналитика3:";
	Аналитика1 = Неопределено;
	Аналитика2 = Неопределено;
	Аналитика3 = Неопределено;
	
	СтатистикиВидСтатистикиПриИзменении_Сервер();
КонецПроцедуры

&НаСервере
Процедура СтатистикиВидСтатистикиПриИзменении_Сервер() Экспорт
	Элементы.Аналитика1.Видимость = Ложь;
	Элементы.Аналитика2.Видимость = Ложь;
	Элементы.Аналитика3.Видимость = Ложь;
	
	Если не Объект.ВидСтатистики.Пустая() Тогда
		Если не Объект.ВидСтатистики.Аналитика1.Пустая() Тогда
			Элементы.Аналитика1.Заголовок = Объект.ВидСтатистики.Аналитика1.Наименование;
			УстановитьТип(Объект.ВидСтатистики.Аналитика1.ТипАналитикиПолный,Элементы.Аналитика1,Объект.Аналитика1);	
			Элементы.Аналитика1.Видимость = Истина;	
		Конецесли;
		
		Если не Объект.ВидСтатистики.Аналитика2.Пустая() Тогда
			Элементы.Аналитика2.Заголовок = Объект.ВидСтатистики.Аналитика2.Наименование;
			УстановитьТип(Объект.ВидСтатистики.Аналитика2.ТипАналитикиПолный,Элементы.Аналитика2,Объект.Аналитика2);
			Элементы.Аналитика2.Видимость = Истина;	
		Конецесли;
		
		Если не Объект.ВидСтатистики.Аналитика3.Пустая() Тогда
			Элементы.Аналитика3.Заголовок = Объект.ВидСтатистики.Аналитика3.Наименование;
			УстановитьТип(Объект.ВидСтатистики.Аналитика3.ТипАналитикиПолный,Элементы.Аналитика3,Объект.Аналитика3);
			Элементы.Аналитика3.Видимость = Истина;	
		Конецесли;
	КонецЕсли;
	
	//ИА_Арчил Тваладзе 2016.05.20
	ВопросыПроверочногоСпискаУстановитьВидимость();
	ВопросыПроверочногоСпискаЗаполнить();
	//Конец Арчил Тваладзе
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(1, Элемент, Неопределено, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитика2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(2, Элемент, Неопределено, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитика3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(3, Элемент, Неопределено, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАналитики(номерАналитики, Элемент, тд, СтандартнаяОбработка)
	пт = ПолучитьПолныйТип(ОБъект.ВидСтатистики, номерАналитики);
	Если пт = "СправочникСсылка.ИА_ЗначениеАналитики" или пт = "" Тогда
		СтандартнаяОбработка = Ложь;
		
		СтруктураОтбора = Новый Структура("Владелец", ПолучитьЗначениеАналитики(Объект.ВидСтатистики,номерАналитики));
		//ПараметрыВыбора = Новый Структура("Отбор", СтруктураОтбора);
		
		зн = ОткрытьФормуМодально("Справочник.ИА_ЗначениеАналитики.Форма.ФормаВыбораУпр", СтруктураОтбора);
		
		Если ЗначениеЗаполнено(зн) Тогда
			Объект["Аналитика"+номерАналитики] = зн;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПолныйТип(ВидСтатистики, номерАналитики)
	Возврат ВидСтатистики["Аналитика"+номерАналитики].ТипАналитикиПолный;
КонецФункции

&НаСервере
Функция ПолучитьЗначениеАналитики(ВидСтатистики, номерАналитики)
	Возврат ВидСтатистики["Аналитика"+номерАналитики];
КонецФункции

//ИА_Арчил Тваладзе 2016.06.16
&НаСервере
Процедура ВопросыПроверочногоСпискаУстановитьВидимость()
	
	Если ЗначениеЗаполнено(Объект.ВидСтатистики) Тогда
		Элементы.ВопросыПроверочногоСписка.Видимость = ЗначениеЗаполнено(ИА_КСУОбщийСервер.ПолучитьЗначениеРеквизита(Объект.ВидСтатистики, "ПроверочныйСписок"));
		Элементы.Количество.ТолькоПросмотр = Элементы.ВопросыПроверочногоСписка.Видимость;
	Иначе
		Элементы.ВопросыПроверочногоСписка.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ВопросыПроверочногоСпискаЗаполнить()
	
	Если Не ЗначениеЗаполнено(Объект.ВидСтатистики) Тогда
		Объект.ВопросыПроверочногоСписка.Очистить();
		Возврат;
	КонецЕсли; 
	
	ПроверочныйСписок = ИА_КСУОбщийСервер.ПолучитьЗначениеРеквизита(Объект.ВидСтатистики, "ПроверочныйСписок");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_ВопросыПроверочногоСписка.Ссылка КАК Вопрос,
	|	ИА_ВопросыПроверочногоСписка.ВариантныйОтвет КАК ВариантныйОтвет,
	|	ИА_ВопросыПроверочногоСписка.ОтветВопроса КАК ОтветВопроса,
	|	ВЫБОР
	|		КОГДА НЕ ИА_ВопросыПроверочногоСписка.ВариантныйОтвет
	|				И ИА_ВопросыПроверочногоСписка.ОтветВопроса = 1
	|			ТОГДА 0
	|		КОГДА НЕ ИА_ВопросыПроверочногоСписка.ВариантныйОтвет
	|				И ИА_ВопросыПроверочногоСписка.ОтветВопроса = 2
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Ответ
	|ИЗ
	|	Справочник.ИА_ВопросыПроверочногоСписка КАК ИА_ВопросыПроверочногоСписка
	|ГДЕ
	|	ИА_ВопросыПроверочногоСписка.Владелец = &ПроверочныйСписок
	|	И НЕ ИА_ВопросыПроверочногоСписка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ПроверочныйСписок", ПроверочныйСписок);
	Объект.ВопросыПроверочногоСписка.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаВопросНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаВопросОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаОтветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	ТекущаяСтрока = Элементы.ВопросыПроверочногоСписка.ТекущиеДанные;
	Если ТекущаяСтрока.ВариантныйОтвет Тогда
		СтандартнаяОбработка = Ложь;
		ВыбранноеЗначение = Неопределено;
		
		ВыбранноеЗначение = ВыбратьИзСписка(ПолучитьСписокОтветов(ТекущаяСтрока.Вопрос));
		ТекущаяСтрока.Ответ = ?(ВыбранноеЗначение = Неопределено, Неопределено, ВыбранноеЗначение.Значение);
		
		ПересчитатьБаллСтроки(ТекущаяСтрока);
		
		Модифицированность = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьБаллСтроки(ТекСтрока)
	
	Если ТекСтрока.Ответ <> Неопределено Тогда
		ТекСтрока.Балл = РассчитатьБаллВСтроке(ТекСтрока.Вопрос, ТекСтрока.ВариантныйОтвет, ТекСтрока.Ответ);		
	Иначе
		ТекСтрока.Балл = 0;
	КонецЕсли; 
	
	итого = 0;
	Для каждого стр из Объект.ВопросыПроверочногоСписка Цикл
		итого = итого + стр.Балл;
	КонецЦикла;
	Объект.Количество = итого;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокОтветов(Вопрос)
	
	СписокОтветов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИА_ВопросыПроверочногоСпискаВариантыОтветов.Ответ
	|ИЗ
	|	Справочник.ИА_ВопросыПроверочногоСписка.ВариантыОтветов КАК ИА_ВопросыПроверочногоСпискаВариантыОтветов
	|ГДЕ
	|	ИА_ВопросыПроверочногоСпискаВариантыОтветов.Ссылка = &Вопрос";
	
	Запрос.УстановитьПараметр("Вопрос", Вопрос);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокОтветов.Добавить(Выборка.Ответ);
	КонецЦикла; 
	
	Возврат СписокОтветов;
	
КонецФункции

&НаСервереБезКонтекста
Функция РассчитатьБаллВСтроке(Вопрос, ВариантныйОтвет, Ответ)
	
	БаллВСтроке = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вопрос", Вопрос);
	Запрос.УстановитьПараметр("Ответ", Ответ);
	Запрос.УстановитьПараметр("ВариантныйОтвет", ВариантныйОтвет);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИА_ВопросыПроверочногоСпискаВариантыОтветов.Балл
	|ИЗ
	|	Справочник.ИА_ВопросыПроверочногоСписка.ВариантыОтветов КАК ИА_ВопросыПроверочногоСпискаВариантыОтветов
	|ГДЕ
	|	ИА_ВопросыПроверочногоСпискаВариантыОтветов.Ссылка = &Вопрос
	|	И ИА_ВопросыПроверочногоСпискаВариантыОтветов.Ответ = &Ответ
	|	И &ВариантныйОтвет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИА_ВопросыПроверочногоСписка.БаллВопроса
	|ИЗ
	|	Справочник.ИА_ВопросыПроверочногоСписка КАК ИА_ВопросыПроверочногоСписка
	|ГДЕ
	|	ИА_ВопросыПроверочногоСписка.Ссылка = &Вопрос
	|	И НЕ &ВариантныйОтвет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		БаллВСтроке = Выборка.Балл;		
	КонецЕсли;
	Если Не ВариантныйОтвет И (ТипЗНЧ(Ответ) = Тип("Булево") ИЛИ ТипЗНЧ(Ответ) = Тип("Число")) Тогда
		БаллВСтроке = БаллВСтроке * Ответ;		
	КонецЕсли; 
	
	Возврат БаллВСтроке;
	
КонецФункции

&НаКлиенте
Процедура ВопросыПроверочногоСпискаОтветОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ВопросыПроверочногоСписка.ТекущиеДанные;
	ТекущаяСтрока.Балл = 0;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ВопросыПроверочногоСпискаЗаполнитьСлужебныеРеквизиты();
	
КонецПроцедуры

&НаСервере
Процедура ВопросыПроверочногоСпискаЗаполнитьСлужебныеРеквизиты()
	
	Если Объект.ВопросыПроверочногоСписка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_СтатистикаВопросыПроверочногоСписка.Вопрос,
	|	ИА_ВопросыПроверочногоСписка.ВариантныйОтвет,
	|	ИА_ВопросыПроверочногоСписка.ОтветВопроса
	|ИЗ
	|	Документ.ИА_Статистика.ВопросыПроверочногоСписка КАК ИА_СтатистикаВопросыПроверочногоСписка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_ВопросыПроверочногоСписка КАК ИА_ВопросыПроверочногоСписка
	|		ПО ИА_СтатистикаВопросыПроверочногоСписка.Вопрос = ИА_ВопросыПроверочногоСписка.Ссылка
	|ГДЕ
	|	ИА_СтатистикаВопросыПроверочногоСписка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Отбор = Новый Структура;
	Пока Выборка.Следующий() Цикл
		Отбор.Вставить("Вопрос", Выборка.Вопрос);
		МассивСтрок = Объект.ВопросыПроверочногоСписка.НайтиСтроки(Отбор);
		Для Каждого СтрокаТЧ Из МассивСтрок Цикл
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка, "ВариантныйОтвет, ОтветВопроса");
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаПриАктивизацииЯчейки(Элемент)
	эл = Элемент.ТекущийЭлемент;
	Если эл.Имя = "ВопросыПроверочногоСпискаОтвет" Тогда
		тд = Элементы.ВопросыПроверочногоСписка.ТекущиеДанные;
		Если тд<>Неопределено Тогда
			Если тд.ВариантныйОтвет Тогда
				эл.ВыбиратьТип = истина;
			Иначе
				эл.ВыбиратьТип = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаОтветПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ВопросыПроверочногоСписка.ТекущиеДанные;
	ПересчитатьБаллСтроки(ТекущаяСтрока);
КонецПроцедуры
//Конец Арчил Тваладзе
