
Процедура ПередЗаписью(Отказ)
	
	// заполним тип задачи
	Если ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Задача И Не Родитель.Пустая() Тогда
		ТекРод = Родитель;
		
		Пока ЗначениеЗаполнено(ТекРод) Цикл
			Если ТекРод.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.ТипЗадачи Тогда
				ТипЗадачи = ТекРод.ТипЗадачи;
				Прервать;
			КонецЕсли;
			ТекРод = ТекРод.Родитель;
		КонецЦикла;
	КонецЕсли;
	
	Если не Ссылка.Пустая() и не ЭтотОбъект.Задача.Пустая() и (Ссылка.Срок <> ЭтотОбъект.Срок ИЛИ Ссылка.Ответственный <> ЭтотОбъект.Ответственный)  ТОгда
		ЗадачаОб = ЭтотОбъект.Задача.ПолучитьОбъект();
		ЗадачаОб.СрокИсполнения = ЭтотОбъект.Срок;
		ЗадачаОб.Пост = ЭтотОбъект.Ответственный;
		ЗадачаОб.Записать();
	КонецЕсли;
КонецПроцедуры

