Процедура ДобавитьЗаписьВИсторию(Монтаж, Дата, Пользователь, ИДЗаписи, Текст) Экспорт
	
	НаборЗаписей = РегистрыСведений.ИсторияМонтажа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Монтаж.Установить(Монтаж); 
	НаборЗаписей.Отбор.Дата.Установить(Дата); 
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь); 
	НаборЗаписей.Отбор.ИДЗаписи.Установить(ИДЗаписи); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Монтаж = Монтаж; 
	НоваяЗапись.Дата = Дата;
	НоваяЗапись.Пользователь = Пользователь;	
	НоваяЗапись.ИДЗаписи = ИДЗаписи;
	НоваяЗапись.Комментарий = Текст;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры