
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();	 
	ПараметрыОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	//#12463 закомментировано
	//НастройкаМонитора = ПараметрыСеанса.ТекущийПользователь.ИспользуемаяНастройкаМонитораПульсРозницы;
	//Если НастройкаМонитора.Пустая() Тогда
	//	НастройкаМонитора = Справочники.УДАЛИТЬ_НастройкиМонитораПульсРозницы.НастройкаПоУмолчанию;
	//КонецЕсли;
	
	// #14817 кассы берем из самого отчета
	//СписокКассДляВыручки = Новый СписокЗначений;
	////Для каждого СтрокаКассы из НастройкаМонитора.КассыДляОтбораВВыручку Цикл
	////	СписокКассДляВыручки.Добавить(СтрокаКассы.Касса);
	////КонецЦикла;
	//ИспользоватьОтборПоКассам = СписокКассДляВыручки.Количество() > 0;
	Параметр = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Кассы"));
	ИспользоватьОтборПоКассам = Ложь;
	Если ТипЗнч(Параметр.Значение) = Тип("СправочникСсылка.Кассы") Тогда
		ИспользоватьОтборПоКассам = ЗначениеЗаполнено(Параметр.Значение);
	ИначеЕсли ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") Тогда
	    ИспользоватьОтборПоКассам = Параметр.Значение.Количество() > 0;
	КонецЕсли;
	
	Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИспользоватьОтборПоКассам"));
	Параметр.Значение = ИспользоватьОтборПоКассам;
	//Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокКассДляВыручки"));
	//Параметр.Значение = СписокКассДляВыручки;
	
	// выводим заголовок при вызове из пульса на начальной странице
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючВарианта") И КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючВарианта = "ПоРегистратору" Тогда
		ПараметрыВывода = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы;
		КоллекцияЭлементовОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
		
		НайденЭлементОтбораПриоритет = Ложь;
		ПриоритетПоказателя = 0;
		Для каждого ЭлементОтбора Из КоллекцияЭлементовОтбора Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПриоритетПоказателя") Тогда
				НайденЭлементОтбораПриоритет = Истина;
				ПриоритетПоказателя = ЭлементОтбора.ПравоеЗначение;
				Прервать;
			КонецЕсли;
		КонецЦикла;		
		
		Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		Если НайденЭлементОтбораПриоритет И НЕ Параметр = Неопределено Тогда
			Если НачалоДня(Параметр.Значение.ДатаНачала) = НачалоДня(Параметр.Значение.ДатаОкончания) Тогда
				СоответствиеЗаголовков = ПолучитьСоответствиеЗаголовков();
				ПараметрыВывода.Найти("ВыводитьЗаголовок").Использование = Истина;
				ПараметрыВывода.Найти("ВыводитьЗаголовок").Значение      = ТипВыводаТекстаКомпоновкиДанных.Выводить; 
				ПараметрыВывода.Найти("Заголовок").Использование         = Истина;
				ПараметрыВывода.Найти("Заголовок").Значение              = СоответствиеЗаголовков.Получить(ПриоритетПоказателя) + " " + Формат(Параметр.Значение.ДатаНачала, "ДФ='dd.MM.yyyy ''г.'''");				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСоответствиеЗаголовков()
	
	СоответствиеЗаголовков = Новый Соответствие;
	СоответствиеЗаголовков.Вставить(1, "Лиды");
	СоответствиеЗаголовков.Вставить(2, "Нецелевые");
	СоответствиеЗаголовков.Вставить(3, "Целевые");
	СоответствиеЗаголовков.Вставить(4, "Отказы");
	СоответствиеЗаголовков.Вставить(5, "Созданные замеры"); //"Замеры, назначенные в этот день");
	СоответствиеЗаголовков.Вставить(6, "Запланированные замеры"); //"Замеры, назначенные на этот день");
	СоответствиеЗаголовков.Вставить(7, "Выполненные замеры"); //"Замеры, назначенные на этот день (выполнены)");
	СоответствиеЗаголовков.Вставить(8, "Замеры в работе");
	СоответствиеЗаголовков.Вставить(9, "Отмененные замеры"); //"Замеры, назначенные на этот день (отменены)");
	СоответствиеЗаголовков.Вставить(10, "Количество договоров");
	СоответствиеЗаголовков.Вставить(11, "Монтажи");
	СоответствиеЗаголовков.Вставить(12, "Сервисные заявки");
	СоответствиеЗаголовков.Вставить(13, "Рекламации");
	СоответствиеЗаголовков.Вставить(14, "Сумма договоров");
	СоответствиеЗаголовков.Вставить(15, "Сумма выполненных монтажей");
	СоответствиеЗаголовков.Вставить(16, "Сумма сервисных заявок");
	СоответствиеЗаголовков.Вставить(17, "Выручка");
	
	Возврат СоответствиеЗаголовков;
	
КонецФункции