

Процедура ПередЗаписью(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли; // ИА_Аврамов 06.11.2014 
    
    //{ ИА_Аврамов 06.11.2014
    // Согласно текущей логики не д.б. спец. символов в "наименование"
    Наименование = СтрЗаменить(Наименование, """", "'");
    Наименование = СтрЗаменить(Наименование, "%",  "_");
    //} 
     
	Если не ЭтоНовый() Тогда
		НачатьТранзакцию();
		Попытка
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ИА_НастройкаФППолитикаРаспределенияПервичная.Ссылка
			               |ИЗ
			               |	Документ.ИА_ФП_Настройка.Политика1 КАК ИА_НастройкаФППолитикаРаспределенияПервичная
			               |ГДЕ
			               |	ИА_НастройкаФППолитикаРаспределенияПервичная.Значение ПОДОБНО ""%$"+ВРЕГ(ссылка.Наименование)+"]%""
						   | ОБЪЕДИНИТЬ ВСЕ 
						   |ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ПолитикаРаспределения.Ссылка
			               |ИЗ
			               |	Документ.ИА_ФП_Настройка.Политика2 КАК ПолитикаРаспределения
			               |ГДЕ
			               |	ПолитикаРаспределения.Значение ПОДОБНО ""%$"+ВРЕГ(ссылка.Наименование)+"]%"" ";
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ДокОб = Выборка.Ссылка.ПолучитьОбъект();
				Для каждого стр из ДокОб.Политика1 Цикл
					стр.Значение = СтрЗаменить(стр.Значение,"$"+ВРЕГ(ссылка.Наименование)+"]", "$"+ВРЕГ(ЭтотОбъект.Наименование)+"]"); 
				КонецЦикла;
				
				Для каждого стр из ДокОб.Политика2 Цикл
					стр.Значение = СтрЗаменить(стр.Значение,"$"+ВРЕГ(ссылка.Наименование)+"]", "$"+ВРЕГ(ЭтотОбъект.Наименование)+"]"); 
				КонецЦикла;
				
				ДокОб.Записать();
			КонецЦикла;
		Исключение               
			Сообщить(ОписаниеОшибки());
			ОтменитьТранзакцию();
			Отказ = истина;
			Возврат;
		КонецПопытки;
		
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры