#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		НеобходимыеРеквизиты = "ОсновнаяСпецификация, ОсновнаяСпецификацияКомплектация, ОсновнаяСпецификацияСопутствующиеМатериалы";
		ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, НеобходимыеРеквизиты);
		// если ВидСпецификации заполнен и был пустой, но был основным в номенклатуре, тогда заменим в номенклатуре признак 
		// (используется при первом ручном заполнении ВидаСпецификации на версии 2.8)
		ДанныеНоменклатурыИзменены = Ложь;
		Если Ссылка.ВидСпецификации = Перечисления.ВидыСпецификации.ПустаяСсылка()
			И ЗначениеЗаполнено(ВидСпецификации)
			И (ДанныеНоменклатуры.ОсновнаяСпецификация = Ссылка
			    ИЛИ ДанныеНоменклатуры.ОсновнаяСпецификацияСопутствующиеМатериалы = Ссылка
				ИЛИ ДанныеНоменклатуры.ОсновнаяСпецификацияКомплектация = Ссылка) Тогда
				
			ИмяРеквизитаОчистки = "ОсновнаяСпецификация";
			ИмяРеквизитаЗаполнения = "ОсновнаяСпецификация";
			Если ДанныеНоменклатуры.ОсновнаяСпецификацияСопутствующиеМатериалы = Ссылка Тогда
				ИмяРеквизитаОчистки = "ОсновнаяСпецификацияСопутствующиеМатериалы";
			ИначеЕсли ДанныеНоменклатуры.ОсновнаяСпецификацияКомплектация = Ссылка Тогда
				ИмяРеквизитаОчистки = "ОсновнаяСпецификацияКомплектация";
			КонецЕсли;
			Если ВидСпецификации = Перечисления.ВидыСпецификации.СопутствующиеМатериалы Тогда
				ИмяРеквизитаЗаполнения = "ОсновнаяСпецификацияСопутствующиеМатериалы";
			ИначеЕсли ВидСпецификации = Перечисления.ВидыСпецификации.Комплектация Тогда
				ИмяРеквизитаЗаполнения = "ОсновнаяСпецификацияКомплектация";
			КонецЕсли;
			
			Если НЕ ИмяРеквизитаОчистки = ИмяРеквизитаЗаполнения Тогда
				НоменклатураОбъект = Владелец.ПолучитьОбъект();
				НоменклатураОбъект[ИмяРеквизитаОчистки] = Справочники.Спецификации.ПустаяСсылка();
				НоменклатураОбъект[ИмяРеквизитаЗаполнения] = Ссылка;
				Попытка
					НоменклатураОбъект.Записать();
					ДанныеНоменклатурыИзменены = Истина;
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка сохранения владельца: " + ОписаниеОшибки(), , ,  ,Отказ);
					Возврат;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеНоменклатурыИзменены Тогда
			ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, НеобходимыеРеквизиты); // получаем еще раз после записи
		КонецЕсли;
		Если (ДанныеНоменклатуры.ОсновнаяСпецификация = Ссылка 
			И НЕ ВидСпецификации = Перечисления.ВидыСпецификации.СпецификацияПродукции) 
			ИЛИ  (ДанныеНоменклатуры.ОсновнаяСпецификацияСопутствующиеМатериалы = Ссылка 
			И НЕ ВидСпецификации = Перечисления.ВидыСпецификации.СопутствующиеМатериалы)
			ИЛИ  (ДанныеНоменклатуры.ОсновнаяСпецификацияКомплектация = Ссылка 
			И НЕ ВидСпецификации = Перечисления.ВидыСпецификации.Комплектация)
			Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид спецификации не соответствует выбранному виду основной спецификации номенклатуры", , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли