
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Док = Параметры.Док;
	Заголовок = "Точка безубыточности " + Док.Номер;
	Элементы.ДекорацияМесяц.Заголовок = ФОРМАТ(Док.Месяц, "ДФ='ММММ, yyyy'");
	ДокументыФП.Параметры.УстановитьЗначениеПараметра("МесяцТБ", Док.Месяц);
	ДокументыФП.Параметры.УстановитьЗначениеПараметра("Организация", Док.Организация);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДокументыФППриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Для каждого стр из Строки Цикл
		стрД = стр.Значение.Данные;
		
		стрД.Документ = "ФП " + Прав(стрД.Номер, 3) + ", неделя " + стрД.НомерНедели + " ("+стрД.КолДней+" дн) " + лев(формат(стрД.НачалоНедели, "ДФ=dd.MM"),6) + " – " + лев(формат(стрД.КонецНедели, "ДФ=dd.MM"), 6);
	КонецЦикла;
КонецПроцедуры
