
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвиженияСтатусыЗНО = Движения.ИА_ИсторияСтатусовЗВС;
	ДвиженияСтатусыЗНО.Записывать = истина;
	ДвиженияСтатусыЗНО.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ИсторияСтатусовЗВС.Период,
		|	ИА_ИсторияСтатусовЗВС.ЗВС,
		|	ИА_ИсторияСтатусовЗВС.Статус,
		|	ИА_ИсторияСтатусовЗВС.ПричинаОтказа
		|ИЗ
		|	РегистрСведений.ИА_ИсторияСтатусовЗВС КАК ИА_ИсторияСтатусовЗВС
		|ГДЕ
		|	ИА_ИсторияСтатусовЗВС.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	ТаблицаДвиженийДокумента = РезультатЗапроса.Выгрузить();
	
	КоличествоЗаписей = ТаблицаДвиженийДокумента.Количество(); 
	Если КоличествоЗаписей = 0 Тогда
		ПоследнийСтатус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ПустаяСсылка");
		ПоследняяПричинаОтказа = "";
	иначе
		ПоследнийСтатус = ТаблицаДвиженийДокумента[КоличествоЗаписей - 1].Статус;		 
		ПоследняяПричинаОтказа = ТаблицаДвиженийДокумента[КоличествоЗаписей - 1].ПричинаОтказа;		 
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Статус") Тогда
		Статус = ДополнительныеСвойства.Статус;
	Иначе
		Статус = ПоследнийСтатус;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПричинаОтказа") Тогда
		ПричинаОтказа = ДополнительныеСвойства.ПричинаОтказа;
	Иначе
		ПричинаОтказа = ПоследняяПричинаОтказа;
	КонецЕсли;
	
	//Если ПоследнийСтатус <> Статус и не (ТаблицаДвиженийДокумента.Найти(Перечисления.ИА_СостояниеЗаказа.Подготовлен)<>Неопределено И Статус = Перечисления.ИА_СостояниеЗаказа.Подготовлен) Тогда
	//	
	//	СтрокаТаблицыДвижений = ТаблицаДвиженийДокумента.Добавить();
	//	СтрокаТаблицыДвижений.Период = ?(Статус = Перечисления.ИА_СостояниеЗаказа.Отклонен, ТекущаяДата(), Дата);
	//	СтрокаТаблицыДвижений.ЗВС = Ссылка;
	//	СтрокаТаблицыДвижений.Статус = Статус;
	//	СтрокаТаблицыДвижений.ПричинаОтказа = ПричинаОтказа;
	//	
	//КонецЕсли;
	
	СтрокаТаблицыДвижений = ДвиженияСтатусыЗНО.Добавить();
	СтрокаТаблицыДвижений.Период = Дата;
	СтрокаТаблицыДвижений.ЗВС = Ссылка;
	СтрокаТаблицыДвижений.Статус = Статус;
	СтрокаТаблицыДвижений.ПричинаОтказа = ПричинаОтказа;
	
	//ДвиженияСтатусыЗНО.Загрузить(ТаблицаДвиженийДокумента);
	ДвиженияСтатусыЗНО.Записать();
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НовыйСтатус = Неопределено;
	
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("Статус",НовыйСтатус) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_ИсторияСтатусовЗВССрезПоследних.Статус
		               |ИЗ
		               |	РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних(, ЗВС = &ЗВС) КАК ИА_ИсторияСтатусовЗВССрезПоследних";
		
		Запрос.УстановитьПараметр("ЗВС", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда 
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		НовыйСтатус = Выборка.Статус;
		
	КонецЕсли;
	
	Если НовыйСтатус <> Перечисления.ИА_СостояниеЗаказа.Подготовлен Тогда
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отменить проведение документа - " + Ссылка + ", можно только в статусе ""Подготовлен""";
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

