&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//#8113
	ИнформацияОСтатусеЛида = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Статус лида: %1 -> %2", Параметры.ТекущийСтатус, Параметры.СтатусПерехода);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаБудетОпределенаПоЗвонкуПриИзменении(Элемент)
	
	Если ДатаБудетОпределенаПоЗвонку Тогда
		ДатаМонтажа  = Дата(1,1,1); //"";
		ВремяМонтажа = Дата(1,1,1); //"";
		Элементы.ДатаМонтажа.Доступность = Ложь;
		Элементы.ВремяМонтажа.Доступность = Ложь;
	Иначе
		Элементы.ДатаМонтажа.Доступность = Истина;
		Элементы.ВремяМонтажа.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("СуммаДоговора",СуммаДоговора);
	СтруктураОтвета.Вставить("СуммаАвансаНаЗамере",СуммаАвансаНаЗамере);
	СтруктураОтвета.Вставить("ДатаМонтажа",ДатаМонтажа);
	СтруктураОтвета.Вставить("ВремяМонтажа",ВремяМонтажа);
	СтруктураОтвета.Вставить("ДатаБудетОпределенаПоЗвонку",ДатаБудетОпределенаПоЗвонку);
	СтруктураОтвета.Вставить("Комментарий",Комментарий);
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры


