
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ИА_ИзучениеДИ.Записывать = Истина;
	Движения.ИА_ИзучениеДИ.Очистить();
	Для Каждого ТекСтрокаИнструкции Из Инструкции Цикл
		Движение = Движения.ИА_ИзучениеДИ.Добавить();
		Движение.Период = Дата;
		Движение.Инструкция = ТекСтрокаИнструкции.Инструкция;
		Движение.Пользователь = Сотрудник;
		Движение.ДатаСдачи = ТекСтрокаИнструкции.ДатаСдачи;
		Движение.СрокСдачи = Срок;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения и Автор <> ПараметрыСеанса.ТекущийПользователь и не ОбменДанными.Загрузка Тогда
		Сообщить("Отменить может только автор");
		Отказ = истинА;
	КонецЕсли;
	
	сч = Вопросы.Количество()-1;
	Пока сч>=0 Цикл
		если Инструкции.Найти(Вопросы[сч].УИДстроки,"УИДстроки")= Неопределено Тогда
			Вопросы.Удалить(сч);
		КонецЕсли;
		сч = сч -1;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	вопросы.Очистить();
	
	Для каждого стрДИ из Инструкции Цикл
		стрДИ.ДатаСдачи = Дата(1,1,1);
		стрДИ.Изучено = Ложь;
		стрДИ.Сдано = Ложь;
		
		Для каждого стрВопрос из стрДИ.Инструкция.Вопросы Цикл
			новстрВопрос = Вопросы.Добавить();
			новстрВопрос.Вопрос = стрВопрос.Вопрос;
			новстрВопрос.УИДстроки = стрДИ.УИДстроки;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
