
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоСМСКотправке = Параметры.КоличествоПросроченных;
	
	Если Константы.ЕВостокИспользоватьОтправкуСМС.Получить() 
		ИЛИ Константы.СМСFlyИспользоватьОтправкуСМС.Получить() Тогда
		БалансСМС = РаботаССМС.ПолучитьБаланс(Константы.ЕВостокСМСЛогин.Получить(),
											  Константы.ЕВостокСМСПароль.Получить(),
											  Константы.ЕВостокСМСНомерСервиса.Получить());
	Иначе
		Элементы.БалансСМС.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КоличествоСМСКотправкеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.СМСКОтправке.ФормаСписка");
КонецПроцедуры
