
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// сделано как таблицаЗначений, чтобы задать ПараметрыВыбора
	МассивЗамерщиков = Параметры.МассивЗамерщиков;
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Сотрудник");
	Для Инд = 0 По МассивЗамерщиков.Вграница() Цикл
		тз.Добавить();
	КонецЦикла;
	тз.ЗагрузитьКолонку(МассивЗамерщиков, "Сотрудник");
	Замерщики.Загрузить(тз);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	МассивЗамерщиков = Новый Массив;
	Для каждого СтрокаЗамерщик из Замерщики Цикл
		Если ЗначениеЗаполнено(СтрокаЗамерщик.Сотрудник) Тогда
			МассивЗамерщиков.Добавить(СтрокаЗамерщик.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	Закрыть(МассивЗамерщиков);
	
КонецПроцедуры

