&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//СброситьРазмерыИПоложениеОкна
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеСистемныхНастроек.Удалить("ОбщаяФорма.ПросмотрРазличийДокументов/Такси/НастройкиОкна", "", "");
	УстановитьПривилегированныйРежим(Ложь);
	КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);

	Параметры.Свойство("ТекстСообщения", Элементы.ДекорацияТекстСообщения.Заголовок);
	
	СкрыватьКнопки = Ложь;
	Параметры.Свойство("ТолькоПросмотр", СкрыватьКнопки);
	
	Если НЕ СкрыватьКнопки Тогда
		Если Параметры.Свойство("ЕстьВыпуск") И Параметры.Свойство("ДоступноИзменениеПриНаличииВыпуска") Тогда
			Если Параметры.ЕстьВыпуск И НЕ Параметры.ДоступноИзменениеПриНаличииВыпуска Тогда
				СкрыватьКнопки = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.КомандаДа.Видимость = НЕ СкрыватьКнопки;
	Элементы.КомандаНет.Заголовок = ?(НЕ СкрыватьКнопки, "Нет", "Закрыть");
	
	Если Параметры.ВидДокумента = "Монтаж" Тогда
		СформироватьМакетРазличийПоМонтажу(Параметры.МассивДокумента1, Параметры.МассивДокумента2, Параметры.Документ1, Параметры.Документ2);
	Иначе
		
		//++ №14311 показываем различия сразу по нескольким документам (используется из Заказа покупателя)
		Если Параметры.Свойство("МассивДокументов") Тогда
			
			Для Каждого ТекущийДокумент Из Параметры.МассивДокументов Цикл
				СформироватьМакетРазличий(ТекущийДокумент.МассивСравнения, ТекущийДокумент.ЗаказПокупателя, ТекущийДокумент.ЗаказНаПроизводство, ТекущийДокумент.МассивРазличийРеквизитов);
			КонецЦикла;
			
		Иначе
		//-- №14311
		
			//++ №13466
			//СформироватьМакетРазличий(Параметры.МассивДокумента1, Параметры.МассивДокумента2, Параметры.Документ1, Параметры.Документ2, Параметры.МассивРазличийРеквизитов);
			СформироватьМакетРазличий(Параметры.МассивСравнения, Параметры.Документ1, Параметры.Документ2, Параметры.МассивРазличийРеквизитов);
			//-- №13466
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНет(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаДа(Команда)
	Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодробно(Команда)
	
	Элементы.КомандаПодробно.Пометка  = НЕ Элементы.КомандаПодробно.Пометка;
	Элементы.ГруппаПодробно.Видимость = Элементы.КомандаПодробно.Пометка;
	
КонецПроцедуры

//Различия ЗнП - ЗП
&НаСервере
Процедура СформироватьМакетРазличий(МассивСравнения, Документ1, Документ2, МассивРазличийРеквизитов) // № 3466 было: Процедура СформироватьМакетРазличий(МассивДокумента1, МассивДокумента2, Документ1, Документ2, МассивРазличийРеквизитов)

	//++ №13466 Формируем табличный документ с различиями (сравнение теперь выполняется непосредственно в ОбщийМодуль.ЗаказНаПроизводствоСоответствуетЗаказуПокупателя)
	
	// Развернем массив сравнения в таблицу значений для удобного поиска
	ТаблицаСравнения = ОбщийМодуль.ПустаяТаблицаДляСравненияЗаказовПокупателейИПроизводства();
	Для Каждого ЭлементМассива Из МассивСравнения Цикл
		
		НоваяСтрока = ТаблицаСравнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		
	КонецЦикла;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьОбщийМакет("ПросмотрРазличийДокументов");
	
	ОбластьЗаголовокДокумент 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаРеквизитов 		= Макет.ПолучитьОбласть("ШапкаРеквизитов"); 
	ОбластьСтрокаРеквизитов 	= Макет.ПолучитьОбласть("СтрокаРеквизитов");
	ОбластьШапкаТаблицы 		= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаГруппировка 	= Макет.ПолучитьОбласть("СтрокаГруппировка");
	ОбластьПустаяСтрока			= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ОбластьЗаголовокДокумент.Параметры.Документ1 = Документ1;
	ОбластьЗаголовокДокумент.Параметры.Документ2 = Документ2;
	ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумент);
		
	//++#4659
	Если МассивРазличийРеквизитов.Количество() > 0 Тогда
		ТабличныйДокумент.Вывести(ОбластьШапкаРеквизитов);
		Для каждого ДанныеРеквизита из МассивРазличийРеквизитов Цикл
			Если ДанныеРеквизита.Реквизит1 = ДанныеРеквизита.Реквизит2 Тогда
				ОбластьСтрокаРеквизитов.Параметры.Реквизит = ДанныеРеквизита.Реквизит1;
			Иначе
				ОбластьСтрокаРеквизитов.Параметры.Реквизит = "" + ДанныеРеквизита.Реквизит1 + "/" + ДанныеРеквизита.Реквизит2;
			КонецЕсли;
			ОбластьСтрокаРеквизитов.Параметры.ЗначениеРеквизита1 = ДанныеРеквизита.Значение1;
			ОбластьСтрокаРеквизитов.Параметры.ЗначениеРеквизита2 = ДанныеРеквизита.Значение2;
			ТабличныйДокумент.Вывести(ОбластьСтрокаРеквизитов);
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	КонецЕсли;
	//--#4659
		
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);	
	
	МассивВидов = новый Массив;
	МассивВидов.Добавить("Продукция");
	МассивВидов.Добавить("Услуги");
	МассивВидов.Добавить("Материалы");
	
	// Выводим различия по табличной части
	Для Каждого ВидТовара Из МассивВидов Цикл
		
		НайденныеСтроки = ТаблицаСравнения.НайтиСтроки(новый Структура("Назначение, ЕстьРазличия", ВидТовара, Истина));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		ОбластьСтрокаГруппировка.Параметры.Группировка = ВидТовара;
		ТабличныйДокумент.Вывести(ОбластьСтрокаГруппировка);
		
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			
			ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
			ОбластьСтрокаДокумента.Параметры.Заполнить(ТекущаяСтрока);
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);				
			РазукраситьСтроки(ТабличныйДокумент, НЕ ТекущаяСтрока.Найден);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	Результат.Вывести(ТабличныйДокумент);
	//-- №13466 Формируем табличный документ с различиями
	
	#Область ПрежнийВариант
	
	//++ №13466 комментируем, т.к. сравнение выполняется непосредственно в ОбщийМодуль.ЗаказНаПроизводствоСоответствуетЗаказуПокупателя
	//// при сравнении ЗП и ЗНП : 1 - ЗП, 2 - ЗНП
	//
	////развернем массивы в таблицу значений
	//ТаблицаДокумента1 = ОбщийМодуль.ПустаяТаблицаДляСравненияЗаказов();	
	//ТаблицаДокумента2 = ОбщийМодуль.ПустаяТаблицаДляСравненияЗаказов();
	//Для Каждого ЭлементМассива Из МассивДокумента1 Цикл
	// 	НоваяСтрока = ТаблицаДокумента1.Добавить();
	//    Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
	//        НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
	//	КонецЦикла;
	//КонецЦикла;
	//Для Каждого ЭлементМассива Из МассивДокумента2 Цикл
	// 	НоваяСтрока = ТаблицаДокумента2.Добавить();
	//    Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
	//        НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
	//	КонецЦикла;
	//КонецЦикла;
	//Для каждого КолонкаТЗ из ТаблицаДокумента2.Колонки Цикл
	//	КолонкаТЗ.Имя = КолонкаТЗ.Имя + "1";
	//КонецЦикла;
	//
	////в заказе покупателя у услуг и товаров УИСтроки свой - уникальный, а в Заказе на производство он равен УИСтроки продукции
	////заменим УИСтроки товара или услуги в заказе покупателя на УИСтрокиРодителя, чтобы соответствовать заказу на производство
	//Для Каждого ТекущаяСтрока Из ТаблицаДокумента1 Цикл
	//	ТекущаяСтрока.УИСтроки = ТекущаяСтрока.УИСтрокиРодителя;		
	//КонецЦикла;
	//
	////возможна такая ситуация, то во второй таблице (ЗНП) вовсе нет продукции, услуг или материалов
	////поэтому вывод секций присоединением будет кривой
	////дозаполним отсутствующие строки в ЗНП заглушками
	////продукция	
	//ОтборПоГруппировке1 = Новый Структура("Назначение", "Продукция");
	//СтрокиПродукцияЗП  = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке1);
	//Для чНом=0 По СтрокиПродукцияЗП.Количество()-1 Цикл
	//	ОтборПоГруппировке2 = Новый Структура("Назначение1, Номенклатура1", "Продукция",СтрокиПродукцияЗП[чНом].Номенклатура);
	//	Если ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке2).Количество()=0 Тогда
	//		//не нашли во второй таблице - добавляем
	//		НоваяСтрока = ТаблицаДокумента2.Добавить();
	//		НоваяСтрока.Номенклатура1 = СтрокиПродукцияЗП[чНом].Номенклатура;
	//		НоваяСтрока.Назначение1 = "Продукция";
	//		НоваяСтрока.УИСтроки1 = СтрокиПродукцияЗП[чНом].УИСтроки;
	//	КонецЕсли;
	//КонецЦикла;
	////услуги	
	//ОтборПоГруппировке1 = Новый Структура("Назначение", "Услуги");
	//СтрокиПродукцияЗП  = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке1);
	//Для чНом=0 По СтрокиПродукцияЗП.Количество()-1 Цикл
	//	ОтборПоГруппировке2 = Новый Структура("Назначение1, Номенклатура1", "Услуги",СтрокиПродукцияЗП[чНом].Номенклатура);
	//	Если ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке2).Количество()=0 Тогда
	//		//не нашли во второй таблице - добавляем
	//		НоваяСтрока = ТаблицаДокумента2.Добавить();
	//		НоваяСтрока.Номенклатура1 = СтрокиПродукцияЗП[чНом].Номенклатура;
	//		НоваяСтрока.Назначение1 = "Услуги";
	//		НоваяСтрока.УИСтроки1 = СтрокиПродукцияЗП[чНом].УИСтроки;
	//	КонецЕсли;
	//КонецЦикла;
	////Материалы	
	//ОтборПоГруппировке1 = Новый Структура("Назначение", "Материалы");
	//СтрокиПродукцияЗП  = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке1);
	//Для чНом=0 По СтрокиПродукцияЗП.Количество()-1 Цикл
	//	ОтборПоГруппировке2 = Новый Структура("Назначение1, Номенклатура1", "Материалы",СтрокиПродукцияЗП[чНом].Номенклатура);
	//	Если ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке2).Количество()=0 Тогда
	//		//не нашли во второй таблице - добавляем
	//		НоваяСтрока = ТаблицаДокумента2.Добавить();
	//		НоваяСтрока.Номенклатура1 = СтрокиПродукцияЗП[чНом].Номенклатура;
	//		НоваяСтрока.Назначение1 = "Материалы";
	//		НоваяСтрока.УИСтроки1 = СтрокиПродукцияЗП[чНом].УИСтроки;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//
	//Макет = ПолучитьОбщийМакет("ПросмотрРазличийДокументов");
	//
	//ОбластьЗаголовокДокумент 	= Макет.ПолучитьОбласть("Заголовок");
	//ОбластьШапкаРеквизитов 		= Макет.ПолучитьОбласть("ШапкаРеквизитов"); 
	//ОбластьСтрокаРеквизитов 	= Макет.ПолучитьОбласть("СтрокаРеквизитов");
	//ОбластьШапкаТаблицы 		= Макет.ПолучитьОбласть("ШапкаТаблицы");
	//ОбластьСтрокаГруппировка 	= Макет.ПолучитьОбласть("СтрокаГруппировка");
	////ОбластьСтрокаДокумента		= Макет.ПолучитьОбласть("СтрокаДокумента");
	//ОбластьПустаяСтрока			= Макет.ПолучитьОбласть("ПустаяСтрока");
	//
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//
	////ОбластьЗаголовокДокумент.Параметры.Документ = Документ1;
	////ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумент);
	////ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	////
	////Для каждого ЭлементМассива из МассивРазличийДокумента1 Цикл
	////	ОбластьСтрокаДокумента.Параметры.Заполнить(ЭлементМассива);
	////	ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
	////КонецЦикла;
	////
	////ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	////
	////ОбластьЗаголовокДокумент.Параметры.Документ = Документ2;
	////ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумент);
	////ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	////Для каждого ЭлементМассива из МассивРазличийДокумента2 Цикл
	////	ОбластьСтрокаДокумента.Параметры.Заполнить(ЭлементМассива);
	////	ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
	////КонецЦикла;
	//
	//ОбластьЗаголовокДокумент.Параметры.Документ1 = Документ1;
	//ОбластьЗаголовокДокумент.Параметры.Документ2 = Документ2;
	//ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумент);
	//	
	////++#4659
	//Если МассивРазличийРеквизитов.Количество() > 0 Тогда
	//	ТабличныйДокумент.Вывести(ОбластьШапкаРеквизитов);
	//	Для каждого ДанныеРеквизита из МассивРазличийРеквизитов Цикл
	//		Если ДанныеРеквизита.Реквизит1 = ДанныеРеквизита.Реквизит2 Тогда
	//			ОбластьСтрокаРеквизитов.Параметры.Реквизит = ДанныеРеквизита.Реквизит1;
	//		Иначе
	//			ОбластьСтрокаРеквизитов.Параметры.Реквизит = "" + ДанныеРеквизита.Реквизит1 + "/" + ДанныеРеквизита.Реквизит2;
	//		КонецЕсли;
	//		ОбластьСтрокаРеквизитов.Параметры.ЗначениеРеквизита1 = ДанныеРеквизита.Значение1;
	//		ОбластьСтрокаРеквизитов.Параметры.ЗначениеРеквизита2 = ДанныеРеквизита.Значение2;
	//		ТабличныйДокумент.Вывести(ОбластьСтрокаРеквизитов);
	//	КонецЦикла;
	//	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	//КонецЕсли;
	////--#4659
	//	
	//ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);	
	//
	////сравнение по продукции
	//ОтборПоГруппировке = Новый Структура("Назначение", "Продукция");
	//ОтборПоГруппировке1 = Новый Структура("Назначение1", "Продукция");
	//ЕстьПродукция = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке).Количество() > 0 ИЛИ ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке1).Количество() > 0;
	//Если ЕстьПродукция Тогда
	//	ОбластьСтрокаГруппировка.Параметры.Группировка = "Продукция";
	//	ТабличныйДокумент.Вывести(ОбластьСтрокаГруппировка);
	//	
	//	Для каждого СтрокаТЧ из ТаблицаДокумента1 Цикл
	//		Если СтрокаТЧ.Назначение = "Продукция" Тогда
	//			ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
	//			ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
	//			СтрокаТЧ.Обработано = Истина;
	//			НайденныеСтроки = ТаблицаДокумента2.НайтиСтроки(Новый Структура("УИСтроки1, Обработано1", СтрокаТЧ.УИСтроки, Ложь));
	//			Если НайденныеСтроки.Количество() > 0 Тогда
	//				ОбластьСтрокаДокумента.Параметры.Заполнить(НайденныеСтроки[0]);	
	//				НайденныеСтроки[0].Обработано1 = Истина;
	//			КонецЕсли;
	//			
	//			ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);				
	//			РазукраситьСтроки(ТабличныйДокумент, НайденныеСтроки.Количество() = 0);				
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	//необработанные строки во втором документе
	//	Для каждого СтрокаТЧ из ТаблицаДокумента2 Цикл
	//		Если СтрокаТЧ.Назначение1 = "Продукция" И НЕ СтрокаТЧ.Обработано1 Тогда
	//			ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
	//			ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
	//			ОбластьСтрокаДокумента.Параметры.Номенклатура = СтрокаТЧ.Номенклатура1;
	//			СтрокаТЧ.Обработано1 = Истина;
	//			
	//			ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
	//			РазукраситьСтроки(ТабличныйДокумент, Истина);
	//		КонецЕсли;
	//	КонецЦикла;	
	//КонецЕсли;
	//
	////сравнение по услугам
	//ОтборПоГруппировке = Новый Структура("Назначение", "Услуги");
	//ОтборПоГруппировке1 = Новый Структура("Назначение1", "Услуги");
	//ЕстьУслуги = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке).Количество() > 0 ИЛИ ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке1).Количество() > 0;
	//Если ЕстьУслуги Тогда
	//	ОбластьСтрокаГруппировка.Параметры.Группировка = "Услуги";
	//	ТабличныйДокумент.Вывести(ОбластьСтрокаГруппировка);
	//	
	//	Для каждого СтрокаТЧ из ТаблицаДокумента1 Цикл
	//		Если СтрокаТЧ.Назначение = "Услуги" Тогда
	//			ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
	//			ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
	//			СтрокаТЧ.Обработано = Истина;
	//			НайденныеСтроки = ТаблицаДокумента2.НайтиСтроки(Новый Структура("УИСтроки1, Обработано1, Номенклатура1, Назначение1", СтрокаТЧ.УИСтроки, Ложь, СтрокаТЧ.Номенклатура, "Услуги"));
	//			Если НайденныеСтроки.Количество() > 0 Тогда
	//				ОбластьСтрокаДокумента.Параметры.Заполнить(НайденныеСтроки[0]);	
	//				НайденныеСтроки[0].Обработано1 = Истина;
	//			КонецЕсли;
	//			
	//			ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
	//			РазукраситьСтроки(ТабличныйДокумент, НайденныеСтроки.Количество() = 0);
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	//необработанные строки во втором документе
	//	Для каждого СтрокаТЧ из ТаблицаДокумента2 Цикл
	//		Если СтрокаТЧ.Назначение1 = "Услуги" И НЕ СтрокаТЧ.Обработано1 Тогда
	//			ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
	//			ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
	//			ОбластьСтрокаДокумента.Параметры.Номенклатура = СтрокаТЧ.Номенклатура1;
	//			СтрокаТЧ.Обработано1 = Истина;
	//			
	//			ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
	//			РазукраситьСтроки(ТабличныйДокумент, Истина);
	//		КонецЕсли;
	//	КонецЦикла;	
	//КонецЕсли;

	////сравнение по материалам
	//ОтборПоГруппировке = Новый Структура("Назначение", "Материалы");
	//ОтборПоГруппировке1 = Новый Структура("Назначение1", "Материалы");
	//ЕстьМатериалы = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке).Количество() > 0 ИЛИ ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке1).Количество() > 0;
	//Если ЕстьМатериалы Тогда
	//	ОбластьСтрокаГруппировка.Параметры.Группировка = "Материалы";
	//	ТабличныйДокумент.Вывести(ОбластьСтрокаГруппировка);
	//	
	//	Для каждого СтрокаТЧ из ТаблицаДокумента1 Цикл
	//		Если СтрокаТЧ.Назначение = "Материалы" Тогда
	//			ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
	//			ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
	//			СтрокаТЧ.Обработано = Истина;
	//			// по материалам УИС = УИС потолка, поэтому ищем в связке с номенклатурой
	//			НайденныеСтроки = ТаблицаДокумента2.НайтиСтроки(Новый Структура("Номенклатура1, УИСтроки1, Обработано1, Назначение1", СтрокаТЧ.Номенклатура, СтрокаТЧ.УИСтроки, Ложь, "Материалы"));
	//			Если НайденныеСтроки.Количество() > 0 Тогда
	//				ОбластьСтрокаДокумента.Параметры.Заполнить(НайденныеСтроки[0]);	
	//				НайденныеСтроки[0].Обработано1 = Истина;
	//			КонецЕсли;
	//			
	//			ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
	//			РазукраситьСтроки(ТабличныйДокумент, НайденныеСтроки.Количество() = 0);
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	//необработанные строки во втором документе
	//	Для каждого СтрокаТЧ из ТаблицаДокумента2 Цикл
	//		Если СтрокаТЧ.Назначение1 = "Материалы" И НЕ СтрокаТЧ.Обработано1 Тогда
	//			ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
	//			ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
	//			ОбластьСтрокаДокумента.Параметры.Номенклатура = СтрокаТЧ.Номенклатура1;
	//			СтрокаТЧ.Обработано1 = Истина;
	//			
	//			ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
	//			РазукраситьСтроки(ТабличныйДокумент, Истина);
	//		КонецЕсли;
	//	КонецЦикла;	
	//КонецЕсли;
	//	
	//Результат.Вывести(ТабличныйДокумент);
	//-- №13466 комментируем, т.к. сравнение выполняется непосредственно в ОбщийМодуль.ЗаказНаПроизводствоСоответствуетЗаказуПокупателя
	
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура РазукраситьСтроки(ОбластьМакета, БезПроверки = Ложь)
	
	ВысотаТаблицы = ОбластьМакета.ВысотаТаблицы;
	ЦветОшибки = WebЦвета.ЛососьСветлый;
	
	Если БезПроверки Тогда
		Ячейка = ОбластьМакета.Область(ВысотаТаблицы-1, 1, ВысотаТаблицы, ОбластьМакета.ШиринаТаблицы);
		//Ячейка = ОбластьМакета.Область(1, 2);
		Ячейка.ЦветФона = ЦветОшибки;
		
		//Для НомерСтолбца = 3 По ОбластьМакета.ШиринаТаблицы Цикл
		//	Ячейка1 = ОбластьМакета.Область(ВысотаТаблицы-1, НомерСтолбца);
		//	Ячейка2 = ОбластьМакета.Область(ВысотаТаблицы, НомерСтолбца);
		//				
		//		Ячейка1.ЦветФона = ЦветОшибки;
		//		Ячейка2.ЦветФона = ЦветОшибки;
		//	
		//	
		//КонецЦикла;
	Иначе
		
		Для НомерСтолбца = 3 По ОбластьМакета.ШиринаТаблицы Цикл
			Ячейка1 = ОбластьМакета.Область(ВысотаТаблицы-1, НомерСтолбца);
			Ячейка2 = ОбластьМакета.Область(ВысотаТаблицы, НомерСтолбца);
			
			Если Ячейка1.СодержитЗначение Тогда
				ЗначениеЯчейки1 = Ячейка1.Значение;
			Иначе
				ЗначениеЯчейки1 = Ячейка1.Текст;
			КонецЕсли;
			
			Если Ячейка2.СодержитЗначение Тогда
				ЗначениеЯчейки2 = Ячейка2.Значение;
			Иначе
				ЗначениеЯчейки2 = Ячейка2.Текст;
			КонецЕсли;
			
			Если ЗначениеЯчейки1 <> ЗначениеЯчейки2 Тогда
				Ячейка1.ЦветФона = ЦветОшибки;
				Ячейка2.ЦветФона = ЦветОшибки;
			КонецЕсли;
			
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

//Различия Монтаж - Заказ-договор
&НаСервере
Процедура СформироватьМакетРазличийПоМонтажу(МассивДокумента1, МассивДокумента2, Документ1, Документ2)
	
	// при сравнении ЗП и ЗНП : 1 - ЗП, 2 - ЗНП
	
	//развернем массивы в таблицу значений
	ТаблицаДокумента1 = ОбщийМодуль.ПустаяТаблицаДляСравненияЗаказов();	
	ТаблицаДокумента2 = ОбщийМодуль.ПустаяТаблицаДляСравненияЗаказов();
	Для Каждого ЭлементМассива Из МассивДокумента1 Цикл
	 	НоваяСтрока = ТаблицаДокумента1.Добавить();
        Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
            НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
		КонецЦикла;
	КонецЦикла;
	Для Каждого ЭлементМассива Из МассивДокумента2 Цикл
	 	НоваяСтрока = ТаблицаДокумента2.Добавить();
        Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
            НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
		КонецЦикла;
	КонецЦикла;
	Для каждого КолонкаТЗ из ТаблицаДокумента2.Колонки Цикл
		КолонкаТЗ.Имя = КолонкаТЗ.Имя + "1";
	КонецЦикла;
	
	//в заказе покупателя у услуг и товаров УИСтроки свой - уникальный, а в Заказе на производство он равен УИСтроки продукции
	//заменим УИСтроки товара или услуги в заказе покупателя на УИСтрокиРодителя, чтобы соответствовать заказу на производство
	Для Каждого ТекущаяСтрока Из ТаблицаДокумента1 Цикл
		ТекущаяСтрока.УИСтроки = ТекущаяСтрока.УИСтрокиРодителя;		
	КонецЦикла;
	
	//возможна такая ситуация, то во второй таблице (ЗНП) вовсе нет продукции, услуг или материалов
	//поэтому вывод секций присоединением будет кривой
	//дозаполим отсутствующие строки в ЗНП заглушками
	//продукция	
	ОтборПоГруппировке1 = Новый Структура("Назначение", "Продукция");
	СтрокиПродукцияЗП  = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке1);
	Для чНом=0 По СтрокиПродукцияЗП.Количество()-1 Цикл
		ОтборПоГруппировке2 = Новый Структура("Назначение1, Номенклатура1", "Продукция",СтрокиПродукцияЗП[чНом].Номенклатура);
		Если ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке2).Количество()=0 Тогда
			//не нашли во второй таблице - добавляем
			НоваяСтрока = ТаблицаДокумента2.Добавить();
			НоваяСтрока.Номенклатура1 = СтрокиПродукцияЗП[чНом].Номенклатура;
			НоваяСтрока.Назначение1 = "Продукция";
			НоваяСтрока.УИСтроки1 = СтрокиПродукцияЗП[чНом].УИСтроки;
		КонецЕсли;
	КонецЦикла;
	//услуги	
	ОтборПоГруппировке1 = Новый Структура("Назначение", "Услуги");
	СтрокиПродукцияЗП  = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке1);
	Для чНом=0 По СтрокиПродукцияЗП.Количество()-1 Цикл
		ОтборПоГруппировке2 = Новый Структура("Назначение1, Номенклатура1", "Услуги",СтрокиПродукцияЗП[чНом].Номенклатура);
		Если ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке2).Количество()=0 Тогда
			//не нашли во второй таблице - добавляем
			НоваяСтрока = ТаблицаДокумента2.Добавить();
			НоваяСтрока.Номенклатура1 = СтрокиПродукцияЗП[чНом].Номенклатура;
			НоваяСтрока.Назначение1 = "Услуги";
			НоваяСтрока.УИСтроки1 = СтрокиПродукцияЗП[чНом].УИСтроки;
		КонецЕсли;
	КонецЦикла;
	//Материалы	
	ОтборПоГруппировке1 = Новый Структура("Назначение", "Материалы");
	СтрокиПродукцияЗП  = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке1);
	Для чНом=0 По СтрокиПродукцияЗП.Количество()-1 Цикл
		ОтборПоГруппировке2 = Новый Структура("Назначение1, Номенклатура1", "Материалы",СтрокиПродукцияЗП[чНом].Номенклатура);
		Если ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке2).Количество()=0 Тогда
			//не нашли во второй таблице - добавляем
			НоваяСтрока = ТаблицаДокумента2.Добавить();
			НоваяСтрока.Номенклатура1 = СтрокиПродукцияЗП[чНом].Номенклатура;
			НоваяСтрока.Назначение1 = "Материалы";
			НоваяСтрока.УИСтроки1 = СтрокиПродукцияЗП[чНом].УИСтроки;
		КонецЕсли;
	КонецЦикла;
	
	
	Макет = ПолучитьОбщийМакет("ПросмотрРазличийДокументов");
	
	ОбластьЗаголовокДокумент 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы 		= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаГруппировка 	= Макет.ПолучитьОбласть("СтрокаГруппировка");
	//ОбластьСтрокаДокумента		= Макет.ПолучитьОбласть("СтрокаДокумента");
	ОбластьПустаяСтрока			= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	//ОбластьЗаголовокДокумент.Параметры.Документ = Документ1;
	//ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумент);
	//ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	//
	//Для каждого ЭлементМассива из МассивРазличийДокумента1 Цикл
	//	ОбластьСтрокаДокумента.Параметры.Заполнить(ЭлементМассива);
	//	ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
	//КонецЦикла;
	//
	//ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	//
	//ОбластьЗаголовокДокумент.Параметры.Документ = Документ2;
	//ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумент);
	//ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	//Для каждого ЭлементМассива из МассивРазличийДокумента2 Цикл
	//	ОбластьСтрокаДокумента.Параметры.Заполнить(ЭлементМассива);
	//	ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
	//КонецЦикла;
	
	ОбластьЗаголовокДокумент.Параметры.Документ1 = Документ1;
	ОбластьЗаголовокДокумент.Параметры.Документ2 = Документ2;
	ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумент);
		
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);	
	
	//сравнение по продукции
	ОтборПоГруппировке = Новый Структура("Назначение", "Продукция");
	ОтборПоГруппировке1 = Новый Структура("Назначение1", "Продукция");
	ЕстьПродукция = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке).Количество() > 0 ИЛИ ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке1).Количество() > 0;
	Если ЕстьПродукция Тогда
		ОбластьСтрокаГруппировка.Параметры.Группировка = "Продукция";
		ТабличныйДокумент.Вывести(ОбластьСтрокаГруппировка);
		
		Для каждого СтрокаТЧ из ТаблицаДокумента1 Цикл
			Если СтрокаТЧ.Назначение = "Продукция" Тогда
				ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
				ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
				СтрокаТЧ.Обработано = Истина;
				НайденныеСтроки = ТаблицаДокумента2.НайтиСтроки(Новый Структура("УИСтроки1, Обработано1", СтрокаТЧ.УИСтроки, Ложь));
				Если НайденныеСтроки.Количество() > 0 Тогда
					ОбластьСтрокаДокумента.Параметры.Заполнить(НайденныеСтроки[0]);	
					НайденныеСтроки[0].Обработано1 = Истина;
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);				
				РазукраситьСтроки(ТабличныйДокумент, НайденныеСтроки.Количество() = 0);				
			КонецЕсли;
		КонецЦикла;
		
		//необработанные строки во втором документе
		Для каждого СтрокаТЧ из ТаблицаДокумента2 Цикл
			Если СтрокаТЧ.Назначение1 = "Продукция" И НЕ СтрокаТЧ.Обработано1 Тогда
				ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
				ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
				ОбластьСтрокаДокумента.Параметры.Номенклатура = СтрокаТЧ.Номенклатура1;
				СтрокаТЧ.Обработано1 = Истина;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
				РазукраситьСтроки(ТабличныйДокумент, Истина);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	//сравнение по услугам
	ОтборПоГруппировке = Новый Структура("Назначение", "Услуги");
	ОтборПоГруппировке1 = Новый Структура("Назначение1", "Услуги");
	ЕстьУслуги = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке).Количество() > 0 ИЛИ ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке1).Количество() > 0;
	Если ЕстьУслуги Тогда
		ОбластьСтрокаГруппировка.Параметры.Группировка = "Услуги";
		ТабличныйДокумент.Вывести(ОбластьСтрокаГруппировка);
		
		Для каждого СтрокаТЧ из ТаблицаДокумента1 Цикл
			Если СтрокаТЧ.Назначение = "Услуги" Тогда
				ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
				ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
				СтрокаТЧ.Обработано = Истина;
				НайденныеСтроки = ТаблицаДокумента2.НайтиСтроки(Новый Структура("УИСтроки1, Обработано1, Номенклатура1, Назначение1", СтрокаТЧ.УИСтроки, Ложь, СтрокаТЧ.Номенклатура, "Услуги"));
				Если НайденныеСтроки.Количество() > 0 Тогда
					ОбластьСтрокаДокумента.Параметры.Заполнить(НайденныеСтроки[0]);	
					НайденныеСтроки[0].Обработано1 = Истина;
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
				РазукраситьСтроки(ТабличныйДокумент, НайденныеСтроки.Количество() = 0);
			КонецЕсли;
		КонецЦикла;
		
		//необработанные строки во втором документе
		Для каждого СтрокаТЧ из ТаблицаДокумента2 Цикл
			Если СтрокаТЧ.Назначение1 = "Услуги" И НЕ СтрокаТЧ.Обработано1 Тогда
				ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
				ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
				ОбластьСтрокаДокумента.Параметры.Номенклатура = СтрокаТЧ.Номенклатура1;
				СтрокаТЧ.Обработано1 = Истина;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
				РазукраситьСтроки(ТабличныйДокумент, Истина);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;

	//сравнение по материалам
	ОтборПоГруппировке = Новый Структура("Назначение", "Материалы");
	ОтборПоГруппировке1 = Новый Структура("Назначение1", "Материалы");
	ЕстьМатериалы = ТаблицаДокумента1.НайтиСтроки(ОтборПоГруппировке).Количество() > 0 ИЛИ ТаблицаДокумента2.НайтиСтроки(ОтборПоГруппировке1).Количество() > 0;
	Если ЕстьМатериалы Тогда
		ОбластьСтрокаГруппировка.Параметры.Группировка = "Материалы";
		ТабличныйДокумент.Вывести(ОбластьСтрокаГруппировка);
		
		Для каждого СтрокаТЧ из ТаблицаДокумента1 Цикл
			Если СтрокаТЧ.Назначение = "Материалы" Тогда
				ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
				ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
				СтрокаТЧ.Обработано = Истина;
				// по материалам УИС = УИС потолка, поэтому ищем в связке с номенклатурой
				НайденныеСтроки = ТаблицаДокумента2.НайтиСтроки(Новый Структура("Номенклатура1, УИСтроки1, Обработано1, Назначение1", СтрокаТЧ.Номенклатура, СтрокаТЧ.УИСтроки, Ложь, "Материалы"));
				Если НайденныеСтроки.Количество() > 0 Тогда
					ОбластьСтрокаДокумента.Параметры.Заполнить(НайденныеСтроки[0]);	
					НайденныеСтроки[0].Обработано1 = Истина;
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
				РазукраситьСтроки(ТабличныйДокумент, НайденныеСтроки.Количество() = 0);
			КонецЕсли;
		КонецЦикла;
		
		//необработанные строки во втором документе
		Для каждого СтрокаТЧ из ТаблицаДокумента2 Цикл
			Если СтрокаТЧ.Назначение1 = "Материалы" И НЕ СтрокаТЧ.Обработано1 Тогда
				ОбластьСтрокаДокумента = Макет.ПолучитьОбласть("СтрокаДокумента");
				ОбластьСтрокаДокумента.Параметры.Заполнить(СтрокаТЧ);
				ОбластьСтрокаДокумента.Параметры.Номенклатура = СтрокаТЧ.Номенклатура1;
				СтрокаТЧ.Обработано1 = Истина;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
				РазукраситьСтроки(ТабличныйДокумент, Истина);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
		
	Результат.Вывести(ТабличныйДокумент);
	
КонецПроцедуры
