&НаСервере
Процедура ПрочитатьПараметры() 
	
	Об = РеквизитФормыВЗначение("Объект");
	Хранилище = Об.ТабПараметровЗапроса;
	Знч = Хранилище.Получить();
	Если НЕ Знч = Неопределено Тогда
		ЗначениеВРеквизитФормы(Знч,"СписокПараметров");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
    
	Данные = ПараметрыНаСервере();
    Закрыть(Данные);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыНаСервере()
	ПараметрыДляПередачи = ДанныеФормыВЗначение(СписокПараметров, Тип("ТаблицаЗначений"));
    
    СтруктураПараметров = Новый Структура;
    
    Для Каждого стр из ПараметрыДляПередачи Цикл
        СтруктураПараметров.Вставить(стр.ИмяПараметра, стр.Значение);
    КонецЦикла;
    
    Возврат СтруктураПараметров;	
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика  	
	//Если Параметры.ЗначениеПараметров.Свойство("ЗначенияПараметров") Тогда
	    СписокПараметров.Очистить();
	    Структ =  Параметры.ЗначенияПараметров;
	    Для Каждого Элемент Из Структ Цикл
	        НовСтрока = СписокПараметров.Добавить();
	    	НовСтрока.ИмяПараметра = Элемент.Ключ;
			НовСтрока.Значение = Элемент.Значение;
	    КонецЦикла;  
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	тд = Элементы.СписокПараметров.ТекущиеДанные;
	Если тд.Значение = Неопределено Тогда
		Элемент.ВыбиратьТип = Истина;
	Иначе
		Элемент.ВыбиратьТип = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровЗначениеОчистка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Элемент.ВыбиратьТип = Истина;
КонецПроцедуры
