
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецПериода = КонецМесяца(ТекущаяДатаСеанса());	
	ТипЗаполнения = Параметры.ТипЗаполнения;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовФормы()
	Если ТипЗаполнения = "ПоСуммеПродажЗаПериод" Тогда
		Элементы.ГруппаПоНоменклатуре.Видимость = Ложь;
	ИначеЕсли ТипЗаполнения = "ПоСуммеДолга" Тогда	
		Элементы.ГруппаПериод.Видимость = Ложь;
		Элементы.ГруппаПоНоменклатуре.Видимость = Ложь;
	ИначеЕсли ТипЗаполнения = "ПоНоменклатуре" Тогда			
		Элементы.ГруппаСуммы.Видимость = Ложь;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ПолученныеДанные = новый Структура;
	ПолученныеДанные.Вставить("НачалоПериода", НачалоПериода);
	ПолученныеДанные.Вставить("КонецПериода", КонецПериода);
	ПолученныеДанные.Вставить("НачальнаяСумма", НачальнаяСумма);
	ПолученныеДанные.Вставить("КонечнаяСумма", КонечнаяСумма);
	ПолученныеДанные.Вставить("Номенклатура", Номенклатура);
	ПолученныеДанные.Вставить("КатегорияНоменклатуры", КатегорияНоменклатуры);
	Закрыть(ПолученныеДанные);
КонецПроцедуры
