#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда

	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПотраченоИтог = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + Объект.Оплаты.Итог("СуммаОплаты");
	
	ФинансыСервер.УстановитьОтметкуНезаполненныхСтатейДоходовРасходов(Элементы);
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ТоварыСтатьяРасходов");
	МассивЭлементов.Добавить("УслугиСтатьяРасходов");
	ФинансыСервер.УстановитьВидимостьКолонокСтатейДиРВТабличнойЧасти(ЭтаФорма, МассивЭлементов, Истина);

	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	УстановитьОтметкуНезаполненногоСклада();
	
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма);
	
	//#14021
	ЗаполнитьКолонкиПоВыданнымАвансам();
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
	УчитыватьНДС = Истина;
	
	// вызов оставлять последним	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = НЕ ПраваПользователей.РазрешеноПриходоватьНаСклад(Объект.Склад);
		Если Отказ Тогда
			Сообщить("У текущего пользователя нет прав для оформления прихода на склад """ + Объект.Склад + """");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// проверяем заполненность статей доходов/расходов
	ФинансыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	
	//#14021
	ЗаполнитьКолонкиПоВыданнымАвансам();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяРасходов");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
		
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяРасходов");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
		
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыданныеАвансыДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ТекстСообщения = НСтр("ru = 'Укажите вначале сотрудника!'");
		ПоказатьПредупреждение(Неопределено,ТекстСообщения);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыданныеАвансыДокументПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ВыданныеАвансы.ТекущиеДанные;
	
	РеквизитыАванса = ПолучитьРеквизитыАванса(СтрокаТабличнойЧасти.Документ);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, РеквизитыАванса);
	СтрокаТабличнойЧасти.Сумма = РеквизитыАванса.СуммаВыданная;					
		
КонецПроцедуры

&НаКлиенте
Процедура ВыданныеАвансыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ВыданныеАвансы.ТекущиеДанные;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыКонтрагентПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Оплаты.ТекущиеДанные;
	СтрокаТабличнойЧасти.ДоговорКонтрагента = ПолучитьДоговорКонтрагента(СтрокаТабличнойЧасти.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПотраченоИтог = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + Объект.Оплаты.Итог("СуммаОплаты");
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПослеУдаления(Элемент)
	ПотраченоИтог = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + Объект.Оплаты.Итог("СуммаОплаты");
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПотраченоИтог = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + Объект.Оплаты.Итог("СуммаОплаты");
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
	ПотраченоИтог = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + Объект.Оплаты.Итог("СуммаОплаты");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	УстановитьОтметкуНезаполненногоСклада();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПотраченоИтог = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + Объект.Оплаты.Итог("СуммаОплаты");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	ПотраченоИтог = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + Объект.Оплаты.Итог("СуммаОплаты");
КонецПроцедуры

&НаКлиенте
Процедура ОплатыСуммаОплатыПриИзменении(Элемент)
	ПотраченоИтог = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + Объект.Оплаты.Итог("СуммаОплаты");
КонецПроцедуры

&НаКлиенте
Процедура АвансыПодбор(Команда)
	
	АдресВыданныеАвансыВХранилище = ПоместитьВыданныеАвансыВХранилище();
	
	ПараметрыПодбора = Новый Структура(
		"АдресВыданныеАвансыВХранилище,
		|Организация,
		|Период,
		|Сотрудник,
		|Валюта,
		|Ссылка",
		АдресВыданныеАвансыВХранилище,
		Объект.Организация,
		Объект.Дата,
		Объект.Сотрудник,
		Объект.Валюта,
		Объект.Ссылка
	);
	
	Результат = Неопределено;	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАвансовПодотчетнику", ПараметрыПодбора,,,,, 
		Новый ОписаниеОповещения("АвансыПодборЗавершение", ЭтотОбъект, Новый Структура("АдресВыданныеАвансыВХранилище", АдресВыданныеАвансыВХранилище)));
	
КонецПроцедуры

&НаКлиенте
Процедура АвансыПодборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	АдресВыданныеАвансыВХранилище = ДополнительныеПараметры.АдресВыданныеАвансыВХранилище;
	
	Если Результат = КодВозвратаДиалога.OK Тогда
		ПолучитьВыданныеАвансыИзХранилища(АдресВыданныеАвансыВХранилище);	
	КонецЕсли;

КонецПроцедуры // АвансыПодбор()

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеДокумента()
	//Элементы.ДекорацияСуммаДокумента.Заголовок = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	ПотраченоИтог = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + Объект.Оплаты.Итог("СуммаОплаты");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкиПоВыданнымАвансам()
	
	Для Каждого СтрокаАванса Из Объект.ВыданныеАвансы Цикл
		РеквизитыАванса = ПолучитьРеквизитыАванса(СтрокаАванса.Документ);
		ЗаполнитьЗначенияСвойств(СтрокаАванса, РеквизитыАванса);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоговорКонтрагента(КонтрагентСсылка)
	Если ЗначениеЗаполнено(КонтрагентСсылка) Тогда 
		Возврат КонтрагентСсылка.ОсновнойДоговор;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыАванса(Знач ДокументСсылка)
	
	// РКО или СРС
	
	РеквизитыАванса = Новый Структура("Валюта, СуммаВыданная, ОсталосьРаспределить", Справочники.Валюты.ПустаяСсылка(), 0, 0);
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		РеквизитыАванса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, Новый Структура("Валюта, СуммаВыданная", "Валюта", "Сумма"));
		РеквизитыАванса.Вставить("ОсталосьРаспределить", 0);
		
		ЗапросОстатка = Новый Запрос;
		ЗапросОстатка.УстановитьПараметр("ДокументВыдачиДС", ДокументСсылка);
		ЗапросОстатка.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыОстатки.СуммаОстаток КАК ОсталосьРаспределить
		|ИЗ
		|	РегистрНакопления.РасчетыСПодотчетникамиПоДокументамАвансов.Остатки(, ДокументВыдачиДС = &ДокументВыдачиДС) КАК РасчетыОстатки";
		ВыборкаОстатка = ЗапросОстатка.Выполнить().Выбрать();
		Если ВыборкаОстатка.Следующий() Тогда
			РеквизитыАванса.ОсталосьРаспределить = ВыборкаОстатка.ОсталосьРаспределить;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РеквизитыАванса;
	
КонецФункции

// Функция помещает табличную часть ВыданныеАвансы во временное хранилище
// и возвращает адрес
//
&НаСервере
Функция ПоместитьВыданныеАвансыВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.ВыданныеАвансы.Выгрузить(,
			"Документ,
			|Сумма"
		),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьВыданныеАвансыВХранилище()

// Функция получает табличную часть ВыданныеАвансы из временного хранилища.
//
&НаСервере
Процедура ПолучитьВыданныеАвансыИзХранилища(АдресВыданныеАвансыВХранилище)
	
	ТаблицаВыданныеАвансы = ПолучитьИзВременногоХранилища(АдресВыданныеАвансыВХранилище);
	Объект.ВыданныеАвансы.Очистить();
	Для каждого СтрокаВыданныеАвансы Из ТаблицаВыданныеАвансы Цикл
		Строка = Объект.ВыданныеАвансы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаВыданныеАвансы);
		
		//#14021
		РеквизитыАванса = ПолучитьРеквизитыАванса(Строка.Документ);
		ЗаполнитьЗначенияСвойств(Строка, РеквизитыАванса);
	КонецЦикла;
	
КонецПроцедуры // ПолучитьВыданныеАвансыИзХранилища()

&НаСервере
Процедура УстановитьОтметкуНезаполненногоСклада()
	
	ЗаполнениеОбязательно = Объект.Товары.Количество() > 0;	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Склад",  "АвтоОтметкаНезаполненного", ЗаполнениеОбязательно);
	Если Не ЗаполнениеОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Склад",  "ОтметкаНезаполненного", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, , Ложь);
КонецПроцедуры

#КонецОбласти
