&НаСервере
// Процедура обработчик события ПриСозданииНаСервере.
// Осуществляет первоначальное заполнение реквизитов формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда
		
		Номенклатура = Параметры.Отбор.Номенклатура;
		
		//Если Номенклатура.ЭтоНабор Тогда
		//	
		//	АвтоЗаголовок = Ложь;
		//	Заголовок = НСтр("ru = 'Аналоги недоступны для наборов'");
		//	Элементы.Список.ТолькоПросмотр = Истина;
		//
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()
