Функция ПолучитьИмяЗначенияПеречисления(Ссылка) Экспорт
	ИмяПеречисления = Ссылка.Метаданные().Имя;
	Индекс = Перечисления[ИмяПеречисления].Индекс(Ссылка);

	Возврат Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[Индекс].Имя;
КонецФункции 

Функция получитьЗначениеАналитики(видСтат, НомерАн, ЗначАн) Экспорт
	Если ЗначАн = Неопределено Тогда
		возврат Неопределено;
	КонецЕсли;
	
	ЗначТип = видСтат["Аналитика"+НомерАн].ТипАналитикиПолный;
	Если ЗначТип = "Булево" Тогда
		Возврат нрег(ЗначАн) = "true";
	ИначеЕсли ЗначТип = "Строка" Тогда
		Возврат ЗначАн;
	ИначеЕсли ЗначТип = "Число" Тогда 
		Возврат число(ЗначАн);
	ИначеЕсли ЗначТип = "Дата" тогда 
		Возврат Дата(ЗначАн);
	ИначеЕсли найти(ЗначТип,"ПеречислениеСсылка") > 0 ТОгда 
		ЗначТип1 = ЗначТип;
		ЗначТип1 = СтрЗаменить(ЗначТип1, "ПеречислениеСсылка", "");		
		Возврат Перечисления[ЗначТип1][ЗначАн];
	Иначе // ссылка
		ЗначТип1 = ЗначТип;
		ЗначТип1 = СтрЗаменить(ЗначТип1, "СправочникСсылка", "Справочники");
		ЗначТип1 = СтрЗаменить(ЗначТип1, "ДокументСсылка", "Документы");
		ЗначТип1 = СтрЗаменить(ЗначТип1, "ЗадачаСсылка", "Задачи");
		Если ЗначТип1 = "" Тогда
			ЗначТип1 = "Справочники.ИА_ЗначениеАналитики";
		КонецЕсли;
		
		уид = новый УникальныйИдентификатор(ЗначАн);
		Ссылка = Неопределено;
		Выполнить("Ссылка = "+ЗначТип1+".ПолучитьСсылку(уид)");
		
		Возврат Ссылка;
	КонецЕсли;
КонецФункции


Функция получитьИДЗначенияАналитики(видСтат, НомерАн, ЗначАн) Экспорт
	Если ЗначАн = Неопределено или не ЗначениеЗаполнено(ЗначАн) Тогда
		возврат "";
	КонецЕсли;
	
	ЗначТип = видСтат["Аналитика"+НомерАн].ТипАналитикиПолный;
	Если ЗначТип = "Булево" Тогда
		Возврат формат(ЗначАн,"БЛ=false; БИ=true");
	ИначеЕсли ЗначТип = "Строка" Тогда
		Возврат ЗначАн;
	ИначеЕсли ЗначТип = "Число" Тогда 
		Возврат формат(ЗначАн,"ЧН=; ЧГ=");
	ИначеЕсли ЗначТип = "Дата" тогда 
		Возврат формат(ЗначАн,"ДФ=yyyy-MM-ddTHH:mm:ss.000Z");
	ИначеЕсли найти(ЗначТип,"ПеречислениеСсылка") > 0 ТОгда 		
		Возврат ПолучитьИмяЗначенияПеречисления(ЗначАн);
	Иначе // ссылка		
		Возврат строка(ЗначАн.УникальныйИдентификатор());
	КонецЕсли;
КонецФункции


Функция ПолучитьДанныеСтатистики(ДатаНачала, ДатаКонца, ПериодДетализации, ВидСтатистики, Аналитика1 = Неопределено,Аналитика2 = Неопределено,Аналитика3 = Неопределено) Экспорт
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("ДатаНачала",Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("ДатаКонца",Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("Значение",Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("РеальныеДанные",Новый ОписаниеТипов("Булево"));
	Данные.Колонки.Добавить("ЕстьЗначение",Новый ОписаниеТипов("Булево"));
	Данные.Колонки.Добавить("ДанныеВведены",Новый ОписаниеТипов("Булево"));			
			
	Новстр = Данные.Добавить();
	Новстр.ДатаНачала = ДатаНачала;
	Новстр.ДатаКонца = ДатаКонца;
	СтрокаСтатистик = Новый Структура("ПериодДетализации,ВидСтатистики,Аналитика1,Аналитика2,Аналитика3,Данные",ПериодДетализации,ВидСтатистики, Аналитика1, Аналитика2, Аналитика3,Данные);			
	ИА_Статистики.ПолучитьТаблицуПериодов(ДатаНачала, ДатаКонца, СтрокаСтатистик, Неопределено);
	
	РезТЗ_Данные = ИА_Защита_Статистика.ПолучитьТЗДанныеСтатистики(СтрокаСтатистик, ДатаНачала, ДатаКонца, Неопределено);
	
	
	Возврат РезТЗ_Данные;
	
КонецФункции
