
&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Регистратор);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Период", Параметры.Период);
	
	Действ = Параметры.Действие;
	ИмяДока = "ФП";
	Если Параметры.Свойство("ИмяДока") Тогда
		ИмяДока = Параметры.ИмяДока;
	КонецЕсли;
	
	Элементы.Декорация4.Заголовок = СтрЗаменить(Элементы.Декорация4.Заголовок, "%действие%", Действ); 
	Элементы.Декорация1.Заголовок = СтрЗаменить(Элементы.Декорация1.Заголовок, "%действие%", Действ); 
	
	Элементы.Декорация4.Заголовок = СтрЗаменить(Элементы.Декорация4.Заголовок, "%ИмяДока%", ИмяДока); 
	Элементы.Декорация1.Заголовок = СтрЗаменить(Элементы.Декорация1.Заголовок, "%ИмяДока%", ИмяДока); 
	Элементы.Декорация2.Заголовок = СтрЗаменить(Элементы.Декорация2.Заголовок, "%ИмяДока%", ИмяДока); 
КонецПроцедуры
