
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокПараметров.Добавить("%Контрагент", "Наименование контрагента");
	СписокПараметров.Добавить("%Сумма", "Сумма");
	СписокПараметров.Добавить("%Рекламный источник", "Рекламный источник");
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.СписокПараметров.ТекущиеДанные;	
	Объект.Текст = Объект.Текст + ТекущиеДанные.Значение; 
КонецПроцедуры
