#Область Переменные_Формат_2_00_Казахстан

Перем Импорт_КоличествоСтрок;
Перем Импорт_ТекущаяСтрока;
Перем Импорт_ТекстДляРазбора;
Перем Импорт_ПризнакОбмена;
Перем Импорт_Загружаемые;
Перем Импорт_Заголовок;

Перем ТегиЗаголовка;
Перем ТегиРасчетногоСчета;

Перем РеквизитыПлДок_Основные;
//Перем РеквизитыПлДок_СоцПенс;
Перем РеквизитыПлДок_Плательщик;
Перем РеквизитыПлДок_ПлательщикНПР;
Перем РеквизитыПлДок_НеОбязательные;
Перем РеквизитыПлДок_Получатель;
Перем РеквизитыПлДок_ПолучательНПР;
Перем РеквизитыПлДок_БанкПосредник;
//Перем РеквизитыПлДок_ГЦВП;
Перем РеквизитыПлДок_БюджетПлатеж;
Перем РеквизитыПлДок_Назначение;
//Перем РасширениеЭкспорта Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПериодПлатежныхПорученийИсходящих.Вариант = ВариантСтандартногоПериода.Сегодня;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Объект.ВерсияФормата = "1.02" Тогда
		Объект.ВерсияФормата = "1.03";
		СохраняемыеВНастройкахДанныеМодифицированы = Истина;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузкаВыбратьВсе(Команда)
	ОтметитьСтроки("Документы", "Загружать", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаОтменитьВсе(Команда)
	ОтметитьСтроки("Документы", "Загружать", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаВыбратьВсе(Команда)
	ОтметитьСтроки("ДокументыНаВыгрузку", "Выгружать", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаОтменитьВсе(Команда)
	ОтметитьСтроки("ДокументыНаВыгрузку", "Выгружать", Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтметитьСтроки(ИмяТабличнойЧасти, ИмяРеквизитаТЧ, Пометка = Истина)
	
	Для Каждого СтрокаТабличнойЧасти из Объект[ИмяТабличнойЧасти] Цикл
		СтрокаТабличнойЧасти[ИмяРеквизитаТЧ] = Пометка;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьСтатусыДокументов()
	Для Каждого ТекущаяСтрока Из Объект.Документы Цикл
		Если ТекущаяСтрока.СсылкаДокумент = Неопределено Или ТекущаяСтрока.СсылкаДокумент.Пустая() тогда
			ТекущаяСтрока.СостояниеДокумента = 3;
		ИначеЕсли ТекущаяСтрока.СсылкаДокумент.Проведен Тогда
			ТекущаяСтрока.СостояниеДокумента = 1;
		ИначеЕсли ТекущаяСтрока.СсылкаДокумент.ПометкаУдаления Тогда
			ТекущаяСтрока.СостояниеДокумента = 2;
		Иначе
			ТекущаяСтрока.СостояниеДокумента = 0;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьВыбранныйФайл(Текст)
	
	Если Объект.ВерсияФормата = "2.00" Тогда
		// версия для Казахстана
		ПрочитатьВыбранныйФайлФорма_2_00(Текст.ПолучитьТекст());	
		Возврат;
	КонецЕсли;
	
	ОбщийМодуль.ПрочитатьФайлОбменаСБанком(ЭтаФорма, Текст);
	ОбновитьСтатусыДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	#Если ВебКлиент Тогда
		Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
			УстановитьРасширениеРаботыСФайлами();
		КонецЕсли;	
		СтрокаПреобразования = "";
	#КонецЕсли
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли; 
	
	Если Объект.Кодировка = "DOS" Тогда
		КодировкаФайла = КодировкаТекста.OEM;
	ИначеЕсли Объект.Кодировка = "UTF8" Тогда 
		КодировкаФайла = КодировкаТекста.UTF8;
	Иначе
		КодировкаФайла = КодировкаТекста.ANSI;
	КонецЕсли;

	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(ВыбранноеИмяФайла, КодировкаФайла);
	
	Попытка
		Текст.Прочитать(ВыбранноеИмяФайла,КодировкаФайла);
	Исключение
		Сообщить("Файл не прочитан.", СтатусСообщения.Внимание);
		Возврат;
	КонецПопытки;

	Если Текст.КоличествоСтрок()<1 Тогда
		Сообщить("В файл нет данных!");
		Возврат;
	КонецЕсли;

	Если СокрЛП(Врег(Текст.ПолучитьСтроку(1)))<>"1CCLIENTBANKEXCHANGE" Тогда
		Сообщить("Указанный файл не является файлом обмена или неверно указана кодировка!");
		Возврат;
	КонецЕсли;
	
	ПрочитатьВыбранныйФайл(Текст);
	УстановитьУсловноеОформлениеЗагрузка();

КонецПроцедуры

&НаСервере
Функция ИННОрганизацииЗаполнен()
	Если ПустаяСтрока(Объект.Организация.ИНН) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ОбязательноеЗаполнениеСтатьиВДенежныхДокументах()
	Возврат Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();
КонецФункции

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	Если Объект.Организация.Пустая() Тогда
		ПоказатьОповещениеПользователя("Сначала следует выбрать организацию");
		Возврат;
	КонецЕсли;
	
	//2022-05-24 (Ильнур) закомментировано: для схемы когда упр.организация одна, а ЮЛ несколько
	//Если НЕ ИННОрганизацииЗаполнен() тогда
	//	ПоказатьОповещениеПользователя("У выбранной организации не заполнен ИНН");
	//	Возврат;
	//КонецЕсли;
	
	Если ОбязательноеЗаполнениеСтатьиВДенежныхДокументах() Тогда
		Если Объект.СтатьяПоступление.Пустая() Тогда
			ПоказатьОповещениеПользователя("Необходимо указать статью ДДС для загружаемых документов поступления на расчетный счет");
			Возврат;
		КонецЕсли;
		Если Объект.СтатьяСписание.Пустая() Тогда
			ПоказатьОповещениеПользователя("Необходимо указать статью ДДС для загружаемых документов списания с расчетного счета");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыСсылкаБанковскийСчетКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", Элементы.Документы.ТекущиеДанные.СсылкаКонтрагент);
    НовыйМассив = Новый Массив();
    НовыйМассив.Добавить(НовыйПараметр);
    НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
    Элемент.ПараметрыВыбора = НовыеПараметры;
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	Для Каждого ТекущаяСтрока Из Объект.Документы Цикл
		Если НЕ ТекущаяСтрока.Загружать Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрока.ЭтоПоступление Тогда
			
			ДокументСсылка = ТекущаяСтрока.СсылкаДокумент;
			Если ДокументСсылка = Неопределено или ДокументСсылка.Пустая() Тогда
				ДокументОбъект = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
			Иначе
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			КонецЕсли;
			ОбщийМодуль.ЗаполнитьШапкуДокумента(ДокументОбъект);
			ДокументОбъект.Дата = ТекущаяСтрока.Дата;
			ДокументОбъект.Организация = Объект.Организация;
			ДокументОбъект.Счет = ТекущаяСтрока.СсылкаБанковскийСчетОрганизации;
			ДокументОбъект.Валюта = ДокументОбъект.Счет.Валюта;
			ДокументОбъект.ВидОперации = Обработки.ОбменСБанком.ОпределитьВидОперации(ТекущаяСтрока.ВидОплаты, Истина); //Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя;
			ДокументОбъект.Контрагент = ТекущаяСтрока.СсылкаКонтрагент;
			ДокументОбъект.Договор = ДокументОбъект.Контрагент.ОсновнойДоговор;
			ДокументОбъект.Сумма = ТекущаяСтрока.Сумма;
			ДокументОбъект.ВхНомер = ТекущаяСтрока.Номер;
			ДокументОбъект.ВхДата = ТекущаяСтрока.Дата;
			ДокументОбъект.НазначениеПлатежа = ТекущаяСтрока.НазначениеПлатежа;
			ДокументОбъект.Статья = Объект.СтатьяПоступление;
						
			УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(ДокументОбъект.Организация);
	 		ДокументОбъект.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(ДокументОбъект.Организация);	
			ФинансыКлиентСервер.ПересчитатьСуммуНДС(ДокументОбъект, УчитыватьНДС);
			
			Попытка
				ДокументОбъект.Записать();
				Попытка
					Если Объект.ДействиеПриЗагрузкеПоступлений = 0 Тогда
						Если ДокументОбъект.Проведен Тогда
							ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
						КонецЕсли;
					ИначеЕсли Объект.ДействиеПриЗагрузкеПоступлений = 1 Тогда
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
				Исключение
					Сообщить("Не удалось произвести проведение/отмену проведения " + ДокументОбъект.Ссылка + ". Ошибка: " + ОписаниеОшибки());
				КонецПопытки;
				
				ТекущаяСтрока.СсылкаДокумент = ДокументОбъект.Ссылка;
				ТекущаяСтрока.Загружать = Ложь;
				
			Исключение
				Сообщить("Не удалось создать документ для платежного поручения №" + ТекущаяСтрока.Номер + ". Ошибка: " + ОписаниеОшибки());
			КонецПопытки;
			
		Иначе
			
			ДокументСсылка = ТекущаяСтрока.СсылкаДокумент;
			Если ДокументСсылка = Неопределено или ДокументСсылка.Пустая() Тогда
				ДокументОбъект = Документы.СписаниеСРасчетногоСчета.СоздатьДокумент();
			Иначе
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			КонецЕсли;
			ОбщийМодуль.ЗаполнитьШапкуДокумента(ДокументОбъект);
			ДокументОбъект.Дата = ТекущаяСтрока.Дата;
			ДокументОбъект.Организация = Объект.Организация;
			ДокументОбъект.Счет = ТекущаяСтрока.СсылкаБанковскийСчетОрганизации;
			ДокументОбъект.Валюта = ДокументОбъект.Счет.Валюта;
			ДокументОбъект.ВидОперации = Обработки.ОбменСБанком.ОпределитьВидОперации(ТекущаяСтрока.ВидОплаты, Ложь, НЕ ПустаяСтрока(ТекущаяСтрока.СтатусСоставителя),,ТекущаяСтрока.ОчередностьПлатежа, ТекущаяСтрока.СсылкаКонтрагент); //Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
			ДокументОбъект.Контрагент = ТекущаяСтрока.СсылкаКонтрагент;
			Если НЕ ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам
				И НЕ ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику 
				И НЕ ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику
				И ТипЗнч(ДокументОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты") // №11762
			Тогда
				ДокументОбъект.Договор = ДокументОбъект.Контрагент.ОсновнойДоговор;
			КонецЕсли;	
			ДокументОбъект.СчетКонтрагента = Обработки.ОбменСБанком.НайтиБанковскийСчетКонтрагента(ДокументОбъект.Контрагент, ТекущаяСтрока.ПолучательСчет);
			ДокументОбъект.Сумма = ТекущаяСтрока.Сумма;
			ДокументОбъект.ИсхНомер = ТекущаяСтрока.Номер;
			ДокументОбъект.ИсхДата = ТекущаяСтрока.Дата;
			ДокументОбъект.НазначениеПлатежа = ТекущаяСтрока.НазначениеПлатежа;
			ДокументОбъект.Статья = Объект.СтатьяСписание;
			
			ДокументОбъект.ИдентификаторПлатежа = ТекущаяСтрока.ИдентификаторПлатежа;
			ДокументОбъект.ОчередностьПлатежа = ТекущаяСтрока.ОчередностьПлатежа;
			ДокументОбъект.КодВидаДохода = ТекущаяСтрока.КодНазПлатежа;
			
			Если НЕ ПустаяСтрока(ТекущаяСтрока.СтатусСоставителя) Тогда
				ДокументОбъект.ПеречислениеВБюджет = Истина;	
				ЗаполнитьЗначенияСвойств(ДокументОбъект, ТекущаяСтрока, "СтатусСоставителя,КодБК,КодОКАТО,ПоказательОснования,ПоказательПериода,ПоказательНомера,ПоказательДаты,ПоказательТипа");
			КонецЕсли;
			
			//ДокументОбъект.Оплачено = Истина;
			Если ДокументОбъект.Проведен Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Иначе
				ДокументОбъект.Записать();
			КонецЕсли;
			ТекущаяСтрока.СсылкаДокумент = ДокументОбъект.Ссылка;
			ТекущаяСтрока.Загружать = Ложь;
			
			Попытка
				ДокументОбъект.Записать();
				Попытка
					Если Объект.ДействиеПриЗагрузкеСписаний = 0 Тогда
						Если ДокументОбъект.Проведен Тогда
							ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
						КонецЕсли;
					ИначеЕсли Объект.ДействиеПриЗагрузкеСписаний = 1 Тогда
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
				Исключение
					Сообщить("Не удалось произвести проведение/отмену проведения " + ДокументОбъект.Ссылка + ". Ошибка: " + ОписаниеОшибки());
				КонецПопытки;
				
				ТекущаяСтрока.СсылкаДокумент = ДокументОбъект.Ссылка;
				ТекущаяСтрока.Загружать = Ложь;
				
			Исключение
				Сообщить("Не удалось создать документ для платежного поручения №" + ТекущаяСтрока.Номер + ". Ошибка: " + ОписаниеОшибки());
			КонецПопытки;
			
			//#3762
			Если ЗначениеЗаполнено(ТекущаяСтрока.ПлатежноеПоручение) Тогда
				ПлатежОбъект = ТекущаяСтрока.ПлатежноеПоручение.ПолучитьОбъект();
				ПлатежОбъект.Оплачено = Истина;
				Попытка
					ПлатежОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьСтатусыДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
	Элементы.Документы.Обновить();
	ПоказатьОповещениеПользователя("Создание документов завершено. Вам следует проверить и провести документы");
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если НЕ Элементы.Документы.ТекущиеДанные.СсылкаДокумент = Неопределено Тогда
		Если НЕ Элементы.Документы.ТекущиеДанные.СсылкаДокумент.Пустая() Тогда
			СтандартнаяОбработка = Ложь;
			Если Элементы.Документы.ТекущиеДанные.ЭтоПоступлениеКартинка = 0 Тогда
				Парам = Новый Структура;
				Парам.Вставить("Ключ",Элементы.Документы.ТекущиеДанные.СсылкаДокумент);
				ОткрытьФорму("Документ.СписаниеСРасчетногоСчета.Форма.ФормаДокумента",Парам);
			Иначе
				Парам = Новый Структура;
				Парам.Вставить("Ключ",Элементы.Документы.ТекущиеДанные.СсылкаДокумент);
				ОткрытьФорму("Документ.ПоступлениеНаРасчетныйСчет.Форма.ФормаДокумента",Парам);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыбратьДокументыНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлатежноеПоручение.Ссылка КАК Ссылка,
	|	ПлатежноеПоручение.Номер КАК Номер,
	|	ПлатежноеПоручение.Дата КАК Дата,
	|	ПлатежноеПоручение.Проведен КАК Проведен,
	|	ПлатежноеПоручение.Валюта КАК Валюта,
	|	ПлатежноеПоручение.ВидОперации КАК ВидОперации,
	|	ПлатежноеПоручение.Договор КАК Договор,
	|	ПлатежноеПоручение.Комментарий КАК Комментарий,
	|	ПлатежноеПоручение.Контрагент КАК Контрагент,
	|	ПлатежноеПоручение.СчетКонтрагента КАК СчетКонтрагента,
	|	ПлатежноеПоручение.Организация КАК Организация,
	|	ПлатежноеПоручение.Автор КАК Автор,
	|	ПлатежноеПоручение.Статья КАК Статья,
	|	ПлатежноеПоручение.Сумма КАК Сумма,
	|	ПлатежноеПоручение.Счет КАК Счет,
	|	ПлатежноеПоручение.ИсхНомер КАК ИсхНомер,
	|	ПлатежноеПоручение.ИсхДата КАК ИсхДата,
	|	ПлатежноеПоручение.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ПлатежноеПоручение.ПеречислениеВБюджет КАК ПеречислениеВБюджет,
	|	ПлатежноеПоручение.СтатусСоставителя КАК СтатусСоставителя,
	|	ПлатежноеПоручение.КодБК КАК КодБК,
	|	ПлатежноеПоручение.КодОКАТО КАК КодОКАТО,
	|	ПлатежноеПоручение.ПоказательОснования КАК ПоказательОснования,
	|	ПлатежноеПоручение.ПоказательПериода КАК ПоказательПериода,
	|	ПлатежноеПоручение.ПоказательНомера КАК ПоказательНомера,
	|	ПлатежноеПоручение.ПоказательДаты КАК ПоказательДаты,
	|	ПлатежноеПоручение.ПоказательТипа КАК ПоказательТипа,
	|	ПлатежноеПоручение.ОчередностьПлатежа КАК ОчередностьПлатежа,
	|	ПлатежноеПоручение.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	ПлатежноеПоручение.КодВидаДохода КАК КодНазПлатежа
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручение
	|ГДЕ
	|	ПлатежноеПоручение.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПлатежноеПоручение.Проведен
	|	И НЕ ПлатежноеПоручение.Оплачено
	|	И ПлатежноеПоручение.Счет = &Счет";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ПериодПлатежныхПорученийИсходящих.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ПериодПлатежныхПорученийИсходящих.ДатаОкончания));
	Запрос.УстановитьПараметр("Счет", Объект.РасчетныйСчет);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Сообщить("За указанный период документы для выгрузки в банк отсутствуют");
		Возврат;
	КонецЕсли;
	
	Объект.ДокументыНаВыгрузку.Очистить();

	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = Объект.ДокументыНаВыгрузку.Добавить();
		НоваяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер); //Число(Выборка.Номер);
		НоваяСтрока.Дата = Выборка.Дата;
		НоваяСтрока.Сумма = Выборка.Сумма;		
		НоваяСтрока.ПолучательИНН = Выборка.Контрагент.ИНН;
		
		НоваяСтрока.ПолучательСчет = Выборка.СчетКонтрагента.НомерСчета;
		Если ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Сотрудники") Тогда
			НоваяСтрока.ПолучательНаименование = Выборка.Контрагент.Наименование;
		Иначе
			НоваяСтрока.ПолучательКПП = Выборка.Контрагент.КПП;
			НоваяСтрока.ПолучательНаименование = ?(НЕ ПустаяСтрока(Выборка.Контрагент.НаименованиеПолное), Выборка.Контрагент.НаименованиеПолное, Выборка.Контрагент.Наименование);
		КонецЕсли;
		
		НоваяСтрока.СсылкаДокумент = Выборка.Ссылка;		
		НоваяСтрока.ПолучательБИК = Выборка.СчетКонтрагента.БИК;
		НоваяСтрока.НазначениеПлатежа = Выборка.НазначениеПлатежа;
		НоваяСтрока.СсылкаКонтрагент = Выборка.Контрагент;
		НоваяСтрока.ПолучательКорсчет = Выборка.СчетКонтрагента.КоррСчет;
		НоваяСтрока.ПолучательНаименованиеБанка = Выборка.СчетКонтрагента.НаименованиеБанка;		
		НоваяСтрока.ПолучательГородБанка = Выборка.СчетКонтрагента.ГородБанка;
		
		НоваяСтрока.СсылкаБанковскийСчетКонтрагента = Выборка.СчетКонтрагента;
		НоваяСтрока.СсылкаБанковскийСчетОрганизацииВалюта = Выборка.Валюта;
		НоваяСтрока.ПлательщикСчет = Выборка.Счет.НомерСчета;
		НоваяСтрока.ПлательщикИНН = Объект.Организация.ИНН;
		НоваяСтрока.ПлательщикКПП = Объект.Организация.КПП;
		НоваяСтрока.ПлательщикБИК = Выборка.Счет.БИК;
		НоваяСтрока.СсылкаБанковскийСчетОрганизации = Выборка.Счет;
		НоваяСтрока.ПлательщикКорсчет = Выборка.Счет.КоррСчет;
		НоваяСтрока.ПлательщикНаименованиеБанка = Выборка.Счет.НаименованиеБанка;
		НоваяСтрока.ПлательщикНаименование = ?(НЕ ПустаяСтрока(Выборка.Организация.ПолноеНаименование), Выборка.Организация.ПолноеНаименование, Выборка.Организация.Наименование);
		НоваяСтрока.ПлательщикГородБанка = Выборка.Счет.ГородБанка;
		
		Если Выборка.ПеречислениеВБюджет Тогда 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "ПеречислениеВБюджет,СтатусСоставителя,КодБК,КодОКАТО,ПоказательОснования,ПоказательПериода,ПоказательНомера,ПоказательДаты");
		КонецЕсли;
		
		НоваяСтрока.ОчередностьПлатежа = ?(ЗначениеЗаполнено(Выборка.ОчередностьПлатежа), Выборка.ОчередностьПлатежа, 5);
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "ИдентификаторПлатежа, КодНазПлатежа");		
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокументы(Команда)
	
	Если Объект.Организация.Пустая() Тогда 
		ПоказатьПредупреждение(,"Не заполнено значение Организации");
		Возврат;
	КонецЕсли;
	
	Если Объект.РасчетныйСчет.Пустая() Тогда 
		ПоказатьПредупреждение(,"Не выбран расчетный счет организации");
		Возврат;
	КонецЕсли; 	
	
	ВыбратьДокументыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВФайлНаСервере()
	Сообщить("Есть, генерал");
КонецПроцедуры

&НаСервере
Функция ЕстьОтмеченныеСтрокиКВыгрузке()
	Результат = Ложь;
	Для Каждого Стр из Объект.ДокументыНаВыгрузку Цикл
		Если Стр.Выгружать Тогда 
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
			
	Если не ЕстьОтмеченныеСтрокиКВыгрузке() Тогда	
		ПоказатьПредупреждение(,"Не выбраны строки для выгрузки");
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.ПолноеИмяФайла = "1c_to_kl.txt";
	Диалог.Заголовок = "Выберите имя файла для сохранения";              	
	Диалог.МножественныйВыбор = Ложь;                                    	
	Диалог.Фильтр = "Текстовый файл(*.txt)|*.txt";                       
	
	Если Объект.Кодировка = "DOS" Тогда
		КодировкаФайла = КодировкаТекста.OEM;
	ИначеЕсли Объект.Кодировка = "UTF8" Тогда 
		КодировкаФайла = КодировкаТекста.UTF8;
	Иначе
		КодировкаФайла = КодировкаТекста.ANSI;
	КонецЕсли;
	
	//Вызов собственно диалога на экран                                  	
	Если Диалог.Выбрать() Тогда                                          		
		//Сюда попадем только если пользователь нажал ОК                     	
		//Сохранение выбранного имени файла (полного имени, значит включая путь к нему)		
		ИмяФайла = Диалог.ПолноеИмяФайла;				
		Файл = Новый ЗаписьТекста(ИмяФайла, КодировкаФайла);
		МассивСтрокФайла = СформироватьФайлОбменаСБанком();
		Для каждого СтрокаМассива из МассивСтрокФайла Цикл
			Файл.ЗаписатьСтроку(СтрокаМассива);
		КонецЦикла;
		Файл.Закрыть();
		
		ПоказатьПредупреждение(,"Документы выгружены");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьФайлОбменаСБанком()
	Возврат ОбщийМодуль.СформироватьФайлОбменаСБанком(ЭтаФорма);
КонецФункции

&НаСервере 
Функция СоздатьДоговорСКонтрагентом(КонтрагентСсылка)
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НовыйДоговор.Наименование = "Основной договор";
	НовыйДоговор.Владелец = КонтрагентСсылка;
	НовыйДоговор.Записать();
	Возврат НовыйДоговор.Ссылка;
КонецФункции

&НаСервере
Функция СоздатьСчетКонтрагента(ПараметрыСчета)
	НовыйСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();
	НовыйСчет.Наименование = ?(ЗначениеЗаполнено(ПараметрыСчета.Банк), ПараметрыСчета.Банк + " ", "") + "счет № " + ПараметрыСчета.РасчетныйСчет;
	НовыйСчет.Владелец = ПараметрыСчета.Контрагент;
	НовыйСчет.НомерСчета = ПараметрыСчета.РасчетныйСчет;
	КодВалюты = Сред(ПараметрыСчета.РасчетныйСчет, 6, 3);
	КодВалюты = ?(КодВалюты = "810", "643", КодВалюты);
	НовыйСчет.Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты);
	НовыйСчет.БИК = ПараметрыСчета.БИК;
	НовыйСчет.КоррСчет = ПараметрыСчета.КорСчет;
	НовыйСчет.НаименованиеБанка = ПараметрыСчета.Банк;
	НовыйСчет.ГородБанка = ПараметрыСчета.БанкАдрес;
	НовыйСчет.Записать();
	Возврат НовыйСчет.Ссылка;
КонецФункции

&НаСервере
Функция ПерезаполнитьКонтрагентов(НаименованиеКотрагента, КонтрагентСсылка)
	Для Каждого СтрокаДокумента из Объект.Документы Цикл
		Если СтрокаДокумента.СсылкаКонтрагент = НаименованиеКотрагента Тогда 
			СтрокаДокумента.СсылкаКонтрагент = КонтрагентСсылка;
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервере
Функция СоздатьТекущегоКонтрагента(НаименованиеКонтрагента)
	
	ГруппаДоступаДляНовыхКонтрагентов = ОбщийМодульСервер.НастройкаПользователя("ГруппаДоступаДляНовыхКонтрагентов");
	
	УдалосьСоздать = Ложь;
	Для Каждого СтрокаДокумента из Объект.Документы Цикл
		Если СтрокаДокумента.СсылкаКонтрагент = НаименованиеКонтрагента Тогда 
			Попытка
				
				ЭтоПолучатель = ?(СтрокаДокумента.СсылкаКонтрагент = СтрокаДокумента.ПолучательСтрока, Истина, Ложь); 
				НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
				НовыйКонтрагент.Родитель = ПапкаДляСохраненияКонтрагента;
				НовыйКонтрагент.Наименование = Сред(НаименованиеКонтрагента,4);
				НовыйКонтрагент.НаименованиеПолное = Сред(НаименованиеКонтрагента,4);
				НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидКонтрагента.ЮрЛицо;
				НовыйКонтрагент.ИНН = ?(ЭтоПолучатель, СтрокаДокумента.ПолучательИНН, СтрокаДокумента.ПлательщикИНН);
				НовыйКонтрагент.КПП = ?(ЭтоПолучатель, СтрокаДокумента.ПолучательКПП, СтрокаДокумента.ПлательщикКПП);
				
				// №6293 определяем для нового элемента группу доступа из карточки пользователя
				НовыйКонтрагент.ГруппаДоступа = ГруппаДоступаДляНовыхКонтрагентов;
				
				НовыйКонтрагент.Записать();
				
				НовыйКонтрагент.ОсновнойДоговор = СоздатьДоговорСКонтрагентом(НовыйКонтрагент.Ссылка);
				
				//Для создания счета, определим параметры
				ПараметрыСчета = Новый Структура;
				ПараметрыСчета.Вставить("Контрагент", 		НовыйКонтрагент.Ссылка);
				ПараметрыСчета.Вставить("РасчетныйСчет",	?(ЭтоПолучатель, СтрокаДокумента.ПолучательСчет, 				СтрокаДокумента.ПлательщикСчет));
				ПараметрыСчета.Вставить("БИК",				?(ЭтоПолучатель, СтрокаДокумента.ПолучательБИК, 				СтрокаДокумента.ПлательщикБИК));
				ПараметрыСчета.Вставить("КорСчет",			?(ЭтоПолучатель, СтрокаДокумента.ПолучательКорсчет, 			СтрокаДокумента.ПлательщикКорсчет));
				ПараметрыСчета.Вставить("Банк",				?(ЭтоПолучатель, СтрокаДокумента.ПолучательБанкНаименование, 	СтрокаДокумента.ПлательщикБанкНаименование));
				ПараметрыСчета.Вставить("БанкАдрес",		?(ЭтоПолучатель, СтрокаДокумента.ПолучательБанкАдрес, 			СтрокаДокумента.ПлательщикБанкАдрес));
				
				НовыйКонтрагент.ОсновнойБанковскийСчет = СоздатьСчетКонтрагента(ПараметрыСчета); 
				НовыйКонтрагент.Записать();
				ПерезаполнитьКонтрагентов(НаименованиеКонтрагента, НовыйКонтрагент.Ссылка);
				УдалосьСоздать = Истина;
			Исключение
				УдалосьСоздать = Ложь;
				Сообщить ("Не удалось создать Контрагента """ + НаименованиеКонтрагента + """ по причине:
				|" + ОписаниеОшибки(), СтатусСообщения.Внимание);
			КонецПопытки;			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат УдалосьСоздать;
КонецФункции

&НаСервере
Функция СоздатьКонтрагентовНаСервереУдалось()
	ТЗ = Объект.Документы.Выгрузить();
	ТЗ.Свернуть("СсылкаКонтрагент");
	УдалосьСоздать = Истина;
	Для Каждого ТекущийКонтрагент из ТЗ Цикл
		Если ТипЗнч(ТекущийКонтрагент.СсылкаКонтрагент) = Тип("Строка") Тогда 
			УдалосьСоздать = СоздатьТекущегоКонтрагента(ТекущийКонтрагент.СсылкаКонтрагент);
		КонецЕсли;
	КонецЦикла;	
	Возврат  УдалосьСоздать;
КонецФункции

&НаСервере
Функция ЭтоГруппа()
	Возврат ПапкаДляСохраненияКонтрагента.ЭтоГруппа;
КонецФункции

&НаКлиенте
Процедура СоздатьКонтрагентов(Команда)
	Если Объект.Документы.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Таблица документов пустая";
		Сообщение.Поле = "Документы";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	
	Если ПапкаДляСохраненияКонтрагента.Пустая() Тогда  
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Необходимо выбрать папку для сохранения созданных контрагентов";
		Сообщение.Поле = "ПапкаДляСохраненияКонтрагента";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если не ЭтоГруппа() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выбрана не папка";
		Сообщение.Поле = "ПапкаДляСохраненияКонтрагента";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;   		
		
	Элементы.ГруппаСоздатьКонтрагента.Видимость = не СоздатьКонтрагентовНаСервереУдалось();
	
КонецПроцедуры

&НаКлиенте
Процедура ПапкаДляСохраненияКонтрагентаСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаГруппы", Новый Структура("Ключ",ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка")));
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеЗагрузка()
	
	УсловноеОформление.Элементы.Очистить();
	
	// ДокументыКИмпортуДокументНеЗагружен
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента 		= ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных("ДокументыДокументНеЗагружен");

	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Документы.СсылкаДокумент");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не загружен'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	// ДокументыКИмпортуДокументНеЗагружен
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента 		= ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных("ДокументыДокументНеЗагружен");

	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Документы.СсылкаДокумент");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	// Документы Документ
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента 		= ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных("ДокументыСсылкаДокумент");

	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Документы.СсылкаДокумент");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);


	// Документы Контрагент

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента 		= ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных("ДокументыСсылкаКонтрагент");

	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Документы.СсылкаКонтрагент");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НачинаетсяС;
	Элемент.ПравоеЗначение = "!!!";
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("ДокументыСсылкаКонтрагент"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	
КонецПроцедуры


#Область Формат_2_00_Казахстан

&НаСервере
Процедура ПрочитатьВыбранныйФайлФорма_2_00(Текст)
			
	Объект.Документы.Очистить();

	СформироватьСоответствиеЗагружаемых();
	//СформироватьТегиРасчетногоСчета();
	ОбщийМодуль.СформироватьТегиРасчетногоСчета(ТегиРасчетногоСчета);
	//СформироватьТегиЗаголовка();
	ОбщийМодуль.СформироватьТегиЗаголовка(ТегиЗаголовка, Импорт_Заголовок);
	 
	Импорт_ПризнакОбмена = Ложь;
	Импорт_ТекстДляРазбора = Текст;
	
	Если Импорт_ТекстДляРазбора = Неопределено Тогда
		Сообщить("Файл импорта не содержит данных!");
		Возврат;
	КонецЕсли;
	
	// Заполняем первичные структуры данных
	Импорт_КоличествоСтрок = СтрЧислоСтрок(Импорт_ТекстДляРазбора);
	Импорт_ТекущаяСтрока = 1;
	Наличие = 0;
	Пока Импорт_ТекущаяСтрока <= Импорт_КоличествоСтрок Цикл
		
		Стр = ПолучитьСтрокуИмпорта();
		
		Если Лев(Врег(СокрЛП(Стр)), 14)="СЕКЦИЯДОКУМЕНТ" Тогда
			
			Значение = "";
			Тег 	 = "";
			РазобратьТеговуюСтроку(Стр, Тег, Значение);  
			
			Если Тег = "СЕКЦИЯДОКУМЕНТ" Тогда
				НоваяСтрокаДокументов = Объект.Документы.Добавить();
				
				Если НЕ ЗагрузитьСекциюДокумента(НоваяСтрокаДокументов) Тогда
					Возврат;
				КонецЕсли;
				
				Если (Импорт_ТекущаяСтрока-1) = Импорт_КоличествоСтрок Тогда 
					Наличие = 1;
					Если НЕ Импорт_ПризнакОбмена Тогда
						Сообщить("В файле импорта отсутствует признак обмена ""1CClientBankExchange""!");
						Возврат;
					КонецЕсли;
					
					ПослеЗагрузкиДокументов();
					
			        // Формируем объектные структуры данных
				//	Для каждого СтрокаДокумента Из ДокументыДляИмпорта Цикл
				//		// Последовательно обрабатываем каждую загруженную строку
				//
				//		//Распознаем реквизиты - порядок распознания важен
				//		РаспознатьДанныеВСтрокеДокумента(СтрокаДокумента, "СуммаДокумента", ,Ложь);
				//		РаспознатьДанныеВСтрокеДокумента(СтрокаДокумента, "ТипДокумента", ДокументыДляИмпорта,Ложь);
				//
				//		РаспознатьДанныеВСтрокеДокумента(СтрокаДокумента, "Контрагент",,Ложь );
				//		РаспознатьДанныеВСтрокеДокумента(СтрокаДокумента, "СчетКонтрагента",,Ложь );
				//		
				//		
				//		//Производим поиск документа в ИБ
				//		РаспознатьДанныеВСтрокеДокумента(СтрокаДокумента, "Документ", ,Ложь);
				//
				//		// Для каждого реквизита (= колонка) надо проверить на пустое значение
				//		Для каждого КолонкаИмпорта из ДокументыДляИмпорта.Колонки Цикл
				//			ПроверитьНаПустоеЗначениеИмпорта(СтрокаДокумента, КолонкаИмпорта.Имя, КолонкаИмпорта.Заголовок);
				//		КонецЦикла;
				//
				//		Если СтрокаДокумента.Готовность < 3 Тогда
				//			СтрокаДокумента.Загрузить = Истина;
				//		КонецЕсли;
				//
				//	КонецЦикла;
				
			        Сообщить("Обработка файла импорта завершена успешно.");
			        Возврат;
				КонецЕсли;
								
			Иначе
				Сообщить("Нарушена структура файла импорта, строка " + (Импорт_ТекущаяСтрока - 1) + " : " + Стр);
				Возврат;
				
			КонецЕсли;
			
		ИначеЕсли Лев(Врег(СокрЛП(Стр)), 14)="СЕКЦИЯРАСЧСЧЕТ" Тогда
			//СтрокаРССчетов = Импорт_РассчетныеСчета.Добавить();
			Если НЕ ЗагрузитьСекциюРасчСчета() Тогда
				Сообщить("Нарушена структура файла импорта в секции описания расчетного счета! Строка: " + (Импорт_ТекущаяСтрока - 1));
				Возврат;
			КонецЕсли;
				
		ИначеЕсли Лев(Врег(СокрЛП(Стр)), 8)="РАСЧСЧЕТ" Тогда
			Значение = "";
			Тег = "";
			РазобратьТеговуюСтроку(Стр, Тег, Значение);
			
			Если Тег = "РАСЧСЧЕТ" Тогда
				Если Обработки.ОбменСБанком.ПроверитьБанковскийСчет(Значение, Объект.Организация) = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
					ТекстОшибки = СтрШаблон("В заголовке файла импорта указан счет %1,
											|- не принадлежащий организации
											|- либо к данному счету отсутствует доступ!", Значение);
					Сообщить(ТекстОшибки, СтатусСообщения.ОченьВажное);
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Лев(Врег(СокрЛП(Стр)), 8)="ДОКУМЕНТ" Тогда
			//Импорт_ВидыДокументов.Добавить(Значение);

		ИначеЕсли Лев(Врег(СокрЛП(Стр)), 10)="КОНЕЦФАЙЛА" И Наличие = 0 Тогда
			Если НЕ Импорт_ПризнакОбмена Тогда
				Сообщить("В файле импорта отсутствует признак обмена ""1CClientBankExchange""!");
				Возврат;
			КонецЕсли;
			
			ПослеЗагрузкиДокументов();
			
			//// Формируем объектные структуры данных
			//Для Каждого СтрокаДокумента Из Объект.Документы Цикл
			//	// Последовательно обрабатываем каждую загруженную строку
			//	
			//	//Распознаем реквизиты 
			//	Если СтрокаДокумента.ЭтоПоступление Тогда
			//		СтрокаДокумента.СсылкаБанковскийСчетОрганизации = НайтиБанковскийСчетПоНомеру(СтрокаДокумента.ПолучательСчет);
			//		СтрокаДокумента.СсылкаБанковскийСчетОрганизацииВалюта = ТекущаяСтрока.СсылкаБанковскийСчетОрганизации.Валюта;
			//	Иначе
			//		СтрокаДокумента.СсылкаБанковскийСчетОрганизации = НайтиБанковскийСчетПоНомеру(СтрокаДокумента.ПлательщикСчет);
			//		СтрокаДокумента.СсылкаБанковскийСчетОрганизацииВалюта = ТекущаяСтрока.СсылкаБанковскийСчетОрганизации.Валюта;
			//	КонецЕсли;
					
				//РаспознатьДанныеВСтрокеДокумента(СтрокаДокумента, "СуммаДокумента", ,Ложь);

				//РаспознатьДанныеВСтрокеДокумента(СтрокаДокумента, "ТипДокумента", ДокументыДляИмпорта,Ложь);
				//
				//РаспознатьДанныеВСтрокеДокумента(СтрокаДокумента, "Контрагент", ,Ложь);
				//РаспознатьДанныеВСтрокеДокумента(СтрокаДокумента, "СчетКонтрагента", ,Ложь);
				//
				////Производим поиск документа в ИБ
				//РаспознатьДанныеВСтрокеДокумента(СтрокаДокумента, "Документ", ,Ложь);
				//
				//// Для каждого реквизита (= колонка) надо проверить на пустое значение
				//Для каждого КолонкаИмпорта из ДокументыДляИмпорта.Колонки Цикл
				//	Если Найти(КолонкаИмпорта.Имя, "РНН") = 0 Тогда
				//		// РНН не проверяем
				//		ПроверитьНаПустоеЗначениеИмпорта(СтрокаДокумента, КолонкаИмпорта.Имя, КолонкаИмпорта.Заголовок);
				//	КонецЕсли;
				//КонецЦикла;
				//
				//Если СтрокаДокумента.Готовность < 3 Тогда
				//	СтрокаДокумента.Загрузить = Истина;
				//КонецЕсли;
				
			//КонецЦикла;
			
			Сообщить("Обработка файла импорта завершена успешно.");
			
			Возврат;
			
		ИначеЕсли Лев(Врег(СокрЛП(Стр)), 20)="1CCLIENTBANKEXCHANGE" Тогда
			Импорт_ПризнакОбмена = Истина;
			
		Иначе
			ЗагрузитьСтрокуЗаголовка(Стр);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиДокументов()
	
	Для Каждого СтрокаДокумента Из Объект.Документы Цикл	
		//Распознаем реквизиты 
		Если СтрокаДокумента.ЭтоПоступление Тогда
			СтрокаДокумента.СсылкаБанковскийСчетОрганизации = Обработки.ОбменСБанком.НайтиБанковскийСчетПоНомеру(СтрокаДокумента.ПолучательСчет);
			СтрокаДокумента.СсылкаБанковскийСчетОрганизацииВалюта = СтрокаДокумента.СсылкаБанковскийСчетОрганизации.Валюта;
			Если НЕ ПустаяСтрока(СтрокаДокумента.ПлательщикИНН) Тогда
				СтрокаДокумента.СсылкаКонтрагент = Обработки.ОбменСБанком.НайтиКонтрагентаПоИНН(СтрокаДокумента.ПлательщикИНН);
			КонецЕсли;
			
			//Если не нашли контрагент, то показываем надпись и кнопку - "Создать контрагента"
			Если СтрокаДокумента.СсылкаКонтрагент.Пустая() Тогда
				СтрокаДокумента.СсылкаКонтрагент = СтрокаДокумента.ПлательщикСтрока; 
				Элементы.ГруппаСоздатьКонтрагента.Видимость = Истина;
			КонецЕсли;
			
			СтрокаДокумента.СсылкаДокумент = Обработки.ОбменСБанком.НайтиПоступлениеНаРасчетныйСчет(СтрокаДокумента.Номер, СтрокаДокумента.Дата);

		Иначе
			СтрокаДокумента.СсылкаБанковскийСчетОрганизации = Обработки.ОбменСБанком.НайтиБанковскийСчетПоНомеру(СтрокаДокумента.ПлательщикСчет);
			СтрокаДокумента.СсылкаБанковскийСчетОрганизацииВалюта = СтрокаДокумента.СсылкаБанковскийСчетОрганизации.Валюта;
			Если НЕ ПустаяСтрока(СтрокаДокумента.ПолучательИНН) Тогда
				СтрокаДокумента.СсылкаКонтрагент = Обработки.ОбменСБанком.НайтиКонтрагентаПоИНН(СтрокаДокумента.ПолучательИНН);
			КонецЕсли;
			//Если не нашли контрагент, то показываем надпись и кнопку - "Создать контрагента"
			Если СтрокаДокумента.СсылкаКонтрагент.Пустая() Тогда
				СтрокаДокумента.СсылкаКонтрагент = СтрокаДокумента.ПолучательСтрока; 
				Элементы.ГруппаСоздатьКонтрагента.Видимость = Истина;
			КонецЕсли;
			
			СтрокаДокумента.СсылкаДокумент = Обработки.ОбменСБанком.НайтиСписаниеСРасчетногоСчета(СтрокаДокумента.Номер, СтрокаДокумента.Дата);

		КонецЕсли;
		
		СтрокаДокумента.Загружать = Истина;		
	КонецЦикла;
	
	ОбновитьСтатусыДокументов();
	
КонецПроцедуры


// Загружает секцию документа
&НаСервере
Функция ЗагрузитьСекциюДокумента(СтрокаДокумента) //+
	
	СтрокаРазбора = ПолучитьСтрокуИмпорта();
	Приход = 0;
	Расход = 0;
	Пока Лев(Врег(СокрЛП(СтрокаРазбора)), 14) <> "КОНЕЦДОКУМЕНТА" Цикл
		
		Значение = "";
		Тег = "";
		
		Если РазобратьТеговуюСтроку(СтрокаРазбора, Тег, Значение) Тогда
			
			//Если Импорт_Загружаемые[Тег] = Истина Тогда
			//	Если  Тег = "ВИДДОКУМЕНТА" Тогда 
			//		СтрокаДокумента.Операция = Значение;
			//	Иначе
			//	СтрокаДокумента[Тег] = Значение;                 
			//	КонецЕсли;
			//КонецЕсли;
			Если Тег = "НОМЕРДОКУМЕНТА" Тогда 
				СтрокаДокумента.Номер = Значение;
			ИначеЕсли Тег = "ДАТАДОКУМЕНТА" Тогда
				СтрокаДокумента.Дата = Дата(Сред(Значение,7,4), Сред(Значение,4,2), Сред(Значение,0,2));
			ИначеЕсли Тег = "ПЛАТЕЛЬЩИКИИК" Тогда	
				СтрокаДокумента.ПлательщикСчет = Значение;
			ИначеЕсли Тег = "ПОЛУЧАТЕЛЬИИК" Тогда	
				СтрокаДокумента.ПолучательСчет = Значение;
			ИначеЕсли Тег = "ПЛАТЕЛЬЩИКБИН_ИИН" Тогда	
				СтрокаДокумента.ПлательщикИНН = Значение;
			ИначеЕсли Тег = "ПОЛУЧАТЕЛЬБИН_ИИН" Тогда	
				СтрокаДокумента.ПолучательИНН = Значение;
			ИначеЕсли Тег = "ПЛАТЕЛЬЩИКБАНКБИК" Тогда	
				СтрокаДокумента.ПлательщикБИК = Значение;
			ИначеЕсли Тег = "ПОЛУЧАТЕЛЬБАНКБИК" Тогда	
				СтрокаДокумента.ПолучательБИК = Значение;
			ИначеЕсли Тег = "ПЛАТЕЛЬЩИКНАИМЕНОВАНИЕ" Тогда	
				СтрокаДокумента.ПлательщикСтрока = "!!!" + Значение;
			ИначеЕсли Тег = "ПОЛУЧАТЕЛЬНАИМЕНОВАНИЕ" Тогда	
				СтрокаДокумента.ПолучательСтрока = "!!!" + Значение;
			ИначеЕсли Тег = "ПЛАТЕЛЬЩИКБАНКНАИМЕНОВАНИЕ" Тогда	
				СтрокаДокумента.ПлательщикБанкНаименование = Значение;
			ИначеЕсли Тег = "ПОЛУЧАТЕЛЬБАНКНАИМЕНОВАНИЕ" Тогда	
				СтрокаДокумента.ПолучательБанкНаименование = Значение;
				
			ИначеЕсли Тег = "НАЗНАЧЕНИЕПЛАТЕЖА" Тогда	
				СтрокаДокумента.НазначениеПлатежа = Значение;
				
			ИначеЕсли Тег = "СУММАПРИХОД" Тогда 
				//Приход = 1;
				СтрокаДокумента.Сумма = Значение;
				СтрокаДокумента.ЭтоПоступление = Истина;
				СтрокаДокумента.ЭтоПоступлениеКартинка = 1;
			ИначеЕсли Тег = "СУММАРАСХОД" Тогда 
				//Расход = 1;
				СтрокаДокумента.Сумма = Значение;
				СтрокаДокумента.ЭтоПоступление = Ложь;
				СтрокаДокумента.ЭтоПоступлениеКартинка = 0;
			КонецЕсли;		
			
		КонецЕсли;
		
		СтрокаРазбора = ПолучитьСтрокуИмпорта();
		
	КонецЦикла;
	
	//Если приход = 1 Тогда 
	//	СтрокаДокумента.ДатаПоступило = СтрокаДокумента.ДатаОперации;
	//КонецЕсли;
	//
	//Если Расход = 1 Тогда 
	//	СтрокаДокумента.ДатаСписано = СтрокаДокумента.ДатаОперации;
	//КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ЗагрузитьСекциюРасчСчета(СтрокаРССчета=Неопределено) 
	
	СтрокаРазбора = ПолучитьСтрокуИмпорта();
	
	Значение = "";
	Тег = "";
	
	Пока РазобратьТеговуюСтроку(СтрокаРазбора, Тег, Значение) Цикл   
		
		Если ТегиРасчетногоСчета[Тег] = Истина Тогда
			//СтрокаРССчета[Тег] = Значение;       
			
		Иначе
			Если Тег = "РАСЧЕТНЫЙСЧЕТ" Тогда 
				//СтрокаРССчета["РасчСчет"] = Значение;
			ИначеЕсли Тег = "НАЧАЛЬНЫЙ ОСТАТОК" Тогда
				//СтрокаРССчета["НачальныйОстаток"] = Значение;
			Иначе
				
				// неправильный реквизит заголовка
				Сообщить("Неверный реквизит в секции описания расчетного счета, строка " + (Импорт_ТекущаяСтрока - 1) + " : " + СтрокаРазбора);
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаРазбора = ПолучитьСтрокуИмпорта();
		
		Значение = "";
		Тег = "";
		
	КонецЦикла;
	
	Если ВРЕГ(Лев(СокрЛП(СтрокаРазбора), 13)) = "КОНЕЦРАСЧСЧЕТ" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗагрузитьСтрокуЗаголовка(ТекстСтрокиЗаголовка) 
	
	Значение = "";
	Тег = "";
	РазобратьТеговуюСтроку(ТекстСтрокиЗаголовка, Тег, Значение);
	
	Если ТегиЗаголовка[Тег] = Истина Тогда
		Импорт_Заголовок[Тег] = Значение;
		
	Иначе
		// неправильный реквизит заголовка
		Сообщить("Неверный реквизит заголовка, строка " + (Импорт_ТекущаяСтрока - 1) + " : " + ТекстСтрокиЗаголовка);
		
	КонецЕсли;
		
КонецФункции

&НаСервере
Функция ПолучитьСтрокуИмпорта()
	
	Буфер = "";
	
	Пока (ПустаяСтрока(Буфер)) ИЛИ (Лев(Буфер, 2) = "//") Цикл
		Если Импорт_ТекущаяСтрока > Импорт_КоличествоСтрок Тогда
			Возврат "";
		КонецЕсли;
			
		Буфер = СокрЛП(СтрПолучитьСтроку(Импорт_ТекстДляРазбора, Импорт_ТекущаяСтрока));
		Импорт_ТекущаяСтрока = Импорт_ТекущаяСтрока + 1;
		
	КонецЦикла;
	
	Возврат Буфер;
	
КонецФункции

&НаСервере
Функция РазобратьТеговуюСтроку(СтрокаРазбора, Тег, Значение)
	
	ПозицияПрисваивания = Найти(СтрокаРазбора, "=");
	Если ПозицияПрисваивания = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Тег = ВРЕГ(СокрЛП(Лев(СтрокаРазбора, ПозицияПрисваивания - 1)));
	Значение = СокрЛП(Сред(СтрокаРазбора, ПозицияПрисваивания + 1));
	
	Возврат НЕ ПустаяСтрока(Тег);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокиРеквизитовПлДокументов()
	
	РеквизитыПлДок_Основные = "НомерДокумента,ДатаДокумента,Сумма";
	РеквизитыПлДок_Плательщик 		= "ПлательщикНаименование,ПлательщикРНН,ПлательщикБИН_ИИН,ПлательщикКБЕ,ПлательщикИИК";
	РеквизитыПлДок_ПлательщикНПР 	= "ПлательщикБанкНаименование,ПлательщикБанкРНН,ПлательщикБанкБИН_ИИН,ПлательщикБанкБИК";
	РеквизитыПлДок_Получатель 		= "ПолучательНаименование,ПолучательРНН,ПолучательБИН_ИИН,ПолучательКБЕ,ПолучательИИК";
	РеквизитыПлДок_ПолучательНПР 	= "ПолучательБанкНаименование,ПолучательБанкРНН,ПолучательБанкБИН_ИИН,ПолучательБанкБИК";	
	РеквизитыПлДок_БанкПосредник 	= "БанкПосредникНаименование,БанкПосредникИИК,БанкПосредникРНН,БанкПосредникБИН_ИИН,БанкПосредникБИК";
	РеквизитыПлДок_БюджетПлатеж 	= "КодНазначенияПлатежа";
	РеквизитыПлДок_Назначение		= "НазначениеПлатежа";
	РеквизитыПлДок_НеОбязательные 	= "ПлательщикБанкИИК,ПолучательБанкИИК,ДатаПолученияТовара,КодБюджетнойКлассификации,ДатаВалютирования,ВидДокумента,ДатаОперации,СуммаПриход,СуммаРасход";
	РеквизитыПлДок_СоцПенс 			= "ПенсионныеОтчисления,СоциальныеОтчисления,ПеречислениеНаКартСчета,ПеречислениеПоИЛ,ПеречислениеПодотчетнику";
	РеквизитыПлДок_ГЦВП 			= "ГЦВПБанкНаименование,ГЦВПИИК,ГЦВПРНН,ГЦВПБанкБИК";

КонецПроцедуры

&НаСервере
Процедура СформироватьСоответствиеЗагружаемых()
	
	ЗаполнитьСтрокиРеквизитовПлДокументов();
	
	Импорт_Загружаемые = ОбщийМодуль.СоздатьСоответствиеИзСтроки(ВРЕГ(РеквизитыПлДок_Основные + ","
	 + РеквизитыПлДок_Плательщик + ","
	 + РеквизитыПлДок_ПлательщикНПР + ","
	 + РеквизитыПлДок_Получатель + ","
	 + РеквизитыПлДок_ПолучательНПР + ","
	 + РеквизитыПлДок_НеОбязательные + ","
	 + РеквизитыПлДок_БанкПосредник + ","
	 + РеквизитыПлДок_БюджетПлатеж + ","
	 + РеквизитыПлДок_Назначение));
	
КонецПроцедуры

#КонецОбласти
