&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ГруппаПродаетПотолкиВРозницу.Видимость = НЕ Объект.ОднаОрганизацияПроизводстваИПродажиПотолков;
	Элементы.КонтрагентПроизводствоПотолков.Видимость = НЕ Объект.ОднаОрганизацияПроизводстваИПродажиПотолков;
	
	Элементы.ГруппаПоступлениеТоваровОтПроизводства.Видимость = НЕ Объект.ОднаОрганизацияПроизводстваИПродажиПотолков;
	
	//Элементы.РазрешитьПереводЗаказаВОтгруженБезОформленияРеализации.Видимость = Объект.ОднаОрганизацияПроизводстваИПродажиПотолков;
	
	Если Объект.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
		Объект.ОрганизацияРозничныеПродажи = Объект.ОрганизацияПроизводствоПотолков;
		Если НЕ Объект.УказыватьКонтрагентаРозницыВЗаказахНаПроизводство Тогда
			Объект.КонтрагентРозничныеПродажи = Объект.КонтрагентПроизводствоПотолков;
		КонецЕсли;
		Элементы.ГруппаПроизводитПотолки.Заголовок = "Производит и продает потолки";
		Элементы.ГруппаУказыватьКонтрагентаРозницыВЗаказеНаПроизводство.Видимость = Истина;
	Иначе
		Элементы.ГруппаПроизводитПотолки.Заголовок = "Производит потолки";
		Объект.УказыватьКонтрагентаРозницыВЗаказахНаПроизводство = Ложь;
		Элементы.ГруппаУказыватьКонтрагентаРозницыВЗаказеНаПроизводство.Видимость = Ложь;
	КонецЕсли;
	
	//Элементы.ПроизводствоВидЦенТовары.Видимость = НЕ Объект.НеУчитыватьСтоимостьВЗаказахНаПроизводство;
	Элементы.ПроизводствоВидЦенТовары.Видимость = НЕ Объект.ОднаОрганизацияПроизводстваИПродажиПотолков;
	
	Элементы.КонтрагентРозничныеПродажи1.Видимость = Объект.УказыватьКонтрагентаРозницыВЗаказахНаПроизводство;
	
	//Элементы.ВыделятьТоварыИМатериалыВОтдельныйЗаказ.Видимость = Объект.ЗаказПоставщикуЗаказыватьМатериалы ИЛИ Объект.ЗаказПоставщикуЗаказыватьТовары; //Переход на 2.0
	
КонецПроцедуры

//Начало исключен при переходе на 2.0
//&НаСервере
//Функция ПолучитьДоступныеСтатусыЗаказовНаПроизводство()
//	
//	ВидыСтатусов = Новый СписокЗначений;	
//	ВидыСтатусов.Добавить(Справочники.СтатусыЗаказовНаПроизводство.Новый);	
//	//Начало исключен при переходе на 2.0
//	//Если Константы.ИспользоватьСтатусПодтвержденВПроизводстве.Получить() Тогда
//	//	ВидыСтатусов.Добавить(Справочники.СтатусыЗаказовНаПроизводство.Подтвержден);
//	//КонецЕсли;
//	//Конец исключен при переходе на 2.0
//	ВидыСтатусов.Добавить(Справочники.СтатусыЗаказовНаПроизводство.ВПроизводстве);
//	
//	Возврат ВидыСтатусов;
//	
//КонецФункции
//Конец исключен при переходе на 2.0

//НАЧАЛО: Переход на 2.0
//&НаКлиенте
//Процедура ПроизводствоТекущийСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//
//	СтандартнаяОбработка = Ложь;
//	
//	ДоступныеСтатусы = ПолучитьДоступныеСтатусыЗаказовНаПроизводство();
//	
//	ДанныеВыбора = Новый СписокЗначений;
//	Для НомерСтатуса = 0 По ДоступныеСтатусы.Количество()-1 Цикл
//		ДанныеВыбора.Добавить(ДоступныеСтатусы[НомерСтатуса].Значение);
//	КонецЦикла;
//	
//КонецПроцедуры
//КОНЕЦ: Переход на 2.0

&НаКлиенте
Процедура ОднаОрганизацияПроизводстваИПродажиПотолковПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
		ВидИнтеркампани = 1;
	Иначе
		ВидИнтеркампани = 0;
	КонецЕсли;
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПроизводствоПотолковПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПроизводствоПотолковПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура НеУчитыватьСтоимостьВЗаказахНаПроизводствоПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура УказыватьКонтрагентаРозницыВЗаказахНаПроизводствоПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПоставщикуЗаказыватьМатериалыПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПоставщикуЗаказыватьТоварыПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВидИнтеркампаниПриИзменении(Элемент)
	Объект.ОднаОрганизацияПроизводстваИПродажиПотолков = ВидИнтеркампани;
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Элементы.СтатусНовогоЗаказаПокупателя.Видимость = Константы.ИспользоватьСтатусНовыйВЗаказеПокупателя.Получить();
	
	Элементы.ПроизводствоСклад.Видимость = Константы.СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции.Получить();
	
	Если НЕ Константы.ИспользоватьПодразделения.Получить() И НЕ ЗначениеЗаполнено(Объект.ПроизводствоПодразделение) Тогда 
		Элементы.ПроизводствоПодразделение.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

