
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//#8113
	ИнформацияОСтатусеЛида = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Статус лида: %1 -> %2", Параметры.ТекущийСтатус, Параметры.СтатусПерехода);
	
	// №9558
	ИнформацияОДатеСледующегоКонтакта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Дата следующего контакта: %1 -> %2", Параметры.ДатаСледующегоКонтакта, """Очистится""");
	Элементы.ИнформацияОДатеСледующегоКонтакта.Видимость = (НЕ ПустаяСтрока(Параметры.ДатаСледующегоКонтакта));
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Вид.Пустая() Тогда
		ПоказатьПредупреждение(,"Не указан вид не целевого лида");
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Вид",Вид);
	СтруктураОтвета.Вставить("Комментарий",Комментарий);
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

