Функция ЗначениеПрава(Пользователь, ЭлементПраво) Экспорт
    Если ТипЗнч(ЭлементПраво) = Тип("Строка") Тогда
        Право = ПланыВидовХарактеристик.ИА_ПраваПользователей[ЭлементПраво];
    Иначе
        Право = ЭлементПраво;
    КонецЕсли; 
    
    Отбор = Новый Массив;
    Если ЗначениеЗаполнено(Пользователь) Тогда
        Отбор.Добавить(Пользователь);	
        Ц = Пользователь;
        Пока ЗначениеЗаполнено(Ц.Родитель) Цикл        
            Отбор.Добавить(Ц.Родитель);
            Ц = Ц.Родитель;
        КонецЦикла; 
        Запрос = Новый Запрос(
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   Т.Ссылка,
        |   Т.Ссылка.Порядок КАК Порядок
        |ИЗ
        |   Справочник.ИА_ПраваГруппыПользователей.Состав КАК Т
        |ГДЕ
        |   Т.Пользователь В (&МассивПользователей)
        |   И НЕ Т.Ссылка.ПометкаУдаления
        |   И Т.Ссылка <> ЗНАЧЕНИЕ(Справочник.ИА_ПраваГруппыПользователей.ВсеПользователи)
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |   ЗНАЧЕНИЕ(Справочник.ИА_ПраваГруппыПользователей.ВсеПользователи),
        |   999999999
        |
        |УПОРЯДОЧИТЬ ПО
        |   Порядок");
        Запрос.УстановитьПараметр("МассивПользователей", Отбор);
        Выборка = Запрос.Выполнить().Выбрать();
        Пока Выборка.Следующий() Цикл
            Отбор.Добавить(Выборка.Ссылка);
        КонецЦикла;
    КонецЕсли; 
     
    Контекст = Новый Структура("Пользователь, Право, Отбор"
    , Пользователь, Право, Отбор);
    ИА_ПраваСПереопределяемый.ДополнитьОтборПоПользователю(Контекст);
    
    Результат = ЗначениеПраваВнутр(Отбор, Право);
    
    Результат = Право.ТипЗначения.ПривестиЗначение(Результат); // т.к. м.б. "неопределено"
    
    Контекст = Новый Структура("Пользователь, Право, Отбор, Результат"
    , Пользователь, Право, Отбор, Результат);
    ИА_ПраваСПереопределяемый.ПослеПолученияЗначенияПрава(Контекст);
    
    Возврат Контекст.Результат;
КонецФункции

Функция ЗначениеПраваВнутр(Отбор, Право)
    // Пользователь м.б. "массивом", в таком случае порядок в этом массиве считается порядком поиска права:
    // более ранний в массиве имеет больший приоритет
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Право = ПланыВидовХарактеристик.ИА_ПраваПользователей.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    Результат = Право.ЗначениеПоУмолчанию;
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   Т.Пользователь,
    |   Т.Право,
    |   Т.Значение
    |ИЗ
    |   РегистрСведений.ИА_ПраваЗначения КАК Т
    |ГДЕ
    |   Т.Пользователь В(&Массив)
    |   И Т.Право = &Право";
    Запрос.УстановитьПараметр("Массив",   Отбор);
    Запрос.УстановитьПараметр("Право",    Право);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    Если НЕ РезультатЗапроса.Пустой() Тогда
        Мин = Отбор.Количество() + 1;
        Пока Выборка.Следующий() Цикл
            Индекс = Отбор.Найти(Выборка.Пользователь);
            Если Индекс < Мин Тогда
                Мин = Индекс;
                Результат = Выборка.Значение;                
            КонецЕсли; 
        КонецЦикла;
    КонецЕсли; 
    Возврат Результат;
КонецФункции
