
////#Область Общие_процедуры

Функция   СформироватьУИД() Экспорт
    УИД = СтрЗаменить("m"+Сред(""+Новый УникальныйИдентификатор, 2), "-", "");
    Возврат УИД;
КонецФункции

Функция   РеквизитЕсть(Объект, ИмяРеквизита) Экспорт 
    Если Объект = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли; 
    ПустоеЗначение = "ca7a403c-94f3-4b24-b250-a75ce1a78427_7ad647ce-5ea1-427a-8121-6d04d254979f";
    Стр = Новый Структура(ИмяРеквизита, ПустоеЗначение);
    Попытка
    	ЗаполнитьЗначенияСвойств(Стр, Объект);
    Исключение
        ТекстОшибки = ОписаниеОшибки();
        Возврат Ложь;
    КонецПопытки; 
    
    Возврат Стр[ИмяРеквизита] <> ПустоеЗначение;
КонецФункции

Функция   Разделить(Делимое, Делитель, РезультатЕслиДелитель0 = 0) Экспорт
	Если Делитель = 0 Тогда
    	Возврат РезультатЕслиДелитель0;
    Иначе
        Возврат Делимое / Делитель;
    КонецЕсли; 
КонецФункции

Функция   ЧислоПрописьюБезДробных(Число) Экспорт
    Возврат СокрЛП(ЧислоПрописью(Число,,",,,м,,,,ж,0"));
КонецФункции

Функция   ВСписке(ЗначениеСписка
    , ЭлементСписка1 = "m86ecf82c2c1432c862a171cfebe64ad"
    , ЭлементСписка2 = "m86ecf82c2c1432c862a171cfebe64ad"
    , ЭлементСписка3 = "m86ecf82c2c1432c862a171cfebe64ad"
    , ЭлементСписка4 = "m86ecf82c2c1432c862a171cfebe64ad"
    , ЭлементСписка5 = "m86ecf82c2c1432c862a171cfebe64ad"
    , ЭлементСписка6 = "m86ecf82c2c1432c862a171cfebe64ad"
    , ЭлементСписка7 = "m86ecf82c2c1432c862a171cfebe64ad"
    , ЭлементСписка8 = "m86ecf82c2c1432c862a171cfebe64ad"
    , ЭлементСписка9 = "m86ecf82c2c1432c862a171cfebe64ad"
    ) Экспорт
    
    Массив = Новый Массив;
    Пустое = "m86ecf82c2c1432c862a171cfebe64ad";
    Если ЭлементСписка1 <> Пустое Тогда Массив.Добавить(ЭлементСписка1); КонецЕсли; 
    Если ЭлементСписка2 <> Пустое Тогда Массив.Добавить(ЭлементСписка2); КонецЕсли; 
    Если ЭлементСписка3 <> Пустое Тогда Массив.Добавить(ЭлементСписка3); КонецЕсли; 
    Если ЭлементСписка4 <> Пустое Тогда Массив.Добавить(ЭлементСписка4); КонецЕсли; 
    Если ЭлементСписка5 <> Пустое Тогда Массив.Добавить(ЭлементСписка5); КонецЕсли; 
    Если ЭлементСписка6 <> Пустое Тогда Массив.Добавить(ЭлементСписка6); КонецЕсли; 
    Если ЭлементСписка7 <> Пустое Тогда Массив.Добавить(ЭлементСписка7); КонецЕсли; 
    Если ЭлементСписка8 <> Пустое Тогда Массив.Добавить(ЭлементСписка8); КонецЕсли; 
    Если ЭлементСписка9 <> Пустое Тогда Массив.Добавить(ЭлементСписка9); КонецЕсли; 
	Результат = Массив.Найти(ЗначениеСписка) <> Неопределено;
    Возврат Результат;
КонецФункции

Процедура СообщениеОбОшибке(ТекстСообщения, Отказ = Ложь) Экспорт
    ИА_БФС.РегистрацияСообщений_Зафиксировать(ТекстСообщения); // 13.07.2016  
    
	Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = ТекстСообщения;
    Сообщение.Сообщить(); 
    Отказ  = Истина;
КонецПроцедуры

Процедура СообщениеПользователю(ТекстСообщения) Экспорт
    ИА_БФС.РегистрацияСообщений_Зафиксировать(ТекстСообщения); // 13.07.2016  
    
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = ТекстСообщения;
    Сообщение.Сообщить(); 
    Отказ  = Истина;
КонецПроцедуры

////#КонецОбласти

//_____________________________________________________________
////#Область Строковые_процедуры

Процедура Стр_ЗаменаТекстаПоМаркеру(Текст, Маркер, ТекстДоб, СимволОтступов = " ") Экспорт
    Текст = СтрЗаменить(Текст, Маркер, Маркер + СимволОтступов + ТекстДоб + СимволОтступов);
КонецПроцедуры

Функция   Стр_ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	ИспользоватьАльтернативныйАлгоритм = 
		Найти(Параметр1, "%")
		Или Найти(Параметр2, "%")
		Или Найти(Параметр3, "%")
		Или Найти(Параметр4, "%")
		Или Найти(Параметр5, "%")
		Или Найти(Параметр6, "%")
		Или Найти(Параметр7, "%")
		Или Найти(Параметр8, "%")
		Или Найти(Параметр9, "%");
		
	Если ИспользоватьАльтернативныйАлгоритм Тогда
		СтрокаПодстановки = ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(СтрокаПодстановки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	Иначе
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%2", Параметр2);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%3", Параметр3);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%4", Параметр4);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%5", Параметр5);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%6", Параметр6);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%7", Параметр7);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%8", Параметр8);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%9", Параметр9);
	КонецЕсли;
	
	Возврат СтрокаПодстановки;
КонецФункции

Функция   ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = "";
	Позиция = Найти(СтрокаПодстановки, "%");
	Пока Позиция > 0 Цикл 
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		ПодставляемыйПараметр = "";
		Если СимволПослеПроцента = "1" Тогда
			ПодставляемыйПараметр =  Параметр1;
		ИначеЕсли СимволПослеПроцента = "2" Тогда
			ПодставляемыйПараметр =  Параметр2;
		ИначеЕсли СимволПослеПроцента = "3" Тогда
			ПодставляемыйПараметр =  Параметр3;
		ИначеЕсли СимволПослеПроцента = "4" Тогда
			ПодставляемыйПараметр =  Параметр4;
		ИначеЕсли СимволПослеПроцента = "5" Тогда
			ПодставляемыйПараметр =  Параметр5;
		ИначеЕсли СимволПослеПроцента = "6" Тогда
			ПодставляемыйПараметр =  Параметр6;
		ИначеЕсли СимволПослеПроцента = "7" Тогда
			ПодставляемыйПараметр =  Параметр7
		ИначеЕсли СимволПослеПроцента = "8" Тогда
			ПодставляемыйПараметр =  Параметр8;
		ИначеЕсли СимволПослеПроцента = "9" Тогда
			ПодставляемыйПараметр =  Параметр9;
		КонецЕсли;
		Если ПодставляемыйПараметр = "" Тогда
			Результат = Результат + "%";
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 2);
		КонецЕсли;
		Позиция = Найти(СтрокаПодстановки, "%");
	КонецЦикла;
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;
КонецФункции

Функция   Строка2Массив(СтрокаДляРазбора, Разделитель = ";", ЭкранирующаяСтрока = "", УдалятьЭкранирующуюСтроку = Истина, ДополнитьДоКоличестваЭлементов = 0) Экспорт
	Результат = Новый Массив;
    
  	НуженСложныйАлгоритм = ЭкранирующаяСтрока <> "" И Найти(СтрокаДляРазбора, ЭкранирующаяСтрока) > 0;
    
    Если НЕ НуженСложныйАлгоритм Тогда
        ЗаменаПС = "m29bb1ad091a4c4dac257cc1b0f7b780";
        
        ТребуетсяЗаменаПС = Найти(СтрокаДляРазбора, Символы.ПС) > 0 И Разделитель <> Символы.ПС;
        Если ТребуетсяЗаменаПС Тогда
        	Стр = СтрЗаменить(СтрокаДляРазбора, Символы.ПС, ЗаменаПС);
        Иначе
            Стр = СтрокаДляРазбора;
        КонецЕсли; 
        
        Стр = СтрЗаменить(Стр, Разделитель, Символы.ПС);
        
        ВсегоСтрок = СтрЧислоВхождений(Стр, Символы.ПС) + 1;
        Для Счетчик = 1 По ВсегоСтрок Цикл
            Блок = СтрПолучитьСтроку(Стр, Счетчик);
            Если ТребуетсяЗаменаПС Тогда
            	Блок = СтрЗаменить(Блок, ЗаменаПС, Символы.ПС);
            КонецЕсли; 
        	Результат.Добавить(Блок);
        КонецЦикла; 
    Иначе
        ЗаменаРазделитель       = "m265936c7e2b4830a9a6b58137882a30";
        ЗаменаЭкрРазделитель    = "mc85628d1d6b467ab7c71b3c42f86170";
        ДлинаРазделителя        = СтрДлина(Разделитель);
        ДлинаЭкранирующейСтроки = СтрДлина(ЭкранирующаяСтрока);
        
        ВремСтрока = СтрокаДляРазбора;
        ПозицияРазделителя = Найти(ВремСтрока, Разделитель);
        Пока ПозицияРазделителя > 0 Цикл
            СтрокаДоРазделителя    = Лев(ВремСтрока, ПозицияРазделителя - 1);
            СтрокаПослеРазделителя = Сред(ВремСтрока, ПозицияРазделителя  + ДлинаРазделителя);
            
            ВхожденийДо = СтрЧислоВхождений(СтрокаДоРазделителя, ЭкранирующаяСтрока);
            
            Если ВхожденийДо % 2 = 0 Тогда // Это реальный разделитель
                ВремСтрока = СтрокаДоРазделителя + ЗаменаРазделитель + СтрокаПослеРазделителя;
            Иначе
            	ВремСтрока = СтрокаДоРазделителя + ЗаменаЭкрРазделитель + СтрокаПослеРазделителя;
            КонецЕсли; 
            
            ПозицияРазделителя = Найти(ВремСтрока, Разделитель);
        КонецЦикла; 
        
        М = Строка2Массив(ВремСтрока, ЗаменаРазделитель, "");
        Для каждого Эл Из М Цикл
        	Эл = СтрЗаменить(Эл, ЗаменаЭкрРазделитель, Разделитель);
            Если УдалятьЭкранирующуюСтроку Тогда
            	Если Лев(Эл, ДлинаЭкранирующейСтроки) = ЭкранирующаяСтрока Тогда
                    Эл = Сред(Эл, ДлинаЭкранирующейСтроки + 1);	
                КонецЕсли; 
            	Если Прав(Эл, ДлинаЭкранирующейСтроки) = ЭкранирующаяСтрока Тогда
                    Эл = Сред(Эл, 1, СтрДлина(Эл) - ДлинаЭкранирующейСтроки);
                КонецЕсли; 
            КонецЕсли; 
            Результат.Добавить(Эл);
        КонецЦикла; 
    КонецЕсли; 
    ТекущееКоличество = Результат.Количество();
    Для Ц = ТекущееКоличество По ДополнитьДоКоличестваЭлементов - 1 Цикл
    	Результат.Добавить("");
    КонецЦикла; 
    Возврат Результат;
КонецФункции
 

////#КонецОбласти 

//_____________________________________________________________
////#Область Дата

Функция Дата_ИзвлечьВремя(Дата) Экспорт
    Возврат '00010101'+(Дата - НачалоДня(Дата))		
КонецФункции

////#КонецОбласти

//_____________________________________________________________
////#Область Структуры

Функция   Струк_НайтиПоЗначению (Структура, Значение) Экспорт
    Для каждого КиЗ Из Структура Цикл
        Если КиЗ.Значение = Значение Тогда
            Возврат КиЗ.Ключ;
        КонецЕсли; 
    КонецЦикла; 
    Возврат Неопределено;
КонецФункции 

// Формирует текстовое представление структуры в формате: <Ключ1> = <Значение1>; <Ключ...> = <Значение...>; <КлючN> = <ЗначениеN>
// Параметры:
// Структура - Структура - Структура, строквое представление которой требуется получить
// ПорядокСледования - Строка - Желаемая последовательность ключей. Остальные ключи выведутся в системном порядке
// Исключенные - Строка - Ключи структуры, которые выводить не следует
// ВыражениеЕслиПусто - Строка - по-умолчанию "<пусто>" - что выводить для незаполненных ключей
Функция   Струк_Представление   (Структура, ПорядокСледования = "", Исключенные = "", ВыражениеЕслиПусто="<пусто>") Экспорт
    Результат = "";
    Стр = СтрЗаменить("," + ПорядокСледования + ",", ",", Символы.ПС);
    СписокКлючей = Новый Массив;
    ИсключенныеКлючи = Новый Структура(Исключенные);    
    
    Для Ц = 1 По СтрЧислоВхождений(Стр, Символы.ПС) Цикл
        ПодСтрока = СокрЛП(СтрПолучитьСтроку(Стр, Ц));
        Если ЗначениеЗаполнено(ПодСтрока) И СписокКлючей.Найти(ПодСтрока) = Неопределено Тогда
            СписокКлючей.Добавить(ПодСтрока);
        КонецЕсли; 
    КонецЦикла; 
    
    УжеВыведены = Новый Структура;
    
    Для каждого Ключ Из СписокКлючей Цикл
        Если Структура.Свойство(Ключ) И НЕ ИсключенныеКлючи.Свойство(Ключ) Тогда
            Значение = Структура[Ключ];
            Если НЕ ЗначениеЗаполнено(Значение) Тогда
                Значение = ВыражениеЕслиПусто;
            КонецЕсли; 
            Результат = Результат + "; " + Ключ + " = " + Значение;
            УжеВыведены.Вставить(Ключ);
        КонецЕсли; 
    КонецЦикла; 
    
    Для каждого КиЗ Из Структура Цикл
        Если НЕ УжеВыведены.Свойство(КиЗ.Ключ) И НЕ ИсключенныеКлючи.Свойство(КиЗ.Ключ) Тогда
            Значение = КиЗ.Значение;
            Попытка
                Если НЕ ЗначениеЗаполнено(Значение) Тогда
                    Значение = ВыражениеЕслиПусто;
                КонецЕсли; 
            Исключение
                Ошибка = ОписаниеОшибки();
                Значение = "" + Значение;
            КонецПопытки; 
            Результат = Результат + "; " + КиЗ.Ключ + " = " + Значение;
            
            УжеВыведены.Вставить(КиЗ.Ключ);
        КонецЕсли; 
    КонецЦикла; 
    
    Результат = Сред(Результат, 3);
    
    Возврат Результат;
КонецФункции

Функция   Струк_Ключи           (Структура) Экспорт
    Результат = "";
	Для каждого КиЗ Из Структура Цикл
        Результат = Результат + "," + КиЗ.Ключ;
    КонецЦикла; 
    Результат = Сред(Результат, 2);
    Возврат Результат;
КонецФункции
 
Функция   Струк_Равны(Структура1, Структура2) Экспорт
	Если Структура1.Количество() <> Структура2.Количество() Тогда
    	Возврат Ложь;
    КонецЕсли; 
    
    Для каждого КиЗ Из Структура1 Цикл
    	ПервоеЗначение = КиЗ.Значение;
        ВтороеЗначение = Неопределено;
        Если НЕ Структура2.Свойство(КиЗ.Ключ, ВтороеЗначение) Тогда
        	Возврат Ложь;
        КонецЕсли; 
        
        Если ПервоеЗначение <> ВтороеЗначение Тогда
        	Возврат Ложь;
        КонецЕсли; 
    КонецЦикла; 
    
    Возврат Истина;
КонецФункции

Функция   Струк_Новый(ИменаКолонок, ИсточникЗаполнения = Неопределено) Экспорт
	Результат = Новый Структура(ИменаКолонок);
    Если ИсточникЗаполнения <> Неопределено Тогда
    	ЗаполнитьЗначенияСвойств(Результат, ИсточникЗаполнения);
    КонецЕсли; 
    Возврат Результат;
КонецФункции

Функция   Струк_Объединить(Структура1, Структура2) Экспорт
    Результат = Новый Структура;
	Для каждого КиЗ Из Структура1 Цикл
    	Результат.Вставить(КиЗ.Ключ, КиЗ.Значение);
    КонецЦикла;  
	Для каждого КиЗ Из Структура2 Цикл
    	Результат.Вставить(КиЗ.Ключ, КиЗ.Значение);
    КонецЦикла;  
    
    Возврат Результат;
КонецФункции
 
////#КонецОбласти 

//_____________________________________________________________
////#Область Преобразование_типов

Функция   Массив2СписокЗначений(Источник) Экспорт
    Результат = Новый СписокЗначений;
    Для каждого Эл Из Источник Цикл
        Результат.Добавить(Эл);
    КонецЦикла; 
    Возврат Результат;
КонецФункции

Функция   СписокЗначений2Массив(Источник) Экспорт
    Результат = Источник.ВыгрузитьЗначения();
    Возврат Результат;
КонецФункции    

////#КонецОбласти


//_____________________________________________________________
////#Область Массивы
	
Функция   Массив_ПолучитьУникальныеЭлементы(Массив) Экспорт
    Результат = Новый Массив;
    Для каждого Эл Из Массив Цикл
        Если Результат.Найти(Эл) = Неопределено Тогда
            Результат.Добавить(Эл);
        КонецЕсли; 
    КонецЦикла; 
    Возврат Результат;
КонецФункции

Процедура Массив_ДобавитьЕслиНет(Массив, Элемент) Экспорт
    Если Массив.Найти(Элемент) = Неопределено Тогда
        Массив.Добавить(Элемент)
    КонецЕсли; 
КонецПроцедуры

Процедура Массив_УдалитьЕслиЕсть(Массив, Элемент) Экспорт
    Индекс = Массив.Найти(Элемент);
    Если Индекс <> Неопределено Тогда
        Массив.Удалить(Индекс);
        Массив_УдалитьЕслиЕсть(Массив, Элемент);
    КонецЕсли; 
КонецПроцедуры

Процедура Массив_УдалитьПоУсловию(Массив, Условие, Контекст = Неопределено) Экспорт
    Ц = 0;
    Пока Ц < Массив.Количество() Цикл
        Эл = Массив[Ц];
        Удалять = Вычислить(Условие);
        Если Удалять Тогда
            Массив.Удалить(Ц);
        Иначе
            Ц = Ц + 1;
        КонецЕсли; 
    КонецЦикла; 
КонецПроцедуры

Функция   Массив_ФильтрПоУсловию(Массив, Условие, Контекст = Неопределено) Экспорт
    Результат = Новый Массив;
    Для каждого Эл Из Массив Цикл
        Результат.Добавить(Эл);
    КонецЦикла;
    Массив_УдалитьПоУсловию(Результат, "НЕ (" + Условие + ")", Контекст);
    Возврат Результат;
КонецФункции

Функция   Массив_Новый(Эл1 = Неопределено
    , Эл2  = Неопределено
    , Эл3  = Неопределено
    , Эл4  = Неопределено
    , Эл5  = Неопределено
    , Эл6  = Неопределено
    , Эл7  = Неопределено
    , Эл8  = Неопределено
    , Эл9  = Неопределено
    , Эл10 = Неопределено) Экспорт 
    
    Результат = Новый Массив;
    
    Если Эл1  <> Неопределено Тогда Результат.Добавить(Эл1)  КонецЕсли;
    Если Эл2  <> Неопределено Тогда Результат.Добавить(Эл2)  КонецЕсли;
    Если Эл3  <> Неопределено Тогда Результат.Добавить(Эл3)  КонецЕсли;
    Если Эл4  <> Неопределено Тогда Результат.Добавить(Эл4)  КонецЕсли;
    Если Эл5  <> Неопределено Тогда Результат.Добавить(Эл5)  КонецЕсли;
    Если Эл6  <> Неопределено Тогда Результат.Добавить(Эл6)  КонецЕсли;
    Если Эл7  <> Неопределено Тогда Результат.Добавить(Эл7)  КонецЕсли;
    Если Эл8  <> Неопределено Тогда Результат.Добавить(Эл8)  КонецЕсли;
    Если Эл9  <> Неопределено Тогда Результат.Добавить(Эл9)  КонецЕсли;
    Если Эл10 <> Неопределено Тогда Результат.Добавить(Эл10) КонецЕсли;
    
    Возврат Результат;
КонецФункции

Функция   Массив_Представление(Массив, ТолькоУникальные = Ложь, Разделитель = "; ") Экспорт
	Результат = "";
    
    Если ТолькоУникальные Тогда
        МассивДляВывода = Массив_ПолучитьУникальныеЭлементы(Массив);
    Иначе
        МассивДляВывода = Массив;
    КонецЕсли; 
    
    
    Для каждого Эл Из МассивДляВывода Цикл
    	Результат = Результат + Разделитель + Эл;
    КонецЦикла; 
    
    Результат = Сред(Результат, СтрДлина(Разделитель) + 1);
    
    Возврат Результат;
КонецФункции

Функция   Массив_Сложить(Массив1, Массив2, ТолькоУникальные = Ложь) Экспорт
	Результат = Новый Массив;
    
    Если ТолькоУникальные Тогда
        Для каждого Эл Из Массив1 Цикл
            Если Результат.Найти(Эл) = Неопределено Тогда
            	Результат.Добавить(Эл);
            КонецЕсли; 
        КонецЦикла; 
        
        Для каждого Эл Из Массив2 Цикл
            Если Результат.Найти(Эл) = Неопределено Тогда
            	Результат.Добавить(Эл);
            КонецЕсли; 
        КонецЦикла; 
    Иначе
        Для каждого Эл Из Массив1 Цикл
            Результат.Добавить(Эл);
        КонецЦикла; 
        Для каждого Эл Из Массив2 Цикл
            Результат.Добавить(Эл);
        КонецЦикла; 
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции
 
Функция   Массив_Содержит(Массив, Элемент) Экспорт
	Возврат Массив.Найти(Элемент) <> Неопределено;
КонецФункции

Функция   Массив2Строка(Массив, ТолькоУникальные = Ложь, Разделитель = "; ") Экспорт
    Возврат Массив_Представление(Массив, ТолькоУникальные, Разделитель);
КонецФункции
 

////#КонецОбласти 


//_____________________________________________________________
////#Область СписокЗначений

Функция   СЗ_ПолучитьУникальные(СписокЗначений, УдалитьНеЗаполненные = Ложь) Экспорт
    Результат = Новый СписокЗначений;
    Для каждого Эл Из СписокЗначений Цикл
        Если Результат.НайтиПоЗначению(Эл.Значение) = Неопределено Тогда
            Если УдалитьНеЗаполненные Тогда
                Если ЗначениеЗаполнено(Эл.Значение) Тогда
                	Результат.Добавить(Эл.Значение);
                КонецЕсли; 
            Иначе
                Результат.Добавить(Эл.Значение);
            КонецЕсли; 
        	
        КонецЕсли; 
    КонецЦикла;  
    Возврат Результат;
КонецФункции

////#КонецОбласти 

//_____________________________________________________________
////#Область Таблицы_значений_фиктивные

Функция   ТЗФ_ФильтрПоУсловию(ТЗФ, Условие, Контекст) Экспорт
    Результат = Новый Массив;
    Для каждого СтрокаТЗ Из ТЗФ Цикл
        Добавлять = Вычислить(Условие);
        Если Добавлять Тогда
            Результат.Добавить(СтрокаТЗ);
        КонецЕсли;
    КонецЦикла; 
    
    Возврат Результат;
КонецФункции

Функция   ТЗФ_ВывестиВТабДок(ТЗФ) Экспорт
    ТабДок = ИА_БФС.ТЗФ_ВывестиВТабДок(ТЗФ);
    Возврат ТабДок;
КонецФункции
 
////#КонецОбласти

//_____________________________________________________________
////#Область РаботаСФайлами

Функция   Файл_Существует(Имя) Экспорт
    Ф = Новый Файл(Имя);
    Возврат Ф.Существует();
КонецФункции

Функция   Файл_ВремяИзменения(Имя) Экспорт
    Ф = Новый Файл(Имя);
    Возврат Ф.ПолучитьВремяИзменения();
КонецФункции

Функция   Файл_Новый(Имя) Экспорт
    Возврат Новый Файл(Имя);
КонецФункции

Функция   Файл_Имя(Имя) Экспорт
    Ф = Новый Файл(Имя);
    Возврат Ф.Имя;
КонецФункции

Функция   Файл_Расширение(Имя) Экспорт
    Ф = Новый Файл(Имя);
    Возврат Ф.Расширение;
КонецФункции

Функция   Файл_Путь(Имя) Экспорт
    Ф = Новый Файл(Имя);
    Возврат Ф.Путь;
КонецФункции

Функция   Файл_ВыбратьФайл(ИмяФайла, Режим = Неопределено, Фильтр = "*.*|*.*", СтандартнаяОбработка = Ложь) Экспорт
    #Если Клиент Тогда
        СтандартнаяОбработка = Ложь;
        Если Режим = Неопределено Тогда
            Режим = РежимДиалогаВыбораФайла.Открытие;
        КонецЕсли; 
        ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
        ДиалогОткрытияФайла.ПолноеИмяФайла = ИмяФайла;
        ДиалогОткрытияФайла.Фильтр = Фильтр;
        ДиалогОткрытияФайла.Заголовок = "Выберите файл:";
        Если ДиалогОткрытияФайла.Выбрать() Тогда
            ИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
            Возврат Истина;
        Иначе
            Возврат Ложь;
        КонецЕсли;
    #Иначе
        Возврат Ложь;
    #КонецЕсли 
КонецФункции

////#КонецОбласти 



Процедура ТабДок_ВывестиОбласть(ТабДок, Макет, ИмяОбласти, Контекст = Неопределено, Уровень = Неопределено) Экспорт
    // Функция ошибочно помещена в этот модуль, перенесена в ИА_БФС. Оставлена для обратной совместимости
    ИА_БФС.ТабДок_ВывестиОбласть(ТабДок, Макет, ИмяОбласти, Контекст, Уровень);
КонецПроцедуры

Процедура ТабДок_Показать(ТабДок, Заголовок = "Таблица", ИмяФайла = "") Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ТабДок = Новый ТабличныйДокумент;
    #КОНЕЦЕСЛИ
    
    ТабДок.ОтображатьСетку     = Ложь;
    ТабДок.ОтображатьЗаголовки = Ложь;
    ТабДок.ТолькоПросмотр      = Истина;
    
    ТабДок.Показать(Заголовок, ИмяФайла);
КонецПроцедуры


////#Область ОписаниеТипов

Функция   ОТ_Число(ЧислоРазрядов = 15, ЧислоРазрядовДробнойЧасти = 2, ТолькоНеОтрицательные = Ложь) Экспорт
    Знак = ?(ТолькоНеОтрицательные, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой);
    Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ЧислоРазрядов, ЧислоРазрядовДробнойЧасти, Знак));
КонецФункции

Функция   ОТ_Строка(ДлинаСтроки = 0, ДопустимаяДлинаФиксирована = Ложь) Экспорт
    Возврат Новый ОписаниеТипов("Строка",,
    Новый КвалификаторыСтроки(ДлинаСтроки, ?(ДопустимаяДлинаФиксирована
    , ДопустимаяДлина.Фиксированная, ДопустимаяДлина.Переменная)));
КонецФункции

Функция   ОТ_Дата(ВариантЧастиДаты = Неопределено) Экспорт
    Если ВариантЧастиДаты = Неопределено Тогда
        ВариантЧастиДаты = ЧастиДаты.ДатаВремя;
    КонецЕсли; 
    Возврат Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ВариантЧастиДаты));
КонецФункции

Функция   ОТ_Булево() Экспорт
    Возврат Новый ОписаниеТипов("Булево");
КонецФункции

Функция   ОТ_Тип(Типы) Экспорт
    Возврат Новый ОписаниеТипов(Типы);
КонецФункции

////#КонецОбласти 


////#Область Excel

Функция   Excel_ЗагрузитьФайлВТЗФ(ИмяФайла, НомерЛиста = 1, ЗадатьТипСтрока = Ложь, ИспользоватьФайлКэша = Ложь, НомерСтрокиНачала = 2) Экспорт
    Результат = Новый Структура("Таб, Загружено, СообщениеОбОшибке, ЗагруженоИзКэша"
    , Новый Массив, Ложь, "", Ложь);
    
    Если НЕ Файл_Существует(ИмяФайла) Тогда
        Результат.СообщениеОбОшибке = "Файл """ + ИмяФайла + """ не найден!";
        Возврат Результат;
    КонецЕсли; 
    
    Таб = Новый Массив;
    
    СтруктураКолонок = Новый Структура;
    
    ИмяФайлаКэш = ИмяФайла
    + "_" + Формат(НомерЛиста, "ЧГ=")
    + "_" + Формат(НомерСтрокиНачала, "ЧГ=")
    + "_" + ?(ЗадатьТипСтрока, "S", "N")+ ".1tv";
    
    Если ИспользоватьФайлКэша Тогда
        Если Файл_Существует(ИмяФайлаКэш) Тогда
            ВремяИсходного = Файл_ВремяИзменения(ИмяФайла);
            ВремяКэш       = Файл_ВремяИзменения(ИмяФайлаКэш);
            Если ВремяИсходного <= ВремяКэш Тогда
                Результат.ЗагруженоИзКэша = Истина;
                Результат.Загружено = Истина;
                
                ДД = Новый ДвоичныеДанные(ИмяФайлаКэш);
                Результат.Таб = ИА_БФС.ДвоичныеДанные2Значение(ДД);
                ДД = Неопределено;
                
                Возврат Результат;
            КонецЕсли; 
        КонецЕсли; 
    КонецЕсли; 
    
    //подключаемся к эксел
    Попытка
        Excel = Новый COMОбъект("Excel.Application");
        Excel.WorkBooks.Open(ИмяФайла);
        #Если Клиент Тогда
            Состояние("Открытие файла Microsoft Excel...");      	
        #КонецЕсли 
    Исключение
        Результат.СообщениеОбОшибке = "Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена! Ошибка: "+ ОписаниеОшибки();
        Возврат Результат;
    КонецПопытки;
    
    мСтароеЗначениеDisplayAlerts = Excel.DisplayAlerts;
	Excel.DisplayAlerts = Ложь;
    
    Попытка 
        //Открываем необходимый лист
        ЛистЭксель = Excel.Sheets(НомерЛиста);
        ЛистЭксель.Select();
    Исключение
        //Закрываем Excel
        Excel.ActiveWorkbook.Close(); 	
        Excel = 0;
        ЛистЭксель = 0;
        Результат.СообщениеОбОшибке = "Файл "+Строка(ИмяФайла)+" не соответствует необходимому формату! Лист №"
        + НомерЛиста + "не найден! Ошибка: "+ ОписаниеОшибки();
        Возврат Результат;
    КонецПопытки;	
    
    //Получим количество строк и колонок.
    Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
    Если Версия = "8" тогда
        ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
        ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
    Иначе
        Попытка
            ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
            ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
        Исключение
            ТекстОшибки = ОписаниеОшибки();
            ФайлСтрок   = ЛистЭксель.UsedRange.Row + ЛистЭксель.UsedRange.Rows.Count - 1;
            ФайлКолонок = ЛистЭксель.UsedRange.Column + ЛистЭксель.UsedRange.Columns.Count - 1;
        КонецПопытки; 
    Конецесли;
    
    отСтрока = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1023));
    //Для Ц = 1 По ФайлКолонок Цикл
    //    Имя = "К"+Формат(Ц,"ЧГ=");
    //    СтруктураКолонок.Вставить(Имя);
    //КонецЦикла; 	
    //ИменаКлючей = Струк_Ключи(СтруктураКолонок); 
    
    //_____________________________________________________________
    ЛистЭксель = Excel.Sheets(НомерЛиста);
    
    МассивИменКолонок = Новый Массив;
    Для Ц = 1 По ФайлКолонок Цикл
        Имя = "К"+Формат(Ц,"ЧГ=");
        МассивИменКолонок.Добавить(Имя);
    КонецЦикла; 	
    
    #Если Клиент Тогда
        Состояние("Выгрузка файла ...");      	
    #КонецЕсли 
    Область = ЛистЭксель.Range(ЛистЭксель.Cells(НомерСтрокиНачала,1), ЛистЭксель.Cells(ФайлСтрок,ФайлКолонок));
    Данные = Область.Value.Выгрузить();
    
    МассивПервойКолонки = Данные[0];
    #Если Клиент Тогда
        Состояние("Обработка данных...");      	
    #КонецЕсли 
    
    СчетчикОбновления = 0;
    Колво = МассивПервойКолонки.Количество() - 1;
    Для НомерСтроки = 0 По Колво Цикл
        Стр = Новый Структура;
        #Если Клиент Тогда
            СчетчикОбновления = СчетчикОбновления  + 1;
            Если СчетчикОбновления > 100 Тогда
                СчетчикОбновления = 0;
                Состояние("Обработка данных: " + Окр(100 * НомерСтроки / Колво,2)+ " %");
            КонецЕсли; 
            
            ОбработкаПрерыванияПользователя(); //указав данный оператор, цикл можно прервать в любой момент нажатие ctrl+break
        #КонецЕсли 
        
        Для Счетчик = 0 По ФайлКолонок - 1 Цикл
            //Имя = "К"+Формат(Счетчик, "ЧГ=");
            Имя = МассивИменКолонок[Счетчик];
            Значение = Данные[Счетчик][НомерСтроки];
            Если ЗадатьТипСтрока Тогда
            	Значение = отСтрока.ПривестиЗначение(Значение);
            КонецЕсли; 
            Стр.Вставить(Имя, Значение);
        КонецЦикла;    
        
        Таб.Добавить(Стр);
    КонецЦикла; 
    ЛистЭксель = Неопределено;
    
    //_____________________________________________________________
    // 2015_05_05_10_34 Заменено на более быстрый алгоритм
    ////
    ////СчетчикОбновления = 0;
    ////Для НС = НомерСтрокиНачала по ФайлСтрок Цикл  // НС указываем с какой строки начинать обработку        
    ////    #Если Клиент Тогда
    ////        СчетчикОбновления = СчетчикОбновления  + 1;
    ////        Если СчетчикОбновления > 10 Тогда
    ////            СчетчикОбновления = 0;
    ////            Состояние("Загрузка: "+Строка(Формат(?(ФайлСтрок=0,0,((100*НС)/ФайлСтрок)),"ЧДЦ=2"))+" %");
    ////        КонецЕсли; 
    ////        
    ////        ОбработкаПрерыванияПользователя(); //указав данный оператор, цикл можно прервать в любой момент нажатие ctrl+break
    ////    #КонецЕсли 
    ////    
    ////    НоваяСтрока = Новый Структура(ИменаКлючей);
    ////    Для НомерКолонки = 1 по ФайлКолонок Цикл 
    ////        //заполняем строку значениями
    ////        ТекущееЗначение = Excel.Cells(НС, НомерКолонки).Text;
    ////        ИмяКолонки = "К"+Формат(НомерКолонки,"ЧГ=");
    ////        Если ЗадатьТипСтрока Тогда
    ////            ТекущееЗначение = отСтрока.ПривестиЗначение(ТекущееЗначение);
    ////        КонецЕсли; 
    ////        
    ////        НоваяСтрока.Вставить(ИмяКолонки, ТекущееЗначение);
    ////    КонецЦикла;
    ////    Таб.Добавить(НоваяСтрока);
    ////КонецЦикла;   
    
    Excel.ActiveWorkbook.Close();
   	Excel.DisplayAlerts = мСтароеЗначениеDisplayAlerts;

    Результат.Таб = Таб;
    Результат.Загружено = Истина;
    
    Если ИспользоватьФайлКэша Тогда
        Попытка
            //ЗначениеВФайл(ИмяФайлаКэш, Результат.Таб);
            ДД = ИА_БФС.Значение2ДвоичныеДанные(Таб);
            ДД.Записать(ИмяФайлаКэш);
        Исключение
            Ошибка = ОписаниеОшибки();
        КонецПопытки; 
    КонецЕсли;        
    #Если Клиент Тогда
        Состояние("Загрузка файла выполнена");
    #КонецЕсли 
    
    Возврат Результат;
КонецФункции

////#КонецОбласти 


////#Область РедакторФормул
Функция РедакторФормул_СформироватьПустуюФормулу() Экспорт
    ДЗФ = Новый Структура("Колонки, Строки", Новый Структура, Новый Массив);
    
    ДанныеФормулы = Новый Структура("Вид, Переменные, СоставФормулы, ПредставлениеФормулы, ОбработкаПроверкиФормулы"
    , ПредопределенноеЗначение("Перечисление.ИА_БФФормулыТип.ПустаяСсылка")
    , ДЗФ, Новый Массив, "", "");
    // 1 - Строка
    // 2 - Число
    
    Возврат ДанныеФормулы;
КонецФункции    
    
Функция РедакторФормул_ВыбраноЗначение(ВыбранноеЗначение) Экспорт
    Результат = ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
    И ВыбранноеЗначение.Свойство("Вид")
    И ВыбранноеЗначение.Вид = "РедакторФормул";
    Возврат Результат;
КонецФункции

Функция РедакторФормул_ИзВыбЗначенияПолучитьДанныеФормулы(ВыбранноеЗначение) Экспорт
    
    Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
        И ВыбранноеЗначение.Свойство("Вид")
        И ВыбранноеЗначение.Вид = "РедакторФормул" Тогда
        Результат = ВыбранноеЗначение.ДанныеФормулы;
    Иначе
        Результат = РедакторФормул_СформироватьПустуюФормулу();
    КонецЕсли;
    
    Возврат Результат;	
КонецФункции


////#КонецОбласти 

////#Область Теги

Функция Теги_СформироватьЗаголовокОтбора(ОтборТеги, Условие_ИЛИ) Экспорт
    Если ОтборТеги.Количество() = 0 Тогда
        Результат = "Теги...";
    Иначе
        Результат = "Теги: " + Массив_Представление(ОтборТеги.ВыгрузитьЗначения());
    КонецЕсли; 
    Возврат Результат;
КонецФункции

////#КонецОбласти 


////#Область ОС

Функция   ОС_ЗначениеПеременой(ИмяПеременной, ДобавитьПроценты = Истина) Экспорт
    Объект_WSShell = Новый COMОбъект("WScript.Shell");
    Если ДобавитьПроценты Тогда
    	Текст = "%" + ИмяПеременной + "%"
    Иначе
        Текст = ИмяПеременной;
    КонецЕсли; 
    
    Результат = Объект_WSShell.ExpandEnvironmentStrings(Текст);
    Возврат Результат;
КонецФункции


////#КонецОбласти 