&НаКлиенте
Процедура РасчетИтогов()
    ДоходыИтого = ТабВидыДоходов.Итог("СуммаБезнал");
КонецПроцедуры

&НаСервере
Функция ПроверкаНаСервере()
    ТабПараметров = ИА_БФС.ТЗ_НоваяТаблицаЗначений("Параметр, Значение");
	
    Для каждого Стр Из ТабВидыДоходов Цикл
        НовСтрока = ТабПараметров.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);	
        НовСтрока.Значение = Стр.СуммаНал + Стр.СуммаБезнал;
    КонецЦикла;  
    Для каждого Стр Из ЗапросыДанныхФондов Цикл
        НовСтрока = ТабПараметров.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);	
        НовСтрока.Значение = Стр.СуммаНал + Стр.СуммаБезнал;
    КонецЦикла;  
    
    ДеревоП1 = РеквизитФормыВЗначение("ДеревоПолитика1");
	п1Итого = 0;
    Для каждого СтрРаздел Из ДеревоП1.Строки Цикл
        Для каждого Стр Из СтрРаздел.Строки Цикл
            НовСтрока = ТабПараметров.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, Стр);	
            НовСтрока.Значение = Стр.СуммаБезнал;
			п1Итого = п1Итого + НовСтрока.Значение; 
		КонецЦикла;  
		
		// СКД
		Если СтрРаздел.параметр <> "" Тогда
			НовСтрока = ТабПараметров.Добавить();
	        ЗаполнитьЗначенияСвойств(НовСтрока, СтрРаздел);	
	        НовСтрока.Значение = СтрРаздел.СуммаБезнал;
		КонецЕсли;
	КонецЦикла;  
	
	НовСтрока = ТабПараметров.Добавить();
	НовСтрока.параметр = "[ВалПрибыль]";
	НовСтрока.Значение = ТабВидыДоходов.Итог("СуммаБезнал") - п1Итого;
	
	ДеревоП2 = РеквизитФормыВЗначение("ДеревоПолитика2");
    Для каждого СтрРаздел Из ДеревоП2.Строки Цикл
        Для каждого Стр Из СтрРаздел.Строки Цикл
            НовСтрока = ТабПараметров.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, Стр);	
            НовСтрока.Значение = Стр.СуммаНал + Стр.СуммаБезнал;
		КонецЦикла;  
		
		// СКД
		Если СтрРаздел.параметр <> "" Тогда
			НовСтрока = ТабПараметров.Добавить();
	        ЗаполнитьЗначенияСвойств(НовСтрока, СтрРаздел);	
	        НовСтрока.Значение = СтрРаздел.СуммаБезнал;
		КонецЕсли;
    КонецЦикла;
    
    НовСтрока = ТабПараметров.Добавить();
    НовСтрока.Параметр = "[ДоходыИтого]";
    НовСтрока.Значение = ТабВидыДоходов.Итог("СуммаНал") + ТабВидыДоходов.Итог("СуммаБезнал");
    
    
    Формула = ТекстФормулы;
    Для каждого Стр Из ТабПараметров Цикл
    	Формула = СтрЗаменить(Формула, Стр.Параметр, Формат(Стр.Значение, "ЧРД=.; ЧН=; ЧГ=") );
    КонецЦикла;  
    
    ПримерРасчета = Формула + " = ";
    
    
    
    Значение = 0;
    Попытка
    	Значение = Вычислить(Формула);
        Значение = Окр(Значение, 2);
        ПримерРасчета = ПримерРасчета + Значение;
        Результат =  Истина;
    Исключение
        ТекстОшибки = ОписаниеОшибки();
        ПримерРасчета = ПримерРасчета + Символы.ПС + "Ошибка вычисления: " + ТекстОшибки;
        
        Результат =  Ложь;
    КонецПопытки; 
    
    Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьРасчетныеДанные()
    Дата = ТекущаяДата();    
    
    ТабВидыДоходов.Очистить();
    ЗапросыДанныхФондов.Очистить();
	
	Запрос = Новый Запрос;
	
	Если параметры.ПараметрыФормулы.Свойство("Доходы") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Т.Ссылка КАК ВидДохода,
		               |	""[Доход:"" + Т.Наименование + ""]"" КАК Параметр
		               |ИЗ
		               |	Справочник.ИА_ВидыДоходов КАК Т
		               |ГДЕ
		               |	Т.Ссылка В (&Доходы)"; 
		Запрос.УстановитьПараметр("Доходы",параметры.ПараметрыФормулы.Доходы);
		Таб = Запрос.Выполнить().Выгрузить();
	    
	    Сумма = 100000;
	    Для каждого Стр Из Таб Цикл
	    	НовСтрока = ТабВидыДоходов.Добавить();
	        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
	        НовСтрока.СуммаБезнал = Сумма;
	        
	        Сумма = Сумма + 10000;
		КонецЦикла;  
	КонецЕсли;
    
    
    Запрос.Текст = "ВЫБРАТЬ
                   |	Т.Ссылка КАК Запрос,
                   |	""[Запрос:"" + Т.Наименование + ""]"" КАК Параметр
                   |ИЗ
                   |	Справочник.ИА_ЗапросыДанныхФондов КАК Т
                   |ГДЕ
                   |	НЕ Т.ПометкаУдаления";
    Таб = Запрос.Выполнить().Выгрузить();
    
    Сумма = 1500000;
    Для каждого Стр Из Таб Цикл
    	НовСтрока = ЗапросыДанныхФондов.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);   
        НовСтрока.СуммаБезнал = Сумма;
        
        Сумма = Сумма + 10000;
    КонецЦикла;     
    
	ВхСальдо = ТабВидыДоходов.Итог("СуммаБезнал");
    ЗаполнениеТаблицыПолитики(ТаблицаПолитика1, "ДеревоПолитика1", ВхСальдо);
	ЗаполнениеТаблицыПолитики(ТаблицаПолитика2, "ДеревоПолитика2", ВхСальдо);  
     
КонецПроцедуры
 
&НаКлиенте
Процедура ДобавитьВФормулу(Элемент, СтандартнаяОбработка, ТекстДобавляния = "")
    СтандартнаяОбработка = Ложь;
    
    Если ТекстДобавляния <> "" Тогда
        Элементы.ТекстФормулы.ВыделенныйТекст = ТекстДобавляния;
    иначе
        ТекСтрока = Элемент.ТекущиеДанные;
        Если ТекСтрока <> Неопределено И ЗначениеЗаполнено(ТекСтрока.Параметр) Тогда        
            Элементы.ТекстФормулы.ВыделенныйТекст = ТекСтрока.Параметр;
        КонецЕсли; 
    КонецЕсли; 
    
КонецПроцедуры


&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
    
    Если НЕ ПроверкаНаСервере() Тогда
        ПоказатьПредупреждение(, "Формула содержит ошибки, сохранение невозможно!");
    	Возврат;
    КонецЕсли; 
    
    Данные = Новый Структура("ТекстФормулы", ТекстФормулы);
    
    Закрыть(Данные);    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспРазделы = Константы.ИА_ФП_ИспользоватьРазделыПолитики.Получить();
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	
	Элементы.ДеревоПолитика1Раздел.Видимость = ИспРазделы;
	Элементы.ДеревоПолитика2Раздел.Видимость = ИспРазделы;
	
	Элементы.ДеревоПолитика1Подразделение.Видимость = ИспПодразделения;
	Элементы.ДеревоПолитика2Подразделение.Видимость = ИспПодразделения;
	
			
    Если Параметры.Свойство("ПараметрыФормулы") Тогда
    	ТекстФормулы = Параметры.ПараметрыФормулы.ТекстФормулы;
		ФП_По_ТБ = Параметры.ПараметрыФормулы.ФП_По_ТБ;
    КонецЕсли; 
    
	Если  Параметры.ПараметрыФормулы.Свойство("Политика1") 
		ИЛИ Параметры.ПараметрыФормулы.Свойство("Политика2") Тогда
    	Элементы.ГруппаПолитика.Видимость = Параметры.ПараметрыФормулы.Политика1;
		Элементы.ТабВидыДоходов.Видимость = Параметры.ПараметрыФормулы.Политика1;
		Элементы.ДоходыИтого.Видимость = Параметры.ПараметрыФормулы.Политика1;
	КонецЕсли; 
	
	Если ФП_По_ТБ Тогда
		Элементы.ДеревоПолитика1.Заголовок = "Переменные расходы";
		Элементы.ВаловаяПрибыль.Видимость = ложь;
		Элементы.ДеревоПолитика2.Видимость = ложь;
	КонецЕсли;
    
    Если  Параметры.ПараметрыФормулы.Свойство("ТаблицаПолитика1") Тогда
        ТаблицаПолитика1.Очистить();
        Таб =  Параметры.ПараметрыФормулы.ТаблицаПолитика1;
        Для каждого Стр Из Таб Цикл
            НовСтрока = ТаблицаПолитика1.Добавить();
        	ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
        КонецЦикла;  
	КонецЕсли; 
	
	Если  Параметры.ПараметрыФормулы.Свойство("ТаблицаПолитика2") Тогда
        ТаблицаПолитика2.Очистить();
        Таб =  Параметры.ПараметрыФормулы.ТаблицаПолитика2;
        Для каждого Стр Из Таб Цикл
            НовСтрока = ТаблицаПолитика2.Добавить();
        	ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
        КонецЦикла;  
    КонецЕсли; 
    
    
    ЗаполнитьРасчетныеДанные();
    
    Если ЗначениеЗаполнено(ТекстФормулы) Тогда
    	ПроверкаНаСервере();
    КонецЕсли;
	
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
КонецПроцедуры

&НаКлиенте
Процедура ТабВидыДоходовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    ДобавитьВФормулу(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросыДанныхФондовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    ДобавитьВФормулу(Элемент, СтандартнаяОбработка);
КонецПроцедуры



&НаКлиенте
Процедура Проверка(Команда)
    ПроверкаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДоходыИтого(Команда)
    ДобавитьВФормулу(, , "[ДоходыИтого]");
КонецПроцедуры

&НаКлиенте
Процедура ТабВидыДоходовПриИзменении(Элемент)
    РасчетИтогов();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
    РасчетИтогов();
    
    ИА_БФК.ДФ_РазвернутьВсеВетки(ДеревоПолитика1, Элементы.ДеревоПолитика1);
КонецПроцедуры


&НаКлиенте
Процедура ДеревоПолитика1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    ДобавитьВФормулу(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Функция ЗаполнениеТаблицыПолитики(ТаблицаПолитика, ДеревоФомы, вхСальдо)
	ТЗ = ТаблицаПолитика.Выгрузить();
	
    ТЗ.Свернуть("Раздел,Подразделение,Статья");
    ТЗ.Колонки.Добавить("СуммаНал");
    ТЗ.Колонки.Добавить("СуммаБезнал"); 
    
    Сумма = 10000;
    Для каждого Стр Из ТЗ Цикл
    	Стр.СуммаБезнал = Сумма;
		Стр.СуммаНал = 0;
        Сумма = Сумма + 5000;
	КонецЦикла;
	
	ТабРазделы = ТЗ.Скопировать();
    ТабРазделы.Свернуть("Раздел", "СуммаНал, СуммаБезнал");
    
    Дерево = РеквизитФормыВЗначение(ДеревоФомы);
    Дерево.Строки.Очистить();
	Для каждого СтрРаздел Из ТабРазделы Цикл
		Если ИспРазделы Тогда
	    	ВеткаРаздел = Дерево.Строки.Добавить();
	        ЗаполнитьЗначенияСвойств(ВеткаРаздел, СтрРаздел);
			
			Если ДеревоФомы = "ДеревоПолитика1" Тогда
	        	ВеткаРаздел.Параметр = "[П1 Итог:"+СтрРаздел.Раздел+"]";
			Иначе
				ВеткаРаздел.Параметр = "[П2 Итог:"+СтрРаздел.Раздел+"]";
			КонецЕсли;
		Иначе
			ВеткаРаздел = Дерево;
		КонецЕсли;
        ТабДетали = ИА_БФС.ТЗ_ФильтрПоОтбору(ТЗ, Новый Структура("Раздел", СтрРаздел.Раздел));
        
        Для каждого Стр Из ТабДетали Цикл
        	СтрДетали = ВеткаРаздел.Строки.Добавить();
            ЗаполнитьЗначенияСвойств(СтрДетали, Стр);
			
			Если ДеревоФомы = "ДеревоПолитика1" Тогда
            	СтрДетали.Параметр = "[П1 Сумма:" + СтрДетали.Подразделение + "$" + СтрДетали.Статья + "]";
			Иначе
				СтрДетали.Параметр = "[П2 Сумма:" + СтрДетали.Подразделение + "$" + СтрДетали.Статья + "]";
			КонецЕсли;
			
			вхСальдо = вхСальдо - Стр.СуммаБезнал;
		КонецЦикла;  
		
		Если ИспРазделы Тогда
			СтрСКД = Дерево.Строки.Добавить();
			СтрСКД.Раздел = "СКД:";
			СтрСКД.СуммаБезнал = вхСальдо;
			Если ДеревоФомы = "ДеревоПолитика1" Тогда
	        	СтрСКД.Параметр = "[П1 СКД:"+СтрРаздел.Раздел+"]";
			Иначе
				СтрСКД.Параметр = "[П2 СКД:"+СтрРаздел.Раздел+"]";
			КонецЕсли;
		КонецЕсли;
    КонецЦикла;  
    ЗначениеВРеквизитФормы(Дерево, ДеревоФомы);
КонецФункции

&НаКлиенте
Процедура ВаловаяПрибыль(Команда)
	ДобавитьВФормулу(, , "[ВалПрибыль]");
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолитика2Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДобавитьВФормулу(Элемент, СтандартнаяОбработка);
КонецПроцедуры
