
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИсключитьДоходы") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ИсключитьДоходы", Параметры.ИсключитьДоходы);
		Список.Параметры.УстановитьЗначениеПараметра("ПрИсключатьДоходы", истина);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ИсключитьДоходы", новый Массив);
		Список.Параметры.УстановитьЗначениеПараметра("ПрИсключатьДоходы", ложь);		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ложь);
КонецПроцедуры


&НаКлиенте
Процедура КомандаПоказатьПомеченные(Команда)
	Элементы.КомандаПоказатьПомеченные.Пометка = не Элементы.КомандаПоказатьПомеченные.Пометка;
	
	УстОтборПомеченных(Элементы.КомандаПоказатьПомеченные.Пометка);
КонецПроцедуры

&НаСервере
Процедура УстОтборПомеченных(ТекЗн)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ТекЗн);
КонецПроцедуры

