#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	ОрганизацияПолучатель = Организация;
			
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		Организация = ДанныеЗаполнения.Организация;
		ОрганизацияПолучатель = ДанныеЗаполнения.Организация;
		КассаОтправитель = ДанныеЗаполнения.Касса;
		Основание = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
		
	Автор = Пользователи.ТекущийПользователь();
	СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.НеУтвержден;
	ЖелательнаяДатаПлатежа = Дата(1, 1, 1);
	Основание = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПолеСтатьяДДСОбязательно = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();	
	Если НЕ ЗначениеЗаполнено(Статья) И ПолеСтатьяДДСОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         	НСтр("ru = 'Не заполнена статья движения денежных средств!'"), ЭтотОбъект,
        	"Статья",,Отказ);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда
		Если Ссылка.СтатусУтвержденияПлатежа <> СтатусУтвержденияПлатежа Тогда 
			ОтветственныйУтвердил = Пользователи.ТекущийПользователь();
		КонецЕсли;
	Иначе
		ОтветственныйУтвердил = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ДенежныеСредстваКВыплате Приход
	Движения.ДенежныеСредстваКВыплате.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваКВыплате.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Заявка = Ссылка;
	Движение.Сумма  = Сумма;

КонецПроцедуры

#КонецОбласти

#КонецЕсли