Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОтчета");
	Если ПараметрДанных.Использование = Ложь Тогда
		ПараметрДанных.Значение  = ТекущаяДата();    
	КонецЕсли;
	
	ДатаОтчетаВЗапросе = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОтчетаВЗапросе");
	ДатаОтчетаВЗапросе.Использование = Истина;
	ДатаОтчетаВЗапросе.Значение  = ТекущаяДата();    
	
	ПараметрПользовательскойНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
	Если ПараметрПользовательскойНастройки.Использование=Истина И НЕ Дата(ПараметрПользовательскойНастройки.Значение) = Дата(1,1,1) Тогда
		ДатаОтчетаВЗапросе.Значение  =	ПараметрПользовательскойНастройки.Значение; 				
	КонецЕсли;
КонецПроцедуры	