&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек.Пометка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
    Эл = Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек;
    Эл.Пометка = Не Эл.Пометка;
    Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Эл.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Попытка 
		ТекстОбласти = Элемент.ТекущаяОбласть.Текст;
		ДокСсылка = ПолучитьДокументПоТексту(ТекстОбласти);
		Если ДокСсылка = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;
	ВывестиРасшифровкуЗНО(ДокСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРасшифровкуЗНО(ДокСсылка)
	ТабДокРасшифровка = СуммаОткрытиеНаСервере(ДокСсылка);
	ТабДокРасшифровка.ОтображатьСетку = Ложь;
	ТабДокРасшифровка.ОтображатьЗаголовки = Ложь;
	ТабДокРасшифровка.ТолькоПросмотр = Истина;
	ТабДокРасшифровка.Показать();
КонецПроцедуры

&НаСервере
Функция СуммаОткрытиеНаСервере(ДокСсылка)
	
	РезСтроки = ВернутьДеталировкуПоДокументу(ДокСсылка);
	
	ТабДокРасшифровка = Новый ТабличныйДокумент;
	
	Макет = Отчеты.ИА_ВедомостьЗНО.ПолучитьМакет("МакетРасшифровки"); 
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапка.Параметры.Заголовок = "Расшифровка по документу " + ДокСсылка;
	ТабДокРасшифровка.Вывести(ОбластьШапка);
	Сч = 0;
	ТекСумма = 0;
	Для Каждого ТекСтрока Из РезСтроки Цикл
		Сч = Сч + 1;
		Если Сч = 1 Тогда
			ТекСумма = ТекСтрока.НачальныйОстаток;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрока.Документ) Тогда 
			ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
			ОбластьСтрока.Параметры.НачальныйОстаток = ТекСумма;
			ОбластьСтрока.Параметры.Приход = ТекСтрока.Приход;
			ОбластьСтрока.Параметры.Расход = ТекСтрока.Расход;
			ТекСумма = ТекСумма + ТекСтрока.Приход - ТекСтрока.Расход;
			ОбластьСтрока.Параметры.КонечныйОстаток = ТекСумма;
			ОбластьСтрока.Область(1,1,1,1).Расшифровка = ТекСтрока.Документ;
			ТабДокРасшифровка.Вывести(ОбластьСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабДокРасшифровка;
КонецФункции

Функция ПолучитьДокументПоТексту(ТекстОбласти);
	//ТекстОбласти = "Заявка на обязательства 000000001 от 17.12.2015 16:12:09";
	Если Найти(ТекстОбласти,"Заявка на обязательства ") = 0 Тогда 
		Возврат Неопределено;
	Иначе
		Номер = Сред(ТекстОбласти,25,9);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ЗаявкаНаОбязательства.Ссылка
	|ИЗ
	|	Документ.ИА_ЗаявкаНаОбязательства КАК ИА_ЗаявкаНаОбязательства
	|ГДЕ
	|	ИА_ЗаявкаНаОбязательства.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВернутьДеталировкуПоДокументу(ДокСсылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ЗаказыНаПриобретение.ЗП.Основание КАК ЗаявкаНаОбязательства,
	|	-ИА_ЗаказыНаПриобретение.Сумма КАК СуммаНачальныйОстаток,
	|	0 КАК СуммаПриход,
	|	0 КАК СуммаРасход,
	|	NULL КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Движения
	|ИЗ
	|	РегистрНакопления.ИА_ЗаказыНаПриобретение КАК ИА_ЗаказыНаПриобретение
	|ГДЕ
	|	ИА_ЗаказыНаПриобретение.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ИА_ЗаказыНаПриобретение.Период < &НачалоПериода
	|	И ИА_ЗаказыНаПриобретение.ЗП.Основание <> ЗНАЧЕНИЕ(Документ.ИА_ЗаявкаНаОбязательства.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИА_ЗаявкаНаОбязательства.Ссылка,
	|	ИА_ЗаявкаНаОбязательства.Сумма,
	|	0,
	|	0,
	|	NULL
	|ИЗ
	|	Документ.ИА_ЗаявкаНаОбязательства КАК ИА_ЗаявкаНаОбязательства
	|ГДЕ
	|	ИА_ЗаявкаНаОбязательства.Проведен
	|	И ИА_ЗаявкаНаОбязательства.Дата < &НачалоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИА_ЗаявкаНаОбязательства.Ссылка,
	|	0,
	|	ИА_ЗаявкаНаОбязательства.Сумма,
	|	0,
	|	ИА_ЗаявкаНаОбязательства.Ссылка
	|ИЗ
	|	Документ.ИА_ЗаявкаНаОбязательства КАК ИА_ЗаявкаНаОбязательства
	|ГДЕ
	|	ИА_ЗаявкаНаОбязательства.Проведен
	|	И ИА_ЗаявкаНаОбязательства.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИА_ЗаказыНаПриобретение.ЗП.Основание,
	|	0,
	|	0,
	|	ИА_ЗаказыНаПриобретение.Сумма,
	|	ИА_ЗаказыНаПриобретение.Регистратор
	|ИЗ
	|	РегистрНакопления.ИА_ЗаказыНаПриобретение КАК ИА_ЗаказыНаПриобретение
	|ГДЕ
	|	ИА_ЗаказыНаПриобретение.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ИА_ЗаказыНаПриобретение.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ИА_ЗаказыНаПриобретение.ЗП.Основание <> ЗНАЧЕНИЕ(Документ.ИА_ЗаявкаНаОбязательства.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Движения.ЗаявкаНаОбязательства,
	|	СУММА(ВТ_Движения.СуммаНачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(ВТ_Движения.СуммаПриход) КАК Приход,
	|	СУММА(ВТ_Движения.СуммаРасход) КАК Расход,
	|	ВТ_Движения.Регистратор КАК Документ,
	|	ВТ_Движения.Регистратор.МоментВремени КАК РегистраторМоментВремени
	|ИЗ
	|	ВТ_Движения КАК ВТ_Движения
	|ГДЕ
	|	ВТ_Движения.ЗаявкаНаОбязательства = &ДокСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Движения.ЗаявкаНаОбязательства,
	|	ВТ_Движения.Регистратор,
	|	ВТ_Движения.Регистратор.МоментВремени
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистраторМоментВремени
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	КоллекцияПП = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	П_Период = Неопределено;
	Для Каждого Стр Из КоллекцияПП Цикл
		Попытка
			Если "" + Стр.Параметр = "ПериодОтчета" Тогда 
				П_Период = Стр.Значение;
				Прервать;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Если П_Период = Неопределено Тогда 
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", П_Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", П_Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
    Элементы.ВариантОтчета.Заголовок = "Вариант отчета: " + ПредставлениеТекущегоВарианта;
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
    Эл = Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек;
    Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Эл.Пометка;
КонецПроцедуры
