// вызов с формы лида и с формы Графика замеров 
// ЛидСсылка - ссылка
Процедура ПослеЗаписиЛида(Знач ЛидСсылка) Экспорт
	
	РеквизитыЛида = Новый Структура("Ссылка, ИмяКлиента, Адрес, 
									| ПоследняяДатаЗамера, ПоследнееВремяНачалаЗамера, ПоследнееВремяОкончанияЗамера, ПоследнийИсполнительЗамера, 
									| СМСОтправлятьКлиентуПриПланированииЗамера, СМСОтправлятьЗамерщикуПриПланированииЗамера");
	
	Если ТипЗнч(ЛидСсылка) = Тип("ДокументСсылка.Лид") Тогда
		РеквизитыЛида = ОбщийМодульВызовСервера.ЗначенияРеквизитовОбъекта(ЛидСсылка, РеквизитыЛида);
	КонецЕсли;
	
	Если РаботаССМС.ИспользоватьОтправкуСМС() Тогда
		
		КодСтраны = СофтФон.ПолучитьТелефонныйКодСтраныПользователя();
		
		//СМС Клиенту
		Если РеквизитыЛида.СМСОтправлятьКлиентуПриПланированииЗамера И РаботаССМС.ОтправлятьСМСКлиентуПриПланированииЗамера() Тогда		
			
			НомерТелефона = ОбщийМодульВызовСервера.ПолучитьТелефонИзКонтактнойИнформации(ЛидСсылка, Истина);

			Если НЕ ПустаяСтрока(НомерТелефона) И НЕ НомерТелефона = КодСтраны Тогда
				ТекстСМС = РаботаССМС.ШаблонСМСКлиентуПриПланированииЗамера();
				ЗаполнитьПараметрыШаблонаСМСПриПланированииЗамера(ТекстСМС, РеквизитыЛида);
				//ТекстСМС = СтрЗаменить(ТекстСМС, "%НомерТелефона", РеквизитыЛида.ОсновнойТелефонКлиента);
				//ТекстСМС = СтрЗаменить(ТекстСМС, "%Контрагент", РеквизитыЛида.ИмяКлиента);
				//ТекстСМС = СтрЗаменить(ТекстСМС, "%Адрес", РеквизитыЛида.Адрес);
				//ТекстСМС = СтрЗаменить(ТекстСМС, "%Время", Формат(РеквизитыЛида.ПоследнееВремяНачалаЗамера,"ДФ=ЧЧ:мм"));
				//ТекстСМС = СтрЗаменить(ТекстСМС, "%Дата", Формат(РеквизитыЛида.ПоследняяДатаЗамера,"ДЛФ=D"));
				
				//Проверяем отправлялась ли СМС клиенту
				Если СМСНеОтправлялось(РеквизитыЛида.Ссылка, РеквизитыЛида.ИмяКлиента) Тогда						
					РаботаССМС.ПоставитьСМСВОчередь(РеквизитыЛида.Ссылка, РеквизитыЛида.ИмяКлиента, НомерТелефона, ТекстСМС);
				Иначе 
					ДополнительныеПараметры = Новый Структура("Ссылка, Кому, НомерТелефона, ТекстСМС", 
																РеквизитыЛида.Ссылка, РеквизитыЛида.ИмяКлиента, НомерТелефона, ТекстСМС);
					Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСМСПовторно", ЭтотОбъект, ДополнительныеПараметры);
					ПоказатьВопрос(Оповещение, НСтр("ru = 'Отправить повторное СМС клиенту о замере?'"), РежимДиалогаВопрос.ДаНет, 0);			
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//СМС Замерщику
		Если РеквизитыЛида.СМСОтправлятьЗамерщикуПриПланированииЗамера И РаботаССМС.ОтправлятьСМСЗамерщикуПриПланированииЗамера() Тогда 
			//НомерТелефона = СокрЛП(ПолучитьТелефонСотрудника(РеквизитыЛида.ПоследнийИсполнительЗамера));		
			НомерТелефона = СокрЛП(ОбщийМодульВызовСервера.ПолучитьТелефонИзКонтактнойИнформации(РеквизитыЛида.ПоследнийИсполнительЗамера));
			
			Если НЕ ПустаяСтрока(НомерТелефона) Тогда
				ТекстСМС = РаботаССМС.ШаблонСМСЗамерщикуПриПланированииЗамера();
				ЗаполнитьПараметрыШаблонаСМСПриПланированииЗамера(ТекстСМС, РеквизитыЛида);
				//ТекстСМС = СтрЗаменить(ТекстСМС, "%НомерТелефона", РеквизитыЛида.ОсновнойТелефонКлиента);
				//ТекстСМС = СтрЗаменить(ТекстСМС, "%Контрагент", РеквизитыЛида.ИмяКлиента);
				//ТекстСМС = СтрЗаменить(ТекстСМС, "%Адрес", РеквизитыЛида.Адрес);
				//ТекстСМС = СтрЗаменить(ТекстСМС, "%Время", Формат(РеквизитыЛида.ПоследнееВремяНачалаЗамера,"ДФ=ЧЧ:мм"));
				//ТекстСМС = СтрЗаменить(ТекстСМС, "%Дата", Формат(РеквизитыЛида.ПоследняяДатаЗамера,"ДЛФ=D"));
				
				//Проверяем отправлялась ли СМС замерщику
				Если СМСНеОтправлялось(РеквизитыЛида.Ссылка, РеквизитыЛида.ПоследнийИсполнительЗамера) Тогда							
					РаботаССМС.ПоставитьСМСВОчередь(РеквизитыЛида.Ссылка, РеквизитыЛида.ПоследнийИсполнительЗамера,НомерТелефона,ТекстСМС);
				Иначе
					ДополнительныеПараметры = Новый Структура("Ссылка, Кому, НомерТелефона, ТекстСМС", 
																РеквизитыЛида.Ссылка, РеквизитыЛида.ПоследнийИсполнительЗамера, НомерТелефона, ТекстСМС);
					Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСМСПовторно", ЭтотОбъект, ДополнительныеПараметры);
					ПоказатьВопрос(Оповещение, НСтр("ru = 'Отправить повторное СМС замерщику о замере?'"), РежимДиалогаВопрос.ДаНет, 0);						
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция СМСНеОтправлялось(ДокументСсылка, ПолучательСМС)
	
//	Запрос = новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	СМСОтправленные.Контрагент
//	               |ИЗ
//	               |	РегистрСведений.СМСОтправленные КАК СМСОтправленные
//	               |ГДЕ
//	               |	СМСОтправленные.Контрагент = &Контрагент
//	               |	И СМСОтправленные.ДокументОснование = &Основание";
//	Запрос.УстановитьПараметр("Контрагент", Контрагент);
//	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
//	РезультатЗапроса = Запрос.Выполнить();
//	Возврат РезультатЗапроса.Пустой();

	Возврат НЕ РаботаССМС.СМСОтправляласьРанее(ДокументСсылка, ПолучательСМС, , Ложь);
	
КонецФункции

Процедура ПослеЗакрытияВопросаСМСПовторно(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		РаботаССМС.ПоставитьСМСВОчередь(ДополнительныеПараметры.Ссылка, ДополнительныеПараметры.Кому, ДополнительныеПараметры.НомерТелефона, ДополнительныеПараметры.ТекстСМС);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьПараметрыШаблонаСМСПриПланированииЗамера(ТекстСМС, РеквизитыЛида)
	
	ТекстСМС = СтрЗаменить(ТекстСМС, "%НомерТелефона", РеквизитыЛида.ОсновнойТелефонКлиента);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Контрагент", РеквизитыЛида.ИмяКлиента);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Адрес", РеквизитыЛида.Адрес);
	
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Дата", Формат(РеквизитыЛида.ПоследняяДатаЗамера,"ДЛФ=D"));
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Время", Формат(РеквизитыЛида.ПоследнееВремяНачалаЗамера,"ДФ=ЧЧ:мм"));
	ТекстСМС = СтрЗаменить(ТекстСМС, "%ВремяОкончания", Формат(РеквизитыЛида.ПоследнееВремяОкончанияЗамера,"ДФ=ЧЧ:мм")); // #15188
		
КонецФункции
