#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		// Заполнение шапки
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.СкладПолучатель;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПередачаМатериаловВЭксплуатацию") Тогда
		// Заполнение шапки
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		Возвращает = ДанныеЗаполнения.Получатель;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	//ДВИЖЕНИЯ
	//приход на склад
	ДатаДвижения = Дата;
	Если ДатаДвижения = Дата(1,1,1) Тогда
		ДатаДвижения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;

	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.МатериалыВЭксплуатации.Записывать = Истина;
	Отказ = НЕ Движения.МатериалыВЭксплуатации.КонтрольОстатков(Ссылка, Организация, Возвращает, Товары, ДатаДвижения);
	Если Отказ Тогда
		Возврат;
	Иначе		
		Для Каждого Товар Из Товары Цикл
			Приход = Движения.ТоварыНаСкладах.Добавить();
			Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
			Приход.Период = ДатаДвижения;
			Приход.Организация = ОрганизацияТоваров;
			Приход.Склад = Склад;
			Приход.Номенклатура = Товар.Номенклатура;
			Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Приход.СерияНоменклатуры = Товар.СерияНоменклатуры;
			Приход.Количество = Товар.Количество * Товар.Коэффициент;
			Приход.Сумма = Приход.Количество * Движения.МатериалыВЭксплуатации.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, Возвращает, Приход.Номенклатура, Приход.ХарактеристикаНоменклатуры, Приход.СерияНоменклатуры);
			Приход.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Приход.Сумма); //#8288
			
			Расход = Движения.МатериалыВЭксплуатации.Добавить();
			Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
			Расход.Период = Приход.Период;
			Расход.Организация = Приход.Организация;
			Расход.Ответственный = Возвращает;
			Расход.Номенклатура = Приход.Номенклатура;
			Расход.ХарактеристикаНоменклатуры = Приход.ХарактеристикаНоменклатуры;
			Расход.СерияНоменклатуры = Приход.СерияНоменклатуры;
			Расход.Количество = Приход.Количество;
			Расход.Сумма = Приход.Сумма;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли