// 1) Есть ли запущенные ? Если "да", показываем список
// 2) ДА   => показываем список
// 3) НЕТ  => Вопрос "Запустить ?" с списком доступных. Если ВЫБОР, запускаем, ИНАЧЕ ничего



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Объект") Тогда
        ОбъектОтбора = Параметры.Отбор.Объект;
        Массив = Справочники.ИА_БПМаршрутЗадач.ПолучитьСписокМаршрутовПоОбъекту(ОбъектОтбора);
        Для каждого Эл Из Массив Цикл
        	СписокМаршрутов.Добавить(Эл);
        КонецЦикла; 
        ЕстьБП = БизнесПроцессы.ИА_БПНоситель.ПолучитьВсеБПППоВладельцу(ОбъектОтбора).Количество() > 0;
    КонецЕсли;     
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Если ЗначениеЗаполнено(ОбъектОтбора) Тогда
        Отказ = Истина;
        Закрыть();
        Если ЕстьБП Тогда
            П = Новый Структура("Отбор", Новый Структура("ИА_Владелец", ОбъектОтбора));
            ОткрытьФорму("БизнесПроцесс.ИА_БПНоситель.ФормаСписка", П,,Новый УникальныйИдентификатор);    
        Иначе
            Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтаФорма);
            СписокМаршрутов.ПоказатьВыборЭлемента(Оповещение, "Выберите вариант запуска:");
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ЗапуститьБП(МаршрутЗадач)
    БП = БизнесПроцессы.ИА_БПНоситель.СоздатьБП(Ложь, МаршрутЗадач, , ОбъектОтбора);
    ////ОбъектБП = БП.ПолучитьОбъект();
    Сообщение = "";
    ////Попытка
    ////	ОбъектБП.Старт();
    ////Исключение
    ////    ТекстОшибки = ОписаниеОшибки();
    ////    Сообщение = "Не удалось стартовать бизнес-процесс " + БП + " по причине: " + ТекстОшибки; 
    ////КонецПопытки; 

    Возврат Новый Структура("БП, Сообщение", БП, Сообщение);
КонецФункции
 

&НаКлиенте
Процедура ПослеВыбораЭлемента(ВыбЭлемент, Параметры) Экспорт
    Если ВыбЭлемент <> Неопределено Тогда
        Данные = ЗапуститьБП(ВыбЭлемент.Значение);
        ПоказатьЗначение(,Данные.БП);
        //Если ЗначениеЗаполнено(Данные.Сообщение) Тогда
        //	ПоказатьПредупреждение(,Данные.Сообщение);
        //КонецЕсли; 
    КонецЕсли;
КонецПроцедуры
