Процедура ПостроитьОС(ОрганизацияСсылка, ТабДокОргСхема, МассивНарисованныхЭлементов) Экспорт
	
	РасшифровкиРисунков = Новый Массив;
	
	//ХранилищеТабДок = ИА_ОргСхема_Сервер.ПоместитьВХранилище(ТабДокОргСхема);
	//ХранилищеМассивНарисованныхЭлементов = ИА_ОргСхема_Сервер.ПоместитьВХранилище(МассивНарисованныхЭлементов);
	
	//ИА_ОргСхема_Сервер.ПостроитьОС(ОрганизацияСсылка, ХранилищеТабДок, ХранилищеМассивНарисованныхЭлементов, РасшифровкиРисунков);
	ИА_ОргСхема_Сервер.ПостроитьОС(ОрганизацияСсылка, ТабДокОргСхема, МассивНарисованныхЭлементов, РасшифровкиРисунков);
	
	//ТабДокОргСхема = ИА_ОргСхема_Сервер.ПолучитьИзХранилища(ХранилищеТабДок);	
	//МассивНарисованныхЭлементов = ИА_ОргСхема_Сервер.ПолучитьИзХранилища(ХранилищеМассивНарисованныхЭлементов);
		
КонецПроцедуры
