
#Область ПеременныеФормы

&НаКлиенте
Перем мПредыдущееКоличество;

&НаКлиенте
Перем мСуммаБонусов;

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаУчета = ПолучитьФункциональнуюОпцию("ВалютаУчета");
	
	//++ настройка видимости элементов по бонусам
	УстановитьВидимостьЭлементовПоБонусам();	
	УчетБонусовПо = ?(Объект.СлужебныйУчетБонусовПоДисконтнымКартам, 1, 0);
	//-- настройка видимости элементов по бонусам
	
	ИспользуютсяАвтоматическиеСкидки = ОбщийМодуль.ЕстьРеквизитТабЧастиОбъекта("СуммаАвтоматическойСкидки", Объект.Ссылка.Метаданные(), "Товары");
	
	ИспользоватьКонтрольКратности = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольКратностиЕдиницИзмерения");
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПриЧтенииСозданииНаСервере();	
	
		Если Объект.НачислятьБонусы Тогда
			ПересчитатьБонусыПоДокументу();
		КонецЕсли;
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаПодвал);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры); // должно быть до РегулировкаШириныПоляКонтрагента
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.ЕстьИндивидуальныеЦеныКонтрагентаНаФорме(Объект.Дата, Объект.Контрагент, Объект.ДоговорКонтрагента, Элементы.ЕстьИндивидуальныеЦены);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию, Элементы.ЕстьИндивидуальныеЦены);
	
	ЗаполнитьСтавкуНДСПоОрганизации(Ложь);
	//РассчитатьИтоговыеПоказатели();
	ОбновитьДанныеДокумента();
	
	ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог();
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("РазрешитьНулевыеЦены, РазрешеноМенятьМенеджераВРеализации,
									|ДополнительныеПраваЗапретРедактированияЦенВДокументах, ДополнительныеПраваЗапретПримененияСкидок");
	
	//управление доступностью элементов
	Если РеквизитыПользователя.ДополнительныеПраваЗапретРедактированияЦенВДокументах Тогда
		МассивИменЭлементов = Документы.РеализацияТоваровИУслуг.ПолучитьМассивРеквизитовПоЦенам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
	//#7771
	Если РеквизитыПользователя.ДополнительныеПраваЗапретПримененияСкидок Тогда
		МассивИменЭлементов = Документы.РеализацияТоваровИУслуг.ПолучитьМассивРеквизитовПоСкидкам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
		
	// при создании реализации из заказа на производства на неполный перечень товаров
	Если Параметры.ЗначенияЗаполнения.Свойство("ЕстьОстаткиТовара") Тогда 
		Если Параметры.ЗначенияЗаполнения.ЕстьОстаткиТовара Тогда 
			ПерезаполнитьТаблицыТоваровУслуг();
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

	ИспользоватьПодключаемоеОборудование = ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	Элементы.ГруппаФискальныйРегистратор.Видимость = ИспользоватьПодключаемоеОборудование;
	Элементы.ФормаПечатьЧека.Видимость = ИспользоватьПодключаемоеОборудование;
	
	//#12358
	//Элементы.ГруппаВыдача.Видимость = ПолучитьФункциональнуюОпцию("ВестиУчетВыдачиТоваровПоДокументуРеализации");
	Элементы.ГруппаВыдача.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыОтгрузки");

	Элементы.ТоварыБесплатно.ТолькоПросмотр = НЕ РеквизитыПользователя.РазрешитьНулевыеЦены;
	Элементы.УслугиБесплатно.ТолькоПросмотр = НЕ РеквизитыПользователя.РазрешитьНулевыеЦены;
	
	//2.0 чтобы не могли выбрать ЗнП
	МассивТиповЗаказов = Новый Массив();
	МассивТиповЗаказов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	ОписаниеТиповЗаказов = Новый ОписаниеТипов(МассивТиповЗаказов);
	Элементы.ТоварыЗаказ.ОграничениеТипа = ОписаниеТиповЗаказов; 
	
	ФинансыСервер.УстановитьОтметкуНезаполненныхСтатейДоходовРасходов(Элементы);
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ТоварыСтатьяДоходов");
	МассивЭлементов.Добавить("УслугиСтатьяДоходов");
	ФинансыСервер.УстановитьВидимостьКолонокСтатейДиРВТабличнойЧасти(ЭтаФорма, МассивЭлементов, Истина);
	
	ОбщийМодульСервер.ДобавитьИндикаторРаботыСоСканерамиШК(ЭтотОбъект);
	
	//#4644
	Выработка.Параметры.УстановитьЗначениеПараметра("ОбъектВыработки", Объект.Ссылка);
	ОбщийМодульСервер.УстановитьВидимостьГруппыВыработки(Элементы, Объект.Ссылка);
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("ТоварыНоменклатураАртикул");
	МассивЭлементов.Добавить("УслугиНоменклатураАртикул");
	МассивЭлементов.Добавить("ВыработкаНоменклатураАртикул");
	МассивЭлементов.Добавить("ОбъектВыработкаНоменклатураАртикул");
	МассивЭлементов.Добавить("ВыработкаПлановаяНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);	
	
	//#7805
	УправлениеВидимостьюАдресаМонтажа();
	
	// №10663
	Элементы.ГруппаСсылкиНаДоставки.Видимость = ПолучитьФункциональнуюОпцию("УчитыватьДоставкуТовара");
	ЗаполнитьСсылкиНаДоставки();
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	//#13943
	Элементы.Менеджер.ТолькоПросмотр = НЕ РеквизитыПользователя.РазрешеноМенятьМенеджераВРеализации;
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
	
	РассчитатьИтоговыеПоказателиСервер();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ДоговорДоИзменения = Объект.ДоговорКонтрагента;
		
	ОбщийМодульСервер.ПриЧтенииСозданииДокументовСДоставкойНаСервере(Элементы, Объект);
	
	ЗаполнитьОстаткиПоТоварам();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	//#2792
	Если ИспользоватьКонтрольКратности Тогда
		ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(Отказ, Объект, Перечисления.ВидыДокументовПроверкиКратности.РеализацияТоваровИУслуг);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
			Если ТекущаяСтрока.Сумма < 0 Тогда
				Сообщить("В строке №" + ТекущаяСтрока.НомерСтроки + " товаров указана отрицательная сумма. Необходимо исправить строку. Проведение отменено");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
			Если ТекущаяСтрока.Сумма < 0 Тогда
				Сообщить("В строке №" + ТекущаяСтрока.НомерСтроки + " услуг указана отрицательная сумма. Необходимо исправить строку. Проведение отменено");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//#13359 перенесено в ПослеЗаписи
	//Если НЕ Отказ 
	//	И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
	//	И UDS_ОбщийМодульВызовСервера.ИспользуетсяUDS() Тогда
	//	UDS_ОбщийМодульКлиент.ПередатьТранзакцию(Объект, Истина, Отказ);
	//КонецЕсли;
	
	// №1083 очищаем таблицу выработки, если выключена галочка "Ручная корректировка"
	Если НЕ Объект.РучнаяКорректировкаВыработки Тогда
		Объект.Выработка.Очистить();
	КонецЕсли;
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДанныеДокумента();
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = НЕ ПраваПользователей.РазрешеноРасходоватьСоСклада(Объект.Склад);
		Если Отказ Тогда
			Сообщить("У текущего пользователя нет прав для оформления расхода по складу """ + Объект.Склад + """");
			Возврат;
		КонецЕсли;
		
		//Проверка на разрешение отгрузки
		Если Константы.ИспользоватьУчетРазрешенийНаОтгрузкуЗаказов.Получить() Тогда
			//Проверим основание
			Если Объект.Основание <> Неопределено И НЕ Объект.Основание.Пустая()
				И (ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя")
					//ИЛИ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") //переход на 2.0
					) 
					Тогда
					
					Отказ = НЕ Объект.Основание.ОтгрузкаРазрешена;
					Если Отказ Тогда
						Сообщить("По заказу в основании " + Объект.Основание + " не установлено разрешение на отгрузку!");
						Возврат;	
					КонецЕсли;	
					
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	// проверяем заполненность статей доходов/расходов
	ФинансыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//#13359
		//Если UDS_ОбщийМодульВызовСервера.ИспользуетсяUDS() Тогда
		Если Объект.СлужебныйВидБонуснойСистемы = ПредопределенноеЗначение("Перечисление.ВидыБонусныхСистем.UDS") Тогда
			СостояниеОбменаUDS = UDS_ОбщийМодульКлиент.ПередатьТранзакцию(Объект, Истина);
			Если СостояниеОбменаUDS = 0 Тогда // не требуется
				// продолжаем процедуру ПослеЗаписи
			ИначеЕсли СостояниеОбменаUDS = 1 Тогда 
				// успешно отправлено
				Записать(ПараметрыЗаписи);
				Возврат;
			Иначе
				// ошибка при отправке, пользователь получит сообщение
				ПараметрыЗаписи.ПринудительноЗакрытьФорму = Ложь;
				//Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте;
	
	НужноОбновитьАрмПроизводства = Ложь;
	Для Каждого ТекСтрокаТовары Из Объект.Товары Цикл
		Если НЕ ТекСтрокаТовары.Заказ = Неопределено Тогда
			НужноОбновитьАрмПроизводства = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НужноОбновитьАрмПроизводства Тогда
		Оповестить("ОбновитьАРМПроизводства",,"РеализацияТоваровИУслуг");
	КонецЕсли;
	
	МассивОснований = Новый Массив;
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда		
		Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			МассивОснований.Добавить(Объект.Основание);
		КонецЕсли;	
		Для каждого СтрокаОснования из Объект.Основания Цикл
			Если ТипЗнч(СтрокаОснования.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				МассивОснований.Добавить(СтрокаОснования.Основание);
			КонецЕсли;	
		КонецЦикла;
		
		//++ №16140 Закоментирован так как есть ниже.
		// Оповестить("ЗакрытиеЗаказа", МассивОснований, Объект.Ссылка);	
	КонецЕсли;
	
	Если МассивОснований.Количество() > 0 Тогда
		Оповестить("Запись_РеализацияПоЗаказу", МассивОснований);
		
		Если ПолучитьФункциональнуюОпциюНаСервере("АвтоматическиПереводитьЗаказПокупателяВСтатусВыполненПриПолнойОтгрузке") Тогда		
			Оповестить("ЗакрытиеЗаказа", МассивОснований, Объект.Ссылка);	
		КонецЕсли;
	КонецЕсли;
	
	Выработка.Параметры.УстановитьЗначениеПараметра("ОбъектВыработки", Объект.Ссылка); // для новых документов ссылка могла быть пустой
	Элементы.Выработка.Обновить();
	ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог();
	
	//ЗаполнитьОстаткиПоТоварам();
	//ОбновитьДанныеДокумента();
	
	ОбщийМодульКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	
	ЗаполнитьОстаткиПоТоварам();
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();

	Если ИспользоватьБонусы Тогда
		БонусыСервер.НастройкаЭлементов(Элементы, ТекущийОбъект);  //#16589
		БонусыСервер.ОпределитьОстатокПоДисконтнойКарте(ЭтаФорма); // №13299
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "РегистрСведений.СопутствующиеТоварыИУслуги.Форма.ФормаПодбора" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, Истина);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ИмяСобытия = "ScanData" И ВводДоступен() И НЕ ЭтаФорма.ТолькоПросмотр Тогда		
		
		ОбработатьШтрихкод(Параметр);
		
	//++ №10663
	ИначеЕсли ИмяСобытия = "ЗаписьЗаявкиНаДоставку" Тогда
		
		ЗаполнитьСсылкиНаДоставки();
	
	//-- №10663
	КонецЕсли;

	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПолучитьДанныеОрганизацииПриИзменении();
	ЗаполнитьСтавкуНДСПоОрганизации();
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	//ОбновитьДанныеДокумента();
	
	ЗаполнитьОстаткиПоТоварам();
	
	Если ИспользоватьБонусы Тогда
		ПересчитатьБонусыПоДокументу();
	КонецЕсли;
	//#7805
	//УправлениеВидимостьюАдресаМонтажа();
	ЗаполнитьСтатьюДоходовРасходовСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)	
	СкладПриИзмененииКлиент();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзмененииКлиент()	
	СкладПриИзмененииСервер();	
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииСервер()
	
	//#4051
	// пока закомментировано в рамках этой же заявки
	//Объект.Отпустил = Объект.Склад.Ответственный;

	ЗаполнитьОстаткиПоТоварам();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	ВидЦенПриИзмененииКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзмененииКлиент()
	
	Если ПраваПользователей.ВидЦенДоступенПользователю(Объект.ВидЦен) Тогда
		ЗадатьВопросОПересчетеЦен();
	Иначе
		Объект.ВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ЗадатьВопросОПересчетеЦен();
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзмененииКлиент()
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщийМодульКлиентСервер.ОчиститьРеквизитыДоставки(Элементы, Объект);
	КонецЕсли;
	
	КонтрагентПриИзмененииСервер();
		
	ДоговорПриИзмененииКлиент();	
	//УстановитьВидЦенНаОснованииДоговора(); // это имеется в ДоговорПриИзмененииКлиент
	//ЗадатьВопросОПересчетеЦен();
	
	//ОбновитьДанныеДокумента();
	Если ИспользоватьБонусы Тогда
		ПересчитатьБонусыПоДокументу();
	КонецЕсли;
	//#7805
	//УправлениеВидимостьюАдресаМонтажа();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииСервер()
	
	//Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор;	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Контрагент, "ОсновнойДоговор, Категория");	
		Объект.ДоговорКонтрагента = РеквизитыКонтрагента.ОсновнойДоговор;
		Объект.КатегорияКонтрагента = РеквизитыКонтрагента.Категория;
	Иначе
		Объект.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		Объект.КатегорияКонтрагента = Справочники.КатегорииКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.ЕстьИндивидуальныеЦеныКонтрагентаНаФорме(Объект.Дата, Объект.Контрагент, Объект.ДоговорКонтрагента, Элементы.ЕстьИндивидуальныеЦены);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию, Элементы.ЕстьИндивидуальныеЦены);
	
	//заполним адрес доставки по адресу контрагента
	//ТаблицаАдресов = Объект.Контрагент.АдресаДоставки.Выгрузить();
	//Если ТаблицаАдресов.Количество() > 0 Тогда 
	//	ОсновнойАдресКонтрагента = ТаблицаАдресов.Найти(Истина,"Основной");
	//	Если ОсновнойАдресКонтрагента = Неопределено Тогда 
	//		Объект.АдресДоставки = ТаблицаАдресов[0].Адрес;
	//	Иначе 
	//		Объект.АдресДоставки = ОсновнойАдресКонтрагента.Адрес;
	//	КонецЕсли;
	//КонецЕсли;
	//Объект.АдресДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Контрагент, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	
	БонусыСервер.ОпределитьОстатокПоДисконтнойКарте(ЭтаФорма);
	
	ОбщийМодульСервер.ЗаполнитьРеквизитыДоставки(Элементы, Объект);
	
	//#13359
	UDS_ОбщийМодульСервер.ЗаполнитьРеквизитыДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	ДоговорПриИзмененииКлиент();
	//ОбновитьДанныеДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзмененииКлиент()
	
	Если НЕ ДоговорДоИзменения = Объект.ДоговорКонтрагента Тогда
		ДоговорДоИзменения = Объект.ДоговорКонтрагента;		
		ВидЦенДоИзменения = Объект.ВидЦен;
		СкладДоИзменения = Объект.Склад;
		
		ДоговорПриИзмененииСервер();
		Если НЕ ВидЦенДоИзменения = Объект.ВидЦен Тогда
			ВидЦенПриИзмененииКлиент();
		КонецЕсли;
		Если НЕ СкладДоИзменения = Объект.Склад Тогда
			СкладПриИзмененииКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииСервер()
	
	// УстановитьВидЦенНаОснованииДоговора
	
	//сначала берем из карточки пользователя (низший приоритет)
	Объект.ВидЦен = ОбщийМодульСервер.НастройкаПользователя("ВидЦенПроизводство");
	//если задан вид цен в категории контрагента, то берем из него (средний приоритет)
	Если НЕ Объект.Контрагент.Категория.ВидЦен.Пустая() Тогда
		Объект.ВидЦен = Объект.Контрагент.Категория.ВидЦен;
	КонецЕсли;
	//если задан вид цен в договоре, то берем из него (высший приоритет)
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда		
		ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДоговорКонтрагента, "ВидЦен, СкладОтгрузкиТоваровПоУмолчанию"); 
		Если ЗначениеЗаполнено(ДанныеДоговора.ВидЦен) Тогда
			Объект.ВидЦен = ДанныеДоговора.ВидЦен;
		КонецЕсли;
		
	    // склад
		Если ЗначениеЗаполнено(ДанныеДоговора.СкладОтгрузкиТоваровПоУмолчанию) И НЕ ДанныеДоговора.СкладОтгрузкиТоваровПоУмолчанию = Объект.Склад Тогда
			Объект.Склад = ДанныеДоговора.СкладОтгрузкиТоваровПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура УДАЛИТЬ_ВыданоПриИзменении(Элемент)
	//ВыданоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатусОтгрузкиПриИзмененииНаСервере()
	//было ВыданоПриИзмененииНаСервере()
	
	НоваяСтрока = Объект.ИсторияВыдачи.Добавить();
	НоваяСтрока.Дата = ТекущаяДатаСеанса();
	НоваяСтрока.Пользователь = Пользователи.ТекущийПользователь();
	//НоваяСтрока.Выдано = Объект.Выдано;
	НоваяСтрока.Статус = Объект.СтатусОтгрузки;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОтгрузкиПриИзменении(Элемент)
	СтатусОтгрузкиПриИзмененииНаСервере();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыТовары

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ЗаполнитьОстаткиПоТоварам();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	СписокВыделенныхПозиций = Элементы.Товары.ВыделенныеСтроки;
	
	СписокПозицийКУдалению = новый СписокЗначений;	
	СписокПотолков = новый СписокЗначений;
	
	Если СписокВыделенныхПозиций.Количество() > 0
		И ЭтоПотолокИУНегоЕстьУслугиВТЧ(СписокВыделенныхПозиций, СписокПотолков, СписокПозицийКУдалению) Тогда
		//Если это потолок и у него есть товары / услуги в ТЧ, зададим вопрос об удалении их из ТЧ
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВопросаОУдаленииТоваровУслугПоПотолку", ЭтотОбъект, новый Структура("Потолки", СписокПотолков));
		
		ТекстВопроса = "В табличных частях есть позиции, связанные с продукцией, удалить позиции?";
		Для Каждого ТекущаяСтрока Из СписокПотолков Цикл
			
			ТекстВопроса = ТекстВопроса + Символы.ПС + "Продукция: " + ТекущаяСтрока.Значение;
			
			Для Каждого Строка Из СписокПозицийКУдалению Цикл
				Если Строка.Значение.Потолок = ТекущаяСтрока.Значение Тогда
					ТекстВопроса = ТекстВопроса 
						+ Символы.ПС 
						+ "   " + Строка.Значение.ТЧ + " номер строки " + Строка.Значение.НомерСтроки + " "
						+ Строка.Значение.Номенклатура + " " + Строка.Значение.ХарактеристикаНоменклатуры;
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;	
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Удаление связанных позиций по продукции");		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
        Элемент.ТекущиеДанные.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	//++ №13299
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		мПредыдущееКоличество = ТекущиеДанные.Количество;
	КонецЕсли;
	//-- №13299
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьИтоговыеПоказателиКлиент();
	//ОбновитьДанныеДокумента();
	Если ИспользоватьБонусы Тогда
		ПересчитатьБонусыПоДокументу();
	КонецЕсли;
	ЗаполнитьОстаткиПоТоварам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	РассчитатьИтоговыеПоказателиКлиент();
	//ОбновитьДанныеДокумента();
	Если ИспользоватьБонусы Тогда
		ПересчитатьБонусыПоДокументу();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяДоходов");
	
	СтрокаТабличнойЧасти.Количество = 1;
	//СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена, Количество"); //#2792 добавлено Количество
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);	

	ЗаполнитьОстаткиПоТоварам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);	
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтруктураДанные); //СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ОчиститьСообщения();
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	//#2792
	Если ИспользоватьКонтрольКратности Тогда
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
		ОтказВИзмененииКоличества = Ложь;
		ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества);
		Если ОтказВИзмененииКоличества Тогда
			СтрокаТабличнойЧасти.Количество = 0;
		КонецЕсли;
	КонецЕсли;
	
	//++ №13299 пересчитаем скидку бонусами пропорционально
	Если НЕ мПредыдущееКоличество = Неопределено И мПредыдущееКоличество > 0 Тогда
		СтрокаТабличнойЧасти.СкидкаБонусами = (СтрокаТабличнойЧасти.СкидкаБонусами / мПредыдущееКоличество) * СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	//-- №13299
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(СтрокаТабличнойЧасти);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

&НаСервере
Процедура ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества)
	
	ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(ОтказВИзмененииКоличества, СтруктураДанные, Перечисления.ВидыДокументовПроверкиКратности.РеализацияТоваровИУслуг);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	//СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	//
	//Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
	//	СтрокаТабличнойЧасти.Коэффициент = 1;
	//Иначе
	//	СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	//КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена, Коэффициент, Количество");  //#2792 добавлено Количество
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);	

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПроцентРучнойСкидкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаРучнойСкидкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ОбработкаТабличныхЧастейКлиент.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока);
		ТекущаяСтрока.Цена = (ТекущаяСтрока.Сумма + ТекущаяСтрока.СуммаРучнойСкидки + ТекущаяСтрока.СкидкаБонусами) / ТекущаяСтрока.Количество;
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	//ОбновитьДанныеДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПотолокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если ЭтоПотолокИлиОтрез(ТекущаяСтрока.Номенклатура) Тогда
			ДанныеВыбора.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыУслуги

&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
        Элемент.ТекущиеДанные.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	//++ №13299
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		мПредыдущееКоличество = ТекущиеДанные.Количество;
	КонецЕсли;
	//-- №13299
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьИтоговыеПоказателиКлиент();	
	//ОбновитьДанныеДокумента();
	Если ИспользоватьБонусы Тогда
		ПересчитатьБонусыПоДокументу();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
	
	РассчитатьИтоговыеПоказателиКлиент();
	//ОбновитьДанныеДокумента();
	Если ИспользоватьБонусы Тогда
		ПересчитатьБонусыПоДокументу();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяДоходов");	
	
	СтрокаТабличнойЧасти.Количество = 1;
	//СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена, Количество"); //#2792 добавлено Количество
		
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

&НаКлиенте
Процедура УслугиХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, "Услуги");
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтруктураДанные);//ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена, Коэффициент, Количество");  //#2792 добавлено Количество

	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ОчиститьСообщения();
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	
	//#2792
	Если ИспользоватьКонтрольКратности Тогда
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, "Услуги");
		ОтказВИзмененииКоличества = Ложь;
		ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества);
		Если ОтказВИзмененииКоличества Тогда
			СтрокаТабличнойЧасти.Количество = 0;
		КонецЕсли;
	КонецЕсли;

	//++ №13299 пересчитаем скидку бонусами пропорционально
	Если НЕ мПредыдущееКоличество = Неопределено И мПредыдущееКоличество > 0 Тогда
		СтрокаТабличнойЧасти.СкидкаБонусами = (СтрокаТабличнойЧасти.СкидкаБонусами / мПредыдущееКоличество) * СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	//-- №13299
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(СтрокаТабличнойЧасти);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	
	//СуммаСтроки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	//ТекущаяСтрока.Сумма = СуммаСтроки - ТекущаяСтрока.СуммаРучнойСкидки;
	//РассчитатьСуммуНДСТабЧасти(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПроцентРучнойСкидкиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаРучнойСкидкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ОбработкаТабличныхЧастейКлиент.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока);
		ТекущаяСтрока.Цена = (ТекущаяСтрока.Сумма + ТекущаяСтрока.СуммаРучнойСкидки + ТекущаяСтрока.СкидкаБонусами) / ТекущаяСтрока.Количество;
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	//ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПотолокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если ЭтоПотолокИлиОтрез(ТекущаяСтрока.Номенклатура) Тогда
			ДанныеВыбора.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщийМодульКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщийМодульКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщийМодульКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧека(Команда)
	
	Если Объект.ЧекФискализирован Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на оборудовании!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросПроведениеПередПечатьюЧека", ЭтотОбъект);	
	Если ПотолкиКассыОнлайнКлиент.ПроверитьВозможностьПечатиЧека(ОбработчикОповещения, ЭтотОбъект) Тогда
		ПечатьЧекаКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекаКлиент()
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ДокументСсылка",           Объект.Ссылка);
	ПараметрыОперации.Вставить("Партнер",                  Объект.Контрагент);
	ПараметрыОперации.Вставить("Организация",              Объект.Организация);
	ПараметрыОперации.Вставить("ПодключенноеОборудование", Неопределено); //ФискальнаяОперацияПодключенноеОборудование);
		
	ОписаниеОповещенияПриЗавершении = Новый ОписаниеОповещения("ФискализацияЧека_Завершение", ЭтотОбъект);
	ОткрытьФорму(
			"Обработка.ПредпросмотрЧека.Форма",
			ПараметрыОперации,
			ЭтотОбъект,,,,
			ОписаниеОповещенияПриЗавершении);
			
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросПроведениеПередПечатьюЧека(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
			ПечатьЧекаКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализацияЧека_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения = Неопределено И НЕ РезультатВыполнения = КодВозвратаДиалога.Отмена Тогда
		Если РезультатВыполнения.Результат Тогда
			// Установить полученное значение номера чека реквизиту документа.
			Объект.НомерСменыККМ = РезультатВыполнения.НомерСмены;
			Объект.НомерЧекаККМ = РезультатВыполнения.НомерЧекаККМ;
			
			Объект.ЧекФискализирован = Истина;;
			//Объект.Дата = МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса();
			Если Не ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
				Объект.НомерЧекаККМ = 1;
			КонецЕсли;
			
			ПараметрыЗаписи = Новый Структура("РежимЗаписи, РежимПроведения",
			РежимЗаписиДокумента.Проведение,
			РежимПроведенияДокумента.Оперативный);
			Если ЗаписатьДокументНаСервере(ПараметрыЗаписи) Тогда
				//
			Иначе
				ТекстСообщения = НСтр("ru = 'Ошибка записи документа'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура UDS_Запросить(Команда)
	
	UDS_ОбщийМодульКлиент.ЗапросБаллов(ЭтотОбъект, Объект);
	
	ДоступноПоДисконтнойКарте = Мин(МаксимальныйРазмерБонусовКСписаниюПоДокументу() / 100 * СуммаДокументаБезУчетаБонусов, ОстатокПоДисконтнойКарте);
	
КонецПроцедуры

&НаКлиенте
Процедура UDS_ОчиститьДанные(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.UDS_ИдентификаторОперации) Тогда
		UDS_ОбщийМодульКлиент.ОчиститьПоля(Объект);
		UDS_ОчиститьДанныеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура UDS_ОчиститьДанныеНаСервере()
		
	БонусыСервер.ОчиститьСуммуБонусовПоСтрокамДокумента(Объект);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандТаблиц

&НаКлиенте
Процедура ПодборТовары(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	ПараметрыПодбора.Вставить("Склад",					Объект.Склад);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыТовары());
	ПараметрыПодбора.Вставить("ВидЦены",				Объект.ВидЦен);
	ПараметрыПодбора.Вставить("Валюта",					Объект.Валюта);
	ПараметрыПодбора.Вставить("ЗапретРедактированияЦен",ЗапретРедактированияЦен());
	Если ИспользоватьКонтрольКратности Тогда
		ПараметрыПодбора.Вставить("ВидДокументаПроверкиКратности",ПредопределенноеЗначение("Перечисление.ВидыДокументовПроверкиКратности.РеализацияТоваровИУслуг")); //#2792
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПотолокПоОснованию(Команда)
	
	СписокВариантов = ПолучитьСписокПОтолковОснования();
	
	Если СписокВариантов.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"В документах-основаниях нет потолков");
		Возврат;
	КонецЕсли;	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборПотолкаДляЗаполненияПоОснованию", ЭтаФорма);	
	СписокВариантов.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите потолок");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПотолкаДляЗаполненияПоОснованию(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		ВыборПотолкаДляЗаполненияПоОснованиюНаСервере(ВыбранныйЭлемент.Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСопутствующиеТовары(Команда)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Сообщить("Не выбрана позиция");
		Возврат;
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Номенклатура",			ТекущаяСтрока.Номенклатура);
	ПараметрыПодбора.Вставить("ХарактеристикаНоменклатуры",			ТекущаяСтрока.ХарактеристикаНоменклатуры);
	ПараметрыПодбора.Вставить("Количество",			ТекущаяСтрока.Количество);	

	ОткрытьФорму("РегистрСведений.СопутствующиеТоварыИУслуги.Форма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиДоставка

&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ПриИзмененииПредставленияАдреса(
	    Элемент,
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ОчиститьПредставлениеАдреса(
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ОбщийМодульКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	    Элемент,
		Объект,
		"АдресДоставки",
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресДоставкиПриИзменении(Элемент);
	
	ОбщийМодульКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()  
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект, Элементы.ДекорацияСостояниеОригинала);   
КонецПроцедуры
//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция записи и проведения документа.
//
&НаСервере
Функция ЗаписатьДокументНаСервере(ПараметрыЗаписи)
	
	Результат = Ложь;
	
	Попытка
		Результат = Записать(ПараметрыЗаписи);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось провести документ: '") + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

//#7805
&НаСервере
Процедура УправлениеВидимостьюАдресаМонтажа()
	
	//++ №10128 закомментировано, т.к. видимость всегда Истина
	//ВидимостьЭлемента = Ложь;
	//Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") И ЗначениеЗаполнено(Объект.Основание) Тогда
	//	НастройкаИнтеркампани = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Основание, "НастройкаИнтеркампани");
	//	Если ЗначениеЗаполнено(НастройкаИнтеркампани) Тогда
	//		ВидимостьЭлемента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаИнтеркампани, "ОтображатьАдресМонтажаВШапкеДокумента");
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если НЕ ВидимостьЭлемента Тогда
	//	МенеджерЗаписи = РегистрыСведений.СвязкиОрганизацийПроизводстваКонтрагентРозницы.СоздатьМенеджерЗаписи();
	//	МенеджерЗаписи.Организация = Объект.Организация;
	//	МенеджерЗаписи.Контрагент  = Объект.Контрагент;
	//	МенеджерЗаписи.Прочитать();
	//	Если МенеджерЗаписи.Выбран() Тогда
	//		ВидимостьЭлемента = МенеджерЗаписи.ОтображатьАдресМонтажаВШапкеДокумента;		
	//	КонецЕсли;
	//КонецЕсли;
	//-- №10128
	
	Элементы.АдресМонтажа.Видимость = Истина; // №10128 ВидимостьЭлемента;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	Объект.СтатьяДоходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщийМодульКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	ДополнительныеПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
	
	Отказ = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.НачислятьБонусы 
		И НЕ мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте Тогда
		
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеБонусовПодтверждениеПередЗаписью", ЭтотОбъект, ДополнительныеПараметры);
		БонусыКлиент.ПодтвердитьИзменениеСуммыБонусов(ОписаниеОповещения, Объект.СуммаБонусовКНачислениюПоДисконтнойКарте, мСуммаБонусов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеБонусовПодтверждениеПередЗаписью(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗаписи,, Истина);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьВидимостьЭлементовПоБонусам()
	
	ЕстьБонусыНачислено = ?((Объект.Товары.Итог("БонусыКНачислению") + Объект.Услуги.Итог("БонусыКНачислению")) > 0 , Истина, Ложь);
	ЕстьБонусыСписано = ?((Объект.Товары.Итог("СкидкаБонусами") + Объект.Услуги.Итог("СкидкаБонусами")) > 0 , Истина, Ложь);
	
	ИспользоватьБонусы = Объект.СлужебныйУчитыватьБонусы ИЛИ Объект.НачислятьБонусы 
										ИЛИ ЕстьБонусыСписано ИЛИ ЕстьБонусыНачислено;  //#6699 
	Элементы.ГруппаБонусы.Видимость = ИспользоватьБонусы;
	
	//#13359
	БонусыСервер.НастройкаЭлементов(Элементы, Объект);
	
	Элементы.ГруппаБонусыНастройки.Видимость = ИспользоватьБонусы;
										
	Элементы.ГруппаБонусыТекущиеДанные.Видимость = Объект.СлужебныйУчитыватьБонусы;
	Элементы.ГруппаДисконтнаяКарта.Видимость = Объект.СлужебныйУчетБонусовПоДисконтнымКартам; //Константы.УчетБонусовПоДисконтнымКартам.Получить();
	
	Элементы.ТоварыСкидкаБонусами.Видимость = Объект.СлужебныйУчитыватьБонусы ИЛИ ЕстьБонусыСписано;
	Элементы.УслугиСкидкаБонусами.Видимость = Объект.СлужебныйУчитыватьБонусы ИЛИ ЕстьБонусыСписано;
		
	Элементы.ТоварыБонусыКНачислению.Видимость = Объект.НачислятьБонусы ИЛИ ЕстьБонусыНачислено;
	Элементы.УслугиБонусыКНачислению.Видимость = Объект.НачислятьБонусы ИЛИ ЕстьБонусыНачислено;
	
	Элементы.СуммаБонусовКНачислениюПоДисконтнойКарте.Видимость = Объект.НачислятьБонусы;
	
	Элементы.ГруппаБонусыТекущиеДанныеСписать.Видимость = Объект.СписыватьБонусы; // №13299
	
КонецПроцедуры

&НаКлиенте
Процедура СлужебныйВидБонуснойСистемыПриИзменении(Элемент)
	СлужебныйВидБонуснойСистемыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СлужебныйВидБонуснойСистемыПриИзмененииНаСервере()
	
	//#13359
	БонусыСервер.НастройкаЭлементов(Элементы, Объект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФункциональнуюОпциюНаСервере(ИмяФункциональнойОпции)
	Возврат ПолучитьФункциональнуюОпцию(ИмяФункциональнойОпции);
КонецФункции

&НаСервере
Процедура ПересчитатьБонусыПоДокументу()
	
	//++ №13299
	//ДокументОбъект = РеквизитФормыВЗначение("Объект");
	//ДокументОбъект.ПересчитатьБонусыПоДокументу();
	//ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	БонусыСервер.ПересчитатьБонусыПоДокументу(Объект, Истина);
	//-- №13299
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеДокумента()
	
	СуммаДокументаВрем = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	Если НЕ Объект.СуммаДокумента = СуммаДокументаВрем Тогда
		Объект.СуммаДокумента = СуммаДокументаВрем;
	КонецЕсли;
		
	//цены на потолки, товары, услуги и услуги кроя задаются в заказе на производство
	Если ТипЗнч(Объект.Основание) = ТипЗнч(Документы.ЗаказНаПроизводство.ПустаяСсылка()) Тогда
		Элементы.ВидЦен.Видимость = Ложь;
	КонецЕсли;
	
	//ОбновитьВидимостьИОстаткиВзаиморасчетов();
	
	//#12364 изменено на кнопку
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	//ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	//ОбщийМодульСервер.ЕстьИндивидуальныеЦеныКонтрагентаНаФорме(Объект.Дата, Объект.Контрагент, Объект.ДоговорКонтрагента, Элементы.ЕстьИндивидуальныеЦены);
	//ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию, Элементы.ЕстьИндивидуальныеЦены);
	
	//Элементы.ЗаполнитьДокументПоЗаказуПокупателя.Видимость = (ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") И ЗначениеЗаполнено(Объект.Основание));
	
	//посчитаем сумму документа без учета бонусов
	СуммаДокументаБезУчетаБонусов = 0;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		СуммаДокументаБезУчетаБонусов = СуммаДокументаБезУчетаБонусов + (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена - ТекущаяСтрока.СуммаРучнойСкидки);
	КонецЦикла;
	Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
		СуммаДокументаБезУчетаБонусов = СуммаДокументаБезУчетаБонусов + (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена - ТекущаяСтрока.СуммаРучнойСкидки);
	КонецЦикла;
	
	//визуальные элементы
	БонусыСервер.ОпределитьОстатокПоДисконтнойКарте(ЭтаФорма);
	ДоступноПоДисконтнойКарте = Мин(МаксимальныйРазмерБонусовКСписаниюПоДокументу() / 100 * СуммаДокументаБезУчетаБонусов, ОстатокПоДисконтнойКарте);
		
	//Элементы.ГруппаОснования.Видимость = Объект.ГрупповаяОтгрузка;
	//Элементы.ГруппаОснования.Заголовок = "Основания (" + Формат(Объект.Основания.Количество(),"ЧГ=") + ")";
	
	// №1083 видимость определенных таблиц по выработке
	//ОбщийМодульСервер.ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог(ЭтаФорма);
		
КонецПроцедуры

&НаСервере
Процедура ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог() Экспорт
	
	// №1083 видимость определенных таблиц по выработке
	ОбщийМодульСервер.ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(ДанныеСтроки) 
	
	Возврат ЦеныКомпании.ПолучитьЦенуНоменклатуры(ДанныеСтроки.Номенклатура, ДанныеСтроки.ХарактеристикаНоменклатуры, ДанныеСтроки.ЕдиницаИзмерения, ДанныеСтроки.Количество,
										     	  ДанныеСтроки.Дата, ДанныеСтроки.ВидЦен, ДанныеСтроки.Валюта,
												  ДанныеСтроки.Организация, ДанныеСтроки.Подразделение,
												  ДанныеСтроки.Контрагент, ДанныеСтроки.ДоговорКонтрагента);
		
КонецФункции

&НаКлиенте
Функция ПересчитатьЦеныПоВидуЦен()
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(ТекущаяСтрока);
		ТекущаяСтрока.Цена = ПолучитьЦенуНоменклатуры(СтруктураДанные); //ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения);
		//ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		//
		//Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда 
		//	//НАЧАЛО переход на 2,0
		//	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		//	//округлим стоимость потолка и пересчитаем цену по факту
		//	//ТекущаяСтрока.Сумма = ОбщийМодуль.ОкруглитьЧисло(ТекущаяСтрока.Количество * ТекущаяСтрока.Цена,Объект.ВидЦен.ПорядокОкругленияСтоимостиПроизводимыхПотолков,Объект.ВидЦен.ОкруглятьВБольшуюСторонуСтоимостьПроизводимыхПотолков);
		//	//Если НЕ ТекущаяСтрока.Количество = 0 Тогда
		//	//	ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма /  ТекущаяСтрока.Количество;
		//	//КонецЕсли;
		//	//КОНЕЦ переход на 2,0
		//КонецЕсли;
		////РассчитатьСуммуНДСТабЧасти
		ТекущаяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
		//ТекущаяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТекущаяСтрока.Сумма, УчитыватьНДС, , УчетНДС.ПолучитьСтавкуНДС(ТекущаяСтрока.СтавкаНДС));
		
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока);
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
		
	КонецЦикла;

	Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(ТекущаяСтрока, "Услуги");
		ТекущаяСтрока.Цена = ПолучитьЦенуНоменклатуры(СтруктураДанные); //ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения);
		//ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		//РассчитатьСуммуНДСТабЧасти
		ТекущаяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
		//ТекущаяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТекущаяСтрока.Сумма, УчитыватьНДС, , УчетНДС.ПолучитьСтавкуНДС(ТекущаяСтрока.СтавкаНДС));
		
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока);
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	КонецЦикла;

	РассчитатьИтоговыеПоказателиСервер();
	//ОбновитьДанныеДокумента();
	
КонецФункции

&НаКлиенте 
Функция СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ИмяТаблицы = "Товары")
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",			ИмяТаблицы);
	СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 	СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 			СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 				Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	СтруктураДанные.Вставить("Организация",			Объект.Организация);
	СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	СтруктураДанные.Вставить("Контрагент",			Объект.Контрагент);
	СтруктураДанные.Вставить("ДоговорКонтрагента", 	Объект.ДоговорКонтрагента);
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);

	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция СтруктураДанныхПоСтрокеТабличнойЧастиСервер(СтрокаТабличнойЧасти, ИмяТаблицы = "Товары")
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",			ИмяТаблицы);                          //#2792
	СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);  //#2792
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 	СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 			СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 				Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	СтруктураДанные.Вставить("Организация",			Объект.Организация);
	СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	СтруктураДанные.Вставить("Контрагент",			Объект.Контрагент);
	СтруктураДанные.Вставить("ДоговорКонтрагента", 	Объект.ДоговорКонтрагента);
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные)
	
	ОбщиеДанныеНоменклатуры = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ОбщиеДанныеНоменклатуры, СтруктураДанные);
	ОбщиеДанныеНоменклатуры = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(ОбщиеДанныеНоменклатуры);
	
	СтруктураДанные.Вставить("СтатьяДоходов",  ОбщиеДанныеНоменклатуры.СтатьяДоходов);
	СтруктураДанные.Вставить("СтатьяРасходов", ОбщиеДанныеНоменклатуры.СтатьяРасходов);

	Цена = ПолучитьЦенуНоменклатуры(СтруктураДанные);	
	СтруктураДанные.Вставить("Цена", Цена);
	
	Если ТипЗнч(СтруктураДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтруктураДанные.Вставить("Коэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("Коэффициент", ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтруктураДанные.ЕдиницаИзмерения));
	КонецЕсли;
		
	Если СтруктураДанные.ИспользоватьКонтрольКратности 
		И НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешитьНесоответствиеКратностиЕдиницИзмерения") Тогда
		
		СтруктураПоиска = Новый Структура("ВидДокумента, ЕдиницаИзмерения", Перечисления.ВидыДокументовПроверкиКратности.РеализацияТоваровИУслуг, СтруктураДанные.ЕдиницаИзмерения);
		НайденныеСтроки = СтруктураДанные.Номенклатура.Кратность.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда		
			СтруктураДанные.Вставить("Количество", 0); //#2792
		Иначе
			СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
		КонецЕсли;
	Иначе
		СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция ПодобратьНоменклатуруПродукцияНаСервере(ПродукцияНомерРасчета, ПродукцияЦвет)
	
	НаименованиеНоменклатурыДляПоиска = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(ПродукцияНомерРасчета, ПродукцияЦвет, ПродукцияЦвет.Владелец);
	ГруппаНоменклатурыДляПоиска = Константы.ГруппаНоменклатурыПродукция.Получить();
	
	ИскомаяНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеНоменклатурыДляПоиска, Истина, ГруппаНоменклатурыДляПоиска);
	Возврат ИскомаяНоменклатура;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруПотолкаПоВыпускуПродукцииПоЗаказуНаПроизводство(ЗаказНаПроизводство)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОбороты.Номенклатура
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, ) КАК ТоварыНаСкладахОбороты
	|ГДЕ
	|	ТоварыНаСкладахОбороты.Регистратор.Основание = &Основание
	|	И ТоварыНаСкладахОбороты.КоличествоПриход > 0";
	Запрос.УстановитьПараметр("Основание", ЗаказНаПроизводство);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Номенклатура;
	КонецЦикла;
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПолучитьСписокВидовНоменклатурыТовары()
	
	Возврат Справочники.Номенклатура.ПолучитьСписокВидовНоменклатурыТовары();
	
КонецФункции

&НаСервере
Процедура ПересчитатьЦенуИСуммуНоменклатурыВСтрокеПоВалюте(НомерСтроки)
	ТекущаяСтрока = Объект.Товары[НомерСтроки-1];
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Если НЕ ВалютаУчета = Объект.Валюта Тогда
		ДатаДокумента = Объект.Дата;
		Если ДатаДокумента = Дата(1,1,1) Тогда
			ДатаДокумента = ТекущаяДатаСеанса();
		КонецЕсли;
		ТекущаяСтрока.Цена = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, Объект.Валюта, ДатаДокумента, ТекущаяСтрока.Цена);
		СуммаСтроки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		//ТекущаяСтрока.Сумма = СуммаСтроки - (СуммаСтроки * (ТекущаяСтрока.ПроцентРучнойСкидки / 100)) - ТекущаяСтрока.СуммаРучнойСкидки;
		ТекущаяСтрока.Сумма = СуммаСтроки - ТекущаяСтрока.СуммаРучнойСкидки;
		ТекущаяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
		ТекущаяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТекущаяСтрока.Сумма, УчитыватьНДС, , УчетНДС.ПолучитьСтавкуНДС(ТекущаяСтрока.СтавкаНДС));	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗапретРедактированияЦен()
	Возврат ОбщийМодульСервер.НастройкаПользователя("ДополнительныеПраваЗапретРедактированияЦенВДокументах");	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, ПерезаполнитьЦены = Ложь)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение, ПерезаполнитьЦены);
	 	
	ЗаполнитьОстаткиПоТоварам();
	РассчитатьИтоговыеПоказателиКлиент();
	
	Если ИспользоватьБонусы Тогда
		ПересчитатьБонусыПоДокументу(); // №13299
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение, ПерезаполнитьЦены)
		
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл		
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
		НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчитыватьНДС, , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		
		Если ПерезаполнитьЦены Тогда
			СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧастиСервер(НоваяСтрока);
			СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанные, "Цена"); 
			
			ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НоваяСтрока, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
			ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
		КонецЕсли;
		//ПересчитатьЦенуИСуммуНоменклатурыВСтрокеПоВалюте(НоваяСтрока.НомерСтроки); //-- #7698
	КонецЦикла;	
	
	//РассчитатьИтоговыеПоказатели();
	//ОбновитьДанныеДокумента();
	//ПересчитатьБонусыПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПересчетеЦен(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПересчитатьЦеныПоВидуЦен();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОПересчетеЦен()
	
	Если Объект.Товары.Количество() > 0 ИЛИ Объект.Услуги.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПересчетеЦен", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Изменился вид цен или валюта документа. Пересчитать цены товаров и услуг?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МаксимальныйРазмерБонусовКСписаниюПоДокументу()
	
	Возврат Константы.МаксимальныйРазмерБонусовКСписаниюПоДокументу.Получить();
	
КонецФункции

&НаКлиенте
Процедура ОтчетДетализацияВзаиморасчетов(Команда)
	ПараметрыОтчета = Новый Структура("Отбор, СформироватьПриОткрытии", 
                                    Новый Структура("Контрагент", Объект.Контрагент), 
                                    Истина);
	//ПараметрыОтчета = Новый Структура;
	//ПараметрыОтчета.Вставить("Контрагент",Объект.Контрагент);
	ОткрытьФорму("Отчет.ДетализацияВзаиморасчетовСКонтрагентом.Форма",ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиЗаявкуНаДоставку(Команда)
	ПараметрыНовогоДокумента = Новый Структура;
	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.ЗаявкаНаДоставку.Форма.ФормаДокумента", ПараметрыНовогоДокумента);
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИОстаткиВзаиморасчетов()
	
	Если Объект.Контрагент.Пустая() Тогда
		//Элементы.ГруппаТекущийДолг.Видимость = Ложь;
		Элементы.ГруппаДолги.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьСтоимостьЗаказовВРаботе(Объект.Контрагент, Объект.Валюта, ТекущаяДатаСеанса()) +    //nva
			ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);		
		//Элементы.ГруппаТекущийДолг.Видимость = Истина;
		Элементы.ГруппаДолги.Видимость = Истина;
		//ВалютаУчета = Константы.ВалютаУчета.Получить();
		Элементы.ДекорацияНадписьВалютаДолга1.Заголовок = ВалютаУчета;		
	КонецЕсли;
	
	Если РаботаСВалютой.ОтображатьЗадолженностьКонтрагентаВВалюте() Тогда
		Элементы.ГруппаТекущийДолгвВалюте.Видимость = Истина;
		Элементы.ДекорацияДолгВВалюте.Заголовок = РаботаСВалютой.ПолучитьТекстНадписиДолгаКонтрагентаВВалютеОтображенияЗадолженности(, Объект.Контрагент, Объект.Организация);
	Иначе
		Элементы.ГруппаТекущийДолгвВалюте.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

//nva+++
&НаСервереБезКонтекста
Функция ПолучитьСтоимостьЗаказовВРаботе(Знач Контрагент, Знач ВалютаДокумента, Дата)
	
	ТекущийСтатус = Новый СписокЗначений;
	ТекущийСтатус.Добавить(Справочники.СтатусыЗаказовПокупателей.ВРаботе);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗаказыПокупателей.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ЗаказыПокупателей.ЗаказНаПроизводство.Валюта КАК Валюта,
	//|	ЗаказыПокупателей.ЗаказНаПроизводство.ТекущийСтатус КАК ТекущийСтатус,
	//|	ЗаказыПокупателей.ЗаказНаПроизводство.СуммаДокумента КАК СуммаДокумента,
	//|	ЗаказыПокупателей.ЗаказНаПроизводство.Комментарий КАК Комментарий,
	|	ЗаказыПокупателей.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			&ТекущаяДата,
	|			ЗаказНаПроизводство.Контрагент = &Контрагент
	|				И ЗаказНаПроизводство.ТекущийСтатус В (&ТекущийСтатус)) КАК ЗаказыПокупателей";
	Запрос.УстановитьПараметр("ТекущаяДата",КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ТекущийСтатус",ТекущийСтатус);
	
	// №7373 сумму долга показываем в валюте текущего документа, если валюта отличается от валюты учета
	//ОжидаемаяСумма = Запрос.Выполнить().Выгрузить().Итог("СуммаДокумента");
	ОжидаемаяСумма = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПересчитаннаяСумма = Выборка.СуммаОстаток; //Выборка.СуммаДокумента;
		Если НЕ ВалютаДокумента = Выборка.Валюта Тогда
			ПересчитаннаяСумма = Окр(РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Выборка.Валюта, ВалютаДокумента, Дата, ПересчитаннаяСумма), 2);
		КонецЕсли;
		ОжидаемаяСумма = ОжидаемаяСумма + ПересчитаннаяСумма;
	КонецЦикла;	
	
	Возврат ОжидаемаяСумма;
	
КонецФункции
//nva---

&НаСервереБезКонтекста
Функция ПолучитьТекущийДолгКлиента(Знач Организация, Знач Контрагент, Знач Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			Договор = &Договор
	|				И Контрагент = &Контрагент
	|				И Организация = &Организация) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Процедура ПерезаполнитьТаблицыТоваровУслуг()
	
	ТаблицаТоваров = Объект.Товары.Выгрузить();
	ТаблицаУслуг = Объект.Услуги.Выгрузить();
		
	ВремСписокОснований = Новый СписокЗначений;
	ВремСписокОснований.Добавить(Объект.Основание);
	
	ВремТаблицаТоваров = ТаблицаТоваров.Скопировать();
	ВремТаблицаТоваров.Свернуть("Заказ",);
	ВремТаблицаУслуг = ТаблицаУслуг.Скопировать();
	ВремТаблицаУслуг.Свернуть("Заказ",);
	Для Каждого ТекущаяСтрока Из ВремТаблицаТоваров Цикл
		Если НЕ ТекущаяСтрока.Заказ = Неопределено Тогда
			Если НЕ ТекущаяСтрока.Заказ.Пустая() Тогда
				ВремСписокОснований.Добавить(ТекущаяСтрока.Заказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекущаяСтрока Из ВремТаблицаУслуг Цикл
		Если НЕ ТекущаяСтрока.Заказ = Неопределено Тогда
			Если НЕ ТекущаяСтрока.Заказ.Пустая() Тогда
				ВремСписокОснований.Добавить(ТекущаяСтрока.Заказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейОстатки.ЗаказНаПроизводство КАК Заказ,
	|	ЗаказыПокупателейОстатки.Номенклатура,
	|	ЗаказыПокупателейОстатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказНаПроизводство В (&ЗаказНаПроизводство)) КАК ЗаказыПокупателейОстатки";
	
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", ВремСписокОснований);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Объект.Товары.Очистить();
		Объект.Услуги.Очистить();
		Выборка = РезультатЗапроса.Выгрузить();
		                                                                      
		Для Каждого СтрокаТовара из ТаблицаТоваров Цикл
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("Номенклатура",СтрокаТовара.Номенклатура);
			Если СтрокаТовара.Заказ = Неопределено Тогда
				ПараметрыПоиска.Вставить("Заказ",ВремСписокОснований[0].Значение);
			ИначеЕсли СтрокаТовара.Заказ.Пустая() Тогда
				ПараметрыПоиска.Вставить("Заказ",ВремСписокОснований[0].Значение);
			Иначе
				ПараметрыПоиска.Вставить("Заказ",СтрокаТовара.Заказ);
			КонецЕсли;
			
			НайденныйТовар = Выборка.НайтиСтроки(ПараметрыПоиска);
			Если НайденныйТовар.Количество() > 0 Тогда
				НоваяСтрока = Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТовара,,"Количество, Сумма");
				НоваяСтрока.Количество = Мин(НайденныйТовар[0].Остаток, СтрокаТовара.Количество);
				//НоваяСтрока.Сумма = (НоваяСтрока.Количество * НоваяСтрока.Цена) - ((НоваяСтрока.Количество * НоваяСтрока.Цена) * (НоваяСтрока.ПроцентРучнойСкидки / 100)) - НоваяСтрока.СуммаРучнойСкидки;
				Если НЕ НайденныйТовар[0].Остаток = СтрокаТовара.Количество Тогда
					НоваяСтрока.Сумма = (НоваяСтрока.Количество * НоваяСтрока.Цена) - НоваяСтрока.СуммаРучнойСкидки;
				Иначе
					//количество могло остаться не изменным, поэтому и сумму возьмем из основания, т.к. на нее могли быть наложены ручные скидки
					НоваяСтрока.Сумма = СтрокаТовара.Сумма;
				КонецЕсли;
				НоваяСтрока.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);
				НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация), , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаТовара из ТаблицаУслуг Цикл
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("Номенклатура",СтрокаТовара.Номенклатура);
			ПараметрыПоиска.Вставить("Заказ",СтрокаТовара.Заказ);
			
			НайденныйТовар = Выборка.НайтиСтроки(ПараметрыПоиска);
			Если НайденныйТовар.Количество() > 0 Тогда
				НоваяСтрока = Объект.Услуги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТовара,,"Количество, Сумма");
				НоваяСтрока.Количество = Мин(НайденныйТовар[0].Остаток, СтрокаТовара.Количество);
				НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
				НоваяСтрока.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);
				НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация), , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
			КонецЕсли;
		КонецЦикла; 		
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	Элементы.ЗаполнитьДокументПоЗаказуПокупателя.Видимость = (ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") И ЗначениеЗаполнено(Объект.Основание));
	//#7805
	УправлениеВидимостьюАдресаМонтажа();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументПоЗаказуПокупателяНаСервере()
	
	//ТекущийОбъект = Объект.Ссылка.ПолучитьОбъект();
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.Товары.Очистить();		
	ТекущийОбъект.Услуги.Очистить();
	ТекущийОбъект.Заполнить(Объект.Основание);
	//ДокОбъект.Записать();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументПоЗаказуПокупателя(Команда)
	//Если Объект.Ссылка.Пустая() Тогда
	//	ПоказатьПредупреждение(,"Документ предварительно необходимо записать");
	//	Возврат;
	//КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОЗаполненииПоЗаказу", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Документ будет очищен и перезаполнен. Продолжить?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОЗаполненииПоЗаказу(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДокументПоЗаказуПокупателяНаСервере();
	//ОбновитьДанныеДокумента();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтоговыеПоказателиКлиент()
	
	ИтогСумма = 0;
	РассчитатьИтоговыеПоказатели(Объект.Товары, Объект.Услуги, ИтогСумма, ИтогСуммаНДС, СуммаДокументаБезУчетаБонусов);
	Если НЕ Объект.СуммаДокумента = ИтогСумма Тогда
		Объект.СуммаДокумента = ИтогСумма;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоговыеПоказателиСервер()
	
	ИтогСумма = 0;
	РассчитатьИтоговыеПоказатели(Объект.Товары, Объект.Услуги, ИтогСумма, ИтогСуммаНДС, СуммаДокументаБезУчетаБонусов);
	Если НЕ Объект.СуммаДокумента = ИтогСумма Тогда
		Объект.СуммаДокумента = ИтогСумма;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказатели(ТаблицаТоваров, ТаблицаУслуг, ИтогСумма, ИтогСуммаНДС, ИтогСуммаДокументаБезУчетаБонусов)

	ИтогСумма = 0;
	ИтогСуммаНДС = 0;
	ИтогСуммаДокументаБезУчетаБонусов = 0;
	
	Для каждого СтрокаТабличнойЧасти из ТаблицаТоваров Цикл
		ИтогСумма = ИтогСумма + СтрокаТабличнойЧасти.Сумма;
		ИтогСуммаНДС = ИтогСуммаНДС + СтрокаТабличнойЧасти.СуммаНДС;
		
		ИтогСуммаДокументаБезУчетаБонусов = ИтогСуммаДокументаБезУчетаБонусов + (СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена - СтрокаТабличнойЧасти.СуммаРучнойСкидки);
	КонецЦикла;
	Для каждого СтрокаТабличнойЧасти из ТаблицаУслуг Цикл
		ИтогСумма = ИтогСумма + СтрокаТабличнойЧасти.Сумма;
		ИтогСуммаНДС = ИтогСуммаНДС + СтрокаТабличнойЧасти.СуммаНДС;
		
		ИтогСуммаДокументаБезУчетаБонусов = ИтогСуммаДокументаБезУчетаБонусов + (СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена - СтрокаТабличнойЧасти.СуммаРучнойСкидки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизации(ИзменятьСтавку = Истина)
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
	СтавкаНДСПоУмолчанию = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);
	
	Элементы.ТоварыСуммаНДС.Видимость 	= УчитыватьНДС;
	Элементы.ТоварыСтавкаНДС.Видимость 	= УчитыватьНДС;
	Элементы.УслугиСуммаНДС.Видимость 	= УчитыватьНДС;
	Элементы.УслугиСтавкаНДС.Видимость 	= УчитыватьНДС;
	
	Элементы.ИтогСуммаНДС.Видимость 	= УчитыватьНДС;	
	
	Если ИзменятьСтавку Тогда
		Для каждого СтрокаТабличнойЧасти из Объект.Товары Цикл
			СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
			ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);	
		КонецЦикла;
		Для каждого СтрокаТабличнойЧасти из Объект.Услуги Цикл
			СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
			ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);	
		КонецЦикла;
		РассчитатьИтоговыеПоказателиСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеОрганизацииПриИзменении()
	
	СтавкаНДСПоУмолчанию = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);
	
	Объект.Руководитель = Объект.Организация.Руководитель;
	Объект.ГлавныйБухгалтер = Объект.Организация.ГлавныйБухгалтер;
	
КонецПроцедуры

&НаСервере
Функция ЭтоПотолокИлиОтрез(ПозицияНоменклатуры)
	Возврат Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ПозицияНоменклатуры);
КонецФункции

&НаКлиенте
Процедура ПолучитьКонтрагентаПоДисконтнойКарте(Команда)
	ОП = Новый ОписаниеОповещения("ПослеПолученияКонтрагентаПоДисконтнойКарте", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ПолучитьКонтрагентаПоДисконтнойКарте",,,,,,ОП);
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияКонтрагентаПоДисконтнойКарте(ПараметрыВозврата, ДопПараметры) Экспорт
	
	Если НЕ ПараметрыВозврата = Неопределено Тогда
		КонтрагентИзменился = (НЕ Объект.Контрагент = ПараметрыВозврата.Контрагент);
		Объект.Контрагент = ПараметрыВозврата.Контрагент;
		Объект.ДисконтнаяКарта = ПараметрыВозврата.ДисконтнаяКарта;
		
		Если КонтрагентИзменился Тогда
			КонтрагентПриИзмененииКлиент();
			//УстановитьВидЦенНаОснованииДоговора(); // это уже имеется в КонтрагентПриИзмененииКлиент
			//ЗадатьВопросОПересчетеЦен();
		КонецЕсли;		
		ОбновитьДанныеДокумента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДисконтнаяКартаПриИзменении(Элемент)
	Объект.СуммаБонусовКСписаниюПоДисконтнойКарте = 0;
	ОчиститьСуммуБонусовПоСтрокамДокумента();
	ОбновитьДанныеДокумента();
	ПересчитатьБонусыПоДокументу();
КонецПроцедуры

&НаСервере
Процедура ОчиститьСуммуБонусовПоСтрокамДокумента()
	
	//++ №13299
	//ДокументОбъект = РеквизитФормыВЗначение("Объект");
	//ДокументОбъект.ОчиститьСуммуБонусовПоСтрокамДокумента();
	//ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	БонусыСервер.ОчиститьСуммуБонусовПоСтрокамДокумента(Объект);
	//-- №13299
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаБонусовКСписаниюПоДисконтнойКартеПриИзменении(Элемент)
	
	//Если Объект.СуммаБонусовКСписаниюПоДисконтнойКарте = 0 Тогда
	//	ОчиститьСуммуБонусовПоСтрокамДокумента();
	//Иначе
	//	
	//	Если Объект.СуммаБонусовКСписаниюПоДисконтнойКарте > ОстатокПоДисконтнойКарте Тогда
	//		ПоказатьПредупреждение(,"Остаток бонусов по карте " + ОстатокПоДисконтнойКарте + " " + ВалютаУчета + ", нельзя списать больше этой суммы");
	//		Объект.СуммаБонусовКСписаниюПоДисконтнойКарте = 0;
	//		ОчиститьСуммуБонусовПоСтрокамДокумента();
	//	ИначеЕсли Объект.СуммаБонусовКСписаниюПоДисконтнойКарте > ДоступноПоДисконтнойКарте Тогда
	//		ПоказатьПредупреждение(,"Согласно настроек программы нельзя списать более " + ДоступноПоДисконтнойКарте + " " + ВалютаУчета + " бонусов по данному документу");
	//		Объект.СуммаБонусовКСписаниюПоДисконтнойКарте = 0;
	//		ОчиститьСуммуБонусовПоСтрокамДокумента();
	//	ИначеЕсли Объект.СуммаБонусовКСписаниюПоДисконтнойКарте > РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Объект.Ссылка, СуммаДокументаБезУчетаБонусов) Тогда
	//		ПоказатьПредупреждение(,"Сумма всего документа (в валюте учета) " + РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Объект.Ссылка, Объект.СуммаДокумента) + " " + ВалютаУчета + ", нельзя списать больше этой суммы");
	//		Объект.СуммаБонусовКСписаниюПоДисконтнойКарте = 0;
	//		ОчиститьСуммуБонусовПоСтрокамДокумента();
	//	Иначе
	//		//распределяем скидку, пересчитываем строки и сумму документа
	//		РаспределитьСкидкуБонусамиПоСтрокамДокумента();
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//ПересчитатьБонусыПоДокументу();
	
	СуммаБонусовКСписаниюПоДисконтнойКартеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СуммаБонусовКСписаниюПоДисконтнойКартеПриИзмененииНаСервере()

	СтруктураИзменения = БонусыСервер.СуммаБонусовКСписаниюПриИзменении(Объект, ВалютаУчета, 
																		ОстатокПоДисконтнойКарте, ДоступноПоДисконтнойКарте, СуммаДокументаБезУчетаБонусов);

	Если СтруктураИзменения.ВыполненоРаспределение Тогда
		ПересчитатьБонусыПоДокументу(); 	

	ИначеЕсли СтруктураИзменения.ВыполненаОчистка ИЛИ СтруктураИзменения.ВыполненПересчет Тогда
		ОбновитьДанныеДокумента();
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура РаспределитьСкидкуБонусамиПоСтрокамДокумента()
//	
//	//++ №13299
//	//ДокументОбъект = РеквизитФормыВЗначение("Объект");
//	//ДокументОбъект.РаспределитьСкидкуБонусамиПоСтрокамДокумента();
//	//ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
//	БонусыСервер.РаспределитьСкидкуБонусамиПоСтрокамДокумента(Объект);
//	//-- №13299
//	
//	ПересчитатьБонусыПоДокументу();
//	
//КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиПоТоварам()
	
	ДатаОстатков = ?(НЕ Объект.Ссылка.Пустая(), Объект.Дата, ТекущаяДатаСеанса());
	ЗапасыСервер.ЗаполнитьОстаткиПоТоварамВТЧ(Объект.Товары, Объект.Организация, Объект.Склад, ДатаОстатков);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповаяОтгрузкаПриИзменении(Элемент)
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаСервере
Функция	ЭтоПотолокИУНегоЕстьУслугиВТЧ(ВыделенныеСтроки, СписокПотолков, СписокПозицийКУдалению)
	
	УсловиеВыполнено = Ложь;
	
	Для Каждого НомерСтроки Из ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
	
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			
			СписокПотолков.Добавить(ТекущаяСтрока.Номенклатура);
			
			Для Каждого СтрокаТовар Из Объект.Товары Цикл
				Если СтрокаТовар.Потолок = ТекущаяСтрока.Номенклатура И НЕ СтрокаТовар.Потолок.Пустая() И НЕ СтрокаТовар.Номенклатура = ТекущаяСтрока.Номенклатура Тогда
					УсловиеВыполнено = Истина;	
					СтрокаТоварНомерСтроки = ?(СтрокаТовар.НомерСтроки > ТекущаяСтрока.НомерСтроки, СтрокаТовар.НомерСтроки - 1, СтрокаТовар.НомерСтроки);  
					СписокПозицийКУдалению.Добавить(новый Структура("ТЧ, НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры, Потолок", 
																	"Товары", СтрокаТоварНомерСтроки, СтрокаТовар.Номенклатура, СтрокаТовар.ХарактеристикаНоменклатуры, ТекущаяСтрока.Номенклатура));
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого СтрокаУслуга Из Объект.Услуги Цикл
				Если СтрокаУслуга.Потолок = ТекущаяСтрока.Номенклатура И НЕ СтрокаУслуга.Потолок.Пустая() И НЕ СтрокаУслуга.Номенклатура = ТекущаяСтрока.Номенклатура Тогда
					УсловиеВыполнено = Истина;				
					СписокПозицийКУдалению.Добавить(новый Структура("ТЧ, НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры, Потолок", 
																	"Услуги", СтрокаУслуга.НомерСтроки, СтрокаУслуга.Номенклатура, СтрокаУслуга.ХарактеристикаНоменклатуры, ТекущаяСтрока.Номенклатура));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат УсловиеВыполнено;
	
КонецФункции

&НаКлиенте
Процедура ПослеВопросаОУдаленииТоваровУслугПоПотолку(Ответ, ДопПараметры) ЭКСПОРТ
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Потолок Из ДопПараметры.Потолки Цикл
		
		КоличествоСтрок = Объект.Товары.Количество();
		Для Индекс = 1 По КоличествоСтрок Цикл 
			СтрокаТЧ = Объект.Товары[КоличествоСтрок - Индекс];
			Если СтрокаТЧ.Потолок = Потолок.Значение И НЕ СтрокаТЧ.Потолок.Пустая() Тогда
				Объект.Товары.Удалить(СтрокаТЧ);		
			КонецЕсли;
		КонецЦикла;
		КоличествоСтрок = Объект.Услуги.Количество();
		Для Индекс = 1 По КоличествоСтрок Цикл 
			СтрокаТЧ = Объект.Услуги[КоличествоСтрок - Индекс];
			Если СтрокаТЧ.Потолок = Потолок.Значение И НЕ СтрокаТЧ.Потолок.Пустая() Тогда
				Объект.Услуги.Удалить(СтрокаТЧ);		
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	РассчитатьИтоговыеПоказателиКлиент();
	//ОбновитьДанныеДокумента();
	
КонецПроцедуры
	
&НаСервере
Функция ПолучитьСписокПОтолковОснования()
	
	СписокПотолков = Новый СписокЗначений;
	
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Для Каждого СтрокаОснования из Объект.Основание.Товары Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаОснования.Номенклатура) Тогда
				СписокПотолков.Добавить(СтрокаОснования.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		Для Каждого СтрокаОснования из Объект.Основание.ТоварыУслуги Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаОснования.Номенклатура) Тогда
				СписокПотолков.Добавить(СтрокаОснования.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ТекущееОснование Из Объект.Основания Цикл
		Если ТипЗнч(ТекущееОснование.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Для Каждого СтрокаОснования из ТекущееОснование.Основание.Товары Цикл
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаОснования.Номенклатура) Тогда
					СписокПотолков.Добавить(СтрокаОснования.Номенклатура);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ТекущееОснование.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Для Каждого СтрокаОснования из ТекущееОснование.Основание.ТоварыУслуги Цикл
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаОснования.Номенклатура) Тогда
					СписокПотолков.Добавить(СтрокаОснования.Номенклатура);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокПотолков;
	
КонецФункции

&НаСервере
Процедура ВыборПотолкаДляЗаполненияПоОснованиюНаСервере(ВыбранныйПотолок)
	
	//удалим выбранный потолок и все что с ним связано из ТЧ Товары
	КопияТЧТовары = Объект.Товары.Выгрузить();
	Объект.Товары.Очистить();
	Для Каждого СтрокаКопии Из КопияТЧТовары Цикл
		Если СтрокаКопии.Номенклатура = ВыбранныйПотолок ИЛИ СтрокаКопии.Потолок = ВыбранныйПотолок Тогда
			продолжить;
		Иначе
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКопии);
		КонецЕсли;
	КонецЦикла;
	
	КопияТЧУслуги = Объект.Услуги.Выгрузить();
	Объект.Услуги.Очистить();
	Для Каждого СтрокаКопии Из КопияТЧУслуги Цикл
		Если СтрокаКопии.Номенклатура = ВыбранныйПотолок ИЛИ СтрокаКопии.Потолок = ВыбранныйПотолок Тогда
			продолжить;
		Иначе
			НоваяСтрока = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКопии);
		КонецЕсли;
	КонецЦикла;

	
	//добавим выбранный потолок и все его подчиненные строки из главного основания
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Для Каждого ТекСтрокаОснования Из Объект.Основание.Товары Цикл
			Если ТекСтрокаОснования.Номенклатура = ВыбранныйПотолок ИЛИ ТекСтрокаОснования.Потолок = ВыбранныйПотолок Тогда
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаОснования.Номенклатура) Тогда
					НоваяСтрока = Объект.Услуги.Добавить();
				Иначе
					НоваяСтрока = Объект.Товары.Добавить();
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		Для Каждого ТекСтрокаОснования Из Объект.Основание.ТоварыУслуги Цикл
			Если ТекСтрокаОснования.Номенклатура = ВыбранныйПотолок ИЛИ ТекСтрокаОснования.НомерПотолка = ВыбранныйПотолок.Потолок_НомерРасчета Тогда
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаОснования.Номенклатура) Тогда
					НоваяСтрока = Объект.Услуги.Добавить();
				Иначе
					НоваяСтрока = Объект.Товары.Добавить();
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//добавим выбранный потолок и все его подчиненные строки из прочих оснований
	Для Каждого ТекОснование Из Объект.Основания Цикл
		Если ТекОснование.Основание = Объект.Основание Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(ТекОснование.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Для Каждого ТекСтрокаОснования Из ТекОснование.Основание.Товары Цикл
				Если ТекСтрокаОснования.Номенклатура = ВыбранныйПотолок ИЛИ ТекСтрокаОснования.Потолок = ВыбранныйПотолок Тогда
					Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаОснования.Номенклатура) Тогда
						НоваяСтрока = Объект.Услуги.Добавить();
					Иначе
						НоваяСтрока = Объект.Товары.Добавить();
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ТекОснование.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Для Каждого ТекСтрокаОснования Из ТекОснование.Основание.ТоварыУслуги Цикл
				Если ТекСтрокаОснования.Номенклатура = ВыбранныйПотолок ИЛИ ТекСтрокаОснования.НомерПотолка = ВыбранныйПотолок.Потолок_НомерРасчета Тогда
					Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаОснования.Номенклатура) Тогда
						НоваяСтрока = Объект.Услуги.Добавить();
					Иначе
						НоваяСтрока = Объект.Товары.Добавить();
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма")  + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОснованииВозвратПродукции(Команда)
			
	ПараметрыФормы = Новый Структура;
	ДопПараметры = ПодготовитьСписокТоваровДляВыбораКВозврату();
	ПараметрыФормы.Вставить("СписокПотолков", ДопПараметры.СписокПотолков);
	ПараметрыФормы.Вставить("СписокУслуг",    ДопПараметры.СписокУслуг);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораТоваровКВозврату", ЭтаФорма);
	
	ОткрытьФорму("Документ.ВозвратПродукции.Форма.ФормаВыбораПотолковКВозврату", ПараметрыФормы,,,ВариантОткрытияОкна.ОтдельноеОкно,,ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьСписокТоваровДляВыбораКВозврату()
	Возврат Документы.ВозвратПродукции.ПодготовитьСписокТоваровДляВыбора(Объект.Ссылка);
КонецФункции

&НаКлиенте
Процедура ПослеВыбораТоваровКВозврату(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		
		Если Результат.Количество() > 0 Тогда			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("ДокументОснование", Объект.Ссылка);
			ПараметрыЗаполнения.Вставить("МассивТоваров", Результат);			
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);			
			ОткрытьФорму("Документ.ВозвратПродукции.Форма.ФормаДокумента", ПараметрыФормы);			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Параметр)
	
	СтруктураТовара = ОбщийМодульКлиент.ПолучитьНоменклатуруПоШтрихКоду(МенеджерОборудованияКлиентПереопределяемый.ПреобразоватьДанныеСоСканераВМассив(Параметр));
	
	Если НЕ СтруктураТовара.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда
		
		//Попробуем найти в ТЧ
		//СтруктураПоиска = новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", СтруктураТовара.Номенклатура, СтруктураТовара.ХарактеристикаНоменклатуры, СтруктураТовара.ЕдиницаИзмерения);
		СтруктураПоиска = новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения", СтруктураТовара.Номенклатура, СтруктураТовара.ХарактеристикаНоменклатуры, СтруктураТовара.СерияНоменклатуры, СтруктураТовара.ЕдиницаИзмерения);		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураТовара);
			//НоваяСтрока.Количество = 1;
			//Если ТипЗнч(НоваяСтрока.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			//	НоваяСтрока.Коэффициент = 1;
			//Иначе
			//	НоваяСтрока.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.ЕдиницаИзмерения);
			//КонецЕсли;
			//НоваяСтрока.Цена = ПолучитьЦенуНоменклатуры(НоваяСтрока.Номенклатура, НоваяСтрока.ХарактеристикаНоменклатуры, НоваяСтрока.ЕдиницаИзмерения);
			СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(НоваяСтрока);
			СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанные, "Коэффициент, Цена, Количество"); //#2792 добавлено Количество
						
			НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;			
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
			НоваяСтрока.Количество = НоваяСтрока.Количество + 1;
		КонецЕсли;	
		
		//НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчитыватьНДС, , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));		
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(НоваяСтрока);
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НоваяСтрока, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
		ПересчитатьЦенуИСуммуНоменклатурыВСтрокеПоВалюте(НоваяСтрока.НомерСтроки);		
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
		
		РассчитатьИтоговыеПоказателиКлиент();
		//ОбновитьДанныеДокумента();
		Если ИспользоватьБонусы Тогда
			ПересчитатьБонусыПоДокументу();
		КонецЕсли;
		ЗаполнитьОстаткиПоТоварам();        
		
		Модифицированность = Истина;
	Иначе
		Сообщить("Не удалось найти номенклатуру со штрих-кодом " + СтруктураТовара.ШтрихКод);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СлужебныйУчитыватьБонусыПриИзменении(Элемент)
	УстановитьВидимостьЭлементовПоБонусам();
КонецПроцедуры

#Область ОбработчикиВыработки

&НаКлиенте
Процедура РучнаяКорректировкаВыработкиПриИзменении(Элемент)
	
	ОбщийМодульКлиент.РучнаяКорректировкаВыработкиПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыработкуПоУстановленнымПравиламРасчета(Команда)
	
	ОбъектФормы = ЭтаФорма.Объект;
	ОбщийМодульВызовСервера.ЗаполнитьВыработкуВДокументе(ОбъектФормы);
	КопироватьДанныеФормы(ОбъектФормы, Объект);
	Модифицированность = Истина;
	
	//ОбновитьДанныеДокумента();
	ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаКоличествоПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСтоимостьВСтрокеТЧ(Элементы.ОбъектВыработка.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаЦенаПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСтоимостьВСтрокеТЧ(Элементы.ОбъектВыработка.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаСуммаПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьЦенуПоСтоимостиВСтрокеТЧ(Элементы.ОбъектВыработка.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ОбъектВыработка.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаВидНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидыИсполнителей = новый СписокЗначений;
	ОбщийМодульКлиент.СформироватьДанныеВыбораВидаИсполнителя(ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг"), ВидыИсполнителей, , Ложь);
	ОбщийМодульВызовСервера.СформироватьДанныеВыбораВидаНачисленияПоВидамИсполнителей(ДанныеВыбора, ВидыИсполнителей, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ОбъектВыработка.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаПриИзменении(Элемент)
	
	//ОбновитьДанныеДокумента();
	ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог()
	
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ВыработкаВыбор(Элемент, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПлановаяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ВыработкаПлановаяВыбор(Элемент, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

//++ №10663
&НаСервере
Процедура ЗаполнитьСсылкиНаДоставки()
	
	ОбщийМодульСервер.ЗаполнитьСсылкиНаДоставки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНаДоставкуНажатие(Элемент)
	
	// в названии элемента нужно найти номер в списке
	Позиция = СтрНайти(Элемент.Имя, "Номер_");
	
	Если Позиция = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		НомерСтроки = Число(Сред(Элемент.Имя, Позиция + 6));
	Исключение
		Возврат;
	КонецПопытки;
	
	Если НомерСтроки <= Доставки.Количество()-1 Тогда
		
		СсылкаНаДокумент = Доставки.Получить(НомерСтроки);
		ОткрытьФорму("Документ.ЗаявкаНаДоставку.ФормаОбъекта", новый Структура("Ключ", СсылкаНаДокумент.Значение));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСоздатьДоставкуНажатие(Элемент)
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		
		ОП = Новый ОписаниеОповещения("ПослеВопросаОЗаписиДокументаПередСозданиемДоставки", ЭтаФорма);
		ПоказатьВопрос(ОП, "Необходимо записать документ, продолжить?", РежимДиалогаВопрос.ДаНет, 30,, "Запись документа");
		
	Иначе
		
		ДекорацияСоздатьДоставкуНажатиеЗавершение();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОЗаписиДокументаПередСозданиемДоставки(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("РежимЗаписи",РежимЗаписиДокумента.Проведение);
	СтруктураЗаписи.Вставить("РежимПроведения",РежимПроведенияДокумента.Оперативный);
	
	Если Записать(СтруктураЗаписи) Тогда
		ДекорацияСоздатьДоставкуНажатиеЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСоздатьДоставкуНажатиеЗавершение()
	
	ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.ЗаявкаНаДоставку.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

//-- №10663

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьИндивидуальныеЦены(Команда)
	
	ОбщийМодульКлиент.ЕстьИндивидуальныеЦеныКонтрагента(Объект.Контрагент, Объект.Дата);
	
КонецПроцедуры

