Процедура ДобавитьЗаписьВЗвонкиЛида(Лид, Дата, ИДЗвонка, ИДВАТС = "", ИДСессииЗвонка="") Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗвонкиЛида.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Лид.Установить(Лид); 
	НаборЗаписей.Отбор.Дата.Установить(Дата); 
	НаборЗаписей.Отбор.ИДЗвонка.Установить(ИДЗвонка); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Лид = Лид; 
	НоваяЗапись.Дата = Дата;
	НоваяЗапись.ИДЗвонка = ИДЗвонка;
	НоваяЗапись.ИДСессии = ИДСессииЗвонка; //добавлено для OnlinePBX
	
	НоваяЗапись.ИДВАТС = ИДВАТС;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьЛидВРаботеПоИДЗвонка(ИДЗвонка) Экспорт
	
	СтатусыЛидовВРаботе = Новый СписокЗначений;
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.НазначитьЗамер);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОтложенныйНазначитьЗамер);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОформитьДоговор);
	
	Результат = Документы.Лид.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗвонкиЛида.Лид КАК Лид
	|ИЗ
	|	РегистрСведений.ЗвонкиЛида КАК ЗвонкиЛида
	|ГДЕ
	|	ЗвонкиЛида.Лид.ТекущийСтатус В(&ТекущийСтатус)
	|	И ЗвонкиЛида.ИДЗвонка ПОДОБНО &ИДЗвонка";
	Запрос.УстановитьПараметр("ИДЗвонка",ИДЗвонка);
	Запрос.УстановитьПараметр("ТекущийСтатус",СтатусыЛидовВРаботе);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Лид;
	КонецЦикла;
	
	Если Результат = Документы.Лид.ПустаяСсылка() Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗвонкиЛида.Лид КАК Лид
		|ИЗ
		|	РегистрСведений.ЗвонкиЛида КАК ЗвонкиЛида
		|ГДЕ
		|	ЗвонкиЛида.Лид.ТекущийСтатус В(&ТекущийСтатус)
		|	И ЗвонкиЛида.ИДСессии ПОДОБНО &ИДЗвонка";
		Запрос.УстановитьПараметр("ИДЗвонка",ИДЗвонка);
		Запрос.УстановитьПараметр("ТекущийСтатус",СтатусыЛидовВРаботе);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат = Выборка.Лид;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции