#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Процедура заполняет справочник по умолчанию
//
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	// Производство 
	ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.ЗаказПокупателя.ПолучитьОбъект();
	ВидОбъект.Производство = Истина;
	ВидОбъект.Записать();
	
	ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг.ПолучитьОбъект();
	ВидОбъект.Производство = Истина;
	ВидОбъект.Записать();
	
	ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции.ПолучитьОбъект();
	ВидОбъект.Производство = Истина;
	ВидОбъект.Записать();
	
	// Розница	
	ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.Лид.ПолучитьОбъект();
	ВидОбъект.Розница = Истина;
	ВидОбъект.Записать();
	
	ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.Монтаж.ПолучитьОбъект();
	ВидОбъект.Розница = Истина;
	ВидОбъект.Записать();
	
	//ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.Продажа.ПолучитьОбъект();
	//ВидОбъект.Розница = Истина;
	//ВидОбъект.Записать();
	//
	//ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.Рекламация.ПолучитьОбъект();
	//ВидОбъект.Розница = Истина;
	//ВидОбъект.Записать();
	//
	//ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.СервиснаяЗаявка.ПолучитьОбъект();
	//ВидОбъект.Розница = Истина;
	//ВидОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли