
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Периодичность.Видимость = Ложь;
	
	Если Параметры.ТипШаблона = "НомерЗаказДоговора" Тогда
		
		Элементы.Периодичность.Видимость = Истина;
		РедактируемыйШаблон = Параметры.ШаблонНомераДоговора;
		Периодичность = Параметры.ПериодичностьНомераДоговора;
		// заполнение вариантов шаблона	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныДляНомераДоговора.ИмяПредопределенныхДанных КАК Имя,
		|	ШаблоныДляНомераДоговора.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ШаблоныДляНомераДоговора КАК ШаблоныДляНомераДоговора
		|ГДЕ
		|	ШаблоныДляНомераДоговора.Предопределенный = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ШаблоныДляНомераДоговора.Код";
		
		РезультатЗапроса = Запрос.Выполнить();	
		Шаблоны.Загрузить(РезультатЗапроса.Выгрузить());
		
	ИначеЕсли Параметры.ТипШаблона = "ШаблонНаименованияПродукции" Тогда
		РедактируемыйШаблон = Параметры.Шаблон;
		
		НоваяСтрока = Шаблоны.Добавить();
		НоваяСтрока.Имя = "День"; 
		НоваяСтрока.Наименование = "День";
		
		НоваяСтрока = Шаблоны.Добавить();
		НоваяСтрока.Имя = "День2"; 
		НоваяСтрока.Наименование = "День с лидирующим нулем";
		
		НоваяСтрока = Шаблоны.Добавить();
		НоваяСтрока.Имя = "Месяц"; 
		НоваяСтрока.Наименование = "Месяц";
		
		НоваяСтрока = Шаблоны.Добавить();
		НоваяСтрока.Имя = "Месяц2"; 
		НоваяСтрока.Наименование = "Месяц с лидирующим нулем";
		
		НоваяСтрока = Шаблоны.Добавить();
		НоваяСтрока.Имя = "Год2"; 
		НоваяСтрока.Наименование = "Год (2 знака)";
		
		НоваяСтрока = Шаблоны.Добавить();
		НоваяСтрока.Имя = "Год4"; 
		НоваяСтрока.Наименование = "Год (4 знака)";
		
		НоваяСтрока = Шаблоны.Добавить();
		НоваяСтрока.Имя = "НаименованиеШаблона";
		НоваяСтрока.Наименование = "Наименование шаблона продукции";
		
		НоваяСтрока = Шаблоны.Добавить();
		НоваяСтрока.Имя = "ПрефиксВидаПродукции";
		НоваяСтрока.Наименование = "Префикс вида продукции";

		НоваяСтрока = Шаблоны.Добавить();
		НоваяСтрока.Имя = "НаименованиеВидаПродукции";
		НоваяСтрока.Наименование = "Наименование вида продукции";
		
		НоваяСтрока = Шаблоны.Добавить();
		НоваяСтрока.Имя = "НомерРасчета";
		НоваяСтрока.Наименование = "Номер расчета";
						
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// переносим выбранный элемент в шаблон
	РедактируемыйШаблон = РедактируемыйШаблон + "[" + Элемент.ТекущиеДанные.Имя + "]";
	ЭтаФорма.ТекущийЭлемент = Элементы.РедактируемыйШаблонНомераДоговора;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Отказ=Ложь;
	Если СокрЛП(РедактируемыйШаблон) = "" Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Не задан шаблон");
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПараметрОтвета = Новый Структура;
		ПараметрОтвета.Вставить("ПериодичностьНомераДоговора", Периодичность);
		ПараметрОтвета.Вставить("ШаблонНомера", РедактируемыйШаблон);
		ЭтаФорма.Закрыть(ПараметрОтвета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

