Функция ТекстОшибкиДополнительно(Дата1, Дата2)
	
	Если НачалоДня(Дата1) <> НачалоДня(Дата2) Тогда
		Возврат "Различаются даты документов. Требуется ручное исправление"	
	КонецЕсли;
	Возврат "";
	
КонецФункции

#Область РазныеПодразделенияВЗаказеНаПроизводствоИВВыпускеПродукции
//============================================== Разные подразделения в заказе на производство и в выпуске продукции (+)========================================

Функция ВыполнитьПроверку_РазныеПодразделенияЗаказНаПроизводствоИВыпускПродукции(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_РазныеПодразделенияЗаказНаПроизводствоИВыпускПродукции(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_РазныеПодразделенияЗаказНаПроизводствоИВыпускПродукции(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_РазныеПодразделенияЗаказНаПроизводствоИВыпускПродукции(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1");
	ТаблицаРезультата.Колонки.Добавить("Пояснение1");
	ТаблицаРезультата.Колонки.Добавить("Документ2");
	ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.Основание КАК Документ2,
	|	ДанныеДокумента.Подразделение КАК Пояснение1,
	|	ДанныеДокумента.Основание.Подразделение КАК Пояснение2
	|ИЗ
	|	Документ.ВыпускПродукции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Основание.Проведен
	|	И ДанныеДокумента.Подразделение <> ДанныеДокумента.Основание.Подразделение
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_РазныеПодразделенияЗаказНаПроизводствоИВыпускПродукции(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("макетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Разные подразделения в документах ""Заказ на производство"" и ""Выпуск продукции""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Выпуск продукции";
		ОбластьМакета.Параметры.Пояснение1 = "Подразделение";
		ОбластьМакета.Параметры.Документ2 = "Заказ на производство";
		ОбластьМакета.Параметры.Пояснение2 = "Подразделение";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область ДатаДокументаВыпускаМеньшеЧемДатаЗаказаНаПроизводство
//============================================== Дата документа выпуска меньше чем дата заказа на производство (+)===============================================

Функция ВыполнитьПроверку_ВыпускПродукцииРаньшеЗаказаНаПроизводство(ОбъектыКИсправлению, СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ВыпускПродукцииРаньшеЗаказаНаПроизводство(ОбъектыКИсправлению, СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ВыпускПродукцииРаньшеЗаказаНаПроизводство(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ВыпускПродукцииРаньшеЗаказаНаПроизводство(ОбъектыКИсправлению, СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1");
	ТаблицаРезультата.Колонки.Добавить("Пояснение1");
	ТаблицаРезультата.Колонки.Добавить("Документ2");
	ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.Основание.Ссылка КАК Документ2,
	|	ДанныеДокумента.Дата КАК Пояснение1,
	|	ДанныеДокумента.Основание.Дата КАК Пояснение2
	|ИЗ
	|	Документ.ВыпускПродукции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Основание.Проведен
	|	И ДанныеДокумента.Дата < ДанныеДокумента.Основание.Дата
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Примечание = ТекстОшибкиДополнительно(Выборка.Пояснение1, Выборка.Пояснение2);	
		
		НоваяСтрока = ОбъектыКИсправлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Исправить = "ПоставитьДатуВыпускаПозжеДатыЗаказаНаПроизводство";
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ВыпускПродукцииРаньшеЗаказаНаПроизводство(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = """Выпуск продукции"" имеет дату меньшую чем документ ""Заказ на производство""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "ПоставитьДатуВыпускаПозжеДатыЗаказаНаПроизводство";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления изменяет дату документа ""Заказ на производство"" на дату документа ""Выпуск продукции"", уменьшенную на 1 секунду";
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Выпуск продукции";
		ОбластьМакета.Параметры.Пояснение1 = "Дата";
		ОбластьМакета.Параметры.Документ2 = "Заказ на производство";
		ОбластьМакета.Параметры.Пояснение2 = "Дата";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	Возврат Таб;
	
КонецФункции

Функция ИсправитьОбъект_ВыпускПродукцииРаньшеЗаказаНаПроизводство(ДокументВыпускПродукции, ДокументЗаказНаПроизводство) Экспорт
	
	Если НачалоДня(ДокументВыпускПродукции.Дата) <> НачалоДня(ДокументЗаказНаПроизводство.Дата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектЗаказ = ДокументЗаказНаПроизводство.ПолучитьОбъект();
	ОбъектЗаказ.Дата = ДокументВыпускПродукции.Дата - 1;
	
	Попытка
		Если ОбъектЗаказ.Проведен Тогда
			ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбъектЗаказ.Записать();
		КонецЕсли;
		Возврат Истина;
	Исключение
		//Сообщить("Попытка присвоить дату " + ОбъектВыпуск.Дата + " для " + ОбъектВыпуск + ". Ошибка: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
#КонецОбласти

#Область ДатаДокументаРТИУМеньшеЧемДатаЗаказаНаПроизводство
//============================================== Дата реализации товаров и услуг меньше чем дата заказа на производство ========================================
//НЕ ИСПОЛЬЗУЕТСЯ
Функция ВыполнитьПроверку_РеализацияРаньшеЗаказаНаПроизводство(ОбъектыКИсправлению, СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_РеализацияРаньшеЗаказаНаПроизводство(ОбъектыКИсправлению, СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_РеализацияРаньшеЗаказаНаПроизводство(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_РеализацияРаньшеЗаказаНаПроизводство(ОбъектыКИсправлению, СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1");
	ТаблицаРезультата.Колонки.Добавить("Пояснение1");
	ТаблицаРезультата.Колонки.Добавить("Документ2");
	ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.Дата КАК Пояснение1,
	|	ДанныеДокумента.Основание.Ссылка КАК Документ2,
	|	ДанныеДокумента.Основание.Дата КАК Пояснение2
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Основание.Проведен
	|	И ДанныеДокумента.Дата < ДанныеДокумента.Основание.Дата
	|	И ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Примечание = ТекстОшибкиДополнительно(Выборка.Пояснение1, Выборка.Пояснение2);	
		
		НоваяСтрока = ОбъектыКИсправлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Исправить = "ПоставитьДатуРеализацииПозжеДатыЗаказаНаПроизводство";
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_РеализацияРаньшеЗаказаНаПроизводство(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("макетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = """Реализация товаров и услуг"" имеет дату меньшую чем документ ""Заказ на производство""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "ПоставитьДатуРеализацииПозжеДатыЗаказаНаПроизводство";
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Реализация";
		ОбластьМакета.Параметры.Пояснение1 = "Дата";
		ОбластьМакета.Параметры.Документ2 = "Заказ на производство";
		ОбластьМакета.Параметры.Пояснение2 = "Дата";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

Функция ИсправитьОбъект_РеализацияРаньшеЗаказаНаПроизводство(ДокументРеализация, ДокументЗаказНаПроизводство) Экспорт
	
	Если НачалоДня(ДокументРеализация.Дата) <>  НачалоДня(ДокументЗаказНаПроизводство.Дата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектРеализация = ДокументРеализация.ПолучитьОбъект();
	ОбъектРеализация.Дата = ДокументЗаказНаПроизводство.Дата + 1;
	
	Попытка
		Если ОбъектРеализация.Проведен Тогда
			ОбъектРеализация.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбъектРеализация.Записать();
		КонецЕсли;
		Возврат Истина;
	Исключение
		//Сообщить("Попытка присвоить дату " + ОбъектВыпуск.Дата + " для " + ОбъектВыпуск + ". Ошибка: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ДатаДокументаРТИУМеньшеЧемДатаЗаказаНаПроизводствоСлучай2
//================================ Дата реализации товаров и услуг меньше чем дата заказа на производство (случай подчинения докментов заказу покупателя) =======
//НЕ ИСПОЛЬЗУЕТСЯ
Функция ВыполнитьПроверку_РеализацияРаньшеЗНПпоЗД(ОбъектыКИсправлению, СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_РеализацияРаньшеЗНПпоЗД(ОбъектыКИсправлению, СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_РеализацияРаньшеЗНПпоЗД(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_РеализацияРаньшеЗНПпоЗД(ОбъектыКИсправлению, СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1");
	ТаблицаРезультата.Колонки.Добавить("Пояснение1");
	ТаблицаРезультата.Колонки.Добавить("Документ2");
	ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ЗаказНаПроизводство.Ссылка) КАК Ссылка,
	|	ЗаказНаПроизводство.ДокументОснование КАК Основание
	|ПОМЕСТИТЬ ВТ_ЗаказыПроизводства
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.ДокументОснование ССЫЛКА Документ.ЗаказДоговор
	|	И ЗаказНаПроизводство.Проведен
	|	И ЗаказНаПроизводство.ДокументОснование.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаПроизводство.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(РеализацияТоваровИУслуг.Ссылка) КАК Ссылка,
	|	РеализацияТоваровИУслуг.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И РеализацияТоваровИУслуг.Проведен
	|	И РеализацияТоваровИУслуг.Основание.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслуг.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаказыПроизводства.Основание КАК Основание,
	|	ВТ_ЗаказыПроизводства.Ссылка КАК Документ2,
	|	ВТ_Реализации.Ссылка КАК Документ1,
	|	ВТ_Реализации.Ссылка.Дата КАК Пояснение1,
	|	ВТ_ЗаказыПроизводства.Ссылка.Дата КАК Пояснение2
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПроизводства КАК ВТ_ЗаказыПроизводства
	|		ПО (ВТ_ЗаказыПроизводства.Основание = ВТ_Реализации.Основание)
	|ГДЕ
	|	НЕ ВТ_Реализации.Ссылка ЕСТЬ NULL
	|	И НЕ ВТ_ЗаказыПроизводства.Ссылка ЕСТЬ NULL
	|	И ВТ_Реализации.Ссылка.Дата < ВТ_ЗаказыПроизводства.Ссылка.Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
		НоваяСтрока.Примечание = ТекстОшибкиДополнительно(Выборка.Пояснение1, Выборка.Пояснение2);	
		
		НоваяСтрока = ОбъектыКИсправлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Исправить = "ПоставитьДатуРеализацииПозжеДатыЗНПпоЗД";
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_РеализацияРаньшеЗНПпоЗД(ТаблицаРезультата)
	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("макетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = """Реализация товаров и услуг"" имеет дату меньшую чем документ ""Заказ на производство"" (при подчинении документов одному заказу покупателя)";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "ПоставитьДатуРеализацииПозжеДатыЗНПпоЗД";
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Реализация";
		ОбластьМакета.Параметры.Пояснение1 = "Дата";
		ОбластьМакета.Параметры.Документ2 = "Заказ на производство";
		ОбластьМакета.Параметры.Пояснение2 = "Дата";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат Таб;
	
КонецФункции

Функция ИсправитьОбъект_РеализацияРаньшеЗНПпоЗД(ДокументРеализация, ДокументЗНП) Экспорт
	Если НачалоДня(ДокументРеализация.Дата) <>  НачалоДня(ДокументЗНП.Дата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат1 = Истина;
	ОбъектЗНП = ДокументЗНП.ПолучитьОбъект();
	ОбъектЗНП.Дата = ДокументРеализация.Дата - 2;
	
	Попытка
		Если ОбъектЗНП.Проведен Тогда
			ОбъектЗНП.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбъектЗНП.Записать();
		КонецЕсли;
	Исключение
		Результат1 = Ложь;
	КонецПопытки;
	
	Результат2 = ИсправитьОбъектВыпускПродукцииПоЗНП(ДокументЗНП);
	
	Возврат Результат1 и Результат2;
	
КонецФункции

Функция ИсправитьОбъектВыпускПродукцииПоЗНП(ДокументЗНП) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка,
	|	ВыпускПродукции.Дата,
	|	ВыпускПродукции.Основание.Дата КАК ОснованиеДата
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Основание = &Основание
	|	И НАЧАЛОПЕРИОДА(ВыпускПродукции.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(ВыпускПродукции.Основание.Дата, ДЕНЬ)
	|	И ВыпускПродукции.Дата <= ВыпускПродукции.Основание.Дата";
	
	Запрос.УстановитьПараметр("Основание", ДокументЗНП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Результат = Истина;
	
	Пока Выборка.Следующий() Цикл
		ОбъектВыпускПродукции = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектВыпускПродукции.Дата = Выборка.ОснованиеДата + 1;
		
		Попытка
			Если ОбъектВыпускПродукции.Проведен Тогда
				ОбъектВыпускПродукции.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ОбъектВыпускПродукции.Записать();
			КонецЕсли;
		Исключение
			Результат = Ложь;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ДатаДокументаРТИУМеньшеЧемДатаВыпуска
//================================ Дата реализации товаров и услуг меньше чем дата выпуска (случай подчинения документов одному ЗНП) =======
//НЕ ИСПОЛЬЗУЕТСЯ
Функция ВыполнитьПроверку_РеализацияРаньшеВыпускаПоЗНП(ОбъектыКИсправлению) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_РеализацияРаньшеВыпускаПоЗНП(ОбъектыКИсправлению);
	ТабДок = ВывестиРезультатПроверки_РеализацияРаньшеВыпускаПоЗНП(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_РеализацияРаньшеВыпускаПоЗНП(ОбъектыКИсправлению)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1");
	ТаблицаРезультата.Колонки.Добавить("Пояснение1");
	ТаблицаРезультата.Колонки.Добавить("Документ2");
	ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ВыпускПродукции.Ссылка) КАК Ссылка,
	|	ВыпускПродукции.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_Выпуски
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|	И ВыпускПродукции.Проведен
	|	И ВыпускПродукции.Основание.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыпускПродукции.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияПотолков.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_РеализацияПотолков
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияПотолков
	|ГДЕ
	|	РеализацияПотолков.Ссылка.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|	И РеализацияПотолков.Ссылка.Проведен
	|	И РеализацияПотолков.Ссылка.Основание.Проведен
	|	И (РеализацияПотолков.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	|			ИЛИ РеализацияПотолков.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	|			ИЛИ РеализацияПотолков.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез))
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияПотолков.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(РеализацияТоваровИУслуг.Ссылка) КАК Ссылка,
	|	РеализацияТоваровИУслуг.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РеализацияПотолков КАК ВТ_РеализацияПотолков
	|		ПО (ВТ_РеализацияПотолков.Ссылка = РеализацияТоваровИУслуг.Ссылка)
	|ГДЕ
	|	РеализацияТоваровИУслуг.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|	И РеализацияТоваровИУслуг.Проведен
	|	И РеализацияТоваровИУслуг.Основание.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслуг.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выпуски.Основание КАК Основание,
	|	ВТ_Выпуски.Ссылка КАК Документ2,
	|	ВТ_Реализации.Ссылка КАК Документ1,
	|	ВТ_Реализации.Ссылка.Дата КАК Пояснение1,
	|	ВТ_Выпуски.Ссылка.Дата КАК Пояснение2
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Выпуски КАК ВТ_Выпуски
	|		ПО (ВТ_Выпуски.Основание = ВТ_Реализации.Основание)
	|ГДЕ
	|	НЕ ВТ_Реализации.Ссылка ЕСТЬ NULL
	|	И НЕ ВТ_Выпуски.Ссылка ЕСТЬ NULL
	|	И ВТ_Реализации.Ссылка.Дата < ВТ_Выпуски.Ссылка.Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
		НоваяСтрока.Примечание = ТекстОшибкиДополнительно(Выборка.Пояснение1, Выборка.Пояснение2);	
		
		НоваяСтрока = ОбъектыКИсправлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Исправить = "ПоставитьДатуРеализацииПозжеДатыВыпускаПоЗНП";
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_РеализацияРаньшеВыпускаПоЗНП(ТаблицаРезультата)
	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("макетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = """Реализация товаров и услуг"" имеет дату меньшую чем документ ""Выпуск продукции"" (при подчинении документов одному заказу на производство)";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "ПоставитьДатуРеализацииПозжеДатыВыпускаПоЗНП";
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Реализация";
		ОбластьМакета.Параметры.Пояснение1 = "Дата";
		ОбластьМакета.Параметры.Документ2 = "Заказ на производство";
		ОбластьМакета.Параметры.Пояснение2 = "Дата";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат Таб;
	
КонецФункции

Функция ИсправитьОбъект_РеализацияРаньшеВыпускаПоЗНП(ДокументРеализация, ДокументВыпуска) Экспорт
	Если НачалоДня(ДокументРеализация.Дата) <>  НачалоДня(ДокументВыпуска.Дата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектРеализация = ДокументРеализация.ПолучитьОбъект();
	ОбъектРеализация.Дата = ДокументВыпуска.Дата + 1;
	
	Попытка
		Если ОбъектРеализация.Проведен Тогда
			ОбъектРеализация.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбъектРеализация.Записать();
		КонецЕсли;
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ДатаДокументаРТИУМеньшеЧемЗаказПокупателя
//============================================== Дата реализации товаров и услуг меньше чем дата заказа покупателя (+)========================================

Функция ВыполнитьПроверку_РеализацияРаньшеЗаказаПокупателя(ОбъектыКИсправлению, СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_РеализацияРаньшеЗаказаПокупателя(ОбъектыКИсправлению, СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_РеализацияРаньшеЗаказаПокупателя(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_РеализацияРаньшеЗаказаПокупателя(ОбъектыКИсправлению, СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1");
	ТаблицаРезультата.Колонки.Добавить("Пояснение1");
	ТаблицаРезультата.Колонки.Добавить("Документ2");
	ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.Дата КАК Пояснение1,
	|	ДанныеДокумента.Основание.Ссылка КАК Документ2,
	|	ДанныеДокумента.Основание.Дата КАК Пояснение2
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Основание.Проведен
	|	И ДанныеДокумента.Дата < ДанныеДокумента.Основание.Дата
	|	И ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказПокупателя
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Примечание = ТекстОшибкиДополнительно(Выборка.Пояснение1, Выборка.Пояснение2);	
		
		НоваяСтрока = ОбъектыКИсправлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Исправить = "ПоставитьДатуРеализацииПозжеДатыЗаказаПокупателя";
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_РеализацияРаньшеЗаказаПокупателя(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("макетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = """Реализация товаров и услуг"" имеет дату меньшую чем документ ""Заказ покупателя""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "ПоставитьДатуРеализацииПозжеДатыЗаказаПокупателя";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления изменяет дату документа ""Реализация товаров и услуг"" на дату документа ""Заказ покупателя"", увеличенную на 1 секунду";
		
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Реализация";
		ОбластьМакета.Параметры.Пояснение1 = "Дата";
		ОбластьМакета.Параметры.Документ2 = "Заказ покупателя";
		ОбластьМакета.Параметры.Пояснение2 = "Дата";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат Таб;
	
КонецФункции

Функция ИсправитьОбъект_РеализацияРаньшеЗаказаПокупателя(ДокументРеализация, ДокументЗаказПокупателя) Экспорт
	Если НачалоДня(ДокументРеализация.Дата) <> НачалоДня(ДокументЗаказПокупателя.Дата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектРеализация = ДокументРеализация.ПолучитьОбъект();
	ОбъектРеализация.Дата = ДокументЗаказПокупателя.Дата + 1;
	
	Попытка
		Если ОбъектРеализация.Проведен Тогда
			ОбъектРеализация.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбъектРеализация.Записать();
		КонецЕсли;
		Возврат Истина;
	Исключение
		//Сообщить("Попытка присвоить дату " + ОбъектВыпуск.Дата + " для " + ОбъектВыпуск + ". Ошибка: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ДатаДокументаРТИУМеньшеЧемПТИУ
//============================================== Дата реализации товаров и услуг меньше чем дата поступления (+)========================================

Функция ВыполнитьПроверку_РеализацияРаньшеПоступления(ОбъектыКИсправлению, СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_РеализацияРаньшеПоступления(ОбъектыКИсправлению, СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_РеализацияРаньшеПоступления(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_РеализацияРаньшеПоступления(ОбъектыКИсправлению, СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1");
	ТаблицаРезультата.Колонки.Добавить("Пояснение1");
	ТаблицаРезультата.Колонки.Добавить("Документ2");
	ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровИУслуг.Ссылка КАК Документ1,
	|	РеализацияТоваровИУслуг.Дата КАК Пояснение1,
	|	РеализацияТоваровИУслуг.Основание.Ссылка КАК Документ2,
	|	РеализацияТоваровИУслуг.Основание.Дата КАК Пояснение2
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Проведен
	|	И РеализацияТоваровИУслуг.Основание.Проведен
	|	И РеализацияТоваровИУслуг.Дата < РеализацияТоваровИУслуг.Основание.Дата
	|	И РеализацияТоваровИУслуг.Основание ССЫЛКА Документ.ПоступлениеТоваровИУслуг";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
		НоваяСтрока.Примечание = ТекстОшибкиДополнительно(Выборка.Пояснение1, Выборка.Пояснение2);	
		
		НоваяСтрока = ОбъектыКИсправлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Исправить = "ПоставитьДатуПоступленияРаньшеДатыРеализации";
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_РеализацияРаньшеПоступления(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("макетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = """Реализация товаров и услуг"" имеет дату меньшую чем документ ""Поступление товаров и услуг""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "ПоставитьДатуПоступленияРаньшеДатыРеализации";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления изменяет дату документа ""Поступление товаров и услуг"" на дату документа ""Реализация товаров и услуг"", уменьшенную на 1 секунду";
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Реализация";
		ОбластьМакета.Параметры.Пояснение1 = "Дата";
		ОбластьМакета.Параметры.Документ2 = "Поступление";
		ОбластьМакета.Параметры.Пояснение2 = "Дата";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат Таб;
	
КонецФункции

Функция ИсправитьОбъект_РеализацияРаньшеПоступления(ДокументРеализация, ДокументПоступления) Экспорт
	Если НачалоДня(ДокументРеализация.Дата) <>  НачалоДня(ДокументПоступления.Дата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектПоступления = ДокументПоступления.ПолучитьОбъект();
	ОбъектПоступления.Дата = ДокументРеализация.Дата - 1;
	
	Попытка
		Если ОбъектПоступления.Проведен Тогда
			ОбъектПоступления.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбъектПоступления.Записать();
		КонецЕсли;
		Возврат Истина;
	Исключение
		//Сообщить("Попытка присвоить дату " + ОбъектВыпуск.Дата + " для " + ОбъектВыпуск + ". Ошибка: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ОтрицательныеОстаткиТоварыНаСкладах
//============================================== Отрицательные движения по регистру Товары на Складах (+)========================================

Функция ВыполнитьПроверку_ОтрицательныеОстатки(ОбъектыКИсправлению) Экспорт
	
	ТабДок = ВывестиРезультатПроверки_ОтрицательныеОстатки(ОбъектыКИсправлению);
	Возврат ТабДок;
	
КонецФункции

Функция ВывестиРезультатПроверки_ОтрицательныеОстатки(ОбъектыКИсправлению)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("макетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Отрицательные остатки в движении по регистру ""Товары на складах""";
	Таб.Вывести(ОбластьМакета, 1);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Информация");
	ОбластьМакета.Параметры.ДопИнформация = "*В данном отчете не выведена информация по номенклатуре Остатки пленки, Материал заказчика.";
	Таб.Вывести(ОбластьМакета, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладах.Регистратор КАК Регистратор,
	|	ТоварыНаСкладах.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ТоварыНаСкладах.Склад КАК Склад,
	|	ТоварыНаСкладах.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТоварыНаСкладах.СерияНоменклатуры КАК СерияНоменклатуры
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(, , Регистратор, ,
	//++ #12079
	//|			НЕ Номенклатура В (&ОстаткиПленки, &ПредопределенныйОстаткиПленки, &ПредопределенныйМатериалЗаказчика)
	
	//++ #14311
	//|			НЕ Номенклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ОстатокПленки), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.МатериалЗаказчика))
	|			НЕ Номенклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ОстатокПленки))
	|			И НЕ Номенклатура.МатериалЗаказчика
	//-- #14311
	
	//-- #12079
	|	) КАК ТоварыНаСкладах
	|ГДЕ
	|	ТоварыНаСкладах.КоличествоКонечныйОстаток < 0
	|ИТОГИ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры,
	|	Склад";
	Запрос.УстановитьПараметр("ОстаткиПленки", Справочники.Номенклатура.НайтиПоНаименованию("Остатки пленки"));
	Запрос.УстановитьПараметр("ПредопределенныйОстаткиПленки", Справочники.Номенклатура.ОстаткиПленки);
	Запрос.УстановитьПараметр("ПредопределенныйМатериалЗаказчика", Справочники.Номенклатура.ПолотноЗаказчика);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КоличествоОшибок = РезультатЗапроса.Выбрать().Количество();
	
	КоличествоОшибокСч = 0;
	ТабВрем = Новый ТабличныйДокумент;
	
	Если КоличествоОшибок = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		
		//ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		//ОбластьМакета.Параметры.КоличествоОшибок = КоличествоОшибок;
		//Таб.Вывести(ОбластьМакета, 1);	
		//ТабВрем.НачатьАвтогруппировкуСтрок();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_отриц");
		ТабВрем.Вывести(ОбластьМакета, 1);
		
		Пока Выборка.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка_отриц_остатки_номенклатура");
			ОбластьМакета.Параметры.Номенклатура = Выборка.Номенклатура;
			ТабВрем.Вывести(ОбластьМакета, 1);
			
			ВыборкаХарактеристика =  Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаХарактеристика.Следующий() Цикл 
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка_отриц_остатки_характеристика");
				ОбластьМакета.Параметры.ХарактеристикаНоменклатуры = ВыборкаХарактеристика.ХарактеристикаНоменклатуры;
				ТабВрем.Вывести(ОбластьМакета, 2);
				
				ВыборкаСерия = ВыборкаХарактеристика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСерия.Следующий() Цикл
					ОбластьМакета = Макет.ПолучитьОбласть("Шапка_отриц_остатки_серия");
					ОбластьМакета.Параметры.СерияНоменклатуры = ВыборкаСерия.СерияНоменклатуры;
					ТабВрем.Вывести(ОбластьМакета, 3);
					
					ВыборкаСклад = ВыборкаСерия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаСклад.Следующий() Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("Шапка_отриц_остатки_склад");
						ОбластьМакета.Параметры.Склад = ВыборкаСклад.Склад;
						ТабВрем.Вывести(ОбластьМакета, );
						
						ВыборкаРегистратор = ВыборкаСклад.Выбрать();
						Ном = 1;
						Пока ВыборкаРегистратор.Следующий() Цикл
							ОбластьМакета = Макет.ПолучитьОбласть("Строка_отриц_остатки");
							ОбластьМакета.Параметры.Ном = Ном;
							ОбластьМакета.Параметры.Регистратор = ВыборкаРегистратор.Регистратор;					
							ОбластьМакета.Параметры.КоличествоПослеДвижения = ВыборкаРегистратор.КоличествоКонечныйОстаток;					
							ТабВрем.Вывести(ОбластьМакета, 4);
							Ном = Ном + 1; 
							
							КоличествоОшибокСч = КоличествоОшибокСч + 1;
							
							НоваяСтрока = ОбъектыКИсправлению.Добавить();
							НоваяСтрока.Документ1 = ВыборкаРегистратор.Регистратор;
							НоваяСтрока.Исправить = "ИсправитьОтрицательныеОстаткиТоваров";
							
						КонецЦикла;	
					КонецЦикла; 
					
				КонецЦикла;
				
			КонецЦикла;
			
			
			
		КонецЦикла;
		
		//ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = КоличествоОшибокСч;
		ОбластьМакета.Параметры.Исправить = "ИсправитьОтрицательныеОстаткиТоваров";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления изменяет время документов ""Поступление товаров и услуг"" / ""Оприходование товаров"", 
		|дата и склад которых совпадает с реквизитами документов с минусовыми остатками, на начало дня ""00:00:01""
		|Указанное действие не гарантирует исправление отрицательных остатков";
		Таб.Вывести(ОбластьМакета, 1);
		
		Таб.Вывести(ТабВрем, 2, "Документ", Ложь);
		
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	
	Возврат Таб;
	
КонецФункции 

Функция ИсправитьОбъект_ОтрицательныеОстаткиТоваров(ДокументРасходаТовара) Экспорт
	
	МассивСкладов = Новый Массив;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", ДокументРасходаТовара.Метаданные()) Тогда
		МассивСкладов.Добавить(ДокументРасходаТовара.Склад);
	КонецЕсли;
	// выпуск
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладПродукции", ДокументРасходаТовара.Метаданные()) Тогда
		МассивСкладов.Добавить(ДокументРасходаТовара.СкладПродукции);
	КонецЕсли;
	// выпуск
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладМатериалов", ДокументРасходаТовара.Метаданные()) Тогда
		МассивСкладов.Добавить(ДокументРасходаТовара.СкладМатериалов);
	КонецЕсли;
	// комплектация , разукомплектация
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладИсточник", ДокументРасходаТовара.Метаданные()) Тогда
		МассивСкладов.Добавить(ДокументРасходаТовара.СкладИсточник);
	КонецЕсли;
	// монтаж
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладТоваров", ДокументРасходаТовара.Метаданные()) Тогда
		МассивСкладов.Добавить(ДокументРасходаТовара.СкладТоваров);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", МассивСкладов);
	Запрос.УстановитьПараметр("ДатаРасхода", ДокументРасходаТовара.Дата);		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Склад В(&Склад)
	|	И НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаРасхода, ДЕНЬ)
	|	И НЕ(ЧАС(ДанныеДокумента.Дата) = 0
	|				И МИНУТА(ДанныеДокумента.Дата) = 0
	|				И СЕКУНДА(ДанныеДокумента.Дата) = 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка
	|ИЗ
	|	Документ.ОприходованиеТоваров КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Склад В(&Склад)
	|	И НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаРасхода, ДЕНЬ)
	|	И НЕ(ЧАС(ДанныеДокумента.Дата) = 0
	|				И МИНУТА(ДанныеДокумента.Дата) = 0
	|				И СЕКУНДА(ДанныеДокумента.Дата) = 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Истина;
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.Дата = НачалоДня(ДокОбъект.Дата) + 1;
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Ошибка проведения " + Выборка.Ссылка + ". " + ОписаниеОшибки());
			Результат = Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОтрицательныеОстаткиДенежныеСредства
//============================================== Отрицательные движения по регистру Денежные средства (+)========================================

Функция ВыполнитьПроверку_ОтрицательныеОстаткиДенежныеСредства(ОбъектыКИсправлению) Экспорт
	
	ТабДок = ВывестиРезультатПроверки_ОтрицательныеОстаткиДенежныеСредства(ОбъектыКИсправлению);
	Возврат ТабДок;
	
КонецФункции

Функция ВывестиРезультатПроверки_ОтрицательныеОстаткиДенежныеСредства(ОбъектыКИсправлению)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("макетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Отрицательные остатки в движении по регистру ""Денежные средства""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.СчетКасса КАК СчетКасса,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ДанныеРегистра.СуммаКонечныйОстаток КАК СуммаПослеДвижения
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(, , Регистратор, , ) КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.СуммаКонечныйОстаток < 0
	|	И НЕ ДанныеРегистра.СуммаПриход > 0 
	|ИТОГИ ПО
	|	Организация,
	|	СчетКасса,
	|	Валюта";
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КоличествоОшибок = РезультатЗапроса.Выбрать().Количество();
	
	КоличествоОшибокСч = 0;
	ТабВрем = Новый ТабличныйДокумент;
	
	Если КоличествоОшибок = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		
		ТабВрем.НачатьАвтогруппировкуСтрок();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_отрицДС");
		ТабВрем.Вывести(ОбластьМакета, 1);
		
		Пока Выборка.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка_отрицДС_организация");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабВрем.Вывести(ОбластьМакета, 2);
			
			ВыборкаСчетКасса =  Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСчетКасса.Следующий() Цикл 
				
				ВыборкаВалюта = ВыборкаСчетКасса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаВалюта.Следующий() Цикл
					
					ОбластьМакета = Макет.ПолучитьОбласть("Шапка_отрицДС_счеткасса");
					ОбластьМакета.Параметры.Заполнить(ВыборкаВалюта);
					ТабВрем.Вывести(ОбластьМакета, 3);
					
					ВыборкаРегистратор = ВыборкаВалюта.Выбрать();
					Ном = 1;
					ЭтоПервый = Истина;
					Пока ВыборкаРегистратор.Следующий() Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("Строка_отрицДС_остатки");
						ОбластьМакета.Параметры.Заполнить(ВыборкаРегистратор);
						ОбластьМакета.Параметры.Ном = Ном;				
						ТабВрем.Вывести(ОбластьМакета, 4);
						Ном = Ном + 1; 
						
						КоличествоОшибокСч = КоличествоОшибокСч + 1;
						
						НоваяСтрока = ОбъектыКИсправлению.Добавить();
						НоваяСтрока.Документ1 = ВыборкаРегистратор.Регистратор;
						НоваяСтрока.Исправить = "ИсправитьОтрицательныеОстаткиДС";
						
					КонецЦикла;	
					
				КонецЦикла;				
			КонецЦикла;		
		КонецЦикла;
		
		ТабВрем.ЗакончитьАвтогруппировкуСтрок();
		
		//ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = КоличествоОшибокСч;
		ОбластьМакета.Параметры.Исправить = "ИсправитьОтрицательныеОстаткиДС";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления изменяет время документов ""Приходный кассовый ордер"" / ""Поступление на расчетный счет"", 
		|дата и касса/счет которых совпадает с реквизитами документов с минусовыми остатками, на начало дня ""00:00:01""
		|Указанное действие не гарантирует исправление отрицательных остатков";
		Таб.Вывести(ОбластьМакета, 1);
		
		Таб.Вывести(ТабВрем, 2, "Документ", Ложь);
		
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	
	Возврат Таб;
	
КонецФункции 

Функция ИсправитьОбъект_ОтрицательныеОстаткиДС(ДокументРасходаДС) Экспорт
	
	Результат = Истина;
	
	Если ТипЗнч(ДокументРасходаДС) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Касса", ДокументРасходаДС.Касса);
		Запрос.УстановитьПараметр("ДатаРасходаДС", ДокументРасходаДС.Дата);		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокумента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И ДанныеДокумента.Касса = &Касса
		|	И НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаРасходаДС, ДЕНЬ)
		|	И НЕ(ЧАС(ДанныеДокумента.Дата) = 0
		|				И МИНУТА(ДанныеДокумента.Дата) = 0
		|				И СЕКУНДА(ДанныеДокумента.Дата) = 1)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Дата = НачалоДня(ДокОбъект.Дата) + 1;
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить("Ошибка проведения " + Выборка.Ссылка + ". " + ОписаниеОшибки());
				Результат = Ложь;
			КонецПопытки;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДокументРасходаДС) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Счет", ДокументРасходаДС.Счет);
		Запрос.УстановитьПараметр("ДатаРасходаДС", ДокументРасходаДС.Дата);		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокумента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеНаРасчетныйСчет КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Проведен
		|	И ДанныеДокумента.Счет = &Счет
		|	И НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаРасходаДС, ДЕНЬ)
		|	И НЕ(ЧАС(ДанныеДокумента.Дата) = 0
		|				И МИНУТА(ДанныеДокумента.Дата) = 0
		|				И СЕКУНДА(ДанныеДокумента.Дата) = 1)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Дата = НачалоДня(ДокОбъект.Дата) + 1;
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить("Ошибка проведения " + Выборка.Ссылка + ". " + ОписаниеОшибки());
				Результат = Ложь;
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область ПослеОбновления
//============================================== Документы к обработке после обновления (+)========================================

Функция ВыполнитьПроверку_ДокументыКОбработкеПослеОбновления() Экспорт
	
	ТабДок = ВывестиРезультатПроверки_ДокументыКОбработкеПослеОбновления();
	Возврат ТабДок;
	
КонецФункции

Функция ВывестиРезультатПроверки_ДокументыКОбработкеПослеОбновления()
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("макетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Документы, которые следует обработать после обновления программы";
	Таб.Вывести(ОбластьМакета, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	ВерсияПрограммы КАК Версия,
	|	Документ,
	|	ДокументДата КАК Дата
	|ИЗ
	|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые
	|УПОРЯДОЧИТЬ ПО Версия, ДокументДата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе						
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.Исправить = "ЗапуститьОбработчикПроведенияДокументовПослеОбновления";
		ОбластьМакета.Параметры.КоличествоОшибок = Выборка.Количество();
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления запускает обработку документов после обновления";
		
		Таб.Вывести(ОбластьМакета, 1);	
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_КОбработке");
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Пока Выборка.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_КОбработке");
			ОбластьМакета.Параметры.Ном = Ном;
			ОбластьМакета.Параметры.Версия = Выборка.Версия;					
			ОбластьМакета.Параметры.Документ = Выборка.Документ;
			ОбластьМакета.Параметры.ДатаДокумента = Выборка.Дата;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);			
			
			Ном = Ном + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	
	Возврат Таб;
	
КонецФункции  

#КонецОбласти

#Область ДатаДокументаПТИУМеньшеЗаказаПоставщику
//============================================== Дата поступления товаров и услуг меньше чем дата заказа поставщику (+)========================================

Функция ВыполнитьПроверку_ПоступлениеРаньшеЗаказаПоставщику(ОбъектыКИсправлению, СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ПоступлениеРаньшеЗаказаПоставщику(ОбъектыКИсправлению, СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ПоступлениеРаньшеЗаказаПоставщику(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ПоступлениеРаньшеЗаказаПоставщику(ОбъектыКИсправлению, СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1");
	ТаблицаРезультата.Колонки.Добавить("Пояснение1");
	ТаблицаРезультата.Колонки.Добавить("Документ2");
	ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.Дата КАК Пояснение1,
	|	ДанныеДокумента.Основание.Ссылка КАК Документ2,
	|	ДанныеДокумента.Основание.Дата КАК Пояснение2
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Основание.Проведен
	|	И ДанныеДокумента.Дата < ДанныеДокумента.Основание.Дата
	|	И ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказПоставщику
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
		НоваяСтрока.Примечание = ТекстОшибкиДополнительно(Выборка.Пояснение1, Выборка.Пояснение2);	
		
		НоваяСтрока = ОбъектыКИсправлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Исправить = "ПоставитьДатуЗаказаПоставщикуРаньшеДатыПоступления";
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ПоступлениеРаньшеЗаказаПоставщику(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = """Поступление товаров и услуг"" имеет дату меньшую чем документ ""Заказ поставщику""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "ПоставитьДатуЗаказаПоставщикуРаньшеДатыПоступления";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления изменяет дату документа ""Заказ поставщику"" на дату документа ""Поступление товаров и услуг"", уменьшенную на 1 секунду";
		
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Поступление";
		ОбластьМакета.Параметры.Пояснение1 = "Дата";
		ОбластьМакета.Параметры.Документ2 = "Заказ поставщику";
		ОбластьМакета.Параметры.Пояснение2 = "Дата";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

Функция ИсправитьОбъект_ПоступлениеРаньшеЗаказаПоставщику(ДокументПоступления, ДокументЗаказПоставщику) Экспорт
	
	Если НачалоДня(ДокументЗаказПоставщику.Дата) <> НачалоДня(ДокументПоступления.Дата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектИсправления = ДокументЗаказПоставщику.ПолучитьОбъект();
	ОбъектИсправления.Дата = ДокументПоступления.Дата - 1;
	
	Попытка
		Если ОбъектИсправления.Проведен Тогда
			ОбъектИсправления.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбъектИсправления.Записать();
		КонецЕсли;
		Возврат Истина;
	Исключение
		//Сообщить("Попытка присвоить дату " + ОбъектВыпуск.Дата + " для " + ОбъектВыпуск + ". Ошибка: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область СуммаРеализацииНеСходитсяССуммойЗаказаНаПроизводство
//============================================== Сумма реализации не сходится с суммой заказа на производство ========================================
//НЕ ИСПОЛЬЗУЕТСЯ

Функция ВыполнитьПроверку_СуммаРеализацииНеСходитсяССуммойЗаказаНаПроизводство() Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_СуммаРеализацииНеСходитсяССуммойЗаказаНаПроизводство();
	ТабДок = ВывестиРезультатПроверки_СуммаРеализацииНеСходитсяССуммойЗаказаНаПроизводство(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_СуммаРеализацииНеСходитсяССуммойЗаказаНаПроизводство()
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //ЗнП
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); //сумма документа
	ТаблицаРезультата.Колонки.Добавить("Документ2"); //РТиУ
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); //сумма документа
	ТаблицаРезультата.Колонки.Добавить("Примечание"); //не используется
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеТаблицы.Ссылка КАК Ссылка,
	|	ДанныеТаблицы.Заказ КАК Заказ,
	|	ДанныеТаблицы.Сумма КАК СуммаОтгрузки
	|ПОМЕСТИТЬ ВТ_ГрупповыеОтгрузкиВрем
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК ДанныеТаблицы
	|ГДЕ
	|	ДанныеТаблицы.Ссылка.ГрупповаяОтгрузка
	|	И ДанныеТаблицы.Ссылка.Проведен
	|	И ДанныеТаблицы.Заказ ССЫЛКА Документ.ЗаказНаПроизводство
	|	И НЕ ДанныеТаблицы.Заказ ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеТаблицы.Ссылка,
	|	ДанныеТаблицы.Заказ,
	|	ДанныеТаблицы.Сумма
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Услуги КАК ДанныеТаблицы
	|ГДЕ
	|	ДанныеТаблицы.Ссылка.ГрупповаяОтгрузка
	|	И ДанныеТаблицы.Ссылка.Проведен
	|	И ДанныеТаблицы.Заказ ССЫЛКА Документ.ЗаказНаПроизводство
	|	И НЕ ДанныеТаблицы.Заказ ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГрупповыеОтгрузкиВрем.Ссылка КАК Ссылка,
	|	ВТ_ГрупповыеОтгрузкиВрем.Заказ КАК Заказ,
	|	СУММА(ВТ_ГрупповыеОтгрузкиВрем.СуммаОтгрузки) КАК СуммаОтгрузки
	|ПОМЕСТИТЬ ВТ_ГрупповыеОтгрузки
	|ИЗ
	|	ВТ_ГрупповыеОтгрузкиВрем КАК ВТ_ГрупповыеОтгрузкиВрем
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ГрупповыеОтгрузкиВрем.Ссылка,
	|	ВТ_ГрупповыеОтгрузкиВрем.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровИУслуг.Ссылка КАК ДокРтиу,
	|	РеализацияТоваровИУслуг.Основание КАК ДокОснование,
	|	РеализацияТоваровИУслуг.СуммаДокумента КАК СуммаОтгрузки
	|ПОМЕСТИТЬ ВТ_ДокументыРеализацииВрем
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровИУслуг.ГрупповаяОтгрузка
	|	И РеализацияТоваровИУслуг.Проведен
	|	И РеализацияТоваровИУслуг.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|	И НЕ РеализацияТоваровИУслуг.Основание ЕСТЬ NULL
	|	И РеализацияТоваровИУслуг.Основание.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Отгружен)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ГрупповыеОтгрузки.Ссылка,
	|	ВТ_ГрупповыеОтгрузки.Заказ,
	|	ВТ_ГрупповыеОтгрузки.СуммаОтгрузки
	|ИЗ
	|	ВТ_ГрупповыеОтгрузки КАК ВТ_ГрупповыеОтгрузки
	|ГДЕ
	|	ВТ_ГрупповыеОтгрузки.Заказ.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Отгружен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыРеализацииВрем.ДокОснование КАК ДокОснование,
	|	СУММА(ВТ_ДокументыРеализацииВрем.СуммаОтгрузки) КАК СуммаОтгрузки,
	|	ВТ_ДокументыРеализацииВрем.ДокОснование.СуммаДокумента КАК СуммаЗаказа
	|ПОМЕСТИТЬ ВТ_ДокументыВрем
	|ИЗ
	|	ВТ_ДокументыРеализацииВрем КАК ВТ_ДокументыРеализацииВрем
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДокументыРеализацииВрем.ДокОснование,
	|	ВТ_ДокументыРеализацииВрем.ДокОснование.СуммаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыВрем.ДокОснование КАК ДокОснование,
	|	ВТ_ДокументыРеализацииВрем.ДокРтиу КАК ДокРтиу,
	|	ВТ_ДокументыВрем.СуммаЗаказа КАК СуммаЗаказа,
	|	ВТ_ДокументыВрем.СуммаОтгрузки КАК СуммаОтгрузки
	|ИЗ
	|	ВТ_ДокументыВрем КАК ВТ_ДокументыВрем
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыРеализацииВрем КАК ВТ_ДокументыРеализацииВрем
	|		ПО (ВТ_ДокументыРеализацииВрем.ДокОснование = ВТ_ДокументыВрем.ДокОснование)
	|ГДЕ
	|	ВТ_ДокументыВрем.СуммаЗаказа <> ВТ_ДокументыВрем.СуммаОтгрузки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокОснование
	|ИТОГИ ПО
	|	ДокОснование";
	
	ВыборкаЗаказов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ДокОснование");		
	Пока ВыборкаЗаказов.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		НоваяСтрока.Документ1 = ВыборкаЗаказов.ДокОснование;
		
		СписокДокументовВРасшифровку = Новый СписокЗначений;	
		ВыборкаРеализаций = ВыборкаЗаказов.Выбрать();
		Пока ВыборкаРеализаций.Следующий() Цикл
			СписокДокументовВРасшифровку.Добавить(ВыборкаРеализаций.ДокРтиу);
			НоваяСтрока.Пояснение1 = ВыборкаРеализаций.СуммаЗаказа;
			НоваяСтрока.Пояснение2 = ВыборкаРеализаций.СуммаОтгрузки;
		КонецЦикла;
		Если СписокДокументовВРасшифровку.Количество() = 1 Тогда
			НоваяСтрока.Документ2 = СписокДокументовВРасшифровку[0].Значение;
		Иначе
			НоваяСтрока.Документ2 = СписокДокументовВРасшифровку;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_СуммаРеализацииНеСходитсяССуммойЗаказаНаПроизводство(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	//ОбластьМакета.Параметры.ВидПроверки = "Сумма документа ""Реализация товаров и услуг"" не соответствует сумме документа ""Заказ на производство"", являющегося основанием реализации. Учитываются только пары документов 1 к 1.";
	ОбластьМакета.Параметры.ВидПроверки = "Сумма документа ""Реализация товаров и услуг"" не соответствует сумме документа ""Заказ на производство"", являющегося основанием реализации";	
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Заказ на производство";
		ОбластьМакета.Параметры.Пояснение1 = "Сумма";
		ОбластьМакета.Параметры.Документ2 = "Реализация";
		ОбластьМакета.Параметры.Пояснение2 = "Сумма";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область СуммаРеализацииНеСходитсяССуммойЗаказаПокупателя
//============================================== Сумма реализации не сходится с суммой заказа покупателя (+)========================================

Функция ВыполнитьПроверку_СуммаРеализацииНеСходитсяССуммойЗаказаПокупателя(СтруктураПараметров) Экспорт 
	
	РезультатПроверки = ПолучитьТаблицу_СуммаРеализацииНеСходитсяССуммойЗаказаПокупателя(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_СуммаРеализацииНеСходитсяССуммойЗаказаПокупателя(РезультатПроверки);
	возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_СуммаРеализацииНеСходитсяССуммойЗаказаПокупателя(СтруктураПараметров)
	
	// #12360 делаем так: проверяем по реализациям указанного периода. по реализации в периоде находим заказы без учета периода, 
	// далее по заказу находим все реализации без учета периода и сверяем их все с этим заказом.
	// т.е. по факту первая найденная РТиУ в указанном периоде лишь точка входа в цепочку и далее проверка без учета периода.
	// ВТ_Документы_Врем - все реализации за период и заказы, по которым они отгружаются
	// ВТ_Документы - уникальные связки реализация-заказ
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //РТиУ
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); //сумма документа
	ТаблицаРезультата.Колонки.Добавить("Документ2"); //Заказ покупателя
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); //сумма документа
	ТаблицаРезультата.Колонки.Добавить("Примечание"); //используется
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	//Запросом получим товары и услуги в табличных частях реализаций, у которых указан выполненный заказ покупателя в колонке "Заказ"
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК СсылкаНаРеализацию,
	|	ДанныеДокумента.Заказ.Ссылка КАК СсылкаНаЗаказ
	|ПОМЕСТИТЬ ВТ_Документы_Врем
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Проведен
	|	И ДанныеДокумента.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|	И ДанныеДокумента.Заказ.Ссылка ЕСТЬ НЕ NULL 
	|	И ДанныеДокумента.Заказ.ТекущийСтатус = &ТекущийСтатус
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Заказ.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Проведен
	|	И ДанныеДокумента.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|	И ДанныеДокумента.Заказ.Ссылка ЕСТЬ НЕ NULL 
	|	И ДанныеДокумента.Заказ.ТекущийСтатус = &ТекущийСтатус
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_Документы_Врем.СсылкаНаРеализацию КАК СсылкаНаРеализацию,
	|	ВТ_Документы_Врем.СсылкаНаЗаказ КАК СсылкаНаЗаказ
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	ВТ_Документы_Врем КАК ВТ_Документы_Врем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК СсылкаНаРеализацию,
	|	СУММА(ЕСТЬNULL(ДанныеДокумента.Сумма, 0) + ЕСТЬNULL(ДанныеДокумента.СкидкаБонусами, 0)) КАК СуммаРеализации,
	|	ДанныеДокумента.Заказ.Ссылка КАК СсылкаНаЗаказ,
	|	СРЕДНЕЕ(ЕСТЬNULL(ДанныеДокумента.Заказ.СуммаДокумента, 0)) КАК СуммаЗаказов,
	|	ВЫБОР 
	|		КОГДА (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|				ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|			И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|				ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Отображать
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК ДанныеДокумента
	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы 
	|		ПО ВТ_Документы.СсылкаНаЗаказ = ДанныеДокумента.Заказ
	
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Проведен
	//|	И ДанныеДокумента.Заказ ССЫЛКА Документ.ЗаказПокупателя
	//|	И ДанныеДокумента.Заказ.Ссылка ЕСТЬ НЕ NULL 
	//|	И ДанныеДокумента.Заказ.ТекущийСтатус = &ТекущийСтатус
	//|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	//|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	//|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	//|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Заказ.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	СУММА(ЕСТЬNULL(ДанныеДокумента.Сумма, 0) + ЕСТЬNULL(ДанныеДокумента.СкидкаБонусами, 0)),
	|	ДанныеДокумента.Заказ.Ссылка,
	|	СРЕДНЕЕ(ЕСТЬNULL(ДанныеДокумента.Заказ.СуммаДокумента, 0)),
	|	ВЫБОР 
	|		КОГДА (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|				ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|			И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|				ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Отображать
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Услуги КАК ДанныеДокумента
	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы 
	|		ПО ВТ_Документы.СсылкаНаЗаказ = ДанныеДокумента.Заказ
	
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Проведен
	//|	И ДанныеДокумента.Заказ ССЫЛКА Документ.ЗаказПокупателя
	//|	И ДанныеДокумента.Заказ.Ссылка ЕСТЬ НЕ NULL 
	//|	И ДанныеДокумента.Заказ.ТекущийСтатус = &ТекущийСтатус
	//|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	//|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	//|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	//|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Заказ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацииЗаказы.СсылкаНаРеализацию КАК СсылкаНаРеализацию,
	|	СУММА(ЕСТЬNULL(РеализацииЗаказы.СуммаРеализации, 0)) КАК СуммаРеализации,
	|	РеализацииЗаказы.СсылкаНаЗаказ КАК СсылкаНаЗаказ,
	|	СРЕДНЕЕ(ЕСТЬNULL(РеализацииЗаказы.СуммаЗаказов, 0)) КАК СуммаЗаказов,
	|	МАКСИМУМ(РеализацииЗаказы.Отображать) КАК Отображать	
	|ИЗ
	|	ВТ КАК РеализацииЗаказы
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацииЗаказы.СсылкаНаРеализацию,
	|	РеализацииЗаказы.СсылкаНаЗаказ";
	
	Запрос.УстановитьПараметр("ТекущийСтатус",Справочники.СтатусыЗаказовПокупателей.Выполнен);
	
	//Выгружаем весь запрос, основная таблица, с которой мы будем работать
	ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();	
	ТаблицаЗаказов.Колонки.Добавить("Обработана", Новый ОписаниеТипов("Булево"));
	
	Для Каждого ТекущаяСтрока Из ТаблицаЗаказов Цикл
		
		Если ТекущаяСтрока.Обработана Тогда
			Продолжить;
		КонецЕсли;
		
		Примечание = "";
		
		// считаем, что КоличествоЗаказов = 1
		// иначе при связи много-ко-многим возможна рекурсия вложенности и не все документы обрабатываются
		КоличествоЗаказов = 1;
		СуммаЗаказа = ТекущаяСтрока.СсылкаНаЗаказ.СуммаДокумента;	
		
		//Найдем все записи по текущему Заказу в таблице, если их больше 1 значить есть несколько реализаций по данному заказу
		НайденныеРТиУПоЗаказу = ТаблицаЗаказов.НайтиСтроки(Новый Структура("СсылкаНаЗаказ", ТекущаяСтрока.СсылкаНаЗаказ));
		КоличествоРТиУ = НайденныеРТиУПоЗаказу.Количество(); //Количество РТиУ по текущему заказу
		
		//по заказу один РТиУ
		Если КоличествоРТиУ = 1 и КоличествоЗаказов = 1 Тогда
			
			// #12360
			Если НЕ НайденныеРТиУПоЗаказу[0].Отображать Тогда
				Продолжить;
			КонецЕсли;
			
			ОтметитьСтрокуЗПРТиУОбработанной(ТаблицаЗаказов, ТекущаяСтрока.СсылкаНаЗаказ, ТекущаяСтрока.СсылкаНаРеализацию);
			
			ДанныеПроверки = ПроверитьСуммуРеализацийПоЗаказу(ТекущаяСтрока.СсылкаНаЗаказ, ТекущаяСтрока.СсылкаНаРеализацию);
			Если ДанныеПроверки.СуммаРеализаций = ДанныеПроверки.СуммаЗаказа Тогда 
				Продолжить;
			Иначе
				Примечание = ДанныеПроверки.Примечание;
			КонецЕсли;	
			
			Документ1  = ТекущаяСтрока.СсылкаНаРеализацию;
			Пояснение1 = ДанныеПроверки.СуммаРеализаций;
			Документ2  = ТекущаяСтрока.СсылкаНаЗаказ;
			Пояснение2 = ДанныеПроверки.СуммаЗаказа;				
			
			//по заказу несколько РТиУ	
		ИначеЕсли КоличествоЗаказов = 1 и КоличествоРТиУ > 1 Тогда
			
			СписокРТиУВРасшифровку = Новый СписокЗначений;
			СписокРТиУДляСверки = Новый СписокЗначений;
			МассивРеализаций = Новый Массив;
			Для Каждого НайденнаяСтрока Из НайденныеРТиУПоЗаказу Цикл
				ОтметитьСтрокуЗПРТиУОбработанной(ТаблицаЗаказов, ТекущаяСтрока.СсылкаНаЗаказ, НайденнаяСтрока.СсылкаНаРеализацию);
				СписокРТиУДляСверки.Добавить(НайденнаяСтрока.СсылкаНаРеализацию);
				Если НайденнаяСтрока.Отображать Тогда
					СписокРТиУВРасшифровку.Добавить(НайденнаяСтрока.СсылкаНаРеализацию);
				КонецЕсли;
			КонецЦикла;	
			
			ДанныеПроверки = ПроверитьСуммуРеализацийПоЗаказу(ТекущаяСтрока.СсылкаНаЗаказ, СписокРТиУДляСверки.ВыгрузитьЗначения());				
			
			Если ДанныеПроверки.СуммаРеализаций = ДанныеПроверки.СуммаЗаказа Тогда
				Продолжить;
			Иначе
				Примечание = ДанныеПроверки.Примечание;
			КонецЕсли;	
			
			Документ1  = СписокРТиУВРасшифровку;
			Пояснение1 = ДанныеПроверки.СуммаРеализаций;
			Документ2  = ТекущаяСтрока.СсылкаНаЗаказ;
			Пояснение2 = ДанныеПроверки.СуммаЗаказа;			
			
		Иначе
			Продолжить;
		КонецЕсли;
		
		//Если сюда дошли, значить есть расхождения
		НоваяСтрока = ТаблицаРезультата.Добавить();
		НоваяСтрока.Документ1 = Документ1;
		НоваяСтрока.Пояснение1 = Пояснение1;
		НоваяСтрока.Документ2 = Документ2;
		НоваяСтрока.Пояснение2 = Пояснение2;		
		НоваяСтрока.Примечание = Примечание;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ПроверитьСуммуРеализацийПоЗаказу(СсылкаНаЗаказ, МассивРеализацийКОбработке)
	
	СтруктураОтвета = Новый Структура;
	
	МассивРеализаций = Новый Массив;
	Если ТипЗнч(МассивРеализацийКОбработке) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		МассивРеализаций.Добавить(МассивРеализацийКОбработке);
	Иначе
		МассивРеализаций = МассивРеализацийКОбработке;
	КонецЕсли;
	
	СуммаРеализаций = 0;
	СуммаЗаказа = 0;
	
	МассивТипов = новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ЕдиницыИзмерений"));
	МассивТипов.Добавить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ПозицииЗаказаВРеализации = Новый ТаблицаЗначений;
	ПозицииЗаказаВРеализации.Колонки.Добавить("Документ", 					новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровИУслуг"));
	ПозицииЗаказаВРеализации.Колонки.Добавить("Номенклатура", 				новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПозицииЗаказаВРеализации.Колонки.Добавить("ХарактеристикаНоменклатуры", новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ПозицииЗаказаВРеализации.Колонки.Добавить("СерияНоменклатуры", 			новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));	
	ПозицииЗаказаВРеализации.Колонки.Добавить("ЕдиницаИзмерения", 			новый ОписаниеТипов(МассивТипов));
	ПозицииЗаказаВРеализации.Колонки.Добавить("Количество", 				новый ОписаниеТипов("Число",,, новый КвалификаторыЧисла(15, 2)));
	ПозицииЗаказаВРеализации.Колонки.Добавить("Цена", 						новый ОписаниеТипов("Число",,, новый КвалификаторыЧисла(15, 2)));
	ПозицииЗаказаВРеализации.Колонки.Добавить("ПроцентРучнойСкидки", 		новый ОписаниеТипов("Число",,, новый КвалификаторыЧисла(10, 2)));
	ПозицииЗаказаВРеализации.Колонки.Добавить("Сумма", 						новый ОписаниеТипов("Число",,, новый КвалификаторыЧисла(15, 2)));  //++
	
	ПозицииЗаказа = Новый ТаблицаЗначений;
	ПозицииЗаказа.Колонки.Добавить("Номенклатура", 				новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПозицииЗаказа.Колонки.Добавить("ХарактеристикаНоменклатуры", новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ПозицииЗаказа.Колонки.Добавить("СерияНоменклатуры", 			новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));	
	ПозицииЗаказа.Колонки.Добавить("ЕдиницаИзмерения", 			новый ОписаниеТипов(МассивТипов));
	ПозицииЗаказа.Колонки.Добавить("Количество", 				новый ОписаниеТипов("Число",,, новый КвалификаторыЧисла(15, 2)));
	ПозицииЗаказа.Колонки.Добавить("Цена", 						новый ОписаниеТипов("Число",,, новый КвалификаторыЧисла(15, 2)));
	ПозицииЗаказа.Колонки.Добавить("ПроцентРучнойСкидки", 		новый ОписаниеТипов("Число",,, новый КвалификаторыЧисла(10, 2)));
	ПозицииЗаказа.Колонки.Добавить("Сумма", 						новый ОписаниеТипов("Число",,, новый КвалификаторыЧисла(15, 2))); 
	
	//Подготовим позиции заказа в реализации	
	Для каждого СсылкаНаРеализацию из МассивРеализаций Цикл
		Для Каждого ТекущаяСтрока Из СсылкаНаРеализацию.Товары Цикл
			Если ТекущаяСтрока.Заказ = СсылкаНаЗаказ Тогда
				НоваяСтрока = ПозицииЗаказаВРеализации.Добавить();
				НоваяСтрока.Документ = СсылкаНаРеализацию;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				НоваяСтрока.Сумма = НоваяСтрока.Сумма + ТекущаяСтрока.СкидкаБонусами;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из СсылкаНаРеализацию.Услуги Цикл
			Если ТекущаяСтрока.Заказ = СсылкаНаЗаказ Тогда
				НоваяСтрока = ПозицииЗаказаВРеализации.Добавить();
				//++16574
				НоваяСтрока.Документ = СсылкаНаРеализацию;
				//--16574
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				НоваяСтрока.Сумма = НоваяСтрока.Сумма + ТекущаяСтрока.СкидкаБонусами;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//++16936
	ДокументЗаказаВРеализации = ПозицииЗаказаВРеализации.Скопировать();
	//ПозицииЗаказаВРеализации.Свернуть("Документ, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Цена, ПроцентРучнойСкидки", "Количество, Сумма");
	ДокументЗаказаВРеализации.Свернуть("Документ", "Сумма");
	ПозицииЗаказаВРеализации.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Цена, ПроцентРучнойСкидки", "Количество, Сумма");
	ПозицииЗаказаВРеализации.Сортировать("Номенклатура, Цена убыв");

	
	ТоварыЗаказа = СсылкаНаЗаказ.Товары.Выгрузить();
	СуммаТоварыЗаказа	= ТоварыЗаказа.Скопировать();
	СуммаТоварыЗаказа.Свернуть(, "Сумма");
    СуммаЗаказа = СуммаТоварыЗаказа[0].Сумма;
	
	ТоварыЗаказа.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Цена, ПроцентРучнойСкидки", "Количество, Сумма");
	ТоварыЗаказа.Сортировать("Номенклатура, Цена убыв");
	
	Примечание = "";
	//Теперь сверим реквизиты в заказе покупателя
	Для Каждого ДокументРеализации Из ДокументЗаказаВРеализации Цикл
		Если НЕ (ДокументРеализации.Документ.Организация = СсылкаНаЗаказ.Организация И ДокументРеализации.Документ.Контрагент = СсылкаНаЗаказ.Контрагент) Тогда
			Примечание = Примечание + "Несовпадение организации или контрагента в документе " + ДокументРеализации.Документ + " и в документе " + СсылкаНаЗаказ;
			Примечание = Примечание + Символы.ПС;
		Иначе
			СуммаРеализаций = СуммаРеализаций + ДокументРеализации.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если СуммаЗаказа <> СуммаРеализаций Тогда	//Теперь найдем реализации в заказе покупателя
		Примечание = Примечание + "Несовпадение суммы документа " + СсылкаНаЗаказ + " с суммами документов реализаций";
		Примечание = Примечание + Символы.ПС;
		Для Каждого СтрокаРеализации Из ПозицииЗаказаВРеализации Цикл
			Для Каждого СтрокаЗаказа Из ТоварыЗаказа Цикл //СсылкаНаЗаказ.Товары Цикл
				
				Если СтрокаЗаказа.Номенклатура = СтрокаРеализации.Номенклатура
					И СтрокаЗаказа.ХарактеристикаНоменклатуры = СтрокаРеализации.ХарактеристикаНоменклатуры
					И СтрокаЗаказа.СерияНоменклатуры = СтрокаРеализации.СерияНоменклатуры
					И СтрокаЗаказа.ЕдиницаИзмерения = СтрокаРеализации.ЕдиницаИзмерения
					И СтрокаЗаказа.Количество = СтрокаРеализации.Количество
					И СтрокаЗаказа.Цена = СтрокаРеализации.Цена
					И СтрокаЗаказа.ПроцентРучнойСкидки = СтрокаРеализации.ПроцентРучнойСкидки
					Тогда
					
					Если СтрокаЗаказа.Сумма <> СтрокаРеализации.Сумма Тогда
						Примечание = Примечание + "Номенклатура: " + СтрокаЗаказа.Номенклатура;
						Примечание = Примечание + Символы.ПС;
						Примечание = Примечание + "Сумма: " + СтрокаРеализации.Сумма + " / " + СтрокаЗаказа.Сумма + "; ";
						Примечание = Примечание + Символы.ПС + Символы.ПС; 
					КонецЕсли;
					ТоварыЗаказа.Удалить(СтрокаЗаказа);
					
				Иначе
					Если СтрокаЗаказа.Номенклатура = СтрокаРеализации.Номенклатура
						И СтрокаЗаказа.ХарактеристикаНоменклатуры = СтрокаРеализации.ХарактеристикаНоменклатуры
						И СтрокаЗаказа.СерияНоменклатуры = СтрокаРеализации.СерияНоменклатуры
						И СтрокаЗаказа.ЕдиницаИзмерения = СтрокаРеализации.ЕдиницаИзмерения Тогда
						
						// данные примечание не будут выведены в отчете, если суммы совпадают
						Примечание = Примечание + "Номенклатура: " + СтрокаЗаказа.Номенклатура;
						Примечание = Примечание + Символы.ПС;
						Если СтрокаЗаказа.Количество <> СтрокаРеализации.Количество Тогда
							Примечание = Примечание + "Количество: " + СтрокаРеализации.Количество + " / " + СтрокаЗаказа.Количество + "; ";
						КонецЕсли;
						Если СтрокаЗаказа.Цена <> СтрокаРеализации.Цена Тогда
							Примечание = Примечание + "Цена: " + СтрокаРеализации.Цена + " / " + СтрокаЗаказа.Цена + "; ";
						КонецЕсли;
						Если СтрокаЗаказа.ПроцентРучнойСкидки <> СтрокаРеализации.ПроцентРучнойСкидки Тогда
							Примечание = Примечание + "ПроцентРучнойСкидки: " + СтрокаРеализации.ПроцентРучнойСкидки + " / " + СтрокаЗаказа.ПроцентРучнойСкидки + "; ";
						КонецЕсли;					
						Примечание = Примечание + Символы.ПС + Символы.ПС;
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	//--16936
	
	СтруктураОтвета.Вставить("СуммаРеализаций", СуммаРеализаций);
	СтруктураОтвета.Вставить("СуммаЗаказа", СуммаЗаказа);
	СтруктураОтвета.Вставить("Примечание", Примечание);
	Возврат СтруктураОтвета;
	
КонецФункции

Процедура ОтметитьСтрокуЗПРТиУОбработанной(ТаблицаЗаказов, СсылкаНаЗаказ, СсылкаНаРеализацию)
	
	НайденныеСтроки = ТаблицаЗаказов.НайтиСтроки(Новый Структура("СсылкаНаРеализацию, СсылкаНаЗаказ", СсылкаНаРеализацию, СсылкаНаЗаказ));
	
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		СтрокаТЧ.Обработана = Истина;
	КонецЦикла;	
	
КонецПроцедуры

Функция ВывестиРезультатПроверки_СуммаРеализацииНеСходитсяССуммойЗаказаПокупателя(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Сумма документов ""Реализация товаров и услуг"" по Заказам покупателя не соответствует сумме документа ""Заказ покупателя"", являющегося их основанием.";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Реализация";
		ОбластьМакета.Параметры.Пояснение1 = "Сумма";
		ОбластьМакета.Параметры.Документ2 = "Заказ покупателя";
		ОбластьМакета.Параметры.Пояснение2 = "Сумма";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

//============================================== Документы не проведенные, не помеченные на удаление (+)========================================
#Область ДокументыНеПроведенныеНеПомеченныеНаУдаление

Функция ВыполнитьПроверку_ДокументыНеПроведенныеНеПомеченныеНаУдаление(ОбъектыКИсправлению) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ДокументыНеПроведенныеНеПомеченныеНаУдаление(ОбъектыКИсправлению);
	ТабДок = ВывестиРезультатПроверки_ДокументыНеПроведенныеНеПомеченныеНаУдаление(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ДокументыНеПроведенныеНеПомеченныеНаУдаление(ОбъектыКИсправлению)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //Ссылка на документ
	
	НомерШага = 0;
	ТекстЗапроса = "";                               
	Для Каждого Документ Из Метаданные.Документы Цикл
		
		Если Документ.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить 
			И НЕ Документ.Имя = "ОтправкаСМС" 
			И НЕ Документ.Имя = "ЭлектронноеПисьмо" Тогда
			
			Если НомерШага > 0 Тогда
				ТекстЗапроса = ТекстЗапроса + " ОБЪЕДИНИТЬ ВСЕ ";
			КонецЕсли;
			
			Текст = " ВЫБРАТЬ
			|    Документ.Ссылка КАК Документ1
			|ИЗ 
			|    Документ.Накладная КАК Документ
			|ГДЕ
			|    НЕ Документ.Проведен И НЕ Документ.ПометкаУдаления ";
			
			Текст = СтрЗаменить(Текст, "Документ.Накладная", "Документ." + Документ.Имя);
			
			ТекстЗапроса = ТекстЗапроса + Текст;
			
			НомерШага = НомерШага + 1;
			
		КонецЕсли;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрокаОбъектыКИсправлению = ОбъектыКИсправлению.Добавить();
		НоваяСтрокаОбъектыКИсправлению.Документ1 = Выборка.Документ1;
		НоваяСтрокаОбъектыКИсправлению.Исправить = "ПометитьНаУдалениеНепроведенныеДокументы";
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ДокументыНеПроведенныеНеПомеченныеНаУдаление(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Не проведенные и не помеченные на удаление документы";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = "" + ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "ПометитьНаУдалениеНепроведенныеДокументы";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления помечает документы на удаление";
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Документ";
		ОбластьМакета.Параметры.Пояснение1 = "";
		ОбластьМакета.Параметры.Документ2 = "";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

Функция ИсправитьОбъект_ДокументыНеПроведенныеНеПомеченныеНаУдаление(ДокументСсылка) Экспорт
	
	ДокОбъект = ДокументСсылка.ПолучитьОбъект();				
	ДокОбъект.ПометкаУдаления = Истина;
	
	Попытка	
		ДокОбъект.Записать();
		Возврат Истина;
	Исключение
		Сообщить("Ошибка пометки на удаление: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

//============================================== Документы и справочники помеченные на удаление (+)========================================
#Область ДокументыИСправочникиПомеченныеНаУдаление

Функция ВыполнитьПроверку_ДокументыИСправочникиПомеченныеНаУдаление() Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ДокументыИСправочникиПомеченныеНаУдаление();
	ТабДок = ВывестиРезультатПроверки_ДокументыИСправочникиПомеченныеНаУдаление(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ДокументыИСправочникиПомеченныеНаУдаление()
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //Ссылка на документ или справочник
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); //ыид документа или спарвочника
	
	//документы
	НомерШага = 0;
	ТекстЗапроса = "";                               
	Для Каждого Документ Из Метаданные.Документы Цикл
		
		Если НомерШага > 0 Тогда
			ТекстЗапроса = ТекстЗапроса + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли;
		
		Текст = " ВЫБРАТЬ
		|    Документ.Ссылка КАК Документ1
		|ИЗ 
		|    Документ.Накладная КАК Документ
		|ГДЕ
		|    Документ.ПометкаУдаления ";
		
		Текст = СтрЗаменить(Текст, "Документ.Накладная", "Документ." + Документ.Имя);
		
		ТекстЗапроса = ТекстЗапроса + Текст;
		
		НомерШага = НомерШага + 1;
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Пояснение1 = Строка(ТипЗнч(НоваяСтрока.Документ1));
	КонецЦикла;
	
	//справочники
	НомерШага = 0;
	ТекстЗапроса = "";                               
	Для Каждого Документ Из Метаданные.Справочники Цикл
		
		Если Документ.Имя = "ИдентификаторыОбъектовМетаданных"
			//++ №13508
			Или Документ.Имя = "ПредопределенныеВариантыОтчетов"
			Или Документ.Имя = "ПредопределенныеВариантыОтчетовРасширений"
			//-- №13508
			Тогда
			Продолжить;
		КонецЕсли;
		
		Если НомерШага > 0 Тогда
			ТекстЗапроса = ТекстЗапроса + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли;
		
		Текст = " ВЫБРАТЬ
		|    Справочник.Ссылка КАК Документ1
		|ИЗ 
		|    Справочник.Накладная КАК Справочник
		|ГДЕ
		|    Справочник.ПометкаУдаления ";
		
		Текст = СтрЗаменить(Текст, "Справочник.Накладная", "Справочник." + Документ.Имя);
		
		ТекстЗапроса = ТекстЗапроса + Текст;
		
		НомерШага = НомерШага + 1;
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Пояснение1 = Строка(ТипЗнч(НоваяСтрока.Документ1));
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ДокументыИСправочникиПомеченныеНаУдаление(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Помеченные на удаление документы и элементы справочников";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Объект";
		ОбластьМакета.Параметры.Пояснение1 = "Вид объекта";
		ОбластьМакета.Параметры.Документ2 = "";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область ДанныеПоПотолкуЗаказаНаПроизводствоНеСходятсяСДаннымиЗаказаПокупателя
//============================================== ДанныеПоПотолкуЗаказаНаПроизводствоНеСходятсяСДаннымиЗаказаПокупателя (+)========================================

Функция ВыполнитьПроверку_ДанныеПоПотолкуЗаказаНаПроизводствоНеСходятсяСДаннымиЗаказаПокупателя(ОбъектыКИсправлению, СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ДанныеПоПотолкуЗаказаНаПроизводствоНеСходятсяСДаннымиЗаказаПокупателя(ОбъектыКИсправлению, СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ДанныеПоПотолкуЗаказаНаПроизводствоНеСходятсяСДаннымиЗаказаПокупателя(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ДанныеПоПотолкуЗаказаНаПроизводствоНеСходятсяСДаннымиЗаказаПокупателя(ОбъектыКИсправлению, СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //Заказ на произодство
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); //сумма документа
	ТаблицаРезультата.Колонки.Добавить("Документ2"); //Заказ покупателя
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); //сумма документа
	ТаблицаРезультата.Колонки.Добавить("Примечание"); //не используется
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЗаказа", Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка);
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.ДокументОснование КАК Документ2,
	|	ДанныеДокумента.СуммаДокумента КАК Пояснение1,
	|	ДанныеДокумента.ДокументОснование.СуммаДокумента КАК Пояснение2
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ДанныеДокумента
	
	//#14923 по тем ЗНП, которые указаны в ТЧ "Товары и услуги" в ЗП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ТоварыЗП
	|		ПО (ТоварыЗП.Ссылка = ДанныеДокумента.ДокументОснование)
	|			И (ТоварыЗП.ЗаказНаПроизводство = ДанныеДокумента.Ссылка)
	
	|ГДЕ
	//|	НЕ ДанныеДокумента.ПометкаУдаления
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.ВидЗаказа = &ВидЗаказа
	|	И ДанныеДокумента.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	|	И НЕ ДанныеДокумента.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И НЕ ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Отменен)
	|	И (ДанныеДокумента.ПродукцияНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	|			ИЛИ ДанныеДокумента.ПродукцияНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез))
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";	
	
	//ТаблицаЗаказов = Запрос.Выполнить().Выгрузить(); - не нужен? Нигде не используется
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		//Нужно проверить, что потолок из ЗнП есть в ЗП
		Если Выборка.Документ2.Товары.НайтиСтроки(новый Структура("Номенклатура", Выборка.Документ1.ПродукцияНоменклатура)).Количество() > 0 Тогда 
			
			СтруктураПроверки = ОбщийМодуль.ЗаказНаПроизводствоСоответствуетЗаказуПокупателя(Выборка.Документ1, Выборка.Документ2);
			Если НЕ СтруктураПроверки.Результат Тогда
				
				//Необходимо показать сумму Заказа покупателя, только по позициям ЗнП
				СуммаЗП = 0;
				Для Каждого ТекущаяСтрока Из СтруктураПроверки.МассивСравнения Цикл // №13466 было: Для Каждого ТекущаяСтрока Из СтруктураПроверки.МассивЗП Цикл
					СуммаЗП = СуммаЗП + ТекущаяСтрока.Сумма;
				КонецЦикла;
				
				НоваяСтрока = ТаблицаРезультата.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
				НоваяСтрока.Пояснение2 = СуммаЗП;
				
				НоваяСтрока = ОбъектыКИсправлению.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
				НоваяСтрока.Исправить = "ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя";
				НоваяСтрока.ПараметрБулево = СтруктураПроверки.ДоступноИзменениеПриНаличииВыпуска; //#13200 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ДанныеПоПотолкуЗаказаНаПроизводствоНеСходятсяСДаннымиЗаказаПокупателя(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Данные документа ""Заказ на производство"" не соответствуют данным документа ""Заказ покупателя""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		//ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		//ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		//Таб.Вывести(ОбластьМакета, 1);
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "";
		Таб.Вывести(ОбластьМакета, 1);
		
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Заказ на производство";
		ОбластьМакета.Параметры.Пояснение1 = "Сумма";
		ОбластьМакета.Параметры.Документ2 = "Заказ покупателя";
		ОбластьМакета.Параметры.Пояснение2 = "Сумма";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

Процедура ИсправитьОбъект_ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя(ДокументЗНП, ДокументЗП, ДоступноИзменениеПриНаличииВыпуска) Экспорт
	
	//#14923
	//ОбщийМодуль.ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя(ДокументЗНП, ДокументЗНП.ПродукцияНоменклатура, ДокументЗП,, ДокументЗНП.ПродукцияУИСтроки, ДоступноИзменениеПриНаличииВыпуска);	
	ОбщийМодуль.ОбновитьЗаказНаПроизводствоПоЗаказуПокупателя(ДокументЗНП, ДоступноИзменениеПриНаличииВыпуска);	
	
КонецПроцедуры

#КонецОбласти

#Область ПотолокУказанныйВЗаказеНаПроизводствоОтсутствуетВЗаказеПокупателя
//============================================== ПотолокУказанныйВЗаказеНаПроизводствоОтсутствуетВЗаказеПокупателя (+)========================================

Функция ВыполнитьПроверку_ПотолокУказанныйВЗаказеНаПроизводствоОтсутствуетВЗаказеПокупателя(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ПотолокУказанныйВЗаказеНаПроизводствоОтсутствуетВЗаказеПокупателя(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ПотолокУказанныйВЗаказеНаПроизводствоОтсутствуетВЗаказеПокупателя(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ПотолокУказанныйВЗаказеНаПроизводствоОтсутствуетВЗаказеПокупателя(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //Заказ на произодство
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); //Потолок или список типовых отрезов
	ТаблицаРезультата.Колонки.Добавить("Документ2"); //Заказ покупателя
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); //не используется
	ТаблицаРезультата.Колонки.Добавить("Примечание"); //не используется
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.УстановитьПараметр("ВидЗаказа", Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.ДокументОснование КАК Документ2,
	|	ДанныеДокумента.ПродукцияНоменклатура,
	|	ДанныеДокумента.ПродукцияУИСтроки,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидЗаказа = Значение(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроизводствоПотолка
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.ПометкаУдаления
	|	И (ДанныеДокумента.ВидЗаказа = Значение(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка)
	|		ИЛИ ДанныеДокумента.ВидЗаказа = Значение(Перечисление.ВидыЗаказовНаПроизводство.ТиповоеПроизводство))
	|	И ДанныеДокумента.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	|	И НЕ ДанныеДокумента.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И НЕ ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Отменен)
	|	И (ДанныеДокумента.ПродукцияНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	|			ИЛИ ДанныеДокумента.ПродукцияНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез))
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";		
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Отсутствует = Ложь;
		СписокПотолков = "";
		
		//Если потолок, то смотрим по ПродукцияНоменклатура, если типовое производство, то смотрим для каждой номенклатуры из ТЧ Продукции
		Если Выборка.ПроизводствоПотолка Тогда
			
			Если Выборка.Документ2.Товары.НайтиСтроки(новый Структура("Номенклатура, УИСтроки", Выборка.ПродукцияНоменклатура, Выборка.ПродукцияУИСтроки)).Количество() = 0 Тогда
				Отсутствует = Истина;
				СписокПотолков = Выборка.ПродукцияНоменклатура;
			КонецЕсли;
			
		Иначе
			
			СписокПотолков = новый СписокЗначений;
			
			Для Каждого ТиповойПотолок Из Выборка.Документ1.Продукция Цикл
				Если Выборка.Документ2.Товары.НайтиСтроки(новый Структура("Номенклатура, УИСтроки", ТиповойПотолок.Номенклатура, ТиповойПотолок.УИСтроки)).Количество() = 0 Тогда
					Отсутствует = Истина;
					СписокПотолков.Добавить(ТиповойПотолок.Номенклатура);
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;	
		
		Если Отсутствует Тогда
			НоваяСтрока = ТаблицаРезультата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Пояснение1 = СписокПотолков;
		КонецЕсли;		
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ПотолокУказанныйВЗаказеНаПроизводствоОтсутствуетВЗаказеПокупателя(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Потолок указанный в документе ""Заказ на производство"" отсутствует в документе ""Заказ покупателя""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		//ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		//ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		//ОбластьМакета.Параметры.Исправить = "ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя";
		//Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Заказ на производство";
		ОбластьМакета.Параметры.Пояснение1 = "Список потолков";
		ОбластьМакета.Параметры.Документ2 = "Заказ покупателя";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область ПроверкаСоответствияПродукцииВыпускаИЗаказаНаПроизводство
//(+)
Функция ВыполнитьПроверку_ПроверкаСоответствияПродукцииВыпускаИЗаказаНаПроизводство(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ПроверкаСоответствияПродукцииВыпускаИЗаказаНаПроизводство(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ПроверкаСоответствияПродукцииВыпускаИЗаказаНаПроизводство(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ПроверкаСоответствияПродукцииВыпускаИЗаказаНаПроизводство(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //Выпуск
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); 
	ТаблицаРезультата.Колонки.Добавить("Документ2"); //Заказ НП
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); 
	ТаблицаРезультата.Колонки.Добавить("Примечание"); //не используется
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.Основание КАК Документ2
	|ИЗ
	|	Документ.ВыпускПродукции КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.ПометкаУдаления
	|	И ДанныеДокумента.ВидЗаказа В (ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка), ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ТиповоеПроизводство))
	|	И ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|	И НЕ ДанныеДокумента.Основание = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";
	
	ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПроверки = ОбщийМодуль.ПроверкаСоответствияПродукцииВыпускаИЗаказаНаПроизводство(Выборка.Документ1, Выборка.Документ2);
		Если НЕ СтруктураПроверки.Результат Тогда
			НоваяСтрока = ТаблицаРезультата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ПроверкаСоответствияПродукцииВыпускаИЗаказаНаПроизводство(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Данные по продукции документа ""Выпуск продукции"" не сходятся с данными документа ""Заказ на производство""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		//ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		//ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		//ОбластьМакета.Параметры.Исправить = "...";
		//Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Выпуск продукции";
		ОбластьМакета.Параметры.Пояснение1 = "";
		ОбластьМакета.Параметры.Документ2 = "Заказ на производство";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область ПроверкаСоответствияУслугВыпускаИЗаказаНаПроизводство	
//(+)
Функция ВыполнитьПроверку_ПроверкаСоответствияУслугВыпускаИЗаказаНаПроизводство(ОбъектыКИсправлению, СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ПроверкаСоответствияУслугВыпускаИЗаказаНаПроизводство(ОбъектыКИсправлению, СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ПроверкаСоответствияУслугВыпускаИЗаказаНаПроизводство(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ПроверкаСоответствияУслугВыпускаИЗаказаНаПроизводство(ОбъектыКИсправлению, СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //Выпуск
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); 
	ТаблицаРезультата.Колонки.Добавить("Документ2"); //Заказ НП
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); 
	ТаблицаРезультата.Колонки.Добавить("Примечание"); //не используется
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.Основание КАК Документ2
	|ИЗ
	|	Документ.ВыпускПродукции КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.ПометкаУдаления
	|	И ДанныеДокумента.ВидЗаказа В (ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка), ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ТиповоеПроизводство))
	|	И ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|	И НЕ ДанныеДокумента.Основание = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";
	
	ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПроверки = ОбщийМодуль.ПроверкаСоответствияУслугВыпускаИЗаказаНаПроизводство(Выборка.Документ1, Выборка.Документ2);
		Если НЕ СтруктураПроверки.Результат Тогда
			НоваяСтрока = ТаблицаРезультата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
			
			НоваяСтрока = ОбъектыКИсправлению.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Исправить = "ОбновитьУслугиВыпускаПоЗаказуНаПроизводство";
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ПроверкаСоответствияУслугВыпускаИЗаказаНаПроизводство(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Данные по услугам документа ""Выпуск продукции"" не сходятся с данными документа ""Заказ на производство""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		//ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		//ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		//Таб.Вывести(ОбластьМакета, 1);
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "ОбновитьУслугиВыпускаПоЗаказуНаПроизводство";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления в документе ""Выпуск продукции"" очищает табличную часть ""Услуги"" и перезаполняет ее по документу-основанию ""Заказ на производство""";
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Выпуск продукции";
		ОбластьМакета.Параметры.Пояснение1 = "";
		ОбластьМакета.Параметры.Документ2 = "Заказ на производство";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

Функция ИсправитьОбъект_ОбновитьУслугиВыпускаПоЗаказуНаПроизводство(ДокументВыпуска, ДокументЗНП) Экспорт
	
	ОбъектИсправления = ДокументВыпуска.ПолучитьОбъект();
	
	ОбъектИсправления.Услуги.Очистить();
	Для Каждого СтрокаЗаказа Из ДокументЗНП.Услуги Цикл
		СтрокаВыпуска = ОбъектИсправления.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыпуска, СтрокаЗаказа);
	КонецЦикла;
	
	Попытка
		Если ОбъектИсправления.Проведен Тогда
			ОбъектИсправления.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбъектИсправления.Записать();
		КонецЕсли;
		Возврат Истина;
	Исключение
		//Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти	

#Область ПроверкаЗаказовНаПроизводствоВНедействительныхСтатусах
//(+)
Функция ВыполнитьПроверку_ПроверкаЗаказовНаПроизводствоВНедействительныхСтатусах(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ПроверкаЗаказовНаПроизводствоВНедействительныхСтатусах(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ПроверкаЗаказовНаПроизводствоВНедействительныхСтатусах(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ПроверкаЗаказовНаПроизводствоВНедействительныхСтатусах(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1");
	ТаблицаРезультата.Колонки.Добавить("Пояснение1");
	ТаблицаРезультата.Колонки.Добавить("Документ2");
	ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	//Первый запрос выводит в статусах, которые теперь не используются
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.ТекущийСтатус КАК Пояснение1
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ТекущийСтатус В (ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Новый), ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Подтвержден), ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Отгружен))
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	//Заказы на производстве в статусе произведен без выпуска
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.ТекущийСтатус КАК Пояснение1
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ВыпускПродукции
	|		ПО ДанныеДокумента.Ссылка = ВыпускПродукции.Основание
	|ГДЕ
	|	ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Произведен)
	|	И ЕСТЬNULL(ВыпускПродукции.Ссылка, ЗНАЧЕНИЕ(Документ.ВыпускПродукции.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.ВыпускПродукции.ПустаяСсылка)
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Примечание = "Заказ на производство в статусе ""Произведен"" без выпуска продукции";
	КонецЦикла;	
	
	//Заказы на производстве в статусе произведен с помеченным на удаление выпуском
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Основание КАК Документ1,
	|	ДанныеДокумента.Основание.ТекущийСтатус КАК Пояснение1,
	|	ДанныеДокумента.Ссылка КАК Документ2		
	|ИЗ
	|	Документ.ВыпускПродукции КАК ДанныеДокумента
	|		
	|ГДЕ		
	|	ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|	И ДанныеДокумента.Основание <> Значение(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|	И ДанныеДокумента.Основание.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Произведен)
	|	И ДанныеДокумента.ПометкаУдаления
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Примечание = "Заказ на производство в статусе ""Произведен"" с помеченным на удаление выпуском продукции";
	КонецЦикла;	
	
	//Заказ на производство в работе, отменен либо помечен на удаление но с выпуском
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Основание КАК Документ1,
	|	ДанныеДокумента.Основание.ТекущийСтатус КАК Пояснение1,
	|	ДанныеДокумента.Ссылка КАК Документ2,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Основание.ПометкаУдаления
	|			ТОГДА ""помечен на удаление.""
	|		КОГДА ДанныеДокумента.Основание.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Отменен)
	|			ТОГДА ""находится в статусе 'Отменен'.""
	|		КОГДА ДанныеДокумента.Основание.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.ВПроизводстве)
	|			ТОГДА ""находится в статусе 'В производстве'.""
	|	КОНЕЦ КАК Пояснение
	|ИЗ
	|	Документ.ВыпускПродукции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|	И ДанныеДокумента.Основание <> ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|	И (ДанныеДокумента.Основание.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.ВПроизводстве)
	|			ИЛИ ДанныеДокумента.Основание.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Отменен)
	|			ИЛИ ДанныеДокумента.Основание.ПометкаУдаления)
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Примечание = "Проведенный выпуск продукции с основанием заказ на производство, который " + Выборка.Пояснение;
	КонецЦикла;	
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ПроверкаЗаказовНаПроизводствоВНедействительныхСтатусах(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Заказы на производство в недействительных статусах";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Документ";
		ОбластьМакета.Параметры.Пояснение1 = "Статус";
		ОбластьМакета.Параметры.Документ2 = "";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти	

#Область ПроверкаСостоянияОтгрузкиПоВыполненнымЗаказамПокупателей
//(+)
Функция ВыполнитьПроверку_ПроверкаСостоянияОтгрузкиПоВыполненнымЗаказамПокупателей(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ПроверкаСостоянияОтгрузкиПоВыполненнымЗаказамПокупателей(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ПроверкаСостоянияОтгрузкиПоВыполненнымЗаказамПокупателей(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ПроверкаСостоянияОтгрузкиПоВыполненнымЗаказамПокупателей(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //Ссылка на документ
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); //Ссылка на документ
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1
	|ИЗ
	|	Документ.ЗаказПокупателя ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.Выполнен)
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураВозврата = Документы.ЗаказПокупателя.ВсеТоварыПоЗаказуОтгружены(Выборка.Документ1, Выборка.Документ1.Товары);
		Если НЕ СтруктураВозврата.Результат Тогда		
			НоваяСтрока = ТаблицаРезультата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Пояснение1 = СтруктураВозврата.Описание;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ПроверкаСостоянияОтгрузкиПоВыполненнымЗаказамПокупателей(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Состояние отгрузки по выполненным заказам покупателей";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Документ";
		ОбластьМакета.Параметры.Пояснение1 = "Описание";
		ОбластьМакета.Параметры.Документ2 = "";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область УникальныйПотолокБолееЧемВОдномЗаказеПокупателя
//(+)
Функция ВыполнитьПроверку_УникальныйПотолокБолееЧемВОдномДокументе() Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_УникальныйПотолокБолееЧемВОдномДокументе();
	ТабДок = ВывестиРезультатПроверки_УникальныйПотолокБолееЧемВОдномДокументе(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_УникальныйПотолокБолееЧемВОдномДокументе()
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //Номенклатура
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); 
	ТаблицаРезультата.Колонки.Добавить("Документ2"); //Документ (список)
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); 
	ТаблицаРезультата.Колонки.Добавить("Примечание"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_ПотолкиЗП
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Проведен
	|	И (ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	|			ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез))
	|	И (ДанныеДокумента.Ссылка.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)
	|			ИЛИ ДанныеДокумента.Ссылка.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.Выполнен))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПотолкиЗП.Номенклатура КАК Номенклатура,
	|	ВТ_ПотолкиЗП.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_НеУникальныеПотолкиЗП
	|ИЗ
	|	ВТ_ПотолкиЗП КАК ВТ_ПотолкиЗП
	|ГДЕ
	|	ВТ_ПотолкиЗП.Количество > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.ПродукцияНоменклатура КАК Номенклатура,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_ПотолкиЗНП
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И НЕ ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовНаПроизводство.Отменен)
	|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка)
	|	И НЕ ДанныеДокумента.ПродукцияНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И (ДанныеДокумента.ПродукцияНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	|			ИЛИ ДанныеДокумента.ПродукцияНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.ПродукцияНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПотолкиЗНП.Номенклатура КАК Номенклатура,
	|	ВТ_ПотолкиЗНП.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_НеУникальныеПотолкиЗНП
	|ИЗ
	|	ВТ_ПотолкиЗНП КАК ВТ_ПотолкиЗНП
	|ГДЕ
	|	ВТ_ПотолкиЗНП.Количество > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.ПродукцияНоменклатура КАК Номенклатура,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_ПотолкиВыпуски
	|ИЗ
	|	Документ.ВыпускПродукции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка)
	|	И НЕ ДанныеДокумента.ПродукцияНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И (ДанныеДокумента.ПродукцияНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	|			ИЛИ ДанныеДокумента.ПродукцияНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.ПродукцияНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПотолкиВыпуски.Номенклатура КАК Номенклатура,
	|	ВТ_ПотолкиВыпуски.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_НеУникальныеПотолкиВыпуски
	|ИЗ
	|	ВТ_ПотолкиВыпуски КАК ВТ_ПотолкиВыпуски
	|ГДЕ
	|	ВТ_ПотолкиВыпуски.Количество > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_НеУникальныеПотолкиЗП.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.Ссылка КАК ДокументПотолка,
	|	""Заказ покупателя"" КАК ТипДокумента
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_НеУникальныеПотолкиЗП КАК ВТ_НеУникальныеПотолкиЗП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ДанныеДокумента
	|		ПО ВТ_НеУникальныеПотолкиЗП.Номенклатура = ДанныеДокумента.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_НеУникальныеПотолкиЗНП.Номенклатура,
	|	ДанныеДокумента.Ссылка,
	|	""Заказ на производство""
	|ИЗ
	|	ВТ_НеУникальныеПотолкиЗНП КАК ВТ_НеУникальныеПотолкиЗНП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство КАК ДанныеДокумента
	|		ПО ВТ_НеУникальныеПотолкиЗНП.Номенклатура = ДанныеДокумента.ПродукцияНоменклатура
	|			И (ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_НеУникальныеПотолкиВыпуски.Номенклатура,
	|	ДанныеДокумента.Ссылка,
	|	""Выпуск продукции""
	|ИЗ
	|	ВТ_НеУникальныеПотолкиВыпуски КАК ВТ_НеУникальныеПотолкиВыпуски
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ДанныеДокумента
	|		ПО ВТ_НеУникальныеПотолкиВыпуски.Номенклатура = ДанныеДокумента.ПродукцияНоменклатура
	|			И (ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Номенклатура КАК Номенклатура,
	|	ВТ_Итог.ДокументПотолка КАК ДокументПотолка,
	|	ВТ_Итог.ТипДокумента КАК ТипДокумента
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Итог.Номенклатура,
	|	ТипДокумента
	|ИТОГИ ПО
	|	Номенклатура,
	|	ТипДокумента";
	
	ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");		
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		НоваяСтрока.Документ1 = ВыборкаНоменклатуры.Номенклатура;
		
		ВыборкаТиповДокументов = ВыборкаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТипДокумента");
		ЭтоПервыйТип = Истина;
		Пока ВыборкаТиповДокументов.Следующий() Цикл
			СписокДокументовВРасшифровку = Новый СписокЗначений;
			
			Выборка = ВыборкаТиповДокументов.Выбрать();
			Пока Выборка.Следующий() Цикл
				СписокДокументовВРасшифровку.Добавить(Выборка.ДокументПотолка);
			КонецЦикла;
			
			Если ЭтоПервыйТип Тогда
				НоваяСтрока.Документ2 = СписокДокументовВРасшифровку;
				ЭтоПервыйТип = Ложь;
			Иначе
				НоваяСтрока = ТаблицаРезультата.Добавить();
				НоваяСтрока.Документ2 = СписокДокументовВРасшифровку;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_УникальныйПотолокБолееЧемВОдномДокументе(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Уникальный потолок более чем в одном документе.";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Потолок/отрез";
		ОбластьМакета.Параметры.Пояснение1 = "";
		ОбластьМакета.Параметры.Документ2 = "Документ";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область ПроверкаЗаказыНаПроизводствоВРеализации
//(+)
Функция ВыполнитьПроверку_ЗаказыНаПроизводствоВРеализации(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ЗаказыНаПроизводствоВРеализации(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ЗаказыНаПроизводствоВРеализациие(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ЗаказыНаПроизводствоВРеализации(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //Документ
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); 
	ТаблицаРезультата.Колонки.Добавить("Документ2"); 
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); 
	ТаблицаРезультата.Колонки.Добавить("Примечание"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	""в товарах"" КАК Примечание
	|ПОМЕСТИТЬ ВТ_Временная
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Заказ ССЫЛКА Документ.ЗаказНаПроизводство
	|	И НЕ ДанныеДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка,
	|	""в услугах""
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Заказ ССЫЛКА Документ.ЗаказНаПроизводство
	|	И НЕ ДанныеДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка,
	|	""в основаниях""
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Основания КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|	И НЕ ДанныеДокумента.Основание = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка,
	|	""в основании""
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|	И НЕ ДанныеДокумента.Основание = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Временная.Документ1 КАК Документ1,
	|	ВТ_Временная.Примечание КАК Примечание
	|ИЗ
	|	ВТ_Временная КАК ВТ_Временная
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Временная.Документ1.Дата
	|ИТОГИ ПО
	|	Документ1";
	
	ВыборкаПоДокументам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ1");
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		НоваяСтрока.Документ1 = ВыборкаПоДокументам.Документ1;
		
		Примечание = "";
		
		Выборка = ВыборкаПоДокументам.Выбрать();
		Пока Выборка.Следующий() Цикл
			Примечание = Примечание + ?(ПустаяСтрока(Примечание), "", "; ") + Выборка.Примечание;
		КонецЦикла;
		
		НоваяСтрока.Примечание = Примечание;		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ЗаказыНаПроизводствоВРеализациие(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Ссылки на заказ на производство в реквизитах и таблицах реализаций.";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Документ";
		ОбластьМакета.Параметры.Пояснение1 = "";
		ОбластьМакета.Параметры.Документ2 = "";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область ПроверкаЗаполнениеЗаказовВТабличныхЧастяхРеализаций
//(+)
Функция ВыполнитьПроверку_ЗаполнениеЗаказовВТабличныхЧастяхРеализаций(ОбъектыКИсправлению, СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ЗаполнениеЗаказовВТабличныхЧастяхРеализаций(ОбъектыКИсправлению, СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ЗаполнениеЗаказовВТабличныхЧастяхРеализаций(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ЗаполнениеЗаказовВТабличныхЧастяхРеализаций(ОбъектыКИсправлению, СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //Документ
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); 
	ТаблицаРезультата.Колонки.Добавить("Документ2"); 
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); 
	ТаблицаРезультата.Колонки.Добавить("Примечание"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Заказ	
	|	
	|ПОМЕСТИТЬ ВТ_ТЧ
	|	
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК ДанныеДокумента	
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Проведен
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Заказ	
	|	
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Услуги КАК ДанныеДокумента	
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Проведен
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|	
	|;	
	|//////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваров.Ссылка КАК Ссылка,	
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваров.Заказ) КАК КоличествоРазличные
	|	
	|ПОМЕСТИТЬ ВТ
	|	
	|ИЗ
	|	ВТ_ТЧ КАК РеализацияТоваров	
	|	
	|СГРУППИРОВАТЬ ПО
	|
	|	РеализацияТоваров.Ссылка	
	|	
	|;	
	|//////////////////////////////	
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РеализацияТоваров.Ссылка,	
	|	РеализацияТоваров.КоличествоРазличные
	|ИЗ
	|	ВТ КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.КоличествоРазличные > 1";
	
	//В эту выборку попадут реализации, по которым указаны разные значения в колонке "Заказ", учитываются обе табличные части.
	//Причём "Неопределено" также считается другим значением
	//НО! сюда попадут реализации к примеру если просто указаны разные ЗП или ЗНП, или к примеру в одном Неопределено, в другом пустая ссылка
	//Поэтому они будут обработаны в цикле с перебором табличных частей
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		
		ЕстьРазличия = Ложь;
		БылТип = Неопределено;
		БылоЗначение = Неопределено;
		ВсеЗначенияПустыеИлиНеопределено = Истина;
		Сч = 0;
		
		ЗапросТЧ = новый Запрос;
		ЗапросТЧ.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ		
		|	РеализацияТоваровИУслугТовары.Заказ	
		|	
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары	
		|	
		|ГДЕ
		|	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ		
		|	РеализацияТоваровИУслугУслуги.Заказ	
		|	
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг.Услуги КАК РеализацияТоваровИУслугУслуги	
		|	
		|ГДЕ
		|	РеализацияТоваровИУслугУслуги.Ссылка = &Ссылка";
		ЗапросТЧ.УстановитьПараметр("Ссылка", Выборка.Ссылка);
		
		//Выбираем все различные значения из табличных частей текущей реализации
		ВыборкаТЧ = ЗапросТЧ.Выполнить().Выбрать();
		
		Пока ВыборкаТЧ.Следующий() Цикл
			
			//первое значение мы не обрабатываем, т.к. не с чем сравнивать
			//логика сравнения: если текущий тип не равен предыдущему либо в одном заполнено значение в другом нет - значить нужно вывести как ошибку
			Если Сч > 0 Тогда
				Если (ТипЗнч(ВыборкаТЧ.Заказ) <> БылТип) 
					ИЛИ (ЗначениеЗаполнено(ВыборкаТЧ.Заказ) И Не ЗначениеЗаполнено(БылоЗначение))
					ИЛИ (НЕ ЗначениеЗаполнено(ВыборкаТЧ.Заказ) И ЗначениеЗаполнено(БылоЗначение))
					Тогда
					ЕстьРазличия = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Сч = Сч + 1;
			БылТип = ТипЗнч(ВыборкаТЧ.Заказ);
			БылоЗначение = ВыборкаТЧ.Заказ;
			
			//Исключаем что попался РТиУ где Неопределено или не заполнено, такие РТиУ не нужно выводить как ошибку
			Если НЕ ТипЗнч(ВыборкаТЧ.Заказ) = Тип("Неопределено")
				И ЗначениеЗаполнено(ВыборкаТЧ.Заказ) Тогда
				ВсеЗначенияПустыеИлиНеопределено = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьРазличия И Не ВсеЗначенияПустыеИлиНеопределено Тогда
			НоваяСтрока = ТаблицаРезультата.Добавить();
			НоваяСтрока.Документ1 = Выборка.Ссылка;
			
			НоваяСтрока = ОбъектыКИсправлению.Добавить();
			НоваяСтрока.Документ1 = Выборка.Ссылка;
			НоваяСтрока.Исправить = "ЗаполнитьЗначениеЗаказаВТабличныхЧастяхРеализации";
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ЗаполнениеЗаказовВТабличныхЧастяхРеализаций(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Заполнение заказов в табличных частях реализаций.";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "ЗаполнитьЗначениеЗаказаВТабличныхЧастяхРеализации";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления заполняет значения ""Заказ"" в табличных частях ""Товары"" и ""Услуги"" документа ""Реализация товаров и услуг""";
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Документ";
		ОбластьМакета.Параметры.Пояснение1 = "";
		ОбластьМакета.Параметры.Документ2 = "";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

Функция ИсправитьОбъект_ЗаполнитьЗначениеЗаказаВТабличныхЧастяхРеализации(ДокументРеализация) Экспорт
	
	ОбъектИсправления = ДокументРеализация.ПолучитьОбъект();
	
	ЕстьРазличия = Ложь; 
	
	//сверяем сумму заказа и сумма реализации, относящуюся к данному заказу (явно указан заказ или пустой заказ в ТЧ)
	СуммаЗаказа = 0;
	СуммаРеализации = 0;
	Если ТипЗнч(ОбъектИсправления.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		СуммаЗаказа = ОбъектИсправления.Основание.СуммаДокумента; 
		
		Для Каждого ТекСтрока Из ОбъектИсправления.Товары Цикл
			Если ТекСтрока.Заказ = ОбъектИсправления.Основание
				или ТекСтрока.Заказ = Неопределено
				или ТекСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка() Тогда
				СуммаРеализации = СуммаРеализации + ТекСтрока.Сумма;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтрока Из ОбъектИсправления.Услуги Цикл
			Если ТекСтрока.Заказ = ОбъектИсправления.Основание
				или ТекСтрока.Заказ = Неопределено
				или ТекСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка() Тогда
				СуммаРеализации = СуммаРеализации + ТекСтрока.Сумма;
			КонецЕсли;
		КонецЦикла;
		Если НЕ СуммаЗаказа = СуммаРеализации Тогда
			ЕстьРазличия = Истина;
			Возврат Ложь;
		КонецЕсли;
		
		//проверяем на полное соответствие по ТЧ "Товары" и "Услуги"
		
		
		ТаблицаРеализации = ОбъектИсправления.Товары.Выгрузить();
		ТаблицаРеализации.Очистить();
		Для Каждого ТекСтрока Из ОбъектИсправления.Товары Цикл
			Если ТекСтрока.Заказ = ОбъектИсправления.Основание
				или ТекСтрока.Заказ = Неопределено
				или ТекСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка() Тогда
				НоваяСтрока = ТаблицаРеализации.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекСтрока Из ОбъектИсправления.Услуги Цикл
			Если ТекСтрока.Заказ = ОбъектИсправления.Основание
				или ТекСтрока.Заказ = Неопределено
				или ТекСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка() Тогда
				НоваяСтрока = ТаблицаРеализации.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаЗаказа = ОбъектИсправления.Основание.Товары.Выгрузить();
		
		ТаблицаРеализации.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Цена","Количество, Сумма");
		ТаблицаЗаказа.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Цена","Количество, Сумма");
		
		ТаблицаРеализации.Колонки.Добавить("Учтен", Новый ОписаниеТипов("Булево"));
		ТаблицаЗаказа.Колонки.Добавить("Учтен", Новый ОписаниеТипов("Булево"));
		
		//ищем строки РТиУ в заказе
		Для Каждого ТекСтрока Из ТаблицаРеализации Цикл
			Если НЕ ТекСтрока.Учтен Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура",ТекСтрока.Номенклатура);
				Отбор.Вставить("ХарактеристикаНоменклатуры",ТекСтрока.ХарактеристикаНоменклатуры);
				Отбор.Вставить("СерияНоменклатуры",ТекСтрока.СерияНоменклатуры);
				Отбор.Вставить("ЕдиницаИзмерения",ТекСтрока.ЕдиницаИзмерения);
				Отбор.Вставить("Цена",ТекСтрока.Цена);
				Отбор.Вставить("Количество",ТекСтрока.Количество);
				Отбор.Вставить("Сумма",ТекСтрока.Сумма);
				Отбор.Вставить("Учтен",Ложь);
				НайденныеСтроки = ТаблицаЗаказа.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТекСтрока.Учтен = Истина;
					НайденныеСтроки[0].Учтен = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		//ищем строки заказа в РТиУ
		Для Каждого ТекСтрока Из ТаблицаЗаказа Цикл
			Если НЕ ТекСтрока.Учтен Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура",ТекСтрока.Номенклатура);
				Отбор.Вставить("ХарактеристикаНоменклатуры",ТекСтрока.ХарактеристикаНоменклатуры);
				Отбор.Вставить("СерияНоменклатуры",ТекСтрока.СерияНоменклатуры);
				Отбор.Вставить("ЕдиницаИзмерения",ТекСтрока.ЕдиницаИзмерения);
				Отбор.Вставить("Цена",ТекСтрока.Цена);
				Отбор.Вставить("Количество",ТекСтрока.Количество);
				Отбор.Вставить("Сумма",ТекСтрока.Сумма);
				Отбор.Вставить("Учтен",Ложь);
				НайденныеСтроки = ТаблицаРеализации.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТекСтрока.Учтен = Истина;
					НайденныеСтроки[0].Учтен = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		//проверяем наличие неучтенных строк
		Для Каждого ТекСтрока Из ТаблицаРеализации Цикл
			Если НЕ ТекСтрока.Учтен Тогда
				ЕстьРазличия = Истина;
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекСтрока Из ТаблицаЗаказа Цикл
			Если НЕ ТекСтрока.Учтен Тогда
				ЕстьРазличия = Истина;
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		//заполняем заказ
		Если НЕ ЕстьРазличия Тогда
			Для Каждого ТекСтрока Из ОбъектИсправления.Товары Цикл
				Если ТекСтрока.Заказ = Неопределено
					или ТекСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка() Тогда
					ТекСтрока.Заказ = ОбъектИсправления.Основание;
				КонецЕсли;
			КонецЦикла;
			Для Каждого ТекСтрока Из ОбъектИсправления.Услуги Цикл
				Если ТекСтрока.Заказ = Неопределено
					или ТекСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка() Тогда
					ТекСтрока.Заказ = ОбъектИсправления.Основание;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Попытка
			Если ОбъектИсправления.Проведен Тогда
				ОбъектИсправления.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ОбъектИсправления.Записать();
			КонецЕсли;
			Возврат Истина;
		Исключение
			//Сообщить(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ПроверкаНомерРасчетаВДокументеНеСоответствуетНомеруРасчетаВыпускаемойПРодукции
//(+)
Функция ВыполнитьПроверку_НомерРасчетаВДокументеНеСоответствуетНомеруРасчетаВыпускаемойПродукции(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_НомерРасчетаВДокументеНеСоответствуетНомеруРасчетаВыпускаемойПродукции(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_НомерРасчетаВДокументеНеСоответствуетНомеруРасчетаВыпускаемойПродукции(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_НомерРасчетаВДокументеНеСоответствуетНомеруРасчетаВыпускаемойПродукции(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); //Документ
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); //Номер расчета в документе 
	ТаблицаРезультата.Колонки.Добавить("Документ2"); 
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); //Номер расчета в выпускаемой продукции 
	ТаблицаРезультата.Колонки.Добавить("Примечание"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.ПродукцияНомерРасчета КАК Пояснение1,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПродукцияНоменклатура.Потолок_ИндексПотолка = """"
	|			ТОГДА ДанныеДокумента.ПродукцияНоменклатура.Потолок_НомерРасчета
	|		ИНАЧЕ ДанныеДокумента.ПродукцияНоменклатура.Потолок_ИндексПотолка + ""-"" + ДанныеДокумента.ПродукцияНоменклатура.Потолок_НомерРасчета
	|	КОНЕЦ КАК Пояснение2
	|ПОМЕСТИТЬ ВТ_ДокументыСНомерамиРасчетов
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка)
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.ПродукцияНомерРасчета,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПродукцияНоменклатура.Потолок_ИндексПотолка = """"
	|			ТОГДА ДанныеДокумента.ПродукцияНоменклатура.Потолок_НомерРасчета
	|		ИНАЧЕ ДанныеДокумента.ПродукцияНоменклатура.Потолок_ИндексПотолка + ""-"" + ДанныеДокумента.ПродукцияНоменклатура.Потолок_НомерРасчета
	|	КОНЕЦ
	|ИЗ
	|	Документ.ВыпускПродукции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка)
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыСНомерамиРасчетов.Документ1 КАК Документ1,
	|	ДокументыСНомерамиРасчетов.Пояснение1 КАК Пояснение1,
	|	ДокументыСНомерамиРасчетов.Пояснение2 КАК Пояснение2
	|ИЗ
	|	ВТ_ДокументыСНомерамиРасчетов КАК ДокументыСНомерамиРасчетов
	|ГДЕ
	|	ДокументыСНомерамиРасчетов.Пояснение1 <> ДокументыСНомерамиРасчетов.Пояснение2";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_НомерРасчетаВДокументеНеСоответствуетНомеруРасчетаВыпускаемойПРодукции(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Номер расчета в документе не соответствует номеру расчета выпускаемой продукции (Для вида ""Производство потолока"").";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Документ";
		ОбластьМакета.Параметры.Пояснение1 = "Номер расчета в документе";
		ОбластьМакета.Параметры.Документ2 = "";
		ОбластьМакета.Параметры.Пояснение2 = "Номер расчета в выпускаемой продукции";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область ПроверкаКоличестваПотолков
//(+)
Функция ВыполнитьПроверку_ПроверкаКоличестваПотолков(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ПроверкаКоличестваПотолков(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ПроверкаКоличестваПотолков(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ПроверкаКоличестваПотолков(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); 
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); 
	ТаблицаРезультата.Колонки.Добавить("Документ2"); 
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.Количество * ДанныеДокумента.Коэффициент КАК Пояснение1,
	|	ДанныеДокумента.Номенклатура КАК Документ2,
	|	ДанныеДокумента.Номенклатура.Потолок_КоличествоПродукция КАК Пояснение2
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ДанныеДокумента
	|ГДЕ
	|	(ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	|			ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез))
	|	И ДанныеДокумента.Номенклатура.Потолок_КоличествоПродукция <> 0
	|	И ДанныеДокумента.Количество * ДанныеДокумента.Коэффициент <> ДанныеДокумента.Номенклатура.Потолок_КоличествоПродукция
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ПроверкаКоличестваПотолков(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Несовпадение количества по потолкам в заказах покупателей и в карточке номенклатуры";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1  = "Заказ покупателя";
		ОбластьМакета.Параметры.Пояснение1 = "Количество в заказе";
		ОбластьМакета.Параметры.Документ2  = "Номенклатура";
		ОбластьМакета.Параметры.Пояснение2 = "Количество в карточке";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область РасходятсяКоличествоКВыработкеМатериаловВыпускаПродукции
//(+)
Функция ВыполнитьПроверку_РасходятсяКоличествоКВыработкеМатериаловВыпускаПродукции(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_РасходятсяКоличествоКВыработкеМатериаловВыпускаПродукции(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_РасходятсяКоличествоКВыработкеМатериаловВыпускаПродукции(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_РасходятсяКоличествоКВыработкеМатериаловВыпускаПродукции(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); 
	ТаблицаРезультата.Колонки.Добавить("Пояснение1"); 
	ТаблицаРезультата.Колонки.Добавить("Документ2"); 
	ТаблицаРезультата.Колонки.Добавить("Пояснение2"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыработкаИсполнителейПроизводства.Регистратор КАК Регистратор,
	|	ВыработкаИсполнителейПроизводства.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ВыработкаИсполнителейПроизводства.Количество, 0)) КАК КоличествоВРегистре,
	|	ВыработкаИсполнителейПроизводства.ВидНачисления КАК ВидНачисления,
	|	ВыработкаИсполнителейПроизводства.ПроизводственнаяОперация КАК ПроизводственнаяОперация,
	|	КОЛИЧЕСТВО(ВыработкаИсполнителейПроизводства.Количество) КАК КоличествоПоВиду
	|ПОМЕСТИТЬ ВТ_Выработка
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейПроизводства КАК ВыработкаИсполнителейПроизводства
	|ГДЕ
	|	ВыработкаИсполнителейПроизводства.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|	И ЕСТЬNULL(ВыработкаИсполнителейПроизводства.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И (ВыработкаИсполнителейПроизводства.Период >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ВыработкаИсполнителейПроизводства.Период <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыработкаИсполнителейПроизводства.Регистратор,
	|	ВыработкаИсполнителейПроизводства.Номенклатура,
	|	ВыработкаИсполнителейПроизводства.ВидНачисления,
	|	ВыработкаИсполнителейПроизводства.ПроизводственнаяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	//#14348
	//|	СУММА(ДанныеДокумента.Количество) КАК Количество,
	|	СУММА(ДанныеДокумента.Количество * ДанныеДокумента.Коэффициент) КАК Количество,
	|	СУММА(ДанныеДокумента.КоличествоКВыработке) КАК КоличествоКВыработке
	|ПОМЕСТИТЬ ВТ_ВыпускиМатериалы
	|ИЗ
	|	Документ.ВыпускПродукции.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	(ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Выработка.Регистратор КАК Документ1,
	|	ВТ_Выработка.Номенклатура КАК Номенклатура,
	|	ВТ_Выработка.КоличествоВРегистре КАК КоличествоВРегистре,
	|	ВыпускиПродукцииМатериалы.Количество КАК КоличествоВВыпуске,
	|	ВыпускиПродукцииМатериалы.КоличествоКВыработке КАК КоличествоКВыработкеВВыпуске,
	|	ВТ_Выработка.КоличествоПоВиду КАК КоличествоПоВиду
	|ИЗ
	|	ВТ_Выработка КАК ВТ_Выработка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВыпускиМатериалы КАК ВыпускиПродукцииМатериалы
	|		ПО ВТ_Выработка.Регистратор = ВыпускиПродукцииМатериалы.Ссылка
	|			И ВТ_Выработка.Номенклатура = ВыпускиПродукцииМатериалы.Номенклатура
	|ГДЕ
	|	НЕ(ВыпускиПродукцииМатериалы.КоличествоКВыработке / ВТ_Выработка.КоличествоПоВиду - ВТ_Выработка.КоличествоВРегистре / ВТ_Выработка.КоличествоПоВиду <= 0.01
	|				И ВыпускиПродукцииМатериалы.КоличествоКВыработке / ВТ_Выработка.КоличествоПоВиду - ВТ_Выработка.КоличествоВРегистре / ВТ_Выработка.КоличествоПоВиду >= -0.01)
	|	И НЕ(ВыпускиПродукцииМатериалы.Количество / ВТ_Выработка.КоличествоПоВиду - ВТ_Выработка.КоличествоВРегистре / ВТ_Выработка.КоличествоПоВиду <= 0.01
	|				И ВыпускиПродукцииМатериалы.Количество / ВТ_Выработка.КоличествоПоВиду - ВТ_Выработка.КоличествоВРегистре / ВТ_Выработка.КоличествоПоВиду >= -0.01)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Выработка.Регистратор.Дата
	|ИТОГИ ПО
	|	Документ1";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		//Выведем попозиционно, где различия
		ВыборкаПозиции = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пояснение1 = "";
		Пока ВыборкаПозиции.Следующий() Цикл
			Пояснение1 = Пояснение1 + ВыборкаПозиции.Номенклатура 
			+ " количество к выработке в выпуске " + ВыборкаПозиции.КоличествоКВыработкеВВыпуске
			+ ", количество в выпуске " + ВыборкаПозиции.КоличествоВВыпуске 
			+ ", количество в регистре " + ВыборкаПозиции.КоличествоВРегистре + Символы.ПС;
		КонецЦикла;
		НоваяСтрока.Пояснение1 = Пояснение1;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_РасходятсяКоличествоКВыработкеМатериаловВыпускаПродукции(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Расходятся количество к выработке материалов выпуска продукции и движений по регистру ""Выработка сотрудников Производства"".";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1  = "Выпуск продукции";
		ОбластьМакета.Параметры.Пояснение1 = "Различающиеся значения";
		ОбластьМакета.Параметры.Документ2  = "";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область КорректностьИспользованияОстатковПленкиМатериалаЗаказчика
//(+)
Функция ВыполнитьПроверку_КорректностьИспользованияОстатковПленки(ОбъектыКИсправлению, СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_КорректностьИспользованияОстатковПленкиМатериалаЗаказчика(ОбъектыКИсправлению, , СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_КорректностьИспользованияОстатковПленки(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_КорректностьИспользованияОстатковПленкиМатериалаЗаказчика(ОбъектыКИсправлению, ЭтоОстаток = Истина, СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1");
	ТаблицаРезультата.Колонки.Добавить("Пояснение1");
	ТаблицаРезультата.Колонки.Добавить("Документ2");
	ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.УстановитьПараметр("Номенклатура", ?(ЭтоОстаток, Справочники.Номенклатура.ОстаткиПленки, Справочники.Номенклатура.ПолотноЗаказчика));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК ДокументВыпуска,
	|	ДанныеДокумента.Ссылка.Основание КАК ДокументЗНП,
	|	СУММА(ДанныеДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Выпуски
	|ИЗ
	|	Документ.ВыпускПродукции.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Номенклатура = &Номенклатура
	|	И ДанныеДокумента.Ссылка.Основание.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка)
	|	И НЕ ДанныеДокумента.Ссылка.ПродукцияНоменклатура.Потолок_Многфактурный
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНПМатериалы.Ссылка КАК ДокументЗНП,
	|	СУММА(ВЫРАЗИТЬ(ЗНПМатериалы.Количество * ЗНПМатериалы.Коэффициент КАК ЧИСЛО(15, 2))) КАК Количество
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказНаПроизводство.Материалы КАК ЗНПМатериалы
	|ГДЕ
	|	ЗНПМатериалы.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Полотно)
	|	И ЗНПМатериалы.Ссылка.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка)
	|	И ЗНПМатериалы.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Выпуски.ДокументЗНП
	|			ИЗ
	|				ВТ_Выпуски)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗНПМатериалы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1,
	|	ДанныеДокумента.Ссылка.Дата КАК Пояснение1,
	|	""Указана не базовая единица измерения"" КАК Примечание
	|ПОМЕСТИТЬ ВТ_Ошибки
	|ИЗ
	|	Документ.ВыпускПродукции.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	(ДанныеДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерений.ПустаяСсылка)
	|			ИЛИ ДанныеДокумента.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерений)
	|	И ДанныеДокумента.Номенклатура = &Номенклатура
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата,
	|	""Не заполнен коэффициент""
	|ИЗ
	|	Документ.ВыпускПродукции.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Коэффициент = 0
	|	И ДанныеДокумента.Номенклатура = &Номенклатура
	|	И (ДанныеДокумента.Ссылка.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Ссылка.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Выпуски.ДокументВыпуска,
	|	ВТ_Выпуски.ДокументВыпуска.Дата,
	|	""Не совпадает количество в выпуске и заказе на производство""
	|ИЗ
	|	ВТ_Выпуски КАК ВТ_Выпуски
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО (ВТ_Заказы.ДокументЗНП = ВТ_Выпуски.ДокументЗНП)
	|ГДЕ
	|	ВТ_Выпуски.Количество <> ВТ_Заказы.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Ошибки.Документ1 КАК Документ1,
	|	ВТ_Ошибки.Пояснение1 КАК Пояснение1,
	|	ВТ_Ошибки.Примечание КАК Примечание
	|ИЗ
	|	ВТ_Ошибки КАК ВТ_Ошибки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пояснение1
	|ИТОГИ ПО
	|	Документ1";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		//Выведем попозиционно, в чем различия
		ВыборкаПозиции = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Примечание = "";
		Пока ВыборкаПозиции.Следующий() Цикл
			Примечание = Примечание + ВыборкаПозиции.Примечание + Символы.ПС;
		КонецЦикла;
		НоваяСтрока.Примечание = СокрЛП(Примечание);
		
		НоваяСтрока = ОбъектыКИсправлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Исправить = ?(ЭтоОстаток, "КорректировкаИспользованияОстатковПленки", "КорректировкаИспользованияматериалаЗаказчика"); // №12260 добавлено условие, чтобы отрабатывало второе правило
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_КорректностьИспользованияОстатковПленки(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Корректность использования остатков пленки";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "КорректировкаИспользованияОстатковПленки";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления в документах ""Выпуск продукции"" исправляет некорректное использование номенклатуры ""Остатки пленки"":
		|- единица измерения устанавливается из базовой единицы измерения номенклатуры;
		|- коэффициент устанавливается равным единице;
		|- количество устанавливается равным ""Количество * Коэффициент"" из документа-основания ""Заказ на производство"" по полотну";
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Выпуск продукции";
		ОбластьМакета.Параметры.Пояснение1 = "";
		ОбластьМакета.Параметры.Документ2 = "";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	Возврат Таб;
	
КонецФункции

Функция ИсправитьОбъект_КорректировкаИспользованияОстатковПленкиМатериалаЗаказчика(ДокументВыпускПродукции, ЭтоОстаток = Истина) Экспорт
	
	ДокОбъект = ДокументВыпускПродукции.ПолучитьОбъект();
	
	Для каждого СтрокаМатериалов из ДокОбъект.Материалы Цикл
		Если (ЭтоОстаток И СтрокаМатериалов.Номенклатура = Справочники.Номенклатура.ОстаткиПленки)
			ИЛИ (НЕ ЭтоОстаток И СтрокаМатериалов.Номенклатура = Справочники.Номенклатура.ПолотноЗаказчика) Тогда
			КоличествоПолотнаВЗаказе = ПолучитьКоличествоПолотнаВЗаказе(ДокОбъект.Основание);
			Если КоличествоПолотнаВЗаказе > 0 Тогда
				СтрокаМатериалов.ЕдиницаИзмерения = СтрокаМатериалов.Номенклатура.БазоваяЕдиницаИзмерения;
				СтрокаМатериалов.Коэффициент = 1;
				СтрокаМатериалов.Количество = КоличествоПолотнаВЗаказе;
			Иначе
				Если СтрокаМатериалов.Коэффициент = 0 Тогда
					СтрокаМатериалов.Коэффициент = 1;
				КонецЕсли;
				СтрокаМатериалов.ЕдиницаИзмерения = СтрокаМатериалов.Номенклатура.БазоваяЕдиницаИзмерения;
				СтрокаМатериалов.Количество = СтрокаМатериалов.Количество * СтрокаМатериалов.Коэффициент;
				СтрокаМатериалов.Коэффициент = 1;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокОбъект.Записать();
		КонецЕсли;
		Возврат Новый Структура("Успешно, ОписаниеОшибки", Истина, "");
	Исключение
		//Сообщить("Попытка присвоить дату " + ОбъектВыпуск.Дата + " для " + ОбъектВыпуск + ". Ошибка: " + ОписаниеОшибки());
		Возврат Новый Структура("Успешно, ОписаниеОшибки", Ложь, ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

Функция ПолучитьКоличествоПолотнаВЗаказе(ДокументЗНП)
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументЗНП);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ЗНПМатериалы.Количество * ЗНПМатериалы.Коэффициент), 0) КАК Количество
	|ИЗ
	|	Документ.ЗаказНаПроизводство.Материалы КАК ЗНПМатериалы
	|ГДЕ
	|	ЗНПМатериалы.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Полотно)
	|	И ЗНПМатериалы.Ссылка.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка)
	|	И ЗНПМатериалы.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Количество;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьПроверку_КорректностьИспользованияМатериалаЗаказчика(ОбъектыКИсправлению, СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_КорректностьИспользованияОстатковПленкиМатериалаЗаказчика(ОбъектыКИсправлению, Ложь, СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_КорректностьИспользованияМатериалаЗаказчика(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ВывестиРезультатПроверки_КорректностьИспользованияМатериалаЗаказчика(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Корректность использования материала заказчика";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть_Исправить");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		ОбластьМакета.Параметры.Исправить = "КорректировкаИспользованияматериалаЗаказчика";
		ОбластьМакета.Параметры.ТекстПоясненияИсправления = "Процедура исправления в документах ""Выпуск продукции"" исправляет некорректное использование номенклатуры ""Материал заказчика"":
		|- единица измерения устанавливается из базовой единицы измерения номенклатуры;
		|- коэффициент устанавливается равным единице;
		|- количество устанавливается равным ""Количество * Коэффициент"" из документа-основания ""Заказ на производство"" по полотну";
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1 = "Выпуск продукции";
		ОбластьМакета.Параметры.Пояснение1 = "";
		ОбластьМакета.Параметры.Документ2 = "";
		ОбластьМакета.Параметры.Пояснение2 = "";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область ЗакрытыеЗаказыСозданныеБезИспользованияСтатусаЗакрыт
//(+)
Функция ВыполнитьПроверку_ЗакрытыеЗаказыСозданныеБезИспользованияСтатусаЗакрыт(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_ЗакрытыеЗаказыСозданныеБезИспользованияСтатусаЗакрыт(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_ЗакрытыеЗаказыСозданныеБезИспользованияСтатусаЗакрыт(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_ЗакрытыеЗаказыСозданныеБезИспользованияСтатусаЗакрыт(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); 
	//ТаблицаРезультата.Колонки.Добавить("Пояснение1"); 
	//ТаблицаРезультата.Колонки.Добавить("Документ2"); 
	//ТаблицаРезультата.Колонки.Добавить("Пояснение2"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Документ1
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.СозданПриИспользованииСтатусаЗакрыт
	|	И ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.Закрыт)
	|	И (ДанныеДокумента.Дата >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДанныеДокумента.Дата <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_ЗакрытыеЗаказыСозданныеБезИспользованияСтатусаЗакрыт(ТаблицаРезультата)
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Список заказов покупателей в статусе ""Закрыт"", созданных при отключенной настройке использования статуса ""Закрыт""";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1  = "Заказ покупателя";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область СоответствиеПоступленийРеализацийПоИнтеркампани
//(+)
Функция ВыполнитьПроверку_СоответствиеПоступленийРеализацийПоИнтеркампани(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_СоответствиеПоступленийРеализацийПоИнтеркампани(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_СоответствиеПоступленийРеализацийПоИнтеркампани(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_СоответствиеПоступленийРеализацийПоИнтеркампани(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); 
	//ТаблицаРезультата.Колонки.Добавить("Пояснение1"); 
	ТаблицаРезультата.Колонки.Добавить("Документ2"); 
	//ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.УстановитьПараметр("УслугиВыделены", НЕ Константы.СтоимостьПотолкаВключаетУслугиРаскрояПриПокупкеДляРозницы.Получить()); //#11840
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОтгрузкиСПроизодстваДляРозницы.Регистратор КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	РегистрНакопления.ОтгрузкиСПроизодстваДляРозницы КАК ОтгрузкиСПроизодстваДляРозницы
	|ГДЕ
	|	ОтгрузкиСПроизодстваДляРозницы.Регистратор ССЫЛКА Документ.РеализацияТоваровИУслуг
	|	И (ОтгрузкиСПроизодстваДляРозницы.Период >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ОтгрузкиСПроизодстваДляРозницы.Период <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Реализации.Ссылка КАК Документ1,
	|	Поступления.Ссылка КАК Документ2
	|ПОМЕСТИТЬ ВТ_РеализацииПоступления
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровИУслуг КАК Поступления
	|		ПО ВТ_Реализации.Ссылка = Поступления.Основание
	|			И (Поступления.Проведен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК Таблица,
	|	Товары.Ссылка КАК Документ1,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТаблицыРеализацийВрем
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО (ВТ_Реализации.Ссылка = Товары.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	Услуги.Ссылка,
	|	Услуги.Номенклатура,
	|	Услуги.ХарактеристикаНоменклатуры,
	|	Услуги.ЕдиницаИзмерения,
	|	Услуги.Количество,
	|	Услуги.Цена,
	|	Услуги.Сумма
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО (ВТ_Реализации.Ссылка = Услуги.Ссылка)
	|ГДЕ
	|	&УслугиВыделены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицыРеализацийВрем.Таблица КАК Таблица,
	|	ВТ_ТаблицыРеализацийВрем.Документ1 КАК Документ1,
	|	ВТ_ТаблицыРеализацийВрем.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицыРеализацийВрем.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицыРеализацийВрем.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ВТ_ТаблицыРеализацийВрем.Количество) КАК Количество,
	|	ВТ_ТаблицыРеализацийВрем.Цена КАК Цена,
	|	СУММА(ВТ_ТаблицыРеализацийВрем.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТаблицыРеализаций
	|ИЗ
	|	ВТ_ТаблицыРеализацийВрем КАК ВТ_ТаблицыРеализацийВрем
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицыРеализацийВрем.Таблица,
	|	ВТ_ТаблицыРеализацийВрем.Документ1,
	|	ВТ_ТаблицыРеализацийВрем.Номенклатура,
	|	ВТ_ТаблицыРеализацийВрем.ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицыРеализацийВрем.ЕдиницаИзмерения,
	|	ВТ_ТаблицыРеализацийВрем.Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК Таблица,
	|	ВТ_РеализацииПоступления.Документ1 КАК Документ1,
	|	Товары.Ссылка КАК Документ2,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТаблицыПоступленийВрем
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РеализацииПоступления КАК ВТ_РеализацииПоступления
	|		ПО (ВТ_РеализацииПоступления.Документ2 = Товары.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	ВТ_РеализацииПоступления.Документ1,
	|	Услуги.Ссылка,
	|	Услуги.Номенклатура,
	|	Услуги.ХарактеристикаНоменклатуры,
	|	Услуги.ЕдиницаИзмерения,
	|	Услуги.Количество,
	|	Услуги.Цена,
	|	Услуги.Сумма
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РеализацииПоступления КАК ВТ_РеализацииПоступления
	|		ПО (ВТ_РеализацииПоступления.Документ2 = Услуги.Ссылка)
	|ГДЕ
	|	&УслугиВыделены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицыПоступленийВрем.Таблица КАК Таблица,
	|	ВТ_ТаблицыПоступленийВрем.Документ1 КАК Документ1,
	|	ВТ_ТаблицыПоступленийВрем.Документ2 КАК Документ2,
	|	ВТ_ТаблицыПоступленийВрем.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицыПоступленийВрем.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицыПоступленийВрем.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ВТ_ТаблицыПоступленийВрем.Количество) КАК Количество,
	|	ВТ_ТаблицыПоступленийВрем.Цена КАК Цена,
	|	СУММА(ВТ_ТаблицыПоступленийВрем.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТаблицыПоступлений
	|ИЗ
	|	ВТ_ТаблицыПоступленийВрем КАК ВТ_ТаблицыПоступленийВрем
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицыПоступленийВрем.Таблица,
	|	ВТ_ТаблицыПоступленийВрем.Документ1,
	|	ВТ_ТаблицыПоступленийВрем.Документ2,
	|	ВТ_ТаблицыПоступленийВрем.Номенклатура,
	|	ВТ_ТаблицыПоступленийВрем.ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицыПоступленийВрем.ЕдиницаИзмерения,
	|	ВТ_ТаблицыПоступленийВрем.Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицыРеализаций.Документ1 КАК Документ1,
	|	ЕСТЬNULL(ВТ_ТаблицыПоступлений.Документ2, ВТ_РеализацииПоступления.Документ2) КАК Документ2,
	|	ЕСТЬNULL(ВТ_ТаблицыРеализаций.Номенклатура, ВТ_ТаблицыПоступлений.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ТаблицыРеализаций.ХарактеристикаНоменклатуры, ВТ_ТаблицыПоступлений.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ВТ_ТаблицыРеализаций.ЕдиницаИзмерения, ВТ_ТаблицыПоступлений.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ВТ_ТаблицыРеализаций.Цена, ВТ_ТаблицыПоступлений.Цена) КАК Цена,
	|	ВТ_ТаблицыРеализаций.Количество КАК Количество,
	|	ЕСТЬNULL(ВТ_ТаблицыПоступлений.Количество, 0) КАК Количество1,
	|	ВТ_ТаблицыРеализаций.Сумма КАК Сумма,
	|	ЕСТЬNULL(ВТ_ТаблицыПоступлений.Сумма, 0) КАК Сумма1
	|ИЗ
	|	ВТ_ТаблицыРеализаций КАК ВТ_ТаблицыРеализаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииПоступления КАК ВТ_РеализацииПоступления
	|		ПО (ВТ_РеализацииПоступления.Документ1 = ВТ_ТаблицыРеализаций.Документ1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицыПоступлений КАК ВТ_ТаблицыПоступлений
	|		ПО (ВТ_ТаблицыПоступлений.Документ1 = ВТ_ТаблицыРеализаций.Документ1)
	|			И (ВТ_ТаблицыПоступлений.Таблица = ВТ_ТаблицыРеализаций.Таблица)
	|			И (ВТ_ТаблицыПоступлений.Номенклатура = ВТ_ТаблицыРеализаций.Номенклатура)
	|			И (ВТ_ТаблицыПоступлений.ХарактеристикаНоменклатуры = ВТ_ТаблицыРеализаций.ХарактеристикаНоменклатуры)
	|			И (ВТ_ТаблицыПоступлений.ЕдиницаИзмерения = ВТ_ТаблицыРеализаций.ЕдиницаИзмерения)
	|			И ВЫБОР
	|				КОГДА &УслугиВыделены
	|					ТОГДА (ВТ_ТаблицыПоступлений.Цена = ВТ_ТаблицыРеализаций.Цена) 
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА &УслугиВыделены 
	|			ТОГДА (НЕ ВТ_ТаблицыРеализаций.Количество = ЕСТЬNULL(ВТ_ТаблицыПоступлений.Количество, 0)
	|					ИЛИ НЕ ВТ_ТаблицыРеализаций.Сумма = ЕСТЬNULL(ВТ_ТаблицыПоступлений.Сумма, 0))
	|			ИНАЧЕ (НЕ ВТ_ТаблицыРеализаций.Количество = ЕСТЬNULL(ВТ_ТаблицыПоступлений.Количество, 0))
	|	КОНЕЦ
	|
	|ИТОГИ ПО
	|	Документ1,
	|	Документ2";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРеализаций = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРеализаций.Следующий() Цикл
		ВыборкаПоступлений = ВыборкаРеализаций.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоступлений.Следующий() Цикл
			Примечание = "";
			Выборка = ВыборкаПоступлений.Выбрать();
			Пока Выборка.Следующий() Цикл
				Примечание = Примечание + ?(ПустаяСтрока(Примечание), "", Символы.ПС) + Выборка.Номенклатура;	
			КонецЦикла;
			НоваяСтрока = ТаблицаРезультата.Добавить();
			НоваяСтрока.Документ1 = ВыборкаРеализаций.Документ1;
			НоваяСтрока.Документ2 = ВыборкаПоступлений.Документ2;
			НоваяСтрока.Примечание = Примечание;
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_СоответствиеПоступленийРеализацийПоИнтеркампани(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Соответствие поступлений и реализаций по интеркампани (Производство-Розница и Розница-Производство).";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1  = "Реализация";
		ОбластьМакета.Параметры.Документ2  = "Поступление";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область НеуникальностьНомераРасчетаПоНоменклатуре
//(+)
Функция ВыполнитьПроверку_НеуникальностьНомераРасчетаПоНоменклатуре(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_НеуникальностьНомераРасчетаПоНоменклатуре(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_НеуникальностьНомераРасчетаПоНоменклатуре(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_НеуникальностьНомераРасчетаПоНоменклатуре(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); 
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Потолок_НомерРасчета КАК НомерРасчета,
	|	Номенклатура.Потолок_ИндексПотолка КАК ИндексПотолка,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_ДублиНомеров
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	(НЕ Номенклатура.Потолок_НомерРасчета = """" Или НЕ Номенклатура.Потолок_ИндексПотолка = """")
	|	И НЕ Номенклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.ТиповойОтрез)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.Потолок_НомерРасчета,
	|	Номенклатура.Потолок_ИндексПотолка
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|	
	|;
	|////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Документ1,
	|	Номенклатура.Потолок_НомерРасчета КАК НомерРасчета,
	|	Номенклатура.Потолок_ИндексПотолка КАК ИндексПотолка,
	|	ДублиНомеров.Количество КАК КоличествоНоменклатур
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДублиНомеров КАК ДублиНомеров
	|		ПО Номенклатура.Потолок_НомерРасчета = ДублиНомеров.НомерРасчета
	|			И Номенклатура.Потолок_ИндексПотолка = ДублиНомеров.ИндексПотолка
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Примечание = СтрШаблон("В справочнике ""Номенклатура"" имеется %1 карточки с одинаковым номером расчета %2%3",
		Выборка.КоличествоНоменклатур,
		Выборка.НомерРасчета,
		?(ЗначениеЗаполнено(Выборка.ИндексПотолка), " и индексом " + Выборка.ИндексПотолка, "")
		);
		
		НоваяСтрока = ТаблицаРезультата.Добавить();
		НоваяСтрока.Документ1 = Выборка.Документ1;
		НоваяСтрока.Примечание = Примечание;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_НеуникальностьНомераРасчетаПоНоменклатуре(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Проверка на не уникальность номера расчета по номенклатуре";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1  = "Номенклатура";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции

#КонецОбласти


#Область КонтрольРезервов
//(+)
Функция ВыполнитьПроверку_КонтрольРезервов(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_КонтрольРезервов(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_КонтрольРезервов(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_КонтрольРезервов(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); 
	//ТаблицаРезультата.Колонки.Добавить("Пояснение1"); 
	ТаблицаРезультата.Колонки.Добавить("Документ2"); 
	//ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК Документ1,
	|	ТоварыВРезервеНаСкладах.Регистратор КАК Документ2,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Проведен КАК ДокументРезерваПроведен,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ТекущийСтатус КАК ДокументРезерваТекущийСтатус
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ) КАК ТоварыВРезервеНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
	|		ПО ТоварыВРезервеНаСкладахОстатки.ДокументРезерва = ТоварыВРезервеНаСкладах.ДокументРезерва
	|ГДЕ
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя
	|	И (ТоварыВРезервеНаСкладах.Период >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ТоварыВРезервеНаСкладах.Период <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|	И (НЕ ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Проведен
	|			ИЛИ ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ТекущийСтатус В (ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.Выполнен), ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.Закрыт), ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.Отменен)))
	|ИТОГИ
	|	МАКСИМУМ(Документ2),
	|	МАКСИМУМ(КоличествоОстаток)
	|ПО
	|	Документ1,
	|	Номенклатура";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗаказовПокупателей = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаказовПокупателей.Следующий() Цикл
		Примечание = "";
		Если НЕ ВыборкаЗаказовПокупателей.ДокументРезерваПроведен Тогда
			Примечание =  "По непроведенному документу зарезервировано:"+Символы.ПС;	
		ИначеЕсли ВыборкаЗаказовПокупателей.ДокументРезерваТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен Тогда
			Примечание =  "По документу в статусе ВЫПОЛНЕН зарезервировано:"+Символы.ПС;
		ИначеЕсли ВыборкаЗаказовПокупателей.ДокументРезерваТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт Тогда
			Примечание =  "По документу в статусе ЗАКРЫТ зарезервировано:"+Символы.ПС;
	        ИначеЕсли ВыборкаЗаказовПокупателей.ДокументРезерваТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Отменен Тогда
			Примечание =  "По документу в статусе ОТМЕНЕН зарезервировано:"+Символы.ПС;
		КонецЕсли;	
		Выборка = ВыборкаЗаказовПокупателей.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			Примечание = Примечание + ?(ПустаяСтрока(Примечание), "", Символы.ПС) + """" + Выборка.Номенклатура + """ в количестве " + Выборка.КоличествоОстаток;	
		КонецЦикла;
		НоваяСтрока = ТаблицаРезультата.Добавить();
		НоваяСтрока.Документ1 = ВыборкаЗаказовПокупателей.Документ1;
		НоваяСтрока.Документ2 = ВыборкаЗаказовПокупателей.Документ2;
		НоваяСтрока.Примечание = Примечание;
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_КонтрольРезервов(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Контроль резервов.";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1  = "ЗаказПокупателю";
		ОбластьМакета.Параметры.Документ2  = "Резервирование";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции


Функция ВыполнитьПроверку_КонтрольРезервов2(СтруктураПараметров) Экспорт
	
	РезультатПроверки = ПолучитьТаблицу_КонтрольРезервов2(СтруктураПараметров);
	ТабДок = ВывестиРезультатПроверки_КонтрольРезервов2(РезультатПроверки);
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТаблицу_КонтрольРезервов2(СтруктураПараметров)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Документ1"); 
	//ТаблицаРезультата.Колонки.Добавить("Пояснение1"); 
	ТаблицаРезультата.Колонки.Добавить("Документ2"); 
	//ТаблицаРезультата.Колонки.Добавить("Пояснение2");
	ТаблицаРезультата.Колонки.Добавить("Примечание");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    СтруктураПараметров.Получить("ДатаНачала"));
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.Получить("ДатаОкончания"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК Документ1,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ЗаказПокупателяТовары.Ссылка КАК СсылкаТовар,
	|	ЗаказПокупателяМатериалы.Ссылка КАК СсылкаМатериал
	|ПОМЕСТИТЬ ВТ_Резерв
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ) КАК ТоварыВРезервеНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ПО ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Ссылка = ЗаказПокупателяТовары.Ссылка
	|			И ТоварыВРезервеНаСкладахОстатки.Номенклатура = ЗаказПокупателяТовары.Номенклатура
	|			И ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры = ЗаказПокупателяТовары.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Материалы КАК ЗаказПокупателяМатериалы
	|		ПО ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Ссылка = ЗаказПокупателяМатериалы.Ссылка
	|			И ТоварыВРезервеНаСкладахОстатки.Номенклатура = ЗаказПокупателяМатериалы.Номенклатура
	|			И ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры = ЗаказПокупателяМатериалы.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя
	|	И ЗаказПокупателяТовары.Ссылка ЕСТЬ NULL
	|	И ЗаказПокупателяМатериалы.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Резерв.Документ1 КАК Документ1,
	|	ВТ_Резерв.Номенклатура КАК Номенклатура,
	|	ВТ_Резерв.КоличествоОстаток КАК КоличествоОстаток,
	|	ТоварыВРезервеНаСкладах.Регистратор КАК Документ2
	|ИЗ
	|	ВТ_Резерв КАК ВТ_Резерв
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
	|		ПО ВТ_Резерв.Документ1 = ТоварыВРезервеНаСкладах.ДокументРезерва
	|ГДЕ
	|	(ТоварыВРезервеНаСкладах.Период >= &ДатаНачала
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ТоварыВРезервеНаСкладах.Период <= &ДатаОкончания
	|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|ИТОГИ
	|	МАКСИМУМ(Номенклатура),
	|	МАКСИМУМ(КоличествоОстаток)
	|ПО
	|	Документ1,
	|	Документ2";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗаказовПокупателей = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Примечание = "";
	Пока ВыборкаЗаказовПокупателей.Следующий() Цикл
		Выборка = ВыборкаЗаказовПокупателей.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			Примечание = "Номенклатура """ + Выборка.Номенклатура + """ находится в резерве в количестве " + Выборка.КоличествоОстаток + ", которого нет в заказе покупателя.";	
			НоваяСтрока = ТаблицаРезультата.Добавить();
			НоваяСтрока.Документ1 = Выборка.Документ1;
			НоваяСтрока.Документ2 = Выборка.Документ2;
			НоваяСтрока.Примечание = Примечание;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиРезультатПроверки_КонтрольРезервов2(ТаблицаРезультата)	
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетЭкспрессПроверкаУчета");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ВидПроверки");
	ОбластьМакета.Параметры.ВидПроверки = "Контроль резервов отсутствующих в заказе покупателя.";
	Таб.Вывести(ОбластьМакета, 1);
	
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибокНет");
		Таб.Вывести(ОбластьМакета, 1);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_ОшибкиЕсть");
		ОбластьМакета.Параметры.КоличествоОшибок = ТаблицаРезультата.Количество();
		Таб.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Таблица");
		ОбластьМакета.Параметры.Документ1  = "ЗаказПокупателю";
		ОбластьМакета.Параметры.Документ2  = "Резервирование";
		Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
		
		Ном = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка_Таблица");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
			ОбластьМакета.Параметры.Ном = Ном;
			Таб.Вывести(ОбластьМакета, 2, "Документ", Ложь);
			Ном = Ном + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();	
	Возврат Таб;
	
КонецФункции


#КонецОбласти