#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	ОбновитьЭлементыФормы();
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораФактуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	ВалютаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыМатериалов

#КонецОбласти

#Область ОбработчикиКомандТаблицыМатериалов

&НаКлиенте
Процедура Подобрать(Команда)
	
	ПараметрыПодбора = Новый Структура;
	УстановкаЦенКлиент.ОткрытьФормуПодбораФактуры(ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаФактур = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	УстановкаЦенСервер.ОбработкаВыбораПодбораФактуры(ТаблицаФактур, Объект.Материалы);
	//Для Каждого ТекущаяСтрока из ТаблицаФактур Цикл
	//	СтруктураОтбора = Новый Структура("Фактура, ЦветФактуры", ТекущаяСтрока.Фактура, ТекущаяСтрока.ЦветФактуры);
	//	НайденныеСтроки = Объект.Материалы.НайтиСтроки(СтруктураОтбора);
	//	Если НайденныеСтроки.Количество() = 0 Тогда
	//		НоваяСтрока = Объект.Материалы.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	//	КонецЕсли;
	//КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоСправочнику(Команда)
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоСправочникуФактур(ЭтаФорма, Объект.Материалы);
	//ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоСправочникуФактурЗавершение",ЭтаФорма);
	//ПоказатьВопрос(ОписаниеОповещенияВопрос,"Очистить таблицу и заполнить всеми элементами из справочника фактур?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСправочникуФактурЗавершение(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьПоСправочникуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСправочникуНаСервере()
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Объект.Материалы);
	
	//Объект.Материалы.Очистить();
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Фактура.Ссылка КАК Фактура,
	//|	ЦветФактуры.Ссылка КАК ЦветФактуры
	//|ИЗ
	//|	Справочник.Фактура КАК Фактура
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦветФактуры КАК ЦветФактуры
	//|		ПО Фактура.Ссылка = ЦветФактуры.Владелец
	//|ГДЕ
	//|	НЕ Фактура.ЭтоГруппа
	//|	И НЕ Фактура.ПометкаУдаления";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	НоваяСтрока = Объект.Материалы.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныТекущимЗначением(Команда)
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОтветЗаполнитьТекущиеЦены",ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещенияВопрос,"Очистить цены и заполнить текущими значениями?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветЗаполнитьТекущиеЦены(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьЦеныТекущимЗначениемНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныТекущимЗначениемНаСервере()
	
	ДатаЦены = Объект.Дата;
	Если ДатаЦены = Дата(1,1,1) Тогда
		ДатаЦены = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
		ТекущаяСтрока.Цена = РегистрыСведений.ЦеныМатериаловПоставщиков.ПолучитьЦенуМатериалаВВалюте(ДатаЦены, Объект.Контрагент, ТекущаяСтрока.Фактура, ТекущаяСтрока.ЦветФактуры, Объект.Валюта, Объект.ВидНоменклатуры, Объект.ВидЦеныПоставщика);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеСправочника(Команда)
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоГруппеФактур(ЭтаФорма, Объект.Материалы);
	//ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОтветЗаполнитьПоГруппе",ЭтаФорма);
	//ПоказатьВопрос(ОписаниеОповещенияВопрос,"Очистить таблицу и заполнить элементами из справочника фактур по выбранной группе?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОтветЗаполнитьПоГруппе(Результат, Параметры) Экспорт
//    Если Результат = КодВозвратаДиалога.Нет Тогда
//        Возврат;
//    КонецЕсли;

//	ОписаниеОповещенияВыборГруппы = Новый ОписаниеОповещения("РезультатВыбораГруппы",ЭтаФорма);
//	ОткрытьФорму("Справочник.Фактура.ФормаВыбораГруппы",,,,,,ОписаниеОповещенияВыборГруппы);

//КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоГруппеФактурПослеВыбораГруппы(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоГруппеНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГруппеНаСервере(ГруппаФактур)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Объект.Материалы, ГруппаФактур);
	
	//Объект.Материалы.Очистить();
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	Фактура.Ссылка КАК Фактура,
	//	|	ЦветФактуры.Ссылка КАК ЦветФактуры
	//	|ИЗ
	//	|	Справочник.Фактура КАК Фактура
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦветФактуры КАК ЦветФактуры
	//	|		ПО Фактура.Ссылка = ЦветФактуры.Владелец
	//	|ГДЕ
	//	|	НЕ Фактура.ЭтоГруппа
	//	|	И НЕ Фактура.ПометкаУдаления
	//	|	И Фактура.Ссылка В ИЕРАРХИИ(&ВыбЗнач)";
	//	Запрос.УстановитьПараметр("ВыбЗнач",ВыбЗнач);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		НоваяСтрока = Объект.Материалы.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	//	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦену(Команда)
	
	УстановкаЦенКлиент.УстановитьОбщуюЦенуНаМатериалы(Объект.Материалы);
	//ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОтветУстановитьОбщуюЦену",ЭтаФорма);
	//ПоказатьВопрос(ОписаниеОповещенияВопрос,"Установить общую цену на все фактуры и цвета?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОтветУстановитьОбщуюЦену(Результат, Параметры) Экспорт
//    Если Результат = КодВозвратаДиалога.Нет Тогда
//        Возврат;
//    КонецЕсли;

//	ОписаниеОповещенияВыборЦены = Новый ОписаниеОповещения("УстановитьЦенуПослеВыбора",ЭтаФорма);
//	ПоказатьВводЗначения(ОписаниеОповещенияВыборЦены,0,"Введите цену");

//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьЦенуПослеВыбора(ВыбЗнач, Параметры) Экспорт
//    Если НЕ ВыбЗнач = Неопределено Тогда
//		
//		Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
//			ТекущаяСтрока.Цена = ВыбЗнач;
//		КонецЦикла;
//		
//    КонецЕсли;
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункцииПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Элементы.МатериалыЦена.Заголовок = "Цена, " + Объект.Валюта;
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
