
Функция ПолучитьНастройки() Экспорт
	
	прогр = Новый СписокЗначений;
	прогр.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ИА_СтратегическоеУправление");
	
	НастройкиРС = Новый Структура;
	НастройкиРС.Вставить("КЦ_ТипТерминала",Перечисления.ТипТерминалаОргСхемы.Департамент);
	НастройкиРС.Вставить("КЦ_Организация",Справочники.ОргСхема.ПустаяСсылка());
	НастройкиРС.Вставить("СТ_Программы", прогр);
	НастройкиРС.Вставить("Стат_Настройка", Справочники.ИА_НастройкиРабочегоСтолаСтатистик.ПустаяСсылка());
	НастройкиРС.Вставить("Стат_Период", Перечисления.ИА_ПериодыДетализации.Неделя);
	НастройкиРС.Вставить("Стат_ВключитьТекПериод", Истина);
	
	СтруктКонст = константы.КСУ_НастройкиРСВладельца.Получить().Получить();
	Если СтруктКонст <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НастройкиРС, СтруктКонст);
	КонецЕсли;
	
	Константы.КСУ_НастройкиРСВладельца.Установить(Новый ХранилищеЗначения(НастройкиРС));
	
	Возврат НастройкиРС; 
КонецФункции

Процедура УстановитьПериодСтатистик(НастройкиРС, ДатаНачалаСтатФП,ДатаКонцаСтатФП,ДатаНачалаСтат,ДатаКонцаСтат) Экспорт
	текДата = ТекущаяДата();	
	КолНедель = 6;
	
	НачалоНедели = Константы.ИА_НачалоНедели.Получить();		
	Если НачалоНедели > 1 Тогда		
		ДатаКонцаСтатФП = ИА_Статистики.ИА_КонецНедели(текДата);
		Если ДеньНедели(текДата) <> НачалоНедели-1 Тогда
			ДатаКонцаСтатФП = ДатаКонцаСтатФП - 60*60*24*7;
		КонецЕсли;				
		ДатаНачалаСтатФП = ДатаКонцаСтатФП - 60*60*24*7 * (КолНедель) + 60*60*24;			
	Иначе
		ДатаКонцаСтатФП = КонецНедели(текДата) - 60*60*24*7;
		ДатаНачалаСтатФП = НачалоНедели(ДатаКонцаСтатФП) - 60*60*24*7 * (КолНедель-1);			
	КонецЕсли;
	
	//
	ТипПериода = НастройкиРС.Стат_Период;
	ТолькоЗавершПериоды = НЕ НастройкиРС.Стат_ВключитьТекПериод;
	КоличествоПериодов = 2;
	
	Если ЗначениеЗаполнено(ТипПериода) Тогда
		Если ТипПериода = Перечисления.ИА_ПериодыДетализации.День тогда
			Если ТолькоЗавершПериоды Тогда
				ДатаКонцаСтат = КонецДня(текДата) - 60*60*24;
			Иначе
				ДатаКонцаСтат = КонецДня(текДата);
			КонецЕсли;
			
			ДатаНачалаСтат = ДатаКонцаСтат - 60*60*24 * (КоличествоПериодов-1);
			
		ИначеЕсли ТипПериода = Перечисления.ИА_ПериодыДетализации.Неделя  тогда
			
			Если НачалоНедели > 1 Тогда
				
				ДатаКонцаСтат = ИА_Статистики.ИА_КонецНедели(текДата);
				Если ТолькоЗавершПериоды и ДеньНедели(текДата) <> НачалоНедели-1 Тогда
					ДатаКонцаСтат = ДатаКонцаСтат - 60*60*24*7;
				КонецЕсли;		
				
				ДатаНачалаСтат = ДатаКонцаСтат - 60*60*24*7 * (КоличествоПериодов) + 60*60*24;			
			Иначе
				
				ДатаКонцаСтат = КонецНедели(текДата);
				Если ТолькоЗавершПериоды Тогда
					ДатаКонцаСтат = ДатаКонцаСтат - 60*60*24*7;
				КонецЕсли;
				
				ДатаНачалаСтат = НачалоНедели(ДатаКонцаСтат) - 60*60*24*7 * (КоличествоПериодов-1);			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьСтатистикиФП(ТабСтатФП) Экспорт
	Новстр = ТабСтатФП.Добавить();
	Новстр.ВидСтатистики = Справочники.ИА_ВидыСтатистик.Доходы_РС;
	Новстр.Заголовок = "Валовой доход";
	
	Новстр = ТабСтатФП.Добавить();
	Новстр.ВидСтатистики = Справочники.ИА_ВидыСтатистик.ВаловаяПрибыль_РС;
	Новстр.Заголовок = "Валовая прибыль";
	
	Новстр = ТабСтатФП.Добавить();
	Новстр.ВидСтатистики = Справочники.ИА_ВидыСтатистик.СчетаКОплате_РС;
	Новстр.Заголовок = "Счета к оплате";
КонецПроцедуры

Функция ПолучитьФП_Показатели() Экспорт
	рез = новый Структура("Вал,Маржа,Счета");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ИА_ФинансовоеПланированиеДоходыИтого.СуммаБезнал) КАК Доход,
	               |	ИА_ФинансовоеПланированиеДоходыИтого.Ссылка,
	               |	МАКСИМУМ(ИА_ФинансовоеПланированиеДоходыИтого.Ссылка.ВаловаяПрибыльСуммаБезнал) КАК Прибыль
	               |ИЗ
	               |	Документ.ИА_ФинансовоеПланирование.ДоходыИтого КАК ИА_ФинансовоеПланированиеДоходыИтого
	               |ГДЕ
	               |	ИА_ФинансовоеПланированиеДоходыИтого.Ссылка.Проведен
	               |	И ИА_ФинансовоеПланированиеДоходыИтого.Ссылка.Дата >= &Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_ФинансовоеПланированиеДоходыИтого.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ФинансовоеПланированиеДоходыИтого.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("Дата", ДобавитьМесяц(ТекущаяДата() ,-1));
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		рез.Вал = Выборка.Доход;
		рез.Маржа = Выборка.Прибыль;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ИА_ЗаказыНаПриобретение.СуммаОстаток) КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ИА_ЗаказыНаПриобретение.Остатки(, ЗП.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ИА_ЗаказыНаПриобретение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних КАК СостояниеЗП
	               |		ПО ИА_ЗаказыНаПриобретение.ЗП = СостояниеЗП.ЗВС
	               |ГДЕ
	               |	ИА_ЗаказыНаПриобретение.СуммаОстаток > 0
	               |	И ВЫБОР
	               |			КОГДА СостояниеЗП.Статус ЕСТЬ NULL
	               |				ТОГДА ИА_ЗаказыНаПриобретение.ЗП.Статус <> ЗНАЧЕНИЕ(Перечисление.ИА_СостояниеЗаказа.Подготовлен)
	               |			ИНАЧЕ СостояниеЗП.Статус <> ЗНАЧЕНИЕ(Перечисление.ИА_СостояниеЗаказа.Подготовлен)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА СостояниеЗП.Статус ЕСТЬ NULL
	               |				ТОГДА ИА_ЗаказыНаПриобретение.ЗП.Статус <> ЗНАЧЕНИЕ(Перечисление.ИА_СостояниеЗаказа.Отклонен)
	               |			ИНАЧЕ СостояниеЗП.Статус <> ЗНАЧЕНИЕ(Перечисление.ИА_СостояниеЗаказа.Отклонен)
	               |		КОНЕЦ";
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		рез.Счета = Выборка.СуммаОстаток;
	КонецЕсли;
	Возврат Рез;
КонецФункции

Функция ПолучитьДанныеКЦ(НастройкиРС) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_ЗадачаПланаДействий.Пост,
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_ЗадачаПланаДействий.Выполнена
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК Всего,
	               |	ЗапросВыполнено.Выполнено КАК ВыполненоЗаНед,
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_ЗадачаПланаДействий.СрокИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
	               |					И ИА_ЗадачаПланаДействий.СрокИсполнения < &НачалоТекДня
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Просрочено,
	               |	ИА_ЗадачаПланаДействий.Пост.КраткоеНаименование КАК НаимПоста
	               |ИЗ
	               |	Задача.ИА_ЗадачаПланаДействий КАК ИА_ЗадачаПланаДействий
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИА_АдресацияЗадачПланаДействий.Пост КАК Пост,
	               |			КОЛИЧЕСТВО(ИА_ЗадачаПланаДействий.Ссылка) КАК Выполнено
	               |		ИЗ
	               |			РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ИА_ЗадачаПланаДействий КАК ИА_ЗадачаПланаДействий
	               |				ПО (ИА_ЗадачаПланаДействий.Исполнитель = ИА_АдресацияЗадачПланаДействий.Пользователь)
	               |					И (ИА_ЗадачаПланаДействий.ПометкаУдаления = ЛОЖЬ)
	               |					И (ИА_ЗадачаПланаДействий.Выполнена)
	               |					И (ИА_ЗадачаПланаДействий.ДатаВыполнения МЕЖДУ &ТекДатаМинусНеделя И &ТекДата)
	               |		ГДЕ
	               |			ИА_АдресацияЗадачПланаДействий.Пост.ТипТерминала = &ТипТерминала
	               |			И (ИА_АдресацияЗадачПланаДействий.Пост В ИЕРАРХИИ (&Организация)
	               |					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Оргсхема.ПустаяСсылка))
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ИА_АдресацияЗадачПланаДействий.Пост) КАК ЗапросВыполнено
	               |		ПО (ЗапросВыполнено.Пост = ИА_ЗадачаПланаДействий.Пост)
	               |ГДЕ
	               |	ИА_ЗадачаПланаДействий.Отправлена
	               |	И ИА_ЗадачаПланаДействий.Пост.ТипТерминала = &ТипТерминала
	               |	И (ИА_ЗадачаПланаДействий.Пост В ИЕРАРХИИ (&Организация)
	               |			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Оргсхема.ПустаяСсылка))
	               |	И ИА_ЗадачаПланаДействий.ПометкаУдаления = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_ЗадачаПланаДействий.Пост,
	               |	ИА_ЗадачаПланаДействий.Пост.КраткоеНаименование,
	               |	ЗапросВыполнено.Выполнено
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ЗадачаПланаДействий.Пост.ПорядокВСхеме";
	Запрос.УстановитьПараметр("ТипТерминала", НастройкиРС.КЦ_ТипТерминала);
	Запрос.УстановитьПараметр("Организация", НастройкиРС.КЦ_Организация);
	
	Запрос.УстановитьПараметр("НачалоТекДня", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ТекДатаМинусНеделя", ТекущаяДата() - 60*60*24*7);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат выборка;
КонецФункции

Функция ПолучитьДанныеПрограммы(программа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_СтратегическоеУправлениеЗадачи.Выполнено
	               |					И ИА_СтратегическоеУправлениеЗадачи.ДатаВыполнения >= &ТекДатаМинусНеделя
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ЗадачВыполнено,
	               |	СУММА(ВЫБОР
	               |			КОГДА НЕ ИА_СтратегическоеУправлениеЗадачи.Выполнено
	               |					И ИА_СтратегическоеУправлениеЗадачи.Срок <> ДАТАВРЕМЯ(1, 1, 1)
	               |					И ИА_СтратегическоеУправлениеЗадачи.Срок < &НачалоТекДня
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ЗадачПросрочено,
	               |	ВЫБОР
	               |		КОГДА КОЛИЧЕСТВО(ИА_СтратегическоеУправлениеЗадачи.Ссылка) = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ СУММА(ВЫБОР
	               |					КОГДА ИА_СтратегическоеУправлениеЗадачи.Выполнено
	               |						ТОГДА 1
	               |					ИНАЧЕ 0
	               |				КОНЕЦ) / КОЛИЧЕСТВО(ИА_СтратегическоеУправлениеЗадачи.Ссылка) * 100
	               |	КОНЕЦ КАК ПроцентВыполнения
	               |ИЗ
	               |	Справочник.ИА_СтратегическоеУправление КАК ИА_СтратегическоеУправлениеЗадачи
	               |ГДЕ
	               |	ИА_СтратегическоеУправлениеЗадачи.ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача)
	               |	И НЕ ИА_СтратегическоеУправлениеЗадачи.ЭтоКоррекция
	               |	И (ИА_СтратегическоеУправлениеЗадачи.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ИА_ТипыЗадачАдминШкалы.Рабочая)
	               |			ИЛИ ИА_СтратегическоеУправлениеЗадачи.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ИА_ТипыЗадачАдминШкалы.Производственная))
	               |	И ИА_СтратегическоеУправлениеЗадачи.ПометкаУдаления = ЛОЖЬ
	               |	И ИА_СтратегическоеУправлениеЗадачи.НеПоказыватьНаРабочемСтоле = ЛОЖЬ
	               |	И ИА_СтратегическоеУправлениеЗадачи.Родитель.СсылкаНаКоррЭлемент = ЗНАЧЕНИЕ(Справочник.ИА_СтратегическоеУправление.ПустаяСсылка)
	               |	И ИА_СтратегическоеУправлениеЗадачи.Родитель.Родитель.СсылкаНаКоррЭлемент = ЗНАЧЕНИЕ(Справочник.ИА_СтратегическоеУправление.ПустаяСсылка)
	               |	И ИА_СтратегическоеУправлениеЗадачи.Ссылка В ИЕРАРХИИ(&Программа)";
	Запрос.УстановитьПараметр("Программа", Программа);
	
	Запрос.УстановитьПараметр("НачалоТекДня", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ТекДатаМинусНеделя", НачалоДня(ТекущаяДата()) - 60*60*24*7);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат выборка;
КонецФункции

Функция ПолучитьНастройкуСтат() Экспорт
	НастройкиРС = константы.КСУ_НастройкиРСВладельца.Получить().Получить();
	возврат НастройкиРС.Стат_Настройка;
КонецФункции

Функция ПолучитьДанныеДИ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИА_ДоступныеИнструкции.Пользователь,
	               |	ЗНАЧЕНИЕ(Справочник.Оргсхема.ПустаяСсылка) КАК Пост
	               |ИЗ
	               |	РегистрСведений.ИА_ДоступныеИнструкции КАК ИА_ДоступныеИнструкции";
	тзПользПост = Запрос.Выполнить().Выгрузить();
	Для каждого стр из тзПользПост Цикл
		пост = ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПолучитьВысокийПостПользователя(стр.Пользователь);
		Если пост.ТипТерминала <> Перечисления.ТипТерминалаОргСхемы.Департамент и пост.ТипТерминала <> Перечисления.ТипТерминалаОргСхемы.РуководящийСостав и пост.ТипТерминала <> Перечисления.ТипТерминалаОргСхемы.Учредитель Тогда
			Пока пост.ТипТерминала <> Перечисления.ТипТерминалаОргСхемы.Департамент и пост <> Справочники.ОргСхема.ПустаяСсылка() Цикл
				пост = пост.родитель;			
			КонецЦикла;
		КонецЕсли;
		
		стр.Пост = пост;
	КонецЦикла;

	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТЗ.Пользователь
	               |ПОМЕСТИТЬ ПользПосты
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |ГДЕ
	               |	ТЗ.Пост <> ЗНАЧЕНИЕ(Справочник.Оргсхема.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_ДоступныеИнструкции.Пользователь КАК Пользователь,
	               |	ИА_ДоступныеИнструкции.Инструкция КАК Инструкция,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИА_ДоступныеИнструкции.Инструкция) КАК КоличествоДИ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_ИзучениеДИСрезПоследних.Пользователь ЕСТЬ NULL
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК Отправлено,
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_ИзучениеДИСрезПоследних.Пользователь ЕСТЬ NULL
	               |					ИЛИ ИА_ИзучениеДИСрезПоследних.ДатаСдачи = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК Сдано,
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_ИзучениеДИСрезПоследних.Пользователь ЕСТЬ NULL
	               |					ИЛИ ИА_ИзучениеДИСрезПоследних.СрокСдачи = ДАТАВРЕМЯ(1, 1, 1)
	               |					ИЛИ ИА_ИзучениеДИСрезПоследних.СрокСдачи > НАЧАЛОПЕРИОДА(&ТекВремя, ДЕНЬ)
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК Просрочено
	               |ИЗ
	               |	РегистрСведений.ИА_ДоступныеИнструкции КАК ИА_ДоступныеИнструкции
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ИзучениеДИ.СрезПоследних КАК ИА_ИзучениеДИСрезПоследних
	               |		ПО ИА_ДоступныеИнструкции.Пользователь = ИА_ИзучениеДИСрезПоследних.Пользователь
	               |			И ИА_ДоступныеИнструкции.Инструкция = ИА_ИзучениеДИСрезПоследних.Инструкция
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПользПосты КАК ПользПосты
	               |		ПО ИА_ДоступныеИнструкции.Пользователь = ПользПосты.Пользователь
	               |ГДЕ
	               |	НЕ ИА_ДоступныеИнструкции.Пользователь.ПометкаУдаления
	               |	И НЕ ИА_ДоступныеИнструкции.Инструкция.ЭтоГруппа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_ДоступныеИнструкции.Пользователь,
	               |	ИА_ДоступныеИнструкции.Инструкция
	               |ИТОГИ
	               |	СУММА(КоличествоДИ),
	               |	СУММА(Отправлено),
	               |	СУММА(Сдано),
	               |	СУММА(Просрочено)
	               |ПО
	               |	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("тз", тзПользПост);
	Запрос.УстановитьПараметр("ТекВремя", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
		
	Возврат Выборка;
		
КонецФункции

Функция ПолучитьДанныеПланов(НастройкиРС) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ИА_ЗадачиПлана.Время) КАК ИтогоВремя,
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_ЗадачиПлана.Выполнено
	               |				ТОГДА ИА_ЗадачиПлана.Время
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ВыполненоВремя,
	               |	ИА_ЗадачиПлана.Пост КАК Пост,
	               |	ИА_ЗадачиПлана.Пост.КраткоеНаименование КАК НаимПоста
	               |ИЗ
	               |	Справочник.ИА_ЗадачиПлана КАК ИА_ЗадачиПлана
	               |ГДЕ
	               |	ИА_ЗадачиПлана.ПометкаУдаления = ЛОЖЬ
	               |	И ИА_ЗадачиПлана.Владелец.ПометкаУдаления = ЛОЖЬ
	               |	И ИА_ЗадачиПлана.Владелец.ДатаНачала >= &ДатаНачала
	               |	И ИА_ЗадачиПлана.Владелец.Родитель = ЗНАЧЕНИЕ(Справочник.ИА_ПланыДействий.ПустаяСсылка)
	               |	И ИА_ЗадачиПлана.Пост.ТипТерминала = &ТипТерминала
	               |	И ИА_ЗадачиПлана.Пост В ИЕРАРХИИ(&Организация)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_ЗадачиПлана.Пост,
	               |	ИА_ЗадачиПлана.Пост.КраткоеНаименование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ЗадачиПлана.Пост.ПорядокВСхеме";
	
	
	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата() - 60*60*24*7);
	Запрос.УстановитьПараметр("ТипТерминала", НастройкиРС.КЦ_ТипТерминала);
	Запрос.УстановитьПараметр("Организация", НастройкиРС.КЦ_Организация);
		
	Выборка = Запрос.Выполнить().Выбрать();
	возврат Выборка;
КонецФункции

Функция ОтправитьPDF(НаПочту = Неопределено) Экспорт
	
	Если НаПочту = Неопределено Тогда
		НаПочту = СокрЛП(константы.КСУ_ПочтаДляРСВладельца.Получить());
		Если НаПочту = "" Тогда
			Сообщить("Пустая почта для отправки");
			возврат "";
		КонецЕсли;
	КонецЕсли;
	
	таб = СформироватьPDF();
	Если таб = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	имяФ = ПолучитьИмяВременногоФайла("pdf");
	таб.Записать(имяФ, ТипФайлаТабличногоДокумента.PDF);

	ИА_СерверПочты = Константы.ИА_СерверПочты.Получить();
	Если ИА_СерверПочты = "" Тогда
		сообщить("Укажите в константах настройки почты");
		возврат "";
	КонецЕсли;
		
	Профиль = новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = ИА_СерверПочты;
	Профиль.ПользовательSMTP = Константы.ИА_ПользовательПочты.Получить();
	Профиль.ПарольSMTP = Константы.ИА_ПарольПочты.Получить(); 
	ПРофиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	ПРофиль.ИспользоватьSSLSMTP = Константы.ИА_ИспользоватьSSL.Получить();
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	
	Сообщение.Отправитель = Константы.ИА_АдресОтправителя.Получить();
	Сообщение.Получатели.Добавить(НаПочту);
	Сообщение.Тема = "КСУ: Рабочий стол Владельца";	
	Текст = "Во вложениях находятся данные с рабочего стола Владельца от "+ формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	Сообщение.Тексты.Добавить(Текст);		
	
	Вложение = Сообщение.Вложения.Добавить(имяФ,"КСУ: Рабочий стол");
			
	Почта = Новый ИнтернетПочта;
	Попытка 
		Почта.Подключиться(Профиль);
		Почта.Послать(Сообщение);
	Исключение
		опОш = ОписаниеОшибки();
		Сообщить("Ошибка отправки почты: " + опОш);
		возврат "";
	КонецПопытки; 			
	Сообщить("Отправлено!");
	
	Возврат имяФ;
КонецФункции

Функция СформироватьPDF() Экспорт
	
	ДатаНачалаСтатФП = дата(1,1,1);
	ДатаКонцаСтатФП = дата(1,1,1);
	ДатаНачалаСтат = дата(1,1,1);
	ДатаКонцаСтат = дата(1,1,1);
	НастройкиРС = ПолучитьНастройки();
	УстановитьПериодСтатистик(НастройкиРС, ДатаНачалаСтатФП,ДатаКонцаСтатФП,ДатаНачалаСтат,ДатаКонцаСтат);
	
	ДатаНачалаСтатФП = НачалоДня(ДатаНачалаСтатФП);
	ДатаКонцаСтатФП = КонецДня(ДатаКонцаСтатФП);
	ДатаНачалаСтат = НачалоДня(ДатаНачалаСтат);
	ДатаКонцаСтат = КонецДня(ДатаКонцаСтат);

	
	макет = Обработки.КСУ_РабочийСтолВладельца.ПолучитьМакет("МакетРС");
	табДок = Новый ТабличныйДокумент;
	
	// ШАПКА
	обл = Макет.ПолучитьОбласть("Шапка");
	обл.рисунки[0].Картинка = Новый Картинка(Константы.ИА_ЛоготипКомпании.Получить().Получить()); 	
	табДок.Вывести(обл);
	табДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	//
	// ФП
	//
	
	ТабСтатФП = Новый ТаблицаЗначений;
	ТабСтатФП.Колонки.Добавить("ВидСтатистики");
	ТабСтатФП.Колонки.Добавить("Заголовок");
	ЗаполнитьСтатистикиФП(ТабСтатФП);
	
	обл = Макет.ПолучитьОбласть("ФП");
	фпПок = ПолучитьФП_Показатели();
	ЗаполнитьЗначенияСвойств(обл.Параметры, фпПок);
	
	сч = 1;
	для каждого стрСтат из ТабСтатФП Цикл
		тз = ИА_Статистики.ПолучитьДанныеСтатистики(ДатаНачалаСтатФП, ДатаКонцаСтатФП, Перечисления.ИА_ПериодыДетализации.Неделя, стрСтат.ВидСтатистики, Неопределено, Неопределено, Неопределено);	
		ДиаграммаФП = обл.Рисунки[сч].Объект;
		ДиаграммаФП.Обновление = ложь;
		ДиаграммаФП.Очистить();
		ДиаграммаФП.ОбластьЗаголовка.Текст = стрСтат.Заголовок; 
		СерияДиаг = ДиаграммаФП.Серии.Добавить("ЗаголовокСтат"); 
		Для каждого стр из тз Цикл
			ТекстТчк = формат(стр.ДатаНачала,"ДФ=dd.MM") + "-" + формат(стр.ДатаКонца,"ДФ=dd.MM");
			точкаДиаг = ДиаграммаФП.Точки.Добавить();
			ДиаграммаФП.УстановитьЗначение(точкаДиаг, СерияДиаг, окр(стр.Значение),,ТекстТчк + " " +строка(окр(стр.Значение))); 
		КонецЦикла;	
		ДиаграммаФП.Обновление = Истина;
		
		сч = сч + 1;
	КонецЦикла;
	
	табДок.Вывести(обл);
	табДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	//
	//КЦ
	//
	
	обл = Макет.ПолучитьОбласть("КЦ_Шапка");
	табДок.Вывести(обл);
	
	Выборка = ПолучитьДанныеКЦ(НастройкиРС);
	
	Пока Выборка.следующий() Цикл
		обл = Макет.ПолучитьОбласть("КЦ_Строка");
		ЗаполнитьЗначенияСвойств(обл.Параметры, Выборка);
		табДок.Вывести(обл);
	КонецЦикла;
		
	обл = Макет.ПолучитьОбласть("КЦ_Подвал");
	табДок.Вывести(обл);
	//табДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	//
	//БП
	//
	
	обл = Макет.ПолучитьОбласть("Планы_Шапка");
	табДок.Вывести(обл);
	
	Выборка = ПолучитьДанныеПланов(НастройкиРС);
	Пока Выборка.следующий() Цикл
		обл = Макет.ПолучитьОбласть("Планы_Строка");
		ЗаполнитьЗначенияСвойств(обл.Параметры, Выборка);
		обл.Параметры.Процент = формат(?(Выборка.ИтогоВремя = 0, 0, Выборка.ВыполненоВремя / Выборка.ИтогоВремя * 100),"ЧДЦ=; ЧН="); 			
		табДок.Вывести(обл);
	КонецЦикла;		
	табДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	//
	//СТРАТЕГИЯ
	//
	
	обл = Макет.ПолучитьОбласть("Стратегия_Шапка");
	табДок.Вывести(обл);
	
	Для каждого программаСп из  НастройкиРС.СТ_Программы Цикл
		программа = программаСп.значение;		
		Выборка = ПолучитьДанныеПрограммы(программа);
		Выборка.Следующий();

		обл = Макет.ПолучитьОбласть("Стратегия_Строка");
		ЗаполнитьЗначенияСвойств(обл.Параметры, Выборка);
		обл.Параметры.программа = программа; 			
		табДок.Вывести(обл);
	КонецЦикла;		
	//табДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	//
	//ДИ
	//
	
	обл = Макет.ПолучитьОбласть("ДИ_Шапка");
	выборка = КСУ_РС_Владельца.ПолучитьДанныеДИ();		
	выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.КоличествоДИ) Тогда
		обл.Параметры.ДекВсегоДИ = Выборка.КоличествоДИ;
		обл.Параметры.ДекОтправленоДИ = ?(ЗначениеЗаполнено(Выборка.Отправлено),Окр(Выборка.Отправлено,0),0);
		обл.Параметры.ДекСданоДИ = ?(ЗначениеЗаполнено(Выборка.Сдано),Окр(Выборка.Сдано,0),0);
		обл.Параметры.ДекПросроченоДИ = ?(ЗначениеЗаполнено(Выборка.Просрочено),Окр(Выборка.Просрочено,0),0);
		
		обл.Параметры.ДекОтправленоДИ_Проц = Окр((Выборка.Отправлено / Выборка.КоличествоДИ) * 100,0);
		обл.Параметры.ДекСданоДИ_Проц = Окр((Выборка.Сдано / Выборка.КоличествоДИ) * 100,0);
		обл.Параметры.ДекПросроченоДИ_Проц = Окр((Выборка.Просрочено / Выборка.КоличествоДИ) * 100,0);
	КонецЕсли;
	
	табДок.Вывести(обл);
	//табДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	//
	//СТАТИСТИКИ
	//
	
	обл = Макет.ПолучитьОбласть("Стат_Шапка");
	табДок.Вывести(обл);
	
	настрСтат = НастройкиРС.Стат_Настройка.Статистики;
	Для каждого стр из настрСтат Цикл
		тз = ИА_Статистики.ПолучитьДанныеСтатистики(ДатаНачалаСтат, ДатаКонцаСтат, НастройкиРС.Стат_Период, стр.ВидСтатистики, стр.Аналитика1, стр.Аналитика2, стр.Аналитика3);
		ПредЗн = тз[0].Значение;
		ТекЗн = тз[1].Значение;
		
		Если стр.ВидСтатистики.ПеревернутаяСтатистика Тогда				
			Если ТекЗн<ПредЗн тогда
				обл = Макет.ПолучитьОбласть("Стат_СтрокаВ");
			Иначе
				обл = Макет.ПолучитьОбласть("Стат_СтрокаН");
			КонецЕсли;
		Иначе
			Если ТекЗн<=ПредЗн тогда
				обл = Макет.ПолучитьОбласть("Стат_СтрокаН");
			Иначе
				обл = Макет.ПолучитьОбласть("Стат_СтрокаВ");
			КонецЕсли;
		КонецЕсли;
				
		Обл.Параметры.Статистика = стр.НаименованиеДляЛегенды;
		Обл.Параметры.ПредЗн = Формат(ПредЗн,"ЧДЦ=2; ЧН="); 			
		Обл.Параметры.ТекЗн = Формат(ТекЗн,"ЧДЦ=2; ЧН=");
		
		табДок.Вывести(обл);
	КонецЦикла;
	
	табДок.ВывестиГоризонтальныйРазделительСтраниц();


	
	
	возврат табДок;
КонецФункции

Процедура КСУ_Рассылка_РС_Владельца() Экспорт
	ОтправитьPDF();
КонецПроцедуры
