
Процедура ЗаписатьСобытие(Событие, Данные) Экспорт
	
	//Если ИД=Неопределено Тогда
	//	ИД = Строка(Новый УникальныйИдентификатор);  // по идентифкатору не выстраивается корректсная сортировка
	//КонецЕсли;
	
	Порядок = 1;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТехнологическийЖурнал.Порядок) КАК Порядок
	|ИЗ
	|	РегистрСведений.ТехнологическийЖурнал КАК ТехнологическийЖурнал
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ТехнологическийЖурнал.Порядок) > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Порядок = Выборка.Порядок + 1;
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ТехнологическийЖурнал.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период 		= ТекущаяДатаСеанса();
		МенеджерЗаписи.Порядок 		= Порядок;
		МенеджерЗаписи.Событие 		= Событие;
		МенеджерЗаписи.Данные 		= Данные;		
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры
