#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	ОтображатьПериодРегистрации = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();
	
	Если Параметры.Ключ.Пустая() тогда

	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	УправлениеПоказателямиПлатежаВБюджет();
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

	ДоступноИзменениеОрганизацииВДокументахНаОснованииЗаявки = Константы.ДоступноИзменениеОрганизацииВДокументахНаОснованииЗаявки.Получить();
	ДоступноИзменениеКассыВДокументахНаОснованииЗаявки = Константы.ДоступноИзменениеКассыВДокументахНаОснованииЗаявки.Получить();
	УстановитьДоступностьЭлементов();
	
	Элементы.Статья.АвтоОтметкаНезаполненного = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();
	
	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
		//КонтрагентДополнительно = Объект.Контрагент.Дополнительно;
		ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	Иначе
		//Элементы.КонтрагентДополнительно.Видимость = Ложь;
		Элементы.ПоказатьДополнительнуюИнформацию.Видимость = Ложь;
	КонецЕсли;
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);

	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	ФинансыСервер.ЗаполнитьСписокКодовВидаДохода(Элементы.КодВидаДохода, Объект.ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДанные();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если (Объект.СуммаОсновногоТелаЗайма + Объект.СуммаПроцентовПоЗайму) <> Объект.Сумма И Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратКредита Тогда
		Сообщить("Сумма документа не равна сумме суммы основного долга и суммы процентов");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ФинансыСервер.ПроверитьСуммуРаспределенияПоТипамДокументов(Объект, , Объект.Сумма, Отказ, ПараметрыЗаписи.РежимЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// №11352
	Оповестить("Запись_ДокументОплаты",, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И СтрНайти(ИсточникВыбора.ИмяФормы, "ФормаКалендаря") > 0 Тогда
		
		Объект.ПериодРегистрации 		= НачалоМесяца(ВыбранноеЗначение);
		ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
		Модифицированность = Истина;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораПоРасчетамСКонтрагентами" Тогда
		
		ПолучитьРаспределениеПлатежаИзХранилища(ВыбранноеЗначение.АдресПлатежейВХранилище);
	
	КонецЕсли;
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// #14544 на случай если включат данную настройку, чтобы в документе был корректный период = дате документа
	Если НЕ ОтображатьПериодРегистрации И ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") 
		И Элементы.ГруппаРаспределениеПлатежа.Видимость Тогда
	
		НовоеОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОЗаполненииРаспределения",ЭтаФорма);
		ПоказатьВопрос(НовоеОписаниеОповещения, "Очистить и перезаполнить распределение платежа согласно заявке?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОЗаполненииРаспределения(Результат, Параметры) Экспорт	
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ПерезаполнитьРаспределениеНаСервере();
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьРаспределениеНаСервере()
	
	Объект.РаспределениеПлатежа.Очистить();
	Для каждого СтрокаРаспределения из Объект.Основание.РаспределениеПлатежа Цикл
		НоваяСтрока = Объект.РаспределениеПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
	КонецЦикла;
	
КонецПроцедуры 
	
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьДанные();
	ЗаполнитьСтавкуНДСПоОрганизации();
	ЗаполнитьСтатьюДоходовРасходовСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаСервере
Функция КассаПриИзмененииНаСервере()
	Если НЕ Объект.Счет.Владелец = Объект.Организация Тогда
		Объект.Счет = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
	Объект.Валюта = Объект.Счет.Валюта;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	Если НЕ КассаПриИзмененииНаСервере() Тогда
		ПоказатьПредупреждение(,"Выбран счет, не принадлежащая организации");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
	ЗаполнитьСтавкуНДСПоОрганизации();
	ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда 
		Объект.Договор = Объект.Контрагент.ОсновнойДоговор;
		Объект.СчетКонтрагента = Объект.Контрагент.ОсновнойБанковскийСчет;
		
		//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
		//КонтрагентДополнительно = Объект.Контрагент.Дополнительно;
		ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	Иначе
		//Элементы.КонтрагентДополнительно.Видимость = Ложь;
		Элементы.ПоказатьДополнительнуюИнформацию.Видимость = Ложь;
	КонецЕсли;
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Если Объект.РаспределениеПлатежа.Количество() = 1 Тогда
		Если Объект.РаспределениеПлатежа[0].Документ = Объект.Основание Тогда
			Объект.РаспределениеПлатежа[0].Сумма = Объект.Сумма;
		КонецЕсли;
	КонецЕсли;
	
	Объект.СуммаОсновногоТелаЗайма = Объект.Сумма - Объект.СуммаПроцентовПоЗайму;  
	
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	// #14544 на случай если включат данную настройку, чтобы в документе был корректный период = дате документа
	Если НЕ ОтображатьПериодРегистрации И ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	
	ВидОперацииПриИзмененииНаСервере();
	
	ЗаполнитьСтавкуНДСПоОрганизации();
	ОбновитьДанные();
	
КонецПроцедуры

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	
	ЗаполнитьСтатьюДоходовРасходовСервер();
	ФинансыСервер.ЗаполнитьСписокКодовВидаДохода(Элементы.КодВидаДохода, Объект.ВидОперации);
	Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику
		И Объект.КодВидаДохода = "" Тогда
		Объект.КодВидаДохода = "1";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРегистрации = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), 
							ДобавитьМесяц(Объект.ПериодРегистрации, Направление),
							ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), Направление));							
	Объект.ПериодРегистрации 		= НачалоМесяца(Объект.ПериодРегистрации);
	ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	 = Ложь;	
	ДатаКалендаряПриОткрытии = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), Объект.ПериодРегистрации, ТекущаяДата());
	СтруктураПараметров 	 = Новый Структура("ДатаКалендаря, ЗакрыватьПриВыборе, МножественныйВыбор", ДатаКалендаряПриОткрытии, Истина, Ложь);
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

//++ №13755
&НаКлиенте
Процедура СтатьяРасходовПриИзменении(Элемент)
	
	Объект.СтатьяРасходовПоНачислению = Объект.СтатьяРасходов;
	
КонецПроцедуры
//-- №13755

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);	
КонецПроцедуры

#КонецОбласти


&НаСервереБезКонтекста
Функция ПолучитьТекущийДолгКлиента(Знач Организация, Знач Контрагент, Знач Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			Договор = &Договор
	|				И Контрагент = &Контрагент
	|				И Организация = &Организация) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанные()
	
	Элементы.ГруппаКонтрагент.Видимость = Ложь;
	Элементы.Договор.Видимость = Ложь;
	Элементы.ГруппаЗарплатаСотрудникам.Видимость = Ложь;
	Элементы.ОтображениеПериодаРегистрации.Видимость = Ложь;
	Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
	Элементы.ГруппаРеквизитовЗайма.Видимость = Ложь;
	Элементы.Сумма.ТолькоПросмотр = Ложь;
	Элементы.ГруппаПеречислениеВБюджет.Видимость = Ложь;
	//ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПечать.ПодчиненныеЭлементы.Найти("ФормаПечатьСпискаСотрудников").Видимость = Ложь;
	//Элементы.ГруппаВидНачисленияСотрудника.Видимость = Ложь;  //#6576
	Элементы.РаспределениеПлатежаГруппаВозвратПокупателю.Видимость = Ложь;
	Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Ложь;
	
	//#9708
	Элементы.СтатьяРасходовПоНачислению.Видимость = ПолучитьФункциональнуюОпцию("НекассовыйМетодВеденияУчетаДоходовРасходов") 
									И Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПрочееСписание
									//++ №13755
									И ЗначениеЗаполнено(Объект.Ссылка)
									И НЕ (Объект.СтатьяРасходов = Объект.СтатьяРасходовПоНачислению);
									//-- №13755
									
	Элементы.СтатьяРасходов.Видимость = Истина;
	КонтрагентКакСотрудник = Ложь;
	
	//управляем видимостью элементов в зависимости от того, какой вид операции
	Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.Договор.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор);
		Элементы.ДекорацияНалписьВалютаДолга.Заголовок = Константы.ВалютаУчета.Получить();
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.Договор.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор);
		Элементы.ДекорацияНалписьВалютаДолга.Заголовок = Константы.ВалютаУчета.Получить();
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаВозвратПокупателю.Видимость = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПеречислениеНалоговИВзносов Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.Договор.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор);
		Элементы.ДекорацияНалписьВалютаДолга.Заголовок = Константы.ВалютаУчета.Получить();
		Элементы.ГруппаПеречислениеВБюджет.Видимость = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ИнкассацияИзБанка Тогда
		Элементы.ГруппаКонтрагент.Видимость = Ложь;
		Элементы.СтатьяРасходов.Видимость = Ложь; // #12545
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам Тогда
		Элементы.ГруппаЗарплатаСотрудникам.Видимость = Истина;
		Элементы.ОтображениеПериодаРегистрации.Видимость = ОтображатьПериодРегистрации;
		Если Объект.ЗарплатаСотрудникам.Количество() > 0 Тогда
			Элементы.Сумма.ТолькоПросмотр = Истина;
			Объект.Сумма = Объект.ЗарплатаСотрудникам.Итог("Сумма");
		КонецЕсли;	
		//Элементы.ГруппаКонтрагент.Видимость = Истина;  #13333 закомментировано
		//Элементы.ГруппаТекущийДолг.Видимость = Ложь;		
		//ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПечать.ПодчиненныеЭлементы.Найти("ФормаПечатьСпискаСотрудников").Видимость = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику Тогда
		//Элементы.ГруппаВидНачисленияСотрудника.Видимость = Истина;  //#6576
		Элементы.ГруппаКонтрагент.Видимость = Истина;			
		Элементы.ГруппаТекущийДолг.Видимость = Ложь;
		Элементы.ОтображениеПериодаРегистрации.Видимость = ОтображатьПериодРегистрации;
		КонтрагентКакСотрудник = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ГруппаТекущийДолг.Видимость = Ложь;
		КонтрагентКакСотрудник = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаЗайма Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.Договор.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор);
		Элементы.ДекорацияНалписьВалютаДолга.Заголовок = Константы.ВалютаУчета.Получить();
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
		Элементы.СтатьяРасходов.Видимость = Ложь;
		Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратКредита Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ГруппаРеквизитовЗайма.Видимость = Истина;
		Элементы.Договор.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор);
		Элементы.ДекорацияНалписьВалютаДолга.Заголовок = Константы.ВалютаУчета.Получить();
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
		Элементы.СтатьяРасходов.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Истина;
		
	КонецЕсли;
	
	Элементы.КодВидаДохода.Видимость = ФинансыСервер.ВозможноВзысканиеСПеречисленияФизлицу(Объект.Дата, Объект.ВидОперации);
	
	УстановитьДоступностьЭлементов();
	
	//Определяем тип по умолчанию
	Если Элементы.ГруппаКонтрагент.Видимость Тогда
		Если КонтрагентКакСотрудник Тогда	
			Элементы.Контрагент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		Иначе	
			Элементы.Контрагент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСотрудникамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.Сумма = Объект.ЗарплатаСотрудникам.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура Распределение_ЗаказПоставщику(Команда)
	Если НЕ  Объект.Контрагент = Неопределено И Не Объект.Контрагент.Пустая() Тогда 
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораДокумента",ЭтаФорма);
		
		ЗначениеОтбора = Новый Структура("Контрагент", Объект.Контрагент);
		ПараметрВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора", ПараметрВыбора, ЭтаФорма,,,,ОповещениеОЗакрытии);
	Иначе
		Состояние("Не указан контрагент");
	КонецЕсли;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДокумента(ВыбранныйДокумент, ДополнительныеПараметры) Экспорт
	Если НЕ ВыбранныйДокумент = Неопределено Тогда
		Если НЕ ВыбранныйДокумент.Пустая() Тогда
			НоваяСтрока = Объект.РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ВыбранныйДокумент;
			НоваяСтрока.Сумма = Объект.Сумма;
			
			//ДобавитьОснаваниеЗаказа(НоваяСтрока.Документ);
		
			//ОбновитьДанные();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРеквизитыПлатежаВБюджетНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПросмотр",         ЭтаФорма.ТолькоПросмотр);
	ПараметрыФормы.Вставить("КодБК",                  Объект.КодБК);
	ПараметрыФормы.Вставить("КодОКАТО",               Объект.КодОКАТО);
	ПараметрыФормы.Вставить("ПоказательДаты",         Объект.ПоказательДаты);
	ПараметрыФормы.Вставить("ПоказательНомера",       Объект.ПоказательНомера);
	ПараметрыФормы.Вставить("ПоказательОснования",    Объект.ПоказательОснования);
	ПараметрыФормы.Вставить("ПоказательПериода",      Объект.ПоказательПериода);
	ПараметрыФормы.Вставить("ПоказательТипа",         Объект.ПоказательТипа);
	ПараметрыФормы.Вставить("СтатусСоставителя",      Объект.СтатусСоставителя);
	//ПараметрыФормы.Вставить("ТекущаяДата",            ТекущаяДата);
	
	Оповещение = Новый ОписаниеОповещения("НадписьРеквизитыПлатежаВБюджетНажатиеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму(
		"ОбщаяФорма.РеквизитыПлатежаВБюджет",	
		ПараметрыФормы,
		ЭтотОбъект,,,,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура НадписьРеквизитыПлатежаВБюджетНажатиеЗавершение(РеквизитыПлатежаВБюджет, ДополнительныеПараметры) Экспорт
	
	Если РеквизитыПлатежаВБюджет <> Неопределено Тогда	
		Модифицированность = Истина;		
		ЗаполнитьЗначенияСвойств(Объект, РеквизитыПлатежаВБюджет);		
		УправлениеПоказателямиПлатежаВБюджет();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеПоказателямиПлатежаВБюджет()
	
	Элементы.НадписьРеквизитыПлатежаВБюджет.Видимость = Объект.ПеречислениеВБюджет;
	
	Если Объект.ПеречислениеВБюджет Тогда
		Элементы.ИдентификаторПлатежа.Заголовок = НСтр("ru = 'УИН'");
		Элементы.ИдентификаторПлатежа.Подсказка = НСтр("ru = 'Уникальный идентификатор начисления указывается, если предоставлен получателем (администратором) платежа.'");
	Иначе
		Элементы.ИдентификаторПлатежа.Заголовок = НСтр("ru = 'УИП'");
		Элементы.ИдентификаторПлатежа.Подсказка = НСтр("ru = 'Уникальный идентификатор платежа указывается, если это предусмотрено договором с получателем платежа.'");
	КонецЕсли;
		
	УстановитьНадписьРеквизитовПлатежаВБюджет();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьРеквизитовПлатежаВБюджет() Экспорт
		 
	Если НЕ ПустаяСтрока(СокрЛП(Объект.КодБК)) Тогда
		КБК = Объект.КодБК;
	Иначе
		КБК = НСтр("ru = '<КБК не указан>'");
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СокрЛП(Объект.КодОКАТО)) Тогда
		КодТерритории = Объект.КодОКАТО;
	Иначе
		КодТерритории = НСтр("ru = '<ОКТМО не указан>'");
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СокрЛП(Объект.СтатусСоставителя)) Тогда
		СтатусСоставителя = Объект.СтатусСоставителя;
	Иначе
		СтатусСоставителя = НСтр("ru = '<Статус составителя не указан>'");
	КонецЕсли;
	
	ЭтаФорма.НадписьРеквизитыПлатежаВБюджет = КБК + "; "
		+ КодТерритории + "; "
		+ СтатусСоставителя + "; "
		+ Объект.ПоказательОснования + "; "
		+ Объект.ПоказательПериода + "; "
		+ Объект.ПоказательНомера + "; "
		+ Объект.ПоказательДаты + "; ";
	
КонецПроцедуры

&НаСервере
Процедура ПеречислениеВБюджетПриИзмененииНаСервере()

	Если Объект.ПеречислениеВБюджет Тогда
		Если ПустаяСтрока(Объект.КодОКАТО) Тогда
			Объект.КодОКАТО = Объект.Организация.КодПоОКТМО;
		КонецЕсли;
	КонецЕсли;
	
	УправлениеПоказателямиПлатежаВБюджет();
КонецПроцедуры

&НаКлиенте
Процедура ПеречислениеВБюджетПриИзменении(Элемент)
	ПеречислениеВБюджетПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УказатьВНазначении(Команда)

	УказатьВНазначенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УказатьВНазначенииНаСервере()
	
	ФинансыСервер.УказатьСуммуИНДСВНазначенииПлатежа(Объект, УчитыватьНДС);
		
КонецПроцедуры


#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	ТолькоПросмотрЭлементов = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		ТолькоПросмотрЭлементов = Истина;
		
		Элементы.Организация.ТолькоПросмотр = НЕ ДоступноИзменениеОрганизацииВДокументахНаОснованииЗаявки;
	КонецЕсли;
		
	ЭлементыТолькоПросмотр = Новый Массив;
	ЭлементыТолькоПросмотр.Добавить(Элементы.Номер);
	//ЭлементыТолькоПросмотр.Добавить(Элементы.Организация);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Касса);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Подразделение);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Сумма);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Валюта);
	ЭлементыТолькоПросмотр.Добавить(Элементы.СуммаНДС);
	ЭлементыТолькоПросмотр.Добавить(Элементы.СтавкаНДС);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Статья);
	ЭлементыТолькоПросмотр.Добавить(Элементы.СтатьяРасходов);
	ЭлементыТолькоПросмотр.Добавить(Элементы.СтатьяРасходовПоНачислению);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ВидОперации);	
	ЭлементыТолькоПросмотр.Добавить(Элементы.Контрагент);
	ЭлементыТолькоПросмотр.Добавить(Элементы.СчетКонтрагента);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Договор);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ПеречислениеВБюджет);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ИдентификаторПлатежа);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ОчередностьПлатежа);
	ЭлементыТолькоПросмотр.Добавить(Элементы.НазначениеПлатежа);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Дополнительно);	
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаРаспределениеПлатежа);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаЗарплатаСотрудникам);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ОтображениеПериодаРегистрации);

	Для каждого Элемент Из ЭлементыТолькоПросмотр Цикл
		Элемент.ТолькоПросмотр = ТолькоПросмотрЭлементов;
	КонецЦикла;
	
	ЭлементыДоступность = Новый Массив;
	ЭлементыДоступность.Добавить(Элементы.РаспределениеПлатежаРаспределение_ЗаказПоставщику);
	ЭлементыДоступность.Добавить(Элементы.УказатьВНазначении);
	ЭлементыДоступность.Добавить(Элементы.НадписьРеквизитыПлатежаВБюджет);
	
	Для каждого Элемент Из ЭлементыДоступность Цикл
		Элемент.Доступность = НЕ ТолькоПросмотрЭлементов;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерезаполнитьПоЗаявке(Команда)
 
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда	
		НовоеОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОПерезаполненииоПоЗаявке",ЭтаФорма);
		ПоказатьВопрос(НовоеОписаниеОповещения, "Очистить и перезаполнить документ согласно заявке?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПерезаполненииоПоЗаявке(Результат, Параметры) Экспорт	
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    Если ПерезаполнитьПоЗаявкеНаСервере() Тогда	
		ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
		ОбновитьДанные();
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПерезаполнитьПоЗаявкеНаСервере()
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДокументОбъект.ЗарплатаСотрудникам.Очистить();
		ДокументОбъект.РаспределениеПлатежа.Очистить();
	    ДокументОбъект.Заполнить(объект.Основание);
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		Возврат Истина;
	Иначе
		Сообщить("Предварительно объект должен быть записан!");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	Если НЕ Объект.ВидОперации.Пустая() Тогда
    	Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, Объект.ВидОперации, Ложь);
		Объект.СтатьяРасходовПоНачислению = Объект.СтатьяРасходов; //#9708
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизации()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю Тогда
		УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
		Объект.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);
	Иначе
		УчитыватьНДС = Истина;
	КонецЕсли;
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Распределение_ПодобратьПоОстаткам(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПодобратьПоОстаткамЗавершение", ЭтотОбъект);
	ОбщийМодульКлиент.ПроверитьВозможностьПодбораЗаказовВДокументРасхода(Оповещение, ЭтаФорма, Объект.РаспределениеПлатежа);
		
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПоОстаткамЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	АдресПлатежейВХранилище = ПоместитьРасшифровкуПлатежаВХранилище();
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("АдресПлатежейВХранилище", АдресПлатежейВХранилище);
	ПараметрыПодбора.Вставить("Организация", Объект.Организация);
	ПараметрыПодбора.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыПодбора.Вставить("Валюта", Объект.Валюта);
	ПараметрыПодбора.Вставить("СуммаДокумента", Объект.Сумма);
	ПараметрыПодбора.Вставить("ДатаДокумента", Объект.Дата);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораПоРасчетамСКонтрагентами",	ПараметрыПодбора, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьРасшифровкуПлатежаВХранилище()
	
	АдресПлатежейВХранилище = ПоместитьВоВременноеХранилище(Объект.РаспределениеПлатежа.Выгрузить(), УникальныйИдентификатор);
	Возврат АдресПлатежейВХранилище;
	
КонецФункции

&НаСервере
Процедура ПолучитьРаспределениеПлатежаИзХранилища(АдресПлатежейВХранилище)
	
	Объект.РаспределениеПлатежа.Загрузить(ПолучитьИзВременногоХранилища(АдресПлатежейВХранилище));
	
КонецПроцедуры

&НаКлиенте
Процедура Распределение_Команда(Команда)
	
	ИмяФормыВыбора = "Документ." + СтрЗаменить(Команда.Имя, "Распределение_", "") + ".ФормаВыбора";
	Если Не Объект.Контрагент.Пустая() Тогда
		ЗначениеОтбора = Новый Структура("Контрагент", Объект.Контрагент);
		ПараметрВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		ПараметрВыбора.Вставить("МножественныйВыбор", Истина);
		ОткрытьФорму(ИмяФормыВыбора, ПараметрВыбора, Элементы.РаспределениеПлатежа);
		// результат обрабатывается в РаспределениеПлатежаОбработкаВыбора как владельца формы выбора
	Иначе
		Состояние("Не указан контрагент");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для каждого ВыбранныйДокумент из ВыбранноеЗначение Цикл
		Если НЕ ВыбранныйДокумент.Пустая() Тогда
			НоваяСтрока = Объект.РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ВыбранныйДокумент;
			НоваяСтрока.Сумма = Объект.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	//ОбновитьДанные();
	
КонецПроцедуры

//++ №12092
&НаКлиенте
Процедура ЗарплатаСотрудникам_ЗаполнитьПоОстаткам(Команда)
	
	Если Объект.ЗарплатаСотрудникам.Количество() > 0 Тогда
		
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВопросаОбОчищенииТабличнойЧастиЗарплатаСотрудникам", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "При продолжении табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗарплатаСотрудникам_ЗаполнитьПоОстаткамНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчищенииТабличнойЧастиЗарплатаСотрудникам(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаСотрудникам_ЗаполнитьПоОстаткамНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗарплатаСотрудникам_ЗаполнитьПоОстаткамНаСервере()
	
	Объект.ЗарплатаСотрудникам.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Владелец КАК Сотрудник,
	|	МАКСИМУМ(БанковскиеСчета.Ссылка) КАК Ссылка,
	|	СУММА(1) КАК КоличествоСчетов
	|ПОМЕСТИТЬ ВТ_БанковскиеСчетаСотрудников
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	НЕ БанковскиеСчета.ПометкаУдаления
	|	И БанковскиеСчета.Владелец ССЫЛКА Справочник.Сотрудники
	|	
	|СГРУППИРОВАТЬ ПО
	|	БанковскиеСчета.Владелец
	|;
	|//////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПерсоналомОстатки.Сотрудник КАК Сотрудник,
	|   РасчетыСПерсоналомОстатки.СуммаОстаток КАК Сумма,
	|	ЕСТЬNULL(БанковскиеСчетаСотрудников.Ссылка, Значение(Справочник.БанковскиеСчета.ПустаяСсылка)) КАК СчетСотрудника
	|ИЗ
	|	РегистрНакопления.РасчетыСПерсоналом.Остатки(&Дата, Организация = &Организация) КАК РасчетыСПерсоналомОстатки
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БанковскиеСчетаСотрудников КАК БанковскиеСчетаСотрудников
	|      	ПО РасчетыСПерсоналомОстатки.Сотрудник = БанковскиеСчетаСотрудников.Сотрудник
	|			И БанковскиеСчетаСотрудников.КоличествоСчетов = 1
	|
	|ГДЕ
	|	РасчетыСПерсоналомОстатки.СуммаОстаток > 0
	|";
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.ЗарплатаСотрудникам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
	Объект.Сумма = Объект.ЗарплатаСотрудникам.Итог("Сумма");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСотрудникамПослеУдаления(Элемент)
	
	Объект.Сумма = Объект.ЗарплатаСотрудникам.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПроцентовПоЗаймуПриИзменении(Элемент)
	Если Объект.Сумма > 0 И Объект.Сумма > Объект.СуммаПроцентовПоЗайму Тогда
		 Объект.СуммаОсновногоТелаЗайма = Объект.Сумма - Объект.СуммаПроцентовПоЗайму;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаОсновногоТелаЗаймаПриИзменении(Элемент)
	Если Объект.Сумма > 0 И Объект.Сумма > Объект.СуммаОсновногоТелаЗайма Тогда
		Объект.СуммаПроцентовПоЗайму = Объект.Сумма - Объект.СуммаОсновногоТелаЗайма;
	КонецЕсли;
КонецПроцедуры
//-- №12092


