
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	НастраиваемыйОбъект = ТекущаяСтрока.НастраиваемыйОбъект;
	Если ТипЗнч(НастраиваемыйОбъект) = Тип("СправочникСсылка.ПроизвольныеОтчеты")
	 ИЛИ ТипЗнч(НастраиваемыйОбъект) = Тип("СправочникСсылка.ПанелиОтчетов") Тогда
		СтандартнаяОбработка = Ложь;
		ПодменюВыбора = Новый СписокЗначений;
		ПодменюВыбора.Добавить(1, "Открыть элемент с выбранной настройкой");
		ПодменюВыбора.Добавить(2, "Открыть форму настройки");
		РезультатВыбора = ВыбратьИзМеню(ПодменюВыбора, Элемент);
		Если РезультатВыбора <> Неопределено Тогда
			ОткрытьФорму("Справочник.СохраненныеНастройки.ФормаОбъекта", Новый Структура("Ключ, РежимРедактирования", ТекущаяСтрока, РезультатВыбора.Значение = 2));
		КонецЕсли;
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры
