
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Если ТипЗнч(Элемент.ВыделенныеСтроки) = Тип("Массив") Тогда
		ПодключитьОбработчикОжидания("ОповещениеРасторжениеЗаказДоговоров", 0.3, истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеРасторжениеЗаказДоговоров()

	МассивЗаказов = СформироватьМассивОснованийНаСервере(Элементы.Список.ВыделенныеСтроки);
	Если МассивЗаказов.Количество() > 0 Тогда
		Оповестить("ЦентрСобытий_РасторжениеЗаказДоговора", МассивЗаказов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьМассивОснованийНаСервере(Знач МассивСОРД)
	
	МассивЗаказов = Новый Массив;
	Для каждого СсылкаНаСОРД из МассивСОРД Цикл
		ДанныеСОРД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаСОРД, "Проведен, ЗаказДоговор");
		Если ДанныеСОРД.Проведен Тогда
			Если ЗначениеЗаполнено(ДанныеСОРД.ЗаказДоговор) Тогда
				МассивЗаказов.Добавить(Новый Структура("СОРД, Заказ", СсылкаНаСОРД ,ДанныеСОРД.ЗаказДоговор));
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	
	Возврат МассивЗаказов;
	
КонецФункции

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
