
Процедура ЗаполнитьОбщиеРеквизиты(ДокументСсылка, ОбщиеПараметры, ЭкземплярПодключаемогоОборудования = Неопределено) Экспорт
	
	//ОбщиеПараметры определяемые функцией
	//МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
	
	ОбщиеПараметры.Вставить("ДокументОснование" , ДокументСсылка); // Ссылка,Обязательно. Документ по которому пробивается чек. 
	ОбщиеПараметры.Вставить("Организация"       , ДокументСсылка.Организация); // Ссылка,Обязательно. Организация по которому пробивается чек.
	
	ОбщиеПараметры.ТипРасчета          = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств");
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМ") 
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("Структура") Тогда
		Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда			
			ОбщиеПараметры.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств");
		КонецЕсли;
	
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		ОбщиеПараметры.ТипРасчета      = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств");
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОплатаБанковскойКартой") Тогда
		Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту Тогда			
			ОбщиеПараметры.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств");
		КонецЕсли;
	КонецЕсли;
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка.Организация, "Наименование,ПолноеНаименование,ИНН,КПП");
	
	ОбщиеПараметры.ОрганизацияНазвание = ?(ПустаяСтрока(РеквизитыОрганизации.ПолноеНаименование), РеквизитыОрганизации.Наименование, РеквизитыОрганизации.ПолноеНаименование);
	ОбщиеПараметры.ОрганизацияИНН      = РеквизитыОрганизации.ИНН;
	ОбщиеПараметры.ОрганизацияКПП      = РеквизитыОрганизации.КПП;
	ОбщиеПараметры.АдресРасчетов   	   = ПолучитьАдресРасчетов(ДокументСсылка);	
	ОбщиеПараметры.МестоРасчетов       = "";
	
	ОбщиеПараметры.СистемаНалогообложения = ПолучитьСистемуНалогообложения(ДокументСсылка.Организация, ДокументСсылка.Подразделение); // #14195 добавлено Подразделение
	
	РеквизитыКассира = ПотолкиКассыОнлайн.РеквизитыКассира(ДокументСсылка.Автор);
	ОбщиеПараметры.Кассир    = РеквизитыКассира.Наименование;
	ОбщиеПараметры.КассирИНН = РеквизитыКассира.ИНН;
	
	СведенияОКонтрагенте = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка.Контрагент, "НаименованиеПолное,ИНН,ВидКонтрагента");
	Если СведенияОКонтрагенте.ВидКонтрагента = Перечисления.ВидКонтрагента.ЮрЛицо 
		ИЛИ ЗначениеЗаполнено(СведенияОКонтрагенте.ИНН) Тогда			
		ОбщиеПараметры.Получатель    = СведенияОКонтрагенте.НаименованиеПолное;
		ОбщиеПараметры.ПолучательИНН = СведенияОКонтрагенте.ИНН;		
	КонецЕсли;
	
	Если НЕ ЭкземплярПодключаемогоОборудования = Неопределено Тогда
		РеквизитыККТ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭкземплярПодключаемогоОборудования, "ТипОборудования,СпособФорматноЛогическогоКонтроля");
		Если РеквизитыККТ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			ОбщиеПараметры.СпособФорматноЛогическогоКонтроля = РеквизитыККТ.СпособФорматноЛогическогоКонтроля;
		КонецЕсли;
	КонецЕсли;
	
	// Параметры необходимые для чека ЕНВД на принтере чеков
	ОбщиеПараметры.НомерКассы = 1;
	Если НЕ ТипЗнч(ДокументСсылка) = Тип("Структура") И ОбщегоНазначения.ЕстьРеквизитОбъекта("Касса", ДокументСсылка.Метаданные()) Тогда		
		ОбщиеПараметры.НомерКассы = ДокументСсылка.Касса.НомерКассы; 
	КонецЕсли;
	ОбщиеПараметры.НомерЧека  = ДокументСсылка.Номер;
	ОбщиеПараметры.НомерСмены = 1;
	
КонецПроцедуры

Процедура ДополнитьТоварамиПараметрыПриПробитииЧека(ДокументОбъект, ОбщиеПараметры) Экспорт
	
	ТаблицаДокумента = ДокументОбъект.РаспределениеПлатежа.Выгрузить(,"Документ,Сумма");	
	ТаблицаДокумента.Свернуть("Документ", "Сумма");
	ТаблицаДокумента.Колонки.Добавить("ТипДокумента");
	ТаблицаДокумента.Колонки.Добавить("СуммаДокумента");
	ЕстьДокументыПродажи 	 = Ложь;
	ЕстьЗаказДоговоры 		 = Ложь;
	ЕстьЗаказыПокупателей 	 = Ложь;
	ЕстьЗаказыНаПроизводство = Ложь;
	ЕстьВозвраты 			 = Ложь;
	Для каждого ТекСтрока Из ТаблицаДокумента Цикл
		ТекСтрока.ТипДокумента = ТипЗнч(ТекСтрока.Документ);
		ТекСтрока.СуммаДокумента = ТекСтрока.Документ.СуммаДокумента;
		
		Если ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.Монтаж")
			ИЛИ ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
			ЕстьДокументыПродажи = Истина;
		ИначеЕсли ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда	
			ЕстьЗаказДоговоры = Истина;
		ИначеЕсли ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда	
			ЕстьЗаказыПокупателей = Истина;
		ИначеЕсли ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда	
			ЕстьЗаказыНаПроизводство = Истина;
		КонецЕсли;		
	КонецЦикла;
	
	НомерСтрокиТовара = 0;
	
	ТребуетсяЗачетАванса = Истина;
	// Таблица оплат
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		СтрокаОплаты  = МенеджерОборудованияКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"); 
		СтрокаОплаты.Сумма = ДокументОбъект.Сумма;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.ОплатаБанковскойКартой") ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		СтрокаОплаты  = МенеджерОборудованияКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"); 
		СтрокаОплаты.Сумма = ДокументОбъект.Сумма;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;
	
	// документ без распределения
	Если ТаблицаДокумента.Количество() = 0 Тогда
		ДобавитьСтрокуАванса(ОбщиеПараметры, НомерСтрокиТовара, ДокументОбъект.Контрагент, ДокументОбъект.Сумма);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьДокументыПродажи Тогда
		//распределение по заказам
		СуммаРаспределенияПоЗаказам = 0;
		СуммаПоЗаказам = 0;
		СуммаСтрокиАванса = 0;
		ЗачетАванса = 0;
		МассивЗаказов = Новый Массив;
		Если ЕстьЗаказДоговоры Тогда
			РассчитатьСуммы(ТаблицаДокумента, Тип("ДокументСсылка.ЗаказДоговор"), МассивЗаказов, СуммаРаспределенияПоЗаказам, СуммаПоЗаказам);
		ИначеЕсли ЕстьЗаказыПокупателей Тогда
			РассчитатьСуммы(ТаблицаДокумента, Тип("ДокументСсылка.ЗаказПокупателя"), МассивЗаказов, СуммаРаспределенияПоЗаказам, СуммаПоЗаказам);
		ИначеЕсли ЕстьЗаказыНаПроизводство Тогда	
			РассчитатьСуммы(ТаблицаДокумента, Тип("ДокументСсылка.ЗаказНаПроизводство"), МассивЗаказов, СуммаРаспределенияПоЗаказам, СуммаПоЗаказам);
		КонецЕсли;
		
		ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
		Если СуммаПоЗаказам > СуммаРаспределенияПоЗаказам Тогда
			ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная;	
		//ИначеЕсли ДокументОбъект.Сумма > СуммаРаспределенияПоЗаказам Тогда
		КонецЕсли;	
		Если ДокументОбъект.Сумма > СуммаРаспределенияПоЗаказам Тогда
			СуммаСтрокиАванса = ДокументОбъект.Сумма - СуммаРаспределенияПоЗаказам
		КонецЕсли;
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
			
		// Позиции по заказам
		Если МассивЗаказов.Количество() > 0 Тогда
			ДобавитьПозицииЧекаПоДокументамРасчетов(МассивЗаказов, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета, ПризнакПредметаРасчета); 			
		КонецЕсли;
		
		Если СуммаСтрокиАванса > 0 Тогда
			ДобавитьСтрокуАванса(ОбщиеПараметры, НомерСтрокиТовара, ДокументОбъект.Контрагент, СуммаСтрокиАванса);
		КонецЕсли;			
		
		Если НЕ ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств Тогда //++ 2021-04-14 если возврат аванса, то не добавляем дополнительные строки оплат		
			//Сумма ПКО меньше суммы документов		
			ЗачетАванса = РассчитатьЗачетАванса(МассивЗаказов, СуммаПоЗаказам, ДокументОбъект.МоментВремени().Дата);	
			Если ЗачетАванса > 0 Тогда
				СтрокаОплаты  = МенеджерОборудованияКлиентСервер.ПараметрыСтрокиОплаты();
				СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата");
				СтрокаОплаты.Сумма = ЗачетАванса;
				ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;
		КонецЕсли;
		
		Постоплата = СуммаПоЗаказам - ЗачетАванса - ДокументОбъект.Сумма;
		Если Постоплата > 0 Тогда
			СтрокаОплаты  = МенеджерОборудованияКлиентСервер.ПараметрыСтрокиОплаты();
			СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата");
			СтрокаОплаты.Сумма = Постоплата;
			ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;		 

	Иначе
		// распределение по документам продажи
		СуммаРаспределенияПоДокументам = 0;
		СуммаПоДокументам = 0;
		СуммаСтрокиАванса = 0;
		ЗачетАванса = 0;
		МассивДокументов = Новый Массив;
		
		РассчитатьСуммы(ТаблицаДокумента, Тип("ДокументСсылка.РеализацияТоваровИУслуг"), МассивДокументов, СуммаРаспределенияПоДокументам, СуммаПоДокументам);
		Если МассивДокументов.Количество() = 0 Тогда
			РассчитатьСуммы(ТаблицаДокумента, Тип("ДокументСсылка.Монтаж"), МассивДокументов, СуммаРаспределенияПоДокументам, СуммаПоДокументам);	
		КонецЕсли;
		
		ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;
		
		Если ДокументОбъект.Сумма > СуммаРаспределенияПоДокументам Тогда
			СуммаСтрокиАванса = ДокументОбъект.Сумма - СуммаРаспределенияПоДокументам;
		КонецЕсли;

		Если СуммаПоДокументам > ДокументОбъект.Сумма Тогда
			//Сумма ПКО меньше суммы документов
			
		КонецЕсли;
		
		// Позиции по документам
		Если МассивДокументов.Количество() > 0 Тогда
			ДобавитьПозицииЧекаПоДокументамРасчетов(МассивДокументов, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета);
		КонецЕсли;
		
		Если СуммаСтрокиАванса > 0 Тогда
			ДобавитьСтрокуАванса(ОбщиеПараметры, НомерСтрокиТовара, ДокументОбъект.Контрагент, СуммаСтрокиАванса);
		КонецЕсли;
				
		//Если СуммаПоДокументам > ДокументОбъект.Сумма Тогда
			//Сумма ПКО меньше суммы документов
		Если НЕ ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств Тогда // #13445 продублировано условие как по заказам	
			ЗачетАванса = РассчитатьЗачетАванса(МассивДокументов, СуммаПоДокументам, ДокументОбъект.МоментВремени().Дата);
			Если ЗачетАванса > 0 Тогда
				СтрокаОплаты  = МенеджерОборудованияКлиентСервер.ПараметрыСтрокиОплаты();
				СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата");
				СтрокаОплаты.Сумма = ЗачетАванса;
				ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;			
		КонецЕсли;
		
		Постоплата = СуммаПоДокументам - ЗачетАванса - ДокументОбъект.Сумма;
		Если Постоплата > 0 Тогда
			СтрокаОплаты  = МенеджерОборудованияКлиентСервер.ПараметрыСтрокиОплаты();
			СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата");
			СтрокаОплаты.Сумма = Постоплата;
			ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
		//КонецЕсли;

	КонецЕсли;
	
	// #11287 СпособФорматноЛогическогоКонтроля - заполняем при заполнении общих параметров
	Если НЕ ОбщиеПараметры.СпособФорматноЛогическогоКонтроля = Неопределено Тогда
		Отказ = Ложь;
		МенеджерОборудованияВызовСервера.ПривестиДанныеКТребуемомуФормату(ОбщиеПараметры, Отказ, "", Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьТоварамиПараметрыПриПробитииЧекаПоДокументуПродажи(ДокументСсылка, ОбщиеПараметры) Экспорт
	
	// процедура для РТиУ и монтаж
	СуммаДокумента = ДокументСсылка.СуммаДокумента;
	МассивДокументов = Новый Массив;
	//МассивДокументов.Добавить(ДокументСсылка);
	МассивДокументов.Добавить(Новый Структура("Документ, СуммаДокумента, СуммаРаспределения", ДокументСсылка, СуммаДокумента, СуммаДокумента));
	
	ЗачетАванса = РассчитатьЗачетАванса(МассивДокументов, СуммаДокумента, ДокументСсылка.МоментВремени().Дата + 1);
	Постоплата = СуммаДокумента - ЗачетАванса;
	
	НомерСтрокиТовара = 0;
	ПризнакСпособаРасчета = Неопределено;
					
	Если ЗачетАванса = 0 Тогда
		ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаБезОплаты; 
	ИначеЕсли ЗачетАванса >= СуммаДокумента Тогда
		ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	ИначеЕсли ЗачетАванса < СуммаДокумента Тогда
		ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой;
	КонецЕсли;
	
	ДобавитьПозицииЧекаПоДокументамРасчетов(МассивДокументов, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета);
	
	// Таблица оплат
	Если ЗачетАванса > 0 Тогда
		СтрокаОплаты  = МенеджерОборудованияКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата");
		СтрокаОплаты.Сумма = ЗачетАванса;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;
	
	Если Постоплата > 0 Тогда
		СтрокаОплаты  = МенеджерОборудованияКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата");
		СтрокаОплаты.Сумма = Постоплата;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;
		
КонецПроцедуры

Процедура ДополнитьТоварамиПараметрыПриПробитииЧекаПоЧекуККМ(СтруктураДанных, ОбщиеПараметры) Экспорт
	// процедура для ЧекККМ
	ДокументСсылка = СтруктураДанных.ЧекККМСсылка;
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(новый Структура("Документ, СуммаДокумента, СуммаРаспределения", ДокументСсылка, ДокументСсылка.СуммаДокумента, ДокументСсылка.СуммаДокумента));
	//СуммаДокумента = ДокументСсылка.СуммаДокумента;
	//ЗачетАванса = РассчитатьЗачетАванса(МассивДокументов, СуммаДокумента, ДокументСсылка.МоментВремени().Дата + 1);
	//Постоплата = СуммаДокумента - ЗачетАванса;
	
	НомерСтрокиТовара = 0;
	ПризнакСпособаРасчета = Неопределено;
					
	ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	
	ДобавитьПозицииЧекаПоДокументамРасчетов(МассивДокументов, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета);
	
	// Таблица оплат
	Если НЕ СтруктураДанных.Свойство("ТаблицаОплат") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМОплата.Сумма,
		|	ВЫРАЗИТЬ(ЧекККМОплата.ВидОплаты КАК Перечисление.ВидыОплатЧекаККМ) КАК ВидОплаты
		|ПОМЕСТИТЬ ТаблицаВЗапросе
		|ИЗ
		|	&Оплата КАК ЧекККМОплата
		|ГДЕ
		|	НЕ ЧекККМОплата.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплатЧекаККМ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВЗапросе.Сумма,
		//|	ТаблицаВЗапросе.ВидОплаты.ТипОплаты КАК ТипОплаты
		|	ВЫБОР 
		|		КОГДА ТаблицаВЗапросе.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплатЧекаККМ.Наличные)
		|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Наличные)
		|		КОГДА ТаблицаВЗапросе.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплатЧекаККМ.ПлатежнаяКарта)
		|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Электронно)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Наличные)
		|	КОНЕЦ КАК ТипОплаты
		|ПОМЕСТИТЬ ТаблицаСТипамиОплат
		|ИЗ
		|	ТаблицаВЗапросе КАК ТаблицаВЗапросе
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ТаблицаСТипамиОплат.Сумма) КАК Сумма,
		|	ТаблицаСТипамиОплат.ТипОплаты
		|ИЗ
		|	ТаблицаСТипамиОплат КАК ТаблицаСТипамиОплат
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаСТипамиОплат.ТипОплаты
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТаблицаСТипамиОплат.Сумма) >= 0";
		
		Запрос.УстановитьПараметр("Оплата", ДокументСсылка.Оплата.Выгрузить());
		
		Результат = Запрос.Выполнить();
		ТаблицаПоТипамОплат = Результат.Выгрузить();
	Иначе
		// для случая предпросмотра чека ККМ
		ТаблицаПоТипамОплат = СтруктураДанных.ТаблицаОплат.Выгрузить();
	КонецЕсли;
	
	// Наличные
	СтрокаТаблицы = ТаблицаПоТипамОплат.Найти(Перечисления.ТипыОплатыККТ.Наличные, "ТипОплаты");
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		СтрокаОплаты = Новый Структура();
		СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Наличные);
		СтрокаОплаты.Вставить("Наименование", НСтр("ru = 'Наличные'"));
		СтрокаОплаты.Вставить("Сумма", СтрокаТаблицы.Сумма);
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;
	
	СуммаЭлектронно = 0;
	
	// Платежная карта
	СтрокаТаблицы = ТаблицаПоТипамОплат.Найти(Перечисления.ТипыОплатыККТ.Электронно, "ТипОплаты");
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		СуммаЭлектронно = СтрокаТаблицы.Сумма;
	КонецЕсли;
	
	Если СуммаЭлектронно > 0 Тогда
		СтрокаОплаты = Новый Структура();
		СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Электронно);
		СтрокаОплаты.Вставить("Наименование", НСтр("ru = 'Электронно'"));
		СтрокаОплаты.Вставить("Сумма", СуммаЭлектронно);
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;
	
	//СуммаКредита = 0;
	//
	//// В рассрочку и кредитом
	//СтрокаТаблицы = ТаблицаПоТипамОплат.Найти(Перечисления.ТипыОплатЧекаККМ.ВРассрочку, "ТипОплаты");
	//Если НЕ СтрокаТаблицы = Неопределено Тогда
	//	СуммаКредита = СуммаКредита + СтрокаТаблицы.Сумма;
	//КонецЕсли;
	//
	//// Банковский кредит
	//СтрокаТаблицы = ТаблицаПоТипамОплат.Найти(Перечисления.ТипыОплатЧекаККМ.БанковскийКредит, "ТипОплаты");
	//Если НЕ СтрокаТаблицы = Неопределено Тогда
	//	СуммаКредита = СуммаКредита + СтрокаТаблицы.Сумма;
	//КонецЕсли;
	//
	//Если СуммаКредита > 0 Тогда
	//	СтрокаОплаты = Новый Структура();
	//	СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Постоплата);
	//	СтрокаОплаты.Вставить("Наименование", НСтр("ru = 'Постоплата'"));
	//	СтрокаОплаты.Вставить("Сумма", СуммаКредита);
	//	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	//КонецЕсли;
	//
	//ЗачетАванса = 0;
	//
	//// Подарочный сертификат
	//СтрокаТаблицы = ТаблицаПоТипамОплат.Найти(Перечисления.ТипыОплатЧекаККМ.ПодарочныйСертификат, "ТипОплаты");
	//Если НЕ СтрокаТаблицы = Неопределено Тогда
	//	ЗачетАванса = СтрокаТаблицы.Сумма;
	//КонецЕсли;
	//
	//// Зачет аванс
	//СтрокаТаблицы = ТаблицаПоТипамОплат.Найти(Перечисления.ТипыОплатЧекаККМ.ЗачетАванса, "ТипОплаты");
	//Если НЕ СтрокаТаблицы = Неопределено Тогда
	//	ЗачетАванса = ЗачетАванса + СтрокаТаблицы.Сумма;
	//КонецЕсли;
	//
	//Если ЗачетАванса > 0 Тогда
	//	СтрокаОплаты = Новый Структура();
	//	СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Предоплата);
	//	СтрокаОплаты.Вставить("Наименование", НСтр("ru = 'Зачет аванс'"));
	//	СтрокаОплаты.Вставить("Сумма", ЗачетАванса);
	//	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	//КонецЕсли;
	
КонецПроцедуры
	
Функция РассчитатьСуммы(ТаблицаДокумента, ТипДокумента, МассивЗаказов, СуммаРаспределенияПоЗаказам, СуммаПоЗаказам)
	
	МассивЗаказовДокумента = ТаблицаДокумента.НайтиСтроки(Новый Структура("ТипДокумента", ТипДокумента));			
	Для каждого ЭлементМассива из МассивЗаказовДокумента Цикл
		СуммаРаспределенияПоЗаказам = СуммаРаспределенияПоЗаказам + Мин(ЭлементМассива.Сумма, ЭлементМассива.СуммаДокумента);
		СуммаПоЗаказам = СуммаПоЗаказам + ЭлементМассива.СуммаДокумента;
		МассивЗаказов.Добавить(Новый Структура("Документ, СуммаДокумента, СуммаРаспределения", ЭлементМассива.Документ, ЭлементМассива.СуммаДокумента, Мин(ЭлементМассива.Сумма, ЭлементМассива.СуммаДокумента)));
	КонецЦикла;
	
	Возврат СуммаРаспределенияПоЗаказам;
	
КонецФункции

Процедура ДобавитьПозицииЧекаПоДокументамРасчетов(МассивДокументовРасчетов, ОбщиеПараметры, НомерСтрокиТовара = 0, ПризнакСпособаРасчета, ПризнакПредметаРасчета=Неопределено, ПересчитыватьСуммуСтроки = Ложь) Экспорт
	
	//ТипДокументаРасчета = ТипЗнч(МассивДокументовРасчетов[0]);
	ТипДокументаРасчета = ТипЗнч(МассивДокументовРасчетов[0].Документ);
	
	// Определим табличные части
	ИмяТабличнойЧасти = Новый Массив;
	Если ТипДокументаРасчета = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		ИмяТабличнойЧасти.Добавить("Товары");
		ИмяТабличнойЧасти.Добавить("Услуги");
		ИмяТабличнойЧасти.Добавить("Продукция");
	ИначеЕсли ТипДокументаРасчета = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ИмяТабличнойЧасти.Добавить("ТоварыУслуги");
	ИначеЕсли ТипДокументаРасчета = Тип("ДокументСсылка.РеализацияТоваровИУслуг")
		ИЛИ ТипДокументаРасчета = Тип("ДокументСсылка.СчетНаОплату") Тогда
		ИмяТабличнойЧасти.Добавить("Товары");
		ИмяТабличнойЧасти.Добавить("Услуги");
	ИначеЕсли ТипДокументаРасчета = Тип("ДокументСсылка.Монтаж") Тогда
		ИмяТабличнойЧасти.Добавить("ТоварыУслуги");
		ИмяТабличнойЧасти.Добавить("Материалы");		
	ИначеЕсли ТипДокументаРасчета = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		ИмяТабличнойЧасти.Добавить("Товары");
	ИначеЕсли ТипДокументаРасчета = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда 
		ИмяТабличнойЧасти.Добавить("Товары");
	ИначеЕсли ТипДокументаРасчета = Тип("ДокументСсылка.ЧекККМ") Тогда 
		ИмяТабличнойЧасти.Добавить("Товары");
	ИначеЕсли ТипДокументаРасчета = Тип("Структура") Тогда 
		ИмяТабличнойЧасти.Добавить("ТаблицаТоваров");	
	КонецЕсли;
	
	Если ИмяТабличнойЧасти.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьТоварамиПоДокументам(МассивДокументовРасчетов, ИмяТабличнойЧасти, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета, ПризнакПредметаРасчета, ПересчитыватьСуммуСтроки);
	
КонецПроцедуры //Функции

Процедура ДополнитьТоварамиПоДокументам(МассивДокументовРасчетов, МассивТабличныхЧастей, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета, ПризнакПредметаРасчета, ПересчитыватьСуммуСтроки = Ложь)
	
	ТипДокументаРасчета = ТипЗнч(МассивДокументовРасчетов[0].Документ);	
	
	Для каждого ЭлементМассива из МассивДокументовРасчетов Цикл
		ОстатокСуммыРаспределения = ЭлементМассива.СуммаРаспределения;
		// Для Заказа на производство нужно добавить сам потолок
		Если ТипДокументаРасчета = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
			Если НЕ ЭлементМассива.Документ.ПродукцияНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
				НоваяСтрока = Новый Структура;
				//Заполним только теми реквизитами, которые нужны для ККТ
				НоваяСтрока.Вставить("Номенклатура", ЭлементМассива.Документ.ПродукцияНоменклатура);
				НоваяСтрока.Вставить("Количество", ЭлементМассива.Документ.ПродукцияНоменклатураКоличество);
				НоваяСтрока.Вставить("Цена", ЭлементМассива.Документ.ПродукцияЦена);
				НоваяСтрока.Вставить("Сумма", ЭлементМассива.Документ.ПродукцияСумма);
				ДобавитьПозициюЧека(НоваяСтрока, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета, ПризнакПредметаРасчета);
				Если ПересчитыватьСуммуСтроки Тогда
					СтрокаЧека = ОбщиеПараметры.ПозицииЧека[НомерСтрокиТовара-1];
					ПересчитатьСуммыФискальнойСтроки(СтрокаЧека, ЭлементМассива.СуммаДокумента, ЭлементМассива.СуммаРаспределения);
					ОстатокСуммыРаспределения = ОстатокСуммыРаспределения - СтрокаЧека.Сумма;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Для каждого ТабличнаяЧасть Из МассивТабличныхЧастей Цикл
			Для каждого СтрокаТЧ Из ЭлементМассива.Документ[ТабличнаяЧасть] Цикл		
				ИспользуетсяХарактеристика = Ложь;
				ОбъектМетаданныхПоТипу = Метаданные.НайтиПоТипу(ТипЗнч(ЭлементМассива.Документ));
				Если НЕ ОбъектМетаданныхПоТипу = Неопределено Тогда
					ИспользуетсяХарактеристика = ОбщийМодуль.ЕстьРеквизитТабЧастиОбъекта("ХарактеристикаНоменклатуры", ЭлементМассива.Документ.Метаданные(), ТабличнаяЧасть);
				КонецЕсли;
				ДобавитьПозициюЧека(СтрокаТЧ, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета, ПризнакПредметаРасчета, ИспользуетсяХарактеристика);
				
				Если ПересчитыватьСуммуСтроки Тогда
					ЭтоПоследняяСтрока = (СтрокаТЧ.НомерСтроки = ЭлементМассива.Документ[ТабличнаяЧасть].Количество());	
					СтрокаЧека = ОбщиеПараметры.ПозицииЧека[НомерСтрокиТовара-1];
					ПересчитатьСуммыФискальнойСтроки(СтрокаЧека, ЭлементМассива.СуммаДокумента, ЭлементМассива.СуммаРаспределения, ЭтоПоследняяСтрока, ОстатокСуммыРаспределения);
					ОстатокСуммыРаспределения = ОстатокСуммыРаспределения - СтрокаЧека.Сумма;
				КонецЕсли;

			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПозициюЧека(ДанныеСтроки, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета, ПризнакПредметаРасчета, ИспользуетсяХарактеристика = Ложь)
	
	СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
	СтрокаПозицииЧека.ПризнакСпособаРасчета  = ПризнакСпособаРасчета;						
	СтрокаПозицииЧека.ПризнакПредметаРасчета = ?(НЕ ПризнакПредметаРасчета = Неопределено, ПризнакПредметаРасчета, ПолучитьПризнакПредметаРасчета(ДанныеСтроки.Номенклатура));
	
	//++ №12909
	Если ТипЗнч(ДанныеСтроки.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ДанныеСтроки.Номенклатура, ?(ИспользуетсяХарактеристика, ДанныеСтроки.ХарактеристикаНоменклатуры, ""));
	//-- №12909
	Иначе
		ПредставлениеНоменклатуры = "" + ДанныеСтроки.Номенклатура + ?(ИспользуетсяХарактеристика, ОбщийМодульСервер.ПредставлениеХарактеристики(ДанныеСтроки.ХарактеристикаНоменклатуры), "");
	КонецЕсли;
	
	СтрокаПозицииЧека.Наименование = ПредставлениеНоменклатуры;
	СтрокаПозицииЧека.Количество = ДанныеСтроки.Количество;			
	//ЦенаСтроки = СтрокаТЧ.Цена + ?(ДокументОбъект.СуммаВключаетНДС, 0, СтрокаТЧ.СуммаНДС / ?(СтрокаПозицииЧека.Количество = 0, 1, СтрокаПозицииЧека.Количество));
	Если ДанныеСтроки.Количество = 0 Тогда
		ЦенаСтроки = ДанныеСтроки.Цена;
	Иначе
		ЦенаСтроки = ДанныеСтроки.Сумма / ДанныеСтроки.Количество;
	КонецЕсли;
	СтрокаПозицииЧека.Цена = Окр(ЦенаСтроки, 2);
	
	//++ №12344 расскомментировано
	
	//16467 СтрокаПозицииЧека заменено на ДанныеСтроки, иначе сумма скидки не считалась
	//СуммаСкидки = СтрокаПозицииЧека.Цена * СтрокаПозицииЧека.Количество - ДанныеСтроки.Сумма;
	//ЦенаСоСкидкамиСтроки = СтрокаПозицииЧека.Цена - СуммаСкидки / ?(СтрокаПозицииЧека.Количество = 0, 1, СтрокаПозицииЧека.Количество);
	
	СуммаСкидки = ДанныеСтроки.Цена * ДанныеСтроки.Количество - ДанныеСтроки.Сумма;
	ЦенаСоСкидкамиСтроки = ДанныеСтроки.Цена - СуммаСкидки / ?(ДанныеСтроки.Количество = 0, 1, ДанныеСтроки.Количество);
	
	СтрокаПозицииЧека.ЦенаСоСкидками = Окр(ЦенаСоСкидкамиСтроки, 2);
	СтрокаПозицииЧека.СуммаСкидок = СуммаСкидки;
	//-- №12344 расскомментировано
	
	//СтрокаПозицииЧека.ПризнакПредметаРасчета = ?(
	//		ТипЗНЧ(ДокументОбъект) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") 
	//		ИЛИ ТипЗНЧ(ДокументОбъект) = Тип("ДокументСсылка.Монтаж"),             //условие
	//		?(Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ДанныеСтроки.Номенклатура), Перечисления.ПризнакиПредметаРасчета.Услуга, Перечисления.ПризнакиПредметаРасчета.Товар),
	//		Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата);
	
	СтрокаПозицииЧека.Сумма        = ДанныеСтроки.Сумма;
	СтрокаПозицииЧека.НомерСекции  = 1;
	СтрокаПозицииЧека.СтавкаНДС    = СтавкаНДСФискальнойОперации(ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"));
	Попытка
		СтрокаПозицииЧека.СтавкаНДС    = СтавкаНДСФискальнойОперации(ДанныеСтроки.СтавкаНДС);
	Исключение
	КонецПопытки;
	СтрокаПозицииЧека.НомерСтрокиТовара = НомерСтрокиТовара;
	НомерСтрокиТовара = НомерСтрокиТовара + 1;
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
КонецПроцедуры

Процедура ПересчитатьСуммыФискальнойСтроки(СтрокаЧека, СуммаДокумента, СуммаРаспределения, ЭтоПоследняяСтрока = Ложь, ОстатокСуммыРаспределения = 0)
	
	Если СуммаДокумента > СуммаРаспределения Тогда
		Коэффициент = СуммаРаспределения / СуммаДокумента;
		СтрокаЧека.Сумма = Окр(СтрокаЧека.Сумма * Коэффициент, 2);
		Если ЭтоПоследняяСтрока Тогда
			СтрокаЧека.Сумма = ОстатокСуммыРаспределения;
		КонецЕсли;
		Если СтрокаЧека.Количество = 0 Тогда
			ЦенаСтроки = СтрокаЧека.Цена;
		Иначе
			ЦенаСтроки = СтрокаЧека.Сумма / СтрокаЧека.Количество;
		КонецЕсли;
		СтрокаЧека.Цена = Окр(ЦенаСтроки, 2);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуАванса(ОбщиеПараметры, НомерСтрокиТовара, Контрагент, СуммаАванса, Знач ПризнакСпособаРасчета=Неопределено) Экспорт
	
	СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
	СтрокаПозицииЧека.Наименование = НСтр("ru = 'Аванс от: '") + Контрагент; 
	
	СтрокаПозицииЧека.Количество   = 1;
	СтрокаПозицииЧека.ЕдиницаИзмерения = "Платеж"; //++ 2021-04-13
	СтрокаПозицииЧека.Цена         = СуммаАванса;		
	СтрокаПозицииЧека.Сумма        = СуммаАванса;
	СтрокаПозицииЧека.СтавкаНДС    = СтавкаНДСФискальнойОперации(ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"));
	СтрокаПозицииЧека.НомерСекции  = 1;
	СтрокаПозицииЧека.ПризнакСпособаРасчета  = ?(ПризнакСпособаРасчета = Неопределено, Перечисления.ПризнакиСпособаРасчета.Аванс, ПризнакСпособаРасчета);
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
	СтрокаПозицииЧека.НомерСтрокиТовара = НомерСтрокиТовара;
	НомерСтрокиТовара = НомерСтрокиТовара + 1;
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
КонецПроцедуры

Функция РассчитатьЗачетАванса(МассивЗаказов, СуммаПоЗаказам, Период)
	
	УстановитьПривилегированныйРежим(Истина);
	Оплачено = 0;
	МассивДокументов = Новый Массив;
	Для каждого ЭлементМассива из МассивЗаказов Цикл
		 МассивДокументов.Добавить(ЭлементМассива.Документ);
	КонецЦикла;	
		
	Запрос = Новый Запрос;
	// #13445 изменен запрос
	//Запрос.Текст = 
	//"ВЫБРАТЬ 
	//|	РасчетыПоЗаказамОбороты.СуммаРасход КАК СуммаАванса
	//|ИЗ
	//|	РегистрНакопления.РасчетыПоЗаказам.Обороты(, &Период, , Заказ В (&Заказ)) КАК РасчетыПоЗаказамОбороты";
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	-1 * ЕСТЬNULL(СУММА(РасчетыПоЗаказамОбороты.СуммаОборот), 0) КАК СуммаАванса
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Обороты(, &Период, Регистратор, Заказ В (&Заказ)) КАК РасчетыПоЗаказамОбороты
	|ГДЕ
	|	НЕ РасчетыПоЗаказамОбороты.Регистратор В (&Заказ)";
	
	Запрос.УстановитьПараметр("Заказ", МассивДокументов);
	Запрос.УстановитьПараметр("Период", Новый Граница(Период, ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Оплачено = Выборка.СуммаАванса; 
	КонецЕсли;
	
	Оплачено = Мин(СуммаПоЗаказам, Оплачено);
	
	Возврат Оплачено;
	
КонецФункции

Процедура ДобавитьСтрокуОплаты(ОбщиеПараметры, ТипОплаты, Сумма) Экспорт
	
	СтрокаОплаты  = МенеджерОборудованияКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.ТипОплаты = ТипОплаты; 
	СтрокаОплаты.Сумма = Сумма;
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
КонецПроцедуры
				
//
Функция РеквизитыКассира(Кассир = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Пользователи.Сотрудник.ИНН, """") КАК ИНН,
	|	ЕСТЬNULL(Пользователи.Сотрудник.Наименование, """") КАК Наименование
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Кассир");
	Запрос.УстановитьПараметр("Кассир", ?(Кассир = Неопределено, Пользователи.ТекущийПользователь(), Кассир));
	
	РеквизитыКассира = Новый Структура;
	РеквизитыКассира.Вставить("ИНН", "");
	РеквизитыКассира.Вставить("Наименование", НСтр("ru = 'Администратор'"));
	
	ВыборкаРеквизитыКассира = Запрос.Выполнить().Выбрать();
	Если ВыборкаРеквизитыКассира.Следующий() Тогда
		
		Если ЗначениеЗаполнено(ВыборкаРеквизитыКассира.Наименование) Тогда
			РеквизитыКассира.Наименование = ВыборкаРеквизитыКассира.Наименование;
		КонецЕсли;
		
		РеквизитыКассира.ИНН = ВыборкаРеквизитыКассира.ИНН;
		
	КонецЕсли;
	
	Возврат РеквизитыКассира;
	
КонецФункции

Процедура ЗаполнитьПараметрыОтправкиЭлектронногоЧекаПоПартнеру(Форма) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Форма.Партнер) Тогда
		
		ВариантОтправкиЭлектронногоЧекаПартнера = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ПустаяСсылка();
		ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять;
		
	Иначе
		
		ВариантОтправкиЭлектронногоЧека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Партнер, "ВариантОтправкиЭлектронногоЧека");
		
		Форма.ВариантОтправкиЭлектронногоЧекаПартнера = ВариантОтправкиЭлектронногоЧека;
		Если Не ЗначениеЗаполнено(ВариантОтправкиЭлектронногоЧека) Тогда
			ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять;
		КонецЕсли;
		
		// телефоны контрагента
		ТелефонКлиента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Форма.Партнер, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		Форма.Телефон10Знаков = НомерТелефонаВФормате10Знаков(ТелефонКлиента);
		Форма.Телефон = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ТелефонКлиента); //"+7" + Форма.Телефон10Знаков;  //#6074 изменено на вызов функции из модуля Софтфон 
		Форма.Элементы.Телефон.СписокВыбора.Добавить(Форма.Телефон);
		
		//электронные адреса контрагента
		ПочтаКлиента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Форма.Партнер, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
		Форма.Email = ПочтаКлиента;
		Форма.Элементы.Email.СписокВыбора.Добавить(Форма.Email);	
		
		Если Форма.Элементы.Телефон.СписокВыбора.Количество() > 0 Тогда
			Форма.Элементы.Телефон.КнопкаВыпадающегоСписка = Истина;
		КонецЕсли;
		
		Если Форма.Элементы.Email.СписокВыбора.Количество() > 0 Тогда
			Форма.Элементы.Email.КнопкаВыпадающегоСписка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьВариантОтправкиЭлектронногоЧека(Форма, ВариантОтправкиЭлектронногоЧека);
	
КонецПроцедуры

Процедура УстановитьВариантОтправкиЭлектронногоЧека(Форма, ВариантОтправкиЭлектронногоЧека) Экспорт
	
	Если Форма.ВариантОтправкиЭлектронногоЧека = ВариантОтправкиЭлектронногоЧека Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ВариантОтправкиЭлектронногоЧека = ВариантОтправкиЭлектронногоЧека;
	
КонецПроцедуры

// Получить 10 знаков номера телефона по переданному представлению.
//
// Параметры:
//  Телефон - Строка - Представление номера телефона.
// 
// Возвращаемое значение:
//  Строка - 10 знаков номера телефона.
//
Функция НомерТелефонаВФормате10Знаков(Телефон) Экспорт
	
	Телефон10Знаков = "";
	Числа = "0123456789";
	
	ДлинаПредставленияТелефона = СтрДлина(Телефон);
	Для Индекс = 1 По ДлинаПредставленияТелефона Цикл
		
		Символ = Сред(Телефон, Индекс, 1);
		Если СтрНайти(Числа, Символ) > 0 Тогда
			Телефон10Знаков = Телефон10Знаков + Символ;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Прав(Телефон10Знаков, 10);
	
КонецФункции

Функция ПолучитьАдресРасчетов(ДокументСсылка)
	
	АдресРасчетов = "";
	
	ОбъектМетаданныхПоТипу = Метаданные.НайтиПоТипу(ТипЗнч(ДокументСсылка));
	
	Если НЕ ОбъектМетаданныхПоТипу = Неопределено Тогда
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Касса", ДокументСсылка.Метаданные()) Тогда		
			АдресРасчетов = ДокументСсылка.Касса.АдресПринятияОплаты; 
		КонецЕсли;
		Если ПустаяСтрока(АдресРасчетов) И ОбщегоНазначения.ЕстьРеквизитОбъекта("ТочкаПродаж", ДокументСсылка.Метаданные()) Тогда
			АдресРасчетов = ДокументСсылка.ТочкаПродаж.ФактическийАдрес;
		КонецЕсли;
		Если ПустаяСтрока(АдресРасчетов) И ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", ДокументСсылка.Метаданные()) Тогда
			АдресРасчетов = ДокументСсылка.Подразделение.ФактическийАдрес;
		КонецЕсли;
		Если ПустаяСтрока(АдресРасчетов) И ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", ДокументСсылка.Метаданные()) Тогда
			АдресРасчетов = ОбщийМодульСервер.ПолучитьАдресИзКонтактнойИнформации(ДокументСсылка.Организация, "Фактический");		
			Если ПустаяСтрока(АдресРасчетов) Тогда
				АдресРасчетов = ОбщийМодульСервер.ПолучитьАдресИзКонтактнойИнформации(ДокументСсылка.Организация, "Юридический");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат АдресРасчетов;
	
КонецФункции

Функция РеквизитыАдресаМестаРасчетов(Знач ФискальноеУстройство) Экспорт
	
	РеквизитыАдресаМестаРасчетов = Новый Структура;
	РеквизитыАдресаМестаРасчетов.Вставить("АдресРасчетов", "");
	РеквизитыАдресаМестаРасчетов.Вставить("МестоРасчетов", "");
	
	Возврат РеквизитыАдресаМестаРасчетов;
	
КонецФункции

Функция СтавкаНДСФискальнойОперации(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС")
		Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка") Тогда
		Возврат Неопределено;
	//ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120") Тогда
	//	Возврат 120;
	//ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118") Тогда
	//	Возврат 118;
	//ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") Тогда
	//	Возврат 110;
	Иначе
		Возврат УчетНДС.ПолучитьСтавкуНДС(СтавкаНДС);
	КонецЕсли;
	
КонецФункции

#Область УправлениеСостояниемСмены

// Функция возвращает структуру, характеризующую состояние последней кассовой смены по кассе ККМ.
//
// Параметры:
//  Объект - СправочникСсылка.КассыККМ, СправочникСсылка.ПодключаемоеОборудование - Ссылка на кассу ККМ
//
// Возвращаемое значение:
//  Структура - Структура описания кассовой смены.
Функция ПолучитьСостояниеКассовойСмены(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КассаККМФискальноеУстройство = Объект; 
	ОтборПоКассеККМ = (ТипЗнч(Объект) = Тип("СправочникСсылка.КассыККМ"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Номер КАК НомерКассовойСмены,
	|	КассоваяСмена.Ссылка КАК КассоваяСмена,
	|	КассоваяСмена.Статус КАК СтатусКассовойСмены,
	|	КассоваяСмена.Организация КАК Организация,
	|	КассоваяСмена.КассаККМ КАК КассаККМ,
	|	КассоваяСмена.ФискальноеУстройство КАК ФискальноеУстройство,
	|	ВЫБОР
	|		КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СменаОткрыта,
	|	ВЫБОР
	|		КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА КассоваяСмена.НачалоКассовойСмены
	|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|	КОНЕЦ КАК ДатаИзмененияСтатуса
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И ВЫБОР
	|			КОГДА &ОтборПоКассеККМ
	|				ТОГДА КассоваяСмена.КассаККМ = &КассаККМФискальноеУстройство
	|			ИНАЧЕ КассоваяСмена.ФискальноеУстройство = &КассаККМФискальноеУстройство
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата УБЫВ,
	|	КассоваяСмена УБЫВ";
	
	Запрос.УстановитьПараметр("ОтборПоКассеККМ",              ОтборПоКассеККМ);
	Запрос.УстановитьПараметр("КассаККМФискальноеУстройство", КассаККМФискальноеУстройство);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОписаниеКассовойСмены = ПолучитьСтруктуруОписанияКассовойСмены();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ОписаниеКассовойСмены, Выборка);
		
		Если (ТекущаяДатаСеанса() - ОписаниеКассовойСмены.ДатаИзмененияСтатуса >= 86400)
			И Выборка.СменаОткрыта Тогда
			ОписаниеКассовойСмены.Ошибка24Часа = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОписаниеКассовойСмены;
	
КонецФункции

// Возвращает пустую структуру состояния кассовой смены.
//
Функция ПолучитьСтруктуруОписанияКассовойСмены()
	
	СостояниеКассовойСмены = Новый Структура;
	СостояниеКассовойСмены.Вставить("ДатаИзмененияСтатуса");
	СостояниеКассовойСмены.Вставить("СтатусКассовойСмены");
	СостояниеКассовойСмены.Вставить("СтатусРегламентныхОпераций");
	СостояниеКассовойСмены.Вставить("КассоваяСмена");
	СостояниеКассовойСмены.Вставить("НаличностьВКассе");
	СостояниеКассовойСмены.Вставить("НомерКассовойСмены");
	СостояниеКассовойСмены.Вставить("СменаОткрыта", Ложь);
	СостояниеКассовойСмены.Вставить("Ошибка24Часа", Ложь);
	СостояниеКассовойСмены.Вставить("ОписаниеОшибки", "");
	
	// Описание реквизитов кассовой смены
	СостояниеКассовойСмены.Вставить("Организация");
	СостояниеКассовойСмены.Вставить("КассаККМ");
	СостояниеКассовойСмены.Вставить("ФискальноеУстройство");
	
	СостояниеКассовойСмены.Вставить("Валюта");
	СостояниеКассовойСмены.Вставить("ВалютаПредставление");
	СостояниеКассовойСмены.Вставить("ВидЦены");
	СостояниеКассовойСмены.Вставить("Кассир");
	СостояниеКассовойСмены.Вставить("Склад");
	СостояниеКассовойСмены.Вставить("АдресСклада", "");
	СостояниеКассовойСмены.Вставить("ЦенаВключаетНДС");
	СостояниеКассовойСмены.Вставить("НалогообложениеНДС");
	
	// Прочее
	СостояниеКассовойСмены.Вставить("СведенияООрганизации");
	СостояниеКассовойСмены.Вставить("СерийныйНомерККМ",       "");
	СостояниеКассовойСмены.Вставить("СистемаНалогообложения", Перечисления.ТипыСистемНалогообложенияККТ.ПустаяСсылка());
	
	Возврат СостояниеКассовойСмены;
	
КонецФункции

// Функция проверяет состояние кассовой смены на дату. Если смена не открыта - возвращается описание ошибки.
//
Функция СменаОткрыта(КассоваяСмена, Дата, ОписаниеОшибки = "") Экспорт
	
	СменаОткрыта = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассоваяСмена.Статус    КАК СтатусКассовойСмены,
	|	КассоваяСмена.НачалоКассовойСмены    КАК НачалоКассовойСмены,
	|	КассоваяСмена.ОкончаниеКассовойСмены КАК ОкончаниеКассовойСмены
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Ссылка = &КассоваяСмена";
	
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
			
			// Если смена открыта, то с момента открытия должно пройти не больше чем 24 часа.
			Если Дата - Выборка.НачалоКассовойСмены < 86400 Тогда
				
				СменаОткрыта = Истина;
				
			Иначе
				
				ОписаниеОшибки = НСтр("ru = 'С момента открытия кассовой смены истекло более 24 часов.'");
				СменаОткрыта = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.СтатусКассовойСмены) Тогда
			
			Если Выборка.ОкончаниеКассовойСмены >= Дата И Выборка.НачалоКассовойСмены <= Дата Тогда
				
				СменаОткрыта = Истина;
				
			Иначе
				
				ОписаниеОшибки = НСтр("ru = 'Кассовая смена закрыта.'");
				СменаОткрыта = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ОписаниеОшибки = НСтр("ru = 'Кассовая смена не открыта.'");
		СменаОткрыта = Ложь;
		
	КонецЕсли;
	
	Возврат СменаОткрыта;
	
КонецФункции

#КонецОбласти

Функция ЗаписатьВЖурналФискальныхОпераций(ТребуетсяПовторнаяПопыткаЗаписи, Знач РеквизитыФискальнойОперацииКассовогоУзла) Экспорт
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	НачатьТранзакцию();
//	Попытка
//		
//		Блокировка = Новый БлокировкаДанных;
//		ЭлементБлокировки = Блокировка.Добавить();
//		ЭлементБлокировки.Область = "РегистрСведений.ЖурналФискальныхОпераций";
//		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
//		ЭлементБлокировки.УстановитьЗначение("ДокументОснование", РеквизитыФискальнойОперацииКассовогоУзла.ДокументОснование);
//		Блокировка.Заблокировать();
//		
//		//ВнесениеДенежныхСредствВКассуККМ = Неопределено;
//		//Если РеквизитыФискальнойОперацииКассовогоУзла.ДополнительныеПараметры.Свойство(
//		//		"ВнесениеДенежныхСредствВКассуККМ",
//		//		ВнесениеДенежныхСредствВКассуККМ)
//		//		И ВнесениеДенежныхСредствВКассуККМ <> Неопределено Тогда
//		//	РеквизитыФискальнойОперацииКассовогоУзла.ДокументОснование = РозничныеПродажи.СоздатьДокументВнесениеДенежныхСредствВКассуККМ(ВнесениеДенежныхСредствВКассуККМ);
//		//КонецЕсли;
//		//
//		//ВыемкаДенежныхСредствИзКассыККМ = Неопределено;
//		//Если РеквизитыФискальнойОперацииКассовогоУзла.ДополнительныеПараметры.Свойство(
//		//		"ВыемкаДенежныхСредствИзКассыККМ",
//		//		ВыемкаДенежныхСредствИзКассыККМ)
//		//		И ВыемкаДенежныхСредствИзКассыККМ <> Неопределено Тогда
//		//	РеквизитыФискальнойОперацииКассовогоУзла.ДокументОснование = РозничныеПродажи.СоздатьДокументВыемкаДенежныхСредствИзКассыККМ(ВыемкаДенежныхСредствИзКассыККМ);
//		//КонецЕсли;
//		
//		ЗаписатьВЖурналФискальныхОперацийУпрощенно(РеквизитыФискальнойОперацииКассовогоУзла);
//		
//		Результат = Истина;
//		
//		ЗафиксироватьТранзакцию();
//		
//	Исключение
//		
//		ОтменитьТранзакцию();
//		ТребуетсяПовторнаяПопыткаЗаписи = Истина;
//		
//		Результат = Ложь;
//		
//	КонецПопытки;
//	
//	Возврат Результат;
//	
КонецФункции

//// Записать операцию в журнал фискальных операций.
////
//// Параметры:
////  РеквизитыОперацииКассовогоУзла - Структура - см. функцию ПодключаемоеОборудованиеУТКлиент.СтруктураРеквизитыФискальнойОперацииКассовогоУзла().
////
Процедура ЗаписатьВЖурналФискальныхОперацийУпрощенно(РеквизитыОперацииКассовогоУзла) Экспорт
//	
//	ИдентификаторЗаписи = Новый УникальныйИдентификатор;
//	
//	НаборЗаписей = РегистрыСведений.УДАЛИТЬ_ЖурналФискальныхОпераций.СоздатьНаборЗаписей();
//	НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(ИдентификаторЗаписи, Истина);
//	НаборЗаписей.Отбор.ДокументОснование.Установить(РеквизитыОперацииКассовогоУзла.ДокументОснование, Истина);
//	
//	НоваяСтрока = НаборЗаписей.Добавить();
//	НоваяСтрока.ИдентификаторЗаписи = ИдентификаторЗаписи;
//	
//	НоваяСтрока.Дата = РеквизитыОперацииКассовогоУзла.Дата;
//	НоваяСтрока.ДокументОснование = РеквизитыОперацииКассовогоУзла.ДокументОснование;
//	НоваяСтрока.Организация = РеквизитыОперацииКассовогоУзла.Организация;
//	//НоваяСтрока.ТорговыйОбъект = РеквизитыОперацииКассовогоУзла.ТорговыйОбъект;
//	НоваяСтрока.Устройство = РеквизитыОперацииКассовогоУзла.Устройство;
//	
//	//НоваяСтрока.ТипОперации = РеквизитыОперацииКассовогоУзла.ТипОперации;
//	
//	//Если РеквизитыОперацииКассовогоУзла.ТипОперации = Перечисления.ТипыОперацииКассовогоУзла.ФискальнаяОперация Тогда
//		
//		НоваяСтрока.ФискальнаяОперацияТипРасчета = РеквизитыОперацииКассовогоУзла.ТипРасчета;
//		
//		НоваяСтрока.ФискальнаяОперацияВариантОтправкиЭлектронногоЧека = РеквизитыОперацииКассовогоУзла.ВариантОтправкиЭлектронногоЧека;
//		НоваяСтрока.ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека = РеквизитыОперацииКассовогоУзла.КонтактныеДанныеЭлектронногоЧека;
//		НоваяСтрока.ФискальнаяОперацияНомерЧекаККМ = РеквизитыОперацииКассовогоУзла.НомерЧекаККМ;
//		НоваяСтрока.ФискальнаяОперацияНомерСменыККМ = РеквизитыОперацииКассовогоУзла.НомерСмены;
//		
//		НоваяСтрока.ФискальнаяОперацияСумма = РеквизитыОперацииКассовогоУзла.Сумма;
//		НоваяСтрока.ФискальнаяОперацияСуммаОплатыНаличные = РеквизитыОперацииКассовогоУзла.СуммаОплатыНаличные;
//		НоваяСтрока.ФискальнаяОперацияСуммаОплатыПлатежнаяКарта = РеквизитыОперацииКассовогоУзла.СуммаОплатыПлатежнаяКарта;
//		НоваяСтрока.ФискальнаяОперацияСуммаКредит = РеквизитыОперацииКассовогоУзла.СуммаКредит;
//		НоваяСтрока.ФискальнаяОперацияСуммаПредоплаты = РеквизитыОперацииКассовогоУзла.СуммаПредоплаты;
//		
//		Если РеквизитыОперацииКассовогоУзла.Данные <> Неопределено Тогда
//			НоваяСтрока.Данные = Новый ХранилищеЗначения(РеквизитыОперацииКассовогоУзла.Данные);
//		КонецЕсли;
//		
//	//Иначе
//	//	
//	//	НоваяСтрока.ФискальнаяОперацияСумма = РеквизитыОперацииКассовогоУзла.Сумма;
//	//	
//	//КонецЕсли;
//	
//	НаборЗаписей.Записать();
//	
КонецПроцедуры

// Получить данные журнала фискальных операций.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ-основание.
// 
// Возвращаемое значение:
//  Структура - Структура по свойствами:
//   * ИдентификаторЗаписи - Строка - Идентификатор записи.
//   * НомерЧекаККМ - Число - Номер чека ККМ.
//   * Сумма - Число - Сумма.
//   * ДокументОснование - ДокументСсылка - Документ-основание.
//   * Данные - ХранилищеЗначений - Данные чека, переданные в ККТ (XML).
//
Функция ДанныеЖурналаФискальныхОпераций(ДокументСсылка) Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ДанныеФискальнойОперации(ДокументСсылка);
	
	//УстановитьПривилегированныйРежим(Истина);
	//
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ЖурналФискальныхОпераций.ФискальнаяОперацияНомерЧекаККМ           КАК НомерЧекаККМ,
	//|	ЖурналФискальныхОпераций.ФискальнаяОперацияНомерСменыККМ          КАК НомерСменыККМ,
	//|	ЖурналФискальныхОпераций.Устройство                               КАК Устройство,
	//|	ЕСТЬNULL(ЖурналФискальныхОпераций.Устройство.СерийныйНомер, """") КАК УстройствоСерийныйНомер,
	//|	ЖурналФискальныхОпераций.ФискальнаяОперацияСумма                  КАК Сумма,
	//|	ЖурналФискальныхОпераций.ДокументОснование                        КАК ДокументОснование,
	//|	ЖурналФискальныхОпераций.Данные                                   КАК Данные,
	//|	ЖурналФискальныхОпераций.ИдентификаторЗаписи                      КАК ИдентификаторЗаписи
	//|ИЗ
	//|	РегистрСведений.ЖурналФискальныхОпераций КАК ЖурналФискальныхОпераций
	//|ГДЕ
	//|	ЖурналФискальныхОпераций.ДокументОснование = &ДокументСсылка
	//|");
	//Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	
	//	ФискальнаяОперация = Новый Структура;
	//	ФискальнаяОперация.Вставить("ИдентификаторЗаписи");
	//	ФискальнаяОперация.Вставить("НомерЧекаККМ");
	//	ФискальнаяОперация.Вставить("НомерСменыККМ");
	//	ФискальнаяОперация.Вставить("Устройство");
	//	ФискальнаяОперация.Вставить("УстройствоСерийныйНомер");
	//	ФискальнаяОперация.Вставить("Сумма");
	//	ФискальнаяОперация.Вставить("ДокументОснование");
	//	ФискальнаяОперация.Вставить("Данные");
	//	
	//	ЗаполнитьЗначенияСвойств(ФискальнаяОперация, Выборка);
	//	
	//	Возврат ФискальнаяОперация;
	//	
	//КонецЕсли;
	//
	//Возврат Неопределено;
	
КонецФункции

// Получает параметры кассы ККМ. 
Функция ПараметрыКассыККМ(КассаККМ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.ПодключаемоеОборудование КАК ИдентификаторУстройства,
	|	ДанныеСправочника.Магазин КАК Магазин,
	|	ДанныеСправочника.Владелец КАК Организация,
	|	ДанныеСправочника.ИспользоватьБезПодключенияОборудования КАК ИспользоватьБезПодключенияОборудования
	//,
	//|	КассыККМ.НастройкаРаспределенияВыручкиПоСекциям,
	//|	КассыККМ.ЭлектронныйЧекSMSПередаютсяПрограммой1С,
	//|	КассыККМ.ЭлектронныйЧекEmailПередаютсяПрограммой1С
	|ИЗ
	|	Справочник.КассыККМ КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", КассаККМ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Новый Структура("ИдентификаторУстройства,
								|Магазин,
								|Организация,
								|ИспользоватьБезПодключенияОборудования",
		//						|РаспределениеВыручкиПоСекциям,
		//						|ЭлектронныйЧекSMSПередаютсяПрограммой1С,
		//						|ЭлектронныйЧекEmailПередаютсяПрограммой1С",
								Выборка.ИдентификаторУстройства,
								Выборка.Магазин,
								Выборка.Организация,
								Выборка.ИспользоватьБезПодключенияОборудования
		//						,
		//						ПодключаемоеОборудованиеРТВызовСервера.РаспределениеВыручкиПоСекциям(Выборка.НастройкаРаспределенияВыручкиПоСекциям),
		//						Выборка.ЭлектронныйЧекSMSПередаютсяПрограммой1С,
		//						Выборка.ЭлектронныйЧекEmailПередаютсяПрограммой1С
				);
		
	Иначе
		 
		Возврат Новый Структура("ИдентификаторУстройства,
								|Магазин,
								|Организация,
								|ИспользоватьБезПодключенияОборудования",
		//						,
		//						|РаспределениеВыручкиПоСекциям,
		//						|ЭлектронныйЧекSMSПередаютсяПрограммой1С,
		//						|ЭлектронныйЧекEmailПередаютсяПрограммой1С",
								Справочники.ПодключаемоеОборудование.ПустаяСсылка(),
								Справочники.Магазины.ПустаяСсылка(),
								Справочники.Организации.ПустаяСсылка(),
								Истина
		//						,
		//						ПодключаемоеОборудованиеРТВызовСервера.РаспределениеВыручкиПоСекциям(Неопределено),
		//						Ложь,
		//						Ложь
				);
		
	КонецЕсли;
	
КонецФункции // ПараметрыКассыККМ()

//++ №7951 проверяет права на объекты распределения, как минимум должно быть чтение
Функция ПроверитьДоступКДокументамРаспределения(Знач Объект) Экспорт
	
	ЕстьДоступ = Истина;
	
	Для Каждого ТекущаяСтрока Из Объект.РаспределениеПлатежа Цикл
		
		Если НЕ ПравоДоступа("Чтение", ТекущаяСтрока.Документ.Метаданные()) ИЛИ НЕ СтрНайти(Строка(ТекущаяСтрока.Документ), "<Объект не найден>") = 0 Тогда
			Сообщить("У текущего пользователям нет права на чтение документа в распределение платежа с номером строки " + ТекущаяСтрока.НомерСтроки);
			ЕстьДоступ = Ложь;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат ЕстьДоступ;
	
КонецФункции
//-- №7951

// Получает систему налогообложения из регистра ПрименениеСистемНалогообложения по указанным параметрам.
//
// Параметры:
//  Дата - Дата - жата, на которую необходимо определить систему налогообложения. Необязательный.
//  Организация - СправочникСсылка.Организации - организация, для которой необходимо определить систему налогообложения. Обязательный.
//  Магазин - СправочникСсылка.Магазины - магазин, для которого необходимо определить систему налогообложения. Необязательный.
//                                        Если заполнен склад, но не заполнен магазин - берется из склада.
//  Склад - СправочникСсылка.Склады - склад, для которого необходимо определить систему налогообложения. Необязательный.
//  ТоварнаяГруппа - СправочникСсылка.ТоварныеГруппы  - товарная группа номенклатуры, для которой необходимо определить систему налогообложения. Необязательный.
// 
// Возвращаемое значение:
//  Перечисления.ТипыСистемНалогообложенияККТ - система налогообложения по параметрам.
//
Функция ПолучитьСистемуНалогообложения(Организация, ПодразделениеМагазин = Неопределено) Экспорт
	
	//#14195 добавлено Подразделение
	Если ЗначениеЗаполнено(ПодразделениеМагазин) Тогда
		СистемаНалогообложения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПодразделениеМагазин, "СистемаНалогообложения");
		Если ЗначениеЗаполнено(СистемаНалогообложения) Тогда
			Возврат СистемаНалогообложения;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.ПустаяСсылка();
	КонецЕсли;
	
	СистемаНалогообложения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "СистемаНалогообложения");
	Если ЗначениеЗаполнено(СистемаНалогообложения) Тогда
		Возврат СистемаНалогообложения;
	КонецЕсли;
	
	Возврат Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	
КонецФункции

Функция ПолучитьПризнакПредметаРасчета(Номенклатура) Экспорт
													   
	ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	
	Если Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Услуга;

	КонецЕсли;
	
	Возврат ПризнакПредметаРасчета;
	
КонецФункции