&НаСервере
Функция УстановитьОтбор()
	Попытка
		ЭлементОтбора = ЗначенияАналитики.Отбор.Элементы[0];
	Исключение
		ЭлементОтбора = ЗначенияАналитики.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы[0];
	КонецПопытки;

    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтбор();
	НайтиТип();
	Элементы.ТабЗначенияАналитики.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТипАналитикиПриИзменении(Элемент)
	РазобратьТип();
КонецПроцедуры

&НаСервере
Процедура РазобратьТип()
	ТипАналитикиПолный = "";
	массивтипов = ТипАналитикиОТ.Типы();
	НТип = Неопределено;
	Искать = Истина;
	
	Если массивтипов.Количество() = 1 Тогда
		//
		Если массивтипов.Найти(Тип("Булево")) <> неопределено тогда
			НТип = Тип("Булево");
			Т = НТип;
			Искать = Ложь;
		КонецЕсли;	
		
		
		Если Искать Тогда
			Если массивтипов.Найти(Тип("Строка")) <> неопределено тогда
				НТип = Тип("Строка");
				Т = НТип;
				Искать = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		
		Если Искать Тогда
             Если массивтипов.Найти(Тип("Число")) <> неопределено тогда
				НТип = Тип("Число");
				Т = НТип;
				Искать = Ложь;
			КонецЕсли;
		КонецЕсли;

		
		Если Искать Тогда
            Если массивтипов.Найти(Тип("Дата")) <> неопределено тогда
				НТип = Тип("Дата");
				Т = НТип;
                Искать = Ложь;
			КонецЕсли;
		КонецЕсли;

		Если Искать Тогда
        Для каждого СтрСпр из Метаданные.Справочники Цикл
			т = "СправочникСсылка." + СтрСпр.Имя;
			Если массивтипов.Найти(Тип(т))<>Неопределено Тогда
				НТип = Тип(т);
				Искать = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		КонецЕсли;
	
		Если Искать Тогда
			Для каждого СтрСпр из Метаданные.Документы Цикл
				т = "ДокументСсылка." + СтрСпр.Имя;
				Если массивтипов.Найти(Тип(т))<>Неопределено Тогда
					НТип = Тип(т);
					Искать = Ложь;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
		Если Искать Тогда
			Для каждого СтрСпр из Метаданные.Задачи Цикл
				т = "ЗадачаСсылка." + СтрСпр.Имя;
				Если массивтипов.Найти(Тип(т))<>Неопределено Тогда
					НТип = Тип(т);
					Искать = Ложь;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
		Если Искать Тогда
			Для каждого СтрСпр из Метаданные.Перечисления Цикл
				т = "ПеречислениеСсылка." + СтрСпр.Имя;
				Если массивтипов.Найти(Тип(т))<>Неопределено Тогда
					НТип = Тип(т);
					Искать = Ложь;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
		Если НТип<>Неопределено Тогда
			Объект.ТипАналитикиПолный = т;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиТип()
    Если Объект.ТипАналитикиПолный<>"" Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип(Объект.ТипАналитикиПолный));
		Стр = Новый ОписаниеТипов(Массив);
		ТипАналитикиОТ = Стр;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ТипАналитикиОТ.Типы().Количество() = 0 Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ИА_ЗначениеАналитики"));
		ТипАналитикиОТ = Новый ОписаниеТипов(Массив);
		РазобратьТип();
	КонецЕсли;
	Если Объект.ТипАналитики <> Строка(ТипАналитикиОТ) Тогда
		Объект.ТипАналитики = Строка(ТипАналитикиОТ);
	Конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗначенияАналитикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо сначала записать аналитику!");
		Отказ=истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОтбор();
	Элементы.ТабЗначенияАналитики.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕстьВеб = КСУ_ВебПИ.ЕстьИнтеграцияВеб();	
	Элементы.ВебУИД.Видимость =  ЕстьВеб;
	
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
КонецПроцедуры
