#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	//#10806
	Поля.Добавить("ВидОперации");
 	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	СтандартнаяОбработка = Ложь;
 
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	//#10806
	СтандартнаяОбработка = Ложь;
	
	СоответствиеПредставлений = Новый Соответствие;
	СоответствиеПредставлений.Вставить(Справочники.ВидыМонтажа.ПустаяСсылка(), "Монтаж");
	СоответствиеПредставлений.Вставить(Справочники.ВидыМонтажа.Монтаж, "Реализация клиенту (монтаж)");
	СоответствиеПредставлений.Вставить(Справочники.ВидыМонтажа.Продажа, "Реализация клиенту (продажа)");
	СоответствиеПредставлений.Вставить(Справочники.ВидыМонтажа.Рекламация, "Реализация клиенту (рекламация)");
	СоответствиеПредставлений.Вставить(Справочники.ВидыМонтажа.СервиснаяЗаявка, "Реализация клиенту (сервисная заявка)");

    Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
        НСтр("ru = '%1 №%2 от %3'"),
        СоответствиеПредставлений.Получить(Данные.ВидОперации),
        Данные.Номер,
        Данные.Дата // №12802 дату выводим с временем, было: Формат(Данные.Дата, "ДЛФ=D")
	);
		
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Акт выполненных работ
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Монтаж";
    КомандаПечати.Идентификатор = "АктВыполненныхРабот";
    КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыМонтажаБезСкидок") Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.Монтаж";
		КомандаПечати.Идентификатор = "АктВыполненныхРабот_ПересчетЦены";
		КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ (пересчет цены по скидке)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	КонецЕсли;
	
	//Акт выполненных работ с бланком оплаты //#14460
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Монтаж";
    КомандаПечати.Идентификатор = "АктВыполненныхРаботСБланкомОплаты";
    КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ с бланком оплаты'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//Выработка исполнителей талон // #14160
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.Монтаж";
	КомандаПечати.Идентификатор = "ВыработкаИсполнителей";
	КомандаПечати.Представление = НСтр("ru = 'Выработка исполнителей монтажа'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//Гарантийный талон // №6296 перенесен из ЗД
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.Монтаж";
	КомандаПечати.Идентификатор = "ГарантийныйТалон";
	КомандаПечати.Представление = НСтр("ru = 'Гарантийный талон'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//Комплект для монтажников
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Монтаж";
    КомандаПечати.Идентификатор = "КомплектДляМонтажников";
    КомандаПечати.Представление = НСтр("ru = 'Комплект для монтажников'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыМонтажаБезСкидок") Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.Монтаж";
		КомандаПечати.Идентификатор = "КомплектДляМонтажников_ПересчетЦены";
		КомандаПечати.Представление = НСтр("ru = 'Комплект для монтажников (пересчет цены по скидке)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	КонецЕсли;
	
	//#14602  //#15514 убрано условие проверки настройки
	//Если ПолучитьФункциональнуюОпцию("ЗаполнениеМатериаловРозницы") = 1 Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.Монтаж";
		КомандаПечати.Идентификатор = "Материалы";
		КомандаПечати.Представление = НСтр("ru = 'Материалы'"); 
		КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Материалы'");	
	//КонецЕсли;

	//Счет-фактура	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Монтаж";
    КомандаПечати.Идентификатор = "СчетФактура";
    КомандаПечати.Представление = НСтр("ru = 'Счет-фактура'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Монтаж";
    КомандаПечати.Идентификатор = "ТоварнаяНакладнаяСУслугами";
    КомандаПечати.Представление = НСтр("ru = 'Товарная накладная с услугами'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Монтаж";
    КомандаПечати.Идентификатор = "ТоварнаяНакладная";
    КомандаПечати.Представление = НСтр("ru = 'Товарная накладная'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Монтаж";
    КомандаПечати.Идентификатор = "ТОРГ12";
    КомандаПечати.Представление = НСтр("ru = 'ТОРГ-12'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Монтаж";
    КомандаПечати.Идентификатор = "УПД";
    КомандаПечати.Представление = НСтр("ru = 'Универсальный передаточный документ'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктВыполненныхРабот") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктВыполненныхРабот", НСтр("ru = 'Акт выполненных работ'"), 
				ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати));				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктВыполненныхРабот_ПересчетЦены") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктВыполненныхРабот_ПересчетЦены", НСтр("ru = 'Акт выполненных работ (пересчет цены по скидке)'"), 
				ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати, Истина));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктВыполненныхРаботСБланкомОплаты") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктВыполненныхРаботСБланкомОплаты", НСтр("ru = 'Акт выполненных работ с бланком оплаты'"), 
				ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати, Ложь, Истина));							
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КомплектДляМонтажников") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КомплектДляМонтажников", НСтр("ru = 'Комплект для монтажников'"),
        		ПечатьКомплектДляМонтажников(МассивОбъектов, ОбъектыПечати));				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КомплектДляМонтажников_ПересчетЦены") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КомплектДляМонтажников_ПересчетЦены", НСтр("ru = 'Комплект для монтажников (пересчет цены по скидке)'"),
        		ПечатьКомплектДляМонтажников(МассивОбъектов, ОбъектыПечати, Истина));
				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура", НСтр("ru = 'Счет-фактура'"), 
				ПечатьСчетФактуры(МассивОбъектов, ОбъектыПечати));	
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УПД") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "УПД", НСтр("ru = 'Универсальный передаточный документ'"), 
				ПечатьУПД(МассивОбъектов, ОбъектыПечати));
				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ12") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТОРГ12", НСтр("ru = 'ТОРГ-12'"), 
				ПечатьТОРГ12(МассивОбъектов, ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварнаяНакладная") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТоварнаяНакладная", НСтр("ru = 'Товарная накладная'"),
				ПечатьТоварнойНакладной(МассивОбъектов, ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварнаяНакладнаяСУслугами") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТоварнаяНакладнаяСУслугами", НСтр("ru = 'Товарная накладная с услугами'"), 
				ПечатьТоварнойНакладной(МассивОбъектов, ОбъектыПечати, Истина));
				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ГарантийныйТалон") Тогда // №6296 перенесен из ЗД
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "ГарантийныйТалон",
        НСтр("ru = 'Гарантийный талон'"),
        ПечатьГарантийныйТалон(МассивОбъектов, ОбъектыПечати),
        ,
        "Документ.Монтаж.ПФ_MXL_ГарантийныйТалон");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВыработкаИсполнителей") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ВыработкаИсполнителей", НСтр("ru = 'Выработка исполнителей'"), 
				ПечатьВыработкиИсполнителей(МассивОбъектов, ОбъектыПечати));
				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Материалы") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Материалы", НСтр("ru = 'Материалы'"),
        	ОбщийМодульСервер.ПечатьРозницаМатериалы(МассивОбъектов, ОбъектыПечати, "Документ.Монтаж.ПФ_MXL_Материалы"));
			
    КонецЕсли;
	
КонецПроцедуры

// делаем экспортную для возможности использования во внешних печатных формах
Функция ПолучитьТекстЗапросаДляПечати() Экспорт
	
	Возврат 
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	Монтаж.Ссылка КАК Ссылка,
	 |	Монтаж.Номер КАК Номер,
	 |	Монтаж.Дата КАК ДатаДокумента,
	 |	""текстовая строка"" КАК Дата,
	 |	Монтаж.Дата КАК Дата1,
	 |	Монтаж.Проведен КАК Проведен,
	 |	Монтаж.Организация.ПолноеНаименование КАК Организация,
	 |	Монтаж.Организация.ЯвляетсяПлательщикомНДС КАК ЯвляетсяПлательщикомНДС,
	 |	Монтаж.Бригада КАК Бригада,
	 |	Монтаж.Бригадир КАК Бригадир,
	 |	Монтаж.Контрагент КАК Контрагент,
	 |	ВЫБОР
	 |		КОГДА НЕ Монтаж.Контрагент.НаименованиеПолное = """"
	 |			ТОГДА Монтаж.Контрагент.НаименованиеПолное
	 |		ИНАЧЕ Монтаж.Контрагент.Наименование
	 |	КОНЕЦ КАК ПредставлениеКонтрагента,
	 |	Монтаж.Адрес КАК Адрес,
	 |	Монтаж.ДатаМонтажа КАК ДатаМонтажаДокумента,
	 |	""текстовая строка"" КАК ДатаМонтажа,
	 |	0 КАК СуммаОплачено,
	 |	0 КАК СуммаПредоплаты,
	 |	0 КАК СуммаКОплате,
	 |	0 КАК СуммаКОплатеОстаток,
	 |	0 КАК СуммаОплаченоПоЗаказу,
	 |	0 КАК СуммаПредоплатыПоЗаказу,
	 |	0 КАК СуммаКОплатеПоЗаказу,
	 |	0 КАК СуммаКОплатеОстатокПоЗаказу,
	 |	0 КАК СуммаИтогСкидка,
	 |	0 КАК СуммаДокументаБезСкидки,
	 |	0 КАК ПлощадьЗаказа,
	 |	Монтаж.ВремяНачала КАК ВремяНачала,
	 |	Монтаж.ВремяОкончания КАК ВремяОкончания,
	 |	Монтаж.СрокМонтажа КАК СрокМонтажа,
	 |	""01.01.0001"" КАК ДатаМонтажаФормат,
	 |	""00:00:00"" КАК ВремяНачалаФормат,
	 |	""00:00:00"" КАК ВремяОкончанияФормат,
	 |	ЕСТЬNULL(Монтаж.СуммаДокумента, 0) КАК СуммаДокумента,
	 |	Монтаж.Результат КАК Результат,
	 |	Монтаж.ДоговорКонтрагента КАК ДоговорКонтрагента,
	 |	Монтаж.Склад КАК Склад,
	 |	Монтаж.Основание КАК Основание,
	 |	Монтаж.СкладТоваров КАК СкладТоваров,
	 |	Монтаж.ВидЦен КАК ВидЦен,
	 |	Монтаж.Валюта КАК Валюта,
	 |	Монтаж.КомментарийКМонтажу КАК КомментарийКМонтажу,
	 |	Монтаж.Результат КАК Результат1,
	 |	Монтаж.Исполнители.(
	 |		Ссылка КАК Ссылка,
	 |		НомерСтроки КАК НомерСтроки,
	 |		Сотрудник КАК Сотрудник,
	 |		Коэффициент КАК Коэффициент
	 |	) КАК Исполнители,
	 |	Монтаж.Материалы.(
	 |		Ссылка КАК Ссылка,
	 |		НомерСтроки КАК НомерСтроки,
	 |		Номенклатура.Артикул КАК Артикул,
	 |		Номенклатура КАК Номенклатура,
	 |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	 |		СерияНоменклатуры КАК СерияНоменклатуры,
	 |		Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	 |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	 |		Коэффициент КАК Коэффициент,
	 |		Количество КАК Количество,
	 |		Цена КАК Цена,
	 |		Сумма КАК Сумма,
	 |		Комната КАК Комната
	 |	) КАК Материалы,
	 |	Монтаж.ТоварыУслуги.(
	 |		Ссылка КАК Ссылка,
	 |		НомерСтроки КАК НомерСтроки,
	 |		Номенклатура.Артикул КАК Артикул,
	 |		Номенклатура КАК Номенклатура,
	 |		Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	 |		Количество КАК Количество,
	 |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	 |		Коэффициент КАК Коэффициент,
	 |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	 |		СерияНоменклатуры КАК СерияНоменклатуры,
	 |		Цена КАК Цена,
	 |		Сумма КАК Сумма,
	 |		СтавкаНДС КАК СтавкаНДС,
	 |		СуммаНДС КАК СуммаНДС,
	 |		ПроцентСкидки КАК ПроцентСкидки,
	 |		СуммаСкидки КАК СуммаСкидки,
	 |		Комната КАК Комната
	 |	) КАК ТоварыУслуги,
	 |	Монтаж.Основание.Ссылка КАК ОснованиеСсылка,
	 |	Монтаж.Основание.Номер КАК ОснованиеНомер,
	 |	Монтаж.Основание.Дата КАК ОснованиеДатаВремя,
	 |	""01.01.0001"" КАК ОснованиеДата,
	 |	Монтаж.Основание.НомерДоговора КАК НомерДоговора,
	 |	ЕСТЬNULL(Монтаж.Основание.СуммаДокумента, 0) КАК ОснованиеСуммаДокумента,
	 |	Монтаж.Основание.Валюта КАК ОснованиеВалюта,
	 |	Монтаж.Основание.Адрес КАК ОснованиеАдрес,
	 |	Монтаж.Основание.ИсполнительЗамера КАК ОснованиеИсполнительЗамера,
	 |	Монтаж.Основание.Менеджер КАК МенеджерДоговора,
	 |	Монтаж.Основание.Менеджер КАК ОснованиеМенеджер,
	 |	ДокументыУдостоверяющиеЛичность.Вид КАК ПаспортВид,
	 |	ДокументыУдостоверяющиеЛичность.Серия КАК ПаспортСерия,
	 |	ДокументыУдостоверяющиеЛичность.Номер КАК ПаспортНомер,
	 |	ДокументыУдостоверяющиеЛичность.КемВыдан КАК ПаспортКемВыдан,
	 |	ДокументыУдостоверяющиеЛичность.ДатаВыдачи КАК ПаспортДатаВыдачи,
	 |	РасчетыПоЗаказамОстатки.СуммаОстаток КАК ДолгПоДоговору,
	 |	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК ОбщийДолг,
	 |	ВалютаУчета.Значение.Ссылка КАК ВалютаУчета
	 |ИЗ
	 |	Документ.Монтаж КАК Монтаж
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыУдостоверяющиеЛичность КАК ДокументыУдостоверяющиеЛичность
	 |		ПО Монтаж.Контрагент.ДокументУдостоверяющийЛичность = ДокументыУдостоверяющиеЛичность.Ссылка
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	 |		ПО Монтаж.Основание = РасчетыПоЗаказамОстатки.Заказ
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
	 |		ПО Монтаж.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
	 |			И Монтаж.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация,
	 |	Константа.ВалютаУчета КАК ВалютаУчета
	 |ГДЕ
	 |	Монтаж.Ссылка В(&МассивОбъектов)";
	
КонецФункции

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	//++ 16289 все сведено в реквизит "ДатаПодписанияДокументов" 
	//++ №12802 #13771 пояснение: с точки зрения клиента: если печатаете документ не в статусе Выполнен, то заполняйте дату руками
	//|	ДанныеДокумента.Дата КАК Дата,
	//|	ДанныеДокумента.ДатаВыполнения КАК Дата,
	//|	ДанныеДокумента.ДатаПодписанияДокументов КАК Дата,
	//-- №12802
	//-- 16289
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Адрес КАК Адрес,
	|	ДанныеДокумента.ДатаМонтажа КАК ДатаМонтажаДокумента,
	|	ДанныеДокумента.ДатаМонтажа КАК ДатаМонтажа,
	|	ДанныеДокумента.СрокМонтажа КАК СрокМонтажа,
	|	ДанныеДокумента.ДатаПодписанияДокументов КАК ДатаПодписанияДокументов,
	|	ДанныеДокумента.ВремяНачала КАК ВремяНачала,
	|	ДанныеДокумента.ВремяОкончания КАК ВремяОкончания,
	|	ДанныеДокумента.КомментарийКМонтажу КАК КомментарийКМонтажу,
	|	ДанныеДокумента.Бригада КАК Бригада,
	|	ДанныеДокумента.Бригадир КАК Бригадир,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.ВидЦен КАК ВидЦен,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.Результат КАК Результат,
	|	ДанныеДокумента.Склад КАК Склад,
	|	ДанныеДокумента.СкладТоваров КАК СкладТоваров,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.СуммаДокумента КАК Сумма,
	|	ДанныеДокумента.СуммаКПолучениюНаМонтаже КАК СуммаКПолучениюНаМонтаже,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.БИК КАК БанковскийСчетБИК,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
	|	ДанныеДокумента.Организация.ИНН КАК ИНН,
	|	ДанныеДокумента.Организация.КПП КАК КПП,
	|	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
	|	ДанныеДокумента.Организация.ЯвляетсяПлательщикомНДС КАК ЯвляетсяПлательщикомНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК КонтрагентНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.НомерСчета КАК КонтрагентБанковскийСчетНомерСчета,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.БИК КАК КонтрагентБанковскийСчетБИК,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.КоррСчет КАК КонтрагентБанковскийСчетКоррСчет,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.НаименованиеБанка КАК КонтрагентБанковскийСчетНаименованиеБанка,
 	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.Руководитель.Должность
    |		ИНАЧЕ ДанныеДокумента.Руководитель.Должность
    |	КОНЕЦ КАК ДолжностьРуководителя,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.Руководитель.РасшифровкаПодписи
    //++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Руководитель)
	|		ИНАЧЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОРуководителя,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.ГлавныйБухгалтер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.ГлавныйБухгалтер.РасшифровкаПодписи
	//++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.ГлавныйБухгалтер)
	|		ИНАЧЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОГлавБухгалтера,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Автор.Сотрудник.Должность
    |		ИНАЧЕ ДанныеДокумента.Отпустил.Должность
    |	КОНЕЦ КАК ДолжностьКладовщика,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Автор.Сотрудник.РасшифровкаПодписи
   //++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Отпустил)
	|		ИНАЧЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОКладовщика,
	|	0 КАК ИтогоСуммаНДС,
	|	0 КАК ИтогоСуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.Лид
	|			ТОГДА ""Лид""
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказДоговор
	|			ТОГДА ""Заказ-договор""
	|	КОНЕЦ КАК ВидОснования,
	|	ДанныеДокумента.Основание КАК ОснованиеСсылка,
	|	ДанныеДокумента.Основание.Номер КАК ОснованиеНомер,
	|	ДанныеДокумента.Основание.Дата КАК ОснованиеДата,
	|	ДанныеДокумента.Основание.НомерДоговора КАК НомерДоговора,
	|	ЕСТЬNULL(ДанныеДокумента.Основание.СуммаДокумента, 0) КАК ОснованиеСуммаДокумента,
	|	ДанныеДокумента.Основание.Валюта КАК ОснованиеВалюта,
	|	ДанныеДокумента.Основание.Адрес КАК ОснованиеАдрес,
	|	ДанныеДокумента.Основание.ИсполнительЗамера КАК ОснованиеИсполнительЗамера,
	//|	ДанныеДокумента.Основание.ИсполнительЗамера.КонтактныйТелефон КАК ЗамерщикКонтактныйТелефон,
	//|	ДанныеДокумента.Основание.ИсполнительЗамера.ЛичныйТелефон КАК ЗамерщикЛичныйТелефон,
	|	ДанныеДокумента.Основание.Менеджер КАК МенеджерДоговора,
	|	ДанныеДокумента.Основание.Менеджер КАК ОснованиеМенеджер,
	|	ДокументыУдостоверяющиеЛичность.Вид КАК ПаспортВид,
	|	ДокументыУдостоверяющиеЛичность.Серия КАК ПаспортСерия,
	|	ДокументыУдостоверяющиеЛичность.Номер КАК ПаспортНомер,
	|	ДокументыУдостоверяющиеЛичность.КемВыдан КАК ПаспортКемВыдан,
	|	ДокументыУдостоверяющиеЛичность.ДатаВыдачи КАК ПаспортДатаВыдачи,
	|	ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК ДолгПоДоговору,
	|	ЕСТЬNULL(РасчетыПоМонтажамОстатки.СуммаОстаток, 0) КАК ДолгПоМонтажу,
	|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК ОбщийДолг
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыУдостоверяющиеЛичность КАК ДокументыУдостоверяющиеЛичность
	|		ПО ДанныеДокумента.Контрагент.ДокументУдостоверяющийЛичность = ДокументыУдостоверяющиеЛичность.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|		ПО ДанныеДокумента.Основание = РасчетыПоЗаказамОстатки.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоМонтажамОстатки
	|		ПО (ДанныеДокумента.Ссылка = РасчетыПоЗаказамОстатки.Заказ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ПО ДанныеДокумента.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
	|			И ДанныеДокумента.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
	|	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
	|	ДанныеТабличнойЧасти.Комната КАК Комната,
	|	ВЫБОР
	|		КОГДА &КолонкаАртикул
	|			ТОГДА ДанныеТабличнойЧасти.Номенклатура.Артикул
	|		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Код
	|	КОНЕЦ КАК Код,
	|	ДанныеТабличнойЧасти.Номенклатура.Артикул КАК Артикул,
	|	ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
	|	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеТабличнойЧасти.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
	|	ДанныеТабличнойЧасти.Количество КАК Количество,
	|	ДанныеТабличнойЧасти.Цена КАК Цена,
	|	ДанныеТабличнойЧасти.СуммаСкидки КАК СуммаСкидки,
	|	ДанныеТабличнойЧасти.Сумма КАК Сумма,
	|	ДанныеТабличнойЧасти.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеТабличнойЧасти.СуммаНДС КАК СуммаНДС,
	|	ДанныеТабличнойЧасти.ПроцентСкидки КАК ПроцентСкидки,
	|	ДанныеТабличнойЧасти.Сумма + ДанныеТабличнойЧасти.СуммаСкидки КАК СуммаБезСкидки,
	|	ДанныеТабличнойЧасти.СуммаСкидки КАК Скидка,
	|	ДанныеТабличнойЧасти.Сумма - ДанныеТабличнойЧасти.СуммаНДС КАК СуммаБезНДС,
	|	ДанныеТабличнойЧасти.Сумма КАК СуммаСНДС,
	|	ДанныеТабличнойЧасти.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод
	|ИЗ
	|	Документ.Монтаж.ТоварыУслуги КАК ДанныеТабличнойЧасти
	|ГДЕ
	|	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеТабличнойЧасти.Ссылка,
	|	ДанныеТабличнойЧасти.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
	|	ДанныеТабличнойЧасти.Номенклатура.Артикул КАК Артикул,
    |	ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
    |	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ДанныеТабличнойЧасти.Комната КАК Комната,
    |	ДанныеТабличнойЧасти.УИСтроки КАК УИСтроки,
    |	ДанныеТабличнойЧасти.НоменклатураТоваров КАК НоменклатураТоваров
    |ИЗ
    |	Документ.Монтаж.Материалы КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка
    |";
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[1];
	РезультатПоТабличнойЧастиМатериалы = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти, РезультатПоТабличнойЧастиМатериалы",
	                                               РезультатПоШапке, РезультатПоТабличнойЧасти, РезультатПоТабличнойЧастиМатериалы);
	
	Возврат СтруктураДанныхДляПечати;
    
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам=Неопределено) Экспорт
	
	КЧ = Новый КвалификаторыЧисла(15, 2);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов(Массив, , ,КЧ);

	РезультатЗапроса.Колонки.Добавить("ДатаФормат");
	РезультатЗапроса.Колонки.Добавить("ДатаДокументаФормат");
	
	РезультатЗапроса.Колонки.Добавить("ДатаВыполнения", Новый ОписаниеТипов("Дата"));
	РезультатЗапроса.Колонки.Добавить("ПредставлениеРеквизитов");
	РезультатЗапроса.Колонки.Добавить("ПредставлениеЮридическогоАдреса");
	РезультатЗапроса.Колонки.Добавить("ПаспортПредставление");	
	РезультатЗапроса.Колонки.Добавить("ДатаМонтажаФормат");
	РезультатЗапроса.Колонки.Добавить("ВремяНачалаФормат");
	РезультатЗапроса.Колонки.Добавить("ВремяОкончанияФормат");
	РезультатЗапроса.Колонки.Добавить("ОснованиеДатаФормат");
	РезультатЗапроса.Колонки.Добавить("СуммаНДС", ОписаниеТиповЧисло15_2);
	РезультатЗапроса.Колонки.Добавить("СуммаИтогСкидка", ОписаниеТиповЧисло15_2);
	РезультатЗапроса.Колонки.Добавить("СуммаДокументаБезСкидки");
	РезультатЗапроса.Колонки.Добавить("СуммаОплаченоПоЗаказу");
	РезультатЗапроса.Колонки.Добавить("СуммаПредоплатыПоЗаказу");
	РезультатЗапроса.Колонки.Добавить("СуммаКОплатеОстатокПоЗаказу");	
	РезультатЗапроса.Колонки.Добавить("СуммаКОплатеПоЗаказу");
	РезультатЗапроса.Колонки.Добавить("СуммаОплачено"); 
	РезультатЗапроса.Колонки.Добавить("СуммаПредоплаты"); 			
	РезультатЗапроса.Колонки.Добавить("СуммаКОплатеОстаток"); 
	РезультатЗапроса.Колонки.Добавить("СуммаКОплате");
	РезультатЗапроса.Колонки.Добавить("ПлощадьЗаказа");
	
	РезультатЗапроса.Колонки.Добавить("ИтогоСумма");
	//зультатЗапроса.Колонки.Добавить("ИтогоСуммаНДС"); - есть в запросе
	РезультатЗапроса.Колонки.Добавить("ИтогоСуммаСкидки");
	РезультатЗапроса.Колонки.Добавить("ИтогоСуммаБезСкидки");
	РезультатЗапроса.Колонки.Добавить("ИтоговаяСтрока");
	РезультатЗапроса.Колонки.Добавить("СуммаДокументаПрописью");
	
	РезультатЗапроса.Колонки.Добавить("ЗамерщикКонтактныйТелефон");
	РезультатЗапроса.Колонки.Добавить("ЗамерщикЛичныйТелефон");	 

	РезультатЗапроса.Колонки.Добавить("ДатаПечати");
	РезультатЗапроса.Колонки.Добавить("ВремяФормированияПФ");
	РезультатЗапроса.Колонки.Добавить("ДатаПодписанияДокумента");
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);

	//ДатаПоследнегоПлатежаПоРассрочке = Неопределено;
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		//Если ТекущаяСтрока.Результат = Справочники.РезультатыМонтажа.Закрыт ИЛИ ТекущаяСтрока.Результат = Справочники.РезультатыМонтажа.Выполнен Тогда
		//	ТекущаяСтрока.ДатаФормат = Формат(ТекущаяСтрока.ДатаДокумента,"ДЛФ=Д");
		//Иначе
		//	ТекущаяСтрока.ДатаФормат = "";
		//КонецЕсли;
		
		//++16953
		Если ТипЗнч(ТекущаяСтрока.Ссылка) = Тип("ДокументСсылка.Монтаж") Тогда
				ТекущаяСтрока.ДатаПодписанияДокумента = ОбщийМодульСервер.ПолучитьДатуПодписанияДокументаМонтажа(ТекущаяСтрока.Ссылка);
			Иначе
				ТекущаяСтрока.ДатаПодписанияДокумента = ТекущаяСтрока.ДатаДокумента;
		КонецЕсли;
		
		//ТекущаяСтрока.ДатаФормат = Формат(ТекущаяСтрока.Дата, "ДЛФ=D; ДП='""___"" ______________ 20____ г.'");
		ТекущаяСтрока.ДатаФормат = Формат(ТекущаяСтрока.ДатаПодписанияДокумента, "ДЛФ=D; ДП='""___"" ______________ 20____ г.'");
		//++16953
		ТекущаяСтрока.ДатаДокументаФормат = Формат(ТекущаяСтрока.ДатаПодписанияДокумента, "ДЛФ=D");
		
		ТекущаяСтрока.ДатаМонтажаФормат = Формат(ТекущаяСтрока.ДатаМонтажаДокумента,"ДЛФ=D");
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
		Попытка
			ТекущаяСтрока.ОснованиеНомер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.ОснованиеНомер);
			ТекущаяСтрока.ОснованиеДатаФормат = Формат(ТекущаяСтрока.ОснованиеДатаВремя, "ДЛФ=D");
		Исключение
		КонецПопытки;
		
		//Если ТекущаяСтрока.Результат = Справочники.РезультатыМонтажа.Выполнен ИЛИ ТекущаяСтрока.Результат = Справочники.РезультатыМонтажа.Закрыт Тогда
		//	ТекущаяСтрока.ДатаВыполнения = ТекущаяСтрока.Дата;
		//КонецЕсли;
		
		Попытка	
		    ТекущаяСтрока.ДатаМонтажаФормат = Формат(ТекущаяСтрока.ДатаМонтажа, "ДЛФ=D");
			ТекущаяСтрока.ВремяНачалаФормат = Формат(ТекущаяСтрока.ВремяНачала, "ДЛФ=T");
			ТекущаяСтрока.ВремяОкончанияФормат = Формат(ТекущаяСтрока.ВремяОкончания, "ДЛФ=T");
		Исключение
		КонецПопытки;
		
		Если ТекущаяСтрока.Контрагент.ВидКонтрагента = Перечисления.ВидКонтрагента.ФизЛицо Тогда
			ТекущаяСтрока.ПаспортПредставление = "Документ: " + ТекущаяСтрока.ПаспортВид + " серия: " + ТекущаяСтрока.ПаспортСерия
				+ " номер: " + ТекущаяСтрока.ПаспортНомер + ", выдан: " + ТекущаяСтрока.ПаспортКемВыдан + " " + Формат(ТекущаяСтрока.ПаспортДатаВыдачи,"ДЛФ=Д");
		КонецЕсли;
		
		СведенияОКонтрагенте = ОбщийМодульСервер.СведенияОКонтрагенте(ТекущаяСтрока.Контрагент);
		
		ТекущаяСтрока.ПредставлениеЮридическогоАдреса = ОбщийМодульСервер.ПредставлениеЮридическогоАдреса(СведенияОКонтрагенте.ЮридическийАдрес, (ТекущаяСтрока.Контрагент.ВидКонтрагента = Перечисления.ВидКонтрагента.ЮрЛицо));	
	
		Если ТекущаяСтрока.Контрагент.ВидКонтрагента = Перечисления.ВидКонтрагента.ЮрЛицо Тогда
			Сведения = "ИНН, КПП, НомерСчета, Банк, БИК, КоррСчет, ТекстКорреспондента";
			ТекущаяСтрока.ПредставлениеРеквизитов = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте, Сведения); 
		Иначе
			Сведения = "ИНН";
			ПредставлениеРеквизитов = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте, Сведения);
			Если НЕ ПустаяСтрока(ТекущаяСтрока.ПаспортПредставление) Тогда		
				ПредставлениеРеквизитов = ПредставлениеРеквизитов + ?(ПустаяСтрока(ПредставлениеРеквизитов), "", ", ") + ТекущаяСтрока.ПаспортПредставление;
			КонецЕсли;
			ТекущаяСтрока.ПредставлениеРеквизитов = ПредставлениеРеквизитов;
		КонецЕсли;
		
		ТекущаяСтрока.СуммаНДС = ТекущаяСтрока.Ссылка.ТоварыУслуги.Итог("СуммаНДС");
		ТекущаяСтрока.ИтогоСуммаНДС = ТекущаяСтрока.Ссылка.ТоварыУслуги.Итог("СуммаНДС");
		ТекущаяСтрока.ИтогоСумма = ТекущаяСтрока.Ссылка.ТоварыУслуги.Итог("Сумма");
		
		ТекущаяСтрока.СуммаИтогСкидка = ТекущаяСтрока.Ссылка.ТоварыУслуги.Итог("СуммаСкидки");
		ТекущаяСтрока.ИтогоСуммаСкидки = ТекущаяСтрока.СуммаИтогСкидка;
		ТекущаяСтрока.СуммаДокументаБезСкидки = ТекущаяСтрока.СуммаДокумента + ТекущаяСтрока.СуммаИтогСкидка;
		
		ТекущаяСтрока.ИтогоСуммаБезСкидки = ТекущаяСтрока.ИтогоСумма + ТекущаяСтрока.ИтогоСуммаСкидки;
		
		ТекущаяСтрока.СуммаДокументаПрописью = РаботаСВалютой.СформироватьЧислоПрописью(ТекущаяСтрока.СуммаДокумента, ТекущаяСтрока.Валюта, Ложь);
		
		Попытка
			ПлощадьЗаказа = 0;
			Для Каждого ПодСтрока Из ТекущаяСтрока.Ссылка.ТоварыУслуги Цикл
				Если ПодСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок Тогда
					ПлощадьЗаказа = ПлощадьЗаказа + ПодСтрока.Количество;
				КонецЕсли;
			КонецЦикла;
			ТекущаяСтрока.ПлощадьЗаказа = ПлощадьЗаказа;
		Исключение
		КонецПопытки;
		
		ТекущаяСтрока.СуммаОплаченоПоЗаказу = ПолучитьСуммуОплат(ТекущаяСтрока.Основание); 	
		ТекущаяСтрока.СуммаПредоплатыПоЗаказу = ПолучитьСуммуОплат(ТекущаяСтрока.Основание, ТекущаяСтрока.ДатаВыполнения);
		
		ТекущаяСтрока.СуммаКОплатеОстатокПоЗаказу = ТекущаяСтрока.ОснованиеСуммаДокумента - ТекущаяСтрока.СуммаОплаченоПоЗаказу;
		ТекущаяСтрока.СуммаКОплатеПоЗаказу = ТекущаяСтрока.ОснованиеСуммаДокумента - ТекущаяСтрока.СуммаПредоплатыПоЗаказу;
		
		Попытка
			ТекущаяСтрока.СуммаОплачено = ПолучитьСуммуОплат(ТекущаяСтрока.Ссылка);
			ТекущаяСтрока.СуммаПредоплаты = ПолучитьСуммуОплат(ТекущаяСтрока.Ссылка, ТекущаяСтрока.ДатаВыполнения);	
			
			ТекущаяСтрока.СуммаКОплатеОстаток = ТекущаяСтрока.СуммаДокумента - ТекущаяСтрока.СуммаОплачено;
			ТекущаяСтрока.СуммаКОплате = ТекущаяСтрока.СуммаДокумента - ТекущаяСтрока.СуммаПредоплаты;
		Исключение
		КонецПопытки;
		
		ТекущаяСтрока.ИтоговаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Всего наименований %1, на сумму %2 %3'"),
			ТекущаяСтрока.Ссылка.ТоварыУслуги.Количество(),
			Формат(ТекущаяСтрока.СуммаДокумента, "ЧДЦ=2"),
			ТекущаяСтрока.Валюта);
			
		ТекущаяСтрока.ДатаПечати = Формат(ТекущаяДатаСеанса(), "ДЛФ=Д");
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ОснованиеИсполнительЗамера) Тогда		
			ТекущаяСтрока.ЗамерщикКонтактныйТелефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущаяСтрока.ОснованиеИсполнительЗамера, Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника);
			ТекущаяСтрока.ЗамерщикЛичныйТелефон     = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущаяСтрока.ОснованиеИсполнительЗамера, Справочники.ВидыКонтактнойИнформации.ЛичныйТелефонСотрудника);
		КонецЕсли;
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);
		
		ТекущаяСтрока.ДатаПечати = Формат(ТекущаяДатаСеанса(), "ДЛФ=Д");
		ТекущаяСтрока.ВремяФормированияПФ = ТекущаяДатаСеанса();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати, ПересчетЦеныПоСкидке = Ложь, СБланкомОПлаты = Ложь)
	
	Возврат ОбщийМодульСервер.ПечатьРозницаАктВыполненныхРабот(МассивОбъектов, ОбъектыПечати, ПересчетЦеныПоСкидке, СБланкомОПлаты);
	
	//// Создаем табличный документ и устанавливаем имя параметров печати.
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_АктВыполненныхРабот";
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_АктВыполненныхРабот");
	//ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	//
	//// Получаем запросом необходимые данные
	//Запрос = Новый Запрос();
	//Запрос.Текст = ПолучитьТекстЗапросаДляПечати();   
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	//
	////подготовим итоговую таблицу с данными
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса);
	//    
	//ПервыйДокумент = Истина;
	//Для Каждого Шапка Из РезультатЗапроса Цикл
	//    Если Не ПервыйДокумент Тогда
	//        // Все документы нужно выводить на разных страницах.
	//        ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//    КонецЕсли;
	//    ПервыйДокумент = Ложь;
	//    // Запомним номер строки, с которой начали выводить текущий документ.
	//    НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	//	
	//	ЕстьСекцияТабличнойЧасти = Ложь;
	//	ЕстьСекцияОднойУслуги = Ложь;
	//	
	//	Попытка
	//		ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти");
	//		ЕстьСекцияТабличнойЧасти = Истина;
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаУслуги");
	//		ЕстьСекцияОднойУслуги = Истина;
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	// Изменения размера колоноки, в зависимости от вывода Артикула
	//	Если Не ВыводитьАртикул Тогда
	//		Попытка
	//			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//	
	//	//заполнение свойств
	//	Если ЕстьСекцияТабличнойЧасти Или ЕстьСекцияОднойУслуги Тогда
	//		//есть секции услуг, выводим шапку таблицы
	//		Попытка
	//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Вывести(ОбластьМакета);
	//			
	//			Если ВыводитьАртикул Тогда
	//				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//				ТабличныйДокумент.Присоединить(ОбластьМакета);
	//			КонецЕсли;
	//			
	//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		Исключение
	//		КонецПопытки;
	//		Если (ЕстьСекцияТабличнойЧасти И ЕстьСекцияОднойУслуги) или (ЕстьСекцияТабличнойЧасти И НЕ ЕстьСекцияОднойУслуги) Тогда
	//			ИмяКомната = "";
	//			НомерСтроки = 1;
	//			Шапка.ТоварыУслуги.Сортировать("Комната Возр");
	//			//выводим секцию с табличной частью
	//			Для Каждого ВыборкаТоваровУслуг Из Шапка.ТоварыУслуги Цикл
	//				//НАЧАЛО Хаматов А.Р. 2017-08-31 выводим заголовок комнаты
	//				Если ИмяКомната <> ВыборкаТоваровУслуг.Комната Тогда
	//					ИмяКомната = ВыборкаТоваровУслуг.Комната;
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|НомерСтроки");
	//					ТабличныйДокумент.Вывести(ОбластьМакета);
	//					
	//					Если ВыводитьАртикул Тогда
	//						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|Артикул");
	//						ТабличныйДокумент.Присоединить(ОбластьМакета);
	//					КонецЕсли;
	//					
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|Данные");
	//					ОбластьМакета.Область().Шрифт = Новый Шрифт (ОбластьМакета.Область().Шрифт,,,Истина,Истина);  // жирный наклонный шрифт
	//					ОбластьМакета.Параметры.Номенклатура = ИмяКомната;
	//					ТабличныйДокумент.Присоединить(ОбластьМакета);
	//				КонецЕсли;
	//				//КОНЕЦ Хаматов А.Р. 2017-08-31 выводим заголовок комнаты
	//				
	//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|НомерСтроки");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаТоваровУслуг);
	//				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
	//				ТабличныйДокумент.Вывести(ОбластьМакета);
	//				
	//				Если ВыводитьАртикул Тогда
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|Артикул");
	//					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаТоваровУслуг);
	//					ТабличныйДокумент.Присоединить(ОбластьМакета);
	//				КонецЕсли;
	//				
	//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти|Данные");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаТоваровУслуг);
	//				ПредставлениеНоменклатуры = Строка(ВыборкаТоваровУслуг.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(ВыборкаТоваровУслуг.ХарактеристикаНоменклатуры));
	//				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
	//				ТабличныйДокумент.Присоединить(ОбластьМакета);
	//				
	//				НомерСтроки = НомерСтроки + 1;				
	//			КонецЦикла;
	//		Иначе
	//			//выводим секцию с одной строкой
	//			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаУслуги|НомерСтроки");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Вывести(ОбластьМакета);
	//			
	//			Если ВыводитьАртикул Тогда
	//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаУслуги|Артикул");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//				ТабличныйДокумент.Присоединить(ОбластьМакета);
	//			КонецЕсли;
	//			
	//			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаУслуги|Данные");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//	Иначе
	//		//секций услуг нет. не выводим ни шапку ни строки
	//	КонецЕсли;
	//	
	//	Попытка 
	//		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Попытка
	//			Если НЕ Шапка.ЯвляетсяПлательщикомНДС Тогда
	//				ОбластьМакета.Параметры.СтавкаНДС = "Без НДС.";
	//			КонецЕсли;				
	//		Исключение			
	//		КонецПопытки;
	//		//альтернатива Попытке - Если Найти(ЗначениеВСтрокуВнутр(ОбластьМакета),"СуммаДокументаПрописью") <> 0 Тогда
	//		Попытка
	//			ОбластьМакета.Параметры.СуммаДокументаПрописью = РаботаСВалютой.СформироватьЧислоПрописью(Шапка.СуммаДокумента, Шапка.Валюта);								
	//		Исключение			
	//		КонецПопытки;
	//		Попытка
	//			ОбластьМакета.Параметры.ДатаПечати = Формат(ТекущаяДатаСеанса(),"ДЛФ=Д");
	//		Исключение
	//		КонецПопытки;
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//    // В табличном документе необходимо задать имя области, в которую был 
	//    // выведен объект. Нужно для возможности печати комплектов документов.
	//    УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
	//        НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	//КонецЦикла;
	//Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьКомплектДляМонтажников(МассивОбъектов, ОбъектыПечати, ПересчетЦеныПоСкидке = Ложь)
	
	Возврат ОбщийМодульСервер.ПечатьРозницаКомплектДляМонтажников(МассивОбъектов, ОбъектыПечати, ПересчетЦеныПоСкидке);
	
	//Таб = Новый ТабличныйДокумент;
	//Таб.ИмяПараметровПечати = "ПараметрыПечати_КомплектДляМонтажников";
	//ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = ПолучитьТекстЗапросаДляПечати();
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса);	
	//
	//ПервыйДокумент = Истина;
	//Для Каждого Шапка Из РезультатЗапроса Цикл
	//	
	//	Если Не ПервыйДокумент Тогда
	//		// Все документы нужно выводить на разных страницах.
	//		Таб.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	ПервыйДокумент = Ложь;
	//	// Запомним номер строки, с которой начали выводить текущий документ.
	//	НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
	//	
	//	ЕстьСкидка = Ложь;
	//	Для Каждого ВремТовары Из Шапка.ТоварыУслуги Цикл
	//		Если ВремТовары.СуммаСкидки > 0 тогда
	//			ЕстьСкидка = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	//Если ЕстьСкидка Тогда
	//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_КомплектДляМонтажниковСоСкидкой");
	//	//Иначе
	//	//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_КомплектДляМонтажников");
	//	//КонецЕсли;	
	//	
	//	//шапка 
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//		Попытка
	//			ТекстЗаголовка = "Монтаж №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер) + " от " + Формат(Шапка.Дата, "ДЛф=Д");
	//			ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;			
	//		Исключение				
	//		КонецПопытки;
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	//Дата монтажа
	//	Если НЕ Шапка.ДатаМонтажаНеОпределена Тогда
	//		Попытка			
	//			ОбластьМакета = Макет.ПолучитьОбласть("ДатаМонтажа");
	//			
	//			ДатаМонтажа = Шапка.ДатаМонтажаФормат + " с " + Шапка.ВремяНачалаФормат + " по " + Шапка.ВремяОкончанияФормат;
	//			
	//			ОбластьМакета.Параметры.ДатаМонтажа = ДатаМонтажа;
	//			Таб.Вывести(ОбластьМакета);
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;	
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	ШиринаУвеличенияКолонкиТовар = 0;
	//	Попытка
	//		Если Не ЕстьСкидка Тогда
	//			ШиринаУвеличенияКолонкиТовар = ШиринаУвеличенияКолонкиТовар + Макет.Область("КолонкаСкидка").ШиринаКолонки;
	//		КонецЕсли;
	//		Если Не ВыводитьАртикул Тогда
	//			ШиринаУвеличенияКолонкиТовар = ШиринаУвеличенияКолонкиТовар + Макет.Область("Артикул").ШиринаКолонки;
	//		КонецЕсли;
	//	Исключение	
	//	КонецПопытки;	
	//	
	//	// Изменения размера колоноки, в зависимости от вывода Артикула, Скидки
	//	Если Не ШиринаУвеличенияКолонкиТовар = 0 Тогда
	//		Попытка
	//			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + ШиринаУвеличенияКолонкиТовар;
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//	Если Не ВыводитьАртикул Тогда
	//		Попытка
	//			Макет.Область("мПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("мПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("мАртикул").ШиринаКолонки;
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Присоединить(ОбластьМакета);
	//		
	//		Если ЕстьСкидка Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаСкидка");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаСумма");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Присоединить(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	Сумма = 0;
	//	ИмяКомната = "";
	//	НомерСтроки = 1;
	//	Попытка
	//	    Шапка.ТоварыУслуги.Сортировать("Комната Возр");
	//		Для Каждого Товары из  Шапка.ТоварыУслуги Цикл
	//			//НАЧАЛО Хаматов А.Р. 2017-05-24 выводим заголовок комнаты 
	//			Если ИмяКомната <> Товары.Комната Тогда
	//				ИмяКомната = Товары.Комната;
	//				ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	//				Таб.Вывести(ОбластьМакета);
	//				
	//				Если ВыводитьАртикул Тогда
	//					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
	//					Таб.Присоединить(ОбластьМакета);
	//				КонецЕсли;
	//				
	//				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
	//				// жирный наклонный шрифт
	//				ШрифтКомнаты = Новый Шрифт (ОбластьМакета.Область().Шрифт,,,Истина,Истина);
	//				ОбластьМакета.Область().Шрифт = ШрифтКомнаты;
	//				ОбластьМакета.Параметры.Номенклатура = ИмяКомната;				
	//				Таб.Присоединить(ОбластьМакета);
	//				
	//				Если ЕстьСкидка Тогда
	//					ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаСкидка");						
	//					Таб.Присоединить(ОбластьМакета);
	//				КонецЕсли;
	//				
	//				ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаСумма");					
	//				Таб.Присоединить(ОбластьМакета);
	//			КонецЕсли;
	//			//КОНЕЦ Хаматов А.Р. 2017-05-24 выводим заголовок комнаты
	//			
	//			ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
	//			ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
	//			Таб.Вывести(ОбластьМакета);
	//			
	//			Если ВыводитьАртикул Тогда
	//				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
	//				Таб.Присоединить(ОбластьМакета);
	//			КонецЕсли;
	//			
	//			ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
	//			ПредставлениеНоменклатуры = Строка(Товары.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Товары.ХарактеристикаНоменклатуры));
	//			ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
	//			Таб.Присоединить(ОбластьМакета);
	//			
	//			Если ЕстьСкидка Тогда
	//				ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаСкидка");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
	//				Таб.Присоединить(ОбластьМакета);
	//			КонецЕсли;
	//			
	//			ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаСумма");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Товары);
	//			Таб.Присоединить(ОбластьМакета);
	//			
	//			НомерСтроки = НомерСтроки + 1;
	//			Сумма = Сумма + Товары.Сумма;
	//		КонецЦикла;
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
	//		Таб.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
	//		Попытка
	//			ОбластьМакета.Параметры.Сумма = Сумма;
	//			ОбластьМакета.Параметры.Валюта = Шапка.Валюта;
	//		Исключение
	//		КонецПопытки;
	//		Таб.Присоединить(ОбластьМакета);
	//		
	//		Если ЕстьСкидка Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("Итого|КолонкаСкидка");
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("Итого|КолонкаСумма");
	//		Таб.Присоединить(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	ВидНомен = "";
	//	Попытка
	//		//НАЧАЛО Хаматов А.Р. 2017-05-24 объединяем Товары и Материалы 
	//		тзТоварыМатериалы = Шапка.ТоварыУслуги.Скопировать();
	//		Для каждого Материалы Из Шапка.Материалы Цикл 
	//			Если ЗначениеЗаполнено(Материалы.Номенклатура) Тогда		
	//				НоваяСтрокаМатериала = тзТоварыМатериалы.Добавить();
	//				ЗаполнитьЗначенияСвойств(НоваяСтрокаМатериала, Материалы);
	//				Попытка
	//					НоваяСтрокаМатериала.Артикул = Материалы.Номенклатура.Артикул;
	//				Исключение
	//				КонецПопытки;
	//			КонецЕсли;
	//		КонецЦикла;
	//		тзТоварыМатериалы.Сортировать("ВидНоменклатуры Возр");
	//		тзТоварыМатериалы.Свернуть("ВидНоменклатуры,Артикул,Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Коэффициент", "Количество");
	//		//НАЧАЛО Хаматов А.Р. 2017-05-24 
	//					
	//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаМатериалы|мНомерСтроки");
	//		Таб.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаМатериалы|мАртикул");
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаМатериалы|мДанные");
	//		Таб.Присоединить(ОбластьМакета);
	//		
	//		НомерСтроки = 1;
	//		//Для Каждого Материалы Из Шапка.Материалы Цикл
	//		Для Каждого Материалы Из тзТоварыМатериалы Цикл
	//			
	//			Если НЕ Материалы.Номенклатура.Пустая() 
	//				И Материалы.ВидНоменклатуры <> Справочники.ВидыНоменклатуры.Услуга Тогда
	//				
	//				//НАЧАЛО Хаматов А.Р. 2017-05-24 выводим заголовок вида номенклатуры 
	//				Если ВидНомен <> Материалы.ВидНоменклатуры Тогда
	//					
	//					ВидНомен = Материалы.ВидНоменклатуры;
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мНомерСтроки");
	//					Таб.Вывести(ОбластьМакета);
	//					
	//					Если ВыводитьАртикул Тогда
	//						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мАртикул");
	//						Таб.Присоединить(ОбластьМакета);
	//					КонецЕсли;
	//					
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мДанные");
	//					// жирный наклонный шрифт
	//					ШрифтВидНомен = Новый Шрифт (ОбластьМакета.Область().Шрифт,,,Истина,Истина);
	//					ОбластьМакета.Область().Шрифт = ШрифтВидНомен;
	//					ОбластьМакета.Параметры.Номенклатура = ВидНомен;
	//					Таб.Присоединить(ОбластьМакета);
	//				КонецЕсли;
	//				//КОНЕЦ Хаматов А.Р. 2017-05-24 выводим заголовок номенклатуры
	//									
	//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мНомерСтроки");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Материалы);
	//				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
	//				Таб.Вывести(ОбластьМакета);
	//				
	//				Если ВыводитьАртикул Тогда
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мАртикул");
	//					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Материалы);
	//					Таб.Присоединить(ОбластьМакета);
	//				КонецЕсли;
	//				
	//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|мДанные");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Материалы);
	//				ПредставлениеНоменклатуры = Строка(Материалы.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Материалы.ХарактеристикаНоменклатуры));
	//				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;	
	//				Таб.Присоединить(ОбластьМакета);
	//				
	//				НомерСтроки = НомерСтроки + 1;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМатериалы|мНомерСтроки");
	//		Таб.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМатериалы|мАртикул");
	//			Таб.Присоединить(ОбластьМакета);
	//		КонецЕсли;	
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМатериалы|мДанные");
	//		Таб.Присоединить(ОбластьМакета);
	//		
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка
	//		Если НЕ ПустаяСтрока(Шапка.КомментарийКМонтажу) Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("КомментарийКМонтажу");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			Таб.Вывести(ОбластьМакета);
	//		КонецЕсли;
	//	Исключение
	//	КонецПопытки;
	//	
	//	//Исполнители
	//	Попытка
	//		Если Шапка.Исполнители.Количество() > 0 Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаИсполнители");				
	//			Таб.Вывести(ОбластьМакета);
	//			
	//			Для Каждого Исполнитель Из Шапка.Исполнители Цикл
	//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИсполнители");				
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Исполнитель);
	//				Таб.Вывести(ОбластьМакета);
	//			КонецЦикла;
	//			
	//			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалИсполнители");				
	//			Таб.Вывести(ОбластьМакета);
	//		КонецЕсли;				
	//	Исключение
	//	КонецПопытки;

	//	//2017-10-24 Добавлена печать плаируемой выработки по монтажникам
	//	ЕстьСекцияВыработкиМонтажников = Ложь;
	//	ВыведенаШапка = Ложь;
	//	Попытка
	//		ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаВыработки");
	//		ЕстьСекцияВыработкиМонтажников = Истина;
	//	Исключение
	//	КонецПопытки;
	//	Если ЕстьСекцияВыработкиМонтажников Тогда
	//		
	//		ДокументОбъектМонтаж = Шапка.Ссылка.ПолучитьОбъект();
	//		ТЗ_Выработки_Врем = Новый ТаблицаЗначений;
	//		//ТЗ_Выработки_Врем = Зарплата.ПолучитьЗаписиРегистраВыработки(Шапка.Ссылка);  #6347
	//		//ТЗ_Выработки_Врем.Свернуть("Сотрудник, ВидНачисления, Номенклатура, НеНачислятьВыработку", "Количество, Стоимость"); #6347 заменено на нижнюю конструкцию
	//		ТЗ_Выработки_Врем = Зарплата.РассчитатьВыработкуПоДокументу(Шапка.Ссылка);
	//		ТЗ_Выработки_Врем.Свернуть("Сотрудник, ВидНачисления, Номенклатура", "Количество, Стоимость");
	//		
	//		//оставим только исполнителей монтажа
	//		ТЗ_Выработки = ТЗ_Выработки_Врем.Скопировать();			
	//		ТЗ_Выработки.Очистить();
	//		Для Каждого ТекущийИсполнитель Из ТЗ_Выработки_Врем Цикл
	//			//Если НЕ ТекущийИсполнитель.НеНачислятьВыработку Тогда
	//				Если НЕ Шапка.Ссылка.Исполнители.Найти(ТекущийИсполнитель.Сотрудник, "Сотрудник") = Неопределено Тогда
	//					НоваяСтрока = ТЗ_Выработки.Добавить();
	//					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийИсполнитель);
	//				КонецЕсли;
	//			//КонецЕсли;
	//		КонецЦикла;
	//		
	//		СуммаСотрудникИтог = 0;
	//		СотрудникИтог = Неопределено;
	//		Для каждого Исполнитель Из Шапка.Исполнители Цикл
	//			
	//			НайденныеСтроки = ТЗ_Выработки.НайтиСтроки(Новый Структура("Сотрудник", Исполнитель.Сотрудник));
	//			Если НайденныеСтроки.Количество() > 0 Тогда
	//				Если НЕ ВыведенаШапка Тогда
	//					ОбластьМакета = Макет.ПолучитьОбласть("ШапкаВыработки");
	//					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//					Таб.Вывести(ОбластьМакета);
	//					ВыведенаШапка = Истина;
	//				КонецЕсли;
	//				
	//				СуммаСотрудникИтог = 0;
	//				Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВыработки");
	//					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, НайденнаяСтрока);
	//					Таб.Вывести(ОбластьМакета);
	//					СуммаСотрудникИтог = СуммаСотрудникИтог + НайденнаяСтрока.Стоимость;
	//				КонецЦикла;
	//				Попытка
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВыработкиИтог");
	//					ОбластьМакета.Параметры.Стоимость = СуммаСотрудникИтог;
	//					Таб.Вывести(ОбластьМакета);							
	//				Исключение							
	//				КонецПопытки;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		Если ВыведенаШапка Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоВыработки");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			Таб.Вывести(ОбластьМакета);
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	// Конец 2017-10-24
	//	
	//	//Выработка общая в разрезе Сотрудник - Вид начисления
	//	//По персональной заявке №2262 Антураж (ИП Болотин)
	//	ЕстьСекцияВыработкиМонтажниковОбщая = Ложь;
	//	ВыведенаШапкаОбщая = Ложь;
	//	Попытка
	//		ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаВыработкиОбщая");
	//		ЕстьСекцияВыработкиМонтажниковОбщая = Истина;
	//	Исключение
	//	КонецПопытки;
	//	Если ЕстьСекцияВыработкиМонтажниковОбщая Тогда
	//		
	//		ДокументОбъектМонтаж = Шапка.Ссылка.ПолучитьОбъект();
	//		ТЗ_Выработки_Врем = Новый ТаблицаЗначений;
	//		ТЗ_Выработки_Врем = Зарплата.РассчитатьВыработкуПоДокументу(Шапка.Ссылка);
	//		ТЗ_Выработки_Врем.Свернуть("Сотрудник, ВидНачисления", "Стоимость");
	//		
	//		//оставим только исполнителей монтажа
	//		ТЗ_Выработки = ТЗ_Выработки_Врем.Скопировать();			
	//		ТЗ_Выработки.Очистить();
	//		Для Каждого ТекущийИсполнитель Из ТЗ_Выработки_Врем Цикл
	//			//Если НЕ ТекущийИсполнитель.НеНачислятьВыработку Тогда
	//				Если НЕ Шапка.Ссылка.Исполнители.Найти(ТекущийИсполнитель.Сотрудник, "Сотрудник") = Неопределено Тогда
	//					НоваяСтрока = ТЗ_Выработки.Добавить();
	//					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийИсполнитель);
	//				КонецЕсли;
	//			//КонецЕсли;
	//		КонецЦикла;
	//		
	//		СуммаСотрудникИтог = 0;
	//		СотрудникИтог = Неопределено;
	//		Для каждого Исполнитель Из Шапка.Исполнители Цикл
	//			
	//			НайденныеСтроки = ТЗ_Выработки.НайтиСтроки(Новый Структура("Сотрудник", Исполнитель.Сотрудник));
	//			Если НайденныеСтроки.Количество() > 0 Тогда
	//				Если НЕ ВыведенаШапкаОбщая Тогда
	//					ОбластьМакета = Макет.ПолучитьОбласть("ШапкаВыработкиОбщая");
	//					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//					Таб.Вывести(ОбластьМакета);
	//					ВыведенаШапкаОбщая = Истина;
	//				КонецЕсли;
	//				
	//				СуммаСотрудникИтог = 0;
	//				Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВыработкиОбщая");
	//					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, НайденнаяСтрока);
	//					Таб.Вывести(ОбластьМакета);
	//					СуммаСотрудникИтог = СуммаСотрудникИтог + НайденнаяСтрока.Стоимость;
	//				КонецЦикла;
	//				Попытка
	//					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВыработкиИтогОбщая");
	//					ОбластьМакета.Параметры.Стоимость = СуммаСотрудникИтог;
	//					Таб.Вывести(ОбластьМакета);							
	//				Исключение							
	//				КонецПопытки;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		Если ВыведенаШапкаОбщая Тогда
	//			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоВыработкиОбщая");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			Таб.Вывести(ОбластьМакета);
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	//Конец Выработка общая

	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Попытка
	//			ОбластьМакета.Параметры.СуммаПоТоварам = Сумма;
	//		Исключение
	//		КонецПопытки;
	//		Таб.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЦикла;
	//
	//Возврат Таб;
	
КонецФункции

Функция ПечатьТоварнойНакладной(МассивОбъектов, ОбъектыПечати, ВыводУслуг = Ложь) Экспорт
	
	Таб = Новый ТабличныйДокумент;
	Таб.АвтоМасштаб         = Истина; //#14053
	Таб.ИмяПараметровПечати = "ПараметрыПечати_Монтаж_ТоварнаяНакладная";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_ТоварнаяНакладная");
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();	

	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	//ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаТоварыИУслуги = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выгрузить();
	
	КоличествоТоваров = ТаблицаТоварыИУслуги.Количество();		
	Для Инд = 1 по КоличествоТоваров Цикл
		//обратный обход для возможности удаления услуг и пустых группировок
		ТекущаяСтрока = ТаблицаТоварыИУслуги[КоличествоТоваров - Инд];
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			ТаблицаТоварыИУслуги.Удалить(ТекущаяСтрока);
			Продолжить;
		КонецЕсли;
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) И НЕ ВыводУслуг Тогда
			ТаблицаТоварыИУслуги.Удалить(ТекущаяСтрока);
		КонецЕсли;		
	КонецЦикла;
    
    ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
            Таб.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Таб.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Таб.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Получатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Таб.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Таб.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Основание");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Таб.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		//добавим адрес монтажа, если поле не пустое		
		Попытка
			Если НЕ ПустаяСтрока(ДанныеПечати.АдресМонтажа) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("АдресМонтажа");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				Таб.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		// Изменения размера колоноки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Таб.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				Таб.Присоединить(ОбластьМакета);
			КонецЕсли;

			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Таб.Присоединить(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоТоварам = ТаблицаТоварыИУслуги.НайтиСтроки(СтруктураПоиска);		
		
		Сумма = 0;
		Количество = 0;
		НомерСтроки = 1;
		Для Каждого ТекущаяСтрока Из ВыборкаПоТоварам Цикл
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				Таб.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
					ОбластьМакета.Параметры.Заполнить(ТекущаяСтрока);
					Таб.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
				ОбластьМакета.Параметры.Заполнить(ТекущаяСтрока);
				
				//++ №12909
				//Попытка
				//	ПредставлениеНоменклатуры = Строка(ТекущаяСтрока.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(ТекущаяСтрока.ХарактеристикаНоменклатуры));
				//Исключение
				//	ПредставлениеНоменклатуры = Строка(ТекущаяСтрока.Номенклатура);
				//КонецПопытки;
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры);
				//-- №12909
				
				ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
				Таб.Присоединить(ОбластьМакета);
				
				НомерСтроки = НомерСтроки + 1;			
				Количество = Количество + ТекущаяСтрока.Количество;
				Сумма = Сумма + ТекущаяСтрока.Сумма;
			Исключение			
			КонецПопытки;		
		КонецЦикла;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Таб.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				Таб.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати); 
			Попытка
				ОбластьМакета.Параметры.Количество = Количество;						
			Исключение			
			КонецПопытки;
			Попытка		
				ОбластьМакета.Параметры.Сумма = Сумма;			
			Исключение			
			КонецПопытки;
			Таб.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати); 
			Попытка
				ОбластьМакета.Параметры.Количество = Количество;						
			Исключение			
			КонецПопытки;
			Попытка		
				ОбластьМакета.Параметры.Сумма = Сумма;			
			Исключение			
			КонецПопытки;		
			
			Таб.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(Таб, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Возврат Таб;
	
КонецФункции

Функция ТекстЗапросаДляПечатиТоварнойНакладной() Экспорт
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	""01.01.2001"" КАК Дата,
	|	ДанныеДокумента.Склад КАК Склад,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.Результат КАК Результат,
	|	ДанныеДокумента.ДатаМонтажа КАК ДатаМонтажаДокумента,
	|	ДанныеДокумента.Адрес КАК АдресМонтажа,
	|	ДанныеДокумента.ТоварыУслуги.(
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		СтавкаНДС КАК СтавкаНДС,
	|		СуммаНДС КАК СуммаНДС,
	|		НомерСтроки КАК НомерСтроки,
	|		Ссылка КАК Ссылка,
	|		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СерияНоменклатуры КАК СерияНоменклатуры,
	|		Коэффициент КАК Коэффициент,
	|		СуммаСкидки КАК СуммаСкидки,
	|		ПроцентСкидки КАК ПроцентСкидки,
	|		Комната КАК Комната
	|	) КАК ТоварыУслуги,
	|	ДанныеДокумента.Организация.ПолноеНаименование КАК Организация,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.Руководитель.РасшифровкаПодписи
    //++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Руководитель)
	|		ИНАЧЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОРуководителя,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.ГлавныйБухгалтер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.ГлавныйБухгалтер.РасшифровкаПодписи
	//++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.ГлавныйБухгалтер)
	|		ИНАЧЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОГлавБухгалтера,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Автор.Сотрудник.Должность
    |		ИНАЧЕ ДанныеДокумента.Отпустил.Должность
    |	КОНЕЦ КАК ДолжностьКладовщика,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Автор.Сотрудник.РасшифровкаПодписи
    //++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Отпустил)
	|		ИНАЧЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК Отпустил,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	ДанныеДокумента.ВидЦен КАК ВидЦен,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ДанныеДокумента.Основание.Дата КАК ДатаДокументаОснования,
	|	""01.01.2001"" КАК ДатаОснования,
	|	ДанныеДокумента.Основание.Номер КАК НомерОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.Лид
	|			ТОГДА ""Лид""
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказДоговор
	|			ТОГДА ""Заказ-договор""
	|	КОНЕЦ КАК ВидОснования,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.СуммаДополнительныхЗатрат КАК СуммаДополнительныхЗатрат,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	0 КАК ИтогоСуммаНДС,
	|	0 КАК ИтогоСуммаБезНДС,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК ТекущийДолг,
	|	ЕСТЬNULL(РасчетыПоМонтажуОстатки.СуммаОстаток, 0) КАК ДолгПоМонтажу,
	|	ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК ДолгПоЗаказу,
	|	ДанныеДокумента.СуммаДокумента - ЕСТЬNULL(РасчетыПоМонтажуОстатки.СуммаОстаток, 0) КАК ОплаченоПоМонтажу,
	|	КонстантаВалютаУчета.Значение.Ссылка КАК ВалютаУчета,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.НомерСчета КАК КонтрагентБанковскийСчетНомерСчета,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.БИК КАК КонтрагентБанковскийСчетБИК,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.КоррСчет КАК КонтрагентБанковскийСчетКоррСчет,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.НаименованиеБанка КАК КонтрагентБанковскийСчетНаименованиеБанка,
	|	БонусыКонтрагентовОстатки.СуммаОстаток КАК БонусОстатки
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ПО ДанныеДокумента.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
	|			И ДанныеДокумента.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоМонтажуОстатки
	|		ПО ДанныеДокумента.Ссылка = РасчетыПоМонтажуОстатки.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|		ПО ДанныеДокумента.Основание = РасчетыПоЗаказамОстатки.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БонусыКонтрагентов.Остатки КАК БонусыКонтрагентовОстатки
	|		ПО ДанныеДокумента.Контрагент = БонусыКонтрагентовОстатки.Контрагент
	|			И ДанныеДокумента.ДисконтнаяКарта = БонусыКонтрагентовОстатки.ДисконтнаяКарта,
	|	Константа.ВалютаУчета КАК КонстантаВалютаУчета
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)";
	
КонецФункции

Функция ПечатьСчетФактуры(МассивОбъектов, ОбъектыПечати)
	
	Возврат Документы.СчетФактураВыданный.ПечатьСчетФактуры(МассивОбъектов, ОбъектыПечати);
	
КонецФункции

Функция ПечатьТОРГ12(МассивОбъектов, ОбъектыПечати)
	
	// №6280 переделано под унифицированную функцию печати ТОРГ-12
	Возврат ОбщийМодульСервер.ПечатьТОРГ12(МассивОбъектов, ОбъектыПечати);
	
КонецФункции

Функция ПечатьУПД(МассивОбъектов, ОбъектыПечати)
	
	Возврат Документы.СчетФактураВыданный.ПечатьУПД(МассивОбъектов, ОбъектыПечати);
	
КонецФункции

// №6296 перенесен из ЗД 
Функция ПечатьГарантийныйТалон(МассивОбъектов, ОбъектыПечати)
	
	Возврат ОбщийМодульСервер.ПечатьРозницаГарантийныйТалон(МассивОбъектов, ОбъектыПечати);

	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ГарантийныйТалон";
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_ГарантийныйТалон");
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = ПолучитьТекстЗапросаДляПечати();
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	////подготовим итоговую таблицу с данными
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//ДополнитьРезультатЗапроса(РезультатЗапроса);
	//	
	//ПервыйДокумент = Истина;
	//Для Каждого Шапка Из РезультатЗапроса Цикл
	//	
	//	Если Не ПервыйДокумент Тогда
	//		// Все документы нужно выводить на разных страницах.
	//		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	ПервыйДокумент = Ложь;
	//	// Запомним номер строки, с которой начали выводить текущий документ.
	//	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");		
	//	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//	// В табличном документе необходимо задать имя области, в которую был 
	//	// выведен объект. Нужно для возможности печати комплектов документов.
	//	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
	//	НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	//	
	//КонецЦикла;
	//		
	//Возврат ТабличныйДокумент;
	
КонецФункции

// #14160  
Функция ПечатьВыработкиИсполнителей(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; 
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ВыработкаИсполнителей";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_ВыработкаИсполнителей");
	
	МенеджерОбъекта = Документы.Монтаж;
	
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	МенеджерОбъекта.ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);

	ПервыйДокумент = Истина;
	Для каждого ДанныеПечати из ТаблицаДанныеПечати Цикл
	    Если Не ПервыйДокумент Тогда
	        // Все документы нужно выводить на разных страницах.
	        ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	    КонецЕсли;
	    ПервыйДокумент = Ложь;
	    // Запомним номер строки, с которой начали выводить текущий документ.
	    НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
						
		//заголовок			
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка			
				ТекстЗаголовка = ДанныеПечати.Ссылка.Метаданные().Синоним + " №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + ДанныеПечати.ДатаФормат;
				ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		СтруктураВыработки = ОбщийМодульСервер.ПолучитьТаблицуВыработкиПоМонтажуДляПФ(ДанныеПечати.Ссылка);
		ТаблицаВыработки = СтруктураВыработки.ТаблицаВыработки;

		ТаблицаВыработки.Свернуть("Сотрудник, ВидНачисления, Номенклатура", "Количество, Стоимость");
		
		ЗаголовокТаблицы  = "Выработка по исполнителям";
		Если СтруктураВыработки.Плановая Тогда
			ЗаголовокТаблицы = ЗаголовокТаблицы + " (плановая)";	
		КонецЕсли;
		
		ВыведенаШапка = Ложь;
		СуммаСотрудникИтог = 0;
		СотрудникИтог = Неопределено;
		
		//выводим только исполнителей монтажа
		Для каждого Исполнитель Из ДанныеПечати.Ссылка.Исполнители Цикл
			
			НайденныеСтроки = ТаблицаВыработки.НайтиСтроки(Новый Структура("Сотрудник", Исполнитель.Сотрудник));
			Если НайденныеСтроки.Количество() > 0 Тогда
				Если НЕ ВыведенаШапка Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ШапкаВыработки");																																
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
					ОбластьМакета.Параметры.ЗаголовокТаблицы = ЗаголовокТаблицы;
					ТабличныйДокумент.Вывести(ОбластьМакета);
					ВыведенаШапка = Истина;
				КонецЕсли;
				
				СуммаСотрудникИтог = 0;
				Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВыработки");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, НайденнаяСтрока);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					СуммаСотрудникИтог = СуммаСотрудникИтог + НайденнаяСтрока.Стоимость;
				КонецЦикла;
				Попытка
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВыработкиИтог");
					ОбластьМакета.Параметры.Стоимость = СуммаСотрудникИтог;
					ТабличныйДокумент.Вывести(ОбластьМакета);							
				Исключение							
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
		Если ВыведенаШапка Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоВыработки");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;	
	
		// В табличном документе необходимо задать имя области, в которую был 
	    // выведен объект. Нужно для возможности печати комплектов документов.
	    УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
			
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

Процедура ПодготовитьТаблицуСписанияМатериалыИТовары(Знач Организация, Знач Материалы, Знач ТоварыУслуги, Знач Дата, Знач Склад, пТаблицаСписанияМатериалы = Неопределено, пТаблицаСписанияТовары = Неопределено,
	пСебестоимостьПотолков, пСебестоимостьТоваров)
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	пСебестоимостьПотолков = 0;
	пСебестоимостьТоваров = 0;												 
	пМонтажКакРеализация = Истина; //Константы.МонтажКакРеализация.Получить();
	пКоличествоТоваровКСписаниюВМонтажеНеСоответствуетКоличествуПроданногоТовара = Константы.КоличествоТоваровКСписаниюВМонтажеНеСоответствуетКоличествуПроданногоТовара.Получить();
	пДатаДвижения = Дата;
	
	Если ТипЗнч(Материалы) = Тип("ТаблицаЗначений") Тогда
		//таблица значений
		пТаблицаСписанияМатериалы = Материалы.Скопировать();
	Иначе
		//табличная часть
		пТаблицаСписанияМатериалы = Материалы.Выгрузить();
	КонецЕсли;
	пТаблицаСписанияМатериалы.Очистить();
	Для Каждого ТекущаяСтрока Из Материалы Цикл
		Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
			НоваяСтрока = пТаблицаСписанияМатериалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ пТаблицаСписанияМатериалы.Количество() = 0 Тогда
		Для Каждого Товар Из пТаблицаСписанияМатериалы Цикл
			сКоличество = Товар.Количество * Товар.Коэффициент;				
			сСумма = сКоличество * РегистрыНакопления.ТоварыНаСкладах.ПолучитьСебестоимостьНоменклатурыОрганизации(пДатаДвижения, ОрганизацияТоваров, Товар.Номенклатура, Склад, Товар.ХарактеристикаНоменклатуры, Товар.СерияНоменклатуры); 
			Если Товар.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал
				или Товар.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
				пСебестоимостьПотолков = пСебестоимостьПотолков + сСумма;
			Иначе
				пСебестоимостьТоваров = пСебестоимостьТоваров + сСумма;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	
	//товары
	Если пМонтажКакРеализация Тогда
		Если ТипЗнч(ТоварыУслуги) = Тип("ТаблицаЗначений") Тогда
			//таблица значений
			пТаблицаСписанияТовары = ТоварыУслуги.Скопировать();
		Иначе
			//табличная часть
			пТаблицаСписанияТовары = ТоварыУслуги.Выгрузить();
		КонецЕсли;
		пТаблицаСписанияТовары.Очистить();
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
				НоваяСтрока = пТаблицаСписанияТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				Если пКоличествоТоваровКСписаниюВМонтажеНеСоответствуетКоличествуПроданногоТовара Тогда
					НоваяСтрока.Количество = ТекущаяСтрока.КоличествоКСписанию;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ пТаблицаСписанияТовары.Количество() = 0 Тогда
			Для Каждого Товар Из пТаблицаСписанияТовары Цикл
				сКоличество = Товар.Количество * Товар.Коэффициент;
				сСумма = сКоличество * РегистрыНакопления.ТоварыНаСкладах.ПолучитьСебестоимостьНоменклатурыОрганизации(пДатаДвижения, ОрганизацияТоваров, Товар.Номенклатура, Склад, Товар.ХарактеристикаНоменклатуры, Товар.СерияНоменклатуры); 
				Если Товар.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал
					или Товар.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
					пСебестоимостьПотолков = пСебестоимостьПотолков + сСумма;
				Иначе
					пСебестоимостьТоваров = пСебестоимостьТоваров + сСумма;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСуммуОплат(ДокументСсылка, ДатаОстатка = Неопределено)

	// если дата не найдена, берем все по текущую дату
	ДатаОстатка = ?(ЗначениеЗаполнено(ДатаОстатка), ДатаОстатка, КонецДня(ТекущаяДатаСеанса()));  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыПоЗаказамОбороты.СуммаРасход КАК СуммаРасход
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Обороты(, &Дата, , Заказ = &Заказ) КАК РасчетыПоЗаказамОбороты";
	
	Запрос.УстановитьПараметр("Заказ", ДокументСсылка);
	Запрос.УстановитьПараметр("Дата",  ДатаОстатка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаРасход;
	КонецЕсли;
	
	Возврат 0;	
	
КонецФункции

#Область ПечатьЧека

// Возвращает предварительные параметры фискализации чека для документа.
//
// Параметры:
//   ДокументСсылка - ДокументСсылка.ПриходныйКассовыйОрдер - Документ.
//   ВерсияФФД - Строка - Версия ФФД.
//
// ВозвращаемоеЗначение:
//  Неопределено, Структура - см. функцию МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека().
//
Функция ПараметрыОперацииФискализацииЧека(ДокументСсылка, ВерсияФФД = Неопределено, ЭкземплярПодключаемогоОборудования = Неопределено) Экспорт
	
	// Общие параметры чека
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
		
	// Общие реквизиты для всех типов оборудования.
	ПотолкиКассыОнлайн.ЗаполнитьОбщиеРеквизиты(ДокументСсылка, ОбщиеПараметры, ЭкземплярПодключаемогоОборудования);
	
	// Товарные позиции И Таблица оплат
	ПотолкиКассыОнлайн.ДополнитьТоварамиПараметрыПриПробитииЧекаПоДокументуПродажи(ДокументСсылка, ОбщиеПараметры);
	
	Возврат ОбщиеПараметры;
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция СформироватьОписаниеБригадHTML(ФильтрТочкаПродаж) Экспорт
	
	ОписаниеБригадHTMLНачало = 
	"<!DOCTYPE html>
	|  <html lang='ru'>
	|    <head>
	|      <meta charset='utf-8'>
	|  <style>
	|  table {
	|    font-family: ""Arial"", Sans-Serif;
	|  	font-size: 14px;
	|  	color: #666666;
	|  	border-collapse: collapse;
	|  }
	|  th, td {
	|  	background: #FFEF9C;
	|  	color: #635129;
	|  	padding: 10px 20px;
	|  }
	|  td {
	|  	border-style: solid;
	|  	border-width: 0 1px 1px 0;
	|  	border-color: white;
	|    padding: 5px 5px;
	|  }
	|  td {
	|  	background: #F7F3DE;
	|  }
	|  a {
	|  	color: #635129;
	|  }
	|  </style>
	|    
	|    </head>
	|  <body>
	|    <table>
	|    <tr>
	|      <th>Бригада</th>
	|      <th>Описание бригады </th>
	|  
	|      </tr>";

	ОписаниеБригад = МодульОтчетов.ПолучитьТаблицуБригад(ФильтрТочкаПродаж);
	
	ОписаниеБригадHTMLПродолжение = "";
	Если ОписаниеБригад.Количество() >0 Тогда
		Для каждого СтрокаБригады из ОписаниеБригад Цикл
			Если НЕ ПустаяСтрока(СтрокаБригады.Описание) Тогда
				СсылкаНаЭлемент = ЗначениеВСтрокуВнутр(СтрокаБригады.Бригада);
				ОписаниеБригадHTMLПродолжение = ОписаниеБригадHTMLПродолжение +
				"     <tr>
				|      <td><a href = v8:" + СсылкаНаЭлемент + ">" + СтрокаБригады.Бригада + "</a></td>
				|      <td>" + СтрЗаменить(СтрокаБригады.Описание, Символы.ПС, "<br>") + "</td>
				|     </tr>";
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

	ОписаниеБригадHTMLПродолжение = ОписаниеБригадHTMLПродолжение +
	"</table></body></html>";
	
	ОписаниеБригадHTML = ОписаниеБригадHTMLНачало + ОписаниеБригадHTMLПродолжение;
	
	Возврат ОписаниеБригадHTML;
	
КонецФункции	

Функция ПолучитьМассивРеквизитовПоЦенам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ТоварыУслугиЦена");
	МассивИменЭлементов.Добавить("ТоварыУслугиСумма");
	МассивИменЭлементов.Добавить("ДеревоТоваровЦена");
	МассивИменЭлементов.Добавить("ДеревоТоваровСумма");
	
	Возврат МассивИменЭлементов;
	
КонецФункции
	
Функция ПолучитьМассивРеквизитовПоСкидкам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ТоварыУслугиПроцентСкидки");
	МассивИменЭлементов.Добавить("ТоварыУслугиСуммаСкидки");
	МассивИменЭлементов.Добавить("ДеревоТоваровПроцентСкидки");
	МассивИменЭлементов.Добавить("ДеревоТоваровСуммаСкидки");
	
	МассивИменЭлементов.Добавить("ВидСкидки");
	
	Возврат МассивИменЭлементов;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ВыплатаЗарплатыВНатуральнойФорме.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ЗаказПокупателя.ДобавитьКомандуСоздатьНаОснованииДляДокументаРозницы(КомандыСозданияНаОсновании, "ОбеспеченностьРозницыПоМонтажам");
	
	Документы.ЗаказПоставщику.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, "ОбеспеченностьРозницыПоМонтажам");
	
	Документы.Замена.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств") Тогда
		Документы.ЗаявкаНаРасходованиеДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
	
	// №9919	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗаработнойПлатыНаОснованииМонтажа") Тогда
		Документы.НачислениеЗарплаты.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
	
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОснованииОплатаКредитомМножественныйВыбор(КомандыСозданияНаОсновании);
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);

	Документы.ОприходованиеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании); //#16921 
	
	Документы.ПеремещениеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПлатежноеПоручениеИсходящее.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПоступлениеНаРасчетныйСчет.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПоступлениеТоваровИУслуг.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, "ОбеспеченностьРозницыПоМонтажам");
	
	Документы.Премия.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРезервирование") Тогда
		Документы.Резервирование.ДобавитьКомандуСоздатьНаОснованииДокументаРозницы(КомандыСозданияНаОсновании); // отдельная обработка на клиенте
		Документы.СнятиеРезервов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;

	Документы.СписаниеСРасчетногоСчета.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.СчетФактураВыданный.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.Штраф.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Монтаж"
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.Монтаж) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.Монтаж.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.Монтаж.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

Функция ДобавитьКомандуСоздатьНаОснованииРеализациюКлиенту(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.Монтаж) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.Монтаж.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = "Реализация клиенту"; //"Монтаж / Рекламация / Сервисная заявка";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДобавитьКомандуСоздатьНаОснованииВидОперацииРекламация(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.Монтаж) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.МонтажСоздатьНаОснованииВидОперацииРекламация";
		КомандаСоздатьНаОсновании.Представление = "Рекламация";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДобавитьКомандуСоздатьНаОснованииВидОперацииСервиснаяЗаявка(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.Монтаж) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.МонтажСоздатьНаОснованииВидОперацииСервиснаяЗаявка";
		КомандаСоздатьНаОсновании.Представление = "Сервисная заявка";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДобавитьКомандуСоздатьНаОснованииВидОперацииПродажа(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.Монтаж) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.МонтажСоздатьНаОснованииВидОперацииПродажа";
		КомандаСоздатьНаОсновании.Представление = "Продажа";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ПроверкиВводаНаОсновании

Процедура ПроверитьВозможностьВводаНаОсновании(МассивМонтажей, ТипСоздаваемогоДокумента=Неопределено) Экспорт
	
	МассивДокументов = Новый Массив;
	Если НЕ ТипЗнч(МассивМонтажей) = Тип("Массив") Тогда
		МассивДокументов.Добавить(МассивМонтажей);
	Иначе
		МассивДокументов = МассивМонтажей;
	КонецЕсли;
	
	Для каждого ДокументСсылка из МассивДокументов Цикл
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Монтаж") Тогда
			Если НЕ ДокументСсылка.Проведен Тогда				
				ТекстОшибки = НСтр("ru='Документ %Документ% не проведен. Ввод на основании разрешен только в проведенном состоянии'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументСсылка);	
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			//#9168
			Если ДокументСсылка.Бригада.Пустая() Тогда
				Если ТипСоздаваемогоДокумента = Тип("ДокументСсылка.НачислениеЗарплаты") 
					ИЛИ ТипСоздаваемогоДокумента = Тип("ДокументСсылка.Премия")	
					ИЛИ ТипСоздаваемогоДокумента = Тип("ДокументСсылка.Штраф")
					Тогда				
					ТекстОшибки = НСтр("ru='В документе %Документ% не заполнена бригада. Ввод на основании не разрешен'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументСсылка);	
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;			
			КонецЕсли;					
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
	