Перем ЗаписиВРегистрИстории; //#8030

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	Если НЕ СрокМонтажа = Перечисления.СрокиМонтажа.ДатаМонтажаНеОпределена Тогда
		ДатаМонтажа = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	Склад = ПараметрыСеанса.Пользователь.СкладМатериаловРозница;
	ИДМонтажа = Новый УникальныйИдентификатор;

	ТипДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);	
	
	Если ТипДанныеЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			ВидОперации = Справочники.ВидыМонтажа.ПустаяСсылка();
			Если ДанныеЗаполнения.Свойство("ВидОперации")  Тогда
				ВидОперации = ДанныеЗаполнения.ВидОперации;
			КонецЕсли;
			
			Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
				ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения.Основание, ВидОперации);
			ИначеЕсли ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.Лид") Тогда
				ЗаполнитьПоЛиду(ДанныеЗаполнения.Основание);
			КонецЕсли;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("ВидОперации")  Тогда
			ВидОперации = ДанныеЗаполнения.ВидОперации;
			
		КонецЕсли;
		
	ИначеЕсли ТипДанныеЗаполнения = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения);		
		
	ИначеЕсли ТипДанныеЗаполнения = Тип("ДокументСсылка.Лид") Тогда
		ЗаполнитьПоЛиду(ДанныеЗаполнения);		
		
	КонецЕсли;
	
	// инициализация по умолчанию
	Если СкладТоваров.Пустая() Тогда
		СкладТоваров = ОбщийМодульСервер.НастройкаПользователя("СкладРозница");
	КонецЕсли;          
	
	Результат = Справочники.РезультатыМонтажа.ВРаботе;
	// №12802 УДАЛИТЬ_ДатаСоздания = ТекущаяДатаСеанса();
	
	Если ВидОперации.Пустая() Тогда
		ВидОперации = Справочники.ВидыМонтажа.Монтаж;
	КонецЕсли;
	
	//#12131 Рекламация - это бесплатно
	Если ВидОперации = Справочники.ВидыМонтажа.Рекламация Тогда
		СуммаДокумента = 0;
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			ТекущаяСтрока.Цена = 0;
			ТекущаяСтрока.Сумма = 0;
			ТекущаяСтрока.ПроцентСкидки = 0;
			ТекущаяСтрока.СуммаСкидки = 0;
			ТекущаяСтрока.СуммаНДС = 0;
			ТекущаяСтрока.ЦенаПоПрайсу = 0;
			ТекущаяСтрока.СуммаПоПрайсу = 0;
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из Материалы Цикл
			ТекущаяСтрока.Цена = 0;
			ТекущаяСтрока.Сумма = 0;
		КонецЦикла;
	КонецЕсли;
	
	//заполним чек-лист
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекЛистМонтажа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЧекЛистМонтажа КАК ЧекЛистМонтажа
	|ГДЕ
	|	ЧекЛистМонтажа.ДобавлятьАвтоматически";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЧекЛист.Добавить();
		НоваяСтрока.Значение = Выборка.ССылка;
	КонецЦикла;
	
	ОбщийМодуль.ОбработкаЗаполненияПодписей(ЭтотОбъект);
	
	СтатьяДоходов  = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, "Доход");
	СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, "Расход", Ложь);
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты();
	
	ДатаМонтажа  = Дата(1, 1, 1);
	ВремяНачала  = Дата(1, 1, 1, 0, 0, 0);
	ВремяОкончания = Дата(1, 1, 1, 0, 0, 0);
	ДатаЗакрытия = Дата(1, 1, 1);
	//НаНесколькоДней = Ложь;
	СрокМонтажа = Перечисления.СрокиМонтажа.МонтажНаОдинДень;
	ГрафикМонтажей.Очистить();
	ИДМонтажа = Новый УникальныйИдентификатор;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если (ПолучитьФункциональнуюОпцию("ИспользоватьПулМонтажей")
			ИЛИ (НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПулМонтажей") И СрокМонтажа = Перечисления.СрокиМонтажа.ДатаМонтажаНеОпределена)) //++ №11685
		И (Результат = Справочники.РезультатыМонтажа.ВРаботе ИЛИ Результат = Справочники.РезультатыМонтажа.Отменен)
		И НЕ ПроверяемыеРеквизиты.Найти("Бригада") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Бригада"));
	КонецЕсли;
	
	//++ №12721
	Если ВидОперации = Справочники.ВидыМонтажа.Продажа Тогда
		
		Если НЕ ПроверяемыеРеквизиты.Найти("Адрес") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Адрес"));
		КонецЕсли;
		
		Если НЕ ПроверяемыеРеквизиты.Найти("Бригада") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Бригада"));
		КонецЕсли;
		
		Если НЕ ПроверяемыеРеквизиты.Найти("СпособРаспределенияВыработки") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СпособРаспределенияВыработки"));
		КонецЕсли;
		
		// #16346
		Если НЕ ПроверяемыеРеквизиты.Найти("Результат") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Результат"));
		КонецЕсли;
		
	КонецЕсли;
	//-- №12721
	
	// #13826 
	Для Индекс = 0 по Материалы.Количество()-1 Цикл
		СтрокаТабличнойЧасти = Материалы[Индекс];
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаТабличнойЧасти.Номенклатура) Тогда
			// №14925 в текст ошибки добавляем номенклатуру
			//ТекстОшибки = "В строке " + Строка(Индекс+1) + " таблицы ""Материалы"" выбрана номенклатура-услуга";
			ТекстОшибки = СтрШаблон("В строке %1 таблицы ""Материалы"" выбрана номенклатура ""%2"" с видом ""Услуга"".", Строка(Индекс+1), Материалы[Индекс].Номенклатура);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Материалы["+Формат(Индекс, "ЧГ=0")+"].Номенклатура", , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// #16346
	Если ВидОперации = Справочники.ВидыМонтажа.Продажа Тогда
		Результат = Справочники.РезультатыМонтажа.ПустаяСсылка();
		ДатаВыполнения = Дата; // для движения регистров
	КонецЕсли;
	
	//#16346 ЗаказДоговор - самый главный ЗД для Сервиса и Рекламации		
	Если ЗначениеЗаполнено(ЗаказДоговор) 
		И (ВидОперации = Справочники.ВидыМонтажа.Монтаж ИЛИ ВидОперации = Справочники.ВидыМонтажа.Продажа) Тогда
		ЗаказДоговор = Документы.ЗаказДоговор.ПустаяСсылка();
	КонецЕсли;

	Если НЕ СрокМонтажа = Перечисления.СрокиМонтажа.МонтажНаНесколькоДней Тогда
		ГрафикМонтажей.Очистить();
	Иначе
		КолСтрок = ГрафикМонтажей.Количество();
		Для Инд=1 по КолСтрок Цикл
			СтрокаТЧ = ГрафикМонтажей[КолСтрок - Инд];
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ВремяНачала) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.ВремяОкончания) Тогда
				ГрафикМонтажей.Удалить(КолСтрок - Инд);	
			КонецЕсли;
		КонецЦикла;
		Если ГрафикМонтажей.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ГрафикМонтажей[0]);
		Иначе
			ДатаМонтажа    = Дата(1,1,1);
			ВремяНачала    = Дата(1,1,1);
			ВремяОкончания = Дата(1,1,1);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИДМонтажа) Тогда
		ИДМонтажа = Новый УникальныйИдентификатор;
	КонецЕсли;
	Для Каждого ТекСтрока Из ГрафикМонтажей Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ИДМонтажа) Тогда
			ТекСтрока.ИДМонтажа = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	ДополнительныеСвойства.Вставить("ПредДатаМонтажа", Ссылка.ДатаМонтажа);
	ДополнительныеСвойства.Вставить("ПредВремяНачала", Ссылка.ВремяНачала);
	ДополнительныеСвойства.Вставить("ПредВремяОкончания", Ссылка.ВремяОкончания);
	ТребуетсяОтправкаСМС = Ссылка.ДатаМонтажа <> ДатаМонтажа ИЛИ Ссылка.ВремяНачала <> ВремяНачала ИЛИ Ссылка.ВремяОкончания <> ВремяОкончания;
	ДополнительныеСвойства.Вставить("ТребуетсяОтправкаСМС", ТребуетсяОтправкаСМС);
	
	//если выработка общая, то тарифы надо почистить для корректного вычисления выработки
	// закомментировано: чтобы не очищались заполненные тарифы. в модуле зарплата необходимость учета по тарифам 
	// будем смотреть в зависимости от способа распределения по монтажу, 
	// если там "общая", то тариф не будем учитывать если даже заполнен 
	//Если СпособРаспределенияВыработки = Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.ПоКоэффициентам тогда
	//	Для каждого СтрокаТЧ из Исполнители Цикл
	//		СтрокаТЧ.ТарифИсполнителя = Справочники.ТарифыИсполнителей.ПустаяСсылка();
	//	КонецЦикла;
	//КонецЕсли;			
	
	////проверяем право редактировать выполненные и закрытые монтажи  - проверка перенесена в форму при её создании
	//Если (Результат = Справочники.РезультатыМонтажа.Выполнен
	//	или Результат = Справочники.РезультатыМонтажа.Закрыт) 
	//	И НЕ ПараметрыСеанса.РазрешеноРедактироватьВыполненныеИЗакрытыеМонтажи
	//	И НЕ (РольДоступна("АдминистраторСистемы") или РольДоступна("ПолныеПрава"))
	//	Тогда
	//	Отказ = Истина;
	//	Сообщить("Не достаточно прав на изменение выполненного или проведенного монтажа");
	//	Возврат;
	//КонецЕсли; 
	
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда - перенесено в модуль формы
	//	мДатаМонтажа 	= Ссылка.ДатаМонтажа;
	//	мВремяНачала 	= Ссылка.ВремяНачала;
	//	мВремяОкончания = Ссылка.ВремяОкончания;
	//КонецЕсли;
	
	//#6303
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И НЕ Результат = Справочники.РезультатыМонтажа.Отменен 
		И ЗначениеЗаполнено(Основание) и ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		СтруктураСоглашениеОРасторжении = Документы.ЗаказДоговор.ЕстьСоглашениеОРасторжении(Основание);
		ЕстьСоглашениеОРасторжении = СтруктураСоглашениеОРасторжении.ЕстьСоглашениеОРасторжении;
		Если НЕ ПометкаУдаления И ЕстьСоглашениеОРасторжении Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         			"По заказ-договору " + Основание + " имеется соглашение о расторжении. Проведение документа невозможно!", , , , Отказ);	
		КонецЕсли;
	КонецЕсли;
	
	//#16346
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И ЗначениеЗаполнено(Основание) 
		И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") 
		И НЕ ВидОперации = Справочники.ВидыМонтажа.Продажа
		Тогда
		ВидЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ВидЗаказа");
		СоответствующийВидОперацииМонтажа = ОбщийМодульСервер.ВидОперацииМонтажаПоВидуЗаказа(ВидЗаказа);
		
		Если НЕ ВидОперации = СоответствующийВидОперацииМонтажа Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         			"Вид операции не соответствует виду заказ-договора. Проведение документа невозможно!", ЭтотОбъект, "ВидОперации", , Отказ);	
		КонецЕсли;
	КонецЕсли;
	
	//#8030
	Если Отказ Тогда Возврат; КонецЕсли;
	
	ПредыдущийГрафикМонтажей = ГрафикМонтажей.ВыгрузитьКолонки(); //только колонки
	ПредыдущийГрафикМонтажей.Колонки.Добавить("Бригада");
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ПредыдущийГрафикМонтажей = Ссылка.ГрафикМонтажей.Выгрузить();
		ПредыдущийГрафикМонтажей.Колонки.Добавить("Бригада");
		Если ЗначениеЗаполнено(Ссылка.ДатаМонтажа) И ЗначениеЗаполнено(Ссылка.ВремяНачала) Тогда
			СтрокаМонтажа = ПредыдущийГрафикМонтажей.Вставить(0);
			СтрокаМонтажа.ДатаМонтажа 		= Ссылка.ДатаМонтажа;
			СтрокаМонтажа.ВремяНачала 		= Ссылка.ВремяНачала;
			СтрокаМонтажа.ВремяОкончания 	= Ссылка.ВремяОкончания;
			СтрокаМонтажа.ИДМонтажа 		= Ссылка.ИДМонтажа;
		КонецЕсли;
		ПредыдущийГрафикМонтажей.ЗаполнитьЗначения(Ссылка.Бригада, "Бригада");
	Иначе
		// пустая таблица ПредыдущийГрафикМонтажей
	КонецЕсли;
	ТекущийГрафикМонтажей = ГрафикМонтажей.Выгрузить();
	Если ЗначениеЗаполнено(ДатаМонтажа) И ЗначениеЗаполнено(ВремяНачала) Тогда
		СтрокаМонтажа = ТекущийГрафикМонтажей.Вставить(0);
		СтрокаМонтажа.ДатаМонтажа 		= ДатаМонтажа;
		СтрокаМонтажа.ВремяНачала 		= ВремяНачала;
		СтрокаМонтажа.ВремяОкончания 	= ВремяОкончания;
		СтрокаМонтажа.ИДМонтажа 		= ИДМонтажа;
	КонецЕсли;
	ТекущийГрафикМонтажей.Колонки.Добавить("Бригада");
	ТекущийГрафикМонтажей.ЗаполнитьЗначения(Бригада, "Бригада");
	ДобавитьЗаписиВИсториюПоМонтажам(ПредыдущийГрафикМонтажей, ТекущийГрафикМонтажей);
	
	//#9168
	Если НЕ ЗначениеЗаполнено(Бригада) Тогда
		Исполнители.Очистить();
		Выработка.Очистить();
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
	// №14925 проверка спецификаций на владельца
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.Спецификация) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ТекущаяСтрока.Номенклатура = ТекущаяСтрока.Спецификация.Владелец Тогда
				
				ТекстСообщения = СтрШаблон("В строке %1 таблицы ""Товары и услуги"" по номенклатуре ""%2"" указана спецификация, у которой владелец другая номенклатура.", ТекущаяСтрока.НомерСтроки, ТекущаяСтрока.Номенклатура);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
			
	Если Результат = Справочники.РезультатыМонтажа.Отменен Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьСтатусЗакрыт = СозданПриИспользованииСтатусаЗакрыт; // №1083 Константы.ИспользоватьСтатусЗакрытВМонтаже.Получить();
	ДатаДвижения = Дата;
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	ЭтоПродажа = (ВидОперации = Справочники.ВидыМонтажа.Продажа); // №12721
	
	МонтажВыполненИлиЗакрыт = Результат = Справочники.РезультатыМонтажа.Выполнен 
							ИЛИ Результат = Справочники.РезультатыМонтажа.Закрыт
							ИЛИ ЭтоПродажа;
		
	// регистр Монтажи
	Если НЕ ЭтоПродажа Тогда // №12721
		
		Если НЕ СрокМонтажа = Перечисления.СрокиМонтажа.МонтажНаНесколькоДней Тогда
			Если НЕ СрокМонтажа = Перечисления.СрокиМонтажа.ДатаМонтажаНеОпределена Тогда
				Движения.Монтажи.Записывать = Истина;
				Движение = Движения.Монтажи.Добавить();
				Движение.ДокументМонтаж = Ссылка;
				Движение.Дата = ДатаМонтажа;
				Движение.ВремяНачала = ВремяНачала;
				Движение.ВремяОкончания = ВремяОкончания;
				Движение.ИДМонтажа = ИДМонтажа;
				Движение.Бригада = Бригада;
				Движение.Монтаж = Ссылка;
				Движение.Контрагент = Контрагент;
				Движение.Адрес = Адрес;
				Движение.Результат = Результат;
				Движение.СуммаДокумента = СуммаДокумента;
				Движение.ТочкаПродаж = ТочкаПродаж; //#9168
				Движение.ИдентификаторСтрокой = Строка(ИДМонтажа);
				Движение.Геометка = Геометка;
			КонецЕсли;
		Иначе
			Движения.Монтажи.Записывать = Истина;
			Для каждого СтрокаТЧ из ГрафикМонтажей Цикл
				Движение = Движения.Монтажи.Добавить();
				Движение.ДокументМонтаж = Ссылка;
				Движение.Дата = СтрокаТЧ.ДатаМонтажа;			
				Движение.ВремяНачала = СтрокаТЧ.ВремяНачала;
				Движение.ВремяОкончания = СтрокаТЧ.ВремяОкончания;
				Движение.ИДМонтажа = СтрокаТЧ.ИДМонтажа;
				Движение.Бригада = Бригада;
				Движение.Монтаж = Ссылка;
				Движение.Контрагент = Контрагент;
				Движение.Адрес = Адрес;
				Движение.Результат = Результат;
				Движение.СуммаДокумента = СуммаДокумента;
				Движение.ИндексСтроки = СтрокаТЧ.НомерСтроки;
				Движение.ТочкаПродаж = ТочкаПродаж; //#9168
				Движение.ИдентификаторСтрокой = Строка(СтрокаТЧ.ИДМонтажа);
				Движение.Геометка = Геометка;
			КонецЦикла
		КонецЕсли;
		
	КонецЕсли;	
		
	СебестоимостьТоваров = 0;
	СебестоимостьПотолков = 0;
	
	Если МонтажВыполненИлиЗакрыт Тогда
		
		// регистры ТоварыНаСкладах, МонтажСебестоимостьТоваров, МонтажСебестоимостьМатериалов
		Движения.ТоварыНаСкладах.Записывать = Истина;
		Движения.МонтажСебестоимостьМатериалов.Записывать = Истина;
		Движения.МонтажСебестоимостьТоваров.Записывать = Истина;
		
		//материалы
		ТаблицаСписанияМатериалы = Материалы.Выгрузить();
		ТаблицаСписанияМатериалы.Очистить();
		Для Каждого ТекущаяСтрока Из Материалы Цикл
			Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
				НоваяСтрока = ТаблицаСписанияМатериалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			КонецЕсли;
		КонецЦикла;
		
		//++ №6629 для контроля по резервам
		ТаблицаСписанияМатериалы.Колонки.Добавить("Заказ", новый ОписаниеТипов("ДокументСсылка.Монтаж"));
		ТаблицаСписанияМатериалы.ЗаполнитьЗначения(Ссылка, "Заказ");
		//-- №6629
		
		//++ №8793 нужно свернуть, чтобы корректно списать себестоимость
		ТаблицаСписанияМатериалы.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Коэффициент, Заказ", "Количество"); 
		//-- №8793
		
		Если НЕ ТаблицаСписанияМатериалы.Количество() = 0
			И НЕ ЭтоПродажа // №12721
		Тогда
			Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, Склад, ТаблицаСписанияМатериалы, ДатаВыполнения); // №12802 было: ДатаДвижения);
			Если Отказ Тогда
				Возврат;
			Иначе
				Для Каждого Товар Из ТаблицаСписанияМатериалы Цикл
					Расход = Движения.ТоварыНаСкладах.Добавить();
					Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
					Расход.Период = ДатаВыполнения; // №12802 было: ДатаДвижения;
					Расход.Организация = ОрганизацияТоваров;
					Расход.Склад = Склад;
					Расход.Номенклатура = Товар.Номенклатура;
					Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
					Расход.СерияНоменклатуры = Товар.СерияНоменклатуры;
					Расход.Количество = Товар.Количество * Товар.Коэффициент;
					//#8288
					//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, Склад, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
					СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ДатаВыполнения, ОрганизацияТоваров, Склад, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
					Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
					Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
					
					Если Расход.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал
						или Расход.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
						СебестоимостьПотолков = СебестоимостьПотолков + Расход.Сумма;
					Иначе
						СебестоимостьТоваров = СебестоимостьТоваров + Расход.Сумма;
					КонецЕсли;
					
					РасходМатериалы = Движения.МонтажСебестоимостьМатериалов.Добавить();
					ЗаполнитьЗначенияСвойств(РасходМатериалы, Расход);
					РасходМатериалы.ЗаказДоговор = Основание;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		//товары
		ТаблицаСписанияТовары = ТоварыУслуги.Выгрузить();
		ТаблицаСписанияТовары.Очистить();
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
				НоваяСтрока = ТаблицаСписанияТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				Если СлужебныйКоличествоКСписаниюНеСоответствуетКоличествуПроданного Тогда
					НоваяСтрока.Количество = ТекущаяСтрока.КоличествоКСписанию;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		//++ №6629 для контроля по резервам
		ТаблицаСписанияТовары.Колонки.Добавить("Заказ", новый ОписаниеТипов("ДокументСсылка.Монтаж"));
		ТаблицаСписанияТовары.ЗаполнитьЗначения(Ссылка, "Заказ");
		//-- №6629
		
		Если НЕ ТаблицаСписанияТовары.Количество() = 0 Тогда
			Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, СкладТоваров, ТаблицаСписанияТовары, ДатаВыполнения); // №12802 было: ДатаДвижения);
			Если Отказ Тогда
				Возврат;
			Иначе
				Для Каждого Товар Из ТаблицаСписанияТовары Цикл
					Расход = Движения.ТоварыНаСкладах.Добавить();
					Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
					Расход.Период = ДатаВыполнения; // №12802 было: ДатаДвижения;
					Расход.Организация = ОрганизацияТоваров;
					Расход.Склад = СкладТоваров;
					Расход.Номенклатура = Товар.Номенклатура;
					Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
					Расход.СерияНоменклатуры = Товар.СерияНоменклатуры;
					Расход.Количество = Товар.Количество * Товар.Коэффициент;
					//#8288
					//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, СкладТоваров, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
					СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ДатаВыполнения, ОрганизацияТоваров, СкладТоваров, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
					Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
					Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
					
					Если Расход.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал
						или Расход.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
						СебестоимостьПотолков = СебестоимостьПотолков + Расход.Сумма;
					Иначе
						СебестоимостьТоваров = СебестоимостьТоваров + Расход.Сумма;
					КонецЕсли;
					
					Если НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Товар.Номенклатура) Тогда
						РасходТовары = Движения.МонтажСебестоимостьТоваров.Добавить();
						ЗаполнитьЗначенияСвойств(РасходТовары, Расход);
						РасходТовары.ЗаказДоговор = Основание;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	
		// регистр ТоварыВРезервеНаСкладах - Расход (15815) (списание всех резервов)	
		Движения.ТоварыВРезервеНаСкладах.Записывать = Истина;
		Если Результат = Справочники.РезультатыМонтажа.Выполнен	 Тогда
			АктуальнаяДатаСписания = ДатаВыполнения;
		КонецЕсли;
		Если Результат = Справочники.РезультатыМонтажа.Закрыт Тогда
			АктуальнаяДатаСписания = ДатаЗакрытия;
		КонецЕсли;
		// Списание по товарам
		Выборка = РегистрыНакопления.ТоварыВРезервеНаСкладах.КонтрольРезерва(Ссылка, Организация, , АктуальнаяДатаСписания, ТоварыУслуги);
		Пока Выборка.Следующий() Цикл
			Если Выборка.КоличествоРезерве > 0 Тогда
				Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = АктуальнаяДатаСписания;
				Движение.ВидТабличнойЧасти = Выборка.ВидТабличнойЧасти;
				Движение.ДокументРезерва = Ссылка;
				Движение.Организация = Организация;
				Движение.Склад = Выборка.Склад;
				Движение.Номенклатура = Выборка.Номенклатура;
				Движение.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
				Движение.СерияНоменклатуры = Выборка.СерияНоменклатуры;
				Движение.Количество = Выборка.КоличествоРезерве;
			КонецЕсли;
		КонецЦикла;
		// Списание по материалам
		Выборка = РегистрыНакопления.ТоварыВРезервеНаСкладах.КонтрольРезерва(Ссылка, Организация, , АктуальнаяДатаСписания, Материалы);
		Пока Выборка.Следующий() Цикл
			Если Выборка.КоличествоРезерве > 0 Тогда
				Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = АктуальнаяДатаСписания;
				Движение.ВидТабличнойЧасти = Выборка.ВидТабличнойЧасти;
				Движение.ДокументРезерва = Ссылка;
				Движение.Организация = Организация;
				Движение.Склад = Выборка.Склад;
				Движение.Номенклатура = Выборка.Номенклатура;
				Движение.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
				Движение.СерияНоменклатуры = Выборка.СерияНоменклатуры;
				Движение.Количество = Выборка.КоличествоРезерве;
			КонецЕсли;
		КонецЦикла;		
		
		// регистр ВзаиморасчетыСКонтрагентами Приход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;		
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаВыполнения; // №12802 было: ДатаДвижения;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = ДоговорКонтрагента;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаДокумента);
		
		//Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;		
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения =ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаВыполнения; // №12802 было: ДатаДвижения;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = ДоговорКонтрагента;
		Движение.Валюта = Валюта;
		Движение.Сумма = СуммаДокумента;
		
		// регистр ВзаиморасчетыСКонтрагентамиПоЗаказам Приход
		Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Записывать = Истина;		
		Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда			
			Движение = Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ДатаВыполнения; // №12802 было: ДатаДвижения;
			Движение.Заказ = Основание;
			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаДокумента);			
		КонецЕсли;
			
		// заказы покупателей
		Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда			
			Движения.ЗаказыПокупателей.Записывать = Истина;			
			Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл				
				Движение = Движения.ЗаказыПокупателей.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = ДатаВыполнения; // №12802 было: ДатаДвижения;
				Движение.ЗаказНаПроизводство = Основание;
				Движение.Организация = Организация;
				Движение.Контрагент = Контрагент;						
				Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
				Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
				Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
				Движение.Сумма = ТекущаяСтрока.Сумма; //#9777				
			КонецЦикла;			
		КонецЕсли;
		
		//продажи
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Движения.Продажи.Записывать = Истина;		
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			
			Движение = Движения.Продажи.Добавить();
			Движение.Период = ДатаВыполнения; // №12802 было: ДатаДвижения;
			Движение.Организация = Организация;
			//Движение.Подразделение = Подразделение;
			Движение.Склад = СкладТоваров; //#12367
			Движение.ДоговорКонтрагента = ДоговорКонтрагента;
			Движение.ДокументПродажи = Ссылка;
			Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
			Движение.Контрагент = Контрагент;
			Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
			Движение.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;         //#14300
			Движение.КоличествоВЕдиницахДокумента = ТекущаяСтрока.Количество;	//#14300
			Движение.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Валюта, ВалютаУчета, Дата, ТекущаяСтрока.Сумма);
			Движение.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма); //#8288
			
		КонецЦикла;
		
		// регистр КонверсияВходящихКонтактов
		Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Если ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.Лид") И НЕ Основание.Основание.Пустая() Тогда
				
				Движения.КонверсияВходящихКонтактов.Записывать = Истина;
				
				Движение = Движения.КонверсияВходящихКонтактов.Добавить();
				Движение.Период = ДатаВыполнения; // №12802 было: ДатаДвижения;
				Движение.Контакт = Основание.Основание;
				Движение.РекламныйИсточник = Основание.Основание.РекламныйИсточник;
				Движение.ТочкаПродаж = Основание.Основание.ТочкаПродаж;
				Движение.КоличествоМонтажей = 1;
				Движение.КоличествоМонтажейУспех = 1;
				
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Если ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.Лид") И НЕ Основание.Основание.Пустая() Тогда
				
				Движения.КонверсияВходящихКонтактов.Записывать = Истина;
				
				Движение = Движения.КонверсияВходящихКонтактов.Добавить();
				Движение.Период = ДатаДвижения;
				Движение.Контакт = Основание.Основание;
				Движение.РекламныйИсточник = Основание.Основание.РекламныйИсточник;
				Движение.ТочкаПродаж = Основание.Основание.ТочкаПродаж;
				Движение.КоличествоМонтажей = 1;
				
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли; // МонтажВыполненИлиЗакрыт
	
	//регистр ВыработкаИсполнителейРозницы
	Если (Результат = Справочники.РезультатыМонтажа.Выполнен И НЕ ИспользоватьСтатусЗакрыт)
		ИЛИ (Результат = Справочники.РезультатыМонтажа.Закрыт И ИспользоватьСтатусЗакрыт) 
		ИЛИ ЭтоПродажа
		Тогда 
		
		ДатаРасчетаВыработки = ДатаВыполнения; // №12802 по умолчанию дата выполнения, было: Дата;
		Если (Результат = Справочники.РезультатыМонтажа.Закрыт И ИспользоватьСтатусЗакрыт) Тогда
			ДатаРасчетаВыработки = ДатаЗакрытия;
		КонецЕсли;
		Движения.ВыработкаИсполнителейРозницы.Записывать = Истина;
		
		Если РучнаяКорректировкаВыработки Тогда // №1083 теперь доступно ручное изменение зарплаты
			НаборЗаписейПоВыработке = Выработка.Выгрузить();
			ДополнитьТаблицуВыработки(НаборЗаписейПоВыработке, ДатаРасчетаВыработки);
		Иначе
			НаборЗаписейПоВыработке = Зарплата.РассчитатьВыработкуПоДокументу(Ссылка, ДатаРасчетаВыработки);
		КонецЕсли;	
		
		Для Каждого СтрокаВыработки Из НаборЗаписейПоВыработке Цикл
			Движение = Движения.ВыработкаИсполнителейРозницы.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаВыработки);			
		КонецЦикла;
		
	КонецЕсли;
	
	// через заказ-договор
	Движения.ВыполнениеМонтажейПоДоговорам.Записывать = Истина;
	
	Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") 
		И НЕ ЭтоПродажа Тогда
		
		Если НЕ Результат = Справочники.РезультатыМонтажа.Отменен Тогда			
			Движение = Движения.ВыполнениеМонтажейПоДоговорам.Добавить();
			Движение.Запланирован = 1;
			Движение.ЗаказДоговор = Основание;
			Движение.Период = Дата;			
		КонецЕсли;
		
		Если Результат = Справочники.РезультатыМонтажа.Выполнен Или Результат = Справочники.РезультатыМонтажа.Закрыт Тогда			
			Движение = Движения.ВыполнениеМонтажейПоДоговорам.Добавить();
			Движение.Выполнен = 1;
			Движение.ЗаказДоговор = Основание;
			Движение.Период = ДатаВыполнения; // №12802 было: ДатаДвижения;			
		КонецЕсли;
		
	КонецЕсли;
	
	// РасчетыПоЗаказам
	Если Константы.ВестиРасчетыПоЗаказамПоМонтажу.Получить() Тогда
		
		Движения.РасчетыПоЗаказам.Записывать = Истина;
		
		Движение = Движения.РасчетыПоЗаказам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Заказ = Ссылка;
		Движение.Сумма = СуммаДокумента;
		Движение.Контрагент = Контрагент; // №6496 добавлен контрагент в измерение
		
	КонецЕсли;
	
	// регистр ДоходыРасходы
	Если МонтажВыполненИлиЗакрыт И ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда	
		Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//метод "по начислению"
			Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движения.ДоходыРасходы.Записывать = Истина;			
			Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяДоходов.Пустая(), ТекущаяСтрока.СтатьяДоходов, СтатьяДоходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= ДатаВыполнения; // №12802 было: ДатаДвижения;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
				Движение.СуммаРасходов 	= 0;					
			КонецЦикла;	
			
			Если НЕ СтатьяРасходов.Пустая() И СуммаДополнительныхЗатрат > 0 Тогда
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= ДатаВыполнения; // №12802 было: ДатаДвижения;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= СтатьяРасходов;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= 0;
				Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаДополнительныхЗатрат);
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;
	
	//ПотребностьВМатериалахДляМонтажа
	Если НЕ ЭтоПродажа Тогда // №12721
	
		Движения.ПотребностьВМатериалахДляМонтажа.Записывать = Истина;
		ПериодДвижения = Дата; // №12802 было: ?(УДАЛИТЬ_ДатаСоздания = Дата(1,1,1), Дата, УДАЛИТЬ_ДатаСоздания);
		ВариантПеремещенияТоваровИзЗаказДоговора = Константы.ВариантПеремещенияТоваровИзЗаказДоговора.Получить();
		// 0 - только материалы 
		// 1 - материалы, товары 
		// 2 - материалы, товары, потолки
		Для Каждого ТекСтрокаТовары Из Материалы Цикл
			Если НЕ ТекСтрокаТовары.Номенклатура.Пустая()
				И НеконтролируемыеМатериалы.Найти(ТекСтрокаТовары.Номенклатура, "Номенклатура")=Неопределено  //#6297				
				Тогда 
				Приход = Движения.ПотребностьВМатериалахДляМонтажа.Добавить();
				Приход.Период 							= ПериодДвижения;
				Приход.ВидДвижения 						= ВидДвиженияНакопления.Приход;
				Приход.Монтаж 							= Ссылка;
				Приход.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
				Приход.Количество 						= ТекСтрокаТовары.Количество * ТекСтрокаТовары.Коэффициент;
			КонецЕсли;	
		КонецЦикла;
		
		Для Каждого ТекСтрокаТовары Из ТоварыУслуги Цикл
			Если НЕ ТекСтрокаТовары.Номенклатура.Пустая() 
				И НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаТовары.Номенклатура)
				И НеконтролируемыеМатериалы.Найти(ТекСтрокаТовары.Номенклатура, "Номенклатура")=Неопределено  //#6297
				Тогда
				ЭтоПотолок = Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекСтрокаТовары.Номенклатура);
				Если ВариантПеремещенияТоваровИзЗаказДоговора = 1 И НЕ ЭтоПотолок Тогда					
					Приход = Движения.ПотребностьВМатериалахДляМонтажа.Добавить();
					Приход.Период 							= ПериодДвижения;
					Приход.ВидДвижения 						= ВидДвиженияНакопления.Приход;
					Приход.Монтаж 							= Ссылка;
					Приход.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
					Приход.Количество 						= ТекСтрокаТовары.Количество * ТекСтрокаТовары.Коэффициент;
				ИначеЕсли ВариантПеремещенияТоваровИзЗаказДоговора = 2 Тогда
					Приход = Движения.ПотребностьВМатериалахДляМонтажа.Добавить();
					Приход.Период 							= ПериодДвижения;
					Приход.ВидДвижения						= ВидДвиженияНакопления.Приход;
					Приход.Монтаж 							= Ссылка;
					Приход.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
					Приход.Количество 						= ТекСтрокаТовары.Количество * ТекСтрокаТовары.Коэффициент;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// ПоступленияДляРозницыОтПроизодства
	Если (Результат = Справочники.РезультатыМонтажа.Выполнен И НЕ ИспользоватьСтатусЗакрыт)
		ИЛИ (Результат = Справочники.РезультатыМонтажа.Закрыт И ИспользоватьСтатусЗакрыт)
		И ЗначениеЗаполнено(Основание) 
		И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
	
		НомерРозничногоДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "НомерДоговора");
		
		Если НЕ ПустаяСтрока(НомерРозничногоДоговора) Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("НомерРозничногоДоговора", НомерРозничногоДоговора);
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеРегистра.Номенклатура КАК Номенклатура,
			|	ДанныеРегистра.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ДанныеРегистра.СерияНоменклатуры КАК СерияНоменклатуры,
			|	ДанныеРегистра.КоличествоОборот КАК КоличествоОборот
			|ИЗ
			|	РегистрНакопления.ПоступленияДляРозницыОтПроизодства.Обороты(
			|			,
			|			,
			|			Авто,
			|			Организация = &Организация
			|				И НомерРозничногоДоговора = &НомерРозничногоДоговора) КАК ДанныеРегистра
			|ГДЕ
			|	ДанныеРегистра.Регистратор ССЫЛКА Документ.ПоступлениеТоваровИУслуг";
			
			ТаблицаОстатковОтПроизводства = Запрос.Выполнить().Выгрузить();
			
			Движения.ПоступленияДляРозницыОтПроизодства.Записывать = Истина;
			
			Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
				
				СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры");
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
				
				НайденныеСтроки = ТаблицаОстатковОтПроизводства.НайтиСтроки(СтруктураПоиска);
				
				Если НЕ НайденныеСтроки.Количество() = 0 Тогда
					
					Движение = Движения.ПоступленияДляРозницыОтПроизодства.Добавить();
					Движение.Период = ДатаВыполнения; // №12802 было: Дата;
					Движение.Организация = Организация;
					Движение.НомерРозничногоДоговора = НомерРозничногоДоговора;				
					Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
					Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
					Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;				
					Движение.Количество = - ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#8030
	Если ТипЗнч(ЗаписиВРегистрИстории) = Тип("ТаблицаЗначений") Тогда 
		Для каждого СтрокаЗаписи из ЗаписиВРегистрИстории Цикл
			РегистрыСведений.ИсторияМонтажа.ДобавитьЗаписьВИсторию(Ссылка, СтрокаЗаписи.Дата, СтрокаЗаписи.Пользователь, СтрокаЗаписи.ИДЗаписи, СтрокаЗаписи.Комментарий);	
		КонецЦикла;
	КонецЕсли;
	
	// #12209 перенесено в модуль объекта, так как не формируется смс при изменении через График монтажей
	Если Не Отказ
		И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ДополнительныеСвойства.ТребуетсяОтправкаСМС
		И Результат = Справочники.РезультатыМонтажа.ВРаботе 
		И СМСОтправлятьПриНазначенииМонтажа
		И РаботаССМС.ИспользоватьОтправкуСМС() 
		И РаботаССМС.ОтправлятьСМСОЗапланированномМонтаже() 
		И Константы.АвтоматическаяРассылкаСМС.Получить()
		Тогда
		
		НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		НомерТелефона = РаботаССМС.ПодготовитьНомерТелефонаДляОтправкиСМС(СокрЛП(НомерТелефона));
		Если НЕ ПустаяСтрока(НомерТелефона) И ДатаМонтажаНазначена() Тогда
			Если РаботаССМС.ОтправлятьСМСКонтрагенту(Контрагент) Тогда
				
				ТребуетсяСМС = Истина;
				
				ШаблонТекстаКлиентуНовый = Константы.ШаблонТекстаСМСОМонтажеКлиенту.Получить();
				ШаблонТекстаКлиентуИзмененный = Константы.ШаблонТекстаСМСОИзмененииДатыМонтажаКлиенту.Получить();
				ПризнакСМС = Перечисления.ПризнакиСМС.Новая;
				НужноОтправитьСМСОбИзменении = Ложь;				
				
				//Нужно проверить отправлялась ли новая СМС
				НоваяСМСОтправлялась = СМСОтправляласьРанее("СМСОтправленные", Ссылка, Контрагент, ПризнакСМС);					
				
				//Если не отправлялась проверим в регистре к отправке
				Если НЕ НоваяСМСОтправлялась Тогда
					НоваяСМСКОтправке = РегистрыСведений.СМСКОтправке.СоздатьНаборЗаписей();
					НоваяСМСКОтправке.Отбор.ДокументОснование.Установить(Ссылка);
					НоваяСМСКОтправке.Отбор.Контрагент.Установить(Контрагент);
					НоваяСМСКОтправке.Отбор.ПризнакСМС.Установить(ПризнакСМС);
					НоваяСМСКОтправке.Прочитать();
					
					//Если есть к отправке с признаком Новая, нужно её изменить иначе будет создана новая смс
					Если НЕ НоваяСМСКОтправке.Количество() = 0 Тогда
						СтрокаНовойСМС = НоваяСМСКОтправке.Получить(0);
						СтрокаНовойСМС.Период = ТекущаяДатаСеанса();																					
						СтрокаНовойСМС.НомерТелефона = НомерТелефона;						
						СтрокаНовойСМС.ТекстСообщения = ЗаменитьПараметрыВШаблоне(ШаблонТекстаКлиентуНовый, Истина);
						Попытка
							НоваяСМСКОтправке.Записать();
						Исключение
						КонецПопытки;	
						
						//Выходим из отправки клиенту, т.к. далее выполнять код не нужно
						//Перейти ~КонецСМСКлиенту;
						ТребуетсяСМС = Ложь;
					КонецЕсли;
					
					//Если смс с признаком Новая отправлялось, нужно проверить нужно ли отправлять по изменениям и есть ли изменения
				ИначеЕсли Константы.ОтправлятьСМСПриИзмененииДатыМонтажа.Получить() И СМСОтправлятьПриИзмененииДатыМонтажа Тогда
					
					ПризнакСМС = Перечисления.ПризнакиСМС.Измененная;
					НужноОтправитьСМСОбИзменении = Истина;
					
					//Здесь определим, есть ли изменения по дате или времени монтажа						
					//Если (ДатаМонтажа <> мДатаМонтажа) ИЛИ (ВремяНачала <> мВремяНачала) ИЛИ (ВремяОкончания <> мВремяОкончания) Тогда	
					Попытка
						ДатаМонтажаПолностью = Дата(Формат(ДатаМонтажа, "ДФ=""ггггММдд""") + Формат(ВремяНачала, "ДФ=""ЧЧммсс""")); //Новая дата монтажа
					Исключение
						ДатаМонтажаПолностью = Дата(1,1,1);
					КонецПопытки;
					
					Попытка
						мДатаМонтажаПолностью = Дата(Формат(ДополнительныеСвойства.ПредДатаМонтажа, "ДФ=""ггггММдд""") + Формат(ДополнительныеСвойства.ПредВремяНачала, "ДФ=""ЧЧммсс""")); //Дата монтажа перед записью
					Исключение
						мДатаМонтажаПолностью = Дата(1,1,1);
					КонецПопытки;
					
					ПорогСрабатывания = Константы.ОтправлятьСМСПриИзмененииДатыМонтажаПорогСрабатывания.Получить();
					мНижнийПорог = мДатаМонтажаПолностью - (ПорогСрабатывания * 60);
					мВерхнийПорог = мДатаМонтажаПолностью + (ПорогСрабатывания * 60);
					
					Если (ПорогСрабатывания = 0 И ДатаМонтажаПолностью <> мДатаМонтажаПолностью) 
						ИЛИ (ПорогСрабатывания > 0 И НЕ (ДатаМонтажаПолностью > мНижнийПорог И ДатаМонтажаПолностью < мВерхнийПорог)) Тогда
						
						//Нужно проверить измененную смс в регистре к отправке							
						ИзмененнаяСМСКОтправке = РегистрыСведений.СМСКОтправке.СоздатьНаборЗаписей();
						ИзмененнаяСМСКОтправке.Отбор.ДокументОснование.Установить(Ссылка);
						ИзмененнаяСМСКОтправке.Отбор.Контрагент.Установить(Контрагент);
						ИзмененнаяСМСКОтправке.Отбор.ПризнакСМС.Установить(ПризнакСМС);
						ИзмененнаяСМСКОтправке.Прочитать();
						
						//Если есть к отправке с признаком Измененная, нужно её изменить иначе будет создана новая смс
						Если НЕ ИзмененнаяСМСКОтправке.Количество() = 0 Тогда
							СтрокаИзмененнойСМС = ИзмененнаяСМСКОтправке.Получить(0);
							СтрокаИзмененнойСМС.Период = ТекущаяДатаСеанса();																					
							СтрокаИзмененнойСМС.НомерТелефона = НомерТелефона;						
							СтрокаИзмененнойСМС.ТекстСообщения = ЗаменитьПараметрыВШаблоне(ШаблонТекстаКлиентуИзмененный);
							Попытка
								ИзмененнаяСМСКОтправке.Записать();
							Исключение
							КонецПопытки;	
							
							//Выходим из отправки клиенту, т.к. далее выполнять код не нужно
							//Перейти ~КонецСМСКлиенту;
							ТребуетсяСМС = Ложь;
						КонецЕсли;
						
					Иначе
						
						//Выходим из отправки клиенту, т.к. далее выполнять код не нужно
						//Перейти ~КонецСМСКлиенту;
						ТребуетсяСМС = Ложь;
						
					КонецЕсли;
					
				Иначе
					
					//Выходим из отправки клиенту, т.к. далее выполнять код не нужно
					//Перейти ~КонецСМСКлиенту;
					ТребуетсяСМС = Ложь;
					
				КонецЕсли;
				
				//Если мы сюда дошли, значить будет добавлена смс к отправке
				Если ТребуетсяСМС Тогда
					ТекстСМС =   ?(НужноОтправитьСМСОбИзменении, ШаблонТекстаКлиентуИзмененный,
					ШаблонТекстаКлиентуНовый);
					//ставим СМС в очередь на отправку
					МенеджерЗаписи = РегистрыСведений.СМСКОтправке.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДатаСеанса();
					МенеджерЗаписи.ДокументОснование = Ссылка;
					МенеджерЗаписи.Контрагент = Контрагент;
					МенеджерЗаписи.ПризнакСМС = ПризнакСМС;
					МенеджерЗаписи.Прочитать();
					МенеджерЗаписи.Период = ТекущаяДатаСеанса();
					МенеджерЗаписи.ДокументОснование = Ссылка;
					МенеджерЗаписи.Контрагент = Контрагент;
					МенеджерЗаписи.ПризнакСМС = ПризнакСМС;
					МенеджерЗаписи.НомерТелефона = НомерТелефона;						
					МенеджерЗаписи.ТекстСообщения = ЗаменитьПараметрыВШаблоне(ТекстСМС);
					МенеджерЗаписи.Записать();
				КонецЕсли;
				//~КонецСМСКлиенту:
				
			КонецЕсли;
		КонецЕсли;
		
		ТаблицаИсполнителей = Исполнители.Выгрузить();
		Для Каждого Исполнитель из ТаблицаИсполнителей Цикл
			НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Исполнитель.Сотрудник, Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника);
			НомерТелефона = РаботаССМС.ПодготовитьНомерТелефонаДляОтправкиСМС(СокрЛП(НомерТелефона));
			
			Если НЕ ПустаяСтрока(НомерТелефона) и ДатаМонтажаНазначена() Тогда
				//Если РаботаССМС.ИспользоватьОтправкуСМС() и Константы.АвтоматическаяРассылкаСМС.Получить() Тогда
				
				ТребуетсяСМС = Истина;
				
				ШаблонТекстаМонтажникуНовый = Константы.ШаблонТекстаСМСОМонтажеМонтажнику.Получить();
				ШаблонТекстаМонтажникуИзмененный = Константы.ШаблонТекстаСМСОИзмененииДатыМонтажаМонтажнику.Получить();
				ПризнакСМС = Перечисления.ПризнакиСМС.Новая;
				НужноОтправитьСМСОбИзменении = Ложь;						
				
				//Нужно проверить отправлялась ли новая СМС
				НоваяСМСОтправлялась = СМСОтправляласьРанее("СМСОтправленные", Ссылка, Исполнитель.Сотрудник, ПризнакСМС);					
				
				//Если не отправлялась проверим в регистре к отправке
				Если НЕ НоваяСМСОтправлялась Тогда
					НоваяСМСКОтправке = РегистрыСведений.СМСКОтправке.СоздатьНаборЗаписей();
					НоваяСМСКОтправке.Отбор.ДокументОснование.Установить(Ссылка);
					НоваяСМСКОтправке.Отбор.Контрагент.Установить(Исполнитель.Сотрудник);
					НоваяСМСКОтправке.Отбор.ПризнакСМС.Установить(ПризнакСМС);
					НоваяСМСКОтправке.Прочитать();
					
					//Если есть к отправке с признаком Новая, нужно её изменить иначе будет создана новая смс
					Если НЕ НоваяСМСКОтправке.Количество() = 0 Тогда
						СтрокаНовойСМС = НоваяСМСКОтправке.Получить(0);
						СтрокаНовойСМС.Период = ТекущаяДатаСеанса();																					
						СтрокаНовойСМС.НомерТелефона = НомерТелефона;						
						СтрокаНовойСМС.ТекстСообщения = ЗаменитьПараметрыВШаблоне(ШаблонТекстаМонтажникуНовый, Истина);
						Попытка
							НоваяСМСКОтправке.Записать();
						Исключение
						КонецПопытки;	
						
						//Выходим из отправки монтажнику, т.к. далее выполнять код не нужно
						//Перейти ~КонецСМССотруднику;
						ТребуетсяСМС = Ложь;
					КонецЕсли;
					
					//Если смс с признаком Новая отправлялось, нужно проверить нужно ли отправлять по изменениям и есть ли изменения
				ИначеЕсли Константы.ОтправлятьСМСПриИзмененииДатыМонтажа.Получить() Тогда
					
					ПризнакСМС = Перечисления.ПризнакиСМС.Измененная;
					НужноОтправитьСМСОбИзменении = Истина;
					
					//Здесь определим, есть ли изменения по дате или времени монтажа						
					//Если (ДатаМонтажа <> мДатаМонтажа) ИЛИ (ВремяНачала <> мВремяНачала) ИЛИ (ВремяОкончания <> мВремяОкончания) Тогда																										
					
					ДатаМонтажаПолностью = Дата(Формат(ДатаМонтажа, "ДФ=""ггггММдд""") + Формат(ВремяНачала, "ДФ=""ЧЧммсс""")); //Новая дата монтажа
					мДатаМонтажаПолностью = Дата(Формат(ДополнительныеСвойства.ПредДатаМонтажа, "ДФ=""ггггММдд""") + Формат(ДополнительныеСвойства.ПредВремяНачала, "ДФ=""ЧЧммсс""")); //Дата монтажа перед записью
					ПорогСрабатывания = Константы.ОтправлятьСМСПриИзмененииДатыМонтажаПорогСрабатывания.Получить();
					мНижнийПорог = мДатаМонтажаПолностью - (ПорогСрабатывания * 60);
					мВерхнийПорог = мДатаМонтажаПолностью + (ПорогСрабатывания * 60);
					
					Если (ПорогСрабатывания = 0 И ДатаМонтажаПолностью <> мДатаМонтажаПолностью) 
						ИЛИ (ПорогСрабатывания > 0 И НЕ (ДатаМонтажаПолностью > мНижнийПорог И ДатаМонтажаПолностью < мВерхнийПорог)) Тогда
						
						//Нужно проверить измененную смс в регистре к отправке							
						ИзмененнаяСМСКОтправке = РегистрыСведений.СМСКОтправке.СоздатьНаборЗаписей();
						ИзмененнаяСМСКОтправке.Отбор.ДокументОснование.Установить(Ссылка);
						ИзмененнаяСМСКОтправке.Отбор.Контрагент.Установить(Исполнитель.Сотрудник);
						ИзмененнаяСМСКОтправке.Отбор.ПризнакСМС.Установить(ПризнакСМС);
						ИзмененнаяСМСКОтправке.Прочитать();
						
						//Если есть к отправке с признаком Измененная, нужно её изменить иначе будет создана новая смс
						Если НЕ ИзмененнаяСМСКОтправке.Количество() = 0 Тогда
							СтрокаИзмененнойСМС = ИзмененнаяСМСКОтправке.Получить(0);
							СтрокаИзмененнойСМС.Период = ТекущаяДатаСеанса();																					
							СтрокаИзмененнойСМС.НомерТелефона = НомерТелефона;						
							СтрокаИзмененнойСМС.ТекстСообщения = ЗаменитьПараметрыВШаблоне(ШаблонТекстаМонтажникуИзмененный);
							Попытка
								ИзмененнаяСМСКОтправке.Записать();
							Исключение
							КонецПопытки;	
							
							//Выходим из отправки монтажнику, т.к. далее выполнять код не нужно
							//Перейти ~КонецСМССотруднику;
							ТребуетсяСМС = Ложь;
						КонецЕсли;
						
					Иначе
						
						//Выходим из отправки монтажнику, т.к. далее выполнять код не нужно
						//Перейти ~КонецСМССотруднику;
						ТребуетсяСМС = Ложь;
					КонецЕсли;	
					
				Иначе
					
					//Выходим из отправки монтажнику, т.к. далее выполнять код не нужно
					//Перейти ~КонецСМССотруднику;
					ТребуетсяСМС = Ложь;
					
				КонецЕсли;
				
				//Если мы сюда дошли, значить будет добавлена смс к отправке
				Если ТребуетсяСМС Тогда
					ТекстСМС =   ?(НужноОтправитьСМСОбИзменении, ШаблонТекстаМонтажникуИзмененный,
																 ШаблонТекстаМонтажникуНовый);
					//ставим СМС в очередь на отправку
					МенеджерЗаписи = РегистрыСведений.СМСКОтправке.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДатаСеанса();
					МенеджерЗаписи.ДокументОснование = Ссылка;
					МенеджерЗаписи.Контрагент = Исполнитель.Сотрудник;
					МенеджерЗаписи.ПризнакСМС = ПризнакСМС;
					МенеджерЗаписи.Прочитать();
					МенеджерЗаписи.Период = ТекущаяДатаСеанса();
					МенеджерЗаписи.ДокументОснование = Ссылка;
					МенеджерЗаписи.Контрагент = Исполнитель.Сотрудник;
					МенеджерЗаписи.ПризнакСМС = ПризнакСМС;
					МенеджерЗаписи.НомерТелефона = НомерТелефона;						
					МенеджерЗаписи.ТекстСообщения = ЗаменитьПараметрыВШаблоне(ТекстСМС);
					МенеджерЗаписи.Записать();
				КонецЕсли;
				//~КонецСМССотруднику:
				
				//КонецЕсли;					
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
		
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	СМСОтправлятьПриНазначенииМонтажа    = РаботаССМС.ИспользоватьОтправкуСМС() И РаботаССМС.ОтправлятьСМСОЗапланированномМонтаже();
	СМСОтправлятьПриИзмененииДатыМонтажа = РаботаССМС.ИспользоватьОтправкуСМС() И РаботаССМС.ОтправлятьСМСПриИзмененииДатыМонтажа();
	
	СлужебныйКоличествоКСписаниюНеСоответствуетКоличествуПроданного = ПолучитьФункциональнуюОпцию("КоличествоТоваровКСписаниюВРозницеНеСоответствуетКоличествуПроданногоТовара");
	
	СлужебныйЗаполнениеМатериаловРозницы = ПолучитьФункциональнуюОпцию("ЗаполнениеМатериаловРозницы");
	//СлужебныйОбеспечениеПоДокументу = ПолучитьФункциональнуюОпцию("ОбеспеченностьРозницыПоМонтажам");
	
	//#6347
	СпособРаспределенияВыработки = Константы.СпособРаспределенияВыработкиПоМонтажуПоУмолчанию.Получить();
	
	//#6385
	//ПриРасчетеВыработкиУчитыватьПроцентОтклоненияОтПрайса = ПолучитьФункциональнуюОпцию("ПриРасчетеВыработкиПоМонтажуУчитыватьПроцентОтклоненияОтПрайса");
	
	// №1083
	СозданПриИспользованииСтатусаЗакрыт = Константы.ИспользоватьСтатусЗакрытВМонтаже.Получить();
	
	//#6297
	СлужебныйИспользоватьИсключенияИзКонтроляВыдачиВозврата = ПолучитьФункциональнуюОпцию("ИспользоватьВыдачуВозвратВДокументеМонтаж") 
																И Константы.ИспользоватьИсключенияИзКонтроляВыдачиВозвратаПоМонтажам.Получить();
	Если СлужебныйИспользоватьИсключенияИзКонтроляВыдачиВозврата Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Исключения.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ИсключенияИзКонтроляВыдачиВозвратаМатериаловПоМонтажам КАК Исключения";
		НеконтролируемыеМатериалы.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
	//#16741
	ВариантЗаполненияДатыПодписания = Перечисления.ВариантыЗаполненияДатыПодписанияВМонтаже.НеЗаполнять;
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	// #16346
	Если ВидОперации = Справочники.ВидыМонтажа.Продажа Тогда
		Результат = Справочники.РезультатыМонтажа.ПустаяСсылка();
		//#16741
		ВариантЗаполненияДатыПодписания = Перечисления.ВариантыЗаполненияДатыПодписанияВМонтаже.ДатойДокумента;	
	КонецЕсли;

	//++16681
	Если Константы.СпособЗаполненияМенеджераВМонтаже.Получить() = Перечисления.ВариантыЗаполненияМенеджера.ЗаполнятьСотрудникомПользователя 
		И ЗначениеЗаполнено(Автор) Тогда
		Менеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Автор, "Сотрудник");
	КонецЕсли;
	//--16681
		
КонецПроцедуры

Процедура ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения, Знач ПараметрВидОперации = Неопределено)

	//#16242
	Если ЗначениеЗаполнено(ПараметрВидОперации) Тогда
		ВидОперации = ПараметрВидОперации;
	ИначеЕсли ДанныеЗаполнения.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Договор Тогда
		ВидОперации = Справочники.ВидыМонтажа.Монтаж;
	ИначеЕсли ДанныеЗаполнения.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Рекламация Тогда
		ВидОперации = Справочники.ВидыМонтажа.Рекламация;      
	ИначеЕсли ДанныеЗаполнения.ВидЗаказа = Справочники.ВидыЗаказДоговоров.СервиснаяЗаявка Тогда
		ВидОперации = Справочники.ВидыМонтажа.СервиснаяЗаявка; 
	ИначеЕсли ДанныеЗаполнения.ВидЗаказа = Справочники.ВидыЗаказДоговоров.Продажа Тогда // 16288 
		ВидОперации = Справочники.ВидыМонтажа.Продажа;
	Иначе
		ВидОперации = Справочники.ВидыМонтажа.Монтаж;
	КонецЕсли;
	
	Основание = ДанныеЗаполнения;
	Организация = ДанныеЗаполнения.Организация;
	Адрес = ДанныеЗаполнения.Адрес;
	ДатаМонтажа = ТекущаяДатаСеанса();
	Контрагент = ДанныеЗаполнения.Контрагент;
	ДоговорКонтрагента = Контрагент.ОсновнойДоговор;
	СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	ВидЦен = ДанныеЗаполнения.ВидЦен;
	Валюта = ДанныеЗаполнения.Валюта;
	ДисконтнаяКарта = ДанныеЗаполнения.ДисконтнаяКарта;
	ТочкаПродаж = ДанныеЗаполнения.ТочкаПродаж;
	Подразделение = ДанныеЗаполнения.Подразделение;
	ВидСкидки = ДанныеЗаполнения.ВидСкидки; //2019-01-18 добавлен новый элемент, заявка #3230
	Геометка = ДанныеЗаполнения.Геометка;
	
	//#16346 ЗаказДоговор - самый главный ЗД
	//ЗаказДоговор = ДанныеЗаполнения; // №10807		
	ЗаказДоговор = ДанныеЗаполнения.ЗаказДоговорОснование; // заполняем всегда, ПередЗаписью для Монтажа или Продажи зачищаем	
	
	ЗаполнитьСкладыПоБригаде();
	
	// 16346 не заполнять табличные части
	////++ №12721  
	//Если ВидОперации = Справочники.ВидыМонтажа.Продажа 
	//	ИЛИ ВидОперации = Справочники.ВидыМонтажа.Рекламация       //#16242
	//	ИЛИ ВидОперации = Справочники.ВидыМонтажа.СервиснаяЗаявка  //#16242
	//	Тогда
	//	
	//	//Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.ТоварыУслуги Цикл
	//	//	
	//	//	НоваяСтрока = ТоварыУслуги.Добавить();
	//	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	//	//	
	//	//КонецЦикла;
	//	
	////-- №12721
	//ИначеЕсли НЕ ВидОперации = Справочники.ВидыМонтажа.Монтаж Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.ЗаполнятьУИСтрок Тогда
		//таблица материалов
		ЗаполнитьМатериалыПоЗаказДоговору();	
		//таблица товаров и услуг
		ЗаполнитьТоварыПоЗаказДоговору();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЛиду(ДанныеЗаполнения)
	
	Если ВидОперации.Пустая() Тогда
		ВидОперации = Справочники.ВидыМонтажа.СервиснаяЗаявка;
	КонецЕсли;
	
	Основание = ДанныеЗаполнения;
	Адрес = ДанныеЗаполнения.Адрес;
	Организация = ОбщийМодульСервер.НастройкаПользователя("ОрганизацияРозницы");
	Геометка = ДанныеЗаполнения.Геометка;
	ТочкаПродаж = ДанныеЗаполнения.ТочкаПродаж;
	Подразделение = ДанныеЗаполнения.Подразделение;
	
КонецПроцедуры

Процедура ЗаполнитьТоварыПоЗаказДоговору() Экспорт
	
	Если НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыДоговора.Комната КАК Комната,
	|	ТоварыДоговора.Номенклатура КАК Номенклатура,
	|	ТоварыДоговора.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТоварыДоговора.НомерПотолка КАК НомерПотолка,
	|	ЕСТЬNULL(ТоварыДоговора.Количество, 0) - ЕСТЬNULL(ТоварыМонтажа.Количество, 0) КАК Количество,
	|	ТоварыДоговора.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТоварыДоговора.Коэффициент КАК Коэффициент,
	|	ТоварыДоговора.Цена КАК Цена,
	|	ТоварыДоговора.Бесплатно КАК Бесплатно,
	|	ЕСТЬNULL(ТоварыДоговора.Сумма, 0) - ЕСТЬNULL(ТоварыМонтажа.Сумма, 0) КАК Сумма,
	|	ТоварыДоговора.Спецификация КАК Спецификация,
	//|	ТоварыДоговора.ЦветФактуры КАК ЦветФактуры,
	|	ТоварыДоговора.УИСтроки КАК УИСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказДоговорТоварыУслуги.Ссылка КАК Ссылка,
	|		ЗаказДоговорТоварыУслуги.Комната КАК Комната,
	|		ЗаказДоговорТоварыУслуги.Номенклатура КАК Номенклатура,
	|		ЗаказДоговорТоварыУслуги.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ЗаказДоговорТоварыУслуги.НомерПотолка КАК НомерПотолка,
	|		СУММА(ЗаказДоговорТоварыУслуги.Количество) КАК Количество,
	|		ЗаказДоговорТоварыУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЗаказДоговорТоварыУслуги.Коэффициент КАК Коэффициент,
	|		ЗаказДоговорТоварыУслуги.Цена КАК Цена,
	|		СУММА(ЗаказДоговорТоварыУслуги.Сумма) КАК Сумма,
	|		ЗаказДоговорТоварыУслуги.Бесплатно КАК Бесплатно,
	|		ЗаказДоговорТоварыУслуги.Спецификация КАК Спецификация,
	//|		ЗаказДоговорТоварыУслуги.ЦветФактуры КАК ЦветФактуры,
	|		ЗаказДоговорТоварыУслуги.УИСтроки КАК УИСтроки
	|	ИЗ
	|		Документ.ЗаказДоговор.ТоварыУслуги КАК ЗаказДоговорТоварыУслуги
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаказДоговорТоварыУслуги.Комната,
	|		ЗаказДоговорТоварыУслуги.Номенклатура,
	|		ЗаказДоговорТоварыУслуги.ХарактеристикаНоменклатуры,
	|		ЗаказДоговорТоварыУслуги.НомерПотолка,
	|		ЗаказДоговорТоварыУслуги.Ссылка,
	|		ЗаказДоговорТоварыУслуги.Спецификация,
	//|		ЗаказДоговорТоварыУслуги.ЦветФактуры,
	|		ЗаказДоговорТоварыУслуги.ЕдиницаИзмерения,
	|		ЗаказДоговорТоварыУслуги.Коэффициент,
	|		ЗаказДоговорТоварыУслуги.Цена,
	|		ЗаказДоговорТоварыУслуги.Бесплатно,
	|		ЗаказДоговорТоварыУслуги.УИСтроки) КАК ТоварыДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МонтажТоварыУслуги.Комната КАК Комната,
	|			МонтажТоварыУслуги.Номенклатура КАК Номенклатура,
	|			МонтажТоварыУслуги.НомерПотолка КАК НомерПотолка,
	|			СУММА(МонтажТоварыУслуги.Количество) КАК Количество,
	|			МонтажТоварыУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|			МонтажТоварыУслуги.Коэффициент КАК Коэффициент,
	|			МонтажТоварыУслуги.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			МонтажТоварыУслуги.СерияНоменклатуры КАК СерияНоменклатуры,
	|			МонтажТоварыУслуги.Цена КАК Цена,
	|			СУММА(МонтажТоварыУслуги.Сумма) КАК Сумма,
	|			МонтажТоварыУслуги.Бесплатно КАК Бесплатно,
	|			МонтажТоварыУслуги.Спецификация КАК Спецификация,
	|			МонтажТоварыУслуги.УИСтроки КАК УИСтроки
	|		ИЗ
	|			Документ.Монтаж.ТоварыУслуги КАК МонтажТоварыУслуги
	|		ГДЕ
	|			МонтажТоварыУслуги.Ссылка.Проведен
	|			И МонтажТоварыУслуги.Ссылка.Основание = &ЗаказДоговор
	|			И НЕ МонтажТоварыУслуги.Ссылка = &Монтаж
	|		
	|		СГРУППИРОВАТЬ ПО
	|			МонтажТоварыУслуги.Комната,
	|			МонтажТоварыУслуги.Номенклатура,
	|			МонтажТоварыУслуги.НомерПотолка,
	|			МонтажТоварыУслуги.ЕдиницаИзмерения,
	|			МонтажТоварыУслуги.Коэффициент,
	|			МонтажТоварыУслуги.ХарактеристикаНоменклатуры,
	|			МонтажТоварыУслуги.СерияНоменклатуры,
	|			МонтажТоварыУслуги.Цена,
	|			МонтажТоварыУслуги.Бесплатно,
	|			МонтажТоварыУслуги.Спецификация,
	|			МонтажТоварыУслуги.УИСтроки) КАК ТоварыМонтажа
	|		ПО ТоварыДоговора.Комната = ТоварыМонтажа.Комната
	|			И ТоварыДоговора.Номенклатура = ТоварыМонтажа.Номенклатура
	|			И ТоварыДоговора.ХарактеристикаНоменклатуры = ТоварыМонтажа.ХарактеристикаНоменклатуры
	|			И ТоварыДоговора.Коэффициент = ТоварыМонтажа.Коэффициент
	|			И ТоварыДоговора.ЕдиницаИзмерения = ТоварыМонтажа.ЕдиницаИзмерения
	|			И ТоварыДоговора.Цена = ТоварыМонтажа.Цена
	|			И ТоварыДоговора.Спецификация = ТоварыМонтажа.Спецификация
	|ГДЕ
	|	ТоварыДоговора.Ссылка = &ЗаказДоговор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыДоговора.Комната";
	
	Запрос.УстановитьПараметр("ЗаказДоговор", Основание);
	Запрос.УстановитьПараметр("Монтаж", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.Номенклатура.Пустая() Тогда
			Если Выборка.Количество > 0 Тогда 
				НоваяСтрока = ТоварыУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				СуммаБезСкидки = НоваяСтрока.Цена * НоваяСтрока.Количество;
				НоваяСтрока.СуммаСкидки = СуммаБезСкидки - НоваяСтрока.Сумма;
				Если НоваяСтрока.СуммаСкидки > 0 Тогда 
					Если СуммаБезСкидки > 0  Тогда 						
						НоваяСтрока.ПроцентСкидки = НоваяСтрока.СуммаСкидки / СуммаБезСкидки * 100;
					КонецЕсли;
				КонецЕсли; 				
				//НоваяСтрока.КоличествоВыработка = Документы.Монтаж.ПолучитьКоличествоВыработка(НоваяСтрока.Количество);
				//Закомментировано: Заполнение поля к списанию должно происходить только по кнопке в ТЧ, заявка #4227
				//Раскомментировано: заявка #4679
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(НоваяСтрока.Номенклатура) Тогда  
					НоваяСтрока.КоличествоКСписанию = НоваяСтрока.Номенклатура.Потолок_КоличествоПродукция;
				ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(НоваяСтрока.Номенклатура) Тогда  
					НоваяСтрока.КоличествоКСписанию = 0;
				Иначе
					НоваяСтрока.КоличествоКСписанию = НоваяСтрока.Количество;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМатериалыПоЗаказДоговору() Экспорт
	
	Если НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МатериалыДоговора.Комната КАК Комната,
	|	МатериалыДоговора.Номенклатура КАК Номенклатура,
	|	МатериалыДоговора.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	МатериалыДоговора.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МатериалыДоговора.Коэффициент КАК Коэффициент,
	|	ЕСТЬNULL(МатериалыДоговора.Количество, 0) - ЕСТЬNULL(МатериалыМонтажа.Количество, 0) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказДоговорМатериалы.Ссылка КАК Ссылка,
	|		ЗаказДоговорМатериалы.Комната КАК Комната,
	|		ЗаказДоговорМатериалы.Номенклатура КАК Номенклатура,
	|		ЗаказДоговорМатериалы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(ЗаказДоговорМатериалы.Количество) КАК Количество,
	|		ЗаказДоговорМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЗаказДоговорМатериалы.Коэффициент КАК Коэффициент
	|	ИЗ
	|		Документ.ЗаказДоговор.Материалы КАК ЗаказДоговорМатериалы
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаказДоговорМатериалы.Ссылка,
	|		ЗаказДоговорМатериалы.Комната,
	|		ЗаказДоговорМатериалы.Номенклатура,
	|		ЗаказДоговорМатериалы.ХарактеристикаНоменклатуры,
	|		ЗаказДоговорМатериалы.ЕдиницаИзмерения,
	|		ЗаказДоговорМатериалы.Коэффициент) КАК МатериалыДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МонтажМатериалы.Ссылка КАК Ссылка,
	|			МонтажМатериалы.Комната КАК Комната,
	|			МонтажМатериалы.Номенклатура КАК Номенклатура,
	|			МонтажМатериалы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			МонтажМатериалы.СерияНоменклатуры КАК СерияНоменклатуры,
	|			МонтажМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|			МонтажМатериалы.Коэффициент КАК Коэффициент,
	|			СУММА(МонтажМатериалы.Количество) КАК Количество,
	|			СУММА(МонтажМатериалы.Цена) КАК Цена,
	|			СУММА(МонтажМатериалы.Сумма) КАК Сумма
	|		ИЗ
	|			Документ.Монтаж.Материалы КАК МонтажМатериалы
	|		ГДЕ
	|			МонтажМатериалы.Ссылка.Проведен
	|		
	|		СГРУППИРОВАТЬ ПО
	|			МонтажМатериалы.Ссылка,
	|			МонтажМатериалы.Комната,
	|			МонтажМатериалы.Номенклатура,
	|			МонтажМатериалы.ХарактеристикаНоменклатуры,
	|			МонтажМатериалы.СерияНоменклатуры,
	|			МонтажМатериалы.ЕдиницаИзмерения,
	|			МонтажМатериалы.Коэффициент) КАК МатериалыМонтажа
	|		ПО МатериалыДоговора.Ссылка = МатериалыМонтажа.Ссылка.Основание
	|			И МатериалыДоговора.Комната = МатериалыМонтажа.Комната
	|			И МатериалыДоговора.Номенклатура = МатериалыМонтажа.Номенклатура
	|			И МатериалыДоговора.ХарактеристикаНоменклатуры = МатериалыМонтажа.ХарактеристикаНоменклатуры
	|			И МатериалыДоговора.Коэффициент = МатериалыМонтажа.Коэффициент
	|			И МатериалыДоговора.ЕдиницаИзмерения = МатериалыМонтажа.ЕдиницаИзмерения
	|ГДЕ
	|	МатериалыДоговора.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	МатериалыДоговора.Комната";
	Запрос.УстановитьПараметр("Ссылка", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.Номенклатура.Пустая() Тогда
			Если Выборка.Количество > 0 Тогда 
				НоваяСтрока = Материалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьСкладыПоБригаде() Экспорт
	
	Склад = Бригада.Склад;
	Если Склад.Пустая() Тогда
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Склад = Основание.ТочкаПродаж.МонтажСкладМатериалов;
		КонецЕсли;
	КонецЕсли;
	Если Склад.Пустая() Тогда
		Склад = ПараметрыСеанса.Пользователь.СкладМатериаловРозница;
	КонецЕсли;
	
	СкладТоваров = Бригада.СкладТоваров;
	Если СкладТоваров.Пустая() Тогда
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			СкладТоваров = Основание.ТочкаПродаж.МонтажСкладТоваров;
		КонецЕсли;
	КонецЕсли;
	Если СкладТоваров.Пустая() Тогда
		СкладТоваров = ПараметрыСеанса.Пользователь.СкладРозница;
	КонецЕсли;

КонецФункции

Процедура ДополнитьТаблицуВыработки(ТаблицаПоВыработке, ДатаВыработки)
	
	ТаблицаПоВыработке.Колонки.Добавить("Период");
	ТаблицаПоВыработке.Колонки.Добавить("Регистратор");
	ТаблицаПоВыработке.Колонки.Добавить("ОбъектВыработки");
	
	ТаблицаПоВыработке.ЗаполнитьЗначения(ДатаВыработки, "Период");
	ТаблицаПоВыработке.ЗаполнитьЗначения(Ссылка, "Регистратор");
	ТаблицаПоВыработке.ЗаполнитьЗначения(Ссылка, "ОбъектВыработки");
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ДобавитьЗаписиВИсториюПоМонтажам(Знач ПредыдущаяТаблица, Знач ТекущаяТаблица)
	
	ЗаписиВРегистрИстории = Новый ТаблицаЗначений;
	Для каждого ИзмерениеРегистра из метаданные.РегистрыСведений.ИсторияМонтажа.Измерения Цикл
		ЗаписиВРегистрИстории.Колонки.Добавить(ИзмерениеРегистра.Имя);
	КонецЦикла;
	Для каждого РесурсРегистра из метаданные.РегистрыСведений.ИсторияМонтажа.Ресурсы Цикл
		ЗаписиВРегистрИстории.Колонки.Добавить(РесурсРегистра.Имя);
	КонецЦикла;
	
	ИмяПоляДата 	 = "ДатаМонтажа";
	ИмяПоляНачала 	 = "ВремяНачала";
	ИмяПоляОкончания = "ВремяОкончания";
	ИмяПоляИсполнитель = "Бригада";
	
	ЕстьИзменения = Ложь;
	
	Для каждого СтрокаМонтажа из ПредыдущаяТаблица Цикл
		НайденныеСтроки = ТекущаяТаблица.НайтиСтроки(Новый Структура("ИДМонтажа", СтрокаМонтажа.ИДМонтажа));
		Если НайденныеСтроки.Количество() = 0 Тогда	
			ТекстВИсторию = "Удален %1. Дата: %2 %3 (%4)";
			ТекстВИсторию = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВИсторию,
									"монтаж",
									Формат(СтрокаМонтажа[ИмяПоляДата],"ДЛФ=Д"),
									Формат(СтрокаМонтажа[ИмяПоляНачала],"ДЛФ=В"),
									СтрокаМонтажа[ИмяПоляИсполнитель]);
			ДобавитьЗаписьВИсторию(ТекстВИсторию);
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаМонтажа из ТекущаяТаблица Цикл
		НайденныеСтроки = ПредыдущаяТаблица.НайтиСтроки(Новый Структура("ИДМонтажа", СтрокаМонтажа.ИДМонтажа));
		Если НайденныеСтроки.Количество() > 0 Тогда	
			Если НЕ СтрокаМонтажа[ИмяПоляДата] = НайденныеСтроки[0][ИмяПоляДата] 
				ИЛИ НЕ СтрокаМонтажа[ИмяПоляНачала] = НайденныеСтроки[0][ИмяПоляНачала] 
				ИЛИ НЕ СтрокаМонтажа[ИмяПоляИсполнитель] = НайденныеСтроки[0][ИмяПоляИсполнитель] Тогда
				
				ТекстВИсторию = "%1 перенесен. Старые значения Дата: %2 %3 (%4). Новые значения Дата: %5 %6 (%7)";
				ТекстВИсторию = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВИсторию,
									"Монтаж",
									Формат(НайденныеСтроки[0][ИмяПоляДата],"ДЛФ=Д"),
									Формат(НайденныеСтроки[0][ИмяПоляНачала],"ДЛФ=В"),
									НайденныеСтроки[0][ИмяПоляИсполнитель],
									Формат(СтрокаМонтажа[ИмяПоляДата],"ДЛФ=Д"),
									Формат(СтрокаМонтажа[ИмяПоляНачала],"ДЛФ=В"),
									СтрокаМонтажа[ИмяПоляИсполнитель]);
				ДобавитьЗаписьВИсторию(ТекстВИсторию);
				ЕстьИзменения = Истина;
			КонецЕсли;
		Иначе
			ТекстВИсторию = "Назначен %1. Дата: %2 %3 (%4)";
			ТекстВИсторию = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВИсторию,
									"монтаж",
									Формат(СтрокаМонтажа[ИмяПоляДата],"ДЛФ=Д"),
									Формат(СтрокаМонтажа[ИмяПоляНачала],"ДЛФ=В"),
									СтрокаМонтажа[ИмяПоляИсполнитель]);
			ДобавитьЗаписьВИсторию(ТекстВИсторию);
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьИзменения;
	
КонецФункции

Процедура ДобавитьЗаписьВИсторию(Комментарий)
	
	НоваяСтрока = ЗаписиВРегистрИстории.Добавить();
	НоваяСтрока.Дата = ТекущаяДатаСеанса();
	НоваяСтрока.Пользователь = Пользователи.ТекущийПользователь();
	НоваяСтрока.Комментарий = Комментарий;
	НоваяСтрока.ИДЗаписи = Новый УникальныйИдентификатор;
	
КонецПроцедуры

Функция ЗаменитьПараметрыВШаблоне(ТекстСМС, ЭтоНоваяСмс = Ложь)
	
	Если ПустаяСтрока(ТекстСМС) Тогда
		Сообщить ("ВНИМАНИЕ!!! В системе не заданы шаблоны СМС для монтажей!!!",СтатусСообщения.ОченьВажное);
		ТекстСМС = "Вам назначен монтаж потолков";
	КонецЕсли;
	
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Адрес", Адрес);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Контрагент", Контрагент.Наименование);
	
	//++ №9547 если дата будет определена по звонку, зануляем параметры даты и времени монтажа и добавляем текст "Дата будет определена по звонку"
	Если СрокМонтажа = Перечисления.СрокиМонтажа.ДатаМонтажаНеОпределена Тогда
		
		ТекстСМС = СтрЗаменить(ТекстСМС, "%Дата", "");
		ТекстСМС = СтрЗаменить(ТекстСМС, "%ВремяНачала", "");
		
		//++ №11843
		//ТекстСМС = ТекстСМС + " " + ?(ЭтоНоваяСмс, "Дата монтажа будет определена по звонку.", "Дата монтажа изменилась и будет определена по звонку.");
		ТекстСМС = ТекстСМС + " " + ?(ЭтоНоваяСмс, "Дата монтажа не определена.", "Дата монтажа стала не определена.");
		//-- №11843
		
	//-- №9547
	Иначе
	
		ТекстСМС = СтрЗаменить(ТекстСМС, "%Дата", Лев(ДатаМонтажа,10));
		ТекстСМС = СтрЗаменить(ТекстСМС, "%ВремяНачала", Формат(ВремяНачала,"ДФ=Ч:мм"));
		
	КонецЕсли;
	
	Возврат ТекстСМС;
	
КонецФункции

Функция ДатаМонтажаНазначена()
	Если ДатаМонтажа > Дата(2010, 01, 01) Тогда 
		Возврат Истина;
	ИначеЕсли СрокМонтажа = Перечисления.СрокиМонтажа.ДатаМонтажаНеОпределена Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция СМСОтправляласьРанее(Регистр, ДокументОснование, Контрагент, ПризнакСМС)
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрСМС.ТекстСообщения
	|ИЗ
	|   РегистрСведений." + Регистр + " КАК РегистрСМС
	|ГДЕ
	|	РегистрСМС.ДокументОснование = &ДокументОснование
	|	И РегистрСМС.Контрагент = &Контрагент
	|	И РегистрСМС.ПризнакСМС = &ПризнакСМС";
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ПризнакСМС", ПризнакСМС);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой()Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

#КонецОбласти

#КонецЕсли