
#Область ПеременныеФормы

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
		
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// №9562
	ОпределитьВидНоменклатурыПродукции();
	
	//2019-01-18 добавлен новый элемент, заявка #3230
	Элементы.ВидСкидки.Видимость = Константы.ИспользоватьРазделениеПоВидамСкидокДляУстановкиСтоимостиВыработкиВМонтаже.Получить();
	//#6586
	Если НЕ Элементы.ВидСкидки.Видимость И ЗначениеЗаполнено(Объект.ВидСкидки) Тогда
		Элементы.ВидСкидки.Видимость = Истина;
		Элементы.ВидСкидки.ТолькоПросмотр = Истина;
	КонецЕсли;
		
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, "ВыработкаПоНоменклатуреНоменклатураАртикул");
	
	УправлениеФормойНаСервере();
	Элементы.ВыработкаПоВидамНоменклатурыСтоимостьСуммой.Заголовок = "" + ВалютаУчета + " за единицу товара";
	Элементы.ВыработкаПоНоменклатуреСтоимостьСуммой.Заголовок = "" + ВалютаУчета + " за единицу товара";
	
	ФактурностьПотолка = Неопределено;
	Если Объект.ОднофактурныйПотолок И Объект.МногофактурныйПотолок Тогда
		ФактурностьПотолка = 2;
	ИначеЕсли Объект.ОднофактурныйПотолок Тогда
		ФактурностьПотолка = 0;
	ИначеЕсли Объект.МногофактурныйПотолок Тогда
		ФактурностьПотолка = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// #16609
	ОбновитьПредставлениеОтклоненийОтПрайса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	//#16609
	Для каждого СтрокаТЧ из Объект.ВыработкаПоВидамНоменклатуры Цикл
		ЗаполнитьОтклоненийОтПрайсаВСтрокеТЧПоПредставлению(СтрокаТЧ);
	КонецЦикла;
	Для каждого СтрокаТЧ из Объект.ВыработкаПоНоменклатуре Цикл
		ЗаполнитьОтклоненийОтПрайсаВСтрокеТЧПоПредставлению(СтрокаТЧ);
	КонецЦикла;
	
	// #14355
	Если ЗначениеЗаполнено(Объект.Ссылка) 
		И НЕ НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДата()) Тогда
		
		ИзменяетсяСтатусПроведения = ОбщийМодульВызовСервера.ИзменяетсяСтатусПроведения(Объект, ПараметрыЗаписи.РежимЗаписи);	
		
		Если ИзменяетсяСтатусПроведения
			ИЛИ (Модифицированность
				И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
			ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи);
		КонецЕсли;
	КонецЕсли;

	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции 
		И Объект.ВидНоменклатурыПотолка = Справочники.ВидыНоменклатуры.Потолок Тогда
		ТекущийОбъект.ОднофактурныйПотолок  = ФактурностьПотолка = 0 ИЛИ ФактурностьПотолка = 2;
		ТекущийОбъект.МногофактурныйПотолок = ФактурностьПотолка = 1 ИЛИ ФактурностьПотолка = 2;	
	КонецЕсли;
	
	//#10991
	Если НЕ Объект.ВидИсполнителя = Справочники.ВидыИсполнителей.Менеджер Тогда
		Объект.Менеджеры.Очистить();
	КонецЕсли;
		
	//проверки перед проведением
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//проверим на задвоения - вид номенклатуры
		ВремТаблица = Новый ТаблицаЗначений;
		ВремТаблица = Объект.ВыработкаПоВидамНоменклатуры.Выгрузить();
		ВремТаблица.Колонки.Добавить("Количество");
		
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			ТекущаяСтрока.Количество = 1;
		КонецЦикла;
		
		// #6385
		Если Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж 
			//++ #16579
			//И Объект.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказДоговор
			//И ПолучитьФункциональнуюОпцию("ПриРасчетеВыработкиПоМонтажуУчитыватьПроцентОтклоненияОтПрайса")
			И Объект.УчитыватьПроцентОтклоненияОтПрайса
			//-- #16579
			Тогда
			
			//++ №14035 по монтажу появилось применение
			//ВремТаблица.Свернуть("ВидНоменклатуры, Категория, СкидкаВПроцентахОт", "Количество");
			ВремТаблица.Свернуть("ВидНоменклатуры, Категория, СкидкаВПроцентахОт, Применение", "Количество");
			//-- №14035
			
		ИначеЕсли Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции
			Или Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж Тогда // №14035 по монтажу появилось применение
			
			ВремТаблица.Свернуть("ВидНоменклатуры, Категория, Применение", "Количество");
			
		Иначе
			
			ВремТаблица.Свернуть("ВидНоменклатуры, Категория", "Количество");
			
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			Если ТекущаяСтрока.Количество > 1 Тогда
				Сообщить("В таблице выработки по видам номенклатуры задвоены записи по виду """ + ТекущаяСтрока.ВидНоменклатуры + """");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		//проверим на задвоения - номенклатура
		ВремТаблица = Новый ТаблицаЗначений;
		ВремТаблица = Объект.ВыработкаПоНоменклатуре.Выгрузить();
		ВремТаблица.Колонки.Добавить("Количество");
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			ТекущаяСтрока.Количество = 1;
		КонецЦикла;
		// #6385
		Если Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж
			//++ #16579
			//И Объект.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказДоговор			
			//И ПолучитьФункциональнуюОпцию("ПриРасчетеВыработкиПоМонтажуУчитыватьПроцентОтклоненияОтПрайса")
			И Объект.УчитыватьПроцентОтклоненияОтПрайса
			//-- #16579
			Тогда
			ВремТаблица.Свернуть("Номенклатура, СкидкаВПроцентахОт", "Количество");
			
		ИначеЕсли Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции Тогда
			ВремТаблица.Свернуть("Номенклатура, Применение", "Количество");
			
		Иначе
			ВремТаблица.Свернуть("Номенклатура", "Количество");
		КонецЕсли;
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			Если ТекущаяСтрока.Количество > 1 Тогда
				Сообщить("В таблице выработки по номенклатуре задвоены записи по """ + ТекущаяСтрока.Номенклатура + """");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		//вид номенклатуры - в строке должно быть что-то одно - или процент или сумма
		Для Каждого ТекущаяСтрока Из Объект.ВыработкаПоВидамНоменклатуры Цикл
			Если НЕ ТекущаяСтрока.СтоимостьСуммой = 0 И (НЕ ТекущаяСтрока.СтоимостьПроцентом = 0 ИЛИ НЕ ТекущаяСтрока.СтоимостьЗаФактПрисутствия = 0) Тогда
				Сообщить("В таблице по видам номенклатуры в строке №" + СтрЗаменить(ТекущаяСтрока.НомерСтроки,Символ(160),"") + " для вида """+ТекущаяСтрока.ВидНоменклатуры+""" указана стоимость выработки и по количеству и по сумме. Необходимо оставить только один из параметров.");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		//номенклатура - в строке должно быть что-то одно - или процент или сумма
		Для Каждого ТекущаяСтрока Из Объект.ВыработкаПоНоменклатуре Цикл
			Если НЕ ТекущаяСтрока.СтоимостьСуммой = 0 И (НЕ ТекущаяСтрока.СтоимостьПроцентом = 0 ИЛИ НЕ ТекущаяСтрока.СтоимостьЗаФактПрисутствия = 0) Тогда
				Сообщить("В таблице по номенклатуре в строке №" + СтрЗаменить(ТекущаяСтрока.НомерСтроки,Символ(160),"") + " для номенклатуры """+ТекущаяСтрока.Номенклатура+""" указана стоимость выработки и по количеству и по сумме. Необходимо оставить только один из параметров.");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из Объект.ВыработкаПоВидамНоменклатуры Цикл
			Если НЕ ТекущаяСтрока.Категория.Пустая() и ТекущаяСтрока.ВидНоменклатуры.Пустая() Тогда
				Сообщить("В таблице по видам номенклатуры в строке №" + СтрЗаменить(ТекущаяСтрока.НомерСтроки,Символ(160),"") + " указана категория, но не указан вид номенклатуры. Укажите вид номенклатуры");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		//корректность заполнения по лиду
		Если Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Лид Тогда
			Для Каждого ТекущаяСтрока Из Объект.ВыработкаЛид Цикл
				Если ТекущаяСтрока.СтатусЛида.Пустая() Тогда
					Сообщить("В таблице по видам лидов в строке №" + СтрЗаменить(ТекущаяСтрока.НомерСтроки,Символ(160),"") + " не указан текущий статус лида");
					Отказ = Истина;
				КонецЕсли;
				Если НЕ ТекущаяСтрока.РекламнаяАкция.Пустая() И
					(ТекущаяСтрока.РекламныйИсточник.Пустая()
					ИЛИ ТекущаяСтрока.ТочкаПродаж.Пустая()
					ИЛИ ТекущаяСтрока.ВидКонтакта.Пустая()) Тогда
					Сообщить("В таблице по видам лидов в строке №" + СтрЗаменить(ТекущаяСтрока.НомерСтроки,Символ(160),"") + " заполнены не все детали лида (вид контакта, точка продаж, рекламный источник)");
					Отказ = Истина;
				ИначеЕсли НЕ ТекущаяСтрока.РекламныйИсточник.Пустая() И
					(ТекущаяСтрока.ТочкаПродаж.Пустая()
					ИЛИ ТекущаяСтрока.ВидКонтакта.Пустая()) Тогда
					Сообщить("В таблице по видам лидов в строке №" + СтрЗаменить(ТекущаяСтрока.НомерСтроки,Символ(160),"") + " заполнены не все детали лида (вид контакта, точка продаж)");
					Отказ = Истина;
				ИначеЕсли НЕ ТекущаяСтрока.ТочкаПродаж.Пустая()
					И ТекущаяСтрока.ВидКонтакта.Пустая() Тогда
					Сообщить("В таблице по видам лидов в строке №" + СтрЗаменить(ТекущаяСтрока.НомерСтроки,Символ(160),"") + " заполнены не все детали лида (вид контакта)");
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции
			И НЕ Объект.ВидНоменклатурыПотолкаТиповоеПроизводство
			И НЕ ЗначениеЗаполнено(Объект.ВидНоменклатурыПотолка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Не заполнено поле ""Вид номенклатуры продукции""!'"), , "ВидНоменклатурыПродукции", , Отказ);
		КонецЕсли;
			
		//#16283 
		Если Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции
			И ВидНоменклатурыПродукции = "Продукция"
			И НЕ ЗначениеЗаполнено(Объект.ВидПродукции) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Не заполнено поле ""Вид продукции""!'"), , "Объект.ВидПродукции", , Отказ);
		КонецЕсли;
			
		
		Если Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж Тогда
			
			// перенесено в Модуль объекта
			//	И НЕ ЗначениеЗаполнено(Объект.ВидМонтажа) Тогда
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			//		НСтр("ru = 'Не заполнен вид монтажа!'"), ТекущийОбъект,
			//		"ВидМонтажа",,Отказ);
			         			
			//#6385
			ПроверятьСкидкуВПроцентах = Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж
			                 			//++ #16579
			                            //И Объект.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказДоговор
										//И ПолучитьФункциональнуюОпцию("ПриРасчетеВыработкиПоМонтажуУчитыватьПроцентОтклоненияОтПрайса");
										И Объект.УчитыватьПроцентОтклоненияОтПрайса;
										//-- #16579
				
			Если ПроверятьСкидкуВПроцентах Тогда
				Для каждого СтрокаТЧ из Объект.ВыработкаПоВидамНоменклатуры Цикл
					Если СтрокаТЧ.СкидкаВПроцентахОт > СтрокаТЧ.СкидкаВПроцентахДо Тогда
						ТекстСообщения = "Неверно указан диапазон процентов скидки в строке " + СтрокаТЧ.НомерСтроки;
						ПолеОшибки = "Объект.ВыработкаПоВидамНоменклатуры[" + Формат(СтрокаТЧ.НомерСтроки-1, "ЧГ=") + "].ОтклонениеОтПрайсаОт";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ПолеОшибки, , Отказ);
					КонецЕсли;
				КонецЦикла;
				Для каждого СтрокаТЧ из Объект.ВыработкаПоНоменклатуре Цикл
					Если СтрокаТЧ.СкидкаВПроцентахОт > СтрокаТЧ.СкидкаВПроцентахДо Тогда
						ТекстСообщения = "Неверно указан диапазон процентов скидки в строке " + СтрокаТЧ.НомерСтроки;
						ПолеОшибки = "Объект.ВыработкаПоНоменклатуре[" + Формат(СтрокаТЧ.НомерСтроки-1, "ЧГ=") + "].ОтклонениеОтПрайсаОт";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ПолеОшибки, , Отказ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;


		Если Отказ Тогда
			Сообщить("Проведение документа отменено.");
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбщийМодульКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// #16609
	ОбновитьПредставлениеОтклоненийОтПрайса();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщийМодульКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщийМодульКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщийМодульКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредыдущимиЗначениями(Команда)
	
	ПараметрыФормы  = Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина);
    ОбработкаВыбора = Новый ОписаниеОповещения("ВыборДокументаЗавершение", ЭтаФорма);   
    ОткрытьФорму("Документ.УстановкаСтоимостиВыработкиПоНоменклатуре.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОбработкаВыбора);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ВыборДокументаЗавершение(Значение, ДопПараметры) Экспорт
	
    Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	ЗаполнитьПредыдущимиЗначениямиНаСервере(Значение);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредыдущимиЗначениямиНаСервере(ДокументУСВ)
	
	ЗаполнитьЗначенияСвойств(Объект, ДокументУСВ, "СуммаВыработкиНеМенее, СуммаВыработкиНеБолееПроцентаОтСуммыДокумента, СтоимостьЗаДокумент"); 
	 
	Для каждого СтрокаТЧ из ДокументУСВ.ВыработкаПоВидамНоменклатуры Цикл
		СтруктураПоиска = Новый Структура("ВидНоменклатуры, Категория", СтрокаТЧ.ВидНоменклатуры, СтрокаТЧ.Категория);
		НайденныеСтроки = Объект.ВыработкаПоВидамНоменклатуры.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Строка = НайденныеСтроки[0]; 
		Иначе
			Строка = Объект.ВыработкаПоВидамНоменклатуры.Добавить(); 
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Строка, СтрокаТЧ);
	КонецЦикла;
	
	Для каждого СтрокаТЧ из ДокументУСВ.ВыработкаПоНоменклатуре Цикл
		СтруктураПоиска = Новый Структура("Номенклатура", СтрокаТЧ.Номенклатура);
		НайденныеСтроки = Объект.ВыработкаПоНоменклатуре.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Строка = НайденныеСтроки[0]; 
		Иначе
			Строка = Объект.ВыработкаПоНоменклатуре.Добавить(); 
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Строка, СтрокаТЧ);
	КонецЦикла;
	
	Для каждого СтрокаТЧ из ДокументУСВ.ВыработкаЛид Цикл
		СтруктураПоиска = Новый Структура("ВидКонтакта, ТочкаПродаж, РекламныйИсточник, РекламнаяАкция, СтатусЛида");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
		НайденныеСтроки = Объект.ВыработкаЛид.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Строка = НайденныеСтроки[0]; 
		Иначе
			Строка = Объект.ВыработкаЛид.Добавить(); 
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Строка, СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаправлениеДеятельностиПриИзменении(Элемент)
	
	Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ПустаяСсылка");
	ВидДокументаРасчетаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МассивПараметровВыбора = Новый Массив;
	
	Если Объект.НаправлениеДеятельности = ПредопределенноеЗначение("Перечисление.НаправленияДеятельности.Розница") Тогда
		НовыйПараметрВыбора = Новый ПараметрВыбора("Отбор.Розница", Истина);
		МассивПараметровВыбора.Добавить(НовыйПараметрВыбора);
		НовыйПараметрВыбора = Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь);
		МассивПараметровВыбора.Добавить(НовыйПараметрВыбора);

	ИначеЕсли Объект.НаправлениеДеятельности = ПредопределенноеЗначение("Перечисление.НаправленияДеятельности.Производство") Тогда
		НовыйПараметрВыбора = Новый ПараметрВыбора("Отбор.Производство", Истина);
		МассивПараметровВыбора.Добавить(НовыйПараметрВыбора);
		НовыйПараметрВыбора = Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь);
		МассивПараметровВыбора.Добавить(НовыйПараметрВыбора);
		
	Иначе
		НовыйПараметрВыбора1 = Новый ПараметрВыбора("Отбор.Розница", Ложь);
		НовыйПараметрВыбора2 = Новый ПараметрВыбора("Отбор.Производство", Ложь);
		МассивПараметровВыбора.Добавить(НовыйПараметрВыбора1);
		МассивПараметровВыбора.Добавить(НовыйПараметрВыбора2);
		НовыйПараметрВыбора = Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь);
		МассивПараметровВыбора.Добавить(НовыйПараметрВыбора);
		
	КонецЕсли;

	Элементы.ВидДокументаРасчета.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаРасчетаПриИзменении(Элемент)
	
	Объект.ВидИсполнителя = ПредопределенноеЗначение("Справочник.ВидыИсполнителей.ПустаяСсылка");
	Если Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Лид") Тогда
		Объект.ВидИсполнителя = ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЛиде");
		
	ИначеЕсли Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции") Тогда
		Объект.ВидИсполнителя = ПредопределенноеЗначение("Справочник.ВидыИсполнителей.СотрудникПроизводства");
		
	ИначеЕсли Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ЗаказПокупателя") Тогда
		Объект.ВидИсполнителя = ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЗаказеПокупателя");
	КонецЕсли;
	ВидИсполнителяПриИзмененииНаСервере();

	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаОснованияПриИзменении(Элемент)
	УправлениеФормойНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаОснованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СформироватьДанныеВыбораВидаДокументаОснования(Объект.ВидДокументаРасчета, ДанныеВыбора, , СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИсполнителяПриИзменении(Элемент)
	
	ВидИсполнителяПриИзмененииНаСервере();
	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидИсполнителяПриИзмененииНаСервере()
	
	Объект.ВидНачисления = Справочники.ВидыНачислений.ПустаяСсылка();
	Если ЗначениеЗаполнено(Объект.ВидИсполнителя) Тогда
		ИмяПредопределенных = Объект.ВидИсполнителя.ИмяПредопределенныхДанных;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ разрешенные
		|	ВидыНачислений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыНачислений КАК ВидыНачислений
		|ГДЕ
		|	ВидыНачислений.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных";
		
		Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ИмяПредопределенных);	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Объект.ВидНачисления = Выборка.Ссылка;	
		КонецЕсли; 
	КонецЕсли;	
	
	Если Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж И объект.ВидИсполнителя = Справочники.ВидыИсполнителей.Монтажник Тогда
		Объект.СпособРаспределенияВыработкиПоМонтажникам = Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.ПоКоэффициентам;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ВидИсполнителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.СформироватьДанныеВыбораВидаИсполнителя(Объект.ВидДокументаРасчета, ДанныеВыбора, , СтандартнаяОбработка);
	
	//Если Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции") Тогда		
	//	СтандартнаяОбработка = Ложь;
	//	ДанныеВыбора = Новый СписокЗначений;
	//	СформироватьДанныеВыбораВидаИсполнителяПоВыпуску(ДанныеВыбора);
	//ИначеЕсли Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ЗаказПокупателя") Тогда		
	//	СтандартнаяОбработка = Ложь;
	//	ДанныеВыбора = Новый СписокЗначений;
	//	СформироватьДанныеВыбораВидаИсполнителяПоЗаказуПокупателя(ДанныеВыбора);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИсполнителяАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		ОбщийМодульКлиент.СформироватьДанныеВыбораВидаИсполнителя(Объект.ВидДокументаРасчета, ДанныеВыбора, Текст, СтандартнаяОбработка);
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Текст) И Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции") Тогда	
	//	СтандартнаяОбработка = Ложь;
	//	ДанныеВыбора = Новый СписокЗначений;
	//	СформироватьДанныеВыбораВидаИсполнителяПоВыпуску(ДанныеВыбора, Текст);	
	//ИначеЕсли ЗначениеЗаполнено(Текст) И Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ЗаказПокупателя") Тогда	
	//	СтандартнаяОбработка = Ложь;
	//	ДанныеВыбора = Новый СписокЗначений;
	//	СформироватьДанныеВыбораВидаИсполнителяПоЗаказуПокупателя(ДанныеВыбора, Текст);	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИсполнителяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		ОбщийМодульКлиент.СформироватьДанныеВыбораВидаИсполнителя(Объект.ВидДокументаРасчета, ДанныеВыбора, Текст, СтандартнаяОбработка);
	КонецЕсли;

	//Если ЗначениеЗаполнено(Текст) И Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции") Тогда
	//	СтандартнаяОбработка = Ложь;
	//	ДанныеВыбора = Новый СписокЗначений;
	//	СформироватьДанныеВыбораВидаИсполнителяПоВыпуску(ДанныеВыбора, Текст);	
	//ИначеЕсли ЗначениеЗаполнено(Текст) И Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ЗаказПокупателя") Тогда	
	//	СтандартнаяОбработка = Ложь;
	//	ДанныеВыбора = Новый СписокЗначений;
	//	СформироватьДанныеВыбораВидаИсполнителяПоЗаказуПокупателя(ДанныеВыбора, Текст);	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияВыработкиПоМонтажникамПриИзменении(Элемент)
	УправлениеФормойНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ТарифИсполнителяПриИзменении(Элемент)
	УправлениеФормойНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПродукцииПриИзменении(Элемент)
	
	Если ПустаяСтрока(ВидНоменклатурыПродукции) ИЛИ ВидНоменклатурыПродукции = "ТиповоеПроизводство" Тогда
		Объект.ВидНоменклатурыПотолка = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.ПустаяСсылка");
	Иначе
		Объект.ВидНоменклатурыПотолка = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры." + ВидНоменклатурыПродукции);
	КонецЕсли;
	
	Объект.ВидНоменклатурыПотолкаТиповоеПроизводство = (ВидНоменклатурыПродукции = "ТиповоеПроизводство");
	
	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПотолкаТиповоеПроизводствоПриИзменении(Элемент)
	
	Если Объект.ВидНоменклатурыПотолкаТиповоеПроизводство Тогда
		Объект.ВидНоменклатурыПотолка = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.ПустаяСсылка");
	КонецЕсли;
	Элементы.ВидНоменклатурыПотолка.Доступность = НЕ Объект.ВидНоменклатурыПотолкаТиповоеПроизводство;
	
	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПотолкаПриИзменении(Элемент)
	УправлениеФормойНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроизводственнаяОперацияПриИзменении(Элемент)
	УправлениеФормойНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьПроцентОтклоненияОтПрайсаПриИзменении(Элемент)
	
	УправлениеФормойНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыВыработкаПоВидамНоменклатуры

&НаКлиенте
Процедура ВыработкаПоВидамНоменклатурыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		Элемент.ТекущиеДанные.СпособУказанияОтклонения = "Без отклонений";	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоВидамНоменклатурыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//ОбновитьФормуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоВидамНоменклатурыПослеУдаления(Элемент)
	//ОбновитьФормуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоВидамНоменклатурыВидНоменклатурыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВыработкаПоВидамНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.ВидПродукции = ПредопределенноеЗначение("Справочник.ВидыПродукции.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоВидамНоменклатурыНеНачислятьВыработкуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВыработкаПоВидамНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные.НеНачислятьВыработку Тогда
		ТекущиеДанные.СтоимостьСуммой = 0;
		ТекущиеДанные.СтоимостьПроцентом = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоВидамНоменклатурыСтоимостьСуммойПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВыработкаПоВидамНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные.НеНачислятьВыработку Тогда
		ТекущиеДанные.СтоимостьСуммой = 0;
		ТекущиеДанные.СтоимостьПроцентом = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоВидамНоменклатурыСтоимостьПроцентомПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВыработкаПоВидамНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные.НеНачислятьВыработку Тогда
		ТекущиеДанные.СтоимостьСуммой = 0;
		ТекущиеДанные.СтоимостьПроцентом = 0;
	КонецЕсли;
	//Если ТекущиеДанные.СтоимостьПроцентом = 0 Тогда
	//	ТекущиеДанные.ОтПрибыли = Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоВидамНоменклатурыОтПрибылиПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.ВыработкаПоВидамНоменклатуры.ТекущиеДанные;
	//Если ТекущиеДанные.СтоимостьПроцентом = 0 Тогда
	//	ТекущиеДанные.ОтПрибыли = Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоВидамНоменклатурыПрименениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//++ №14035
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПрименениеНоменклатурыДляВыработки.Материалы"));
	
	Если Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции") Тогда
		
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПрименениеНоменклатурыДляВыработки.Продукция"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПрименениеНоменклатурыДляВыработки.ПроизводственныеУслуги"));
		
	КонецЕсли;
	
	Если Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Монтаж") 
		//ИЛИ Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Продажа")
		//ИЛИ Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Рекламация")	
		//ИЛИ Объект.ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.СервиснаяЗаявка")
		Тогда
		
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПрименениеНоменклатурыДляВыработки.ТоварыИУслуги"));
		
	КонецЕсли;
	//-- №14035
	
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоВидамНоменклатурыСпособУказанияОтклоненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВыработкаПоВидамНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные.СпособУказанияОтклонения = "Без отклонений" Тогда
		ТекущиеДанные.ОтклонениеОтПрайсаОт = 0;
		ТекущиеДанные.ОтклонениеОтПрайсаДо = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандТаблицыВыработкаПоВидамНоменклатуры

&НаКлиенте
Процедура ДобавитьВсеВиды(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьВсеВидыЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Дополнить всеми видами номенклатуры?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсеВидыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДобавитьВсеВидыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВсеВидыНаСервере()
	
	СписокДействующихВидов = Справочники.ВидыНоменклатуры.СписокДействующихВидов();
	Для каждого Вид из СписокДействующихВидов Цикл	
		// Нужно проверить наличие в таблице, чтобы не добавить дубль
		Если Объект.ВыработкаПоВидамНоменклатуры.НайтиСтроки(Новый Структура("ВидНоменклатуры", Вид.Значение)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.ВыработкаПоВидамНоменклатуры.Добавить();
		НоваяСтрока.ВидНоменклатуры = Вид.Значение;		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыВыработкаПоНоменклатуре

&НаКлиенте
Процедура ВыработкаПоНоменклатуреПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		Элемент.ТекущиеДанные.СпособУказанияОтклонения = "Без отклонений";	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоНоменклатуреПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//ОбновитьФормуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоНоменклатуреПослеУдаления(Элемент)
	//ОбновитьФормуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоНоменклатуреНеНачислятьВыработкуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВыработкаПоНоменклатуре.ТекущиеДанные;
	Если ТекущиеДанные.НеНачислятьВыработку Тогда
		ТекущиеДанные.СтоимостьСуммой = 0;
		ТекущиеДанные.СтоимостьПроцентом = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоНоменклатуреСтоимостьСуммойПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВыработкаПоНоменклатуре.ТекущиеДанные;
	Если ТекущиеДанные.НеНачислятьВыработку Тогда
		ТекущиеДанные.СтоимостьСуммой = 0;
		ТекущиеДанные.СтоимостьПроцентом = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоНоменклатуреСтоимостьПроцентомПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВыработкаПоНоменклатуре.ТекущиеДанные;
	Если ТекущиеДанные.НеНачислятьВыработку Тогда
		ТекущиеДанные.СтоимостьСуммой = 0;
		ТекущиеДанные.СтоимостьПроцентом = 0;
	КонецЕсли;
	//Если ТекущиеДанные.СтоимостьПроцентом = 0 Тогда
	//	ТекущиеДанные.ОтПрибыли = Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоНоменклатуреОтПрибылиПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.ВыработкаПоНоменклатуре.ТекущиеДанные;
	//Если ТекущиеДанные.СтоимостьПроцентом = 0 Тогда
	//	ТекущиеДанные.ОтПрибыли = Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаПоНоменклатуреСпособУказанияОтклоненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВыработкаПоНоменклатуре.ТекущиеДанные;
	Если ТекущиеДанные.СпособУказанияОтклонения = "Без отклонений" Тогда
		ТекущиеДанные.ОтклонениеОтПрайсаОт = 0;
		ТекущиеДанные.ОтклонениеОтПрайсаДо = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандТаблицыВыработкаПоНоменклатуре

&НаКлиенте
Процедура ЗаполнитьПоГруппеНоменклатуры(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",,,,,, новый ОписаниеОповещения("ПослеВыбораГруппыНоменклатурыДляЗаполнения", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораГруппыНоменклатурыДляЗаполнения(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		ЗаполнитьПоГруппеНоменклатурыНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГруппеНоменклатурыНаСервере(ГруппаНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры)
	|	И НЕ Номенклатура.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", ГруппаНоменклатуры);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Сообщить ("Выбранная папка Номенклатуры пустая", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Нужно проверить наличие в таблице, чтобы не добавить дубль
		Если Объект.ВыработкаПоНоменклатуре.НайтиСтроки(новый Структура("Номенклатура", Выборка.Номенклатура)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.ВыработкаПоНоменклатуре.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСтоимостьЗаЕдиницу(Команда)
	
	ОповещениеПослеВВодаСтоимостиЗаЕдиницу = Новый ОписаниеОповещения("ПослеВводаСтоимостиЗаЕдиницу",ЭтаФорма);
	ПоказатьВводЧисла(ОповещениеПослеВВодаСтоимостиЗаЕдиницу,0,"Введите стоимость за единицу товара",15,2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтоимостиЗаЕдиницу(Число, Параметры) Экспорт
	
	Если НЕ Число = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из Объект.ВыработкаПоНоменклатуре Цикл
			Если НЕ ТекущаяСтрока.НеНачислятьВыработку Тогда
				ТекущаяСтрока.СтоимостьСуммой = Число;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСтоимостьЗаСумму(Команда)
	
	ОповещениеПослеВВодаСтоимостиЗаСумму = Новый ОписаниеОповещения("ПослеВВодаСтоимостиЗаСумму",ЭтаФорма);
	ПоказатьВводЧисла(ОповещениеПослеВВодаСтоимостиЗаСумму,0,"Введите стоимость в % от суммы продаж",15,2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВВодаСтоимостиЗаСумму(Число, Параметры) Экспорт
	
	Если НЕ Число = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из Объект.ВыработкаПоНоменклатуре Цикл
			Если НЕ ТекущаяСтрока.НеНачислятьВыработку Тогда
				ТекущаяСтрока.СтоимостьПроцентом = Число;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНеНачислятьВсем(Команда)
	
	Для Каждого ТекущаяСтрока Из Объект.ВыработкаПоНоменклатуре Цикл
		ТекущаяСтрока.НеНачислятьВыработку = Истина;
		ТекущаяСтрока.СтоимостьСуммой = 0;
		ТекущаяСтрока.СтоимостьПроцентом = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНачислятьПоВсем(Команда)
	Для Каждого ТекущаяСтрока Из Объект.ВыработкаПоНоменклатуре Цикл
		ТекущаяСтрока.НеНачислятьВыработку = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьПоВыработке(Команда)
	
	Для Каждого ТекущаяСтрока Из Объект.ВыработкаПоНоменклатуре Цикл
		ТекущаяСтрока.ПоВыработке = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьПоВыработке(Команда)
	
	Для Каждого ТекущаяСтрока Из Объект.ВыработкаПоНоменклатуре Цикл
		ТекущаяСтрока.ПоВыработке = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтклонениеОтПрайсаОт(Команда)
	ЗаполнитьОтклонениеОтПрайса(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтклонениеОтПрайсаДо(Команда)
	ЗаполнитьОтклонениеОтПрайса(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтклонениеОтПрайса(ЭтоЗначениеОт) 

	ОповещениеПослеВВодаСтоимостиЗаЕдиницу = Новый ОписаниеОповещения("ПослеВводаЗначенияОтклоненияОтПрайса", ЭтаФорма, ЭтоЗначениеОт);
	ПоказатьВводЧисла(ОповещениеПослеВВодаСтоимостиЗаЕдиницу,0, "Введите процент отклонения", 15, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияОтклоненияОтПрайса(Число, ДополнительныеПараметры) Экспорт
	
	Если Число = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ЭтоЗначениеОт = ДополнительныеПараметры;
	ИмяПоля = ?(ЭтоЗначениеОт, "СкидкаВПроцентахОт", "СкидкаВПроцентахДо");
	Для Каждого ТекущаяСтрока Из Объект.ВыработкаПоНоменклатуре Цикл
		ТекущаяСтрока[ИмяПоля] = Число;
	КонецЦикла;
	
	// #16609
	ОбновитьПредставлениеОтклоненийОтПрайса();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрименение(Команда)
	
	//#6265	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаЗначенияПрименения", ЭтаФорма);
	ПоказатьВводЗначения(ОписаниеОповещения, ПредопределенноеЗначение("Перечисление.ПрименениеНоменклатурыДляВыработки.Материалы"), "Выберите значение");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияПрименения(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	Для Каждого ТекущаяСтрока Из Объект.ВыработкаПоНоменклатуре Цикл
		ТекущаяСтрока.Применение = Результат;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиОбщие

&НаКлиенте
Процедура СуммаВыработкиНеМенееПриИзменении(Элемент)
	ОбновитьЗаголовкиСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура СуммаВыработкиНеБолееПроцентаОтСуммыДокументаПриИзменении(Элемент)
	ОбновитьЗаголовкиСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьЗаДокументПриИзменении(Элемент)
	ОбновитьЗаголовкиСтраниц();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыВыработкаЗаЛид

&НаКлиенте
Процедура ВыработкаЗаДокументРекламнаяАкцияПриИзменении(Элемент)
	
	ТекДанные = Элементы.ВыработкаЗаДокумент.ТекущиеДанные;
	Если ТекДанные.РекламнаяАкция.Пустая() Тогда
		Элементы.ВыработкаЗаДокументРекламныйИсточник.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументРекламныйИсточник.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ТекДанные.РекламныйИсточник.Пустая() Тогда
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ТекДанные.ТочкаПродаж.Пустая() Тогда
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаЗаДокументРекламныйИсточникПриИзменении(Элемент)
	
	ТекДанные = Элементы.ВыработкаЗаДокумент.ТекущиеДанные;
	Если ТекДанные.РекламнаяАкция.Пустая() Тогда
		Элементы.ВыработкаЗаДокументРекламныйИсточник.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументРекламныйИсточник.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ТекДанные.РекламныйИсточник.Пустая() Тогда
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ТекДанные.ТочкаПродаж.Пустая() Тогда
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаЗаДокументТочкаПродажПриИзменении(Элемент)
	
	ТекДанные = Элементы.ВыработкаЗаДокумент.ТекущиеДанные;
	Если ТекДанные.РекламнаяАкция.Пустая() Тогда
		Элементы.ВыработкаЗаДокументРекламныйИсточник.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументРекламныйИсточник.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ТекДанные.РекламныйИсточник.Пустая() Тогда
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ТекДанные.ТочкаПродаж.Пустая() Тогда
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыработкаЗаДокументВидКонтактаПриИзменении(Элемент)
	ТекДанные = Элементы.ВыработкаЗаДокумент.ТекущиеДанные;
	Если ТекДанные.РекламнаяАкция.Пустая() Тогда
		Элементы.ВыработкаЗаДокументРекламныйИсточник.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументРекламныйИсточник.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ТекДанные.РекламныйИсточник.Пустая() Тогда
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументТочкаПродаж.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ТекДанные.ТочкаПродаж.Пустая() Тогда
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ВыработкаЗаДокументВидКонтакта.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Не требуется заполенние вида продукции";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоВидамНоменклатурыВидПродукции");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоВидамНоменклатуры.ВидНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Справочники.ВидыНоменклатуры.Продукция;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<не требуется>");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоВидамНоменклатурыОтклонениеОтПрайсаДо");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоВидамНоменклатуры.ОтклонениеОтПрайсаДо");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "0,00");
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоВидамНоменклатурыОтклонениеОтПрайсаОт");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоВидамНоменклатуры.ОтклонениеОтПрайсаОт");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "0,00");
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоНоменклатуреОтклонениеОтПрайсаОт");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоНоменклатуре.ОтклонениеОтПрайсаОт");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "0,00");
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоНоменклатуреОтклонениеОтПрайсаДо");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоНоменклатуре.ОтклонениеОтПрайсаДо");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "0,00");
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоВидамНоменклатурыОтклонениеОтПрайсаОт");
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоВидамНоменклатурыОтклонениеОтПрайсаДо");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоВидамНоменклатуры.СпособУказанияОтклонения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Без отклонений";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоНоменклатуреОтклонениеОтПрайсаОт");
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоНоменклатуреОтклонениеОтПрайсаДо");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоНоменклатуре.СпособУказанияОтклонения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Без отклонений";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоВидамНоменклатурыОтклонениеОтПрайсаДо");
	
	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоВидамНоменклатуры.СпособУказанияОтклонения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = "Без отклонений";
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоВидамНоменклатуры.ОтклонениеОтПрайсаОт");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоВидамНоменклатуры.ОтклонениеОтПрайсаДо");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоНоменклатуреОтклонениеОтПрайсаДо");
	
	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоНоменклатуре.СпособУказанияОтклонения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = "Без отклонений";
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоНоменклатуре.ОтклонениеОтПрайсаОт");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоНоменклатуре.ОтклонениеОтПрайсаДо");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	
	
	
	//
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//		
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоВидамНоменклатурыОтклонениеОтПрайсаДо");
	//
	//ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	//
	//ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоВидамНоменклатуры.ОтклонениеОтПрайсаОт");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	//
	//ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоВидамНоменклатуры.ОтклонениеОтПрайсаДо");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = 0;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	//
	////
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//		
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоНоменклатуреОтклонениеОтПрайсаОт");
	//
	//ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	//
	//ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоНоменклатуре.ОтклонениеОтПрайсаОт");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = 0;
	//
	//ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоНоменклатуре.ОтклонениеОтПрайсаДо");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	//
	////
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//		
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыработкаПоНоменклатуреОтклонениеОтПрайсаДо");
	//
	//ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	//
	//ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоНоменклатуре.ОтклонениеОтПрайсаОт");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	//
	//ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыработкаПоНоменклатуре.ОтклонениеОтПрайсаДо");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = 0;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовкиСтраниц()

	КоличествоОбщие = ?(НЕ Объект.СуммаВыработкиНеМенее = 0, 1, 0) + 
					  ?(НЕ Объект.СуммаВыработкиНеБолееПроцентаОтСуммыДокумента = 0, 1, 0) + 
					  ?(НЕ Объект.СтоимостьЗаДокумент = 0, 1, 0);
	Элементы.ГруппаОбщиеНастройки.Заголовок = "Общие" + ?(КоличествоОбщие = 0, "", " (" + КоличествоОбщие + ")");
	
КонецПроцедуры
	
&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщийМодульКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// #14355
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	ДополнительныеПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
			
	Отказ = Истина;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеПередЗаписью", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = СтрШаблон("Изменения ранее %1 документа ""Установка стоимости выработки"" 
					|может привести к расхождениям в начислении выработки во всех документах, 
					|оформленных датой позднее текущего документа ""Установка стоимости выработки"". 
					|Продолжить?", ?(ОбщийМодульВызовСервера.ДокументПроведен(Объект.Ссылка), "проведенного", "непроведенного"));
	ПоказатьВопрос(
		ОписаниеОповещения,
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПередЗаписью(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗаписи,, Истина);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормойНаСервере()
	
	Элементы.ВнутренниеПродажи.Видимость = Ложь; 
	
	Элементы.ВидМонтажнойБригады.Видимость = Ложь;
	Элементы.ДоВычетаБонусов.Видимость = Ложь;
	//Элементы.ГруппаТариф.Видимость = Ложь;
	//Элементы.ГруппаИсполнителиМонтажник.Видимость = Ложь; №7275 комментируем т.к. в группе есть элементы, которые должны отображаться в виде исполнителя Бригадир
	Элементы.ГруппаМонтаж.Видимость = Ложь;
	Элементы.ГруппаДокумент.Видимость = Ложь;
	Элементы.ВидИсполнителя.Доступность = Истина;
	
	Элементы.ГруппаВыработкаПоВидамНоменклатуры.Видимость 	= Истина;
	Элементы.ГруппаВыработкаПоНоменклатуре.Видимость 		= Истина;
	Элементы.ГруппаОбщиеНастройки.Видимость 				= Истина;
	Элементы.ГруппаДокумент.Видимость 						= Ложь;
	Элементы.Организация.Видимость 							= Истина;
	Элементы.ВидДокументаОснования.Видимость 				= Ложь;
	Элементы.ИсточникЗаказаПокупателя.Видимость 			= Ложь;
	Элементы.ВидИсполнителя.Доступность 					= Истина;
	Элементы.ГруппаВидПотолка.Видимость 					= Ложь;
	Элементы.ГруппаФактурностьПотолка.Видимость				= Ложь; // №1842
	Элементы.ПроизводственнаяОперация.Видимость				= Ложь; // №1842
	// элементы ТЧ
	Элементы.ВыработкаПоНоменклатуреПоВыработке.Видимость 		= Ложь;
	Элементы.ВыработкаПоВидамНоменклатурыПоВыработке.Видимость 	= Ложь;
	//Элементы.ВыработкаПоНоменклатуреОтПрибыли.Видимость 		= Ложь;
	//Элементы.ВыработкаПоВидамНоменклатурыОтПрибыли.Видимость 	= Ложь;
	Элементы.ВыработкаПоВидамНоменклатурыДелитсяНаВсех.Видимость= Ложь;
	Элементы.ВыработкаПоНоменклатуреДелитсяНаВсех.Видимость 	= Ложь;
	Элементы.ВыработкаПоВидамНоменклатурыСтоимостьПроцентом.Видимость 	= Ложь;
	Элементы.ВыработкаПоВидамНоменклатурыГруппаУсловия.Видимость = Ложь;
	Элементы.ВыработкаПоНоменклатуреГруппаУсловия.Видимость = Ложь;
	Элементы.ВыработкаПоНоменклатуреСтоимостьПроцентом.Видимость = Истина;
	
	Элементы.СтатусЗаказа.Видимость = Ложь;
	
	Элементы.СпособРаспределенияВыработкиПоМонтажникам.Видимость = Ложь;
	Элементы.ТарифИсполнителя.Видимость = Ложь; // №7275 регулируем отдельно от группы
	Элементы.УчитыватьКоличествоИсполнителейИКТУ.Видимость = Ложь;
	Элементы.УчитыватьПроцентОтклоненияОтПрайса.Видимость = Ложь;
	
	//#6385
	Элементы.ВыработкаПоНоменклатуреГруппаОтклонениеОтПрайса.Видимость = Ложь;
	Элементы.ВыработкаПоВидамНоменклатурыГруппаОтклонениеОтПрайса.Видимость = Ложь;
	Элементы.ВыработкаПоНоменклатуреЗаполнитьСкидкаВПроцентахОт.Видимость = Ложь;
	Элементы.ВыработкаПоНоменклатуреЗаполнитьСкидкаВПроцентахДо.Видимость = Ложь;
	Элементы.ВидДокументаРасчета.ОтображениеПодсказки = ОтображениеПодсказки.Нет; // №1083
	
	//#6265
	ЭтоВыпуск  = (Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции);
	ЭтоМонтаж  = (Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж); // №14035
	//			ИЛИ (Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Рекламация)
	//			ИЛИ (Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.СервиснаяЗаявка);
	//ЭтоПродажа = (Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Продажа); // #16346 
	
	Элементы.ВыработкаПоВидамНоменклатурыПрименение.Видимость 		= (ЭтоВыпуск Или ЭтоМонтаж); // ИЛИ ЭтоПродажа);
	Элементы.ВыработкаПоНоменклатуреПрименение.Видимость      		= (ЭтоВыпуск Или ЭтоМонтаж); // ИЛИ ЭтоПродажа);
	Элементы.ВыработкаПоНоменклатуреЗаполнитьПрименение.Видимость   = (ЭтоВыпуск Или ЭтоМонтаж); // ИЛИ ЭтоПродажа);
	
	//#10991
	Элементы.ГруппаМенеджеры.Видимость = Ложь;
	
	//#16283 
	Элементы.ВидПродукции.Видимость = ЭтоВыпуск И ВидНоменклатурыПродукции = "Продукция";
	
	Если Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж 
		//ИЛИ Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Рекламация
		//ИЛИ Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.СервиснаяЗаявка
		Тогда
		
		//монтаж
		Элементы.ГруппаМонтаж.Видимость = Истина;
		Элементы.ВидДокументаОснования.Видимость = Истина;
		Если Объект.ВидИсполнителя = Справочники.ВидыИсполнителей.Бригадир
			//ИЛИ Объект.ВидИсполнителя = Справочники.ВидыИсполнителей.Монтажник 
			Тогда
			Элементы.ВидМонтажнойБригады.Видимость = Истина;
		КонецЕсли;
		Если Объект.ВидИсполнителя = Справочники.ВидыИсполнителей.Монтажник Тогда
			Элементы.СпособРаспределенияВыработкиПоМонтажникам.Видимость = Истина;
			//Элементы.ГруппаИсполнителиМонтажник.Видимость = Истина; №7275 комментируем т.к. в группе есть элементы, которые должны отображаться в виде исполнителя Бригадир
			Элементы.ТарифИсполнителя.Видимость = (Объект.СпособРаспределенияВыработкиПоМонтажникам = Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.Индивидуально);
			Элементы.ВидМонтажнойБригады.Видимость = (Объект.СпособРаспределенияВыработкиПоМонтажникам = Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.ПоКоэффициентам);
			Элементы.УчитыватьКоличествоИсполнителейИКТУ.Видимость = (Объект.СпособРаспределенияВыработкиПоМонтажникам = Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.Индивидуально) И ЗначениеЗаполнено(Объект.ТарифИсполнителя);
		КонецЕсли;
		//Элементы.ВыработкаПоНоменклатуреОтПрибыли.Видимость 	= Истина;
		//Элементы.ВыработкаПоВидамНоменклатурыОтПрибыли.Видимость 	= Истина;
		Элементы.ВыработкаПоВидамНоменклатурыСтоимостьПроцентом.Видимость 	= Истина;
		//Начало добавлен при переходе на 2.0
		Элементы.ВыработкаПоВидамНоменклатурыГруппаУсловия.Видимость = Истина;
		Элементы.ВыработкаПоНоменклатуреГруппаУсловия.Видимость = Истина;
		//Конец добавлен при переходе на 2.0
		
		Элементы.УчитыватьПроцентОтклоненияОтПрайса.Видимость = Истина;
		
		//Элементы.ВидИсполнителя.БыстрыйВыбор = Ложь;
		
		Элементы.ВидДокументаОснования.БыстрыйВыбор = Истина;
		
		//#6385
		Если Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж
			//++ #16579
			//И Объект.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказДоговор			
			//И ПолучитьФункциональнуюОпцию("ПриРасчетеВыработкиПоМонтажуУчитыватьПроцентОтклоненияОтПрайса")
			И Объект.УчитыватьПроцентОтклоненияОтПрайса
			//-- #16579
			Тогда
			
			Элементы.ВыработкаПоНоменклатуреГруппаОтклонениеОтПрайса.Видимость = Истина;
			Элементы.ВыработкаПоВидамНоменклатурыГруппаОтклонениеОтПрайса.Видимость = Истина;
			Элементы.ВыработкаПоНоменклатуреЗаполнитьСкидкаВПроцентахОт.Видимость = Истина;
			Элементы.ВыработкаПоНоменклатуреЗаполнитьСкидкаВПроцентахДо.Видимость = Истина;
		КонецЕсли;
		
		Элементы.ВидДокументаРасчета.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу; // №1083
				
	//ИначеЕсли Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Продажа Тогда
	//	
	//	Элементы.ВидДокументаОснования.Видимость = Истина;		
	//	Элементы.ВыработкаПоНоменклатуреГруппаУсловия.Видимость = Истина;
	//	
	//	Если Объект.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказДоговор
	//		И ПолучитьФункциональнуюОпцию("ПриРасчетеВыработкиПоМонтажуУчитыватьПроцентОтклоненияОтПрайса") Тогда
	//		
	//		Элементы.ВыработкаПоНоменклатуреГруппаСкидкиМонтажа.Видимость = Истина;
	//		Элементы.ВыработкаПоВидамНоменклатурыГруппаСкидкиМонтажа.Видимость = Истина;
	//		Элементы.ВыработкаПоНоменклатуреЗаполнитьСкидкаВПроцентахОт.Видимость = Истина;
	//		Элементы.ВыработкаПоНоменклатуреЗаполнитьСкидкаВПроцентахДо.Видимость = Истина;
	//	КонецЕсли;
		
	ИначеЕсли Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг Тогда
		//реализация товаров и услуг
		Элементы.ВидДокументаОснования.Видимость = Истина;
		Элементы.ВнутренниеПродажи.Видимость = Истина;
		Элементы.ДоВычетаБонусов.Видимость = Истина;
		//Элементы.ВыработкаПоНоменклатуреОтПрибыли.Видимость 	= Истина;
		//Элементы.ВыработкаПоВидамНоменклатурыОтПрибыли.Видимость = Истина;
		Элементы.ВыработкаПоВидамНоменклатурыСтоимостьПроцентом.Видимость 	= Истина;
		Элементы.ВыработкаПоВидамНоменклатурыГруппаУсловия.Видимость = Истина;
		Элементы.ВыработкаПоНоменклатуреГруппаУсловия.Видимость = Истина;	
		
		//Элементы.ВидИсполнителя.БыстрыйВыбор = Ложь;
		
		Если Объект.ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ЗаказПокупателя Тогда
			Элементы.ИсточникЗаказаПокупателя.Видимость 			= Истина;
		КонецЕсли;
		
	ИначеЕсли Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Лид Тогда
		//лид
		Элементы.ГруппаВыработкаПоВидамНоменклатуры.Видимость = Ложь;
		Элементы.ГруппаВыработкаПоНоменклатуре.Видимость = Ложь;
		Элементы.ГруппаОбщиеНастройки.Видимость = Ложь;
		Элементы.ГруппаДокумент.Видимость = Истина;
		Элементы.Организация.Видимость = Ложь;
		//Элементы.ВидИсполнителя.Доступность = Ложь; //#13943  добавлена возможность выбора  + Менеджер
		Элементы.ВыработкаПоВидамНоменклатурыСтоимостьПроцентом.Видимость 	= Истина;
		
		//Элементы.ВидИсполнителя.БыстрыйВыбор = Ложь;
		
	ИначеЕсли Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции Тогда
		//выпуск продукции
		Элементы.ГруппаВидПотолка.Видимость = Истина;
		Если Объект.ВидНоменклатурыПотолка = Справочники.ВидыНоменклатуры.Потолок Тогда // №1842
			Элементы.ГруппаФактурностьПотолка.Видимость = Истина;
		КонецЕсли;	
		Если Объект.ВидИсполнителя = Справочники.ВидыИсполнителей.СотрудникПроизводства Тогда
			//++ №6687 теперь способ определяется в документе
			//Если Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить() Тогда // №1842
			Если Объект.СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации Тогда
			//-- №6687
				Элементы.ПроизводственнаяОперация.Видимость = Истина;
			КонецЕсли;
			//#6586
			Если НЕ Элементы.ПроизводственнаяОперация.Видимость И ЗначениеЗаполнено(Объект.ПроизводственнаяОперация) Тогда
				Элементы.ПроизводственнаяОперация.Видимость = Истина;
				Элементы.ПроизводственнаяОперация.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли;
		//Элементы.ГруппаОбщиеНастройки.Видимость = Ложь;  //#16925 закомментировано
		
		Элементы.ВыработкаПоНоменклатуреПоВыработке.Видимость 		= Истина;
		Элементы.ВыработкаПоВидамНоменклатурыПоВыработке.Видимость 	= Истина;
		//Начало добавлен при переходе на 2.0
		Элементы.ВыработкаПоНоменклатуреСтоимостьПроцентом.Видимость = Ложь;
		//Конец добавлен при переходе на 2.0
		
		//#10991
		Элементы.ГруппаМенеджеры.Видимость = (Объект.ВидИсполнителя = Справочники.ВидыИсполнителей.Менеджер);
				
		//Элементы.ВидИсполнителя.БыстрыйВыбор = Истина;

	ИначеЕсли Объект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ЗаказПокупателя Тогда
		//Элементы.ВидИсполнителя.БыстрыйВыбор = Истина;
		
		//Элементы.СтатусЗаказа.Видимость = Истина; №1083 отключен отбор по статусту ЗП в УСВ
		Элементы.ВнутренниеПродажи.Видимость = Истина; // заказ от розницы
		
		Элементы.ВыработкаПоВидамНоменклатурыСтоимостьПроцентом.Видимость = Истина;
		
		//Элементы.ВыработкаПоВидамНоменклатурыГруппаУсловия.Видимость = Истина;
		//Элементы.ВыработкаПоНоменклатуреГруппаУсловия.Видимость = Истина;
		
		Элементы.ВыработкаПоНоменклатуреПоВыработке.Видимость 		= Истина;
		Элементы.ВыработкаПоВидамНоменклатурыПоВыработке.Видимость 	= Истина;
		Элементы.ВидДокументаРасчета.ОтображениеПодсказки 			= ОтображениеПодсказки.ОтображатьСнизу; // №1083
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДанныеВыбораВидаДокументаОснования(ВидДокументаРасчета, ДанныеВыбора, Текст="", СтандартнаяОбработка)

	Если ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции") Тогда		
		//СтандартнаяОбработка = Ложь;
		//ДанныеВыбора = Новый СписокЗначений;
		//СформироватьДанныеВыбораВидаДокументаОснованияПоВыпуску(ДанныеВыбора);
	ИначеЕсли ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ЗаказПокупателя") Тогда		
		//СтандартнаяОбработка = Ложь;
		//ДанныеВыбора = Новый СписокЗначений;
		//СформироватьДанныеВыбораВидаДокументаОснованияПоЗаказуПокупателя(ДанныеВыбора);
	ИначеЕсли ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Лид") Тогда		
		//СтандартнаяОбработка = Ложь;
		//ДанныеВыбора = Новый СписокЗначений;
		//СформироватьДанныеВыбораВидаДокументаОснованияПоЛиду(ДанныеВыбора);
		
	ИначеЕсли ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Монтаж") 
		//ИЛИ ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Продажа") 
		//ИЛИ ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.СервиснаяЗаявка") 
		//ИЛИ ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Рекламация") 
		Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		СформироватьДанныеВыбораВидаДокументаОснованияПоМонтажу(ДанныеВыбора);
		
	ИначеЕсли ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг") Тогда		
		//СтандартнаяОбработка = Ложь;
		//ДанныеВыбора = Новый СписокЗначений;
		//СформироватьДанныеВыбораВидаДокументаОснованияПоРеализации(ДанныеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДанныеВыбораВидаДокументаОснованияПоМонтажу(ДанныеВыбора, Текст="")
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыДокументовОснованийРасчетаВыработки.ЗаказДоговор"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДокументовОснованийРасчетаВыработки.ЗаказДоговор"), ПредставлениеЭлемента);
	КонецЕсли;
	
	//#16346 закомментировано
	//ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыДокументовОснованийРасчетаВыработки.Лид"));
	//Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
	//	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДокументовОснованийРасчетаВыработки.Лид"), ПредставлениеЭлемента);
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьВидНоменклатурыПродукции()
	
	Если Объект.ВидНоменклатурыПотолкаТиповоеПроизводство Тогда
		ВидНоменклатурыПродукции = "ТиповоеПроизводство";
	Иначе
		ВидНоменклатурыПродукции = Строка(Объект.ВидНоменклатурыПотолка.ИмяПредопределенныхДанных);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеОтклоненийОтПрайса()
	
	Для каждого СтрокаТЧ из Объект.ВыработкаПоВидамНоменклатуры Цикл
		ЗаполнитьПредставлениеОтклоненийОтПрайсаВСтрокеТЧ(СтрокаТЧ);
	КонецЦикла;
	Для каждого СтрокаТЧ из Объект.ВыработкаПоНоменклатуре Цикл
		ЗаполнитьПредставлениеОтклоненийОтПрайсаВСтрокеТЧ(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеОтклоненийОтПрайсаВСтрокеТЧ(СтрокаТЧ)
	
	Если СтрокаТЧ.СкидкаВПроцентахОт = 0 И СтрокаТЧ.СкидкаВПроцентахДо = 0 Тогда
		// Без отклонений
		СтрокаТЧ.СпособУказанияОтклонения = "Без отклонений";		
		СтрокаТЧ.ОтклонениеОтПрайсаОт = СтрокаТЧ.СкидкаВПроцентахОт;	
		СтрокаТЧ.ОтклонениеОтПрайсаДо = СтрокаТЧ.СкидкаВПроцентахДо;
		
	ИначеЕсли СтрокаТЧ.СкидкаВПроцентахОт >= 0 И СтрокаТЧ.СкидкаВПроцентахДо > 0 Тогда
		// Наценка
		СтрокаТЧ.СпособУказанияОтклонения = "Наценка";		
		СтрокаТЧ.ОтклонениеОтПрайсаОт = СтрокаТЧ.СкидкаВПроцентахОт;	
		СтрокаТЧ.ОтклонениеОтПрайсаДо = СтрокаТЧ.СкидкаВПроцентахДо;
		
	ИначеЕсли СтрокаТЧ.СкидкаВПроцентахОт < 0 И СтрокаТЧ.СкидкаВПроцентахДо <= 0 Тогда
		// Скидка
		СтрокаТЧ.СпособУказанияОтклонения = "Скидка";		
		СтрокаТЧ.ОтклонениеОтПрайсаОт = -СтрокаТЧ.СкидкаВПроцентахДо;	
		СтрокаТЧ.ОтклонениеОтПрайсаДо = -СтрокаТЧ.СкидкаВПроцентахОт;
	Иначе	
		// вручную
		СтрокаТЧ.СпособУказанияОтклонения = "Вручную";		
		СтрокаТЧ.ОтклонениеОтПрайсаОт = СтрокаТЧ.СкидкаВПроцентахОт;	
		СтрокаТЧ.ОтклонениеОтПрайсаДо = СтрокаТЧ.СкидкаВПроцентахДо;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтклоненийОтПрайсаВСтрокеТЧПоПредставлению(СтрокаТЧ)
	
	Если СтрокаТЧ.СпособУказанияОтклонения = "Скидка" Тогда		
		СтрокаТЧ.СкидкаВПроцентахОт = -СтрокаТЧ.ОтклонениеОтПрайсаДо;	
		СтрокаТЧ.СкидкаВПроцентахДо = -СтрокаТЧ.ОтклонениеОтПрайсаОт;
		
	Иначе	
		СтрокаТЧ.СкидкаВПроцентахОт = СтрокаТЧ.ОтклонениеОтПрайсаОт;	
		СтрокаТЧ.СкидкаВПроцентахДо = СтрокаТЧ.ОтклонениеОтПрайсаДо;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

