
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Инструкция",Инструкция) Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИА_ДоступныеИнструкции.Пользователь,
	               |	ИСТИНА КАК Флаг
	               |ИЗ
	               |	РегистрСведений.ИА_ДоступныеИнструкции КАК ИА_ДоступныеИнструкции
	               |ГДЕ
	               |	ИА_ДоступныеИнструкции.Инструкция = &Инструкция";
				   
	Запрос.УстановитьПараметр("Инструкция", Инструкция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Новстр = СписокПользователей.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, Выборка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	сз = Новый СписокЗначений;
	
	Для Каждого Стр Из СписокПользователей Цикл
		Если Стр.Флаг Тогда
			сз.Добавить(Стр.Пользователь) ;
		КонецЕсли;
		
	КонецЦикла;
	
	Закрыть(Сз);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ВыбратьПользователей(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	ВыбратьПользователей(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьПользователей(Отметка)
	
	Для Каждого Стр Из СписокПользователей Цикл
		Стр.Флаг = Отметка;
	КонецЦикла;
	
КонецПроцедуры


