
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЗаказыватьМатериалы"));
	Параметр.Значение =  Истина;
	
	// #14675
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("УчетОбеспеченностиРозницыПоКомнатам"));
	Параметр.Значение = Константы.УчетОбеспеченностиРозницыПоКомнатам.Получить();

КонецПроцедуры
