#Область ОписаниеПеременных

&НаСервере
Перем КэшированныеЗначения;

&НаКлиенте
Перем мТекущийСтатус;

&НаСервере
Перем ТекстФайлIni;

&НаКлиенте
Перем мПредыдущийИдентификатор;

&НаКлиенте
Перем мСтраница;

&НаКлиенте
Перем СоответствиеЗамеровВыездов;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВключитьПредпросмотрФайлов = НЕ Константы.ВыключитьПредпросмотрПрикрепленныхФайловВДокументах.Получить();
	Элементы.ГруппаФайлыПредпросмотр.Видимость = ВключитьПредпросмотрФайлов;
	
	ПредыдущийСтатус = Объект.ТекущийСтатус;
	
	УОТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияДокумента, "Лид", Объект.Ссылка, , , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("Сотрудник, ДоступенПризнакРазрешеноОформлятьДоговорБезЗамераВЛиде, 
											|ГородПоУмолчанию, ФильтроватьГрафикЗамеровПоТочкеПродаж, ТочкаПродаж, 
											|РазрешеноМенятьМенеджераВЛиде, РазрешеноМенятьОтветственногоВЛиде,
											|РазрешеноМенятьЗамерщикаВЛиде, РазрешеноМенятьТехнологаВЛиде,
											|РазрешеноРедактированиеАдресаВЛидахСВыполненнымЗамером,
											|РазрешитьЗаписыватьЛидыСДублирующимиТелефонами", ТекущийПользователь);
	
	РазрешитьЗаписыватьЛидыСДублирующимиТелефонами = РеквизитыПользователя.РазрешитьЗаписыватьЛидыСДублирующимиТелефонами;
	//#16066
	РазрешеноРедактированиеАдресаВЛидахСВыполненнымЗамером = РеквизитыПользователя.РазрешеноРедактированиеАдресаВЛидахСВыполненнымЗамером;
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	Элементы.ФильтрПодразделение.Видимость = Константы.ИспользоватьПодразделения.Получить();
	
	//#16000
	МенеджерОбъектаДетализации = Справочники.ДетализацияУчетаЛидов;
	Элементы.Организация.Видимость = МенеджерОбъектаДетализации.Организация.Использовать;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения") Тогда
		Элементы.Подразделение.Видимость = МенеджерОбъектаДетализации.Подразделение.Использовать;
	КонецЕсли;
	Элементы.Территория.Видимость = МенеджерОбъектаДетализации.Территория.Использовать;
	Элементы.ТочкаПродаж.Видимость = МенеджерОбъектаДетализации.ТочкаПродаж.Использовать;
	Элементы.ВидКонтакта.Видимость = МенеджерОбъектаДетализации.ВидКонтакта.Использовать;
	Элементы.РекламныйИсточник.Видимость = МенеджерОбъектаДетализации.РекламныйИсточник.Использовать;
	Элементы.РекламнаяАкция.Видимость = МенеджерОбъектаДетализации.РекламнаяАкция.Использовать;
	// #16755
	Элементы.Ответственный.Видимость = МенеджерОбъектаДетализации.Ответственный.Использовать;
	Элементы.Замерщик.Видимость = МенеджерОбъектаДетализации.Замерщик.Использовать;
	Элементы.Технолог.Видимость = МенеджерОбъектаДетализации.Технолог.Использовать;
	
	Если Параметры.Ключ.Пустая() Тогда
		//ОбщийМодуль.ЗаполнитьШапкуДокумента(Объект, "Подразделение");
		Объект.ТекущийСтатус = Справочники.СтатусыЛида.НазначитьЗамер;
		
		Если Параметры.ТочкаПродаж.Пустая() Тогда
			Объект.ТочкаПродаж = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ИмяПользователя())).ТочкаПродаж;
		Иначе
			Объект.ТочкаПродаж = Параметры.ТочкаПродаж;
		КонецЕсли;
		//Если Параметры.ОсновнойТелефонКлиента = Неопределено Тогда
		//	Объект.ОсновнойТелефонКлиента = Параметры.ОсновнойТелефонКлиента;
		//КонецЕсли;	
		Объект.ВидКонтакта = Параметры.ВидКонтакта;
		Если Объект.РекламныйИсточник.Пустая() Тогда
			Объект.РекламныйИсточник = Параметры.РекламныйИсточник;
		КонецЕсли;	
		
		Объект.ДатаСоздания = ТекущаяДатаСеанса();
		ДобавитьЗаписьВИсториюСервер("Создан новый лид");
		
		Объект.Город = РеквизитыПользователя.ГородПоУмолчанию;
		Если Объект.Город.Пустая() Тогда
			Объект.Город = Константы.ГородПоУмолчанию.Получить();
		КонецЕсли;
	Иначе
		//++ 8950 перед установкой признака ТолькоПросмотр необходимо убедиться что форма ещё не только на просмотре
		//		т.к. по ролям форма может быть только на просмотр, а мы ей потом убираем признак
		Если НЕ ЭтаФорма.ТолькоПросмотр Тогда
		//-- №8950
			ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
		КонецЕсли;	
		
		Если НЕ ЭтаФорма.ТолькоПросмотр Тогда
			ОбщийМодульВызовСервера.ЗаблокироватьОбъектДляРедактирования(Объект.Ссылка, ЭтаФорма, Элементы.ГруппаСоздатьНаОсновании);
		//++ №8950
		Иначе
			УстановитьЭлементыФормыТолькоПросмотр();
		//-- №8950	
		КонецЕсли;
	КонецЕсли;
	
	//++ №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
	////управление доступностью элементов
	//Если ПараметрыСеанса.ТекущийПользователь.ДополнительныеПраваЗапретРедактированияЦенВДокументах Тогда
	//	МассивИменЭлементов = Документы.Лид.ПолучитьМассивРеквизитовПоЦенам();
	//	ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	//КонецЕсли;
	////#7771
	//Если ПараметрыСеанса.ТекущийПользователь.ДополнительныеПраваЗапретПримененияСкидок Тогда
	//	МассивИменЭлементов = Документы.Лид.ПолучитьМассивРеквизитовПоСкидкам();
	//	ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	//КонецЕсли;
	//-- №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
	
	//ВариантОтображенияГрафика
	СписокВариантов = МодульОтчетов.ПолучитьСписокВариантовГрафикаЗамеров();
	//++ 16166 Добавлена проверка на отсутствие вариантов чтобы не вызывалось исключение
	Если СписокВариантов.Количество() > 0 Тогда
		Для каждого ТекЭлемент из СписокВариантов Цикл
			Элементы.ВариантОтображенияГрафика.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
		КонецЦикла;
		ВариантОтображенияГрафикаПоУмолчанию = Элементы.ВариантОтображенияГрафика.СписокВыбора[0].Значение;
		ВариантОтображенияГрафикаНастройка = ХранилищеОбщихНастроек.Загрузить("ДокументЛид", "ВариантОтображенияГрафика");
		Если ВариантОтображенияГрафикаНастройка = Неопределено Тогда
			ВариантОтображенияГрафика = ВариантОтображенияГрафикаПоУмолчанию;
		ИначеЕсли Элементы.ВариантОтображенияГрафика.СписокВыбора.НайтиПоЗначению(ВариантОтображенияГрафикаНастройка) = Неопределено Тогда
			ВариантОтображенияГрафика = ВариантОтображенияГрафикаПоУмолчанию;
		Иначе
			ВариантОтображенияГрафика = ВариантОтображенияГрафикаНастройка;
		КонецЕсли;
	КонецЕсли;
	
	ВремяНачалаЗамеров = Константы.НачалоРабочегоВремениЗамеров.Получить();
	ВремяКонцаЗамеров = Константы.КонецРабочегоВремениЗамеров.Получить();
	
	ПродолжительностьЗамера = Константы.КоличествоЧасовНеобходимыхНаЗамер.Получить();
	ПродолжительностьЗамера = ?(ПродолжительностьЗамера = 0, 0.5, ПродолжительностьЗамера);
	//КратностьГрафика 		= Константы.РазмерИнтервалаВГрафикеЗамеров.Получить();
	//КратностьГрафика 		= ?(КратностьГрафика = 0, 30, КратностьГрафика);
	ИнтервалГрафикаТаблица  = 86400 * 6;
	
	ПравилоПоискаИсторииОбращений = Константы.ПравилоПоискаИсторииОбращений.Получить().Получить();
	Если ПравилоПоискаИсторииОбращений = Неопределено Тогда
		ПравилоПоискаИсторииОбращений = Новый Структура("ПоТелефону,ПоАдресуЭлектроннойПочты", Ложь, Ложь);
	КонецЕсли;
	
	//#16875
	СоответствиеКнопок = Новый Соответствие;
	СоответствиеКнопок.Вставить("ФормаНазначитьЗамер", 					"ЗаполнитьДанныеЗамера");
	СоответствиеКнопок.Вставить("ФормаНазначитьВыезд", 					"ЗаполнитьДанныеЗамера");    
	СоответствиеКнопок.Вставить("ПеревестиВСтатусРасчетДоЗамера", 		"РасчетДоЗамера");
	СоответствиеКнопок.Вставить("ФормаПерезвонить", 					"ОтложенныйНазначитьЗамер");
	СоответствиеКнопок.Вставить("ЗамерНазначитьНовыйЗамер", 			"ОтложенныйНазначитьЗамер");	
	СоответствиеКнопок.Вставить("ЗамерДоговорНеЗаключен", 				"ОтложенныйЗаключитьДоговор");	
	СоответствиеКнопок.Вставить("ПеревестиВСтатусОбработкаПослеЗамера", "ОбработкаПослеЗамера");
	СоответствиеКнопок.Вставить("ЗамерЗаключенДоговор", 				"ОформитьДоговор");
	СоответствиеКнопок.Вставить("ФормаОформитьДоговор", 				"ДоговорОформлен");
	СоответствиеКнопок.Вставить("ПеревестиВСтатусОбращение", 			"Обращение");
	СоответствиеКнопок.Вставить("ФормаОтказ", 							"Отказ");
	СоответствиеКнопок.Вставить("НеЦелевой", 							"НеЦелевой");
	Для каждого КлючЗначение из СоответствиеКнопок Цикл		
		Элементы[КлючЗначение.Ключ].Видимость = Справочники.СтатусыЛида[КлючЗначение.Значение].Использовать;
	КонецЦикла;
	СтатусОбращениеИспользуется = Справочники.СтатусыЛида.Обращение.Использовать; 
	
	ОбновитьЭлементыФормыНаСервере();
	УправлениеЭлементамиФормыПоСтатусу();
	// #6305
	Элементы.РазрешитьОфорлениеДоговораБезЗамера.Доступность = РеквизитыПользователя.ДоступенПризнакРазрешеноОформлятьДоговорБезЗамераВЛиде;
		
	ЗаказДоговор = ПолучитьСсылкуНаДоговор(Объект.Ссылка);
	//Если НЕ ЗаказДоговор.Пустая() Тогда
	//	Элементы.ДекорацияСсылкаНаДоговор.Видимость = Истина;
	//	Элементы.ДекорацияСсылкаНаДоговор.Заголовок = ЗаказДоговор;
	//Иначе
	//	Элементы.ДекорацияСсылкаНаДоговор.Видимость = Ложь;
	//КонецЕсли;
	
	//++ #15368 от 27.01.2023
	Если НЕ ЗаказДоговор.Пустая() Тогда
		ВывестиСписокДоговоров();
	Иначе
		ДоступныеСтатусы = РегистрыСведений.ПорядокПереводаСтатусаЛида.ДоступныеДляПереводаСтатусы(Объект.ТекущийСтатус);
		Для каждого Статус из ДоступныеСтатусы Цикл
			Если Статус = Справочники.СтатусыЛида.ДоговорОформлен Тогда
				Элементы.ДекорацияДоговора.Доступность = Истина;
				Элементы.ДекорацияДоговора.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	//-- #15368 от 27.01.2023
	
	Элементы.ПредварительныйРасчетПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	
	//++ №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
	////предварительный расчет
	//Если Объект.Валюта.Пустая() Тогда
	//	Объект.Валюта = Константы.ВалютаУчета.Получить();
	//КонецЕсли;
	//Если Объект.ВидЦен.Пустая() Тогда
	//	Объект.ВидЦен = ПараметрыСеанса.ТекущийПользователь.ВидЦен;
	//КонецЕсли;
	//Если Объект.ТоварыУслуги.Количество() = 0 Тогда
	//	//добавим первую комнату
	//	НоваяСтрока = Объект.ТоварыУслуги.Добавить();
	//	НоваяСтрока.Комната = "Комната 1";
	//КонецЕсли;
	////проверим и перезаполним комнаты в материалах, если их там нет
	//Если Объект.Материалы.Количество() = 0 Тогда
	//	ВременнаяТаблица = Объект.ТоварыУслуги.Выгрузить();
	//	ВременнаяТаблица.Свернуть("Комната");
	//	Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
	//		Если НЕ ПустаяСтрока(ТекущаяСтрока.Комната) Тогда
	//			НоваяСтрока = Объект.Материалы.Добавить();
	//			НоваяСтрока.Комната = ТекущаяСтрока.Комната;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	////построим дерево
	//ПерестроитьДеревоНаФорме();
	//-- №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый ОписаниеТипов("ДокументСсылка.ПредварительныйРасчетЗаказДоговора");
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПредварительныеРасчеты.КоманднаяПанель;
	ПараметрыРазмещения.ПрефиксГрупп = "ПредварительныйРасчет";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ИмяЭлементаКоманднойПанели", "ГруппаКоманднаяПанель");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Ложь);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КодСтраны", СофтФон.ПолучитьТелефонныйКодСтраныПользователя());
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительнаяКонтактнаяИнформация");
	УправлениеКонтактнойИнформациейПотолки.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметры);
	//СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПТелефония);
	//СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПТелефония1, "Доп");
	//МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	//МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры1, "Доп");
	ВывестиДопЭлементыДляКонтактнойИнформации();
	
	//#13943 закомментировано
	//Если ПараметрыСеанса.ТекущийПользователь.РазрешеноМенятьАвтораВЛиде Тогда
	//	Элементы.Автор.ТолькоПросмотр = Ложь;
	//КонецЕсли;
	
	//ОбщийМодуль.ЗадатьМаскуВвода(Объект.ОсновнойТелефонКлиента, Элементы.ОсновнойТелефонКлиента);
	//ЗаполнитьКодСтраныПустогоТелефонаНаСервере();
	
	Если РольДоступна("ОтчетПредварительнаяСебестоимостьЗаказДоговораПросмотр") 
		или РольДоступна("АдминистраторСистемы") 
		или РольДоступна("ПолныеПрава") Тогда
		Элементы.ПредварительныйРасчет.Видимость = Истина;
	Иначе
		Элементы.ПредварительныйРасчет.Видимость = Ложь;
	КонецЕсли;
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	// #6305 закомментировано, учитывается в УправлениеЭлементамиФормыПоСтатусу
	//Если ПараметрыСеанса.НеДоступенПереводЛидаВНеЦелевой Тогда
	//	Элементы.НеЦелевой.Доступность = Ложь;
	//КонецЕсли;
	//Если ПараметрыСеанса.НеДоступенПереводЛидаВОтказ Тогда
	//	Элементы.ФормаОтказ.Доступность = Ложь;
	//КонецЕсли;	
	
	Если РеквизитыПользователя.ФильтроватьГрафикЗамеровПоТочкеПродаж Тогда
		
		//Элементы.ФильтрТочкаПродаж.Видимость = Истина; // №11108 комментируем, т.к. фильтр должен отображаться всегда (включили на форме)
		
		ФильтрТочкаПродаж = РеквизитыПользователя.ТочкаПродаж; //Объект.ТочкаПродаж; //#6384 по точке продаж пользователя
		
		//#6384
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ФильтрТочкаПродаж));
		Элементы.ФильтрТочкаПродаж.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
	КонецЕсли;
	
	//#12515 добавлено, пока закомментировано, будет чуть позже	
	//Если ПараметрыСеанса.ТекущийПользователь.ОграничитьВидимостьЗамерщиковПоПодразделениюПользователя Тогда		
	//	ФильтрПодразделение = ПараметрыСеанса.ТекущийПользователь.ПодразделениеРозница;	
	//КонецЕсли;
	
	Параметры.Свойство("ВыборНового", ВыборНового);
	
	Элементы.ГруппаОписаниеЗамерщиков.Видимость = Ложь;	
	ОписаниеЗамерщиковHTML = Документы.Лид.СформироватьОписаниеЗамерщиковHTML(ФильтрТочкаПродаж);
	
	ИспользоватьКартыЯндекс = НЕ ПустаяСтрока(Константы.КлючAPIЯндексКарты.Получить());
	
	//ПолучитьЗаписиИсторииЛидаИзРегистраНаСервере();
	
	//++ №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
	//ОбновитьДопИнформацию();
	//-- №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
	
	ПолучитьИдентификаторГородаНаселенногоПункта();
	ПолучитьИдентификаторГородаНаселенногоПунктаВыезда(); // №14051

	ВремАдрес = Объект.Адрес;
	ВремАдресВыезда = Объект.АдресВыезда;
	
	ПроверитьНаличиеДанныхВКлассификатореАдресов();
	
	УстановитьПривилегированныйРежим(Истина);
	РежимСовместимости = ХранилищеОбщихНастроек.Загрузить("ЯндексКарты_РежимСовместимости"); //,, ПараметрыСеанса.ТекущийПользователь);
	УстановитьПривилегированныйРежим(Ложь);
	
	//#5596
	//Если Константы.АвтоматическиЗаполнятьМенеджераВЛиде.Получить()
	//	И НЕ Параметры.Ключ.Пустая()
	//	И НЕ ЭтаФорма.ТолькоПросмотр
	//	И ПравоДоступа("Изменение", Метаданные.Документы.Лид)
	//	И НЕ ЗначениеЗаполнено(Объект.Менеджер) //И НЕ ЗначениеЗаполнено(Объект.Автор) //#13943 Автор -> Менеджер
	//	И ЗначениеЗаполнено(РеквизитыПользователя.Сотрудник)
	//	//#10410 закомментировано
	//	//И (ЗначениеЗаполнено(ОбщийМодульСервер.ЗначениеДополнительногоСвойстваЛида(Объект, Справочники.ВидыДополнительныхСвойствЛида.ПисьмоID)) ИЛИ ЗначениеЗаполнено(Объект.ЭлектроннаяПочтаАдрес)) 
	//	Тогда
	//	//#13943 Автор -> Менеджер
	//	Объект.Менеджер = РеквизитыПользователя.Сотрудник;
	//	ИзмененМенеджер = Истина;		
	//КонецЕсли;
	ОбщийМодульСервер.ОбработкаЗаполненияМенеджера(ЭтаФорма, Метаданные.Документы.Лид, РеквизитыПользователя.Сотрудник);
	
	//#5401
	ИспользуетсяИнтеграцияАТС = СофтФон.ИспользуетсяИнтеграцияСIPАТС();
	ТекущемуПользователюРазрешеноИспользованиеIPТелефонии = СофтФон.ТекущемуПользователюРазрешеноИспользованиеIPТелефонии();
	ДоступнаЗаписьЗвонкаБезПодключенияАТС = СофтФон.ДоступнаЗаписьЗвонкаБезПодключенияАТС(); //#12025
	Элементы.ГруппаИсторияЗвонков.Видимость = ИспользуетсяИнтеграцияАТС;
	Элементы.ИсторияЗвонковАТСПрослушатьЗвонок.Видимость    = ТекущемуПользователюРазрешеноИспользованиеIPТелефонии ИЛИ ДоступнаЗаписьЗвонкаБезПодключенияАТС;
	Элементы.ИсторияЗвонковАТССкачатьЗаписьЗвонка.Видимость = ТекущемуПользователюРазрешеноИспользованиеIPТелефонии ИЛИ ДоступнаЗаписьЗвонкаБезПодключенияАТС;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсторияЗвонковАТС, "Лид", Объект.Ссылка);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсторияЗвонковАТС, "НомераТелефонов", 
									УправлениеКонтактнойИнформациейПотолки.КонтактнаяИнформацияОбъекта(Объект.Ссылка, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, Ложь, Истина));
	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсторияЗвонковАТС, "ДополнительныйНомер", Объект.ДополнительныйТелефонКлиента);
	
	// №5385
	ОбновитьИзображениеКомандОтправкиСообщений();
	
	//#4644
	Выработка.Параметры.УстановитьЗначениеПараметра("ОбъектВыработки", Объект.Ссылка);
	ОбщийМодульСервер.УстановитьВидимостьГруппыВыработки(Элементы, Объект.Ссылка);
	
	//++ №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
	//// Видимость колонки Артикул
	//МассивЭлементов = новый Массив();
	//МассивЭлементов.Добавить("ДеревоТоваровНоменклатураАртикул");
	//МассивЭлементов.Добавить("ДеревоМатериаловНоменклатураАртикул");
	//МассивЭлементов.Добавить("ВыработкаНоменклатураАртикул");
	//МассивЭлементов.Добавить("ОбъектВыработкаНоменклатураАртикул");
	//МассивЭлементов.Добавить("ВыработкаПлановаяНоменклатураАртикул");
	//ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	//-- №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
	
	//#6588
	УправлениеЭлементамиФормыПоРезультатуЗамера();
	УправлениеЭлементамиФормыПоРезультатуВыезда();
	
	//Элементы.КнопкаПревышенПлан.Видимость  = ПолучитьФункциональнуюОпцию("ИспользоватьПулЗамеров");
	//Элементы.НадписьПревышенПлан.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПулЗамеров");
	
	//#8090, #10333
	Элементы.ДатаЗвонкаСоздавшегоЛид.Видимость = Объект.СпособСоздания = Перечисления.СпособыСозданияЛида.АвтоматическиПриРазбореИсторииАТС;
	
	ИспользуетсяПулЗамеров = ПолучитьФункциональнуюОпцию("ИспользоватьПулЗамеров");
	
	//сделаем "слепок" таблицы замеров на момент открытия документа
	Для Каждого ТекСтрока Из Объект.Замеры Цикл
		НоваяСтрока = ЗамерыДоИзменения.Добавить();
		НоваяСтрока.Дата = ТекСтрока.ДатаЗамера;
		НоваяСтрока.ВремяНачала = ТекСтрока.ВремяНачалаЗамера;
		НоваяСтрока.Исполнитель = ТекСтрока.ИсполнительЗамера;
		НоваяСтрока.ИДЗамера = ТекСтрока.ИДЗамера;
	КонецЦикла;
	//сделаем "слепок" таблицы выездов на момент открытия документа
	Для Каждого ТекСтрока Из Объект.Выезды Цикл
		НоваяСтрока = ВыездыДоИзменения.Добавить();
		НоваяСтрока.Дата = ТекСтрока.Дата;
		НоваяСтрока.ВремяНачала = ТекСтрока.ВремяНачала;
		НоваяСтрока.Исполнитель = ТекСтрока.Исполнитель;
		НоваяСтрока.ИДЗамера = ТекСтрока.ИДЗамера;
	КонецЦикла;
	
	//#9756
	ЗаполнитьДополнительныеСвойства();
	
	// №10184
	ОбновитьСписокПредварительныхРасчетов();
	
	// вызов оставлять последним	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если ИспользоватьКартыЯндекс 
		ИЛИ Константы.ИспользуетсяМобильныйКлиентЗамерщика.Получить()
		ИЛИ Константы.ИспользуетсяМобильныйКлиентМонтажника.Получить()
		Тогда
		Элементы.УказатьГеометку.Видимость = Истина;
		Элементы.УказатьГеометкуСтраницаЗамера.Видимость = Истина;
		Элементы.УказатьГеометкуВыезда.Видимость = Истина;
		ОбновитьКратинкуКнопкиГеометкиВШапкеДокумента();
	Иначе 
		Элементы.УказатьГеометку.Видимость = Ложь;
		Элементы.УказатьГеометкуСтраницаЗамера.Видимость = Ложь;
		Элементы.УказатьГеометкуВыезда.Видимость = Ложь;
	КонецЕсли;
	
	//#11453
	НастройкаОформленияГрафикаЗамеров = ОбщийМодульСервер.ПолучитьНастройкуОформленияГрафикаЗамеров(); 
	НастройкиОформленияГрафикаЗамеров = ОбщийМодульСервер.ПолучитьНастройкиОформленияГрафикаЗамеров(НастройкаОформленияГрафикаЗамеров);
	ОбщийМодульСервер.ЗаполнитьГруппуГрафикЗамеровОформление(ЭтаФорма, НастройкиОформленияГрафикаЗамеров, Элементы.ГруппаГрафикОформлениеЗамеры, Элементы.ГруппаГрафикОформлениеВыезды);
	
	//#13943
	Элементы.Менеджер.ТолькоПросмотр = НЕ РеквизитыПользователя.РазрешеноМенятьМенеджераВЛиде;
	//#16755
	Элементы.Ответственный.ТолькоПросмотр = НЕ РеквизитыПользователя.РазрешеноМенятьОтветственногоВЛиде;
	Элементы.Замерщик.ТолькоПросмотр = НЕ РеквизитыПользователя.РазрешеноМенятьЗамерщикаВЛиде;
	Элементы.Технолог.ТолькоПросмотр = НЕ РеквизитыПользователя.РазрешеноМенятьТехнологаВЛиде;
	
	// №14649
	ВариантИзмененияОтветственногоВЛиде = ?(МенеджерОбъектаДетализации.Ответственный.Использовать, Константы.ВариантИзмененияОтветственногоВЛиде.Получить(), Неопределено);
	// #16755
	ВариантИзмененияЗамерщикаВЛиде      = ?(МенеджерОбъектаДетализации.Замерщик.Использовать,Константы.ВариантИзмененияЗамерщикаВЛиде.Получить(), Неопределено);
	ВариантИзмененияТехнологаВЛиде      = ?(МенеджерОбъектаДетализации.Технолог.Использовать,Константы.ВариантИзмененияТехнологаВЛиде.Получить(), Неопределено);
	 
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ПараметрыСеансаТелефонияСтрана().Пустая() Тогда
		Сообщить("В настройках программы не задана страна (раздел ""Общие"") работа с лидами не доступна");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//++ №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора	
	//мИспользоватьАвтоматическиеСкидки = ПолучитьЗначениеКонстантыАвтоматическихСкидок();
	//-- №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
	
	ОбновитьЭлементыФормы();

	//#5596	
	//Если ИзмененМенеджер Тогда
	//	ПоказатьОповещениеПользователя("Изменен менеджер", , "Изменен менеджер документа на сотрудника текущего пользователя");
	//	Модифицированность = Истина;
	//КонецЕсли;
	ОбщийМодульКлиент.ОбработатьИзменениеМенеджера(ЭтаФорма);
	
	//#6588 позиционируемся на последней строке
	Если Объект.Выезды.Количество() > 0 Тогда
		
		НомерВыезда = Объект.Выезды.Количество()-1;
		ТекущаяСтрокаВыездов = Объект.Выезды[НомерВыезда].ПолучитьИдентификатор();
		Элементы.Выезды.ТекущаяСтрока = ТекущаяСтрокаВыездов;
		
		ТекущийРезультатВыезда = Объект.Выезды[НомерВыезда].Результат; // №14649
		
		ПланированиеВыездов = Истина;
		
	КонецЕсли;
	Если Объект.Замеры.Количество() > 0 Тогда
		НомерЗамера = Объект.Замеры.Количество()-1;
		ТекущаяСтрокаЗамеров = Объект.Замеры[НомерЗамера].ПолучитьИдентификатор();
		Элементы.Замеры.ТекущаяСтрока = ТекущаяСтрокаЗамеров;
		
		ИсполнительЗамера = Объект.Замеры[НомерЗамера].ИсполнительЗамера;
		ДатаЗамера = Объект.Замеры[НомерЗамера].ДатаЗамера;
		ВремяНачалаЗамера = Объект.Замеры[НомерЗамера].ВремяНачалаЗамера;
		ВремяОкончанияЗамера = Объект.Замеры[НомерЗамера].ВремяОкончанияЗамера;
		ТекущийРезультатЗамера = Объект.Замеры[НомерЗамера].РезультатЗамера;
		
		ПланированиеЗамеров = Истина;
		ПланированиеВыездов = Ложь;
	КонецЕсли;
	Если Объект.Замеры.Количество() + Объект.Выезды.Количество() > 0 Тогда
		ЗаполнитьВыборДанныхЗамераВыезда();
		ТекущийЗамерВыездПриИзменении(Неопределено);
	КонецЕсли;
	
	// №9853
	ОбновитьВидимостьЭлементовЗаезды();
	
	// №16055
	ПодключитьОбработчикОжидания("ПриОткрытииОбработчикОжидания", 0.3, Истина);
	//ПолучитьИсториюОбращенияКлиента();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// №6435 проверка на заполненность замера, если пустой нужно задать вопрос о дальнейшем действии
	Если ПоследнийЗамерПустой() Тогда
		Отказ = Истина;
		ТекстВопроса = "Текущий замер не назначен, продолжить назначение замера?
			|При нажатии ""Да"" будет продолжен ввод замера на графике
			|При нажатии ""Нет"" не назначенный замер будет очищен.";
		ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОПродолженииНазначенияЗамера", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	// #6798 аналогично для выездов
	Если ПоследнийВыездПустой() Тогда
		Отказ = Истина;
		ТекстВопроса = "Текущий выезд не назначен, продолжить назначение выезда?
			|При нажатии ""Да"" будет продолжен ввод выезда на графике
			|При нажатии ""Нет"" не назначенный выезд будет очищен.";
		ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОПродолженииНазначенияВыезда", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И КонстантыКонтролироватьСозданиеЛидовПоНомеруКлиента() 
		И НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.Отказ") Тогда
			
		ТелефоныЛида = УправлениеКонтактнойИнформациейКлиентПотолки.ПолучитьТелефонИзКонтактнойИнформацииФормы(ЭтотОбъект, Ложь);
		Если ТелефоныЛида.Количество() > 0 Тогда
			СтруктураПроверки = ПроверитьНаличиеЛидаВРаботеПоТелефонам(ТелефоныЛида, Объект.Ссылка); 
			Если ЗначениеЗаполнено(СтруктураПроверки.Ссылка) Тогда
				ТекстСообщения = СтрШаблон("Имеется лид в работе %1 с номером клиента %2", СтруктураПроверки.Ссылка, СтруктураПроверки.НомерТелефона);
				Сообщить(ТекстСообщения);
				Если НЕ РазрешитьЗаписыватьЛидыСДублирующимиТелефонами Тогда
					Отказ = Истина;
					Сообщить("Документ не записан");
				Иначе 
					Сообщить("Документ записан");				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//++ №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
	//ПеренестиДеревоВТабличнуюЧасть();
	//-- №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
	
	//++ №14913 перенесено выполнение в ПередЗаписьюНаСервере, т.к. там может быть смена статуса
	//КоличествоОтмененныхЗамеров = 0;
	//Для Каждого ТекЗамер Из Объект.Замеры Цикл
	//	//Если ТекЗамер.Отменен Тогда
	//	Если ТекЗамер.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен")
	//		ИЛИ ТекЗамер.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерНеПроизводился")
	//		Тогда
	//		КоличествоОтмененныхЗамеров = КоличествоОтмененныхЗамеров + 1;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.Отказ")
	//	И НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.НеЦелевой") Тогда
	//	
	//	Если Объект.Замеры.Количество() > 0 Тогда
	//		
	//		НомерЗамера = Объект.Замеры.Количество()-1;
	//		
	//		//++ №14649 Последняя дата замера заполняется по последней дате назначения замера или выезда, перенесено выполнение на ПередЗаписьюНаСервере
	//		//Объект.ПоследняяДатаЗамера = Объект.Замеры[НомерЗамера].ДатаЗамера;
	//		//Объект.ПоследнееВремяНачалаЗамера = Объект.Замеры[НомерЗамера].ВремяНачалаЗамера;
	//		//Объект.ПоследнееВремяОкончанияЗамера = Объект.Замеры[НомерЗамера].ВремяОкончанияЗамера;
	//		//-- №14649
	//		
	//		Объект.ПоследнийИсполнительЗамера = Объект.Замеры[НомерЗамера].ИсполнительЗамера;
	//		Объект.ПоследнийРезультатЗамера = Объект.Замеры[НомерЗамера].РезультатЗамера;
	//		Объект.ПоследняяСуммаДоговораНаЗамере = Объект.Замеры[НомерЗамера].СуммаДоговораНаЗамере;
	//		Объект.ПоследняяСуммаАвансаНаЗамере = Объект.Замеры[НомерЗамера].СуммаАвансаНаЗамере;
	//		Объект.ПоследнееЗамерВыполнен = Объект.Замеры[НомерЗамера].ЗамерВыполнен;
	//		Объект.ПоследнийНазначилЗамер = Объект.Замеры[НомерЗамера].НазначилЗамер;
	//		Объект.ПоследнийДатаНазначилиЗамер = Объект.Замеры[НомерЗамера].ДатаНазначенияЗамера;
	//		Объект.ПоследнийКомментарийЗамерщика = Объект.Замеры[НомерЗамера].КомментарийЗамерщика;
	//		
	//	КонецЕсли;
	//	
	//	Если Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер") Тогда
	//		Если НЕ Объект.ПоследняяДатаЗамера = Дата(1,1,1) 
	//			И НЕ Объект.ПоследнийИсполнительЗамера.Пустая() 
	//			И Объект.ПоследнийРезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ПустаяСсылка")
	//			И (Объект.Замеры.Количество() - КоличествоОтмененныхЗамеров) > 0
	//		Тогда
	//			//для лида в статусе "ОтложенныйНазначитьЗамер" добавили замер в график, нужно лид перевести в следующий статус
	//			Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера");
	//		КонецЕсли;
	//	КонецЕсли; 
	//
	//	Если НЕ Объект.ПоследнееЗамерВыполнен 
	//		И НЕ Объект.ПоследнийРезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерНеПроизводился") 
	//		И НЕ Объект.ПоследнийРезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен") //#11759
	//		И (Объект.Замеры.Количество() - КоличествоОтмененныхЗамеров) > 0
	//		И НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер")
	//	Тогда
	//		Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера");
	//	КонецЕсли;
	//	
	//Иначе
	//	
	//	Для Каждого ТекущаяСтрока Из Объект.Замеры Цикл
	//		
	//		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.РезультатЗамера) Тогда
	//			
	//			ДобавитьЗаписьВИсторию(СтрШаблон("Автоматически отменен замер Дата: %1 %2. Исполнитель: %3", Формат(ТекущаяСтрока.ДатаЗамера, "ДЛФ=Д"), Формат(ТекущаяСтрока.ВремяНачалаЗамера, "ДЛФ=В"), ТекущаяСтрока.ИсполнительЗамера));
	//			ТекущаяСтрока.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен");
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//	//++ №14649 Отменяем выезды без результата
	//	Для Каждого ТекущаяСтрока Из Объект.Выезды Цикл
	//		
	//		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Результат) Тогда				
	//			
	//			ДобавитьЗаписьВИсторию(СтрШаблон("Автоматически отменен выезд Дата: %1 %2. Исполнитель: %3", Формат(ТекущаяСтрока.Дата, "ДЛФ=Д"), Формат(ТекущаяСтрока.ВремяНачала, "ДЛФ=В"), ТекущаяСтрока.Исполнитель));
	//			ТекущаяСтрока.Результат = ПредопределенноеЗначение("Справочник.РезультатыВыездаЛида.ВыездОтменен");
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	//-- №14649
	//	
	//КонецЕсли;
	//-- №14913 перенесено выполнение в ПередЗаписьюНаСервере, т.к. там может быть смена статуса
	
	//запишем историю статуса
	Если НЕ ПредыдущийСтатус = Объект.ТекущийСтатус Тогда
		НоваяСтрока = Объект.ИсторияСтатусов.Добавить();
		НоваяСтрока.Дата = ТекущаяДата();
		НоваяСтрока.Статус = Объект.ТекущийСтатус;
	КонецЕсли;
	
	//КодСтраны = СофтФон.ПолучитьТелефонныйКодСтраныПользователя();
	//Если СокрЛП(Объект.ОсновнойТелефонКлиента) = КодСтраны Тогда
	//	Объект.ОсновнойТелефонКлиента = "";
	//КонецЕсли;
	//Если СокрЛП(Объект.ДополнительныйТелефонКлиента) = КодСтраны Тогда
	//	Объект.ДополнительныйТелефонКлиента = "";
	//КонецЕсли;
	
	//Если ПоследнийЗамерПустой() Тогда
	//	УдалитьПоследнийЗамер();
	//КонецЕсли;
	
	// Перенесено в ПередЗаписьюНаСервере
	//Если ОтправитьУведомлениеЗамерщику Тогда
	//	СоздатьЭлектронноеПисьмоЗамерщику();
	//КонецЕсли;
	
	// №1083 очищаем таблицу выработки, если выключена галочка "Ручная корректировка"
	Если НЕ Объект.РучнаяКорректировкаВыработки Тогда
		Объект.Выработка.Очистить();
	КонецЕсли;
	
	// #9710 поэтому перестроим график, чтобы было видно пересечения, если таковые имеются
	Если Объект.Замеры.Количество() + Объект.Выезды.Количество() > 0 Тогда
		ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
		ОбновитьГрафикЗамеров();
	КонецЕсли;
	
	// #9756
	ПеренестиДополнительныеСвойстваВТабличнуюЧасть();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УправлениеКонтактнойИнформациейПотолки.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	Если ТекущийОбъект.Замеры.Количество() > 0 Тогда	
		ПредыдущийГрафикЗамеров = ТекущийОбъект.Замеры.ВыгрузитьКолонки(); //только колонки
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ПредыдущийГрафикЗамеров = Объект.Ссылка.Замеры.Выгрузить();
		КонецЕсли;
		ТекущийГрафикЗамеров = ТекущийОбъект.Замеры.Выгрузить();
		
		ЕстьНовыеИлиИзмененныеЗамеры = ДобавитьЗаписиВИсториюПоЗамерамИВыездам(ТекущийОбъект, ПредыдущийГрафикЗамеров, ТекущийГрафикЗамеров);
		НазначенЗамер = ЕстьНовыеИлиИзмененныеЗамеры;
		Если ЕстьНовыеИлиИзмененныеЗамеры Тогда
			ТекущийОбъект.ТекущийСтатус = Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера;
			СоздатьЭлектронноеПисьмоЗамерщику(ТекущийОбъект);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийОбъект.Выезды.Количество() > 0 Тогда
		ПредыдущийГрафикВыездов = ТекущийОбъект.Выезды.ВыгрузитьКолонки(); //только колонки
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ПредыдущийГрафикВыездов = Объект.Ссылка.Выезды.Выгрузить();
		КонецЕсли;
		ТекущийГрафикВыездов = ТекущийОбъект.Выезды.Выгрузить();
		
		ЕстьНовыеИлиИзмененныеВыезды = ДобавитьЗаписиВИсториюПоЗамерамИВыездам(ТекущийОбъект, ПредыдущийГрафикВыездов, ТекущийГрафикВыездов, Истина);
		
		//++ №14649 нужно перевести в статус Замер/Выезд
		Если ЕстьНовыеИлиИзмененныеВыезды Тогда
			ТекущийОбъект.ТекущийСтатус = Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера;
		КонецЕсли;
		//-- №14649
		
	КонецЕсли;
	
	//++ №14913 перенесено из ПередЗаписью
	КоличествоОтмененныхЗамеров = 0;
	Для Каждого ТекЗамер Из ТекущийОбъект.Замеры Цикл
		Если ТекЗамер.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен")
			ИЛИ ТекЗамер.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерНеПроизводился")
		Тогда
			КоличествоОтмененныхЗамеров = КоличествоОтмененныхЗамеров + 1;
		КонецЕсли;
	КонецЦикла;
	//-- №14913 перенесено из ПередЗаписью
	
	Если НЕ ТекущийОбъект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.Отказ")
		И НЕ ТекущийОбъект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.НеЦелевой") Тогда
		
		//++ №14649 Последняя дата замера заполняется по последней дате назначения замера или выезда
		ЗамерыВыездыВременная = ТекущийОбъект.Замеры.Выгрузить();
		
		Для Каждого ТекущаяСтрока Из ТекущийОбъект.Выезды Цикл
			
			НоваяСтрока = ЗамерыВыездыВременная.Добавить();
			
			НоваяСтрока.ДатаЗамера = ТекущаяСтрока.Дата;
			НоваяСтрока.ВремяНачалаЗамера = ТекущаяСтрока.ВремяНачала;
			НоваяСтрока.ВремяОкончанияЗамера = ТекущаяСтрока.ВремяОкончания;
			НоваяСтрока.ДатаНазначенияЗамера = ТекущаяСтрока.ДатаНазначения;
			
		КонецЦикла;
		
		ЗамерыВыездыВременная.Сортировать("ДатаНазначенияЗамера УБЫВ");
		
		Если ЗамерыВыездыВременная.Количество() > 0 Тогда
			
			ТекущийОбъект.ПоследняяДатаЗамера = ЗамерыВыездыВременная[0].ДатаЗамера;
			ТекущийОбъект.ПоследнееВремяНачалаЗамера = ЗамерыВыездыВременная[0].ВремяНачалаЗамера;
			ТекущийОбъект.ПоследнееВремяОкончанияЗамера = ЗамерыВыездыВременная[0].ВремяОкончанияЗамера;
			
		КонецЕсли;
		//-- №14649
		
		//++ №14913 перенесено из ПередЗаписью
		Если ТекущийОбъект.Замеры.Количество() > 0 Тогда
			
			НомерЗамера = ТекущийОбъект.Замеры.Количество()-1;
			
			ТекущийОбъект.ПоследнийИсполнительЗамера = ТекущийОбъект.Замеры[НомерЗамера].ИсполнительЗамера;
			ТекущийОбъект.ПоследнийРезультатЗамера = ТекущийОбъект.Замеры[НомерЗамера].РезультатЗамера;
			ТекущийОбъект.ПоследняяСуммаДоговораНаЗамере = ТекущийОбъект.Замеры[НомерЗамера].СуммаДоговораНаЗамере;
			ТекущийОбъект.ПоследняяСуммаАвансаНаЗамере = ТекущийОбъект.Замеры[НомерЗамера].СуммаАвансаНаЗамере;
			ТекущийОбъект.ПоследнееЗамерВыполнен = ТекущийОбъект.Замеры[НомерЗамера].ЗамерВыполнен;
			ТекущийОбъект.ПоследнийНазначилЗамер = ТекущийОбъект.Замеры[НомерЗамера].НазначилЗамер;
			ТекущийОбъект.ПоследнийДатаНазначилиЗамер = ТекущийОбъект.Замеры[НомерЗамера].ДатаНазначенияЗамера;
			ТекущийОбъект.ПоследнийКомментарийЗамерщика = ТекущийОбъект.Замеры[НомерЗамера].КомментарийЗамерщика;
			
		КонецЕсли;
		
		Если ТекущийОбъект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер") Тогда
			Если НЕ ТекущийОбъект.ПоследняяДатаЗамера = Дата(1,1,1) 
				И НЕ ТекущийОбъект.ПоследнийИсполнительЗамера.Пустая() 
				И ТекущийОбъект.ПоследнийРезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ПустаяСсылка")
				И (ТекущийОбъект.Замеры.Количество() - КоличествоОтмененныхЗамеров) > 0
				Тогда
				//для лида в статусе "ОтложенныйНазначитьЗамер" добавили замер в график, нужно лид перевести в следующий статус
				ТекущийОбъект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера");
			КонецЕсли;
		КонецЕсли; 
		
		Если НЕ ТекущийОбъект.ПоследнееЗамерВыполнен 
			И НЕ ТекущийОбъект.ПоследнийРезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерНеПроизводился") 
			И НЕ ТекущийОбъект.ПоследнийРезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен") //#11759
			И (ТекущийОбъект.Замеры.Количество() - КоличествоОтмененныхЗамеров) > 0
			И НЕ ТекущийОбъект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер")
			Тогда
			ТекущийОбъект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера");
		КонецЕсли;
		//-- №14913 перенесено из ПередЗаписью
		
	Иначе
		
		//++ №14913 перенесено из ПередЗаписью
		Для Каждого ТекущаяСтрока Из ТекущийОбъект.Замеры Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.РезультатЗамера) Тогда
				
				ДобавитьЗаписьВИсториюСервер(СтрШаблон("Автоматически отменен замер Дата: %1 %2. Исполнитель: %3", Формат(ТекущаяСтрока.ДатаЗамера, "ДЛФ=Д"), Формат(ТекущаяСтрока.ВремяНачалаЗамера, "ДЛФ=В"), ТекущаяСтрока.ИсполнительЗамера));
				ТекущаяСтрока.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен");
				
			КонецЕсли;
			
		КонецЦикла;
		
		//++ №14649 Отменяем выезды без результата
		Для Каждого ТекущаяСтрока Из ТекущийОбъект.Выезды Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Результат) Тогда				
				
				ДобавитьЗаписьВИсториюСервер(СтрШаблон("Автоматически отменен выезд Дата: %1 %2. Исполнитель: %3", Формат(ТекущаяСтрока.Дата, "ДЛФ=Д"), Формат(ТекущаяСтрока.ВремяНачала, "ДЛФ=В"), ТекущаяСтрока.Исполнитель));
				ТекущаяСтрока.Результат = ПредопределенноеЗначение("Справочник.РезультатыВыездаЛида.ВыездОтменен");
				
			КонецЕсли;
			
		КонецЦикла;
		//-- №14649
		//-- №14913 перенесено из ПередЗаписью
		
	КонецЕсли;
	
	Если ПараметрыСеанса.НеДоступенПереводЛидаВНеЦелевой и Объект.ТекущийСтатус = Справочники.СтатусыЛида.НеЦелевой Тогда
		Отказ = Истина;
		Сообщить("Вам не доступен перевод лида в статус ""Не целевой""");
	ИначеЕсли ПараметрыСеанса.НеДоступенПереводЛидаВОтказ и Объект.ТекущийСтатус = Справочники.СтатусыЛида.Отказ Тогда
		Отказ = Истина;
		Сообщить("Вам не доступен перевод лида в статус ""Отказ""");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_Лид", ПараметрыЗаписи, Объект.Ссылка);
	
	Если НазначенЗамер 
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		// #12209 перенесено в общий модуль, так как не формируется смс при изменении через График замеров
		РаботаССМСКлиент.ПослеЗаписиЛида(Объект.Ссылка);
		
		НазначенЗамер = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияДокумента, "Лид", Объект.Ссылка, , , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Элементы.ИсторияДокумента.Обновить();

	Выработка.Параметры.УстановитьЗначениеПараметра("ОбъектВыработки", Объект.Ссылка); // для новых документов ссылка могла быть пустой
	Элементы.Выработка.Обновить();
	
	ОбновитьЭлементыФормыНаСервере();
	
	// если ПередЗаписью в модуле были удалены отдельные пустые записи
	Если Объект.Замеры.Количество() + Объект.Выезды.Количество() > 0 Тогда
		
		//++ №9853 добавляем позиционирование на текущем замере / выезде
		мТекущийЗамерВыезд = СоответствиеЗамеровВыездов.Получить(ТекущийЗамерВыезд);
		Если НЕ мТекущийЗамерВыезд = Неопределено Тогда
			ЗаполнитьВыборДанныхЗамераВыезда(мТекущийЗамерВыезд.ИД, мТекущийЗамерВыезд.ЗамерВыезд);
		Иначе
		//-- №9853
			ЗаполнитьВыборДанныхЗамераВыезда();
		КонецЕсли;
		
		ТекущийЗамерВыездПриИзменении(Неопределено);
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ИспользуетсяМобильныйКлиентЗамерщика() Тогда
			ОтправитьПУШУведомленияНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИспользуетсяМобильныйКлиентЗамерщика()
	Возврат Константы.ИспользуетсяМобильныйКлиентЗамерщика.Получить();
КонецФункции

&НаСервере
Процедура ОтправитьПУШУведомленияНаСервере()
	
	МассивДанных = Новый Массив;
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Текст","");
	СтруктураДанных.Вставить("Исполнитель","");
	СтруктураДанных.Вставить("Заголовок","");
	
	//ЗАМЕРЫ /////////////////////////////////////////////////////
	
	//сначала смотрим какие замеры были до записи документа
	Для Каждого ИсходнаяСтрока Из ЗамерыДоИзменения Цикл
		Отбор = Новый Структура("ИДЗамера", ИсходнаяСтрока.ИДЗамера);
		НайденныеСтроки = Объект.Замеры.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			//теперь такого замера нет
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Текст", "Адрес: " + Объект.Адрес);
			СтруктураДанных.Вставить("Исполнитель",ИсходнаяСтрока.Исполнитель);
			СтруктураДанных.Вставить("Заголовок","Замер отменен");
			МассивДанных.Добавить(СтруктураДанных);
		Иначе
			Если НЕ ИсходнаяСтрока.Исполнитель = НайденныеСтроки[0].ИсполнительЗамера Тогда
				//у старого исполнителя замер отменен
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("Текст", "Адрес: " + Объект.Адрес);
				СтруктураДанных.Вставить("Исполнитель",ИсходнаяСтрока.Исполнитель);
				СтруктураДанных.Вставить("Заголовок","Замер отменен");
				МассивДанных.Добавить(СтруктураДанных);
				//у нового исполнителя замер добавлен
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("Текст","Дата: " + Формат(НайденныеСтроки[0].ДатаЗамера,"ДФ=dd.MM.yyyy") + " г. " + Формат(НайденныеСтроки[0].ВремяНачалаЗамера,"ДФ=ЧЧ:мм") + "-" + Формат(НайденныеСтроки[0].ВремяОкончанияЗамера,"ДФ=ЧЧ:мм") + " Адрес: " + Объект.Адрес);
				СтруктураДанных.Вставить("Исполнитель",НайденныеСтроки[0].ИсполнительЗамера);
				СтруктураДанных.Вставить("Заголовок","Назначен новый замер");
				МассивДанных.Добавить(СтруктураДанных);
			Иначе
				Если ИсходнаяСтрока.Дата = НайденныеСтроки[0].ДатаЗамера
					И ИсходнаяСтрока.ВремяНачала = НайденныеСтроки[0].ВремяНачалаЗамера Тогда
					//ничего не поменялось
				Иначе
					//изменилась дата\время
					СтруктураДанных = Новый Структура;
					СтруктураДанных.Вставить("Текст","Новая дата: " + Формат(НайденныеСтроки[0].ДатаЗамера,"ДФ=dd.MM.yyyy") + " г. " + Формат(НайденныеСтроки[0].ВремяНачалаЗамера,"ДФ=ЧЧ:мм") + "-" + Формат(НайденныеСтроки[0].ВремяОкончанияЗамера,"ДФ=ЧЧ:мм") + " Адрес: " + Объект.Адрес);
					СтруктураДанных.Вставить("Исполнитель",ИсходнаяСтрока.Исполнитель);
					СтруктураДанных.Вставить("Заголовок","Замер перенесен");
					МассивДанных.Добавить(СтруктураДанных);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//теперь проверяем по новым замерам, которых не было
	Для Каждого НоваяСтрока Из Объект.Замеры Цикл
		Отбор = Новый Структура("ИДЗамера", НоваяСтрока.ИДЗамера);
		НайденныеСтроки = ЗамерыДоИзменения.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			//добавлен новый замер
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Текст","Дата: " + Формат(НоваяСтрока.ДатаЗамера,"ДФ=dd.MM.yyyy") + " г. " + Формат(НоваяСтрока.ВремяНачалаЗамера,"ДФ=ЧЧ:мм") + "-" + Формат(НоваяСтрока.ВремяОкончанияЗамера,"ДФ=ЧЧ:мм") + " Адрес: " + Объект.Адрес);
			СтруктураДанных.Вставить("Исполнитель",НоваяСтрока.ИсполнительЗамера);
			СтруктураДанных.Вставить("Заголовок","Назначен новый замер");
			МассивДанных.Добавить(СтруктураДанных);
		КонецЕсли;
	КонецЦикла;
	
	//ВЫЕЗДЫ /////////////////////////////////////////////////////
	
	//сначала смотрим какие выезды были до записи документа
	Для Каждого ИсходнаяСтрока Из ВыездыДоИзменения Цикл
		Отбор = Новый Структура("ИДЗамера", ИсходнаяСтрока.ИДЗамера);
		НайденныеСтроки = Объект.Выезды.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			//теперь такого выезда нет
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Текст", "Адрес: " + Объект.Адрес);
			СтруктураДанных.Вставить("Исполнитель",ИсходнаяСтрока.Исполнитель);
			СтруктураДанных.Вставить("Заголовок","Выезд отменен");
			МассивДанных.Добавить(СтруктураДанных);
		Иначе
			Если НЕ ИсходнаяСтрока.Исполнитель = НайденныеСтроки[0].Исполнитель Тогда
				//у старого исполнителя выезд отменен
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("Текст", "Адрес: " + Объект.Адрес);
				СтруктураДанных.Вставить("Исполнитель",ИсходнаяСтрока.Исполнитель);
				СтруктураДанных.Вставить("Заголовок","Выезд отменен");
				МассивДанных.Добавить(СтруктураДанных);
				//у нового исполнителя выезд добавлен
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("Текст","Дата: " + Формат(НайденныеСтроки[0].Дата,"ДФ=dd.MM.yyyy") + " г. " + Формат(НайденныеСтроки[0].ВремяНачала,"ДФ=ЧЧ:мм") + "-" + Формат(НайденныеСтроки[0].ВремяОкончания,"ДФ=ЧЧ:мм") + " Адрес: " + Объект.Адрес);
				СтруктураДанных.Вставить("Исполнитель",НайденныеСтроки[0].Исполнитель);
				СтруктураДанных.Вставить("Заголовок","Назначен новый выезд");
				МассивДанных.Добавить(СтруктураДанных);
			Иначе
				Если ИсходнаяСтрока.Дата = НайденныеСтроки[0].Дата
					И ИсходнаяСтрока.ВремяНачала = НайденныеСтроки[0].ВремяНачала Тогда
					//ничего не поменялось
				Иначе
					//изменилась дата\время
					СтруктураДанных = Новый Структура;
					СтруктураДанных.Вставить("Текст","Новая дата: " + Формат(НайденныеСтроки[0].Дата,"ДФ=dd.MM.yyyy") + " г. " + Формат(НайденныеСтроки[0].ВремяНачала,"ДФ=ЧЧ:мм") + "-" + Формат(НайденныеСтроки[0].ВремяОкончания,"ДФ=ЧЧ:мм") + " Адрес: " + Объект.Адрес);
					СтруктураДанных.Вставить("Исполнитель",ИсходнаяСтрока.Исполнитель);
					СтруктураДанных.Вставить("Заголовок","Выезд перенесен");
					МассивДанных.Добавить(СтруктураДанных);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//теперь проверяем по новым выездам, которых не было
	Для Каждого НоваяСтрока Из Объект.Выезды Цикл
		Отбор = Новый Структура("ИДЗамера", НоваяСтрока.ИДЗамера);
		НайденныеСтроки = ВыездыДоИзменения.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			//добавлен новый замер
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Текст","Дата: " + Формат(НоваяСтрока.Дата,"ДФ=dd.MM.yyyy") + " г. " + Формат(НоваяСтрока.ВремяНачала,"ДФ=ЧЧ:мм") + "-" + Формат(НоваяСтрока.ВремяОкончания,"ДФ=ЧЧ:мм") + " Адрес: " + Объект.Адрес);
			СтруктураДанных.Вставить("Исполнитель",НоваяСтрока.Исполнитель);
			СтруктураДанных.Вставить("Заголовок","Назначен новый выезд");
			МассивДанных.Добавить(СтруктураДанных);
		КонецЕсли;
	КонецЦикла;

	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отправка PUSH уведомлений замерщикам'");
	Результат = ДлительныеОперации.ВыполнитьВФоне("МобильныйКлиент.ОтправитьPUSHУведомлениеОбИзмененияхЗамеров", МассивДанных, ПараметрыВыполнения);
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьИсториюЛидаНаФормеВРегистрСведенийНаСервере();
	
	Элементы.ПредварительныйРасчетПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	
	//ПолучитьИсториюОбращенияКлиента();  //-- №16055
	
	//ЗаполнитьКодСтраныПустогоТелефонаНаСервере();
	
	//#6588
	УправлениеЭлементамиФормыПоРезультатуЗамера();
	УправлениеЭлементамиФормыПоРезультатуВыезда();
	
	УправлениеЭлементамиФормыПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы И ЗначениеЗаполнено(Объект.Ссылка) И ВыборНового Тогда
		Структура = Новый Структура("Ссылка, ВыборНового", Объект.Ссылка, ВыборНового);
		ОповеститьОВыборе(Структура);	
	КонецЕсли;
	
	//++ №11171 разблокировка объекта
	Если Не ЗавершениеРаботы Тогда
		РазблокироватьДанныеДляРектированияНаСервере();
	КонецЕсли;
	//-- №11171
	
КонецПроцедуры

//++ №11171
&НаСервере
Процедура РазблокироватьДанныеДляРектированияНаСервере()
	
	РазблокироватьДанныеДляРедактирования(Объект.Ссылка, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры
//-- №11171

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗагазДоговорНеСоздан" Тогда 
		
		ПоказатьПредупреждение(,"Заказ-договор не создан, статус лида не изменен");
		
	ИначеЕсли ИмяСобытия = "ЗаказДоговорСоздан" Тогда 		
		
		Если Параметр = Объект.Номер 
			И НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.Обращение") // #16346
			Тогда
			ПослеОформленияЗаказДоговора();
			ПараметрыЗаписи = Новый Структура;
			ПараметрыЗаписи.Вставить("РежимЗаписиДокумента",РежимЗаписиДокумента.Проведение);
			ЭтаФорма.Записать();
		КонецЕсли;
		
	//ИначеЕсли ИмяСобытия = "ЗакрытаФормаМонтажа" Тогда  // #16242 заменено на ЗД
	ИначеЕсли ИмяСобытия = "ЗакрытаФормаЗаказДоговора" Тогда
	
		Если ЗначениеЗаполнено(ОжидаетсяВидОбращения)
			И Параметр = Объект.Ссылка 
			И ТипЗнч(Источник) = Тип("Структура") Тогда
			
			ДобавитьЗаписьВИсториюКлиент("Создан заказ-договор (" + Источник.Вид + ") №" + Источник.Номер + " от " + Источник.Дата);			
			
			ВидОбращения = ОжидаетсяВидОбращения; 
			ЗакрытьОбращениеЗавершение(ВидОбращения);
			
			ОжидаетсяВидОбращения = ПредопределенноеЗначение("Справочник.ВидыОбращенийЛида.ПустаяСсылка");
			
		КонецЕсли;
		
	//ИначеЕсли ИмяСобытия = "ЗакрытаФормаСервиснойЗаявки" Тогда 
	//	
	//	Если ТипЗнч(Параметр) = Тип("Структура") Тогда
	//		Если Параметр.Основание = Объект.Ссылка Тогда
	//			Если НЕ Параметр.Ссылка.Пустая() Тогда
	//				Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.НеЦелевой");
	//				ДобавитьЗаписьВИсторию("Оформлена сервисная заявка " + Параметр.Ссылка);
	//				ЭтаФорма.Записать();
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ЗадачаПоЛидуСоздана" Тогда
		
		Если Параметр = Объект.Номер Тогда
			ДобавитьЗаписьВИсториюКлиент("Назначена задача");
			ЭтаФорма.Записать();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "СозданПредварительныйРасчет" И Параметр = Объект.Ссылка Тогда
		
		ПроверитьНазначитьНовыйПредварительныйРасчетОсновным();
		
	ИначеЕсли ИмяСобытия = "Запись_Города" И (Источник = Объект.Город ИЛИ Источник = Объект.ГородВыезда) Тогда
		
		ПолучитьИдентификаторГородаНаселенногоПункта();
		ПолучитьИдентификаторГородаНаселенногоПунктаВыезда();		
		ПроверитьНаличиеДанныхВКлассификатореАдресов();

	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ДобавитьКонтактнуюИнформацию(Команда)
	
	УправлениеКонтактнойИнформациейКлиентПотолки.ДобавитьКонтактнуюИнформацию(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДополнительнаяКонтактнаяИнформацияПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиентПотолки.ПриИзменении(ЭтотОбъект, Элемент);
	
	НайденныеСтроки = ЭтотОбъект.ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", Элемент.Имя));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Если НайденныеСтроки[0].Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
			Если НЕ ПустаяСтрока(НайденныеСтроки[0].Представление) Тогда
				НайденныеСтроки[0].Представление = СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(Элемент.ТекстРедактирования);
				ЭтотОбъект[НайденныеСтроки[0].ИмяРеквизита] = НайденныеСтроки[0].Представление;
			Иначе
				НайденныеСтроки[0].Представление = СофтФон.ПолучитьТелефонныйКодСтраныПользователя();
				ЭтотОбъект[НайденныеСтроки[0].ИмяРеквизита] = НайденныеСтроки[0].Представление;
			КонецЕсли;
			Если ПравилоПоискаИсторииОбращений.ПоТелефону Тогда
				ПолучитьИсториюОбращенияКлиента();
			КонецЕсли;
		
		ИначеЕсли НайденныеСтроки[0].Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда
			Если ПравилоПоискаИсторииОбращений.ПоАдресуЭлектроннойПочты Тогда
				ПолучитьИсториюОбращенияКлиента();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьДатуИзмененияДанныхКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДополнительнаяКонтактнаяИнформацияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НайденныеСтроки = ЭтаФорма.ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", Элемент.Имя));
	Если НайденныеСтроки.Количество() > 0 И ЗначениеЗаполнено(НайденныеСтроки[0].Представление) Тогда		
		ПараметрыФормы = Новый Структура("НомерТелефона", НайденныеСтроки[0].Представление);
		ОткрытьФорму("ОбщаяФорма.ФормаНомераТелефона", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбновитьДополнительнуюКонтактнуюИнформацию(Результат) Экспорт
	
	УправлениеКонтактнойИнформациейПотолки.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
	
	//++
	ВывестиДопЭлементыДляКонтактнойИнформации(Истина);
	//--
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	
	ИмяКоманды = Команда.Имя; //ВыполнитьИсходящийЗвонокКонтактнаяИнформацияПоле304ec285xc504x4325xa1e2xd404ba67521b
	ИмяКоманды = СтрЗаменить(ИмяКоманды, "ВыполнитьИсходящийЗвонок", "");
	
	НайденныеСтроки = ЭтаФорма.ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", ИмяКоманды));
	Если НайденныеСтроки.Количество() > 0 И ЗначениеЗаполнено(НайденныеСтроки[0].Представление) Тогда	
		СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, НайденныеСтроки[0].Представление);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
		
	ИмяКоманды = Команда.Имя;
	ИмяКоманды = СтрЗаменить(ИмяКоманды, "ОтправитьСообщениеTelegram", "");
	ИмяКоманды = СтрЗаменить(ИмяКоманды, "ОтправитьСообщениеViber", "");
	ИмяКоманды = СтрЗаменить(ИмяКоманды, "ОтправитьСообщениеWhatsApp", "");
	
	НайденныеСтроки = ЭтаФорма.ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", ИмяКоманды));
	Если НайденныеСтроки.Количество() > 0 И ЗначениеЗаполнено(НайденныеСтроки[0].Представление) Тогда	
		МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, НайденныеСтроки[0].Представление);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандСтатуса

&НаКлиенте
Процедура ПеревестиВСтатусРасчетДоЗамера(Команда)

	СтатусПерехода = ПредопределенноеЗначение("Справочник.СтатусыЛида.РасчетДоЗамера");
		
	Если НЕ РазрешенПереводСтатуса(Объект.ТекущийСтатус, СтатусПерехода) Тогда 
		Сообщить("Перевод статуса лида не предусмотрен настройками программы!");
		Возврат;
	КонецЕсли;
	
	ПослеОтветаНаВопрос = Новый ОписаниеОповещения("ПеревестиВСтатусРасчетДоЗамераЗавершение", ЭтаФорма);
	ПоказатьВопрос(ПослеОтветаНаВопрос,"Перевести лид в статус ""Расчет до замера""?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВСтатусРасчетДоЗамераЗавершение(Результат, ДопПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.РасчетДоЗамера");
	ДобавитьЗаписьВИсториюКлиент("Изменен статус на ""Расчет до замера""");
	
	УправлениеЭлементамиФормыПоСтатусу();
	Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВСтатусОбработкаПослеЗамера(Команда)

	СтатусПерехода = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОбработкаПослеЗамера");
		
	Если НЕ РазрешенПереводСтатуса(Объект.ТекущийСтатус, СтатусПерехода) Тогда 
		Сообщить("Перевод статуса лида не предусмотрен настройками программы!");
		Возврат;
	КонецЕсли;
	
	ПослеОтветаНаВопрос = Новый ОписаниеОповещения("ПеревестиВСтатусОбработкаПослеЗамераЗавершение", ЭтаФорма);
	ПоказатьВопрос(ПослеОтветаНаВопрос,"Перевести лид в статус ""Обработка после замера""?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВСтатусОбработкаПослеЗамераЗавершение(Результат, ДопПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОбработкаПослеЗамера");
	ДобавитьЗаписьВИсториюКлиент("Изменен статус на ""Обработка после замера""");
	
	УправлениеЭлементамиФормыПоСтатусу();
	Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура Перезвонить(Команда)
	
	//#5081
	Если ПоследнийЗамерПустой() Тогда		
		// Удаляем последний пустой замер
		УдалитьПоследнийЗамер();
		//ЗаполнитьВыборДанныхЗамераВыезда(); // №8012 обновим список выбора  // обновляется при УдалитьПоследнийЗамер
		ОбновитьЭлементыФормы();
		мСтраница = Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница.Имя;
		Модифицированность = Истина;
	КонецЕсли;	
	
	//#10183 При нажатии на кнопку "? Отложенный замер" если текущий статус = "Отложенный договор", 
	// то после заполнения причины, даты и времени следующего звонка так же менять и статус лида на "Отложенный замер".
	//СтатусПерехода = ?(Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор"), 
	//					ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор"), 
	//					ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер"));
	СтатусПерехода = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер");
		
	Если НЕ РазрешенПереводСтатуса(Объект.ТекущийСтатус, СтатусПерехода) Тогда 
		Сообщить("Перевод статуса лида не предусмотрен настройками программы!");
		Возврат;
	КонецЕсли;
	
	ЕстьНевыполненныеЗамеры = Ложь;
	Для Каждого ТекущаяСтрока Из Объект.Замеры Цикл
		// смотрим на РезультатЗамера, как при отмене замера в ПерезвонитьЗавершение
		//Если НЕ ТекущаяСтрока.ЗамерВыполнен Тогда
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.РезультатЗамера) Тогда
			ЕстьНевыполненныеЗамеры = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЕстьНевыполненныеВыезды = Ложь;
	Для Каждого ТекущаяСтрока Из Объект.Выезды Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Результат) Тогда
			ЕстьНевыполненныеВыезды = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЕстьНевыполненныеЗамеры", ЕстьНевыполненныеЗамеры);
	ПараметрыФормы.Вставить("ЕстьНевыполненныеВыезды", ЕстьНевыполненныеВыезды); //#14649
	ПараметрыФормы.Вставить("ТекущийСтатус", Объект.ТекущийСтатус); //#8113
	ПараметрыФормы.Вставить("СтатусПерехода", Строка(СтатусПерехода)); //#8113
	//#11632 реквизит ПоследнееВремяПерезвонить удален
	//ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ=dd.MM.yyyy") + " " + Формат(Объект.ПоследнееВремяПерезвонить, "ДФ=HH:mm"))); //№9558
	ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'"))); //№9558
	Оповещение = Новый ОписаниеОповещения("ПерезвонитьЗавершение", ЭтаФорма);
	ОткрытьФорму("Документ.Лид.Форма.ПланированиеПовторногоКонтакта", ПараметрыФормы, ЭтаФорма, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезвонитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Модифицированность = Истина;

	СтруктураОтвета = Результат;
	
	НоваяСтрока = Объект.ПовторныеКонтакты.Добавить();
	НоваяСтрока.Причина = СтруктураОтвета.Причина;
	НоваяСтрока.Дата = СтруктураОтвета.Дата;
	//НоваяСтрока.Время = СтруктураОтвета.Время;
	НоваяСтрока.Комментарий = СтруктураОтвета.Комментарий;
	
	//#10183 При нажатии на кнопку "? Отложенный замер" если текущий статус = "Отложенный договор", 
	// то после заполнения причины, даты и времени следующего звонка так же менять и статус лида на "Отложенный замер".
	//Если Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор") Тогда
	//Иначе
		Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер");
		УправлениеЭлементамиФормыПоСтатусу();
	//КонецЕсли;
	
	//ДобавитьЗаписьВИсторию("Запланирован повторный звонок. " + Формат(НоваяСтрока.Дата, "ДЛФ=Д") + " " + Формат(НоваяСтрока.Время, "ДЛФ=В") + ". Причина: " + СтруктураОтвета.Причина + ?(ПустаяСтрока(НоваяСтрока.Комментарий),"",".Комментарий: " + НоваяСтрока.Комментарий));
	ДобавитьЗаписьВИсториюКлиент("Запланирован повторный звонок. " + Формат(НоваяСтрока.Дата, "ДФ='dd.MM.yyyy HH:mm'") + ". Причина: " + СтруктураОтвета.Причина + ?(ПустаяСтрока(НоваяСтрока.Комментарий),"",".Комментарий: " + НоваяСтрока.Комментарий));
		
	Объект.ПричинаПерезвонить = СтруктураОтвета.Причина;
	Объект.ПоследнийКомментарий = СтруктураОтвета.Комментарий;
	Объект.ПоследняяДатаПерезвонить = СтруктураОтвета.Дата;
	//#11632 реквизит ПоследнееВремяПерезвонить удален
	//Объект.ПоследнееВремяПерезвонить = СтруктураОтвета.Время;
	
	//сбросим данные последнего замера, т.к. надо перезванивать, а не замерять
	Объект.ПоследняяДатаЗамера = Дата(1,1,1);
	Объект.ПоследнийИсполнительЗамера  = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	Объект.ПоследнийНазначилЗамер = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	Объект.ПоследнийДатаНазначилиЗамер = Дата(1,1,1);
	
	// отменяем замеры, если они есть и не выполнены
	НомерЗамера = Объект.Замеры.Количество()-1;
	Пока НомерЗамера >= 0 Цикл
		СтрокаЗамера = Объект.Замеры[НомерЗамера];		
		//#10986 смотрим на РезультатЗамера
		//Если НЕ СтрокаЗамера.ЗамерВыполнен И НЕ СтрокаЗамера.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен") Тогда
		Если НЕ ЗначениеЗаполнено(СтрокаЗамера.РезультатЗамера) Тогда
			ДобавитьЗаписьВИсториюКлиент("Автоматически отменен замер Дата: " + Формат(СтрокаЗамера.ДатаЗамера,"ДЛФ=Д") + " " + Формат(СтрокаЗамера.ВремяНачалаЗамера,"ДЛФ=В") + ". Исполнитель: " + СтрокаЗамера.ИсполнительЗамера);
			Объект.Замеры[НомерЗамера].РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен");
		КонецЕсли;
		НомерЗамера = НомерЗамера - 1;
	КонецЦикла;
	
	//++ №14649 Отменяем выезды без результата
	Для Каждого ТекущаяСтрока Из Объект.Выезды Цикл		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Результат) Тогда			
			ДобавитьЗаписьВИсториюКлиент(СтрШаблон("Автоматически отменен выезд Дата: %1 %2. Исполнитель: %3", Формат(ТекущаяСтрока.Дата, "ДЛФ=Д"), Формат(ТекущаяСтрока.ВремяНачала, "ДЛФ=В"), ТекущаяСтрока.Исполнитель));
			ТекущаяСтрока.Результат = ПредопределенноеЗначение("Справочник.РезультатыВыездаЛида.ВыездОтменен");		
		КонецЕсли;		
	КонецЦикла;
	//-- №14649
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьЗамер(Команда)
		
	// #14649
	Если Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаЗамерВыезд Тогда
		Если ПланированиеЗамера Тогда
			Возврат;
		ИначеЕсли ПланированиеВыезда И ПоследнийВыездПустой() Тогда
			СтруктураПараметров = новый Структура("СценарийНазначенияЗамера", Истина); // №14649
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОПродолженииНазначенияВыездаЗеркально", ЭтотОбъект, СтруктураПараметров);
			ПоказатьВопрос(ОписаниеОповещения, "Выезд не будет сохранен, назначить замер?", РежимДиалогаВопрос.ДаНет);		
			Возврат;			
		КонецЕсли;
	КонецЕсли;
	
	//#6305
	//Если НЕ ДоступноСозданиеЗамераПоСтатусуЛида() Тогда 
	//	Сообщить("Статус лида не предполагает создание замеров");
	//	Возврат;
	//КонецЕсли;	
	Если НЕ РазрешенПереводСтатуса(Объект.ТекущийСтатус, ПредопределенноеЗначение("Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера")) Тогда 
		Сообщить("Перевод статуса лида не предусмотрен настройками программы!");
		Возврат;
	КонецЕсли;
	
	Если ПоследнийЗамерПустой() Тогда		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОПродолженииНазначенияЗамера", ЭтотОбъект), "Текущий замер не назначен, продолжить назначение замера?", РежимДиалогаВопрос.ДаНет);		
		Возврат;	
	КонецЕсли;
	
	Если ПоследнийВыездПустой() Тогда
		СтруктураПараметров = новый Структура("СценарийНазначенияЗамера", Истина); // №14649
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОПродолженииНазначенияВыезда", ЭтотОбъект, СтруктураПараметров), "Текущий выезд не назначен, продолжить назначение выезда?", РежимДиалогаВопрос.ДаНет);		
		Возврат;	
	КонецЕсли;
	
	Если ЕстьЗамерИОнНеВыполнен() Тогда
		ОтветНаВопросОСозданииНовогоЗамера = Новый ОписаниеОповещения("ОтветНаВопросОоИзмененииЗамера",ЭтаФорма);
		ПоказатьВопрос(ОтветНаВопросОСозданииНовогоЗамера, "У лида уже имеется запланированный замер. Изменить его?", РежимДиалогаВопрос.ДаНет);
	//++ №14649 если есть не выполненный замер, также предагаем его изменить
	ИначеЕсли ЕстьВыездИОнНеВыполнен() Тогда
		ОП = Новый ОписаниеОповещения("ОтветНаВопросОИзмененииВыезда", ЭтотОбъект);
		ПоказатьВопрос(ОП, "У лида имеется запланированный выезд. Изменить его?", РежимДиалогаВопрос.ДаНет);
	//-- №14649
	ИначеЕсли ЕстьЗамерИОнВыполнен() Тогда
		Если НЕ ЗапретитьСоздаватьНовыйЗамерПоЛидуЕслиУжеЕстьВыполненныйЗамер() Тогда
			ОтветНаВопросОСозданииНовогоЗамера = Новый ОписаниеОповещения("ОтветНаВопросОСозданииНовогоЗамера",ЭтаФорма);
			ПоказатьВопрос(ОтветНаВопросОСозданииНовогоЗамера, "У лида уже имеется выполненный замер. Создать новый?", РежимДиалогаВопрос.ДаНет);
		Иначе
			ПоказатьПредупреждение(,"Запрещено создавать новый замер, если предыдущий замер уже был выполнен");
			Возврат;
		КонецЕсли;
	Иначе
		НазначитьЗамерЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОСозданииНовогоЗамера(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ПоследнийКомментарийЗамерщика = "";
		НазначитьЗамерЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОоИзмененииЗамера(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		НазначитьЗамерЗавершение(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьЗамерЗавершение(ЭтоИзменение=Ложь)
	
	ПланированиеЗамера = Истина;
	ПланированиеВыезда = Ложь;
	Если НЕ ЭтоИзменение Тогда
		НоваяСтрока = ДобавитьНовыйЗамер();
		ОчиститьДатуСледующегоКонтактаБезЗаписиВИсторию(); // №9558
	КонецЕсли;
	Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаЗамерВыезд;
	ГруппаСтраницыОсновныеПриСменеСтраницы(Элементы.ГруппаСтраницыОсновные, Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница);
	НазначенЗамер = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьВыезд(Команда)
	
	// #14649
	Если Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаЗамерВыезд Тогда
		Если ПланированиеВыезда Тогда
			Возврат;
		ИначеЕсли ПланированиеЗамера И ПоследнийЗамерПустой() Тогда
			СтруктураПараметров = новый Структура("СценарийНазначенияВыезда", Истина); // №14649
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОПродолженииНазначенияЗамераЗеркально", ЭтотОбъект, СтруктураПараметров);
			ПоказатьВопрос(ОписаниеОповещения, "Замер не будет сохранен, назначить выезд?", РежимДиалогаВопрос.ДаНет);		
			Возврат;			
		КонецЕсли;
	КонецЕсли;
	
	Если ПоследнийЗамерПустой() Тогда
		СтруктураПараметров = новый Структура("СценарийНазначенияВыезда", Истина); // №14649
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОПродолженииНазначенияЗамера", ЭтотОбъект, СтруктураПараметров), "Текущий замер не назначен, продолжить назначение замера?", РежимДиалогаВопрос.ДаНет);		
		Возврат;	
	КонецЕсли;
	
	Если ПоследнийВыездПустой() Тогда		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОПродолженииНазначенияВыезда", ЭтотОбъект), "Текущий выезд не назначен, продолжить назначение выезда?", РежимДиалогаВопрос.ДаНет);		
		Возврат;	
	КонецЕсли;
	
	Если ЕстьВыездИОнНеВыполнен() Тогда
		ОП = Новый ОписаниеОповещения("ОтветНаВопросОИзмененииВыезда", ЭтотОбъект);
		ПоказатьВопрос(ОП, "У лида уже имеется запланированный выезд. Изменить его?", РежимДиалогаВопрос.ДаНет);
	//++ №14649 если есть не выполненный замер, также предлагаем его изменить
	ИначеЕсли ЕстьЗамерИОнНеВыполнен() Тогда
		ОтветНаВопросОСозданииНовогоЗамера = Новый ОписаниеОповещения("ОтветНаВопросОоИзмененииЗамера", ЭтаФорма);
		ПоказатьВопрос(ОтветНаВопросОСозданииНовогоЗамера, "У лида имеется запланированный замер. Изменить его?", РежимДиалогаВопрос.ДаНет);
	//-- №14649
	ИначеЕсли ЕстьВыездИОнВыполнен() Тогда
		ОП = Новый ОписаниеОповещения("ОтветНаВопросОСозданииНовогоВыезда", ЭтотОбъект);
		ПоказатьВопрос(ОП, "У лида уже имеется выполненный выезд. Создать новый?", РежимДиалогаВопрос.ДаНет);
	Иначе
		НазначитьВыездЗавершение();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОСозданииНовогоВыезда(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		НазначитьВыездЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОИзмененииВыезда(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		НазначитьВыездЗавершение(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьВыездЗавершение(ЭтоИзменение=Ложь)
	
	ПланированиеЗамера = Ложь;
	ПланированиеВыезда = Истина;
	
	Если НЕ ЭтоИзменение Тогда
		
		НоваяСтрока = ДобавитьНовыйВыезд();
		Объект.СтатусВозвратаПослеВыезда = Объект.ТекущийСтатус; // №14649
		
	КонецЕсли;
	
	Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаЗамерВыезд;
	ГруппаСтраницыОсновныеПриСменеСтраницы(Элементы.ГруппаСтраницыОсновные, Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьНовыйЗамер()
	
	НоваяСтрока = Объект.Замеры.Добавить();		
	НоваяСтрока.ДатаЗамера = ТекущаяДата();
	НоваяСтрока.Портал_id = ОбщийМодуль.ПолучитьТекущееUnixTime();
	НоваяСтрока.ИДЗамера = Новый УникальныйИдентификатор;
	НоваяСтрока.ЭтоНовый = Истина;

	ТекущаяСтрокаЗамеров = НоваяСтрока.ПолучитьИдентификатор(); //#6588
	Элементы.Замеры.ТекущаяСтрока = ТекущаяСтрокаЗамеров; //#6588
	ТекущийРезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ПустаяСсылка");
	ЗаполнитьВыборДанныхЗамераВыезда(ТекущаяСтрокаЗамеров, 1); // №8012

	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Функция ДобавитьНовыйВыезд()
	
	НоваяСтрока = Объект.Выезды.Добавить();		
	НоваяСтрока.Дата = ТекущаяДата();
	НоваяСтрока.ИДЗамера = Новый УникальныйИдентификатор;
	НоваяСтрока.ЭтоНовый = Истина;
	
	ТекущаяСтрокаВыездов = НоваяСтрока.ПолучитьИдентификатор(); //#6588
	Элементы.Выезды.ТекущаяСтрока = ТекущаяСтрокаВыездов; //#6588
	ТекущийРезультатВыезда = ПредопределенноеЗначение("Справочник.РезультатыВыездаЛида.ПустаяСсылка"); // №14649 было: ТекущийРезультатВыезда = Ложь;
	
	ЗаполнитьВыборДанныхЗамераВыезда(ТекущаяСтрокаВыездов, 2); // №8012

	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура ОформитьДоговор(Команда)
	 
	//Если Модифицированность ИЛИ НЕ Объект.Проведен Тогда
	//	//ПоказатьПредупреждение(,"Предварительно лид следует провести");
	//	ОписаниеОповещения = Новый ОписаниеОповещения("ОформитьДоговорЗаписьДокумента", ЭтотОбъект);
	//	ТекстВопроса = "Для продолжения документ следует провести. 
	//					|Провести документ?";
	//	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	//	Возврат;
	//КонецЕсли;
	//
	//ОформитьДоговорФрагмент(Неопределено, Неопределено);
	
	ДействиеПослеЗаписи = Новый ОписаниеОповещения("ОформитьДоговорФрагмент", ЭтотОбъект);

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ДействиеПослеЗаписи", ДействиеПослеЗаписи);
	
	ОбщийМодульКлиент.ПроверитьИПровестиДокумент(ДополнительныеПараметры, Истина);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОформитьДоговорЗаписьДокумента(Результат, ДопПараметры) Экспорт
//	
//	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
//		Возврат;	
//	КонецЕсли;
//	
//	ДействиеПослеЗаписи = Новый ОписаниеОповещения("ОформитьДоговорФрагмент", ЭтотОбъект);
//	
//	ПараметрыЗаписи = Новый Структура;
//	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
//	
//	ОчиститьСообщения();
//	Результат = Записать(ПараметрыЗаписи);
//	
//	Если Результат Тогда
//		ВыполнитьОбработкуОповещения(ДействиеПослеЗаписи, Результат);
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ОформитьДоговорФрагмент(Результат, ДопПараметры) Экспорт

	Если НЕ Объект.РазрешитьОфорлениеДоговораБезЗамера И НЕ РазрешенПереводСтатуса(Объект.ТекущийСтатус, ПредопределенноеЗначение("Справочник.СтатусыЛида.ДоговорОформлен")) Тогда
		Сообщить("Перевод статуса лида не предусмотрен настройками программы!");
		Возврат;
	КонецЕсли;
	
	Если ЕстьОформленныйЗаказДоговор() Тогда
		Если НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ДоговорОформлен") Тогда
			Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ДоговорОформлен");
			Модифицированность = Истина;
		КонецЕсли;
		ПослеОтветаОСозданииДоговора = Новый ОписаниеОповещения("ПослеОтветаОСозданииДоговора",ЭтаФорма);
		ПоказатьВопрос(ПослеОтветаОСозданииДоговора, "По данному лиду уже оформлен заказ-договор. Создать новый?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ОформитьДоговорФрагмент2();
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаОСозданииДоговора(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        ОформитьДоговорФрагмент2();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьДоговорФрагмент2()
	
	ПараметрыНовогоДокумента = Новый Структура;
	ПараметрыНовогоДокумента.Вставить("Основание", 		Объект.Ссылка);
	ПараметрыНовогоДокумента.Вставить("Адрес", 			?(ПустаяСтрока(Объект.Город), Объект.Адрес, Строка(Объект.Город) + ", " + Объект.Адрес));
	ПараметрыНовогоДокумента.Вставить("Геометка", 		Объект.Геометка);
	ПараметрыНовогоДокумента.Вставить("Сумма", 			Объект.ПоследняяСуммаДоговораНаЗамере);
	ПараметрыНовогоДокумента.Вставить("ИмяКлиента", 	Объект.ИмяКлиента);
	
	СписокЗамеровДляОформления = ПолучитьЗамерыДляОформленияДоговора(); // №11768
	
	ИсполнительВЗаказ = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	ИдентификаторЗамера = Неопределено; // №11768
	
	Если СписокЗамеровДляОформления.Количество() = 1 Тогда
		
		ИсполнительВЗаказ = СписокЗамеровДляОформления[0].ИсполнительЗамера;
		ИдентификаторЗамера = СписокЗамеровДляОформления[0].ИдентификаторЗамера;
		
	ИначеЕсли СписокЗамеровДляОформления.Количество() > 1 Тогда
		
		// несколько возможных замеров
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗамераДляОформленияДоговораЗавершение", ЭтотОбъект, ПараметрыНовогоДокумента);
		ОткрытьФорму("Документ.Лид.Форма.ВыборИсполнителяЗаказа", новый Структура("СписокЗамеровДляОформления", СписокЗамеровДляОформления), ЭтаФорма, , , , ОписаниеОповещения);
		Возврат;
		
	КонецЕсли;
		
	ПараметрыНовогоДокумента.Вставить("Исполнитель", ИсполнительВЗаказ);
	ПараметрыНовогоДокумента.Вставить("ИдентификаторЗамера", ИдентификаторЗамера); // №11768
	
	ОформитьДоговорЗавершение(ПараметрыНовогоДокумента);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗамераДляОформленияДоговораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Исполнитель", ВыбранноеЗначение.Исполнитель);
	ДополнительныеПараметры.Вставить("ИдентификаторЗамера", ВыбранноеЗначение.ИдентификаторЗамера);
	
	ОформитьДоговорЗавершение(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьДоговорЗавершение(ПараметрыНовогоДокумента)
	
	ПараметрыЗаполнения = Новый Структура("ЗначенияЗаполнения", ПараметрыНовогоДокумента);
	ОткрытьФорму("Документ.ЗаказДоговор.ФормаОбъекта", ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВСтатусОбращение(Команда)
	
	//Если Модифицированность или НЕ Объект.Проведен Тогда
	//	ПоказатьПредупреждение(,"Предварительно лид следует провести");
	//	Возврат;
	//КонецЕсли;
	Если НЕ Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
		ПоказатьПредупреждение(, "Не удается провести документ");
		Возврат;
	КонецЕсли;
	
	//#6305
	Если НЕ РазрешенПереводСтатуса(Объект.ТекущийСтатус, ПредопределенноеЗначение("Справочник.СтатусыЛида.Обращение")) Тогда 
		Сообщить("Перевод статуса лида не предусмотрен настройками программы!");
		Возврат;
	КонецЕсли;
	
	ПослеОтветаНаВопрос = Новый ОписаниеОповещения("ПеревестиВСтатусОбращениеЗавершение", ЭтаФорма);
	ПоказатьВопрос(ПослеОтветаНаВопрос,"Перевести лид в статус ""Обращение""?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВСтатусОбращениеЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.Обращение");
		УправлениеЭлементамиФормыПоСтатусу();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьСервиснуюЗаявку(Команда)
	
	Если НЕ Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
		ПоказатьПредупреждение(, "Не удается провести документ");
		Возврат;
	КонецЕсли;
	
	ПослеОтветаНаВопрос = Новый ОписаниеОповещения("ОформитьЗаказДоговорПоВидуЗавершение", ЭтаФорма, ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.СервиснаяЗаявка"));
	ПоказатьВопрос(ПослеОтветаНаВопрос,"Создать документ ""Заказ клиента"" с видом ""Сервисная заявка""?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьРекламацию(Команда)
	
	Если НЕ Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
		ПоказатьПредупреждение(, "Не удается провести документ");
		Возврат;
	КонецЕсли;
		
	ПослеОтветаНаВопрос = Новый ОписаниеОповещения("ОформитьЗаказДоговорПоВидуЗавершение", ЭтаФорма, ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Рекламация"));
	ПоказатьВопрос(ПослеОтветаНаВопрос,"Создать документ ""Заказ клиента"" с видом ""Рекламация""?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПродажу(Команда)
	
	Если НЕ Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
		ПоказатьПредупреждение(, "Не удается провести документ");
		Возврат;
	КонецЕсли;
	
	ПослеОтветаНаВопрос = Новый ОписаниеОповещения("ОформитьЗаказДоговорПоВидуЗавершение", ЭтаФорма, ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Продажа"));
	ПоказатьВопрос(ПослеОтветаНаВопрос,"Создать документ ""Заказ клиента"" с видом ""Продажа""?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗаказДоговорПоВидуЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		
		СоответствиеВидов = новый Соответствие;
		СоответствиеВидов.Вставить(ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Продажа"), ПредопределенноеЗначение("Справочник.ВидыОбращенийЛида.Продажа"));
		СоответствиеВидов.Вставить(ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Рекламация"), ПредопределенноеЗначение("Справочник.ВидыОбращенийЛида.Рекламация"));
		СоответствиеВидов.Вставить(ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.СервиснаяЗаявка"), ПредопределенноеЗначение("Справочник.ВидыОбращенийЛида.СервиснаяЗаявка"));
		
		ОжидаетсяВидОбращения = СоответствиеВидов.Получить(ДопПараметры);
		
		ПараметрыОснования = Новый Структура;
		ПараметрыОснования.Вставить("Основание", Объект.Ссылка);
		ПараметрыОснования.Вставить("ВидЗаказа", ДопПараметры);
		ПараметрыОснования.Вставить("Адрес", 	 ?(ПустаяСтрока(Объект.Город), Объект.Адрес, Строка(Объект.Город) + ", " + Объект.Адрес)); // #16886 
		ПараметрыНовогоДокумента = Новый Структура("ЗначенияЗаполнения", ПараметрыОснования);
		
		ОткрытьФорму("Документ.ЗаказДоговор.ФормаОбъекта", ПараметрыНовогоДокумента);
		//заполнение в ОбработкаОповещения
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОбращение(Команда)
	
	Если Объект.РезультатОбращения = ПредопределенноеЗначение("Справочник.РезультатыЛида.Закрыт") Тогда
		Сообщить("Обращение уже закрыто");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Закрыть обращение клиента?");
	ПараметрыФормы.Вставить("ЗаголовокТекста", "Комментарий");

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьОбращениеФрагмент", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВводМногострочногоТекста", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОбращениеФрагмент(Результат, ДопПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьЗаписьВИсториюКлиент("Закрыто обращение клиента." + ?(ПустаяСтрока(Результат), "", " Комментарий: " + Результат));
	ЗакрытьОбращениеЗавершение(ПредопределенноеЗначение("Справочник.ВидыОбращенийЛида.ПустаяСсылка"));
	Объект.ВидОбращения = ПредопределенноеЗначение("Справочник.ВидыОбращенийЛида.ПустаяСсылка");
	Объект.РезультатОбращения = ПредопределенноеЗначение("Справочник.РезультатыЛида.Закрыт");
	Объект.ДатаЗакрытияОбращения = ТекущаяДата();
	УправлениеЭлементамиФормыПоСтатусу();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОбращениеЗавершение(ВидОбращения)
	 
	Объект.ВидОбращения = ВидОбращения;
	Объект.РезультатОбращения = ПредопределенноеЗначение("Справочник.РезультатыЛида.Закрыт");
	Объект.ДатаЗакрытияОбращения = ТекущаяДата();
	УправлениеЭлементамиФормыПоСтатусу();
	
	Объект.ПоследняяДатаПерезвонить = Дата(1, 1, 1, 0, 0, 0);
	//#11632 реквизит ПоследнееВремяПерезвонить удален
	//Объект.ПоследнееВремяПерезвонить = Дата(1, 1, 1, 0, 0, 0);
			
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗадачу(Команда)
	
	//Если Модифицированность ИЛИ НЕ Объект.Проведен Тогда
	//	//ПоказатьПредупреждение(,"Предварительно лид следует провести");		
	//	ОписаниеОповещения = Новый ОписаниеОповещения("ОформитьЗадачуФрагмент", ЭтотОбъект);
	//	ТекстВопроса = "Для продолжения документ следует провести. 
	//					|Провести документ?";
	//	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	//	Возврат;
	//КонецЕсли;
	//	
	//ОформитьЗадачуЗавершение(Неопределено, Неопределено);
	
	ДействиеПослеЗаписи = Новый ОписаниеОповещения("ОформитьЗадачуЗавершение", ЭтотОбъект);

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ДействиеПослеЗаписи", ДействиеПослеЗаписи);
	
	ОбщийМодульКлиент.ПроверитьИПровестиДокумент(ДополнительныеПараметры, Истина);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОформитьЗадачуФрагмент(Результат, ДопПараметры) Экспорт
//	
//	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
//		Возврат;	
//	КонецЕсли;
//	
//	ДействиеПослеЗаписи = Новый ОписаниеОповещения("ОформитьЗадачуЗавершение", ЭтотОбъект);
//	
//	ПараметрыЗаписи = Новый Структура;
//	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
//	
//	ОчиститьСообщения();
//	Результат = Записать(ПараметрыЗаписи);
//	
//	Если Результат Тогда
//		ВыполнитьОбработкуОповещения(ДействиеПослеЗаписи, Результат);
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗадачуЗавершение(Результат, ДопПараметры) Экспорт
	
	ОбработкаОформленияЗадачи = Новый ОписаниеОповещения("ОформитьЗадачуПослеЗаписи", ЭтотОбъект);
	ПараметрыНовогоДокумента = Новый Структура;
	ПараметрыНовогоДокумента.Вставить("ЗаполнениеНаОсновании", Истина);
	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
	ОткрытьФорму("БизнесПроцесс.Задание.Форма.ФормаБизнесПроцесса", ПараметрыНовогоДокумента,,,,,ОбработкаОформленияЗадачи);

КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗадачуПослеЗаписи(Результат, ДопПараметры) Экспорт
	ПолучитьЗадачиЛида();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	//ПоказатьПредупреждение(, "Документ не сохранен!");
	//	ОписаниеОповещения = Новый ОписаниеОповещения("ПрикрепитьФайлФрагмент", ЭтотОбъект);
	//	ТекстВопроса = "Для продолжения документ следует записать. 
	//					|Записать документ?";
	//	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	//	Возврат;
	//КонецЕсли;
	//
	//ПрикрепитьФайлЗавершение(Неопределено, Неопределено);
	
	ДействиеПослеЗаписи = Новый ОписаниеОповещения("ПрикрепитьФайлЗавершение", ЭтотОбъект);

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ДействиеПослеЗаписи", ДействиеПослеЗаписи);
	
	ОбщийМодульКлиент.ПроверитьИПровестиДокумент(ДополнительныеПараметры);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПрикрепитьФайлФрагмент(Результат, ДопПараметры) Экспорт
//	
//	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
//		Возврат;	
//	КонецЕсли;
//	
//	ДействиеПослеЗаписи = Новый ОписаниеОповещения("ПрикрепитьФайлЗавершение", ЭтотОбъект);
//	
//	ПараметрыЗаписи = Новый Структура;
//	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
//	
//	ОчиститьСообщения();
//	Результат = Записать(ПараметрыЗаписи);
//	
//	Если Результат Тогда
//		ВыполнитьОбработкуОповещения(ДействиеПослеЗаписи, Результат);
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлЗавершение(Результат, ДопПараметры) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ДействиеПослеПрикрепления", ОписаниеОповещения);
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(Объект.Ссылка, ДопПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура Отказ(Команда)
	
	//#6305
	Если НЕ РазрешенПереводСтатуса(Объект.ТекущийСтатус, ПредопределенноеЗначение("Справочник.СтатусыЛида.Отказ")) Тогда 
		Сообщить("Перевод статуса лида не предусмотрен настройками программы!");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЕстьНезавершенныеЗамеры", ЕстьНезавершенныеЗамеры());
	ПараметрыФормы.Вставить("ТекущийСтатус", Объект.ТекущийСтатус); //#8113
	ПараметрыФормы.Вставить("СтатусПерехода", Строка(ПредопределенноеЗначение("Справочник.СтатусыЛида.Отказ"))); //#8113
	//ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ=dd.MM.yyyy") + " " + Формат(Объект.ПоследнееВремяПерезвонить, "ДФ=HH:mm"))); //№9558
	ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'"))); //№9558
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтказЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.Лид.Форма.ПричинаОтказа", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура ОтказЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.Отказ");
	ДобавитьЗаписьВИсториюКлиент("Отказ. Причина: " + Результат.ПричинаОтказа + ?(ПустаяСтрока(Результат.Комментарий),"",". Комментарий: " + Результат.Комментарий));
	Объект.ПричинаОтказа = Результат.ПричинаОтказа;
	Объект.ПоследнийКомментарий = Результат.Комментарий;
	ОчиститьДатуСледующегоКонтактаБезЗаписиВИсторию(); // №9558
	Модифицированность = Истина;
	УправлениеЭлементамиФормыПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура НеЦелевой(Команда)
	
	//#6305
	Если НЕ РазрешенПереводСтатуса(Объект.ТекущийСтатус, ПредопределенноеЗначение("Справочник.СтатусыЛида.НеЦелевой")) Тогда 
		Сообщить("Перевод статуса лида не предусмотрен настройками программы!");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийСтатус", Объект.ТекущийСтатус); //#8113
	ПараметрыФормы.Вставить("СтатусПерехода", Строка(ПредопределенноеЗначение("Справочник.СтатусыЛида.НеЦелевой"))); //#8113
	//ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ=dd.MM.yyyy") + " " + Формат(Объект.ПоследнееВремяПерезвонить, "ДФ=HH:mm"))); //№9558
	ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'"))); //№9558
	ОписаниеОповещения = Новый ОписаниеОповещения("НеЦелевойЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.Лид.Форма.НеЦелевой", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НеЦелевойЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.НеЦелевой");
	Объект.ВидНецелевогоЛида = Результат.Вид;
	ТекстВИсторию = "Лид не целевой. Вид: " + Результат.Вид + ". " + ?(ПустаяСтрока(Результат.Комментарий), "", ". Комментарий: " + Результат.Комментарий);
	ДобавитьЗаписьВИсториюКлиент(ТекстВИсторию);
	Объект.ПоследнийКомментарий = ТекстВИсторию; // #17148
	ОчиститьДатуСледующегоКонтактаБезЗаписиВИсторию(); // №9558
	Модифицированность = Истина;
	УправлениеЭлементамиФормыПоСтатусу();
	
КонецПроцедуры

#КонецОбласти

#Область ВкладкаЛид

&НаКлиенте
Процедура ТекущийСтатусПриИзменении(Элемент)
	
	НовыйСтатус = Объект.ТекущийСтатус;
	Если НовыйСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ДоговорОформлен") Тогда
		НовыйСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОформитьДоговор");
	КонецЕсли;
	Модифицированность = Ложь;
	
	Объект.ТекущийСтатус = мТекущийСтатус; //установим статус перед изменением, чтобы общая логика отработала
	
	//#6305
	Если НЕ РазрешенПереводСтатуса(Объект.ТекущийСтатус, НовыйСтатус) Тогда 
		Сообщить("Перевод статуса лида не предусмотрен настройками программы!");
		Возврат;
	КонецЕсли;

	Если НовыйСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер") Тогда
		Перезвонить(Элемент);
	ИначеЕсли НовыйСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.НазначитьЗамер") Тогда
		НазначитьЗамер(Элемент);
	ИначеЕсли НовыйСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОформитьДоговор") Тогда
		Если мТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор") Тогда
			//#14448 особый случай, меняем только Статус
			Объект.ТекущийСтатус = НовыйСтатус;
			ДобавитьЗаписьВИсториюКлиент("Изменен статус на ""Оформить договор""");
			Модифицированность = Истина;
		Иначе
			ОформитьДоговор(Элемент);
		КонецЕсли;
	ИначеЕсли НовыйСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.Обращение") Тогда
		ПеревестиВСтатусОбращение(Элемент);
	//ИначеЕсли НовыйСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.Сервис") Тогда
	//	ОформитьСервиснуюЗаявку(Элемент);
	//ИначеЕсли НовыйСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.Рекламация") Тогда
	//	ОформитьРекламацию(Элемент);
	ИначеЕсли НовыйСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.Отказ") Тогда
		Отказ(Элемент);
	ИначеЕсли НовыйСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.НеЦелевой") Тогда
		НеЦелевой(Элемент);
	Иначе
		Объект.ТекущийСтатус = НовыйСтатус;
	КонецЕсли;
	
	УправлениеЭлементамиФормыПоСтатусу();

КонецПроцедуры

&НаКлиенте
Процедура ТекущийСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мТекущийСтатус = Объект.ТекущийСтатус;
	
	//#6305 обработка в ОбработкаПолученияДанныхВыбора справочника СтатусыЛида
	ПараметрыВыбораСтатуса = Новый Массив;
	ПараметрыВыбораСтатуса.Добавить(Новый ПараметрВыбора("ТекущийСтатус", мТекущийСтатус));
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораСтатуса);

КонецПроцедуры

&НаКлиенте
Процедура ТочкаПродажПриИзменении(Элемент)
	ТочкаПродажПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТочкаПродажПриИзмененииНаСервере()
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ФильтроватьГрафикЗамеровПоТочкеПродаж, ТочкаПродаж");
	
	Если РеквизитыПользователя.ФильтроватьГрафикЗамеровПоТочкеПродаж Тогда
		Элементы.ФильтрТочкаПродаж.Видимость = Истина;
		ФильтрТочкаПродаж = РеквизитыПользователя.ТочкаПродаж;
		Если ФильтрТочкаПродаж.Пустая() Тогда
			ФильтрТочкаПродаж = Объект.ТочкаПродаж;
		КонецЕсли;
	КонецЕсли;
	
	//#8496
	Если ЗначениеЗаполнено(Объект.ТочкаПродаж) И ЗначениеЗаполнено(Объект.ТочкаПродаж.Подразделение) Тогда
		Объект.Подразделение = Объект.ТочкаПродаж.Подразделение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяКлиентаПриИзменении(Элемент)
	ОбновитьТекстНаГрафикеЗамеровНаСервере();
	ОбновитьДатуИзмененияДанныхКлиента();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
КонецПроцедуры
	
&НаКлиенте
Процедура РекламнаяАкцияПриИзменении(Элемент)
	
	// #14718
	Если ЗначениеЗаполнено(Объект.РекламнаяАкция) Тогда
		РеквизитыРА = ПолучитьРеквизитыРекламнойАкции();
		
		// изменено в рамках той же заявки: заполняем реквизит лида если только заполнено значение в рекламном источнике / акции
		//Если НЕ ЗначениеЗаполнено(Объект.Организация) 
		//	ИЛИ РеквизитыРА.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
		Если ЗначениеЗаполнено(РеквизитыРА.Организация) Тогда
			Объект.Организация = РеквизитыРА.Организация;
			ОрганизацияПриИзменении(Неопределено);
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Объект.Подразделение) 
		//	ИЛИ РеквизитыРА.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
		Если ЗначениеЗаполнено(РеквизитыРА.Подразделение) Тогда
			Объект.Подразделение = РеквизитыРА.Подразделение;
			ПодразделениеПриИзменении(Неопределено);
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Объект.Город) 
		//	ИЛИ РеквизитыРА.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
		Если ЗначениеЗаполнено(РеквизитыРА.Город) Тогда
			Объект.Город = РеквизитыРА.Город;
			ГородПриИзменении(Неопределено);
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Объект.РекламныйИсточник) 
		//	ИЛИ РеквизитыРА.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
		Если ЗначениеЗаполнено(РеквизитыРА.РекламныйИсточник) Тогда
			Объект.РекламныйИсточник = РеквизитыРА.РекламныйИсточник;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыРекламнойАкции()
	
	РеквизитыРА = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.РекламнаяАкция, 
																	"Организация, Подразделение, Город,
																	|РекламныйИсточник"); //, ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений");		
	Если ЗначениеЗаполнено(РеквизитыРА.Подразделение) И НЕ Константы.ИспользоватьПодразделения.Получить() Тогда
		РеквизитыРА.Подразделение = Справочники.Подразделения.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат РеквизитыРА;

КонецФункции

&НаКлиенте
Процедура РекламныйИсточникПриИзменении(Элемент)
	
	// #14718
	Если ЗначениеЗаполнено(Объект.РекламныйИсточник) Тогда
		РеквизитыРИ = ПолучитьРеквизитыРекламногоИсточника();
		
		//Если НЕ ЗначениеЗаполнено(Объект.Организация) 
		//	ИЛИ РеквизитыРИ.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
		Если ЗначениеЗаполнено(РеквизитыРИ.Организация) Тогда
			Объект.Организация = РеквизитыРИ.Организация;
			ОрганизацияПриИзменении(Неопределено);
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Объект.Подразделение) 
		//	ИЛИ РеквизитыРИ.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
		Если ЗначениеЗаполнено(РеквизитыРИ.Подразделение) Тогда
			Объект.Подразделение = РеквизитыРИ.Подразделение;
			ПодразделениеПриИзменении(Неопределено);
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Объект.Город) 
		//	ИЛИ РеквизитыРИ.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
		Если ЗначениеЗаполнено(РеквизитыРИ.Город) Тогда
			Объект.Город = РеквизитыРИ.Город;
			ГородПриИзменении(Неопределено);
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Объект.РекламнаяАкция) 
		//	ИЛИ РеквизитыРИ.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
		Если ЗначениеЗаполнено(РеквизитыРИ.РекламнаяАкция) Тогда
			Объект.РекламнаяАкция = РеквизитыРИ.РекламнаяАкция;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыРекламногоИсточника()
	
	// #14718
	РеквизитыРИ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.РекламныйИсточник, 
																	"Организация, Подразделение, Город,
																	|РекламнаяАкция"); //, ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений");	
	Если ЗначениеЗаполнено(РеквизитыРИ.Подразделение) И НЕ Константы.ИспользоватьПодразделения.Получить() Тогда
		РеквизитыРИ.Подразделение = Справочники.Подразделения.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат РеквизитыРИ;
	
КонецФункции

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	
	ПолучитьИдентификаторГородаНаселенногоПункта();
	ПроверитьНаличиеДанныхВКлассификатореАдресов();
	//Объект.Адрес = ""; // выбрали другой город, очищаем адрес
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИдентификаторГородаНаселенногоПункта()
	
	ИдентификаторНаселенногоПункта = ОбщийМодульСервер.ИдентификаторГородаНаселенногоПункта(Объект.Город);
	
КонецПроцедуры

//++ №14051 город в выезде может отличаться
&НаСервере
Процедура ПолучитьИдентификаторГородаНаселенногоПунктаВыезда()
	
	Если НЕ Объект.АдресВыездаОтличаетсяОтАдресаЛида Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторНаселенногоПунктаВыезда = ОбщийМодульСервер.ИдентификаторГородаНаселенногоПункта(Объект.ГородВыезда);
	
КонецПроцедуры
//-- №14051 город в выезде может отличаться

//&НаКлиенте
//Процедура ИсторияЛидаНаФормеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
&НаКлиенте
Процедура ИсторияДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("Лид", Объект.Ссылка);
	ПараметрыНовойФормы.Вставить("Дата", ТекущиеДанные.Дата);
	ПараметрыНовойФормы.Вставить("Пользователь", ТекущиеДанные.Пользователь);
	ПараметрыНовойФормы.Вставить("ИДЗаписи", ТекущиеДанные.ИДЗаписи);
	//ТекущийКомментарий = ?(ПустаяСтрока(ТекущиеДанные.РасширенныйКомментарий), ТекущиеДанные.Комментарий, ТекущиеДанные.РасширенныйКомментарий);
	ТекущийКомментарий = ?(ПустаяСтрока(ТекущиеДанные.Комментарий), ТекущиеДанные.ПредставлениеКомментария, ТекущиеДанные.Комментарий);
	ПараметрыНовойФормы.Вставить("Комментарий", ТекущийКомментарий);
	ОткрытьФорму("Документ.Лид.Форма.ФормаКомментарий", ПараметрыНовойФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсторияДокументаПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	//++ #12137
	Для каждого СтрокаДС из Строки Цикл
		КомментарийЗаписи = СтрокаДС.Значение.Данные.ПредставлениеКомментария;		
		КомментарийЗаписи = СтрЗаменить(КомментарийЗаписи, "</a>", "");
		Поз1 = СтрНайти(КомментарийЗаписи, "<a href = v8:{");
		Поз2 = СтрНайти(КомментарийЗаписи, "}>");
		Если Поз1 > 0 И Поз2 > 0 Тогда
			КомментарийЗаписи = Лев(КомментарийЗаписи, Поз1-1) + Сред(КомментарийЗаписи, Поз2+2);	
		КонецЕсли;
		СтрокаДС.Значение.Данные.ПредставлениеКомментария = КомментарийЗаписи;
	КонецЦикла;
	//-- #12137

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйКомментарий(Команда)
	
	СтруктураИстории = Новый Структура;
	СтруктураИстории.Вставить("ИмяРеквизита", "НовыйКомментарий");

	ОбщийМодульКлиент.ДобавитьЗаписьВИсториюДокумента(ЭтаФорма, СтруктураИстории);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаписьВИсториюДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДобавитьЗаписьВИсториюКлиент(Результат.ТекстЗаписиИстории);
	НовыйКомментарий = "";
	
	// #11632 закомментировано
	//Объект.ДатаПоследнейРеакции = ТекущаяДатаСеанса();
	Объект.ПоследнийКомментарий = Результат.ТекстЗаписиИстории;
	Модифицированность = Истина;
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьВИсториюКлиент(НоваяЗаписьВИсторию)
	
	ДобавитьЗаписьВИсториюСервер(НоваяЗаписьВИсторию);
	Элементы.ИсторияДокумента.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьВИсториюСервер(НоваяЗаписьВИсторию)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РегистрыСведений.ИсторияЛида.ДобавитьЗаписьВИсториюЛида(Объект.Ссылка, ТекущаяДатаСеанса(), Пользователи.ТекущийПользователь(), Новый УникальныйИдентификатор, НоваяЗаписьВИсторию);
	Иначе		
		// храним во временной таблице, пока документ не записали
		СтрокаЗаписи = ИсторияЛидаНаФорме.Добавить();		
		СтрокаЗаписи.Дата = ТекущаяДатаСеанса();
		СтрокаЗаписи.Пользователь = Пользователи.ТекущийПользователь();
		СтрокаЗаписи.Комментарий = НоваяЗаписьВИсторию;		
	КонецЕсли;
	
КонецПроцедуры

// вызывается ПослеЗаписиНаСервере - для переноса временных записей в регистр
&НаСервере
Процедура ЗаписатьИсториюЛидаНаФормеВРегистрСведенийНаСервере()
	
	//для каждого варианта данных измерений делаем отдельный отбор и запись, чтобы не стереть те записи, которые могли появиться в РС пока мы работали с документом
	Для Каждого ТекущаяСтрока Из ИсторияЛидаНаФорме Цикл
		РегистрыСведений.ИсторияЛида.ДобавитьЗаписьВИсториюЛида(Объект.Ссылка, ТекущаяСтрока.Дата, ТекущаяСтрока.Пользователь, Новый УникальныйИдентификатор, ТекущаяСтрока.Комментарий);
	КонецЦикла;
	
	ИсторияЛидаНаФорме.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ВкладкаКартыЯндекс

&НаКлиенте
Процедура ДатаКартыЯндексПриИзменении(Элемент)
	
	ИнициализироватьКартуЯндекс();	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьКартуЯндекс()
	
	Город = Строка(Объект.Город);
	Если ПустаяСтрока(Город) Тогда
		Город = ПолучитьГородПоУмолчанию();
	КонецЕсли;
	
	КартаЯндекс = КартыЯндекс.ИнициализироватьКарту(Город, ДатаКартыЯндекс, РежимСовместимости);
	ЛегендаЯндекс = КартыЯндекс.СформироватьЛегендуЯндексКарт(ФильтрТочкаПродаж);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьГородПоУмолчанию()
	Возврат Константы.ГородПоУмолчанию.Получить();
КонецФункции

&НаКлиенте
Процедура РежимСовместимостиПриИзменении(Элемент)
	РежимСовместимостиПриИзмененииНаСервере();
	ИнициализироватьКартуЯндекс();
КонецПроцедуры

&НаСервере
Процедура РежимСовместимостиПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("ЯндексКарты_РежимСовместимости",, РежимСовместимости); //,, ПараметрыСеанса.ТекущийПользователь);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ВкладкаЗамерВыезд

&НаКлиенте
Процедура УправлениеЭлементамиГруппыЗамерВыезд()
	
	Если ПланированиеЗамера Тогда
		Элементы.СтраницыПланированиеЗамераВыезда.ТекущаяСтраница = Элементы.СтраницаПланированиеЗамера;
		Элементы.ГрафикТаблицаКонтекстноеМенюИзменитьДанныеВыезда.Видимость = Ложь;
	ИначеЕсли ПланированиеВыезда Тогда
		Элементы.СтраницыПланированиеЗамераВыезда.ТекущаяСтраница = Элементы.СтраницаПланированиеВыезда;
		Элементы.ГрафикТаблицаКонтекстноеМенюИзменитьДанныеЗамера.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыборДанныхЗамераВыезда(Знач ТекущееЗначение = Неопределено, ЗамерВыезд=1)
	
	// №8012 заполним список ВыборДанных
	Элементы.ТекущийЗамерВыезд.СписокВыбора.Очистить();
	СоответствиеЗамеровВыездов = Новый Соответствие;
	
	// представление по виду: Замер/Выезд №Х [ДАТА] [Время] [Исполнитель] [Результат]
	ШаблонПредставления = "%1 №%2 (%3 %4) %5 %6%7";
	Счетчик = 1;
	ТекущееПоложение = 0;
	УстановленоТекущееПоложение = Ложь;
	
	//++ №9853 по новому с сортировкой по дате замера/выезда с приоритетом по замерам
	МассивЗамеровВыездов = ПолучитьМассивЗамеровВыездов();
	ЗаполнитьИдентификаторыЗамеровВыездов(МассивЗамеровВыездов);
	
	Для каждого СтрокаТЧ из МассивЗамеровВыездов Цикл
		ПредставлениеЗамера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПредставления
			, ?(СтрокаТЧ.ЭтоВыезд, "Выезд", "Замер")
			, СтрокаТЧ.ИсходныйНомерСтроки
			, Формат(СтрокаТЧ.ДатаЗамера, "ДЛФ=D")
			, ?(ЗначениеЗаполнено(СтрокаТЧ.ВремяНачалаЗамера) , Формат(СтрокаТЧ.ВремяНачалаЗамера, "ДФ=HH:mm"), "")
			, ?(ЗначениеЗаполнено(СтрокаТЧ.ИсполнительЗамера) , СтрокаТЧ.ИсполнительЗамера, "")
			//++ №14649
			//, ?(СтрокаТЧ.ЗамерВыполнен И СтрокаТЧ.ЭтоВыезд	  , "(выполнен)", "")
			//, ?(ЗначениеЗаполнено(СтрокаТЧ.РезультатЗамера) И НЕ СтрокаТЧ.ЭтоВыезд, "(" + СтрокаТЧ.РезультатЗамера + ")", "")
			, ?(ЗначениеЗаполнено(СтрокаТЧ.Результат), "(" + СтрокаТЧ.Результат + ")", "")
			//-- №14649
			);
			
		Элементы.ТекущийЗамерВыезд.СписокВыбора.Добавить(Счетчик, СокрЛП(ПредставлениеЗамера), , ?(СтрокаТЧ.ЭтоВыезд, БиблиотекаКартинок.Выезд, БиблиотекаКартинок.Замер));
		СоответствиеЗамеровВыездов.Вставить(Счетчик, Новый Структура("ИД, ЗамерВыезд", СтрокаТЧ.ИдСтроки, ?(СтрокаТЧ.ЭтоВыезд, 2, 1)));
		Если ТекущееЗначение = Неопределено
			ИЛИ (ТекущееЗначение = СтрокаТЧ.ИдСтроки И ЗамерВыезд = ?(СтрокаТЧ.ЭтоВыезд, 2, 1)) Тогда
			ТекущееПоложение = Счетчик;
			УстановленоТекущееПоложение = Истина;			
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	//-- №9853
	
	//++ №9853 комментируем, т.к. теперь замеры и выезды вместе с сортировкой
	//Для каждого СтрокаТЧ из Объект.Замеры Цикл
	//	ПредставлениеЗамера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПредставления
	//		, "Замер"
	//		, СтрокаТЧ.НомерСтроки
	//		, Формат(СтрокаТЧ.ДатаЗамера, "ДЛФ=D")
	//		, ?(ЗначениеЗаполнено(СтрокаТЧ.ВремяНачалаЗамера) , Формат(СтрокаТЧ.ВремяНачалаЗамера, "ДФ=HH:mm"), "")
	//		, ?(ЗначениеЗаполнено(СтрокаТЧ.ИсполнительЗамера) , СтрокаТЧ.ИсполнительЗамера, "")
	//		, ?(ЗначениеЗаполнено(СтрокаТЧ.РезультатЗамера)   , "(" + СтрокаТЧ.РезультатЗамера + ")", "")
	//		);
	//		
	//	Элементы.ТекущийЗамерВыезд.СписокВыбора.Добавить(Счетчик, СокрЛП(ПредставлениеЗамера), , БиблиотекаКартинок.Замер);
	//	СоответствиеЗамеровВыездов.Вставить(Счетчик, Новый Структура("ИД, ЗамерВыезд", СтрокаТЧ.ПолучитьИдентификатор(), 1));
	//	Если ТекущееЗначение = Неопределено 
	//		ИЛИ (ТекущееЗначение = СтрокаТЧ.ПолучитьИдентификатор() И ЗамерВыезд = 1) Тогда
	//		ТекущееПоложение = Счетчик;
	//		УстановленоТекущееПоложение = Истина;			
	//	КонецЕсли;
	//	
	//	Счетчик = Счетчик + 1;
	//КонецЦикла;
	//
	//Для каждого СтрокаТЧ из Объект.Выезды Цикл
	//	ПредставлениеВыезда = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПредставления
	//		, "Выезд"
	//		, СтрокаТЧ.НомерСтроки
	//		, Формат(СтрокаТЧ.Дата, "ДЛФ=D")
	//		, ?(ЗначениеЗаполнено(СтрокаТЧ.ВремяНачала) , Формат(СтрокаТЧ.ВремяНачала, "ДФ=HH:mm"), "")
	//		, ?(ЗначениеЗаполнено(СтрокаТЧ.Исполнитель) , СтрокаТЧ.Исполнитель, "")
	//		, ?(СтрокаТЧ.Выполнен   					, "(выполнен)", "")
	//		);
	//		
	//	Элементы.ТекущийЗамерВыезд.СписокВыбора.Добавить(Счетчик, СокрЛП(ПредставлениеВыезда), , БиблиотекаКартинок.Выезд);
	//	СоответствиеЗамеровВыездов.Вставить(Счетчик, Новый Структура("ИД, ЗамерВыезд", СтрокаТЧ.ПолучитьИдентификатор(), 2));
	//	Если ТекущееЗначение = Неопределено Тогда
	//		Если НЕ УстановленоТекущееПоложение Тогда
	//			ТекущееПоложение = Счетчик;
	//		Иначе
	//			Если НЕ Элементы.Замеры.ТекущиеДанные = Неопределено Тогда
	//				Если ОбщийМодульКлиентСервер.СоединитьДатуИВремя(СтрокаТЧ.Дата, СтрокаТЧ.ВремяНачала) >
	//						ОбщийМодульКлиентСервер.СоединитьДатуИВремя(Элементы.Замеры.ТекущиеДанные.ДатаЗамера, Элементы.Замеры.ТекущиеДанные.ВремяНачалаЗамера) Тогда
	//					ТекущееПоложение = Счетчик;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;
	//	ИначеЕсли (ТекущееЗначение = СтрокаТЧ.ПолучитьИдентификатор() И ЗамерВыезд = 2) Тогда
	//		ТекущееПоложение = Счетчик;
	//	КонецЕсли;
	//	Счетчик = Счетчик + 1;
	//КонецЦикла;
	//-- №9853
	
	ТекущийЗамерВыезд = ТекущееПоложение;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивЗамеровВыездов()
	
	// Выгружаем замеры
	Временная_ТЗ = Объект.Замеры.Выгрузить();
	Временная_ТЗ.Колонки.Добавить("ЭтоВыезд", новый ОписаниеТипов("Булево"));
	Временная_ТЗ.Колонки.Добавить("ИДСтроки", новый ОписаниеТипов("Число"));
	
	//++ №14649 делаем общую колонку с результатом
	МассивТипов = новый Массив;
	МассивТипов.Добавить("СправочникСсылка.РезультатЗамераЛида");
	МассивТипов.Добавить("СправочникСсылка.РезультатыВыездаЛида");
	
	Временная_ТЗ.Колонки.Добавить("Результат", новый ОписаниеТипов(МассивТипов));
	//-- №14649
	
	// Нумеруем сами, т.к. при вставке новой строки, исходный номер строки 0
	Сч = 1;
	Для Каждого ТекущаяСтрока Из Временная_ТЗ Цикл
		
		ТекущаяСтрока.ИсходныйНомерСтроки = Сч;
		ТекущаяСтрока.Результат = ТекущаяСтрока.РезультатЗамера; // №14649
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
	// Добавляем выезды
	Сч = 1;
	Для Каждого ТекущаяСтрока Из Объект.Выезды Цикл
		
		НоваяСтрока = Временная_ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		НоваяСтрока.ДатаЗамера = ТекущаяСтрока.Дата;
		НоваяСтрока.ВремяНачалаЗамера = ТекущаяСтрока.ВремяНачала;
		НоваяСтрока.ВремяОкончанияЗамера = ТекущаяСтрока.ВремяОкончания;
		НоваяСтрока.ИсполнительЗамера = ТекущаяСтрока.Исполнитель;
		НоваяСтрока.ЗамерВыполнен = ТекущаяСтрока.Выполнен;
		НоваяСтрока.ИсходныйНомерСтроки = Сч;
		НоваяСтрока.ЭтоВыезд = Истина;
		НоваяСтрока.Результат = ТекущаяСтрока.Результат; // №14649
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
	// Сортируем
	Временная_ТЗ.Сортировать("ДатаЗамера, ВремяНачалаЗамера, ЭтоВыезд");
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Временная_ТЗ);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИдентификаторыЗамеровВыездов(МассивЗамеровВыездов)
	
	Для Каждого ТекущаяСтрока Из МассивЗамеровВыездов Цикл
		
		ИмяТЧ = "Замеры";
		Если ТекущаяСтрока.ЭтоВыезд Тогда
			ИмяТЧ = "Выезды";
		КонецЕсли;
		
		НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(новый Структура("ИДЗамера", ТекущаяСтрока.ИДЗамера));
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ТекущаяСтрока.ИДСтроки = НайденныеСтроки[0].ПолучитьИдентификатор();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийЗамерВыездПриИзменении(Элемент)
	
	ДанныеЗамераВыезда = СоответствиеЗамеровВыездов.Получить(ТекущийЗамерВыезд);
	
	//++ №8781 если ни замера ни выезда нет, будет неопределено, дальше не идём
	Если ДанныеЗамераВыезда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//-- №8781
	
	Если ДанныеЗамераВыезда.ЗамерВыезд = 1 Тогда
		ПланированиеЗамера = Истина;
		ПланированиеВыезда = Ложь;
		
		Элементы.Замеры.ТекущаяСтрока = ДанныеЗамераВыезда.ИД;
		ТекущаяСтрокаЗамеров = ДанныеЗамераВыезда.ИД;
		ТекущийРезультатЗамера = Элементы.Замеры.ТекущиеДанные.РезультатЗамера;
		УправлениеЭлементамиФормыПоРезультатуЗамера();
		
	ИначеЕсли ДанныеЗамераВыезда.ЗамерВыезд = 2 Тогда
		ПланированиеЗамера = Ложь;
		ПланированиеВыезда = Истина;
		
		Элементы.Выезды.ТекущаяСтрока = ДанныеЗамераВыезда.ИД;
		ТекущаяСтрокаВыездов = ДанныеЗамераВыезда.ИД;	
		ТекущийРезультатВыезда = Элементы.Выезды.ТекущиеДанные.Результат; // №14649 было: Элементы.Выезды.ТекущиеДанные.Выполнен;
		УправлениеЭлементамиФормыПоРезультатуВыезда();

	КонецЕсли;
	
	УправлениеЭлементамиГруппыЗамерВыезд();
	
	ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
	ОбновитьГрафикЗамеров();
	
КонецПроцедуры

#Область Замеры

&НаКлиенте
Процедура ДатаЗамераПриИзменении(Элемент)
	
	ДатаЗамера = Элементы.Замеры.ТекущиеДанные.ДатаЗамера;
	ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
	ОбновитьГрафикЗамеров();
	Если НЕ ДатаЗамера = Дата(1,1,1) Тогда
		НазначенЗамер = Истина;
		//ПредыдущаяДатаЗамера = ДатаЗамера;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТочкаПродажПриИзменении(Элемент)
	ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
	ОбновитьГрафикЗамеров();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПодразделениеПриИзменении(Элемент)
	//#12515
	ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
	ОбновитьГрафикЗамеров();
КонецПроцедуры

&НаКлиенте
Процедура Адрес1ПриИзменении(Элемент)
	ОбработкаСобытияАдресПриИзменении(Объект.Адрес, Объект.ИдентификаторУлицы);
КонецПроцедуры

&НаКлиенте
Процедура Адрес1ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)	
	
	ОбщийМодульКлиент.ОбработкаСобытияАдресОбработкаВыбора(ЭтаФорма, Объект.Адрес, Объект.ИдентификаторУлицы, ВремАдрес, Элементы.Адрес1, "СдвинутьКурсорАдресаНаПоследнийСимвол", ВыбранноеЗначение, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Адрес1АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ОбработкаСобытияАдресАвтоПодбор(ЭтаФорма, Объект.ИдентификаторУлицы, ИдентификаторНаселенногоПункта, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Адрес1ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ОбработкаСобытияАдресОкончаниеВводаТекста(Объект.Адрес, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ПоследнийКомментарийКЗамеру1ПриИзменении(Элемент)
	ОбновитьТекстНаГрафикеЗамеровНаСервере();
КонецПроцедуры

#Область ГруппаКомандЗакрытиеЗамера

&НаКлиенте
Процедура ЗамерЗаключенДоговор(Команда)
	
	ТекущиеДанныеЗамера = Элементы.Замеры.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанныеЗамера.ИсполнительЗамера) Тогда
		Сообщить("Необходимо указать исполнителя замера!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьУказаниеВремениЗамера() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Записать();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийСтатус", Объект.ТекущийСтатус); //#8113
	ПараметрыФормы.Вставить("СтатусПерехода", Строка(ПредопределенноеЗначение("Справочник.СтатусыЛида.ОформитьДоговор"))); //#8113
	Оповещение = Новый ОписаниеОповещения("ЗамерЗаключенДоговорЗавершение", ЭтаФорма);
	ОткрытьФорму("Документ.Лид.Форма.ЗаключенДоговорУточнение",ПараметрыФормы,ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамерЗаключенДоговорЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если НЕ Результат = Неопределено Тогда
		ЗамерВыполнен = Истина;
		РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗаключенДоговор");
		СуммаДоговораНаЗамере = Результат.СуммаДоговора;
		СуммаАвансаНаЗамере = Результат.СуммаАвансаНаЗамере;
		
		//#6588
		ТекущийРезультатЗамера = РезультатЗамера;
		Элементы.Замеры.ТекущиеДанные.ЗамерВыполнен = Истина;
		Элементы.Замеры.ТекущиеДанные.РезультатЗамера = РезультатЗамера;
		Элементы.Замеры.ТекущиеДанные.СуммаДоговораНаЗамере = Результат.СуммаДоговора;
		Элементы.Замеры.ТекущиеДанные.СуммаАвансаНаЗамере = Результат.СуммаАвансаНаЗамере;
		Элементы.Замеры.ТекущиеДанные.КомментарийЗамерщика = Результат.Комментарий;
		
		Объект.ПредполагаемыйМонтажВремя = Результат.ВремяМонтажа;
		Объект.ПредполагаемыйМонтажДата = Результат.ДатаМонтажа;
		Объект.ПредполагаемыйМонтажДатаМонтажаНеОпределена = Результат.ДатаБудетОпределенаПоЗвонку;
		Объект.ПоследнийКомментарий = Результат.Комментарий;
		Объект.ПоследнийКомментарийЗамерщика = Результат.Комментарий;
		
		ТекстМонтаж = "";
		Если Результат.ДатаБудетОпределенаПоЗвонку Тогда
			ТекстМонтаж = ТекстМонтаж + "Дата монтажа будет определена по звонку. ";
		Иначе
			ТекстМонтаж = "При замере указана дата монтажа " + Формат(Результат.ДатаМонтажа,"ДЛФ=Д") + " время: " + Формат(Результат.ВремяМонтажа,"ДЛФ=В")
		КонецЕсли;
		
		ДобавитьЗаписьВИсториюКлиент("Замер выполнен. " + ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗаключенДоговор") + ". Предварительная сумма: " + СуммаДоговораНаЗамере + ". Получен аванс: " + СуммаАвансаНаЗамере + ". " + ТекстМонтаж + ?(ПустаяСтрока(Результат.Комментарий),""," Комментарий: " + Результат.Комментарий));
		Модифицированность = Истина;
		Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОформитьДоговор");
		УправлениеЭлементамиФормыПоСтатусу();
	КонецЕсли;
	
	
	Если НЕ ЗамерВыполнен Тогда
		Элементы.ГруппаЗамерВыезд.ЦветФона = WebЦвета.ТемноОранжевый;
	Иначе
		Элементы.ГруппаЗамерВыезд.ЦветФона = WebЦвета.Белый;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамерДоговорНеЗаключен(Команда)
	
	ТекущиеДанныеЗамера = Элементы.Замеры.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанныеЗамера.ИсполнительЗамера) Тогда
		Сообщить("Необходимо указать исполнителя замера!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьУказаниеВремениЗамера() Тогда
		Возврат;
	КонецЕсли;	
	
	ЭтаФорма.Записать();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийСтатус", Объект.ТекущийСтатус); //#8113
	ПараметрыФормы.Вставить("СтатусПерехода", Строка(ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор"))); //#8113
	//ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ=dd.MM.yyyy") + " " + Формат(Объект.ПоследнееВремяПерезвонить, "ДФ=HH:mm"))); //№9558
	ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'"))); //№9558
	Оповещение = Новый ОписаниеОповещения("ЗамерДоговорНеЗаключенЗавершение", ЭтаФорма);
	ОткрытьФорму("Документ.Лид.Форма.УточнениеОтказНаЗамере",ПараметрыФормы,ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамерДоговорНеЗаключенЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если НЕ Результат = Неопределено Тогда
		ПричинаОтказаЗамера = Результат.ПричинаОтказаЗамера;
		Объект.ПоследнийКомментарий = Результат.Комментарий;
		Объект.ПоследнийКомментарийЗамерщика = Результат.Комментарий;
		Объект.ПоследняяДатаПерезвонить = Результат.Дата;
		//Объект.ПоследнееВремяПерезвонить = Результат.Время;
		//ВремДатаПерезвонить = Дата(Год(Результат.Дата), Месяц(Результат.Дата), День(Результат.Дата), Час(Результат.Время), Минута(Результат.Время), Секунда(Результат.Время));
		ЗамерВыполнен = Истина;
		РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ДоговорНеЗаключен");
		ДобавитьЗаписьВИсториюКлиент("Замер выполнен. " + ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ДоговорНеЗаключен") + ". Комментарий: " + Результат.Комментарий + ?(Результат.Дата = Дата(1,1,1), "", ". Перезвонить: " + Формат(Результат.Дата, "ДФ='dd.MM.yyyy HH:mm'")));
		Модифицированность = Истина;
		Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор");
		УправлениеЭлементамиФормыПоСтатусу();
		
		//#6588
		ТекущийРезультатЗамера = РезультатЗамера;
		Элементы.Замеры.ТекущиеДанные.ЗамерВыполнен = Истина;
		Элементы.Замеры.ТекущиеДанные.РезультатЗамера = РезультатЗамера;
		Элементы.Замеры.ТекущиеДанные.КомментарийЗамерщика = Результат.Комментарий;
		Элементы.Замеры.ТекущиеДанные.ПричинаОтказа = ПричинаОтказаЗамера;
		
	КонецЕсли;
	
	Если НЕ ЗамерВыполнен Тогда
		Элементы.ГруппаЗамерВыезд.ЦветФона = WebЦвета.ТемноОранжевый;
	Иначе
		Элементы.ГруппаЗамерВыезд.ЦветФона = WebЦвета.Белый;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамерНазначитьНовыйЗамер(Команда)
	
	Если НЕ ПроверитьУказаниеВремениЗамера() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Записать();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийСтатус", Объект.ТекущийСтатус); //#8113
	ПараметрыФормы.Вставить("СтатусПерехода", Строка(ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер"))); //#8113
	//ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ=dd.MM.yyyy") + " " + Формат(Объект.ПоследнееВремяПерезвонить, "ДФ=HH:mm"))); //№9558
	ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'"))); //№9558
	Оповещение = Новый ОписаниеОповещения("ЗамерНазначитьНовыйЗамерЗавершение", ЭтаФорма);
	ОткрытьФорму("Документ.Лид.Форма.Уточнение",ПараметрыФормы,ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамерНазначитьНовыйЗамерЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Модифицированность = Истина;
		
		ПолученКомментарий = Результат.Комментарий;
		Объект.ПоследнийКомментарий = ПолученКомментарий;
		Объект.ПоследнийКомментарийЗамерщика = ПолученКомментарий;
		ЗамерВыполнен = Ложь;
		РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерНеПроизводился");
		Объект.ПоследняяДатаПерезвонить = Результат.Дата;
		//Объект.ПоследнееВремяПерезвонить = Результат.Время;
		//ВремДатаПерезвонить = Дата(Год(Результат.Дата), Месяц(Результат.Дата), День(Результат.Дата), Час(Результат.Время), Минута(Результат.Время), Секунда(Результат.Время));

		ДобавитьЗаписьВИсториюКлиент("" + ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерНеПроизводился") + ". Комментарий: " + ПолученКомментарий+ ?(Объект.ПоследняяДатаПерезвонить = Дата(1,1,1),"",". Перезвонить: " + Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'")));
		
		Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер");
		УправлениеЭлементамиФормыПоСтатусу();
		
		//сбросим данные последнего замера, т.к. надо назначать новый
		//Если Объект.Замеры.Количество() > 0 Тогда
		//	НомерСтроки = Объект.Замеры.Количество()-1;
		//	Если Объект.Замеры[НомерСтроки].ДатаЗамера = Объект.ПоследняяДатаЗамера 
		//		И Объект.Замеры[НомерСтроки].ИсполнительЗамера = Объект.ПоследнийИсполнительЗамера Тогда
		//		//Объект.Замеры[НомерСтроки].Отменен = Истина;
		//		//Объект.Замеры[НомерСтроки].РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен");
		//		Объект.Замеры[НомерСтроки].РезультатЗамера = РезультатЗамера;
		//		Объект.Замеры[НомерСтроки].ПричинаОтказа = Результат.ПричинаОтказаЗамера;
		//	КонецЕсли;
		//КонецЕсли;	
		Объект.ПоследняяДатаЗамера = Дата(1,1,1);
		Объект.ПоследнийИсполнительЗамера = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
		Объект.ПоследнийНазначилЗамер = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
		Объект.ПоследнийДатаНазначилиЗамер = Дата(1,1,1);
		
		//#6588
		ТекущийРезультатЗамера = РезультатЗамера;
		Элементы.Замеры.ТекущиеДанные.ЗамерВыполнен = Ложь;
		Элементы.Замеры.ТекущиеДанные.РезультатЗамера = РезультатЗамера;
		Элементы.Замеры.ТекущиеДанные.КомментарийЗамерщика = Результат.Комментарий;
		Элементы.Замеры.ТекущиеДанные.ПричинаОтказа = Результат.ПричинаОтказаЗамера;
		
	КонецЕсли;
	
	Если ЗамерВыполнен Тогда
		Элементы.ГруппаЗамерВыезд.ЦветФона = WebЦвета.ТемноОранжевый;
	Иначе
		Элементы.ГруппаЗамерВыезд.ЦветФона = WebЦвета.Белый;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДекорацияИсторияЗамеровНажатие(Элемент)
	
	ПараметрыНовойформы = Новый Структура;
	ПараметрыНовойформы.Вставить("Объект",Объект.Ссылка);
	ОткрытьФорму("Документ.Лид.Форма.ИсторияЗамеров", ПараметрыНовойформы, ЭтаФорма);
	
КонецПроцедуры

#Область ОписаниеЗамерщиков

&НаКлиенте
Процедура ОписаниеЗамерщиковHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВРег(ДанныеСобытия.Element.tagName) = "A" Тогда
		
		СсылкаТекст = Сред(ДанныеСобытия.Element.href, 4);
		СсылкаЗамерщик = ЗамерщикПоВнутреннемуПредставлению(СсылкаТекст);
		Если НЕ СсылкаЗамерщик.Пустая()  Тогда 
			ПоказатьЗначение(, СсылкаЗамерщик);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЗамерщикПоВнутреннемуПредставлению(СсылкаТекст) 
	Возврат ЗначениеИзСтрокиВнутр(СсылкаТекст);
КонецФункции

&НаКлиенте
Процедура ПоказатьОписаниеЗамерщиковНажатие(Элемент)
	
	Если Элементы.ГруппаОписаниеЗамерщиков.Видимость Тогда
		Элементы.ГруппаГрафик.Ширина = 100;
		Элементы.ГруппаОписаниеЗамерщиков.Видимость = Ложь;
		Элементы.ПоказатьОписаниеЗамерщиков.Заголовок = "Показать описание замерщиков";
	Иначе
		Элементы.ГруппаГрафик.Ширина = 70;
		Элементы.ГруппаОписаниеЗамерщиков.Видимость = Истина;
		Элементы.ПоказатьОписаниеЗамерщиков.Заголовок = "Скрыть описание замерщиков";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Выезды

&НаКлиенте
Процедура ДатаВыездаПриИзменении(Элемент)
	
	ДатаВыезда = Элементы.Выезды.ТекущиеДанные.Дата;
	ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
	ОбновитьГрафикЗамеров();
	//Если НЕ ДатаВыезда = Дата(1,1,1) Тогда
	//	ПредыдущаяДатаВыезда = ДатаВыезда;
	//КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура АдресВыездаПриИзменении(Элемент)
	ОбработкаСобытияАдресПриИзменении(Объект.АдресВыезда, Объект.ИдентификаторУлицыВыезда);
КонецПроцедуры

&НаКлиенте
Процедура АдресВыездаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)	
	
	// №10663 унифицировали, чтобы использовать с разных форм
	//ОбработкаСобытияАдресОбработкаВыбора(Объект.АдресВыезда, Объект.ИдентификаторУлицыВыезда, ВремАдресВыезда, Элементы.АдресВыезда, "СдвинутьКурсорАдресаВыездаНаПоследнийСимвол", ВыбранноеЗначение, СтандартнаяОбработка);
	ОбщийМодульКлиент.ОбработкаСобытияАдресОбработкаВыбора(ЭтаФорма, Объект.АдресВыезда, Объект.ИдентификаторУлицыВыезда, ВремАдресВыезда, Элементы.АдресВыезда, "СдвинутьКурсорАдресаВыездаНаПоследнийСимвол", ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресВыездаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ОбработкаСобытияАдресАвтоПодбор(ЭтаФорма, Объект.ИдентификаторУлицыВыезда, ИдентификаторНаселенногоПунктаВыезда, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресВыездаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ОбработкаСобытияАдресОкончаниеВводаТекста(Объект.АдресВыезда, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВыездВыполнен(Команда)	
	
	ТекущиеДанныеВыезда = Элементы.Выезды.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанныеВыезда.Исполнитель) Тогда
		Сообщить("Необходимо указать исполнителя выезда!");
		Возврат;
	КонецЕсли;

	Если НЕ ПроверитьУказаниеВремениВыезда() ИЛИ Объект.Выезды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ЭтаФорма.Записать();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыездЗавершенЗавершение", ЭтаФорма);
	
	//++ №14649
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийСтатус", Объект.ТекущийСтатус);
	ПараметрыФормы.Вставить("СтатусПерехода", Объект.СтатусВозвратаПослеВыезда);
	ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'")));
	//-- №14649
	
	ОткрытьФорму("Документ.Лид.Форма.ФормаЗакрытияВыезда",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыездЗавершенЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекущиеДанные = Элементы.Выезды.ТекущиеДанные;
	
	ТекущиеДанные.Выполнен = Истина;
	ТекущиеДанные.Результат = ПредопределенноеЗначение("Справочник.РезультатыВыездаЛида.ВыездВыполнен"); // №14649
	ТекущиеДанные.КомментарийЗамерщика =  Результат.РезультатВыезда;
	
	ТекущийРезультатВыезда = ТекущиеДанные.Результат; //№14649 было: ТекущийРезультатВыезда = Истина;
	
	//++ №14649
	Объект.ПоследняяДатаПерезвонить = Результат.Дата;
	
	ДобавитьЗаписьВИсториюКлиент(СтрШаблон("Выезд выполнен. Комментарий: %1.%2", Результат.РезультатВыезда, ?(Объект.ПоследняяДатаПерезвонить = Дата(1,1,1), "", " Перезвонить: " + Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'"))));
	
	Если ЗначениеЗаполнено(Объект.СтатусВозвратаПослеВыезда) Тогда
		
		Объект.ТекущийСтатус = Объект.СтатусВозвратаПослеВыезда;
		Объект.СтатусВозвратаПослеВыезда = ПредопределенноеЗначение("Справочник.СтатусыЛида.ПустаяСсылка");
		
	КонецЕсли;
	
	УправлениеЭлементамиФормыПоРезультатуВыезда();
	//-- №14649
	
КонецПроцедуры

//++ №14649
&НаКлиенте
Процедура ВыездНеВыполнен(Команда)
	
	ТекущиеДанныеВыезда = Элементы.Выезды.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанныеВыезда.Исполнитель) Тогда
		Сообщить("Необходимо указать исполнителя выезда!");
		Возврат;
	КонецЕсли;

	Если НЕ ПроверитьУказаниеВремениВыезда() ИЛИ Объект.Выезды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ЭтаФорма.Записать();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыездНеВыполненЗавершение", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийСтатус", Объект.ТекущийСтатус);
	ПараметрыФормы.Вставить("СтатусПерехода", Объект.СтатусВозвратаПослеВыезда);
	ПараметрыФормы.Вставить("ДатаСледующегоКонтакта", СокрЛП(Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'")));
	ПараметрыФормы.Вставить("РежимОтказа", Истина);
	
	ОткрытьФорму("Документ.Лид.Форма.ФормаЗакрытияВыезда", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыездНеВыполненЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.Выезды.ТекущиеДанные;
	
	ТекущиеДанные.Выполнен = Ложь;
	ТекущиеДанные.Результат = ПредопределенноеЗначение("Справочник.РезультатыВыездаЛида.ВыездНеВыполнен");
	ТекущиеДанные.КомментарийЗамерщика = Результат.РезультатВыезда;
	ТекущиеДанные.ПричинаОтказа = Результат.ПричинаОтказа;
	
	Объект.ПоследняяДатаПерезвонить = Результат.Дата;
	
	ТекущийРезультатВыезда = ТекущиеДанные.Результат;
	
	ДобавитьЗаписьВИсториюКлиент(СтрШаблон("Выезд не выполнен. Комментарий: %1.%2", Результат.РезультатВыезда, ?(Объект.ПоследняяДатаПерезвонить = Дата(1,1,1), "", " Перезвонить: " + Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'"))));
	
	Если ЗначениеЗаполнено(Объект.СтатусВозвратаПослеВыезда) Тогда
		
		Объект.ТекущийСтатус = Объект.СтатусВозвратаПослеВыезда;
		Объект.СтатусВозвратаПослеВыезда = ПредопределенноеЗначение("Справочник.СтатусыЛида.ПустаяСсылка");
		
	КонецЕсли;
	
	УправлениеЭлементамиФормыПоРезультатуВыезда();
	
КонецПроцедуры
//-- №14649

&НаКлиенте
Функция ПроверитьУказаниеВремениВыезда()
	
	ТекущиеДанныеВыезда = Элементы.Выезды.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанныеВыезда.ВремяНачала) ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанныеВыезда.ВремяОкончания) Тогда
		Сообщить("Необходимо указать время начала и окончания выезда, для его установки в выполнен!");		
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область Графики

&НаКлиенте
Процедура ВариантОтображенияГрафикаПриИзменении(Элемент)
	ВариантОтображенияГрафикаПриИзмененииНаСервере();
	
	ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
	ОбновитьГрафикЗамеров();
	
	ОбновитьЭлементыФормыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВариантОтображенияГрафикаПриИзмененииНаСервере()
	ХранилищеОбщихНастроек.Сохранить("ДокументЛид", "ВариантОтображенияГрафика", ВариантОтображенияГрафика);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивЗамерщиков()
	
	ТаблицаЗамерщиков = МодульОтчетов.ПолучитьТаблицуЗамерщиков(ФильтрТочкаПродаж, ФильтрПодразделение);
	МассивЗамерщиков = ТаблицаЗамерщиков.ВыгрузитьКолонку("Сотрудник");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПулЗамеров") Тогда
		МассивЗамерщиков.Добавить(Справочники.Сотрудники.ПустаяСсылка());
	КонецЕсли;
	Возврат МассивЗамерщиков;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуЗамеров(ДатаНачалаГрафика, ДатаОкончанияГрафика, МассивЗамерщиков)
	
	ТаблицаЗамеров = МодульОтчетов.ПолучитьТаблицуЗамеров(ДатаНачалаГрафика, ДатаОкончанияГрафика, МассивЗамерщиков);
	ТаблицаЗамеров.Сортировать("Сотрудник, Дата, ВремяНачала");
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗамеров);
	
КонецФункции

//&НаСервере
&НаКлиенте
Процедура ПолучитьПервоначальныеДанныеДляГрафикаЗамеров()
	
	// формируем таблицу с данными для вывода на графики
	
	ТаблицаГрафикЗамеров.Очистить();
	МассивСотрудников = ПолучитьМассивЗамерщиков();
	
	ДатаНачалаГрафика = ТекущаяДата();
	
	//#6588
	Если ПланированиеЗамера Тогда
		ТекущиеДанные = Элементы.Замеры.ТекущиеДанные;
		Если НЕ ТекущиеДанные = Неопределено Тогда
			ДатаЗамераТекущиеДанные = ТекущиеДанные.ДатаЗамера;
			ВремяНачалаЗамера = ТекущиеДанные.ВремяНачалаЗамера;
			ВремяОкончанияЗамера = ТекущиеДанные.ВремяОкончанияЗамера;
			ДатаНачалаГрафика = ДатаЗамераТекущиеДанные;
		КонецЕсли;
	ИначеЕсли ПланированиеВыезда Тогда
		ТекущиеДанные = Элементы.Выезды.ТекущиеДанные;
		Если НЕ ТекущиеДанные = Неопределено Тогда
			ДатаВыездаТекущиеДанные = ТекущиеДанные.Дата;
			ВремяНачалаЗамера = ТекущиеДанные.ВремяНачала;
			ВремяОкончанияЗамера = ТекущиеДанные.ВремяОкончания; 
			ДатаНачалаГрафика = ДатаВыездаТекущиеДанные;
		КонецЕсли;
	КонецЕсли;
	
	// если в замере/выезде очистили дату
	ДатаНачалаГрафика = ?(ДатаНачалаГрафика = Дата(1,1,1), ТекущаяДата(), ДатаНачалаГрафика);
	
	Если ВариантОтображенияГрафика = 2 Тогда
		//Если НЕ ПредыдущаяДатаЗамера = Дата(1,1,1) Тогда
		//	ДатаНачалаГрафика = ПредыдущаяДатаЗамера;
		//КонецЕсли;
		
		// если новая дата начала попадает в отображаемый период, то не меняем отображаемый период
		Если НЕ ТекущаяДатаГрафика = Дата(1,1,1) Тогда
			Если ДатаНачалаГрафика >= ТекущаяДатаГрафика И ДатаНачалаГрафика <= ТекущаяДатаГрафика + ИнтервалГрафикаТаблица Тогда
				ДатаНачалаГрафика = ТекущаяДатаГрафика;
			КонецЕсли;
		КонецЕсли;
		ДатаОкончанияГрафика = ДатаНачалаГрафика + ИнтервалГрафикаТаблица;		
	Иначе
		ДатаОкончанияГрафика = ДатаНачалаГрафика;
	КонецЕсли;
	ТекущаяДатаГрафика = ДатаНачалаГрафика;
	//получаем таблицу замеров/выездов/невыходов из регистра для отображения графика за заданный период
	ТаблицаЗамеров = ПолучитьТаблицуЗамеров(ДатаНачалаГрафика, ДатаОкончанияГрафика, МассивСотрудников);
	
	Для каждого ЭлементЗамера из ТаблицаЗамеров Цикл		
		Если НЕ ЭлементЗамера.Регистратор = Объект.Ссылка Тогда
			НоваяСтрока = ТаблицаГрафикЗамеров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементЗамера, 
									"Регистратор, Дата, ВремяНачала, ВремяОкончания, 
									|Город, Адрес, ИмяКлиента, Комментарий, ТелефонКлиента, Результат, Сотрудник, ЗамерВыполнен, ОтсутствиеИсполнителя, ЭтоВыезд,
									|ИДЗамера, ТочкаПродаж, КоличествоЗамерщиковПоПлану");					
			НоваяСтрока.ТекстНаГрафике = ОбщийМодуль.ПолучитьТекстДляГрафикаЗамеров(ЭлементЗамера);
			НоваяСтрока.ЗначениеНаГрафике = "";
			НоваяСтрока.Текущий = Ложь;
		КонецЕсли;
	КонецЦикла;

	// добавим в таблицу замерщика для отображения в графике, если его еще нет
	// зачем это??? пока убрано 
	//Для каждого ЭлементСотрудник из МассивСотрудников Цикл
	//	ЕстьСотрудник = Ложь;
	//	Для каждого ЭлементТаблицыЗамеров из ТаблицаЗамеров Цикл
	//		Если ЭлементТаблицыЗамеров.Сотрудник = ЭлементСотрудник Тогда
	//			ЕстьСотрудник = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Если НЕ ЕстьСотрудник Тогда
	//		НоваяСтрока = ТаблицаГрафикЗамеров.Добавить();
	//		НоваяСтрока.Сотрудник = ЭлементСотрудник;
	//	КонецЕсли;
	//КонецЦикла;	
	
	СтруктураДанныхДляТекстаГрафика = Новый Структура;
	СтруктураДанныхДляТекстаГрафика.Вставить("Комментарий", 	Объект.Комментарий);
	СтруктураДанныхДляТекстаГрафика.Вставить("Адрес", 			Объект.Адрес);
	СтруктураДанныхДляТекстаГрафика.Вставить("ИмяКлиента", 		Объект.ИмяКлиента);
	СтруктураДанныхДляТекстаГрафика.Вставить("Город", 			Объект.Город);
	СтруктураДанныхДляТекстаГрафика.Вставить("ТелефонКлиента",  УправлениеКонтактнойИнформациейКлиентПотолки.ПолучитьТелефонИзКонтактнойИнформацииФормы(ЭтотОбъект));
		
	//добавим замеры текущего документа
	Для Каждого ЗамерТекущегоДокумента Из Объект.Замеры Цикл
		Если ЗамерТекущегоДокумента.ДатаЗамера < ДатаНачалаГрафика 
			ИЛИ ЗамерТекущегоДокумента.ДатаЗамера > ДатаОкончанияГрафика 
			ИЛИ НЕ ЗначениеЗаполнено(ЗамерТекущегоДокумента.ДатаЗамера) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗамерТекущегоДокумента.ВремяНачалаЗамера = Дата(1,1,1) И ЗамерТекущегоДокумента.ВремяОкончанияЗамера = Дата(1,1,1) 
			//И ЗамерТекущегоДокумента.ИсполнительЗамера.Пустая() //#6384 закомментировано
			ИЛИ ЗамерТекущегоДокумента.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен") 
			ИЛИ ЗамерТекущегоДокумента.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерНеПроизводился") 
			Тогда 
			// не нужен в графике
		Иначе
			НоваяСтрока = ТаблицаГрафикЗамеров.Добавить();
			НоваяСтрока.Сотрудник = ЗамерТекущегоДокумента.ИсполнительЗамера;
			НоваяСтрока.ВремяНачала  = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(ЗамерТекущегоДокумента.ДатаЗамера, ЗамерТекущегоДокумента.ВремяНачалаЗамера);
			НоваяСтрока.ВремяОкончания = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(ЗамерТекущегоДокумента.ДатаЗамера, ЗамерТекущегоДокумента.ВремяОкончанияЗамера);
			НоваяСтрока.ТекстНаГрафике = ОбщийМодуль.ПолучитьТекстДляГрафикаЗамеров(СтруктураДанныхДляТекстаГрафика, Объект.ПоследнийКомментарийКЗамеру);
			НоваяСтрока.ЗамерВыполнен = ЗамерТекущегоДокумента.ЗамерВыполнен;
			НоваяСтрока.Текущий = Истина;
			НоваяСтрока.ЗначениеНаГрафике = "Текущий";
			НоваяСтрока.Регистратор = Объект.Ссылка;
			НоваяСтрока.Новый = (ЗамерТекущегоДокумента.НомерСтроки = Объект.Замеры.Количество());
			НоваяСтрока.НазначилЗамер = ЗамерТекущегоДокумента.НазначилЗамер;
			НоваяСтрока.Дата = ЗамерТекущегоДокумента.ДатаЗамера;
			
			НоваяСтрока.Город = Объект.Город;
			НоваяСтрока.Адрес = Объект.Адрес;
			НоваяСтрока.ИмяКлиента = Объект.ИмяКлиента; 
			НоваяСтрока.Комментарий = Объект.ПоследнийКомментарийКЗамеру;
			НоваяСтрока.ТелефонКлиента = СтруктураДанныхДляТекстаГрафика.ТелефонКлиента;
			НоваяСтрока.Результат = ЗамерТекущегоДокумента.РезультатЗамера;
			
			НоваяСтрока.ИДЗамера = ЗамерТекущегоДокумента.ИДЗамера;
			НоваяСтрока.ТочкаПродаж  = Объект.ТочкаПродаж;
			НоваяСтрока.КоличествоЗамерщиковПоПлану = ПолучитьКоличествоЗамерщиковПоПлану(ЗамерТекущегоДокумента.ДатаЗамера, Объект.ТочкаПродаж);
			
		КонецЕсли;
	КонецЦикла;
	
	//добавим выезды текущего документа
	Для Каждого ВыездТекущегоДокумента Из Объект.Выезды Цикл
		Если ВыездТекущегоДокумента.Дата < ДатаНачалаГрафика 
			ИЛИ ВыездТекущегоДокумента.Дата > ДатаОкончанияГрафика 
			ИЛИ НЕ ЗначениеЗаполнено(ВыездТекущегоДокумента.Дата) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресВыезда = ?(ПустаяСтрока(Объект.АдресВыезда), Объект.Адрес, Объект.АдресВыезда);
		Если ВыездТекущегоДокумента.ВремяНачала = Дата(1,1,1) и ВыездТекущегоДокумента.ВремяОкончания = Дата(1,1,1) 
			//и ВыездТекущегоДокумента.Исполнитель.Пустая() //#6384 закомментировано
			ИЛИ ВыездТекущегоДокумента.Результат = ПредопределенноеЗначение("Справочник.РезультатыВыездаЛида.ВыездОтменен") 
			ИЛИ ВыездТекущегоДокумента.Результат = ПредопределенноеЗначение("Справочник.РезультатыВыездаЛида.ВыездНеВыполнен")
			Тогда
			// не нужен в графике
		Иначе
			НоваяСтрока = ТаблицаГрафикЗамеров.Добавить();
			НоваяСтрока.Сотрудник = ВыездТекущегоДокумента.Исполнитель;
			НоваяСтрока.ВремяНачала  = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(ВыездТекущегоДокумента.Дата, ВыездТекущегоДокумента.ВремяНачала);
			НоваяСтрока.ВремяОкончания = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(ВыездТекущегоДокумента.Дата, ВыездТекущегоДокумента.ВремяОкончания);
			НоваяСтрока.ТекстНаГрафике = ОбщийМодуль.ПолучитьТекстДляГрафикаЗамеров(СтруктураДанныхДляТекстаГрафика, , АдресВыезда);
			НоваяСтрока.ЗамерВыполнен = ВыездТекущегоДокумента.Выполнен;
			НоваяСтрока.Текущий = Истина;
			НоваяСтрока.ЗначениеНаГрафике = "Текущий";
			НоваяСтрока.Регистратор = Объект.Ссылка;
			НоваяСтрока.Новый = (ВыездТекущегоДокумента.НомерСтроки = Объект.Выезды.Количество());
			НоваяСтрока.НазначилЗамер = ВыездТекущегоДокумента.Назначил;
			НоваяСтрока.ЭтоВыезд = Истина;
			
			НоваяСтрока.Дата  = ВыездТекущегоДокумента.Дата;
			НоваяСтрока.Город = Объект.Город;
			НоваяСтрока.Адрес = АдресВыезда;
			НоваяСтрока.ИмяКлиента = Объект.ИмяКлиента; 
			НоваяСтрока.Комментарий = "";
			НоваяСтрока.ТелефонКлиента = СтруктураДанныхДляТекстаГрафика.ТелефонКлиента;
			
			НоваяСтрока.ИДЗамера = ВыездТекущегоДокумента.ИДЗамера;
			НоваяСтрока.ТочкаПродаж  = Объект.ТочкаПродаж;
			НоваяСтрока.КоличествоЗамерщиковПоПлану = ПолучитьКоличествоЗамерщиковПоПлану(ВыездТекущегоДокумента.Дата, Объект.ТочкаПродаж);
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаГрафикЗамеров.Сортировать("Сотрудник Возр");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоЗамерщиковПоПлану(ДатаЗамера, ТочкаПродаж)
	Возврат МодульОтчетов.ПолучитьКоличествоЗамерщиковПоПлану(ДатаЗамера, ДатаЗамера, ТочкаПродаж);
КонецФункции

&НаКлиенте
Процедура ОбновитьГрафикЗамеров()
	
	// ниже по датам все закомментировано: ориентируемся на реквизит формы ТекущаяДатаГрафика 	
	//ДатаЗамераТекущиеДанные = Элементы.Замеры.ТекущиеДанные.ДатаЗамера; //#6588
	ДатаНачалаГрафика = ТекущаяДатаГрафика;
	Если ВариантОтображенияГрафика = 2 Тогда
	//	Если НЕ ПредыдущаяДатаЗамера = Дата(1,1,1) Тогда
	//		ДатаНачалаГрафика = ПредыдущаяДатаЗамера;
	//	КонецЕсли;
		ДатаОкончанияГрафика = ДатаНачалаГрафика + ИнтервалГрафикаТаблица;
	Иначе
		ДатаОкончанияГрафика = ДатаНачалаГрафика;
	КонецЕсли;	
			
	ОбновитьГрафикЗамеровНаСервере(ДатаНачалаГрафика, ДатаОкончанияГрафика);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьГрафикЗамеровНаСервере(ДатаНачалаГрафика, ДатаОкончанияГрафика)
	
	Элементы.ДекорацияПустойПланЗамерщиков.Видимость = Ложь;
	
	Если ВариантОтображенияГрафика = 2 Тогда		
		ОбновитьГрафикЗамеровТаблицаНаСервере(ДатаНачалаГрафика, ДатаОкончанияГрафика);
	Иначе	
		ОбновитьГрафикЗамеровПланировщикНаСервере(ДатаНачалаГрафика, ДатаОкончанияГрафика);
	КонецЕсли;
	
	ОписаниеЗамерщиковHTML = Документы.Лид.СформироватьОписаниеЗамерщиковHTML(ФильтрТочкаПродаж);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстНаГрафикеЗамеровНаСервере()
	Для каждого ЭлементГрафика Из ГрафикЗамеров.Элементы Цикл
		Если ЭлементГрафика.Значение.ЗначениеНаГрафике = "ТекущийЗамер" Тогда
			ЭлементГрафика.Текст = ОбщийМодуль.ПолучитьТекстДляГрафикаЗамеров(Объект, Объект.ПоследнийКомментарийКЗамеру);
		ИначеЕсли ЭлементГрафика.Значение.ЗначениеНаГрафике = "ТекущийВыезд" Тогда
			ЭлементГрафика.Текст = ОбщийМодуль.ПолучитьТекстДляГрафикаЗамеров(Объект,, ?(ПустаяСтрока(Объект.АдресВыезда), Объект.Адрес, Объект.АдресВыезда));
		КонецЕсли;
	КонецЦикла;			
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбИзмененииЗамера(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	// новый замер/выезд
	Расшифровка = ДопПараметры.Расшифровка;
	Если НЕ ПроверитьСвободныйИнтервалЗамеров(ДопПараметры.Расшифровка, Объект.Ссылка) Тогда
		Сообщить("Выбранный интервал занят");
		Возврат;
	КонецЕсли;
	Если ПланированиеВыезда Тогда
		ИзменитьДанныеТекущегоВыезда(Расшифровка.ИсполнительЗамера, Расшифровка.ВремяНачалаЗамера, Расшифровка.ВремяОкончанияЗамера, Расшифровка.ДатаЗамера);
	Иначе 	
		ИзменитьДанныеТекущегоЗамера(Расшифровка.ИсполнительЗамера, Расшифровка.ВремяНачалаЗамера, Расшифровка.ВремяОкончанияЗамера, Расшифровка.ДатаЗамера);
	КонецЕсли;	
	ОбновитьГрафикЗамеров();
	
	Модифицированность = Истина;
КонецПроцедуры

//&НаСервере
&НаКлиенте
Процедура ИзменитьДанныеТекущегоЗамера(Сотрудник, ВремяС, ВремяПо, ПараметрДатаЗамера=Неопределено)
	
	//#12459
	Если ЗначениеЗаполнено(Элементы.Замеры.ТекущиеДанные.РезультатЗамера) Тогда
		Сообщить("По замеру заполнен результат: изменение запрещено!");
		Возврат;	
	КонецЕсли;
	
	КонецМинута = Минута(ВремяПо);
	КонецЧас = Час(ВремяПо);
	КонецСекунда = Секунда(ВремяПо);
	
	ИсполнительЗамера = Сотрудник;	
	//НазначилЗамер = ПолучитьСотрудникаТекущегоПользователя(); //#6588 закомментировано 
	//ДатаНазначенияЗамера = ТекущаяДата(); //ТекущаяДатаСеанса(); //#6588 закомментировано
	ВремяНачалаЗамера = Дата(1,1,1,Час(ВремяС), Минута(ВремяС), Секунда(ВремяС));
	ВремяОкончанияЗамера = Дата(1,1,1,КонецЧас, КонецМинута, КонецСекунда);
	Если НЕ ПараметрДатаЗамера = Неопределено Тогда
		ДатаЗамера = ПараметрДатаЗамера;	
	КонецЕсли;
	
	//#6588 
	Элементы.Замеры.ТекущиеДанные.ИсполнительЗамера 		= Сотрудник;
	ЭтоНовыйЗамер = Ложь;
	Если Элементы.Замеры.ТекущиеДанные.ЭтоНовый Тогда
		ЭтоНовыйЗамер = Истина;
		Элементы.Замеры.ТекущиеДанные.ЭтоНовый = Ложь;	
	КонецЕсли;
	Если ЭтоНовыйЗамер Тогда		
		Элементы.Замеры.ТекущиеДанные.НазначилЗамер 			= ПолучитьСотрудникаТекущегоПользователя();
		Элементы.Замеры.ТекущиеДанные.НазначилЗамерПользователь = ПолучитьТекущегоПользователя(); // №13942
	КонецЕсли;
	Элементы.Замеры.ТекущиеДанные.ДатаНазначенияЗамера 		= ТекущаяДата();
	Элементы.Замеры.ТекущиеДанные.ВремяНачалаЗамера 		= Дата(1,1,1,Час(ВремяС), Минута(ВремяС), Секунда(ВремяС));
	Элементы.Замеры.ТекущиеДанные.ВремяОкончанияЗамера 		= Дата(1,1,1,КонецЧас, КонецМинута, КонецСекунда);
	
	Если НЕ ПараметрДатаЗамера = Неопределено Тогда
		Элементы.Замеры.ТекущиеДанные.ДатаЗамера = ПараметрДатаЗамера;	
	КонецЕсли;
	
	ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
	
	// №14649
	ЗаполнитьОтветственного(Сотрудник);
	// №16755
	ЗаполнитьЗамерщика(Сотрудник);
	
КонецПроцедуры
	
//++ №14649
&НаКлиенте
Процедура ЗаполнитьОтветственного(Ответственный)
	
	Если ВариантИзмененияОтветственногоВЛиде = ПредопределенноеЗначение("Перечисление.ВариантыИзмененияОтветственногоВЛиде.МенятьНаИсполнителяЗамера") Тогда
		
		Объект.Ответственный = Ответственный;
		
	ИначеЕсли ВариантИзмененияОтветственногоВЛиде = ПредопределенноеЗначение("Перечисление.ВариантыИзмененияОтветственногоВЛиде.ЗапрашиватьПодтверждение")
		И НЕ Ответственный = Объект.Ответственный Тогда
		
		ОписаниеОповещения = новый ОписаниеОповещения("ЗаполнитьОтветственногоЗавершение", ЭтотОбъект, Ответственный);
		ПоказатьВопрос(ОписаниеОповещения, "Заполнить ответственного по исполнителю замера?", РежимДиалогаВопрос.ДаНет,,, "Смена ответственного по исполнителю замера");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтветственногоЗавершение(Ответ, Ответственный) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Ответственный = Ответственный;
	
КонецПроцедуры
//-- №14649

&НаКлиенте
Процедура ЗаполнитьЗамерщика(ИсполнительЗамера)
	
	Если ВариантИзмененияЗамерщикаВЛиде = ПредопределенноеЗначение("Перечисление.ВариантыИзмененияЗамерщикаВЛиде.МенятьНаИсполнителяЗамера") Тогда		
		Объект.Замерщик = ИсполнительЗамера;			
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
&НаКлиенте
Процедура ИзменитьДанныеТекущегоВыезда(Сотрудник, ВремяС, ВремяПо, ПараметрДатаВыезда = Неопределено)
	
	//#12459
	Если Элементы.Выезды.ТекущиеДанные.Выполнен Тогда
		Сообщить("Выезд выполнен: изменение запрещено!");
		Возврат;	
	КонецЕсли;
	
	КонецМинута = Минута(ВремяПо);
	КонецЧас = Час(ВремяПо);
	КонецСекунда = Секунда(ВремяПо);
	
	//ИсполнительВыезда = Сотрудник;		
	ВремяНачалаВыезда = Дата(1,1,1,Час(ВремяС), Минута(ВремяС), Секунда(ВремяС));
	ВремяОкончанияВыезда = Дата(1,1,1,КонецЧас, КонецМинута, КонецСекунда);
	
	//Если НЕ ПараметрДатаВыезда = Неопределено Тогда
	//	ДатаВыезда = ПараметрДатаВыезда;	
	//КонецЕсли;
	
	//НомерСтроки = Объект.Выезды.Количество()-1;
	//Объект.Выезды[НомерСтроки].Исполнитель = Сотрудник; //ИсполнительВыезда;
	//Объект.Выезды[НомерСтроки].ВремяНачала = ВремяНачалаВыезда;
	//Объект.Выезды[НомерСтроки].ВремяОкончания = ВремяОкончанияВыезда;
	//Объект.Выезды[НомерСтроки].Дата = ДатаВыезда;

	Элементы.Выезды.ТекущиеДанные.Исполнитель 			= Сотрудник; //ИсполнительВыезда;
	ЭтоНовыйВыезд = Ложь;
	Если Элементы.Выезды.ТекущиеДанные.ЭтоНовый Тогда
		ЭтоНовыйВыезд = Истина;
		Элементы.Выезды.ТекущиеДанные.ЭтоНовый = Ложь;	
	КонецЕсли;
	Если ЭтоНовыйВыезд Тогда
		Элементы.Выезды.ТекущиеДанные.Назначил 	  			= ПолучитьСотрудникаТекущегоПользователя();
		Элементы.Выезды.ТекущиеДанные.НазначилПользователь 	= ПолучитьТекущегоПользователя(); // №13942
	КонецЕсли;
	Элементы.Выезды.ТекущиеДанные.ВремяНачала 			= ВремяНачалаВыезда;
	Элементы.Выезды.ТекущиеДанные.ВремяОкончания 		= ВремяОкончанияВыезда;
	Элементы.Выезды.ТекущиеДанные.ДатаНазначения		= ТекущаяДата();
	
	Если НЕ ПараметрДатаВыезда = Неопределено Тогда
		Элементы.Выезды.ТекущиеДанные.Дата = ПараметрДатаВыезда;
	КонецЕсли;
	
	ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
	
КонецПроцедуры

&НаСервере
Функция РазрешеноПересечениеПериодов(Сотрудник)
	Возврат Сотрудник.НеПроверятьПересечениеЗамеровВГрафике;
КонецФункции

#Область ГрафикПланировщик

&НаСервере
Процедура ОбновитьГрафикЗамеровПланировщикНаСервере(ДатаНачалаГрафика, ДатаОкончанияГрафика)
	
	//Вариант отображения (горизонтальный / вертикальный)
	Развертка = ?(ВариантОтображенияГрафика = 0 ИЛИ ВариантОтображенияГрафика = 3 ИЛИ ВариантОтображенияГрафика = 5, 0, 1);
	ТекущийДень = ДатаНачалаГрафика;
	СтруктураИзЛида = Новый Структура("НаСтраницеВыезд, НаСтраницеЗамер", ПланированиеВыезда, ПланированиеЗамера);
	
	НачальнаяДатаПланировщика = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(ТекущийДень, ВремяНачалаЗамеров);
	КонечнаяДатаПланировщика  = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(ТекущийДень, ВремяКонцаЗамеров);

	Если ВариантОтображенияГрафика = 0 ИЛИ ВариантОтображенияГрафика = 1 Тогда
		НастройкиГрафика = МодульОтчетов.ИнициализироватьНастройкиПланировщикаГрафикаЗамеров(ГрафикЗамеров, Развертка, НачальнаяДатаПланировщика, КонечнаяДатаПланировщика, Ложь);		
		МодульОтчетов.ЗаполнитьГрафикЗамеровКалендарьПоЗамерщикам(ГрафикЗамеров, НастройкиГрафика, ФильтрТочкаПродаж, ФильтрПодразделение, ТаблицаГрафикЗамеров, СтруктураИзЛида);
		
	ИначеЕсли ВариантОтображенияГрафика = 3 ИЛИ ВариантОтображенияГрафика = 4 
		ИЛИ ВариантОтображенияГрафика = 5 ИЛИ ВариантОтображенияГрафика = 6 Тогда
		
		ВыводитьРеальныхЗамерщиков = (ВариантОтображенияГрафика = 3 ИЛИ ВариантОтображенияГрафика = 4); // распределение
		НастройкиГрафика = МодульОтчетов.ИнициализироватьНастройкиПланировщикаГрафикаЗамеров(ГрафикЗамеров, Развертка, НачальнаяДатаПланировщика, КонечнаяДатаПланировщика, Ложь, ВыводитьРеальныхЗамерщиков);		
		КоличествоЗамерщиковНаДату = МодульОтчетов.ЗаполнитьГрафикЗамеровКалендарьПоПлану(ГрафикЗамеров, НастройкиГрафика, ФильтрТочкаПродаж, ТаблицаГрафикЗамеров, СтруктураИзЛида);
		
		Элементы.ДекорацияПустойПланЗамерщиков.Видимость = (КоличествоЗамерщиковНаДату = 0);
		Элементы.ГрафикЗамеров.Видимость = (НЕ КоличествоЗамерщиковНаДату = 0);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗамеровПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОчиститьСообщения();
	
	// если на графике нет сотрудников, то ничего не делаем
	Если Значения.Получить("Сотрудник") = Неопределено Тогда
		Если ВариантОтображенияГрафика = 3 ИЛИ ВариантОтображенияГрафика = 4 Тогда
			Сообщить("Не запланировано количество замерщиков на дату");	
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	//НачалоРабочегоВремениЗамеров = НачалоРабочегоВремениЗамеров();
	//КонецРабочегоВремениЗамеров = КонецРабочегоВремениЗамеров();
	
	//ДатаЗамераТекущиеДанные = Элементы.Замеры.ТекущиеДанные.ДатаЗамера; //#6588
	ТекущийДень = ТекущаяДатаГрафика; //?(Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница.Имя = "ГруппаЗамер", ДатаЗамераТекущиеДанные, ДатаВыезда); // ТекущаяДатаГрафика
	
	Если Начало < Дата(Год(ТекущийДень), Месяц(ТекущийДень), День(ТекущийДень), Час(ВремяНачалаЗамеров), Минута(ВремяНачалаЗамеров),0) 
		или Конец > Дата(Год(ТекущийДень), Месяц(ТекущийДень), День(ТекущийДень), Час(ВремяКонцаЗамеров), Минута(ВремяКонцаЗамеров) ,0) Тогда
		Возврат;
	КонецЕсли;
	
	ДлинаМинимальногоЗамераВСекундах = ПродолжительностьЗамера * 60 * 60;
	Если Начало + ДлинаМинимальногоЗамераВСекундах > Конец Тогда
		Конец = Начало + ДлинаМинимальногоЗамераВСекундах;
	КонецЕсли;
	//Конец = Конец - 1;
	
	//проверяем пересечения периодов по визуальному графику
	Отказ = Ложь;
	Для Каждого СуществующаяЗапись Из ТаблицаГрафикЗамеров Цикл
		Если НЕ РазрешеноПересечениеПериодов(СуществующаяЗапись.Сотрудник) Тогда		
			Если СуществующаяЗапись.Сотрудник = Значения.Получить("Сотрудник") Тогда
				Если НЕ СуществующаяЗапись.Новый Тогда
					//Если Начало < СуществующаяЗапись.ВремяС и Конец > СуществующаяЗапись.ВремяС Тогда
					//	Отказ = Истина;
					//	Возврат;
					//ИначеЕсли Начало > СуществующаяЗапись.ВремяС и Конец < СуществующаяЗапись.ВремяПо Тогда
					//	Отказ = Истина;
					//	Возврат;
					//ИначеЕсли Начало < СуществующаяЗапись.ВремяПо и Конец > СуществующаяЗапись.ВремяПо Тогда
					//	Отказ = Истина;
					//	Возврат;
					//ИначеЕсли Начало < СуществующаяЗапись.ВремяС и Конец > СуществующаяЗапись.ВремяПо Тогда
					//	Отказ = Истина;
					//	Возврат;
					Если (СуществующаяЗапись.ВремяНачала > Начало ИЛИ СуществующаяЗапись.ВремяОкончания > Начало) 
						И (СуществующаяЗапись.ВремяНачала < Конец ИЛИ СуществующаяЗапись.ВремяОкончания < Конец) Тогда
						Отказ = Истина;							
					ИначеЕсли Начало = СуществующаяЗапись.ВремяНачала и Конец = СуществующаяЗапись.ВремяОкончания Тогда
						Отказ = Истина;						
					КонецЕсли;		
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//проверяем пересечения периодов по регистру
	Если НЕ Отказ Тогда //И ИспользуетсяПулЗамеров Тогда
		ПараметрыНовогоЗамера = Новый Структура;
		ПараметрыНовогоЗамера.Вставить("ДатаЗамера", 			НачалоДня(Начало));
		ПараметрыНовогоЗамера.Вставить("ВремяНачалаЗамера", 	Дата("00010101") + (Начало - НачалоДня(Начало)));
		ПараметрыНовогоЗамера.Вставить("ВремяОкончанияЗамера",  Дата("00010101") + (Конец - НачалоДня(Конец)));
		ПараметрыНовогоЗамера.Вставить("ИсполнительЗамера", 	Значения.Получить("Сотрудник"));
		Если НЕ ПроверитьСвободныйИнтервалЗамеров(ПараметрыНовогоЗамера, Объект.Ссылка) Тогда
			Отказ = Истина;
			
			// #9710 пересечение есть, но на визуальном графике этого еще не видно,
			// поэтому перестроим график
			ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
			ОбновитьГрафикЗамеров();
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		//ПоказатьПредупреждение(,"Время замера не должно пересекаться с другими заплнированными замерами");
		Сообщить("Выбранный интервал занят");
		Возврат;
	Иначе
		Если ПланированиеВыезда Тогда //Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаВыезд Тогда
			ИзменитьДанныеТекущегоВыезда(Значения.Получить("Сотрудник"), Начало, Конец);
		ИначеЕсли ПланированиеЗамера Тогда // Замер	
			ИзменитьДанныеТекущегоЗамера(Значения.Получить("Сотрудник"), Начало, Конец);
		КонецЕсли;	
		ОбновитьГрафикЗамеров();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗамеровПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	
	ОчиститьСообщения();
	Если Элемент.ВыделенныеЭлементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИдТекущегоЗамераВыезда = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Если ПланированиеЗамера Тогда
		ИдТекущегоЗамераВыезда = Элементы.Замеры.ТекущиеДанные.ИДЗамера;
	ИначеЕсли ПланированиеВыезда Тогда
		ИдТекущегоЗамераВыезда = Элементы.Выезды.ТекущиеДанные.ИДЗамера;
	КонецЕсли;	

	ЭлементЗамера = Элемент.ВыделенныеЭлементы[0];
	
	// разрешаем перенос только редактируемого замера/выезда
	Если НЕ ИдТекущегоЗамераВыезда = ЭлементЗамера.Значение.ИдЗамера Тогда
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДатаЗамера", 				НачалоДня(ЭлементЗамера.Начало));
	ДополнительныеПараметры.Вставить("ВремяНачалаЗамера", 		Дата('00010101') + (ЭлементЗамера.Начало - НачалоДня(ЭлементЗамера.Начало)));
	ДополнительныеПараметры.Вставить("ВремяОкончанияЗамера",  	Дата('00010101') + (ЭлементЗамера.Конец  - НачалоДня(ЭлементЗамера.Начало)));
	ДополнительныеПараметры.Вставить("ИДЗамера",				ЭлементЗамера.Значение.ИДЗамера);
	ДополнительныеПараметры.Вставить("ЭтоВыезд", 				ЭлементЗамера.Значение.ЭтоВыезд);	
	ДополнительныеПараметры.Вставить("ИсполнительЗамера", 		ЭлементЗамера.ЗначенияИзмерений["Сотрудник"]);	
	
	//Если ВариантОтображенияГрафика = 0 ИЛИ ВариантОтображенияГрафика = 1 Тогда
	Если НЕ ПроверитьСвободныйИнтервалЗамеров(ДополнительныеПараметры, Объект.Ссылка) Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранный интервал занят", , , , ОтменаРедактирования);
		//#9710 обновляем график
		ОбновитьГрафикЗамеров();
		Возврат;
	КонецЕсли;
	//КонецЕсли;
			
	//ОтменаРедактирования = НЕ РезультатПланировщикПриОкончанииРедактированияНаСервере(ИдТекущегоЗамераВыезда);
	
	Если ПланированиеВыезда Тогда
		ИзменитьДанныеТекущегоВыезда(ДополнительныеПараметры.ИсполнительЗамера, ЭлементЗамера.Начало, ЭлементЗамера.Конец, ДополнительныеПараметры.ДатаЗамера);
	ИначеЕсли ПланированиеЗамера Тогда	
		ИзменитьДанныеТекущегоЗамера(ДополнительныеПараметры.ИсполнительЗамера, ЭлементЗамера.Начало, ЭлементЗамера.Конец, ДополнительныеПараметры.ДатаЗамера);
	КонецЕсли;
	
	Модифицированность = Истина;
	
	//#9710 обновляем график всегда
	//Если ВариантОтображенияГрафика = 3 ИЛИ ВариантОтображенияГрафика = 4 Тогда
		ОбновитьГрафикЗамеров();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗамеровПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	Если НЕ НовыйЭлемент Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗамеровПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗамеровПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	// например при прокрутке ролика мыши
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗамеровПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область ГрафикТаблица

&НаСервере
Процедура ОбновитьГрафикЗамеровТаблицаНаСервере(ДатаНачалаГрафика, ДатаОкончанияГрафика)
	
	//НаСтраницеВыезд = (Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаВыезд);
	//НаСтраницеЗамер = (Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаЗамерВыезд);
	
	//Если ПредыдущаяДатаЗамера = Дата(1,1,1) 
	//	//#6706 для перестроения графика при измении даты замера
	//	ИЛИ ДатаНачалаГрафика > ПредыдущаяДатаЗамера 
	//	Тогда
	//	//ДатаНачалаГрафика = ДатаЗамера;
	//Иначе
	//	ДатаНачалаГрафика = ПредыдущаяДатаЗамера;
	//КонецЕсли;
	//
	//Если НаСтраницеВыезд Тогда
	//	Если ПредыдущаяДатаВыезда = Дата(1,1,1) ИЛИ ДатаВыезда > ПредыдущаяДатаВыезда Тогда
	//		ДатаНачалаГрафика = ДатаВыезда;
	//	Иначе
	//		ДатаНачалаГрафика = ПредыдущаяДатаВыезда;
	//	КонецЕсли;
	//КонецЕсли;
	//ДатаОкончанияГрафика = ДатаНачалаГрафика + ИнтервалГрафикаТаблица;
	
	ЗаданнаяТаблицаГрафикЗамеров = ТаблицаГрафикЗамеров.Выгрузить();
	Колво = ЗаданнаяТаблицаГрафикЗамеров.Количество();
	Для Инд = 1 по ЗаданнаяТаблицаГрафикЗамеров.Количество() Цикл
		ЭлементЗамера = ЗаданнаяТаблицаГрафикЗамеров[Колво-Инд];
		Если ЭлементЗамера.Дата = Дата(1,1,1) Тогда
			 ЗаданнаяТаблицаГрафикЗамеров.Удалить(ЭлементЗамера);
			 Продолжить;
		 КонецЕсли;
		//ЭлементЗамера.ВремяНачала    = Дата("00010101") + (ЭлементЗамера.ВремяНачала - НачалоДня(ЭлементЗамера.ВремяНачала));
		//ЭлементЗамера.ВремяОкончания = Дата("00010101") + (ЭлементЗамера.ВремяОкончания - НачалоДня(ЭлементЗамера.ВремяОкончания));			
	КонецЦикла;
	
	СтруктураИзЛида = Новый Структура("НаСтраницеВыезд, НаСтраницеЗамер", ПланированиеВыезда, ПланированиеЗамера);
			
	ГрафикТаблица = МодульОтчетов.СформироватьГрафикЗамеровТаблица(ДатаНачалаГрафика, ДатаОкончанияГрафика, ФильтрТочкаПродаж, ФильтрПодразделение, ЗаданнаяТаблицаГрафикЗамеров, СтруктураИзЛида);
		
КонецПроцедуры

&НаКлиенте
Процедура ГрафикТаблицаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	//++ не срабатывает в режиме Редактирования, включенного для возможности перетаскивания
	//перенесено в событие Выбор
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Если Расшифровка.Свойство("МассивДокументов") Тогда
	
		Иначе
			ДопПараметры = Новый Структура("Расшифровка", Расшифровка);
			Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбИзмененииЗамера", ЭтаФорма, ДопПараметры);
			ТекстСообщения = ?(ПланированиеВыезда, "Изменить данные выезда?", "Изменить данные замера?");
			ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 0);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГрафикТаблицаВыбор(Элемент, Область, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТолькоПросмотр Тогда
		Возврат;	
	КонецЕсли;
	
	Расшифровка = Область.Расшифровка;
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Если Расшифровка.Свойство("МассивДокументов") Тогда
	
		Иначе
			ДопПараметры = Новый Структура("Расшифровка", Расшифровка);
			Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбИзмененииЗамера", ЭтаФорма, ДопПараметры);
			ТекстСообщения = ?(ПланированиеВыезда, "Изменить данные выезда?", "Изменить данные замера?");
			ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 0);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикТаблицаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Выполнение = Ложь;
КонецПроцедуры 

&НаКлиенте
Процедура ГрафикТаблицаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)	
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ВкладкаПредварительныйРасчет

&НаКлиенте
Процедура ПредварительныйРасчет(Команда)
	
	//++ №14357 комментируем, т.к. формируем не по основному, а по выделенному в списке
	////++ №10184 формируем отчет до документу "Предварительный расчет"
	//Если Объект.ОсновнойПредварительныйРасчет.Пустая() Тогда
	//	
	//	Сообщить("Необходимо выбрать основной предварительный расчет.");
	//	Возврат;
	//	
	//КонецЕсли;
	////-- №10184
	//-- №14357 комментируем
	
	//++ №14357 по текущему выделенному
	ТекущиеДанные = Элементы.ПредварительныеРасчеты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//-- №14357
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ЗаказДоговор", ТекущиеДанные.Ссылка); // №14357 было: Объект.ОсновнойПредварительныйРасчет); // №10184, ранее было: Объект.Ссылка);
	
	ОткрытьФорму("Отчет.ПредварительнаяСебестоимостьЗаказДоговора.ФормаОбъекта", ПараметрыОтчета);
	
КонецПроцедуры

//++ №10184
&НаКлиенте
Процедура СделатьОсновнымПредварительнымРасчетом(Команда)
	
	ТекущиеДанные = Элементы.ПредварительныеРасчеты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//++ №14089 если был основным, убираем из основного
	Если Объект.ОсновнойПредварительныйРасчет = ТекущиеДанные.Ссылка Тогда
		Объект.ОсновнойПредварительныйРасчет = ПредопределенноеЗначение("Документ.ПредварительныйРасчетЗаказДоговора.ПустаяСсылка");
	//-- №14089
	Иначе
		Объект.ОсновнойПредварительныйРасчет = ТекущиеДанные.Ссылка;
		ДобавитьВИсториюНаФормеЗаписьОбИзмененииОсновногоРасчета()
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из ПредварительныеРасчеты Цикл
		
		ТекущаяСтрока.Основной = Ложь;
		
		Если ТекущаяСтрока.Ссылка = Объект.ОсновнойПредварительныйРасчет Тогда
			ТекущаяСтрока.Основной = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВИсториюНаФормеЗаписьОбИзмененииОсновногоРасчета()
	СтрокаЗаписи = ИсторияЛидаНаФорме.Добавить();		
	СтрокаЗаписи.Дата = ТекущаяДатаСеанса();
	СтрокаЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	СтрокаЗаписи.Комментарий = "Предварительный расчет №" + Объект.ОсновнойПредварительныйРасчет.Номер + " от " + Объект.ОсновнойПредварительныйРасчет.Дата + " установлен как основной";		
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПредварительныхРасчетов()
	
	ПредварительныеРасчеты.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст =
	//++ №14089 комментируем
	////++ #14052 на случай если ПР отвязан от основного предварительного расчета
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ПредварительныйРасчет.Дата КАК Дата,
	//|	ПредварительныйРасчет.Ссылка КАК Ссылка,
	//|	ПредварительныйРасчет.СуммаДокумента КАК Сумма,
	//|	ПредварительныйРасчет.Валюта КАК Валюта,
	//|	ВЫРАЗИТЬ(ПредварительныйРасчет.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	//|	ВЫБОР
	//|		КОГДА ПредварительныйРасчет.Основание = &Лид
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ЕстьОшибкаПоОснованиюПР
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	Документ.ПредварительныйРасчетЗаказДоговора КАК ПредварительныйРасчет
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДокументЛид
	//|		ПО (ДокументЛид.ОсновнойПредварительныйРасчет = ПредварительныйРасчет.Ссылка)
	//|			И (ДокументЛид.Ссылка = &Лид)
	//|
	//|ОБЪЕДИНИТЬ
	////-- #14052
	//-- №14089 комментируем
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПредварительныйРасчет.Дата КАК Дата,
	|	ПредварительныйРасчет.Ссылка КАК Ссылка,
	|	ПредварительныйРасчет.СуммаДокумента КАК Сумма,
	|	ПредварительныйРасчет.Валюта КАК Валюта,
	|	ВЫРАЗИТЬ(ПредварительныйРасчет.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	ЛОЖЬ КАК ЕстьОшибкаПоОснованиюПР
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ПредварительныйРасчетЗаказДоговора КАК ПредварительныйРасчет
	|ГДЕ
	|	ПредварительныйРасчет.Основание = &Лид
	|	И НЕ &Лид = ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Дата КАК Дата,
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Сумма КАК Сумма,
	|	ВТ.Валюта КАК Валюта,
	|	ВТ.Комментарий КАК Комментарий,
	|	ВТ.ЕстьОшибкаПоОснованиюПР КАК ЕстьОшибкаПоОснованиюПР
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.Дата";
	
	Запрос.УстановитьПараметр("Лид", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ПредварительныеРасчеты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если Объект.ОсновнойПредварительныйРасчет = Выборка.Ссылка Тогда
			НоваяСтрока.Основной = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	// данные заголовка
	Если ПредварительныеРасчеты.Количество() > 0 Тогда
		ПредварительныеРасчеты[0].КоличествоСтрок = ПредварительныеРасчеты.Количество();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныеРасчетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПредварительныеРасчеты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПредварительныйРасчетЗаказДоговора.ФормаОбъекта", новый Структура("Ключ", ТекущиеДанные.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНазначитьНовыйПредварительныйРасчетОсновным()
	
	ОбновитьСписокПредварительныхРасчетов();
	
	Если ПредварительныеРасчеты.Количество() = 1 И Объект.ОсновнойПредварительныйРасчет.Пустая() Тогда
		
		Объект.ОсновнойПредварительныйРасчет = ПредварительныеРасчеты[0].Ссылка;
		ПредварительныеРасчеты[0].Основной = Истина;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
//-- №10184

&НаКлиенте
Процедура ДобавитьПредварительныйРасчет(Команда)
	
	//#14050	
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьПредварительныйРасчетФрагмент", ЭтотОбъект);
		ТекстВопроса = "Для продолжения документ следует записать. 
						|Записать документ?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
		
	ДобавитьПредварительныйРасчетЗавершение(Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПредварительныйРасчетФрагмент(Результат, ДопПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;	
	КонецЕсли;
	
	ДействиеПослеЗаписи = Новый ОписаниеОповещения("ДобавитьПредварительныйРасчетЗавершение", ЭтотОбъект);
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	
	ОчиститьСообщения();
	Результат = Записать(ПараметрыЗаписи);
	
	Если Результат Тогда
		ВыполнитьОбработкуОповещения(ДействиеПослеЗаписи, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПредварительныйРасчетЗавершение(Результат, ДопПараметры) Экспорт
	
	ПараметрыНовогоДокумента = Новый Структура;
	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Документ.ПредварительныйРасчетЗаказДоговора.ФормаОбъекта", ПараметрыНовогоДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьПредварительныйРасчет(Команда)
	
	ТекущиеДанные = Элементы.ПредварительныеРасчеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ДокументДляКопирования = ТекущиеДанные.Ссылка;
    ПараметрыФормы = Новый Структура("ЗначениеКопирования", ДокументДляКопирования);
    ОткрытьФорму("Документ.ПредварительныйРасчетЗаказДоговора.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ВкладкаИсторияОбращений

&НаСервере
Процедура ПолучитьИсториюОбращенияКлиента()
	
	//ИсторияОбращений.Очистить();
	ИсторияОбращенияОтчет.Очистить();
	Элементы.ГруппаИстория.Заголовок = "История обращений";
	
	МассивТелефонов    = УправлениеКонтактнойИнформациейПотолки.ПолучитьТелефонИзКонтактнойИнформацииФормы(ЭтотОбъект, Ложь);	
	МассивАдресовПочты = УправлениеКонтактнойИнформациейПотолки.ПолучитьАдресПочтыИзКонтактнойИнформацииФормы(ЭтотОбъект, Ложь);
	
	Если МассивТелефонов.Количество() = 0 
		И МассивАдресовПочты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТелефоныКлиента",  			МассивТелефонов);		
	Запрос.УстановитьПараметр("ЭлектронныеАдресаКлиента",	МассивАдресовПочты);
	Запрос.УстановитьПараметр("ПоискПоТелефону",    		ПравилоПоискаИсторииОбращений.ПоТелефону);		
	Запрос.УстановитьПараметр("ПоискПоПочте", 				ПравилоПоискаИсторииОбращений.ПоАдресуЭлектроннойПочты);
		
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказДоговор.Ссылка КАК ОснованиеСсылка,
	|	ЗаказДоговор.Дата КАК ОснованиеДата,
	|	ЗаказДоговор.ТекущийСтатус КАК ОснованиеСтатус,
	|	ЗаказДоговор.Основание КАК ЛидСсылка
	|ПОМЕСТИТЬ ВТ_ЗаказыМонтажиПоЛидам
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	ЗаказДоговор.Основание ССЫЛКА Документ.Лид
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Монтаж.Ссылка,
	|	Монтаж.Дата,
	|	Монтаж.Результат,
	|	Монтаж.Основание
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Основание ССЫЛКА Документ.Лид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Ссылка КАК МонтажСсылка,
	|	Монтаж.Результат КАК МонтажРезультат,
	|	Монтаж.Основание КАК ЗаказСсылка
	|ПОМЕСТИТЬ ВТ_МонтажиПоЗаказам
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Основание ССЫЛКА Документ.ЗаказДоговор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лид.Ссылка КАК Ссылка,
	|	Лид.Дата КАК Дата,
	|	Лид.ПометкаУдаления КАК ПометкаУдаления,
	|	Лид.Проведен КАК Проведен,
	|	ВЫРАЗИТЬ(Лид.ИмяКлиента КАК СТРОКА(500)) КАК ИмяКлиента,
	|	Лид.ТекущийСтатус КАК ТекущийСтатус,
	|	Лид.Телефоны КАК Телефоны,
	|	Лид.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты,
	|	ВЫБОР КОГДА Лид.Ссылка = &Ссылка ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Текущий
	|ПОМЕСТИТЬ ВТ_Лиды
	|ИЗ
	|	Документ.Лид КАК Лид
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид.ДополнительнаяКонтактнаяИнформация КАК ЛидКИ
	|	ПО ЛидКИ.Ссылка = Лид.Ссылка
	|ГДЕ
	|	(ВЫБОР
	|				КОГДА &ПоискПоТелефону
	|					ТОГДА ЛидКИ.Представление В (&ТелефоныКлиента)
	|						И ЛидКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА &ПоискПоПочте
	|					ТОГДА ЛидКИ.Представление В (&ЭлектронныеАдресаКлиента)
	|						И ЛидКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лид.Ссылка КАК Ссылка,
	|	Лид.Дата КАК Дата,
	|	Лид.ПометкаУдаления КАК ПометкаУдаления,
	|	Лид.Проведен КАК Проведен,
	|	Лид.ИмяКлиента КАК ИмяКлиента,
	|	Лид.Телефоны КАК Телефоны,
	|	Лид.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты,
	|	Лид.ТекущийСтатус КАК ТекущийСтатус,
	|	Лид.Текущий КАК Текущий,
	|	ЕСТЬNULL(ВТ_ЗаказыМонтажиПоЛидам.ОснованиеСсылка, НЕОПРЕДЕЛЕНО) КАК Основание,
	|	ЕСТЬNULL(ВТ_ЗаказыМонтажиПоЛидам.ОснованиеСтатус, НЕОПРЕДЕЛЕНО) КАК ОснованиеСтатус,
	|	ЕСТЬNULL(ВТ_МонтажиПоЗаказам.МонтажСсылка, НЕОПРЕДЕЛЕНО) КАК МонтажПоЗаказу,
	|	ЕСТЬNULL(ВТ_МонтажиПоЗаказам.МонтажРезультат, НЕОПРЕДЕЛЕНО) КАК РезультатМонтажаПоЗаказу
	|ИЗ
	|	ВТ_Лиды КАК Лид
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыМонтажиПоЛидам КАК ВТ_ЗаказыМонтажиПоЛидам
	|		ПО Лид.Ссылка = ВТ_ЗаказыМонтажиПоЛидам.ЛидСсылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МонтажиПоЗаказам КАК ВТ_МонтажиПоЗаказам
	|		ПО (ВТ_ЗаказыМонтажиПоЛидам.ОснованиеСсылка = ВТ_МонтажиПоЗаказам.ЗаказСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Дата
	|ИТОГИ
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(ПометкаУдаления),
	|	МАКСИМУМ(Проведен),
	|	МАКСИМУМ(ИмяКлиента),
	|	МАКСИМУМ(Телефоны),
	|	МАКСИМУМ(АдресаЭлектроннойПочты),
	|	МАКСИМУМ(ТекущийСтатус),
	|	МАКСИМУМ(Текущий),
	|	МАКСИМУМ(ОснованиеСтатус)
	|ПО
	|	Ссылка,
	|	Основание
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияЛида.Лид КАК Лид,
	|	ИсторияЛида.Дата КАК Дата,
	|	ИсторияЛида.Пользователь КАК Пользователь,
	|	ИсторияЛида.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ИсторияЛида КАК ИсторияЛида
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Лиды КАК ВТ_Лиды
	|		ПО (ВТ_Лиды.Ссылка = ИсторияЛида.Лид)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Макет = Документы.Лид.ПолучитьМакет("ИсторияОбращения");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок|Данные");
	ОбластьДругойЛид = Макет.ПолучитьОбласть("СтрокаЛида|Данные");	
	ОбластьТекущийЛид = Макет.ПолучитьОбласть("СтрокаТекущегоЛида|Данные");
	ОбластьИсторияЛида = Макет.ПолучитьОбласть("СтрокаИсторииЛида|Данные");
	ОбластьИсторияТекущегоЛида = Макет.ПолучитьОбласть("СтрокаИсторииТекущегоЛида|Данные");
	ОбластьПустаяЯчейка = Макет.ПолучитьОбласть("ПустаяЯчейка");
	ОбластьДокументЗаписан = Макет.ПолучитьОбласть("ДокументЗаписан");
	ОбластьДокументПомеченНаУдаление = Макет.ПолучитьОбласть("ДокументПомеченНаУдаление");
	ОбластьДокументПроведен = Макет.ПолучитьОбласть("ДокументПроведен");
	//ОбластьУровень2 = Макет.ПолучитьОбласть("Уровень2");
	ОбластьПустая = Макет.ПолучитьОбласть("ПустаяСтрока|Данные");
	ОбластьОснования = Макет.ПолучитьОбласть("СтрокаОснования|Данные");
	ОбластьОснования2 = Макет.ПолучитьОбласть("СтрокаОснования2|Данные");
	
	ВыборкаЛидов = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТЗ_ИсторияЛидов = РезультатЗапроса[4].Выгрузить();
	КоличествоОбращений = 0;
	
	ИсторияОбращенияОтчет.Вывести(ОбластьПустаяЯчейка);
	ИсторияОбращенияОтчет.Присоединить(ОбластьЗаголовок);

	Пока ВыборкаЛидов.Следующий() Цикл		
		КоличествоОбращений = КоличествоОбращений + 1;
		
		ОбластьСтатус = ?(ВыборкаЛидов.ПометкаУдаления, ОбластьДокументПомеченНаУдаление, ?(ВыборкаЛидов.Проведен, ОбластьДокументПроведен, ОбластьДокументЗаписан));
		ИсторияОбращенияОтчет.Вывести(ОбластьСтатус);
		
		ОбластьЛид = ?(ВыборкаЛидов.Текущий, ОбластьТекущийЛид, ОбластьДругойЛид);
		ОбластьИстория = ?(ВыборкаЛидов.Текущий, ОбластьИсторияТекущегоЛида, ОбластьИсторияЛида);
		
		ОбластьЛид.Параметры.Дата 			= ВыборкаЛидов.Дата;
		ПредставлениеЛида = ?(ПустаяСтрока(ВыборкаЛидов.ИмяКлиента), "", ВыборкаЛидов.ИмяКлиента); 
		ПредставлениеЛида = ПредставлениеЛида + ?(ПустаяСтрока(ВыборкаЛидов.Телефоны), "", ?(ПустаяСтрока(ПредставлениеЛида), ВыборкаЛидов.Телефоны, ", " + ВыборкаЛидов.Телефоны));
		ПредставлениеЛида = ПредставлениеЛида + ?(ПустаяСтрока(ВыборкаЛидов.АдресаЭлектроннойПочты), "", ?(ПустаяСтрока(ПредставлениеЛида), ВыборкаЛидов.АдресаЭлектроннойПочты, ", " + ВыборкаЛидов.АдресаЭлектроннойПочты));
		ПредставлениеЛида = ПредставлениеЛида + ?(ПустаяСтрока(ПредставлениеЛида), ВыборкаЛидов.ТекущийСтатус, ", " + ВыборкаЛидов.ТекущийСтатус);
		Если НЕ ПустаяСтрока(ПредставлениеЛида) Тогда
			ПредставлениеЛида = " (" + ПредставлениеЛида + ")";	
		КонецЕсли;
		ОбластьЛид.Параметры.Представление 	= Строка(ВыборкаЛидов.Ссылка) + ПредставлениеЛида;
		ОбластьЛид.Параметры.Документ 		= ВыборкаЛидов.Ссылка;
		ИсторияОбращенияОтчет.Присоединить(ОбластьЛид);
		
		НайденнаяИстория = ТЗ_ИсторияЛидов.НайтиСтроки(Новый Структура("Лид", ВыборкаЛидов.Ссылка));
		Для каждого СтрокаТЗ из НайденнаяИстория Цикл
			ИсторияОбращенияОтчет.Вывести(ОбластьПустаяЯчейка);
			ОбластьИстория.Параметры.Заполнить(СтрокаТЗ);
			ИсторияОбращенияОтчет.Присоединить(ОбластьИстория);
		КонецЦикла;
		
		ВыборкаОснований = ВыборкаЛидов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаОснований.Следующий() Цикл
			Если ВыборкаОснований.Основание = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// заказы/монтажи в прямом подчинении
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаОснований.Основание, "Дата, ПометкаУдаления, Проведен");
			ОбластьСтатус = ?(РеквизитыОснования.ПометкаУдаления, ОбластьДокументПомеченНаУдаление, ?(РеквизитыОснования.Проведен, ОбластьДокументПроведен, ОбластьДокументЗаписан));
			ИсторияОбращенияОтчет.Вывести(ОбластьСтатус);
			
			ОбластьОснования.Параметры.Дата 			= РеквизитыОснования.Дата;
			
			ПредставлениеОснования = "";
			Если ТипЗнч(ВыборкаОснований.Основание) = Тип("ДокументСсылка.Монтаж") Тогда
				МонтажСсылка = ВыборкаОснований.Основание;
				Если МонтажСсылка.СрокМонтажа = Перечисления.СрокиМонтажа.МонтажНаНесколькоДней Тогда
					
					Если МонтажСсылка.ГрафикМонтажей.Количество() > 0 Тогда
						ПредставлениеОснования = " Дата начала монтажа: " + Формат(МонтажСсылка.ГрафикМонтажей[0].ДатаМонтажа, "ДФ='dd.MM.yyyy ''г.'''");	
					КонецЕсли;
				Иначе
					Если ЗначениеЗаполнено(МонтажСсылка.ДатаМонтажа) Тогда					
						ПредставлениеОснования = " Дата начала монтажа: " + Формат(МонтажСсылка.ДатаМонтажа, "ДФ='dd.MM.yyyy ''г.'''");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ПредставлениеОснования = ПредставлениеОснования + " (" + Строка(ВыборкаОснований.ОснованиеСтатус) + ")";	
			
			ОбластьОснования.Параметры.Представление 	= Строка(ВыборкаОснований.Основание) + ПредставлениеОснования;
			ОбластьОснования.Параметры.Основание 		= ВыборкаОснований.Основание;
			ИсторияОбращенияОтчет.Присоединить(ОбластьОснования);			
			
			ВыборкаМонтажейПоЗаказам = ВыборкаОснований.Выбрать(); 
			Пока ВыборкаМонтажейПоЗаказам.Следующий() Цикл
				Если ВыборкаМонтажейПоЗаказам.МонтажПоЗаказу = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				// монтажи по заказам (заказы в прямом подчинении)
				РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаМонтажейПоЗаказам.МонтажПоЗаказу, "Дата, ПометкаУдаления, Проведен, ДатаМонтажа, СрокМонтажа");
				ОбластьСтатус = ?(РеквизитыОснования.ПометкаУдаления, ОбластьДокументПомеченНаУдаление, ?(РеквизитыОснования.Проведен, ОбластьДокументПроведен, ОбластьДокументЗаписан));
				ИсторияОбращенияОтчет.Вывести(ОбластьСтатус);
				
				ОбластьОснования2.Параметры.Дата 			= РеквизитыОснования.Дата;
				ПредставлениеОснования = "";
				Если РеквизитыОснования.СрокМонтажа = Перечисления.СрокиМонтажа.МонтажНаНесколькоДней Тогда
					МонтажСсылка = ВыборкаМонтажейПоЗаказам.МонтажПоЗаказу;
					Если МонтажСсылка.ГрафикМонтажей.Количество() > 0 Тогда
						ПредставлениеОснования = " Дата начала монтажа: " + Формат(МонтажСсылка.ГрафикМонтажей[0].ДатаМонтажа, "ДФ='dd.MM.yyyy ''г.'''");	
					КонецЕсли;
				Иначе
					Если ЗначениеЗаполнено(РеквизитыОснования.ДатаМонтажа) Тогда					
						ПредставлениеОснования = " Дата начала монтажа: " + Формат(РеквизитыОснования.ДатаМонтажа, "ДФ='dd.MM.yyyy ''г.'''");
					КонецЕсли;
				КонецЕсли;
				ПредставлениеОснования = ПредставлениеОснования + " (" + Строка(ВыборкаМонтажейПоЗаказам.РезультатМонтажаПоЗаказу) + ")";	
				
				ОбластьОснования2.Параметры.Представление 	= Строка(ВыборкаМонтажейПоЗаказам.МонтажПоЗаказу) + ПредставлениеОснования;
				ОбластьОснования2.Параметры.Основание 		= ВыборкаМонтажейПоЗаказам.МонтажПоЗаказу;
				ИсторияОбращенияОтчет.Присоединить(ОбластьОснования2);				
			КонецЦикла;
			
		КонецЦикла;
		
		// разрыв
		ИсторияОбращенияОтчет.Вывести(ОбластьПустаяЯчейка);
		ИсторияОбращенияОтчет.Присоединить(ОбластьПустая);
		
	КонецЦикла;
	
	//ИсторияОбращений.Загрузить(Результат.Выгрузить());
	Элементы.ГруппаИстория.Заголовок = "История обращений" + ?(КоличествоОбращений > 0, " (" + Строка(КоличествоОбращений) + ")", "") ;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОбращенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ИсторияОбращений.ТекущиеДанные;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);
	
	Если Поле.Имя = "ИсторияОбращенийДоговор" И ЗначениеЗаполнено(ТекущиеДанные.Договор) Тогда
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Договор);
		ОткрытьФорму("Документ.ЗаказДоговор.ФормаОбъекта", ПараметрыФормы);
	ИначеЕсли Поле.Имя = "ИсторияОбращенийМонтаж" И ЗначениеЗаполнено(ТекущиеДанные.Монтаж) Тогда
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Монтаж);
		ОткрытьФорму("Документ.Монтаж.ФормаОбъекта", ПараметрыФормы);
	Иначе
		ОткрытьФорму("Документ.Лид.Форма.ФормаДокумента", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВкладкаЖурналЗвонков

&НаКлиенте
Процедура ПрослушатьЗаписьЗвонка(Команда)
	
	ТекДанные=Элементы.ИсторияЗвонковАТС.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	//СофтФонКлиент.ПрослушатьЗаписьЗвонка(ТекДанные.ИДВАТС, ТекДанные.ИД, ТекДанные.ЕстьЗапись, ТекДанные.ФайлЗаписиСсылка);
	СофтФонКлиент.ОткрытьЗаписьЗвонкаПоСсылке(ТекДанные.ИДВАТС, ТекДанные.ИД, ТекДанные.ЕстьЗапись, ТекДанные.ФайлЗаписиСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СкачатьЗаписьЗвонка(Команда)
	
	ТекДанные=Элементы.ИсторияЗвонковАТС.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СофтФонКлиент.СкачатьЗаписьЗвонка(ТекДанные.ИДВАТС, ТекДанные.ИД, ТекДанные.ЕстьЗапись, ТекДанные.ФайлЗаписиСсылка);

КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗвонковАТСПередУдалением(Элемент, Отказ)
	
	Если НЕ ДоступнаРольАдминистратора() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВкладкаЗадачи

&НаСервере
Процедура ПолучитьЗадачиЛида()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Задачи.Ссылка,
		|	Задачи.Дата,
		|	Задачи.Исполнитель,
		|	Задачи.Наименование КАК Заголовок,
		|	Задачи.СрокИсполнения,
		|	Задачи.ДатаИсполнения
		|ИЗ
		|	Задача.Задачи КАК Задачи
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Задачи.ПредметЗадачи) = ТИП(Документ.Лид)
		|	И Задачи.ПредметЗадачи = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Задачи.Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);			
	Результат = Запрос.Выполнить();
	
	ЗадачиЛида.Очистить();
	ЗадачиЛида.Загрузить(Результат.Выгрузить());
	Элементы.ГруппаЗадачи.Заголовок = "Задачи" + ?(ЗадачиЛида.Количество() > 0, " (" + Строка(ЗадачиЛида.Количество()) + ")", "") ;
	
	// невыполненные задачи
	Если ЗадачиЛида.Количество() > 0 Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Задачи.Ссылка
		|ИЗ
		|	Задача.Задачи КАК Задачи
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Задачи.ПредметЗадачи) = ТИП(Документ.Лид)
		|	И Задачи.ПредметЗадачи = &Ссылка
		|	И Задачи.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)";	
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);			
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Элементы.ГруппаЗадачи.Заголовок = Элементы.ГруппаЗадачи.Заголовок + " *";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиЛидаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ЗадачиЛида.ТекущиеДанные;
	ПараметрыНов = Новый Структура("Ключ", ТекДанные.Ссылка);
	ОткрытьФорму("Задача.Задачи.ФормаОбъекта", ПараметрыНов);
КонецПроцедуры

#КонецОбласти

#Область ВкладкаФайлы

&НаСервере
Процедура ОбновитьСписокФайлов()
	
	ФайлыДерево.ПолучитьЭлементы().Очистить();
	
	СписокСсылок = Новый СписокЗначений;	
	ДополнитьСписокСсылокНаФайлы(СписокСсылок, Истина);
	
	ОбщийМодульСервер.ОбновитьСписокФайлов(ЭтотОбъект, СписокСсылок);	
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьСписокСсылокНаФайлы(СписокСсылок, СписокДляПросмотра = Ложь)
	// если СписокДляПросмотра, то получаем список ссылок для формирования списка файлов
	// иначе                       получаем список ссылок для добавления файлов (добавление только к текущему документу)
	
	//Текущий документ
	СписокСсылок.Добавить(Объект.Ссылка, "Текущий документ");
	
	Если СписокДляПросмотра Тогда
		//Добавление Заказ-договора и Монтажей	
		//Найдем ЗД
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказДоговоры.Ссылка
		|ИЗ
		|	Документ.ЗаказДоговор КАК ЗаказДоговоры
		|ГДЕ
		|   ЗаказДоговоры.Основание = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Добавим ЗД
			СписокСсылок.Добавить(Выборка.Ссылка);
			
			//И найдем по нему монтажи
			//Добавляем Монтажи
			Запрос = новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Монтажи.Ссылка
			|ИЗ
			|	Документ.Монтаж КАК Монтажи
			|ГДЕ
			|   Монтажи.Основание = &ДокументОснование";
			Запрос.УстановитьПараметр("ДокументОснование", Выборка.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				СписокСсылок.Добавить(Выборка.Ссылка);
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ФайлыДерево.ТекущиеДанные;
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайла = ОбщийМодульВызовСервера.ПолучитьДанныеФайла(ТекущиеДанные.Документ, ТекущиеДанные.ИмяФайла, ТекущиеДанные.Номенклатура, ЭтотОбъект.УникальныйИдентификатор);
	
	Если НЕ АдресФайла = Неопределено Тогда // №7253
		ВременноеИмя = ПолучитьИмяВременногоФайла(ТекущиеДанные.Расширение);
	    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДеревоПриАктивизацииСтроки(Элемент)
	
	Если НЕ ВключитьПредпросмотрФайлов ИЛИ Элементы.ФайлыДерево.ТекущиеДанные = Неопределено Тогда //ИЛИ Элементы.ФайлыДерево.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если мПредыдущийИдентификатор = Элементы.ФайлыДерево.ТекущиеДанные.ПолучитьИдентификатор() Тогда
		Возврат;
	Иначе
		мПредыдущийИдентификатор = Элементы.ФайлыДерево.ТекущиеДанные.ПолучитьИдентификатор();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияФайлыПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДеревоПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияФайлыПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.ФайлыДерево.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда			
			АдресФайла = ОбщийМодульВызовСервера.ПолучитьДанныеФайла(ТекущиеДанные.Документ, ТекущиеДанные.ИмяФайла, ТекущиеДанные.Номенклатура, ЭтотОбъект.УникальныйИдентификатор);	
			ОбщийМодульКлиент.ПредпросмотрФайла(АдресФайла, ТекущиеДанные.Расширение, Предпросмотр, Элементы.Предпросмотр);
		Иначе
			Элементы.Предпросмотр.Вид = ВидПоляФормы.ПолеHTMLДокумента;
			Предпросмотр = "";
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Документ не сохранен!");
		Возврат;
	КонецЕсли;
	
	//СписокСсылок = ПолучитьСписокПотолков()
	СписокСсылок = Новый СписокЗначений;
	ДополнитьСписокСсылокНаФайлы(СписокСсылок);
	Если СписокСсылок.Количество() > 0 Тогда
		Оп = Новый ОписаниеОповещения("ПослеВыбораСсылкиДляПрикрепленияФайла", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оп, СписокСсылок, Элементы.ФайлыДобавитьФайл);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСсылкиДляПрикрепленияФайла(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ДействиеПослеПрикрепления", ОписаниеОповещения);
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(ВыбранныйЭлемент.Значение, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрикрепленияФайлаЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРезультата.Результат Тогда
		ОбновитьЭлементыФормы();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьФайл(Команда)
	
	ВыбранныеЭлементы = Элементы.ФайлыДерево.ВыделенныеСтроки;	
	
	Если ВыбранныеЭлементы.Количество() > 0 Тогда
		Для каждого ЭлементДляПечати из ВыбранныеЭлементы Цикл
			СтрФайл = ФайлыДерево.НайтиПоИдентификатору(ЭлементДляПечати);
			
			// если выделен корень дерева, то пропускаем
			Если СтрФайл.ПолучитьРодителя() = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			АдресФайла = ОбщийМодульВызовСервера.ПолучитьДанныеФайла(СтрФайл.Документ, СтрФайл.ИмяФайла, СтрФайл.Номенклатура, ЭтотОбъект.УникальныйИдентификатор);
			
			Если НЕ АдресФайла = Неопределено Тогда // №7253
				ВременноеИмя = ПолучитьИмяВременногоФайла(СтрФайл.Расширение);
				ПолучитьФайл(АдресФайла, ВременноеИмя, Ложь);
				
				Shell = Новый COMОбъект("Shell.Application");
				Shell.ShellExecute(ВременноеИмя, "", "", "print", 0);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ПоказатьПредупреждение(,"Выберите файл(ы) в списке");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписокФайлов(Команда)
	
	//Запомним текущую строку
	ТекущиеДанные = Элементы.ФайлыДерево.ТекущиеДанные;
	
	ОбновитьСписокФайлов();
	
	ИдТекущейСтроки = Неопределено;
	КоллекцияЭлементовДерева = ЭтаФорма.ФайлыДерево.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Для Каждого ПодчиненнаяСтрока Из Строка.ПолучитьЭлементы() Цикл
			Если ТекущиеДанные <> Неопределено И ПодчиненнаяСтрока.Документ = ТекущиеДанные.Документ И ПодчиненнаяСтрока.Номенклатура = ТекущиеДанные.Номенклатура И ПодчиненнаяСтрока.ИмяФайла = ТекущиеДанные.ИмяФайла Тогда
				ИдТекущейСтроки = ПодчиненнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЦикла;
		Если ИдТекущейСтроки = Неопределено Тогда
			ИдТекущейСтроки = ИдентификаторСтроки;			
		КонецЕсли;
		Элементы.ФайлыДерево.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
	Элементы.ФайлыДерево.ТекущаяСтрока = ИдТекущейСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайл(Команда)
	
	ОбщийМодульКлиент.УдалитьФайлыВДереве(ЭтаФорма, ФайлыДерево, Элементы.ФайлыДерево);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбУдаленииФайловВДереве(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	ОбщийМодульВызовСервера.УдалитьФайлыВДереве(Параметры.МассивФайловКУдалению);	
	КомандаОбновитьСписокФайлов(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьВсеФайлы(Команда)
	
	ОбщийМодульКлиент.ПросмотретьВсеФайлы(ФайлыДерево, "Лид " + Объект.Номер, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлыДляПросмотра(Команда)
	
	Элементы.ФайлыДеревоПометкаДляВыбора.Видимость = Истина;
	Элементы.ГруппаФайлыКнопкиВыбораФайлов.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьВыбранныеФайлы(Команда)
	
	ОбщийМодульКлиент.ПросмотретьВсеФайлы(ФайлыДерево, "Лид " + Объект.Номер, УникальныйИдентификатор, Истина);
	
	Элементы.ФайлыДеревоПометкаДляВыбора.Видимость = Ложь;
	Элементы.ГруппаФайлыКнопкиВыбораФайлов.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыборФайлов(Команда)
	
	Элементы.ФайлыДеревоПометкаДляВыбора.Видимость = Ложь;
	Элементы.ГруппаФайлыКнопкиВыбораФайлов.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ВкладкаВыработка

&НаКлиенте
Процедура РучнаяКорректировкаВыработкиПриИзменении(Элемент)
	
	ОбщийМодульКлиент.РучнаяКорректировкаВыработкиПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыработкуПоУстановленнымПравиламРасчета(Команда)
	
	ОбъектФормы = ЭтаФорма.Объект;
	ОбщийМодульВызовСервера.ЗаполнитьВыработкуВДокументе(ОбъектФормы);
	КопироватьДанныеФормы(ОбъектФормы, Объект);
	Модифицированность = Истина;
	
	ОбновитьЭлементыФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаВидНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидыИсполнителей = новый СписокЗначений;
	ОбщийМодульКлиент.СформироватьДанныеВыбораВидаИсполнителя(ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Лид"), ВидыИсполнителей, , Ложь);
	ОбщийМодульВызовСервера.СформироватьДанныеВыбораВидаНачисленияПоВидамИсполнителей(ДанныеВыбора, ВидыИсполнителей, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаПриИзменении(Элемент)
	
	ОбновитьЭлементыФормыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ОчиститьСообщения();
	//ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
	Источник = Объект;
	
	Если СтрНайти(Команда.Имя, "ПредварительныйРасчет") = 1 Тогда
		Источник = Элементы.ПредварительныеРасчеты;
	КонецЕсли;
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Источник);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ПриОткрытииОбработчикОжидания()
	
	// №16055
	ПолучитьИсториюОбращенияКлиента();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДопЭлементыДляКонтактнойИнформации(Удалять = Ложь)
			
	Для Каждого СтрокаКИ Из ЭтаФорма.ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов Цикл
		Если НЕ СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Продолжить;
		КонецЕсли;
		
		Если Команды.Найти("ВыполнитьИсходящийЗвонок" + СтрокаКИ.ИмяРеквизита) = Неопределено Тогда
			ГруппаЭлемента = Элементы["Группа" + СтрокаКИ.ИмяРеквизита];
 
			СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект, ГруппаЭлемента, СтрокаКИ.ИмяРеквизита);
			МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, ГруппаЭлемента, СтрокаКИ.ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы(Знач ТекущаяКомната = Неопределено, Знач ТекущаяНоменклатура = Неопределено)
	
	//++ №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора	
	////обновим отображение деревьев
	//РассчитатьИтогиПоКомнатам();
	//-- №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора	
	
	//Если мИспользоватьАвтоматическиеСкидки Тогда 
	//	Элементы.ДеревоТоваровПроцентАвтоматическойСкидки.Видимость = Истина;
	//	Элементы.ДеревоТоваровСуммаАвтоматическойСкидки.Видимость = Истина;
	//КонецЕсли;
	
	//++ №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора	
	//Если НЕ Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено Тогда
	//	Если ТекущаяКомната = Неопределено Тогда
	//		ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
	//	КонецЕсли;
	//	Если ТекущаяНоменклатура = Неопределено Тогда
	//		ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//РазвернутьДеревоТоваров(ТекущаяКомната,ТекущаяНоменклатура);
	//Если Объект.СуммаДокумента = 0 Тогда
	//	Элементы.ГруппаПредварительныйРасчет.Заголовок = "Предварительный расчет";
	//Иначе
	//	Элементы.ГруппаПредварительныйРасчет.Заголовок = "Предварительный расчет (" + Формат(Объект.СуммаДокумента, "ЧДЦ=2") + ")";
	//КонецЕсли;
	//-- №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора	
	
	КомандаОбновитьСписокФайлов(Неопределено);
	
	ОбновитьЭлементыФормыНаСервере();
	
	Если НЕ (Объект.ПоследнееЗамерВыполнен
		ИЛИ ПоследнийРезультатЗамераОтменен()) // №8012 добавлено условие на отменен
	Тогда
		Элементы.ГруппаЗамерВыезд.ЦветФона = WebЦвета.ТемноОранжевый;
	Иначе
		Элементы.ГруппаЗамерВыезд.ЦветФона = WebЦвета.Белый;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПоследнийРезультатЗамераОтменен()
	
	Возврат Объект.Замеры.Количество() > 0 И Объект.Замеры[Объект.Замеры.Количество()-1].РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен");
	
КонецФункции	

// процедура экспортная из-за вызова из ОбщийМодульКлиент.РучнаяКорректировкаВыработкиПриИзменении
&НаСервере
Процедура ОбновитьЭлементыФормыНаСервере() Экспорт
	
	КоличествоОтмененныхЗамеров = 0;
	Для Каждого ТекЗамер Из Объект.Замеры Цикл
		Если ТекЗамер.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен")
			ИЛИ ТекЗамер.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерНеПроизводился")
			Тогда
			КоличествоОтмененныхЗамеров = КоличествоОтмененныхЗамеров + 1;
		КонецЕсли;
	КонецЦикла;	
	Элементы.ГруппаЗамерВыезд.Видимость = (Объект.Замеры.Количество() + Объект.Выезды.Количество() > 0); //#8012 (Объект.Замеры.Количество() - КоличествоОтмененныхЗамеров > 0);
	//Элементы.ГруппаВыезд.Видимость = Объект.Выезды.Количество() > 0;
	Элементы.ДекорацияИсторияЗамеров.Видимость = (Объект.Замеры.Количество() + Объект.Выезды.Количество() > 1);
	//Элементы.ГруппаКартыЯндекс.Видимость = ИспользоватьКартыЯндекс И Элементы.ГруппаЗамер.Видимость;
	Элементы.ГруппаКартыЯндекс.Видимость = ИспользоватьКартыЯндекс;
	
	Элементы.ГрафикТаблица.Видимость = (ВариантОтображенияГрафика = 2);
	Элементы.ГрафикЗамеров.Видимость = НЕ (ВариантОтображенияГрафика = 2);
	Если (ВариантОтображенияГрафика = 3 ИЛИ ВариантОтображенияГрафика = 4) 
		И Элементы.ДекорацияПустойПланЗамерщиков.Видимость Тогда
		Элементы.ГрафикЗамеров.Видимость = Ложь;
	КонецЕсли;
	
	//#8012 закомментировано
	//Элементы.ГрафикВыездовТаблица.Видимость = (ВариантОтображенияГрафика = 2);
	//Элементы.ГрафикВыездов.Видимость = НЕ (ВариантОтображенияГрафика = 2);
	
	//#6588 закомментировано
	//Если Объект.Замеры.Количество() > 0 Тогда
	//	НомерЗамера = Объект.Замеры.Количество()-1;
	//	ИсполнительЗамера = Объект.Замеры[НомерЗамера].ИсполнительЗамера;
	//	ДатаЗамера = Объект.Замеры[НомерЗамера].ДатаЗамера;
	//	ВремяНачалаЗамера = Объект.Замеры[НомерЗамера].ВремяНачалаЗамера;
	//	ВремяОкончанияЗамера = Объект.Замеры[НомерЗамера].ВремяОкончанияЗамера;
	//	ТекущийРезультатЗамера = Объект.Замеры[НомерЗамера].РезультатЗамера;
	//	СуммаДоговораНаЗамере = Объект.Замеры[НомерЗамера].СуммаДоговораНаЗамере;
	//	СуммаАвансаНаЗамере = Объект.Замеры[НомерЗамера].СуммаАвансаНаЗамере;
	//	ЗамерВыполнен = Объект.Замеры[НомерЗамера].ЗамерВыполнен;
	//	РезультатЗамера = Объект.Замеры[НомерЗамера].РезультатЗамера;
	//	НазначилЗамер = Объект.Замеры[НомерЗамера].НазначилЗамер;
	//	ДатаНазначенияЗамера = Объект.Замеры[НомерЗамера].ДатаНазначенияЗамера;
	//	Элементы.НазначилЗамер.Доступность = Истина;
	//	
	//	УправлениеЭлементамиФормыПоРезультатуЗамера();
	//Иначе
	//	Элементы.НазначилЗамер.Доступность = Ложь;
	//КонецЕсли;

	Если ДатаЗамера = Дата(1,1,1) Тогда
		ДатаЗамера = ТекущаяДатаСеанса();
	КонецЕсли;
	
	//Если ПредыдущаяДатаЗамера = Дата(1,1,1) Тогда
	//	ПредыдущаяДатаЗамера = ДатаЗамера;
	//КонецЕсли;	
	
	Если ДатаВыезда = Дата(1,1,1) Тогда
		ДатаВыезда = ТекущаяДатаСеанса();
	КонецЕсли;
	//Если ПредыдущаяДатаВыезда = Дата(1,1,1) Тогда
	//	ПредыдущаяДатаВыезда = ДатаВыезда;
	//КонецЕсли;
	
	//Если Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаЗамер ИЛИ Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаВыезд Тогда
	//	ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
	//	ОбновитьГрафикЗамеровНаСервере();
	//КонецЕсли;
	
	//ПолучитьИсториюОбращенияКлиента();  //-- №16055
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПолучитьЗадачиЛида();
	КонецЕсли;
	
	//#6588 закомментировано
	//Если Объект.Выезды.Количество() > 0 Тогда
	//	НомерВыезда = Объект.Выезды.Количество()-1;
	//	ИсполнительВыезда = Объект.Выезды[НомерВыезда].Исполнитель;
	//	ДатаВыезда = Объект.Выезды[НомерВыезда].Дата;
	//	ВремяНачалаВыезда = Объект.Выезды[НомерВыезда].ВремяНачала;
	//	ВремяОкончанияВыезда = Объект.Выезды[НомерВыезда].ВремяОкончания;		
	//КонецЕсли;
	
	// №1083 видимость определенных таблиц по выработке
	ОбщийМодульСервер.ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог(ЭтаФорма);
	
КонецПроцедуры

//++ №8950
&НаСервере
Процедура УстановитьЭлементыФормыТолькоПросмотр()
	
	Элементы.ФормаПерезвонить.Доступность = Ложь;
	Элементы.ФормаНазначитьЗамер.Доступность = Ложь;
	Элементы.ФормаНазначитьВыезд.Доступность = Ложь;
	Элементы.ФормаОформитьДоговор.Доступность = Ложь;
	Элементы.ОформитьСервиснуюЗаявку.Доступность = Ложь;
	Элементы.ОформитьРекламацию.Доступность = Ложь;
	Элементы.ФормаОтказ.Доступность = Ложь;
	Элементы.НеЦелевой.Доступность = Ложь;
	
КонецПроцедуры
//-- №8950

&НаКлиенте
Процедура ОбработкаСобытияАдресПриИзменении(Адрес, ИдУлицы = Неопределено)
		
	Если ПустаяСтрока(Адрес) Тогда
		Объект.ИдентификаторУлицы = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	КонецЕсли;
	
	ОбновитьТекстНаГрафикеЗамеровНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСобытияАдресОкончаниеВводаТекста(Адрес, Текст)	
	Адрес = Текст;
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьКурсорАдресаНаПоследнийСимвол() Экспорт
	
	Элементы.Адрес1.ВыделенныйТекст = Объект.Адрес;
	ПозицияОкончания = СтрДлина(Объект.Адрес)+1;
	Элементы.Адрес1.УстановитьГраницыВыделения(ПозицияОкончания, ПозицияОкончания);
		
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьКурсорАдресаВыездаНаПоследнийСимвол() Экспорт
	
	Элементы.АдресВыезда.ВыделенныйТекст = Объект.АдресВыезда;
	ПозицияОкончания = СтрДлина(Объект.АдресВыезда)+1;
	Элементы.АдресВыезда.УстановитьГраницыВыделения(ПозицияОкончания, ПозицияОкончания);
		
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеДанныхВКлассификатореАдресов()
	
	Элементы.ДекорацияКлассификаторНеЗагружен.Видимость = Ложь;
	Элементы.ДекорацияКлассификаторНеЗагружен.Подсказка = "";
	
	//проверим наличие городов	
	Если НЕ ОбщийМодульСервер.ЕстьГородаВСправочнике() Тогда
		Элементы.ДекорацияКлассификаторНеЗагружен.Видимость = Истина;
		Элементы.ДекорацияКлассификаторНеЗагружен.Подсказка = Элементы.ДекорацияКлассификаторНеЗагружен.Подсказка + "В справочнике городов нет ни одного города" + Символы.ПС;
	КонецЕсли;
	
	//проверим наличие данных в классификаторе адресов
	Если ЗначениеЗаполнено(Объект.Город) Тогда
		Если НЕ ЗначениеЗаполнено(ИдентификаторНаселенногоПункта) Тогда
			Элементы.ДекорацияКлассификаторНеЗагружен.Видимость = Истина;		
			Элементы.ДекорацияКлассификаторНеЗагружен.Подсказка = Элементы.ДекорацияКлассификаторНеЗагружен.Подсказка + "В карточке города не указан код КЛАДР или не загружены данные по городу" + Символы.ПС;
		КонецЕсли;
	КонецЕсли;
	
	//Элементы.Город.МаксимальнаяШирина = ?(Элементы.ДекорацияКлассификаторНеЗагружен.Видимость, 33, 35);
	
КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьКодСтраныПустогоТелефонаНаСервере()
//	
//	СтараяМодифицированность = Модифицированность;
//	Если ПустаяСтрока(Объект.ОсновнойТелефонКлиента) Тогда
//		Объект.ОсновнойТелефонКлиента = СофтФон.ПолучитьТелефонныйКодСтраныПользователя();
//	КонецЕсли;
//	Если ПустаяСтрока(Объект.ДополнительныйТелефонКлиента) Тогда
//		Объект.ДополнительныйТелефонКлиента = СофтФон.ПолучитьТелефонныйКодСтраныПользователя();
//	КонецЕсли;
//	Модифицированность = СтараяМодифицированность;
//	
//КонецПроцедуры

&НаСервере
Функция ПараметрыСеансаТелефонияСтрана()
	Возврат ПараметрыСеанса.ТелефонияСтрана;
КонецФункции

&НаСервереБезКонтекста
Функция ДоступнаРольАдминистратора()
	Возврат РольДоступна("АдминистраторСистемы");
КонецФункции

&НаСервере
Процедура УправлениеЭлементамиФормыПоСтатусу()
	
	//#6305
	//ФормаНазначитьЗамерДоступность = Истина;
	//Если Объект.ТекущийСтатус = Справочники.СтатусыЛида.Отказ
	//	ИЛИ Объект.ТекущийСтатус = Справочники.СтатусыЛида.НеЦелевой Тогда
	//	ФормаНазначитьЗамерДоступность = Ложь;
	//КонецЕсли;
	//Элементы.ФормаНазначитьЗамер.Доступность = ФормаНазначитьЗамерДоступность;
	
	Если КэшированныеЗначения = Неопределено 
		ИЛИ (ТипЗнч(КэшированныеЗначения) = Тип("Структура") И НЕ КэшированныеЗначения.Свойство("СоответствиеСтатусовИЭлементов")) Тогда
		
		СоответствиеСтатусовИЭлементов = Новый Соответствие;
		//СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.НазначитьЗамер, Элементы.);
		
		//++ №14649 статус Замер/Выезд отвечает за несколько кнопок Замер и Выезд соответственно
		//СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера, Элементы.ФормаНазначитьЗамер);
		МассивЭлементов = Новый Массив;
		МассивЭлементов.Добавить(Элементы.ФормаНазначитьЗамер);
		МассивЭлементов.Добавить(Элементы.ФормаНазначитьВыезд);
		
		СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера, МассивЭлементов);
		//-- №14649
		
		//СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.ОформитьДоговор, Элементы.);
		СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.ДоговорОформлен, Элементы.ФормаОформитьДоговор);
		СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.ОтложенныйНазначитьЗамер, Элементы.ФормаПерезвонить);
		//СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор, Элементы.);
		СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.Отказ, Элементы.ФормаОтказ);
		//#11332
		СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.Обращение, Элементы.ПеревестиВСтатусОбращение);
		//СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.Рекламация, Элементы.ОформитьРекламацию);
		//СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.Сервис, Элементы.ОформитьСервиснуюЗаявку);
		СоответствиеСтатусовИЭлементов.Вставить(Справочники.СтатусыЛида.НеЦелевой, Элементы.НеЦелевой);
		
		Если КэшированныеЗначения = Неопределено Тогда
			КэшированныеЗначения = Новый Структура;
		КонецЕсли;
		КэшированныеЗначения.Вставить("СоответствиеСтатусовИЭлементов", СоответствиеСтатусовИЭлементов);
		
	КонецЕсли;

	ДоступныеСтатусы = РегистрыСведений.ПорядокПереводаСтатусаЛида.ДоступныеДляПереводаСтатусы(Объект.ТекущийСтатус);
	Для каждого КлючЗначение из КэшированныеЗначения.СоответствиеСтатусовИЭлементов Цикл
		
		//++ №14649 статус может отвечать за несколько элементов формы
		Если ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
			МассивЭлементовФормы = КлючЗначение.Значение;
		Иначе
			МассивЭлементовФормы = новый Массив;
			МассивЭлементовФормы.Добавить(КлючЗначение.Значение);
		КонецЕсли;
		//-- №14649
			
		Для Каждого ЭлементФормы Из МассивЭлементовФормы Цикл
			//ЭлементФормы = КлючЗначение.Значение;
			ЭлементФормы.Доступность = НЕ (ДоступныеСтатусы.Найти(КлючЗначение.Ключ) = Неопределено);
		КонецЦикла;
		
	КонецЦикла;
	
	//#11332 #16875 кнопки перенесены вправо
	//Элементы.КоманднаяПанельОбращение.Видимость = (Объект.ТекущийСтатус = Справочники.СтатусыЛида.Обращение);
	Элементы.ГруппаПанельОбращения1.Доступность  = (Объект.ТекущийСтатус = Справочники.СтатусыЛида.Обращение);
	Элементы.ПеревестиВСтатусОбращение.Видимость = НЕ Объект.ТекущийСтатус = Справочники.СтатусыЛида.Обращение И СтатусОбращениеИспользуется;
	Элементы.ГруппаПанельОбращения2.Видимость    = (Объект.ТекущийСтатус = Справочники.СтатусыЛида.Обращение);
	Элементы.ДатаЗакрытияОбращения.Видимость = (Объект.ТекущийСтатус = Справочники.СтатусыЛида.Обращение);
	Если Объект.ТекущийСтатус = Справочники.СтатусыЛида.Обращение Тогда
		Элементы.ОформитьПродажу.Пометка 		 = Объект.ВидОбращения = ПредопределенноеЗначение("Справочник.ВидыОбращенийЛида.Продажа"); //++ №12721
		Элементы.ОформитьСервиснуюЗаявку.Пометка = Объект.ВидОбращения = ПредопределенноеЗначение("Справочник.ВидыОбращенийЛида.СервиснаяЗаявка");
		Элементы.ОформитьРекламацию.Пометка 	 = Объект.ВидОбращения = ПредопределенноеЗначение("Справочник.ВидыОбращенийЛида.Рекламация");
		Элементы.ЗакрытьОбращение.Пометка 		 = Объект.РезультатОбращения = ПредопределенноеЗначение("Справочник.РезультатыЛида.Закрыт");
	КонецЕсли;
	
КонецПроцедуры

//#6588
&НаСервере
Процедура УправлениеЭлементамиФормыПоРезультатуЗамера()
	
	ТолькоПросмотрЭлементов = НЕ ТекущийРезультатЗамера.Пустая();
	
	// #16066
	ТолькоПросмотрЭлементовЭлементовАдреса = ТолькоПросмотрЭлементов;
	Если ТолькоПросмотрЭлементовЭлементовАдреса И РазрешеноРедактированиеАдресаВЛидахСВыполненнымЗамером Тогда
		ТолькоПросмотрЭлементовЭлементовАдреса = Ложь;	
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗамерЗаключенДоговор", 			"Доступность", НЕ ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗамерДоговорНеЗаключен", 		"Доступность", НЕ ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗамерНазначитьНовыйЗамер", 		"Доступность", НЕ ТолькоПросмотрЭлементов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаЗамера", 					"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗамерыДатаЗамера1", 			"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Город", 						"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Город1", 						"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Адрес1", 						"ТолькоПросмотр", ТолькоПросмотрЭлементовЭлементовАдреса);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Адрес", 						"ТолькоПросмотр", ТолькоПросмотрЭлементовЭлементовАдреса);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыбратьАдрес1", 				"Доступность", НЕ ТолькоПросмотрЭлементовЭлементовАдреса);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыбратьАдрес", 					"Доступность", НЕ ТолькоПросмотрЭлементовЭлементовАдреса);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоследнийКомментарийКЗамеру1", 	"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗамерыКомментарийКЗамеру1", 	"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГрафик", 					"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрафикЗамеров", 				"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрафикТаблица", 				"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	
КонецПроцедуры

//#6588
&НаСервере
Процедура УправлениеЭлементамиФормыПоРезультатуВыезда()
	
	ТолькоПросмотрЭлементов = НЕ ТекущийРезультатВыезда.Пустая(); // №14649 было: ТекущийРезультатВыезда; // признак Выполнен
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеревестиВыездВВыполнен", 		"Доступность", НЕ ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыездНеВыполнен", 				"Доступность", НЕ ТолькоПросмотрЭлементов); // №14649
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыездыДата1", 					"ТолькоПросмотр", ТолькоПросмотрЭлементов);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГрафик", 					"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрафикЗамеров", 				"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрафикТаблица", 				"ТолькоПросмотр", ТолькоПросмотрЭлементов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтатусВозвратаПослеВыезда",		"Видимость", ЗначениеЗаполнено(Объект.СтатусВозвратаПослеВыезда)); // №14649
	
КонецПроцедуры

// вызывается ПередЗаписьюНаСервере
&НаСервере
Функция ДобавитьЗаписиВИсториюПоЗамерамИВыездам(ТекущийОбъект, ПредыдущаяТаблица, ТекущаяТаблица, ЭтоВыезды = Ложь)	
	
	ТекстВИсторию = "";
	Результат = Документы.Лид.ОпределитьНазначенИлиИзмененЗамерИлиВыезд(ТекстВИсторию, ПредыдущаяТаблица, ТекущаяТаблица, ЭтоВыезды);
	Если Результат Тогда
		ДобавитьЗаписьВИсториюСервер(ТекстВИсторию);
		// #17148
		ТекущийОбъект.ПоследнийКомментарий = ТекстВИсторию;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаСервере
Функция КонстантыКонтролироватьСозданиеЛидовПоНомеруКлиента()
	Возврат Константы.КонтролироватьСозданиеЛидовПоНомеруКлиента.Получить();
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьНаличиеЛидаВРаботеПоТелефонам(ТелефоныКлиента, СсылкаНаТекущийЛид)
	
	СтруктураРезультата = Новый Структура("Ссылка, НомерТелефона");
	
	СтатусыЛидовВРаботе = Новый СписокЗначений;
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.НазначитьЗамер);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОтложенныйНазначитьЗамер);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОформитьДоговор);
	
	//ищем по номеру телефона клиента. Если нашли - возвращаем ссылку на него
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийСтатус", 	 СтатусыЛидовВРаботе);
	Запрос.УстановитьПараметр("СсылкаНаЛид", 	 СсылкаНаТекущийЛид);
	Запрос.УстановитьПараметр("ТелефоныКлиента", ТелефоныКлиента);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Лид.Ссылка КАК Ссылка,
	|	ЛидКИ.Представление КАК НомерТелефона
	|ИЗ
	|	Документ.Лид КАК Лид
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид.ДополнительнаяКонтактнаяИнформация КАК ЛидКИ
	|		ПО (ЛидКИ.Ссылка = Лид.Ссылка)
	|ГДЕ
	|	Лид.ТекущийСтатус В(&ТекущийСтатус)
	|	И ЛидКИ.Представление В(&ТелефоныКлиента)
	|	И ЛидКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, Выборка);
	КонецЕсли;
		
	Возврат СтруктураРезультата;
	
КонецФункции

&НаСервере
Процедура СоздатьЭлектронноеПисьмоЗамерщику(ТекущийОбъект)
	
	Если НЕ ТекущийОбъект.ПоследнийИсполнительЗамера = Справочники.Сотрудники.ПустаяСсылка() и Константы.ОтправлятьEmailЗамерщикуПриПланированииЗамера.Получить() Тогда
		ОсновнойEMailЗамерщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущийОбъект.ПоследнийИсполнительЗамера, Справочники.ВидыКонтактнойИнформации.EmailСотрудника);
		Если НЕ ПустаяСтрока(ОсновнойEMailЗамерщика) Тогда 
			//ПисьмоОтправленное = Документы.ЭлектронноеПисьмо.НайтиПоРеквизиту("Основание",Объект.Ссылка);
			//Если ПисьмоОтправленное = Документы.ЭлектронноеПисьмо.ПустаяСсылка() Тогда 
				ЗаголовокНовогоПисьма = "Запланирован замер. Клиент: " + ТекущийОбъект.ИмяКлиента + ", Адрес: " + ТекущийОбъект.Адрес;
				ТекстПисьма = "Вам назначен замер.
				| Клиент: " + ТекущийОбъект.ИмяКлиента + "
				//| Телефон: " + Объект.СотовыйТелефонКлиента + "
				| Адрес: " + ТекущийОбъект.Адрес + "
				| Дата замера: " + Формат(ТекущийОбъект.ПоследняяДатаЗамера,"ДЛФ=DD") + " в " + Формат(ТекущийОбъект.ПоследнееВремяНачалаЗамера,"ДФ=Ч:мм") + " ч.";
				
				УчетнаяЗаписьОтправителя = ОбщийМодульСервер.НастройкаПользователя("УчетнаяЗаписьЭлектроннойПочты");
				Если УчетнаяЗаписьОтправителя.Пустая() Тогда
					УчетнаяЗаписьОтправителя = Константы.УчетнаяЗаписьЭлектроннойПочтыДляАвтоматическихРассылок.Получить();
				КонецЕсли;
				НовоеПисьмо = РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмо(ЗаголовокНовогоПисьма, ТекущийОбъект.ПоследнийИсполнительЗамера, ТекстПисьма, ТекущийОбъект.Ссылка, , , УчетнаяЗаписьОтправителя);
				
				Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(НовоеПисьмо);
				ОтправитьУведомлениеЗамерщику = Ложь;
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьЗамерИОнНеВыполнен()
	
	Результат = Ложь;
	Если Объект.Замеры.Количество() > 0 Тогда
		НомерЗамера = Объект.Замеры.Количество()-1;
		//Если НЕ ПустаяСтрока(Объект.Замеры[НомерЗамера].ИсполнительЗамера) // условие пока убрано, в случае пула здесь пусто 
		Если НЕ Объект.Замеры[НомерЗамера].ДатаЗамера = Дата(1,1,1)
			//И НЕ Объект.Замеры[НомерЗамера].ЗамерВыполнен И НЕ Объект.Замеры[НомерЗамера].Отменен Тогда
			И НЕ Объект.Замеры[НомерЗамера].ЗамерВыполнен 
			И НЕ Объект.Замеры[НомерЗамера].РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерОтменен") 
			И НЕ Объект.Замеры[НомерЗамера].РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗамерНеПроизводился") 
			Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЕстьЗамерИОнВыполнен()
	
	Результат = Ложь;
	Если Объект.Замеры.Количество() > 0 Тогда
		НомерЗамера = Объект.Замеры.Количество()-1;
		Если НЕ ПустаяСтрока(Объект.Замеры[НомерЗамера].ИсполнительЗамера) И НЕ Объект.Замеры[НомерЗамера].ДатаЗамера = Дата(1,1,1)
			И Объект.Замеры[НомерЗамера].ЗамерВыполнен Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДоступноСозданиеЗамераПоСтатусуЛида()
	
	Результат = Истина;
	Если Объект.ТекущийСтатус = Справочники.СтатусыЛида.ДоговорОформлен Тогда
		Результат = Ложь;		
	КонецЕсли;	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция РазрешенПереводСтатуса(ТекущийСтатус, СледующийСтатус)

	Возврат РегистрыСведений.ПорядокПереводаСтатусаЛида.РазрешенПереводСтатуса(ТекущийСтатус, СледующийСтатус);
	
КонецФункции

&НаСервере
Функция ЗапретитьСоздаватьНовыйЗамерПоЛидуЕслиУжеЕстьВыполненныйЗамер()
	Возврат Константы.ЗапретитьСоздаватьНовыйЗамерПоЛидуЕслиУжеЕстьВыполненныйЗамер.Получить();
КонецФункции

// #17014 оставляем только типовую форму подбора
//&НаКлиенте
//Процедура УДАЛИТЬ_ВыбратьАдрес(Команда)	
//	
//	ИмяПоляАдрес 	= ?(Команда.Имя = "ВыбратьАдресВыезда", "АдресВыезда", "Адрес");
//	ИмяПоляИдУлицы 	= ?(Команда.Имя = "ВыбратьАдресВыезда", "ИдентификаторУлицыВыезда", "ИдентификаторУлицы");
//	ИмяПоляГород	= ?(Команда.Имя = "ВыбратьАдресВыезда", "ГородВыезда", "Город"); // №14051
//	
//	ЧислоВхождений = СтрЧислоВхождений(Объект[ИмяПоляАдрес], ",");
//	
//	ДополнительныеПараметры = Новый Структура("ИмяПоляАдрес, ИмяПоляИдУлицы", ИмяПоляАдрес, ИмяПоляИдУлицы);
//	
//	Если ЧислоВхождений > 2 Тогда
//		//много запятых. Скорее всего это адрес в формате ФИАС. Откроем форму адреса ФИАС
//		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораАдресаФИАС", ЭтаФорма, ДополнительныеПараметры);
//		ПараметрыАдреса = Новый Структура;
//		ПараметрыАдреса.Вставить("Представление", Объект[ИмяПоляАдрес]);
//		ПараметрыАдреса.Вставить("ОткрытаПоСценарию", Истина);
//		ПараметрыАдреса.Вставить("ВидКонтактнойИнформации", Новый Структура("ПроверятьКорректность", Ложь));

//		//ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводАдреса",ПараметрыАдреса,ЭтаФорма,,,,ОписаниеОповещения);
//		ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса",ПараметрыАдреса,ЭтаФорма,,,,ОписаниеОповещения);
//	Иначе
//		//мало запятых. Скорее всего это адрес в нашем формате
//		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораАдреса", ЭтаФорма, ДополнительныеПараметры);
//		ПараметрыАдреса = Новый Структура;
//		ПараметрыАдреса.Вставить("Адрес",Строка(Объект[ИмяПоляГород]) + ", " + Объект[ИмяПоляАдрес]);
//		//ПараметрыАдреса.Вставить("КодГорода", КодГорода);
//		//ПараметрыАдреса.Вставить("КодНасПункта", КодНасПункта);
//		//ПараметрыАдреса.Вставить("КодСубъектаРФ", КодСубъектаРФ);
//		ПараметрыАдреса.Вставить("ИдентификаторУлицы", Объект[ИмяПоляИдУлицы]);
//		
//		//++ №10663 фильтр городов в зависимости от источника
//		ПараметрыАдреса.Вставить("ФильтроватьГородаТолькоРозница", Истина);
//		//-- №10663
//		
//		ОткрытьФорму("ОбщаяФорма.ФормаВводаАдреса",ПараметрыАдреса,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	КонецЕсли;

//КонецПроцедуры

&НаКлиенте
Процедура ВыбратьАдрес(Команда)
		
	СуффиксРеквизита = ?(Команда.Имя = "ВыбратьАдресВыезда", "Выезда", "");
	ДополнительныеПараметры = Новый Структура("СуффиксРеквизита", СуффиксРеквизита);

	Если НЕ ЗначениеЗаполнено(ИдентификаторНаселенногоПункта) Тогда
		ПредставлениеАдресаЛида = Объект["Адрес" + СуффиксРеквизита];			
	Иначе
		ПредставлениеАдресаЛида = ПредставлениеАдресаЛида(Объект["Город" + СуффиксРеквизита], Объект["Адрес" + СуффиксРеквизита]);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораАдресаФИАС", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("Представление", ПредставлениеАдресаЛида);
	ПараметрыАдреса.Вставить("ОткрытаПоСценарию", Истина);
	ПараметрыАдреса.Вставить("ВидКонтактнойИнформации", Новый Структура("ПроверятьКорректность", Ложь));

	ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса",ПараметрыАдреса,ЭтаФорма,,,,ОписаниеОповещения);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораАдресаФИАС(ЗначениеВыбора, ДополнительныеПараметры) Экспорт

	Если ЗначениеВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СуффиксРеквизита = ДополнительныеПараметры.СуффиксРеквизита;
	
	Если ЗначениеВыбора.ВведеноВСвободнойФорме Тогда 
		Объект["Адрес" + СуффиксРеквизита] = ЗначениеВыбора.Представление;
	ИначеЕсли НЕ ЗначениеЗаполнено(ИдентификаторНаселенногоПункта) Тогда
		Объект["Адрес" + СуффиксРеквизита] = ОбщийМодульКлиентСервер.УбратьИндексВАдресе(ЗначениеВыбора.Представление);
		ОБъект["Город" + СуффиксРеквизита] = ПредопределенноеЗначение("Справочник.Города.ПустаяСсылка");
	Иначе
		ОбработкаВыбораАдресаИзКлассификатораСервер(ЗначениеВыбора.Значение, 
													Объект["Город" + СуффиксРеквизита], Объект["Адрес" + СуффиксРеквизита], ЭтотОбъект["ИдентификаторНаселенногоПункта" + СуффиксРеквизита]);
	КонецЕсли;
	
	ОбработкаСобытияАдресПриИзменении(Объект["Адрес" + СуффиксРеквизита]);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеАдресаЛида(Город, Адрес)
	
	Возврат ОбщийМодульСервер.ПредставлениеАдреса(Город, Адрес);
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбработкаВыбораАдресаИзКлассификатораСервер(АдресJSON, Город, Адрес, ИдентификаторНаселенногоПункта)

	ОбщийМодульСервер.ОбработкаВыбораАдресаИзКлассификатора(АдресJSON, Город, Адрес, ИдентификаторНаселенногоПункта);
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуНаГород(СтрокаГород)
	Возврат Справочники.Города.НайтиПоНаименованию(СтрокаГород, Ложь);
КонецФункции

//&НаКлиенте
//Процедура ОбработкаВыбораАдреса(ЗначениеВыбора, ДополнительныеПараметры) Экспорт

//	Если НЕ ЗначениеВыбора = Неопределено Тогда
//		ИмяПоляАдрес = ДополнительныеПараметры.ИмяПоляАдрес;
//		ИмяПоляИдУлицы = ДополнительныеПараметры.ИмяПоляИдУлицы;
//		ИмяРеквизитаВремАдрес = "Врем" + ИмяПоляАдрес;
//		
//		СтрокаАдрес = ЗначениеВыбора.Представление;
//		Объект[ИмяПоляИдУлицы] = ЗначениеВыбора.ИдентификаторУлицы;
//		МассивСтрок = ОбщийМодуль.РазложитьСтрокуВМассивПодстрок(СтрокаАдрес, ",", Ложь);
//		
//		Если МассивСтрок.Количество() > 0 Тогда
//			Объект.Город = ПолучитьССылкуНаГород(СокрЛП(МассивСтрок[0]));
//			Объект[ИмяПоляАдрес] = "";
//			Для НомерЭлемента = 1 По МассивСтрок.Количество()-1 Цикл
//				Если НомерЭлемента = 1 Тогда
//					ЭтаФорма[ИмяРеквизитаВремАдрес] = СокрЛП(МассивСтрок[НомерЭлемента]);
//				КонецЕсли;
//				Объект[ИмяПоляАдрес] = Объект[ИмяПоляАдрес] + СокрЛП(МассивСтрок[НомерЭлемента]);
//				Если НЕ НомерЭлемента = МассивСтрок.Количество()-1 Тогда
//					Объект[ИмяПоляАдрес] = Объект[ИмяПоляАдрес] + ", ";
//				КонецЕсли;
//			КонецЦикла;
//		Иначе
//			Объект[ИмяПоляАдрес] = "";	
//			ЭтаФорма[ИмяРеквизитаВремАдрес] = Объект[ИмяПоляАдрес];
//		КонецЕсли;
//			
//		Модифицированность = Истина;
//		ОбработкаСобытияАдресПриИзменении(Объект[ИмяПоляАдрес], Объект[ИмяПоляИдУлицы]);
//	КонецЕсли;

//КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыОсновныеПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекущееНазваниеСтраницы = Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница.Имя;
	
	// Нужно проверить, возможно есть пустой замер или выезд
	Если мСтраница <> Неопределено И мСтраница = "ГруппаЗамерВыезд" И ТекущееНазваниеСтраницы <> "ГруппаЗамерВыезд" Тогда
		Если ПоследнийЗамерПустой() Тогда //проверяем всегда вне зависимости от ПланированиеЗамер = Истина		
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОПродолженииНазначенияЗамера", ЭтотОбъект), "Текущий замер не назначен, продолжить назначение замера?", РежимДиалогаВопрос.ДаНет);		
			Возврат;	
		КонецЕсли;
		Если ПоследнийВыездПустой() Тогда		
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОПродолженииНазначенияВыезда", ЭтотОбъект), "Текущий выезд не назначен, продолжить назначение выезда?", РежимДиалогаВопрос.ДаНет);		
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	мСтраница = ТекущееНазваниеСтраницы;
	
	Если Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаЗамерВыезд Тогда
		УправлениеЭлементамиГруппыЗамерВыезд();
		Если ПланированиеЗамера Тогда
			Элементы.Замеры.ТекущаяСтрока = ТекущаяСтрокаЗамеров; //#6588 вернемся на нашу строку, если вдруг переключали
			Если НЕ Элементы.Замеры.ТекущиеДанные = Неопределено Тогда // №8012 добавлено условие
				ТекущийРезультатЗамера = Элементы.Замеры.ТекущиеДанные.РезультатЗамера;
			Иначе
				ТекущийРезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ПустаяСсылка");
			КонецЕсли;	
			УправлениеЭлементамиФормыПоРезультатуЗамера();
			
			ОбновитьЭлементыФормы();
			Если Объект.Замеры.Количество() > 0 Тогда  // №8012 добавлено условие
				ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
			КонецЕсли;
			ОбновитьГрафикЗамеров();
			
		ИначеЕсли ПланированиеВыезда Тогда
			УправлениеЭлементамиФормыПоРезультатуВыезда();
			
			//++ №14649
			Если НЕ Элементы.Выезды.ТекущиеДанные = Неопределено Тогда
				ТекущийРезультатВыезда = Элементы.Выезды.ТекущиеДанные.Результат;
			Иначе
				ТекущийРезультатВыезда = ПредопределенноеЗначение("Справочник.РезультатыВыездаЛида.ПустаяСсылка");
			КонецЕсли;
			//-- №14649
			
			ОбновитьЭлементыФормы();
			ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
			ОбновитьГрафикЗамеров();
		КонецЕсли;
	
	ИначеЕсли Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаКартыЯндекс Тогда
		ДатаКартыЯндекс = ДатаЗамера;
		ИнициализироватьКартуЯндекс();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПоследнийВыездПустой()
	
	КВозврату = Ложь;
	
	Если Объект.Выезды.Количество() = 0 Тогда
		Возврат КВозврату;
	КонецЕсли;
	
	ПоследнийВыезд = Объект.Выезды[Объект.Выезды.Количество()-1];
	
	Если ПоследнийВыезд.Дата = Дата(1,1,1) 
		//ИЛИ ПоследнийВыезд.Исполнитель.Пустая() //#6384 поле "Замерщик" в документе "Лид" не обязательное
		ИЛИ (ПоследнийВыезд.ВремяНачала = Дата(1,1,1) И ПоследнийВыезд.ВремяОкончания = Дата(1,1,1)) Тогда
		КВозврату = Истина;
	КонецЕсли;
	
	Возврат КВозврату;
	
КонецФункции

&НаКлиенте
Функция ПоследнийЗамерПустой()
	
	КВозврату = Ложь;
	
	Если Объект.Замеры.Количество() = 0 Тогда
		Возврат КВозврату;
	КонецЕсли;
	
	ПоследнийЗамер = Объект.Замеры[Объект.Замеры.Количество()-1];
	
	Если ПоследнийЗамер.ДатаЗамера = Дата(1,1,1) 
		//ИЛИ ПоследнийЗамер.ИсполнительЗамера.Пустая() //#6384 поле "Замерщик" в документе "Лид" не обязательное
		ИЛИ (ПоследнийЗамер.ВремяНачалаЗамера = Дата(1,1,1) И ПоследнийЗамер.ВремяОкончанияЗамера = Дата(1,1,1)) Тогда
		КВозврату = Истина;
	КонецЕсли;
	
	Возврат КВозврату;
	
КонецФункции

&НаКлиенте
Процедура ПослеВопросаОПродолженииНазначенияЗамераЗеркально(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПослеВопросаОПродолженииНазначенияЗамера(КодВозвратаДиалога.Нет, ДопПараметры);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПродолженииНазначенияЗамера(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		// Оставляем на странице замера
		Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаЗамерВыезд;
		
	Иначе
		
		СценарийНазначенияВыезда = (ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("СценарийНазначенияВыезда")); // №14649
		
		// Удаляем последний пустой замер
		УдалитьПоследнийЗамер(СценарийНазначенияВыезда);
		
		НазначенЗамер = Ложь; // №8781 чтобы не совершал лишних действий (к примеру формирование СМС)
		
		//++ №14649
		Если СценарийНазначенияВыезда Тогда
			НазначитьВыезд(Неопределено);
		//-- №14649
		Иначе
			ОбновитьЭлементыФормы();
		КонецЕсли;
		
	КонецЕсли;
	
	мСтраница = Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПоследнийЗамер(СценарийНазначенияВыезда = Ложь)
	
	Если Объект.Замеры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоследнийЗамер = Объект.Замеры[Объект.Замеры.Количество()-1];
	Объект.Замеры.Удалить(ПоследнийЗамер);
	
	Если Объект.Замеры.Количество() > 0 Тогда
		ПоследнийЗамер = Объект.Замеры[Объект.Замеры.Количество()-1];
		ТекущаяСтрокаЗамеров = ПоследнийЗамер.ПолучитьИдентификатор();
	КонецЕсли;
	
	Если НЕ СценарийНазначенияВыезда Тогда // №14649 добавлено условие
		
		ЗаполнитьВыборДанныхЗамераВыезда();
		ТекущийЗамерВыездПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПродолженииНазначенияВыездаЗеркально(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПослеВопросаОПродолженииНазначенияВыезда(КодВозвратаДиалога.Нет, ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПродолженииНазначенияВыезда(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		// Оставляем на странице выезда
		Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаЗамерВыезд;
		
	Иначе
		
		СценарийНазначенияЗамера = ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("СценарийНазначенияЗамера"); //№14649
		
		// Удаляем последний пустой выезд
		УдалитьПоследнийВыезд(СценарийНазначенияЗамера);
		
		//++ №14649
		Если СценарийНазначенияЗамера Тогда
			НазначитьЗамер(Неопределено);
		//-- №14649
		Иначе
			ОбновитьЭлементыФормы();
		КонецЕсли;
		
	КонецЕсли;
	
	мСтраница = Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПоследнийВыезд(СценарийНазначенияЗамера)
	
	Если Объект.Выезды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоследнийВыезд = Объект.Выезды[Объект.Выезды.Количество()-1];
	Объект.Выезды.Удалить(ПоследнийВыезд);
	Если Объект.Выезды.Количество() > 0 Тогда
		ПоследнийВыезд = Объект.Выезды[Объект.Выезды.Количество()-1];
		ТекущаяСтрокаВыездов = ПоследнийВыезд.ПолучитьИдентификатор();
	КонецЕсли;
	
	Если НЕ СценарийНазначенияЗамера Тогда // №14649 добавлено условие
		
		ЗаполнитьВыборДанныхЗамераВыезда();
		ТекущийЗамерВыездПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьНезавершенныеЗамеры()
	
	Результат = Ложь;
	
	Для Каждого ТекущаяСтрока Из Объект.Замеры Цикл
		// #10986 изменено условие 
		//Если НЕ ТекущаяСтрока.ЗамерВыполнен Тогда
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.РезультатЗамера) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	//++ №14649 выезды также смотрим
	Для Каждого ТекущаяСтрока Из Объект.Выезды Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Результат) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	//-- №14649
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗамерыДляОформленияДоговора()
	
	МассивЗамеров = новый Массив;
	
	Для Каждого ТекущаяСтрока Из Объект.Замеры Цикл
		
		Если НЕ ТекущаяСтрока.ЗамерВыполнен И НЕ ТекущаяСтрока.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗаключенДоговор") Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураЗамера = Новый Структура("ДатаЗамера, ИсполнительЗамера, РезультатЗамера, ИдентификаторЗамера, ВремяНачалаЗамера, ВремяОкончанияЗамера, НомерЗамера");
		ЗаполнитьЗначенияСвойств(СтруктураЗамера, ТекущаяСтрока);
		
		СтруктураЗамера.ИдентификаторЗамера = ТекущаяСтрока.ИдЗамера;
		СтруктураЗамера.НомерЗамера = ТекущаяСтрока.НомерСтроки;
		
		МассивЗамеров.Добавить(СтруктураЗамера);
		
	КонецЦикла;
	
	Возврат МассивЗамеров;
	
КонецФункции

&НаКлиенте
Процедура ПослеОформленияЗаказДоговора() 
	
	Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЛида.ДоговорОформлен");
	УправлениеЭлементамиФормыПоСтатусу();
	ДобавитьЗаписьВИсториюКлиент("Оформлен заказ-договор.");
	ОчиститьДатуСледующегоКонтактаБезЗаписиВИсторию(); // №9558
	ВывестиСписокДоговоров(); // №15368
	
КонецПроцедуры

&НаСервере
Функция ЕстьОформленныйЗаказДоговор()
	
	Результат = Ложь;
	
	ЕстьЗаказДоговор = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказДоговор.Ссылка
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	ЗаказДоговор.Проведен
	|	И ЗаказДоговор.Основание = &Основание
	|	И НЕ ЗаказДоговор.ДоговорРассторгнут
	|";
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаДоговор(СсылкаЛид)
	
	Если НЕ ЗначениеЗаполнено(СсылкаЛид) Тогда
		Возврат Документы.ЗаказДоговор.ПустаяСсылка();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументЗаказДоговор.Ссылка
	|ИЗ
	|	Документ.ЗаказДоговор КАК ДокументЗаказДоговор
	|ГДЕ
	|	ДокументЗаказДоговор.Проведен
	|	И ДокументЗаказДоговор.Основание = &Основание
	|	И НЕ ДокументЗаказДоговор.ДоговорРассторгнут";
	Запрос.УстановитьПараметр("Основание", СсылкаЛид);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Документы.ЗаказДоговор.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура ДекорацияСсылкаНаДоговорНажатие(Элемент)
	Если НЕ ЗаказДоговор.Пустая() Тогда
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("Ключ",ЗаказДоговор);
		ОткрытьФорму("Документ.ЗаказДоговор.ФормаОбъекта",СтруктураДокумента);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияЛидаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("Лид", Объект.Ссылка);
	ПараметрыНовойФормы.Вставить("Дата", Элементы.ИсторияЛида.ТекущиеДанные.Дата);
	ПараметрыНовойФормы.Вставить("Пользователь", Элементы.ИсторияЛида.ТекущиеДанные.Пользователь);
	ПараметрыНовойФормы.Вставить("Комментарий", Элементы.ИсторияЛида.ТекущиеДанные.Комментарий);
	ОткрытьФорму("Документ.Лид.Форма.ФормаКомментарий", ПараметрыНовойФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудникаТекущегоПользователя()
	Возврат ОбщийМодульСервер.НастройкаПользователя("Сотрудник");
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	Возврат Пользователи.ТекущийПользователь();
КонецФункции

&НаКлиенте
Функция ПроверитьУказаниеВремениЗамера()
	Если НЕ ЗначениеЗаполнено(ВремяНачалаЗамера) ИЛИ НЕ ЗначениеЗаполнено(ВремяОкончанияЗамера) Тогда
		Сообщить("Необходимо указать время начала и окончания замера, для формирования его результата!");		
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаСервере
Функция ЕстьВыездИОнНеВыполнен()
	
	Результат = Ложь;
	Если Объект.Выезды.Количество() > 0 Тогда
		НомерВыезда = Объект.Выезды.Количество()-1;
		//Если НЕ ПустаяСтрока(Объект.Выезды[НомерВыезда].Исполнитель) // условие пока убрано, в случае пула здесь пусто
		Если НЕ Объект.Выезды[НомерВыезда].Дата = Дата(1,1,1)
			И НЕ Объект.Выезды[НомерВыезда].Выполнен
			И НЕ ЗначениеЗаполнено(Объект.Выезды[НомерВыезда].Результат) // №14649
		Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЕстьВыездИОнВыполнен()
	
	Результат = Ложь;
	Если Объект.Выезды.Количество() > 0 Тогда
		НомерВыезда = Объект.Выезды.Количество()-1;
		Если НЕ ПустаяСтрока(Объект.Выезды[НомерВыезда].Исполнитель) И Не Объект.Выезды[НомерВыезда].Дата = Дата(1,1,1)
			И Объект.Выезды[НомерВыезда].Выполнен
			И ЗначениеЗаполнено(Объект.Выезды[НомерВыезда].Результат) // №14649
		Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьДанныеЗамера(Команда)
	
	ТекОбласть = Элементы.ГрафикТаблица.ТекущаяОбласть;
	Расшифровка = Элементы.ГрафикТаблица.ТекущаяОбласть.Расшифровка;
	Если Расшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекОбласть.Верх <= ТекОбласть.Низ Тогда
		Расшифровка.ВремяОкончанияЗамера = Мин(ОбщийМодульКлиентСервер.СоединитьДатуИВремя(Расшифровка.ДатаЗамера, ВремяКонцаЗамеров),
											Расшифровка.ВремяНачалаЗамера + (ТекОбласть.Низ - ТекОбласть.Верх + 1) * (ПродолжительностьЗамера) * 3600);
	КонецЕсли;
	
	ДопПараметры = Новый Структура("Расшифровка", Расшифровка);
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбИзмененииЗамера", ЭтаФорма, ДопПараметры);
	ПоказатьВопрос(Оповещение, "Изменить данные замера?", РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДанныеВыезда(Команда)
	
	ТекОбласть = Элементы.ГрафикТаблица.ТекущаяОбласть;
	Расшифровка = Элементы.ГрафикТаблица.ТекущаяОбласть.Расшифровка;
	Если Расшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекОбласть.Верх <= ТекОбласть.Низ Тогда
		Расшифровка.ВремяОкончанияЗамера = Мин(ОбщийМодульКлиентСервер.СоединитьДатуИВремя(Расшифровка.ДатаЗамера, ВремяКонцаЗамеров),
											Расшифровка.ВремяНачалаЗамера + (ТекОбласть.Низ - ТекОбласть.Верх + 1) * (ПродолжительностьЗамера) * 3600);
	КонецЕсли;
	
	ДопПараметры = Новый Структура("Расшифровка", Расшифровка);
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбИзмененииЗамера", ЭтаФорма, ДопПараметры);
	ПоказатьВопрос(Оповещение, "Изменить данные выезда?", РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьСвободныйИнтервалЗамеров(Знач ПараметрыНовогоЗамера, ОбъектСсылка)
	
	Если НЕ ПараметрыНовогоЗамера.Свойство("ИдЗамера") Тогда
		ПараметрыНовогоЗамера.Вставить("ИдЗамера", "");
	КонецЕсли;
	Если НЕ ПараметрыНовогоЗамера.Свойство("ИсполнительЗамера") И ПараметрыНовогоЗамера.Свойство("Исполнитель") Тогда
		ПараметрыНовогоЗамера.Вставить("ИсполнительЗамера", ПараметрыНовогоЗамера.Исполнитель);
	КонецЕсли;
	Если НЕ ПараметрыНовогоЗамера.Свойство("ДатаЗамера") И ПараметрыНовогоЗамера.Свойство("Дата") Тогда
		ПараметрыНовогоЗамера.Вставить("ДатаЗамера", ПараметрыНовогоЗамера.Дата);
	КонецЕсли;
	Если НЕ ПараметрыНовогоЗамера.Свойство("ВремяНачала") И ПараметрыНовогоЗамера.Свойство("ВремяНачалаЗамера") Тогда
		ПараметрыНовогоЗамера.Вставить("ВремяНачала", ПараметрыНовогоЗамера.ВремяНачалаЗамера);
	КонецЕсли;
	Если НЕ ПараметрыНовогоЗамера.Свойство("ВремяОкончания") И ПараметрыНовогоЗамера.Свойство("ВремяОкончанияЗамера") Тогда
		ПараметрыНовогоЗамера.Вставить("ВремяОкончания", ПараметрыНовогоЗамера.ВремяОкончанияЗамера);
	КонецЕсли;
	Возврат МодульОтчетов.ПроверитьСвободныйИнтервалЗамеров(ПараметрыНовогоЗамера, ФильтрТочкаПродаж);
	
	//Если ТипЗнч(ПараметрыНовогоЗамера.ИсполнительЗамера) = Тип("СправочникСсылка.Сотрудники") Тогда	
	//	Если НЕ ПараметрыНовогоЗамера.ИсполнительЗамера.НеПроверятьПересечениеЗамеровВГрафике 
	//		И НЕ ОбщийМодуль.ПроверитьСвободныйИнтервалЗамеров(ПараметрыНовогоЗамера.ДатаЗамера, ПараметрыНовогоЗамера.ИсполнительЗамера, ПараметрыНовогоЗамера.ВремяНачалаЗамера, ПараметрыНовогоЗамера.ВремяОкончанияЗамера, ОбъектСсылка) Тогда
	//		Возврат Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьПулЗамеров") 
	//	И (ТипЗнч(ПараметрыНовогоЗамера.ИсполнительЗамера) = Тип("Строка") // строка вида "ПланируемыйХХХ"
	//	ИЛИ ВариантОтображенияГрафика = 3 ИЛИ ВариантОтображенияГрафика = 4 
	//	ИЛИ ВариантОтображенияГрафика = 0 ИЛИ ВариантОтображенияГрафика = 1) Тогда // используется вариант Календарь, но есть замеры по "пулу"
	//	КоличествоУникальныхЗамеров = МодульОтчетов.ПолучитьКоличествоЗамеровВИнтервале(ПараметрыНовогоЗамера.ДатаЗамера, ПараметрыНовогоЗамера.ВремяНачалаЗамера, ПараметрыНовогоЗамера.ВремяОкончанияЗамера, ФильтрТочкаПродаж, ОбъектСсылка, Ложь);
	//	КоличествоЗамерщиковПоПлану = МодульОтчетов.ПолучитьКоличествоЗамерщиковПоПлану(ПараметрыНовогоЗамера.ВремяНачалаЗамера, ПараметрыНовогоЗамера.ВремяОкончанияЗамера, ФильтрТочкаПродаж);
	//	Если КоличествоУникальныхЗамеров >= КоличествоЗамерщиковПоПлану Тогда
	//		Возврат Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПереключитьВариантОтображенияГрафика(Команда)
	
	ВариантОтображенияГрафика = ?(ВариантОтображенияГрафика = 2, 1, 2);
	
	Элементы.ГрафикТаблица.Видимость = (ВариантОтображенияГрафика = 2);
	Элементы.ГрафикЗамеров.Видимость = НЕ (ВариантОтображенияГрафика = 2);

	//Элементы.ГрафикВыездовТаблица.Видимость = (ВариантОтображенияГрафика = 2);
	//Элементы.ГрафикВыездов.Видимость = НЕ (ВариантОтображенияГрафика = 2);
	
	Если Элементы.ГруппаСтраницыОсновные.ТекущаяСтраница = Элементы.ГруппаЗамерВыезд Тогда
		ПолучитьПервоначальныеДанныеДляГрафикаЗамеров();
		ОбновитьГрафикЗамеров();
	КонецЕсли;

КонецПроцедуры

//&НаСервере
//Процедура ПолучитьЗаписиИсторииЛидаИзРегистраНаСервере()
//	
//	Если Объект.Ссылка.Пустая() Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ИсторияЛида.Лид КАК Лид,
//	|	ИсторияЛида.Дата КАК Дата,
//	|	ИсторияЛида.Пользователь КАК Пользователь,
//	|	ИсторияЛида.ИДЗаписи КАК ИДЗаписи,
//	|	ИсторияЛида.Комментарий КАК Комментарий
//	|ИЗ
//	|	РегистрСведений.ИсторияЛида КАК ИсторияЛида
//	|ГДЕ
//	|	ИсторияЛида.Лид = &Лид";
//	Запрос.УстановитьПараметр("Лид", Объект.Ссылка);
//	Выборка = Запрос.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл
//		Отбор = Новый Структура;
//		Отбор.Вставить("ИДЗаписи", Выборка.ИДЗаписи);
//		Отбор.Вставить("Дата", Выборка.Дата);
//		НайденныеСтроки = ИсторияЛидаНаФорме.НайтиСтроки(Отбор);
//		Если НайденныеСтроки.Количество() = 0 Тогда
//			СтрокаЗаписи = ИсторияЛидаНаФорме.Добавить();
//		Иначе
//			СтрокаЗаписи = НайденныеСтроки[0];
//		КонецЕсли;
//		
//		СтрокаЗаписи.Дата = Выборка.Дата;
//		СтрокаЗаписи.Пользователь = Выборка.Пользователь;
//		СтрокаЗаписи.ИДЗаписи = Выборка.ИДЗаписи;
//		КомментарийЗаписи = Выборка.Комментарий;
//		
//		//++ #12137
//		КомментарийЗаписи = СтрЗаменить(КомментарийЗаписи, "</a>", "");
//		Поз1 = СтрНайти(КомментарийЗаписи, "<a href = v8:{");
//		Поз2 = СтрНайти(КомментарийЗаписи, "}>");
//		Если Поз1 > 0 И Поз2 > 0 Тогда
//			КомментарийЗаписи = Лев(КомментарийЗаписи, Поз1-1) + Сред(КомментарийЗаписи, Поз2+2);	
//		КонецЕсли;
//		//-- #12137
//		
//		СтрокаЗаписи.Комментарий = КомментарийЗаписи;
//		СтрокаЗаписи.РасширенныйКомментарий = Выборка.Комментарий;
//	КонецЦикла;
//	
//	ИсторияЛидаНаФорме.Сортировать("Дата Возр");
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьИсториюЛида(Команда)
	//ПолучитьЗаписиИсторииЛидаИзРегистраНаСервере();
	Элементы.ИсторияДокумента.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	
	ТелефоныКлиента = УправлениеКонтактнойИнформациейКлиентПотолки.ПолучитьТелефонИзКонтактнойИнформацииФормы(ЭтотОбъект);
	Если ЗначениеЗаполнено(ТелефоныКлиента) Тогда	
		Парам = Новый Структура;
		Парам.Вставить("Основание", Объект.Ссылка);
		ОткрытьФорму("Документ.ОтправкаСМС.Форма.ФормаДокумента", Парам,,,,, Новый ОписаниеОповещения("ПослеЗакрытияФормыНовогоСМС", ЭтаФорма));
	Иначе
		ПоказатьОповещениеПользователя("Не указан номер телефона клиента. СМС не создана");
	КонецЕсли;
	ОбновитьИзображениеКомандОтправкиСообщений();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзображениеКомандОтправкиСообщений()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтправкаСМС.Ссылка,
	|	1 КАК Создано,
	|	ВЫБОР
	|		КОГДА ОтправкаСМС.Отправлено
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Отправлено
	|ИЗ
	|	Документ.ОтправкаСМС КАК ОтправкаСМС
	|ГДЕ
	|	ОтправкаСМС.Основание = &Основание";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() > 0 Тогда
		РезультатЗапроса.Свернуть("", "Создано, Отправлено");
	КонецЕсли;
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Элементы.ОтправитьСМС.Картинка = БиблиотекаКартинок.ОтправитьSMS;
	Иначе
		Если РезультатЗапроса[0].Отправлено >= РезультатЗапроса[0].Создано Тогда
			Элементы.ОтправитьСМС.Картинка = БиблиотекаКартинок.ОтправленоСМС;
		Иначе
			Элементы.ОтправитьСМС.Картинка = БиблиотекаКартинок.ПриготовленоСМС;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыНовогоСМС(РезультатЗакрытия, ДополнительныеПараметры)Экспорт
	ОбновитьИзображениеКомандОтправкиСообщений();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатуИзмененияДанныхКлиента()
	Объект.ДатаИзмененияДанныхКлиента = ТекущаяДатаСеанса();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуСледующегоКонтакта(Команда)
	
	//#11632 реквизит ПоследнееВремяПерезвонить удален
	//ПараметрыФормы = Новый Структура("Дата, Время", Объект.ПоследняяДатаПерезвонить, Объект.ПоследнееВремяПерезвонить);
	ПараметрыФормы = Новый Структура("Дата", Объект.ПоследняяДатаПерезвонить);
	ОписаниеОповещения = новый ОписаниеОповещения("ИзменитьДатуСледующегоКонтактаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.Лид.Форма.ДатаСледующегоКонтакта", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуСледующегоКонтактаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Объект.ПоследняяДатаПерезвонить = Результат.Дата;
		//#15988
		Объект.ПоследнийКомментарий = ?(ПустаяСтрока(Результат.Комментарий), Объект.ПоследнийКомментарий, Результат.Комментарий);
		//#11632 реквизит ПоследнееВремяПерезвонить удален
		//Объект.ПоследнееВремяПерезвонить = ПолученноеЗначение.Время;
		//ДобавитьЗаписьВИсторию("Указана дата следующего контакта: " + Формат(Объект.ПоследняяДатаПерезвонить, "ДЛФ=Д") + " " + Формат(Объект.ПоследнееВремяПерезвонить, "ДЛФ=В") + "." + ?(ЗначениеЗаполнено(ПолученноеЗначение.Комментарий), " Комментарий: " + ПолученноеЗначение.Комментарий, ""));
		ДобавитьЗаписьВИсториюКлиент("Указана дата следующего контакта: " + Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'") + "." + ?(ЗначениеЗаполнено(Результат.Комментарий), " Комментарий: " + Результат.Комментарий, ""));
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДатуСледующегоКонтакта(Команда)
	
	Если ЗначениеЗаполнено(Объект.ПоследняяДатаПерезвонить) Тогда
		
		ОП = новый ОписаниеОповещения("ПослеВопросаОбОчисткеДатыСледующегоКонтакта", ЭтотОбъект);
		ПоказатьВопрос(ОП, "Вы действительно хотите очистить дату следующего контакта?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеДатыСледующегоКонтакта(Ответ, ДопПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	//#11632 реквизит ПоследнееВремяПерезвонить удален
	ДобавитьЗаписьВИсториюКлиент("Отменена дата следующего контакта: " + Формат(Объект.ПоследняяДатаПерезвонить, "ДФ='dd.MM.yyyy HH:mm'")); // + " " + Формат(Объект.ПоследнееВремяПерезвонить, "ДЛФ=В"));
	Объект.ПоследняяДатаПерезвонить = Дата(1,1,1);
	//Объект.ПоследнееВремяПерезвонить = Дата(1,1,1);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДатуСледующегоКонтактаБезЗаписиВИсторию()
	
	Объект.ПоследняяДатаПерезвонить = Дата(1,1,1);
	//#11632 реквизит ПоследнееВремяПерезвонить удален
	//Объект.ПоследнееВремяПерезвонить = Дата(1,1,1);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеСвойства()
	
	//#9756
	ТаблицаДанных = Объект.ДополнительныеСвойстваЛида.Выгрузить();
	МассивСсылок  = ТаблицаДанных.ВыгрузитьКолонку("Свойство");
			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДанных.Свойство КАК Свойство,
	|	ТаблицаДанных.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_Таблица
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Таблица.Свойство КАК Свойство,
	|	ВТ_Таблица.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_Свойства
	|ИЗ
	|	ВТ_Таблица КАК ВТ_Таблица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыДополнительныхСвойствЛида.Ссылка,
	|	""""
	|ИЗ
	|	Справочник.ВидыДополнительныхСвойствЛида КАК ВидыДополнительныхСвойствЛида
	|ГДЕ
	|	НЕ ВидыДополнительныхСвойствЛида.ПометкаУдаления
	|	И НЕ ВидыДополнительныхСвойствЛида.Ссылка В (&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Свойства.Свойство КАК Свойство,
	|	ВТ_Свойства.Значение КАК Значение
	|ИЗ
	|	ВТ_Свойства КАК ВТ_Свойства
	|
	|УПОРЯДОЧИТЬ ПО
	|	Свойство
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТаблицаДополнительныхСвойствЛида.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиДополнительныеСвойстваВТабличнуюЧасть()
	
	Объект.ДополнительныеСвойстваЛида.Очистить();
	Для каждого СтрокаТЗ из ТаблицаДополнительныхСвойствЛида Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.Значение) Тогда	
			НоваяСтрока = Объект.ДополнительныеСвойстваЛида.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресВыездаОтличаетсяОтАдресаЛидаПриИзменении(Элемент)
	
	Объект.АдресВыезда = Объект.Адрес;
	Объект.ГородВыезда = Объект.Город;
	
	//++ №14051 город в выезде может отличаться
	ПолучитьИдентификаторГородаНаселенногоПунктаВыезда();
	//-- №14051
	
	ОбновитьВидимостьЭлементовЗаезды();
	
КонецПроцедуры

&НаКлиенте
Процедура ГородВыездаПриИзменении(Элемент)
	
	//++ №14051 город в выезде может отличаться
	ПолучитьИдентификаторГородаНаселенногоПунктаВыезда();
	//-- №14051
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовЗаезды()
	
	Элементы.ГруппаАдресВыезда.Видимость = Объект.АдресВыездаОтличаетсяОтАдресаЛида;
	Элементы.ГруппаАдресВыездаИзЛида.Видимость = НЕ Объект.АдресВыездаОтличаетсяОтАдресаЛида;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДополнительныхСвойствЛидаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДополнительныхСвойствЛидаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УказатьГеометку(Команда)
	
	ОП = Новый ОписаниеОповещения("ПослеЗакрытияОкнаВыбораГеометки", ЭтотОбъект);
	
	Парам = Новый Структура;
	Парам.Вставить("Город",Объект.Город);
	Парам.Вставить("Адрес",Объект.Адрес);
	Парам.Вставить("ИспользоватьКартыЯндекс",ИспользоватьКартыЯндекс);
	Парам.Вставить("Геометка",Объект.Геометка);
	
	ОткрытьФорму("Документ.Лид.Форма.ФормаУстановкиГеометки", Парам, ЭтаФорма,,,,ОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОкнаВыбораГеометки(ПолученнаяГеометка, ДопПараметры) Экспорт
	
	Если НЕ ПолученнаяГеометка = Неопределено Тогда
		Объект.Геометка = ПолученнаяГеометка;
		Модифицированность = Истина;
	КонецЕсли;
	
	ОбновитьКратинкуКнопкиГеометкиВШапкеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКратинкуКнопкиГеометкиВШапкеДокумента()
	
	Если ПустаяСтрока(Объект.Геометка) Тогда
		Элементы.УказатьГеометку.Картинка = БиблиотекаКартинок.СераяМеткаКарты;
		Элементы.УказатьГеометкуСтраницаЗамера.Картинка = БиблиотекаКартинок.СераяМеткаКарты;
	Иначе
		Элементы.УказатьГеометку.Картинка = БиблиотекаКартинок.КраснаяМеткаКарты;
		Элементы.УказатьГеометкуСтраницаЗамера.Картинка = БиблиотекаКартинок.КраснаяМеткаКарты;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ГеометкаВыезда) Тогда
		Элементы.УказатьГеометкуВыезда.Картинка = БиблиотекаКартинок.СераяМеткаКарты;
	Иначе
		Элементы.УказатьГеометкуВыезда.Картинка = БиблиотекаКартинок.КраснаяМеткаКарты;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьГеометкуВыезда(Команда)
	
	ОП = Новый ОписаниеОповещения("ПослеЗакрытияОкнаВыбораГеометкиВыезда", ЭтотОбъект);
	
	Парам = Новый Структура;
	Парам.Вставить("Город",Объект.ГородВыезда);
	Парам.Вставить("Адрес",Объект.АдресВыезда);
	Парам.Вставить("ИспользоватьКартыЯндекс",ИспользоватьКартыЯндекс);
	Парам.Вставить("Геометка",Объект.ГеометкаВыезда);
	
	ОткрытьФорму("Документ.Лид.Форма.ФормаУстановкиГеометки", Парам, ЭтаФорма,,,,ОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОкнаВыбораГеометкиВыезда(ПолученнаяГеометка, ДопПараметры) Экспорт
	
	Если НЕ ПолученнаяГеометка = Неопределено Тогда
		Объект.ГеометкаВыезда = ПолученнаяГеометка;
		Модифицированность = Истина;
	КонецЕсли;
	
	ОбновитьКратинкуКнопкиГеометкиВШапкеДокумента();
	
КонецПроцедуры

//++ #15368 от 27.01.2023
Процедура ВывестиСписокДоговоров()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказДоговор.Ссылка,
	|	ЗаказДоговор.Номер КАК Номер
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	ЗаказДоговор.Проведен
	|	И ЗаказДоговор.Основание = &Основание
	|	И НЕ ЗаказДоговор.ДоговорРассторгнут";
	Запрос.УстановитьПараметр("Основание",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			НайденныйЭлемент = Элементы.Найти("Договор"+Выборка.Номер);
			Если НайденныйЭлемент = Неопределено Тогда
				ИмяЭлемента = "Договор" + СтрЗаменить(Выборка.Номер, "-", "");
				Элемент = ЭтаФорма.Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ЭтаФорма.Элементы.ГруппаДоговора);
				СтрокаКоманды = ПолучитьНавигационнуюСсылку(Выборка.Ссылка);
				СтрокаСсылкиНаДокумент = Лев(Строка(Выборка.Ссылка), СтрНайти(Строка(Выборка.Ссылка), " ", НаправлениеПоиска.СКонца));
				Элемент.Заголовок = Новый ФорматированнаяСтрока(СтрокаСсылкиНаДокумент,,,,СтрокаКоманды);
			КонецЕсли;
		КонецЦикла;
		Элементы.ДекорацияДоговора.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры;	

//-- #15368 от 27.01.2023
	
////////////////////////////////////////////////////////////

ТекстФайлIni = Новый ТекстовыйДокумент;
