
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаНоменклатурыДляПоиска = Константы.ГруппаНоменклатурыПродукция.Получить();
	Если НЕ Параметры.ПоНомеруДоговора Тогда
		НомерПотолка = ОбщийМодуль.ПолучитьНомерНовогоРасчетаПотолка();
	Иначе
		НомерПотолка = СокрЛП(Параметры.НомерДоговора) + "-" + СтрЗаменить(Строка(Параметры.КоличествоПотолковВДокументе+1), Символ(160),"");
	КонецЕсли;
	ПолучитьНаименованиеПотолка();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Номенклатура.Пустая() Тогда
		Номенклатура = СоздатьНоменклатуруПродукцияНаСервере(НомерПотолка, Цвет, Фактура, Количество);
	КонецЕсли;
	
	Если НЕ Номенклатура.Пустая() И РазрешеноДобавлятьПотолок() Тогда		
				
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("НомерПотолка",НомерПотолка);
		СтруктураОтвета.Вставить("Фактура",Фактура);
		СтруктураОтвета.Вставить("Цвет",Цвет);
		СтруктураОтвета.Вставить("Номенклатура",Номенклатура);
		СтруктураОтвета.Вставить("Количество", Количество);	
		Закрыть(СтруктураОтвета);
			
	КонецЕсли;
		
КонецПроцедуры

//Начало добавлен при переходе на 2.0 - Нужно проверить наличие в ЗП
&НаСервере
Функция РазрешеноДобавлятьПотолок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Номенклатура = &Номенклатура
		|	И НЕ ЗаказПокупателя.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказПокупателя.Ссылка.ТекущийСтатус = Значение(Справочник.СтатусыЗаказовПокупателей.Отменен)";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл
		Сообщить("Внимание! Данный " + Номенклатура + " уже указан в документе " + Выборка.Ссылка + " Добавление отменено.");
	КонецЦикла;
	
	Если Выборка.Количество() > 0 Тогда 
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 	
	
КонецФункции
//Конец добавлен при переходе на 2.0 - Нужно проверить наличие в ЗП

&НаСервере
Процедура ПолучитьНаименованиеПотолка()
	
	НаименованиеПотолка = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(НомерПотолка, Цвет, Фактура);
	
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеПотолка, Истина, ГруппаНоменклатурыДляПоиска);
	Если НЕ Номенклатура.Пустая() Тогда
		
		Элементы.Номенклатура.Видимость = Истина;
		Элементы.НаименованиеПотолка.Видимость = Ложь;
	Иначе
		Элементы.Номенклатура.Видимость = Ложь;
		Элементы.НаименованиеПотолка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПотолкаПриИзменении(Элемент)
	ПолучитьНаименованиеПотолка();
КонецПроцедуры

&НаКлиенте
Процедура ФактураПриИзменении(Элемент)
	ПолучитьНаименованиеПотолка();
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	ПолучитьНаименованиеПотолка();
КонецПроцедуры

&НаСервере
Функция СоздатьНоменклатуруПродукцияНаСервере(НомерПотолка, ЦветФактуры, Фактура, Количество)
	
	БазоваяЕдИзм = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
	Если БазоваяЕдИзм.Пустая() Тогда
		Сообщить("Ошибка!"+Символы.ПС+"В справочнике ""Классификатор единиц измерения"" не найдена единица с наименованием ""м2""");
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Отказ = Ложь;
	Если ПустаяСтрока(НомерПотолка) Тогда
		Отказ = Истина;
		Сообщить("Не указан номер создаваемого потолка");
	КонецЕсли;
	
	//Начало добавлен при переходе на 2.0 - проверка существования номенклатуры по её номеру
	//НайденнаяНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Потолок_НомерРасчета", НомерПотолка);
	//Если НЕ НайденнаяНоменклатура.Пустая() Тогда
	//	Отказ = Истина;
	//	Сообщить("В справочнике уже существует номенклатура " + НайденнаяНоменклатура + " с номером создаваемого потолка");
	//КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	|	И Номенклатура.Потолок_НомерРасчета = &Потолок_НомерРасчета";
	
	Запрос.УстановитьПараметр("Потолок_НомерРасчета", НомерПотолка);	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Отказ = Истина;
		Сообщить("В справочнике уже существует номенклатура " + Выборка.Ссылка + " с номером создаваемого потолка");
	КонецЕсли;
	//Конец добавлен при переходе на 2.0
	
	Если Отказ Тогда
		Сообщить("Номенклатура не создана");
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	НаименованиеНоменклатурыДляСоздания = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(НомерПотолка, ЦветФактуры, Фактура);
	ГруппаНоменклатурыДляСоздания = Константы.ГруппаНоменклатурыПродукция.Получить();
	
	Попытка
		//НоваяЕИСсылка = Справочники.ЕдиницыИзмерений.ПолучитьСсылку(Новый УникальныйИдентификатор); //#10933 закомментировано в рамках заявки №6265
		
		НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
		НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
		НоваяНоменклатура.БазоваяЕдиницаИзмерения = БазоваяЕдИзм.Ссылка;
		НоваяНоменклатура.Наименование = НаименованиеНоменклатурыДляСоздания;
		НоваяНоменклатура.Родитель = ГруппаНоменклатурыДляСоздания;
		НоваяНоменклатура.Потолок_НомерРасчета = НомерПотолка;
		//НоваяНоменклатура.Потолок_КоличествоПродукция = ?(Количество = 0, 1, Количество);
		
		НоваяНоменклатура.Потолок_Фактура.Очистить();
		НоваяСтрока = НоваяНоменклатура.Потолок_Фактура.Добавить();
		НоваяСтрока.Основная = Истина;
		НоваяСтрока.ПродукцияФактура = ЦветФактуры.Владелец;
		НоваяСтрока.ПродукцияЦвет = ЦветФактуры;
		//#5419
		НоваяНоменклатура.Гарантия = НоваяСтрока.ПродукцияФактура.Гарантия;
		
		//НоваяНоменклатура.АльтернативнаяЕдиницаИзмерения = НоваяЕИСсылка;  //#10933 закомментировано в рамках заявки №6265
		
		НоваяНоменклатура.Записать();
		
		//#10933
		//ЕдИзмАльтернативная = Справочники.ЕдиницыИзмерений.СоздатьЭлемент();
		//ЕдИзмАльтернативная.УстановитьСсылкуНового(НоваяЕИСсылка);
		//ЕдИзмАльтернативная.Владелец = НоваяНоменклатура.Ссылка;
		//ЕдИзмАльтернативная.Наименование = Справочники.КлассификаторЕдиницИзмерения.Штука;
		//ЕдИзмАльтернативная.Коэффициент = Количество;
		//ЕдИзмАльтернативная.Записать();
		
		Возврат НоваяНоменклатура.Ссылка;
	Исключение
		Сообщить("Ошибка!" + Символы.ПС + ОписаниеОшибки());
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции
