
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьЗначения();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Пользователь") Тогда
        Пользователь = Параметры.Пользователь;
	Иначе
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
	
	ЗагрузитьЗначения();
	
	Элементы.Группа_КЦ.Видимость = ИА_Защита_Общий.ЛицензияДоступна("КЦ",,истина);
	Элементы.Группа_БП.Видимость = ИА_Защита_Общий.ЛицензияДоступна("БП",,истина);
	Элементы.Группа_ФП.Видимость = ИА_Защита_Общий.ЛицензияДоступна("ФП",,истина);
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначения()
	если Пользователь.Пустая() тогда
		возврат;
	КонецЕсли;
	
	выборка = ПланыВидовХарактеристик.ИА_ПраваПользователей.Выбрать();
	Пока выборка.Следующий() Цикл
		Если не выборка.ЭтоГруппа тогда
			
			Попытка
				знПрава = ЭтаФорма[выборка.ИмяПредопределенныхДанных];
				
				мен = РегистрыСведений.ИА_ПраваЗначения.СоздатьМенеджерЗаписи();
				мен.Пользователь = Пользователь;
				мен.Право = выборка.Ссылка;
				мен.Значение = знПрава;
				мен.Записать(истина);
			Исключение
			КонецПопытки;

		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьЗначения()
	выборка = ПланыВидовХарактеристик.ИА_ПраваПользователей.Выбрать();
	Пока выборка.Следующий() Цикл
		Если не выборка.ЭтоГруппа тогда
			знПрава = ИА_ПраваС.ЗначениеПрава(Пользователь, выборка.Ссылка); 
			
			Попытка
				ЭтаФорма[выборка.ИмяПредопределенныхДанных] = знПрава;
			Исключение
			КонецПопытки;

		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ЗагрузитьЗначения();
	ДоступностьПОПолнымПравам();
КонецПроцедуры

&НаКлиенте
Процедура УтверждениеТБПриИзменении(Элемент)
	Если не УтверждениеТБ тогда
		ФП_ПолныеПрава = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УтверждениеФППриИзменении(Элемент)
	Если не УтверждениеФП тогда
		ФП_ПолныеПрава = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РСФПриИзменении(Элемент)
	Если не РСФ тогда
		ФП_ПолныеПрава = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыплатаНапрямуюСФондовПриИзменении(Элемент)
	Если не ВыплатаНапрямуюСФондов тогда
		ФП_ПолныеПрава = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФП_ОтправкаНаРассмотрениеЗаказаНаФППриИзменении(Элемент)
	Если не ФП_ОтправкаНаРассмотрениеЗаказаНаФП тогда
		ФП_ПолныеПрава = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФП_УтверждениеЗаказовРуководителемПриИзменении(Элемент)
	Если не ФП_УтверждениеЗаказовРуководителем тогда
		ФП_ПолныеПрава = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступностьПОПолнымПравам();
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПОПолнымПравам()
	Элементы.УтверждениеТБ.Доступность = не ФП_ПолныеПрава;
	Элементы.УтверждениеФП.Доступность = не ФП_ПолныеПрава;
	Элементы.РСФ.Доступность = не ФП_ПолныеПрава;
	Элементы.ВыплатаНапрямуюСФондов.Доступность = не ФП_ПолныеПрава;
	Элементы.ФП_ОтправкаНаРассмотрениеЗаказаНаФП.Доступность = не ФП_ПолныеПрава;
	Элементы.ФП_УтверждениеЗаказовРуководителем.Доступность = не ФП_ПолныеПрава;
КонецПроцедуры

&НаКлиенте
Процедура ФП_ПолныеПраваПриИзменении(Элемент)
	ДоступностьПОПолнымПравам();
КонецПроцедуры
