Функция ВыполнитьРасход(Знач ДокументСсылка, Знач Дата, Знач ЗаказПоставщику, Знач Организация, Знач ТаблицаТоваровКСписанию, Отказ) Экспорт
	
	//ТаблицаТоваровКСписанию = РегистрыНакопления.ЗаказыПоставщикам.ПолучитьТоварыКСписанию(Документ.Дата, ЗаказПоставщику, Организация, ТаблицаТовары);
	
	Если НЕ ТаблицаТоваровКСписанию.Итог("Количество") = 0 Тогда
		Попытка
			НаборЗаписей = РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
			НаборЗаписей.Прочитать();
			Для Каждого Товар Из ТаблицаТоваровКСписанию Цикл
				Расход = НаборЗаписей.Добавить();
				Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
				Расход.Период = Дата;
				Расход.ЗаказПоставщику = ЗаказПоставщику;
				Расход.Организация = Организация;
				Расход.Номенклатура = Товар.Номенклатура;
				Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
				Расход.Потолок = Товар.Потолок;
				Расход.Цена = Товар.Цена;
				Расход.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
				Расход.Количество = Товар.Количество * Товар.Коэффициент;
				Расход.Сумма = Товар.Сумма; //#8742
			КонецЦикла;
			НаборЗаписей.Записать();

		Исключение
			Отказ = Истина;
			Сообщить("Ошибка закрытия заказа поставщику по регистру! " + ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьПриход(Знач Документ, Знач Организация, Знач ТаблицаТовары) Экспорт
	
	Результат = Истина;
	СоздатьДвижения = Истина;
	
	Если СоздатьДвижения Тогда
		Попытка
			НаборЗаписей = РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Документ);
			НаборЗаписей.Прочитать();
			Для Каждого Товар Из ТаблицаТовары Цикл
				Приход = НаборЗаписей.Добавить();
				Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
				Приход.Период = Документ.Дата;
				Приход.ЗаказПоставщику = Документ;
				Приход.Организация = Организация;
				Приход.Номенклатура = Товар.Номенклатура;
				Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
				Приход.Цена = Товар.Цена;
				Приход.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
				Приход.Количество = Товар.Количество * Товар.Коэффициент;
				Приход.Потолок = Товар.Потолок;
				Приход.Сумма = Товар.Сумма; //#8742
			КонецЦикла;
			НаборЗаписей.Записать();
		Исключение
			Результат = Ложь;
			Сообщить("Ошибка записи заказа поставщику в регистр! " + ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОчиститьДвижения(Знач ДокументСсылка, Отказ) Экспорт
		
	Попытка
		НаборЗаписей = РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);			
		НаборЗаписей.Записать();
	Исключение
		Отказ = Истина;
		Сообщить("Ошибка записи в регистр ""Заказ поставщику""! " + ОписаниеОшибки(),СтатусСообщения.Важное);
	КонецПопытки;
	
КонецФункции