
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимДобавленияОтреза = Параметры.РежимДобавленияОтреза;
	//РежимДобавленияТиповогоОтреза = Параметры.РежимДобавленияТиповогоОтреза;
	РежимДобавленияОстаткаПленки = Параметры.РежимДобавленияОстаткаПленки;
	РежимДобавленияПотолка = НЕ РежимДобавленияОтреза И НЕ РежимДобавленияТиповогоОтреза И НЕ РежимДобавленияОстаткаПленки;
	
	ГруппаНоменклатурыДляПоиска = Константы.ГруппаНоменклатурыПродукция.Получить();
	
	// #11670 - доработки в рамках заявки
	Если Параметры.ПоНомеруДоговора Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПотолок;
		НомерПотолка = СокрЛП(Параметры.НомерДоговора) + "-" + СтрЗаменить(Строка(Параметры.КоличествоПотолковВДокументе+1), Символ(160),"");
		
	ИначеЕсли РежимДобавленияПотолка Тогда
		Заголовок = "Добавление простого потолка";
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПотолок;
		НомерПотолка = ОбщийМодуль.ПолучитьНомерНовогоРасчета(Справочники.ВидыНоменклатуры.Потолок); // №13851 было: ОбщийМодуль.ПолучитьНомерНовогоРасчетаПотолка();
		
	ИначеЕсли РежимДобавленияОтреза Тогда
		Заголовок = "Добавление отреза";
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОтрез;
		НомерПотолка = ОбщийМодуль.ПолучитьНомерНовогоРасчета(Справочники.ВидыНоменклатуры.Отрез); // №13851 было: ОбщийМодуль.ПолучитьНомерНовогоРасчетаПотолка();
		
	//ИначеЕсли РежимДобавленияТиповогоОтреза Тогда
	//	Заголовок = "Добавление типового отреза";
	//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаТиповойОтрез;
	//	НомерПотолка = ОбменСEasyCeiling.ПолучитьНомерТиповогоОтреза(0, 0);
		
	ИначеЕсли РежимДобавленияОстаткаПленки Тогда
		ГруппаНоменклатурыДляПоиска = Константы.ГруппаНоменклатурыДляОстатков.Получить();
		Заголовок = "Добавление остатка пленки";
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОстатокПленки;		
		НомерПотолка = ОбменСEasyCeiling.ПолучитьНомерОстатковПленки(0, 0);
		
	КонецЕсли;
	
	НомерПотолкаПредыдущий = НомерПотолка; // №13850
	
	Если Параметры.Свойство("Фактура") И Параметры.Свойство("Цвет") Тогда
		Фактура = Параметры.Фактура;	
		Цвет = Параметры.Цвет;
	КонецЕсли;
	Если Параметры.Свойство("Длина") Тогда
		Длина = Параметры.Длина;
	КонецЕсли;
	ПолучитьНаименованиеПродукции();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Фактура) Тогда
		ФактураПриИзменении(Неопределено);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура ВыбратьПоНоменклатуреПолотна(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидНоменклатуры", ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Полотно"));
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормыВыбора.Вставить("Отбор",              Отбор);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПоНоменклатуреПолотнаЗавершение", ЭтотОбъект);	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормыВыбора, ЭтотОБъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПоНоменклатуреПолотнаЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ФактураИЦветПоНоменклатуреПолотнаСервер(ВыбранноеЗначение);
	Если ЗначениеЗаполнено(Результат.Фактура) Тогда
		Фактура = Результат.Фактура;
		Цвет = Результат.ЦветФактуры;
		ФактураПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	//#12089
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Номенклатура.Пустая() Тогда
		Номенклатура = СоздатьНоменклатуруПродукцияНаСервере(НомерПотолка, Цвет, Фактура, Количество, РежимДобавленияПотолка, РежимДобавленияОтреза, РежимДобавленияТиповогоОтреза, РежимДобавленияОстаткаПленки);	
	КонецЕсли;
	
	Если Номенклатура.Пустая() Тогда
		Возврат;	
	КонецЕсли;
	
	//++ №12523 комментируем, т.к. отрез тоже нужно проверять
	//РазрешеноДобавлять = Истина;
	//Если НЕ РежимДобавленияОтреза Тогда
	//-- №12523
		РазрешеноДобавлять = РазрешеноДобавлятьПотолок();
	//КонецЕсли;
	
	Если НЕ Номенклатура.Пустая() И РазрешеноДобавлять Тогда		
				
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("НомерПотолка",НомерПотолка);
		СтруктураОтвета.Вставить("Фактура",Фактура);
		СтруктураОтвета.Вставить("Цвет",Цвет);
		СтруктураОтвета.Вставить("Номенклатура",Номенклатура);
		СтруктураОтвета.Вставить("Количество", Количество);	
		Закрыть(СтруктураОтвета);
			
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НомерПотолкаПриИзменении(Элемент)
	
	//++ №13850 поиск существующей карточки номенклатуры по номеру расчета, если найдётся, то все поля заполняем по ней и делаем все поля только для просмотра
	Если ЗначениеЗаполнено(НомерПотолка) И (РежимДобавленияПотолка Или РежимДобавленияОтреза) Тогда
		
		ВыполнитьПоискСуществующейКарточкиНоменклатуры();
		
	Иначе
	//-- №13850
		
		ПолучитьНаименованиеПродукции();
		НомерПотолкаПредыдущий = НомерПотолка; // №13850
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФактураПриИзменении(Элемент)
	
	ШиринаПолотна = ПолучитьШиринуФактуры(Фактура);
	РассчитатьПлощадь();
	ПриИзмененииПараметровПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	
	ПолучитьНаименованиеПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	ПриИзмененииПараметровПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровПродукции()
	
	//Если РежимДобавленияТиповогоОтреза Тогда
	//	ДлинаТиповогоОтреза  = Формат(Длина, "ЧДЦ=; ЧГ=0");
	//	ШиринаТиповогоОтреза = Формат(ПолучитьШиринуФактуры(Фактура), "ЧДЦ=; ЧГ=0");
	//	НомерПотолка = ОбменСEasyCeiling.ПолучитьНомерТиповогоОтреза(ДлинаТиповогоОтреза, ШиринаТиповогоОтреза);
	//	
	//Иначе
		
	Если РежимДобавленияОстаткаПленки Тогда
		ДлинаОстатка  = Формат(Длина, "ЧДЦ=; ЧГ=0");
		ШиринаОстатка = Формат(ШиринаПолотна, "ЧДЦ=; ЧГ=0");
		НомерПотолка = ОбменСEasyCeiling.ПолучитьНомерОстатковПленки(ДлинаОстатка, ШиринаОстатка);
		
	КонецЕсли;
	ПолучитьНаименованиеПродукции();

КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	
	РассчитатьПлощадь();
	ПриИзмененииПараметровПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)
	
	РассчитатьПлощадь();
	ПриИзмененииПараметровПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлощадьПриИзменении(Элемент)
	
	Если НЕ ШиринаПолотна = 0 Тогда
		Длина = Количество * 10000 / ШиринаПолотна;
		ПриИзмененииПараметровПродукции();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

//Начало добавлен при переходе на 2.0 - Нужно проверить наличие в ЗП
&НаСервере
Функция РазрешеноДобавлятьПотолок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Номенклатура = &Номенклатура
		|	И НЕ ЗаказПокупателя.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказПокупателя.Ссылка.ТекущийСтатус = Значение(Справочник.СтатусыЗаказовПокупателей.Отменен)";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл
		Сообщить("Внимание! Данный " + Номенклатура + " уже указан в документе " + Выборка.Ссылка + " Добавление отменено.");
	КонецЦикла;
	
	Если Выборка.Количество() > 0 Тогда 
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 	
	
КонецФункции
//Конец добавлен при переходе на 2.0 - Нужно проверить наличие в ЗП

&НаСервере
Процедура ПолучитьНаименованиеПродукции()
	
	Если РежимДобавленияПотолка Тогда	
		НаименованиеПотолка = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(НомерПотолка, Цвет, Фактура, , , Фактура.ШиринаПолотна);

	ИначеЕсли РежимДобавленияОтреза Тогда	
		
		//++ №12523
		//НаименованиеПотолка = ОбменСEasyCeiling.ПолучитьНаименованиеОтреза(НомерПотолка, Цвет, Фактура);
		НаименованиеПотолка = ОбменСEasyCeiling.ПолучитьНаименованиеОтреза(НомерПотолка, Цвет, Фактура, Количество);
		//-- №12523

	//ИначеЕсли РежимДобавленияТиповогоОтреза Тогда
	//	НаименованиеПотолка = ОбменСEasyCeiling.ПолучитьНаименованиеТиповогоОтреза(НомерПотолка, Цвет, Фактура);
		
	ИначеЕсли РежимДобавленияОстаткаПленки Тогда
		НаименованиеПотолка = ОбменСEasyCeiling.ПолучитьНаименованиеОстатка(НомерПотолка, Цвет, Фактура);
		
	КонецЕсли;
	
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеПотолка, Истина, ГруппаНоменклатурыДляПоиска);
	
	ОбновитьВидимостьВГруппеНоменклатура();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьВГруппеНоменклатура()
	
	Если НЕ Номенклатура.Пустая() Тогда		
		
		Элементы.Номенклатура.Видимость = Истина;
		Элементы.НаименованиеПотолка.Видимость = Ложь;
		
	Иначе
		
		Элементы.Номенклатура.Видимость = Ложь;
		Элементы.НаименованиеПотолка.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПлощадь()
	
	// площадь в кв.м.
	Количество = (ШиринаПолотна * Длина) / 10000;
	
КонецПроцедуры

&НаСервере
Функция ФактураИЦветПоНоменклатуреПолотнаСервер(ВыбранноеЗначение)

	//Результат = Новый Структура("Фактура, Цвет", Неопределено, Неопределено);
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ЦветФактуры.Ссылка КАК Цвет,
	//|	ЦветФактуры.Владелец КАК Фактура
	//|ИЗ
	//|	Справочник.ЦветФактуры КАК ЦветФактуры
	//|ГДЕ
	//|	ЦветФактуры.Номенклатура = &Номенклатура";
	//
	//Запрос.УстановитьПараметр("Номенклатура", ВыбранноеЗначение);	
	//РезультатЗапроса = Запрос.Выполнить();	
	//Выборка = РезультатЗапроса.Выбрать();	
	//Если Выборка.Следующий() Тогда
	//	ЗаполнитьЗначенияСвойств(Результат, Выборка);	
	//КонецЕсли;
	//
	//Возврат Результат;
	
	Возврат Справочники.ЦветФактуры.ПолучитьЦветИФактуруНоменклатуры(ВыбранноеЗначение);

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШиринуФактуры(Фактура)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Фактура, "ШиринаПолотна");
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьНоменклатуруПродукцияНаСервере(НомерПотолка, ЦветФактуры, Фактура, Количество, РежимДобавленияПотолка, РежимДобавленияОтреза, РежимДобавленияТиповогоОтреза, РежимДобавленияОстаткаПленки)
	
	Если РежимДобавленияОтреза Тогда
		Возврат ОбменСEasyCeiling.ПолучитьНоменклатуруОтреза(НомерПотолка, ЦветФактуры, Количество);
		
	//ИначеЕсли РежимДобавленияТиповогоОтреза Тогда
	//	Возврат ОбменСEasyCeiling.ПолучитьНоменклатуруТиповогоОтреза(НомерПотолка, ЦветФактуры, Количество);
		
	ИначеЕсли РежимДобавленияОстаткаПленки Тогда	
		Возврат ОбменСEasyCeiling.ПолучитьНоменклатуруОстатка(НомерПотолка, ЦветФактуры, Количество);
		
	ИначеЕсли РежимДобавленияПотолка Тогда

		БазоваяЕдИзм = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
		Если БазоваяЕдИзм.Пустая() Тогда
			Сообщить("Ошибка!"+Символы.ПС+"В справочнике ""Классификатор единиц измерения"" не найдена единица с наименованием ""м2""");
			Возврат Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		Возврат ОбменСEasyCeiling.ПолучитьНоменклатуруПростогоПотолка(НомерПотолка, ЦветФактуры);
		
		//Отказ = Ложь;
		//
		////Начало добавлен при переходе на 2.0 - проверка существования номенклатуры по её номеру
		////НайденнаяНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Потолок_НомерРасчета", НомерПотолка);
		////Если НЕ НайденнаяНоменклатура.Пустая() Тогда
		////	Отказ = Истина;
		////	Сообщить("В справочнике уже существует номенклатура " + НайденнаяНоменклатура + " с номером создаваемого потолка");
		////КонецЕсли;
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	Номенклатура.Ссылка КАК Ссылка
		//|ИЗ
		//|	Справочник.Номенклатура КАК Номенклатура
		//|ГДЕ
		//|	Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
		//|	И Номенклатура.Потолок_НомерРасчета = &Потолок_НомерРасчета";
		//
		//Запрос.УстановитьПараметр("Потолок_НомерРасчета", НомерПотолка);	
		//Выборка = Запрос.Выполнить().Выбрать();	
		//Если Выборка.Следующий() Тогда
		//	Отказ = Истина;
		//	Сообщить("В справочнике уже существует номенклатура " + Выборка.Ссылка + " с номером создаваемого потолка");
		//КонецЕсли;
		////Конец добавлен при переходе на 2.0
		//
		//Если Отказ Тогда
		//	Сообщить("Номенклатура не создана");
		//	Возврат Справочники.Номенклатура.ПустаяСсылка();
		//КонецЕсли;
		//
		//НаименованиеНоменклатурыДляСоздания = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(НомерПотолка, ЦветФактуры, Фактура, , , Фактура.ШиринаПолотна);
		//ГруппаНоменклатурыДляСоздания = Константы.ГруппаНоменклатурыПродукция.Получить();
		//
		//Попытка
		//	//НоваяЕИСсылка = Справочники.ЕдиницыИзмерений.ПолучитьСсылку(Новый УникальныйИдентификатор); //#10933 закомментировано в рамках заявки №6265
		//	
		//	НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
		//	НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
		//	НоваяНоменклатура.БазоваяЕдиницаИзмерения = БазоваяЕдИзм.Ссылка;
		//	НоваяНоменклатура.Наименование = НаименованиеНоменклатурыДляСоздания;
		//	НоваяНоменклатура.Родитель = ГруппаНоменклатурыДляСоздания;
		//	НоваяНоменклатура.Потолок_НомерРасчета = НомерПотолка;
		//	//НоваяНоменклатура.Потолок_КоличествоПродукция = ?(Количество = 0, 1, Количество);
		//	
		//	НоваяНоменклатура.Потолок_Фактура.Очистить();
		//	НоваяСтрока = НоваяНоменклатура.Потолок_Фактура.Добавить();
		//	НоваяСтрока.Основная = Истина;
		//	НоваяСтрока.ПродукцияФактура = ЦветФактуры.Владелец;
		//	НоваяСтрока.ПродукцияЦвет = ЦветФактуры;
		//	//#5419
		//	НоваяНоменклатура.Гарантия = НоваяСтрока.ПродукцияФактура.Гарантия;
		//	
		//	//НоваяНоменклатура.АльтернативнаяЕдиницаИзмерения = НоваяЕИСсылка;  //#10933 закомментировано в рамках заявки №6265
		//	
		//	НоваяНоменклатура.Записать();
		//	
		//	//#10933
		//	//ЕдИзмАльтернативная = Справочники.ЕдиницыИзмерений.СоздатьЭлемент();
		//	//ЕдИзмАльтернативная.УстановитьСсылкуНового(НоваяЕИСсылка);
		//	//ЕдИзмАльтернативная.Владелец = НоваяНоменклатура.Ссылка;
		//	//ЕдИзмАльтернативная.Наименование = Справочники.КлассификаторЕдиницИзмерения.Штука;
		//	//ЕдИзмАльтернативная.Коэффициент = Количество;
		//	//ЕдИзмАльтернативная.Записать();
		//	
		//	Возврат НоваяНоменклатура.Ссылка;
		//Исключение
		//	Сообщить("Ошибка!" + Символы.ПС + ОписаниеОшибки());
		//	Возврат Справочники.Номенклатура.ПустаяСсылка();
		//КонецПопытки;
	КонецЕсли;
	
КонецФункции

//++ №13850 поиск существующей карточки номенклатуры по номеру расчета, если найдётся, то все поля заполняем по ней и делаем все поля только для просмотра
&НаСервере
Процедура ВыполнитьПоискСуществующейКарточкиНоменклатуры()
	
	МассивЭлементов = новый Массив;
	
	// По потолку
	МассивЭлементов.Добавить("ГруппаФактура");
	МассивЭлементов.Добавить("Цвет");
	
	// По отрезу
	МассивЭлементов.Добавить("ГруппаФактура1");
	МассивЭлементов.Добавить("Цвет1");
	МассивЭлементов.Добавить("Длина3");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок), 
	|									ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез), 
	|									ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Продукция))
	|	И Номенклатура.Потолок_НомерРасчета = &Потолок_НомерРасчета";
	
	Запрос.УстановитьПараметр("Потолок_НомерРасчета", НомерПотолка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПозицияНайдена = Ложь;
	
	Если Выборка.Следующий() Тогда
		
		// Если добавляем например Потолок, а нашли Отрез, то поля соответственно не заполняем по карточке номенклатуры
		// выводим сообщение и возвращаем номер расчета предыдущий
		Если ((РежимДобавленияПотолка И Выборка.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок)
			Или (РежимДобавленияОтреза И Выборка.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез)) Тогда
		
			ПозицияНайдена = Истина;
		
			Номенклатура = Выборка.Ссылка;
		
			Фактуры = Номенклатура.Потолок_Фактура;
			ШиринаПолотна = 0;
			
			Если Фактуры.Количество() > 0 Тогда
				
				Фактура = Фактуры[0].ПродукцияФактура;
				Цвет = Фактуры[0].ПродукцияЦвет;
				ШиринаПолотна = Фактуры[0].Фактура_ШиринаПолотна;
				
			КонецЕсли;
			
			// для отреза рассчитаем длину
			Если РежимДобавленияОтреза И ШиринаПолотна > 0 Тогда
				
				Длина = ((Номенклатура.Потолок_КоличествоПродукция * 100) / ШиринаПолотна) * 100;
				
				// рассчитываем площадь в кв.м.
				Количество = (ШиринаПолотна * Длина) / 10000;
				
			КонецЕсли;
			
			НомерПотолкаПредыдущий = НомерПотолка;
			
		Иначе
			
			НомерПотолка = НомерПотолкаПредыдущий;
			Сообщить(СтрШаблон("Введенный номер расчёта используется у номенклатуры %1 с видом номенклатуры %2, номер расчёта возвращен к исходному.", Выборка.Ссылка, Выборка.ВидНоменклатуры));
			
		КонецЕсли;
			
	КонецЕсли;
		
	Если НЕ ПозицияНайдена Тогда
		
		НомерПотолкаПредыдущий = НомерПотолка;
		
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		ПолучитьНаименованиеПродукции();
		
	КонецЕсли;
	
	// Меняем свойство "Только просмотр" по результатам поиска
	Для Каждого ЭлементМассива Из МассивЭлементов Цикл
		
		Элементы[ЭлементМассива].ТолькоПросмотр = ПозицияНайдена;
		
	КонецЦикла;
	
	ОбновитьВидимостьВГруппеНоменклатура();
	
КонецПроцедуры
//-- №13850

#КонецОбласти
