
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриПоднятииТрубкиОткрыватьКарточкуКонтрагента = ПараметрыСеанса.ПриПоднятииТрубкиОткрыватьКарточкуКонтрагента;
	ПоднялиТрубку = Ложь;
	
	ИДВАТС = Параметры.ИДВАТС;
	НомерАбонента = Параметры.НомерАбонента;
	//Если Константы.ПриводитьНомераТелефоновУЛидовКЕдиномуПрефиксу.Получить() Тогда
	//	НомерАбонента = ПривестиКЕдиномуПрефиксу(НомерАбонента);
	//КонецЕсли;	
	ВнешняяЛиния = Параметры.ВнешняяЛиния;
	ВнутреннийНомер = Параметры.НашВнутреннийНомер;
	ИДСобытия = Параметры.ИДСобытия;
	ИДСессииСобытия = Параметры.ИДСессииСобытия;

	РекламныйИсточник = ПолучитьРекламныйИсточник(ВнешняяЛиния);
	
	Если ПриПоднятииТрубкиОткрыватьКарточкуКонтрагента Тогда
		
		Если НЕ ПустаяСтрока(НомерАбонента) Тогда
			Если ПравоДоступа("Просмотр", Метаданные.Документы.Лид) Тогда
				Элементы.ЛидИмяКлиента.Видимость = Ложь;
			КонецЕсли;
			
			//ищем контрагентов по номеру телефона
			Контрагенты.Очистить();
			Контрагент = ПолучитьКонтрагентаПоНомеруТелефона(НомерАбонента);
		КонецЕсли;
		
		Если Контрагент.Пустая() Тогда
			Элементы.ДекорацияНадписьНеизместныйНомер.Видимость = Истина;
		Иначе
			Элементы.ДекорацияНадписьНеизместныйНомер.Видимость = Ложь;
		КонецЕсли;
	Иначе
		
		Если НЕ ПустаяСтрока(НомерАбонента) Тогда
			//ищем лид по данному номеру телефона
			Лид = ПолучитьЛидПоНомеруТелефона(НомерАбонента);			
			
			Если НЕ Лид.Пустая() Тогда
				ЛидИмяКлиента = Лид.ИмяКлиента;
			КонецЕсли;
			
			//ищем контрагентов по номеру телефона
			Контрагенты.Очистить();
			Контрагент = ПолучитьКонтрагентаПономеруТелефона(НомерАбонента);
			
		КонецЕсли;
		
		Если Лид.Пустая() И Контрагент.Пустая() Тогда
			Элементы.ДекорацияНадписьНеизместныйНомер.Видимость = Истина;
		Иначе
			Элементы.ДекорацияНадписьНеизместныйНомер.Видимость = Ложь;
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	ДанныеСобытия = Данные;
	
	Если Источник = "SoftPhone" Тогда
		//РАРУС СОФТФОН 3.0
		
		МассивСоответствия = UnJSON(ЗаменитьНедопустимыеСимволыXML(Данные));
		Если МассивСоответствия = Неопределено Тогда
			Возврат;
		ИначеЕсли НЕ (ТипЗнч(МассивСоответствия)  = Тип("Соответствие")) Тогда
			Возврат;
		ИначеЕсли МассивСоответствия.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		СтруктураДанных = Новый Структура();
		Для Каждого ЭлементМассива Из МассивСоответствия Цикл
			СтруктураДанных.Вставить(ЭлементМассива.Ключ, ЭлементМассива.Значение); 
		КонецЦикла;
		
		Если Событие = "OnCallInfoEx" Тогда
			CallerID = СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(СтруктураДанных.CallerID);
			Если СтруктураДанных.State = 0 и СокрЛП(CallerID) = СокрЛП(НомерАбонента) Тогда
				//разрыв звонка (положил трубку клиент или менеджер)
				ЭтаФорма.Закрыть();
			КонецЕсли;
		ИначеЕсли  Событие = "PutSettingsJSON" Тогда	
			//
		ИначеЕсли  Событие = "OnEvent" Тогда
			Если СтруктураДанных.EventType = 0 Тогда
				//подняли трубку
				ДействияПриПоднятииТрубки(ПоднялиТрубку, , НомерАбонента, ВнешняяЛиния);
				
				ЭтаФорма.Закрыть();
			КонецЕсли;
		ИначеЕсли  Событие = "OnEventData" Тогда
			//
		ИначеЕсли  Событие = "OnAllLinesInfo" Тогда
			//
		ИначеЕсли  Событие = "OnLinesStatus" Тогда	
			//
		ИначеЕсли  Событие = "OnRecordInfo" Тогда	
			//
		ИначеЕсли  Событие = "OnResultInfo" Тогда
			//
		ИначеЕсли  Событие = "OnCallInfoCoMagic" Тогда
			//
		КонецЕсли;
		 
	ИначеЕсли Источник = "ROM-Asterisk-Native" Тогда
		
		//SIMPLIT ASTERISK
		ДанныеСобытия=СофтФон.ДанныеВСоответствие(Данные);
		ВидСобытия=ВРег(СокрЛП(ДанныеСобытия.Получить("Event")));
		
		Если ВРег(ВидСобытия) = "HANGUP" Тогда
			
			Если 
				//++ перенесено на Панель телефонии
				//ВариантНастроекТелефонии() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_53") ИЛИ 
				//-- перенесено на Панель телефонии
				ВариантНастроекТелефонии() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_85") ИЛИ
				ВариантНастроекТелефонии() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_85_2") Тогда
				
				//Разорвал канал - положили трубку или разговор окончен - закрываем окно входящего звонка
				CallerIDNum = ДанныеСобытия.Получить("CallerIDNum");
				ConnectedLineNum = ДанныеСобытия.Получить("ConnectedLineNum");
				ConnectedLineNum = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ConnectedLineNum);
				Channel = ДанныеСобытия.Получить("Channel");
				
				Если (СокрЛП(CallerIDNum) = СокрЛП(ВнутреннийНомер) или (СтрНайти(Channel,"SIP/"+ВнутреннийНомер)=1)) и СокрЛП(ConnectedLineNum) = СокрЛП(НомерАбонента) Тогда
					Закрыть();
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ВРег(ВидСобытия) = "BRIDGEENTER" ИЛИ ВРег(ВидСобытия) = "BRIDGE" ИЛИ ВРег(ВидСобытия) = "AGENTCONNECT" Тогда
			
			//++ перенесено на Панель телефонии
			//Если ВариантНастроекТелефонии() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_53") Тогда
			//	Вариант_53(ВидСобытия, ДанныеСобытия);
			//-- перенесено на Панель телефонии
			Если ВариантНастроекТелефонии() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_85") Тогда
				Вариант_85(ВидСобытия, ДанныеСобытия);
			ИначеЕсли ВариантНастроекТелефонии() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_85_2") Тогда
				Вариант_85_2(ВидСобытия, ДанныеСобытия);
	
			//++ перенесено на Панель телефонии
			//ИначеЕсли ВариантНастроекТелефонии() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_93") Тогда
			//	Вариант_93(ВидСобытия, ДанныеСобытия);
			//--
			
			Иначе
				//в настройках не указан вариант настройки IP телефонии Астериск, не реагируем на внешние вызовы.
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытьФормуВходящегоЗвонка" Тогда
		// Параметр = ИДЗвонка или Структура(ИДЗвонка, ИДСессииЗвонка)
		Если ТипЗнч(Параметр) = Тип("Строка") Тогда
			Если Параметр = ИДСобытия 
				ИЛИ (Параметр = ИДСессииСобытия И НЕ ПустаяСтрока(ИДСессииСобытия)) Тогда
				Попытка
					Закрыть();
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		//++ 2022-05-23	
		ИначеЕсли ТипЗнч(Параметр) = Тип("Структура") Тогда	
			Если Параметр.ИДЗвонка = ИДСобытия И Параметр.ИДСессииЗвонка = ИДСессииСобытия Тогда
				Закрыть();
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПоднятиеТрубки_ITooLabs" Тогда

		СтруктураВхПараметров = Параметр; //НомерАбонента, ИДЗвонка
		
		Если СтруктураВхПараметров.ИДЗвонка = ИДСобытия Тогда
			ДействияПриПоднятииТрубки(ПоднялиТрубку, СтруктураВхПараметров.ИДЗвонка, СтруктураВхПараметров.НомерАбонента, ВнешняяЛиния);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПоднятиеТрубки_UIS" Тогда

		СтруктураВхПараметров = Параметр; //НомерАбонента, ИДЗвонка
		
		Если СтруктураВхПараметров.ИДЗвонка = ИДСобытия Тогда
			ДействияПриПоднятииТрубки(ПоднялиТрубку, СтруктураВхПараметров.ИДЗвонка, СтруктураВхПараметров.НомерАбонента, ВнешняяЛиния);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПоднятиеТрубки_Sipuni" Тогда

		СтруктураВхПараметров = Параметр; //НомерАбонента, ИДЗвонка
		
		Если СтруктураВхПараметров.ИДЗвонка = ИДСобытия Тогда
			ДействияПриПоднятииТрубки(ПоднялиТрубку, СтруктураВхПараметров.ИДЗвонка, СтруктураВхПараметров.НомерАбонента, ВнешняяЛиния);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПоднятиеТрубки_Asterisk" Тогда

		СтруктураВхПараметров = Параметр; //НомерАбонента, ИДЗвонка, ИДСессииЗвонка
		
		Если СтруктураВхПараметров.ИДЗвонка = ИДСобытия Тогда
			Если НЕ ПустаяСтрока(СтруктураВхПараметров.ИДСессииЗвонка) И СтруктураВхПараметров.ИДСессииЗвонка = ИДСессииСобытия Тогда
				ДействияПриПоднятииТрубки(ПоднялиТрубку, СтруктураВхПараметров.ИДЗвонка, СтруктураВхПараметров.НомерАбонента, ВнешняяЛиния, ИДСессииСобытия);
			Иначе
				ДействияПриПоднятииТрубки(ПоднялиТрубку, СтруктураВхПараметров.ИДЗвонка, СтруктураВхПараметров.НомерАбонента, ВнешняяЛиния);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПоднятиеТрубки_OnlinePBX" Тогда
		СтруктураВхПараметров = Параметр; //НомерАбонента, ИДЗвонка, ИДСессииЗвонка
		
		Если СтруктураВхПараметров.ИДЗвонка = ИДСобытия 
			ИЛИ (СтруктураВхПараметров.ИДЗвонка = ИДСессииСобытия И НЕ ПустаяСтрока(ИДСессииСобытия)) Тогда
			
			ИДСессииСобытияПоиск = ?(НЕ ПустаяСтрока(СтруктураВхПараметров.ИДСессииЗвонка), СтруктураВхПараметров.ИДСессииЗвонка, ИДСессииСобытия);
			ДействияПриПоднятииТрубки(ПоднялиТрубку, СтруктураВхПараметров.ИДЗвонка, СтруктураВхПараметров.НомерАбонента, ВнешняяЛиния, ИДСессииСобытияПоиск);

		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПоднятиеТрубки_Binotel" Тогда

		СтруктураВхПараметров = Параметр; //НомерАбонента, ИДЗвонка
		
		Если СтруктураВхПараметров.ИДЗвонка = ИДСобытия Тогда
			ДействияПриПоднятииТрубки(ПоднялиТрубку, СтруктураВхПараметров.ИДЗвонка, СтруктураВхПараметров.НомерАбонента, ВнешняяЛиния);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПоднятиеТрубки_Mango" Тогда

		СтруктураВхПараметров = Параметр; //НомерАбонента, ИДЗвонка
		
		Если СтруктураВхПараметров.ИДЗвонка = ИДСобытия Тогда
			ДействияПриПоднятииТрубки(ПоднялиТрубку, СтруктураВхПараметров.ИДЗвонка, СтруктураВхПараметров.НомерАбонента, ВнешняяЛиния);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПоднятиеТрубки_Phonet" Тогда

		СтруктураВхПараметров = Параметр; //НомерАбонента, ИДЗвонка
		
		Если СтруктураВхПараметров.ИДЗвонка = ИДСобытия Тогда
			ДействияПриПоднятииТрубки(ПоднялиТрубку, СтруктураВхПараметров.ИДЗвонка, СтруктураВхПараметров.НомерАбонента, ВнешняяЛиния);
		КонецЕсли;

	ИначеЕсли ИмяСобытия = "ПоднятиеТрубки_Beeline" Тогда

		СтруктураВхПараметров = Параметр; //НомерАбонента, ИДЗвонка
		
		Если СтруктураВхПараметров.ИДЗвонка = ИДСобытия Тогда
			ДействияПриПоднятииТрубки(ПоднялиТрубку, СтруктураВхПараметров.ИДЗвонка, СтруктураВхПараметров.НомерАбонента, ВнешняяЛиния, ИДСессииСобытия);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки(ПоднялиТрубку, 
								  Знач ИДЗвонка=Неопределено, Знач НомерТелефонаАбонента, Знач ВнешняяЛиния, Знач ИДСессииЗвонка = Неопределено)
	
	Если НЕ ПоднялиТрубку Тогда
		// проверим не находится ли телефон в исключениях 
		НомерВИсключениях = СофтФонВызовСервера.НомерТелефонаВИсключениях(НомерТелефонаАбонента);
		//#4889
		Если НЕ НомерВИсключениях И ЗначениеЗаполнено(ВнешняяЛиния) Тогда
			ВнешняяЛинияМФ = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ВнешняяЛиния);
			НомерВИсключениях = СофтФонВызовСервера.НомерТелефонаВИсключениях(ВнешняяЛинияМФ);
		КонецЕсли;
				
		Если НЕ НомерВИсключениях Тогда			
			Если НЕ ПриПоднятииТрубкиОткрыватьКарточкуКонтрагента Тогда
				//#10333 убран реквизит ДатаЗвонкаСоздавшегоЛид
				ДанныеЗвонка = Новый Структура("ИДЗвонка, ИДСессииЗвонка, ИДВАТС, НомерКлиента, ВнешняяЛиния, Пропущен, НовыйЗвонок, ЗвонокОффлайн",
												ИДЗвонка, ИДСессииЗвонка, ИДВАТС, НомерТелефонаАбонента, ВнешняяЛиния, Ложь, Истина, Ложь);
												
				РеквизитыНовогоЛида = Новый Структура("РекламныйИсточник, СпособСоздания", 
										   РекламныйИсточник, ПредопределенноеЗначение("Перечисление.СпособыСозданияЛида.АвтоматическиПриВходящемЗвонке")); //#8090 
				СсылкаНаЛид = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, РеквизитыНовогоЛида, Истина);
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Ключ",СсылкаНаЛид);
				ОткрытьФорму("Документ.Лид.ФормаОбъекта", ПараметрыФормы,,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.Независимый);
			Иначе
				Если НЕ Контрагент.Пустая() Тогда
					ПараметрыФормы = Новый Структура;
					ПараметрыФормы.Вставить("Ключ", Контрагент);
					ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта",ПараметрыФормы,,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.Независимый);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ПоднялиТрубку = Истина;
	КонецЕсли;
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРекламныйИсточник(РекламныйНомер)
	Возврат Справочники.РекламныеИсточники.ПолучитьРекламныйИсточникПоНомеруТелефонаНаСервере(РекламныйНомер); 
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКонтрагентаПоНомеруТелефона(НомерАбонента)
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка,
	|	КонтрагентыКонтактнаяИнформация.Ссылка.ВидКонтрагента КАК ВидКонтрагента
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона ПОДОБНО &НомерАбонента";
	Запрос.УстановитьПараметр("НомерАбонента", СофтФон.ОставитьТолькоЦифры(НомерАбонента));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Контрагент = Выборка.Ссылка;		
	КонецЦикла;
	
	Возврат Контрагент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛидПоНомеруТелефона(НомерАбонента)
	
	Лид = Документы.Лиды.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Ссылка
	|ИЗ
	|	Документ.Лид.ДополнительнаяКонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.НомерТелефона ПОДОБНО &НомерАбонента";
	Запрос.УстановитьПараметр("НомерАбонента", СофтФон.ОставитьТолькоЦифры(НомерАбонента));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Лид = Выборка.Ссылка;		
	КонецЦикла;
	
	Возврат Лид;
	
КонецФункции

#КонецОбласти

//========================= ПРОЦЕДУРЫ ОБРАБОТКИ СОБЫТИЙ АСТИЕРИСК В ЗАВИСИМОСТИ ОТ ВАРИАНТА =============================================================
&НаСервере
Функция ВариантНастроекТелефонии()
	Возврат ПараметрыСеанса.ВариантНастроекТелефонии;
КонецФункции

&НаКлиенте
Процедура Вариант_85(ВидСобытия, ДанныеСобытия)
	
	//вариант БЕЗ использования очередей
	Если ВРег(ВидСобытия) = "BRIDGEENTER" Тогда
		
		//создался канал между 2 мя - подняли трубку и начали разговор. Тут создаем документ "лид" (КОГДА НЕТ ОЧЕРЕДЕЙ)
		CallerIDNum = ДанныеСобытия.Получить("CallerIDNum");
		ConnectedLineNum = ДанныеСобытия.Получить("ConnectedLineNum");
		ConnectedLineNum = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ConnectedLineNum);
		
		Если СокрЛП(CallerIDNum) = СокрЛП(ВнутреннийНомер) и СокрЛП(ConnectedLineNum) = СокрЛП(НомерАбонента) Тогда
			
			времИДсобытия = ДанныеСобытия.Получить("Linkedid");
			
			ДействияПриПоднятииТрубки(ПоднялиТрубку, времИДсобытия, НомерАбонента, ВнешняяЛиния);
			
			Попытка
				ЭтаФорма.Закрыть();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Вариант_85_2(ВидСобытия, ДанныеСобытия)
	                         
	Если ВРег(ВидСобытия) = "AGENTCONNECT" Тогда
		
		//создался канал между 2 мя - подняли трубку и начали разговор
		Interface = ДанныеСобытия.Получить("Interface"); //внутренний номер пользователя в формате "SIP/ВнутреннийНомер"
		CallerIDNum = ДанныеСобытия.Получить("CallerIDNum"); //номер телефона клиента (кто звонит)
		CallerIDNum = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(CallerIDNum);
		
		Если СокрЛП(Interface) = "SIP/"+СокрЛП(ВнутреннийНомер) и СокрЛП(CallerIDNum) = СокрЛП(НомерАбонента) Тогда
			
			времИДсобытия = ДанныеСобытия.Получить("Linkedid");
			
			ДействияПриПоднятииТрубки(ПоднялиТрубку, времИДсобытия, НомерАбонента, ВнешняяЛиния);
			
			Попытка
				ЭтаФорма.Закрыть();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//========================= //ПРОЦЕДУРЫ ОБРАБОТКИ СОБЫТИЙ АСТИЕРИСК В ЗАВИСИМОСТИ ОТ ВАРИАНТА =============================================================

//========================= СЛУЖЕБНЫЕ ПРОЦЕДУРЫ РАЗБОРА СТРУКТУРЫ ДАННЫХ СОБЫТИЯ РАРУС СОФТФОН =============================================================

// Функция получает описание объекта из модели JSON 
//
// Параметры:
//  СтрJSON	- Строка	- Описание объекта в виде модели json
//
// Возвращаемое значение:
//  Значение	- Соответствие	- Соответствие свойств и значений объекта 
//
Функция UnJSON(СтрJSON) Экспорт 
	СтрJSON	= ЗаменитьНедопустимыеСимволыXML(СтрJSON);	
	Значение = "";
	Если ПолучитьЗначениеJSON(СтрJSON, Значение) = 0 Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции // сфпUnJSON()

// Функция заменяет недопустимые символы в XML-строке на заданные символы
//
// Параметры:
//   Текст			– Строка	– Строка, в которой требуется выполнить замену недопустимых символов.
//   СимволЗамены	– Строка	– Строка, на которую требуется выполнить замену недопустимого символа в XML-строке
// 
//  Возвращаемое значение:
//    Строка - Строка, полученная заменой недопустимых символов в XML-строке.
//
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") Экспорт
	ПозицияНачала = 1;
	Пока Истина Цикл
		Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
		Если Позиция = 0 Тогда
			Прервать;
		КонецЕсли;
		Если Позиция > 1 Тогда
			НедопустимыйСимвол = Сред(Текст, Позиция - 1, 1);
			Если НайтиНедопустимыеСимволыXML(НедопустимыйСимвол) > 0 Тогда
				Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
			КонецЕсли;
		КонецЕсли;
		НедопустимыйСимвол = Сред(Текст, Позиция, 1);
		Если НайтиНедопустимыеСимволыXML(НедопустимыйСимвол) > 0 Тогда
			Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
		КонецЕсли;
		ПозицияНачала = Позиция + 1;
	КонецЦикла;
	Возврат Текст;
КонецФункции // сфпЗаменитьНедопустимыеСимволыXML()

// Вспомогательная функция перевода шестнацатиричного числа в десятичное 
//
// Параметры:
//	Hex	- Строка	- Число в шестнадцатиричном представлении
//
// Возвращаемое значение:
//	Число	- Десятичное число
//
Функция Hex2Число(Hex) 
	Стр	= ВРег(СокрЛП(Hex));
	Dec	= 0;
	Для Х = 1 По СтрДлина(Стр) Цикл
		Dec	= Dec + Найти("123456789ABCDEF", Сред(Стр, Х, 1)) * Pow(16, СтрДлина(Стр) - Х);
	КонецЦикла;
	Возврат Dec;
КонецФункции

// Функция осуществляет непосредственный разбор JSON 
//
// Параметры:
//  СтрJSON		- Строка		- Описание объекта в виде модели json
//  Значение	- Соответствие	- Соответствие свойств и значений объекта 
//	Позиция		- Число			- Позиция в описании
//	Ключ		- Строка		- Ключ соответствия
//
// Возвращаемое значение:
//  Число	- Позиция в описании
//
Функция ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция = 1, Ключ = "") Экспорт
	Кавычка			= "";
	ЗначениеВСтроке	= "";
	Кавычек			= 0;
	Комментарий		= Ложь;
	Строка			= Ложь;
	Пока Позиция <= СтрДлина(СтрJSON) Цикл
		ХХ		= Сред(СтрJSON, Позиция, 2);
		Х		= Лев(ХХ,1);
		Позиция	= Позиция + 1;
		Если Х > " " ИЛИ Строка Тогда // Отсекаем всякий хлам
			Если Комментарий Тогда
				// Это комментарий. Крутимся в цикле пока не встретится конец комментария
				Если ХХ = "*/" Тогда
					// Комментарий закончился
					Комментарий	= Ложь;
					Позиция		= Позиция + 1;
				КонецЕсли;
			ИначеЕсли Х = "\" Тогда
				Позиция	= Позиция + 1;
				ХХ		= ВРег(ХХ);
				Если ХХ = "\""" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + """";
				ИначеЕсли ХХ = "\\" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + "\";
				ИначеЕсли ХХ = "\/" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + "/";
				ИначеЕсли ХХ = "\B" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символ(8);
				ИначеЕсли ХХ = "\F" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ПФ; // Перевод формы (страницы)
				ИначеЕсли ХХ = "\N" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ПС; // Перевод строки
				ИначеЕсли ХХ = "\R" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ВК; // Возврат каретки
				ИначеЕсли ХХ = "\T" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ВТаб; // Символ вертикальной табуляции
				ИначеЕсли ХХ = "\U" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символ(Hex2Число(Сред(СтрJSON, Позиция, 4))); // Шестнадцатиричное число
					Позиция = Позиция + 4;
				КонецЕсли;
			ИначеЕсли Строка Тогда
				// Если строка не закончилась, то пропускаем управляющие символы
				Если Х = Кавычка Тогда
					//Закончилась строка
					Строка	= Ложь;
					Кавычек	= Кавычек + 1;
				Иначе
					ЗначениеВСтроке	= ЗначениеВСтроке + Х;
				КонецЕсли;
			ИначеЕсли ХХ = "/*" Тогда
				// Начался комментарий
				Комментарий	= Истина;
				Позиция		= Позиция + 1;
			ИначеЕсли Найти("""'{}[]:,", Х) > 0 Тогда
				Если (Х = """") ИЛИ (Х = "'") Тогда
					// Началась строка
					// Строка - коллекция нуля или больше символов Unicode, заключенная в
					// двойные кавычки, используя "\" в качестве символа экранирования.
					// Символ представляется как односимвольная строка.
					// Похожий синтаксис используется в C и Java.
					Строка	= Истина;
					Кавычка	= Х;
					Кавычек	= Кавычек + 1;
				ИначеЕсли Х = "{" Тогда
					// Начался объект
					// Объект - неупорядоченный набор пар ключ/значение.
					// Объект начинается с "{" и заканчивается "}".
					// Каждое имя сопровождается ":", пары ключ/значение разделяются ",".
					вОбъект	= Новый Соответствие;
					Пока Истина Цикл
						// Получим ключ и значение
						Ключ	= "";
						Режим	= ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция, Ключ);
						// 0 - есть значение и не конец объекта (запятая)
						// 1 - есть значение и конец объекта
						// 2 - нет значения и не конец объекта (запятая)
						// 3 - нет значения и конец объекта
						Если Режим = 0 Тогда
							вОбъект.Вставить(Ключ, Значение);
						ИначеЕсли Режим = 1 Тогда
							вОбъект.Вставить(Ключ, Значение);
							Прервать;
						ИначеЕсли Режим = 3 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Значение	= вОбъект;
					Возврат 0;
				ИначеЕсли Х = "[" Тогда
					// Начался массив
					// Массив - упорядоченная коллекция значений.
					// Массив начинается с "[" и заканчивается "]".
					// Значения разделены ",".
					Массив	= Новый Массив;
					Пока Истина Цикл
						Режим	= ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция);
						// 0 - есть значение и не конец массива (запятая)
						// 1 - есть значение и конец массива
						// 2 - нет значения и не конец массива (запятая)
						// 3 - нет значения и конец массива
						Если Режим = 0 Тогда
							Массив.Добавить(Значение);
						ИначеЕсли Режим = 1 Тогда
							Массив.Добавить(Значение);
							Прервать;
						ИначеЕсли Режим = 3 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Значение	= Массив;
					Возврат 0;
				ИначеЕсли (Х = "]") ИЛИ (Х = "}") Тогда
					// Закончился массив/объект
					Если (ЗначениеВСтроке = "") И (Кавычек = 0) Тогда
						Возврат 3; // Нет значения и конец массива/объекта
					Иначе
						Значение	= ПолучитьЗначениеИзСтроки(ЗначениеВСтроке,Кавычек);
						Возврат 1; // Есть значение и конец массива/объекта
					КонецЕсли;
				ИначеЕсли Х = ":" Тогда
					Ключ	= ЗначениеВСтроке;
					Возврат ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция);
				Иначе
					// Запятая
					Прервать;
				КонецЕсли;
			Иначе
				ЗначениеВСтроке	= ЗначениеВСтроке + Х;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Кавычек > 0 Тогда
		Значение = ЗначениеВКавычках(ЗначениеВСтроке);
	Иначе
		Если ЗначениеВСтроке = "" Тогда
			Возврат 2;
		Иначе
			Значение	= ЗначениеБезКавычек(ЗначениеВСтроке);
		КонецЕсли;
	КонецЕсли;
	Возврат 0;
КонецФункции 

// Функция получает значение из строки
//
// Параметры:
//	ЗначениеВСтроке	- Строка	- Строка, содержащая значение
//	Кавычек			- Число		- Количество кавычек в строке
//
// Возвращаемое значение:
//	Произвольный	- Значение из строки
//
Функция ПолучитьЗначениеИзСтроки(ЗначениеВСтроке, Кавычек)
	Если ЗначениеВСтроке = "" Тогда
		Возврат Неопределено;
	ИначеЕсли Кавычек > 0 Тогда
		Возврат ЗначениеВКавычках(ЗначениеВСтроке);
	Иначе
		Возврат ЗначениеБезКавычек(ЗначениеВСтроке);
	КонецЕсли;
КонецФункции

// Функция получает значение из строки без кавычек
//
// Параметры:
//	ЗначениеВСтроке	- Строка	- Строка, содержащая значение
//
// Возвращаемое значение:
//	Строка	- Значение из строки
//
Функция ЗначениеВКавычках(ЗначениеВСтроке)
	Возврат ЗначениеВСтроке;
КонецФункции 

// Функция получает значение из строки с кавычками
//
// Параметры:
//	ЗначениеВСтроке	- Строка	- Строка, содержащая значение
//
// Возвращаемое значение:
//	Произвольный	- Значение из строки
//
Функция ЗначениеБезКавычек(ЗначениеВСтроке)
	// Это число, булево или null.
	// Хотя здесь могут быть и строки. Например: {Code:123}
	Стр = ВРег(ЗначениеВСтроке);
	Если Стр = "TRUE" Тогда
		Возврат Истина;
	ИначеЕсли Стр = "FALSE" Тогда
		Возврат Ложь;
	ИначеЕсли Стр = "NULL" Тогда
		Возврат Неопределено;
	КонецЕсли;
	// Пробежимся по предполагаемому "числу"
	Экспонента	= Ложь;
	ХХ			= " ";
	Для Индекс = 1 По СтрДлина(Стр) Цикл
		Х = Сред(Стр, Индекс, 1);
		Если Найти("0123456789.+-", Х) Тогда
			ХХ = ХХ + Х;
		ИначеЕсли Х = "E" Тогда
			#Если ВебКлиент Тогда
				Возврат ЗначениеВСтроке;
			#Иначе
				Экспонента = Истина;
				УУ = XMLЗначение(Тип("Число"),ХХ);
				ХХ = " ";
			#КонецЕсли
		Иначе
			// Это не число, а строка
			Возврат ЗначениеВСтроке;
		КонецЕсли;
	КонецЦикла;
	#Если ВебКлиент Тогда
		Попытка
			ХХ = Число(ХХ);
		Исключение
		КонецПопытки;	
	#Иначе
		ХХ = XMLЗначение(Тип("Число"), ХХ);
		Если Экспонента Тогда
			ХХ = УУ * Pow(10, ХХ);
		КонецЕсли;
	#КонецЕсли
	Возврат ХХ;
КонецФункции

//========================= //СЛУЖЕБНЫЕ ПРОЦЕДУРЫ РАЗБОРА СТРУКТУРЫ ДАННЫХ СОБЫТИЯ РАРУС СОФТФОН =============================================================
