
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьСписокГородовОбработчикОжидания", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокГородовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//ВыбратьКлиент();

КонецПроцедуры

&НаКлиенте
Процедура СписокГородовПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокГородов.ТекущиеДанные;
	
	ВыбранныеГорода = "";
	// запоминаем состояние пометок
	СтрокиСубъектов = СписокГородовИсходный.ПолучитьЭлементы();
	Для каждого СтрокаСубъекта из СтрокиСубъектов Цикл
		СтрокиГНП = СтрокаСубъекта.ПолучитьЭлементы();
		Для каждого СтрокаГНП из СтрокиГНП Цикл
			Если СтрокаГНП.Город = ТекущиеДанные.Город И СтрокаГНП.УИ = ТекущиеДанные.УИ Тогда
				СтрокаГНП.Пометка = ТекущиеДанные.Пометка;
			КонецЕсли;
			Если СтрокаГНП.Пометка Тогда
				ВыбранныеГорода = ВыбранныеГорода + ?(ПустаяСтрока(ВыбранныеГорода), "", "; ") + СтрокаГНП.Город;
			КонецЕсли;
			
			СтрокиПодчиненныхГНП = СтрокаГНП.ПолучитьЭлементы();
			Для каждого СтрокаПГНП из СтрокиПодчиненныхГНП Цикл
				Если СтрокаПГНП.Город = ТекущиеДанные.Город И СтрокаПГНП.УИ = ТекущиеДанные.УИ Тогда
					СтрокаПГНП.Пометка = ТекущиеДанные.Пометка;
				КонецЕсли;
				Если СтрокаПГНП.Пометка Тогда
					ВыбранныеГорода = ВыбранныеГорода + ?(ПустаяСтрока(ВыбранныеГорода), "", "; ") + СтрокаПГНП.Город;
				КонецЕсли;
			КонецЦикла;			
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	ТекстПоиска = ?(ПустаяСтрока(Текст), Найти, Текст);
	ПодключитьОбработчикОжидания("НайтиИЗаполнитьСписокГородов", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаполнитьСписок();
	
	СтрокиСубъектов = СписокГородов.ПолучитьЭлементы();
	Для каждого СтрокаСубъекта из СтрокиСубъектов Цикл
		Элементы.СписокГородов.Свернуть(СтрокаСубъекта.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиИЗаполнитьСписокГородов()
	
	ЗаполнитьСписок(ТекстПоиска);
	
	СтрокиСубъектов = СписокГородов.ПолучитьЭлементы();
	Для каждого СтрокаСубъекта из СтрокиСубъектов Цикл
		Элементы.СписокГородов.Развернуть(СтрокаСубъекта.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбратьКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКлиент()
	
	Результат = Новый Массив;
	
	СтрокиСубъектов = СписокГородовИсходный.ПолучитьЭлементы();
	Для каждого СтрокаСубъекта из СтрокиСубъектов Цикл
		СтрокиГородов = СтрокаСубъекта.ПолучитьЭлементы();
		Для каждого СтрокаГорода из СтрокиГородов Цикл
			Если СтрокаГорода.Пометка Тогда
				Результат.Добавить(Новый Структура("Город, КодКЛАДР", СтрокаГорода.Город, СтрокаГорода.КодКЛАДР));
			КонецЕсли;
			
			СтрокиПодчиненных = СтрокаГорода.ПолучитьЭлементы();
			Для каждого СтрокаПодчиненная из СтрокиПодчиненных Цикл
				Если СтрокаПодчиненная.Пометка Тогда
					Результат.Добавить(Новый Структура("Город, КодКЛАДР", СтрокаПодчиненная.Город, СтрокаПодчиненная.КодКЛАДР));
				КонецЕсли;
			КонецЦикла;
		
		КонецЦикла;
	КонецЦикла;
	
	Закрыть(Новый Структура("Города, ИспользуетсяВРознице, ИспользуетсяВПроизводстве", Результат, ИспользуетсяВРознице, ИспользуетсяВПроизводстве));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокГородов(Команда)
	
	ОбновитьСписокГородовОбработчикОжидания();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКлассификатор(Команда)
	АдресныйКлассификаторКлиент.ЗагрузитьАдресныйКлассификатор();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// оформление строки 
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокГородовГород.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокГородов.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// оформление строки 
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокГородовСубъектРФ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокГородов.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	// оформление строки 
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокГородовПометка.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокГородов.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// оформление строки 
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокГородовСубъектРФ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокГородов.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина)); // жирным
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокГородовОбработчикОжидания()
	
	//ОбновитьСписокГородовСервер();
	
	Элементы.ГруппаФоновоеЗаполнение.Видимость = Истина;
	
	ПараметрыОбмена = Новый Структура;
	
	ДлительнаяОперация = ВыполнитьЗаполнениеНаСервере(ПараметрыОбмена);
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииОперацииЗаполнения", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
		
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗаполнениеНаСервере(ПараметрыОбмена)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение списка городов'");
	
	Результат = ДлительныеОперации.ВыполнитьВФоне("Справочники.Города.ЗаполнитьСписокГородовИнтерактивно", ПараметрыОбмена, ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииОперацииЗаполнения(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ГруппаФоновоеЗаполнение.Видимость = Ложь;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
			
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Заполнение прервано по причине:
				|%1'"),
			Результат.КраткоеПредставлениеОшибки);
			
		Сообщить(ТекстОшибки);
		
		Возврат;
	КонецЕсли;

	ОбработатьРезультатЗаполненияГородовНаСервере(Результат.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатЗаполненияГородовНаСервере(АдресРезультата)
	
	Данные = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если НЕ ЗначениеЗаполнено(Данные) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Данные.ДеревоГородов, "СписокГородов");
	ЗначениеВРеквизитФормы(Данные.ДеревоГородов, "СписокГородовИсходный");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок(ТекстПоиска = "")
	
	ДеревоОригинал = РеквизитФормыВЗначение("СписокГородовИсходный");
	ДеревоГородов = РеквизитФормыВЗначение("СписокГородов");
	// Замещаем основное дерево, данными из оригинала
	ДеревоГородов = ДеревоОригинал.Скопировать(); 
	
	Если ТекстПоиска = "" Тогда		
		ЗначениеВРеквизитФормы(ДеревоГородов, "СписокГородов");
		Возврат;		
	КонецЕсли;
	
	// Надо поставить отбор
	СтрокиСубъектов = ДеревоГородов.Строки;
		
	Для Каждого СтрокаСубъекта Из СтрокиСубъектов Цикл
		
		СтрокиКУдалению = Новый Массив;
		
		СтрокиГНП = СтрокаСубъекта.Строки;
		Для каждого СтрокаГНП из СтрокиГНП Цикл
			
			ЕстьВПодчиненных = Ложь;
			СтрокиКУдалениюПодч = Новый Массив;
			СтрокиПодчиненных = СтрокаГНП.Строки;
			Для каждого СтрокаПодчиненных из СтрокиПодчиненных Цикл			
				Если СтрНайти(НРег(СтрокаПодчиненных.Город), НРег(ТекстПоиска)) = 0 Тогда				
					СтрокиКУдалениюПодч.Добавить(СтрокаПодчиненных);
				Иначе
					ЕстьВПодчиненных = Истина;
				КонецЕсли;		
			КонецЦикла;
			Для Каждого СтрокаКУдалению Из СтрокиКУдалениюПодч Цикл				
				СтрокиПодчиненных.Удалить(СтрокаКУдалению);				
			КонецЦикла;
			
			Если ЕстьВПодчиненных Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрНайти(НРег(СтрокаГНП.Город), НРег(ТекстПоиска)) = 0 Тогда				
				СтрокиКУдалению.Добавить(СтрокаГНП);
			КонецЕсли;		
		КонецЦикла;			
			
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл				
			СтрокиГНП.Удалить(СтрокаКУдалению);				
		КонецЦикла;
			
	КонецЦикла;
	
	// Передаем на форму, наше обновленное дерево
	ЗначениеВРеквизитФормы(ДеревоГородов, "СписокГородов");
	
КонецПроцедуры

#КонецОбласти



