
&НаКлиенте
Процедура КомандаОК(Команда)
	
	ОбработкаВыбора();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоИсточника()

	Дерево = РеквизитФормыВЗначение("ДеревоИсточников");
	
	НоваяСтрокаКорень = Дерево.Строки.Добавить();
	НоваяСтрокаКорень.Представление = "Документы";
	
	Для Каждого МетаданныеДокумент Из Метаданные.Документы Цикл
			
		//Если ПроверитьДокументТЧ(МетаданныеДокумент) Тогда
			Документ = НоваяСтрокаКорень.Строки.Добавить();
			Документ.Представление = МетаданныеДокумент.Представление();
			Документ.Имя = "Документ." + МетаданныеДокумент.Имя;
		//КонецЕсли;	
		
		Для каждого тч из МетаданныеДокумент.ТабличныеЧасти Цикл
			//Если ПроверитьДокументТЧ(тч) Тогда
				ТабЧасть = НоваяСтрокаКорень.Строки.Добавить();
				ТабЧасть.Представление = МетаданныеДокумент.Представление() + " > " + тч.Представление() + " (таб. часть)";
				ТабЧасть.Имя = "Документ." + МетаданныеДокумент.Имя + "." + тч.Имя;	
			//КонецЕсли; 			
		КонецЦикла;	
	КонецЦикла;
	
	НоваяСтрокаКорень = Дерево.Строки.Добавить();
	НоваяСтрокаКорень.Представление = "Регистры сведений";

	Для Каждого МетаданныеРегистр Из Метаданные.РегистрыСведений Цикл

		//Если Не ПроверитьРегистр(МетаданныеРегистр) Тогда
		//	Продолжить;	
		//КонецЕсли;
		
		Регистр = НоваяСтрокаКорень.Строки.Добавить();
		Регистр.Представление = МетаданныеРегистр.Представление();
		Регистр.Имя = "РегистрСведений." + МетаданныеРегистр.Имя;
		Если Не МетаданныеРегистр.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			//Регистр = НоваяСтрокаКорень.Строки.Добавить();
			//Регистр.Представление = МетаданныеРегистр.Представление() + " (срез первых)";
			//Регистр.Имя = "РегистрСведений." + МетаданныеРегистр.Имя + ".СрезПервых";
			Регистр = НоваяСтрокаКорень.Строки.Добавить();
			Регистр.Представление = МетаданныеРегистр.Представление() + " (срез последних)";
			Регистр.Имя = "РегистрСведений." + МетаданныеРегистр.Имя + ".СрезПоследних";
		КонецЕсли;	
	КонецЦикла;
	
	НоваяСтрокаКорень = Дерево.Строки.Добавить();
	НоваяСтрокаКорень.Представление = "Регистры накопления";

	Для Каждого МетаданныеРегистр Из Метаданные.РегистрыНакопления Цикл

		//Если Не ПроверитьРегистр(МетаданныеРегистр) Тогда
		//	Продолжить;		
		//КонецЕсли; 		
		
		Регистр = НоваяСтрокаКорень.Строки.Добавить();
		Регистр.Представление = МетаданныеРегистр.Представление();
		Регистр.Имя = "РегистрНакопления." + МетаданныеРегистр.Имя;
		Если МетаданныеРегистр.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Обороты Тогда
			Регистр = НоваяСтрокаКорень.Строки.Добавить();
			Регистр.Представление = МетаданныеРегистр.Представление() + " (обороты)";
			Регистр.Имя = "РегистрНакопления." + МетаданныеРегистр.Имя + ".Обороты";
		ИначеЕсли МетаданныеРегистр.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
			Регистр = НоваяСтрокаКорень.Строки.Добавить();
			Регистр.Представление = МетаданныеРегистр.Представление() + " (обороты)";
			Регистр.Имя = "РегистрНакопления." + МетаданныеРегистр.Имя + ".Обороты";
			Регистр = НоваяСтрокаКорень.Строки.Добавить();
			Регистр.Представление = МетаданныеРегистр.Представление() + " (остатки)";
			Регистр.Имя = "РегистрНакопления." + МетаданныеРегистр.Имя + ".Остатки";
			//Регистр = НоваяСтрокаКорень.Строки.Добавить();
			//Регистр.Представление = МетаданныеРегистр.Представление() + " (остатки и обороты)";
			//Регистр.Имя = "РегистрНакопления." + МетаданныеРегистр.Имя + ".ОстаткиИОбороты";
		КонецЕсли;	
			
	КонецЦикла;
		
	ЗначениеВРеквизитФормы(Дерево, "ДеревоИсточников");
КонецПроцедуры

//&НаСервере
//Функция ПроверитьДокументТЧ(МетаданныеДокумент)
//	
//	// Проверяем типы полей
//	ЕстьКонтрагент = Ложь;
//	ЕстьСтатьяДвДенежныхСредств = Ложь;
//	ЕстьЧисло = Ложь;
//	Для каждого Реквизит из МетаданныеДокумент.Реквизиты Цикл
//		Если Реквизит.Тип.СодержитТип(Тип("СправочникСсылка.Контрагенты"))
//			И Реквизит.Тип.Типы().Количество() = 1 И Не ЕстьКонтрагент Тогда
//			ЕстьКонтрагент = Истина;
//		КонецЕсли;
//		Если Реквизит.Тип.СодержитТип(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"))
//			И Реквизит.Тип.Типы().Количество() = 1 И Не ЕстьСтатьяДвДенежныхСредств Тогда
//			ЕстьСтатьяДвДенежныхСредств = Истина;
//		КонецЕсли;
//		Если Реквизит.Тип.СодержитТип(Тип("Число"))
//			И Реквизит.Тип.Типы().Количество() = 1 И Не ЕстьЧисло Тогда
//			ЕстьЧисло = Истина;
//		КонецЕсли;
//		Если ЕстьЧисло И ЕстьСтатьяДвДенежныхСредств И ЕстьКонтрагент Тогда
//			Прервать;
//		КонецЕсли;	
//	КонецЦикла;
//	
//	Возврат ЕстьЧисло И ЕстьСтатьяДвДенежныхСредств И ЕстьКонтрагент;	
//	
//КонецФункции // ПроверитьДокументТЧ()

//Функция ПроверитьРегистр(МетаданныеРегистр)

//	Если МетаданныеРегистр.Ресурсы.Количество() = 0 
//		Или МетаданныеРегистр.Измерения.Количество() = 0 Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	ЕстьКонтрагент = Ложь;
//	ЕстьСтатьяДвДенежныхСредств = Ложь;
//	ЕстьЧисло = Ложь;
//	
//	Для каждого ресурс из МетаданныеРегистр.Ресурсы Цикл
//		Если ресурс.Тип.СодержитТип(Тип("Число")) И ресурс.Тип.Типы().Количество() = 1 И Не ЕстьЧисло Тогда
//			ЕстьЧисло = Истина;
//			Прервать;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Для каждого измерение Из МетаданныеРегистр.Измерения Цикл
//		Если измерение.Тип.СодержитТип(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"))
//			И измерение.Тип.Типы().Количество() = 1 И Не ЕстьСтатьяДвДенежныхСредств Тогда
//			ЕстьСтатьяДвДенежныхСредств = Истина;
//		КонецЕсли; 
//	    Если измерение.Тип.СодержитТип(Тип("СправочникСсылка.Контрагенты"))
//			И измерение.Тип.Типы().Количество() = 1 И Не ЕстьКонтрагент Тогда
//			ЕстьКонтрагент = Истина;
//		КонецЕсли;		     	
//	КонецЦикла; 
//	
//	Возврат ЕстьЧисло И ЕстьСтатьяДвДенежныхСредств И ЕстьКонтрагент;		

//КонецФункции // ПроверитьРегистр()
  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИсточникПолей") Тогда
		Параметры.ЭтоПоле = Истина;
		Параметры.Источник = Параметры.ИсточникПолей;
		ЗаполнитьДеревоАналитик(); 
	Иначе
		ЗаполнитьДеревоИсточника();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИсточниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработкаВыбора();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора()
	
	тд = Элементы.ДеревоИсточников.ТекущиеДанные;
	Если тд <> Неопределено И тд.Имя <> "" Тогда
		Структура = Новый Структура("Представление, Имя, Тип", тд.Представление, тд.Имя, тд.Тип);
		Закрыть(Структура);
	Иначе
		ПоказатьПредупреждение(,"Нельзя выбрать данный элемент",, "Выбор источника");
	КонецЕсли;    
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДеревоАналитик()
	 
	ЗаполнитьДерево(-1, "*", Параметры.Источник);

КонецПроцедуры // ЗаполнитьДеревоАналитик()

&НаСервере
Процедура ЗаполнитьДерево(ид, ПутьКДанным, ИмяТаблицы)	
	
	Если ид = -1 Тогда
		Строки = ДеревоИсточников.ПолучитьЭлементы();
	Иначе
		Строки = ДеревоИсточников.НайтиПоИдентификатору(ид).ПолучитьЭлементы();
	КонецЕсли;
	
	Строки.Очистить();
	
	ТекстЗапр = "ВЫБРАТЬ ИсточникДанных." + ПутьКДанным + " ИЗ " + ИмяТаблицы + " КАК ИсточникДанных";
			
	Постр = Новый ПостроительОтчета(ТекстЗапр);
	Постр.ЗаполнитьНастройки();

	Поля = Постр.ДоступныеПоля;
	Если ПутьКДанным <> "*" Тогда
		Для каждого стрПоле из Поля Цикл
			Если стрПоле.Поле Тогда
				Поля = стрПоле.Поля;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрПоле из Поля Цикл
		Если не СтрПоле.Поле ИЛИ не СтрПоле.Отбор Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = Строки.Добавить();
		НовСтр.Представление = СтрПоле.Имя;
		НовСтр.Тип = СтрПоле.ТипЗначения;
		
		РезПуть = СтрПоле.Имя;
		ТекРодитель = Новстр.ПолучитьРодителя();
		Пока ТекРодитель <> Неопределено Цикл
			РезПуть = ТекРодитель.Имя + "." + РезПуть;
			ТекРодитель = ТекРодитель.ПолучитьРодителя();
			Прервать;			
		КонецЦикла;
		
		НовСтр.Имя = РезПуть;	
		
		Если Строка(СтрПоле.ТипЗначения) <> "Число" И Строка(СтрПоле.ТипЗначения) <> "Дата" 
			И Строка(СтрПоле.ТипЗначения) <> "Строка" И Строка(СтрПоле.ТипЗначения) <> "Булево" Тогда
			ВремСтрока = Новстр.ПолучитьЭлементы().Добавить();
			ВремСтрока.Имя = "1";
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоИсточниковПередРазворачиванием(Элемент, Строка, Отказ)
	Если Параметры.ЭтоПоле Тогда
		стр = ДеревоИсточников.НайтиПоИдентификатору(Строка);
		Если стр.ПолучитьЭлементы().Количество() = 1 Тогда		
			ЗаполнитьДерево(Строка, стр.Имя, Параметры.Источник);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры






