
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Для каждого стр из Строки Цикл
		стрД = стр.Значение.Данные;
		
		стрД.Наименование = ВРЕГ(стрД.Наименование);
		стрД.СтатейРасхода = "( " + ?(стрД.КолСтатей = 0, "–", стрД.КолСтатей) + " )";
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПомеченные(Команда)
	Элементы.КомандаПоказатьПомеченные.Пометка = не Элементы.КомандаПоказатьПомеченные.Пометка;
	
	УстОтборПомеченных(Элементы.КомандаПоказатьПомеченные.Пометка);
КонецПроцедуры

&НаСервере
Процедура УстОтборПомеченных(ТекЗн)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ТекЗн);
КонецПроцедуры

