
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокПечатныхФорм.Добавить("Состояние фондов");
	СписокПечатныхФорм.Добавить("Директива ФП");
	Если не ИА_ФП_ПовторИсп.ФП_по_ТБ(ТекущаяДата()) Тогда
		СписокПечатныхФорм.Добавить("ФП 1");
		СписокПечатныхФорм.Добавить("Список ЗП");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПечатныхФормВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Элемент.ТекущиеДанные.Значение);
КонецПроцедуры
