//#13359

#Область ПрограммныйИнтерфейс
	
// Заполняет реквизиты документа, связанные с UDS
//
Процедура ЗаполнитьРеквизитыДокумента(ДокОбъект) Экспорт
	
	Если НЕ ДокОбъект.СлужебныйВидБонуснойСистемы = Перечисления.ВидыБонусныхСистем.UDS Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокОбъект.UDS_ИдентификаторОперации) Тогда
		Возврат;	
	КонецЕсли;
	
	ДокОбъект.UDS_НомерТелефона = "";
	
	ТипыКИ = Новый Массив;
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокОбъект.Контрагент);
	
	КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов, ТипыКИ, , ДокОбъект.Дата);
	
	Если КонтактнаяИнформацияОбъекта.Количество() > 0 Тогда
		НомерТелефона = КонтактнаяИнформацияОбъекта[0].Представление;
	КонецЕсли;
	
	НомерТелефона = СофтФон.ОставитьТолькоЦифры(НомерТелефона);
	
	ДокОбъект.UDS_НомерТелефона = Прав(НомерТелефона, 10);
	
КонецПроцедуры

#КонецОбласти
