
&НаКлиенте
Процедура РедактироватьШаблон(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Справочник должен быть записан перед добавлением шаблона";
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли;
	
	//редактор = ИА_ОбщиеПроцедуры_Технология_Повторный.ПолучитьРедакторИнструкций();
	//
	//Если редактор = ПредопределенноеЗначение("Перечисление.ИА_РедакторИнструкций.ПустаяСсылка") Тогда
	//	ПоказатьПредупреждение(,"На Вашем компьютере не установлен MS Office или OpenOffice. Для корректной работы необходимо установить один из этих продуктов!");
	//	Возврат;
	//КонецЕсли;
	//
	//ЕстьВорд    = редактор = ПредопределенноеЗначение("Перечисление.ИА_РедакторИнструкций.Word");
	//ЕстьВрайтер = редактор = ПредопределенноеЗначение("Перечисление.ИА_РедакторИнструкций.Writer");
	//
	//Если ЕстьВорд Тогда
	//	Word = новый COMОбъект("Word.Application");
	//иначе
	//	Word = новый COMОбъект("com.sun.star.ServiceManager");
	//КонецЕсли;
	
	ШаблонДвоичныеДанные = ПолучитьШаблонИнструкцииИзТипа();
	
		
	
	#Если ВебКлиент Тогда
		ВременныйКаталог = Файл.Путь+"\"+"ksu_template\";
	#Иначе
		ВременныйКаталог = КаталогВременныхФайлов()+"ksu_template\";
	#КонецЕсли	
	СоздатьКаталог(ВременныйКаталог);
    ПолноеИмяФайла = ВременныйКаталог + "templateInstr.doc";

		
	Если ШаблонДвоичныеДанные = Неопределено Тогда
		#Если ВебКлиент Тогда
			ПолноеИмяФайла = "";
			Если Не ПоместитьФайл( , , ПолноеИмяФайла, Истина) Тогда
				Возврат;
			КонецЕсли;
		#Иначе
			Режим = РежимДиалогаВыбораФайла.Открытие;
			ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
			ДиалогОткрытияФайла.ПолноеИмяФайла = "";
			Фильтр = "MS Word(*.doc)|*.doc";
			ДиалогОткрытияФайла.Фильтр = Фильтр;
			ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
			ДиалогОткрытияФайла.Заголовок = "Выберите файл с шаблоном";
			Если Не ДиалогОткрытияФайла.Выбрать() Тогда
				Возврат;	
			КонецЕсли;
			
			ПолноеИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
		#КонецЕсли	
		
		//----------------------------------------
		Файл = Новый Файл(ПолноеИмяФайла);
		ИмяФайла = Файл.Имя;
		
		ШаблонДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
		
	КонецЕсли;
	
	ШаблонДвоичныеДанные.Записать(ПолноеИмяФайла);

	ЗапуститьПриложение(ПолноеИмяФайла);

	ПоказатьВопрос(Новый ОписаниеОповещения("РедактироватьШаблонЗавершение", ЭтотОбъект, Новый Структура("ВременныйКаталог, ПолноеИмяФайла", ВременныйКаталог, ПолноеИмяФайла)), "Когда закончите редактирование и закроете редактор, нажмите ОК для принятия изменений или Отмена, для отказа от изменений.", РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьШаблонЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВременныйКаталог = ДополнительныеПараметры.ВременныйКаталог;
	ПолноеИмяФайла = ДополнительныеПараметры.ПолноеИмяФайла;
	
	
	Если РезультатВопроса=КодВозвратаДиалога.ОК Тогда
		ДвДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
		УстановитьШаблон(ДвДанные);
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ВременныйКаталог);
	Исключение
	КонецПопытки;

КонецПроцедуры


&НаСервере
Функция ПолучитьШаблонИнструкцииИзТипа()
    
    ТипИнструкции = Объект.Ссылка.ПолучитьОбъект();	
    Возврат ТипИнструкции.Шаблон.Получить();

КонецФункции // ()

&НаСервере
Процедура УстановитьШаблон(ДвДанные)
    
    Хранилище = Новый ХранилищеЗначения(ДвДанные);
    ТипИнструкции = Объект.Ссылка.ПолучитьОбъект();	
	ТипИнструкции.Шаблон = Хранилище;
    ТипИнструкции.Записать();
    ЗначениеВРеквизитФормы(ТипИнструкции, "Объект");
    
КонецПроцедуры