&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
    ПоказатьВопрос(Оповещение, "Текущие настройки будут утеряны. Продолжить?", РежимДиалогаВопрос.ДаНет);    
 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
    	ЗаполнитьНастройкиПоУмолчанию(Истина);    
	КонецЕсли;
	Элементы.Список.Обновить();
 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию(Перезаполнить)

	РегистрыСведений.ПорядокПереводаСтатусаЛида.ЗаполнитьНастройкиПоУмолчанию(Перезаполнить);
	
КонецПроцедуры
