Процедура ЗаписатьДанныеВПлан(МенеджерПродаж, НомерГод, НомерМесяц, Номенклатура, Количество) Экспорт
	
	ДатаПериода = НачалоМесяца(Дата(НомерГод,НомерМесяц,1,0,0,1));
	ПланНаборЗаписей = РегистрыСведений.ПланПродажМенеджеров.СоздатьНаборЗаписей();
	ПланНаборЗаписей.Отбор.Год.Установить(НомерГод);
	ПланНаборЗаписей.Отбор.Месяц.Установить(ДатаПериода);
	ПланНаборЗаписей.Отбор.МенеджерПродаж.Установить(МенеджерПродаж);
	ПланНаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	ПланНаборЗаписей.Прочитать();
	Если ПланНаборЗаписей.Количество() = 0 Тогда
		НовыйПлан = ПланНаборЗаписей.Добавить();
	Иначе
		НовыйПлан = ПланНаборЗаписей[0];
	КонецЕсли;
	НовыйПлан.Год = НомерГод;
	НовыйПлан.Месяц = ДатаПериода;
	НовыйПлан.МенеджерПродаж = МенеджерПродаж;
	НовыйПлан.Номенклатура = Номенклатура;
	НовыйПлан.Количество = Количество;
	ПланНаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьДанныеИзПлана(МенеджерПродаж, НомерГод, НомерМесяц, Номенклатура) Экспорт
	
	ДатаПериода = НачалоМесяца(Дата(НомерГод,НомерМесяц,1,0,0,1));
	ПланНаборЗаписей = РегистрыСведений.ПланПродажМенеджеров.СоздатьНаборЗаписей();
	ПланНаборЗаписей.Отбор.Год.Установить(НомерГод);
	ПланНаборЗаписей.Отбор.Месяц.Установить(ДатаПериода);
	ПланНаборЗаписей.Отбор.МенеджерПродаж.Установить(МенеджерПродаж);
	ПланНаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	ПланНаборЗаписей.Прочитать();
	ПланНаборЗаписей.Удалить(0);
	ПланНаборЗаписей.Записать();
	
КонецПроцедуры