#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратПродукции") Тогда
		// Заполнение шапки
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Производство;
		Для Каждого ТекСтрокаОтветственные Из ДанныеЗаполнения.Ответственные Цикл
			НоваяСтрока = Премии.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаОтветственные.Сотрудник;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Производство;
		НоваяСтрока = Премии.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.Автор.Сотрудник;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТовараПоставщику") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Производство;
		НоваяСтрока = Премии.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.Автор.Сотрудник;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыпускПродукции") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Производство;
		Для Каждого ТекСтрокаИсполнители Из ДанныеЗаполнения.Исполнители Цикл
			НоваяСтрока = Премии.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаИсполнители.Сотрудник;
		КонецЦикла;
		Для Каждого ТекСтрока Из ДанныеЗаполнения.ИсполнителиПоОперациям Цикл
			Если ЗначениеЗаполнено(ТекСтрока.Сотрудник1) Тогда
				НоваяСтрока = Премии.Добавить();
				НоваяСтрока.Сотрудник = ТекСтрока.Сотрудник1;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекСтрока.Сотрудник2) Тогда
				НоваяСтрока = Премии.Добавить();
				НоваяСтрока.Сотрудник = ТекСтрока.Сотрудник2;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекСтрока.Сотрудник3) Тогда
				НоваяСтрока = Премии.Добавить();
				НоваяСтрока.Сотрудник = ТекСтрока.Сотрудник3;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекСтрока.Сотрудник4) Тогда
				НоваяСтрока = Премии.Добавить();
				НоваяСтрока.Сотрудник = ТекСтрока.Сотрудник4;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Розница;	
		НоваяСтрока = Премии.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.ИсполнительЗамера;		
		НоваяСтрока = Премии.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.Менеджер;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Замена") Тогда
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Розница;
		Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Организация = ДанныеЗаполнения.Основание.Организация;
			Подразделение = ДанныеЗаполнения.Основание.Подразделение;	
			НоваяСтрока = Премии.Добавить();
			НоваяСтрока.Сотрудник = ДанныеЗаполнения.Основание.ИсполнительЗамера;		
			НоваяСтрока = Премии.Добавить();
			НоваяСтрока.Сотрудник = ДанныеЗаполнения.Основание.Менеджер;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Лид") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Розница;
		НоваяСтрока = Премии.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.Автор.Сотрудник;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		
		Документы.Монтаж.ПроверитьВозможностьВводаНаОсновании(ДанныеЗаполнения, Тип("ДокументСсылка.Премия"));
		
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Розница;
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Бригадир) Тогда
			НоваяСтрока = Премии.Добавить();
			НоваяСтрока.Сотрудник = ДанныеЗаполнения.Бригадир;
		КонецЕсли;
		Для Каждого ТекСтрокаИсполнители Из ДанныеЗаполнения.Исполнители Цикл
			НоваяСтрока = Премии.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаИсполнители.Сотрудник;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Для Каждого ТекущаяСтрока Из Премии Цикл
			ТекущаяСтрока.Валюта = ВалютаУчета;
			ТекущаяСтрока.ВидНачисления = Справочники.ВидыНачислений.Премия;
			ТекущаяСтрока.КДокументу = Основание;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Розница Тогда
		// регистр ВыработкаИсполнителейРозницы 
		Движения.ВыработкаИсполнителейРозницы.Записывать = Истина;
		Для Каждого ТекСтрока Из Премии Цикл
			Движение = Движения.ВыработкаИсполнителейРозницы.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = ТекСтрока.Сотрудник;
			Движение.ВидНачисления = ТекСтрока.ВидНачисления;
			Движение.Количество = 1;
			Движение.Стоимость = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ТекСтрока.Валюта, ВалютаУчета, Дата, ТекСтрока.Сумма); // №10724 пересчёт в валюту учёта
			Если ТекСтрока.КДокументу <> Неопределено И НЕ ТекСтрока.КДокументу.Пустая() Тогда
				Движение.ОбъектВыработки = ТекСтрока.КДокументу;
			Иначе
				Движение.ОбъектВыработки = Ссылка;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// регистр ВыработкаИсполнителейПроизводства 
		Движения.ВыработкаИсполнителейПроизводства.Записывать = Истина;
		Для Каждого ТекСтрока Из Премии Цикл
			Движение = Движения.ВыработкаИсполнителейПроизводства.Добавить();
			Движение.Период = Дата;
			Движение.Подразделение = Подразделение;
			Движение.Сотрудник = ТекСтрока.Сотрудник;
			Движение.ВидНачисления = ТекСтрока.ВидНачисления;
			Движение.Количество = 1;
			Движение.Стоимость = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ТекСтрока.Валюта, ВалютаУчета, Дата, ТекСтрока.Сумма); // №10724 пересчёт в валюту учёта
			Движение.Цена = Движение.Стоимость;
			Если ТекСтрока.КДокументу <> Неопределено И НЕ ТекСтрока.КДокументу.Пустая() Тогда
				Движение.ОбъектВыработки = ТекСтрока.КДокументу;
			Иначе
				Движение.ОбъектВыработки = Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли