
&НаКлиенте
Процедура ОчиститьЛог(Команда)
	
	ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОбОчисткеЛога", ЭтотОбъект), "История обмена будет полностью очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеЛога(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьЛогНаСервере();
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЛогНаСервере()
	
	НаборЗаписей = РегистрыСведений.ЛогОбменаСWikki.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры
