Функция ПолучитьКоличествоЭлементовСправочника() Экспорт
	
	КоличествоЭлементовСправочника = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИА_ГруппыКомпаний.Ссылка) КАК КоличествоЭлементовСправочника
	|ИЗ
	|	Справочник.ИА_ГруппыКомпаний КАК ИА_ГруппыКомпаний
	|ГДЕ
	|	ИА_ГруппыКомпаний.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		КоличествоЭлементовСправочника = 0;
	иначе	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КоличествоЭлементовСправочника = ВыборкаДетальныеЗаписи.КоличествоЭлементовСправочника;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат КоличествоЭлементовСправочника;
	
КонецФункции

Функция ПолучитьПризнакИспользованияГруппКомпаний() Экспорт
	Возврат ПолучитьКоличествоЭлементовСправочника() > 0;	
КонецФункции
