////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПАНЕЛИ 1с-РАРУС СофтФон


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЩЕГО НАЗНАЧЕНИЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ОбновитьОтчеты()
	
	
	СформироватьОтчетВоронкаПродаж(ДиаграммаВоронкаПродаж);
	
	СформироватьОтчетКоличествоЛидовПоВидамРекламы(ДиаграммаКоличествоЛидовПоВидамРекламы); 
	
	СформироватьОтчетЭффективностьМенеджеровКонтактЗамер(ДиаграммаЭффективностьМенеджеровКонтактЗамер);
	
	СформироватьОтчетЭффективностьТочекПродаж(ДиаграммаЭффективностьТочекПродаж);
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетВоронкаПродаж(ДиаграммаВоронкаПродаж)
	
	МодульОтчетов.СформироватьДиаграммуВоронкаПродажОтПервогоКонтакта(ДиаграммаВоронкаПродаж, ДатаНачала, ДатаОкончания);
	
КонецФункции

&НаСервере
Функция СформироватьОтчетКоличествоЛидовПоВидамРекламы(ДиаграммаКоличествоЛидовПоВидамРекламы)
	
	МодульОтчетов.СформироватьДиаграммуКоличествоЛидовПоВидамРекламы(ДиаграммаКоличествоЛидовПоВидамРекламы,ДатаНачала, ДатаОкончания);
	
КонецФункции

&НаСервере
Функция СформироватьОтчетЭффективностьМенеджеровКонтактЗамер(ДиаграммаЭффективностьМенеджеровКонтактЗамер)
	
	МодульОтчетов.СформироватьДиаграммуЭффективностьМенеджеровКонтактЗамер(ДиаграммаЭффективностьМенеджеровКонтактЗамер, ДатаНачала, ДатаОкончания);
	
КонецФункции

&НаСервере
Функция СформироватьОтчетЭффективностьТочекПродаж(ДиаграммаЭффективностьТочекПродаж)
	
	МодульОтчетов.СформироватьДиаграммуффективностьТочекПродаж(ДиаграммаЭффективностьТочекПродаж, ДатаНачала, ДатаОкончания);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДатаНачала = НачалоМесяца(ТекущаяДата());
	ДатаОкончания = КонецМесяца(ТекущаяДата());
	ОбновитьОтчеты();
	
	//#Если ВебКлиент Тогда
	//	ПанельСофтФон = Неопределено;
	//#Иначе
	//	Если ПраваПользователей.РазрешеноИспользованиеСофтФона() Тогда
	//		Если СофтФон.ИспользуютсяСофтФон() Тогда
	//			Элементы.ГруппаСофтФон.Видимость = Истина;
	//			
	//			Попытка
	//				ПанельСофтФон = Новый COMОбъект("SPPanel.SPPanelAO");
	//			Исключение
	//				ПанельСофтФон = Неопределено;
	//			КонецПопытки;
	//			Если НЕ ПанельСофтФон = Неопределено Тогда
	//				//подключаем обработчики
	//				ДобавитьОбработчик ПанельСофтФон.OnCallInfo, Подключаемый_OnCallInfo;
	//				ДобавитьОбработчик ПанельСофтФон.OnEvent, Подключаемый_OnEvent;
	//				ДобавитьОбработчик ПанельСофтФон.OnRecordInfo, Подключаемый_OnRecordInfo;
	//				ДобавитьОбработчик ПанельСофтФон.OnAllLinesInfo, Подключаемый_OnAllLinesInfo;
	//				
	//				//проверяем текущий статус софтфона
	//				LocalPhoneNum = "";
	//				ПанельСофтФон.GetSettings(, , , , , LocalPhoneNum, , );
	//				Если НЕ ПустаяСтрока(LocalPhoneNum) Тогда
	//					Элементы.ДекорацияСофтФонСостояние.Заголовок = "СофтФон включен";
	//					Элементы.ДекорацияСофтФонСостояниеКартинка.Картинка = БиблиотекаКартинок.сфпКлиентПодключен;
	//					Элементы.ДекорацияСофтФонНомерЗначение.Заголовок = LocalPhoneNum;
	//				Иначе
	//					Элементы.ДекорацияСофтФонСостояние.Заголовок = "СофтФон выключен";
	//					Элементы.ДекорацияСофтФонСостояниеКартинка.Картинка = БиблиотекаКартинок.сфпКлиентОтключен;
	//					Элементы.ДекорацияСофтФонНомерЗначение.Заголовок = "Не определен";
	//				КонецЕсли;
	//			Иначе
	//				Сообщить("Не удалось соединиться с СофтФон");
	//			КонецЕсли;
	//			Элементы.ГруппаСофтФон.Видимость = Ложь;
	//		КонецЕсли;
	//	Иначе
	//		Элементы.ГруппаСофтФон.Видимость = Ложь;
	//	КонецЕсли;
	//#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьОтчеты();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступенМониторРуководителяРозница = ОбщийМодульСервер.НастройкаПользователя("ДоступенМониторРуководителяРозница");
	Элементы.ГруппаПериод.Видимость = ДоступенМониторРуководителяРозница;
	Элементы.ГруппаСтрока1.Видимость = ДоступенМониторРуководителяРозница;
	Элементы.ГруппаСтрока2.Видимость = ДоступенМониторРуководителяРозница;
	
	Если НЕ ДоступенМониторРуководителяРозница Тогда
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

