
&НаКлиенте
Процедура Редактор(Команда)
    ТекСтрока = Элементы.Список.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        Пользователь = ТекСтрока.Пользователь;
    Иначе
        Пользователь = Неопределено;
    КонецЕсли; 
    П = Новый Структура("Пользователь", Пользователь);
    ОткрытьФорму("РегистрСведений.ИА_НастройкиЗначения.Форма.ФормаРедактор", П);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Параметры.Свойство("Отбор")
        И Параметры.Отбор.Свойство("Пользователь") Тогда
        ОтборПользователь = Параметры.Отбор.Пользователь;
    КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Если ЗначениеЗаполнено(ОтборПользователь) Тогда
    	Отказ = Истина;
        П = Новый Структура("Пользователь", ОтборПользователь);
        ОткрытьФорму("РегистрСведений.ИА_НастройкиЗначения.Форма.ФормаРедактор", П);
    КонецЕсли; 
КонецПроцедуры

