
Функция Base64ЗакодироватьCDO(Знач Строка) Экспорт
	
	Результат = Строка;
	
	Попытка	
		// кодирование Base64 средствами Win-библиотеки CDO
		CDO=Новый COMОбъект("CDO.Message");
		BodyPart = CDO.BodyPart;
		BodyPart.Charset = "utf-8";
		BodyPart.ContentTransferEncoding="base64";
		
		Stream = BodyPart.GetDecodedContentStream();
		Stream.WriteText(Строка);
		Stream.Flush();
		
		Stream = BodyPart.GetEncodedContentStream();
		Результат = Stream.ReadText(Stream.Size - 2); //Отрезаем перевод строки на хвосте
	
	Исключение
	КонецПопытки; 
	
	Если Результат="" Тогда
		Результат=Строка;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция СоединитьДатуИВремя(Дата, Время) Экспорт	
	ДатаСтрока = Формат(Дата, "ДФ=ггггММдд; ДП=00010101");
	ВремяСтрока = Формат(Время, "ДФ=ЧЧммсс; ДП=000000");
	Рез = Дата(ДатаСтрока + ВремяСтрока);	
	Возврат Рез;	
КонецФункции 

Функция ЭкранироватьСимволыJSON(Знач СтрокаJSON) Экспорт
	
    СтрокаJSON = СтрЗаменить(СтрокаJSON, "\", "\\");
    СтрокаJSON = СтрЗаменить(СтрокаJSON, Символы.ПС, "\n");
    СтрокаJSON = СтрЗаменить(СтрокаJSON, Символы.ВК, "\r");
    СтрокаJSON = СтрЗаменить(СтрокаJSON, Символы.Таб, "\t");
    СтрокаJSON = СтрЗаменить(СтрокаJSON, "/", "\/");
    СтрокаJSON = СтрЗаменить(СтрокаJSON, """", "\""");
    Возврат СтрокаJSON;
	
КонецФункции

Функция СформироватьПутьКФайлуЗаписиЗвонка(Дата, ФорматИерархииПапок, ПутьКЗаписи) Экспорт
	
	ПолныйПуть = "";
	Если НЕ ПустаяСтрока(ФорматИерархииПапок) Тогда
		ПолныйПуть = ?(Лев(ФорматИерархииПапок, 1) = "\", ФорматИерархииПапок, "\" + ФорматИерархииПапок);
		
		ПолныйПуть = СтрЗаменить(ПолныйПуть, "YYYY", Формат(Дата, "ДФ=yyyy"));
		ПолныйПуть = СтрЗаменить(ПолныйПуть, "YY", Формат(Дата, "ДФ=yy"));
		ПолныйПуть = СтрЗаменить(ПолныйПуть, "MM", Формат(Дата, "ДФ=MM"));
		ПолныйПуть = СтрЗаменить(ПолныйПуть, "DD", Формат(Дата, "ДФ=dd"));
	КонецЕсли;

	ПолныйПуть = ?(Прав(ПолныйПуть, 1) = "\", ПолныйПуть, ПолныйПуть + "\");	
	ПолныйПуть = ПолныйПуть + ПутьКЗаписи;
	
	Возврат ПолныйПуть;
	
КонецФункции

// Устанавливает значение свойства элемента формы, если находит элемент на форме
//
// Параметры
//  ЭлементыФормы - ВсеЭлементыФормы - элементы формы, среди которых содержится искомый элемент.
//  ИмяЭлемента   - Строка - имя искомого элемента.
//  ИмяСвойства   - Строка - имя свойства, для которого будет устанавливаться значение.
//  Значение      - Произвольный - значение, которое будет установлено
//  УстанавливатьДляПодчиненных - Булево - установить аналогичное свойство для подчиненных элементов искомого элемента.
//
Процедура УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение, УстанавливатьДляПодчиненных = Ложь) Экспорт
	
	Элемент = ЭлементыФормы.Найти(ИмяЭлемента);
	Если Элемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;  
	
	Если НРег(ИмяСвойства) = НРег("ТолькоПросмотр")
	И ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
		ИмяСвойстваЭлемента = "Доступность";
		ЗначениеСвойства    = НЕ Значение;
	Иначе
		ИмяСвойстваЭлемента = ИмяСвойства;
		ЗначениеСвойства    = Значение;
	КонецЕсли; 
	
	Попытка
		ДоступностьСвойства = Элемент[ИмяСвойстваЭлемента];
	Исключение
		Возврат;
	КонецПопытки;
	
	Если НРег(ИмяСвойства) = НРег("РасширеннаяПодсказка") Тогда
		Элемент.РасширеннаяПодсказка.Заголовок = Значение;
	Иначе
		Если Элемент[ИмяСвойстваЭлемента] <> ЗначениеСвойства Тогда
			Элемент[ИмяСвойстваЭлемента] = ЗначениеСвойства;
		КонецЕсли;
	КонецЕсли;
	
	ТипыЭлементовФормыСПодчиненнымиЭлементами = Новый ОписаниеТипов("УправляемаяФорма, ГруппаФормы, ТаблицаФормы");
	
	Если УстанавливатьДляПодчиненных И ТипыЭлементовФормыСПодчиненнымиЭлементами.СодержитТип(ТипЗнч(Элемент)) Тогда
		Для Каждого ПодчиненныйЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
			УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ПодчиненныйЭлемент.Имя, ИмяСвойства, Значение, Истина);
		КонецЦикла;
 	КонецЕсли;
 	
КонецПроцедуры // УстановитьСвойствоЭлементаФорма()

// Устанавливает значение свойства элементов формы, если находит элемент на форме
//
// Параметры
//  ЭлементыФормы  - ВсеЭлементыФормы - элементы формы, среди которых содержится искомый элемент.
//  ИменаЭлементов - Массив, Строка, Структура - имена искомых элементов.
//  ИмяСвойства    - Строка - имя свойства, для которого будет устанавливаться значение.
//  Значение       - Произвольный - значение, которое будет установлено
//  УстанавливатьДляПодчиненных - Булево - установить аналогичное свойство для подчиненных элементов искомых элементов.
//
Процедура УстановитьСвойствоЭлементовФормы(ЭлементыФормы, ИменаЭлементов, ИмяСвойства, Значение, УстанавливатьДляПодчиненных = Ложь) Экспорт
	
	Если ТипЗнч(ИменаЭлементов) = Тип("Массив") Тогда
		
		Для Каждого ИмяЭлемента Из ИменаЭлементов Цикл
			УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение, УстанавливатьДляПодчиненных);
		КонецЦикла
		
	Иначе
		
		Если ТипЗнч(ИменаЭлементов) = Тип("Строка") Тогда
			СтруктураИменЭлементов = Новый Структура(ИменаЭлементов);
		Иначе
			СтруктураИменЭлементов = ИменаЭлементов;
		КонецЕсли;
		
		Для Каждого ИмяЭлемента Из СтруктураИменЭлементов Цикл
			УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента.Ключ, ИмяСвойства, Значение, УстанавливатьДляПодчиненных);
		КонецЦикла
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьСвойствоЭлементовФормы()

Процедура УдалитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля)
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			КоллекцияЭлементов.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

// Удаляет элемент отбора динамического списка.
//
// Параметры:
// Список - ДинамическийСписок - обрабатываемый динамический список,
// ИмяПоля - Строка - имя поля компоновки, отбор по которому нужно удалить.
//
Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля) Экспорт
	
	УдалитьЭлементОтбораКоллекции(Список.КомпоновщикНастроек.Настройки.Отбор.Элементы, ИмяПоля);
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

// Устанавливает элемент отбор динамического списка.
//
// Параметры:
//  Список - ДинамическийСписок - обрабатываемый динамический список.
//  ИмяПоля - Строка - наименование поля компоновки данных.
//  ВидСравнения - ВидСравнения - вид сравнения отбора, по умолчанию - Равно.
//  ПравоеЗначение - ПравоеЗначение - значение, которое нужно установить.
//
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено) Экспорт
	
	УстановитьЭлементОтбораКоллекции(Список.КомпоновщикНастроек.Настройки.Отбор.Элементы, ИмяПоля, ПравоеЗначение, ВидСравнения);
	
КонецПроцедуры

// Устанавливает элемент отбора коллекции.
//
// Параметры:
//  КоллекцияЭлементов - ГруппаЭлементовОтбораКомпоновкиДанных - контейнер с элементами и группами отбора.
//  ИмяПоля - Строка - наименование поля компоновки данных.
//  ПравоеЗначение - ПравоеЗначение - значение, которое нужно установить.
//  ВидСравнения - ВидСравнения - вид сравнения отбора, по умолчанию - Равно.
//
Процедура УстановитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено)
	
	ЭлементОтбора = КоллекцияЭлементов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

// Устанавливает значение Значение параметра ИмяПараметра динамического списка Список 
// или отключает его использование в зависимости от признака Использование.
//
// Параметры:
//  Список - ДинамическийСписок - динамический список, для которого требуется установить отбор.
//  ИмяПараметра - Строка - имя колонки, по которой устанавливается отбор.
//  Значение - Произвольный - устанавливаемое значение отбора.
//  Использование - Неопределено, Булево - признак использования элемента отбора.
//
Процедура УстановитьПараметрДинамическогоСписка(Список, ИмяПараметра, Значение, Использование = Истина) Экспорт
	
	Если Использование Тогда
		ЗначениеПараметра = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		Если ЗначениеПараметра <> Неопределено Тогда
			Список.Параметры.УстановитьЗначениеПараметра(ИмяПараметра, Значение);
		КонецЕсли;
	Иначе
		
		ЗначениеПараметра = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		Если ЗначениеПараметра <> Неопределено Тогда
			Если ЗначениеПараметра.Значение <> Значение Тогда
				ЗначениеПараметра.Значение = Значение;
			КонецЕсли;
			Если ЗначениеПараметра.Использование <> Использование Тогда
				ЗначениеПараметра.Использование = Использование;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Изменяет элемент отбора динамического списка.
//
// Параметры:
//  Список - ДинамическийСписок - обрабатываемый динамический список.
//  ИмяПоля - Строка - наименование поля компоновки данных.
//  ПравоеЗначение - ПравоеЗначение - значение, которое нужно установить.
//  Установить - Булево - признак необходимости установить отбор.
//  ВидСравнения - ВидСравнения - вид сравнения отбора, по умолчанию - Равно.
//
Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено) Экспорт
	
	УдалитьЭлементОтбораСписка(Список, ИмяПоля);
	
	Если Установить Тогда
		УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()

Процедура ЗаполнитьПризнакПересеченияИнтерваловВЦенахНаУслугиПроизводства(ТабличнаяЧасть) Экспорт
	
	КоличествоСтрок = ТабличнаяЧасть.Количество();
	Для каждого СтрокаТЧ из ТабличнаяЧасть Цикл
		СтрокаТч.ЕстьПересечение = Ложь;
	КонецЦикла;
	
	Для Индекс1 = 1 по КоличествоСтрок Цикл
		Для Индекс2 = 1 по КоличествоСтрок Цикл
			Если Индекс1 >= Индекс2 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаТЧ1 = ТабличнаяЧасть[Индекс1-1];
			СтрокаТЧ2 = ТабличнаяЧасть[Индекс2-1];
			Если ОбщийМодульКлиентСервер.ПроверитьПересечениеИнтервалов(СтрокаТЧ1.КоличествоОт, СтрокаТЧ1.КоличествоДо, СтрокаТЧ2.КоличествоОт, СтрокаТЧ2.КоличествоДо) Тогда
				СтрокаТЧ1.ЕстьПересечение = Истина; 
				СтрокаТЧ2.ЕстьПересечение = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
	
Функция ПроверитьПересечениеИнтервалов(Интервал1Начало, Интервал1Конец, Интервал2Начало, Интервал2Конец) Экспорт
	
	//Возврат Интервал1Начало < Интервал2Конец И Интервал1Конец > Интервал2Начало; // если границы интервалов могут совпадать 
	Возврат Интервал1Начало <= Интервал2Конец И Интервал1Конец >= Интервал2Начало;
	
КонецФункции

#Область ПроцедурыИФункцииРМК

// Получает структуру выводимой информации в РМК.
//
// Возвращаемое значение:
//  Структура - структура выводимой информации в РМК.
//
Функция ВыводимаяВРМКИнформация() Экспорт
	
	ПараметрыИнформации = Новый Структура;
	ПараметрыИнформации.Вставить("ЗаголовокИнформации", "");
	ПараметрыИнформации.Вставить("ТекстИнформации", "");
	ПараметрыИнформации.Вставить("ПоказатьПодсказку", Ложь);
	ПараметрыИнформации.Вставить("Подсказка", "");
	ПараметрыИнформации.Вставить("ТипОтвета", "");
	ПараметрыИнформации.Вставить("ОтветПоУмолчанию", "");
	
	Возврат ПараметрыИнформации;
	
КонецФункции

//// Получение структуры для создания элемента справочника.
//// Штрихкоды упаковок товаров.
//Функция СтруктураШтрихкодУпаковки() Экспорт 
//	
//	СтруктураШтрихкодаУпаковки = Новый Структура;
//	СтруктураШтрихкодаУпаковки.Вставить("Организация");
//	СтруктураШтрихкодаУпаковки.Вставить("Магазин");
//	СтруктураШтрихкодаУпаковки.Вставить("Штрихкод");
//	СтруктураШтрихкодаУпаковки.Вставить("КлючСвязи");
//	СтруктураШтрихкодаУпаковки.Вставить("Номенклатура");
//	СтруктураШтрихкодаУпаковки.Вставить("Характеристика");
//	
//	Возврат СтруктураШтрихкодаУпаковки;
//	
//КонецФункции // СтруктураШтрихкодУпаковки()

//// Получение структуры для заполнения табличной части Акцизные марки.
////
//Функция СтруктураДляЗаполненияАкцизныхМарок() Экспорт 
//	
//	СтруктураДляЗаполнения = Новый Структура;
//	СтруктураДляЗаполнения.Вставить("Адрес");
//	СтруктураДляЗаполнения.Вставить("ДополнительныеПараметры");
//	СтруктураДляЗаполнения.Вставить("Организация");
//	СтруктураДляЗаполнения.Вставить("Номенклатура");
//	СтруктураДляЗаполнения.Вставить("Характеристика");
//	СтруктураДляЗаполнения.Вставить("Объект");
//	
//	Возврат СтруктураДляЗаполнения;
//	
//КонецФункции

// Возвращает структуру для заполнения таблицы чеков.
//
// Возвращаемое значение:
//  СтруктураДанных - Структура
//
Функция СтруктураДляЗаполненияТаблицыЧеков() Экспорт 
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("СуммаОстаткаДокументаРасчета");
	СтруктураДанных.Вставить("УникальныйИдентификатор");
	СтруктураДанных.Вставить("ТаблицаКассККМОрганизаций");
	
	Возврат СтруктураДанных;
	
КонецФункции

// Возвращает структуру для формирования заголовка в РМК.
//
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * ВидОперации - ПеречислениеСсылка.ВидыОперацийЧекККМ.
//   * ОперацияСДенежнымиСредствами - Булево.
//   * ПродажаПоЗаказу - Булево.
//   * ДокументРасчета - ДокументСсылка.
//   * ЭтоЗачетАванса - Булево.
//   * НомерЗаказа - Строка.
//   * ЭтоОплатаРассрочки - Булево.
//   * Продавец - СправочникСсылка.ФизическиеЛица.
//   * РеверсКнопкиПродавец - Булево.
//   * ИмяКнопкиПродавец - Строка.
//   * ЦветПродажи - Булево.
//   * СуммаОстаткаДокументаРасчета - Число.
//
Функция СтруктураДляУстановкиЗаголовкаРМК() Экспорт 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидОперации");
	СтруктураПараметров.Вставить("ОперацияСДенежнымиСредствами");
	//СтруктураПараметров.Вставить("ПродажаПоЗаказу");
	//СтруктураПараметров.Вставить("ДокументРасчета");
	//СтруктураПараметров.Вставить("ЭтоЗачетАванса");
	//СтруктураПараметров.Вставить("НомерЗаказа");
	//СтруктураПараметров.Вставить("ЭтоОплатаРассрочки");
	СтруктураПараметров.Вставить("Продавец");
	//СтруктураПараметров.Вставить("РеверсКнопкиПродавец");
	//СтруктураПараметров.Вставить("ИмяКнопкиПродавец");
	СтруктураПараметров.Вставить("ЦветПродажи");
	//СтруктураПараметров.Вставить("СуммаОстаткаДокументаРасчета");
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Возвращает структуру для обновления табло номенклатуры в РМК.
//
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * ВыведеныЧеки - Булево.
//   * ОставлятьФлагТаблоСдачи - Булево.
//   * ВыведенаСдача - Булево.
//   * ДисконтнаяКарта - СправочникСсылка.ИнформационныеКарты.
//   * ВладелецДисконтнойКарты - СправочникСсылка.Контрагенты, СправочникСсылка.Пользователи, СправочникСсылка.ФизическиеЛица.
//
Функция СтруктураДляОбновленияТаблоНоменклатурыРМК() Экспорт 
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ВыведеныЧеки");
	СтруктураДанных.Вставить("ОставлятьФлагТаблоСдачи");
	СтруктураДанных.Вставить("ВыведенаСдача");
	//СтруктураДанных.Вставить("ДисконтнаяКарта");
	//СтруктураДанных.Вставить("ВладелецДисконтнойКарты");

	Возврат СтруктураДанных;
	
КонецФункции

// Возвращает наличие элемента на форме
//
// Параметры:
//  Элементы - ВсеЭлементыФормы.
//  ИмяЭлемента - Строка.
// 
// Возвращаемое значение:
//  Булево - Наличие элемента на форме.
//
Функция ПроверитьНаличиеЭлементаФормы(Элементы, ИмяЭлемента) Экспорт 
	
	Возврат НЕ Элементы.Найти(ИмяЭлемента) = Неопределено;
	
КонецФункции

Функция ФорматСумм(Сумма) Экспорт 
	
	Сумма = ?(Сумма < 0, -Сумма, Сумма);
	ПредставлениеВалюты = НСтр("ru = 'руб.'");
	
	Возврат СтрШаблон("%1 %2", Формат(Сумма,"ЧЦ=15; ЧДЦ=2; ЧН=0.00"), ПредставлениеВалюты);
	
КонецФункции


#КонецОбласти

#Область РаботаСЦветом

// Функция возвращает набор пастельных цветов в порядке их взаимной контрастности
// Возвращаемое значение:
//  Массив - массив цветов для использования в сериях на диаграммах
Функция ЦветаСерийДиаграмм() Экспорт
	
	МассивЦветов = Новый Массив;
	
	МассивЦветов.Добавить(Новый Цвет(245, 152, 150));
	МассивЦветов.Добавить(Новый Цвет(142, 201, 249));
	МассивЦветов.Добавить(Новый Цвет(255, 202, 125));
	МассивЦветов.Добавить(Новый Цвет(178, 154, 218));
	МассивЦветов.Добавить(Новый Цвет(163, 214, 166));
	МассивЦветов.Добавить(Новый Цвет(244, 140, 175));
	МассивЦветов.Добавить(Новый Цвет(125, 221, 233));
	МассивЦветов.Добавить(Новый Цвет(255, 242, 128));
	МассивЦветов.Добавить(Новый Цвет(205, 145, 215));
	МассивЦветов.Добавить(Новый Цвет(125, 202, 194));
	//10
	МассивЦветов.Добавить(Новый Цвет(229, 216, 165));
	МассивЦветов.Добавить(Новый Цвет(178, 136, 143));
	МассивЦветов.Добавить(Новый Цвет(135, 151, 106));
	МассивЦветов.Добавить(Новый Цвет(94, 163, 153));
	МассивЦветов.Добавить(Новый Цвет(163, 137, 109));
	МассивЦветов.Добавить(Новый Цвет(169, 155, 174));
	МассивЦветов.Добавить(Новый Цвет(122, 131, 135));
	МассивЦветов.Добавить(Новый Цвет(132, 122, 112));
	МассивЦветов.Добавить(Новый Цвет(240, 185, 200));
	МассивЦветов.Добавить(Новый Цвет(158, 152, 131));
	//20
	МассивЦветов.Добавить(Новый Цвет(107, 195, 102));
	МассивЦветов.Добавить(Новый Цвет(188, 255, 189));
	МассивЦветов.Добавить(Новый Цвет(150, 197, 191));
	МассивЦветов.Добавить(Новый Цвет(193, 146, 64));
	МассивЦветов.Добавить(Новый Цвет(197, 146, 250));
	МассивЦветов.Добавить(Новый Цвет(210, 110, 71));
	МассивЦветов.Добавить(Новый Цвет(158, 140, 255));
	МассивЦветов.Добавить(Новый Цвет(114, 149, 92));
	МассивЦветов.Добавить(Новый Цвет(126, 144, 230));
	МассивЦветов.Добавить(Новый Цвет(252, 119, 87));
	//30
	МассивЦветов.Добавить(Новый Цвет(127, 192, 255));
	МассивЦветов.Добавить(Новый Цвет(179, 114, 101));
	
	Возврат МассивЦветов;
	
КонецФункции

#КонецОбласти

Функция ФильтрФайловИзображений() Экспорт
	
	Возврат "Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
		+ "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
		+ "|Формат GIF(*.gif*)|*.gif"
		+ "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
		+ "|Формат PNG(*.png*)|*.png"
		+ "|Формат TIFF(*.tif)|*.tif"
		+ "|Формат icon(*.ico)|*.ico"
		+ "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf";

КонецФункции

#Область ДатыЗапрета

//#9910
Процедура РасчетДатыЗапретаРасширение(Знач ВариантДатыЗапрета, Знач НачалоДня, 
	Знач СтаршеУказанныхДней, Знач СтаршеУказанныхМесяцев,
	ТекущаяДатаЗапрета, ПредыдущаяДатаЗапрета) Экспорт

	Сутки = 60*60*24;
	
	Если ВариантДатыЗапрета = "СтаршеУказанныхДней" Тогда
        ТекущаяДатаЗапрета    = НачалоДня(НачалоДня)          - СтаршеУказанныхДней*Сутки;
        ПредыдущаяДатаЗапрета = НачалоДня(ТекущаяДатаЗапрета) - СтаршеУказанныхДней*Сутки;
	ИначеЕсли ВариантДатыЗапрета = "СтаршеУказанныхМесяцев" Тогда		
        ТекущаяДатаЗапрета    = НачалоДня(ДобавитьМесяц(НачалоДня, -СтаршеУказанныхМесяцев))          - Сутки;
        ПредыдущаяДатаЗапрета = НачалоДня(ДобавитьМесяц(ТекущаяДатаЗапрета, -СтаршеУказанныхМесяцев)) - Сутки;
	КонецЕсли;
	
КонецПроцедуры

//#9910
Процедура ОбщаяДатаЗапретаСОписаниемПриИзмененииРасширение(Контекст) Экспорт
	
	Контекст.Элементы.СтаршеУказанныхДней.Видимость = Ложь;
	Контекст.Элементы.СтаршеУказанныхМесяцев.Видимость = Ложь;
	Если Контекст.ОписаниеДатыЗапрета = "СтаршеУказанныхДней" Тогда
		Контекст.РазрешитьИзменениеДанныхДоДатыЗапрета = Ложь;
		Контекст.Элементы.РазрешитьИзменениеДанныхДоДатыЗапрета.Доступность = Ложь;
		Контекст.КоличествоДнейРазрешения = 0;
		Контекст.СтаршеУказанныхДней = Макс(Контекст.СтаршеУказанныхДней, 1);
		Контекст.СтаршеУказанныхМесяцев = 0;
		Контекст.Элементы.СтаршеУказанныхДней.Видимость = Истина;
	ИначеЕсли Контекст.ОписаниеДатыЗапрета = "СтаршеУказанныхМесяцев" Тогда
		Контекст.РазрешитьИзменениеДанныхДоДатыЗапрета = Ложь;
		Контекст.Элементы.РазрешитьИзменениеДанныхДоДатыЗапрета.Доступность = Ложь;
		Контекст.КоличествоДнейРазрешения = 0;
		Контекст.СтаршеУказанныхМесяцев = Макс(Контекст.СтаршеУказанныхМесяцев, 1);
		Контекст.СтаршеУказанныхДней = 0;
		Контекст.Элементы.СтаршеУказанныхМесяцев.Видимость = Истина;
	Иначе
		Контекст.СтаршеУказанныхДней = 0;
		Контекст.СтаршеУказанныхМесяцев = 0;
	КонецЕсли;
	
	//++ #16658 пока закомментировано
	//Если Контекст.ОписаниеДатыЗапрета = "ПроизвольнаяДата" Тогда
	//	Если ЗначениеЗаполнено(Контекст.ДатаЗапрета) Тогда
	//		ТекстНадписи = СтрШаблон(НСтр("ru = 'Запрещен ввод и редактирование данных за все прошлые периоды
	//		|по %1'"), Формат(Контекст.ДатаЗапрета, "ДЛФ=Д"));				
	//		Контекст.ТекстНадписиОтносительнойДатыЗапрета = ТекстНадписи;
	//	Иначе
	//		ТекстНадписи = "Без запрета";
	//		Контекст.ТекстНадписиОтносительнойДатыЗапрета = ТекстНадписи;
	//	КонецЕсли;
	//КонецЕсли;	
	//-- #16658
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСАдресами

Функция УбратьИндексВАдресе(ПредставлениеАдреса) Экспорт
	
	Результат = ПредставлениеАдреса;
	Если СтрДлина(Результат) < 7 Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Лев(Результат, 6)) Тогда
		Результат = Сред(Результат, 7);
	КонецЕсли;
	
	Если Лев(Результат, 1) = "," Тогда
		Результат = Сред(Результат, 2);
	КонецЕсли;
	
	Результат = СокрЛП(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Доставка

// Возвращает структуру реквизитов доставки, заполненную пустыми значениями
//
// Возвращаемое значение - структура реквизитов доставки с пустыми значениями полей
//
Функция ПолучитьПустуюСтруктуруРеквизитовДоставки() Экспорт
	
	РеквизитыДоставки = Новый Структура;
	РеквизитыДоставки.Вставить("СпособДоставки", ОбщийМодульВызовСервера.СпособДоставкиПоУмолчанию());
	РеквизитыДоставки.Вставить("ГородДоставки",ПредопределенноеЗначение("Справочник.Города.ПустаяСсылка"));
	//РеквизитыДоставки.Вставить("ВремяДоставкиС",Дата(1,1,1));
	//РеквизитыДоставки.Вставить("ВремяДоставкиПо",Дата(1,1,1));
	РеквизитыДоставки.Вставить("АдресДоставки","");
	РеквизитыДоставки.Вставить("АдресДоставкиЗначение","");
	РеквизитыДоставки.Вставить("АдресДоставкиЗначенияПолей","");
	РеквизитыДоставки.Вставить("ДополнительнаяИнформацияПоДоставке","");
	Возврат РеквизитыДоставки;
	
КонецФункции

// Ищет в списке значений элемент-структуру, значение свойства которой равно искомому
//		Если такое значение не найдено, возвращается Неопределено
//	Параметры:
//		Список - список значений, в котором выполняется поиск
//		ИмяПоляСтруктуры - имя искомого свойства структуры
//		ИскомоеЗначение - значение, которое требуется найти
//
// Возвращаемое значение - структура, значение свойства которой совпадает с искомым,
//		если таких несколько, возвращается первая найденная
//
Функция НайтиВСпискеСтруктур(Список, ИмяПоляСтруктуры, ИскомоеЗначение) Экспорт
	
	Перем НайденноеЗначение;
	Для Каждого Элемент Из Список Цикл
		Элемент.Значение.Свойство(ИмяПоляСтруктуры, НайденноеЗначение);
		Если НайденноеЗначение = ИскомоеЗначение Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

// Очищает списки выбора адресов доставки и реквизиты доставки
//	Параметры:
//		ЭлементыФормы - все элементы формы, в которой очищаются списки выбора адресов доставки
//		ДокОбъект - объект, в котором очищаются реквизиты доставки
//
Процедура ОчиститьРеквизитыДоставки(ЭлементыФормы, ДокОбъект) Экспорт
	
	ОчиститьСпискиВыбораАдресовПолучателя(ЭлементыФормы);
	ЗаполнитьЗначенияСвойств(ДокОбъект, ПолучитьПустуюСтруктуруРеквизитовДоставки());
	
КонецПроцедуры

// Очищает списки выбора адресов доставки
//	Параметры:
//		ЭлементыФормы - все элементы формы, в которой очищаются списки выбора адресов доставки
//
Процедура ОчиститьСпискиВыбораАдресовПолучателя(ЭлементыФормы) Экспорт
	
	ЭлементыФормы.АдресДоставки.СписокВыбора.Очистить();
	
КонецПроцедуры

// Возвращает список значений. Преобразует в список значений строку полей, разделенных символом перевода строки
//
// Параметры:
//	СтрокаПолей - строка, в которой каждое поле начинается с новой строки.
//
// Возвращаемое значение - Список значений - список значений полей.
//
Функция ПреобразоватьСтрокуВСписокПолей(СтрокаПолей) Экспорт
	
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(СтрокаПолей) Тогда
		Возврат СтрокаПолей; // строка в новом формате, раскладывать в список не нужно
	КонецЕсли;
	
	Результат = Новый СписокЗначений;
	ПоследнийЭлемент = Неопределено;
	
	Для Итерация = 1 По СтрЧислоСтрок(СтрокаПолей) Цикл
		ПолученнаяСтрока = СтрПолучитьСтроку(СтрокаПолей, Итерация);
		Если Лев(ПолученнаяСтрока, 1) = Символы.Таб Тогда
			Если ПоследнийЭлемент <> Неопределено Тогда
				ПоследнийЭлемент.Значение = ПоследнийЭлемент.Значение + Символы.ПС + Сред(ПолученнаяСтрока, 2);
			КонецЕсли;
		Иначе
			ПозицияСимвола = Найти(ПолученнаяСтрока, "=");
			Если ПозицияСимвола <> 0 Тогда
				ПоследнийЭлемент = Результат.Добавить(Сред(ПолученнаяСтрока, ПозицияСимвола + 1), Лев(ПолученнаяСтрока, ПозицияСимвола - 1));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСФайлами

// получает файл по http-ссылке
// URLАдрес - http-ссылка на файл
// ОжидаемоеРасширениеФайла в формате ".xls"
// ДанныеАвторизации - структура(Логин, Пароль), если надо авторизоваться для скачивания файла
Функция ПолучитьФайлЗаписиПоHttpСсылке(Знач URLАдрес, 
										ТолькоПроверка = Ложь,
	                                    ОжидаемоеРасширениеФайла = ".txt",
										ДанныеАвторизации = Неопределено) Экспорт
										 
	Результат = Новый Структура("ПутьКФайлу, КодОтвета", "", -1);
	
	Адрес="";
	РазделительСхемы = "://"; 
	ПозицияСхемы = СтрНайти(URLАдрес, РазделительСхемы);
	Если ПозицияСхемы = 0 Тогда
		Возврат Результат;
	КонецЕсли; 
	Схема = Лев(URLАдрес, ПозицияСхемы-1) + РазделительСхемы;
	
	ПутьСсылки = СтрЗаменить(URLАдрес, Схема, "");	
	Колво = СтрЧислоВхождений(ПутьСсылки,"/");
	Для Индекс=1 По Колво Цикл		
		Позиция = СтрНайти(ПутьСсылки,"/");
		Если Позиция > 0 Тогда				
			Если Индекс=1 Тогда
				Адрес = Лев(ПутьСсылки, Позиция-1);
			КонецЕсли;		
			ПутьСсылки = Сред(ПутьСсылки, Позиция+1);			
		КонецЕсли;	
	КонецЦикла;
	
	Таймаут=10;
	ssl = Новый ЗащищенноеСоединениеOpenSSL;
	
	Если Схема="https://" Тогда	
		HTTPСоединение=Новый HTTPСоединение(Адрес,,,,,,ssl);
	ИначеЕсли Схема="http://" Тогда
		HTTPСоединение=Новый HTTPСоединение(Адрес);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	Заголовки = Новый Соответствие(); 
	Если НЕ ДанныеАвторизации = Неопределено Тогда
   		Заголовки.Вставить("Authorization", "Basic " + ПолучитьBase64ЗаголовокАвторизации(ДанныеАвторизации.Логин, ДанныеАвторизации.Пароль));
	КонецЕсли;
	 
	АдресПуть = СтрЗаменить(URLАдрес, Схема+Адрес, "");
	HTTPЗапрос = Новый HTTPЗапрос(АдресПуть, Заголовки);
	//HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос); // post	
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);                // get
	
	Результат.КодОтвета = HTTPОтвет.КодСостояния;
	
	Если ТолькоПроверка Тогда		
		Возврат Результат;
	КонецЕсли;
		
	Если HTTPОтвет.КодСостояния = 200 Тогда
		ФайлЗаписи = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
		
		Каталог = КаталогВременныхФайлов();
		Если НЕ Прав(Каталог, 1) = "\" Тогда
			Каталог = Каталог + "\";	
		КонецЕсли;
		Если ПустаяСтрока(ПутьСсылки) Тогда
			#Если НЕ ВебКлиент Тогда
				ПутьКФайлу = ПолучитьИмяВременногоФайла(ОжидаемоеРасширениеФайла);
			#Иначе
				ПутьКФайлу = ннаАдаптацияВебКлиента.ПолучитьИмяВременногоФайлаСервер(ОжидаемоеРасширениеФайла); //нна 
			#КонецЕсли	
		Иначе
			ПутьКФайлу = Каталог + ПутьСсылки;
		КонецЕсли;
		
		ЧислоСимволовПослеТочкиВКонце = (СтрДлина(ПутьКФайлу) - СтрНайти(ПутьКФайлу, ".", НаправлениеПоиска.СКонца));
		
		Если НЕ (ЧислоСимволовПослеТочкиВКонце = 3 Или ЧислоСимволовПослеТочкиВКонце = 4) Тогда			
			ПутьКФайлу = ПутьКФайлу + ОжидаемоеРасширениеФайла;			
		КонецЕсли;
		
		ФайлЗаписи.Записать(ПутьКФайлу);
		
		Результат.ПутьКФайлу = ПутьКФайлу;
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьBase64ЗаголовокАвторизации(ИмяПользователя, Пароль)

    КодировкаФайла = КодировкаТекста.UTF8;
	#Если НЕ ВебКлиент Тогда
		ВременныйФайл = ПолучитьИмяВременногоФайла();
	#Иначе
		ВременныйФайл = ннаАдаптацияВебКлиента.ПолучитьИмяВременногоФайлаСервер(); //нна 
	#КонецЕсли
    Запись = Новый ЗаписьТекста(ВременныйФайл, КодировкаФайла);
    Запись.Записать(ИмяПользователя+":"+Пароль);
    Запись.Закрыть();

    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
    Результат = Base64Строка(ДвДанные);
    УдалитьФайлы(ВременныйФайл);

    Результат = Сред(Результат,5);

    Возврат Результат;

КонецФункции

Функция ПрочитатьФайлCSV(ПутьКФайлу, КодировкаФайла, НачальнаяСтрока = 1, ТекстОшибки) Экспорт
	
	МассивСтрок = Новый Массив;
	
	Текст = Новый ТекстовыйДокумент();
	Текст.Прочитать(ПутьКФайлу, КодировкаФайла);
	
	Если Текст.КоличествоСтрок() < НачальнаяСтрока Тогда
		Возврат МассивСтрок;
	КонецЕсли; 
	
	Для ИндексСтроки = НачальнаяСтрока По Текст.КоличествоСтрок() Цикл
		
		ТекущаяСтрока = Текст.ПолучитьСтроку(ИндексСтроки);
		Если Не ЗначениеЗаполнено(ТекущаяСтрока) Тогда
			Продолжить;
		КонецЕсли;
		МассивСтрок.Добавить(ТекущаяСтрока);
	КонецЦикла;
	
	Возврат МассивСтрок;
		
КонецФункции

Функция ОбрезатьСтрокуCSV(Знач СтрокаФайла) Экспорт
	
	СтрокаФайла	= СокрЛП(СтрокаФайла);
	Если Лев(СтрокаФайла, 1) = """" И Прав(СтрокаФайла, 1) = """" Тогда
		СтрокаФайла = Сред(СтрокаФайла, 2, СтрДлина(СтрокаФайла)-2);	
	КонецЕсли;
	
	Возврат СтрокаФайла;
		
КонецФункции

#КонецОбласти

#Область РаботаСГрафикомОплат

Функция РассчитатьПлатежПоГрафику(ПараметрыГрафика) Экспорт
	
	КРаспределению = ПараметрыГрафика.Сумма - ПараметрыГрафика.СуммаПервоначальногоВзноса;
	Если КРаспределению < 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Платеж = Окр(КРаспределению / ПараметрыГрафика.КоличествоПериодов, 2);
	Если ПараметрыГрафика.ОкруглятьПлатеж Тогда
		Платеж = ОбщийМодуль.ОкруглитьЧисло(Платеж, ПараметрыГрафика.ПорядокОкругленияЧислом, ПараметрыГрафика.ОкруглятьВБольшуюСторону);
	КонецЕсли;
	
	Возврат Платеж;
	
КонецФункции

//#16286
Функция РаспределитьГрафикОплат(ПараметрыГрафика) Экспорт
	
	//ПараметрыГрафика = Новый Структура("Сумма, ДатаНачала, СуммаПервоначальногоВзноса, Периодичность, КоличествоПериодов,
	//									|ОкруглятьПлатеж, ПорядокОкругленияЧислом, ОкруглятьВБольшуюСторону");
	
	МассивОплат = Новый Массив;
	СтруктураСтроки = Новый Структура("ДатаПлатежа, Сумма", ПараметрыГрафика.ДатаНачала, ПараметрыГрафика.СуммаПервоначальногоВзноса);
	КРаспределению = ПараметрыГрафика.Сумма - ПараметрыГрафика.СуммаПервоначальногоВзноса;
	Если КРаспределению < 0 Тогда
		СтруктураСтроки.Сумма = ПараметрыГрафика.Сумма;
		МассивОплат.Добавить(СтруктураСтроки);
		Возврат МассивОплат;
	КонецЕсли;
	
	// первоначальный платеж (вне графика)
	МассивОплат.Добавить(СтруктураСтроки);
	
	Платеж = РассчитатьПлатежПоГрафику(ПараметрыГрафика);
	
	Если Платеж = 0 Тогда
		Возврат МассивОплат;	
	КонецЕсли;
	
	Распределено = 0; 
	ДатаПлатежа = ПараметрыГрафика.ДатаНачала;
	Для Сч = 1 по ПараметрыГрафика.КоличествоПериодов Цикл
		Если ПараметрыГрафика.Периодичность = 0 Тогда
			ДатаПлатежа = ДобавитьМесяц(ДатаПлатежа, 1);
		Иначе
			// день
			ДатаПлатежа = ДатаПлатежа + 86400;
		КонецЕсли;
		
		СтруктураСтроки = Новый Структура("ДатаПлатежа, Сумма", ДатаПлатежа, Платеж);
		Распределено = Распределено + Платеж;
		
		Если Сч = ПараметрыГрафика.КоличествоПериодов Тогда
			СтруктураСтроки.Сумма = СтруктураСтроки.Сумма + (КРаспределению - Распределено);	
		КонецЕсли;
		
		МассивОплат.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	Возврат МассивОплат;
	
КонецФункции

#КонецОбласти

//аналог ОбщегоНазначения.ДанныеСовпадают
// нужен был Вызов с клиента
Функция СтруктурыСовпадают(Данные1, Данные2) Экспорт
	
	Если ТипЗнч(Данные1) <> ТипЗнч(Данные2) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Данные1) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если Данные1.Количество() <> Данные2.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого КлючИЗначение Из Данные1 Цикл
		СтароеЗначение = Неопределено;
		
		Если НЕ Данные2.Свойство(КлючИЗначение.Ключ, СтароеЗначение)
			ИЛИ НЕ КлючИЗначение.Значение = СтароеЗначение Тогда
			
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
		
	