
Функция СтруктураДействийПоСпецификациямВЗаказДоговоре() Экспорт
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("АвтоматическиЗаполнятьМатериалы", 			Константы.АвтоматическиЗаполнятьМатериалыПоСпецификациям.Получить());
	СтруктураДействий.Вставить("ПодтверждениеПриДобавленииНоменклатуры", 	Константы.ЗадаватьВопросПриДобавленииНоменклатурыСоСпецификацией.Получить());
	СтруктураДействий.Вставить("ПодтверждениеПриИзмененииКоличества", 		Константы.ЗадаватьВопросПриИзмененииКоличестваТовараСУказаннойСпецификацией.Получить());
	СтруктураДействий.Вставить("ПодтверждениеПриИзмененииСпецификации", 	Константы.ЗадаватьВопросПриИзмененииСпецификации.Получить());
	СтруктураДействий.Вставить("ПодтверждениеПриУдалении", 					Константы.ЗадаватьВопросПриУдаленииТовараСУказаннойСпецификацией.Получить());
	Возврат СтруктураДействий;
	
КонецФункции

Функция СтруктураСпособовДобавленияПродукции() Экспорт

	НаборКонстант = Константы.СоздатьНабор("СпособДобавленияПродукцииЗагрузитьИзПостроителя, 
									|СпособДобавленияПродукцииВыбратьПотолок,
									|СпособДобавленияПродукцииСоздатьПотолок,
									|СпособДобавленияПродукцииСоздатьПродукцию,
									|СпособДобавленияПродукцииСоздатьКонструкцию");

	НаборКонстант.Прочитать();
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("СпособДобавленияПродукцииЗагрузитьИзПостроителя", 		НаборКонстант.СпособДобавленияПродукцииЗагрузитьИзПостроителя);
	СтруктураДействий.Вставить("СпособДобавленияПродукцииВыбратьПотолок", 				НаборКонстант.СпособДобавленияПродукцииВыбратьПотолок);
	СтруктураДействий.Вставить("СпособДобавленияПродукцииСоздатьПотолок", 				НаборКонстант.СпособДобавленияПродукцииСоздатьПотолок);
	СтруктураДействий.Вставить("СпособДобавленияПродукцииСоздатьПродукцию", 			НаборКонстант.СпособДобавленияПродукцииСоздатьПродукцию);
	СтруктураДействий.Вставить("СпособДобавленияПродукцииСоздатьКонструкцию", 			НаборКонстант.СпособДобавленияПродукцииСоздатьКонструкцию);
	
	Возврат СтруктураДействий;
	
КонецФункции

// Устанавливает отбор по списку значений и указанному полю.
//
// Параметры:
//  КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - Компоновщик Настроек отчета.
//  ИмяПоля - Строка - строка с именем поля.
//  СписокЗначенийОтбора - СписокЗначений - список значений устанавливаемых в отбор.
//  ОтключатьОтборПриПустомСписке - Булево - если список пустой по отбор отключается,
//                                           иначе будет отбор по пустому правому значению.
//
Процедура УстановитьОтборВКомпоновщикеПоСписку(КомпоновщикНастроек, ИмяПоля, СписокЗначенийОтбора, ОтключатьОтборПриПустомСписке = Истина) Экспорт
	
	НайденЭлементОтбора = Ложь;
	КоллекцияЭлементовОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	ДоступноеПолеКомпоновки = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.Элементы.Найти(ИмяПоля);
	
	Если ДоступноеПолеКомпоновки = Неопределено Тогда
		Возврат;
	Иначе
		ПолеКомпоновки = ДоступноеПолеКомпоновки.Поле;
	КонецЕсли;
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементовОтбора Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			НайденЭлементОтбора = Истина;
			ЭлементОтбораПоля   = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СписокЗначенийОтбора.Количество() = 0 Тогда
		Если ОтключатьОтборПриПустомСписке Тогда
			Если НайденЭлементОтбора Тогда
				ЭлементОтбораПоля.Использование = Ложь;
			КонецЕсли; 
		Иначе
			Если Не НайденЭлементОтбора Тогда
				ЭлементОтбораПоля = КоллекцияЭлементовОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбораПоля.ЛевоеЗначение = ПолеКомпоновки;
				НайденЭлементОтбора = Истина;
			КонецЕсли;
			
			ЭлементОтбораПоля.ПравоеЗначение = СписокЗначенийОтбора;
			ЭлементОтбораПоля.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбораПоля.Использование = Истина;
		КонецЕсли;
	Иначе
		Если Не НайденЭлементОтбора Тогда
			ЭлементОтбораПоля = КоллекцияЭлементовОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораПоля.ЛевоеЗначение = ПолеКомпоновки;
			НайденЭлементОтбора = Истина;
		КонецЕсли;
		
		Если СписокЗначенийОтбора.Количество() = 1 Тогда
			ЭлементОтбораПоля.ПравоеЗначение = СписокЗначенийОтбора[0].Значение;
			ЭлементОтбораПоля.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		Иначе
			ЭлементОтбораПоля.ПравоеЗначение = СписокЗначенийОтбора;
			ЭлементОтбораПоля.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли;
		ЭлементОтбораПоля.Использование = Истина;
		
	КонецЕсли;
	
	Если НайденЭлементОтбора Тогда
		
		ЭлементПользовательскогоОтбораПоля = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбораПоля.ИдентификаторПользовательскойНастройки);
		
		Если НЕ ЭлементПользовательскогоОтбораПоля = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ЭлементПользовательскогоОтбораПоля, ЭлементОтбораПоля)
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьОтборВСписке()

// Возвращает ссылку на новый элемент отбора в переданном отборе схемы компоновки данных.
//
// Параметры:
//  Отбор - ОтборКомпоновкиДанных - отбор схемы компоновки, в который необходимо добавить новый элемент
//  ЛевоеЗначение - Строка, ПолеКомпоновкиДанных - поле компоновки, по которому необходимо установить отбор (необязательное)
//  ПравоеЗначение  - Произвольный, Строка, ПолеКомпоновкиДанных - значение отбора (необязательное) или поле компоновки
//  ТипОтбора  - ЭлементОтбораКомпоновкиДанных, ГруппаЭлементовОтбораКомпоновкиДанных - тип нового элемента отбора (необязательное)
//  ВидСравнения  - ВидСравненияКомпоновкиДанных - вид сравнения левого и правого значения
//  ПравоеЗначениеПоле  - Булево - указывает использовать ли в качестве правого значения поле компоновки данных.
//
// Возвращаемое значение:
//  ЭлементОтбораКомпоновкиДанных - ссылка на новый элемент отбора схемы компоновки данных.
//
Функция НовыйОтбор(Отбор, ЛевоеЗначение, ПравоеЗначение = Неопределено, ТипОтбора = Неопределено, ВидСравнения = Неопределено, ПравоеЗначениеПоле = Ложь) Экспорт
	
	Если ТипОтбора = Неопределено Тогда
		ТипОтбора = Тип("ЭлементОтбораКомпоновкиДанных");
	КонецЕсли;
	
	НовыйОтбор = Отбор.Элементы.Добавить(ТипОтбора);
	Если ЛевоеЗначение <> Неопределено Тогда
		Если ТипЗнч(ЛевоеЗначение) = Тип("ПолеКомпоновкиДанных") Тогда
			НовыйОтбор.ЛевоеЗначение = ЛевоеЗначение;
		Иначе
			НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ЛевоеЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Если ПравоеЗначение <> Неопределено Тогда
		Если ПравоеЗначениеПоле Тогда
			Если ТипЗнч(ПравоеЗначение) = Тип("ПолеКомпоновкиДанных") Тогда
				НовыйОтбор.ПравоеЗначение = ПравоеЗначение;
			Иначе
				НовыйОтбор.ПравоеЗначение = Новый ПолеКомпоновкиДанных(ПравоеЗначение);
			КонецЕсли;
		Иначе
			НовыйОтбор.ПравоеЗначение = ПравоеЗначение;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипОтбора = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		Если ВидСравнения = Неопределено Тогда
			НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Если ТипЗнч(ПравоеЗначение) = Тип("Массив") ИЛИ ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений") Тогда
				НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			КонецЕсли;
		Иначе
			НовыйОтбор.ВидСравнения = ВидСравнения;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НовыйОтбор;
	
КонецФункции

#Область НастройкиПользователя

Функция НастройкаПользователя(ИмяНастройки, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, ИмяНастройки);
	
КонецФункции

Функция НастройкиПользователя(СписокНастроек, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, СписокНастроек);
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииФормированияКомандныхПанелейФорм

//// Заполнение параметров получения списка команд этой формы.
////   Событие возникает перед вызовом модуля повторного использования для определения параметров
////   форм, в которых выводятся подключаемые команды.
////
//// Параметры:
////   Форма - УправляемаяФорма - Форма, в которой выводятся подключаемые команды. Для чтения.
////   ИспользуемыеПодменю - Массив из Строк - Имена групп формы, которые используются в этой форме. Для изменения.
////
//Процедура ПриОпределенииИспользуемыхПодменю(Форма, ИспользуемыеПодменю) Экспорт
//	Если Форма.Элементы.Найти("ПерваяГруппаКнопокКП") <> Неопределено Тогда
//		ИспользуемыеПодменю.Добавить("ПерваяГруппаКнопокКП");
//	КонецЕсли;
//КонецПроцедуры

//// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.
//Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
//	КомандыПервойГруппы = Команды.СкопироватьКолонки();
//	КомандыПервойГруппы.Колонки.Добавить("Обработана", Новый ОписаниеТипов("Булево"));
//	КомандыПервойГруппы.Индексы.Добавить("Обработана");
//	
//	СтандартнаяОбработка = Истина; //Источники.Строки.Количество() > 0;
//	КомандыПервойГруппы.ЗаполнитьЗначения(Истина, "Обработана");
//	
//	ДопустимыеТипы = Новый Массив; // Типы источников, которые пользователь может изменять (см. ниже проверку права "Изменение").
//	Если СтандартнаяОбработка Тогда
//		// 1. Выполнение обработки обновления объектов 
//		ОбъектыСКомандамиВыполненияОбработки = ОбработкаОбновлений.ОбъектыСКомандамиВыполненияОбработкиОбновления();
//		//Для Каждого Источник Из Источники.Строки Цикл
//		//Для Каждого ДокументРегистратор Из Источник.Строки Цикл
//		ДокументРегистратор = Источники; // Потолки: на данный момент Источники не дерево (как в БСП 3), а структура 
//		ПодключаемыеКоманды.ДополнитьМассивТипов(ДопустимыеТипы, ДокументРегистратор.ТипСсылкиДанных);
//		Если ОбъектыСКомандамиВыполненияОбработки.Найти(ДокументРегистратор.Метаданные) <> Неопределено 
//			И ПравоДоступа("Изменение", ДокументРегистратор.Метаданные) Тогда
//			ОбработкаОбновлений.ПриДобавленииКомандОбработкиОбновления(КомандыПервойГруппы, ДокументРегистратор, НастройкиФормы);
//		КонецЕсли;
//		//КонецЦикла;
//		//ПодключаемыеКоманды.ДополнитьМассивТипов(ДопустимыеТипы, Источник.ТипСсылкиДанных);
//		//Если ОбъектыСКомандамиСозданияНаОсновании.Найти(Источник.Метаданные) <> Неопределено Тогда
//		//	ПриДобавленииКомандСозданияНаОсновании(КомандыСозданияНаОсновании, Источник, НастройкиФормы);
//		//КонецЕсли;
//		//КонецЦикла;
//	КонецЕсли;
//	
//	Если ДопустимыеТипы.Количество() = 0 Тогда
//		Возврат; // Все закрыто и команд расширений с допустимыми типами тоже не будет.
//	КонецЕсли;
//	
//	Для Каждого КомандаПервойГруппы Из КомандыПервойГруппы Цикл
//		Команда = Команды.Добавить();
//		ЗаполнитьЗначенияСвойств(Команда, КомандаПервойГруппы);
//		Команда.Вид = "ОбработкаОбновления";
//		Если Команда.Порядок = 0 Тогда
//			Команда.Порядок = 50;
//		КонецЕсли;
//		Если Команда.РежимЗаписи = "" Тогда
//			Команда.РежимЗаписи = "Записывать";
//		КонецЕсли;
//		Если Команда.МножественныйВыбор = Неопределено Тогда
//			Команда.МножественныйВыбор = Ложь;
//		КонецЕсли;
//		Если Команда.ПараметрыФормы = Неопределено Тогда
//			Команда.ПараметрыФормы = Новый Структура;
//		КонецЕсли;
//	КонецЦикла;
//КонецПроцедуры

//Процедура ПриВыводеКоманды(Команда, КомандаФормы, КнопкаФормы) Экспорт
//	
//	Если ТипЗнч(Команда.ДополнительныеПараметры) = Тип("Структура") Тогда
//		Если Команда.ДополнительныеПараметры.Свойство("Подсказка") Тогда
//			КомандаФормы.Подсказка = Команда.ДополнительныеПараметры.Подсказка;	
//		КонецЕсли;
//		Если Команда.ДополнительныеПараметры.Свойство("ЦветФона") Тогда
//			КнопкаФормы.ЦветФона = Команда.ДополнительныеПараметры.ЦветФона;	
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииФормированияПечатныхФорм

//
Функция ПредставлениеХарактеристики(Характеристика) Экспорт

	Результат = "(";
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Результат = Результат + Характеристика;
	КонецЕсли;	
	Результат = Результат + ")";
	Возврат ?(Результат = "()", "", " " + Результат)

КонецФункции

// Возвращает структуру данных со сводным описанием контрагента.
//
// Параметры: 
//  СписокСведений - список значений со значениями параметров организации
//   СписокСведений формируется функцией СведенияОЮрФизЛице
//  Список         - список запрашиваемых параметров организации
//  СПрефиксом     - Признак выводить или нет префикс параметра организации
//
// Возвращаемое значение:
//  Строка - описатель организации / контрагента / физ.лица.
//
Функция ОписаниеОрганизации(СписокСведений, Знач Список = "", СПрефиксом = Истина) Экспорт
	
	Результат = "";
	
	СоответствиеПараметров = Новый Соответствие();
	СоответствиеПараметров.Вставить("ПолноеНаименование",		" ");
	СоответствиеПараметров.Вставить("ИНН",						" ИНН ");
	СоответствиеПараметров.Вставить("КПП",						" КПП ");
	СоответствиеПараметров.Вставить("РегистрационныйНомер",		" ");
	СоответствиеПараметров.Вставить("Свидетельство",			" ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи",	" от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес",			" ");
	СоответствиеПараметров.Вставить("ПочтовыйАдрес",			" ");
	СоответствиеПараметров.Вставить("Телефоны",					" тел.: ");
	СоответствиеПараметров.Вставить("Факс",						" факс: ");
	СоответствиеПараметров.Вставить("НомерСчета",				" р/с ");
	СоответствиеПараметров.Вставить("Банк",						" в банке ");
	СоответствиеПараметров.Вставить("БИК",						" БИК ");
	СоответствиеПараметров.Вставить("КоррСчет",					" к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО",				" Код по ОКПО ");
	
	Список          = Список + ?(Прав(Список, 1) = ",", "", ",");
	ЧислоПараметров = СтрЧислоВхождений(Список, ",");
	
	Для Счетчик = 1 по ЧислоПараметров Цикл
		
		ПозЗапятой = СтрНайти(Список, ",");
		
		Если ПозЗапятой > 0  Тогда
			ИмяПараметра = Лев(Список, ПозЗапятой - 1);
			Список = Сред(Список, ПозЗапятой + 1, СтрДлина(Список));
			
			Попытка
				СтрокаДополнения = "";
				СписокСведений.Свойство(ИмяПараметра, СтрокаДополнения);
				
				//Если ТипЗнч(СтрокаДополнения) = Тип("СправочникСсылка.Банки") Тогда
				//	СтрокаДополнения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДополнения, "Наименование");
				//КонецЕсли;
				
				Если ПустаяСтрока(СтрокаДополнения) Тогда
					Продолжить;
				КонецЕсли;
				
				Префикс = СоответствиеПараметров[СокрЛП(ИмяПараметра)];
				Если Не ПустаяСтрока(Результат)  Тогда
					Результат = Результат + ", ";
				КонецЕсли; 
				
				Результат = Результат + ?(СПрефиксом = Истина, Префикс, "") + СтрокаДополнения;
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru = 'Не удалось определить значение параметра организации: '") + ИмяПараметра;
				Сообщение.Сообщить();
				
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат СокрЛП(Результат);
	
КонецФункции // ОписаниеОрганизации()

Функция СведенияОбОрганизации(Организация, Знач ДатаПериода = Неопределено) Экспорт
	
	Если ДатаПериода = Неопределено Тогда
		ДатаПериода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Сведения = Новый Структура("Представление, ПолноеНаименование, КодПоОКПО, ИНН, КПП, Телефоны, Факс, ЮридическийАдрес, ФактическийАдрес, Банк, БИК, КоррСчет, ТекстКорреспондента, НомерСчета, АдресБанка, ЭлектроннаяПочта");
	Запрос   = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Представление КАК Наименование,
	|	ВЫБОР
	|		КОГДА НЕ Организации.ПолноеНаименование = """"
	|			ТОГДА Организации.ПолноеНаименование
	|		ИНАЧЕ Организации.Наименование
	|	КОНЕЦ КАК ПолноеНаименование,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Организации.ОсновнойБанковскийСчет.БИК КАК БИК,
	|	Организации.ОсновнойБанковскийСчет.КоррСчет КАК КоррСчет,
	|	Организации.ОсновнойБанковскийСчет.НаименованиеБанка КАК Банк
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Сведения;
	КонецЕсли;
	
	Данные = Результат.Выбрать();
	Данные.Следующий();
	
	Сведения.Вставить("Представление", Данные.Наименование);
	ЗаполнитьЗначенияСвойств(Сведения, Данные);
	Если НЕ ЗначениеЗаполнено(Сведения.ПолноеНаименование) Тогда		
		Сведения.ПолноеНаименование = Сведения.Представление;		
	КонецЕсли;
	
	Сведения.Вставить("Телефоны", 		  ПолучитьТелефонИзКонтактнойИнформации(Организация));
	Сведения.Вставить("ЭлектроннаяПочта", ПолучитьЭлектроннуюПочтуИзКонтактнойИнформации(Организация));
	
	Сведения.Вставить("ЮридическийАдрес", ПолучитьАдресИзКонтактнойИнформации(Организация, "Юридический", ДатаПериода));
	Сведения.Вставить("ФактическийАдрес", ПолучитьАдресИзКонтактнойИнформации(Организация, "Фактический", ДатаПериода));
	
	Возврат Сведения;
	
КонецФункции

Функция СведенияОКонтрагенте(Контрагент, Знач ДатаПериода = Неопределено) Экспорт
	
	Если ДатаПериода = Неопределено Тогда
		ДатаПериода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Сведения = Новый Структура("Представление, ПолноеНаименование, КодПоОКПО, ИНН, КПП, Телефоны, Факс, ЮридическийАдрес, ФактическийАдрес, Банк, БИК, КоррСчет, ТекстКорреспондента, НомерСчета, АдресБанка, ЭлектроннаяПочта");
	Запрос   = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Представление КАК Наименование,
	|	ВЫБОР
	|		КОГДА НЕ Контрагенты.НаименованиеПолное = """"
	|			ТОГДА Контрагенты.НаименованиеПолное
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ КАК ПолноеНаименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	ВЫБОР
	|		КОГДА Контрагенты.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ Контрагенты.ОсновнойБанковскийСчет.НомерСчета
	|	КОНЕЦ КАК НомерСчета,
	|	ВЫБОР
	|		КОГДА Контрагенты.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ Контрагенты.ОсновнойБанковскийСчет.БИК
	|	КОНЕЦ КАК БИК,
	|	ВЫБОР
	|		КОГДА Контрагенты.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ Контрагенты.ОсновнойБанковскийСчет.КоррСчет
	|	КОНЕЦ КАК КоррСчет,
	|	ВЫБОР
	|		КОГДА Контрагенты.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ Контрагенты.ОсновнойБанковскийСчет.НаименованиеБанка
	|	КОНЕЦ КАК Банк
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Сведения;
	КонецЕсли;
	
	Данные = Результат.Выбрать();
	Данные.Следующий();
	
	Сведения.Вставить("Представление", Данные.Наименование);
	ЗаполнитьЗначенияСвойств(Сведения, Данные);
	Если НЕ ЗначениеЗаполнено(Сведения.ПолноеНаименование) Тогда		
		Сведения.ПолноеНаименование = Сведения.Представление;		
	КонецЕсли;
	
	Сведения.Вставить("Телефоны", 		  ПолучитьТелефонИзКонтактнойИнформации(Контрагент));
	Сведения.Вставить("ЭлектроннаяПочта", ПолучитьЭлектроннуюПочтуИзКонтактнойИнформации(Контрагент));
	
	Сведения.Вставить("ЮридическийАдрес", ПолучитьАдресИзКонтактнойИнформации(Контрагент, "Юридический", ДатаПериода));
	Сведения.Вставить("ФактическийАдрес", ПолучитьАдресИзКонтактнойИнформации(Контрагент, "Фактический", ДатаПериода));
	
	Возврат Сведения;
	
КонецФункции

Функция ПредставлениеЮридическогоАдреса(ЮридическийАдрес, ЭтоЮрЛицо = Истина) Экспорт
	
	ПредставлениеЮридическогоАдреса = "";	
	Если НЕ ПустаяСтрока(ЮридическийАдрес) Тогда
		Если ЭтоЮрЛицо Тогда
			ПредставлениеЮридическогоАдреса = "Юридический адрес: " + ЮридическийАдрес;
		Иначе
			ПредставлениеЮридическогоАдреса = "Адрес регистрации: " + ЮридическийАдрес;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПредставлениеЮридическогоАдреса;
	
КонецФункции

// Функция находит актуальное значение адреса в контактной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации
//  ТипАдреса - тип контактной информации
//	Дата - Дата - Дата, на которую надо получить юридический адрес организации. При незаполненном параметре будет получен 
//                   актуальный адрес. Для других типов адресов этот параметр можно не заполнять.
//
// Возвращаемое значение:
//  Строка - представление найденного адреса.
//
Функция ПолучитьАдресИзКонтактнойИнформации(Объект, ТипАдреса = "", Дата = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Объект) Тогда
		
		Начало = "Факт";
		Если ТипАдреса = "Юридический" Тогда
			Начало = "Юр";
		ИначеЕсли ТипАдреса = "Почтовый" Тогда
			Начало = "Почтовый";
		КонецЕсли;
		
		Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
			Окончание = "Организации";
		ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
			Окончание = "Контрагента";
		КонецЕсли;
		
		ВидАдреса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ВидыКонтактнойИнформации[Начало + "Адрес" + Окончание], "Ссылка");
		
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект, ВидАдреса, Дата);
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции // ПолучитьАдресИзКонтактнойИнформации()

// Функция находит актуальное значение телефона в контактной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//
// Возвращаемое значение:
//  Строка - представление найденного телефона.
//
Функция ПолучитьТелефонИзКонтактнойИнформации(Объект) Экспорт
	
	Если ЗначениеЗаполнено(Объект) Тогда
		
		Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
			Окончание = "Организации";
		ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
			Окончание = "Контрагента";
		ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Сотрудники") Тогда
			Окончание = "Сотрудника";
		КонецЕсли;
		
		ВидТелефона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ВидыКонтактнойИнформации["Телефон" + Окончание], "Ссылка");
		
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект, ВидТелефона, ТекущаяДатаСеанса());
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции // ПолучитьТелефонИзКонтактнойИнформации()

// Функция находит актуальное значение электронной почты в контактной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//
// Возвращаемое значение:
//  Строка - представление найденной электронной почты.
//
Функция ПолучитьЭлектроннуюПочтуИзКонтактнойИнформации(Объект) Экспорт
	
	Если ЗначениеЗаполнено(Объект) Тогда
		
		Окончание = "";
		Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
			Окончание = "Организации";
		ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
			Окончание = "Контрагента";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Окончание) Тогда
			ВидКИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ВидыКонтактнойИнформации["Email" + Окончание], "Ссылка");
			Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект, ВидКИ, ТекущаяДатаСеанса());
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Возвращает представление номенклатуры для печати.
//
Функция ПредставлениеНоменклатурыДляПечати(Номенклатура, Характеристика = Неопределено) Экспорт
	
	//++ №12909 входные параметры переделаны на ссылки
	НаименованиеХарактеристикиДляПечати = "";
	
	Если ТипЗнч(Характеристика) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		НаименованиеХарактеристикиДляПечати = Характеристика.Наименование;
	КонецЕсли;
	
	Если ПустаяСтрока(Номенклатура.НаименованиеДляПечати) Тогда
		НаименованиеНоменклатурыДляПечати = Номенклатура.Наименование;
	Иначе
		НаименованиеНоменклатурыДляПечати = Номенклатура.НаименованиеДляПечати;
	КонецЕсли;
	//-- №12909
	
	ТекстВСкобкахСтрока = НаименованиеХарактеристикиДляПечати;
	
	Если ЗначениеЗаполнено(ТекстВСкобкахСтрока) Тогда
		ПредставлениеНоменклатуры = НСтр("ru = '%НаименованиеНоменклатурыДляПечати% (%ТекстВСкобках%)'");
		ПредставлениеНоменклатуры = СтрЗаменить(ПредставлениеНоменклатуры, "%ТекстВСкобках%", СокрЛП(ТекстВСкобкахСтрока));
	Иначе
		ПредставлениеНоменклатуры = НСтр("ru = '%НаименованиеНоменклатурыДляПечати%'");
	КонецЕсли;
	
	ПредставлениеНоменклатуры = СтрЗаменить(ПредставлениеНоменклатуры, "%НаименованиеНоменклатурыДляПечати%", СокрЛП(НаименованиеНоменклатурыДляПечати));
	
	Возврат ПредставлениеНоменклатуры;
	
КонецФункции

Функция ПредставлениеДокументаФизлица(ДанныеДокумента) Экспорт
	
	ПаспортПредставление = "";
	Если НЕ ПустаяСтрока(ДанныеДокумента.ПаспортНомер) Тогда
		ПаспортПредставление = "Документ: " + ДанныеДокумента.ПаспортВид + " серия: " + ДанныеДокумента.ПаспортСерия
		+ " номер: " + ДанныеДокумента.ПаспортНомер + ", выдан: " + ДанныеДокумента.ПаспортКемВыдан + " " + Формат(ДанныеДокумента.ПаспортДатаВыдачи, "ДЛФ=Д");
	КонецЕсли;
	Возврат ПаспортПредставление;
	
КонецФункции

Функция ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса) Экспорт
	
	РезультатЗапроса.Колонки.Добавить("ОрганизацияОсновнойТелефон");
	РезультатЗапроса.Колонки.Добавить("ОрганизацияСайт");
	РезультатЗапроса.Колонки.Добавить("ОрганизацияЭлектроннаяПочта");
	РезультатЗапроса.Колонки.Добавить("ОрганизацияАдрес");
	РезультатЗапроса.Колонки.Добавить("ОрганизацияТелефон");
	РезультатЗапроса.Колонки.Добавить("ОрганизацияЮридическийАдрес");
	РезультатЗапроса.Колонки.Добавить("ОрганизацияФактическийАдрес");	
	
	РезультатЗапроса.Колонки.Добавить("КонтрагентОсновнойТелефон");
	РезультатЗапроса.Колонки.Добавить("КонтрагентОсновнойEMail");
	РезультатЗапроса.Колонки.Добавить("КонтрагентЮридическийАдрес");
	РезультатЗапроса.Колонки.Добавить("КонтрагентФактическийАдрес");
	
КонецФункции

Функция ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, Организация, Контрагент=Неопределено) Экспорт
	
	ТекущаяСтрока.ОрганизацияСайт 				= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация, Справочники.ВидыКонтактнойИнформации.СайтОрганизации);
	ТекущаяСтрока.ОрганизацияЭлектроннаяПочта   = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация, Справочники.ВидыКонтактнойИнформации.EmailОрганизации);
	ТекущаяСтрока.ОрганизацияАдрес 				= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	ТекущаяСтрока.ОрганизацияТелефон     		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	ТекущаяСтрока.ОрганизацияЮридическийАдрес 	= ТекущаяСтрока.ОрганизацияАдрес;
	ТекущаяСтрока.ОрганизацияФактическийАдрес 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	ТекущаяСтрока.ОрганизацияОсновнойТелефон  	= ТекущаяСтрока.ОрганизацияТелефон; 
	
	Если НЕ Контрагент = Неопределено Тогда
		ТекущаяСтрока.КонтрагентОсновнойТелефон 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		ТекущаяСтрока.КонтрагентОсновнойEMail   	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
		ТекущаяСтрока.КонтрагентЮридическийАдрес 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		ТекущаяСтрока.КонтрагентФактическийАдрес    = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	КонецЕсли;
	
КонецФункции

Функция ПечатьТОРГ12(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;                       //#14053
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;  //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ТОРГ12";
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ТОРГ12");
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбъектов[0]);
	
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ДанныеПечати      	     = СтруктураДанныхДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам 	 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	ПервыйДокумент = Истина;
	Пока ДанныеПечати.Следующий() Цикл
		
		//++ 16289 Латыпов Р.Р.
		//Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.Монтаж") Тогда
		//	ДатаДокумента = ОбщийМодульСервер.ПолучитьДатуПодписанияДокументаМонтажа(ДанныеПечати.Ссылка);
		//Иначе
		//	ДатаДокумента = ДанныеПечати.Дата;
		//КонецЕсли;	
		//-- 16289 Латыпов Р.Р.
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоДокументам.Сбросить();
		Если НЕ ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомерДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер));
		// СтруктураПараметров.Вставить("ДатаДокумента",  Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=Д"));  // 17077
		Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
			Если ЗначениеЗаполнено(ДанныеПечати.ВхНомер) Тогда
				СтруктураПараметров.Вставить("НомерДокумента", ДанныеПечати.ВхНомер);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеПечати.ВхДата) Тогда
				СтруктураПараметров.Вставить("ДатаДокумента",  Формат(ДанныеПечати.ВхДата, "ДЛФ=Д"));
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.Монтаж") Тогда
			СтруктураПараметров.Вставить("ДатаДокумента", ОбщийМодульСервер.ПолучитьДатуПодписанияДокументаМонтажа(ДанныеПечати.Ссылка));
			//Если НЕ ДанныеПечати.Ссылка.Результат = Справочники.РезультатыМонтажа.Закрыт
			//	И НЕ ДанныеПечати.Ссылка.Результат = Справочники.РезультатыМонтажа.Выполнен Тогда
			//	СтруктураПараметров.Вставить("ДатаДокумента", ДатаДокумента);
			//КонецЕсли;	
		Иначе
				СтруктураПараметров.Вставить("ДатаДокумента",  Формат(ДанныеПечати.Дата, "ДЛФ=Д"));
		КонецЕсли;
		ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
		
		СведенияОбОрганизации = ОбщийМодульСервер.СведенияОбОрганизации(ДанныеПечати.Организация);
		СведенияОКонтрагенте = ОбщийМодульСервер.СведенияОКонтрагенте(ДанныеПечати.Контрагент);
		
		Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
			ОбластьМакета.Параметры.ПредставлениеОрганизации 		= ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте, 		"ПолноеНаименование,ИНН,Свидетельство,ЮридическийАдрес,Телефоны,Факс,НомерСчета,Банк,БИК,КоррСчет");
			ОбластьМакета.Параметры.ПредставлениеПлательщика	  	= ОбщийМодульСервер.ОписаниеОрганизации(СведенияОбОрганизации,		"ПолноеНаименование,ИНН,Свидетельство,ЮридическийАдрес,Телефоны,Факс,НомерСчета,Банк,БИК,КоррСчет");
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя	= ОбщийМодульСервер.ОписаниеОрганизации(СведенияОбОрганизации, 		"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,Факс,НомерСчета,Банк,БИК,КоррСчет");
		Иначе			
			ОбластьМакета.Параметры.ПредставлениеОрганизации 		= ОбщийМодульСервер.ОписаниеОрганизации(СведенияОбОрганизации, 		"ПолноеНаименование,ИНН,Свидетельство,ЮридическийАдрес,Телефоны,Факс,НомерСчета,Банк,БИК,КоррСчет");
			ОбластьМакета.Параметры.ПредставлениеПлательщика	  	= ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте,		"ПолноеНаименование,ИНН,Свидетельство,ЮридическийАдрес,Телефоны,Факс,НомерСчета,Банк,БИК,КоррСчет");
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя	= ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте, 		"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,Факс,НомерСчета,Банк,БИК,КоррСчет");		
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		НомерСтраницы = 1;
		ИтоговыеСуммы = СтруктураИтоговыеСуммы();
		
		// Создаем массив для проверки вывода
		МассивВыводимыхОбластей = Новый Массив;
		
		// Выводим многострочную часть документа
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаб");
		ОбластьМакетаСтандарт   = Макет.ПолучитьОбласть("Строка");
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
		
		ВыводШапки = 0;
		
		СтрокаТовары = ВыборкаПоДокументам.Выбрать();
		КоличествоСтрок = СтрокаТовары.Количество();
		НомерСтроки = 0;
		Пока СтрокаТовары.Следующий() Цикл
			
			ОбластьМакета = ОбластьМакетаСтандарт;
			НомерСтроки = НомерСтроки + 1;
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаТовары);
			ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
			
			//++ №12909
			//ПредставлениеНоменклатуры = Строка(СтрокаТовары.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(СтрокаТовары.ХарактеристикаНоменклатуры));
			ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(СтрокаТовары.Номенклатура, СтрокаТовары.ХарактеристикаНоменклатуры);
			//-- №12909
			
			ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
			
			Если НомерСтроки = 0 И ВыводШапки <> 2 Тогда
				ВыводШапки = 1;
			КонецЕсли;
			
			Если (НомерСтроки = 1 И ВыводШапки = 0) ИЛИ (НомерСтроки = 0 И ВыводШапки = 1) Тогда
				
				ВыводШапки = 2;
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("НомерСтраницы", "Страница " + НомерСтраницы);
				ОбластьЗаголовокТаблицы.Параметры.Заполнить(СтруктураПараметров);
				ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
				
			КонецЕсли;
			
			МассивВыводимыхОбластей.Очистить();
			МассивВыводимыхОбластей.Добавить(ОбластьМакета);
			МассивВыводимыхОбластей.Добавить(ОбластьИтоговПоСтранице);
			Если НомерСтроки = КоличествоСтрок Тогда
				ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ДанныеПечати.Валюта);
				ОбластьПодвала = ЗаполнитьРеквизитыПодвалаТОРГ12(ДанныеПечати, ИтоговыеСуммы, Макет);
				МассивВыводимыхОбластей.Добавить(ОбластьВсего);
				МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
			КонецЕсли;
			
			Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				ОбластьИтоговПоСтранице.Параметры.Заполнить(ИтоговыеСуммы);
				ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
				
				ОбнулитьИтогиПоСтранице(ИтоговыеСуммы);
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("НомерСтраницы", "Страница " + НомерСтраницы);
				ОбластьЗаголовокТаблицы.Параметры.Заполнить(СтруктураПараметров);
				ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары);
			
		КонецЦикла;
		
		// Выводим итоги по последней странице
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьИтоговПоСтранице.Параметры.Заполнить(ИтоговыеСуммы);
		
		ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
		
		// Выводим итоги по документу в целом
		ОбластьМакета = Макет.ПолучитьОбласть("Всего");
		ОбластьМакета.Параметры.Заполнить(ИтоговыеСуммы);	
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подвал документа
		ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ДанныеПечати.Валюта);
		ОбластьПодвала = ЗаполнитьРеквизитыПодвалаТОРГ12(ДанныеПечати, ИтоговыеСуммы, Макет);
		ТабличныйДокумент.Вывести(ОбластьПодвала);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ЗаполнитьРеквизитыПодвалаТОРГ12(ДанныеПечати, ИтоговыеСуммы, Макет)
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	Если НЕ ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.Монтаж") Тогда
			СтруктураПараметров.Вставить("ДатаДокумента", Формат(ОбщийМодульСервер.ПолучитьДатуПодписанияДокументаМонтажа(ДанныеПечати.Ссылка), "ДЛФ=Д"));
	Иначе
			СтруктураПараметров.Вставить("ДатаДокумента", Формат(ДанныеПечати.Дата, "ДЛФ=Д"));
	КонецЕсли;

	//СтруктураПараметров.Вставить("ДатаДокументаДень", """" + Лев(ПолнаяДатаДокумента, ПервыйРазделитель -1 ) + """");
	//СтруктураПараметров.Вставить("ДатаДокументаМесяц", Сред(ПолнаяДатаДокумента, ПервыйРазделитель + 1, ВторойРазделитель - ПервыйРазделитель - 1));
	//СтруктураПараметров.Вставить("ДатаДокументаГод", Прав(ПолнаяДатаДокумента, ДлинаСтроки - ВторойРазделитель));
	//
	//// Главный бухгалтер
	//СтруктураПараметров.Вставить("ФИОГлавБухгалтера", ДанныеПечати.ГлавныйБухгалтер);
	//
	//// Отпуск товара разрешил
	//СтруктураПараметров.Вставить("ФИОРуководителя", ДанныеПечати.Руководитель);
	//СтруктураПараметров.Вставить("ДолжностьРуководителя", ДанныеПечати.ДолжностьРуководителя);
	//
	//СтруктураПараметров.Вставить("ФИОКладовщика", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Кладовщик, ДанныеПечати.Дата));
	//СтруктураПараметров.Вставить("ДолжностьКладовщика", ДанныеПечати.ДолжностьКладовщика);
	//
	//// Доверенность
	//СтруктураПараметров.Вставить("ДоверенностьНомер", ДанныеПечати.ДоверенностьНомер);
	//СтруктураПараметров.Вставить("ДоверенностьДата", Формат(ДанныеПечати.ДоверенностьДата, "ДЛФ=DD"));
	//СтруктураПараметров.Вставить("ДоверенностьВыдана", ДанныеПечати.ДоверенностьВыдана);
	//СтруктураПараметров.Вставить("ДоверенностьЧерезКого", ДанныеПечати.ДоверенностьЛицо);
	//
	//Если ИтоговыеСуммы.ИтогоКоличествоМест > 0 Тогда
	//	СтруктураПараметров.Вставить("ВсегоМестПрописью", ЧислоПрописью(ИтоговыеСуммы.ИтогоКоличествоМест, ,",,,,,,,,0"));
	//КонецЕсли;
	//
	//Если ИтоговыеСуммы.ИтогоМассаНетто > 0 Тогда
	//	ПараметрыМассыПрописью = ПараметрыМассыПрописью(ИтоговыеСуммы.ИтогоМассаНетто, КоэффициентПересчетаВТонны);
	//	СтруктураПараметров.Вставить("МассаНеттоПрописью", ЧислоПрописью(
	//		ИтоговыеСуммы.ИтогоМассаНетто * ПараметрыМассыПрописью.Коэффициент,
	//		"ДП=Истина",
	//		ПараметрыМассыПрописью.Формат));
	//КонецЕсли;
	//
	//Если ИтоговыеСуммы.ИтогоМассаБрутто > 0 Тогда
	//	ПараметрыМассыПрописью = ПараметрыМассыПрописью(ИтоговыеСуммы.ИтогоМассаБрутто, КоэффициентПересчетаВТонны);
	//	СтруктураПараметров.Вставить("МассаБруттоПрописью", ЧислоПрописью(
	//		ИтоговыеСуммы.ИтогоМассаБрутто * ПараметрыМассыПрописью.Коэффициент,
	//		"ДП=Истина",
	//		ПараметрыМассыПрописью.Формат));
	//КонецЕсли;
	
	СтруктураПараметров.Вставить("КоличествоПорядковыхНомеровЗаписейПрописью", ИтоговыеСуммы.КоличествоПорядковыхНомеровЗаписейПрописью);
	СтруктураПараметров.Вставить("СуммаПрописью", ИтоговыеСуммы.СуммаПрописью);
	
	ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
	
	Возврат ОбластьМакета;
	
КонецФункции

Функция СтруктураРесурсовДляИтогов()
	
	Структура = Новый Структура;
	
	Структура.Вставить("СуммаБезНДС",       0);
	Структура.Вставить("СуммаНДС",          0);
	Структура.Вставить("СуммаСНДС",         0);
	Структура.Вставить("Количество",        0);
	
	Структура.Вставить("Сумма",             0);
	
	Структура.Вставить("РазницаБезНДСУвеличение", 0);
	Структура.Вставить("РазницаБезНДСУменьшение", 0);
	Структура.Вставить("РазницаНДСУвеличение",    0);
	Структура.Вставить("РазницаНДСУменьшение",    0);
	Структура.Вставить("РазницаСНДСУвеличение",   0);
	Структура.Вставить("РазницаСНДСУменьшение",   0);
	
	Возврат Структура;
	
КонецФункции

Функция СтруктураИтоговыеСуммы()
	
	Структура = Новый Структура;
	
	СтруктураРесурсовДляИтогов = СтруктураРесурсовДляИтогов();
	
	Для Каждого Элемент Из СтруктураРесурсовДляИтогов Цикл
		Структура.Вставить("Итого"+Элемент.Ключ+"НаСтранице", 0);
		Структура.Вставить("Итого"+Элемент.Ключ, 0);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

Процедура ОбнулитьИтогиПоСтранице(ИтоговыеСуммы)
	
	СтруктураРесурсовДляИтогов = СтруктураРесурсовДляИтогов();
	
	Для Каждого Элемент Из СтруктураРесурсовДляИтогов Цикл
		ИтоговыеСуммы.Вставить("Итого"+Элемент.Ключ+"НаСтранице", 0);
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары)
	
	СтруктураСуммПоСтроке = СтруктураРесурсовДляИтогов();
	
	ЗаполнитьЗначенияСвойств(СтруктураСуммПоСтроке, СтрокаТовары);
	Для Каждого Элемент Из СтруктураСуммПоСтроке Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] = ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] + Элемент.Значение;
			ИтоговыеСуммы["Итого"+Элемент.Ключ] = ИтоговыеСуммы["Итого"+Элемент.Ключ] + Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, ВсегоНомеров, Валюта)
	
	ИтоговыеСуммы.Вставить("КоличествоПорядковыхНомеровЗаписейПрописью", ЧислоПрописью(ВсегоНомеров, ,",,,,,,,,0"));
	ИтоговыеСуммы.Вставить("СуммаПрописью", РаботаСВалютой.СформироватьЧислоПрописью(ИтоговыеСуммы.ИтогоСуммаСНДС, Валюта, Ложь));
	
КонецПроцедуры

Функция ПолучитьТаблицуВыработкиПоМонтажуДляПФ(МонтажСсылка) Экспорт
	
	РеквизитыМонтажа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МонтажСсылка, "Дата, Проведен, Результат, РучнаяКорректировкаВыработки, 
	|СозданПриИспользованииСтатусаЗакрыт, ДатаВыполнения, ДатаЗакрытия");
	
	РезультатМонтажа = РеквизитыМонтажа.Результат;
	МонтажЗакрыт = (РезультатМонтажа = Справочники.РезультатыМонтажа.Выполнен И НЕ РеквизитыМонтажа.СозданПриИспользованииСтатусаЗакрыт)
	ИЛИ (РезультатМонтажа = Справочники.РезультатыМонтажа.Закрыт И РеквизитыМонтажа.СозданПриИспользованииСтатусаЗакрыт);
	
	Плановая = Ложь;
	// Если введена ручная корректировка выработки - берем её
	Если РеквизитыМонтажа.РучнаяКорректировкаВыработки Тогда
		
		ТаблицаВыработки = МонтажСсылка.Выработка.Выгрузить();
		
		// Если монтаж проведен и закрыт - берем из движений документа
	ИначеЕсли МонтажЗакрыт И РеквизитыМонтажа.Проведен Тогда
		
		ЗапросВыработка = новый Запрос;
		ЗапросВыработка.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыработкаИсполнителейРозницыОбороты.Сотрудник КАК Сотрудник,
		|	ВыработкаИсполнителейРозницыОбороты.ВидНачисления КАК ВидНачисления,
		|	ВыработкаИсполнителейРозницыОбороты.Номенклатура КАК Номенклатура,
		|   ВыработкаИсполнителейРозницыОбороты.КоличествоОборот КАК Количество,
		|	ВыработкаИсполнителейРозницыОбороты.СтоимостьОборот КАК Стоимость
		|ИЗ
		|	РегистрНакопления.ВыработкаИсполнителейРозницы.Обороты(,, Регистратор) КАК ВыработкаИсполнителейРозницыОбороты
		|ГДЕ
		|	ВыработкаИсполнителейРозницыОбороты.Регистратор = &Ссылка
		|";
		ЗапросВыработка.УстановитьПараметр("Ссылка", МонтажСсылка);
		
		ТаблицаВыработки = ЗапросВыработка.Выполнить().Выгрузить();
		
		
	Иначе
		// Рассчитываем плановую выработку	
		ДатаРасчетаВыработки = РеквизитыМонтажа.Дата;
		
		Если МонтажЗакрыт Тогда
			
			ДатаРасчетаВыработки = РеквизитыМонтажа.ДатаВыполнения;
			Если (РезультатМонтажа = Справочники.РезультатыМонтажа.Закрыт И РеквизитыМонтажа.СозданПриИспользованииСтатусаЗакрыт) Тогда
				ДатаРасчетаВыработки = РеквизитыМонтажа.ДатаЗакрытия;
			КонецЕсли;
			
		КонецЕсли;
		
		ТаблицаВыработки = Зарплата.РассчитатьВыработкуПоДокументу(МонтажСсылка, ДатаРасчетаВыработки);
		Плановая = Истина;
		
	КонецЕсли;
	
	Возврат Новый Структура("ТаблицаВыработки, Плановая", ТаблицаВыработки, Плановая);
	
КонецФункции

Функция ПечатьРозницаГарантийныйТалон(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ГарантийныйТалон";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_ГарантийныйТалон");
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбъектов[0]);
	
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	МенеджерОбъекта.ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	//ВыборкаПоДокументам 	 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Для каждого ДанныеПечати из ТаблицаДанныеПечати Цикл		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");		
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьРозницаАктВыполненныхРабот(МассивОбъектов, ОбъектыПечати, ПересчетЦеныПоСкидке = Ложь, СБланкомОПлаты = Ложь) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_АктВыполненныхРабот";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_АктВыполненныхРабот");
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбъектов[0]);
	
	ИмяОбъекта = МассивОбъектов[0].Метаданные().Имя;
	ИмяОбластиПодвал = "Подвал";
	Если НЕ Макет.Области.Найти(ИмяОбластиПодвал + ИмяОбъекта) = Неопределено Тогда
		ИмяОбластиПодвал = ИмяОбластиПодвал + ИмяОбъекта;
	КонецЕсли;
	
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоТоварам 	 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	МенеджерОбъекта.ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
	
	ПервыйДокумент = Истина;
	Для каждого ДанныеПечати из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;		
		
		ЕстьСкидкиВДокументе = ДанныеПечати.ИтогоСуммаСкидки > 0;
		ЕстьСкидки = ЕстьСкидкиВДокументе И НЕ ПересчетЦеныПоСкидке;
		ЕстьНДС    = ДанныеПечати.ЯвляетсяПлательщикомНДС;
		
		СуффиксОбластиСтроки = ?(ЕстьНДС, "СНДС", "") + ?(ЕстьСкидки, "СоСкидкой", "");
		СуффиксОбластиКолонки = ?(ЕстьСкидки И ЕстьНДС, "СоСкидкойСНДС", ?(ЕстьСкидки Или ЕстьНДС, "СоСкидкойИлиСНДС", ""));
		
		//шапка
		СтруктураДанныхШапки = Новый Структура;
		СведенияОбОрганизации = ОбщийМодульСервер.СведенияОбОрганизации(ДанныеПечати.Организация);
		СведенияОКонтрагенте  = ОбщийМодульСервер.СведенияОКонтрагенте(ДанныеПечати.Контрагент);
		
		ПредставлениеОрганизации = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ЮридическийАдрес,Телефоны");
		ПредставлениеЗаказчика	 = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте,	"ПолноеНаименование");
		ПредставлениеЗаказчика  = ПредставлениеЗаказчика + ?(ПустаяСтрока(ДанныеПечати.ПредставлениеРеквизитов), "", ", " + ДанныеПечати.ПредставлениеРеквизитов);
		СтруктураДанныхШапки.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		СтруктураДанныхШапки.Вставить("ПредставлениеЗаказчика",  ПредставлениеЗаказчика);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
		
		//если номер договора заполнен подставим его
		Если ЗначениеЗаполнено(ДанныеПечати.НомерДоговора) Тогда
			Попытка
				ОбластьМакета.Параметры.Номер = ДанныеПечати.НомерДоговора;
			Исключение
			КонецПопытки;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		
		// Изменения размера колонки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("КолонкаАртикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ОбластьНомера  = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикул = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТовар   = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанных  = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
			ОбластьНомераСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикулСтроки= Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТоварСтроки  = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанныхСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
			ОбластьНомераКомната = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикулКомната= Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТоварКомната  = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанныхКомната = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
		Исключение
			Возврат новый ТабличныйДокумент;
		КонецПопытки;
		
		//шапка таблицы
		ОбластьНомера.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьАртикул Тогда
			ОбластьАртикул.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьАртикул);
		КонецЕсли;
		
		ОбластьТовар.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		ОбластьДанных.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьДанных);	
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоТоварам.Сбросить();
		
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда
			
			ИмяКомната = "";
			//выводим секцию с табличной частью
			ВыборкаТоваровУслуг = ВыборкаПоТоварам.Выбрать();
			Пока ВыборкаТоваровУслуг.Следующий() Цикл			                                         	
				
				Если ИмяКомната <> ВыборкаТоваровУслуг.Комната Тогда
					
					ТабличныйДокумент.Вывести(ОбластьНомераКомната);
					
					Если ВыводитьАртикул Тогда
						ТабличныйДокумент.Присоединить(ОбластьАртикулКомната);
					КонецЕсли;						
					
					ИмяКомната = ВыборкаТоваровУслуг.Комната;
					ОбластьТоварКомната.Область().Шрифт = Новый Шрифт (ОбластьМакета.Область().Шрифт,,,Истина,Истина);  // жирный наклонный шрифт						
					ОбластьТоварКомната.Параметры.ПредставлениеНоменклатуры = ИмяКомната;
					ТабличныйДокумент.Присоединить(ОбластьТоварКомната);						
					
					ТабличныйДокумент.Присоединить(ОбластьДанныхКомната);
					
				КонецЕсли;
				
				//товары в комнате
				ОбластьНомераСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
				ТабличныйДокумент.Вывести(ОбластьНомераСтроки);
				
				Если ВыводитьАртикул Тогда
					ОбластьАртикулСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
					ТабличныйДокумент.Присоединить(ОбластьАртикулСтроки);
				КонецЕсли;
				
				ДопДанныеСтроки = Новый Структура;
				//++ №12909
				//ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", 
				//						ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Строка(ВыборкаТоваровУслуг.Номенклатура), Строка(ВыборкаТоваровУслуг.ХарактеристикаНоменклатуры)));
				ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", 
				ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ВыборкаТоваровУслуг.Номенклатура, ВыборкаТоваровУслуг.ХарактеристикаНоменклатуры));
				//-- №12909
				
				ОбластьТоварСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
				ОбластьТоварСтроки.Параметры.Заполнить(ДопДанныеСтроки);
				ТабличныйДокумент.Присоединить(ОбластьТоварСтроки);
				
				ОбластьДанныхСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
				//#10947
				Если ЕстьСкидкиВДокументе И ПересчетЦеныПоСкидке Тогда
					ДопДанныеСтроки = Новый Структура;
					ДопДанныеСтроки.Вставить("Цена", ?(ВыборкаТоваровУслуг.Количество = 0, 0, ВыборкаТоваровУслуг.Сумма / ВыборкаТоваровУслуг.Количество));
					ОбластьДанныхСтроки.Параметры.Заполнить(ДопДанныеСтроки);
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьДанныхСтроки);
				
			КонецЦикла;
		КонецЕсли;
		
		// подвал таблицы 
		ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
		ОбластьАртикул = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
		ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
		ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьАртикул Тогда
			ТабличныйДокумент.Присоединить(ОбластьАртикул);
		КонецЕсли;
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		ОбластьДанных.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		// Выводим ИтогоНДС
		Попытка
			ЦенаВключаетНДС = Истина;
			Область = Макет.ПолучитьОбласть("ПодвалНДС");
			СтруктураДанныхПодвалНДС = Новый Структура;
			СтруктураДанныхПодвалНДС.Вставить("ИтогоСуммаНДС", ДанныеПечати.ИтогоСуммаНДС);
			Если ЕстьНДС Тогда
				СтруктураДанныхПодвалНДС.Вставить("НДС", ?(ЦенаВключаетНДС, НСтр("ru='В том числе НДС:'"), НСтр("ru='Сумма НДС:'")));
			Иначе
				СтруктураДанныхПодвалНДС.Вставить("НДС", НСтр("ru='Без налога (НДС)'"));
			КонецЕсли;
			Область.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
			ТабличныйДокумент.Присоединить(Область);
		Исключение
		КонецПопытки;
		
		// Выводим подвал с подписями			
		Попытка 
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбластиПодвал);
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//#14460
		Если СБланкомОПлаты Тогда
			Попытка
				ДанныеОплаты = Новый Структура;				
				ДанныеОплаты.Вставить("ПредставлениеОрганизации", ДанныеПечати.Организация);
				ДанныеОплаты.Вставить("ПредставлениеСтруктурногоПодразделения", ДанныеПечати.Подразделение);
				ДанныеОплаты.Вставить("ПринятоОт", ДанныеПечати.Контрагент);
				ДанныеОплаты.Вставить("Основание", ДанныеПечати.Ссылка);
				//СуммаКОплате = ?(ДанныеПечати.СуммаКПолучениюНаМонтаже = 0, ДанныеПечати.Сумма, ДанныеПечати.СуммаКПолучениюНаМонтаже);
				СуммаКОплате = ДанныеПечати.СуммаКПолучениюНаМонтаже;
				Если СуммаКОплате > 0 Тогда
					ДанныеОплаты.Вставить("СуммаРубКоп", СуммаКОплате);
					ДанныеОплаты.Вставить("Сумма", СуммаКОплате);
					ДанныеОплаты.Вставить("СуммаПрописью", РаботаСВалютой.СформироватьЧислоПрописью(СуммаКОплате, ДанныеПечати.Валюта, Ложь));				
				КонецЕсли;
				
				МакетОплаты = Документы.ПриходныйКассовыйОрдер.ПолучитьМакет("ПКО");
				
				ТДОплаты = Новый ТабличныйДокумент;
				ОбластьМакета = МакетОплаты.ПолучитьОбласть("Шапка");
				ОбластьМакета.Параметры.Заполнить(ДанныеОплаты);
				ОбластьВывода = ТДОплаты.Вывести(ОбластьМакета);
				ОбластьВывода.СоздатьФорматСтрок();
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ТДОплаты);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьРозницаКомплектДляМонтажников(МассивОбъектов, ОбъектыПечати, ПересчетЦеныПоСкидке = Ложь) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_КомплектДляМонтажников";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Монтаж.ПФ_MXL_КомплектДляМонтажниковСоСкидкой");
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбъектов[0]);
	
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	МенеджерОбъекта.ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	ВыборкаПоТоварам 	 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ТаблицаПоТоварам 	 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаКомнат = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выгрузить();
	ТаблицаКомнат.Свернуть("Ссылка, Комната", "Сумма");
	
	ПервыйДокумент = Истина;
	Для каждого ДанныеПечати из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСкидкиВДокументе = ДанныеПечати.ИтогоСуммаСкидки > 0;
		ЕстьСкидки = ЕстьСкидкиВДокументе И НЕ ПересчетЦеныПоСкидке;
		ЕстьНДС    = ДанныеПечати.ЯвляетсяПлательщикомНДС;
		
		СуффиксОбластиСтроки = ?(ЕстьНДС, "СНДС", "") + ?(ЕстьСкидки, "СоСкидкой", "");
		СуффиксОбластиКолонки = ?(ЕстьСкидки И ЕстьНДС, "СоСкидкойСНДС", ?(ЕстьСкидки Или ЕстьНДС, "СоСкидкойИлиСНДС", ""));
		
		СтруктураДанныхШапки = Новый Структура;
		СведенияОбОрганизации = ОбщийМодульСервер.СведенияОбОрганизации(ДанныеПечати.Организация);
		СведенияОКонтрагенте  = ОбщийМодульСервер.СведенияОКонтрагенте(ДанныеПечати.Контрагент);
		
		ПредставлениеОрганизации = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ЮридическийАдрес,Телефоны");
		ПредставлениеКонтрагента	 = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте,	"ПолноеНаименование");
		ПредставлениеКонтрагента  = ПредставлениеКонтрагента + ?(ПустаяСтрока(ДанныеПечати.ПредставлениеРеквизитов), "", ", " + ДанныеПечати.ПредставлениеРеквизитов);
		СтруктураДанныхШапки.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		СтруктураДанныхШапки.Вставить("ПредставлениеКонтрагента",  ПредставлениеКонтрагента);
		
		//шапка 
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//заголовок			
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка			
				ТекстЗаголовка = ДанныеПечати.Ссылка.Метаданные().Синоним + " №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + ДанныеПечати.ДатаФормат;
				ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;		
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//Дата монтажа
		Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.Монтаж") Тогда
			Если НЕ ДанныеПечати.СрокМонтажа = ПредопределенноеЗначение("Перечисление.СрокиМонтажа.ДатаМонтажаНеОпределена") Тогда
				Попытка			
					ОбластьМакета = Макет.ПолучитьОбласть("ДатаМонтажа");					
					ДатаМонтажа = ДанныеПечати.ДатаМонтажаФормат + " с " + ДанныеПечати.ВремяНачалаФормат + " по " + ДанныеПечати.ВремяОкончанияФормат;					
					ОбластьМакета.Параметры.ДатаМонтажа = ДатаМонтажа;
					ТабличныйДокумент.Вывести(ОбластьМакета);
				Исключение
				КонецПопытки;
			КонецЕсли;	
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		// Изменения размера колонки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("КолонкаАртикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ОбластьНомера  = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикул = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТовар   = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанных  = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
			ОбластьНомераСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикулСтроки= Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТоварСтроки  = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанныхСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
			ОбластьНомераКомната = Макет.ПолучитьОбласть("СтрокаКомнаты" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикулКомната= Макет.ПолучитьОбласть("СтрокаКомнаты" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТоварКомната  = Макет.ПолучитьОбласть("СтрокаКомнаты" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанныхКомната = Макет.ПолучитьОбласть("СтрокаКомнаты" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
		Исключение
			Возврат Новый ТабличныйДокумент;
		КонецПопытки;	
		
		Попытка
			//шапка таблицы
			ОбластьНомера.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьАртикул Тогда
				ОбластьАртикул.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьАртикул);
			КонецЕсли;
			
			ОбластьТовар.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			
			ОбластьДанных.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
		Исключение
		КонецПопытки;
		
		ИмяКомната = "";
		НомерСтроки = 1;
		Попытка
			СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
			ВыборкаПоТоварам.Сбросить();
			
			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда
				
				ИмяКомната = "";
				//выводим секцию с табличной частью				
				ВыборкаТоваровУслуг = ВыборкаПоТоварам.Выбрать();
				Пока ВыборкаТоваровУслуг.Следующий() Цикл					 
					Если ИмяКомната <> ВыборкаТоваровУслуг.Комната Тогда
						
						//Комнаты
						НайденныеКомнаты = ТаблицаКомнат.НайтиСтроки(Новый Структура("Ссылка, Комната", ДанныеПечати.Ссылка, ВыборкаТоваровУслуг.Комната));
						ТекущаяКомната = НайденныеКомнаты[0];					
						
						ОбластьНомераКомната.Параметры.Заполнить(ТекущаяКомната);
						ТабличныйДокумент.Вывести(ОбластьНомераКомната);
						
						Если ВыводитьАртикул Тогда
							ОбластьАртикулКомната.Параметры.Заполнить(ТекущаяКомната);
							ТабличныйДокумент.Присоединить(ОбластьАртикулКомната);
						КонецЕсли;
						
						ОбластьТоварКомната.Параметры.Заполнить(ТекущаяКомната);
						ТабличныйДокумент.Присоединить(ОбластьТоварКомната);
						
						ОбластьДанныхКомната.Параметры.Заполнить(ТекущаяКомната);
						ТабличныйДокумент.Присоединить(ОбластьДанныхКомната);
						
						ИмяКомната = ВыборкаТоваровУслуг.Комната;
						
					КонецЕсли;
					
					//товары в комнате
					ОбластьНомераСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
					ТабличныйДокумент.Вывести(ОбластьНомераСтроки);
					
					Если ВыводитьАртикул Тогда
						ОбластьАртикулСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
						ТабличныйДокумент.Присоединить(ОбластьАртикулСтроки);
					КонецЕсли;
					
					ДопДанныеСтроки = Новый Структура;
					//++ №12909
					//ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", 
					//	ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Строка(ВыборкаТоваровУслуг.Номенклатура), Строка(ВыборкаТоваровУслуг.ХарактеристикаНоменклатуры)));
					ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", 
					ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ВыборкаТоваровУслуг.Номенклатура, ВыборкаТоваровУслуг.ХарактеристикаНоменклатуры));
					//-- №12909
					
					ОбластьТоварСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
					ОбластьТоварСтроки.Параметры.Заполнить(ДопДанныеСтроки);
					ТабличныйДокумент.Присоединить(ОбластьТоварСтроки);
					
					ОбластьДанныхСтроки.Параметры.Заполнить(ВыборкаТоваровУслуг);
					//#10947
					Если ЕстьСкидкиВДокументе И ПересчетЦеныПоСкидке Тогда
						ДопДанныеСтроки = Новый Структура;
						ДопДанныеСтроки.Вставить("Цена", ?(ВыборкаТоваровУслуг.Количество = 0, 0, ВыборкаТоваровУслуг.Сумма / ВыборкаТоваровУслуг.Количество));
						ОбластьДанныхСтроки.Параметры.Заполнить(ДопДанныеСтроки);
					КонецЕсли;
					ТабличныйДокумент.Присоединить(ОбластьДанныхСтроки);
					
				КонецЦикла;
			КонецЕсли;			
			
		Исключение
		КонецПопытки;
		
		Попытка
			// подвал таблицы 
			ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
			ОбластьАртикул = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|КолонкаАртикул");
			ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
			ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьАртикул Тогда
				ТабличныйДокумент.Присоединить(ОбластьАртикул);
			КонецЕсли;
			
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			
			ОбластьДанных.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
		Исключение
		КонецПопытки;
		
		// Выводим ИтогоНДС
		Попытка
			ЦенаВключаетНДС = Истина;
			Область = Макет.ПолучитьОбласть("ПодвалНДС");
			СтруктураДанныхПодвалНДС = Новый Структура;
			СтруктураДанныхПодвалНДС.Вставить("ИтогоСуммаНДС", ДанныеПечати.ИтогоСуммаНДС);
			Если ЕстьНДС Тогда
				СтруктураДанныхПодвалНДС.Вставить("НДС", ?(ЦенаВключаетНДС, НСтр("ru='В том числе НДС:'"), НСтр("ru='Сумма НДС:'")));
			Иначе
				СтруктураДанныхПодвалНДС.Вставить("НДС", НСтр("ru='Без налога (НДС)'"));
			КонецЕсли;
			Область.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
			ТабличныйДокумент.Присоединить(Область);
		Исключение
		КонецПопытки;
		
		// Выводим Сумму прописью
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		// Выводим подвал с подписями
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ВидНомен = "";
		Попытка
			//объединяем Товары и Материалы 
			тзТоварыМатериалы = ДанныеПечати.Ссылка.ТоварыУслуги.Выгрузить();
			Для каждого Материалы Из ДанныеПечати.Ссылка.Материалы Цикл 
				Если ЗначениеЗаполнено(Материалы.Номенклатура) Тогда		
					НоваяСтрокаМатериала = тзТоварыМатериалы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаМатериала, Материалы);
					Попытка
						НоваяСтрокаМатериала.Артикул = Материалы.Номенклатура.Артикул;
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
			тзТоварыМатериалы.Колонки.Добавить("ВидНоменклатуры");
			тзТоварыМатериалы.Колонки.Добавить("Артикул");
			Для каждого СтрокаТЗ Из тзТоварыМатериалы Цикл
				СтрокаТЗ.ВидНоменклатуры = СтрокаТЗ.Номенклатура.ВидНоменклатуры;
				СтрокаТЗ.Артикул = СтрокаТЗ.Номенклатура.Артикул;
			КонецЦикла;
			тзТоварыМатериалы.Сортировать("ВидНоменклатуры Возр");
			тзТоварыМатериалы.Свернуть("ВидНоменклатуры,Артикул,Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Коэффициент", "Количество"); 
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаМатериалы|НомерСтроки");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаМатериалы|КолонкаАртикул");
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаМатериалы|Материал");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаМатериалы|МатериалДанные");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			НомерСтроки = 1;
			Для Каждого Материалы Из тзТоварыМатериалы Цикл
				
				Если НЕ Материалы.Номенклатура.Пустая() 
					И Материалы.ВидНоменклатуры <> Справочники.ВидыНоменклатуры.Услуга Тогда
					
					
					Если ВидНомен <> Материалы.ВидНоменклатуры Тогда
						
						ВидНомен = Материалы.ВидНоменклатуры;
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|НомерСтроки");
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Если ВыводитьАртикул Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|КолонкаАртикул");
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;
						
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|Материал");
						// жирный наклонный шрифт
						ШрифтВидНомен = Новый Шрифт (ОбластьМакета.Область().Шрифт,,,Истина,Истина);
						ОбластьМакета.Область().Шрифт = ШрифтВидНомен;
						ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ВидНомен;
						ТабличныйДокумент.Присоединить(ОбластьМакета);
						
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|МатериалДанные");
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|НомерСтроки");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Материалы);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|КолонкаАртикул");
						ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Материалы);
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|Материал");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Материалы);
					
					//++ №12909
					//ПредставлениеНоменклатуры = Строка(Материалы.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Материалы.ХарактеристикаНоменклатуры));
					ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Материалы.Номенклатура, Материалы.ХарактеристикаНоменклатуры);
					//-- №12909
					
					ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;	
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы|МатериалДанные");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Материалы);	
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					
					НомерСтроки = НомерСтроки + 1;
				КонецЕсли;
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалМатериалы|НомерСтроки");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалМатериалы|КолонкаАртикул");
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалМатериалы|Материал");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалМатериалы|МатериалДанные");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
		Исключение
		КонецПопытки;
		
		Попытка
			Если НЕ ПустаяСтрока(ДанныеПечати.КомментарийКМонтажу) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("КомментарийКМонтажу");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		//Исполнители
		Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.Монтаж") Тогда
			
			Попытка
				Если ДанныеПечати.Ссылка.Исполнители.Количество() > 0 Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ШапкаИсполнители");				
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Для Каждого Исполнитель Из ДанныеПечати.Ссылка.Исполнители Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИсполнители");				
						ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Исполнитель);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЦикла;
					
					ОбластьМакета = Макет.ПолучитьОбласть("ПодвалИсполнители");				
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;				
			Исключение
			КонецПопытки;
			
			//2017-10-24 Добавлена печать планируемой выработки по монтажникам
			ЕстьСекцияВыработкиМонтажников = Ложь;
			Попытка
				ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаВыработки");
				ЕстьСекцияВыработкиМонтажников = Истина;
			Исключение
			КонецПопытки;
			
			ЕстьСекцияВыработкиМонтажниковОбщая = Ложь;
			Попытка
				ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаВыработкиОбщая");
				ЕстьСекцияВыработкиМонтажниковОбщая = Истина;
			Исключение
			КонецПопытки;
			
			//++ №13368 выработку получаем так, как она отображается на форме (план, факт)
			Если ЕстьСекцияВыработкиМонтажников Или ЕстьСекцияВыработкиМонтажниковОбщая Тогда
				
				ТаблицаВыработки = ПолучитьТаблицуВыработкиПоМонтажуДляПФ(ДанныеПечати.Ссылка).ТаблицаВыработки;
				
			КонецЕсли;
			//-- №13368 выработку получаем так, как она отображается на форме (план, факт)
			
			ВыведенаШапка = Ложь;
			
			Если ЕстьСекцияВыработкиМонтажников Тогда
				
				///ТЗ_Выработки_Врем = Новый ТаблицаЗначений;
				//ТЗ_Выработки_Врем = Зарплата.ПолучитьЗаписиРегистраВыработки(Шапка.Ссылка);  #6347
				//ТЗ_Выработки_Врем.Свернуть("Сотрудник, ВидНачисления, Номенклатура, НеНачислятьВыработку", "Количество, Стоимость"); #6347 заменено на нижнюю конструкцию
				
				//++ №13368 выработка получается один раз выше
				//ТЗ_Выработки_Врем = Зарплата.РассчитатьВыработкуПоДокументу(ДанныеПечати.Ссылка);
				ТЗ_Выработки_Врем = ТаблицаВыработки.Скопировать();
				//++ №13368
				
				ТЗ_Выработки_Врем.Свернуть("Сотрудник, ВидНачисления, Номенклатура", "Количество, Стоимость");
				
				//оставим только исполнителей монтажа
				ТЗ_Выработки = ТЗ_Выработки_Врем.Скопировать();			
				ТЗ_Выработки.Очистить();
				Для Каждого ТекущийИсполнитель Из ТЗ_Выработки_Врем Цикл
					Если НЕ ДанныеПечати.Ссылка.Исполнители.Найти(ТекущийИсполнитель.Сотрудник, "Сотрудник") = Неопределено Тогда
						НоваяСтрока = ТЗ_Выработки.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийИсполнитель);
					КонецЕсли;
				КонецЦикла;
				
				СуммаСотрудникИтог = 0;
				СотрудникИтог = Неопределено;
				Для каждого Исполнитель Из ДанныеПечати.Ссылка.Исполнители Цикл
					
					НайденныеСтроки = ТЗ_Выработки.НайтиСтроки(Новый Структура("Сотрудник", Исполнитель.Сотрудник));
					Если НайденныеСтроки.Количество() > 0 Тогда
						Если НЕ ВыведенаШапка Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("ШапкаВыработки");
							ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
							ТабличныйДокумент.Вывести(ОбластьМакета);
							ВыведенаШапка = Истина;
						КонецЕсли;
						
						СуммаСотрудникИтог = 0;
						Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВыработки");
							ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, НайденнаяСтрока);
							ТабличныйДокумент.Вывести(ОбластьМакета);
							СуммаСотрудникИтог = СуммаСотрудникИтог + НайденнаяСтрока.Стоимость;
						КонецЦикла;
						Попытка
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВыработкиИтог");
							ОбластьМакета.Параметры.Стоимость = СуммаСотрудникИтог;
							ТабличныйДокумент.Вывести(ОбластьМакета);							
						Исключение							
						КонецПопытки;
					КонецЕсли;
				КонецЦикла;
				
				Если ВыведенаШапка Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ИтогоВыработки");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;
				
			КонецЕсли;
			// Конец 2017-10-24
			
			//Выработка общая в разрезе Сотрудник - Вид начисления
			//По персональной заявке №2262
			
			ВыведенаШапкаОбщая = Ложь;
			
			Если ЕстьСекцияВыработкиМонтажниковОбщая Тогда
				
				//++ №13368 выработка получается один раз выше
				//ТЗ_Выработки_Врем = Новый ТаблицаЗначений;
				//ТЗ_Выработки_Врем = Зарплата.РассчитатьВыработкуПоДокументу(ДанныеПечати.Ссылка);
				ТЗ_Выработки_Врем = ТаблицаВыработки.Скопировать();
				//++ №13368
				
				ТЗ_Выработки_Врем.Свернуть("Сотрудник, ВидНачисления", "Стоимость");
				
				//оставим только исполнителей монтажа
				ТЗ_Выработки = ТЗ_Выработки_Врем.Скопировать();			
				ТЗ_Выработки.Очистить();
				Для Каждого ТекущийИсполнитель Из ТЗ_Выработки_Врем Цикл
					Если НЕ ДанныеПечати.Ссылка.Исполнители.Найти(ТекущийИсполнитель.Сотрудник, "Сотрудник") = Неопределено Тогда
						НоваяСтрока = ТЗ_Выработки.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийИсполнитель);
					КонецЕсли;
				КонецЦикла;
				
				СуммаСотрудникИтог = 0;
				СотрудникИтог = Неопределено;
				Для каждого Исполнитель Из ДанныеПечати.Ссылка.Исполнители Цикл
					
					НайденныеСтроки = ТЗ_Выработки.НайтиСтроки(Новый Структура("Сотрудник", Исполнитель.Сотрудник));
					Если НайденныеСтроки.Количество() > 0 Тогда
						Если НЕ ВыведенаШапкаОбщая Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("ШапкаВыработкиОбщая");
							ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
							ТабличныйДокумент.Вывести(ОбластьМакета);
							ВыведенаШапкаОбщая = Истина;
						КонецЕсли;
						
						СуммаСотрудникИтог = 0;
						Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВыработкиОбщая");
							ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, НайденнаяСтрока);
							ТабличныйДокумент.Вывести(ОбластьМакета);
							СуммаСотрудникИтог = СуммаСотрудникИтог + НайденнаяСтрока.Стоимость;
						КонецЦикла;
						Попытка
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВыработкиИтогОбщая");
							ОбластьМакета.Параметры.Стоимость = СуммаСотрудникИтог;
							ТабличныйДокумент.Вывести(ОбластьМакета);							
						Исключение							
						КонецПопытки;
					КонецЕсли;
				КонецЦикла;
				
				Если ВыведенаШапкаОбщая Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ИтогоВыработкиОбщая");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;
				
			КонецЕсли;
			//Конец Выработка общая
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция - Печать розница материалы
//
// Параметры:
//  МассивОбъектов	 - 	 - 
//  ОбъектыПечати	 - 	 - 
//  ИмяМакета		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПечатьРозницаМатериалы(МассивОбъектов, ОбъектыПечати, ИмяМакета) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Материалы";
	//Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_МатериалыРозница");
	Макет = УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	ВариантВывода = 0;
	Если ТипЗнч(МассивОбъектов[0]) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ВариантВывода = Константы.ВариантФормированияПФМатериалыЗаказДоговора.Получить();
	Иначе
		ВариантВывода = Константы.ВариантФормированияПФМатериалыМонтажа.Получить();
	КонецЕсли;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбъектов[0]);
	
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	МенеджерОбъекта.ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	ВыборкаПоМатериалам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиМатериалы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Для каждого ДанныеПечати из ТаблицаДанныеПечати Цикл		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоМатериалам.Сбросить();
		
		МассивДопРеквизитов = Новый Массив;
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Артикул", 			Новый ОписаниеТипов("Строка")));
		ТаблицаМатериалов = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("ЗаказДоговор", "Материалы", МассивДопРеквизитов);
		
		Если ВыборкаПоМатериалам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоМатериалам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока = ТаблицаМатериалов.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
			КонецЦикла;		
		КонецЕсли;	
		
		Попытка
			ОбластьНомера   		= Макет.ПолучитьОбласть("Шапка|НомерСтроки");
			ОбластьАртикул 		 	= Макет.ПолучитьОбласть("Шапка|КолонкаАртикул");
			ОбластьМатериал 		= Макет.ПолучитьОбласть("Шапка|Материал");
			ОбластьДанных   		= Макет.ПолучитьОбласть("Шапка|МатериалДанные");
			
			ОбластьНомераСтроки 	= Макет.ПолучитьОбласть("Строка|НомерСтроки");
			ОбластьАртикулСтроки	= Макет.ПолучитьОбласть("Строка|КолонкаАртикул");
			ОбластьМатериалСтроки  	= Макет.ПолучитьОбласть("Строка|Материал");
			ОбластьДанныхСтроки 	= Макет.ПолучитьОбласть("Строка|МатериалДанные");
			
			ОбластьНомераКомната   	= Макет.ПолучитьОбласть("СтрокаКомнаты|НомерСтроки");
			ОбластьАртикулКомната  	= Макет.ПолучитьОбласть("СтрокаКомнаты|КолонкаАртикул");
			ОбластьМатериалКомната 	= Макет.ПолучитьОбласть("СтрокаКомнаты|Материал");
			ОбластьДанныхКомната   	= Макет.ПолучитьОбласть("СтрокаКомнаты|МатериалДанные");
			
			ОбластьНомераПодвал  	= Макет.ПолучитьОбласть("Подвал|НомерСтроки");
			ОбластьАртикулПодвал 	= Макет.ПолучитьОбласть("Подвал|КолонкаАртикул");
			ОбластьМатериалПодвал   = Макет.ПолучитьОбласть("Подвал|Материал");
			ОбластьДанныхПодвал  	= Макет.ПолучитьОбласть("Подвал|МатериалДанные"); 			
		Исключение
			Возврат ТабличныйДокумент;
		КонецПопытки;
		
		// 1. вывод в развернутом виде
		Если ВариантВывода = 0 ИЛИ ВариантВывода = 1 Тогда
			// заголовок			
			Попытка	
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				Попытка			
					ТекстЗаголовка = ДанныеПечати.Ссылка.Метаданные().Синоним + " №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + ДанныеПечати.ДатаДокументаФормат;
					ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
				Исключение
				КонецПопытки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
			
			//ЗаголовокТаблицы
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				Попытка			
					ОбластьМакета.Параметры.ЗаголовокТаблицы = "Материалы";
				Исключение
				КонецПопытки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
			
			//таблица
			ОбластьНомера.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьНомера); 		
			Если ВыводитьАртикул Тогда
				ОбластьАртикул.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьАртикул);
			КонецЕсли;		
			ОбластьМатериал.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМатериал);		
			ОбластьДанных.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьДанных);		
			
			ИмяКомната = "";
			Для каждого СтрокаТЧ из ТаблицаМатериалов Цикл
				
				Если ИмяКомната <> СтрокаТЧ.Комната Тогда				
					ТабличныйДокумент.Вывести(ОбластьНомераКомната);
					
					Если ВыводитьАртикул Тогда
						ТабличныйДокумент.Присоединить(ОбластьАртикулКомната);
					КонецЕсли;
					
					ОбластьМатериалКомната.Параметры.ПредставлениеКомнаты = СтрокаТЧ.Комната;
					ТабличныйДокумент.Присоединить(ОбластьМатериалКомната);
					ТабличныйДокумент.Присоединить(ОбластьДанныхКомната);
					
					ИмяКомната = СтрокаТЧ.Комната;				
				КонецЕсли;
				
				ОбластьНомераСтроки.Параметры.Заполнить(СтрокаТЧ);
				ТабличныйДокумент.Вывести(ОбластьНомераСтроки);
				
				Если ВыводитьАртикул Тогда
					ОбластьАртикулСтроки.Параметры.Заполнить(СтрокаТЧ);
					ТабличныйДокумент.Присоединить(ОбластьАртикулСтроки);
				КонецЕсли;
				
				ДопДанныеСтроки = Новый Структура;
				ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", 
				ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры));				                                                      				
				ОбластьМатериалСтроки.Параметры.Заполнить(СтрокаТЧ);
				ОбластьМатериалСтроки.Параметры.Заполнить(ДопДанныеСтроки);
				ТабличныйДокумент.Присоединить(ОбластьМатериалСтроки);
				
				ОбластьДанныхСтроки.Параметры.Заполнить(СтрокаТЧ);
				ТабличныйДокумент.Присоединить(ОбластьДанныхСтроки);
				
			КонецЦикла;
			
			// подвал таблицы		
			ТабличныйДокумент.Вывести(ОбластьНомераПодвал); 		
			Если ВыводитьАртикул Тогда
				ТабличныйДокумент.Присоединить(ОбластьАртикулПодвал);
			КонецЕсли;		
			ТабличныйДокумент.Присоединить(ОбластьМатериалПодвал);		
			ОбластьДанныхПодвал.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьДанныхПодвал);
			
		КонецЕсли; // Если ВариантВывода = 0 ИЛИ ВариантВывода = 1 Тогда
		
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		
		Если ВариантВывода = 0 Тогда			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		// 2. вывод в свернутом виде
		Если ВариантВывода = 0 ИЛИ ВариантВывода = 2 Тогда
			ТаблицаМатериалов.Свернуть("Артикул, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", "Количество");
			
			//заголовок			
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				Попытка			
					ТекстЗаголовка = ДанныеПечати.Ссылка.Метаданные().Синоним + " №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + ДанныеПечати.ДатаДокументаФормат;
					ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
				Исключение
				КонецПопытки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
			
			//ЗаголовокТаблицы
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				Попытка			
					ОбластьМакета.Параметры.ЗаголовокТаблицы = "Материалы (свернуто, без комнат)";
				Исключение
				КонецПопытки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
			
			//шапка таблицы
			ОбластьНомера.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьНомера); 		
			Если ВыводитьАртикул Тогда
				ОбластьАртикул.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьАртикул);
			КонецЕсли;		
			ОбластьМатериал.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМатериал);		
			ОбластьДанных.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьДанных);		
			
			НомерСтроки = 1;
			Для каждого СтрокаТЧ из ТаблицаМатериалов Цикл			
				ДопДанныеСтроки = Новый Структура;
				ДопДанныеСтроки.Вставить("НомерСтроки", НомерСтроки);
				ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры));				                                                      				
				
				ОбластьНомераСтроки.Параметры.Заполнить(СтрокаТЧ);
				ОбластьНомераСтроки.Параметры.Заполнить(ДопДанныеСтроки);
				ТабличныйДокумент.Вывести(ОбластьНомераСтроки);
				
				Если ВыводитьАртикул Тогда
					ОбластьАртикулСтроки.Параметры.Заполнить(СтрокаТЧ);
					ТабличныйДокумент.Присоединить(ОбластьАртикулСтроки);
				КонецЕсли;
				
				ОбластьМатериалСтроки.Параметры.Заполнить(СтрокаТЧ);
				ОбластьМатериалСтроки.Параметры.Заполнить(ДопДанныеСтроки);
				ТабличныйДокумент.Присоединить(ОбластьМатериалСтроки);
				
				ОбластьДанныхСтроки.Параметры.Заполнить(СтрокаТЧ);
				ТабличныйДокумент.Присоединить(ОбластьДанныхСтроки);
				
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
			
			// подвал таблицы		
			ТабличныйДокумент.Вывести(ОбластьНомераПодвал); 		
			Если ВыводитьАртикул Тогда
				ТабличныйДокумент.Присоединить(ОбластьАртикулПодвал);
			КонецЕсли;		
			ТабличныйДокумент.Присоединить(ОбластьМатериалПодвал);		
			ОбластьДанныхПодвал.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьДанныхПодвал);
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция QRКодРеквизитыПлатежа(ДанныеПечати) Экспорт
	
	РеквизитыПлатежа = УправлениеПечатьюРФ.НовыйРеквизитыПлатежаУФЭБС();
	
	РеквизитыПлатежа.ТекстПолучателя             = ДанныеПечати.ПредставлениеОрганизации;
	РеквизитыПлатежа.НомерСчетаПолучателя        = ДанныеПечати.БанковскийСчетНомерСчета;
	РеквизитыПлатежа.НаименованиеБанкаПолучателя = ДанныеПечати.БанковскийСчетНаименованиеБанка;
	РеквизитыПлатежа.БИКБанкаПолучателя          = ДанныеПечати.БанковскийСчетБИК;
	РеквизитыПлатежа.СчетБанкаПолучателя         = ДанныеПечати.БанковскийСчетКоррСчет;
	
	РеквизитыПлатежа.ИННПолучателя               = ДанныеПечати.ИНН;
	РеквизитыПлатежа.КПППолучателя               = ДанныеПечати.КПП;
	
	РеквизитыПлатежа.СуммаЧислом = ДанныеПечати.СуммаДокумента;
	
	Если ДанныеПечати.ИтогоСуммаНДС > 0 Тогда
		ТекстПроНДС = НСтр("ru = 'В том числе НДС'");
	Иначе
		ТекстПроНДС = НСтр("ru = 'Без налога (НДС)'");
	КонецЕсли;
	
	РеквизитыПлатежа.НазначениеПлатежа = СтрШаблон(НСтр("ru = 'Оплата по счету № %1 от %2. Сумма %3. %4.'"), 
	ДанныеПечати.Номер, 
	Формат(ДанныеПечати.ДатаДокумента, "ДФ=dd.MM.yyyy"), 
	Формат(ДанныеПечати.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="), 
	ТекстПроНДС);	
	
	// QR-код
	QRСтрока = УправлениеПечатьюРФ.ФорматнаяСтрокаУФЭБС(РеквизитыПлатежа);
	Если ПустаяСтрока(QRСтрока) Тогда
		Возврат Неопределено; // Возникли ошибки
	КонецЕсли;
	
	ДанныеQRКода = ГенерацияШтрихкодаВызовСервера.ДанныеQRКода(QRСтрока, 0, 190);
	Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
		Шаблон = Нстр("ru = 'Не удалось сформировать QR-код для документа %1.
		|Технические подробности см. в журнале регистрации.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ДанныеПечати.Ссылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеQRКода;
КонецФункции

Функция ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, СПечатью = Ложь, ВВалюте = Ложь) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати 	= "ПараметрыПечати_ЗаказПокупателя_СчетНаОплату";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	НеВыводитьБанковскиеРеквизиты = Константы.НеВыводитьБанковскиеРеквизитыВСчетеНаОплатуБанковскойКартой.Получить();
	ВариантФормированияПФСчетаНаОплату = Константы.ВариантФормированияПФСчетаНаОплату.Получить();
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбъектов[0]);
	
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоТоварам 	 	 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	МенеджерОбъекта.ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
	
	ПервыйДокумент = Истина;
	МакетИзменен = Ложь;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетНаОплату");
		
		//ЕстьСекция_СтрокаТабличнойЧастиТовары = Ложь;
		//ЕстьСекция_СтрокаТабличнойЧастиПредставители = Ложь;
		//ЕстьСекция_СтрокаТабличнойЧастиГрафикПлатежей = Ложь;
		
		ОбластьОтступ = Макет.ПолучитьОбласть("ОтступЗаголовка");
		ТабличныйДокумент.Вывести(ОбластьОтступ);
		
		Попытка		
			
			НачалоНовогоФормата = ТабличныйДокумент.ВысотаТаблицы;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заглавие|ЛоготипСчета");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			
			ДвоичныеДанныеПодписи = ДанныеПечати.Организация.ФайлЛоготип.Файл.Получить();
			Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
				ОбластьМакета.Рисунки.Логотип.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакета);			
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заглавие|Информация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			
			//#11230
			ДвоичныеДанныеQRКода = Неопределено;
			ВидКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПечати.Контрагент, "ВидКонтрагента");
			БанкПринимаетПлатежиСБП = Ложь;
			Если ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда 
				БанкПринимаетПлатежиСБП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПечати.БанковскийСчет, "БанкПринимаетПлатежиСБП");
			КонецЕсли;
			
			//#15702
			//Если ВидКонтрагента = Перечисления.ВидКонтрагента.ФизЛицо И БанкПринимаетПлатежиСБП Тогда
			//	ДвоичныеДанныеQRКода = QRКодРеквизитыПлатежа(ДанныеПечати);
			//КонецЕсли;			
			Если БанкПринимаетПлатежиСБП Тогда
				ДвоичныеДанныеQRКода = QRКодРеквизитыПлатежа(ДанныеПечати);
			КонецЕсли;			
			//#15702
			
			ЕстьQR = ЗначениеЗаполнено(ДвоичныеДанныеQRКода);
			
			Если Макет.Области.Найти("QRКод") <> Неопределено Тогда
				НачалоНовогоФормата = ТабличныйДокумент.ВысотаТаблицы;
				
				ОбластьИнформация = Макет.Область("Информация");
				Если НЕ ЕстьQR Тогда
					ОбластьИнформация.ШиринаКолонки = ОбластьИнформация.ШиринаКолонки + 15; //Макет.Область("QRКод").ШиринаКолонки;
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Заглавие|Информация");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				
				ОбластьQR      = Макет.ПолучитьОбласть("Заглавие|QRКод");
				ОбластьРисунка = ОбластьQR.Области.Найти("РисунокQR");				
				ТабличныйДокумент.Присоединить(ОбластьМакета);				
				Если ЕстьQR И ОбластьРисунка <> Неопределено Тогда					
					ОбластьРисунка.Картинка = Новый Картинка(ДвоичныеДанныеQRКода);					
					ТабличныйДокумент.Присоединить(ОбластьQR);
				КонецЕсли;				
				//ТабличныйДокумент.Область(НачалоНовогоФормата+1,,ТабличныйДокумент.ВысотаТаблицы).СоздатьФорматСтрок();
			Иначе				
				ТабличныйДокумент.Присоединить(ОбластьМакета);				
				//ТабличныйДокумент.Область(НачалоНовогоФормата+1,,ТабличныйДокумент.ВысотаТаблицы).СоздатьФорматСтрок();
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если НеВыводитьБанковскиеРеквизиты И НЕ ПустаяСтрока(ДанныеПечати.ИнтернетОплатаСсылка) Тогда
			//не выводим область
		Иначе
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ДанныеПечати.ИнтернетОплатаСсылка) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("СсылкаОплатыКартой");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату		
		МассивДопРеквизитов = Новый Массив;
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Артикул", 			Новый ОписаниеТипов("Строка")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Вес", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Скидка", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "СуммаБезСкидки", 		Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ВидНоменклатуры", 	Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЕстьПотолок", 		Новый ОписаниеТипов("Число")));		
		
		ТаблицаТоварыИУслуги = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("ЗаказПокупателя", "Товары", МассивДопРеквизитов);
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока = ТаблицаТоварыИУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
				
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 1;
					ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
				ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 3;
				Иначе
					ТекущаяСтрока.ВидНоменклатуры = 2;
				КонецЕсли;
				Если ТекущаяСтрока.Потолок.Пустая() Тогда
					ТекущаяСтрока.ЕстьПотолок = 2;
				Иначе
					ТекущаяСтрока.ЕстьПотолок = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//0. Потолок - товар - услуга - потолок - товар - услуга
		//1. Потолок, Потолок, Товары, Товары, услуги, услуги
		//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются) 
		//3. Без группировок
		Если ВариантФормированияПФСчетаНаОплату = 0 Тогда
			ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");		
		ИначеЕсли ВариантФормированияПФСчетаНаОплату = 1 Тогда
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
		ИначеЕсли ВариантФормированияПФСчетаНаОплату = 2 Тогда
			ТаблицаТоварыИУслуги.Свернуть("Артикул, Номенклатура, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, Скидка, ВидНоменклатуры, ХарактеристикаНоменклатуры", "Количество, Сумма, СуммаБезСкидки");
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
		ИначеЕсли ВариантФормированияПФСчетаНаОплату = 3 Тогда
			//не сортируем
		КонецЕсли;
		
		//Вычислим есть ли скидки, наценки нас не интересуют
		ЕстьСкидки = Ложь;
		Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
			Если ТекущаяСтрока.Сумма < ТекущаяСтрока.СуммаБезСкидки Тогда
				ЕстьСкидки = Истина;
				Прервать; //Дальше идти нет смысла
			КонецЕсли;	
		КонецЦикла;
		
		Если НЕ МакетИзменен Тогда
			Если НЕ ЕстьСкидки Тогда
				//без скидки
				// уменьшим
				Если НЕ ВВалюте Тогда
					Макет.Область("Товар").ШиринаКолонки = Макет.Область("Товар").ШиринаКолонки + 24;
					Макет.Область("Сумма").ШиринаКолонки = 4;
					МакетИзменен = Истина;
				КонецЕсли
			КонецЕсли;
			
			// увеличим колонку товар, если не выводим артикул
			Если НЕ ВыводитьАртикул Тогда
				Макет.Область("Товар").ШиринаКолонки = Макет.Область("Товар").ШиринаКолонки + 8;
				МакетИзменен = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Суффикс = "";
		Если ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС Тогда
			Суффикс = "НДС";	
		КонецЕсли;
		Если ЕстьСкидки Тогда
			Суффикс = Суффикс + "СоСкидкой";
		КонецЕсли;
		
		Попытка
			
			ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("ШапкаТаблицыВалюта|НомерСтроки"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|НомерСтроки"), Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки")));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("ШапкаТаблицыВалюта|Артикул"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|Артикул"), Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул")));
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("ШапкаТаблицыВалюта|Данные"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|Данные"), Макет.ПолучитьОбласть("ШапкаТаблицы|Данные")));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("ШапкаТаблицыВалюта|Сумма"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|Сумма"), Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма")));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
		Исключение
		КонецПопытки;
		
		НомерСтроки = 1;
		Попытка
			Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
				
				ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("СтрокаВалюта|НомерСтроки"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|НомерСтроки"), Макет.ПолучитьОбласть("Строка|НомерСтроки")));
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(ТекущаяСтрока);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("СтрокаВалюта|Артикул"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|Артикул"), Макет.ПолучитьОбласть("Строка|Артикул")));
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(ТекущаяСтрока);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;	
				
				ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("СтрокаВалюта|Данные"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|Данные"), Макет.ПолучитьОбласть("Строка|Данные")));
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(ТекущаяСтрока);
				//++ №12909
				//ПредставлениеНоменклатуры = Строка(ТекущаяСтрока.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(ТекущаяСтрока.ХарактеристикаНоменклатуры));
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры);
				//-- №12909
				ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
				//Наценки не отражаем в ПФ
				Если ТекущаяСтрока.СуммаБезСкидки < ТекущаяСтрока.Сумма Тогда						
					ОбластьМакета.Параметры.Цена = Окр(ТекущаяСтрока.Сумма / ?(ТекущаяСтрока.Количество > 0, ТекущаяСтрока.Количество, 1), 2);
				КонецЕсли;
				
				Если ВариантФормированияПФСчетаНаОплату = 0 И ТекущаяСтрока.ВидНоменклатуры = 1 Тогда
					ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
					ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
					ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("СтрокаВалюта|Сумма"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|Сумма"), Макет.ПолучитьОбласть("Строка|Сумма")));
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(ТекущаяСтрока);
				
				Если ТекущаяСтрока.СуммаБезСкидки < ТекущаяСтрока.Сумма И ЕстьСкидки Тогда
					ОбластьМакета.Параметры.СуммаБезСкидки = ТекущаяСтрока.Сумма;
					ОбластьМакета.Параметры.Скидка = 0;
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
		Исключение
		КонецПопытки;
		
		//подвал
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате" + Суффикс + "|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате" + Суффикс + "|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате" + Суффикс + "|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате" + Суффикс + "|Сумма");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				Если ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС И ДанныеПечати.ИтогоСуммаНДС = 0 Тогда			
					ОбластьМакета.Параметры.ИтогоСуммаНДС = "-";
				КонецЕсли;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка 
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВсегоИПрописью");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				ОбластьМакета.Параметры.КолвоПозиций = НомерСтроки - 1;
				ОбластьМакета.Параметры.СуммаДокументаПрописью = 
				РаботаСВалютой.СформироватьЧислоПрописьюВсп(ДанныеПечати.СуммаДокумента, ДанныеПечати.Валюта, "Л=ru_RU;ДП=Ложь");
			Исключение
			КонецПопытки;		
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		Если НЕ СПечатью Тогда
			Попытка 
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		Иначе
			
			Попытка 
				Если Макет.Области.Найти("ПодвалСчетаСПечатью") <> Неопределено Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчетаСПечатью");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					
					ДвоичныеДанныеПодписи = ДанныеПечати.Организация.ФайлПечать.Файл.Получить();
					Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
						ОбластьМакета.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
					КонецЕсли;	
					ДвоичныеДанныеПодписи = ДанныеПечати.Организация.ФайлПодписьРуководителя.Файл.Получить();
					Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
						ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
					КонецЕсли;
					ДвоичныеДанныеПодписи = ДанныеПечати.Организация.ФайлПодписьГлавногоБухгалтера.Файл.Получить();
					Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
						ОбластьМакета.Рисунки.ПодписьГлавногоБухгалтера.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьМакета);				
				КонецЕсли;	
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

// в валюте учета
Функция ПолучитьТекущийДолгКлиента(Знач Период=Неопределено, Знач Организация=Неопределено, Знач Контрагент=Неопределено, Знач Договор=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",			?(Период=Неопределено, ТекущаяДатаСеанса(), Период));
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);
	Запрос.УстановитьПараметр("Договор",		Договор);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			&Период,
	|			ВЫБОР
	|					КОГДА НЕ &Организация = НЕОПРЕДЕЛЕНО
	|						ТОГДА Организация = &Организация
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА НЕ &Контрагент = НЕОПРЕДЕЛЕНО
	|						ТОГДА Контрагент = &Контрагент
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА НЕ &Договор = Договор
	|						ТОГДА Договор = &Договор
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОстаток;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// в валюте учета
Функция ПолучитьОстатокПоЗаказамПокупателей(Знач Период, Знач Организация=Неопределено, Знач Контрагент=Неопределено) Экспорт
	
	ВалютаУчета = ПолучитьФункциональнуюОпцию("ВалютаУчета");	
	Период = ?(Период=Неопределено, ТекущаяДатаСеанса(), Период);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",			Период);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗаказыПокупателейОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.ЗаказНаПроизводство КАК Документ.ЗаказПокупателя).Валюта КАК Валюта
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			&Период,
	|			ЗаказНаПроизводство ССЫЛКА Документ.ЗаказПокупателя
	|				И НЕ ВЫРАЗИТЬ(ЗаказНаПроизводство КАК Документ.ЗаказПокупателя).ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.Новый)
	|				И ВЫБОР
	|					КОГДА НЕ &Организация = НЕОПРЕДЕЛЕНО
	|						ТОГДА Организация = &Организация
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА НЕ &Контрагент = НЕОПРЕДЕЛЕНО
	|						ТОГДА Контрагент = &Контрагент
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ЗаказыПокупателейОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.ЗаказНаПроизводство КАК Документ.ЗаказПокупателя).Валюта";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = 0;
	Пока Выборка.Следующий() Цикл
		Результат = Результат + РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Выборка.Валюта, ВалютаУчета, Период, Выборка.СуммаОстаток);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВариантыФормированияПФЗаказаПокупателя() Экспорт
	ВариантыФормирования = Новый СписокЗначений;
	
	//0. Потолок - товар - услуга - потолок - товар - услуга
	//1. Потолок, Потолок, Товары, Товары, услуги, услуги
	//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются) 	
	//3. Без группировок
	ВариантыФормирования.Добавить(0, "Группировка товаров по потолкам");
	ВариантыФормирования.Добавить(4, "Группировка товаров по потолкам с промежуточными итогами");
	ВариантыФормирования.Добавить(1, "Группировка по видам товаров");
	ВариантыФормирования.Добавить(2, "Группировка по видам товаров (одинаковые позиции объединяются)");
	ВариантыФормирования.Добавить(3, "Без группировок");
	
	Возврат ВариантыФормирования;	
КонецФункции

Функция ПолучитьВариантыФормированияПФСчетаНаОплату() Экспорт
	ВариантыФормирования = Новый СписокЗначений;
	
	//0. Потолок - товар - услуга - потолок - товар - услуга
	//1. Потолок, Потолок, Товары, Товары, услуги, услуги
	//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются) 	
	ВариантыФормирования.Добавить(0, "Группировка товаров по потолкам");
	ВариантыФормирования.Добавить(1, "Группировка по видам товаров");
	ВариантыФормирования.Добавить(2, "Группировка по видам товаров (одинаковые позиции объединяются)");
	ВариантыФормирования.Добавить(3, "Без группировок");
	
	Возврат ВариантыФормирования;	
КонецФункции

Функция ПолучитьВариантыФормированияПФРТИУ() Экспорт
	ВариантыФормирования = Новый СписокЗначений;
	
	//0. Потолок - товар - услуга - потолок - товар - услуга
	//1. Потолок, Потолок, Товары, Товары, услуги, услуги
	//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются) 	
	ВариантыФормирования.Добавить(0, "Группировка товаров по потолкам");
	ВариантыФормирования.Добавить(1, "Группировка по видам товаров");
	ВариантыФормирования.Добавить(2, "Группировка по видам товаров (одинаковые позиции объединяются)");
	ВариантыФормирования.Добавить(4, "Группировка по группам номенклатуры");  // #12807
	ВариантыФормирования.Добавить(5, "Группировка по группам номенклатуры (одинаковые позиции объединяются)");  // №13374
	ВариантыФормирования.Добавить(3, "Без группировок");
	
	Возврат ВариантыФормирования;	
КонецФункции

Функция ПолучитьВариантыФормированияПФЗаказаПоставщику() Экспорт
	ВариантыФормирования = Новый СписокЗначений;
	
	//0. Потолок - товар - услуга - потолок - товар - услуга
	//1. Потолок, Потолок, Товары, Товары, услуги, услуги
	//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются) 	
	ВариантыФормирования.Добавить(0, "Группировка товаров по потолкам");
	ВариантыФормирования.Добавить(1, "Группировка по видам товаров");
	ВариантыФормирования.Добавить(2, "Группировка по видам товаров (одинаковые позиции объединяются)");
	ВариантыФормирования.Добавить(3, "Без группировок");
	ВариантыФормирования.Добавить(4, "Без группировок (одинаковые позиции объединяются)");
	
	Возврат ВариантыФормирования;	
КонецФункции

Функция ПолучитьВариантыФормированияПФПеремещения() Экспорт
	ВариантыФормирования = Новый СписокЗначений;
	
	ВариантыФормирования.Добавить(0, "Без группировок");
	ВариантыФормирования.Добавить(1, "Группировка по группам номенклатуры");  // #12807
	
	Возврат ВариантыФормирования;	
КонецФункции

Функция ПолучитьВариантыФормированияПФМатериалыРозница() Экспорт
	
	ВариантыФормирования = Новый СписокЗначений;
	
	ВариантыФормирования.Добавить(1, "Группировка по комнатам");
	ВариантыФормирования.Добавить(2, "Без группировки по комнатам  (одинаковые позиции объединяются)");
	ВариантыФормирования.Добавить(0, "Группировка по комнатам и без группировки по комнатам одновременно"); // значение по умолчанию
	
	Возврат ВариантыФормирования;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииПриРаботеСФайлами

Процедура ОбновитьСписокФайлов(Форма, СписокСсылок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.Период КАК Период,
	|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя КАК ВидФайлаПрограммыПостроителя,
	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК ТекущаяСсылка,
	//|	ВЫБОР
	//|		КОГДА ПрикрепленныеДанные.СсылкаНаОбъект ССЫЛКА Справочник.Номенклатура
	//|			ТОГДА &ЭтотДокумент
	//|		ИНАЧЕ ПрикрепленныеДанные.СсылкаНаОбъект
	//|	КОНЕЦ КАК СсылкаНаОбъект,
	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК СсылкаНаОбъект,
	|	ВЫБОР
	|		КОГДА ПрикрепленныеДанные.СсылкаНаОбъект ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ПрикрепленныеДанные.СсылкаНаОбъект
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ПрикрепленныеДанные.ИмяФайла КАК ИмяФайла,
	|	ПрикрепленныеДанные.Расширение КАК Расширение,
	|	ПрикрепленныеДанные.ИмяФайла + ""."" + ПрикрепленныеДанные.Расширение КАК НаименованиеФайла,
	|	ПрикрепленныеДанные.Период КАК ДатаПрикрепления,
	|	ВЫБОР
	|		КОГДА ПрикрепленныеДанные.СсылкаНаОбъект ССЫЛКА Документ.Лид
	|			ТОГДА 1
	|		КОГДА ПрикрепленныеДанные.СсылкаНаОбъект ССЫЛКА Документ.ЗаказДоговор
	|			ТОГДА 2
	|		КОГДА ПрикрепленныеДанные.СсылкаНаОбъект ССЫЛКА Документ.Монтаж
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК Сортировка,
	|	ВЫБОР
	|		КОГДА ПрикрепленныеДанные.Расширение = ""txt""
	|			ТОГДА 10
	|		КОГДА ПрикрепленныеДанные.Расширение = ""doc""
	|			ТОГДА 18
	|		КОГДА ПрикрепленныеДанные.Расширение = ""xls""
	|			ТОГДА 20
	|		КОГДА ПрикрепленныеДанные.Расширение = ""jpg""
	|				ИЛИ ПрикрепленныеДанные.Расширение = "".jpeg""
	|			ТОГДА 42
	|		КОГДА ПрикрепленныеДанные.Расширение = ""bmp""
	|			ТОГДА 44
	|		КОГДА ПрикрепленныеДанные.Расширение = ""gif""
	|			ТОГДА 48
	|		КОГДА ПрикрепленныеДанные.Расширение = ""png""
	|			ТОГДА 50
	|		КОГДА ПрикрепленныеДанные.Расширение = ""pdf""
	|			ТОГДА 52
	|		КОГДА ПрикрепленныеДанные.Расширение = ""docx""
	|			ТОГДА 68
	|		КОГДА ПрикрепленныеДанные.Расширение = ""xlsx""
	|			ТОГДА 70
	|		ИНАЧЕ 76
	|	КОНЕЦ КАК Картинка
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект В(&СписокСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка";
	Запрос.УстановитьПараметр("СписокСсылок", СписокСсылок);
	//Запрос.УстановитьПараметр("ЭтотДокумент", ЭтотОбъект.Объект.Ссылка);
	
	ТаблицаФайлов = Запрос.Выполнить().Выгрузить();
	ТаблицаДокументов = ТаблицаФайлов.Скопировать(, "СсылкаНаОбъект");
	ТаблицаДокументов.Свернуть("СсылкаНаОбъект");	
	
	КоличествоФайлов = 0;	
	Дерево = ДанныеФормыВЗначение(Форма.ФайлыДерево, Тип("ДеревоЗначений"));
	Для Каждого ТекущийДокумент из ТаблицаДокументов Цикл
		
		КореньДерева = Дерево.Строки.Добавить();
		КореньДерева.Документ = ТекущийДокумент.СсылкаНаОбъект;
		КореньДерева.СинонимОбъекта = ТекущийДокумент.СсылкаНаОбъект.Метаданные().Синоним;
		Если Метаданные.Документы.Содержит(ТекущийДокумент.СсылкаНаОбъект.Метаданные()) Тогда
			КореньДерева.СинонимОбъекта = КореньДерева.СинонимОбъекта + " " + ТекущийДокумент.СсылкаНаОбъект.Номер;
		КонецЕсли;
		КореньДерева.Картинка = 2;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект")
			И ТекущийДокумент.СсылкаНаОбъект = Форма.Объект.Ссылка Тогда
			КореньДерева.ЭтотДокумент = Истина;
		КонецЕсли;
		
		//Найдем все файлы по текущему документу
		НайденныеФайлы = ТаблицаФайлов.НайтиСтроки(Новый Структура("СсылкаНаОбъект", ТекущийДокумент.СсылкаНаОбъект));
		Для Каждого ТекущаяСтрока Из НайденныеФайлы Цикл
			ПодчиненнаяСтрока = КореньДерева.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(ПодчиненнаяСтрока, ТекущаяСтрока);
			ПодчиненнаяСтрока.Документ = ТекущийДокумент.СсылкаНаОбъект;
			ПодчиненнаяСтрока.ПодчиненнаяСтрока = Истина;
			ПодчиненнаяСтрока.СсылкаНаОбъект = ТекущаяСтрока.ТекущаяСсылка;
			
			КоличествоФайлов = КоличествоФайлов + 1;
		КонецЦикла;
		
	КонецЦикла;	
	ЗначениеВДанныеФормы(Дерево, Форма.ФайлыДерево);
	
	Если НЕ Форма.Элементы.Найти("ТаблицаФайлы") = Неопределено Тогда
		Если КоличествоФайлов > 0 Тогда
			Форма.Элементы.ТаблицаФайлы.Заголовок = "Файлы (" + КоличествоФайлов + ")";
		Иначе
			Форма.Элементы.ТаблицаФайлы.Заголовок = "Файлы";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Функция ПолучитьИмяФайлаПрикрепленныхДанных(СсылкаНаОбъект, Знач ЗагружаемоеИмяФайла, Знач Расширение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.ИмяФайла КАК ИмяФайла
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект = &СсылкаНаОбъект
	|	И ПрикрепленныеДанные.Расширение = &Расширение
	|	И ПрикрепленныеДанные.ИмяФайла ПОДОБНО &ИмяФайла
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПрикрепленныеДанные.Период УБЫВ";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИмяФайла", 		ЗагружаемоеИмяФайла + "%");
	Запрос.УстановитьПараметр("Расширение", 	Расширение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Если таких имен нет для файла, сразу возвращаем и дальше не идем
	Если Выборка.Количество() = 0 Тогда
		Возврат ЗагружаемоеИмяФайла;
	КонецЕсли;
	
	//присваиваем новый номер	
	//Если имя одно, то сразу присваиваем номер 1
	Если Выборка.Количество() = 1 Тогда
		Возврат ЗагружаемоеИмяФайла + "-1";
	КонецЕсли;
	
	//Если несколько выбираем последнее по дате и пытаемся нарастить
	МассивНомеров = Новый Массив;
	Пока Выборка.Следующий() Цикл	
		ПозДефис = СтрНайти(Выборка.ИмяФайла, "-", НаправлениеПоиска.СКонца);
		ДлинаСтроки = СтрДлина(Выборка.ИмяФайла);
		Если ПозДефис > 0 И ПозДефис < ДлинаСтроки Тогда
			ЧислоСтрокой = Прав(Выборка.ИмяФайла, ДлинаСтроки - ПозДефис);
			нЧисло = -1;
			Попытка
				нЧисло = Число(ЧислоСтрокой);
			Исключение
			КонецПопытки;
			Если НЕ нЧисло = -1 Тогда
				МассивНомеров.Добавить(нЧисло);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивНомеров.Количество() = 0 Тогда
		Возврат ЗагружаемоеИмяФайла + "-1";	
	КонецЕсли;
	
	ЗначениеМаксимальногоЭлемента = 0;
	Для Индекс = 0 По МассивНомеров.Количество() - 1 Цикл
		Если МассивНомеров[Индекс] > ЗначениеМаксимальногоЭлемента Тогда
			ЗначениеМаксимальногоЭлемента = МассивНомеров[Индекс];
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗагружаемоеИмяФайла + "-" + Формат(ЗначениеМаксимальногоЭлемента+1, "ЧДЦ=; ЧГ=");
	
КонецФункции

#КонецОбласти	

#Область КонтактнаяИнформация

// Актуализирует значения полей КИ из ее представления.
//
//  Параметры:
//		Представление - Строка - представление КИ
//		ЗначенияПолей - Строка - служебная информация, значения полей КИ
//		ТипКИ - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип контактной информации
//
Процедура ЗаполнитьЗначенияПолейКИПоПредставлению(Представление, ЗначенияПолей, ТипКИ = Неопределено) Экспорт
	
	Если ТипКИ = Неопределено Тогда
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.Адрес;
	КонецЕсли;
	
	Если УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(ЗначенияПолей) = Представление Тогда
		Возврат;
	КонецЕсли;
	
	// Сохраним комментарий из старых значений полей.
	Комментарий = СокрЛП(УправлениеКонтактнойИнформацией.КомментарийКонтактнойИнформации(ЗначенияПолей));
	
	// Сформируем значения полей КИ по представлению.
	ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению(Представление,	ТипКИ);
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		// Вернем комментарий обратно.
		УправлениеКонтактнойИнформацией.УстановитьКомментарийКонтактнойИнформации(ЗначенияПолей, Комментарий);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Доставка

//++ №10663
Процедура ЗаполнитьСсылкиНаДоставки(Форма) Экспорт
	
	Форма.Доставки.Очистить();
	
	Если Не ПолучитьФункциональнуюОпцию("УчитыватьДоставкуТовара") Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ЗаявкаНаДоставкуОснования.Ссылка КАК Ссылка 
	               |ИЗ
	               |	Документ.ЗаявкаНаДоставку.Основания КАК ЗаявкаНаДоставкуОснования
	               |ГДЕ
	               |	ЗаявкаНаДоставкуОснования.Основание = &Основание
	               |	И НЕ ЗаявкаНаДоставкуОснования.Ссылка.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаявкаНаДоставкуОснования.Ссылка.Дата";
	Запрос.УстановитьПараметр("Основание", Форма.Объект.Ссылка);
	
	Форма.Доставки.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	// Если документов нет, выводим декорацию
	Форма.Элементы.ДекорацияСоздатьДоставку.Видимость = (Форма.Доставки.Количество() = 0);
	
	// Существующие элементы декорации скроем (если они есть уже)
	Для Каждого ТекущаяСтрока Из Форма.Элементы.ГруппаСсылкиНаДоставки.ПодчиненныеЭлементы Цикл
		
		Если СтрНайти(ТекущаяСтрока.Имя, "ДекорацияСсылкаНаДоставкуНомер") > 0 Тогда
			ТекущаяСтрока.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	// Прорисуем элементы формы
	Сч = 0;
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ТекущаяСтрока Из Форма.Доставки Цикл
		
		ИмяЭлемента = "ДекорацияСсылкаНаДоставкуНомер_" + Сч;
		
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			НовыйЭлемент = Форма.Элементы.Вставить(ИмяЭлемента, Тип("ДекорацияФормы"), Форма.Элементы.ГруппаСсылкиНаДоставки);
		Иначе
			НовыйЭлемент = Форма.Элементы[ИмяЭлемента];
		КонецЕсли;
		
		Дата = Дата(1,1,1);
		Если ЗначениеЗаполнено(ТекущаяСтрока.Значение.ОжидаемаяДатаОтправки) Тогда
			Дата = ТекущаяСтрока.Значение.ОжидаемаяДатаОтправки;
		Иначе
			Дата = ТекущаяСтрока.Значение.Дата;
		КонецЕсли;
		
		НовыйЭлемент.Видимость = Истина;
		НовыйЭлемент.Заголовок = "Доставка на " + Формат(Дата, "ДФ=dd.MM.yyyy") + " (" + ТекущаяСтрока.Значение.Результат.Наименование + ")"; //nva
		НовыйЭлемент.Гиперссылка = Истина;
		//nva+++
		Если ТекущаяСтрока.Значение.Результат = Справочники.СтатусыЗаявокНаДоставку.Доставлено ИЛИ ТекущаяСтрока.Значение.Результат = Справочники.СтатусыЗаявокНаДоставку.Отправлено Тогда
			НовыйЭлемент.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		КонецЕсли;	
		//nva---
		НовыйЭлемент.УстановитьДействие("Нажатие", "ДекорацияСсылкаНаДоставкуНажатие");
		
		Сч = Сч + 1;
		
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
//-- №10663

// Устанавливает свойства форм документов, в которых имеются реквизиты доставки при чтении, создании
// Параметры
//		ЭлементыФормы - все элементы формы для управления свойствами и переключения закладок
//		ДокОбъект - объект, реквизиты которого используются при заполнении свойств
//
Процедура ПриЧтенииСозданииДокументовСДоставкойНаСервере(ЭлементыФормы, ДокОбъект) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("УчитыватьДоставкуТовара") Тогда
		//И (НЕ ЗначениеЗаполнено(ДокОбъект.СпособДоставки) ИЛИ ДокОбъект.СпособДоставки = Справочники.СпособыДоставкиТовара.Самовывоз) 
		Если ЭлементыФормы.Найти("СтраницаДоставка") <> Неопределено Тогда
			ЭлементыФормы.СтраницаДоставка.Видимость = Ложь;
		КонецЕсли;									
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСпискиВыбораАдресовПолучателя(ЭлементыФормы, ДокОбъект);
	
КонецПроцедуры

Функция СтруктураВыбора()
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("АдресДоставки", "");
	СтруктураВыбора.Вставить("АдресДоставкиЗначенияПолей", "");
	СтруктураВыбора.Вставить("ГородДоставки", Справочники.Города.ПустаяСсылка());
	//СтруктураВыбора.Вставить("ВремяДоставкиС", Дата(1,1,1));
	//СтруктураВыбора.Вставить("ВремяДоставкиПо", Дата(1,1,1));
	СтруктураВыбора.Вставить("ДополнительнаяИнформацияПоДоставке", "");
	
	Возврат СтруктураВыбора;
	
КонецФункции

Процедура СкопироватьСписокЗначений(СписокПриемник, СписокИсточник)
	
	СписокПриемник.Очистить();
	Для Каждого Элемент Из СписокИсточник Цикл
		СписокПриемник.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДозаполнитьПустыеСвойства(СтруктураПриемник, Источник);
	
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Элемент Из СтруктураПриемник Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			СтруктураЗаполнения.Вставить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Источник);
	ЗаполнитьЗначенияСвойств(СтруктураПриемник, СтруктураЗаполнения);
	
КонецПроцедуры

Функция ПоследниеРеквизитыДоставкиИзДокументов(ОбъектСсылка, Получатель = Неопределено)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 3
	|	Док.АдресДоставки КАК АдресДоставки,
	|	МАКСИМУМ(Док.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_ПоследниеАдреса
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Контрагент = &Получатель
	|	И Док.АдресДоставки <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.АдресДоставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 3
	|	Док.АдресДоставки,
	|	МАКСИМУМ(Док.Дата)
	|ИЗ
	|	Документ.ЗаказПокупателя КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Контрагент = &Получатель
	|	И Док.АдресДоставки <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.АдресДоставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(Док.Дата) УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ЕСТЬNULL(Реализация.Ссылка, Заказ.Ссылка)) КАК Ссылка,
	|	ВТ_ПоследниеАдреса.АдресДоставки КАК АдресДоставки
	|ПОМЕСТИТЬ ВТ_СсылкиПоАдресам
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровИУслуг КАК Реализация
	|		ПО ВТ_ПоследниеАдреса.Дата = Реализация.Дата
	|			И ВТ_ПоследниеАдреса.АдресДоставки = Реализация.АдресДоставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК Заказ
	|		ПО ВТ_ПоследниеАдреса.Дата = Заказ.Дата
	|			И ВТ_ПоследниеАдреса.АдресДоставки = Заказ.АдресДоставки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеАдреса.АдресДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПоследниеАдреса.АдресДоставки КАК АдресДоставки,
	|	ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ВТ_СсылкиПоАдресам.Ссылка.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	ВТ_СсылкиПоАдресам.Ссылка.ГородДоставки КАК ГородДоставки
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СсылкиПоАдресам КАК ВТ_СсылкиПоАдресам
	|		ПО (ВТ_СсылкиПоАдресам.АдресДоставки = ВТ_ПоследниеАдреса.АдресДоставки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ПоследниеАдреса.Дата УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Получатель",Получатель);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция АдресаПолучателяИзКонтактнойИнформации(Получатель)
	
	// Адрес доставки + фактический адрес
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Представление КАК АдресДоставки,
	|	КонтактнаяИнформация.Вид.Представление КАК Вид,
	|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка) КАК ГородДоставки
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Получатель
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Вид.Представление,
	|	КонтактнаяИнформация.ЗначенияПолей,
	|	ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка)
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Получатель
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)";
	
	Запрос.УстановитьПараметр("Получатель", Получатель);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	
	СсылкаНаРоссию = Справочники.СтраныМира.Россия;
	
	Для каждого СтрокаТЗ из Результат Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.АдресДоставкиЗначенияПолей) Тогда
			Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(СтрокаТЗ.АдресДоставкиЗначенияПолей) Тогда
				РезультатыЧтения = Новый Структура;
				XDTOКонтактная = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(СтрокаТЗ.АдресДоставкиЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Адрес, РезультатыЧтения);
				Если РезультатыЧтения.Свойство("ТекстОшибки") Тогда
					Продолжить;
				КонецЕсли;			
				
				ДанныеАдреса = XDTOКонтактная.Состав;
				
				НаименованиеСтраны = СокрЛП(ДанныеАдреса.Страна);
				Если ВРЕГ(НаименованиеСтраны) = ВРЕГ(СокрЛП(СсылкаНаРоссию.Наименование))
					//И УправлениеКонтактнойИнформациейСлужебный.ЭтоРоссийскийАдрес(ДанныеАдреса) 
					Тогда
					НаименованиеГорода = ДанныеАдреса.Состав.Город;
					Если Прав(НаименованиеГорода, 2) = " г" Тогда
						НаименованиеГорода = Лев(НаименованиеГорода, СтрДлина(НаименованиеГорода)-2);						
					КонецЕсли;
					СтрокаТЗ.ГородДоставки = Справочники.Города.НайтиПоНаименованию(НаименованиеГорода, Истина);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСпискиВыбораАдресовПолучателя(ЭлементыФормы, ДокОбъект) Экспорт
	
	Получатель = ДокОбъект.Контрагент;
	
	Если Не ЗначениеЗаполнено(Получатель) Тогда
		ОбщийМодульКлиентСервер.ОчиститьСпискиВыбораАдресовПолучателя(ЭлементыФормы);
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	
	Для Каждого Стр Из АдресаПолучателяИзКонтактнойИнформации(Получатель) Цикл
		НайденныйЭлементСЗ = ОбщийМодульКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
		Если НайденныйЭлементСЗ = Неопределено Тогда
			СтруктураВыбора = СтруктураВыбора();
			ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
			СписокВыбора.Добавить(СтруктураВыбора, Стр.Вид + ": " + Стр.АдресДоставки);
		Иначе
			ДозаполнитьПустыеСвойства(НайденныйЭлементСЗ.Значение, Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из ПоследниеРеквизитыДоставкиИзДокументов(ДокОбъект.Ссылка, Получатель) Цикл
		НайденныйЭлементСЗ = ОбщийМодульКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
		Если НайденныйЭлементСЗ = Неопределено Тогда
			СтруктураВыбора = СтруктураВыбора();
			ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
			СписокВыбора.Добавить(СтруктураВыбора, Стр.АдресДоставки);
		Иначе
			ДозаполнитьПустыеСвойства(НайденныйЭлементСЗ.Значение, Стр);
		КонецЕсли;
		
	КонецЦикла;
	
	СкопироватьСписокЗначений(ЭлементыФормы.АдресДоставки.СписокВыбора, СписокВыбора);
	
КонецПроцедуры

// Заполняет реквизиты доставки в зависимости от элемента формы, в котором производятся изменения
// Параметры:
//		ЭлементыФормы - ВсеЭлементыФормы - все элементы формы, в которой производятся изменения,
//		ИмяЭлементаФормы - Строка - имя элемента формы, в котором произошли изменения,
//		ДокОбъект - ДанныеФормыСтруктура - объект, реквизиты которого используются при заполнении
//
Процедура ЗаполнитьРеквизитыДоставки(ЭлементыФормы, ДокОбъект) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("УчитыватьДоставкуТовара") Тогда
		Возврат;
	КонецЕсли;
	
	Получатель = Новый Структура("ИмяПоля, Значение", "Контрагент", ДокОбъект.Контрагент);
	РеквизитыДоставки = ОбщийМодульКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки();
	РеквизитыДоставки.Вставить(Получатель.ИмяПоля, Получатель.Значение);
	РеквизитыДоставки.Вставить("Ссылка");
	ЗаполнитьЗначенияСвойств(РеквизитыДоставки, ДокОбъект);
	
	// ИмяЭлементаФормы = "Контрагент"
	
	ОбщийМодульКлиентСервер.ОчиститьРеквизитыДоставки(ЭлементыФормы, РеквизитыДоставки);
	Если ЗначениеЗаполнено(Получатель.Значение) Тогда
		
		ЗаполнитьСпискиВыбораАдресовПолучателя(ЭлементыФормы, РеквизитыДоставки);
		Если ЭлементыФормы.АдресДоставки.СписокВыбора.Количество() > 0 Тогда
			ПерваяСтруктураВСписке = ЭлементыФормы.АдресДоставки.СписокВыбора[0].Значение;
			РеквизитыДоставки.АдресДоставки = ПерваяСтруктураВСписке.АдресДоставки;
			РеквизитыДоставки.АдресДоставкиЗначенияПолей = ПерваяСтруктураВСписке.АдресДоставкиЗначенияПолей;
		КонецЕсли;
		
		РеквизитыДоставки.СпособДоставки = ДокОбъект.СпособДоставки;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокОбъект.СпособДоставки) И НЕ ДокОбъект.СпособДоставки = Справочники.СпособыДоставкиТовара.Самовывоз Тогда
		ЗаполнитьЗначенияСвойств(ДокОбъект, РеквизитыДоставки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Производство

//#13345
Процедура ИзменитьПолотнаВМатериалах(ДокОбъект, ЗаменитьПолотна = Ложь, Знач ЭтоОстаток = Истина) Экспорт
	
	Если ЭтоОстаток Тогда
		НоваяНоменклатура = Справочники.Номенклатура.ОстаткиПленки;
	Иначе
		НоваяНоменклатура = Справочники.Номенклатура.ПолотноЗаказчика;
	КонецЕсли;
	
	Если ЗаменитьПолотна Тогда
		Для Каждого ТекущаяСтрока Из ДокОбъект.Материалы Цикл
			Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
				СтараяНоменклатура = ТекущаяСтрока.Номенклатура;
				ТекущаяСтрока.Номенклатура = НоваяНоменклатура;
				ТекущаяСтрока.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
				ТекущаяСтрока.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				
				// У остатка / материала заказчика всегда базовая единица измерения
				// и коэффициент 1, старое количество переумножаем на коэффициент
				ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
				ТекущаяСтрока.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
				ТекущаяСтрока.Коэффициент = 1;				
			КонецЕсли;
		КонецЦикла;
	Иначе
		НоваяСтрока = ДокОбъект.Материалы.Добавить();
		НоваяСтрока.Номенклатура = НоваяНоменклатура;
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = 1;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область РаботаСЗаказами

Процедура ЗаполнитьТоварыЗаказаПокупателя(ТоварыЗаказаПокупателя, СсылкаНаЗаказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТоварыЗаказаПокупателя.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаЗаказ);
	Запрос.Текст = 
	"ВЫБРАТЬ разрешенные
	|	ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяТовары.АдресМонтажа КАК АдресМонтажа,
	|	ЗаказПокупателяТовары.Бесплатно КАК Бесплатно,
	|	ЗаказПокупателяТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПокупателяТовары.ЗагруженоИзПостроителя КАК ЗагруженоИзПостроителя,
	|	ЗаказПокупателяТовары.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ЗаказПокупателяТовары.Количество КАК Количество,
	|	ЗаказПокупателяТовары.КоличествоКВыработке КАК КоличествоКВыработке,
	|	ЗаказПокупателяТовары.Комната КАК Комната,
	|	ЗаказПокупателяТовары.Коэффициент КАК Коэффициент,
	|	ЗаказПокупателяТовары.Назначение КАК Назначение,
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.НомерУпаковки КАК НомерУпаковки,
	|	ЗаказПокупателяТовары.Потолок КАК Потолок,
	|	ЗаказПокупателяТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ЗаказПокупателяТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ЗаказПокупателяТовары.Спецификация КАК Спецификация,
	|	ЗаказПокупателяТовары.Сумма КАК Сумма,
	|	ЗаказПокупателяТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.Цена КАК Цена,
	|	ЗаказПокупателяТовары.ЦенаВал КАК ЦенаВал,
	|	ЗаказПокупателяТовары.УИСтроки КАК УИСтроки,
	|	ЗаказПокупателяТовары.УИСтрокиРодителя КАК УИСтрокиРодителя,
	|	ЗаказПокупателяТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПокупателяТовары.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателяТовары.СкидкаБонусами КАК СкидкаБонусами,
	|	ЗаказПокупателяТовары.БонусыКНачислению КАК БонусыКНачислению
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &Ссылка";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТоварыЗаказаПокупателя.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСВозвратами

Функция ТаблицаСебестоимостиПродаж(МассивДокументовПродажи) Экспорт
	
	ТаблицаСебестоимости = Новый ТаблицаЗначений;
	Если МассивДокументовПродажи.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТоварыНаСкладахОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТоварыНаСкладахОбороты.Регистратор КАК Регистратор,
		|	ТоварыНаСкладахОбороты.КоличествоРасход КАК Количество,
		|	ТоварыНаСкладахОбороты.СуммаРасход КАК Сумма,
		|	ТоварыНаСкладахОбороты.СуммаРасход КАК СуммаВал,
		|	ВЫБОР
		|		КОГДА НЕ ТоварыНаСкладахОбороты.КоличествоРасход = 0
		|			ТОГДА ТоварыНаСкладахОбороты.СуммаРасход / ТоварыНаСкладахОбороты.КоличествоРасход
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА НЕ ТоварыНаСкладахОбороты.КоличествоРасход = 0
		|			ТОГДА ТоварыНаСкладахОбороты.СуммаВалРасход / ТоварыНаСкладахОбороты.КоличествоРасход
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаВал
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, ) КАК ТоварыНаСкладахОбороты
		|ГДЕ
		|	ТоварыНаСкладахОбороты.Регистратор В(&МассивДокументовПродажи)";
		
		Запрос.УстановитьПараметр("МассивДокументовПродажи", МассивДокументовПродажи);
		ТаблицаСебестоимости = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Возврат ТаблицаСебестоимости;
	
КонецФункции

Функция МассивЗаказовПоРеализациям(ВозвратСсылка, ДокументПродажи, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПродажиОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
	|	ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.Регистратор <> &Регистратор
	|	И ПродажиОбороты.ДокументПродажи = &ДокументПродажи
	|	И ПродажиОбороты.Номенклатура = &Номенклатура
	|	И ПродажиОбороты.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И ПродажиОбороты.СерияНоменклатуры = &СерияНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.ХарактеристикаНоменклатуры,
	|	ПродажиОбороты.СерияНоменклатуры,
	|	ПродажиОбороты.ДокументПродажи,
	|	ПродажиОбороты.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ЗаказПокупателя КАК ЗаказПокупателя
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("Регистратор", ВозвратСсылка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	Запрос.УстановитьПараметр("ДокументПродажи", ДокументПродажи);
	ТаблицаПродаж = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПродаж.ВыгрузитьКолонку("ЗаказПокупателя");
	
КонецФункции

Функция МассивРеализацийПоЗаказуИНоменклатуре(ВозвратСсылка, ЗаказПокупателя, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ВозвратСсылка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.УстановитьПараметр("ОтборПоЗаказу", ЗначениеЗаполнено(ЗаказПокупателя));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПродажиОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
	|	ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.Регистратор <> &Регистратор
	|	И ВЫБОР КОГДА &ОтборПоЗаказу ТОГДА ПродажиОбороты.ЗаказПокупателя = &ЗаказПокупателя ИНАЧЕ ИСТИНА КОНЕЦ
	|	И ПродажиОбороты.Номенклатура = &Номенклатура
	|	И ПродажиОбороты.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И ПродажиОбороты.СерияНоменклатуры = &СерияНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.ХарактеристикаНоменклатуры,
	|	ПродажиОбороты.СерияНоменклатуры,
	|	ПродажиОбороты.ДокументПродажи,
	|	ПродажиОбороты.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ДокументПродажи КАК ДокументПродажи
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ДокументПродажи";
	
	ТаблицаПродаж = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаПродаж.ВыгрузитьКолонку("ДокументПродажи");	
	
КонецФункции

#КонецОбласти

#Область РаботаСРозницей

Процедура ЗаполнитьПодчиненныеДокументыПоПотолкам(ДокументСсылка, МассивПотолков, ПодчиненныеДокументыПоПотолку) Экспорт
	
	ПодчиненныеДокументыПоПотолку.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивПотолков", МассивПотолков);
	Запрос.УстановитьПараметр("Основание", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПоставщикуТовары.Ссылка КАК Документ,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Потолок
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Номенклатура В(&МассивПотолков)
	|	И ЗаказПоставщикуТовары.Ссылка.Проведен
	|	И ЗаказПоставщикуТовары.Ссылка.Основание = &Основание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровИУслуг.Ссылка,
	|	ПоступлениеТоваровИУслуг.Номенклатура
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровИУслуг
	|ГДЕ
	|	ПоступлениеТоваровИУслуг.Номенклатура В(&МассивПотолков)
	|	И ПоступлениеТоваровИУслуг.Ссылка.Проведен
	|	И ПоступлениеТоваровИУслуг.Ссылка.Основание = &Основание";
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЗаказНаПроизводство.Ссылка КАК Документ,
	//|	ЗаказНаПроизводство.ПродукцияНоменклатура
	//|ИЗ
	//|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	//|ГДЕ
	//|	ЗаказНаПроизводство.Проведен
	//|	И ЗаказНаПроизводство.ПродукцияНоменклатура В(&МассивПотолков)";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ПодчиненныеДокументыПоПотолку.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ВидОперацииМонтажаПоВидуЗаказа(ВидЗаказа) Экспорт
	
	СоответствиеВидов = Новый Соответствие;
	СоответствиеВидов.Вставить(Справочники.ВидыЗаказДоговоров.Договор, Справочники.ВидыМонтажа.Монтаж);
	СоответствиеВидов.Вставить(Справочники.ВидыЗаказДоговоров.Рекламация, Справочники.ВидыМонтажа.Рекламация);
	СоответствиеВидов.Вставить(Справочники.ВидыЗаказДоговоров.СервиснаяЗаявка, Справочники.ВидыМонтажа.СервиснаяЗаявка);
	СоответствиеВидов.Вставить(Справочники.ВидыЗаказДоговоров.Продажа, Справочники.ВидыМонтажа.Продажа);
	
	Возврат СоответствиеВидов.Получить(ВидЗаказа);
	
КонецФункции

Функция ПроверитьНаличиеМонтажейПоВиду(ВидОперацииМонтажа, Основание, ТолькоВыполненные, ИсключитьПродажи) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Монтаж КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Основание = &Основание
	|	И ДанныеДокумента.ВидОперации = &ВидОперации
	|	И ВЫБОР
	|			КОГДА &ТолькоВыполненные
	|				ТОГДА ДанныеДокумента.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Выполнен), ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Закрыт))
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИсключитьПродажи
	|				ТОГДА НЕ ДанныеДокумента.ВидОперации В (ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Продажа))
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперацииМонтажа);
	Запрос.УстановитьПараметр("ТолькоВыполненные", ТолькоВыполненные);
	Запрос.УстановитьПараметр("ИсключитьПродажи", ИсключитьПродажи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьДатуПодписанияДокументаМонтажа(СсылкаНаОбъект)  Экспорт
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, "ВариантЗаполненияДатыПодписания, СрокМонтажа, Дата, ДатаМонтажа, ДатаПодписанияДокументов, ДатаВыполнения");
	
	Если РеквизитыДокумента.ВариантЗаполненияДатыПодписания = Перечисления.ВариантыЗаполненияДатыПодписанияВМонтаже.НеЗаполнять Тогда
		Возврат Дата(1,1,1);
	КонецЕсли;
	
	Если РеквизитыДокумента.ВариантЗаполненияДатыПодписания = Перечисления.ВариантыЗаполненияДатыПодписанияВМонтаже.ДатойДокумента Тогда
		Возврат РеквизитыДокумента.Дата;
	КонецЕсли;	
		
	Если РеквизитыДокумента.ВариантЗаполненияДатыПодписания = Перечисления.ВариантыЗаполненияДатыПодписанияВМонтаже.ДатойВыполненияМонтажа Тогда
		Возврат РеквизитыДокумента.ДатаВыполнения;
	КонецЕсли;	
		
	Если РеквизитыДокумента.ВариантЗаполненияДатыПодписания = Перечисления.ВариантыЗаполненияДатыПодписанияВМонтаже.ПлановойДатойНачалаМонтажа Тогда
		Возврат РеквизитыДокумента.ДатаМонтажа;
	КонецЕсли;		
		
	Если РеквизитыДокумента.ВариантЗаполненияДатыПодписания = Перечисления.ВариантыЗаполненияДатыПодписанияВМонтаже.ПлановойДатойЗавершенияМонтажа Тогда
		Если РеквизитыДокумента.СрокМонтажа = Перечисления.СрокиМонтажа.МонтажНаНесколькоДней Тогда
			РасчетнаяДатаПечати = Дата(1,1,1);
			Для каждого Запись из СсылкаНаОбъект.ГрафикМонтажей Цикл
				РасчетнаяДатаПечати = ?(РасчетнаяДатаПечати < Запись.ДатаМонтажа, Запись.ДатаМонтажа, РасчетнаяДатаПечати);
			КонецЦикла;
			Возврат РасчетнаяДатаПечати;
		Иначе	
			Возврат РеквизитыДокумента.ДатаВыполнения;
		КонецЕсли;
	КонецЕсли;		
		
	Если РеквизитыДокумента.ВариантЗаполненияДатыПодписания = Перечисления.ВариантыЗаполненияДатыПодписанияВМонтаже.ПроизвольнаяДата Тогда
		Возврат РеквизитыДокумента.ДатаПодписанияДокументов;
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьИнтервалыВремениСледующегоКонтакта() Экспорт

	Интервалы = Новый СписокЗначений;
	
	//#16861
	ВремяНачала = Константы.ВремяНачалаСледующегоКонтакта.Получить();
	ВремяОкончания = Константы.ВремяОкончанияСледующегоКонтакта.Получить();
	Шаг = Константы.ШагВремениВыбораСледующегоКонтакта.Получить();
	
	Если ЗначениеЗаполнено(ВремяНачала) И ЗначениеЗаполнено(ВремяОкончания) 
		И ЗначениеЗаполнено(Шаг)
		И ВремяНачала <= ВремяОкончания Тогда 		
		
		Пока ВремяНачала <= ВремяОкончания Цикл
			Интервалы.Добавить(ВремяНачала, Формат(ВремяНачала, "ДФ=HH:mm"));
			ВремяНачала = ВремяНачала + Шаг*60*60;
		КонецЦикла;
	КонецЕсли;		
		
	Возврат Интервалы;
	
КонецФункции

#КонецОбласти

#Область Взаиморасчеты

Функция ДолгКонтрагента(Организация, Контрагент, Дата = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, Дата(3000,1,1), Новый Граница(Дата, ВидГраницы.Включая)));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&Дата, Организация = &Организация и Контрагент = &Контрагент) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область ОжидаемыеПоставки

//#16643
Процедура ОжидаемыеПоставки_УдалитьЗаписиПоЗаказу(ЗаказПоставщику) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеРегистра.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ДанныеРегистра.Склад КАК Склад,
	|	ДанныеРегистра.Номенклатура КАК Номенклатура,
	|	ДанныеРегистра.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	РегистрСведений.ОжидаемыеПоставкиТоваров КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ЗаказПоставщику = &ЗаказПоставщику";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ОжидаемыеПоставкиТоваров.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОжидаемыеПоставки_Рассчитать(ЗаказПоставщику) Экспорт

	// Заказ поставщику: Приход +
	// Поступление:      Расход +
	// Возврат:          Расход -

	УстановитьПривилегированныйРежим(Истина);
	
	// удаляем все записи, будем формирвать новые
	ОжидаемыеПоставки_УдалитьЗаписиПоЗаказу(ЗаказПоставщику);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикам.ЗаказПоставщику.Склад КАК Склад,
	|	ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикам.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказыПоставщикам.КоличествоПриход КАК Заказано
	|ПОМЕСТИТЬ ВТ_Заказано
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Обороты(, , Авто, ЗаказПоставщику = &ЗаказПоставщику) КАК ЗаказыПоставщикам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикам.Регистратор.Склад КАК Склад,
	|	ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикам.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказыПоставщикам.КоличествоРасход КАК Получено
	|ПОМЕСТИТЬ ВТ_Получено
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Обороты(, , Регистратор, ЗаказПоставщику = &ЗаказПоставщику) КАК ЗаказыПоставщикам
	|ГДЕ
	|	НЕ ЗаказыПоставщикам.КоличествоРасход = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Заказано.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ВТ_Заказано.Склад КАК Склад,
	|	ВТ_Заказано.Номенклатура КАК Номенклатура,
	|	ВТ_Заказано.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЛОЖЬ КАК Обработано,
	|	СУММА(ВТ_Заказано.Заказано) КАК Заказано
	|ИЗ
	|	ВТ_Заказано КАК ВТ_Заказано
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказано.ЗаказПоставщику,
	|	ВТ_Заказано.Склад,
	|	ВТ_Заказано.Номенклатура,
	|	ВТ_Заказано.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Получено.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ВТ_Получено.Склад КАК Склад,
	|	ВТ_Получено.Номенклатура КАК Номенклатура,
	|	ВТ_Получено.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЛОЖЬ КАК Обработано,
	|	СУММА(ВТ_Получено.Получено) КАК Получено
	|ИЗ
	|	ВТ_Получено КАК ВТ_Получено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Получено.ЗаказПоставщику,
	|	ВТ_Получено.Склад,
	|	ВТ_Получено.Номенклатура,
	|	ВТ_Получено.ХарактеристикаНоменклатуры";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// при проведении записи уже будут
	ТаблицаЗаказано = РезультатЗапроса[2].Выгрузить();
	ТаблицаПолучено = РезультатЗапроса[3].Выгрузить();
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("ЗаказПоставщику", 			 Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
	ТаблицаРезультата.Колонки.Добавить("Склад", 					 Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаРезультата.Колонки.Добавить("Номенклатура", 				 Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаРезультата.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	ТаблицаРезультата.Колонки.Добавить("Заказано", 					 Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ТаблицаРезультата.Колонки.Добавить("ОсталосьПолучить", 			 Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	
	Для каждого СтрокаТЗ из ТаблицаПолучено Цикл
		СтруктураПоиска = Новый Структура("ЗаказПоставщику, Склад, Номенклатура, ХарактеристикаНоменклатуры, Обработано");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЗ);
		//СтруктураПоиска.Обработано = Ложь;
		
		НС = ТаблицаЗаказано.НайтиСтроки(СтруктураПоиска);
		Если НС.Количество() > 0 Тогда
			НоваяСтрока = ТаблицаРезультата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			НоваяСтрока.Заказано         = НС[0].Заказано;
			НоваяСтрока.ОсталосьПолучить = НоваяСтрока.Заказано - СтрокаТЗ.Получено;
			
			НС[0].Обработано = Истина;
		Иначе
			// попробуем найти без склада
			СтруктураПоиска.Склад = Справочники.Склады.ПустаяСсылка();
			НС = ТаблицаЗаказано.НайтиСтроки(СтруктураПоиска);
			Если НС.Количество() > 0 Тогда
				НоваяСтрока = ТаблицаРезультата.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
				НоваяСтрока.Заказано         = НС[0].Заказано;
				НоваяСтрока.ОсталосьПолучить = НоваяСтрока.Заказано - СтрокаТЗ.Получено;
				
				// если заказ без склада, то поступление может быть на разные склады
				// в заказе оставляем остаток, в регистр пишем часть полученного
				Если НоваяСтрока.ОсталосьПолучить > 0 И СтрокаТЗ.Получено > 0 Тогда
					НС[0].Заказано 		 = НоваяСтрока.ОсталосьПолучить; 					
					НоваяСтрока.Заказано = СтрокаТЗ.Получено;
					НоваяСтрока.ОсталосьПолучить = 0;
				Иначе
					НС[0].Обработано = Истина;
				КонецЕсли;
			Иначе
				// строки, у которых измерения различаются
				НоваяСтрока = ТаблицаРезультата.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
				НоваяСтрока.Заказано         = 0;
				НоваяСтрока.ОсталосьПолучить = НоваяСтрока.Заказано - СтрокаТЗ.Получено;				
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	// строки заказа, по которым нет поступлений
	Для каждого СтрокаТЗ из ТаблицаЗаказано Цикл
		Если СтрокаТЗ.Обработано Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		НоваяСтрока.Заказано         = СтрокаТЗ.Заказано;
		НоваяСтрока.ОсталосьПолучить = НоваяСтрока.Заказано;
	КонецЦикла;
	
	// делаем записи
	Для каждого СтрокаТЗ из ТаблицаРезультата Цикл		
		МенеджерЗаписи = РегистрыСведений.ОжидаемыеПоставкиТоваров.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТЗ);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаЗаполненияМенеджера(Форма, МетаданныеДокумента, Менеджер) Экспорт
	
	Если МетаданныеДокумента = Метаданные.Документы.Лид Тогда
		//#5596
		ЗначениеНастройки = Константы.АвтоматическиЗаполнятьМенеджераВЛиде.Получить();
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ЗаказПокупателя Тогда
		//#16334
		ЗначениеНастройки = Константы.АвтоматическиЗаполнятьМенеджераВЗаказеПокупателя.Получить();
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.Монтаж Тогда
		//#16334
		ЗначениеНастройки = Константы.АвтоматическиЗаполнятьМенеджераВМонтаже.Получить();
	Иначе
		Возврат;		
	КонецЕсли;
		
	Если ЗначениеНастройки
		И НЕ Форма.Параметры.Ключ.Пустая()
		И НЕ Форма.ТолькоПросмотр
		И ПравоДоступа("Изменение", МетаданныеДокумента)
		И НЕ ЗначениеЗаполнено(Форма.Объект.Менеджер)
		И ЗначениеЗаполнено(Менеджер)
		Тогда
		Форма.Объект.Менеджер = Менеджер;
		Форма.ИзмененМенеджер = Истина;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ЕстьЗапретИзмененияДанных(ДатаДокумента) Экспорт
	
	ДействующиеДаты = ДатыЗапретаИзмененияСлужебный.ДействующиеДатыЗапрета();
	
	ДанныеДляПроверки = Новый ТаблицаЗначений;	
	ДанныеДляПроверки.Колонки.Добавить("Раздел");
	ДанныеДляПроверки.Колонки.Добавить("Объект");
	ДанныеДляПроверки.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	Для каждого Строка из ДействующиеДаты.ИсточникиДанных Цикл 
		Для каждого СтрокаРаздела из Строка.Значение.Состав Цикл			
			НоваяСтрока = ДанныеДляПроверки.Добавить();
			НоваяСтрока.Раздел = СтрокаРаздела.Раздел;
			НоваяСтрока.Объект = НоваяСтрока.Раздел;
			НоваяСтрока.Дата = ДатаДокумента; 		
		КонецЦикла;		
	КонецЦикла;
	ДанныеДляПроверки.Свернуть("Раздел,Объект,Дата");	
	
	ДанныеИДаты = Новый Структура;
	ДанныеИДаты.Вставить("ДействующиеДаты",   ДействующиеДаты);
	ДанныеИДаты.Вставить("ДанныеДляПроверки", ДанныеДляПроверки);
	
	Возврат ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ДанныеДляПроверки);
	
КонецФункции

Функция ОбновитьЭлементыФормыПоследовательностьСебестоимости(Форма, Знач ВыводитьТекстОшибкиВосстановления = Ложь, МоментВремениДокумента = Неопределено, ИспользуютсяЭлементыВПорядке = Истина) Экспорт
	
	Результат = Ложь;
	
	Если ОбщийМодуль.ПоследовательностьПоСебестоимостиНарушена() Тогда
		ГраницаПоследовательности = ОбщийМодуль.ПолучитьГраницуПоследовательностиПоСебестоимости();
		
		//#9062 переделано на форматированную строку
		
		//ТекстОшибки = "Для корректного расчёта себестоимости все документы должны проводиться строго в хронологическом порядке." + Символы.ПС 
		//+ "В базе имеются документы, которые были проведены или изменены задним числом, что привело к нарушению хронологии последовательности." + Символы.ПС 
		//+ "Последний документ, до которого себестоимость посчитана правильно: " + Символы.ПС + ГраницаПоследовательности + Символы.ПС 
		//+ "Для перепроведения документов в хронологическом порядке (для пересчета себестоимости) нажмите на кнопку ""Восстановить""."+ Символы.ПС 
		//+ "Если система не сможет какой-то документ провести автоматически, восстановление последовательности будет остановлено." + Символы.ПС 
		//+ "Необходимо такой документ исправить, провести вручную и повторно запустить восстановление последовательности.";
		
		//Если ВыводитьТекстОшибкиВосстановления Тогда
		//	УстановитьПривилегированныйРежим(Истина);
		//	ТекстОшибкиВосстановления = РегламентныеЗаданияСлужебный.СообщенияИОписанияОшибокРегламентногоЗадания(РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностиПоСебестоимостиТоваров));
		//	ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС
		//	+ ?(ПустаяСтрока(ТекстОшибкиВосстановления),"", "Ошибка, полученная в результате последнего автоматического запуска восстановления последовательности: " + ТекстОшибкиВосстановления);
		//КонецЕсли;
		
		//Форма.Элементы.ДекорацияНарушенаПоследовательность.Заголовок = ТекстОшибки;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СебестоимостьЗапасов.Регистратор КАК ПроблемныйРегистратор,
		|	СебестоимостьЗапасовГраницы.Регистратор КАК УспешныйРегистратор
		|ИЗ
		|	Последовательность.СебестоимостьЗапасов КАК СебестоимостьЗапасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Последовательность.СебестоимостьЗапасов.Границы КАК СебестоимостьЗапасовГраницы
		|		ПО (ИСТИНА)
		|ГДЕ
		|	СебестоимостьЗапасов.МоментВремени > СебестоимостьЗапасовГраницы.МоментВремени
		//#14513
		|	И СебестоимостьЗапасов.Регистратор.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	СебестоимостьЗапасов.МоментВремени";
		
		Выборка = Запрос.Выполнить().Выбрать();
		ПроблемныйРегистратор = Неопределено;
		УспешныйРегистратор = ГраницаПоследовательности.Ссылка;
		Если Выборка.Следующий() Тогда
			ПроблемныйРегистратор = Выборка.ПроблемныйРегистратор;
			УспешныйРегистратор   = Выборка.УспешныйРегистратор;	
		КонецЕсли;
		
		ШрифтСообщения = Новый Шрифт(,,Истина);
		ЦветСообщения = WebЦвета.Красный;
		ЦветУспешногоДокумента = WebЦвета.ЗеленыйЛес;
		ЦветПроблемногоДокумента = WebЦвета.ТемноКрасный;
		ФормСтрока1 = Новый ФорматированнаяСтрока("Для корректного расчёта себестоимости все документы должны проводиться строго в хронологическом порядке. 
		|В базе имеются документы, которые были проведены или изменены задним числом, что привело к нарушению хронологии последовательности.", ШрифтСообщения, ЦветСообщения);  
		ФормСтрока2 = Новый ФорматированнаяСтрока("Последний документ, до которого себестоимость посчитана правильно: ", ШрифтСообщения, ЦветСообщения);
		ФормСтрока3 = Новый ФорматированнаяСтрока(Строка(УспешныйРегистратор), ШрифтСообщения, ЦветУспешногоДокумента, , ПолучитьНавигационнуюСсылку(УспешныйРегистратор));
		ФормСтрока4 = Новый ФорматированнаяСтрока("Документ, на котором остановилось восстановление последовательности: ", ШрифтСообщения, ЦветСообщения);
		ФормСтрока5 = Новый ФорматированнаяСтрока(Строка(ПроблемныйРегистратор), ШрифтСообщения, ЦветПроблемногоДокумента, , ПолучитьНавигационнуюСсылку(ПроблемныйРегистратор));
		ФормСтрока6 = Новый ФорматированнаяСтрока("Для перепроведения документов в хронологическом порядке (для пересчета себестоимости) нажмите на кнопку ""Восстановить"". 
		|Если система не сможет какой-то документ провести автоматически, восстановление последовательности будет остановлено. 
		|Необходимо такой документ исправить, провести вручную и повторно запустить восстановление последовательности.", ШрифтСообщения, ЦветСообщения);
		
		СтрокОшибок = 0;
		Если ВыводитьТекстОшибкиВосстановления Тогда
			УстановитьПривилегированныйРежим(Истина);
			ТекстОшибкиВосстановления = РегламентныеЗаданияСлужебный.СообщенияИОписанияОшибокРегламентногоЗадания(РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностиПоСебестоимостиТоваров));
			ВыводитьТекстОшибкиВосстановления = НЕ ПустаяСтрока(ТекстОшибкиВосстановления); 
			Если ВыводитьТекстОшибкиВосстановления Тогда
				ФормСтрока7 = Новый ФорматированнаяСтрока("Ошибка, полученная в результате последнего автоматического запуска восстановления последовательности: " + ТекстОшибкиВосстановления, ШрифтСообщения, ЦветСообщения);		
				
				МассивСтрокОшибки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстОшибкиВосстановления, Символы.ПС, Ложь, Ложь);
				СтрокОшибок = МассивСтрокОшибки.Количество() + 1;
			КонецЕсли;
		КонецЕсли;
		
		МассивСтрокСообщения = Новый Массив;
		МассивСтрокСообщения.Добавить(ФормСтрока1);
		МассивСтрокСообщения.Добавить(Символы.ПС);
		МассивСтрокСообщения.Добавить(ФормСтрока2);
		МассивСтрокСообщения.Добавить(ФормСтрока3);
		МассивСтрокСообщения.Добавить(Символы.ПС);
		МассивСтрокСообщения.Добавить(ФормСтрока4);
		МассивСтрокСообщения.Добавить(ФормСтрока5);
		МассивСтрокСообщения.Добавить(Символы.ПС);
		МассивСтрокСообщения.Добавить(ФормСтрока6);
		Если ВыводитьТекстОшибкиВосстановления Тогда
			МассивСтрокСообщения.Добавить(Символы.ПС);
			МассивСтрокСообщения.Добавить(Символы.ПС);
			МассивСтрокСообщения.Добавить(ФормСтрока7);
		КонецЕсли;
		
		Форма.НарушенаПоследовательностьСебестоимость = Новый ФорматированнаяСтрока(МассивСтрокСообщения);
		Форма.Элементы.НарушенаПоследовательностьСебестоимость.Высота = 7 + СтрокОшибок;
		
		Если МоментВремениДокумента = Неопределено Тогда
			Форма.Элементы.ГруппаПоследовательность.Видимость = Истина;
			Если ИспользуютсяЭлементыВПорядке Тогда
				Форма.Элементы.ДекорацияПоследовательностьВПорядке.Видимость = Ложь;
			КонецЕсли;
			Результат = Истина;
		Иначе
			Если МоментВремениДокумента.Сравнить(ГраницаПоследовательности) = 1 Тогда			
				Форма.Элементы.ГруппаПоследовательность.Видимость = Истина;
				Если ИспользуютсяЭлементыВПорядке Тогда
					Форма.Элементы.ДекорацияПоследовательностьВПорядке.Видимость = Ложь;
				КонецЕсли;
				Результат = Истина;
			Иначе
				Форма.Элементы.ГруппаПоследовательность.Видимость = Ложь;
				Если ИспользуютсяЭлементыВПорядке Тогда
					Форма.Элементы.ДекорацияПоследовательностьВПорядке.Видимость = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Форма.Элементы.ГруппаПоследовательность.Видимость = Ложь;
		Если ИспользуютсяЭлементыВПорядке Тогда
			Форма.Элементы.ДекорацияПоследовательностьВПорядке.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьИндикаторРаботыСоСканерамиШК(Форма) Экспорт
	
	//создаем команду
	ИмяКоманды = "ДоступнаРаботаСоСканеромШтрихкодов";
	//Команда.Действие = Неопределено;
	КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
	КомандаФормы.Заголовок = "Доступна работа со сканером штрихкодов";	
	КомандаФормы.Подсказка = "Наличие данной кнопки указывает на то, что в документе доступна работа со сканером штрихкодов";
	КомандаФормы.Картинка = БиблиотекаКартинок.НовыйПоШтрихкоду;
	КомандаФормы.Отображение = ОтображениеКнопки.Картинка;
	КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
	// создаем кнопку и привязываем к ней команду	
	КнопкаФормы = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Форма.КоманднаяПанель);
	КнопкаФормы.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

Процедура ПриКопированииДокументаПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	ДанныеДляЗаполнения = новый Структура;
	ДанныеДляЗаполнения.Вставить("Автор", Пользователи.ТекущийПользователь());
	
	ЗаполнитьЗначенияСвойств(Источник, ДанныеДляЗаполнения);
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеПорядкиОкругления(Элемент) Экспорт
	
	//Порядки = Новый Массив;
	//
	//Порядки.Добавить(0.010);
	//Порядки.Добавить(0.050);
	//Порядки.Добавить(0.100);
	//Порядки.Добавить(0.200);
	//Порядки.Добавить(0.500);
	//Порядки.Добавить(1.000);
	//Порядки.Добавить(1.500);
	//Порядки.Добавить(2.000);
	//Порядки.Добавить(2.500);
	//Порядки.Добавить(3.000);
	//Порядки.Добавить(3.500);
	//Порядки.Добавить(4.000);
	//Порядки.Добавить(4.500);
	//Порядки.Добавить(5.000);
	//Порядки.Добавить(10.000);
	//Порядки.Добавить(50.000);
	//Порядки.Добавить(100.000);
	//
	//Возврат Порядки;
	
	Элемент.СписокВыбора.Очистить();
	Элемент.СписокВыбора.Добавить(0.010, "0,010");
	Элемент.СписокВыбора.Добавить(0.050, "0,050");
	Элемент.СписокВыбора.Добавить(0.100, "0,100");
	Элемент.СписокВыбора.Добавить(0.200, "0,200");
	Элемент.СписокВыбора.Добавить(0.500, "0,500");
	Элемент.СписокВыбора.Добавить(1.000, "1,000");
	Элемент.СписокВыбора.Добавить(1.500, "1,500");
	Элемент.СписокВыбора.Добавить(2.000, "2,000");
	Элемент.СписокВыбора.Добавить(2.500, "2,500");
	Элемент.СписокВыбора.Добавить(3.000, "3,000");
	Элемент.СписокВыбора.Добавить(3.500, "3,500");
	Элемент.СписокВыбора.Добавить(4.000, "4,000");
	Элемент.СписокВыбора.Добавить(4.500, "4,500");
	Элемент.СписокВыбора.Добавить(5.000, "5,000");
	Элемент.СписокВыбора.Добавить(10.000, "10,000");
	Элемент.СписокВыбора.Добавить(50.000, "50,000");
	Элемент.СписокВыбора.Добавить(100.000, "100,000");
	
КонецПроцедуры

Процедура ОтметитьЗапускОтчетаЭкспрессПроверки() Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ЗапускиЭкспрессПроверки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.ДатаПоследнегоЗапуска = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьДатуПоследнегоЗапускаОтчетаЭкспрессПроверки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(МАКСИМУМ(ЗапускиЭкспрессПроверки.ДатаПоследнегоЗапуска), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнегоЗапуска
	|ИЗ
	|	РегистрСведений.ЗапускиЭкспрессПроверки КАК ЗапускиЭкспрессПроверки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаПоследнегоЗапуска;
	КонецЕсли;
	
	Возврат Дата(1,1,1);	
	
КонецФункции

Функция ПолучитьНастройкуОформленияЗаказов() Экспорт
	
	НастройкаОформленияЗаказовПокупателей = Константы.ОформлениеЗаказовПокупателей.Получить().Получить();
	Если НЕ НастройкаОформленияЗаказовПокупателей = Неопределено 
		И ТипЗнч(НастройкаОформленияЗаказовПокупателей) = Тип("Структура") Тогда
		Возврат НастройкаОформленияЗаказовПокупателей;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьНастройкиОформленияЗаказов(ОформлениеЗаказовПокупателей = Неопределено) Экспорт
	
	// цвета умолчанию по заказам покупателей
	РезультатЗП = Новый Массив;
	РезультатЗП.Добавить(Новый Структура("Настройка, Цвет, Подсказка, Использовать", "Новый", WebЦвета.Золотой, "Заказы в статусе ""Новый""", Истина));			
	РезультатЗП.Добавить(Новый Структура("Настройка, Цвет, Подсказка, Использовать", "Выполнен", Новый Цвет(150,150,150), "Заказы в статусе ""Выполнен""", Истина));
	РезультатЗП.Добавить(Новый Структура("Настройка, Цвет, Подсказка, Использовать", "Закрыт", Новый Цвет(150,150,150), "Заказы в статусе ""Закрыт""", Истина));
	//#12778 не используется
	//РезультатЗП.Добавить(Новый Структура("Настройка, Цвет, Подсказка, Использовать", "КОтгрузке", WebЦвета.БледноЗеленый, "Заказы в статусе ""В работе"", готовые к отгрузке", Истина));
	РезультатЗП.Добавить(Новый Структура("Настройка, Цвет, Подсказка, Использовать", "ОжидаетОтгрузку", WebЦвета.Оранжевый, "Заказы, ожидающие отгрузку", Истина));
	РезультатЗП.Добавить(Новый Структура("Настройка, Цвет, Подсказка, Использовать", "ПросроченПоОтгрузке", WebЦвета.Красный, "Просроченные заказы", Истина));
	
	// цвета умолчанию по заказам на производство
	РезультатЗНП = Новый Массив;
	РезультатЗНП.Добавить(Новый Структура("Настройка, Цвет, Подсказка, Использовать", "ОжидаетОтгрузку", WebЦвета.Оранжевый, "Заказы, ожидающие отгрузку", Истина));
	РезультатЗНП.Добавить(Новый Структура("Настройка, Цвет, Подсказка, Использовать", "ПросроченПоОтгрузке", WebЦвета.Красный, "Просроченные заказы", Истина));
	
	Результат = Новый Структура("ЗП, ЗНП", РезультатЗП, РезультатЗНП);
	
	// переопределяем цвета по умолчанию цветами из настроек, если они там имеются
	Если НЕ ОформлениеЗаказовПокупателей = Неопределено Тогда
		
		Для каждого ЭлементМассива из ОформлениеЗаказовПокупателей.ЗП Цикл
			Настройка = ЭлементМассива.Настройка; 
			Для каждого ЭлементМассиваПоУмолчанию из РезультатЗП Цикл
				Если ЭлементМассиваПоУмолчанию.Настройка = Настройка Тогда
					ЗаполнитьЗначенияСвойств(ЭлементМассиваПоУмолчанию, ЭлементМассива);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;	
		
		Для каждого ЭлементМассива из ОформлениеЗаказовПокупателей.ЗНП Цикл
			Настройка = ЭлементМассива.Настройка; 
			Для каждого ЭлементМассиваПоУмолчанию из РезультатЗНП Цикл
				Если ЭлементМассиваПоУмолчанию.Настройка = Настройка Тогда
					ЗаполнитьЗначенияСвойств(ЭлементМассиваПоУмолчанию, ЭлементМассива);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//#6985
Функция ПолучитьНастройкуОформленияГрафикаМонтажей() Экспорт
	
	НастройкаОформленияГрафикаМонтажей = Константы.ОформлениеГрафикаМонтажей.Получить().Получить();
	Если НЕ НастройкаОформленияГрафикаМонтажей = Неопределено 
		И ТипЗнч(НастройкаОформленияГрафикаМонтажей) = Тип("Структура") Тогда
		Возврат НастройкаОформленияГрафикаМонтажей;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//#6985
Функция ПолучитьНастройкиОформленияГрафикаМонтажей(ОформлениеГрафикаМонтажей = Неопределено) Экспорт
	
	// цвета умолчанию 
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "Невыходы", 				WebЦвета.ТемноСерый, 	"Невыходы"));			
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "МонтажВыполнен", 			WebЦвета.СветлоЗеленый, "Монтаж с видом ""Монтаж"" выполнен/закрыт"));
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "РекламацияВыполнен", 		WebЦвета.СветлоЗеленый, "Монтаж с видом ""Рекламация"" выполнен/закрыт"));
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "СервисВыполнен", 			WebЦвета.СветлоЗеленый, "Монтаж с видом ""Сервисная заявка"" выполнен/закрыт"));
	//#8154 закомментировано
	//Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "ВиртуальнаяБригада", 		WebЦвета.СветлоНебесноГолубой, "В настройках бригады установлена галка ""Не проверять пересечение монтажей в графике"""));
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "МонтажПредстоящий", 		WebЦвета.Золотой, "Предстоящий монтаж с видом ""Монтаж"""));
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "РекламацияПредстоящий", 	WebЦвета.Золотой, "Предстоящий монтаж с видом ""Рекламация"""));
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "СервисПредстоящий", 		WebЦвета.Золотой, "Предстоящий монтаж с видом ""Сервисная заявка"""));
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "МонтажПросрочен", 		WebЦвета.Коралловый, "Просроченный монтаж с видом ""Монтаж"""));
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "РекламацияПросрочен", 	WebЦвета.Коралловый, "Просроченный монтаж с видом ""Рекламация"""));
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "СервисПросрочен", 		WebЦвета.Коралловый, "Просроченный монтаж с видом ""Сервисная заявка"""));
	
	// переопределяем цвета по умолчанию цветами из настроек, если они там имеются
	Если НЕ ОформлениеГрафикаМонтажей = Неопределено Тогда
		
		Для каждого ЭлементМассива из ОформлениеГрафикаМонтажей.ГМ Цикл
			Настройка = ЭлементМассива.Настройка; 
			Для каждого ЭлементМассиваПоУмолчанию из Результат Цикл
				Если ЭлементМассиваПоУмолчанию.Настройка = Настройка Тогда
					ЗаполнитьЗначенияСвойств(ЭлементМассиваПоУмолчанию, ЭлементМассива);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый Структура("ГМ", Результат);
	
КонецФункции

//#6985
Процедура ЗаполнитьГруппуГрафикОформление(Форма, НастройкиОформленияГрафикаМонтажей, ЭлементГруппа) Экспорт
	
	Сч = 0; // №11843 элементы выводим в колонки по 4 шт
	НомерГруппы = 0;
	
	Для Каждого НастройкаЦвета Из НастройкиОформленияГрафикаМонтажей.ГМ Цикл
		
		Если Сч = 0 Тогда
			
			ГруппаРодитель = Форма.Элементы.Добавить("ГруппаГрафикОформление" + НомерГруппы, Тип("ГруппаФормы"), ЭлементГруппа);
			ГруппаРодитель.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРодитель.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаРодитель.ОтображатьЗаголовок = Ложь;
			ГруппаРодитель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НомерГруппы = НомерГруппы + 1;
			
		КонецЕсли;
		
		ИмяНастройки = НастройкаЦвета.Настройка;		
		
		Группа = Форма.Элементы.Добавить("ГруппаГрафикОформление" + ИмяНастройки, Тип("ГруппаФормы"), ГруппаРодитель);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
		Элемент = Форма.Элементы.Добавить("ДекорацияЦвет" + ИмяНастройки, Тип("ДекорацияФормы"), Группа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = "";
		Элемент.Ширина = 2;
		Элемент.Высота = 1;
		Элемент.ЦветФона = НастройкаЦвета.Цвет;
		
		Элемент = Форма.Элементы.Добавить("ДекорацияНадпись" + ИмяНастройки, Тип("ДекорацияФормы"), Группа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = НастройкаЦвета.Подсказка;
		Элемент.АвтоМаксимальнаяШирина = Ложь;
		
		Сч = Сч + 1;
		
		Если Сч = 4 Тогда
			Сч = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//#11453
Функция ПолучитьНастройкуОформленияГрафикаЗамеров() Экспорт
	
	НастройкаОформленияГрафикаЗамеров = Константы.ОформлениеГрафикаЗамеров.Получить().Получить();
	Если НЕ НастройкаОформленияГрафикаЗамеров = Неопределено 
		И ТипЗнч(НастройкаОформленияГрафикаЗамеров) = Тип("Структура") Тогда
		Возврат НастройкаОформленияГрафикаЗамеров;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//#11453
Функция ПолучитьНастройкиОформленияГрафикаЗамеров(ОформлениеГрафикаЗамеров = Неопределено) Экспорт
	
	// цвета умолчанию 
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "Невыходы", 				WebЦвета.СветлоГрифельноСерый, 	"Невыходы по графику работы"));
	
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "ЗамерТекущий", 			WebЦвета.Желтый, "Текущий замер на форме лида"));	
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "ЗамерПредстоящий", 		WebЦвета.Золотой, "Предстоящий замер"));
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "ЗамерЗаключенДоговор", 	WebЦвета.СветлоЗеленый, "На замере заключен договор"));	
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "ЗамерДоговорНеЗаключен", 	WebЦвета.ТемноСерый, "На замере не заключен договор"));
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "ЗамерПросрочен", 			WebЦвета.Красный, "Просроченный замер")); //WebЦвета.Коралловый,
	
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "ВыездТекущий", 			WebЦвета.Желтый, "Текущий выезд на форме лида"));
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "ВыездПредстоящий", 		WebЦвета.Золотой, "Предстоящий выезд")); // WebЦвета.СветлоНебесноГолубой,
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "ВыездВыполнен", 			WebЦвета.СветлоЗеленый, "Выполненный выезд")); // WebЦвета.ЦветМорскойВолныНейтральный
	Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", "ВыездПросрочен", 			WebЦвета.Красный, "Просроченный выезд")); //WebЦвета.Коралловый,
	
	// переопределяем цвета по умолчанию цветами из настроек, если они там имеются
	Если НЕ ОформлениеГрафикаЗамеров = Неопределено Тогда
		
		Для каждого ЭлементМассива из ОформлениеГрафикаЗамеров.ГЗ Цикл
			Настройка = ЭлементМассива.Настройка; 
			Для каждого ЭлементМассиваПоУмолчанию из Результат Цикл
				Если ЭлементМассиваПоУмолчанию.Настройка = Настройка Тогда
					ЗаполнитьЗначенияСвойств(ЭлементМассиваПоУмолчанию, ЭлементМассива);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый Структура("ГЗ", Результат);
	
КонецФункции

//#11453
Процедура ЗаполнитьГруппуГрафикЗамеровОформление(Форма, НастройкиОформленияГрафикаМонтажей, ЭлементГруппаЗамеры, ЭлементГруппаВыезды) Экспорт
	
	ВыводитьТекущие = (Форма.ИмяФормы = "Документ.Лид.Форма.Форма"); //Отчет.ГрафикЗамеров.Форма.ФормаОтчета
	
	Для каждого НастройкаЦвета из НастройкиОформленияГрафикаМонтажей.ГЗ Цикл
		//НастройкаЦвета = Структура("Настройка, Цвет, Подсказка"
		
		ИмяНастройки = НастройкаЦвета.Настройка;
		
		Текущий = Прав(ИмяНастройки, 7) = "Текущий";
		Если НЕ ВыводитьТекущие И Текущий Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементГруппа = ?(Лев(ИмяНастройки, 5) = "Замер", ЭлементГруппаЗамеры, ЭлементГруппаВыезды);
		
		Группа = Форма.Элементы.Добавить("ГруппаГрафикОформление" + ИмяНастройки, Тип("ГруппаФормы"), ЭлементГруппа);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
		Элемент = Форма.Элементы.Добавить("ДекорацияЦвет" + ИмяНастройки, Тип("ДекорацияФормы"), Группа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = "";
		Элемент.Ширина = 2;
		Элемент.Высота = 1;
		Элемент.ЦветФона = НастройкаЦвета.Цвет;
		Если Текущий Тогда
			Элемент.ЦветРамки = WebЦвета.Черный;	
		КонецЕсли;
		
		Элемент = Форма.Элементы.Добавить("ДекорацияНадпись" + ИмяНастройки, Тип("ДекорацияФормы"), Группа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = НастройкаЦвета.Подсказка;
		Элемент.АвтоМаксимальнаяШирина = Ложь;
	КонецЦикла;
	
КонецПроцедуры

//ДокументСсылка - Заказ-договор или Монтаж
//
Функция ПодготовитьСписокТоваровДляВыбораПользователемКПроизводствуИзРозницы(ДокументСсылка) Экспорт
	
	НастройкаИнтеркампани = ОбщийМодуль.ПолучитьНастройкуИнтеркампани(ДокументСсылка.ТочкаПродаж, ДокументСсылка.Подразделение, ДокументСсылка.Организация);
	
	СписокТоваров = Новый Массив;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	РегистрыНакопления.ОбеспечениеЗаказовРозницы.ПолучитьОстаткиКОбеспечению(МенеджерВТ, ДокументСсылка, , Константы.УчетОбеспеченностиРозницыПоКомнатам.Получить());
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.НомерСтроки КАК НомерСтроки,
	|	ВТ_Товары.Комната КАК Комната,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Товары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Товары.Коэффициент КАК Коэффициент,
	|	ВТ_Товары.Количество КАК Количество,
	|	ВТ_Товары.Назначение КАК Назначение,
	|	ВТ_Товары.НомерПотолка КАК НомерПотолка,
	//|	ВТ_Товары.Цена КАК Цена,
	//|	ВТ_Товары.Сумма КАК Сумма,
	//|	ВТ_Товары.ПроцентСкидки КАК ПроцентСкидки,
	//|	ВТ_Товары.СуммаСкидки КАК СуммаСкидки,
	|	ВТ_Товары.КоличествоКОбеспечению КАК КоличествоКОбеспечению,
	|	ВТ_Товары.ОбеспеченоПроизводством КАК ОбеспеченоПроизводством
	|ИЗ
	|	ВТ_ТоварыКОбеспечению КАК ВТ_Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Материалы.НомерСтроки КАК НомерСтроки,
	|	ВТ_Материалы.Комната КАК Комната,
	|	ВТ_Материалы.Номенклатура КАК Номенклатура,
	|	ВТ_Материалы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Материалы.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_Материалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Материалы.Коэффициент КАК Коэффициент,
	|	ВТ_Материалы.Количество КАК Количество,
	|	ВТ_Материалы.Назначение КАК Назначение,
	|	ВТ_Материалы.КоличествоКОбеспечению КАК КоличествоКОбеспечению,
	|	ВТ_Материалы.ОбеспеченоПроизводством КАК ОбеспеченоПроизводством
	|ИЗ
	|	ВТ_МатериалыКОбеспечению КАК ВТ_Материалы";
	
	РезультатЗапроса 	= Запрос.ВыполнитьПакет();
	ТаблицаТоваров 		= РезультатЗапроса[0].Выгрузить();
	ТаблицаМатериалов 	= РезультатЗапроса[1].Выгрузить();
	
	Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		
		//#12535
		Если ТекущаяСтрока.КоличествоКОбеспечению <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Добавлять = Ложь;		
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			Добавлять = Истина;
		ИначеЕсли НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) И НастройкаИнтеркампани.ЗаказПоставщикуЗаказыватьТовары Тогда 
			Добавлять = Истина;
		КонецЕсли;
		
		//#4686
		Если ТекущаяСтрока.КоличествоКОбеспечению = 0 И ТекущаяСтрока.ОбеспеченоПроизводством = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Добавлять Тогда
			СтруктураТовара = Новый Структура;
			СтруктураТовара.Вставить("Комната", 					ТекущаяСтрока.Комната);
			СтруктураТовара.Вставить("Номенклатура", 				ТекущаяСтрока.Номенклатура);
			СтруктураТовара.Вставить("ХарактеристикаНоменклатуры", 	ТекущаяСтрока.ХарактеристикаНоменклатуры);
			СтруктураТовара.Вставить("ВидНоменклатуры", 			ТекущаяСтрока.ВидНоменклатуры);
			СтруктураТовара.Вставить("Количество", 					ТекущаяСтрока.Количество);
			СтруктураТовара.Вставить("КоличествоКОбеспечению", 		ТекущаяСтрока.КоличествоКОбеспечению);
			СтруктураТовара.Вставить("ЕдиницаИзмерения", 			ТекущаяСтрока.ЕдиницаИзмерения);
			СтруктураТовара.Вставить("НомерСтроки", 				ТекущаяСтрока.НомерСтроки);
			СтруктураТовара.Вставить("НомерПотолка", 				ТекущаяСтрока.НомерПотолка);
			СтруктураТовара.Вставить("Коэффициент", 				ТекущаяСтрока.Коэффициент);
			//СтруктураТовара.Вставить("ПроцентСкидки", 				ТекущаяСтрока.ПроцентСкидки);
			//СтруктураТовара.Вставить("Цена", 						ТекущаяСтрока.Цена);
			//СтруктураТовара.Вставить("СуммаСкидки", 				ТекущаяСтрока.СуммаСкидки);
			//СтруктураТовара.Вставить("Сумма", 						ТекущаяСтрока.Сумма);
			СтруктураТовара.Вставить("Назначение", 					ТекущаяСтрока.Назначение);
			СписокТоваров.Добавить(СтруктураТовара);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НастройкаИнтеркампани.ЗаказПоставщикуЗаказыватьМатериалы Тогда
		Для Каждого ТекущаяСтрока Из ТаблицаМатериалов Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				// строка комнаты
				Продолжить;
			КонецЕсли;
			
			//#4686
			Если ТекущаяСтрока.КоличествоКОбеспечению = 0 И ТекущаяСтрока.ОбеспеченоПроизводством = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Добавлять = Ложь;			
			Если НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда 
				Добавлять = Истина;
			КонецЕсли;
			
			Если Добавлять Тогда
				СтруктураТовара = Новый Структура;
				СтруктураТовара.Вставить("Комната", 					ТекущаяСтрока.Комната);
				СтруктураТовара.Вставить("Номенклатура", 				ТекущаяСтрока.Номенклатура);
				СтруктураТовара.Вставить("ХарактеристикаНоменклатуры", 	ТекущаяСтрока.ХарактеристикаНоменклатуры);
				СтруктураТовара.Вставить("ВидНоменклатуры", 			ТекущаяСтрока.ВидНоменклатуры);
				СтруктураТовара.Вставить("Количество", 					ТекущаяСтрока.Количество);
				СтруктураТовара.Вставить("КоличествоКОбеспечению", 		ТекущаяСтрока.КоличествоКОбеспечению);
				СтруктураТовара.Вставить("ЕдиницаИзмерения", 			ТекущаяСтрока.ЕдиницаИзмерения);
				СтруктураТовара.Вставить("НомерСтроки", 				ТекущаяСтрока.НомерСтроки);
				СтруктураТовара.Вставить("НомерПотолка", 				"");
				СтруктураТовара.Вставить("Коэффициент", 				ТекущаяСтрока.Коэффициент);
				//СтруктураТовара.Вставить("ПроцентСкидки", 				0); 
				//СтруктураТовара.Вставить("Цена", 						0); 
				//СтруктураТовара.Вставить("СуммаСкидки", 				0); 
				//СтруктураТовара.Вставить("Сумма", 						0);
				СтруктураТовара.Вставить("Назначение", 					ТекущаяСтрока.Назначение);
				СписокТоваров.Добавить(СтруктураТовара);
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
	//++16864  Сворачиваем таблицу товаров и материалов по номенклатуре и характеристике
	Если Константы.ИспользоватьИнтеркампани.Получить() И НЕ Константы.УчетОбеспеченностиРозницыПоКомнатам.Получить() Тогда
		Яндекс =0;
		Пока Яндекс<СписокТоваров.Количество() Цикл
			Индекс = Яндекс+1;
			Пока Индекс<СписокТоваров.Количество() Цикл
					Если СписокТоваров[Яндекс].Номенклатура = СписокТоваров[Индекс].Номенклатура И СписокТоваров[Яндекс].ХарактеристикаНоменклатуры = СписокТоваров[Индекс].ХарактеристикаНоменклатуры И СписокТоваров[Яндекс].ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал Тогда
						СписокТоваров[Яндекс].Количество=СписокТоваров[Яндекс].Количество + СписокТоваров[Индекс].Количество;
						СписокТоваров[Яндекс].КоличествоКОбеспечению=СписокТоваров[Яндекс].КоличествоКОбеспечению + СписокТоваров[Индекс].КоличествоКОбеспечению;
						СписокТоваров.Удалить(Индекс);
						Индекс = Индекс-1;	
					КонецЕсли;	
				Индекс = Индекс+1;	
			КонецЦикла;	
			Яндекс = Яндекс+1;
		КонецЦикла;
	КонецЕсли;	
	//--16864
	
	Возврат СписокТоваров;
	
КонецФункции

Функция ПроверитьСписокТоваровКПроизводствуИзРозницы(СписокТоваров, МассивСообщений) Экспорт
	
	Результат = Истина;
	
	//++ #15176
	Для каждого СтрокаТовара из СписокТоваров Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальнойПродукции(СтрокаТовара.Номенклатура) Тогда
			Для каждого СтрокаТовараДубль из СписокТоваров Цикл
				Если СтрокаТовара.Номенклатура = СтрокаТовараДубль.Номенклатура 
					И НЕ СтрокаТовара.НомерСтроки = СтрокаТовараДубль.НомерСтроки Тогда
					МассивСообщений.Добавить(СтрШаблон("Дублируется продукция ""%1"".", СтрокаТовара.Номенклатура));
					Результат = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыЗаказаПоИнтеркампани(НастройкаИнтеркампани, ДополнительныеПараметры = Неопределено) Экспорт
	
	СтруктураРеквизитов = Новый Структура("Дата, Валюта,
	| НастройкаИнтеркампани, ТекущийСтатус, Организация, Подразделение, Склад,
	| Контрагент, ДоговорКонтрагента, ВидЦен, 
	| УчитыватьНДС,
	| ОднаОрганизацияПроизводстваИПродажиПотолков");
	
	СтруктураРеквизитов.НастройкаИнтеркампани = НастройкаИнтеркампани;	
	СтруктураРеквизитов.ТекущийСтатус 		= Справочники.СтатусыЗаказовПокупателей.НачальныйСтатусПоИнтеркампани(НастройкаИнтеркампани);		
	СтруктураРеквизитов.Организация 		= НастройкаИнтеркампани.ОрганизацияПроизводствоПотолков;
	//++ 16340
	Если Константы.ИспользоватьПодразделения.Получить() Тогда
		СтруктураРеквизитов.Подразделение 		= НастройкаИнтеркампани.ПроизводствоПодразделение;
	КонецЕсли;
	//-- 16340
	СтруктураРеквизитов.Склад 				= НастройкаИнтеркампани.ПроизводствоСкладОтгрузкиИзПроизводства;
	СтруктураРеквизитов.Валюта 				= Константы.ВалютаУчета.Получить();
	СтруктураРеквизитов.Дата 				= ТекущаяДатаСеанса();
	СтруктураРеквизитов.УчитыватьНДС 		= УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(СтруктураРеквизитов.Организация);
	
	Если НЕ НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
		СтруктураРеквизитов.Контрагент = НастройкаИнтеркампани.КонтрагентПроизводствоПотолков;
		СтруктураРеквизитов.ДоговорКонтрагента = СтруктураРеквизитов.Контрагент.ОсновнойДоговор;
	Иначе
		//++ №7908 если одна организация продажи и потолков, устанавливаем контрагента по соответствующей настройке
		Если НастройкаИнтеркампани.УказыватьКонтрагентаРозницыВЗаказахНаПроизводство Тогда
			СтруктураРеквизитов.Контрагент = НастройкаИнтеркампани.КонтрагентРозничныеПродажи;
			СтруктураРеквизитов.ДоговорКонтрагента = СтруктураРеквизитов.Контрагент.ОсновнойДоговор;
		Иначе
			//-- №7908
			СтруктураРеквизитов.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			СтруктураРеквизитов.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
		СтруктураРеквизитов.ВидЦен = НастройкаИнтеркампани.ПроизводствоВидЦенТовары;
	Иначе
		СтруктураРеквизитов.ВидЦен = Справочники.ВидыЦен.ПустаяСсылка();
	КонецЕсли;
	
	СтруктураРеквизитов.ОднаОрганизацияПроизводстваИПродажиПотолков = НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков;
	
	Если НЕ ДополнительныеПараметры = Неопределено Тогда
		Для каждого ЭлементСтруктуры из ДополнительныеПараметры Цикл
			СтруктураРеквизитов.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);	
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

// Подготовка / заполнение таблицы товаров и материалов
// НастройкаИнтеркампани - настройка, по которой создается Заказ покупателя из документа розницы
// МассивПотолков - массив потолков к заказу
// СоответствиеНомеровИПотолков - для получения потолка по номеру расчета
// РеквизитыШапки - реквзиты заказ покупателя (Дата, Валюта, Организация и прочее)
// ПозицииКЗаказу - выбранные строки к заказу: табличная часть или массив строк (найденный через НайтиСтроки)
// ТаблицаТоваров - табличная часть Заказа покупателя или Таблица значений с соответствующими колонками
// ТаблицаМатериалов - табличная часть Заказа покупателя
Функция ПодготовитьТаблицыЗаказаПоИнтеркампани(НастройкаИнтеркампани,
	МассивПотолков, СоответствиеНомеровИПотолков,
	РеквизитыШапки, ПозицииКЗаказу, ТаблицаТоваров, ТаблицаМатериалов=Неопределено, ВозвратПриОшибке = Ложь) Экспорт
	// ВозвратПриОшибке - параметр добавлен в рамках заявки #7909
	
	Для Каждого ТекущаяСтрока Из ПозицииКЗаказу Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			//потолок
			ОписаниеОшибки = "";
			СтруктураПотолка = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(ТекущаяСтрока.Номенклатура,,,,,,, ОписаниеОшибки);
			Если СтруктураПотолка = Неопределено Тогда
				Если ВозвратПриОшибке Тогда
					Возврат Ложь;
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				Сообщить(ОписаниеОшибки);
				Если ВозвратПриОшибке Тогда
					Возврат Ложь;
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			ДанныеЗаказа = ОбменСEasyCeiling.СтруктураДанныхЗаказа(РеквизитыШапки.Организация, РеквизитыШапки.Подразделение, НастройкаИнтеркампани,
											РеквизитыШапки.ВидЦен, РеквизитыШапки.Валюта, РеквизитыШапки.Дата, 
											РеквизитыШапки.УчитыватьНДС, , РеквизитыШапки.ДоговорКонтрагента);
			СтруктураЗаказа = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураПотолка, Перечисления.ВидыЗаказов.ЗаказПокупателя, ДанныеЗаказа);				
			//СтруктураЗаказа = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураПотолка, НастройкаИнтеркампани, РеквизитыШапки.ВидЦен, 
			//										РеквизитыШапки.Валюта, РеквизитыШапки.Дата, 
			//										Перечисления.ВидыЗаказов.ЗаказПокупателя, 
			//										РеквизитыШапки.УчитыватьНДС, , РеквизитыШапки.ДоговорКонтрагента);
			
			НоваяСтрока = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			УИСПродукция = Новый УникальныйИдентификатор;
			НоваяСтрока.УИСтроки = УИСПродукция;
			НоваяСтрока.УИСтрокиРодителя = УИСПродукция;
			Если РеквизитыШапки.Свойство("АдресМонтажа") Тогда
				НоваяСтрока.АдресМонтажа = РеквизитыШапки.АдресМонтажа;
			КонецЕсли;
			НоваяСтрока.КоличествоКВыработке = СтруктураЗаказа.КоличествоВыработка;
			
			//#4679
			Если ПолучитьФункциональнуюОпцию("КоличествоТоваровКСписаниюВРозницеНеСоответствуетКоличествуПроданногоТовара") Тогда
				НоваяСтрока.Количество = НоваяСтрока.Номенклатура.Потолок_КоличествоПродукция;
				НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
			КонецЕсли;
			
			НоваяСтрока.Сумма = СтруктураЗаказа.Сумма;
			СуммаБезСкидки = НоваяСтрока.Сумма;						
			
			НоваяСтрока.Сумма = СуммаБезСкидки - НоваяСтрока.СуммаРучнойСкидки;
			Если НЕ НоваяСтрока.Количество = 0 Тогда
				НоваяСтрока.Цена = СуммаБезСкидки / НоваяСтрока.Количество;
			КонецЕсли;
			
			//услуги раскроя
			Для Каждого ТекУслуга Из СтруктураЗаказа.Услуги Цикл
				Если ТекУслуга.ЭтоУслугаРаскроя Тогда							
					//#5466
					//ДанныеСтроки = Новый Структура("Потолок,ЗагруженоИзПостроителя,Комната,Назначение,УИСтроки,УИСтрокиРодителя",
					//СтруктураЗаказа.ПродукцияНоменклатура, Истина, ТекущаяСтрока.Комната, ТекущаяСтрока.Назначение, новый УникальныйИдентификатор, УИСПродукция);
					ДанныеСтроки = Новый Структура("Потолок,ЗагруженоИзПостроителя,Комната,Назначение,УИСтроки,УИСтрокиРодителя,ЭтоУслугаРаскроя,УслугаРаскроя",
					СтруктураЗаказа.ПродукцияНоменклатура, Истина, ТекущаяСтрока.Комната, ТекущаяСтрока.Назначение, новый УникальныйИдентификатор, УИСПродукция,Истина,ТекУслуга.УслугаРаскроя);								
					НоваяСтрокаТовары = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьСтрокуВТЧЗаказПокупателя(ТаблицаТоваров, ТекУслуга, ДанныеСтроки);
				КонецЕсли;
			КонецЦикла;
			
			//товары
			Для Каждого ТекУслуга Из СтруктураЗаказа.Товары Цикл
				Если ТекУслуга.ЭтоУслугаРаскроя Тогда							
					//#5466
					//ДанныеСтроки = Новый Структура("Потолок,ЗагруженоИзПостроителя,Комната,Назначение,УИСтроки,УИСтрокиРодителя",
					//СтруктураЗаказа.ПродукцияНоменклатура, Истина, ТекущаяСтрока.Комната, ТекущаяСтрока.Назначение, Новый УникальныйИдентификатор, УИСПродукция);
					ДанныеСтроки = Новый Структура("Потолок,ЗагруженоИзПостроителя,Комната,Назначение,УИСтроки,УИСтрокиРодителя,ЭтоУслугаРаскроя,УслугаРаскроя",
					СтруктураЗаказа.ПродукцияНоменклатура, Истина, ТекущаяСтрока.Комната, ТекущаяСтрока.Назначение, новый УникальныйИдентификатор, УИСПродукция,Истина,ТекУслуга.УслугаРаскроя);
					НоваяСтрокаТЧ = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьСтрокуВТЧЗаказПокупателя(ТаблицаТоваров, ТекУслуга, ДанныеСтроки);												
				КонецЕсли;
			КонецЦикла;				
			
			//прочие товары и услуги (не услуги раскроя), в частности по расширенным правилам
			Для Каждого ТекУслуга Из СтруктураЗаказа.Товары Цикл
				Если НЕ ТекУслуга.ЭтоУслугаРаскроя Тогда
					ДанныеСтроки = Новый Структура("Потолок,ЗагруженоИзПостроителя,Комната,Назначение,УИСтроки,УИСтрокиРодителя",
					СтруктураЗаказа.ПродукцияНоменклатура, Истина, ТекущаяСтрока.Комната, ТекущаяСтрока.Назначение, Новый УникальныйИдентификатор, УИСПродукция);								
					НоваяСтрокаТЧ = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьСтрокуВТЧЗаказПокупателя(ТаблицаТоваров, ТекУслуга, ДанныеСтроки);
					
				КонецЕсли;
			КонецЦикла;
			Для Каждого ТекУслуга Из СтруктураЗаказа.Услуги Цикл
				Если НЕ ТекУслуга.ЭтоУслугаРаскроя Тогда
					ДанныеСтроки = Новый Структура("Потолок,ЗагруженоИзПостроителя,Комната,Назначение,УИСтроки,УИСтрокиРодителя",
					СтруктураЗаказа.ПродукцияНоменклатура, Истина, ТекущаяСтрока.Комната, ТекущаяСтрока.Назначение, Новый УникальныйИдентификатор, УИСПродукция);								
					НоваяСтрокаТЧ = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьСтрокуВТЧЗаказПокупателя(ТаблицаТоваров, ТекУслуга, ДанныеСтроки);
					
				КонецЕсли;
			КонецЦикла;
			
			// добавлено 2019-01-21
			Если НЕ ТаблицаМатериалов=Неопределено Тогда
				Для Каждого ТекущаяСтрока Из СтруктураЗаказа.Материалы Цикл
					ДопДанныеСтроки = Новый Структура("Потолок,ЗагруженоИзПостроителя,УИСтроки", СтруктураЗаказа.ПродукцияНоменклатура, Истина, УИСПродукция);								
					НоваяСтрокаТЧ = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьСтрокуВТЧЗаказПокупателя(ТаблицаМатериалов, ТекущаяСтрока, ДопДанныеСтроки);
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			//товар или услуга
			НоваяСтрока = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			НоваяСтрока.Цена = РегистрыСведений.ЦеныНоменклатуры.ПолучитьЦенуНоменклатуры(НоваяСтрока.Номенклатура, НоваяСтрока.ХарактеристикаНоменклатуры, 
										НоваяСтрока.ЕдиницаИзмерения, 
										РеквизитыШапки.Дата, РеквизитыШапки.ВидЦен, РеквизитыШапки.Валюта, 
										РеквизитыШапки.Контрагент, РеквизитыШапки.ДоговорКонтрагента);
			
			СуммаБезСкидки = НоваяСтрока.Цена * НоваяСтрока.Количество;												
			Если НЕ РеквизитыШапки.ДоговорКонтрагента.СкидкаНаТовары = 0 Тогда
				НоваяСтрока.ПроцентРучнойСкидки = РеквизитыШапки.ДоговорКонтрагента.СкидкаНаТовары;
				НоваяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * НоваяСтрока.ПроцентРучнойСкидки / 100; 
			Иначе
				НоваяСтрока.ПроцентРучнойСкидки = 0;
				НоваяСтрока.СуммаРучнойСкидки = 0; 														
			КонецЕсли;	
			НоваяСтрока.Сумма = СуммаБезСкидки - НоваяСтрока.СуммаРучнойСкидки;
			
			Если РеквизитыШапки.Свойство("АдресМонтажа") Тогда
				НоваяСтрока.АдресМонтажа = РеквизитыШапки.АдресМонтажа;
			КонецЕсли;
			НоваяСтрока.УИСтроки = Новый УникальныйИдентификатор;
			НоваяСтрока.Спецификация = ОбщийМодульВызовСервера.ПолучитьОсновнуюСпецификациюНоменклатуры(НоваяСтрока.Номенклатура, Перечисления.ВидыСпецификации.СпецификацияПродукции);
			
			ПолучитьПотолок = СоответствиеНомеровИПотолков.Получить(ТекущаяСтрока.НомерПотолка);
			ПолучитьПотолок = Неопределено; // №11099 к потолку привязываем только его производственные услуги (выше где формируется потолок)
			
			Если НЕ ПолучитьПотолок = Неопределено Тогда
				НоваяСтрока.Потолок = ПолучитьПотолок;
				//НоваяСтрока.УИСтрокиРодителя = ; //потолка еще может не быть, УИС проставим ниже
			Иначе
				НоваяСтрока.УИСтрокиРодителя = НоваяСтрока.УИСтроки;
			КонецЕсли;
			
			//++ №12667 по конструкции добавляем материалы
			Если НЕ ТаблицаМатериалов = Неопределено
				И Справочники.ВидыНоменклатуры.ЭтоНоменклатураПродукция(НоваяСтрока.Номенклатура)
				И ЗначениеЗаполнено(НоваяСтрока.Спецификация)
				Тогда
				
				Для Каждого СтрокаСпецификации Из НоваяСтрока.Спецификация.Состав Цикл
					
					ДопДанныеСтроки = Новый Структура("Потолок, УИСтроки", НоваяСтрока.Номенклатура, НоваяСтрока.УИСтроки);								
					НоваяСтрокаТЧ = ОбработкаТабличныхЧастейСервер.ДобавитьОбновитьСтрокуВТЧЗаказПокупателя(ТаблицаМатериалов, СтрокаСпецификации, ДопДанныеСтроки);
					
					КоэффициентИзменения = ?(СтрокаСпецификации.ФиксированноеКоличество, 1, НоваяСтрока.Количество * НоваяСтрока.Коэффициент);
					КоличествоКДобавлению = ОбщийМодуль.ОкруглитьЧисло(КоэффициентИзменения * СтрокаСпецификации.Количество, СтрокаСпецификации.ПорядокОкругленияЧислом, СтрокаСпецификации.ОкруглятьВБольшуюСторону); 
					
					НоваяСтрокаТЧ.Количество = КоличествоКДобавлению;
					НоваяСтрокаТЧ.КоличествоКВыработке = КоличествоКДобавлению;
					
				КонецЦикла;
				
			КонецЕсли;
			//-- №12667
			
		КонецЕсли;
		
	КонецЦикла; //заполняем табличную часть
	
	// округляем 
	ПорядокОкругления = Константы.ПорядокОкругленияЧисломСтоимостиПотолков.Получить();
	//ТребуетсяОкругление = (ПорядокОкругления > 0);
	ТребуетсяОкругление = Константы.ОкруглятьСтоимостьПотолка.Получить() И (ПорядокОкругления > 0);
	Если ТребуетсяОкругление Тогда
		
		ОкруглятьВБольшуюСторону = Константы.ОкруглятьВБольшуюСторонуСтоимостьПотолков.Получить();
		СпособОкругления = Константы.СпособОкругленияСтоимостиПотолков.Получить();
		ВариантОкругления = Константы.СпособОкругленияСтоимостиПотолков.Получить();
		ТребуетсяОкруглениеСоставляющих = (СпособОкругления = 1);
		ТребуетсяОкруглениеПотолка      = (СпособОкругления = 0);
		
		Для каждого ЭлементПотолок из МассивПотолков Цикл
			Если ТребуетсяОкруглениеСоставляющих Тогда
				Для каждого СтрокаТЧ из ТаблицаТоваров Цикл
					Если СтрокаТЧ.Номенклатура = ЭлементПотолок ИЛИ СтрокаТЧ.Потолок = ЭлементПотолок Тогда
						ОбработкаТабличныхЧастейСервер.ОкруглитьСтрокуТЧ(СтрокаТЧ, ПорядокОкругления, ОкруглятьВБольшуюСторону, ВариантОкругления);
					КонецЕсли;
					
				КонецЦикла;
			ИначеЕсли ТребуетсяОкруглениеПотолка Тогда	
				
				ИтоговаяСуммаПотолка = 0;
				Для каждого СтрокаТЧ из ТаблицаТоваров Цикл
					Если СтрокаТЧ.Номенклатура = ЭлементПотолок ИЛИ СтрокаТЧ.Потолок = ЭлементПотолок Тогда
						ИтоговаяСуммаПотолка = ИтоговаяСуммаПотолка + СтрокаТЧ.Сумма;
					КонецЕсли;
				КонецЦикла;
				ОкругленнаяИтоговаяСуммаПотолка = ОбщийМодуль.ОкруглитьЧисло(ИтоговаяСуммаПотолка, ПорядокОкругления, ОкруглятьВБольшуюСторону);
				НайденнаяСтрокаПотолка = ТаблицаТоваров.НайтиСтроки(Новый Структура("Номенклатура", ЭлементПотолок));
				Если НайденнаяСтрокаПотолка.Количество() > 0  Тогда
					НайденнаяСтрокаПотолка[0].Сумма = НайденнаяСтрокаПотолка[0].Сумма - (ИтоговаяСуммаПотолка - ОкругленнаяИтоговаяСуммаПотолка); 
					
					Если ВариантОкругления = 0 Тогда
						//изменять цену после округления
						Если НЕ НайденнаяСтрокаПотолка[0].Количество = 0 Тогда
							СуммаБезСкидки = НайденнаяСтрокаПотолка[0].Сумма + НайденнаяСтрокаПотолка[0].СуммаРучнойСкидки;
							НайденнаяСтрокаПотолка[0].Цена = Окр(СуммаБезСкидки / НайденнаяСтрокаПотолка[0].Количество, 2);
						КонецЕсли;
					Иначе
						//изменять сумму ручной скидки
						НайденнаяСтрокаПотолка[0].СуммаСкидки = НайденнаяСтрокаПотолка[0].СуммаСкидки + (ИтоговаяСуммаПотолка - ОкругленнаяИтоговаяСуммаПотолка);
						ОбработкаТабличныхЧастейСервер.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(НайденнаяСтрокаПотолка[0]);					
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПустаяТаблицаКЗаказу()
	
	ТаблицаКЗаказу = Новый ТаблицаЗначений;
	ТаблицаКЗаказу.Колонки.Добавить("Комната", Новый ОписаниеТипов("строка"));
	ТаблицаКЗаказу.Колонки.Добавить("Номенклатура");
	ТаблицаКЗаказу.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаКЗаказу.Колонки.Добавить("Количество");
	ТаблицаКЗаказу.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаКЗаказу.Колонки.Добавить("НомерСтроки");
	ТаблицаКЗаказу.Колонки.Добавить("ВидНоменклатуры");
	ТаблицаКЗаказу.Колонки.Добавить("НомерПотолка");
	ТаблицаКЗаказу.Колонки.Добавить("ЗаказПокупателяНаПроизводство");
	ТаблицаКЗаказу.Колонки.Добавить("Коэффициент");
	ТаблицаКЗаказу.Колонки.Добавить("Назначение", новый ОписаниеТипов("Строка",, новый КвалификаторыСтроки(25)));
	
	ТаблицаКЗаказу.Колонки.Добавить("ПроцентРучнойСкидки", Новый ОписаниеТипов("Число"));
	ТаблицаКЗаказу.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаКЗаказу.Колонки.Добавить("СуммаРучнойСкидки", Новый ОписаниеТипов("Число"));
	ТаблицаКЗаказу.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаКЗаказу;
	
КонецФункции

Функция СоздатьЗаказыПокупателейНаПроизводствоИзРозницы(ДокументСсылка, МассивНоменклатуры, НастройкаИнтеркампани, СтруктураДанных) Экспорт
	
	ТаблицаКЗаказу = ПустаяТаблицаКЗаказу();
	
	Для каждого ЭлементМассива из МассивНоменклатуры Цикл				
		НоваяСтрока = ТаблицаКЗаказу.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива, 
		"НомерСтроки, Комната, Номенклатура, ХарактеристикаНоменклатуры, 
		| Количество, ЕдиницаИзмерения, НомерПотолка, Коэффициент, 
		//| ПроцентСкидки, СуммаСкидки, Цена, Сумма, 
		| Назначение");
		
		НоваяСтрока.ВидНоменклатуры = НоваяСтрока.Номенклатура.ВидНоменклатуры;
		Если НоваяСтрока.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ТиповойОтрез
			ИЛИ НоваяСтрока.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок Тогда
			СоздаватьЗаказыНаЕдиничноеПроизводство = Истина;
		ИначеЕсли НоваяСтрока.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал
			ИЛИ НоваяСтрока.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
			СоздаватьЗаказыНаТиповоеПроизводство = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПотолокПоНомеруРасчета = Новый Соответствие;
	ЗаказПоНомеруРасчета   = Новый Соответствие;
	МассивПотолков = Новый Массив;
	Для Каждого ТекущаяСтрока Из ТаблицаКЗаказу Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			ПотолокПоНомеруРасчета.Вставить(ТекущаяСтрока.НомерПотолка, ТекущаяСтрока.Номенклатура);						
			МассивПотолков.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	// получим заказы покупателя (на производство по потолкам)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивПотолков", МассивПотолков);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоПотолкам.ЗаказНаПроизводство КАК ЗаказПокупателяНаПроизводство,
	|	ЗаказыПоПотолкам.Номенклатура КАК Номенклатура,
	|	ЗаказыПоПотолкам.Номенклатура.Потолок_НомерРасчета КАК НомерПотолка
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(
	|			,
	|			,
	|			,
	|			ТИПЗНАЧЕНИЯ(ЗаказНаПроизводство) = ТИП(Документ.ЗаказПокупателя)
	|				И номенклатура В (&МассивПотолков)) КАК ЗаказыПоПотолкам";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаказПоНомеруРасчета.Вставить(Выборка.НомерПотолка, Выборка.ЗаказПокупателяНаПроизводство);
	КонецЦикла;
	
	Для каждого СтрокаЗаказа из ТаблицаКЗаказу Цикл
		СтрокаЗаказа.ЗаказПокупателяНаПроизводство = ЗаказПоНомеруРасчета.Получить(СтрокаЗаказа.НомерПотолка);
	КонецЦикла;
	
	ТаблицаЗаказов = ТаблицаКЗаказу.Скопировать();
	ТаблицаЗаказов.Свернуть("ЗаказПокупателяНаПроизводство");
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("СозданоНовых",0);
	СтруктураРезультата.Вставить("Обновлено",0);
	
	СсылкаНаНовыйЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();
	
	Для Каждого ТекущийЗаказ Из ТаблицаЗаказов Цикл
		
		//определяем - создаватьдокумент или перезаполнять существующий
		СоздатьЗаказ = Ложь;
		Если НЕ ТекущийЗаказ.ЗаказПокупателяНаПроизводство = Неопределено Тогда
			Если ТекущийЗаказ.ЗаказПокупателяНаПроизводство.Пустая() Тогда
				СоздатьЗаказ = Истина;
			КонецЕсли;
		Иначе
			СоздатьЗаказ = Истина;
		КонецЕсли;
		Если НЕ СоздатьЗаказ Тогда
			ЗаказПокупателя = ТекущийЗаказ.ЗаказПокупателяНаПроизводство.ПолучитьОбъект();
		Иначе
			ЗаказПокупателя = Документы.ЗаказПокупателя.СоздатьДокумент();
			ЗаказПокупателя.Заполнить(Неопределено);
			ЗаказПокупателя.Дата = ТекущаяДатаСеанса();			
		КонецЕсли;
		
		//заполняем шапку
		ОбщийМодуль.ЗаполнитьШапкуДокумента(ЗаказПокупателя);
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("АдресМонтажа", 		ДокументСсылка.Адрес);
		ДопПараметры.Вставить("Основание", 			ДокументСсылка);
		ДопПараметры.Вставить("ЭтоЗаказОтРозницы", 	Истина);
		// №7688 могут создавать на основании монтажа, поэтому номер договора определим по типу документа
		//ДопПараметры.Вставить("НомерРозничногоДоговора", ДокументСсылка.НомерДоговора); // #7381
		НомерДоговора = "";
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			НомерДоговора = ДокументСсылка.НомерДоговора;
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Монтаж") И ТипЗнч(ДокументСсылка.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			НомерДоговора = ДокументСсылка.Основание.НомерДоговора;
		КонецЕсли;
		ДопПараметры.Вставить("НомерРозничногоДоговора", НомерДоговора);
		
		СтруктураШапки = РеквизитыЗаказаПоИнтеркампани(НастройкаИнтеркампани, ДопПараметры);
		ЗаполнитьЗначенияСвойств(ЗаказПокупателя, СтруктураШапки, , "Дата");
		
		// №7908 Теперь из формы, передаются дополнительные параметры в структуре
		ЗаполнитьЗначенияСвойств(ЗаказПокупателя, СтруктураДанных, "ОжидаемаяДатаОтгрузки, ОжидаемоеВремяОтгрузки");
		
		//заполняем табличную часть
		ЗаказПокупателя.Товары.Очистить();
		ПозицииКЗаказу = ТаблицаКЗаказу.НайтиСтроки(Новый Структура("ЗаказПокупателяНаПроизводство", ТекущийЗаказ.ЗаказПокупателяНаПроизводство));
		РезультатПодготовкиТЧ = ПодготовитьТаблицыЗаказаПоИнтеркампани(НастройкаИнтеркампани,
																		МассивПотолков, ПотолокПоНомеруРасчета,
																		СтруктураШапки, ПозицииКЗаказу, 
																		ЗаказПокупателя.Товары, ЗаказПокупателя.Материалы, Истина);
		
		Если НЕ РезультатПодготовкиТЧ Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ЗаказПокупателя.СуммаДокумента = ЗаказПокупателя.Товары.Итог("Сумма");
		
		//заполним номера потолков, если это заказ покупателя
		Если ТипЗнч(ЗаказПокупателя) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
			ТаблицаНомеров = Новый ТаблицаЗначений;
			ТаблицаНомеров.Колонки.Добавить("Номер");
			
			Для Каждого ВерхняяСтрока Из ЗаказПокупателя.Товары Цикл
				НомерПотолка = ВерхняяСтрока.Номенклатура.Потолок_НомерРасчета;
				Если НЕ ПустаяСтрока(НомерПотолка) Тогда
					НоваяСтрока = ТаблицаНомеров.Добавить();
					НоваяСтрока.Номер = НомерПотолка;
				КонецЕсли;
				
				//проставим УИС родителя
				Если ЗначениеЗаполнено(ВерхняяСтрока.Потолок) И ПустаяСтрока(ВерхняяСтрока.УИСтрокиРодителя) Тогда
					НайденныеСтроки = ЗаказПокупателя.Товары.НайтиСтроки(Новый Структура("Номенклатура", ВерхняяСтрока.Потолок));
					Если НайденныеСтроки.Количество() > 0 Тогда
						ВерхняяСтрока.УИСтрокиРодителя = НайденныеСтроки[0].УИСтроки;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			ТаблицаНомеров.Свернуть("Номер");
			ЗаказПокупателя.НомераПотолков = "";
			Ном = 0;
			Для Каждого СтрокаНомер Из ТаблицаНомеров Цикл
				Если Ном > 0 Тогда
					ЗаказПокупателя.НомераПотолков = ЗаказПокупателя.НомераПотолков + "; ";
				КонецЕсли;
				ЗаказПокупателя.НомераПотолков = ЗаказПокупателя.НомераПотолков + СтрокаНомер.Номер;
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
		ЗаказПокупателя.Записать();
		Если НЕ СоздатьЗаказ Тогда
			СтруктураРезультата.Обновлено = СтруктураРезультата.Обновлено + 1;
		Иначе
			СтруктураРезультата.СозданоНовых = СтруктураРезультата.СозданоНовых + 1;
			СсылкаНаНовыйЗаказ = ЗаказПокупателя.Ссылка;
		КонецЕсли;
		Попытка
			ЗаказПокупателя.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести " + ЗаказПокупателя.Ссылка + ". Ошибка: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла; //заказ
	
	Возврат СтруктураРезультата;
	
КонецФункции

Процедура РозницаПриПолученииДанныхНаСервере(Строки, ТипДокумента, КэшКолонок) Экспорт //ИмяЭлемента, Настройки, Строки)
	
	// ПРИ ИЗМЕНЕНИИ ЗАПРОСОВ ИЗМЕНЯТЬ ПРОЦЕДУРУ ОбщийМодульСервер.ЗаказДоговорОсобыйОтборПриИзменении
	//                                           ОбщийМодульСервер.МонтажиОсобыйОтборПриИзменении
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок",Строки.ПолучитьКлючи());
	
	ТекстЗапроса = "";	
	
	Если КэшКолонок.Свойство("ЕстьКолонкаСтатусЗаказаРозницыНаПроизводство") И КэшКолонок.ЕстьКолонкаСтатусЗаказаРозницыНаПроизводство Тогда
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбеспечениеЗаказовРозницыОбороты.Заказ КАК Заказ,
		|	ВЫБОР
		|		КОГДА ОбеспечениеЗаказовРозницыОбороты.Регистратор.ТекущийСтатус = ЗНАЧЕНИЕ(справочник.СтатусыЗаказовПокупателей.ВРаботе)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоЗаказовПокупателейВРаботе,
		|	ВЫБОР
		|		КОГДА ОбеспечениеЗаказовРозницыОбороты.Регистратор.ТекущийСтатус = ЗНАЧЕНИЕ(справочник.СтатусыЗаказовПокупателей.Выполнен)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоЗаказовПокупателейВыполненных
		|ПОМЕСТИТЬ ВТ_ЗаказыПокупателейВрем
		|ИЗ
		|	РегистрНакопления.ОбеспечениеЗаказовРозницы.Обороты(, , Авто, Заказ В (&МассивСсылок)) КАК ОбеспечениеЗаказовРозницыОбороты
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ОбеспечениеЗаказовРозницыОбороты.Регистратор) = ТИП(Документ.ЗаказПокупателя)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗаказыПокупателейВрем.Заказ КАК ДокументРозницы,
		|	СУММА(ВТ_ЗаказыПокупателейВрем.КоличествоЗаказовПокупателейВРаботе) КАК КоличествоВРаботе,
		|	СУММА(ВТ_ЗаказыПокупателейВрем.КоличествоЗаказовПокупателейВыполненных) КАК КоличествоВыполненных
		|ПОМЕСТИТЬ ВТ_ЗаказыПокупателейВрем2
		|ИЗ
		|	ВТ_ЗаказыПокупателейВрем КАК ВТ_ЗаказыПокупателейВрем
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаказыПокупателейВрем.Заказ
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗаказыПокупателейВрем2.ДокументРозницы КАК ДокументРозницы,
		|	ВЫБОР
		|		КОГДА ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе = 0 И ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных = 0 
		|			ТОГДА -1 // нет ЗП (пусто)
		|		КОГДА ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе > 0 И ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных = 0 
		|			ТОГДА 2 // все в работе (пустой кружок)
		|		КОГДА ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе > 0 И ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных > 0 
		|			ТОГДА 1 // есть и в работе и выполненные (частично закрашен)
		|		КОГДА ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе = 0 И ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных > 0 
		|			ТОГДА 0 // все выполнены работе (полностью закрашен)
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СтатусЗаказаРозницыНаПроизводство
		|ИЗ
		|	ВТ_ЗаказыПокупателейВрем2 КАК ВТ_ЗаказыПокупателейВрем2
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	//СТАТУС ЗАКАЗА РОЗНИЦЫ ПОСТАВЩИКУ
	Если КэшКолонок.Свойство("ЕстьКолонкаСтатусЗаказаРозницыПоставщикам") И КэшКолонок.ЕстьКолонкаСтатусЗаказаРозницыПоставщикам Тогда
		
		//#16544 переделка запроса для возможности отбора
		
		//ТекстЗапроса = ТекстЗапроса + 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ЗаказыРозницыПоставщикамОбороты.ЗаказДоговор КАК ДокументРозницы,
		//|	ЗаказыРозницыПоставщикамОбороты.Номенклатура КАК Номенклатура,
		//|	ЗаказыРозницыПоставщикамОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		//|	ЗаказыРозницыПоставщикамОбороты.ЗаказанОборот КАК ЗаказанОборот,
		//|	ЗаказыРозницыПоставщикамОбороты.ПолученОборот КАК ПолученОборот,
		//|	1 КАК КоличествоПозиций,
		//|	ВЫБОР
		//|		КОГДА ЗаказыРозницыПоставщикамОбороты.ЗаказанОборот > 0
		//|				И ЗаказыРозницыПоставщикамОбороты.ПолученОборот >= ЗаказыРозницыПоставщикамОбороты.ЗаказанОборот
		//|			ТОГДА 1
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК ПозицияПолучена,
		//|	ВЫБОР
		//|		КОГДА ЗаказыРозницыПоставщикамОбороты.ЗаказанОборот > 0
		//|				И ЗаказыРозницыПоставщикамОбороты.ПолученОборот < ЗаказыРозницыПоставщикамОбороты.ЗаказанОборот
		//|			ТОГДА 1
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК ПозицияНеполучена
		//|ПОМЕСТИТЬ ВТ_ЗаказыПоставщикамВрем
		//|ИЗ
		//|	РегистрНакопления.ЗаказыРозницыПоставщикам.Обороты(, , Авто, ЗаказДоговор В (&МассивСсылок)) КАК ЗаказыРозницыПоставщикамОбороты
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ВТ_ЗаказыПоставщикамВрем.ДокументРозницы КАК ДокументРозницы,
		//|	СУММА(ВТ_ЗаказыПоставщикамВрем.КоличествоПозиций) КАК КоличествоПозиций,
		//|	СУММА(ВТ_ЗаказыПоставщикамВрем.ПозицияПолучена) КАК ПозицияПолучена,
		//|	СУММА(ВТ_ЗаказыПоставщикамВрем.ПозицияНеполучена) КАК ПозицияНеполучена
		//|ПОМЕСТИТЬ ВТ_ЗаказыПоставщикам
		//|ИЗ
		//|	ВТ_ЗаказыПоставщикамВрем КАК ВТ_ЗаказыПоставщикамВрем
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ЗаказыПоставщикамВрем.ДокументРозницы
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ВТ_ЗаказыПоставщикам.ДокументРозницы КАК ДокументРозницы,
		//|	ВЫБОР
		//|		КОГДА ВТ_ЗаказыПоставщикам.ПозицияПолучена > 0
		//|				И ВТ_ЗаказыПоставщикам.ПозицияНеполучена = 0
		//|			ТОГДА 0 // полностью закрашен
		//|		КОГДА ВТ_ЗаказыПоставщикам.КоличествоПозиций > 0
		//|				И ВТ_ЗаказыПоставщикам.ПозицияПолучена > 0
		//|				И ВТ_ЗаказыПоставщикам.ПозицияНеполучена > 0
		//|			ТОГДА 1 // частично закрашен
		//|		КОГДА ВТ_ЗаказыПоставщикам.КоличествоПозиций > 0
		//|				И ВТ_ЗаказыПоставщикам.ПозицияПолучена = 0
		//|			ТОГДА 2 // пустой кружок
		//|		ИНАЧЕ -1 // пусто
		//|	КОНЕЦ КАК СтатусЗаказаРозницыПоставщикам
		//|ИЗ
		//|	ВТ_ЗаказыПоставщикам КАК ВТ_ЗаказыПоставщикам
		//|;
		//|////////////////////////////////////////////////////////////////////////////////
		//|";
		
		ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеРегистра.ЗаказДоговор КАК Документрозницы,
			|	СУММА(ДанныеРегистра.ЗаказанОборот) КАК ЗаказанОборот,
			|	СУММА(ДанныеРегистра.ПолученОборот) КАК ПолученОборот
			|ПОМЕСТИТЬ ВТ_ЗаказыРозницыПоставщикам
			|ИЗ
			|	РегистрНакопления.ЗаказыРозницыПоставщикам.Обороты(, , Авто, ЗаказДоговор В (&МассивСсылок)) КАК ДанныеРегистра
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеРегистра.ЗаказДоговор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ_ЗаказыПоставщикам.ДокументРозницы КАК ДокументРозницы,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) > 0
			|			И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) = 0
			|			ТОГДА 2 // пустой кружок
			|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) > 0
			|			И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) < ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0)
			|			ТОГДА 1  // частично закрашен
			|		КОГДА (ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) > 0
			|				И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) >= ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0))		
			|			ИЛИ (ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) = 0
			|				И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) > 0)
			|			ТОГДА 0 // полностью закрашен
			|		ИНАЧЕ -1  // пусто
			|	КОНЕЦ КАК СтатусЗаказаРозницыПоставщикам
			|ИЗ
			|	ВТ_ЗаказыРозницыПоставщикам КАК ВТ_ЗаказыПоставщикам
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
	КонецЕсли;
	
	Если ТипДокумента = "ЗаказДоговор" Тогда
		
		Если КэшКолонок.Свойство("ЕстьКолонкаСостояниеВыполненияМонтажей") И КэшКолонок.ЕстьКолонкаСостояниеВыполненияМонтажей Тогда
			
			//ТекстЗапроса = ТекстЗапроса + 
			//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//|	ЗаказыПокупателейОбороты.ЗаказНаПроизводство КАК ЗаказДоговор,
			//|	1 КАК КоличествоПозиций,
			//|	ЗаказыПокупателейОбороты.Номенклатура КАК Номенклатура,
			//|	ЗаказыПокупателейОбороты.ХарактеристикаНоменклатуры КАК Характеристика,
			//|	ВЫБОР
			//|			КОГДА ЗаказыПокупателейОбороты.КоличествоПриход = ЗаказыПокупателейОбороты.КоличествоРасход
			//|				ТОГДА 1
			//|			ИНАЧЕ 0
			//|		КОНЕЦ КАК ПозицияИсполнена,
			//|	ВЫБОР
			//|			КОГДА ЗаказыПокупателейОбороты.КоличествоПриход < ЗаказыПокупателейОбороты.КоличествоРасход
			//|				ТОГДА 1
			//|			ИНАЧЕ 0
			//|		КОНЕЦ КАК ПозицияПеревыполнена
			//|ПОМЕСТИТЬ ВТ_ИсполнениеЗаказовВрем
			//|ИЗ
			//|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Авто, ЗаказНаПроизводство В (&МассивСсылок)) КАК ЗаказыПокупателейОбороты
			//|ГДЕ
			//|	ЗаказыПокупателейОбороты.ЗаказНаПроизводство ССЫЛКА Документ.ЗаказДоговор
			//|
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//|	ВТ_ИсполнениеЗаказовВрем.ЗаказДоговор КАК ЗаказДоговор,
			//|	СУММА(ВТ_ИсполнениеЗаказовВрем.КоличествоПозиций) КАК КоличествоПозиций,
			//|	СУММА(ВТ_ИсполнениеЗаказовВрем.ПозицияИсполнена) КАК ПозицияИсполнена,
			//|	СУММА(ВТ_ИсполнениеЗаказовВрем.ПозицияПеревыполнена) КАК ПозицияПеревыполнена
			//|ПОМЕСТИТЬ ВТ_ИсполнениеЗаказов
			//|ИЗ
			//|	ВТ_ИсполнениеЗаказовВрем КАК ВТ_ИсполнениеЗаказовВрем
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	ВТ_ИсполнениеЗаказовВрем.ЗаказДоговор
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	ВТ_ИсполнениеЗаказов.ЗаказДоговор КАК ЗаказДоговор,
			//|	ВЫБОР
			//|		КОГДА ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоПозиций, 0) > 0
			//|				И ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоПозиций, 0) = ЕСТЬNULL(ВТ_ИсполнениеЗаказов.ПозицияИсполнена, 0)
			//|				И ЕСТЬNULL(ВТ_ИсполнениеЗаказов.ПозицияПеревыполнена, 0) = 0
			//|			ТОГДА 0
			//|		КОГДА ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоПозиций, 0) > ЕСТЬNULL(ВТ_ИсполнениеЗаказов.ПозицияИсполнена, 0)
			//|				И ЕСТЬNULL(ВТ_ИсполнениеЗаказов.ПозицияИсполнена, 0) > 0
			//|			ТОГДА 1
			//|		ИНАЧЕ -1
			//|	КОНЕЦ КАК СостояниеВыполненияМонтажей
			//|ИЗ
			//|	ВТ_ИсполнениеЗаказов КАК ВТ_ИсполнениеЗаказов
			//|;
			//|////////////////////////////////////////////////////////////////////////////////
			//|";
			
			ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеРегистра.ЗаказНаПроизводство КАК ЗаказДоговор,
			|	СУММА(ДанныеРегистра.КоличествоПриход) КАК КоличествоЗаказано,
			|	СУММА(ДанныеРегистра.КоличествоРасход) КАК КоличествоВыполнено
			|ПОМЕСТИТЬ ВТ_ИсполнениеЗаказов
			|ИЗ
			|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Авто, ЗаказНаПроизводство В (&МассивСсылок)) КАК ДанныеРегистра
			|ГДЕ
			|	ДанныеРегистра.ЗаказНаПроизводство ССЫЛКА Документ.ЗаказДоговор
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеРегистра.ЗаказНаПроизводство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ИсполнениеЗаказов.ЗаказДоговор КАК ЗаказДоговор,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоЗаказано, 0) > 0
			|				И ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоЗаказано, 0) = ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоВыполнено, 0)
			|			ТОГДА 0
			|		КОГДА ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоЗаказано, 0) > ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоВыполнено, 0)
			|				И ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоВыполнено, 0) > 0
			|			ТОГДА 1
			|		ИНАЧЕ -1
			|	КОНЕЦ КАК СостояниеВыполненияМонтажей
			|ИЗ
			|	ВТ_ИсполнениеЗаказов КАК ВТ_ИсполнениеЗаказов
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
		КонецЕсли;
		
		Если КэшКолонок.Свойство("ЕстьКолонкаСостояниеПозицийВМонтажах") И КэшКолонок.ЕстьКолонкаСостояниеПозицийВМонтажах Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗаказДоговорТоварыУслуги.Ссылка КАК ЗаказДоговор,
			|	ЗаказДоговорТоварыУслуги.Номенклатура КАК Номенклатура,
			|	ЗаказДоговорТоварыУслуги.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	1 КАК КоличествоПозиций,
			|	ВЫБОР
			|		КОГДА ЗаказДоговорТоварыУслуги.Количество <= ЕСТЬNULL(МонтажТоварыУслуги.Количество, 0)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ПозицияМонтирована,
			|	ВЫБОР
			|		КОГДА ЗаказДоговорТоварыУслуги.Количество > ЕСТЬNULL(МонтажТоварыУслуги.Количество, 0)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ПозицияНемонтирована
			|ПОМЕСТИТЬ ВТ_ПозицииВМонтажахВрем
			|ИЗ
			|	Документ.ЗаказДоговор.ТоварыУслуги КАК ЗаказДоговорТоварыУслуги
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Монтаж.ТоварыУслуги КАК МонтажТоварыУслуги
			//|		ПО (ЗаказДоговорТоварыУслуги.Ссылка = МонтажТоварыУслуги.Ссылка.ЗаказДоговор) //поле "ЗаказДоговор" теперь не является привязкой, теперь привязка по основанию
			|		ПО (ЗаказДоговорТоварыУслуги.Ссылка = МонтажТоварыУслуги.Ссылка.Основание)
			|			И (ЗаказДоговорТоварыУслуги.Номенклатура = МонтажТоварыУслуги.Номенклатура)
			|			И (ЗаказДоговорТоварыУслуги.ХарактеристикаНоменклатуры = МонтажТоварыУслуги.ХарактеристикаНоменклатуры)
			|			И (ЗаказДоговорТоварыУслуги.УИСтроки = МонтажТоварыУслуги.УИСтроки)
			|			И (НЕ МонтажТоварыУслуги.Ссылка.ПометкаУдаления)
			|ГДЕ
			|	ЗаказДоговорТоварыУслуги.Ссылка В (&МассивСсылок)
			|	И ЗаказДоговорТоварыУслуги.Ссылка.Проведен
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ_ПозицииВМонтажахВрем.ЗаказДоговор КАК ЗаказДоговор,
			|	СУММА(ВТ_ПозицииВМонтажахВрем.КоличествоПозиций) КАК КоличествоПозиций,
			|	СУММА(ВТ_ПозицииВМонтажахВрем.ПозицияМонтирована) КАК ПозицияМонтирована,
			|	СУММА(ВТ_ПозицииВМонтажахВрем.ПозицияНемонтирована) КАК ПозицияНемонтирована
			|ПОМЕСТИТЬ ВТ_ПозицииВМонтажах
			|ИЗ
			|	ВТ_ПозицииВМонтажахВрем КАК ВТ_ПозицииВМонтажахВрем
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ПозицииВМонтажахВрем.ЗаказДоговор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДокументЗаказ.Ссылка КАК ЗаказДоговор,
			|	ВЫБОР
			|		КОГДА МАКСИМУМ(ДокументМонтаж.Ссылка) ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК ЕстьМонтаж
			|ПОМЕСТИТЬ ВТ_НаличиеМонтажей
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДокументЗаказ
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Монтаж КАК ДокументМонтаж
			|		ПО (ДокументМонтаж.ЗаказДоговор = ДокументЗаказ.Ссылка)
			|ГДЕ
			|	ДокументЗаказ.Ссылка В (&МассивСсылок)
			|	И ДокументЗаказ.Проведен
			|
			|СГРУППИРОВАТЬ ПО
			|	ДокументЗаказ.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ_ПозицииВМонтажах.ЗаказДоговор КАК ЗаказДоговор,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_ПозицииВМонтажах.КоличествоПозиций, 0) > 0
			|				И ЕСТЬNULL(ВТ_ПозицииВМонтажах.КоличествоПозиций, 0) <= ЕСТЬNULL(ВТ_ПозицииВМонтажах.ПозицияМонтирована, 0)
			|			ТОГДА 0
			|		КОГДА ЕСТЬNULL(ВТ_ПозицииВМонтажах.КоличествоПозиций, 0) > ЕСТЬNULL(ВТ_ПозицииВМонтажах.ПозицияМонтирована, 0)
			|				И ЕСТЬNULL(ВТ_ПозицииВМонтажах.ПозицияМонтирована, 0) > 0
			|				И ЕСТЬNULL(ВТ_ПозицииВМонтажах.ПозицияНемонтирована, 0) > 0
			|			ТОГДА 1
			|		КОГДА ЕСТЬNULL(ВТ_ПозицииВМонтажах.КоличествоПозиций, 0) > 0
			|				И ЕСТЬNULL(ВТ_ПозицииВМонтажах.ПозицияМонтирована, 0) = 0
			|				И ВТ_НаличиеМонтажей.ЕстьМонтаж = ИСТИНА
			|			ТОГДА 2
			|		ИНАЧЕ -1
			|	КОНЕЦ КАК СостояниеПозицийВМонтажах
			|ИЗ
			|	ВТ_ПозицииВМонтажах КАК ВТ_ПозицииВМонтажах
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаличиеМонтажей КАК ВТ_НаличиеМонтажей
			|	ПО ВТ_ПозицииВМонтажах.ЗаказДоговор = ВТ_НаличиеМонтажей.ЗаказДоговор
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
		КонецЕсли;
		
	КонецЕсли;
	
	// выполняем запросы
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	УказательЗапроса = 0;
	
	// выводим значения 
	Если КэшКолонок.Свойство("ЕстьКолонкаСтатусЗаказаРозницыНаПроизводство") И КэшКолонок.ЕстьКолонкаСтатусЗаказаРозницыНаПроизводство Тогда
		
		УказательЗапроса = УказательЗапроса + 2; // из-за наличия ВТ
		Выборка = РезультатЗапроса[УказательЗапроса].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаСписка = Строки[Выборка.ДокументРозницы];
			СтрокаСписка.Данные["СтатусЗаказаРозницыНаПроизводство"] = Выборка.СтатусЗаказаРозницыНаПроизводство;
		КонецЦикла;
		
		УказательЗапроса = УказательЗапроса + 1;
	КонецЕсли;
	
	Если КэшКолонок.Свойство("ЕстьКолонкаСтатусЗаказаРозницыПоставщикам") И КэшКолонок.ЕстьКолонкаСтатусЗаказаРозницыПоставщикам Тогда
		
		//#16544 осталась одна ВТ
		//УказательЗапроса = УказательЗапроса + 2; // из-за наличия ВТ
		УказательЗапроса = УказательЗапроса + 1; // из-за наличия ВТ
		
		Выборка = РезультатЗапроса[УказательЗапроса].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаСписка = Строки[Выборка.ДокументРозницы];
			СтрокаСписка.Данные["СтатусЗаказаРозницыПоставщикам"] = Выборка.СтатусЗаказаРозницыПоставщикам;
		КонецЦикла;
		
		УказательЗапроса = УказательЗапроса + 1;
	КонецЕсли;
	
	Если КэшКолонок.Свойство("ЕстьКолонкаСостояниеВыполненияМонтажей") И КэшКолонок.ЕстьКолонкаСостояниеВыполненияМонтажей Тогда
		
		УказательЗапроса = УказательЗапроса + 1; // из-за наличия ВТ
		Выборка = РезультатЗапроса[УказательЗапроса].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаСписка = Строки[Выборка.ЗаказДоговор];
			СтрокаСписка.Данные["СостояниеВыполненияМонтажей"] = Выборка.СостояниеВыполненияМонтажей;
		КонецЦикла;
		
		УказательЗапроса = УказательЗапроса + 1;
	КонецЕсли;
	
	Если КэшКолонок.Свойство("ЕстьКолонкаСостояниеПозицийВМонтажах") И КэшКолонок.ЕстьКолонкаСостояниеПозицийВМонтажах Тогда
		
		УказательЗапроса = УказательЗапроса + 3; // из-за наличия ВТ
		Выборка = РезультатЗапроса[УказательЗапроса].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаСписка = Строки[Выборка.ЗаказДоговор];
			СтрокаСписка.Данные["СостояниеПозицийВМонтажах"] = Выборка.СостояниеПозицийВМонтажах;
		КонецЦикла;
		
		УказательЗапроса = УказательЗапроса + 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаказДоговорОсобыйОтборПриИзменении(СписокЗаказДоговоры, СтандартныйТекстЗапросаСписка, ПоляОтбора) Экспорт
	
	// ПРИ ИЗМЕНЕНИИ ЗАПРОСОВ ИЗМЕНЯТЬ ПРОЦЕДУРУ ОбщийМодульСервер.РозницаПриПолученииДанныхНаСервере()
	
	// применяем стандартный текст запроса
	ТекстЗапроса = СтандартныйТекстЗапросаСписка;
	
	ЗаказДоговорОтборПоВыполнениюМонтажей  = -9;
	ЗаказДоговорОтборПоПозициямВМонтажах   = -9;
	ЗаказДоговорОтборПоСтатусуПроизводства = -9;
	ЗаказДоговорОтборПоСтатусуЗакупки      = -9;
	ПоляОтбора.Свойство("ЗаказДоговорОтборПоВыполнениюМонтажей",  ЗаказДоговорОтборПоВыполнениюМонтажей);
	ПоляОтбора.Свойство("ЗаказДоговорОтборПоПозициямВМонтажах",   ЗаказДоговорОтборПоПозициямВМонтажах);
	ПоляОтбора.Свойство("ЗаказДоговорОтборПоСтатусуПроизводства", ЗаказДоговорОтборПоСтатусуПроизводства);
	ПоляОтбора.Свойство("ЗаказДоговорОтборПоСтатусуЗакупки",      ЗаказДоговорОтборПоСтатусуЗакупки);
	
	СписокЗаказДоговоры.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ОтборПоСостояниюВыполненияМонтажей", ЗаказДоговорОтборПоВыполнениюМонтажей);
	СписокЗаказДоговоры.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ОтборПоСостояниюПозицийВМонтажах",   ЗаказДоговорОтборПоПозициямВМонтажах);
	СписокЗаказДоговоры.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ОтборПоСтатусуПроизводства",   		ЗаказДоговорОтборПоСтатусуПроизводства);
	СписокЗаказДоговоры.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ОтборПоСтатусуЗакупки",   			ЗаказДоговорОтборПоСтатусуЗакупки);
	
	// если задан отбор по состоянию позиций в монтаже
	Если НЕ ЗаказДоговорОтборПоПозициямВМонтажах = -9 Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказДоговорТоварыУслуги.Ссылка КАК ЗаказДоговор,
		|	ЗаказДоговорТоварыУслуги.Номенклатура КАК Номенклатура,
		|	ЗаказДоговорТоварыУслуги.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	1 КАК КоличествоПозиций,
		|	ВЫБОР
		|		КОГДА ЗаказДоговорТоварыУслуги.Количество <= ЕСТЬNULL(МонтажТоварыУслуги.Количество, 0)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПозицияМонтирована,
		|	ВЫБОР
		|		КОГДА ЗаказДоговорТоварыУслуги.Количество > ЕСТЬNULL(МонтажТоварыУслуги.Количество, 0)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПозицияНемонтирована
		|ПОМЕСТИТЬ ВТ_ПозицииВМонтажахВрем
		|ИЗ
		|	Документ.ЗаказДоговор.ТоварыУслуги КАК ЗаказДоговорТоварыУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Монтаж.ТоварыУслуги КАК МонтажТоварыУслуги
		|		ПО (ЗаказДоговорТоварыУслуги.Ссылка = МонтажТоварыУслуги.Ссылка.ЗаказДоговор)
		|			И (ЗаказДоговорТоварыУслуги.Номенклатура = МонтажТоварыУслуги.Номенклатура)
		|			И (ЗаказДоговорТоварыУслуги.ХарактеристикаНоменклатуры = МонтажТоварыУслуги.ХарактеристикаНоменклатуры)
		|			И (ЗаказДоговорТоварыУслуги.УИСтроки = МонтажТоварыУслуги.УИСтроки)
		|			И (НЕ МонтажТоварыУслуги.Ссылка.ПометкаУдаления)
		|ГДЕ
		|	ЗаказДоговорТоварыУслуги.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ПозицииВМонтажахВрем.ЗаказДоговор КАК ЗаказДоговор,
		|	СУММА(ВТ_ПозицииВМонтажахВрем.КоличествоПозиций) КАК КоличествоПозиций,
		|	СУММА(ВТ_ПозицииВМонтажахВрем.ПозицияМонтирована) КАК ПозицияМонтирована,
		|	СУММА(ВТ_ПозицииВМонтажахВрем.ПозицияНемонтирована) КАК ПозицияНемонтирована
		|ПОМЕСТИТЬ ВТ_ПозицииВМонтажах
		|ИЗ
		|	ВТ_ПозицииВМонтажахВрем КАК ВТ_ПозицииВМонтажахВрем
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПозицииВМонтажахВрем.ЗаказДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументЗаказ.Ссылка КАК ЗаказДоговор,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(ДокументМонтаж.Ссылка) ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьМонтаж
		|ПОМЕСТИТЬ ВТ_НаличиеМонтажей
		|ИЗ
		|	Документ.ЗаказДоговор КАК ДокументЗаказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Монтаж КАК ДокументМонтаж
		|		ПО (ДокументМонтаж.ЗаказДоговор = ДокументЗаказ.Ссылка)
		|
		|ГДЕ
		|	ДокументЗаказ.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументЗаказ.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|" + ТекстЗапроса;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-1 КАК СостояниеПозицийВМонтажах", 
		"	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ПозицииВМонтажах.КоличествоПозиций, 0) > 0
		|				И ЕСТЬNULL(ВТ_ПозицииВМонтажах.КоличествоПозиций, 0) <= ЕСТЬNULL(ВТ_ПозицииВМонтажах.ПозицияМонтирована, 0)
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(ВТ_ПозицииВМонтажах.КоличествоПозиций, 0) > ЕСТЬNULL(ВТ_ПозицииВМонтажах.ПозицияМонтирована, 0)
		|				И ЕСТЬNULL(ВТ_ПозицииВМонтажах.ПозицияМонтирована, 0) > 0
		|				И ЕСТЬNULL(ВТ_ПозицииВМонтажах.ПозицияНемонтирована, 0) > 0
		|			ТОГДА 1
		|		КОГДА ЕСТЬNULL(ВТ_ПозицииВМонтажах.КоличествоПозиций, 0) > 0
		|				И ЕСТЬNULL(ВТ_ПозицииВМонтажах.ПозицияМонтирована, 0) = 0
		|				И ВТ_НаличиеМонтажей.ЕстьМонтаж = ИСТИНА
		|			ТОГДА 2
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СостояниеПозицийВМонтажах");
		
		ТекстЗапроса = ТекстЗапроса + 
		"
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицииВМонтажах КАК ВТ_ПозицииВМонтажах
		|	ПО ДокументЗаказДоговор.Ссылка = ВТ_ПозицииВМонтажах.ЗаказДоговор
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаличиеМонтажей КАК ВТ_НаличиеМонтажей
		|	ПО ДокументЗаказДоговор.Ссылка = ВТ_НаличиеМонтажей.ЗаказДоговор
		|";
		
	КонецЕсли;
	
	// если задан отбор по состоянию исполнения
	Если НЕ ЗаказДоговорОтборПоВыполнениюМонтажей = -9 Тогда
		
		// в динамическом списке такой попозиционный запрос "не работает" = выборка по регистру не учитывает номенклатуру
		//ТекстЗапроса = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ЗаказыПокупателейОбороты.ЗаказНаПроизводство КАК ЗаказДоговор,
		//|	1 КАК КоличествоПозиций,
		//|	ЗаказыПокупателейОбороты.Номенклатура КАК Номенклатура,
		//|	ЗаказыПокупателейОбороты.ХарактеристикаНоменклатуры КАК Характеристика,
		//|	ВЫБОР
		//|			КОГДА ЗаказыПокупателейОбороты.КоличествоПриход = ЗаказыПокупателейОбороты.КоличествоРасход
		//|				ТОГДА 1
		//|			ИНАЧЕ 0
		//|		КОНЕЦ КАК ПозицияВыполнена,
		//|	ВЫБОР
		//|			КОГДА ЗаказыПокупателейОбороты.КоличествоПриход < ЗаказыПокупателейОбороты.КоличествоРасход
		//|				ТОГДА 1
		//|			ИНАЧЕ 0
		//|		КОНЕЦ КАК ПозицияПеревыполнена
		//|ПОМЕСТИТЬ ВТ_ИсполнениеЗаказовВрем
		//|ИЗ
		//|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Авто, ) КАК ЗаказыПокупателейОбороты
		//|ГДЕ
		//|	ЗаказыПокупателейОбороты.ЗаказНаПроизводство ССЫЛКА Документ.ЗаказДоговор
		//|
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ВТ_ИсполнениеЗаказовВрем.ЗаказДоговор КАК ЗаказДоговор,
		//|	СУММА(ВТ_ИсполнениеЗаказовВрем.КоличествоПозиций) КАК КоличествоПозиций,
		//|	СУММА(ВТ_ИсполнениеЗаказовВрем.ПозицияВыполнена) КАК ПозицияВыполнена,
		//|	СУММА(ВТ_ИсполнениеЗаказовВрем.ПозицияПеревыполнена) КАК ПозицияПеревыполнена
		//|ПОМЕСТИТЬ ВТ_ИсполнениеЗаказов
		//|ИЗ
		//|	ВТ_ИсполнениеЗаказовВрем КАК ВТ_ИсполнениеЗаказовВрем
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ИсполнениеЗаказовВрем.ЗаказДоговор
		//|;
		//|////////////////////////////////////////////////////////////////////////////////
		//|" + ТекстЗапроса;
		
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-1 КАК СостояниеВыполненияМонтажей", 
		//"	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоПозиций, 0) > 0
		//|           И ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоПозиций, 0) = ЕСТЬNULL(ВТ_ИсполнениеЗаказов.ПозицияВыполнена, 0)
		//|           И ЕСТЬNULL(ВТ_ИсполнениеЗаказов.ПозицияПеревыполнена, 0) = 0
		//|			ТОГДА 0
		//|		КОГДА ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоПозиций, 0) > ЕСТЬNULL(ВТ_ИсполнениеЗаказов.ПозицияВыполнена, 0) 
		//|			И ЕСТЬNULL(ВТ_ИсполнениеЗаказов.ПозицияВыполнена, 0) > 0		
		//|       	ТОГДА 1
		//|		ИНАЧЕ -1
		//|	КОНЕЦ КАК СостояниеВыполненияМонтажей");
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеРегистра.ЗаказНаПроизводство КАК ЗаказДоговор,
		|	СУММА(ДанныеРегистра.КоличествоПриход) КАК КоличествоЗаказано,
		|	СУММА(ДанныеРегистра.КоличествоРасход) КАК КоличествоВыполнено
		|ПОМЕСТИТЬ ВТ_ИсполнениеЗаказов
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Авто, ) КАК ДанныеРегистра
		|ГДЕ
		|	ДанныеРегистра.ЗаказНаПроизводство ССЫЛКА Документ.ЗаказДоговор
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеРегистра.ЗаказНаПроизводство
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|" + ТекстЗапроса;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-1 КАК СостояниеВыполненияМонтажей", 
		"	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоЗаказано, 0) > 0
		|           И ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоЗаказано, 0) = ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоВыполнено, 0)
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоЗаказано, 0) > ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоВыполнено, 0) 
		|			И ЕСТЬNULL(ВТ_ИсполнениеЗаказов.КоличествоВыполнено, 0) > 0		
		|       	ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СостояниеВыполненияМонтажей");
		
		ТекстЗапроса = ТекстЗапроса + 
		"
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсполнениеЗаказов КАК ВТ_ИсполнениеЗаказов
		|	ПО ДокументЗаказДоговор.Ссылка = ВТ_ИсполнениеЗаказов.ЗаказДоговор
		|";
		
	КонецЕсли;
	
	Если НЕ ЗаказДоговорОтборПоСтатусуПроизводства = -9 Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбеспечениеЗаказовРозницыОбороты.Заказ КАК Заказ,
		|	ВЫБОР
		|		КОГДА ОбеспечениеЗаказовРозницыОбороты.Регистратор.ТекущийСтатус = ЗНАЧЕНИЕ(справочник.СтатусыЗаказовПокупателей.ВРаботе)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоЗаказовПокупателейВРаботе,
		|	ВЫБОР
		|		КОГДА ОбеспечениеЗаказовРозницыОбороты.Регистратор.ТекущийСтатус = ЗНАЧЕНИЕ(справочник.СтатусыЗаказовПокупателей.Выполнен)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоЗаказовПокупателейВыполненных
		|ПОМЕСТИТЬ ВТ_ЗаказыПокупателейВрем
		|ИЗ
		|	РегистрНакопления.ОбеспечениеЗаказовРозницы.Обороты(, , Авто, Заказ ССЫЛКА Документ.ЗаказДоговор) КАК ОбеспечениеЗаказовРозницыОбороты
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ОбеспечениеЗаказовРозницыОбороты.Регистратор) = ТИП(Документ.ЗаказПокупателя)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗаказыПокупателейВрем.Заказ КАК ДокументРозницы,
		|	СУММА(ВТ_ЗаказыПокупателейВрем.КоличествоЗаказовПокупателейВРаботе) КАК КоличествоВРаботе,
		|	СУММА(ВТ_ЗаказыПокупателейВрем.КоличествоЗаказовПокупателейВыполненных) КАК КоличествоВыполненных
		|ПОМЕСТИТЬ ВТ_ЗаказыПокупателейВрем2
		|ИЗ
		|	ВТ_ЗаказыПокупателейВрем КАК ВТ_ЗаказыПокупателейВрем
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаказыПокупателейВрем.Заказ
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|" + ТекстЗапроса;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-1 КАК СтатусЗаказаРозницыНаПроизводство", 
		"	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе, 0) = 0 И ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных, 0) = 0 
		|			ТОГДА -1 // нет ЗП (пусто)
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе, 0) > 0 И ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных, 0) = 0 
		|			ТОГДА 2 // все в работе (пустой кружок)
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе, 0) > 0 И ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных, 0) > 0 
		|			ТОГДА 1 // есть и в работе и выполненные (частично закрашен)
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе, 0) = 0 И ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных, 0) > 0 
		|			ТОГДА 0 // все выполнены работе (полностью закрашен)
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СтатусЗаказаРозницыНаПроизводство");
		
		ТекстЗапроса = ТекстЗапроса + 
		"
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПокупателейВрем2 КАК ВТ_ЗаказыПокупателейВрем2
		|	ПО ДокументЗаказДоговор.Ссылка = ВТ_ЗаказыПокупателейВрем2.ДокументРозницы
		|";
		
	КонецЕсли;
	
	Если НЕ ЗаказДоговорОтборПоСтатусуЗакупки = -9 Тогда
		// в динамическом списке такой попозиционный запрос "не работает" = выборка по регистру не учитывает номенклатуру
		//ТекстЗапроса = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ЗаказыРозницыПоставщикамОбороты.ЗаказДоговор КАК ДокументРозницы,
		//|	ЗаказыРозницыПоставщикамОбороты.Номенклатура КАК Номенклатура,
		//|	ЗаказыРозницыПоставщикамОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		//|	ЗаказыРозницыПоставщикамОбороты.ЗаказанОборот КАК ЗаказанОборот,
		//|	ЗаказыРозницыПоставщикамОбороты.ПолученОборот КАК ПолученОборот,
		//|	1 КАК КоличествоПозиций,
		//|	ВЫБОР
		//|		КОГДА ЗаказыРозницыПоставщикамОбороты.ЗаказанОборот > 0
		//|				И ЗаказыРозницыПоставщикамОбороты.ПолученОборот >= ЗаказыРозницыПоставщикамОбороты.ЗаказанОборот
		//|			ТОГДА 1
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК ПозицияПолучена,
		//|	ВЫБОР
		//|		КОГДА ЗаказыРозницыПоставщикамОбороты.ЗаказанОборот > 0
		//|				И ЗаказыРозницыПоставщикамОбороты.ПолученОборот < ЗаказыРозницыПоставщикамОбороты.ЗаказанОборот
		//|			ТОГДА 1
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК ПозицияНеполучена
		//|ПОМЕСТИТЬ ВТ_ЗаказыПоставщикамВрем
		//|ИЗ
		//|	РегистрНакопления.ЗаказыРозницыПоставщикам.Обороты(, , Авто, ЗаказДоговор ССЫЛКА Документ.ЗаказДоговор) КАК ЗаказыРозницыПоставщикамОбороты
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ВТ_ЗаказыПоставщикамВрем.ДокументРозницы КАК ДокументРозницы,
		//|	СУММА(ВТ_ЗаказыПоставщикамВрем.КоличествоПозиций) КАК КоличествоПозиций,
		//|	СУММА(ВТ_ЗаказыПоставщикамВрем.ПозицияПолучена) КАК ПозицияПолучена,
		//|	СУММА(ВТ_ЗаказыПоставщикамВрем.ПозицияНеполучена) КАК ПозицияНеполучена
		//|ПОМЕСТИТЬ ВТ_ЗаказыПоставщикам
		//|ИЗ
		//|	ВТ_ЗаказыПоставщикамВрем КАК ВТ_ЗаказыПоставщикамВрем
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ЗаказыПоставщикамВрем.ДокументРозницы
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|" + ТекстЗапроса;
		//
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-1 КАК СтатусЗаказаРозницыПоставщикам", 
		//"	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПозицияПолучена, 0) > 0
		//|				И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПозицияНеполучена, 0) = 0
		//|			ТОГДА 0 // полностью закрашен
		//|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПоставщикам.КоличествоПозиций, 0) > 0
		//|				И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПозицияПолучена, 0) > 0
		//|				И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПозицияНеполучена, 0) > 0
		//|			ТОГДА 1 // частично закрашен
		//|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПоставщикам.КоличествоПозиций, 0) > 0
		//|				И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПозицияПолучена, 0) = 0
		//|			ТОГДА 2 // пустой кружок
		//|		ИНАЧЕ -1 // пусто
		//|	КОНЕЦ КАК СтатусЗаказаРозницыПоставщикам");
		//
		//ТекстЗапроса = ТекстЗапроса + 
		//"
		//|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПоставщикам КАК ВТ_ЗаказыПоставщикам
		//|	ПО ДокументЗаказДоговор.Ссылка = ВТ_ЗаказыПоставщикам.ДокументРозницы
		//|";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-1 КАК СтатусЗаказаРозницыПоставщикам", 
		"	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) > 0
		|			И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) = 0
		|			ТОГДА 2 // пустой кружок
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) > 0
		|			И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) < ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0)
		|			ТОГДА 1  // частично закрашен
		|		КОГДА (ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) > 0
		|				И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) >= ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0))		
		|			ИЛИ (ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) = 0
		|				И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) > 0)
		|			ТОГДА 0 // полностью закрашен
		|		ИНАЧЕ -1  // пусто
		|	КОНЕЦ КАК СтатусЗаказаРозницыПоставщикам");
		
		ТекстЗапроса = ТекстЗапроса + 
		"
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыРозницыПоставщикам.Обороты(, , Авто, ЗаказДоговор ССЫЛКА Документ.ЗаказДоговор) КАК ВТ_ЗаказыПоставщикам
		|	ПО ДокументЗаказДоговор.Ссылка = ВТ_ЗаказыПоставщикам.ЗаказДоговор
		|";
		
	КонецЕсли;
	
	СписокЗаказДоговоры.ТекстЗапроса = ТекстЗапроса;
	
КонецПроцедуры

Процедура МонтажиОсобыйОтборПриИзменении(СписокМонтажи, СтандартныйТекстЗапросаСписка, ПоляОтбора) Экспорт
	
	// ПРИ ИЗМЕНЕНИИ ЗАПРОСОВ ИЗМЕНЯТЬ ПРОЦЕДУРУ ОбщийМодульСервер.РозницаПриПолученииДанныхНаСервере()
	
	// применяем стандартный текст запроса
	ТекстЗапроса = СтандартныйТекстЗапросаСписка;
	
	МонтажиОтборПоСтатусуПроизводства = -9;
	МонтажиОтборПоСтатусуЗакупки      = -9;
	ПоляОтбора.Свойство("МонтажиОтборПоСтатусуПроизводства", МонтажиОтборПоСтатусуПроизводства);
	ПоляОтбора.Свойство("МонтажиОтборПоСтатусуЗакупки",      МонтажиОтборПоСтатусуЗакупки);
	
	СписокМонтажи.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ОтборПоСтатусуПроизводства",   		МонтажиОтборПоСтатусуПроизводства);
	СписокМонтажи.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ОтборПоСтатусуЗакупки",   				МонтажиОтборПоСтатусуЗакупки);
	
	Если НЕ МонтажиОтборПоСтатусуПроизводства = -9 Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбеспечениеЗаказовРозницыОбороты.Заказ КАК Заказ,
		|	ВЫБОР
		|		КОГДА ОбеспечениеЗаказовРозницыОбороты.Регистратор.ТекущийСтатус = ЗНАЧЕНИЕ(справочник.СтатусыЗаказовПокупателей.ВРаботе)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоЗаказовПокупателейВРаботе,
		|	ВЫБОР
		|		КОГДА ОбеспечениеЗаказовРозницыОбороты.Регистратор.ТекущийСтатус = ЗНАЧЕНИЕ(справочник.СтатусыЗаказовПокупателей.Выполнен)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоЗаказовПокупателейВыполненных
		|ПОМЕСТИТЬ ВТ_ЗаказыПокупателейВрем
		|ИЗ
		|	РегистрНакопления.ОбеспечениеЗаказовРозницы.Обороты(, , Авто, Заказ ССЫЛКА Документ.Монтаж) КАК ОбеспечениеЗаказовРозницыОбороты
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ОбеспечениеЗаказовРозницыОбороты.Регистратор) = ТИП(Документ.ЗаказПокупателя)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗаказыПокупателейВрем.Заказ КАК ДокументРозницы,
		|	СУММА(ВТ_ЗаказыПокупателейВрем.КоличествоЗаказовПокупателейВРаботе) КАК КоличествоВРаботе,
		|	СУММА(ВТ_ЗаказыПокупателейВрем.КоличествоЗаказовПокупателейВыполненных) КАК КоличествоВыполненных
		|ПОМЕСТИТЬ ВТ_ЗаказыПокупателейВрем2
		|ИЗ
		|	ВТ_ЗаказыПокупателейВрем КАК ВТ_ЗаказыПокупателейВрем
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаказыПокупателейВрем.Заказ
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|" + ТекстЗапроса;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-1 КАК СтатусЗаказаРозницыНаПроизводство", 
		"	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе, 0) = 0 И ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных, 0) = 0 
		|			ТОГДА -1 // нет ЗП (пусто)
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе, 0) > 0 И ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных, 0) = 0 
		|			ТОГДА 2 // все в работе (пустой кружок)
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе, 0) > 0 И ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных, 0) > 0 
		|			ТОГДА 1 // есть и в работе и выполненные (частично закрашен)
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВРаботе, 0) = 0 И ЕСТЬNULL(ВТ_ЗаказыПокупателейВрем2.КоличествоВыполненных, 0) > 0 
		|			ТОГДА 0 // все выполнены работе (полностью закрашен)
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СтатусЗаказаРозницыНаПроизводство");
		
		ТекстЗапроса = ТекстЗапроса + 
		"
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПокупателейВрем2 КАК ВТ_ЗаказыПокупателейВрем2
		|	ПО ДокМонтаж.Ссылка = ВТ_ЗаказыПокупателейВрем2.ДокументРозницы
		|";
		
	КонецЕсли;
	
	Если НЕ МонтажиОтборПоСтатусуЗакупки = -9 Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-1 КАК СтатусЗаказаРозницыПоставщикам", 
		"	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) > 0
		|			И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) = 0
		|			ТОГДА 2 // пустой кружок
		|		КОГДА ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) > 0
		|			И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) < ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0)
		|			ТОГДА 1  // частично закрашен
		|		КОГДА (ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) > 0
		|				И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) >= ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0))		
		|			ИЛИ (ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ЗаказанОборот, 0) = 0
		|				И ЕСТЬNULL(ВТ_ЗаказыПоставщикам.ПолученОборот, 0) > 0)
		|			ТОГДА 0 // полностью закрашен
		|		ИНАЧЕ -1  // пусто
		|	КОНЕЦ КАК СтатусЗаказаРозницыПоставщикам");
		
		ТекстЗапроса = ТекстЗапроса + 
		"
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыРозницыПоставщикам.Обороты(, , Авто, ЗаказДоговор ССЫЛКА Документ.Монтаж) КАК ВТ_ЗаказыПоставщикам
		|	ПО ДокМонтаж.Ссылка = ВТ_ЗаказыПоставщикам.ЗаказДоговор
		|";
	КонецЕсли;
	
	СписокМонтажи.ТекстЗапроса = ТекстЗапроса;
	
КонецПроцедуры

Процедура ЗагрузитьВТаблицуЗначений(ТаблицаИсточник, ТаблицаПриемник, ОчищатьПриемник = Ложь) Экспорт
	
	Если ОчищатьПриемник Тогда
		ТаблицаПриемник.Очистить();
	КонецЕсли;
	
	// Заполним значения в совпадающих колонках.
	Для Каждого СтрокаТаблицыИсточника Из ТаблицаИсточник Цикл
		
		СтрокаТаблицыПриемника = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВидОперацииПоЭквайрингуПоВидуОперацииЧека(ВидОперацииЧекаККМ) Экспорт
	
	СоответствиеВидовОпераций = Новый Соответствие;
	СоответствиеВидовОпераций.Вставить(Перечисления.ВидыОперацийЧекККМ.Продажа, Перечисления.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой);	
	СоответствиеВидовОпераций.Вставить(Перечисления.ВидыОперацийЧекККМ.Возврат, Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту);
	Возврат СоответствиеВидовОпераций.Получить(ВидОперацииЧекаККМ);
	
КонецФункции

#Область Выработка

Процедура УстановитьВидимостьГруппыВыработки(Элементы, ОбъектСсылка) Экспорт
	
	ЭтоТехподдержка = ОбщийМодуль.ЭтоПользовательТехПоддержки();
	
	ИмяНастройки = "РазрешенПросмотрВыработкиВДокументе" + ОбъектСсылка.Метаданные().Имя;
	Элементы.ГруппаВыработка.Видимость = НастройкаПользователя(ИмяНастройки) ИЛИ ЭтоТехподдержка; // #14811 ЭтоТехподдержка
	
	//№ 1083 доступность галочки "Ручная корректировка" и ТЧ Выработка
	ИмяНастройки = "РазрешенаРучнаяКорректировкаВыработкиВДокументе" + ОбъектСсылка.Метаданные().Имя;
	Элементы.РучнаяКорректировкаВыработки.Доступность = НастройкаПользователя(ИмяНастройки);
	Элементы.ОбъектВыработка.ТолькоПросмотр = НЕ НастройкаПользователя(ИмяНастройки);
	
КонецПроцедуры

Процедура ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ОбъектВыработка.Видимость = Объект.РучнаяКорректировкаВыработки;
	Элементы.ВыработкаПлановая.Видимость = НЕ Объект.РучнаяКорректировкаВыработки И (НЕ Объект.Проведен ИЛИ ОпределитьНеобходимостьВыводаПлановойВыработкиПоДокументу(Объект));
	Элементы.Выработка.Видимость = НЕ Объект.РучнаяКорректировкаВыработки И НЕ Элементы.ВыработкаПлановая.Видимость;
	
	// Именование вкладки в зависимости План / Факт
	ЗаголовокГруппыВыработка = "Выработка - Факт";
	Если Элементы.ВыработкаПлановая.Видимость Тогда
		ЗаголовокГруппыВыработка = "Выработка - План";
	КонецЕсли;
	Элементы.ГруппаВыработка.Заголовок = ЗаголовокГруппыВыработка;
	
	// Расчет плановой выработки
	Если Элементы.ГруппаВыработка.Видимость И Элементы.ВыработкаПлановая.Видимость Тогда
		
		Форма.ВыработкаПлановая.Очистить();
		
		// Дата выработки по определенным документам: по аналогии модуля объекта при проведении
		// Если останется Неопределено, в функции РассчитатьВыработкуПоДокументу будет взята дата из документа, либо текущая дата (смотрит по заполненности)
		ДатаВыработки = Неопределено;
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Если //ПолучитьФункциональнуюОпцию("ИспользоватьСтатусЗакрытВЗаказеПокупателя") 
				Объект.СозданПриИспользованииСтатусаЗакрыт И Объект.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт Тогда
				ДатаВыработки = Объект.ДатаЗакрытия; //Расчёт по дате закрытия
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Монтаж") Тогда
			Если //Константы.ИспользоватьСтатусЗакрытВМонтаже.Получить()
				Объект.СозданПриИспользованииСтатусаЗакрыт И Объект.Результат = Справочники.РезультатыМонтажа.Закрыт Тогда
				ДатаВыработки = Объект.ДатаЗакрытия;
			КонецЕсли;
		КонецЕсли;
		
		НаборЗаписейПоВыработке = Зарплата.РассчитатьВыработкуПоДокументу(Объект.Ссылка, ДатаВыработки);
		
		Для Каждого СтрокаВыработки Из НаборЗаписейПоВыработке Цикл
			НоваяСтрока = Форма.ВыработкаПлановая.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыработки);
		КонецЦикла;
		
	КонецЕсли;
	
	//#9777
	Если Элементы.ГруппаВыработка.Видимость И НЕ Элементы.ВыработкаПлановая.Видимость Тогда
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Если Объект.РучнаяКорректировкаВыработки Тогда
				Если (Объект.СозданПриИспользованииСтатусаЗакрыт И Объект.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт)
					ИЛИ (НЕ Объект.СозданПриИспользованииСтатусаЗакрыт И Объект.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен)				
					Тогда
					//	
				Иначе
					Элементы.ГруппаВыработка.Заголовок = "Выработка - План";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Рассчитаем итог суммы выработки в зависимости от отображаемой таблицы
	СуммаВыработки = 0;
	Если Элементы.ГруппаВыработка.Видимость Тогда
		Если Элементы.ВыработкаПлановая.Видимость Тогда
			СуммаВыработки = Форма.ВыработкаПлановая.Итог("Стоимость");
		ИначеЕсли Элементы.Выработка.Видимость Тогда
			СуммаВыработки = РассчитатьСуммуВыработкиИтого(Объект.Ссылка);
		Иначе
			СуммаВыработки = Объект.Выработка.Итог("Стоимость");
		КонецЕсли;
	КонецЕсли;
	Форма.СуммаВыработки = СуммаВыработки;
	
КонецПроцедуры

Функция РассчитатьСуммуВыработкиИтого(ДокументСсылка)
	
	КВозврату = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектВыработки", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(Выработка.Стоимость), 0) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейПроизводства КАК Выработка
	|ГДЕ
	//++ #16535
	//|	Выработка.ОбъектВыработки = &ОбъектВыработки
	|	Выработка.Регистратор = &ОбъектВыработки
	//-- #16535
	|
	|СГРУППИРОВАТЬ ПО
	|	Выработка.ОбъектВыработки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВыработкаРозницы.Стоимость), 0)
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейРозницы КАК ВыработкаРозницы
	|ГДЕ
	//++ #16535
	//|	ВыработкаРозницы.ОбъектВыработки = &ОбъектВыработки
	|	ВыработкаРозницы.Регистратор = &ОбъектВыработки
	//-- #16535
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыработкаРозницы.ОбъектВыработки";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КВозврату = Выборка.Сумма;
	КонецЕсли;
	
	Возврат КВозврату;
	
КонецФункции

Функция ОпределитьНеобходимостьВыводаПлановойВыработкиПоДокументу(Объект)
	
	КВозврату = Ложь;
	
	Если Объект.Проведен Тогда
		// по монтажу и заказу плановую выработку в проведенном документе показываем в не закрытых статусах (если используется закрыт, тогда в не закрытом, иначе в не выполненном)
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Монтаж") Тогда
			Если Объект.ВидОперации = Справочники.ВидыМонтажа.Продажа Тогда //#16346
				КВозврату = Ложь;
			Иначе
				ИспользоватьСтатусЗакрытВМонтаже = Объект.СозданПриИспользованииСтатусаЗакрыт;
				Если (ИспользоватьСтатусЗакрытВМонтаже И НЕ Объект.Результат = Справочники.РезультатыМонтажа.Закрыт)
					ИЛИ (НЕ ИспользоватьСтатусЗакрытВМонтаже И НЕ Объект.Результат = Справочники.РезультатыМонтажа.Выполнен)					
					Тогда
					КВозврату = Истина;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ИспользоватьСтатусЗакрытВЗаказе = Объект.СозданПриИспользованииСтатусаЗакрыт;
			Если (ИспользоватьСтатусЗакрытВЗаказе И НЕ Объект.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт)
				ИЛИ (НЕ ИспользоватьСтатусЗакрытВЗаказе И НЕ Объект.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен)
				Тогда
				КВозврату = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КВозврату;
	
КонецФункции

Функция ВыработкаРасчетнаяИНачисленнаяСовпадают(ДокументСсылка, ДатаРасчетаВыработки) Экспорт
		
	СуммаНачисленная = РассчитатьСуммуВыработкиИтого(ДокументСсылка);

	НаборЗаписейПоВыработке = Зарплата.РассчитатьВыработкуПоДокументу(ДокументСсылка, ДатаРасчетаВыработки);	
	
	СуммаРасчетная = 0;
	Для Каждого СтрокаВыработки Из НаборЗаписейПоВыработке Цикл
		СуммаРасчетная = СуммаРасчетная + СтрокаВыработки.Стоимость;			
	КонецЦикла;
	
	Возврат Новый Структура("Результат, СуммаНачисленная, СуммаРасчетная", (СуммаНачисленная = СуммаРасчетная), СуммаНачисленная, СуммаРасчетная);
	
КонецФункции

#КонецОбласти		
		
#Область ПроцедурыИФункцииОбновленияИнформационнойБазы

Процедура ПереводСправочникаПроизводственныеОперацииВДокумент(ВерсияПрограммы) Экспорт
	
	// Сначала нужно подготовить список организаций, по которым будет установка выработки
	// Попробуем найти существующие с видом расчёта "Выпуск продукции"
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	УстановкаСтоимостиВыработкиПоНоменклатуре.Организация КАК Организация
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК УстановкаСтоимостиВыработкиПоНоменклатуре
	|ГДЕ
	|	НЕ УстановкаСтоимостиВыработкиПоНоменклатуре.ПометкаУдаления
	|   И УстановкаСтоимостиВыработкиПоНоменклатуре.ВидДокументаРасчета = Значение(Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции)";
	
	СписокОрганизаций = Запрос.Выполнить().Выгрузить();
	
	// Если документов с видом расчета выпуск не нашлось, возьмем все организации
	Если СписокОрганизаций.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления";
		СписокОрганизаций = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроизводственныеОперации.Ссылка
	|ИЗ
	|	Справочник.ПроизводственныеОперации КАК ПроизводственныеОперации
	|ГДЕ
	|	НЕ ПроизводственныеОперации.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// На каждую производственную операцию
	Пока Выборка.Следующий() Цикл
		
		// Нужно разделить:
		//	- на потолок:
		//		- однофактурный
		//		- многофактурный
		//		(если цены различаются)
		//  - на отрез
		
		МассивПотолковОдинаковыеЦены = новый Массив;
		МассивПотолковОднофактурныеЦены = новый Массив;
		МассивПотолковМногофактурныеЦены = новый Массив;
		МассивОтрезовЦены = новый Массив;
		
		Для Каждого ТекущаяСтрока Из Выборка.Ссылка.УДАЛИТЬ_СписокНоменклатуры Цикл
			
			// Потолок
			// Смотрим что заполнена одна из цен
			Если НЕ ТекущаяСтрока.СтоимостьВыработкиПотолок = 0 ИЛИ НЕ ТекущаяСтрока.СтоимостьВыработкиМногофактурныйПотолок = 0 Тогда
				
				// Цены одинаковые
				Если ТекущаяСтрока.СтоимостьВыработкиПотолок = ТекущаяСтрока.СтоимостьВыработкиМногофактурныйПотолок Тогда
					НоваяСтрока = новый Структура("ВидНоменклатуры, Номенклатура, ПоВыработке, СтоимостьСуммой"); // на каждую строку переопределяем новую строку
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
					НоваяСтрока.ПоВыработке = ТекущаяСтрока.КоличествоПоВыработке;
					НоваяСтрока.СтоимостьСуммой = ТекущаяСтрока.СтоимостьВыработкиПотолок;
					МассивПотолковОдинаковыеЦены.Добавить(НоваяСтрока);
				Иначе	
					Если ТекущаяСтрока.СтоимостьВыработкиПотолок > 0 Тогда
						НоваяСтрока = новый Структура("ВидНоменклатуры, Номенклатура, ПоВыработке, СтоимостьСуммой"); // на каждую строку переопределяем новую строку
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
						НоваяСтрока.ПоВыработке = ТекущаяСтрока.КоличествоПоВыработке;
						НоваяСтрока.СтоимостьСуммой = ТекущаяСтрока.СтоимостьВыработкиПотолок;
						МассивПотолковОднофактурныеЦены.Добавить(НоваяСтрока);
					КонецЕсли;	
					Если ТекущаяСтрока.СтоимостьВыработкиМногофактурныйПотолок > 0 Тогда
						НоваяСтрока = новый Структура("ВидНоменклатуры, Номенклатура, ПоВыработке, СтоимостьСуммой"); // на каждую строку переопределяем новую строку
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
						НоваяСтрока.ПоВыработке = ТекущаяСтрока.КоличествоПоВыработке;
						НоваяСтрока.СтоимостьСуммой = ТекущаяСтрока.СтоимостьВыработкиМногофактурныйПотолок;
						МассивПотолковМногофактурныеЦены.Добавить(НоваяСтрока);
					КонецЕсли;
				КонецЕсли;	
				
			КонецЕсли;
			
			// Отрез
			// Смотрим что заполнена цена
			Если НЕ ТекущаяСтрока.СтоимостьВыработкиОтрез = 0 Тогда
				
				НоваяСтрока = новый Структура("ВидНоменклатуры, Номенклатура, ПоВыработке, СтоимостьСуммой");
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				НоваяСтрока.ПоВыработке = ТекущаяСтрока.КоличествоПоВыработке;
				НоваяСтрока.СтоимостьСуммой = ТекущаяСтрока.СтоимостьВыработкиОтрез;
				
				МассивОтрезовЦены.Добавить(НоваяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		МассивДокументовКСозданию = новый Массив;
		
		// Если были одинаковые цены на одно и много фактурные потолки
		Если МассивПотолковОдинаковыеЦены.Количество() > 0 Тогда
			// Два случая:
			//	- если все позиции по потолкам были одинаковыми, то по ним будет создан один документ
			//  - если были разные цены, то с массива одинаковых цен, нужно перенести позиции в массивы Однофактурный и Многофактурный, потому что на массив одинаковых цен документа уже не будет
			Если МассивПотолковОднофактурныеЦены.Количество() = 0 И МассивПотолковМногофактурныеЦены.Количество() = 0 Тогда
				МассивДокументовКСозданию.Добавить(новый Структура("ОднофактурныйПотолок, МногофактурныйПотолок, ВидНоменклатурыПотолка, Позиции", Истина, Истина, Справочники.ВидыНоменклатуры.Потолок, МассивПотолковОдинаковыеЦены));
			Иначе
				Для Каждого Позиция Из МассивПотолковОдинаковыеЦены Цикл
					МассивПотолковОднофактурныеЦены.Добавить(Позиция);
					МассивПотолковМногофактурныеЦены.Добавить(Позиция);
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;
		
		Если МассивПотолковОднофактурныеЦены.Количество() > 0 Тогда
			МассивДокументовКСозданию.Добавить(новый Структура("ОднофактурныйПотолок, ВидНоменклатурыПотолка, Позиции", Истина, Справочники.ВидыНоменклатуры.Потолок, МассивПотолковОднофактурныеЦены));
		КонецЕсли;
		
		Если МассивПотолковМногофактурныеЦены.Количество() > 0 Тогда
			МассивДокументовКСозданию.Добавить(новый Структура("МногофактурныйПотолок, ВидНоменклатурыПотолка, Позиции", Истина, Справочники.ВидыНоменклатуры.Потолок, МассивПотолковМногофактурныеЦены));
		КонецЕсли;
		
		Если МассивОтрезовЦены.Количество() > 0 Тогда
			МассивДокументовКСозданию.Добавить(новый Структура("ВидНоменклатурыПотолка, Позиции", Справочники.ВидыНоменклатуры.Отрез, МассивОтрезовЦены));
		КонецЕсли;
		
		// Создаем документы установки выработки
		// На каждую организацию
		Для Каждого ТекущаяОрганизация Из СписокОрганизаций Цикл
			
			Для Каждого ТекущаяСтрока Из МассивДокументовКСозданию Цикл
				
				ШаблонКомментария = "#Создан при обновлении на 2.0.3.0 по справочнику производственная операция %1 %2 #";
				
				ДокументОбъект = Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.СоздатьДокумент();
				ДокументОбъект.Дата = Дата(2001, 01, 01);
				ЗаполнитьЗначенияСвойств(ДокументОбъект, ТекущаяСтрока);
				ДокументОбъект.ПроизводственнаяОперация = Выборка.Ссылка;
				ДокументОбъект.ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции;
				ДокументОбъект.ВидИсполнителя = Справочники.ВидыИсполнителей.СотрудникПроизводства;
				ДокументОбъект.Комментарий = СтрШаблон(ШаблонКомментария, Выборка.Ссылка.Наименование, Выборка.Ссылка.Код);
				ДокументОбъект.Организация = ТекущаяОрганизация.Организация;
				
				Для Каждого СтрокаЦены Из ТекущаяСтрока.Позиции Цикл
					
					// Возможно два варианта, только номенклатура либо только вид номенклатуры
					
					// Это только вид номенклатуры
					Если СтрокаЦены.Номенклатура.Пустая() Тогда
						
						НоваяСтрокаТЧ = ДокументОбъект.ВыработкаПоВидамНоменклатуры.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаЦены);
						
					Иначе // Только номенклатура
						
						НоваяСтрокаТЧ = ДокументОбъект.ВыработкаПоНоменклатуре.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаЦены);
						
					КонецЕсли;
					
				КонецЦикла;	
				
				Попытка
					ДокументОбъект.Записать();
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ОбновлениеИнформационнойБазыПотолки.ПоместитьВРегистрКОбработке(ВерсияПрограммы, ДокументОбъект.Ссылка, ДокументОбъект.Дата);
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры	

//++ №14932
Процедура ОпределитьНастройкиВидовНоменклатурыКакПродукция(УчитыватьНастройкуМатериалов = Ложь) Экспорт
	
	СхемаКД = ПолучитьОбщийМакет("СхемаНастроекПоНоменклатуреКПроизводству");
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКД)); 
	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКД.НастройкиПоУмолчанию);
	
	СписокВидовНоменклатуры = новый СписокЗначений;
	СписокВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Потолок);
	СписокВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Отрез);
	СписокВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Продукция);
	
	// при обновлении учитываем настройку по товарам и материалам
	Если УчитыватьНастройкуМатериалов И Константы.УДАЛИТЬ_ЗаказыватьТоварыПриОформленииЗаказаНаПроизводствоНаОснованииЗаказаПокупа.Получить() Тогда
		СписокВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Материал);
	КонецЕсли;
	
	ИдентификаторПользовательскойНастройки = "";
	Для Каждого ТекущийОтбор Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если ТипЗнч(ТекущийОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущийОтбор.ЛевоеЗначение = новый ПолеКомпоновкиДанных("ВидНоменклатуры") Тогда
			ИдентификаторПользовательскойНастройки = ТекущийОтбор.ИдентификаторПользовательскойНастройки;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИдентификаторПользовательскойНастройки) Тогда
		
		ПользовательскийОтбор = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
		
		Если НЕ ПользовательскийОтбор = Неопределено Тогда
			
			ПользовательскийОтбор.Использование 	= Истина;
			ПользовательскийОтбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
			ПользовательскийОтбор.ПравоеЗначение 	= СписокВидовНоменклатуры;
			
			Константы.НастройкиКомпоновкиПоНоменклатуреКПроизводству.Установить(новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки()));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//-- №14932

#КонецОбласти

#Область ПроцедурыИФункцииРМК

// Заполняет таблицу оплат по ключу связи.
//
// Параметры:
//  РезультатОткрытияФормы - Структура.
//  Организация - СправочникСсылка.Организации.
//  КлючСвязиТПЧеков - Число.
//  Объект - ДанныеФормаКоллекция.
//
Процедура ДобавитьТаблицуОплат(РезультатОткрытияФормы, Организация, КлючСвязиТПЧеков, Объект) Экспорт
	
	Если РезультатОткрытияФормы.Свойство("Телефон") Тогда
		Объект.Телефон = РезультатОткрытияФормы.Телефон;
	КонецЕсли;
	
	Если РезультатОткрытияФормы.Свойство("Email") Тогда
		Объект.АдресЭП = РезультатОткрытияФормы.Email;
	КонецЕсли;
	
	Если РезультатОткрытияФормы.Свойство("Контрагент") Тогда
		Объект.Контрагент = РезультатОткрытияФормы.Контрагент;
	КонецЕсли;
	
	//Если РезультатОткрытияФормы.Свойство("СохранятьТелефонEmail") Тогда
	//	Если ЗначениеЗаполнено(Объект.Телефон) Тогда
	//		ПодключаемоеОборудованиеРТ.ЗаписатьТелефонВИнформационнуюКарту(Объект.ДисконтнаяКарта, Объект.Телефон);
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(Объект.АдресЭП) Тогда
	//		ПодключаемоеОборудованиеРТ.ЗаписатьEmailВИнформационнуюКарту(Объект.ДисконтнаяКарта, Объект.АдресЭП);
	//	КонецЕсли;
	//Иначе
	//	Если ЗначениеЗаполнено(Объект.Телефон) Тогда
	//		ПодключаемоеОборудованиеРТ.УдалитьТелефонИзИнформационнойКарты(Объект.ДисконтнаяКарта, Объект.Телефон);
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(Объект.АдресЭП) Тогда
	//		ПодключаемоеОборудованиеРТ.УдалитьEmailИзИнформационнойКарты(Объект.ДисконтнаяКарта, Объект.АдресЭП);
	//	КонецЕсли;
	//КонецЕсли;
	
	АдресТаблицы = РезультатОткрытияФормы.АдресТаблицыОплата;
	
	Если КлючСвязиТПЧеков = Неопределено Тогда
		Объект.Оплата.Очистить();
	Иначе
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("КлючСвязиТПЧеков", КлючСвязиТПЧеков);
		
		СтрокиОплаты = Объект.Оплата.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаОплаты Из СтрокиОплаты Цикл
			Объект.Оплата.Удалить(СтрокаОплаты);
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаОплаты = ПолучитьИзВременногоХранилища(АдресТаблицы);
	
	Для Каждого СтрокаОплаты Из ТаблицаОплаты Цикл
		НоваяСтрокаОплата = Объект.Оплата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОплата, СтрокаОплаты);
		Если Не КлючСвязиТПЧеков = Неопределено Тогда
			НоваяСтрокаОплата.КлючСвязиТПЧеков = КлючСвязиТПЧеков;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет таблицу значений "ТабличноеПолеЧеков" и устанавливает КлючСвязи.
//
// Параметры:
//  ТабличноеПолеЧеков - ТаблицаЗначений.
//  Объект - ДанныеФормаКоллекция.
//  СтруктураДанных - Структура.
//  АдресТаблицыЧеков - Строка.
//
Процедура ЗаполнитьТаблицуЧеков(ТабличноеПолеЧеков, Объект, СтруктураДанных, АдресТаблицыЧеков) Экспорт
	
	СуммаОстаткаДокументаРасчета = СтруктураДанных.СуммаОстаткаДокументаРасчета;
	УникальныйИдентификатор      = СтруктураДанных.УникальныйИдентификатор;
	ТаблицаКассККМОрганизаций    = СтруктураДанных.ТаблицаКассККМОрганизаций;
	
	ТабличноеПолеЧеков.Очистить();
	
	Если Объект.ОперацияСДенежнымиСредствами 
		И Объект.Товары.Количество() = 0 
		И Объект.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
		
		СтрокаТаблицыЧеков = ТабличноеПолеЧеков.Добавить();
		СтрокаТаблицыЧеков.Организация = ТаблицаКассККМОрганизаций[0].Организация;
		СтрокаТаблицыЧеков.Сумма = СуммаОстаткаДокументаРасчета;
		СтрокаТаблицыЧеков.ДоговорКонтрагента = Объект.ДоговорКонтрагента;
		КассаККМСтрокиТаблицыЧеков = ТаблицаКассККМОрганизаций[0].КассаККМ;
		
		//СтрокаТаблицыЧеков.ВидНалога = ПодключаемоеОборудованиеРТ.ПолучитьСистемуНалогообложения(
		//	ОбщегоНазначения.ТекущаяДатаПользователя(),
		//	СтрокаТаблицыЧеков.Организация,
		//	Объект.Магазин,
		//	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Магазин, "Склад"));
		
		СтрокаТаблицыЧеков.КассаККМ = КассаККМСтрокиТаблицыЧеков;
		
		Объект.Организация = СтрокаТаблицыЧеков.Организация;
		
	ИначеЕсли Объект.ОперацияСДенежнымиСредствами 
		И Объект.Товары.Количество() = 0 
		И НЕ ЗначениеЗаполнено(Объект.ДокументРасчета) Тогда
		
		СтрокаТаблицыЧеков = ТабличноеПолеЧеков.Добавить();
		СтрокаТаблицыЧеков.Организация = ТаблицаКассККМОрганизаций[0].Организация;
		СтрокаТаблицыЧеков.Сумма = 0;
		СтрокаТаблицыЧеков.ДоговорКонтрагента = Объект.ДоговорКонтрагента;
		КассаККМСтрокиТаблицыЧеков = ТаблицаКассККМОрганизаций[0].КассаККМ;
		
		//СтрокаТаблицыЧеков.ВидНалога = ПодключаемоеОборудованиеРТ.ПолучитьСистемуНалогообложения(
		//	ОбщегоНазначения.ТекущаяДатаПользователя(),
		//	СтрокаТаблицыЧеков.Организация,
		//	Объект.Магазин,
		//	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Магазин, "Склад"));
		
		СтрокаТаблицыЧеков.КассаККМ = КассаККМСтрокиТаблицыЧеков;
		
		Объект.Организация = СтрокаТаблицыЧеков.Организация;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаВЗапросе.Организация КАК Организация,
		|	ТаблицаВЗапросе.Сумма КАК Сумма,
		//|	ТаблицаВЗапросе.ВидНалога КАК ВидНалога,
		|	ТаблицаВЗапросе.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ПОМЕСТИТЬ ТаблицаВЗапросе
		|ИЗ
		|	&Товары КАК ТаблицаВЗапросе
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаВзапросе.Организация КАК Организация,
		//|	ТаблицаВзапросе.ВидНалога КАК ВидНалога,
		|	ТаблицаВзапросе.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СУММА(ТаблицаВзапросе.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ТаблицаЧеков
		|ИЗ
		|	ТаблицаВЗапросе КАК ТаблицаВзапросе
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаВзапросе.Организация,
		//|	ТаблицаВзапросе.ВидНалога,
		|	ТаблицаВзапросе.ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаКассККМОрганизаций.Организация КАК Организация,
		|	ТаблицаКассККМОрганизаций.КассаККМ КАК КассаККМ
		|ПОМЕСТИТЬ ТаблицаКассККМОрганизаций
		|ИЗ
		|	&ТаблицаКассККМОрганизаций КАК ТаблицаКассККМОрганизаций
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОрганизаций.Ссылка КАК Организация,
		|	ТаблицаОрганизаций.СистемаНалогообложения КАК СистемаНалогообложения
		|ПОМЕСТИТЬ ТаблицаОрганизаций
		|ИЗ
		|	Справочник.Организации КАК ТаблицаОрганизаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЧеков.Организация КАК Организация,
		|	ТаблицаОрганизаций.СистемаНалогообложения КАК ВидНалога,
		|	ТаблицаЧеков.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТаблицаЧеков.Сумма КАК Сумма,
		|	ТаблицаКассККМОрганизаций.КассаККМ КАК КассаККМ
		|ИЗ
		|	ТаблицаЧеков КАК ТаблицаЧеков
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКассККМОрганизаций КАК ТаблицаКассККМОрганизаций
		|		ПО ТаблицаЧеков.Организация = ТаблицаКассККМОрганизаций.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОрганизаций КАК ТаблицаОрганизаций
		|		ПО ТаблицаЧеков.Организация = ТаблицаОрганизаций.Организация";
		
		Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
		Запрос.УстановитьПараметр("ТаблицаКассККМОрганизаций", ТаблицаКассККМОрганизаций.Выгрузить());
		
		Результат = Запрос.Выполнить();
		ТаблицаЗапроса = Результат.Выгрузить();
		
		ТабличноеПолеЧеков.Загрузить(ТаблицаЗапроса);
		
		Если ТаблицаКассККМОрганизаций.Количество() = 1 Тогда
			
			ОрганизацияДляЧеков = ТаблицаКассККМОрганизаций[0].Организация;
			КассаККМДляЧеков = ТаблицаКассККМОрганизаций[0].КассаККМ;
			
			СтрокиТПЧековДляУдаления = Новый Массив();
			
			Для Каждого СтрокаТаблицыЧеков Из ТабличноеПолеЧеков Цикл
				
				Если СтрокаТаблицыЧеков.КассаККМ <> КассаККМДляЧеков ИЛИ СтрокаТаблицыЧеков.Организация <> ОрганизацияДляЧеков Тогда
					СтруктураПоискаТовары = Новый Структура();
					СтруктураПоискаТовары.Вставить("Организация", СтрокаТаблицыЧеков.Организация);
					СтрокиТовары = Объект.Товары.НайтиСтроки(СтруктураПоискаТовары);
					Для Каждого СтрокаТовары Из СтрокиТовары Цикл
						СтрокаТовары.Организация = ОрганизацияДляЧеков;
					КонецЦикла;
					СтрокиТПЧековДляУдаления.Добавить(СтрокаТаблицыЧеков);
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого СтрокаДляУдаления Из СтрокиТПЧековДляУдаления Цикл
				ТабличноеПолеЧеков.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//ОбработкаТабличнойЧастиТоварыСервер.ЗаполнитьОрганизациюВСериях(Объект.Товары, Объект.Серии);
	//
	ТабличноеПолеЧековДляПередачиВФормуОплат = ТабличноеПолеЧеков.Выгрузить(Новый Массив());
	КЧ70 = Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Неотрицательный);
	ТабличноеПолеЧековДляПередачиВФормуОплат.Колонки.Добавить("КлючСвязиТПЧеков", Новый ОписаниеТипов("Число", КЧ70));
	
	Для Каждого СтрокаТП Из ТабличноеПолеЧеков Цикл
		НоваяСтрокаДляПередачи = ТабличноеПолеЧековДляПередачиВФормуОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДляПередачи, СтрокаТП);
		НоваяСтрокаДляПередачи.КлючСвязиТПЧеков = СтрокаТП.ПолучитьИдентификатор();
	КонецЦикла;
	
	АдресТаблицыЧеков = ПоместитьВоВременноеХранилище(ТабличноеПолеЧековДляПередачиВФормуОплат, УникальныйИдентификатор);
	
	Если Объект.Оплата.Количество() > 0 И ТабличноеПолеЧеков.Количество() > 0 Тогда
		ПервыйИдентификатор = ТабличноеПолеЧеков[0].ПолучитьИдентификатор();
		Для Каждого СтрокаОплаты Из Объект.Оплата Цикл
			СтрокаОплаты.КлючСвязиТПЧеков = ПервыйИдентификатор;
			ПервыйИдентификатор = ПервыйИдентификатор + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Помещает во временное хранилище таблицу объекта.
//
// Параметры:
//  ИмяТаблицы - Строка.
//  Объект - ДанныеФормаКоллекция.
//  УникальныйИдентификатор - УникальныйИдентификатор.
//
// Возвращаемое значение:
//  ВозвращаемыйАдрес - Строка.
//
Функция АдресВХранилище(ИмяТаблицы, Объект, УникальныйИдентификатор) Экспорт
	
	ВозвращаемыйАдрес = "";
	
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		ВозвращаемыйАдрес = ПоместитьВоВременноеХранилище(Объект[ИмяТаблицы].Выгрузить(), УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат ВозвращаемыйАдрес;
	
КонецФункции

// Очищает табличные части в переданном объекте.
//
Процедура ОчиститьТабличныеЧастиРМК(ОбъектОчистки, УправляемыеСкидки) Экспорт
	
	ОбъектОчистки.Оплата.Очистить();
	//ОбъектОчистки.ОплатаБонуснымиБаллами.Очистить();
	ОбъектОчистки.Товары.Очистить();
	//ОбъектОчистки.СерийныеНомера.Очистить();
	//ОбъектОчистки.Серии.Очистить();
	//ОбъектОчистки.СерииПодарков.Очистить();
	//ОбъектОчистки.Подарки.Очистить();
	//ОбъектОчистки.ПогашениеПодарочныхСертификатов.Очистить();
	//ОбъектОчистки.СкидкиНаценки.Очистить();
	//ОбъектОчистки.УправляемыеСкидки.Очистить();
	//ОбъектОчистки.АкцизныеМарки.Очистить();
	//ОбъектОчистки.КодыМаркировки.Очистить();
	
	УправляемыеСкидки.Очистить();
	
КонецПроцедуры

// Настройка доступности отдельных элементов формы РМК.
//
Процедура УстановитьДоступностьОтдельныхЭлементовФормы(БазовоеИмяЭлемента, Доступность, ЭлементыФормы) Экспорт 
	
	УстановитьДоступностьЭлементаФормы(БазовоеИмяЭлемента, Доступность, ЭлементыФормы);
	
	ТекущееИмяЭлемента = "Программно" + БазовоеИмяЭлемента;
	УстановитьДоступностьЭлементаФормы(ТекущееИмяЭлемента, Доступность, ЭлементыФормы);
	
	ТекущееИмяЭлемента = БазовоеИмяЭлемента + "Акселераторы";
	УстановитьДоступностьЭлементаФормы(ТекущееИмяЭлемента, Доступность, ЭлементыФормы);
	
	ТекущееИмяЭлемента = "Программно" + БазовоеИмяЭлемента + "Акселераторы";
	УстановитьДоступностьЭлементаФормы(ТекущееИмяЭлемента, Доступность, ЭлементыФормы);
	
	БазовоеИмяЭлемента = СтрЗаменить(БазовоеИмяЭлемента, "Команда", "Картинка");
	УстановитьДоступностьЭлементаФормы(БазовоеИмяЭлемента, Доступность, ЭлементыФормы);
	
	ТекущееИмяЭлемента = "Программно" + БазовоеИмяЭлемента;
	УстановитьДоступностьЭлементаФормы(ТекущееИмяЭлемента, Доступность, ЭлементыФормы);
	
	ТекущееИмяЭлемента = БазовоеИмяЭлемента + "Акселераторы";
	УстановитьДоступностьЭлементаФормы(ТекущееИмяЭлемента, Доступность, ЭлементыФормы);
	
	ТекущееИмяЭлемента = "Программно" + БазовоеИмяЭлемента + "Акселераторы";
	УстановитьДоступностьЭлементаФормы(ТекущееИмяЭлемента, Доступность, ЭлементыФормы);
	
КонецПроцедуры

// Настройка доступности элемента формы РМК.
//
Процедура УстановитьДоступностьЭлементаФормы(ИмяЭлемента, Доступность, Элементы)
	
	Если ОбщийМодульКлиентСервер.ПроверитьНаличиеЭлементаФормы(Элементы, ИмяЭлемента) Тогда
		Элемент = Элементы[ИмяЭлемента];
		Элемент.Доступность = Доступность;
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			Для каждого ПодЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
				УстановитьДоступностьЭлементаФормы(ПодЭлемент.Имя, Доступность, Элементы)
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет документ ЧекККМ данными.
//
Процедура ЗаполнитьЧекПоВсемДанным(ОбъектЧекККМ, Объект, УправляемыеСкидки, ОтбиратьПоОрганизации, ТабличноеПолеЧеков) Экспорт 
	
	ЗаполнитьЗначенияСвойств(ОбъектЧекККМ, Объект,,"Ссылка, Дата");
	ОбъектЧекККМ.ВидЦен = Объект.ВидЦены;
	ОбъектЧекККМ.Склад  = ОбъектЧекККМ.Магазин.Склад;
	ОбъектЧекККМ.Валюта = Объект.Валюта;
	
	// Статьи в зависимости от операции
	Если ОбъектЧекККМ.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа Тогда
		ОбъектЧекККМ.Статья = Объект.НастройкаРМК.СтатьяДДСПриПродаже;
		ОбъектЧекККМ.СтатьяДоходов = Объект.НастройкаРМК.СтатьяДоходов;
	Иначе
		ОбъектЧекККМ.Статья = Объект.НастройкаРМК.СтатьяДДСПриВозврате;
		ОбъектЧекККМ.СтатьяРасходов = Объект.НастройкаРМК.СтатьяРасходов;
	КонецЕсли;
	
	Если ТабличноеПолеЧеков.Количество() > 0 Тогда
		//ОбъектЧекККМ.ДоговорКонтрагента = ТабличноеПолеЧеков[0].ДоговорКонтрагента;
		ОбъектЧекККМ.СистемаНалогообложения = ТабличноеПолеЧеков[0].ВидНалога;
	КонецЕсли;
	
	ЗагрузитьВТаблицуЗначений(Объект.Товары , ОбъектЧекККМ.Товары, Истина);
	//ЗагрузитьВТаблицуЗначений(Объект.Подарки , ОбъектЧекККМ.Подарки, Истина);
	//ЗагрузитьВТаблицуЗначений(Объект.СкидкиНаценки , ОбъектЧекККМ.СкидкиНаценки, Истина);
	//ЗагрузитьВТаблицуЗначений(Объект.СерийныеНомера , ОбъектЧекККМ.СерийныеНомера, Истина);
	//ЗагрузитьВТаблицуЗначений(Объект.Серии , ОбъектЧекККМ.Серии, Истина);
	//ЗагрузитьВТаблицуЗначений(Объект.СерииПодарков , ОбъектЧекККМ.СерииПодарков, Истина);
	ЗагрузитьВТаблицуЗначений(Объект.Оплата , ОбъектЧекККМ.Оплата, Истина);
	//ЗагрузитьВТаблицуЗначений(
	//	Объект.ПогашениеПодарочныхСертификатов, ОбъектЧекККМ.ПогашениеПодарочныхСертификатов, Истина);
	//ЗагрузитьВТаблицуЗначений(
	//	Объект.БонусныеБаллыКНачислению , ОбъектЧекККМ.БонусныеБаллыКНачислению, Истина);
	//ЗагрузитьВТаблицуЗначений(Объект.АкцизныеМарки , ОбъектЧекККМ.АкцизныеМарки, Истина);
	//ЗагрузитьВТаблицуЗначений(Объект.КодыМаркировки , ОбъектЧекККМ.КодыМаркировки, Истина);
	//ЗагрузитьВТаблицуЗначений(
	//	Объект.ПредъявленныеКодыОднократныхСкидок, ОбъектЧекККМ.ПредъявленныеКодыОднократныхСкидок, Истина);
	
	//ЗаполнитьУправляемыеСкидки(ОбъектЧекККМ, УправляемыеСкидки);
	//ДобавитьОплатуБонусамиВЧек(Объект, ОбъектЧекККМ, ОтбиратьПоОрганизации);
	
КонецПроцедуры

// Заполняет в документе ЧекККМ табличную часть УправляемыеСкидки.
//
Процедура ЗаполнитьУправляемыеСкидки(ОбъектЧекККМ, УправляемыеСкидки) Экспорт 
	
	//ОбъектЧекККМ.УправляемыеСкидки.Очистить();
	//
	//Для каждого ЭлементСписка Из УправляемыеСкидки Цикл
	//	СкидкаНаценка = УправляемыеСкидки[0].Значение;
	//	СтрокаТаблица = ОбъектЧекККМ.УправляемыеСкидки.Добавить();
	//	СтрокаТаблица.СкидкаНаценка = СкидкаНаценка;
	//КонецЦикла;
	
КонецПроцедуры

// Получает массив реквизтов ключей.
//
// Параметры:
//  ИмяРеквизитаКлюча - Строка.
//  СтруктураПоиска - Структура.
//  Объект - ДанныеФормаКоллекция.
//
// Возвращаемое значение:
//  Массив - массив значений с реквизитами ключей.
//
Функция ПолучитьМассивКлючей(ИмяРеквизитаКлюча, СтруктураПоиска, Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТовары." + ИмяРеквизитаКлюча + " КАК РеквизитКлюча
	|	&ДополнительныеПоляВыборки
	|ПОМЕСТИТЬ ТаблицаВЗапросе
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВЗапросе.РеквизитКлюча
	|ИЗ
	|	ТаблицаВЗапросе КАК ТаблицаВЗапросе
	|ГДЕ
	|	&ФразаГде";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", Объект.Товары.Выгрузить());
	
	ФразаГде = "";
	ДополнительныеПоляВыборки = "";
	Для Каждого ПолеПоиска Из СтруктураПоиска Цикл
		
		ДополнительныеПоляВыборки = ДополнительныеПоляВыборки + ", ТаблицаТовары." + ПолеПоиска.Ключ;
		
		Если Не ФразаГде = "" Тогда
			ФразаГде = ФразаГде + " и ";
		КонецЕсли;
		
		ФразаГде = ФразаГде + "ТаблицаВЗапросе." + ПолеПоиска.Ключ + " = &Параметр" + ПолеПоиска.Ключ;
		
		Запрос.УстановитьПараметр("Параметр" + ПолеПоиска.Ключ, ПолеПоиска.Значение);
		
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФразаГде", ФразаГде);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеПоляВыборки", ДополнительныеПоляВыборки);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗапроса = Результат.Выгрузить();
	
	Возврат ТаблицаЗапроса.ВыгрузитьКолонку("РеквизитКлюча");
	
КонецФункции

// Помещает во временное хранилище таблицу печатных форм.
//
// Параметры:
//  МассивСсылокЧеков - Массив.
//  АдресТаблицыПечатныхФорм - Строка.
//  ПриВозвратеРаспечатыватьПакетДокументов - Булево.
//  ОперацияСДенежнымиСредствами - Булево.
//  УникальныйИдентификатор - УникальныйИдентификатор.
//
Процедура ЗаполнитьАдресТаблицыПечатныхФорм(МассивСсылокЧеков, 
	АдресТаблицыПечатныхФорм, 
	ПриВозвратеРаспечатыватьПакетДокументов,
	ОперацияСДенежнымиСредствами,
	УникальныйИдентификатор) Экспорт
	
	ТаблицаПечатныхФорм = УправлениеПечатью.КомандыПечатиФормы("Документ.ЧекККМ.Форма.ФормаДокумента");
	
	Если ЗначениеЗаполнено(АдресТаблицыПечатныхФорм) Тогда
		УдалитьИзВременногоХранилища(АдресТаблицыПечатныхФорм);
	КонецЕсли;
	
	ЕстьВозврат = Ложь;
	Если НЕ ПриВозвратеРаспечатыватьПакетДокументов Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЧекККМ.Ссылка
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|ГДЕ
		|	ЧекККМ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
		|	И ЧекККМ.Ссылка В(&МассивСсылокЧеков)";
		
		Запрос.УстановитьПараметр("МассивСсылокЧеков", МассивСсылокЧеков);
		Результат = Запрос.Выполнить();
		ЕстьВозврат = НЕ Результат.Пустой();
	КонецЕсли;
	
	ЕстьСерии = Ложь;
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ЧекККМСерии.Ссылка КАК Ссылка,
	//	|	ЧекККМСерии.Серия КАК Серия
	//	|ИЗ
	//	|	Документ.ЧекККМ.Серии КАК ЧекККМСерии
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	//	|		ПО ЧекККМСерии.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	//	|ГДЕ
	//	|	ЧекККМСерии.Ссылка В(&МассивСсылокЧеков)
	//	|	И ВидыНоменклатуры.НастройкаИспользованияСерий = ЗНАЧЕНИЕ(Перечисление.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара)
	//	|	И ВидыНоменклатуры.СрокГарантии > 0";
	//	
	//	Запрос.УстановитьПараметр("МассивСсылокЧеков", МассивСсылокЧеков);
	//	Результат = Запрос.Выполнить();
	//	ЕстьСерии = НЕ Результат.Пустой();
	//	
	//КонецЕсли;
	
	//Если НЕ ЕстьВозврат Тогда
	//	УдалитьСтрокуВТаблицеПечатныхФорм(ТаблицаПечатныхФорм, "КМ3", "Идентификатор")
	//КонецЕсли;
	//
	//Если НЕ ЕстьСерии Тогда
	//	УдалитьСтрокуВТаблицеПечатныхФорм(ТаблицаПечатныхФорм, "ГарантийныйТалон", "Идентификатор")
	//КонецЕсли;
	
	//Если ОперацияСДенежнымиСредствами Тогда 
	//	УдалитьСтрокуВТаблицеПечатныхФорм(ТаблицаПечатныхФорм, "ТоварныйЧек", "Идентификатор");
	//	УдалитьСтрокуВТаблицеПечатныхФорм(ТаблицаПечатныхФорм, "ТоварныйЧекДляПД", "Идентификатор");
	//	УдалитьСтрокуВТаблицеПечатныхФорм(ТаблицаПечатныхФорм, "ТоварныйЧекДляФР", "Идентификатор");
	//КонецЕсли;
	
	АдресТаблицыПечатныхФорм = ПоместитьВоВременноеХранилище(ТаблицаПечатныхФорм, УникальныйИдентификатор);
	
КонецПроцедуры

// Проверяет заполнение табличных частей перед началом оплаты.
//
// Параметры:
//  Отказ - Булево.
//  ПараметрыИнформации - Структура.
//  СтруктураДанных - Структура.
//  Объект - ДанныеФормаКоллекция.
//  ОплатаТолькоНаличными - Булево.
//
Процедура ПроверитьЗаполнениеТабличнойЧасти(Отказ, ПараметрыИнформации, Объект) Экспорт 
	
	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	Товары.Количество,
	|	Товары.Сумма,
	|	Товары.НомерСтроки,
	|	Товары.Склад
	|ПОМЕСТИТЬ ТаблицаВЗапросе
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаВЗапросе.НомерСтроки,
	|	ТаблицаВЗапросе.Номенклатура,
	|	ТаблицаВЗапросе.Характеристика,
	|	ТаблицаВЗапросе.Количество,
	|	ТаблицаВЗапросе.Сумма,
	|	ТаблицаВЗапросе.Склад,
	|	ВЫБОР
	|		КОГДА ТаблицаВЗапросе.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТаблицаВЗапросе.Количество = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаКоличество,
	|	ВЫБОР
	|		КОГДА ТаблицаВЗапросе.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) И (ТаблицаВЗапросе.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаСклада
	|ПОМЕСТИТЬ ТаблицаСОшибками
	|ИЗ
	|	ТаблицаВЗапросе КАК ТаблицаВЗапросе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСОшибками.Номенклатура,
	|	ТаблицаСОшибками.Характеристика,
	|	ТаблицаСОшибками.Количество,
	|	ТаблицаСОшибками.Сумма,
	|	ТаблицаСОшибками.НомерСтроки,
	|	ТаблицаСОшибками.ОшибкаНоменклатуры,
	|	ТаблицаСОшибками.ОшибкаКоличество,
	|	ТаблицаСОшибками.Склад,
	|	ТаблицаСОшибками.ОшибкаСклада
	|ИЗ
	|	ТаблицаСОшибками КАК ТаблицаСОшибками
	|ГДЕ
	|	(ТаблицаСОшибками.ОшибкаНоменклатуры
	|			ИЛИ ТаблицаСОшибками.ОшибкаКоличество
	|			ИЛИ ТаблицаСОшибками.ОшибкаСклада)";
	
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	
	Результат = Запрос.Выполнить();
	ТаблицаЗапроса = Результат.Выгрузить();
	
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		Отказ = Истина;
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Есть ошибки заполнения табличной части'");
		ПараметрыИнформации.ТекстИнформации     = "";
		Для каждого СтрокаТаблицы Из ТаблицаЗапроса Цикл
			
			Если СтрокаТаблицы.ОшибкаНоменклатуры Тогда
				
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке №%1 табличной части не заполнена номенклатура'"),
				СтрокаТаблицы.НомерСтроки);
				ПараметрыИнформации.ТекстИнформации = ПараметрыИнформации.ТекстИнформации + Символы.ПС + Текст;
				
			ИначеЕсли СтрокаТаблицы.ОшибкаСклада Тогда
				
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке №%1 табличной части не смогли заполнить склад'"),
				СтрокаТаблицы.НомерСтроки);
				ПараметрыИнформации.ТекстИнформации = ПараметрыИнформации.ТекстИнформации + Символы.ПС + Текст;
				
			ИначеЕсли СтрокаТаблицы.ОшибкаКоличество Тогда
				
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке №%1 табличной части не заполнено количество'"),
				СтрокаТаблицы.НомерСтроки);
				ПараметрыИнформации.ТекстИнформации = ПараметрыИнформации.ТекстИнформации + Символы.ПС + Текст;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеТоваров(Отказ, ПараметрыИнформации, Объект);
	
КонецПроцедуры

// Проверяет наличие товаров на складе.
//
// Параметры:
//  Отказ - Булево.
//  ПараметрыИнформации - Структура.
//  Объект - ДанныеФормаКоллекция.
//  КонтролироватьОстаткиТоваровПриЗакрытииЧека - Булево.
//
Процедура ПроверитьНаличиеТоваров(Отказ, ПараметрыИнформации, Объект) Экспорт
	
	ОрганизацияТоваров = Объект.Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	ТекстСообщения = "";
	
	МодульНабораЗаписей = РегистрыНакопления.ТоварыНаСкладах.СоздатьНаборЗаписей();
	Отказ = НЕ МодульНабораЗаписей.КонтрольОстатков(Объект, ОрганизацияТоваров, Объект.Магазин.Склад, Объект.Товары, Объект.Дата,, Истина, ТекстСообщения);
	
	ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Отрицательные остатки'");
	ПараметрыИнформации.ТекстИнформации = ТекстСообщения;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииУправлениеВидимостьюНаФорме

Процедура УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(Форма, Элементы = Неопределено) Экспорт
	
	ВыводитьАртикул = ПолучитьФункциональнуюОпцию("ВыводитьАртикулНоменклатурыВТабличныхЧастяхДокументов");
	
	МассивЭлементов = новый Массив;
	
	Если Элементы = Неопределено Тогда
		МассивЭлементов.Добавить("ТоварыНоменклатураАртикул");
	ИначеЕсли ТипЗнч(Элементы) = Тип("Строка") Тогда
		МассивЭлементов.Добавить(Элементы);
	ИначеЕсли ТипЗнч(Элементы) = Тип("Массив") Тогда
		МассивЭлементов = Элементы;
	КонецЕсли;
	
	Для Каждого ТекущийЭлемент Из МассивЭлементов Цикл
		Попытка
			Форма.Элементы[ТекущийЭлемент].Видимость = ВыводитьАртикул;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает видимость элементов формы по массиву имен.
//
// Параметры:
//  Элементы - ЭлементыФормы - элементы формы видимость которых изменяется.
//  МассивВсехРеквизитов - Массив - Массив имен реквизитов, для которых устанавливается видимость.
//  МассивВидимыхРеквизитов - Массив - Массив имен реквизитов, которые должны быть видны на форме.
//
Процедура УстановитьВидимостьЭлементовПоМассиву(Элементы, Знач МассивВсехРеквизитов, Знач МассивВидимыхРеквизитов) Экспорт
	
	Если ТипЗнч(МассивВидимыхРеквизитов) <> ТипЗнч(Новый Массив) Тогда
		МассивВидимыхРеквизитов = Новый Массив;
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивВсехРеквизитов Цикл
		
		Позиция = Найти(ЭлементМассива, ".");
		Если Позиция <> 0 Тогда
			ИмяРеквизита = СтрЗаменить(ЭлементМассива, ".", "");
		Иначе
			ИмяРеквизита = ЭлементМассива;
		КонецЕсли;
		
		// Если реквизита нет в массиве видимых реквизитов, снимаем видимость элемента формы.
		ВидимостьРеквизита = (МассивВидимыхРеквизитов.Найти(ЭлементМассива) <> Неопределено);
		Если Элементы.Найти(ИмяРеквизита) <> Неопределено
			И Элементы[ИмяРеквизита].Видимость <> ВидимостьРеквизита Тогда
			Элементы[ИмяРеквизита].Видимость = ВидимостьРеквизита;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//++ №6283
Процедура УстановитьВидимостьКолонокВТабличнойЧастиИсполнителиПоОперациям(Форма) Экспорт
	
	//++ №6687 теперь способ определяется в документе
	//Если НЕ Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить() Тогда
	Если НЕ Форма.Объект.СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации Тогда
		//-- №6687
		Возврат;
	КонецЕсли;
	
	// №6283 дополнительно смотрим сколько в документе колонок заполнено, если глобально включено меньше 4-х
	
	МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию = Константы.МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию.Получить();
	
	Если МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию < 4 Тогда
		
		ИмяТЧ = ?(ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.СоставПроизводственнойСмены"), "СотрудникиПоОперациям", "ИсполнителиПоОперациям");
		Для Каждого ТекущаяСтрокаОперация Из Форма.Объект[ИмяТЧ] Цикл
			
			КоличествоИсполнителейПоОперации = 0;
			Для НомерСотрудника = 1 По 4 Цикл
				Если НЕ ТекущаяСтрокаОперация["Сотрудник" + НомерСотрудника].Пустая() Тогда
					КоличествоИсполнителейПоОперации = КоличествоИсполнителейПоОперации + 1;
				КонецЕсли;
			КонецЦИкла;
			
			// Определяем максимальное число колонок
			МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию	= Макс(МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию, КоличествоИсполнителейПоОперации);
			
		КонецЦикла;
		
	КонецЕсли;
	Форма.МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию = МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию;
	
	// №6283 поменяли на реквизит документа ИспользоватьКТУВПроизводственныхОперациях = Константы.ИспользоватьКТУВПроизводственныхОперациях.Получить();
	ИспользоватьКТУВПроизводственныхОперациях = Форма.Объект.ИспользоватьКТУВПроизводственныхОперациях;
	
	Для Сч = 1 По 4 Цикл
		
		Форма.Элементы["ИсполнителиПоУчасткамКоэффициент" + Сч].Видимость 	= ИспользоватьКТУВПроизводственныхОперациях;
		Форма.Элементы["ИсполнителиПоУчасткамГруппа" + Сч].Видимость 		= (Сч <= Форма.МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию);
		
		//++ №6283 дополнительно колонку "% участия" во всех документах так же не показывать, если не исопльзуется учет КТУ в производственных операция
		Форма.Элементы["ИсполнителиПоУчасткамПроцентУчастия" + Сч].Видимость = ИспользоватьКТУВПроизводственныхОперациях;
		
	КонецЦикла;
	
КонецПроцедуры
//-- №6283

Процедура УстановитьВидимостьПодразделения(Форма) Экспорт
	
	Видимость = Форма.Объект.СозданПриИспользованииПодразделений;
	Если Видимость Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийЭлемент = "Подразделение";	
	Если НЕ Форма.Элементы.Найти(ТекущийЭлемент) = Неопределено Тогда
		Форма.Элементы[ТекущийЭлемент].Видимость = Видимость;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ДобавитьГруппуФормы(Форма,
	Имя,
	Заголовок,
	ОтображатьВШапке,
	КартинкаШапки,
	ГруппировкаКолонок,
	Родитель) Экспорт
	
	НоваяГруппа                  = Форма.Элементы.Добавить(Имя, Тип("ГруппаФормы"), ?(Родитель = Неопределено, Форма, Родитель));
	НоваяГруппа.Заголовок        = ?(ЗначениеЗаполнено(Заголовок), Заголовок, Имя);
	НоваяГруппа.Вид              = ВидГруппыФормы.ГруппаКолонок;
	НоваяГруппа.Группировка      = ГруппировкаКолонок;
	НоваяГруппа.ОтображатьВШапке = ОтображатьВШапке;	
	
	Если ОтображатьВШапке И КартинкаШапки <> Неопределено Тогда
		НоваяГруппа.КартинкаШапки = КартинкаШапки;
	КонецЕсли;
	
	Возврат НоваяГруппа;
	
КонецФункции

Функция ДобавитьПолеФормы(Форма, Имя, ДополнительныеПараметры) Экспорт
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Заголовок",              Неопределено);
	СтруктураПараметров.Вставить("ОбработчикПриИзменении", "");
	СтруктураПараметров.Вставить("ОбработчикНачалоВыбора", "");
	СтруктураПараметров.Вставить("ШиринаПоля",             0);
	СтруктураПараметров.Вставить("ЦветФона",               Неопределено);
	СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      Неопределено);
	СтруктураПараметров.Вставить("Родитель",               Неопределено);
	СтруктураПараметров.Вставить("КартинкаШапки",          Неопределено);
	СтруктураПараметров.Вставить("ПутьКДанным",            Неопределено);
	СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Ложь);
	СтруктураПараметров.Вставить("СвязиПараметровВыбора",  Неопределено);
	СтруктураПараметров.Вставить("ОтображатьВШапке",       Истина);
	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ДополнительныеПараметры);
	
	НовоеПоле                     = Форма.Элементы.Добавить(Имя, Тип("ПолеФормы"), ?(СтруктураПараметров.Родитель = Неопределено, Форма, СтруктураПараметров.Родитель));
	НовоеПоле.ПутьКДанным         = СтруктураПараметров.ПутьКДанным;
	НовоеПоле.Заголовок           = ?(ЗначениеЗаполнено(СтруктураПараметров.Заголовок), СтруктураПараметров.Заголовок, Имя);
	НовоеПоле.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
	НовоеПоле.Вид                 = ВидПоляФормы.ПолеВвода;
	НовоеПоле.ТолькоПросмотр      = СтруктураПараметров.ТолькоПросмотрПоля;
	НовоеПоле.Ширина              = СтруктураПараметров.ШиринаПоля;
	НовоеПоле.ОтображатьВШапке    = СтруктураПараметров.ОтображатьВШапке;
	
	НовоеПоле.РастягиватьПоГоризонтали = Ложь;
	
	Если СтруктураПараметров.СвязиПараметровВыбора <> Неопределено Тогда
		НовоеПоле.СвязиПараметровВыбора = СтруктураПараметров.СвязиПараметровВыбора;
	КонецЕсли;
	
	Если СтруктураПараметров.ЦветФонаЗаголовка <> Неопределено Тогда
		НовоеПоле.ЦветФонаЗаголовка = СтруктураПараметров.ЦветФонаЗаголовка;
	КонецЕсли;
	
	Если СтруктураПараметров.ЦветФона <> Неопределено Тогда
		НовоеПоле.ЦветФона = СтруктураПараметров.ЦветФона;
	КонецЕсли;
	
	Если СтруктураПараметров.КартинкаШапки <> Неопределено Тогда
		НовоеПоле.КартинкаШапки = СтруктураПараметров.КартинкаШапки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ОбработчикПриИзменении) Тогда
		НовоеПоле.УстановитьДействие("ПриИзменении", СтруктураПараметров.ОбработчикПриИзменении);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ОбработчикНачалоВыбора) Тогда
		НовоеПоле.УстановитьДействие("НачалоВыбора", СтруктураПараметров.ОбработчикНачалоВыбора);
	КонецЕсли;
	
	Возврат НовоеПоле;
	
КонецФункции

//++ №8495
#Область ОбязательныеПоляКЗаполнению

Функция ПолучитьМассивВозможныхОбязательныхПолейКЗаполнениюЛида() Экспорт
	
	МассивПолей = новый Массив;
	ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, "ИмяКлиента", "Имя клиента");
	ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, "КонтактнаяИнформация.Телефон", "Телефон");
	ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, "КонтактнаяИнформация.ЭлектроннаяПочта", "Электронная почта");
	ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, "ВидКонтакта", "Вид контакта");
	ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, "РекламнаяАкция", "Рекламная акция");
	ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, "РекламныйИсточник", "Рекламный источник");
	ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, "ТочкаПродаж", "Точка продаж");
	ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, "Город");
	ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, "Адрес");
	ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, "Комментарий");
	ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, "Подразделение");
	
	Возврат МассивПолей;
	
КонецФункции

Процедура ДобавитьПолеВМассивОбязательныхПолейКЗаполнениюЛида(МассивПолей, Знач ИмяПоля, Знач Синоним = Неопределено)
	
	Если Синоним = Неопределено Тогда
		
		Синоним = ИмяПоля;
		
	КонецЕсли;
	
	МассивПолей.Добавить(новый Структура("ИмяПоля, Синоним", ИмяПоля, Синоним));
	
КонецПроцедуры

// Возвращает таблицу с возможными и выбранными пользователем полями
Функция ПолучитьНастройкуОбязательныхПолейКЗаполнениюЛида() Экспорт
	
	// Получим поля, которые могут быть выбраны как обязательные к заполнению
	ДоступныеПоля = ПолучитьМассивВозможныхОбязательныхПолейКЗаполнениюЛида();
	
	// Получим поля, которые уже выбраны пользователем
	ВыбранныеПоляПользователем = Константы.ОбязательныеПоляКЗаполнениюЛида.Получить().Получить();
	Если ВыбранныеПоляПользователем = Неопределено Тогда
		ВыбранныеПоляПользователем = Новый Массив;
	КонецЕсли;
	
	// Сформируем таблицу значений с возможными и выбранными полями
	ТаблицаНастройки = новый ТаблицаЗначений;
	ТаблицаНастройки.Колонки.Добавить("ИмяПоля", 	новый ОписаниеТипов("Строка",,,, новый КвалификаторыСтроки(80)));
	ТаблицаНастройки.Колонки.Добавить("Синоним", 	новый ОписаниеТипов("Строка",,,, новый КвалификаторыСтроки(80)));
	ТаблицаНастройки.Колонки.Добавить("Заполнять", 	новый ОписаниеТипов("Булево"));
	
	Для Каждого ДоступноеПоле Из ДоступныеПоля Цикл
		
		НоваяСтрока = ТаблицаНастройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДоступноеПоле);
		НоваяСтрока.Заполнять = (НЕ ВыбранныеПоляПользователем.Найти(ДоступноеПоле.ИмяПоля) = Неопределено);
		
		// #17179 обратная совместимость после изменения полей
		Если НЕ НоваяСтрока.Заполнять И ДоступноеПоле.ИмяПоля = "КонтактнаяИнформация.Телефон" Тогда
			НоваяСтрока.Заполнять = (НЕ ВыбранныеПоляПользователем.Найти("ОсновнойТелефонКлиента") = Неопределено);
		ИначеЕсли НЕ НоваяСтрока.Заполнять И ДоступноеПоле.ИмяПоля = "КонтактнаяИнформация.ЭлектроннаяПочта" Тогда
			НоваяСтрока.Заполнять = (НЕ ВыбранныеПоляПользователем.Найти("ЭлектроннаяПочтаКлиента") = Неопределено);	
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаНастройки.Сортировать("ИмяПоля");
	
	Возврат ТаблицаНастройки;
	
КонецФункции

Процедура СохранитьНастройкуОбязательныхПолейКЗаполнениюЛида(ОбязательныеПоляКЗаполнениюЛида) Экспорт
	
	ВыбранныеПоляПользователем = новый Массив;
	
	Для Каждого ТекущаяСтрока Из ОбязательныеПоляКЗаполнениюЛида Цикл
		
		Если ТекущаяСтрока.Заполнять Тогда
			ВыбранныеПоляПользователем.Добавить(ТекущаяСтрока.ИмяПоля);
		КонецЕсли;
		
	КонецЦикла;
	
	Константы.ОбязательныеПоляКЗаполнениюЛида.Установить(новый ХранилищеЗначения(ВыбранныеПоляПользователем));
	
КонецПроцедуры

#КонецОбласти

//++ 16681
#Область ОтображатьПрочихИсполнителей

Функция ПолучитьМассивВозможныхПрочихИсполнителей() Экспорт
	
	МассивПолей = Новый Массив;
	ДобавитьПолеВМассивПрочихИсполнителей(МассивПолей, "АвторВЛиде", 				"Автор в лиде");
	ДобавитьПолеВМассивПрочихИсполнителей(МассивПолей, "МенеджерВЛиде", 			"Менеджер в лиде");
	ДобавитьПолеВМассивПрочихИсполнителей(МассивПолей, "НазначилЗамерВЛиде", 		"Назначил замер в лиде");
	ДобавитьПолеВМассивПрочихИсполнителей(МассивПолей, "АвторВЗаказДоговоре", 		"Автор в заказе клиента");
	ДобавитьПолеВМассивПрочихИсполнителей(МассивПолей, "МенеджерЗаказДоговора", 	"Менеджер заказа клиента");
	ДобавитьПолеВМассивПрочихИсполнителей(МассивПолей, "ЗамерщикЗаказДоговора", 	"Замерщик в заказе клиента");
	ДобавитьПолеВМассивПрочихИсполнителей(МассивПолей, "АвторВМонтаже", 			"Автор в реализации клиенту");
	ДобавитьПолеВМассивПрочихИсполнителей(МассивПолей, "МенеджерКонтрагента", 		"Менеджер контрагента");
	
	Возврат МассивПолей;
	
КонецФункции

Процедура ДобавитьПолеВМассивПрочихИсполнителей(МассивПолей, Знач ВидИсполнителя, Знач Синоним = Неопределено)
	
	Если Синоним = Неопределено Тогда
		Синоним = ВидИсполнителя;
	КонецЕсли;
	МассивПолей.Добавить(новый Структура("ВидИсполнителя, Синоним", ВидИсполнителя, Синоним));
	
КонецПроцедуры

// Возвращает таблицу со списком видов прочих исполнителей и выбранными пользователем видами
Функция ПолучитьНастройкуОтображатьПрочихИсполнителей() Экспорт
	
	// Получим поля, которые могут быть выбраны как обязательные к заполнению
	ПрочиеИсполнители = ПолучитьМассивВозможныхПрочихИсполнителей();
	
	// Получим поля, которые уже выбраны пользователем
	ВыбранныеИсполнители = Константы.ОтображатьПрочихИсполнителей.Получить().Получить();
	Если ВыбранныеИсполнители = Неопределено Тогда
		ВыбранныеИсполнители = новый Массив;
	КонецЕсли;
	
	// Сформируем таблицу значений с возможными и выбранными полями
	ТаблицаНастройки = новый ТаблицаЗначений;
	ТаблицаНастройки.Колонки.Добавить("ВидИсполнителя", 	новый ОписаниеТипов("Строка",,,, новый КвалификаторыСтроки(80)));
	ТаблицаНастройки.Колонки.Добавить("Синоним", 	новый ОписаниеТипов("Строка",,,, новый КвалификаторыСтроки(0)));
	ТаблицаНастройки.Колонки.Добавить("Отображать", 	новый ОписаниеТипов("Булево"));
	
	Для Каждого Исполнитель Из ПрочиеИсполнители Цикл
		НоваяСтрока = ТаблицаНастройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Исполнитель);
		НоваяСтрока.Отображать = (НЕ ВыбранныеИсполнители.Найти(Исполнитель.ВидИсполнителя) = Неопределено);
	КонецЦикла;
	
	Возврат ТаблицаНастройки;
	
КонецФункции

Процедура СохранитьНастройкуОтображатьПрочихИсполнителей(ОтображатьПрочихИсполнителей) Экспорт
	
	ОтображаемыеПрочиеИсполнители = новый Массив;
	
	Для Каждого ТекущаяСтрока Из ОтображатьПрочихИсполнителей Цикл
		
		Если ТекущаяСтрока.Отображать Тогда
			ОтображаемыеПрочиеИсполнители.Добавить(ТекущаяСтрока.ВидИсполнителя);
		КонецЕсли;
		
	КонецЦикла;
	
	Константы.ОтображатьПрочихИсполнителей.Установить(новый ХранилищеЗначения(ОтображаемыеПрочиеИсполнители));
	
КонецПроцедуры

#КонецОбласти
//-- №8495



#Область ИсполнителиПоПроизводственнымОперациям

// Процедура - Заполнить исполнителей по смене
//
// Параметры:
//  Объект	 - 	 Документ-объект (ЗНП или выпуск) или Объект формы 
//
Процедура ЗаполнитьИсполнителейПроизводстваПоСмене(Объект) Экспорт
	
	//заполним бригаду только если включена настройка использовать производственные бригады
	Если Константы.ИспользоватьПроизводственныеБригады.Получить() Тогда
		Если Объект.Бригада.Пустая() Тогда
			ЗапросБригад = Новый Запрос;
			ЗапросБригад.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПроизводственныеБригады.Ссылка
			|ИЗ
			|	Справочник.ПроизводственныеБригады КАК ПроизводственныеБригады
			|ГДЕ
			|	НЕ ПроизводственныеБригады.ПометкаУдаления
			|	И НЕ ПроизводственныеБригады.Неактивная";
			Выборка = ЗапросБригад.Выполнить().Выгрузить();
			Если Выборка.Количество() = 1 Тогда
				Объект.Бригада = Выборка[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		//++ 1526
		//если бригаду не получилось заполнить, исполнителей заполнять не нужно
		Если Объект.Бригада.Пустая() Тогда
			Возврат;
		КонецЕсли;	
		//-- 1526 
		
	КонецЕсли;
	
	ДатаЗаполнения = КонецДня(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
	
	ВидПроизводства = Перечисления.ВидыПроизводства.ПустаяСсылка();
	ВидПродукции = Справочники.ВидыПродукции.ПустаяСсылка();
	
	Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
		ВидПроизводства = Перечисления.ВидыПроизводства.ТиповоеПроизводство;
		Если Объект.Продукция.Количество() > 0 Тогда
			// продукция без галки "Уникальная продукция"
			ВидПродукции = Объект.Продукция[0].Номенклатура.ВидПродукции;
			Если ЗначениеЗаполнено(ВидПродукции) Тогда
				ВидПроизводства = Перечисления.ВидыПроизводства.Продукция;	
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка
		И ЗначениеЗаполнено(Объект.ПродукцияНоменклатура) Тогда		
		ВидНоменклатуры = Объект.ПродукцияНоменклатура.ВидНоменклатуры;
		Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок Тогда
			ВидПроизводства = Перечисления.ВидыПроизводства.Потолок;
		ИначеЕсли ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез Тогда
			ВидПроизводства = Перечисления.ВидыПроизводства.Отрез;	
		ИначеЕсли ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
			// продукция с галкой "Уникальная продукция"
			ВидПроизводства = Перечисления.ВидыПроизводства.Продукция;
			ВидПродукции = Объект.ПродукцияНоменклатура.ВидПродукции;
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",ДатаЗаполнения);
	Запрос.УстановитьПараметр("Организация", Объект.Организация); // №14262
	Запрос.УстановитьПараметр("ВидПроизводства", ВидПроизводства); 
	Запрос.УстановитьПараметр("ВидПродукции", ВидПродукции); 
	Запрос.УстановитьПараметр("ОтборПоБригаде", ЗначениеЗаполнено(Объект.Бригада));
	Запрос.УстановитьПараметр("Бригада", Объект.Бригада);
	Запрос.УстановитьПараметр("НесколькоТочекПроизводства", Объект.НесколькоТочекПроизводства);
	Запрос.УстановитьПараметр("Цех", Объект.Цех);
	Запрос.УстановитьПараметр("СпособНачисленияВыработки", Объект.СпособНачисленияВыработки); // №6687
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СоставПроизводственнойСмены.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СоставПроизводственнойСмены.ВидыПродукции КАК СоставПроизводственнойСменыВидыПродукции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СоставПроизводственнойСмены КАК СоставПроизводственнойСмены
	|		ПО СоставПроизводственнойСменыВидыПродукции.Ссылка = СоставПроизводственнойСмены.Ссылка
	|ГДЕ
	|	СоставПроизводственнойСмены.Проведен
	|	И СоставПроизводственнойСмены.Дата <= &Дата
	|	И СоставПроизводственнойСмены.Организация = &Организация
	|	И СоставПроизводственнойСменыВидыПродукции.ВидПроизводства = &ВидПроизводства
	|	И СоставПроизводственнойСменыВидыПродукции.ВидПродукции = &ВидПродукции
	|	И СоставПроизводственнойСмены.СпособНачисленияВыработки = &СпособНачисленияВыработки
	|	И ВЫБОР
	|			КОГДА &ОтборПоБригаде
	|				ТОГДА СоставПроизводственнойСмены.Бригада = &Бригада
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НесколькоТочекПроизводства
	|				ТОГДА СоставПроизводственнойСмены.Цех = &Цех
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СоставПроизводственнойСмены.Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		//++ №6687 теперь способ определяется в документе
		//Если НЕ Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить() Тогда
		Если Объект.СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.Бригадная Тогда
			//-- №6687
			
			Для Каждого ТекущийСотрудник Из Выборка.Ссылка.Сотрудники Цикл
				
				НоваяСтрока = Объект.Исполнители.Добавить();
				НоваяСтрока.Сотрудник = ТекущийСотрудник.Сотрудник;
				//НоваяСтрока.Коэффициент = 1;
				НоваяСтрока.Коэффициент = ТекущийСотрудник.Коэффициент;
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого ТекущаяСтрока Из Выборка.Ссылка.СотрудникиПоОперациям Цикл
				
				НоваяСтрока = Объект.ИсполнителиПоОперациям.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе	
		ТекстСообщения = СтрШаблон("На текущую дату нет заполненного и проведенного документа ""Состав производственной смены"", подходящего под критерии документа:
			|%1%2%3%4%5%6", 
			СтрШаблон("Организация: ""%1"", ", Объект.Организация),
			СтрШаблон("вид производства: ""%1"", ", ВидПроизводства),
			СтрШаблон("вид продукции: ""%1"", ", ВидПродукции),
			?(ЗначениеЗаполнено(Объект.Бригада), СтрШаблон("бригада: ""%1"", ", Объект.Бригада), ""),
			?(Объект.НесколькоТочекПроизводства, СтрШаблон("цех: ""%1"", ", Объект.Цех), ""),
			СтрШаблон("способ: ""%1""", Объект.СпособНачисленияВыработки)
		);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

//++ №6283
Процедура ПересчитатьПроцентУчастияИсполнителейПоОперациям(Форма, Объект) Экспорт
	
	ТабличнаяЧасть = "ИсполнителиПоОперациям";
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.СоставПроизводственнойСмены") Тогда
		ТабличнаяЧасть = "СотрудникиПоОперациям";
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект[ТабличнаяЧасть] Цикл
		
		СуммаКоэффициентов = 0;
		Для Сч = 1 По Форма.МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию Цикл
			Если ЗначениеЗаполнено(ТекущаяСтрока["Сотрудник" + Сч]) Тогда
				Коэффициент = ?(Объект.ИспользоватьКТУВПроизводственныхОперациях, ТекущаяСтрока["Коэффициент" + Сч], 1);
				СуммаКоэффициентов = СуммаКоэффициентов + Коэффициент;
			КонецЕсли;
		КонецЦикла;
		
		Для Сч = 1 По Форма.МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию Цикл
			Если ЗначениеЗаполнено(ТекущаяСтрока["Сотрудник" + Сч]) Тогда
				Коэффициент = ?(Объект.ИспользоватьКТУВПроизводственныхОперациях, ТекущаяСтрока["Коэффициент" + Сч], 1);
				ТекущаяСтрока["ПроцентУчастия" + Сч] = ?(СуммаКоэффициентов = 0, 0, Окр(Коэффициент / СуммаКоэффициентов, 4)*100);
			Иначе
				ТекущаяСтрока["ПроцентУчастия" + Сч] = 0;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры
//-- №6283

Процедура ПересчитатьПроцентУчастияКТУИсполнителей(Объект) Экспорт
	
	// по аналогии с модулем зарплаты
	СуммаКоэффициентов = Объект.Исполнители.Итог("Коэффициент");
	
	Для Каждого ТекущаяСтрока Из Объект.Исполнители Цикл
		ТекущаяСтрока.ПроцентУчастия = ?(СуммаКоэффициентов = 0, 0, Окр(ТекущаяСтрока.Коэффициент / СуммаКоэффициентов, 4)*100);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьПодчиненныйСчетФактуру(ДокументОснование) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда		
		Возврат Неопределено;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СчетФактураВыданный.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Основание = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить();		
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;		
	
	Возврат Неопределено;
	
КонецФункции

#Область АрхивацияПрикрепленныхДанных

Процедура АрхивацияПрикрепленныхДанныхПоРегламентномуЗаданию() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
	Метаданные.РегламентныеЗадания.АрхивацияПрикрепленныхДанных);
	
	// Константа теперь регулирует запуск по регламентному заданию
	Если НЕ Константы.ВыполнятьАрхивациюПрикрепленныхДанных.Получить() Тогда
		ВызватьИсключение "В настройках архивации отключена настройка автоматической архивации.";
	КонецЕсли;
	
	АрхивацияПрикрепленныхДанных();
	
КонецПроцедуры

// №7253
Процедура АрхивацияПрикрепленныхДанных(ТаблицаДанных = Неопределено) Экспорт
	
	ВариантАрхивации = Константы.ВариантАрхивацииПрикрепленныхДанных.Получить();
	Если ВариантАрхивации.Пустая() Тогда
		ВызватьИсключение "Не задан вариант архивации";
	КонецЕсли;
	
	ИмяСобытия = "Архивация прикрепленных данных (" + ВариантАрхивации + ").";
	
	НаЛокальныйДиск = (ВариантАрхивации = Перечисления.ВариантыАрхивацииПрикрепленныхДанных.ЛокальныйДиск);
	НаGoogleDrive = (ВариантАрхивации = Перечисления.ВариантыАрхивацииПрикрепленныхДанных.GoogleDrive);
	НаЯндексДиск = (ВариантАрхивации = Перечисления.ВариантыАрхивацииПрикрепленныхДанных.ЯндексДиск);
	
	ПутьАрхивации = Константы.ПутьАрхивацииПрикрепленныхДанных.Получить();
	
	ЭтоОблако = (ОбщийМодуль.ОпределитьМассивПеременныхСеанса().Коробка = 1);
	
	Если НаЛокальныйДиск И ЭтоОблако Тогда
		ВызватьИсключение "В облачной версии использование варианта архивации ""На локальный диск на сервере"" запрещено!.";
	КонецЕсли;
	
	Если НаЛокальныйДиск И НЕ ЗначениеЗаполнено(ПутьАрхивации) Тогда
		ВызватьИсключение "Не задан путь архивации";
	КонецЕсли;
	
	Если НаЛокальныйДиск Тогда
		
		СистемнаяИнформация = Новый СистемнаяИнформация;
		ПлатформаWindows = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
		ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
		
		// Проверка существования пути
		Каталог = новый Файл(ПутьАрхивации);
		Если НЕ Каталог.Существует() Тогда
			ВызватьИсключение "Каталог выгрузки архивации """ + ПутьАрхивации + """ не обнаружен.";
		КонецЕсли;
		
	ИначеЕсли НаGoogleDrive Тогда
		
		ПараметрыАвторизацииGoogleAPI = РаботаСGoogleAPIВызовСервера.ПолучитьПараметрыАвторизации();
		
		Если ПараметрыАвторизацииGoogleAPI = Неопределено Тогда
			ВызватьИсключение "Необходимо выполнить настройки авторизации Google API.";
		КонецЕсли;
		
		// Проверим заполненность названия папки для архивации
		Если Не ЗначениеЗаполнено(ПараметрыАвторизацииGoogleAPI.ПутьАрхивации) Тогда
			ВызватьИсключение "Необходимо указать имя папки для архивации в Google Drive.";
		КонецЕсли;
		
		// Проверим наличие папки на самом GDrive
		СписокПапок = РаботаСGoogleAPIВызовСервера.ПолучитьПапкиИзДиска(ПараметрыАвторизацииGoogleAPI);
		
		idПапкиGD = "";
		Если Не СписокПапок = Неопределено Тогда
			Для Каждого ПапкаGD Из СписокПапок Цикл
				Если НРег(ПапкаGD.name) = НРег(ПараметрыАвторизацииGoogleAPI.ПутьАрхивации) Тогда
					idПапкиGD = ПапкаGD.id;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(idПапкиGD) Тогда
			ВызватьИсключение "Не удалось найти папку с наименованием """ + ПараметрыАвторизацииGoogleAPI.ПутьАрхивации + """ в Google Drive.";
		КонецЕсли;
		
	ИначеЕсли НаЯндексДиск Тогда
		
		ПараметрыАвторизацииЯндексAPI = РаботаСЯндексAPIВызовСервера.ПолучитьПараметрыАвторизации();
		
		Если ПараметрыАвторизацииЯндексAPI = Неопределено Тогда
			ВызватьИсключение "Необходимо выполнить настройки авторизации Яндекс API.";
		КонецЕсли;
		
		// Проверим заполненность названия папки для архивации
		Если Не ЗначениеЗаполнено(ПараметрыАвторизацииЯндексAPI.ПутьАрхивации) Тогда
			ВызватьИсключение "Необходимо указать имя папки для архивации на Яндекс.Диск.";
		КонецЕсли;
		
		// Проверим наличие папки на самом Я.Д (если папка есть, в ней сразу будут все вложенные подпапки)
		МассивПапокЯД = РаботаСЯндексAPIВызовСервера.ПолучитьПапкиИзДиска(ПараметрыАвторизацииЯндексAPI, ПараметрыАвторизацииЯндексAPI.ПутьАрхивации);
		
		Если МассивПапокЯд = Неопределено Тогда
			ВызватьИсключение "Не удалось найти папку с наименованием """ + ПараметрыАвторизацииЯндексAPI.ПутьАрхивации + """ на Яндекс.Диск.";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицаДанных = Неопределено Тогда
		
		// Получим записи из регистра, которые нужно архивировать
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрикрепленныеДанные.Период КАК Период,
		|	ПрикрепленныеДанные.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя КАК ВидФайлаПрограммыПостроителя,
		|	ПрикрепленныеДанные.ИмяФайла КАК ИмяФайла,
		|	ПрикрепленныеДанные.Расширение КАК Расширение,
		|	ПрикрепленныеДанные.Данные КАК Данные
		|ИЗ
		|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
		|ГДЕ
		|	НЕ ПрикрепленныеДанные.Архивирован
		|	И ПрикрепленныеДанные.Период < &ДатаДо
		// для отладки сделаем наоборот только свежие
		//|	И ПрикрепленныеДанные.Период > &ДатаДо
		|ИТОГИ ПО
		|	СсылкаНаОбъект";
		Запрос.УстановитьПараметр("ДатаДо", НачалоДня(ДобавитьМесяц(ТекущаяДатаСеанса(), -Константы.АрхивироватьПрикрепленныеДанныеСтарше.Получить())));
		
	Иначе
		
		// Если передана таблица данных, то архивацию производим только по этим данным
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанных.Период,
		|	ТаблицаДанных.СсылкаНаОбъект,
		|	ТаблицаДанных.ВидФайлаПрограммыПостроителя,
		|	ТаблицаДанных.ИмяФайла,
		|	ТаблицаДанных.ИдентификаторСтроки
		|
		|ПОМЕСТИТЬ ВТ_ТаблицаДанных
		|
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|
		|;
		|/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрикрепленныеДанные.Период КАК Период,
		|	ПрикрепленныеДанные.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя КАК ВидФайлаПрограммыПостроителя,
		|	ПрикрепленныеДанные.ИмяФайла КАК ИмяФайла,
		|	ПрикрепленныеДанные.Расширение КАК Расширение,
		|	ПрикрепленныеДанные.Данные КАК Данные,
		|	ТаблицаДанных.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ИЗ
		|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДанных КАК ТаблицаДанных
		|		ПО ПрикрепленныеДанные.Период = ТаблицаДанных.Период
		|			И ПрикрепленныеДанные.СсылкаНаОбъект = ТаблицаДанных.СсылкаНаОбъект
		|			И ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя = ТаблицаДанных.ВидФайлаПрограммыПостроителя
		|			И ПрикрепленныеДанные.ИмяФайла = ТаблицаДанных.ИмяФайла
		|
		|ГДЕ
		|	НЕ ПрикрепленныеДанные.Архивирован
		|ИТОГИ ПО
		|	СсылкаНаОбъект";
		Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
		
	КонецЕсли;
	
	ВыборкаОбъект = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СсылкаНаОбъект");
	
	// Выборка по объектам-каталогам (ГУИДы объектов используются для именование папки, которые складываются в основную папку архивации)
	Пока ВыборкаОбъект.Следующий() Цикл
		
		// Архивация на локальный диск
		Если НаЛокальныйДиск Тогда
			
			// Проверим есть ли подкаталог по ГУИДу объекта
			ПутьПодкаталог = ПутьАрхивации + "\" + Строка(ВыборкаОбъект.СсылкаНаОбъект.УникальныйИдентификатор());
			Подкаталог = новый Файл(ПутьПодкаталог);
			
			Если НЕ Подкаталог.Существует() Тогда
				
				Попытка
					СоздатьКаталог(ПутьПодкаталог);
				Исключение
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, "Не удалось создать каталог: " + ПутьПодкаталог + Символы.ПС + ОписаниеОшибки());
					Продолжить;
				КонецПопытки;
				
			КонецЕсли;
			
			ВыборкаФайлы = ВыборкаОбъект.Выбрать();
			
			Пока ВыборкаФайлы.Следующий() Цикл
				
				ИмяФайлаСРасширением = ВыборкаФайлы.ИмяФайла + "." + ВыборкаФайлы.Расширение;
				ПутьФайла = ПутьПодкаталог + "\" + ИмяФайлаСРасширением;
				ПутьФайла = ПодготовитьПутьДляПлатформы(ПлатформаWindows, ПутьФайла);
				
				Попытка
					ВыборкаФайлы.Данные.Получить().Записать(ПутьФайла);
					ЗафиксироватьУспешнуюАрхивациюФайла(ИмяСобытия, ВыборкаФайлы, ВариантАрхивации, ПутьАрхивации);
					УстановитьПризнакАрхивацииВТаблицеДанных(ТаблицаДанных, ВыборкаФайлы);
				Исключение
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, "Не удалось выгрузить файл для объекта """ + ВыборкаФайлы.СсылкаНаОбъект + """ с наименованием: " + ИмяФайлаСРасширением + Символы.ПС + ОписаниеОшибки());
					Продолжить;
				КонецПопытки;
				
			КонецЦикла;
			
		ИначеЕсли НаGoogleDrive Тогда
			
			// Архивация на Google Drive
			ВыборкаФайлы = ВыборкаОбъект.Выбрать();
			ИмяПапки = Строка(ВыборкаОбъект.СсылкаНаОбъект.УникальныйИдентификатор());
			
			Если ВыборкаФайлы.Количество() > 0 Тогда
				
				// Проверим наличие папки на самом GDrive
				СписокПапок = РаботаСGoogleAPIВызовСервера.ПолучитьПапкиИзДиска(ПараметрыАвторизацииGoogleAPI,, idПапкиGD);
				
				Если СписокПапок = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				idПапкиОбъектаGD = "";
				Для Каждого ПапкаGD Из СписокПапок Цикл
					Если НРег(ПапкаGD.name) = НРег(ИмяПапки) Тогда
						idПапкиОбъектаGD = ПапкаGD.id;
					КонецЕсли;
				КонецЦикла;
				
				// Если папки нет, нужно её сначала создать
				Если Не ЗначениеЗаполнено(idПапкиОбъектаGD) И НЕ РаботаСGoogleAPIВызовСервера.СоздатьПапкуНаДиске(ИмяСобытия, ИмяПапки, ПараметрыАвторизацииGoogleAPI, idПапкиGD, idПапкиОбъектаGD) Тогда
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			Пока ВыборкаФайлы.Следующий() Цикл
				
				idФайлаGD = "";
				Если РаботаСGoogleAPIВызовСервера.СохранитьФайлНаДиск(ИмяСобытия, ВыборкаФайлы, ПараметрыАвторизацииGoogleAPI, idПапкиОбъектаGD, idФайлаGD) Тогда
					ЗафиксироватьУспешнуюАрхивациюФайла(ИмяСобытия, ВыборкаФайлы, ВариантАрхивации, ПараметрыАвторизацииGoogleAPI.ПутьАрхивации + "/" + ИмяПапки, idФайлаGD, idПапкиОбъектаGD);
					УстановитьПризнакАрхивацииВТаблицеДанных(ТаблицаДанных, ВыборкаФайлы);
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли НаЯндексДиск Тогда
			
			// Архивация на Яндекс.Диск
			ВыборкаФайлы = ВыборкаОбъект.Выбрать();
			ИмяПапки = Строка(ВыборкаОбъект.СсылкаНаОбъект.УникальныйИдентификатор());
			
			Если ВыборкаФайлы.Количество() > 0 Тогда
				
				// Проверим наличие папки на самом Я.Д
				ЕстьПапка = Ложь;
				Для Каждого ПапкаЯд Из МассивПапокЯД Цикл
					
					Если НЕ НРег(ПапкаЯД.type) = "dir" Тогда
						Продолжить;
					КонецЕсли;
					
					Если НРег(ПапкаЯд.name) = НРег(ИмяПапки) Тогда
						ЕстьПапка = Истина;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				// Если папки нет, нужно её сначала создать
				Если Не ЕстьПапка И НЕ РаботаСЯндексAPIВызовСервера.СоздатьПапкуНаДиске(ИмяСобытия, ИмяПапки, ПараметрыАвторизацииЯндексAPI, МассивПапокЯД) Тогда
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			Пока ВыборкаФайлы.Следующий() Цикл
				
				Если РаботаСЯндексAPIВызовСервера.СохранитьФайлНаДиск(ИмяСобытия, ВыборкаФайлы, ПараметрыАвторизацииЯндексAPI, ИмяПапки) Тогда
					ЗафиксироватьУспешнуюАрхивациюФайла(ИмяСобытия, ВыборкаФайлы, ВариантАрхивации, ПараметрыАвторизацииЯндексAPI.ПутьАрхивации + "/" + ИмяПапки);
					УстановитьПризнакАрхивацииВТаблицеДанных(ТаблицаДанных, ВыборкаФайлы);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗафиксироватьУспешнуюАрхивациюФайла(ИмяСобытия, ВыборкаФайлы, ВариантАрхивации, ПутьАрхивации, idФайлаGD = "", idПапкиGD = "")
	
	// Устанавливаем признаки в ИБ и зануляем данные
	МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период						= ВыборкаФайлы.Период;
	МенеджерЗаписи.ВидФайлаПрограммыПостроителя = ВыборкаФайлы.ВидФайлаПрограммыПостроителя;
	МенеджерЗаписи.СсылкаНаОбъект 				= ВыборкаФайлы.СсылкаНаОбъект;
	МенеджерЗаписи.ИмяФайла 					= ВыборкаФайлы.ИмяФайла;						
	Попытка
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Архивирован = Истина;
		МенеджерЗаписи.ВариантАрхивации = ВариантАрхивации;
		МенеджерЗаписи.ПутьАрхивации = ПутьАрхивации;
		МенеджерЗаписи.ДатаАрхивации = ТекущаяДатаСеанса();
		МенеджерЗаписи.Данные = новый ХранилищеЗначения(Неопределено);
		МенеджерЗаписи.ИдентификаторФайлаGD = idФайлаGD;
		МенеджерЗаписи.ИдентификаторПапкиGD = idПапкиGD;
		МенеджерЗаписи.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, "Не удалось зафиксировать архивацию в регистре: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьПризнакАрхивацииВТаблицеДанных(ТаблицаДанных, ВыборкаФайлы)
	
	Если ТаблицаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаДанных.НайтиСтроки(новый Структура("ИдентификаторСтроки", ВыборкаФайлы.ИдентификаторСтроки));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		НайденныеСтроки[0].Успешно = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьПутьДляПлатформы(ПлатформаWindows, Путь) Экспорт
	
	Если ПлатформаWindows Тогда
		ЧтоМенять = "/";
		НаЧтоМенять = "\";
	Иначе
		ЧтоМенять = "\";
		НаЧтоМенять = "/";
	КонецЕсли;
	
	Путь = СтрЗаменить(Путь, ЧтоМенять, НаЧтоМенять);
	Возврат Путь;
	
КонецФункции

#КонецОбласти

Функция ПроверкаCOMПодключения(СтрокаПодключения, ИмяПользователя, ПарольПользователя, ИмяСобытия = Неопределено) Экспорт
	
	мСоединение = Неопределено;
	Соединение = Неопределено;
	Попытка		
		мСоединение = Новый COMObject("V83.COMConnector");
	Исключение
		Сообщить("Не обнаружена библиотека comcntr.dll, попробуйте зарегистрировать её " + ОписаниеОшибки());
		мСоединение = Неопределено;
		Возврат Неопределено;
	КонецПопытки;
	
	Попытка
		Соединение = мСоединение.Connect(СтрокаПодключения+"usr="""+ИмяПользователя+""";pwd="""+ПарольПользователя+"""");
	Исключение
		ТекстОшибки = ИнформацияОбОшибке().Описание;
		Сообщить(ТекстОшибки);
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
		
		Если НЕ ИмяСобытия = Неопределено Тогда
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
		КонецЕсли;
		
		Соединение = Неопределено;
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции

Процедура СозданиеПоступленийТоваровОтПроизводстваПоУдаленнойБазеРегламентноеЗадание() Экспорт
	
	// Если идет обновление конфигурации, то все регламентные задания блокируются.
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	СозданиеПоступленийТоваровОтПроизводстваПоУдаленнойБазе();
	
КонецПроцедуры

Функция СозданиеПоступленийТоваровОтПроизводстваПоУдаленнойБазе() Экспорт
	
	Если НЕ Константы.СоздаватьДокументыПоступленийПоУдаленнойБазе.Получить() Тогда
		Возврат 0;
	КонецЕсли;
	
	ИмяСобытия = "Создание поступлений товаров от производства (удаленное подключение)";
	
	КоличествоСозданныхДокументов = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШапкаПланаОбмена.Код КАК Код,
	|	ШапкаПланаОбмена.Ссылка КАК Узел,
	|	НастройкиТранспортаОбмена.COMАутентификацияОперационнойСистемы КАК COMАутентификацияОперационнойСистемы,
	|	НастройкиТранспортаОбмена.COMВариантРаботыИнформационнойБазы КАК COMВариантРаботыИнформационнойБазы,
	|	НастройкиТранспортаОбмена.COMИмяИнформационнойБазыНаСервере1СПредприятия КАК COMИмяИнформационнойБазыНаСервере1СПредприятия,
	|	НастройкиТранспортаОбмена.COMИмяПользователя КАК COMИмяПользователя,
	|	НастройкиТранспортаОбмена.COMИмяСервера1СПредприятия КАК COMИмяСервера1СПредприятия,
	|	НастройкиТранспортаОбмена.COMКаталогИнформационнойБазы КАК COMКаталогИнформационнойБазы,
	|	ШапкаПланаОбмена.НомерПринятого КАК НомерПринятого,
	|	ШапкаПланаОбмена.ОрганизацияПоступления КАК ОрганизацияПоступления,
	|	ШапкаПланаОбмена.КонтрагентПоступления КАК КонтрагентПоступления,
	|	ШапкаПланаОбмена.СкладПоступления КАК СкладПоступления,
	|	ШапкаПланаОбмена.ГруппаНовойНоменклатурыИзУдаленнойБазы КАК ГруппаНовойНоменклатуры,
	|	ШапкаПланаОбмена.ЗаполнятьАдресМонтажаВШапкеДокумента КАК ЗаполнятьАдресМонтажаВШапкеДокумента
	|ИЗ
	|	ПланОбмена.ОбменБазаПроизводстваБазаРозницы КАК ШапкаПланаОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиТранспортаОбмена КАК НастройкиТранспортаОбмена
	|		ПО (НастройкиТранспортаОбмена.Узел = ШапкаПланаОбмена.Ссылка)
	|ГДЕ
	|	НЕ ШапкаПланаОбмена.ЭтоБазаПроизводства
	|	И НЕ ШапкаПланаОбмена.ПометкаУдаления";		
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураНастроек = Новый Структура;
		СтруктураНастроек.Вставить("Узел");
		СтруктураНастроек.Вставить("COMАутентификацияОперационнойСистемы");
		СтруктураНастроек.Вставить("COMВариантРаботыИнформационнойБазы");
		СтруктураНастроек.Вставить("COMИмяИнформационнойБазыНаСервере1СПредприятия");
		СтруктураНастроек.Вставить("COMИмяПользователя");
		СтруктураНастроек.Вставить("COMИмяСервера1СПредприятия");
		СтруктураНастроек.Вставить("COMКаталогИнформационнойБазы");
		СтруктураНастроек.Вставить("COMПарольПользователя");
		ЗаполнитьЗначенияСвойств(СтруктураНастроек, Выборка);
		
		УстановитьПривилегированныйРежим(Истина);
		СтруктураНастроек.COMПарольПользователя = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Выборка.Узел, "COMПарольПользователя", Истина);
		УстановитьПривилегированныйРежим(Ложь);
		
		Результат = ОбменДаннымиСервер.УстановитьВнешнееСоединениеСБазой(СтруктураНастроек);
		Если Результат.Соединение = Неопределено Тогда
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, Результат.КраткоеОписаниеОшибки);
			Продолжить; //Прервать; // #12849
		КонецЕсли;
		
		ВнешнееСоединение = Результат.Соединение;
		
		Если ВнешнееСоединение.Метаданные.ПланыОбмена.Найти("ОбменБазаПроизводстваБазаРозницы") = Неопределено Тогда
			ТекстОшибки = "В удаленной базе отсутствует план обмена ""Обмен База производства и База розницы"". Возможно требуется обновление базы.";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			Продолжить; //Прервать; // #12849 
		КонецЕсли;
		
		комУзелОбмена = ВнешнееСоединение.ПланыОбмена.ОбменБазаПроизводстваБазаРозницы.НайтиПоКоду(Выборка.Код);
		Если комУзелОбмена.Ссылка.Пустая() Тогда
			ТекстОшибки = "В удаленной базе отсутствует узел обмена ""Обмен База производства и База розницы"" с кодом " + Выборка.Код;
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			Продолжить; //Прервать; // #12849	
		КонецЕсли;
		
		ТаблицаТоваров = Новый ТаблицаЗначений;
		Для Каждого Реквизит Из Метаданные.Документы.РеализацияТоваровИУслуг.ТабличныеЧасти.Товары.Реквизиты Цикл
			ТаблицаТоваров.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);	
		КонецЦикла;
		ТаблицаУслуг = Новый ТаблицаЗначений;
		Для Каждого Реквизит Из Метаданные.Документы.РеализацияТоваровИУслуг.ТабличныеЧасти.Услуги.Реквизиты Цикл
			ТаблицаУслуг.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);	
		КонецЦикла;
		
		комВыборка = ВнешнееСоединение.ПланыОбмена.ВыбратьИзменения(комУзелОбмена.Ссылка, Выборка.НомерПринятого);
		Пока комВыборка.Следующий() Цикл
			комОбъект = комВыборка.Получить(); 
			комСсылка = комОбъект.Ссылка;
			
			//#16447 проверка на битую ссылку
			Если ПустаяСтрока(комСсылка.ВерсияДанных) Тогда				
				Попытка		
					ВнешнееСоединение.ПланыОбмена.УдалитьРегистрациюИзменений(комУзелОбмена, комОбъект);
				Исключение
				КонецПопытки;
				
				Продолжить;				
			КонецЕсли;
			
			ТипСтрокой = комОбъект.Метаданные().Имя;
			СтроковыйГУИД = ВнешнееСоединение.String(комСсылка.UUID());
			
			Если ТипСтрокой = "РеализацияТоваровИУслуг" Тогда
				
				СсылкаНаОбъект = ОбменДаннымиСобытияПотолки.НайтиСсылкуНаОбъектПоГуид(Выборка.Узел, СтроковыйГУИД);
				Если СсылкаНаОбъект = Неопределено Тогда				
					ДокОбъект = Документы.ПоступлениеТоваровИУслуг.СоздатьДокумент();
					ДокОбъект.Заполнить(Неопределено);
					ДокОбъект.Дата = ТекущаяДатаСеанса();
				Иначе
					ДокОбъект = СсылкаНаОбъект.ПолучитьОбъект();
				КонецЕсли;
				
				ДокОбъект.ПоступлениеОтПроизводстваУИБ = Истина;				
				ДокОбъект.Организация = Выборка.ОрганизацияПоступления;
				ДокОбъект.Контрагент  = Выборка.КонтрагентПоступления;
				ДокОбъект.ДоговорКонтрагента = ДокОбъект.Контрагент.ОсновнойДоговор;
				ДокОбъект.ВидЦеныПоставщика = ДокОбъект.ДоговорКонтрагента.ВидЦеныПоставщика;
				ДокОбъект.Склад       = Выборка.СкладПоступления;
				ДокОбъект.НомерРозничногоДоговора = комОбъект.НомерРозничногоДоговора;
				Если Выборка.ЗаполнятьАдресМонтажаВШапкеДокумента Тогда
					ДокОбъект.АдресМонтажа = комОбъект.АдресМонтажа;
				КонецЕсли;
				ДокОбъект.ВхДата = комОбъект.Дата;
				ДокОбъект.ВхНомер = комОбъект.Номер;
				Если НЕ комОбъект.Валюта.Пустая() Тогда
					ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(комОбъект.Валюта.Код);
					Если НЕ ВалютаДокумента.Пустая() Тогда
						ДокОбъект.Валюта = ВалютаДокумента;
					КонецЕсли;
				КонецЕсли;
				
				ТаблицаТоваров.Очистить();
				Отказ = Ложь;
				Для каждого комСтрокаТовары из комОбъект.Товары Цикл
					НоваяСтрока = ТаблицаТоваров.Добавить();	
					ЗаполнитьЗначенияСвойств(НоваяСтрока, комСтрокаТовары, "Коэффициент, Количество, Цена, СуммаРучнойСкидки, Сумма, СуммаНДС, ПроцентРучнойСкидки, Бесплатно");
					НоваяСтрока.СтавкаНДС = ОбменДаннымиСобытияПотолки.ПолучитьСтавкуНДСУИБ(ВнешнееСоединение, комСтрокаТовары.СтавкаНДС);
					
					ТекстОшибки = "";
					НоваяСтрока.Номенклатура = ОбменДаннымиСобытияПотолки.ПолучитьНоменклатуруУИБ(ВнешнееСоединение, комСтрокаТовары.Номенклатура, Выборка.ГруппаНовойНоменклатуры, ТекстОшибки);
					Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
						Отказ = Истина;
						ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
						Прервать;	
					КонецЕсли;
					НоваяСтрока.ХарактеристикаНоменклатуры = ОбменДаннымиСобытияПотолки.ПолучитьХарактеристикуУИБ(ВнешнееСоединение, комСтрокаТовары.ХарактеристикаНоменклатуры, НоваяСтрока.Номенклатура);
					НоваяСтрока.ЕдиницаИзмерения = ОбменДаннымиСобытияПотолки.ПолучитьЕдиницуИзмеренияУИБ(ВнешнееСоединение, комСтрокаТовары.ЕдиницаИзмерения, НоваяСтрока.Номенклатура);
					
					ТекстОшибки = "";
					НоваяСтрока.Потолок = ОбменДаннымиСобытияПотолки.ПолучитьНоменклатуруУИБ(ВнешнееСоединение, комСтрокаТовары.Потолок, Выборка.ГруппаНовойНоменклатуры, ТекстОшибки);
					Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
						Отказ = Истина;
						ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
						Прервать;	
					КонецЕсли;
				КонецЦикла;
				
				Если Отказ Тогда
					Прервать;	
				КонецЕсли;
				
				ТаблицаУслуг.Очистить();
				Для каждого комСтрокаУслуг из комОбъект.Услуги Цикл
					НоваяСтрока = ТаблицаУслуг.Добавить();	
					ЗаполнитьЗначенияСвойств(НоваяСтрока, комСтрокаУслуг, "Коэффициент, Количество, Цена, СуммаРучнойСкидки, Сумма, СуммаНДС, ПроцентРучнойСкидки, Бесплатно");
					НоваяСтрока.СтавкаНДС = ОбменДаннымиСобытияПотолки.ПолучитьСтавкуНДСУИБ(ВнешнееСоединение, комСтрокаУслуг.СтавкаНДС);
					
					ТекстОшибки = "";
					НоваяСтрока.Номенклатура = ОбменДаннымиСобытияПотолки.ПолучитьНоменклатуруУИБ(ВнешнееСоединение, комСтрокаУслуг.Номенклатура, Выборка.ГруппаНовойНоменклатуры, ТекстОшибки);
					Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
						Отказ = Истина;
						ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
						Прервать;	
					КонецЕсли;
					НоваяСтрока.ХарактеристикаНоменклатуры = ОбменДаннымиСобытияПотолки.ПолучитьХарактеристикуУИБ(ВнешнееСоединение, комСтрокаТовары.ХарактеристикаНоменклатуры, НоваяСтрока.Номенклатура);
					НоваяСтрока.ЕдиницаИзмерения = ОбменДаннымиСобытияПотолки.ПолучитьЕдиницуИзмеренияУИБ(ВнешнееСоединение, комСтрокаТовары.ЕдиницаИзмерения, НоваяСтрока.Номенклатура);
					
					ТекстОшибки = "";
					НоваяСтрока.Потолок = ОбменДаннымиСобытияПотолки.ПолучитьНоменклатуруУИБ(ВнешнееСоединение, комСтрокаУслуг.Потолок, Выборка.ГруппаНовойНоменклатуры, ТекстОшибки);
					Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
						Отказ = Истина;
						ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
						Прервать;	
					КонецЕсли;
				КонецЦикла;
				
				Если Отказ Тогда
					Прервать;	
				КонецЕсли;
				
				ДанныеЗаполнения = Новый Структура("УИБ");
				ДанныеЗаполнения.Вставить("Товары", ТаблицаТоваров);
				ДанныеЗаполнения.Вставить("Услуги", ТаблицаУслуг);
				ДанныеЗаполнения.Вставить("СуммаДокумента", ТаблицаТоваров.Итог("Сумма") + ТаблицаУслуг.Итог("Сумма"));
				ДокОбъект.Товары.Очистить();
				ДокОбъект.Услуги.Очистить();
				ДокОбъект.ЗаполнитьТаблицыТоваровИУслугПоИнтеркампани(ДанныеЗаполнения);
				
				ДокОбъект.СуммаДокумента = ДокОбъект.Товары.Итог("Сумма") + ДокОбъект.Услуги.Итог("Сумма");
				
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);					
					ОбменДаннымиСобытияПотолки.ЗаписатьСоответствиеОбъектов(Выборка.Узел, ДокОбъект.Ссылка, СтроковыйГУИД, ТипСтрокой);
					
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					КоличествоСозданныхДокументов = КоличествоСозданныхДокументов + 1;
					
					ВнешнееСоединение.ПланыОбмена.УдалитьРегистрациюИзменений(комУзелОбмена, комОбъект);
				Исключение
					ТекстОшибки = ОписаниеОшибки();
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
					Сообщить(ТекстОшибки);
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат КоличествоСозданныхДокументов;
	
КонецФункции

Процедура ЗаполнитьДополнительноеСвойствоЛида(ДокументОбъект, Свойство, Значение="", ПерезаполнитьПринудительно = Ложь) Экспорт
	
	НайденнаяСтрока = ДокументОбъект.ДополнительныеСвойстваЛида.Найти(Свойство, "Свойство");
	Если НайденнаяСтрока = Неопределено Тогда
		НайденнаяСтрока = ДокументОбъект.ДополнительныеСвойстваЛида.Добавить();
		НайденнаяСтрока.Свойство = Свойство;
	КонецЕсли;
	Если ЗначениеЗаполнено(Значение) ИЛИ ПерезаполнитьПринудительно Тогда
		НайденнаяСтрока.Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеДополнительногоСвойстваЛида(ДокументСсылкаОбъект, Свойство, ЗначениеПоУмолчанию="") Экспорт
	
	НайденныеСтроки = ДокументСсылкаОбъект.ДополнительныеСвойстваЛида.НайтиСтроки(Новый Структура("Свойство", Свойство));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат НайденныеСтроки[0].Значение;
	
КонецФункции

Процедура УстановитьУсловноеОформлениеЦветТекста(ЭлементыУО, ИмяПоляУО, УО_ЛевоеЗначение, УО_ВидСравнения, УО_ПравоеЗначение, ЦветТекста) Экспорт
	
	Элемент = ЭлементыУО.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляУО);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = УО_ЛевоеЗначение;
	ОтборЭлемента.ВидСравнения   = УО_ВидСравнения;
	ОтборЭлемента.ПравоеЗначение = УО_ПравоеЗначение;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекста);
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеЦветФона(ЭлементыУО, ИмяПоляУО, УО_ЛевоеЗначение, УО_ВидСравнения, УО_ПравоеЗначение, ЦветФона) Экспорт
	
	Элемент = ЭлементыУО.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляУО);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = УО_ЛевоеЗначение;
	ОтборЭлемента.ВидСравнения   = УО_ВидСравнения;
	ОтборЭлемента.ПравоеЗначение = УО_ПравоеЗначение;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	
КонецПроцедуры

//#9470
Процедура ЗаполнитьЦеныПредыдущегоПоступления(Объект, ИмяТабличнойЧасти, Отбор = Неопределено) Экспорт
	
	ВариантОтображения = ПолучитьФункциональнуюОпцию("ВариантОтображенияПредыдущейЦеныВДокументахЗакупки");
	
	ТаблицаДанных = Объект[ИмяТабличнойЧасти].Выгрузить(,"Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения");
	
	Если НЕ Отбор = Неопределено Тогда
		ТаблицаДанных.Очистить();
		НоваяСтрока = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Отбор);
		
		НайденныеСтроки = Объект[ИмяТабличнойЧасти].НайтиСтроки(Отбор);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.ЦенаПредыдущегоПоступления = 0;
		КонецЦикла;
		
	Иначе
		Для каждого НайденнаяСтрока Из Объект[ИмяТабличнойЧасти] Цикл
			НайденнаяСтрока.ЦенаПредыдущегоПоступления = 0;
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.УстановитьПараметр("ВариантОтбора", ВариантОтображения);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);		
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
	Запрос.УстановитьПараметр("Дата", ?(Объект.Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Объект.Дата));
	
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаДанных.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ТЗ_Товары
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваров.Ссылка.Дата КАК Дата,
	|	ПоступлениеТоваров.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПоступлениеТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПоступлениеТоваров.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_Поступления
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ_Товары КАК ТЗ_Товары
	|		ПО (ТЗ_Товары.Номенклатура = ПоступлениеТоваров.Номенклатура)
	|			И (ТЗ_Товары.ХарактеристикаНоменклатуры = ПоступлениеТоваров.ХарактеристикаНоменклатуры)
	|			И (ТЗ_Товары.ЕдиницаИзмерения = ПоступлениеТоваров.ЕдиницаИзмерения)
	|ГДЕ
	|	ПоступлениеТоваров.Ссылка.Проведен
	|	И ВЫБОР
	|			КОГДА &ВариантОтбора = 0
	|				ТОГДА ПоступлениеТоваров.Ссылка.Контрагент = &Контрагент
	|						И ПоступлениеТоваров.Ссылка.ДоговорКонтрагента = &Договор
	|			КОГДА &ВариантОтбора = 1
	|				ТОГДА ПоступлениеТоваров.Ссылка.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ПоступлениеТоваров.Ссылка.Валюта = &Валюта
	|	И ПоступлениеТоваров.Ссылка.Проведен
	|	И ПоступлениеТоваров.Ссылка.Дата < &Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеУслуг.Ссылка.Дата,
	|	ПоступлениеУслуг.Номенклатура,
	|	ПоступлениеУслуг.ХарактеристикаНоменклатуры,
	|	ПоступлениеУслуг.ЕдиницаИзмерения,
	|	ПоступлениеУслуг.Цена
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ_Товары КАК ТЗ_Товары
	|		ПО (ТЗ_Товары.Номенклатура = ПоступлениеУслуг.Номенклатура)
	|			И (ТЗ_Товары.ХарактеристикаНоменклатуры = ПоступлениеУслуг.ХарактеристикаНоменклатуры)
	|			И (ТЗ_Товары.ЕдиницаИзмерения = ПоступлениеУслуг.ЕдиницаИзмерения)
	|ГДЕ
	|	ПоступлениеУслуг.Ссылка.Проведен
	|	И ВЫБОР
	|			КОГДА &ВариантОтбора = 0
	|				ТОГДА ПоступлениеУслуг.Ссылка.Контрагент = &Контрагент
	|						И ПоступлениеУслуг.Ссылка.ДоговорКонтрагента = &Договор
	|			КОГДА &ВариантОтбора = 1
	|				ТОГДА ПоступлениеУслуг.Ссылка.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ПоступлениеУслуг.Ссылка.Валюта = &Валюта
	|	И ПоступлениеУслуг.Ссылка.Проведен
	|	И ПоступлениеУслуг.Ссылка.Дата < &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НоменклатураМаксДата.Номенклатура КАК Номенклатура,
	|	ВТ_Поступления.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Поступления.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Поступления.Цена КАК ЦенаПредыдущегоПоступления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Поступления.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ВТ_Поступления.Дата) КАК Дата,
	|		ВТ_Поступления.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВТ_Поступления.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|	ИЗ
	|		ТЗ_Товары КАК ТЗ_Товары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Поступления КАК ВТ_Поступления
	|			ПО ТЗ_Товары.Номенклатура = ВТ_Поступления.Номенклатура
	|				И ТЗ_Товары.ХарактеристикаНоменклатуры = ВТ_Поступления.ХарактеристикаНоменклатуры
	|				И ТЗ_Товары.ЕдиницаИзмерения = ВТ_Поступления.ЕдиницаИзмерения
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_Поступления.Номенклатура,
	|		ВТ_Поступления.ХарактеристикаНоменклатуры,
	|		ВТ_Поступления.ЕдиницаИзмерения) КАК НоменклатураМаксДата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Поступления КАК ВТ_Поступления
	|		ПО НоменклатураМаксДата.Номенклатура = ВТ_Поступления.Номенклатура
	|			И НоменклатураМаксДата.Дата = ВТ_Поступления.Дата
	|			И НоменклатураМаксДата.ХарактеристикаНоменклатуры = ВТ_Поступления.ХарактеристикаНоменклатуры
	|			И НоменклатураМаксДата.ЕдиницаИзмерения = ВТ_Поступления.ЕдиницаИзмерения";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения");
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		
		НайденныеСтроки = Объект[ИмяТабличнойЧасти].НайтиСтроки(Отбор);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.ЦенаПредыдущегоПоступления = Выборка.ЦенаПредыдущегоПоступления;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправкаПисемПоЗаданиям() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
	Метаданные.РегламентныеЗадания.ОтправкаПисемПоЗаданиям);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаданияНаОтправкуЭлектронныхПисем.Документ КАК Документ,
	|	ЗаданияНаОтправкуЭлектронныхПисем.ВидЗадания КАК ВидЗадания,
	|	ЗаданияНаОтправкуЭлектронныхПисем.Организация КАК Организация,
	|	ЗаданияНаОтправкуЭлектронныхПисем.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.ЗаданияНаОтправкуЭлектронныхПисем КАК ЗаданияНаОтправкуЭлектронныхПисем
	|ИТОГИ ПО
	|	ВидЗадания";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВидЗадания = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВидЗадания.Следующий() Цикл
		
		//#9194
		Если ВыборкаВидЗадания.ВидЗадания = Перечисления.ВидыЗаданийНаОтправкуЭлектронныхПисем.ОтправкаДетализацииВзаиморасчетов Тогда
			
			//#13710
			Если НЕ Константы.ОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетов.Получить() Тогда
				Продолжить;
			КонецЕсли;
			
			ВариантОтчета = Константы.ИмяВариантаОтчетаДетализацииВзаиморасчетовДляОтправки.Получить();
			Если НЕ ЗначениеЗаполнено(ВариантОтчета) Тогда
				ЗаписьЖурналаРегистрации("ФоновоеЗадание.ОтправкаПисемПоЗаданиям", УровеньЖурналаРегистрации.Ошибка, , , "Не задан вариант отчета детализации взаиморасчетов");
				Возврат;	
			КонецЕсли;
			ПериодОтчета = Константы.ПериодОтчетаДетализацииВзаиморасчетовДляОтправки.Получить();
			//Если НЕ ЗначениеЗаполнено(ПериодОтчета) Тогда
			//	ЗаписьЖурналаРегистрации("ФоновоеЗадание.ОтправкаПисемПоЗаданиям", УровеньЖурналаРегистрации.Ошибка, , , "Не задан период отчета детализации взаиморасчетов");
			//	Возврат;	
			//КонецЕсли;
			
			ТаблицаДанных = Новый ТаблицаЗначений;
			ТаблицаДанных.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
			Выборка = ВыборкаВидЗадания.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = ТаблицаДанных.Добавить();
				НоваяСтрока.Контрагент = Выборка.Контрагент;
			КонецЦикла;
			ТаблицаДанных.Свернуть("Контрагент");
			
			Для каждого СтрокаТЗ из ТаблицаДанных Цикл				
				ПочтаКлиента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СтрокаТЗ.Контрагент, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
				Если НЕ ПустаяСтрока(ПочтаКлиента) Тогда
					РезультатОтправки = СформироватьИОтправитьОтчетДетализацииВзаиморасчетов(ВариантОтчета, ПериодОтчета, СтрокаТЗ.Контрагент);
					Если НЕ РезультатОтправки = Истина Тогда
						ЗаписьЖурналаРегистрации("ФоновоеЗадание.ОтправкаПисемПоЗаданиям", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка отправки письма");
					Иначе
						ОбработатьОчередьЗаданийНаОтправкуЭлектронныхПисем(ВыборкаВидЗадания.ВидЗадания, СтрокаТЗ.Контрагент);
					КонецЕсли;
				Иначе
					// возможно пометить такие заказы обработанными					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

Функция СформироватьИОтправитьОтчетДетализацииВзаиморасчетов(ИмяВариантаОтчета, ПериодОтчета, Контрагент, ТолькоСформироватьОтчет = Ложь) Экспорт
	
	Если ТипЗнч(ИмяВариантаОтчета) = Тип("Строка") Тогда
		СхемаКомпоновкиДанных = Отчеты.ДетализацияВзаиморасчетовСКонтрагентом.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		МакетОформления = Отчеты.ДетализацияВзаиморасчетовСКонтрагентом.ПолучитьМакет("МакетОформления");
		
		ВариантОтчета = Неопределено;
		Для каждого ВариантОтчетаСКД из СхемаКомпоновкиДанных.ВариантыНастроек Цикл
			Если ВариантОтчетаСКД.Имя = ИмяВариантаОтчета Тогда
				ВариантОтчета = ВариантОтчетаСКД;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		//#14300 использование дополнительного отчета		
		МакетОформления = Неопределено;
		Попытка
			ВнешнийОбъект = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ИмяВариантаОтчета);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
		ОтчетМетаданные = ВнешнийОбъект.Метаданные();
		СхемаКДМетаданные = ОтчетМетаданные.ОсновнаяСхемаКомпоновкиДанных;
		Если СхемаКДМетаданные <> Неопределено Тогда
			СхемаКомпоновкиДанных = ВнешнийОбъект.ПолучитьМакет(СхемаКДМетаданные.Имя);
			Для каждого ВариантОтчетаСКД из СхемаКомпоновкиДанных.ВариантыНастроек Цикл
				Если ВариантОтчетаСКД.Имя = "Основной" Тогда
					ВариантОтчета = ВариантОтчетаСКД;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ВариантОтчета = Неопределено Тогда
				Возврат Неопределено;	
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли; 	
	
	НастройкиОСКД = ВариантОтчета.Настройки;
	
	ПараметрыДанныхОСКД = НастройкиОСКД.ПараметрыДанных.Элементы;
	
	ЭлементНачалоПериода = ПараметрыДанныхОСКД.Найти("НачалоПериода"); // должен быть в отчете
	ЭлементНачалоПериода.Использование = Истина;
	ЭлементНачалоПериода.Значение = НачалоДня(ТекущаяДата() - ПериодОтчета*86400);	
	
	ЭлементКонецПериода = ПараметрыДанныхОСКД.Найти("КонецПериода"); // должен быть в отчете	
	ЭлементКонецПериода.Использование = Истина;	
	ЭлементКонецПериода.Значение = КонецДня(ТекущаяДата());
	
	ПолеКомпоновкиКонтрагент = Новый ПолеКомпоновкиДанных("Контрагент"); // должен быть в отчете	
	Для каждого ЭлементОтбора Из НастройкиОСКД.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиКонтрагент Тогда
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Контрагент;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОСКД, , МакетОформления);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// дополнительная обработка результата отчета
	Если ТипЗнч(ИмяВариантаОтчета) = Тип("Строка") Тогда
		ОтчетОбъект = Отчеты.ДетализацияВзаиморасчетовСКонтрагентом.Создать();
		ОтчетОбъект.ПослеКомпоновкиРезультата(ДокументРезультат);
	КонецЕсли;
	
	Если ТолькоСформироватьОтчет Тогда
		// при вызове с формы настроек программы для проверки
		Возврат ДокументРезультат;
	КонецЕсли;
	
	ПисьмоСсылка = РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмоСОтчетом(ДокументРезультат, "Детализация взаиморасчетов", Контрагент, "xls", Истина);
	Если ЗначениеЗаполнено(ПисьмоСсылка) Тогда
		ТекстОтправки = Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(ПисьмоСсылка);
		Возврат ПустаяСтрока(ТекстОтправки);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ОбработатьОчередьЗаданийНаОтправкуЭлектронныхПисем(ВидЗадания, Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЗадания", ВидЗадания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаданияНаОтправкуЭлектронныхПисем.Документ КАК Документ,
	|	ЗаданияНаОтправкуЭлектронныхПисем.ВидЗадания КАК ВидЗадания,
	|	ЗаданияНаОтправкуЭлектронныхПисем.Организация КАК Организация,
	|	ЗаданияНаОтправкуЭлектронныхПисем.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.ЗаданияНаОтправкуЭлектронныхПисем КАК ЗаданияНаОтправкуЭлектронныхПисем
	|ГДЕ
	|	ЗаданияНаОтправкуЭлектронныхПисем.ВидЗадания = &ВидЗадания
	|	И ЗаданияНаОтправкуЭлектронныхПисем.Контрагент = &Контрагент";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		НаборЗаписей = РегистрыСведений.ЗаданияНаОтправкуЭлектронныхПисем.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ); 
		НаборЗаписей.Отбор.ВидЗадания.Установить(Выборка.ВидЗадания);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ДополнитьОписаниеДатыЗапрета(ЭлементОписаниеДатыЗапрета) Экспорт
	
	ЭлементОписаниеДатыЗапрета.СписокВыбора.Добавить("СтаршеУказанныхДней",    "Старше указанного количества дней");	
	ЭлементОписаниеДатыЗапрета.СписокВыбора.Добавить("СтаршеУказанныхМесяцев", "Старше указанного количества месяцев");
	
	//#16658
	ЭлементОписаниеДатыЗапрета.СписокВыбора.Вставить(1, "БезЗапрета",    		"Без запрета");
	
КонецПроцедуры

Функция ТипВМассиве(ТипИлиОписаниеТипов, МассивТипов) Экспорт
	Если ТипЗнч(ТипИлиОписаниеТипов) = Тип("ОписаниеТипов") Тогда
		Для Каждого Тип Из ТипИлиОписаниеТипов.Типы() Цикл
			Если МассивТипов.Найти(Тип) <> Неопределено Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		Возврат Ложь
	Иначе
		Возврат МассивТипов.Найти(ТипИлиОписаниеТипов) <> Неопределено;
	КонецЕсли;
КонецФункции

Функция ОбъединитьТипы(Тип1, Тип2) Экспорт
	Тип1ЭтоОписаниеТипов = ТипЗнч(Тип1) = Тип("ОписаниеТипов");
	Тип2ЭтоОписаниеТипов = ТипЗнч(Тип2) = Тип("ОписаниеТипов");
	Если Тип1ЭтоОписаниеТипов И Тип1.Типы().Количество() > 0 Тогда
		ИсходноеОписаниеТипов = Тип1;
		ДобавляемыеТипы = ?(Тип2ЭтоОписаниеТипов, Тип2.Типы(), ЗначениеВМассив(Тип2));
	ИначеЕсли Тип2ЭтоОписаниеТипов И Тип2.Типы().Количество() > 0 Тогда
		ИсходноеОписаниеТипов = Тип2;
		ДобавляемыеТипы = ЗначениеВМассив(Тип1);
	ИначеЕсли ТипЗнч(Тип1) <> Тип("Тип") Тогда
		Возврат Тип2;
	ИначеЕсли ТипЗнч(Тип2) <> Тип("Тип") Тогда
		Возврат Тип1;
	Иначе
		Типы = Новый Массив;
		Типы.Добавить(Тип1);
		Типы.Добавить(Тип2);
		Возврат Новый ОписаниеТипов(Типы);
	КонецЕсли;
	Если ДобавляемыеТипы.Количество() = 0 Тогда
		Возврат ИсходноеОписаниеТипов;
	Иначе
		Возврат Новый ОписаниеТипов(ИсходноеОписаниеТипов, ДобавляемыеТипы);
	КонецЕсли;
КонецФункции

Функция ЗначениеВМассив(Значение) Экспорт
	Результат = Новый Массив;
	Результат.Добавить(Значение);
	Возврат Результат;
КонецФункции

#Область РаботаСАдресами

Функция ЕстьГородаВСправочнике() Экспорт
	
	//проверим наличие городов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Города.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Города КАК Города";
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьПредставленияНаселенныхПунктовПоНаименованию(Наименование, КодКЛАДР = 0, ИсключитьМунициальные = Истина) Экспорт
	
	Если ПустаяСтрока(Наименование) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоФразы", Наименование);
	Запрос.УстановитьПараметр("КодКЛАДР", КодКЛАДР);	
	Запрос.УстановитьПараметр("ПоискПоКодуКЛАДР", НЕ КодКЛАДР=0);
	
	ЭтоГородФедеральногоЗначения = Ложь;			
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АдресныеОбъекты.КодКЛАДР КАК КодКЛАДР,
	|	АдресныеОбъекты.Наименование КАК Наименование,
	|	АдресныеОбъекты.КодСубъектаРФ КАК КодСубъектаРФ,
	|	АдресныеОбъекты.Идентификатор КАК Идентификатор,
	|	АдресныеОбъекты.Наименование + "" "" + АдресныеОбъекты.Сокращение КАК Представление
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПоискПоКодуКЛАДР
	|				ТОГДА АдресныеОбъекты.КодКЛАДР = &КодКЛАДР
	|			ИНАЧЕ АдресныеОбъекты.Наименование = &НачалоФразы
	|		КОНЕЦ
	|	И АдресныеОбъекты.Уровень = 1";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЭтоГородФедеральногоЗначения = Истина;
		
		СтруктураАдреса = Новый Структура;
		
		СтруктураАдреса.Вставить("Адрес", "");
		СтруктураАдреса.Вставить("ЗагруженныеДанные", Истина);	
		СтруктураАдреса.Вставить("Идентификатор", Выборка.Идентификатор);
		СтруктураАдреса.Вставить("КодКЛАДР", Выборка.КодКЛАДР);
		СтруктураАдреса.Вставить("Муниципальный", Ложь);
		СтруктураАдреса.Вставить("Отказ", Ложь);
		СтруктураАдреса.Вставить("ПредлагатьЗагрузкуКлассификатора", Ложь);
		СтруктураАдреса.Вставить("Представление", Выборка.Представление);
		
		Результат.Добавить(СтруктураАдреса);			
	КонецЕсли;	
	
	Если НЕ ЭтоГородФедеральногоЗначения
		ИЛИ КодКЛАДР = 0 // подбор кода в справочнике Города
		Тогда
		// запрос на основе функции АдресныйКлассификаторСлужебный.КаскадныйСписокАвтоподбораНаселенногоПункта()
		
		Запрос.Текст = КаскадныйСписокАвтоподбораНаселенногоПункта();
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ИсключитьМунициальные И Выборка.Муниципальный Тогда
				Продолжить;
			КонецЕсли;		
			
			СтруктураАдреса = Новый Структура;
			
			СтруктураАдреса.Вставить("Адрес", "");
			СтруктураАдреса.Вставить("ЗагруженныеДанные", Истина);	
			СтруктураАдреса.Вставить("Идентификатор", Выборка.Идентификатор);
			СтруктураАдреса.Вставить("КодКЛАДР", Выборка.КодКЛАДР);
			СтруктураАдреса.Вставить("Муниципальный", Выборка.Муниципальный); //Ложь);
			СтруктураАдреса.Вставить("Отказ", Ложь);
			СтруктураАдреса.Вставить("ПредлагатьЗагрузкуКлассификатора", Ложь);
			СтруктураАдреса.Вставить("Представление", Выборка.Представление);
			
			Результат.Добавить(СтруктураАдреса);			
		КонецЦикла;
	КонецЕсли;	
	
	Возврат Результат;
		
КонецФункции 

Функция ПредставлениеАдреса(Город, Адрес) Экспорт
	
	ПредставлениеАдреса = "";
	ПредставлениеГорода = "";
	Если ЗначениеЗаполнено(Город) Тогда
		// разворачиваем адрес по городу
		РеквизитыГорода = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Город, "КодКЛАДР, Наименование");
		Если ЗначениеЗаполнено(РеквизитыГорода.КодКЛАДР) Тогда
			МассивГородов = ОбщийМодульСервер.ПолучитьПредставленияНаселенныхПунктовПоНаименованию(РеквизитыГорода.Наименование, РеквизитыГорода.КодКЛАДР);
			Если МассивГородов.Количество() = 1 Тогда
				СтруктураАдресаДетально = Обработки.РасширенныйВводКонтактнойИнформации.СписокРеквизитовНаселенныйПункт(МассивГородов[0]);
				ПредставлениеГорода = ОбщийМодульСервер.ПредставлениеНаселенногоПунктаАдреса(СтруктураАдресаДетально);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	ПредставлениеАдреса = ПредставлениеГорода;
	
	Если ЗначениеЗаполнено(Адрес) Тогда
		ПредставлениеАдреса = ПредставлениеАдреса + ?(ЗначениеЗаполнено(ПредставлениеАдреса), ", ", "") + Адрес;	
	КонецЕсли;
	
	Возврат ПредставлениеАдреса;
	
КонецФункции

// запрос на основе функции АдресныйКлассификаторСлужебный.КаскадныйСписокАвтоподбораНаселенногоПункта()	
Функция	КаскадныйСписокАвтоподбораНаселенногоПункта()
	
	Возврат
	"ВЫБРАТЬ ПЕРВЫЕ 10
	|	ВЫБОР
	|		КОГДА АдресныеОбъекты.Уровень = 31
	|				ИЛИ АдресныеОбъекты.Уровень = 41
	|		ТОГДА АдресныеОбъекты.Наименование
	|		ИНАЧЕ АдресныеОбъекты.Наименование + "" "" + АдресныеОбъекты.Сокращение
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ АдресныеОбъектыУровень1.Наименование ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА АдресныеОбъектыУровень1.Уровень = 31
	|							ИЛИ АдресныеОбъектыУровень1.Уровень = 41
	|						ТОГДА "", "" + АдресныеОбъектыУровень1.Наименование
	|					ИНАЧЕ "", "" + АдресныеОбъектыУровень1.Наименование + "" "" + АдресныеОбъектыУровень1.Сокращение
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ АдресныеОбъектыУровень2.Наименование ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА АдресныеОбъектыУровень2.Уровень = 31
	|							ИЛИ АдресныеОбъектыУровень2.Уровень = 41
	|						ТОГДА "", "" + АдресныеОбъектыУровень2.Наименование
	|					ИНАЧЕ "", "" + АдресныеОбъектыУровень2.Наименование + "" "" + АдресныеОбъектыУровень2.Сокращение
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ АдресныеОбъектыУровень3.Наименование ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА АдресныеОбъектыУровень3.Уровень = 31
	|							ИЛИ АдресныеОбъектыУровень3.Уровень = 41
	|						ТОГДА "", "" + АдресныеОбъектыУровень3.Наименование
	|					ИНАЧЕ "", "" + АдресныеОбъектыУровень3.Наименование + "" "" + АдресныеОбъектыУровень3.Сокращение
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ АдресныеОбъектыУровень4.Наименование ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА АдресныеОбъектыУровень4.Уровень = 31
	|							ИЛИ АдресныеОбъектыУровень4.Уровень = 41
	|						ТОГДА "", "" + АдресныеОбъектыУровень4.Наименование
	|					ИНАЧЕ "", "" + АдресныеОбъектыУровень4.Наименование + "" "" + АдресныеОбъектыУровень4.Сокращение
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ АдресныеОбъектыУровень5.Наименование ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА АдресныеОбъектыУровень5.Уровень = 31
	|							ИЛИ АдресныеОбъектыУровень5.Уровень = 41
	|						ТОГДА "", "" + АдресныеОбъектыУровень5.Наименование
	|					ИНАЧЕ "", "" + АдресныеОбъектыУровень5.Наименование + "" "" + АдресныеОбъектыУровень5.Сокращение
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Представление,
	|	АдресныеОбъекты.Идентификатор КАК Идентификатор,
	//++
	|	АдресныеОбъекты.КодКЛАДР КАК КодКЛАДР,
	//--
	|	ИСТИНА КАК Муниципальный,
	|	АдресныеОбъекты.ДополнительныеАдресныеСведения КАК ДополнительныеАдресныеСведения,
	|	ВЫБОР
	|		КОГДА АдресныеОбъекты.Уровень < 10
	|			ТОГДА АдресныеОбъекты.Уровень * 10
	|		ИНАЧЕ АдресныеОбъекты.Уровень
	|	КОНЕЦ КАК Уровень
	|ПОМЕСТИТЬ МуниципальныеАдреса
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыУровень1
	|		ПО АдресныеОбъекты.МуниципальныйРодительскийИдентификатор = АдресныеОбъектыУровень1.Идентификатор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыУровень2
	|		ПО (АдресныеОбъектыУровень1.МуниципальныйРодительскийИдентификатор = АдресныеОбъектыУровень2.Идентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыУровень3
	|		ПО (АдресныеОбъектыУровень2.МуниципальныйРодительскийИдентификатор = АдресныеОбъектыУровень3.Идентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыУровень4
	|		ПО (АдресныеОбъектыУровень3.МуниципальныйРодительскийИдентификатор = АдресныеОбъектыУровень4.Идентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыУровень5
	|		ПО (АдресныеОбъектыУровень4.МуниципальныйРодительскийИдентификатор = АдресныеОбъектыУровень5.Идентификатор)
	|ГДЕ
	//|	АдресныеОбъекты.Наименование ПОДОБНО &НачалоФразы
	|	ВЫБОР
	|			КОГДА &ПоискПоКодуКЛАДР
	|				ТОГДА АдресныеОбъекты.КодКЛАДР = &КодКЛАДР
	|			ИНАЧЕ АдресныеОбъекты.Наименование = &НачалоФразы
	|		КОНЕЦ
	|	И АдресныеОбъекты.Уровень <> 7
	|	И АдресныеОбъекты.Уровень <> 4
	|	И АдресныеОбъекты.Уровень <> 3
	//++
	|	И АдресныеОбъекты.Уровень В (4, 6)
	//--
	|
	|УПОРЯДОЧИТЬ ПО
	|	АдресныеОбъекты.Уровень
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 10
	|	АдресныеОбъекты.Наименование + "" "" + АдресныеОбъекты.Сокращение + ВЫБОР
	|		КОГДА НЕ АдресныеОбъектыУровень1.Наименование ЕСТЬ NULL
	|			ТОГДА "", "" + АдресныеОбъектыУровень1.Наименование + "" "" + АдресныеОбъектыУровень1.Сокращение
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ АдресныеОбъектыУровень2.Наименование ЕСТЬ NULL
	|			ТОГДА "", "" + АдресныеОбъектыУровень2.Наименование + "" "" + АдресныеОбъектыУровень2.Сокращение
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ АдресныеОбъектыУровень3.Наименование ЕСТЬ NULL
	|			ТОГДА "", "" + АдресныеОбъектыУровень3.Наименование + "" "" + АдресныеОбъектыУровень3.Сокращение
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ АдресныеОбъектыУровень4.Наименование ЕСТЬ NULL
	|			ТОГДА "", "" + АдресныеОбъектыУровень4.Наименование + "" "" + АдресныеОбъектыУровень4.Сокращение
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ АдресныеОбъектыУровень5.Наименование ЕСТЬ NULL
	|			ТОГДА "", "" + АдресныеОбъектыУровень5.Наименование + "" "" + АдресныеОбъектыУровень5.Сокращение
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Представление,
	|	АдресныеОбъекты.Идентификатор КАК Идентификатор,
	//++
	|	АдресныеОбъекты.КодКЛАДР КАК КодКЛАДР,
	//--
	|	ЛОЖЬ КАК Муниципальный,
	|	АдресныеОбъекты.ДополнительныеАдресныеСведения КАК ДополнительныеАдресныеСведения,
	|	ВЫБОР
	|		КОГДА АдресныеОбъекты.Уровень < 10
	|			ТОГДА АдресныеОбъекты.Уровень * 10
	|		ИНАЧЕ АдресныеОбъекты.Уровень
	|	КОНЕЦ КАК Уровень
	|ПОМЕСТИТЬ АдминистративныеАдреса
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыУровень1
	|		ПО АдресныеОбъекты.РодительскийИдентификатор = АдресныеОбъектыУровень1.Идентификатор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыУровень2
	|		ПО (АдресныеОбъектыУровень1.РодительскийИдентификатор = АдресныеОбъектыУровень2.Идентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыУровень3
	|		ПО (АдресныеОбъектыУровень2.РодительскийИдентификатор = АдресныеОбъектыУровень3.Идентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыУровень4
	|		ПО (АдресныеОбъектыУровень3.РодительскийИдентификатор = АдресныеОбъектыУровень4.Идентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыУровень5
	|		ПО (АдресныеОбъектыУровень4.РодительскийИдентификатор = АдресныеОбъектыУровень5.Идентификатор)
	|ГДЕ
	//|	АдресныеОбъекты.Наименование ПОДОБНО &НачалоФразы
	|	ВЫБОР
	|			КОГДА &ПоискПоКодуКЛАДР
	|				ТОГДА АдресныеОбъекты.КодКЛАДР = &КодКЛАДР
	|			ИНАЧЕ АдресныеОбъекты.Наименование = &НачалоФразы
	|		КОНЕЦ
	|	И АдресныеОбъекты.Уровень <> 7
	|	И АдресныеОбъекты.Уровень <> 41
	|	И АдресныеОбъекты.Уровень <> 31
	//++
	|	И АдресныеОбъекты.Уровень В (4, 6)
	//--
	|
	|УПОРЯДОЧИТЬ ПО
	|	АдресныеОбъекты.Уровень
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МуниципальныеАдреса.Представление КАК Представление,
	|	МуниципальныеАдреса.Идентификатор КАК Идентификатор,
	//++
	|	МуниципальныеАдреса.КодКЛАДР КАК КодКЛАДР,
	//--
	|	МуниципальныеАдреса.Муниципальный КАК Муниципальный,
	|	МуниципальныеАдреса.ДополнительныеАдресныеСведения КАК ДополнительныеАдресныеСведения,
	|	ДополнительныеСведения.ПочтовыйИндекс КАК ПочтовыйИндекс,
	|	МуниципальныеАдреса.Уровень КАК Уровень
	|ИЗ
	|	МуниципальныеАдреса КАК МуниципальныеАдреса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеАдресныеСведения КАК ДополнительныеСведения
	|		ПО МуниципальныеАдреса.ДополнительныеАдресныеСведения = ДополнительныеСведения.Идентификатор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АдминистративныеАдреса.Представление,
	|	АдминистративныеАдреса.Идентификатор,
	//++
	|	АдминистративныеАдреса.КодКЛАДР КАК КодКЛАДР,
	//--
	|	АдминистративныеАдреса.Муниципальный,
	|	АдминистративныеАдреса.ДополнительныеАдресныеСведения,
	|	ДополнительныеСведения.ПочтовыйИндекс,
	|	АдминистративныеАдреса.Уровень
	|ИЗ
	|	АдминистративныеАдреса КАК АдминистративныеАдреса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеАдресныеСведения КАК ДополнительныеСведения
	|		ПО АдминистративныеАдреса.ДополнительныеАдресныеСведения = ДополнительныеСведения.Идентификатор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень";
	
КонецФункции

// полная копия Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса.Функция.ПредставлениеНаселенногоПунктаАдреса
Функция ПредставлениеНаселенногоПунктаАдреса(Адрес) Экспорт
	
	СписокЗаполненныхУровней = Новый Массив;
	
	Для каждого ИмяУровня Из РаботаСАдресамиКлиентСервер.ИменаУровнейАдреса(Адрес.AddressType, Ложь) Цикл
		
		Если СтрСравнить(ИмяУровня, "locality") = 0
			И РаботаСАдресамиКлиентСервер.ЭтоМуниципальныйАдрес(Адрес.AddressType)
			И ЗначениеЗаполнено(Адрес.city)
			И ПустаяСтрока(Адрес.locality) Тогда
				СписокЗаполненныхУровней.Добавить(Адрес["city"] + " " + Адрес["cityType"]);
			ИначеЕсли ЗначениеЗаполнено(Адрес[ИмяУровня]) Тогда
			
			Если НЕ РаботаСАдресамиКлиентСервер.ПредставлениеУровняБезСокращения(ИмяУровня) Тогда
				СписокЗаполненныхУровней.Добавить(Адрес[ИмяУровня] + " " + Адрес[ИмяУровня + "Type"]);
			Иначе
				СписокЗаполненныхУровней.Добавить(Адрес[ИмяУровня]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(СписокЗаполненныхУровней, ", ");
	
КонецФункции

Функция ИдентификаторГородаНаселенногоПункта(Город) Экспорт
	
	Если Не ЗначениеЗаполнено(Город) Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АдресныеОбъекты.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК СправочникГорода
	|		ПО (СправочникГорода.Ссылка = &Город)
	|			И АдресныеОбъекты.КодКЛАДР = СправочникГорода.КодКЛАДР
	|			И НЕ СправочникГорода.КодКЛАДР = 0
	|ГДЕ
	|	АдресныеОбъекты.Уровень В (1, 4, 6)";
	
	Запрос.УстановитьПараметр("Город", Город);
	
	РезультатЗапроса = Запрос.Выполнить();		
	Если НЕ РезультатЗапроса.Пустой() Тогда			
		Возврат РезультатЗапроса.Выгрузить()[0].Идентификатор;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	
КонецФункции	
				
Процедура ЗаполнитьКодыАдреса(Город, КодГорода, КодНасПункта, КодСубъектаРФ, ИдентификаторРодителя = Неопределено) Экспорт
	
	КодГорода = 0;
	КодНасПункта = 0;
	КодСубъектаРФ = 0;
	
	// №14051
	Если Не ИдентификаторРодителя = Неопределено Тогда
		ИдентификаторРодителя = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Город) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЭтоМосква", ВРег(СокрЛП(Город)) = "МОСКВА");
		Запрос.УстановитьПараметр("Наименование", Строка(Город));
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА АдресныеОбъекты.Уровень = 4
		|				ИЛИ &ЭтоМосква
		|			ТОГДА АдресныеОбъекты.КодКЛАДР
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КодГорода,
		|	ВЫБОР
		|		КОГДА АдресныеОбъекты.Уровень = 6
		|			ТОГДА АдресныеОбъекты.КодКЛАДР
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КодНасПункта,
		|	АдресныеОбъекты.КодСубъектаРФ КАК КодСубъектаРФ,
		|	АдресныеОбъекты.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
		|ГДЕ
		|	АдресныеОбъекты.Наименование = &Наименование
		|	И ВЫБОР
		|			КОГДА &ЭтоМосква
		|				ТОГДА АдресныеОбъекты.Уровень = 1
		|			ИНАЧЕ АдресныеОбъекты.Уровень В (4, 6)
		|		КОНЕЦ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			КодГорода = Выборка.КодГорода;
			КодНасПункта = Выборка.КодНасПункта;
			КодСубъектаРФ = Выборка.КодСубъектаРФ;
			
			Если Не ИдентификаторРодителя = Неопределено Тогда
				//Идентификатор города как ИдентификаторРодителя при поиске улиц
				ИдентификаторРодителя = Выборка.Идентификатор;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьАдресаРегионаФиас2(КодСубъектаСтрокой) Экспорт
	
	ИДСубъекта = КодСубъектаСтрокой;
	Если Лев(КодСубъектаСтрокой, 1) = "0" Тогда
		ИДСубъекта = Сред(ИДСубъекта, 2);	
	КонецЕсли;
	
	ИмяФайлаZIP = КаталогВременныхФайлов() + КодСубъектаСтрокой + ".zip";
	Хост = "its.1c.ru";
	Ресурс = "/download/fias/download2?id=" + ИДСубъекта;
	
	Попытка
		
		HTTP =  Новый HTTPСоединение(Хост,,,,, 30, Новый ЗащищенноеСоединениеOpenSSL());		
		HTTPЗапрос = Новый HTTPЗапрос(Ресурс);	
		РезультатЗапроса = HTTP.Получить(HTTPЗапрос, ИмяФайлаZIP);
		
		Если РезультатЗапроса.КодСостояния = 200 Тогда
			
			Коды = Новый Массив;
			Коды.Добавить(Число(ИДСубъекта));
			
			ПараметрыЗагрузки = АдресныйКлассификаторСлужебный.ПараметрыЗагрузкиКлассификатораАдресов();
			ПараметрыЗагрузки.ОповещатьОПрогрессе = Ложь;
			
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Коды);			
			
			ОписаниеФайлов = Новый Массив;
			
			ДанныеФайла = Новый Структура("Имя, ВремяИзменения", ИмяФайлаZIP, ТекущаяДатаСеанса());
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаZIP);
			
			ДанныеФайла.Вставить("Хранение", ДвоичныеДанные); 
			ОписаниеФайлов.Добавить(ДанныеФайла);
			
			ПараметрыМетода.Добавить(ОписаниеФайлов);
			ПараметрыМетода.Добавить(ПараметрыЗагрузки);			
			
			АдресныйКлассификаторСлужебный.ФоновоеЗаданиеЗагрузкиКлассификатораАдресов(ПараметрыМетода, Неопределено); //ПараметрыВыполнения);
			
			УдалитьФайлы(ИмяФайлаZIP);
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры 

Процедура ОбработкаВыбораАдресаИзКлассификатора(АдресJSON, Город, Адрес, ИдентификаторНаселенногоПункта) Экспорт
	
	АдресСтруктура = АдресныйКлассификаторСлужебный.JSONВКонтактнуюИнформациюПоПолям(АдресJSON);
	
	Регион = СокрЛП(АдресСтруктура.Area + " " + АдресСтруктура.AreaType);
	
	ГородНП = "";
	ИдентификаторНаселенногоПункта = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		
	Если РаботаСАдресами.ЭтоГородФедеральногоЗначения(Регион) Тогда
		ГородНП = Регион;
		ИдентификаторНаселенногоПункта = АдресСтруктура.areaId;
		
	ИначеЕсли ЗначениеЗаполнено(АдресСтруктура.City) Тогда
		ГородНП = СокрЛП(АдресСтруктура.City + " " + АдресСтруктура.CityType);
		ИдентификаторНаселенногоПункта = АдресСтруктура.cityId;
		
	ИначеЕсли ЗначениеЗаполнено(АдресСтруктура.locality) Тогда    //если не указан город, ищем населенный пункт 
		ГородНП = СокрЛП(АдресСтруктура.locality + " " + АдресСтруктура.localityType);
		ИдентификаторНаселенногоПункта = АдресСтруктура.localityId;
	КонецЕсли;
		
	АдресПредставление = АдресСтруктура.value;
		
	// проверим не изменился ли город
	Если НЕ ИдентификаторНаселенногоПункта = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
		КодКЛАДРТекущий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Город, "КодКЛАДР");
		Если НЕ КодКЛАДРТекущий = 0 Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	АдресныеОбъекты.КодКЛАДР КАК КодКЛАДР
			|ИЗ
			|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
			|ГДЕ
			|	АдресныеОбъекты.Идентификатор = &Идентификатор");
			
			Запрос.УстановитьПараметр("Идентификатор", ИдентификаторНаселенногоПункта);
			
			РезультатЗапроса = Запрос.Выполнить();		
			Если НЕ РезультатЗапроса.Пустой() Тогда			
				КодКЛАДР = РезультатЗапроса.Выгрузить()[0].КодКЛАДР;
				
				Если НЕ КодКЛАДРТекущий = КодКЛАДР И НЕ КодКЛАДР = 0 Тогда
					Город = Справочники.Города.НайтиПоРеквизиту("КодКЛАДР", КодКЛАДР);				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ГородНПОпределен = ЗначениеЗаполнено(Город);
	
	Если НЕ ПустаяСтрока(ГородНП) И ГородНПОпределен Тогда
		// обрезаем адрес в части города / населенного пункта
		ПозГНП = СтрНайти(АдресПредставление, ГородНП);
		АдресПредставление = Сред(АдресПредставление, ПозГНП + СтрДлина(ГородНП) + 2);	// 2 это запятая + пробел			
	КонецЕсли;	
	Адрес = АдресПредставление;
		
КонецПроцедуры

#КонецОбласти

Функция ТекущееСостояниеФоновогоЗадания(КлючИлиИдентификаторЗадания) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "");
	Результат.Вставить("НеНайдено", Ложь);
	Результат.Вставить("Активно", Ложь);
	Результат.Вставить("Завершено", Ложь);
	Результат.Вставить("ЗавершеноАварийно", Ложь);
	Результат.Вставить("Отменено", Ложь);
	Результат.Вставить("Начало");
	Результат.Вставить("Конец");
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("Задание");
	
	Если ТипЗнч(КлючИлиИдентификаторЗадания) = Тип("Строка") Тогда
		
		ОтборЗаданий = Новый Структура("Ключ", КлючИлиИдентификаторЗадания);
		Задания      = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗаданий);
		
		Если Задания.Количество() = 0 Тогда
			Задание = Неопределено;
		Иначе
			Задание = Задания[0];
		КонецЕсли;
		
	Иначе
		Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(КлючИлиИдентификаторЗадания);
	КонецЕсли;
	
	Если Задание = Неопределено Тогда
		
		Результат.НеНайдено = Истина;
		
		Если ТипЗнч(КлючИлиИдентификаторЗадания) = Тип("Строка") Тогда
			Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Фоновое задание с ключом ""%1"" не найдено.'"),
			СокрЛП(КлючИлиИдентификаторЗадания));
		Иначе
			Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Фоновое задание с идентификатором ""%1"" не найдено.'"),
			СокрЛП(КлючИлиИдентификаторЗадания));
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Результат.Задание 	   = Задание;
	Результат.Наименование = Задание.Наименование;
	Результат.Начало 	   = Задание.Начало;
	Результат.Конец 	   = Задание.Конец;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Результат.Активно = Истина;
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		Результат.Завершено = Истина;
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Результат.ЗавершеноАварийно = Истина;
		Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		Результат.Отменено = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СозданиеЗаказаНаПроизводствоПоФоновомуЗаданию(ПараметрыЗадания, АдресРезультата = Неопределено) Экспорт
	
	ЗаказСсылка  = ПараметрыЗадания.Заказ;
	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(ПараметрыЗадания.Продукция);
	
	СтруктураВозврата = ОбщийМодуль.СоздатьЗаказыНаПроизводствоПоЗаказам(ЗаказСсылка, МассивНоменклатуры);	
	СтруктураВозврата.Вставить("МассивСообщений", ПолучитьСообщенияПользователю(Истина));
	
	ПоместитьВоВременноеХранилище(СтруктураВозврата, АдресРезультата);	
	
КонецПроцедуры

#Область РасширенныеСервисы

Функция ИспользуютсяРасширенныеСервисы() Экспорт
	
	ТаблицаРасширенныхСервисов = ОбщийМодуль.ТаблицаРасширенныхСервисов();
	Результат = Ложь;
	Для Каждого ТекСтрока Из ТаблицаРасширенныхСервисов Цикл
		Результат = Результат ИЛИ (ЗначениеЗаполнено(ТекСтрока.ИмяКонстанты) И Константы[ТекСтрока.ИмяКонстанты].Получить());
	КонецЦикла;
	
	// Сервис IP телефонии зависит от нескольких констант (Когда включен Коннектор и включена телефония)
	//Результат = Результат Или (Константы.ВариантБиблиотекиТелефонии.Получить() = 0 И СофтФон.ИспользуетсяИнтеграцияСIPАТС());
	
	Возврат Результат;
	
КонецФункции		

Процедура ПроверкаРасширенныхСервисовПоФоновомуЗаданию(ПараметрыЗадания, АдресРезультата = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура("ЕстьОшибкаПроверки, Сообщения", Ложь, Новый Массив);
	ХЗ = Константы.НаличиеПодпискиНаРасширенныеСервисы.Получить();
	СтруктураСервисы = ХЗ.Получить();
	Если ТипЗнч(СтруктураСервисы) = Тип("Структура") Тогда
		СоответствиеСервисов = Новый Соответствие;
		ТаблицаСервисы = СтруктураСервисы.Сервисы; // ТаблицаСервисы( Ид - строка, ДоступенДо - Дата)
	Иначе
		ТаблицаСервисы = Неопределено;
		СтруктураВозврата.ЕстьОшибкаПроверки = Истина;
	КонецЕсли;
	
	ТаблицаРасширенныхСервисов = ОбщийМодуль.ТаблицаРасширенныхСервисов();
	Для Каждого ТекСтрока Из ТаблицаРасширенныхСервисов Цикл
		//Если ТекСтрока.ИдСервиса = "16" Тогда
		//использование данного сервиса ("Коннектор") определяется по двум условиям - ИспользуетсяТелефония+ВариантБиблиотекиТелефонии
		// переделано на константу ИспользоватьСервисSmartConnector
		//	НастройкаВключена = (СофтФон.ИспользуетсяИнтеграцияСIPАТС()) И (Константы.ВариантБиблиотекиТелефонии.Получить()=0)
		//Иначе
		НастройкаВключена = Константы[ТекСтрока.ИмяКонстанты].Получить();
		//КонецЕсли;
		Если НастройкаВключена Тогда
			Если ТаблицаСервисы = Неопределено Тогда
				ТекстСообщения = "Сервис """ + ТекСтрока.НаименованиеСервиса + """ неактивен: отключите в настройках программы или подключите в личном кабинете";
				ЦветСообщения = WebЦвета.Красный;
				СтруктураВозврата.ЕстьОшибкаПроверки = Истина;
			Иначе
				СтрокаТЗ = ТаблицаСервисы.Найти(ТекСтрока.ИдСервиса, "Ид");
				Если НЕ СтрокаТЗ = Неопределено Тогда
					ДоступенДо = НачалоДня(СтрокаТЗ.ДоступенДо);
					ТекДата = НачалоДня(ТекущаяДатаСеанса());
					РазницаВДнях = (ДоступенДо - ТекДата) / 86400; 
					
					Если РазницаВДнях < 0 Тогда
						ТекстСообщения = "Сервис """ + ТекСтрока.НаименованиеСервиса + """ неактивен: отключите в настройках программы или подключите в личном кабинете";
						ЦветСообщения = WebЦвета.Красный;
						СтруктураВозврата.ЕстьОшибкаПроверки = Истина;
					ИначеЕсли РазницаВДнях < 30 Тогда
						ТекстСообщения = "Срок подписки на сервис """ + ТекСтрока.НаименованиеСервиса + """ истекает через " + РазницаВДнях + " дней. Вам нужно продлить действие сервиса в личном кабинете";
						ЦветСообщения = WebЦвета.Оранжевый;
						СтруктураВозврата.ЕстьОшибкаПроверки = Истина;
					ИначеЕсли РазницаВДнях >= 30 Тогда
						ТекстСообщения = "Сервис """ + ТекСтрока.НаименованиеСервиса + """ активен. Срок действия до " + Формат(ДоступенДо,"ДЛФ=DD" );
						ЦветСообщения = WebЦвета.Зеленый;
						СтруктураВозврата.ЕстьОшибкаПроверки = Истина;	
					Иначе
						Продолжить; // №11718 если всё ок, нужно продолжить, чтобы не добавлялась предыдущая ошибка
					КонецЕсли;
				Иначе
					ТекстСообщения = "Сервис """ + ТекСтрока.НаименованиеСервиса + """ неактивен: отключите в настройках программы или подключите в личном кабинете";
					ЦветСообщения = WebЦвета.Красный;
					СтруктураВозврата.ЕстьОшибкаПроверки = Истина;
				КонецЕсли;				
			КонецЕсли;
			СтруктураВозврата.Сообщения.Добавить(Новый Структура("ТекстСообщения, ЦветСообщения", ТекстСообщения, ЦветСообщения));	
		КонецЕсли;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(СтруктураВозврата, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область ЦеныНаУслугиПроизводства

//#11866
Процедура ПроверитьПересечениеИнтерваловВЦенахНаУслугиПроизводства(Источник, МетаданныеИсточника, Отказ, ВыводСообщения = Истина) Экспорт
	
	Для каждого ТабличнаяЧасть из МетаданныеИсточника.ТабличныеЧасти Цикл
		
		ИмяТЧ = ТабличнаяЧасть.Имя;		
		КоличествоСтрок = Источник[ИмяТЧ].Количество();
		
		// №12223 для установки цен услуг раскроя (типовых и индивидуальных) для варианта "Оценка по каждому заданному диапазону" проверка пересечения не требуется
		Если (МетаданныеИсточника = Метаданные.Справочники.ЦеныУслугРаскроя ИЛИ МетаданныеИсточника = Метаданные.Документы.УстановкаИндивидуальныхЦенНаУслугиПроизводства)
			И Источник["ВариантОценки" + ИмяТЧ] = Перечисления.ВариантыОценкиСтоимостиУслугПроизводства.ОценкаПоКаждомуЗаданномуДиапазону Тогда
			Продолжить;
		КонецЕсли;
		
		Для Индекс1 = 1 по КоличествоСтрок Цикл
			Для Индекс2 = 1 по КоличествоСтрок Цикл
				Если Индекс1 >= Индекс2 Тогда
					Продолжить;
				КонецЕсли;
				СтрокаТЧ1 = Источник[ИмяТЧ][Индекс1-1];
				СтрокаТЧ2 = Источник[ИмяТЧ][Индекс2-1];
				Если ОбщийМодульКлиентСервер.ПроверитьПересечениеИнтервалов(СтрокаТЧ1.КоличествоОт, СтрокаТЧ1.КоличествоДо, СтрокаТЧ2.КоличествоОт, СтрокаТЧ2.КоличествоДо) Тогда
					//#12301 не отказываем
					//#12345 возвращаем Отказ
					Если ВыводСообщения Тогда
						ТекстСообщения = СтрШаблон("В таблице %1 пересекаются диапазоны значений в строках %2 и %3", ТабличнаяЧасть.Синоним, Индекс1, Индекс2);						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
					Иначе
						Отказ = Истина;	
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

Функция ПолучитьДатуПоПараметру(ПараметрСКД, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если ЗначениеПоУмолчанию = Неопределено Тогда
		ЗначениеПоУмолчанию = Дата(1,1,1);
	КонецЕсли;
	
	ЗначениеДаты = ЗначениеПоУмолчанию;
	Если Не ПараметрСКД = Неопределено Тогда
		Если ТипЗнч(ПараметрСКД) = Тип("Дата") Тогда
			ЗначениеДаты = ПараметрСКД;
		ИначеЕсли ТипЗнч(ПараметрСКД.Значение) = Тип("Дата") Тогда
			ЗначениеДаты = ПараметрСКД.Значение;
		ИначеЕсли ТипЗнч(ПараметрСКД.Значение) = Тип("СтандартнаяДатаНачала") Тогда
			ЗначениеДаты = ПараметрСКД.Значение.Дата;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеДаты;
	
КонецФункции

#Область Эффективности

//++ №11768 "Эффективность по лидам" формируем запрос используя внешние наборы данных
Функция СформироватьДанныеВоВременныеТаблицы(МенеджерВТ, НачалоПериода, КонецПериода, Вид) Экспорт
	
	Запрос = новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонверсияВходящихКонтактовОбороты.Контакт КАК Контакт,
	|	ВЫБОР
	|		КОГДА &Вид = ""Менеджер""
	//++ №13645 формируем по сотрудникам
	//|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.Автор
	|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.Автор.Сотрудник
	//-- №13645
	|		КОГДА &Вид = ""ВидКонтакта""
	|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.ВидКонтакта
	|		КОГДА &Вид = ""РекламнаяАкция""
	|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.РекламнаяАкция
	|		КОГДА &Вид = ""РекламныйИсточник""
	|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.РекламныйИсточник
	|		КОГДА &Вид = ""ТочкаПродаж""
	|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.ТочкаПродаж
	|		КОГДА &Вид = ""Розница""
	|			ТОГДА ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка)
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Показатель
	|ПОМЕСТИТЬ ВТ_ПоказательЛиды
	|ИЗ
	|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(,, Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
	|ГДЕ
	|	(КонверсияВходящихКонтактовОбороты.Контакт.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ КонверсияВходящихКонтактовОбороты.Регистратор.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	//#13654 дата выполнения и закрытия по монтажу перенесены в отдельные реквизиты
	|			ИЛИ ВЫБОР КОГДА КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.Монтаж 
	|					ТОГДА ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.Монтаж).ДатаВыполнения МЕЖДУ &НачалоПериода И &КонецПериода
	|						ИЛИ ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.Монтаж).ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонверсияВходящихКонтактовОбороты.Контакт,
	|	ВЫБОР
	|		КОГДА &Вид = ""Менеджер""
	//++ №13645 формируем по сотрудникам
	//|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.Автор
	|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.Автор.Сотрудник
	//-- №13645
	|		КОГДА &Вид = ""ВидКонтакта""
	|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.ВидКонтакта
	|		КОГДА &Вид = ""РекламнаяАкция""
	|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.РекламнаяАкция
	|		КОГДА &Вид = ""РекламныйИсточник""
	|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.РекламныйИсточник
	|		КОГДА &Вид = ""ТочкаПродаж""
	|			ТОГДА КонверсияВходящихКонтактовОбороты.Контакт.ТочкаПродаж
	|		КОГДА &Вид = ""Розница""
	|			ТОГДА ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка)
	|		ИНАЧЕ NULL
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказДоговорТоварыУслуги.Ссылка КАК ЗаказДоговор,
	|	ЗаказДоговорТоварыУслуги.Ссылка.Основание КАК Основание,
	|	СУММА(ЗаказДоговорТоварыУслуги.Количество * ЗаказДоговорТоварыУслуги.Коэффициент) КАК Площадь
	|ПОМЕСТИТЬ ВТ_ПлощадиПоЗаказам
	|ИЗ
	|	Документ.ЗаказДоговор.ТоварыУслуги КАК ЗаказДоговорТоварыУслуги
	|ГДЕ
	|	(ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	|			ИЛИ ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	|			ИЛИ ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
	|			ИЛИ ЗаказДоговорТоварыУслуги.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности)
	|	И ЗаказДоговорТоварыУслуги.Ссылка.Проведен
	|	И НЕ ЗаказДоговорТоварыУслуги.Ссылка.ПометкаУдаления
	|{ГДЕ
	|	(ЗаказДоговорТоварыУслуги.Ссылка.Основание.Дата >= &НачалоПериода
	|				И ЗаказДоговорТоварыУслуги.Ссылка.Основание.Дата <= &КонецПериода
	|			ИЛИ ЗаказДоговорТоварыУслуги.Ссылка.Дата >= &НачалоПериода
	|				И ЗаказДоговорТоварыУслуги.Ссылка.Дата <= &КонецПериода) КАК Поле2}
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказДоговорТоварыУслуги.Ссылка,
	|	ЗаказДоговорТоварыУслуги.Ссылка.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиПоЗаказДоговорамОбороты.Регистратор КАК ЗаказДоговор,
	|	ПродажиПоЗаказДоговорамОбороты.Регистратор.Основание КАК Основание,
	|	СУММА(ПродажиПоЗаказДоговорамОбороты.СуммаОборот) КАК СреднийЧекСумма
	|ПОМЕСТИТЬ ВТ_ОбщиеПродажи
	|ИЗ
	|	РегистрНакопления.ПродажиПоЗаказДоговорам.Обороты(, , Регистратор, ) КАК ПродажиПоЗаказДоговорамОбороты,
	|	Константа.ВсяНоменклатураПоУмолчаниюВСреднемЧеке КАК ВсяНоменклатураПоУмолчаниюВСреднемЧеке
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВсяНоменклатураПоУмолчаниюВСреднемЧеке.Значение
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПродажиПоЗаказДоговорамОбороты.Номенклатура.УчитыватьВСреднемЧеке = ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиПоЗаказДоговорамОбороты.Регистратор,
	|	ПродажиПоЗаказДоговорамОбороты.Регистратор.Основание
	|";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ?(ЗначениеЗаполнено(КонецПериода), КонецДня(КонецПериода), ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Вид", Вид);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПолучитьТаблицуПоДатеЛида(МенеджерВТ, НачалоПериода, КонецПериода, РасширятьТипПоляПоказатель= Истина) Экспорт
	
	Запрос = новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Замеры.ДокументЗамер КАК Лид,
	|	СУММА(1) КАК КоличествоЗамеров,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.ЗамерВыполнен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоВыполненныхЗамеров,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЗамеровУспех,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЗамеровОтказ,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЗамеровНевыполнен,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДоговоровНаЗамерах
	|ПОМЕСТИТЬ ВТ_ПоказателиЗамеровЛида
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	НЕ Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен)
	|	И Замеры.ДокументЗамер.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ Замеры.ЭтоВыезд
	|
	|СГРУППИРОВАТЬ ПО
	|	Замеры.ДокументЗамер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонверсияВходящихКонтактовОбороты.Контакт КАК Контакт,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ КонверсияВходящихКонтактовОбороты.Контакт.ТекущийСтатус В (ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НеЦелевой), ЗНАЧЕНИЕ(Справочник.СтатусыЛида.Обращение))
	|				ТОГДА КонверсияВходящихКонтактовОбороты.КоличествоЛидовОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЦелевыхКонтактов,
	|	СУММА(ВЫБОР
	|			КОГДА КонверсияВходящихКонтактовОбороты.Регистратор = КонверсияВходящихКонтактовОбороты.Контакт
	|				ТОГДА КонверсияВходящихКонтактовОбороты.КоличествоЛидовОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоКонтактов,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(КонверсияВходящихКонтактовОбороты.Регистратор) = ТИП(Документ.ЗаказДоговор)
	|				ТОГДА КонверсияВходящихКонтактовОбороты.КоличествоДоговоровОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДоговоров
	|ПОМЕСТИТЬ ВТ_ПоЛидам
	|ИЗ
	|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(, , Регистратор, Контакт.Дата МЕЖДУ &НачалоПериода И &КонецПериода) КАК КонверсияВходящихКонтактовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	КонверсияВходящихКонтактовОбороты.Контакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоказательЛиды.Контакт КАК Контакт,
	//++ №13645
	//|	ВТ_ПоказательЛиды.Показатель КАК Показатель,
	|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, ""(неопределено)"") КАК Показатель,
	//-- №13645
	|	СУММА(ВТ_ПоЛидам.КоличествоЦелевыхКонтактов) КАК КоличествоЦелевыхКонтактов,
	|	СУММА(ВТ_ПоЛидам.КоличествоКонтактов) КАК КоличествоКонтактов,
	|	СУММА(ВТ_ПоЛидам.КоличествоДоговоров) КАК КоличествоДоговоров,
	|	СУММА(ЕСТЬNULL(ВТ_ПоказателиЗамеровЛида.КоличествоЗамеров, 0)) КАК КоличествоЗамеров,
	|	СУММА(ЕСТЬNULL(ВТ_ПоказателиЗамеровЛида.КоличествоВыполненныхЗамеров, 0)) КАК КоличествоВыполненныхЗамеров,
	|	СУММА(ЕСТЬNULL(ВТ_ПоказателиЗамеровЛида.КоличествоЗамеровУспех, 0)) КАК КоличествоЗамеровУспех,
	|	СУММА(ЕСТЬNULL(ВТ_ПоказателиЗамеровЛида.КоличествоЗамеровОтказ, 0)) КАК КоличествоЗамеровОтказ,
	|	СУММА(ЕСТЬNULL(ВТ_ПоказателиЗамеровЛида.КоличествоЗамеровНевыполнен, 0)) КАК КоличествоЗамеровНевыполнен,
	|	СУММА(ЕСТЬNULL(ВТ_ПоказателиЗамеровЛида.КоличествоДоговоровНаЗамерах, 0)) КАК КоличествоДоговоровНаЗамерах
	|ИЗ
	|	ВТ_ПоказательЛиды КАК ВТ_ПоказательЛиды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоЛидам КАК ВТ_ПоЛидам
	|		ПО ВТ_ПоказательЛиды.Контакт = ВТ_ПоЛидам.Контакт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказателиЗамеровЛида КАК ВТ_ПоказателиЗамеровЛида
	|		ПО ВТ_ПоказательЛиды.Контакт = ВТ_ПоказателиЗамеровЛида.Лид
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоказательЛиды.Контакт,
	|	ВТ_ПоказательЛиды.Показатель";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ?(ЗначениеЗаполнено(КонецПериода), КонецДня(КонецПериода), ТекущаяДатаСеанса()));
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Если РасширятьТипПоляПоказатель Тогда
		//++ в колонке показатель кроме показателя еще может быть текст
		КС = Новый КвалификаторыСтроки(20);
		//КЧ = Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Любой);		
		МассивТипов = ТаблицаРезультат.Колонки.Показатель.ТипЗначения.Типы();
		МассивТипов.Добавить(Тип("Строка"));
		//МассивТипов.Добавить(Тип("Число"));
		ОписаниеТиповС = Новый ОписаниеТипов(МассивТипов, , КС);
		ТаблицаРезультат.Колонки.Добавить("Показатель1", ОписаниеТиповС);
		Для каждого СтрокаТЧ из ТаблицаРезультат Цикл
			СтрокаТЧ.Показатель1 = СтрокаТЧ.Показатель; 	
		КонецЦикла;
		ТаблицаРезультат.Колонки.Показатель.Имя = "Показатель_Врем";
		ТаблицаРезультат.Колонки.Показатель1.Имя = "Показатель";
		ТаблицаРезультат.Колонки.Удалить("Показатель_Врем"); 
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьТаблицуПоДатеЛидаПродолжение(МенеджерВТ, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПредварительныйРасчет.Основание КАК Лид,
	|	СУММА(1) КАК КоличествоРасчетов,
	|	СУММА(ПредварительныйРасчет.СуммаДокумента) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ПредварительныйРасчет.Основание.ОсновнойПредварительныйРасчет = ПредварительныйРасчет.Ссылка
	|				ТОГДА ПредварительныйРасчет.СуммаДокумента
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОсновногоРасчета
	|ПОМЕСТИТЬ ВТ_ПредварительныйРасчет
	|ИЗ
	|	Документ.ПредварительныйРасчетЗаказДоговора КАК ПредварительныйРасчет
	|ГДЕ
	|	НЕ ПредварительныйРасчет.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредварительныйРасчет.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонверсияВходящихКонтактовОбороты.Контакт КАК Контакт,
	|	СУММА(ВЫБОР
	|			КОГДА КонверсияВходящихКонтактовОбороты.Регистратор = КонверсияВходящихКонтактовОбороты.Контакт
	|				ТОГДА КонверсияВходящихКонтактовОбороты.КоличествоЛидовОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоКонтактов,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(КонверсияВходящихКонтактовОбороты.Регистратор) = ТИП(Документ.ЗаказДоговор)
	|				ТОГДА КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокумента
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДоговоров,
	|	СУММА(ВТ_ПлощадиПоЗаказам.Площадь) КАК Площадь,
	|	СУММА(ВТ_ОбщиеПродажи.СреднийЧекСумма) КАК СреднийЧекСумма,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(КонверсияВходящихКонтактовОбороты.Регистратор) = ТИП(Документ.ЗаказДоговор)
	|				ТОГДА КонверсияВходящихКонтактовОбороты.Регистратор.СуммаСкидки
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаСкидки,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(КонверсияВходящихКонтактовОбороты.Регистратор) = ТИП(Документ.ЗаказДоговор)
	|				ТОГДА КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокументаПоПрайсу
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДоговоровПоПрайсу,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ПредварительныйРасчет.КоличествоРасчетов, 0) = 1
	|				ТОГДА ЕСТЬNULL(ПредварительныйРасчет.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ПредварительныйРасчет.СуммаОсновногоРасчета, 0)
	|		КОНЕЦ) КАК СуммаПредварительногоРасчета,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(КонверсияВходящихКонтактовОбороты.Регистратор) = ТИП(Документ.ЗаказДоговор)
	|				ТОГДА КонверсияВходящихКонтактовОбороты.КоличествоДоговоровОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДоговоров
	|ПОМЕСТИТЬ ВТ_ПоЛидамПродолжение
	|ИЗ
	|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(, , Регистратор, Контакт.Дата МЕЖДУ &НачалоПериода И &КонецПериода) КАК КонверсияВходящихКонтактовОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
	|		ПО КонверсияВходящихКонтактовОбороты.Регистратор = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
	|			И КонверсияВходящихКонтактовОбороты.Контакт = ВТ_ПлощадиПоЗаказам.Основание
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПродажи КАК ВТ_ОбщиеПродажи
	|		ПО КонверсияВходящихКонтактовОбороты.Регистратор = ВТ_ОбщиеПродажи.ЗаказДоговор
	|			И КонверсияВходящихКонтактовОбороты.Контакт = ВТ_ОбщиеПродажи.Основание
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредварительныйРасчет КАК ПредварительныйРасчет
	|		ПО КонверсияВходящихКонтактовОбороты.Регистратор = ПредварительныйРасчет.Лид
	|
	|СГРУППИРОВАТЬ ПО
	|	КонверсияВходящихКонтактовОбороты.Контакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоказательЛиды.Контакт КАК Контакт,
	//++ №13645
	//|	ВТ_ПоказательЛиды.Показатель КАК Показатель,
	|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, ""(неопределено)"") КАК Показатель,
	//-- №13645
	|	СУММА(ВТ_ПоЛидам.КоличествоДоговоров) КАК КоличествоДоговоров2,
	|	СУММА(ВТ_ПоЛидам.СуммаДоговоров) КАК СуммаДоговоров,
	|	СУММА(ВТ_ПоЛидам.Площадь) КАК Площадь,
	|	СУММА(ВТ_ПоЛидам.СреднийЧекСумма) КАК СреднийЧекСумма,
	|	СУММА(ВТ_ПоЛидам.СуммаПредварительногоРасчета) КАК СуммаПредварительногоРасчета,
	|	СУММА(ВТ_ПоЛидам.СуммаСкидки) КАК СуммаСкидкиДоговоров,
	|	СУММА(ВТ_ПоЛидам.СуммаДоговоровПоПрайсу) КАК СуммаДоговоровПоПрайсу
	|ИЗ
	|	ВТ_ПоказательЛиды КАК ВТ_ПоказательЛиды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоЛидамПродолжение КАК ВТ_ПоЛидам
	|		ПО ВТ_ПоказательЛиды.Контакт = ВТ_ПоЛидам.Контакт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоказательЛиды.Контакт,
	|	ВТ_ПоказательЛиды.Показатель";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ?(ЗначениеЗаполнено(КонецПериода), КонецДня(КонецПериода), ТекущаяДатаСеанса()));
	
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьТаблицуПоДатеДоговора(МенеджерВТ, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	//#12914 1. для всех "Видов" четвертую таблицу строить по заказ-договорам, дата которых попадает в период отчета. 
	// Если заказ-договор не привязан к замеру (лиду), то значение его показателя брать как = "Неопределено". 
	// Порядок, состав и наименования колонок сделать таким же как в третьей таблице отчета "Эффективность замерщиков".
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	КонверсияВходящихКонтактовОбороты.Контакт КАК Контакт,
	|	ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Основание КАК Документ.Лид) КАК Контакт,
	
	//|	СУММА(КонверсияВходящихКонтактовОбороты.КоличествоДоговоровОборот) КАК КоличествоДоговоров,
	//|	СУММА(ВЫБОР
	//|			КОГДА КонверсияВходящихКонтактовОбороты.КоличествоДоговоровОборот > 0
	//|				ТОГДА КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокумента
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаДоговоров,
	//|	СУММА(ВЫБОР
	//|			КОГДА КонверсияВходящихКонтактовОбороты.КоличествоДоговоровОборот > 0
	//|				ТОГДА КонверсияВходящихКонтактовОбороты.Регистратор.СуммаСкидки
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаСкидкиДоговоров,
	//|	СУММА(ВЫБОР
	//|			КОГДА КонверсияВходящихКонтактовОбороты.КоличествоДоговоровОборот > 0
	//|				ТОГДА КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокументаПоПрайсу
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаДоговоровПоПрайсу,	
	|	СУММА(1) КАК КоличествоДоговоров,
	|	СУММА(КонверсияВходящихКонтактовОбороты.СуммаДокумента) КАК СуммаДоговоров,
	|	СУММА(КонверсияВходящихКонтактовОбороты.СуммаСкидки) КАК СуммаСкидкиДоговоров,
	|	СУММА(КонверсияВходящихКонтактовОбороты.СуммаДокументаПоПрайсу) КАК СуммаДоговоровПоПрайсу,	
	
	|	СУММА(ВТ_ПлощадиПоЗаказам.Площадь) КАК Площадь,
	|	СУММА(ВТ_ОбщиеПродажи.СреднийЧекСумма) КАК СреднийЧекСумма
	|ПОМЕСТИТЬ ВТ_ПоДоговорам
	|ИЗ
	//|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
	|	Документ.ЗаказДоговор КАК КонверсияВходящихКонтактовОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
	//|		ПО КонверсияВходящихКонтактовОбороты.Регистратор = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
	//|			И КонверсияВходящихКонтактовОбороты.Контакт = ВТ_ПлощадиПоЗаказам.Основание
	|		ПО КонверсияВходящихКонтактовОбороты.Ссылка = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПродажи КАК ВТ_ОбщиеПродажи
	//|		ПО КонверсияВходящихКонтактовОбороты.Регистратор = ВТ_ОбщиеПродажи.ЗаказДоговор
	//|			И КонверсияВходящихКонтактовОбороты.Контакт = ВТ_ОбщиеПродажи.Основание
	|		ПО КонверсияВходящихКонтактовОбороты.Ссылка = ВТ_ОбщиеПродажи.ЗаказДоговор
	|ГДЕ
	|	КонверсияВходящихКонтактовОбороты.Проведен	
	|	И КонверсияВходящихКонтактовОбороты.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	//|	ТИПЗНАЧЕНИЯ(КонверсияВходящихКонтактовОбороты.Регистратор) = ТИП(Документ.ЗаказДоговор)
	|
	|СГРУППИРОВАТЬ ПО
	//|	КонверсияВходящихКонтактовОбороты.Контакт
	|	КонверсияВходящихКонтактовОбороты.Ссылка
	|;
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	КонверсияВходящихКонтактовОбороты.Контакт КАК Контакт,
	//|	СУММА(КонверсияВходящихКонтактовОбороты.КоличествоМонтажейУспехОборот) КАК КоличествоВыполненныхМонтажей,
	//|	СУММА(ВЫБОР
	//|			КОГДА КонверсияВходящихКонтактовОбороты.КоличествоМонтажейУспехОборот > 0
	//|				ТОГДА КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокумента
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаВыполненныхМонтажей
	//|ПОМЕСТИТЬ ВТ_ПоМонтажам
	//|ИЗ
	//|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
	//|ГДЕ
	//|	ТИПЗНАЧЕНИЯ(КонверсияВходящихКонтактовОбороты.Регистратор) = ТИП(Документ.Монтаж)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	КонверсияВходящихКонтактовОбороты.Контакт
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоДоговорам.Контакт КАК Контакт,
	//|	ВТ_ПоказательЛиды.Показатель КАК Показатель,
	|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, ""(неопределено)"") КАК Показатель,
	//|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, -1) КАК Показатель,
	
	|	СУММА(ВТ_ПоДоговорам.КоличествоДоговоров) КАК КоличествоДоговоровПоДоговорам,
	|	СУММА(ВТ_ПоДоговорам.СуммаДоговоров) КАК СуммаДоговоровПоДоговорам,
	|	СУММА(ВТ_ПоДоговорам.Площадь) КАК ПлощадьПоДоговорам,
	|	СУММА(ВТ_ПоДоговорам.СреднийЧекСумма) КАК СреднийЧекСуммаПоДоговорам,
	|	СУММА(ВТ_ПоДоговорам.СуммаСкидкиДоговоров) КАК СуммаСкидкиДоговоровПоДоговорам,
	|	СУММА(ВТ_ПоДоговорам.СуммаДоговоровПоПрайсу) КАК СуммаДоговоровПоПрайсуПоДоговорам,
	// в этой группе не используются, пока обнуляем
	//|	СУММА(ВТ_ПоМонтажам.КоличествоВыполненныхМонтажей) КАК КоличествоВыполненныхМонтажей,
	//|	СУММА(ВТ_ПоМонтажам.СуммаВыполненныхМонтажей) КАК СуммаВыполненныхМонтажей
	|	0 КАК КоличествоВыполненныхМонтажей,
	|	0 КАК СуммаВыполненныхМонтажей
	|ИЗ
	//|	ВТ_ПоказательЛиды КАК ВТ_ПоказательЛиды
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоДоговорам КАК ВТ_ПоДоговорам
	|	ВТ_ПоДоговорам КАК ВТ_ПоДоговорам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказательЛиды КАК ВТ_ПоказательЛиды
	|		ПО ВТ_ПоказательЛиды.Контакт = ВТ_ПоДоговорам.Контакт
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоМонтажам КАК ВТ_ПоМонтажам
	//|		ПО ВТ_ПоказательЛиды.Контакт = ВТ_ПоМонтажам.Контакт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоДоговорам.Контакт,
	//|	ВТ_ПоказательЛиды.Показатель
	|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, ""(неопределено)"")
	//|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, -1)
	|";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ?(ЗначениеЗаполнено(КонецПериода), КонецДня(КонецПериода), ТекущаяДатаСеанса()));
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьТаблицуПоМонтажам(МенеджерВТ, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МонтажТоварыУслуги.Ссылка КАК Монтаж,
	//|	МонтажТоварыУслуги.Ссылка.Дата КАК ДатаМонтажа,
	|	МонтажТоварыУслуги.Ссылка.ДатаВыполнения КАК ДатаМонтажа,
	|	МонтажТоварыУслуги.Ссылка.Основание КАК ЗаказДоговор,
	|	МонтажТоварыУслуги.Ссылка.Основание.Дата КАК ДатаДоговора,
	|	МонтажТоварыУслуги.Ссылка.Основание.Основание КАК Лид,
	|	МонтажТоварыУслуги.Ссылка.Основание.Основание.Дата КАК ДатаЛида,
	|	СРЕДНЕЕ(МонтажТоварыУслуги.Ссылка.СуммаДокумента) КАК СуммаМонтажа,
	|	СУММА(ВЫБОР
	|			КОГДА МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	|					ИЛИ МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	|					ИЛИ МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
	|					ИЛИ МонтажТоварыУслуги.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПотолков,
	|	СУММА(ВЫБОР
	|			КОГДА МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	|					ИЛИ МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	|					ИЛИ МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
	|					ИЛИ МонтажТоварыУслуги.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности
	|				ТОГДА МонтажТоварыУслуги.Количество * МонтажТоварыУслуги.Коэффициент
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПлощадьПотолков
	|ПОМЕСТИТЬ ВТ_ДанныеПоМонтажам
	|ИЗ
	|	Документ.Монтаж.ТоварыУслуги КАК МонтажТоварыУслуги
	|ГДЕ
	|	МонтажТоварыУслуги.Ссылка.Проведен
	//#13654 
	|	И МонтажТоварыУслуги.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Монтаж)
	|	И МонтажТоварыУслуги.Ссылка.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Выполнен), ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Закрыт))
	
	//#12853 закомментировано: в отчете "Эффективность по лидам" в таблице "Монтажи за период по дате монтажа" должны попадать все монтажи, не важно привязаны они к лидам\договорам или нет. 
	//если не привязаны, то показатель = неопределено	
	//|	И МонтажТоварыУслуги.Ссылка.Основание ССЫЛКА Документ.ЗаказДоговор
	// заказ-договор
	|	И (МонтажТоварыУслуги.Ссылка.Основание.Дата >= &НачалоПериода
	|				И МонтажТоварыУслуги.Ссылка.Основание.Дата <= &КонецПериода
	// монтаж
	//#12853 монтажи в отчеты должны попадать не по дате документа, а по дате выполнения
	//		ИЛИ МонтажТоварыУслуги.Ссылка.Дата >= &НачалоПериода
	//			И МонтажТоварыУслуги.Ссылка.Дата <= &КонецПериода
	|			ИЛИ МонтажТоварыУслуги.Ссылка.ДатаВыполнения >= &НачалоПериода
	|				И МонтажТоварыУслуги.Ссылка.ДатаВыполнения <= &КонецПериода
	// лид
	|			ИЛИ МонтажТоварыУслуги.Ссылка.Основание.Основание.Дата >= &НачалоПериода
	|				И МонтажТоварыУслуги.Ссылка.Основание.Основание.Дата <= &КонецПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	МонтажТоварыУслуги.Ссылка,
	|	МонтажТоварыУслуги.Ссылка.Дата,
	|	МонтажТоварыУслуги.Ссылка.Основание,
	|	МонтажТоварыУслуги.Ссылка.Основание.Дата,
	|	МонтажТоварыУслуги.Ссылка.Основание.Основание,
	|	МонтажТоварыУслуги.Ссылка.Основание.Основание.Дата
	|;
	|
	|///////////////////////////////////////////////////////////	
	// область "По дате лида за период"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ДанныеПоМонтажам.Лид КАК Контакт,
	|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, ""(неопределено)"") КАК Показатель,
	//|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, -1) КАК Показатель,
	|	ВТ_ДанныеПоМонтажам.ПлощадьПотолков КАК ПлощадьПотолковМонтажейПоЛидам,
	|	ВТ_ДанныеПоМонтажам.СуммаМонтажа КАК СуммаМонтажейПоЛидам,
	|	0 КАК ПлощадьПотолковМонтажейПоДоговорам,
	|	0 КАК СуммаМонтажейПоДоговорам,
	|	0 КАК ПлощадьПотолковМонтажейПоМонтажам,
	|	0 КАК СуммаМонтажейПоМонтажам
	|ПОМЕСТИТЬ ВТ_ПоМонтажам
	|ИЗ
	|	ВТ_ДанныеПоМонтажам КАК ВТ_ДанныеПоМонтажам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказательЛиды КАК ВТ_ПоказательЛиды
	|		ПО ВТ_ПоказательЛиды.Контакт = ВТ_ДанныеПоМонтажам.Лид
	|ГДЕ
	|	ВТ_ДанныеПоМонтажам.ДатаЛида МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// область "По дате договора за период"
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоМонтажам.Лид КАК Контакт,
	|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, ""(неопределено)"") КАК Показатель,
	//|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, -1) КАК Показатель,
	|	0 КАК ПлощадьПотолковМонтажейПоЛидам,
	|	0 КАК СуммаМонтажейПоЛидам,
	|	ВТ_ДанныеПоМонтажам.ПлощадьПотолков КАК ПлощадьПотолковМонтажейПоДоговорам,
	|	ВТ_ДанныеПоМонтажам.СуммаМонтажа КАК СуммаМонтажейПоДоговорам,
	|	0 КАК ПлощадьПотолковМонтажейПоМонтажам,
	|	0 КАК СуммаМонтажейПоМонтажам
	|ИЗ
	|	ВТ_ДанныеПоМонтажам КАК ВТ_ДанныеПоМонтажам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказательЛиды КАК ВТ_ПоказательЛиды
	|		ПО ВТ_ПоказательЛиды.Контакт = ВТ_ДанныеПоМонтажам.Лид
	|ГДЕ
	|	ВТ_ДанныеПоМонтажам.ДатаДоговора МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// область "По дате монтажа за период"
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоМонтажам.Лид КАК Контакт,
	|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, ""(неопределено)"") КАК Показатель,
	//|	ЕСТЬNULL(ВТ_ПоказательЛиды.Показатель, -1) КАК Показатель,
	|	0 КАК ПлощадьПотолковМонтажейПоЛидам,
	|	0 КАК СуммаМонтажейПоЛидам,
	|	0 КАК ПлощадьПотолковМонтажейПоДоговорам,
	|	0 КАК СуммаМонтажейПоДоговорам,
	|	ВТ_ДанныеПоМонтажам.ПлощадьПотолков КАК ПлощадьПотолковМонтажейПоМонтажам,
	|	ВТ_ДанныеПоМонтажам.СуммаМонтажа КАК СуммаМонтажейПоМонтажам
	|ИЗ
	|	ВТ_ДанныеПоМонтажам КАК ВТ_ДанныеПоМонтажам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказательЛиды КАК ВТ_ПоказательЛиды
	|		ПО ВТ_ПоказательЛиды.Контакт = ВТ_ДанныеПоМонтажам.Лид
	|ГДЕ
	|	ВТ_ДанныеПоМонтажам.ДатаМонтажа МЕЖДУ &НачалоПериода И &КонецПериода
	|;
	|
	|///////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПоМонтажам.Контакт КАК Контакт,
	|	ВТ_ПоМонтажам.Показатель КАК Показатель,
	|	СУММА(ВТ_ПоМонтажам.ПлощадьПотолковМонтажейПоЛидам) КАК ПлощадьПотолковМонтажейПоЛидам,
	|	СУММА(ВТ_ПоМонтажам.СуммаМонтажейПоЛидам) КАК СуммаМонтажейПоЛидам,
	|	СУММА(ВТ_ПоМонтажам.ПлощадьПотолковМонтажейПоДоговорам) КАК ПлощадьПотолковМонтажейПоДоговорам,
	|	СУММА(ВТ_ПоМонтажам.СуммаМонтажейПоДоговорам) КАК СуммаМонтажейПоДоговорам,
	|	СУММА(ВТ_ПоМонтажам.ПлощадьПотолковМонтажейПоМонтажам) КАК ПлощадьПотолковМонтажейПоМонтажам,
	|	СУММА(ВТ_ПоМонтажам.СуммаМонтажейПоМонтажам) КАК СуммаМонтажейПоМонтажам
	|ИЗ
	|	ВТ_ПоМонтажам КАК ВТ_ПоМонтажам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоМонтажам.Контакт,
	|	ВТ_ПоМонтажам.Показатель
	|";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ?(ЗначениеЗаполнено(КонецПериода), КонецДня(КонецПериода), ТекущаяДатаСеанса()));
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ОбъединитьТаблицыНаборовДанных(СтруктураТаблиц) Экспорт
	
	// Сначала создадим основную таблицу данных, по колонкам, которые есть в таблице
	ТаблицаДанных = новый ТаблицаЗначений;
	
	Для Каждого ТекущаяТаблица Из СтруктураТаблиц Цикл
		
		Для Каждого ТекущаяКолонка Из ТекущаяТаблица.Значение.Колонки Цикл
			
			Если ТаблицаДанных.Колонки.Найти(НРег(ТекущаяКолонка.Имя)) = Неопределено Тогда
				ТаблицаДанных.Колонки.Добавить(НРег(ТекущаяКолонка.Имя), ТекущаяКолонка.ТипЗначения);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Заполняем основную таблицу
	Для Каждого ТекущаяТаблица Из СтруктураТаблиц Цикл
		
		Для Каждого ТекущаяСтрока Из ТекущаяТаблица.Значение Цикл
			
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока, , "Показатель");
			
			Если ТипЗнч(ТекущаяСтрока.Показатель) = Тип("СправочникСсылка.Пользователи") Тогда				
				ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
				ОписаниеТипов.ПривестиЗначение(НоваяСтрока.Показатель);
				//++ №13645 отчёт "Эффективность менеджеров" формируется по сотрудникам
			ИначеЕсли ТипЗнч(ТекущаяСтрока.Показатель) = Тип("СправочникСсылка.Сотрудники") Тогда				
				ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
				ОписаниеТипов.ПривестиЗначение(НоваяСтрока.Показатель);
				//-- №13645 отчёт "Эффективность менеджеров" формируется по сотрудникам
			КонецЕсли;
			
			
			НоваяСтрока.Показатель = ТекущаяСтрока.Показатель;
			
		КонецЦикла;
	КонецЦикла;
	
	
	// свертка по измерениям "Контакт, показатель" осуществляется для корректного вычисления средней в подвале каждой таблицы
	КолонкиСуммирования = "";
	
	Для Каждого ТекущаяКолонка Из ТаблицаДанных.Колонки Цикл
		
		Если НРег(ТекущаяКолонка.Имя) = "контакт" Или НРег(ТекущаяКолонка.Имя) = "показатель" Тогда
			Продолжить;
		КонецЕсли;
		
		КолонкиСуммирования = КолонкиСуммирования + ?(ЗначениеЗаполнено(КолонкиСуммирования), ", ", "") + ТекущаяКолонка.Имя;
		
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Контакт, Показатель", КолонкиСуммирования);
	
	Возврат ТаблицаДанных;
	
КонецФункции
//-- №11768

#КонецОбласти

#КонецОбласти

#Область ПроверкаКратности

//#2792, 16345 
Процедура ПроверитьКратностьЕдиницИзмерения(Отказ, ДокументОбъектСтруктураСтроки, ВидДокумента, ИмяПоляКоличество="") Экспорт
	
	Если НЕ НастройкаПользователя("РазрешитьНесоответствиеКратностиЕдиницИзмерения") Тогда
		
		ПредставлениеТаблицы = "";
		ПолеДанныхПрефикс = "Объект.";
		
		Если ТипЗнч(ДокументОбъектСтруктураСтроки) = Тип("ДанныеФормыСтруктура") Тогда
			// вызывается из ОбработкаПроверкиЗаполненияНаСервере, когда передается Объект
			ДокументОбъект = ДокументОбъектСтруктураСтроки;
			
			ИмяТЧ = "Товары";
			ПредставлениеТаблицы = "Товары";
			//#16345
			Если ВидДокумента = Перечисления.ВидыДокументовПроверкиКратности.ПредварительныйРасчет
				ИЛИ ВидДокумента = Перечисления.ВидыДокументовПроверкиКратности.ЗаказКлиента
				ИЛИ ВидДокумента = Перечисления.ВидыДокументовПроверкиКратности.РеализацияКлиенту Тогда
				ИмяТЧ = "ТоварыУслуги";
				ПредставлениеТаблицы = "Товары и услуги";
			КонецЕсли;
			//nva+++
			Если ИмяПоляКоличество <> "" Тогда
				ТаблицаТоваров = ДокументОбъект[ИмяТЧ].Выгрузить(, "НомерСтроки, Номенклатура, ЕдиницаИзмерения, " + ИмяПоляКоличество);
				ТаблицаТоваров.Колонки[ИмяПоляКоличество].Имя = "Количество";
			Иначе
				ТаблицаТоваров = ДокументОбъект[ИмяТЧ].Выгрузить(, "НомерСтроки, Номенклатура, ЕдиницаИзмерения, Количество");
			КонецЕсли;	
			//nva---
			ТаблицаТоваров.Колонки.Добавить("ИмяТаблицы", Новый ОписаниеТипов("Строка"));
			ТаблицаТоваров.ЗаполнитьЗначения("Товары", "ИмяТаблицы");
			
			Если ВидДокумента = Перечисления.ВидыДокументовПроверкиКратности.РеализацияТоваровИУслуг Тогда
				Для каждого СтрокаТЧ из ДокументОбъект.Услуги Цикл
					НоваяСтрока = ТаблицаТоваров.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
					НоваяСтрока.ИмяТаблицы = "Услуги";
				КонецЦикла;
			КонецЕсли;
		Иначе
			// вызывается из КоличествоПриИзмененииНаСервере, когда передается структура со данным строки
			ТаблицаТоваров = Новый ТаблицаЗначений;
			ТаблицаТоваров.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
			ТаблицаТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("СправочникСсылка.ЕдиницыИзмерений"));
			МассивТипов.Добавить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"));
			ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов(МассивТипов));
			ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
			ТаблицаТоваров.Колонки.Добавить("ИмяТаблицы", Новый ОписаниеТипов("Строка"));
			НоваяСтрока = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДокументОбъектСтруктураСтроки);
			
			ПредставлениеТаблицы = ?(ДокументОбъектСтруктураСтроки.Свойство("ПредставлениеТаблицы"), ДокументОбъектСтруктураСтроки.ПредставлениеТаблицы, ДокументОбъектСтруктураСтроки.ИмяТаблицы);
			ПолеДанныхПрефикс = ?(ДокументОбъектСтруктураСтроки.Свойство("ПолеДанныхПрефикс"), ДокументОбъектСтруктураСтроки.ПолеДанныхПрефикс, ПолеДанныхПрефикс);
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
		Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаТоваров.ИмяТаблицы КАК ИмяТаблицы,
		|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаТоваров.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ТаблицаТоваров
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.ИмяТаблицы КАК ИмяТаблицы,
		|	ВТ.НомерСтроки КАК НомерСтроки,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ.Количество КАК Количество,
		|	ВТ.Количество / Кратности.Кратность КАК Частное,
		|	Кратности.Кратность КАК Кратность,
		|	ВЫБОР
		|		КОГДА ВТ.Количество / Кратности.Кратность = (ВЫРАЗИТЬ(ВТ.Количество / Кратности.Кратность - 0.5 КАК ЧИСЛО(15, 0)))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КратностьСоответствует
		|ИЗ
		|	ВТ_ТаблицаТоваров КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Кратность КАК Кратности
		|		ПО (Кратности.Ссылка = ВТ.Номенклатура)
		|			И (Кратности.ЕдиницаИзмерения = ВТ.ЕдиницаИзмерения)
		|			И (Кратности.ВидДокумента = &ВидДокумента)
		|ГДЕ
		|	НЕ ВТ.Количество / Кратности.Кратность = (ВЫРАЗИТЬ(ВТ.Количество / Кратности.Кратность - 0.5 КАК ЧИСЛО(15, 0)))
		|	И ВТ.Количество <> 0";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПредставлениеТаблицыВСообщении = ?(ПустаяСтрока(ПредставлениеТаблицы), Выборка.ИмяТаблицы, ПредставлениеТаблицы);
			ТекстСообщения = СтрШаблон("В таблице ""%1"" в строке %2(%3) выбранное количество не соответствует заданной кратности.", 
										ПредставлениеТаблицыВСообщении, 
										?(Выборка.НомерСтроки = 0, "", Выборка.НомерСтроки), 
										Выборка.Номенклатура); 
			
			МинКратное = Цел(Выборка.Частное);
			МаксКратное = Окр(Выборка.Частное + 0.5, 0, 0);
			Если МинКратное = 0 Тогда
				ТекстСообщения = ТекстСообщения + СтрШаблон(" Рекомендуемое значение: %1 (%2)", Формат(МаксКратное * Выборка.Кратность, "ЧДЦ=2"), МаксКратное);	
			Иначе
				ТекстСообщения = ТекстСообщения + СтрШаблон(" Рекомендуемые значения: %1 (%2) или %3 (%4)", Формат(МинКратное * Выборка.Кратность, "ЧДЦ=2"), МинКратное, Формат(МаксКратное * Выборка.Кратность, "ЧДЦ=2"), МаксКратное);
			КонецЕсли;
			
			//ПолеДанных = "Объект." + Выборка.ИмяТаблицы + "[" + Формат(Выборка.НомерСтроки - 1, "ЧГ=") + "].Количество";
			Если ЗначениеЗаполнено(ИмяПоляКоличество) Тогда //nva
				ПолеДанных = ПолеДанныхПрефикс + Выборка.ИмяТаблицы + "[" + Формат(Выборка.НомерСтроки - 1, "ЧГ=") + "]." + ИмяПоляКоличество;//nva	
			Иначе	//nva
				ПолеДанных = ПолеДанныхПрефикс + Выборка.ИмяТаблицы + "[" + Формат(Выборка.НомерСтроки - 1, "ЧГ=") + "].Количество";
			КонецЕсли;//nva	
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ПолеДанных, , Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Функция создает пустую таблицу значений по метаданным табличной части объекта
//    ИмяОбъекта - строка
//    ИмяТабличнойЧасти - строка
//    МассивДополнительныхРеквизитов - массив структур вида "Новый Структура("Имя, Тип", "ИмяДобавляемогоПоля", Новый ОписаниеТипов("Число"))"
Функция ТаблицаЗначенийПоТабличнойЧастиОбъекта(ИмяОбъекта, ИмяТабличнойЧасти, МассивДополнительныхРеквизитов = Неопределено) Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Для Каждого Реквизит Из Метаданные.Документы[ИмяОбъекта].ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты Цикл
		Таблица.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);	
	КонецЦикла;
	Таблица.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	
	Если НЕ МассивДополнительныхРеквизитов = Неопределено Тогда
		Для Каждого Реквизит Из МассивДополнительныхРеквизитов Цикл
			Таблица.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);	
		КонецЦикла;
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

Функция ПроверитьНаличиеДругихЗаказовПоЛиду(ЛидСсылка, ЗаказСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЛидСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЗаказДоговор.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговор
	|ГДЕ
	|	НЕ ЗаказДоговор.ПометкаУдаления
	|	И ЗаказДоговор.Основание = &Лид
	|	И ЗаказДоговор.Основание ССЫЛКА Документ.Лид
	|	И НЕ ЗаказДоговор.Ссылка = &Заказ";
	
	Запрос.УстановитьПараметр("Лид", ЛидСсылка);
	Запрос.УстановитьПараметр("Заказ", ЗаказСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

//++ №11556
Процедура УстановитьВидимостьКомандыВывестиСписокВСпискахЛидов(Форма, ЭтоАРМ = Ложь) Экспорт
	
	// Убираем видимость только если нет роли "АРМ менеджера розницы (вывод списка лидов в табличный документ)"
	Если РольДоступна("АРММенеджераРозницыВыводСпискаЛидов") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из Форма.Элементы Цикл
		
		ИмяЭлемента = НРег(Элемент.Имя);
		
		// У списков отключаем множественный выбор
		Если ТипЗнч(Элемент) = Тип("ТаблицаФормы")
			И (СтрНайти(ИмяЭлемента, "лиды") > 0 Или Не ЭтоАРМ) // из основных списков не нужно проверять имя элемента "Лиды"
			Тогда
			Элемент.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		КонецЕсли;
		
		// Отключаем кнопку "Вывести список"
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы")
			И СтрНайти(ИмяЭлемента, "вывестисписок") > 0
			И (СтрНайти(ИмяЭлемента, "лиды") > 0 Или Не ЭтоАРМ) // из основных списков не нужно проверять имя элемента "Лиды"
			Тогда
			Элемент.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//-- №11556

//++ №11598
Процедура СохранитьВариантыОтчетовПриПереходеСВерсии_2_6_НаВерсию_2_7() Экспорт
	
	// Результат, который будет сохранен в хранилище.
	ТаблицаВариантов = ХранилищеОбщихНастроек.Загрузить("ПереносВариантовОтчетов", "ТаблицаВариантов", Неопределено, "");
	
	Если ТипЗнч(ТаблицаВариантов) <> Тип("ТаблицаЗначений") ИЛИ ТаблицаВариантов.Количество() = 0 Тогда
		ТаблицаВариантов = Новый ТаблицаЗначений;
		ТаблицаВариантов.Колонки.Добавить("Отчет",     Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		ТаблицаВариантов.Колонки.Добавить("Вариант",   Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		ТаблицаВариантов.Колонки.Добавить("Автор",     Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		ТаблицаВариантов.Колонки.Добавить("Настройка", Новый ОписаниеТипов("ХранилищеЗначения"));
		ТаблицаВариантов.Колонки.Добавить("ПредставлениеОтчета",   Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		ТаблицаВариантов.Колонки.Добавить("ПредставлениеВарианта", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		ТаблицаВариантов.Колонки.Добавить("ИдентификаторАвтора",   Новый ОписаниеТипов("УникальныйИдентификатор"));
	КонецЕсли;
	
	УдалятьВсе = Ложь; //Истина; //++
	МассивУдаляемыхКлючейОбъектов = Новый Массив;
	
	ВыборкаХранилища = ХранилищеВариантовОтчетов.Выбрать();
	ОшибокЧтенияПодряд = 0;
	Пока Истина Цикл
		Попытка
			ЭлементВыборкиПолучен = ВыборкаХранилища.Следующий();
			ОшибокЧтенияПодряд = 0;
		Исключение
			ЭлементВыборкиПолучен = Неопределено;
			ОшибокЧтенияПодряд = ОшибокЧтенияПодряд + 1;
			ПредставлениеОшибки = НСтр("ru = 'При выборке вариантов отчетов из стандартного хранилища возникла ошибка:'")
			+ Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Перенос вариантов отчетов'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			Неопределено,
			ПредставлениеОшибки
			);
		КонецПопытки;
		
		Если ЭлементВыборкиПолучен = Ложь Тогда
			Прервать;
		ИначеЕсли ЭлементВыборкиПолучен = Неопределено Тогда
			Если ОшибокЧтенияПодряд > 100 Тогда
				Прервать;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Пропуск неподключенных внутренних отчетов.
		ОтчетМетаданные = Метаданные.НайтиПоПолномуИмени(ВыборкаХранилища.КлючОбъекта);
		Если ОтчетМетаданные <> Неопределено Тогда
			ХранилищеМетаданные = ОтчетМетаданные.ХранилищеВариантов;
			Если ХранилищеМетаданные = Неопределено ИЛИ ХранилищеМетаданные.Имя <> "ХранилищеВариантовОтчетов" Тогда
				УдалятьВсе = Ложь;
				//Продолжить;  //++
			КонецЕсли;
		КонецЕсли;
		
		// Внешние варианты отчетов переносятся все, поскольку для них невозможно определить
		// подключены они к хранилищу подсистемы или нет.
		МассивУдаляемыхКлючейОбъектов.Добавить(ВыборкаХранилища.КлючОбъекта);
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ВыборкаХранилища.Пользователь);
		Если ПользовательИБ = Неопределено Тогда
			Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ВыборкаХранилища.Пользователь, Истина);
			Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
				Продолжить;
			КонецЕсли;
			ИдентификаторПользователя = Пользователь.ИдентификаторПользователяИБ;
		Иначе
			ИдентификаторПользователя = ПользовательИБ.УникальныйИдентификатор;
		КонецЕсли;
		
		СтрокаТаблицы = ТаблицаВариантов.Добавить();
		СтрокаТаблицы.Отчет     = ВыборкаХранилища.КлючОбъекта;
		СтрокаТаблицы.Вариант   = ВыборкаХранилища.КлючНастроек;
		СтрокаТаблицы.Автор     = ВыборкаХранилища.Пользователь;
		СтрокаТаблицы.Настройка = Новый ХранилищеЗначения(ВыборкаХранилища.Настройки, Новый СжатиеДанных(9));
		СтрокаТаблицы.ПредставлениеВарианта = ВыборкаХранилища.Представление;
		СтрокаТаблицы.ИдентификаторАвтора   = ИдентификаторПользователя;
		Если ОтчетМетаданные = Неопределено Тогда
			СтрокаТаблицы.ПредставлениеОтчета = ВыборкаХранилища.КлючОбъекта;
		Иначе
			СтрокаТаблицы.ПредставлениеОтчета = ОтчетМетаданные.Представление();
		КонецЕсли;
	КонецЦикла;
	
	// Запись результата в хранилище.
	ХранилищеОбщихНастроек.Сохранить("ПереносВариантовОтчетов", "ТаблицаВариантов", ТаблицаВариантов, Неопределено, "");
	
КонецПроцедуры
//-- №11598

//++ #11632
Функция ПолучитьВремяСдвигаДатыСледующегоКонтактаЛида(Событие) Экспорт
	
	ИндексЗначения = Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида.Индекс(Событие);
	ИмяСобытия = Метаданные.Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида.ЗначенияПеречисления[ИндексЗначения].Имя;
	
	НастройкаИзмененияДатыСледующегоКонтактаЛида = Константы.НастройкаИзмененияДатыСледующегоКонтактаЛида.Получить().Получить();
	Если НЕ НастройкаИзмененияДатыСледующегоКонтактаЛида = Неопределено Тогда	
		НайденныеСтроки = НастройкаИзмененияДатыСледующегоКонтактаЛида.НайтиСтроки(Новый Структура("ИмяСобытия", ИмяСобытия));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат Час(НайденныеСтроки[0].Сдвиг) * 60 * 60 + Минута(НайденныеСтроки[0].Сдвиг) * 60;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции	
//-- #11632

//++ №11160
Функция ПолучитьТекстЗапросаРазрешеннаяНоменклатураРозницы() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазрешеннаяНоменклатураРозницы.Номенклатура КАК Группа
	|ПОМЕСТИТЬ ВТ_РазрешенныеГруппы
	|ИЗ
	|	РегистрСведений.РазрешеннаяНоменклатураРозницы КАК РазрешеннаяНоменклатураРозницы
	|ГДЕ
	|	РазрешеннаяНоменклатураРозницы.Номенклатура.ЭтоГруппа
	|	И РазрешеннаяНоменклатураРозницы.Назначение = &Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_РазрешеннаяНоменклатураРозницы
	|ИЗ
	|	Справочник.Номенклатура КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				РазрешенныеГруппы.Группа
	|			ИЗ
	|				ВТ_РазрешенныеГруппы КАК РазрешенныеГруппы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РазрешеннаяНоменклатураРозницы.Номенклатура
	|ИЗ
	|	РегистрСведений.РазрешеннаяНоменклатураРозницы КАК РазрешеннаяНоменклатураРозницы
	|ГДЕ
	|	НЕ РазрешеннаяНоменклатураРозницы.Номенклатура.ЭтоГруппа
	|	И РазрешеннаяНоменклатураРозницы.Назначение = &Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК ДанныеСправочника
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазрешеннаяНоменклатураРозницы КАК РазрешеннаяНоменклатураРозницы
	|		ПО ДанныеСправочника.Ссылка = РазрешеннаяНоменклатураРозницы.Номенклатура
	|ГДЕ
	|	ДанныеСправочника.Ссылка В(&МассивНоменклатуры)
	|	И ДанныеСправочника.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга))
	|	И РазрешеннаяНоменклатураРозницы.Номенклатура ЕСТЬ NULL";
	
	Возврат ТекстЗапроса;
	
КонецФункции
//-- №11160

//++ #12484
Функция ПолучитьСписокЗаказовПокупателейКОтгрузке() Экспорт
	
	МассивЗаказов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбщиеСклады", Константы.ОбщиеСклады.Получить());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ЗаказыВработе
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)
	|	И ЗаказПокупателя.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ЗаказыПокупателейОбороты.ЗаказНаПроизводство КАК Документ.ЗаказПокупателя) КАК ЗаказПокупателя,
	|	ЗаказыПокупателейОбороты.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказыПокупателейОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ЗаказыПокупателейОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ЗаказыПокупателейОбороты.КоличествоРасход КАК КоличествоРасход,
	|	ЗаказыПокупателейОбороты.КоличествоПриход - ЗаказыПокупателейОбороты.КоличествоРасход КАК Потребность
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(
	|			,
	|			,
	|			,
	|			ЗаказНаПроизводство В
	|				(ВЫБРАТЬ
	|					ВТ_ЗаказыВработе.Ссылка
	|				ИЗ
	|					ВТ_ЗаказыВработе)) КАК ЗаказыПокупателейОбороты
	|ГДЕ
	|	ЗаказыПокупателейОбороты.ЗаказНаПроизводство ССЫЛКА Документ.ЗаказПокупателя
	|	И ЗаказыПокупателейОбороты.КоличествоПриход - ЗаказыПокупателейОбороты.КоличествоРасход > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВТ.Потребность КАК Потребность,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыВРезервеПоЗаказуОстатки.КоличествоОстаток, 0) КАК ВРезервеПодЗаказ,
	|	ЕСТЬNULL(ТоварыВРезервеПоЗаказамОстатки.КоличествоОстаток, 0) КАК ВРезервеОбщее
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ВТ.Номенклатура)
	|			И (ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ВТ.ХарактеристикаНоменклатуры)
	|			И (ТоварыНаСкладахОстатки.СерияНоменклатуры = ВТ.СерияНоменклатуры)
	|			И (ТоварыНаСкладахОстатки.Склад = ВТ.ЗаказПокупателя.Склад)
	|			И (ВЫБОР
	|				КОГДА &ОбщиеСклады
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ТоварыНаСкладахОстатки.Организация = ВТ.ЗаказПокупателя.Организация
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеПоЗаказуОстатки
	|		ПО (ТоварыВРезервеПоЗаказуОстатки.Номенклатура = ВТ.Номенклатура)
	|			И (ТоварыВРезервеПоЗаказуОстатки.ХарактеристикаНоменклатуры = ВТ.ХарактеристикаНоменклатуры)
	|			И (ТоварыВРезервеПоЗаказуОстатки.СерияНоменклатуры = ВТ.СерияНоменклатуры)
	|			И (ТоварыВРезервеПоЗаказуОстатки.ДокументРезерва = ВТ.ЗаказПокупателя)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеПоЗаказамОстатки
	|		ПО (ТоварыВРезервеПоЗаказамОстатки.Номенклатура = ВТ.Номенклатура)
	|			И (ТоварыВРезервеПоЗаказамОстатки.ХарактеристикаНоменклатуры = ВТ.ХарактеристикаНоменклатуры)
	|			И (ТоварыВРезервеПоЗаказамОстатки.СерияНоменклатуры = ВТ.СерияНоменклатуры)
	|ИТОГИ ПО
	|	ЗаказПокупателя";
	
	
	ВыборкаЗаказов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаказов.Следующий() Цикл
		ЗаказГотовКотгрузке = Истина;
		Выборка = ВыборкаЗаказов.Выбрать();
		Пока Выборка.Следующий() Цикл
			// требуется больше, чем есть
			Если Выборка.Потребность > Выборка.КоличествоОстаток
				// остаток за минусом резервов на другие заказы покрывается потребность
				ИЛИ Выборка.Потребность > Выборка.КоличествоОстаток - (Выборка.ВРезервеОбщее - Выборка.ВРезервеПодЗаказ) Тогда
				ЗаказГотовКотгрузке = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗаказГотовКотгрузке Тогда
			МассивЗаказов.Добавить(ВыборкаЗаказов.ЗаказПокупателя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЗаказов;
	
КонецФункции
//-- #12484

// Функция преобразует Массив из структур в ТаблицуЗначений.
//
Функция ПреобразоватьМассивВТаблицуЗначений(МассивСтруктур, ПривестиТипы = Ложь) Экспорт
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	Для Каждого ЭлементМассива Из МассивСтруктур Цикл
		// Рисуем колонки для таблицы
		Если ТаблицаДанных.Колонки.Количество() = 0 Тогда
			Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
				ТаблицаДанных.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
			КонецЦикла;
		КонецЕсли;
		
		// Добавляем данные в таблицу
		НоваяСтрока = ТаблицаДанных.Добавить();
		Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
			НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
		КонецЦикла;
	КонецЦикла;
	
	Если ПривестиТипы Тогда
		ИндексКолонки = 0;
		Для каждого КолонкаТЗ из ТаблицаДанных.Колонки Цикл
			
			МассивТиповКолонки = новый Массив;
			НачальноеИмяКолонки = КолонкаТЗ.Имя;
			Для каждого СтрокаТЗ из ТаблицаДанных Цикл
				Тип = ТипЗнч(СтрокаТЗ[НачальноеИмяКолонки]);
				Если МассивТиповКолонки.Найти(Тип) = Неопределено Тогда
					МассивТиповКолонки.Добавить(Тип);	
				КонецЕсли;
			КонецЦикла;
			
			ДопустимыеТипы = Новый ОписаниеТипов(МассивТиповКолонки);
			
			ТаблицаДанных.Колонки.Вставить(ИндексКолонки, НачальноеИмяКолонки + "_", ДопустимыеТипы);
			ТаблицаДанных.ЗагрузитьКолонку(ТаблицаДанных.ВыгрузитьКолонку(НачальноеИмяКолонки), НачальноеИмяКолонки + "_");
			ТаблицаДанных.Колонки.Удалить(ИндексКолонки+1);
			ТаблицаДанных.Колонки[ИндексКолонки].Имя = НачальноеИмяКолонки;
			
			ИндексКолонки = ИндексКолонки + 1;
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТаблицаДанных;
	
КонецФункции // ПреобразоватьМассивВТаблицуЗначений()

//++ №12464
Процедура ВыполнитьПроверкуПоследнегоАдминистратораПользователя(ПользовательОбъект) Экспорт
	
	// Пользователь "<Не указан>"
	Если ПользовательОбъект.Служебный Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПользовательОбъект.ЭтоНовый() Тогда
		
		ТекущийПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПользовательОбъект.ИдентификаторПользователяИБ);
		
		Если ТекущийПользовательИБ.Роли.Содержит(Метаданные.Роли.АдминистраторСистемы)
			И (ПользовательОбъект.ПометкаУдаления Или ПользовательОбъект.Недействителен
			Или НЕ ТекущийПользовательИБ.АутентификацияСтандартная) Тогда
			
			// В случаях, если:
			// - установлена галочка "Недействителен"
			// - сняты галочки "Вход в программу разрешен" или "Аутентификация 1С:Предприятие"
			// - производится пометка на удаление
			// Если это был пользователь с ролью "Администратор системы", проверять что не остается ни одного пользователя с ролью "Администратор системы" (кроме "Службы поддержки SmartCeilings")
			УстановитьПривилегированныйРежим(Истина);
			
			Выборка = Справочники.Пользователи.Выбрать();
			
			ЕстьАктивныйАдминистратор = Ложь;
			Пока Выборка.Следующий() Цикл
				
				Если НЕ ЗначениеЗаполнено(Выборка.ИдентификаторПользователяИБ) Или Выборка.Ссылка = ПользовательОбъект.Ссылка Тогда
					Продолжить;
				КонецЕсли;
				
				ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
				
				Если НРег(ПользовательИБ.Имя) = "support" Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПользовательИБ.Роли.Содержит(Метаданные.Роли.АдминистраторСистемы)
					И ПользовательИБ.АутентификацияСтандартная // это галочка Аутентификация 1С:Предприятие
					// Вход в программу разрешен регулируется выбором одной из трёх галочек Аутетификация
					И НЕ Выборка.Недействителен
					И НЕ Выборка.ПометкаУдаления
					Тогда
					ЕстьАктивныйАдминистратор = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ ЕстьАктивныйАдминистратор Тогда
				
				ТекстОшибки = "ВНИМАНИЕ! После данного действия в системе не останется ни одного администратора. Действие отменено";
				ВызватьИсключение ТекстОшибки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//-- №12464

//++ #12364
Процедура ДополнительнаяИнформацияПоКонтрагентуНаФорме(Контрагент, ЭлементФормы) Экспорт
	
	ТекстПодсказки = "";
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "Дополнительно, ПоказыватьДопИнформацию");
		ЭлементФормы.Видимость = ДанныеКонтрагента.ПоказыватьДопИнформацию;
		ЭлементФормы.РасширеннаяПодсказка.Заголовок = ДанныеКонтрагента.Дополнительно;
	Иначе
		ЭлементФормы.Видимость = Ложь;
		ЭлементФормы.РасширеннаяПодсказка.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЕстьИндивидуальныеЦеныКонтрагентаНаФорме(Дата, Контрагент, Договор, ЭлементФормы) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены") И ЗначениеЗаполнено(Контрагент) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЦеныСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыИндивидуальные.СрезПоследних(
		|			&Период,
		|			Контрагент = &Контрагент
		|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК ЦеныСрезПоследних";
		
		Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ЭлементФормы.Видимость = НЕ РезультатЗапроса.Пустой();
	Иначе
		ЭлементФормы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура РегулировкаШириныПоляКонтрагента(ЭлементыФормы, ЭлементКонтрагент, ЭлементПоказатьДополнительнуюИнформацию, ЭлементЕстьИндивидуальныеЦены = Неопределено, ШиринаПоУмолчанию=40) Экспорт
	
	НоваяШирина = ШиринаПоУмолчанию;
	Если ЭлементПоказатьДополнительнуюИнформацию.Видимость Тогда
		НоваяШирина = НоваяШирина - 4;	
	КонецЕсли;
	Если НЕ ЭлементЕстьИндивидуальныеЦены = Неопределено И ЭлементЕстьИндивидуальныеЦены.Видимость Тогда
		НоваяШирина = НоваяШирина - 4;	
	КонецЕсли;
	
	//#13754
	ГруппаКнопокМессенджеры = ЭлементыФормы.Найти("ГруппаКонтрагентКПМессенджеры");
	Если НЕ ГруппаКнопокМессенджеры = Неопределено Тогда
		КоличествоКнопокМессенджеров = ГруппаКнопокМессенджеры.ПодчиненныеЭлементы.Количество();
		
		Если КоличествоКнопокМессенджеров > 0 Тогда
			НоваяШирина = НоваяШирина - 1 - 3*КоличествоКнопокМессенджеров;	
		КонецЕсли;			
	КонецЕсли;
	
	ЭлементКонтрагент.АвтомаксимальнаяШирина = Ложь;
	ЭлементКонтрагент.МаксимальнаяШирина = НоваяШирина;
	
КонецПроцедуры
//-- #12364 

//++ №13388
Процедура УстановитьПериодАвтоОбновленияДляВсехДинамическихСписков(Форма, Знач Секунд) Экспорт
	
	Если Секунд = 0 Тогда
		Секунд = 60;
	КонецЕсли;
	
	Для Каждого ТекущийЭлемент Из Форма.Элементы Цикл
		
		Если ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы")
			И ЗначениеЗаполнено(ТекущийЭлемент.ПутьКДанным)
			И ТипЗнч(Форма[ТекущийЭлемент.ПутьКДанным]) = Тип("ДинамическийСписок") Тогда
			
			ТекущийЭлемент.АвтоОбновление = Истина;
			ТекущийЭлемент.ПериодАвтоОбновления = Секунд;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//-- №13388

//++ №13455
Функция ПолучитьНомерВерсииЧислом(Версия, Порядок = 999) Экспорт
	
	// Числовое значение версии, формируется как:
	// НОМЕР_ВЕРСИИ+XXX_НОМЕР_ПОДВЕРСИИ+YYY_НОМЕР_РЕЛИЗА+ZZZ_ВНУТРЕННИЙ_ПОРЯДОК_ОБЪЕКТА
	// где:
	//	- XXX_НОМЕР_ПОДВЕРСИИ - дополненная нулями до трёх знаков номер подверсии
	//	- YYY_НОМЕР_РЕЛИЗА - дополненная нулями до трёх знаков номер релиза, примеры:
	//	- ZZZ_ВНУТРЕННИЙ_ПОРЯДОК_ОБЪЕКТА - дополненная нулями до трёх знаков очередь, если она вдруг нужна, внутри релиза
	//	  (например внутри релиза обязательно сначала надо обработать ЗД, а потом монтажи, тогда для ЗД ZZZ_ВНУТРЕННИЙ_ПОРЯДОК_ОБЪЕКТА = 001,
	//	  а для монтажей ZZZ_ВНУТРЕННИЙ_ПОРЯДОК_ОБЪЕКТА = 002. Если для объекта внутри релиза порядок обработки не важен, обязательно присваивать ZZZ_ВНУТРЕННИЙ_ПОРЯДОК_ОБЪЕКТА = 999
	
	// На входе ожидаем версию в формате 2.8.12.0
	МассивЧисел = СтрРазделить(Версия, ".", Ложь);
	
	Если НЕ МассивЧисел.Количество() = 4 Тогда
		Возврат 0;
	КонецЕсли;
	
	// Первые три числа используем для формирования версии числом
	
	Попытка
		ВерсияЧислом = Число(СтрШаблон("%1%2%3%4",
		МассивЧисел[0], 									// номер версии
		Формат(Число(МассивЧисел[1]), 	"ЧЦ=3; ЧН=; ЧВН="), // номер подверсии
		Формат(Число(МассивЧисел[2]), 	"ЧЦ=3; ЧН=; ЧВН="), // номер релиза
		Формат(Порядок, 				"ЧЦ=3; ЧН=; ЧВН=") 	// порядок
		));
	Исключение
		ВерсияЧислом = 0;
	КонецПопытки;
	
	Возврат ВерсияЧислом;
	
КонецФункции
//-- №13455

//++ #13710
Процедура ПроверитьИзменениеВзаиморасчетовПередЗаписью(ДокументОбъект, РежимЗаписи) Экспорт
	
	ИмяРеквизитаСумма = "СуммаДокумента";
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОплатаБанковскойКартой") 
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер")	
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета")
		Тогда
		ИмяРеквизитаСумма = "Сумма";	
	КонецЕсли;
	ПоляДокумента = "Дата, Проведен, ПометкаУдаления, " + ИмяРеквизитаСумма;
	
	ПредыдущиеДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.Ссылка, ПоляДокумента); // если документ новый, то данные будут = Неопределено
	
	ДокументОбъект.ДополнительныеСвойства.Вставить("Дата",  	ПредыдущиеДанныеДокумента.Дата);
	ДокументОбъект.ДополнительныеСвойства.Вставить("Проведен",  ПредыдущиеДанныеДокумента.Проведен);
	ДокументОбъект.ДополнительныеСвойства.Вставить("ПометкаУдаления",  ПредыдущиеДанныеДокумента.ПометкаУдаления);
	ДокументОбъект.ДополнительныеСвойства.Вставить("Сумма", 	ПредыдущиеДанныеДокумента[ИмяРеквизитаСумма]);
	ДокументОбъект.ДополнительныеСвойства.Вставить("ИмяРеквизитаСумма", 	ИмяРеквизитаСумма);
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СоглашениеОРасторженииДоговора") Тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("Контрагент", ДокументОбъект.ЗаказДоговор.Контрагент);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИзменениеВзаиморасчетовПриЗаписи(Знач ДокументОбъект, Отказ) Экспорт
	
	//#9989
	Если НЕ Отказ И ПолучитьФункциональнуюОпцию("ОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетов") Тогда
		
		ДополнительныеСвойства = ДокументОбъект.ДополнительныеСвойства;
		
		ПредыдущийПериод = Неопределено;
		ПредыдущаяСумма = 0;
		ПредыдущееСостояниеПроведен = Неопределено;
		//ПредыдущаяПометкаУдаления = Неопределено;
		ИмяРеквизитаСумма = "СуммаДокумента";
		Если НЕ ДополнительныеСвойства.Свойство("Дата", ПредыдущийПериод) 
			ИЛИ НЕ ДополнительныеСвойства.Свойство("Сумма", ПредыдущаяСумма) 
			ИЛИ НЕ ДополнительныеСвойства.Свойство("Проведен", ПредыдущееСостояниеПроведен)
			//ИЛИ НЕ ДополнительныеСвойства.Свойство("ПометкаУдаления", ПредыдущаяПометкаУдаления)
			ИЛИ НЕ ДополнительныеСвойства.Свойство("ИмяРеквизитаСумма", ИмяРеквизитаСумма)
			Тогда
			Возврат;
		КонецЕсли;
		
		// для новых документов
		ПредыдущееСостояниеПроведен = ?(ПредыдущееСостояниеПроведен = Неопределено, Ложь, ПредыдущееСостояниеПроведен);
		//ПредыдущаяПометкаУдаления = ?(ПредыдущаяПометкаУдаления = Неопределено, Ложь, ПредыдущаяПометкаУдаления);
		
		ИзменилсяРежимПроведения = (ПредыдущееСостояниеПроведен И НЕ ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение) 
		ИЛИ (НЕ ПредыдущееСостояниеПроведен И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение);
		
		ИзменилисьРеквизиты = НЕ ДокументОбъект.Дата = ПредыдущийПериод ИЛИ НЕ ДокументОбъект[ИмяРеквизитаСумма] = ПредыдущаяСумма; 		
		
		Контрагент = ?(ДополнительныеСвойства.Свойство("Контрагент"), ДополнительныеСвойства.Контрагент, ДокументОбъект.Контрагент);
		
		Если ИзменилсяРежимПроведения
			ИЛИ (ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение И ИзменилисьРеквизиты)
			Тогда
			
			МенеджерЗаписи = РегистрыСведений.ЗаданияНаОтправкуЭлектронныхПисем.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Документ 	= ДокументОбъект.Ссылка;
			МенеджерЗаписи.ВидЗадания 	= Перечисления.ВидыЗаданийНаОтправкуЭлектронныхПисем.ОтправкаДетализацииВзаиморасчетов;
			МенеджерЗаписи.Прочитать();
			Если НЕ МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Документ 	= ДокументОбъект.Ссылка;
				МенеджерЗаписи.ВидЗадания 	= Перечисления.ВидыЗаданийНаОтправкуЭлектронныхПисем.ОтправкаДетализацииВзаиморасчетов;
				МенеджерЗаписи.Организация 	= ДокументОбъект.Организация;
				МенеджерЗаписи.Контрагент 	= Контрагент;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//-- #13710

Функция ПолучитьСпособКомпенсацииПоВозвратуТоваровОтПокупателя() Экспорт
	
	//#15395 только константа
	СпособКомпенсацииПоВозвратуТоваровОтПокупателя = Константы.СпособКомпенсацииПоВозвратуТоваровОтПокупателяПоУмолчанию.Получить();
	
	//СпособКомпенсацииПоВозвратуТоваровОтПокупателя = ПараметрыСеанса.ТекущийПользователь.СпособКомпенсацииПоВозвратуТоваровОтПокупателя; // №13469
	//
	////++ №13856 если в карточке пользователя не указан способ компенсации, берем способ из настроек программы
	//Если Не ЗначениеЗаполнено(СпособКомпенсацииПоВозвратуТоваровОтПокупателя) Тогда
	//	СпособКомпенсацииПоВозвратуТоваровОтПокупателя = Константы.СпособКомпенсацииПоВозвратуТоваровОтПокупателяПоУмолчанию.Получить();
	//КонецЕсли;
	//-- №13856
	
	//++ №13469 #14713 закомментрировано
	//Если Не ЗначениеЗаполнено(СпособКомпенсацииПоВозвратуТоваровОтПокупателя) Тогда
	//	СпособКомпенсацииПоВозвратуТоваровОтПокупателя = Перечисления.ВариантыКомпенсацииПоВозврату.ОтгрузитьПовторно;
	//КонецЕсли;
	//-- №13469
	
	Возврат СпособКомпенсацииПоВозвратуТоваровОтПокупателя;
	
КонецФункции

Функция СтруктураПолейЛидаПриАвтоматическомСоздании() Экспорт
	
	//#14718
	СтруктураВозврата = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПорядокЗаполненияПолейЛида.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ПорядокЗаполненияПолейЛида КАК ПорядокЗаполненияПолейЛида
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокЗаполненияПолейЛида.РеквизитДопУпорядочивания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураВозврата.Вставить(Выборка.ИмяПредопределенныхДанных, Неопределено);
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ЗаполнитьПоляЛидаПриАвтоматическомСоздании(ЛидОбъект, СтруктураПолей) Экспорт
	
	//#14718
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПорядокЗаполненияПолейЛида.Ссылка КАК Ссылка,
	|	ПорядокЗаполненияПолейЛида.Наименование КАК Наименование,
	|	ПорядокЗаполненияПолейЛида.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ПорядокЗаполненияПолейЛида КАК ПорядокЗаполненияПолейЛида
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокЗаполненияПолейЛида.РеквизитДопУпорядочивания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ИмяПоля = Выборка.ИмяПредопределенныхДанных;
		
		// поле в рамках данного способа создания лида не заполняется
		Если СтруктураПолей[ИмяПоля] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяПоля = "ТелефонКлиента" Тогда
			 УправлениеКонтактнойИнформациейПотолки.ЗаписатьКонтактнуюИнформацию(ЛидОбъект, СтруктураПолей[ИмяПоля], 
			 																	 Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, 
																				 Перечисления.ТипыКонтактнойИнформации.Телефон, Новый УникальныйИдентификатор);
		Иначе			
			ЛидОбъект[ИмяПоля] = СтруктураПолей[ИмяПоля];
		КонецЕсли;
	
		Если ИмяПоля = "РекламнаяАкция" И ЗначениеЗаполнено(ЛидОбъект.РекламнаяАкция) Тогда
			РеквизитыРА = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЛидОбъект.РекламнаяАкция, 
					"Организация, Подразделение, Город,
					|РекламныйИсточник"); //, ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений");		
			Если ЗначениеЗаполнено(РеквизитыРА.Подразделение) И НЕ Константы.ИспользоватьПодразделения.Получить() Тогда
				РеквизитыРА.Подразделение = Справочники.Подразделения.ПустаяСсылка();	
			КонецЕсли;
			
			// изменено в рамках той же заявки: заполняем реквизит лида если только заполнено значение в рекламном источнике / акции
			//Если НЕ ЗначениеЗаполнено(ЛидОбъект.Организация) 
			//	ИЛИ РеквизитыРА.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
			Если ЗначениеЗаполнено(РеквизитыРА.Организация) Тогда
				ЛидОбъект.Организация = РеквизитыРА.Организация;
			КонецЕсли;
			//Если НЕ ЗначениеЗаполнено(ЛидОбъект.Подразделение) 
			//	ИЛИ РеквизитыРА.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
			Если ЗначениеЗаполнено(РеквизитыРА.Подразделение) Тогда
				ЛидОбъект.Подразделение = РеквизитыРА.Подразделение;
			КонецЕсли;
			//Если НЕ ЗначениеЗаполнено(ЛидОбъект.Город) 
			//	ИЛИ РеквизитыРА.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
			Если ЗначениеЗаполнено(РеквизитыРА.Город) Тогда
				ЛидОбъект.Город = РеквизитыРА.Город;
			КонецЕсли;
			//Если НЕ ЗначениеЗаполнено(ЛидОбъект.РекламныйИсточник) 
			//	ИЛИ РеквизитыРА.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
			Если ЗначениеЗаполнено(РеквизитыРА.РекламныйИсточник) Тогда
				ЛидОбъект.РекламныйИсточник = РеквизитыРА.РекламныйИсточник;
			КонецЕсли;
			
		ИначеЕсли ИмяПоля = "РекламныйИсточник" И ЗначениеЗаполнено(ЛидОбъект.РекламныйИсточник) Тогда			
			РеквизитыРИ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЛидОбъект.РекламныйИсточник, 
					"Организация, Подразделение, Город,
					|РекламнаяАкция"); //, ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений");	
			Если ЗначениеЗаполнено(РеквизитыРИ.Подразделение) И НЕ Константы.ИспользоватьПодразделения.Получить() Тогда
				РеквизитыРИ.Подразделение = Справочники.Подразделения.ПустаяСсылка();	
			КонецЕсли;
			
			//Если НЕ ЗначениеЗаполнено(ЛидОбъект.Организация) 
			//	ИЛИ РеквизитыРИ.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
			Если ЗначениеЗаполнено(РеквизитыРИ.Организация) Тогда
				ЛидОбъект.Организация = РеквизитыРИ.Организация;
			КонецЕсли;
			//Если НЕ ЗначениеЗаполнено(ЛидОбъект.Подразделение) 
			//	ИЛИ РеквизитыРИ.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
			Если ЗначениеЗаполнено(РеквизитыРИ.Подразделение) Тогда
				ЛидОбъект.Подразделение = РеквизитыРИ.Подразделение;
			КонецЕсли;
			//Если НЕ ЗначениеЗаполнено(ЛидОбъект.Город) 
			//	ИЛИ РеквизитыРИ.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
			Если ЗначениеЗаполнено(РеквизитыРИ.Город) Тогда
				ЛидОбъект.Город = РеквизитыРИ.Город;
			КонецЕсли;
			//Если НЕ ЗначениеЗаполнено(ЛидОбъект.РекламнаяАкция) 
			//	ИЛИ РеквизитыРИ.ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений Тогда
			Если ЗначениеЗаполнено(РеквизитыРИ.РекламнаяАкция) Тогда
				ЛидОбъект.РекламнаяАкция = РеквизитыРИ.РекламнаяАкция;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#Область КонтрольМатериаловВПроизводстве

//++ №14311 контроль материалов в производстве
Процедура ВыполнитьКонтрольМатериаловВПроизводстве(Дата, Организация, Материалы1, Материалы2, Отказ, ВидДокументаКонтроля) Экспорт
	
	// Сначала нужно найти документ настройки контроля, если нет подходящего выводим сообщение и контроль не выполняем
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НастройкаКонтроляМатериаловВПроизводстве.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НастройкаКонтроляМатериаловВПроизводстве КАК НастройкаКонтроляМатериаловВПроизводстве
	|ГДЕ
	|	НастройкаКонтроляМатериаловВПроизводстве.Организация = &Организация
	|	И НастройкаКонтроляМатериаловВПроизводстве.ВидДокументаКонтроля = &ВидДокументаКонтроля
	|	И НастройкаКонтроляМатериаловВПроизводстве.Дата <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкаКонтроляМатериаловВПроизводстве.Дата УБЫВ
	|";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидДокументаКонтроля", ВидДокументаКонтроля);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДокументКонтроля = Выборка.Ссылка;
		
	Иначе
		
		Сообщить(СтрШаблон("По организации %1, на дату %2 не найден документ настройки контроля материалов в производстве.", Организация, Дата));
		Возврат;
		
	КонецЕсли;
	
	Материалы1.Колонки.Добавить("ГруппаНоменклатуры", новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Материалы1.Колонки.Добавить("ВидНоменклатуры", новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	Материалы1.Колонки.Добавить("КонтролироватьКоличество", новый ОписаниеТипов("Булево"));
	Материалы1.Колонки.Добавить("КонтролироватьВыработку", новый ОписаниеТипов("Булево"));
	Материалы1.Колонки.Добавить("ПопозиционныйКонтроль", новый ОписаниеТипов("Булево"));
	
	МассивНоменклатур = Материалы1.ВыгрузитьКолонку("Номенклатура");
	
	ПривестиВидыНоменклатурыКСоответствиюПроверкиМатериалов(Материалы1);
	
	Материалы2.Колонки.Добавить("ГруппаНоменклатуры", новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Материалы2.Колонки.Добавить("ВидНоменклатуры", новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	Материалы2.Колонки.Добавить("КонтролироватьКоличество", новый ОписаниеТипов("Булево"));
	Материалы2.Колонки.Добавить("КонтролироватьВыработку", новый ОписаниеТипов("Булево"));
	Материалы2.Колонки.Добавить("ПопозиционныйКонтроль", новый ОписаниеТипов("Булево"));
	
	Для Каждого ТекущаяСтрока Из Материалы2 Цикл
		МассивНоменклатур.Добавить(ТекущаяСтрока.Номенклатура);
	КонецЦикла;
	
	ПривестиВидыНоменклатурыКСоответствиюПроверкиМатериалов(Материалы2);
	
	// Сначала получим данные для контроля по "Группам номенклатуры" т.к. это сложный контроль с учётом иерархии
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкаКонтроляМатериаловВПроизводствеНоменклатура.Номенклатура КАК ГруппаНоменклатуры,
	|	НастройкаКонтроляМатериаловВПроизводствеНоменклатура.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	НастройкаКонтроляМатериаловВПроизводствеНоменклатура.КонтролироватьВыработку КАК КонтролироватьВыработку,
	|	НастройкаКонтроляМатериаловВПроизводствеНоменклатура.ПопозиционныйКонтроль КАК ПопозиционныйКонтроль,
	|	0 КАК Уровень
	|ИЗ
	|	Документ.НастройкаКонтроляМатериаловВПроизводстве.Номенклатура КАК НастройкаКонтроляМатериаловВПроизводствеНоменклатура
	|ГДЕ
	|	НастройкаКонтроляМатериаловВПроизводствеНоменклатура.Номенклатура.ЭтоГруппа
	|	И НастройкаКонтроляМатериаловВПроизводствеНоменклатура.Ссылка = &ДокументКонтроля
	|";
	Запрос.УстановитьПараметр("ДокументКонтроля", ДокументКонтроля);
	
	НастройкиКонтроляПоГруппам = Запрос.Выполнить().Выгрузить();
	
	// Сделаем сортировку по уровням, чтобы если например выбрали и основную группу и ещё подгруппу из этой группы
	// тогда подгруппа будет более высокая по приоритету (обработается в конце)
	Для Каждого ТекущаяСтрока Из НастройкиКонтроляПоГруппам Цикл
		ТекущаяСтрока.Уровень = ТекущаяСтрока.ГруппаНоменклатуры.Уровень();
	КонецЦикла;
	
	НастройкиКонтроляПоГруппам.Сортировать("Уровень");
	
	// Делаем в цикле по кажой группе номенклатуры, т.к. в ИЕРАРХИИ и нам нужно знать по какой конечной группе идёт контроль
	Для Каждого НастройкаКонтроляПоГруппам Из НастройкиКонтроляПоГруппам Цикл
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В (&МассивНоменклатур)
		|	И Номенклатура.Ссылка В ИЕРАРХИИ (&ГруппаНоменклатуры)
		|";
		Запрос.УстановитьПараметр("МассивНоменклатур", МассивНоменклатур);
		Запрос.УстановитьПараметр("ГруппаНоменклатуры", НастройкаКонтроляПоГруппам.ГруппаНоменклатуры);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			// Заполняем в ТЧ №1
			НайденныеСтроки = Материалы1.НайтиСтроки(новый Структура("Номенклатура", Выборка.Номенклатура));
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(НайденнаяСтрока, НастройкаКонтроляПоГруппам);
			КонецЦикла;
			
			// Заполняем в ТЧ №2
			НайденныеСтроки = Материалы2.НайтиСтроки(новый Структура("Номенклатура", Выборка.Номенклатура));
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(НайденнаяСтрока, НастройкаКонтроляПоГруппам);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = "
	// Настройки контроля "Вид номенклатуры"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкаКонтроляМатериаловВПроизводствеВидНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
	|	НастройкаКонтроляМатериаловВПроизводствеВидНоменклатуры.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	НастройкаКонтроляМатериаловВПроизводствеВидНоменклатуры.КонтролироватьВыработку КАК КонтролироватьВыработку,
	|	НастройкаКонтроляМатериаловВПроизводствеВидНоменклатуры.ПопозиционныйКонтроль КАК ПопозиционныйКонтроль
	|ПОМЕСТИТЬ ВТ_НастройкаКонтроляПоВидуНоменклатуры
	|ИЗ
	|	Документ.НастройкаКонтроляМатериаловВПроизводстве.ВидНоменклатуры КАК НастройкаКонтроляМатериаловВПроизводствеВидНоменклатуры
	|ГДЕ
	|	НастройкаКонтроляМатериаловВПроизводствеВидНоменклатуры.Ссылка = &ДокументКонтроля
	|
	|;
	|///////////////////////////////////////
	// Настройки контроля "Номенклатура" (только элементы)
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкаКонтроляМатериаловВПроизводствеНоменклатура.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	НастройкаКонтроляМатериаловВПроизводствеНоменклатура.Номенклатура КАК Номенклатура,
	|	НастройкаКонтроляМатериаловВПроизводствеНоменклатура.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	НастройкаКонтроляМатериаловВПроизводствеНоменклатура.КонтролироватьВыработку КАК КонтролироватьВыработку,
	|	НастройкаКонтроляМатериаловВПроизводствеНоменклатура.ПопозиционныйКонтроль КАК ПопозиционныйКонтроль
	|ПОМЕСТИТЬ ВТ_НастройкаКонтроляПоНоменклатуре
	|ИЗ
	|	Документ.НастройкаКонтроляМатериаловВПроизводстве.Номенклатура КАК НастройкаКонтроляМатериаловВПроизводствеНоменклатура
	|ГДЕ
	|	НЕ НастройкаКонтроляМатериаловВПроизводствеНоменклатура.Номенклатура.ЭтоГруппа
	|	И НастройкаКонтроляМатериаловВПроизводствеНоменклатура.Ссылка = &ДокументКонтроля
	|
	|;
	|///////////////////////////////////////
	// Исходная "Материалы ТЧ №1"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Материалы1.Номенклатура КАК Номенклатура,
	|	Материалы1.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ЕСТЬNULL(Материалы1.КоличествоКВыработке, 0) КАК КоличествоКВыработке,
	|	ЕСТЬNULL(Материалы1.Количество, 0)  * ЕСТЬNULL(Материалы1.Коэффициент, 0) КАК Количество
	|ПОМЕСТИТЬ ВТ_Материалы1_Исходная
	|ИЗ
	|	&Материалы1 КАК Материалы1
	|;
	|////////////////////////////////////////////////////////////////////////////////
	// Материалы ТЧ №1 с настройкой "Номенклатура" (только элементы)
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Материалы1.Номенклатура КАК Номенклатура,
	|	НастройкаКонтроля.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	НастройкаКонтроля.КонтролироватьВыработку КАК КонтролироватьВыработку,
	|	НастройкаКонтроля.ПопозиционныйКонтроль КАК ПопозиционныйКонтроль
	|ПОМЕСТИТЬ ВТ_Материалы1_ПоНоменклатуре
	|ИЗ
	|	ВТ_Материалы1_Исходная КАК Материалы1
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкаКонтроляПоНоменклатуре КАК НастройкаКонтроля
	|		ПО Материалы1.Номенклатура = НастройкаКонтроля.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Материалы ТЧ №1 с настройкой "Номенклатура" (только группы)
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Материалы1.ГруппаНоменклатуры КАК ГруппаНоменклатуры,
	|	Материалы1.Номенклатура КАК Номенклатура,
	|	Материалы1.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	Материалы1.КонтролироватьВыработку КАК КонтролироватьВыработку,
	|	Материалы1.ПопозиционныйКонтроль КАК ПопозиционныйКонтроль
	|ПОМЕСТИТЬ ВТ_Материалы1_ПоГруппеНоменклатуры
	|ИЗ
	|	&Материалы1 КАК Материалы1
	|ГДЕ
	|	НЕ Материалы1.ГруппаНоменклатуры = Значение(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	// Материалы ТЧ №1 с настройкой "Вид номенклатуры"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Материалы1.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Материалы1.Номенклатура КАК Номенклатура,
	|	НастройкаКонтроля.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	НастройкаКонтроля.КонтролироватьВыработку КАК КонтролироватьВыработку,
	|	НастройкаКонтроля.ПопозиционныйКонтроль КАК ПопозиционныйКонтроль
	|ПОМЕСТИТЬ ВТ_Материалы1_ПоВидуНоменклатуры
	|ИЗ
	|	ВТ_Материалы1_Исходная КАК Материалы1
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкаКонтроляПоВидуНоменклатуры КАК НастройкаКонтроля
	|		ПО Материалы1.ВидНоменклатуры = НастройкаКонтроля.ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Материалы ТЧ №1 со всеми настройками
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА Материалы1_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1.Номенклатура
	|		КОГДА Материалы1_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL И Материалы1_ПоГруппеНоменклатуры.ПопозиционныйКонтроль
	|			ТОГДА Материалы1_ПоГруппеНоменклатуры.Номенклатура
	|		КОГДА Материалы1_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL И Материалы1_ПоВидуНоменклатуры.ПопозиционныйКонтроль
	|			ТОГДА Материалы1_ПоВидуНоменклатуры.Номенклатура
	|		ИНАЧЕ Значение(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Материалы1_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.Номенклатура.ПустаяСсылка)
	|		КОГДА Материалы1_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1_ПоГруппеНоменклатуры.ГруппаНоменклатуры
	|		КОГДА Материалы1_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.Номенклатура.ПустаяСсылка)
	|		ИНАЧЕ Значение(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК ГруппаНоменклатуры,
	|	ВЫБОР
	|		КОГДА Материалы1_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|		КОГДА Материалы1_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|		КОГДА Материалы1_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1_ПоВидуНоменклатуры.ВидНоменклатуры
	|		ИНАЧЕ Значение(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ВидНоменклатуры,
	|	ВЫБОР
	|		КОГДА Материалы1_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1_ПоНоменклатуре.ПопозиционныйКонтроль
	|		КОГДА Материалы1_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1_ПоГруппеНоменклатуры.ПопозиционныйКонтроль
	|		КОГДА Материалы1_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1_ПоВидуНоменклатуры.ПопозиционныйКонтроль
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПопозиционныйКонтроль,
	|	ВЫБОР
	|		КОГДА Материалы1_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1_ПоНоменклатуре.КонтролироватьКоличество
	|		КОГДА Материалы1_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1_ПоГруппеНоменклатуры.КонтролироватьКоличество
	|		КОГДА Материалы1_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1_ПоВидуНоменклатуры.КонтролироватьКоличество
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтролироватьКоличество,
	|	ВЫБОР
	|		КОГДА Материалы1_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1_ПоНоменклатуре.КонтролироватьВыработку
	|		КОГДА Материалы1_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1_ПоГруппеНоменклатуры.КонтролироватьВыработку
	|		КОГДА Материалы1_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы1_ПоВидуНоменклатуры.КонтролироватьВыработку
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтролироватьВыработку,
	|	ЕСТЬNULL(Материалы1.КоличествоКВыработке, 0) КАК КоличествоКВыработке,
	|	ЕСТЬNULL(Материалы1.Количество, 0) КАК Количество
	|ПОМЕСТИТЬ ВТ_Материалы1СНастройками
	|ИЗ
	|	ВТ_Материалы1_Исходная КАК Материалы1	
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Материалы1_ПоНоменклатуре КАК Материалы1_ПоНоменклатуре
	|		ПО Материалы1.Номенклатура = Материалы1_ПоНоменклатуре.Номенклатура
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Материалы1_ПоГруппеНоменклатуры КАК Материалы1_ПоГруппеНоменклатуры
	|		ПО Материалы1.Номенклатура = Материалы1_ПоГруппеНоменклатуры.Номенклатура
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Материалы1_ПоВидуНоменклатуры КАК Материалы1_ПоВидуНоменклатуры
	|		ПО Материалы1.Номенклатура = Материалы1_ПоВидуНоменклатуры.Номенклатура
	|
	|ГДЕ
	|	(Материалы1_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|		ИЛИ Материалы1_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|		ИЛИ Материалы1_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Материалы ТЧ №1 свернутая с настройками
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Материалы1СНастройками.Номенклатура КАК Номенклатура,
	|	Материалы1СНастройками.ГруппаНоменклатуры КАК ГруппаНоменклатуры,
	|	Материалы1СНастройками.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Материалы1СНастройками.ПопозиционныйКонтроль КАК ПопозиционныйКонтроль,
	|	Материалы1СНастройками.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	Материалы1СНастройками.КонтролироватьВыработку КАК КонтролироватьВыработку,
	|	СУММА(Материалы1СНастройками.КоличествоКВыработке) КАК КоличествоКВыработке,
	|	СУММА(Материалы1СНастройками.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Материалы1Итоговая
	|ИЗ
	|	ВТ_Материалы1СНастройками КАК Материалы1СНастройками
	|
	|СГРУППИРОВАТЬ ПО
	|	Материалы1СНастройками.Номенклатура,
	|	Материалы1СНастройками.ГруппаНоменклатуры,
	|	Материалы1СНастройками.ВидНоменклатуры,
	|	Материалы1СНастройками.ПопозиционныйКонтроль,
	|	Материалы1СНастройками.КонтролироватьКоличество,
	|	Материалы1СНастройками.КонтролироватьВыработку
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Исходная "Материалы ТЧ №2"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Материалы2.Номенклатура КАК Номенклатура,
	|	Материалы2.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ЕСТЬNULL(Материалы2.КоличествоКВыработке, 0) КАК КоличествоКВыработке,
	|	ЕСТЬNULL(Материалы2.Количество, 0) * ЕСТЬNULL(Материалы2.Коэффициент, 0) КАК Количество
	|ПОМЕСТИТЬ ВТ_Материалы2_Исходная
	|ИЗ
	|	&Материалы2 КАК Материалы2
	|;
	|////////////////////////////////////////////////////////////////////////////////
	// Материалы ТЧ №2 с настройкой "Номенклатура" (только элементы)
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Материалы2.Номенклатура КАК Номенклатура,
	|	НастройкаКонтроля.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	НастройкаКонтроля.КонтролироватьВыработку КАК КонтролироватьВыработку,
	|	НастройкаКонтроля.ПопозиционныйКонтроль КАК ПопозиционныйКонтроль
	|ПОМЕСТИТЬ ВТ_Материалы2_ПоНоменклатуре
	|ИЗ
	|	ВТ_Материалы2_Исходная КАК Материалы2
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкаКонтроляПоНоменклатуре КАК НастройкаКонтроля
	|		ПО Материалы2.Номенклатура = НастройкаКонтроля.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Материалы ТЧ №2 с настройкой "Номенклатура" (только группы)
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Материалы2.ГруппаНоменклатуры КАК ГруппаНоменклатуры,
	|	Материалы2.Номенклатура КАК Номенклатура,
	|	Материалы2.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	Материалы2.КонтролироватьВыработку КАК КонтролироватьВыработку,
	|	Материалы2.ПопозиционныйКонтроль КАК ПопозиционныйКонтроль
	|ПОМЕСТИТЬ ВТ_Материалы2_ПоГруппеНоменклатуры
	|ИЗ
	|	&Материалы2 КАК Материалы2
	|ГДЕ
	|	НЕ Материалы2.ГруппаНоменклатуры = Значение(Справочник.Номенклатура.ПустаяСсылка)
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	// Материалы ТЧ №2 с настройкой "Вид номенклатуры"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Материалы2.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Материалы2.Номенклатура КАК Номенклатура,
	|	НастройкаКонтроля.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	НастройкаКонтроля.КонтролироватьВыработку КАК КонтролироватьВыработку,
	|	НастройкаКонтроля.ПопозиционныйКонтроль КАК ПопозиционныйКонтроль
	|ПОМЕСТИТЬ ВТ_Материалы2_ПоВидуНоменклатуры
	|ИЗ
	|	ВТ_Материалы2_Исходная КАК Материалы2
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкаКонтроляПоВидуНоменклатуры КАК НастройкаКонтроля
	|		ПО Материалы2.ВидНоменклатуры = НастройкаКонтроля.ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Материалы ТЧ №2 со всеми настройками
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА Материалы2_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2.Номенклатура
	|		КОГДА Материалы2_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL И Материалы2_ПоГруппеНоменклатуры.ПопозиционныйКонтроль
	|			ТОГДА Материалы2_ПоГруппеНоменклатуры.Номенклатура
	|		КОГДА Материалы2_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL И Материалы2_ПоВидуНоменклатуры.ПопозиционныйКонтроль
	|			ТОГДА Материалы2_ПоВидуНоменклатуры.Номенклатура
	|		ИНАЧЕ Значение(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Материалы2_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.Номенклатура.ПустаяСсылка)
	|		КОГДА Материалы2_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2_ПоГруппеНоменклатуры.ГруппаНоменклатуры
	|		КОГДА Материалы2_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.Номенклатура.ПустаяСсылка)
	|		ИНАЧЕ Значение(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК ГруппаНоменклатуры,
	|	ВЫБОР
	|		КОГДА Материалы2_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|		КОГДА Материалы2_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|		КОГДА Материалы2_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2_ПоВидуНоменклатуры.ВидНоменклатуры
	|		ИНАЧЕ Значение(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ВидНоменклатуры,
	|	ВЫБОР
	|		КОГДА Материалы2_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2_ПоНоменклатуре.ПопозиционныйКонтроль
	|		КОГДА Материалы2_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2_ПоГруппеНоменклатуры.ПопозиционныйКонтроль
	|		КОГДА Материалы2_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2_ПоВидуНоменклатуры.ПопозиционныйКонтроль
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПопозиционныйКонтроль,
	|	ВЫБОР
	|		КОГДА Материалы2_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2_ПоНоменклатуре.КонтролироватьКоличество
	|		КОГДА Материалы2_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2_ПоГруппеНоменклатуры.КонтролироватьКоличество
	|		КОГДА Материалы2_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2_ПоВидуНоменклатуры.КонтролироватьКоличество
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтролироватьКоличество,
	|	ВЫБОР
	|		КОГДА Материалы2_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2_ПоНоменклатуре.КонтролироватьВыработку
	|		КОГДА Материалы2_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2_ПоГруппеНоменклатуры.КонтролироватьВыработку
	|		КОГДА Материалы2_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Материалы2_ПоВидуНоменклатуры.КонтролироватьВыработку
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтролироватьВыработку,
	|	ЕСТЬNULL(Материалы2.КоличествоКВыработке, 0) КАК КоличествоКВыработке,
	|	ЕСТЬNULL(Материалы2.Количество, 0) КАК Количество
	|ПОМЕСТИТЬ ВТ_Материалы2СНастройками
	|ИЗ
	|	ВТ_Материалы2_Исходная КАК Материалы2	
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Материалы2_ПоНоменклатуре КАК Материалы2_ПоНоменклатуре
	|		ПО Материалы2.Номенклатура = Материалы2_ПоНоменклатуре.Номенклатура
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Материалы2_ПоГруппеНоменклатуры КАК Материалы2_ПоГруппеНоменклатуры
	|		ПО Материалы2.Номенклатура = Материалы2_ПоГруппеНоменклатуры.Номенклатура
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Материалы2_ПоВидуНоменклатуры КАК Материалы2_ПоВидуНоменклатуры
	|		ПО Материалы2.Номенклатура = Материалы2_ПоВидуНоменклатуры.Номенклатура
	|
	|ГДЕ
	|	(Материалы2_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|		ИЛИ Материалы2_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|		ИЛИ Материалы2_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Материалы ТЧ №2 свернутая с настройками
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Материалы2СНастройками.Номенклатура КАК Номенклатура,
	|	Материалы2СНастройками.ГруппаНоменклатуры КАК ГруппаНоменклатуры,
	|	Материалы2СНастройками.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Материалы2СНастройками.ПопозиционныйКонтроль КАК ПопозиционныйКонтроль,
	|	Материалы2СНастройками.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	Материалы2СНастройками.КонтролироватьВыработку КАК КонтролироватьВыработку,
	|	СУММА(Материалы2СНастройками.КоличествоКВыработке) КАК КоличествоКВыработке,
	|	СУММА(Материалы2СНастройками.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Материалы2Итоговая
	|ИЗ
	|	ВТ_Материалы2СНастройками КАК Материалы2СНастройками
	|
	|СГРУППИРОВАТЬ ПО
	|	Материалы2СНастройками.Номенклатура,
	|	Материалы2СНастройками.ГруппаНоменклатуры,
	|	Материалы2СНастройками.ВидНоменклатуры,
	|	Материалы2СНастройками.ПопозиционныйКонтроль,
	|	Материалы2СНастройками.КонтролироватьКоличество,
	|	Материалы2СНастройками.КонтролироватьВыработку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Итоговый запрос соединение двух ТЧ Материалы №1 и №2
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(Материалы1.Номенклатура, Материалы2.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(Материалы1.ГруппаНоменклатуры, Материалы2.ГруппаНоменклатуры) КАК ГруппаНоменклатуры,
	|	ЕСТЬNULL(Материалы1.ВидНоменклатуры, Материалы2.ВидНоменклатуры) КАК ВидНоменклатуры,
	|	ЕСТЬNULL(Материалы1.ПопозиционныйКонтроль, Материалы2.ПопозиционныйКонтроль) КАК ПопозиционныйКонтроль,
	|	ЕСТЬNULL(Материалы1.КонтролироватьКоличество, Материалы2.КонтролироватьКоличество) КАК КонтролироватьКоличество,
	|	ЕСТЬNULL(Материалы1.КонтролироватьВыработку, Материалы2.КонтролироватьВыработку) КАК КонтролироватьВыработку,
	|	ЕСТЬNULL(Материалы1.КоличествоКВыработке, 0) КАК КоличествоКВыработке1,
	|	ЕСТЬNULL(Материалы2.КоличествоКВыработке, 0) КАК КоличествоКВыработке2,
	|	ЕСТЬNULL(Материалы1.Количество, 0) КАК Количество1,
	|	ЕСТЬNULL(Материалы2.Количество, 0) КАК Количество2
	|ИЗ
	|	ВТ_Материалы1Итоговая КАК Материалы1
	|
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Материалы2Итоговая КАК Материалы2
	|		ПО Материалы1.Номенклатура = Материалы2.Номенклатура
	|			И Материалы1.ГруппаНоменклатуры = Материалы2.ГруппаНоменклатуры
	|			И Материалы1.ВидНоменклатуры = Материалы2.ВидНоменклатуры
	|
	|ГДЕ
	|	(
	|	(ЕСТЬNULL(Материалы1.КонтролироватьКоличество, Материалы2.КонтролироватьКоличество) И ЕСТЬNULL(Материалы1.Количество, 0) <> ЕСТЬNULL(Материалы2.Количество, 0))
	|	ИЛИ
	|	(ЕСТЬNULL(Материалы1.КонтролироватьВыработку, Материалы2.КонтролироватьВыработку) И ЕСТЬNULL(Материалы1.КоличествоКВыработке, 0) <> ЕСТЬNULL(Материалы2.КоличествоКВыработке, 0))
	|	)
	|";
	Запрос.УстановитьПараметр("ДокументКонтроля", ДокументКонтроля);
	Запрос.УстановитьПараметр("Материалы1", Материалы1);
	Запрос.УстановитьПараметр("Материалы2", Материалы2);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НазваниеДокумента1 = "выпуске";
	НазваниеДокумента2 = "заказе на производство";
	
	Если ВидДокументаКонтроля = Перечисления.ВидыДокументовКонтроляМатериаловВПроизводстве.ЗаказНаПроизводство Тогда
		
		НазваниеДокумента1 = "заказе на производство";
		НазваниеДокумента2 = "заказе покупателя";
		
	КонецЕсли;
	
	Если Выборка.Количество() > 0 Тогда
		Сообщить("При выполнении контроля материалов в производстве выявлены различия:" + Символы.ПС);
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Отказ = Истина;
		
		ОписаниеВидНоменклатуры = ?(ЗначениеЗаполнено(Выборка.ВидНоменклатуры), "по виду номенклатуры """
		+ ?(Выборка.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно, ОбщийМодульСервер.ПолучитьПредствлениеВидаНоменклатурыПолотноДляКонтроляМатериалов(), Выборка.ВидНоменклатуры)
		+ """", ""
		);
		ОписаниеГруппаНоменклатуры = ?(ЗначениеЗаполнено(Выборка.ГруппаНоменклатуры), "по группе номенклатуры """ + Выборка.ГруппаНоменклатуры + """", "");
		ОписаниеНоменклатура = ?(ЗначениеЗаполнено(Выборка.Номенклатура), "по номенклатуре """ + Выборка.Номенклатура + """", "");
		
		// Различия по количеству к выработке
		ОписаниеКоличествоКВыработке = "";
		Если Выборка.КонтролироватьВыработку И НЕ Выборка.КоличествоКВыработке1 = Выборка.КоличествоКВыработке2 Тогда
			
			ОписаниеКоличествоКВыработке = СтрШаблон("- в %1 указано количество к выработке %2, в %3 указано количество к выработке %4",
			НазваниеДокумента1,
			Выборка.КоличествоКВыработке1,
			НазваниеДокумента2,
			Выборка.КоличествоКВыработке2);
			
		КонецЕсли;
		
		// Различия по количество * коэффициент
		ОписаниеКоличество = "";
		Если Выборка.КонтролироватьКоличество И НЕ Выборка.Количество1 = Выборка.Количество2 Тогда
			
			ОписаниеКоличество = СтрШаблон("- в %1 указано количество %2, в %3 указано количество %4",
			НазваниеДокумента1,
			Выборка.Количество1,
			НазваниеДокумента2,
			Выборка.Количество2);
			
		КонецЕсли;
		
		ТекстОшибкиСтрока = СтрШаблон("%1%2%3%4%5%6%7%8",
		ОписаниеВидНоменклатуры,
		ОписаниеГруппаНоменклатуры,
		?((ЗначениеЗаполнено(ОписаниеВидНоменклатуры) Или ЗначениеЗаполнено(ОписаниеГруппаНоменклатуры)) И ЗначениеЗаполнено(ОписаниеНоменклатура), ", ", ""),
		ОписаниеНоменклатура,
		":" + Символы.ПС,
		ОписаниеКоличествоКВыработке,
		?(ЗначениеЗаполнено(ОписаниеКоличествоКВыработке), Символы.ПС, ""),
		ОписаниеКоличество
		);
		
		Сообщить(ТекстОшибкиСтрока);
		
	КонецЦикла;
	//-- №14311
	
КонецПроцедуры

Процедура ПривестиВидыНоменклатурыКСоответствиюПроверкиМатериалов(ТаблицаМатериалы) Экспорт
	
	Для Каждого ТекущаяСтрока Из ТаблицаМатериалы Цикл
		
		ВидНоменклатуры = ТекущаяСтрока.Номенклатура.ВидНоменклатуры;
		
		// Полотно, потолок, отрез и остаток пленки сводим к одному виду
		Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно
			Или ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок
			Или ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез
			Или ВидНоменклатуры = Справочники.ВидыНоменклатуры.ОстатокПленки
			Тогда
			ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно;
		КонецЕсли;
		
		ТекущаяСтрока.ВидНоменклатуры = ВидНоменклатуры;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПредствлениеВидаНоменклатурыПолотноДляКонтроляМатериалов() Экспорт
	
	Возврат "Полотно, потолок, отрез и остаток плёнки";
	
КонецФункции
//-- №14311

#КонецОбласти

#Область РасчетКоличестваЛидов

// #16089

Функция ПараметрыЗаданияРасчетаКоличестваСтатусаЛидов(ЭтоНовый, 
													  ПредыдущийАвтор, ТекущийАвтор,
													  ПредыдущийСтатус, ТекущийСтатус,
													  ПредыдущаяДатаСледующегоКонтакта, ДатаСледующегоКонтакта
													  ) Экспорт
													  
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ЭтоНовый", ЭтоНовый);
	ПараметрыЗадания.Вставить("ПредыдущийАвтор", ПредыдущийАвтор);
	ПараметрыЗадания.Вставить("ТекущийАвтор", ТекущийАвтор);
	ПараметрыЗадания.Вставить("ПредыдущийСтатус", ПредыдущийСтатус);
	ПараметрыЗадания.Вставить("ТекущийСтатус", ТекущийСтатус);
	ПараметрыЗадания.Вставить("ПредыдущаяДатаСледующегоКонтакта", ПредыдущаяДатаСледующегоКонтакта);
	ПараметрыЗадания.Вставить("ДатаСледующегоКонтакта", ДатаСледующегоКонтакта);

	Возврат ПараметрыЗадания;
	
КонецФункции													 
																		 
Процедура РасчетКоличестваЛидовРегламентноеЗадание() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.РасчетКоличестваЛидов);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", Метаданные.РегламентныеЗадания.РасчетКоличестваЛидов.Ключ);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	ТекущиеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	Если ТекущиеФоновыеЗадания.Количество() < 2 Тогда // РЗ имеет такой же ключ как и ФЗ, поэтому тоже учитывается.
		
		ФоновыеЗадания.Выполнить(
			"ОбщийМодульСервер.РасчетКоличестваЛидовВФоне",
			Новый Массив(),
			Метаданные.РегламентныеЗадания.РасчетКоличестваЛидов.Ключ,
			НСтр("ru = 'Выполняется расчет количества лидов'"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗапуститьФоновоеЗаданиеРасчетаКоличестваЛидов(ПараметрыЗадания) Экспорт

	//Если БлокироватьРасчетКоличестваЛидов() Тогда
	//	Возврат;
	//КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", Метаданные.РегламентныеЗадания.РасчетКоличестваЛидов.Ключ);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	ТекущиеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	Если ТекущиеФоновыеЗадания.Количество() = 0 Тогда
		
		Попытка
			
			ПараметрыЗаданияМассив = Новый Массив;
			ПараметрыЗаданияМассив.Добавить(ПараметрыЗадания);
			 
			ФоновыеЗадания.Выполнить(
				"ОбщийМодульСервер.РасчетКоличестваЛидовВФоне",
				ПараметрыЗаданияМассив,
				Метаданные.РегламентныеЗадания.РасчетКоличестваЛидов.Ключ,
				НСтр("ru = 'Выполняется расчет количества лидов'"));
		Исключение
			// Если задание уже запущено.
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// для кнопок в РМ менеджера розницы
Процедура РасчетКоличестваЛидовВФоне(ПараметрыЗадания) Экспорт
	
	Если ТипЗнч(ПараметрыЗадания) = Тип("Структура") Тогда
		Если ПараметрыЗадания.ЭтоНовый Тогда
			РасчетКоличестваЛидовПоАвтору(Справочники.Пользователи.ПустаяСсылка());
			РасчетКоличестваЛидовПоАвтору(ПараметрыЗадания.ТекущийАвтор);
			
		ИначеЕсли НЕ ПараметрыЗадания.ПредыдущийАвтор = ПараметрыЗадания.ТекущийАвтор Тогда
			РасчетКоличестваЛидовПоАвтору(Справочники.Пользователи.ПустаяСсылка());
			РасчетКоличестваЛидовПоАвтору(ПараметрыЗадания.ПредыдущийАвтор);
			РасчетКоличестваЛидовПоАвтору(ПараметрыЗадания.ТекущийАвтор);
			
		Иначе
			РасчетКоличестваЛидовПоАвтору(Справочники.Пользователи.ПустаяСсылка());
			РасчетКоличестваЛидовПоАвтору(ПараметрыЗадания.ТекущийАвтор);
			
		КонецЕсли;
	Иначе
		// общие показатели
		РасчетКоличестваЛидовПоАвтору(Справочники.Пользователи.ПустаяСсылка());
		ВыборкаПользователей = Справочники.Пользователи.Выбрать();
		Пока ВыборкаПользователей.Следующий() Цикл
			Если ВыборкаПользователей.ПометкаУдаления 
				ИЛИ ВыборкаПользователей.Недействителен	Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВыборкаПользователей.ОтображатьТолькоСвоиЛидыВСписке 
				ИЛИ ВыборкаПользователей.ОграничитьВидимостьЛидовПоТочкамПродаж				
				ИЛИ ВыборкаПользователей.ОграничиватьДоступПоОрганизациям
				ИЛИ ВыборкаПользователей.ОграничениеДоступаКЛидамДляЗамерщика
				ИЛИ ВыборкаПользователей.ОграничитьДоступКЛидамПоСтатусуЛида													  
				Тогда
				РасчетКоличестваЛидовПоАвтору(ВыборкаПользователей.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетКоличестваЛидовПоАвтору(Автор)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; //дл отладки
	Запрос.УстановитьПараметр("Сегодня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Завтра", НачалоДня(ТекущаяДатаСеанса()+60*60*24));
	Запрос.УстановитьПараметр("ФильтрПоАвтору", ЗначениеЗаполнено(Автор));
	Запрос.УстановитьПараметр("Автор", Автор);
	Если ЗначениеЗаполнено(Автор) Тогда
		// надо учесть все ограничения из RLS
		РеквизитыПользователя = НастройкиПользователя("ОтображатьТолькоСвоиЛидыВСписке, ОграничитьВидимостьЛидовПоТочкамПродаж, ОграничиватьДоступПоОрганизациям,
													  |ОграничениеДоступаКЛидамДляЗамерщика, ОграничитьДоступКЛидамПоСтатусуЛида, Сотрудник", 
													  Автор);
		
		Запрос.УстановитьПараметр("ОграничиватьПоАвтору", 		РеквизитыПользователя.ОтображатьТолькоСвоиЛидыВСписке);
		Запрос.УстановитьПараметр("ОграничиватьПоОрганизации", 	РеквизитыПользователя.ОграничиватьДоступПоОрганизациям);
		Запрос.УстановитьПараметр("ОграничиватьПоТП", 			РеквизитыПользователя.ОграничитьВидимостьЛидовПоТочкамПродаж);
		Запрос.УстановитьПараметр("ОграничиватьПоСтатусу", 		РеквизитыПользователя.ОграничитьДоступКЛидамПоСтатусуЛида);
		Запрос.УстановитьПараметр("ОграничиватьДляЗамерщика", 	РеквизитыПользователя.ОграничениеДоступаКЛидамДляЗамерщика);
		Запрос.УстановитьПараметр("Сотрудник", 					РеквизитыПользователя.Сотрудник);
		
	Иначе
		Запрос.УстановитьПараметр("ОграничиватьПоАвтору", 		Ложь);
		Запрос.УстановитьПараметр("ОграничиватьПоОрганизации", 	Ложь);
		Запрос.УстановитьПараметр("ОграничиватьПоТП", 			Ложь);
		Запрос.УстановитьПараметр("ОграничиватьПоСтатусу", 		Ложь);
		Запрос.УстановитьПараметр("ОграничиватьДляЗамерщика", 	Ложь);
		Запрос.УстановитьПараметр("Сотрудник", 					Неопределено);
	КонецЕсли;

	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛидыВыездыЗамеры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ЗамерыВыезды
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЛидВыезды.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.Лид.Выезды КАК ЛидВыезды
	|	ГДЕ
	|		ЛидВыезды.Ссылка.Проведен
	|		И НАЧАЛОПЕРИОДА(ЛидВыезды.Дата, ДЕНЬ) = &Сегодня
	|		И ЛидВыезды.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыВыездаЛида.пустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛидЗамеры.Ссылка
	|	ИЗ
	|		Документ.Лид.Замеры КАК ЛидЗамеры
	|	ГДЕ
	|		ЛидЗамеры.Ссылка.Проведен
	|		И НАЧАЛОПЕРИОДА(ЛидЗамеры.ДатаЗамера, ДЕНЬ) = &Сегодня
	|		И ЛидЗамеры.РезультатЗамера = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.пустаяСсылка)) КАК ЛидыВыездыЗамеры
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛидыВыездыЗамеры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лид.ТекущийСтатус КАК ТекущийСтатус,
	|	Лид.Автор КАК Автор,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НазначитьЗамер)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыНовыеВсего,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НазначитьЗамер)
	|				И Лид.ПоследняяДатаПерезвонить < &Завтра
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыНовыеВРаботе,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыЗаявкаНаЗамерВсего,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера)
	|				И НЕ ВТ_ЗамерыВыезды.Ссылка ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыЗаявкаНаЗамерВРаботе,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыОтложенныеЗамерыВсего,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер)
	|				И Лид.ПоследняяДатаПерезвонить < &Завтра
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыОтложенныеЗамерыВРаботе,
	//++ #16875
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.РасчетДоЗамера)
	|				И Лид.ПоследняяДатаПерезвонить < &Завтра
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыРасчетДоЗамераВРаботе,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.РасчетДоЗамера)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыРасчетДоЗамераВсего,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОбработкаПослеЗамера)
	|				И Лид.ПоследняяДатаПерезвонить < &Завтра
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыОбработкаПослеЗамераВРаботе,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОбработкаПослеЗамера)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыОбработкаПослеЗамераВсего,
	//-- #16875	
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыОтложенныеДоговорыВсего,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор)
	|				И Лид.ПоследняяДатаПерезвонить < &Завтра
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыОтложенныеДоговорыВРаботе,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОформитьДоговор)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыОформитьДоговорВсего,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ДоговорОформлен)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыДоговорОформленВсего,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.Обращение)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыОбращениеВсего,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.Обращение)
	|				И Лид.ПоследняяДатаПерезвонить < &Завтра
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыОбращениеВРаботе,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.Отказ)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыОтказныеВсего,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НеЦелевой)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛидыНецелевыеВсего,
	|	1 КАК ЛидыВсеВсего
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Лид КАК Лид
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗамерыВыезды КАК ВТ_ЗамерыВыезды
	|		ПО (ВТ_ЗамерыВыезды.Ссылка = Лид.Ссылка)
	|ГДЕ
	|	Лид.Проведен
	|	И ВЫБОР
	|			КОГДА &ФильтрПоАвтору
	|				ТОГДА Лид.Автор = &Автор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	
	|	И ВЫБОР
	|			КОГДА &ОграничиватьПоАвтору
	|				ТОГДА Лид.Автор = &Автор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	
	|	И ВЫБОР
	|			КОГДА &ОграничиватьПоОрганизации
	|           	ТОГДА Лид.Организация В
	|	    			(ВЫБРАТЬ    
	|	        			ДоступныеОрганизации.Организация 
	|	    			ИЗ  
	|	        			Справочник.Пользователи.ДоступныеОрганизации КАК ДоступныеОрганизации 
	|	    			ГДЕ 
	|						ДоступныеОрганизации.Ссылка = &Автор)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	
	|	И ВЫБОР
	|			КОГДА &ОграничиватьПоТП
	|           	ТОГДА Лид.ТочкаПродаж В
	|	    			(ВЫБРАТЬ    
	|	        			ДоступныеТочкиПродаж.ТочкаПродаж 
	|	    			ИЗ  
	|	        			Справочник.Пользователи.ДоступныеТочкиПродаж КАК ДоступныеТочкиПродаж 
	|	    			ГДЕ 
	|						ДоступныеТочкиПродаж.Ссылка = &Автор)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	
	|	И ВЫБОР
	|			КОГДА &ОграничиватьПоСтатусу
	|           	ТОГДА Лид.ТекущийСтатус В
	|	    			(ВЫБРАТЬ    
	|	        			ДоступныеСтатусыЛида.Статус 
	|	    			ИЗ  
	|	        			Справочник.Пользователи.ДоступныеСтатусыЛида КАК ДоступныеСтатусыЛида 
	|	    			ГДЕ 
	|						ДоступныеСтатусыЛида.Ссылка = &Автор)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	
	|	И ВЫБОР
	|			КОГДА &ОграничиватьДляЗамерщика
	|           	ТОГДА Лид.Замеры.ИсполнительЗамера = &Сотрудник
	|           		ИЛИ Лид.Выезды.Исполнитель = &Сотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ		
	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВТ.ЛидыНовыеВРаботе) КАК ЛидыНовыеВРаботе,
	|	СУММА(ВТ.ЛидыНовыеВсего) КАК ЛидыНовыеВсего,
	|	СУММА(ВТ.ЛидыЗаявкаНаЗамерВРаботе) КАК ЛидыЗаявкаНаЗамерВРаботе,
	|	СУММА(ВТ.ЛидыЗаявкаНаЗамерВсего) КАК ЛидыЗаявкаНаЗамерВсего,
	|	СУММА(ВТ.ЛидыОтложенныеЗамерыВсего) КАК ЛидыОтложенныеЗамерыВсего,
	|	СУММА(ВТ.ЛидыОтложенныеЗамерыВРаботе) КАК ЛидыОтложенныеЗамерыВРаботе,
	//++ #16875 
	|	СУММА(ВТ.ЛидыРасчетДоЗамераВРаботе) КАК ЛидыРасчетДоЗамераВРаботе,
	|	СУММА(ВТ.ЛидыРасчетДоЗамераВсего) КАК ЛидыРасчетДоЗамераВсего,
	|	СУММА(ВТ.ЛидыОбработкаПослеЗамераВРаботе) КАК ЛидыОбработкаПослеЗамераВРаботе,
	|	СУММА(ВТ.ЛидыОбработкаПослеЗамераВсего) КАК ЛидыОбработкаПослеЗамераВсего,
	//-- #16875 
	|	СУММА(ВТ.ЛидыОтложенныеДоговорыВсего) КАК ЛидыОтложенныеДоговорыВсего,
	|	СУММА(ВТ.ЛидыОтложенныеДоговорыВРаботе) КАК ЛидыОтложенныеДоговорыВРаботе,
	|	СУММА(ВТ.ЛидыОформитьДоговорВсего) КАК ЛидыОформитьДоговорВсего,
	|	СУММА(ВТ.ЛидыДоговорОформленВсего) КАК ЛидыДоговорОформленВсего,
	|	СУММА(ВТ.ЛидыОбращениеВРаботе) КАК ЛидыОбращениеВРаботе,
	|	СУММА(ВТ.ЛидыОбращениеВсего) КАК ЛидыОбращениеВсего,
	|	СУММА(ВТ.ЛидыОтказныеВсего) КАК ЛидыОтказныеВсего,
	|	СУММА(ВТ.ЛидыНецелевыеВсего) КАК ЛидыНецелевыеВсего,
	|	СУММА(ВТ.ЛидыВсеВсего) КАК ЛидыВсеВсего
	|ИЗ
	|	ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Автор КАК Автор,
	|	СУММА(ВТ.ЛидыНовыеВРаботе) КАК ЛидыНовыеВРаботе,
	|	СУММА(ВТ.ЛидыНовыеВсего) КАК ЛидыНовыеВсего,
	|	СУММА(ВТ.ЛидыЗаявкаНаЗамерВРаботе) КАК ЛидыЗаявкаНаЗамерВРаботе,
	|	СУММА(ВТ.ЛидыЗаявкаНаЗамерВсего) КАК ЛидыЗаявкаНаЗамерВсего,
	|	СУММА(ВТ.ЛидыОтложенныеЗамерыВсего) КАК ЛидыОтложенныеЗамерыВсего,
	|	СУММА(ВТ.ЛидыОтложенныеЗамерыВРаботе) КАК ЛидыОтложенныеЗамерыВРаботе,
	//++ #16875 
	|	СУММА(ВТ.ЛидыРасчетДоЗамераВРаботе) КАК ЛидыРасчетДоЗамераВРаботе,
	|	СУММА(ВТ.ЛидыРасчетДоЗамераВсего) КАК ЛидыРасчетДоЗамераВсего,
	|	СУММА(ВТ.ЛидыОбработкаПослеЗамераВРаботе) КАК ЛидыОбработкаПослеЗамераВРаботе,
	|	СУММА(ВТ.ЛидыОбработкаПослеЗамераВсего) КАК ЛидыОбработкаПослеЗамераВсего,
	//-- #16875
	|	СУММА(ВТ.ЛидыОтложенныеДоговорыВсего) КАК ЛидыОтложенныеДоговорыВсего,
	|	СУММА(ВТ.ЛидыОтложенныеДоговорыВРаботе) КАК ЛидыОтложенныеДоговорыВРаботе,
	|	СУММА(ВТ.ЛидыОформитьДоговорВсего) КАК ЛидыОформитьДоговорВсего,
	|	СУММА(ВТ.ЛидыДоговорОформленВсего) КАК ЛидыДоговорОформленВсего,
	|	СУММА(ВТ.ЛидыОбращениеВРаботе) КАК ЛидыОбращениеВРаботе,
	|	СУММА(ВТ.ЛидыОбращениеВсего) КАК ЛидыОбращениеВсего,
	|	СУММА(ВТ.ЛидыОтказныеВсего) КАК ЛидыОтказныеВсего,
	|	СУММА(ВТ.ЛидыНецелевыеВсего) КАК ЛидыНецелевыеВсего,
	|	СУММА(ВТ.ЛидыВсеВсего) КАК ЛидыВсеВсего
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Автор";
	
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		// общие показатели (без отбора по автору)
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ВыборкаВсего = РезультатЗапроса[2].Выбрать();
	Иначе
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ВыборкаВсего = РезультатЗапроса[3].Выбрать();
	КонецЕсли;
	
	//ФлагАктуальности = "";
	ТребуетсяЗапись = Ложь;
	МенеджерЗаписи = РегистрыСведений.КоличествоЛидов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Автор = Автор;
	МенеджерЗаписи.Прочитать();
	//Если МенеджерЗаписи.Выбран() Тогда
	//	ФлагАктуальности = МенеджерЗаписи.ФлагАктуальности;		
	//КонецЕсли;
	
	Если ВыборкаВсего.Следующий() Тогда
		Если НЕ МенеджерЗаписи.ЛидыНовыеВсего = ВыборкаВсего.ЛидыНовыеВсего
			ИЛИ НЕ МенеджерЗаписи.ЛидыНовыеВРаботе = ВыборкаВсего.ЛидыНовыеВРаботе
			
			ИЛИ НЕ МенеджерЗаписи.ЛидыЗаявкаНаЗамерВсего = ВыборкаВсего.ЛидыЗаявкаНаЗамерВсего
			ИЛИ НЕ МенеджерЗаписи.ЛидыЗаявкаНаЗамерВРаботе = ВыборкаВсего.ЛидыЗаявкаНаЗамерВРаботе
			
			ИЛИ НЕ МенеджерЗаписи.ЛидыОтложенныеЗамерыВсего = ВыборкаВсего.ЛидыОтложенныеЗамерыВсего
			ИЛИ НЕ МенеджерЗаписи.ЛидыОтложенныеЗамерыВРаботе = ВыборкаВсего.ЛидыОтложенныеЗамерыВРаботе
			
			ИЛИ НЕ МенеджерЗаписи.ЛидыРасчетДоЗамераВРаботе = ВыборкаВсего.ЛидыРасчетДоЗамераВРаботе
			ИЛИ НЕ МенеджерЗаписи.ЛидыРасчетДоЗамераВсего = ВыборкаВсего.ЛидыРасчетДоЗамераВсего
			
			ИЛИ НЕ МенеджерЗаписи.ЛидыОбработкаПослеЗамераВРаботе = ВыборкаВсего.ЛидыОбработкаПослеЗамераВРаботе
			ИЛИ НЕ МенеджерЗаписи.ЛидыОбработкаПослеЗамераВсего = ВыборкаВсего.ЛидыОбработкаПослеЗамераВсего
			
			ИЛИ НЕ МенеджерЗаписи.ЛидыОтложенныеДоговорыВсего = ВыборкаВсего.ЛидыОтложенныеДоговорыВсего
			ИЛИ НЕ МенеджерЗаписи.ЛидыОтложенныеДоговорыВРаботе = ВыборкаВсего.ЛидыОтложенныеДоговорыВРаботе
			
			ИЛИ НЕ МенеджерЗаписи.ЛидыОформитьДоговорВсего = ВыборкаВсего.ЛидыОформитьДоговорВсего
			ИЛИ НЕ МенеджерЗаписи.ЛидыДоговорОформленВсего = ВыборкаВсего.ЛидыДоговорОформленВсего

			ИЛИ НЕ МенеджерЗаписи.ЛидыОтказныеВсего = ВыборкаВсего.ЛидыОтказныеВсего
			ИЛИ НЕ МенеджерЗаписи.ЛидыНецелевыеВсего = ВыборкаВсего.ЛидыНецелевыеВсего
			
			ИЛИ НЕ МенеджерЗаписи.ЛидыОбращениеВсего = ВыборкаВсего.ЛидыОбращениеВсего
			ИЛИ НЕ МенеджерЗаписи.ЛидыОбращениеВРаботе = ВыборкаВсего.ЛидыОбращениеВРаботе

			ИЛИ НЕ МенеджерЗаписи.ЛидыВсеВсего = ВыборкаВсего.ЛидыВсеВсего
			Тогда
			
			МенеджерЗаписи.ЛидыНовыеВсего = ВыборкаВсего.ЛидыНовыеВсего;
			МенеджерЗаписи.ЛидыНовыеВРаботе = ВыборкаВсего.ЛидыНовыеВРаботе;
			
			МенеджерЗаписи.ЛидыЗаявкаНаЗамерВсего = ВыборкаВсего.ЛидыЗаявкаНаЗамерВсего;
			МенеджерЗаписи.ЛидыЗаявкаНаЗамерВРаботе = ВыборкаВсего.ЛидыЗаявкаНаЗамерВРаботе;

			МенеджерЗаписи.ЛидыОтложенныеЗамерыВсего = ВыборкаВсего.ЛидыОтложенныеЗамерыВсего;
			МенеджерЗаписи.ЛидыОтложенныеЗамерыВРаботе = ВыборкаВсего.ЛидыОтложенныеЗамерыВРаботе;
			
			МенеджерЗаписи.ЛидыРасчетДоЗамераВРаботе = ВыборкаВсего.ЛидыРасчетДоЗамераВРаботе;
			МенеджерЗаписи.ЛидыРасчетДоЗамераВсего = ВыборкаВсего.ЛидыРасчетДоЗамераВсего;
			
			МенеджерЗаписи.ЛидыОбработкаПослеЗамераВРаботе = ВыборкаВсего.ЛидыОбработкаПослеЗамераВРаботе;
			МенеджерЗаписи.ЛидыОбработкаПослеЗамераВсего = ВыборкаВсего.ЛидыОбработкаПослеЗамераВсего;
			
			МенеджерЗаписи.ЛидыОтложенныеДоговорыВсего = ВыборкаВсего.ЛидыОтложенныеДоговорыВсего;
			МенеджерЗаписи.ЛидыОтложенныеДоговорыВРаботе = ВыборкаВсего.ЛидыОтложенныеДоговорыВРаботе;
			
			МенеджерЗаписи.ЛидыОформитьДоговорВсего = ВыборкаВсего.ЛидыОформитьДоговорВсего;
			МенеджерЗаписи.ЛидыДоговорОформленВсего = ВыборкаВсего.ЛидыДоговорОформленВсего;
			
			МенеджерЗаписи.ЛидыОбращениеВсего = ВыборкаВсего.ЛидыОбращениеВсего;
			МенеджерЗаписи.ЛидыОбращениеВРаботе = ВыборкаВсего.ЛидыОбращениеВРаботе;
			
			МенеджерЗаписи.ЛидыОтказныеВсего = ВыборкаВсего.ЛидыОтказныеВсего;
			МенеджерЗаписи.ЛидыНецелевыеВсего = ВыборкаВсего.ЛидыНецелевыеВсего;
			
			МенеджерЗаписи.ЛидыВсеВсего = ВыборкаВсего.ЛидыВсеВсего;
			ТребуетсяЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяЗапись Тогда
		МенеджерЗаписи.Автор = Автор;
		МенеджерЗаписи.ФлагАктуальности = Строка(Новый УникальныйИдентификатор);
		
		НачатьТранзакцию();
		Попытка
			МенеджерЗаписи.Записать();
			ЗафиксироватьТранзакцию();
			
			//СообщитьОРасчетеКоличестваЛидов(МенеджерЗаписи);
		Исключение
			ОтменитьТранзакцию();
			СообщитьОНеудачномРасчетеКоличестваЛидов();
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

Процедура СообщитьОНеудачномРасчетеКоличестваЛидов()
	
	ТекстСообщения = НСтр("ru = 'Задание расчет количества лидов завершилось неудачно по причине: %Причина%'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	СобытиеЖурнала = НСтр("ru = 'Расчет количества лидов'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(СобытиеЖурнала,
		УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.КоличествоЛидов,, ТекстСообщения);
	
КонецПроцедуры

Процедура СообщитьОРасчетеКоличестваЛидов(МенеджерЗаписи)
			
	// для отладки при необходимости
	ТекстСообщения = СтрШаблон("%1 - %2 | %3 | %4 | %5 | %6 | %7 | %8 | %9", 
																МенеджерЗаписи.Автор, МенеджерЗаписи.ЛидыВсеВсего,
																СтрШаблон("%1/%2", МенеджерЗаписи.ЛидыНовыеВсего, МенеджерЗаписи.ЛидыНовыеВРаботе),
																СтрШаблон("%1/%2", МенеджерЗаписи.ЛидыЗаявкаНаЗамерВсего, МенеджерЗаписи.ЛидыЗаявкаНаЗамерВРаботе),
																СтрШаблон("%1/%2", МенеджерЗаписи.ЛидыОтложенныеЗамерыВсего, МенеджерЗаписи.ЛидыОтложенныеЗамерыВРаботе),
																СтрШаблон("%1/%2", МенеджерЗаписи.ЛидыОтложенныеДоговорыВсего, МенеджерЗаписи.ЛидыОтложенныеДоговорыВРаботе),
																СтрШаблон("%1/%2", МенеджерЗаписи.ЛидыОформитьДоговорВсего, МенеджерЗаписи.ЛидыДоговорОформленВсего),
																СтрШаблон("%1/%2", МенеджерЗаписи.ЛидыОбращениеВсего, МенеджерЗаписи.ЛидыОбращениеВРаботе),
																СтрШаблон("%1/%2", МенеджерЗаписи.ЛидыОтказныеВсего, МенеджерЗаписи.ЛидыНецелевыеВсего)
																);
	СобытиеЖурнала = НСтр("ru = 'Расчет количества лидов'", ОбщегоНазначения.КодОсновногоЯзыка());													
	ЗаписьЖурналаРегистрации(СобытиеЖурнала,
				УровеньЖурналаРегистрации.Предупреждение, Метаданные.РегистрыСведений.КоличествоЛидов,, ТекстСообщения);

КонецПроцедуры
			
#КонецОбласти

//++ #14380 от 11.08.2022
// Процедура регламентного задания 
Процедура ОчисткаБазыПометитьВсеНаУдаление(НеУдалятьДокументыУстановкиЦен,НеУдалятьДокументыУстановкиСтоимостиВыработки, УдалитьНепосредственно) Экспорт
	
	//++ №13931 делаем через массив, т.к. несколько галочек исключений
	
	МассивНеУдаляемыхМетаданных = новый Массив;
	
	Если НеУдалятьДокументыУстановкиЦен Тогда
		МассивНеУдаляемыхМетаданных.Добавить("УстановкаЦенМатериалов");
		МассивНеУдаляемыхМетаданных.Добавить("УстановкаЦенМатериаловПоставщиков");
		МассивНеУдаляемыхМетаданных.Добавить("УстановкаЦенНоменклатуры");
		МассивНеУдаляемыхМетаданных.Добавить("УстановкаЦенПоставщика");
		МассивНеУдаляемыхМетаданных.Добавить("УстановкаИндивидуальныхЦенМатериалов");
		МассивНеУдаляемыхМетаданных.Добавить("УстановкаИндивидуальныхЦенНаУслугиПроизводства");
		МассивНеУдаляемыхМетаданных.Добавить("УстановкаИндивидуальныхЦенНоменклатуры");
	КонецЕсли;
	
	Если НеУдалятьДокументыУстановкиСтоимостиВыработки Тогда
		МассивНеУдаляемыхМетаданных.Добавить("УстановкаСтоимостиВыработкиПоНоменклатуре");
	КонецЕсли;
	//-- №13931
	
	//++ №6270
	ЧастьСообщения = "пометить на удаление";
	Если УдалитьНепосредственно Тогда
		ЧастьСообщения = "удалить непосредствено";
	КонецЕсли;
	//-- №6270
	
	// ЗАДАЧИ И БИЗНЕС-ПРОЦЕССЫ
	ТекущийПроцесс="Пометка на удаление бизнес-процессов";
	Если УдалитьНепосредственно Тогда
		ТекущийПроцесс = "Удаление бизнес-процессов";
	КонецЕсли;
	
	Счетчик=0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задание.Ссылка КАК Ссылка
	|ИЗ
	|	БизнесПроцесс.Задание КАК Задание";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда 
		ШагСчетчика=100/Выборка.Количество();
	Иначе	
		ШагСчетчика=0;
	КонецЕсли;
	
	Пока  Выборка.Следующий() Цикл
		
		Об = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка

			Если УдалитьНепосредственно Тогда
				Об.Удалить();
			Иначе
				Об.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("%1 не удалось %2: %3|%4", Об, ЧастьСообщения, ОписаниеОшибки(), Строка(Окр(Счетчик,0)));
			Сообщение.Сообщить();
		КонецПопытки;
		Счетчик = Счетчик+ШагСчетчика;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекущийПроцесс + "|" + Строка(Окр(Счетчик,0));
		Сообщение.Сообщить();
	КонецЦикла;
	
	ТекущийПроцесс="Пометка на удаление задач";
	Если УдалитьНепосредственно Тогда
		ТекущийПроцесс = "Удаление задач";
	КонецЕсли;
	
	
	Счетчик=0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задачи.Ссылка
	|ИЗ
	|	Задача.Задачи КАК Задачи";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда 
		ШагСчетчика=100/Выборка.Количество();
	Иначе	
		ШагСчетчика=0;
	КонецЕсли;
	
	Пока  Выборка.Следующий() Цикл
		
		Об = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка
			//++ №6270
			Если УдалитьНепосредственно Тогда
				Об.Удалить();
			Иначе
				//-- №6270
				Об.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("%1 не удалось %2: %3|%4", Об, ЧастьСообщения, ОписаниеОшибки(), Строка(Окр(Счетчик,0)));
			Сообщение.Сообщить();
		КонецПопытки;
		Счетчик = Счетчик+ШагСчетчика;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекущийПроцесс + "|" + Строка(Окр(Счетчик,0));
		Сообщение.Сообщить();
	КонецЦикла;
	
	
	
	Счетчик=0;
	КоличествоДокументов=0;
	// Подсчет общего количества документов
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Подсчет количества документов для обработки.|0";
	Сообщение.Сообщить();	
	Для Каждого ТекМД из Метаданные.Документы Цикл 
		Если НЕ МассивНеУдаляемыхМетаданных.Найти(ТекМД.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Документ.Ссылка) КАК Количество
		|ИЗ
		|	Документ."+ТекМД.Имя+" КАК Документ
		|ГДЕ
		|   Документ.ПометкаУдаления = ЛОЖЬ";
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			КоличествоДокументов = КоличествоДокументов + Результат.Количество;
		КонецЕсли;
	КонецЦикла;
	
	ТекущийПроцесс="Пометка документов на удаление";
	Если УдалитьНепосредственно Тогда
		ТекущийПроцесс = "Удаление документов";
	КонецЕсли;
	
	Если КоличествоДокументов > 0 Тогда 
		ШагСчетчика=100/КоличествоДокументов;
		
		Для Каждого ТекМД из Метаданные.Документы Цикл 
			Если НЕ МассивНеУдаляемыхМетаданных.Найти(ТекМД.Имя) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 100
			|	Документ.Ссылка КАК Ссылка
			|ИЗ
			|	Документ."+ТекМД.Имя+" КАК Документ
			|ГДЕ
			|   Документ.ПометкаУдаления = ЛОЖЬ";
			
			Результат = Запрос.Выполнить().Выбрать();
			КоличествоДокументовДляОбработки = Результат.Количество();
			
			Пока КоличествоДокументовДляОбработки > 0 Цикл
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 100
				|	Документ.Ссылка КАК Ссылка
				|ИЗ
				|	Документ."+ТекМД.Имя+" КАК Документ
				|ГДЕ
				|   Документ.ПометкаУдаления = ЛОЖЬ";
				
				Результат = Запрос.Выполнить().Выбрать();
				КоличествоДокументовДляОбработки = Результат.Количество();
				Пока Результат.Следующий() Цикл
					ТекОб = Результат.Ссылка.ПолучитьОбъект(); 	
					
					Попытка 
						Если УдалитьНепосредственно Тогда
							ТекОб.Удалить();
						Иначе
							Если ТекОб.ПометкаУдаления Тогда 
								Продолжить; 
							КонецЕсли; 
							ТекОб.УстановитьПометкуУдаления(Истина);
						КонецЕсли;
					Исключение 
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("%1 не удалось %2: %3|%4", Об, ЧастьСообщения, ОписаниеОшибки(), Строка(Окр(Счетчик,0)));
						Сообщение.Сообщить();
					КонецПопытки;
				Счетчик = Счетчик+ШагСчетчика;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекущийПроцесс + ": " + ТекМД.Имя +  "|" + Строка(Окр(Счетчик,0));
				Сообщение.Сообщить();		
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документов для обработки не обнаружено.|50";
		Сообщение.Сообщить();	
	КонецЕсли;
	
	ЧастьСообщения = "Обработка пометки на удаление завершена.";
	Если УдалитьНепосредственно Тогда
		ЧастьСообщения = "Обработка непосредственного удаления завершена.";
	КонецЕсли;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ЧастьСообщения+"|100";
	Сообщение.Сообщить();	
	
	// Задержка для получения формой обработки последнего сообщения
	Дата=ТекущаяДата();
	Пока ТекущаяДата()-Дата < 3 Цикл 
	КонецЦикла;	
	
КонецПроцедуры
//-- #14380 от 11.08.2022

Процедура ИзменитьРеквизитДопУпорядочивания(ИмяТаблицы, ТекущееЗначение, Вверх) Экспорт
	
	Если Вверх Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	ДанныеСправочника.Ссылка КАК Ссылка,
		|	ДанныеСправочника.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	Справочник.%Таблица КАК ДанныеСправочника
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.%Таблица КАК ТекущиеДанныеСправочника
		|		ПО (ТекущиеДанныеСправочника.Ссылка = &ТекущееЗначение)
		|ГДЕ
		|	ДанныеСправочника.РеквизитДопУпорядочивания <= ТекущиеДанныеСправочника.РеквизитДопУпорядочивания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеСправочника.РеквизитДопУпорядочивания УБЫВ";	
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	ДанныеСправочника.Ссылка КАК Ссылка,
		|	ДанныеСправочника.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	Справочник.%Таблица КАК ДанныеСправочника
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.%Таблица КАК ТекущиеДанныеСправочника
		|		ПО (ТекущиеДанныеСправочника.Ссылка = &ТекущееЗначение)
		|ГДЕ
		|	ДанныеСправочника.РеквизитДопУпорядочивания >= ТекущиеДанныеСправочника.РеквизитДопУпорядочивания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеСправочника.РеквизитДопУпорядочивания";
	КонецЕсли;	 
	 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущееЗначение", ТекущееЗначение);
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%Таблица", ИмяТаблицы);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если НЕ Выборка.Количество() = 2 Тогда
		Возврат;
	КонецЕсли;
	
	Выборка.Следующий();
	СпрОбъект1 = Выборка.Ссылка.ПолучитьОбъект();	
	Порядок1 = Выборка.РеквизитДопУпорядочивания;
	
	Выборка.Следующий();
	СпрОбъект2 = Выборка.Ссылка.ПолучитьОбъект();
	Порядок2 = Выборка.РеквизитДопУпорядочивания;
	
	СпрОбъект1.РеквизитДопУпорядочивания = Порядок2;
	СпрОбъект2.РеквизитДопУпорядочивания = Порядок1;
	
	Попытка
		СпрОбъект1.Записать();	
		СпрОбъект2.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
