
&НаСервере
Процедура ЗаполнитьТаблицуЗП(поТекДокументу = Истина)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодЗапрос.Заказ,
	               |	ПодЗапрос.Фонд КАК Фонд,
	               |	ПодЗапрос.ПредметЗаказа,
	               |	ВЫБОР
	               |		КОГДА ПодЗапрос.Заказ.ВидДС = ЗНАЧЕНИЕ(Перечисление.ИА_ВидДенежныхСредств.Наличные)
	               |			ТОГДА ПодЗапрос.Сумма - ЕСТЬNULL(ПодЗапросРезервы.Сумма, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаНал,
	               |	ВЫБОР
	               |		КОГДА ПодЗапрос.Заказ.ВидДС <> ЗНАЧЕНИЕ(Перечисление.ИА_ВидДенежныхСредств.Наличные)
	               |			ТОГДА ПодЗапрос.Сумма - ЕСТЬNULL(ПодЗапросРезервы.Сумма, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаБезнал,
	               |	0 КАК Сумма,
	               |	ПодЗапрос.Статус,
	               |	ПодЗапрос.УтвержденнаяСумма КАК УтвержденнаяСумма,
	               |	0 КАК ИсходнаяСумма,
	               |	ПодЗапрос.ПричинаОтказа,
	               |	ПодЗапрос.НачислениеВФондНал КАК НачислениеВФондНал,
	               |	ПодЗапрос.НачислениеВФондБезнал КАК НачислениеВФондБезнал,
	               |	0 КАК НачислениеВФонд,
	               |	ПодЗапрос.Подразделение КАК Подразделение,
	               |	ПодЗапрос.Подразделение.Наименование КАК ПодразделениеФонд
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗаказыНаПриобретение.Заказ КАК Заказ,
	               |		ЗаказыНаПриобретение.Заказ.Фонд КАК Фонд,
	               |		ЗаказыНаПриобретение.Заказ.Подразделение КАК Подразделение,
	               |		ЗаказыНаПриобретение.Заказ.ПредметЗаказа КАК ПредметЗаказа,
	               |		ЗаказыНаПриобретение.Заказ.Сумма КАК Сумма,
	               |		ЗаказыНаПриобретение.Статус КАК Статус,
	               |		ЗаказыНаПриобретение.УтвержденнаяСумма КАК УтвержденнаяСумма,
	               |		ЗаказыНаПриобретение.ПричинаОтказа КАК ПричинаОтказа,
	               |		0 КАК НачислениеВФондНал,
	               |		0 КАК НачислениеВФондБезнал
	               |	ИЗ
	               |		Документ.ИА_ФинансовоеПланирование.ЗаказыНаПриобретение КАК ЗаказыНаПриобретение
	               |	ГДЕ
	               |		ЗаказыНаПриобретение.Ссылка = &ТекДок
	               |		И &ПоТекДоку = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Документ.ИА_ЗаказНаПриобретение.ПустаяСсылка),
	               |		НачисленияВФонды.Фонд,
	               |		НачисленияВФонды.Подразделение,
	               |		"""",
	               |		0,
	               |		NULL,
	               |		0,
	               |		"""",
	               |		СУММА(НачисленияВФонды.СуммаНал),
	               |		СУММА(НачисленияВФонды.СуммаБезнал)
	               |	ИЗ
	               |		Документ.ИА_ФинансовоеПланирование.НачисленияВФонды КАК НачисленияВФонды
	               |	ГДЕ
	               |		НачисленияВФонды.Ссылка = &ТекДок
	               |		И &ПоТекДоку = ИСТИНА
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		НачисленияВФонды.Фонд,
	               |		НачисленияВФонды.Подразделение
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Фонд,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Подразделение,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.ПредметЗаказа,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Сумма,
	               |		ИА_ИсторияСтатусовЗВССрезПоследних.Статус,
	               |		0,
	               |		ВЫРАЗИТЬ("""" КАК СТРОКА(100)),
	               |		0,
	               |		0
	               |	ИЗ
	               |		РегистрНакопления.ИА_ЗаказыНаПриобретение.Остатки(
	               |				&Дата,
	               |				Организация = &Организация
	               |					ИЛИ &НеРазделять) КАК ЗаявкиНаРасходованиеСредствОстатки
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних КАК ИА_ИсторияСтатусовЗВССрезПоследних
	               |			ПО ЗаявкиНаРасходованиеСредствОстатки.ЗП = ИА_ИсторияСтатусовЗВССрезПоследних.ЗВС
	               |	ГДЕ
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Статус <> &Отклонен
	               |		И &ПоТекДоку = ЛОЖЬ
	               |		И ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток > 0) КАК ПодЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИА_СредстваВРезервеНаФондахОбороты.ЗП КАК Ссылка,
	               |			СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаНалПриход) + СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход) КАК Сумма
	               |		ИЗ
	               |			РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, , Регистратор, ) КАК ИА_СредстваВРезервеНаФондахОбороты
	               |		ГДЕ
	               |			ИА_СредстваВРезервеНаФондахОбороты.Регистратор <> &ТекДок
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ИА_СредстваВРезервеНаФондахОбороты.ЗП) КАК ПодЗапросРезервы
	               |		ПО ПодЗапрос.Заказ = ПодЗапросРезервы.Ссылка
	               |ГДЕ
	               |	(ПодЗапрос.Сумма - ЕСТЬNULL(ПодЗапросРезервы.Сумма, 0) > 0
	               |			ИЛИ ПодЗапрос.НачислениеВФондНал + ПодЗапрос.НачислениеВФондБезнал > 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПодЗапрос.Фонд.Код
	               |ИТОГИ
	               |	СУММА(СуммаНал),
	               |	СУММА(СуммаБезнал),
	               |	СУММА(УтвержденнаяСумма),
	               |	МАКСИМУМ(НачислениеВФондНал),
	               |	МАКСИМУМ(НачислениеВФондБезнал)
	               |ПО
	               |	Подразделение,
	               |	Фонд";
	Запрос.УстановитьПараметр("Дата", КонецДня(Отчет.СсылкаНаОбъект.Дата));
	Запрос.УстановитьПараметр("ТекДок", Отчет.СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ПоТекДоку", поТекДокументу);
	Запрос.УстановитьПараметр("Организация", Отчет.СсылкаНаОбъект.Организация);
	Запрос.УстановитьПараметр("НеРазделять", не Константы.ИА_ФП_ВестиФППоОрганизациям.Получить());
	Запрос.УстановитьПараметр("Отклонен", Перечисления.ИА_СостояниеЗаказа.Отклонен);
	
	//Минаев
	ДеревоЗПЗнач = ДанныеФормыВЗначение(ЭтаФорма.ДеревоЗП,Тип("ДеревоЗначений"));
	ДеревоЗПЗнач = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// добавление пустых фондов
	ВыборкаФондовСпр = Справочники.ИА_Фонды.Выбрать();
	Пока ВыборкаФондовСпр.Следующий() Цикл 
		Если ВыборкаФондовСпр.ЭтоГруппа или не ВыборкаФондовСпр.ОтображатьВСписке Тогда
			Продолжить;
		КонецЕсли;
		
		ТЗ_Подр = ВыборкаФондовСпр.Подразделения.Выгрузить();
		ТЗ_Подр.Свернуть("Подразделение");
		
		Для каждого стрПодрФ из ТЗ_Подр Цикл
			СтрокаПодр = ДеревоЗПЗнач.Строки.Найти(стрПодрФ.Подразделение, "Подразделение");
			Если СтрокаПодр = Неопределено Тогда // такого подр нет
				НовстрПодр = ДеревоЗПЗнач.Строки.Добавить();
				НовстрПодр.Подразделение = стрПодрФ.Подразделение;
				НовстрПодр.СуммаНал = 0;
				НовстрПодр.СуммаБезнал = 0;
				НовстрПодр.НачислениеВФондНал = 0;
				НовстрПодр.НачислениеВФондБезнал = 0;
				
				НовстрФонд = НовстрПодр.Строки.Добавить();
				НовстрФонд.Подразделение = стрПодрФ.Подразделение;
				НовстрФонд.Фонд = ВыборкаФондовСпр.Ссылка;
				НовстрФонд.СуммаНал = 0;
				НовстрФонд.СуммаБезнал = 0;
				НовстрФонд.НачислениеВФондНал = 0;
				НовстрФонд.НачислениеВФондБезнал = 0;
			Иначе // есть подр
				СтрокаФонд = СтрокаПодр.Строки.Найти(ВыборкаФондовСпр.Ссылка, "Фонд");
				Если СтрокаФонд = Неопределено Тогда
					НовстрФонд = СтрокаПодр.Строки.Добавить();
					НовстрФонд.Подразделение = стрПодрФ.Подразделение;
					НовстрФонд.Фонд = ВыборкаФондовСпр.Ссылка;
					НовстрФонд.СуммаНал = 0;
					НовстрФонд.СуммаБезнал = 0;
					НовстрФонд.НачислениеВФондНал = 0;
					НовстрФонд.НачислениеВФондБезнал = 0;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если поТекДокументу Тогда
		Для каждого СтрПодр из ДеревоЗПЗнач.Строки Цикл
			Для каждого стрФонд из СтрПодр.Строки Цикл
				сч = стрФонд.Строки.Количество() - 1;
				Пока сч >= 0 Цикл
					стрЗап = стрФонд.Строки[сч];
					Если не ЗначениеЗаполнено(стрЗап.Заказ) Тогда
						стрФонд.Строки.Удалить(сч);
					иначе
						стрЗап.НачислениеВФондНал = 0;
						стрЗап.НачислениеВФондБезнал = 0;
					КонецЕсли;
					сч = сч - 1;
			 	КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ДеревоЗПЗнач.Строки.Сортировать("Подразделение");
	//Минаев
	ЗначениеВДанныеФормы(ДеревоЗПЗнач,ЭтаФорма.ДеревоЗП);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечать(Команда)
	ЗаполнитьТаблицуЗП();
	ТабДок = ЗаполнитьТабДок();
    ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТабДок()
	// Вставить содержимое обработчика.
	ЭтотОбъект = РеквизитФормыВЗначение("Отчет");
	ДеревоЗПЗнач = ДанныеФормыВЗначение(ДеревоЗП,тип("ДеревоЗначений"));
    ТабДок = ЭтотОбъект.Печать(ДеревоЗПЗнач);
	Возврат ТабДок;	
КонецФункции
