Процедура КСУ_ЗадачаКоммцентра(Настройка) Экспорт
	
	
	РеглЗадача = Справочники.ИА_РегламентныеЗадачиКоммцентра.НайтиПоКоду(Настройка);
	
	адресаты = ПолучитьАдресатов(РеглЗадача);
	
	Для каждого адр из адресаты Цикл 
		Если РеглЗадача.ВидНапоминанияПослание Тогда
			Послание = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
			ЗаполнитьЗначенияСвойств(Послание, РеглЗадача);
			Послание.Отправлена = Истина;
			Послание.Дата = ТекущаяДата();
			Послание.РегламентнаяЗадача = РеглЗадача;
			Послание.ЭтоПослание = Истина;
			Послание.Пользователь = адр;
			Послание.Записать();
		Иначе
			мен = РегистрыСведений.КСУ_Напоминания.СоздатьМенеджерЗаписи();
			мен.Тема = РеглЗадача.Наименование;
			мен.Пользователь = адр;
			мен.Объект = мен.Тема;
			мен.Период = ТекущаяДата();
			мен.Текст = РеглЗадача.Содержание;			
			мен.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьАдресатов(регЗадача)
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь КАК Пользователь
	               |ИЗ
	               |	РегистрСведений.КСУ_ИерархияПостов КАК КСУ_ИерархияПостов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИА_РегламентныеЗадачиКоммцентра.Адресация КАК ИА_РегламентныеЗадачиКоммцентраАдресация
	               |		ПО (ИА_РегламентныеЗадачиКоммцентраАдресация.Ссылка = &регЗадача)
	               |			И КСУ_ИерархияПостов.Родитель = ИА_РегламентныеЗадачиКоммцентраАдресация.Пост
	               |			И (КСУ_ИерархияПостов.Пост = ИА_РегламентныеЗадачиКоммцентраАдресация.Пост
	               |				ИЛИ ИА_РегламентныеЗадачиКоммцентраАдресация.СПодчиненными)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |		ПО КСУ_ИерархияПостов.Пост = ИА_АдресацияЗадачПланаДействий.Пост";
	Запрос.УстановитьПараметр("регЗадача", регЗадача);
	рез = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	Возврат рез;
КонецФункции


