#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НастройкаАвтоматическихНачисленийБонусов") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, ВидДокумента, КатегорияКонтрагента");
		НастройкаПоВидамНоменклатуры.Загрузить(ДанныеЗаполнения.НастройкаПоВидамНоменклатуры.Выгрузить());
		НастройкаПоНоменклатуре.Загрузить(ДанныеЗаполнения.НастройкаПоНоменклатуре.Выгрузить());
		СчетаИКассы.Загрузить(ДанныеЗаполнения.СчетаИКассы.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.РеализацияТоваровИУслуг Тогда		
		Если ПроверяемыеРеквизиты.Найти("СчетаИКассы") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СчетаИКассы"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)	

КонецПроцедуры

#КонецОбласти

#КонецЕсли