
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураРезультата = ОтчетыЭффективности.ДанныеПоИмениОтчета(Параметры.ОтчетИмя);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ТаблицаПоказателей = ОтчетОбъект.ТаблицаДоступныхПоказателей(СтруктураРезультата.ПолеПоказателя, СтруктураРезультата.ТипПоказателя);
	ЗаполнитьДеревоПоказателей(ТаблицаПоказателей);
	
	Для каждого СтрокаТЗ из Параметры.ТаблицаВыбранныхПоказателей Цикл
		СтрокиНастроек = ТаблицаПоказателей.НайтиСтроки(Новый Структура("ИдПоказателя", СтрокаТЗ.ИдПоказателя));
		Если СтрокиНастроек.Количество() = 0 Тогда 
			// нет такого показателя среди доступных на данный момент
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ВыбранныеПоказатели.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		
		// обновим текущее "положение" показателя в дереве
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокиНастроек[0], "ИдРаздела, ПредставлениеРаздела, ИдРаздела2, ПредставлениеРаздела2");
	КонецЦикла;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановкаЦенКлиент.РазвернутьДерево(Элементы, ДеревоПоказателей, "ДеревоПоказателей");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершитьРедактирование И НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		АдресВХранилище = ЗаписатьПодборВХранилище(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	Иначе
		АдресВХранилище = Неопределено;
	КонецЕсли;
	
	Если АдресВХранилище <> Неопределено Тогда
		Структура = Новый Структура("АдресВХранилище", АдресВХранилище);
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьПоказатель(Команда)
		
	ТекущиеДанные = Элементы.ДеревоПоказателей.ТекущиеДанные;
		
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ВыбратьПоказательКлиент(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПоказатель(Команда)
	
	ТекущаяСтрока = Элементы.ВыбранныеПоказатели.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = ВыбранныеПоказатели.НайтиПоИдентификатору(ТекущаяСтрока);	
	ВыбранныеПоказатели.Удалить(СтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	ЗавершитьРедактирование = Истина;
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ВыбранныеПоказателиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПоказателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ДеревоПоказателей.ТекущиеДанные;
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ВыбратьПоказательКлиент(ТекущиеДанные); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоказателиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Выполнение = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоказателиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив")
		И ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		
		Для каждого НовыйПоказатель из ПараметрыПеретаскивания.Значение Цикл
			Если НовыйПоказатель.ЭтоРаздел Тогда
				Продолжить;
			КонецЕсли;
			ВыбратьПоказательКлиент(НовыйПоказатель, Строка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция НайтиРазделВДереве(СтрокиДерева, СтруктураПоиска)
		
	Для каждого СтрокаДерева из СтрокиДерева Цикл
		Если НЕ СтрокаДерева.ЭтоРаздел Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДерева.ИдПоказателя = СтруктураПоиска.ИдРаздела Тогда
			
			Если ЗначениеЗаполнено(СтруктураПоиска.ИдРаздела2) Тогда
				
				СтрокиУровня2 = СтрокаДерева.ПолучитьЭлементы();
				Для каждого СтрокаДереваУровня2 из СтрокиУровня2 Цикл
					Если НЕ СтрокаДереваУровня2.ЭтоРаздел Тогда
						Продолжить;
					КонецЕсли;
					// на втором уровне
					Если СтрокаДереваУровня2.ИдПоказателя = СтруктураПоиска.ИдРаздела2 Тогда
						Возврат СтрокаДереваУровня2;	
					КонецЕсли;
				КонецЦикла;
				// если дошли сюда, значит показатель не найден
				СтрокаРаздела2 = СтрокиУровня2.Добавить();
				СтрокаРаздела2.ИдПоказателя = СтруктураПоиска.ИдРаздела2;
				СтрокаРаздела2.ПредставлениеПоказателя = СтруктураПоиска.ПредставлениеРаздела2;
				СтрокаРаздела2.ЭтоРаздел = Истина;

				Возврат СтрокаРаздела2;
				
			Иначе
				// на первом уровне
				Возврат СтрокаДерева;			
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// если дошли сюда, значит показатель не найден
	Если ЗначениеЗаполнено(СтруктураПоиска.ИдРаздела2) Тогда	
		СтрокаРаздела = СтрокиДерева.Добавить();
		СтрокаРаздела.ИдПоказателя = СтруктураПоиска.ИдРаздела;
		СтрокаРаздела.ПредставлениеПоказателя = СтруктураПоиска.ПредставлениеРаздела;
		СтрокаРаздела.ЭтоРаздел = Истина;
		
		СтрокаРаздела2 = СтрокаРаздела.ПолучитьЭлементы().Добавить();
		СтрокаРаздела2.ИдПоказателя = СтруктураПоиска.ИдРаздела2;
		СтрокаРаздела2.ПредставлениеПоказателя = СтруктураПоиска.ПредставлениеРаздела2;
		СтрокаРаздела2.ЭтоРаздел = Истина;

		Возврат СтрокаРаздела2;
		
	Иначе
		СтрокаРаздела = СтрокиДерева.Добавить();
		СтрокаРаздела.ИдПоказателя = СтруктураПоиска.ИдРаздела;
		СтрокаРаздела.ПредставлениеПоказателя = СтруктураПоиска.ПредставлениеРаздела;
		СтрокаРаздела.ЭтоРаздел = Истина;
		
		Возврат СтрокаРаздела;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоПоказателей(ТаблицаПоказателей)
	
	ТаблицаРазделов2 = ТаблицаПоказателей.Скопировать();
	ТаблицаРазделов2.Свернуть("ИдРаздела, ПредставлениеРаздела, ИдРаздела2, ПредставлениеРаздела2");
	ТаблицаРазделов = ТаблицаРазделов2.Скопировать();
	ТаблицаРазделов.Свернуть("ИдРаздела, ПредставлениеРаздела");

	// строим дерево
	СтрокиДерева = ДеревоПоказателей.ПолучитьЭлементы();
		
	Для каждого СтрокаПоказателя из ТаблицаПоказателей Цикл
		
		СтруктураПоиска = Новый Структура("ИдРаздела, ПредставлениеРаздела, ИдРаздела2, ПредставлениеРаздела2");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаПоказателя);
		СтрокаРаздела = НайтиРазделВДереве(СтрокиДерева, СтруктураПоиска);
		
		СтрокиПоказателей = СтрокаРаздела.ПолучитьЭлементы();
		
		СтрокаПоказателяДерева = СтрокиПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоказателяДерева, СтрокаПоказателя);

	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПоказателей_Старый(ТаблицаПоказателей)
	
	//ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	//ТаблицаПоказателей = ОтчетОбъект.ТаблицаДоступныхПоказателей();
	ТаблицаРазделов2 = ТаблицаПоказателей.Скопировать();
	ТаблицаРазделов2.Свернуть("ИдРаздела, ПредставлениеРаздела, ИдРаздела2, ПредставлениеРаздела2");
	ТаблицаРазделов = ТаблицаРазделов2.Скопировать();
	ТаблицаРазделов.Свернуть("ИдРаздела, ПредставлениеРаздела");

	// строим дерево
	СтрокиДерева = ДеревоПоказателей.ПолучитьЭлементы();
		
	Для каждого СтрокаРазделаТЗ из ТаблицаРазделов Цикл
		
		СтрокаРаздела = СтрокиДерева.Добавить();
		СтрокаРаздела.ИдПоказателя = СтрокаРазделаТЗ.ИдРаздела;
		СтрокаРаздела.ПредставлениеПоказателя = СтрокаРазделаТЗ.ПредставлениеРаздела;
		СтрокаРаздела.ЭтоРаздел = Истина;
		
		СтрокиПоказателей = СтрокаРаздела.ПолучитьЭлементы();
		
		СтруктураПоискаРазделовУровня2 = Новый Структура("ИдРаздела, ПредставлениеРаздела");
		ЗаполнитьЗначенияСвойств(СтруктураПоискаРазделовУровня2, СтрокаРазделаТЗ);
		НайденныеПоказателиУровня2 = ТаблицаРазделов2.НайтиСтроки(СтруктураПоискаРазделовУровня2);
		
		Для каждого СтрокаРазделаУровня2 из НайденныеПоказателиУровня2 Цикл		
			Если НЕ ЗначениеЗаполнено(СтрокаРазделаУровня2.ИдРаздела2) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаРаздела2 = СтрокиПоказателей.Добавить();
			СтрокаРаздела2.ИдПоказателя = СтрокаРазделаУровня2.ИдРаздела2;
			СтрокаРаздела2.ПредставлениеПоказателя = СтрокаРазделаУровня2.ПредставлениеРаздела2;
			СтрокаРаздела2.ЭтоРаздел = Истина;
			
			СтрокиПоказателей2 = СтрокаРаздела2.ПолучитьЭлементы();
			
			СтруктураПоиска = Новый Структура("ИдРаздела, ПредставлениеРаздела, ИдРаздела2, ПредставлениеРаздела2");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРазделаУровня2);
			НайденныеПоказатели = ТаблицаПоказателей.НайтиСтроки(СтруктураПоиска);
			
			Для каждого СтрокаПоказателяТЗ из НайденныеПоказатели Цикл
				СтрокаПоказателя = СтрокиПоказателей2.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПоказателя, СтрокаПоказателяТЗ);
			КонецЦикла;
		КонецЦикла;
		
		СтруктураПоиска = Новый Структура("ИдРаздела, ПредставлениеРаздела, ИдРаздела2, ПредставлениеРаздела2", "", "", "", "");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРазделаТЗ);
		НайденныеПоказатели = ТаблицаПоказателей.НайтиСтроки(СтруктураПоиска);

		Для каждого СтрокаПоказателяТЗ из НайденныеПоказатели Цикл
			СтрокаПоказателя = СтрокиПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПоказателя, СтрокаПоказателяТЗ);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПоказателейПолноеОписаниеПоказателя.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоПоказателей.ЭтоРаздел");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПоказательКлиент(ТекущиеДанные, Строка = Неопределено)

	НайденныеСтроки = ВыбранныеПоказатели.НайтиСтроки(Новый Структура("ИдПоказателя", ТекущиеДанные.ИдПоказателя));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Если Строка = Неопределено Тогда
			НоваяСтрока = ВыбранныеПоказатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
			
			Элементы.ВыбранныеПоказатели.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Иначе
			ТекущийВариант = ВыбранныеПоказатели.НайтиПоИдентификатору(Строка);
			
			НоваяСтрока = ВыбранныеПоказатели.Вставить(ВыбранныеПоказатели.Индекс(ТекущийВариант));
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
			
			Элементы.ВыбранныеПоказатели.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
	Иначе
		// показатель уже выбран, спозиционируемся на нем
		Элементы.ВыбранныеПоказатели.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗаписатьПодборВХранилище(УникальныйИдентификаторВладельца) 
		
	АдресВХранилище = Неопределено;	
	Если ЗавершитьРедактирование Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(ВыбранныеПоказатели.Выгрузить(), УникальныйИдентификаторВладельца);	
	КонецЕсли;
	
	Возврат АдресВХранилище;
	
КонецФункции

#КонецОбласти
