Функция ПроверитьБанковскийСчет(СчетСтрокой, Организация) Экспорт
	
	СчетОрганизации = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	//БанковскиеСчетаОрганизации = Справочники.БанковскиеСчета.Выбрать(,Организация);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, НомерСчета ИЗ Справочник.БанковскиеСчета ГДЕ Владелец = &Организация";
	БанковскиеСчетаОрганизации = Запрос.Выполнить().Выбрать();
	
	Пока БанковскиеСчетаОрганизации.Следующий() Цикл
		Если СчетСтрокой = СокрЛП(БанковскиеСчетаОрганизации.НомерСчета) Тогда 
			СчетОрганизации = БанковскиеСчетаОрганизации.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СчетОрганизации;
	
КонецФункции

Функция НайтиБанковскийСчетПоНомеру(Знач НомерСчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.НомерСчета = &НомерСчета";
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
КонецФункции

Функция НайтиПоступлениеНаРасчетныйСчет(Знач Номер, Знач Дата, БанковскийСчетОрганизации) Экспорт
	Если ПустаяСтрока(Номер) Или ПустаяСтрока(Дата) Тогда
		Возврат Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.ВхНомер = &ВхНомер
	|	И ПоступлениеНаРасчетныйСчет.ВхДата = &ВхДата
	|	И ПоступлениеНаРасчетныйСчет.Счет = &БанковскийСчетОрганизации";
	Запрос.УстановитьПараметр("ВхНомер",Номер);
	Запрос.УстановитьПараметр("ВхДата",Дата);
	Запрос.УстановитьПараметр("БанковскийСчетОрганизации",БанковскийСчетОрганизации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ССылка;
	КонецЦикла;
	
	Возврат Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка();
КонецФункции

Функция НайтиСписаниеСРасчетногоСчета(Знач Номер, Знач Дата, БанковскийСчетОрганизации) Экспорт
	Если ПустаяСтрока(Номер) Или ПустаяСтрока(Дата) Тогда
		Возврат Документы.СписаниеСРасчетногоСчета.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписаниеСРасчетногоСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|ГДЕ
	|	СписаниеСРасчетногоСчета.ИсхНомер = &ИсхНомер
	|	И СписаниеСРасчетногоСчета.ИсхДата = &ИсхДата
	|	И СписаниеСРасчетногоСчета.Счет = &БанковскийСчетОрганизации";
	Запрос.УстановитьПараметр("ИсхНомер",Номер);
	Запрос.УстановитьПараметр("ИсхДата",Дата);
	Запрос.УстановитьПараметр("БанковскийСчетОрганизации",БанковскийСчетОрганизации);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ССылка;
	КонецЦикла;
	
	Возврат Документы.СписаниеСРасчетногоСчета.ПустаяСсылка();
КонецФункции

Функция НайтиПлатежноеПоручение(Знач Номер, Знач Дата, БанковскийСчетОрганизации) Экспорт
	Если ПустаяСтрока(Номер) Или ПустаяСтрока(Дата) Тогда
		Возврат Документы.ПлатежноеПоручениеИсходящее.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ИсхНомер = &ИсхНомер
	|	И ДанныеДокумента.ИсхДата = &ИсхДата
	|	И ДанныеДокумента.Счет = &БанковскийСчетОрганизации";
	Запрос.УстановитьПараметр("ИсхНомер",Номер);
	Запрос.УстановитьПараметр("ИсхДата",Дата);
	Запрос.УстановитьПараметр("БанковскийСчетОрганизации",БанковскийСчетОрганизации);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ССылка;
	КонецЦикла;
	
	Возврат Документы.ПлатежноеПоручениеИсходящее.ПустаяСсылка();
КонецФункции

Функция НайтиКонтрагентаПоИНН(Знач ИНН) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН";
	Запрос.УстановитьПараметр("ИНН",ИНН);
	Выборка  = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
КонецФункции

Функция НайтиСотрудникаПоИНН(ИНН) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка	
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИНН = &ИНН";
	Запрос.УстановитьПараметр("ИНН", СокрЛП(ИНН));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Сотрудники.ПустаяСсылка();
КонецФункции

Функция НайтиКонтрагентаПоБанкСчету(БИК, БанкСчет) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Владелец
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.БИК = &БИК
	|	И БанковскиеСчета.НомерСчета = &БанкСчет
	|	И БанковскиеСчета.Владелец ССЫЛКА Справочник.Контрагенты";
	Запрос.УстановитьПараметр("БИК", БИК);
	Запрос.УстановитьПараметр("БанкСчет", БанкСчет);
	Выборка  = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Владелец;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
КонецФункции

Функция НайтиБанковскийСчетКонтрагента(Контрагент, НомерСчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец
	|	И БанковскиеСчета.НомерСчета = &НомерСчета";
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОпределитьВидОперации(ВидОплаты, ЭтоПоступление, ЭтоНалог = Ложь, РезультатСтрокой = Ложь, ОчередностьПлатежа = Неопределено, СсылкаКонтрагент = Неопределено) Экспорт
	Результат = Неопределено;
	Если ЭтоПоступление Тогда
		Результат = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя;
	Иначе
		Результат = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
	КонецЕсли;
	
	// 04 Поступило наличными по объявлению на взнос наличными, приходному кассовому ордеру, препроводительной ведомости к сумке 0402300 
	Если ВидОплаты = "04" И ЭтоПоступление Тогда
		Результат = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ИнкассацияВБанк;	
	
	// 03 Оплачен наличными денежный чек, выдано по расходному кассовому ордеру 
	ИначеЕсли ВидОплаты = "03" И НЕ ЭтоПоступление Тогда
		Результат = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ИнкассацияИзБанка;	
	 
	ИначеЕсли ЭтоНалог И НЕ ЭтоПоступление Тогда
		Результат = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПеречислениеНалоговИВзносов;
	
	ИначеЕсли НЕ ОчередностьПлатежа = Неопределено И НЕ ЭтоПоступление Тогда
		Если (ОчередностьПлатежа = 3 ИЛИ ОчередностьПлатежа = 2) Тогда
			Если ТипЗнч(СсылкаКонтрагент) = ТипЗнч(Справочники.Контрагенты.ПустаяСсылка()) Тогда
				Результат = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам;
			Иначе
				Результат = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат ?(РезультатСтрокой, Строка(Результат), Результат);
	
КонецФункции

Функция ОбработатьПолеПлательщикПолучатель(НаименованиеКонтрагента) Экспорт
	
	//убираем ИНН из наименования	
	НомерСимволаИНННачало = СтрНайти(НаименованиеКонтрагента, "ИНН");
	
	Если НомерСимволаИНННачало = 0 Тогда
		Возврат НаименованиеКонтрагента;	
	КонецЕсли;
	
	НачПозПоиска = НомерСимволаИНННачало + 1;
	Попытка
		Если Сред(НаименованиеКонтрагента, НомерСимволаИНННачало + 3, 1) = " " Тогда
			НачПозПоиска = НомерСимволаИНННачало + 4;
		КонецЕсли;
	Исключение
	КонецПопытки;
	НомерСимволаИННКонец = СтрНайти(НаименованиеКонтрагента, " ", ,НачПозПоиска);
	Если НомерСимволаИННКонец = 0 Тогда
		НомерСимволаИННКонец = СтрДлина(НаименованиеКонтрагента);
	КонецЕсли;
	
	Если НомерСимволаИНННачало = 1 Тогда
		Результат = СокрЛП(Сред(НаименованиеКонтрагента, НомерСимволаИННКонец));
	Иначе
		Результат = СокрЛП(Сред(НаименованиеКонтрагента, 1, НомерСимволаИНННачало - 1));
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Процедура ЗаписатьНомерИДатуКлиентБанка(СсылкаДокумент, Номер, Дата) Экспорт
	Попытка
		ТекДокумент = СсылкаДокумент;
		ТекДокумент = ТекДокумент.Ссылка.ПолучитьОбъект();
		Если СокрЛП(ТекДокумент.ИсхНомер) = "" Тогда
			ТекДокумент.ИсхНомер = Номер;
			ТекДокумент.ИсхДата = Дата;
			Попытка
				ТекДокумент.Записать();
			Исключение
			КонецПопытки;	
		КонецЕсли;	
	Исключение
	КонецПопытки;
КонецПроцедуры	