//#12463

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
		
	ТаблицаОтчетовПанели.Загрузить(ОтчетыПотолки.ТаблицаОтчетовПользователяНаНачальнойСтранице());
	ПерсональныеНастройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПанелиОтчетИзбранное", "КоличествоКолонок");
	Если ПерсональныеНастройки <> Неопределено Тогда
		КоличествоКолонок = ПерсональныеНастройки;
	Иначе
		КоличествоКолонок = 2;
	КонецЕсли;	
	
	ПараметрыКлиента = ВариантыОтчетов.ПараметрыКлиента();	
	ВключаяПодчиненные = Истина;
		
	//Список.Параметры.УстановитьЗначениеПараметра("ТипВнутренний",     Перечисления.ТипыОтчетов.Внутренний);
	//Список.Параметры.УстановитьЗначениеПараметра("ТипРасширение",     Перечисления.ТипыОтчетов.Расширение);
	//Список.Параметры.УстановитьЗначениеПараметра("ТипДополнительный", Перечисления.ТипыОтчетов.Дополнительный);
	//Список.Параметры.УстановитьЗначениеПараметра("ДоступныеОтчеты", ВариантыОтчетовПовтИсп.ДоступныеОтчеты());
	//Список.Параметры.УстановитьЗначениеПараметра("ОтключенныеВариантыПрограммы", ВариантыОтчетовПовтИсп.ОтключенныеВариантыПрограммы());
	
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеОтчеты", ВариантыОтчетов.ОтчетыТекущегоПользователя());
	Список.Параметры.УстановитьЗначениеПараметра("ОтключенныеВариантыПрограммы", Новый Массив(ВариантыОтчетовПовтИсп.ОтключенныеВариантыПрограммы()));
	Список.Параметры.УстановитьЗначениеПараметра("ЭтоОсновнойЯзык", ТекущийЯзык() = Метаданные.ОсновнойЯзык);
	Список.Параметры.УстановитьЗначениеПараметра("КодЯзыка", ТекущийЯзык().КодЯзыка);
	
	ТекущийЭлемент = Элементы.Список;
	
	ОбновитьСодержимоеСписка("ПриСозданииНаСервере");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьОтчет(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДобавитьВариантОтчетаКлиент(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтчет(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаОтчетовПанели.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийВариант = ТаблицаОтчетовПанели.НайтиПоИдентификатору(ТекущаяСтрока);	
	ТаблицаОтчетовПанели.Удалить(ТекущийВариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	ПрименитьНастройкиНаСервере();
	Закрыть(КоличествоКолонок);
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьНастройкиНаСервере()
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	// сохраняем варианты отчетов
	НаборЗаписей = РегистрыСведений.ИзбранныеОтчетыПользователя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для каждого СтрокаТЗ из ТаблицаОтчетовПанели Цикл
		МенеджерЗаписи = НаборЗаписей.Добавить();
		МенеджерЗаписи.ВариантОтчета = СтрокаТЗ.Вариант;
		МенеджерЗаписи.Пользователь = Пользователь;
		МенеджерЗаписи.Порядок = ТаблицаОтчетовПанели.Индекс(СтрокаТЗ) + 1;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
	// сохраняем настройку
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиПанелиОтчетИзбранное", "КоличествоКолонок", КоличествоКолонок);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблиц

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДобавитьВариантОтчетаКлиент(ВыбраннаяСтрока); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчетовПанелиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчетовПанелиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Выполнение = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчетовПанелиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив")
		И ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		
		Для каждого НовыйВариант из ПараметрыПеретаскивания.Значение Цикл
			ДобавитьВариантОтчетаКлиент(НовыйВариант, Строка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
			
	УсловноеОформление.Элементы.Очистить();
	
	//Инструкция = СтандартныеПодсистемыСервер.ИнструкцияУсловногоОформления();
	//Инструкция.Поля = "Описание";
	//Инструкция.Отборы.Вставить("Список.Описание", ВидСравненияКомпоновкиДанных.Заполнено);
	//Инструкция.Оформление.Вставить("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	//СтандартныеПодсистемыСервер.ДобавитьЭлементУсловногоОформления(ЭтотОбъект, Инструкция);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Описание.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Описание");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСодержимоеСписка(Знач Событие = "")
	
	ИзменилисьПерсональныеНастройки = Ложь;
	//Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
	//	СписокВыбора = Элементы.СтрокаПоиска.СписокВыбора;
	//	ЭлементСписка = СписокВыбора.НайтиПоЗначению(СтрокаПоиска);
	//	Если ЭлементСписка = Неопределено Тогда
	//		СписокВыбора.Вставить(0, СтрокаПоиска);
	//		ИзменилисьПерсональныеНастройки = Истина;
	//		Если СписокВыбора.Количество() > 10 Тогда
	//			СписокВыбора.Удалить(10);
	//		КонецЕсли;
	//	Иначе
	//		Индекс = СписокВыбора.Индекс(ЭлементСписка);
	//		Если Индекс <> 0 Тогда
	//			СписокВыбора.Сдвинуть(Индекс, -Индекс);
	//			ИзменилисьПерсональныеНастройки = Истина;
	//		КонецЕсли;
	//	КонецЕсли;
	//	ТекущийЭлемент = Элементы.СтрокаПоиска;
	//КонецЕсли;
	//
	//Если Событие = "СтрокаПоискаПриИзменении" И ИзменилисьПерсональныеНастройки Тогда
	//	ПерсональныеНастройкиСписка = Новый Структура("СтрокаПоискаСписокВыбора");
	//	ПерсональныеНастройкиСписка.СтрокаПоискаСписокВыбора = Элементы.СтрокаПоиска.СписокВыбора.ВыгрузитьЗначения();
	//	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
	//		ВариантыОтчетовКлиентСервер.ПолноеИмяПодсистемы(),
	//		"Справочник.ВариантыОтчетов.ФормаСписка",
	//		ПерсональныеНастройкиСписка);
	//КонецЕсли;
	//
	//ДеревоПодсистемТекущаяСтрока = Элементы.ДеревоПодсистем.ТекущаяСтрока;
	//
	//СтрокаДерева = ДеревоПодсистем.НайтиПоИдентификатору(ДеревоПодсистемТекущаяСтрока);
	//Если СтрокаДерева = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ВсеПодсистемы = НЕ ЗначениеЗаполнено(СтрокаДерева.ПолноеИмя);
	
	ПараметрыПоиска = Новый Структура;
	//Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
	//	ПараметрыПоиска.Вставить("СтрокаПоиска", СтрокаПоиска);
	//	Элементы.Список.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	//Иначе
	//	Элементы.Список.НачальноеОтображениеДерева = НачальноеОтображениеДерева.НеРаскрывать;
	//КонецЕсли;
	//Если Не ВсеПодсистемы Или ЗначениеЗаполнено(СтрокаПоиска) Тогда
	//	ПодсистемыОтчетов = Новый Массив;
	//	Если Не ВсеПодсистемы Тогда
	//		ПодсистемыОтчетов.Добавить(СтрокаДерева.Ссылка);
	//	КонецЕсли;
	//	Если ВсеПодсистемы Или ВключаяПодчиненные Тогда
	//		ДобавитьРекурсивно(ПодсистемыОтчетов, СтрокаДерева.ПолучитьЭлементы());
	//	КонецЕсли;
	//	ПараметрыПоиска.Вставить("Подсистемы", ПодсистемыОтчетов);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(ОтборТипОтчета) Тогда
	//	ТипыОтчетов = Новый Массив;
	//	Если ОтборТипОтчета = 1 Тогда
	//		ТипыОтчетов.Добавить(Перечисления.ТипыОтчетов.Внутренний);
	//		ТипыОтчетов.Добавить(Перечисления.ТипыОтчетов.Расширение);
	//		ТипыОтчетов.Добавить(Перечисления.ТипыОтчетов.Дополнительный);
	//	Иначе
	//		ТипыОтчетов.Добавить(ОтборТипОтчета);
	//	КонецЕсли;
	//	ПараметрыПоиска.Вставить("ТипыОтчетов", ТипыОтчетов);
	//КонецЕсли;
	
	ЕстьОтборПоВариантам = ПараметрыПоиска.Количество() > 0;
	ПараметрыПоиска.Вставить("ПометкаУдаления", Ложь);
	ПараметрыПоиска.Вставить("ЖесткийОтборПоПодсистемам", Ложь); //Не ВсеПодсистемы);
	
	//РезультатПоиска = ВариантыОтчетов.НайтиСсылки(ПараметрыПоиска);
	РезультатПоиска = ВариантыОтчетов.НайтиВариантыОтчетов(ПараметрыПоиска);
	ВариантыПользователя = ?(РезультатПоиска = Неопределено, Null, РезультатПоиска.Ссылки);
	Список.Параметры.УстановитьЗначениеПараметра("ВариантыПользователя", ВариантыПользователя);	
	Список.Параметры.УстановитьЗначениеПараметра("ЕстьОтборПоВариантам", ЕстьОтборПоВариантам);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВариантОтчетаКлиент(НовыйВариант, Строка = Неопределено)
	
	НайденныеСтроки = ТаблицаОтчетовПанели.НайтиСтроки(Новый Структура("Вариант", НовыйВариант));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Если Строка = Неопределено Тогда
			НоваяСтрока = ТаблицаОтчетовПанели.Добавить();
			НоваяСтрока.Вариант = НовыйВариант;
		Иначе
			ТекущийВариант = ТаблицаОтчетовПанели.НайтиПоИдентификатору(Строка);
			
			НоваяСтрока = ТаблицаОтчетовПанели.Вставить(ТаблицаОтчетовПанели.Индекс(ТекущийВариант));
			НоваяСтрока.Вариант = НовыйВариант;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
			
#КонецОбласти



