// СтандартныеПодсистемы.Печать /////////////////////////////////////

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Акт выполненных работ
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.УДАЛИТЬ_СервисныеЗаявки";
    КомандаПечати.Идентификатор = "АктВыполненныхРабот";
    КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктВыполненныхРабот");
    Если НужноПечататьМакет Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "АктВыполненныхРабот",
        НСтр("ru = 'Акт выполненных работ'"),
        ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати),
        ,
        "Документ.УДАЛИТЬ_СервисныеЗаявки.ПФ_MXL_АктВыполненныхРабот");
    КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать ////////////////////////////////

Функция ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати)
    // Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_АктВыполненныхРабот";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.УДАЛИТЬ_СервисныеЗаявки.ПФ_MXL_АктВыполненныхРабот");
    // Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	УДАЛИТЬ_СервисныеЗаявки.Ссылка,
    |	УДАЛИТЬ_СервисныеЗаявки.Номер,
	|	УДАЛИТЬ_СервисныеЗаявки.Дата КАК ДатаДокумента,
    |	""текстовая строка"" КАК Дата,
    |	УДАЛИТЬ_СервисныеЗаявки.Контрагент,
	|	ВЫБОР КОГДА УДАЛИТЬ_СервисныеЗаявки.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидКонтрагента.ЮрЛицо)
	|		ТОГДА
	|			УДАЛИТЬ_СервисныеЗаявки.Контрагент.НаименованиеПолное
	|		ИНАЧЕ
	|			УДАЛИТЬ_СервисныеЗаявки.Контрагент.Наименование
	|		КОНЕЦ КАК ПредставлениеКонтрагента,
    |	УДАЛИТЬ_СервисныеЗаявки.Адрес,
    |	УДАЛИТЬ_СервисныеЗаявки.Содержание,
    |	УДАЛИТЬ_СервисныеЗаявки.Организация,
    |	УДАЛИТЬ_СервисныеЗаявки.Основание,
    |	УДАЛИТЬ_СервисныеЗаявки.Ответственный,
    |	УДАЛИТЬ_СервисныеЗаявки.Комментарий,
    |	УДАЛИТЬ_СервисныеЗаявки.ТекущийСтатус,
	|	УДАЛИТЬ_СервисныеЗаявки.Склад,
	|	УДАЛИТЬ_СервисныеЗаявки.СервиснаяБригада,
	|	УДАЛИТЬ_СервисныеЗаявки.ДатаРабот,
	|	УДАЛИТЬ_СервисныеЗаявки.ВремяНачалаРабот,
	|	УДАЛИТЬ_СервисныеЗаявки.ВремяОкончанияРабот,
    |	УДАЛИТЬ_СервисныеЗаявки.Исполнители.(
    |		Ссылка,
    |		НомерСтроки,
    |		Сотрудник
    |	),
    |	УДАЛИТЬ_СервисныеЗаявки.Материалы.(
    |		Ссылка,
    |		НомерСтроки,
    |		Номенклатура,
    |		ЕдиницаИзмерения,
    |		Количество
    |	),
    |	УДАЛИТЬ_СервисныеЗаявки.Представление,
    |	УДАЛИТЬ_СервисныеЗаявки.МоментВремени,
    |	УДАЛИТЬ_СервисныеЗаявки.Контрагент.ФактическийАдрес,
    |	УДАЛИТЬ_СервисныеЗаявки.Контрагент.ЮридическийАдрес,
    |	УДАЛИТЬ_СервисныеЗаявки.Контрагент.ОсновнойТелефон,
    |	УДАЛИТЬ_СервисныеЗаявки.Контрагент.ОсновнойEMail
    |ИЗ
    |	Документ.УДАЛИТЬ_СервисныеЗаявки КАК УДАЛИТЬ_СервисныеЗаявки
	|ГДЕ
	|	УДАЛИТЬ_СервисныеЗаявки.Ссылка В(&МассивОбъектов)";
	
    Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	//подготовим итоговую таблицу с данными
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента,"ДЛФ=Д");
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
	КонецЦикла;
    
    ПервыйДокумент = Истина;
    Для Каждого Шапка Из РезультатЗапроса Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСекцияТабличнойЧасти = Ложь;
		ЕстьСекцияТабличнойЧастиИсполнители = Ложь;
		
		Попытка
			ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти");
			ЕстьСекцияТабличнойЧасти = Истина;
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаТаблицыИсполнители");
			ЕстьСекцияТабличнойЧастиИсполнители = Истина;
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		
		Если ЕстьСекцияТабличнойЧасти Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
			Для Каждого ВыборкаМатериалов Из Шапка.Материалы Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаМатериалов);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
		    Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТаблицы");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Если ЕстьСекцияТабличнойЧастиИсполнители Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыИсполнители");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
			Для Каждого ВыборкаИсполнители Из Шапка.Исполнители Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыИсполнители");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаИсполнители);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
		    Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТаблицыИсполнители");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка 
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
    КонецЦикла;
    Возврат ТабличныйДокумент;
КонецФункции
