
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Лид") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Основание = ДанныеЗаполнения.Ссылка;
		Организация = ПараметрыСеанса.ТекущийПользователь.ОрганизацияРозницы;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	// регистр ТоварыНаСкладах Расход
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Если ТекущийСтатус = Справочники.СтатусыСервисныхЗаявок.Выполнена Тогда
		Если НЕ Материалы.Количество() = 0 Тогда
			
			Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, Склад, Материалы, Дата);
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
			Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
				Если ТекСтрокаМатериалы.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал
					или ТекСтрокаМатериалы.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез
					или ТекСтрокаМатериалы.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно
					или ТекСтрокаМатериалы.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок
					или ТекСтрокаМатериалы.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ТиповойОтрез Тогда
					Движение = Движения.ТоварыНаСкладах.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Организация = ОрганизацияТоваров;
					Движение.Склад = Склад;
					Движение.Номенклатура = ТекСтрокаМатериалы.Номенклатура;
					Движение.ХарактеристикаНоменклатуры = ТекСтрокаМатериалы.ХарактеристикаНоменклатуры;
					Движение.СерияНоменклатуры = ТекСтрокаМатериалы.СерияНоменклатуры;
					Движение.Количество = ТекСтрокаМатериалы.Количество;
					Движение.Сумма = Движение.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(Дата, ОрганизацияТоваров, Склад, Движение.Номенклатура, Движение.ХарактеристикаНоменклатуры, Движение.СерияНоменклатуры);
				КонецЕсли;
			КонецЦикла;
			
			//НАЧАЛО 2018-02-08
			Если НЕ СтатьяРасходов.Пустая() И ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
				Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
					
					Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
					Движения.ДоходыРасходы.Записывать = Истина;
					
					Для Каждого ТекущаяСтрока Из Материалы Цикл
						СуммаСписания = ТекущаяСтрока.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(Дата, Организация, Склад, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.СерияНоменклатуры);
						
						Если СуммаСписания <> 0 Тогда
							Движение = Движения.ДоходыРасходы.Добавить();
							Движение.Период 		= Дата;
							Движение.Организация 	= Организация;
							Движение.Подразделение 	= Подразделение;
							Движение.Статья 		= ?(НЕ ТекущаяСтрока.Номенклатура.СтатьяРасходов.Пустая(), ТекущаяСтрока.Номенклатура.СтатьяРасходов, СтатьяРасходов);
							Движение.Метод		 	= Метод;
							Движение.СуммаДоходов 	= 0;
							Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаСписания);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			//КОНЕЦ 2018-02-08
	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// 2017-07-14
	Если Материалы.Количество() = 0 Тогда		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Склад"));		
	КонецЕсли;
КонецПроцедуры
