
&НаСервере
Функция СкачатьШаблонНаСервере()
	
	ВременноеИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	ТаблицаНоменклатуры = ЗаполнитьСписокНоменклатуры();
	ТабДок = новый ТабличныйДокумент;
	
	Построитель = новый ПостроительОтчета();
	Построитель.ИсточникДанных = новый ОписаниеИсточникаДанных(ТаблицаНоменклатуры);
	Построитель.ВыводитьЗаголовокОтчета = Ложь;
	Построитель.Вывести(ТабДок);
	ТабДок.Записать(ВременноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременноеИмяФайла), ЭтотОбъект.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура СкачатьШаблон(Команда)
		
	АдресФайла = СкачатьШаблонНаСервере();
	ВременноеИмя = "Список номенклатуры.xlsx";
    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокНоменклатуры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпрНоменклатура.Код КАК Код,
		|	СпрНоменклатура.Наименование КАК Наименование,
		|	СпрНоменклатура.НаименованиеДляПечати КАК НаименованиеДляПечати,
		|	СпрНоменклатура.Родитель КАК Родитель,
		|	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения,
		|	СпрНоменклатура.АльтернативнаяЕдиницаИзмерения КАК АльтернативнаяЕдиницаИзмерения,
		|	СпрНоменклатура.АльтернативнаяЕдиницаИзмерения.Вес КАК АльтернативнаяЕдиницаИзмеренияВес,
		|	СпрНоменклатура.АльтернативнаяЕдиницаИзмерения.Коэффициент КАК АльтернативнаяЕдиницаИзмеренияКоэффициент
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	НЕ СпрНоменклатура.ПометкаУдаления
		|	И НЕ СпрНоменклатура.ЭтоГруппа
		|	И ВЫБОР
		|			КОГДА &Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СпрНоменклатура.Родитель В ИЕРАРХИИ (&Родитель)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоВидам = Истина
		|				ТОГДА СпрНоменклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
		|			ИНАЧЕ ИСТИНА 
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СпрНоменклатура.Наименование";
	Запрос.УстановитьПараметр("Родитель", ГруппаНоменклатуры); 
	Запрос.УстановитьПараметр("ОтборПоВидам", ВидыНоменклатуры.Количество() > 0); 
	Запрос.УстановитьПараметр("ВидыНоменклатуры", ВидыНоменклатуры.ВыгрузитьЗначения()); 
		
	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаНоменклатуры;
	
КонецФункции
