
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Учет статистик
	
	Если не ВводНесколькихЗначений Тогда
		Если Служебный И не ВидСтатистики.НомерКуба.Пустая() Тогда
			Движения["ИА_"+ВидСтатистики.НомерКуба].Записывать = Истина;
			Движение = Движения["ИА_"+ВидСтатистики.НомерКуба].Добавить();
		Иначе
			Движения.ИА_УчетСтатистик.Записывать = Истина;
			Движение = Движения.ИА_УчетСтатистик.Добавить();
		КонецЕсли;
		
		Движение.Период = Дата;
		Движение.ВидСтатистики = ВидСтатистики;
		
		Если ЗначениеЗаполнено(Аналитика1) Тогда
			Движение.Аналитика1 = Аналитика1;
		Конецесли;
		Если ЗначениеЗаполнено(Аналитика2) Тогда
			Движение.Аналитика2 = Аналитика2;
		Конецесли;
		Если ЗначениеЗаполнено(Аналитика3) Тогда
			Движение.Аналитика3 = Аналитика3;
		Конецесли;
		Движение.Количество = Количество;
	Иначе
		Движения.ИА_УчетСтатистик.Записывать = Истина;
		Для каждого стр из ПакетСтатистик Цикл
			Движение = Движения.ИА_УчетСтатистик.Добавить();			
			Движение.Период = Дата;
			Движение.ВидСтатистики = ВидСтатистики;
			
			Если ЗначениеЗаполнено(стр.Аналитика1) Тогда
				Движение.Аналитика1 = стр.Аналитика1;
			Конецесли;
			Если ЗначениеЗаполнено(стр.Аналитика2) Тогда
				Движение.Аналитика2 = стр.Аналитика2;
			Конецесли;
			Если ЗначениеЗаполнено(стр.Аналитика3) Тогда
				Движение.Аналитика3 = стр.Аналитика3;
			Конецесли;
			Движение.Количество = стр.Количество;
		КонецЦикла;
	КонецЕсли;
	//УчетСтатистик
	
	//УчетВопросовСтатистик
	
	Движения.ИА_УчетВопросовСтатистик.Записывать = Истина;
	Для каждого ВопросПроверочногоСписка Из ВопросыПроверочногоСписка Цикл
		
		ДвижениеУчетВопросовСтатистик = Движения.ИА_УчетВопросовСтатистик.Добавить();
		
		ДвижениеУчетВопросовСтатистик.Период        = Дата;
		ДвижениеУчетВопросовСтатистик.ВидСтатистики = ВидСтатистики;
		ДвижениеУчетВопросовСтатистик.Вопрос        = ВопросПроверочногоСписка.Вопрос;
		ДвижениеУчетВопросовСтатистик.Ответ         = ВопросПроверочногоСписка.Ответ;
		ДвижениеУчетВопросовСтатистик.Количество    = ВопросПроверочногоСписка.Балл;
		
	КонецЦикла;
	//УчетВопросовСтатистик
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение и не Служебный Тогда
		дз = Константы.ИА_ДатаЗапретаВводаСтатистик.Получить();
		Если Дата <= КонецДня(дз) Тогда
			слД = Формат(дз+60*60*24,"ДФ=dd.MM.yyyy");
			Сообщить("Запрещено изменение статистик до "+ слД);
			Отказ = истина;
		КонецЕсли;
	КонецЕсли;
	
	АналитикаПредставление1 = "" + Аналитика1;
	АналитикаПредставление2 = "" + Аналитика2;
	АналитикаПредставление3 = "" + Аналитика3;
	
	Если Ответственный.Пустая() Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если  ДатаВведения = Дата(1,1,1) Тогда
		ДатаВведения = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Префикс = "";
	Если ВводНесколькихЗначений Тогда
		Префикс = "ПакетСтатистик."; 
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ВидСтатистики.Аналитика1) Тогда
		 ПроверяемыеРеквизиты.Добавить(Префикс + "Аналитика1");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидСтатистики.Аналитика2) Тогда
		 ПроверяемыеРеквизиты.Добавить(Префикс + "Аналитика2");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидСтатистики.Аналитика3) Тогда
		 ПроверяемыеРеквизиты.Добавить(Префикс + "Аналитика3");
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
		
КонецПроцедуры

