&НаСервере
Функция СформироватьНаСервере()
	
	ТекОбъект = ЭтаФорма.РеквизитФормыВЗначение("Отчет");
	Макет = ТекОбъект.ПолучитьМакет("Макет");
	Возврат МодульОтчетов.УДАЛИТЬ_СформироватьОтчетСреднийЧек(Макет, Отчет.ПериодНачало, Отчет.ПеиродКонец);
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Результат = СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ПериодНачало = НачалоМесяца(ТекущаяДата());
	Отчет.ПеиродКонец = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры
