#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ВозвратТовараПоставщику";
    КомандаПечати.Идентификатор = "ТОРГ12";
    КомандаПечати.Представление = НСтр("ru = 'ТОРГ-12'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ12") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТОРГ12", НСтр("ru = 'ТОРГ-12'"), ТОРГ12(МассивОбъектов, ОбъектыПечати), , "Документ.ВозвратТовараПоставщику.ПФ_MXL_ТОРГ12");
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());
	Запрос.Текст = 	
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ВозвратТовараПоставщику.Ссылка КАК Ссылка,
    |	ВозвратТовараПоставщику.ПометкаУдаления КАК ПометкаУдаления,
    |	ВозвратТовараПоставщику.Номер КАК Номер,
    |	ВозвратТовараПоставщику.Дата КАК Дата,
    |	ВозвратТовараПоставщику.Проведен КАК Проведен,
    |	ВозвратТовараПоставщику.Валюта КАК Валюта,
    |	ВозвратТовараПоставщику.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |	ВозвратТовараПоставщику.Комментарий КАК Комментарий,
    |	ВозвратТовараПоставщику.Контрагент КАК Контрагент,
    |	ВозвратТовараПоставщику.Организация КАК Организация,
    |	ВозвратТовараПоставщику.Автор КАК Автор,
    |	ВозвратТовараПоставщику.СуммаДокумента КАК СуммаДокумента,
    |	ВозвратТовараПоставщику.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
    |	ВозвратТовараПоставщику.Основание КАК Основание,
    |	0 КАК ИтогоСуммаНДС,
    |	0 КАК ИтогоСуммаБезНДС,
    |	ВозвратТовараПоставщику.Организация.ОсновнойБанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
    |	ВозвратТовараПоставщику.Организация.ОсновнойБанковскийСчет.БИК КАК БанковскийСчетБИК,
    |	ВозвратТовараПоставщику.Организация.ОсновнойБанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
    |	ВозвратТовараПоставщику.Организация.ОсновнойБанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
    |	ВозвратТовараПоставщику.Организация.ИНН КАК ИНН,
    |	ВозвратТовараПоставщику.Организация.КПП КАК КПП,
    |	ВозвратТовараПоставщику.Организация.Руководитель КАК ФИОРуководителя,
    |	ВозвратТовараПоставщику.Организация.ГлавныйБухгалтер КАК ФИОГлавБухгалтера,
    |	ВозвратТовараПоставщику.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
    |	ВЫБОР
    |		КОГДА НЕ ВозвратТовараПоставщику.Контрагент.НаименованиеПолное = """"
    |			ТОГДА ВозвратТовараПоставщику.Контрагент.НаименованиеПолное
    |		ИНАЧЕ ВозвратТовараПоставщику.Контрагент.Наименование
    |	КОНЕЦ КАК КонтрагентНаименованиеПолное,
    |	ВозвратТовараПоставщику.Контрагент.ИНН КАК КонтрагентИНН,
    |	ВозвратТовараПоставщику.Контрагент.ОсновнойБанковскийСчет.НомерСчета КАК КонтрагентБанковскийСчетНомерСчета,
    |	ВозвратТовараПоставщику.Контрагент.ОсновнойБанковскийСчет.БИК КАК КонтрагентБанковскийСчетБИК,
    |	ВозвратТовараПоставщику.Контрагент.ОсновнойБанковскийСчет.КоррСчет КАК КонтрагентБанковскийСчетКоррСчет,
    |	ВозвратТовараПоставщику.Контрагент.ОсновнойБанковскийСчет.НаименованиеБанка КАК КонтрагентБанковскийСчетНаименованиеБанка,
    |	ВозвратТовараПоставщику.Организация.Руководитель.Должность КАК ДолжностьРуководителя,
    |	ВозвратТовараПоставщику.Автор.Сотрудник.Должность КАК ДолжностьКладовщика,
    |	ВозвратТовараПоставщику.Автор.Сотрудник КАК ФИОКладовщика
    |ИЗ
    |	Документ.ВозвратТовараПоставщику КАК ВозвратТовараПоставщику
    |ГДЕ
    |	ВозвратТовараПоставщику.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	""Товары"" КАК ИмяТЧ,
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ВЫБОР
    |		КОГДА &КолонкаАртикул
    |			ТОГДА ДанныеТабличнойЧасти.Номенклатура.Артикул
    |		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Код
    |	КОНЕЦ КАК Код,
    |	ДанныеТабличнойЧасти.Номенклатура.Артикул КАК Артикул,
    |	ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
    |	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ДанныеТабличнойЧасти.СерияНоменклатуры КАК СерияНоменклатуры,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ДанныеТабличнойЧасти.Цена КАК Цена,
    |	ДанныеТабличнойЧасти.Сумма КАК Сумма,
    |	ДанныеТабличнойЧасти.СтавкаНДС КАК СтавкаНДС,
    |	ДанныеТабличнойЧасти.СуммаНДС КАК СуммаНДС,
    |	ДанныеТабличнойЧасти.Сумма - ДанныеТабличнойЧасти.СуммаНДС КАК СуммаБезНДС,
    |	ДанныеТабличнойЧасти.Сумма КАК СуммаСНДС,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод
    |ПОМЕСТИТЬ ВТ_ДанныеТабличнойЧасти
    |ИЗ
    |	Документ.ВозвратТовараПоставщику.Товары КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ВТ_ДанныеТабличнойЧасти.ИмяТЧ КАК ИмяТЧ,
    |	ВТ_ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ВТ_ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ВТ_ДанныеТабличнойЧасти.Код КАК Код,
    |	ВТ_ДанныеТабличнойЧасти.Артикул КАК Артикул,
    |	ВТ_ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
    |	ВТ_ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ВТ_ДанныеТабличнойЧасти.СерияНоменклатуры КАК СерияНоменклатуры,
    |	ВТ_ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ВТ_ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ВТ_ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ВТ_ДанныеТабличнойЧасти.Цена КАК Цена,
    |	ВТ_ДанныеТабличнойЧасти.Сумма КАК Сумма,
    |	ВТ_ДанныеТабличнойЧасти.СтавкаНДС КАК СтавкаНДС,
    |	ВТ_ДанныеТабличнойЧасти.СуммаНДС КАК СуммаНДС,
    |	ВТ_ДанныеТабличнойЧасти.СуммаБезНДС КАК СуммаБезНДС,
    |	ВТ_ДанныеТабличнойЧасти.СуммаСНДС КАК СуммаСНДС,
    |	ВТ_ДанныеТабличнойЧасти.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод
    |ИЗ
    |	ВТ_ДанныеТабличнойЧасти КАК ВТ_ДанныеТабличнойЧасти
    |
    |УПОРЯДОЧИТЬ ПО
    |	ВТ_ДанныеТабличнойЧасти.Ссылка,
    |	ВТ_ДанныеТабличнойЧасти.ИмяТЧ,
    |	ВТ_ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка";
    
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	                                               РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
    
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТОРГ12(МассивОбъектов, ОбъектыПечати)
	
	Возврат ОбщийМодульСервер.ПечатьТОРГ12(МассивОбъектов, ОбъектыПечати);

КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.Премия.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.Штраф.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания данного документа
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ВозвратТовараПоставщику) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ВозвратТовараПоставщику.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ВозвратТовараПоставщику.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
