#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		Валюта = ДанныеЗаполнения.Валюта;
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Склад = ДанныеЗаполнения.Склад;
		Основание = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
		Валюта = ДанныеЗаполнения.Валюта;
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		Основание = ДанныеЗаполнения.Ссылка;
		Подразделение = ДанныеЗаполнения.Подразделение;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары, 
						"Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,ЕдиницаИзмерения,Количество,Коэффициент");
		КонецЦикла;
		
	КонецЕсли;
	
	СтатьяДоходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект);
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	//ТоварыНаСкладах
	ДатаДвижения = Дата;
	Если ДатаДвижения = Дата(1,1,1) Тогда
		ДатаДвижения = ТекущаяДатаСеанса();
	КонецЕсли;
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, Склад, Товары, ДатаДвижения);
	Если Отказ Тогда
		Возврат;
	Иначе
		//++ №8793 товары нужно свернуть, чтобы корректно списать себестоимость
		мТовары = Товары.Выгрузить();
		мТовары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество"); 
		//-- №8793
		Для Каждого Товар Из мТовары Цикл
			Расход = Движения.ТоварыНаСкладах.Добавить();
			Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
			Расход.Период = ДатаДвижения;
			Расход.Организация = ОрганизацияТоваров;
			Расход.Склад = Склад;
			Расход.Номенклатура = Товар.Номенклатура;
			Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Расход.СерияНоменклатуры = Товар.СерияНоменклатуры;
			Расход.Количество = Товар.Количество * Товар.Коэффициент;
			////#8288
			//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, Склад, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
			СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, Склад, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
			Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
			Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
		КонецЦикла;
	КонецЕсли;
	
	//ВзаиморасчетыСКонтрагентами
	ВремСуммаДокумента = 0;
	ВремСуммаДокумента = Товары.Итог("Сумма");
	Если НЕ Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьПриход(Ссылка, Организация, Контрагент, ДоговорКонтрагента, ВремСуммаДокумента) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Взаиморасчеты с контрагентами в валюте
	Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
	Движение.ВидДвижения =ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.Договор = ДоговорКонтрагента;
	Движение.Валюта = Валюта;
	Движение.Сумма = СуммаДокумента;
	
	// регистр ДоходыРасходы
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод
			Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движения.ДоходыРасходы.Записывать = Истина;
			Для Каждого ТекущаяСтрока Из Товары Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяДоходов.Пустая(), ТекущаяСтрока.СтатьяДоходов, СтатьяДоходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
				Движение.СуммаРасходов 	= 0;
			КонецЦикла;			
		КонецЕсли;
	КонецЕсли;
	
	// ОбеспечениеЗаказовРозницы
	Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		Если РегистрыНакопления.ОбеспечениеЗаказовРозницы.ТребуетсяЗаписьПоОснованию(Основание.Основание) Тогда

			Движения.ОбеспечениеЗаказовРозницы.Записывать = Истина;
			Для Каждого ТекущаяСтрока Из Товары Цикл
				Если (НЕ ЗначениеЗаполнено(ТекущаяСтрока.Комната) И СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам)
					ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Назначение)
					ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда 
					Продолжить;
				КонецЕсли;
				
				Движение = Движения.ОбеспечениеЗаказовРозницы.Добавить();
				//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Заказ 			= Основание.Основание;
				Движение.Период 		= Дата;			
				Движение.Номенклатура 	= ТекущаяСтрока.Номенклатура;
				Движение.ХарактеристикаНоменклатуры 	= ТекущаяСтрока.ХарактеристикаНоменклатуры;
				Движение.Комната 		= ТекущаяСтрока.Комната;
				Движение.Назначение 	= ТекущаяСтрока.Назначение;
				Движение.Количество 	= -ТекущаяСтрока.Количество;
				Движение.КоличествоПоФакту = -ТекущаяСтрока.Количество;
				//#4679
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда 
					Движение.Количество = -1;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;

	//заказы поставщикам
	//Движения.ЗаказыПоставщикам.Записывать = Истина;
	Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		Если ЗначениеЗаполнено(Основание.Основание) И ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда	
			
			ТаблицаТоваровКСписанию = Товары.Выгрузить();
			ТаблицаТоваровКСписанию.Колонки.Добавить("Потолок");
			Для каждого СтрокаТЗ из ТаблицаТоваровКСписанию Цикл
				СтрокаТЗ.Количество = -СтрокаТЗ.Количество;
			КонецЦикла;
			Движения.ЗаказыПоставщикам.ВыполнитьРасход(Ссылка, Дата, Основание.Основание, Организация, ТаблицаТоваровКСписанию, Отказ); //делаем именно так, чтобы отрабатывало ОжидаемыеПоставки_Рассчитать
		
			//Для Каждого СтрокаТовара Из Товары Цикл
			//	Движение = Движения.ЗаказыПоставщикам.Добавить();
			//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//	Движение.Период = Дата;
			//	Движение.ЗаказПоставщику = Основание.Основание;
			//	Движение.Организация = Организация;
			//	Движение.Номенклатура = СтрокаТовара.Номенклатура;
			//	Движение.Количество = -СтрокаТовара.Количество * Товар.Коэффициент;
			//	//Движение.Потолок = СтрокаТовара.Потолок;
			//	Движение.Цена = СтрокаТовара.Цена;
			//	Движение.ЕдиницаИзмерения = СтрокаТовара.ЕдиницаИзмерения;
			//	Движение.Сумма = СтрокаТовара.Сумма; //#8742
			//КонецЦикла;				
		КонецЕсли;
	КонецЕсли;
	
	//#16643
	Если ЗначениеЗаполнено(Основание) Тогда		
		ОснованиеДокумента = Неопределено;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ОснованиеДокумента = Основание;
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") И ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.ЗаказПоставщику")  Тогда
			ОснованиеДокумента = Основание.Основание;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОснованиеДокумента) Тогда		
			ОбщийМодульСервер.ОжидаемыеПоставки_Рассчитать(ОснованиеДокумента);
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.ЗаказыПоставщикам.ОчиститьДвижения(Ссылка, Отказ); // нужно для ОжидаемыеПоставки_УдалитьЗаписиПоЗаказу
	
	//#16643
	Если ЗначениеЗаполнено(Основание) Тогда		
		ОснованиеДокумента = Неопределено;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ОснованиеДокумента = Основание;
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") И ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.ЗаказПоставщику")  Тогда
			ОснованиеДокумента = Основание.Основание;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОснованиеДокумента) Тогда		
			ОбщийМодульСервер.ОжидаемыеПоставки_Рассчитать(ОснованиеДокумента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14675
	СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам = Константы.УчетОбеспеченностиРозницыПоКомнатам.Получить();
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры



#КонецОбласти

#КонецЕсли