
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокКомнат.ЗагрузитьЗначения(Параметры.СписокКомнат.ВыгрузитьЗначения());
	
	//#9958
	Для Каждого ТекущаяСтрока Из Параметры.МассивТоваровМонтажа Цикл
		НоваяСтрока = ТоварыМонтажа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	ТабличнаяЧасть = Параметры.ДокументИсточник.Товары;
			
	Для Каждого ТекущаяСтрока Из ТабличнаяЧасть Цикл
		НоваяСтрока = СписокПозиций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		Если ЗначениеЗаполнено(НоваяСтрока.Комната) И СписокКомнат.НайтиПоЗначению(НоваяСтрока.Комната) = Неопределено Тогда
			НоваяСтрока.Комната = "";
		КонецЕсли;
		НоваяСтрока.Отметка = Истина; //#7380 
	КонецЦикла;
	
	//#9958
	ЗаполнитьИндикаторПозицияВТоварахМонтажа();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИндикаторПозицияВТоварахМонтажа()
	
	Для каждого ТекущаяСтрока из СписокПозиций Цикл
		СтруктураОтбора = Новый Структура("Комната, Номенклатура, ХарактеристикаНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, ТекущаяСтрока);
		ТекущаяСтрока.ПозицияВТоварахМонтажа = ТоварыМонтажа.НайтиСтроки(СтруктураОтбора).Количество() > 0;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПозицийКомнатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(СписокКомнат.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПозицийПриИзменении(Элемент)
	
	//#9958
	ЗаполнитьИндикаторПозицияВТоварахМонтажа();
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	// Проверим, все ли комнаты заполнены
	Для Каждого ТекущаяСтрока Из СписокПозиций Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Комната) Тогда
			ПоказатьПредупреждение(, "Не во всех строках заполнена комната, действие отменено.");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	МассивПозиций = новый Массив;
	Для Каждого ТекущаяСтрока Из СписокПозиций Цикл
		СтруктураСтроки = новый Структура("Комната, Номенклатура, Характеристика, ЕдиницаИзмерения, Коэффициент, Количество, ИспользоватьВТекущемМонтаже", ТекущаяСтрока.Комната, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения, ТекущаяСтрока.Коэффициент, ТекущаяСтрока.Количество, Истина);
		МассивПозиций.Добавить(СтруктураСтроки);
	КонецЦикла;	
	
	Закрыть(МассивПозиций);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	Для Каждого ТекущаяСтрока Из СписокПозиций Цикл
		ТекущаяСтрока.Отметка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого ТекущаяСтрока Из СписокПозиций Цикл
		ТекущаяСтрока.Отметка = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьВсе(Команда)
	
	Для Каждого ТекущаяСтрока Из СписокПозиций Цикл
		ТекущаяСтрока.Отметка = (НЕ ТекущаяСтрока.Отметка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомнатуВоВсехСтроках(Команда)
	
	ЗаполнитьКомнату(Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомнатуВСтрокахГдеНеЗаполнено(Команда)
	
	ЗаполнитьКомнату();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомнату(ВоВсехСтроках = Ложь)
	
	ОП = новый ОписаниеОповещения("ПослеВыбораКомнатыДляЗаполнения", ЭтотОбъект, новый Структура("ВоВсехСтроках", ВоВсехСтроках));
	ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", новый Структура("ДоступныеЗначения", СписокКомнат), ЭтотОбъект,,,, ОП);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораКомнатыДляЗаполнения(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ЗаполнитьКомнатуЗавершение(ВыбранноеЗначение, ДопПараметры.ВоВсехСтроках);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомнатуЗавершение(Комната, ВоВсехСтроках)
	
	Для Каждого ТекущаяСтрока Из СписокПозиций Цикл
		Если НЕ ВоВсехСтроках И ЗначениеЗаполнено(ТекущаяСтрока.Комната) Тогда
			Продолжить;
		КонецЕсли;
		ТекущаяСтрока.Комната = Комната;
	КонецЦикла;
	
	//#9958
	ЗаполнитьИндикаторПозицияВТоварахМонтажа();
	
КонецПроцедуры





