
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПредставлениеПоказателя(КлючТекущегоВарианта = "") Экспорт
	
	Возврат ""; 
	
КонецФункции

Функция ТипДанныхПоказателяСтрокой() Экспорт
	
	Возврат "";
	
КонецФункции

// основная функция, где описываются разделы, показатели, тексты запросов для их вычисления
Функция ТаблицаДоступныхПоказателей(Знач ПолеПоказателя="", Знач ТипПоказателя="") Экспорт
	
	Возврат ОтчетыЭффективности.ТаблицаДоступныхПоказателейПоЛидам(ПолеПоказателя, ТипПоказателя);
	
КонецФункции

Функция ДополнитьТекстЗапросаВТ(ТекстЗапроса) Экспорт
	
	// общие таблицы
	ОтчетыЭффективности.ДополнитьТекстЗапросаВТ(ТекстЗапроса);
		
КонецФункции
	
Функция НастройкиВариантаОтчета(ОтчетСсылка, КлючВарианта, Предопределенный) Экспорт
	
	Возврат ОтчетыЭффективности.НастройкиВариантаОтчетаПоЛидам(ОтчетСсылка, КлючВарианта, Предопределенный);
	
КонецФункции

#КонецОбласти

#КонецЕсли

#Область УДАЛИТЬ

Процедура УДАЛИТЬ_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//++ №11768 формируем запрос используя внешние наборы данных
	СтандартнаяОбработка = Ложь;
	УстановитьПривилегированныйРежим(Истина); // #4888
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	//++ #12385
	//ПараметрСКД = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("НачалоПериода"));
	//НачалоПериода = ОбщийМодульСервер.ПолучитьДатуПоПараметру(ПараметрСКД);
	//
	//ПараметрСКД = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("КонецПериода"));
	//КонецПериода = ОбщийМодульСервер.ПолучитьДатуПоПараметру(ПараметрСКД, ТекущаяДатаСеанса());
	
	ПараметрСКД = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("СтПериод"));
	НачалоПериода = ОбщийМодульСервер.ПолучитьДатуПоПараметру(ПараметрСКД.Значение.ДатаНачала, ТекущаяДатаСеанса());
	КонецПериода  = ОбщийМодульСервер.ПолучитьДатуПоПараметру(ПараметрСКД.Значение.ДатаОкончания, ТекущаяДатаСеанса());
	//-- #12385

	Вид = "";
	ПараметрСКД = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("Вид"));
	Если Не ПараметрСКД = Неопределено Тогда
		Вид = ПараметрСКД.Значение;
	КонецЕсли;
	
	ПараметрТипДиаграммы = Неопределено;
	ПараметрСКД = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("ТипДиаграммы"));
	Если Не ПараметрСКД = Неопределено Тогда
		ПараметрТипДиаграммы = ПараметрСКД.Значение;
	КонецЕсли;	
	
	//#12382
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) И НачалоПериода > КонецПериода Тогда
		ВызватьИсключение "Неправильно задан период: начало периода должно быть меньше или равно окончанию";
	КонецЕсли;
	
	// Формируем данные по таблицам (так, как они визуально выглядят в отчёте)
	МенеджерВТ = новый МенеджерВременныхТаблиц;
	ВременныеТаблицы = ОбщийМодульСервер.СформироватьДанныеВоВременныеТаблицы(МенеджерВТ, НачалоПериода, КонецПериода, Вид);
	
	СтруктураТаблиц = новый Структура;
	СтруктураТаблиц.Вставить("ПоДатеЛида", ОбщийМодульСервер.ПолучитьТаблицуПоДатеЛида(МенеджерВТ, НачалоПериода, КонецПериода));
	// Вторая таблица полностью по вычисляемым полям Конверсии
	СтруктураТаблиц.Вставить("ПоДатеЛидаПродолжение", ОбщийМодульСервер.ПолучитьТаблицуПоДатеЛидаПродолжение(МенеджерВТ, НачалоПериода, КонецПериода));
	СтруктураТаблиц.Вставить("ПоДатеДоговора", ОбщийМодульСервер.ПолучитьТаблицуПоДатеДоговора(МенеджерВТ, НачалоПериода, КонецПериода));
	
	//#12914 новая таблица
	СтруктураТаблиц.Вставить("ПоМонтажам", ОбщийМодульСервер.ПолучитьТаблицуПоМонтажам(МенеджерВТ, НачалоПериода, КонецПериода));
	
	ВнешниеНаборыДанных = новый Структура("Основной", ОбщийМодульСервер.ОбъединитьТаблицыНаборовДанных(СтруктураТаблиц));
	
	//Выбор типа диаграммы
	//ТипДиаграммы.ГистограммаГоризонтальная;
	//ТипДиаграммы.ГистограммаГоризонтальнаяОбъемная;
	//ТипДиаграммы.ГистограммаСНакоплениемГоризонтальная;
	//ТипДиаграммы.ГистограммаСНакоплениемГоризонтальнаяОбъемная;
	
	Если ПараметрТипДиаграммы <> Неопределено Тогда
		Для	Каждого СтруктураВывода Из НастройкиОтчета.Структура Цикл
			Если ТипЗнч(СтруктураВывода) = Тип("ДиаграммаКомпоновкиДанных") Тогда
				Для Каждого ПараметрВывода Из СтруктураВывода.ПараметрыВывода.Элементы Цикл
					Если Строка(ПараметрВывода.Параметр) = "ТипДиаграммы" Тогда
						ПараметрВывода.Значение = ТипДиаграммы[ПараметрТипДиаграммы];
					КонецЕсли;	
				КонецЦикла;			
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ТабличныйДокумент = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// Делаем центрирование групп полей
	Для НомерСтроки = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		Для НомерКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
			
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
			
			Если СтрНайти(НРег(Ячейка.Текст), "по дате лида") > 0
				Или СтрНайти(НРег(Ячейка.Текст), "договоры оформленные в период в независимости от даты лида") > 0
				Или СтрНайти(НРег(Ячейка.Текст), "отчет по монтажам") > 0
				Или СтрНайти(НРег(Ячейка.Текст), "за период") > 0
			Тогда
				Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	//-- №11768
	
КонецПроцедуры

#КонецОбласти
