&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановкаФильтраСервисныеЗаявки();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФильтраСервисныеЗаявки()	
	Список.Отбор.Элементы.Очистить();	
	Если СервисныеЗаявкиОтбиратьПоСтатусу Тогда
		ЭО = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭО.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	    ЭО.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ТекущийСтатус");
	    ЭО.ПравоеЗначение 	= СервисныеЗаявкиОтборПоСтатусуТекущийСтатус;
	    ЭО.Использование	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоСтатусуПриИзменении(Элемент)
	УстановкаФильтраСервисныеЗаявки();
КонецПроцедуры


&НаКлиенте
Процедура ОтборПоСтатусуТекущийСтатусПриИзменении(Элемент)
	УстановкаФильтраСервисныеЗаявки();
КонецПроцедуры

