
&НаКлиенте
Процедура ПорядокВверх(Команда)
    ИзменитьПорядокНаСервере(Элементы.Список.ТекущаяСтрока, -1);
КонецПроцедуры

&НаКлиенте
Процедура ПорядокВниз(Команда)
    ИзменитьПорядокНаСервере(Элементы.Список.ТекущаяСтрока, 1);
КонецПроцедуры

&НаСервере
Процедура ИзменитьПорядокНаСервере(Реквизит, Направление)
	ПланыВидовХарактеристик.ИА_БПРеквизиты.ИзменитьПорядокРеквизита(Реквизит, Направление);
    Элементы.Список.Обновить();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    //Вставить содержимое обработчика
КонецПроцедуры
 