//&НаСервере
//Перем ДанныеФормы;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьОшибки = Ложь;
	ЗакрыватьПриУспешномЗавершенииЗагрузки = Истина;
	ПутиКПапкамНаКлиенте = НЕ Константы.КаталогиЗагрузкиИзПостроителяУказываютНаПапкиСервера.Получить();
	
	ПоВладельцу 		 = Параметры.ПоВладельцу; 
	ЗапускатьПриОткрытии = Параметры.ЗапускатьПриОткрытии;
	ПакетнаяЗагрузка 	 = Параметры.ПакетнаяЗагрузка;
	Если НЕ ПакетнаяЗагрузка Тогда	
		СписокФайлов = Параметры.СписокФайлов;	
	КонецЕсли;
	НаКлиенте 			 = Параметры.НаКлиенте;
	
	ЭтоРозница 			 = Параметры.ЭтоРозница;
	ВМатериалы 			 = Параметры.ВМатериалы;
	Комната 			 = Параметры.Комната;
	УчитыватьНДС 		 = Параметры.УчитыватьНДС;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗапускатьПриОткрытии Тогда
		ПодключитьОбработчикОжидания("ОбработатьФайлы", 0.3, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбработатьФайлы() Экспорт
	
	ЖурналЗагрузки.Удалить();
	
	СтруктураКаталогов = ИнициализироватьКаталогиЗагрузок();
	Если СтруктураКаталогов.ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;	
	
	КаталогЗагрузки = СтруктураКаталогов.КаталогЗагрузки;
	КаталогРезервныхКопий = СтруктураКаталогов.КаталогРезервныхКопий;
	ЕстьОшибки = Ложь;
	
	Если ПакетнаяЗагрузка Тогда	
		ЗагрузитьИзПостроителяПакетом();
	Иначе
		ЗагрузитьИзПостроителя();
	КонецЕсли;
	
	Если НЕ ЕстьОшибки И ЗакрыватьПриУспешномЗавершенииЗагрузки Тогда
		Закрыть(ПоследнийПотолок);
	КонецЕсли;

КонецПроцедуры

//&НаКлиенте //нна
&НаКлиенте 
Процедура ЗагрузитьИзПостроителя()
	// использование:
	// 1. непакетная загрузка потолка на форме Заказ покупателя
	// 2. непакетная загрузка потолка на форме Заказ-договора
	// 3. непакетная загрузка потолка на форме Монтажа
	// 4. непакетная загрузка потолка на форме Предварительного расчета
	
	МассивФайлов = СписокФайлов.ВыгрузитьЗначения();
	
	ДобавитьВЖурналЗагрузки("Файлов для загрузки: " + МассивФайлов.Количество() + " шт.");
	Индикатор = 0;
	Элементы.Индикатор.МаксимальноеЗначение = МассивФайлов.Количество();
	
	КоличествоНовыхЗаказов = 0;
	КоличествоОбновленныхЗаказов = 0;
	ПропущеноФайлов = 0;
	
	Для Номер=0 По МассивФайлов.Количество()-1 Цикл
		//загружаем файлы
		Если НаКлиенте Тогда
			//ФайлЗагрузки = Новый Файл(МассивФайлов[Номер]);
			//ОбработатьФайлНаКлиенте(ФайлЗагрузки);
			ОбработатьФайлНаКлиенте(МассивФайлов[Номер]);
		КонецЕсли;
	
		Индикатор = Индикатор + 1;
		Элементы.Индикатор.Заголовок = "Обработано файлов " + Индикатор + "/" + МассивФайлов.Количество();
	КонецЦикла;
	
	ДобавитьВЖурналЗагрузки("Загрузка завершена");
	ДобавитьВЖурналЗагрузки("------------------------------------------------------");
	ДобавитьВЖурналЗагрузки("Обработано файлов: " + МассивФайлов.Количество(), , Истина);
	ДобавитьВЖурналЗагрузки("Пропущено файлов: " + ПропущеноФайлов, , Истина);
	
	Если ПакетнаяЗагрузка Тогда
		ДобавитьВЖурналЗагрузки("Создано заказов: " + КоличествоНовыхЗаказов, , Истина);
		ДобавитьВЖурналЗагрузки("Обновлено заказов: " + КоличествоОбновленныхЗаказов, , Истина);
	КонецЕсли;
		
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьИзПостроителяПакетом()
	
	Если КонстантыИдетПакетнаяЗагрузкаРасчетовИзИзиСилингПолучить() Тогда
		ЕстьОшибки = Истина;
		ПоказатьИдетПакетнаяЗагрузка();
		//ДобавитьВЖурналЗагрузки("В данный момент идет загрузка чертежей из Easy Ceiling. Для возобновления загрузки необходимо снять флаг активной загрузки с помощью формы: Настройки - Идет пакетная загрузка расчетов из  Easy Ceiling", Истина);
		Возврат;
	КонецЕсли;
		
	//Начинаем загрузку
	КонстантыИдетПакетнаяЗагрузкаРасчетовИзИзиСилингУстановить(Истина);	
	
	Если ПутиКПапкамНаКлиенте Тогда
		МассивФайлов = НайтиФайлыНаКлиенте(); //НайтиФайлы(КаталогЗагрузки, "*.ini");
	Иначе
		МассивФайлов = НайтиФайлыНаСервере();
	КонецЕсли;

	ДобавитьВЖурналЗагрузки("Найдено файлов для загрузки: " + МассивФайлов.Количество() + " шт.");
	Индикатор = 0;
	Элементы.Индикатор.МаксимальноеЗначение = МассивФайлов.Количество();
	
	КоличествоНовыхЗаказов = 0;
	КоличествоОбновленныхЗаказов = 0;
	ПропущеноФайлов = 0;
	
	Для Номер=0 По МассивФайлов.Количество()-1 Цикл
		//загружаем файлы
		Если ПутиКПапкамНаКлиенте Тогда
			МассивПродукции = ОбработатьФайлНаКлиенте(МассивФайлов[Номер]);
		Иначе
			МассивПродукции = ОбработатьФайлНаСервере(МассивФайлов[Номер]);
		КонецЕсли;
	
		Индикатор = Индикатор + 1;
		Элементы.Индикатор.Заголовок = "Обработано файлов " + Индикатор + "/" + МассивФайлов.Количество();
	КонецЦикла;
	ДобавитьВЖурналЗагрузки("Загрузка завершена");
	ДобавитьВЖурналЗагрузки("------------------------------------------------------");
	ДобавитьВЖурналЗагрузки("Обработано файлов: " + МассивФайлов.Количество(), , Истина);
	ДобавитьВЖурналЗагрузки("Пропущено файлов: " + ПропущеноФайлов, , Истина);
	ДобавитьВЖурналЗагрузки("Создано заказов: " + КоличествоНовыхЗаказов, , Истина);
	ДобавитьВЖурналЗагрузки("Обновлено заказов: " + КоличествоОбновленныхЗаказов, , Истина);
	
	КонстантыИдетПакетнаяЗагрузкаРасчетовИзИзиСилингУстановить(Ложь);
	
	//#15546
	Если НЕ МассивПродукции = Неопределено Тогда
		Для каждого ЭлементНоменклатуры из МассивПродукции Цикл
			ОповеститьОбИзменении(ЭлементНоменклатуры);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте //нна
&НаКлиенте
Функция ОбработатьФайлНаКлиенте(ПолноеИмяФайлаЗагрузки)
	
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолноеИмяФайлаЗагрузки);
	МассивПродукции = Новый Массив;
	// загружаем файл
	ВыбранноеИмяФайла = СтруктураИмениФайла.ПолноеИмя;
	ДобавитьВЖурналЗагрузки("Начало обработки файла " + СтруктураИмениФайла.Имя);
	
	МассивСообщенийКВыводу = Новый Массив;
	СтруктураФайла = ОбменСПостроителемКлиентСервер.ПрочитатьФайлПостроителя(ПолноеИмяФайлаЗагрузки, МассивСообщенийКВыводу);		
	Если СтруктураФайла = Неопределено Тогда
		Для каждого ЭлементМассива из МассивСообщенийКВыводу Цикл
			ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстОшибки, ЭлементМассива.ЭтоОшибка);
		КонецЦикла;
		Возврат МассивПродукции;
	КонецЕсли;
		
	УдаленОсновнойФайл = Ложь;
	
	СписокПутейКФайламКУдалению = Новый СписокЗначений;
	СписокДвоичныхДанныхФайлов = Новый СписокЗначений;
	
	МассивСообщенийКВыводу.Очистить();
	ОбменСПостроителемКлиентСервер.СформироватьСписокПутейКФайлам(СтруктураФайла, СписокПутейКФайламКУдалению, СписокДвоичныхДанныхФайлов, МассивСообщенийКВыводу);	
	Для каждого ЭлементМассива из МассивСообщенийКВыводу Цикл
		ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстОшибки, ЭлементМассива.ЭтоОшибка);
	КонецЦикла;
		
	РезервироватьФайлы = Ложь;
	
	Если НЕ ЭтоРозница Тогда
		// загрузка в заказ покупателя
		Если НЕ ПоВладельцу Тогда
			РезультатЗагрузки = ОбменСEasyCeiling.ЗагрузитьРасчетEasyCeilingИзФайла(СтруктураФайла, СписокДвоичныхДанныхФайлов);
			МассивПродукции = РезультатЗагрузки.МассивПродукции;
		Иначе
			ВладелецФормыОбъект = ЭтаФорма.ВладелецФормы.Объект; 
			РезультатЗагрузки = ЗагрузитьРасчетEasyCeilingИзФайлаВФорму(СтруктураФайла, СписокДвоичныхДанныхФайлов, ВладелецФормыОбъект);
			
			КопироватьДанныеФормы(РезультатЗагрузки.ДанныеФормы, ЭтаФорма.ВладелецФормы.Объект); 
		КонецЕсли;
		
		Для каждого ЭлементМассива из РезультатЗагрузки.МассивСообщений Цикл
			ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстСообщения, ЭлементМассива.ЭтоОшибка);	
		КонецЦикла;
		
		Если РезультатЗагрузки.ЕстьКритичныеОшибки Тогда			
			ПропущеноФайлов = ПропущеноФайлов + 1;
		Иначе
			РезервироватьФайлы = Истина;
			Если НЕ РезультатЗагрузки.ЗаказОбновлен Тогда
				КоличествоНовыхЗаказов = КоличествоНовыхЗаказов + 1;
			Иначе
				КоличествоОбновленныхЗаказов = КоличествоОбновленныхЗаказов + 1;
			КонецЕсли;
		КонецЕсли;
	Иначе
		// загрузка в заказ-договор / монтаж / предварительный расчет
		ПродолжитьЗагрузку = Истина;
		ОписаниеОшибки = "";
		СтруктураПотолок = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(СтруктураФайла, СписокДвоичныхДанныхФайлов, , Ложь,,,, ОписаниеОшибки,, Истина);
		Если СтруктураПотолок = Неопределено Тогда
			ДобавитьВЖурналЗагрузки("Ошибка загрузки потолка!", Истина);
			ПродолжитьЗагрузку = Ложь;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ДобавитьВЖурналЗагрузки(ОписаниеОшибки, Истина);
			ПродолжитьЗагрузку = Ложь;
		КонецЕсли;
		
		Если ПродолжитьЗагрузку Тогда
			
			ВладелецФормыОбъект = ЭтаФорма.ВладелецФормы.Объект; 
			СтруктураЗагрузкиРасчета = ЗагрузитьРасчетВФормуДокументаРозницы(СтруктураФайла, СписокДвоичныхДанныхФайлов, ВладелецФормыОбъект);
			КопироватьДанныеФормы(СтруктураЗагрузкиРасчета.ДанныеФормы, ЭтаФорма.ВладелецФормы.Объект); 
			
			Если СтруктураЗагрузкиРасчета.РезультатЗагрузки = Неопределено Тогда
				ТекстОшибки = "Ошибка загрузки потолка";				
				Если ЗначениеЗаполнено(СтруктураЗагрузкиРасчета.ОписаниеОшибки) Тогда
					ТекстОшибки = ТекстОшибки +": " + СтруктураЗагрузкиРасчета.ОписаниеОшибки;
				Иначе
					ТекстОшибки = ТекстОшибки +"!";
				КонецЕсли;
				ДобавитьВЖурналЗагрузки(ТекстОшибки, Истина);
				ПропущеноФайлов = ПропущеноФайлов + 1;  // #12872
			Иначе
				РезервироватьФайлы = Истина;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	
	
	Если РезервироватьФайлы Тогда // успешная загрузка
		МассивСообщенийКВыводу.Очистить();
		ОбменСПостроителемКлиентСервер.ПеренестиФайлыПостроителяВАрхив(КаталогРезервныхКопий, ПолноеИмяФайлаЗагрузки, СписокПутейКФайламКУдалению, МассивСообщенийКВыводу);
		Для каждого ЭлементМассива из МассивСообщенийКВыводу Цикл
			ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстОшибки, ЭлементМассива.ЭтоОшибка);
		КонецЦикла;		
	КонецЕсли;
	
	ДобавитьВЖурналЗагрузки("Завершена обработка файла " + СтруктураИмениФайла.ПолноеИмя);
	
	Возврат МассивПродукции;
	
КонецФункции

&НаСервере
Функция ОбработатьФайлНаСервере(ПолноеИмяФайлаЗагрузки)
	
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолноеИмяФайлаЗагрузки);
	МассивПродукции = Новый Массив;

	// загружаем файл
	ВыбранноеИмяФайла = СтруктураИмениФайла.ПолноеИмя;
	ДобавитьВЖурналЗагрузки("Начало обработки файла " + СтруктураИмениФайла.Имя);
	
	МассивСообщенийКВыводу = Новый Массив;
	СтруктураФайла = ОбменСПостроителемКлиентСервер.ПрочитатьФайлПостроителя(ПолноеИмяФайлаЗагрузки, МассивСообщенийКВыводу);
		
	Если СтруктураФайла = Неопределено Тогда
		Для каждого ЭлементМассива из МассивСообщенийКВыводу Цикл
			ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстОшибки, ЭлементМассива.ЭтоОшибка);
		КонецЦикла;
		Возврат МассивПродукции;
	КонецЕсли;
	
	СписокПутейКФайламКУдалению = Новый СписокЗначений;
	СписокДвоичныхДанныхФайлов = Новый СписокЗначений;
	
	МассивСообщенийКВыводу.Очистить();
	ОбменСПостроителемКлиентСервер.СформироватьСписокПутейКФайлам(СтруктураФайла, СписокПутейКФайламКУдалению, СписокДвоичныхДанныхФайлов, МассивСообщенийКВыводу);	
	Для каждого ЭлементМассива из МассивСообщенийКВыводу Цикл
		ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстОшибки, ЭлементМассива.ЭтоОшибка);
	КонецЦикла;
		
	РезультатЗагрузки = ОбменСEasyCeiling.ЗагрузитьРасчетEasyCeilingИзФайла(СтруктураФайла, СписокДвоичныхДанныхФайлов);
	МассивПродукции = РезультатЗагрузки.МассивПродукции;
	
	Для каждого ЭлементМассива из РезультатЗагрузки.МассивСообщений Цикл
		ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстСообщения, ЭлементМассива.ЭтоОшибка);	
	КонецЦикла;
	
	Если РезультатЗагрузки.ЕстьКритичныеОшибки Тогда			
		ПропущеноФайлов = ПропущеноФайлов + 1;
	Иначе
		Если НЕ РезультатЗагрузки.ЗаказОбновлен Тогда
			КоличествоНовыхЗаказов = КоличествоНовыхЗаказов + 1;
		Иначе
			КоличествоОбновленныхЗаказов = КоличествоОбновленныхЗаказов + 1;
		КонецЕсли;
		
		//делаем резервные копии и удаляем файлы
		МассивСообщенийКВыводу.Очистить();
		ОбменСПостроителемКлиентСервер.ПеренестиФайлыПостроителяВАрхив(КаталогРезервныхКопий, ПолноеИмяФайлаЗагрузки, СписокПутейКФайламКУдалению, МассивСообщенийКВыводу);
		Для каждого ЭлементМассива из МассивСообщенийКВыводу Цикл
			ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстОшибки, ЭлементМассива.ЭтоОшибка);
		КонецЦикла;
		
	КонецЕсли;
	
	ДобавитьВЖурналЗагрузки("Завершена обработка файла " + СтруктураИмениФайла.Имя);
	
	Возврат МассивПродукции;
	
КонецФункции

// Параметры:
// - ФайлДвоичныеДанные - строка (ini файл), структура (json
&НаСервере
Функция ЗагрузитьРасчетEasyCeilingИзФайлаВФорму(СтруктураФайла, СписокДвоичныхДанныхФайлов, ДанныеФормы)
		  
	Результат = ОбменСEasyCeiling.ЗагрузитьРасчетEasyCeilingИзФайла(СтруктураФайла, СписокДвоичныхДанныхФайлов, ДанныеФормы);
	Результат.Вставить("ДанныеФормы", ДанныеФормы);		
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗагрузитьРасчетВФормуДокументаРозницы(СтруктураФайла, СписокДвоичныхДанныхФайлов, ДанныеФормы)
	
	ОписаниеОшибки = "";
	РезультатЗагрузки = Документы.ЗаказДоговор.СоздатьНоменклатуруПоФайлуНаСервере(ДанныеФормы, СтруктураФайла, СписокДвоичныхДанныхФайлов, Комната, УчитыватьНДС, ВМатериалы, ОписаниеОшибки);
	Результат = Новый Структура;
	Результат.Вставить("ДанныеФормы", ДанныеФормы);	
	Результат.Вставить("РезультатЗагрузки", РезультатЗагрузки);
	Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки); // #12872 +ОписаниеОшибки
	Если НЕ РезультатЗагрузки = Неопределено Тогда
		ПоследнийПотолок = РезультатЗагрузки;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#Область ИдетПакетнаяЗагрузка

&НаКлиенте
Процедура ПоказатьИдетПакетнаяЗагрузка()
	
	ПрочитатьКонстантыПакетнойЗагрузки();	
	Элементы.ГруппаИдетПакетнаяЗагрузкаРасчетов.Видимость = Истина;
	Элементы.ГруппаОсновная.Видимость = Ложь;
	
	Если НЕ ВремяУстановкиПризнакаЗагрузки = Дата(1, 1, 1) Тогда
		РазницаВремениЗапуска = ТекущаяДата() - ВремяУстановкиПризнакаЗагрузки;
		Если РазницаВремениЗапуска < 180 Тогда
			Элементы.ПродолжитьЗагрузку.Доступность = Ложь;
			Элементы.ГруппаКнопкаБудетДоступна.Видимость = Истина;
			ПодключитьОбработчикОжидания("ПроверитьВремяУстановкиПризнакаЗагрузки", 1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВремяУстановкиПризнакаЗагрузки() Экспорт
	РазницаВремениЗапуска = ТекущаяДата() - ВремяУстановкиПризнакаЗагрузки;
	Если РазницаВремениЗапуска < 180 Тогда
		Элементы.ДекорацияСекунд.Заголовок = "" + (180-РазницаВремениЗапуска) + " сек."; 
	Иначе
		Элементы.ГруппаКнопкаБудетДоступна.Видимость = Ложь;
		Элементы.ПродолжитьЗагрузку.Доступность = Истина;
		ОтключитьОбработчикОжидания("ПроверитьВремяУстановкиПризнакаЗагрузки");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКонстантыПакетнойЗагрузки()

	ВремяУстановкиПризнакаЗагрузки = Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилингВремя.Получить();
	ПользовательУстановкиПризнака = Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилингПользователь.Получить();
	//Элементы.ФормаСброситьФлагЗагрузкиИЗакрыть.Доступность = Истина;
	//Элементы.ДекорацияИдетЗагрузка.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Функция СброситьФлагЗагрузкиНаСервере()
	
	Попытка
		Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилинг.Установить(Ложь);
		Возврат Истина;		
	Исключение
		Сообщить("Не удается сбросить флаг загрузки: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьЗагрузку(Команда)
	Если СброситьФлагЗагрузкиНаСервере() Тогда
		Элементы.ГруппаИдетПакетнаяЗагрузкаРасчетов.Видимость = Ложь;
		Элементы.ГруппаОсновная.Видимость = Истина;
		// запускаем обработку файлов
		ПодключитьОбработчикОжидания("ОбработатьФайлы", 0.3, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Процедура ДобавитьВЖурналЗагрузки(Текст, ЭтоОшибка = Ложь, ВыделитьЖирным = Ложь)
	
	Если ЭтоОшибка Тогда
		Текст = СтрЗаменить(Текст, Символы.ПС, " "); // иначе не выделяет весь текст, а только последнюю строку
	КонецЕсли;
	
	ВставленныйТекст = ЖурналЗагрузки.Добавить(Формат(ТекущаяДатаСеанса(), "ДЛФ=DT") + " " + Текст, ТипЭлементаФорматированногоДокумента.Текст);
	Если ЭтоОшибка Тогда
		ВставленныйТекст.Шрифт = Новый Шрифт(,,Истина);
		ВставленныйТекст.ЦветТекста = WebЦвета.Красный;
		ЕстьОшибки = Истина;
	КонецЕсли;
	Если ВыделитьЖирным Тогда
		ВставленныйТекст.Шрифт = Новый Шрифт(,,Истина);
	КонецЕсли;
	ЖурналЗагрузки.Добавить(, ТипЭлементаФорматированногоДокумента.ПереводСтроки); 

КонецПроцедуры

&НаСервере
Функция ИнициализироватьКаталогиЗагрузок()
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ЕстьОшибки", Ложь);
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ПереноситьВАрхивРасчетыПостроителяПроизводство, ПереноситьФайлыВАрхивПриЗагрузкеПотолкаИзПостроителяВРознице,
					|КаталогВыгрузокИзИзиСилинг, КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг, КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница");
		
	Если НЕ ЭтоРозница Тогда		
		
		ПапкиВКарточкеПользователя = Константы.ИндивидуальныеКаталогиЗагрузкиЧертежейИзEasyCeiling.Получить();
		
		Если ПакетнаяЗагрузка Тогда
			Если НЕ ПапкиВКарточкеПользователя Тогда
				КаталогЗагрузки = СокрЛП(Константы.КаталогВыгрузокИзИзиСилинг.Получить());
			Иначе
				КаталогЗагрузки = СокрЛП(РеквизитыПользователя.КаталогВыгрузокИзИзиСилинг);
			КонецЕсли;
			
			Если ПустаяСтрока(КаталогЗагрузки) Тогда
				ДобавитьВЖурналЗагрузки("В настройках " + ?(ПапкиВКарточкеПользователя, "пользователя", "программы") + " в разделе ""Загрузка из построителя (производство)"" не указан ""Каталог выгрузок из построителя"". Загрузка прервана", Истина);
				СтруктураВозврата.Вставить("ЕстьОшибки", Истина);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ПапкиВКарточкеПользователя Тогда
			Если Константы.ПереноситьВАрхивРасчетыПостроителяПроизводство.Получить() Тогда
				КаталогРезервныхКопий = СокрЛП(Константы.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг.Получить());
				Если ПустаяСтрока(КаталогРезервныхКопий) Тогда
					ДобавитьВЖурналЗагрузки("В настройках программы в разделе ""Загрузка из построителя (производство)"" не указана ""Папка резервных копий"". Загрузка прервана", Истина);
					СтруктураВозврата.Вставить("ЕстьОшибки", Истина);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если РеквизитыПользователя.ПереноситьВАрхивРасчетыПостроителяПроизводство Тогда
				КаталогРезервныхКопий = СокрЛП(РеквизитыПользователя.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг);
				Если ПустаяСтрока(КаталогРезервныхКопий) Тогда
					ДобавитьВЖурналЗагрузки("В настройках пользователя в разделе ""Загрузка из построителя (производство)"" не указана ""Папка резервных копий"". Загрузка прервана", Истина);
					СтруктураВозврата.Вставить("ЕстьОшибки", Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
				
	Иначе
		
		ПапкиВКарточкеПользователя = Константы.ПапкиОпределяютсяВКарточкеПользователяРозница.Получить();
		
		Если ПапкиВКарточкеПользователя Тогда
			Если РеквизитыПользователя.ПереноситьФайлыВАрхивПриЗагрузкеПотолкаИзПостроителяВРознице Тогда
				КаталогРезервныхКопий = РеквизитыПользователя.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница;
				Если ПустаяСтрока(КаталогРезервныхКопий) Тогда
					ДобавитьВЖурналЗагрузки("В настройках программы в разделе ""Загрузка из построителя (розница)"" не указана ""Папка резервных копий"". Загрузка прервана", Истина);
					СтруктураВозврата.Вставить("ЕстьОшибки", Истина);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если Константы.ПереноситьФайлыВАрхивПриЗагрузкеПотолкаИзПостроителяВРознице.Получить() Тогда
				КаталогРезервныхКопий = Константы.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница.Получить();
				Если ПустаяСтрока(КаталогРезервныхКопий) Тогда
					ДобавитьВЖурналЗагрузки("В настройках пользователя в разделе ""Загрузка из построителя (розница)"" не указана ""Папка резервных копий"". Загрузка прервана", Истина);
					СтруктураВозврата.Вставить("ЕстьОшибки", Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
						
	КонецЕсли;
		
	СтруктураВозврата.Вставить("КаталогЗагрузки", КаталогЗагрузки);
	СтруктураВозврата.Вставить("КаталогРезервныхКопий", КаталогРезервныхКопий);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция КонстантыИдетПакетнаяЗагрузкаРасчетовИзИзиСилингПолучить()
	Возврат Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилинг.Получить();
КонецФункции

&НаСервере
Процедура КонстантыИдетПакетнаяЗагрузкаРасчетовИзИзиСилингУстановить(Значение);
	Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилинг.Установить(Значение);
	Если (Значение) Тогда
		Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилингВремя.Установить(ТекущаяДатаСеанса());
		Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилингПользователь.Установить(Пользователи.ТекущийПользователь());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция НайтиФайлыНаКлиенте()
	
	Возврат ОбменСПостроителемКлиентСервер.НайтиФайлыПостроителя(КаталогЗагрузки);
	
КонецФункции

&НаСервере
Функция НайтиФайлыНаСервере()
	
	Возврат ОбменСПостроителемКлиентСервер.НайтиФайлыПостроителя(КаталогЗагрузки);
	
КонецФункции

#КонецОбласти
