
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Для внутреннего использования.
// 
Процедура ЗафиксироватьРезультатВыполнения(УчетнаяЗапись, ДатаНачала, ЕстьОшибки = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		РезультатВыполнения = ?(ЕстьОшибки, Перечисления.РезультатыВыполненияОбмена.Ошибка, Перечисления.РезультатыВыполненияОбмена.Выполнено);
		//Блокировка = Новый БлокировкаДанных();
		//ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияПроверокЭлектронныхПочт");
		//ЭлементБлокировки.УстановитьЗначение("УчетнаяЗапись", УчетнаяЗапись);
		//Блокировка.Заблокировать();
				
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УчетнаяЗапись = УчетнаяЗапись;
		МенеджерЗаписи.РезультатВыполнения = РезультатВыполнения;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.УчетнаяЗапись = УчетнаяЗапись;
		МенеджерЗаписи.РезультатВыполнения = РезультатВыполнения;
		МенеджерЗаписи.ПоследнийЗапускНачало = ДатаНачала;
		МенеджерЗаписи.ПоследнийЗапускЗавершение = ТекущаяДатаСеанса();
		
		МенеджерЗаписи.Записать(Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
