
&НаСервере
Процедура СформироватьНаСервере()
	Если ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День Тогда
		ДатаНачала = ДатаКонца - 60*60*24;
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Неделя Тогда
		ДатаНачала = ДатаКонца - 60*60*24 * 13;
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Месяц Тогда
		ДатаНачала = ДобавитьМесяц(НачалоМесяца(ДатаКонца), -1);
	КонецЕсли;
	
	Данные = Новый ТаблицаЗначений;
	кч = Новый КвалификаторыЧисла(15,2);
	Данные.Колонки.Добавить("ДатаНачала", новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("ДатаКонца", новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("Значение", новый ОписаниеТипов("Число",кч));
	Данные.Колонки.Добавить("ЕстьЗначение", новый ОписаниеТипов("Булево"));
	Данные.Колонки.Добавить("РеальныеДанные", новый ОписаниеТипов("Булево"));
	Данные.Колонки.Добавить("Квота", новый ОписаниеТипов("Число",кч));
	Данные.Колонки.Добавить("ДанныеВведены", новый ОписаниеТипов("Булево"));

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика1,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика2,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика3,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЗаголовокДиаграммы,
	               |	ОргСхема.Ссылка КАК Пост,
	               |	&ПериодДетализации КАК ПериодДетализации,
	               |	0 КАК СдвигПериода,
	               |	0 КАК НомерТекущейДаты,
	               |	ОргСхемаСотрудники.ФизЛицо КАК Сотрудник,
	               |	12345 КАК Уровень,
	               |	ЛОЖЬ КАК Рост,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики.ПеревернутаяСтатистика КАК ПеревернутаяСтатистика
	               |ИЗ
	               |	Справочник.ИА_НастройкиРабочегоСтолаСтатистик.Статистики КАК ИА_НастройкиРабочегоСтолаСтатистикСтатистики
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОргСхема КАК ОргСхема
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
	               |			ПО ОргСхема.Ссылка = ОргСхемаСотрудники.Ссылка
	               |				И (ОргСхемаСотрудники.НомерСтроки = 1)
	               |		ПО ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Ссылка = ОргСхема.НастройкаСтатистик
	               |ГДЕ
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.НомерСтроки = 1
	               |	И ОргСхема.ПометкаУдаления = ЛОЖЬ
	               |	И ОргСхема.Ссылка В ИЕРАРХИИ(&Организация)
	               |	И (ОргСхема.ТипТерминала = &ТипТерминала
	               |			ИЛИ &ТипТерминала = ЗНАЧЕНИЕ(Перечисление.ТипТерминалаОргСхемы.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипТерминала", ОтборТипТерминала);
	Запрос.УстановитьПараметр("ПериодДетализации", ПериодДетализации);
	
	РезДер = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	РезДер.Колонки.Добавить("Данные");
	
	Для каждого стр из РезДер.Строки Цикл
		стр.Данные = Данные.Скопировать(); 
		стр.Уровень = стр.Пост.Уровень();
	КонецЦикла;

	
	ЭмулОбъект = Новый Структура("ДатаНачала,ДатаКонца,Настройка", ДатаНачала, ДатаКонца,Справочники.ИА_НастройкиРабочегоСтолаСтатистик.ПустаяСсылка());
	
	Выходные = ИА_Защита_Статистика.ПолучитьВыходныеЗаПериод(ДатаНачала, ДатаКонца);
	ИА_Статистики.ПолучитьТочки(ЭмулОбъект,Выходные,РезДер);
	
	
	рез.Очистить();
	Для каждого стр из РезДер.Строки Цикл
		Новстр = Рез.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		Новстр.ПредЗн = стр.данные[0].Значение;
		Новстр.ТекЗн = стр.данные[1].Значение;
		
		Если (Новстр.ТекЗн>Новстр.ПредЗн и не стр.ПеревернутаяСтатистика) или (Новстр.ТекЗн<Новстр.ПредЗн и стр.ПеревернутаяСтатистика) Тогда
			Новстр.Рост = истина;
		КонецЕсли;
	КонецЦикла;
	
	рез.Сортировать("Рост УБЫВ,Уровень");
	//
	ТабДок.Очистить();
	обОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = обОтчет.ПолучитьМакет("Макет");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ЗаполнитьЗначенияСвойств(ОблШапка.параметры, ЭтаФорма);
	ТабДок.Вывести(ОблШапка);
	
	НСтроки = рез.НайтиСтроки(Новый Структура("Рост", Истина));
	
	МассСотр = Новый Массив;
	Для каждого стр из НСтроки Цикл
		Если ЗначениеЗаполнено(Стр.Сотрудник) и МассСотр.Найти(Стр.Сотрудник) = Неопределено Тогда
			МассСотр.Добавить(Стр.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ОблСтрока = Макет.ПолучитьОбласть("Строка1");
	ОблСтрока.параметры.Пост = "Растущие статистики (" + НСтроки.Количество() + "):";
	ОблСтрока.параметры.Сотрудник = "(" + МассСотр.Количество() + ")";
	ОблСтрока.Область("R1C2:R1C2").расшифровка =МассСотр; 
	ТабДок.Вывести(ОблСтрока);
		
	Для каждого стр из НСтроки Цикл
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		ЗаполнитьЗначенияСвойств(ОблСтрока.параметры, стр);
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
	
	//
	
	НСтроки = рез.НайтиСтроки(Новый Структура("Рост", ложь));
	
	МассСотр = Новый Массив;
	Для каждого стр из НСтроки Цикл
		Если ЗначениеЗаполнено(Стр.Сотрудник) и МассСотр.Найти(Стр.Сотрудник) = Неопределено Тогда
			МассСотр.Добавить(Стр.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ОблСтрока = Макет.ПолучитьОбласть("Строка1");
	ОблСтрока.параметры.Пост = "Падающие статистики (" + НСтроки.Количество() + "):";
	ОблСтрока.параметры.Сотрудник = "(" + МассСотр.Количество() + ")";
	ОблСтрока.Область("R1C2:R1C2").расшифровка =МассСотр; 
	ТабДок.Вывести(ОблСтрока);
		
	Для каждого стр из НСтроки Цикл
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		ЗаполнитьЗначенияСвойств(ОблСтрока.параметры, стр);
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ДатаКонца = Дата(1,1,1) или ПериодДетализации.Пустая() Тогда
		ПоказатьПредупреждение(,"Укажите конец периода отчета и анализируемый период!");
		возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры
