
#Область РаботаСФайломIni

// Функция - ПрочитатьФайлIni
//
// Параметры:
//  ПолныйПутьКФайлу - 	полный путь к файлу построителя 
// 
// Возвращаемое значение:
//   Неопределено - если не удалось прочитать файл
//   Структура, где ключ - название секций, а значение - список значений с параметрами/значениями параметров
//
Функция ПрочитатьФайлIni(Знач ПолныйПутьКФайлу, МассивСообщений = Неопределено) Экспорт //нна
	
	Результат = Новый Структура("ТипФайла", "INI");;
	
	ТекстФайлIni = Новый ТекстовыйДокумент;
	ФайлПостроителя = Новый Файл(ПолныйПутьКФайлу);
	ФорматФайловПостроителя =  ОбменСEasyCeiling.ФорматФайловПостроителя();
	
	Если ФайлПостроителя.Существует() Тогда
		Попытка
			Если ПустаяСтрока(ФорматФайловПостроителя) Тогда
				ТекстФайлIni.Прочитать(ПолныйПутьКФайлу);
			Иначе
				ТекстФайлIni.Прочитать(ПолныйПутьКФайлу, ФорматФайловПостроителя);
			КонецЕсли;
		Исключение
			ДобавитьВМассивСообщений(МассивСообщений, "Не удалось прочитать файл: " + ОписаниеОшибки(), Истина);
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Результат.Вставить("ДанныеФайлаИмпорта", ТекстФайлIni.ПолучитьТекст());
	
	СписокЗначенийСекции = Новый СписокЗначений;
	КлючТекущейСекции = "";
	
	КоличествоСтрокФайла = ТекстФайлIni.КоличествоСтрок();
	Если КоличествоСтрокФайла <= 1 Тогда
		ДобавитьВМассивСообщений(МассивСообщений, "Файл не содержит данных: " + ПолныйПутьКФайлу, Истина);
		Возврат Неопределено;
	КонецЕсли;
	
	Для Индекс = 1 По КоличествоСтрокФайла Цикл
		СтрокаФайлаIni = СокрЛП(ТекстФайлIni.ПолучитьСтроку(Индекс));
		
		Если ЭтоСекцияIniФайла(СтрокаФайлаIni) Тогда
			ИмяСекции = Сред(СтрокаФайлаIni, 2, СтрДлина(СтрокаФайлаIni) - 2);
			Результат.Вставить(ИмяСекции, Новый СписокЗначений); //СписокЗначений, а не Структура потому что могут быть неуникальные параметры
			КлючТекущейСекции = ИмяСекции;
		Иначе
			ИмяПараметра = "";
			ЗначениеПараметра = "";
			ПрочитатьПараметрIni(СтрокаФайлаIni, ИмяПараметра, ЗначениеПараметра);
			Если НЕ ПустаяСтрока(ИмяПараметра) Тогда
				Результат[КлючТекущейСекции].Добавить(ИмяПараметра, ЗначениеПараметра);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции

// Функция определяет, является ли переданная в нее строка секцией INI-файла.
// Параметром секции являются парные скобки [ ].
//
// Параметры:
//  СтрокаФайлаIni - текстовая строка, по которой нужно определить, секция это
//             или нет.
//
// Возвращаемое значение:
//  Истина - это секция.
//  Ложь   - это не секция.
//
Функция ЭтоСекцияIniФайла(Знач СтрокаФайлаIni) Экспорт
	
	ТекстСтр = СокрЛП(СтрокаФайлаIni);
	
	Если Лев(ТекстСтр, 1) = "[" И Прав(ТекстСтр, 1) = "]" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

// Процедура из переданной в нее строки выделяет имя параметра и его значение.
//
// Параметры:
//  СтрокаФайлаIni    - текстовая строка, из которой нужно выделить свойства.
//  ИмяПараметра      - выходная переменная для хранения имени параметра.
//  ЗначениеПараметра - выходная переменная для хранения значения параметра.
// 
Процедура ПрочитатьПараметрIni(Знач СтрокаФайлаIni, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	ИмяПараметра       = "";	
	ЗначениеПараметра  = "";
	
	Разделитель        = "=";
	СимволКомментария  = ";";
	ТекстСтр           = СокрЛП(СтрокаФайлаIni);
	
	ПозицияРазделителя = Найти(ТекстСтр, Разделитель);
	
	Если Лев(ТекстСтр, 1) <> СимволКомментария Тогда
		Если ПозицияРазделителя > 0 Тогда
			ИмяПараметра      = Лев(ТекстСтр, ПозицияРазделителя - 1);
			
			Если СтрДлина(ТекстСтр) > (СтрДлина(ИмяПараметра) + 1) Тогда
				ЗначениеПараметра = Сред(ТекстСтр, ПозицияРазделителя + 1);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайломJson

// Функция - ПрочитатьФайлJson
//
// Параметры:
//  ПолныйПутьКФайлу - 	полный путь к файлу построителя 
// 
// Возвращаемое значение:
//   Неопределено - если не удалось прочитать файл
//   Структура - структура файла, прочитанная из JSON типовыми средствами
//
Функция ПрочитатьФайлJson(Знач ПолныйПутьКФайлу, МассивСообщений = Неопределено) Экспорт
	
	ФорматФайловПостроителя =  ОбменСEasyCeiling.ФорматФайловПостроителя("windows-1251");
	Попытка		
		ТекстJSON = Новый ЧтениеТекста(ПолныйПутьКФайлу, ФорматФайловПостроителя);
		ДанныеФайлаИмпорта = ТекстJSON.Прочитать();
		ТекстJSON.Закрыть();
			
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьФайл(ПолныйПутьКФайлу, ФорматФайловПостроителя);
			
		// Укажем названия реквизитов дат, которые необходимо преобразовать к дате
		МассивФорматаДат = новый Массив;
		//МассивФорматаДат.Добавить("Дата");
		//МассивФорматаДат.Добавить("ПланируемаяДата");
		
		#Если НЕ ВебКлиент Тогда 	
			ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Ложь, МассивФорматаДат, ФорматДатыJSON.ISO); //нна	
		#Иначе
			ДанныеJSON = ннаАдаптацияВебКлиента.ПрочитатьJSONСервер(ЧтениеJSON);	
		#КонецЕсли
		
				
		ЧтениеJSON.Закрыть();			
	Исключение 			
		ДобавитьВМассивСообщений(МассивСообщений, "Не удалось прочитать файл: " + ОписаниеОшибки(), Истина);
		Возврат Неопределено;			
	КонецПопытки;
		
	// Проверки корректности структуры в файле
	Если НЕ ДанныеJSON.Свойство("ВерсияФайла") Тогда
		ДобавитьВМассивСообщений(МассивСообщений, "В структуре файла отсутствует обязательное свойство ""ВерсияФайла"".", Истина);
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ДанныеJSON.Свойство("СписокЗаказов") Тогда
		ДобавитьВМассивСообщений(МассивСообщений, "В структуре файла отсутствует обязательное свойство ""СписокЗаказов"".", Истина);
		Возврат Неопределено;
	КонецЕсли;
	
	// Разбиваем данные по потолкам
	Для Каждого ТекущийЗаказ Из ДанныеJSON.СписокЗаказов Цикл		
		Если Не ТекущийЗаказ.Свойство("Потолки") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТекущийПотолок Из ТекущийЗаказ.Потолки Цикл
			
			// Переносим данные потолка в отдельную структуру и шапочные реквизиты заказа в структуру с потолком, чтобы в дальнейшем проще было их обрабатывать
			СтруктураПотолка = Новый Структура;
			СтруктураПотолка.Вставить("ДанныеФайлаИмпорта", ДанныеФайлаИмпорта);
			СтруктураПотолка.Вставить("ТипФайла", "JSON");
			
			Для Каждого ТекущееСвойствоПотолка Из ТекущийПотолок Цикл
				СтруктураПотолка.Вставить(ТекущееСвойствоПотолка.Ключ, ТекущееСвойствоПотолка.Значение);
			КонецЦикла;
			
			Для Каждого ТекущееСвойствоЗаказа Из ТекущийЗаказ Цикл				
				Если НРег(ТекущееСвойствоЗаказа.Ключ) = НРег("Потолки") Тогда
					Продолжить;
				КонецЕсли;				
				СтруктураПотолка.Вставить(ТекущееСвойствоЗаказа.Ключ, ТекущееСвойствоЗаказа.Значение);				
			КонецЦикла;
			
			// решили, что в 1 файле 1 потолок
			//МассивФайловПотолков.Добавить(СтруктураПотолка);
			Возврат СтруктураПотолка;	
			
		КонецЦикла;		
	КонецЦикла;
		
КонецФункции

#КонецОбласти

#Область ОбщиеПроцедурыИФункцииРаботыСФайлами

Функция ПрочитатьФайлПостроителя(Знач ПолныйПутьКФайлу, МассивСообщений = Неопределено) Экспорт
	
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолныйПутьКФайлу);
	
	// обработка JSON
	Если НРег(СтруктураИмениФайла.Расширение) = ".json" Тогда		
		СтруктураФайла = ОбменСПостроителемКлиентСервер.ПрочитатьФайлJson(ПолныйПутьКФайлу, МассивСообщений);
						
	// обработка INI
	ИначеЕсли НРег(СтруктураИмениФайла.Расширение) = ".ini" Тогда
		СтруктураФайла = ОбменСПостроителемКлиентСервер.ПрочитатьФайлIni(ПолныйПутьКФайлу, МассивСообщений);	
	КонецЕсли;
	
	Возврат СтруктураФайла;
	
КонецФункции
	
Процедура СформироватьСписокПутейКФайлам(СтруктураФайла, 
									СписокПутейКФайламКУдалению, СписокДвоичныхДанныхФайлов,
									МассивСообщений = Неопределено) Экспорт
									
	СписокПутейКФайлам = Новый СписокЗначений;
	
	МассивСекцийФайловКЗагрузке = ОбменСEasyCeiling.ПолучитьМассивВидовФайловКЗагрузке();
	МассивСекцийФайловКУдалению = ОбменСEasyCeiling.ПолучитьМассивВсехВидовФайловКЗагрузке();
		
	// JSON
	Если СтруктураФайла.ТипФайла = "JSON" Тогда
		
		Для Каждого СекцияФайлаКЗагрузке Из МассивСекцийФайловКЗагрузке Цикл			
			Если СтруктураФайла.Свойство(СекцияФайлаКЗагрузке) И ЗначениеЗаполнено(СтруктураФайла[СекцияФайлаКЗагрузке]) Тогда
				СписокПутейКФайлам.Добавить(СтруктураФайла[СекцияФайлаКЗагрузке], СекцияФайлаКЗагрузке);
			КонецЕсли;			
		КонецЦикла;
		
		Для Каждого СекцияФайлаКУдалению Из МассивСекцийФайловКУдалению Цикл			
			Если СтруктураФайла.Свойство(СекцияФайлаКУдалению) И ЗначениеЗаполнено(СтруктураФайла[СекцияФайлаКУдалению]) Тогда
				СписокПутейКФайламКУдалению.Добавить(СтруктураФайла[СекцияФайлаКУдалению], СекцияФайлаКУдалению);
			КонецЕсли;			
		КонецЦикла;
		
	// INI
	ИначеЕсли СтруктураФайла.ТипФайла = "INI" Тогда
		Для каждого КлючЗначениеСтруктуры из СтруктураФайла Цикл
			СписокЭлементовСекцииФайла = КлючЗначениеСтруктуры.Значение;
			Если НЕ ТипЗнч(СписокЭлементовСекцииФайла) = Тип("СписокЗначений") Тогда
				Продолжить;
			КонецЕсли;
			// перебор элементов списка
			Для каждого ЭлементСписка из СписокЭлементовСекцииФайла Цикл
				Если ПустаяСтрока(ЭлементСписка.Представление) Тогда
					Продолжить;
				КонецЕсли;
				
				ЭлементМассиваФайлов = МассивСекцийФайловКЗагрузке.Найти(ЭлементСписка.Значение);
				Если НЕ ЭлементМассиваФайлов = Неопределено Тогда
					СписокПутейКФайлам.Добавить(ЭлементСписка.Представление, ЭлементСписка.Значение); 	
				КонецЕсли;
				
				ЭлементМассиваФайлов = МассивСекцийФайловКУдалению.Найти(ЭлементСписка.Значение);
				Если НЕ ЭлементМассиваФайлов = Неопределено Тогда
					СписокПутейКФайламКУдалению.Добавить(ЭлементСписка.Представление, ЭлементСписка.Значение); 	
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
	КонецЕсли;
	
	АвтоматическиЗагружатьФайлы = ОбщийМодульВызовСервера.ПолучитьЗначениеКонстанты("АвтоматическиЗагружатьВБазуЧертежПотолкаИзИзиСилинг");
	
	Если АвтоматическиЗагружатьФайлы И СписокПутейКФайлам.Количество() > 0 Тогда
		Для каждого ЭлементСписка из СписокПутейКФайлам Цикл
			ФайлОС = Новый Файл(ЭлементСписка.Значение);
			Если ФайлОС.Существует() Тогда
				ДвоичныеДанныеФайла = ОбщийМодуль.Сериализовать(Новый ДвоичныеДанные(ЭлементСписка.Значение));
				Если НЕ ДвоичныеДанныеФайла = Неопределено Тогда
					СписокДвоичныхДанныхФайлов.Добавить(ДвоичныеДанныеФайла, ЭлементСписка.Представление);
				КонецЕсли;			
			Иначе
				ТекстОшибки = "В загружаемом расчете указан файл " + ЭлементСписка.Значение + ", но данный файл не найден. Файл загружен не будет";
				ДобавитьВМассивСообщений(МассивСообщений, ТекстОшибки, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеренестиФайлыПостроителяВАрхив(Знач КаталогРезервныхКопий, ПолныйПутьКФайлуПостроителя, СписокПутейКФайламКУдалению, МассивСообщений = Неопределено) Экспорт
	
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолныйПутьКФайлуПостроителя);
	
	//делаем резервные копии и удаляем файлы
	Если НЕ ПустаяСтрока(КаталогРезервныхКопий)Тогда		
		Попытка
			КаталогНаДиске = Новый Файл(КаталогРезервныхКопий);
			Если Не КаталогНаДиске.Существует() Тогда
				СоздатьКаталог(КаталогРезервныхКопий);
			КонецЕсли;
			КопироватьФайл(ПолныйПутьКФайлуПостроителя, КаталогРезервныхКопий + СтруктураИмениФайла.Имя);
			УдалитьФайлы(ПолныйПутьКФайлуПостроителя);
		Исключение
			ДобавитьВМассивСообщений(МассивСообщений, "Не удалось сделать резервную копию файла выгрузки по пути " + КаталогРезервныхКопий + " !" + ОписаниеОшибки(), Истина);
		КонецПопытки;
	Иначе
		Попытка
			УдалитьФайлы(ПолныйПутьКФайлуПостроителя);
		Исключение
			ДобавитьВМассивСообщений(МассивСообщений, "Не удалось удалить файл выгрузки по пути: " + ОписаниеОшибки(), Истина);
		КонецПопытки;
	КонецЕсли;
	
	Для каждого ЭлементСписка из СписокПутейКФайламКУдалению Цикл
		Если НЕ ПустаяСтрока(ЭлементСписка.Значение) Тогда
			Если НЕ ПустаяСтрока(КаталогРезервныхКопий)Тогда
				Попытка
					// копирование/удаление в одной транзакции
					ЧертежВремФайл = Новый Файл(ЭлементСписка.Значение);
					Если ЧертежВремФайл.Существует() Тогда
						КопироватьФайл(ЧертежВремФайл.ПолноеИмя, КаталогРезервныхКопий + ЧертежВремФайл.Имя);
						УдалитьФайлы(ЧертежВремФайл.ПолноеИмя);
					КонецЕсли;
				Исключение
					ДобавитьВМассивСообщений(МассивСообщений, "Не удалось сделать резервную копию файла " + ЧертежВремФайл.Имя + ": " + ОписаниеОшибки(), Истина);	
				КонецПопытки
			Иначе
				Попытка
					ЧертежВремФайл = Новый Файл(ЭлементСписка.Значение);
					Если ЧертежВремФайл.Существует() Тогда
						УдалитьФайлы(ЧертежВремФайл.ПолноеИмя);
					КонецЕсли;	
				Исключение
					ДобавитьВМассивСообщений(МассивСообщений, "Не удалось удалить файл выгрузки по пути: " + ОписаниеОшибки(), Истина);
				КонецПопытки;
			КонецЕсли;				
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти	
	
#Область СлужебныеПроцедурыИФункции

Функция НайтиФайлыПостроителя(КаталогЗагрузки) Экспорт
	
	МассивФайлов = НайтиФайлы(КаталогЗагрузки, "*.ini");
	МассивИменФайлов = Новый Массив;
	Для каждого Файл из МассивФайлов Цикл
		МассивИменФайлов.Добавить(Файл.ПолноеИмя);	
	КонецЦикла;
	
	МассивФайлов = НайтиФайлы(КаталогЗагрузки, "*.json");
	Для каждого Файл из МассивФайлов Цикл
		МассивИменФайлов.Добавить(Файл.ПолноеИмя);	
	КонецЦикла;
	
	Возврат МассивИменФайлов;
	
КонецФункции

Процедура ДобавитьВМассивСообщений(МассивСообщений, ТекстОшибки, ЭтоОшибка = Ложь)
	
	Если МассивСообщений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МассивСообщений.Добавить(Новый Структура("ТекстОшибки, ЭтоОшибка", ТекстОшибки, ЭтоОшибка)); 
	
КонецПроцедуры


#КонецОбласти
