
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() И НЕ значениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.ВидКонтрагента = Перечисления.ВидКонтрагента.ФизЛицо;
	КонецЕсли;
		
	Если Параметры.Ключ.Пустая() Тогда		
		Объект.ОсновнойДоговор = Неопределено;
		//nva 	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыПользователейСостав.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|ГДЕ
		|	ГруппыПользователейСостав.Ссылка В (&ГруппаПользователей)
		|	И ГруппыПользователейСостав.Пользователь.Ссылка = &Пользователь";
		
		МассивГруппПользователей = новый Массив;
		МассивГруппПользователей.Добавить(Справочники.ГруппыПользователей.НайтиПоНаименованию("Отдел продаж"));	
		МассивГруппПользователей.Добавить(Справочники.ГруппыПользователей.НайтиПоНаименованию("ПВЗ"));
		
		Запрос.УстановитьПараметр("ГруппаПользователей", МассивГруппПользователей);
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
		
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Объект.Родитель = Справочники.Контрагенты.НайтиПоКоду("000000069");
		КонецЕсли;	
	КонецЕсли;
	
	Параметры.Контрагент = Объект.Ссылка;
	СписокЗаказДоговоры.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);	
	СписокЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);	
	СписокПлатежныхДокументов.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);	
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Ложь);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "ГруппаКонтактнаяИнформация", ПоложениеЗаголовкаЭлементаФормы.Лево);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	УправлениеФормойНаСервере();
	
	КонтрольЗаполненияРеквизитов.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	ПолФизЛицаОбязателенКЗаполнению = Константы.ПолФизЛицаОбязателенКЗаполнению.Получить();
	Если ПолФизЛицаОбязателенКЗаполнению Тогда
		Элементы.Пол.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.Пол.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	ВыборНового = Параметры.ВыборНового;
	
	//#5401
	Элементы.ГруппаИсторияЗвонков.Видимость = СофтФон.ИспользуетсяИнтеграцияСIPАТС();
	РазрешеноИспользованиеIPТелефонии = СофтФон.ТекущемуПользователюРазрешеноИспользованиеIPТелефонии();
	Элементы.ИсторияЗвонковАТСПрослушатьЗвонок.Видимость = РазрешеноИспользованиеIPТелефонии;
	Элементы.ИсторияЗвонковАТССкачатьЗаписьЗвонка.Видимость = РазрешеноИспользованиеIPТелефонии;
	
	НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Ссылка, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсторияЗвонковАТС, "НомерФормат", СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(НомерТелефона));
	
	//СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	ВывестиДопЭлементыДляКонтактнойИнформации();
	
	ПредыдущееНаименование = Объект.Наименование;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	
	//Объект.ОсновнойТелефон_ТолькоЦифры = СофтФон.ОставитьТолькоЦифры(Объект.ОсновнойТелефон);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//проверяем на существование контрагента с таким наименованием	
	Если Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		УстановитьПривилегированныйРежим(Истина);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование = &Наименование
		|	И НЕ Контрагенты.ЭтоГруппа";
		Запрос.УстановитьПараметр("Наименование", СокрЛП(Объект.Наименование));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Контрагент не создан, в справочнике уже существует контрагент с таким наименованием!",,,,Отказ);
			УстановитьПривилегированныйРежим(Ложь);
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	// проверяем условие уникальности по ИНН
	Если  Объект.Ссылка.Пустая()
		И (Объект.ВидКонтрагента = Перечисления.ВидКонтрагента.ЮрЛицо
			ИЛИ Объект.ВидКонтрагента = Перечисления.ВидКонтрагента.ИндивидуальныйПредприниматель)
		И ЗначениеЗаполнено(ТекущийОбъект.ИНН)
	Тогда
		
		Запрос = Новый Запрос;
		УстановитьПривилегированныйРежим(Истина);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.ИНН,
		|	Контрагенты.КПП,
		|	Контрагенты.Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка <> &Ссылка
		|	И Контрагенты.ИНН = &ИНН
		|	" + ?(НЕ ЗначениеЗаполнено(ТекущийОбъект.КПП), "", " И (Контрагенты.КПП = &КПП ИЛИ Контрагенты.КПП = """")");
		
		Запрос.УстановитьПараметр("ИНН", ТекущийОбъект.ИНН);
		Запрос.УстановитьПараметр("КПП", ТекущийОбъект.КПП);
		Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Сообщить("Контрагент с ИНН существует: " + Выборка.Наименование + "!");
			УстановитьПривилегированныйРежим(Ложь);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПолФизЛицаОбязателенКЗаполнению Тогда
		Если ТекущийОбъект.ВидКонтрагента= Перечисления.ВидКонтрагента.ФизЛицо И НЕ ЗначениеЗаполнено(ТекущийОбъект.Пол) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Укажите пол физ.лица";
			Сообщение.Поле = "Пол";
			Сообщение.УстановитьДанные(ТекущийОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	КонтрольЗаполненияРеквизитов.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Объект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПроверитьИЗаполнитьДоговор();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если НЕ ЗавершениеРаботы И ЗначениеЗаполнено(Объект.Ссылка) И ВыборНового Тогда
		ОповеститьОВыборе(Объект.Ссылка);	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановкаКонтактногоЛицаПодписанта" И Параметр.Контрагент = Объект.Ссылка Тогда
		
		Объект.КонтактноеЛицоПодписант = Параметр.КонтактноеЛицо;
		Если НЕ Модифицированность Тогда
			Записать();
		КонецЕсли;
		Оповестить("УстановкаКонтактногоЛицаПодписантаВыполнена", Параметр.КонтактноеЛицо);
		
	ИначеЕсли ИмяСобытия = "УстановкаДУЛ" И Параметр.Контрагент = Объект.Ссылка Тогда
		
		Объект.ДокументУдостоверяющийЛичность = Параметр.ДУЛ;
		Если НЕ Модифицированность Тогда
			Записать();
		КонецЕсли;
		Оповестить("УстановкаДУЛВыполнена", Параметр.ДУЛ);
		
	ИначеЕсли ИмяСобытия = "ИзменилсяОсновнойДоговор" И Параметр = Объект.Ссылка Тогда
		Прочитать();
		
	ИначеЕсли ИмяСобытия = "ИзменилсяОсновнойСчет" И Параметр = Объект.Ссылка Тогда
		Прочитать();
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) ИЛИ Объект.НаименованиеПолное = ПредыдущееНаименование Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
 
	ПредыдущееНаименование = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	ОбновитьЭлементыДополнительныхРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	
	ИмяКоманды = Команда.Имя; //ВыполнитьИсходящийЗвонокКонтактнаяИнформацияПоле96e149bexee77x11eax80c9x04d9f5cee27d3
	ИмяКоманды = СтрЗаменить(ИмяКоманды, "ВыполнитьИсходящийЗвонок", "");
	
	НайденныеСтроки = ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", ИмяКоманды));
	Если НайденныеСтроки.Количество() > 0 Тогда	
		СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, НайденныеСтроки[0].Представление);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	
	ИмяКоманды = Команда.Имя;
	ИмяКоманды = СтрЗаменить(ИмяКоманды, "ОтправитьСообщениеTelegram", "");
	ИмяКоманды = СтрЗаменить(ИмяКоманды, "ОтправитьСообщениеViber", "");
	ИмяКоманды = СтрЗаменить(ИмяКоманды, "ОтправитьСообщениеWhatsApp", "");
	
	НайденныеСтроки = ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", ИмяКоманды));
	Если НайденныеСтроки.Количество() > 0 Тогда	
		МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, НайденныеСтроки[0].Представление);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УправлениеФормойНаСервере()
	
	ЭтоСтранаЕС = (Константы.ТелефонияСтрана.Получить() = Справочники.СтраныМира.Литва);
	Элементы.ИдентификационныйНомерПлательщикаЕвропейскогоНДС.Видимость = Ложь;
	
	//#15976
	НайденныеСтроки = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ИмяРеквизитаЮА = НайденныеСтроки[0].ИмяРеквизита;		
		Если НЕ Элементы.Найти(ИмяРеквизитаЮА) = Неопределено Тогда
			ЭлементЮА = Элементы[ИмяРеквизитаЮА];
			Если Объект.ВидКонтрагента = Перечисления.ВидКонтрагента.ФизЛицо
				ИЛИ Объект.ВидКонтрагента = Перечисления.ВидКонтрагента.ИндивидуальныйПредприниматель Тогда
				ЭлементЮА.Заголовок = "Адрес регистрации";
			Иначе
				ЭлементЮА.Заголовок = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидКонтрагента = Перечисления.ВидКонтрагента.ФизЛицо Тогда
		Элементы.Наименование.Заголовок = "ФИО";
		//Элементы.НаименованиеПолное.Видимость = Ложь;
		Элементы.Пол.Видимость = Истина;
		Элементы.ИНН.Видимость = Ложь;
		Элементы.КПП.Видимость = Ложь;
		Элементы.ОГРН.Видимость = Ложь;
		Элементы.ДатаРождения.Видимость = Истина;
		Элементы.ДокументУдостоверяющийЛичность.Видимость = Истина;
		//Элементы.ЮридическийАдрес.Видимость = Ложь;
		//Элементы.ВыбратьЮрАдрес.Видимость = Ложь;		
		//Элементы.ЮридическийАдрес.Заголовок = "Адрес регистрации";
	Иначе
		Элементы.Наименование.Заголовок = "Наименование";
		//Элементы.НаименованиеПолное.Видимость = Истина;
		Элементы.Пол.Видимость = Ложь;
		Элементы.ИНН.Видимость = Истина;
		Элементы.КПП.Видимость = Истина;
		Элементы.ОГРН.Видимость = Истина;
		Элементы.ДатаРождения.Видимость = Ложь;
		Элементы.ДокументУдостоверяющийЛичность.Видимость = Ложь;
		//Элементы.ЮридическийАдрес.Видимость = Истина;
		//Элементы.ВыбратьЮрАдрес.Видимость = Истина;		
		//Элементы.ЮридическийАдрес.Заголовок = "Юридический адрес";
		
		Элементы.ИдентификационныйНомерПлательщикаЕвропейскогоНДС.Видимость = ЭтоСтранаЕС;

	КонецЕсли;
	
	//Если ПраваПользователей.РазрешеноИспользованиеСофтФона() Тогда
	//	Элементы.ПозвонитьПоНомеру.Видимость = Истина;
	//Иначе
	//	Элементы.ПозвонитьПоНомеру.Видимость = Ложь;
	//КонецЕсли;
	
	Элементы.ГруппаПотолкиОнлайн.Видимость = ПраваПользователей.РазрешеноУправлениеПотолкиОнлайн();
	Если Элементы.ГруппаПотолкиОнлайн.Видимость Тогда
		Элементы.ПотолкиОнлайн_Пароль.Видимость = Объект.ПотолкиОнлайн_Актуализирован;
		Элементы.СгенерироватьПарольПотолкиОнлайн.Видимость = Объект.ПотолкиОнлайн_Актуализирован;
		
		ПочтаКлиента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Ссылка, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);

		//Если ПустаяСтрока(Объект.ОсновнойEMail) Тогда
		//	Элементы.ОсновнойEMail1.Заголовок = "НЕ УКАЗАН ОСНОВНОЙ E-MAIL КОНТРАГЕНТА";
		//	Элементы.ОсновнойEMail1.ЦветТекстаЗаголовка = WebЦвета.Красный;
		//	Элементы.ОсновнойEMail1.ШрифтЗаголовка = Новый Шрифт(Элементы.ОсновнойEMail1.ШрифтЗаголовка, ,, Истина);
		//Иначе
		//	Элементы.ОсновнойEMail1.Заголовок = "Логин";
		//	Элементы.ОсновнойEMail1.ЦветТекстаЗаголовка = WebЦвета.Черный;
		//	Элементы.ОсновнойEMail1.ШрифтЗаголовка = Новый Шрифт(Элементы.ОсновнойEMail1.ШрифтЗаголовка, ,, Ложь);
		//КонецЕсли;
		
		Элементы.ОтправитьДанныеЧерезСМС.Видимость = Объект.ПотолкиОнлайн_Актуализирован;
		ОтправкаДоступна = Объект.ПотолкиОнлайн_Актуализирован и не ПустаяСтрока(ПочтаКлиента) и не ПустаяСтрока(Объект.ПотолкиОнлайн_Пароль);
		Элементы.ОтправитьДанныеЧерезСМС.Доступность = ОтправкаДоступна; 		
		
	КонецЕсли;
	
	Элементы.НеОтправлятьСМС.Видимость = Константы.ОтправлятьСМСВсемКонтрагентамКромеПризнака.Получить(); //ПолучитьЗначениеКонстантыНеОтправлятьСМС();
	Элементы.ОтправлятьСМС.Видимость = Константы.ОтправлятьСМСТолькоКонтрагентамСПризнаком.Получить(); //ПолучитьЗначениеКонстантыОтправлятьСМС(); 
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДопЭлементыДляКонтактнойИнформации(Удалять = Ложь)
	
	//ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов
	
	ТаблицаКИ.Очистить();
	
	//НайденныйЭлементФормы = Элементы.Найти("ВыполнитьИсходящийЗвонок" + СтрокаКИ.ИмяРеквизита);
	//    Если НайденныйЭлементФормы <> Неопределено  Тогда
	//        Элементы.Удалить(НайденныйЭлементФормы);
	//	КонецЕсли;
		
	Для Каждого СтрокаКИ Из ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
		Если НЕ СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Продолжить;
		КонецЕсли;
		
		Если Команды.Найти("ВыполнитьИсходящийЗвонок" + СтрокаКИ.ИмяРеквизита) = Неопределено Тогда
			ГруппаЭлемента = Элементы["Группа" + СтрокаКИ.ИмяРеквизита];
 
			СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект, ГруппаЭлемента, СтрокаКИ.ИмяРеквизита);
			МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, ГруппаЭлемента, СтрокаКИ.ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;	
	
	// Добавим новые реквизиты формы
	////Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
	////	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	////КонецЕсли;
	////
	////Для Каждого СтрокаКИ Из ТаблицаКИ Цикл
	////	ЭтаФорма[СтрокаКИ.ИмяРеквизита] = СтрокаКИ.Представление;
	////	ГруппаЭлемента = Элементы.Добавить("Группа" + СтрокаКИ.ИмяРеквизита, Тип("ГруппаФормы"), Элементы.ГруппаКИ);
	////	ГруппаЭлемента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	////	ГруппаЭлемента.Отображение = ОтображениеОбычнойГруппы.Нет;
	////	ГруппаЭлемента.ОтображатьЗаголовок = ЛОЖЬ; 
	////	ГруппаЭлемента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	////
	////	Элемент = Элементы.Добавить(СтрокаКИ.ИмяРеквизита, Тип("ПолеФормы"), ГруппаЭлемента);
	////	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	////	Элемент.ПутьКДанным = СтрокаКИ.ИмяРеквизита;
	////	Элемент.ТолькоПросмотр = Истина;
	////	
	////	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект, ГруппаЭлемента, СтрокаКИ.ИмяРеквизита);
	////КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтрагентаПриИзменении(Элемент)
	
	ВидКонтрагентаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидКонтрагентаПриИзмененииНаСервере()	
	
	УправлениеФормойНаСервере();
	КонтрольЗаполненияРеквизитов.ПриИзмененииВлияющихРеквизитов(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаполнитьДоговор()
	Если Объект.ОсновнойДоговор.Пустая() Тогда
		Объект.ОсновнойДоговор = ОбщийМодуль.УстановитьОсновнойДоговорКонтрагента(Объект.Ссылка);
		Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСуществованиеКонтрагентаПоНаименованию(Наименование)
	
КонецФункции	

&НаКлиенте
Процедура СгенерироватьПарольПотолкиОнлайн(Команда)
	Пароль="";
	ГСЧ=Новый ГенераторСлучайныхЧисел();
	Для сч=1 по 8 Цикл
		слч=ГСЧ.СлучайноеЧисло(97,122);
		Если ((слч % 2) = 0 ) Тогда
			слч=ГСЧ.СлучайноеЧисло(0,9);
			Пароль=Пароль+слч;
			Продолжить;
		КонецЕсли;
		Пароль=Пароль+Символ(слч);
	КонецЦикла;
	Объект.ПотолкиОнлайн_Пароль = Пароль;
КонецПроцедуры

&НаКлиенте
Процедура ПотолкиОнлайн_АктуализированПриИзменении(Элемент)
	
	//НАЧАЛО Гарипов Р.А. 25.10.2016  Перенес обновление формы вниз, чтобы кнопка отправки пароля 
	//								  правильно отразилась на форме
	//ОбновитьФорму();
	//КОНЕЦ Гарипов Р.А. 25.10.2016
	
	Если Объект.ПотолкиОнлайн_Актуализирован Тогда
		СгенерироватьПарольПотолкиОнлайн(Неопределено);
	КонецЕсли;
	
	//НАЧАЛО Гарипов Р.А. 25.10.2016	
	УправлениеФормойНаСервере();
	//КОНЕЦ Гарипов Р.А. 25.10.2016
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойEMailПриИзменении(Элемент)
	УправлениеФормойНаСервере();
КонецПроцедуры

&НаСервере
Функция ОтправитьДанныеЧерезСМСНаСервере()
	
	ПочтаКлиента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Ссылка, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
	НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Ссылка, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);

	НДок = Документы.ОтправкаСМС.СоздатьДокумент();
	НДок.Дата = ТекущаяДатаСеанса();
	НДок.ТекстСообщения = "Доступ в онлайн-потолки. Адрес: " + Константы.АдресДилерскогоСайта.Получить() + ", Логин: " 
						+ ПочтаКлиента + ", Пароль: " + Объект.ПотолкиОнлайн_Пароль;
	НС = НДок.Получатели.Добавить();
	НС.Контрагент = Объект.Ссылка;
	НС.НомерТелефона = РаботаССМС.УбратьСимволыИзНомераТелефона(НомерТелефона);
	НДок.Записать();
	Возврат НДок.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьДанныеЧерезСМС(Команда)
	
	ДокументСсылка = ОтправитьДанныеЧерезСМСНаСервере();
	
	П = Новый Структура ("Ключ", ДокументСсылка);
    Форма = ПолучитьФорму("Документ.ОтправкаСМС.Форма.ФормаДокумента",п);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказДоговорыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	   ОткрытьЗначение(Элементы.СписокЗаказДоговоры.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДетализацияВзаиморасчетов(Команда)
	ПараметрыОтчета = Новый Структура("Отбор, СформироватьПриОткрытии", 
                                    Новый Структура("Контрагент", Объект.Ссылка), 
                                    Истина);									
	//ПараметрыОтчета = Новый Структура;
	//ПараметрыОтчета.Вставить("Контрагент",Объект.Ссылка);
	ОткрытьФорму("Отчет.ДетализацияВзаиморасчетовСКонтрагентом.Форма", ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетВедомостьПоВзаиморасчетамПоЗаказДоговорам(Команда)
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
                                    Новый Структура("Контрагент", Объект.Ссылка), 
                                    "ВедомостьВзаиморасчетовПоЗаказам", 
                                    Истина);

	ОткрытьФорму("Отчет.ВедомостьВзаиморасчетовПоЗаказам.Форма", 
				 ПараметрыФормы, 
				 ЭтаФорма, 
				 Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетВедомостьПоВзаиморасчетам(Команда)
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
                                    Новый Структура("Контрагент", Объект.Ссылка), 
                                    "ВедомостьПоВзаиморасчетамСКонтрагентами", 
                                    Истина);

	ОткрытьФорму("Отчет.ВедомостьПоВзаиморасчетамСКонтрагентами.Форма", 
				 ПараметрыФормы, 
				 ЭтаФорма, 
				 Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетВедомостьПоВзаиморасчетамВВалюте(Команда)
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
                                    Новый Структура("Контрагент", Объект.Ссылка), 
                                    "ВедомостьПоВзаиморасчетамСКонтрагентамиВВалюте", 
                                    Истина);

	ОткрытьФорму("Отчет.ВедомостьПоВзаиморасчетамСКонтрагентамиВВалюте.Форма", 
				 ПараметрыФормы, 
				 ЭтаФорма, 
				 Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПродажи(Команда)
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
                                    Новый Структура("Контрагент", Объект.Ссылка), 
                                    "Продажи", 
                                    Истина);

	ОткрытьФорму("Отчет.Продажи.Форма", 
				 ПараметрыФормы, 
				 ЭтаФорма, 
				 Новый УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОбщийЖурналДокументов(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Контрагент",Объект.Ссылка);
	ОткрытьФорму("ЖурналДокументов.ОбщийЖурналДокументов.Форма.ФормаСписка",ПараметрыОтчета);
КонецПроцедуры

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
	
	//++
	ВывестиДопЭлементыДляКонтактнойИнформации(Истина);
	//--
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	//Если ТекущаяСтраница.Имя = "ГруппаДополнительныеРеквизиты"
	//	И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
	//	СвойстваВыполнитьОтложеннуюИнициализацию();
	//	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	//КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказыПокупателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначение(Элементы.СписокЗаказыПокупателей.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПлатежныхДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.СписокПлатежныхДокументов.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПрослушатьЗаписьЗвонка(Команда)
	
	ТекДанные=Элементы.ИсторияЗвонковАТС.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СофтФонКлиент.ПрослушатьЗаписьЗвонка(ТекДанные.ИДВАТС, ТекДанные.ИД, ТекДанные.ЕстьЗапись, ТекДанные.ФайлЗаписиСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СкачатьЗаписьЗвонка(Команда)
	
	ТекДанные=Элементы.ИсторияЗвонковАТС.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СофтФонКлиент.СкачатьЗаписьЗвонка(ТекДанные.ИДВАТС, ТекДанные.ИД, ТекДанные.ЕстьЗапись, ТекДанные.ФайлЗаписиСсылка);

КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗвонковАТСПередУдалением(Элемент, Отказ)
	
	Если НЕ ДоступнаРольАдминистратора() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступнаРольАдминистратора()
	Возврат РольДоступна("АдминистраторСистемы");
КонецФункции



