
&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Количество", Количество);
	Результат.Вставить("Цена", Цена);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Параметры.Номенклатура;
	Количество = Параметры.Количество;
	Если Параметры.Свойство("Цена") Тогда 
		Цена = Параметры.Цена;
	КонецЕсли;
		
	Элементы.Количество.Видимость = Параметры.ЗапрашиватьКоличество;
	
	//Элементы.Цена.Видимость = Параметры.ЗапрашиватьЦену;
	Элементы.Цена.Видимость = Параметры.ЗапрашиватьЦену И НЕ ПараметрыСеанса.ТекущийПользователь.НеЗапрашиватьЦенуПриПодбореНоменклатуры;
	Если НЕ Параметры.ЗапрашиватьЦену Тогда
		ЭтаФорма.Заголовок = "Запрос количества";
	КонецЕсли;
КонецПроцедуры
