
Процедура ПередЗаписью(Отказ)
	
	//#7256
	//Если НЕ СсылочныйВидЦены И Ссылка.СсылочныйВидЦены Тогда
	//	ДополнительныеСвойства.Вставить("УбранПризнакСсылочныйВидЦены");
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Если СсылочныйВидЦены ИЛИ ДополнительныеСвойства.Свойство("УбранПризнакСсылочныйВидЦены") Тогда
	//	
	//	// Очистим все записи по ссылке
	//	НаборЗаписей = РегистрыСведений.СоответствиеВидовЦенЦенамУслугРаскроя.СоздатьНаборЗаписей();
	//	НаборЗаписей.Прочитать();
	//	
	//	КоличествоЗаписей = НаборЗаписей.Количество();
	//	Для Сч = 1 По КоличествоЗаписей Цикл
	//		Если НаборЗаписей[КоличествоЗаписей-Сч].ВидЦен = Ссылка Тогда
	//			НаборЗаписей.Удалить(КоличествоЗаписей-Сч);
	//		КонецЕсли;
	//	КонецЦикла;
	//	НаборЗаписей.Записать(Истина);
	//	
	//	Если НЕ ПометкаУдаления И ЗначениеЗаполнено(ВидЦеныНаУслугиПроизводства) Тогда		
	//		//Теперь сделаем новую запись
	//		НоваяЗапись = РегистрыСведений.СоответствиеВидовЦенЦенамУслугРаскроя.СоздатьМенеджерЗаписи();
	//		
	//		НоваяЗапись.Период = ВидЦеныНаУслугиПроизводства.Дата;
	//		НоваяЗапись.Валюта = ВидЦеныНаУслугиПроизводства.Валюта;
	//		НоваяЗапись.ВидОперации = Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен;
	//		НоваяЗапись.ВидЦен = Ссылка;
	//		НоваяЗапись.ЦеныУслугРаскроя = ВидЦеныНаУслугиПроизводства;
	//		
	//		НоваяЗапись.Записать();
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

