
Функция ПодборСопутствующейНоменклатурыНаСервере(Позиция) Экспорт
	
	ДопустимаяГлубинаВложенности = Константы.ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг.Получить();
	
	МассивЗаписей = ОбщийМодульВызовСервера.ПолучитьСписокСопутствующихТоваров(Позиция.Номенклатура, Позиция.ХарактеристикаНоменклатуры, Позиция.Количество, Позиция.УИСтроки);
	Для Каждого Запись Из МассивЗаписей Цикл
		ЗаписиКДобавлению = ОбщийМодульВызовСервера.ПолучитьСписокСопутствующихТоваров(Запись.Номенклатура, Запись.Характеристика, Запись.Количество, Запись.УИСтроки, Запись.Уровень);
		Если ЗаписиКДобавлению.Количество() > 0 Тогда
			Для каждого Добавление Из ЗаписиКДобавлению Цикл
				Если Добавление.Уровень <= ДопустимаяГлубинаВложенности Тогда
					   МассивЗаписей.Добавить(Добавление);
                КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	Возврат МассивЗаписей;
	
КонецФункции

