
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> Неопределено Тогда
		Если ИмяСобытия = "ОбновитьФорму" Тогда			
			Элементы.Список.Обновить();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ЗагрузкаИзФайла(Команда)	
	ОткрытьФорму("Обработка.ЗагрузкаКонтрагентовИзExcel.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаКонтрагентовИзExcel.Форма.ФормаВыгрузки");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 ОбновитьДоступностьКнопокЗагрузкиВыгрузкиИзЭксель();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьКнопокЗагрузкиВыгрузкиИзЭксель()
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("РазрешеноВыгружатьИЗагружатьКонтрагентовИзФайловXLS");
	
	Если РеквизитыПользователя.РазрешеноВыгружатьИЗагружатьКонтрагентовИзФайловXLS Тогда 
		Элементы.ФормаЗагрузкаИзФайла.Доступность = Истина;
		Элементы.ФормаСохранитьВФайл.Доступность = Истина;
	Иначе
		Элементы.ФормаЗагрузкаИзФайла.Доступность = Ложь;
		Элементы.ФормаСохранитьВФайл.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры


