#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработкаСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();

	// регистр ВзаиморасчетыСКонтрагентами Приход //Взаиморасчеты с контрагентами в валюте
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	
	ТабличныеЧастиУменьшение = Новый Массив;
	ТабличныеЧастиУменьшение.Добавить("УменьшениеДолга");
	ТабличныеЧастиУменьшение.Добавить("УменьшениеДолгаПоставщиков");

	ТабличныеЧастиУвеличение = Новый Массив;
	ТабличныеЧастиУвеличение.Добавить("УвеличениеДолга");
	ТабличныеЧастиУвеличение.Добавить("УвеличениеДолгаПоставщиков");

	Для каждого ИмяТЧ из ТабличныеЧастиУвеличение Цикл
		Для Каждого ТекСтрокаУвеличениеДолга Из ЭтотОбъект[ИмяТЧ] Цикл
			Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = ТекСтрокаУвеличениеДолга.Контрагент;
			Движение.Договор = ТекСтрокаУвеличениеДолга.Договор;
			//Движение.Документ = Ссылка;
			Движение.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ТекСтрокаУвеличениеДолга.Валюта, ВалютаУчета, Ссылка.Дата, ТекСтрокаУвеличениеДолга.Сумма);
			
			Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = ТекСтрокаУвеличениеДолга.Контрагент;
			Движение.Договор = ТекСтрокаУвеличениеДолга.Договор;
			Движение.Валюта = ТекСтрокаУвеличениеДолга.Валюта;
			Движение.Сумма = ТекСтрокаУвеличениеДолга.Сумма;
		КонецЦикла;
	КонецЦикла;

	// регистр ВзаиморасчетыСКонтрагентами Расход //Взаиморасчеты с контрагентами в валюте
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Для каждого ИмяТЧ из ТабличныеЧастиУменьшение Цикл
		Для Каждого ТекСтрокаУменьшениеДолга Из ЭтотОбъект[ИмяТЧ] Цикл
			Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = ТекСтрокаУменьшениеДолга.Контрагент;
			Движение.Договор = ТекСтрокаУменьшениеДолга.Договор;
			//Движение.Документ = Ссылка;
			Движение.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ТекСтрокаУменьшениеДолга.Валюта, ВалютаУчета, Ссылка.Дата, ТекСтрокаУменьшениеДолга.Сумма);
			
			Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
			Движение.ВидДвижения =ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = ТекСтрокаУменьшениеДолга.Контрагент;
			Движение.Договор = ТекСтрокаУменьшениеДолга.Договор;
			Движение.Валюта = ТекСтрокаУменьшениеДолга.Валюта;
			Движение.Сумма = ТекСтрокаУменьшениеДолга.Сумма;
		КонецЦикла;
	КонецЦикла;

	// #14354
	//РасчетыПоЗаказам 
	// расчеты с покупателем 
	СписокВидовДокументовПоКоторымВедутсяРасчеты = ОбщийМодуль.ПолучитьМассивТиповДокументовПоКоторымВедутсяРасчетыПоЗаказам();
	Движения.РасчетыПоЗаказам.Записывать = Истина;
	Для каждого ИмяТЧ из ТабличныеЧастиУвеличение Цикл
		Для Каждого ТекущаяСтрока Из ЭтотОбъект[ИмяТЧ] Цикл
			Если ТекущаяСтрока.Сумма = 0 ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДокументРасчета) Тогда
				Продолжить;
			КонецЕсли;
			НайденныйВидДокумента = СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(ТипЗнч(ТекущаяСтрока.ДокументРасчета));
			Если НайденныйВидДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.РасчетыПоЗаказам.Добавить();
			Движение.Период = Дата;
			Движение.Заказ = ТекущаяСтрока.ДокументРасчета;
			Движение.Контрагент = ТекущаяСтрока.ДокументРасчета.Контрагент; 
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход; //!
			Движение.Сумма = ТекущаяСтрока.Сумма;		
		КонецЦикла;
	КонецЦикла;
	
	Для каждого ИмяТЧ из ТабличныеЧастиУменьшение Цикл
		Для Каждого ТекущаяСтрока Из ЭтотОбъект[ИмяТЧ] Цикл
			Если ТекущаяСтрока.Сумма = 0 ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДокументРасчета) Тогда
				Продолжить;
			КонецЕсли;
			НайденныйВидДокумента = СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(ТипЗнч(ТекущаяСтрока.ДокументРасчета));
			Если НайденныйВидДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.РасчетыПоЗаказам.Добавить();
			Движение.Период = Дата;
			Движение.Заказ = ТекущаяСтрока.ДокументРасчета;
			Движение.Контрагент = ТекущаяСтрока.ДокументРасчета.Контрагент; 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход; //!
			Движение.Сумма = ТекущаяСтрока.Сумма;		
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
