#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() или Объект.Параметры.Количество() = 0 Тогда
		//заполним шапку
		Если Объект.Ссылка = Справочники.ПравилаОпределенияВидаПотолка.Отрез Тогда		
			Объект.Наименование = "Отрез";
		//ИначеЕсли Объект.Ссылка = Справочники.ПравилаОпределенияВидаПотолка.ТиповойОтрез Тогда		
		//	Объект.Наименование = "Типовой отрез";
		КонецЕсли;
		
		//заполним табличну часть возможными параметрами при загрузке из EasyCeiling или NewMatros
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "Организация";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "Контрагент";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "НомерРасчета";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "КоличествоПродукция";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "КоличествоУглов";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "МатериалЦвет";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "МатериалМатериал";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "МатериалКаталог";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "КоличествоРасход";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "КоличествоВыработка";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "МатериалГарпун";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "КоличествоГарпун";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "ПериметрКривых";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "ПериметрВырезов";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "ВыполненаЦентровкаШва";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "ЧертежПокупатель";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "ШиринаПолотна";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "ДлинаВырезаApply";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "ПлощадьФотопечати";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "ДлинаШвов";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "ДлинаПользовательскихШвов";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "ЭтоКомбинированныйПотолок";
		НоваяСтрока = Объект.Параметры.Добавить();
		НоваяСтрока.Имя = "ИндексПотолка";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПараметрыЗначениеПриИзменении(Элемент)
	Если ПустаяСтрока(Элементы.Параметры.ТекущиеДанные.Значение) Тогда
		Элементы.Параметры.ТекущиеДанные.Использовать = Ложь;
	Иначе
		Элементы.Параметры.ТекущиеДанные.Использовать = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыИспользоватьПриИзменении(Элемент)
	
	Если НЕ Элементы.Параметры.ТекущиеДанные.Использовать Тогда
		Элементы.Параметры.ТекущиеДанные.Значение = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти