Функция СформироватьТекстЗапроса() Экспорт
    НаборЗаписей = РегистрыНакопления.ИА_СредстваНаФондах.СоздатьНаборЗаписей();
    МассивМДДокументов = ИА_БФС.МД_ПолучитьРегистраторов(НаборЗаписей);
    
    ТекстЗапросаДляВыбораВсехДокументов         = "";
    ТекстЗапросаДляВыбораДокументовССуммами     = "";
    МассивТиповРасход = Метаданные.ПодпискиНаСобытия.ИА_ОбработкаПроведенияПлатежки.Источник.Типы();
    МассивТиповПриход = Метаданные.ПодпискиНаСобытия.ИА_ОбработкаПроведенияВходящейПлатежки.Источник.Типы();
    ПервыйШагЦикла = Истина;
    ПервыйШагЦикла2 = Истина;
    Для каждого МДДок Из МассивМДДокументов Цикл
        Если МДДок.ТабличныеЧасти.Найти("ИА_Фонды") = Неопределено
            ИЛИ МДДок.ТабличныеЧасти.Найти("ИА_ЗаказыНаПриобретение") = Неопределено Тогда
        	Продолжить;
        КонецЕсли;
        
        ТекстЗапросаДляВыбораВсехДокументов = ТекстЗапросаДляВыбораВсехДокументов +
        " ОБЪЕДИНИТЬ ВСЕ
        |   ВЫБРАТЬ "  + ?(ПервыйШагЦикла, "РАЗРЕШЕННЫЕ", "") + "
        |   Т.Ссылка КАК Документ
        |   ,Т.Дата" + Символы.ПС
        + "   ," + ?(МДДок.Реквизиты.Найти("Организация") <> Неопределено, "Т.Организация", "неопределено") + " как Организация" + Символы.ПС
        + "   ," + ?(МДДок.Реквизиты.Найти("Контрагент") <> Неопределено, "Т.Контрагент", "неопределено") + " как Контрагент" + Символы.ПС
        + "   ," + ?(МДДок.Реквизиты.Найти("СуммаДокумента") <> Неопределено, "Т.СуммаДокумента", ?(МДДок.Реквизиты.Найти("Сумма")<>Неопределено, "Т.Сумма", "неопределено")) + " как СуммаДокумента" + Символы.ПС
        + "   ," + ?(МДДок.Реквизиты.Найти("ВидОперации") <> Неопределено, "Т.ВидОперации", ?(МДДок.Реквизиты.Найти("ХозяйственнаяОперация") <> Неопределено, "Т.ХозяйственнаяОперация", "неопределено")) + " как ВидОперации" + Символы.ПС
        + ?(ПервыйШагЦикла, "ПОМЕСТИТЬ втИСТОЧНИК_ВсеДокументы" + Символы.ПС, "")
        + "   ИЗ Документ." + МДДок.Имя + " КАК Т ГДЕ "
        + ?(МДДок.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить, "Т.Проведен", "НЕ Т.ПометкаУдаления")
        + " и Т.Дата Между &Д1 И &Д2"
        + ?(МассивТиповПриход.Найти(Тип("ДокументОбъект." + МДДок.Имя)) <> Неопределено," И (&ТипДокументов = ""Приход"" ИЛИ &ТипДокументов = ""Приход/Расход"")","") 
        + ?(МассивТиповРасход.Найти(Тип("ДокументОбъект." + МДДок.Имя)) <> Неопределено," И (&ТипДокументов = ""Расход"" ИЛИ &ТипДокументов = ""Приход/Расход"")","") 
        + Символы.ПС + Символы.ПС;
        
        ШаблонВыборки = СтрЗаменить(
        " ОБЪЕДИНИТЬ ВСЕ
        |   ВЫБРАТЬ
        |   Т.Документ КАК Документ,
        |   Т.Сумма КАК Сумма
        |ИЗ
        |   (ВЫБРАТЬ
        |       Т.Ссылка КАК Документ,
        |       СУММА(Т.Сумма) КАК Сумма
        |   ИЗ
        |       Документ.ПлатежноеПоручениеИсходящее.ИА_Фонды КАК Т
        |   ГДЕ
        |       Т.Ссылка.Проведен
        |       И Т.Ссылка.Дата МЕЖДУ &Д1 И &Д2  И Т.Сумма <> 0
        |   
        |   СГРУППИРОВАТЬ ПО
        |       Т.Ссылка
        |   
        |   ОБЪЕДИНИТЬ ВСЕ
        |   
        |   ВЫБРАТЬ
        |       Т.Ссылка,
        |       СУММА(Т.Сумма)
        |   ИЗ
        |       Документ.ПлатежноеПоручениеИсходящее.ИА_ЗаказыНаПриобретение КАК Т
        |   ГДЕ
        |       Т.Ссылка.Проведен
        |       И Т.Ссылка.Дата МЕЖДУ &Д1 И &Д2 И Т.Сумма <> 0
        |   
        |   СГРУППИРОВАТЬ ПО
        |       Т.Ссылка) КАК Т", "ПлатежноеПоручениеИсходящее", МДДок.Имя);
        
        Если МДДок.Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить Тогда
        	ШаблонВыборки = СтрЗаменить(ШаблонВыборки, "Т.Ссылка.Проведен", "НЕ Т.Ссылка.ПометкаУдаления");
        КонецЕсли; 
        
        ТекстЗапросаДляВыбораДокументовССуммами = ТекстЗапросаДляВыбораДокументовССуммами + ШаблонВыборки;
        ПервыйШагЦикла2 = Ложь;

        ПервыйШагЦикла = Ложь;
    КонецЦикла;     
    
    Если ПустаяСтрока(ТекстЗапросаДляВыбораВсехДокументов) Тогда
        ВызватьИсключение "Не найдено ни одного проводного регистратора у ИА_СредстваНаФондах !!!";
    Иначе
    	ТекстЗапросаДляВыбораВсехДокументов     = Сред(ТекстЗапросаДляВыбораВсехДокументов, 16);
        ТекстЗапросаДляВыбораДокументовССуммами = Сред(ТекстЗапросаДляВыбораДокументовССуммами, 16);
    КонецЕсли; 
    
    Текст = ТекстЗапросаДляВыбораВсехДокументов + Символы.ПС + ";" + 
     "ВЫБРАТЬ РАЗРЕШЕННЫЕ Документ, СУММА(Сумма) КАК СУММА
     | ПОМЕСТИТЬ втИСТОЧНИК_ДокументыССуммами ИЗ (" + ТекстЗапросаДляВыбораДокументовССуммами + ") КАК _1
     | СГРУППИРОВАТЬ ПО Документ
	 |;      
	 	|ВЫБРАТЬ
	    |	ИА_СредстваНаФондахОбороты.Регистратор КАК Регистратор,
	    |	ВЫБОР
	    |		КОГДА ИА_СредстваНаФондахОбороты.СуммаВалОборот = 0
	    |			ТОГДА ИА_СредстваНаФондахОбороты.СуммаБезналОборот
	    |		ИНАЧЕ ИА_СредстваНаФондахОбороты.СуммаВалОборот
	    |	КОНЕЦ КАК СуммаВРегистре
	    |ПОМЕСТИТЬ ДанныеРегистра
	    |ИЗ
	    |	РегистрНакопления.ИА_СредстваНаФондах.Обороты(&Д1, &Д2, Авто, ) КАК ИА_СредстваНаФондахОбороты
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	втИСТОЧНИК_ВсеДокументы.Документ КАК Документ,
	    |	втИСТОЧНИК_ВсеДокументы.Дата КАК Дата,
	    |	втИСТОЧНИК_ВсеДокументы.СуммаДокумента КАК СуммаДокумента,
	    |	втИСТОЧНИК_ВсеДокументы.Организация КАК Организация,
	    |	втИСТОЧНИК_ВсеДокументы.Контрагент КАК Контрагент,
	    |	втИСТОЧНИК_ВсеДокументы.ВидОперации КАК ВидОперации
	    |ПОМЕСТИТЬ ТАБ_БезДвижений
	    |ИЗ
	    |	втИСТОЧНИК_ВсеДокументы КАК втИСТОЧНИК_ВсеДокументы
	    |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра
	    |		ПО (ДанныеРегистра.Регистратор = втИСТОЧНИК_ВсеДокументы.Документ)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КСУ_ВнедоходноеПоступлениеСредств КАК ВДПС
	    |		ПО (ВДПС.Ссылка = втИСТОЧНИК_ВсеДокументы.Документ)
	    |			И (ВДПС.ПометкаУдаления = ЛОЖЬ)
	    |ГДЕ
	    |	ДанныеРегистра.Регистратор ЕСТЬ NULL
	    |	И ВДПС.Ссылка ЕСТЬ NULL
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ВДПС.Основание КАК Документ,
	    |	ВДПС.Основание.Дата КАК Дата,
	    |	ВДПС.Основание.Сумма КАК СуммаДокумента,
	    |	ВДПС.Основание.Организация КАК Организация,
	    |	ВДПС.Основание.Контрагент КАК Контрагент,
	    |	НЕОПРЕДЕЛЕНО КАК ВидОперации,
	    |	ЕСТЬNULL(НаФонды.Сумма, 0) + ЕСТЬNULL(НаЗаказы.Сумма, 0) КАК СуммаВДокументе,
	    |	ЕСТЬNULL(ИА_СредстваНаФондахОбороты.СуммаБезналОборот, 0) КАК СуммаВРегистре
	    |ПОМЕСТИТЬ ТАБ_ВДПС
	    |ИЗ
	    |	Документ.КСУ_ВнедоходноеПоступлениеСредств КАК ВДПС
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			КСУ_ВнедоходноеПоступлениеСредствИА_Фонды.Ссылка КАК Ссылка,
	    |			СУММА(КСУ_ВнедоходноеПоступлениеСредствИА_Фонды.Сумма) КАК Сумма
	    |		ИЗ
	    |			Документ.КСУ_ВнедоходноеПоступлениеСредств.ИА_Фонды КАК КСУ_ВнедоходноеПоступлениеСредствИА_Фонды
	    |		
	    |		СГРУППИРОВАТЬ ПО
	    |			КСУ_ВнедоходноеПоступлениеСредствИА_Фонды.Ссылка) КАК НаФонды
	    |		ПО (НаФонды.Ссылка = ВДПС.Ссылка)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ИА_ЗаказыНаПриобретение.Ссылка КАК Ссылка,
	    |			СУММА(ИА_ЗаказыНаПриобретение.Сумма) КАК Сумма
	    |		ИЗ
	    |			Документ.КСУ_ВнедоходноеПоступлениеСредств.ИА_ЗаказыНаПриобретение КАК ИА_ЗаказыНаПриобретение
	    |		
	    |		СГРУППИРОВАТЬ ПО
	    |			ИА_ЗаказыНаПриобретение.Ссылка) КАК НаЗаказы
	    |		ПО (НаЗаказы.Ссылка = ВДПС.Ссылка)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваНаФондах.Обороты(, , Регистратор, ) КАК ИА_СредстваНаФондахОбороты
	    |		ПО ВДПС.Ссылка = ИА_СредстваНаФондахОбороты.Регистратор
	    |ГДЕ
	    |	ВДПС.ПометкаУдаления = ЛОЖЬ
	    |	И ВДПС.Основание <> НЕОПРЕДЕЛЕНО
	    |	И ВДПС.Основание.Проведен <> ВДПС.Проведен
	    |	И ВДПС.Основание.Дата МЕЖДУ &Д1 И &Д2 И (&ТипДокументов = ""Приход"" ИЛИ &ТипДокументов = ""Приход/Расход"")
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	втИСТОЧНИК_ВсеДокументы.Документ КАК Документ,
	    |	втИСТОЧНИК_ВсеДокументы.Дата КАК Дата,
	    |	втИСТОЧНИК_ВсеДокументы.СуммаДокумента КАК СуммаДокумента,
	    |	втИСТОЧНИК_ВсеДокументы.Организация КАК Организация,
	    |	втИСТОЧНИК_ВсеДокументы.Контрагент КАК Контрагент,
	    |	втИСТОЧНИК_ВсеДокументы.ВидОперации КАК ВидОперации,
	    |	ТабНеверных.СуммаВДокументе КАК СуммаВДокументе,
	    |	ТабНеверных.СуммаВРегистре КАК СуммаВРегистре
	    |ПОМЕСТИТЬ ТАБ_ДвиженияНеверные
	    |ИЗ
	    |	(ВЫБРАТЬ
	    |		втИСТОЧНИК_ДокументыССуммами.Документ КАК Документ,
	    |		ЕСТЬNULL(втИСТОЧНИК_ДокументыССуммами.Сумма, 0) КАК СуммаВДокументе,
	    |		ЕСТЬNULL(ДанныеРегистра.СуммаВРегистре, 0) КАК СуммаВРегистре
	    |	ИЗ
	    |		втИСТОЧНИК_ДокументыССуммами КАК втИСТОЧНИК_ДокументыССуммами
	    |			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра
	    |			ПО втИСТОЧНИК_ДокументыССуммами.Документ = ДанныеРегистра.Регистратор
	    |	ГДЕ
	    |		НЕ(ЕСТЬNULL(втИСТОЧНИК_ДокументыССуммами.Сумма, 0) = ЕСТЬNULL(ДанныеРегистра.СуммаВРегистре, 0)
	    |					ИЛИ ЕСТЬNULL(втИСТОЧНИК_ДокументыССуммами.Сумма, 0) = -ЕСТЬNULL(ДанныеРегистра.СуммаВРегистре, 0))) КАК ТабНеверных
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИСТОЧНИК_ВсеДокументы КАК втИСТОЧНИК_ВсеДокументы
	    |		ПО (втИСТОЧНИК_ВсеДокументы.Документ = ТабНеверных.Документ)
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ТАБ_БезДвижений.Документ КАК Документ,
	    |	ТАБ_БезДвижений.Дата КАК Дата,
	    |	ТАБ_БезДвижений.СуммаДокумента КАК СуммаДокумента,
	    |	ТАБ_БезДвижений.Организация КАК Организация,
	    |	ТАБ_БезДвижений.Контрагент КАК Контрагент,
	    |	ТАБ_БезДвижений.ВидОперации КАК ВидОперации,
	    |	0 КАК СуммаВДокументе,
	    |	0 КАК СуммаВРегистре,
	    |	ЗНАЧЕНИЕ(Перечисление.КСУ_ОшибкиПлатежек.НетДвижений) КАК Причина
	    |ПОМЕСТИТЬ ГотовыйОтчет
	    |ИЗ
	    |	ТАБ_БезДвижений КАК ТАБ_БезДвижений
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	ТАБ_ДвиженияНеверные.Документ,
	    |	ТАБ_ДвиженияНеверные.Дата,
	    |	ТАБ_ДвиженияНеверные.СуммаДокумента,
	    |	ТАБ_ДвиженияНеверные.Организация,
	    |	ТАБ_ДвиженияНеверные.Контрагент,
	    |	ТАБ_ДвиженияНеверные.ВидОперации,
	    |	ТАБ_ДвиженияНеверные.СуммаВДокументе,
	    |	ТАБ_ДвиженияНеверные.СуммаВРегистре,
	    |	ЗНАЧЕНИЕ(Перечисление.КСУ_ОшибкиПлатежек.ДвиженияНеСоответствуют)
	    |ИЗ
	    |	ТАБ_ДвиженияНеверные КАК ТАБ_ДвиженияНеверные
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	ТАБ_ВДПС.Документ,
	    |	ТАБ_ВДПС.Дата,
	    |	ТАБ_ВДПС.СуммаДокумента,
	    |	ТАБ_ВДПС.Организация,
	    |	ТАБ_ВДПС.Контрагент,
	    |	ТАБ_ВДПС.ВидОперации,
	    |	ТАБ_ВДПС.СуммаВДокументе,
	    |	ТАБ_ВДПС.СуммаВРегистре,
	    |	ЗНАЧЕНИЕ(Перечисление.КСУ_ОшибкиПлатежек.ВДПС)
	    |ИЗ
	    |	ТАБ_ВДПС КАК ТАБ_ВДПС
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ГотовыйОтчет.Документ КАК Документ,
	    |	ГотовыйОтчет.Дата КАК Дата,
	    |	ГотовыйОтчет.СуммаДокумента КАК СуммаДокумента,
	    |	ГотовыйОтчет.Организация КАК Организация,
	    |	ГотовыйОтчет.Контрагент КАК Контрагент,
	    |	ГотовыйОтчет.ВидОперации КАК ВидОперации,
	    |	ГотовыйОтчет.СуммаВДокументе КАК СуммаВДокументе,
	    |	ГотовыйОтчет.СуммаВРегистре КАК СуммаВРегистре,
	    |	ГотовыйОтчет.Причина КАК Причина
	    |{ВЫБРАТЬ
	    |	Документ,
	    |	Дата,
	    |	СуммаДокумента,
	    |	Организация,
	    |	Контрагент,
	    |	ВидОперации,
	    |	СуммаВДокументе,
	    |	СуммаВРегистре,
	    |	Причина}
	    |ИЗ
	    |	ГотовыйОтчет КАК ГотовыйОтчет
	    |{ГДЕ
	    |	(ГотовыйОтчет.Причина = &Причина) КАК Причина,
	    |	ГотовыйОтчет.Документ,
	    |	ГотовыйОтчет.Дата,
	    |	ГотовыйОтчет.СуммаДокумента,
	    |	ГотовыйОтчет.Организация,
	    |	ГотовыйОтчет.Контрагент,
	    |	ГотовыйОтчет.ВидОперации,
	    |	ГотовыйОтчет.СуммаВДокументе,
	    |	ГотовыйОтчет.СуммаВРегистре,
	    |	ГотовыйОтчет.Причина}";
	
	Попытка 
		к = Документы.КСУ_ВнедоходноеПоступлениеСредств.ПустаяСсылка().Основание.Контрагент;
	Исключение
		текст = СтрЗаменить(текст, "ВДПС.Основание.Контрагент", "НЕОПРЕДЕЛЕНО");
	КонецПопытки;
    
    Возврат Текст;
КонецФункции


Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    
    ПараметрДанных= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("МассивТиповПриход");
    ПараметрДанных.Значение = Метаданные.ПодпискиНаСобытия.ИА_ОбработкаПроведенияВходящейПлатежки.Источник.Типы();
    ПараметрДанных.Использование=Истина;
    
    ПараметрДанных= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("МассивТиповРасход");
    ПараметрДанных.Значение = Метаданные.ПодпискиНаСобытия.ИА_ОбработкаПроведенияПлатежки.Источник.Типы();
    ПараметрДанных.Использование=Истина;

      
КонецПроцедуры
 
