&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Настройки);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Если ОбщийМодуль.ПоследовательностьПоСебестоимостиНарушена() Тогда
		Элементы.ГруппаПоследовательность.Видимость = Истина;
		Элементы.ДекорацияНарушенаПоследовательность.Заголовок = "Последовательность по себестоимости нарушена." + Символы.ПС + "Граница последовательности: " + ОбщийМодуль.ПолучитьГраницуПоследовательностиПоСебестоимости()
		+ Символы.ПС + "Данные отчета могут быть некорректными";
	Иначе
		Элементы.ГруппаПоследовательность.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоследовательность(Команда)
	//ВосстановитьПоследовательностьНаСервере();
	//ПоказатьПредупреждение(,"Восстановление последовательности по себестоимости завершено");
	
	Если ОбщийМодуль.ПоследовательностьПоСебестоимостиНарушена() Тогда
		Сообщение = "";
		Идентификатор = "";
			
		ОбщийМодуль.ЗапуститьФоновоеЗаданиеВосстановлениеПоследовательностиПоСебестоимости(Сообщение, Идентификатор);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			ИдентификаторФоновогоЗадания = Идентификатор;			
			ПодключитьОбработчикОжидания("СообщитьОбОкончанииВосстановленияПоследовательности", 0.1, Истина);
		КонецЕсли;
		
		ПоказатьПредупреждение(, Сообщение);	
	КонецЕсли;	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОкончанииВосстановленияПоследовательности()
	
	ОповещенияОбОкончанииВыполнения = ОбщийМодуль.ОповещенияОбОкончанииВыполненияРегламентныхЗаданий(ИдентификаторФоновогоЗадания);
	
	Если ТипЗнч(ОповещенияОбОкончанииВыполнения) = Тип("Структура") Тогда
		
		ПоказатьОповещениеПользователя(
			"Выполнена процедура восстановления последовательности",
			, "Восстановление последовательности завершено в фоновом задании " + Строка(ОповещенияОбОкончанииВыполнения.МоментОкончания)
			+ ?(ЗначениеЗаполнено(ОповещенияОбОкончанииВыполнения.ОписаниеОшибки), Символы.ПС + "Завершено с ошибками: " + ОповещенияОбОкончанииВыполнения.ОписаниеОшибки, ""),				
			БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		
		ПодключитьОбработчикОжидания(
			"СообщитьОбОкончанииВосстановленияПоследовательности", 2, Истина);	
		
	Иначе	
		ОбновитьЭлементыФормы();
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура ВосстановитьПоследовательностьНаСервере()
//	
//	Последовательности.СебестоимостьЗапасов.Восстановить();
//	ОбновитьЭлементыФормы();
//	
//КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СохранитьПользовательскиеНастройкиНаСервере();	
КонецПроцедуры

&НаСервере
Процедура СохранитьПользовательскиеНастройкиНаСервере()
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
КонецПроцедуры	

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
КонецПроцедуры
