#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//#6305
	ТекущийСтатусЛида = Неопределено;
	ДоступныеСтатусы = Новый Массив;
	Если Параметры.Свойство("ТекущийСтатус") И ЗначениеЗаполнено(Параметры.ТекущийСтатус) Тогда
		ТекущийСтатусЛида = Параметры.ТекущийСтатус;
		ДоступныеСтатусы = РегистрыСведений.ПорядокПереводаСтатусаЛида.ДоступныеДляПереводаСтатусы(ТекущийСтатусЛида);
	КонецЕсли; 
	
	ДанныеВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийСтатусЛида", ТекущийСтатусЛида);
	Запрос.УстановитьПараметр("ДоступныеСтатусы",  ДоступныеСтатусы);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЛида.Ссылка КАК Статус
	|ИЗ
	|	Справочник.СтатусыЛида КАК СтатусыЛида
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокПереводаСтатусаЛида КАК ПорядокПереводаСтатусаЛида
	//|		ПО СтатусыЛида.Ссылка = ПорядокПереводаСтатусаЛида.СледующийСтатус
	//|			И (ПорядокПереводаСтатусаЛида.ТекущийСтатус = &ТекущийСтатусЛида)
	|ГДЕ
	|	НЕ СтатусыЛида.ПометкаУдаления
	|	И СтатусыЛида.Использовать
	|	И НЕ СтатусыЛида.Наименование ПОДОБНО ""%(не используется)%""
	|	И ВЫБОР
	|			КОГДА НЕ &ТекущийСтатусЛида = НЕОПРЕДЕЛЕНО
	|				ТОГДА СтатусыЛида.Ссылка В (&ДоступныеСтатусы)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыЛида.РеквизитДопУпорядочивания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ДанныеВыбора.Добавить(Выборка.Статус);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Процедура заполняет справочник по умолчанию
//
Процедура ЗаполнитьПоставляемыеСтатусы(НоваяБаза = Ложь) Экспорт
	
	СтатусОбъект = Справочники.СтатусыЛида.НазначитьЗамер.ПолучитьОбъект();
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.РеквизитДопУпорядочивания = 1;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЛида.РасчетДоЗамера.ПолучитьОбъект();        // #16875
	СтатусОбъект.Использовать = НоваяБаза;
	СтатусОбъект.РеквизитДопУпорядочивания = 2;
	СтатусОбъект.ОбменДанными.Загрузка = Истина;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЛида.ОтложенныйНазначитьЗамер.ПолучитьОбъект();  // Отложенный замер
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.РеквизитДопУпорядочивания = 3;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера.ПолучитьОбъект();
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.РеквизитДопУпорядочивания = 4;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор.ПолучитьОбъект();
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.РеквизитДопУпорядочивания = 5;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЛида.ОбработкаПослеЗамера.ПолучитьОбъект();   // #16875
	СтатусОбъект.Использовать = НоваяБаза;
	СтатусОбъект.РеквизитДопУпорядочивания = 6;
	СтатусОбъект.ОбменДанными.Загрузка = Истина;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЛида.ОформитьДоговор.ПолучитьОбъект();
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.РеквизитДопУпорядочивания = 7;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЛида.ДоговорОформлен.ПолучитьОбъект();
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.РеквизитДопУпорядочивания = 8;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЛида.Обращение.ПолучитьОбъект();
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.РеквизитДопУпорядочивания = 9;
	СтатусОбъект.Записать();

	СтатусОбъект = Справочники.СтатусыЛида.УДАЛИТЬ_Сервис.ПолучитьОбъект();
	СтатусОбъект.Использовать = Ложь;
	СтатусОбъект.РеквизитДопУпорядочивания = 10;
	СтатусОбъект.ОбменДанными.Загрузка = Истина;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЛида.УДАЛИТЬ_Рекламация.ПолучитьОбъект();
	СтатусОбъект.Использовать = Ложь;
	СтатусОбъект.РеквизитДопУпорядочивания = 11;
	СтатусОбъект.ОбменДанными.Загрузка = Истина;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЛида.Отказ.ПолучитьОбъект();
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.РеквизитДопУпорядочивания = 12;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЛида.НеЦелевой.ПолучитьОбъект();
	СтатусОбъект.Использовать = Истина;
	СтатусОбъект.РеквизитДопУпорядочивания = 13;
	СтатусОбъект.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЛида.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыЛида КАК СтатусыЛида
	|ГДЕ
	|	НЕ СтатусыЛида.Предопределенный";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтатусОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтатусОбъект.Использовать = Истина;
		СтатусОбъект.РеквизитДопУпорядочивания = 99999;
		СтатусОбъект.Записать();		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли