

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	//#16875
	Если НЕ Использовать и ЗначениеЗаполнено(Ссылка) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Лид.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лид КАК Лид
		|ГДЕ
		|	Лид.ТекущийСтатус = &ТекущийСтатус";
	
		Запрос.УстановитьПараметр("ТекущийСтатус", Ссылка);
	
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ОбщегоНазначения.СообщитьПользователю("Запрещено снятие признака ""Использовать"": имеются лиды в данном статусе", , , , Отказ);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
