
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	//Если Параметры.Свойство("ТолькоПросмотр") Тогда
	//	 ТолькоПросмотр = Параметры.ТолькоПросмотр;
	//КонецЕсли;
	
	Элементы.ГруппаКПФД.Видимость = Не ТолькоПросмотр;
	Элементы.ЗаписатьИЗакрыть.Видимость = Не ТолькоПросмотр;
	Элементы.ФормаЗаписать.Видимость = Не ТолькоПросмотр;
	Элементы.ФорматДок.ТолькоПросмотр = ТолькоПросмотр;
	
	ТекстИнструкции = "";
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_ИнструкцииКЗаказам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КСУ_ИнструкцииКЗаказам КАК КСУ_ИнструкцииКЗаказам
	               |ГДЕ
	               |	КСУ_ИнструкцииКЗаказам.Организация = &Организация
	               |	И КСУ_ИнструкцииКЗаказам.ПометкаУдаления = ложь";
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Выборка = запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() Тогда
		ТекстИнструкции = выборка.ссылка.инструкция;
	Иначе
		ТекстИнструкции = Справочники.КСУ_ИнструкцииКЗаказам.ДляВсехОрганизаций.Инструкция;
	КонецЕсли;
	
	Если ТекстИнструкции = "" тогда
		возврат;
	КонецЕсли;
	
	ВложенияСтруктура = Новый Структура;
	ФорматДок.УстановитьHTML(ТекстИнструкции, ВложенияСтруктура);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиенте()
	ЗаписатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ВложенияСтруктура = Новый Структура;
	Определение ="";
	ФорматДок.ПолучитьHTML(Определение, ВложенияСтруктура);
	
	Вложения = Новый ХранилищеЗначения(ВложенияСтруктура);
	
	Константы.ИА_ФП_БазаЗнанийПЗП.Установить(Определение);

КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаКлиенте();
	Закрыть();
КонецПроцедуры
	
