Функция ЗначениеПрава(Пользователь, Право) Экспорт
    Результат = ИА_ПраваСПИ.ЗначениеПрава(Пользователь, Право);
    Возврат Результат;
КонецФункции

Функция ЗначениеПраваТекПользователя(Право) Экспорт
    Возврат ЗначениеПрава(ИА_БФС.ТекущийПользователь(), Право);
КонецФункции


Процедура СброситьКэш() Экспорт
    ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры
 

Функция ЕстьПолныеПраваНаПодсистему(Отказ, ВывестиСоообщение = Ложь) Экспорт
	//Результат = РольДоступна("ИА_БФПраваПолныеПрава");
	//Если НЕ Результат Тогда
	//    Отказ = Истина;
	//    Если ВывестиСоообщение Тогда
	//    	Сообщение = Новый СообщениеПользователю;
	//        Сообщение.Текст = "У Вас недостаточно прав для работы с подсистемой ""Дополнительные права пользователей"" !";
	//        Сообщение.Сообщить(); 
	//    КонецЕсли; 
	//КонецЕсли; 
    
    Возврат истина;
КонецФункции
 