#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Штраф";
    КомандаПечати.Идентификатор = "Штраф";
    КомандаПечати.Представление = НСтр("ru = 'Распоряжение о взыскании с работников'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Штраф") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"Штраф", 
			НСтр("ru = 'Распоряжение о взыскании с работников'"), 
			ПечатьРаспоряжения(МассивОбъектов, ОбъектыПечати));
		КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Штраф.Ссылка КАК Ссылка,
	|	Штраф.Номер КАК Номер,
	|	Штраф.Дата КАК ДатаДокумента,
	|	""01.01.2001"" КАК Дата,
	|	Штраф.Организация КАК Организация,
	|	Штраф.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
	|	Штраф.Подразделение КАК Подразделение,
	|	Штраф.Комментарий КАК Комментарий,
	|	ПРЕДСТАВЛЕНИЕ(Штраф.Основание) КАК ДокументОснование
	|ИЗ
	|	Документ.Штраф КАК Штраф
	|ГДЕ
	|	Штраф.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Штраф.Ссылка,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаШтрафов.Ссылка КАК Ссылка,
	|	ТаблицаШтрафов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаШтрафов.Сотрудник КАК Сотрудник,
	|	ТаблицаШтрафов.Сотрудник.Должность КАК СотрудникДолжность,
	|	ТаблицаШтрафов.ВидНачисления КАК ВидНачисления,
	|	ТаблицаШтрафов.Сумма КАК Сумма,
	|	ТаблицаШтрафов.Валюта КАК Валюта,
	|	ТаблицаШтрафов.КДокументу КАК КДокументу
	|ИЗ
	|	Документ.Штраф.Штрафы КАК ТаблицаШтрафов
	|ГДЕ
	|	ТаблицаШтрафов.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаШтрафов.Ссылка,
	|	ТаблицаШтрафов.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиШтрафы = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиШтрафы",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиШтрафы);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента,"ДЛФ=Д");
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер); 
		Исключение
		КонецПопытки;
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПечатьРаспоряжения(МассивОбъектов, ОбъектыПечати) Экспорт
	
 	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_РаспоряжениеОВзыскании";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Штраф.ПФ_MXL_РаспоряжениеОВзыскании");
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоШтрафам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиШтрафы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
    
    ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоШтрафам.Сбросить();
		Если ВыборкаПоШтрафам.НайтиСледующий(СтруктураПоиска) Тогда
			Выборка = ВыборкаПоШтрафам.Выбрать();
			
			Пока Выборка.Следующий() Цикл			
				Попытка
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				Исключение
				КонецПопытки;		
			КонецЦикла;
		КонецЕсли;
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				ОбластьМакета.Параметры.Руководитель = ОбщийМодуль.ФамилияИнициалы(ДанныеПечати.Организация.Руководитель.Наименование);									
			Исключение			
			КонецПопытки; 		
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
		
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Добавляет команду создания документа "Штраф".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, Порядок = 0) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.Штраф) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.Штраф.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.Штраф.Представление();
		//КомандаСоздатьНаОсновании.РежимЗаписи = "Запись";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.Порядок = Порядок;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли