
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	МассивЗаказов = Новый Массив;
	Для каждого СсылкаНаЗаказ из Параметры.СписокЗаказов Цикл
		НоваяСтрока = ТаблицаЗаказов.Добавить();
		НоваяСтрока.Заказ = СсылкаНаЗаказ;
		МассивЗаказов.Добавить(СсылкаНаЗаказ);
	КонецЦикла;
	ТаблицаЗаказов.Сортировать("Заказ");
	
	Если Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить() Тогда
		Элементы.ГруппаИсполнителиПоОперациям.Видимость = Истина;
		Элементы.ГруппаИсполнители.Видимость 			= Ложь;
	Иначе
		Элементы.ГруппаИсполнителиПоОперациям.Видимость = Ложь;
		Элементы.ГруппаИсполнители.Видимость 			= Истина;
	КонецЕсли;
	
	Элементы.ТаблицаМатериаловЗаказ.СписокВыбора.ЗагрузитьЗначения(МассивЗаказов);
	Элементы.ИсполнителиЗаказ.СписокВыбора.ЗагрузитьЗначения(МассивЗаказов);
	Элементы.ИсполнителиПоОперациямЗаказ.СписокВыбора.ЗагрузитьЗначения(МассивЗаказов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ЗапуститьЗаполнение", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатусЗаказаНаПроизводство" Тогда
		ПослеСозданияВыпуска(Параметр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеЗаполнениеТаблиц

&НаКлиенте
Процедура ЗапуститьЗаполнение()
	
	Элементы.ГруппаФоновоеЗаполнение.Видимость = Истина;
	
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("МассивЗаказов", ПолучитьМассивЗаказов());
	
	ДлительнаяОперация = ВыполнитьЗаполнениеНаСервере(ПараметрыОбмена);
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииОперацииЗаполнения", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗаполнениеНаСервере(ПараметрыОбмена)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение массового выпуска'");
	
	Результат = ДлительныеОперации.ВыполнитьВФоне("Документы.ВыпускПродукции.ВыполнитьЗаполнениеПоЗаказамДляМассовогоВыпускаИнтерактивно", ПараметрыОбмена, ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииОперацииЗаполнения(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ГруппаФоновоеЗаполнение.Видимость = Ложь;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
			
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Заполнение прервано по причине:
				|%1'"),
			Результат.КраткоеПредставлениеОшибки);
			
		Сообщить(ТекстОшибки);
		
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаСоздатьВыпуски.Доступность = Истина;
	
	ТаблицаПродукции.Очистить();
	ТаблицаМатериалов.Очистить();
	ТаблицаУслуг.Очистить();
	Исполнители.Очистить();
	ИсполнителиПоОперациям.Очистить();
	
	Данные = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	МассивПродукции = Новый Массив;
		
	Для каждого СтрокаТЧ из Данные.ТаблицаПродукции Цикл
		НоваяСтрока = ТаблицаПродукции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		МассивПродукции.Добавить(НоваяСтрока.Номенклатура);
	КонецЦикла;
	
	Для каждого СтрокаТЧ из Данные.ТаблицаМатериалов Цикл
		НоваяСтрока = ТаблицаМатериалов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;
	
	Для каждого СтрокаТЧ из Данные.ТаблицаУслуг Цикл
		НоваяСтрока = ТаблицаУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;
		
	Для каждого СтрокаТЧ из Данные.ТаблицаИсполнителей Цикл
		НоваяСтрока = Исполнители.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;
	
	Для каждого СтрокаТЧ из Данные.ТаблицаИсполнителейПоОперациям Цикл
		НоваяСтрока = ИсполнителиПоОперациям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;
	
	Элементы.ТаблицаМатериаловПродукция.СписокВыбора.ЗагрузитьЗначения(МассивПродукции);
	Элементы.ИсполнителиПродукция.СписокВыбора.ЗагрузитьЗначения(МассивПродукции);
	Элементы.ИсполнителиПоОперациямПродукция.СписокВыбора.ЗагрузитьЗначения(МассивПродукции);
	
	ЗаполнитьПризнакПодсветки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыЗаказов

&НаКлиенте
Процедура СоздатьВыпуски(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;	
	ПроверкаЗаполнения(Отказ);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	Для каждого СтрокаЗаказа из ТаблицаЗаказов Цикл
		МассивЗаказов.Добавить(СтрокаЗаказа.Заказ); 
	КонецЦикла;
	
	// #16787 перебираем не таблицу, а отдельный массив, 
	// иначе после выпуска заказ из таблицы удаляется и строки перескакивают, 
	// как итог выпуски создаются не по всем заказам
	//Для каждого СтрокаЗаказа из ТаблицаЗаказов Цикл
		//СсылкаЗаказ = СтрокаЗаказа.Заказ;
	Для каждого СсылкаЗаказ из МассивЗаказов Цикл		
		
		//#14923 переделано на вызов общей процедуры
		//Если СоздатьВыпускНаСервере(СсылкаЗаказ) Тогда
		//	ОбщийМодульВызовСервера.ИзменитьСтатусЗаказаНаПроизводствоНаПроизведен(СсылкаЗаказ);
		//	Оповестить("ЗаписанЗаказНаПроизводство", СсылкаЗаказ, "ЗаказНаПроизводство");
		//КонецЕсли;
		ПараметрыНовогоДокумента = ПараметрыЗаполненияВыпуска(СсылкаЗаказ);
		Если ПараметрыНовогоДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыВыполнения = Новый Структура;
		ПараметрыВыполнения.Вставить("ЗначениеЗаполнения", ПараметрыНовогоДокумента);
		СозданиеНаОснованииПотолкиКлиент.ВыпускПродукцииСоздатьНаОснованииЗаказаНаПроизводство(СсылкаЗаказ, ПараметрыВыполнения);
	
	КонецЦикла;
	
	//Оповестить("ОбновитьАРМПроизводства",,"ЗаказНаПроизводство");

	//КоличествоСтрок = ТаблицаЗаказов.Количество(); 
	//Для Индекс = 1 По КоличествоСтрок Цикл
	//	СтрокаЗаказа = ТаблицаЗаказов[КоличествоСтрок-Индекс];
	//	СсылкаЗаказ = СтрокаЗаказа.Заказ;
	//	ТекущиеДанныеПоЗаказу = ТекущиеДанныеПоЗаказу(СсылкаЗаказ);
	//	Если ТекущиеДанныеПоЗаказу.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Произведен") Тогда
	//		ТаблицаЗаказов.Удалить(СтрокаЗаказа);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если ТаблицаЗаказов.Количество() = 0 Тогда
	//	ПоказатьОповещениеПользователя("Созданы выпуски");
	//	Закрыть();
	//КонецЕсли;
	//
	//ПодключитьОбработчикОжидания("ЗапуститьЗаполнение", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ПослеСозданияВыпуска(СсылкаЗаказ)

	КоличествоСтрок = ТаблицаЗаказов.Количество(); 
	Для Индекс = 1 По КоличествоСтрок Цикл
		СтрокаЗаказа = ТаблицаЗаказов[КоличествоСтрок-Индекс];
		Если СсылкаЗаказ = СтрокаЗаказа.Заказ Тогда
			ТекущиеДанныеПоЗаказу = ТекущиеДанныеПоЗаказу(СсылкаЗаказ);
			Если ТекущиеДанныеПоЗаказу.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Произведен") Тогда
				ТаблицаЗаказов.Удалить(СтрокаЗаказа);
				
				УдалитьПодчиненныеСтроки(ТаблицаПродукции, СсылкаЗаказ);
				УдалитьПодчиненныеСтроки(ТаблицаМатериалов, СсылкаЗаказ);
				УдалитьПодчиненныеСтроки(ТаблицаУслуг, СсылкаЗаказ);
				УдалитьПодчиненныеСтроки(Исполнители, СсылкаЗаказ);
				УдалитьПодчиненныеСтроки(ИсполнителиПоОперациям, СсылкаЗаказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаЗаказов.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя("Созданы выпуски");
		Закрыть();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПараметрыЗаполненияВыпуска(СсылкаЗаказ)
	
	СтруктураНовогоДокумента = Новый Структура;
	СтруктураНовогоДокумента.Вставить("Заказ", СсылкаЗаказ);
	СтруктураНовогоДокумента.Вставить("Материалы", Новый Массив);
	СтруктураНовогоДокумента.Вставить("Услуги", Новый Массив);
	СтруктураНовогоДокумента.Вставить("Исполнители", Новый Массив);
	СтруктураНовогоДокумента.Вставить("ИсполнителиПоОперациям", Новый Массив);
		
	НайденныеСтрокиПродукции = ТаблицаПродукции.НайтиСтроки(Новый Структура("Заказ", СсылкаЗаказ));	
	Если НайденныеСтрокиПродукции.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	СоздаваемаяПродукция = НайденныеСтрокиПродукции[0].Номенклатура;
	
	Для каждого СтрокаТЧ из ТаблицаМатериалов Цикл
		Если СтрокаТЧ.Заказ = СсылкаЗаказ Тогда
			СтруктураСтроки = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Количество, КоличествоКВыработке, Продукция");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТЧ);
			
			СтруктураНовогоДокумента.Материалы.Добавить(СтруктураСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаТЧ из ТаблицаУслуг Цикл
		Если СтрокаТЧ.Заказ = СсылкаЗаказ Тогда
			СтруктураСтроки = Новый Структура("Номенклатура, ЕдиницаИзмерения, Коэффициент, Количество, КоличествоКВыработке, Продукция");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТЧ);
			
			СтруктураНовогоДокумента.Услуги.Добавить(СтруктураСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаТЧ из Исполнители Цикл
		Если СтрокаТЧ.Заказ = СсылкаЗаказ Тогда
			СтруктураСтроки = Новый Структура("Сотрудник, Коэффициент, Продукция");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТЧ);
			
			СтруктураНовогоДокумента.Исполнители.Добавить(СтруктураСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаТЧ из ИсполнителиПоОперациям Цикл
		Если СтрокаТЧ.Заказ = СсылкаЗаказ Тогда
			СтруктураСтроки = Новый Структура("Операция, Сотрудник1, Сотрудник2, Сотрудник3, Сотрудник4, Коэффициент1, Коэффициент2, Коэффициент3, Коэффициент4, Продукция");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТЧ);
			
			СтруктураНовогоДокумента.ИсполнителиПоОперациям.Добавить(СтруктураСтроки);
		КонецЕсли;
	КонецЦикла;
		
	Возврат СтруктураНовогоДокумента;
	
КонецФункции

//&НаСервере
//Функция СоздатьВыпускНаСервере(СсылкаЗаказ)
//	
//	СтруктураНовогоДокумента = Новый Структура;
//	СтруктураНовогоДокумента.Вставить("Заказ", СсылкаЗаказ);
//	
//	СоздаваемаяПродукция = Неопределено;
//	НайденныеСтрокиПродукции = ТаблицаПродукции.НайтиСтроки(Новый Структура("Заказ", СсылкаЗаказ));	
//	Если НайденныеСтрокиПродукции.Количество() = 0 Тогда
//		Возврат Ложь;
//	КонецЕсли;	
//	СоздаваемаяПродукция = НайденныеСтрокиПродукции[0].Номенклатура;
//	
//	НайденныеСтрокиМатериалов = ТаблицаМатериалов.НайтиСтроки(Новый Структура("Продукция", СоздаваемаяПродукция));
//	СтруктураНовогоДокумента.Вставить("Материалы", НайденныеСтрокиМатериалов);
//	
//	НайденныеСтрокиУслуг = ТаблицаУслуг.НайтиСтроки(Новый Структура("Продукция", СоздаваемаяПродукция));
//	СтруктураНовогоДокумента.Вставить("Услуги", НайденныеСтрокиУслуг);
//	
//	НайденныеСтрокиИсполнителей = Исполнители.НайтиСтроки(Новый Структура("Продукция", СоздаваемаяПродукция));
//	СтруктураНовогоДокумента.Вставить("Исполнители", НайденныеСтрокиИсполнителей);
//	
//	НайденныеСтрокиИПО = ИсполнителиПоОперациям.НайтиСтроки(Новый Структура("Продукция", СоздаваемаяПродукция));
//	СтруктураНовогоДокумента.Вставить("ИсполнителиПоОперациям", НайденныеСтрокиИПО);
//	
//	ДокОбъект = Документы.ВыпускПродукции.СоздатьДокумент();
//	ДокОбъект.Дата = ТекущаяДатаСеанса();
//	ДокОбъект.Заполнить(СтруктураНовогоДокумента);
//	
//	Попытка
//		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
//		Возврат Истина;
//	Исключение
//	КонецПопытки;
//	
//	Возврат Ложь;
//	
//КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийТаблицыЗаказов

&НаКлиенте
Процедура ТаблицаЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элементы.ТаблицаЗаказов.ТекущиеДанные.Заказ);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", Элемент.ТекущаяСтрока);
	Оповещение = Новый ОписаниеОповещения("ТаблицаЗаказовПередУдалениемЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Удалить заказ?", РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовПередУдалениемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = ТаблицаЗаказов.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	УдаляемыйЗаказ = СтрокаТаблицы.Заказ;
	ТаблицаЗаказов.Удалить(СтрокаТаблицы);
	
	УдаляемаяПродукция = Неопределено;
	КоличествоЭлементов = ТаблицаПродукции.Количество();
	Для Индекс = 1 по КоличествоЭлементов Цикл
		СтрокаТаблицы = ТаблицаПродукции[КоличествоЭлементов-Индекс];
		Если СтрокаТаблицы.Заказ = УдаляемыйЗаказ Тогда
			УдаляемаяПродукция = СтрокаТаблицы.Номенклатура;
			ТаблицаПродукции.Удалить(СтрокаТаблицы);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоЭлементов = ТаблицаМатериалов.Количество();
	Для Индекс = 1 по КоличествоЭлементов Цикл
		СтрокаТаблицы = ТаблицаМатериалов[КоличествоЭлементов-Индекс];
		Если СтрокаТаблицы.Продукция = УдаляемаяПродукция ИЛИ СтрокаТаблицы.Заказ = УдаляемыйЗаказ Тогда
			ТаблицаМатериалов.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	КоличествоЭлементов = ТаблицаУслуг.Количество();
	Для Индекс = 1 по КоличествоЭлементов Цикл
		СтрокаТаблицы = ТаблицаУслуг[КоличествоЭлементов-Индекс];
		Если СтрокаТаблицы.Продукция = УдаляемаяПродукция ИЛИ СтрокаТаблицы.Заказ = УдаляемыйЗаказ Тогда
			ТаблицаУслуг.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	КоличествоЭлементов = Исполнители.Количество();
	Для Индекс = 1 по КоличествоЭлементов Цикл
		СтрокаТаблицы = Исполнители[КоличествоЭлементов-Индекс];
		Если СтрокаТаблицы.Продукция = УдаляемаяПродукция ИЛИ СтрокаТаблицы.Заказ = УдаляемыйЗаказ Тогда
			Исполнители.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	КоличествоЭлементов = ИсполнителиПоОперациям.Количество();
	Для Индекс = 1 по КоличествоЭлементов Цикл
		СтрокаТаблицы = ИсполнителиПоОперациям[КоличествоЭлементов-Индекс];
		Если СтрокаТаблицы.Продукция = УдаляемаяПродукция ИЛИ СтрокаТаблицы.Заказ = УдаляемыйЗаказ Тогда
			ИсполнителиПоОперациям.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличныхЧастей

&НаКлиенте
Процедура ТаблицаМатериаловПриИзменении(Элемент)
	ЗаполнитьПризнакПодсветки();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Коэффициент = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// материалы
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаМатериалов");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаМатериалов.Подсвечивать");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СеребристоСерый);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивЗаказов()
	
	Возврат ТаблицаЗаказов.Выгрузить().ВыгрузитьКолонку("Заказ");
	
КонецФункции

&НаСервере
Функция ТекущиеДанныеПоЗаказу(СсылкаЗаказ)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаЗаказ, "ТекущийСтатус, Дата, Номер");
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПризнакПодсветки()
	
	КоличествоЭлементов = ТаблицаМатериалов.Количество();
	Подсвечивать = Ложь;
	Для Индекс = 1 по КоличествоЭлементов-1 Цикл
		СтрокаТаблицы = ТаблицаМатериалов[Индекс];
		ПредСтрокаТаблицы = ТаблицаМатериалов[Индекс-1];
		Если НЕ (СтрокаТаблицы.Продукция = ПредСтрокаТаблицы.Продукция) Тогда
			СтрокаТаблицы.Подсвечивать = НЕ ПредСтрокаТаблицы.Подсвечивать;
		Иначе
			СтрокаТаблицы.Подсвечивать = ПредСтрокаТаблицы.Подсвечивать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполнения(Отказ)
	
	// проверки
	МассивПроверяемыхРеквизитов = Новый Структура;
	МассивПроверяемыхРеквизитов.Вставить("Продукция", "Продукция");
	МассивПроверяемыхРеквизитов.Вставить("Номенклатура", "Номенклатура");
	МассивПроверяемыхРеквизитов.Вставить("Количество", "Количество");
	МассивПроверяемыхРеквизитов.Вставить("Коэффициент", "Коэффициент");
	МассивПроверяемыхРеквизитов.Вставить("ЕдиницаИзмерения", "Единица измерения");
	НомерСтроки = 0;
	Для каждого СтрокаТЧ из ТаблицаМатериалов Цикл
		НомерСтроки = НомерСтроки + 1;
		Для каждого ЭлементМассива из МассивПроверяемыхРеквизитов Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ[ЭлементМассива.Ключ]) Тогда
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""%ИмяКолонки%"" в строке ""%НомерСтроки%"" таблицы материалов'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИмяКолонки%", ЭлементМассива.Значение);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаМатериалов", НомерСтроки, ЭлементМассива.Ключ), , Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	МассивПроверяемыхРеквизитов = Новый Структура;
	МассивПроверяемыхРеквизитов.Вставить("Продукция", "Продукция");
	МассивПроверяемыхРеквизитов.Вставить("Номенклатура", "Номенклатура");
	МассивПроверяемыхРеквизитов.Вставить("Количество", "Количество");
	МассивПроверяемыхРеквизитов.Вставить("Коэффициент", "Коэффициент");
	МассивПроверяемыхРеквизитов.Вставить("ЕдиницаИзмерения", "Единица измерения");
	НомерСтроки = 0;
	Для каждого СтрокаТЧ из ТаблицаУслуг Цикл
		НомерСтроки = НомерСтроки + 1;
		Для каждого ЭлементМассива из МассивПроверяемыхРеквизитов Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ[ЭлементМассива.Ключ]) Тогда
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""%ИмяКолонки%"" в строке ""%НомерСтроки%"" таблицы услуг'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИмяКолонки%", ЭлементМассива.Значение);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаУслуг", НомерСтроки, ЭлементМассива.Ключ), , Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	МассивПроверяемыхРеквизитов = Новый Структура;
	МассивПроверяемыхРеквизитов.Вставить("Продукция", "Продукция");
	МассивПроверяемыхРеквизитов.Вставить("Сотрудник", "Сотрудник");
	НомерСтроки = 0;
	Для каждого СтрокаТЧ из Исполнители Цикл
		НомерСтроки = НомерСтроки + 1;
		Для каждого ЭлементМассива из МассивПроверяемыхРеквизитов Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ[ЭлементМассива.Ключ]) Тогда
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""%ИмяКолонки%"" в строке ""%НомерСтроки%"" таблицы исполнителей'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИмяКолонки%", ЭлементМассива.Значение);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Исполнители", НомерСтроки, ЭлементМассива.Ключ), , Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	МассивПроверяемыхРеквизитов = Новый Структура;
	МассивПроверяемыхРеквизитов.Вставить("Продукция", "Продукция");
	МассивПроверяемыхРеквизитов.Вставить("Операция", "Операция");
	НомерСтроки = 0;
	Для каждого СтрокаТЧ из ИсполнителиПоОперациям Цикл
		НомерСтроки = НомерСтроки + 1;
		Для каждого ЭлементМассива из МассивПроверяемыхРеквизитов Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ[ЭлементМассива.Ключ]) Тогда
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""%ИмяКолонки%"" в строке ""%НомерСтроки%"" таблицы исполнителей'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИмяКолонки%", ЭлементМассива.Значение);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ИсполнителиПоОперациям", НомерСтроки, ЭлементМассива.Ключ), , Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПодчиненныеСтроки(ТаблицаДанных, СсылкаЗаказ)

	КоличествоСтрок = ТаблицаДанных.Количество(); 
	Для Индекс = 1 По КоличествоСтрок Цикл
		СтрокаЗаказа = ТаблицаДанных[КоличествоСтрок-Индекс];
		Если СсылкаЗаказ = СтрокаЗаказа.Заказ Тогда
			ТаблицаДанных.Удалить(СтрокаЗаказа);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
