//#6404

#Область Переменные

&НаКлиенте
Перем КлючЗапрашивался, КлючИД;
&НаКлиенте
Перем СтатусыНомеров, ИнфоОшибок, УчастникиГруппы;

#КонецОбласти

#Область ОбработчикиСобытийформы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если СтандартныеПодсистемыСервер.НеобходимоОбновлениеПараметровРаботыПрограммы() Тогда
	Если РегистрыСведений.ПараметрыРаботыПрограммы.НеобходимоОбновление() Тогда
		//Вход в программу временно невозможен в связи с обновлением на новую версию
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Доступен = ОбщийМодуль.РасширенныйФункционалДоступен();
	Если НЕ Доступен тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВерсияКомпоненты = "1020";	

	НаборКонстант = Константы.СоздатьНабор("ИнтервалПроверкиПодключенияКАТС, ВестиЛоггированиеСобытийАТС, ЛогСобытийАТСОтключитьПосле"); 
	НаборКонстант.Прочитать();
	ИнтервалПроверкиПодключенияКАТС = НаборКонстант.ИнтервалПроверкиПодключенияКАТС;
	ВестиЛог = НаборКонстант.ВестиЛоггированиеСобытийАТС;
	ВестиЛогПериод = НаборКонстант.ЛогСобытийАТСОтключитьПосле;
	
	//
	ИспользуетсяOnlinePBX 	= СофтФон.ИспользуетсяROMHMAC();
	ИспользуетсяROMAsterisk = СофтФон.ИспользуетсяROMAsterisk();
	ИспользуетсяМегафон 	= СофтФон.ИспользуетсяМегафон();
	ИспользуетсяUIS 		= СофтФон.ИспользуетсяUIS();
	ИспользуетсяDomRu 		= СофтФон.ИспользуетсяDomRu();
	ИспользуетсяSipuni 		= СофтФон.ИспользуетсяSipuni();
	ИспользуетсяBinotel 	= СофтФон.ИспользуетсяBinotel(); 	//++2020-06-29
	ИспользуетсяMango    	= СофтФон.ИспользуетсяMango(); 		//++2021-08
	ИспользуетсяPhonet   	= СофтФон.ИспользуетсяPhonet(); 	//++2021-12
	ИспользуетсяБилайн      = СофтФон.ИспользуетсяБилайн(); 	//++2023-06

	Если ИспользуетсяМегафон Тогда
		ИДВАТС = "megafon";
	ИначеЕсли ИспользуетсяUIS Тогда
		ИДВАТС = "uis";
		ВерсияAPI="2.0";
	ИначеЕсли ИспользуетсяDomRu Тогда
		ИДВАТС = "domru";
	ИначеЕсли ИспользуетсяROMAsterisk Тогда
		ИДВАТС = "asterisk";
	ИначеЕсли ИспользуетсяOnlinePBX Тогда
		ИДВАТС = "onlinepbx";
	ИначеЕсли ИспользуетсяSipuni Тогда
		ИДВАТС = "sipuni";
	ИначеЕсли ИспользуетсяBinotel Тогда
		ИДВАТС = "binotel";
		ВерсияAPI="4.0";
	ИначеЕсли ИспользуетсяMango Тогда
		ИДВАТС = "mango";
	ИначеЕсли ИспользуетсяPhonet Тогда
		ИДВАТС = "phonet";
	ИначеЕсли ИспользуетсяБилайн Тогда
		ИДВАТС = "beeline";
		БилайнИДПодписки = ЗагрузитьБилайнИДПодписки();
	КонецЕсли;
		
	КлючAPISC = Константы.КлючAPI.Получить();
	ИнтервалАвтоподключения = 30;
	ЕстьОшибкиПодключения = Ложь;
	//КоличествоПопытокПодключения = 3;
	//КоличествоВыполненныхПопытокПодключения = 0;
	
	ВнутреннийНомер = СофтФон.ПолучитьВнутреннийНомерПользователя();
	ЛогинТелефонии  = СофтФон.ПолучитьЛогинТелефонииПользователя();
	
	//Схема="https://";
	
	ДоменAPI = СофтФон.ПолучитьТелефонияАдресСервера();
	КлючAPI  = СофтФон.ПолучитьПарольАдминистратораАТС();
	
	АдресВнешнейСистемыДляВАТС = СофтФонКлиентСервер.АдресВнешнейСистемыДляВАТС(ИДВАТС, КлючAPISC);
	
	СерверAsterisk = ДоменAPI;
	ПортAsterisk   = СофтФон.ПолучитьТелефонияНомерПорта(); 
	ПортAsterisk   = ?(ЗначениеЗаполнено(ПортAsterisk), ПортAsterisk, "5038"); // если не указан порт, тогда дефолтный порт AMI - 5038 
	ЛогинАТС  = СофтФон.ПолучитьЛогинАдминистратораАТС();  // asterisk
	ПарольАТС = СофтФон.ПолучитьПарольАдминистратораАТС(); // asterisk
	
	ДоменOnlinePBX = "api2.onlinepbx.ru";
	КлючWSS  = СофтФон.ПолучитьКлючWSS(); // используется: sipuni
	НомерВАТС = СофтФон.ПолучитьНомерВАТС(); // используется: sipuni
	ПарольAPI = СофтФон.ПолучитьПарольAPI(); // используется: binotel
	КлючДляПодписи = СофтФон.ПолучитьКлючДляПодписи(); // используется: mango
	
	Вариант53_Asterisk   	= (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_53"));
	Вариант85_Asterisk   	= (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_85"));
	Вариант85_2_Asterisk 	= (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_85_2"));
	Вариант93_Asterisk   	= (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_93"));
	Вариант296_Asterisk  	= (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_296"));
	Вариант93_1_Asterisk   	= (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_93_1"));
	Вариант296_1_Asterisk   = (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_296_1"));
	
	//#10674
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	КаналИсходящегоВызова = ОбщийМодульСервер.НастройкаПользователя("КаналИсходящегоВызова", ТекущийПользователь);
	КаналИсходящегоВызова = ?(ПустаяСтрока(КаналИсходящегоВызова), "SIP/"+ВнутреннийНомер, КаналИсходящегоВызова);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПриОткрытииОбработчикОжидания", 1, Истина);
	
	Если ИспользуетсяBinotel Тогда
		ИнициализироватьИнфоОшибок_Binotel();
		УчастникиГруппы = Новый Массив;
		
	ИначеЕсли ИспользуетсяMango Тогда	
		ИнициализироватьОписаниеКода_Mango();
		
	ИначеЕсли ИспользуетсяPhonet Тогда
		ИнициализироватьИнфоОшибок_Phonet();
		ИнициализироватьСтатусы_Phonet();
		
	ИначеЕсли ИспользуетсяБилайн Тогда
		Если НЕ ЗначениеЗаполнено(БилайнИДПодписки) Тогда
			СоздатьПодписку_Beeline();
		Иначе
			ПроверитьДействиеПодписки_Beeline();
		КонецЕсли;
		ПодключитьОбработчикОжидания("ПроверитьДействиеПодписки_Beeline", ИнтервалАвтоподключения*2, Ложь);
		
	КонецЕсли;

	ПодключитьОбработчикОжидания("ДополнительнаяИнформацияВЛог", 60, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ПанельRomHMac<>Неопределено Тогда
		Если ПанельRomHMac.Подключено Тогда
			ПанельRomHMac.Отключиться();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ПанельRomAsterisk = Неопределено;
	ПанельRomHMac = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	//ДанныеСобытия=СофтФон.ДанныеВСоответствие(Данные);
	СтрокаЛога = "Источник="+Источник+". Событие="+Событие+". Данные="+Данные;
	
	//Сообщить(СтрокаЛога);
	//ЗаписатьСобытиеВЛог(СтрокаЛога, Данные);   // перенесено в обработчики Если
	
	#Область RarusSoftPhone
	
	Если Источник = "SoftPhone" Тогда
		//СОБЫТИЕ Рарус-СофтФон 3.0 //////////////////////////////////////////////
		
		ЗаписатьСобытиеВЛогКлиент(СтрокаЛога, Данные, ТекущийПользователь);
		
		МассивСоответствия = UnJSON(ЗаменитьНедопустимыеСимволыXML(Данные));
		Если МассивСоответствия = Неопределено Тогда
			Возврат;
		ИначеЕсли НЕ (ТипЗнч(МассивСоответствия)  = Тип("Соответствие")) Тогда
			Возврат;
		ИначеЕсли МассивСоответствия.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		СтруктураДанных = Новый Структура();
		Для Каждого ЭлементМассива Из МассивСоответствия Цикл
			СтруктураДанных.Вставить(ЭлементМассива.Ключ, ЭлементМассива.Значение); 
		КонецЦикла;
		
		Если Событие = "OnCallInfoEx" Тогда
			Если СтруктураДанных.State = 5 и НЕ СокрЛП(СтруктураДанных.CallerID) = СокрЛП(ВнутреннийНомер) Тогда
				//входящий звонок текущему пользователю				
				ДействияПриНачалеВходящегоЗвонка(СтруктураДанных.CallerID, СтруктураДанных.CalledId, ВнутреннийНомер, ИДТекущегоЗвонка);								
			КонецЕсли;
			
		ИначеЕсли  Событие = "PutSettingsJSON" Тогда	
			//
		ИначеЕсли  Событие = "OnEvent" Тогда
			//
		ИначеЕсли  Событие = "OnEventData" Тогда
			//
		ИначеЕсли  Событие = "OnAllLinesInfo" Тогда
			//
		ИначеЕсли  Событие = "OnLinesStatus" Тогда	
			//
		ИначеЕсли  Событие = "OnRecordInfo" Тогда	
			//
		ИначеЕсли  Событие = "OnResultInfo" Тогда
			//
		ИначеЕсли  Событие = "OnCallInfoCoMagic" Тогда
			//
		КонецЕсли;

	#КонецОбласти
	
	#Область Asterisk
	
	ИначеЕсли Источник = "SC-Asterisk-Native" Тогда
		
		//ДанныеСобытия = СофтФон.ДанныеВСоответствие(Данные);
		ДанныеСобытия = СофтФонКлиентСервер.ДанныеВСоответствие(Данные);
		
		ЗаписатьСобытиеВЛогКлиент(СтрокаЛога, Данные, ТекущийПользователь);
		
		//СОБЫТИЕ АСТЕРИСК //////////////////////////////////////////////
		
		//Вариант получения событий:
		//1. Пишется под каждого клиента (в зависимости от очереди, от настрое к и т.д. в ряде случаев подходит то что уже делали
		//
		//Вариант получения истории:
		//1. в таблице используется filename (формат свой) 
		//1462348401.7930-2016-05-04-10_53-201-89178797700.mp3
		//2. в таблице используется recordingfile (формат свой) in-435405-89878631473-20171022-161042-1508670642.4457.wav
		//
		//Вариант получения записи звонка:
		//1. по ссылке dl.php?BASE64. Указать каталог размещения сайта. Все функции поиска и отдачи файла выполняет веб сервер, со стороны клиента ОС ведет себя как обычное открытие/скачивание файлв.
		//2. ftp - если исп. 2 вариант выше берем из поля cdrdate, YY\MM\DD. FTP и FTPs (не sFTP) реализовать нет проблем 
		//3. samba - если исп. 2 вариант выше берем из поля cdrdate, YY\MM\DD. Авторизация? если нет доступа к сетевой папке, 1с при прослушивании не запросит авторизацию, пользователю нужно будет зайти в папки виндовыми средствами и открыть папку.
		//4. по другой ссылке http запрос либо получать ссылку на файл или в двоичном виде
		//необходимо разрабатывать api на сервере и отправку/прием в 1с
		//		
		//Имя поля записи [filename, recordingfile]
		//Вариант доступа к записям. Выбор из вариантов: "DL.php, Ftp-сервер, samba, http-запрос"
		//
		//когда Вариант доступа к записям = DL.php
		//должна быть настройка начального каталога
		//
		//Ftp-сервер, samba
		//хост, порт, логин, пароль, начальный каталог, формат иерархии папок 
		//
		//http-запрос
		//url,запросом отправляем имя файла, в ответ получаем двоичные данные записи звонка
		
		Если Событие="Disconnect" Тогда
			
			ПодключенКАТС = Ложь;
			УстановитьСтатусПользовательПодключен(ПодключенКАТС);
			//Подключиться(Неопределено); //пробуем переподключиться //пока убрана, т.к. в случае обрыва связи с АТС 1с наглухо зависает в попытках подключиться
			//#13668			
			ПодключитьОбработчикОжидания("ПодключитьсяКСерверуAsterisk", ИнтервалАвтоПодключения, Ложь);
			Возврат;
			
		ИначеЕсли ВРег(СокрЛП(ДанныеСобытия.Получить("Response"))) = "FOLLOWS" Тогда
			
			//идет запрос состояния подключения телефона (программного или аппаратного) к АТС
			ПакетДанных = ДанныеСобытия.Получить("Пакет");
			
			МассивЗначений = СтрРазделить(ПакетДанных, Символы.ПС);
			Для Ном = 0 По МассивЗначений.Количество()-1 Цикл
				Если СтрНайти(МассивЗначений[Ном], "Status") > 0 Тогда
					Если СтрНайти(ВРег(МассивЗначений[Ном]), "UNKNOWN") > 0 Тогда
						ПоказатьОповещениеПользователя("Для работы с ip-телефонией" + Символы.ПС + "следует подключить программный " + Символы.ПС + "или аппаратный телефон к АТС");
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			//отрабатываем событие в зависимости от вариантов настроек
			ВидСобытия=ВРег(СокрЛП(ДанныеСобытия.Получить("Event")));                       			
			Если Вариант53_Asterisk Тогда
				//вариант 53
				Вариант_53_Asterisk(ВидСобытия, ДанныеСобытия);
			ИначеЕсли Вариант85_Asterisk Тогда
				//вариант 85
				Вариант_85_Asterisk(ВидСобытия, ДанныеСобытия);
			ИначеЕсли Вариант85_2_Asterisk Тогда
				//вариант 85 (очереди)
				Вариант_85_2_Asterisk(ВидСобытия, ДанныеСобытия);
			ИначеЕсли Вариант93_Asterisk Тогда
				//вариант 93
				ОбработкаСобытий_Вариант_93_Asterisk(ВидСобытия, ДанныеСобытия);
			ИначеЕсли Вариант296_Asterisk Тогда
				//вариант 296
				ОбработкаСобытий_Вариант_296_Asterisk(ВидСобытия, ДанныеСобытия);
			ИначеЕсли Вариант93_1_Asterisk Тогда
				//вариант 93.1
				ОбработкаСобытий_Вариант_93_1_Asterisk(ВидСобытия, ДанныеСобытия);
			ИначеЕсли Вариант296_1_Asterisk Тогда
				//вариант 296.1
				ОбработкаСобытий_Вариант_296_1_Asterisk(ВидСобытия, ДанныеСобытия);
			Иначе
				//неизвестный вариант. не реагируем 
			КонецЕсли;
		
		КонецЕсли;
		
	#КонецОбласти
	
	#Область SmartConnector
	
	ИначеЕсли Источник="SmartConnector-Native" Тогда
		
		Данные = ТекстANSI_UTF8(Данные); // всегда преобразовываем полученный текст в UTF8 (обработки русских букв в сообщениях от сервера, uis)
		СтрокаЛога = "Источник="+Источник+". Событие="+Событие+". Данные="+Данные;
		ЗаписатьСобытиеВЛогКлиент(СтрокаЛога, Данные, ТекущийПользователь);
		
		Если Событие = "Disconnect" Тогда //И Данные="Disconnect" Тогда
			
			// Данные содержат код отключения
			// 1 - Нет соединение (connected = false)
			// 2 - Состояние соединения - закрыто
			// 3 - Соединение закрыто при чтении
			// 4 - Соединение закрыто пользователем
			// 10053, 10060, 995 - ошибки протокола

			ПодключенКАТС = Ложь;
			УстановитьСтатусПользовательПодключен(ПодключенКАТС);
			ПодключитьОбработчикОжидания("ПодключитьсяКСерверуSC", ИнтервалАвтоПодключения, Ложь);
			
	    Иначе
			ОбработкаСобытийSmartConnector(Данные);
		КонецЕсли;
		
	#КонецОбласти

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// событие по кнопкам Скачать / Прослушать для OnPbx (Журнал звонков, форма контрагента, форма лида, форма списка истории АТС)
	Если ИмяСобытия = "ПолучитьСсылкуНаЗаписьOnPbxОткрыть"
		ИЛИ ИмяСобытия = "ПолучитьСсылкуНаЗаписьOnPbxСкачать" Тогда
		
		//ЗагружатьЗаписьOnPbx = (ИмяСобытия = "ПолучитьСсылкуНаЗаписьOnPbxСЗагрузкой");
		Если ИмяСобытия = "ПолучитьСсылкуНаЗаписьOnPbxОткрыть" Тогда
			РежимЗагрузкиЗаписиOnPbx = 0;
		Иначе
			Запустить = Параметр.Свойство("ЗапуститьПослеСкачивания") И Параметр.ЗапуститьПослеСкачивания;
			Если НЕ Запустить Тогда
				РежимЗагрузкиЗаписиOnPbx = 1;
			Иначе
				РежимЗагрузкиЗаписиOnPbx = 2;
			КонецЕсли;
		КонецЕсли;
		
		ИД = Параметр.ИДЗвонка;
		КаталогЗаписи = Параметр.Каталог;
		
		ПолучитьФайлЗаписи_OnlinePBX(ИД);
			
	ИначеЕсли ИмяСобытия = "ПолучитьСсылкуНаЗаписьBinotelОткрыть"
		ИЛИ ИмяСобытия = "ПолучитьСсылкуНаЗаписьBinotelСкачать" Тогда
		
		//ЗагружатьЗаписьBinotel = (ИмяСобытия = "ПолучитьСсылкуНаЗаписьBinotelСЗагрузкой");
		Если ИмяСобытия = "ПолучитьСсылкуНаЗаписьBinotelОткрыть" Тогда
			РежимЗагрузкиЗаписиBinotel = 0;
		Иначе
			Запустить = Параметр.Свойство("ЗапуститьПослеСкачивания") И Параметр.ЗапуститьПослеСкачивания;
			Если НЕ Запустить Тогда
				РежимЗагрузкиЗаписиBinotel = 1;
			Иначе
				РежимЗагрузкиЗаписиBinotel = 2;
			КонецЕсли;
		КонецЕсли;
		
		ИДЗаписи = Параметр.ИДЗвонка;
		КаталогЗаписи = Параметр.Каталог;

		ПолучитьФайлЗаписи_Binotel(ИДЗаписи);
				
	ИначеЕсли ИмяСобытия = "ПолучитьСсылкуНаЗаписьMangoОткрыть"
		ИЛИ ИмяСобытия = "ПолучитьСсылкуНаЗаписьMangoСкачать" Тогда
		
		Если ИмяСобытия = "ПолучитьСсылкуНаЗаписьMangoОткрыть" Тогда
			РежимЗагрузкиЗаписиMango = 0;
		Иначе
			Запустить = Параметр.Свойство("ЗапуститьПослеСкачивания") И Параметр.ЗапуститьПослеСкачивания;
			Если НЕ Запустить Тогда
				РежимЗагрузкиЗаписиMango = 1;
			Иначе
				РежимЗагрузкиЗаписиMango = 2;
			КонецЕсли;
		КонецЕсли;
		
		ИДЗаписи = Параметр.ФайлЗаписиСсылка;
		КаталогЗаписи = Параметр.Каталог;
		Команда = ?(ИмяСобытия = "ПолучитьСсылкуНаЗаписьMangoСкачать", "download", "play");
		
		ПолучитьФайлЗаписи_Mango(ИДЗаписи, Команда);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСсылкуНаЗаписьBeelineОткрыть"
		ИЛИ ИмяСобытия = "ПолучитьСсылкуНаЗаписьBeelineСкачать" Тогда
		
		Если ИмяСобытия = "ПолучитьСсылкуНаЗаписьBeelineОткрыть" Тогда
			РежимЗагрузкиЗаписиBeeline = 0;
		Иначе
			Запустить = Параметр.Свойство("ЗапуститьПослеСкачивания") И Параметр.ЗапуститьПослеСкачивания;
			Если НЕ Запустить Тогда
				РежимЗагрузкиЗаписиBeeline = 1;
			Иначе
				РежимЗагрузкиЗаписиBeeline = 2;
			КонецЕсли;
		КонецЕсли;
		
		ИДЗаписи = Параметр.ФайлЗаписиСсылка;
		КаталогЗаписи = Параметр.Каталог;
		Команда = ?(ИмяСобытия = "ПолучитьСсылкуНаЗаписьBeelineСкачать", "download", "play");
		
		ПолучитьФайлЗаписи_Beeline(ИДЗаписи, Команда);
	
	// событие с Журнала звонков по кнопке ПолучитьИсториюИзАТСВручную
	ИначеЕсли ИмяСобытия = "ПолучитьИсториюИзАТСВручную" Тогда
		ПолучитьИсторию(Параметр.ДатаНачала, Параметр.ДатаОкончания);
		
	ИначеЕсли ИмяСобытия = "ВыполнитьИсходящийЗвонок" Тогда
		ВыполнитьИсходящийЗвонок(Параметр.ТелефонКлиента, Параметр.ИмяКлиента);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ПриОткрытииОбработчикОжидания()
	
	Если СофтФон.ТекущемуПользователюРазрешеноИспользованиеIPТелефонии() Тогда
		Подключиться(Неопределено);
		ИнтервалЗапросаИсторииЗвонков = ИнтервалЗапросаИсторииЗвонков();
		Если ИнтервалЗапросаИсторииЗвонков > 0 Тогда
			ПодключитьОбработчикОжидания("АвтоматическиЗапроситьИсториюЗвонков",1,Истина); //запустить прямо сейчас
			ПодключитьОбработчикОжидания("АвтоматическиЗапроситьИсториюЗвонков",ИнтервалЗапросаИсторииЗвонков,Ложь); //запускать периодическии
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользуетсяМегафон ИЛИ ИспользуетсяDomRu Тогда
		ПолучитьСписокОператоров_ITooLabs();
		
	ИначеЕсли ИспользуетсяUIS Тогда 
		ПолучитьСписокОператоров_UIS();
		ПолучитьСписокSIP_UIS();
		
	ИначеЕсли ИспользуетсяOnlinePBX Тогда
		ВыполнитьЗапросКлючаRest_OnlinePBX();
		
	ИначеЕсли ИспользуетсяSipuni Тогда 
		ПолучитьСписокОператоров_Sipuni();
		
	ИначеЕсли ИспользуетсяMango Тогда
		ПолучитьСписокОператоров_Mango();
		ПолучитьСписокЛиний_Mango();
		
	ИначеЕсли ИспользуетсяBinotel Тогда
		ПолучитьСписокОператоров_Binotel();
		ПолучитьСписокРингГрупп_Binotel();

	ИначеЕсли ИспользуетсяPhonet Тогда
		ПолучитьКлючREST_Phonet();						
		ПолучитьСписокОператоров_Phonet();
		
	ИначеЕсли ИспользуетсяБилайн Тогда
		ПолучитьСписокОператоров_Beeline();
						
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключиться(Команда)
	
	#Если ВебКлиент Тогда
		ПоказатьОповещениеПользователя("Компоненты работы с АТС не доступны в web-клиенте");
		Возврат;
	#КонецЕсли	
	
	ПодключенКАТС = Ложь;
//	КоличествоВыполненныхПопытокПодключения = 0;
//	
	Если ПараметрыСеансаТелефонияСтрана().Пустая() Тогда
		ПанельRomAsterisk = Неопределено;
		ПанельRomHMac = Неопределено;
		УстановитьСтатусПользовательПодключен(Ложь);
		ПоказатьПредупреждение(,"В настройках программы не указана страна (в разделе ""Основные""). Использование телефонии не доступно.");
		Возврат;
	КонецЕсли;
	
	Если СофтФон.ТекущемуПользователюРазрешеноИспользованиеIPТелефонии() Тогда
		ПодключитьсяКАТС();
		УстановитьСтатусПользовательПодключен(ПодключенКАТС);
	Иначе
		ПоказатьПредупреждение(,"Для использования софтфона у вас должно быть соответствующее право и внутренний номер SIP");
		ПанельRomAsterisk = Неопределено;
		ПанельRomHMac = Неопределено;
		УстановитьСтатусПользовательПодключен(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отключиться(Команда)
	
	Если ПанельRomHMac<>Неопределено Тогда
		Если ПанельRomHMac.Подключено Тогда
			РезультатОтключения = ПанельRomHMac.Отключиться();
			ПодключенКАТС = Ложь;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеКАТС() Экспорт
	
	Если ИспользуетсяROMAsterisk 
		И НЕ ПанельRomAsterisk = Неопределено Тогда
		
		Если НЕ ПанельRomAsterisk.Подключено Тогда
			
			ПодключенКАТС = Ложь;
			УстановитьСтатусПользовательПодключен(ПодключенКАТС);			
			//ПодключитьОбработчикОжидания("ПодключитьсяКСерверуAsterisk", 0.1, Истина); // не помогает, при этом по кнопке работает
			ПодключитьсяКАТС();
			
		КонецЕсли;
		
	ИначеЕсли НЕ ПанельRomHMac = Неопределено
		И ПанельRomHMac.Подключено Тогда
		// отправляем произвольное сообщение, чтобы обнаружить непреднамеренный обрыв соединения
		ТекстСообщения = СтрШаблон("{""action"": ""ping"", ""ConnectionId"": %1, ""unixtime"": %2}", Формат(ИдентификаторПодключения, "ЧГ="), ПолучитьДатуUT(ТекущаяДата()));
		РезультатОтправкиСобщения = ПанельRomHMac.ОтправитьСообщение(ТекстСообщения);
		Если НЕ РезультатОтправкиСобщения Тогда

		КонецЕсли;
	
	//Если Ложь Тогда
		////ИспользуетсяROMHMAC 
		////ИЛИ ИспользуетсяSIOМегафон ИЛИ ИспользуетсяSIODomRu 
		////ИЛИ ИспользуетсяSIOUIS ИЛИ ИспользуетсяSIOSipuni Тогда
		//
		//Пакет =
		//"{
		//|'service': 'simplit.io', 
		//|'data': 
		//|	{
		//|		'action': 'command', 
		//|		'command': 'ping'
		//|	}
		//|}";
		//
		//Пакет = СофтФонКлиентСервер.Stringify(Пакет);
		//ПанельRomHMac.Отправить(Пакет);
	Иначе
		ОтключитьОбработчикОжидания("ПроверитьПодключениеКАТС");		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьRestЗапрос(ТипЗапроса = "POST", Хост, Ресурс, Заголовки = Неопределено, ТелоЗапроса=Неопределено, 
							ПрочитатьВJson = Истина, ПрочитатьВСоответствие = Истина, 
							РезультатВФайл=Ложь,
							Таймаут = 0,
							ВернутьКуки = Ложь,
							Знач ПутьКФайлуРезультата = "")
		
	Если Заголовки = Неопределено Тогда
		Заголовки = Новый Соответствие;	
		Заголовки.Вставить("Content-Type", "application/json; charset=UTF-8;");
	КонецЕсли;

	Запрос = Новый HTTPЗапрос(Ресурс, Заголовки);
	Если НЕ ТелоЗапроса=Неопределено Тогда
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Попытка
		
		//++ №13602 обрабатываем адрес сервера АТС, на случай если на входе https://server.ru/resurce/api, на выходе будет server.ru
		//Соединение = Новый HTTPСоединение(Хост,,,,,Таймаут,Новый ЗащищенноеСоединениеOpenSSL); // https
		Соединение = Новый HTTPСоединение(ОбработатьАдресСервера(Хост), 443,,,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
		//-- №13602
		
		Если ТипЗапроса = "POST" Тогда
			HTTPОтвет = Соединение.ОтправитьДляОбработки(Запрос);
			
		ИначеЕсли ТипЗапроса = "GET" Тогда
			Если РезультатВФайл Тогда
				ВремФайл = ?(ПустаяСтрока(ПутьКФайлуРезультата), ПолучитьИмяВременногоФайла("txt"), ПутьКФайлуРезультата);
				HTTPОтвет = Соединение.Получить(Запрос, ВремФайл);
			Иначе
			    HTTPОтвет = Соединение.Получить(Запрос);
			КонецЕсли;
			
		ИначеЕсли ТипЗапроса = "PUT" Тогда
			HTTPОтвет = Соединение.Записать(Запрос);
			
		КонецЕсли;
		
		КодОтвета = HTTPОтвет.КодСостояния;
		
		Если КодОтвета = 200 Тогда
			Если ТипЗапроса = "GET" И РезультатВФайл Тогда
				// Мегафон (история звонков)
				Если ПустаяСтрока(ПутьКФайлуРезультата) Тогда
					Файл = Новый ЧтениеТекста(ВремФайл);
					Данные = Файл.Прочитать();
					Файл.Закрыть();
					УдалитьФайлы(ВремФайл);
					Возврат Данные;
				Иначе
					// билайн (запись звонка)
					Возврат ПутьКФайлуРезультата;
				КонецЕсли;
				
			ИначеЕсли ВернутьКуки Тогда				
				Возврат HTTPОтвет.Заголовки.Получить("Set-Cookie");
				
			Иначе
				ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
				Если ПрочитатьВJson Тогда
					Данные = СофтФонКлиентСервер.ПолучитьДанныеJSON(ТелоОтвета, ПрочитатьВСоответствие);
					Возврат Данные;
				Иначе
					Возврат ТелоОтвета;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли КодОтвета = 302 И Ресурс = "/vpbx/queries/recording/post" Тогда
			// получена ссылка на файл записи: ссылки являются временными, срок их жизни ограничен 
			ФайлЗаписиСсылка = HTTPОтвет.Заголовки.Получить("Location");
			Возврат ФайлЗаписиСсылка;
			
		КонецЕсли;
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьОповещениеПользователя("Ошибка Софтфон", , ТекстОшибки); 
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Неопределено;
			
КонецФункции

//++ №13602
Функция ОбработатьАдресСервера(Знач АдресСервера)
	
	АдресСервера = СокрЛП(АдресСервера);

	Сервер = ""; 
		
	Если НЕ ПустаяСтрока(АдресСервера) Тогда
		
		АдресСервера = СтрЗаменить(АдресСервера, "\", "/");
		АдресСервера = СтрЗаменить(АдресСервера, " ", "");
		
		Если НРег(Лев(АдресСервера, 7)) = "http://" Тогда
			АдресСервера = Сред(АдресСервера, 8);
		ИначеЕсли НРег(Лев(АдресСервера, 8)) = "https://" Тогда
			АдресСервера = Сред(АдресСервера, 9);
		КонецЕсли;
		
		ПозицияСлэша = СтрНайти(АдресСервера, "/");
		
		Если ПозицияСлэша > 0 Тогда
			Сервер = Лев(АдресСервера, ПозицияСлэша - 1);
		Иначе	
			Сервер = АдресСервера;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Сервер;
	
КонецФункции
//-- №13602

&НаСервере
Функция ПараметрыСеансаТелефонияСтрана()
	Возврат ПараметрыСеанса.ТелефонияСтрана;
КонецФункции

&НаСервере
Функция ВариантНастроекТелефонии_Asterisk()
	Возврат ПараметрыСеанса.ВариантНастроекТелефонии;
КонецФункции

&НаСервере
Процедура УстановитьСтатусПользовательПодключен(ТекущийСтатус)
	ПраваПользователей.ТекущийПользовательПодключенКТелефонии(ТекущийСтатус);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСобытиеВЛогКлиент(СтрокаЛога, Данные, Пользователь)
	
	Если ВестиЛог
		И ВестиЛогПериод < ТекущаяДата() Тогда
		ВестиЛог = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ВестиЛог Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьСобытиеВЛогСервер(СтрокаЛога, Данные, Пользователь);
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Процедура ЗаписатьСобытиеВЛогСервер(СтрокаЛога, Данные, Пользователь)
	
	//НаборКонстант = Константы.СоздатьНабор("ВестиЛоггированиеСобытийАТС, ЛогСобытийАТСОтключитьПосле");
	//НаборКонстант.Прочитать();
	//Если НаборКонстант.ВестиЛоггированиеСобытийАТС
	//	И НаборКонстант.ЛогСобытийАТСОтключитьПосле < ТекущаяДата() Тогда  // именно ТекущаяДата() а не ТекущаяДатаСеанса()
	//	НаборКонстант.ВестиЛоггированиеСобытийАТС = Ложь;
	//	НаборКонстант.Записать();
	//	Возврат;
	//КонецЕсли;
	//
	//Если НЕ НаборКонстант.ВестиЛоггированиеСобытийАТС Тогда
	//	Возврат;
	//КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(МАКСИМУМ(ЛогАТС.ИдСобытия), 1) КАК ИдСобытия
	|ИЗ
	|	РегистрСведений.ЛогАТС КАК ЛогАТС";
	Количество = 1;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Количество = Выборка.ИдСобытия;	
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛогАТС.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период 		= ТекущаяДатаСеанса();
		МенеджерЗаписи.ИдСобытия 	= Количество + 1;
		МенеджерЗаписи.Событие 		= СтрокаЛога;
		МенеджерЗаписи.Данные 		= Данные;
		МенеджерЗаписи.Пользователь = Пользователь;
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдСобытияДоТочки(Знач ИдСобытия)
	
	НомерТочки = СтрНайти(ИдСобытия, ".");
	Если НомерТочки > 0 Тогда
		Возврат Лев(ИдСобытия,НомерТочки-1);
	Иначе
		Возврат ИдСобытия;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДатуUTC(Дата='00010101', Суффикс = "Z")
	
	ФорматДаты = "ДФ=гггг-ММ-ддTЧЧ:мм:сс";
	СтрДатаUTC = Формат(Дата,ФорматДаты) + Суффикс;
	
	Возврат СтрДатаUTC;

КонецФункции

&НаКлиенте
Функция ПолучитьДатуRFC(ТекДата='00010101')
	
	// Дата в формате RFC 2822
	Если Не ЗначениеЗаполнено(ТекДата) Тогда
		ТекДата=ПолучитьДатуGMT();
	КонецЕсли;
	
	Если ТекДата=НачалоДня(ТекДата) ИЛИ ТекДата=КонецДня(ТекДата) Тогда
		ДатаRFC=Формат(ТекДата,"Л=en_GB; ДФ='дд МММ гггг ЧЧ:мм:сс'")+" GMT";
	Иначе
		ДатаRFC=Формат(УниверсальноеВремя(ТекДата),"Л=en_GB; ДФ='дд МММ гггг ЧЧ:мм:сс'")+" GMT";
	КонецЕсли; 
	
	Возврат ДатаRFC;

КонецФункции

&НаКлиенте
Функция ПолучитьДатуUT(ТекДата='00010101', Миллисекунды=Ложь) 

	// Дата -> UnixTime	
	Возврат Формат(ТекДата - Дата(1970,1,1,0,0,0), "ЧГ=0") + ?(Миллисекунды, "000", "");
	
КонецФункции

&НаСервере
Функция ПолучитьДатуGMT()
	Возврат ТекущаяУниверсальнаяДата();
КонецФункции

&НаСервереБезКонтекста
Функция КодироватьДанныеПакета(ДанныеПакета)
	Возврат КодироватьСтроку(ДанныеПакета, СпособКодированияСтроки.КодировкаURL);
КонецФункции

&НаСервереБезКонтекста
Функция ДекодироватьДанныеПакета(ДанныеПакета)
	Возврат РаскодироватьСтроку(ДанныеПакета, СпособКодированияСтроки.КодировкаURL);
КонецФункции

&НаСервере
Функция MD5(СтрХеширования)

	Возврат СофтФонСервер.MD5(СтрХеширования);

КонецФункции

&НаКлиенте
Функция ВСтроку(Знач Значение)
	Возврат Формат(Значение,"ЧГ=0");
КонецФункции

&НаКлиенте
Функция ТекстANSI_UTF8(ТекстСообщения)
	
	// ANSI в UTF-8
	ПотокВПамяти = Новый ПотокВПамяти;			
	ЗаписьДанных = Новый ЗаписьДанных(ПотокВПамяти);
	ЗаписьДанных.ЗаписатьСтроку(ТекстСообщения, КодировкаТекста.ANSI);
	ЗаписьДанных.Закрыть();			
	ПотокВПамяти.Перейти(0, ПозицияВПотоке.Начало);			
	ЧтениеДанных = Новый ЧтениеДанных(ПотокВПамяти);
	Возврат ЧтениеДанных.ПрочитатьСтроку();
	
КонецФункции

&НаКлиенте
Процедура ДополнительнаяИнформацияВЛог()

	СостояниеПодключения = "Неопределено";
	Если НЕ ПанельRomHMac = Неопределено Тогда
		СостояниеПодключения = ?(ПанельRomHMac.Подключено, "Подключено", "Не подключено");
	КонецЕсли;
	
	ДанныеВЛог = СтрШаблон("Внутренний номер: %1; состояние: %2; пользователь: %3", ВнутреннийНомер, СостояниеПодключения, ТекущийПользователь);
	
	ЗаписатьСобытиеВЛогКлиент(ДанныеВЛог, ДанныеВЛог, ТекущийПользователь);
	
КонецПроцедуры

#КонецОбласти

#Область Подключение

&НаКлиенте
Процедура ПодключитьсяКАТС()
	
	ПодключенКАТС = Ложь;
	
	Если ИспользуетсяROMAsterisk Тогда

		ПодключитьПанель_Asterisk();
				
	ИначеЕсли ИспользуетсяМегафон 
		ИЛИ ИспользуетсяDomRu
		ИЛИ ИспользуетсяOnlinePBX
		ИЛИ ИспользуетсяUIS
		ИЛИ ИспользуетсяSipuni
		ИЛИ ИспользуетсяMango
		ИЛИ ИспользуетсяБилайн
		Тогда
			
		ПодключитьКомпоненту();

//	ИначеЕсли ИспользуетсяBinotel 
//		ИЛИ ИспользуетсяMango 
//		ИЛИ ИспользуетсяPhonet Тогда
//		
//		//справка: общий принцип подключения
//		//скачиваем и подключаем библиотеку (панель) Simplit
//		//создаем внешнюю компоненту Simplit, которая будет отлавливать события Simplit
//		//Подключаем библиотеку к серверу Simplit и слушаем события
//		
//		ПодключитьПанель_Simplit();
//		ПодключитьсяКСерверуSimplit(); //подключились к серверу Simplit
//		
//	ИначеЕсли СофтФон.ИспользуютсяСофтФон() Тогда
//		
//		//справка: общий принцип подключения
//		//устанавливаем сервер Рарус СофтФон
//		//устанавилаем клиент Рарус СофтФон, подключаем к серверу и подколчаем к SIP. Указываем что основной канал - SIP
//		//подключаем компоненту и слушаем внешние события
//		
//		ПодключитьПанель_РарусСофтФон();
		
	КонецЕсли;
	
	//Если ПодключенКАТС И ИнтервалПроверкиПодключенияКАТС > 0 Тогда
	//    ОтключитьОбработчикОжидания("ПроверитьПодключениеКАТС");
	//	ПодключитьОбработчикОжидания("ПроверитьПодключениеКАТС", ИнтервалПроверкиПодключенияКАТС, Ложь);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьКомпоненту()
	
	ЕстьОшибкиПодключения = Ложь;
	
	//ПодключитьКомпонентуСинхронно();
	ПодключитьКомпонентуАсинхронно();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПодключитьКомпонентуСинхронно()

	ПанельRomHMac = Неопределено;
	ИмяМакетаБиблиотеки = "SC_WS_ZIP_" + ВерсияКомпоненты;
	ИмяИсточникаСобытий = ИДВАТС;
	
	// попытка установить компоненту
	попытка
		Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки, ИмяИсточникаСобытий); //, ТипВнешнейКомпоненты.Native);
	исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Если Не Результат Тогда
		
		// неудачно, возможно еще не установлена
		попытка
			УстановитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки);
		исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		попытка
			Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки, ИмяИсточникаСобытий); //, ТипВнешнейКомпоненты.Native);
		исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	Если Результат Тогда
		ПанельRomHMac=Новый("AddIn."+ИмяИсточникаСобытий+".SmartConnector-Native");				
		
		ПодключитьсяКСерверуSC();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодключитьКомпонентуАсинхронно(ПервыйЗапуск=Истина, ИДМакета = "")
	
	// попытка установить компоненту
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(ИДМакета) Тогда
		ИДМакета = "ОбщийМакет.SC_WS_ZIP_" + ВерсияКомпоненты;
	КонецЕсли;
	ИмяИсточника = ИДВАТС;
	
	Если НЕ ПанельRomHMac = Неопределено Тогда
		ПанельRomHMac.Отключиться(); 
		ПанельRomHMac = Неопределено;		
	КонецЕсли;
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПодключитьКомпонентуАсинхронноЗавершение", ЭтаФорма, Новый Структура("ПервыйЗапуск, ИДМакета", ПервыйЗапуск,ИДМакета));
	НачатьПодключениеВнешнейКомпоненты(ОбработчикЗавершения, ИДМакета, ИмяИсточника); //, ТипВнешнейКомпоненты.Native);
	
КонецФункции

&НаКлиенте
Процедура ПодключитьКомпонентуАсинхронноЗавершение(КомпонентаПодключена, ДопПараметры) Экспорт
	
	ИДМакета = ДопПараметры.ИДМакета;	
	Если Не КомпонентаПодключена И ДопПараметры.ПервыйЗапуск Тогда
		
		// неудачно, возможно внешняя компонента еще не устанавлена
		ОбработчикЗавершения = Новый ОписаниеОповещения("УстановитьКомпонентуАсинхронноЗавершение", ЭтаФорма, Новый Структура("ИДМакета", ИДМакета));
		НачатьУстановкуВнешнейКомпоненты(ОбработчикЗавершения, ИДМакета);
		Возврат;
		
	КонецЕсли;
	
	//Если НЕ ПанельRomHMac = Неопределено Тогда
	//	ПанельRomHMac.Отключиться(); 
	//	ПанельRomHMac = Неопределено;		
	//КонецЕсли;
	
	// флаг и создание объекта
	//ФлагБиблиотеки=КомпонентаПодключена;
	Если КомпонентаПодключена Тогда
		
		СоздатьОбъектВК(ИДМакета);
		ПодключитьсяКСерверуSC();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКомпонентуАсинхронноЗавершение(ДопПараметры) Экспорт
	
	// повторная попытка подключить внешнюю компоненту
	ПодключитьКомпонентуАсинхронно(Ложь, ДопПараметры.ИДМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъектВК(ИДМакета="")
	
	ИмяИсточника = ИДВАТС;
	
	ПанельRomHMac = Новый("AddIn."+ИмяИсточника+".SmartConnector-Native");
	//ПанельRomHMac.ИсточникСобытия = ИмяИсточника;
	//ПанельRomHMac.РегулярноеВыражение=Stringify("'service':'(simplit.io|"+ИмяИсточника+")'");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяКСерверуSC()
	
	Если ЕстьОшибкиПодключения Тогда
		ОтключитьОбработчикОжидания("ПодключитьсяКСерверуSC");
		Возврат;
	КонецЕсли;
	
	Если ПанельRomHMac = Неопределено Тогда
		ПодключенКАТС = Ложь;
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(КлючAPISC) Тогда
		Если ПанельRomHMac.Подключено Тогда
			ОтключитьОбработчикОжидания("ПодключитьсяКСерверуSC");
			//КоличествоВыполненныхПопытокПодключения = 0;
		Иначе
			//КоличествоВыполненныхПопытокПодключения = КоличествоВыполненныхПопытокПодключения + 1;
			//Если КоличествоВыполненныхПопытокПодключения > КоличествоПопытокПодключения Тогда
			//	ОтключитьОбработчикОжидания("ПодключитьсяКСерверуSC");
			//	Возврат;
			//КонецЕсли;
			//РезультатПодключения = ПанельRomHMac.Подключиться(КлючAPISC);
			
			СтрокаПодключения = СтрШаблон("{""action"": ""connection"", ""apiKey"": ""%1"", ""sipnumber"": ""%2"", ""siplogin"": ""%3""}", КлючAPISC, ВнутреннийНомер, ЛогинТелефонии);
			//РезультатПодключения = 
			// с версии компоненты 2.0 Подключиться - это процедура, а не функция
			ПанельRomHMac.Подключиться(СтрокаПодключения);
			
		КонецЕсли;		
	КонецЕсли;
	
	// ПодключенКАТС будет взводить после получения от сервера ответа во внешнем событии
	//ПодключенКАТС = ПанельRomHMac.Подключено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	Если НЕ ПанельRomHMac = Неопределено
		И ПанельRomHMac.Подключено Тогда
		РезультатОтправкиСобщения = ПанельRomHMac.ОтправитьСообщение(СтрШаблон("{""action"": ""connection"", ""apiKey"": ""%1""}", КлючAPISC));
		Если НЕ РезультатОтправкиСобщения Тогда

		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ПроцедурыПоИсторииЗвонков

&НаКлиенте
Функция ПолучитьИсторию(Дата1, Дата2)
	
	СмещениеЧасовогоПоясаАТС = Софтфон.СмещениеЧасовогоПоясаАТС();
	Если СмещениеЧасовогоПоясаАТС <> 0 Тогда
		Дата1 = Дата1 - СмещениеЧасовогоПоясаАТС;		
		Дата2 = Дата2 - СмещениеЧасовогоПоясаАТС;
	КонецЕсли;
	
	//#6061
	// по истории АТС есть "проблема". примерно так: в 18:52 поступил звонок, например в 18:55 в 1с производится запрос истории, 
	// который фиксирует время последнего успешного получения данных на 18:54 (когда был последний звонок). 
	// Звонок 18:52 длился 10 минут и завершился в 19:02 и только после этого попал в историю на стороне АТС (со временем 18:52). 
	// в следующий раз 1с при запросе запрашивает звонки с 18:54. В итоге звонок 18:52 в истории 1с не появляется.
	// Пока следующее решение: запрашивать 3 часа назад от последнего успешного
	Дата1 = Дата1 - 3*60*60;
	
	Если ИспользуетсяМегафон ИЛИ ИспользуетсяDomRu Тогда
		
		ПолучитьИсторию_ITooLabs(Дата1, Дата2);
		
	ИначеЕсли ИспользуетсяUIS Тогда

		ПолучитьИсторию_UIS(Дата1, Дата2);
		
	ИначеЕсли ИспользуетсяOnlinePBX Тогда

		ПолучитьИсторию_OnlinePBX(Дата1, Дата2);
	
	ИначеЕсли ИспользуетсяSipuni Тогда
		
		ПолучитьИсторию_Sipuni(Дата1, Дата2);
				
	ИначеЕсли ИспользуетсяBinotel Тогда
		
		ПолучитьИсторию_Binotel(Дата1, Дата2);
				
	ИначеЕсли ИспользуетсяMango Тогда

		ПолучитьИсторию_Mango(Дата1, Дата2);
	
	ИначеЕсли ИспользуетсяPhonet Тогда
		
		ПолучитьИсторию_Phonet(Дата1, Дата2);
		
	ИначеЕсли ИспользуетсяБилайн Тогда
		
		ПолучитьИсторию_Beeline(Дата1, Дата2);
				
	ИначеЕсли ИспользуетсяROMAsterisk Тогда
		// 2022-10-06 переделано на общую процедуру ОбработкаИсторияАТСКлиент, чтобы срабатывало оповещение после загрузки истории
		//ОбработкаИсторияАТСAsteriskНаСервере(Дата1, Дата2);
		ОбработкаИсторияАТС_Asterisk(Дата1, Дата2);

	Иначе
		Возврат Неопределено; 	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИсторияАТСКлиент(СтруктПараметры)
		
	ДлительнаяОперация = ОбработкаИсторияАТССервер(СтруктПараметры);
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИсторияАТСЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбработкаИсторияАТССервер(СтруктПараметры)
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обработка истории звонков АТС'");
	
	Результат = ДлительныеОперации.ВыполнитьВФоне("СофтФон.ОбработкаИсторииЗвонковАТС", СтруктПараметры, ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИсторияАТСЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
			
		//ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		//	НСтр("ru = 'Задание прервано по причине:
		//		|%1'"),
		//	Результат.КраткоеПредставлениеОшибки);			
		//Сообщить(ТекстОшибки);
		
		Возврат;
	КонецЕсли;
	
	Оповестить("ЗагруженаИсторияАТС");

КонецПроцедуры

&НаСервере
Функция ИнтервалЗапросаИсторииЗвонков()
	Возврат ПараметрыСеанса.ИнтервалЗапросаИсторииЗвонков;
КонецФункции

&НаСервере
Функция ТелефонияДатаПоследнегоЗапросаИстории()
	Возврат Константы.ТелефонияДатаНачальногоЗапросаИсторииЗвонков.Получить();
КонецФункции

&НаКлиенте
Процедура АвтоматическиЗапроситьИсториюЗвонков()
	
	ДатаНачала = ТелефонияДатаПоследнегоЗапросаИстории();
	Если ДатаНачала = Дата(1, 1, 1) Тогда
		ДатаНачала =  НачалоДня(ТекущаяДата());
	КонецЕсли;
	ДатаОкончания = ТекущаяДата();
	
	Если ДатаНачала + ИнтервалЗапросаИсторииЗвонков() <= ТекущаяДата() Тогда
		ПолучитьИсторию(ДатаНачала, ДатаОкончания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучениеСсылкиФайлаЗаписиЗвонка(РежимЗагрузкиЗаписи, ФайлЗаписиСсылка)
	// РежимЗагрузкиЗаписи = 0 - открыть ссылку
	// РежимЗагрузкиЗаписи = 1 - скачать
	// РежимЗагрузкиЗаписи = 2 - скачать и запустить
	
	Если РежимЗагрузкиЗаписи = 0 Тогда
		// открыть по ссылке
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", СофтФонКлиент);
		НачатьЗапускПриложения(ОписаниеОповещения, ФайлЗаписиСсылка);
	ИначеЕсли РежимЗагрузкиЗаписи = 1 ИЛИ РежимЗагрузкиЗаписи = 2 Тогда
		ПараметрыЗаписи = Новый Структура("ФайлЗаписиСсылка, ЗапуститьПослеСкачивания, Каталог", ФайлЗаписиСсылка, РежимЗагрузкиЗаписи = 2, КаталогЗаписи);
		СофтФонКлиент.ПолучитьФайлЗаписиПоHttpСсылке(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяЗапускЗаданияПолученияИстории()
	
	// проверим завершилось ли предыдущее задание
	ТребуетсяЗапускЗадания = Истина;
	Если НЕ ПустаяСтрока(ИдентификаторФоновогоЗаданияИстории) И ИдентификаторФоновогоЗаданияИстории <> "00000000-0000-0000-0000-000000000000" Тогда
		НайденноеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ИдентификаторФоновогоЗаданияИстории));
		Если НЕ НайденноеЗадание = Неопределено Тогда
			Если НайденноеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				ТребуетсяЗапускЗадания = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат ТребуетсяЗапускЗадания;
	
КонецФункции

&НаКлиенте
Процедура ЭмуляторИстории(Команда)
	
	// iToolabs 0    1        2       3      4       5                         6  7  8
	Данные = "123,missed,9172938570,login,9172938570,2023-02-10T15:05:05+03:00,10,10,";
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", Неопределено);
	СтруктПараметры.Вставить("Данные", Данные);
	СтруктПараметры.Вставить("КоллекцияВнутрНомера", ПолучитьСоответствиеВнутреннихНомеровITooLabs());
		
	ОбработкаИсторияАТСКлиент(СтруктПараметры);

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыПоВходящимЗвонкам

&НаКлиенте
Функция ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, ИДТекущегоЗвонка="", 
										ИДСессииСобытия = "")
	
	Если ПользовательПринимаетВходящиеЗвонки() Тогда
		СтруктураНовойФормы = Новый Структура;
		СтруктураНовойФормы.Вставить("ИДВАТС", ИДВАТС);
		СтруктураНовойФормы.Вставить("НомерАбонента", СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(НомерАбонента));
		СтруктураНовойФормы.Вставить("ВнешняяЛиния", ВнешняяЛиния);
		СтруктураНовойФормы.Вставить("НашВнутреннийНомер", ВнутреннийНомер);
		СтруктураНовойФормы.Вставить("ИДСобытия", ИДТекущегоЗвонка);
		Если ЗначениеЗаполнено(ИДСессииСобытия) Тогда
			СтруктураНовойФормы.Вставить("ИДСессииСобытия", ИДСессииСобытия);
		КонецЕсли;
		ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок", СтруктураНовойФормы, , НомерАбонента, ВариантОткрытияОкна.ОтдельноеОкно,,,);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ЗакрытьФормуВходящегоЗвонка(ИДЗвонка, ИДСессииЗвонка="")
	
	// 2022-05-23
	//Оповестить("ЗакрытьФормуВходящегоЗвонка", ИДЗвонка);
	Если ИДСессииЗвонка = "" Тогда
		Оповестить("ЗакрытьФормуВходящегоЗвонка", ИДЗвонка);
	Иначе
		Оповестить("ЗакрытьФормуВходящегоЗвонка", Новый Структура("ИДЗвонка, ИДСессииЗвонка", ИДЗвонка, ИДСессииЗвонка) );
	КонецЕсли;
		
КонецФункции

&НаСервере
Функция ПользовательПринимаетВходящиеЗвонки()
	Возврат ПараметрыСеанса.ТелефонияПринимаетВходящиеЗвонки;
КонецФункции

#КонецОбласти

#Область ПроцедурыПоИсходящимЗвонкам

&НаКлиенте
Процедура ВыполнитьИсходящийЗвонок(ТелефонКлиента, ИмяКлиента)
	
	Если СофтФон.ИспользуютсяСофтФон() Тогда
		Если НЕ ПанельСофтФон = Неопределено Тогда
			Если НЕ ПанельСофтФон.MakeCall("", ТелефонКлиента, , ИмяКлиента, ИмяКлиента,) = 0 Тогда
				Состояние("Не удалось соединиться с СофтФон");
			КонецЕсли;
		Иначе
			Состояние("Не удалось соединиться с СофтФон");
		КонецЕсли;
		
	ИначеЕсли ИспользуетсяROMAsterisk Тогда
		
		Контекст = СофтФон.ПолучитьКонтекстИсходящихЗвонков();
		Если Не ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Состояние("Не указан внутренний номер, с которого выполняется звонок");
			Возврат;
		КонецЕсли;
		
		СтрокаНабораЦифры = ПодготовитьНомерДляЗвонка(ТелефонКлиента);
		Если ПустаяСтрока(СтрокаНабораЦифры) Тогда
			Состояние("Телефонный номер должен содержать цифры");
			Возврат;
		КонецЕсли;
		
		//отправим комнду проверки на наличие запущенного программного телефона или подключенного аппаратного. ответ поймает и отработает функция в обработке "СофтФон"
		CRLF=Chars.CR+Chars.LF;
		ТекстКоманды = "Action: Command"+CRLF+
		"Command: sip show peer 118"+CRLF+CRLF;
		ПанельRomAsterisk.ВыполнитьКоманду(ТекстКоманды);
		
		//отправляем команду звонка
		CRLF=Chars.CR+Chars.LF;
		ТекстКоманды="Action: Originate"+CRLF+
		//"Channel: SIP/"+ВнутреннийНомер+CRLF+
		"Channel: "+КаналИсходящегоВызова+CRLF+
		"Context: "+Контекст+CRLF+
		"Exten: "+СтрокаНабораЦифры+CRLF+
		"Priority: 1"+CRLF+
		"Callerid: "+ВнутреннийНомер+CRLF+
		"Timeout: 30000"+CRLF+CRLF;
		
		ПанельRomAsterisk.ВыполнитьКоманду(ТекстКоманды);
		
	ИначеЕсли ИспользуетсяOnlinePBX Тогда
		
		Номер = СофтФон.ОставитьТолькоЦифры(ТелефонКлиента);
		Если Не ЗначениеЗаполнено(Номер) Тогда
			ПоказатьОповещениеПользователя("Не указан номер, куда выполняется звонок");
			Возврат;
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			ПоказатьОповещениеПользователя("Не указан внутренний номер");
			Возврат;
		КонецЕсли;
		
		ВыполнитьИсходящийЗвонок_OnlinePBX(Номер);
			
	ИначеЕсли ИспользуетсяМегафон ИЛИ ИспользуетсяDomRu Тогда
	
		Номер = СофтФон.ОставитьТолькоЦифры(ТелефонКлиента);
		Если ПустаяСтрока(Номер) Тогда
			ПоказатьОповещениеПользователя("Телефонный номер должен содержать цифры");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Возврат;
		КонецЕсли;
		
		ВыполнитьИсходящийЗвонок_ITooLabs(Номер);
		
	ИначеЕсли ИспользуетсяUIS Тогда 
		
		Номер = СофтФон.ОставитьТолькоЦифры(ТелефонКлиента);
		Если ПустаяСтрока(Номер) Тогда
			ПоказатьОповещениеПользователя("Телефонный номер должен содержать цифры");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Возврат;
		КонецЕсли;
		
		ВыполнитьИсходящийЗвонок_UIS(Номер);
		
	ИначеЕсли ИспользуетсяBinotel Тогда //++2020-06-29
		
		СтрокаНабораЦифры = ПодготовитьНомерДляЗвонка(ТелефонКлиента);
		Если ПустаяСтрока(СтрокаНабораЦифры) Тогда
			ПоказатьОповещениеПользователя("Телефонный номер должен содержать цифры");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Возврат;
		КонецЕсли;
		
		ВыполнитьИсходящийЗвонок_Binotel(Номер);
		
	ИначеЕсли ИспользуетсяMango Тогда
	
		Номер = СофтФон.ОставитьТолькоЦифры(ТелефонКлиента);
		Если ПустаяСтрока(Номер) Тогда
			ПоказатьОповещениеПользователя("Телефонный номер должен содержать цифры");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Возврат;
		КонецЕсли;
		
		ВыполнитьИсходящийЗвонок_Mango(Номер);
		
	ИначеЕсли ИспользуетсяPhonet Тогда //++2021-12
		
		ВыполнитьИсходящийЗвонок_Phonet(ТелефонКлиента);
		
	ИначеЕсли ИспользуетсяБилайн Тогда 
		
		//Номер телефона, на который будет совершен вызов в международном формате: 
		// + (YYY) ХХХ ХХ ХХ, где + - обязательный символ, YYY - Код страны, XXX- номер телефона. Ограничение длины телефона с учетом кода страны: Min - 8 цифр Max - 13 цифр
	
		Номер = Софтфон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ТелефонКлиента);
		Если ПустаяСтрока(Номер) Тогда
			ПоказатьОповещениеПользователя("Телефонный номер должен содержать цифры");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Возврат;
		КонецЕсли;
		
		ВыполнитьИсходящийЗвонок_Beeline(Номер);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьНомерДляЗвонка(Знач Номер)
	
	Номер = СтрЗаменить(Номер, "+7", "8");
	ТолькоЦифры="";
	Для Индекс=1 По СтрДлина(Номер) Цикл
		Символ=Сред(Номер,Индекс,1);
		Если КодСимвола(Символ)>47 и КодСимвола(Символ)<58 Тогда
			ТолькоЦифры=ТолькоЦифры+Символ;
		КонецЕсли; 
	КонецЦикла; 
	Возврат ТолькоЦифры;

КонецФункции

#КонецОбласти

#Область РарусСофтФон

// Вспомогательная функция перевода шестнацатиричного числа в десятичное 
//
// Параметры:
//	Hex	- Строка	- Число в шестнадцатиричном представлении
//
// Возвращаемое значение:
//	Число	- Десятичное число
//
Функция Hex2Число(Hex) 
	Стр	= ВРег(СокрЛП(Hex));
	Dec	= 0;
	Для Х = 1 По СтрДлина(Стр) Цикл
		Dec	= Dec + Найти("123456789ABCDEF", Сред(Стр, Х, 1)) * Pow(16, СтрДлина(Стр) - Х);
	КонецЦикла;
	Возврат Dec;
КонецФункции

// Функция получает значение из строки
//
// Параметры:
//	ЗначениеВСтроке	- Строка	- Строка, содержащая значение
//	Кавычек			- Число		- Количество кавычек в строке
//
// Возвращаемое значение:
//	Произвольный	- Значение из строки
//
Функция ПолучитьЗначениеИзСтроки(ЗначениеВСтроке, Кавычек)
	Если ЗначениеВСтроке = "" Тогда
		Возврат Неопределено;
	ИначеЕсли Кавычек > 0 Тогда
		Возврат ЗначениеВКавычках(ЗначениеВСтроке);
	Иначе
		Возврат ЗначениеБезКавычек(ЗначениеВСтроке);
	КонецЕсли;
КонецФункции

// Функция получает значение из строки без кавычек
//
// Параметры:
//	ЗначениеВСтроке	- Строка	- Строка, содержащая значение
//
// Возвращаемое значение:
//	Строка	- Значение из строки
//
Функция ЗначениеВКавычках(ЗначениеВСтроке)
	Возврат ЗначениеВСтроке;
КонецФункции 

// Функция получает значение из строки с кавычками
//
// Параметры:
//	ЗначениеВСтроке	- Строка	- Строка, содержащая значение
//
// Возвращаемое значение:
//	Произвольный	- Значение из строки
//
Функция ЗначениеБезКавычек(ЗначениеВСтроке)
	// Это число, булево или null.
	// Хотя здесь могут быть и строки. Например: {Code:123}
	Стр = ВРег(ЗначениеВСтроке);
	Если Стр = "TRUE" Тогда
		Возврат Истина;
	ИначеЕсли Стр = "FALSE" Тогда
		Возврат Ложь;
	ИначеЕсли Стр = "NULL" Тогда
		Возврат Неопределено;
	КонецЕсли;
	// Пробежимся по предполагаемому "числу"
	Экспонента	= Ложь;
	ХХ			= " ";
	Для Индекс = 1 По СтрДлина(Стр) Цикл
		Х = Сред(Стр, Индекс, 1);
		Если Найти("0123456789.+-", Х) Тогда
			ХХ = ХХ + Х;
		ИначеЕсли Х = "E" Тогда
			#Если ВебКлиент Тогда
				Возврат ЗначениеВСтроке;
			#Иначе
				Экспонента = Истина;
				УУ = XMLЗначение(Тип("Число"),ХХ);
				ХХ = " ";
			#КонецЕсли
		Иначе
			// Это не число, а строка
			Возврат ЗначениеВСтроке;
		КонецЕсли;
	КонецЦикла;
	#Если ВебКлиент Тогда
		Попытка
			ХХ = Число(ХХ);
		Исключение
		КонецПопытки;	
	#Иначе
		ХХ = XMLЗначение(Тип("Число"), ХХ);
		Если Экспонента Тогда
			ХХ = УУ * Pow(10, ХХ);
		КонецЕсли;
	#КонецЕсли
	Возврат ХХ;
КонецФункции

// Функция получает описание объекта из модели JSON 
//
// Параметры:
//  СтрJSON	- Строка	- Описание объекта в виде модели json
//
// Возвращаемое значение:
//  Значение	- Соответствие	- Соответствие свойств и значений объекта 
//
Функция UnJSON(СтрJSON) Экспорт 
	
	СтрJSON	= ЗаменитьНедопустимыеСимволыXML(СтрJSON);	
	Значение = "";
	Если ПолучитьЗначениеJSON(СтрJSON, Значение) = 0 Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции // сфпUnJSON()

// Функция заменяет недопустимые символы в XML-строке на заданные символы
//
// Параметры:
//   Текст			– Строка	– Строка, в которой требуется выполнить замену недопустимых символов.
//   СимволЗамены	– Строка	– Строка, на которую требуется выполнить замену недопустимого символа в XML-строке
// 
//  Возвращаемое значение:
//    Строка - Строка, полученная заменой недопустимых символов в XML-строке.
//
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") Экспорт
	ПозицияНачала = 1;
	Пока Истина Цикл
		Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
		Если Позиция = 0 Тогда
			Прервать;
		КонецЕсли;
		Если Позиция > 1 Тогда
			НедопустимыйСимвол = Сред(Текст, Позиция - 1, 1);
			Если НайтиНедопустимыеСимволыXML(НедопустимыйСимвол) > 0 Тогда
				Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
			КонецЕсли;
		КонецЕсли;
		НедопустимыйСимвол = Сред(Текст, Позиция, 1);
		Если НайтиНедопустимыеСимволыXML(НедопустимыйСимвол) > 0 Тогда
			Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
		КонецЕсли;
		ПозицияНачала = Позиция + 1;
	КонецЦикла;
	Возврат Текст;
КонецФункции // сфпЗаменитьНедопустимыеСимволыXML()

// Функция осуществляет непосредственный разбор JSON 
//
// Параметры:
//  СтрJSON		- Строка		- Описание объекта в виде модели json
//  Значение	- Соответствие	- Соответствие свойств и значений объекта 
//	Позиция		- Число			- Позиция в описании
//	Ключ		- Строка		- Ключ соответствия
//
// Возвращаемое значение:
//  Число	- Позиция в описании
//
Функция ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция = 1, Ключ = "") Экспорт
	Кавычка			= "";
	ЗначениеВСтроке	= "";
	Кавычек			= 0;
	Комментарий		= Ложь;
	Строка			= Ложь;
	Пока Позиция <= СтрДлина(СтрJSON) Цикл
		ХХ		= Сред(СтрJSON, Позиция, 2);
		Х		= Лев(ХХ,1);
		Позиция	= Позиция + 1;
		Если Х > " " ИЛИ Строка Тогда // Отсекаем всякий хлам
			Если Комментарий Тогда
				// Это комментарий. Крутимся в цикле пока не встретится конец комментария
				Если ХХ = "*/" Тогда
					// Комментарий закончился
					Комментарий	= Ложь;
					Позиция		= Позиция + 1;
				КонецЕсли;
			ИначеЕсли Х = "\" Тогда
				Позиция	= Позиция + 1;
				ХХ		= ВРег(ХХ);
				Если ХХ = "\""" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + """";
				ИначеЕсли ХХ = "\\" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + "\";
				ИначеЕсли ХХ = "\/" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + "/";
				ИначеЕсли ХХ = "\B" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символ(8);
				ИначеЕсли ХХ = "\F" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ПФ; // Перевод формы (страницы)
				ИначеЕсли ХХ = "\N" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ПС; // Перевод строки
				ИначеЕсли ХХ = "\R" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ВК; // Возврат каретки
				ИначеЕсли ХХ = "\T" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ВТаб; // Символ вертикальной табуляции
				ИначеЕсли ХХ = "\U" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символ(Hex2Число(Сред(СтрJSON, Позиция, 4))); // Шестнадцатиричное число
					Позиция = Позиция + 4;
				КонецЕсли;
			ИначеЕсли Строка Тогда
				// Если строка не закончилась, то пропускаем управляющие символы
				Если Х = Кавычка Тогда
					//Закончилась строка
					Строка	= Ложь;
					Кавычек	= Кавычек + 1;
				Иначе
					ЗначениеВСтроке	= ЗначениеВСтроке + Х;
				КонецЕсли;
			ИначеЕсли ХХ = "/*" Тогда
				// Начался комментарий
				Комментарий	= Истина;
				Позиция		= Позиция + 1;
			ИначеЕсли Найти("""'{}[]:,", Х) > 0 Тогда
				Если (Х = """") ИЛИ (Х = "'") Тогда
					// Началась строка
					// Строка - коллекция нуля или больше символов Unicode, заключенная в
					// двойные кавычки, используя "\" в качестве символа экранирования.
					// Символ представляется как односимвольная строка.
					// Похожий синтаксис используется в C и Java.
					Строка	= Истина;
					Кавычка	= Х;
					Кавычек	= Кавычек + 1;
				ИначеЕсли Х = "{" Тогда
					// Начался объект
					// Объект - неупорядоченный набор пар ключ/значение.
					// Объект начинается с "{" и заканчивается "}".
					// Каждое имя сопровождается ":", пары ключ/значение разделяются ",".
					вОбъект	= Новый Соответствие;
					Пока Истина Цикл
						// Получим ключ и значение
						Ключ	= "";
						Режим	= ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция, Ключ);
						// 0 - есть значение и не конец объекта (запятая)
						// 1 - есть значение и конец объекта
						// 2 - нет значения и не конец объекта (запятая)
						// 3 - нет значения и конец объекта
						Если Режим = 0 Тогда
							вОбъект.Вставить(Ключ, Значение);
						ИначеЕсли Режим = 1 Тогда
							вОбъект.Вставить(Ключ, Значение);
							Прервать;
						ИначеЕсли Режим = 3 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Значение	= вОбъект;
					Возврат 0;
				ИначеЕсли Х = "[" Тогда
					// Начался массив
					// Массив - упорядоченная коллекция значений.
					// Массив начинается с "[" и заканчивается "]".
					// Значения разделены ",".
					Массив	= Новый Массив;
					Пока Истина Цикл
						Режим	= ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция);
						// 0 - есть значение и не конец массива (запятая)
						// 1 - есть значение и конец массива
						// 2 - нет значения и не конец массива (запятая)
						// 3 - нет значения и конец массива
						Если Режим = 0 Тогда
							Массив.Добавить(Значение);
						ИначеЕсли Режим = 1 Тогда
							Массив.Добавить(Значение);
							Прервать;
						ИначеЕсли Режим = 3 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Значение	= Массив;
					Возврат 0;
				ИначеЕсли (Х = "]") ИЛИ (Х = "}") Тогда
					// Закончился массив/объект
					Если (ЗначениеВСтроке = "") И (Кавычек = 0) Тогда
						Возврат 3; // Нет значения и конец массива/объекта
					Иначе
						Значение	= ПолучитьЗначениеИзСтроки(ЗначениеВСтроке,Кавычек);
						Возврат 1; // Есть значение и конец массива/объекта
					КонецЕсли;
				ИначеЕсли Х = ":" Тогда
					Ключ	= ЗначениеВСтроке;
					Возврат ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция);
				Иначе
					// Запятая
					Прервать;
				КонецЕсли;
			Иначе
				ЗначениеВСтроке	= ЗначениеВСтроке + Х;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Кавычек > 0 Тогда
		Значение = ЗначениеВКавычках(ЗначениеВСтроке);
	Иначе
		Если ЗначениеВСтроке = "" Тогда
			Возврат 2;
		Иначе
			Значение	= ЗначениеБезКавычек(ЗначениеВСтроке);
		КонецЕсли;
	КонецЕсли;
	Возврат 0;
КонецФункции 

#КонецОбласти

#Область Asterisk

&НаКлиенте
Процедура ПодключитьПанель_Asterisk()
	
	ПодключенКАТС = Ложь;
	Результат = Ложь;
	Попытка
		Результат = ПодключитьКомпоненту_Asterisk_Синхронно();
	Исключение
		ПоказатьОповещениеПользователя("Не удалось установить компоненту для АТС Asterisk " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Если НЕ Результат Тогда
		ПоказатьОповещениеПользователя("Не удалось подключить компоненту для АТС Asterisk");
		Возврат;
	КонецЕсли;
	
	ПодключитьсяКСерверуAsterisk();
	
КонецПроцедуры		
		
&НаКлиенте
Процедура ПодключитьсяКСерверуAsterisk()

	//подключаемся к серверу
	// IP-адрес или DNS-имя должны быть указаны обязательно
	Если Не ЗначениеЗаполнено(СерверAsterisk) Тогда
		ПоказатьОповещениеПользователя("Не указан параметр соединения: IP-адрес сервера телефонии");
		Возврат;
	КонецЕсли;
	
	Успешно = Ложь;
	Попытка
		Успешно = ПанельRomAsterisk.Подключиться(СерверAsterisk, ПортAsterisk);
	Исключение
		ПоказатьОповещениеПользователя("Не удалось подключиться к серверу ip-телефонии. " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Если ПанельRomAsterisk = Неопределено 
		ИЛИ НЕ Успешно = Истина Тогда
		ПодключенКАТС = Ложь;
		Возврат;
	КонецЕсли;
	
	// установки режима вывода всех сообщений сокета во внешнее событие
	ПанельRomAsterisk.УстановитьРежимПрослушивания(Истина);
	
	CRLF = Chars.CR+Chars.LF;
	ТекстКоманды=
		"Action: Login"+CRLF+
		"Username: "+ЛогинАТС+CRLF+
		"Secret: "+ПарольАТС+CRLF+CRLF;
	
	УспешнаяОтправка = ПанельRomAsterisk.ВыполнитьКоманду(ТекстКоманды);
	
	ПодключенКАТС = Истина;
	УстановитьСтатусПользовательПодключен(ПодключенКАТС);
	ОтключитьОбработчикОжидания("ПодключитьсяКСерверуAsterisk");
	
	//применим наложение фильтра на получение событий
	Если Вариант53_Asterisk 
		ИЛИ Вариант296_Asterisk
		ИЛИ Вариант85_Asterisk // #11582 для получения "родительского" звонка, в котором хранится информация о внешней линии
		Тогда
		// для указанных вариантов получаем все события Newchannel
		// для варианта 296 использется для получения "родительского" звонка, в котором хранится информация о внешней линии
		РегулярноеВыражение = "DialBegin.{1,}?ВнутреннийНомер|Newchannel|AgentCalled.{1,}?ВнутреннийНомер|Hangup.{1,}?ВнутреннийНомер|BridgeEnter.{1,}?ВнутреннийНомер|Disconnect.{1,}?ВнутреннийНомер|AgentConnect.{1,}?ВнутреннийНомер|Bridge.{1,}?ВнутреннийНомер|Dial.{1,}?ВнутреннийНомер";
		
	ИначеЕсли Вариант296_1_Asterisk Тогда
		// "режем сильно" 
		РегулярноеВыражение = "Newchannel.{1,}?from-trunk-custom|DialBegin.{1,}?RING|Hangup.{1,}?ВнутреннийНомер|BridgeEnter.{1,}?ВнутреннийНомер|Disconnect.{1,}?ВнутреннийНомер";
		
	Иначе
		РегулярноеВыражение = "DialBegin.{1,}?ВнутреннийНомер|Newchannel.{1,}?ВнутреннийНомер|AgentCalled.{1,}?ВнутреннийНомер|Hangup.{1,}?ВнутреннийНомер|BridgeEnter.{1,}?ВнутреннийНомер|Disconnect.{1,}?ВнутреннийНомер|AgentConnect.{1,}?ВнутреннийНомер|Bridge.{1,}?ВнутреннийНомер|Dial.{1,}?ВнутреннийНомер";
	КонецЕсли;
	
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение,"ВнутреннийНомер",ВнутреннийНомер);
	ПанельRomAsterisk.УстановитьРегулярноеВыражение(РегулярноеВыражение);
	
	// клиент 296: на стороне АТС раз в час срабатывает: "core restart when convenient", в результате соединение теряется
	Если ПодключенКАТС И ИнтервалПроверкиПодключенияКАТС > 0 Тогда
		ОтключитьОбработчикОжидания("ПроверитьПодключениеКАТС");
		ПодключитьОбработчикОжидания("ПроверитьПодключениеКАТС", ИнтервалПроверкиПодключенияКАТС, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодключитьКомпоненту_Asterisk_Синхронно()
	
	ИмяМакета = "ОбщийМакет.SC_AsteriskZIP";
	
	// попытка установить компоненту
	Результат = ПодключитьВнешнююКомпоненту(ИмяМакета, "SmartCeiling");
	
	Если Не Результат Тогда
		
		// неудачно, возможно еще не установлен
		УстановитьВнешнююКомпоненту(ИмяМакета);
		Результат = ПодключитьВнешнююКомпоненту(ИмяМакета, "SmartCeiling");
		
	КонецЕсли; 
	
	// флаг, создание объекта
	ФлагПодключенияВК = Результат;
	Если Результат Тогда
		ПанельRomAsterisk = Новый("AddIn.SmartCeiling.SC-Asterisk-Native");
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_Asterisk(НомерАбонента, ИДЗвонка, ИДСессииЗвонка="")
	
	Оповестить( "ПоднятиеТрубки_Asterisk", Новый Структура("НомерАбонента, ИДЗвонка, ИДСессииЗвонка", НомерАбонента, ИДЗвонка, ИДСессииЗвонка) );
		
КонецФункции

&НаКлиенте
Процедура Вариант_53_Asterisk(ВидСобытия, ДанныеСобытия)
	
	Если ВидСобытия = "NEWCHANNEL" Тогда
		
		ВнешняяЛиния = ДанныеСобытия.Получить("Exten");
		НомерАбонента = ДанныеСобытия.Получить("CallerIDNum");
		ИдЗвонка = ДанныеСобытия.Получить("Uniqueid");       //2022-06-08
		ИдЗвонкаДоТочки = ПолучитьИдСобытияДоТочки(ИдЗвонка);
		
		Если НЕ ПустаяСтрока(ВнешняяЛиния) Тогда
			//пришло событие с входящим звонком на очередь, тут нет номера внутреннего абонента
			//копим историю
			НоваяСтрока = ИсторияAsterisk.Добавить();
			НоваяСтрока.Event = ВидСобытия;
			НоваяСтрока.Uniqueid = ИдЗвонкаДоТочки;
			НоваяСтрока.Exten = ВнешняяЛиния;
			НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
			НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");
			НоваяСтрока.Uniqueid1 = ИдЗвонка; //2022-06-08
			
		ИначеЕсли СокрЛП(НомерАбонента) = СокрЛП(ВнутреннийНомер) Тогда
			//событие звонка упало на наш внутренний номер
			
			//найдем внешнюю линию в истории
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("Uniqueid", ИдЗвонкаДоТочки);
			НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(ОтборСтрок);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ВнешняяЛиния = НайденныеСтроки[0].Exten;
				КтоЗвонит = НайденныеСтроки[0].CallerID2;
				ИдСессииЗвонка  = НайденныеСтроки[0].Uniqueid1; //2022-06-08
			КонецЕсли;
			
			//2022-06-08
			//ДействияПриНачалеВходящегоЗвонка(КтоЗвонит, ВнешняяЛиния, ВнутреннийНомер, ИдЗвонкаДоТочки);
			ДействияПриНачалеВходящегоЗвонка(КтоЗвонит, ВнешняяЛиния, ВнутреннийНомер, ИдЗвонка, ИдСессииЗвонка);
			
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия) = "BRIDGE" Тогда
		
		//2022-06-08 переделано: было на форме входящего звонка
		
		ИДЗвонка = ДанныеСобытия.Получить("Uniqueid2");
		ИДСессии = ДанныеСобытия.Получить("Uniqueid1");
		Bridgestate = ДанныеСобытия.Получить("Bridgestate");  // LINK / UNLINK
		CallerID2 = ДанныеСобытия.Получить("CallerID2");
		
		Если ВРег(Bridgestate) = "LINK" Тогда
					
			Если СокрЛП(CallerID2) = СокрЛП(ВнутреннийНомер) Тогда
				//создался канал между 2 мя - подняли трубку и начали разговор
				ЗакрытьФормуВходящегоЗвонка(ИДЗвонка);
				
				НомерАбонента = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(СокрЛП(ДанныеСобытия.Получить("CallerID1")));
				ДействияПриПоднятииТрубки_Asterisk(НомерАбонента, ИДЗвонка, ИДСессии);
			КонецЕсли;
			
			ЗакрытьФормуВходящегоЗвонка(ИДСессии); // для закрытия формы входящео звонка у других пользователей
		КонецЕсли;
		
	ИначеЕсли ВидСобытия = "HANGUP" Тогда
		
		//Разорвал канал - положили трубку или разговор окончен - закрываем окно входящего звонка
		
		//2022-06-08 переделано
		
		//CallerIDNum = ДанныеСобытия.Получить("CallerIDNum");
		//ConnectedLineNum = ДанныеСобытия.Получить("ConnectedLineNum");
		//ConnectedLineNum = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ConnectedLineNum);
		//Channel = ДанныеСобытия.Получить("Channel");
		//
		//Если (СокрЛП(CallerIDNum) = СокрЛП(ВнутреннийНомер) или (СтрНайти(Channel,"SIP/"+ВнутреннийНомер)=1)) и СокрЛП(ConnectedLineNum) = СокрЛП(НомерАбонента) Тогда
		//	Закрыть();
		//КонецЕсли;
		
		ИдЗвонка = ДанныеСобытия.Получить("Uniqueid");
		ЗакрытьФормуВходящегоЗвонка(ИдЗвонка);
		ИсторияAsterisk.Очистить();
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура Вариант_85_Asterisk(ВидСобытия, ДанныеСобытия)
	
	Если ВРег(ВидСобытия)="DIALBEGIN" Тогда
		
		//Начался звонок до поднятия трубки. Тут показываем окошко входящего звонка
		CallerID = ДанныеСобытия.Получить("CallerIDNum");
		DestCallerIDNum = ДанныеСобытия.Получить("DestCallerIDNum");
		
		Если НЕ СокрЛП(ВнутреннийНомер) = СокрЛП(CallerID) 
			И СокрЛП(ВнутреннийНомер) = СокрЛП(DestCallerIDNum) Тогда //ROM-Asterisk сначала звонит самому себе при исходящем звонке, такие события нужно исключить, реагируем когда позвонили именно нам
			
			НомерАбонента = ДанныеСобытия.Получить("DestConnectedLineNum");
			ВнешняяЛиния = "";
			ВнутреннийНомер = ВнутреннийНомер;
			
			//найдем внешнюю линию в истории
			ИдЗвонка = ДанныеСобытия.Получить("DestLinkedid");
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("Uniqueid",ИдЗвонка);
			НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(ОтборСтрок);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ВнешняяЛиния = НайденныеСтроки[0].Exten;
			КонецЕсли;
			// для клиента 164 (14.0)
			Если ПустаяСтрока(ВнешняяЛиния) И НЕ ДанныеСобытия.Получить("ConnectedLineNum") = Неопределено Тогда
				ВнешняяЛиния = ДанныеСобытия.Получить("ConnectedLineNum");
			КонецЕсли;
						 
			Если НЕ НомерАбонента = ВнутреннийНомер Тогда	// обратный звонок АТС при исходящем звонке из 1с				
				ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, ИдЗвонка);				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия)="NEWCHANNEL" Тогда
		
		CallerID=ДанныеСобытия.Получить("CallerIDNum");
		Если НЕ СокрЛП(ВнутреннийНомер) = СокрЛП(CallerID) Тогда
			//копим историю
			НоваяСтрока = ИсторияAsterisk.Добавить();
			НоваяСтрока.Event = ВидСобытия;
			НоваяСтрока.Uniqueid = ДанныеСобытия.Получить("Uniqueid");
			НоваяСтрока.Uniqueid1 = ДанныеСобытия.Получить("Linkedid");
			НоваяСтрока.Exten = ДанныеСобытия.Получить("Exten");
			НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура Вариант_85_2_Asterisk(ВидСобытия, ДанныеСобытия)
	
	Если ВРег(ВидСобытия)="AGENTCALLED" Тогда
		
		//Начался звонок до поднятия трубки. Тут показываем окошко входящего звонка
		CallerID = ДанныеСобытия.Получить("CallerIDNum"); //номер телефона клиента (кто звонит)
		Interface = ДанныеСобытия.Получить("Interface"); //строка вида "SIP/ВнутреннийНомер"
		ИдЗвонка = ДанныеСобытия.Получить("Linkedid");
		
		Если НЕ СокрЛП(ВнутреннийНомер) = СокрЛП(CallerID) 
			И СтрНайти(Interface, СокрЛП(ВнутреннийНомер)) > 0 Тогда //ROM-Asterisk сначала звонит самому себе при исходящем звонке, такие события нужно исключить, реагируем когда позвонили именно нам
			
			НомерАбонента = CallerID;
			ВнешняяЛиния = ДанныеСобытия.Получить("Exten");
			
			ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, ИдЗвонка);
			
		КонецЕсли;
		
		
    // перенесено с формы входящего звонка, не проверялось
	ИначеЕсли ВРег(ВидСобытия) = "AGENTCONNECT" Тогда
		
		//создался канал между 2 мя - подняли трубку и начали разговор
		Interface = ДанныеСобытия.Получить("Interface"); //внутренний номер пользователя в формате "SIP/ВнутреннийНомер"
		CallerIDNum = ДанныеСобытия.Получить("CallerIDNum"); //номер телефона клиента (кто звонит)
		НомерАбонента = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(CallerIDNum);
		ИдЗвонка = ДанныеСобытия.Получить("Linkedid");
		
		Если СокрЛП(Interface) = "SIP/"+СокрЛП(ВнутреннийНомер) Тогда	
			ДействияПриПоднятииТрубки_Asterisk(НомерАбонента, ИдЗвонка);
		КонецЕсли;
		
		ЗакрытьФормуВходящегоЗвонка(ИдЗвонка);	
		
	// 2022-10-05
	ИначеЕсли ВРег(ВидСобытия) = "HANGUP" Тогда	
		
		//Разорвал канал - положили трубку или разговор окончен - закрываем окно входящего звонка
		Channel = ДанныеСобытия.Получить("Channel");
		ИдЗвонка = ДанныеСобытия.Получить("Linkedid");
		
		Если (СтрНайти(Channel, "SIP/"+ВнутреннийНомер)=1)  
			Тогда
			ЗакрытьФормуВходящегоЗвонка(ИдЗвонка);
			//ИсторияAsterisk.Очистить();
		КонецЕсли;

				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСобытий_Вариант_93_Asterisk(ВидСобытия, ДанныеСобытия)
	
	//копим историю звонков
	Если ВРег(ВидСобытия)="NEWCHANNEL" Тогда
		//1. Пришел звонок на наш внешний номер
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВидСобытия;
		НоваяСтрока.Uniqueid = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid"));
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Exten = ДанныеСобытия.Получить("Exten");
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");
		НоваяСтрока.CallerIDName = ДанныеСобытия.Получить("CallerIDName");

	ИначеЕсли ВРег(ВидСобытия)="DIAL" Тогда
		//2. АТС перепросила звонок на менеджера
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВидСобытия;
		НоваяСтрока.Uniqueid = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("UniqueID"));
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Uniqueid2 = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("DestUniqueID"));
		НоваяСтрока.Exten = "";
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");
		
	ИначеЕсли ВРег(ВидСобытия) = "HANGUP" Тогда	
		
		//Разорвал канал - положили трубку или разговор окончен - закрываем окно входящего звонка
		CallerIDNum = ДанныеСобытия.Получить("CallerIDNum");
		Uniqueid = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid"));
		ConnectedLineNum = ДанныеСобытия.Получить("ConnectedLineNum");
		ConnectedLineNum = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ConnectedLineNum);
		Channel = ДанныеСобытия.Получить("Channel");
		
		Если (СокрЛП(CallerIDNum) = СокрЛП(ВнутреннийНомер) ИЛИ (СтрНайти(Channel, "SIP/"+ВнутреннийНомер)=1)) 
			//И СокрЛП(ConnectedLineNum) = СокрЛП(НомерАбонента) 
			Тогда
			ЗакрытьФормуВходящегоЗвонка(Uniqueid);
			ИсторияAsterisk.Очистить();
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия)="BRIDGE" Тогда
		//3. Менеджер поднял трубку....
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВидСобытия;
		НоваяСтрока.Uniqueid = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid1"));
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Uniqueid2 = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid2"));
		НоваяСтрока.Exten = "";
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerID1");
		
	КонецЕсли;
		
	
	//отрабатываем события
	Если ВРег(ВидСобытия)="DIAL" Тогда
		Если ПользовательПринимаетВходящиеЗвонки() Тогда
			
			ВнутреннийНомерКудаУпалЗвонок = ДанныеСобытия.Получить("Dialstring");
			Если СокрЛП(ВнутреннийНомерКудаУпалЗвонок) = СокрЛП(ВнутреннийНомер) 
				Тогда
				//к нам упал
				
				ВнешняяЛиния = "";
				Отбор = Новый Структура;
				Отбор.Вставить("Uniqueid", ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("UniqueID")));
				Отбор.Вставить("Event","NEWCHANNEL");
				НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда						                                          				
					ВнешняяЛиния = НайденныеСтроки[0].Exten;						 						
				КонецЕсли;
				
				НомерАбонента = ДанныеСобытия.Получить("CallerIDNum");
				ИдЗвонка = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("UniqueID"));
				
				ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, ИдЗвонка);
								
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия) = "BRIDGE" Тогда
		
		времИДсобытия = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid1"));
		
		Если СокрЛП(ДанныеСобытия.Получить("CallerID2")) = СокрЛП(ВнутреннийНомер) Тогда
			//создался канал между 2 мя - подняли трубку и начали разговор. Тут создаем документ "Лид"		
			НомерАбонента = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(СокрЛП(ДанныеСобытия.Получить("CallerID1")));
			ДействияПриПоднятииТрубки_Asterisk(НомерАбонента, времИДсобытия);
		КонецЕсли; 
		ЗакрытьФормуВходящегоЗвонка(времИДсобытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСобытий_Вариант_296_Asterisk(ВидСобытия, ДанныеСобытия)
	
	// порядок событий
	// NEWCHANNEL с CallerIDName / Exten. Uniqueid = ИД1 - первый ид звонка (в частности используется в истории)
	// DIAL Dialstring = ВнутреннийНомер@...  UniqueID = ИД1, DestUniqueID = ИД2
	// DIAL Dialstring = ВнутреннийНомер. Только здесь должна появляться форма звонка. UniqueID = ИД3, DestUniqueID = ИД4
	// BRIDGE CallerID2 = ВнутреннийНомер. Подняли трубку
	// HANGUP CallerIDNum = ВнутреннийНомер. Сброс. Посылаем оповещение закрытия формы входящего звонка. ИД? 
	
	//копим историю звонков
	Если ВРег(ВидСобытия)="NEWCHANNEL" Тогда
		//1. Пришел звонок на наш внешний номер
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВРег(ВидСобытия);
		НоваяСтрока.Uniqueid = ДанныеСобытия.Получить("Uniqueid");
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Exten = ДанныеСобытия.Получить("Exten");
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");
		НоваяСтрока.CallerIDName = ДанныеСобытия.Получить("CallerIDName");

	ИначеЕсли ВРег(ВидСобытия)="DIAL" Тогда
		//2. АТС перепросила звонок на менеджера
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВРег(ВидСобытия);
		НоваяСтрока.Uniqueid = ДанныеСобытия.Получить("UniqueID");
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Uniqueid2 = ДанныеСобытия.Получить("DestUniqueID");
		НоваяСтрока.Exten = "";
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");
		НоваяСтрока.Dialstring = ДанныеСобытия.Получить("Dialstring");
		
	ИначеЕсли ВРег(ВидСобытия) = "HANGUP" Тогда	
		
		//Разорвал канал - положили трубку или разговор окончен - закрываем окно входящего звонка
		CallerIDNum = ДанныеСобытия.Получить("CallerIDNum");
		Uniqueid = ДанныеСобытия.Получить("Uniqueid");
		ConnectedLineNum = ДанныеСобытия.Получить("ConnectedLineNum");
		//ConnectedLineNum = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ConnectedLineNum);
		Channel = ДанныеСобытия.Получить("Channel");
		
		Если //(СокрЛП(CallerIDNum) = СокрЛП(ВнутреннийНомер) ИЛИ (СтрНайти(Channel, "SIP/"+ВнутреннийНомер)=1)) 
			СокрЛП(ConnectedLineNum) = СокрЛП(ВнутреннийНомер) 
			Тогда
			ЗакрытьФормуВходящегоЗвонка(Uniqueid);
			ИсторияAsterisk.Очистить();
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия)="BRIDGE" Тогда
		//3. Менеджер поднял трубку....
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВРег(ВидСобытия);
		НоваяСтрока.Uniqueid = ДанныеСобытия.Получить("Uniqueid1");
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Uniqueid2 = ДанныеСобытия.Получить("Uniqueid2");
		НоваяСтрока.Exten = "";
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerID1");
		
	КонецЕсли;
		
	
	//отрабатываем события
	Если ВРег(ВидСобытия)="DIAL" Тогда
		Если ПользовательПринимаетВходящиеЗвонки() Тогда
			
			ВнутреннийНомерКудаУпалЗвонок = ДанныеСобытия.Получить("Dialstring");
			ВнутреннийНомерМод = СокрЛП(ВнутреннийНомер) + "@";
			Если СокрЛП(ВнутреннийНомерКудаУпалЗвонок) = СокрЛП(ВнутреннийНомер) 
				//ИЛИ Лев(СокрЛП(ВнутреннийНомерКудаУпалЗвонок), СтрДлина(ВнутреннийНомерМод)) = ВнутреннийНомерМод
				Тогда
				//к нам упал
				
				Отбор = Новый Структура;
				Отбор.Вставить("CallerID2", ДанныеСобытия.Получить("CallerIDNum"));
				Отбор.Вставить("Event",    "DIAL");
				НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
				UniqueID = "";
				Колво = НайденныеСтроки.Количество();
				Для Индекс = 1 По Колво Цикл
					СтрокаТЗ = НайденныеСтроки[Колво-Индекс];
					Если Лев(СокрЛП(СтрокаТЗ.Dialstring), СтрДлина(ВнутреннийНомерМод)) = ВнутреннийНомерМод Тогда
						UniqueID = СтрокаТЗ.UniqueID;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				ВнешняяЛиния = "";
				Если НЕ ПустаяСтрока(UniqueID) Тогда
					НоваяСтрока.Uniqueid1 = UniqueID; // сохраним ИД сессии
					Отбор = Новый Структура;
					Отбор.Вставить("Uniqueid", UniqueID);
					Отбор.Вставить("Event","NEWCHANNEL");
					НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
					Если НайденныеСтроки.Количество() > 0 Тогда
						ВнешняяЛиния = ?(НЕ ПустаяСтрока(НайденныеСтроки[0].CallerIDName), НайденныеСтроки[0].CallerIDName, НайденныеСтроки[0].Exten); 						
					КонецЕсли;
					
					НомерАбонента = ДанныеСобытия.Получить("CallerIDNum");
					ИдЗвонка = ДанныеСобытия.Получить("UniqueID");
					
					ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, ИдЗвонка, UniqueID);
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия) = "BRIDGE" Тогда
		
		времИДсобытия = ДанныеСобытия.Получить("Uniqueid1");
		ИДСессии = ""; 
		Отбор = Новый Структура;
		Отбор.Вставить("Uniqueid", времИДсобытия);
		Отбор.Вставить("Event",    "DIAL");
		НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ИДСессии = НайденныеСтроки[0].Uniqueid1;
		КонецЕсли;
		
		Если СокрЛП(ДанныеСобытия.Получить("CallerID2")) = СокрЛП(ВнутреннийНомер) Тогда
			//создался канал между 2 мя - подняли трубку и начали разговор		
			НомерАбонента = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(СокрЛП(ДанныеСобытия.Получить("CallerID1")));
			ДействияПриПоднятииТрубки_Asterisk(НомерАбонента, времИДсобытия, ИДСессии);
		КонецЕсли; 
		ЗакрытьФормуВходящегоЗвонка(времИДсобытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСобытий_Вариант_93_1_Asterisk(ВидСобытия, ДанныеСобытия)
	
	//2. Звонок поступает по очереди: на номер 220, затем 215, 203 ...
	// номер 215 только в событии DialBegin
	
	//++Newchannel 
	//CallerIDNum: 220            
	//Uniqueid: 1647587456.836
	//Linkedid: 1647587439.834
	//
	//
	//++DialBegin входящий звонок на менеджера (форма входящий звонок)
	//
	//ConnectedLineNum: 215    - внутренний номер менеджера
	//CallerIDNum: 89270480522 - номер абонента
	//
	//Uniqueid: 1647587439.834
	//Linkedid: 1647587439.834
	//
	//
	//++BridgeEnter (поднятие трубки, 2 события. реакция на второе)
	//++BridgeEnter 
	//CallerIDNum: 89270480522
	//ConnectedLineNum: 220
	//ConnectedLineName: 220
	//Uniqueid: 1647587439.834
	//Linkedid: 1647587439.834
	//
	//
	//
	//++Hangup (2 события)
	//CallerIDNum: 220
	//CallerIDName: 220
	//ConnectedLineNum: 89270480522
	//Uniqueid: 1647587456.836
	//Linkedid: 1647587439.834

	//копим историю звонков
	Если ВРег(ВидСобытия)="NEWCHANNEL" Тогда
		//1. Пришел звонок на наш внешний номер (группу номеров)
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВидСобытия;
		НоваяСтрока.Uniqueid  = ДанныеСобытия.Получить("Uniqueid");
		НоваяСтрока.Linkedid  = ДанныеСобытия.Получить("Linkedid");
		НоваяСтрока.Exten = ДанныеСобытия.Получить("Exten");
		//НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");       // внутренний номер менеджера
		//НоваяСтрока.CallerIDName = ДанныеСобытия.Получить("CallerIDName");

	ИначеЕсли ВРег(ВидСобытия) = "DIALBEGIN" Тогда
		//2. АТС перебросила звонок на менеджера
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВРег(ВидСобытия);
		НоваяСтрока.Uniqueid  = ДанныеСобытия.Получить("DestUniqueid");
		НоваяСтрока.Linkedid  = ДанныеСобытия.Получить("DestLinkedid");
		НоваяСтрока.DestCallerIDNum = СокрЛП(ДанныеСобытия.Получить("DestCallerIDNum"));  // внутренний номер менеджера 
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");  // номер клиента
		ВнешняяЛиния = ДанныеСобытия.Получить("DestExten");
		
		Если СокрЛП(НоваяСтрока.DestCallerIDNum) = СокрЛП(ВнутреннийНомер) Тогда			
			ДействияПриНачалеВходящегоЗвонка(НоваяСтрока.CallerID2, ВнешняяЛиния, ВнутреннийНомер, НоваяСтрока.Uniqueid, НоваяСтрока.Linkedid);			
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия) = "HANGUP" Тогда	
		
		//Разорвал канал - положили трубку или разговор окончен - закрываем окно входящего звонка
		//CallerIDNum = ДанныеСобытия.Получить("CallerIDNum");
		Uniqueid = ДанныеСобытия.Получить("Uniqueid");
		//ConnectedLineNum = ДанныеСобытия.Получить("ConnectedLineNum");
		//ConnectedLineNum = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ConnectedLineNum);
		//Channel = ДанныеСобытия.Получить("Channel");
		//
		//Если (СокрЛП(CallerIDNum) = СокрЛП(ВнутреннийНомер) Тогда
			ЗакрытьФормуВходящегоЗвонка(Uniqueid);
			ИсторияAsterisk.Очистить();
		//КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия)="BRIDGEENTER" Тогда
		//3. Менеджер поднял трубку
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВидСобытия;
		НоваяСтрока.Uniqueid  = ДанныеСобытия.Получить("Uniqueid");
		НоваяСтрока.Linkedid  = ДанныеСобытия.Получить("Linkedid");
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerID1"); //номер группы		
		
		Отбор = Новый Структура;
		Отбор.Вставить("Uniqueid", 			ДанныеСобытия.Получить("Uniqueid"));
		Отбор.Вставить("Linkedid", 			ДанныеСобытия.Получить("Linkedid"));
		Отбор.Вставить("Event", 			"DIALBEGIN");
		Отбор.Вставить("DestCallerIDNum", 	СокрЛП(ВнутреннийНомер));
		
		НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
		//времИДсобытия = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid1"));
		//
		//Если СокрЛП(ДанныеСобытия.Получить("CallerID2")) = СокрЛП(ВнутреннийНомер) Тогда		
			НомерАбонента = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(НайденныеСтроки[0].CallerID2);
			ДействияПриПоднятииТрубки_Asterisk(НомерАбонента, НоваяСтрока.Uniqueid);
		//КонецЕсли; 
			ЗакрытьФормуВходящегоЗвонка(НоваяСтрока.Uniqueid);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСобытий_Вариант_296_1_Asterisk(ВидСобытия, ДанныеСобытия)

	//копим историю звонков
	Если ВРег(ВидСобытия)="NEWCHANNEL" Тогда
		//1. Пришел звонок на наш внешний номер (группу номеров)
		Если ДанныеСобытия.Получить("Context") = "from-trunk-custom" Тогда
			НоваяСтрока = ИсторияAsterisk.Добавить();
			НоваяСтрока.Event = ВРег(ВидСобытия);
			НоваяСтрока.Uniqueid  = ДанныеСобытия.Получить("Uniqueid");
			НоваяСтрока.Linkedid  = ДанныеСобытия.Получить("Linkedid");
			НоваяСтрока.Exten = ДанныеСобытия.Получить("Exten");
			НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");       // номер клиента
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия) = "DIALBEGIN" Тогда
		//2. АТС перебросила звонок на менеджера
		
		Если ВРег(ДанныеСобытия.Получить("ChannelStateDesc")) = "RING" Тогда			
			ИДЗвонка = ДанныеСобытия.Получить("DestUniqueid");
			ИДСессииЗвонка = ДанныеСобытия.Получить("DestLinkedid");
			
			ВнешняяЛиния = ДанныеСобытия.Получить("ConnectedLineNum");
			
			// внутренний номер менеджера 
			ВнутреннийНомерЗвонка = СокрЛП(ДанныеСобытия.Получить("DestCallerIDNum"));    		 
			
			НоваяСтрока = ИсторияAsterisk.Добавить();
			НоваяСтрока.Event = ВРег(ВидСобытия);
			НоваяСтрока.Uniqueid  = ИДЗвонка;
			НоваяСтрока.Linkedid  = ИДСессииЗвонка;
			НоваяСтрока.DestCallerIDNum = ВнутреннийНомерЗвонка; 
			НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");  // номер клиента		

			Если ВнутреннийНомерЗвонка = СокрЛП(ВнутреннийНомер) Тогда
				ДействияПриНачалеВходящегоЗвонка(НоваяСтрока.CallerID2, ВнешняяЛиния, ВнутреннийНомер, ИДЗвонка, ИДСессииЗвонка);			
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли ВРег(ВидСобытия) = "HANGUP" Тогда		
		//Разорвал канал - положили трубку или разговор окончен - закрываем окно входящего звонка

		ВнутреннийНомерЗвонка = СокрЛП(ДанныеСобытия.Получить("CallerIDNum"));		
		Если ВнутреннийНомерЗвонка = ВнутреннийНомер Тогда // 2023-07-11 добавлен отбор по внутреннему номеру
		
			ИДСессииЗвонка = ДанныеСобытия.Получить("Linkedid");
			ЗакрытьФормуВходящегоЗвонка(ИДСессииЗвонка);
		
			ИДЗвонка = ДанныеСобытия.Получить("Uniqueid");
			ЗакрытьФормуВходящегоЗвонка(ИДЗвонка);
			
			// 2023-07-11 очищаем только "связанные" события
			//ИсторияAsterisk.Очистить();
			Отбор = Новый Структура;
			Отбор.Вставить("Linkedid", 			ИДСессииЗвонка);			
			НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
			Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
				ИсторияAsterisk.Удалить(НайденнаяСтрока);
			КонецЦикла;
				
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия)="BRIDGEENTER" Тогда
		//3. Менеджер поднял трубку	
	
		ВнутреннийНомерЗвонка = СокрЛП(ДанныеСобытия.Получить("CallerIDNum"));
	
		Если ВнутреннийНомерЗвонка = СокрЛП(ВнутреннийНомер) Тогда
			
			ИДЗвонка = ДанныеСобытия.Получить("Uniqueid");
			ИДСессииЗвонка = ДанныеСобытия.Получить("Linkedid");
			
			Отбор = Новый Структура;
			Отбор.Вставить("Uniqueid", 			ИДЗвонка);
			Отбор.Вставить("Linkedid", 			ИДСессииЗвонка);
			Отбор.Вставить("Event", 			"DIALBEGIN");
			
			НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда				
				НомерАбонента = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(НайденныеСтроки[0].CallerID2);
				ДействияПриПоднятииТрубки_Asterisk(НомерАбонента, ИДЗвонка, ИДСессииЗвонка);				
				ЗакрытьФормуВходящегоЗвонка(ИДСессииЗвонка);
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаИсторияАТС_Asterisk(ДатаНачала, ДатаОкончания)
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);	
	СтруктПараметры.Вставить("ДатаНачала", ДатаНачала);
	СтруктПараметры.Вставить("ДатаОкончания", ДатаОкончания);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", ТекущаяДата());
	
	Если ТребуетсяЗапускЗаданияПолученияИстории() Тогда
		ОбработкаИсторияАТСКлиент(СтруктПараметры);	
	КонецЕсли;
	
КонецФункции

//&НаСервере
//Процедура ОбработкаИсторияАТСAsteriskНаСервере(ДатаНачала, ДатаОкончания)
//	
//	МассивПараметров = Новый Массив;	
//	СтруктПараметры = Новый Структура;
//	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);	
//	СтруктПараметры.Вставить("ДатаНачала", ДатаНачала);
//	СтруктПараметры.Вставить("ДатаОкончания", ДатаОкончания);
//	СтруктПараметры.Вставить("ДатаЗапросаИстории", ТекущаяДатаСеанса());
//	МассивПараметров.Добавить(СтруктПараметры);
//	
//	// сначала проверим завершилось ли предыдущее задание
//	ТребуетсяЗапускЗадания = Истина;
//	Если НЕ ПустаяСтрока(ИдентификаторФоновогоЗаданияИстории) И ИдентификаторФоновогоЗаданияИстории <> "00000000-0000-0000-0000-000000000000" Тогда
//		НайденноеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ИдентификаторФоновогоЗаданияИстории));
//		Если НЕ НайденноеЗадание = Неопределено Тогда
//			Если НайденноеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
//				ТребуетсяЗапускЗадания = Ложь;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	Если ТребуетсяЗапускЗадания Тогда
//		ФоновоеЗадание = ФоновыеЗадания.Выполнить("СофтФон.ОбработкаИсторииЗвонковАТС", МассивПараметров, , "Обработка истории звонков АТС");
//		ИдентификаторФоновогоЗаданияИстории = Строка(ФоновоеЗадание.УникальныйИдентификатор);
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти

#Область SmartConnector

&НаКлиенте
Функция ОбработкаСобытийSmartConnector(ДанныеСобытия)

	JSON = СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия, Истина);
	Если JSON = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	// получение данных
	Событие 	= JSON.Получить("event");
		
	Если Событие = "error" Тогда
		ЕстьОшибкиПодключения = Истина;
		
		ТекстОшибки	= JSON.Получить("message");	
		Если НЕ ТекстОшибки = Неопределено Тогда
			ПоказатьОповещениеПользователя("Ошибка Софтфон", , ТекстОшибки);	
		КонецЕсли;
		
	ИначеЕсли Событие = "connection" Тогда
		
		СтатусПодключения = JSON.Получить("connection");
		Если СтатусПодключения = "open" Тогда
		    ИдентификаторПодключения = JSON.Получить("resourceId");
		    Элементы.СостояниеПодключения.Подсказка = СтрШаблон("Идентификатор подключения: %1", ИдентификаторПодключения);
			
			ПодключенКАТС = Истина;
			УстановитьСтатусПользовательПодключен(ПодключенКАТС);
			ОтключитьОбработчикОжидания("ПодключитьсяКСерверуSC");
			ЕстьОшибкиПодключения = Ложь;
			//КоличествоВыполненныхПопытокПодключения = 0;
			
			Если ИнтервалПроверкиПодключенияКАТС > 0 Тогда
				ОтключитьОбработчикОжидания("ПроверитьПодключениеКАТС");
				ПодключитьОбработчикОжидания("ПроверитьПодключениеКАТС", ИнтервалПроверкиПодключенияКАТС, Ложь);
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли Событие = "message" Тогда
		
		Данные		= JSON.Получить("data");
		Сервис		= JSON.Получить("target");
		ДопМетодыЗапроса	= JSON.Получить("url_params"); // используется для mango
		ДопПараметрыЗапроса	= JSON.Получить("get_params"); // используется для sipuni, uis (2022-11-18)
	
		Если Сервис = "megafon" ИЛИ Сервис = "domru" Тогда
			ОбработкаСобытий_ITooLabs(Событие, Данные);
			
		ИначеЕсли Сервис = "uis" Тогда
			ОбработкаСобытий_UIS(Событие, Данные, ДопПараметрыЗапроса);
			
		ИначеЕсли Сервис = "onlinepbx" Тогда
			ОбработкаСобытий_OnlinePBX(Событие, Данные);
			
		ИначеЕсли Сервис = "mango" Тогда
			ОбработкаСобытий_Mango(Событие, Данные, ДопМетодыЗапроса);
			
		ИначеЕсли Сервис = "sipuni" Тогда
			ОбработкаСобытий_Sipuni(Событие, Данные, ДопПараметрыЗапроса);

		ИначеЕсли Сервис = "beeline" Тогда
			ОбработкаСобытий_Beeline(Событие, Данные);
			
		КонецЕсли;
	КонецЕсли;
		
КонецФункции

#КонецОбласти
	
#Область ITooLabs

&НаКлиенте
Функция ПолучитьСписокОператоров_ITooLabs()

	Ресурс = "/sys/crm_api.wcgp";	
	Метод = "?cmd=accounts&token=" + КлючAPI;
	    
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");
	Заголовки.Вставить("Accept", "application/json");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс + Метод, Заголовки, , , Ложь);
	
	Если НЕ Данные = Неопределено Тогда		
		ОбработкаСписокОператоров_ITooLabs(Данные);
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ОбработкаСписокОператоров_ITooLabs(Данные)
	
	Если Не ТипЗнч(Данные)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ВнутренниеНомера_ITooLabs.Очистить();
	Для каждого ЭлементМассива Из Данные Цикл
		
		ВнутрНомер = Неопределено;
		ЭлементМассива.Свойство("ext", ВнутрНомер);
		Если ВнутрНомер=ВнутреннийНомер Тогда
			ЭлементМассива.Свойство("name", ВнутреннийЛогин_ITooLabs);
			Продолжить;
		КонецЕсли;
		
		СтрВнутренниеНомера=ВнутренниеНомера_ITooLabs.Добавить();
		ЭлементМассива.Свойство("ext",СтрВнутренниеНомера.Номер);
		ЭлементМассива.Свойство("name",СтрВнутренниеНомера.Имя);
		СтрВнутренниеНомера.ВнутреннийЛогин=СтрВнутренниеНомера.Имя+"@"+ДоменAPI;
		
	КонецЦикла;
		
КонецФункции

&НаКлиенте
Процедура ПолучитьИсторию_ITooLabs(Дата1, Дата2)
	
	Ресурс = "/sys/crm_api.wcgp";
		
	UTCДата1=ПолучитьДатуUTC(Дата1);
	UTCДата2=ПолучитьДатуUTC(Дата2);

	Метод = "?cmd=history&token=%1&start=%2&end=%3&limit=%4";
	Метод = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Метод, 
							КлючAPI,
							UTCДата1,
							UTCДата2,
							999);							
							    
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");
	Заголовки.Вставить("Accept", "application/json");
	
	Данные = ВыполнитьRestЗапрос("GET", ДоменAPI, Ресурс + Метод, Заголовки, , , , Истина);
	
	Если НЕ Данные = Неопределено Тогда		
		ОбработкаИсторияАТС_ITooLabs(Данные);
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИсторияАТС_ITooLabs(Данные)
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", Неопределено);
	СтруктПараметры.Вставить("Данные", Данные);
	СтруктПараметры.Вставить("КоллекцияВнутрНомера", ПолучитьСоответствиеВнутреннихНомеровITooLabs());
		
	ОбработкаИсторияАТСКлиент(СтруктПараметры);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеВнутреннихНомеровITooLabs()

	КоллекцияВнутрНомера=Новый Соответствие;
	Для каждого Элемент Из ВнутренниеНомера_ITooLabs Цикл
		КоллекцияВнутрНомера.Вставить(Элемент.ВнутреннийЛогин, Элемент.Номер);
	КонецЦикла; 
	
	Возврат КоллекцияВнутрНомера;

КонецФункции

&НаКлиенте
Процедура ВыполнитьИсходящийЗвонок_ITooLabs(Номер)
	
	Ресурс = "/sys/crm_api.wcgp";
	
	Метод = "?cmd=makeCall&phone=%1&user=%2&token=%3";
	Метод = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Метод, 
							Номер,
							ВнутреннийЛогин_ITooLabs,
							КлючAPI);
							
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");
	Заголовки.Вставить("Accept", "application/json");
	
	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс + Метод, Заголовки);

	Если НЕ Данные = Неопределено Тогда
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ОбработкаСобытий_ITooLabs(Событие, ДанныеПакета)
		
	Если Событие = "message" Тогда
		
		Данные = СофтФонКлиентСервер.URL2JSON(ДанныеПакета);
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
				
			cmd=""; Данные.Свойство("cmd",cmd);
			Если НРег(cmd)="contact" Тогда
				// поступил звонок на АТС
				Номер=""; 
				Данные.Свойство("phone",Номер);
				//МаршрутизацияНаОтветственного(ИДОтвета,Номер);
				
			ИначеЕсли НРег(cmd)="event" Тогда
				
				type=""; Данные.Свойство("type",type);
				Если НРег(type)="incoming" Тогда
					ОбработкаСозданияКанала_ITooLabs(Данные);					
					
				ИначеЕсли НРег(type)="outgoing" Тогда
					//ОбработкаСозданиеКаналаИсходящий(Данные);
					
				ИначеЕсли НРег(type)="accepted" Тогда
					ОбработкаОтветКанала_ITooLabs(Данные);						
					
				ИначеЕсли НРег(type)="completed" Тогда
					//ОбработкаЗакрытиеКанала(Данные);
					
				ИначеЕсли НРег(type)="cancelled" Тогда
					ОбработкаОтменыКанала_ITooLabs(Данные);
					
				КонецЕсли;				 
				
			ИначеЕсли НРег(cmd)="history" Тогда
				//ОбработкаСтрокаИстории(Данные);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	
КонецФункции

&НаКлиенте
Функция ОбработкаСозданияКанала_ITooLabs(Данные)
	
	ИДЗвонка=""; Данные.Свойство("callid", ИДЗвонка);
	НомерАбонента=""; Данные.Свойство("phone", НомерАбонента);
	ВнешняяЛиния=""; Данные.Свойство("diversion",ВнешняяЛиния);
	
	КудаЗвонит =""; Данные.Свойство("ext", КудаЗвонит); //определяем что команда относится именно к нашему пользователю
	Если СокрЛП(КудаЗвонит) = СокрЛП(ВнутреннийНомер) Тогда	
		ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, ИДЗвонка);
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция ОбработкаОтветКанала_ITooLabs(Данные)
	
	ИДЗвонка=""; Данные.Свойство("callid", ИДЗвонка);
	НомерАбонента=""; Данные.Свойство("phone", НомерАбонента);
	Направление=""; Данные.Свойство("direction",Направление); // in / out / либо такого параметра нет
	
	КудаЗвонит =""; Данные.Свойство("ext", КудаЗвонит); //определяем что команда относится именно к нашему пользователю
	Если СокрЛП(КудаЗвонит) = СокрЛП(ВнутреннийНомер) 
		И (Направление = "in" ИЛИ НЕ ЗначениеЗаполнено(Направление))
		Тогда
		ДействияПриПоднятииТрубки_ITooLabs(НомерАбонента, ИДЗвонка);
	КонецЕсли;
	ЗакрытьФормуВходящегоЗвонка(ИДЗвонка);
		
КонецФункции

&НаКлиенте
Функция ОбработкаОтменыКанала_ITooLabs(Данные)
	
	ИДЗвонка=""; Данные.Свойство("callid", ИДЗвонка);
	
	КудаЗвонит =""; Данные.Свойство("ext", КудаЗвонит); //определяем что команда относится именно к нашему пользователю
	Если СокрЛП(КудаЗвонит) = СокрЛП(ВнутреннийНомер) Тогда	
		ЗакрытьФормуВходящегоЗвонка(ИДЗвонка);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_ITooLabs(НомерАбонента, ИДЗвонка)
	
	Оповестить("ПоднятиеТрубки_ITooLabs", Новый Структура("НомерАбонента, ИДЗвонка", НомерАбонента, ИДЗвонка) );
		
КонецФункции

#КонецОбласти

#Область UIS

&НаКлиенте
Функция ЭтоОшибка_UIS(Значение)
	
	ТекущийТип=ТипЗнч(Значение);
	Если ТекущийТип=Тип("Строка") Тогда
		ФлагОшибки=Найти(Значение,"{""error"":")>0;
		Если Не ФлагОшибки Тогда
			ФлагОшибки=Найти(Значение,"</html>")>0;
		КонецЕсли; 
	ИначеЕсли ТекущийТип=Тип("Соответствие") Тогда
		ФлагОшибки=Не (Значение.Получить("error")=Неопределено);
	КонецЕсли; 
	
	Возврат ФлагОшибки;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСписокОператоров_UIS()

	//ДоменAPI = dataapi.uiscom.ru
	Метод = "get.employees";
	ДанныеJSON = "{'jsonrpc':'2.0','id':'"+Метод+"','method':'"+Метод+"','params':{'access_token':'"+КлючAPI+"'}}";
	ДанныеJSON = СофтФонКлиентСервер.Stringify(ДанныеJSON);
	
	Ресурс = "/v"+ВерсияAPI;
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/json; charset=UTF-8;");
	
	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ДанныеJSON);
	
	Если НЕ Данные = Неопределено Тогда
		Если ЭтоОшибка_UIS(Данные) Тогда
			Возврат;
		КонецЕсли;
		
		ОбработкаСписокОператоров_UIS(Данные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаСписокОператоров_UIS(Данные)

	Результат = Данные.Получить("result");
	Если Результат=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	ДанныеКоллекция = Результат.Получить("data");
	Если ДанныеКоллекция = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ТипЗнч(ДанныеКоллекция)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ВнутренниеНомера_UIS.Очистить();
	Для каждого ЭлементМассива Из ДанныеКоллекция Цикл
		
		extension=ЭлементМассива.Получить("extension");
		Если extension=Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		ИД=Формат(ЭлементМассива.Получить("id"),"ЧГ=0");
		ВнутрНомер=extension.Получить("extension_phone_number");
		Если ВнутрНомер=ВнутреннийНомер Тогда
			ВнутреннийИД_UIS=ИД;
			Продолжить;
		КонецЕсли;
		Если НЕ ВнутрНомер = Неопределено Тогда
			СтрВнутренниеНомера=ВнутренниеНомера_UIS.Добавить();
			СтрВнутренниеНомера.ИД=ИД;
			СтрВнутренниеНомера.Номер=ВнутрНомер;
			СтрВнутренниеНомера.Имя=ЭлементМассива.Получить("full_name");
		КонецЕсли;
	КонецЦикла;
	
КонецФункции 

&НаКлиенте
Процедура ПолучитьСписокSIP_UIS()

	//ДоменAPI = dataapi.uiscom.ru
	Метод = "get.sip_lines";
	ДанныеJSON = "{'jsonrpc':'2.0','id':'"+Метод+"','method':'"+Метод+"','params':{'access_token':'"+КлючAPI+"'}}";
	ДанныеJSON = СофтФонКлиентСервер.Stringify(ДанныеJSON);
	
	Ресурс = "/v"+ВерсияAPI;
		
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/json; charset=UTF-8;");
	
	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ДанныеJSON);

	Если НЕ Данные = Неопределено Тогда
		Если ЭтоОшибка_UIS(Данные) Тогда
			Возврат;
		КонецЕсли;
		
		ОбработкаСписокSIP_UIS(Данные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ОбработкаСписокSIP_UIS(Данные)
	
	Результат = Данные.Получить("result");
	Если Результат=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	ДанныеКоллекция = Результат.Получить("data");
	Если ДанныеКоллекция = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ТипЗнч(ДанныеКоллекция)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Для каждого ЭлементМассива Из ДанныеКоллекция Цикл
		
		ИД=Формат(ЭлементМассива.Получить("employee_id"),"ЧГ=0");
		Статус=(ЭлементМассива.Получить("physical_state")="Зарегистрирован");
		
		Если ИД=ВнутреннийИД_UIS Тогда
			//СтатусТелефона=Статус;
			ВнутреннийВиртНомер_UIS=ЭлементМассива.Получить("virtual_phone_number");
			//ВнутреннийSIPНомер=ЭлементМассива.Получить("phone_number");
			Продолжить;
		КонецЕсли; 
		
		ПараметрыОтбора=Новый Структура;
		ПараметрыОтбора.Вставить("ИД",ИД);
		МассивСтрок=ВнутренниеНомера_UIS.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество()>0 Тогда
			МассивСтрок[0].Статус=Статус;
		КонецЕсли; 
		
	КонецЦикла;
	
	ВнутренниеНомера_UIS.Сортировать("Статус Убыв, Номер Возр");
	
КонецФункции

&НаКлиенте
Процедура ПолучитьИсторию_UIS(Дата1, Дата2)
	
	// собираем тело запроса
	ФорматДаты="ДФ='гггг-ММ-дд ЧЧ:мм:сс'";
	Если Не ЗначениеЗаполнено(Дата1) Тогда
		Дата1=НачалоДня(ТекущаяДата());
	КонецЕсли;
	СтрДата1=Формат(Дата1,ФорматДаты);
	
	Если Не ЗначениеЗаполнено(Дата2) Тогда
		Дата2=КонецДня(ТекущаяДата());
	КонецЕсли;
	СтрДата2=Формат(Дата2,ФорматДаты);
	
	ИмяМетода="get.calls_report";
	
	СтрСортировка="'sort':[{'field':'start_time','order':'asc'}]";
	СтрПоля="'fields':['source','communication_id','communication_type','start_time','finish_time','finish_reason','direction','is_lost','virtual_phone_number','contact_phone_number','employees','last_answered_employee_id','last_talked_employee_id','total_duration','total_wait_duration','clean_talk_duration','call_records']";
	ДанныеJSON="{'jsonrpc':'2.0','id':'"+ИмяМетода+"','method':'"+ИмяМетода+"','params':{'access_token':'"+КлючAPI+"','date_from':'"+СтрДата1+"','date_till':'"+СтрДата2+"',"+СтрСортировка+","+СтрПоля+"}}";
	
	ДанныеJSON=СофтФонКлиентСервер.Stringify(ДанныеJSON);

	// обработка запроса 
	Ресурс = "/v"+ВерсияAPI;
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/json; charset=UTF-8;");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ДанныеJSON);

	Если НЕ Данные = Неопределено Тогда
		Если ЭтоОшибка_UIS(Данные) Тогда
			Возврат;
		КонецЕсли;
		
		ОбработкаИсторияАТС_UIS(Данные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИсторияАТС_UIS(Данные)
	
	Результат = Данные.Получить("result");
	ДанныеКоллекция = Результат.Получить("data");
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", ТекущаяДата());
	СтруктПараметры.Вставить("Данные", ДанныеКоллекция);
	СтруктПараметры.Вставить("КоллекцияВнутрНомера", ПолучитьСоответствиеВнутреннихНомеровUis());
		
	ОбработкаИсторияАТСКлиент(СтруктПараметры);
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеВнутреннихНомеровUis()

	КоллекцияВнутрНомера = Новый Соответствие;
	КоллекцияВнутрНомера.Вставить(ВнутреннийИД_UIS, ВнутреннийНомер);
	Для каждого Элемент Из ВнутренниеНомера_UIS Цикл
		КоллекцияВнутрНомера.Вставить(Элемент.ИД,Элемент.Номер);
	КонецЦикла; 
	
	Возврат КоллекцияВнутрНомера;

КонецФункции

&НаКлиенте
Процедура ВыполнитьИсходящийЗвонок_UIS(Номер)
	
	ДоменAPIДляЗвонков = "callapi.uiscom.ru";
	ИмяМетода = "start.employee_call";

	ДанныеJSON = "{'jsonrpc':'2.0','id':'"+ИмяМетода+"','method':'"+ИмяМетода+
		"','params':{'access_token':'"+КлючAPI+"','first_call':'employee','virtual_phone_number':'"+ВнутреннийВиртНомер_UIS+
		"','contact':'"+Номер+"','employee':{'id':"+ВнутреннийИД_UIS+"}}}";
	ДанныеJSON = СофтФонКлиентСервер.Stringify(ДанныеJSON);
	
	Ресурс = "/v4.0";
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/json; charset=UTF-8;");
	
	Данные = ВыполнитьRestЗапрос("POST", ДоменAPIДляЗвонков, Ресурс, Заголовки, ДанныеJSON);

	Если НЕ Данные = Неопределено Тогда
		Если ЭтоОшибка_UIS(Данные) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ОбработкаСобытий_UIS(СобытиеПакета, ДанныеСобытия, Знач ДопПараметрыЗапроса)
	
	//++ 2022-11-88 (000000058)
	//ДанныеСобытия = СтрЗаменить(ДанныеСобытия, "\n", "");
	//ДанныеСобытия = СтрЗаменить(ДанныеСобытия, "\""", """");
	//Данные = СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия, Истина);
	ДопПараметрыЗапроса = СтрЗаменить(ДопПараметрыЗапроса, "%5B", "");  // [ - зарезервированный символ JSON
	ДопПараметрыЗапроса = СтрЗаменить(ДопПараметрыЗапроса, "%5D", "");  // ] - зарезервированный символ JSON
	ДопПараметрыЗапроса = СтрЗаменить(ДопПараметрыЗапроса, "%7B", "");  // { - зарезервированный символ JSON
	ДопПараметрыЗапроса = СтрЗаменить(ДопПараметрыЗапроса, "%7D", "");  // } - зарезервированный символ JSON
	Данные = СофтФонКлиентСервер.URL2JSON(ДопПараметрыЗапроса, Истина);	
	//-- 2022-11-88
	
	Если Данные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтоОшибка_UIS(Данные) Тогда
		Возврат Ложь;
	КонецЕсли;		
				
	Если ТипЗнч(Данные)=Тип("Соответствие") Тогда
		
		ВидСобытия = Данные.Получить("notification_mnemonic");
		
		Если НРег(ВидСобытия)="in_call_session" Тогда
			
			//ОбработкаСозданиеКанала(Данные);
			
		ИначеЕсли НРег(ВидСобытия)="out_call_session" Тогда
			
			//ОбработкаВызоваКанала(Данные);
			
		ИначеЕсли НРег(ВидСобытия)="call_proceeding" Тогда			
			//входящий звонок
			ОбработкаВызоваКанала_UIS(Данные);
			
		ИначеЕсли НРег(ВидСобытия)="call_connected" Тогда
			
			//подняли трубку
			ОбработкаОтветКанала_UIS(Данные);
			
		ИначеЕсли НРег(ВидСобытия)="talk_finished" Тогда
			
			ОбработкаЗакрытиеКанала_UIS(Данные);
			
		ИначеЕсли НРег(ВидСобытия)="call_session_finished" Тогда
			
			ОбработкаОкончанияЗвонка_UIS(Данные);
			
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецФункции

&НаКлиенте
Функция ОбработкаВызоваКанала_UIS(Данные)
	
	ИДЗвонка = ВСтроку(Данные.Получить("call_session_id"));
	Если Не ЗначениеЗаполнено(ИДЗвонка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КудаЗвонит = Данные.Получить("extension_phone_number");
	Если СокрЛП(КудаЗвонит) = СокрЛП(ВнутреннийНомер) Тогда
		ВнешняяЛиния = Данные.Получить("virtual_phone_number");
		НомерАбонента = Данные.Получить("calling_phone_number");
		
		ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, ИДЗвонка);
	КонецЕсли;
			
КонецФункции

&НаКлиенте
Функция ОбработкаЗакрытиеКанала_UIS(Данные)
	
	ИДЗвонка = Данные.Получить("call_session_id");
	Если Не ЗначениеЗаполнено(ИДЗвонка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КудаЗвонит=	Данные.Получить("extension_phone_number");
	
	Если СокрЛП(КудаЗвонит) = СокрЛП(ВнутреннийНомер) Тогда
		ЗакрытьФормуВходящегоЗвонка(ИДЗвонка);
	КонецЕсли;
	
КонецФункции
 
&НаКлиенте
Функция ОбработкаОкончанияЗвонка_UIS(Данные)

	ИДЗвонка = ВСтроку(Данные.Получить("call_session_id"));
	Если Не ЗначениеЗаполнено(ИДЗвонка) Тогда
		Возврат Ложь;
	КонецЕсли; 
		
	ЗакрытьФормуВходящегоЗвонка(ИДЗвонка);		
	
КонецФункции
 
&НаКлиенте
Функция ОбработкаОтветКанала_UIS(Данные)
	
	ИДЗвонка = ВСтроку(Данные.Получить("call_session_id"));
	Если Не ЗначениеЗаполнено(ИДЗвонка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//подняли трубку
	КудаЗвонит = Данные.Получить("extension_phone_number");	
	Если СокрЛП(КудаЗвонит) = СокрЛП(ВнутреннийНомер) Тогда
		НомерАбонента = Данные.Получить("calling_phone_number");
		
		ДействияПриПоднятииТрубки_UIS(НомерАбонента, ИДЗвонка);				
	КонецЕсли;
	
	ЗакрытьФормуВходящегоЗвонка(ИДЗвонка);
	
КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_UIS(НомерАбонента, ИДЗвонка)
	
	Оповестить("ПоднятиеТрубки_UIS", Новый Структура("НомерАбонента, ИДЗвонка", НомерАбонента, ИДЗвонка) );
		
КонецФункции

#КонецОбласти

#Область OnlinePBX

&НаКлиенте
Функция ВыполнитьЗапросКлючаRest_OnlinePBX(ЗапроситьНовыйКлюч=Ложь)
	
	Ресурс = "/" + ДоменAPI +  "/auth.json";
	
	СтрНовыйКлюч="&new=false";
	Если ЗапроситьНовыйКлюч Тогда
		СтрНовыйКлюч="&new=true";
	КонецЕсли; 
	ТелоЗапроса="auth_key=" + КлючAPI + СтрНовыйКлюч;							
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		
	Данные = ВыполнитьRestЗапрос("POST", ДоменOnlinePBX, Ресурс, Заголовки, ТелоЗапроса);
	
	Если НЕ Данные = Неопределено Тогда	
		Статус = Данные.Получить("status");
		// обработка ошибок
		Если НЕ Статус = "1" Тогда
			Если Не КлючЗапрашивался Тогда
				КлючЗапрашивался = Истина;
				Возврат ВыполнитьЗапросКлючаRest_OnlinePBX(Истина);
			КонецЕсли;
			Возврат Ложь;
		Иначе			
			// получение ключа
			ДанныеКлюча = Данные.Получить("data");
			Попытка
				КлючСессии=ДанныеКлюча.Получить("key");
				КлючИД=ДанныеКлюча.Получить("key_id");
				Возврат Истина;
			Исключение
				КлючСессии=""; 
				КлючИД="";
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПолучитьИсторию_OnlinePBX(Знач Дата1, Знач Дата2)
	
	Ресурс = "/" + ДоменAPI +  "/mongo_history/search.json";
	
	Дата1 = ?(ЗначениеЗаполнено(Дата1), Дата1, ТекущаяДата() - 86400);
	Дата2 = ?(ЗначениеЗаполнено(Дата2), Дата2, ТекущаяДата());
	ДатаЗапроса1 = УниверсальноеВремя(Дата1);
	ДатаЗапроса2 = УниверсальноеВремя(Дата2);
	
	ТелоЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("start_stamp_from=%1&start_stamp_to=%2", ПолучитьДатуUT(ДатаЗапроса1), ПолучитьДатуUT(ДатаЗапроса2));							
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Если ЗначениеЗаполнено(КлючСессии) Тогда
		Заголовки.Вставить("x-pbx-authentication", Строка(КлючИД) + ":" + Строка(КлючСессии));		
	КонецЕсли;
		
	Данные = ВыполнитьRestЗапрос("POST", ДоменOnlinePBX, Ресурс, Заголовки, ТелоЗапроса, , Ложь);
	
	Если НЕ Данные = Неопределено Тогда	
		Если Данные.Свойство("isNotAuth") И Данные.isNotAuth = Истина Тогда
			РезультатАвторизации = ВыполнитьЗапросКлючаRest_OnlinePBX();				
			Если РезультатАвторизации Тогда
				ПолучитьИсторию_OnlinePBX(Дата1, Дата2);
			КонецЕсли;
		Иначе
			
			Если Данные.Свойство("data") Тогда
				МассивСтрок = Данные.data;
				Если Не ЗначениеЗаполнено(МассивСтрок) 
					ИЛИ НЕ ТипЗнч(МассивСтрок)=Тип("Массив") Тогда
					Возврат;
				КонецЕсли;
				ОбработкаИсторияАТС_OnlinePBX(МассивСтрок);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Функция ОбработкаИсторияАТС_OnlinePBX(Данные)
	
	//mongo_history
	// на клиенте выполним получение времени из-за разницы в часовых поясах
	// на сервере может быть другой часовой пояс
	Для каждого СтрокаЗаписи из Данные Цикл
		СтрокаЗаписи.Вставить("ДатаНачалаЗвонка", СофтФонКлиент.ДатаИзUT(СтрокаЗаписи.start_stamp));	
	КонецЦикла;
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", Неопределено);
	СтруктПараметры.Вставить("Данные", Данные);
	СтруктПараметры.Вставить("ВерсияИстории", "mongo_history");
	
	ОбработкаИсторияАТСКлиент(СтруктПараметры);
		
КонецФункции

&НаКлиенте
Процедура ПолучитьФайлЗаписи_OnlinePBX(ИдЗаписи)
	
	Ресурс = "/" + ДоменAPI +  "/mongo_history/search.json";							
	
	ТелоЗапроса = "uuid=" + ИдЗаписи + "&download=true";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Если ЗначениеЗаполнено(КлючСессии) Тогда
		Заголовки.Вставить("x-pbx-authentication", Строка(КлючИД) + ":" + Строка(КлючСессии));		
	КонецЕсли;
		
	Данные = ВыполнитьRestЗапрос("POST", ДоменOnlinePBX, Ресурс, Заголовки, ТелоЗапроса, , Ложь);
	
	Если НЕ Данные = Неопределено Тогда	
		Если Данные.Свойство("isNotAuth") И Данные.isNotAuth = Истина Тогда
			РезультатАвторизации = ВыполнитьЗапросКлючаRest_OnlinePBX();				
			Если РезультатАвторизации Тогда
				ПолучитьФайлЗаписи_OnlinePBX(ИдЗаписи);
			КонецЕсли;
		Иначе			
			Если Данные.Свойство("data") Тогда
				СсылкаНаФайлЗаписи = Данные.data;
				Если ЗначениеЗаполнено(СсылкаНаФайлЗаписи) 
					И ТипЗнч(СсылкаНаФайлЗаписи)=Тип("Строка") Тогда				
					ОбработкаФайлЗаписи_OnlinePBX(СсылкаНаФайлЗаписи);
				  КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Функция ОбработкаФайлЗаписи_OnlinePBX(СсылкаНаФайлЗаписи)

	ИД=""; Адрес="";
	Если ЗначениеЗаполнено(СсылкаНаФайлЗаписи) Тогда
		
		РазделительСхемы = "://"; 
		ПозицияСхемы = СтрНайти(СсылкаНаФайлЗаписи, РазделительСхемы);
		Если ПозицияСхемы = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ОбработатьПолучениеСсылкиФайлаЗаписиЗвонка(РежимЗагрузкиЗаписиOnPbx, СсылкаНаФайлЗаписи);
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьИсходящийЗвонок_OnlinePBX(Номер)
	
	Ресурс = "/" + ДоменAPI +  "/call/now.json";						
	
	ТелоЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"from=%1&to=%2&domain_to=%3&from_orig_number=%4&from_orig_name=%5", 
			ВнутреннийНомер, Номер, ДоменAPI, Номер, Номер);							
		
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Если ЗначениеЗаполнено(КлючСессии) Тогда
		Заголовки.Вставить("x-pbx-authentication", Строка(КлючИД) + ":" + Строка(КлючСессии));		
	КонецЕсли;
		
	Данные = ВыполнитьRestЗапрос("POST", ДоменOnlinePBX, Ресурс, Заголовки, ТелоЗапроса, , Ложь);
	
	Если НЕ Данные = Неопределено Тогда	
		Если Данные.Свойство("isNotAuth") И Данные.isNotAuth = Истина Тогда
			РезультатАвторизации = ВыполнитьЗапросКлючаRest_OnlinePBX();				
			Если РезультатАвторизации Тогда
				ВыполнитьИсходящийЗвонок_OnlinePBX(Номер);
			КонецЕсли;
		Иначе			
			Если Данные.Свойство("data") Тогда

			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ОбработкаСобытий_OnlinePBX(СобытиеПакета, ДанныеСобытия)
	
	ДанныеСобытия = СтрЗаменить(ДанныеСобытия, "\""", """");
	//Данные = СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия, Истина);		
	Данные = СофтФонКлиентСервер.URL2JSON(ДанныеСобытия, Истина);
	
	Если Данные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Данные)=Тип("Соответствие") Тогда
		
		ВидСобытия = Данные.Получить("event");		
		
		Если ВидСобытия = "call_start" Тогда 
			// начался звонок
			//ОбработкаСозданияКанала_OnlinePBX(Данные);
			
		ИначеЕсли ВидСобытия = "call_user_start" Тогда
			// начался звонок на пользователя
			ОбработкаСозданияКанала_OnlinePBX(Данные);
			
		ИначеЕсли ВидСобытия = "call_answered" Тогда
			ОбработкаСоединениеКанала_OnlinePBX(Данные);
			
		ИначеЕсли ВидСобытия = "call_end" Тогда
			ОбработкаЗакрытиеКанала_OnlinePBX(Данные);
			
		КонецЕсли; 
		
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ОбработкаСозданияКанала_OnlinePBX(Данные)
	
	ИДСессииЗвонка 	= Данные.Получить("uuid");
	НомерАбонента 	= Данные.Получить("caller");
	ВнешняяЛиния 	= Данные.Получить("gateway");	
	КудаЗвонит 		= Данные.Получить("callee");
	
	Если СокрЛП(КудаЗвонит) = СокрЛП(ВнутреннийНомер) Тогда	
		ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, ИДСессииЗвонка);
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция ОбработкаСоединениеКанала_OnlinePBX(Данные)
	
	ИДСессииЗвонка 	= Данные.Получить("uuid");
	НомерАбонента 	= Данные.Получить("caller");
	//ВнешняяЛиния 	= Данные.Получить("gateway");	
	КудаЗвонит 		= Данные.Получить("callee");
	
	Если СокрЛП(КудаЗвонит) = СокрЛП(ВнутреннийНомер) Тогда	
		ДействияПриПоднятииТрубки_OnlinePBX(НомерАбонента, ИДСессииЗвонка);
	КонецЕсли;
	ЗакрытьФормуВходящегоЗвонка(ИДСессииЗвонка);
		
КонецФункции

&НаКлиенте
Функция ОбработкаЗакрытиеКанала_OnlinePBX(Данные)
	
	ИДСессииЗвонка 	= Данные.Получить("uuid");
	КудаЗвонит 		= Данные.Получить("callee");
	
	Если СокрЛП(КудаЗвонит) = СокрЛП(ВнутреннийНомер) Тогда	
		ЗакрытьФормуВходящегоЗвонка(ИДСессииЗвонка);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_OnlinePBX(НомерАбонента, ИДЗвонка)
	
	Оповестить("ПоднятиеТрубки_OnlinePBX", Новый Структура("НомерАбонента, ИДЗвонка, ИДСессииЗвонка", НомерАбонента, ИДЗвонка, ИДЗвонка) );
		
КонецФункции

#КонецОбласти

#Область Sipuni

&НаКлиенте
Функция ЭтоОшибка_Sipuni(Данные)

	Результат=Ложь;
	
	Если ТипЗнч(Данные)=Тип("Строка") Тогда
	
		Если Найти(НРег(Данные),"</html>")>0 Тогда
			Результат=Истина;
		КонецЕсли; 
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ПодписатьПакет_Sipuni(JSONПакет)
	
	Возврат СофтФонСервер.ПодписатьПакет_Sipuni(JSONПакет, КлючAPI);
	
КонецФункции

&НаСервереБезКонтекста
Функция СортироватьПоляПакета_Sipuni(JSONПакет)
	
	Возврат СофтФонСервер.СортироватьПоляПакета_Sipuni(JSONПакет);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСписокОператоров_Sipuni()

	ДанныеJSON=
	"'user':'"+НомерВАТС+"'";
	
	ДанныеJSON="{"+ДанныеJSON+"}";
	Подпись=ПодписатьПакет_Sipuni(ДанныеJSON);
	ДанныеJSON=СортироватьПоляПакета_Sipuni(ДанныеJSON);
	ДанныеJSON="{"+ДанныеJSON+",'hash':'"+Подпись+"'}";
	ДанныеJSON=СофтФонКлиентСервер.Stringify(ДанныеJSON);
	
	ТелоЗапроса = СофтФонКлиентСервер.JSON2URL(ДанныеJSON) ;
	
	// обработка запроса 
	Ресурс = "/api/statistic/operators";
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса, Ложь);

	Если НЕ Данные = Неопределено Тогда
		ОбработкаСписокОператоров_Sipuni(Данные);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаСписокОператоров_Sipuni(Данные)

	Если ЭтоОшибка_Sipuni(Данные) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// формат:
	//Login;Name;Status;Call state
	//311;"Менеджер 1";free;;
	//314;"Менеджер 2";free;;
		
КонецФункции

&НаКлиенте
Процедура ПолучитьИсторию_Sipuni(Дата1, Дата2)

	ФорматДаты="ДФ=дд.ММ.гггг";
		
	Дата1 = ?(ЗначениеЗаполнено(Дата1), Дата1, ТекущаяДата());
	Дата2 = ?(ЗначениеЗаполнено(Дата2), Дата2, ТекущаяДата());
	
	СтрДата1 = Формат(Дата1,ФорматДаты);
	СтрДата2 = Формат(Дата2,ФорматДаты);
		
	ТипЗвонка		= "0"; //0 — Все звонки 1 — Входящий 2 — Исходящий 3 — Внутренний	
	СтатусЗвонка	= "0"; // 0 — Все звонки 1 — Пропущенный 2 — Принятый	
	НомерСхемы		= "";	
	НомерОткуда		= ""; 
	НомерКуда		= ""; 
	НомерОтветил	= "";
	anonymous		= "1"; 
	ТолькоНовыеКлиенты = "0";
		
	ДанныеJSON=
	"'user':'"+НомерВАТС+"',"+
	"'from':'"+СтрДата1+"',"+
	"'to':'"+СтрДата2+"',"+
	"'type':'"+ТипЗвонка+"',"+
	"'state':'"+СтатусЗвонка+"',"+
	"'tree':'"+НомерСхемы+"',"+
	"'fromNumber':'"+НомерОткуда+"',"+
	"'toNumber':'"+НомерКуда+"',"+
	"'toAnswer':'"+НомерОтветил+"',"+
	"'anonymous':'"+anonymous+"',"+
	"'firstTime':'"+ТолькоНовыеКлиенты+"'";
	
	ДанныеJSON="{"+ДанныеJSON+"}";
	Подпись=ПодписатьПакет_Sipuni(ДанныеJSON);
	ДанныеJSON=СортироватьПоляПакета_Sipuni(ДанныеJSON);
	ДанныеJSON="{"+ДанныеJSON+",'hash':'"+Подпись+"'}";
	ДанныеJSON=СофтФонКлиентСервер.Stringify(ДанныеJSON);
	
	ТелоЗапроса = СофтФонКлиентСервер.JSON2URL(ДанныеJSON) ;
	
	// обработка запроса 
	Ресурс = "/api/statistic/export";
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса, Ложь);

	Если НЕ Данные = Неопределено Тогда
		ОбработкаИсторияАТС_Sipuni(Данные);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаИсторияАТС_Sipuni(Данные)

	Если ЭтоОшибка_Sipuni(Данные) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", ТекущаяДата());
	СтруктПараметры.Вставить("Данные", Данные);
	СтруктПараметры.Вставить("НомерВАТС", НомерВАТС);
	СтруктПараметры.Вставить("ДоменAPI", ДоменAPI);
	СтруктПараметры.Вставить("КлючAPI", КлючAPI);
	
	ОбработкаИсторияАТСКлиент(СтруктПараметры);
	
КонецФункции

&НаКлиенте
Функция ОбработкаСобытий_Sipuni(СобытиеПакета, ДанныеСобытия, ДопПараметрыЗапроса)
		
	ДанныеЗапроса = СофтФонКлиентСервер.URL2JSON(ДопПараметрыЗапроса, Истина);

	// json не прошел валидацию
	Если ДанныеЗапроса = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипСобытия = ДанныеЗапроса.Получить("event");
	
	Если ТипСобытия="1" Тогда
		
		ОбработкаНачалаЗвонка_Sipuni(ДанныеЗапроса);
		
	ИначеЕсли ТипСобытия="2" Тогда
		
		ОбработкаЗавершенияЗвонка_Sipuni(ДанныеЗапроса);
		
	ИначеЕсли ТипСобытия="3" Тогда
		
		ОбработкаСоединенияЗвонка_Sipuni(ДанныеЗапроса);
		
	ИначеЕсли ТипСобытия="4" Тогда
		
		ОбработкаЗавершенияЗвонкаПромежуточное_Sipuni(ДанныеЗапроса);
		
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ОбработкаНачалаЗвонка_Sipuni(Данные)

	ИД=Данные.Получить("call_id");
	Если ИД=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
		
	СтрТекущиеЗвонки=ПолучитьСтрокуТекущегоЗвонка_Sipuni(ИД);
	ЗаполнитьДанныеТекущиеЗвонки_Sipuni(СтрТекущиеЗвонки,Данные);
	ЗаполнитьЛинию_Sipuni(СтрТекущиеЗвонки);
	
	ЭтоВходящий=ЭтоВходящий_Sipuni(СтрТекущиеЗвонки);
	НомерАбонента=СтрТекущиеЗвонки.src_num;
	ВнутрНомер=СтрТекущиеЗвонки.short_dst_num;
	ЭтоВнутренний=ЭтоВнутренний_Sipuni(СтрТекущиеЗвонки);
	Если ЭтоВнутренний Тогда
		НомерАбонента=СтрТекущиеЗвонки.short_src_num;
	КонецЕсли; 
	Если Не ЭтоВходящий Тогда
		ВнутрНомер=СтрТекущиеЗвонки.short_src_num;
		НомерАбонента=СтрТекущиеЗвонки.dst_num;
		Если ЭтоВнутренний Тогда
			НомерАбонента=СтрТекущиеЗвонки.short_dst_num;
		КонецЕсли; 
	КонецЕсли; 
	
	// действия по отслеживаемому внутреннему номеру
	Если ВнутрНомер=ВнутреннийНомер Тогда
		ИДТекущегоЗвонка=ИД;
		НаправлениеЗвонка="Исходящий";
		Если ЭтоВходящий Тогда
			НаправлениеЗвонка="Входящий";
			
			ДействияПриНачалеВходящегоЗвонка(НомерАбонента, СтрТекущиеЗвонки.Линия, ВнутреннийНомер, ИДТекущегоЗвонка);
		КонецЕсли; 
		
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция ОбработкаЗавершенияЗвонка_Sipuni(Данные)

	ИД=Данные.Получить("call_id");
	Если ИД=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрТекущиеЗвонки=ПолучитьСтрокуТекущегоЗвонка_Sipuni(ИД);
	ЗаполнитьДанныеТекущиеЗвонки_Sipuni(СтрТекущиеЗвонки,Данные);
	
	ЭтоВходящий=ЭтоВходящий_Sipuni(СтрТекущиеЗвонки);
	Номер=СтрТекущиеЗвонки.src_num;
	ВнутрНомер=СтрТекущиеЗвонки.short_dst_num;
	ЭтоВнутренний=ЭтоВнутренний_Sipuni(СтрТекущиеЗвонки);
	Если ЭтоВнутренний Тогда
		Номер=СтрТекущиеЗвонки.short_src_num;
	КонецЕсли; 
	Если Не ЭтоВходящий Тогда
		ВнутрНомер=СтрТекущиеЗвонки.short_src_num;
		Номер=СтрТекущиеЗвонки.dst_num;
		Если ЭтоВнутренний Тогда
			Номер=СтрТекущиеЗвонки.short_dst_num;
		КонецЕсли; 
	КонецЕсли; 
	
	// действия по отслеживаемому внутреннему номеру
	Если ВнутрНомер=ВнутреннийНомер ИЛИ ИДТекущегоЗвонка=ИД Тогда	 
		ЗакрытьФормуВходящегоЗвонка(ИДТекущегоЗвонка);	
	КонецЕсли;
		
	ТекущиеЗвонки_Sipuni.Удалить(СтрТекущиеЗвонки);
	
КонецФункции

&НаКлиенте
Функция ОбработкаСоединенияЗвонка_Sipuni(Данные)

	ИД=Данные.Получить("call_id");
	Если ИД=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрТекущиеЗвонки=ПолучитьСтрокуТекущегоЗвонка_Sipuni(ИД);
	ЗаполнитьДанныеТекущиеЗвонки_Sipuni(СтрТекущиеЗвонки,Данные);
	
	ЭтоВходящий=ЭтоВходящий_Sipuni(СтрТекущиеЗвонки);
	Номер=СтрТекущиеЗвонки.src_num;
	ВнутрНомер=СтрТекущиеЗвонки.short_dst_num;
	ЭтоВнутренний=ЭтоВнутренний_Sipuni(СтрТекущиеЗвонки);
	Если ЭтоВнутренний Тогда
		Номер=СтрТекущиеЗвонки.short_src_num;
	КонецЕсли; 
	Если Не ЭтоВходящий Тогда
		ВнутрНомер=СтрТекущиеЗвонки.short_src_num;
		Номер=СтрТекущиеЗвонки.dst_num;
		Если ЭтоВнутренний Тогда
			Номер=СтрТекущиеЗвонки.short_dst_num;
		КонецЕсли; 
	КонецЕсли; 
	
	// действия по отлеживаемому внутреннему номеру
	Если ВнутрНомер=ВнутреннийНомер Тогда
		
		//ИДТекущегоЗвонка=ИД;
		
		НаправлениеЗвонка="Исходящий";
		Если ЭтоВходящий Тогда
			НаправлениеЗвонка="Входящий";
			ДействияПриПоднятииТрубки_Sipuni(Номер, ИДТекущегоЗвонка);
		КонецЕсли; 
		ЗакрытьФормуВходящегоЗвонка(ИДТекущегоЗвонка);
	
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция ОбработкаЗавершенияЗвонкаПромежуточное_Sipuni(Данные)
	// здесь можно ничего не делать
	// будет сгенерировано ОбработкаЗавершенияЗвонка_Sipuni
		
КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуТекущегоЗвонка_Sipuni(ИД, Создавать=Истина)

	Результат = Неопределено;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("call_id", ИД);
	МассивСтрок = ТекущиеЗвонки_Sipuni.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество()=0 Тогда
		Если Создавать Тогда
			Результат = ТекущиеЗвонки_Sipuni.Добавить();
			Результат.call_id=ИД;
		КонецЕсли;
	Иначе
		Результат=МассивСтрок[0];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ЗаполнитьДанныеТекущиеЗвонки_Sipuni(СтрТекущиеЗвонки, Данные)

	Для каждого Элемент Из Данные Цикл
	
		ИДПоля=Элемент.Ключ;
		ЗначениеПоля=Элемент.Значение;
	
		Если Не ЗначениеПоля=Неопределено Тогда
			Если СтрТекущиеЗвонки.Свойство(ИДПоля) Тогда
				СтрТекущиеЗвонки[ИДПоля]=ЗначениеПоля;
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьЛинию_Sipuni(СтрТекущиеЗвонки)

	Если СтрТекущиеЗвонки.dst_type=1 И СтрТекущиеЗвонки.src_type=1 Тогда // оба номера внешние
		Если СтрТекущиеЗвонки.is_inner_call Тогда //НРег(СтрТекущиеЗвонки.treeName)="входящая" Тогда  // имя задается в настройках личного кабинета и может отличаться от "входящая"
			СтрТекущиеЗвонки.Линия = СтрТекущиеЗвонки.dst_num;
		КонецЕсли; 
	КонецЕсли; 
	
	//++ 2019-11-19
	Если СтрТекущиеЗвонки.dst_type=2 И СтрТекущиеЗвонки.src_type=1 Тогда // dst - внутренний,  src - внешний
		Если СтрТекущиеЗвонки.is_inner_call Тогда 
			СтрТекущиеЗвонки.Линия = СтрТекущиеЗвонки.treeName; // treeName - имя линии 
		КонецЕсли; 
	КонецЕсли;
	//-- 2019-11-19
	
КонецФункции

&НаКлиенте
Функция ЭтоВходящий_Sipuni(СтрТекущиеЗвонки)

	Результат=(СтрТекущиеЗвонки.src_type=1);
	Если СтрТекущиеЗвонки.src_type=СтрТекущиеЗвонки.dst_type Тогда
		Если СтрТекущиеЗвонки.src_type=1 Тогда
			// оба номера - внешние
			Результат = СтрТекущиеЗвонки.is_inner_call;//(НРег(СтрТекущиеЗвонки.treeName)="входящая"); нельзя проверять по имени транка, имя задается вличном кабинете и может отличаться
		Иначе
			// оба номера - внутрение
			Результат=Истина;
			Если СтрТекущиеЗвонки.short_src_num=ВнутреннийНомер Тогда
				Результат=Ложь;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
 
&НаКлиенте
Функция ЭтоВнутренний_Sipuni(СтрТекущиеЗвонки)

	Результат=(СтрТекущиеЗвонки.src_type=СтрТекущиеЗвонки.dst_type И СтрТекущиеЗвонки.src_type=2);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_Sipuni(НомерАбонента, ИДЗвонка)
	
	Оповестить( "ПоднятиеТрубки_Sipuni", Новый Структура("НомерАбонента, ИДЗвонка", НомерАбонента, ИДЗвонка) );
		
КонецФункции

#КонецОбласти

#Область MangoOffice

&НаКлиенте
Процедура ИнициализироватьОписаниеКода_Mango()

	// инициализация описания кода завершения
	СоответствиеКода_Mango=Новый Соответствие;
	СоответствиеКода_Mango.Вставить("1000","Действие успешно выполнено");
	СоответствиеКода_Mango.Вставить("1100","Вызов завершен в нормальном режиме");
	СоответствиеКода_Mango.Вставить("1110","Вызов завершен вызывающим абонентом");
	СоответствиеКода_Mango.Вставить("1111","Вызов не получил ответа в течение времени ожидания");
	
	СоответствиеКода_Mango.Вставить("1120","Вызов завершен вызываемым абонентом");
	СоответствиеКода_Mango.Вставить("1121","Получен ответ 'Занято' от удаленной стороны");
	СоответствиеКода_Mango.Вставить("1122","Вызов отклонен вызываемым абонентом");
	СоответствиеКода_Mango.Вставить("1123","Получен сигнал 'Не беспокоить'");

	СоответствиеКода_Mango.Вставить("1130","Ограничения для вызываемого номера");
	СоответствиеКода_Mango.Вставить("1131","Вызываемый номер недоступен");
	СоответствиеКода_Mango.Вставить("1132","Вызываемый номер не обслуживается");
	СоответствиеКода_Mango.Вставить("1133","Вызываемый номер не существует");
	СоответствиеКода_Mango.Вставить("1134","Превышено максимальное число переадресаций");
	
	СоответствиеКода_Mango.Вставить("1140","Вызовы на регион запрещены настройками ВАТС");
	
	СоответствиеКода_Mango.Вставить("1150","Ограничения для вызывающего номера");
	СоответствиеКода_Mango.Вставить("1151","Вызывающий номер в черном списке");
	СоответствиеКода_Mango.Вставить("1152","Вызывающий номер не найден в белом списке");
	
	СоответствиеКода_Mango.Вставить("1160","Вызов на группу не удался");
	СоответствиеКода_Mango.Вставить("1161","Удержание запрещено настройками ВАТС");
	СоответствиеКода_Mango.Вставить("1162","Очередь удержания заполнена");
	СоответствиеКода_Mango.Вставить("1163","Превышено время ожидания в очереди удержания");
	СоответствиеКода_Mango.Вставить("1164","Все операторы в данный момент недоступны");
	
	СоответствиеКода_Mango.Вставить("1170","Вызов завершен согласно схеме переадресации");
	СоответствиеКода_Mango.Вставить("1171","Неверно настроена схема переадресации");
	
	СоответствиеКода_Mango.Вставить("1180","Вызов завершен командой пользователя");
	СоответствиеКода_Mango.Вставить("1181","Вызов завершен по команде из внешней системы");
	СоответствиеКода_Mango.Вставить("1182","Вызов завершен перехватом на другого оператора");
	СоответствиеКода_Mango.Вставить("1183","Назначен новый оператор");
	
	СоответствиеКода_Mango.Вставить("1190","Вызываемый номер неактивен либо нерабочее расписание");
	СоответствиеКода_Mango.Вставить("1191","Вызываемый номер неактивен");
	СоответствиеКода_Mango.Вставить("1192","Вызываемый номер неактивен по расписанию");
	
	СоответствиеКода_Mango.Вставить("2000","Ограничение биллинговой системы");
	СоответствиеКода_Mango.Вставить("2100","Доступ к счету невозможен");
	СоответствиеКода_Mango.Вставить("2110","Счет заблокирован");
	СоответствиеКода_Mango.Вставить("2120","Счет закрыт");
	СоответствиеКода_Mango.Вставить("2130","Счет не обслуживается");
	СоответствиеКода_Mango.Вставить("2140","Счет недействителен");
	
	СоответствиеКода_Mango.Вставить("2200","Доступ к счету ограничен");
	СоответствиеКода_Mango.Вставить("2210","Доступ ограничен периодом использования");
	СоответствиеКода_Mango.Вставить("2211","Достигнут дневной лимит использования услуги");
	СоответствиеКода_Mango.Вставить("2212","Достигнут месячный лимит использования услуги");
	
	СоответствиеКода_Mango.Вставить("2220","Количество одновременных вызовов/действий ограничено");
	СоответствиеКода_Mango.Вставить("2230","Услуга недоступна");
	СоответствиеКода_Mango.Вставить("2240","Недостаточно средств на счете");
	СоответствиеКода_Mango.Вставить("2250","Ограничение на количество использований услуги в биллинге");
	СоответствиеКода_Mango.Вставить("2300","Направление заблокировано");
	СоответствиеКода_Mango.Вставить("2400","Ошибка биллинга");
	
	СоответствиеКода_Mango.Вставить("3000","Неверный запрос");
	СоответствиеКода_Mango.Вставить("3100","Переданы неверные параметры команды");
	СоответствиеКода_Mango.Вставить("3101","Запрос выполнен по методу, отличному от POST");
	СоответствиеКода_Mango.Вставить("3102","Значение ключа не соответствуют расчитанному");
	СоответствиеКода_Mango.Вставить("3103","В запросе отсутствует обязательный параметр");
	СоответствиеКода_Mango.Вставить("3104","Параметр передан в неправильном формате");
	СоответствиеКода_Mango.Вставить("3105","Неверный ключ доступа");
	СоответствиеКода_Mango.Вставить("3200","Неверно указан номер абонента");
	СоответствиеКода_Mango.Вставить("3300","Объект не существует");
	СоответствиеКода_Mango.Вставить("3310","Вызов не найден");
	СоответствиеКода_Mango.Вставить("3320","Запись разговора не найдена");
	СоответствиеКода_Mango.Вставить("3330","Номер не найден у ВАТС или сотрудника");
	
	СоответствиеКода_Mango.Вставить("4000","Действие не может быть выполнено");
	СоответствиеКода_Mango.Вставить("4001","Команда не поддерживается");
	СоответствиеКода_Mango.Вставить("4002","Продолжительность записи меньше минимально возможной в ВАТС, запись не будет сохранена");
	СоответствиеКода_Mango.Вставить("4100","Выполнить команду по логике работы ВАТС невозможно");
	СоответствиеКода_Mango.Вставить("4101","Вызов завершен либо не существует");
	СоответствиеКода_Mango.Вставить("4102","Запись разговора уже осуществляется");
	СоответствиеКода_Mango.Вставить("4200","Связаться с абонентом в данный момент невозможно");
	СоответствиеКода_Mango.Вставить("4300","SMS сообщение отправить не удалось");
	СоответствиеКода_Mango.Вставить("4301","SMS сообщение устарело");
	
	СоответствиеКода_Mango.Вставить("5000","Ошибка сервера");
	СоответствиеКода_Mango.Вставить("5001","Перегрузка");
	СоответствиеКода_Mango.Вставить("5002","Перезапуск");
	СоответствиеКода_Mango.Вставить("5003","Технические проблемы");
	СоответствиеКода_Mango.Вставить("5004","Проблемы доступа к базе данных");
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоОшибка_Mango(Данные)

	// обработка ошибок
	Статус = Данные.Получить("status");
	Если Не Статус=Неопределено Тогда
		Если ТипЗнч(Статус)=Тип("Число") Тогда
			Если Статус>400 Тогда
				Текст=Данные.Получить("message");
				ИмяОшибки=Данные.Получить("name");
				КодОшибки=Данные.Получить("code");
				//Если Не Отладка Тогда
					Если ЗначениеЗаполнено(Текст) Тогда
						ПоказатьОповещениеПользователя(ИмяОшибки,,Текст);
					КонецЕсли; 
				//КонецЕсли;
				Возврат Истина;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
	
&НаСервере
Функция ПодписатьПакет_Mango(JSONПакет)
	
	//sign = sha256(vpbx_api_key + json + vpbx_api_salt). 
	
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(КлючAPI + JSONПакет + КлючДляПодписи);
	
	ДвДанныеСумма = Хеш.ХешСумма;
	СтрПодпись = НРег(Строка(ДвДанныеСумма));
	СтрПодпись = СтрЗаменить(СтрПодпись," ","");
	Возврат СтрПодпись;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокОператоров_Mango(ИдентификаторСотрудника="")

	ДанныеJSON="{}";
	Если ЗначениеЗаполнено(ИдентификаторСотрудника) Тогда
		ДанныеJSON="{'extension':'"+ИдентификаторСотрудника+"'}";
	КонецЕсли;
	
	Подпись = ПодписатьПакет_Mango(СофтФонКлиентСервер.Stringify(ДанныеJSON));
	ТелоЗапроса = "vpbx_api_key=" + КлючAPI + "&sign=" + Подпись + "&json=" + КодироватьДанныеПакета(СофтФонКлиентСервер.Stringify(ДанныеJSON));

	// обработка запроса 
	Ресурс = "/vpbx/config/users/request";
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);

	Если НЕ Данные = Неопределено Тогда
		Если ЭтоОшибка_Mango(Данные) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ОбработкаСписокОператоров_Mango(Данные);		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаСписокОператоров_Mango(Данные)

	Содержимое = Данные.Получить("users");
	Если Не ТипЗнч(Содержимое)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	
	Для каждого ЭлементМассива Из Содержимое Цикл
		Попытка
			
			Общие=ЭлементМассива.Получить("general"); 
			Если Общие=Неопределено  Тогда
				Продолжить;
			КонецЕсли;
			
			Телефоны=ЭлементМассива.Получить("telephony");
			Если Телефоны=Неопределено  Тогда
				Продолжить;
			КонецЕсли;
			
			Номера=Телефоны.Получить("numbers");
			Если Номера=Неопределено  Тогда
				Продолжить;
			КонецЕсли; 
			
			Номер=Телефоны.Получить("extension");
			
			Для каждого ЭлементНомера Из Номера Цикл
				
				Протокол=ЭлементНомера.Получить("protocol");
				Статус=ЭлементНомера.Получить("status");
				УчЗапись=ЭлементНомера.Получить("number");
				
				Если НРег(Протокол)="sip" Тогда
					
					Если Не Номер=ВнутреннийНомер Тогда
						ПараметрыОтбора.Вставить("Номер",Номер);
						МассивСтрок=ВнутренниеНомера_Mango.НайтиСтроки(ПараметрыОтбора);
						Если МассивСтрок.Количество()>0 Тогда
							СтрВнутренниеНомера=МассивСтрок[0];
						Иначе
							СтрВнутренниеНомера=ВнутренниеНомера_Mango.Добавить();
						КонецЕсли; 
						СтрВнутренниеНомера.Номер=Номер;
						СтрВнутренниеНомера.Протокол=Протокол;
						СтрВнутренниеНомера.УчетнаяЗапись=УчЗапись;
						СтрВнутренниеНомера.Имя=Общие.Получить("name");
						СтрВнутренниеНомера.Статус=Макс((Статус="on"),СтрВнутренниеНомера.Статус);
					Иначе
						//СтатусТелефона=Макс((Статус="on"),СтатусТелефона);
						УчетнаяЗапись_Mango = УчЗапись;
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		Исключение
		КонецПопытки; 
	КонецЦикла;
	
	//ЗаполнитьПользователей();
	ВнутренниеНомера_Mango.Сортировать("Номер");

КонецФункции

&НаКлиенте
Функция ПолучитьСписокЛиний_Mango()

	ДанныеJSON="{}";
	
	Подпись = ПодписатьПакет_Mango(СофтФонКлиентСервер.Stringify(ДанныеJSON));
	ТелоЗапроса = "vpbx_api_key=" + КлючAPI + "&sign=" + Подпись + "&json=" + КодироватьДанныеПакета(СофтФонКлиентСервер.Stringify(ДанныеJSON));

	// обработка запроса 
	Ресурс = "/vpbx/incominglines";
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);

	Если НЕ Данные = Неопределено Тогда
		Если ЭтоОшибка_Mango(Данные) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ОбработкаСписокЛиний_Mango(Данные);		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаСписокЛиний_Mango(Данные)

	Содержимое=Данные.Получить("lines");
	Если Не ТипЗнч(Содержимое)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыОтбора=Новый Структура;
	
	Для каждого ЭлементМассива Из Содержимое Цикл
					
		ИД=ЭлементМассива.Получить("line_id");
		
		ПараметрыОтбора.Вставить("ИД",ИД);
		МассивСтрок=Линии_Mango.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество()>0 Тогда
			СтрЛинии=МассивСтрок[0];
		Иначе
			СтрЛинии=Линии_Mango.Добавить();
		КонецЕсли; 
		СтрЛинии.УчетнаяЗапись=ЭлементМассива.Получить("number");;
		СтрЛинии.Номер=ЭлементМассива.Получить("name");;
					
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИсторию_Mango(Дата1, Дата2)

	Поля=",'fields':'records,start,finish,from_extension,from_number,to_extension,to_number,disconnect_reason,entry_id,answer,line_number,location'";
	ИДЗапроса="'api.history.load'";	// условный ИД
	ДанныеJSON="{'date_from':'"+ПолучитьДатуUT(УниверсальноеВремя(Дата1))+"','date_to':'"+ПолучитьДатуUT(УниверсальноеВремя(Дата2))+"'"+Поля+",'request_id':"+ИДЗапроса+"}";
		
	Подпись = ПодписатьПакет_Mango(СофтФонКлиентСервер.Stringify(ДанныеJSON));
	ТелоЗапроса = "vpbx_api_key=" + КлючAPI + "&sign=" + Подпись + "&json=" + КодироватьДанныеПакета(СофтФонКлиентСервер.Stringify(ДанныеJSON));

	// обработка запроса 
	Ресурс = "/vpbx/stats/request";
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);

	Если НЕ Данные = Неопределено Тогда
		Если ЭтоОшибка_Mango(Данные) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// в ответ должен вернуться ключ
		КлючИстории = Данные.Получить("key");
		Если Не ЗначениеЗаполнено(КлючИстории) Тогда
			СтрСообщения = "Запрос истории не выполнен";
			Если ЗначениеЗаполнено(Данные.Получить("message")) Тогда
				СтрСообщения=Данные.Получить("message");
			КонецЕсли; 
			ПоказатьОповещениеПользователя("Ошибка запроса истории", , СтрСообщения);			
		Иначе			
			ПолучитьИсториюПоКлючу_Mango(КлючИстории);
		КонецЕсли;
				
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИсториюПоКлючу_Mango(КлючИстории)

	ДанныеJSON="{'key':'"+КлючИстории+"'}";
	
	Подпись = ПодписатьПакет_Mango(СофтФонКлиентСервер.Stringify(ДанныеJSON));
	ТелоЗапроса = "vpbx_api_key=" + КлючAPI + "&sign=" + Подпись + "&json=" + КодироватьДанныеПакета(СофтФонКлиентСервер.Stringify(ДанныеJSON));

	// обработка запроса 
	Ресурс = "/vpbx/stats/result";
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");

	// все ответы приходят в формате JSON, за исключением статистики - она приходит в формате CSV
	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса, Ложь);  

	Если НЕ Данные = Неопределено Тогда
		Если ПустаяСтрока(Данные) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ОбработкаИсторияАТС_Mango(Данные);		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаИсторияАТС_Mango(Данные, Маркер="")
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", ТекущаяДата());
	СтруктПараметры.Вставить("Данные", Данные);
	СтруктПараметры.Вставить("КоллекцияВнутрНомера", ПолучитьСоответствиеВнутреннихНомеров_Mango());
	СтруктПараметры.Вставить("КоллекцияЛинии", ПолучитьСоответствиеЛиний_Mango());
	
	ОбработкаИсторияАТСКлиент(СтруктПараметры);
	
КонецФункции

&НаКлиенте
Функция ПолучитьСоответствиеВнутреннихНомеров_Mango()

	КоллекцияВнутрНомера=Новый Соответствие;
	КоллекцияВнутрНомера.Вставить(УчетнаяЗапись_Mango, ВнутреннийНомер);
	Для каждого Элемент Из ВнутренниеНомера_Mango Цикл
		КоллекцияВнутрНомера.Вставить(Элемент.УчетнаяЗапись, Элемент.Номер);
	КонецЦикла; 
	
	Возврат КоллекцияВнутрНомера;

КонецФункции

&НаКлиенте
Функция ПолучитьСоответствиеЛиний_Mango()

	КоллекцияЛинии = Новый Соответствие;
	Для каждого Элемент Из Линии_Mango Цикл
		КоллекцияЛинии.Вставить(Элемент.УчетнаяЗапись,Элемент.Номер);
	КонецЦикла; 
	
	Возврат КоллекцияЛинии;

КонецФункции

&НаКлиенте
Функция ПолучитьФайлЗаписи_Mango(ИДЗаписи, Команда)

	ДанныеJSON = "{'recording_id':'"+ИДЗаписи+"','action':'"+Команда+"'}";
	
	Подпись = ПодписатьПакет_Mango(СофтФонКлиентСервер.Stringify(ДанныеJSON));
	ТелоЗапроса = "vpbx_api_key=" + КлючAPI + "&sign=" + Подпись + "&json=" + КодироватьДанныеПакета(СофтФонКлиентСервер.Stringify(ДанныеJSON));

	// обработка запроса 
	Ресурс = "/vpbx/queries/recording/post";
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);  

	Если НЕ Данные = Неопределено Тогда
		Если ПустаяСтрока(Данные) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ОбработатьПолучениеСсылкиФайлаЗаписиЗвонка(РежимЗагрузкиЗаписиMango, Данные);		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьИсходящийЗвонок_Mango(Номер)

	ЛинияИЗ = "";
	СтрАвтоответ=",'sip_headers':{'Call-Info/answer-after':'0'}"; //автоответ внутреннего телефона при исходящем звонке; может оставить пустым
		
	ДанныеJSON="{'command_id':'api.outgoing."+ВнутреннийНомер+"','from':{'extension':'"+ВнутреннийНомер+"','number':'"+ЛинияИЗ+"'},'to_number':'"+Номер+"'"+СтрАвтоответ+"}";
		
	Подпись = ПодписатьПакет_Mango(СофтФонКлиентСервер.Stringify(ДанныеJSON));
	ТелоЗапроса = "vpbx_api_key=" + КлючAPI + "&sign=" + Подпись + "&json=" + КодироватьДанныеПакета(СофтФонКлиентСервер.Stringify(ДанныеJSON));

	// обработка запроса 
	Ресурс = "/vpbx/commands/callback";
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);  

	Если НЕ Данные = Неопределено Тогда
		Если ПустаяСтрока(Данные) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ОбработатьПолучениеСсылкиФайлаЗаписиЗвонка(РежимЗагрузкиЗаписиMango, Данные);		
	КонецЕсли;
	
КонецФункции	

&НаКлиенте
Функция ОбработкаСобытий_Mango(СобытиеПакета, ДанныеСобытия, ДополнительныеМетодыЗапроса)
	
	ДанныеСобытия = СтрЗаменить(ДанныеСобытия, "\""", """");
	//Данные = СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия, Истина);	
	Данные = СофтФонКлиентСервер.URL2JSON(ДанныеСобытия, Истина); //2022-05-23	
	Если Данные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Данные = Данные.Получить("json");
	Если Данные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДополнительныеМетодыЗапроса = "events/call" Тогда
		
		ТипСобытияЗвонка = Данные.Получить("call_state");
		Если ТипСобытияЗвонка=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		Если НРег(ТипСобытияЗвонка)="appeared" Тогда
		
			// начало звонка
			ОбработкаНачалаЗвонка_Mango(Данные);
		
		ИначеЕсли НРег(ТипСобытияЗвонка)="connected" Тогда
		
			// соединение
			ОбработкаСоединенияЗвонка_Mango(Данные);
		
		ИначеЕсли НРег(ТипСобытияЗвонка)="onhold" Тогда
		
			// удержание
			//ОбработкаУдержанияЗвонка(СодержимоеПакета);
		
		ИначеЕсли НРег(ТипСобытияЗвонка)="disconnected" Тогда
		
			// завершение
			ОбработкаЗавершенияЗвонка_Mango(Данные);
		
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Функция ОбработкаНачалаЗвонка_Mango(Данные)

	ИД = Данные.Получить("entry_id");
	Если ИД = Неопределено  Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрТекущиеЗвонки = ПолучитьСтрокуТекущегоЗвонка_Mango(ИД);
	
	СтрТекущиеЗвонки.call_id			= Данные.Получить("call_id");
	СтрТекущиеЗвонки.timestamp			= Данные.Получить("timestamp");
	СтрТекущиеЗвонки.seq				= Данные.Получить("seq");
	СтрТекущиеЗвонки.call_state			= Данные.Получить("call_state");
	СтрТекущиеЗвонки.location			= Данные.Получить("location");
	СтрТекущиеЗвонки.disconnect_reason	= Данные.Получить("disconnect_reason");
	СтрТекущиеЗвонки.command_id			= Данные.Получить("command_id");
	
	Откуда = Данные.Получить("from");
	Если Не Откуда=Неопределено Тогда
		СтрТекущиеЗвонки.from_extension=	Откуда.Получить("extension");
		СтрТекущиеЗвонки.from_number=		Откуда.Получить("number");
		СтрТекущиеЗвонки.taken_from_call_id=Откуда.Получить("taken_from_call_id");
	КонецЕсли; 
	
	Куда=Данные.Получить("to");
	Если Не Куда=Неопределено Тогда
		СтрТекущиеЗвонки.to_extension=	Куда.Получить("extension");
		СтрТекущиеЗвонки.to_number=		Куда.Получить("number");
		СтрТекущиеЗвонки.to_line_number=Куда.Получить("line_number");
		СтрТекущиеЗвонки.acd_group=		Куда.Получить("acd_group");
	КонецЕсли; 
	
	// внутренние не регистрируются
	ЭтоВнутренний = СофтФонКлиентСервер.ЭтоВнутренний_Mango(СтрТекущиеЗвонки.from_number,СтрТекущиеЗвонки.to_number);
	Если ЭтоВнутренний Тогда
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеЗвонки.from_extension,2,ИД);
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеЗвонки.to_extension,2,ИД);
		Возврат Ложь;
	КонецЕсли; 
	
	ЭтоЗвонокAPI=(Найти(СтрТекущиеЗвонки.command_id,"api.outgoing.")>0);
	ЭтоВходящий=(Откуда.Получить("extension")=Неопределено И Не ЭтоЗвонокAPI);
	СтрТекущиеЗвонки.Входящий=ЭтоВходящий;
	
	// определения номеров
	Номер=СтрТекущиеЗвонки.to_number;
	ВнутрНомер=СтрТекущиеЗвонки.from_extension;
	Если ЭтоВходящий=Истина Тогда
		Номер=СтрТекущиеЗвонки.from_number;
		ВнутрНомер=СтрТекущиеЗвонки.to_extension;
	КонецЕсли;
	СтрТекущиеЗвонки.Номер=Номер;
	СтрТекущиеЗвонки.ВнутрНомер=ВнутрНомер;
	СтрТекущиеЗвонки.Входящий=ЭтоВходящий;
	
	// маршрутизация на ответственного
	Если ЭтоВходящий=Истина Тогда
		Если СтрТекущиеЗвонки.location="ivr" Тогда
			//ВыполнитьМаршрутизацию(СтрТекущиеЗвонки);
		КонецЕсли; 
	КонецЕсли; 
	
	// действия по отлеживаемому внутреннему номеру
	Если ВнутрНомер=ВнутреннийНомер Тогда
		
		Если Не СофтФонКлиентСервер.ЭтоВнутренний_Mango(СтрТекущиеЗвонки.from_number,СтрТекущиеЗвонки.to_number) Тогда
		 
			Состояние="Вызов";
			ВнешняяЛиния=ПолучитьПредставлениеЛинии_Mango(СтрТекущиеЗвонки.to_line_number);
			СтрТекущиеЗвонки.Линия=ВнешняяЛиния;
			НомерАбонента=Номер;
			
			НаправлениеЗвонка="Исходящий";
			Если ЭтоВходящий=Истина Тогда
				НаправлениеЗвонка="Входящий";
				ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, ИД);
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЕсли; 

	// обновление списка внутренних
	Если НРег(СтрТекущиеЗвонки.location)="abonent" Тогда
		//ОбновитьСтатусВнутреннегоНомера(ВнутрНомер,2,ИД);
	КонецЕсли; 
		
КонецФункции

&НаКлиенте
Функция ОбработкаСоединенияЗвонка_Mango(Данные)

	ИД=Данные.Получить("entry_id");
	Если ИД=Неопределено  Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрТекущиеЗвонки=ПолучитьСтрокуТекущегоЗвонка_Mango(ИД);
	
	СтрТекущиеЗвонки.call_id=			Данные.Получить("call_id");
	СтрТекущиеЗвонки.timestamp=			Данные.Получить("timestamp");
	СтрТекущиеЗвонки.seq=				Данные.Получить("seq");
	СтрТекущиеЗвонки.call_state=		Данные.Получить("call_state");
	СтрТекущиеЗвонки.location=			Данные.Получить("location");
	СтрТекущиеЗвонки.disconnect_reason=	Данные.Получить("disconnect_reason");
	СтрТекущиеЗвонки.command_id=		Данные.Получить("command_id");
	
	Откуда=Данные.Получить("from");
	Если Не Откуда=Неопределено Тогда
		СтрТекущиеЗвонки.from_extension=	Откуда.Получить("extension");
		СтрТекущиеЗвонки.from_number=		Откуда.Получить("number");
		СтрТекущиеЗвонки.taken_from_call_id=Откуда.Получить("taken_from_call_id");
	КонецЕсли; 
	
	Куда=Данные.Получить("to");
	Если Не Куда=Неопределено Тогда
		СтрТекущиеЗвонки.to_extension=	Куда.Получить("extension");
		СтрТекущиеЗвонки.to_number=		Куда.Получить("number");
		СтрТекущиеЗвонки.to_line_number=Куда.Получить("line_number");
		СтрТекущиеЗвонки.acd_group=		Куда.Получить("acd_group");
	КонецЕсли; 
	
	// внутренние не регистрируются
	ЭтоВнутренний=СофтФонКлиентСервер.ЭтоВнутренний_Mango(СтрТекущиеЗвонки.from_number,СтрТекущиеЗвонки.to_number);
	Если ЭтоВнутренний Тогда
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеЗвонки.from_extension,4,ИД);
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеЗвонки.to_extension,4,ИД);
		Возврат Ложь;
	КонецЕсли; 
	
	ЭтоЗвонокAPI=(Найти(СтрТекущиеЗвонки.command_id,"api.outgoing.")>0);
	ЭтоВходящий=(Откуда.Получить("extension")=Неопределено И Не ЭтоЗвонокAPI);
	СтрТекущиеЗвонки.Входящий=ЭтоВходящий;
	
	// определения номеров
	Номер=СтрТекущиеЗвонки.to_number;
	ВнутрНомер=СтрТекущиеЗвонки.from_extension;
	Если ЭтоВходящий=Истина Тогда
		Номер=СтрТекущиеЗвонки.from_number;
		ВнутрНомер=СтрТекущиеЗвонки.to_extension;
	КонецЕсли; 
	СтрТекущиеЗвонки.Номер=Номер;
	СтрТекущиеЗвонки.ВнутрНомер=ВнутрНомер;
	СтрТекущиеЗвонки.Входящий=ЭтоВходящий;
	
	Если НРег(СтрТекущиеЗвонки.location)="abonent" Тогда		
		Если ВнутрНомер=ВнутреннийНомер Тогда			
			Если Не СофтФонКлиентСервер.ЭтоВнутренний_Mango(СтрТекущиеЗвонки.from_number,СтрТекущиеЗвонки.to_number) Тогда
				
				ДействияПриПоднятииТрубки_Mango(Номер, ИД);
				
			КонецЕсли;		
		КонецЕсли;
		
		ЗакрытьФормуВходящегоЗвонка(ИД);
			
		//ПараметрыОтбора=Новый Структура;
		//ПараметрыОтбора.Вставить("ИД",ИД);
		//МассивСтрок=ВнутренниеНомера.НайтиСтроки(ПараметрыОтбора);
		//Для каждого СтрВнутренниеНомера Из МассивСтрок Цикл
		//	ОбновитьСтатусВнутреннегоНомера(СтрВнутренниеНомера.Номер,1,"");
		//КонецЦикла; 
		//	
		//ОбновитьСтатусВнутреннегоНомера(ВнутрНомер,4,ИД);
		
	КонецЕсли; 
		
КонецФункции

&НаКлиенте
Функция ОбработкаЗавершенияЗвонка_Mango(Данные)

	ИД=Данные.Получить("entry_id");
	Если ИД=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Расположение=Данные.Получить("location");
	Если НРег(Расположение)="abonent" Тогда
		ИДПлеча=Данные.Получить("call_id");
	КонецЕсли; 
	
	СтрТекущиеЗвонки=ПолучитьСтрокуТекущегоЗвонка_Mango(ИД);
	Если СтрТекущиеЗвонки=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	СтрТекущиеЗвонки.call_id=			Данные.Получить("call_id");
	СтрТекущиеЗвонки.timestamp=			Данные.Получить("timestamp");
	СтрТекущиеЗвонки.seq=				Данные.Получить("seq");
	СтрТекущиеЗвонки.call_state=		Данные.Получить("call_state");
	СтрТекущиеЗвонки.location=			Данные.Получить("location");
	СтрТекущиеЗвонки.disconnect_reason=	Данные.Получить("disconnect_reason");
	СтрТекущиеЗвонки.command_id=		Данные.Получить("command_id");
	
	Откуда=Данные.Получить("from");
	Если Не Откуда=Неопределено Тогда
		СтрТекущиеЗвонки.from_extension=	Откуда.Получить("extension");
		СтрТекущиеЗвонки.from_number=		Откуда.Получить("number");
		СтрТекущиеЗвонки.taken_from_call_id=Откуда.Получить("taken_from_call_id");
	КонецЕсли; 
	
	Куда=Данные.Получить("to");
	Если Не Куда=Неопределено Тогда
		СтрТекущиеЗвонки.to_extension=	Куда.Получить("extension");
		СтрТекущиеЗвонки.to_number=		Куда.Получить("number");
		СтрТекущиеЗвонки.to_line_number=Куда.Получить("line_number");
		СтрТекущиеЗвонки.acd_group=		Куда.Получить("acd_group");
	КонецЕсли; 
	
	ЭтоВходящий=(Откуда.Получить("extension")=Неопределено);
	
	// определения внутр. номера
	ВнутрНомер = СтрТекущиеЗвонки.from_extension;
	Если ЭтоВходящий = Истина Тогда
		ВнутрНомер=СтрТекущиеЗвонки.to_extension;
	КонецЕсли; 
	СтрТекущиеЗвонки.Входящий=ЭтоВходящий;
	
	Если ВнутрНомер=ВнутреннийНомер Тогда
		Если Не СофтФонКлиентСервер.ЭтоВнутренний_Mango(СтрТекущиеЗвонки.from_number,СтрТекущиеЗвонки.to_number) Тогда
			ЗакрытьФормуВходящегоЗвонка(ИД);
			//Состояние="Завершен";
			//ЗакрытьФормуОповещения();
			//НажатьКнопкуЗаписи(Ложь);
		КонецЕсли; 
	КонецЕсли; 
	
	//ТекущиеЗвонки.Удалить(СтрТекущиеЗвонки);
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуТекущегоЗвонка_Mango(ИД, Создавать=Истина, ИДПлеча="")

	Результат=Неопределено;
	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("ИД",ИД);
	Если ЗначениеЗаполнено(ИДПлеча) Тогда
		ПараметрыОтбора.Вставить("call_id",ИДПлеча);
	КонецЕсли; 
	МассивСтрок=ТекущиеЗвонки_Mango.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество()=0 Тогда
		Если Создавать Тогда
			Результат=ТекущиеЗвонки_Mango.Добавить();
			Результат.ИД=ИД;
		КонецЕсли;
	Иначе
		Результат=МассивСтрок[0];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ПолучитьПредставлениеЛинии_Mango(УчетнаяЗапись)

	Результат=УчетнаяЗапись;
	
	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("УчетнаяЗапись",УчетнаяЗапись);
	
	МассивСтрок=Линии_Mango.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество()>0 Тогда
		Результат=МассивСтрок[0].Номер;
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_Mango(НомерАбонента, ИДЗвонка)
	
	Оповестить( "ПоднятиеТрубки_Mango", Новый Структура("НомерАбонента, ИДЗвонка", НомерАбонента, ИДЗвонка) );
		
КонецФункции

#КонецОбласти

#Область Binotel

&НаКлиенте
Процедура ИнициализироватьИнфоОшибок_Binotel()

	// инициализация информации об ошибках
	ИнфоОшибок = Новый Соответствие;
	Для Индекс = 1 По 10 Цикл
		ИнфоОшибок.Вставить("Requests are too frequent. You can do this request after "+Индекс+" sec.","Слишком частые запросы. Повторите запрос через "+Индекс+" секунд.");
	КонецЦикла; 
	ИнфоОшибок.Вставить("Can't call to the ext",	"Ошибка вызова внутреннего номера");
	ИнфоОшибок.Вставить("Wrong data",				"Ошибка получения данных");
	ИнфоОшибок.Вставить("Access Denied",			"Доступ запрещен");
	
	//http://developers.binotel.ua/
	//102	No such method
	//103	Not enough data
	//104	Wrong data
	//105	Something went wrong
	//106	Requests are too frequent
	//120	Your company is disabled
	//121	Your key or secret is wrong
	//150	Can't call to the ext
	//151	Can't call to the external number

КонецПроцедуры

&НаКлиенте
Функция ЭтоОшибка_Binotel(Данные)

	Если Не ТипЗнч(Данные)=Тип("Соответствие") Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Статус=Данные.Получить("status");
	
	// обработка ошибок
	Если Статус="error" Тогда
		ТекстОшибки=ИнфоОшибок.Получить(Данные.Получить("message"));
		Если ТекстОшибки=Неопределено Тогда
			ТекстОшибки=Данные.Получить("message");
		КонецЕсли; 
		ПоказатьОповещениеПользователя("Ошибка",,ТекстОшибки);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокОператоров_Binotel()

	// без ключа все команды запрещены
	Если Не ЗначениеЗаполнено(КлючAPI) ИЛИ Не ЗначениеЗаполнено(ПарольAPI) Тогда
		Возврат Ложь;
	КонецЕсли; 
			
	ТелоЗапроса = "{'secret':'" + ПарольAPI + "','key':'" + КлючAPI + "'}";
	ТелоЗапроса = СофтФонКлиентСервер.Stringify(ТелоЗапроса);
	
	// обработка запроса 
	Ресурс = "/api/" + ВерсияAPI + "/settings/list-of-employees.json";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Length", СтрДлина(ТелоЗапроса));
	Заголовки.Вставить("Content-Type", "application/json");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);

	Если НЕ Данные = Неопределено Тогда
		Если ЭтоОшибка_Binotel(Данные) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ОбработкаСписокОператоров_Binotel(Данные);		
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ОбработкаСписокОператоров_Binotel(Данные)

	ВнутренниеНомера_Binotel.Очистить();
	
	КоллекцияСотрудники=Данные.Получить("listOfEmployees");
	Для каждого ЭлементСотрудник Из КоллекцияСотрудники Цикл
	
		ОбъектКлюч=ЭлементСотрудник.Ключ;
		ОбъектСотрудник=ЭлементСотрудник.Значение;
		
		Если ТипЗнч(ОбъектСотрудник)=Тип("Соответствие") Тогда
		
			//extNumber=ОбъектСотрудник.Получить("extNumber");
			//Если Не ЗначениеЗаполнено(extNumber) Тогда
			//	Продолжить;
			//КонецЕсли;
			
			endpointData=ОбъектСотрудник.Получить("endpointData");
			Если Не ЗначениеЗаполнено(endpointData) Тогда
				Продолжить;
			КонецЕсли;
			internalNumber=endpointData.Получить("internalNumber");
			Если Не ЗначениеЗаполнено(internalNumber) Тогда
				Продолжить;
			КонецЕсли;
			
			ОбъектСтатус=ОбъектСотрудник.Получить("presenceState"); //"extStatus");
			
			Если Не internalNumber=ВнутреннийНомер Тогда
			
				СтрВнутренниеНомера = ВнутренниеНомера_Binotel.Добавить();
				СтрВнутренниеНомера.Имя=ОбъектСотрудник.Получить("name");
				СтрВнутренниеНомера.Номер=internalNumber;
				СтрВнутренниеНомера.НомерSIP=ОбъектСотрудник.Получить("extHash");
				СтрВнутренниеНомера.Мобильный=ОбъектСотрудник.Получить("mobilePhoneNumber");
				СтрВнутренниеНомера.Присутствие=ОбъектСотрудник.Получить("presenceState");
				СтрВнутренниеНомера.Статус=ОбъектСтатус; //.Получить("status");
				//СтрВнутренниеНомера.ИндексСтатуса=ПолучитьИндексСтатуса(СтрВнутренниеНомера.Статус);
			
			Иначе
				//СтатусТелефона=(Не ОбъектСтатус.Получить("status")="offline");
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЦикла;
	
	ВнутренниеНомера_Binotel.Сортировать("ИндексСтатуса Убыв, Номер Возр");
	//ЗаполнитьПользователей();

КонецФункции

&НаКлиенте
Функция ПолучитьСписокРингГрупп_Binotel()

	// без ключа все команды запрещены
	Если Не ЗначениеЗаполнено(КлючAPI) ИЛИ Не ЗначениеЗаполнено(ПарольAPI) Тогда
		Возврат Ложь;
	КонецЕсли; 
			
	ТелоЗапроса = "{'secret':'" + ПарольAPI + "','key':'" + КлючAPI + "'}";
	ТелоЗапроса = СофтФонКлиентСервер.Stringify(ТелоЗапроса);
	
	// обработка запроса 
	Ресурс = "/api/" + ВерсияAPI + "/settings/list-of-ring-groups.json";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Length", СтрДлина(ТелоЗапроса));
	Заголовки.Вставить("Content-Type", "application/json");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);

	Если НЕ Данные = Неопределено Тогда
		Если ЭтоОшибка_Binotel(Данные) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ОбработкаРингГруппы_Binotel(Данные);		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаРингГруппы_Binotel(Данные)

	УчастникиГруппы=Новый Массив;
	
	КоллекцияГруппы=Данные.Получить("listOfRingGroups");
	Для каждого ЭлементГруппы Из КоллекцияГруппы Цикл
	
		ОбъектКлюч=ЭлементГруппы.Ключ;
		ОбъектГруппа=ЭлементГруппы.Значение;
		
		Если ТипЗнч(ОбъектГруппа)=Тип("Соответствие") Тогда
		
			НомерГруппы=ОбъектГруппа.Получить("number");
			Если Не ЗначениеЗаполнено(НомерГруппы) Тогда
				Продолжить;
			КонецЕсли;
			
			ЧленыГруппы=ОбъектГруппа.Получить("members");
			Если Не ТипЗнч(ЧленыГруппы)=Тип("Массив") Тогда
				Продолжить;
			КонецЕсли; 
			
			Для каждого УчастникГруппы Из ЧленыГруппы Цикл
				УчастникиГруппы.Добавить(НомерГруппы+"_"+УчастникГруппы);
			КонецЦикла; 
		
		КонецЕсли; 
	
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИсторию_Binotel(Дата1, Дата2)
	
	// без ключа все команды запрещены
	Если Не ЗначениеЗаполнено(КлючAPI) ИЛИ Не ЗначениеЗаполнено(ПарольAPI) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Дата1 = ?(ЗначениеЗаполнено(Дата1), Дата1, ТекущаяДата());
	Дата2 = ?(ЗначениеЗаполнено(Дата2), Дата2, ТекущаяДата());

	СтрДата1="'startTime':" + ПолучитьДатуUT(Дата1);
	СтрДата2=",'stopTime':" + ПолучитьДатуUT(Дата2);
	
	ТелоЗапроса = "{'startTime':" + ПолучитьДатуUT(Дата1) + ",'stopTime':" + ПолучитьДатуUT(Дата2) + ",'secret':'" + ПарольAPI + "','key':'" + КлючAPI + "'}";
	ТелоЗапроса = СофтФонКлиентСервер.Stringify(ТелоЗапроса);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Length", СтрДлина(ТелоЗапроса));
	Заголовки.Вставить("Content-Type", "application/json");
		
	Если НачалоДня(Дата1) = НачалоДня(Дата2) Тогда

		Ресурс = "/api/" + ВерсияAPI + "/stats/list-of-calls-for-period.json";		
		Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);
		
		Если НЕ Данные = Неопределено Тогда
			Если ЭтоОшибка_Binotel(Данные) Тогда
				Возврат Ложь;
			КонецЕсли;
			
			ОбработкаИсторияАТС_Binotel(Данные);		
		КонецЕсли;
		
	Иначе
		// 2 запроса
		Ресурс = "/api/" + ВерсияAPI + "/stats/outgoing-calls-for-period.json";		
		Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);
		
		Если НЕ Данные = Неопределено Тогда
			Если ЭтоОшибка_Binotel(Данные) Тогда
				Возврат Ложь;
			КонецЕсли;
			
			ОбработкаИсторияАТС_Binotel(Данные);		
		КонецЕсли;
		
		Ресурс = "/api/" + ВерсияAPI + "/stats/incoming-calls-for-period.json";		
		Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);
		
		Если НЕ Данные = Неопределено Тогда
			Если ЭтоОшибка_Binotel(Данные) Тогда
				Возврат Ложь;
			КонецЕсли;
			
			ОбработкаИсторияАТС_Binotel(Данные);		
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаИсторияАТС_Binotel(Данные)

	КоллекцияЗвонки = Данные.Получить("callDetails");
	Если КоллекцияЗвонки=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
		
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", Неопределено);
	СтруктПараметры.Вставить("Данные", КоллекцияЗвонки);
	
	ОбработкаИсторияАТСКлиент(СтруктПараметры);
	
КонецФункции
	
&НаКлиенте
Функция ПолучитьФайлЗаписи_Binotel(ИДЗаписи)

	// без ключа все команды запрещены
	Если Не ЗначениеЗаполнено(КлючAPI) ИЛИ Не ЗначениеЗаполнено(ПарольAPI) Тогда
		Возврат Ложь;
	КонецЕсли; 
			
	ТелоЗапроса = "{'generalCallID':'" + ИДЗаписи + "','secret':'" + ПарольAPI + "','key':'" + КлючAPI + "'}";
	ТелоЗапроса = СофтФонКлиентСервер.Stringify(ТелоЗапроса);
	
	// обработка запроса 
	Ресурс = "/api/" + ВерсияAPI + "/stats/call-record.json";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Length", СтрДлина(ТелоЗапроса));
	Заголовки.Вставить("Content-Type", "application/json");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);

	Если НЕ Данные = Неопределено Тогда
		Если ЭтоОшибка_Binotel(Данные) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Успех = Данные.Получить("status");
		Если Не Успех="success" Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// время жизни ссылки 15 минут	
		ФайлЗаписиСсылка = Данные.Получить("url");
		Если ЗначениеЗаполнено(ФайлЗаписиСсылка) Тогда				
			ОбработатьПолучениеСсылкиФайлаЗаписиЗвонка(РежимЗагрузкиЗаписиBinotel, ФайлЗаписиСсылка);
		КонецЕсли;
	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаФайлЗаписи_Binotel(Данные, Маркер="")

	Успех=Данные.Получить("status");
	Если Не Успех="success" Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ФайлЗаписиСсылка=Данные.Получить("url");
	Если ЗначениеЗаполнено(ФайлЗаписиСсылка) Тогда				
		ОбработатьПолучениеСсылкиФайлаЗаписиЗвонка(РежимЗагрузкиЗаписиBinotel, ФайлЗаписиСсылка);
	КонецЕсли;
	
КонецФункции
	
&НаКлиенте
Функция ВыполнитьИсходящийЗвонок_Binotel(Номер)

	// без ключа все команды запрещены
	Если Не ЗначениеЗаполнено(КлючAPI) ИЛИ Не ЗначениеЗаполнено(ПарольAPI) Тогда
		Возврат Ложь;
	КонецЕсли; 
			
	ТелоЗапроса = "{'internalNumber':'" + ВнутреннийНомер+"','externalNumber':'"+Номер+"','playbackWaiting':0,'secret':'" + ПарольAPI + "','key':'" + КлючAPI + "'}";
	ТелоЗапроса = СофтФонКлиентСервер.Stringify(ТелоЗапроса);
	
	// обработка запроса 
	Ресурс = "/api/" + ВерсияAPI + "/calls/internal-number-to-external-number.json";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Length", СтрДлина(ТелоЗапроса));
	Заголовки.Вставить("Content-Type", "application/json");

	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);

	Если НЕ Данные = Неопределено Тогда
		Если ЭтоОшибка_Binotel(Данные) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область PhonetUa

&НаКлиенте
Процедура ИнициализироватьИнфоОшибок_Phonet()

	// инициализация информации об ошибках
	ИнфоОшибок=Новый Соответствие;
	ИнфоОшибок.Вставить("Too Many Requests","Слишком много запросов");
	ИнфоОшибок.Вставить("More than 1 request per 1.0 second(s)","Больше чем 1 запрос в секунду");
	ИнфоОшибок.Вставить("Bad Request","Неверный запрос");
	ИнфоОшибок.Вставить("Invalid date range","Неверный диапазон дат");
	ИнфоОшибок.Вставить("Access Denied","Доступ запрещен");

КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьСтатусы_Phonet()

	// инициализация состояний звонка
	СтатусыНомеров=Новый Соответствие;
	СтатусыНомеров.Вставить("online",	1);
	СтатусыНомеров.Вставить("inuse",	4);
	СтатусыНомеров.Вставить("ringing",	4);
	СтатусыНомеров.Вставить("offline",	0);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьИндексСтатуса_Phonet(СтрокаСтатуса)

	Результат = СтатусыНомеров.Получить(СтрокаСтатуса);
	Если Результат=Неопределено Тогда
		Результат=0;
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ПолучитьКлючREST_Phonet()

	КлючСессии=""; 
	Таймаут=5;
	
	ДанныеJSON="{'domain':'"+ДоменAPI+"','apiKey':'"+КлючAPI+"'}";
	ТелоЗапроса = СофтФонКлиентСервер.Stringify(ДанныеJSON);
	
	// обработка запроса 
	Ресурс = "/rest/security/authorize";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");

	КлючСессии = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса, , , , Таймаут, Истина);
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокОператоров_Phonet()

	// без ключа все команды запрещены
	Если Не ЗначениеЗаполнено(КлючСессии) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ресурс = "/rest/users";
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Cookie", КлючСессии);
	
	Данные = ВыполнитьRestЗапрос("GET", ДоменAPI, Ресурс, Заголовки);

	Если НЕ Данные = Неопределено Тогда		
		ОбработкаСписокОператоров_Phonet(Данные);
	КонецЕсли;
	
	//Путь="/rest/users";
	//ДанныеJSON="";
	//Пакет=СформироватьПакетREST(ДанныеJSON,Путь,"get");
	//ОтправитьПакетSimplitIO(Пакет);

	//Результат="";
	//	
	//	// проверка корректности переданных параметров
	//	Если Не ЗначениеЗаполнено(Путь) Тогда
	//		//Если Отладка Тогда
	//		//	Сообщить("Не указан путь REST-запроса");
	//		//КонецЕсли; 
	//		Возврат Результат;
	//	КонецЕсли;
	//	
 
	//	
	//	// формирование заголовков
	//	ДанныеЗаголовка="'Content-Type':'application/json'";
	//	Если ЗначениеЗаполнено(КлючСессии) Тогда
	//		ДанныеЗаголовка=ДанныеЗаголовка+",'Cookie':'"+КлючСессии+"'";
	//	КонецЕсли; 
	//	
	//	ДанныеТела="''";
	//	Если ЗначениеЗаполнено(ДанныеJSON) Тогда
	//		ДанныеТела=ДанныеJSON;
	//	КонецЕсли;
	//	
	//	Если НРег(Метод)="get" Тогда
	//		Если ЗначениеЗаполнено(ДанныеJSON) Тогда
	//			Путь=Путь+"?"+СофтФонКлиентСервер.JSON2URL(СофтФонКлиентСервер.Stringify(ДанныеJSON));
	//		КонецЕсли; 
	//	КонецЕсли; 
	//	
	//	Пакет=
	//	"{
	//	|'service': 'phonet', 
	//	|'data': 
	//	|	{
	//	|		'url': '"+Схема+ДоменAPI+Путь+"',
	//	|		'header': {"+ДанныеЗаголовка+"}, 
	//	|		'method': '"+ВРег(Метод)+"',";
	//	
	//	Если ЗначениеЗаполнено(Маркер) Тогда
	//		Пакет=Пакет+"
	//		|		'marker': '"+Маркер+"',";
	//	КонецЕсли; 
	//	
	//	Пакет=Пакет+"
	//	|		'data': "+ДанныеТела+"
	//	|	}
	//	|}";
	//	
	//	Результат=СофтФонКлиентСервер.Stringify(Пакет);

КонецФункции

&НаКлиенте
Функция ОбработкаСписокОператоров_Phonet(Данные)

	Если НЕ ТипЗнч(Данные) = Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ВнутренниеНомера_Phonet.Очистить();
	
	Для каждого ЭлементСотрудник Из Данные Цикл
		
		Если Не ТипЗнч(ЭлементСотрудник) = Тип("Соответствие") Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		Номер = ЭлементСотрудник.Получить("ext");
		Если Не Номер=ВнутреннийНомер Тогда
			СтрВнутренниеНомера=ВнутренниеНомера_Phonet.Добавить();
			СтрВнутренниеНомера.ИД=Формат(ЭлементСотрудник.Получить("id"),"ЧГ=0");
			СтрВнутренниеНомера.Номер=Номер;
			СтрВнутренниеНомера.Почта=ЭлементСотрудник.Получить("email");
			СтрВнутренниеНомера.Имя=ЭлементСотрудник.Получить("displayName");
			СтрВнутренниеНомера.Статус="online";
			СтрВнутренниеНомера.ИндексСтатуса=ПолучитьИндексСтатуса_Phonet(СтрВнутренниеНомера.Статус);
		Иначе
			СтатусТелефона=Истина;
		КонецЕсли; 
		
	КонецЦикла;
	
	ВнутренниеНомера_Phonet.Сортировать("ИндексСтатуса Убыв, Номер Возр");
	//ЗаполнитьПользователей();

КонецФункции

&НаКлиенте
Функция ПолучитьИсторию_Phonet(Дата1, Дата2)
	
	// без ключа все команды запрещены
	Если Не ЗначениеЗаполнено(КлючСессии) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Дата1 = ?(ЗначениеЗаполнено(Дата1), Дата1, ТекущаяДата());
	Дата2 = ?(ЗначениеЗаполнено(Дата2), Дата2, ТекущаяДата());
		
	СтрДата1 = ПолучитьДатуUT(Дата1, Истина);
	СтрДата2 = ПолучитьДатуUT(Дата2, Истина);

	Ресурс = "/rest/calls/company.api";
	ПараметрыЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("?timeFrom=%1&timeTo=%2", СтрДата1, СтрДата2);
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Cookie", КлючСессии);
	
	Данные = ВыполнитьRestЗапрос("GET", ДоменAPI, Ресурс + ПараметрыЗапроса, Заголовки);

	Если НЕ Данные = Неопределено Тогда		
		ОбработкаИсторияАТС_Phonet(Данные);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаИсторияАТС_Phonet(Данные)

	Если НЕ ЗначениеЗаполнено(Данные) Тогда
		Возврат Ложь;		
	КонецЕсли;
	
	Если НЕ ТипЗнч(Данные)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", ТекущаяДата());
	СтруктПараметры.Вставить("Данные", Данные);
	//СтруктПараметры.Вставить("КоллекцияВнутрНомера", ПолучитьСоответствиеВнутреннихНомеров_Phonet());
	
	ОбработкаИсторияАТСКлиент(СтруктПараметры);
	
КонецФункции

&НаКлиенте
Функция ВыполнитьИсходящийЗвонок_Phonet(Номер);
	
	// без ключа все команды запрещены
	Если Не ЗначениеЗаполнено(КлючСессии) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеJSON = "{'legExt':'"+ВнутреннийНомер+"','otherLegNum':'"+Номер+"'}";
	ТелоЗапроса = СофтФонКлиентСервер.Stringify(ДанныеJSON);
	
	Ресурс = "/rest/user/makeCall";
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Cookie", КлючСессии);
	
	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Ресурс, Заголовки, ТелоЗапроса);

	Если НЕ Данные = Неопределено Тогда		
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Beeline

&НаКлиенте
Процедура СоздатьПодписку_Beeline()
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("X-MPBX-API-AUTH-TOKEN", КлючAPI);
	Заголовки.Вставить("Content-Type", "application/json;");
		
	ДанныеJSON = СтрШаблон("{'pattern':'%1','expires':3600,'subscriptionType':'BASIC_CALL','url':'%2'}", ВнутреннийНомер, АдресВнешнейСистемыДляВАТС);
	ДанныеJSON = СофтФонКлиентСервер.Stringify(ДанныеJSON);
	
	Ресурс = "/apis/portal/subscription";
							
	Данные = ВыполнитьRestЗапрос("PUT", ДоменAPI, Ресурс, Заголовки, ДанныеJSON);

	Если НЕ Данные = Неопределено Тогда
		БилайнИДПодписки = Данные.Получить("subscriptionId");
		СохранитьБилайнИДПодписки(БилайнИДПодписки);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДействиеПодписки_Beeline()
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("X-MPBX-API-AUTH-TOKEN", КлючAPI);
	Заголовки.Вставить("Content-Type", "application/json;");
		
	Ресурс = СтрШаблон("/apis/portal/subscription?subscriptionId=%1", БилайнИДПодписки);
	
	Данные = ВыполнитьRestЗапрос("GET", ДоменAPI, Ресурс, Заголовки, , Ложь);

	Если Данные = Неопределено Тогда
		// подписка "умерла"
		СоздатьПодписку_Beeline();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьБилайнИДПодписки()
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Телефония", "БилайнИДПодписки");
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьБилайнИДПодписки(БилайнИДПодписки)
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Телефония", "БилайнИДПодписки", БилайнИДПодписки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокОператоров_Beeline()

	Ресурс = "/apis/portal/abonents";;
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("X-MPBX-API-AUTH-TOKEN", КлючAPI);
	
	Данные = ВыполнитьRestЗапрос("GET", ДоменAPI, Ресурс, Заголовки);

	Если Данные = Неопределено 
		ИЛИ НЕ ТипЗнч(Данные) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли; 
	
	ВнутренниеНомера_Beeline.Очистить();
	
	Для каждого ЭлементСотрудник Из Данные Цикл
		
		Если Не ТипЗнч(ЭлементСотрудник) = Тип("Соответствие") Тогда
			Возврат;
		КонецЕсли; 
				
		СтрВнутренниеНомера = ВнутренниеНомера_Beeline.Добавить();
		СтрВнутренниеНомера.ИД = ЭлементСотрудник.Получить("userId");
		СтрВнутренниеНомера.Номер=ЭлементСотрудник.Получить("extension");
				
		Если СтрВнутренниеНомера.Номер = ВнутреннийНомер Тогда
			ВнутреннийЛогин_Beeline = СтрВнутренниеНомера.ИД;
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИсторию_Beeline(Дата1, Дата2)
		
//	https://cloudpbx.beeline.ru/apis/portal/v2/statistics?dateFrom=2023-06-18T03%3A00%3A00.000Z&dateTo=2023-06-19T22%3A00%3A00.000Z&page=100&pageSize=100

	МаксИДЗаписи = СофтФон.МаксимальныйИДЗаписиВИстории(ИДВАТС);

	Дата1 = ?(ЗначениеЗаполнено(Дата1), Дата1, ТекущаяДата());
	Дата2 = ?(ЗначениеЗаполнено(Дата2), Дата2, ТекущаяДата());
		
	СтрДата1 = ПолучитьДатуUTC(Дата1, ".000Z");
	СтрДата2 = ПолучитьДатуUTC(Дата2, ".000Z");

	Ресурс = "/apis/portal/v2/statistics";
	ПараметрыЗапроса = СтрШаблон("?dateFrom=%1&dateTo=%2&page=NumPage&pageSize=100", СтрДата1, СтрДата2);
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("X-MPBX-API-AUTH-TOKEN", КлючAPI);
	
	ПолучитьИсториюПостранично_Beeline(Ресурс, ПараметрыЗапроса, Заголовки, 0, МаксИДЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИсториюПостранично_Beeline(Ресурс, ПараметрыЗапросаШаблон, Заголовки, НомерСтраницы, Знач МаксИДЗаписи)

	ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапросаШаблон, "NumPage", Формат(НомерСтраницы, "ЧН=0; ЧГ=0"));
	
	Данные = ВыполнитьRestЗапрос("GET", ДоменAPI, Ресурс + ПараметрыЗапроса, Заголовки);

	Если НЕ Данные = Неопределено И ТипЗнч(Данные) = Тип("Массив") Тогда
		Если Данные.Количество() > 0 Тогда
			
			//records
			Если ЗначениеЗаполнено(МаксИДЗаписи) Тогда
				РесурсПоЗаписям = СтрШаблон("/apis/portal/records?id=%1", Формат(МаксИДЗаписи, "ЧГ=0"));				
			Иначе	
				МинДата  = Данные[0].Получить("startDate");
				МаксДата = МинДата;
				Для каждого ЭлементМассива из Данные Цикл
					ДатаЗвонка = ЭлементМассива.Получить("startDate");
					Если ДатаЗвонка > МаксДата Тогда
						МаксДата = ДатаЗвонка;
					КонецЕсли;
					Если ДатаЗвонка < МинДата Тогда
						МинДата = ДатаЗвонка;
					КонецЕсли;
				КонецЦикла;			
				
				Смещение = 3*60*60;
				дМинДата  = СофтФонКлиентСервер.ДатаИзUT(МинДата, Ложь, Истина) - Смещение;
				дМаксДата = СофтФонКлиентСервер.ДатаИзUT(МаксДата, Ложь, Истина);
				РесурсПоЗаписям = СтрШаблон("/apis/portal/records?dateFrom=%1&dateTo=%2", ПолучитьДатуUTC(дМинДата, ".000Z"), ПолучитьДатуUTC(дМаксДата, ".000Z"));
			КонецЕсли;
			ДанныеПоЗаписям = ВыполнитьRestЗапрос("GET", ДоменAPI, РесурсПоЗаписям, Заголовки);
			Если ТипЗнч(ДанныеПоЗаписям) = Тип("Массив") Тогда
				Для каждого ЭлементМассива Из ДанныеПоЗаписям Цикл
					Попытка
						ИДЗаписи = Число(ЭлементМассива.Получить("id"));
						Если ИДЗаписи > МаксИДЗаписи Тогда
							МаксИДЗаписи = ИДЗаписи;
						КонецЕсли;
					Исключение
					КонецПопытки;
				КонецЦикла;
			КонецЕсли;
			
			ОбработкаИсторияАТС_Beeline(Данные, ДанныеПоЗаписям);
			ПолучитьИсториюПостранично_Beeline(Ресурс, ПараметрыЗапросаШаблон, Заголовки, НомерСтраницы + 1, МаксИДЗаписи);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИсторияАТС_Beeline(Данные, ДанныеПоЗаписям)
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", Неопределено);
	СтруктПараметры.Вставить("Данные", Данные);
	СтруктПараметры.Вставить("ДанныеПоЗаписям", ДанныеПоЗаписям);
	
	ОбработкаИсторияАТСКлиент(СтруктПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИсходящийЗвонок_Beeline(Номер)
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("X-MPBX-API-AUTH-TOKEN", КлючAPI);
	
	Ресурс = "/apis/portal/v2/abonents/%1/call?phoneNumber=%2";
	
	//Номер телефона, на который будет совершен вызов в международном формате: 
	// + (YYY) ХХХ ХХ ХХ, где + - обязательный символ, YYY - Код страны, XXX- номер телефона. Ограничение длины телефона с учетом кода страны: Min - 8 цифр Max - 13 цифр
	
	Метод = СтрШаблон(Ресурс, ВнутреннийНомер, Номер);
								
	Данные = ВыполнитьRestЗапрос("POST", ДоменAPI, Метод, Заголовки);

	Если НЕ Данные = Неопределено Тогда
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаСобытий_Beeline(Событие, ДанныеПакета)
		
	Если Событие = "message" Тогда
		
		Если Лев(ДанныеПакета, 5) = "<?xml" Тогда				
			
			ДанныеПакета = СтрЗаменить(ДанныеПакета, АдресВнешнейСистемыДляВАТС, "beeline");
			
			ИмяСобытия = "";
			номерАбонента = "";
			ВнешняяЛиния = "";
			startTime = "";
			callId = "";
			targetId  = "";
			ПакетПрочитан = Истина;
				
			Попытка
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.УстановитьСтроку(ДанныеПакета);
				
				// 1
				// Пакет = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);  не рабоатет чтение атрибутов внутри тегов
				
								
				СтекУзлов = Новый Массив;
				ТекущийПуть = "";
				
				Пока ЧтениеXML.Прочитать() Цикл
					
					Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
						СтекУзлов.Добавить(ЧтениеXML.Имя); 
						ТекущийПуть = СтрСоединить(СтекУзлов, "/");
						
						Если ЧтениеXML.Имя = "xsi:eventData" Тогда
							Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
								Если ЧтениеXML.Имя = "xsi1:type" Тогда
									ИмяСобытия = ЧтениеXML.Значение;
								КонецЕсли;
							КонецЦикла;
									
						КонецЕсли;
						
					ИначеЕсли  ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
						
						Если ТекущийПуть = "xsi:Event/xsi:eventData/xsi:call/xsi:remoteParty/xsi:address" Тогда
							НомерАбонента = СтрЗаменить(ЧтениеXML.Значение, "tel:", "");
							
						ИначеЕсли ТекущийПуть = "xsi:Event/xsi:eventData/xsi:call/xsi:redirections/xsi:redirection/xsi:party/xsi:address" Тогда
							ВнешняяЛиния = СтрЗаменить(ЧтениеXML.Значение, "tel:", "");
					
						ИначеЕсли ТекущийПуть = "xsi:Event/xsi:eventData/xsi:call/xsi:startTime" Тогда
							startTime = ЧтениеXML.Значение;
							
						ИначеЕсли ТекущийПуть = "xsi:Event/xsi:eventData/xsi:call/xsi:callId" Тогда
							callId = ЧтениеXML.Значение;							
							
						ИначеЕсли ТекущийПуть = "xsi:Event/xsi:targetId" Тогда
							targetId = ЧтениеXML.Значение;
							
						ИначеЕсли ТекущийПуть = "xsi:Event/xsi:subscriptionId" Тогда
							ИдПодписки = ЧтениеXML.Значение;
						КонецЕсли;						
						
					ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
						СтекУзлов.Удалить(СтекУзлов.Количество()-1);
						ТекущийПуть = СтрСоединить(СтекУзлов, "/");
					КонецЕсли;
					
				КонецЦикла;
				
				ЧтениеXML.Закрыть();
				
			Исключение
				ПакетПрочитан = Ложь;
			КонецПопытки;
			
			Если ПакетПрочитан
				И ИдПодписки = БилайнИДПодписки
				И targetId = ВнутреннийЛогин_Beeline Тогда
				
				Если ИмяСобытия = "xsi:CallReceivedEvent" Тогда
					// входящий звонок
					
					//НоваяСтрока = ИсторияБилайн.Добавить();
					//НоваяСтрока.Event = ИмяСобытия;
					//НоваяСтрока.startTime = startTime;
					//НоваяСтрока.callId = callId;
					//НоваяСтрока.Caller = НомерАбонента;
					
					ИДСессии = "";
					Если Не ПустаяСтрока(startTime) Тогда
						// поле нужно для сопоставления с историей звонков, где нет ИД
						// делаем самодельный составной ключ
						// отсекаем последние значения
						ИДСессии = Лев(startTime, СтрДлина(startTime)-3) + "_" + ВнутреннийНомер;
					КонецЕсли;
					ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, callId, ИДСессии);
					
				ИначеЕсли ИмяСобытия = "xsi:CallAnsweredEvent" Тогда
					
					// подняли трубку
					ДействияПриПоднятииТрубки_Beeline(НомерАбонента, callId);
					ЗакрытьФормуВходящегоЗвонка(callId);
		
					//НоваяСтрока = ИсторияБилайн.Добавить();
					//НоваяСтрока.Event = ИмяСобытия;
					//НоваяСтрока.startTime = startTime;
					//НоваяСтрока.callId = callId;
					//НоваяСтрока.Caller = НомерАбонента;					
					
				ИначеЕсли ИмяСобытия = "xsi:CallReleasedEvent" Тогда
					// при сбросе вызова либо абонентом, либо удаленной стороной
					// завершили звонок
					ЗакрытьФормуВходящегоЗвонка(callId);
					
				КонецЕсли;				
				
			КонецЕсли;
				
		КонецЕсли; 
		
	КонецЕсли; 
	
	
КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_Beeline(НомерАбонента, ИДЗвонка)
	
	Оповестить("ПоднятиеТрубки_Beeline", Новый Структура("НомерАбонента, ИДЗвонка", НомерАбонента, ИДЗвонка) );
		
КонецФункции

&НаКлиенте
Процедура ПолучитьФайлЗаписи_Beeline(ИдЗаписи, Команда)
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("X-MPBX-API-AUTH-TOKEN", КлючAPI);
	
	Ресурс = СтрШаблон("/apis/portal/v2/records/%1/download", ИдЗаписи);
	
	ПутьКФайлу = КаталогЗаписи + ИдЗаписи + ".mp3";
	Данные = ВыполнитьRestЗапрос("GET", ДоменAPI, Ресурс, Заголовки, , , , Истина, , , ПутьКФайлу);
	
	//Если НЕ Данные = Неопределено Тогда	
	//	Если Данные.Свойство("isNotAuth") И Данные.isNotAuth = Истина Тогда
	//		РезультатАвторизации = ВыполнитьЗапросКлючаRest_OnlinePBX();				
	//		Если РезультатАвторизации Тогда
	//			ПолучитьФайлЗаписи_OnlinePBX(ИдЗаписи);
	//		КонецЕсли;
	//	Иначе			
	//		Если Данные.Свойство("data") Тогда
	//			СсылкаНаФайлЗаписи = Данные.data;
	//			Если ЗначениеЗаполнено(СсылкаНаФайлЗаписи) 
	//				И ТипЗнч(СсылкаНаФайлЗаписи)=Тип("Строка") Тогда				
	//				ОбработкаФайлЗаписи_OnlinePBX(СсылкаНаФайлЗаписи);
	//			  КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;		
	//КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

КлючЗапрашивался=Ложь;