
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Запись.Идентификатор = СокрЛП(Запись.Идентификатор);
	
	// проверяем уникальность ИД на случай если пользователь меняет запись руками	 
	ЗаписиСТакимиИД = ИдентификаторУникален(Запись.Идентификатор, Запись.Сайт, Запись.Объект, Запись.ИсходныйКлючЗаписи);
	Если ЗаписиСТакимиИД.Количество() > 0 Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура("ДанныеЗаписей", ЗаписиСТакимиИД);
		ОткрытьФорму("РегистрСведений.ИдентификаторыОбъектовWikki.Форма.ФормаДублей", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторУникален(Идентификатор, Сайт, Объект, ИсходныйКлючЗаписи)
	
	Результат = Новый Массив;
	
	ТекущаяЗапись = РегистрыСведений.ИдентификаторыОбъектовWikki.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ТекущаяЗапись, ИсходныйКлючЗаписи);
	ТекущаяЗапись.Прочитать();
	ЭтоНовый = НЕ ТекущаяЗапись.Выбран();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИдентификаторыОбъектовWikki.Сайт КАК Сайт,
	|	ИдентификаторыОбъектовWikki.Объект КАК Объект,
	|	ИдентификаторыОбъектовWikki.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.ИдентификаторыОбъектовWikki КАК ИдентификаторыОбъектовWikki
	|ГДЕ
	|	ИдентификаторыОбъектовWikki.Сайт = &Сайт
	|	И ИдентификаторыОбъектовWikki.Идентификатор = &Идентификатор
	|	И НЕ ИдентификаторыОбъектовWikki.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Сайт", Сайт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// если меняется текущая запись
		Если НЕ ЭтоНовый
			И Выборка.Сайт = ТекущаяЗапись.Сайт
			И Выборка.Идентификатор = ТекущаяЗапись.Идентификатор
			И Выборка.Объект = ТекущаяЗапись.Объект Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(Новый Структура("Сайт, Идентификатор, Объект", Выборка.Сайт, Выборка.Идентификатор, Выборка.Объект));		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

