Функция ВыполнитьЗапрос(СпрЗапрос, ПараметрыЗапроса) Экспорт
        
	Параметры = Новый Структура;
	Для каждого КиЗ Из ПараметрыЗапроса Цикл
		Параметры.Вставить(КиЗ.Ключ, КиЗ.Значение);	
	КонецЦикла;

	Результат = Новый Структура("Выполнен, ТекстОшибки, Спр, ТекстЗапроса, Параметры, Таб"
	, Ложь
	, ""
	, СпрЗапрос
	, СпрЗапрос.ТекстЗапроса
	, Параметры
	, Новый ТаблицаЗначений
	);

	Если СпрЗапрос.РежимСКД Тогда
		
		Попытка
			ТЗ = ИА_БФС.СКД_Выполнить(СпрЗапрос.ХранилищеСКД.Получить()
			, Параметры
			, 2
			,
			,
			, СпрЗапрос.ХранилищеНастроек.Получить());
			
			ИскКол = ТЗ.Коллекция.колонки.Найти("Сумма");
			Если ИскКол <> Неопределено Тогда
				ИскКол.Имя = "__Сумма";	
			КонецЕсли; 
			
			ИскКол = ТЗ.Коллекция.колонки.Найти("РесурсЗначение");
			Если ИскКол <> Неопределено Тогда
				ИскКол.Имя = "Сумма";	
			КонецЕсли;
				 
			Результат.Вставить("Таб", ТЗ.Коллекция);
			Результат.Выполнен = Истина;
		Исключение
			Результат.ТекстОшибки = ОписаниеОшибки();
		КонецПопытки; 
	иначе  
		
		ТабПараметровЗапроса = СпрЗапрос.ТабПараметровЗапроса.Получить();
		Если ТабПараметровЗапроса <> Неопределено Тогда
			Для каждого Стр Из ТабПараметровЗапроса Цикл
				// Параметр определен, то не заполнять параметром из справочника
				Если НЕ Параметры.Свойство(стр.ИмяПараметра)Тогда 
					Параметры.Вставить(стр.ИмяПараметра, Стр.Значение);
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; 
		
		Запрос = Новый Запрос(Результат.ТекстЗапроса);
		Для каждого КиЗ Из Параметры Цикл
			Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);
		КонецЦикла;  
		
		Попытка
			ТЗ = Запрос.Выполнить().Выгрузить();
			Результат.Вставить("Таб", ТЗ);
			Результат.Выполнен = Истина;
		Исключение
			Результат.ТекстОшибки = ОписаниеОшибки();
		КонецПопытки; 
	КонецЕсли; 

	Результат.Вставить("Параметры", Параметры);
	Возврат Результат;
КонецФункции