
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ №14932 настройки компоновки данных для отобра номенклатуры при заказе в производство из заказа покупателя
	СхемаКД = ПолучитьОбщийМакет("СхемаНастроекПоНоменклатуреКПроизводству");
	
	НастройкиКомпоновкиДанных = Константы.НастройкиКомпоновкиПоНоменклатуреКПроизводству.Получить().Получить();
	
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКД, УникальныйИдентификатор);
	КомпоновщикНастроекПоНоменклатуреКПроизводству.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	
	Если НастройкиКомпоновкиДанных = Неопределено Тогда
		КомпоновщикНастроекПоНоменклатуреКПроизводству.ЗагрузитьНастройки(СхемаКД.НастройкиПоУмолчанию);
	Иначе
		КомпоновщикНастроекПоНоменклатуреКПроизводству.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
		КомпоновщикНастроекПоНоменклатуреКПроизводству.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	//-- №14932
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	// №14932
	Константы.НастройкиКомпоновкиПоНоменклатуреКПроизводству.Установить(новый ХранилищеЗначения(КомпоновщикНастроекПоНоменклатуреКПроизводству.ПолучитьНастройки()));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	СохранитьНаСервере();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Сброс(Команда)
	СбросНаСервере();
КонецПроцедуры

&НаСервере
Процедура СбросНаСервере()

	СхемаКД = ПолучитьОбщийМакет("СхемаНастроекПоНоменклатуреКПроизводству");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКД, УникальныйИдентификатор);
	КомпоновщикНастроекПоНоменклатуреКПроизводству.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	
	КомпоновщикНастроекПоНоменклатуреКПроизводству.ЗагрузитьНастройки(СхемаКД.НастройкиПоУмолчанию);
	
	//Элементы.КомпоновщикНастроекПоНоменклатуреКПроизводствуПользовательскиеНастройки.Обновить();
	КомпоновщикНастроекПоНоменклатуреКПроизводству.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроекПоНоменклатуреКПроизводству.ПользовательскиеНастройки)
	
КонецПроцедуры
