
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыводитьДетальныеЗаписи", Ложь);
	//ПараметрыФормы.Вставить("ДополнительныйКлючОтчета", "ЭффективностьМаркетинга");
	//ПараметрыФормы.Вставить("ОтчетНаименование", "Эффективность маркетинга");
	
	ОткрытьФорму("Отчет.ЭффективностьМаркетинга.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
