//ФУНКЦИИ РАБОТЫ с КазИнфоТех (Казахстан)

Функция СрмПустаяСтрока() Экспорт
	Возврат "";	
КонецФункции

Функция ПолучитьПараметрKazInfoTeh(НомерПараметра) Экспорт
	
	Если НомерПараметра = 1 Тогда		
		Возврат "http://isms.center/soap";
	ИначеЕсли НомерПараметра = 2 Тогда
		Возврат "http://tempuri.org/";		
	ИначеЕсли НомерПараметра = 3 Тогда
		Возврат "SendSMSService";	
	ИначеЕсли НомерПараметра = 4 Тогда
		Возврат "SendSMSServicePort";
	ИначеЕсли НомерПараметра = 5 Тогда
		Возврат "http://tempuri.org/";
	ИначеЕсли НомерПараметра = 6 Тогда
		Возврат "SMSM";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ОтправитьСМСKazInfoTeh(strLogin, strPass, strSpace, strSubNo, strText) Экспорт	
	
	РезультатПроверки = ОбщийМодуль.ОпределитьМассивПеременныхСеанса();
	Если НЕ РезультатПроверки.Лицензия Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка	
		Попытка 
			Определение = Новый WSОпределения(ПолучитьПараметрKazInfoTeh(1));
		Исключение
			Результат = "Ошибка!";
			ЗаписьЖурналаРегистрации("ОтправкаСмс",УровеньЖурналаРегистрации.Ошибка,,,"Ошибка отправки смс : " +ОписаниеОшибки());
			Возврат Результат;
		КонецПопытки;
		
		Попытка 
			Прокси = Новый WSПрокси(Определение, ПолучитьПараметрKazInfoTeh(2), ПолучитьПараметрKazInfoTeh(3), ПолучитьПараметрKazInfoTeh(4));
		Исключение
			Результат = "Ошибка!";
			ЗаписьЖурналаРегистрации("ОтправкаСмс",УровеньЖурналаРегистрации.Ошибка,,,"Ошибка отправки смс : " +ОписаниеОшибки());
			Возврат Результат;
		КонецПопытки;
	
		Фабрика = Прокси.ФабрикаXDTO;
		
		Тип_SMSM = Фабрика.Тип(ПолучитьПараметрKazInfoTeh(5), ПолучитьПараметрKazInfoTeh(6));
		СМС_Сообщение = Фабрика.Создать(Тип_SMSM);
		СМС_Сообщение.recepient = РаботаССМС.ПодготовитьНомерТелефонаДляОтправкиСМС(strSubNo); 
		СМС_Сообщение.senderid = strSpace;
		СМС_Сообщение.msg = strText;
		СМС_Сообщение.msgtype = 0;
		СМС_Сообщение.scheduled = СрмПустаяСтрока();
		СМС_Сообщение.UserMsgID = СрмПустаяСтрока();
		СМС_Сообщение.prioritet = 2;

		
		Результат = Прокси.SendMessage(strLogin, strPass, СМС_Сообщение);
		
		Если Число(Результат.StatusCode) = 0 Тогда
			Результат = "OK";
		Иначе
			Результат = "Ошибка: " + Результат.Status;
		КонецЕсли;
	Исключение
		Результат = "Ошибка обмена данными с сервером!";
		ЗаписьЖурналаРегистрации("ОтправкаСмс",УровеньЖурналаРегистрации.Ошибка,,,"Ошибка отправки смс : " +ОписаниеОшибки());
		ВызватьИсключение "Ошибка отправки смс: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;	
КонецФункции

