
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("Назначение") Тогда
			КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздать.Видимость = Ложь;
			
			Элементы.ФормаСоздатьТовар.Видимость = (Параметры.Отбор.Назначение = "Товары");
			Элементы.ФормаСоздатьМатериал.Видимость = (Параметры.Отбор.Назначение = "Материалы");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТоварМатериал(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Назначение", ?(Команда.Имя = "СоздатьТовар", 1, 2));
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);	
	ОткрытьФорму("РегистрСведений.РазрешеннаяНоменклатураРозницы.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры
