
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если объект.Предопределенный тогда
		ЭтаФорма.ТолькоПросмотр = истина;
		Элементы.ФормаКоманднаяПанель.Доступность = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПоказатьПодсказки", 0.2, истина);
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьПодсказки() Экспорт
	Элементы.ДекорацияПоставщик.Видимость = объект.Ссылка = ПредопределенноеЗначение("Справочник.КСУ_ИсточникиСредств.ВозвратОтПоставщика");
	Элементы.ДекорацияОстатки.Видимость = объект.Ссылка = ПредопределенноеЗначение("Справочник.КСУ_ИсточникиСредств.ВнесениеНачальныхОстатков");
КонецПроцедуры
