
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИспользоватьПодразделения", Параметры.ИспользоватьПодразделения);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДетализацияУчетаЛидов.Ссылка КАК Ссылка,
	|	ДетализацияУчетаЛидов.Наименование КАК Наименование,
	|	ДетализацияУчетаЛидов.Использовать КАК Использовать
	|ИЗ
	|	Справочник.ДетализацияУчетаЛидов КАК ДетализацияУчетаЛидов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ДетализацияУчетаЛидов.Ссылка = ЗНАЧЕНИЕ(Справочник.ДетализацияУчетаЛидов.Подразделение)
	|				ТОГДА &ИспользоватьПодразделения
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДетализацияУчетаЛидов.РеквизитДопУпорядочивания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Детализация.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияИспользоватьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Детализация.ТекущиеДанные;
	ИзменитьПризнакИспользования(ТекущиеДанные.Ссылка, ТекущиеДанные.Использовать);
	Оповестить("Запись_ДетализацияУчетаЛидов");
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПризнакИспользования(Ссылка, Использовать)

	СпрОбъект = Ссылка.ПолучитьОбъект();
	СпрОбъект.Использовать = Использовать;
	СпрОбъект.Записать();
	
КонецПроцедуры