Функция ПолучитьЦенуНоменклатурыВВалюте(Знач ДатаЦены, Знач Контрагент, Знач Номенклатура, Знач ХарактеристикаНоменклатуры, Знач ЕдиницаИзмерения, Знач Валюта, Знач ВидЦены = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныПоставщиков.СрезПоследних(
	|			&ДатаЦены,
	|			Поставщик = &Контрагент
	|				И ЕдиницаИзмерения = &ЕдиницаИзмерения
	|				И Номенклатура = &Номенклатура
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|				И Валюта = &Валюта
	|				И ВЫБОР
	|					КОГДА &ОтборПоВидуЦены
	|						ТОГДА ВидЦеныПоставщика = &ВидЦены
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаЦены",					КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("Контрагент",					Контрагент);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",			ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Номенклатура",				Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Валюта",						Валюта);
	Запрос.УстановитьПараметр("ВидЦены", 					ВидЦены);
	Запрос.УстановитьПараметр("ОтборПоВидуЦены", 			НЕ ВидЦены = Неопределено);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции
