
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();	 
	ПараметрыОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных;	
	
	Параметр = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Кассы"));
	ИспользоватьОтборПоКассам = Ложь;
	Если ТипЗнч(Параметр.Значение) = Тип("СправочникСсылка.Кассы") Тогда
		ИспользоватьОтборПоКассам = ЗначениеЗаполнено(Параметр.Значение);
	ИначеЕсли ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") Тогда
	    ИспользоватьОтборПоКассам = Параметр.Значение.Количество() > 0;
	КонецЕсли;
	
	Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИспользоватьОтборПоКассам"));
	Параметр.Значение = ИспользоватьОтборПоКассам;
	
КонецПроцедуры
