#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Дата");
	Поля.Добавить("ВидОперации");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = "Установка цен на услуги производства от " + Формат(Данные.Дата, "ДЛФ=Д");
	Если Данные.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоИнтеркампани") Тогда
		Представление = Представление + " (интеркампани)";
	ИначеЕсли Данные.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ДляВнутреннихЗаказов") Тогда
		Представление = Представление + " (для внутренних заказов)";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ПодобратьДокументЦенНаУслугиПроизводства(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено,
												 Знач ВидЦенНастройкаИнтеркампани = Неопределено, Знач ДоговорКонтрагента = Неопределено, 
												 ПересчитыватьВВалютуПараметра)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	ОсновнаяВалютаПересчетаЦены = Константы.ОсновнаяВалютаПересчетаЦены.Получить();
	
	ДокументУЦНУП = ПолучитьВидЦенНаУслугиПроизводства(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента);
	
	ПересчитыватьВВалютуПараметра = Ложь;
	Если ДокументУЦНУП = Справочники.ЦеныУслугРаскроя.ПустаяСсылка() Тогда
		
		ПересчитыватьВВалютуПараметра = Истина;
		
		//++ №12971 комментируем
		//Если (Валюта = ВалютаУчета) И (НЕ Валюта = ОсновнаяВалютаПересчетаЦены) Тогда
		// 	// пробуем получить документ УЦ по основной валюте пересчета цен, если валюта документа = валюта учета
		//	ДокументУЦНУП = ПолучитьВидЦенНаУслугиПроизводства(ВидОперации, ВидЦенНастройкаИнтеркампани, Дата, ОсновнаяВалютаПересчетаЦены, ДоговорКонтрагента);
		//Иначе
		//	// №12930 пробуем получить документ УЦ по валюте учета и пересчитать по курсу валюты документа
		//	ДокументУЦНУП = ПолучитьВидЦенНаУслугиПроизводства(ВидОперации, ВидЦенНастройкаИнтеркампани, Дата, ВалютаУчета, ДоговорКонтрагента);
		//КонецЕсли;
		//-- №12971 комментируем
		
		//++ №12971 по новому
		// 1. Если не нашли документ УЦ по валюте документа и задана валюта пересчета, ищем прайс в валюте пересчета
		//	(если нашли, то ставим цену в валюте документа по курсу к валюте пересчета)
		Если ЗначениеЗаполнено(ОсновнаяВалютаПересчетаЦены) Тогда
			ДокументУЦНУП = ПолучитьВидЦенНаУслугиПроизводства(Дата, ОсновнаяВалютаПересчетаЦены, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента);
		КонецЕсли;
		
		// 2. Если не нашли документ УЦ по валюте пересчета, то ищем прайс в валюте учета (если валюта документа отличается от валюты учёта)
		//	(если нашли, то ставим цену в валюте документа по курсу к валюте учета)
		Если ДокументУЦНУП = Справочники.ЦеныУслугРаскроя.ПустаяСсылка() И НЕ Валюта = ВалютаУчета Тогда
			ДокументУЦНУП = ПолучитьВидЦенНаУслугиПроизводства(Дата, ВалютаУчета, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента);
		КонецЕсли;
		//-- №12971 по новому
	
	КонецЕсли;
	
	Возврат ДокументУЦНУП;
	
КонецФункции

Функция ПолучитьВидЦенНаУслугиПроизводства(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено, 
										   Знач ВидЦенНастройкаИнтеркампани = Неопределено,  
										   Знач ДоговорКонтрагента = Неопределено) Экспорт
										   
//Функция ПолучитьВидЦенРаскрояПоВидуЦен(Знач ВидЦенНастройкаИнтеркампани, Знач Дата, Знач Валюта, Знач ДоговорКонтрагента = Неопределено) Экспорт	
	Если Дата = Дата(1,1,1) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Если ВидОперации = Неопределено Тогда
		ВидОперации = Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПустаяСсылка();
	КонецЕсли;
	Если ДоговорКонтрагента = Неопределено Тогда
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	//#7256
	Если ТипЗнч(ВидЦенНастройкаИнтеркампани) = Тип("СправочникСсылка.ВидыЦен") И ЗначениеЗаполнено(ВидЦенНастройкаИнтеркампани) Тогда
		РеквизитыВидаЦен = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидЦенНастройкаИнтеркампани, "СсылочныйВидЦены, ВидЦеныНаУслугиПроизводства");
		Если РеквизитыВидаЦен.СсылочныйВидЦены Тогда
			ВидЦенНастройкаИнтеркампани = РеквизитыВидаЦен.ВидЦеныНаУслугиПроизводства;
		КонецЕсли;	
	КонецЕсли;

	Результат = Справочники.ЦеныУслугРаскроя.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя КАК ЦеныУслугРаскроя
	|ИЗ
	|	РегистрСведений.СоответствиеВидовЦенЦенамУслугРаскроя.СрезПоследних(
	|			&Дата,
	|			Валюта = &Валюта
	|				И ВидНоменклатуры = &ВидНоменклатуры
	|				И ВидОперации = &ВидОперации
	|				И ВидЦен = &ВидЦенНастройкаИнтеркампани) КАК СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних
	|";
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	Запрос.УстановитьПараметр("ВидЦенНастройкаИнтеркампани", ВидЦенНастройкаИнтеркампани);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.ЦеныУслугРаскроя;
	КонецЦикла;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены") И НЕ ДоговорКонтрагента.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА НЕ СоответствиеИндивидуальныхЦен.ВидЦеныНаУслугиПроизводства = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|			ТОГДА СоответствиеВидовЦен.ЦеныУслугРаскроя
		|		ИНАЧЕ СоответствиеИндивидуальныхЦен.Документ
		|	КОНЕЦ КАК ЦеныУслугРаскроя,
		|	СоответствиеИндивидуальныхЦен.Отменена КАК Отменена
		|ИЗ
		|	РегистрСведений.СоответствиеИндивидуальныхЦенЦенамУслугРаскроя.СрезПоследних(
		|			&Дата,
		|			Валюта = &Валюта
		|				И ВидНоменклатуры = &ВидНоменклатуры
		|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК СоответствиеИндивидуальныхЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеВидовЦенЦенамУслугРаскроя.СрезПоследних(&Дата, Валюта = &Валюта И ВидНоменклатуры = &ВидНоменклатуры) КАК СоответствиеВидовЦен
		|		ПО (СоответствиеВидовЦен.ВидЦен = СоответствиеИндивидуальныхЦен.ВидЦеныНаУслугиПроизводства)";
		
		Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
		Запрос.УстановитьПараметр("Валюта", Валюта);
		Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если НЕ Выборка.Отменена Тогда
				Результат = Выборка.ЦеныУслугРаскроя;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦен(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено,
									   Знач ВидЦенНастройкаИнтеркампани = Неопределено, Знач ДоговорКонтрагента = Неопределено,
									   Знач ТабличнаяЧасть, Знач КоличествоУслуги)
	
	Если Дата = Дата(1,1,1) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ДоговорКонтрагента = Неопределено Тогда
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	ОсновнаяВалютаПересчетаЦены = Константы.ОсновнаяВалютаПересчетаЦены.Получить();
	
	//#5610
	НулевыеЦены = Ложь;
	Если ЗначениеЗаполнено(ВидЦенНастройкаИнтеркампани) И ТипЗнч(ВидЦенНастройкаИнтеркампани) = Тип("СправочникСсылка.НастройкиИнтеркампани") Тогда
		Если ВидЦенНастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
			НулевыеЦены = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	//ЦеныУслугРаскроя = ПолучитьВидЦенНаУслугиПроизводства(ВидОперации, ВидЦенНастройкаИнтеркампани, Дата, Валюта, ДоговорКонтрагента);
	//
	//ПересчитыватьВВалютуПараметра = Ложь;
	//Если ЦеныУслугРаскроя = Справочники.ЦеныУслугРаскроя.ПустаяСсылка()
	//	И (Валюта = ВалютаУчета)
	//	И (НЕ Валюта = ОсновнаяВалютаПересчетаЦены) Тогда
	//	ЦеныУслугРаскроя = ПолучитьВидЦенНаУслугиПроизводства(ВидОперации, ВидЦенНастройкаИнтеркампани, Дата, ОсновнаяВалютаПересчетаЦены, ДоговорКонтрагента);
	//	ПересчитыватьВВалютуПараметра = Истина;
	//КонецЕсли;
	
	ПересчитыватьВВалютуПараметра = Ложь;
	ЦеныУслугРаскроя = ПодобратьДокументЦенНаУслугиПроизводства(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента, ПересчитыватьВВалютуПараметра);
			
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Номенклатура");
	ТаблицаРезультата.Колонки.Добавить("Количество");
	ТаблицаРезультата.Колонки.Добавить("Цена");
	ТаблицаРезультата.Колонки.Добавить("КоличествоКВыработке", новый ОписаниеТипов("число"));
	
	//Проверим может установлен флаг не учитывать на всю ТЧ
	Если ЦеныУслугРаскроя["НеУчитывать" + ТабличнаяЧасть] Тогда
		Возврат ТаблицаРезультата;
	КонецЕсли;
	
	#Область ДоЗаявки11866
	//КоличествоБесплатнойУслуги = 0;
	//
	////определим количество бесплатных элементов, заданные в прайсе
	//Для Каждого ТекущаяСтрока Из ЦеныУслугРаскроя[ТабличнаяЧасть] Цикл
	//	
	//	//Проверка на флаг "Не учитывать"
	//	Если ТекущаяСтрока.НеУчитывать Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	
	//	Если ТекущаяСтрока.Цена = 0 Тогда
	//		
	//		БесплатнаяНоменклатура = ТекущаяСтрока.Номенклатура;
	//		
	//		НоваяСтрока = ТаблицаРезультата.Добавить();
	//		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
	//		
	//		Если КоличествоУслуги <= ТекущаяСтрока.КоличествоДо Тогда
	//			НоваяСтрока.Количество = КоличествоУслуги;
	//			КоличествоБесплатнойУслуги = КоличествоУслуги;
	//		Иначе
	//			НоваяСтрока.Количество = ТекущаяСтрока.КоличествоДо;
	//			КоличествоБесплатнойУслуги = ТекущаяСтрока.КоличествоДо;
	//		КонецЕсли;			
	//		
	//		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//	
	////теперь определим настройку стоимости услуги и её номенклатуру (по общему количеству услуги в заказе)
	//Если (КоличествоУслуги - КоличествоБесплатнойУслуги) > 0 Тогда
	//	Для Каждого ТекущаяСтрока Из ЦеныУслугРаскроя[ТабличнаяЧасть] Цикл
	//		Если ТекущаяСтрока.НеУчитывать Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		Если (КоличествоУслуги >= ТекущаяСтрока.КоличествоОт ) и (КоличествоУслуги <= ТекущаяСтрока.КоличествоДо) Тогда
	//			НоваяСтрока = ТаблицаРезультата.Добавить();
	//			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
	//			НоваяСтрока.Количество = КоличествоУслуги-КоличествоБесплатнойУслуги;
	//			ЦенаВПрайсе = ТекущаяСтрока.Цена;
	//			
	//			Если НулевыеЦены Тогда
	//				НоваяСтрока.Цена = 0;
	//			Иначе
	//				Если ПересчитыватьВВалютуПараметра Тогда
	//					НоваяСтрока.Цена = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ЦеныУслугРаскроя.Валюта, Валюта, Дата, ЦенаВПрайсе);
	//				Иначе
	//					НоваяСтрока.Цена = ЦенаВПрайсе;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	#КонецОбласти
	
	Если КоличествоУслуги = 0 Тогда
		Возврат ТаблицаРезультата;
	КонецЕсли;
	
	// #15959 
	УслугаОбработана = Ложь;
	
	// №12223 добавлен реквизит "Вариант оценки"
	Если ЦеныУслугРаскроя["ВариантОценки" + ТабличнаяЧасть] = Перечисления.ВариантыОценкиСтоимостиУслугПроизводства.РазбивкаУслугиНаЗаданныеДиапазоны Тогда // прежний вариант
	
		//#11866
		// определим настройку стоимости услуги и её номенклатуру (по общему количеству услуги в заказе)
		Для Каждого ТекущаяСтрока Из ЦеныУслугРаскроя[ТабличнаяЧасть] Цикл
			
			// #15959 здесь закомментировано, перенесено ниже
			//Если ТекущаяСтрока.НеУчитывать Тогда
			//	Продолжить;
			//КонецЕсли;
			
			КоличествоВхожденияВДиапазон = 0;
			Если (КоличествоУслуги >= ТекущаяСтрока.КоличествоОт) 
				И (КоличествоУслуги >= ТекущаяСтрока.КоличествоДо) 
				И (ТекущаяСтрока.КоличествоОт <= ТекущаяСтрока.КоличествоДо) Тогда
				КоличествоВхожденияВДиапазон = Мин(ТекущаяСтрока.КоличествоДо, ТекущаяСтрока.КоличествоДо - ТекущаяСтрока.КоличествоОт + 1);
				
			ИначеЕсли (КоличествоУслуги >= ТекущаяСтрока.КоличествоОт) 
				И (КоличествоУслуги < ТекущаяСтрока.КоличествоДо) 
				И (ТекущаяСтрока.КоличествоОт <= ТекущаяСтрока.КоличествоДо) Тогда
				КоличествоВхожденияВДиапазон = КоличествоУслуги - ТекущаяСтрока.КоличествоОт + ?(ТекущаяСтрока.КоличествоОт > 0, 1, 0);
			КонецЕсли;
			
			Если КоличествоВхожденияВДиапазон > 0 Тогда	
				
				//++ #15959
				УслугаОбработана = Истина;
				Если ТекущаяСтрока.НеУчитывать Тогда
					Продолжить;
				КонецЕсли;
			    //-- #15959
				
				НоваяСтрока = ТаблицаРезультата.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = КоличествоВхожденияВДиапазон;
				ЦенаВПрайсе = ТекущаяСтрока.Цена;
				
				Если НулевыеЦены Тогда
					НоваяСтрока.Цена = 0;
				Иначе
					Если ПересчитыватьВВалютуПараметра Тогда
						НоваяСтрока.Цена = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ЦеныУслугРаскроя.Валюта, Валюта, Дата, ЦенаВПрайсе);
					Иначе
						НоваяСтрока.Цена = ЦенаВПрайсе;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		// новый вариант "Оценка по каждому заданному диапазону", добавляем каждую услугу которая подходит по диапазону с соответствуюшей ценой и номенклатурой
		Для Каждого ТекущаяСтрока Из ЦеныУслугРаскроя[ТабличнаяЧасть] Цикл
			
			// #15959 здесь закомментировано, перенесено ниже
			//Если ТекущаяСтрока.НеУчитывать Тогда
			//	Продолжить;
			//КонецЕсли;
			
			Если (КоличествоУслуги >= ТекущаяСтрока.КоличествоОт) И (КоличествоУслуги <= ТекущаяСтрока.КоличествоДо) Тогда
				
				//++ #15959
				УслугаОбработана = Истина;
				Если ТекущаяСтрока.НеУчитывать Тогда
					Продолжить;
				КонецЕсли;
			    //-- #15959
				
				НоваяСтрока = ТаблицаРезультата.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = КоличествоУслуги;
				ЦенаВПрайсе = ТекущаяСтрока.Цена;
				
				Если НулевыеЦены Тогда
					НоваяСтрока.Цена = 0;
				Иначе
					Если ПересчитыватьВВалютуПараметра Тогда
						НоваяСтрока.Цена = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ЦеныУслугРаскроя.Валюта, Валюта, Дата, ЦенаВПрайсе);
					Иначе
						НоваяСтрока.Цена = ЦенаВПрайсе;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	//++ №14059 комментируем
	// #15959 раскомментировано
	//проверим, для всех ли элементов нашлись настройки, если нет - добавим пустую номенклатуру
	Если НЕ УслугаОбработана И ТаблицаРезультата.Итог("Количество") < КоличествоУслуги Тогда
		НоваяСтрока = ТаблицаРезультата.Добавить();
		НоваяСтрока.Количество = КоличествоУслуги - ТаблицаРезультата.Итог("Количество");
	КонецЕсли;
	//-- №14059 комментируем
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенУглов(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено, 
											Знач ВидЦенНастройкаИнтеркампани = Неопределено, Знач ДоговорКонтрагента = Неопределено,
											Знач КоличествоУслуги) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента, "Углы", КоличествоУслуги);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенКривых(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено, 
											 Знач ВидЦенНастройкаИнтеркампани, Знач ДоговорКонтрагента = Неопределено,
											 Знач КоличествоУслуги) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента, "Кривые", КоличествоУслуги);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенВнутренниеВырезы(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено, 
													   Знач ВидЦенНастройкаИнтеркампани = Неопределено, Знач ДоговорКонтрагента = Неопределено,
													   Знач КоличествоУслуги) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента, "ВнутренниеВырезы", КоличествоУслуги);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенВырезыApply(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено, 
												  Знач ВидЦенНастройкаИнтеркампани = Неопределено, Знач ДоговорКонтрагента = Неопределено,
												  Знач КоличествоУслуги) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента, "ВырезыApply", КоличествоУслуги);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенФотопечать(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено, 
												 Знач ВидЦенНастройкаИнтеркампани = Неопределено, Знач ДоговорКонтрагента = Неопределено,
												 Знач КоличествоУслуги) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента, "Фотопечать", КоличествоУслуги);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенДлинаШвов(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено, 
												Знач ВидЦенНастройкаИнтеркампани = Неопределено, Знач ДоговорКонтрагента = Неопределено,
												Знач КоличествоУслуги) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента, "ДлинаШвов", КоличествоУслуги);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенДлинаПользовательскихШвов(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено,
	                                                            Знач ВидЦенНастройкаИнтеркампани = Неопределено, Знач ДоговорКонтрагента = Неопределено,
																Знач КоличествоУслуги) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента, "ДлинаПользовательскихШвов", КоличествоУслуги);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенДлинаШвовМногофактурный(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено,
															  Знач ВидЦенНастройкаИнтеркампани = Неопределено, Знач ДоговорКонтрагента = Неопределено,
															  Знач КоличествоУслуги) Экспорт
															  
	Возврат ПолучитьТаблицуНоменклатурИЦен(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента, "ДлинаШвовМногофактурный", КоличествоУслуги);
	
КонецФункции

Функция ПолучитьДанныеУслугиЦентровкиШва(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено, 
										 Знач ВидЦенНастройкаИнтеркампани = Неопределено, Знач ДоговорКонтрагента = Неопределено) Экспорт
	
	Если Дата = Дата(1,1,1) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Валюта = Неопределено Тогда
		Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	
	ПересчитыватьВВалютуПараметра = Ложь;
	ЦеныУслугРаскроя = ПодобратьДокументЦенНаУслугиПроизводства(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани, ДоговорКонтрагента, ПересчитыватьВВалютуПараметра);
	
	Если ЗначениеЗаполнено(ЦеныУслугРаскроя) Тогда
		РеквизитыЦентровки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЦеныУслугРаскроя, "НоменклатураУслугиЦентровкиШва, СтоимостьУслугиЦентровкиШва, СтоимостьЦентровкиШваНеВключаетСтоимостьУслуг");
	Иначе
		РеквизитыЦентровки = Новый Структура("НоменклатураУслугиЦентровкиШва, СтоимостьУслугиЦентровкиШва, СтоимостьЦентровкиШваНеВключаетСтоимостьУслуг",
											  Справочники.Номенклатура.ПустаяСсылка(), 0, Ложь);
	КонецЕсли;
	Возврат РеквизитыЦентровки;
	
КонецФункции

Функция ПолучитьЦенуНоменклатурыУслугиРаскроя(Знач Дата, Знач Валюта, Знач ВидНоменклатуры, Знач ВидОперации = Неопределено, 
											  Знач ВидЦенНастройкаИнтеркампани = Неопределено, Знач Номенклатура) Экспорт
	
	Если Дата = Дата(1,1,1) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Валюта = Неопределено Тогда
		Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	
	Цена = 0;
	ВидЦен = ПолучитьВидЦенНаУслугиПроизводства(Дата, Валюта, ВидНоменклатуры, ВидОперации, ВидЦенНастройкаИнтеркампани);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныУслугРаскрояУглы.Номенклатура,
	|	ЦеныУслугРаскрояУглы.Цена
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя.Углы КАК ЦеныУслугРаскрояУглы
	|ГДЕ
	|	ЦеныУслугРаскрояУглы.Номенклатура = &Номенклатура
	|	И ЦеныУслугРаскрояУглы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныУслугРаскрояВырезыApply.Номенклатура,
	|	ЦеныУслугРаскрояВырезыApply.Цена
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя.ВырезыApply КАК ЦеныУслугРаскрояВырезыApply
	|ГДЕ
	|	ЦеныУслугРаскрояВырезыApply.Ссылка = &Ссылка
	|	И ЦеныУслугРаскрояВырезыApply.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныУслугРаскрояФотопечать.Номенклатура,
	|	ЦеныУслугРаскрояФотопечать.Цена
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя.Фотопечать КАК ЦеныУслугРаскрояФотопечать
	|ГДЕ
	|	ЦеныУслугРаскрояФотопечать.Ссылка = &Ссылка
	|	И ЦеныУслугРаскрояФотопечать.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныУслугРаскрояДлинаШвов.Номенклатура,
	|	ЦеныУслугРаскрояДлинаШвов.Цена
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя.ДлинаШвов КАК ЦеныУслугРаскрояДлинаШвов
	|ГДЕ
	|	ЦеныУслугРаскрояДлинаШвов.Ссылка = &Ссылка
	|	И ЦеныУслугРаскрояДлинаШвов.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныУслугРаскрояДлинаПользовательскихШвов.Номенклатура,
	|	ЦеныУслугРаскрояДлинаПользовательскихШвов.Цена
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя.ДлинаПользовательскихШвов КАК ЦеныУслугРаскрояДлинаПользовательскихШвов
	|ГДЕ
	|	ЦеныУслугРаскрояДлинаПользовательскихШвов.Ссылка = &Ссылка
	|	И ЦеныУслугРаскрояДлинаПользовательскихШвов.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныУслугРаскрояВнутренниеВырезы.Номенклатура,
	|	ЦеныУслугРаскрояВнутренниеВырезы.Цена
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя.ВнутренниеВырезы КАК ЦеныУслугРаскрояВнутренниеВырезы
	|ГДЕ
	|	ЦеныУслугРаскрояВнутренниеВырезы.Ссылка = &Ссылка
	|	И ЦеныУслугРаскрояВнутренниеВырезы.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныУслугРаскрояКривые.Номенклатура,
	|	ЦеныУслугРаскрояКривые.Цена
	|ИЗ
	|	Справочник.ЦеныУслугРаскроя.Кривые КАК ЦеныУслугРаскрояКривые
	|ГДЕ
	|	ЦеныУслугРаскрояКривые.Ссылка = &Ссылка
	|	И ЦеныУслугРаскрояКривые.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Ссылка",ВидЦен);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Цена = Выборка.Цена;
	КонецЦикла;
	
	Возврат Цена;
	
КонецФункции

	