#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Валюта = ПолучитьФункциональнуюОпцию("ВалютаУчета");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЦеныУслугРаскроя") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, "Код, Родитель, Владелец, 
																|Углы, ВырезыApply, Фотопечать, ДлинаШвов, ДлинаПользовательскихШвов, ВнутренниеВырезы, Кривые, ДлинаШвовМногофактурный");
		
		Для каждого ТабличнаяЧасть из Метаданные.Справочники.ЦеныУслугРаскроя.ТабличныеЧасти Цикл
			ИмяТЧ = ТабличнаяЧасть.Имя;
			ЭтотОбъект[ИмяТЧ].Очистить();
			Для каждого СтрокаТЧ из  ДанныеЗаполнения[ИмяТЧ] Цикл
				НоваяСтрока = ЭтотОбъект[ИмяТЧ].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ВидОперации = Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидЦен"));
	КонецЕсли;
	Если НЕ ВидОперации = Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоИнтеркампани Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НастройкаИнтеркампани"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ВидОперации = Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен Тогда
		ВидЦен = Справочники.ВидыЦен.ПустаяСсылка();
	КонецЕсли;	
	Если ВидОперации = Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоИнтеркампани Тогда
		// #5610 очистим цены для Интеркампани, где  ОднаОрганизацияПроизводстваИПродажиПотолков
		// пока убрано (в рамках той же заявки)
		//Если НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда 
		//	Для каждого ТабличнаяЧасть из Метаданные.Справочники.ЦеныУслугРаскроя.ТабличныеЧасти Цикл
		//		Если ТабличнаяЧасть.Реквизиты.Найти("Цена") <> Неопределено Тогда
		//			Для каждого СтрокаТЧ из ЭтотОбъект[ТабличнаяЧасть.Имя] Цикл
		//				СтрокаТЧ.Цена = 0;
		//			КонецЦикла;
		//		КонецЕсли;
		//	КонецЦикла;
		//	СтоимостьУслугиЦентровкиШва = 0;
		//	СтоимостьЦентровкиШваНеВключаетСтоимостьУслуг = Ложь;
		//КонецЕсли;
	КонецЕсли;
	Если НЕ ВидОперации = Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоИнтеркампани Тогда 
		НастройкаИнтеркампани = Справочники.НастройкиИнтеркампани.ПустаяСсылка();
	КонецЕсли;
	
	//#11866
	ОбщийМодульСервер.ПроверитьПересечениеИнтерваловВЦенахНаУслугиПроизводства(ЭтотОбъект, Метаданные.Справочники.ЦеныУслугРаскроя, Отказ);
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
