
#Область ПеременныеФормы

&НаКлиенте
Перем мПредыдущийИдентификатор;

&НаКлиенте
Перем мПрерыдущееКоличество, мПредыдущееКоличествоКВыработке; // №14311

&НаКлиенте
Перем мНоменклатура;

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВключитьПредпросмотрФайлов = НЕ Константы.ВыключитьПредпросмотрПрикрепленныхФайловВДокументах.Получить();
	Элементы.ГруппаФайлыПредпросмотр.Видимость = ВключитьПредпросмотрФайлов;
	
	СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции = Константы.СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции.Получить();
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.ВидЗаказа = Параметры.ВидЗаказа;
		Если Объект.ВидЗаказа.Пустая() Тогда
			Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство;
		КонецЕсли;
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);

	//Если ПравоДоступа("Добавление", Метаданные.Документы.ВозвратПродукции)
	//	И Элементы.ПодменюСоздатьНаОсновании.ПодчиненныеЭлементы.Количество() > 5 Тогда
	//	Элементы.Переместить(Элементы.ФормаОформитьВыпускПродукции, Элементы.ПодменюСоздатьНаОсновании, Элементы.ПодменюСоздатьНаОсновании.ПодчиненныеЭлементы[5]);
	//КонецЕсли;
	
	//++ №6687 теперь способ определяется в документе
	//Если Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить() Тогда
	//Если Объект.СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации Тогда
	////-- №6687
	//	Элементы.ГруппаИсполнителиПоОперациям.Видимость = Истина;
	//	Элементы.ГруппаИсполнители.Видимость = Ложь;
	//Иначе
	//	Элементы.ГруппаИсполнителиПоОперациям.Видимость = Ложь;
	//	Элементы.ГруппаИсполнители.Видимость = Истина;
	//КонецЕсли;
	
	Если НЕ Константы.ИспользоватьПроизводственныеБригады.Получить() Тогда
		Элементы.Бригада.Видимость = Ложь;
	КонецЕсли;
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ДополнительныеПраваЗапретРедактированияЦенВДокументах, 
																	|ДополнительныеПраваЗапретПримененияСкидок,
																	|РазрешеноРедактироватьПроизведенныеЗаказыНаПроизводство,
																	|РазрешеноМенятьСпособНачисленияВыработкиВДокументеЗаказНаПроизводство");

	// №6687
	Элементы.СпособНачисленияВыработки.Доступность = РеквизитыПользователя.РазрешеноМенятьСпособНачисленияВыработкиВДокументеЗаказНаПроизводство;
	
	
	РазрешеноРедактироватьПроизведенныеЗаказыНаПроизводство = РеквизитыПользователя.РазрешеноРедактироватьПроизведенныеЗаказыНаПроизводство;
	
	ОбновитьДанныеДокумента();
	ОбновитьВидимостьЭлементов();
	ОбновитьСписокФайлов();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоПродукции();
	ЗаполнитьДанныеОстаткиПоМатериалам();
	
	//управление доступностью элементов
	Если РеквизитыПользователя.ДополнительныеПраваЗапретРедактированияЦенВДокументах Тогда
		МассивИменЭлементов = Документы.ЗаказНаПроизводство.ПолучитьМассивРеквизитовПоЦенам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
	//#7771
	Если РеквизитыПользователя.ДополнительныеПраваЗапретПримененияСкидок Тогда
		МассивИменЭлементов = Документы.ЗаказНаПроизводство.ПолучитьМассивРеквизитовПоСкидкам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
		
	ИсходныйСтатус = Объект.ТекущийСтатус;
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	ПродукцияНоменклатураКоличествоПредыдущееЗначение = Объект.ПродукцияНоменклатураКоличество;
	
	ОбновитьДоступностьНастройкиОтгрузкаРазрешена();
	
	Если Объект.Проведен Тогда
		ЭтаФорма.ИспользоватьРежимПроведения=ИспользованиеРежимаПроведения.Неоперативный;
	КонецЕсли;
	
	ОснованиеЗаказПокупателя = ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя");
	//Элементы.ФормаПечатьЗаказаПокупателя.Видимость  = ОснованиеЗаказПокупателя;
	Элементы.ГруппаТоварыЗаказаПокупателя.Видимость = ОснованиеЗаказПокупателя;
	// #15716 Динамический список в Таблицу значений
	//ТоварыЗаказаПокупателя.Параметры.УстановитьЗначениеПараметра("СсылкаНаЗаказПокупателя", ?(ОснованиеЗаказПокупателя, Объект.ДокументОснование, Документы.ЗаказПокупателя.ПустаяСсылка()));
	ОбщийМодульСервер.ЗаполнитьТоварыЗаказаПокупателя(ТоварыЗаказаПокупателя, Объект.ДокументОснование);
	
	//Начало добавлен при переходе на 2.0
	//Приведем реквизит ДокументОснование к типу для выбора Заказ Покупателя	
	ОписаниеТипов = новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя");	
	
	Элементы.ДокументОснование.ОграничениеТипа = ОписаниеТипов;	
	Элементы.ДокументОснование.ОграничениеТипа.ПривестиЗначение(Элементы.ДокументОснование);
	//Конец добавлен при переходе на 2.0
	
	УстановитьВидимостьПоИнтеркампаниИВнутреннемуЗаказу();
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("ПродукцияНоменклатураАртикул");
	МассивЭлементов.Добавить("УслугиНоменклатураАртикул");
	МассивЭлементов.Добавить("МатериалыНоменклатураАртикул");
	МассивЭлементов.Добавить("ТоварыНоменклатураАртикул");
	//МассивЭлементов.Добавить("ТоварыЗаказаПокупателяНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
	//Если Документы.ЗаказНаПроизводство.ЕстьВыпускПоЗаказу(Объект.Ссылка) Тогда
	Если Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Произведен")
		И НЕ РазрешеноРедактироватьПроизведенныеЗаказыНаПроизводство Тогда
		//ЕстьВыпускПоЗаказу = Истина;
		ПеревестиФормуВТолькоПросмотр(Истина);
		//Сообщить("По документу имеется проведенный выпуск продукции, документ находится в режиме просмотра");
		Сообщить("Документ в статусе ""Произведен"": находится в режиме просмотра");
	КонецЕсли;
	
	// №6283 видимость колонок и расчет процента в ТЧ ИсполнителиПоОперациям
	ОбщийМодульСервер.УстановитьВидимостьКолонокВТабличнойЧастиИсполнителиПоОперациям(ЭтаФорма);
	ПересчитатьПроцентУчастияИсполнителейПоОперациям();
	ПересчитатьПроцентУчастияКТУИсполнителей();
	
	ВидСпецификацииПоУмолчанию = Перечисления.ВидыСпецификации.СпецификацияПродукции;
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	ВремРучнаяКорректировкаМатериалов = Объект.РучнаяКорректировкаМатериалов; // №14311
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидЗаказаПриИзмененииНаСервере();
	ОповеститьОбИзменении(Объект.ПродукцияНоменклатура);
	ОбновитьДанныеДокумента();
	
	//проверка соответствия заказа на производство заказу покупателя, если он указан в основании
	Если НЕ Объект.Ссылка.Пустая() 
		И Объект.Проведен                                                                                       //#14923
		И НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Отменен") //#14923
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
		И НЕ Объект.ДокументОснование.Пустая()
		//#14923
		И ОбщийМодульВызовСервера.ЗаказНаПроизводствоСвязанСЗаказомПокупателя(Объект.Ссылка)
		Тогда
		
		ВыполнитьПроверкуСоответствияЗаказуПокупателя("ПриОткрытии");
		
	Иначе
		ЗаблокироватьОбъект();			
	КонецЕсли;
	
	ВывестиПотолокВТабличнойЧасти(); // №12232

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ЗаказНаПродажу
		ИЛИ Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.Перезаказ Тогда
		Объект.ПродукцияСумма = 0;
	КонецЕсли;
	
	ОбновитьДанныеДокумента();
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Объект.НесколькоТочекПроизводства И Объект.Цех.Пустая() Тогда
		Отказ = Истина;
		ТекстОшибки = НСтр("ru='Следует заполнить поле ""Цех""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, "Цех", , Отказ);
	КонецЕсли;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		//проверим сколько отгружено по заказу. Если отгружено больше чем заказано в заказе - отказываем в проведении (защита от удаления товаров из заказа после его отгрузки)
		//в регистре заказы покупателей получим все расходы где участвует данный заказ
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		ЗаказыПокупателейОбороты.Номенклатура,
		|		ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0) КАК Отгружено	
		|	ИЗ
		|		РегистрНакопления.ЗаказыПокупателей.Обороты(, , , ЗаказНаПроизводство = &ДокументЗаказ) КАК ЗаказыПокупателейОбороты";
		Запрос.УстановитьПараметр("ДокументЗаказ", Объект.Ссылка);
			
		//создадим временную таблицу куда поместим все товары, услуги, продукцию, потолкок
		Временная_ТЗ = новый ТаблицаЗначений;
		Временная_ТЗ.Колонки.Добавить("Номенклатура",,"Номенклатура");	
		Временная_ТЗ.Колонки.Добавить("Количество",,"Количество");
		
		//поместим товары
		Для Каждого ТекСтрока Из Объект.Товары Цикл
			НоваяСтрока = Временная_ТЗ.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
			НоваяСтрока.Количество = ТекСтрока.Количество * ТекСтрока.Коэффициент;
		КонецЦикла;	
		
		//поместим услуги
		Для Каждого ТекСтрока Из Объект.Услуги Цикл
			НоваяСтрока = Временная_ТЗ.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
			НоваяСтрока.Количество = ТекСтрока.Количество * ТекСтрока.Коэффициент;
		КонецЦикла;	
		
		//поместим продукцию
		Для Каждого ТекСтрока Из Объект.Продукция Цикл
			НоваяСтрока = Временная_ТЗ.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
			НоваяСтрока.Количество = ТекСтрока.Количество * ТекСтрока.Коэффициент;
		КонецЦикла;
		
		//поместим потолок
		Если НЕ Объект.ПродукцияНоменклатура.Пустая() Тогда
			НоваяСтрока = Временная_ТЗ.Добавить();
			НоваяСтрока.Номенклатура = Объект.ПродукцияНоменклатура;
			НоваяСтрока.Количество = Объект.ПродукцияНоменклатураКоличество * Объект.ПродукцияНоменклатураКоэффициент;
		КонецЕсли;
		
		//свернем временную таблицу со всеми товарами, услугами, продукцией, потолками
		Временная_ТЗ.Свернуть("Номенклатура", "Количество");
		
		//теперь пройдемся по всем полученным расходным движениям и 
		//если количество расход больше текущего количества в заказе, отказ в проведении
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			//нужно найти номенлатуру во временной ТЗ
			СтруктураПоиска = новый Структура;
			СтруктураПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
			НайденноеЗначение = Временная_ТЗ.НайтиСтроки(СтруктураПоиска);
			
			Если НайденноеЗначение.Количество() = 0 Тогда
				//в расходе есть а в текущем заказе нет, отказ			
				Сообщить("По данному заказу номенклатуры """ + Выборка.Номенклатура + """ отгружено на " + Выборка.Отгружено + " ед. больше, чем заказано.");
				Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
					Отказ = Истина;
				КонецЕсли;			
			Иначе
				Перегруз = Выборка.Отгружено - НайденноеЗначение[0].Количество;
				Если Перегруз > 0 Тогда
					Сообщить("По данному заказу номенклатуры """ + Выборка.Номенклатура + """ отгружено на " + Перегруз + " ед. больше, чем заказано.");
					
					Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла; 
		
		Если Отказ Тогда
			Сообщить("Документ не проведен");
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	//++ №14311 контроль материалов в производстве по документу настройки
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
		И ЗначениеЗаполнено(Объект.ДокументОснование)
		И НЕ Объект.РучнаяКорректировкаМатериалов
	Тогда
		
		// из заказа покупателя, возьмем только те материалы, которые относятся к продукции ЗнП
		МассивПродукции = новый Массив;
		
		Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
			МассивПродукции.Добавить(Объект.ПродукцияНоменклатура);
		Иначе
			Для Каждого ТекущаяСтрока Из Объект.Продукция Цикл
				МассивПродукции.Добавить(ТекущаяСтрока.Номенклатура);
			КонецЦикла;
		КонецЕсли;
		
		МатериалыЗаказаПокупателя = Объект.ДокументОснование.Материалы.Выгрузить();
		МатериалыЗаказаПокупателя.Очистить();
		
		Для Каждого ТекущаяСтрока Из Объект.ДокументОснование.Материалы Цикл
			
			Если МассивПродукции.Найти(ТекущаяСтрока.Потолок) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = МатериалыЗаказаПокупателя.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
		КонецЦикла;
		
		ОбщийМодульСервер.ВыполнитьКонтрольМатериаловВПроизводстве(
			Объект.Дата,
			Объект.Организация,
			Объект.Материалы.Выгрузить(),
			МатериалыЗаказаПокупателя,
			Отказ,
			Перечисления.ВидыДокументовКонтроляМатериаловВПроизводстве.ЗаказНаПроизводство
		);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	//-- №14311
	
	// перенесено в модуль объекта
	////проверим, если нужно, количество запланированных на это время потолков
	//Если НЕ Объект.ОжидаемаяДатаОтгрузки = Дата(1,1,1)
	//	И НЕ Объект.ОжидаемоеВремяОтгрузки = Дата(1,1,1)
	//	И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
	//	
	//	//Начало изменен при переходе на 2.0
	//	//И (Объект.ТекущийСтатус = Справочники.СтатусыЗаказовНаПроизводство.Новый)
	//	И (Объект.ТекущийСтатус = Справочники.СтатусыЗаказовНаПроизводство.ВПроизводстве)
	//	//Конец изменен при переходе на 2.0
	//	
	//	//Начало исключен при переходе на 2.0
	//	//ИЛИ Объект.ТекущийСтатус = Справочники.СтатусыЗаказовНаПроизводство.Подтвержден)
	//	//Конец исключен при переходе на 2.0
	//	И Константы.КонтролироватьМаксимальноеКоличествоПотолковВЧасКОтгрузке.Получить() 
	//	Тогда
	//	
	//	МАКС_Количество = Константы.МаксимальноеКоличествоПотолковВЧасКОтгрузке.Получить();
	//	ОжидаемоеВремяОтгрузки_НАЧАЛО = 	Дата(1, 1, 1, Час(Объект.ОжидаемоеВремяОтгрузки), 0, 0);
	//	ОжидаемоеВремяОтгрузки_КОНЕЦ = 		Дата(1, 1, 1, Час(Объект.ОжидаемоеВремяОтгрузки), 59, 59);
	//	
	//	//узнаем количество потолков запланированное на эту дату и этот час
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	ЗаказНаПроизводство.Ссылка
	//	|ИЗ
	//	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	//	|ГДЕ
	//	|	ЗаказНаПроизводство.ОжидаемаяДатаОтгрузки >= &ОжидаемаяДатаОтгрузки
	//	|	И ЗаказНаПроизводство.ОжидаемаяДатаОтгрузки <= &ОжидаемаяДатаОтгрузки
	//	|	И ЗаказНаПроизводство.ОжидаемоеВремяОтгрузки >= &ОжидаемоеВремяОтгрузки_НАЧАЛО
	//	|	И ЗаказНаПроизводство.ОжидаемоеВремяОтгрузки <= &ОжидаемоеВремяОтгрузки_КОНЕЦ
	//	|	И ЗаказНаПроизводство.Проведен";
	//	Запрос.УстановитьПараметр("ОжидаемаяДатаОтгрузки",Объект.ОжидаемаяДатаОтгрузки);
	//	Запрос.УстановитьПараметр("ОжидаемоеВремяОтгрузки_НАЧАЛО",ОжидаемоеВремяОтгрузки_НАЧАЛО);
	//	Запрос.УстановитьПараметр("ОжидаемоеВремяОтгрузки_КОНЕЦ",ОжидаемоеВремяОтгрузки_КОНЕЦ);
	//	
	//	Количество = Запрос.Выполнить().Выбрать().Количество();
	//	
	//	Если Количество >= МАКС_Количество Тогда
	//		Отказ = Истина;
	//		Сообщить("Допустимое количество заказов к отгрузке в час = " + Формат(МАКС_Количество,"ЧГ=") + " шт. Уже запланировано " + Количество + ". Проведение отменено");
	//		Возврат;
	//	КонецЕсли;
	//	
	//КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанЗаказНаПроизводство",Объект.ДокументОснование,"ЗаказНаПроизводство");
	Оповестить("Запись_ЗаказНаПроизводство", Объект.Ссылка);
		
	ОбщийМодульКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//Начало изменен при переходе на 2.0
	//Отправка эл. письма происходит после создания выпуска + должна проверятся константа
	//
	//Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка
	//	ИЛИ Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
	//	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//		Если НЕ Объект.ТекущийСтатус = ИсходныйСтатус Тогда				
	//			Если Объект.ТекущийСтатус = Справочники.СтатусыЗаказовНаПроизводство.Подтвержден Тогда				
	//				СсылкаНаЭлектронноеПисьмо = Документы.ЗаказНаПроизводство.СформироватьЭлектронноеПисьмоКонтрагентуОПереводеВСтатусПодтвержден(Объект.Ссылка);									
	//				Если НЕ СсылкаНаЭлектронноеПисьмо.Пустая() Тогда
	//					РезультатОтправки = Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(СсылкаНаЭлектронноеПисьмо);
	//					Если НЕ ПустаяСтрока(РезультатОтправки) Тогда
	//						Сообщить("Ошибка отправки электронного письма контрагенту: " + РезультатОтправки);
	//					КонецЕсли;
	//				КонецЕсли;
	//				ИсходныйСтатус = Объект.ТекущийСтатус;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	
	Если Объект.Проведен Тогда
		ЭтаФорма.ИспользоватьРежимПроведения=ИспользованиеРежимаПроведения.Неоперативный;
	КонецЕсли;	
	
	//++ №6283
	ПересчитатьПроцентУчастияИсполнителейПоОперациям();
	ПересчитатьПроцентУчастияКТУИсполнителей();
	//-- №6283
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("ОбновитьАРМПроизводства",,"ЗаказНаПроизводство");
	
	Если Не ЗавершениеРаботы Тогда
		РазблокироватьОбъект(Объект.Ссылка, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатусЗаказаНаПроизводство" 
		И Параметр = Объект.Ссылка Тогда
		ЭтотОбъект.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ЗадатьВопросОПересчетеЦен();
	ВалютаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	СкладПриИзмененииНаСервере();
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНаСервере()
	Если НЕ Константы.СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции.Получить() Тогда
		Объект.СкладОтгрузки = Объект.Склад;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладОтгрузкиПриИзменении(Элемент)
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	УстановитьВидЦенНаОснованииДоговора();
	УстановитьСкидкиНаОснованииДоговора();
	ЗадатьВопросОПересчетеЦен();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	УстановитьВидЦенНаОснованииДоговора();
	УстановитьСкидкиНаОснованииДоговора();
	ЗадатьВопросОПересчетеЦен();
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаПриИзменении(Элемент)
	
	ВидЗаказаПриИзмененииНаСервере();
	ОбновитьДанныеДокумента();
	ОбновитьВидимостьЭлементов();
	ВывестиПотолокВТабличнойЧасти(); // №12232
	
КонецПроцедуры

&НаСервере
Процедура ВидЗаказаПриИзмененииНаСервере()
	
	Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ЗаказНаПродажу
		или Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство 
			или Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.Перезаказ Тогда
			
		Объект.ПродукцияЦена = 0;
		Объект.ПродукцияСуммаРучнойСкидки = 0;
		Объект.ПродукцияПроцентРучнойСкидки = 0;
		Объект.ПродукцияСумма = 0;
		
	КонецЕсли;
	
	Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
		
		// №14311 комментируем, т.к. разрешаем редактировать
		//++ №13770 комментируем / снимаем
		//Если НЕ Объект.ДокументОснование = Неопределено И НЕ Объект.ДокументОснование.Пустая() Тогда
		//	Элементы.Материалы.ТолькоПросмотр = Истина;
		//	Элементы.МатериалыГруппаКнопок.Видимость = Ложь;
		//Иначе
		//	//заказ на типовое производство, не привязанный к основанию
		//	Элементы.Материалы.ТолькоПросмотр = Ложь;
		//	Элементы.МатериалыГруппаКнопок.Видимость = Истина;
		//КонецЕсли;
		//-- №13770 комментируем
		
	Иначе
		
		//++ №13770 комментируем
		//Элементы.Материалы.ТолькоПросмотр = Истина;
		//Элементы.МатериалыГруппаКнопок.Видимость = Ложь;
		//-- №13770 комментируем
		
		Объект.Продукция.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = новый СписокЗначений;
	
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказовНаПроизводство.ТиповоеПроизводство"));
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСтатусПриИзменении(Элемент)
	
	Если Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Произведен") Тогда
		
		ПроцедураПослеВопросаОСозданииВыпускаПродукции = Новый ОписаниеОповещения("ПроцедураПослеВопросаОСозданииВыпускаПродукции", ЭтаФорма);
		ПоказатьВопрос(ПроцедураПослеВопросаОСозданииВыпускаПродукции, "Создать документ выпуска продукции?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцедураПослеВопросаОСозданииВыпускаПродукции(Результат, Параметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;	
	КонецЕсли;
	
	СозданиеНаОснованииПотолкиКлиент.ВыпускПродукцииСоздатьНаОснованииЗаказаНаПроизводство(Объект.Ссылка, Неопределено);
	
	//Если НЕ ЕстьДокументВыпускаПоЭтомуЗаказу() Тогда
	//	ПараметрыНовогоДокумента = Новый Структура;
	//	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
	//	ОткрытьФорму("Документ.ВыпускПродукции.Форма.ФормаДокумента", ПараметрыНовогоДокумента);
	//Иначе
	//	Состояние("По данному заказу уже оформлялся выпуск. Оформление второго выпуска не возможно.");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Если Модифицированность Тогда
		//Состояние("Сменить статус можно только после записи документа. Запишите документ");
		ПоказатьОповещениеПользователя(" Запишите документ", , "Сменить статус можно только после записи документа");
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = ПолучитьСписокДоступныхСтатусов(Объект.ТекущийСтатус);
	
КонецПроцедуры

//++ №14311

&НаКлиенте
Процедура РучнаяКорректировкаМатериаловПриИзменении(Элемент)
	
	// При ручном снятии галочки давать предупреждение о том, что материалы будут полностью перезаполнены по ЗП
	//	- если пользователь согласился, то снимать галочку и полностью перезаполнять ТЧ материалы
	//	- если пользователь отказался, то галочку оставлять установленной
	Если ВремРучнаяКорректировкаМатериалов
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
		И ЗначениеЗаполнено(Объект.ДокументОснование)
	Тогда
		
		ОписаниеОповещения = новый ОписаниеОповещения("ПоказатьВопросОПерезаполненииМатериаловПоЗаказуПокупателя", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Табличная часть ""Материалы"" будет полностью перезаполнена по заказу покупателя, продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВремРучнаяКорректировкаМатериалов = Объект.РучнаяКорректировкаМатериалов;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОПерезаполненииМатериаловПоЗаказуПокупателя(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПерезаполнитьМатериалыПоЗаказуПокупателя();
	Иначе
		Объект.РучнаяКорректировкаМатериалов = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОПересчетеКоличестваКВыработке(СтрокаТабличнойЧасти)
	
	// Если предыдущие значения "К выработке" <> "Количество" и "К выработке" <> 0, то после изменения "Количество" предлагать "К выработке" предыдущее значение
	Если НЕ мПрерыдущееКоличество = Неопределено
		И НЕ мПредыдущееКоличествоКВыработке = Неопределено
		И мПрерыдущееКоличество > 0
		И мПредыдущееКоличествоКВыработке > 0
		И НЕ мПрерыдущееКоличество = мПредыдущееКоличествоКВыработке Тогда
		
		КоличествоКВыработке = мПредыдущееКоличествоКВыработке;
		
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВводаЗначенияКоличествоКВыработке", ЭтотОбъект, Новый Структура("ИдТекущейСтроки", СтрокаТабличнойЧасти.ПолучитьИдентификатор()));
		ПоказатьВводЧисла(ОписаниеОповещения, КоличествоКВыработке, "Подтвердите значение ""К выработке"".", 15, 2);
		
	Иначе
		
		СтрокаТабличнойЧасти.КоличествоКВыработке = СтрокаТабличнойЧасти.Количество;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияКоличествоКВыработке(Значение, ДополнительныеПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Материалы.ТекущаяСтрока = ДополнительныеПараметры.ИдТекущейСтроки;
	
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	
	ТекущаяСтрока.КоличествоКВыработке = Значение;
	
КонецПроцедуры
//-- №14311

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщийМодульКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщийМодульКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщийМодульКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

//++ №13833
&НаКлиенте
Процедура ОтправитьВсеВложенныеФайлыНаПринтер(Команда)
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОЗаписиДокументаПриОтправкеВсехФайловНаПринтер", ЭтаФорма);
		
		ПоказатьВопрос(Оповещение, "Для продолжения необходимо записать документ, продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОбщийМодульКлиент.ОтправитьВсеВложенныеФайлыЗаказаНаПроизводствоНаПринтер(Объект.Ссылка, ЭтотОбъект.УникальныйИдентификатор);
		
		УстановитьГалочкуНачалиПроизводство();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОЗаписиДокументаПриОтправкеВсехФайловНаПринтер(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Записать() Тогда
	
		ОбщийМодульКлиент.ОтправитьВсеВложенныеФайлыЗаказаНаПроизводствоНаПринтер(Объект.Ссылка, ЭтотОбъект.УникальныйИдентификатор);
		
		УстановитьГалочкуНачалиПроизводство();
		
	КонецЕсли;
	
КонецПроцедуры
//-- №13833

//++ №14862
&НаКлиенте
Процедура ЗагрузитьМатериалыИзПостроителя(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПродукцияНоменклатура) Тогда
		ПоказатьПредупреждение(, "Не указана продукция.");
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала() тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = новый ОписаниеОповещения("ЗагрузитьМатериалыИзПостроителяФрагмент", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Обновить файлы макетов к потолку?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМатериалыИзПостроителяФрагмент(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьМатериалыИзПостроителяПослеВыбораФайлов", ЭтотОбъект, новый Структура("ОбновитьФайлыМакетов", (Ответ = КодВозвратаДиалога.Да)));	
	ОбщийМодульКлиент.ВыборФайловПостроителя(ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМатериалыИзПостроителяПослеВыбораФайлов(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранноеИмяФайла = ВыбранныеФайлы[0];
	
	СписокПутейКФайламКУдалению = Новый СписокЗначений;
	СписокДвоичныхДанныхФайлов = Новый СписокЗначений;
	
	СтруктураФайла = ОбменСПостроителемКлиентСервер.ПрочитатьФайлПостроителя(ВыбранноеИмяФайла);	
	ОбменСПостроителемКлиентСервер.СформироватьСписокПутейКФайлам(СтруктураФайла, СписокПутейКФайламКУдалению, СписокДвоичныхДанныхФайлов);
	
	Если ЗагрузитьМатериалыИзПостроителяНаСервере(СтруктураФайла, СписокДвоичныхДанныхФайлов, ДополнительныеПараметры.ОбновитьФайлыМакетов) Тогда
		
		Состояние("Данные загружены.");
		Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗагрузитьМатериалыИзПостроителяНаСервере(СтруктураФайла, СписокДвоичныхДанныхФайлов, ОбновитьФайлыМакетов)
	
	// Получаем исходную структуру потолка по данным файла импорта
	СтруктураИсходная = ПолучитьСтруктуруТекущегоПотолкаПоДаннымИмпорта();
	
	Если СтруктураИсходная = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Получаем новую структуру потолка по выбранному файлу потолка
	СтруктураКонечная = ПолучитьСтруктуруПотолкаПоДаннымИмпорта(СтруктураФайла, СписокДвоичныхДанныхФайлов);
	
	Если СтруктураКонечная = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Сверяем структуры
	// Разрешается различие только реквизитов в фактурах по полям "Фактура", "Цвет" и "Количество расход"
	РазрешенныеРеквизиты = новый Массив;
	РазрешенныеРеквизиты.Добавить("МатериалМатериал");
	РазрешенныеРеквизиты.Добавить("МатериалЦвет");
	РазрешенныеРеквизиты.Добавить("ПродукцияФактура");
	РазрешенныеРеквизиты.Добавить("ПродукцияЦвет");
	РазрешенныеРеквизиты.Добавить("ШиринаПолотна");
	РазрешенныеРеквизиты.Добавить("КоличествоРасход");
	РазрешенныеРеквизиты.Добавить("ДанныеФайла");
	
	Различаются = Ложь;
	
	Для Каждого ИсходноеСвойство Из СтруктураИсходная Цикл
		
		Если ТипЗнч(ИсходноеСвойство.Значение) = Тип("Структура") Тогда
			
			// Свойство с типом "Структура"
			Для Каждого ИсходноеСвойствоСекции Из ИсходноеСвойство.Значение Цикл
				
				Если РазрешенныеРеквизиты.Найти(ИсходноеСвойствоСекции.Ключ) = Неопределено
					И Не ИсходноеСвойствоСекции.Значение = СтруктураКонечная[ИсходноеСвойство.Ключ][ИсходноеСвойствоСекции.Ключ] Тогда
					
					Различаются = Истина;
					Сообщить(СтрШаблон("Значение параметра ""%1"" потолка в секции ""%2"" отличается, в исходных данных ""%3"", в выбранном файле ""%4"".",
						ИсходноеСвойствоСекции.Ключ,
						ИсходноеСвойство.Ключ,
						ИсходноеСвойствоСекции.Значение,
						СтруктураКонечная[ИсходноеСвойство.Ключ][ИсходноеСвойствоСекции.Ключ]
					));
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ИсходноеСвойство.Значение) = Тип("Массив") Тогда
			
			// Свойство с типом "Массив"
			Если НЕ ИсходноеСвойство.Значение.Количество() = СтруктураКонечная[ИсходноеСвойство.Ключ].Количество() Тогда
				
				Сообщить(СтрШаблон("Количество фактур потолка отличается, в исходных данных ""%1"", в выбранном файле ""%2"".",
					ИсходноеСвойство.Значение.Количество(),
					СтруктураКонечная[ИсходноеСвойство.Ключ].Количество()
				));
				Продолжить;
				
			КонецЕсли;
			
			НомерСтроки = 0;
			Для Каждого СтрокаФактуры Из ИсходноеСвойство.Значение Цикл
				
				Для Каждого СвойствоФактурыИсходное Из СтрокаФактуры Цикл
					
					Если РазрешенныеРеквизиты.Найти(СвойствоФактурыИсходное.Ключ) = Неопределено
						И Не СвойствоФактурыИсходное.Значение = СтруктураКонечная[ИсходноеСвойство.Ключ][НомерСтроки][СвойствоФактурыИсходное.Ключ] Тогда
						
						Различаются = Истина;
						Сообщить(СтрШаблон("Значение параметра ""%1"" потолка в секции ""%2"" отличается, по номеру строки %3, в исходных данных ""%4"", в выбранном файле ""%5"".",
						СвойствоФактурыИсходное.Ключ,
						ИсходноеСвойство.Ключ,
						НомерСтроки + 1,
						СвойствоФактурыИсходное.Значение,
						СтруктураКонечная[ИсходноеСвойство.Ключ][НомерСтроки][СвойствоФактурыИсходное.Ключ]
						));
						
					КонецЕсли;
					
				КонецЦикла;
				
				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
			
		Иначе
			
			// Шапочные свойства
			Если РазрешенныеРеквизиты.Найти(ИсходноеСвойство.Ключ) = Неопределено
				И НЕ ИсходноеСвойство.Значение = СтруктураКонечная[ИсходноеСвойство.Ключ] Тогда
				
				Различаются = Истина;
				Сообщить(СтрШаблон("Значение параметра ""%1"" потолка отличается, в исходных данных ""%2"", в выбранном файле ""%3"".",
					ИсходноеСвойство.Ключ,
					ИсходноеСвойство.Значение,
					СтруктураКонечная[ИсходноеСвойство.Ключ]
				));
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Различаются Тогда
		
		Сообщить("Действие отменено.");
		Возврат Ложь;
		
	КонецЕсли;
	
	Объект.Материалы.Очистить();
	
	// Получаем структуру заказа, чтобы были отработаны расширенные правила
	ДанныеЗаказа = ОбменСEasyCeiling.СтруктураДанныхЗаказа(
		Объект.Организация,
		Объект.Подразделение,
		Объект.НастройкаИнтеркампани,
		Объект.ВидЦен,
		Объект.Валюта,
		?(Объект.Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Объект.Дата)
		,
		,
		,
		Объект.ДоговорКонтрагента,
		Объект.ВнутреннийЗаказ
	);
	
	// Структуру получаем как по заказу покупателя, чтобы расширенные правила отработали для этого документа
	// #14862 не так: получаем как дял заказа на производство 
	//СтруктураЗаказа = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураКонечная, Перечисления.ВидыЗаказов.ЗаказПокупателя, ДанныеЗаказа);
	СтруктураЗаказа = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураКонечная, Перечисления.ВидыЗаказов.ЗаказНаПроизводство, ДанныеЗаказа);
	
	Для Каждого СтрокаМатериалов Из СтруктураЗаказа.Материалы Цикл
		
		НоваяСтрока = Объект.Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМатериалов);
		
		НоваяСтрока.ЗагруженоИзПостроителя = Истина;
		НоваяСтрока.УИСтроки = Объект.ПродукцияУИСтроки;
		
	КонецЦикла;
	
	Объект.РучнаяКорректировкаМатериалов = Истина;
	
	// Обновляем файлы макетов, если пользователь согласился их обновлять
	Если ОбновитьФайлыМакетов Тогда
		
		МассивСообщений = новый Массив;
		
		ОбменСEasyCeiling.ЗагрузитьФайлыКПотолку(СтруктураКонечная, СписокДвоичныхДанныхФайлов, МассивСообщений);
		
		// Если есть сообщения с ошибками - выводим их
		Для Каждого ТекущаяСтрока Из МассивСообщений Цикл
			
			Если НЕ ТекущаяСтрока.ЭтоОшибка Тогда
				Продолжить;
			КонецЕсли;
				
			Сообщить(ТекущаяСтрока.ТекстСообщения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруПотолкаПоДаннымИмпорта(СтруктураФайла, СписокДвоичныхДанныхФайлов)
	
	СтруктураПотолка = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(СтруктураФайла, СписокДвоичныхДанныхФайлов, Объект.ПродукцияНоменклатура,,,,,,,, Истина);
	
	Если СтруктураПотолка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайтиИЗаполнитьФактурыПоДаннымИмпорта(СтруктураПотолка);
	
	Возврат СтруктураПотолка;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруТекущегоПотолкаПоДаннымИмпорта()
	
	ДанныеФайлаИмпорта = Объект.ПродукцияНоменклатура.Потолок_ДанныеФайлаИмпорта;
	
	Если Не ЗначениеЗаполнено(ДанныеФайлаИмпорта) Тогда
		
		Сообщить("В карточке продукции не указаны данные файла импорта.");
		Возврат Неопределено;
		
	КонецЕсли;
	
	ТипJson = СтрНайти(ДанныеФайлаИмпорта, "{") > 0 И СтрНайти(ДанныеФайлаИмпорта, "СписокЗаказов") > 0;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(?(ТипJson, ".json", ".ini"));
	
	ТекстФайл = Новый ТекстовыйДокумент;
	ТекстФайл.УстановитьТекст(ДанныеФайлаИмпорта);
	//ТекстФайл.Записать(ИмяВременногоФайла, ОбменСEasyCeiling.ФорматФайловПостроителя());
	ФорматФайловПостроителя = ОбменСEasyCeiling.ФорматФайловПостроителя();
	Если ПустаяСтрока(ФорматФайловПостроителя) Тогда
		ТекстФайл.Записать(ИмяВременногоФайла);
	Иначе
		ТекстФайл.Записать(ИмяВременногоФайла, ФорматФайловПостроителя);
	КонецЕсли;
	
	СтруктураФайла = ОбменСПостроителемКлиентСервер.ПрочитатьФайлПостроителя(ИмяВременногоФайла);

	СтруктураПотолка = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(СтруктураФайла,, Объект.ПродукцияНоменклатура,,,,,,,, Истина);
	
	Если СтруктураПотолка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайтиИЗаполнитьФактурыПоДаннымИмпорта(СтруктураПотолка);
	
	Возврат СтруктураПотолка;
	
КонецФункции

Процедура НайтиИЗаполнитьФактурыПоДаннымИмпорта(СтруктураПотолка)
	
	Для Каждого ТекущаяСтрока Из СтруктураПотолка.Фактуры Цикл
		
		ТекущаяСтрока.ПродукцияФактура = Справочники.Фактура.НайтиПоНаименованиюИШирине(СокрЛП(ТекущаяСтрока.МатериалМатериал), СокрЛП(ТекущаяСтрока.ШиринаПолотна));
		ТекущаяСтрока.ПродукцияЦвет = Справочники.ЦветФактуры.НайтиПоНаименованию(ТекущаяСтрока.МатериалЦвет, Истина, , ТекущаяСтрока.ПродукцияФактура);
		
	КонецЦикла;
	
КонецПроцедуры
//-- №14862

#КонецОбласти

#Область ОбработчикиСобытийВкладкиМатериалы

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	
	Объект.РучнаяКорректировкаМатериалов = Истина;
	ВремРучнаяКорректировкаМатериалов = Объект.РучнаяКорректировкаМатериалов;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	мНоменклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	мНоменклатура = ТекущиеДанные.Номенклатура;
		
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		
		мПрерыдущееКоличество = Элемент.ТекущиеДанные.Количество;
		мПредыдущееКоличествоКВыработке = Элемент.ТекущиеДанные.КоличествоКВыработке;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьДанныеДокумента();
	ЗаполнитьДанныеОстаткиПоМатериалам();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПослеУдаления(Элемент)
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	//СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьЕдиницуИзмеренияДляПроизводства(СтрокаТабличнойЧасти.Номенклатура);
	
	Если ЗначениеЗаполнено(мНоменклатура) И СтрокаТабличнойЧасти.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ОстаткиПленки") Тогда
		//#14457
		СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Коэффициент;
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе		
		Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			СтрокаТабличнойЧасти.Коэффициент = 1;
		ИначеЕсли ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
			СтрокаТабличнойЧасти.Коэффициент = ОбщийМодульВызовСервера.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	
	ЗадатьВопросОПересчетеКоличестваКВыработке(Элементы.Материалы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщийМодульКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	//ДополнительныеПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
	//		
	//Отказ = Истина;
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеПередЗаписью", ЭтотОбъект, ДополнительныеПараметры);
	//
	//ТекстВопроса = СтрШаблон("Изменения ранее %1 документа ""Установка стоимости выработки"" 
	//				|может привести к расхождениям в начислении выработки во всех документах, 
	//				|оформленных датой позднее текущего документа ""Установка стоимости выработки"". 
	//				|Продолжить?", ?(ОбщийМодульВызовСервера.ДокументПроведен(Объект.Ссылка), "проведенного", "непроведенного"));
	//ПоказатьВопрос(
	//	ОписаниеОповещения,
	//	ТекстВопроса,
	//	РежимДиалогаВопрос.ДаНет);
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	ДополнительныеПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
	
	Отказ = Ложь;
	
	//#14923 проверка соответствия заказа на производство заказу покупателя, если он указан в основании
	Если ЗначениеЗаполнено(Объект.Ссылка)                                                                                        
		И НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Отменен") 
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
		И НЕ Объект.ДокументОснование.Пустая()		
		И ОбщийМодульВызовСервера.ЗаказНаПроизводствоСвязанСЗаказомПокупателя(Объект.Ссылка)
		Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеПередЗаписью", ЭтотОбъект, ДополнительныеПараметры);
		ВыполнитьПроверкуСоответствияЗаказуПокупателя("ПередЗаписью", ОписаниеОповещения, Отказ);
		
	Иначе
		ДополнительныеПараметры.Вставить("Отказ", Отказ);
		ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗаписи,, Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПередЗаписью(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	
	Если ОтветНаВопрос = Истина Тогда
		РезультатОбработки = ОбновитьЗаказНаПроизводствоПоЗаказуПокупателя(Истина);
		Если РезультатОбработки Тогда
			//ЭтотОбъект.Прочитать();
			Отказ = Ложь;
		Иначе			
			Сообщить("Не удалось обновить заказ на производство по заказу покупателя");
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗаписи,, Истина);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверкуСоответствияЗаказуПокупателяСервер(Режим)
	
	Если Режим = "ПередЗаписью" Тогда
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");
		СтруктураПроверки = ОбщийМодуль.ЗаказНаПроизводствоСоответствуетЗаказуПокупателя(ТекущийОбъект, Объект.ДокументОснование);
	Иначе
	    СтруктураПроверки = ОбщийМодуль.ЗаказНаПроизводствоСоответствуетЗаказуПокупателя(Объект.Ссылка, Объект.ДокументОснование);
	КонецЕсли;
	
	Возврат СтруктураПроверки;
	
КонецФункции

// Процедура - Выполнить проверку соответствия заказу покупателя
//
// Параметры:
//  ИзменятьСвойствоТолькоПросмотр	- при открытии - Истина, перед записью - Ложь 
//  ОтложенныйВопрос	 			- при открытии - Истина, перед записью - Ложь
//
&НаКлиенте
Процедура ВыполнитьПроверкуСоответствияЗаказуПокупателя(Режим, ОписаниеОповещения = Неопределено, Отказ = Ложь)
	 
	ИзменятьСвойствоТолькоПросмотр = Истина;
	ОтложенныйВопрос = Истина;
	Если Режим = "ПередЗаписью" Тогда
		ИзменятьСвойствоТолькоПросмотр = Ложь;
		ОтложенныйВопрос = Ложь;	
	КонецЕсли;
	
	СтруктураПроверки = ВыполнитьПроверкуСоответствияЗаказуПокупателяСервер(Режим);
	 
	Если СтруктураПроверки.Результат Тогда
		// ошибок нет
		ЗаблокироватьОбъект();
		
	Иначе
		Отказ = Истина;
		
		//проверка соответствия заказа на производство потолка заказу покупателя, если он указан в основании
		Если Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка") Тогда	
			
			Если СтруктураПроверки.ЕстьПотолок Тогда
				
				ПараметрыФормыПросмотраРазличий = Новый Структура;
				ПараметрыФормыПросмотраРазличий.Вставить("МассивСравнения", СтруктураПроверки.МассивСравнения);
				
				ПараметрыФормыПросмотраРазличий.Вставить("Документ1", Объект.ДокументОснование);
				ПараметрыФормыПросмотраРазличий.Вставить("Документ2", Объект.Ссылка);
				ПараметрыФормыПросмотраРазличий.Вставить("МассивРазличийРеквизитов", СтруктураПроверки.МассивРазличийРеквизитов);
				ПараметрыФормыПросмотраРазличий.Вставить("ДоступноИзменениеПриНаличииВыпуска", СтруктураПроверки.ДоступноИзменениеПриНаличииВыпуска); //#13200
				ПараметрыФормыПросмотраРазличий.Вставить("ЕстьВыпуск", СтруктураПроверки.ЕстьВыпуск); //#13200
				//ПараметрыФормыПросмотраРазличий.Вставить("ТолькоПросмотр", ТолькоПросмотр); - вожможность перезаполнить должна быть и с проведенным выпуском
				ПараметрыФормыПросмотраРазличий.Вставить("ТолькоПросмотр", Ложь);
				
				Если ИзменятьСвойствоТолькоПросмотр Тогда
					Если НЕ ТолькоПросмотр Тогда
						// №14923 на просмотр переводим только если есть выпуск
						// по другому: учитываем наличие права пользователя
						//Если СтруктураПроверки.ЕстьВыпуск Тогда
						Если Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Произведен")
							И НЕ РазрешеноРедактироватьПроизведенныеЗаказыНаПроизводство Тогда
							ПеревестиФормуВТолькоПросмотр(Истина);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ТекстСообщения = ОбщийМодульКлиент.ТекстВопросаПерезаполненииЗаказаНаПроизводствоПоОснованию(СтруктураПроверки);
				ПараметрыФормыПросмотраРазличий.Вставить("ТекстСообщения",    ТекстСообщения);
				
				Если ОтложенныйВопрос Тогда
					ПодключитьОбработчикОжидания("ПоказатьВопросПриОткрытии", 0.3, Истина);					
				Иначе
					ОткрытьФорму("ОбщаяФорма.ПросмотрРазличийДокументов", ПараметрыФормыПросмотраРазличий, ЭтотОбъект,,,,ОписаниеОповещения);
				КонецЕсли;
			Иначе
				Сообщить("В заказе покупателя (основании) отсутствует данный потолок!");
			КонецЕсли;
		
		ИначеЕсли Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказовНаПроизводство.ТиповоеПроизводство") Тогда
		//проверка соответствия заказа на типовое производство заказу покупателя, если он указан в основании
					
			ПараметрыФормыПросмотраРазличий = Новый Структура;
			ПараметрыФормыПросмотраРазличий.Вставить("МассивСравнения", СтруктураПроверки.МассивСравнения);
			
			ПараметрыФормыПросмотраРазличий.Вставить("Документ1", Объект.ДокументОснование);
			ПараметрыФормыПросмотраРазличий.Вставить("Документ2", Объект.Ссылка);
			ПараметрыФормыПросмотраРазличий.Вставить("МассивРазличийРеквизитов", СтруктураПроверки.МассивРазличийРеквизитов);
			ПараметрыФормыПросмотраРазличий.Вставить("ДоступноИзменениеПриНаличииВыпуска", СтруктураПроверки.ДоступноИзменениеПриНаличииВыпуска); //#13200
			ПараметрыФормыПросмотраРазличий.Вставить("ЕстьВыпуск", СтруктураПроверки.ЕстьВыпуск); //#13200
			//ПараметрыФормыПросмотраРазличий.Вставить("ТолькоПросмотр", ТолькоПросмотр);  - вожможность перезаполнить должна быть и с проведенным выпуском
			ПараметрыФормыПросмотраРазличий.Вставить("ТолькоПросмотр", Ложь);
			
			Если ИзменятьСвойствоТолькоПросмотр Тогда
				Если НЕ ТолькоПросмотр Тогда
					// №14923 на просмотр переводим только если есть выпуск
					// по другому: учитываем наличие права пользователя
					//Если СтруктураПроверки.ЕстьВыпуск Тогда
					Если Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Произведен")
						И НЕ РазрешеноРедактироватьПроизведенныеЗаказыНаПроизводство Тогда
						ПеревестиФормуВТолькоПросмотр(Истина);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ТекстСообщения = ОбщийМодульКлиент.ТекстВопросаПерезаполненииЗаказаНаПроизводствоПоОснованию(СтруктураПроверки);
			
			ПараметрыФормыПросмотраРазличий.Вставить("ТекстСообщения",    ТекстСообщения);
			
			Если ОтложенныйВопрос Тогда
				ПодключитьОбработчикОжидания("ПоказатьВопросПриОткрытии", 0.3, Истина);					
			Иначе
				ОткрытьФорму("ОбщаяФорма.ПросмотрРазличийДокументов", ПараметрыФормыПросмотраРазличий, ЭтотОбъект,,,,ОписаниеОповещения);
			КонецЕсли;
				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьОбъект()
	
	Если НЕ ЭтаФорма.ТолькоПросмотр Тогда
		ОбщийМодульВызовСервера.ЗаблокироватьОбъектДляРедактирования(Объект.Ссылка, ЭтаФорма);
	КонецЕсли;
	
Конецпроцедуры
		
&НаСервереБезКонтекста
Процедура РазблокироватьОбъект(Знач Ссылка, Знач УникальныйИдентификатор)
	
	РазблокироватьДанныеДляРедактирования(Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидЦенНаОснованииДоговора()
	Если Объект.ДоговорКонтрагента.ВидЦен.Пустая() Тогда
		Объект.ВидЦен = ОбщийМодульСервер.НастройкаПользователя("ВидЦен");
	Иначе
		Объект.ВидЦен = Объект.ДоговорКонтрагента.ВидЦен;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСкидкиНаОснованииДоговора()
	Объект.СкидкаНаПотолки = Объект.ДоговорКонтрагента.СкидкаНаПотолки;
	Объект.СкидкаНаТовары = Объект.ДоговорКонтрагента.СкидкаНаТовары;
	Объект.СкидкаНаУслуги = Объект.ДоговорКонтрагента.СкидкаНаУслуги;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДоступныхСтатусов(ТекущийСтатус)
	
	Результат = Новый СписокЗначений;
	
	//Начало изменен при переходе на 2.0
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	СтатусыЗаказовНаПроизводствоДоступныеПоследующиеСтатусы.Статус КАК Статус
	//|ИЗ
	//|	Справочник.СтатусыЗаказовНаПроизводство.ДоступныеПоследующиеСтатусы КАК СтатусыЗаказовНаПроизводствоДоступныеПоследующиеСтатусы
	//|ГДЕ
	//|	СтатусыЗаказовНаПроизводствоДоступныеПоследующиеСтатусы.Ссылка = &Ссылка
	//|	И СтатусыЗаказовНаПроизводствоДоступныеПоследующиеСтатусы.Статус.ПометкаУдаления = ЛОЖЬ";
	//Запрос.УстановитьПараметр("Ссылка", ТекущийСтатус);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Результат.Добавить(Выборка.Статус);
	//КонецЦикла;
	Результат.Добавить(Справочники.СтатусыЗаказовНаПроизводство.ВПроизводстве);
	Результат.Добавить(Справочники.СтатусыЗаказовНаПроизводство.Произведен);
	Результат.Добавить(Справочники.СтатусыЗаказовНаПроизводство.Отменен);
	//Конец изменен при переходе на 2.0	
	
	Возврат Результат;
	
КонецФункции

//++ №13833
&НаСервере
Процедура УстановитьГалочкуНачалиПроизводство()
	
	Если НЕ Константы.АвтоматическиУстанавливатьГалочкуНачалиПроизводствоВДокументеЗаказНаПроизводство.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.НачалиПроизводство Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачалиПроизводство = Истина;
	
	Модифицированность = Истина;
	
КонецПроцедуры
//-- №13833

//++ №14311
&НаСервере
Процедура ПерезаполнитьМатериалыПоЗаказуПокупателя()
	
	Если НЕ ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат;
	КонецЕсли;
		
	Объект.Материалы.Очистить();
	
	МассивПродукции = новый Массив;
		
	Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
		МассивПродукции.Добавить(Объект.ПродукцияНоменклатура);
	Иначе
		Для Каждого ТекущаяСтрока Из Объект.Продукция Цикл
			МассивПродукции.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект.ДокументОснование.Материалы Цикл
		
		Если МассивПродукции.Найти(ТекущаяСтрока.Потолок) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
	КонецЦикла;
	
	ВремРучнаяКорректировкаМатериалов = Объект.РучнаяКорректировкаМатериалов;
	
КонецПроцедуры
//-- №14311

#КонецОбласти

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Функция ПоказатьВопросПриОткрытии() Экспорт	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НачалоПерезаполненияЗаказаНаПроизводствоПоОснованию", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ПросмотрРазличийДокументов", ПараметрыФормыПросмотраРазличий, ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецФункции

//НА СЕРВЕРЕ
&НаСервере
Функция ПолучитьОсновнуюФактуруИЦвет()
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ПродукцияФактура",Справочники.Фактура.ПустаяСсылка()); 
	СтруктураОтвета.Вставить("ПродукцияЦвет",Справочники.ЦветФактуры.ПустаяСсылка());
	
	Для Каждого ТекущаяСтрока Из Объект.ФактураПотолка Цикл
		Если ТекущаяСтрока.Основная Тогда
			СтруктураОтвета.ПродукцияФактура = ТекущаяСтрока.ПродукцияФактура;
			СтруктураОтвета.ПродукцияЦвет = ТекущаяСтрока.ПродукцияЦвет;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаСервере 
Функция НайтиДокументВыпускаПродукции()
	
	Результат = Документы.ВыпускПродукции.ПустаяСсылка();
	
	ОсновнаяФактура = ПолучитьОсновнуюФактуруИЦвет();
	
	//подберем последний документ выпуска продукции по данному заказу на производство
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыНаПроизводствоОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыНаПроизводствоОбороты
	|ГДЕ
	|	ЗаказыНаПроизводствоОбороты.КоличествоРасход > 0
	|	И ЗаказыНаПроизводствоОбороты.Фактура = &Фактура
	|	И ЗаказыНаПроизводствоОбороты.ЦветФактуры = &ЦветФактуры
	|	И ЗаказыНаПроизводствоОбороты.НомерРасчета = &НомерРасчета";
	Запрос.УстановитьПараметр("ЗаказНаПроизводство",Объект.Ссылка);
	Запрос.УстановитьПараметр("Фактура",ОсновнаяФактура.ПродукцияФактура);
	Запрос.УстановитьПараметр("ЦветФактуры",ОсновнаяФактура.ПродукцияЦвет);
	Запрос.УстановитьПараметр("НомерРасчета",Объект.ПродукцияНомерРасчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВыпускПродукции = Выборка.Регистратор;
		Результат = Выборка.Регистратор;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере 
Процедура НайтиДокументПродажи()
	
	//подберем последний документ выпуска продукции по данному заказу на производство
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыНаПроизводствоОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыНаПроизводствоОбороты
	|ГДЕ
	|	ЗаказыНаПроизводствоОбороты.КоличествоРасход > 0";
	Запрос.УстановитьПараметр("ЗаказНаПроизводство",Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПродажаТовара = Выборка.Регистратор;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Десериализовать(XMLОбъект)
	
	ЧтениеXMLДанных = Новый ЧтениеXML;
	ЧтениеXMLДанных.УстановитьСтроку(XMLОбъект);
	ПолученныйОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	ЧтениеXMLДанных.Закрыть();
	Возврат ПолученныйОбъект;
	
КонецФункции

&НаСервереБезКонтекста
Функция Сериализовать(ОбъектСериализации)
	
	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	ЗаписьXMLДанных = Новый ЗаписьXML;
	ЗаписьXMLДанных.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXMLДанных,ДеревоВОбъектеXDTO);
	Возврат ЗаписьXMLДанных.Закрыть();
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеДокумента()
	
	Если НЕ НеУчитыватьСтоимость Тогда
		СуммаДокументаВрем = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + Объект.ПродукцияСумма + Объект.Продукция.Итог("Сумма");
		//Если НЕ Объект.СуммаДокумента = СуммаДокументаВрем Тогда
		Объект.СуммаДокумента = СуммаДокументаВрем;
		//КонецЕсли;
		//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
		ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
		ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
		ОбновитьДолгКонтрагента();
	Иначе
		//Если НЕ Объект.СуммаДокумента = 0 Тогда
		Объект.СуммаДокумента = 0;
		//КонецЕсли;
	КонецЕсли;	
	
	Если Объект.Исполнители.Количество() > 0 тогда
		Элементы.ГруппаИсполнители.Заголовок = "Исполнители ("+Объект.Исполнители.Количество()+")";
	Иначе
		Элементы.ГруппаИсполнители.Заголовок = "Исполнители";
	КонецЕсли;
	Если Объект.ИсполнителиПоОперациям.Количество() > 0 тогда
		Элементы.ГруппаИсполнителиПоОперациям.Заголовок = "Исполнители по операциям ("+Объект.ИсполнителиПоОперациям.Количество()+")";
	Иначе
		Элементы.ГруппаИсполнителиПоОперациям.Заголовок = "Исполнители по операциям";
	КонецЕсли;
	
	ПоказыватьКнопкуУстановитеЦеныРаскроя = Ложь;
	Для каждого ТекущаяСтрока Из Объект.Услуги Цикл
		Если ТекущаяСтрока.Номенклатура.Пустая() Тогда
			ПоказыватьКнопкуУстановитеЦеныРаскроя = Истина;
		КонецЕсли; 
	КонецЦикла; 
	Элементы.УслугиУстановитеЦеныНаУслугиРаскроя.Видимость = ПоказыватьКнопкуУстановитеЦеныРаскроя;
	
	ВидимостьГруппыПродукцияНазначение = Объект.ДокументОснование <> Неопределено 
											И НЕ Объект.ДокументОснование.Пустая()
											И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказДоговор");
											
	//++ №12232 теперь данные в колонке ТЧ
	//Элементы.ГруппаПродукцияНазначение.Видимость = ВидимостьГруппыПродукцияНазначение;
	Элементы.ПотолокКомната.Видимость = ВидимостьГруппыПродукцияНазначение;
	Элементы.ПотолокНазначение.Видимость = ВидимостьГруппыПродукцияНазначение;
	//-- №12232
	
	Элементы.ТоварыКомната.Видимость = ВидимостьГруппыПродукцияНазначение;
	Элементы.ТоварыНазначение.Видимость = ВидимостьГруппыПродукцияНазначение;
	
	ОбновитьСписокФайлов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементов()
	
	Элементы.СкладОтгрузки.Видимость = СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции;
	Элементы.Цех.Видимость = Объект.НесколькоТочекПроизводства;
	
	Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ЗаказНаПродажу 
		ИЛИ Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.Перезаказ Тогда
		Элементы.ГруппаТиповаяПродукция.Видимость = Ложь;
		Элементы.ГруппаПродукция.Видимость = Ложь;
		Элементы.ГруппаМатериалы.Видимость = Ложь;
		Элементы.АдресМонтажа.Видимость = Ложь;
		
		// №14968 Элементы.УДАЛИТЬ_ФормаПеревестиВСтатусВПроизводстве.Доступность = Ложь;
		Элементы.ФормаПеревестиВСтатусПроизведен.Доступность = Ложь;
		
		Если НЕ НеУчитыватьСтоимость Тогда
			Элементы.УслугиРассчитатьЦентровкуШва.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.Склад.Заголовок = "Склад";
		//Элементы.Склад.Заголовок = "Склад                  ";
	ИначеЕсли Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
		Элементы.ГруппаТиповаяПродукция.Видимость = Истина;
		Элементы.ГруппаПродукция.Видимость = Ложь;
		Элементы.ГруппаМатериалы.Видимость = Истина;
		Элементы.АдресМонтажа.Видимость = Истина; //Ложь; #10898
		
		// №14968 Элементы.УДАЛИТЬ_ФормаПеревестиВСтатусВПроизводстве.Доступность = Истина;
		Элементы.ФормаПеревестиВСтатусПроизведен.Доступность = Истина;
		
		Если НЕ НеУчитыватьСтоимость Тогда
			Элементы.УслугиРассчитатьЦентровкуШва.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.ЗаполнитьМатериалыПоФактуре.Видимость = Ложь;
		Элементы.МатериалыЗаполнитьМатериалыПоСпецификациям.Видимость = Истина;
		Элементы.МатериалыДобавитьРулонПоНомеру.Видимость = Ложь;
		Элементы.МатериалыГруппаЗаменитьМатериалы.Видимость = Ложь;
		
		Элементы.Склад.Заголовок = "Склад";
		//Элементы.Склад.Заголовок = "Склад                 ";		
	Иначе
		Элементы.ГруппаТиповаяПродукция.Видимость = Ложь;
		Элементы.ГруппаПродукция.Видимость = Истина;
		Элементы.ГруппаМатериалы.Видимость = Истина;
		Элементы.АдресМонтажа.Видимость = Истина;
		
		// №14968 Элементы.УДАЛИТЬ_ФормаПеревестиВСтатусВПроизводстве.Доступность = Истина;
		Элементы.ФормаПеревестиВСтатусПроизведен.Доступность = Истина;
		
		Если НЕ НеУчитыватьСтоимость Тогда
			Элементы.УслугиРассчитатьЦентровкуШва.Видимость = Истина;
		КонецЕсли;
		
		//++16102
		//Элементы.ЗаполнитьМатериалыПоФактуре.Видимость = Истина;
		//++16102
		Элементы.МатериалыЗаполнитьМатериалыПоСпецификациям.Видимость = Ложь;
		Элементы.МатериалыДобавитьРулонПоНомеру.Видимость = Истина;
		Элементы.МатериалыГруппаЗаменитьМатериалы.Видимость = Истина;
		
		Элементы.Склад.Заголовок = "Склад продукции";
		//Элементы.Склад.Заголовок = "Склад продукции";		
	КонецЕсли;
	
	// №6687 видимость ТЧ исполнителей по способу начисления
	Элементы.ГруппаИсполнителиПоОперациям.Видимость = (Объект.СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации);
	Элементы.ГруппаИсполнители.Видимость = (Объект.СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.Бригадная);
	
	// №14862
	Элементы.МатериалыЗагрузитьМатериалыИзПостроителя.Видимость = (Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка
	                                                               И Объект.ПродукцияНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДолгКонтрагента()
	//переход на 2.0
	//Если Объект.Контрагент.Пустая() Тогда
	//	Элементы.ГруппаТекущийДолг.Видимость = Ложь;		
	//Иначе
	//	Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);		
	//	Элементы.ГруппаТекущийДолг.Видимость = Истина;		
	//	ВалютаУчета = Константы.ВалютаУчета.Получить();
	//	Элементы.ДекорацияНадписьВалютаДолга1.Заголовок = ВалютаУчета;		
	//КонецЕсли;
	
	
	//Если РаботаСВалютой.ОтображатьЗадолженностьКонтрагентаВВалюте() Тогда
	//	Элементы.ГруппаТекущийДолгВВалюте.Видимость = Истина;
	//	Элементы.ДекорацияДолгВВалюте.Заголовок = РаботаСВалютой.ПолучитьТекстНадписиДолгаКонтрагентаВВалютеОтображенияЗадолженности(, Объект.Контрагент, Объект.Организация);
	//Иначе
	//	Элементы.ГруппаТекущийДолгВВалюте.Видимость = Ложь;
	//КонецЕсли;
	//переход на 2.0
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущийДолгКлиента(Знач Организация, Знач Контрагент, Знач Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			Договор = &Договор
	|				И Контрагент = &Контрагент
	|				И Организация = &Организация) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ПолучитьКоэффициентЕдиницыИзмерения(ЕдиницаИзмерения)
	
	Возврат ЕдиницаИзмерения.Коэффициент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры = Неопределено, ЕдиницаИзмерения = Неопределено, ИскатьСначалаВЦенахУслугКроя = Ложь)
	
	Если НЕ ИскатьСначалаВЦенахУслугКроя Тогда
		Возврат РегистрыСведений.ЦеныНоменклатуры.ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Объект.Дата, Объект.ВидЦен, Объект.Валюта);
	Иначе
		
		Цена = Справочники.ЦеныУслугРаскроя.ПолучитьЦенуНоменклатурыУслугиРаскроя(Объект.Дата, Объект.Валюта, Номенклатура.ВидНоменклатуры, Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен, Объект.ВидЦен, Номенклатура);
				
		Если НЕ Цена = 0 Тогда
			ДатаКурса = Объект.Дата;
			Если ДатаКурса = Дата(1,1,1) Тогда
				ДатаКурса = ТекущаяДатаСеанса();
			КонецЕсли;
			Возврат РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Справочники.ЦеныУслугРаскроя.ПолучитьВидЦенНаУслугиПроизводства(Объект.Дата, Объект.Валюта, Номенклатура.ВидНоменклатуры, Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен, Объект.ВидЦен, Объект.ДоговорКонтрагента).Валюта, Объект.Валюта, ДатаКурса, Цена);
		Иначе
			Возврат РегистрыСведений.ЦеныНоменклатуры.ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Объект.Дата, Объект.ВидЦен, Объект.Валюта, Объект.Контрагент, объект.ДоговорКонтрагента);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоУслуга(Номенклатура)
	Результат = Ложь;
	Если Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПодобратьНоменклатуруПродукцияНаСервере()
	
	ОсновнаяФактура = ПолучитьОсновнуюФактуруИЦвет();
	
	НаименованиеНоменклатурыДляПоиска = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(Объект.ПродукцияНомерРасчета, ОсновнаяФактура.ПродукцияЦвет, ОсновнаяФактура.ПродукцияЦвет.Владелец);
	ГруппаНоменклатурыДляПоиска = Константы.ГруппаНоменклатурыПродукция.Получить();
	ИскомаяНоменклатура = ОбменСEasyCeiling.НайтиНоменклатуруПотолка(Объект.ПродукцияНомерРасчета, НаименованиеНоменклатурыДляПоиска, ГруппаНоменклатурыДляПоиска);
	
	Объект.ПродукцияНоменклатура = ИскомаяНоменклатура;
	//Объект.ПродукцияНоменклатураКоличество = Объект.ПродукцияНоменклатураКоличество;
	Объект.ПродукцияНоменклатураКоэффициент = 1;
	Объект.ПродукцияНоменклатураЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Объект.ПродукцияНоменклатура);
	
КонецПроцедуры

&НаСервере
Функция СоздатьНоменклатуруПродукцияНаСервере()
	
	БазоваяЕдИзм = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
	Если БазоваяЕдИзм.Пустая() Тогда
		Возврат "Ошибка!"+Символы.ПС+"В справочнике ""Классификатор единиц измерения"" не найдена единица с наименованием ""м2""";
	КонецЕсли;
	
	ОсновнаяФактура = ПолучитьОсновнуюФактуруИЦвет();
	
	Отказ = Ложь;
	Если ПустаяСтрока(Объект.ПродукцияНомерРасчета) Тогда
		Отказ = Истина;
		Сообщить("В документе следует указать номер расчета");
	КонецЕсли;
	Если ПустаяСтрока(ОсновнаяФактура.ПродукцияЦвет) Тогда
		Отказ = Истина;
		Сообщить("В документе следует указать цвет основной фактуры");
	КонецЕсли;
	Если Отказ Тогда
		Возврат "Номенклатура не создана";
	КонецЕсли;
	
	НаименованиеНоменклатурыДляСоздания = ОбменСEasyCeiling.ПолучитьНаименованиеПотолка(Объект.ПродукцияНомерРасчета, ОсновнаяФактура.ПродукцияЦвет, ОсновнаяФактура.ПродукцияЦвет.Владелец);
	ГруппаНоменклатурыДляСоздания = Константы.ГруппаНоменклатурыПродукция.Получить();
	
	Попытка
		НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
		НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
		НоваяНоменклатура.БазоваяЕдиницаИзмерения = БазоваяЕдИзм.Ссылка;
		НоваяНоменклатура.Наименование = НаименованиеНоменклатурыДляСоздания;
		НоваяНоменклатура.Родитель = ГруппаНоменклатурыДляСоздания;
		НоваяНоменклатура.Потолок_НомерРасчета = Объект.ПродукцияНомерРасчета;
		
		НоваяНоменклатура.Потолок_Фактура.Очистить();
		НоваяСтрока = НоваяНоменклатура.Потолок_Фактура.Добавить();
		НоваяСтрока.Основная = Истина;
		НоваяСтрока.ПродукцияФактура = ОсновнаяФактура.ПродукцияЦвет.Владелец;
		НоваяСтрока.ПродукцияЦвет = ОсновнаяФактура.ПродукцияЦвет;
		
		НоваяНоменклатура.Записать();
	
		Объект.ПродукцияНоменклатура = НоваяНоменклатура.Ссылка;
		//Объект.ПродукцияНоменклатураКоличество = Объект.ПродукцияНоменклатураКоличество;
		Объект.ПродукцияНоменклатураКоэффициент = 1;
		Объект.ПродукцияНоменклатураЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Объект.ПродукцияНоменклатура);
		Возврат "Создана новая номенклатура " + НоваяНоменклатура.Ссылка;
	Исключение
		Возврат "Ошибка!" + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПолучитьЦенуМатериала(ДатаЗапроса, Цвет, ВидЦен, ПродукцияНоменклатура) Экспорт
	
	СФотопечатью = НЕ (ПродукцияНоменклатура.Потолок_ПлощадьФотопечати = 0);

	ПараметрыПродукции = Новый Структура;
	ПараметрыПродукции.Вставить("ВидНоменклатуры", 	ПродукцияНоменклатура.ВидНоменклатуры);
	ПараметрыПродукции.Вставить("Фактура", 			Цвет.Владелец);
	ПараметрыПродукции.Вставить("ЦветФактуры", 		Цвет);			
	ПараметрыПродукции.Вставить("СФотопечатью", 	СФотопечатью);
	
	Возврат ЦеныКомпании.ПолучитьЦенуПродукции(ПараметрыПродукции, Объект.Дата, ВидЦен, Объект.Валюта, Объект.Контрагент, Объект.ДоговорКонтрагента);
			
КонецФункции

&НаСервере
Функция ПересчитатьЦеныПоВидуЦен()
	
	Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
		//новый код с использованием универсальных функций
		ОписаниеОшибки = "";
		СтруктураПотолка = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(Объект.ПродукцияНоменклатура,,,,,,, ОписаниеОшибки);
		Если СтруктураПотолка = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			Сообщить(ОписаниеОшибки);
			Возврат Неопределено;
		КонецЕсли;
		//СтруктураЗаказа = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураПотолка,Объект.НастройкаИнтеркампани, Объект.ВидЦен, Объект.Валюта, ?(Объект.Дата=Дата(1,1,1),ТекущаяДатаСеанса(),Объект.Дата), Перечисления.ВидыЗаказов.ЗаказНаПроизводство,,,Объект.ДоговорКонтрагента);
		ДанныеЗаказа = ОбменСEasyCeiling.СтруктураДанныхЗаказа(Объект.Организация, Объект.Подразделение, Объект.НастройкаИнтеркампани,
							  				 Объект.ВидЦен, Объект.Валюта, ?(Объект.Дата=Дата(1,1,1),ТекущаяДатаСеанса(),Объект.Дата), , , Объект.ДоговорКонтрагента, Объект.ВнутреннийЗаказ);
		СтруктураЗаказа = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураПотолка, Перечисления.ВидыЗаказов.ЗаказНаПроизводство, ДанныеЗаказа);
				
		Объект.ПродукцияСумма = СтруктураЗаказа.Сумма;
		Объект.ПродукцияНоменклатураКоличество = СтруктураЗаказа.Количество;
		Объект.ПродукцияЦена = СтруктураЗаказа.Цена;
		Если Объект.СкидкаНаПотолки <> 0 Тогда
			Объект.ПродукцияПроцентРучнойСкидки = Объект.СкидкаНаПотолки;			
		КонецЕсли;		
		Объект.ПродукцияСуммаРучнойСкидки = Объект.ПродукцияСумма * Объект.ПродукцияПроцентРучнойСкидки / 100;
		Объект.ПродукцияСумма = Объект.ПродукцияСумма - Объект.ПродукцияСуммаРучнойСкидки;	
		
		Объект.Услуги.Очистить();
		Для Каждого СтрокаТовар Из СтруктураЗаказа.Услуги Цикл
			НоваяСтрока = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовар);
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
			ТекущаяСтрока.Цена = ПолучитьЦенуНоменклатуры(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения);
			
			СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			Если Объект.СкидкаНаТовары <> 0 Тогда
				ТекущаяСтрока.ПроцентРучнойСкидки = Объект.СкидкаНаТовары;
			КонецЕсли;	
			ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
			ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;	
		КонецЦикла;
		
	Иначе
		//старый код, может уже и не нужен и его надо удалть?
		
		ТаблицаЦен = Новый ТаблицаЗначений;
		ТаблицаЦен.Колонки.Добавить("Количество");
		ТаблицаЦен.Колонки.Добавить("Цена");
		ТаблицаЦен.Колонки.Добавить("Сумма");

		
		Если Объект.ФактураПотолка.Количество() > 0 Тогда
			Для Каждого ТекушаяСтрока Из Объект.ФактураПотолка Цикл
				НоваяСтрока = ТаблицаЦен.Добавить();
				НоваяСтрока.Количество = ТекушаяСтрока.ПродукцияКоличество;
				НоваяСтрока.Цена = ПолучитьЦенуМатериала(КонецДня(Объект.Дата), ТекушаяСтрока.ПродукцияЦвет,Объект.ВидЦен, Объект.ПродукцияНоменклатура);
				НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
			КонецЦикла;
		КонецЕсли;

		
		ТаблицаЦен.Свернуть(,"Сумма");
		Если ТаблицаЦен.Количество() > 0 Тогда
			Объект.ПродукцияСумма = ТаблицаЦен[0].Сумма;
		КонецЕсли;
		Если НЕ Объект.ПродукцияНоменклатураКоличество = 0 Тогда
			Объект.ПродукцияЦена = Объект.ПродукцияСумма / Объект.ПродукцияНоменклатураКоличество;
		КонецЕсли;







		//НАЧАЛО Переход на 2.0
		//округлим стоимость потолка и пересчитаем цену по факту
		//Объект.ПродукцияСумма = ОбщийМодуль.ОкруглитьЧисло(Объект.ПродукцияНоменклатураКоличество * Объект.ПродукцияЦена,Объект.ВидЦен.ПорядокОкругленияСтоимостиПроизводимыхПотолков,Объект.ВидЦен.ОкруглятьВБольшуюСторонуСтоимостьПроизводимыхПотолков);
		//КОНЕЦ  Переход на 2.0

		Объект.ПродукцияСумма = Объект.ПродукцияНоменклатураКоличество * Объект.ПродукцияЦена;
		Если НЕ Объект.ПродукцияНоменклатураКоличество = 0 Тогда
			Объект.ПродукцияЦена = Объект.ПродукцияСумма /  Объект.ПродукцияНоменклатураКоличество;
			
			Если Объект.СкидкаНаПотолки <> 0 Тогда
				Объект.ПродукцияПроцентРучнойСкидки = Объект.СкидкаНаПотолки;			
			КонецЕсли;		
			
			Объект.ПродукцияСуммаРучнойСкидки = Объект.ПродукцияСумма * Объект.ПродукцияПроцентРучнойСкидки / 100;
			
			Объект.ПродукцияСумма = Объект.ПродукцияСумма - Объект.ПродукцияСуммаРучнойСкидки;	
			
			
		КонецЕсли;
		
		
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
			ТекущаяСтрока.Цена = ПолучитьЦенуНоменклатуры(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения);
			
			СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			Если Объект.СкидкаНаТовары <> 0 Тогда
				ТекущаяСтрока.ПроцентРучнойСкидки = Объект.СкидкаНаТовары;
			КонецЕсли;	
			ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
			ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;	
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
			ТекущаяСтрока.Цена = ПолучитьЦенуНоменклатуры(ТекущаяСтрока.Номенклатура, Неопределено, ТекущаяСтрока.ЕдиницаИзмерения, Истина);
			
			СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			Если Объект.СкидкаНаУслуги <> 0 Тогда
				ТекущаяСтрока.ПроцентРучнойСкидки = Объект.СкидкаНаУслуги;
			КонецЕсли;
			ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
			ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;			
		КонецЦикла;
		//ПерезаполнитьУслугиРаскрояПоДаннымФайлаИмпорта();
		
		Для Каждого ТекущаяСтрока Из Объект.Продукция Цикл
			ТекущаяСтрока.Цена = ПолучитьЦенуНоменклатуры(ТекущаяСтрока.Номенклатура, Неопределено, ТекущаяСтрока.ЕдиницаИзмерения);
			
			СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			Если Объект.СкидкаНаПотолки <> 0 Тогда
				ТекущаяСтрока.ПроцентРучнойСкидки = Объект.СкидкаНаПотолки;
			КонецЕсли;
			ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
			ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;	
		КонецЦикла;
	КонецЕсли;

	ОбновитьДанныеДокумента();	

КонецФункции

&НаСервере
Процедура ПеревестиФормуВТолькоПросмотр(ТолькоПросмотр)
	
	ЭтаФорма.ТолькоПросмотр = ТолькоПросмотр;
	ЭтаФорма.КоманднаяПанель.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ПодменюСоздатьНаОсновании.ТолькоПросмотр = ТолькоПросмотр;
	
	Элементы.ГруппаСуммаДокумента.ТолькоПросмотр = ТолькоПросмотр;
	ПеревестиВсеПодчиненныеЭлементыВТолькоПРосмотр(Элементы.ГруппаСуммаДокумента, ТолькоПросмотр);
	
	Элементы.ФормаГруппаСменаСтатуса.ТолькоПросмотр = ТолькоПросмотр;
	ПеревестиВсеПодчиненныеЭлементыВТолькоПРосмотр(Элементы.ФормаГруппаСменаСтатуса, ТолькоПросмотр);
	
	//++ №12232 комментируем, т.к. больше не используется
	//Элементы.ГруппаПродукцияНоменклатураКнопки.ТолькоПросмотр = ТолькоПросмотр;
	//ПеревестиВсеПодчиненныеЭлементыВТолькоПРосмотр(Элементы.ГруппаПродукцияНоменклатураКнопки, ТолькоПросмотр);
	//-- №12232
	
	ПеревестиВсеПодчиненныеЭлементыВТолькоПРосмотр(Элементы.УслугиГруппаКнопок, ТолькоПросмотр);
	ПеревестиВсеПодчиненныеЭлементыВТолькоПРосмотр(Элементы.МатериалыГруппаКнопок, ТолькоПросмотр);
	
	ПеревестиВсеПодчиненныеЭлементыВТолькоПРосмотр(Элементы.Исполнители.КоманднаяПанель, ТолькоПросмотр);
	ПеревестиВсеПодчиненныеЭлементыВТолькоПРосмотр(Элементы.ИсполнителиПоУчасткам.КоманднаяПанель, ТолькоПросмотр);
	ПеревестиВсеПодчиненныеЭлементыВТолькоПРосмотр(Элементы.ГруппаФайлыКнопки, ТолькоПросмотр);
	
КонецПроцедуры

&НаСервере
Процедура ПеревестиВсеПодчиненныеЭлементыВТолькоПРосмотр(РодительскийЭлемент, ТолькоПросмотр)
	
	Для Каждого ПодчиненныйЭлемент Из РодительскийЭлемент.ПодчиненныеЭлементы Цикл
		Попытка
			Если ПодчиненныйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка 
				или ПодчиненныйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели
				или ПодчиненныйЭлемент.Вид = ВидГруппыФормы.Подменю
				Тогда
				ПодчиненныйЭлемент.Доступность = Не ТолькоПросмотр;
			Иначе
				ПодчиненныйЭлемент.ТолькоПросмотр = ТолькоПросмотр;
			КонецЕсли;
		Исключение
		КонецПопытки
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПерезаполненияЗаказаНаПроизводствоПоОснованию(Результат, Параметры) Экспорт
	
	Если Результат = Истина Тогда
		
		РезультатОбработки = ОбновитьЗаказНаПроизводствоПоЗаказуПокупателя();
				
		//Если НЕ ЕстьВыпускПоЗаказу Тогда
		//	ПеревестиФормуВТолькоПросмотр(Ложь);
		//КонецЕсли;
		Если РезультатОбработки Тогда
        	ЭтотОбъект.Прочитать();			
		КонецЕсли;
		ПриОткрытии(Ложь);
		
    КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОбновитьЗаказНаПроизводствоПоЗаказуПокупателя(ПоОбъекту = Ложь)
	
	ДоступноИзменениеПриНаличииВыпуска = Ложь;
	Если ТипЗнч(ПараметрыФормыПросмотраРазличий) = Тип("Структура")
		И ПараметрыФормыПросмотраРазличий.Свойство("ДоступноИзменениеПриНаличииВыпуска") Тогда
		ДоступноИзменениеПриНаличииВыпуска = ПараметрыФормыПросмотраРазличий.ДоступноИзменениеПриНаличииВыпуска;
	КонецЕсли;
	
	Если ПоОбъекту Тогда
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");		
		РезультатОбработки = ОбщийМодуль.ОбновитьЗаказНаПроизводствоПоЗаказуПокупателя(ТекущийОбъект, ДоступноИзменениеПриНаличииВыпуска);		
		ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	Иначе
		РезультатОбработки = ОбщийМодуль.ОбновитьЗаказНаПроизводствоПоЗаказуПокупателя(Объект.Ссылка, ДоступноИзменениеПриНаличииВыпуска);
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;	
	ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;	
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
	ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
	ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	Если СуммаБезСкидки = 0 Тогда
		ТекущаяСтрока.СуммаРучнойСкидки = 0;
		ТекущаяСтрока.ПроцентРучнойСкидки = 0;
	Иначе
		ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки - ТекущаяСтрока.Сумма;
		ТекущаяСтрока.ПроцентРучнойСкидки = (ТекущаяСтрока.СуммаРучнойСкидки * 100) / СуммаБезСкидки;  
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
	ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	//ТекущаяСтрока.КоличествоКВыработке = ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
	ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	Если СуммаБезСкидки = 0 Тогда
		ТекущаяСтрока.СуммаРучнойСкидки = 0;
		ТекущаяСтрока.ПроцентРучнойСкидки = 0;
	Иначе
		ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки - ТекущаяСтрока.Сумма;
		ТекущаяСтрока.ПроцентРучнойСкидки = (ТекущаяСтрока.СуммаРучнойСкидки * 100) / СуммаБезСкидки;  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Коэффициент = 1;
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	//заккоментирована потому что добавлены скидки по договору
	//СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена;
	СуммаБезСкидки = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	Если Объект.СкидкаНаТовары <> 0 Тогда
		СтрокаТабличнойЧасти.ПроцентРучнойСкидки = Объект.СкидкаНаТовары;		
		СтрокаТабличнойЧасти.СуммаРучнойСкидки = СуммаБезСкидки * СтрокаТабличнойЧасти.ПроцентРучнойСкидки/100;
	Иначе
		СтрокаТабличнойЧасти.ПроцентРучнойСкидки = 0;
		СтрокаТабличнойЧасти.СуммаРучнойСкидки = 0;		
	КонецЕсли;		
	
	СтрокаТабличнойЧасти.Сумма = СуммаБезСкидки - СтрокаТабличнойЧасти.СуммаРучнойСкидки;	
	
	ОбновитьСписокФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Коэффициент = 1;
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, Неопределено, СтрокаТабличнойЧасти.ЕдиницаИзмерения, Истина);
	//заккоментирована потому что добавлены скидки по договору
	//СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена;
	СуммаБезСкидки = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	Если Объект.СкидкаНаУслуги <> 0 Тогда
		СтрокаТабличнойЧасти.ПроцентРучнойСкидки = Объект.СкидкаНаУслуги;		
		СтрокаТабличнойЧасти.СуммаРучнойСкидки = СуммаБезСкидки * СтрокаТабличнойЧасти.ПроцентРучнойСкидки/100;
	Иначе
		СтрокаТабличнойЧасти.ПроцентРучнойСкидки = 0;
		СтрокаТабличнойЧасти.СуммаРучнойСкидки = 0;		
	КонецЕсли;		
	
	СтрокаТабличнойЧасти.Сумма = СуммаБезСкидки - СтрокаТабличнойЧасти.СуммаРучнойСкидки;
	//СтрокаТабличнойЧасти.КоличествоКВыработке = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПродукцияЦенаПриИзменении(Элемент)
	СуммаБезСкидки = Объект.ПродукцияНоменклатураКоличество * Объект.ПродукцияЦена;
	Объект.ПродукцияСуммаРучнойСкидки = СуммаБезСкидки * Объект.ПродукцияПроцентРучнойСкидки/100;
	Объект.ПродукцияСумма = СуммаБезСкидки - Объект.ПродукцияСуммаРучнойСкидки;
	
	ОбновитьДанныеДокумента();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоПродукции();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСуммаПриИзменении(Элемент)
	СуммаБезСкидки = Объект.ПродукцияНоменклатураКоличество * Объект.ПродукцияЦена;
	Если СуммаБезСкидки = 0 Тогда
		Объект.ПродукцияСуммаРучнойСкидки = 0;
		Объект.ПродукцияПроцентРучнойСкидки = 0;
	Иначе
		Объект.ПродукцияСуммаРучнойСкидки = СуммаБезСкидки - Объект.ПродукцияСумма;
		Объект.ПродукцияПроцентРучнойСкидки = (Объект.ПродукцияСуммаРучнойСкидки * 100) / СуммаБезСкидки;  
	КонецЕсли;
	
	ОбновитьДанныеДокумента();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоПродукции();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Документ не сохранен!");
		Возврат;
	КонецЕсли;
	
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьЦентровкуШваНаСервере()
	
	//УслугаЦентровки = Справочники.ЦеныУслугРаскроя.ПолучитьНоменклатуруУслугиЦентровкиШва(Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен, Объект.ВидЦен, Объект.Дата, Объект.Валюта);
	//ПроцентЗаЦентровку = Справочники.ЦеныУслугРаскроя.ПолучитьСтоимостьУслугиЦентровкиШва(Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен, Объект.ВидЦен, Объект.Дата, Объект.Валюта) / 100;
	//НеВключатьУслуги = Справочники.ЦеныУслугРаскроя.СтоимостьЦентровкиШваНеВключаетСтоимостьУслуг(Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен, Объект.ВидЦен, Объект.Дата, Объект.Валюта);
	ДанныеЦентровки = Справочники.ЦеныУслугРаскроя.ПолучитьДанныеУслугиЦентровкиШва(Объект.Дата, Объект.Валюта, Справочники.ВидыНоменклатуры.Потолок, Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен, Объект.ВидЦен, Объект.ДоговорКонтрагента);
	УслугаЦентровки 	= ДанныеЦентровки.НоменклатураУслугиЦентровкиШва;
	ПроцентЗаЦентровку 	= ДанныеЦентровки.СтоимостьУслугиЦентровкиШва;
	НеВключатьУслуги    = ДанныеЦентровки.СтоимостьЦентровкиШваНеВключаетСтоимостьУслуг;
	
	//Если ПроцентЗаЦентровку = 0 Тогда
	//	ПроцентЗаЦентровку = Константы.СтоимостьУслугиЦентровкиШва.Получить() / 100;
	//КонецЕсли;
	
	УслугаСрочность = Константы.СрочностьУслуга.Получить();
		
	//сначала проверим, есть ли что рассчитывать
	НужноРасчитывать = Ложь;
	Для Каждого Услуга Из Объект.Услуги Цикл
		Если Услуга.Номенклатура = УслугаЦентровки Тогда
			НужноРасчитывать = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ НужноРасчитывать Тогда
		Сообщить("В документе нет услуги по центровке швов.");
		Возврат;
	КонецЕсли;
	
	//проверим, оценена ли продукция
	НужноРасчитывать = Истина;
	Для Каждого Товары Из Объект.Товары Цикл
		Если Товары.Сумма = 0 Тогда
			НужноРасчитывать = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ Объект.ПродукцияФактура.Пустая() тогда
		Если Объект.ПродукцияСумма = 0 Тогда
			НужноРасчитывать = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если НЕ НужноРасчитывать Тогда
		Сообщить("В документе имеется продукция или товар без стоимости. Расчет остановлен.");
		Возврат;
	КонецЕсли;
	
	ТекСтоимостьУслуг = 0;
	Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
		Если НЕ ТекущаяСтрока.Номенклатура = УслугаЦентровки
			И НЕ ТекущаяСтрока.Номенклатура = УслугаСрочность Тогда
			ТекСтоимостьУслуг = ТекСтоимостьУслуг + ТекущаяСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если НеВключатьУслуги Тогда
		ТекСтоимостьУслуг = Объект.ПродукцияСумма;
	Иначе
		ТекСтоимостьУслуг = ТекСтоимостьУслуг + Объект.ПродукцияСумма;
	КонецЕсли;
	ТекСтоимостьЦентровки = ТекСтоимостьУслуг * ПроцентЗаЦентровку;
	
	Для Каждого Услуга Из Объект.Услуги Цикл
		Если Услуга.Номенклатура = УслугаЦентровки Тогда
			Услуга.Сумма = ТекСтоимостьЦентровки;
			Если НЕ Услуга.Количество = 0 Тогда
				Услуга.Цена = Услуга.Сумма / Услуга.Количество;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦентровкуШва(Команда)
	РассчитатьЦентровкуШваНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьНоменклатуруПродукция(Команда)
	Если НЕ Объект.ПродукцияНоменклатура.Пустая() Тогда
		Если Вопрос("Очистить введенные ранее данные?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПодобратьНоменклатуруПродукцияНаСервере();
	Если Объект.ПродукцияНоменклатура.Пустая() Тогда
		Если Вопрос("Подходящая под данный заказ покупателя номенклатура не найдена, создать новую?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Результат = СоздатьНоменклатуруПродукцияНаСервере();
			Состояние(Результат);
		КонецЕсли;
	КонецЕсли;
	//ЗаменитьНоменклатуруПотолкаВЗаказДоговоре();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоФактуреНаСервере()
	
	ОсновнаяФактура = ПолучитьОсновнуюФактуруИЦвет();
	
	НоваяСтрока = Объект.Материалы.Добавить();
	НоваяСтрока.Номенклатура = ОсновнаяФактура.ПродукцияЦвет.Номенклатура;
	НоваяСтрока.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(НоваяСтрока.Номенклатура);
	НоваяСтрока.Коэффициент = 1;
	
	//++ №14311
	Объект.РучнаяКорректировкаМатериалов = Истина;
	ВремРучнаяКорректировкаМатериалов = Объект.РучнаяКорректировкаМатериалов;
	//-- №14311
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоФактуре(Команда)
	ЗаполнитьМатериалыПоФактуреНаСервере();
КонецПроцедуры

//&НаСервере
//Функция ЕстьДокументВыпускаПоЭтомуЗаказу()
//	Результат = Ложь;
//	НайденныйДокументВыпуска = НайтиДокументВыпускаПродукции();
//	Если НайденныйДокументВыпуска = Документы.ВыпускПродукции.ПустаяСсылка() Тогда
//		Результат = Ложь;
//	Иначе
//		Результат = Истина;
//	КонецЕсли;
//	Возврат Результат;
//КонецФункции

//&НаКлиенте
//Процедура ОформитьВыпускПродукции(Команда)
//	
//	ПеревестиВСтатусПроизведен(Неопределено);
//	
//	//Если НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.ВПроизводстве") Тогда
//	//	Состояние("Выпуск продукции можно оформить только по заказу в статусе ""В производстве""");
//	//	Возврат;
//	//КонецЕсли;
//	//Если НЕ ЕстьДокументВыпускаПоЭтомуЗаказу() Тогда
//	//	ПараметрыНовогоДокумента = Новый Структура;
//	//	ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
//	//	ОткрытьФорму("Документ.ВыпускПродукции.Форма.ФормаДокумента", ПараметрыНовогоДокумента);
//	//Иначе
//	//	Состояние("По данному заказу уже оформлялся выпуск. Оформление второго выпуска не возможно.");
//	//КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДокументВыпускаНажатие(Элемент)
	НайтиДокументВыпускаПродукции();
	Элементы.ВыпускПродукции.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДокументПродажиНажатие(Элемент)
	НайтиДокументПродажи();
	Элементы.ПродажаТовара.Видимость = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВидовНоменклатурыТовары()
	
	Возврат Справочники.Номенклатура.ПолучитьСписокВидовНоменклатурыТовары();
	
КонецФункции

&НаСервере
Процедура ПересчитатьЦенуИСуммуНоменклатурыВСтрокеПоВалюте(НомерСтроки)
	ТекущаяСтрока = Объект.Товары[НомерСтроки-1];
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Если НЕ ВалютаУчета = Объект.Валюта Тогда
		ДатаДокумента = Объект.Дата;
		Если ДатаДокумента = Дата(1,1,1) Тогда
			ДатаДокумента = ТекущаяДатаСеанса();
		КонецЕсли;
		ТекущаяСтрока.Цена = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, Объект.Валюта, ДатаДокумента, ТекущаяСтрока.Цена);
		СуммаСтроки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		ТекущаяСтрока.Сумма = СуммаСтроки - (СуммаСтроки * (ТекущаяСтрока.ПроцентРучнойСкидки / 100)) - ТекущаяСтрока.СуммаРучнойСкидки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьТовары(Команда)
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	ПараметрыПодбора.Вставить("Склад",					Объект.Склад);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыТовары());
	ПараметрыПодбора.Вставить("ВидЦены",				Объект.ВидЦен);
	ВозвращенноеЗначение = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораНоменклатуры",ПараметрыПодбора);
	
	Если НЕ ВозвращенноеЗначение = Неопределено Тогда
		Для Каждого ТекущаяСтрока из ВозвращенноеЗначение Цикл
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			ПересчитатьЦенуИСуммуНоменклатурыВСтрокеПоВалюте(НоваяСтрока.НомерСтроки);
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьДанныеДокумента();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьМатериалы(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	ПараметрыПодбора.Вставить("Склад",					Объект.Склад);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыТовары());
	
	ВозвращенноеЗначение = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораНоменклатуры",ПараметрыПодбора);
	
	Если НЕ ВозвращенноеЗначение = Неопределено Тогда
		Для Каждого ТекущаяСтрока из ВозвращенноеЗначение Цикл
			
			НоваяСтрока = Объект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			НоваяСтрока.КоличествоКВыработке = НоваяСтрока.Количество; // №14311
			
		КонецЦикла;
	КонецЕсли;
	
	//++ №14311
	Объект.РучнаяКорректировкаМатериалов = Истина;
	ВремРучнаяКорректировкаМатериалов = Объект.РучнаяКорректировкаМатериалов;
	//-- №14311
	
	ОбновитьДанныеДокумента();

КонецПроцедуры

&НаСервере
Функция ПолучитьВидЦенДоговора(Договор)
	Возврат Договор.ВидЦен;
КонецФункции

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьДанныеДокумента();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПересчетеЦен(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПересчитатьЦеныПоВидуЦен();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОПересчетеЦен()
	Если НЕ НеУчитыватьСтоимость Тогда
		Если Объект.Товары.Количество() > 0 ИЛИ Объект.Услуги.Количество() > 0 ИЛИ НЕ Объект.ПродукцияНоменклатура.Пустая() Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПересчетеЦен", ЭтаФорма, Параметры), "Пересчитать цены товаров и услуг? Услуги раскроя будут перезаполнены. Будут учтены скидки на основании договора.", РежимДиалогаВопрос.ДаНет,,,,);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	Если ПраваПользователей.ВидЦенДоступенПользователю(Объект.ВидЦен) Тогда
		ЗадатьВопросОПересчетеЦен();
	Иначе
		Объект.ВидЦен = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	ОбновитьДанныеДокумента();
	ОбновитьСписокФайлов();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеФайлаИмпорта(Команда)
	Парам = Новый Структура;
	Парам.Вставить("ДанныеФайлаИмпорта",Объект.ДанныеФайлаИмпорта);
	ОткрытьФорму("Документ.ЗаказНаПроизводство.Форма.ФормаДанныхИмпорта",Парам);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПроцентРучнойСкидкиПриИзменении(Элемент)	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
	ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаРучнойСкидкиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	Если СуммаБезСкидки = 0 Тогда
		ТекущаяСтрока.ПроцентРучнойСкидки = 0;
		ТекущаяСтрока.Сумма = СуммаБезСкидки;
	Иначе
		ТекущаяСтрока.ПроцентРучнойСкидки = (ТекущаяСтрока.СуммаРучнойСкидки * 100)/СуммаБезСкидки;		
		ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	КонецЕсли;  	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПроцентРучнойСкидкиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
	ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроцентРучнойСкидкиУслуги(Команда)
	ОП = Новый ОписаниеОповещения("ПослеЗапросаПроцентаРучнойСкидки", ЭтотОбъект, "Услуги");
	ПоказатьВводЧисла(ОП, Объект.Услуги[0].ПроцентРучнойСкидки,"Введите % скидки",10,2);	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроцентРучнойСкидкиТовары(Команда)
	ОП = Новый ОписаниеОповещения("ПослеЗапросаПроцентаРучнойСкидки", ЭтотОбъект, "Товары");
	ПоказатьВводЧисла(ОП, Объект.Товары[0].ПроцентРучнойСкидки,"Введите % скидки",10,2);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапросаПроцентаРучнойСкидки(ПроцентСкидки,Параметр) Экспорт
	Для Каждого ТекущаяСтрока из Объект[Параметр] Цикл
		ТекущаяСтрока.ПроцентРучнойСкидки = ПроцентСкидки;
		СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
		ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	КонецЦикла;
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаРучнойСкидкиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	Если СуммаБезСкидки = 0 Тогда
		ТекущаяСтрока.ПроцентРучнойСкидки = 0;
		ТекущаяСтрока.Сумма = СуммаБезСкидки;
	Иначе
		ТекущаяСтрока.ПроцентРучнойСкидки = (ТекущаяСтрока.СуммаРучнойСкидки * 100)/СуммаБезСкидки;		
		ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСуммуРучнойСкидкиУслуги(Команда)
	ОП = Новый ОписаниеОповещения("ПослеЗапросаСуммыРучнойСкидки", ЭтотОбъект, "Услуги");
	ПоказатьВводЧисла(ОП, 0,"Введите сумму скидки в каждой строке",10,2);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСуммуРучнойСкидкиТовары(Команда)
	ОП = Новый ОписаниеОповещения("ПослеЗапросаСуммыРучнойСкидки", ЭтотОбъект, "Товары");
	ПоказатьВводЧисла(ОП, 0,"Введите сумму скидки в каждой строке",10,2);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапросаСуммыРучнойСкидки(СуммаСкидки,Параметр) Экспорт
	Для Каждого ТекущаяСтрока из Объект[Параметр] Цикл 		
		ТекущаяСтрока.СуммаРучнойСкидки = СуммаСкидки;
		СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		Если СуммаБезСкидки = 0 Тогда
			ТекущаяСтрока.ПроцентРучнойСкидки = 0;
			ТекущаяСтрока.Сумма = СуммаБезСкидки;
		Иначе
			ТекущаяСтрока.ПроцентРучнойСкидки = (ТекущаяСтрока.СуммаРучнойСкидки * 100)/СуммаБезСкидки;		
			ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
		КонецЕсли;
	КонецЦикла;
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНоменклатураКоличествоПриИзменении(Элемент)
	
	//Если Объект.ПродукцияНоменклатураКоличество < ПродукцияНоменклатураКоличествоПредыдущееЗначение Тогда
	//	ПоказатьПредупреждение(,"Количество потолка можно изменить только в большую сторону");
	//	Объект.ПродукцияНоменклатураКоличество = ПродукцияНоменклатураКоличествоПредыдущееЗначение;
	//Иначе
	//	ПродукцияНоменклатураКоличествоПредыдущееЗначение = Объект.ПродукцияНоменклатураКоличество;
	//КонецЕсли;
	
	СуммаБезСкидки = Объект.ПродукцияНоменклатураКоличество * Объект.ПродукцияЦена;
	Объект.ПродукцияСуммаРучнойСкидки = СуммаБезСкидки * Объект.ПродукцияПроцентРучнойСкидки/100;
	Объект.ПродукцияСумма = СуммаБезСкидки - Объект.ПродукцияСуммаРучнойСкидки;
	
	ОбновитьДанныеДокумента();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоПродукции();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПроцентРучнойСкидкиПриИзменении(Элемент)
	
	СуммаБезСкидки = Объект.ПродукцияНоменклатураКоличество * Объект.ПродукцияЦена;
	Объект.ПродукцияСуммаРучнойСкидки = СуммаБезСкидки * Объект.ПродукцияПроцентРучнойСкидки/100;
	Объект.ПродукцияСумма = СуммаБезСкидки - Объект.ПродукцияСуммаРучнойСкидки;
	
	ОбновитьДанныеДокумента();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСуммаРучнойСкидкиПриИзменении(Элемент)
	
	СуммаБезСкидки = Объект.ПродукцияНоменклатураКоличество * Объект.ПродукцияЦена;
	Если СуммаБезСкидки = 0 Тогда
		Объект.ПродукцияПроцентРучнойСкидки = 0;
		Объект.ПродукцияСумма = СуммаБезСкидки;
	Иначе
		Объект.ПродукцияПроцентРучнойСкидки = (Объект.ПродукцияСуммаРучнойСкидки * 100)/СуммаБезСкидки;		
		Объект.ПродукцияСумма = СуммаБезСкидки - Объект.ПродукцияСуммаРучнойСкидки;
	КонецЕсли;
	
	ОбновитьДанныеДокумента();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоПродукции();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьКоличествоПродукцииПоДаннымПостроителяНаСервере()
	
	НомерСимволаНачалаСтроки = СтрНайти(Объект.ДанныеФайлаИмпорта, "КоличествоПродукция");
	Если НомерСимволаНачалаСтроки > 0 Тогда
		НомерСимволаКонцаСтроки = СтрНайти(Объект.ДанныеФайлаИмпорта, Символы.ПС, , НомерСимволаНачалаСтроки);
		Если НомерСимволаКонцаСтроки > 0 Тогда
			СтрокаСКоличеством = Сред(Объект.ДанныеФайлаИмпорта,НомерСимволаНачалаСтроки,НомерСимволаКонцаСтроки-НомерСимволаНачалаСтроки);
			Если НЕ ПустаяСтрока(СтрокаСКоличеством) Тогда
				НомерСимволаРавно = СтрНайти(СтрокаСКоличеством,"=");
				Если НомерСимволаРавно > 0 Тогда
					СтрокаКоличество = СокрЛП(Сред(СтрокаСКоличеством, НомерСимволаРавно+1, СтрДлина(СтрокаСКоличеством)-НомерСимволаРавно));
					Попытка
						Объект.ПродукцияНоменклатураКоличество = СтрЗаменить(СтрокаКоличество," ","");
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьКоличествоПродукцииПоДаннымПостроителя(Команда)
	ВосстановитьКоличествоПродукцииПоДаннымПостроителяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДетализацияВзаиморасчетов(Команда)
	ПараметрыОтчета = Новый Структура("Отбор, СформироватьПриОткрытии", 
                                    Новый Структура("Контрагент", Объект.Контрагент), 
                                    Истина);
	//ПараметрыОтчета = Новый Структура;
	//ПараметрыОтчета.Вставить("Контрагент",Объект.Контрагент);
	ОткрытьФорму("Отчет.ДетализацияВзаиморасчетовСКонтрагентом.Форма",ПараметрыОтчета);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКОтгрузкеИОстаткиПоПродукции()
	
	СкладПараметр = Объект.Склад;
	Если СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции
		 И ОбщийМодульСервер.НастройкаПользователя("ВЗаказеНаПроизводствоПодсветкаОстатковПоСкладуОтгрузки") Тогда
		СкладПараметр = Объект.СкладОтгрузки;		
	КонецЕсли;

	Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
		
		//продукция типового производства
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗЗаказПокупателяТовары.Номенклатура,
		|	ТЗЗаказПокупателяТовары.Количество,
		|	ТЗЗаказПокупателяТовары.Коэффициент
		|ПОМЕСТИТЬ ВремЗаказПокупателяТовары
		|ИЗ
		|	&ТаблицаДокумента КАК ТЗЗаказПокупателяТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
		|			ТОГДА ТоварыНаСкладахОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
		|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
		|	КОНЕЦ КАК ОстатокНаСкладе,
		|	ЕСТЬNULL(ВЫБОР		
		|		КОГДА &ИспользоватьРезервирование
		|			ТОГДА ВЫБОР
		|					КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
		|						ТОГДА ВРезервеОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
		|					ИНАЧЕ ВРезервеОстатки.КоличествоОстаток
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ, 0) КАК КоличествоВРезерве
		|ИЗ
		|	ВремЗаказПокупателяТовары КАК ЗаказПокупателяТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				ВЫБОР
		|						КОГДА &ИспользуютсяОбщиеСклады
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ Организация = &Организация
		|					КОНЕЦ
		|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|		ПО ЗаказПокупателяТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(,
		|				Склад = &Склад
		|					И ВЫБОР
		|						КОГДА &ИспользуютсяОбщиеСклады
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ Организация = &Организация
		|					КОНЕЦ) КАК ВРезервеОстатки
		|		ПО (ЗаказПокупателяТовары.Номенклатура = ВРезервеОстатки.Номенклатура)";
		Запрос.УстановитьПараметр("ТаблицаДокумента",Объект.Продукция.Выгрузить());
		Запрос.УстановитьПараметр("Организация",Объект.Организация);
		Запрос.УстановитьПараметр("Склад", СкладПараметр); //?(НЕ СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции,Объект.Склад,Объект.СкладОтгрузки));
		Запрос.УстановитьПараметр("ЗаказНаПроизводство",Объект.Ссылка);
		Запрос.УстановитьПараметр("ИспользуютсяОбщиеСклады", Константы.ОбщиеСклады.Получить());
		Запрос.УстановитьПараметр("ИспользоватьРезервирование", Константы.ИспользоватьРезервирование.Получить());
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекущаяСтрока Из Объект.Продукция Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",ТекущаяСтрока.Номенклатура);
			НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ТекущаяСтрока.ОстатокНаСкладе = НайденныеСтроки[0].ОстатокНаСкладе;
				ТекущаяСтрока.ВРезерве = НайденныеСтроки[0].КоличествоВРезерве;
				ТекущаяСтрока.Доступно = ТекущаяСтрока.ОстатокНаСкладе - ТекущаяСтрока.ВРезерве;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
		
		//продукция потолка
		//ТаблицаДокумента = Новый ТаблицаЗначений;
		//ТаблицаДокумента.Колонки.Добавить("Номенклатура");
		//ТаблицаДокумента.Колонки.Добавить("Количество");
		//ТаблицаДокумента.Колонки.Добавить("Коэффициент");
		//НоваяСтрока = ТаблицаДокумента.Добавить();
		//НоваяСтрока.Номенклатура = Объект.ПродукцияНоменклатура;
		//НоваяСтрока.Количество = Объект.ПродукцияНоменклатураКоличество;
		//НоваяСтрока.Коэффициент = Объект.ПродукцияНоменклатураКоэффициент;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &Коэффициент <> 0
		|			ТОГДА ТоварыНаСкладахОстатки.КоличествоОстаток / &Коэффициент
		|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
		|	КОНЕЦ КАК ОстатокНаСкладе
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			ВЫБОР
		|					КОГДА &ИспользуютсяОбщиеСклады
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Организация = &Организация
		|				КОНЕЦ
		|				И Номенклатура = &Номенклатура
		|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
		Запрос.УстановитьПараметр("Коэффициент",Объект.ПродукцияНоменклатураКоэффициент);
		Запрос.УстановитьПараметр("Организация",Объект.Организация);
		Запрос.УстановитьПараметр("Склад", СкладПараметр); //?(НЕ СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции,Объект.Склад,Объект.СкладОтгрузки));
		Запрос.УстановитьПараметр("Номенклатура",Объект.ПродукцияНоменклатура);
		Запрос.УстановитьПараметр("ИспользуютсяОбщиеСклады", Константы.ОбщиеСклады.Получить());		
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
			ОстатокНаСкладе = СтрокаРезультат.ОстатокНаСкладе;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам()
	
	СкладПараметр = Объект.Склад;
	Если СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции
		 И ОбщийМодульСервер.НастройкаПользователя("ВЗаказеНаПроизводствоПодсветкаОстатковПоСкладуОтгрузки") Тогда
		СкладПараметр = Объект.СкладОтгрузки;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗЗаказПокупателяТовары.Номенклатура,
	|	ТЗЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ТЗЗаказПокупателяТовары.СерияНоменклатуры,
	|	ТЗЗаказПокупателяТовары.Количество,
	|	ТЗЗаказПокупателяТовары.Коэффициент
	|ПОМЕСТИТЬ ВремЗаказПокупателяТовары
	|ИЗ
	|	&ТаблицаДокумента КАК ТЗЗаказПокупателяТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|			ТОГДА ТоварыНаСкладахОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
	|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
	|	КОНЕЦ КАК ОстатокНаСкладе,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|			ТОГДА ЗаказПокупателяТовары.Количество - ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход,0) / ЗаказПокупателяТовары.Коэффициент
	|		ИНАЧЕ ЗаказПокупателяТовары.Количество - ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход,0)
	|	КОНЕЦ КАК КОтгрузке,
	|	ЕСТЬNULL(ВЫБОР		
	|		КОГДА &ИспользоватьРезервирование
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|						ТОГДА ВРезервеОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
	|					ИНАЧЕ ВРезервеОстатки.КоличествоОстаток
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ, 0) КАК КоличествоВРезерве
	|ИЗ
	|	ВремЗаказПокупателяТовары КАК ЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ
	|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО ЗаказПокупателяТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ЗаказПокупателяТовары.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И ЗаказПокупателяТовары.СерияНоменклатуры = ТоварыНаСкладахОстатки.СерияНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Обороты(, , , ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыПокупателейОбороты
	|		ПО ЗаказПокупателяТовары.Номенклатура = ЗаказыПокупателейОбороты.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(,
	|				Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ) КАК ВРезервеОстатки
	|		ПО (ЗаказПокупателяТовары.Номенклатура = ВРезервеОстатки.Номенклатура)
	|			И (ЗаказПокупателяТовары.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры)
	|			И (ЗаказПокупателяТовары.СерияНоменклатуры = ВРезервеОстатки.СерияНоменклатуры)";
	Запрос.УстановитьПараметр("ТаблицаДокумента",Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Склад", СкладПараметр); //?(НЕ СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции,Объект.Склад,Объект.СкладОтгрузки));
	Запрос.УстановитьПараметр("ЗаказНаПроизводство",Объект.Ссылка);
	Запрос.УстановитьПараметр("ИспользуютсяОбщиеСклады", Константы.ОбщиеСклады.Получить());
	Запрос.УстановитьПараметр("ИспользоватьРезервирование", Константы.ИспользоватьРезервирование.Получить());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",ТекущаяСтрока.Номенклатура);
		Отбор.Вставить("ХарактеристикаНоменклатуры",ТекущаяСтрока.ХарактеристикаНоменклатуры);
		Отбор.Вставить("СерияНоменклатуры",ТекущаяСтрока.СерияНоменклатуры);
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока.КОтгрузке = НайденныеСтроки[0].КОтгрузке;
			ТекущаяСтрока.ОстатокНаСкладе = НайденныеСтроки[0].ОстатокНаСкладе;
			ТекущаяСтрока.ВРезерве = НайденныеСтроки[0].КоличествоВРезерве;
			ТекущаяСтрока.Доступно = ТекущаяСтрока.ОстатокНаСкладе - ТекущаяСтрока.ВРезерве;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОстаткиПоМатериалам()
	
	СкладПараметр = Объект.СкладМатериалов;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗЗаказПокупателяТовары.Номенклатура,
	|	ТЗЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ТЗЗаказПокупателяТовары.СерияНоменклатуры,
	|	ТЗЗаказПокупателяТовары.Количество,
	|	ТЗЗаказПокупателяТовары.Коэффициент
	|ПОМЕСТИТЬ ВремЗаказПокупателяТовары
	|ИЗ
	|	&ТаблицаДокумента КАК ТЗЗаказПокупателяТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|			ТОГДА ТоварыНаСкладахОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
	|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
	|	КОНЕЦ КАК ОстатокНаСкладе,
	|	ЕСТЬNULL(ВЫБОР		
	|		КОГДА &ИспользоватьРезервирование
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|						ТОГДА ВРезервеОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
	|					ИНАЧЕ ВРезервеОстатки.КоличествоОстаток
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ, 0) КАК КоличествоВРезерве
	|ИЗ
	|	ВремЗаказПокупателяТовары КАК ЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ
	|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО ЗаказПокупателяТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(,
	|				Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ) КАК ВРезервеОстатки
	|		ПО (ЗаказПокупателяТовары.Номенклатура = ВРезервеОстатки.Номенклатура)
	|			И (ЗаказПокупателяТовары.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры)
	|			И (ЗаказПокупателяТовары.СерияНоменклатуры = ВРезервеОстатки.СерияНоменклатуры)";
	Запрос.УстановитьПараметр("ТаблицаДокумента",Объект.Материалы.Выгрузить());
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Склад", СкладПараметр); //?(НЕ СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции,ПараметрыСеанса.ТекущийПользователь.СкладМатериалов,Объект.СкладОтгрузки));
	Запрос.УстановитьПараметр("ЗаказНаПроизводство",Объект.Ссылка);
	Запрос.УстановитьПараметр("ИспользуютсяОбщиеСклады", Константы.ОбщиеСклады.Получить());
	Запрос.УстановитьПараметр("ИспользоватьРезервирование", Константы.ИспользоватьРезервирование.Получить());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
		Отбор.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
		Отбор.Вставить("СерияНоменклатуры", ТекущаяСтрока.СерияНоменклатуры);
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока.ОстатокНаСкладе = НайденныеСтроки[0].ОстатокНаСкладе;
			ТекущаяСтрока.ВРезерве = НайденныеСтроки[0].КоличествоВРезерве;
			ТекущаяСтрока.Доступно = ТекущаяСтрока.ОстатокНаСкладе - ТекущаяСтрока.ВРезерве;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяФактураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если НЕ Элементы.ФактураПотолка.ТекущиеДанные = Неопределено Тогда
		Фактура = Элементы.ФактураПотолка.ТекущиеДанные.ПродукцияФактура;
		Цвет = Элементы.ФактураПотолка.ТекущиеДанные.ПродукцияЦвет;
		Если Поле.Имя = "ДополнительнаяФактураПродукцияФактура" Тогда
			Если НЕ Фактура.Пустая() Тогда
				ОткрытьФорму("Справочник.Фактура.ФормаОбъекта",Новый Структура("Ключ", Фактура));
			КонецЕсли;
		ИначеЕсли Поле.Имя = "ДополнительнаяФактураПродукцияЦвет" Тогда
			Если НЕ Цвет.Пустая() Тогда
				ОткрытьФорму("Справочник.ЦветФактуры.ФормаОбъекта",Новый Структура("Ключ", Цвет));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьШиринуФактуры(Фактура)
	Возврат Фактура.ШиринаПолотна;
КонецФункции

&НаКлиенте
Процедура КомандаТиповойОтрез(Команда)
	
	ПараметрыФормы = Новый Структура("РежимДобавленияТиповогоОтреза", Истина);
	Если Объект.ФактураПотолка.Количество() > 0 Тогда
		ПараметрыФормы.Вставить("Фактура",Объект.ФактураПотолка[0].ПродукцияФактура);
		ПараметрыФормы.Вставить("Цвет",Объект.ФактураПотолка[0].ПродукцияЦвет);
		//ПараметрыФормы.Вставить("Количество",0);
		ПараметрыФормы.Вставить("Длина",0);
		//ШиринаПолотна = ПолучитьШиринуФактуры(Объект.ФактураПотолка[0].ПродукцияФактура) / 100;
		ШиринаПолотна = ПолучитьШиринуФактуры(Объект.ФактураПотолка[0].ПродукцияФактура);;
		Если НЕ ШиринаПолотна = 0 Тогда
			//ПараметрыФормы.Вставить("Количество",Окр(Объект.ПродукцияНоменклатураКоличество / ШиринаПолотна,2));
			ПараметрыФормы.Вставить("Длина",Окр(Объект.ПродукцияНоменклатураКоличество*10000 / ШиринаПолотна,2));
		КонецЕсли;
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаПараметровОтреза", ЭтотОбъект, ПараметрыФормы);
	//ОткрытьФорму("Документ.ЗаказНаПроизводство.Форма.ФормаПараметрыТиповогоОтреза",ПараметрыФормы,,,ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаДобавленияПродукции", ПараметрыФормы, ЭтотОбъект, ,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПараметровОтреза(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ФактураПотолка.Очистить();
	НоваяСтрока = Объект.ФактураПотолка.Добавить();
	НоваяСтрока.Основная = Истина;
	НоваяСтрока.ПродукцияФактура = Результат.Фактура;
	НоваяСтрока.ПродукцияЦвет = Результат.Цвет;
	
	//НоваяСтрока.ПродукцияКоличество = Результат.Количество * ПолучитьШиринуФактуры(НоваяСтрока.ПродукцияФактура)/100;	
	//Объект.ПродукцияНоменклатураКоличество = Результат.Количество * ПолучитьШиринуФактуры(НоваяСтрока.ПродукцияФактура)/100;
	//Объект.ПродукцияНомерРасчета = ОбменСEasyCeiling.ПолучитьНомерТиповогоОтреза(СтрЗаменить(Результат.Количество*100,Символ(160),""),ПолучитьШиринуФактуры(НоваяСтрока.ПродукцияФактура));	
	//РезультатСозданияНоменклатуры = СоздатьНоменклатуруТиповогоОтрезаНаСервере();
	//Состояние(РезультатСозданияНоменклатуры);
	
	НоваяСтрока.ПродукцияКоличество = Результат.Количество;	
	Объект.ПродукцияНоменклатураКоличество = Результат.Количество;
	Объект.ПродукцияНомерРасчета = Результат.НомерПотолка;	
	Объект.ПродукцияНоменклатура = Результат.Номенклатура;
	Объект.ПродукцияНоменклатураКоэффициент = 1;
	Объект.ПродукцияНоменклатураЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Объект.ПродукцияНоменклатура);
	
	ЗаполнитьМатериалыТиповогоОтреза();
	ЗаполнитьДанныеОстаткиПоМатериалам();
	Состояние("Таблица материалов перезаполнена");
	
	ОбновитьСписокФайлов();
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыТиповогоОтреза()
	
	Объект.Материалы.Очистить();
	Для Каждого ТекущаяСтрока Из Объект.ФактураПотолка Цикл
		НоваяСтрока = Объект.Материалы.Добавить();
		НоваяСтрока.Номенклатура = ТекущаяСтрока.ПродукцияЦвет.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(НоваяСтрока.Номенклатура);
		НоваяСтрока.Коэффициент = 1;
		Если НоваяСтрока.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.МетрПогонный Тогда
			ШиринаПолотна = ПолучитьШиринуФактуры(ТекущаяСтрока.ПродукцияФактура) / 100;
			Если НЕ ШиринаПолотна = 0 Тогда
				НоваяСтрока.Количество = Окр(Объект.ПродукцияНоменклатураКоличество / ШиринаПолотна,2);
			Иначе
				НоваяСтрока.Количество = 0;
			КонецЕсли;
		Иначе
			НоваяСтрока.Количество = Объект.ПродукцияНоменклатураКоличество;
		КонецЕсли;
		НоваяСтрока.КоличествоКВыработке = НоваяСтрока.Количество;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНоменклатура1ПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура("Номенклатура, ВидСпецификации", СтрокаТабличнойЧасти.Номенклатура, ВидСпецификацииПоУмолчанию);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, Спецификация");
	
	//СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	//СтрокаТабличнойЧасти.Коэффициент = 1;
	СтрокаТабличнойЧасти.Количество = 1;
	//СтрокаТабличнойЧасти.Спецификация = ПолучитьОсновнуюСпецификациюНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	РассчитатьЦенуИСуммуТиповойПродукции(СтрокаТабличнойЧасти);
	
	Если ПустаяСтрока(СтрокаТабличнойЧасти.УИСтроки) Тогда
		СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенуИСуммуТиповойПродукции(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, Неопределено, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	//заккоментирована потому что добавлены скидки по договору
	//СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена;
	
	СуммаБезСкидки = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	Если Объект.СкидкаНаПотолки <> 0 Тогда
		СтрокаТабличнойЧасти.ПроцентРучнойСкидки = Объект.СкидкаНаПотолки;		
		СтрокаТабличнойЧасти.СуммаРучнойСкидки = СуммаБезСкидки * СтрокаТабличнойЧасти.ПроцентРучнойСкидки/100;
	Иначе
		СтрокаТабличнойЧасти.ПроцентРучнойСкидки = 0;
		СтрокаТабличнойЧасти.СуммаРучнойСкидки = 0;		
	КонецЕсли;		
	
	СтрокаТабличнойЧасти.Сумма = СуммаБезСкидки - СтрокаТабличнойЧасти.СуммаРучнойСкидки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоСпецификациямНаСервере()
	
	Объект.Материалы.Очистить();
	
	ВременнаяТаблица = Новый ТаблицаЗначений; //хранит общее количество необходимых материалов по спецификации после округления общего количества товаров
	ВременнаяТаблица.Колонки.Добавить("Номенклатура");
	ВременнаяТаблица.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ВременнаяТаблица.Колонки.Добавить("ОкруглятьВБольшуюСторону");
	ВременнаяТаблица.Колонки.Добавить("ПорядокОкругленияЧислом");
	ВременнаяТаблица.Колонки.Добавить("КоличествоДоОкругления");
	ВременнаяТаблица.Колонки.Добавить("КоличествоПослеОкругления");
	
	ТаблицаМатериалов = Новый ТаблицаЗначений;
	ТаблицаМатериалов.Колонки.Добавить("Номенклатура");
	ТаблицаМатериалов.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаМатериалов.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаМатериалов.Колонки.Добавить("Коэффициент");
	ТаблицаМатериалов.Колонки.Добавить("Количество");
	
	
	Для Каждого ТекущаяСтрока Из Объект.Продукция Цикл
		НоваяСтрока = ТаблицаМатериалов.Добавить();
		Если НЕ ТекущаяСтрока.Спецификация.Пустая() Тогда
			Для Каждого СтрокаСпецификации Из ТекущаяСтрока.Спецификация.Состав Цикл
				КоэффициентИзменения = ?(СтрокаСпецификации.ФиксированноеКоличество, 1, ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент);
				КоличествоКДобавлению = ОбщийМодуль.ОкруглитьЧисло(КоэффициентИзменения * СтрокаСпецификации.Количество,СтрокаСпецификации.ПорядокОкругленияЧислом,СтрокаСпецификации.ОкруглятьВБольшуюСторону); 
				Если КоличествоКДобавлению > 0 Тогда
					НоваяСтрока = ТаблицаМатериалов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСпецификации);
					НоваяСтрока.Количество = КоличествоКДобавлению;
					
					НоваяВремСтрока = ВременнаяТаблица.Добавить();
					НоваяВремСтрока.Номенклатура = СтрокаСпецификации.Номенклатура;
					НоваяВремСтрока.ХарактеристикаНоменклатуры = СтрокаСпецификации.ХарактеристикаНоменклатуры;
					НоваяВремСтрока.ОкруглятьВБольшуюСторону = СтрокаСпецификации.ОкруглятьВБольшуюСторону;
					НоваяВремСтрока.ПорядокОкругленияЧислом = СтрокаСпецификации.ПорядокОкругленияЧислом;
					НоваяВремСтрока.КоличествоДоОкругления = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент * СтрокаСпецификации.Количество;
					НоваяВремСтрока.КоличествоПослеОкругления = 0;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаМатериалов.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент","Количество");
	ВременнаяТаблица.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ОкруглятьВБольшуюСторону, ПорядокОкругленияЧислом", "КоличествоДоОкругления, КоличествоПослеОкругления");
	
	//посчитаем сколько какого материала должно быть итого с применением округления
	Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
		ТекущаяСтрока.КоличествоПослеОкругления = ОбщийМодуль.ОкруглитьЧисло(ТекущаяСтрока.КоличествоДоОкругления,ТекущаяСтрока.ПорядокОкругленияЧислом,ТекущаяСтрока.ОкруглятьВБольшуюСторону);
	КонецЦикла;
	
	//получаем итоговое количество каждого материала после всех округлений
	ВременнаяТаблица.Свернуть("Номенклатура, ХарактеристикаНоменклатуры", "КоличествоПослеОкругления");
	
	//перезаполняем количество в результирующей таблице на основании того, сколько должно было бы получиьтся при общем итоге после округления
	Для Каждого ТекущийМатериал Из ТаблицаМатериалов Цикл
		КоличествоБыло = ТекущийМатериал.Количество;
		ТекущийМатериал.Количество = 0;
		Для Каждого ТекущийИтогМатериала Из ВременнаяТаблица Цикл
			Если ТекущийМатериал.Номенклатура = ТекущийИтогМатериала.Номенклатура Тогда
				Если ТекущийИтогМатериала.КоличествоПослеОкругления >= КоличествоБыло Тогда
					ТекущийМатериал.Количество = КоличествоБыло;
					ТекущийИтогМатериала.КоличествоПослеОкругления = ТекущийИтогМатериала.КоличествоПослеОкругления - КоличествоБыло;
				Иначе
					ТекущийМатериал.Количество = ТекущийИтогМатериала.КоличествоПослеОкругления;
					ТекущийИтогМатериала.КоличествоПослеОкругления = 0;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла
	КонецЦикла;
	
	//переносим таблицу в документ
	Для Каждого ТекущийМатериал Из ТаблицаМатериалов Цикл
		Если НЕ ТекущийМатериал.Количество = 0 Тогда
			НоваяСтрока = Объект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийМатериал);
			НоваяСтрока.КоличествоКВыработке = НоваяСтрока.Количество;
		КонецЕсли;
	КонецЦикла;
	
	//находим в списке материалов типовые отрезы и меняем их на соответствуюущую пленку
	Для Каждого СтрокаМатериала Из Объект.Материалы Цикл
		Если СтрокаМатериала.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ТиповойОтрез Тогда
			НоменклатураОтреза = СтрокаМатериала.Номенклатура;
			КоличествоОтреза = СтрокаМатериала.Количество;
			ЕдиницаИзмеренияОтреза = СтрокаМатериала.ЕдиницаИзмерения;
			
			ВремНоменклатура = Справочники.Номенклатура.ПолучитьОсновнуюФактуруИЦветПотолка(НоменклатураОтреза).ПродукцияЦвет.Номенклатура;
			Если НЕ ВремНоменклатура.Пустая() Тогда
				СтрокаМатериала.Номенклатура = ВремНоменклатура;
				СтрокаМатериала.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаМатериала.Номенклатура);
				СтрокаМатериала.Коэффициент = 1;
				Если СтрокаМатериала.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.МетрПогонный Тогда
					ШиринаПолотна = НоменклатураОтреза.Фактура.ШиринаПолотна / 100;
					Если НЕ ШиринаПолотна = 0 Тогда
						СтрокаМатериала.Количество = Окр(КоличествоОтреза / ШиринаПолотна,2);
					Иначе
						СтрокаМатериала.Количество = 0;
					КонецЕсли;
				Иначе
					СтрокаМатериала.Количество = КоличествоОтреза;
				КонецЕсли;
				СтрокаМатериала.КоличествоКВыработке = КоличествоОтреза;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//++ №14311
	Объект.РучнаяКорректировкаМатериалов = Истина;
	ВремРучнаяКорректировкаМатериалов = Объект.РучнаяКорректировкаМатериалов;
	//-- №14311
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСпецификациям(Команда)
	ЗаполнитьМатериалыПоСпецификациямНаСервере();
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЦена1ПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
	ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКоличество1ПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;	
	ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПроцентРучнойСкидки1ПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
	ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСуммаРучнойСкидки1ПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	Если СуммаБезСкидки = 0 Тогда
		ТекущаяСтрока.ПроцентРучнойСкидки = 0;
		ТекущаяСтрока.Сумма = СуммаБезСкидки;
	Иначе
		ТекущаяСтрока.ПроцентРучнойСкидки = (ТекущаяСтрока.СуммаРучнойСкидки * 100)/СуммаБезСкидки;		
		ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	КонецЕсли;
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСумма1ПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
	СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	Если СуммаБезСкидки = 0 Тогда
		ТекущаяСтрока.СуммаРучнойСкидки = 0;
		ТекущаяСтрока.ПроцентРучнойСкидки = 0;
	Иначе
		ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки - ТекущаяСтрока.Сумма;
		ТекущаяСтрока.ПроцентРучнойСкидки = (ТекущаяСтрока.СуммаРучнойСкидки * 100) / СуммаБезСкидки;  
	КонецЕсли;
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроцентРучнойСкидкиПродукция(Команда)
	ОП = Новый ОписаниеОповещения("ПослеЗапросаПроцентаРучнойСкидки", ЭтотОбъект, "Продукция");
	ПоказатьВводЧисла(ОП, Объект.Продукция[0].ПроцентРучнойСкидки,"Введите % скидки",10,2);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСуммуРучнойСкидкиПродукция(Команда)
	ОП = Новый ОписаниеОповещения("ПослеЗапросаСуммыРучнойСкидки", ЭтотОбъект, "Продукция");
	ПоказатьВводЧисла(ОП, 0,"Введите сумму скидки в каждой строке",10,2);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщийПроцентСкидки(Команда)
	
	ОписаниеПослеВводаОбщегоПроцентаСкидки = Новый ОписаниеОповещения("ПослеВводаОбщегоПроцентаСкидки",ЭтаФорма);
	ПоказатьВводЧисла(ОписаниеПослеВводаОбщегоПроцентаСкидки, 0, "Установить общий % скидки", 2, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаОбщегоПроцентаСкидки(РазмерСкидки, Параметры) Экспорт
    Если НЕ РазмерСкидки = Неопределено Тогда
		
		//продукция типового производства
		Для Каждого ТекущаяСтрока Из Объект.Продукция Цикл
			ТекущаяСтрока.ПроцентРучнойСкидки = РазмерСкидки;
			СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
			ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
		КонецЦикла;
		
		//продукция потолка
		Объект.ПродукцияПроцентРучнойСкидки = РазмерСкидки;
		СуммаБезСкидки = Объект.ПродукцияНоменклатураКоличество * Объект.ПродукцияЦена;
		Объект.ПродукцияСуммаРучнойСкидки = СуммаБезСкидки * Объект.ПродукцияПроцентРучнойСкидки/100;
		Объект.ПродукцияСумма = СуммаБезСкидки - Объект.ПродукцияСуммаРучнойСкидки;
		
		//товары
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
			ТекущаяСтрока.ПроцентРучнойСкидки = РазмерСкидки;
			СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
			ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
		КонецЦикла;
		
		//услуги
		Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
			ТекущаяСтрока.ПроцентРучнойСкидки = РазмерСкидки;
			СуммаБезСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			ТекущаяСтрока.СуммаРучнойСкидки = СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки/100;
			ТекущаяСтрока.Сумма = СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
		КонецЦикла;
	
		ОбновитьДанныеДокумента();

    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НаценкаЗаСрочностьНаСервере()
	
	УслугаСрочность = Константы.СрочностьУслуга.Получить();
	Если УслугаСрочность.Пустая() Тогда
		Возврат "В настройках программы не задана услуга срочности";
	КонецЕсли;
	
	ПроцентСрочность = Константы.СрочностьПроцент.Получить();
	Если ПроцентСрочность = 0 Тогда
		Возврат "В настройках программы не указана стоимость в % за срочность";
	КонецЕсли;
	
	//получим стоимость продукции + товары
	СтоимостьЗаказа = Объект.Продукция.Итог("Сумма") + Объект.ПродукцияСумма + Объект.Товары.Итог("Сумма");
	//получим стоимость услуг без стоимости срочности
	СтрокаСрочность = Неопределено;
	Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
		Если ТекущаяСтрока.Номенклатура = УслугаСрочность Тогда
			СтрокаСрочность = ТекущаяСтрока;
		Иначе
			СтоимостьЗаказа = СтоимостьЗаказа + ТекущаяСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ СтрокаСрочность = Неопределено Тогда
		СтрокаСрочность.ЕдиницаИзмерения = СтрокаСрочность.Номенклатура.БазоваяЕдиницаИзмерения;
		СтрокаСрочность.Количество = 1;
		СтрокаСрочность.Коэффициент = 1;
		СтрокаСрочность.Цена = СтоимостьЗаказа * ПроцентСрочность / 100;
		СтрокаСрочность.Сумма = СтрокаСрочность.Цена;
		Результат = "Стоимость за срочность обновлена";
	Иначе
		НоваяСтрока = Объект.Услуги.Добавить();
		НоваяСтрока.Номенклатура = УслугаСрочность;
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Коэффициент = 1;
		НоваяСтрока.Цена = СтоимостьЗаказа * ПроцентСрочность / 100;
		НоваяСтрока.Сумма = НоваяСтрока.Цена;
		Результат = "Установлена стоимость за срочность";
	КонецЕсли;
	
	ОбновитьДанныеДокумента();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НаценкаЗаСрочность(Команда)
	Результат = НаценкаЗаСрочностьНаСервере();
	ПоказатьПредупреждение(,Результат);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
КонецПроцедуры

//ФУНКЦИИ РАБОТЫ С ТАБЛИЦОЙ ФАЙЛЫ
&НаСервере
Процедура ОбновитьСписокФайлов()
	
	Файлы.Очистить();
	
	СписокНоменклатуры = Новый СписокЗначений;
	Если ЗначениеЗаполнено(Объект.ПродукцияНоменклатура) Тогда
		СписокНоменклатуры.Добавить(Объект.ПродукцияНоменклатура);
	КонецЕсли;
	 
	Для Каждого Строка Из Объект.Продукция Цикл
		СписокНоменклатуры.Добавить(Строка.Номенклатура);
	КонецЦикла;
	
	Для Каждого Строка Из Объект.Товары Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Строка.Номенклатура) Тогда
			СписокНоменклатуры.Добавить(Строка.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК Номенклатура,
	|	ПрикрепленныеДанные.ИмяФайла,
	|	ПрикрепленныеДанные.Расширение,
	|	ПрикрепленныеДанные.ИмяФайла + ""."" + ПрикрепленныеДанные.Расширение КАК НаименованиеФайла,
	|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя,
	|	ПрикрепленныеДанные.Период КАК ДатаПрикрепления
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект В(&СсылкаНаОбъект)";
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СписокНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Файлы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Если Файлы.Количество() > 0 Тогда
		Элементы.ТаблицаФайлы.Заголовок = "Файлы (" + Файлы.Количество() + ")";
	Иначе
		Элементы.ТаблицаФайлы.Заголовок = "Файлы";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные(СсылкаНаОбъект, ИмяФайла)
	
	Возврат ОбщийМодульВызовСервера.ПолучитьДанныеФайла(СсылкаНаОбъект, ИмяФайла, , ЭтаФорма.УникальныйИдентификатор);	
		
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ПрикрепленныеДанные.Данные
	//|ИЗ
	//|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	//|ГДЕ
	//|	ПрикрепленныеДанные.СсылкаНаОбъект = &Ссылка
	//|	И ПрикрепленныеДанные.ИмяФайла = &ИмяФайла";
	//Запрос.УстановитьПараметр("Ссылка",	  СсылкаНаОбъект);
	//Запрос.УстановитьПараметр("ИмяФайла", ИмяФайла);
	//
	//Данные = Неопределено;
	//Выборка = Запрос.Выполнить().Выгрузить();
	//Если Выборка.Количество() > 0 тогда
	//	Данные = Выборка[0].Данные.Получить();
	//КонецЕсли;
	// 
	//Возврат ПоместитьВоВременноеХранилище(Данные, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	АдресФайла = ПолучитьДанные(Элементы.Файлы.ТекущиеДанные.Номенклатура, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	ВременноеИмя=ПолучитьИмяВременногоФайла(Элементы.Файлы.ТекущиеДанные.Расширение);
    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	СписокПотолков = ПолучитьСписокПотолков();
	Если НЕ СписокПотолков.Количество() = 0 Тогда
		Оп = Новый ОписаниеОповещения("ВыборПотолкаДляПрикрепленияФайла", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оп, СписокПотолков, Элементы.ФайлыДобавитьФайл);
	Иначе
		ПоказатьПредупреждение(,"В продукции и товарах нет потолков и отрезов");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПотолков()
	
	СписокНоменклатуры = Новый СписокЗначений;
	Если ЗначениеЗаполнено(Объект.ПродукцияНоменклатура) Тогда
		СписокНоменклатуры.Добавить(Объект.ПродукцияНоменклатура);
	КонецЕсли;
	 
	Для Каждого Строка Из Объект.Продукция Цикл
		Если СписокНоменклатуры.НайтиПоЗначению(Строка.Номенклатура) = Неопределено Тогда 
			СписокНоменклатуры.Добавить(Строка.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из Объект.Товары Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Строка.Номенклатура)
			 И СписокНоменклатуры.НайтиПоЗначению(Строка.Номенклатура) = Неопределено Тогда
			СписокНоменклатуры.Добавить(Строка.Номенклатура);
		КонецЕсли;
	КонецЦикла;

	Возврат СписокНоменклатуры;	
КонецФункции

&НаКлиенте
Процедура ВыборПотолкаДляПрикрепленияФайла(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ДействиеПослеПрикрепления", ОписаниеОповещения);
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(ВыбранныйЭлемент.Значение, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрикрепленияФайлаЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРезультата.Результат Тогда
		ОбновитьДанныеДокумента();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьФайл(Команда)
	
	ВыбранныеЭлементы = Элементы.Файлы.ВыделенныеСтроки;
	
	Если ВыбранныеЭлементы.Количество() > 0 Тогда
		
		Для каждого ЭлементДляПечати из ВыбранныеЭлементы Цикл
			
			СтрФайл = Файлы.НайтиПоИдентификатору(ЭлементДляПечати);
			
			АдресФайла = ПолучитьДанные(СтрФайл.Номенклатура, СтрФайл.ИмяФайла);
			ВременноеИмя = ПолучитьИмяВременногоФайла(СтрФайл.Расширение);
			ПолучитьФайл(АдресФайла, ВременноеИмя, Ложь);
			
			Shell = Новый COMОбъект("Shell.Application");
			Shell.ShellExecute(ВременноеИмя, "", "", "print", 0);
			
		КонецЦикла;
		
		УстановитьГалочкуНачалиПроизводство();
		
	Иначе
		
		ПоказатьПредупреждение(,"Выберите файл(ы) в списке");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВСтатусВПроизводстве(Команда)
				
	Если Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.ВПроизводстве") Тогда
		Состояние("Документ находится в статусе ""В производстве""!");
		Возврат;
	КонецЕсли;
	Если Не Объект.Проведен Тогда
		ПоказатьПредупреждение(,"Перед изменением статуса документа, его следует провести");
		Возврат;
	КонецЕсли;
			
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПереводеВПроизводство", ЭтаФорма);
	ПоказатьВопрос(Оповещение, 
			"Перевести выбранные заказы в статус ""В производстве""?"+Символы.ПС+"Документ будет автоматически сохранен после смены статуса.",
			РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПереводеВПроизводство(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Да Тогда
        ПеревестиВСтатусВПроизводствеНаСервере();
		Оповестить("ЗаписанЗаказНаПроизводство",Объект.ДокументОснование,"ЗаказНаПроизводство");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеревестиВСтатусВПроизводствеНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство 
		ИЛИ Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
		Если ДокументОбъект.ПроверитьЗаполнение() Тогда
			ДокументОбъект.ТекущийСтатус = Справочники.СтатусыЗаказовНаПроизводство.ВПроизводстве;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВСтатусПроизведен(Команда)
	СозданиеНаОснованииПотолкиКлиент.ВыпускПродукцииСоздатьНаОснованииЗаказаНаПроизводство(Объект.Ссылка, Неопределено);
КонецПроцедуры

//++ #14923 закомментировано
//&НаКлиенте
//Процедура ПеревестиВСтатусПроизведен(Команда)
//	
//	Если Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Произведен") Тогда
//		Состояние("Документ находится в статусе ""Произведен""!");
//		Возврат;
//	КонецЕсли;
//	Если Не Объект.Проведен ИЛИ Модифицированность Тогда
//		ПоказатьПредупреждение(,"Перед изменением статуса документа, его следует провести");
//		Возврат;
//	КонецЕсли;
//	Если НЕ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.ВПроизводстве") Тогда
//		ПоказатьПредупреждение(,"В статус ""Произведен"" можно перевести только заказ из статуса ""В производстве""");
//		Возврат;
//	КонецЕсли;
//	
//	Если Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка") 
//		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
//		И НЕ Объект.ДокументОснование.Пустая() Тогда
//		
//		СтруктураПроверки = ОбщийМодуль.ЗаказНаПроизводствоСоответствуетЗаказуПокупателя(Объект.Ссылка, Объект.ДокументОснование); 
//		Если НЕ СтруктураПроверки.Результат Тогда
//			Если СтруктураПроверки.ЕстьПотолок Тогда
//				Если НЕ ТолькоПросмотр Тогда
//					ПеревестиФормуВТолькоПросмотр(Истина);
//					
//					ПараметрыФормыПросмотраРазличий = Новый Структура;
//					ПараметрыФормыПросмотраРазличий.Вставить("ДоступноИзменениеПриНаличииВыпуска", СтруктураПроверки.ДоступноИзменениеПриНаличииВыпуска); //#13200
//					
//					Оп = Новый ОписаниеОповещения("НачалоПерезаполненияЗаказаНаПроизводствоПоОснованию", ЭтаФорма);
//					ПоказатьВопрос(Оп,"Сведения по потолку и его производственным услугам в заказе покупателя, являющемся основанием, отличаются от данных в этом заказе на производство.
//					|Необходимо предварительно перезаполнить текущий заказ на производство по документу-основанию.
//					|Выполнить перезаполнение заказа на производство (документ будет автоматически записан)?", РежимДиалогаВопрос.ДаНет);
//				Иначе
//					Сообщить("Сведения по потолку и его производственным услугам в заказе покупателя, являющемся основанием, отличаются от данных в этом заказе на производство!");
//				КонецЕсли;
//			Иначе
//				Сообщить("В заказе покупателя (основании) отсутствует данный потолок!");
//			КонецЕсли;
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;
//		
//	//Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПереводеПроизведен", ЭтаФорма); - убрали вопрос
//	//ПоказатьВопрос(Оповещение, 
//	//		"Перевести выбранные заказы в статус ""Произведен""?"+Символы.ПС+"Документ будет автоматически сохранен после смены статуса.",
//	//		РежимДиалогаВопрос.ДаНет);
//	ПеревестиЗаказВСтатусПроизведен();
//		
//КонецПроцедуры

//&НаКлиенте
//Процедура ПеревестиЗаказВСтатусПроизведен()
//	
//	//Если Результат = КодВозвратаДиалога.Нет Тогда
//	//    Возврат;
//	//КонецЕсли;
//	
//	СсылкаНаЗаказНаПроизводство = Объект.Ссылка;
//	СсылкаНаДокументВыпуска = НайтиДокументВыпускаПродукцииПередПереводомСтатуса(СсылкаНаЗаказНаПроизводство);
//	
//	Если СсылкаНаДокументВыпуска = ПредопределенноеЗначение("Документ.ВыпускПродукции.ПустаяСсылка") Тогда
//		//если не нашли проведенный документ выпуска, попробуем найти созданный но не проведенный.
//		СсылкаНаДокументВыпуска = ЕстьНеПроведенныйДокументВыпускаПоЭтомуЗаказу(СсылкаНаЗаказНаПроизводство); 
//		ПараметрыНовогоДокумента = Новый Структура;
//		ПараметрыНовогоДокумента.Вставить("Основание", СсылкаНаЗаказНаПроизводство);				
//		ПараметрыНовогоДокумента.Вставить("Ключ", СсылкаНаДокументВыпуска);
//		ПараметрыОповещенияПослеЗакрытия = Новый Структура;
//		ПараметрыОповещенияПослеЗакрытия.Вставить("Дата", Объект.Дата);
//		ПараметрыОповещенияПослеЗакрытия.Вставить("Номер", Объект.Номер);
//		ПараметрыОповещенияПослеЗакрытия.Вставить("Основание", СсылкаНаЗаказНаПроизводство);
//		ПараметрыОповещенияПослеЗакрытия.Вставить("Ключ", СсылкаНаДокументВыпуска);
//		ОткрытьФорму("Документ.ВыпускПродукции.Форма.ФормаДокумента", ПараметрыНовогоДокумента,,,,,Новый ОписаниеОповещения("ПослеСозданияДокументаВыпуска",ЭтаФорма,ПараметрыОповещенияПослеЗакрытия));
//	Иначе
//		//проверим, существующий заказ на производство соответсвует выпуску?
//		Если ВыпускСоответствуетЗаказу(СсылкаНаДокументВыпуска, СсылкаНаЗаказНаПроизводство) Тогда
//			ПараметрыОповещенияПослеЗакрытия = Новый Структура;
//			ПараметрыОповещенияПослеЗакрытия.Вставить("Дата", Объект.Дата);
//			ПараметрыОповещенияПослеЗакрытия.Вставить("Номер", Объект.Номер);
//			ПараметрыОповещенияПослеЗакрытия.Вставить("Основание", СсылкаНаЗаказНаПроизводство);				
//			ПараметрыОповещенияПослеЗакрытия.Вставить("Ключ", СсылкаНаДокументВыпуска);
//			ПослеСозданияДокументаВыпуска(Неопределено, ПараметрыОповещенияПослеЗакрытия);
//		Иначе
//			//предлагаем перезаполнить выпуск
//			ПараметрыНовогоДокумента = Новый Структура;
//			ПараметрыНовогоДокумента.Вставить("Ключ", СсылкаНаДокументВыпуска);
//			ПараметрыНовогоДокумента.Вставить("Основание", СсылкаНаЗаказНаПроизводство);				
//			ПараметрыНовогоДокумента.Вставить("Перезаполнить", Истина);
//			ПараметрыНовогоДокумента.Вставить("Дата", Объект.Дата);
//			ПараметрыНовогоДокумента.Вставить("Номер", Объект.Номер);
//			
//			ПослеВопросаОПерезаполнении = Новый ОписаниеОповещения("ПослеВопросаОПерезаполненииВыпуска", ЭтаФорма, ПараметрыНовогоДокумента);
//			ПоказатьВопрос(ПослеВопросаОПерезаполнении, "На основании данного заказа уже оформлен выпуск продукции, но он не соответствует заказу. Перезаполнить существующий выпуск?",РежимДиалогаВопрос.ДаНет);
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Функция НайтиДокументВыпускаПродукцииПередПереводомСтатуса(СсылкаНаЗаказНаПроизводство)
//	
//	Результат = Документы.ВыпускПродукции.ПустаяСсылка();
//	
//	Если СсылкаНаЗаказНаПроизводство.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
//		//подберем последний документ выпуска продукции по данному заказу на производство
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	ЗаказыНаПроизводствоОбороты.Регистратор
//		|ИЗ
//		|	РегистрНакопления.ЗаказыНаПроизводство.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыНаПроизводствоОбороты
//		|ГДЕ
//		|	ЗаказыНаПроизводствоОбороты.КоличествоРасход > 0
//		|	И ЗаказыНаПроизводствоОбороты.ЗаказНаПроизводство.ПродукцияНоменклатура = &ПродукцияНоменклатура";
//		Запрос.УстановитьПараметр("ЗаказНаПроизводство",СсылкаНаЗаказНаПроизводство);
//		Запрос.УстановитьПараметр("ПродукцияНоменклатура",СсылкаНаЗаказНаПроизводство.ПродукцияНоменклатура);
//		
//		Выборка = Запрос.Выполнить().Выбрать();
//		Пока Выборка.Следующий() Цикл
//			ВыпускПродукции = Выборка.Регистратор;
//			Результат = Выборка.Регистратор;
//		КонецЦикла;
//	Иначе
//		//подберем последний документ выпуска продукции по данному заказу на производство
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	ЗаказыНаПроизводствоОбороты.Регистратор
//		|ИЗ
//		|	РегистрНакопления.ЗаказыНаТиповоеПроизводство.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыНаПроизводствоОбороты
//		|ГДЕ
//		|	ЗаказыНаПроизводствоОбороты.КоличествоРасход > 0";
//		Запрос.УстановитьПараметр("ЗаказНаПроизводство",СсылкаНаЗаказНаПроизводство);
//		
//		Выборка = Запрос.Выполнить().Выбрать();
//		Пока Выборка.Следующий() Цикл
//			ВыпускПродукции = Выборка.Регистратор;
//			Результат = Выборка.Регистратор;
//		КонецЦикла;
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции

//&НаСервере
//Функция ЕстьНеПроведенныйДокументВыпускаПоЭтомуЗаказу(СсылкаНаЗаказНаПроизводство)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ВыпускПродукции.Ссылка
//	|ИЗ
//	|	Документ.ВыпускПродукции КАК ВыпускПродукции
//	|ГДЕ
//	|	ВыпускПродукции.Основание = &СсылкаНаЗаказНаПроизводство
//	|	И НЕ ВыпускПродукции.ПометкаУдаления
//	|	И НЕ ВыпускПродукции.Проведен";
//	Запрос.УстановитьПараметр("СсылкаНаЗаказНаПроизводство",СсылкаНаЗаказНаПроизводство);
//	РезультатЗапроса = Запрос.Выполнить();
//	Если РезультатЗапроса.Пустой() Тогда 
//		Возврат Документы.ВыпускПродукции.ПустаяСсылка();
//	Иначе
//		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
//		Пока ВыборкаЗапроса.Следующий() Цикл
//			Возврат ВыборкаЗапроса.Ссылка;
//		КонецЦикла;
//	КонецЕсли;
//	
//КонецФункции

//&НаСервере
//Функция ВыпускСоответствуетЗаказу(Выпуск, Заказ)
//	
//	Если Заказ.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
//		Если Выпуск.ПродукцияНоменклатура = Заказ.ПродукцияНоменклатура
//			и Выпуск.ПродукцияНомерРасчета = Заказ.ПродукцияНомерРасчета Тогда
//			Возврат Истина;
//		Иначе
//			Возврат Ложь;
//		КонецЕсли;
//	Иначе
//		ТаблицаВыпуска = Выпуск.Продукция.Выгрузить();
//		ТаблицаВыпуска.Свернуть("Номенклатура, ЕдиницаИзмерения","Количество");
//		ТаблицаВыпуска.Сортировать("Номенклатура Возр, ЕдиницаИзмерения Возр, Количество Возр");
//		ТаблицаЗаказа = Заказ.Продукция.Выгрузить();
//		ТаблицаЗаказа.Свернуть("Номенклатура, ЕдиницаИзмерения","Количество");
//		ТаблицаЗаказа.Сортировать("Номенклатура Возр, ЕдиницаИзмерения Возр, Количество Возр");
//		Если НЕ ТаблицаВыпуска.Количество() = ТаблицаЗаказа.Количество() Тогда
//			Возврат Ложь;
//		Иначе
//			Для НомерСтроки = 0 По ТаблицаВыпуска.Количество()-1 Цикл
//				Если НЕ ТаблицаВыпуска[НомерСтроки].Номенклатура = ТаблицаЗаказа[НомерСтроки].Номенклатура
//					ИЛИ НЕ ТаблицаВыпуска[НомерСтроки].ЕдиницаИзмерения = ТаблицаЗаказа[НомерСтроки].ЕдиницаИзмерения
//					ИЛИ НЕ ТаблицаВыпуска[НомерСтроки].Количество = ТаблицаЗаказа[НомерСтроки].Количество Тогда
//						Возврат Ложь;
//				КонецЕсли;
//			КонецЦикла;
//		КонецЕсли;
//		ВозВрат Истина;
//	КонецЕсли;
//	
//КонецФункции

//&НаКлиенте
//Процедура ПослеСозданияДокументаВыпуска(Результат, Параметры) Экспорт
//	
//	Заказ = Параметры.Основание;
//	Выпуск = НайтиДокументВыпускаПродукцииПередПереводомСтатуса(Параметры.Основание);
//	
//	Если Выпуск = Неопределено или Выпуск = ПредопределенноеЗначение("Документ.ВыпускПродукции.ПустаяСсылка") Тогда
//		ПоказатьПредупреждение(,"Перевод в статус ""Произведен"" отменен - нет документа выпуска");
//	ИначеЕсли ВыпускСоответствуетЗаказу(Выпуск, Заказ) Тогда
//		ПослеСозданияДокументаВыпускаНаСервере();
//		ЗаполнитьДанныеКОтгрузкеИОстаткиПоПродукции();
//		ЗаполнитьДанныеОстаткиПоМатериалам();
//		Оповестить("ЗаписанЗаказНаПроизводство",Объект.ДокументОснование,"ЗаказНаПроизводство");
//	Иначе
//		ПоказатьПредупреждение(,"Заказ на производство не может быть переведен в статус ""Произведен"", т.к. выпуск не полностью соответствует заказу");
//	КонецЕсли;
//				
//КонецПроцедуры

//&НаСервере
//Процедура ПослеСозданияДокументаВыпускаНаСервере()
//	ДокументОбъект = РеквизитФормыВЗначение("Объект");
//	
//	Если Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка 
//		ИЛИ Объект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
//		Если ДокументОбъект.ПроверитьЗаполнение() Тогда
//			//НАЧАЛО: Переход на 2.0
//			//Если Объект.НастройкаИнтеркампани.ПередачаПотолковВРозницуБезПродажи Тогда
//			//	ДокументОбъект.ТекущийСтатус = Справочники.СтатусыЗаказовНаПроизводство.Отгружен;
//			//Иначе
//				ДокументОбъект.ТекущийСтатус = Справочники.СтатусыЗаказовНаПроизводство.Произведен;
//			//КонецЕсли;
//			//КОНЕЦ: Переход на 2.0
//			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);		
//			
//			//сформируем электронное письмо
//			Если РаботаСЭлектроннойПочтой.ОтправлятьEMailКонтрагентуПриПереводеЗаказаНаПроизводствоВСтатусПроизведен() Тогда
//				СсылкаНаЭлектронноеПисьмо = Документы.ЗаказНаПроизводство.СформироватьЭлектронноеПисьмоКонтрагентуОПереводеВСтатусПроизведен(ДокументОбъект.Ссылка);
//				Если НЕ СсылкаНаЭлектронноеПисьмо.Пустая() Тогда
//					РезультатОтправки = Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(СсылкаНаЭлектронноеПисьмо);
//					Если НЕ ПустаяСтрока(РезультатОтправки) Тогда
//						Сообщить("Ошибка отправки электронного письма контрагенту: " + РезультатОтправки);
//					КонецЕсли;
//				КонецЕсли;
//			КонецЕсли
//		КонецЕсли;
//	КонецЕсли;
//	
//	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
//КонецПроцедуры
//-- #14923

&НаСервере
Функция ПроверитьПоступлениеТоваровПоТоварамМожноПереводить()
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 	|   ЗаказНаПроизводство.Номенклатура,
		|   ЕСТЬNULL(ЗаказНаПроизводство.Количество, 0) КАК Оформлено,
		|	ЕСТЬNULL(ПоступлениеТоваров.Количество, 0) КАК Поступило		
		|ИЗ	
		|   Документ.ЗаказНаПроизводство.Товары КАК ЗаказНаПроизводство
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваров		
		|ПО ЗаказНаПроизводство.Ссылка = ПоступлениеТоваров.Ссылка.Основание
		|	И ЗаказНаПроизводство.Номенклатура = ПоступлениеТоваров.Номенклатура
		|
		|ГДЕ ЗаказНаПроизводство.Ссылка = &ЗаказНаПроизводство";
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ПеревестиСтатус = Истина;
	Пока Выборка.Следующий() Цикл
		 Если (Выборка.Оформлено - Выборка.Поступило) > 0 Тогда			
			ПеревестиСтатус = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ПеревестиСтатус;
	 
КонецФункции

&НаСервере
Функция ПолучитьДокументОснование(Заказ)
	
	Результат = Неопределено;
	
	Попытка
		Результат = Заказ.ДокументОснование;
	Исключение
		Результат = Неопределено
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДокументПродажиОформленНаВсеТовары(Ссылка)
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		СписокЗаказов = Новый СписокЗначений;
		СписокЗаказов.Добавить(Ссылка);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СписокЗначений") Тогда
		СписокЗаказов = Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейОстатки.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказНаПроизводство В (&ЗаказНаПроизводство)) КАК ЗаказыПокупателейОстатки";
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", СписокЗаказов);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

&НаСервере 
Функция ЕстьДокументПродажиПоЗаказу(Ссылка)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыНаПроизводствоОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыНаПроизводствоОбороты
	|ГДЕ
	|	ЗаказыНаПроизводствоОбороты.КоличествоРасход > 0";
	Запрос.УстановитьПараметр("ЗаказНаПроизводство",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Истина;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПеревестиВСтатусОтменен(Команда)

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОтменеЗаказа", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Перевести заказ на производство в статус ""ОТМЕНЕН""?"+Символы.ПС+"Документ будет автоматически записан после смены статуса",РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОтменеЗаказа(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ПеревестиВСтатусОтмененНаСервере();
	Оповестить("ЗаписанЗаказНаПроизводство",Объект.ДокументОснование,"ЗаказНаПроизводство");

КонецПроцедуры

&НаСервере
Процедура ПеревестиВСтатусОтмененНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ДокументОбъект.ПроверитьЗаполнение() Тогда
		ДокументОбъект.ТекущийСтатус = Справочники.СтатусыЗаказовНаПроизводство.Отменен;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитеЦеныНаУслугиРаскроя(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", ПолучитьВидЦенРаскрояПоВидуЦен());
	ОткрытьФорму("Справочник.ЦеныУслугРаскроя.ФормаОбъекта",Отбор);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидЦенРаскрояПоВидуЦен()
	
	ДатаЦены = ?(НЕ Объект.Дата = Дата(1,1,1), Объект.Дата, ТекущаяДатаСеанса());
	Возврат Справочники.ЦеныУслугРаскроя.ПолучитьВидЦенНаУслугиПроизводства(ДатаЦены, Объект.Валюта, Справочники.ВидыНоменклатуры.Потолок, Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен, Объект.ВидЦен);
	
КонецФункции // ПолучитьВидЦенРаскрояПоВидуЦен()

&НаКлиенте
Процедура ПродукцияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоПродукции();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПослеУдаления(Элемент)
	ОбновитьСписокФайлов();
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	Если НЕ ВключитьПредпросмотрФайлов ИЛИ Элементы.Файлы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если мПредыдущийИдентификатор = Элементы.Файлы.ТекущиеДанные.ПолучитьИдентификатор() Тогда
		Возврат;
	Иначе
		мПредыдущийИдентификатор = Элементы.Файлы.ТекущиеДанные.ПолучитьИдентификатор();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияФайлыПриАктивизацииСтроки", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияФайлыПриАктивизацииСтроки()
	
	Если Элементы.Файлы.ТекущиеДанные.Номенклатура.Пустая() Тогда
		АдресФайла = ПолучитьДанные(Объект.Ссылка, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	Иначе
		АдресФайла = ПолучитьДанные(Элементы.Файлы.ТекущиеДанные.Номенклатура, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	КонецЕсли;
	
	ОбщийМодульКлиент.ПредпросмотрФайла(АдресФайла, Элементы.Файлы.ТекущиеДанные.Расширение, Предпросмотр, Элементы.Предпросмотр);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРулонПоНомеру(Команда)
	
	Перем ВыбЗнач;
	Массив = Новый Массив;
	//Массив.Добавить(Тип("Число"));
	//КЧ = Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный);
	//ОписаниеТипов = Новый ОписаниеТипов(Массив, КЧ);
	Массив.Добавить(Тип("Строка"));
	КС = Новый КвалификаторыСтроки(150);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНомераРулона", ЭтаФорма, Параметры);
	//ПоказатьВводЗначения(Оповещение, ВыбЗнач, "Введите номер рулона", ОписаниеТипов);
	ТекстЗаголовкаОкнаВвода = "Введите наименование рулона (серии номенклатуры)" + Символы.ПС + "или отсканируйте его штрих-код";
	ПоказатьВводЗначения(Оповещение, ВыбЗнач, ТекстЗаголовкаОкнаВвода, ОписаниеТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНомераРулона(НаименованиеСерии, Параметры) Экспорт
	
	Если НаименованиеСерии<>Неопределено Тогда
		ДобавитьВМатериалыРулонПоНомеру(НаименованиеСерии);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВМатериалыРулонПоНомеру(Знач НаименованиеСерии)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СерииНоменклатуры.Владелец,
	|	СерииНоменклатуры.Ссылка,
	|	СерииНоменклатуры.Владелец.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Наименование = &Наименование
	|	И СерииНоменклатуры.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Наименование", НаименованиеСерии); //СтрЗаменить(НомерРулона,Символ(160),""));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Материалы.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Владелец;
		НоваяСтрока.СерияНоменклатуры = Выборка.Ссылка;
		НоваяСтрока.ЕдиницаИзмерения = Выборка.БазоваяЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = 1;
		
		//проверим характеристики. если только одна - укажем ее тоже
		ЗапросХарактеристики = Новый Запрос;
		ЗапросХарактеристики.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХарактеристикиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ";
		ЗапросХарактеристики.УстановитьПараметр("Владелец",Выборка.Владелец);
		ВыборкаХарактеристики = ЗапросХарактеристики.Выполнить().Выгрузить();
		Если ВыборкаХарактеристики.Количество() = 1 Тогда
			НоваяСтрока.ХарактеристикаНоменклатуры = ВыборкаХарактеристики[0].Ссылка;
		КонецЕсли;
		
		//++ №14311
		Объект.РучнаяКорректировкаМатериалов = Истина;
		ВремРучнаяКорректировкаМатериалов = Объект.РучнаяКорректировкаМатериалов;
		//-- №14311
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СделаноИзОстатков(Команда)
	
	Если Объект.Материалы.Количество() > 0 Тогда
		ВремПарам = Новый Структура("ЭтоОстаток",Истина);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаменеПолотен",ЭтаФорма, ВремПарам) ,"Заменить полотна на ""Остаток""?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ДобавитьОстатокВМатериалы(Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗаменеПолотен(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
        ДобавитьОстатокВМатериалы(Истина, Параметры.ЭтоОстаток);
	Иначе
		ДобавитьОстатокВМатериалы(Ложь, Параметры.ЭтоОстаток);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьОстатокВМатериалы(ЗаменитьПолотна = Ложь, Знач ЭтоОстаток = Истина)
	
	ОбщийМодульСервер.ИзменитьПолотнаВМатериалах(Объект, ЗаменитьПолотна, ЭтоОстаток);
	Модифицированность = Истина;
	
	//Если ЭтоОстаток Тогда
	//	НоваяНоменклатура = Справочники.Номенклатура.ОстаткиПленки;
	//Иначе
	//	НоваяНоменклатура = Справочники.Номенклатура.ПолотноЗаказчика;
	//КонецЕсли;
	//
	//Если ЗаменитьПолотна Тогда
	//	Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
	//		Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
	//			
	//			СтараяНоменклатура = ТекущаяСтрока.Номенклатура;

	//			ТекущаяСтрока.Номенклатура = НоваяНоменклатура;
	//			ТекущаяСтрока.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
	//			ТекущаяСтрока.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	//			
	//			//2018-11-01
	//			Если ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмерения) Тогда
	//				Если ТекущаяСтрока.ЕдиницаИзмерения	= СтараяНоменклатура.БазоваяЕдиницаИзмерения Тогда
	//					ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
	//				Иначе
	//					ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.АльтернативнаяЕдиницаИзмерения;
	//				КонецЕсли;
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//	КонецЦикла;
	//Иначе
	//	НоваяСтрока = Объект.Материалы.Добавить();
	//	НоваяСтрока.Номенклатура = НоваяНоменклатура;
	//	НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
	//	НоваяСтрока.Коэффициент = 1;
	//КонецЕсли;
	
	//++ №14311
	Объект.РучнаяКорректировкаМатериалов = Истина;
	ВремРучнаяКорректировкаМатериалов = Объект.РучнаяКорректировкаМатериалов;
	//-- №14311
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОстаткиПленки(Команда)
	
	Если Объект.Материалы.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаменеПолотенНаОстатокПоштучно",ЭтаФорма) ,"Заменить полотна на ""Остаток""?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ВызватьДиалогПодбораОстатков(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗаменеПолотенНаОстатокПоштучно(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
        ВызватьДиалогПодбораОстатков(Истина);
	Иначе
		ВызватьДиалогПодбораОстатков(Ложь);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВызватьДиалогПодбораОстатковНаСервере(ЗаменитьПолотнаВДокументе, ВозвращенноеЗначение)
	
	ВременнаяТаблица = Новый ТаблицаЗначений;
	ВременнаяТаблица.Колонки.Добавить("Номенклатура");
	ВременнаяТаблица.Колонки.Добавить("Количество");
	ВременнаяТаблица.Колонки.Добавить("ЕдиницаИзмерения");
	ВременнаяТаблица.Колонки.Добавить("Коэффициент");
	ВременнаяТаблица.Колонки.Добавить("Цена");
	ВременнаяТаблица.Колонки.Добавить("Сумма");
	ВременнаяТаблица.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ВременнаяТаблица.Колонки.Добавить("Фактура");
	ВременнаяТаблица.Колонки.Добавить("Цвет");
	ВременнаяТаблица.Колонки.Добавить("НоменклатураКЗамене", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	Для Каждого ТекСтрока Из ВозвращенноеЗначение Цикл
		НоваяСтрока = ВременнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	
	
	Для Каждого ТекМатериал Из Объект.Материалы Цикл
		Если ТекМатериал.Номенклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Полотно") Тогда
			Для Каждого ТекОстаток Из ВременнаяТаблица Цикл
				Если ТекОстаток.НоменклатураКЗамене.Пустая() Тогда
					ТекОстаток.НоменклатураКЗамене = ТекМатериал.Номенклатура;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока из ВременнаяТаблица Цикл
		Если ТекущаяСтрока.НоменклатураКЗамене.Пустая() Тогда
			НоваяСтрока = Объект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		Иначе
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", ТекущаяСтрока.НоменклатураКЗамене);
			НайденныеСтроки = Объект.Материалы.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], ТекущаяСтрока);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//++ №14311
	Объект.РучнаяКорректировкаМатериалов = Истина;
	ВремРучнаяКорректировкаМатериалов = Объект.РучнаяКорректировкаМатериалов;
	//-- №14311

КонецПроцедуры

&НаКлиенте 
Процедура ВызватьДиалогПодбораОстатков(ЗаменитьПолотнаВДокументе)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	//ПараметрыПодбора.Вставить("Склад",					Объект.СкладМатериалов);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыОстаткиПленки());
	ПараметрыПодбора.Вставить("ТолькоВНаличии",			Истина);
	ПараметрыПодбора.Вставить("НеЗапрашиватьЦену",		Истина);
	ПараметрыПодбора.Вставить("ВАльтернативнойЕдиницеИзмерения",		Истина);
	ВозвращенноеЗначение = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораНоменклатуры",ПараметрыПодбора);
	
	Если НЕ ВозвращенноеЗначение = Неопределено Тогда
		ВызватьДиалогПодбораОстатковНаСервере(ЗаменитьПолотнаВДокументе, ВозвращенноеЗначение)
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВидовНоменклатурыОстаткиПленки()
	
	Список = Новый СписокЗначений;
	Список.Добавить(Справочники.ВидыНоменклатуры.ОстатокПленки);
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура СделаноИзМатериалаЗаказчика(Команда)
	Если Объект.Материалы.Количество() > 0 Тогда
		ВремПарам = Новый Структура("ЭтоОстаток",Ложь);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаменеПолотен",ЭтаФорма, ВремПарам) ,"Заменить полотна на ""Материал заказчика""?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ДобавитьОстатокВМатериалы(Ложь, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоСпецификации(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидСпецификации", ПредопределенноеЗначение("Перечисление.ВидыСпецификации.СпецификацияПродукции"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьТоварыПоСпецификацииЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.Спецификации.Форма.ФормаПодбора", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварыПоСпецификацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ДобавитьПоСпецификацииНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоСпецификацииНаСервере(ВозвращенноеЗначение)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ВозвращенноеЗначение.Спецификация);
	Запрос.УстановитьПараметр("КоличествоПользователя", ВозвращенноеЗначение.Количество);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпецификацииСостав.Номенклатура,
	|	СпецификацииСостав.ХарактеристикаНоменклатуры,
	|	СпецификацииСостав.ЕдиницаИзмерения,
	|	СпецификацииСостав.Коэффициент,
	|	СпецификацииСостав.Количество * &КоличествоПользователя КАК Количество
	|ИЗ
	|	Справочник.Спецификации.Состав КАК СпецификацииСостав
	|ГДЕ
	|	СпецификацииСостав.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ПересчитатьЦенуИСуммуНоменклатурыВСтрокеПоВалюте(НоваяСтрока.НомерСтроки);
	КонецЦикла;
		
	ОбновитьДанныеДокумента();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаРазрешенаПриИзменении(Элемент)
	ОтгрузкаРазрешенаПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ОтгрузкаРазрешенаПриИзмененииНаСервере()
	Объект.ОтгрузкаРазрешена_ДатаИзменения = ТекущаяДатаСеанса();
	Объект.ОтгрузкаРазрешена_Изменил = ПараметрыСеанса.Пользователь;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьНастройкиОтгрузкаРазрешена()
	Элементы.ОтгрузкаРазрешена.ТолькоПросмотр = НЕ ПараметрыСеанса.РазрешеноИзменятьГалочкуОтгрузкаРазрешенаВЗаказах;
КонецПроцедуры
															
&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура Перекрой(Команда)	
	
	Если Модифицированность Тогда
		Сообщить("Предварительно документ необходимо записать");
	Иначе
		Если Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Произведен") 
			//Начало изменен при переходе на 2.0
			//ИЛИ Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Отгружен")
		Тогда
			//Сообщить("Запрещено осуществлять перекрой в статусах ""Произведен"" и ""Отгружен""!");
			Сообщить("Запрещено осуществлять перекрой в статусах ""Произведен""!");
			//Конец изменен при переходе на 2.0
		Иначе	
			ОП = новый ОписаниеОповещения("ПослеВыбораМатериаловГарпуна", ЭтотОбъект);
			ПараметрыФормы = новый Структура;
			ПараметрыФормы.Вставить("Материалы", ПолучитьМассивМатериаловНаКлиенте());
			ОткрытьФорму("Документ.ЗаказНаПроизводство.Форма.ФормаПерекрой", ПараметрыФормы, ЭтотОбъект, новый УникальныйИдентификатор(),,, ОП);
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивМатериаловНаКлиенте()
	Массив = новый Массив;
	Для Каждого Материал Из Объект.Материалы Цикл
		СтруктураСтроки = новый Структура("НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Количество",
									       Материал.НомерСтроки, Материал.Номенклатура, Материал.ХарактеристикаНоменклатуры, Материал.СерияНоменклатуры, Материал.Количество);
		Массив.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат Массив;
КонецФункции	

&НаКлиенте
Процедура ПослеВыбораМатериаловГарпуна(ВозвПараметры, ДопПараметр) Экспорт
	Если ВозвПараметры <> Неопределено Тогда
		ПерекройНаСервере(ВозвПараметры);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПерекройНаСервере(ВозвПараметры)
	//Нужно заменить полотна/пленку на материалы заказчика
	Для Каждого Материал Из Объект.Материалы Цикл
		Если Материал.Номенклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Полотно")
			ИЛИ Материал.Номенклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.ОстатокПленки")
		Тогда	
			Материал.Номенклатура 				= ПредопределенноеЗначение("Справочник.Номенклатура.ПолотноЗаказчика");
			Материал.ХарактеристикаНоменклатуры = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
			Материал.СерияНоменклатуры 			= ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка");			
			Материал.ЕдиницаИзмерения 			= Материал.Номенклатура.БазоваяЕдиницаИзмерения;
			
			Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла;
	
	//Заменим количество гарпуна
	Если ТипЗнч(ВозвПараметры.Материалы) = Тип("Массив") Тогда
		Для Каждого ТекГарпун Из ВозвПараметры.Материалы Цикл
					
			СтруктураПоиска = новый Структура("НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", 
											   ТекГарпун.НомерСтроки, ТекГарпун.Номенклатура, ТекГарпун.ХарактеристикаНоменклатуры, ТекГарпун.СерияНоменклатуры);
			НайденнаяСтрока = Объект.Материалы.НайтиСтроки(СтруктураПоиска);
			Если НайденнаяСтрока.Количество() > 0 Тогда
				НайденнаяСтрока[0].Количество = ВозвПараметры.КоличествоГарпун;
				НайденнаяСтрока[0].КоличествоКВыработке = ВозвПараметры.КоличествоГарпун;
				
				Модифицированность = Истина;				
			КонецЕсли;	
		
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоСмене(Команда)
	
	//++ №6687 теперь способ определяется в документе
	//Если НЕ ИсполнителиПоОперациям() Тогда
	Если Объект.СпособНачисленияВыработки = ПредопределенноеЗначение("Перечисление.СпособыНачисленияВыработки.Бригадная") Тогда
	//-- №6687	
		Если Объект.Исполнители.Количество() > 0 Тогда
			Если Вопрос("Очистить табличную часть исполнителей?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
				Объект.Исполнители.Очистить();
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Объект.ИсполнителиПоОперациям.Количество() > 0 Тогда
			Если Вопрос("Очистить табличную часть исполнителей?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
				Объект.ИсполнителиПоОперациям.Очистить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьИсполнителейПоСменеНаСервере();
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсполнителейПоСменеНаСервере()
	
	ОбщийМодульСервер.ЗаполнитьИсполнителейПроизводстваПоСмене(Объект);
	
	//++ №6283
	ПересчитатьПроцентУчастияИсполнителейПоОперациям(); 
	ПересчитатьПроцентУчастияКТУИсполнителей();
	//-- №6283
		
КонецПроцедуры

&НаКлиенте
Процедура БригадаПриИзменении(Элемент)
	ЗаполнитьИсполнителейПоСмене(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПростойПотолок(Команда)
	
	ОП = Новый ОписаниеОповещения("ПослеВводаДанныхПотолка", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаДобавленияПродукции",, ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, ОП);
	
КонецПроцедуры

Процедура ПослеВводаДанныхПотолка(Парам1, ДопПараметры) Экспорт
	
	Если НЕ Парам1 = Неопределено Тогда
		
		Объект.ПродукцияНомерРасчета = Парам1.НомерПотолка;
		Объект.ПродукцияНоменклатура = Парам1.Номенклатура;
		Объект.ПродукцияНоменклатураКоличество = Парам1.Количество;
		Объект.ПродукцияНоменклатураЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Объект.ПродукцияНоменклатура);
		Объект.ПродукцияНоменклатураКоэффициент = 1;
		Объект.ПродукцияЦена = ПолучитьЦенуПростогоПотолка(Объект.ПродукцияНоменклатура, Объект.ПродукцияНоменклатураЕдиницаИзмерения);
		СуммаСтроки = Объект.ПродукцияНоменклатураКоличество * Объект.ПродукцияЦена;
		Объект.ПродукцияСумма = СуммаСтроки - (СуммаСтроки * (Объект.ПродукцияПроцентРучнойСкидки / 100)) - Объект.ПродукцияСуммаРучнойСкидки;		
		
		Объект.ФактураПотолка.Очистить();
		Для Каждого ФактураЦвет Из Объект.ПродукцияНоменклатура.Потолок_Фактура Цикл
			НоваяСтрока = Объект.ФактураПотолка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ФактураЦвет);
		КонецЦикла;
				
		Модифицированность = Истина;
		
		ОбновитьДанныеДокумента();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуПростогоПотолка(Номенклатура, ЕдиницаИзмерения = Неопределено)
	
	ФактураПотолка = Справочники.Номенклатура.ПолучитьОсновнуюФактуруИЦветПотолка(Номенклатура);
	
	СФотопечатью = НЕ (Номенклатура.Потолок_ПлощадьФотопечати = 0); 

	ПараметрыПродукции = Новый Структура;
	ПараметрыПродукции.Вставить("ВидНоменклатуры", 	Номенклатура.ВидНоменклатуры);
	ПараметрыПродукции.Вставить("Фактура", 			ФактураПотолка.ПродукцияФактура);
	ПараметрыПродукции.Вставить("ЦветФактуры", 		ФактураПотолка.ПродукцияЦвет);			
	ПараметрыПродукции.Вставить("СФотопечатью", 	СФотопечатью);
	
	Возврат ЦеныКомпании.ПолучитьЦенуПродукции(ПараметрыПродукции, Объект.Дата, Объект.ВидЦен, Объект.Валюта, Объект.Контрагент, Объект.ДоговорКонтрагента);
	
КонецФункции

&НаКлиенте
Процедура СоздатьНаОснованииВозвратПродукции(Команда)
			
	ПараметрыФормы = Новый Структура;
	ДопПараметры = ПодготовитьСписокТоваровДляВыбораКВозврату();
	ПараметрыФормы.Вставить("СписокПотолков", ДопПараметры.СписокПотолков);
	ПараметрыФормы.Вставить("СписокУслуг",    ДопПараметры.СписокУслуг);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораТоваровКВозврату", ЭтаФорма);
	
	ОткрытьФорму("Документ.ВозвратПродукции.Форма.ФормаВыбораПотолковКВозврату", ПараметрыФормы,,,ВариантОткрытияОкна.ОтдельноеОкно,,ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьСписокТоваровДляВыбораКВозврату()
	Возврат Документы.ВозвратПродукции.ПодготовитьСписокТоваровДляВыбора(Объект.Ссылка);
КонецФункции

&НаКлиенте
Процедура ПослеВыбораТоваровКВозврату(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		
		Если Результат.Количество() > 0 Тогда			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("ДокументОснование", ОБъект.Ссылка);
			ПараметрыЗаполнения.Вставить("МассивТоваров", Результат);			
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);			
			ОткрытьФорму("Документ.ВозвратПродукции.Форма.ФормаДокумента", ПараметрыФормы);			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если НЕ ТекущаяСтраница.Имя = "ТаблицаФайлы" Тогда
		Элементы.Предпросмотр.Вид = ВидПоляФормы.ПолеКартинки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладМатериаловПриИзменении(Элемент)
	ЗаполнитьДанныеОстаткиПоМатериалам();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоИнтеркампаниИВнутреннемуЗаказу()
	
	//++ #13200 
	ОбщаяВидимостьЭлементов = Новый Массив;
	
	ОбщаяВидимостьЭлементов.Добавить(Элементы.ПродукцияЦена1);
	ОбщаяВидимостьЭлементов.Добавить(Элементы.ПродукцияПроцентРучнойСкидки1);
	ОбщаяВидимостьЭлементов.Добавить(Элементы.ПродукцияСуммаРучнойСкидки1);
	ОбщаяВидимостьЭлементов.Добавить(Элементы.ПродукцияСумма1);
	ОбщаяВидимостьЭлементов.Добавить(Элементы.ПродукцияУстановитьПроцентРучнойСкидкиПродукция);
	ОбщаяВидимостьЭлементов.Добавить(Элементы.ПродукцияУстановитьСуммуРучнойСкидкиПродукция);
	
	ОбщаяВидимостьЭлементов.Добавить(Элементы.УслугиЦена);
	ОбщаяВидимостьЭлементов.Добавить(Элементы.УслугиПроцентРучнойСкидки);
	ОбщаяВидимостьЭлементов.Добавить(Элементы.УслугиСуммаРучнойСкидки);
	ОбщаяВидимостьЭлементов.Добавить(Элементы.УслугиСумма);
	ОбщаяВидимостьЭлементов.Добавить(Элементы.УслугиУстановитьПроцентРучнойСкидкиУслуги);
	ОбщаяВидимостьЭлементов.Добавить(Элементы.УслугиУстановитьСуммуРучнойСкидкиУслуги);

	Для каждого Элемент Из ОбщаяВидимостьЭлементов Цикл
		Элемент.Видимость = Ложь;
	КонецЦикла;
	//-- #13200
	
	ЭлементыВидимостьПоКонтрагенту = Новый Массив;
	ЭлементыВидимостьПоЦенам = Новый Массив;

	ЭлементыВидимостьПоКонтрагенту.Добавить(Элементы.ГруппаКонтрагент);	
	ЭлементыВидимостьПоКонтрагенту.Добавить(Элементы.ДоговорКонтрагента);
	
	ЭлементыВидимостьПоЦенам.Добавить(Элементы.ГруппаСуммаДокумента);
	//Продукция //#13200 закомментировано, убрано выше
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.ПродукцияЦена1);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.ПродукцияПроцентРучнойСкидки1);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.ПродукцияСуммаРучнойСкидки1);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.ПродукцияСумма1);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.ПродукцияУстановитьПроцентРучнойСкидкиПродукция);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.ПродукцияУстановитьСуммуРучнойСкидкиПродукция);
	
	//Потолок
	ЭлементыВидимостьПоЦенам.Добавить(Элементы.ПродукцияЦена);
	ЭлементыВидимостьПоЦенам.Добавить(Элементы.ПродукцияПроцентРучнойСкидки);
	ЭлементыВидимостьПоЦенам.Добавить(Элементы.ПродукцияСуммаРучнойСкидки);
	ЭлементыВидимостьПоЦенам.Добавить(Элементы.ПродукцияСумма);
	
	//Товары (старая версия)
	ЭлементыВидимостьПоЦенам.Добавить(Элементы.ТоварыЦена);
	ЭлементыВидимостьПоЦенам.Добавить(Элементы.ТоварыПроцентРучнойСкидки);
	ЭлементыВидимостьПоЦенам.Добавить(Элементы.ТоварыСуммаРучнойСкидки);
	ЭлементыВидимостьПоЦенам.Добавить(Элементы.ТоварыСумма);
	
	//Услуги  //#13200 закомментировано, убрано выше
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.УслугиЦена);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.УслугиПроцентРучнойСкидки);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.УслугиСуммаРучнойСкидки);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.УслугиСумма);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.УслугиУстановитьПроцентРучнойСкидкиУслуги);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.УслугиУстановитьСуммуРучнойСкидкиУслуги);
	ЭлементыВидимостьПоЦенам.Добавить(Элементы.УслугиНаценкаЗаСрочность);
	
	//Товары из ЗП  //#15716 поля убраны
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.ТоварыЗаказаПокупателяЦена);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.ТоварыЗаказаПокупателяПроцентРучнойСкидки);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.ТоварыЗаказаПокупателяСуммаРучнойСкидки);
	//ЭлементыВидимостьПоЦенам.Добавить(Элементы.ТоварыЗаказаПокупателяСумма);	
	
	Для каждого Элемент Из ЭлементыВидимостьПоКонтрагенту Цикл
		Элемент.Видимость = Истина;
	КонецЦикла;
	Для каждого Элемент Из ЭлементыВидимостьПоЦенам Цикл
		Элемент.Видимость = Истина;
	КонецЦикла;	
	
	ОднаОрганизацияПроизводстваИПродажиПотолков = Ложь;
	Если НЕ Объект.НастройкаИнтеркампани.Пустая() Тогда
		ОднаОрганизацияПроизводстваИПродажиПотолков = Объект.НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков;
		Если ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
			Если НЕ Объект.НастройкаИнтеркампани.УказыватьКонтрагентаРозницыВЗаказахНаПроизводство Тогда
				Для каждого Элемент Из ЭлементыВидимостьПоКонтрагенту Цикл
					Элемент.Видимость = Ложь;
				КонецЦикла;
			КонецЕсли;	
			
			Для каждого Элемент Из ЭлементыВидимостьПоЦенам Цикл
				Элемент.Видимость = Ложь;
			КонецЦикла;
		КонецЕсли;		
	КонецЕсли;
	
	НаборКонстант = Константы.СоздатьНабор("ОтображатьКонтрагентаВоВнутреннихЗаказах, ОтображатьЦеныВоВнутреннихЗаказах"); 
	НаборКонстант.Прочитать();
	Если Объект.ВнутреннийЗаказ Тогда
		Для каждого Элемент Из ЭлементыВидимостьПоКонтрагенту Цикл
			Элемент.Видимость = НаборКонстант.ОтображатьКонтрагентаВоВнутреннихЗаказах;
		КонецЦикла;
		Для каждого Элемент Из ЭлементыВидимостьПоЦенам Цикл
			Элемент.Видимость = НаборКонстант.ОтображатьЦеныВоВнутреннихЗаказах;
		КонецЦикла;
	КонецЕсли;
		
	Элементы.НастройкаИнтеркампани.Доступность = НЕ Объект.ВнутреннийЗаказ;
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИнтеркампаниПриИзменении(Элемент)
	УстановитьВидимостьПоИнтеркампаниИВнутреннемуЗаказу();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	РассчитатьЦенуИСуммуТиповойПродукции(СтрокаТабличнойЧасти);
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПриИзменении(Элемент)
	
	ПересчитатьПроцентУчастияКТУИсполнителей(); // №6283
	
КонецПроцедуры

//++ №6283
&НаСервере
Процедура ПересчитатьПроцентУчастияИсполнителейПоОперациям()
	
	ОбщийМодульСервер.ПересчитатьПроцентУчастияИсполнителейПоОперациям(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоУчасткамПриИзменении(Элемент)
	
	ПересчитатьПроцентУчастияИсполнителейПоОперациям();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПроцентУчастияКТУИсполнителей()
	
	// по аналогии с модулем зарплаты
	ОбщийМодульСервер.ПересчитатьПроцентУчастияКТУИсполнителей(Объект);
		
	//СуммаКоэффициентов = Объект.Исполнители.Итог("Коэффициент");
	//
	//Для Каждого ТекущаяСтрока Из Объект.Исполнители Цикл
	//	ТекущаяСтрока.ПроцентУчастия = ?(СуммаКоэффициентов = 0, 0, Окр(ТекущаяСтрока.Коэффициент / СуммаКоэффициентов, 4)*100);
	//КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоУчасткамСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИсполнителиПоУчасткам.ТекущиеДанные;
	
	НомерСотрудника = Прав(Элемент.Имя, 1);
	
	Если ТекущиеДанные["Коэффициент" + НомерСотрудника] = 0 Тогда
		ТекущиеДанные["Коэффициент" + НомерСотрудника] = 1;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СпособНачисленияВыработкиПриИзменении(Элемент)
	
	ОбновитьВидимостьЭлементов();

КонецПроцедуры
//-- №6283

//++ №12232
&НаКлиенте
Процедура ВывестиПотолокВТабличнойЧасти()
	
	Потолок.Очистить();
	
	Если Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказовНаПроизводство.ПроизводствоПотолка") Тогда
		
		// Потолок
		НоваяСтрока = Потолок.Добавить();
		НоваяСтрока.НомерСтроки = 1;
		НоваяСтрока.НомерРасчета = Объект.ПродукцияНомерРасчета;
		НоваяСтрока.Номенклатура = Объект.ПродукцияНоменклатура;
		НоваяСтрока.Количество = Объект.ПродукцияНоменклатураКоличество;
		НоваяСтрока.ЕдиницаИзмерения = Объект.ПродукцияНоменклатураЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = Объект.ПродукцияНоменклатураКоэффициент;
		
	КонецЕсли;
		
	ОбновитьВидимостьТабличнойЧастиФактуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиПотолокИзТабличнойЧасти(ТекущиеДанные)
	
	Объект.ПродукцияНомерРасчета = ТекущиеДанные.НомерРасчета;
	Объект.ПродукцияНоменклатура = ТекущиеДанные.Номенклатура;
	Объект.ПродукцияНоменклатураКоличество = ТекущиеДанные.Количество;
	Объект.ПродукцияНоменклатураЕдиницаИзмерения = ТекущиеДанные.ЕдиницаИзмерения;
	Объект.ПродукцияНоменклатураКоэффициент = ТекущиеДанные.Коэффициент;
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолокНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Потолок.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	ТекущиеДанные.Коэффициент = 1;
	
	ПеренестиПотолокИзТабличнойЧасти(ТекущиеДанные);
	ОбновитьСписокФайлов();
	ОбновитьВидимостьТабличнойЧастиФактуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолокЕдиницаИзмеренияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Потолок.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущиеДанные.Коэффициент = 1;
	Иначе
		ТекущиеДанные.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ТекущиеДанные.ЕдиницаИзмерения);
	КонецЕсли;
	
	ПеренестиПотолокИзТабличнойЧасти(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолокКоличествоПриИзменении(Элемент)
	
	ПеренестиПотолокИзТабличнойЧасти(Элементы.Потолок.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолокНомерРасчетаПриИзменении(Элемент)
	
	ПеренестиПотолокИзТабличнойЧасти(Элементы.Потолок.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолокЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Потолок.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолокЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Потолок.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущиеДанные.Коэффициент = 1;
	Иначе
		ТекущиеДанные.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
	ПеренестиПотолокИзТабличнойЧасти(Элементы.Потолок.ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьТабличнойЧастиФактуры()
	
	Элементы.ФактураПотолка.Видимость = Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Объект.ПродукцияНоменклатура);
	
КонецПроцедуры

//-- №12232


