
Функция CheckGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	
	//формируем jSON ответ
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	СтруктураОтвета = Новый Структура;
	
	//ОБРАБОТКА ЗАПРОСОВ
	Если НРЕГ(ИмяМетода) = "status" Тогда
		
		// Проверка доступности сервера 1С
		Токен = Запрос.ПараметрыЗапроса.Получить("token");
		КлючAPI = Константы.КлючAPI.Получить();
		
		Результат = "OK";
		
		//проверка токена
		Если ПустаяСтрока(КлючAPI) или НЕ НРег(Токен) = НРег(КлючAPI) Тогда
			//токен не корректный
			Результат = "Не корректный ключ API";
		КонецЕсли;
		
		СтруктураОтвета.Вставить("result", Результат);
		
	Иначе
		
		// Пришел запрос на неизвестный метод
		Ответ.КодСостояния = 405;
		СтруктураОтвета.Вставить("result", "Unknown request");
		
	КонецЕсли;
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8);	
	
	Возврат Ответ;
	
КонецФункции
