#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	//++ №12232 убран "Типовой отрез"
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = новый СписокЗначений;
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка,
	|	ВидыНоменклатуры.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	НЕ ВидыНоменклатуры.ПометкаУдаления
	|	И НЕ ВидыНоменклатуры.Ссылка = Значение(Справочник.ВидыНоменклатуры.ТиповойОтрез)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		//++ №14311 убран предопределенный УДАЛИТЬ_МатериалЗаказчика
		Если НРег(Выборка.Ссылка.ИмяПредопределенныхДанных) = НРег("УДАЛИТЬ_МатериалЗаказчика") Тогда
			Продолжить;
		КонецЕсли;	
		//-- №14311
	
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);
		
	КонецЦикла;
	//-- №12232
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция СписокДействующихВидов(ТолькоПредопределенные = Истина) Экспорт
	
	СписокДействующих = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТолькоПредопределенные", ТолькоПредопределенные);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	НЕ ВидыНоменклатуры.ПометкаУдаления
	|	И НЕ ВидыНоменклатуры.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
	|	И ВЫБОР
	|			КОГДА &ТолькоПредопределенные
	|				ТОГДА ВидыНоменклатуры.Предопределенный
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		//++ №14311 убран предопределенный УДАЛИТЬ_МатериалЗаказчика
		Если НРег(Выборка.Ссылка.ИмяПредопределенныхДанных) = НРег("УДАЛИТЬ_МатериалЗаказчика") Тогда
			Продолжить;
		КонецЕсли;	
		//-- №14311
		
		СписокДействующих.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат СписокДействующих;
	
КонецФункции

Функция ЭтоНоменклатураУникальнойПродукции(ВыбНоменклатура) Экспорт
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыбНоменклатура, "ВидНоменклатуры, ВидПродукции.УникальнаяПродукция");
	
	Если (РеквизитыНоменклатуры.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок)
		ИЛИ (РеквизитыНоменклатуры.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез)
		ИЛИ (РеквизитыНоменклатуры.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ТиповойОтрез)
		ИЛИ (РеквизитыНоменклатуры.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция
			 //#16971
			 И РеквизитыНоменклатуры.ВидПродукцииУникальнаяПродукция) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоНоменклатураПотолкаИлиОтреза(ВыбНоменклатура) Экспорт
	
	Если (ВыбНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок)
		или (ВыбНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез)
		или (ВыбНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ТиповойОтрез) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ВыбНоменклатура) Экспорт
	
	Если (ВыбНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок)
		или (ВыбНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоНоменклатураУслуга(ВыбНоменклатура) Экспорт
	
	Если (ВыбНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// #6265
Функция ЭтоНоменклатураПродукция(ВыбНоменклатура) Экспорт
	
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбНоменклатура, "ВидНоменклатуры");
	Если (ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// #16971
Функция ЭтоНоменклатураПродукцияУникальная(ВыбНоменклатура) Экспорт
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыбНоменклатура, "ВидНоменклатуры, ВидПродукции.УникальнаяПродукция");
	
	Если РеквизитыНоменклатуры.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция
		И РеквизитыНоменклатуры.ВидПродукцииУникальнаяПродукция = Истина Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоНоменклатураПродукцияНеуникальная(ВыбНоменклатура) Экспорт
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыбНоменклатура, "ВидНоменклатуры, ВидПродукции.УникальнаяПродукция");
	
	Если РеквизитыНоменклатуры.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция
		И РеквизитыНоменклатуры.ВидПродукцииУникальнаяПродукция = Ложь Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли