&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КодФормы = "ОбщаяФорма_ИзменениеСуммыДокумента";
	УстановитьЗначенияПоНастройкамФормы();
	СуммаДокумента 		= Параметры.СуммаДокумента; 
	НоваяСуммаДокумента = Параметры.СуммаДокумента;

КонецПроцедуры

&НаКлиенте
Процедура ПрименитьВДокументе(Команда)
	
	СохранитьНастройкиФормыНаСервере();
	Результат = Новый Структура;
	
	Результат.Вставить("НоваяСуммаДокумента", НоваяСуммаДокумента);	
	Результат.Вставить("СброситьРанееУстановленныеСкидки", СброситьРанееУстановленныеСкидки);	
	Результат.Вставить("ПрименятьСкидкуНаПотолки", ПрименятьСкидкуНаПотолки);	
	Результат.Вставить("ПрименятьСкидкуНаТовары", ПрименятьСкидкуНаТовары);	
	Результат.Вставить("ПрименятьСкидкуНаУслуги", ПрименятьСкидкуНаУслуги);	
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормыНаСервере()
	
	НастройкиФормы = НастройкиФормы();
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КодФормы, "", НастройкиФормы);
	
КонецПроцедуры

&НаСервере
Функция НастройкиФормы()
	
	НастройкиФормы = Новый Структура;	
	НастройкиФормы.Вставить("СброситьРанееУстановленныеСкидки", СброситьРанееУстановленныеСкидки);	
	НастройкиФормы.Вставить("ПрименятьСкидкуНаПотолки", ПрименятьСкидкуНаПотолки);	
	НастройкиФормы.Вставить("ПрименятьСкидкуНаТовары", ПрименятьСкидкуНаТовары);	
	НастройкиФормы.Вставить("ПрименятьСкидкуНаУслуги", ПрименятьСкидкуНаУслуги);	
	
	Возврат НастройкиФормы;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначенияПоНастройкамФормы()
	
	Если ПустаяСтрока(КодФормы) Тогда
		Возврат;
	КонецЕсли;
	
	СброситьРанееУстановленныеСкидки = Истина;	
	ПрименятьСкидкуНаПотолки = Истина;
	ПрименятьСкидкуНаТовары = Истина;
	ПрименятьСкидкуНаУслуги = Истина;
	
	// Если есть сохраненные настройки, то установить значения по настройкам.
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КодФормы,  "");
	
	Если Настройки <> Неопределено Тогда		
		Если Настройки.Свойство("СброситьРанееУстановленныеСкидки") Тогда
			СброситьРанееУстановленныеСкидки = Настройки.СброситьРанееУстановленныеСкидки;
		КонецЕсли;
		
		Если Настройки.Свойство("ПрименятьСкидкуНаПотолки") Тогда
			ПрименятьСкидкуНаПотолки = Настройки.ПрименятьСкидкуНаПотолки;
		КонецЕсли;
		
		Если Настройки.Свойство("ПрименятьСкидкуНаТовары") Тогда
			ПрименятьСкидкуНаТовары = Настройки.ПрименятьСкидкуНаТовары;
		КонецЕсли;
		
		Если Настройки.Свойство("ПрименятьСкидкуНаУслуги") Тогда
			ПрименятьСкидкуНаУслуги = Настройки.ПрименятьСкидкуНаУслуги;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяСуммаДокументаПриИзменении(Элемент)
	СуммаИзменения = НоваяСуммаДокумента - СуммаДокумента;
КонецПроцедуры

