
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ВложенияСтруктура = Неопределено;
	Определение = объект.Инструкция;
	
	Если ЗначениеЗаполнено(Определение) Тогда
		
		Если ВложенияСтруктура = Неопределено Тогда
			ВложенияСтруктура = Новый Структура;
		КонецЕсли;
		ФорматДок.УстановитьHTML(Определение, ВложенияСтруктура);
		
	КонецЕсли;

	Элементы.Организация.Видимость = объект.Ссылка <> ПредопределенноеЗначение("Справочник.КСУ_ИнструкцииКЗаказам.ДляВсехОрганизаций") ;
	
	м = ИА_ФПСервер.ПолучитьОрганизацииДляОтчетов();
	Если (не объект.Организация.Пустая()) и м.найти(объект.Организация) = Неопределено тогда
		м.добавить(объект.Организация);
	КонецЕсли;
	Элементы.Организация.СписокВыбора.ЗагрузитьЗначения(м);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВложенияСтруктура = Новый Структура;
	Определение ="";
	ФорматДок.ПолучитьHTML(Определение, ВложенияСтруктура);
	
	Вложения = Новый ХранилищеЗначения(ВложенияСтруктура);
	
	ТекущийОбъект.Инструкция = Определение;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если объект.Ссылка <> ПредопределенноеЗначение("Справочник.КСУ_ИнструкцииКЗаказам.ДляВсехОрганизаций") тогда
		Объект.Наименование = "Инструкция для организации """+объект.Организация+"""";
	КонецЕсли;
КонецПроцедуры


