
Процедура ПередЗаписью(Отказ, Замещение)
	
	// процедура запрета убрана в список, иначе срабатывает при программном перезаполнении регистра
	//Если ЭтотОбъект.Количество() = 0 Тогда 
	//	// запрет удаления
	//	Отказ = Истина; 
	//КонецЕсли;
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(ТекЗапись.СтатьяДоходовРасходов) И НЕ ЗначениеЗаполнено(ТекЗапись.ТипСтатьи) Тогда
			ТекЗапись.ТипСтатьи = ?(ТекЗапись.СтатьяДоходовРасходов.ИспользуетсяВУчетеДоходов, Перечисления.ТипыСтатейДоходовРасходов.Доход, Перечисления.ТипыСтатейДоходовРасходов.Расход);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Для каждого Запись из ЭтотОбъект Цикл
			ЗаполнитьЗначенияСвойств(Запись, ДанныеЗаполнения);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
