&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьЭлементов();	
КонецПроцедуры

&НаСервере
Процедура ТестПодключенияНаСервере()

	СтрокаПодключения = "
		|DRIVER=%1;
		|SERVER=%2;
		|PORT=%3;
		|DATABASE=%4;
		|UID=%5;
		|PWD=%6;";
	
	СтрокаПодключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаПодключения, 
								Объект.СтрокаДрайвера, 
								Объект.Сервер, 
								Формат(Объект.Порт, "ЧГ="),
								Объект.БазаДанных,
								Объект.ЛогинДляПодключения,
								Объект.ПарольДляПодключения);
								
	ВнИсточник = Неопределено;
	Если Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskCDRViewerModMySql Тогда
		ВнИсточник = ВнешниеИсточникиДанных.AsteriskCDRViewerMod;
	ИначеЕсли Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskFreePBX Тогда
		ВнИсточник = ВнешниеИсточникиДанных.AsteriskFreePBX;
	ИначеЕсли Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskFreePBX2 Тогда
		ВнИсточник = ВнешниеИсточникиДанных.AsteriskFreePBX2;
	КонецЕсли;
	Если ВнИсточник = Неопределено Тогда
		Сообщить("Внешний источник не определен");
		Возврат;	
	КонецЕсли;
	
	//ПараметрыСоединенияАстериск = Новый ПараметрыСоединенияВнешнегоИсточникаДанных;
	ПараметрыСоединенияАстериск = ВнИсточник.ПолучитьОбщиеПараметрыСоединения();
	ПараметрыСоединенияАстериск.АутентификацияСтандартная = Истина;
	ПараметрыСоединенияАстериск.ИмяПользователя = Объект.ЛогинДляПодключения;
	ПараметрыСоединенияАстериск.Пароль = Объект.ПарольДляПодключения;
	ПараметрыСоединенияАстериск.СтрокаСоединения = СтрокаПодключения;
	ВнИсточник.УстановитьОбщиеПараметрыСоединения(ПараметрыСоединенияАстериск);
	
	Попытка
		ВнИсточник.УстановитьСоединение();
		ВнИсточник.РазорватьСоединение();
		Сообщить("Успешно");
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ТестПодключения(Команда)
	ТестПодключенияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВариантДоступаКЗаписямПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ГруппаПолучениеЗаписей0.Видимость = Ложь;
	Элементы.ГруппаПолучениеЗаписей1.Видимость = Ложь;
	Элементы.ГруппаПолучениеЗаписей2.Видимость = Ложь;
	Элементы.ГруппаПолучениеЗаписей3.Видимость = Ложь;
	
	Если Объект.ВариантДоступаКЗаписям <= 4 Тогда
		ИмяГруппы = "ГруппаПолучениеЗаписей" + Строка(Объект.ВариантДоступаКЗаписям);
		Элементы[ИмяГруппы].Видимость = Истина;	
	КонецЕсли;
	
	Элементы.ВнутренниеГруппыНомеров.Видимость = (Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskFreePBX);
	Элементы.ВнутренниеНомера.Видимость = (Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskFreePBX);
	
	Элементы.КонтекстыВходящихЗвонков.Видимость = (Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskCDRViewerModMySql);
		
КонецПроцедуры



