
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Для каждого стр из Строки Цикл
		стрД = стр.Значение.Данные;
		Если ЗначениеЗаполнено(стрД.Датаконца) Тогда
			стрД.ГраницыМесяца = формат(стрД.ДатаНачала, "ДФ=dd.MM.yyyy") + " – " + формат(стрД.Датаконца, "ДФ=dd.MM.yyyy") + "  (" + стрД.КолДней+ " дн)";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФотоСтатусУтв = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КСУ_СтатусУтверждена, УникальныйИдентификатор);
	ФотоСтатусЧерн = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КСУ_СтатусЧерновик, УникальныйИдентификатор);
	
	//Список.Параметры.УстановитьЗначениеПараметра("ФотоСтатусУтв", ФотоСтатусУтв);
	//Список.Параметры.УстановитьЗначениеПараметра("ФотоСтатусЧерн", ФотоСтатусЧерн);
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ложь);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФП(Команда)
	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура ЖурналФП(Команда)
	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Периоды(Команда)
	ОткрытьФорму("РегистрСведений.ИА_РаспределениеНедель.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СвязанныеФП" И Элемент.ТекущиеДанные.СвязанныеФП = "Показать" Тогда
		СтандартнаяОбработка = ложь;
		допПарам = Новый Структура("Док", ВыбраннаяСтрока);
		ОткрытьФорму("Документ.ИА_ФП_Настройка.Форма.СвязанныеФП", допПарам, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПомеченные(Команда)
	Элементы.КомандаПоказатьПомеченные.Пометка = не Элементы.КомандаПоказатьПомеченные.Пометка;
	
	УстОтборПомеченных(Элементы.КомандаПоказатьПомеченные.Пометка);
КонецПроцедуры

&НаСервере
Процедура УстОтборПомеченных(ТекЗн)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ТекЗн);
КонецПроцедуры
