Функция ЗначениеНастройки(Пользователь, ЭлементНастройка) Экспорт
    Если ТипЗнч(ЭлементНастройка) = Тип("Строка") Тогда
        Настройка = ПланыВидовХарактеристик.ИА_НастройкиПользователей[ЭлементНастройка];
    Иначе
        Настройка = ЭлементНастройка;
    КонецЕсли;
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Настройка = ПланыВидовХарактеристик.ИА_НастройкиПользователей.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    
    Контекст = Новый Структура("Пользователь, Настройка, Значение"
    , Пользователь, Настройка, Настройка.ЗначениеПоУмолчанию);
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ИА_НастройкиЗначения.Пользователь,
    |	ИА_НастройкиЗначения.Настройка,
    |	ИА_НастройкиЗначения.Значение
    |ИЗ
    |	РегистрСведений.ИА_НастройкиЗначения КАК ИА_НастройкиЗначения
    |ГДЕ
    |	ИА_НастройкиЗначения.Пользователь = &Пользователь
    |	И ИА_НастройкиЗначения.Настройка = &Настройка";
    
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Настройка", Настройка);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Контекст.Значение = Выборка.Значение;
    КонецЕсли;
    
    Контекст.Значение = Настройка.ТипЗначения.ПривестиЗначение(Контекст.Значение); // т.к. м.б. "неопределено"
    ИА_НастройкиСПереопределяемый.ЗначениеНастройки(Контекст);
    
    Возврат Контекст.Значение;
КонецФункции
