Функция ПриОбновленииПолучитьВидЦены(Контрагент) Экспорт
	
	НаименованиеПоУмолчанию = "Основная цена";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыЦенПоставщиков.Ссылка
		|ИЗ
		|	Справочник.ВидыЦенПоставщиков КАК ВидыЦенПоставщиков
		|ГДЕ
		|	ВидыЦенПоставщиков.Владелец = &Владелец
		|	И ВидыЦенПоставщиков.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("Наименование", НаименованиеПоУмолчанию);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	НовСпрОбъект = Справочники.ВидыЦенПоставщиков.СоздатьЭлемент();
	НовСпрОбъект.Наименование = НаименованиеПоУмолчанию;
	НовСпрОбъект.Владелец = Контрагент;
	НовСпрОбъект.Валюта = Константы.ВалютаУчета.Получить();
	Попытка
		НовСпрОбъект.Записать();
		Возврат НовСпрОбъект.Ссылка;
	Исключение
		Возврат	Справочники.ВидыЦенПоставщиков.ПустаяСсылка();
	КонецПопытки;
		
КонецФункции
