Функция ДобавитьКДате(Контекст) Экспорт
    Если Контекст.Вариант = Перечисления.ИА_БПВариантыДней.Рабочие Тогда
        Результат = ИА_КСУОбщийСервер.Календарь_ДобавитьКДате(Контекст.Дата, Контекст.КоличествоДней);
        Возврат Результат;
        
        //// ****** Для УТ11 ****** 
        ////Календарь = ИА_БФСПИ.ВычислитьВыражение("КалендарныеГрафики.ПроизводственныйКалендарьРоссийскойФедерации()");
        ////
        ////Контекст.Вставить("Календарь", Календарь);
        ////
        ////Результат = ИА_БФСПИ.ВычислитьВыражение("КалендарныеГрафики.ПолучитьДатуПоКалендарю(
        ////|Контекст.Календарь, Контекст.Дата, Контекст.КоличествоДней)", Контекст);
        ////
        ////Результат = КалендарныеГрафики.ПолучитьДатуПоКалендарю(
        ////КалендарныеГрафики.ПроизводственныйКалендарьРоссийскойФедерации()
        ////, Контекст.Дата, Контекст.КоличествоДней);
        ////Возврат Результат;
        
        //// ****** КА ****** 
        ////Результат = ЗаполнениеДокументов.ОпределитьДату(Контекст.Дата, Контекст.КоличествоДней);
        ////Возврат Результат;
	КонецЕсли; 
КонецФункции    

Процедура ЗаполнитьОбщиеНастройкиБП(Контекст) Экспорт
    Если Метаданные.БизнесПроцессы.ИА_БПНоситель.Задача.Имя = "ИА_ЗадачаПланаДействий" Тогда
    	// Это КСУ
        Контекст.КСУ = Истина;
        Если ИА_БФКС.РеквизитЕсть(Константы, "ИА_НФИспользоватьТипыЗадач") Тогда
        	Контекст.ТипыЗадач         = Константы["ИА_НФИспользоватьТипыЗадач"].Получить();
        КонецЕсли; 
        Если ИА_БФКС.РеквизитЕсть(Константы, "ИА_НФИспользоватьДлительностьЗадач") Тогда
        	Контекст.ДлительностьЗадач = Константы["ИА_НФИспользоватьДлительностьЗадач"].Получить();
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

Функция ПолучитьИмяРеквизитаАдресацииИсполнителя() Экспорт
	
КонецФункции

Функция ТекущийПользователь() Экспорт
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

//_____________________________________________________________
// Интерфейс расширения форм

Процедура Формы_Точка_Форма_ПриСозданииНаСервере(Контекст) Экспорт
	Элемент = Контекст.Форма.Элементы.Добавить("ВозвращатьАвторуНаПроверку", Тип("ПолеФормы"), Контекст.Форма.Элементы.ДополнительныеРеквизиты);
    Элемент.Вид = ВидПоляФормы.ПолеФлажка;
    Элемент.Заголовок = "Возвращать автору на проверку";
    Элемент.ПутьКДанным = "Объект.ВозвращатьАвторуНаПроверку";
		
КонецПроцедуры
 
Процедура Формы_БП_Форма_ПриСозданииНаСервере(Контекст) Экспорт
		
КонецПроцедуры

Процедура Формы_Точка_Маршрут_ПриСозданииНаСервере(Контекст) Экспорт
		
КонецПроцедуры

Процедура Формы_Карта_Маршрут_ПриСозданииНаСервере(Контекст) Экспорт
		
КонецПроцедуры

Процедура Формы_ТипЗадач_Маршрут_ПриСозданииНаСервере(Контекст) Экспорт
		
КонецПроцедуры

//_____________________________________________________________

Процедура Задачи_ПриВыполнении(Контекст) Экспорт
КонецПроцедуры
 
Процедура Задачи_ПередЗаписьюНовой(Контекст) Экспорт    
    Задача = Контекст.Задача;
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Задача = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
    #КОНЕЦЕСЛИ
     
    Задача.Содержание = Задача.ИА_ТочкаБП.Описание;
    
    Если ИА_БФКС.РеквизитЕсть(Задача, "СодержаниеТекст") Тогда
    	Задача.СодержаниеТекст = Задача.ИА_ТочкаБП.Описание;
    КонецЕсли; 
    
    Если Задача.ИА_ТочкаБП.ЭтоУведомление Тогда
    	Задача.ЭтоПослание = Истина;
    КонецЕсли; 
    
    Задача.Отправлена = Истина;
КонецПроцедуры

Процедура Задачи_ПослеЗаписиНовой(Контекст) Экспорт
КонецПроцедуры
 

Процедура Задачи_ЗаполнитьАдресацию(Контекст) Экспорт
    Задача = Контекст.Задача;
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Задача = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
    #КОНЕЦЕСЛИ
    
    Отв = Задача.ИА_ТочкаБП.Ответственный;
    
    Если ТипЗнч(Отв) = Тип("СправочникСсылка.ОргСхема") Тогда
        Задача.Пост = Отв;
        Задача.Пользователь = Неопределено;
    КонецЕсли;    
    
    
    Если Задача.ИА_ТочкаБП.Тип = Перечисления.ИА_БПТипыТочекМаршрута.ВложенныйБизнесПроцесс Тогда
    	Задача.Пост = Неопределено;
    КонецЕсли; 
КонецПроцедуры

Процедура Задачи_ПередВыполнением(Контекст) Экспорт
    ////Задача = Контекст.Задача;
    ////#ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
    ////    Задача = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
    ////#КОНЕЦЕСЛИ
    ////
    ////Если НЕ ИА_ОбщийСервер.ИспользоватьБП()
    ////    И ТипЗнч(Задача.ПрикрепленныйОбъект) = Тип("ДокументСсылка.ЗаказКлиента")
    ////    И ЗначениеЗаполнено(Задача.ПрикрепленныйОбъект) Тогда
    ////    
    ////    Контекст.ПропуститьОбработку = Истина;
    ////КонецЕсли; 
КонецПроцедуры
 
Процедура БП_ПриПереходеКНовомуСостоянию(Контекст) Экспорт
КонецПроцедуры
 