
#Область ОбработчикиОбновления

//++ №14311 на каждую организацию, у которой есть хотя бы один документ ЗП, ЗНП или Выпуск продукции создается новый документ "Настройка контроля материалов в производстве"
Процедура СоздатьНовыеДокументы() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПокупателя.Организация КАК Организация
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	НЕ ЗаказПокупателя.Организация = Значение(Справочник.Организации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказНаПроизводство.Организация КАК Организация
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	НЕ ЗаказНаПроизводство.Организация = Значение(Справочник.Организации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыпускПродукции.Организация КАК Организация
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	НЕ ВыпускПродукции.Организация = Значение(Справочник.Организации.ПустаяСсылка)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВидовНоменклатуры = новый Массив;
	МассивВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Продукция);
	МассивВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Материал);
	МассивВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Полотно);
	
	Пока Выборка.Следующий() Цикл
		
		// Один документ для ЗнП, другой для выпуска
		Для Сч = 1 По 2 Цикл
			
			ДокументОбъект = Документы.НастройкаКонтроляМатериаловВПроизводстве.СоздатьДокумент();
			ДокументОбъект.Заполнить(Неопределено);
			
			ДокументОбъект.Дата = Дата(2001, 01, 01);
			ДокументОбъект.Организация = Выборка.Организация;
			
			ДокументОбъект.ВидДокументаКонтроля = Перечисления.ВидыДокументовКонтроляМатериаловВПроизводстве[?(Сч = 1, "ЗаказНаПроизводство", "ВыпускПродукции")];
			
			// Заполняем ТЧ "Вид номенклатуры"
			Для Каждого ВидНоменклатуры Из МассивВидовНоменклатуры Цикл
				
				НоваяСтрока = ДокументОбъект.ВидНоменклатуры.Добавить();
				
				НоваяСтрока.ВидНоменклатуры = ВидНоменклатуры;
				
				// ставим все галочки для вида контролируемого документа ЗНП и только галочка "контролировать выработку" для вида документа "Выпуск"
				Если ДокументОбъект.ВидДокументаКонтроля = Перечисления.ВидыДокументовКонтроляМатериаловВПроизводстве.ЗаказНаПроизводство Тогда
					
					НоваяСтрока.КонтролироватьВыработку 	= Истина;
					НоваяСтрока.КонтролироватьКоличество 	= Истина;
					НоваяСтрока.ПопозиционныйКонтроль 		= Истина;
					
				Иначе
					
					НоваяСтрока.КонтролироватьВыработку		= Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить("Не удалось создать документ ""Настройка контроля материалов в производстве"" для организации " 
					+ Выборка.Организация + ", для контроля по документу " + ДокументОбъект.ВидДокументаКонтроля + Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
//-- №14311

#КонецОбласти