
&НаКлиенте
Процедура СоздатьПКО(Команда)
	СпособОплаты = ПолучитьСпособОплаты(Касса);
	Если СпособОплаты = Неопределено Тогда
		Сообщить("Не выбрана касса или у кассы не выбран способ платежа!");
		Возврат;
	КонецЕсли;	
	Если СоздатьПКОнаСервере() Тогда	
		Закрыть(СпособОплаты);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСпособОплаты(КассаСсылка)
	
	Если ЗначениеЗаполнено(КассаСсылка) тогда
		СпособОплаты =  Касса.СпособОплатыЗаказа;
		Если ЗначениеЗаполнено(СпособОплаты) Тогда
			Возврат СпособОплаты;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	Иначе	
		Возврат Неопределено;
	КонецЕсли;	
		
КонецФункции	

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заказ = Параметры.Заказ;
	Сумма = Параметры.Сумма;
	
КонецПроцедуры

&НаСервере
Функция СоздатьПКОнаСервере()
	ДокументПКООбъект = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	ИнициализироватьСлужебныеРеквизиты(ДокументПКООбъект);
	ЗаполнитьПоЗаказуПокупателя(Заказ, ДокументПКООбъект);
	ДокументПКООбъект.Дата = ТекущаяДата(); 
	ДокументПКООбъект.УстановитьНовыйНомер();
	ДокументПКООбъект.Касса = Касса;
	ДокументПКООбъект.Автор = Пользователи.ТекущийПользователь();
	Попытка 
		ДокументПКООбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("ПКО не создан! " + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции

&НаСервере
Процедура ИнициализироватьСлужебныеРеквизиты(ДокументПКООбъект)
	
	ДокументПКООбъект.СМСОтправлятьПриПроведении = РаботаССМС.ИспользоватьОтправкуСМС() и РаботаССМС.ОтправлятьСМСКонтрагентуПоПКО();
	
	// №6960 настройки по бонусам делаем только если глобально включен учет бонусов
	Если ПолучитьФункциональнуюОпцию("УчетБонусов") Тогда
		//#13834 изменена настройка
		//НачислятьБонусы 						= Константы.АвтоматическиНачислятьБонусыВДокументахОплаты.Получить();
		ДокументПКООбъект.НачислятьБонусы 						= Константы.АвтоматическиНачислятьБонусы.Получить();
		ДокументПКООбъект.СлужебныйУчетБонусовПоДисконтнымКартам 	= Константы.УчетБонусовПоДисконтнымКартам.Получить();
	Иначе
		ДокументПКООбъект.НачислятьБонусы = Ложь;
		ДокументПКООбъект.СлужебныйУчетБонусовПоДисконтнымКартам = Ложь;
	КонецЕсли;
	
	ДокументПКООбъект.ДисконтнаяКарта = Справочники.ДисконтныеКарты.ПустаяСсылка();
	ДокументПКООбъект.СуммаБонусовКНачислениюПоДисконтнойКарте = 0;
	
	//#14828
	ДокументПКООбъект.СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения, ДокументПКООбъект)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивДокументов);
	
	ДокументПКООбъект.Контрагент 		= МассивДокументов[0].Контрагент;
	ДокументПКООбъект.Договор 		    = МассивДокументов[0].ДоговорКонтрагента;
	ДокументПКООбъект.Организация    	= МассивДокументов[0].Организация;
	ДокументПКООбъект.Подразделение 	= МассивДокументов[0].Подразделение; //#5775
	ДокументПКООбъект.Валюта 			= МассивДокументов[0].Валюта; 		 //#7373
	
	ДобавлятьЗаказыВторогоПорядкаВРаспределение = НЕ Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	ДобавлятьДокументыПродажиПоЗаказам = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
	И Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить(); 
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если ДокументПКООбъект.Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДокументПКООбъект.ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = ДокументПКООбъект.РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;
		Если НоваяСтрока.Сумма > Сумма Тогда
			НоваяСтрока.Сумма = Сумма;
		КонецЕсли;	
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если ДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, ДокументПКООбъект.РаспределениеПлатежа, ДокументПКООбъект.Сумма);
		КонецЕсли;		
	КонецЦикла;
	
	//Сумма = ДокументПКООбъект.РаспределениеПлатежа.Итог("Сумма");
	ДокументПКООбъект.Сумма = Сумма;
	
	ДокументПКООбъект.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя;
	ДокументПКООбъект.СтатьяДоходов = Справочники.СтатьиДоходовИРасходов.Продажи;
	//#7709 
	//после определения суммы документа
	Если ДобавлятьДокументыПродажиПоЗаказам Тогда
		Для каждого ЭлементМассива из МассивДокументов Цикл
			ФинансыСервер.ДобавитьДокументыПродажиПоЗаказам(ДокументПКООбъект, ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
