Функция ПолучитьПредставлениеЦвета(Цвет) Экспорт
	Если Цвет.Красный = -2 Тогда 
		возврат "";
	КонецЕсли;
	
	возврат "" + Цвет.Красный + "," + Цвет.Зеленый + "," + Цвет.Синий;
КонецФункции

Функция ПолучитьДвигательСтатистик() Экспорт
	Возврат ОБработки.ИА_РабочийСтолСтатистик_Упр_HTML.ПолучитьМакет("html_files");
КонецФункции

Функция ПолучитьПредставлениеДаты(ДатаНачала, ДатаКонца, периодДетализации, ПоказыватьНомерНеделиСтатистики, ПредставлениеНедели) Экспорт
	
	
	//ИА_Арчил Тваладзе 2016.05.27
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		Возврат "";
	КонецЕсли;
	//Конец Арчил Тваладзе
	
	Если ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День тогда
		
		Возврат Формат(ДатаНачала,"ДФ=dd.MM");
		
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Неделя тогда
		
		Если ПоказыватьНомерНеделиСтатистики Тогда
			
			НомерНеделиВГоду = ПолучитьНомерНедели(ДатаНачала);
			
			Возврат Формат(НомерНеделиВГоду, "ЧЦ=2; ЧДЦ=; ЧГ=0");
			
		Иначе
			
			Если ПредставлениеНедели = Перечисления.ИА_ПредставлениеНедели.Начало Тогда
				Возврат Формат(ДатаНачала, "ДФ=dd.MM");
			ИначеЕсли ПредставлениеНедели = Перечисления.ИА_ПредставлениеНедели.Конец Тогда
				Возврат Формат(НачалоДня(ДатаНачала) + 60*60*24*6, "ДФ=dd.MM");
			ИначеЕсли ПредставлениеНедели = Перечисления.ИА_ПредставлениеНедели.Диапазон Тогда
				
				//ИА_Арчил Тваладзе 2016.05.27
				Если Месяц(ДатаНачала) = Месяц(ДатаКонца) Тогда
					Возврат Формат(ДатаНачала, "ДФ=dd") +"-" + Формат(ДатаКонца, "ДФ=dd.MM");
				Иначе
					Возврат Формат(ДатаНачала, "ДФ=dd.MM") +"-" + Формат(ДатаКонца, "ДФ=dd.MM");
				КонецЕсли;
				//Конец Арчил Тваладзе
				
			КонецЕсли;
			
		КонецЕсли;	
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Месяц тогда
		Возврат Формат(ДатаНачала,"ДФ=MM.yyyy");
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Квартал тогда
		Возврат Формат(ДатаНачала,"ДФ=MM.yyyy")+"-" + Формат(ДатаНачала,"ДФ=MM.yyyy");
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Год тогда
		Возврат Формат(ДатаНачала,"ДФ=yyyy");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПредставлениеУзора(узор) Экспорт
	Если узор.Пустая() Тогда
		возврат "";
	КонецЕсли;
	
	фигура = "";
	Если узор = Перечисления.ИА_УзорыТочекСтатистик.Квадрат Тогда 
		фигура = "square";
	ИначеЕсли узор = Перечисления.ИА_УзорыТочекСтатистик.Крест Тогда 
		фигура = "cross";
	ИначеЕсли узор = Перечисления.ИА_УзорыТочекСтатистик.Ромб Тогда 
		фигура = "diamond";
	ИначеЕсли узор = Перечисления.ИА_УзорыТочекСтатистик.Треугольник Тогда 
		фигура = "triangle";
	КонецЕсли;
	
	рез = "points: { symbol: """+фигура+""" }, ";
	возврат рез;
КонецФункции

Процедура ЗаполнитьОбычныеКвоты(стрПоле) Экспорт
	СтрокаГрафик = стрПоле.Строки[0];
	Если СтрокаГрафик.Данные.Количество()<2 Тогда
		возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_КвотыСтатистик.Период,
	|	ИА_КвотыСтатистик.Квота
	|ПОМЕСТИТЬ Квоты
	|ИЗ
	|	РегистрСведений.ИА_КвотыСтатистик КАК ИА_КвотыСтатистик
	|ГДЕ
	|	ИА_КвотыСтатистик.ВидСтатистики = &ВидСтатистики
	|	И ИА_КвотыСтатистик.ПериодДетализации = &ПериодДетализации
	|	И ИА_КвотыСтатистик.Аналитика1 = &Аналитика1
	|	И ИА_КвотыСтатистик.Аналитика2 = &Аналитика2
	|	И ИА_КвотыСтатистик.Аналитика3 = &Аналитика3
	|	И ИА_КвотыСтатистик.ТипКвоты = ЗНАЧЕНИЕ(Перечисление.ИА_ТипыКвот.Обычная)
	|	И ИА_КвотыСтатистик.Период <= &ДатаКонца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.ДатаНачала,
	|	ТЗ.ДатаКонца,
	|	ТЗ.Значение,
	|	ТЗ.ЕстьЗначение,
	|	ТЗ.РеальныеДанные,
	|	ТЗ.ДанныеВведены
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.ДатаНачала,
	|	Данные.ДатаКонца,
	|	Данные.Значение,
	|	Данные.ЕстьЗначение,
	|	Данные.РеальныеДанные,
	|	Данные.ДанныеВведены,
	|	ЕСТЬNULL(Квоты.Квота, 0) КАК Квота
	|ИЗ
	|	Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЗ.ДатаНачала КАК ДатаНачала,
	|			МАКСИМУМ(Квоты.Период) КАК Период
	|		ИЗ
	|			Данные КАК ТЗ
	|				ЛЕВОЕ СОЕДИНЕНИЕ Квоты КАК Квоты
	|				ПО (Квоты.Период <= ТЗ.ДатаНачала)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЗ.ДатаНачала) КАК ЗапросПериодаКвоты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Квоты КАК Квоты
	|			ПО ЗапросПериодаКвоты.Период = Квоты.Период
	|		ПО Данные.ДатаНачала = ЗапросПериодаКвоты.ДатаНачала";
	
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(СтрокаГрафик.Данные[СтрокаГрафик.Данные.Количество()-1].ДатаКонца)+1);
	Запрос.УстановитьПараметр("ВидСтатистики", СтрокаГрафик.ВидСтатистики);
	Запрос.УстановитьПараметр("ПериодДетализации", СтрокаГрафик.ПериодДетализацииКвоты);
	Запрос.УстановитьПараметр("Аналитика1", СтрокаГрафик.Аналитика1);
	Запрос.УстановитьПараметр("Аналитика2", СтрокаГрафик.Аналитика2);
	Запрос.УстановитьПараметр("Аналитика3", СтрокаГрафик.Аналитика3);
	
	Запрос.УстановитьПараметр("ТЗ", СтрокаГрафик.Данные.Скопировать());
	Запрос.УстановитьПараметр("ТекКвота", СтрокаГрафик.Квота);
	
	СтрокаГрафик.Данные = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуВидовОсей(ТаблицаВидовОсей, СдвигПериода, ВидСдвигаПериода, НомерОси) Экспорт
	
	СтрокаВидовОсей = ТаблицаВидовОсей.Добавить();
	СтрокаВидовОсей.СдвигПериода = СдвигПериода;
	СтрокаВидовОсей.ВидСдвигаПериода = ВидСдвигаПериода;
	СтрокаВидовОсей.НомерОси = НомерОси;
	
КонецПроцедуры

Функция ПолучитьПредставлениеДатыВеб(пДата, периодДетализации,ПоказыватьНомерНеделиСтатистики,ПредставлениеНедели)
	Если ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День тогда
		возврат Формат(пДата,"ДФ=dd.MM");
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Неделя тогда
		Если ПоказыватьНомерНеделиСтатистики Тогда
			НомерНеделиВГоду = ПолучитьНомерНедели(пДата);
			Возврат Формат(НомерНеделиВГоду, "ЧЦ=2; ЧДЦ=; ЧГ=0");
		Иначе
			Если ПредставлениеНедели = Перечисления.ИА_ПредставлениеНедели.Начало Тогда
				возврат Формат(пДата, "ДФ=dd.MM");
			ИначеЕсли ПредставлениеНедели = Перечисления.ИА_ПредставлениеНедели.Конец Тогда
				возврат Формат(НачалоДня(пДата) + 60*60*24*6, "ДФ=dd.MM");
			ИначеЕсли ПредставлениеНедели = Перечисления.ИА_ПредставлениеНедели.Диапазон Тогда
				НачалоД = пДата;
				КонецД = НачалоДня(пДата) + 60*60*24*6;
				Если Месяц(НачалоД) = Месяц(КонецД) Тогда
					возврат Формат(пДата, "ДФ=dd") +"-" + Формат(КонецД, "ДФ=dd.MM");
				Иначе
					возврат Формат(пДата, "ДФ=dd.MM") +"-" + Формат(КонецД, "ДФ=dd.MM");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Месяц тогда
		Возврат Формат(пДата,"ДФ=MM.yyyy");
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Квартал тогда
		Возврат Формат(пДата,"ДФ=MM.yyyy")+"-" + Формат(пДата,"ДФ=MM.yyyy");
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Год тогда
		возврат Формат(пДата,"ДФ=yyyy");
	КонецЕсли;

КонецФункции

Процедура СформироватьКартинкуВеб(Форма,Объект,деревоСТ, Пересчитывать, ВызовИЦО = Ложь, ВызовМоиСтатистики = Ложь, НаПечать = Ложь, Зарплата = ложь, ДопПараметры = Неопределено, ПериодДетализации = Неопределено) Экспорт
	
	Если Объект.ДатаНачала > Объект.ДатаКонца Тогда
		Возврат;
	КонецЕсли;
	Отказ = ложь;	
	//деревоСТ = Форма.РеквизитФормыВЗначение("ДеревоСтатистик");
	
	//
	КоллЭлементов = Форма.Элементы.ГруппаПостроениеВеб.ПодчиненныеЭлементы;
	//удаление старых
	УдалРеквы = новый Массив();
	сч = КоллЭлементов.Количество() - 1; 
	Пока сч>=0 Цикл // цикл по группам
		стрЭл = КоллЭлементов[сч];
		Для каждого элДиаг из стрЭл.ПодчиненныеЭлементы Цикл
			УдалРеквы.Добавить(элДиаг.Имя);
		КонецЦикла;
		Форма.Элементы.Удалить(стрЭл);
		
		сч = сч - 1;
	КонецЦикла;
	Форма.ИзменитьРеквизиты(,УдалРеквы);
	//
	
	Если Пересчитывать Тогда
		Выходные = ИА_Защита_Статистика.ПолучитьВыходныеЗаПериод(Объект.ДатаНачала, Объект.ДатаКонца);
	КонецЕсли;
	
					
	// ОПРЕДЕЛЕНИЕ КОНСТАНТ
	ПоказыватьНомерНеделиСтатистики = Константы.ИА_ПоказыватьНомерНеделиСтатистики.Получить();
	ПредставлениеНедели = Константы.ИА_ПредставлениеНедели.Получить();
	Если ПредставлениеНедели.Пустая() Тогда
		ПредставлениеНедели = Перечисления.ИА_ПредставлениеНедели.Начало;
	КонецЕсли;
	
	КоличествоДиаграммВГруппе = ?(Объект.КоличествоВСтроке=0 или ВызовМоиСтатистики или НаПечать,1,Объект.КоличествоВСтроке);
	тзПериоды = Неопределено;
	
	// задание констант в шаблонах
	рШрифт = ?(Объект.Настройка.РазмерШрифта=0, 13,Объект.Настройка.РазмерШрифта);
	
	// построение
	сч = 0;
	
	ТекГруппаЭл = Неопределено;
	
	Для каждого стрПоле из деревоСТ.Строки Цикл // цикл по полям построения
		
		////////////////////////////////////////////////////// непонятно что написанное Арчилом. Вставлено для работы расшифровки ////
		Если ПериодДетализации = Неопределено Тогда
			ПериодДетализации = стрПоле.ПериодДетализации;
		КонецЕсли;
		
		Для каждого стрГрафик из стрПоле.Строки  Цикл
			ЗаполнитьКлючиСравненияВТаблице(стрГрафик.Данные, ПериодДетализации);
		КонецЦикла;
		СводнаяТаблица = СоеденитьТаблицы(СтрПоле);
		
		СсылкаНаСводнуюТаблицу = ПоместитьВоВременноеХранилище(СводнаяТаблица, Новый УникальныйИдентификатор);
		стрПоле.СсылкаНаСводнуюТаблицу = СсылкаНаСводнуюТаблицу;
		////////////////////////////////////////////////////// /непонятно что написанное Арчилом. Вставлено для работы расшифровки ////
		
		КолГрафиков = стрПоле.Строки.Количество();
		
		// элементы формы
		Если сч % КоличествоДиаграммВГруппе = 0 Тогда
			ТекГруппаЭл = Форма.Элементы.Добавить("ГруппаГрафиков"+сч,Тип("ГруппаФормы"),Форма.Элементы.ГруппаПостроениеВеб); 
			ТекГруппаЭл.РастягиватьПоГоризонтали = истина;
			ТекГруппаЭл.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ТекГруппаЭл.Группировка=ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ТекГруппаЭл.Отображение = ОтображениеОбычнойГруппы.Нет;
		КонецЕсли;
		
		ИмяРекв = "Диаграмма"+сч;
		новРеквы = новый Массив();
		нов = новый РеквизитФормы(ИмяРекв,Новый ОписаниеТипов("Диаграмма"));
		новРеквы.Добавить(нов);
		Форма.ИзменитьРеквизиты(новРеквы);
		Диаг = Вычислить("Форма.Диаграмма"+сч);
		
		диаг.ТипДиаграммы = ТипДиаграммы.График;
		
		диаг.ОтображатьЗаголовок = истина;
		диаг.АвтоУстановкаТекстаСерий = ложь;
		
		диаг.ОбластьЗаголовка.Верх = 0;
		диаг.ОбластьЗаголовка.Лево = 0;
		диаг.ОбластьЗаголовка.Низ = 0.06;
		диаг.ОбластьЗаголовка.Право = 1;
		
		диаг.ОбластьЛегенды.Верх = 0.93;
		диаг.ОбластьЛегенды.Лево = 0;
		диаг.ОбластьЛегенды.Низ = 1;
		диаг.ОбластьЛегенды.Право = 1;
		
		диаг.ОбластьПостроения.Верх = 0.07;
		диаг.ОбластьПостроения.Лево = 0;
		диаг.ОбластьПостроения.Низ = 0.90;
		диаг.ОбластьПостроения.Право = 1;
		
		НовЭл = Форма.Элементы.Добавить(ИмяРекв,Тип("ПолеФормы"),ТекГруппаЭл);
		НовЭл.Вид = ВидПоляФормы.ПолеДиаграммы;
		НовЭл.ПутьКДанным = ИмяРекв;
		НовЭл.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Если ВызовМоиСтатистики Тогда
			НовЭл.РастягиватьПоВертикали = ложь;
			НовЭл.Высота = 15;
		КонецЕсли;
		
		// меню		
		КнДобавить = Форма.Элементы.Добавить(ИмяРекв+"КнДобавить",Тип("КнопкаФормы"),НовЭл.КонтекстноеМеню);
		КнДобавить.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		КнДобавить.ИмяКоманды = "КнопкаДобавитьЗначение";
		КнДобавить.Заголовок = "Добавить значение";
		
		КнРасш = Форма.Элементы.Добавить(ИмяРекв+"КнРасш",Тип("КнопкаФормы"),НовЭл.КонтекстноеМеню);
		КнРасш.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		КнРасш.ИмяКоманды = "КнопкаВывестиРасшифровку";
		КнРасш.Заголовок = "Вывести расшифровку";
		
		Если ВызовМоиСтатистики Тогда
			КнОбн = Форма.Элементы.Добавить(ИмяРекв+"КнОбн",Тип("КнопкаФормы"),НовЭл.КонтекстноеМеню);
			КнОбн.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			КнОбн.ИмяКоманды = "ОбновитьМС";
			КнОбн.Заголовок = "Обновить";
		Иначе
			КнВлСт = Форма.Элементы.Добавить(ИмяРекв+"КнВлож",Тип("КнопкаФормы"),НовЭл.КонтекстноеМеню);
			КнВлСт.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			КнВлСт.ИмяКоманды = "КнопкаПоказатьПодчиненные";
			КнВлСт.Заголовок = "Показать вложенные статистики";
		КонецЕсли;
		//
		
		Если Пересчитывать Тогда
			ПолучитьТочки(Объект,Выходные, стрПоле, ДопПараметры);
		КонецЕсли;
		ЕстьНарастающаяКвота =  КолГрафиков = 1 И стрПоле.Строки[0].ТипКвоты = Перечисления.ИА_ТипыКвот.Нарастающая;
		ЕстьОбычнаяКвота =  КолГрафиков = 1 И стрПоле.Строки[0].ТипКвоты = Перечисления.ИА_ТипыКвот.Обычная;
		Если ЕстьОбычнаяКвота Тогда
			ЗаполнитьОбычныеКвоты(стрПоле);
		КонецЕсли;
		
		ВсегоИтог = " ";	
		диаг.ОтображатьЛегенду = КолГрафиков>1 и не ВызовИЦО;
				
		счГрафиков = 0;
		ЕстьНулевыеЗначения = Ложь;
		Для каждого стрГрафик из стрПоле.Строки Цикл  // цикл по конкретным графикам (может быть несколько на одном поле)
			//
			счГрафиков = счГрафиков +1;
			Серия = Диаг.УстановитьСерию("График"+счГрафиков);	
			Серия.Текст = стрГрафик.НаименованиеДляЛегенды;
			
			Если ЕстьНарастающаяКвота Тогда
				СерияНакопление = Диаг.УстановитьСерию("ГрафикНакопл"+счГрафиков);	
				СерияНакопление.ОтображатьГрафическоеПредставлениеДанныхВЛегендеДиаграммы = ОтображениеВЛегендеДиаграммы.НеОтображать;
				СерияНакопление.Текст = "Накопление";
				
				СерияКвотаНакопление = Диаг.УстановитьСерию("ГрафикКвотаНакопл"+счГрафиков);	
				СерияКвотаНакопление.ОтображатьГрафическоеПредставлениеДанныхВЛегендеДиаграммы = ОтображениеВЛегендеДиаграммы.НеОтображать;
				СерияКвотаНакопление.Текст = "Квота";
			КонецЕсли;
			
			Если ЕстьОбычнаяКвота Тогда
				СерияОбКвота = Диаг.УстановитьСерию("ГрафикОбКвота"+счГрафиков);	
				СерияОбКвота.ОтображатьГрафическоеПредставлениеДанныхВЛегендеДиаграммы = ОтображениеВЛегендеДиаграммы.НеОтображать;
				СерияОбКвота.Текст = "Квота";
			КонецЕсли;
			
			// вычисление заголовка
			Если ВсегоИтог<>" " Тогда
				ВсегоИтог = ВсегоИтог + "/";
			КонецЕсли;
			
			Если стрГрафик.ВидСтатистики.ВидИтогов = Перечисления.ИА_ВидыИтогов.СреднееЗначение Тогда
				ВсегоИтог = ВсегоИтог + Формат(стрГрафик.Данные.итог("Значение")/стрГрафик.Данные.Количество(),"ЧДЦ=2; ЧН=");
			ИначеЕсли стрГрафик.ВидСтатистики.ВидИтогов = Перечисления.ИА_ВидыИтогов.Сумма Тогда
				ВсегоИтог = ВсегоИтог + Формат(стрГрафик.Данные.итог("Значение"),"ЧДЦ=2; ЧН=");
			КонецЕсли;
			
			// скрипт построения			
			Перевернутая = стрГрафик.ВидСтатистики.ПеревернутаяСтатистика;
			Если Перевернутая ТОгда
				диаг.ОбластьПостроения.ФорматШкалыЗначений = "ЧО=3";
			КонецЕсли;
			
			// стиль линии
			
			Если стрГрафик.ВидСтатистики.ШиринаЛинии>0 Тогда
				Серия.Линия = Новый Линия(ТипЛинииДиаграммы.Сплошная, стрГрафик.ВидСтатистики.ШиринаЛинии); 
			КонецЕсли;
					
			узор = стрГрафик.УзорТочки;
			Если не узор.Пустая() Тогда				
				Если узор = Перечисления.ИА_УзорыТочекСтатистик.Квадрат Тогда 
					Серия.Маркер = ТипМаркераДиаграммы.Квадрат;
				ИначеЕсли узор = Перечисления.ИА_УзорыТочекСтатистик.Крест Тогда 
					Серия.Маркер = ТипМаркераДиаграммы.Квадрат;
				ИначеЕсли узор = Перечисления.ИА_УзорыТочекСтатистик.Ромб Тогда 
					Серия.Маркер = ТипМаркераДиаграммы.Ромб;
				ИначеЕсли узор = Перечисления.ИА_УзорыТочекСтатистик.Треугольник Тогда 
					Серия.Маркер = ТипМаркераДиаграммы.Квадрат;
				КонецЕсли;
			КонецЕсли;
			
			Если стрГрафик.ЦветГрафика="" Тогда
				Серия.Цвет = Новый Цвет(67,40,255);
			Иначе
				Серия.Цвет = Вычислить("Новый Цвет("+стрГрафик.ЦветГрафика+")");
			КонецЕсли;
			
			// построение
			
			счДанных = 1;
			СуммаНакопления = 0;
			квота = стрПоле.Строки[0].Квота;
			
			Если ЕстьНарастающаяКвота Тогда
				ТочкаДиаграммы = Диаг.УстановитьТочку(0);
				ТочкаДиаграммы.Текст = "";
				Диаг.УстановитьЗначение(ТочкаДиаграммы, СерияКвотаНакопление,0);			
			КонецЕсли;
			
			Для каждого стрД из стрГрафик.Данные Цикл
												
				ТочкаДиаграммы = Диаг.УстановитьТочку(счДанных);
				ТочкаДиаграммы.Текст = ПолучитьПредставлениеДатыВеб(стрД.ДатаНачала,стрГрафик.ПериодДетализации, ПоказыватьНомерНеделиСтатистики,ПредставлениеНедели);		
				
				// данные
				Если стрД.реальныеДанные тогда					
					Если стрД.Значение = 0 Тогда
						ЕстьНулевыеЗначения = истина;
					КонецЕсли;
					
					Диаг.УстановитьЗначение(ТочкаДиаграммы, Серия,?(Перевернутая,-стрД.Значение,стрД.Значение));			
					
					// накопление для квоты
					СуммаНакопления = СуммаНакопления + стрД.Значение; 
					Если ЕстьНарастающаяКвота Тогда
						Диаг.УстановитьЗначение(ТочкаДиаграммы, СерияНакопление,?(Перевернутая,-СуммаНакопления,СуммаНакопления));			
					КонецЕсли;
				КонецЕсли;
				
				Если ЕстьОбычнаяКвота Тогда
					Диаг.УстановитьЗначение(ТочкаДиаграммы, СерияОбКвота,?(Перевернутая,-стрД.Квота,стрД.Квота));			
				КонецЕсли;
				
				Если ЕстьНарастающаяКвота и квота<>0 Тогда
					ТекЗнач = (квота / стрГрафик.Данные.Количество()) * (счДанных);
					Диаг.УстановитьЗначение(ТочкаДиаграммы, СерияКвотаНакопление,?(Перевернутая,-ТекЗнач,ТекЗнач));			
				КонецЕсли;
				//
				счДанных = счДанных + 1;
			КонецЦикла;			
			
		КонецЦикла;
		
		Если (не ЕстьНулевыеЗначения) и (не ЕстьНарастающаяКвота) Тогда
			диаг.ПропускатьБазовоеЗначение = истина;
		КонецЕсли;
		
		Если Константы.ИА_ИспользоватьРучнойМаштабГрафиков.Получить() и (стрПоле.МаштабМинимум<>0 ИЛИ стрПоле.МаштабМаксимум<>0) и не ЕстьНарастающаяКвота Тогда
			Диаг.МинимальноеЗначение = стрПоле.МаштабМинимум;
			Диаг.МаксимальноеЗначение = стрПоле.МаштабМаксимум;			
			Диаг.ОсьЗначений.СпособОпределенияМаксимальногоЗначения  = СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
			Диаг.ОсьЗначений.СпособОпределенияМинимальногоЗначения  = СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
		КонецЕсли;
				
		// заголовок
		ЗаголовокД = СокрЛП(стрПоле.ЗаголовокДиаграммы) + ВсегоИтог;
		диаг.ОбластьЗаголовка.Текст = ЗаголовокД;		
		
		сч = сч + 1;
	КонецЦикла;
	
	//Форма.ЗначениеВРеквизитФормы(деревоСТ,"ДеревоСтатистик");
КонецПроцедуры

Функция СформироватьКартинку(Объект, sw, деревоСТ, Пересчитывать, ВызовИЦО = Ложь, ВызовМоиСтатистики = Ложь, НаПечать = Ложь, Зарплата = ложь, ДопПараметры = Неопределено, ПериодДетализации = Неопределено) Экспорт
	
	
	Если Объект.ДатаНачала > Объект.ДатаКонца Тогда
		Возврат "";
	КонецЕсли;
	Отказ = ложь;
	
	деревоСТ.Колонки.Добавить("НомерОси", Новый ОписаниеТипов("Число"));
	
	//в это таблице собирается сколько видов сдвигов есть в графике, и соответсвенно сколько осей x нужно выводить
	ТаблицаВидовОсей = Новый ТаблицаЗначений;
	ТаблицаВидовОсей.Колонки.Добавить("СдвигПериода",     Новый ОписаниеТипов("Число"));
	ТаблицаВидовОсей.Колонки.Добавить("ВидСдвигаПериода", Новый ОписаниеТипов("ПеречислениеСсылка.ИА_ПериодыДетализации") );
	ТаблицаВидовОсей.Колонки.Добавить("НомерОси",         Новый ОписаниеТипов("Число"));
	
	Если Пересчитывать Тогда
		Выходные = ИА_Защита_Статистика.ПолучитьВыходныеЗаПериод(Объект.ДатаНачала, Объект.ДатаКонца);
	КонецЕсли;
	
	
	// ОПРЕДЕЛЕНИЕ КОНСТАНТ
	ПоказыватьНомерНеделиСтатистики = Константы.ИА_ПоказыватьНомерНеделиСтатистики.Получить();
	ПредставлениеНедели = Константы.ИА_ПредставлениеНедели.Получить();
	Если ПредставлениеНедели.Пустая() Тогда
		ПредставлениеНедели = Перечисления.ИА_ПредставлениеНедели.Начало;
	КонецЕсли;
	
	ТекстОсновногоШаблона = Обработки.ИА_РабочийСтолСтатистик_Упр_HTML.ПолучитьМакет("html_main").ПолучитьТекст();
	ТекстШаблонаСкрипта = Обработки.ИА_РабочийСтолСтатистик_Упр_HTML.ПолучитьМакет("html_drawItem").ПолучитьТекст();
	
	КоличествоДиаграммВГруппе = ?(Объект.КоличествоВСтроке=0 или ВызовМоиСтатистики или НаПечать,1,Объект.КоличествоВСтроке);
	
	тзПериоды = Неопределено;
	
	РазмерИзобр = ИА_Защита_Статистика.ПолучитьРазмерИзображения(sw, КоличествоДиаграммВГруппе);
	РазмерКартинкиСтр = Формат(РазмерИзобр, "ЧДЦ=0; ЧГ=");
	
	Если НаПечать Тогда
		Если Константы.ИА_ОриентацияПечатиСтатистик.Получить() = 0 Тогда // портрет
			Размер_Ширина = 650;
			Размер_Высота = 900;
		иначе //ландшафт
			Размер_Ширина = 900;
			Размер_Высота = 650;
		КонецЕсли;
	Иначе
		Размер_Ширина = РазмерИзобр;
		Размер_Высота = РазмерИзобр;
	КонецЕсли;
	Размер_ШиринаСтр = Формат(Размер_Ширина, "ЧДЦ=0; ЧГ=");
	Размер_ВысотаСтр = Формат(Размер_Высота, "ЧДЦ=0; ЧГ=");
	
	// задание констант в шаблонах
	
	рШрифт = ?(Объект.Настройка.РазмерШрифта=0, 13,Объект.Настройка.РазмерШрифта);
	
	//при наведение на точку будет выводится дата точки
	ВыводитьДатуВПодписиЗначений = ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.ВыводитьДатуВПодписиЗначений);
	
	
	//ИА_Арчил Тваладзе 2016.06.08 ВыводитьПодписиЗначенийПриПечати заблокировано 
	//что бы разблокировать удалите строку  ВыводитьПодписиЗначенийПриПечати = Ложь; и раскоментируйте следующую
	//кроме того уберите отборы в ФормаСписка и ФормаРедактор регистра ИА_НастройкиЗначения 
	//ФормаСписка и ФормаВыбора плана вида характеристик ИА_НастройкиПользователей
	
	//при печати графика будут выводится значение точки
	ВыводитьПодписиЗначенийПриПечати = Ложь; 
	//ВыводитьПодписиЗначенийПриПечати = ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.ВыводитьПодписиЗначенийПриПечати);
	
	//Конец Арчил Тваладзе
	
	//если в настроках рабочего стола у статиски заданы предельные значения графика, то график будет выводится в этих пределах
	ИспользоватьРучнойМаштабГрафиков = Константы.ИА_ИспользоватьРучнойМаштабГрафиков.Получить();
	
	
	ТекстХТМЛ = ИА_Защита_Статистика.ЗаполнитьКонстантыТекстаПостроения(ТекстОсновногоШаблона, 
	Размер_ШиринаСтр, 
	Размер_ВысотаСтр, 
	ВызовИЦО, 
	ВызовМоиСтатистики, 
	НаПечать, 
	Зарплата, 
	рШрифт, 
	деревоСТ.Строки.Количество(), 
	ВыводитьПодписиЗначенийПриПечати, 
	ИспользоватьРучнойМаштабГрафиков, 
	ВыводитьДатуВПодписиЗначений);
	
	ТрендыВключены = Константы.КСУ_ВключитьТренды.Получить();
	
	//добавочные поля сверху и снизу, что бы графики стали  более спокойные, читабельные
	ДобавочныйПроцентМасштабаСтатистик = Константы.ИА_ДобавочныйПроцентМасштабаСтатистик.Получить();
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "<1C_addScale>", Строка(ДобавочныйПроцентМасштабаСтатистик)); 
	
	ОтображатьОдинБудущийПериодСтатистики = Константы.ИА_ОтображатьОдинБудущийПериодСтатистики.Получить();
	
	ТекстСкрипта = "";
	ТекстТела = "<table border=0>"+Символы.ПС;
	
	// построение
	сч = 1;
	ТекТипПериода = Неопределено;
	ОдинТипПериода = истина;
	ЕстьДвойныеГр = Ложь;
	Для каждого стрПоле из деревоСТ.Строки Цикл // цикл по полям построения
		
		Если сч = 1 Тогда
			ТекТипПериода = стрПоле.ПериодДетализации;
		КонецЕсли;
		
		Если ТекТипПериода <> стрПоле.ПериодДетализации Тогда
			ОдинТипПериода = ложь;
		КонецЕсли;
		
		Если Пересчитывать Тогда
			ПолучитьТочки(Объект,Выходные, стрПоле, ДопПараметры, Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат "";
		КонецЕсли;
		
		ЕстьСдвигиПериода = ЕстьСдвигиПериода(стрПоле);
		
		ЕстьНарастающаяКвота =  стрПоле.Строки.Количество() = 1 И стрПоле.Строки[0].ТипКвоты = Перечисления.ИА_ТипыКвот.Нарастающая;
		ЕстьОбычнаяКвота =  стрПоле.Строки.Количество() = 1 И стрПоле.Строки[0].ТипКвоты = Перечисления.ИА_ТипыКвот.Обычная;
		Если ЕстьОбычнаяКвота Тогда
			ЗаполнитьОбычныеКвоты(стрПоле);
		КонецЕсли;
		
		ТекНомерПоляСтр = ФЧ(сч);								
		ВсегоИтог = " ";
		
		// скрипт построения
		ТекТекстСкрипта = СтрЗаменить(ТекстШаблонаСкрипта,  "<1C_pNum>",        ТекНомерПоляСтр);
		ТекТекстСкрипта = СтрЗаменить(ТекТекстСкрипта,      "<1C_ShowLegend>",  Формат(стрПоле.Строки.Количество()>1 и не ВызовИЦО,"БЛ=false; БИ=true"));
		ТекТекстСкрипта = СтрЗаменить(ТекТекстСкрипта,      "<1C_hideInclude>", Формат(ЕстьСдвигиПериода,"БЛ=false; БИ=true"));	
		ТекТекстСкрипта = СтрЗаменить(ТекТекстСкрипта,      "<TrendOFF>", ?(ТрендыВключены,"","hasTrend = false;"));
		
		ТекДанные = "var data"+ТекНомерПоляСтр+" = [";
		
		первый = истина;
		ДанныеНакопления = "";
		ДанныеОбычнойКвоты = "";
		
		Если стрПоле.Строки.Количество()>1 Тогда
			ЕстьДвойныеГр = истина;
		КонецЕсли;
		
		ТаблицаВидовОсей.Очистить();
		
		//номер оси x по умолчанию
		НомерОсиX = 1;
		ДобавитьСтрокуВТаблицуВидовОсей(ТаблицаВидовОсей, 0, ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.ПустаяСсылка"), НомерОсиX);
		
		Если ПериодДетализации = Неопределено Тогда
			ПериодДетализации = стрПоле.ПериодДетализации;
		КонецЕсли;
		
		Для каждого стрГрафик из стрПоле.Строки  Цикл
			ЗаполнитьКлючиСравненияВТаблице(стрГрафик.Данные, ПериодДетализации);
		КонецЦикла;
		СводнаяТаблица = СоеденитьТаблицы(СтрПоле);
		
		СсылкаНаСводнуюТаблицу = ПоместитьВоВременноеХранилище(СводнаяТаблица, Новый УникальныйИдентификатор);
		стрПоле.СсылкаНаСводнуюТаблицу = СсылкаНаСводнуюТаблицу;
		//Конец Арчил Тваладзе
		
		СчетГрафиков = 1;
		КоличествоГрафиков = стрПоле.Строки.Количество();
		
		ТекПодписи = "[";
		
		Для каждого стрГрафик из стрПоле.Строки Цикл  // цикл по конкретным графикам (может быть несколько на одном поле)
			
			ТекПодписи = ТекПодписи + "["" "", ";
			
			// вычисление заголовка
			Если ВсегоИтог<>" " Тогда
				ВсегоИтог = ВсегоИтог + "/";
			КонецЕсли;
			
			Если стрГрафик.ВидСтатистики.ВидИтогов = Перечисления.ИА_ВидыИтогов.СреднееЗначение Тогда
				ВсегоИтог = ВсегоИтог + Формат(стрГрафик.Данные.итог("Значение")/стрГрафик.Данные.Количество(),"ЧДЦ=2; ЧН=");
			ИначеЕсли стрГрафик.ВидСтатистики.ВидИтогов = Перечисления.ИА_ВидыИтогов.Сумма Тогда
				ВсегоИтог = ВсегоИтог + Формат(стрГрафик.Данные.итог("Значение"),"ЧДЦ=2; ЧН=");
			КонецЕсли;
			
			// скрипт построения			
			ПеревернСтр = Формат(стрГрафик.ВидСтатистики.ПеревернутаяСтатистика,"БЛ=false; БИ=true");
			ТекТекстСкрипта = СтрЗаменить(ТекТекстСкрипта,"<1C_Reverse>", ПеревернСтр);
			ТекТекстСкрипта = СтрЗаменить(ТекТекстСкрипта,"<1C_LW>", стрГрафик.ВидСтатистики.ШиринаЛинии);
			
			МассивСтрокВидовОсей = ТаблицаВидовОсей.НайтиСтроки(Новый Структура("СдвигПериода, ВидСдвигаПериода", стрГрафик.СдвигПериода, стрГрафик.ВидСдвигаПериода)); 
			Если МассивСтрокВидовОсей.Количество() = 0 Тогда
				НомерОсиX = ТаблицаВидовОсей[ТаблицаВидовОсей.Количество()-1].НомерОси + 1;
				ДобавитьСтрокуВТаблицуВидовОсей(ТаблицаВидовОсей, стрГрафик.СдвигПериода, стрГрафик.ВидСдвигаПериода, НомерОсиX);
			Иначе
				НомерОсиX = МассивСтрокВидовОсей[0].НомерОси;
			КонецЕсли;
			
			ТекТекстСкрипта = СтрЗаменить(ТекТекстСкрипта,"<1C_yminScale>", ФЧ(стрГрафик.МаштабМинимум));
			ТекТекстСкрипта = СтрЗаменить(ТекТекстСкрипта,"<1C_ymaxScale>", ФЧ(стрГрафик.МаштабМаксимум));
			
			Если первый Тогда
				
				НомерТекущейДаты = 0;
				
				Если Не ЗначениеЗаполнено(НомерТекущейДаты) Тогда // НомерТекущейДаты может быть null или "" поэтому дополнителная проверка 
					НомерТекущейДаты = 0;
				Иначе
					
					НомерТекущейДаты = НомерТекущейДаты + 1;
			
				КонецЕсли;
				
				ТекТекстСкрипта = СтрЗаменить(ТекТекстСкрипта,"<1C_numberOfCurentDate>", Строка(НомерТекущейДаты));
				
			КонецЕсли;
			
			Если не первый тогда 
				ТекДанные = ТекДанные + "," + Символы.ПС; 
			КонецЕсли;
			
			ТекстЛегенды =  стрГрафик.НаименованиеДляЛегенды;
			ТекстЛегенды = Лев(ТекстЛегенды, 30);
			
			ЗаголовокД = СтрЗаменить(ТекстЛегенды,"""", "`");
			
			Если НаПечать И не стрГрафик.УзорТочки.Пустая() Тогда
				ЗаголовокД = "<"+стрГрафик.УзорТочки+"> " + ЗаголовокД; 
			КонецЕсли;
			
			узор=ПолучитьПредставлениеУзора(стрГрафик.УзорТочки);
			
			ДанныеНакопления = ",{ isColored: true, color:"+?(стрГрафик.ЦветГрафикаНарастающейКвоты="","null","""rgb("+стрГрафик.ЦветГрафикаНарастающейКвоты+")""")+", data: [";
			ТекДанные = ТекДанные + "{"+узор+" label:"""+ЗаголовокД+""", color:"+?(стрГрафик.ЦветГрафика="","null,isReversed: "+ПеревернСтр+", isColored: false","""rgb("+стрГрафик.ЦветГрафика+")"", isColored: true")+", data: [";
			
			счДанных = 1;
			ПоследнийНомерНаОсиХ = 0;
			СуммаНакопления = 0;
			
			КоличествоДанных = СводнаяТаблица.Количество();
			
			Для каждого СтрокаСводнойТаблицы из СводнаяТаблица Цикл
				
				ДатаНачала_ = ПолучитьЗначениеИзСводнойТаблицы(СтрокаСводнойТаблицы, "ДатаНачала", СчетГрафиков, '00010101'); 
				ДатаКонца_  = ПолучитьЗначениеИзСводнойТаблицы(СтрокаСводнойТаблицы, "ДатаКонца", СчетГрафиков, '00010101'); 
				
				ТекПодписи = ТекПодписи + " """+ПолучитьПредставлениеДаты(ДатаНачала_, ДатаКонца_, стрГрафик.ПериодДетализации, ПоказыватьНомерНеделиСтатистики, ПредставлениеНедели)+"""";
				Если счДанных < КоличествоДанных  Тогда
					ТекПодписи = ТекПодписи + ",";
				КонецЕсли;
				
				
				Если счДанных = 1 и ЕстьНарастающаяКвота Тогда
					ДанныеНакопления = ДанныеНакопления + "[0, 0], ";
					ТекДанные = ТекДанные + "[0, 0], ";
				КонецЕсли;
				
				// данные
				ВыводитьТочку_ = ПолучитьЗначениеИзСводнойТаблицы(СтрокаСводнойТаблицы, "реальныеДанные", СчетГрафиков, ложь); 
								
				Если ОтображатьОдинБудущийПериодСтатистики Тогда			
					ВыводитьТочку_ =  истина;
				КонецЕсли;
				
				Если ВыводитьТочку_ Или счДанных = 1 тогда
					Если счДанных > 1 Тогда 
						ТекДанные = ТекДанные + ", "; 
						ДанныеНакопления = ДанныеНакопления + ", "; 
					КонецЕсли;
					
					ЗначениеЧисло_ = ПолучитьЗначениеИзСводнойТаблицы(СтрокаСводнойТаблицы, "Значение", СчетГрафиков, 0);
					// накопление для квоты
					СуммаНакопления = СуммаНакопления + ЗначениеЧисло_; 
					
					Если счДанных = 1 и Не ВыводитьТочку_ Тогда
						Значение_ = "";
					Иначе
						Значение_ = ФЧ_Др(ЗначениеЧисло_);
					КонецЕсли;
					
					ТекДанные = ТекДанные + "["+ФЧ(счДанных)+", "+Значение_+"]";
					
					ДанныеНакопления = ДанныеНакопления + "["+ФЧ(счДанных)+", "+ФЧ_Др(СуммаНакопления)+"]";
					ПоследнийНомерНаОсиХ = счДанных;
				КонецЕсли;
				
				Если ЕстьОбычнаяКвота Тогда
					Если ДанныеОбычнойКвоты <> "" Тогда 
						ДанныеОбычнойКвоты = ДанныеОбычнойКвоты + ", "; 
					КонецЕсли;
					
					Квота_ = ПолучитьЗначениеИзСводнойТаблицы(СтрокаСводнойТаблицы, "Квота", СчетГрафиков, 0);
					Если Квота_<> 0 Тогда
						ДанныеОбычнойКвоты = ДанныеОбычнойКвоты + "["+ФЧ(счДанных)+", "+ФЧ_Др(Квота_)+"]";
					КонецЕсли;
				КонецЕсли;
				
				счДанных = счДанных + 1;
			КонецЦикла;
			
			ТекПодписи = ТекПодписи + "]";
			Если СчетГрафиков < КоличествоГрафиков   Тогда
				ТекПодписи = ТекПодписи + ",";
			КонецЕсли;
			
			Если ПоследнийНомерНаОсиХ <> КоличествоДанных Тогда
				ТекДанные = ТекДанные + ",["+ФЧ(КоличествоДанных)+", ]";
				ДанныеНакопления = ДанныеНакопления + ", ["+ФЧ(КоличествоДанных)+", ]";
			КонецЕсли;
			
			ТекДанные = ТекДанные + "], xaxis:"+НомерОсиX+" , yaxis:1}";
			ДанныеНакопления = ДанныеНакопления + "]}";
			
			СчетГрафиков = СчетГрафиков + 1;
			
			первый = ложь;
			
		КонецЦикла;
		
		ТекПодписи = ТекПодписи + "] ";
		
		// вывод линий квот и нарастающего графика
		Если ЕстьНарастающаяКвота Тогда
			колТочек = КоличествоДанных;
			//колТочек = стрПоле.Строки[0].Данные.Количество();
			квота = стрПоле.Строки[0].Квота;
			СредЗнач = "";
			Если квота<>0 И колТочек>2 Тогда
				коэф = квота / колТочек;
				для счетТочек = 1 по колТочек - 1 Цикл
					ТекЗнач = коэф * счетТочек;
					СредЗнач = СредЗнач + "["+счетТочек+","+ФЧ_Др(ТекЗнач)+"], ";
				КонецЦикла;
			КонецЕсли;
			ТекДанные = ТекДанные + ДанныеНакопления + ", {isColored: true, data: [ [0,0], "+СредЗнач+" ["+ колТочек + ", "+ФЧ_Др(квота)+"] ]  } ";  
		КонецЕсли;
		Если ЕстьОбычнаяКвота Тогда
			ТекДанные = ТекДанные + ", {isColored: true, data: [ "+ДанныеОбычнойКвоты+" ]  } ";
		КонецЕсли;
		
		ТекДанные = ТекДанные + " ]; " + Символы.ПС;
		
		
		ТекТекстСкрипта = СтрЗаменить(ТекТекстСкрипта, "<1C_data>", ТекДанные);
		ТекТекстСкрипта = СтрЗаменить(ТекТекстСкрипта, "<1C_ticks>", ТекПодписи);
		ТекстСкрипта = ТекстСкрипта + ТекТекстСкрипта;
		
		
		// ПОСТРОЕНИЕ BODY
		
		// заголовок
		ЗаголовокД = СокрЛП(стрПоле.ЗаголовокДиаграммы) + ВсегоИтог;
		ЗаголовокД = СтрЗаменить(ЗаголовокД,"""", "`");
		
		// тело
		Если (сч-1)%КоличествоДиаграммВГруппе = 0 Тогда
			Если сч > 1 Тогда
				ТекстТела = ТекстТела + "</tr>"+Символы.ПС;	
			КонецЕсли;
			ТекстТела = ТекстТела + "<tr style=""page-break-after: always;"">"+Символы.ПС;	
		КонецЕсли;
		
		РазмерОтступов = "3px 20px 3px 3px";
		Если НаПечать или ВызовИЦО Тогда 
			РазмерОтступов = "3px 3px 3px 3px";
		КонецЕсли;
		
		
		ТекстТела = ТекстТела + "<td><div class=""mainLabel"" style=""padding-top: 10px; padding-bottom: 10px; min-height: 50px;"">"+ЗаголовокД+"</div>
		|<div class=""demo-container"" style = ""padding: "+РазмерОтступов+";"">
		|<div id=""placeholder"+ТекНомерПоляСтр+""" class=""demo-placeholder""></div>
		|</div></td>";						
		
		сч = сч + 1;
	КонецЦикла;
	
	ТекстТела = ТекстТела + "</tr></table>"+Символы.ПС;
	
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ,"<1C_drawItem>",ТекстСкрипта);
	Если не ВызовИЦО Тогда
		ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ,"<1C_body>",ТекстТела);
	КонецЕсли;
	
	// верхняя панель
	ТекстПанели = "<div style=""height:20px"">&nbsp;</div><div class=""mainPanel"">Вывести статистики по: <span id='button_day' class=""myButton"" onclick=""setCurEvent('det_day',''); setCurButton('day');"">дням</span><span id='button_week' class=""myButton"" onclick=""setCurEvent('det_week',''); setCurButton('week');"">неделям</span><span id='button_month' class=""myButton"" onclick=""setCurEvent('det_month',''); setCurButton('month');"">месяцам</span><span id='button_year' class=""myButton"" onclick=""setCurEvent('det_year',''); setCurButton('year');"">годам</span>";	
	ТекстПанели = ТекстПанели + "&nbsp;&nbsp;&nbsp;<span class=""myButton"" style=""background-color:#2f78a8;"" onclick=""setCurEvent('det_back','');"">исходные периоды</span>&nbsp;&nbsp;&nbsp;<img src=""img_info_all.gif"" style=""cursor:pointer;""  onclick=""ShowHideLabelsAll();"" title=""Показать / скрыть подписи значений"">";
	Если ЕстьДвойныеГр Тогда
		ТекстПанели = ТекстПанели + "&nbsp;<img src=""img_legend_all.gif"" style=""cursor:pointer;""  onclick=""ShowHideLegendsAll();"" title=""Показать / скрыть легенды"">";
	КонецЕсли;
	ТекстПанели = ТекстПанели + "</div>";
	Если не (ВызовИЦО или ВызовМоиСтатистики или Зарплата или НаПечать) Тогда
		ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ,"<1C_PANEL>",ТекстПанели);
		ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ,"<1C_VIS_INFO>","hidden");
	Иначе
		ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ,"<1C_PANEL>","");
		ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ,"<1C_VIS_INFO>","visible");
	КонецЕсли;
	
	Если ОдинТипПериода и ТекТипПериода <> Перечисления.ИА_ПериодыДетализации.Квартал Тогда
		ПредстПер = "day";
		Если ТекТипПериода = Перечисления.ИА_ПериодыДетализации.Неделя Тогда
			ПредстПер = "week";
		ИначеЕсли ТекТипПериода = Перечисления.ИА_ПериодыДетализации.Месяц Тогда
			ПредстПер = "month";
		ИначеЕсли ТекТипПериода = Перечисления.ИА_ПериодыДетализации.Год Тогда
			ПредстПер = "year";
		КонецЕсли;
		ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ,"<1С_CurPeriod>",ПредстПер);
	Иначе
		ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ,"<1С_CurPeriod>","");
	КонецЕсли;
	// /панель
	
	Возврат ТекстХТМЛ;
	
КонецФункции

Функция ПолучитьНомерНедели(ДатаСреза)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИА_РаспределениеНедель.Период) КАК НомерНедели
	|ИЗ
	|	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	|ГДЕ
	|	ИА_РаспределениеНедель.Период <= &Период
	|	И ИА_РаспределениеНедель.Месяц >= НАЧАЛОПЕРИОДА(&Период,ГОД)");
	
	Запрос.УстановитьПараметр("Период", ДатаСреза);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерНедели;
	Иначе 
		возврат -1;
	КонецЕсли;;
	
КонецФункции // ПолучитьНомераНедель()

Функция ПолучитьНомерНеделиВМесяце(ДатаСреза)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИА_РаспределениеНедель.Период) КАК НомерНедели
	|ИЗ
	|	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	|ГДЕ
	|	ИА_РаспределениеНедель.Период <= &Период
	|	И ИА_РаспределениеНедель.Месяц >= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)");
	
	Запрос.УстановитьПараметр("Период", ДатаСреза);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерНедели;
	Иначе 
		возврат -1;
	КонецЕсли;
	
КонецФункции // ПолучитьНомераНедель()

Функция Абс(ч)
	Возврат МАКС(ч, -ч);
КонецФункции

Функция ФЧ(пЧисло) Экспорт
	Возврат Формат(пЧисло, "ЧДЦ=0; ЧН=; ЧГ=;");
КонецФункции

Функция ФЧ_Др(пЧисло) Экспорт
	Возврат Формат(пЧисло, "ЧРД=.; ЧН=; ЧГ=");
КонецФункции

Функция ОкрВБольшуюСторону(х)
	х1 = Окр(х);
	Возврат ?(х1<х, х1 + 1, х1)
КонецФункции


Процедура ПолучитьТаблицуПериодов(ДатаНачала,ДатаКонца,СтрокаСтатистик, настройка, ГрафикНарастающейКвоты = Ложь) Экспорт
	
	СтрокаСтатистик.Данные.Очистить();
	
	Если настройка = Справочники.ИА_НастройкиРабочегоСтолаСтатистик.РабочийСтолНачисленияЗарплаты Тогда
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ИА_РаспределениеНедель.Месяц
		|ИЗ
		|	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
		|ГДЕ
		|	ИА_РаспределениеНедель.Период <= &Период
		|	И ИА_РаспределениеНедель.КонецНедели >= &Период";
		Запрос.УстановитьПараметр("Период", ДатаНачала); 	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			ТекМес = Выборка.Месяц;
		Иначе
			Сообщить("Заполните распределение недель!");
			возврат;
		КонецЕсли;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ИА_РаспределениеНедель.Период КАК Период,
		|	ИА_РаспределениеНедель.КонецНедели
		|ИЗ
		|	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
		|ГДЕ
		|	ИА_РаспределениеНедель.Месяц = &Месяц
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
		Запрос.УстановитьПараметр("Месяц", ТекМес);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтр = СтрокаСтатистик.Данные.Добавить();        
			НовСтр.ДатаНачала = Выборка.Период;
			НовСтр.ДатаКонца = КонецДня(Выборка.КонецНедели);
			НовСтр.Значение = 12345678934;
			НовСтр.РеальныеДанные = Ложь;
			НовСтр.ЕстьЗначение = Ложь;
			НовСтр.ДанныеВведены = Ложь;
		КонецЦикла;
	Иначе  
		дн = ДатаНачала;
		дк1 = КонецДня(ДатаКонца); 
		
		Пока дн < дк1 Цикл
			Если СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День тогда
				дк = дн + 60*60*24 - 1;
			ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Неделя  тогда
				дк = дн + 60*60*24*7 - 1;
			ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Месяц тогда
				дк = ДобавитьМесяц(дн,1) - 1;
			ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Квартал тогда
				дк = ДобавитьМесяц(дн,3) - 1;
			ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Год тогда
				дк = ДобавитьМесяц(дн,12) - 1;
			Иначе
				Сообщить("Укажите детализацию статистики!");
				Возврат;
			КонецЕсли;
			
			Если дк > дк1 Тогда
				дк = дк1;
			КонецЕсли;
			
			НовСтр = СтрокаСтатистик.Данные.Добавить();        
			НовСтр.ДатаНачала = дн;
			НовСтр.ДатаКонца = дк;
			НовСтр.Значение = 12345678934;
			НовСтр.РеальныеДанные = Ложь;
			НовСтр.ЕстьЗначение = Ложь;
			НовСтр.ДанныеВведены = Ложь;
			
			дн = дк + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДанныеСтатистики(ДатаНачала, ДатаКонца, ПериодДетализации, ВидСтатистики, Аналитика1 = Неопределено,Аналитика2 = Неопределено,Аналитика3 = Неопределено) Экспорт
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("ДатаНачала",Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("ДатаКонца",Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("Значение",Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("РеальныеДанные",Новый ОписаниеТипов("Булево"));
	Данные.Колонки.Добавить("ЕстьЗначение",Новый ОписаниеТипов("Булево"));
	Данные.Колонки.Добавить("ДанныеВведены",Новый ОписаниеТипов("Булево"));			
			
	Новстр = Данные.Добавить();
	Новстр.ДатаНачала = ДатаНачала;
	Новстр.ДатаКонца = ДатаКонца;
	СтрокаСтатистик = Новый Структура("ПериодДетализации,ВидСтатистики,Аналитика1,Аналитика2,Аналитика3,Данные",ПериодДетализации,ВидСтатистики, Аналитика1, Аналитика2, Аналитика3,Данные);
	Выходные = ИА_Защита_Статистика.ПолучитьВыходныеЗаПериод(ДатаНачала, ДатаКонца);
	
			
	ПолучитьТаблицуПериодов(ДатаНачала, ДатаКонца, СтрокаСтатистик, Неопределено);
	
	РезТЗ_Данные = ИА_Защита_Статистика.ПолучитьТЗДанныеСтатистики(СтрокаСтатистик, ДатаНачала, ДатаКонца, Неопределено);
	
	
	// делаем итоговый запрос
	Агрегат = "СУММА(ЕСТЬNULL(ТЗДанные.Количество,0))";			
	Если СтрокаСтатистик.ВидСтатистики.ВидИтоговЗаОдинПериод = Перечисления.ИА_ВидыИтоговЗаОдинПериод.СреднееЗначение Тогда
		Агрегат = "СРЕДНЕЕ(ЕСТЬNULL(ТЗДанные.Количество,0))";
	ИначеЕсли СтрокаСтатистик.ВидСтатистики.ВидИтоговЗаОдинПериод = Перечисления.ИА_ВидыИтоговЗаОдинПериод.КоличествоРазличных Тогда
		Агрегат = "КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЗДанные.Количество)";
	ИначеЕсли СтрокаСтатистик.ВидСтатистики.ВидИтоговЗаОдинПериод = Перечисления.ИА_ВидыИтоговЗаОдинПериод.ПроизвольноеВыражение Тогда
		Агрегат = СтрокаСтатистик.ВидСтатистики.ИтогПроизвольноеВыражение;
	КонецЕсли;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = "ВЫБРАТЬ
	|	ТЗ.ДатаНачала КАК ДатаНачала,
	|	ТЗ.ДатаКонца КАК ДатаКонца
	|ПОМЕСТИТЬ ТЗПериоды
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗДанные.Период КАК Период,
	|	ТЗДанные.Количество КАК Количество
	|ПОМЕСТИТЬ ТЗДанные
	|ИЗ
	|	&ТЗДанные КАК ТЗДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗПериоды.ДатаНачала КАК ДатаНачала,
	|	<АГРЕГАТ> КАК Количество, 
    |   Максимум(Выбор когда ТЗДанные.Количество есть null тогда Ложь иначе Истина конец) как ДанныеВведены
	|
	|ИЗ
	|	ТЗПериоды КАК ТЗПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗДанные КАК ТЗДанные
	|		ПО (ТЗДанные.Период МЕЖДУ ТЗПериоды.ДатаНачала И ТЗПериоды.ДатаКонца)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗПериоды.ДатаНачала";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "<АГРЕГАТ>", Агрегат);
	
	ЗапросДанных.УстановитьПараметр("ТЗ",СтрокаСтатистик.Данные);
	ЗапросДанных.УстановитьПараметр("ТЗДанные",РезТЗ_Данные);
	
	РезТЗ = ЗапросДанных.Выполнить().Выгрузить();
	
	////////////////////////////////////////////////////
	текДата = ТекущаяДата();
	
	// Заполнение данными
	сч = 0;
	ПоследнийРеальный = 0;
	кд = КонецДня(текДата); 
	
	Для каждого стр из СтрокаСтатистик.Данные Цикл
		
		СтрокаДанных = РезТЗ.Найти(стр.ДатаНачала, "ДатаНачала");			
		стр.Значение = ?(ЗначениеЗаполнено(СтрокаДанных.Количество), СтрокаДанных.Количество,0);
		
		Если стр.ДатаКонца <= кд или (кд >= стр.ДатаНачала И кд<=стр.ДатаКонца) Тогда
			стр.РеальныеДанные = Истина;
			ПоследнийРеальный = сч;
		КонецЕсли;	
		стр.ДанныеВведены = СтрокаДанных.ДанныеВведены;
		
		сч = сч + 1;
		
	КонецЦикла;
			
	// распределение выходных
	Если  СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День Тогда // просуммируем выходные
		//На предыдущий день
		сч = ПоследнийРеальный;
		СуммаЗаВыходные = 0;
		Пока сч>= 0 Цикл
			Если Выходные.Найти(СтрокаСтатистик.Данные[сч].ДатаНачала)<>Неопределено Тогда
				СуммаЗаВыходные = СуммаЗаВыходные + СтрокаСтатистик.Данные[сч].Значение;
				
				СтрокаСтатистик.Данные.Удалить(сч);
				ПоследнийРеальный = ПоследнийРеальный - 1;
			Иначе 
				Если СуммаЗаВыходные<>0 И (не СтрокаСтатистик.ВидСтатистики.ЗапросОтображаетСостояние) Тогда 
					СтрокаСтатистик.Данные[сч].Значение = СтрокаСтатистик.Данные[сч].Значение + СуммаЗаВыходные;
				КонецЕсли;
				СуммаЗаВыходные = 0;
			КонецЕсли;
			сч = сч - 1;
		КонецЦикла;
		Если СуммаЗаВыходные<>0 И СтрокаСтатистик.Данные.Количество() > 0 И (не СтрокаСтатистик.ВидСтатистики.ЗапросОтображаетСостояние) Тогда   // если нет предыдущего
			СтрокаСтатистик.Данные[0].Значение = СтрокаСтатистик.Данные[0].Значение + СуммаЗаВыходные;
		КонецЕсли;
	КонецЕсли;

    Возврат СтрокаСтатистик.Данные;
КонецФункции

Процедура ПолучитьТочки(Объект, ВыходныеОбщие, СтрокаДереваСтатистик, ДопПараметры = Неопределено, Отказ = Ложь) Экспорт
	
	Для каждого СтрокаСтатистик из СтрокаДереваСтатистик.Строки Цикл
		
		Если СтрокаСтатистик.СдвигПериода <> 0 Тогда
			
			СдвинутыеДатыНачалаКонца = Новый Структура("ДатаНачала, ДатаКонца", Объект.ДатаНачала, Объект.ДатаКонца);
			Если Не ПолучитьСдвинутыеДатыНачалаКонца(Объект, СтрокаСтатистик, СдвинутыеДатыНачалаКонца) Тогда
				
				Сообщение = Новый СообщениеПользователю;  
				Сообщение.Текст = "В строке "+СтрокаСтатистик.НаименованиеДляЛегенды+" ""Вид сдвига периода"" меньше ""Периода детализации""! "+Символы.ПС + "Невозможно вывести статистики!";
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
				Возврат;
				
			КонецЕсли;
			
			СдвинутыеВыходные = ИА_Защита_Статистика.ПолучитьВыходныеЗаПериод(СдвинутыеДатыНачалаКонца.ДатаНачала, СдвинутыеДатыНачалаКонца.ДатаКонца);
			
			ДатаНачала = СдвинутыеДатыНачалаКонца.ДатаНачала;
			ДатаКонца  = СдвинутыеДатыНачалаКонца.ДатаКонца;
			Выходные   = СдвинутыеВыходные;
			
		Иначе
			
			ДатаНачала = НачалоДня(Объект.ДатаНачала);
			ДатаКонца  = КонецДня(Объект.ДатаКонца);
			Выходные   = ВыходныеОбщие;
			
		КонецЕсли;
		
		ПолучитьТаблицуПериодов(ДатаНачала, ДатаКонца, СтрокаСтатистик, Объект.Настройка);
		
		ЭтоКуб = СтрокаСтатистик.ВидСтатистики.ИспользоватьКуб;
		РезТЗ_Данные = ИА_Защита_Статистика.ПолучитьТЗДанныеСтатистики(СтрокаСтатистик, ДатаНачала, ДатаКонца, ДопПараметры);
		
		
		// делаем итоговый запрос
		Агрегат = "СУММА(ЕСТЬNULL(ТЗДанные.Количество,0))";			
		Если СтрокаСтатистик.ВидСтатистики.ВидИтоговЗаОдинПериод = Перечисления.ИА_ВидыИтоговЗаОдинПериод.СреднееЗначение Тогда
			Агрегат = "СРЕДНЕЕ(ЕСТЬNULL(ТЗДанные.Количество,0))";
		ИначеЕсли СтрокаСтатистик.ВидСтатистики.ВидИтоговЗаОдинПериод = Перечисления.ИА_ВидыИтоговЗаОдинПериод.КоличествоРазличных Тогда
			Агрегат = "КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЗДанные.Количество)";
		ИначеЕсли СтрокаСтатистик.ВидСтатистики.ВидИтоговЗаОдинПериод = Перечисления.ИА_ВидыИтоговЗаОдинПериод.ПроизвольноеВыражение Тогда
			Агрегат = СтрокаСтатистик.ВидСтатистики.ИтогПроизвольноеВыражение;
		КонецЕсли;
		
		ЗапросДанных = Новый Запрос;
		ЗапросДанных.Текст = "ВЫБРАТЬ
		|	ТЗ.ДатаНачала КАК ДатаНачала,
		|	ТЗ.ДатаКонца КАК ДатаКонца
		|ПОМЕСТИТЬ ТЗПериоды
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗДанные.Период КАК Период,
		|	ТЗДанные.Количество КАК Количество
		|ПОМЕСТИТЬ ТЗДанные
		|ИЗ
		|	&ТЗДанные КАК ТЗДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗПериоды.ДатаНачала КАК ДатаНачала,
		|	<АГРЕГАТ> КАК Количество, 
	    |   Максимум(Выбор когда ТЗДанные.Количество есть null тогда Ложь иначе Истина конец) как ДанныеВведены
		|
		|ИЗ
		|	ТЗПериоды КАК ТЗПериоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗДанные КАК ТЗДанные
		|		ПО (ТЗДанные.Период МЕЖДУ ТЗПериоды.ДатаНачала И ТЗПериоды.ДатаКонца)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗПериоды.ДатаНачала";
		
		ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "<АГРЕГАТ>", Агрегат);
		
		ЗапросДанных.УстановитьПараметр("ТЗ",СтрокаСтатистик.Данные);
		ЗапросДанных.УстановитьПараметр("ТЗДанные",РезТЗ_Данные);
		
		РезТЗ = ЗапросДанных.Выполнить().Выгрузить();
		
		////////////////////////////////////////////////////
		////////////////////////////////////////////////////
		////////////////////////////////////////////////////
		
		//Запрос = ИА_Защита_Статистика.ПолучитьЗапросСтатистики(СтрокаСтатистик,Оптимизация);
		текДата = ТекущаяДата();
		
		//
		ТЗОшибокКуба = Новый ТаблицаЗначений;
		ТЗОшибокКуба.Колонки.Добавить("ВидСтатистики_КОД3003ИА");
		ТЗОшибокКуба.Колонки.Добавить("Аналитика1");
		ТЗОшибокКуба.Колонки.Добавить("Аналитика2");
		ТЗОшибокКуба.Колонки.Добавить("Аналитика3");
		ТЗОшибокКуба.Колонки.Добавить("ДатаНачала");      
		ТЗОшибокКуба.Колонки.Добавить("ДатаКонца");
		
		//
		// Заполнение данными
		сч = 0;
		ПоследнийРеальный = 0;
		кд = КонецДня(текДата); 
		
		Для каждого стр из СтрокаСтатистик.Данные Цикл
			
			СтрокаДанных = РезТЗ.Найти(стр.ДатаНачала, "ДатаНачала");
			
			Если ЭтоКуб и СтрокаДанных.Количество = null Тогда
				НовстрОшК = ТЗОшибокКуба.Добавить();
				НовстрОшК.ВидСтатистики_КОД3003ИА = СтрокаСтатистик.ВидСтатистики;
				НовстрОшК.Аналитика1 = СтрокаСтатистик.Аналитика1;
				НовстрОшК.Аналитика2 = СтрокаСтатистик.Аналитика2;
				НовстрОшК.Аналитика3 = СтрокаСтатистик.Аналитика3;
				НовстрОшК.ДатаНачала = стр.ДатаНачала;
				НовстрОшК.ДатаКонца = стр.ДатаКонца;
			КонецЕсли;
			
			стр.Значение = ?(ЗначениеЗаполнено(СтрокаДанных.Количество), СтрокаДанных.Количество,0);
			
			Если стр.ДатаКонца <= кд или (кд >= стр.ДатаНачала И кд<=стр.ДатаКонца) Тогда
				стр.РеальныеДанные = Истина;
				ПоследнийРеальный = сч;
			КонецЕсли;
			
			стр.ДанныеВведены = СтрокаДанных.ДанныеВведены;
			
			сч = сч + 1;
			
		КонецЦикла;
		
		//
		Если ТЗОшибокКуба.Количество()>0 Тогда
			Сообщить("На указанные даты значения куба не рассчитаны:");
			Для каждого стрКуб из ТЗОшибокКуба Цикл
				Сообщить("  " + стрКуб.ДатаНачала + "-"+ стрКуб.Датаконца+ " " + стрКуб.ВидСтатистики_КОД3003ИА +" " + стрКуб.Аналитика1 + " " + стрКуб.Аналитика2 + " " + стрКуб.Аналитика3);
			КонецЦикла;
		КонецЕсли;
		//
		
		// распределение выходных
		Если  СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День Тогда // просуммируем выходные
			//На предыдущий день
			сч = ПоследнийРеальный;
			СуммаЗаВыходные = 0;
			Пока сч>= 0 Цикл
				Если Выходные.Найти(СтрокаСтатистик.Данные[сч].ДатаНачала)<>Неопределено Тогда
					СуммаЗаВыходные = СуммаЗаВыходные + СтрокаСтатистик.Данные[сч].Значение;
					
					СтрокаСтатистик.Данные.Удалить(сч);
					ПоследнийРеальный = ПоследнийРеальный - 1;
				Иначе 
					Если СуммаЗаВыходные<>0 И (не СтрокаСтатистик.ВидСтатистики.ЗапросОтображаетСостояние) Тогда 
						СтрокаСтатистик.Данные[сч].Значение = СтрокаСтатистик.Данные[сч].Значение + СуммаЗаВыходные;
					КонецЕсли;
					СуммаЗаВыходные = 0;
				КонецЕсли;
				сч = сч - 1;
			КонецЦикла;
			Если СуммаЗаВыходные<>0 И СтрокаСтатистик.Данные.Количество() > 0 И (не СтрокаСтатистик.ВидСтатистики.ЗапросОтображаетСостояние) Тогда   // если нет предыдущего
				СтрокаСтатистик.Данные[0].Значение = СтрокаСтатистик.Данные[0].Значение + СуммаЗаВыходные;
			КонецЕсли;
		КонецЕсли;
		//ИА_Арчил Тваладзе 2016.08.23
		СтрокаСтатистик.НомерТекущейДаты = ПоследнийРеальный;
		//ИА_Арчил Тваладзе 2016.08.23
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьОтклонениеКвоты(ТаблицаДанных, ЗначениеКвоты, ТипКвоты) Экспорт
	
	тз = ТаблицаДанных.Скопировать(, "ДатаНачала, ДатаКонца, Значение");
	тз.Колонки.Добавить("Отклонение");
	тз.Колонки.Добавить("ОтклонениеПроц");
	Колич = тз.Количество();
	
	Если ТипКвоты = Перечисления.ИА_ТипыКвот.Обычная Тогда
		Для каждого стр из тз Цикл
			стр.Отклонение = Окр(-(ЗначениеКвоты - стр.Значение), 2, 2);   
			стр.ОтклонениеПроц = Окр(-(100 - (100 * стр.Значение / ЗначениеКвоты)), 2, 2);
		КонецЦикла;	
	ИначеЕсли ТипКвоты = Перечисления.ИА_ТипыКвот.Нарастающая Тогда
		КвотаНаПериод = ЗначениеКвоты / (Колич - 1);	
		инд = 1;
		ПредЗнач = 0;
		Для каждого стр из тз Цикл
			Если стр.ДатаКонца = стр.ДатаНачала Тогда
				Продолжить;
			КонецЕсли;	
			стр.Отклонение = Окр(-(КвотаНаПериод * инд - стр.Значение - ПредЗнач), 2, 2);
			стр.ОтклонениеПроц = Окр(стр.Отклонение / (КвотаНаПериод * инд) * 100, 2, 2); 
			инд = инд + 1;
			ПредЗнач = ПредЗнач + стр.Значение;
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат тз;
	
КонецФункции

// === Уведомление о незаполненных статистиках ===
Процедура СформироватьОповещенияПоНезапСтатистикам() Экспорт
	
	Попытка 
		Орг = Метаданные.Справочники.ОргСхема.Синоним;
		РС = Метаданные.Обработки.ИА_КСУ_РабочийСтол;
	Исключение //нету оргсхемы и/или РС
		Возврат;
	КонецПопытки;	
	
	НачалоПрошлойНедели = НачалоНедели(НачалоНедели(ТекущаяДата())-1);
	КонецПрошлойНедели = КонецНедели(НачалоПрошлойНедели);
	тзНезапСтатистики = ПолучитьНезаполненныеСтатистики(НачалоПрошлойНедели, КонецПрошлойНедели);
	тзПостыАдресации = ПолучитьПостыАдресации(); 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ИА_АдресацияЗадачПланаДействий.Пользователь,
	|	ИА_АдресацияЗадачПланаДействий.Пост
	|ИЗ
	|	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	|");
	тзПользователиНаПосту = Запрос.Выполнить().Выгрузить(); 
	
	
	Для каждого с1 из тзПостыАдресации Цикл
		
		// Проверяем есть ли кому отправлять уведомление
		тзНезапСтатистикиПоПостам = ПолучитьНезаполненныеСтатистикиПоПостам(с1.пост, тзНезапСтатистики);
		
		Если тзНезапСтатистикиПоПостам = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Отбор = Новый Структура("Пост", с1.пост);
		масПользНаПосту = тзПользователиНаПосту.НайтиСтроки(Отбор);  
		
		// Формируем уведомление на пост с учетом физ. лиц, которым не отсылать уведомления 
		// и физ. лиц, кот. не должны заполнять статистики
		Для каждого с2 из масПользНаПосту Цикл
			Если масПользНаПосту.Количество() = 0 Тогда // нету пользователей на посту, которые должны получать отчет
				Продолжить;
			Иначе  
				Если ПолучатьУведомлениеОНезапСтатистиках(с2.Пользователь) Тогда
					ТекстУведомления = СформироватьТекстУведомления(тзНезапСтатистикиПоПостам, с1.пост);
					Если ЗначениеЗаполнено(ТекстУведомления) Тогда
						НовЗадача = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
						НовЗадача.ЭтоПослание = Истина;
						НовЗадача.Наименование = "Незаполненные статистики по постам";
						НовЗадача.Пользователь = с2.Пользователь;
						НовЗадача.Содержание = ТекстУведомления;
						НовЗадача.Дата = ТекущаяДата();
						НовЗадача.Отправлена = Истина; 
						НовЗадача.Записать();	
					КонецЕсли;	 
					
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;	 
		
	КонецЦикла;	 
	
КонецПроцедуры

Функция ПолучатьУведомлениеОНезапСтатистиках(Пользователь)
	Возврат ИА_НастройкиСПИ.ЗначениеНастройки(Пользователь, ПланыВидовХарактеристик.ИА_НастройкиПользователей.ПолучатьУведомлениеОНезаполненныхСтатистиках);
КонецФункции

Функция ПолучитьПостыАдресации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОргСхема.Ссылка КАК Пост,
	|	ОргСхема.УведомлятьОЗаполненииСтатистик
	|ИЗ
	|	Справочник.ОргСхема КАК ОргСхема
	|ГДЕ
	|	ОргСхема.УведомлятьОЗаполненииСтатистик В (ЗНАЧЕНИЕ(Перечисление.ИА_УведомленияОЗаполненииСтатистик.ПодчиненныеНижеНа1Уровень), ЗНАЧЕНИЕ(Перечисление.ИА_УведомленияОЗаполненииСтатистик.ПодчиненныеНа12УровняНиже), ЗНАЧЕНИЕ(Перечисление.ИА_УведомленияОЗаполненииСтатистик.ПодчиненныеНа13УровняНиже), ЗНАЧЕНИЕ(Перечисление.ИА_УведомленияОЗаполненииСтатистик.ВсеПодчиненные))";
	тзПостыАдресации = Запрос.Выполнить().Выгрузить();
	
	Возврат тзПостыАдресации;
	
КонецФункции

Функция ПолучитьНезаполненныеСтатистики(НачалоПериода, КонецПериода)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ИА_ВидыСтатистик.Ссылка КАК ВидСтатистики,
	|	ЕСТЬNULL(ЗначенияСтатистик.Аналитика1, НЕОПРЕДЕЛЕНО) КАК Аналитика1,
	|	ВЫБОР
	|		КОГДА ИА_ВидыСтатистик.Аналитика1 = ЗНАЧЕНИЕ(Справочник.ИА_ВидыАналитикиСтатистики.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ИА_ВидыСтатистик.Аналитика1
	|	КОНЕЦ КАК ТипАналитики1,
	|	ЕСТЬNULL(ЗначенияСтатистик.Аналитика2, НЕОПРЕДЕЛЕНО) КАК Аналитика2,
	|	ВЫБОР
	|		КОГДА ИА_ВидыСтатистик.Аналитика2 = ЗНАЧЕНИЕ(Справочник.ИА_ВидыАналитикиСтатистики.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ИА_ВидыСтатистик.Аналитика2
	|	КОНЕЦ КАК ТипАналитики2,
	|	ЕСТЬNULL(ЗначенияСтатистик.Аналитика3, НЕОПРЕДЕЛЕНО) КАК Аналитика3,
	|	ВЫБОР
	|		КОГДА ИА_ВидыСтатистик.Аналитика3 = ЗНАЧЕНИЕ(Справочник.ИА_ВидыАналитикиСтатистики.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ИА_ВидыСтатистик.Аналитика3
	|	КОНЕЦ КАК ТипАналитики3,
	|	ЕСТЬNULL(ЗначенияСтатистик.Количество, НЕОПРЕДЕЛЕНО) КАК ВведеноЗначение
	|ИЗ
	|	Справочник.ИА_ВидыСтатистик КАК ИА_ВидыСтатистик
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ИА_УчетСтатистик.ВидСтатистики КАК ВидСтатистики,
	|			ИА_УчетСтатистик.Аналитика1 КАК Аналитика1,
	|			ИА_УчетСтатистик.Аналитика2 КАК Аналитика2,
	|			ИА_УчетСтатистик.Аналитика3 КАК Аналитика3,
	|			СУММА(ИА_УчетСтатистик.Количество) КАК Количество
	|		ИЗ
	|			РегистрНакопления.ИА_УчетСтатистик КАК ИА_УчетСтатистик
	|		ГДЕ
	|			ИА_УчетСтатистик.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ИА_УчетСтатистик.ВидСтатистики,
	|			ИА_УчетСтатистик.Аналитика1,
	|			ИА_УчетСтатистик.Аналитика2,
	|			ИА_УчетСтатистик.Аналитика3) КАК ЗначенияСтатистик
	|		ПО ИА_ВидыСтатистик.Ссылка = ЗначенияСтатистик.ВидСтатистики
	|ГДЕ
	|	НЕ ИА_ВидыСтатистик.ПометкаУдаления
	|	И ИА_ВидыСтатистик.ВариантПолученияДанных = ЗНАЧЕНИЕ(Перечисление.ИА_ВариантыПолученияДанныхСтатистик.ДокументомСтатистика)
	|	И ЕСТЬNULL(ЗначенияСтатистик.Количество, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	тзНезапСтатистики = Запрос.Выполнить().Выгрузить();
	
	Возврат тзНезапСтатистики; 
	
КонецФункции	

Функция ПолучитьНезаполненныеСтатистикиПоПостам(Знач Пост, тзНезапСтатистики)
	масПосты = ПолучитьПодчиненныеПосты(Пост);
	
	тзРез = Новый ТаблицаЗначений;
	тзРез.Колонки.Добавить("Пост");
	тзРез.Колонки.Добавить("ВидСтатистики");
	тзРез.Колонки.Добавить("Аналитика1");
	тзРез.Колонки.Добавить("Аналитика2");
	тзРез.Колонки.Добавить("Аналитика3");
	
	Если масПосты = Неопределено Тогда
		Возврат Неопределено; 
	КонецЕсли;	    	
	
	Для каждого пост из масПосты Цикл
		Для каждого стр из пост.Статистики Цикл
			Отбор = Новый Структура("ВидСтатистики", стр.Статистика);
			масСтатистик = тзНезапСтатистики.НайтиСтроки(Отбор);
			// находим незаполненные подчин. статистики и кидаем их в рез. тз
			Для каждого с из масСтатистик Цикл
				Если // если аналитики не предусмотрены и есть вид статистики незаполненный
					с.Аналитика1 = Неопределено И с.Аналитика1 = с.ТипАналитики1 
					И с.Аналитика2 = Неопределено И с.Аналитика2 = с.ТипАналитики2 
					И с.Аналитика3 = Неопределено И с.Аналитика3 = с.ТипАналитики3 Тогда
					нов = тзРез.Добавить();
					ЗаполнитьЗначенияСвойств(нов, с);
					нов.Пост = пост;
				ИначеЕсли // если есть незаполненные аналитики, которые предусмотрены
					(с.Аналитика1 = Неопределено И ЗначениеЗаполнено(с.ТипАналитики1)) 
					Или (с.Аналитика2 = Неопределено И ЗначениеЗаполнено(с.ТипАналитики2)) 
					Или (с.Аналитика3 = Неопределено И ЗначениеЗаполнено(с.ТипАналитики3)) Тогда
					нов = тзРез.Добавить();
					ЗаполнитьЗначенияСвойств(нов, с);
					нов.Пост = пост;
				КонецЕсли;	
			КонецЦикла;	 
		КонецЦикла;	 	
	КонецЦикла;
	
	тзРез.Сортировать("Пост, ВидСтатистики, Аналитика1, Аналитика2, Аналитика3");
	
	Возврат тзРез; 
	
КонецФункции 

Функция ПолучитьПодчиненныеПосты(Знач Пост)
	
	тзРезультат = Неопределено;
	
	Если Пост.УведомлятьОЗаполненииСтатистик = Перечисления.ИА_УведомленияОЗаполненииСтатистик.ПодчиненныеНижеНа1Уровень Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОргСхема.Ссылка
		|ИЗ
		|	Справочник.ОргСхема КАК ОргСхема
		|ГДЕ
		|	ОргСхема.Родитель = &Пост
		|	И НЕ ОргСхема.ПометкаУдаления");
		Запрос.УстановитьПараметр("Пост", Пост);
		тзРезультат = Запрос.Выполнить().Выгрузить(); 
	ИначеЕсли Пост.УведомлятьОЗаполненииСтатистик = Перечисления.ИА_УведомленияОЗаполненииСтатистик.ПодчиненныеНа12УровняНиже Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОргСхема.Ссылка
		|ИЗ
		|	Справочник.ОргСхема КАК ОргСхема
		|ГДЕ
		|	(ОргСхема.Родитель = &Пост
		|			ИЛИ ОргСхема.Родитель.Родитель = &Пост)
		|	И НЕ ОргСхема.ПометкаУдаления");
		Запрос.УстановитьПараметр("Пост", Пост);
		тзРезультат = Запрос.Выполнить().Выгрузить(); 
	ИначеЕсли Пост.УведомлятьОЗаполненииСтатистик = Перечисления.ИА_УведомленияОЗаполненииСтатистик.ПодчиненныеНа13УровняНиже Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОргСхема.Ссылка
		|ИЗ
		|	Справочник.ОргСхема КАК ОргСхема
		|ГДЕ
		|	(ОргСхема.Родитель = &Пост
		|			ИЛИ ОргСхема.Родитель.Родитель = &Пост
		|			ИЛИ ОргСхема.Родитель.Родитель.Родитель = &Пост)
		|	И НЕ ОргСхема.ПометкаУдаления");
		Запрос.УстановитьПараметр("Пост", Пост);
		тзРезультат = Запрос.Выполнить().Выгрузить(); 
	ИначеЕсли Пост.УведомлятьОЗаполненииСтатистик = Перечисления.ИА_УведомленияОЗаполненииСтатистик.ВсеПодчиненные Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОргСхема.Ссылка
		|ИЗ
		|	Справочник.ОргСхема КАК ОргСхема
		|ГДЕ
		|	НЕ ОргСхема.ПометкаУдаления
		|	И ОргСхема.Ссылка В ИЕРАРХИИ(&Пост)
		|	И ОргСхема.Ссылка <> &Пост");
		Запрос.УстановитьПараметр("Пост", Пост);
		тзРезультат = Запрос.Выполнить().Выгрузить();
	КонецЕсли;	 
	
	Если тзРезультат <> Неопределено Тогда
		Возврат тзРезультат.ВыгрузитьКолонку(0);
	Иначе
		Возврат тзРезультат;  
	КонецЕсли;	 
	
КонецФункции

Функция СформироватьТекстУведомления(тзНезапСтатистикиПоПостам, Знач ПостАдресации)
	
	//поля: Пост, ВидСтатистики, Аналитика1, Аналитика2, Аналитика3
	тзПосты = тзНезапСтатистикиПоПостам.Скопировать();
	тзПосты.Свернуть("Пост");
	
	ТекстУведомления = "";
	Для каждого с1 из тзПосты Цикл
		АдресПоста = СокрЛП(с1.Пост.НаименованиеДляОргсхемы);
		ТекПост = с1.Пост.Родитель;
		Пока ТекПост <> ПостАдресации И ТекПост <> Справочники.ОргСхема.ПустаяСсылка() Цикл
			АдресПоста = СокрЛП(ТекПост.НаименованиеДляОргсхемы) + " > " + АдресПоста;
			ТекПост = ТекПост.Родитель;
		КонецЦикла;
		ИнфоПоСтатистикам = "";
		Отбор = Новый Структура("Пост", с1.пост);
		мас = тзНезапСтатистикиПоПостам.НайтиСтроки(Отбор);
		
		Для каждого с из мас Цикл
			ВС = СокрЛП(с.ВидСтатистики);
			Ан1 = ?(с.Аналитика1 = Неопределено, "", СокрЛП(с.Аналитика1));
			Ан2 = ?(с.Аналитика2 = Неопределено, "", СокрЛП(с.Аналитика2));
			Ан3 = ?(с.Аналитика3 = Неопределено, "", СокрЛП(с.Аналитика3));
			ИнфоПоСтатистикам = ИнфоПоСтатистикам + " " + ВС + " ("
			+ ?(ПустаяСтрока(Ан1), "-", Ан1) + "; "
			+ ?(ПустаяСтрока(Ан2), "-", Ан2) + "; "
			+ ?(ПустаяСтрока(Ан3), "-", Ан3) + ") "+Символы.ПС;
			
		КонецЦикла;
		ТекстУведомления = ТекстУведомления + АдресПоста + Символы.ПС + ИнфоПоСтатистикам + Символы.ПС+Символы.ПС;					
		
	КонецЦикла;	 
	
	Возврат ТекстУведомления; 
	
КонецФункции
// Конец === Уведомление о незаполненных статистиках ===

//ИА_Арчил Тваладзе 2016.05.30
Функция ПолучитьПредставениеПериодаДетализации(КоличествоПериодов, ЗначениеПериода, ВНижнемРегистре = Истина) Экспорт
	
	ПредставлениеПериодаСтрока =  Строка(ЗначениеПериода);
	
	Если ЗначениеПериода = Перечисления.ИА_ПериодыДетализации.День тогда
		
		Если КоличествоПериодов%100 = 11 или КоличествоПериодов%100 = 12 или КоличествоПериодов%100 = 13 или КоличествоПериодов%100 = 14 Тогда
			ПредставлениеПериодаСтрока =  "Дней";
		ИначеЕсли КоличествоПериодов%10 = 1 Тогда
			ПредставлениеПериодаСтрока =  "День";
		ИначеЕсли КоличествоПериодов%10 = 2 или КоличествоПериодов%10 = 3 или КоличествоПериодов%10 = 4 Тогда
			ПредставлениеПериодаСтрока =  "Дня";
		ИначеЕсли КоличествоПериодов%10 = 0 или КоличествоПериодов%10 = 5 или КоличествоПериодов%10 = 6 или КоличествоПериодов%10 = 7 или КоличествоПериодов%10 = 8 или КоличествоПериодов%10 = 9 или КоличествоПериодов%10 = 9 Тогда
			ПредставлениеПериодаСтрока =  "Дней";
		КонецЕсли;
		
	ИначеЕсли ЗначениеПериода = Перечисления.ИА_ПериодыДетализации.Неделя  тогда
		
		Если КоличествоПериодов%100 = 11 или КоличествоПериодов%100 = 12 или КоличествоПериодов%100 = 13 или КоличествоПериодов%100 = 14 Тогда
			ПредставлениеПериодаСтрока =  "Недель";
		ИначеЕсли КоличествоПериодов%10 = 1 Тогда
			ПредставлениеПериодаСтрока =  "Неделя";
		ИначеЕсли КоличествоПериодов%10 = 2 или КоличествоПериодов%10 = 3 или КоличествоПериодов%10 = 4 Тогда
			ПредставлениеПериодаСтрока =  "Недели";
		ИначеЕсли КоличествоПериодов%10 = 0 или КоличествоПериодов%10 = 5 или КоличествоПериодов%10 = 6 или КоличествоПериодов%10 = 7 или КоличествоПериодов%10 = 8 или КоличествоПериодов%10 = 9 или КоличествоПериодов%10 = 9 Тогда
			ПредставлениеПериодаСтрока =  "Недель";
		КонецЕсли;
		
	ИначеЕсли ЗначениеПериода = Перечисления.ИА_ПериодыДетализации.Месяц тогда
		
		Если КоличествоПериодов%100 = 11 или КоличествоПериодов%100 = 12 или КоличествоПериодов%100 = 13 или КоличествоПериодов%100 = 14 Тогда
			ПредставлениеПериодаСтрока =  "Месяцев";
		ИначеЕсли КоличествоПериодов%10 = 1 Тогда
			ПредставлениеПериодаСтрока =  "Месяц";
		ИначеЕсли КоличествоПериодов%10 = 2 или КоличествоПериодов%10 = 3 или КоличествоПериодов%10 = 4 Тогда
			ПредставлениеПериодаСтрока =  "Месяца";
		ИначеЕсли КоличествоПериодов%10 = 0 или КоличествоПериодов%10 = 5 или КоличествоПериодов%10 = 6 или КоличествоПериодов%10 = 7 или КоличествоПериодов%10 = 8 или КоличествоПериодов%10 = 9 или КоличествоПериодов%10 = 9 Тогда
			ПредставлениеПериодаСтрока =  "Месяцев";
		КонецЕсли;
		
	ИначеЕсли ЗначениеПериода = Перечисления.ИА_ПериодыДетализации.Квартал тогда
		
		Если КоличествоПериодов%100 = 11 или КоличествоПериодов%100 = 12 или КоличествоПериодов%100 = 13 или КоличествоПериодов%100 = 14 Тогда
			ПредставлениеПериодаСтрока =  "Кварталов";
		ИначеЕсли КоличествоПериодов%10 = 1 Тогда
			ПредставлениеПериодаСтрока =  "Квартал";
		ИначеЕсли КоличествоПериодов%10 = 2 или КоличествоПериодов%10 = 3 или КоличествоПериодов%10 = 4 Тогда
			ПредставлениеПериодаСтрока =  "Квартала";
		ИначеЕсли КоличествоПериодов%10 = 0 или КоличествоПериодов%10 = 5 или КоличествоПериодов%10 = 6 или КоличествоПериодов%10 = 7 или КоличествоПериодов%10 = 8 или КоличествоПериодов%10 = 9 или КоличествоПериодов%10 = 9 Тогда
			ПредставлениеПериодаСтрока =  "Кварталов";
		КонецЕсли;
		
	ИначеЕсли ЗначениеПериода = Перечисления.ИА_ПериодыДетализации.Год тогда
		
		Если КоличествоПериодов%100 = 11 или КоличествоПериодов%100 = 12 или КоличествоПериодов%100 = 13 или КоличествоПериодов%100 = 14 Тогда
			ПредставлениеПериодаСтрока =  "Лет";
		ИначеЕсли КоличествоПериодов%10 = 1 Тогда
			ПредставлениеПериодаСтрока =  "Год";
		ИначеЕсли КоличествоПериодов%10 = 2 или КоличествоПериодов%10 = 3 или КоличествоПериодов%10 = 4 Тогда
			ПредставлениеПериодаСтрока =  "Года";
		ИначеЕсли КоличествоПериодов%10 = 0 или КоличествоПериодов%10 = 5 или КоличествоПериодов%10 = 6 или КоличествоПериодов%10 = 7 или КоличествоПериодов%10 = 8 или КоличествоПериодов%10 = 9 или КоличествоПериодов%10 = 9 Тогда
			ПредставлениеПериодаСтрока =  "Лет";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВНижнемРегистре Тогда
		ПредставлениеПериодаСтрока = НРег(ПредставлениеПериодаСтрока);
	КонецЕсли;
	
	Возврат ПредставлениеПериодаСтрока;
	
КонецФункции

Функция ПолучитьСдвинутыеДатыНачалаКонца(Объект, СтрокаСтатистик, СдвинутыеДатыНачалаКонца = Неопределено) Экспорт
	
	ДатаНачала = НачалоДня(Объект.ДатаНачала);
	ДатаКонца  = КонецДня(Объект.ДатаКонца);
	
	Если СдвинутыеДатыНачалаКонца = Неопределено Тогда
		СдвинутыеДатыНачалаКонца = Новый Структура("ДатаНачала, ДатаКонца", ДатаНачала, ДатаКонца);	
	КонецЕсли;
	
	
	СдвигПериода      = СтрокаСтатистик.СдвигПериода; 
	ВидСдвигаПериода  = СтрокаСтатистик.ВидСдвигаПериода;
	ПериодДетализации = СтрокаСтатистик.ПериодДетализации;
	
	Если НЕ ТиповыеПериоды_БольшеИлиРавно(ВидСдвигаПериода, ПериодДетализации) Тогда
		//здесь надо обработать ошибку если детализация графика больше вида сдвига
		Возврат Ложь;
	КонецЕсли;
	
	ВидПериода = ПолучитьТиповойПериод(ДатаНачала, ДатаКонца);
	
	//ошибка
	Если ВидПериода = Неопределено Тогда 
		//здесь надо обаработать ошибку если дата начала больше даты конца, по идее сюда не должно попадать. 
		Возврат Ложь;
	КонецЕсли;
	
	////если период не типовой
	//Если ВидПериода = Перечисления.ИА_ПериодыДетализации.ПустаяСсылка() Тогда
		ПолучитьСдвинутыеДатыНачалаКонцаНеТиповойПериод(ДатаНачала, ДатаКонца, СдвинутыеДатыНачалаКонца, ПериодДетализации, СдвигПериода, ВидСдвигаПериода);
	//	
	////если период типовой
	//иначе
	//	ПолучитьСдвинутыеДатыНачалаКонцаТиповойПериод(ДатаНачала, ДатаКонца, ВидПериода, СдвинутыеДатыНачалаКонца, СдвигПериода, ВидСдвигаПериода);
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ПолучитьСдвинутыеДатыНачалаКонцаНеТиповойПериод(ДатаНачала, ДатаКонца, СдвинутыеДатыНачалаКонца, ПериодДетализации, СдвигПериода, ВидСдвигаПериода)
	
	Если ВидСдвигаПериода = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День") Тогда
		
		СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьДень(ДатаНачала, -СдвигПериода);
		СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьДень(ДатаКонца,  -СдвигПериода);
		
	ИначеЕсли ВидСдвигаПериода = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя") Тогда
		
		Если ПериодДетализации = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя") Тогда
			
			СдвинутаяДатаНачала =  ДобавитьДень(ДатаНачала, -СдвигПериода * 7);
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ИА_НачалоНеделиСУчетомРаспределения(СдвинутаяДатаНачала);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ИА_КонецНеделиСУчетомРаспределения(ДобавитьДень(ДатаКонца,  -СдвигПериода * 7));
			
			Если ДатаНачала = ИА_НачалоНеделиСУчетомРаспределения(ДатаНачала) Тогда
				Если Месяц(СдвинутыеДатыНачалаКонца.ДатаНачала) < Месяц(СдвинутаяДатаНачала) Тогда
					СдвинутыеДатыНачалаКонца.ДатаНачала = НачалоМесяца(СдвинутаяДатаНачала);
				КонецЕсли;
			КонецЕсли;

			
		иначе
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьДень(ДатаНачала, -СдвигПериода * 7);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьДень(ДатаКонца,  -СдвигПериода * 7);
			
		КонецЕсли;
		
	ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Месяц") Тогда
		
		Если ПериодДетализации = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя") Тогда
			
			Если ДатаНачала = ИА_НачалоНеделиСУчетомРаспределения(ДатаНачала) Тогда
				
				СдвинутаяДатаНачала =  ДобавитьМесяц(ДатаНачала, -СдвигПериода);
				СдвинутыеДатыНачалаКонца.ДатаНачала = ИА_НачалоНеделиСУчетомРаспределения(СдвинутаяДатаНачала);
				Если Месяц(СдвинутыеДатыНачалаКонца.ДатаНачала) < Месяц(СдвинутаяДатаНачала) Тогда
					СдвинутыеДатыНачалаКонца.ДатаНачала = НачалоМесяца(СдвинутаяДатаНачала);
				КонецЕсли;
			иначе	
				СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода);
			КонецЕсли;
			
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ИА_КонецНеделиСУчетомРаспределения(ДобавитьМесяц(ДатаКонца,  -СдвигПериода));
			
		Иначе
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьМесяц(ДатаКонца,  -СдвигПериода);
			
		КонецЕсли;
		
	ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Квартал") Тогда
		
		СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода * 3);
		СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьМесяц(ДатаКонца,  -СдвигПериода * 3);
		
	ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Год") Тогда
		
		СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода * 12);
		СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьМесяц(ДатаКонца,  -СдвигПериода * 12);
		
	Иначе
		//ошибка
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьСдвинутыеДатыНачалаКонцаТиповойПериод(ДатаНачала, ДатаКонца, ВидПериода, СдвинутыеДатыНачалаКонца, СдвигПериода, ВидСдвигаПериода)
	
	Если ВидПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День") Тогда
		
		Если ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьДень(ДатаНачала, -СдвигПериода);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьДень(ДатаКонца,  -СдвигПериода);
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьДень(ДатаНачала, -СдвигПериода * 7);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьДень(ДатаКонца,  -СдвигПериода * 7);
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Месяц") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьМесяц(ДатаКонца,  -СдвигПериода);
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Квартал") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода * 3);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьМесяц(ДатаКонца,  -СдвигПериода * 3);
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Год") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода * 12);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьМесяц(ДатаКонца,  -СдвигПериода * 12);
			
		Иначе
			//ошибка
		КонецЕсли;
		
	ИначеЕсли ВидПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя") Тогда
		
		Если ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьДень(ДатаНачала, -СдвигПериода);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьДень(ДатаКонца,  -СдвигПериода);
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ИА_НачалоНедели(ДобавитьДень(ДатаНачала, -СдвигПериода * 7));
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ИА_КонецНедели(ДобавитьДень(ДатаКонца,  -СдвигПериода * 7));
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Месяц") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьМесяц(ДатаКонца,  -СдвигПериода);
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Квартал") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода * 3);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьМесяц(ДатаКонца,  -СдвигПериода * 3);
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Год") Тогда
			
			НеделяГода = НеделяГода(ДатаНачала);
			
			ВремСдвинутаяДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода * 12);
			
			Если НеделяГода = НеделяГода(ВремСдвинутаяДатаНачала) Тогда
				СдвинутаяДатаНачала = ВремСдвинутаяДатаНачала;
			иначе
				ВремСдвинутаяДатаНачала = ДобавитьДень(ВремСдвинутаяДатаНачала,-7);
				Если НеделяГода = НеделяГода(ВремСдвинутаяДатаНачала) Тогда
					СдвинутаяДатаНачала = ВремСдвинутаяДатаНачала;
				иначе
					ВремСдвинутаяДатаНачала = ДобавитьДень(ВремСдвинутаяДатаНачала, 14);
					СдвинутаяДатаНачала = ВремСдвинутаяДатаНачала;
				КонецЕсли;
				
			КонецЕсли;
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ИА_НачалоНедели(СдвинутаяДатаНачала);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ИА_КонецНедели(СдвинутаяДатаНачала);
			
		Иначе
			//ошибка
		КонецЕсли;
		
		
	ИначеЕсли ВидПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Месяц") 
		ИЛИ  ВидПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Квартал") 
		Или  ВидПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Год") Тогда
		
		Если ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьДень(ДатаНачала, -СдвигПериода);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьДень(ДатаКонца,  -СдвигПериода);
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьДень(ДатаНачала, -СдвигПериода * 7);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьДень(ДатаКонца,  -СдвигПериода * 7);
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Месяц") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьМесяц(ДатаКонца,  -СдвигПериода);
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Квартал") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода * 3);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьМесяц(ДатаКонца,  -СдвигПериода * 3);
			
		ИначеЕсли ВидСдвигаПериода =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Год") Тогда
			
			СдвинутыеДатыНачалаКонца.ДатаНачала = ДобавитьМесяц(ДатаНачала, -СдвигПериода * 12);
			СдвинутыеДатыНачалаКонца.ДатаКонца  = ДобавитьМесяц(ДатаКонца,  -СдвигПериода * 12);
			
		Иначе
			//ошибка
		КонецЕсли;
	Иначе
		//ошибка
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьДень(ИсходнаяДата, ЧислоДней) Экспорт
	
	Возврат ИсходнаяДата + 60*60*24*ЧислоДней;
	
КонецФункции

//возвращает если ТиповойПериод1 >= ТиповойПериод, и ложь если это не так 
//ТиповойПериод1, ТиповойПериод2 - тип Перечисление.ИА_ПериодыДетализации
Функция ТиповыеПериоды_БольшеИлиРавно(ТиповойПериод1, ТиповойПериод2) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ПериодыДетализации.Ссылка,
	|	ИА_ПериодыДетализации.Порядок
	|ИЗ
	|	Перечисление.ИА_ПериодыДетализации КАК ИА_ПериодыДетализации
	|ГДЕ
	|	ИА_ПериодыДетализации.Ссылка = &ТиповойПериод1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИА_ПериодыДетализации.Ссылка,
	|	ИА_ПериодыДетализации.Порядок
	|ИЗ
	|	Перечисление.ИА_ПериодыДетализации КАК ИА_ПериодыДетализации
	|ГДЕ
	|	ИА_ПериодыДетализации.Ссылка = &ТиповойПериод2";
	
	Запрос.УстановитьПараметр("ТиповойПериод1", ТиповойПериод1);
	Запрос.УстановитьПараметр("ТиповойПериод2", ТиповойПериод2);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Порядок1 =  ВыборкаДетальныеЗаписи.Порядок;
	
	ВыборкаДетальныеЗаписи.Следующий();
	Порядок2 =  ВыборкаДетальныеЗаписи.Порядок;
	
	Порядок1 =?(ЗначениеЗаполнено(Порядок1), Порядок1, 0);  
	Порядок2 =?(ЗначениеЗаполнено(Порядок2), Порядок2, 0);  
	
	Возврат  Порядок1 >= Порядок2;
	
КонецФункции

Функция ЭтоТиповойПериод(ДатаНачала, ДатаОкончания) Экспорт
	
	ТиповойПериод = ПолучитьТиповойПериод(ДатаНачала, ДатаОкончания);
	
	Если Не ЗначениеЗаполнено(ТиповойПериод) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТиповойПериод(ДатаНачала, ДатаОкончания) Экспорт
	
	РазницаДатВДнях =(КонецДня(ДатаОкончания) - НачалоДня(ДатаНачала))/(24*60*60);
	РазницаДатВДнях = Окр(РазницаДатВДнях, 0);
	
	Если РазницаДатВДнях < 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если РазницаДатВДнях <= 1 и (ДатаНачала = НачалоДня(ДатаНачала) и ДатаОкончания = КонецДня(ДатаОкончания))  Тогда
		Возврат Перечисления.ИА_ПериодыДетализации.День;
	ИначеЕсли РазницаДатВДнях = 7 и (ДатаНачала = ИА_НачалоНедели(ДатаНачала) и ДатаОкончания = ИА_КонецНедели(ДатаОкончания)) Тогда
		Возврат Перечисления.ИА_ПериодыДетализации.Неделя;
	ИначеЕсли (РазницаДатВДнях >= 28 И РазницаДатВДнях <= 31) и (ДатаНачала = НачалоМесяца(ДатаНачала) и ДатаОкончания = КонецМесяца(ДатаОкончания)) Тогда
		Возврат Перечисления.ИА_ПериодыДетализации.Месяц;
	ИначеЕсли (РазницаДатВДнях >= 90 И РазницаДатВДнях <= 92) и (ДатаНачала = НачалоКвартала(ДатаНачала) и ДатаОкончания = КонецКвартала(ДатаОкончания)) Тогда
		Возврат Перечисления.ИА_ПериодыДетализации.Квартал;
	ИначеЕсли (РазницаДатВДнях >= 365 И РазницаДатВДнях <= 366) и (ДатаНачала = НачалоГода(ДатаНачала) и ДатаОкончания = КонецГода(ДатаОкончания)) Тогда
		Возврат Перечисления.ИА_ПериодыДетализации.Год;
	Иначе
		Возврат Перечисления.ИА_ПериодыДетализации.ПустаяСсылка(); //произвольный
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьКлючиСравненияВТаблице(ТаблицаДанные, ПериодДетализации) Экспорт 
	
	ТаблицаДанные.Колонки.Добавить("Ключ1", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Ключ2", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Ключ",  Новый ОписаниеТипов("Строка"));
	
	Если ПериодДетализации =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День") Тогда
		
		Для каждого СтрокаДанные Из ТаблицаДанные  Цикл
			СтрокаДанные.Ключ  = Строка(ФЧ(Год(СтрокаДанные.ДатаНачала))) + Строка(Формат(Месяц(СтрокаДанные.ДатаНачала), "ЧЦ=2; ЧВН=")); 
			СтрокаДанные.Ключ2 = День(СтрокаДанные.ДатаНачала); 
		КонецЦикла;
		
	ИначеЕсли ПериодДетализации =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя") Тогда
		
		Для каждого СтрокаДанные Из ТаблицаДанные  Цикл
			ДатаКлюча = СтрокаДанные.ДатаНачала;
			Если ДеньГода(КонецГода(ДатаКлюча)) = 366 И ДеньГода(ДатаКлюча) >=60 Тогда // высокосный год и начало недели больше или равно 29 февраля
				ДатаКлюча = ДатаКлюча + 60*60*24;
			КонецЕсли;
			
			СтрокаДанные.Ключ  = Строка(ФЧ(Год(ДатаКлюча))) + Строка(Формат(Месяц(ДатаКлюча), "ЧЦ=2; ЧВН=")); 
			СтрокаДанные.Ключ2 = День(ДатаКлюча);
			
			//СтрокаДанные.Ключ  = Строка(ФЧ(Год(СтрокаДанные.ДатаНачала))) + Строка(Формат(Месяц(СтрокаДанные.ДатаНачала), "ЧЦ=2; ЧВН=")); 
			////СтрокаДанные.Ключ2 = ПолучитьНомерНеделиВМесяце(СтрокаДанные.ДатаНачала); 
			//СтрокаДанные.Ключ2 = День(СтрокаДанные.ДатаНачала); 
		КонецЦикла;
		
	ИначеЕсли ПериодДетализации =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Месяц") Тогда
		
		Для каждого СтрокаДанные Из ТаблицаДанные  Цикл
			СтрокаДанные.Ключ  = Строка(ФЧ(Год(СтрокаДанные.ДатаНачала))) + Строка(Формат(Месяц(СтрокаДанные.ДатаНачала), "ЧЦ=2; ЧВН=")); 
			СтрокаДанные.Ключ2 = СтрокаДанные.Ключ; 
		КонецЦикла;
		
	ИначеЕсли ПериодДетализации =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Квартал") Тогда
		
		Для каждого СтрокаДанные Из ТаблицаДанные  Цикл
			СтрокаДанные.Ключ  = Строка(ФЧ(Год(СтрокаДанные.ДатаНачала))) + Строка(Формат(Квартал(СтрокаДанные.ДатаНачала), "ЧЦ=2; ЧВН=")); 
			СтрокаДанные.Ключ2 = СтрокаДанные.Ключ; 
		КонецЦикла;
		
	ИначеЕсли ПериодДетализации =ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.год") Тогда
		
		Для каждого СтрокаДанные Из ТаблицаДанные  Цикл
			СтрокаДанные.Ключ  = Строка(ФЧ(Год(СтрокаДанные.ДатаНачала))); 
			СтрокаДанные.Ключ2 = СтрокаДанные.Ключ; 
		КонецЦикла;
		
	КонецЕсли;                        
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанные.ДатаНачала,
	|	ТаблицаДанные.ДатаКонца,
	|	ТаблицаДанные.Значение,
	|	ТаблицаДанные.ЕстьЗначение,
	|	ТаблицаДанные.РеальныеДанные,
	|	ТаблицаДанные.Квота,
	|	ТаблицаДанные.Ключ,
	|	ТаблицаДанные.Ключ2,
	|	ТаблицаДанные.ДанныеВведены
	|ПОМЕСТИТЬ ТаблицаДанные
	|ИЗ
	|	&ТаблицаДанные КАК ТаблицаДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанные.ДатаНачала,
	|	ТаблицаДанные.ДатаКонца,
	|	ТаблицаДанные.Значение,
	|	ТаблицаДанные.ЕстьЗначение,
	|	ТаблицаДанные.РеальныеДанные,
	|	ТаблицаДанные.Квота,
	|	ТаблицаДанные.Ключ2 КАК Ключ2,
	|	ВЫРАЗИТЬ(ТаблицаДанные.Ключ КАК СТРОКА(6)) КАК Ключ
	|ПОМЕСТИТЬ ТаблицаДанные1
	|ИЗ
	|	ТаблицаДанные КАК ТаблицаДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанные1.Ключ
	|ПОМЕСТИТЬ ТаблицаДанные2
	|ИЗ
	|	ТаблицаДанные1 КАК ТаблицаДанные1
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанные1.Ключ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанные21.Ключ,
	|	КОЛИЧЕСТВО(ТаблицаДанные22.Ключ) КАК Ключ1
	|ПОМЕСТИТЬ ТаблицаДанные3
	|ИЗ
	|	ТаблицаДанные2 КАК ТаблицаДанные21
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанные2 КАК ТаблицаДанные22
	|		ПО ТаблицаДанные21.Ключ >= ТаблицаДанные22.Ключ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанные21.Ключ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанные1.ДатаНачала,
	|	ТаблицаДанные1.ДатаКонца,
	|	ТаблицаДанные1.Значение,
	|	ТаблицаДанные1.ЕстьЗначение,
	|	ТаблицаДанные1.РеальныеДанные,
	|	ТаблицаДанные1.Квота,
	|	ТаблицаДанные1.Ключ,
	|	ТаблицаДанные3.Ключ1,
	|	ТаблицаДанные1.Ключ2
	|ПОМЕСТИТЬ ТаблицаДанные4
	|ИЗ
	|	ТаблицаДанные1 КАК ТаблицаДанные1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанные3 КАК ТаблицаДанные3
	|		ПО ТаблицаДанные1.Ключ = ТаблицаДанные3.Ключ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанные4.ДатаНачала,
	|	ТаблицаДанные4.ДатаКонца,
	|	ТаблицаДанные4.Значение,
	|	ТаблицаДанные4.ЕстьЗначение,
	|	ТаблицаДанные4.РеальныеДанные,
	|	ТаблицаДанные4.Квота,
	|	ТаблицаДанные4.Ключ,
	|	ТаблицаДанные4.Ключ1,
	|	ТаблицаДанные4.Ключ2,
	|	isnull(ТаблицаДанные.ДанныеВведены, Ложь) как ДанныеВведены
	|ИЗ
	|	ТаблицаДанные4 КАК ТаблицаДанные4
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанные КАК ТаблицаДанные
	|		ПО ТаблицаДанные4.ДатаНачала = ТаблицаДанные.ДатаНачала
	|			И ТаблицаДанные4.ДатаКонца = ТаблицаДанные.ДатаКонца";

	
	Запрос.УстановитьПараметр("ТаблицаДанные",ТаблицаДанные);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДанные = РезультатЗапроса.Выгрузить();
	
КонецФункции //

Функция СоеденитьТаблицы(СтрПоле) Экспорт
	
	СхемаЗапроса = Новый СхемаЗапроса;
	
	Запрос = Новый Запрос;
	
	ЗапросыПакета    = СхемаЗапроса.ПакетЗапросов;
	ЗапросыПакета.Очистить();
	
	СчетГрафиков = 1;
	Для каждого стрГрафик из стрПоле.Строки  Цикл
		
		ТаблицаДанных = стрГрафик.Данные;
		
		ИмяИсточника = "ТаблицаДанных" + СчетГрафиков;
		
		Запрос.УстановитьПараметр(ИмяИсточника, ТаблицаДанных); 
		
		ЗапросПакета = ЗапросыПакета.Добавить();
		ОператорЗапроса = ЗапросПакета.Операторы[0];
		
		ОператорЗапроса.Источники.Добавить(Тип("ОписаниеВременнойТаблицыСхемыЗапроса"), "&"+ИмяИсточника, ИмяИсточника);
		
		Для каждого КолонкаТаблицыДанных Из ТаблицаДанных.Колонки Цикл
			ОператорЗапроса.ВыбираемыеПоля.Добавить(ИмяИсточника+"."+КолонкаТаблицыДанных.Имя);
		КонецЦикла;
		
		ЗапросПакета.ТаблицаДляПомещения = ИмяИсточника;
		//-------------------------------------------------
		ЗапросПакета = ЗапросыПакета.Добавить();
		
		ОператорЗапроса = ЗапросПакета.Операторы[0];
		ОператорЗапроса.Источники.Добавить(ИмяИсточника, "ВТ"+ИмяИсточника);
		Для каждого КолонкаТаблицыДанных Из ТаблицаДанных.Колонки Цикл
			ОператорЗапроса.ВыбираемыеПоля.Добавить("ВТ"+ИмяИсточника+"."+КолонкаТаблицыДанных.Имя);
		КонецЦикла;
		
		
		ЗапросПакета.ТаблицаДляПомещения = "ВТ"+ИмяИсточника;
		
		СчетГрафиков = СчетГрафиков + 1;
		
	КонецЦикла;
	
	КоличествоГрафиков = СчетГрафиков-1;
	
	ЗапросПакета = ЗапросыПакета.Добавить();
	ОператорЗапроса = ЗапросПакета.Операторы[0];
	
	СчетГрафиков = 1;
	СчетКолонокЗапроса = 0;
	
    ПериодДетализации = СтрПоле.ПериодДетализации;	
	
	Для СчетГрафиков = 1 По КоличествоГрафиков  Цикл
		
		ТаблицаДанных = стрГрафик.Данные;
		ИмяИсточника = "ТаблицаДанных" + СчетГрафиков;
		
		
		Источник = ОператорЗапроса.Источники.Добавить("ВТ"+ИмяИсточника, "ВТ"+ИмяИсточника);
		Если СчетГрафиков = 1 Тогда
			ПервыйИсточник = Источник; 
		Иначе 
			
			ПервыйИсточник.Соединения.Добавить(Источник.Источник.ИмяТаблицы, ПервыйИсточник.Источник.ИмяТаблицы+".Ключ1 = "+Источник.Источник.ИмяТаблицы+".Ключ1");
			
			//Если ПериодДетализации больше недели, то достаточно олного ключа сравнения
			Если ПериодДетализации = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День") 
				Или ПериодДетализации  = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя") Тогда
				ПервыйИсточник.Соединения.Добавить(Источник.Источник.ИмяТаблицы, ПервыйИсточник.Источник.ИмяТаблицы+".Ключ2 = "+Источник.Источник.ИмяТаблицы+".Ключ2");
			КонецЕсли;
			
		КонецЕсли;
		
		Для каждого КолонкаТаблицыДанных Из ТаблицаДанных.Колонки Цикл
			
			ОператорЗапроса.ВыбираемыеПоля.Добавить("ВТ"+ИмяИсточника+"."+КолонкаТаблицыДанных.Имя);
			ЗапросПакета.Колонки[СчетКолонокЗапроса].Псевдоним = КолонкаТаблицыДанных.Имя+"_"+СчетГрафиков;
			
			СчетКолонокЗапроса = СчетКолонокЗапроса + 1;
			
		КонецЦикла;
	КонецЦикла;
	
	Для каждого СоединениеИсточника Из ПервыйИсточник.Соединения Цикл
		СоединениеИсточника.ТипСоединения = ТипСоединенияСхемыЗапроса.ПолноеВнешнее;
	КонецЦикла;
	
	Для СчетГрафиков = 1 По КоличествоГрафиков  Цикл
		ИмяИсточника = "ВТТаблицаДанных" + СчетГрафиков;
		Если СчетГрафиков = 1 Тогда
			ВыражениеКлюч1 = "Выбор Когда не "+ ИмяИсточника +".Ключ1 есть null тогда "+ ИмяИсточника +".Ключ1 "; 
			ВыражениеКлюч2 = "Выбор Когда не "+ ИмяИсточника +".Ключ2 есть null тогда "+ ИмяИсточника +".Ключ2 "; 
		Иначе 
			ВыражениеКлюч1 = ВыражениеКлюч1 + "Когда не "+ ИмяИсточника +".Ключ1 есть null тогда "+ ИмяИсточника +".Ключ1 ";
			ВыражениеКлюч2 = ВыражениеКлюч2 + "Когда не "+ ИмяИсточника +".Ключ2 есть null тогда "+ ИмяИсточника +".Ключ2 ";
		КонецЕсли;
	КонецЦикла;
	
	ВыражениеКлюч1 =ВыражениеКлюч1 + "Иначе ДАТАВРЕМЯ(1,1,1) Конец"; 
	ВыражениеКлюч2 =ВыражениеКлюч2 + "Иначе ДАТАВРЕМЯ(1,1,1) Конец"; 
	
	ОператорЗапроса.ВыбираемыеПоля.Добавить(ВыражениеКлюч1);
	ОператорЗапроса.ВыбираемыеПоля.Добавить(ВыражениеКлюч2);
	
	//!нужно поменять если изменится состав полей 
	НомерКолонкиКлюч1 = ЗапросПакета.Колонки.Количество()-2;
	НомерКолонкиКлюч2 = ЗапросПакета.Колонки.Количество()-1;
	
	ЗапросПакета.Колонки[НомерКолонкиКлюч1].Псевдоним = "Ключ1";
	ЗапросПакета.Колонки[НомерКолонкиКлюч2].Псевдоним = "Ключ2";
	
	ЗапросПакета.Порядок.Добавить(ЗапросПакета.Колонки[НомерКолонкиКлюч1]);
	ЗапросПакета.Порядок.Добавить(ЗапросПакета.Колонки[НомерКолонкиКлюч2]);
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	СводнаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Возврат СводнаяТаблица;
	
КонецФункции

Функция ПолучитьЗначениеИзСводнойТаблицы(СтрокаТаблицы, ИмяКолонки, НомерГрафика, ЗначениеПоУмолчанию) Экспорт
	
	Значение = СтрокаТаблицы[ИмяКолонки + "_"+НомерГрафика];	
	
	Если Не ЗначениеЗаполнено(Значение) и Значение <> 0 Тогда
		Значение = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция УстановитьЗначениеСводнойТаблицы(СтрокаТаблицы, ИмяКолонки, НомерГрафика, Значение) Экспорт
	
	СтрокаТаблицы[ИмяКолонки + "_"+НомерГрафика] = Значение;	

КонецФункции

Функция Квартал(ДатаСреза)
	
	НомерКвартала = 0;
	
	НомерМесяца = Месяц(ДатаСреза);
	Если НомерМесяца >= 1 И НомерМесяца <= 3 Тогда
		НомерКвартала = 1;
	ИначеЕсли	НомерМесяца >= 4 И НомерМесяца <= 6 Тогда
		НомерКвартала = 2;
	ИначеЕсли	НомерМесяца >= 7 И НомерМесяца <= 9 Тогда
		НомерКвартала = 3;
	ИначеЕсли	НомерМесяца >= 10 И НомерМесяца <= 12 Тогда
		НомерКвартала = 4;
	КонецЕсли;
	
	Возврат НомерКвартала;
	
КонецФункции

//возвращает начало недели по данным константы ИА_НачалоНедели
Функция ИА_НачалоНедели(_Дата) Экспорт 
	
	ДатаНачалаНедели = _Дата;
	
	НомерНачалаНедели = Константы.ИА_НачалоНедели.Получить();
	
	//если константа не заполнена, началонедели понедельник
	Если Не ЗначениеЗаполнено(НомерНачалаНедели) Тогда
		НомерНачалаНедели = 1;
	КонецЕсли;
	НомерДняНедели_Даты = ДеньНедели(_Дата);
	
	Если НомерНачалаНедели = НомерДняНедели_Даты  Тогда
		ДатаНачалаНедели = НачалоДня(_Дата);
	ИначеЕсли НомерНачалаНедели < НомерДняНедели_Даты  Тогда
		РазницаДней = (НомерДняНедели_Даты - НомерНачалаНедели);
		ДатаНачалаНедели = НачалоДня(ДобавитьДень(_Дата, -РазницаДней));
	Иначе
		РазницаДней = НомерДняНедели_Даты + (7 - НомерНачалаНедели);
		ДатаНачалаНедели = НачалоДня(ДобавитьДень(_Дата, -РазницаДней));
	КонецЕсли;
	
	Возврат ДатаНачалаНедели;
	
КонецФункции

//возвращает конец недели по данным константы ИА_НачалоНедели
Функция ИА_КонецНедели(_Дата) Экспорт 
	
	ДатаКонцаНедели = _Дата;
	
	НомерНачалаНедели = Константы.ИА_НачалоНедели.Получить();
	
	//если константа не заполнена, началонедели понедельник
	Если Не ЗначениеЗаполнено(НомерНачалаНедели) Тогда
		НомерНачалаНедели = 1;
	КонецЕсли;
	НомерДняНедели_Даты = ДеньНедели(_Дата);
	
	Если НомерНачалаНедели = НомерДняНедели_Даты  Тогда
		ДатаКонцаНедели = КонецДня(ДобавитьДень(_Дата, 6));
	ИначеЕсли НомерНачалаНедели < НомерДняНедели_Даты  Тогда
		РазницаДней = НомерНачалаНедели + (6 - НомерДняНедели_Даты);
		ДатаКонцаНедели = КонецДня(ДобавитьДень(_Дата, РазницаДней));
	Иначе
		РазницаДней = (НомерНачалаНедели - НомерДняНедели_Даты)-1;
		ДатаКонцаНедели = КонецДня(ДобавитьДень(_Дата, РазницаДней));
	КонецЕсли;
	
	Возврат ДатаКонцаНедели;
	
КонецФункции	

//возвращает ближайшее начало недели по данным константы ИА_НачалоНедели
//если от _Дата до конца недели ближе чем до начала, то началом недели является начало следующей недели 
Функция ИА_БлижнийНачалоНедели(_Дата) Экспорт 
	
	ДатаНачалаНедели = ИА_НачалоНедели(_Дата);
	ДатаКонцаНедели  = ИА_КонецНедели(_Дата);
	
	Если Абс(_Дата - ДатаНачалаНедели) <= Абс(_Дата - ДатаКонцаНедели) Тогда
		ДатаБлижнийНачалоНедели = ДатаНачалаНедели;
	иначе
		ДатаБлижнийНачалоНедели = НачалоДня(ДобавитьДень(ДатаКонцаНедели, 1));
	КонецЕсли;
	
	Возврат ДатаБлижнийНачалоНедели;
	
КонецФункции

//возвращает ближайший конец недели по данным константы ИА_НачалоНедели
//если от _Дата до начала  недели ближе чем до конца, то концом недели является конец предидущей недели 
Функция ИА_БлижнийКонецНедели(_Дата)	
	
	ДатаНачалаНедели = ИА_НачалоНедели(_Дата);
	ДатаКонцаНедели  = ИА_КонецНедели(_Дата);
	
	Если Абс(_Дата - ДатаНачалаНедели) >= Абс(_Дата - ДатаКонцаНедели) Тогда
		ДатаБлижнийКонцаНедели = ДатаКонцаНедели;
	иначе
		ДатаБлижнийКонцаНедели = КонецДня(ДобавитьДень(ДатаНачалаНедели, -1));
	КонецЕсли;
	
	Возврат ДатаБлижнийКонцаНедели;
	
КонецФункции

Функция ИА_НачалоНеделиСУчетомРаспределения(_Дата) Экспорт 
	
	ОтображатьНедельныеСтатистикиПоРаспределениюНедель = Константы.ИА_ОтображатьНедельныеСтатистикиПоРаспределениюНедель.Получить();
	
	Если ОтображатьНедельныеСтатистикиПоРаспределениюНедель Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ИА_РаспределениеНедель.Период, ДЕНЬ) КАК НачалоНедели,
		|	КОНЕЦПЕРИОДА(ИА_РаспределениеНедель.КонецНедели, ДЕНЬ) КАК КонецНедели
		|ИЗ
		|	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
		|ГДЕ
		|	ИА_РаспределениеНедель.Период <= &Период
		|	И ИА_РаспределениеНедель.КонецНедели >= &Период";
		
		Запрос.УстановитьПараметр("Период", _Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДатаНачалаНедели = ВыборкаДетальныеЗаписи.НачалоНедели;
		иначе
			ДатаНачалаНедели = ИА_БлижнийНачалоНедели(_Дата);
		КонецЕсли; 	
		
	иначе	
		ДатаНачалаНедели = ИА_БлижнийНачалоНедели(_Дата);
	КонецЕсли;
	
	Возврат ДатаНачалаНедели;
	
КонецФункции

Функция ИА_КонецНеделиСУчетомРаспределения(_Дата) Экспорт 
	
	ОтображатьНедельныеСтатистикиПоРаспределениюНедель = Константы.ИА_ОтображатьНедельныеСтатистикиПоРаспределениюНедель.Получить();
	
	Если ОтображатьНедельныеСтатистикиПоРаспределениюНедель Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ИА_РаспределениеНедель.Период, ДЕНЬ) КАК НачалоНедели,
		|	КОНЕЦПЕРИОДА(ИА_РаспределениеНедель.КонецНедели, ДЕНЬ) КАК КонецНедели
		|ИЗ
		|	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
		|ГДЕ
		|	ИА_РаспределениеНедель.Период <= &Период
		|	И ИА_РаспределениеНедель.КонецНедели >= &Период";
		
		Запрос.УстановитьПараметр("Период", _Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДатаКонцаНедели = ВыборкаДетальныеЗаписи.КонецНедели;
		иначе
			ДатаКонцаНедели = ИА_БлижнийКонецНедели(_Дата);
		КонецЕсли; 	
		
	иначе	
		ДатаКонцаНедели = ИА_БлижнийКонецНедели(_Дата);
	КонецЕсли;
	
	Возврат ДатаКонцаНедели;
	
КонецФункции	

Функция ЕстьСдвигиПериода(СтрокаГрафика) Экспорт
	
	СтрокиДетализации = СтрокаГрафика.Строки;
	Для каждого СтрДетализации Из СтрокиДетализации Цикл
		Если СтрДетализации.СдвигПериода > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//Конец Арчил Тваладзе

//ИА_Арчил Тваладзе 2016.10.05
Функция  ПолучитьПараметрПериодДляСводнойТаблицыРасшифровки(ПараметрыПериод, Знач ЕстьСдвигиПериода, Знач КоличествоТаблиц, Знач ПериодДетализации, Знач стрПериод)  Экспорт
	
	Перем ЗначениеПериода, ИмяКолонкиДатаНачала, НомерТаблицы;
	
	Если ЕстьСдвигиПериода Тогда
		//если сдвиги есть, собираем представление периода, даже если они повторяются, пользователь должен знат в каком столбце какой период. 
		Для НомерТаблицы =1 по КоличествоТаблиц Цикл
			
			ИмяКолонкиДатаНачала = "ДатаНачала_" + НомерТаблицы;
			
			ЗначениеПериода = стрПериод[ИмяКолонкиДатаНачала];
			Если ЗначениеПериода = null Тогда
				ЗначениеПериода = " ~ ";
			Иначе
				ЗначениеПериода = ПолучитьПредставлениеТочкиПериода(ПериодДетализации, стрПериод[ИмяКолонкиДатаНачала]);
			КонецЕсли;
			
			ПараметрыПериод = ПараметрыПериод + ЗначениеПериода + " / ";
			
		КонецЦикла;
		
		ПараметрыПериод = Лев(ПараметрыПериод,СтрДлина(ПараметрыПериод)-3);
	Иначе 
		//если сдвигов нет то периоды все одинковые, и незачем их повторять, берем первый. 
		НомерТаблицы =1;
		ИмяКолонкиДатаНачала = "ДатаНачала_" + НомерТаблицы;
		ЗначениеПериода = стрПериод[ИмяКолонкиДатаНачала];
		ЗначениеПериода = ПолучитьПредставлениеТочкиПериода(ПериодДетализации, стрПериод[ИмяКолонкиДатаНачала]);
		ПараметрыПериод = СокрЛП(ЗначениеПериода);
		
	КонецЕсли;
	
	Возврат ПараметрыПериод;

КонецФункции

Функция ПолучитьПредставлениеТочкиПериода(ПериодДет, ДатаНач) Экспорт 
	
	Если ПериодДет = Перечисления.ИА_ПериодыДетализации.День тогда
		Возврат Формат(ДатаНач,"ДФ=dd.MM.yy");
	ИначеЕсли ПериодДет = Перечисления.ИА_ПериодыДетализации.Неделя тогда
		Возврат Формат(ДатаНач,"ДФ=dd.MM.yy")+"-" + Формат(ДатаНач + 60*60*24*6,"ДФ=dd.MM.yy");
	ИначеЕсли ПериодДет = Перечисления.ИА_ПериодыДетализации.Месяц тогда
		Возврат Формат(ДатаНач,"ДФ=MM.yyyy");
	ИначеЕсли ПериодДет = Перечисления.ИА_ПериодыДетализации.Квартал тогда
		Возврат Формат(ДатаНач,"ДФ=MM.yyyy");
	ИначеЕсли ПериодДет = Перечисления.ИА_ПериодыДетализации.Год тогда
		Возврат Формат(ДатаНач,"ДФ=yyyy");
	КонецЕсли;
	
КонецФункции
//Конец ИА_Арчил Тваладзе 2016.10.05

Функция ВычФормулу(пФормула) Экспорт
	пФормула =  стрзаменить(пФормула,символ(160),"");
	пФормула =  стрзаменить(пФормула," ","");
	пФормула =  стрзаменить(пФормула,",",".");
	Возврат Вычислить(пФормула);
КонецФункции