&НаКлиенте
Перем ПредВыдОбл, МассивПредЦветов,ФормаСтатистик, формаНовогоЗаказа, СостояниеЗаказаОдобренКлиент;

&НаСервере
Процедура ЗаполнитьДеревоДоходов()

	дер = РеквизитФормыВЗначение("ДоходыДерево");
	дер.Строки.Очистить();
	Для каждого стр из Объект.Доходы Цикл
		Если ИспДоходыПоПодразделениям Тогда
			стрПодр = дер.Строки.Найти(стр.Подразделение, "ВидДохода");
			Если стрПодр = Неопределено Тогда
				стрПодр = дер.Строки.Добавить();
				стрПодр.ВидДохода = стр.Подразделение; 
			КонецЕсли;
		Иначе
			стрПодр = дер;
		КонецЕсли;
		
		стрДоход = стрПодр.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(стрДоход, стр);
	КонецЦикла;
	
	Если ИспДоходыПоПодразделениям ТОгда
		ЗаполнитьИтогиДеревоДоходов(дер);
	КонецЕсли;
	ЗначениеВРеквизитФормы(дер,"ДоходыДерево");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиДеревоДоходов(дер)
	Для каждого стр из дер.Строки Цикл
		стр.СуммаБезнал = стр.строки.итог("СуммаБезнал");
	КонецЦикла;
	
	Элементы.ДоходыДеревоСуммаБезнал.ТекстПодвала = формат(дер.строки.итог("СуммаБезнал", ложь),"ЧДЦ=2; ЧН=");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоДоходовЧистых()
	
	дер = РеквизитФормыВЗначение("ДоходыЧистые");
	дер.Строки.Очистить();
	
	Для каждого стр из Объект.Доходы Цикл
		Если ИспДоходыПоПодразделениям Тогда
			стрПодр = дер.Строки.Найти(стр.Подразделение, "ВидДохода");
			Если стрПодр = Неопределено Тогда
				стрПодр = дер.Строки.Добавить();
				стрПодр.ВидДохода = стр.Подразделение; 
				стрПодр.ЭтоПодразделение = истина;
			КонецЕсли;
		Иначе
			стрПодр = дер;
		КонецЕсли;
		
		стрДоход = стрПодр.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(стрДоход, стр);
		стрДоход.Сумма = стр.СуммаБезнал;
	КонецЦикла;
	ЗначениеВРеквизитФормы(дер,"ДоходыЧистые");

КонецПроцедуры
	 
 &НаСервере
Процедура ЗаполнитьДоходыИПолитикиСервер(ЗаполнитьДоходы, ЗаполнитьДоходыИтого, ЗаполнитьПолитику1, ЗаполнитьПолитику2, ЗаполнитьЗапросы = ложь, НеОчищатьРучные = Ложь)
	
	Если Объект.Организация.Пустая() и ФППоОрганизациям Тогда
		возврат;
	КонецЕсли;
	
	Об = РеквизитФормыВЗначение("Объект");    
    ИА_ФПСервер.ЗаполнитьДокумент(Об, ЗаполнитьДоходы, ЗаполнитьДоходыИтого, ЗаполнитьПолитику1, ЗаполнитьПолитику2,ЗаполнитьЗапросы, НеОчищатьРучные, ПредФп, ФП_по_ТБ,,ИспДоходыПоПодразделениям);
    ЗначениеВРеквизитФормы(Об, "Объект");
	
	ЗаполнитьДеревоДоходов();
	ЗаполнитьДеревоДоходовЧистых();
	Если ФП_по_ТБ Тогда
		ОбновитьНеделиДоходыЧистые();
		ПересчитатьДоходыИтого();
		ОбновитьИтогоВЗаливку();
	КонецЕсли;

	ПересчитатьСальдоСредствКРаспределению();
	
	Если ЗаполнитьПолитику1 Тогда
    	Политика_ВДерево(1);
	КонецЕсли;	
	
	Если ЗаполнитьПолитику2 тогда
		Если ФП_по_ТБ Тогда		
			ОбновитьЗаливку();
			ПоказатьНедели();
		Иначе
			Политика_ВДерево(2);
		КонецЕсли;		
	КонецЕсли;
	
	ОбновитьФинПоказатели();
		
	ОбновитьИтогиПолитик();
	
	ОбновитьОтчетПоСотояниюФондов();
	ОбновитьНадписьТБ();
	УстановитьПараметрыСпискаВДПС();

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаВДПС()
	ВнедоходныеПоступления.Параметры.УстановитьЗначениеПараметра("Организация", объект.Организация);
	ВнедоходныеПоступления.Параметры.УстановитьЗначениеПараметра("НеПоОрг", не ФППоОрганизациям);
	
	СтрНед = тзНедели.НайтиСтроки(Новый Структура("НачалоНедели", Объект.НеделяТБ));
	
	Если СтрНед.Количество() = 0 Тогда
		ВнедоходныеПоступления.Параметры.УстановитьЗначениеПараметра("ДатаНачалаТБ", ДатаПредыдущегоФП);
		ВнедоходныеПоступления.Параметры.УстановитьЗначениеПараметра("ДатаКонцаТБ", Объект.Дата-1);
	Иначе
		ВнедоходныеПоступления.Параметры.УстановитьЗначениеПараметра("ДатаНачалаТБ", СтрНед[0].НачалоНедели);
		ВнедоходныеПоступления.Параметры.УстановитьЗначениеПараметра("ДатаКонцаТБ", КонецДня(СтрНед[0].КонецНедели));
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьНеделиДоходыЧистые()
	ДохДер = РеквизитФормыВЗначение("ДоходыЧистые");
	
	для сч = 1 по 12 цикл
		Элементы["ДоходыЧистыеГруппа"+сч].Видимость = ложь;
		Элементы["ИтогоВЗаливкуНеделя"+сч].Видимость = ложь;
		Элементы["ДоходыИтогоГруппа"+сч].Видимость = ложь;
		
		Если ЭтоВеб ТОгда
			Элементы["ДоходыЧистыеГруппа"+сч].ЦветфонаЗаголовка = новый цвет();
		КонецЕсли;
		для каждого стр из ДохДер.Строки Цикл
			стр["СуммаПлан"+сч] = 0;
			стр["СуммаФакт"+сч] = 0;
			для каждого стр1 из стр.Строки Цикл
				стр1["СуммаПлан"+сч] = 0;
				стр1["СуммаФакт"+сч] = 0;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	долги = новый ТаблицаЗначений;
	долги.Колонки.Добавить("Подразделение");
	долги.Колонки.Добавить("ВидДохода");
	долги.Колонки.Добавить("Сумма");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ДатаДок", Объект.Дата+1);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекМесяц", Объект.МесяцТБ);
	Запрос.УстановитьПараметр("ТекНеделя", Объект.НеделяТБ);
	Запрос.УстановитьПараметр("тзДох", Объект.Доходы.Выгрузить());
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ТекНеделя КАК Неделя,
	               |	ТЗ_Доходы.Подразделение КАК Подразделение,
	               |	ТЗ_Доходы.ВидДохода КАК ВидДохода,
	               |	ТЗ_Доходы.СуммаБезнал КАК Сумма
	               |ПОМЕСТИТЬ ТЗ_Доходы
	               |ИЗ
	               |	&тзДох КАК ТЗ_Доходы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Подзапрос.ВидДохода КАК ВидДохода,
	               |	Подзапрос.Подразделение КАК Подразделение,
	               |	Подзапрос.Неделя КАК Неделя,
	               |	СУММА(Подзапрос.СуммаПлан) КАК СуммаПлан,
	               |	СУММА(Подзапрос.СуммаФакт) КАК СуммаФакт
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Обороты.ВидДохода КАК ВидДохода,
	               |		Обороты.Подразделение КАК Подразделение,
	               |		Обороты.Неделя КАК Неделя,
	               |		Обороты.СуммаПриход КАК СуммаПлан,
	               |		Обороты.СуммаРасход КАК СуммаФакт
	               |	ИЗ
	               |		РегистрНакопления.КСУ_РаспределениеДоходовТБ.Обороты(
	               |				,
	               |				&ДатаДок,
	               |				Регистратор,
	               |				Организация = &Организация
	               |					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Обороты
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |			ПО Обороты.Неделя = ИА_РаспределениеНедель.Период
	               |				И (ИА_РаспределениеНедель.Месяц = &ТекМесяц)
	               |	ГДЕ
	               |		Обороты.Регистратор <> &Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТЗ_Доходы.ВидДохода,
	               |		ТЗ_Доходы.Подразделение,
	               |		ТЗ_Доходы.Неделя,
	               |		0,
	               |		ЕСТЬNULL(ТЗ_Доходы.Сумма, 0)
	               |	ИЗ
	               |		ТЗ_Доходы КАК ТЗ_Доходы) КАК Подзапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Подзапрос.ВидДохода,
	               |	Подзапрос.Подразделение,
	               |	Подзапрос.Неделя";
	Рез = Запрос.Выполнить().Выгрузить();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_РаспределениеНедель.Период КАК НачалоНедели,
	               |	ИА_РаспределениеНедель.КонецНедели КАК КонецНедели,
	               |	РАЗНОСТЬДАТ(ИА_РаспределениеНедель.Период, ИА_РаспределениеНедель.КонецНедели, ДЕНЬ) + 1 КАК КолДней
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Месяц = &ТекМесяц
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НачалоНедели";
	тзНедель = Запрос.Выполнить().Выгрузить();
	
	КолНед = тзНедель.Количество();
	НомерКолонки = 1;
	ТекНедНомер = 0;
	Пока ТекНедНомер < КолНед Цикл
		неделя = тзНедель[ТекНедНомер];
		
		//// ДАННЫЕ
		СтрокиДох = Рез.НайтиСтроки(Новый Структура("Неделя",неделя.НачалоНедели));
		для каждого стрДох из СтрокиДох Цикл
			Если ИспДоходыПоПодразделениям ТОгда
				отбор = новый структура("ВидДохода", стрДох.Подразделение);
			Иначе
				отбор = новый структура("ВидДохода", стрДох.ВидДохода);
			КонецЕсли;
			Нстроки = ДохДер.Строки.НайтиСтроки(отбор);
			Если Нстроки.количество() = 0 ТОгда
				ТекСтрока = ДохДер.Строки.Добавить();
				Если ИспДоходыПоПодразделениям ТОгда
					ТекСтрока.ВидДохода = стрДох.Подразделение;
				Иначе
					ТекСтрока.ВидДохода = стрДох.ВидДохода;
				КонецЕсли;
			Иначе
				ТекСтрока = Нстроки[0];		
			КонецЕсли;
			
			Если ИспДоходыПоПодразделениям ТОгда
				отбор = новый структура("ВидДохода", стрДох.ВидДохода);
				Нстроки = ТекСтрока.Строки.НайтиСтроки(отбор);
				Если Нстроки.количество() = 0 ТОгда
					ТекСтрока = ТекСтрока.Строки.Добавить();		
					ТекСтрока.ВидДохода = стрДох.ВидДохода;
				Иначе
					ТекСтрока = Нстроки[0];		
				КонецЕсли;

			КонецЕсли;
						
			ТекСтрока["СуммаПлан"+НомерКолонки] = стрДох.СуммаПлан;
			ТекСтрока["СуммаФакт"+НомерКолонки] = стрДох.СуммаФакт;
		КонецЦикла;	
		
		//// КОЛОНКА
		ЭлКолонка = Элементы["ДоходыЧистыеГруппа"+НомерКолонки];
		ЭлКолонкаВЗаливку = Элементы["ИтогоВЗаливкуНеделя"+НомерКолонки];
		ЭлКолонкаДохИтого = Элементы["ДоходыИтогоГруппа"+НомерКолонки];
		ЭлКолонкаИтогоНеделя = Элементы["ДоходыИтогоНеделя"+НомерКолонки];
		ЭлКолонкаФакт = Элементы["ДоходыИтогоСуммаФакт"+НомерКолонки];
		
		ЭлКолонкаФакт.Формат = ?(неделя.НачалоНедели <= Объект.НеделяТБ, "ЧДЦ=2; ЧН=", "ЧДЦ=2; ЧН=-");
		
		ЭлКолонка.Видимость = истина;
		ЭлКолонка.Заголовок = Формат(неделя.НачалоНедели,"ДФ=dd.MM")+"-"+Формат(неделя.КонецНедели,"ДФ=dd.MM")+ " ( "+неделя.колДней+" дн )";
		
		ЭлКолонкаВЗаливку.Видимость = истина;
		ЭлКолонкаВЗаливку.Заголовок = Формат(неделя.НачалоНедели,"ДФ=dd.MM")+"-"+Формат(неделя.КонецНедели,"ДФ=dd.MM");
		
		ЭлКолонкаДохИтого.Видимость = истина;
		ЭлКолонкаДохИтого.Заголовок = ЭлКолонкаВЗаливку.Заголовок;
		
		Если Объект.НеделяТБ = неделя.НачалоНедели Тогда 
			ЭлКолонка.ШрифтЗаголовка = новый шрифт(ЭлКолонка.ШрифтЗаголовка,,,истина);
			ЭлКолонка.ЦветФонаЗаголовка = новый цвет(220,220,255);
			
			ЭлКолонкаВЗаливку.ШрифтЗаголовка = новый шрифт(ЭлКолонкаВЗаливку.ШрифтЗаголовка,,,истина);
			ЭлКолонкаВЗаливку.Шрифт = новый шрифт(ЭлКолонкаВЗаливку.Шрифт,,,истина);
			ЭлКолонкаВЗаливку.ЦветФонаЗаголовка = новый цвет(220,220,255);
			ЭлКолонкаВЗаливку.ЦветФона = новый цвет(240,240,255);
			
			ЭлКолонкаДохИтого.ШрифтЗаголовка = новый шрифт(ЭлКолонкаДохИтого.ШрифтЗаголовка,,,истина);
			ЭлКолонкаДохИтого.ЦветФонаЗаголовка = новый цвет(220,220,255);
			
			ЭлКолонкаИтогоНеделя.ШрифтПодвала = новый шрифт(ЭлКолонкаИтогоНеделя.ШрифтПодвала,,,истина);
			
			НомерТекущейНедели = ТекНедНомер + 1;
		Иначе
			ЭлКолонка.ШрифтЗаголовка = новый шрифт(ЭлКолонка.ШрифтЗаголовка,,,ложь);
			ЭлКолонка.ЦветФонаЗаголовка = новый цвет();
			
			ЭлКолонкаВЗаливку.ШрифтЗаголовка = новый шрифт(ЭлКолонкаВЗаливку.ШрифтЗаголовка,,,ложь);
			ЭлКолонкаВЗаливку.Шрифт = новый шрифт(ЭлКолонкаВЗаливку.Шрифт,,,ложь);
			ЭлКолонкаВЗаливку.ЦветФонаЗаголовка = новый цвет();
			ЭлКолонкаВЗаливку.ЦветФона = новый цвет();
			
			ЭлКолонкаДохИтого.ШрифтЗаголовка = новый шрифт(ЭлКолонкаДохИтого.ШрифтЗаголовка,,,ложь);
			ЭлКолонкаДохИтого.ЦветФонаЗаголовка = новый цвет();
			
			ЭлКолонкаИтогоНеделя.ШрифтПодвала = новый шрифт(ЭлКолонкаИтогоНеделя.ШрифтПодвала,,,ложь);
		КонецЕсли;
		
		
		для каждого подчЭл из Элементы["ДоходыЧистыеГруппа"+НомерКолонки].ПодчиненныеЭлементы Цикл
			Если Объект.НеделяТБ = неделя.НачалоНедели Тогда
				Если найти(подчЭл.Имя, "ДоходыИтогоСуммаФакт")>0 Тогда
					подчЭл.Шрифт = новый шрифт(подчЭл.Шрифт,,,истина);
					подчЭл.ШрифтЗаголовка = новый шрифт(подчЭл.ШрифтЗаголовка,,,истина);
				КонецЕсли;
				подчЭл.ЦветФона = новый цвет(240,240,255);
				
				подчЭл.ЦветФонаЗаголовка = новый цвет(220,220,255);
			Иначе
				подчЭл.Шрифт = новый шрифт(подчЭл.Шрифт,,,ложь);
				подчЭл.ШрифтЗаголовка = новый шрифт(подчЭл.ШрифтЗаголовка,,,ложь);
				подчЭл.ЦветФона = новый Цвет();
				
				подчЭл.ЦветФонаЗаголовка = новый цвет();
			КонецЕсли;
		КонецЦикла;
		
		для каждого подчЭл из ЭлКолонкаДохИтого.ПодчиненныеЭлементы Цикл
			Если Объект.НеделяТБ = неделя.НачалоНедели Тогда
				подчЭл.ЦветФона = новый цвет(240,240,255);
				подчЭл.ЦветФонаЗаголовка = новый цвет(220,220,255);
			Иначе
				подчЭл.ЦветФона = новый Цвет();
				подчЭл.ЦветФонаЗаголовка = новый цвет();
			КонецЕсли;
		КонецЦикла;
		
		//// /КОЛОНКА
		
		ТекНедНомер = ТекНедНомер + 1;
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	
	/// Пересчет долгов
	счН = 0;
	ВсегоРеалНед = тзНедель.Количество();
	Пока счН < ВсегоРеалНед Цикл
		НомерКолонки = счН + 1;
		ОсталосьНедель = ВсегоРеалНед - (счН + 1);
		
		Если ИспДоходыПоПодразделениям Тогда
			для каждого СтрПодр из ДохДер.Строки Цикл
				для каждого стрДоход из СтрПодр.Строки Цикл
					ПересчетСтрокиДоходыИтого(стрДоход, долги, НомерКолонки, ОсталосьНедель, тзНедель, счН);	
				КонецЦикла;	
			КонецЦикла;
		Иначе
			для каждого стрДоход из ДохДер.Строки Цикл
				ПересчетСтрокиДоходыИтого(стрДоход, долги, НомерКолонки, ОсталосьНедель, тзНедель, счН);	
			КонецЦикла;
		КонецЕсли;
		счН = счН + 1;
	КонецЦикла;
	
	/// Итоги по неделям
	для сч = 1 по тзНедель.Количество() цикл	// было до 12
		неделя = тзНедель[сч-1];
		
		Если ИспДоходыПоПодразделениям Тогда
			Для каждого СтрПодр из ДохДер.Строки Цикл
				сумПлИтого = СтрПодр.Строки.Итог("СуммаПлан"+сч);
				сумФкИтого = СтрПодр.Строки.Итог("СуммаФакт"+сч);
				СтрПодр["СуммаПлан"+сч] = сумПлИтого;
				СтрПодр["СуммаФакт"+сч] = сумФкИтого;
				процИтого = 0;
				Если сумПлИтого> 0 ТОгда
					процИтого = сумФкИтого * 100 / сумПлИтого;
				КонецЕсли;
				СтрПодр["Процент"+сч] = формат(процИтого,"ЧДЦ=2; ЧН=");
			КонецЦикла;
		КонецЕсли;
		
		сумПлИтого = ДохДер.Строки.Итог("СуммаПлан"+сч, ложь);
		сумФкИтого = ДохДер.Строки.Итог("СуммаФакт"+сч, ложь);
		
		Если неделя.НачалоНедели > объект.НеделяТБ Тогда
			Элементы["ДоходыИтогоСуммаФакт"+сч].ТекстПодвала = "-";
		ИНаче
			Элементы["ДоходыИтогоСуммаФакт"+сч].ТекстПодвала = формат(сумФкИтого,"ЧДЦ=2; ЧН=");
		КонецЕсли;
		процИтого = 0;
		Если сумПлИтого> 0 ТОгда
			Элементы["ДоходыИтогоСуммаПлан"+сч].ТекстПодвала = формат(сумПлИтого,"ЧДЦ=2; ЧН=");
			процИтого = сумФкИтого * 100 / сумПлИтого;
		Иначе
			Элементы["ДоходыИтогоСуммаПлан"+сч].ТекстПодвала = "0,00";
		КонецЕсли;
		
		Если неделя.НачалоНедели > объект.НеделяТБ Тогда
			Элементы["ДоходыИтогоПроцент"+сч].ТекстПодвала = "";
		Иначе
			Элементы["ДоходыИтогоПроцент"+сч].ТекстПодвала = формат(процИтого,"ЧДЦ=2; ЧН=");
			Если процИтого < 100 Тогда
				Элементы["ДоходыИтогоПроцент"+сч].ЦветТекстаПодвала = Новый цвет(255,0,0);
			Иначе
				Элементы["ДоходыИтогоПроцент"+сч].ЦветТекстаПодвала = Новый цвет(60, 167, 94);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// проценты, итоги по подр-ям
	Рез.Свернуть("Подразделение,ВидДохода","СуммаПлан,СуммаФакт");
	Если ИспДоходыПоПодразделениям Тогда
		Для каждого стрПодр из ДохДер.Строки Цикл
			ПересчетПроцентаСтрокиДохода(Рез, стрПодр.Строки, ВсегоРеалНед, тзНедель);
			стрПодр.Сумма = стрПодр.Строки.Итог("Сумма");
		КонецЦикла;
	Иначе
		ПересчетПроцентаСтрокиДохода(Рез, ДохДер.Строки, ВсегоРеалНед, тзНедель);
	КонецЕсли;
	
	итПлан = Рез.Итог("СуммаПлан");
	Если итПлан>0 Тогда
		итФакт = Рез.Итог("СуммаФакт");
		итОтклонение = итФакт - итПлан;
		
		Элементы.ДоходыИтогоПроцентВыполнения.ТекстПодвала = формат(итФакт*100/итПлан,"ЧДЦ=2; ЧН=");	
		Элементы.ДоходыЧистыеСуммаПлан.ТекстПодвала = формат(итПлан,"ЧДЦ=2; ЧН=");
		Элементы.ДоходыЧистыеСуммаФакт.ТекстПодвала = формат(итФакт,"ЧДЦ=2; ЧН=");
		Элементы.ДоходыЧистыеСуммаОтклонение.ТекстПодвала = формат(итОтклонение,"ЧДЦ=2; ЧН=");
	
	КонецЕсли;
	
	Если НомерТекущейНедели > 0 Тогда
		объект.ПланЧистогоДоходаТекНедели = ДохДер.Строки.Итог("СуммаПлан"+НомерТекущейНедели);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДохДер,"ДоходыЧистые");
	ЗначениеВРеквизитФормы(тзНедель, "тзНедели");
КонецПроцедуры

&НаСервере
Процедура ПересчетПроцентаСтрокиДохода(Рез, строки, ВсегоРеалНед, тзНедель)
		
	ИтогоПлан = 0;
	ИтогоФакт = 0;
	Для каждого стр из Строки Цикл
		стр.СуммаПлан = 0;
		стр.СуммаФакт = 0;
		стр.СуммаОтклонение = 0;
		
		Если ИспДоходыПоПодразделениям Тогда
			нСтроки = Рез.НайтиСтроки(новый Структура("Подразделение,ВидДохода", стр.Родитель.ВидДохода, стр.ВидДохода));
		Иначе
			нСтроки = Рез.НайтиСтроки(новый Структура("ВидДохода", стр.ВидДохода));
		КонецЕсли;
			
		Если нСтроки.Количество()>0 Тогда
			СтрокаПланФакт = нСтроки[0];
			
			стр.СуммаПлан = СтрокаПланФакт.СуммаПлан;
			стр.СуммаФакт = СтрокаПланФакт.СуммаФакт;
			стр.СуммаОтклонение = стр.СуммаФакт - стр.СуммаПлан;
			Если нСтроки[0].суммаПлан > 0 Тогда
				стр.ПроцентВыполнения = СтрокаПланФакт.СуммаФакт*100/СтрокаПланФакт.СуммаПлан;
			КонецЕсли;
			ИтогоПлан = ИтогоПлан + СтрокаПланФакт.СуммаПлан;
			ИтогоФакт = ИтогоФакт + СтрокаПланФакт.СуммаФакт;
		Иначе
			стр.ПроцентВыполнения = "--";
		КонецЕсли;
		
		// Округление
		ИтогоПланПоСтроке = 0;
		Для счН = 1 по ВсегоРеалНед Цикл
			Если тзНедель[счН - 1].НачалоНедели <= объект.НеделяТБ Тогда
				Если счН = ВсегоРеалНед ТОгда // последняя - текущая
					ИтогоПланПоСтроке = ИтогоПланПоСтроке + стр["СуммаПлан" + счН];	
				Иначе
					ИтогоПланПоСтроке = ИтогоПланПоСтроке + стр["СуммаФакт" + счН];
				КонецЕсли;
			Иначе
				ИтогоПланПоСтроке = ИтогоПланПоСтроке + стр["СуммаПлан" + счН];	
			КонецЕсли;			
		КонецЦикла;
		Дельта = ИтогоПланПоСтроке - стр.СуммаПлан;
		Если ВсегоРеалНед > 0 Тогда
			стр["СуммаПлан" + ВсегоРеалНед] = стр["СуммаПлан" + ВсегоРеалНед] -  Дельта;
			ИтогоПлан = ИтогоПлан -  Дельта;
		КонецЕсли;
	КонецЦикла;

	Если ИтогоПлан >0 и ИспДоходыПоПодразделениям Тогда
		строки.родитель.ПроцентВыполнения = ИтогоФакт*100/ИтогоПлан;
		строки.родитель.СуммаПлан = ИтогоПлан;
		строки.родитель.СуммаФакт = ИтогоФакт;
		строки.родитель.СуммаОтклонение = ИтогоФакт - ИтогоПлан;
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Процедура ПересчетСтрокиДоходыИтого(стрДоход, долги, НомерКолонки, ОсталосьНедель, тзНедель, счН)
	Если ИспДоходыПоПодразделениям Тогда
		нСтрокиДолг = долги.НайтиСтроки(новый Структура("Подразделение,ВидДохода", стрДоход.Родитель.ВидДохода, стрДоход.ВидДохода));
	ИНаче
		нСтрокиДолг = долги.НайтиСтроки(новый Структура("ВидДохода", стрДоход.ВидДохода));
	КонецЕсли;
	долг =0 ;
	Если нСтрокиДолг.Количество()>0 Тогда
		СтрокаДолг = нСтрокиДолг[0];
		долг = СтрокаДолг.сумма;
	Иначе
		СтрокаДолг = долги.Добавить();
		СтрокаДолг.ВидДохода = стрДоход.ВидДохода;
		Если ИспДоходыПоПодразделениям Тогда
			СтрокаДолг.Подразделение = стрДоход.Родитель.ВидДохода;
		КонецЕсли;
		СтрокаДолг.Сумма = 0;
	КонецЕсли;
		
	КолДней = (тзНедель[счН].КонецНедели - тзНедель[счН].НачалоНедели) / (60*60*24) + 1;
	стрДоход["СуммаПлан"+НомерКолонки] = стрДоход["СуммаПлан"+НомерКолонки] + долг*КолДней;
	
	Если ОсталосьНедель > 0 и тзНедель[счН].НачалоНедели<=Объект.НеделяТБ Тогда
		КолНед = тзНедель.Количество();
		Коэф = (тзНедель[КолНед-1].КонецНедели - тзНедель[КолНед - ОсталосьНедель].НачалоНедели) / (60*60*24) + 1;
		СтрокаДолг.сумма = СтрокаДолг.сумма + (стрДоход["СуммаПлан"+НомерКолонки] - стрДоход["СуммаФакт"+НомерКолонки])/Коэф;
	КонецЕсли;
	
	Если стрДоход["СуммаПлан"+НомерКолонки]>0 Тогда
		стрДоход["Процент"+НомерКолонки] =стрДоход["СуммаФакт"+НомерКолонки] * 100 /стрДоход["СуммаПлан"+НомерКолонки];
	Иначе
		Если стрДоход["СуммаФакт"+НомерКолонки] > 0 Тогда
			стрДоход["Процент"+НомерКолонки] = -1;
		Иначе
			стрДоход["Процент"+НомерКолонки] = 0;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьСтрокиПолитик(СтрокиДерева, ИспПодразделения)
	// Переменные расходы
	п1Строка = СтрокиДерева.добавить();
	Если ИспПодразделения Тогда
		п1Строка.Подразделение = "ПЕРЕМЕННЫЕ РАСХОДЫ";
	Иначе
		п1Строка.Фонд = "ПЕРЕМЕННЫЕ РАСХОДЫ";
	КонецЕсли;
	п1Строка.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы;
	п1Строка.ЭтоЗаголовок = Истина;
	
	// Маржа
	мСтрока = СтрокиДерева.добавить();
	Если ИспПодразделения Тогда
		мСтрока.Подразделение = "МАРЖИНАЛЬНАЯ ПРИБЫЛЬ";
	Иначе
		мСтрока.Фонд = "МАРЖИНАЛЬНАЯ ПРИБЫЛЬ";
	КонецЕсли;
	мСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль;
	мСтрока.ЭтоЗаголовок = Истина;
	
	// учредительские фонды
	УФСтрока = СтрокиДерева.добавить();
	Если ИспПодразделения Тогда
		УФСтрока.Подразделение = "ФОНДЫ ИЗ МАРЖИ";
	Иначе
		УФСтрока.Фонд = "ФОНДЫ ИЗ МАРЖИ";
	КонецЕсли;
	УФСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды;
	УФСтрока.ЭтоЗаголовок = Истина;
	
	// Итого на заливку
	иСтрока = СтрокиДерева.добавить();
	Если ИспПодразделения Тогда
		иСтрока.Подразделение = "ИТОГО К РАСПРЕДЕЛЕНИЮ";
	Иначе
		иСтрока.Фонд = "ИТОГО К РАСПРЕДЕЛЕНИЮ";
	КонецЕсли;
	иСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ИтогКЗаливке;
	иСтрока.ЭтоЗаголовок = Истина;
		
	// ПОстоянные расходы
	ЗалСтрока = СтрокиДерева.добавить();
	Если ИспПодразделения Тогда
		ЗалСтрока.Подразделение = "ПОСТОЯННЫЕ РАСХОДЫ";
	Иначе
		ЗалСтрока.Фонд = "ПОСТОЯННЫЕ РАСХОДЫ";
	КонецЕсли;
	ЗалСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы;
	ЗалСтрока.ЭтоЗаголовок = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтрокуПоТипуСтроки(Дерево, ТипСтроки)
	Для каждого стр из Дерево.Строки Цикл
		Если стр.ТипСтроки = ТипСтроки Тогда
			возврат стр;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ОбновитьЗаливку()
	
	ДеревоРасходы = РеквизитФормыВЗначение("ЗаливкаИтого");
	ДеревоРасходы.строки.Очистить();
	
	// убираем видимость колонок
	для сч = 1 по 14 цикл
		ВидимостьКолонок[сч - 1].Видимость = ложь;
		ВидимостьКолонок[сч - 1].ТекущаяНеделя = ложь;
	КонецЦикла;
	
	// получаем праметры недели: ТекМесяц, ТекНеделя, ЭтоПоследняяНеделя, КолНедельДоКонца, ДатаФП, ПоследняяНеделя, ДатаДокФП
	ТекПарам = ИА_ФПСервер.ПолучитьПараметрыТекРаспределения(Объект.Организация, Объект.Дата);
	Если ТекПарам = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокСсылка", Объект.Ссылка);	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);	
	Запрос.УстановитьПараметр("ДатаФП", ТекПарам.ДатаФП); // дата со сдвигом по константе - начало или конец дня
	Запрос.УстановитьПараметр("ДатаДокФП", ТекПарам.ДатаДокФП); // дата документа
	Запрос.УстановитьПараметр("КолНедельДоКонца", ТекПарам.КолНедельДоКонца);	
	Запрос.УстановитьПараметр("ТекМесяц", ТекПарам.ТекМесяц);	
	Запрос.УстановитьПараметр("ТекНеделя", ТекПарам.ТекНеделя);		
	Запрос.УстановитьПараметр("ИспПодр", ИспПодразделения);		
	ЗаливкаФондовТЗ = Объект.ЗаливкаФондов.Выгрузить();
	//
	если ЗаливкаФондовТЗ.Количество() = 0 Тогда
		Новстр = ЗаливкаФондовТЗ.Добавить();
		Новстр.неделя = ТекПарам.ТекНеделя;
	КонецЕсли;
	//
	Запрос.УстановитьПараметр("тз", ЗаливкаФондовТЗ);
	
	тзП1 = Объект.Политика1.Выгрузить();
	тзП1.Свернуть("Подразделение,Статья","Сумма");
	Запрос.УстановитьПараметр("тзПолитика1", тзП1);
	Запрос.УстановитьПараметр("тзУчредФонды", Объект.УчредительскиеФонды.Выгрузить());
	//////////////////////////////////////////////////////////////////////////
	
	// Таблица недель
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ИА_РаспределениеНедель.Период КАК НачалоНедели,
	//               |	ИА_РаспределениеНедель.КонецНедели
	//               |ИЗ
	//               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	//               |ГДЕ
	//               |	ИА_РаспределениеНедель.Месяц = &ТекМесяц
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	НачалоНедели";
	//тзНедель = Запрос.Выполнить().Выгрузить();
	тзНедель = РеквизитФормыВЗначение("тзНедели");

	
	// временные таблицы с заливкой текущего документ	
	Запрос.Текст = "ВЫБРАТЬ
	               |	тз.Неделя КАК Неделя,
	               |	тз.Подразделение КАК Подразделение,
	               |	тз.Фонд КАК Фонд,
	               |	тз.Сумма КАК Сумма
	               |ПОМЕСТИТЬ ТЗ_Заливка
	               |ИЗ
	               |	&тз КАК тз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ТекНеделя КАК Неделя,
	               |	тзПолитика1.Подразделение КАК Подразделение,
	               |	тзПолитика1.Статья КАК Фонд,
	               |	тзПолитика1.Сумма КАК Сумма
	               |ПОМЕСТИТЬ ТЗ_Политика1
	               |ИЗ
	               |	&тзПолитика1 КАК тзПолитика1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ТекНеделя КАК Неделя,
	               |	тзУчредФонды.Подразделение КАК Подразделение,
	               |	тзУчредФонды.Фонд КАК Фонд,
	               |	тзУчредФонды.Сумма КАК Сумма
	               |ПОМЕСТИТЬ ТЗ_УчредФонды
	               |ИЗ
	               |	&тзУчредФонды КАК тзУчредФонды";	
	Запрос.Выполнить();
	
	// Расчет Политики1 (переменные расходы)
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подзапрос.Подразделение КАК Подразделение,
	               |	Подзапрос.Фонд КАК Фонд,
	               |	Подзапрос.Неделя КАК Неделя,
	               |	Подзапрос.СуммаПлан КАК СуммаПлан,
	               |	Подзапрос.СуммаФакт + ЕСТЬNULL(ТЗ_Политика1.Сумма, 0) КАК СуммаФакт
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Обороты.Подразделение КАК Подразделение,
	               |		Обороты.Фонд КАК Фонд,
	               |		Обороты.Неделя КАК Неделя,
	               |		СУММА(Обороты.СуммаПриход) КАК СуммаПлан,
	               |		СУММА(ВЫБОР
	               |				КОГДА Обороты.Неделя > &ТекНеделя
	               |						ИЛИ Обороты.Период > &ДатаДокФП
	               |					ТОГДА 0
	               |				ИНАЧЕ ЕСТЬNULL(Обороты.СуммаРасход, 0)
	               |			КОНЕЦ) КАК СуммаФакт
	               |	ИЗ
	               |		РегистрНакопления.КСУ_ЗаливкаПолитики1.Обороты(
	               |				,
	               |				,
	               |				Регистратор,
	               |				Организация = &Организация
	               |					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Обороты
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |			ПО Обороты.Неделя = ИА_РаспределениеНедель.Период
	               |				И (ИА_РаспределениеНедель.Месяц = &ТекМесяц)
	               |	ГДЕ
	               |		Обороты.Регистратор <> &ДокСсылка
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Обороты.Подразделение,
	               |		Обороты.Фонд,
	               |		Обороты.Неделя) КАК Подзапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ_Политика1 КАК ТЗ_Политика1
	               |		ПО Подзапрос.Подразделение = ТЗ_Политика1.Подразделение
	               |			И Подзапрос.Фонд = ТЗ_Политика1.Фонд
	               |			И Подзапрос.Неделя = ТЗ_Политика1.Неделя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КСУ_ПорядокРаспределенияПоФондам.СрезПоследних(
	               |				&ДатаДокФП,
	               |				НомерПолитики = 1
	               |					И (Организация = &Организация
	               |						ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК ПорядокФондов
	               |		ПО Подзапрос.Подразделение = ПорядокФондов.Подразделение
	               |			И Подзапрос.Фонд = ПорядокФондов.Фонд
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПорядокФондов.Порядок";
	тзРезП1 = Запрос.Выполнить().Выгрузить();
	
	// Расчет учредительских фондоы
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подзапрос.Подразделение КАК Подразделение,
	               |	Подзапрос.Фонд КАК Фонд,
	               |	Подзапрос.Неделя КАК Неделя,
	               |	Подзапрос.СуммаПлан КАК СуммаПлан,
	               |	Подзапрос.СуммаФакт + ЕСТЬNULL(ТЗ_УчредФонды.Сумма, 0) КАК СуммаФакт
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВЫБОР
	               |			КОГДА &ИспПодр
	               |				ТОГДА Обороты.Подразделение
	               |			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ИА_ЦФО.ПустаяСсылка)
	               |		КОНЕЦ КАК Подразделение,
	               |		Обороты.Фонд КАК Фонд,
	               |		Обороты.Неделя КАК Неделя,
	               |		СУММА(Обороты.СуммаПриход) КАК СуммаПлан,
	               |		СУММА(ВЫБОР
	               |				КОГДА Обороты.Неделя > &ТекНеделя
	               |						ИЛИ Обороты.Период > &ДатаДокФП
	               |					ТОГДА 0
	               |				ИНАЧЕ ЕСТЬNULL(Обороты.СуммаРасход, 0)
	               |			КОНЕЦ) КАК СуммаФакт
	               |	ИЗ
	               |		РегистрНакопления.КСУ_УчредительскиеФонды.Обороты(
	               |				,
	               |				,
	               |				Регистратор,
	               |				Организация = &Организация
	               |					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Обороты
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |			ПО Обороты.Неделя = ИА_РаспределениеНедель.Период
	               |				И (ИА_РаспределениеНедель.Месяц = &ТекМесяц)
	               |	ГДЕ
	               |		Обороты.Регистратор <> &ДокСсылка
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Обороты.Подразделение,
	               |		Обороты.Фонд,
	               |		Обороты.Неделя) КАК Подзапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ_УчредФонды КАК ТЗ_УчредФонды
	               |		ПО Подзапрос.Подразделение = ТЗ_УчредФонды.Подразделение
	               |			И Подзапрос.Фонд = ТЗ_УчредФонды.Фонд
	               |			И Подзапрос.Неделя = ТЗ_УчредФонды.Неделя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВЫБОР
	               |				КОГДА &ИспПодр
	               |					ТОГДА КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Подразделение
	               |				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ИА_ЦФО.ПустаяСсылка)
	               |			КОНЕЦ КАК Подразделение,
	               |			КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Фонд КАК Фонд,
	               |			МИНИМУМ(КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Порядок) КАК Порядок
	               |		ИЗ
	               |			РегистрСведений.КСУ_ПорядокРаспределенияПоФондам.СрезПоследних(
	               |					&ДатаДокФП,
	               |					Организация = &Организация
	               |						ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК КСУ_ПорядокРаспределенияПоФондамСрезПоследних
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Подразделение,
	               |			КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Фонд) КАК ПорядокФондов
	               |		ПО Подзапрос.Подразделение = ПорядокФондов.Подразделение
	               |			И Подзапрос.Фонд = ПорядокФондов.Фонд
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПорядокФондов.Порядок";
	тзРезУчредФонды = Запрос.Выполнить().Выгрузить();
	
	// Расчет заливки
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подзапрос.Неделя КАК Неделя,
	               |	Подзапрос.Подразделение КАК Подразделение,
	               |	Подзапрос.Фонд КАК Фонд,
	               |	СУММА(Подзапрос.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ЗаливкаФакт
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КСУ_РаспределениеТБ.Неделя КАК Неделя,
	               |		КСУ_РаспределениеТБ.Подразделение КАК Подразделение,
	               |		КСУ_РаспределениеТБ.Фонд КАК Фонд,
	               |		КСУ_РаспределениеТБ.Сумма КАК Сумма
	               |	ИЗ
	               |		РегистрНакопления.КСУ_РаспределениеТБ КАК КСУ_РаспределениеТБ
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |			ПО КСУ_РаспределениеТБ.Неделя = ИА_РаспределениеНедель.Период
	               |				И (ИА_РаспределениеНедель.Месяц = &ТекМесяц)
	               |	ГДЕ
	               |		КСУ_РаспределениеТБ.ВидДвижения = ЗНАЧЕНИЕ(виддвижениянакопления.расход)
	               |		И КСУ_РаспределениеТБ.Период < &ДатаДокФП
	               |		И (КСУ_РаспределениеТБ.Организация = &Организация
	               |				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТЗ_Заливка.Неделя,
	               |		ТЗ_Заливка.Подразделение,
	               |		ТЗ_Заливка.Фонд,
	               |		ТЗ_Заливка.Сумма
	               |	ИЗ
	               |		ТЗ_Заливка КАК ТЗ_Заливка) КАК Подзапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Подзапрос.Неделя,
	               |	Подзапрос.Подразделение,
	               |	Подзапрос.Фонд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КСУ_РаспределениеТБ.Неделя КАК Неделя,
	               |	КСУ_РаспределениеТБ.Подразделение КАК Подразделение,
	               |	КСУ_РаспределениеТБ.Фонд КАК Фонд,
	               |	МАКСИМУМ(КСУ_РаспределениеТБ.СуммаПриход) КАК Сумма
	               |ПОМЕСТИТЬ ЗаливкаПлан
	               |ИЗ
	               |	РегистрНакопления.КСУ_РаспределениеТБ.Обороты(
	               |			,
	               |			,
	               |			,
	               |			Организация = &Организация
	               |				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК КСУ_РаспределениеТБ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |		ПО КСУ_РаспределениеТБ.Неделя = ИА_РаспределениеНедель.Период
	               |			И (ИА_РаспределениеНедель.Месяц = &ТекМесяц)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КСУ_РаспределениеТБ.Неделя,
	               |	КСУ_РаспределениеТБ.Подразделение,
	               |	КСУ_РаспределениеТБ.Фонд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	План.Неделя КАК Неделя,
	               |	План.Подразделение КАК Подразделение,
	               |	План.Фонд КАК Фонд,
	               |	План.Сумма КАК СуммаПлан,
	               |	ЕСТЬNULL(Заливка.Сумма, 0) КАК СуммаЗаливка
	               |ИЗ
	               |	ЗаливкаПлан КАК План
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаливкаФакт КАК Заливка
	               |		ПО План.Неделя = Заливка.Неделя
	               |			И План.Подразделение = Заливка.Подразделение
	               |			И План.Фонд = Заливка.Фонд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КСУ_ПорядокРаспределенияПоФондам.СрезПоследних(
	               |				&ДатаДокФП,
	               |				НомерПолитики = 2
	               |					И (Организация = &Организация
	               |						ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК ПорядокФондов
	               |		ПО План.Подразделение = ПорядокФондов.Подразделение
	               |			И План.Фонд = ПорядокФондов.Фонд
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Неделя,
	               |	ПорядокФондов.Порядок";
	Заливка = запрос.Выполнить().Выгрузить();
		
	долги = новый ТаблицаЗначений;
	долги.Колонки.Добавить("Подразделение");
	долги.Колонки.Добавить("Фонд");
	долги.Колонки.Добавить("Сумма");
	
	Переливка = новый ТаблицаЗначений;
	Переливка.Колонки.Добавить("Неделя");
	Переливка.Колонки.Добавить("Подразделение");
	Переливка.Колонки.Добавить("Фонд");
	Переливка.Колонки.Добавить("Сумма");

	// добавим строки политик
	Если ИспДоходыПоПодразделениям Тогда
		тзПодр = Заливка.Скопировать();
		тзПодр.Свернуть("Подразделение");
		Для каждого стрПодр из тзПодр Цикл
			НовстрПодр = ДеревоРасходы.строки.добавить(); 
			НовстрПодр.Подразделение = стрПодр.Подразделение;
			
			СоздатьСтрокиПолитик(НовстрПодр.строки, ИспПодразделения);
		КонецЦикла;
	Иначе
		СоздатьСтрокиПолитик(ДеревоРасходы.строки, ИспПодразделения);
	КонецЕсли;
	//
	
	КолНед = тзНедель.Количество();
	ТекНедНомер = 0;
	НомерКолонки = 1;
	Пока ТекНедНомер < КолНед Цикл
		неделя = тзНедель[ТекНедНомер];
		ТекНеделя = неделя.НачалоНедели;
		
		/// КОЛОНКА
		ВидимостьКолонок[НомерКолонки - 1].Видимость = истина;
		ЭлКолонка = Элементы["ЗаливкаФондовИтогоГруппа"+НомерКолонки];
		ЭлКолонка.Заголовок = Формат(неделя.НачалоНедели,"ДФ=dd.MM")+"-"+Формат(неделя.КонецНедели,"ДФ=dd.MM");
		
		ЭлКолонкаФакт = Элементы["ЗаливкаФондов_ИтогоСуммаФакт"+НомерКолонки];		
		ЭлКолонкаФакт.Формат = ?(неделя.НачалоНедели <= ТекПарам.ТекНеделя, "ЧДЦ=2; ЧН=", "ЧДЦ=2; ЧН=-");
		
		Если ТекПарам.ТекНеделя = неделя.НачалоНедели Тогда
			НомерТекущейНедели = НомерКолонки;
			ЭлКолонка.ШрифтЗаголовка = новый шрифт(ЭлКолонка.ШрифтЗаголовка,,,истина);
		Иначе
			ЭлКолонка.ШрифтЗаголовка = новый шрифт(ЭлКолонка.ШрифтЗаголовка,,,ложь);
		КонецЕсли;
		
		для каждого подчЭл из ЭлКолонка.ПодчиненныеЭлементы Цикл
			Если ТекПарам.ТекНеделя = неделя.НачалоНедели Тогда
				Если найти(подчЭл.Имя, "ЗаливкаФондов_ИтогоСуммаФакт")>0 Тогда
					//подчЭл.Шрифт = новый шрифт(подчЭл.Шрифт,,,истина);
					//подчЭл.ШрифтЗаголовка = новый шрифт(подчЭл.ШрифтЗаголовка,,,истина);
				КонецЕсли;
				подчЭл.ЦветФона = новый цвет(240,240,255);
				подчЭл.ЦветФонаЗаголовка = новый цвет(220,220,255);
				ЭлКолонка.ЦветФонаЗаголовка = новый цвет(220,220,255);
				//
				ВидимостьКолонок[НомерКолонки - 1].ТекущаяНеделя = истина;
			Иначе
				подчЭл.Шрифт = новый шрифт(подчЭл.Шрифт,,,ложь);
				подчЭл.ШрифтЗаголовка = новый шрифт(подчЭл.ШрифтЗаголовка,,,ложь);
				подчЭл.ЦветФона = новый Цвет();
				подчЭл.ЦветФонаЗаголовка = новый Цвет();
				ЭлКолонка.ЦветФонаЗаголовка = новый Цвет();
			КонецЕсли;
		КонецЦикла;

		
		///////
		/// Политика 1
		///////
		СтрокиП1 = тзРезП1.НайтиСтроки(Новый Структура("Неделя",неделя.НачалоНедели));
		для каждого стрП1 из СтрокиП1 Цикл
			ТекСтрока = Неопределено;
			
			// найдем строку с фондом или добавим ее
			Если ИспДоходыПоПодразделениям ТОгда
				стрПодр = ДеревоРасходы.Строки.Найти(стрП1.Подразделение);
				Если стрПодр <> Неопределено И стрПодр.Строки.Количество() > 0 Тогда
					СтрДерП1 = ПолучитьСтрокуПоТипуСтроки(стрПодр, Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы);
					
					отбор = новый структура("Фонд", стрП1.Фонд);
					Нстроки = СтрДерП1.строки.НайтиСтроки(отбор);
					Если Нстроки.Количество() = 0 Тогда
						ТекСтрока = СтрДерП1.строки.добавить(); 
						ЗаполнитьЗначенияСвойств(ТекСтрока,стрП1);
						ТекСтрока.номерПолитики = 1;
						ТекСтрока.типСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы;
					Иначе
						ТекСтрока = Нстроки[0];
					КонецЕсли;
				КонецЕсли;
			Иначе
				СтрДерП1 = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы);
				
				отбор = новый структура("Подразделение, Фонд", стрП1.Подразделение, стрП1.Фонд);
				Нстроки = СтрДерП1.строки.НайтиСтроки(отбор);
				Если Нстроки.Количество() = 0 Тогда
					ТекСтрока = СтрДерП1.строки.добавить(); 
					ЗаполнитьЗначенияСвойств(ТекСтрока,стрП1);
					ТекСтрока.номерПолитики = 1;
					ТекСтрока.типСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы;
				Иначе
					ТекСтрока = Нстроки[0];
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТекСтрока <> Неопределено тогда
				ТекСтрока["СуммаПоФП"+НомерКолонки] = стрП1.СуммаПлан;
				ТекСтрока["Сумма"+НомерКолонки] = стрП1.СуммаФакт;
			КонецЕсли;
		КонецЦикла;

		///////
		// МАРЖА
		///////
		
		Если ИспДоходыПоПодразделениям Тогда
			Для каждого стрПодр из тзПодр Цикл
				СтрДохИт = Объект.ДоходыИтого.НайтиСтроки(Новый структура("Подразделение" ,стрПодр.Подразделение));
				стрПодрДер = ДеревоРасходы.Строки.Найти(стрПодр.Подразделение);
				
				СтрДерП1 = ПолучитьСтрокуПоТипуСтроки(стрПодрДер, Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы);
				СтрДерМаржа = ПолучитьСтрокуПоТипуСтроки(стрПодрДер, Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль);
				СтрДерМаржа["Сумма" + НомерКолонки] = 0;
					
				Если стрПодрДер <> Неопределено И стрПодрДер.Строки.Количество() > 0 И СтрДохИт.Количество() > 0 Тогда
					
					ДоходИтого = 0;
					Для каждого стрДохНайд из СтрДохИт Цикл
						ДоходИтого = ДоходИтого + стрДохНайд["Неделя" + НомерКолонки];
					КонецЦикла;
					
					РасходыП1 = СтрДерП1.Строки.Итог("Сумма" + НомерКолонки);
					СтрДерМаржа["Сумма" + НомерКолонки] = ДоходИтого - РасходыП1;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ДоходИтого = Объект.ДоходыИтого.Итог("Неделя" + НомерКолонки);
			
			СтрДерП1 = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы);
			РасходыП1 = СтрДерП1.Строки.Итог("Сумма" + НомерКолонки);
			
			СтрДерМаржа = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль);
			СтрДерМаржа["Сумма" + НомерКолонки] = ДоходИтого - РасходыП1;
		КонецЕсли;
		
		///////
		// УЧРЕДИТЕЛЬСКИЕ ФОНДЫ
		///////
		
		СтрокиУФ = тзРезУчредФонды.НайтиСтроки(Новый Структура("Неделя",неделя.НачалоНедели));
		для каждого стрУФ из СтрокиУФ Цикл
			ТекСтрока = Неопределено;
			
			// найдем строку с фондом или добавим ее
			Если ИспДоходыПоПодразделениям ТОгда
				стрПодр = ДеревоРасходы.Строки.Найти(стрУФ.Подразделение);
				Если стрПодр <> Неопределено И стрПодр.Строки.Количество() > 0 Тогда
					СтрДерУФ = ПолучитьСтрокуПоТипуСтроки(стрПодр, Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды);
					
					отбор = новый структура("Фонд", стрУФ.Фонд);
					Нстроки = СтрДерУФ.строки.НайтиСтроки(отбор);
					Если Нстроки.Количество() = 0 Тогда
						ТекСтрока = СтрДерУФ.строки.добавить(); 
						ЗаполнитьЗначенияСвойств(ТекСтрока,стрУФ);
						ТекСтрока.номерПолитики = 3;
						ТекСтрока.типСтроки = Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды;
					Иначе
						ТекСтрока = Нстроки[0];
					КонецЕсли;
				КонецЕсли;
			Иначе
				СтрДерУФ = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды);
				
				отбор = новый структура("Подразделение, Фонд", стрУФ.Подразделение, стрУФ.Фонд);
				Нстроки = СтрДерУФ.строки.НайтиСтроки(отбор);
				Если Нстроки.Количество() = 0 Тогда
					ТекСтрока = СтрДерУФ.строки.добавить(); 
					ЗаполнитьЗначенияСвойств(ТекСтрока, стрУФ);
					ТекСтрока.номерПолитики = 3;
					ТекСтрока.типСтроки = Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды;
				Иначе
					ТекСтрока = Нстроки[0];
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТекСтрока <> Неопределено тогда
				ТекСтрока["СуммаПоФП"+НомерКолонки] = стрУФ.СуммаПлан;
				ТекСтрока["Сумма"+НомерКолонки] = стрУФ.СуммаФакт;
			КонецЕсли;
		КонецЦикла;
		
		
		///////
		// ИТОГО К РАСПРЕДЕЛЕНИЮ
		///////
		
		Если ИспДоходыПоПодразделениям Тогда
			Для каждого стрПодр из тзПодр Цикл
			    стрПодрДер = ДеревоРасходы.Строки.Найти(стрПодр.Подразделение);
				Если стрПодрДер <> Неопределено И стрПодрДер.Строки.Количество() > 0 Тогда
					СтрМаржа = ПолучитьСтрокуПоТипуСтроки(стрПодрДер, Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль);
					СтрУчред = ПолучитьСтрокуПоТипуСтроки(стрПодрДер, Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды);
					
					СтрИтогоКРаспр = ПолучитьСтрокуПоТипуСтроки(стрПодрДер, Перечисления.КСУ_ВидыСтрокТБ.ИтогКЗаливке);
					СтрИтогоКРаспр["Сумма" + НомерКолонки] = СтрМаржа["Сумма" + НомерКолонки] - СтрУчред.Строки.итог("Сумма" + НомерКолонки);
				КонецЕсли;
			КонецЦикла;
		Иначе
			СтрМаржа = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль);
			СтрУчред = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды);
			
			СтрИтогоКРаспр = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.ИтогКЗаливке);
			СтрИтогоКРаспр["Сумма" + НомерКолонки] = СтрМаржа["Сумма" + НомерКолонки] - СтрУчред.Строки.итог("Сумма" + НомерКолонки);
		КонецЕсли;

		
		///////
		/// ЗАЛИВКА
		///////
		
		СтрокиЗаливки = Заливка.НайтиСтроки(новый Структура("неделя", ТекНеделя));
		
		для каждого стрСуммаФП из СтрокиЗаливки Цикл
						
			// найдем строку с фондом или добавим ее
			Если ИспДоходыПоПодразделениям ТОгда
				стрПодр = ДеревоРасходы.Строки.Найти(стрСуммаФП.Подразделение);
				
				СтрП2 = ПолучитьСтрокуПоТипуСтроки(стрПодр, Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы);
				
				отбор = новый структура("Фонд", стрСуммаФП.Фонд);
				Нстроки = СтрП2.строки.НайтиСтроки(отбор);
				Если Нстроки.Количество() = 0 Тогда
					ТекСтрока = СтрП2.строки.добавить(); 
					ЗаполнитьЗначенияСвойств(ТекСтрока,стрСуммаФП);
					ТекСтрока.номерПолитики = 2;
					ТекСтрока.типСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы;
				Иначе
					ТекСтрока = Нстроки[0];
				КонецЕсли;
			Иначе
				отбор = новый структура("Подразделение, Фонд", стрСуммаФП.Подразделение, стрСуммаФП.Фонд);
				
				СтрП2 = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы);
				
				Нстроки = СтрП2.строки.НайтиСтроки(отбор);
				Если Нстроки.Количество() = 0 Тогда
					ТекСтрока = СтрП2.строки.добавить(); 
					ЗаполнитьЗначенияСвойств(ТекСтрока,стрСуммаФП);
					ТекСтрока.номерПолитики = 2;
					ТекСтрока.типСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы;
				Иначе
					ТекСтрока = Нстроки[0];
				КонецЕсли;
			КонецЕсли;
									
			// заполним суммы			
			долг =0 ;
			Перелив =0 ;
									
			нСтрокиДолг = долги.НайтиСтроки(новый Структура("Подразделение,Фонд", стрСуммаФП.Подразделение,стрСуммаФП.Фонд));			
			Если нСтрокиДолг.Количество()>0 Тогда
				долг = нСтрокиДолг[0].сумма;
			КонецЕсли;
		
			ТекСтрока["СуммаПоФП"+НомерКолонки] = стрСуммаФП.СуммаПлан + долг;
			ТекСтрока["Сумма"+НомерКолонки] = стрСуммаФП.СуммаЗаливка;													
			
			Если ТекНеделя <= ТекПарам.ТекНеделя Тогда // Заполним долги
				ОсталосьНедель = КолНед - (ТекНедНомер + 1); // ТекНедНомер - начинается с 0
				Если ТекСтрока["Сумма"+НомерКолонки] < ТекСтрока["СуммаПоФП"+НомерКолонки] и ОсталосьНедель > 0 Тогда 			
					долг = ТекСтрока["СуммаПоФП"+НомерКолонки] - ТекСтрока["Сумма"+НомерКолонки];				
					Новстр = долги.Добавить();
					ЗаполнитьЗначенияСвойств(Новстр,стрСуммаФП);
					Новстр.Сумма = долг / ОсталосьНедель;								
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		ТекНедНомер = ТекНедНомер + 1;
		НомерКолонки = НомерКолонки + 1;
		
		долги.Свернуть("Подразделение, Фонд", "Сумма");
	КонецЦикла;
	
	///// Пересчет плана переменных расходов
	счН = 0;
	долги.Очистить();
	Пока счН < КолНед Цикл
		НомерКолонки = счН + 1;
		ОсталосьНедель = КолНед - (счН + 1);
		
		Если ИспДоходыПоПодразделениям Тогда
			Для каждого стрПодр из тзПодр Цикл
				стрПодр1 = ДеревоРасходы.Строки.Найти(стрПодр.Подразделение);
				
				СтрП1 = ПолучитьСтрокуПоТипуСтроки(стрПодр1, Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы);

				ПересчетПланаП1Заливки(СтрП1.строки, долги, ДеревоРасходы, НомерКолонки, счН, ОсталосьНедель, тзНедель, ТекПарам);
			КонецЦикла;
		Иначе
			СтрП1 = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы);
			
			ПересчетПланаП1Заливки(СтрП1.строки, долги, ДеревоРасходы, НомерКолонки, счН, ОсталосьНедель, тзНедель, ТекПарам);
		КонецЕсли;
		
		счН = счН + 1;
	КонецЦикла;

	//////
	
	//итоги по неделям
	для сч = 1 по 14 цикл
		Если ИспДоходыПоПодразделениям ТОгда
			для каждого стрПодр из ДеревоРасходы.Строки Цикл
				ПересчетИтогиПоНеделямЗаливки(стрПодр, ДеревоРасходы, сч);
				
				ИтСуммФакт = 0;
				ИтСуммПлан = 0;
				Для каждого стрПодчПодр из стрПодр.строки Цикл
					Если стрПодчПодр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль или стрПодчПодр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ИтогКЗаливке Тогда
						Продолжить;
					КонецЕсли;
					
					ИтСуммФакт = ИтСуммФакт + стрПодчПодр["Сумма"+сч];
					ИтСуммПлан = ИтСуммПлан + стрПодчПодр["СуммаПоФП"+сч];
					
				КонецЦикла;
				
				стрПодр["Сумма"+сч] = ИтСуммФакт;
				стрПодр["СуммаПоФП"+сч] = ИтСуммПлан;
			КонецЦикла;
		Иначе
			ПересчетИтогиПоНеделямЗаливки(ДеревоРасходы, ДеревоРасходы, сч);
		КонецЕсли;
		
		ИтогоСумма = 0;
		ИтогоСуммаПоФП = 0;
		Для каждого стрДР из ДеревоРасходы.строки Цикл
			Если стрДР.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль или стрДР.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ИтогКЗаливке Тогда
				Продолжить;
			КонецЕсли;
			
			ИтогоСумма = ИтогоСумма + стрДР["Сумма"+сч];
			ИтогоСуммаПоФП = ИтогоСуммаПоФП + стрДР["СуммаПоФП"+сч];
		КонецЦикла;
		
		//Элементы["ЗаливкаФондов_ИтогоСуммаФакт"+сч].ТекстПодвала = формат(ДеревоРасходы.строки.Итог("Сумма"+сч, ложь),"ЧДЦ=2; ЧН=");
		//Элементы["ЗаливкаФондов_ИтогоСуммаПоФП"+сч].ТекстПодвала = формат(ДеревоРасходы.Строки.Итог("СуммаПоФП"+сч, ложь),"ЧДЦ=2; ЧН=");
		
		Элементы["ЗаливкаФондов_ИтогоСуммаФакт"+сч].ТекстПодвала = формат(ИтогоСумма,"ЧДЦ=2; ЧН=");
		Элементы["ЗаливкаФондов_ИтогоСуммаПоФП"+сч].ТекстПодвала = формат(ИтогоСуммаПоФП,"ЧДЦ=2; ЧН=");
		
		
		Если сч > НомерТекущейНедели Тогда
			Если ИтогоСумма = 0 Тогда
				Элементы["ЗаливкаФондов_ИтогоСуммаФакт"+сч].ТекстПодвала = "-";
			КонецЕсли;
		Иначе
			Если ИтогоСумма < ИтогоСуммаПоФП Тогда
				Элементы["ЗаливкаФондов_ИтогоСуммаФакт"+сч].ЦветТекстаПодвала = Новый цвет(255,0,0);
			Иначе
				Элементы["ЗаливкаФондов_ИтогоСуммаФакт"+сч].ЦветТекстаПодвала = Новый цвет(60, 167, 94);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Проценты 
	Для каждого стр1 из ДеревоРасходы.Строки Цикл
		РасчетПроцентаСтроки(стр1, КолНед, тзРезП1, Заливка, ИспДоходыПоПодразделениям);
	КонецЦикла;
		
	ЗначениеВРеквизитФормы(ДеревоРасходы,"ЗаливкаИтого");
КонецПроцедуры


&НаСервереБезКонтекста
Процедура РасчетПроцентаСтроки(стр, КолНед, тзРезП1, Заливка, ИспДоходыПоПодразделениям)
	Если стр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ИтогКЗаливке или стр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль ТОгда // они без плана
		возврат;
	КонецЕсли;
	
	план = 0;
	факт = 0;
	Если стр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы Тогда // по ним особый расчет т.к. план у них плавает
		Если стр.ЭтоЗаголовок Тогда
			Если ИспДоходыПоПодразделениям ТОгда
				Нстроки = тзРезП1.найтиСтроки(Новый структура("Подразделение", стр.Родитель.Подразделение));
			Иначе
				Нстроки = тзРезП1;
			КонецЕсли;
		ИНаче
			Нстроки = тзРезП1.найтиСтроки(Новый структура("Подразделение,Фонд", стр.Подразделение, стр.Фонд));
		КонецЕсли;
		для каждого стрп1 из Нстроки Цикл
			план = план + стрп1.СуммаПлан;
			факт = факт + стрп1.СуммаФакт;
		КонецЦикла;
	ИначеЕсли стр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы Тогда 
		Если стр.ЭтоЗаголовок Тогда
			Если ИспДоходыПоПодразделениям ТОгда
				Нстроки = Заливка.найтиСтроки(Новый структура("Подразделение", стр.Родитель.Подразделение));
			Иначе
				Нстроки = Заливка;
			КонецЕсли;
		ИНаче
			Нстроки = Заливка.найтиСтроки(Новый структура("Подразделение,Фонд", стр.Подразделение, стр.Фонд));
		КонецЕсли;
		для каждого стрп1 из Нстроки Цикл
			план = план + стрп1.СуммаПлан;
			факт = факт + стрп1.СуммаЗаливка;
		КонецЦикла;
	Иначе
		для сч = 1 по КолНед Цикл
			план = план + стр["СуммаПоФП"+сч];
			факт = факт + стр["Сумма"+сч];
		КонецЦикла;
	КонецЕсли;
	
	стр.СуммаПлан = план;
	стр.СуммаФакт = факт;
	стр.СуммаОтклонение = факт - план;
	стр.ПроцентВыполнения = ?(план = 0, 0, (факт / план) * 100);
	
	Для каждого стр2 из стр.Строки Цикл
		РасчетПроцентаСтроки(стр2, КолНед, тзРезП1, Заливка, ИспДоходыПоПодразделениям);
	КонецЦикла;
КонецПроцедуры
	
&НаСервере
Процедура ПересчетИтогиПоНеделямЗаливки(СтрокаРасчета, тзЗаливка, сч)
	
	Для каждого стр из СтрокаРасчета.Строки Цикл
		Если стр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль или стр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ИтогКЗаливке Тогда
			Продолжить;
		КонецЕсли;
		стр["СуммаПоФП"+сч] = стр.строки.итог("СуммаПоФП"+сч);
		стр["Сумма"+сч] = стр.строки.итог("Сумма"+сч);
	КонецЦикла;	
КонецПроцедуры


&НаСервере
Процедура ПересчетПланаП1Заливки(СтрокиП1, долги, тзЗаливка, НомерКолонки, счН, ОсталосьНедель, тзНедели, ТекПарам)
	для каждого стрФонд из СтрокиП1 Цикл
		нСтрокиДолг = долги.НайтиСтроки(новый Структура("Подразделение,Фонд", стрФонд.Подразделение,стрФонд.Фонд));
		долг =0 ;
		Если нСтрокиДолг.Количество()>0 Тогда
			СтрокаДолг = нСтрокиДолг[0];
			долг = СтрокаДолг.сумма;
		Иначе
			СтрокаДолг = долги.Добавить();
			СтрокаДолг.Подразделение = стрФонд.Подразделение; 
			СтрокаДолг.Фонд = стрФонд.Фонд;
			СтрокаДолг.Сумма = 0;
		КонецЕсли;
		
		стрФонд["СуммаПоФП"+НомерКолонки] = стрФонд["СуммаПоФП"+НомерКолонки] + долг;
		
		Если ОсталосьНедель > 0 и тзНедели[счН].НачалоНедели<=ТекПарам.ТекНеделя Тогда
			СтрокаДолг.сумма = СтрокаДолг.сумма + (стрФонд["СуммаПоФП"+НомерКолонки] - стрФонд["Сумма"+НомерКолонки])/ОсталосьНедель;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
	
&НаСервере
Процедура Политика_ВДерево(НомерПолитики)
	
	Об = РеквизитФормыВЗначение("ДеревоПолитика"+НомерПолитики);
	ТабПолитика = Объект["Политика"+НомерПолитики].Выгрузить();
    Об.Строки.Очистить(); 
    
    
    //ТабРазделы   = ИА_БФС.ТЗ_Свернуть(ТабПолитика, "Раздел", "СуммаНал, СуммаБезнал");
	ТабРазделы = ТабПолитика.Скопировать();
	ТабРазделы.Свернуть("Раздел", "Сумма");
	
    Отбор = Новый Структура("Раздел");
	
	
	Если НомерПолитики = 1 Тогда
		Итоги = Новый Структура("Сумма", Объект.ДоходыИтого.Итог("СуммаБезнал"));
	Иначе
    	Итоги = Новый Структура("Сумма", Объект.ВаловаяПрибыльСуммаБезнал);
	КонецЕсли;
    
    
	Для каждого СтрРаздел Из ТабРазделы Цикл
		Если ИспользоватьРазделы Тогда
    		СтрокаРаздел = Об.Строки.Добавить();
        	ЗаполнитьЗначенияСвойств(СтрокаРаздел, СтрРаздел);
		Иначе
			СтрокаРаздел = Об;
		КонецЕсли;
        
        Таб = ИА_БФС.ТЗ_ФильтрПоОтбору(ТабПолитика, Новый Структура("Раздел", СтрРаздел.Раздел));
		Таб.Свернуть("Раздел,Подразделение,Статья","Сумма");
        
        Для каждого Стр Из Таб Цикл
        	СтрокаДетали = СтрокаРаздел.Строки.Добавить();
            ЗаполнитьЗначенияСвойств(СтрокаДетали, Стр);
        КонецЦикла;  
		
		Если ИспользоватьРазделы Тогда
	        Итоги.Сумма   = Итоги.Сумма - Таб.Итог("Сумма");
	        СтрокаРаздел.Сумма = Таб.Итог("Сумма");
	        
	    	СтрокаСКД = Об.Строки.Добавить();
	        СтрокаСКД.Раздел = "СКД:";
			СтрокаСКД.Сумма = Итоги.Сумма;	
		КонецЕсли;
    КонецЦикла;    
	
	ЗначениеВРеквизитФормы(Об, "ДеревоПолитика"+НомерПолитики); 
    
КонецПроцедуры
 
&НаКлиенте
Процедура Политика_Развернуть(НомерПолитики, ТекСтрока = Неопределено)
	Если НомерПолитики = 1 Тогда
		Рекв = ДеревоПолитика1;
		Элем = Элементы.ДеревоПолитика1;
	Иначе
		Рекв = ДеревоПолитика2;
		Элем = Элементы.ДеревоПолитика2;
	КонецЕсли;
	
    ИА_БФК.ДФ_РазвернутьВсеВетки(Рекв, Элем);
	
	Если ТекСтрока <> Неопределено Тогда
		ПредСтрока = ПолучитьСтрокуПолитика(ТекСтрока.Раздел, ТекСтрока.Статья, ТекСтрока.Подразделение, НомерПолитики);
		Если ПредСтрока <> Неопределено Тогда
			Элем.ТекущаяСтрока = ПредСтрока;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетРасшифровкиВидаДохода(ВидДохода, Подразделение)
	Об = РеквизитФормыВЗначение("Объект");
    Возврат ИА_ФПСервер.СформироватьОтчетРасшифровкиВидаДохода(Об, ВидДохода, Подразделение);
КонецФункции
 
&НаСервере
Функция СформироватьОтчетРасшифровкиПолитика(КлючиСтроки, НомерПолитики)
	Об = РеквизитФормыВЗначение("Объект");
    Возврат ИА_ФПСервер.СформироватьОтчетРасшифровкиПолитика(Об, КлючиСтроки, НомерПолитики);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
    	Отказ = Истина; 
		СтандартнаяОбработка = Ложь;
		возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() ТОгда
		Объект.Дата = НачалоДня(ТекущаяДата())-1;  
		объект.АвтоотклонениеЗаказовПослеФП = Константы.КСУ_АвтоотклонениеЗаказовПослеФП.Получить();
		объект.АвтосборДоходов = истина;
		объект.ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	для сч = 1 по 14 Цикл
		Новстр = ВидимостьКолонок.Добавить();
	КонецЦикла;
	
	ФП_по_ТБ = ИА_ФП_ПовторИсп.ФП_по_ТБ(Объект.Дата);
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	ФпНаСледДень = не Константы.ИА_ФП_НачалоПланирования.Получить();
	ИспДоходыПоПодразделениям = Константы.КСУ_ДоходыПоПодразделениям.Получить();
	ФондДБП = Константы.ИА_ФП_ФондДоходовБП.Получить();
	ДоступенЗаймИзОтлДохода = Константы.КСУ_РазрешитьЗаймыИзОтложенногоДохода.Получить();
	
	Если ФП_по_ТБ Тогда
		Элементы.ГруппаЗаголовокПол2.Видимость = ложь;
		Элементы.ДеревоПолитика2.Видимость = ложь;
		//Элементы.ГруппаПолитики.ШиринаПодчиненныхЭлементов=ШиринаПодчиненныхЭлементовФормы.ЛевыйОченьУзкий;
	КонецЕсли;
	
	
	Элементы.ДоходыДерево.Отображение= ?(ИспДоходыПоПодразделениям, ОтображениеТаблицы.Дерево, ОтображениеТаблицы.Список);
	Элементы.ДоходыЧистые.Отображение= ?(ИспДоходыПоПодразделениям, ОтображениеТаблицы.Дерево, ОтображениеТаблицы.Список);
	
	Если ИспДоходыПоПодразделениям тогда
		Элементы.ДоходыДеревоВидДохода.Заголовок = "Подразделение / вид дохода";
		Элементы.ДоходыИтогоВидДохода.Заголовок =  "Подразделение / вид дохода";
	КонецЕсли;
	
	Элементы.ДоходыБППодразделение.Видимость = ИспДоходыПоПодразделениям;
	Элементы.ОтложенныйДоходПодразделение.Видимость = ИспДоходыПоПодразделениям;
	Элементы.ДоходыИтогоПодразделение.Видимость = ИспДоходыПоПодразделениям;
	Элементы.ДоходыБП_РаспределениеПодразделение.Видимость = ИспДоходыПоПодразделениям;
	Элементы.РаспределениеСредствСФондовПодразделение1.Видимость = ИспПодразделения;
	Элементы.ДеревоПолитикаПервичная1Подразделение.Видимость = ИспПодразделения;
	Элементы.ДеревоПолитикаПодразделение.Видимость = ИспПодразделения;
	Элементы.ЗаливкаФондов_ИтогоПодразделение.Видимость = ИспПодразделения;
	Элементы.ТаблицаЗНОПодразделение.Видимость = ИспПодразделения;
	Элементы.ВозвратыЗаймовСПодразделения.Видимость = ИспПодразделения;
	Элементы.ВозвратыЗаймовНаПодразделение.Видимость = ИспПодразделения;
	Элементы.ЗаймыНаПодразделение.Видимость = ИспПодразделения;
	Элементы.ЗаймыСПодразделения.Видимость = ИспПодразделения;	
	Элементы.ФП1Подразделение.Видимость = ИспПодразделения;
	Элементы.ГруппаОпПодр.Видимость = ИспПодразделения;
	
	
	Элементы.ПоказатьСкрытьСтатью.Видимость = ФП_по_ТБ;
	Элементы.ГруппаЗаголовокРасходы.Видимость = ФП_по_ТБ;
	Элементы.ЗаливкаФондов_Итого.Видимость = ФП_по_ТБ;	
	
	Элементы.ГруппаСуммаКРаспределению.Видимость = не ФП_по_ТБ;
	Элементы.ГруппаШапкаРаспр.Видимость = не ФП_по_ТБ;
	Элементы.ДеревоЗПАвтоначисление.Видимость = не ФП_по_ТБ;
	Элементы.ДеревоЗПНачислениеВФонд.Видимость = не ФП_по_ТБ;
	Элементы.ГруппаЗагП1.Видимость = не ФП_по_ТБ;
	Элементы.ДеревоПолитика1.Видимость = не ФП_по_ТБ;
	Элементы.ГруппаВалПрибыль.Видимость = не ФП_по_ТБ;	
	Элементы.ГруппаЗНО.Видимость = не ФП_по_ТБ;
	Элементы.ГруппаПланирование.Видимость = не ФП_по_ТБ;
		
	ИспользоватьРаспределениеСФондов = Константы.ИА_ИспользоватьРаспределениеСФондов.Получить();
	//ИспользоватьСпецдоход            = Константы.ИА_ИспользоватьСпецдоход.Получить();
	ИспользоватьСпецдоход = истина;
	ФППоОрганизациям              = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	РазделятьНалБезнал            = ложь;
	
	//ВыводитьГруппировкуПоСчетам =  Константы.ИА_ФП_ВыводитьГруппировкуПоСчетам.Получить();
	
	//Элементы.ОписаниеЗРС.Видимость = Константы.ИА_ФП_ОтображатьРасшифровкуЗВСВФП.Получить();
	//Элементы.ОписаниеЗНО.Видимость = Элементы.ОписаниеЗРС.Видимость;
	
	ИспользоватьРазделы = Константы.ИА_ФП_ИспользоватьРазделыПолитики.Получить();
	Элементы.ДеревоПолитикаПервичная1Раздел.Видимость = ИспользоватьРазделы;
	Элементы.ДеревоПолитикаРаздел.Видимость = ИспользоватьРазделы;
	
	СостояниеЗаказаОтклонен    = Перечисления.ИА_СостояниеЗаказа.Отклонен;
	ВидДенежныхСредствНаличные = Перечисления.ИА_ВидДенежныхСредств.Наличные;
	
	ЭтоРСФ = ИА_ПраваС.ЗначениеПраваТекПользователя(ПланыВидовХарактеристик.ИА_ПраваПользователей.РСФ)
				или ИА_ПраваС.ЗначениеПраваТекПользователя(ПланыВидовХарактеристик.ИА_ПраваПользователей.ФП_ПолныеПрава);
	ПравоУтверждения = ИА_ПраваС.ЗначениеПраваТекПользователя(ПланыВидовХарактеристик.ИА_ПраваПользователей.УтверждениеФП)
				или ИА_ПраваС.ЗначениеПраваТекПользователя(ПланыВидовХарактеристик.ИА_ПраваПользователей.ФП_ПолныеПрава);
	ТолькоПросмотрФП = ТолькоПросмотрФП();
	
	Элементы.РаспределениеПоФондамПогаситьЗайм.Доступность	= НЕ ТолькоПросмотрФП;
	Элементы.Группа6.Видимость = ИспользоватьРаспределениеСФондов;
	Элементы.РаспределениеСредствСФондов.Видимость = ИспользоватьРаспределениеСФондов;
	
	Элементы.ГруппаАвтосборДоходов.Видимость = объект.ЕстьАвтодоходы;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ФППоОрганизациям Тогда
			Объект.Организация = ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.ОсновнаяОрганизация);
		КонецЕсли;
		Объект.НачалоПланирования   = не Константы.ИА_ФП_НачалоПланирования.Получить();
	КонецЕсли;
	
	ПредФпСтрукт = ПолучитьПоследнееФП();
	
	//
	ИА_ФПСервер.Форма_УстановитьОграничениеТипаИсточникСпецДохода(ЭтаФорма, Элементы.ДоходыБП1Источник);
	ИА_ФПСервер.Форма_УстановитьОграничениеТипаИсточникСпецДохода(ЭтаФорма, Элементы.ДоходыБП_РаспределениеИсточник1);
	
	//Элементы.Утверждено.ТолькоПросмотр = НЕ ИА_ПраваС.ЗначениеПраваТекПользователя("УтверждениеФП");
	//Элементы.УтвердитьВаловуюПрибыль.ТолькоПросмотр = НЕ ИА_ПраваС.ЗначениеПраваТекПользователя("УтверждениеВаловойПрибыли");
	
	
	КэшПроверкаИзменений = Новый Структура("ДоходыБП1, РаспределениеСредствСФондов1, ДоходыБП_Распределение1"
	, Новый Структура("ВидДохода, СуммаБезнал, СуммаНал") 
	, Новый Структура("ВидДохода, СуммаБезнал, СуммаНал") 
	, Новый Структура("ВидДохода, СуммаБезнал, СуммаНал") 
	);

	ОбновитьНадписьТБ();
	
	//ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
	
	Запрос= новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_СостояниеЗаказа.Ссылка КАК Статус,
	               |	ИА_СостояниеЗаказа.Порядок КАК Номер
	               |ИЗ
	               |	Перечисление.ИА_СостояниеЗаказа КАК ИА_СостояниеЗаказа";
	тз = запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(тз, "НомераСтатусовЗП");
	
	РаспределитьЗаймыВозвратыПоТЧ();
	ОбновитьНадписьКнопкиОтДохода();
	
	ЕстьОшибкаВерсииТБ = ПолучитьЕстьОшибкаВерсииТБ();
	
	ВнедоходныеПоступления.Параметры.УстановитьЗначениеПараметра("Организация", объект.Организация);
	ВнедоходныеПоступления.Параметры.УстановитьЗначениеПараметра("НеПоОрг", не ФППоОрганизациям);
	ВнедоходныеПоступления.Параметры.УстановитьЗначениеПараметра("ДатаНачалаТБ", Дата(1,1,1));
	ВнедоходныеПоступления.Параметры.УстановитьЗначениеПараметра("ДатаКонцаТБ", Дата(1,1,1));

	м = ИА_ФПСервер.ПолучитьОрганизацииДляОтчетов();
	Если (не объект.Организация.Пустая()) и м.найти(объект.Организация) = Неопределено тогда
		м.добавить(объект.Организация);
	КонецЕсли;
	Элементы.Организация.СписокВыбора.ЗагрузитьЗначения(м);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЕстьОшибкаВерсииТБ()
	возврат ЗначениеЗаполнено(Объект.ДатаПроведенияТБ) и ЗначениеЗаполнено(Объект.ТБ.ДатаПроведения) и Объект.ДатаПроведенияТБ<> Объект.ТБ.ДатаПроведения;
КонецФункции
	
&НаСервере
Процедура РаспределитьЗаймыВозвратыПоТЧ()
	Для каждого стр из Объект.РаспределениеПоФондам Цикл
		Если стр.ЗаймВозврат = Перечисления.ИА_ЗаймВозврат.Возврат Тогда
			Новстр = ВозвратыЗаймов.Добавить();
		Иначе
			Новстр = Займы.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(новстр, стр);
		новстр.сумма = стр.СуммаБезнал;
		новстр.НаФонд = стр.Фонд;
		новстр.НаПодразделение = стр.Подразделение;
	КонецЦикла;
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьНадписьТБ()
	Если Объект.тб.Пустая() ТОгда
		Элементы.ОткрытьТБ.Видимость = ложь;
	Иначе
		Элементы.ОткрытьТБ.Видимость = истина;
		Элементы.ОткрытьТБ.Заголовок = "ТБ №"+Объект.тб.Номер+" от "+ФОРМАТ(Объект.тб.Дата, "ДФ=dd.MM.yyyy") +" ("+ Врег(формат(Объект.тб.Месяц,"ДФ=ММММ")) +")";
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Функция ТолькоПросмотрФП()
	
	РолиПользователя          = ПользователиИнформационнойБазы.ТекущийПользователь().Роли; 
	ЕстьПолныеПрава           = РолиПользователя.Содержит(Метаданные.Роли.ПолныеПрава); 
	
	Результат = НЕ ПравоДоступа("Редактирование", Метаданные.Документы.ИА_ФинансовоеПланирование);
	
	Если ЕстьПолныеПрава Тогда
		
		Результат = Ложь;
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуЗП(поТекДокументу = Ложь)
	
	ГруппЗП_Заг = "Фонд / Предмет заказа";
	Если ИспПодразделения Тогда
		ГруппЗП_Заг = "Подразделение / " + ГруппЗП_Заг;
	КонецЕсли;
	Если ВыводитьГруппировкуПоСчетам Тогда
		ГруппЗП_Заг = "Счет / " + ГруппЗП_Заг;	
	КонецЕсли;
	Элементы.ДеревоЗППодразделениеФонд.Заголовок = ГруппЗП_Заг;
	
	//
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПодЗапрос.Заказ КАК Заказ,
	               |	ПодЗапрос.Счет КАК Счет,
	               |	ВЫБОР
	               |		КОГДА ПодЗапрос.Счет = ЗНАЧЕНИЕ(Справочник.ИА_Счета.ГлавныйСчет)
	               |			ТОГДА 0
	               |		ИНАЧЕ 200
	               |	КОНЕЦ КАК СчетПорядок,
	               |	ПодЗапрос.Фонд КАК Фонд,
	               |	ПодЗапрос.ПредметЗаказа КАК ПредметЗаказа,
	               |	ПодЗапрос.Сумма - ЕСТЬNULL(ПодЗапросРезервы.Сумма, 0) - ЕСТЬNULL(ПодЗапросЗакрытия.Сумма, 0) КАК Сумма,
	               |	ЕСТЬNULL(ПодЗапросРезервы.Сумма, 0) + ЕСТЬNULL(ПодЗапросЗакрытия.Сумма, 0) КАК РанееВыделено,
				   |	ВЫБОР КОГДА ЕСТЬNULL(ПодЗапросРезервы.Сумма, 0) + ЕСТЬNULL(ПодЗапросЗакрытия.Сумма, 0) >0 И ЕСТЬNULL(ПодЗапросРезервы.СуммаРасход, 0) = 0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК МожноАннулировать,
	               |	ПодЗапрос.Статус КАК Статус,
	               |	ПодЗапрос.УтвержденнаяСумма КАК УтвержденнаяСумма,
	               |	ПодЗапрос.Сумма КАК ИсходнаяСумма,
	               |	ПодЗапрос.ПричинаОтказа КАК ПричинаОтказа,
	               |	ПодЗапрос.НачислениеВФондБезнал КАК НачислениеВФонд,
	               |	ПодЗапрос.Подразделение КАК Подразделение,
	               |	ПодЗапрос.Подразделение.Наименование КАК ПодразделениеФонд,
	               |	ПодЗапрос.Заказ.Ситуация КАК Ситуация,
	               |	ПодЗапрос.Заказ.Данные КАК Данные,
	               |	ПодЗапрос.Заказ.Решение КАК Решение,
	               |	ПодЗапрос.Фонд.Код КАК ФондКод,
	               |	ПодЗапрос.Заказ.Дата КАК Дата,
	               |	ПодЗапрос.Заказ.Номер КАК Номер,
	               |	ПодЗапрос.Заказ.ДатаОплаты КАК СрокОплаты
	               |ПОМЕСТИТЬ ВТСводнаяТаблица
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗаказыНаПриобретение.Заказ КАК Заказ,
	               |		ЗаказыНаПриобретение.Заказ.Фонд.Счет КАК Счет,
	               |		ЗаказыНаПриобретение.Заказ.Фонд КАК Фонд,
	               |		ЗаказыНаПриобретение.Заказ.Подразделение КАК Подразделение,
	               |		ЗаказыНаПриобретение.Заказ.ПредметЗаказа КАК ПредметЗаказа,
	               |		ЗаказыНаПриобретение.Заказ.Сумма КАК Сумма,
	               |		ЗаказыНаПриобретение.УтвержденнаяСумма КАК УтвержденнаяСумма,
	               |		0 КАК НачислениеВФондБезнал,
	               |		ЗаказыНаПриобретение.Статус КАК Статус,
	               |		ЗаказыНаПриобретение.ПричинаОтказа КАК ПричинаОтказа
	               |	ИЗ
	               |		Документ.ИА_ФинансовоеПланирование.ЗаказыНаПриобретение КАК ЗаказыНаПриобретение
	               |	ГДЕ
	               |		ЗаказыНаПриобретение.Ссылка = &ТекДок
	               |		И &ПоТекДоку = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Документ.ИА_ЗаказНаПриобретение.ПустаяСсылка),
	               |		НачисленияВФонды.Фонд.Счет,
	               |		НачисленияВФонды.Фонд,
	               |		НачисленияВФонды.Подразделение,
	               |		"""",
	               |		0,
	               |		0,
	               |		СУММА(НачисленияВФонды.СуммаБезнал),
	               |		NULL,
	               |		NULL
	               |	ИЗ
	               |		Документ.ИА_ФинансовоеПланирование.НачисленияВФонды КАК НачисленияВФонды
	               |	ГДЕ
	               |		НачисленияВФонды.Ссылка = &ТекДок
	               |		И &ПоТекДоку = ИСТИНА И &ФП_ТБ = ложь
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		НачисленияВФонды.Фонд,
	               |		НачисленияВФонды.Подразделение,
	               |		НачисленияВФонды.Фонд.Счет
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Фонд.Счет,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Фонд,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Подразделение,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.ПредметЗаказа,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Сумма,
	               |		0,
	               |		0,
	               |		ИА_ИсторияСтатусовЗВССрезПоследних.Статус,
	               |		ВЫРАЗИТЬ("""" КАК СТРОКА(100))
	               |	ИЗ
	               |		РегистрНакопления.ИА_ЗаказыНаПриобретение.Остатки(
	               |				&ДатаДок,
	               |				Организация = &Организация
	               |					ИЛИ &НеРазделять) КАК ЗаявкиНаРасходованиеСредствОстатки
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних(&ДатаДок) КАК ИА_ИсторияСтатусовЗВССрезПоследних
	               |			ПО ЗаявкиНаРасходованиеСредствОстатки.ЗП = ИА_ИсторияСтатусовЗВССрезПоследних.ЗВС
	               |	ГДЕ
	               |		&ПоТекДоку = ЛОЖЬ
	               |		И ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток > 0
	               |		И (ИА_ИсторияСтатусовЗВССрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП) ИЛИ ИА_ИсторияСтатусовЗВССрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ИА_СостояниеЗаказа.ПереносНаСледующееФП)
	               |				ИЛИ ИА_ИсторияСтатусовЗВССрезПоследних.Статус В (&ОдобрСтатусы) )          ) КАК ПодЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИА_СредстваВРезервеНаФондахОбороты.ЗП КАК Ссылка,
	               |			СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход) КАК Сумма,
				   |			СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналРасход) КАК СуммаРасход
	               |		ИЗ
	               |			РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, &ДатаДок, Регистратор, ) КАК ИА_СредстваВРезервеНаФондахОбороты
	               |		ГДЕ
	               |			ИА_СредстваВРезервеНаФондахОбороты.Регистратор <> &ТекДок
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ИА_СредстваВРезервеНаФондахОбороты.ЗП) КАК ПодЗапросРезервы
	               |		ПО ПодЗапрос.Заказ = ПодЗапросРезервы.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИА_ЗаказыНаПриобретение.ЗП КАК Ссылка,
	               |			СУММА(ИА_ЗаказыНаПриобретение.СуммаРасход) КАК Сумма
	               |		ИЗ
	               |			РегистрНакопления.ИА_ЗаказыНаПриобретение.Обороты(, &ДатаДок, Регистратор, ) КАК ИА_ЗаказыНаПриобретение
	               |		ГДЕ
	               |			ИА_ЗаказыНаПриобретение.Регистратор <> &ТекДок
	               |			И ИА_ЗаказыНаПриобретение.Регистратор ССЫЛКА Документ.ИА_ЗакрытиеЗаказаНаПриобретение
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ИА_ЗаказыНаПриобретение.ЗП) КАК ПодЗапросЗакрытия
	               |		ПО ПодЗапрос.Заказ = ПодЗапросЗакрытия.Ссылка
	               |ГДЕ
	               |	(ПодЗапрос.Сумма - ЕСТЬNULL(ПодЗапросРезервы.Сумма, 0) - ЕСТЬNULL(ПодЗапросЗакрытия.Сумма, 0) > 0
	               |			ИЛИ ПодЗапрос.НачислениеВФондБезнал > 0
	               |			ИЛИ &ПоТекДоку = ИСТИНА)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСводнаяТаблица.Заказ КАК Заказ,
				   |	ВТСводнаяТаблица.МожноАннулировать КАК МожноАннулировать,
	               |	ВТСводнаяТаблица.Заказ.Статья КАК Статья,
				   |	ВТСводнаяТаблица.Заказ.ОрганизацияДочерняя КАК ОрганизацияДочерняя,
				   |	ВТСводнаяТаблица.Заказ.Сотрудник КАК Сотрудник,
				   |	""                                                                                                  "" КАК Вложения,
	               |	ВТСводнаяТаблица.Счет КАК Счет,
	               |	ВТСводнаяТаблица.СчетПорядок КАК СчетПорядок,
	               |	ВТСводнаяТаблица.Фонд КАК Фонд,
	               |	ВТСводнаяТаблица.ПредметЗаказа КАК ПредметЗаказа,
	               |	ВТСводнаяТаблица.Сумма КАК Сумма,
	               |	ВТСводнаяТаблица.РанееВыделено КАК РанееВыделено,
	               |	ВТСводнаяТаблица.Сумма - ВТСводнаяТаблица.УтвержденнаяСумма КАК ОстатокПоЗаказу,
	               |	ВТСводнаяТаблица.Статус КАК Статус,
				   |	Статусы.Статус КАК СтатусИсходный,
	               |	ВТСводнаяТаблица.УтвержденнаяСумма КАК УтвержденнаяСумма,
	               |	ВТСводнаяТаблица.ИсходнаяСумма КАК ИсходнаяСумма,
	               |	ВТСводнаяТаблица.ПричинаОтказа КАК ПричинаОтказа,
	               |	ВТСводнаяТаблица.НачислениеВФонд КАК НачислениеВФонд,
	               |	ВТСводнаяТаблица.Подразделение КАК Подразделение,
	               |	ВТСводнаяТаблица.Подразделение.Наименование КАК ПодразделениеНаименование,
	               |	ВТСводнаяТаблица.ПодразделениеФонд КАК ПодразделениеФонд,
	               |	ВТСводнаяТаблица.Ситуация КАК Ситуация,
	               |	ВТСводнаяТаблица.Данные КАК Данные,
	               |	ВТСводнаяТаблица.Решение КАК Решение,
	               |	ЕСТЬNULL(КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Порядок, ВТСводнаяТаблица.ФондКод) КАК ФондКод,
	               |	ВТСводнаяТаблица.Дата КАК Дата,
	               |	ВТСводнаяТаблица.Номер КАК Номер,
	               |	ВТСводнаяТаблица.СрокОплаты КАК СрокОплаты,
	               |	ЛОЖЬ КАК ВыбратьСтр,
	               |	ВТСводнаяТаблица.Статус.Порядок КАК СтатусНомер,
				   |	Комменты.Комментарий КАК КомментарийСФП
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТСводнаяТаблица.Заказ КАК Заказ,
				   |		ВТСводнаяТаблица.МожноАннулировать КАК МожноАннулировать,
	               |		ВТСводнаяТаблица.Счет КАК Счет,
	               |		ВТСводнаяТаблица.СчетПорядок КАК СчетПорядок,
	               |		ВТСводнаяТаблица.Фонд КАК Фонд,
	               |		ВТСводнаяТаблица.ПредметЗаказа КАК ПредметЗаказа,
	               |		ВТСводнаяТаблица.Сумма КАК Сумма,
	               |		ВТСводнаяТаблица.РанееВыделено КАК РанееВыделено,
	               |		ВТСводнаяТаблица.Статус КАК Статус,
	               |		ВТСводнаяТаблица.УтвержденнаяСумма КАК УтвержденнаяСумма,
	               |		ВТСводнаяТаблица.ИсходнаяСумма КАК ИсходнаяСумма,
	               |		ВТСводнаяТаблица.ПричинаОтказа КАК ПричинаОтказа,
	               |		ВТСводнаяТаблица.НачислениеВФонд КАК НачислениеВФонд,
	               |		ВТСводнаяТаблица.Подразделение КАК Подразделение,
	               |		ВТСводнаяТаблица.ПодразделениеФонд КАК ПодразделениеФонд,
	               |		ВТСводнаяТаблица.Ситуация КАК Ситуация,
	               |		ВТСводнаяТаблица.Данные КАК Данные,
	               |		ВТСводнаяТаблица.Решение КАК Решение,
	               |		ВТСводнаяТаблица.ФондКод КАК ФондКод,
	               |		ВТСводнаяТаблица.Дата КАК Дата,
	               |		ВТСводнаяТаблица.Номер КАК Номер,
	               |		ВТСводнаяТаблица.СрокОплаты КАК СрокОплаты
	               |	ИЗ
	               |		ВТСводнаяТаблица КАК ВТСводнаяТаблица
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		NULL,
				   |		NULL,
	               |		ИА_ФондыПодразделения.Ссылка.Счет,
	               |		ВЫБОР
	               |			КОГДА ИА_ФондыПодразделения.Ссылка.Счет = ЗНАЧЕНИЕ(Справочник.ИА_Счета.ГлавныйСчет)
	               |				ТОГДА 0
	               |			ИНАЧЕ 200
	               |		КОНЕЦ,
	               |		ИА_ФондыПодразделения.Ссылка,
	               |		NULL,
	               |		0,
	               |		0,
	               |		NULL,
	               |		0,
	               |		0,
	               |		NULL,
	               |		0,
	               |		ИА_ФондыПодразделения.Подразделение,
	               |		NULL,
	               |		NULL,
	               |		NULL,
	               |		NULL,
	               |		ИА_ФондыПодразделения.Ссылка.Код,
	               |		NULL,
	               |		NULL,
	               |		NULL
	               |	ИЗ
	               |		Справочник.ИА_Фонды.Подразделения КАК ИА_ФондыПодразделения
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТСводнаяТаблица КАК ВТСводнаяТаблица
	               |			ПО ИА_ФондыПодразделения.Ссылка = ВТСводнаяТаблица.Фонд
	               |				И (ИА_ФондыПодразделения.Подразделение = ВТСводнаяТаблица.Подразделение
	               |					ИЛИ НЕ &ИспПодр)
	               |	ГДЕ
	               |		ВТСводнаяТаблица.Фонд ЕСТЬ NULL
	               |		И ИА_ФондыПодразделения.Ссылка.ОтображатьВСписке
	               |		И (ИА_ФондыПодразделения.Ссылка.Защищенный = ложь
	               |				ИЛИ &ЭтоРСФ)
	               |		И ИА_ФондыПодразделения.Ссылка.ЭтоГруппа = ЛОЖЬ И &ФП_ТБ = ложь) КАК ВТСводнаяТаблица				   
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних(&ДатаДок) КАК Статусы
	               |			ПО ВТСводнаяТаблица.Заказ = Статусы.ЗВС
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КСУ_КомментарииФП.СрезПоследних(&ДатаДок) КАК Комменты
	               |			ПО ВТСводнаяТаблица.Заказ = Комменты.Заказ				   
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВЫБОР КОГДА &ИспПодр ТОГДА КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Подразделение ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК Подразделение,
	               |			КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Фонд КАК Фонд,
	               |			МИНИМУМ(КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Порядок) КАК Порядок
	               |		ИЗ
	               |			РегистрСведений.КСУ_ПорядокРаспределенияПоФондам.СрезПоследних(
	               |					&ДатаДок,
	               |					Организация = &Организация
	               |						ИЛИ &НеРазделять) КАК КСУ_ПорядокРаспределенияПоФондамСрезПоследних
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВЫБОР КОГДА &ИспПодр ТОГДА КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Подразделение ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ,
	               |			КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Фонд) КАК КСУ_ПорядокРаспределенияПоФондамСрезПоследних
	               |		ПО (ВТСводнаяТаблица.Подразделение = КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Подразделение
	               |				ИЛИ НЕ &ИспПодр)
	               |			И ВТСводнаяТаблица.Фонд = КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Фонд
	               |ГДЕ
	               |	(ВТСводнаяТаблица.Фонд.Защищенный = ложь
	               |			ИЛИ &ЭтоРСФ)       
	               |УПОРЯДОЧИТЬ ПО
	               |	*ПОРЯДОК*
	               |ИТОГИ
	               |	СУММА(Сумма),
				   |	СУММА(РанееВыделено),
				   |	СУММА(ОстатокПоЗаказу),
	               |	СУММА(УтвержденнаяСумма),
	               |	СУММА(ИсходнаяСумма),
	               |	СУММА(НачислениеВФонд),
	               |	МИНИМУМ(ФондКод),
				   |	МИНИМУМ(ВыбратьСтр)
	               |ПО
	               |	*ИТОГИ*";
	
	
	ТестПорядка = "ФондКод";
	ТекстИтогов = "Фонд";
	Если ИспПодразделения Тогда
		ТекстИтогов = "Подразделение, " + ТекстИтогов;
		ТестПорядка = "ПодразделениеНаименование, " + ТестПорядка;
	КонецЕсли;
	Если ВыводитьГруппировкуПоСчетам Тогда				
		ТекстИтогов = "Счет, " + ТекстИтогов;		
		ТестПорядка = "СчетПорядок, " + ТестПорядка;
	КонецЕсли;		
	ТестПорядка = ТестПорядка + ", СрокОплаты";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"*ИТОГИ*", ТекстИтогов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"*ПОРЯДОК*", ТестПорядка);
		
	Запрос.Текст = ТекстЗапроса;
	СостояниеЗаказаОдобрен     = ИА_ФП.СтатусыОдобрено();
	
	Запрос.УстановитьПараметр("Дата",            ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), КонецДня(Объект.Дата)));
	Запрос.УстановитьПараметр("ТекДок",          Объект.Ссылка);
	Запрос.УстановитьПараметр("ПоТекДоку",       поТекДокументу);
	Запрос.УстановитьПараметр("Организация",     Объект.Организация);
	Запрос.УстановитьПараметр("НеРазделять",     Не ФППоОрганизациям);
	Запрос.УстановитьПараметр("ЭтоРСФ",          ЭтоРСФ);
	Запрос.УстановитьПараметр("ФП_ТБ",           ФП_по_ТБ);
	Запрос.УстановитьПараметр("ИспПодр",          ИспПодразделения);
	Запрос.УстановитьПараметр("ОдобрСтатусы",    СостояниеЗаказаОдобрен);
	Запрос.УстановитьПараметр("ДатаДок",            ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата - 1));
	
	
	ДеревоЗПЗнач = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ЗаполнитьСтрокуТабЗП(ДеревоЗПЗнач);	
	
	ДеревоЗПЗнач.Колонки.Удалить("ФондКод");
	ДеревоЗПЗнач.Колонки.Удалить("ПодразделениеНаименование");
	
	ИА_ТабДеревоСтарое = ИА_БФС.ДЗ2ТЗ(РеквизитФормыВЗначение("ДеревоЗП"));
	ПеренестиИзСтарогоДерВНовое(ИА_ТабДеревоСтарое, ДеревоЗПЗнач);
		
	ДеревоЗПИсходнаяСумма = ДеревоЗПЗнач.Строки.Итог("ИсходнаяСумма",ложь);
	ДеревоЗПНачислениеВФонд = ДеревоЗПЗнач.Строки.Итог("НачислениеВФонд",ложь);
	ДеревоЗПСумма = ДеревоЗПЗнач.Строки.Итог("Сумма",ложь);
	ДеревоЗПУтвержденнаяСумма = ДеревоЗПЗнач.Строки.Итог("УтвержденнаяСумма",ложь);
	ДеревоЗПРанееВыделено = ДеревоЗПЗнач.Строки.Итог("РанееВыделено",ложь);
	ДеревоЗПОстатокПоЗаказу = ДеревоЗПЗнач.Строки.Итог("ОстатокПоЗаказу",ложь);
	
	ДеревоЗПЗнач.Колонки.Добавить("СерыйВыбор", новый ОписаниеТипов("Булево"));

	ЗначениеВРеквизитФормы(ДеревоЗПЗнач, "ДеревоЗП");
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиИзСтарогоДерВНовое(СтароеДерево, НовоеДерево)
	
	Для каждого Стр Из НовоеДерево.Строки Цикл
		Если стр.Заказ <> NULL Тогда // строка с заказом	
			//Если ИспПодразделения ТОгда
			//	Отбор = Новый Структура("Подразделение,Фонд,Заказ");
			//Иначе
			//	Отбор = Новый Структура("Фонд,Заказ");
			//КонецЕсли;
			Отбор = Новый Структура("Заказ");
			ЗаполнитьЗначенияСвойств(Отбор, стр);
			Вложения = "";
			Для каждого стрВлож из стр.Заказ.Файлы Цикл
				Если Вложения <> "" Тогда
					Вложения = Вложения+ ", ";
				КонецЕсли;
				Вложения = Вложения+ стрВлож.Имя;
			КонецЦикла;
			стр.Вложения = ?(Вложения = "", "нет", Вложения);
			
			Если СтароеДерево.Количество() = 0 Тогда // при открытии документа 
				Таб = ИА_БФС.ТЗ_ФильтрПоОтбору(объект.ЗаказыНаПриобретение, Отбор);
			Иначе
				Таб = ИА_БФС.ТЗ_ФильтрПоОтбору(СтароеДерево, Отбор);
			КонецЕсли;
	        Если Таб.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(стр, Таб[0], "Статус,УтвержденнаяСумма,ПричинаОтказа,КомментарийСФП");
				
				стр.ОстатокПоЗаказу = стр.Сумма - стр.УтвержденнаяСумма;
				//
				Если стр.УтвержденнаяСумма > 0 Тогда
					Если стр.СтатусИсходный = Перечисления.ИА_СостояниеЗаказа.РассмотретьНаФП ИЛИ стр.СтатусИсходный = Перечисления.ИА_СостояниеЗаказа.ПереносНаСледующееФП
							ИЛИ стр.СтатусИсходный = Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_НетВыплат Тогда
						Если стр.УтвержденнаяСумма >= стр.Сумма Тогда
							стр.Статус = Перечисления.ИА_СостояниеЗаказа.ОдобренПолностью_НетВыплат;
						Иначе
							стр.Статус = Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_НетВыплат;
						КонецЕсли;
					ИначеЕсли стр.СтатусИсходный = Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_ЧастичныеВыплаты
							ИЛИ стр.СтатусИсходный = Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_ВсёВыплачено Тогда
						Если стр.УтвержденнаяСумма >= стр.Сумма Тогда
							стр.Статус = Перечисления.ИА_СостояниеЗаказа.ОдобренПолностью_ЧастичныеВыплаты;
						Иначе
							стр.Статус = Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_ЧастичныеВыплаты;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				//
				стр.СтатусНомер = НомерСтатусаСервер(стр.Статус);
	        КонецЕсли;
		ИначеЕсли стр.фонд <> NULL Тогда  // строка с фондом
			Если ИспПодразделения Тогда
				Отбор = Новый Структура("Подразделение,Фонд");
			Иначе
				Отбор = Новый Структура("Фонд");
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Отбор, стр);
			Таб = ИА_БФС.ТЗ_ФильтрПоОтбору(СтароеДерево, Отбор);
	        Если Таб.Количество() > 0 Тогда
				стр.НачислениеВФонд = Таб[0].НачислениеВФонд
	        КонецЕсли; 
		КонецЕсли;
		
		ПеренестиИзСтарогоДерВНовое(СтароеДерево, стр);
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСтрокуТабЗП(СтрокаДер)
	
	Для каждого стр из СтрокаДер.Строки Цикл
		Если стр.Заказ <> NULL Тогда			
			стр.ПодразделениеФонд = "№" + строка(число(стр.Номер)) + " " +ВРЕГ(стр.ПредметЗаказа);									
		ИначеЕсли стр.фонд <> NULL Тогда
			стр.ПодразделениеФонд = "фонд: " + строка(стр.Фонд);
			Если стр.Строки.Количество()>0 Тогда
				//Если не ЗначениеЗаполнено(стр.Строки[0].Заказ) Тогда // это строка с доп фондом без заказов
				//	стр.Строки.Очистить();
				//КонецЕсли;
				
				сч = стр.Строки.Количество() -1;
				Пока сч>= 0 Цикл
					Если не ЗначениеЗаполнено(стр.Строки[сч].Заказ) Тогда // это строка с доп фондом без заказов
						стр.Строки.Удалить(сч);
					КонецЕсли;
					сч = сч - 1;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли стр.Подразделение <> NULL Тогда
			стр.ПодразделениеФонд = Строка(стр.Подразделение);
		ИначеЕсли стр.Счет <> NULL Тогда
			стр.ПодразделениеФонд = Строка(стр.Счет);
		КонецЕсли;
		
		ЗаполнитьСтрокуТабЗП(стр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСальдоСредствКРаспределению()
	
	Объект.ВаловаяПрибыльСуммаБезнал = Объект.ДоходыИтого.Итог("СуммаБезнал") - Объект.Политика1.Итог("Сумма");
	
	Если ФП_по_ТБ ТОгда
		Объект.СуммаКРаспределениюБезнал = 0;
	Иначе
		Объект.СуммаКРаспределениюБезнал = Объект.ВаловаяПрибыльСуммаБезнал - Объект.Политика2.Итог("Сумма") - Объект.ЗаливкаФондов.Итог("Сумма");
	КонецЕсли;
	
	Объект.СуммаКРаспределениюСОстаткомБезнал = Объект.СуммаКРаспределениюБезнал;
		
	ИтогоНачисление = 0;
	Для каждого стр из ДеревоЗП.ПолучитьЭлементы() цикл		
		ИтогоНачисление = ИтогоНачисление + стр.НачислениеВФонд;	
	КонецЦикла;
	
	СальдоСредствКРаспределениюБезналВрем = Объект.СуммаКРаспределениюСОстаткомБезнал - ИтогоНачисление;
		
	Если Объект.СальдоСредствКРаспределениюБезнал <> СальдоСредствКРаспределениюБезналВрем Тогда
		Объект.СальдоСредствКРаспределениюБезнал = СальдоСредствКРаспределениюБезналВрем;
	КонецЕсли;
	
	Если Объект.СальдоСредствКРаспределениюБезнал < 0 Тогда
		Элементы.СальдоСредствКРаспределениюИтого.ЦветФона = Новый Цвет(255,140,140);
	Иначе
		Элементы.СальдоСредствКРаспределениюИтого.ЦветФона = Новый Цвет(255,255,255);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьВДПСилиФормВыплаты(орг, ДоДаты)
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_ВнедоходноеПоступлениеСредств.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.КСУ_ВнедоходноеПоступлениеСредств КАК КСУ_ВнедоходноеПоступлениеСредств
	               |ГДЕ
	               |	КСУ_ВнедоходноеПоступлениеСредств.Проведен
	               |	И КСУ_ВнедоходноеПоступлениеСредств.Дата < &ДоДаты
	               |	И КСУ_ВнедоходноеПоступлениеСредств.Организация = &Организация
	               |	И КСУ_ВнедоходноеПоступлениеСредств.Основание = НЕОПРЕДЕЛЕНО
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КСУ_ФормальнаяВыплата.Ссылка
	               |ИЗ
	               |	Документ.КСУ_ФормальнаяВыплата КАК КСУ_ФормальнаяВыплата
	               |ГДЕ
	               |	КСУ_ФормальнаяВыплата.Проведен
	               |	И КСУ_ФормальнаяВыплата.Дата < &ДоДаты
	               |	И КСУ_ФормальнаяВыплата.Организация = &Организация";
	Запрос.УстановитьПараметр("ДоДаты", ДоДаты);
	Запрос.УстановитьПараметр("Организация", орг);
	
	выборка = запрос.Выполнить().Выбрать();
	
	Возврат выборка.Следующий();
КонецФункции
	
&НаСервере
Процедура ОбновитьОтчетПоСотояниюФондов(ВывестиВТабДок = ложь, табД = Неопределено, ЭтоСостояние = ложь) Экспорт
	
	ДеревоЗПЗнач = РеквизитФормыВЗначение("ДеревоЗП");
	ДеревоПолитика2Знач = РеквизитФормыВЗначение("ДеревоПолитика2");
	ДеревоПолитика1Знач = РеквизитФормыВЗначение("ДеревоПолитика1");
	
	РезЗапроса = ИА_Защита_ФП.ПолучитьРезультатЗапроса(Объект, ФППоОрганизациям, ДеревоЗПЗнач, ДеревоПолитика2Знач, ДеревоПолитика1Знач, ВывестиВТабДок, ВыводитьГруппировкуПоСчетам);
	
	Если ВывестиВТабДок Тогда       
		
		ГС_Оборот = 0;
		Макет = ПолучитьОбщийМакет("СостояниеФондовСвернуто");	
		ТабДок = ПолеТабДок;
		ТабДок.Очистить();
		
		Если ЭтоСостояние Тогда
			ОблШапкаС = Макет.ПолучитьОбласть("ЗаголовокСостояние");
			ОблШапкаС.Параметры.Дата =  формат(объект.Дата,"ДФ=dd.MM.yyyy");
			ОблШапкаС.Параметры.Номер =  объект.Номер;
			ТабДок.Вывести(ОблШапкаС);
		КонецЕсли;		
		
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ОблШапка.Параметры.Заголовок = "Дата формирования отчета " + ТекущаяДата() +". Отчет сформирован по состоянию на " + объект.Дата +". В случае внесения в ФП любых изменений после формирования отчета необходимо обновить отчёт для получения актуальных данных.";
		
		ГруппировкаСтр = "Фонд";
		Если ИспПодразделения ТОгда
			ГруппировкаСтр = "Подразделение/" + ГруппировкаСтр;
		КонецЕсли;
		Если ВыводитьГруппировкуПоСчетам Тогда
			ГруппировкаСтр = "Счет/" + ГруппировкаСтр;
		КонецЕсли;
		ОблШапка.Параметры.СчетПодразделениеФонд =  ГруппировкаСтр;
		ТабДок.Вывести(ОблШапка);
		
		ТабДок.ФиксацияСверху = 2;		
		ТабДок.ФиксацияСлева = 2;
		
		ВыводитьИтог =Ложь;
		ОстатокПоФондамБезНал = 0;
		
		ДеревоРез = РезЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Для каждого стр из ДеревоРез.Строки Цикл
			Если ВыводитьИтог = ложь Тогда // первая запись - общий итог
				ВыводитьИтог = истина;
				ОблСтрокаИтог = Макет.ПолучитьОбласть("СтрокаИтог");
				ОблСтрокаИтог.Параметры.Заполнить(стр);
				ОблСтрокаИтог.Параметры.Фонд = "ИТОГО";
				ОстатокПоФондамБезНал = стр.ПослеФП_Остаток_Итого;
			КонецЕсли;
			
			ВывестиСтрокуОтчетаПоСоcтояниюФондов(стр, Макет, ТабДок);
			
		КонецЦикла;
		
		Если ВыводитьИтог Тогда
			ТабДок.Вывести(ОблСтрокаИтог);
		КонецЕсли;
		
		// ОСТАТКИ ДС
		ОстаткиДС = ПолучитьОстатокДС();
		ОблСтрока = Макет.ПолучитьОбласть("Сравнение");
		ОстатокДС = ОстаткиДС.СуммаНал + ОстаткиДС.СуммаБезНал;
		
		Если ОстатокДС<> ОстатокПоФондамБезНал Тогда
			если ЕстьВДПСилиФормВыплаты(объект.Организация, объект.Дата) ТОгда
				ОблСтрока = Макет.ПолучитьОбласть("СравнениеКрасноеЕстьВДПС");
			Иначе
				ОблСтрока = Макет.ПолучитьОбласть("СравнениеКрасное");
			КонецЕсли;
			ОблСтрока.Параметры.СуммаФондов = ОстатокПоФондамБезНал; 
			ОблСтрока.Параметры.СуммаДС = ОстатокДС;
			ТабДок.Вывести(ОблСтрока);
			
			
			Если ОстатокДС > ОстатокПоФондамБезНал Тогда
				ОблСтрока = Макет.ПолучитьОбласть("ПояснениеОшибкиДС1");
				ОблСтрока.Параметры.СуммаДС = ОстатокДС - ОстатокПоФондамБезНал;
			Иначе
				ОблСтрока = Макет.ПолучитьОбласть("ПояснениеОшибкиДС2");
				ОблСтрока.Параметры.СуммаДС = ОстатокПоФондамБезНал - ОстатокДС;
				ОблСтрока.Параметры.СсылкаНаОтчет = "e1cib/app/Отчет.ИА_КонтрольПлатежейВнеФондов";
			КонецЕсли;
			ТабДок.Вывести(ОблСтрока);
		Иначе
			ОблСтрока.Параметры.СуммаФондов = ОстатокПоФондамБезНал; 
			ОблСтрока.Параметры.СуммаДС = ОстатокДС;
			ТабДок.Вывести(ОблСтрока);
		КонецЕсли;
		
		
		// ЗАЙМЫ
		тзЗаймов = ИА_ФПСервер.ПолучитьТЗЗаймов(Объект.Дата, Объект.Организация, не ФППоОрганизациям, Объект.РаспределениеПоФондам.Выгрузить()); 
		Если тзЗаймов.Количество() > 0 Тогда
			Если ИспПодразделения Тогда
				ОблСтрока = Макет.ПолучитьОбласть("ШапкаЗаймы");
				ОблСтрокаИтог = Макет.ПолучитьОбласть("СтрокаЗаймыИтогПодр");
			Иначе
				ОблСтрока = Макет.ПолучитьОбласть("ШапкаЗаймыБезПодр");
				ОблСтрокаИтог = Макет.ПолучитьОбласть("СтрокаЗаймыИтог");
			КонецЕсли;
			ТабДок.Вывести(ОблСтрока);
			
			Для каждого стрПодр из тзЗаймов Цикл
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаЗаймы");
				Если ИспПодразделения Тогда
					ОблСтрока = Макет.ПолучитьОбласть("СтрокаЗаймы");
					ОблСтрока.Параметры.НаПодразделение = стрПодр.Подразделение;
					ОблСтрока.Параметры.НаФонд = стрПодр.Фонд;
				Иначе
					ОблСтрока = Макет.ПолучитьОбласть("СтрокаЗаймыБезПодр");
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры, стрПодр);
				ОблСтрока.Параметры.НаФОнд = стрПодр.Фонд;
				ТабДок.Вывести(ОблСтрока);
			КонецЦикла;
			
			// итог
			ОблСтрокаИтог.Параметры.Сумма = тзЗаймов.Итог("Сумма");
			ТабДок.Вывести(ОблСтрокаИтог);
		КонецЕсли;

		ОблПодвал = Макет.ПолучитьОбласть("ПодвалЗаливка");
		ТабДок.Вывести(ОблПодвал);
		
		Если ЭтоСостояние Тогда
			ОблПодвалС = Макет.ПолучитьОбласть("ПодвалСостояние");			
			ТабДок.Вывести(ОблПодвалС);
		КонецЕсли;
		
		Если табД = Неопределено Тогда
			ПолеТабДок1.Очистить();
			ПолеТабДок1.Вывести(ТабДок.ПолучитьОбласть());
		Иначе
			табД.Очистить();
			табД.Вывести(ТабДок.ПолучитьОбласть());
		КонецЕсли;
		
	Иначе
		ВыхТаблицаЗнач = РезЗапроса.Выгрузить();
		Если не ВыводитьГруппировкуПоСчетам Тогда
			ВыхТаблицаЗнач.ЗаполнитьЗначения(Справочники.ИА_Счета.ПустаяСсылка() ,"Счет");
			ВыхТаблицаЗнач.Свернуть("Подразделение, Фонд, Счет", "ДоФП_Остаток,ДоФП_Резерв,ФП_Резерв,ФП_Приход,ПослеФП_Остаток,ПослеФП_Резерв");
		КонецЕсли;
		Если не ИспПодразделения Тогда
			ВыхТаблицаЗнач.ЗаполнитьЗначения(Справочники.ИА_ЦФО.ПустаяСсылка() ,"Подразделение");
			ВыхТаблицаЗнач.Свернуть("Подразделение, Фонд, Счет", "ДоФП_Остаток,ДоФП_Резерв,ФП_Резерв,ФП_Приход,ПослеФП_Остаток,ПослеФП_Резерв");
		КонецЕсли;
		ЗначениеВРеквизитФормы(ВыхТаблицаЗнач, "ВыходнаяТаблица");
		
		// Заполнение таблицы с состоянием фондов
		Запрос = новый запрос;
		Запрос.УстановитьПараметр("ТаблицаФондов", ВыхТаблицаЗнач);
		ЗапросТекст = "ВЫБРАТЬ
		               |	ТаблицаФондов.Счет КАК Счет,
		               |	ТаблицаФондов.Подразделение КАК Подразделение,
		               |	ТаблицаФондов.Фонд КАК Фонд,
		               |	ТаблицаФондов.ПослеФП_Резерв КАК Зарезервировано,
		               |	ТаблицаФондов.ПослеФП_Остаток КАК СвободныеСредства,
		               |	ТаблицаФондов.ПослеФП_Остаток + ТаблицаФондов.ПослеФП_Резерв КАК ИтогоНаФонде
		               |ПОМЕСТИТЬ ТаблицаФондов
		               |ИЗ
		               |	&ТаблицаФондов КАК ТаблицаФондов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаФондов.Счет КАК Счет,
		               |	ТаблицаФондов.Подразделение КАК Подразделение,
		               |	ТаблицаФондов.Фонд КАК Фонд,
		               |	ТаблицаФондов.Зарезервировано КАК Зарезервировано,
		               |	ТаблицаФондов.СвободныеСредства КАК СвободныеСредства,
		               |	ТаблицаФондов.ИтогоНаФонде КАК ИтогоНаФонде
		               |ИЗ
		               |	ТаблицаФондов КАК ТаблицаФондов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_ЦФО КАК ИА_ЦФО
		               |		ПО ТаблицаФондов.Подразделение = ИА_ЦФО.Ссылка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_Фонды КАК ИА_Фонды
		               |		ПО ТаблицаФондов.Фонд = ИА_Фонды.Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Счет,
		               |	ИА_ЦФО.Наименование,
		               |	ИА_Фонды.Наименование
		               |ИТОГИ
		               |	СУММА(Зарезервировано),
		               |	СУММА(СвободныеСредства),
		               |	СУММА(ИтогоНаФонде)
		               |ПО
		               |	%СтрокаГруппировки%";
		СтрокаГруппировки = "Фонд";
		МассивГрупп = Новый массив;
		МассивГрупп.Добавить("Фонд");
		Если ИспПодразделения Тогда
			СтрокаГруппировки = "Подразделение," + СтрокаГруппировки;
			МассивГрупп.Вставить(0,"Подразделение");
		КонецЕсли;
		Если ВыводитьГруппировкуПоСчетам Тогда
			СтрокаГруппировки = "Счет," + СтрокаГруппировки;
			МассивГрупп.Вставить(0,"Счет");
		КонецЕсли;
		
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "%СтрокаГруппировки%", СтрокаГруппировки);
		Запрос.Текст = ЗапросТекст;
		ДеревоСостФонд = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		ДеревоСостФонд.Колонки.Добавить("СчетПодразделениеФонд");
		ДеревоСостФонд.Колонки.Добавить("ЭтоЗаголовок");
		
		ЕстьМинус = ложь;
		Для каждого стрУр1 из ДеревоСостФонд.Строки Цикл
			стрУр1.СчетПодразделениеФонд = стрУр1[МассивГрупп[0]];
			
			Если стрУр1.СвободныеСредства < 0 или стрУр1.ИтогоНаФонде < 0 Тогда
				ЕстьМинус = истина;
			КонецЕсли;
			
			Если МассивГрупп.Количество() > 1 Тогда
				стрУр1.ЭтоЗаголовок = истина;
				
				Для каждого стрУр2 из стрУр1.Строки Цикл
					стрУр2.СчетПодразделениеФонд = стрУр2[МассивГрупп[1]];
					
					Если стрУр2.СвободныеСредства < 0 или стрУр2.ИтогоНаФонде < 0 Тогда
						ЕстьМинус = истина;
					КонецЕсли;
					
					Если МассивГрупп.Количество() > 2 Тогда
						стрУр2.ЭтоЗаголовок = истина;
						
						Для каждого стрУр3 из стрУр2.Строки Цикл
							стрУр3.СчетПодразделениеФонд = стрУр3[МассивГрупп[2]];
							
							Если стрУр3.СвободныеСредства < 0 или стрУр3.ИтогоНаФонде < 0 Тогда
								ЕстьМинус = истина;
							КонецЕсли;
					
							стрУр3.Строки.Очистить();
						КонецЦикла;
					Иначе
						стрУр2.Строки.Очистить();
					КонецЕсли;
				КонецЦикла;
			Иначе
				стрУр1.Строки.Очистить();
			КонецЕсли;
		КонецЦикла;
		
		Элементы.ДекорацияЕстьМинус.Видимость = ЕстьМинус;
		Элементы.ДекорацияЕстьМинус1.Видимость = ЕстьМинус;
		
		ДеревоСостФонд.Колонки.Удалить("Счет");
		ДеревоСостФонд.Колонки.Удалить("Подразделение");
		ДеревоСостФонд.Колонки.Удалить("Фонд");
		
		ЗначениеВРеквизитФормы(ДеревоСостФонд, "ДеревоСостояниеФондов");
		
		ЗаголовокКол = "";
		Для каждого УрГр из МассивГрупп Цикл
			Если ЗаголовокКол <> "" Тогда
				ЗаголовокКол = ЗаголовокКол + " / ";	
			КонецЕсли;
			
			ЗаголовокКол = ЗаголовокКол + УрГр;
		КонецЦикла;
		Элементы.ДеревоСостояниеФондовСчетПодразделениеФонд.Заголовок = ЗаголовокКол;
		Элементы.ДеревоСостояниеФондовСчетПодразделениеФонд1.Заголовок = ЗаголовокКол;
		
		ЕстьОстатки = ДеревоСостФонд.Строки.Количество()>0;
		
		Элементы.ДеревоСостояниеФондов.Видимость = ЕстьОстатки;
		Элементы.ДеревоСостояниеФондов1.Видимость = ЕстьОстатки;
		
		Элементы.ДекорацияНетДенег.Видимость = не ЕстьОстатки;
		Элементы.ДекорацияНетДенег1.Видимость = не ЕстьОстатки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСтрокуОтчетаПоСоcтояниюФондов(СтрокаДер, Макет, ТабДок)
	
	Для каждого стр из СтрокаДер.Строки Цикл
		Если стр.фонд <> NULL Тогда
			ОблСтрока = Макет.ПолучитьОбласть("СтрокаФонд");			
			//Если стр.ПослеФП_Остаток < 0 Тогда
			//	ОблСтрока = Макет.ПолучитьОбласть("СтрокаКраснаяФонд");
			//КонецЕсли;
			
			ОблСтрока.Параметры.Заполнить(стр);
			ОблСтрока.Параметры.Фонд = "- " + стр.Фонд;                
			
			ПараметрПозиционирования = строка(стр.Фонд);
			Если ИспПодразделения Тогда
				ПараметрПозиционирования = строка(стр.Подразделение) + "/" + ПараметрПозиционирования;
			КонецЕсли;
			Если ВыводитьГруппировкуПоСчетам Тогда
				ПараметрПозиционирования = строка(стр.Счет) + "/" + ПараметрПозиционирования;
			КонецЕсли;
			ОблСтрока.Параметры.Фонд_Р = ПараметрПозиционирования; 
			ТабДок.Вывести(ОблСтрока, 2);
			Если стр.счет = Справочники.ИА_Счета.ГлавныйСчет Тогда
				ГС_Оборот = ГС_Оборот + стр.ФП_Приход; 
			КонецЕсли;
			
			Продолжить;
		ИначеЕсли стр.Подразделение <> NULL Тогда
			ОблСтрока = Макет.ПолучитьОбласть("СтрокаПодразделение");		
			//Если стр.ПослеФП_Остаток < 0 Тогда
			//	ОблСтрока = Макет.ПолучитьОбласть("СтрокаКраснаяПодразделение");
			//КонецЕсли;			
			ОблСтрока.Параметры.Заполнить(стр);
			ОблСтрока.Параметры.Фонд   = стр.Подразделение;			
			Если ВыводитьГруппировкуПоСчетам Тогда
				ПараметрПозиционирования = "" + стр.Счет + "/" + стр.Подразделение;
			Иначе	
				ПараметрПозиционирования = "" + стр.Подразделение
			КонецЕсли;
			ОблСтрока.Параметры.Фонд_Р = ПараметрПозиционирования;			
			ТабДок.Вывести(ОблСтрока, 1);
		ИначеЕсли стр.Счет <> NULL Тогда
			ОблСтрока = Макет.ПолучитьОбласть("СтрокаСчет");
			ОблСтрока.Параметры.Заполнить(стр);
			ОблСтрока.Параметры.Фонд = стр.Счет;
			ОблСтрока.Параметры.Фонд_Р = "" + стр.Счет;
			ТабДок.Вывести(ОблСтрока, 0);
		КонецЕсли;
		
		ВывестиСтрокуОтчетаПоСоcтояниюФондов(стр, Макет, ТабДок);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстатокДС()
	
	МассивОрганизаций = МассивОрганизацийФП();
	Запрос= Новый Запрос;
	Запрос.УстановитьПараметр("НаДату", Объект.Дата+1);
	
	Рез = Новый Структура("СуммаНал, СуммаБезнал",0,0);
	
	//Арчил Тваладзе 21.04.2016
	//настроки заполнения реквизитов, заполняются в зависимости от базовой конфигурации, в Настройки
	СтруктураНастройкиРеквизитов = ИА_ФП_ПовторИсп.ПолучитьЗначениеКонстанты_ФП_НастройкиРеквизитов(); 
	
	Если СтруктураНастройкиРеквизитов.Свойство("ТипРегистраДенежныеСредства") и ЗначениеЗаполнено(СтруктураНастройкиРеквизитов.ТипРегистраДенежныеСредства) Тогда
		ТипРегистраДенежныеСредства = СтруктураНастройкиРеквизитов.ТипРегистраДенежныеСредства;
	Иначе
		Сообщить("Заполните настройки реквизитов ФП!");
		Возврат Рез;
	КонецЕсли;
	
	Если ТипРегистраДенежныеСредства = "РегистрНакопления"  Тогда
		
		СтруктураРегистраДенежныеСредства   = СтруктураНастройкиРеквизитов.СтруктураРегистраДенежныеСредства;
		КоличествоРегистровДенежныеСредства = СтруктураРегистраДенежныеСредства.КоличествоРегистровДенежныеСредства;
		
		Если КоличествоРегистровДенежныеСредства = 2 Тогда
			ИмяРегистраНаличные               = СтруктураРегистраДенежныеСредства.ИмяРегистраДенежныеСредстваНаличные;
			ИмяРегистраБезНаличные            = СтруктураРегистраДенежныеСредства.ИмяРегистраДенежныеСредстваБезНаличные;
			ИмяРесурсаСуммаУпрНаличные        = СтруктураРегистраДенежныеСредства.ИмяРесурсаСуммаУпрНаличные;
			ИмяРесурсаСуммаУпрБезНаличные     = СтруктураРегистраДенежныеСредства.ИмяРесурсаСуммаУпрБезНаличные;
		иначе 
			
			ИмяРегистраНаличные               = СтруктураРегистраДенежныеСредства.ИмяРегистраДенежныеСредства;
			ИмяРегистраБезНаличные            = СтруктураРегистраДенежныеСредства.ИмяРегистраДенежныеСредства;
			ИмяИзмеренияТипДенежныхСредств    = СтруктураРегистраДенежныеСредства.ИмяИзмеренияТипДенежныхСредств;
			ИмяПеречисленияТипДенежныхСредств = СтруктураРегистраДенежныеСредства.ИмяПеречисленияТипДенежныхСредств;
			ИмяРесурсаСуммаУпрНаличные        = СтруктураРегистраДенежныеСредства.ИмяРесурсаСуммаУпр;
			ИмяРесурсаСуммаУпрБезНаличные     = СтруктураРегистраДенежныеСредства.ИмяРесурсаСуммаУпр;
			
		КонецЕсли;
		
		Если КоличествоРегистровДенежныеСредства = 1 Тогда
			
			ФильтрПоТипуДенежныхСредств = "" + ИмяИзмеренияТипДенежныхСредств+" = Значение(Перечисление."+ИмяПеречисленияТипДенежныхСредств+".%ШаблонТипаДС%)";
			Если ФППоОрганизациям Тогда
				ФильтрПоОрганизации = ?(ФППоОрганизациям, " И Организация В (&Организация)","");
			КонецЕсли;
			
		иначе
			
			ФильтрПоТипуДенежныхСредств = "";
			Если ФППоОрганизациям Тогда
				ФильтрПоОрганизации = ?(ФППоОрганизациям, "Организация В (&Организация)","");
			КонецЕсли;
			
		КонецЕсли;
		
		ШаблонТекстаЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваОстатки.%ШаблонИмяРесурсаСуммаУпр%Остаток
		|ИЗ
		|	РегистрНакопления.%ШаблонИмяРегистра%.Остатки(&НаДату, "+ФильтрПоТипуДенежныхСредств + ФильтрПоОрганизации + ") КАК ДенежныеСредстваОстатки";
		
		// наличные
		ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "%ШаблонИмяРесурсаСуммаУпр%", ИмяРесурсаСуммаУпрНаличные);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,        "%ШаблонИмяРегистра%",        ИмяРегистраНаличные);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,        "%ШаблонТипаДС%",             "Наличные");
		Запрос.Текст =ТекстЗапроса;
		
		Если ФППоОрганизациям Тогда
			Запрос.УстановитьПараметр("Организация", МассивОрганизаций);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Рез.СуммаНал = Выборка[ИмяРесурсаСуммаУпрНаличные+"Остаток"];
		КонецЦикла;
		
		// безналичные
		ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "%ШаблонИмяРесурсаСуммаУпр%", ИмяРесурсаСуммаУпрБезНаличные);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,        "%ШаблонИмяРегистра%",        ИмяРегистраБезНаличные);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,        "%ШаблонТипаДС%",             "БезНаличные");
		Запрос.Текст =ТекстЗапроса;
		
		Если ФППоОрганизациям Тогда
			Запрос.УстановитьПараметр("Организация", МассивОрганизаций);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Рез.СуммаБезнал = Выборка[ИмяРесурсаСуммаУпрБезНаличные+"Остаток"];
		КонецЦикла;
		
	Иначе
		
		СтруктураРегистраДенежныеСредства = СтруктураНастройкиРеквизитов.СтруктураРегистраДенежныеСредства;
		
		ИмяРегистраБухгалтерии = СтруктураРегистраДенежныеСредства.ИмяРегистраБухгалтерии;
		КодСчетаНаличные       = СтруктураРегистраДенежныеСредства.КодСчетаНаличные;
		КодСчетаБезНаличные    = СтруктураРегистраДенежныеСредства.КодСчетаБезНаличные;
		
		СчетНал    = ПланыСчетов[ИмяРегистраБухгалтерии].НайтиПоКоду(КодСчетаНаличные);
		СчетБезНал = ПланыСчетов[ИмяРегистраБухгалтерии].НайтиПоКоду(КодСчетаБезНаличные);
		
		Запрос.УстановитьПараметр("Счет", СчетНал); 
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХозрасчетныйОстатки.СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии."+ИмяРегистраБухгалтерии+".Остатки(&НаДату, Счет В ИЕРАРХИИ (&Счет), ," + ?(ФППоОрганизациям, " Организация В (&Организация))",")") + " КАК ХозрасчетныйОстатки";
		
		Если ФППоОрганизациям Тогда
			Запрос.УстановитьПараметр("Организация", МассивОрганизаций);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Рез.СуммаНал = Выборка.СуммаОстаток;
		КонецЕсли;;
		
		Запрос.УстановитьПараметр("Счет", СчетБезНал); 
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Рез.СуммаБезНал = Выборка.СуммаОстаток;
		КонецЕсли;
	КонецЕсли;
	//конец Арчил Тваладзе 21.04.2016
	
	//старый механизм
	//Если Найти(Метаданные.Имя,"УправлениеТорговлей") > 0 И Найти(Метаданные.Версия,"10.3") = 0 Тогда 
	//	// безналичные
	//	Запрос.Текст = "ВЫБРАТЬ
	//	// |	ДенежныеСредстваОстатки.ВидДенежныхСредств,
	//	|	ДенежныеСредстваОстатки.СуммаУПРОстаток
	//	|ИЗ
	//	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(&НаДату" + ?(ФППоОрганизациям, ", Организация = &Организация)",")") + " КАК ДенежныеСредстваОстатки";
	//	
	//	Если ФППоОрганизациям Тогда
	//		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//	КонецЕсли;
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Рез.СуммаБезнал = Выборка.СуммаУПРОстаток;
	//	КонецЦикла;
	//	
	//	// наличные
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	ДенежныеСредстваОстатки.СуммаУПРОстаток
	//	|ИЗ
	//	|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(&НаДату" + ?(ФППоОрганизациям, ", Организация = &Организация)",")") + " КАК ДенежныеСредстваОстатки";
	//	
	//	Если ФППоОрганизациям Тогда
	//		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//	КонецЕсли;
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Рез.СуммаНал = Выборка.СуммаУПРОстаток;
	//	КонецЦикла;
	//ИначеЕсли Найти(Метаданные.Имя,"Бухгалтерия") = 0 Тогда
	//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ДенежныеСредстваОстатки.ВидДенежныхСредств,
	//	|	ДенежныеСредстваОстатки.СуммаУПРОстаток
	//	|ИЗ
	//	|	РегистрНакопления.ДенежныеСредства.Остатки(&НаДату" + ?(ФППоОрганизациям, ", Организация = &Организация)",")") + " КАК ДенежныеСредстваОстатки";
	//	
	//	Если ФППоОрганизациям Тогда
	//		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//	КонецЕсли;
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Если Выборка.ВидДенежныхСредств = Перечисления["ВидыДенежныхСредств"].Безналичные Тогда // в кавычках чтобы не было ошибки компиляции в других конфигурациях
	//			Рез.СуммаБезнал = Выборка.СуммаУПРОстаток;
	//		Иначе
	//			Рез.СуммаНал = Выборка.СуммаУПРОстаток;
	//		КонецЕсли;
	//	КонецЦикла;
	//Иначе
	//	СчетНал = ПланыСчетов["Хозрасчетный"].Касса;
	//	СчетБезНал = ПланыСчетов["Хозрасчетный"].РасчетныеСчета;
	//	
	//	Запрос.УстановитьПараметр("Счет", СчетНал); 
	//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ХозрасчетныйОстатки.СуммаОстаток
	//	|ИЗ
	//	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НаДату, Счет В ИЕРАРХИИ (&Счет), ," + ?(ФППоОрганизациям, " Организация = &Организация)",")") + " КАК ХозрасчетныйОстатки";
	//	
	//	Если ФППоОрганизациям Тогда
	//		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//	КонецЕсли;
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		Рез.СуммаНал = Выборка.СуммаОстаток;
	//	КонецЕсли;;
	//	
	//	Запрос.УстановитьПараметр("Счет", СчетБезНал); 
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		Рез.СуммаБезНал = Выборка.СуммаОстаток;
	//	КонецЕсли;;
	//КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

&НаСервере
Функция МассивОрганизацийФП()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ГруппыКомпанийДочерниеОрганизации.Организация
	|ИЗ
	|	Справочник.ИА_ГруппыКомпаний.ДочерниеОрганизации КАК ИА_ГруппыКомпанийДочерниеОрганизации
	|ГДЕ
	|	ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|
	|СГРУППИРОВАТЬ ПО
	|	ИА_ГруппыКомпанийДочерниеОрганизации.Организация";
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Массив = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Массив.Добавить(ВыборкаДетальныеЗаписи.Организация);
	КонецЦикла;
	Если Массив.Найти(Объект.Организация) = Неопределено Тогда 
		Массив.Добавить(Объект.Организация);
	КонецЕсли;
	Возврат Массив;
	
КонецФункции

&НаСервере
Функция ПолучитьПоследнееФП()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ФинансовоеПланирование.Ссылка КАК Ссылка,
	               |	ИА_ФинансовоеПланирование.Дата КАК Дата,
	               |	ИА_ФинансовоеПланирование.Номер КАК Номер
	               |ИЗ
	               |	Документ.ИА_ФинансовоеПланирование КАК ИА_ФинансовоеПланирование
	               |ГДЕ
	               |	ИА_ФинансовоеПланирование.Проведен = ИСТИНА
	               |	И (ИА_ФинансовоеПланирование.Организация = &Организация
	               |			ИЛИ &НеРазделять)
	               |	И ИА_ФинансовоеПланирование.Дата < &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ФинансовоеПланирование.Дата УБЫВ";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НеРазделять", не ФППоОрганизациям);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Дата) , Объект.Дата, ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
				
	Если Выборка.Следующий() Тогда
		ПредФпСтрукт = Новый структура("Ссылка, Дата, НомерПредыдущегоФП_ДляАвтодохода, ДатаПредыдущегоФП_ДляАвтодохода", 
								Выборка.Ссылка, Выборка.Дата, Выборка.Номер, Выборка.Дата);
	Иначе
		ПредФпСтрукт = Новый структура("Ссылка, Дата, НомерПредыдущегоФП_ДляАвтодохода, ДатаПредыдущегоФП_ДляАвтодохода", 
					Документы.ИА_ФинансовоеПланирование.ПустаяСсылка(), дата(1,1,1),"", дата(1,1,1));		
	КонецЕсли;
	
	// последнее фп с автодоходом
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ФинансовоеПланирование.Дата КАК ДатаПредыдущегоФП_ДляАвтодохода,
				   |	ИА_ФинансовоеПланирование.Номер КАК НомерПредыдущегоФП_ДляАвтодохода
	               |ИЗ
	               |	Документ.ИА_ФинансовоеПланирование КАК ИА_ФинансовоеПланирование
	               |ГДЕ
	               |	ИА_ФинансовоеПланирование.Проведен = ИСТИНА
	               |	И (ИА_ФинансовоеПланирование.Организация = &Организация
	               |			ИЛИ &НеРазделять)
	               |	И ИА_ФинансовоеПланирование.Дата < &Дата
	               |	И ИА_ФинансовоеПланирование.АвтосборДоходов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ФинансовоеПланирование.Дата УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();				
	Если Выборка.Следующий() Тогда
		ПредФпСтрукт.ДатаПредыдущегоФП_ДляАвтодохода = выборка.ДатаПредыдущегоФП_ДляАвтодохода;
		ПредФпСтрукт.НомерПредыдущегоФП_ДляАвтодохода = выборка.НомерПредыдущегоФП_ДляАвтодохода;
	КонецЕсли;
	
	ПредФп = ПредФпСтрукт.Ссылка;
	ДатаПредыдущегоФП = ПредФпСтрукт.Дата;
	НомерПредыдущегоФП_ДляАвтодохода = ПредФпСтрукт.НомерПредыдущегоФП_ДляАвтодохода;
	ДатаПредыдущегоФП_ДляАвтодохода = ПредФпСтрукт.ДатаПредыдущегоФП_ДляАвтодохода;
	
	Возврат ПредФпСтрукт;
КонецФункции

&НаКлиенте
Функция ПолучитьДатуНачалаДоходов()
	
	Если ДатаПредыдущегоФП_ДляАвтодохода <> Дата(1,1,1) Тогда
		Возврат ДатаПредыдущегоФП_ДляАвтодохода + 1;
	Иначе
		Возврат Объект.Дата - 60*60*24*7 + 1;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОбновитьПериодыДоходов(ОбновлятьЗначения = истина)
	Если объект.РучнойПериодДоходов Тогда			
		Элементы.Доходы_ДатаНачала.Подсказка = "Вы меняли интервал заполнения доходов вручную.";
	КонецЕсли;
	
	БлокНачала = ДатаПредыдущегоФП_ДляАвтодохода > объект.Дата - 60*60*24 * 10;
	//Элементы.Доходы_ДатаНачала.ТолькоПросмотр = БлокНачала;
	
	Доходы_ДатаНачала1 = ПолучитьДатуНачалаДоходов();
	
	Если ОбновлятьЗначения Тогда
		Объект.Доходы_ДатаНачала = Доходы_ДатаНачала1;
	КонецЕсли;
	
	
	Если ДатаПредыдущегоФП_ДляАвтодохода <> Дата(1,1,1) Тогда
		ЗаголовокСтрока = Новый Массив;
		ЗаголовокСтрока.Добавить("Левая граница устанавливается автоматически на основании даты последнего ФП с включенным автосбором доходов." + Символы.ПС);
		ЗаголовокСтрока.Добавить("Во избежание искажения данных по доходу в текущем ФП не рекомендуется менять это поле вручную." + Символы.ПС+ Символы.ПС);
		ЗаголовокСтрока.Добавить(Новый ФорматированнаяСтрока("Предыдущее ФП с включенным автосбором доходов: №"+НомерПредыдущегоФП_ДляАвтодохода +" от "+ ДатаПредыдущегоФП_ДляАвтодохода , , новый цвет(0,0,255)));
		
		Элементы.Доходы_ДатаНачала.РасширеннаяПодсказка.Заголовок = новый ФорматированнаяСтрока(ЗаголовокСтрока); 
		//Если БлокНачала тогда
		//	Элементы.Доходы_ДатаНачала.РасширеннаяПодсказка.Заголовок = Элементы.Доходы_ДатаНачала.РасширеннаяПодсказка.Заголовок  + "." + Символы.ПС + "Редактирование запрещено т.к. предыдущий документ находится в прошлой неделе и редактирование не требуется.";
		//КонецЕсли;
	Иначе			
		Элементы.Доходы_ДатаНачала.РасширеннаяПодсказка.Заголовок = "Предыдущее ФП не обнаружено. "+Символы.ПС+"Установите дату и время левой границы интервала для автоматического сбора дохода. "+Символы.ПС+"В дальнейшем это поле будет устанавливаться автоматически на основе даты предыдущего ФП";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоходыБПСервер()
	
	Объект.ДоходыБП_Распределение.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_ДоходыБудущихПериодовОстатки.ВидДохода,
	|	ИА_ДоходыБудущихПериодовОстатки.Источник,
	|	ИА_ДоходыБудущихПериодовОстатки.СуммаНалОстаток КАК СуммаНал,
	|	ИА_ДоходыБудущихПериодовОстатки.СуммаБезналОстаток КАК СуммаБезнал
	|ИЗ
	|	РегистрНакопления.ИА_ДоходыБудущихПериодов.Остатки(
	|			&НаДату,
	|			Организация = &Организация
	|				ИЛИ &НеРазделять) КАК ИА_ДоходыБудущихПериодовОстатки
	|ГДЕ
	|	ИА_ДоходыБудущихПериодовОстатки.СуммаНалОстаток <> 0
	|			ИЛИ ИА_ДоходыБудущихПериодовОстатки.СуммаБезналОстаток <> 0";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НеРазделять", не ФППоОрганизациям);
	Запрос.УстановитьПараметр("НаДату", Объект.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Новстр = Объект.ДоходыБП_Распределение.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоходыБП()
	Если ЗначениеЗаполнено(Объект.Ссылка) и Объект.ДоходыБП_Распределение.Количество()> 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьДоходыБПЗавершение",ЭтотОбъект),"Таблица будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;		
	КонецЕсли;	
	ОбновитьДоходыБПСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоходыБПЗавершение(РезультатВопроса, дп) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОбновитьДоходыБПСервер();
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ДоходыПриИзменении(Элемент)
	ПересчитатьПриИзменДоходов();
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Элемент.ТекущиеДанные.Итого = Элемент.ТекущиеДанные.СуммаБезнал + Элемент.ТекущиеДанные.СуммаНал;
	КонецЕсли;
	Элементы.ДоходыЧистые.ТекстПодвала = Объект.Доходы.Итог("СуммаНал") + Объект.Доходы.Итог("СуммаБезнал");
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьДатуФП1()
	Объект.ПериодФП1 = КонецДня(Объект.Дата - 12 * 7 * 24 * 60 * 60) + 1;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#ЕСЛИ ВебКлиент ТОГДА
		ЭтоВеб = истина;
	#КОНЕЦЕСЛИ	
		
	Если не ИА_Защита_Общий.ЛицензияДоступна("ФП") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	СостояниеЗаказаОдобренКлиент     = ИА_ФП.СтатусыОдобрено();
	
	ЕстьСтатистики = ИА_КСУОбщийСервер.ЕстьСтатистики();
	Элементы.ПолеТабДокСтатистики.Видимость = ЕстьСтатистики;
	Элементы.ОбновитьГрафики.Видимость = ЕстьСтатистики;
	Элементы.РаскрытьНаВесьЭкранГрафики.Видимость = ЕстьСтатистики;
	Элементы.ДекорацияНетСтатистик.Видимость = не ЕстьСтатистики;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если  ФППоОрганизациям = ложь или объект.Организация.Пустая() = ложь тогда 
			ОбновитьДокументКлиент();
			ОбновитьЗНО_Сервер();
		КонецЕсли;
	Иначе
		ПриОткрытииНаСервере1();
		ПересчитатьСальдоСредствКРаспределению();
	КонецЕсли;
	
	Если Объект.ПериодФП1 = Дата(1,1,1) Тогда
		ЗаполнитьДатуФП1();
	КонецЕсли;
	
	Элементы.Организация.Видимость = ФППоОрганизациям;
	ОбновитьОтображениеИтого();
	
	Если  ФППоОрганизациям = ложь или объект.Организация.Пустая() = ложь тогда
		ОбновитьОтчетПоСотояниюФондов();
	Иначе
		Элементы.ГруппаГлавная.Доступность = ложь;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПроверитьИзменениеРазмераОкна", 1, ложь);	
	
	Попытка
		#ЕСЛИ ВебКлиент ТОГДА
			ЭтоВеб = истина;
			Элементы.ПолеСтатистика.Видимость = ложь;
			Элементы.ПолеТабДокСтатистики.Видимость = ложь;
		#ИНАЧЕ
			ФормаСтатистик = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма",,, ЭтаФорма.УникальныйИдентификатор);
		#КОНЕЦЕСЛИ
	Исключение
	КонецПопытки;
    
    Политика_Развернуть(1);
	Политика_Развернуть(2);
	
	// заглушка для отрисовки статистик
	sw = 1000;
	
	ОбновитьДоступностьПоУтверждению();
	ОбновитьВидимостьКнопкиПроведения();
	
	ВысотаЧистыхДоходов();
	ПоказатьСкрытьДеталиСостоянияФондов(Неопределено);
	ПоказатьСкрытьДеталиСостоянияФондов1(Неопределено);
	
	если ЕстьОшибкаВерсииТБ Тогда
		Оп = Новый ОписаниеОповещения("ЗакрытиеОшибкиВерсииТБ", ЭтотОбъект);
		ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ОшибкаВерсииТБ", , ЭтаФорма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	КолонкиВертикальноГоризонтально(Неопределено);
	ЗаказыДоступностьСвернутьРазвернуть();
	ОбновлятьДоступностьСвернутьРазвернутьЗаказы = истина;
	
	Элементы.ГруппироватьПоСчетам.Пометка = ВыводитьГруппировкуПоСчетам;
	
	ОбновитьОписаниеЗаказа();
	ОбновитьТекстАвтостатус();
	
	Доходы_ДатаНачала1 = ПолучитьДатуНачалаДоходов();
	Если объект.ЕстьАвтодоходы И не объект.Ссылка.Пустая() и не объект.РучнойПериодДоходов и ЗначениеЗаполнено(объект.Доходы_ДатаНачала) и объект.Доходы_ДатаНачала <> Доходы_ДатаНачала1 и не объект.Проведен Тогда
		ПоказатьПредупреждение(,"Левая граница интервала автоматического сбора доходов 
								|отличается от сохраненной. Возможно, были изменены более 
								|ранние документы ФП. Интервал будет изменен автоматически 
								|во избежание пропуска поступления средств.");
		ОбновитьПериодыДоходов();
		ОбновитьДокумент();
	Иначе
		ОбновитьПериодыДоходов(ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеОшибкиВерсииТБ(рез, дп) Экспорт
	Если рез<> Неопределено и рез Тогда
		ОбновитьДокументКлиент();
	Иначе
		Закрыть();
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Процедура ПриОткрытииНаСервере1()
	
	Если ФП_по_ТБ Тогда
		ЗаполнитьДеревоДоходов();
		ЗаполнитьДеревоДоходовЧистых();
		ОбновитьНеделиДоходыЧистые();
		ПересчитатьДоходыИтого();
		ОбновитьИтогоВЗаливку();
		ОбновитьЗаливку();
		ПоказатьНедели();
	КонецЕсли;
	
	ЗаполнитьТаблицуЗП(Объект.Проведен);
	ЗаполнитьЗНО_Док();
	
	Политика_ВДерево(1);
	Если не ФП_по_ТБ Тогда
		Политика_ВДерево(2);
	КонецЕсли;
	ОбновитьИтогиПолитик();
	
	УстановитьПараметрыСпискаВДПС();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗНО_Док()
	Для каждого стр из Объект.ЗНО Цикл
		Новстр = ТаблицаЗНО.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		ЗаполнитьЗначенияСвойств(Новстр, стр.Заказ,,"Статус,ПричинаОтказа");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеИтого()
	КоллекцияДоходы = ЭтаФорма.Объект.Доходы;
	Для Каждого Стр Из КоллекцияДоходы Цикл
		Стр.Итого = Стр.СуммаНал + Стр.СуммаБезнал;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьДокумент(Команда) Экспорт
		
	ОбновитьДокументКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументКлиент()

	ПредФпСтрукт = ПолучитьПоследнееФП();
	
	ОбновитьПериодыДоходов();
	
	Объект.ОтложенныйДоход.Очистить();
	
	ОбновитьДокумент();
	
	ВысотаЧистыхДоходов();
	
	Элементы.ГруппаАвтосборДоходов.Видимость = объект.ЕстьАвтодоходы;
	
КонецПроцедуры

&НаКлиенте
Процедура ВысотаЧистыхДоходов()	
	колСтр = 0;
	для каждого стр из ДоходыЧистые.ПолучитьЭлементы() Цикл
		колСтр = колСтр + 1;
		для каждого стр1 из стр.ПолучитьЭлементы() Цикл
			колСтр = колСтр + 1;
		КонецЦикла;
	КонецЦикла;
	
	Элементы.ДоходыЧистые.ВысотаВСтрокахТаблицы = колСтр + 3;
КонецПроцедуры


&НаКлиенте
Функция ЕстьРучныеЗначения()
	Для каждого стр из Объект.Политика1 Цикл
		если стр.Вручную Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ложь;
	
КонецФункции

&НаКлиенте
Процедура КомандаОбновитьПроценты1(Команда)
	ЕстьРучные = ЕстьРучныеЗначения();
	
	Если ЕстьРучные ТОгда
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаОбновитьПроценты1Завершение", ЭтотОбъект), "Перезаполнить значения в политиках, которые введены вручную?",РежимДиалогаВопрос.ДаНет);
	Иначе
		КомандаОбновитьПроценты1Фрагмент(ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПроценты1Завершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	НеОчищРучные = РезультатВопроса <> КодВозвратаДиалога.Да;
	
	КомандаОбновитьПроценты1Фрагмент(НеОчищРучные);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПроценты1Фрагмент(Знач НеОчищРучные)
	
	ЗаполнитьДоходыИПолитикиСервер(ложь, ложь,истина,истина, истина, НеОчищРучные);
	Политика_Развернуть(1);
	Политика_Развернуть(2);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПроценты2(Команда)	
	Если ФП_по_ТБ и Объект.Проведен ТОгда
		ПоказатьПредупреждение(, "Необходимо сначала отменить утверждение ФП.");
        Возврат;
	КонецЕсли;
	КомандаОбновитьПроценты2Фрагмент();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПроценты2Фрагмент()
	
	ЗаполнитьДоходыИПолитикиСервер(ложь, ложь,ложь,истина, истина, ложь);
	Если не ФП_по_ТБ Тогда
		Политика_Развернуть(2);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьРаспределениеСпецдохода(Команда)
	ОбновитьДоходыБП();
	ПересчитатьПриИзменДоходов();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПриИзменДоходов()
	ЗаполнитьДоходыИПолитикиСервер(Ложь, Истина, Истина, Истина, Истина, ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобрать(Команда)
	
	Записать();
	
	Парам = новый Структура("Док,Организация,ИспДоходыПоПодразделениям, ДатаОстатков",Объект.Ссылка, Объект.Организация,ИспДоходыПоПодразделениям, объект.Дата);
	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ФормаПодбораДБПУпр", Парам,,,,, Новый ОписаниеОповещения("КомандаПодобратьЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	рез = Результат;
	
	Если ТипЗнч(рез) = тип("Массив") Тогда
		Для каждого стр из рез Цикл
			Новстр = Объект.ОтложенныйДоход.Добавить();
			Новстр.ТипОперации = ПредопределенноеЗначение("Перечисление.КСУ_ОперацииСОтложеннымДоходом.Вернуть");
			ЗаполнитьЗначенияСвойств(Новстр, стр);
			Новстр.ид = стр.Источник;
			//Если ИА_БФКС.РеквизитЕсть(Новстр, "ВидДоходаПолучатель") Тогда
			//	Новстр.ВидДоходаПолучатель = Стр.ВидДохода;
			//КонецЕсли; 
		КонецЦикла;
		ПересчитатьПриИзменДоходов();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	//
	Объект.Организация = ИА_ФП.ПолучитьГоловнуюОрганизацию(Объект.Организация);
	//
	объект.РучнойПериодДоходов = ложь;
	
	Объект.ОтложенныйДоход.Очистить();
	ОбновитьДокументКлиент();
	
	ЗаполнитьТаблицуЗП(ложь);
	
	ОбновитьНадписьКнопкиОтДохода();
	
	Элементы.ГруппаГлавная.Доступность = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокумент() Экспорт		
	ЗаполнитьДоходыИПолитикиСервер(истина, истина,истина,истина, истина, ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗПКнопкаЗаполнить1(Команда)
	ОбновитьОтчетПоСотояниюФондов();
КонецПроцедуры

&НаСервере
Процедура ОтменаПроведения()
	ОбъектДокумент = РеквизитФормыВЗначение("Объект");
	ОбъектДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
	ЗначениеВРеквизитФормы(ОбъектДокумент, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗПКнопкаЗаполнить(Команда)
	
	Если Объект.Проведен Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаЗПКнопкаЗаполнитьЗавершение", ЭтотОбъект), "Для заполнения необходимо отменить проведение документа. Продолжить?", РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	КомандаЗПКнопкаЗаполнитьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗПКнопкаЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да ТОгда
		ОтменаПроведения();
	Иначе
		Возврат;
	КонецЕсли;
	
	КомандаЗПКнопкаЗаполнитьФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗПКнопкаЗаполнитьФрагмент()
	
	ЗаполнитьТаблицуЗП();
	ПересчитатьДерево();
	ПересчитатьСальдоСредствКРаспределению();
	ОбновитьОтчетПоСотояниюФондов();
	
КонецПроцедуры


&НаСервере
Функция ЗаказЗаполнен(Заказ)
	Возврат ЗначениеЗаполнено(Заказ);
КонецФункции

&НаКлиенте
Процедура КомандаОткрытьЗП(Команда)
	
	ТекущиеДанные = Элементы.ДеревоЗП.ТекущиеДанные;
	Если (ТекущиеДанные <> Неопределено) и (ЗаказЗаполнен(ТекущиеДанные.Заказ)) Тогда
		Если Модифицированность Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("КомандаОткрытьЗПЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), "Необходимо записать документ перед изменением Заказа на приобретение. Продолжить?",РежимДиалогаВопрос.ДаНет);
		Иначе
			ПоказатьЗначение(,ТекущиеДанные.Заказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьЗПЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		Записать();
		ПоказатьЗначение(,ТекущиеДанные.Заказ);
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ИА_ЗаказНаПриобретениеПустаяСсылка()
	Возврат Документы.ИА_ЗаказНаПриобретение.ПустаяСсылка();
КонецФункции

&НаСервереБезКонтекста
Функция  Сумма_ИА_СредстваВРезервеНаФондах(СуммаЗаказа,Заказ, СсылкаДок)
	
	СуммаТек = СуммаЗаказа;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход), 0) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, , Регистратор, ) КАК ИА_СредстваВРезервеНаФондахОбороты
	|ГДЕ
	|	ИА_СредстваВРезервеНаФондахОбороты.ЗП = &ЗП
	|	И ИА_СредстваВРезервеНаФондахОбороты.Регистратор <> &ТекДок";
	Запрос.УстановитьПараметр("ЗП", Заказ);
	Запрос.УстановитьПараметр("ТекДок", СсылкаДок);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СуммаТек = СуммаТек - Выборка.Сумма;
	КонецЦикла;
	Возврат СуммаТек;
КонецФункции

&НаСервереБезКонтекста
Функция ТекСтрокаЗаказФонд(Заказ)
	СтруктураЗВС = ИА_ФП.ВернутьСтатусЗВС(Заказ);
	Структура = Новый Структура("Фонд,ПредметЗаказа,Сумма,Статус,ВидДС,ИсходнаяСумма,ПричинаОтказа", Заказ.Фонд, Заказ.ПредметЗаказа,Заказ.Сумма, СтруктураЗВС.Статус,Заказ.ВидДС,Заказ.Сумма, СтруктураЗВС.ПричинаОтказа);
	Возврат Структура;
КонецФункции

&НаКлиенте 
Процедура ДеревоЗПЗаказПриИзменении(ТекСтрока)
	
	Если ЗначениеЗаполнено(ТекСтрока.Заказ) Тогда
		зак = ТекСтрока.Заказ;
		ДанныеЗаказа = ТекСтрокаЗаказФонд(зак);
		Если ДанныеЗаказа.Фонд <> ТекСтрока.Фонд Тогда
			Сообщить("У заказа другой фонд!");
			ТекСтрока.Заказ = ИА_ЗаказНаПриобретениеПустаяСсылка();
			Возврат;
		КонецЕсли;
		
		ТекСтрока.ПредметЗаказа = ДанныеЗаказа.ПредметЗаказа;
		ТекСтрока.ИсходнаяСумма = ДанныеЗаказа.ИсходнаяСумма;
		
		СуммаТек = Сумма_ИА_СредстваВРезервеНаФондах(ДанныеЗаказа.Сумма,зак, Объект.Ссылка);		
		ТекСтрока.Сумма = СуммаТек;
		
		ТекСтрока.Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП");
		ТекСтрока.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП");
		
		ТекСтрока.ОстатокПоЗаказу = ТекСтрока.Сумма;
		ТекСтрока.СтатусНомер = НомерСтатуса(ТекСтрока.Статус); 
	
		ТекСтрока.ПричинаОтказа = ДанныеЗаказа.ПричинаОтказа;
		
		ДеревоЗВСИзменение();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция ИА_СостояниеЗаказаПустаяСсылка()
	Возврат Перечисления.ИА_СостояниеЗаказа.ПустаяСсылка();
КонецФункции

&НаКлиенте
Функция ПроверкаНаДобавлениеЗаказа(рез)
	
	ТекущаяСтрока =Неопределено;
	
	Если ЗначениеЗаполнено(рез) Тогда
		ТекущаяСтрока = ПолучитьСтрокуЗП(ДеревоЗП, рез);
	КонецЕсли;
	
	Если ТекущаяСтрока=Неопределено Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура КомандаДобавитьОбработчик(рез, дп) Экспорт
	новстр = Неопределено;
	
	рез = формаНовогоЗаказа.Объект.Ссылка;
	Если ЗначениеЗаполнено(рез) Тогда
		Если ПроверкаНаДобавлениеЗаказа(рез) Тогда
			
			// добавим строки дерева
			ДанныеЗП = ПолучитьДанныеИзЗаказа(рез);
			Если (ИспПодразделения и ДанныеЗП.Подразделение.пустая()) или ДанныеЗП.Фонд.пустая() Тогда 
				ПоказатьПредупреждение(,"В заказе должны быть указаны подразделение и фонд!");
				Возврат;
			КонецЕсли;
									
			НайдСтрокаФонд = НайтиСтрокуФондВДереверЗП(ДанныеЗП);			
			
			// ДОБАВИМ ЗАКАЗ
			Новстр = НайдСтрокаФонд.ПолучитьЭлементы().Добавить();
			новстр.Фонд = ДанныеЗП.Фонд;
			новстр.Статья = ДанныеЗП.Статья;
			//новстр.ПодразделениеФонд = Строка(ДанныеЗП.Фонд); 
			новстр.ПодразделениеФонд = "№" + строка(число(ДанныеЗП.Номер)) + " " +ВРЕГ(ДанныеЗП.ПредметЗаказа);									
			Новстр.Заказ = рез;
			Новстр.ПредметЗаказа = ДанныеЗП.ПредметЗаказа;
			Новстр.Ситуация = ДанныеЗП.Ситуация;
			Новстр.Данные = ДанныеЗП.Данные;
			Новстр.Решение = ДанныеЗП.Решение;
			Новстр.Дата = ДанныеЗП.Дата;
			Новстр.Номер = ДанныеЗП.Номер;
			Новстр.СрокОплаты = ДанныеЗП.СрокОплаты;
			
			Если ВыводитьГруппировкуПоСчетам Тогда
				Новстр.Счет = ДанныеЗП.Счет;
			КонецЕсли;
			Если ИспПодразделения Тогда
				новстр.Подразделение = ДанныеЗП.Подразделение;
			КонецЕсли;
			
			ДеревоЗПЗаказПриИзменении(Новстр);
			СохранитьДеревоЗаказов();
		Иначе
			ПоказатьПредупреждение(,"Заказ уже добавлен!");
		КонецЕсли;
	КонецЕсли;
	
	Если новстр <> Неопределено Тогда
		Элементы.ДеревоЗП.ТекущаяСтрока = новстр.ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры
	
&НаКлиенте
Процедура КомандаДобавить(Команда)
		
	тд = Элементы.ДеревоЗП.ТекущиеДанные;
	
	ПараметрыОтбора = Новый Структура;	
	ПараметрыОтбора.Вставить("Организация", Объект.Организация);
	ПараметрыОтбора.Вставить("НеОповещать", истина);
	если тд<>Неопределено Тогда
		ПараметрыОтбора.Вставить("Фонд", тд.Фонд);
		ПараметрыОтбора.Вставить("Подразделение", тд.Подразделение);
	КонецЕсли;
	ПараметрыОтбора.Вставить("Статус", ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП"));
	ПараметрыОтбора.Вставить("Дата", Объект.Дата - 60);
		
	формаНовогоЗаказа = ОткрытьФорму("Документ.ИА_ЗаказНаПриобретение.Форма.ФормаДокументаУпр", ПараметрыОтбора, ЭтаФорма,,,,Новый ОписаниеОповещения("КомандаДобавитьОбработчик",ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуФондВДереверЗП(ДанныеЗП, создавать = истина)
	
	ТекСтрока =  ДеревоЗП;
	Если ВыводитьГруппировкуПоСчетам Тогда	
		Найдено = ложь;
		для каждого стр из ТекСтрока.ПолучитьЭлементы() Цикл
			Если стр.счет =  ДанныеЗП.Счет Тогда
				ТекСтрока = стр;
				Найдено = истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если не найдено Тогда
			Если создавать Тогда
				ТекСтрока = ТекСтрока.ПолучитьЭлементы().Добавить();
				ТекСтрока.Счет = ДанныеЗП.Счет;
				ТекСтрока.ПодразделениеФонд = Строка(ДанныеЗП.Счет);
			Иначе
				возврат Неопределено;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	Если ИспПодразделения Тогда	
		Найдено = ложь;
		для каждого стр из ТекСтрока.ПолучитьЭлементы() Цикл
			Если стр.Подразделение =  ДанныеЗП.Подразделение Тогда
				ТекСтрока = стр;
				Найдено = истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если не найдено Тогда
			Если создавать ТОгда
				ТекСтрока = ТекСтрока.ПолучитьЭлементы().Добавить();
				ТекСтрока.Подразделение = ДанныеЗП.Подразделение;
				Если ВыводитьГруппировкуПоСчетам Тогда
					ТекСтрока.Счет = ДанныеЗП.Счет;
				КонецЕсли;
				ТекСтрока.ПодразделениеФонд = Строка(ДанныеЗП.Подразделение);
			Иначе
				возврат Неопределено;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	

	Найдено = ложь;
	для каждого стр из ТекСтрока.ПолучитьЭлементы() Цикл
		Если стр.Фонд =  ДанныеЗП.Фонд Тогда
			ТекСтрока = стр;
			Найдено = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если не найдено Тогда
		Если создавать тогда
			ТекСтрока = ТекСтрока.ПолучитьЭлементы().Добавить();
			ТекСтрока.Фонд = ДанныеЗП.Фонд;
			Если ИспПодразделения Тогда
				ТекСтрока.Подразделение = ДанныеЗП.Подразделение;
			КонецЕсли;
			Если ВыводитьГруппировкуПоСчетам Тогда
					ТекСтрока.Счет = ДанныеЗП.Счет;
				КонецЕсли;
			ТекСтрока.ПодразделениеФонд = Строка(ДанныеЗП.Фонд);
		Иначе
			возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
		
	Возврат ТекСтрока;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеИзЗаказа(пЗаказ)
	Возврат Новый Структура("ПредметЗаказа, Ситуация,Данные,Решение,Дата,СрокОплаты,Номер,Подразделение, Фонд, Счет, Статья", 
							пЗаказ.ПредметЗаказа, пЗаказ.Ситуация, пЗаказ.Данные, пЗаказ.Решение, пЗаказ.Дата, пЗаказ.ДатаОплаты, пЗаказ.Номер,пЗаказ.Подразделение, пЗаказ.Фонд, пЗаказ.Фонд.Счет,  пЗаказ.Статья);
КонецФункции	

&НаСервере
Функция ПолучитьДанныеПоСтрокеЗВС(ИзменениеСтатусаСуммыУтв = Ложь, СтрукТекСтр = Неопределено)	
	
	БылиИзменения = Ложь;
	ЕстьОшибка = Ложь;
	НехваткаСуммы = 0;
	
	СостояниеЗаказаОдобрен     = ИА_ФП.СтатусыОдобрено();
	
	Если ИзменениеСтатусаСуммыУтв и СтрукТекСтр <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрукТекСтр.Заказ) и (СостояниеЗаказаОдобрен.найти(СтрукТекСтр.Статус) <> Неопределено) Тогда // проконтролируем сумму
			//ВыходнаяТаблица = Новый ТаблицаЗначений;
			ОбновитьОтчетПоСотояниюФондов(ложь);
			СтрПоиска = Новый Структура("Фонд,Подразделение", СтрукТекСтр.Фонд, СтрукТекСтр.Подразделение);
			НСтроки = ВыходнаяТаблица.НайтиСтроки(СтрПоиска); 
			Если НСтроки.Количество()>0 Тогда
				СтрокаСостояния = НСтроки[0];				
				Если СтрокаСостояния.ПослеФП_Остаток < 0 Тогда
					ЕстьОшибка = Истина;
					НехваткаСуммы = -СтрокаСостояния.ПослеФП_Остаток; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Струк = Новый Структура("НехваткаСуммы,ЕстьОшибка", НехваткаСуммы,ЕстьОшибка);
	Возврат Струк;
	
КонецФункции


&НаКлиенте
Процедура КомандаПомощникПополненияФондаОбработчик(рез, дп) Экспорт
	БылиИзменения = Ложь;
	ТекСтрока = Элементы.ДеревоЗП.ТекущиеДанные;
	Если рез <> Неопределено Тогда
		
		Если рез.СальдоСредствКРаспределениюВзять > 0 Тогда
			БылиИзменения = Истина;			
			ТекСтрока.ПолучитьРодителя().НачислениеВФонд = ТекСтрока.ПолучитьРодителя().НачислениеВФонд + рез.СальдоСредствКРаспределениюВзять;
		КонецЕсли;
							
		Для каждого стрТ из рез.ТаблицаФондов Цикл
			Если стрТ.Взять>0 Тогда
				БылиИзменения = Истина;
				
				Новстр = Займы.Добавить();
				Новстр.НаПодразделение = ТекСтрока.Подразделение;
				Новстр.НаФонд = ТекСтрока.Фонд;
				Новстр.СПодразделения = стрТ.Подразделение;
				Новстр.СФонда = стрТ.Фонд;
				Новстр.Сумма = стрТ.Взять;					
				
				Если рез.Займ Тогда
					Новстр.ЗаймВозврат = ПредопределенноеЗначение("Перечисление.ИА_ЗаймВозврат.Займ");
					Новстр.ПричинаЗайма = рез.ПричинаЗайма;
					Новстр.Комментарий = рез.Комментарий;
					Новстр.КрайнийСрок = рез.КрайнийСрок;
				Иначе
					Новстр.ЗаймВозврат = ПредопределенноеЗначение("Перечисление.ИА_ЗаймВозврат.Перемещение");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ПересчитатьДерево();
	Если БылиИзменения Тогда
		ЗаймыПриИзменении(Неопределено);
		ПересчитатьСальдоСредствКРаспределению();
	КонецЕсли;
	ОбновитьОтчетПоСотояниюФондов();
	
	ПредВыдОбл = Неопределено;
	ДеревоЗППриАктивизацииСтроки(Неопределено);
КонецПроцедуры
	
	
&НаКлиенте
Процедура КомандаПомощникПополненияФонда(Команда)
	
	тд = Элементы.ДеревоЗП.ТекущиеДанные;
	
	Если Элементы.ДеревоЗП.ТекущаяСтрока <> Неопределено Тогда
		подр = ?(ИспПодразделения,тд.Подразделение,ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка"));
		СтрукТекСтр = Новый Структура("Фонд,Подразделение,Статус,Заказ", тд.Фонд,подр , тд.Статус,тд.Заказ);
		стр = ПолучитьДанныеПоСтрокеЗВС(истина,СтрукТекСтр);
		// возвращаем текущую строку
		ИдентификаторСтроки = 0; 
		ПрекратитьПоиск = Ложь; 
		НайтиСтрокуДерева(ДеревоЗП.ПолучитьЭлементы(), тд, ИдентификаторСтроки, ПрекратитьПоиск); 
		Элементы.ДеревоЗП.ТекущаяСтрока = ИдентификаторСтроки;
		
		БылиИзменения = Ложь;
		Если стр.ЕстьОшибка Тогда
			ПараметрыИзФормы = Новый Структура;	
			ПараметрыИзФормы.Вставить("ВыходнаяТаблица", ВыходнаяТаблица);
			ПараметрыИзФормы.Вставить("Подразделение", подр);
			ПараметрыИзФормы.Вставить("Фонд", тд.Фонд);
			ПараметрыИзФормы.Вставить("СальдоСредствКРаспределению",  Объект.СальдоСредствКРаспределениюБезнал);
			ПараметрыИзФормы.Вставить("ИсходнаяСумма", стр.НехваткаСуммы);
			ПараметрыОтбора = Новый Структура("ПараметрыОтбора", ПараметрыИзФормы);
			
			рез = ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ФормаПомощникПоЗаказуУпр",ПараметрыОтбора,ЭтаФорма,,,,Новый ОписаниеОповещения("КомандаПомощникПополненияФондаОбработчик", ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ИА_ФинансоваяДирективаРасшифровкаСоздать()
	отч = Отчеты.ИА_ФинансоваяДирективаРасшифровка.Создать();
	отч.СсылкаНаОбъект = Объект.Ссылка;
	тд = отч.Печать();
	Возврат тд;
КонецФункции

&НаСервере
Функция ИА_ФинансоваяДирективаЛист3Создать()
	отч = Отчеты.ИА_ФинансоваяДирективаЛист3.Создать();
	отч.СсылкаНаОбъект = Объект.Ссылка;
	
	ДеревоЗПЗнач = РеквизитФормыВЗначение("ДеревоЗП");
	ДеревоПолитика2Знач = РеквизитФормыВЗначение("ДеревоПолитика2");
	ДеревоПолитика1Знач = РеквизитФормыВЗначение("ДеревоПолитика1");
	
	РезультатЗапросаОстатковПоФондам = ИА_Защита_ФП.ПолучитьРезультатЗапроса(Объект, ФППоОрганизациям, ДеревоЗПЗнач, ДеревоПолитика2Знач, ДеревоПолитика1Знач,,ВыводитьГруппировкуПоСчетам);
	ТаблицаОстатковПоФондам = РезультатЗапросаОстатковПоФондам.Выгрузить();

	тд = отч.Печать(ДеревоЗПЗнач, ТаблицаОстатковПоФондам);
	
	Возврат тд;
КонецФункции

&НаСервере
Функция ИА_ФинансовоеПланирование1Создать()
	отч = Отчеты.ИА_ФинансовоеПланирование1.Создать();
	отч.СсылкаНаОбъект = Объект.Ссылка;
	тд = отч.Печать();
	Возврат тд;
	
КонецФункции

&НаСервере
Функция ИА_ПланПоДоходуСоздать()
	отч = Отчеты.ИА_ПланПоДоходу.Создать();
	отч.СсылкаНаОбъект = Объект.Ссылка;
	тд = отч.Печать();
	Возврат тд;
	
КонецФункции

&НаКлиенте
Процедура КомандаПечать(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность И Не Объект.Проведен Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаПечатьЗавершение1", ЭтотОбъект), "Перед печатью документ необходимо записать!" + Символы.ПС +"Выполнить?",РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;

	
	КомандаПечатьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать();
	Иначе
		Возврат;		 	
	КонецЕсли;
	
	
	КомандаПечатьФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьФрагмент()
	
	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ФормаВыбораПечатнойФормы",,,,,, Новый ОписаниеОповещения("КомандаПечатьЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Значение = Результат;
	
	Если Значение = "Состояние фондов" Тогда
		Если Не ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность или не Объект.Проведен Тогда
			ПоказатьПредупреждение(,"Необходимо сначала записать и утвердить ФП!");
			Возврат;
		КонецЕсли;
		//тд = ИА_ФинансоваяДирективаРасшифровкаСоздать();
		//тд.Показать();
		ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ФормаОтчетПоФондам", Новый Структура("ЭтоСостояние",истина), ЭтаФорма);
	ИначеЕсли Значение = "Директива ФП" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность или не Объект.Проведен Тогда
			ПоказатьПредупреждение(,"Необходимо сначала записать и утвердить ФП!");
			Возврат;
		КонецЕсли;
		
		Если ФП_по_ТБ Тогда
			ТабДок = СформироватьПФ_ДирективаФП_ТБ(Объект.Ссылка);
		Иначе
			ТабДок = СформироватьПФ_ДирективаФП(Объект.Ссылка);
		КонецЕсли;
		иа_бфкс.ТабДок_Показать(ТабДок, "Печать (Директива ФП)");
		
		
	ИначеЕсли Значение = "ФП 1" Тогда
		Если Не ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность Тогда
			ПоказатьПредупреждение(,"Необходимо сначала записать документ!");
			Возврат;
		КонецЕсли;
		
		тд = ИА_ФинансовоеПланирование1Создать();
		тд.Показать();		
	ИначеЕсли Значение = "Список ЗП" Тогда
		Если ДеревоЗП.ПолучитьЭлементы().Количество() =0 Тогда
			ПоказатьПредупреждение(,"Нет ЗП на ФП!");
			Возврат;
		КонецЕсли;
		
		тд = ПечатьСпискаЗВС();
		тд.Показать();		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПечатьСпискаЗВС()
	тд = Новый ТабличныйДокумент;
	макет = Документы.ИА_ФинансовоеПланирование.ПолучитьМакет("СписокЗВС");
	
	дер = РеквизитФормыВЗначение("ДеревоЗП");
	
	Если ВыводитьГруппировкуПоСчетам Тогда
		Для каждого стрСчет из дер.строки Цикл
			ВывестиОтделенияВСписокЗВС(стрСчет.Строки, макет, тд, ИспПодразделения);
		КонецЦикла;
	Иначе
		ВывестиОтделенияВСписокЗВС(дер.Строки, макет, тд, ИспПодразделения);
	КонецЕсли;
	
	тд.АвтоМасштаб = Истина;
	Возврат тд;
КонецФункции

&НаСервереБезКонтекста
Процедура ВывестиОтделенияВСписокЗВС(СтрокиОтд, макет, тд, ИспПодразделения)
	Для каждого стрОтд Из СтрокиОтд Цикл
		
		Если стрОтд.Строки.Итог("ИсходнаяСумма", истина) = 0 Тогда
			Продолжить;
		КонецЕсли;
			
		Если  ИспПодразделения Тогда
			ОблОтд = макет.ПолучитьОбласть("ШапкаОтделение");
			ОблОтд.Параметры.Отделение = стрОтд.Подразделение;
			тд.Вывести(ОблОтд);
		Иначе
			ОблОтд = макет.ПолучитьОбласть("ШапкаСтатья");
			ОблОтд.Параметры.Статья = стрОтд.фонд;
			тд.Вывести(ОблОтд);
			
			Для каждого стрЗВС из стрОтд.Строки Цикл
				ОблЗВС = макет.ПолучитьОбласть("Строка");
				ЗаполнитьЗначенияСвойств(ОблЗВС.Параметры, стрЗВС);
				
				тд.Вывести(ОблЗВС);
			КонецЦикла;
			
			Продолжить;
		КонецЕсли;

		
		Для каждого стрФонд из стрОтд.Строки Цикл
			
			Если стрФонд.Строки.Итог("ИсходнаяСумма", истина) = 0 Тогда
				Продолжить;
			КонецЕсли;
		
			ОблФонд = макет.ПолучитьОбласть("ШапкаСтатья");
			ОблФонд.Параметры.Статья = стрФонд.Фонд;
			тд.Вывести(ОблФонд);
			Для каждого стрЗВС из стрФонд.Строки Цикл
				ОблЗВС = макет.ПолучитьОбласть("Строка");
				ЗаполнитьЗначенияСвойств(ОблЗВС.Параметры, стрЗВС);
				
				тд.Вывести(ОблЗВС);
			КонецЦикла;
		КонецЦикла;
		
		тд.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ДоходыСуммаНалПриИзменении(Элемент)

КонецПроцедуры

&НаКлиенте
Процедура ДоходыСуммаБезналПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБП_РаспределениеСуммаНалПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБП_РаспределениеСуммаБезналПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБП_РаспределениеСуммаПриИзменении(Элемент)

КонецПроцедуры

&НаКлиенте
Процедура ДоходыБПСуммаНалПриИзменении(Элемент)

КонецПроцедуры

&НаКлиенте
Процедура ДоходыБПСуммаБезналПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБПСуммаПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолитикаСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.ДеревоПолитика2.ТекущиеДанные; 
	
	Отбор = Новый Структура("Раздел, Подразделение, Статья");        
    ЗаполнитьЗначенияСвойств(Отбор, ТекДанные);    
    М = Объект.Политика2.НайтиСтроки(Отбор);
    Для каждого СтрП1 Из М Цикл
        СтрП1.Сумма = ТекДанные.Сумма;
        СтрП1.Вручную = Истина;
    КонецЦикла;  
    
	ЗаполнитьДоходыИПолитикиСервер(ложь, ложь,ложь,истина, ложь, истина);
	Политика_Развернуть(2,Отбор);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуПолитика(раздел, фонд, подразделение, НомерПолитики)
	Если НомерПолитики = 1 Тогда
		дер = ДеревоПолитика1;
	Иначе
		дер = ДеревоПолитика2;
	КонецЕсли;
	
	Для каждого стрРаздел из дер.ПолучитьЭлементы() Цикл
		Если стрРаздел.раздел = раздел Тогда
			Если ИспользоватьРазделы Тогда
				Для каждого стрФонд из стрРаздел.ПолучитьЭлементы() Цикл
					Если стрФонд.Статья = фонд И стрФонд.подразделение = подразделение Тогда
						Возврат стрФонд.ПолучитьИдентификатор();
					КонецЕсли;			
				КонецЦикла;
			Иначе
				Если стрРаздел.Статья = фонд И стрРаздел.подразделение = подразделение Тогда
					Возврат стрРаздел.ПолучитьИдентификатор();
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ДеревоЗПСтатусПриИзменении(Элемент)
	
	тд = Элементы.ДеревоЗП.ТекущиеДанные;
	Если СостояниеЗаказаОдобренКлиент.Найти(тд.Статус) <> Неопределено тогда
		тд.УтвержденнаяСумма = тд.Сумма;
	Иначе
		тд.УтвержденнаяСумма = 0;
	КонецЕсли;
	
	тд.ОстатокПоЗаказу = тд.Сумма - тд.УтвержденнаяСумма;
	тд.СтатусНомер = НомерСтатуса(тд.Статус);    
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДеревоЗаказов()
	Объект.ЗаказыНаПриобретение.Очистить();
	ЗаполнитьСтрокиЗаказыНаПриобретение(ДеревоЗП.ПолучитьЭлементы());
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнениеТаблЧастей()
	
	// спец доход
	Для каждого стр из Объект.ДоходыБП Цикл
		Если не ЗначениеЗаполнено(стр.Период) Тогда
			стр.Период = Объект.Дата;
		КонецЕсли;
	КонецЦикла;
	
	//Займы
	Для каждого стр из Объект.РаспределениеПоФондам Цикл
		Если ТипЗнч(стр.ПричинаЗайма) = тип("Строка") Тогда
			стр.ПричинаЗайма = СокрЛП(стр.ПричинаЗайма);
		КонецЕсли;
	КонецЦикла;
	
	//
	
	Объект.НачисленияВФонды.Очистить();
	Объект.ПланПродаж.Очистить();
	Объект.ЗНО.Очистить();
	
	СохранитьДеревоЗаказов();
	
	// статусы зно	
	Для каждого стр из ТаблицаЗНО Цикл
		Новстр = Объект.ЗНО.Добавить();
		ЗаполнитьЗначенияСвойств(новстр, стр);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтрокиЗаказыНаПриобретение(СтрокиЗП)
	
	Для каждого СтрокаЗП из СтрокиЗП ЦИкл   
		
		Если ЗначениеЗаполнено(СтрокаЗП.Заказ) Тогда
			
			СтрокаЗаказыНаПриобретение = Объект.ЗаказыНаПриобретение.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗаказыНаПриобретение, СтрокаЗП);
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаЗП.Фонд) Тогда 	
			
			Если СтрокаЗП.НачислениеВФонд > 0 Тогда
				СтрокаНачисленияВФонды = Объект.НачисленияВФонды.Добавить();
				СтрокаНачисленияВФонды.Фонд          = СтрокаЗП.Фонд;
				СтрокаНачисленияВФонды.Подразделение = СтрокаЗП.Подразделение;
				СтрокаНачисленияВФонды.СуммаБезНал   = СтрокаЗП.НачислениеВФонд; 
			КонецЕсли;	
			ЗаполнитьСтрокиЗаказыНаПриобретение(СтрокаЗП.ПолучитьЭлементы());
		Иначе
			
			ЗаполнитьСтрокиЗаказыНаПриобретение(СтрокаЗП.ПолучитьЭлементы())	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция естьОшибкиПревышенияПоЗаказам(СтрокиДер)
	ЕстьОш = ложь;
	Для каждого стр из СтрокиДер цикл
		Если ЗначениеЗаполнено(стр.заказ) и стр.ОстатокПоЗаказу < 0 тогда
			Сообщить("Обнаружено превышение доступной суммы для одобрения по заказу "+стр.Номер + " """ + стр.ПредметЗаказа + """, фонд " + стр.Фонд);
			ЕстьОш = истина;
		КонецЕсли;
		
		Если естьОшибкиПревышенияПоЗаказам(стр.ПолучитьЭлементы()) Тогда
			ЕстьОш = истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьОш;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	
	Если ПараметрыЗаписи.Режимзаписи = РежимЗаписиДокумента.Проведение и объект.Дата > КонецДня(ТекущаяДата()) ТОгда		
		ПоказатьПредупреждение(,"ФП можно сохранять как черновик с датой будущего периода. Но утверждать ФП можно не позднее текущей даты (сегодняшней даты). Измените дату ФП и повторите операцию, если вы действительно решили утвердить ФП.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// проверка на превышение по заказам
	Если ПараметрыЗаписи.Режимзаписи = РежимЗаписиДокумента.Проведение ТОгда		
		Если естьОшибкиПревышенияПоЗаказам(ДеревоЗП.ПолучитьЭлементы()) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнениеТаблЧастей();
	
	// проверка займов
	Если ПараметрыЗаписи.Режимзаписи = РежимЗаписиДокумента.Проведение ТОгда
		Для каждого стр из Объект.РаспределениеПоФондам Цикл
			Если стр.Фонд.Пустая() или стр.СФонда.Пустая() или ((стр.Подразделение.Пустая() или стр.СПодразделения.Пустая()) и ИспПодразделения) Тогда
				ПоказатьПредупреждение(,"Заполните правильно перемещение между фондами! Должны быть заполнены фонды" + ?(ИспПодразделения, " и подразделения",""));
				Отказ = Истина;
				Возврат;
			КонецЕсли;			
		КонецЦикла;
		
		Если ЕстьМинус тогда
			ПоказатьПредупреждение(,"Невозможно утвердить ФП с минусовыми фондами!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения или ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ИА_ФПСервер.естьБудущиеДоки(Объект.организация, Объект.дата) Тогда
			отказ = Истина;
			парамФ_1 = Новый структура("Период, Организация, Действие", объект.Дата, объект.Организация);
			парамФ_1.Действие = ?(ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения, "отмены", "утверждения");
			ОткрытьФорму("ОбщаяФорма.КСУ_ПредупреждениеПриОтменеПроведения", парамФ_1, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
	// проверка коммента в откладывании
	Если ПараметрыЗаписи.Режимзаписи = РежимЗаписиДокумента.Проведение ТОгда
		Для каждого стр из Объект.ОтложенныйДоход Цикл
			Если стр.ТипОперации = ПредопределенноеЗначение("Перечисление.КСУ_ОперацииСОтложеннымДоходом.Отложить") и стр.Комментарий = "" Тогда
				ПоказатьПредупреждение(,"Укажите комментарий в таблице отложенного дохода для операции откладывания с дохода "+стр.ВидДохода);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

    
КонецПроцедуры
	
&НаКлиенте
Процедура ДеревоЗППриИзменении(Элемент)	
	
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоЗПВыбрать" Тогда
		возврат;
	КонецЕсли;
	
	тд = Элементы.ДеревоЗП.ТекущиеДанные;	
	Если Элементы.ДеревоЗПАвтоначисление.Пометка И Найти(Элемент.ТекущийЭлемент.Имя,"Начисление")=0 и ЗначениеЗаполнено(тд.Заказ) и тд.Счет = ПредопределенноеЗначение("Справочник.ИА_Счета.ГлавныйСчет") Тогда
		тд.ПолучитьРодителя().НачислениеВФонд = 0;
		ПересчитатьДерево();
		ПересчитатьСальдоСредствКРаспределению();
		
		ДоначислитьАвтоматически();	
	КонецЕсли;
	
	ДеревоЗВСИзменение();
	Модифицированность = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗВСИзменение()	
		
	Модифицированность = Истина;
	ПересчитатьДерево();
	ПересчитатьСальдоСредствКРаспределению();
	ОбновитьОтчетПоСотояниюФондов();
	
	ПредВыдОбл = Неопределено;
	ДеревоЗППриАктивизацииСтроки(Неопределено);	
КонецПроцедуры


&НаСервере
Процедура ДоначислитьАвтоматически()
	
	тд = ДеревоЗП.НайтиПоИдентификатору(Элементы.ДеревоЗП.ТекущаяСтрока);	
	ЕстьОшибка = ложь;
	НехваткаСуммы = 0;
	
	ОбновитьОтчетПоСотояниюФондов(ложь);
	СтрПоиска = Новый Структура("Счет,Фонд,Подразделение", тд.Счет, тд.Фонд, тд.Подразделение);
	Если не ВыводитьГруппировкуПоСчетам Тогда
		СтрПоиска.Удалить("Счет");
	КонецЕсли;

	НСтроки = ВыходнаяТаблица.НайтиСтроки(СтрПоиска); 
	Если НСтроки.Количество()>0 Тогда
		СтрокаСостояния = НСтроки[0];
		Если СтрокаСостояния.ПослеФП_Остаток < 0 Тогда
			ЕстьОшибка = Истина;
			НехваткаСуммы = -СтрокаСостояния.ПослеФП_Остаток; 
		КонецЕсли;
	КонецЕсли;
	
	СтрРод = тд.ПолучитьРодителя();
	Если ЕстьОшибка Тогда
		Добавим = мин(НехваткаСуммы,Объект.СальдоСредствКРаспределениюБезнал);

		СтрРод.НачислениеВФонд =СтрРод.НачислениеВФонд + Добавим;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьСтрокуВостатках() Экспорт
	тдЗаказы = Элементы.ДеревоЗП.ТекущиеДанные;
	
	ТекСтрокиОст = ДеревоСостояниеФондов.ПолучитьЭлементы();
	Если ВыводитьГруппировкуПоСчетам Тогда
		СтрокаНайдена = ложь;
		
		Для каждого стр из ТекСтрокиОст Цикл 
			если стр.СчетПодразделениеФонд = тдЗаказы.Счет Тогда
				ТекСтрокиОст = стр.ПолучитьЭлементы();	
				СтрокаНайдена = истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;      
		
		Если не СтрокаНайдена Тогда
			возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИспПодразделения Тогда
		СтрокаНайдена = ложь;
		
		Для каждого стр из ТекСтрокиОст Цикл 
			если стр.СчетПодразделениеФонд = тдЗаказы.Подразделение Тогда
				ТекСтрокиОст = стр.ПолучитьЭлементы();	
				СтрокаНайдена = истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;      
		
		Если не СтрокаНайдена Тогда
			возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого стр из ТекСтрокиОст Цикл 
		если стр.СчетПодразделениеФонд = тдЗаказы.Фонд Тогда
			НеПозиционировать = истина;
			Элементы.ДеревоСостояниеФондов.ТекущаяСтрока = стр.ПолучитьИдентификатор();
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
	
&НаКлиенте
Процедура ДеревоЗППриАктивизацииСтроки(Элемент)
	
	тд = Элементы.ДеревоЗП.ТекущиеДанные;
	
	Если тд <> Неопределено Тогда
		Элементы.ДеревоЗПКнопкаПомощникПополненияФонда.Доступность = ЗначениеЗаполнено(тд.Заказ);
		
		ПодключитьОбработчикОжидания("ОбновитьОписаниеЗаказа", 0.3, истина);
		
		ВыделитьСтрокуВостатках();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьОписаниеЗаказа() Экспорт
	
	тд = Новый Структура("Номер, Ситуация, Данные, Решение, ПредметЗаказа, Дата, срокОплаты, Фонд, Подразделение, Вложения, сотрудник,организацияДочерняя,Статья,Заказ",
		"","","","","","","","","","","","","","");
	
	текД = Элементы.ДеревоЗП.ТекущиеДанные;
	Если  текД <> Неопределено и ЗначениеЗаполнено(текД.Заказ) Тогда
		ЗаполнитьЗначенияСвойств(тд, текД);
	КонецЕсли;
	//
	//ШрифтЧерныйЖирный = Новый Шрифт(,,истина);
	//ЦветСиний = Новый цвет(0,0,255);
	//
	//МассЛевОп = новый массив;
	//МассЛевОп.Добавить( Новый ФорматированнаяСтрока( Новый ФорматированнаяСтрока("Заказ №"+УбратьНули(тд.Номер), ШрифтЧерныйЖирный), ", " ,  Новый ФорматированнаяСтрока(ВРЕГ(тд.ПредметЗаказа),,ЦветСиний), Символы.ПС, Символы.ПС  ) );
	//МассЛевОп.Добавить( Новый ФорматированнаяСтрока( Новый ФорматированнаяСтрока("Ситуация: ", ШрифтЧерныйЖирный), тд.Ситуация, Символы.ПС ) );
	//МассЛевОп.Добавить( Новый ФорматированнаяСтрока( Новый ФорматированнаяСтрока("Данные: ", ШрифтЧерныйЖирный), тд.Данные, Символы.ПС ) );
	//МассЛевОп.Добавить( Новый ФорматированнаяСтрока( Новый ФорматированнаяСтрока("Решение: ", ШрифтЧерныйЖирный), тд.Решение ) );
	//
	//Элементы.ОписаниеЗаказаЛев.Заголовок = новый ФорматированнаяСтрока(МассЛевОп);

	//Элементы.ДекорацияСоздан.Заголовок = формат(тд.Дата, "ДФ=dd.MM.yyyy");
	//Элементы.ДекорацияСрок.Заголовок = формат(тд.СрокОплаты, "ДФ=dd.MM.yyyy");
	//Если ЗначениеЗаполнено(тд.ОрганизацияДочерняя) и тд.ОрганизацияДочерняя <> Объект.Организация ТОгда
	//	Элементы.ДекорацияОрг.Заголовок = новый ФорматированнаяСтрока( Новый ФорматированнаяСтрока(строка(тд.ОрганизацияДочерняя),,ЦветСиний), " / ", строка(Объект.Организация) );
	//ИначеЕсли сокрлп(тд.Номер) = "" Тогда
	//	Элементы.ДекорацияОрг.Заголовок = "";
	//Иначе
	//	Элементы.ДекорацияОрг.Заголовок = строка(Объект.Организация);
	//КонецЕсли;
	//Элементы.ДекорацияПодр.Заголовок = тд.Подразделение;
	//Элементы.ДекорацияФонд.Заголовок = тд.Фонд;
	//Элементы.ДекорацияСтатья.Заголовок = тд.Статья;
	//Элементы.ДекорацияВлож.Заголовок = тд.Вложения;
	//Элементы.ДекорацияАвтор.Заголовок = тд.Сотрудник;
	
	табДокСтрукт = ПолучитьТабДокОписаниеЗаказа(тд, Объект.Организация);
	ОписаниеЗаказаЛев = табДокСтрукт.Левый;
	ОписаниеЗаказаПрав = табДокСтрукт.Правый;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТабДокОписаниеЗаказа(тд, ОбъектОрганизация)
	ТабДокЛев = новый ТабличныйДокумент;
	ТабДокПрав = новый ТабличныйДокумент;
	макет = Документы.ИА_ФинансовоеПланирование.ПолучитьМакет("ОписаниеЗаказа");
	
	обл = макет.ПолучитьОбласть("ШапкаЛев");
	ЗаполнитьЗначенияСвойств(обл.Параметры, тд);
	обл.Параметры.Номер = УбратьНули(тд.Номер);
	обл.Параметры.ПредметЗаказа = ВРЕГ(тд.ПредметЗаказа);
	ТабДокЛев.Вывести(обл);
	
	обл = макет.ПолучитьОбласть("ШапкаПрав");
	ЗаполнитьЗначенияСвойств(обл.Параметры, тд);
	Если ЗначениеЗаполнено(тд.ОрганизацияДочерняя) и тд.ОрганизацияДочерняя <> ОбъектОрганизация ТОгда
		обл.Параметры.Организация = строка(тд.ОрганизацияДочерняя) + " / " + строка(ОбъектОрганизация);
	ИначеЕсли сокрлп(тд.Номер) = "" Тогда
		обл.Параметры.Организация = "";
	Иначе
		обл.Параметры.Организация = строка(ОбъектОрганизация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тд.Заказ) ТОгда
		обл.Параметры.Контрагент = тд.Заказ.Контрагент;
	КонецЕсли;
	
	ТабДокПрав.Вывести(обл);
	
	возврат Новый Структура("Левый, Правый", ТабДокЛев, ТабДокПрав);
КонецФункции

&НаСервереБезКонтекста
Функция УбратьНули(номер)
	Если не ЗначениеЗаполнено(номер) Тогда
		возврат "";
	КонецЕсли;
	
	рез = номер; 
	Пока Лев(рез, 1) = "0" Цикл 
	    рез = Прав(рез, СтрДлина(рез) - 1);
	КонецЦикла;
	Возврат рез;
КонецФункции
	
&НаКлиенте 
Процедура НайтиСтрокуДерева(КоллекцияЭлементовДерева, ТекущиеДанные, ИдентификаторСтроки, ПрекратитьПоиск) 
	
	Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл 
		Если ПрекратитьПоиск Тогда 
			Возврат; 
		КонецЕсли; 
		
		Если СтрокаДерева = ТекущиеДанные Тогда 
			ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор(); 
			ПрекратитьПоиск = Истина; 
			Возврат; 
		КонецЕсли; 
		
		КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы(); 
		
		Если КоллекцияЭлементов.Количество() > 0 Тогда 
			НайтиСтрокуДерева(КоллекцияЭлементов, ТекущиеДанные, ИдентификаторСтроки, ПрекратитьПоиск); 
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ДеревоЗППередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элементы.ДеревоЗП.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗППослеУдаления(Элемент)
	ДеревоЗВСИзменение();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗППриАктивизацииЯчейки(Элемент)
	Если Элемент.ТекущийЭлемент = Неопределено или Элемент.ТекущийЭлемент.Имя = "ДеревоЗПВыбрать" Тогда
		возврат;
	КонецЕсли;
	
	тд = Элементы.ДеревоЗП.ТекущиеДанные;
	Если тд  <>  Неопределено Тогда
				
		Элемент.ТекущийЭлемент.ТолькоПросмотр = истина;
		Если  ЗначениеЗаполнено(тд.Заказ) Тогда // строка с заказом
			Если (Элемент.ТекущийЭлемент.Имя = "ДеревоЗПСтатус") или
				(Элемент.ТекущийЭлемент.Имя = "ДеревоЗППричинаОтказа")  или	
				(Элемент.ТекущийЭлемент.Имя = "ДеревоЗПКомментарийСФП")  или	
				 (Элемент.ТекущийЭлемент.Имя = "ДеревоЗПУтвержденнаяСумма")  Тогда			
				Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
			КонецЕсли;
		ИначеЕсли  Не ЗначениеЗаполнено(тд.Заказ) и ЗначениеЗаполнено(тд.Фонд) Тогда  // строка с фондом
			Если Элемент.ТекущийЭлемент.Имя = "ДеревоЗПНачислениеВФонд" Тогда
				Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьОтображениеИтого();
	ОбновитьВидимостьКнопкиПроведения();
	ОбновитьДоступностьПоУтверждению();
	
	Если Элементы.ГруппаГлавная.ТекущаяСтраница.Имя = "ГруппаСтатистики" и ЕстьСтатистики Тогда		
		ОбновитьФинПоказатели(ложь);
		ОбновитьСтатистикиФП_Статистики();
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПолучитьКоэффициентНедели()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ИА_Календарь.Рабочий
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КолРабочих,
	|	КОЛИЧЕСТВО(*) КАК КолВсего
	|ИЗ
	|	РегистрСведений.ИА_Календарь КАК ИА_Календарь
	|ГДЕ
	|	ИА_Календарь.Период МЕЖДУ &ДатаНачала И &ДатаКонца";
	ДатаДок = ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаДок));
	Запрос.УстановитьПараметр("ДатаКонца", КонецМесяца(ДатаДок));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() и ЗначениеЗаполнено(Выборка.КолРабочих) Тогда
		Возврат Выборка.КолРабочих / 5;
	Иначе
		колДней = (КонецМесяца(ДатаДок) + 1 - НачалоМесяца(ДатаДок)) / (60*60*24);
		возврат колДней / 7;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ФП1СуммаБезналМесяцПриИзменении(Элемент)
	тд = Элементы.ФП1.ТекущиеДанные;
	тд.СуммаБезнал = тд.СуммаБезналМесяц / ПолучитьКоэффициентНедели();
КонецПроцедуры

&НаКлиенте
Процедура ФП1СуммаНалМесяцПриИзменении(Элемент)
	тд = Элементы.ФП1.ТекущиеДанные;
	тд.СуммаНал = тд.СуммаНалМесяц / ПолучитьКоэффициентНедели();
КонецПроцедуры

&НаКлиенте
Процедура ФП1СуммаБезналМесяц1ПриИзменении(Элемент)
	тд = Элементы.ФП1.ТекущиеДанные;
	тд.СуммаБезнал = тд.СуммаБезналМесяц / ПолучитьКоэффициентНедели();
КонецПроцедуры

&НаКлиенте
Процедура ФП1СуммаБезналПриИзменении(Элемент)
	тд = Элементы.ФП1.ТекущиеДанные;
	тд.СуммаБезналМесяц = тд.СуммаБезнал * ПолучитьКоэффициентНедели();
КонецПроцедуры

&НаКлиенте
Процедура ФП1СуммаНалПриИзменении(Элемент)
	тд = Элементы.ФП1.ТекущиеДанные;
	тд.СуммаНалМесяц = тд.СуммаНал * ПолучитьКоэффициентНедели();
КонецПроцедуры

&НаКлиенте
Процедура ФП1СуммаПриИзменении(Элемент)
	тд = Элементы.ФП1.ТекущиеДанные;
	тд.СуммаБезналМесяц = тд.СуммаБезнал * ПолучитьКоэффициентНедели();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОтклонениеФП1()
	Для каждого стр из Объект.ФП1 Цикл
		стр.СуммаОтклонение = стр.СуммаБезнал + стр.СуммаНал - стр.СуммаСреднее;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДерево()
	ДеревоЗПИсходнаяСумма = 0;
	ДеревоЗПНачислениеВФонд = 0;
	ДеревоЗПСумма = 0;
	ДеревоЗПУтвержденнаяСумма = 0;
	ДеревоЗПРанееВыделено = 0;
	ДеревоЗПОстатокПоЗаказу = 0;
	Для каждого стр Из  ДеревоЗП.ПолучитьЭлементы() Цикл
		ПересчитатьДеревоИтоги(стр);
		
		// для подвала:
		ДеревоЗПИсходнаяСумма = ДеревоЗПИсходнаяСумма + стр.ИсходнаяСумма;
		ДеревоЗПНачислениеВФонд = ДеревоЗПНачислениеВФонд + стр.НачислениеВФонд;
		ДеревоЗПСумма = ДеревоЗПСумма + стр.Сумма;
		ДеревоЗПУтвержденнаяСумма = ДеревоЗПУтвержденнаяСумма + стр.УтвержденнаяСумма;
		ДеревоЗПРанееВыделено = ДеревоЗПРанееВыделено + стр.РанееВыделено;
		ДеревоЗПОстатокПоЗаказу = ДеревоЗПОстатокПоЗаказу + стр.ОстатокПоЗаказу;
	КонецЦикла;
КонецПроцедуры
	
&НаКлиенте
Процедура ПересчитатьДеревоИтоги(СтрокаДерева)
	
	Если (ЗначениеЗаполнено(СтрокаДерева.Счет) или ЗначениеЗаполнено(СтрокаДерева.Подразделение)) и не ЗначениеЗаполнено(СтрокаДерева.Фонд) Тогда // группировки выше фонда
		СтрКлючи = "ИсходнаяСумма,Сумма,НачислениеВФонд,УтвержденнаяСумма,РанееВыделено,ОстатокПоЗаказу";
		ТекИтоги = новый Структура(СтрКлючи,0,0,0,0,0,0);
	Иначе
		СтрКлючи = "ИсходнаяСумма,Сумма,УтвержденнаяСумма,РанееВыделено,ОстатокПоЗаказу";
		ТекИтоги = новый Структура(СтрКлючи,0,0,0,0,0);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДерева.Заказ) Тогда
		возврат;
	Иначе
		Для каждого стр Из  СтрокаДерева.ПолучитьЭлементы() Цикл		
			ПересчитатьДеревоИтоги(стр);
			Для каждого кл из ТекИтоги Цикл
				ТекИтоги[кл.Ключ] = ТекИтоги[кл.Ключ]+стр[кл.Ключ];
			КонецЦикла;		
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(СтрокаДерева,ТекИтоги);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДоходыБППослеУдаления(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБП_РаспределениеПослеУдаления(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБПВидДоходаПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБП_РаспределениеВидДоходаПриИзменении(Элемент)
КонецПроцедуры



&НаСервере
Функция ПолучитьТаблицуЗаймов()
	тзЗаймов = ИА_ФПСервер.ПолучитьТЗЗаймов(Объект.Дата, Объект.Организация, не ФППоОрганизациям, Объект.РаспределениеПоФондам.Выгрузить(), ложь); 
	рез = ИА_БФС.ТЗФ_Создать(тзЗаймов);
	Возврат рез;
КонецФункции

&НаКлиенте
Процедура ПогаситьЗайм(Команда)
	
	тзЗаймов = ПолучитьТаблицуЗаймов();
	
	Если тзЗаймов.Количество() = 0 Тогда
		возврат;
	КонецЕсли;
	
	Парам = Новый Структура("тзЗаймов",тзЗаймов);
	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ФормаПодбораЗайма",Парам,,,,, Новый ОписаниеОповещения("ПогаситьЗаймЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПогаситьЗаймЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	рез = Результат;
	
	Если ТипЗнч(рез) = Тип("Массив") Тогда
		Для каждого стр из рез Цикл
			Новстр = ВозвратыЗаймов.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр, стр);
			Новстр.СуммаЗайма = стр.Сумма;
			Новстр.НаФонд = стр.СФонда;
			Новстр.НаПодразделение = стр.СПодразделения;
			
			Новстр.СФонда = стр.Фонд;
			Новстр.СПодразделения =стр.Подразделение;
		КонецЦикла;		
		ИзменениеЗаймовВозвратов();
		Модифицированность = истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьДоходы(Команда)
    Модифицированность = Истина;    
    ЗаполнитьДоходыИПолитикиСервер(Истина,Истина,Истина, Истина, Истина, ложь);
    Политика_Развернуть(1);
	Политика_Развернуть(2);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеСредствСФондовПриИзменении(Элемент)
	ПересчитатьПриИзменДоходов();
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеСредствСФондовПослеУдаления(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ГруппаГлавнаяПриСменеСтраницы(Элемент, ТекущаяСтраница)
		
	Если ТекущаяСтраница.Имя = "ГруппаСтатистики" Тогда
		ОбновитьФинПоказатели(истина);
		Если ЕстьСтатистики Тогда
			ПодключитьОбработчикОжидания("ОбновитьСтатистикиФП_Статистики",0.5, истина);
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница.Имя = "ГруппаПланирование" и ЕстьСтатистики  Тогда 
		ПодключитьОбработчикОжидания("ОбновитьСтатистикиФП1",0.5, истина);
	ИначеЕсли ТекущаяСтраница.Имя = "ГруппаОдобрениеЗаказов" Тогда 
		ТекущийЭлемент = Элементы.ДеревоЗП;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	объект.РучнойПериодДоходов = ложь;
	
	
	ОбновитьДокументКлиент();
	ЗаполнитьТаблицуЗП(ложь);
	ОбновитьНадписьКнопкиОтДохода();
	
	ПодключитьОбработчикОжидания("ДатаПриИзменении_После", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении_После() Экспорт
	
	ПоказатьПредупреждение(, "Были изменены дата или время документа. Данные будут пересчитаны.");
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		ОбновитьДокументКлиент();
		ЗаполнитьТаблицуЗП(ложь);
	КонецЕсли;
	ОбновитьНадписьКнопкиОтДохода();

КонецПроцедуры

&НаКлиенте
Процедура ДоходыБППриИзменении(Элемент)
	ПересчитатьПриИзменДоходов();
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБП_РаспределениеПриИзменении(Элемент) 
	ПересчитатьПриИзменДоходов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗНО(Команда)
	Если ТаблицаЗНО.Количество()>0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьЗНОЗавершение", ЭтотОбъект), "Таблица будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбновитьЗНО_Сервер();
		Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗНОЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да ТОгда
		ОбновитьЗНО_Сервер();
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗНО_Сервер()
	ТаблицаЗНО.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ЗаявкаНаОбязательства.Ссылка КАК Заказ,
	               |	ИА_ЗаявкаНаОбязательства.Подразделение,
	               |	ИА_ЗаявкаНаОбязательства.Сумма,
	               |	ИА_ЗаявкаНаОбязательства.ПредметЗаказа,
	               |	ИА_ЗаявкаНаОбязательства.Фонд,
	               |	ИА_ЗаявкаНаОбязательства.ДатаОплаты,
	               |	ИА_ЗаявкаНаОбязательства.Ситуация,
	               |	ИА_ЗаявкаНаОбязательства.Данные,
	               |	ИА_ЗаявкаНаОбязательства.Решение,
	               |	ИА_СтатусыЗНОСрезПоследних.Статус
	               |ИЗ
	               |	Документ.ИА_ЗаявкаНаОбязательства КАК ИА_ЗаявкаНаОбязательства
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних(&Дата, ) КАК ИА_СтатусыЗНОСрезПоследних
	               |		ПО ИА_ЗаявкаНаОбязательства.Ссылка = ИА_СтатусыЗНОСрезПоследних.ЗВС
	               |ГДЕ
	               |	ИА_ЗаявкаНаОбязательства.Проведен = ИСТИНА
	               |	И ИА_ЗаявкаНаОбязательства.Дата <= &Дата
	               |	И ИА_СтатусыЗНОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП)
	               |	И ИА_ЗаявкаНаОбязательства.Организация = &Организация";
	
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата-1);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Новстр = ТаблицаЗНО.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, Выборка);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ФП1ПриИзменении(Элемент)
	ПересчитатьОтклонениеФП1();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСтатистики(Команда)
	ОбновитьСтатистикиФП1();
КонецПроцедуры

////////////////////////////
&НаКлиенте
Функция ПолучитьСтруктуруДанныхТекДок()
	Рез = Новый Структура;
	Рез.Вставить("Организация", Объект.Организация);
	Рез.Вставить("ДокФП_Дата", Объект.Дата);
	Рез.Вставить("ДокФП_Ссылка", Объект.Ссылка);
	Рез.Вставить("ДокФП_Доходы", Объект.Доходы.Итог("СуммаНал")+Объект.Доходы.Итог("СуммаБезНал"));
	Рез.Вставить("ДокФП_ФП1", Объект.ФП1.Итог("СуммаНал")+Объект.ФП1.Итог("СуммаБезНал"));
	Рез.Вставить("ДокФП_ГС_Оборот", ГС_Оборот);
	возврат Рез;
КонецФункции


&НаКлиенте
Процедура ОбновитьСтатистикиФП1() Экспорт
	Если формаСтатистик = Неопределено ТОгда 
		Возврат;
	КонецЕсли;
	
	sw = 1000;
	ОпределитьРазрешениеЭкрана();
	
	Если sw = 0 Тогда
		ДанныеХТМЛ = ПолучитьПустойХТМЛДокумент();
		Возврат;
	КонецЕсли;
	
	ДанныеХТМЛ_текст = ПолучитьТекстГрафиков_ФП1();
	РезСтраницаИмя = ИА_Статистики_Клиент.ПолучитьФайлСтраницы(ДанныеХТМЛ_текст,"FP1");		
	
	ДанныеХТМЛ = РезСтраницаИмя;
	НадоОбновить = ДанныеХТМЛ<>"";
	//Если НадоОбновить Тогда
	//	Элементы.ПолеСтатистика.Документ.parentWindow.location.reload();
	//КонецЕсли;
	
	Если НадоОбновить Тогда
			
			Попытка
				Элементы.ПолеСтатистика.Документ.location.reload();
			Исключение
				Попытка
					Элементы.ПолеСтатистика.Документ.parentWindow.location.reload();
				Исключение
					Элементы.ПолеСтатистика.Документ.window.location.reload();
				КонецПопытки;
			КонецПопытки;
			
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстГрафиков_ФП1()
	ФормаСтатистик.ТолькоЗавершПериоды = Ложь;
	ШиринаЭкрана = 410;
	
	ФормаСтатистик.Объект.Настройка = ПредопределенноеЗначение("Справочник.ИА_НастройкиРабочегоСтолаСтатистик.ФП1");     
	ФормаСтатистик.ДатаКонцаПредопределенная = Объект.Дата - 60*60*24;
	ФормаСтатистик.ЗагрузитьНастройку();
	
	ФормаСтатистик.sw = sw;
	
	// Подготовим данные
	ТекДанные = ПолучитьСтруктуруДанныхТекДок();
	//
	
	ТекстРез = ФормаСтатистик.СформироватьКартинку(истина, ложь, ложь, ложь, истина, ТекДанные);
	
	Возврат ТекстРез;
КонецФункции

/////////////////////////////////////

&НаКлиенте
Процедура ОбновитьСтатистикиФП_Статистики() Экспорт
	
	Если ФормаСтатистик = Неопределено ТОгда 
		Возврат;
	КонецЕсли;
	
	Если swВнешняя = 0 Тогда
		sw = 1000;
		ОпределитьРазрешениеЭкрана();
	Иначе
		sw = swВнешняя;
		swВнешняя = 0;
	КонецЕсли;
	                             	
	ДанныеХТМЛ_текст = ПолучитьТекстГрафиков_Статистики();
	РезСтраницаИмя = ИА_Статистики_Клиент.ПолучитьФайлСтраницы(ДанныеХТМЛ_текст,"FP_STAT");		
	
	НадоОбновить = ДанныеХТМЛ_Статистики<>"";
	
	ДанныеХТМЛ_Статистики = РезСтраницаИмя;
	//Если НадоОбновить Тогда
	//	Элементы.ПолеТабДокСтатистики.Документ.parentWindow.location.reload();
	//КонецЕсли;
	
	Если НадоОбновить Тогда
			
			Попытка
				Элементы.ПолеТабДокСтатистики.Документ.location.reload();
			Исключение
				Попытка
					Элементы.ПолеТабДокСтатистики.Документ.parentWindow.location.reload();
				Исключение
					Элементы.ПолеТабДокСтатистики.Документ.window.location.reload();
				КонецПопытки;
			КонецПопытки;
			
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПустойХТМЛДокумент()
	Возврат "<html><head></head><body></body></html>";	
КонецФункции

&НаКлиенте
Функция ПолучитьТекстГрафиков_Статистики()
	
	
	ФормаСтатистик.ТолькоЗавершПериоды = Ложь;
	ФормаСтатистик.Объект.Настройка = ПредопределенноеЗначение("Справочник.ИА_НастройкиРабочегоСтолаСтатистик.ФП_Статистики"); 
	ФормаСтатистик.ДатаКонцаПредопределенная = Объект.Дата - 60*60*24;
	ФормаСтатистик.ЗагрузитьНастройку();
	ФормаСтатистик.sw = sw;
	// Подготовим данные
	ТекДанные = ПолучитьСтруктуруДанныхТекДок();
	//
	ТекстРез = ФормаСтатистик.СформироватьКартинку(истина, ложь, ложь, ложь, истина,ТекДанные);
	
	Возврат ТекстРез;
КонецФункции

//////////////////////////////

&НаКлиенте
Процедура ОбновитьСтатистикиФП(Команда)
	ОбновитьСтатистикиФП_Статистики();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИзменениеРазмераОкна()
	Если Элементы.ГруппаГлавная.ТекущаяСтраница = Элементы.ГруппаСтатистики и ЕстьСтатистики Тогда
		
		предРазмер = sw;
		ОпределитьРазрешениеЭкрана();
		
		РазницаМеждуСтарымИНовымРазмером = предРазмер - sw;
		Если Абс(РазницаМеждуСтарымИНовымРазмером) < 20 Тогда
			Возврат;
		КонецЕсли;
		
		ОбновитьСтатистикиФП_Статистики();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьРазрешениеЭкрана()	
	
	Если Элементы.ГруппаГлавная.ТекущаяСтраница = Элементы.ГруппаПланирование Тогда
		sw = Элементы.ПолеСтатистика.Документ.body.clientWidth;
	ИначеЕсли Элементы.ГруппаГлавная.ТекущаяСтраница = Элементы.ГруппаСтатистики Тогда
		попытка 
			sw = Элементы.ПолеТабДокСтатистики.Документ.body.clientWidth;
		Исключение
		КонецПопытки;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолитикаСуммаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    ТекСтрока = Элемент.Родитель.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        КлючСтроки =  ИА_БФКС.Струк_Новый("Раздел, Подразделение, Статья", ТекСтрока);
		//
        Данные = СформироватьОтчетРасшифровкиПолитика(КлючСтроки,2);
        
        Если Данные.Сформирован Тогда
        	ИА_БФКС.ТабДок_Показать(Данные.ТабДок, Данные.Заголовок);
        Иначе
        	ПоказатьПредупреждение(,"Нет данных расшифровки по политике для: " + ИА_БФКС.Струк_Представление(КлючСтроки));
        КонецЕсли; 
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьОтчетПоФормуле(формула, расчет, итогРасчета)
	Табдок = Новый ТабличныйДокумент;
	Табдок.ТолькоПросмотр = истина;
	
	Макет = Документы.ИА_ФинансовоеПланирование.ПолучитьМакет("РасшифровкаФормулы");
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапка.Параметры.Формула = формула;
	ОблШапка.Параметры.расчет = расчет;
	ОблШапка.Параметры.ИтогРасчета = итогРасчета;
	Табдок.Вывести(ОблШапка);
	
	Для каждого стр из Объект.ЗапросыДанных Цикл
		ОблСтрока = Макет.ПолучитьОбласть("Запрос");
		ОблСтрока.Параметры.Запрос = стр.Запрос;
		ОблСтрока.Параметры.ЗапросТаб = ИА_БФС.ТЗ_ВывестиВТабДок(ЗначениеИзСтрокиВнутр(стр.Расшифровка));
		Табдок.Вывести(ОблСтрока);
	КонецЦикла;
	
	Возврат Табдок;
КонецФункции

&НаКлиенте
Процедура ТаблицаЗНОПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьЗВС" Тогда
		СсылкаЗВС = Параметр;
		
		ЗаполнитьТаблицуЗП();
		ПересчитатьСальдоСредствКРаспределению();
		ОбновитьОтчетПоСотояниюФондов();
		
		СпозиционироватсяНаСтрокеДереваЗП(СсылкаЗВС);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпозиционироватсяНаСтрокеДереваЗП(СсылкаЗВС)
	
	Если ЗначениеЗаполнено(СсылкаЗВС) Тогда
		
		ТекущаяСтрока =Неопределено;
		НайденЭлемент=ложь;
		
		ТекущаяСтрока = ПолучитьСтрокуЗП(ДеревоЗП, СсылкаЗВС);
		
	КонецЕсли;
	
	Если Не ТекущаяСтрока=Неопределено Тогда 
		Элементы.ДеревоЗП.ТекущаяСтрока=ТекущаяСтрока.ПолучитьИдентификатор();	 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуЗП(Родитель, СсылкаЗВС)
	
	ЭлементыДереваЗП = Родитель.ПолучитьЭлементы();
	
	Для каждого ЭлементДереваЗП  Из ЭлементыДереваЗП Цикл
		Если ЭлементДереваЗП.Заказ = СсылкаЗВС Тогда
			ТекущаяСтрока = ЭлементДереваЗП;
			Возврат  ТекущаяСтрока;
		иначе
			ТекущаяСтрока = ПолучитьСтрокуЗП(ЭлементДереваЗП, СсылкаЗВС);
			Если ТекущаяСтрока <> Неопределено Тогда
				Возврат ТекущаяСтрока;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура КомандаАвтоначисление(Команда)
	Элементы.ДеревоЗПАвтоначисление.Пометка = не Элементы.ДеревоЗПАвтоначисление.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура Доходы1СуммаБезналОткрытие(Элемент, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ТекСтрока = Элемент.Родитель.ТекущиеДанные;
	//Если ТекСтрока <> Неопределено Тогда
	//    Данные = СформироватьОтчетРасшифровкиВидаДохода(ТекСтрока.ВидДохода);
	//    
	//    Если Данные.Сформирован Тогда
	//    	ИА_БФКС.ТабДок_Показать(Данные.ТабДок, Данные.Заголовок);
	//    Иначе
	//		ПоказатьПредупреждение(,"Нет данных расшифровки по виду дохода '" + ТекСтрока.ВидДохода + "'");
	//    КонецЕсли; 
	//КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолитика11СуммаОткрытие(Элемент, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
	Если ФП_по_ТБ Тогда
		ТекСтрока = Элементы.ЗаливкаФондов_Итого.ТекущиеДанные;
	Иначе
    	ТекСтрока = Элемент.Родитель.ТекущиеДанные;
	КонецЕсли;
	Если ТекСтрока <> Неопределено Тогда
		
        КлючСтроки =  ИА_БФКС.Струк_Новый("Раздел, Подразделение, Статья", ТекСтрока);
		Если ФП_по_ТБ Тогда
			КлючСтроки.Статья = ТекСтрока.Фонд;
		КонецЕсли;
		//
        Данные = СформироватьОтчетРасшифровкиПолитика(КлючСтроки,1);
        
        Если Данные.Сформирован Тогда
        	ИА_БФКС.ТабДок_Показать(Данные.ТабДок, Данные.Заголовок);
        Иначе
            ПоказатьПредупреждение(,"Нет данных расшифровки по политике для: " + ИА_БФКС.Струк_Представление(КлючСтроки));
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолитика11СуммаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	если ФП_по_ТБ Тогда
		ТекСтрока = Элементы.ЗаливкаФондов_Итого.ТекущиеДанные;
	Иначе
		ТекСтрока = Элемент.Родитель.ТекущиеДанные;
	КонецЕсли;
	Если ТекСтрока <> Неопределено Тогда
	     РедактироватьЗначениеПолитики1(ТекСтрока);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗначениеПолитики1Обрабочик(данные, дп) Экспорт
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
        Отбор = Новый Структура("ВидДохода, Раздел, Подразделение, Статья");
        
        Для каждого Стр Из Данные Цикл
            ЗаполнитьЗначенияСвойств(Отбор, Стр);
            
            М = Объект.Политика1.НайтиСтроки(Отбор);
            Для каждого СтрП1 Из М Цикл
                ЗаполнитьЗначенияСвойств(СтрП1, Стр, "Сумма");
                СтрП1.Вручную = Истина;
            КонецЦикла;  
        КонецЦикла;  
        
		ЗаполнитьДоходыИПолитикиСервер(ложь, ложь,истина,истина, ложь, истина);
		Политика_Развернуть(1,Отбор);
		Политика_Развернуть(2);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗначениеПолитики1(ТекСтрока)
	Если ФП_по_ТБ Тогда
		М = Объект.Политика1.НайтиСтроки(Новый Структура("Подразделение, Статья" ,ТекСтрока.Подразделение, ТекСтрока.Фонд));
	Иначе
	    М = Объект.Политика1.НайтиСтроки(Новый Структура("Раздел, Подразделение, Статья" ,ТекСтрока.Раздел, ТекСтрока.Подразделение, ТекСтрока.Статья));
	КонецЕсли;
    
    Колонки = "Раздел, Подразделение, Статья, ВидДохода, СуммаАвто, Сумма";
    
    ТЗФ = Новый Массив;
    Для каждого Стр Из М Цикл
        ТЗФ.Добавить(ИА_БФКС.Струк_Новый(Колонки, Стр));
    КонецЦикла;  
	
	парам = Новый Структура("Распределение1", ТЗФ);
	опов = Новый ОписаниеОповещения("РедактироватьЗначениеПолитики1Обрабочик",ЭтаФорма);
    ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ФормаРедактированияРаспределенияПолитики1", парам,ЭтаФорма,,,,опов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоходыИтого(Команда)
	ЗаполнитьДоходыИПолитикиСервер(Ложь, Истина, Истина, Истина, Истина, ложь);

	Политика_Развернуть(1);
    Политика_Развернуть(2);
КонецПроцедуры

&НаКлиенте
Процедура ВаловаяПрибыль(Команда)
    Если Модифицированность Тогда
        ЭтаФорма.Записать();
    КонецЕсли; 
	
	ИмяОтчета = ?(ИспДоходыПоПодразделениям, "ИА_ФП_ВаловаяПрибыльПодр" , "ИА_ФП_ВаловаяПрибыль" );
    Данные = ИА_БФС.СКД_ПодготовитьПараметрыОткрытияОтчета(ИмяОтчета, Новый Структура("ФП", Объект.Ссылка), Истина);
    
    ОткрытьФорму(Данные.ИмяФормы, Данные.Параметры);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьВаловуюПрибыльНаБезналПриИзменении(Элемент)
    УменьшитьВаловуюПрибыльНаБезналПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УменьшитьВаловуюПрибыльНаБезналПриИзмененииНаСервере()
    Об = РеквизитФормыВЗначение("Объект");
    ИА_ФПСервер.ЗаполнитьРеквизитыПослеРаспределения(Об);    
    ЗначениеВРеквизитФормы(Об, "Объект"); 
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБП1ПослеУдаления(Элемент)
	ПересчитатьПриИзменДоходов();    
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеСредствСФондов1ПослеУдаления(Элемент)
	ПересчитатьПриИзменДоходов();    
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБП_Распределение1ПослеУдаления(Элемент)
	ПересчитатьПриИзменДоходов();    
КонецПроцедуры

&НаКлиенте
Функция Абс(ч)
	Возврат МАКС(ч, -ч);
КонецФункции

//&НаСервере
//Процедура ОбъектФП1Загрузить(ПредФП) 
//	Объект.ФП1.Загрузить(ПредФП.ФП1.Выгрузить());
//	Коэф = ПолучитьКоэффициентНедели();
//	Для каждого стр из Объект.ФП1 Цикл
//		стр.СуммаБезнал = стр.СуммаБезналМесяц / Коэф;
//		стр.СуммаНал = стр.СуммаНалМесяц / Коэф;
//	КонецЦикла;
//КонецПроцедуры

&НаСервере
Процедура ОбновитьСреднееФП1(ОтборПодр = Неопределено, ОтборСтатья = Неопределено)
	Если ОтборПодр = Неопределено Тогда
		Для каждого стр из Объект.ФП1 Цикл
			стр.СуммаСреднее = 0;
			стр.СуммаОтклонение = 0;
		КонецЦикла;	
	Иначе
		Отбор = Новый Структура("Подразделение,Фонд", ОтборПодр, ОтборСтатья);
		НайдСтр = Объект.ФП1.НайтиСтроки(Отбор);
		Для каждого стр из НайдСтр Цикл
			стр.СуммаСреднее = 0;
			стр.СуммаОтклонение = 0;
		КонецЦикла;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ИА_ФинансовоеПланированиеФП1.СуммаБезнал + ИА_ФинансовоеПланированиеФП1.СуммаНал) КАК Сумма,
	|	ИА_ФинансовоеПланированиеФП1.Подразделение,
	|	ИА_ФинансовоеПланированиеФП1.Фонд
	|ИЗ
	|	Документ.ИА_ФинансовоеПланирование.ФП1 КАК ИА_ФинансовоеПланированиеФП1
	|ГДЕ
	|	ИА_ФинансовоеПланированиеФП1.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И ИА_ФинансовоеПланированиеФП1.Ссылка.Проведен
	|	И (ИА_ФинансовоеПланированиеФП1.Подразделение = &Подразделение
	|			ИЛИ &Подразделение = НЕОПРЕДЕЛЕНО)
	|	И (ИА_ФинансовоеПланированиеФП1.Фонд = &Фонд
	|			ИЛИ &Фонд = НЕОПРЕДЕЛЕНО)
	|	И (ИА_ФинансовоеПланированиеФП1.Ссылка.Организация = &Организация или &Организация = неопределено)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИА_ФинансовоеПланированиеФП1.Подразделение,
	|	ИА_ФинансовоеПланированиеФП1.Фонд";
	Запрос.УстановитьПараметр("Организация", ?(ФППоОрганизациям, Объект.Организация, Неопределено));
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ПериодФП1);
	Запрос.УстановитьПараметр("ДатаКонца", Объект.Дата - 1);
	Запрос.УстановитьПараметр("Подразделение", ОтборПодр);
	Запрос.УстановитьПараметр("Фонд", ОтборСтатья);
	
	Выборка = Запрос.Выполнить().Выбрать();
	КолДней = (НачалоДня(Объект.Дата) - Объект.ПериодФП1)/ (24*60*60) + 1;
	Коэф = 7 / КолДней;
	
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура("Подразделение,Фонд", Выборка.Подразделение, Выборка.Фонд);
		НайдСтр = Объект.ФП1.НайтиСтроки(Отбор);
		Для каждого стр из НайдСтр Цикл
			стр.СуммаСреднее = Выборка.Сумма * Коэф;
			стр.СуммаОтклонение = стр.СуммаБезнал + стр.СуммаНал - стр.СуммаСреднее;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПериодФП1ПриИзменении(Элемент)
	Если Объект.ПериодФП1>= НачалоДня(Объект.Дата) Тогда
		Объект.ПериодФП1 = НачалоДня(Объект.Дата) - 1;
	КонецЕсли;
	ОбновитьСреднееФП1();
КонецПроцедуры


&НаКлиенте
Процедура ФП1ПодразделениеПриИзменении(Элемент)
	тд = Элементы.ФП1.ТекущиеДанные;
	ОбновитьСреднееФП1(тд.Подразделение, тд.Фонд);
КонецПроцедуры

&НаКлиенте
Процедура ФП1ФондПриИзменении(Элемент)
	тд = Элементы.ФП1.ТекущиеДанные;
	ОбновитьСреднееФП1(тд.Подразделение, тд.Фонд);
КонецПроцедуры

////////////// +ДИРЕКТИВА ФП
&НаСервере
Функция СформироватьПФ_ДирективаФП_ТБ(ДокФП)
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ИА_ФинансовоеПланирование.ПолучитьМакет("Директива");
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_РаспределениеНедель.КонецНедели
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Период = &Период";
	Запрос.УстановитьПараметр("Период",объект.НеделяТБ);
	выборка = запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Обл = Макет.ПолучитьОбласть("Шапка");
	//обл.Параметры.Дата = объект.Дата;
	обл.Параметры.Шапка1 = "ФП №"+ объект.Номер + " от " + формат(объект.Дата, "ДФ=dd.MM.yyyy")+ ", статус " + ?(объект.Проведен, """Утверждено""", """Черновик""");
	Если ФП_по_ТБ Тогда
		обл.Параметры.Шапка2 = "ТБ №"+ объект.ТБ.Номер +", " + нрег(формат(объект.тб.Месяц, "ДФ='ММММ yyyy'"));
	КонецЕсли;
	обл.Параметры.ДатаОтчета = ТекущаяДата();
	обл.Параметры.НеделяТБ = формат(объект.НеделяТБ, "ДФ=dd.MM.yyyy");
	обл.Параметры.КонецНедели = формат(Выборка.КонецНедели, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	///////////////// Внедоходные
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументКСУ_ВнедоходноеПоступлениеСредств.Ссылка КАК Ссылка,
	               |	ДокументКСУ_ВнедоходноеПоступлениеСредств.Номер КАК Номер,
	               |	ДокументКСУ_ВнедоходноеПоступлениеСредств.Дата КАК Дата,
	               |	ДокументКСУ_ВнедоходноеПоступлениеСредств.ТипИсточникаСредств КАК ТипИсточникаСредств,
	               |	ДокументКСУ_ВнедоходноеПоступлениеСредств.ИсточникСредств КАК ИсточникСредств,
	               |	ДокументКСУ_ВнедоходноеПоступлениеСредств.Комментарий КАК Комментарий,
	               |	ДокументКСУ_ВнедоходноеПоступлениеСредств.СуммаДокумента КАК Сумма,
	               |	ЕСТЬNULL(НаФонды.Сумма, 0) КАК ВФонды,
	               |	ЕСТЬNULL(НаЗаказы.Сумма, 0) КАК НаЗаказы
	               |ИЗ
	               |	Документ.КСУ_ВнедоходноеПоступлениеСредств КАК ДокументКСУ_ВнедоходноеПоступлениеСредств
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КСУ_ВнедоходноеПоступлениеСредствИА_Фонды.Ссылка КАК Ссылка,
	               |			СУММА(КСУ_ВнедоходноеПоступлениеСредствИА_Фонды.Сумма) КАК Сумма
	               |		ИЗ
	               |			Документ.КСУ_ВнедоходноеПоступлениеСредств.ИА_Фонды КАК КСУ_ВнедоходноеПоступлениеСредствИА_Фонды
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			КСУ_ВнедоходноеПоступлениеСредствИА_Фонды.Ссылка) КАК НаФонды
	               |		ПО (НаФонды.Ссылка = ДокументКСУ_ВнедоходноеПоступлениеСредств.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИА_ЗаказыНаПриобретение.Ссылка КАК Ссылка,
	               |			СУММА(ИА_ЗаказыНаПриобретение.Сумма) КАК Сумма
	               |		ИЗ
	               |			Документ.КСУ_ВнедоходноеПоступлениеСредств.ИА_ЗаказыНаПриобретение КАК ИА_ЗаказыНаПриобретение
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ИА_ЗаказыНаПриобретение.Ссылка) КАК НаЗаказы
	               |		ПО (НаЗаказы.Ссылка = ДокументКСУ_ВнедоходноеПоступлениеСредств.Ссылка)
	               |ГДЕ
	               |	(ДокументКСУ_ВнедоходноеПоступлениеСредств.Организация = &Организация
	               |			ИЛИ &НеПоОрг)
	               |	И ДокументКСУ_ВнедоходноеПоступлениеСредств.Дата МЕЖДУ &ДатаНачалаТБ И &ДатаКонцаТБ
	               |	И ДокументКСУ_ВнедоходноеПоступлениеСредств.Проведен";
	для каждого п из ВнедоходныеПоступления.Параметры.Элементы цикл
		запрос.УстановитьПараметр(п.Параметр, п.Значение);
	КонецЦикла;
	тз = запрос.Выполнить().Выгрузить();
	
	Обл = Макет.ПолучитьОбласть("ВДШапка");
	ТабДок.Вывести(обл);
	Для каждого стр из тз Цикл
		Обл = Макет.ПолучитьОбласть("ВДСтрока");
		ЗаполнитьЗначенияСвойств(Обл.Параметры, стр);
		Обл.Параметры.НомерТип = стр.Номер + " / " + стр.ТипИсточникаСредств + " / " + стр.ИсточникСредств;
		ТабДок.Вывести(обл);
	КонецЦикла;
	Обл = Макет.ПолучитьОбласть("ВДСтрокаИтого");
	Обл.Параметры.Дата = "Итого:";
	Обл.Параметры.Сумма = тз.Итог("Сумма");
	Обл.Параметры.НаЗаказы = тз.Итог("НаЗаказы");
	Обл.Параметры.ВФонды = тз.Итог("ВФонды");
	ТабДок.Вывести(обл);

	
	///////////////// ДОХОДЫ
	ДоходыЧистыеДер = РеквизитФормыВЗначение("ДоходыЧистые");
	
	Обл = Макет.ПолучитьОбласть("ДоходыШапка");
	ТабДок.Вывести(обл);
	Если ИспДоходыПоПодразделениям Тогда
		Для каждого стрПодр из ДоходыЧистые.ПолучитьЭлементы() Цикл
			Обл = Макет.ПолучитьОбласть("ДоходыСтрока");
			ЗаполнитьЗначенияСвойств(Обл.Параметры, стрПодр);
			Обл.Параметры.НедельныйПлан = стрПодр["СуммаПлан"+НомерТекущейНедели];
			Обл.Параметры.НедельныйФакт = стрПодр["СуммаФакт"+НомерТекущейНедели];
			Обл.Параметры.ПроцентНедельный = стрПодр["Процент"+НомерТекущейНедели];
			ТабДок.Вывести(обл);
			Для каждого стрДоход из стрПодр.ПолучитьЭлементы() Цикл
				Обл = Макет.ПолучитьОбласть("ДоходыСтрока");
				ЗаполнитьЗначенияСвойств(Обл.Параметры, стрДоход);
				Обл.Параметры.ВидДохода = " - " + стрДоход.ВидДохода;
				
				Обл.Параметры.НедельныйПлан = стрДоход["СуммаПлан"+НомерТекущейНедели];
				Обл.Параметры.НедельныйФакт = стрДоход["СуммаФакт"+НомерТекущейНедели];
				Обл.Параметры.ПроцентНедельный = стрДоход["Процент"+НомерТекущейНедели];
			
				ТабДок.Вывести(обл);
			КонецЦикла;
		КонецЦикла;
	иначе
		Для каждого стр из ДоходыЧистые.ПолучитьЭлементы() Цикл
			Обл = Макет.ПолучитьОбласть("ДоходыСтрока");
			ЗаполнитьЗначенияСвойств(Обл.Параметры, стр);
			Обл.Параметры.НедельныйПлан = стр["СуммаПлан"+НомерТекущейНедели];
			Обл.Параметры.НедельныйФакт = стр["СуммаФакт"+НомерТекущейНедели];
			Обл.Параметры.ПроцентНедельный = стр["Процент"+НомерТекущейНедели];
			ТабДок.Вывести(обл);
		КонецЦикла;
	КонецЕсли;
	Обл = Макет.ПолучитьОбласть("ДоходыИтого");
	Обл.Параметры.ВидДохода = "ИТОГО:";
	
	итПлНед = ДоходыЧистыеДер.Строки.итог("СуммаПлан"+НомерТекущейНедели);
	итФНед = ДоходыЧистыеДер.Строки.итог("СуммаФакт"+НомерТекущейНедели);
	Обл.Параметры.НедельныйПлан = итПлНед;
	Обл.Параметры.НедельныйФакт = итФНед; 
	Если итПлНед >0 Тогда
		Обл.Параметры.ПроцентНедельный = итФНед / итПлНед * 100;   
	КонецЕсли;
	
	итПл = ДоходыЧистыеДер.Строки.итог("СуммаПлан");
	итФ = ДоходыЧистыеДер.Строки.итог("СуммаФакт");
	Обл.Параметры.СуммаПлан  = итПл;
	Обл.Параметры.СуммаФакт	 = итФ; 
	Если итПл >0 Тогда
		Обл.Параметры.ПроцентВыполнения = итФ / итПл * 100;   
	КонецЕсли;
			
	ТабДок.Вывести(обл);
	
	///////////////// ОТЛОЖЕННЫЙ ДОХОД
	
	Если Объект.ОтложенныйДоход.Количество() > 0 Тогда
		Обл = Макет.ПолучитьОбласть("ОтлДоходШапка");
		ТабДок.Вывести(обл);
		Для каждого стр из Объект.ОтложенныйДоход Цикл
			Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить Тогда
				Обл = Макет.ПолучитьОбласть("ОтлДоходСтрока");
				ЗаполнитьЗначенияСвойств(Обл.Параметры, стр);
				Обл.Параметры.ИД = стр.ИД.НаименованиеИД;
				ТабДок.Вывести(обл);
			КонецЕсли;
		КонецЦикла;
		
		Обл = Макет.ПолучитьОбласть("ОтлДоходВозвратШапка");
		ТабДок.Вывести(обл);
		Для каждого стр из Объект.ОтложенныйДоход Цикл
			Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Вернуть Тогда
				Обл = Макет.ПолучитьОбласть("ОтлДоходВозвратСтрока");
				ЗаполнитьЗначенияСвойств(Обл.Параметры, стр);
				Обл.Параметры.ИД = стр.ИД.НаименованиеИД;
				ТабДок.Вывести(обл);
			КонецЕсли;
		КонецЦикла;
		
		Обл = Макет.ПолучитьОбласть("Разделитель");
		ТабДок.Вывести(обл);

	КонецЕсли;
	
	// ИТОГО В ЗАЛИВКУ
	
	стрВЗаливку = ИтогоВЗаливку[0];
	Если стрВЗаливку.Сумма = стрВЗаливку["Неделя"+НомерТекущейНедели] Тогда
		Обл = Макет.ПолучитьОбласть("ИтогоВЗаливку1");
		Обл.Параметры.Сумма = стрВЗаливку.Сумма;
		ТабДок.Вывести(обл);
	Иначе
		Обл = Макет.ПолучитьОбласть("ИтогоВЗаливку2");
		Обл.Параметры.Сумма = стрВЗаливку["Неделя"+НомерТекущейНедели];
		Обл.Параметры.СуммаТекФП = стрВЗаливку.Сумма;
		ТабДок.Вывести(обл);
	КонецЕсли;
	
	///////////////// РАСХОДЫ 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ФинансовоеПланированиеМаржаПоПодразделениям.Подразделение КАК Подразделение,
	               |	ЕСТЬNULL(СУММА(ИА_ФинансовоеПланированиеИтогоВЗаливкуПодразделениям.Сумма), 0) КАК ИтогоВЗаливку,
	               |	ЕСТЬNULL(СУММА(ИА_ФинансовоеПланированиеМаржаПоПодразделениям.Сумма), 0) КАК Маржа
	               |ИЗ
	               |	Документ.ИА_ФинансовоеПланирование.МаржаПоПодразделениям КАК ИА_ФинансовоеПланированиеМаржаПоПодразделениям
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИА_ФинансовоеПланирование.ИтогоВЗаливкуПодразделениям КАК ИА_ФинансовоеПланированиеИтогоВЗаливкуПодразделениям
	               |		ПО ИА_ФинансовоеПланированиеМаржаПоПодразделениям.Ссылка = ИА_ФинансовоеПланированиеИтогоВЗаливкуПодразделениям.Ссылка
	               |			И ИА_ФинансовоеПланированиеМаржаПоПодразделениям.Подразделение = ИА_ФинансовоеПланированиеИтогоВЗаливкуПодразделениям.Подразделение
	               |ГДЕ
	               |	ИА_ФинансовоеПланированиеМаржаПоПодразделениям.Ссылка.Проведен
	               |	И (ИА_ФинансовоеПланированиеМаржаПоПодразделениям.Ссылка.Организация = &Организация
	               |			ИЛИ &НеПоОрг)
	               |	И ИА_ФинансовоеПланированиеМаржаПоПодразделениям.Ссылка.НеделяТБ = &Период
	               |	И ИА_ФинансовоеПланированиеМаржаПоПодразделениям.Ссылка.Дата < &ДатаДок
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_ФинансовоеПланированиеМаржаПоПодразделениям.Подразделение";
	Запрос.УстановитьПараметр("ДатаДок", объект.Дата);
	тз_ПредДанных = запрос.Выполнить().Выгрузить();
		
	ДеревоРасходы = РеквизитФормыВЗначение("ЗаливкаИтого");

	подразделения = Объект.ДоходыИтого.Выгрузить();
	подразделения.Свернуть("Подразделение");
	
	Если ИспДоходыПоПодразделениям Тогда
		Для каждого стрПодр из подразделения Цикл			
			стрПодр = ДеревоРасходы.Строки.Найти(стрПодр.Подразделение);
			
			// Переменные Расходы
			Обл = Макет.ПолучитьОбласть("Политика1Шапка");
			Обл.Параметры.Подразделение = стрПодр.Подразделение;
			ТабДок.Вывести(обл);
			
			СтрДерП1 = ПолучитьСтрокуПоТипуСтроки(стрПодр, Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы);
			Для каждого стр из СтрДерП1.Строки Цикл
				Обл = Макет.ПолучитьОбласть("Политика1Строка" + ?(ИспПодразделения, "Подр", ""));
				ЗаполнитьЗначенияСвойств(Обл.Параметры, стр);
				пл = стр["СуммаПоФП"+НомерТекущейНедели];
				фк = стр["Сумма"+НомерТекущейНедели];
				Обл.Параметры.НедельныйПлан = пл;
				Обл.Параметры.НедельныйФакт = фк;
				Если пл > 0 Тогда
					Обл.Параметры.ПроцентНедельный = фк / пл * 100;
				КонецЕсли;
				ТабДок.Вывести(обл);
			КонецЦикла;
			Обл = Макет.ПолучитьОбласть("Политика1Итого");
			ЗаполнитьЗначенияСвойств(Обл.Параметры, СтрДерП1);
			Обл.Параметры.Фонд = "ИТОГО:";
			пл = СтрДерП1["СуммаПоФП"+НомерТекущейНедели];
			фк = СтрДерП1["Сумма"+НомерТекущейНедели];
			Обл.Параметры.НедельныйПлан = пл;
			Обл.Параметры.НедельныйФакт = фк;
			Если пл > 0 Тогда
				Обл.Параметры.ПроцентНедельный = фк / пл * 100;
			КонецЕсли;
			ТабДок.Вывести(обл);
			
			// маржа
			СтрДерМаржа = ПолучитьСтрокуПоТипуСтроки(стрПодр, Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль);
			Стр_ПредДанных = тз_ПредДанных.НайтиСтроки(Новый Структура("Подразделение", стрПодр.Подразделение));
			Если Стр_ПредДанных.Количество() = 0 Тогда
				Обл = Макет.ПолучитьОбласть("Маржа1");
				Обл.Параметры.Сумма = СтрДерМаржа["Сумма"+НомерТекущейНедели];
				ТабДок.Вывести(обл);
			Иначе
				Обл = Макет.ПолучитьОбласть("Маржа2");
				Обл.Параметры.Сумма = СтрДерМаржа["Сумма"+НомерТекущейНедели] ;
				Обл.Параметры.СуммаТекФП = СтрДерМаржа["Сумма"+НомерТекущейНедели] - Стр_ПредДанных[0].Маржа;
				ТабДок.Вывести(обл);
			КонецЕсли;
			
			//// Учредительские
			Обл = Макет.ПолучитьОбласть("УчФондыШапка");
			ТабДок.Вывести(обл);
			СтрДерП1 = ПолучитьСтрокуПоТипуСтроки(стрПодр, Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды);
			Для каждого стр из СтрДерП1.Строки Цикл
				Обл = Макет.ПолучитьОбласть("УчФондыСтрока" + ?(ИспПодразделения, "Подр", ""));
				ЗаполнитьЗначенияСвойств(Обл.Параметры, стр);
				пл = стр["СуммаПоФП"+НомерТекущейНедели];
				фк = стр["Сумма"+НомерТекущейНедели];
				Обл.Параметры.НедельныйПлан = пл;
				Обл.Параметры.НедельныйФакт = фк;
				Если пл > 0 Тогда
					Обл.Параметры.ПроцентНедельный = фк / пл * 100;
				КонецЕсли;
				ТабДок.Вывести(обл);
			КонецЦикла;
			Обл = Макет.ПолучитьОбласть("УчФондыИтого");
			ЗаполнитьЗначенияСвойств(Обл.Параметры, СтрДерП1);
			Обл.Параметры.Фонд = "ИТОГО:";
			пл = СтрДерП1["СуммаПоФП"+НомерТекущейНедели];
			фк = СтрДерП1["Сумма"+НомерТекущейНедели];
			Обл.Параметры.НедельныйПлан = пл;
			Обл.Параметры.НедельныйФакт = фк;
			Если пл > 0 Тогда
				Обл.Параметры.ПроцентНедельный = фк / пл * 100;
			КонецЕсли;
			ТабДок.Вывести(обл);
			
			// итого к распределению
			СтрДерИтогоКРаспр = ПолучитьСтрокуПоТипуСтроки(стрПодр, Перечисления.КСУ_ВидыСтрокТБ.ИтогКЗаливке);
			Стр_ПредДанных = тз_ПредДанных.НайтиСтроки(Новый Структура("Подразделение", стрПодр.Подразделение));
			Если Стр_ПредДанных.Количество() = 0 Тогда
				Обл = Макет.ПолучитьОбласть("ИтогоКРаспределению1");
				Обл.Параметры.Сумма = СтрДерИтогоКРаспр["Сумма"+НомерТекущейНедели];
				ТабДок.Вывести(обл);
			Иначе
				Обл = Макет.ПолучитьОбласть("ИтогоКРаспределению2");
				Обл.Параметры.Сумма = СтрДерИтогоКРаспр["Сумма"+НомерТекущейНедели] ;
				Обл.Параметры.СуммаТекФП = СтрДерИтогоКРаспр["Сумма"+НомерТекущейНедели] - Стр_ПредДанных[0].ИтогоВЗаливку;
				ТабДок.Вывести(обл);
			КонецЕсли;
			
			//// Постоянные расходы
			Обл = Макет.ПолучитьОбласть("ПостоянныеРасхШапка");
			ТабДок.Вывести(обл);
			СтрДерП1 = ПолучитьСтрокуПоТипуСтроки(стрПодр, Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы);
			Для каждого стр из СтрДерП1.Строки Цикл
				Обл = Макет.ПолучитьОбласть("ПостоянныеРасхСтрока" + ?(ИспПодразделения, "Подр", ""));
				ЗаполнитьЗначенияСвойств(Обл.Параметры, стр);
				пл = стр["СуммаПоФП"+НомерТекущейНедели];
				фк = стр["Сумма"+НомерТекущейНедели];
				Обл.Параметры.НедельныйПлан = пл;
				Обл.Параметры.НедельныйФакт = фк;
				Если пл > 0 Тогда
					Обл.Параметры.ПроцентНедельный = фк / пл * 100;
				КонецЕсли;
				ТабДок.Вывести(обл);
			КонецЦикла;
			Обл = Макет.ПолучитьОбласть("ПостоянныеРасхИтого");
			ЗаполнитьЗначенияСвойств(Обл.Параметры, СтрДерП1);
			Обл.Параметры.Фонд = "ИТОГО:";
			пл = СтрДерП1["СуммаПоФП"+НомерТекущейНедели];
			фк = СтрДерП1["Сумма"+НомерТекущейНедели];
			Обл.Параметры.НедельныйПлан = пл;
			Обл.Параметры.НедельныйФакт = фк;
			Если пл > 0 Тогда
				Обл.Параметры.ПроцентНедельный = фк / пл * 100;
			КонецЕсли;
			ТабДок.Вывести(обл);

		КонецЦикла;
	Иначе
		// Переменные Расходы
		Обл = Макет.ПолучитьОбласть("Политика1Шапка");
		ТабДок.Вывести(обл);
		СтрДерП1 = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы);
		Для каждого стр из СтрДерП1.Строки Цикл
			Обл = Макет.ПолучитьОбласть("Политика1Строка" + ?(ИспПодразделения, "Подр", ""));
			ЗаполнитьЗначенияСвойств(Обл.Параметры, стр);
			пл = стр["СуммаПоФП"+НомерТекущейНедели];
			фк = стр["Сумма"+НомерТекущейНедели];
			Обл.Параметры.НедельныйПлан = пл;
			Обл.Параметры.НедельныйФакт = фк;
			Если пл > 0 Тогда
				Обл.Параметры.ПроцентНедельный = фк / пл * 100;
			КонецЕсли;
			ТабДок.Вывести(обл);
		КонецЦикла;
		Обл = Макет.ПолучитьОбласть("Политика1Итого");
		ЗаполнитьЗначенияСвойств(Обл.Параметры, СтрДерП1);
		Обл.Параметры.Фонд = "ИТОГО:";
		пл = СтрДерП1["СуммаПоФП"+НомерТекущейНедели];
		фк = СтрДерП1["Сумма"+НомерТекущейНедели];
		Обл.Параметры.НедельныйПлан = пл;
		Обл.Параметры.НедельныйФакт = фк;
		Если пл > 0 Тогда
			Обл.Параметры.ПроцентНедельный = фк / пл * 100;
		КонецЕсли;
		ТабДок.Вывести(обл);
		
		// маржа
		СтрДерМаржа = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль);
		Если тз_ПредДанных.Количество() = 0 Тогда
			Обл = Макет.ПолучитьОбласть("Маржа1");
			Обл.Параметры.Сумма = СтрДерМаржа["Сумма"+НомерТекущейНедели];
			ТабДок.Вывести(обл);
		Иначе
			Обл = Макет.ПолучитьОбласть("Маржа2");
			Обл.Параметры.Сумма = СтрДерМаржа["Сумма"+НомерТекущейНедели] ;
			Обл.Параметры.СуммаТекФП = СтрДерМаржа["Сумма"+НомерТекущейНедели] - тз_ПредДанных[0].Маржа;
			ТабДок.Вывести(обл);
		КонецЕсли;
		
		//// Учредительские
		Обл = Макет.ПолучитьОбласть("УчФондыШапка");
		ТабДок.Вывести(обл);
		СтрДерП1 = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды);
		Для каждого стр из СтрДерП1.Строки Цикл
			Обл = Макет.ПолучитьОбласть("УчФондыСтрока" + ?(ИспПодразделения, "Подр", ""));
			ЗаполнитьЗначенияСвойств(Обл.Параметры, стр);
			пл = стр["СуммаПоФП"+НомерТекущейНедели];
			фк = стр["Сумма"+НомерТекущейНедели];
			Обл.Параметры.НедельныйПлан = пл;
			Обл.Параметры.НедельныйФакт = фк;
			Если пл > 0 Тогда
				Обл.Параметры.ПроцентНедельный = фк / пл * 100;
			КонецЕсли;
			ТабДок.Вывести(обл);
		КонецЦикла;
		Обл = Макет.ПолучитьОбласть("УчФондыИтого");
		ЗаполнитьЗначенияСвойств(Обл.Параметры, СтрДерП1);
		Обл.Параметры.Фонд = "ИТОГО:";
		пл = СтрДерП1["СуммаПоФП"+НомерТекущейНедели];
		фк = СтрДерП1["Сумма"+НомерТекущейНедели];
		Обл.Параметры.НедельныйПлан = пл;
		Обл.Параметры.НедельныйФакт = фк;
		Если пл > 0 Тогда
			Обл.Параметры.ПроцентНедельный = фк / пл * 100;
		КонецЕсли;
		ТабДок.Вывести(обл);
		
		// итого к распределению
		СтрДерИтогоКРаспр = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.ИтогКЗаливке);
		Если тз_ПредДанных.Количество() = 0 Тогда
			Обл = Макет.ПолучитьОбласть("ИтогоКРаспределению1");
			Обл.Параметры.Сумма = СтрДерИтогоКРаспр["Сумма"+НомерТекущейНедели];
			ТабДок.Вывести(обл);
		Иначе
			Обл = Макет.ПолучитьОбласть("ИтогоКРаспределению2");
			Обл.Параметры.Сумма = СтрДерИтогоКРаспр["Сумма"+НомерТекущейНедели] ;
			Обл.Параметры.СуммаТекФП = СтрДерИтогоКРаспр["Сумма"+НомерТекущейНедели] - тз_ПредДанных[0].ИтогоВЗаливку;
			ТабДок.Вывести(обл);
		КонецЕсли;
		
		//// Постоянные расходы
		Обл = Макет.ПолучитьОбласть("ПостоянныеРасхШапка");
		ТабДок.Вывести(обл);
		СтрДерП1 = ПолучитьСтрокуПоТипуСтроки(ДеревоРасходы, Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы);
		Для каждого стр из СтрДерП1.Строки Цикл
			Обл = Макет.ПолучитьОбласть("ПостоянныеРасхСтрока" + ?(ИспПодразделения, "Подр", ""));
			ЗаполнитьЗначенияСвойств(Обл.Параметры, стр);
			пл = стр["СуммаПоФП"+НомерТекущейНедели];
			фк = стр["Сумма"+НомерТекущейНедели];
			Обл.Параметры.НедельныйПлан = пл;
			Обл.Параметры.НедельныйФакт = фк;
			Если пл > 0 Тогда
				Обл.Параметры.ПроцентНедельный = фк / пл * 100;
			КонецЕсли;
			ТабДок.Вывести(обл);
		КонецЦикла;
		Обл = Макет.ПолучитьОбласть("ПостоянныеРасхИтого");
		ЗаполнитьЗначенияСвойств(Обл.Параметры, СтрДерП1);
		Обл.Параметры.Фонд = "ИТОГО:";
		пл = СтрДерП1["СуммаПоФП"+НомерТекущейНедели];
		фк = СтрДерП1["Сумма"+НомерТекущейНедели];
		Обл.Параметры.НедельныйПлан = пл;
		Обл.Параметры.НедельныйФакт = фк;
		Если пл > 0 Тогда
			Обл.Параметры.ПроцентНедельный = фк / пл * 100;
		КонецЕсли;
		ТабДок.Вывести(обл);
		
		для счН = НомерТекущейНедели + 1 По КолНед -1 Цикл
			фк = фк + СтрДерП1["Сумма"+счН];
		КонецЦикла;
		
		Если пл <> фк Тогда
			Обл = Макет.ПолучитьОбласть("ПерелиНедолив");
			Обл.Параметры.Перелив = ?(пл > фк, "Недолив", "Перелив");			
			Если тз_ПредДанных.Количество()>0 Тогда
				Обл.Параметры.ТекстСуммарно = "(суммарно с начала недели)"; 
			КонецЕсли;
			Обл.Параметры.Сумма = ?(пл > фк, пл - фк, фк - пл);
			ТабДок.Вывести(обл);
		КонецЕсли;
		
	КонецЕсли;
	
	////// ПЕРМЕЩЕНИЯ
	
	Обл = Макет.ПолучитьОбласть("ПеремШапка");
	ТабДок.Вывести(обл);
	Если ИспПодразделения Тогда
		Обл = Макет.ПолучитьОбласть("ПеремШапкаПодр");
	Иначе
		Обл = Макет.ПолучитьОбласть("ПеремШапкаТ");
	КонецЕсли;
	ТабДок.Вывести(обл);	
	Для каждого стр из Объект.РаспределениеПоФондам Цикл
		Если ИспПодразделения Тогда
			Обл = Макет.ПолучитьОбласть("ПеремСтрокаПодр");
		Иначе
			Обл = Макет.ПолучитьОбласть("ПеремСтрока");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Обл.Параметры, стр);
		ТабДок.Вывести(обл);
	КонецЦикла;
	Обл = Макет.ПолучитьОбласть("ПеремИтого");
	Обл.Параметры.СФонда = "ИТОГО:";
	Обл.Параметры.СуммаБезнал = Объект.РаспределениеПоФондам.итог("СуммаБезнал");
	ТабДок.Вывести(обл);
	
	
	///////////////// ЗАКАЗЫ
	
	Обл = Макет.ПолучитьОбласть("ЗаказыШапка");
	ТабДок.Вывести(обл);	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ФинансовоеПланированиеЗаказыНаПриобретение.Заказ.Номер КАК Номер,
	               |	ИА_ФинансовоеПланированиеЗаказыНаПриобретение.Заказ.Сумма КАК Сумма,
	               |	ИА_ФинансовоеПланированиеЗаказыНаПриобретение.УтвержденнаяСумма КАК УтвержденнаяСумма,
	               |	ИА_ФинансовоеПланированиеЗаказыНаПриобретение.Заказ.ПредметЗаказа КАК ПредметЗаказа,
	               |	ИА_ФинансовоеПланированиеЗаказыНаПриобретение.Заказ.Фонд КАК Фонд,
	               |	ИА_ФинансовоеПланированиеЗаказыНаПриобретение.Заказ.Подразделение КАК Подразделение,
	               |	ИА_ФинансовоеПланированиеЗаказыНаПриобретение.Статус КАК Статус,
	               |	ИА_ФинансовоеПланированиеЗаказыНаПриобретение.СтатусИсходный КАК СтатусИсходный,
	               |	ИА_ФинансовоеПланированиеЗаказыНаПриобретение.Заказ.Сумма КАК ЗаказСумма,
	               |	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход, 0) КАК ОдобреноРанее,
	               |	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналРасход, 0) КАК ВыплаченоРанее,
	               |	ИА_ФинансовоеПланированиеЗаказыНаПриобретение.Заказ.ВидДССправочно КАК ЗаказВидДССправочно
	               |ИЗ
	               |	Документ.ИА_ФинансовоеПланирование.ЗаказыНаПриобретение КАК ИА_ФинансовоеПланированиеЗаказыНаПриобретение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(,&ДатаДок) КАК ИА_СредстваВРезервеНаФондахОбороты
	               |		ПО ИА_ФинансовоеПланированиеЗаказыНаПриобретение.Заказ = ИА_СредстваВРезервеНаФондахОбороты.ЗП
	               |ГДЕ
	               |	ИА_ФинансовоеПланированиеЗаказыНаПриобретение.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Подразделение,
	               |	Фонд";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаДок", Объект.Дата -1 );
	
	тз = запрос.Выполнить().Выгрузить();
	Если не  ИспПодразделения тогда
		тз.Сортировать("Фонд");
	КонецЕсли;
	
	СтатусыОдобрено     = ИА_ФП.СтатусыОдобрено();
	
	// отклоненные заказы
	
	ПредФонд = Неопределено;
	ПредПодр = Неопределено;
	ИтогСумма = 0;
	Для каждого Выборка из тз Цикл
		Если Выборка.Статус = Перечисления.ИА_СостояниеЗаказа.Отклонен Тогда
			Если ИспПодразделения И ПредПодр <> выборка.Подразделение Тогда
				Обл = Макет.ПолучитьОбласть("ЗаказыСтрокаФонд");
				обл.Параметры.Фонд = Выборка.Подразделение;
				
				ОтборИтогов = новый Структура("Подразделение", выборка.Подразделение);
				итДанные = ИтогТЗ(тз, ОтборИтогов, ложь);
				ЗаполнитьЗначенияСвойств(обл.Параметры, итДанные);
				
				ТабДок.Вывести(обл);
				
				ПредПодр = Выборка.Подразделение;
				
				////////////////////
				
				Обл = Макет.ПолучитьОбласть("ЗаказыСтрокаФонд");
				обл.Параметры.Фонд = ?(ИспПодразделения, "  -", "") + Выборка.Фонд;
				
				ОтборИтогов = новый Структура("Подразделение, Фонд", выборка.Подразделение, Выборка.Фонд );
				итДанные = ИтогТЗ(тз, ОтборИтогов, ложь);
				ЗаполнитьЗначенияСвойств(обл.Параметры, итДанные);
				
				ТабДок.Вывести(обл);
				
				ПредФонд = Выборка.Фонд;
			ИначеЕсли ПредФонд <> выборка.фонд Тогда
				
				Отбор = Новый Структура("Фонд", выборка.фонд);
				Если ИспПодразделения Тогда
					Отбор.Вставить("Подразделение", выборка.Подразделение);
				КонецЕсли;
				итДанные = ИтогТЗ(тз, Отбор, ложь);				
				
				Обл = Макет.ПолучитьОбласть("ЗаказыСтрокаФонд");
				обл.Параметры.Фонд = ?(ИспПодразделения, "  -", "") + Выборка.Фонд;
				ЗаполнитьЗначенияСвойств(обл.Параметры, итДанные);
				ТабДок.Вывести(обл);
				
				ПредФонд = Выборка.Фонд;
			КонецЕсли;
			
			Обл = Макет.ПолучитьОбласть("ЗаказыСтрока");
			ЗаполнитьЗначенияСвойств(Обл.Параметры, выборка);
			обл.Параметры.номер = формат(число(Выборка.номер),"ЧДЦ=0; ЧГ=");
			ТабДок.Вывести(обл);
			
			ИтогСумма = ИтогСумма +Выборка.ЗаказСумма;
		КонецЕсли;
	КонецЦикла;
	Обл = Макет.ПолучитьОбласть("ЗаказыСтрокаИтого");
	Обл.Параметры.ЗаказСумма = ИтогСумма;
	ТабДок.Вывести(обл);
	
	// одобренные заказы
	
	Обл = Макет.ПолучитьОбласть("ОдобрЗаказыШапка");
	СправочноНалБезнал = Константы.ИА_ФП_ИспользоватьВидДССправочно.Получить();
	Если СправочноНалБезнал Тогда
		Обл.Параметры.Безнал = "(безналичный расчет)";
	КонецЕсли;
	ТабДок.Вывести(обл);	
	
	ПредФонд = Неопределено;
	ПредПодр = Неопределено;
	ИтогСумма = 0;
	
	Для каждого Выборка из тз Цикл
		Если Выборка.УтвержденнаяСумма > 0 И (Выборка.ЗаказВидДССправочно = Перечисления.ИА_ВидДенежныхСредств.Безналичные ИЛИ Выборка.ЗаказВидДССправочно = Перечисления.ИА_ВидДенежныхСредств.ПустаяСсылка() ИЛИ СправочноНалБезнал = ложь) Тогда
			Если ИспПодразделения И ПредПодр <> выборка.Подразделение Тогда
				Обл = Макет.ПолучитьОбласть("ОдобрЗаказыФонд");
				обл.Параметры.Фонд = Выборка.Подразделение;
				
				ОтборИтогов = новый Структура("Подразделение", выборка.Подразделение);
				Если СправочноНалБезнал тогда
					ОтборИтогов.Вставить("ЗаказВидДССправочно", Перечисления.ИА_ВидДенежныхСредств.Безналичные);
				КонецЕсли;
				итДанные = ИтогТЗ(тз, ОтборИтогов);
				
				Если СправочноНалБезнал тогда
					ОтборИтогов.ЗаказВидДССправочно = Перечисления.ИА_ВидДенежныхСредств.ПустаяСсылка();
					итДанные1 = ИтогТЗ(тз, ОтборИтогов);
					итДанные.ЗаказСумма = итДанные.ЗаказСумма + итДанные1.ЗаказСумма;
					итДанные.УтвержденнаяСумма = итДанные.УтвержденнаяСумма + итДанные1.УтвержденнаяСумма;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(обл.Параметры, итДанные);
				
				ТабДок.Вывести(обл);
				
				ПредПодр = Выборка.Подразделение;
				
				///////////////
				
				Обл = Макет.ПолучитьОбласть("ОдобрЗаказыФонд");
				обл.Параметры.Фонд = ?(ИспПодразделения, "  -", "") + Выборка.Фонд;
								
				ОтборИтогов.Вставить("Фонд", Выборка.Фонд);
				итДанные = ИтогТЗ(тз, ОтборИтогов);
				ЗаполнитьЗначенияСвойств(обл.Параметры, итДанные);
				
				ТабДок.Вывести(обл);
				
				ПредФонд = Выборка.Фонд;
			ИначеЕсли ПредФонд <> выборка.фонд Тогда				
				
				Обл = Макет.ПолучитьОбласть("ОдобрЗаказыФонд");
				обл.Параметры.Фонд = ?(ИспПодразделения, "  -", "") + Выборка.Фонд;
				
				ОтборИтогов = новый Структура("Фонд", выборка.фонд);
				Если СправочноНалБезнал тогда
					ОтборИтогов.Вставить("ЗаказВидДССправочно", Перечисления.ИА_ВидДенежныхСредств.Безналичные);
				КонецЕсли;
				
				Если ИспПодразделения тогда
					ОтборИтогов.Вставить("Подразделение", выборка.Подразделение);
				КонецЕсли;
				итДанные = ИтогТЗ(тз, ОтборИтогов);
				
				Если СправочноНалБезнал тогда
					ОтборИтогов.ЗаказВидДССправочно = Перечисления.ИА_ВидДенежныхСредств.ПустаяСсылка();
					итДанные1 = ИтогТЗ(тз, ОтборИтогов);
					итДанные.ЗаказСумма = итДанные.ЗаказСумма + итДанные1.ЗаказСумма;
					итДанные.УтвержденнаяСумма = итДанные.УтвержденнаяСумма + итДанные1.УтвержденнаяСумма;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(обл.Параметры, итДанные);
				
				ТабДок.Вывести(обл);
				
				ПредФонд = Выборка.Фонд;
			КонецЕсли;
			
			Обл = Макет.ПолучитьОбласть("ОдобрЗаказыСтрока");
			ЗаполнитьЗначенияСвойств(Обл.Параметры, выборка);
			обл.Параметры.номер = формат(число(Выборка.номер),"ЧДЦ=0; ЧГ=");
			ТабДок.Вывести(обл);
			
			ИтогСумма = ИтогСумма +Выборка.УтвержденнаяСумма;
		КонецЕсли;
	КонецЦикла;
	Обл = Макет.ПолучитьОбласть("ОдобрЗаказыСтрокаИтого");
	Обл.Параметры.УтвержденнаяСумма = ИтогСумма;
	Если СправочноНалБезнал Тогда
		Обл.Параметры.Безнал = "(безналичный расчет)";
	КонецЕсли;
	ТабДок.Вывести(обл);
	
	Если СправочноНалБезнал Тогда
		Обл = Макет.ПолучитьОбласть("ОдобрЗаказыШапка");
		Обл.Параметры.Безнал = "(наличный расчет)";
		ТабДок.Вывести(обл);	
		
		ПредФонд = Неопределено;
		ПредПодр = Неопределено;
		ИтогСумма = 0;
		
		Для каждого Выборка из тз Цикл
			Если Выборка.УтвержденнаяСумма > 0 И Выборка.ЗаказВидДССправочно = Перечисления.ИА_ВидДенежныхСредств.Наличные Тогда
				Если ИспПодразделения И ПредПодр <> выборка.Подразделение Тогда
					Обл = Макет.ПолучитьОбласть("ОдобрЗаказыФонд");
					обл.Параметры.Фонд = Выборка.Подразделение;
					
					ОтборИтогов = новый Структура("Подразделение, ЗаказВидДССправочно", выборка.Подразделение, Перечисления.ИА_ВидДенежныхСредств.Наличные);				
					итДанные = ИтогТЗ(тз, ОтборИтогов);
					ЗаполнитьЗначенияСвойств(обл.Параметры, итДанные);
				
					ТабДок.Вывести(обл);
					
					ПредПодр = Выборка.Подразделение;
					
					///////////
					
					Обл = Макет.ПолучитьОбласть("ОдобрЗаказыФонд");
					обл.Параметры.Фонд = ?(ИспПодразделения, "  -", "") + Выборка.Фонд;
					
					ОтборИтогов.Вставить("Фонд", Выборка.Фонд);
					итДанные = ИтогТЗ(тз, ОтборИтогов);
					ЗаполнитьЗначенияСвойств(обл.Параметры, итДанные);
					
					ТабДок.Вывести(обл);
					
					ПредФонд = Выборка.Фонд;
				ИначеЕсли ПредФонд <> выборка.фонд Тогда					
					
					Обл = Макет.ПолучитьОбласть("ОдобрЗаказыФонд");
					обл.Параметры.Фонд = ?(ИспПодразделения, "  -", "") + Выборка.Фонд;
					
					ОтборИтогов = новый Структура("Фонд", выборка.фонд);
					Если СправочноНалБезнал тогда
						ОтборИтогов.Вставить("ЗаказВидДССправочно", Перечисления.ИА_ВидДенежныхСредств.Наличные);
					КонецЕсли;
					Если ИспПодразделения тогда
						ОтборИтогов.Вставить("Подразделение", выборка.Подразделение);
					КонецЕсли;
					итДанные = ИтогТЗ(тз, ОтборИтогов);
					ЗаполнитьЗначенияСвойств(обл.Параметры, итДанные);
					
					ТабДок.Вывести(обл);
					
					ПредФонд = Выборка.Фонд;
				КонецЕсли;
				
				Обл = Макет.ПолучитьОбласть("ОдобрЗаказыСтрока");
				ЗаполнитьЗначенияСвойств(Обл.Параметры, выборка);
				обл.Параметры.номер = число(Выборка.номер);
				ТабДок.Вывести(обл);
				
				ИтогСумма = ИтогСумма +Выборка.УтвержденнаяСумма;
			КонецЕсли;
		КонецЦикла;
		Обл = Макет.ПолучитьОбласть("ОдобрЗаказыСтрокаИтого");
		Обл.Параметры.Безнал = "(наличный расчет)";
		Обл.Параметры.УтвержденнаяСумма = ИтогСумма;
		ТабДок.Вывести(обл);
	КонецЕсли;
		
	Обл = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(обл);
	
	ТабДок.АвтоМасштаб = Истина;
    Возврат ТабДок;
КонецФункции

&НаСервереБезКонтекста
Функция ИтогТЗ(тз, отбор, Утвержденные = истина)
	Если Утвержденные = ложь тогда
		отбор.вставить("статус", Перечисления.ИА_СостояниеЗаказа.Отклонен);
	КонецЕсли;
	
	Нстр = тз.НайтиСтроки(Отбор);				
	ИтСумма = 0;
	УтвСумма = 0;
	Для каждого стН из Нстр Цикл
		Если Утвержденные и стН.УтвержденнаяСумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		ИтСумма = ИтСумма + стН.ЗаказСумма;
		УтвСумма = УтвСумма + стН.УтвержденнаяСумма;
	КонецЦикла;
	Возврат новый Структура("ЗаказСумма, УтвержденнаяСумма", ИтСумма, УтвСумма);
КонецФункции
	
	
&НаСервере
Функция СформироватьПФ_ДирективаФП(ДокФП) 
    ТабДок = Новый ТабличныйДокумент;
    
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ДокФП = Документы.ИА_ФинансовоеПланирование.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    ПЗ = Новый Структура("МВ, МВВключая"
    , ДокФП.МоментВремени()
    , Новый Граница(ДокФП.МоментВремени(), ВидГраницы.Включая)
    );
    
    Данные_ДС = ПолучитьОстатокДС();
    Данные_ФП = ИА_ФПСервер.ФП_ПолучитьОстаткиНаФондах(ПЗ.МВВключая, ДокФП.Организация);
    
    отЧисло = ИА_БФКС.ОТ_Число(15, 2);
    
    ТабОформления = ИА_БФС.ТЗ_Создать("Имя,Заголовок,ТипЗначения, Ресурс"
    ,"Сумма", "Сумма", отЧисло, Истина
    ,"ВидДохода", "Вид дохода", Неопределено, Неопределено
    ,"ВидДоходаПолучатель", "Вид дохода-получатель", Неопределено, Неопределено
    );
    
    ТабОформленияБезИтогов = ИА_БФС.ТЗ_Создать("Имя,Заголовок,ТипЗначения, Ресурс"
    ,"Сумма", "Сумма", отЧисло, Ложь
    ,"ВидДохода", "Вид дохода", Неопределено, Неопределено
    ,"ВидДоходаПолучатель", "Вид дохода-получатель", Неопределено, Неопределено
    );
    
    МакетОформления = "Море";
    НастройкаОформления          = Новый Структура("МакетОформления, Поля", МакетОформления, ТабОформления);
    НастройкаОформленияБезИтогов = Новый Структура("МакетОформления, Поля", МакетОформления, ТабОформленияБезИтогов);
    НастройкаОформленияБезШапки  = Новый Структура("МакетОформления, Поля, СкрытьШапку", МакетОформления, 
    ИА_БФС.ТЗ_Создать("Имя, Заголовок, ТипЗначения, Ресурс"
    ,"Значение", "Значение", отЧисло, Ложь)
    );
    
    //{ Заголовок
    ДатаНачалаОтчета =  ?(ДокФП.НачалоПланирования, ДокФП.Дата, ДокФП.Дата + 60*60*24);
    ДатаНачала = Формат(ДатаНачалаОтчета, "ДФ='dd MMMM yyyy ""г.""'");    
    ДатаКонца = Формат(ДатаНачалаОтчета + 60*60*24*6 , "ДФ='dd MMMM yyyy ""г.""'");
    Заголовок = "Директива ФП №" + СокрЛП(ДокФП.Номер) + " за период с " + Формат(ДатаНачала, "ДЛФ=DD") + " по " + Формат(ДатаКонца, "ДЛФ=DD");
    //}
    
    ВывестиЗаголовок(ТабДок, Заголовок, ДокФП);
    
    // Денежные средства
    Таб_ПослеФП = ИА_БФС.ТЗ_Создать("Наименование, Сумма", "Остаток ДС после ФП", Данные_ДС.СуммаНал + Данные_ДС.СуммаБезНал, "Остаток по фондам после ФП", Данные_ФП.ОстатокВсего-Данные_ФП.ОстатокРезерв, "     в т.ч. Зарезервировано", Данные_ФП.ОстатокРезерв);
    Вывести_ТЗ_ВТабДок(Таб_ПослеФП, ТабДок, "Денежные средства", НастройкаОформленияБезИтогов); 
    
    // Доходы
    Таб_Доходы = ИА_БФС.ТЗ_НоваяТаблицаЗначений("ВидДохода, Сумма");
    Для каждого Стр Из ДокФП.Доходы Цикл
        НовСтрока = Таб_Доходы.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
        НовСтрока.Сумма = Стр.СуммаБезнал + Стр.СуммаНал;
    КонецЦикла;  
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(Таб_Доходы, "СтрокаТЗ.Сумма = 0");
    Вывести_ТЗ_ВТабДок(Таб_Доходы, ТабДок, "Доход от поступления ДС за неделю", НастройкаОформления); 
    
    // Пополнение спецдохода 							
    Таб_СпецДоход = ИА_БФС.ТЗ_НоваяТаблицаЗначений("ВидДохода,Источник,Период,Сумма");
    Для каждого Стр Из ДокФП.ДоходыБП Цикл
        НовСтрока = Таб_СпецДоход.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
        НовСтрока.Период = Формат(НовСтрока.Период, "ДФ=dd.MM.yyyy");
        НовСтрока.Сумма = Стр.СуммаБезнал + Стр.СуммаНал;
	КонецЦикла;
	Для каждого Стр Из ДокФП.ОтложенныйДоход Цикл
		Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить Тогда
	        НовСтрока = Таб_СпецДоход.Добавить();
	        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
	        НовСтрока.Период = Формат(НовСтрока.ДоДаты, "ДФ=dd.MM.yyyy");
	    КонецЕсли;
    КонецЦикла;
    Вывести_ТЗ_ВТабДок(Таб_СпецДоход, ТабДок, "Пополнение спецдохода", НастройкаОформления); 
    
    // Распределение спецдохода
    Таб_СпецДоходРаспределение = ИА_БФС.ТЗ_НоваяТаблицаЗначений("ВидДохода,Источник,ВидДоходаПолучатель,Сумма");
    Для каждого Стр Из ДокФП.ДоходыБП_Распределение Цикл
        НовСтрока = Таб_СпецДоходРаспределение.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
        НовСтрока.Сумма = Стр.СуммаБезнал + Стр.СуммаНал;
	КонецЦикла;
	Для каждого Стр Из ДокФП.ОтложенныйДоход Цикл
		Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Вернуть Тогда
	        НовСтрока = Таб_СпецДоходРаспределение.Добавить();
        	ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
	    КонецЕсли;
    КонецЦикла;
    Вывести_ТЗ_ВТабДок(Таб_СпецДоходРаспределение, ТабДок, "Распределение спецдохода", НастройкаОформления); 
    
    // Распределение с фондов
    Таб_РаспределениеСоСтатей = ИА_БФС.ТЗ_НоваяТаблицаЗначений("Статья,Подразделение,ВидДохода,Сумма");
    Для каждого Стр Из ДокФП.РаспределениеСредствСФондов Цикл
        НовСтрока = Таб_РаспределениеСоСтатей.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
        НовСтрока.Статья = Стр.Фонд;
        НовСтрока.Сумма = Стр.СуммаНал + Стр.СуммаБезНал;        
    КонецЦикла;
    Вывести_ТЗ_ВТабДок(Таб_РаспределениеСоСтатей, ТабДок, "Распределение ДС с фондов", НастройкаОформления); 
    
    ВывестиПоказательЗначение(ТабДок, "ИТОГО Доход за неделю:", ДокФП.ДоходыИтого.Итог("СуммаНал") + ДокФП.ДоходыИтого.Итог("СуммаБезНал"), НастройкаОформленияБезШапки);

    
    
    // Политика №1
    Таб_Пол1 = ИА_БФС.ТЗ_НоваяТаблицаЗначений("Статья, Сумма");
    ВремТаб = ДокФП.Политика1.Выгрузить();
    ВремТаб.Свернуть("Статья", "Сумма");
    Для каждого Стр Из ВремТаб Цикл
        НовСтрока = Таб_Пол1.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, стр);
    КонецЦикла;  
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(Таб_Пол1, "СтрокаТЗ.Сумма = 0");
    Вывести_ТЗ_ВТабДок(Таб_Пол1, ТабДок, "Отчисления с Дохода:", НастройкаОформления); 
    
    ВывестиПоказательЗначение(ТабДок, "ИТОГО Валовая прибыль за неделю:", ДокФП.ВаловаяПрибыльСуммаНал + ДокФП.ВаловаяПрибыльСуммаБезнал, НастройкаОформленияБезШапки);
    
    
    // Политика №2
    Таб_Пол2 = ИА_БФС.ТЗ_НоваяТаблицаЗначений("Статья, Сумма");
    ВремТаб = ДокФП.Политика2.Выгрузить();
    ВремТаб.Свернуть("Статья", "Сумма");
    Для каждого Стр Из ВремТаб Цикл
        НовСтрока = Таб_Пол2.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, стр);
    КонецЦикла;  
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(Таб_Пол2, "СтрокаТЗ.Сумма = 0");
    Вывести_ТЗ_ВТабДок(Таб_Пол2, ТабДок, "Отчисления с Валовой прибыли:", НастройкаОформления); 
    
    ВывестиПоказательЗначение(ТабДок, "Остаток средств к распределению:" , ДокФП.СуммаКРаспределениюНал + ДокФП.СуммаКРаспределениюБезнал, НастройкаОформленияБезШапки);
    
    
    Вывести_СКД(ДокФП, ТабДок, "СКД_ПЗП",               "Одобренные ЗП:");
    Вывести_СКД(ДокФП, ТабДок, "СКД_ЗНО",               "ЗНО:");
    Вывести_СКД(ДокФП, ТабДок, "СКД_ПеремещениеФонды",  "Перемещение, займ между фондами:");
    ТабДок.АвтоМасштаб = Истина;
    
    Возврат ТабДок;
КонецФункции

&НаСервереБезКонтекста
Процедура ВывестиПоказательЗначение(ТабДок, Показатель, Значение, НастройкаОформленияБезШапки)
    
    Вывести_ТЗ_ВТабДок(
    ИА_БФС.ТЗ_Создать("Показатель, Значение"
    , Показатель, Значение)
    , ТабДок, "", НастройкаОформленияБезШапки);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура Вывести_СКД(ДокФП, ТабДок, ИмяСКД, Заголовок)
    ДанныеСКД = ИА_БФС.СКД_Выполнить(Документы.ИА_ФинансовоеПланирование.ПолучитьМакет(ИмяСКД), Новый Структура("Ссылка", ДокФП),,,,,,1);
    
    ДанныеСКД.ТабДок.Область().СоздатьФорматСтрок();
    ВывестиЗаголовок(ТабДок, Заголовок);
    
    
    ТабДок.НачатьГруппуСтрок();
    ТабДок.Вывести(ДанныеСКД.ТабДок);
    ТабДок.ЗакончитьГруппуСтрок();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиЗаголовок(ТабДок, Заголовок, ПараметрРасшифровки = Неопределено)
    Макет = Новый ТабличныйДокумент;
    Обл = Макет.Область(2, 1, 2, 1);
    Обл.Текст = Заголовок;
    Обл.Шрифт = Новый Шрифт(,, Истина);    
    Обл.Расшифровка = ПараметрРасшифровки;
    ТабДок.Вывести(Макет);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура Вывести_ТЗ_ВТабДок(ТЗ, Табдок, Заголовок, НастройкаОформления)
    ТабДок.Вывести(иа_бфс.ТЗ_ВывестиВТабДок(ТЗ, Заголовок, Ложь, Истина, Истина,НастройкаОформления)); 		
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПослеУдаления(Элемент)
	ПересчитатьПриИзменДоходов();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьЗНО(Команда)
	ТекущиеДанные = Элементы.ТаблицаЗНО.ТекущиеДанные;
	Если (ТекущиеДанные <> Неопределено) и (ЗаказЗаполнен(ТекущиеДанные.Заказ)) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Заказ);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗНОПриАктивизацииСтроки(Элемент)
	тд = Элементы.ТаблицаЗНО.ТекущиеДанные;
	ОписаниеЗНО = "";
	Если тд <> Неопределено Тогда		
		Если  ЗначениеЗаполнено(тд.Заказ) Тогда
			ОписаниеЗНО = ПолучитьПредставлениеЗНО(тд.Заказ);	
		Иначе
			ОписаниеЗНО = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеЗНО(зно)
	ОписаниеЗНО1 = "ЗНО "+СокрЛП(зно.номер) +" от " + формат(зно.дата,"ДФ=dd.MM.yyyy")+", срок оплаты " + формат(зно.ДатаОплаты,"ДФ=dd.MM.yyyy") + Символы.ПС +  "Ситуация: " + зно.Ситуация + Символы.ПС + "Данные: " + зно.Данные + Символы.ПС + "Решение: " + зно.Решение;
	Возврат ОписаниеЗНО1;
КонецФункции

//&НаКлиенте
//Процедура УтвержденоПриИзменении(Элемент)
//	Если Объект.ИА_ФПУтверждено Тогда
//		Объект.ИА_ДатаУтвержденияФП = ТекущаяДата();
//	КонецЕсли;
//	
//	ОбновитьДоступностьПоУтверждению();
//КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьПоУтверждению()
	
	Элементы.КнопкаОбновить.Доступность = не Объект.Проведен;
	Элементы.КнопкаЗаполнитьДоходы.Доступность = не Объект.Проведен;
	Элементы.КнопкаОбновитьРаспределениеСД1.Доступность = не Объект.Проведен;
	Элементы.ПодобратьСд1.Доступность = не Объект.Проведен;
	//Элементы.ОбновитьДоходыИтого.Доступность = не Объект.Проведен;
	Элементы.Кнопка3.Доступность = не Объект.Проведен;
	Элементы.Кнопка4.Доступность = не Объект.Проведен;
	Элементы.Кнопка6.Доступность = не Объект.Проведен;
	Элементы.ДеревоЗП.КоманднаяПанель.Доступность = не Объект.Проведен;
	Элементы.РаспределениеПоФондамПогаситьЗайм.Доступность = не Объект.Проведен;
	Элементы.ДобавитьЗаймВозврат.Доступность = не Объект.Проведен;
	Элементы.ЗанятьИзОтложенногоДохода.Доступность = ДоступенЗаймИзОтлДохода и не Объект.Проведен;
	Элементы.ЗаймыДобавитьПеремещениеМеждуФондами.Доступность = не Объект.Проведен;
	Элементы.ФП1.КоманднаяПанель.Доступность = не Объект.Проведен;
	Элементы.ТаблицаЗНО.КоманднаяПанель.Доступность = не Объект.Проведен;
	Элементы.ОтложенныйДоход.КоманднаяПанель.Доступность = не Объект.Проведен;
	Элементы.ГруппаКП_Заказы.Доступность = не Объект.Проведен;
	
	Элементы.страницаДоходы.ТолькоПросмотр=  Объект.Проведен;
	Элементы.ГруппаОдобрениеЗаказов.ТолькоПросмотр = Объект.Проведен;
	Элементы.ГруппаПеремещение.ТолькоПросмотр = Объект.Проведен;
	Элементы.ГруппаПланирование.ТолькоПросмотр = Объект.Проведен;
	Элементы.ГруппаСтатистики.ТолькоПросмотр = Объект.Проведен;
	Элементы.ГруппаЛеваяДоходыиП1.ТолькоПросмотр = Объект.Проведен;
	Элементы.ГруппаПолитика2.ТолькоПросмотр = Объект.Проведен;
	Элементы.ОтложенныйДоход.ТолькоПросмотр = Объект.Проведен;
	Элементы.Дата.ТолькоПросмотр = Объект.Проведен;
	Элементы.Организация.ТолькоПросмотр = Объект.Проведен;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьКнопкиПроведения()
	Если Элементы.Найти("ФормаКнопкаПровести") <> Неопределено тогда
		Элементы.ФормаКнопкаПровести.Видимость = не объект.Проведен;
		Элементы.ФормаКнопкаПровести.Доступность = ПравоУтверждения;
	КонецЕсли;
	
	Если Элементы.Найти("ФормаКнопкаОтменаПроведения") <> Неопределено тогда
		Элементы.ФормаКнопкаОтменаПроведения.Видимость = объект.Проведен;
		Элементы.ФормаКнопкаОтменаПроведения.Доступность = ПравоУтверждения;
	КонецЕсли;
КонецПроцедуры

////////////// -ДИРЕКТИВА ФП

&НаСервере
Процедура ОбновитьИтогиПолитик()
	Элементы.ДеревоПолитикаПервичная1Сумма.ТекстПодвала =  Объект.Политика1.Итог("Сумма");
	Элементы.ДеревоПолитикаСумма.ТекстПодвала =  Объект.Политика2.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаливку1(Команда)
	Если ФП_по_ТБ и Объект.Проведен ТОгда
		ПоказатьПредупреждение(, "Необходимо сначала отменить утверждение ФП.");
        Возврат;
	КонецЕсли;
	
	ЕстьРучные = ЕстьРучныеЗначения();
	
	Если ЕстьРучные ТОгда
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаОбновитьЗаливкуЗавершение", ЭтотОбъект), "Перезаполнить значения в политиках, которые введены вручную?",РежимДиалогаВопрос.ДаНет);
	Иначе
		КомандаОбновитьЗаливкуФрагмент(ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьЗаливкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	НеОчищРучные = РезультатВопроса <> КодВозвратаДиалога.Да;
	
	КомандаОбновитьЗаливкуФрагмент(НеОчищРучные);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьЗаливкуФрагмент(Знач НеОчищРучные)
	
	ЗаполнитьДоходыИПолитикиСервер(ложь, ложь,истина,истина, истина, НеОчищРучные);
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьНеделиДоходыЧистые();
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВсеНедели(Команда)
	элементы.ПоказатьВсеНедели.Пометка = не элементы.ПоказатьВсеНедели.Пометка;
	ПоказатьНедели();
КонецПроцедуры

&НаСервере
Процедура ПоказатьНедели()
	ТолькоТек = не элементы.ПоказатьВсеНедели.Пометка;
	для сч = 1 по 14 цикл
		Элементы["ЗаливкаФондовИтогоГруппа"+сч].Видимость = (ТолькоТек и ВидимостьКолонок[сч - 1].ТекущаяНеделя) или (ВидимостьКолонок[сч - 1].Видимость и не ТолькоТек);
		Если ЭтоВеб ТОгда
			Элементы["ЗаливкаФондовИтогоГруппа"+сч].ЦветфонаЗаголовка = новый цвет();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБППриАктивизацииСтроки(Элемент)
	тд = Элементы.ДоходыБП.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	масс = Новый Массив;
	массПодр = новый Массив;
	ФильтроватьПоПодр = ИспДоходыПоПодразделениям и ЗначениеЗаполнено(тд.Подразделение);
	для каждого стр из Объект.Доходы Цикл
		Если стр.СуммаБезнал > 0 Тогда
			Если масс.Найти(стр.виддохода) = Неопределено И  стр.Подразделение = тд.Подразделение или не ФильтроватьПоПодр Тогда
				масс.Добавить(стр.виддохода);
			КонецЕсли;
			Если массПодр.Найти(стр.Подразделение) = Неопределено Тогда 
				массПодр.Добавить(стр.Подразделение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	элементы.ДоходыБП1ВидДохода.СписокВыбора.ЗагрузитьЗначения(масс);
	элементы.ДоходыБППодразделение.СписокВыбора.ЗагрузитьЗначения(массПодр);
КонецПроцедуры

&НаКлиенте
Процедура ДоходыДеревоСуммаБезналОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.ДоходыДерево.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и ЗначениеЗаполнено(ТекСтрока.ВидДохода) Тогда
		Если ИспДоходыПоПодразделениям Тогда
			Если типзнч(ТекСтрока.ВидДохода) = тип("СправочникСсылка.ИА_ВидыДоходов") ТОгда
				Данные = СформироватьОтчетРасшифровкиВидаДохода(ТекСтрока.ВидДохода, ТекСтрока.ПолучитьРодителя().ВидДохода);
			КонецЕсли;
		ИНаче
	    	Данные = СформироватьОтчетРасшифровкиВидаДохода(ТекСтрока.ВидДохода, ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка"));
		КонецЕсли;
	    
	    Если Данные.Сформирован Тогда
	    	ИА_БФКС.ТабДок_Показать(Данные.ТабДок, Данные.Заголовок);
	    Иначе
			ПоказатьПредупреждение(,"Нет данных расшифровки по виду дохода '" + ТекСтрока.ВидДохода + "'");
	    КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоходыДеревоПриИзменении(Элемент)
	СохранитьИтогиВОбъект();
	ПересчитатьПриИзменДоходов();
КонецПроцедуры

&НаКлиенте
Процедура ДоходыДеревоПослеУдаления(Элемент)
	СохранитьИтогиВОбъект();
	ПересчитатьПриИзменДоходов();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИтогиВОбъект()
	Объект.Доходы.Очистить();
	Для каждого стрПодр из ДоходыДерево.ПолучитьЭлементы() Цикл
		если ИспДоходыПоПодразделениям Тогда
			Для каждого стрДоход из стрПодр.ПолучитьЭлементы() Цикл
				Новстр = Объект.Доходы.Добавить();
				ЗаполнитьЗначенияСвойств(новстр, стрДоход);
				Новстр.Подразделение = стрПодр.ВидДохода; 
			КонецЦикла;
		ИНаче
			Новстр = Объект.Доходы.Добавить();
			ЗаполнитьЗначенияСвойств(новстр, стрПодр);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДоходыДеревоПриАктивизацииСтроки(Элемент)
	тд = элементы.ДоходыДерево.ТекущиеДанные;
	если тд<>Неопределено ТОгда
		Элементы.ДоходыДеревоСуммаБезнал.ТолькоПросмотр = типзнч(тд.Виддохода) = тип("СправочникСсылка.ИА_ЦФО");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБП1СуммаБезналПриИзменении(Элемент)
	тд = Элементы.ДоходыБП.ТекущиеДанные;
	
	МаксСумма = 0 ;
	для каждого стр из Объект.Доходы Цикл
		если стр.ВидДохода = тд.ВидДохода и стр.Подразделение = тд.Подразделение Тогда
			МаксСумма = стр.СуммаБезнал;
		КонецЕсли;
	КонецЦикла;
	
	Если тд.СуммаБезнал > МаксСумма Тогда
		тд.СуммаБезнал = МаксСумма;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаймВозврат(Команда)
	Новстр = Займы.Добавить();
	Новстр.ПричинаЗайма = ПредопределенноеЗначение("Справочник.КСУ_ПричиныЗайма.ПустаяСсылка");
	Новстр.ЗаймВозврат = ПредопределенноеЗначение("Перечисление.ИА_ЗаймВозврат.Займ");
	
	Элементы.Займы.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
	Если ИспПодразделения тогда
		ТекущийЭлемент = Элементы.ЗаймыСПодразделения;
	Иначе
		ТекущийЭлемент = Элементы.ЗаймыСФонда;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаливкаФондов_ИтогоПриАктивизацииЯчейки(Элемент)
	тд = Элементы.ЗаливкаФондов_Итого.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	Если найти(Элемент.ТекущийЭлемент.Имя , "ЗаливкаФондов_ИтогоСуммаФакт")>0 Тогда
		//Если тд.ТипСтроки <> ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ПеременныеРасходы") ИЛИ тд.ЭтоЗаголовок Тогда
		//	Элемент.ТекущийЭлемент.ТолькоПросмотр = истина;
		//КонецЕсли;
		НомерНедели = число(СтрЗаменить(Элемент.ТекущийЭлемент.Имя , "ЗаливкаФондов_ИтогоСуммаФакт", ""));
		Элемент.ТекущийЭлемент.ТолькоПросмотр = тд.ТипСтроки <> ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ПеременныеРасходы") ИЛИ тд.ЭтоЗаголовок ИЛИ НомерТекущейНедели<>НомерНедели;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФП(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОтложенныйДоходПриИзменении(Элемент)
	ПересчитатьПриИзменДоходов();
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	Новстр = Объект.ОтложенныйДоход.Добавить();
	Новстр.ТипОперации = ПредопределенноеЗначение("Перечисление.КСУ_ОперацииСОтложеннымДоходом.Отложить");
КонецПроцедуры

&НаКлиенте
Процедура ОтложенныйДоходПриАктивизацииСтроки(Элемент)
	тд = Элементы.ОтложенныйДоход.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	масс = Новый Массив;
	массПодр = новый Массив;
	ФильтроватьПоПодр = ИспДоходыПоПодразделениям и ЗначениеЗаполнено(тд.Подразделение);
	для каждого стр из Объект.Доходы Цикл
		Если стр.СуммаБезнал > 0 Тогда
			Если масс.Найти(стр.виддохода) = Неопределено И  стр.Подразделение = тд.Подразделение или не ФильтроватьПоПодр Тогда
				масс.Добавить(стр.виддохода);
			КонецЕсли;
			Если массПодр.Найти(стр.Подразделение) = Неопределено Тогда 
				массПодр.Добавить(стр.Подразделение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	элементы.ОтложенныйДоходВидДохода.СписокВыбора.ЗагрузитьЗначения(масс);
	элементы.ОтложенныйДоходПодразделение.СписокВыбора.ЗагрузитьЗначения(массПодр);
КонецПроцедуры

&НаКлиенте
Процедура ОтложенныйДоходПослеУдаления(Элемент)
	ПересчитатьПриИзменДоходов();
КонецПроцедуры

&НаКлиенте
Процедура ДоходыИтогоСуммаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.ДоходыЧистые.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено и ЗначениеЗаполнено(ТекСтрока.ВидДохода) Тогда
		Если ИспДоходыПоПодразделениям Тогда
			Если типзнч(ТекСтрока.ВидДохода) = тип("СправочникСсылка.ИА_ВидыДоходов") ТОгда
				Данные = СформироватьОтчетРасшифровкиВидаДохода(ТекСтрока.ВидДохода, ТекСтрока.ПолучитьРодителя().ВидДохода);
			КонецЕсли;
		ИНаче
	    	Данные = СформироватьОтчетРасшифровкиВидаДохода(ТекСтрока.ВидДохода, ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка"));
		КонецЕсли;
	    
	    Если Данные.Сформирован Тогда
	    	ИА_БФКС.ТабДок_Показать(Данные.ТабДок, Данные.Заголовок);
	    Иначе
			ПоказатьПредупреждение(,"Нет данных расшифровки по виду дохода '" + ТекСтрока.ВидДохода + "'");
	    КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоходыИтогоСуммаПриИзменении(Элемент)
	Модифицированность = истина;
	
	// сохраним в объект
	тд = Элементы.ДоходыЧистые.ТекущиеДанные;
	ОтбДоход = тд.ВидДохода;
	ОтбПодр = ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка");
	Если ИспДоходыПоПодразделениям Тогда
		ОтбПодр = тд.ПолучитьРодителя().ВидДохода;
	КонецЕсли;
	
	Для каждого стр из Объект.Доходы Цикл
		Если стр.ВидДохода = ОтбДоход и стр.Подразделение = ОтбПодр Тогда
			стр.СуммаБезнал = тд.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	//
	ПересчитатьПриИзменДоходов();
	
	Элементы.ДоходыИтого.Обновить();
КонецПроцедуры


&НаСервере
Процедура ОбновитьИтогоВЗаливку()
	
	ИтогоВЗаливку.Очистить();
	
	СтрИтого = ИтогоВЗаливку.Добавить();
	СтрИтого.Заголовок = "Сумма на заливку с учетом отложенного дохода";
	Для сч = 1 по КолНед Цикл
		СтрИтого["Неделя"+сч] = Объект.ДоходыИтого.Итог("Неделя"+сч);
	КонецЦикла;
	СтрИтого.Сумма = Объект.ДоходыИтого.Итог("СуммаБезнал");
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДоходыИтого()
	
	Объект.ДоходыИтого.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ДатаДок", Объект.Дата);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекМесяц", Объект.МесяцТБ);
	Запрос.УстановитьПараметр("ТекНеделя", Объект.НеделяТБ);
	Запрос.УстановитьПараметр("тзДох", Объект.Доходы.Выгрузить());
	Запрос.УстановитьПараметр("тзОтлДох", Объект.ОтложенныйДоход.Выгрузить());
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ТекНеделя КАК Неделя,
	               |	ТЗ_Доходы.Подразделение КАК Подразделение,
	               |	ТЗ_Доходы.ВидДохода КАК ВидДохода,
	               |	ТЗ_Доходы.СуммаБезнал КАК Сумма
	               |ПОМЕСТИТЬ ТЗ_Доходы
	               |ИЗ
	               |	&тзДох КАК ТЗ_Доходы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ТекНеделя КАК Неделя,
	               |	ТЗ_ОтлДоходы.Подразделение КАК Подразделение,
	               |	ТЗ_ОтлДоходы.ВидДохода КАК ВидДохода,
	               |	ВЫБОР
	               |		КОГДА ТЗ_ОтлДоходы.ТипОперации = ЗНАЧЕНИЕ(Перечисление.КСУ_ОперацииСОтложеннымДоходом.Отложить)
	               |			ТОГДА -ТЗ_ОтлДоходы.Сумма
	               |		ИНАЧЕ ТЗ_ОтлДоходы.Сумма
	               |	КОНЕЦ КАК Сумма
	               |ПОМЕСТИТЬ ТЗ_ОтлДоходы
	               |ИЗ
	               |	&тзОтлДох КАК ТЗ_ОтлДоходы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_РаспределениеНедель.Период КАК НачалоНедели
	               |ПОМЕСТИТЬ Недели
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Месяц = &ТекМесяц
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗапросДохода.ВидДохода КАК ВидДохода,
	               |	ЗапросДохода.Подразделение КАК Подразделение,
	               |	ЗапросДохода.Неделя КАК Неделя,
	               |	ЗапросДохода.ТекДок КАК ТекДок,
	               |	СУММА(ЗапросДохода.СуммаИтого) КАК СуммаИтого,
	               |	СУММА(ЗапросДохода.СуммаЧистая) КАК СуммаЧистая,
	               |	МАКСИМУМ(НомераНедель.НомерНедели) КАК НомерНедели
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КСУ_ФП_ДоходыИтогоОбороты.ВидДохода КАК ВидДохода,
	               |		КСУ_ФП_ДоходыИтогоОбороты.Подразделение КАК Подразделение,
	               |		КСУ_ФП_ДоходыИтогоОбороты.Неделя КАК Неделя,
	               |		ЛОЖЬ КАК ТекДок,
	               |		КСУ_ФП_ДоходыИтогоОбороты.СуммаОборот КАК СуммаИтого,
	               |		0 КАК СуммаЧистая
	               |	ИЗ
	               |		РегистрНакопления.КСУ_ФП_ДоходыИтого.Обороты(
	               |				,
	               |				&ДатаДок,
	               |				Регистратор,
	               |				Организация = &Организация
	               |					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК КСУ_ФП_ДоходыИтогоОбороты
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Недели КАК Недели
	               |			ПО (Недели.НачалоНедели = КСУ_ФП_ДоходыИтогоОбороты.Неделя)
	               |	ГДЕ
	               |		КСУ_ФП_ДоходыИтогоОбороты.Регистратор <> &Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ДоходыЧистыеОбороты.ВидДохода,
	               |		ДоходыЧистыеОбороты.Подразделение,
	               |		ДоходыЧистыеОбороты.Неделя,
	               |		ЛОЖЬ,
	               |		0,
	               |		ДоходыЧистыеОбороты.СуммаРасход
	               |	ИЗ
	               |		РегистрНакопления.КСУ_РаспределениеДоходовТБ.Обороты(
	               |				,
	               |				&ДатаДок,
	               |				Регистратор,
	               |				Организация = &Организация
	               |					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ДоходыЧистыеОбороты
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Недели КАК Недели
	               |			ПО (Недели.НачалоНедели = ДоходыЧистыеОбороты.Неделя)
	               |	ГДЕ
	               |		ДоходыЧистыеОбороты.Регистратор <> &Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТЗ_Доходы.ВидДохода,
	               |		ТЗ_Доходы.Подразделение,
	               |		ТЗ_Доходы.Неделя,
	               |		ИСТИНА,
	               |		ТЗ_Доходы.Сумма,
	               |		ТЗ_Доходы.Сумма
	               |	ИЗ
	               |		ТЗ_Доходы КАК ТЗ_Доходы
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТЗ_ОтлДоходы.ВидДохода,
	               |		ТЗ_ОтлДоходы.Подразделение,
	               |		ТЗ_ОтлДоходы.Неделя,
	               |		ИСТИНА,
	               |		ТЗ_ОтлДоходы.Сумма,
	               |		0
	               |	ИЗ
	               |		ТЗ_ОтлДоходы КАК ТЗ_ОтлДоходы) КАК ЗапросДохода
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИА_РаспределениеНедель.Период КАК Период,
	               |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИА_РаспределениеНедель1.Период) КАК НомерНедели
	               |		ИЗ
	               |			РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель1
	               |				ПО ИА_РаспределениеНедель.Месяц = ИА_РаспределениеНедель1.Месяц
	               |					И (ИА_РаспределениеНедель1.Период <= ИА_РаспределениеНедель.Период)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ИА_РаспределениеНедель.Период) КАК НомераНедель
	               |		ПО (НомераНедель.Период = ЗапросДохода.Неделя)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗапросДохода.ВидДохода,
	               |	ЗапросДохода.Подразделение,
	               |	ЗапросДохода.Неделя,
	               |	ЗапросДохода.ТекДок";
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для каждого стр из Рез Цикл
		Если стр.НомерНедели = null Тогда
			Сообщить("Внимание! Обнаружено нарушение распределения недель! После создания ФП изменили распределение недель. Перезаполните документ или верните распределение недель.");
			Возврат;
		КонецЕсли;
		
		СтрОтбор = Новый Структура("ВидДохода,Подразделение", стр.ВидДохода, стр.Подразделение); 
		НстрД = Объект.ДоходыИтого.НайтиСтроки(СтрОтбор);
		Если НстрД.Количество() = 0 Тогда
			Текстр = Объект.ДоходыИтого.Добавить();
			ЗаполнитьЗначенияСвойств(Текстр, стр);
		Иначе
			Текстр = НстрД[0];
		КонецЕсли;
		
		Текстр["Неделя" + стр.НомерНедели] = Текстр["Неделя" + стр.НомерНедели] + стр.СуммаИтого;
		Текстр["НеделяЧистый" + стр.НомерНедели] = Текстр["НеделяЧистый" + стр.НомерНедели] + стр.СуммаЧистая;
		Текстр["НеделяОтлож" + стр.НомерНедели] = Текстр["Неделя" + стр.НомерНедели] - Текстр["НеделяЧистый" + стр.НомерНедели];
		
		Если стр.ТекДок Тогда
			Текстр.СуммаБезнал = Текстр.СуммаБезнал + стр.СуммаИтого; 
		КонецЕсли;
	КонецЦикла;
	
	// подвал
	НомерКолонки = 1;
	ТекНедНомер = 0;
	Для НомерКолонки =1 по КолНед Цикл
		Элементы["ДоходыИтогоНеделяЧистый" + НомерКолонки].ТекстПодвала = Формат(объект.ДоходыИтого.Итог("НеделяЧистый" + НомерКолонки),"ЧДЦ=2; ЧН=");
		Элементы["ДоходыИтогоНеделяОтлож" + НомерКолонки].ТекстПодвала = Формат(объект.ДоходыИтого.Итог("НеделяОтлож" + НомерКолонки),"ЧДЦ=2; ЧН=");
		Элементы["ДоходыИтогоНеделя" + НомерКолонки].ТекстПодвала = Формат(объект.ДоходыИтого.Итог("Неделя" + НомерКолонки),"ЧДЦ=2; ЧН=");
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТБ(Команда)
	ПоказатьЗначение(, объект.ТБ);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗПВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если поле.имя <> "ДеревоЗПСтатус" и поле.имя <> "ДеревоЗПУтвержденнаяСумма" и поле.имя <> "ДеревоЗПНачислениеВФонд" 
		и поле.имя <> "ДеревоЗППричинаОтказа" и поле.имя <> "ДеревоЗПВыбрать" и поле.имя <> "ДеревоЗПСтатусНомер"  и поле.имя <> "ДеревоЗПКомментарийСФП" Тогда 
		СтандартнаяОбработка = ложь;
		КомандаОткрытьЗП(Неопределено);
		Возврат;
	КонецЕсли;
	
	тд = Элементы.ДеревоЗП.ТекущиеДанные;
	Если поле.имя = "ДеревоЗПСтатусНомер" и ЗначениеЗаполнено(тд.Заказ) и не объект.Проведен Тогда 
		СтандартнаяОбработка = ложь;
		
		ОпОп = новый ОписаниеОповещения("ЗавершениеВыбораСтатуса", ЭтотОбъект, новый Структура("идСтроки", тд.ПолучитьИдентификатор()));
		СпСтатусов = получитьДоступныеНовыеСтатусы(тд);
		ПоказатьВыборИзСписка(ОпОп, спСтатусов);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция получитьДоступныеНовыеСтатусы(тд)
	Рез = новый СписокЗначений;
	
	рез.Добавить("Одобрить");

	// возможные исходные статусы: РассмотретьНаФП, ОдобренЧастично_НетВыплат, ОдобренЧастично_ЧастичныеВыплаты, ОдобренЧастично_ВсёВыплачено 
	Если тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП") или тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ПереносНаСледующееФП") Тогда
		рез.Добавить("Отклонить");
		рез.Добавить("На следующее ФП");
	Иначе // если ранее уже одобряли, то добавим возможность закрытия
		//рез.Добавить("Закрыть")	
	КонецЕсли;
	
	Возврат рез;
КонецФункции

// Команда - строка: Одобрить, Отклонить, Закрыть
&НаКлиенте
Процедура ОбработатьСменуСтатусаСтрокиЗаказа(тд, команда, одобреннаяСумма)
	// возможные исходные статусы: РассмотретьНаФП, ОдобренЧастично_НетВыплат, ОдобренЧастично_ЧастичныеВыплаты, ОдобренЧастично_ВсёВыплачено 
	Если команда = "Одобрить" Тогда
		Если тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП") ИЛИ тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ПереносНаСледующееФП")
				ИЛИ тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_НетВыплат") Тогда
			Если одобреннаяСумма >= тд.Сумма Тогда
				тд.Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренПолностью_НетВыплат");
			Иначе
				тд.Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_НетВыплат");
			КонецЕсли;
		ИначеЕсли тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_ЧастичныеВыплаты")
				ИЛИ тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_ВсёВыплачено") Тогда
			Если одобреннаяСумма >= тд.Сумма Тогда
				тд.Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренПолностью_ЧастичныеВыплаты");
			Иначе
				тд.Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_ЧастичныеВыплаты");
			КонецЕсли;
		КонецЕсли;		
	ИначеЕсли команда = "Отклонить" Тогда // отклонение возможно только в статусе РассмотретьНаФП
		Если тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП") или тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ПереносНаСледующееФП") Тогда
			тд.Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.Отклонен");
		КонецЕсли;
	ИначеЕсли команда = "На следующее ФП" Тогда 
		Если тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП") или тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ПереносНаСледующееФП") Тогда
			тд.Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ПереносНаСледующееФП");
		КонецЕсли;
	Иначе // Закрыть
		//Если тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_ЧастичныеВыплаты") 
		//	ИЛИ тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_ВсёВыплачено") Тогда
		//	тд.Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_Закрыт"); // одобрение было, выплаты были
		//Иначе
		//	тд.Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.Закрыт"); // одобрение было, но не было выплат
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ЗавершениеВыбораСтатуса(ВыбЗн, допПарам) Экспорт
	Если ВыбЗн <> Неопределено Тогда
		тд = ДеревоЗП.НайтиПоИдентификатору(допПарам.идСтроки);
		
		ОбработатьСменуСтатусаСтрокиЗаказа(тд, ВыбЗн.Значение, тд.Сумма);
		//тд.Статус = ВыбЗн.Значение;
		
		Если СостояниеЗаказаОдобренКлиент.найти(тд.Статус)<> Неопределено тогда
			тд.УтвержденнаяСумма = тд.Сумма;
		Иначе
			тд.УтвержденнаяСумма = 0;
		КонецЕсли;
		
		тд.ОстатокПоЗаказу = тд.Сумма - тд.УтвержденнаяСумма;
		тд.СтатусНомер = НомерСтатуса(тд.Статус);
		
		ДеревоЗВСИзменение();
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ПоказатьДеталиЗаказа(Команда)
	Элементы.ГруппаОписаниеЗаказа.Видимость = истина;
	Элементы.ОписаниеЗНО.Видимость = истина;
	
	Элементы.ПоказатьДеталиЗаказа.Видимость = ложь;
	Элементы.СкрытьДеталиЗаказа.Видимость = истина;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьДеталиЗаказа(Команда)
	Элементы.ГруппаОписаниеЗаказа.Видимость = ложь;
	Элементы.ОписаниеЗНО.Видимость = ложь;
	
	Элементы.ПоказатьДеталиЗаказа.Видимость = истина;
	Элементы.СкрытьДеталиЗаказа.Видимость = ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчет(Команда)
	//табД = новый ТабличныйДокумент;
	//ОбновитьОтчетПоСотояниюФондов(истина, табД);
	//иа_бфкс.ТабДок_Показать(табД, "Движение по фондам");
	
	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ФормаОтчетПоФондам",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗПВыбратьПриИзменении(Элемент)
	
	// всем подчиненным ставим галочку
	тд = Элементы.ДеревоЗП.ТекущиеДанные;
	Для каждого стр из тд.ПолучитьЭлементы() Цикл
		стр.ВыбратьСтр = тд.ВыбратьСтр;
		Для каждого стр1 из стр.ПолучитьЭлементы() Цикл
			стр1.ВыбратьСтр = тд.ВыбратьСтр;
			
			Для каждого стр2 из стр1.ПолучитьЭлементы() Цикл
				стр2.ВыбратьСтр = тд.ВыбратьСтр;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// если галку сняли, то снимем и у родителей
	Если тд.ВыбратьСтр = ложь тогда
		ТекРод = тд.ПолучитьРодителя();
		Пока ТекРод <> Неопределено Цикл
			ТекРод.ВыбратьСтр = ложь;
			
			ТекРод = ТекРод.ПолучитьРодителя();
		КонецЦикла;
	КонецЕсли;
	
	ИзменениеГалочекВыбор();
КонецПроцедуры

&НаКлиенте
Процедура ОдобритьВыбранныеЗаказы(Команда)
	НовыйСтатусВыбранных(ДеревоЗП.ПолучитьЭлементы(), "Одобрить");
	ДеревоЗВСИзменение();
	
	ИзменениеГалочекВыбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьВыбранныеЗаказы(Команда)
	НовыйСтатусВыбранных(ДеревоЗП.ПолучитьЭлементы(), "Отклонить");
	ДеревоЗВСИзменение();
	
	ИзменениеГалочекВыбор();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеГалочекВыбор()
	Элементы.ОдобритьВыбранныеЗаказы.Доступность = ложь;
	Элементы.ОтклонитьВыбранныеЗаказы.Доступность = ложь;
	
	ОбновитьСерыйВыбор(ДеревоЗП.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура НовыйСтатусВыбранных(СтрокиДер, статус)
	Для каждого стр из СтрокиДер Цикл
		Если стр.ВыбратьСтр и ЗначениеЗаполнено(стр.Заказ) Тогда
			//стр.Статус = статус;
			Если статус = "Одобрить" Тогда
				ОбработатьСменуСтатусаСтрокиЗаказа(стр, статус, стр.Сумма);
			Иначе
				ОбработатьСменуСтатусаСтрокиЗаказа(стр, статус, 0);
			КонецЕсли;
			
			стр.СтатусНомер = НомерСтатуса(стр.Статус);
			
			Если СостояниеЗаказаОдобренКлиент.найти(стр.статус)<> Неопределено И статус = "Одобрить" тогда
				стр.УтвержденнаяСумма = стр.Сумма;
			Иначе
				стр.УтвержденнаяСумма = 0;
			КонецЕсли;
			
			стр.ОстатокПоЗаказу = стр.Сумма - стр.УтвержденнаяСумма;			
		КонецЕсли;
		
		НовыйСтатусВыбранных(стр.ПолучитьЭлементы(), статус);
		
		стр.ВыбратьСтр = ложь;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСерыйВыбор(СтрокиДер)
	Для каждого стр из СтрокиДер Цикл
		ЕстьВыб = ложь;
		ЕстьНеВыб = ложь;
		Для каждого стрПодч из стр.ПолучитьЭлементы() Цикл
			Если стрПодч.ВыбратьСтр Тогда
				ЕстьВыб = истина;
			Иначе
				ЕстьНеВыб = истина;
			КонецЕсли;
		КонецЦикла;
		
		стр.СерыйВыбор = ЕстьВыб и ЕстьНеВыб;
		
		Если ЕстьВыб и Элементы.ОдобритьВыбранныеЗаказы.Доступность = ложь тогда
			Элементы.ОдобритьВыбранныеЗаказы.Доступность = истина;
			Элементы.ОтклонитьВыбранныеЗаказы.Доступность = Истина;
		КонецЕсли;
		
		ОбновитьСерыйВыбор(стр.ПолучитьЭлементы());
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьСтатью(Команда)
	Элементы.ПоказатьСкрытьСтатью.Пометка = не Элементы.ПоказатьСкрытьСтатью.Пометка;
	Элементы.ДеревоЗПСтатья.Видимость = Элементы.ПоказатьСкрытьСтатью.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗПУтвержденнаяСуммаПриИзменении(Элемент)
	тд = Элементы.ДеревоЗП.ТекущиеДанные;
	Если тд.УтвержденнаяСумма > тд.Сумма Тогда	
		Если тд.РанееВыделено = 0 Тогда
			//тд.УтвержденнаяСумма = тд.Сумма;
			//ПоказатьПредупреждение(,"Введенная сумма превышает потребность по заказу. Если вы хотите увеличить сумму средств по заказу, вам необходимо открыть заказ и изменить его сумму.");
			ПарамФ = новый Структура("Заказ,Одобрено,ТекИд", тд.Заказ, тд.УтвержденнаяСумма, тд.ПолучитьИдентификатор());
			Оп = новый ОписаниеОповещения("ЗакрытиеФормыПревышения", ЭтотОбъект, ПарамФ);
			ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ПревышениеCуммыЗаказа", ПарамФ, ЭтаФорма,,,, оп);
			
			возврат;
		Иначе
			ТекЗаказ = тд.заказ;
			ТекУтв = тд.УтвержденнаяСумма;
			ТекИд = тд.ПолучитьИдентификатор();
			
			Оп = новый ОписаниеОповещения("ЗавершениеВыбораПриПревышении", ЭтотОбъект, Новый структура("ТекЗаказ, ТекУтв, ТекИд",ТекЗаказ, ТекУтв, ТекИд));
			ПоказатьВопрос(Оп , "Введенная сумма превышает потребность по заказу. Если вы хотите увеличить сумму средств по заказу, вам необходимо создать новый заказ с увеличенной суммой заказа. Создать копию заказа?", РежимДиалогаВопрос.ДаНет); 
			
			возврат;
		КонецЕсли;
	КонецЕсли;
	
	тд.ОстатокПоЗаказу = тд.Сумма - тд.УтвержденнаяСумма;
	ОбработатьСменуСтатусаСтрокиЗаказа(тд, "Одобрить", тд.УтвержденнаяСумма);
	тд.СтатусНомер = НомерСтатуса(тд.Статус);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УвеличитьСуммуЗаказа(заказ, сумма)
	об = заказ.ПолучитьОбъект();
	СтараяСумма = об.Сумма;
	об.Сумма = сумма;
	об.записать(РежимЗаписиДокумента.Проведение);
	
	Движение = РегистрыСведений.КСУ_ЛентаСобытий.СоздатьМенеджерЗаписи();
	Движение.ПериодСобытия = ТекущаяДата();;
	Движение.ДатаСобытия = ТекущаяДата();
	Движение.Объект = заказ;		
	Движение.Событие = "Увеличена сумма заказа + "+формат(сумма - СтараяСумма,"ЧДЦ=2")+" руб.";
	Движение.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Движение.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыПревышения(рез, дп) Экспорт
	тд = ДеревоЗП.НайтиПоИдентификатору(дп.ТекИд);
	Если рез = Истина Тогда
		УвеличитьСуммуЗаказа(дп.Заказ,дп.Одобрено);		
		тд.УтвержденнаяСумма = дп.Одобрено;
		тд.Сумма = дп.Одобрено;
		тд.ИсходнаяСумма = дп.Одобрено;
	Иначе
		тд.УтвержденнаяСумма = тд.Сумма;		
	КонецЕсли;
	
	тд.ОстатокПоЗаказу = тд.Сумма - тд.УтвержденнаяСумма;
	ОбработатьСменуСтатусаСтрокиЗаказа(тд, "Одобрить", тд.УтвержденнаяСумма);
	тд.СтатусНомер = НомерСтатуса(тд.Статус);
	
	ДеревоЗВСИзменение();
КонецПроцедуры
	
&НаКлиенте
Процедура ЗавершениеВыбораПриПревышении(ВыбЗн, дп) Экспорт
	
	тд = ДеревоЗП.НайтиПоИдентификатору(дп.ТекИд);
	
	Если ВыбЗн = КодВозвратаДиалога.Да Тогда
		Если тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_ЧастичныеВыплаты") 
			ИЛИ тд.СтатусИсходный = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_ВсёВыплачено") Тогда
			тд.Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_Закрыт"); 
		Иначе
			тд.Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.Закрыт"); 
		КонецЕсли;
		тд.УтвержденнаяСумма = 0;
		тд.ОстатокПоЗаказу = тд.Сумма;
		
		// новый заказ
		ТекРезерв = ИА_ФПСервер.ОстатокРезерва(тд.Заказ, Объект.Дата - 1); 
		ПараметрыЗаказа = Новый Структура;	             
		ПараметрыЗаказа.Вставить("ЗаказКопия", тд.Заказ);		
		ПараметрыЗаказа.Вставить("Дата", Объект.Дата - 60);
		ПараметрыЗаказа.Вставить("Сумма", дп.ТекУтв + ТекРезерв);			
		ПараметрыЗаказа.Вставить("Статус", ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП"));
		формаНовогоЗаказа = ОткрытьФорму("Документ.ИА_ЗаказНаПриобретение.Форма.ФормаДокументаУпр", ПараметрыЗаказа, ЭтаФорма,,,,Новый ОписаниеОповещения("КомандаДобавитьОбработчик",ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		тд.УтвержденнаяСумма = тд.Сумма;
		тд.ОстатокПоЗаказу = тд.Сумма - тд.УтвержденнаяСумма;
		ОбработатьСменуСтатусаСтрокиЗаказа(тд, "Одобрить", тд.УтвержденнаяСумма);
	КонецЕсли;
	
	тд.СтатусНомер = НомерСтатуса(тд.Статус);
	ДеревоЗВСИзменение();
КонецПроцедуры
	
&НаКлиенте
Функция НомерСтатуса(статус)
	нстрН = НомераСтатусовЗП.НайтиСтроки(новый Структура("статус", статус));
	возврат нстрН[0].Номер;
КонецФункции

&НаСервере
Функция НомерСтатусаСервер(статус)
	нстрН = НомераСтатусовЗП.НайтиСтроки(новый Структура("статус", статус));
	возврат нстрН[0].Номер;
КонецФункции

&НаКлиенте
Процедура ПоказатьСкрытьДеталиСостоянияФондов(Команда)
	Элементы.ПоказатьСкрытьДеталиСостоянияФондов.Пометка = не Элементы.ПоказатьСкрытьДеталиСостоянияФондов.Пометка;
	ВидимостьКол = Элементы.ПоказатьСкрытьДеталиСостоянияФондов.Пометка;
	
	Элементы.ДеревоСостояниеФондовЗарезервировано.Видимость = ВидимостьКол;
	Элементы.ДеревоСостояниеФондовИтогоНаФонде.Видимость = ВидимостьКол;
	
	Элементы.ГруппаОтчетПоСтатьям.Ширина = ?(ВидимостьКол, 60, 35);
КонецПроцедуры

&НаКлиенте
Процедура КолонкиВертикальноГоризонтально(Команда)
	//Элементы.КолонкиГоризонтально.Пометка = не Элементы.КолонкиГоризонтально.Пометка;
	//
	//Если Элементы.КолонкиГоризонтально.Пометка Тогда
	//	Элементы.ДеревоЗПГруппа1.Группировка = ГруппировкаКолонок.Горизонтальная;
	//	Элементы.ДеревоЗПГруппа2.Группировка = ГруппировкаКолонок.Горизонтальная;
	//Иначе
	//	Элементы.ДеревоЗПГруппа1.Группировка = ГруппировкаКолонок.Вертикальная;
	//	Элементы.ДеревоЗПГруппа2.Группировка = ГруппировкаКолонок.Вертикальная;
	//КонецЕсли;
	
	Элементы.ДеревоЗПГруппа1.Группировка = ГруппировкаКолонок.Горизонтальная;
	Элементы.ДеревоЗПГруппа2.Группировка = ГруппировкаКолонок.Горизонтальная;
	Элементы.КолонкиГоризонтально.Видимость = ложь;
	Элементы.КолонкиВертикально.Видимость = истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьДеталиСостоянияФондов1(Команда)
	Элементы.ПоказатьСкрытьДеталиСостоянияФондов1.Пометка = не Элементы.ПоказатьСкрытьДеталиСостоянияФондов1.Пометка;
	ВидимостьКол = Элементы.ПоказатьСкрытьДеталиСостоянияФондов1.Пометка;
	
	Элементы.ДеревоСостояниеФондовЗарезервировано1.Видимость = ВидимостьКол;
	Элементы.ДеревоСостояниеФондовИтогоНаФонде1.Видимость = ВидимостьКол;
	
	Элементы.ГруппаОтчетПоСтатьям1.Ширина = ?(ВидимостьКол, 60, 35);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура ВозвратыЗаймовПриИзменении(Элемент)
	ИзменениеЗаймовВозвратов();
	Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратыЗаймовПослеУдаления(Элемент)
	ИзменениеЗаймовВозвратов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаймыПриИзменении(Элемент)
	ИзменениеЗаймовВозвратов();
	Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаймыПослеУдаления(Элемент)
	ИзменениеЗаймовВозвратов();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеЗаймовВозвратов()
	//перенесем в объект
	Объект.РаспределениеПоФондам.Очистить();
	Для каждого стр из ВозвратыЗаймов Цикл
		Новстр = Объект.РаспределениеПоФондам.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		новстр.СуммаБезнал = стр.сумма;
		новстр.ЗаймВозврат = ПредопределенноеЗначение("Перечисление.ИА_ЗаймВозврат.Возврат");
		новстр.Фонд = стр.НаФонд;
		новстр.Подразделение = стр.НаПодразделение;
	КонецЦикла;
	
	Для каждого стр из Займы Цикл
		Новстр = Объект.РаспределениеПоФондам.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		новстр.СуммаБезнал = стр.сумма;
		новстр.Фонд = стр.НаФонд;
		новстр.Подразделение = стр.НаПодразделение;
	КонецЦикла;
	//
	
	ОбновитьОтчетССохранениемСтрокиЗакладкаЗаймы();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОтчетССохранениемСтрокиЗакладкаЗаймы()
	ПредФондПодр = Неопределено;
	ПредФондПодрРодитель = Неопределено;
	тдОстатки = Элементы.ДеревоСостояниеФондов1.ТекущиеДанные;
	Если тдОстатки <> Неопределено Тогда		
		ПредФондПодр = тдОстатки.СчетПодразделениеФонд;
		Если тдОстатки.ПолучитьРодителя() <> Неопределено Тогда		
			ПредФондПодрРодитель = тдОстатки.ПолучитьРодителя().СчетПодразделениеФонд;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьОтчетПоСотояниюФондов();
	
	Для каждого стр из ДеревоСостояниеФондов.ПолучитьЭлементы() цикл
		Элементы.ДеревоСостояниеФондов1.Развернуть(стр.получитьИдентификатор(), истина);
	КонецЦикла;
	
	ВыделитьСтрокуСостоянияЗаклЗаймы(ДеревоСостояниеФондов.ПолучитьЭлементы(), ПредФондПодр, ПредФондПодрРодитель);	
КонецПроцедуры

&НаКлиенте
Функция ВыделитьСтрокуСостоянияЗаклЗаймы(СтрокиДер, ПредФондПодр, ПредФондПодрРодитель)
	Для каждого стр из СтрокиДер Цикл
		Если стр.СчетПодразделениеФонд = ПредФондПодр Тогда
			Если ПредФондПодрРодитель <> Неопределено ТОгда
				Если стр.ПолучитьРодителя()<>Неопределено и стр.ПолучитьРодителя().СчетПодразделениеФонд = ПредФондПодрРодитель Тогда
					Элементы.ДеревоСостояниеФондов1.ТекущаяСтрока = стр.получитьИдентификатор();
					Возврат истина;
				КонецЕсли;
			Иначе
				Элементы.ДеревоСостояниеФондов1.ТекущаяСтрока = стр.получитьИдентификатор();
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ВыделитьСтрокуСостоянияЗаклЗаймы(стр.ПолучитьЭлементы(), ПредФондПодр, ПредФондПодрРодитель) Тогда 
			возврат истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ложь;
КонецФункции


&НаКлиенте
Процедура ЗанятьИзОтложенногоДохода(Команда)
	
	Записать();
	Парам = новый Структура("Док,	Организация,	ИспДоходыПоПодразделениям, 	Только1, 	ДатаОстатков, ВключитьТекДок",
				          Объект.Ссылка, Объект.Организация, ИспДоходыПоПодразделениям, ложь, Объект.Дата, истина);

	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ФормаПодбораДБПУпр", Парам,,,,, Новый ОписаниеОповещения("КомандаПодобратьОтлДоходЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьОтлДоходЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	рез = Результат;
	
	Если ТипЗнч(рез) = тип("Массив") Тогда
		Для каждого стр из рез Цикл
			Новстр = Займы.Добавить();
			Новстр.СФонда = ФондДБП;
			Если ИспПодразделения Тогда
				Если ИспДоходыПоПодразделениям тогда
					Новстр.СПодразделения = стр.Подразделение;
				Иначе
					Новстр.СПодразделения = ПодрОтлДохода();
				КонецЕсли;
			КонецЕсли;
			
			Новстр.Сумма = стр.Сумма;
			Новстр.ИсточникОтложенногоДохода = стр.Источник;			
			новстр.ЗаймВозврат = ПредопределенноеЗначение("Перечисление.ИА_ЗаймВозврат.Займ");
			Новстр.ПричинаЗайма = ПредопределенноеЗначение("Справочник.КСУ_ПричиныЗайма.ПустаяСсылка");
			
		КонецЦикла;
		
		ИзменениеЗаймовВозвратов();
		Модифицированность = истина;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодрОтлДохода()
	ПодразделениеДБП1 = Константы.ИА_ФП_ПодразделениеДоходовБП.Получить();
	возврат ПодразделениеДБП1;
КонецФункции

&НаКлиенте
Процедура ВозвратыЗаймовСуммаПриИзменении(Элемент)
	тд = Элементы.ВозвратыЗаймов.ТекущиеДанные;
	тд.ОстатокПоЗайму = тд.СуммаЗайма - тд.Сумма;
КонецПроцедуры

&НаКлиенте
Процедура ЗаймыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратыЗаймовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСостояниеФондовПриАктивизацииСтроки(Элемент)
	
	Если НеПозиционировать Тогда
		НеПозиционировать = ложь;
		возврат;
	КонецЕсли;
	
	тд = Элементы.ДеревоСостояниеФондов.ТекущиеДанные;
	
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	Если ТипЗнч(тд.СчетПодразделениеФонд) = тип("СправочникСсылка.ИА_Фонды") Тогда
		тдЗ = Элементы.ДеревоЗП.ТекущиеДанные;
		
		Если тдЗ = Неопределено Тогда
			возврат;
		КонецЕсли;
		
		Если тдЗ.Фонд = тд.СчетПодразделениеФонд Тогда
			возврат;
		КонецЕсли;
		
		ОтборФонд = тд.СчетПодразделениеФонд;
		ОтборПодр = ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка");
		ОтборСчет = ПредопределенноеЗначение("Справочник.ИА_Счета.ПустаяСсылка");
		
		текР = тд.ПолучитьРодителя();
		Если текР<>Неопределено Тогда
			Если ТипЗнч(текР.СчетПодразделениеФонд) = тип("СправочникСсылка.ИА_ЦФО") Тогда
				ОтборПодр = текР.СчетПодразделениеФонд;
			ИначеЕсли ТипЗнч(текР.СчетПодразделениеФонд) = тип("СправочникСсылка.ИА_Счета") Тогда
				ОтборСчет = текР.СчетПодразделениеФонд;
			КонецЕсли;
			
			текР1 = текР.ПолучитьРодителя();
			Если текР1<>Неопределено и ТипЗнч(текР1.СчетПодразделениеФонд) = тип("СправочникСсылка.ИА_Счета") Тогда
				ОтборСчет = текР1.СчетПодразделениеФонд;
			КонецЕсли;
		КонецЕсли;
		ДанныеЗП = новый Структура("счет, подразделение, фонд", ОтборСчет, ОтборПодр, ОтборФонд);
		НайдСтрокаФонд = НайтиСтрокуФондВДереверЗП(ДанныеЗП, ложь);			
		
		Если НайдСтрокаФонд <> Неопределено Тогда
			Элементы.ДеревоЗП.ТекущаяСтрока = НайдСтрокаФонд.получитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВнедоходныеПоступленияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

КонецПроцедуры

&НаКлиенте
Процедура ВнедоходныеПоступленияПриАктивизацииСтроки(Элемент)
	тд = Элементы.ВнедоходныеПоступления.ТекущиеДанные;
	Элементы.ДекорацияНетВДПС.Видимость = тд = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура КолонкиВертикально(Команда)
	Элементы.ДеревоЗПГруппа1.Группировка = ГруппировкаКолонок.Вертикальная;
	Элементы.ДеревоЗПГруппа2.Группировка = ГруппировкаКолонок.Вертикальная;
	Элементы.КолонкиГоризонтально.Видимость = истина;
	Элементы.КолонкиВертикально.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьТБ(Команда)
	Если ПолучитьЕстьОшибкаВерсииТБ() Тогда
		Оп = Новый ОписаниеОповещения("ЗакрытиеОшибкиВерсииТБ", ЭтотОбъект);
		ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ОшибкаВерсииТБ", , ЭтаФорма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		возврат;
	КонецЕсли;
	
	Записать(новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

&НаСервере
Процедура ОбновитьФинПоказатели(Очищать = истина)
	предТЗ = объект.ФинПоказатели.Выгрузить();
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	тз.Показатель КАК Показатель,
	               |	тз.Значение КАК Значение
	               |ПОМЕСТИТЬ предТЗ
	               |ИЗ
	               |	&тз КАК тз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_ВидыСтатистик.Ссылка КАК Показатель,
	               |	ЕСТЬNULL(предТЗ.Значение, 0) КАК Значение,
	               |	ВЫБОР
	               |		КОГДА ИА_ВидыСтатистик.ВариантПолученияДанных = ЗНАЧЕНИЕ(Перечисление.ИА_ВариантыПолученияДанныхСтатистик.ДокументомСтатистика)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ручная
	               |ИЗ
	               |	Справочник.ИА_ВидыСтатистик КАК ИА_ВидыСтатистик
	               |		ЛЕВОЕ СОЕДИНЕНИЕ предТЗ КАК предТЗ
	               |		ПО ИА_ВидыСтатистик.Ссылка = предТЗ.Показатель
	               |ГДЕ
	               |	ИА_ВидыСтатистик.Родитель = &Родитель
	               |	И ИА_ВидыСтатистик.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ВидыСтатистик.Порядок";
	Запрос.УстановитьПараметр("тз", предТЗ);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Родитель", Справочники.ИА_ВидыСтатистик.СтатистикиФП);
	ТекТЗ = Запрос.Выполнить().Выгрузить();
	
	ДерДохЧистые = РеквизитФормыВЗначение("ДоходыЧистые");
	
	// статистики из тек ФП
	Если Очищать Тогда
		
		// Валовый доход план
		НСтр = ТекТЗ.Найти(Справочники.ИА_ВидыСтатистик.ВаловойДоходПлан);
		если нстр <> Неопределено тогда
			нстр.значение = ДерДохЧистые.Строки.Итог("СуммаПлан" + НомерТекущейНедели, ложь);
		КонецЕсли;
		
		// Валовый доход факт
		НСтр = ТекТЗ.Найти(Справочники.ИА_ВидыСтатистик.ВаловойДоход);
		если нстр <> Неопределено тогда
			нстр.значение = объект.Доходы.Итог("СуммаБезнал");
		КонецЕсли;
		
		// Маржинальная прибыль
		НСтр = ТекТЗ.Найти(Справочники.ИА_ВидыСтатистик.МаржинальнаяПрибыль);
		если нстр <> Неопределено тогда
			нстр.значение = объект.МаржинальнаяПрибыль;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 6
	               |	ИА_РаспределениеНедель.Период КАК НачалоНедели,
	               |	ИА_РаспределениеНедель.КонецНедели КАК КонецНедели
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Период <= &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	тзНедели6 = запрос.Выполнить().Выгрузить();
	тзНедели6.Сортировать("НачалоНедели");
	КолНед6 = тзНедели6.Количество();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	тзНед.НачалоНедели КАК НачалоНедели
	               |ПОМЕСТИТЬ тзНед
	               |ИЗ
	               |	&тзНед КАК тзНед
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТекТЗ.Показатель КАК Показатель,
	               |	ТекТЗ.Значение КАК Значение
	               |ПОМЕСТИТЬ ТекТЗ
	               |ИЗ
	               |	&ТекТЗ КАК ТекТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Подзапрос.НеделяТБ КАК НеделяТБ,
	               |	Подзапрос.Показатель КАК Показатель,
	               |	СУММА(Подзапрос.Значение) КАК Значение
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ИА_ФинансовоеПланированиеФинПоказатели.Ссылка.НеделяТБ КАК НеделяТБ,
	               |		ИА_ФинансовоеПланированиеФинПоказатели.Показатель КАК Показатель,
	               |		ИА_ФинансовоеПланированиеФинПоказатели.Значение КАК Значение
	               |	ИЗ
	               |		Документ.ИА_ФинансовоеПланирование.ФинПоказатели КАК ИА_ФинансовоеПланированиеФинПоказатели
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ тзНед КАК тзНед
	               |			ПО (тзНед.НачалоНедели = ИА_ФинансовоеПланированиеФинПоказатели.Ссылка.НеделяТБ)
	               |	ГДЕ
	               |		ИА_ФинансовоеПланированиеФинПоказатели.Ссылка.Проведен
	               |		И ИА_ФинансовоеПланированиеФинПоказатели.Ссылка.Дата < &Дата
	               |		И ИА_ФинансовоеПланированиеФинПоказатели.Ссылка.Организация = &Организация
	               |		И НЕ(ИА_ФинансовоеПланированиеФинПоказатели.Показатель = &ПланДохода
	               |					И ИА_ФинансовоеПланированиеФинПоказатели.Ссылка.НеделяТБ = &ТекНеделяТБ)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		&ТекНеделяТБ,
	               |		ТекТЗ.Показатель,
	               |		ТекТЗ.Значение
	               |	ИЗ
	               |		ТекТЗ КАК ТекТЗ) КАК Подзапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Подзапрос.НеделяТБ,
	               |	Подзапрос.Показатель";
	Запрос.УстановитьПараметр("ТекТЗ", ТекТЗ);
	Запрос.УстановитьПараметр("тзНед", тзНедели6);
	Запрос.УстановитьПараметр("ТекНеделяТБ", объект.НеделяТБ);
	Запрос.УстановитьПараметр("Организация", объект.Организация);
	Запрос.УстановитьПараметр("ПланДохода", Справочники.ИА_ВидыСтатистик.ВаловойДоходПлан);
	ДанныеПоНеделям = запрос.Выполнить().Выгрузить();
	
	Если Очищать Тогда
		Объект.ФинПоказатели.Очистить();
		Для каждого стр из ТекТЗ Цикл
			Новстр = объект.ФинПоказатели.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр, стр);
		КонецЦикла;
	КонецЕсли;
	
	// очистка недельных показателей
	для каждого стр из объект.ФинПоказатели цикл
		для счКол = 1 по 12 цикл
			стр["Неделя"+счКол] = 0;
		КонецЦикла;
	КонецЦикла;
	
	// заполнение данными недельных показателей и видимость колонок
	ДопПарам = Новый Структура("Организация", объект.Организация);
	
	счНед = 1;
	
	для каждого стрнед из тзНедели6 Цикл
		// колонка
		ЭлКолонка = Элементы["ФинПоказателиНеделя"+счНед];		
		ЭлКолонка.Видимость = истина;
		ЭлКолонка.Заголовок = Формат(стрнед.НачалоНедели,"ДФ=dd.MM")+"-"+Формат(стрнед.КонецНедели,"ДФ=dd.MM");
		Если стрнед.НачалоНедели = объект.НеделяТБ Тогда
			ЭлКолонка.ШрифтЗаголовка = новый шрифт(ЭлКолонка.ШрифтЗаголовка,,, истина);
			ЭлКолонка.ЦветФонаЗаголовка = новый цвет(220,221,254);
			ЭлКолонка.Шрифт = новый шрифт(,,истина);
		Иначе
			ЭлКолонка.ШрифтЗаголовка = новый шрифт(ЭлКолонка.ШрифтЗаголовка,,, ложь);
			ЭлКолонка.ЦветФонаЗаголовка = новый цвет();
			ЭлКолонка.Шрифт = новый шрифт();
		КонецЕсли;
		
		// данные
		НСтрокиНед = ДанныеПоНеделям.НайтиСтроки(Новый Структура("НеделяТБ", стрнед.НачалоНедели));
		Для каждого стрДПоНед из НСтрокиНед цикл
			СтрПоказатель = Объект.ФинПоказатели.НайтиСтроки(Новый Структура("Показатель", стрДПоНед.Показатель));
			Если СтрПоказатель.количество()>0 Тогда
				СтрПоказатель[0]["Неделя"+счНед] = стрДПоНед.Значение;
			КонецЕсли;
		КонецЦикла;
		
		// авоматические статистики
		Для каждого стрСтат из объект.ФинПоказатели Цикл
			//Если стрСтат.Ручная и стрСтат.Показатель = Справочники.ИА_ВидыСтатистик.ВаловойДоходПлан Тогда
			//	
			//	ТекущееЗначениеСтатистики = ПолучитьТекПланДохода(стрнед.НачалоНедели);
			//	
			//	стрСтат["Неделя"+счНед] = ТекущееЗначениеСтатистики;
			//	Если стрнед.НачалоНедели = объект.НеделяТБ Тогда
			//		стрСтат.Значение = ТекущееЗначениеСтатистики;
			//	КонецЕсли;
			//КонецЕсли;
			
			Если не стрСтат.Ручная Тогда
				ТекущееЗначениеСтатистики = ПолучитьЗначениеСтатистики(стрСтат.Показатель, стрнед.НачалоНедели, стрнед.КонецНедели, ДопПарам);			
				стрСтат["Неделя"+счНед] = ТекущееЗначениеСтатистики;
				Если стрнед.НачалоНедели = объект.НеделяТБ Тогда
					стрСтат.Значение = ТекущееЗначениеСтатистики;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		счНед = счНед + 1;
	КонецЦикла;
	
	// скроем оставшиеся колонки
	Пока счНед <= 12 Цикл
		ЭлКолонка = Элементы["ФинПоказателиНеделя"+счНед];		
		ЭлКолонка.Видимость = ложь;
		
		счНед = счНед + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьТекПланДохода(НачалоНедели) 
	возврат 0;
КонецФункции


//&НаСервереБезКонтекста
//Функция ПолучитьПланДохода(пДатаНачала, пДатаКонца, Организация) 
//	
//	ДатаНач = НачалоДня(пДатаНачала);
//	ДатаКон = КонецДня(пДатаКонца);
//	
//	Запрос = новый запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	КСУ_РаспределениеДоходовТБОбороты.СуммаПриход КАК Количество
//	               |ИЗ
//	               |	РегистрНакопления.КСУ_РаспределениеДоходовТБ.Обороты(, , , Организация = &Организация) КАК КСУ_РаспределениеДоходовТБОбороты
//	               |ГДЕ
//	               |	КСУ_РаспределениеДоходовТБОбороты.Неделя МЕЖДУ &ДатаНАчала И &ДатаКонца";
//	Запрос.УстановитьПараметр("ДатаНАчала", ДатаНач);
//	Запрос.УстановитьПараметр("ДатаКонца", ДатаКон);
//	Запрос.УстановитьПараметр("Организация", Организация);
//	
//	тз = запрос.Выполнить().Выгрузить();
//	возврат тз.Итог("Количество");
//КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьЗначениеСтатистики(пВидСтатистики, пДатаНачала, пДатаКонца, ДопПарам) Экспорт
	
	ДатаНач = НачалоДня(пДатаНачала);
	ДатаКон = КонецДня(пДатаКонца);
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("ДатаНачала");
	Данные.Колонки.Добавить("ДатаКонца");
	Новстр = Данные.Добавить();
	Новстр.ДатаНачала = ДатаНач;
	Новстр.ДатаКонца = ДатаКон;
	СтрокаСтатистик = Новый Структура("ВидСтатистики,Аналитика1,Аналитика2,Аналитика3,Данные",пВидСтатистики, Неопределено, Неопределено, Неопределено,Данные);
	
	ТЗ = ИА_Защита_Статистика.ПолучитьТЗДанныеСтатистики(СтрокаСтатистик,ДатаНач,ДатаКон, ДопПарам);
	
	возврат тз.Итог("Количество");
КонецФункции

&НаКлиенте
Процедура ФинПоказателиЗначениеПриИзменении(Элемент)
	ОбновитьФинПоказатели(ложь);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсеРазделы(Команда)
	Для каждого стр из ЗаливкаИтого.ПолучитьЭлементы() Цикл
		Элементы.ЗаливкаФондов_Итого.Свернуть(стр.получитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеРазделы(Команда)
	Для каждого стр из ЗаливкаИтого.ПолучитьЭлементы() Цикл
		Элементы.ЗаливкаФондов_Итого.Развернуть(стр.получитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаливкаФондов_ИтогоПередРазворачиванием(Элемент, Строка, Отказ)
	ПодключитьОбработчикОжидания("ДоступностьСвернутьРазвернуть", 0.2, истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаливкаФондов_ИтогоПередСворачиванием(Элемент, Строка, Отказ)
	ПодключитьОбработчикОжидания("ДоступностьСвернутьРазвернуть", 0.2, истина);
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьСвернутьРазвернуть() Экспорт
	ЕстьСвернутые = ложь;
	Естьразвернутые = ложь;
	
	для каждого стр из ЗаливкаИтого.ПолучитьЭлементы() Цикл
		Если стр.получитьЭлементы().Количество() > 0 Тогда
			если Элементы.ЗаливкаФондов_Итого.Развернут(стр.получитьИдентификатор()) Тогда
				Естьразвернутые = истина;
			Иначе
				ЕстьСвернутые = истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ЗаливкаФондов_ИтогоРазвернутьВсеРазделы.Видимость = ЕстьСвернутые;
	Элементы.ЗаливкаФондов_ИтогоСвернутьВсеРазделы.Видимость = Естьразвернутые;
КонецПроцедуры

&НаКлиенте
Процедура Заказы_СвернутьВсеРазделы(Команда)
	ОбновлятьДоступностьСвернутьРазвернутьЗаказы = ложь;
	
	Для каждого стр из ДеревоЗП.ПолучитьЭлементы() Цикл
		Для каждого стр1 из стр.ПолучитьЭлементы() Цикл
			Элементы.ДеревоЗП.Свернуть(стр1.получитьИдентификатор());
		КонецЦикла;
		Элементы.ДеревоЗП.Свернуть(стр.получитьИдентификатор());
	КонецЦикла;
	
	Элементы.Заказы_РазвернутьВсеРазделы.Видимость = истина;
	Элементы.Заказы_СвернутьВсеРазделы.Видимость = Ложь;
	
	ОбновлятьДоступностьСвернутьРазвернутьЗаказы = истина;
КонецПроцедуры

&НаКлиенте
Процедура Заказы_РазвернутьВсеРазделы(Команда)
	ОбновлятьДоступностьСвернутьРазвернутьЗаказы = ложь;
	
	Для каждого стр из ДеревоЗП.ПолучитьЭлементы() Цикл
		//Для каждого стр1 из стр.ПолучитьЭлементы() Цикл
		//	Элементы.ДеревоЗП.Развернуть(стр1.получитьИдентификатор());
		//КонецЦикла;
		Элементы.ДеревоЗП.Развернуть(стр.получитьИдентификатор(), истина);
	КонецЦикла;
	
	Элементы.Заказы_РазвернутьВсеРазделы.Видимость = ложь;
	Элементы.Заказы_СвернутьВсеРазделы.Видимость = истина;
	
	ОбновлятьДоступностьСвернутьРазвернутьЗаказы = истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗППередРазворачиванием(Элемент, Строка, Отказ)
	Если ОбновлятьДоступностьСвернутьРазвернутьЗаказы Тогда
		ПодключитьОбработчикОжидания("ЗаказыДоступностьСвернутьРазвернуть", 0.3, истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗППередСворачиванием(Элемент, Строка, Отказ)
	Если ОбновлятьДоступностьСвернутьРазвернутьЗаказы Тогда
		ПодключитьОбработчикОжидания("ЗаказыДоступностьСвернутьРазвернуть", 0.3, истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыДоступностьСвернутьРазвернуть() Экспорт
	ЕстьСвернутые = ложь;
	Естьразвернутые = ложь;
	
	для каждого стр из ДеревоЗП.ПолучитьЭлементы() Цикл
		Если стр.получитьЭлементы().Количество() > 0 Тогда
			если Элементы.ДеревоЗП.Развернут(стр.получитьИдентификатор()) Тогда
				Естьразвернутые = истина;
			Иначе
				ЕстьСвернутые = истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Заказы_РазвернутьВсеРазделы.Видимость = ЕстьСвернутые;
	Элементы.Заказы_СвернутьВсеРазделы.Видимость = Естьразвернутые;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьКнопкиОтДохода()
	ост = ИА_ФПСервер.ПолучитьОстатокОтлДохода(объект.Дата, объект.Организация);
	элементы.ПодобратьСд2.Заголовок = "Ранее отложенные средства ( "+формат(ост, "ЧДЦ=2; ЧН=")+" руб. )";
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПеремещениеМеждуФондами(Команда)
	Новстр = Займы.Добавить();
	Новстр.ПричинаЗайма = ПредопределенноеЗначение("Справочник.КСУ_ПричиныЗайма.ПустаяСсылка");
	Новстр.ЗаймВозврат = ПредопределенноеЗначение("Перечисление.ИА_ЗаймВозврат.Перемещение");
	
	Элементы.Займы.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
	Если ИспПодразделения тогда
		ТекущийЭлемент = Элементы.ЗаймыСПодразделения;
	Иначе
		ТекущийЭлемент = Элементы.ЗаймыСФонда;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГруппироватьПоСчетамНаСервере()
	//СохранитьЗначение("КСУ_ВыводитьГруппировкуПоСчетам", ВыводитьГруппировкуПоСчетам);
	
	ЗаполнитьТаблицуЗП();
	ОбновитьОтчетПоСотояниюФондов();
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьПоСчетам(Команда)
	ВыводитьГруппировкуПоСчетам = не ВыводитьГруппировкуПоСчетам;
	Элементы.ГруппироватьПоСчетам.Пометка = ВыводитьГруппировкуПоСчетам;
	
	ГруппироватьПоСчетамНаСервере();
	ПересчитатьДерево();
	
	ЗаказыДоступностьСвернутьРазвернуть();
КонецПроцедуры

&НаКлиенте
Процедура ОтложенныйДоходСуммаПриИзменении(Элемент)
	тд = Элементы.ОтложенныйДоход.ТекущиеДанные;
	Если тд = Неопределено тогда
		возврат;
	КонецЕсли;
	
	Если тд.ТипОперации = ПредопределенноеЗначение("Перечисление.КСУ_ОперацииСОтложеннымДоходом.Отложить") Тогда
		тд.Сумма = ПроверитьСуммуОтлДохода(тд.Подразделение, тд.ВидДохода , тд.Сумма);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьСуммуОтлДохода(подр, вд, сумма)
	ДохСтроки = объект.Доходы.НайтиСтроки(Новый Структура("Подразделение,ВидДохода", подр, вд));	
	Если ДохСтроки.количество() = 0 тогда
		Сообщить("Данного вида дохода нет в таблице с доходами!");
		возврат 0;
	КонецЕсли;
	
	отл = объект.ОтложенныйДоход.Выгрузить();
	отл.Свернуть("Подразделение,ВидДохода,ТипОперации", "Сумма");
	
	отлСтроки = отл.НайтиСтроки(Новый Структура("Подразделение,ВидДохода, ТипОперации", подр, вд, Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить));	
	СуммаОткл = отлСтроки[0].Сумма;
	
	Если СуммаОткл > ДохСтроки[0].СуммаБезнал Тогда
		Сообщить("Отложенный доход превышает сам доход!");
		Возврат сумма - (СуммаОткл - ДохСтроки[0].СуммаБезнал);
	Иначе
		возврат сумма;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОтложенныйДоходТипОперацииПриИзменении(Элемент)
	тд = Элементы.ОтложенныйДоход.ТекущиеДанные;
	Если тд = Неопределено тогда
		возврат;
	КонецЕсли;
	
	тд.Сумма = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОтложенныйДоходВидДоходаПриИзменении(Элемент)
	тд = Элементы.ОтложенныйДоход.ТекущиеДанные;
	Если тд = Неопределено тогда
		возврат;
	КонецЕсли;
	
	тд.Сумма = 0;
КонецПроцедуры

&НаКлиенте
Процедура ЗаймыСФондаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	масс = новый массив;
	тд = Элементы.Займы.ТекущиеДанные;
	
	ДЛя каждого стр из ВыходнаяТаблица Цикл
		Если стр.фонд = ФондДБП Тогда
			Продолжить;
		КонецЕсли;
		
		ТекОст = стр.ПослеФП_Остаток;
		Если стр.Подразделение = тд.СПодразделения И стр.фонд = тд.СФонда Тогда
			ТекОст = ТекОст + тд.Сумма;
		КонецЕсли;
		
		Если масс.Найти(стр.фонд) = Неопределено и стр.Подразделение = тд.СПодразделения И ТекОст > 0  Тогда
			масс.Добавить(стр.фонд);
		КонецЕсли;
	КонецЦикла;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(масс);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГрафики(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОСтатусах(Команда)
	ОткрытьФорму("Документ.ИА_ЗаказНаПриобретение.Форма.ОСтатусах");
КонецПроцедуры

&НаКлиенте
Процедура ОтложенныйДоходДоДатыПриИзменении(Элемент)
	тд = Элементы.ОтложенныйДоход.ТекущиеДанные;
	Если тд.ДоДаты < объект.Дата тогда
		Сообщить("""Отложить до даты"" не может быть меньше даты текущего документа ФП");
		тд.ДоДаты = объект.Дата+60*60*24;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьНаВесьЭкранГрафики(Команда)
	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ГрафикиФинпоказателей", Новый структура("ТекстХтмл", ДанныеХТМЛ_Статистики), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура АвтоотклонениеЗаказовПослеФППриИзменении(Элемент)
	ОбновитьТекстАвтостатус();
	
	ОпОп = новый ОписаниеОповещения("ПослеВыбораЗапомнВыбор", ЭтотОбъект);
	ПоказатьВопрос(ОпОп, "Запомнить выбор для новых документов ФП?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗапомнВыбор(рез, дп) Экспорт
	Если рез = КодВозвратаДиалога.Да Тогда
		сохранитьАвтооткл(Объект.АвтоотклонениеЗаказовПослеФП);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура сохранитьАвтооткл(зн)
	Константы.КСУ_АвтоотклонениеЗаказовПослеФП.Установить(зн);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстАвтостатус()
	Элементы.ДекорацияАвтостатус.Заголовок = ?(объект.АвтоотклонениеЗаказовПослеФП, "статус ""ОТКЛОНЁН""", "статус ""ОТЛОЖЕН до СЛЕДУЮЩЕГО ФП""");
КонецПроцедуры

&НаКлиенте
Процедура ЗаймыКрайнийСрокПриИзменении(Элемент)
	тд = Элементы.Займы.ТекущиеДанные;
	Если ЗначениеЗаполнено(тд.КрайнийСрок) и тд.КрайнийСрок < объект.Дата тогда
		Сообщить("""Срок возврата"" не может быть меньше даты текущего документа ФП");
		тд.КрайнийСрок = объект.Дата+60*60*24;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СправкаАвтооклонение(Команда)
	ТекстСправки = "<html><head>
                    |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
                    |<link rel=""stylesheet"" type=""text/css"" href=""v8help://service_book/service_style"">
                    |<base href=""v8config://92b4395d-6d77-4d87-9c72-1ce2fcbbdffa/mdobject/idba69ea48-7a85-4e5a-86d8-633d0703cfdd/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">
                    |</head>
                    |<body>
                    |<div><span id=""docs-internal-guid-d88c0896-7fff-1fd3-5ae4-0e7b63508caa""><span style=""font-size: 10pt; font-family: Arial; background-color: transparent; font-variant-ligatures: normal; font-variant-east-asian: normal; font-variant-position: normal; vertical-align: baseline; white-space: pre-wrap;"">Все заказы в статусе «<img width=""16"" height=""16"" alt="""" src=""data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABAAAAAQCAYAAAAf8/9hAAAACXBIWXMAAAsTAAALEwEAmpwYAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAF3SURBVHgBnVNLTgJBFKzu+YiKkU9iQtywcGscbyAngCu4ZKU3AG8gK5ZeQU6gN2ASly5kQ2KI6ICSKD3T7XutGCRIGCuZycz0e1U1r6sFFnDXxolwURUaNQOU7UeBkO6hSnBxXEdvvl7MHrpXyHlTNKTEeXFHIJ8V8Nyv5fepoQsYjDRUjEvlE9Epoh8C26xwk9sWQSkvQSRLkWgiiTSe30yoPFSYxJayMqkG+8W/mxkOrZUKEizEPdZBt43ylo+Hg5KzsnnRyX0/QRyjIj0Hjb1duXbzzEmB5iQEahIGwaaP1MhnJRNUWTfY8EVqAs8FeJtTGF8OSdo9FRukBWeDEEpt0Ikm/yGATSgP8Xo4NnZr1oUmVZtKirY8rOM2TtB6fFmfYTAClEKLz4UdYryBZkTxZJJVTli5PzQYvupQUQ+wcJjcDzR9D2ccrAxlI/O9vTzkaAI8jTU0ueXmX4dpHhxtB2hSMo/oNbBFBj0y1uF58S/P138C9tiWVsdJDOwAAAAASUVORK5CYII="">Допущен к ФП», по которым на текущем ФП не было принято явного&nbsp;</span></span></div>
                    |<div><span><span style=""font-size: 10pt; font-family: Arial; background-color: transparent; font-variant-ligatures: normal; font-variant-east-asian: normal; font-variant-position: normal; vertical-align: baseline; white-space: pre-wrap;"">решения (статус заказа не был изменен пользователем на «<img width=""16"" height=""16"" alt="""" src=""data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABAAAAAQCAYAAAAf8/9hAAAACXBIWXMAAAsTAAALEwEAmpwYAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAFnSURBVHgBfVNLSgNBEH2JIhgEA1lINjrowsVssnUhjCcQb+AN4hG8gXqC+DmBJ0h040pmFrpQkRncuJBBAwERP2PVdFdP26anoKC6p17361dvACc+gagADijTH6DgpDqmHLwDAXxBDW0GCsiX+vC24BoWeEhlj9ePXYyu1nGeLyDhdWeC3soL+pu3hkFCwC3KN7m9vHncQnEaYc/H8mYZA5uJgAPZrANTX999DuvFH8pTRyHSGrDR5hvYf+hiqOtDUBH7bhdtNPj1C9jlfe7Ve+msCDfWglngQAsbUGYE3pmD6smr3qA5jbL2QqzByQcpLmA3mjSKjIvFiWLCYs2om5n+CY9rXvdIdHRvgw9lIfg99ySMKxY8cREql/IASrrOeIxY0+IsqsZprC0sOK9XaTQ1YDabGSE8Vr4MkT0t4ShvVVbeuMP22jMZR8VfK8shNhNfco/9M/0Lnj81HYvBxDAMLK3rxC/c3u0K6u5A0QAAAABJRU5ErkJggg=="">Отклонен», «<img width=""16"" height=""16"" alt="""" src=""data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABAAAAAQCAYAAAAf8/9hAAAACXBIWXMAAAsTAAALEwEAmpwYAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAF5SURBVHgBpVOxUsJAEH13SRgBRahsKexNSSkzVjb6C/6BLRWxopW/0A5KC0c/IR/gDOmsVHQwZEju1t1EHGSUAX1F5mZv39vN7juFJez3cAiNE1I4VUDzMxzyOUwNLqIOosV8NT80A9TdKrocOHd3NNyKgnKLazsj2JSQvlmQxWX2zkIBxl8CObmCO7eqfW+XiVrhJzA5F8kmNsxitEVEy4VUdre1X2roX8l5Nc4u1bk7LiScPNbsoemVMNrac1aSlztJHjNQhrZ2HHS9ml6bPO9E5iSD1krBd0rrk+eQIWveFsvAV97mArIh4vlr/BOaVSLKCJtCvMEIpYNhFv9BgI0l7tTKYMDGAG2gQbZwpVjbeb5F1DhCgwy13PJ6I0lfCWZK/VEHVznDeAhMTOFsbFZ2IpVnL4WVTYJAYo58xjdIase4pgRlE9uWGEV+UDnFemXI2YTJTxYmob6Z4uzbY1qEWNvRCFjkQDySC/CmYDFUhMFDB/eL+R+RgqGPNVhwFQAAAABJRU5ErkJggg=="">Одобрен» или 
                    |«<img width=""16"" height=""16"" alt="""" src=""data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABAAAAAQCAYAAAAf8/9hAAAACXBIWXMAAAsTAAALEwEAmpwYAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAHZSURBVHgBfVM7TxtBEP5274ETiGKDRGLR2FLSJcrlH4RfAF1KlJIqiIoGYURDCRWiAVHSQUkD/ANOgg4k3CAQ4nEGjMB7t8vMHg+f5WOkPd0+vsfOzAp0xP4S/ggXI0Jj1AAVuygQ0jdUCWZ/j6Pefl68/Oytoui1MCMlJgY+CZT6BDw33X5oGRrAeUNDxVhQPhH9Q/RKYMEKO8VeEZRLEkTSNRJNJJHG1Z0JlYdhJrFHWZlUg6GBfDCHQ3vlfgkWYox1sLeEykcfx9/KTi64+WDQWxAZJ4cnCeIYw9JzMDP4OV/5PDKYXNY4PjMZJ/2UJyEwKmEQfPCRG4NFgam/EvPrWZJSn2SCEZf+gx4/tXdQN3Z0i+oXgek1jbkxiepXrhDAZX4nZR1XabwQi8w6V7quYlPhmv+opKMztkNjczE35pB6usa9QRFKbbAZNU2uMt97ZUtnwCmBNRMKbl3Xxc73Icdmt6v9iJP5NtekenSqcd9CVf4cx26cYPHsWue6aAdbwgagFBb5XVjNuAe1iNqTSZJ8Hqt8cmlweatDRRig4zG5j6j5Hv5zYxWoNwrP5aUkI2oCFzcamtwyOPOY2oNb2wFq1Jm/aBrYQwZ1MrZJhd/gK7effwIj9b36F2oqtAAAAABJRU5ErkJggg=="">Отложен до следующего ФП»), автоматически получат статус «<img width=""16"" height=""16"" alt="""" src=""data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABAAAAAQCAYAAAAf8/9hAAAACXBIWXMAAAsTAAALEwEAmpwYAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAFnSURBVHgBfVNLSgNBEH2JIhgEA1lINjrowsVssnUhjCcQb+AN4hG8gXqC+DmBJ0h040pmFrpQkRncuJBBAwERP2PVdFdP26anoKC6p17361dvACc+gagADijTH6DgpDqmHLwDAXxBDW0GCsiX+vC24BoWeEhlj9ePXYyu1nGeLyDhdWeC3soL+pu3hkFCwC3KN7m9vHncQnEaYc/H8mYZA5uJgAPZrANTX999DuvFH8pTRyHSGrDR5hvYf+hiqOtDUBH7bhdtNPj1C9jlfe7Ve+msCDfWglngQAsbUGYE3pmD6smr3qA5jbL2QqzByQcpLmA3mjSKjIvFiWLCYs2om5n+CY9rXvdIdHRvgw9lIfg99ySMKxY8cREql/IASrrOeIxY0+IsqsZprC0sOK9XaTQ1YDabGSE8Vr4MkT0t4ShvVVbeuMP22jMZR8VfK8shNhNfco/9M/0Lnj81HYvBxDAMLK3rxC/c3u0K6u5A0QAAAABJRU5ErkJggg=="">Отклонен» или 
                    |«<img width=""16"" height=""16"" alt="""" src=""data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABAAAAAQCAYAAAAf8/9hAAAACXBIWXMAAAsTAAALEwEAmpwYAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAHZSURBVHgBfVM7TxtBEP5274ETiGKDRGLR2FLSJcrlH4RfAF1KlJIqiIoGYURDCRWiAVHSQUkD/ANOgg4k3CAQ4nEGjMB7t8vMHg+f5WOkPd0+vsfOzAp0xP4S/ggXI0Jj1AAVuygQ0jdUCWZ/j6Pefl68/Oytoui1MCMlJgY+CZT6BDw33X5oGRrAeUNDxVhQPhH9Q/RKYMEKO8VeEZRLEkTSNRJNJJHG1Z0JlYdhJrFHWZlUg6GBfDCHQ3vlfgkWYox1sLeEykcfx9/KTi64+WDQWxAZJ4cnCeIYw9JzMDP4OV/5PDKYXNY4PjMZJ/2UJyEwKmEQfPCRG4NFgam/EvPrWZJSn2SCEZf+gx4/tXdQN3Z0i+oXgek1jbkxiepXrhDAZX4nZR1XabwQi8w6V7quYlPhmv+opKMztkNjczE35pB6usa9QRFKbbAZNU2uMt97ZUtnwCmBNRMKbl3Xxc73Icdmt6v9iJP5NtekenSqcd9CVf4cx26cYPHsWue6aAdbwgagFBb5XVjNuAe1iNqTSZJ8Hqt8cmlweatDRRig4zG5j6j5Hv5zYxWoNwrP5aUkI2oCFzcamtwyOPOY2oNb2wFq1Jm/aBrYQwZ1MrZJhd/gK7effwIj9b36F2oqtAAAAABJRU5ErkJggg=="">Отложен до следующего ФП» в зависимости от выбранного режима.</span></span></div>
                    |
                    |
                    |</body></html>";
	ОткрытьФорму("ОбщаяФорма.КСУ_Справка", новый Структура("ТекстСправки, Заголовок", ТекстСправки, "Автостатус"));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВсеФонды(ФондДБП)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_Фонды.Ссылка КАК фонд
	               |ИЗ
	               |	Справочник.ИА_Фонды КАК ИА_Фонды
	               |ГДЕ
	               |	ИА_Фонды.ПометкаУдаления = ложь
	               |	И ИА_Фонды.Ссылка <> &ФондДБП
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_Фонды.Наименование";
	Запрос.УстановитьПараметр("ФондДБП", ФондДБП);
	тз = запрос.Выполнить().выгрузить();
	возврат тз.ВыгрузитьКолонку("Фонд");
КонецФункции

&НаКлиенте
Процедура ЗаймыНаФондНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	масс = новый массив;
	тд = Элементы.Займы.ТекущиеДанные;
	
	ВсеФонды = ПолучитьВсеФонды(ФондДБП);
	ДЛя каждого Фонд из ВсеФонды Цикл		
		масс.Добавить(Фонд);		
	КонецЦикла;
	
	Если масс.Найти(тд.НаФонд) = Неопределено  Тогда
		масс.Добавить(тд.НаФонд);
	КонецЕсли;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(масс);
КонецПроцедуры

&НаКлиенте
Процедура Доходы_ДатаНачалаПриИзменении(Элемент)
	объект.РучнойПериодДоходов = истина;
КонецПроцедуры

&НаКлиенте
Процедура АвтосборДоходовПриИзменении(Элемент)
	
	ОбновитьДокументКлиент();
	
	Если объект.АвтосборДоходов Тогда
		ПоказатьПредупреждение(,"Данные по доходам были обновлены.");
	Иначе
		ПоказатьПредупреждение(,"Данные по автоматическим доходам были очищены.");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	объект.Дата = КонецДня(ВыбранноеЗначение);
	СтандартнаяОбработка = ложь;
	ДатаПриИзменении(Неопределено);
КонецПроцедуры


