
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ДополнительныйКлючОтчета", "ЭффективностьВидовКонтакта");
	//ПараметрыФормы.Вставить("ОтчетНаименование", "Эффективность видов контакта");
	
	ОткрытьФорму("Отчет.ЭффективностьВидовКонтакта.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
