&НаКлиенте
Процедура УстановитьОтбор_Распределение1()
    ТекСтрока = Элементы.ВидыДоходов.ТекущиеДанные;
    Если ТекСтрока <> Неопределено и ЗначениеЗаполнено(ТекСтрока.ИДСтроки) Тогда
        ИДСтроки = ТекСтрока.ИДСтроки;
    Иначе
        ИДСтроки = "424242424242424242424242424242";
    КонецЕсли; 
    
    Элементы.Распределение1.ОтборСтрок = Новый ФиксированнаяСтруктура("ИДСтроки", ИДСтроки);
    
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтбораТипа_ВидыДохода()
	Если ИспДоходыПодр Тогда
		ТекСтрока = Элементы.ВидыДоходовПодр.ТекущиеДанные;
		эл = Элементы.ВидыДоходовПодрЗначение;
	Иначе
    	ТекСтрока = Элементы.ВидыДоходов.ТекущиеДанные;
		эл = Элементы.ВидыДоходовЗначение;
	КонецЕсли;
    Если ТекСтрока <> Неопределено Тогда
        Если Текстрока.СпособЗаполнения  = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Запрос") Тогда
            эл.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИА_ЗапросыДанныхФондов");
        ИначеЕсли Текстрока.СпособЗаполнения  = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Вручную") Тогда
            эл.ОграничениеТипа = Новый ОписаниеТипов("Число");
			Попытка
				Текстрока.Значение =0;
			Исключение
			КонецПопытки;
        ИначеЕсли Текстрока.СпособЗаполнения  = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.ВычисляемоеВыражение") Тогда
            эл.ОграничениеТипа = Новый ОписаниеТипов("Строка");
        Иначе
           эл.ОграничениеТипа = Новый ОписаниеТипов();
        КонецЕсли; 
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура УстановкаОтбораТипа_Распределение1()
    ТекСтрока = Элементы.Распределение1.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        Если    Текстрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.Процент")
            ИЛИ Текстрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ФиксированнаяСумма")
            ИЛИ Текстрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.РучнойВвод")
            Тогда
            Элементы.Распределение1Значение.ОграничениеТипа = Новый ОписаниеТипов("Число");
        ИначеЕсли    Текстрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ВычисляемоеВыражение") Тогда
            Элементы.Распределение1Значение.ОграничениеТипа = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0));
        Иначе
            Элементы.Распределение1Значение.ОграничениеТипа = Новый ОписаниеТипов();
        КонецЕсли; 
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	Элементы.Организация.Видимость = ПоОрганизациям;
	//
	Элементы.Распределение1Раздел.Видимость = ИспРазделы;
	Элементы.МатрицаПолитика1Раздел.Видимость = ИспРазделы;
	Элементы.Распределение2Раздел.Видимость = ИспРазделы;
	//
	ИндПарам = Константы.ИА_ФП_ИспользоватьИндивидуальныеПараметрыЗапросовВНастройке.Получить();
	Элементы.ВидыДоходовПараметрыСтр.Видимость = ИндПарам;
	Элементы.ВидыДоходовПодрПараметрыСтр.Видимость = ИндПарам;
	Элементы.Распределение1ПараметрыСтр.Видимость = ИндПарам;
	Элементы.Распределение2ПараметрыСтр.Видимость = ИндПарам;
	
	//
	Если ФП_По_ТБ Тогда
		Элементы.страницаДоходыПолитика1.Заголовок = "Расчет ТБ";		
		Элементы.Распределение1СтатьяРасходов.ТекстПодвала = "Итого по политике:";
		
		Элементы.СтраницыФормы.ОтображениеСтраниц=ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	Элементы.СтраницаПолитика2.Видимость = не ФП_По_ТБ;
	Элементы.Расходы.Видимость = ФП_По_ТБ; 
	Элементы.ПечатьТБ.Видимость = ФП_По_ТБ; 
	Элементы.ШапкаТБ.Видимость = ФП_По_ТБ; 
	Элементы.ВидыДоходовСумма.Видимость = ФП_По_ТБ;
	Элементы.МатрицаПолитика1Итого.Видимость = ФП_По_ТБ;
	//Элементы.МатрицаПолитика1ЗаполнитьСуммы.Видимость = ФП_По_ТБ;
	Элементы.МатрицаПолитика1ПоказатьСкрытьСуммы.Видимость = ФП_По_ТБ;
	
	Элементы.Распределение1Подразделение.Видимость = ИспПодразделения;
	Элементы.Распределение2Подразделение.Видимость = ИспПодразделения;
	
	Элементы.РасходыПодразделениеСтрока.Видимость =  ложь;
	Элементы.РасходыПодразделение.Видимость =  ложь;
	Если ИспПодразделения Тогда
		Если ИспДоходыПодр Тогда
			Элементы.РасходыПодразделениеСтрока.Видимость =  истина;
		Иначе
			Элементы.РасходыПодразделение.Видимость =  истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.МатрицаПолитика1Подразделение.Видимость =  ИспПодразделения и не ИспДоходыПодр;
	Элементы.МатрицаПолитика1Фонд.Видимость =  не ИспДоходыПодр;
	Элементы.МатрицаПолитика1ПодразделениеФонд.Видимость =  ИспДоходыПодр;
	
	Элементы.ВидыДоходов.Видимость = не ИспДоходыПодр;
	Элементы.ВидыДоходовПодр.Видимость = ИспДоходыПодр;
	Элементы.ГруппаКП_Доходы.Видимость = не ИспДоходыПодр;
	Элементы.ГруппаКП_ДоходыПодр.Видимость = ИспДоходыПодр;
	
	Элементы.МатрицаПолитика1ДобавитьПодразделениеВМатрицу.Видимость = ИспДоходыПодр;
	Элементы.МатрицаПолитика1ДобавитьФондВМатрицу.Видимость = ИспДоходыПодр;
	Элементы.МатрицаПолитика1Добавить.Видимость = не ИспДоходыПодр;
	
	Элементы.МатрицаПолитика1КонтекстноеМенюДобавитьПодразделениеВМатрицу.Видимость = ИспДоходыПодр;
	Элементы.МатрицаПолитика1КонтекстноеМенюДобавитьФондВМатрицу.Видимость = ИспДоходыПодр;
	Элементы.МатрицаПолитика1КонтекстноеМенюДобавитьПеремРасход.Видимость = не ИспДоходыПодр;
	
	Элементы.МатрицаПолитика1ЗаполнитьПодразделения.Видимость = ИспДоходыПодр;
	
	Элементы.ОтложенныйДоходПодразделение.Видимость = ИспДоходыПодр;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
	//	Отказ = Истина; 
	//	СтандартнаяОбработка = Ложь;
	//	возврат;
	//КонецЕсли;
	
	ФП_По_ТБ = ИА_ФП_ПовторИсп.ФП_по_ТБ(Объект.Дата);
	ПоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	ИспРазделы = Константы.ИА_ФП_ИспользоватьРазделыПолитики.Получить();
	ИспДоходыПодр = Константы.КСУ_ДоходыПоПодразделениям.Получить();
	
	ПересчитыватьСуммыПриИзменении = истина;
	
	УстановитьВидимостьЭлементов();
	
	ТекСсылка = ОБъект.Ссылка;
	Если ТекСсылка.Пустая() и Параметры.Свойство("ЗначениеКопирования") Тогда
		ТекСсылка = Параметры.ЗначениеКопирования;
	КонецЕсли;
	АдресПараметров = ПоместитьВоВременноеХранилище(ТекСсылка.ХранилищеПараметров.Получить(), ЭтаФорма.УникальныйИдентификатор);

	Если ИспДоходыПодр тогда
		Элементы.МатрицаПолитика1.Отображение = ОтображениеТаблицы.Дерево;
		ЗаполнитьДеревоДоходыПоПодразделениям();
		Элементы.РасходыПодразделениеСтрока.ТолькоПросмотр = истина;
	КонецЕсли;
	
	Если ФП_По_ТБ Тогда
		ЗаполнитьДеревоРасходы();
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ИА_БФС.ТекущийПользователь();
	Иначе
		ОбновитьНедельныеПредставленияКолонок();
		ОбновитьНадписьКнопкиОтДохода();
	КонецЕсли; 
	
	Если Элементы.Найти("КнопкаПровести") <> Неопределено тогда
		Элементы.КнопкаПровести.Доступность = (ИА_ПраваС.ЗначениеПраваТекПользователя("УтверждениеТБ") ИЛИ ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_ПолныеПрава"));
	КонецЕсли;
	Если Элементы.Найти("КнопкаОтменитьПроведение") <> Неопределено тогда
		Элементы.КнопкаОтменитьПроведение.Доступность = Элементы.КнопкаПровести.Доступность;
	КонецЕсли;
	
	ОбновитьИтогоВЗаливку();
	
	м = ИА_ФПСервер.ПолучитьОрганизацииДляОтчетов();
	Если (не объект.Организация.Пустая()) и м.найти(объект.Организация) = Неопределено тогда
		м.добавить(объект.Организация);
	КонецЕсли;
	Элементы.Организация.СписокВыбора.ЗагрузитьЗначения(м);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоДоходыПоПодразделениям() 
	
	дер = РеквизитФормыВЗначение("Доходы");	
	дер.Строки.Очистить();
	Для каждого стр из Объект.ВидыДоходов Цикл
		стрПодр = дер.Строки.Найти(стр.Подразделение, "ВидДохода");
		Если стрПодр = Неопределено Тогда
			стрПодр = дер.Строки.Добавить();
			стрПодр.ВидДохода = стр.Подразделение; 
		КонецЕсли;
		
		стрДоход = стрПодр.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(стрДоход, стр);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(дер,"Доходы");
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЛишниеПодразделения(имяТЧ, тзДоходы)
	сч = объект[имяТЧ].Количество()-1;
	Пока сч >= 0 Цикл
		Если тзДоходы.найти(объект[имяТЧ][сч].Подразделение, "Подразделение") = Неопределено Тогда
			объект[имяТЧ].удалить(сч);
		КонецЕсли;
		сч = сч -1;
	КонецЦикла;
КонецПроцедуры
	
&НаСервере
Процедура ПересчитатьРасходы()
	Объект.Маржа.Очистить();
	Объект.ИтогоКЗаливке.Очистить();
	
	тзДоходы = Объект.ДоходыИтого.Выгрузить();
	тзДоходы.Свернуть("Подразделение", "Сумма, Неделя1, Неделя2, Неделя3, Неделя4, Неделя5, Неделя6, Неделя7,Неделя8, Неделя9, Неделя10, Неделя11, Неделя12");
	
	Если ИспДоходыПодр Тогда
		ОчиститьЛишниеПодразделения("Политика1", тзДоходы);
		ОчиститьЛишниеПодразделения("УчредительскиеФонды", тзДоходы);
		ОчиститьЛишниеПодразделения("Расчет", тзДоходы);
	КонецЕсли;

	Для каждого стрПодр из тзДоходы Цикл
		
		// итого переменные расходы
		Если ИспДоходыПодр Тогда
			СтрокиП1 = объект.Политика1.НайтиСтроки(Новый Структура("Подразделение", стрПодр.Подразделение));
		Иначе
			СтрокиП1 = объект.Политика1;
		КонецЕсли;
		
		ИтогоПоПеременным = Новый Структура("Сумма, Неделя1, Неделя2, Неделя3, Неделя4, Неделя5, Неделя6, Неделя7,Неделя8, Неделя9, Неделя10, Неделя11, Неделя12", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
		для каждого стрп1 из СтрокиП1 цикл
			Для каждого КолПерем из ИтогоПоПеременным Цикл
				ИтогоПоПеременным[КолПерем.Ключ] = ИтогоПоПеременным[КолПерем.Ключ] + стрп1[КолПерем.Ключ];
			КонецЦикла;
		КонецЦикла;
		
		// Строка МАРЖА
		СтрМаржа = Объект.Маржа.Добавить();
		СтрМаржа.Подразделение = стрПодр.Подразделение;
		Для каждого Кол из ИтогоПоПеременным Цикл
			СтрМаржа[Кол.Ключ] = стрПодр[Кол.Ключ] - ИтогоПоПеременным[Кол.Ключ];
		КонецЦикла;
		
		// Учредительские фонды
		Если ИспДоходыПодр Тогда
			СтрокиУчр = объект.УчредительскиеФонды.НайтиСтроки(Новый Структура("Подразделение", стрПодр.Подразделение));
		Иначе
			СтрокиУчр = объект.УчредительскиеФонды;
		КонецЕсли;
		
		ИтогоПоУчр = Новый Структура("Сумма, Неделя1, Неделя2, Неделя3, Неделя4, Неделя5, Неделя6, Неделя7,Неделя8, Неделя9, Неделя10, Неделя11, Неделя12", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
		для каждого стрУч из СтрокиУчр цикл
			ИтогоПоТекФонду = 0;
			Для каждого Кол из ИтогоПоУчр Цикл
				стрУч[Кол.Ключ] = СтрМаржа[Кол.Ключ] / 100 * стрУч.Процент;
				ИтогоПоУчр[Кол.Ключ] = ИтогоПоУчр[Кол.Ключ] + стрУч[Кол.Ключ];
				Если Кол.Ключ <> "Сумма" Тогда
					ИтогоПоТекФонду = ИтогоПоТекФонду + стрУч[Кол.Ключ]; 
				КонецЕсли;
			КонецЦикла;
			
			Если КолНедель > 1 Тогда
				Дельта = ИтогоПоТекФонду - стрУч.Сумма;
				стрУч["Неделя" + КолНедель] = стрУч["Неделя" + КолНедель] - Дельта;
				ИтогоПоУчр["Неделя" + КолНедель] = ИтогоПоУчр["Неделя" + КолНедель] - дельта;
			КонецЕсли;
		КонецЦикла;
		
		// Строка Итого к заливке
		СтрИтог = Объект.ИтогоКЗаливке.Добавить();
		СтрИтог.Подразделение = стрПодр.Подразделение;
		Для каждого Кол из ИтогоПоУчр Цикл
			СтрИтог[Кол.Ключ] = СтрМаржа[Кол.Ключ] - ИтогоПоУчр[Кол.Ключ];
		КонецЦикла;
		
		// Постоянные расходы
		Если ИспДоходыПодр Тогда
			СтрокиПР = объект.Расчет.НайтиСтроки(Новый Структура("Подразделение", стрПодр.Подразделение));
		Иначе
			СтрокиПР = объект.Расчет;
		КонецЕсли;
		
		для каждого стрПР из СтрокиПР цикл
			ИтогоПоНеделям = 0;
			для счНед = 1 по КолНедель Цикл
				Если СтрИтог.Сумма = 0 Тогда
					стрПР["Неделя" + счНед] = 0;
				Иначе
					стрПР["Неделя" + счНед] = окр(стрПР.Сумма * (СтрИтог["Неделя" + счНед] / СтрИтог.Сумма));
				КонецЕсли;
				ИтогоПоНеделям = ИтогоПоНеделям + стрПР["Неделя" + счНед];
			КонецЦикла;
			
			// корректировка округления. Последняя неделя
			стрПР["Неделя" + КолНедель] = стрПР["Неделя" + КолНедель] + (стрПР.Сумма - ИтогоПоНеделям);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьДеревоРасходы()
	дер = РеквизитФормыВЗначение("Расходы");
	дер.строки.Очистить();
	
	тзП1 = объект.Политика1.Выгрузить();
	тзП1.Свернуть("Подразделение,Статья","Сумма, Неделя1, Неделя2, Неделя3, Неделя4, Неделя5, Неделя6, Неделя7,Неделя8, Неделя9, Неделя10, Неделя11, Неделя12");
	
	Если ИспДоходыПодр Тогда
		тзПодр = тзП1.Скопировать();
		тзПодр.Свернуть("Подразделение");
		Для каждого стрПодр из тзПодр Цикл
			СтрокаПодразделение = дер.строки.Добавить();
			СтрокаПодразделение.Подразделение = стрПодр.Подразделение;
			СтрокаПодразделение.ЭтоЗаголовок = Истина;
			
			// п1
			п1Строка = СтрокаПодразделение.строки.добавить();
			п1Строка.Подразделение = стрПодр.Подразделение; 
			п1Строка.ПодразделениеСтрока = "Переменные расходы";
			п1Строка.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы;
			п1Строка.ЭтоЗаголовок = Истина;
			
			СтрокиПодрП1 = тзП1.НайтиСтроки(Новый структура("Подразделение",стрПодр.Подразделение));
			Для каждого стр из СтрокиПодрП1 Цикл
				Новстр = п1Строка.строки.Добавить();
				Новстр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы;
				Новстр.Подразделение = стр.Подразделение;
				Новстр.Фонд = стр.Статья;
				ЗаполнитьЗначенияСвойств(Новстр, стр);
			КонецЦикла;
			
			// маржа
			мСтрока = СтрокаПодразделение.строки.добавить();
			мСтрока.Подразделение = стрПодр.Подразделение; 
			мСтрока.ПодразделениеСтрока = "Маржинальная прибыль";
			мСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль;
			мСтрока.ЭтоЗаголовок = Истина;
			СтрМПодр = Объект.Маржа.НайтиСтроки(Новый структура("Подразделение", стрПодр.Подразделение));
			Если СтрМПодр.Количество()>0 Тогда
				ЗаполнитьЗначенияСвойств(мСтрока, СтрМПодр[0]);
			КонецЕсли;
			
			// учредительские фонды
			УФСтрока = СтрокаПодразделение.строки.добавить();
			УФСтрока.Подразделение = стрПодр.Подразделение; 
			УФСтрока.ПодразделениеСтрока = "Фонды из маржи";
			УФСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды;
			УФСтрока.ЭтоЗаголовок = Истина;
			
			СтрокиПодрУФ = Объект.УчредительскиеФонды.НайтиСтроки(Новый структура("Подразделение",стрПодр.Подразделение));
			Для каждого стр из СтрокиПодрУФ Цикл
				Новстр = УФСтрока.строки.Добавить();
				Новстр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды;
				ЗаполнитьЗначенияСвойств(Новстр,Стр);
			КонецЦикла;
			
			// итого на заливку
			иСтрока = СтрокаПодразделение.строки.добавить();
			иСтрока.Подразделение = стрПодр.Подразделение; 
			иСтрока.ПодразделениеСтрока = "Итого к распределению";
			иСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ИтогКЗаливке;
			иСтрока.ЭтоЗаголовок = Истина;
			СтрИтПодр = Объект.ИтогоКЗаливке.НайтиСтроки(Новый Структура("Подразделение", стрПодр.Подразделение));
			Если СтрИтПодр.Количество()>0 Тогда
				ЗаполнитьЗначенияСвойств(иСтрока, СтрИтПодр[0]);
			КонецЕсли;
			
			
			// заливка
			ЗалСтрока = СтрокаПодразделение.строки.добавить();
			ЗалСтрока.Подразделение = стрПодр.Подразделение; 
			ЗалСтрока.ПодразделениеСтрока = "Постоянные расходы";
			ЗалСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы;
			ЗалСтрока.ЭтоЗаголовок = Истина;
			
			СтрокиПодрП2 = Объект.Расчет.НайтиСтроки(Новый структура("Подразделение",стрПодр.Подразделение));
			Для каждого стр из СтрокиПодрП2 Цикл
				Новстр = ЗалСтрока.строки.Добавить();
				Новстр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы;
				ЗаполнитьЗначенияСвойств(Новстр,Стр);
				Новстр.Подразделение = стрПодр.Подразделение; 
			КонецЦикла;
		КонецЦикла;
	Иначе
		// п1
		п1Строка = дер.строки.добавить();
		Если ИспПодразделения Тогда
			п1Строка.Подразделение = "ПЕРЕМЕННЫЕ РАСХОДЫ";
		Иначе
			п1Строка.Фонд = "ПЕРЕМЕННЫЕ РАСХОДЫ";
		КонецЕсли;
		п1Строка.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы;
		п1Строка.ЭтоЗаголовок = Истина;
			
		Для каждого стр из тзП1 Цикл
			Новстр = п1Строка.строки.Добавить();
			Новстр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПеременныеРасходы;
			Новстр.Подразделение = стр.Подразделение;
			Новстр.Фонд = стр.Статья;
			ЗаполнитьЗначенияСвойств(Новстр, стр);
		КонецЦикла;
		
		// маржа
		мСтрока = дер.строки.добавить();
		Если ИспПодразделения Тогда
			мСтрока.Подразделение = "МАРЖИНАЛЬНАЯ ПРИБЫЛЬ";
		Иначе
			мСтрока.Фонд = "МАРЖИНАЛЬНАЯ ПРИБЫЛЬ";
		КонецЕсли;
		мСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль;
		мСтрока.ЭтоЗаголовок = Истина;
		Если объект.Маржа.Количество()>0 Тогда
			ЗаполнитьЗначенияСвойств(мСтрока, объект.Маржа[0],,"Подразделение");
		КонецЕсли;
		
		// учредительские фонды
		УФСтрока = дер.строки.добавить();
		Если ИспПодразделения Тогда
			УФСтрока.Подразделение = "ФОНДЫ ИЗ МАРЖИ";
		Иначе
			УФСтрока.Фонд = "ФОНДЫ ИЗ МАРЖИ";
		КонецЕсли;
		УФСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды;
		УФСтрока.ЭтоЗаголовок = Истина;
		
		Для каждого стр из Объект.УчредительскиеФонды Цикл
			Новстр = УФСтрока.строки.Добавить();
			Новстр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.УчредительскиеФонды;
			ЗаполнитьЗначенияСвойств(Новстр,Стр);
		КонецЦикла;
		
		// итого на заливку
		иСтрока = дер.строки.добавить();
		Если ИспПодразделения Тогда
			иСтрока.Подразделение = "ИТОГО К РАСПРЕДЕЛЕНИЮ";
		Иначе
			иСтрока.Фонд = "ИТОГО К РАСПРЕДЕЛЕНИЮ";
		КонецЕсли;
		иСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ИтогКЗаливке;
		иСтрока.ЭтоЗаголовок = Истина;
		Если объект.ИтогоКЗаливке.Количество()>0 Тогда
			ЗаполнитьЗначенияСвойств(иСтрока, объект.ИтогоКЗаливке[0],,"Подразделение");
		КонецЕсли;
		
		// заливка
		ЗалСтрока = дер.строки.добавить();
		Если ИспПодразделения Тогда
			ЗалСтрока.Подразделение = "ПОСТОЯННЫЕ РАСХОДЫ";
		Иначе
			ЗалСтрока.Фонд = "ПОСТОЯННЫЕ РАСХОДЫ";
		КонецЕсли;
		ЗалСтрока.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы;
		ЗалСтрока.ЭтоЗаголовок = Истина;
		
		Для каждого стр из Объект.Расчет Цикл
			Новстр = ЗалСтрока.строки.Добавить();
			Новстр.ТипСтроки = Перечисления.КСУ_ВидыСтрокТБ.ПостоянныеРасходы;
			ЗаполнитьЗначенияСвойств(Новстр,Стр);
		КонецЦикла;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(дер,"Расходы");
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьМатрицуП1()
	СоздатьКолонкиМатрицы();
	ЗагрузитьДанныеМатрицы();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеМатрицы()
	МатрицаПолитика1Дер = РеквизитФормыВЗначение("МатрицаПолитика1");
	
	МатрицаПолитика1Дер.Строки.Очистить();
	
	тзФонды = Объект.Политика1.Выгрузить();
	тзФонды.Свернуть("Подразделение,Статья,Раздел");
	
	Для каждого стрФонд из тзФонды Цикл
		Если ИспДоходыПодр Тогда
			стрПодр = МатрицаПолитика1Дер.Строки.Найти(стрФонд.Подразделение, "Подразделение");
			Если стрПодр = Неопределено Тогда
				стрПодр = МатрицаПолитика1Дер.Строки.Добавить();
				стрПодр.Подразделение = стрФонд.Подразделение;
				стрПодр.ПодразделениеФонд = стрФонд.Подразделение;
			КонецЕсли;
			
			НовСтрФонд = стрПодр.Строки.Добавить();
		Иначе
			НовСтрФонд = МатрицаПолитика1Дер.Строки.Добавить();
		КонецЕсли;
		НовСтрФонд.Фонд = стрФонд.Статья;
		НовСтрФонд.ПодразделениеФонд = стрФонд.Статья;
		НовСтрФонд.Подразделение = стрФонд.Подразделение;
		НовСтрФонд.Раздел = стрФонд.Раздел;
		
		// колонки
		для каждого стрДоход из Объект.ВидыДоходов Цикл
			Если стрДоход.ИДСтроки = "" Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяКолСР = "СпособРасчета_"+стрДоход.ИДСтроки;	
			ИмяКолЗН = "Значение_"+стрДоход.ИДСтроки;
			ИмяКолСумма = "Сумма_"+стрДоход.ИДСтроки;
			ИмяКолКарт = "Картинка_"+стрДоход.ИДСтроки;
			ИмяКолДоступность = "Доступность_"+стрДоход.ИДСтроки;
			
			Если ИспРазделы Тогда
				отбор = новый Структура("Подразделение, Статья, ИДСтроки, Раздел", НовСтрФонд.Подразделение,НовСтрФонд.Фонд, стрДоход.ИДСтроки, НовСтрФонд.Раздел);			
			Иначе
				отбор = новый Структура("Подразделение, Статья, ИДСтроки", НовСтрФонд.Подразделение,НовСтрФонд.Фонд, стрДоход.ИДСтроки);			
			КонецЕсли;
						
			нстроки = Объект.Политика1.НайтиСтроки(отбор);
			Если нстроки.количество() > 0 Тогда							
				НовСтрФонд[ИмяКолСР] = нстроки[0].СпособРасчета;	
				НовСтрФонд[ИмяКолЗН] = нстроки[0].Значение;
				НовСтрФонд[ИмяКолСумма] = нстроки[0].Сумма;						
			КонецЕсли;
			
			Если не ЗначениеЗаполнено(НовСтрФонд[ИмяКолСР]) тогда
				НовСтрФонд[ИмяКолСР] = Перечисления.ИА_РежимРасчетаСуммы.Процент;
				НовСтрФонд[ИмяКолЗН] = 0;
			КонецЕсли;
			                                         
			НовСтрФонд[ИмяКолКарт] = НомерКартинки(НовСтрФонд[ИмяКолСР]);
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(МатрицаПолитика1Дер, "МатрицаПолитика1");
	
	АктуализироватьДоступностьМатрицы();
КонецПроцедуры

&НаСервере
Процедура АктуализироватьДоступностьМатрицы()
	доходыТЗ = объект.ВидыДоходов.Выгрузить();
	доходыТЗ.Свернуть("ВидДохода,ИДСтроки");
	
	Если ИспДоходыПодр Тогда
		Для каждого стрПодр из МатрицаПолитика1.ПолучитьЭлементы() Цикл			
			для каждого стрДоход из доходыТЗ Цикл
				Если ЗначениеЗаполнено(стрДоход.ИДСтроки) Тогда
					ИмяКолДоступность = "Доступность_"+стрДоход.ИДСтроки;
					стрПодр[ИмяКолДоступность] = ложь;
					
					нСтрДох = объект.ВидыДоходов.НайтиСтроки(новый Структура("ВидДохода, Подразделение",стрДоход.ВидДохода, стрПодр.Подразделение));
					Доступно = нСтрДох.Количество()>0;
					
					для каждого стрФонд из стрПодр.ПолучитьЭлементы() Цикл
						стрФонд[ИмяКолДоступность] = Доступно;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;			
		КонецЦикла;
	Иначе
		для каждого стрДоход из доходыТЗ Цикл
			Если ЗначениеЗаполнено(стрДоход.ИДСтроки) Тогда
				ИмяКолДоступность = "Доступность_"+стрДоход.ИДСтроки;					
				для каждого стрФонд из МатрицаПолитика1.ПолучитьЭлементы() Цикл
					стрФонд[ИмяКолДоступность] = истина;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция НомерКартинки(ср)
	если ср.Пустая() ТОгда
		возврат 0;
	ИначеЕсли ср = Перечисления.ИА_РежимРасчетаСуммы.РучнойВвод Тогда
		возврат 1;
	ИначеЕсли ср = Перечисления.ИА_РежимРасчетаСуммы.Процент Тогда
		возврат 2;
	ИначеЕсли ср = Перечисления.ИА_РежимРасчетаСуммы.ВычисляемоеВыражение Тогда
		возврат 3;
	ИначеЕсли ср = Перечисления.ИА_РежимРасчетаСуммы.ФиксированнаяСумма Тогда 
		возврат 4;
	Иначе
		возврат 0;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура СоздатьКолонкиМатрицы()
	мПол1 = РеквизитФормыВЗначение("МатрицаПолитика1");
	
	цв = новый Цвет(227, 242, 255);
	
	колонкиУдалить = новый массив;
	для каждого кол из мПол1.Колонки Цикл
		если кол.Имя <> "Подразделение" и кол.Имя <> "Фонд" и кол.Имя <> "Итого" и кол.Имя <> "Раздел" и кол.Имя <> "ПодразделениеФонд" и кол.Имя <> "ДопКолонка" Тогда
			колонкиУдалить.Добавить("МатрицаПолитика1." + кол.Имя);
			
			ид = прав(кол.Имя,32);
			Если Элементы.Найти("МатрицаПолитика1Группа"+ид)<>Неопределено Тогда
				Элементы.Удалить(Элементы["МатрицаПолитика1Группа" + ид]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НовыеРеквизиты = новый Массив;
	МассивТиповЗначение = новый массив;
	МассивТиповЗначение.Добавить(тип("Число"));
	МассивТиповЗначение.Добавить(тип("Строка"));
	квЧ =  Новый КвалификаторыЧисла(15,2,ДопустимыйЗнак.Неотрицательный);
	
	тзДоходы = объект.ВидыДоходов.Выгрузить();
	Если ИспДоходыПодр тогда		
		тзДоходы.Свернуть("ВидДохода,ИДСтроки");
	КонецЕсли;
	
	Для каждого стрВидДохода из тзДоходы Цикл
		ид = стрВидДохода.ИДСтроки;
		Если ид="" тогда 
			Продолжить;
		КонецЕсли;
		
		ИмяКолСР = "Картинка_"+ид;
		КолонкаСпРед = новый РеквизитФормы(ИмяКолСР,новый ОписаниеТипов("Число"),"МатрицаПолитика1","Способ расчета");
		НовыеРеквизиты.Добавить(КолонкаСпРед);
		
		ИмяКолСР = "СпособРасчета_"+ид;
		КолонкаСпРед = новый РеквизитФормы(ИмяКолСР,новый ОписаниеТипов("ПеречислениеСсылка.ИА_РежимРасчетаСуммы"),"МатрицаПолитика1","Способ расчета");
		НовыеРеквизиты.Добавить(КолонкаСпРед);
		
		ИмяКолЗН = "Значение_"+ид;
		КолонкаЗначение = новый РеквизитФормы(ИмяКолЗН,новый ОписаниеТипов(МассивТиповЗначение, квЧ),"МатрицаПолитика1","Правило");
		НовыеРеквизиты.Добавить(КолонкаЗначение);
		
		ИмяКолСумма = "Сумма_"+ид;
		КолонкаСумма = новый РеквизитФормы(ИмяКолСумма,новый ОписаниеТипов("Число"),"МатрицаПолитика1","Сумма");
		НовыеРеквизиты.Добавить(КолонкаСумма);
		
		ИмяКолСумма = "Доступность_"+ид;
		КолонкаСумма = новый РеквизитФормы(ИмяКолСумма,новый ОписаниеТипов("Булево"),"МатрицаПолитика1","Доступность");
		НовыеРеквизиты.Добавить(КолонкаСумма);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(НовыеРеквизиты,колонкиУдалить);
	
	// УО	
	сч = УсловноеОформление.Элементы.Количество() - 1;
	Пока сч >= 0  Цикл
		элУо = УсловноеОформление.Элементы.Получить(сч);
		Если элУо.Поля.Элементы.Количество()> 0 и найти(строка(элУо.Поля.Элементы[0].Поле), "МатрицаПолитика1") > 0 Тогда
			УсловноеОформление.Элементы.Удалить(элУо);
		КонецЕсли;		
		сч = сч -1;
	КонецЦикла;
	
	Для каждого стрВидДохода из тзДоходы Цикл
		ид = стрВидДохода.ИДСтроки;
		Если ид="" тогда 
			Продолжить;
		КонецЕсли;
		
		ИмяКолСР = "СпособРасчета_"+ид;			
		ИмяКолКарт = "Картинка_"+ид;			
		ИмяКолЗН = "Значение_"+ид;
		ИмяКолСумма = "Сумма_"+ид;
		ИмяКолДоступность = "Доступность_"+ид;
		
		//ГруппаВд = Элементы.Вставить("МатрицаПолитика1Группа"+ид, Тип("ГруппаФормы"), Элементы.МатрицаПолитика1, Элементы.МатрицаПолитика1Итого);
		ГруппаВд = Элементы.Вставить("МатрицаПолитика1Группа"+ид, Тип("ГруппаФормы"), Элементы.МатрицаПолитика1, Элементы.МатрицаПолитика1ДопКолонка);
		ГруппаВд.Вид = ВидГруппыФормы.ГруппаКолонок;
		ГруппаВд.Заголовок = стрВидДохода.ВидДохода;
		ГруппаВд.Группировка = ГруппировкаКолонок.Горизонтальная;		
		ГруппаВд.ОтображатьВШапке = истина;
		ГруппаВд.ГоризонтальноеПоложениеВШапке=ГоризонтальноеПоложениеЭлемента.Центр;
		Если не ЭтоВеб Тогда
			//ГруппаВд.ЦветФонаЗаголовка = цв;		
		КонецЕсли;	
		ГруппаВд.ШрифтЗаголовка = новый Шрифт(ГруппаВд.ШрифтЗаголовка,,,истина);
		ГруппаВд.ЦветТекстаЗаголовка = новый цвет(0,0,255);
		
		эл = СоздатьЭлементКолонку(ИмяКолЗН, ГруппаВд, цв);
		эл.УстановитьДействие("НачалоВыбора", "МатрицаЗначениеНачалоВыбора"); 
		эл.КнопкаВыбора = истина;
		эл.Ширина = 6;
		эл.РастягиватьПоГоризонтали = ложь;
		эл.ГоризонтальноеПоложениеВШапке=ГоризонтальноеПоложениеЭлемента.Центр;

		
		эл = СоздатьЭлементКолонку(ИмяКолКарт, ГруппаВд, цв);
		эл.Вид = ВидПоляФормы.ПолеКартинки;
		эл.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		эл.ГоризонтальноеПоложениеВШапке=ГоризонтальноеПоложениеЭлемента.Центр;
		эл.КартинкаЗначений = БиблиотекаКартинок.КСУ_СпособыЗаполненияПолитики1;
		эл.РастягиватьПоГоризонтали = ложь;
		эл.Ширина = 1;
		
				
		эл = СоздатьЭлементКолонку(ИмяКолСумма, ГруппаВд, цв);		
		эл.толькоПросмотр = истина;
		эл.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
		эл.УстановитьДействие("ПриИзменении", "МатрицаПолитика1СуммаПриИзменении"); 		
		//эл.Шрифт = новый Шрифт(эл.Шрифт,,,,ложь,истина);
		эл.формат = "ЧДЦ=2";
		эл.Ширина = 9;
		эл.РастягиватьПоГоризонтали = ложь;
		эл.Видимость = ФП_По_ТБ;
		эл.ТолькоПросмотр = истина;
		эл.ГоризонтальноеПоложениеВШапке=ГоризонтальноеПоложениеЭлемента.Центр;
		
		// уо
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МатрицаПолитика1." + ИмяКолДоступность); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ложь;
		ЭлементОтбора.Использование = Истина;

		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(230,230,230));
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", истина);

		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("МатрицаПолитика1" + ИмяКолСР);
		ПолеОформления.Использование = Истина;
		
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("МатрицаПолитика1" + ИмяКолКарт);
		ПолеОформления.Использование = Истина;
		
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("МатрицаПолитика1" + ИмяКолЗН);
		ПолеОформления.Использование = Истина;
		
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("МатрицаПолитика1" + ИмяКолСумма);
		ПолеОформления.Использование = Истина;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура МатрицаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока = Элементы.МатрицаПолитика1.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ид = прав(Элемент.Имя,32);
		способ = ТекСтрока["СпособРасчета_"+ид];
		Если способ = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ВычисляемоеВыражение") Тогда
		   	СтандартнаяОбработка = Ложь;      
			ПараметрыФормулы = СформироватьПараметрыФормулы(Элемент.ТекстРедактирования);
			Данные = Неопределено;
			
			ОткрытьФорму("Документ.ИА_ФП_Настройка.Форма.ФормаРедакторФормулРаспределения", 
					Новый Структура("ПараметрыФормулы", ПараметрыФормулы),ЭтаФорма,,,, 
					Новый ОписаниеОповещения("Распределение1ЗначениеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока,ИД", ТекСтрока,ид)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	    КонецЕсли; 
	КонецЕсли;       
КонецПроцедуры

&НаСервере
Функция СоздатьЭлементКолонку(ИмяКол, ГруппаВд, цв)
	НовыйЭлементФормы = Элементы.Добавить("МатрицаПолитика1" + ИмяКол, Тип("ПолеФормы"),ГруппаВд);
	НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементФормы.ПутьКДанным = "МатрицаПолитика1." + ИмяКол;
	//НовыйЭлементФормы.ЦветФонаЗаголовка = цв;
	//НовыйЭлементФормы.ЦветФонаПодвала = цв;
	НовыйЭлементФормы.АвтоМаксимальнаяШирина = ложь;
	
	возврат НовыйЭлементФормы;
КонецФункции

&НаСервере
Процедура ОбновитьНедельныеПредставленияКолонок()
	Если не ФП_По_ТБ Тогда
		возврат;
	КонецЕсли;
	
	Если Объект.ДатаНачала = дата(1,1,1) ИЛИ Объект.ДатаКонца = дата(1,1,1) ИЛИ Объект.ДатаКонца<Объект.ДатаНачала Тогда
		Возврат;
	КонецЕсли;
	
	колДней = (Объект.ДатаКонца - Объект.ДатаНачала) / (60*60*24) + 1;
	ЗапросНед = ПолучитьЗапросСНеделями();
	
	//ОбновитьНедельноеПредставлениеДоходов(ЗапросНед, ОбновитьДоходы);
	ЗапросНед.Текст = "ВЫБРАТЬ
	                  |	Недели.НачалоНедели КАК НачалоНедели,
	                  |	Недели.КонецНедели КАК КонецНедели,
	                  |	Недели.КолДней КАК КолДней
	                  |ИЗ
	                  |	Недели КАК Недели
	                  |УПОРЯДОЧИТЬ ПО
	                  |	НачалоНедели";	
		
	ТЗ = ЗапросНед.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(тз, "Тз_Недели");
	КолНедель = ТЗ.количество();
	
	ОбновитьЗаголовкиИВидимостьКолонок(ЗапросНед);
КонецПроцедуры


&НаСервере
Процедура ОбновитьЗаголовкиИВидимостьКолонок(ЗапросНед)
		
	// видимость колонок, заголовки
	для счСкр = 1 по 12 Цикл
		
		// ДОХОДЫ
		ИмяКолонкиДанных = "Неделя"+счСкр;
		Если ИспДоходыПодр Тогда
			ИмяКолонкиЭл = "ВидыДоходовПодрНеделя"+счСкр;
		Иначе
			ИмяКолонкиЭл = "ВидыДоходовНеделя"+счСкр;
		КонецЕсли;
		ИмяКолДоходыИтого = "ИтогоВЗаливкуНеделя"+счСкр;
				
		Если счСкр<=КолНедель Тогда
			Элементы[ИмяКолонкиЭл].Видимость = истина;
			Элементы[ИмяКолДоходыИтого].Видимость = истина;
			
			стрНед = Тз_Недели[счСкр-1];
			колДнейВНеделе = (стрНед.КонецНедели - стрНед.НачалоНедели) / (60*60*24) + 1;
			ЗагКолонки = формат(стрНед.НачалоНедели,"ДФ=dd.MM") + " - " + формат(стрНед.КонецНедели,"ДФ=dd.MM") + " ( "+колДнейВНеделе+" дн )";
			Элементы[ИмяКолонкиЭл].Заголовок = ЗагКолонки;
			Элементы[ИмяКолДоходыИтого].Заголовок = ЗагКолонки;
		ИНаче
			Элементы[ИмяКолонкиЭл].Видимость = ложь;
			Элементы[ИмяКолДоходыИтого].Видимость = ложь;

			для каждого стрДох из объект.ВидыДоходов Цикл
				стрДох[ИмяКолонкиДанных] = 0;
			КонецЦикла;
			для каждого стрДох из объект.ДоходыИтого Цикл
				стрДох[ИмяКолонкиДанных] = 0;
			КонецЦикла;
		КонецЕсли;
		
		Элементы[ИмяКолонкиЭл].ТекстПодвала = формат(объект.ВидыДоходов.Итог(ИмяКолонкиДанных),"ЧДЦ=0; ЧН=");
		
		// РАСХОДЫ
		
		Если счСкр > КолНедель Тогда
			для каждого стрП1 из объект.Политика1 Цикл
				стрП1[ИмяКолонкиДанных] = 0;
			КонецЦикла;
			для каждого стрП1 из объект.Маржа Цикл
				стрП1[ИмяКолонкиДанных] = 0;
			КонецЦикла;
			для каждого стрП1 из объект.УчредительскиеФонды Цикл
				стрП1[ИмяКолонкиДанных] = 0;
			КонецЦикла;
			для каждого стрП1 из объект.ИтогоКЗаливке Цикл
				стрП1[ИмяКолонкиДанных] = 0;
			КонецЦикла;
			для каждого стрП1 из объект.Расчет Цикл
				стрП1[ИмяКолонкиДанных] = 0;
			КонецЦикла;
		КонецЕсли;
			
		ИмяКолонки = "РасходыНеделя"+счСкр;
		Элементы[ИмяКолонки].Видимость = счСкр<= КолНедель;
		
		Если счСкр<=КолНедель Тогда
			ЗагКолонки = формат(стрНед.НачалоНедели,"ДФ=dd.MM") + " - " + формат(стрНед.КонецНедели,"ДФ=dd.MM")+ " ( "+колДнейВНеделе+" дн )";
			Элементы[ИмяКолонки].Заголовок = ЗагКолонки;
		ИНаче
			для каждого стрп из Расходы.ПолучитьЭлементы() Цикл
				для каждого стрФ из стрп.ПолучитьЭлементы() Цикл
					стрФ["Неделя"+счСкр] = 0;
					для каждого стрФ1 из стрФ.ПолучитьЭлементы() Цикл
						стрФ1["Неделя"+счСкр] = 0;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;	
КонецПроцедуры


&НаСервере
Функция ПолучитьЗапросСНеделями() 
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_РаспределениеНедель.Период КАК НачалоНедели,
	               |	ИА_РаспределениеНедель.КонецНедели КАК КонецНедели,
	               |	КОЛИЧЕСТВО(Периоды.Период) КАК КолДней
	               |ПОМЕСТИТЬ Недели
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_Календарь КАК Периоды
	               |		ПО (Периоды.Период МЕЖДУ ИА_РаспределениеНедель.Период И ИА_РаспределениеНедель.КонецНедели)
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Месяц = &Месяц
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_РаспределениеНедель.Период,
	               |	ИА_РаспределениеНедель.КонецНедели";
	Запрос.УстановитьПараметр("Месяц", Объект.Месяц);	
	Запрос.Выполнить();
	
	Возврат Запрос;
	
КонецФункции


&НаКлиенте
Процедура ВидыДоходовПриАктивизацииСтроки(Элемент)
    УстановитьОтбор_Распределение1();   
    УстановкаОтбораТипа_ВидыДохода();
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьФормыПоПроведению()
	
	Элементы.ГруппаКПДоходы.Доступность = не объект.Проведен;
	Элементы.ВидыДоходов.ТолькоПросмотр = объект.Проведен;
	Элементы.ВидыДоходов.КонтекстноеМеню.Доступность = не объект.Проведен;
	Элементы.ВидыДоходовНезависимыйРежим.Доступность = не объект.Проведен;
	Элементы.ВидыДоходовСбросРежима.Доступность = не объект.Проведен;
	
	Элементы.ГруппаКПДоходыПодр.Доступность = не объект.Проведен;
	Элементы.ВидыДоходовПодр.ТолькоПросмотр = объект.Проведен;
	Элементы.ВидыДоходовПодр.КонтекстноеМеню.Доступность = не объект.Проведен;
	Элементы.ВидыДоходовПодрНезависимыйРежим.Доступность = не объект.Проведен;
	Элементы.ВидыДоходовПодрСбросРежима.Доступность = не объект.Проведен;
	
	Элементы.ОтложенныйДоход.КоманднаяПанель.Доступность = не объект.Проведен;
	Элементы.ОтложенныйДоход.ТолькоПросмотр = объект.Проведен;
	
	Элементы.МатрицаПолитика1.КоманднаяПанель.Доступность = не объект.Проведен;
	Элементы.МатрицаПолитика1.ТолькоПросмотр = объект.Проведен;
	
	Элементы.Расходы.КоманднаяПанель.Доступность = не объект.Проведен;
	Элементы.Расходы.ТолькоПросмотр = объект.Проведен;
	
	Элементы.Дата.ТолькоПросмотр = объект.Проведен;
	Элементы.Организация.ТолькоПросмотр = объект.Проведен;
	Элементы.ПредставлениеМесяца.ТолькоПросмотр = объект.Проведен;

КонецПроцедуры
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#ЕСЛИ ВебКлиент ТОГДА
		ЭтоВеб = Истина;
	#КОНЕЦЕСЛИ
	
	Элементы.ГруппаТело.Доступность = ЗначениеЗаполнено(объект.Месяц);
	
	ОбновитьМатрицуП1();
	УстановитьОтбор_Распределение1();
	ОбновитьИтогиМатрицы();
	ОбновитьИтогиТаблицыДоходов();
	ОбновитьИтогиДереваДоходов();
	ОбновитьИтогиРасходов();
	
	ОбновитьВидимостьКнопкиПроведения();
	ОбновитьПредставлениеМесяца();
	ОбновитьПредставлениеДиапазона();
	
	ПоказатьНастройкиДохода = Объект.ВидыДоходов.Количество() = 0;
	ОбновитьВидимостьНастроекДохода();
	
	ДоступностьФормыПоПроведению();
	
	Если Объект.Ссылка.Пустая() и Объект.Месяц<>Дата(1,1,1) Тогда // копирование
		МесяцПриИзмененииНаСервере();
		ВидыДоходовПриИзменении(Неопределено);
	КонецЕсли;
	ПодключитьОбработчикОжидания("ПоказатьСкрытьМатрицу_Глюк", 0.3, истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьМатрицу_Глюк() Экспорт
	Элементы.ГруппаМатрицаП1.Скрыть();
	Элементы.ГруппаМатрицаП1.Показать();
КонецПроцедуры
	
&НаКлиенте
Процедура ОбновитьВидимостьНастроекДохода()
	Элементы.ВидыДоходовПоказатьСкрытьНастрокиДоходов.Пометка = ПоказатьНастройкиДохода;
	Элементы.ВидыДоходовПодрПоказатьСкрытьНастрокиДоходов.Пометка = ПоказатьНастройкиДохода;
	
	Элементы.ВидыДоходовСпособЗаполнения.Видимость = ПоказатьНастройкиДохода;
	Элементы.ВидыДоходовЗначение.Видимость = ПоказатьНастройкиДохода;
	Элементы.ВидыДоходовПараметрыСтр.Видимость = ПоказатьНастройкиДохода и ИндПарам;
	
	Элементы.ВидыДоходовПодрСпособЗаполнения.Видимость = ПоказатьНастройкиДохода;
	Элементы.ВидыДоходовПодрЗначение.Видимость = ПоказатьНастройкиДохода;
	Элементы.ВидыДоходовПодрПараметрыСтр.Видимость = ПоказатьНастройкиДохода и ИндПарам;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеМесяца()
	ПредставлениеМесяца = "";
	Если ЗначениеЗаполнено(объект.Месяц) Тогда
		ПредставлениеМесяца = Формат(объект.Месяц , "ДФ='yyyy, MMMM'");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьКнопкиПроведения()
	Если Элементы.Найти("КнопкаПровести") <> Неопределено тогда
		Элементы.КнопкаПровести.Видимость = не объект.Проведен;
	КонецЕсли;
	Если Элементы.Найти("ЗписатьТБ") <> Неопределено тогда
		Элементы.ЗписатьТБ.Видимость = не объект.Проведен;
	КонецЕсли;
	Если Элементы.Найти("КнопкаОтменитьПроведение") <> Неопределено тогда
		Элементы.КнопкаОтменитьПроведение.Видимость = объект.Проведен;
	КонецЕсли;
КонецПроцедуры
	
Функция  СформироватьУИДДохода(видДохода) Экспорт
    УИД = СтрЗаменить("m"+Сред(""+видДохода.УникальныйИдентификатор(), 2), "-", "");
    Возврат УИД;
КонецФункции

&НаКлиенте
Процедура Распределение1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    Если НоваяСтрока Тогда
        ТекСтрока = Элемент.ТекущиеДанные;
		Элемент.ТекущиеДанные.ИДСтрокиРаспределения = иа_БФКС.СформироватьУИД();
        Если ТекСтрока <> Неопределено Тогда
            ЗаполнитьЗначенияСвойств(ТекСтрока, Элемент.ОтборСтрок);
        КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовСпособЗаполненияПриИзменении(Элемент)
    УстановкаОтбораТипа_ВидыДохода();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
    ОчиститьМатрицуП1(); 
	
	Если ФП_По_ТБ и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		/////
		// Доходы
		/////
		ИтогоДоход = 0;
		ДЛя каждого стр из Объект.ВидыДоходов Цикл
			Если стр.Сумма <> (стр.Неделя1 + стр.Неделя2 + стр.Неделя3 + стр.Неделя4 + стр.Неделя5 + стр.Неделя6
				+стр.Неделя7 + стр.Неделя8 + стр.Неделя9 + стр.Неделя10 + стр.Неделя11 + стр.Неделя12) ТОгда
				ПоказатьПредупреждение(,"В строке дохода "+ стр.ВидДохода + " сумма за месяц не совпадает с суммой по неделям!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			ИтогоДоход = ИтогоДоход + стр.Сумма;
		КонецЦикла;
		
		Если ИтогоДоход = 0 и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ПоказатьПредупреждение(,"В ТБ указаны нулевые доходы или нет источников дохода вообще. Проверьте раздел доходов.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		/////
		// переменные расходы
		/////
		
		мФонды = новый Соответствие;
		ДЛя каждого стр из Объект.Политика1 Цикл
			СтрИд = строка(стр.Статья) + строка(стр.Подразделение);
			Если мФонды.Получить(СтрИд) = Неопределено тогда
				мФонды.Вставить(СтрИд, ложь);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стр.Значение) тогда
				мФонды[СтрИд] = истина;
			КонецЕсли;
			
			Если стр.Сумма <> (стр.Неделя1 + стр.Неделя2 + стр.Неделя3 + стр.Неделя4 + стр.Неделя5 + стр.Неделя6
				+стр.Неделя7 + стр.Неделя8 + стр.Неделя9 + стр.Неделя10 + стр.Неделя11 + стр.Неделя12) ТОгда
				ПоказатьПредупреждение(,"В строке переменных расходов "+ стр.Статья + " сумма за месяц не совпадает с суммой по неделям!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого КлФонд из мФонды цикл
			если КлФонд.Значение = ложь тогда
				ПоказатьПредупреждение(, "В разделе ""ПЕРМЕННЫЕ РАСХОДЫ"" обнаружены фонды без правил заливки. Каждый фонд в этом разделе должен иметь хотя бы одно правило заливки, либо он должен быть исключен из списка фондов в этом разделе.");
				Отказ = Истина;
				возврат;
			КонецЕсли;
		КонецЦикла;
		
		/////
		// постоянные расходы
		/////
		
		мФонды = новый Соответствие;
		ДЛя каждого стр из Объект.Расчет Цикл
			СтрИд = строка(стр.Фонд) + строка(стр.Подразделение);
			Если мФонды.Получить(СтрИд) = Неопределено тогда
				мФонды.Вставить(СтрИд, ложь);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стр.Сумма) тогда
				мФонды[СтрИд] = истина;
			КонецЕсли;
			
			Если стр.Сумма <> (стр.Неделя1 + стр.Неделя2 + стр.Неделя3 + стр.Неделя4 + стр.Неделя5 + стр.Неделя6
				+стр.Неделя7 + стр.Неделя8 + стр.Неделя9 + стр.Неделя10 + стр.Неделя11 + стр.Неделя12) ТОгда
				ПоказатьПредупреждение(,"В строке постоянных расходов "+ стр.Фонд + " сумма за месяц не совпадает с суммой по неделям!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого КлФонд из мФонды цикл
			если КлФонд.Значение = ложь тогда
				ПоказатьПредупреждение(, "В разделе ""ПОСТОЯННЫЕ РАСХОДЫ"" обнаружены фонды с нулевыми расходами на месяц. ТБ будет утверждена с нулями. Если вы решите исправить это, отмените ТБ, внесите правки, а затем снова утвердите ТБ.");
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		итогоДоходы = 0;
		итогоРасходы = 0;
		
		Для каждого стр из Объект.ДоходыИтого Цикл
			итогоДоходы = итогоДоходы + стр.Сумма;
		КонецЦикла;
		
		Для каждого стр из Объект.Политика1 Цикл
			итогоРасходы = итогоРасходы + стр.Сумма;
		КонецЦикла;
		
		/////
		// Фонды из маржи
		/////
		
		мФонды = новый Соответствие;
		Для каждого стр из Объект.УчредительскиеФонды Цикл
			СтрИд = строка(стр.Фонд) + строка(стр.Подразделение);
			Если мФонды.Получить(СтрИд) = Неопределено тогда
				мФонды.Вставить(СтрИд, ложь);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стр.Процент) тогда
				мФонды[СтрИд] = истина;
			КонецЕсли;
			
			итогоРасходы = итогоРасходы + стр.Сумма;
		КонецЦикла;
		
		Для каждого КлФонд из мФонды цикл
			если КлФонд.Значение = ложь тогда
				ПоказатьПредупреждение(, "В разделе ""ФОНДЫ ИЗ МАРЖИ"" обнаружены фонды без указания % от маржи. У каждый фонда в этом разделе должен быть указан % от маржи, либо он должен быть исключен из списка фондов в этом разделе.");
				Отказ = Истина;
				возврат;
			КонецЕсли;
		КонецЦикла;
		
		
		///////////////
		
		Для каждого стр из Объект.Расчет Цикл						
			итогоРасходы = итогоРасходы + стр.Сумма;
		КонецЦикла;
		
		Если итогоДоходы<>итогоРасходы Тогда
			ПоказатьПредупреждение(,"Внимание! Расходы не совпадают с доходами");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Распределение1ПриАктивизацииЯчейки(Элемент)
    УстановкаОтбораТипа_Распределение1();
КонецПроцедуры


&НаКлиенте
Процедура Распределение1ЗначениеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;	
	ид = ДополнительныеПараметры.ид;	
	Данные = Результат;
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		ТекСтрока["Значение_"+ид] = Данные.ТекстФормулы;
		//СохранитьСостояниеМатрицыП1();
		МатрицаПолитика1ПриИзменении(Неопределено);
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СформироватьПараметрыФормулы(ТекЗначение)	
    ПараметрыФормулы = Новый Структура();
	
	ПараметрыФормулы.Вставить("ТекстФормулы", ТекЗначение);
	
	Результат = Объект.ВидыДоходов.Выгрузить().ВыгрузитьКолонку("ВидДохода");	
	ПараметрыФормулы.Вставить("Доходы", результат);
	
	Результат = ИА_БФС.ТЗ2ТЗФ(Объект.Политика1.Выгрузить());	
	ПараметрыФормулы.Вставить("Политика1", Истина);
	ПараметрыФормулы.Вставить("ТаблицаПолитика1", результат);
	
	Результат = ИА_БФС.ТЗ2ТЗФ(Объект.Политика2.Выгрузить());	
	ПараметрыФормулы.Вставить("Политика2", Истина);
	ПараметрыФормулы.Вставить("ТаблицаПолитика2", результат);
	
	ПараметрыФормулы.Вставить("ФП_По_ТБ", ФП_По_ТБ);
	
    Возврат ПараметрыФормулы;

КонецФункции

&НаКлиенте
Процедура ВидыДоходовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Элемент.ТекущиеДанные.ИДСтроки = "" Тогда
		Элемент.ТекущиеДанные.ИДСтроки = иа_БФКС.СформироватьУИД();
		УстановитьОтбор_Распределение1();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    ТекСтрока = Элемент.Родитель.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
    	Если Текстрока.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.ВычисляемоеВыражение") Тогда
        	СтандартнаяОбработка = Ложь;
            
            ПараметрыФормулы = Новый Структура("ТекстФормулы, Политика1", ТекСтрока.Значение, Ложь);
			ПараметрыФормулы.Вставить("ФП_По_ТБ", ФП_По_ТБ);
			
            Данные = Неопределено;

			
            ОткрытьФорму("Документ.ИА_ФП_Настройка.Форма.ФормаРедакторФормулРаспределения", Новый Структура("ПараметрыФормулы", ПараметрыФормулы),ЭтаФорма,,,, Новый ОписаниеОповещения("ВидыДоходовЗначениеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовЗначениеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;
	
	
	Данные = Результат;
	
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		ТекСтрока.Значение = Данные.ТекстФормулы;
		ПеренестиВОбъектДоходы();
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовПараметрыСтрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока = Элемент.Родитель.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Если Текстрока.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.ВычисляемоеВыражение") ИЛИ
		 	Текстрока.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Запрос")
			Тогда  
				СтандартнаяОбработка = Ложь;
				ПолучениеПараметровИзФормы(ТекСтрока, СтрЗаменить(ТекСтрока.ИДСтроки," ", ""));	 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура Распределение1ПараметрыСтрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока = Элемент.Родитель.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Если ТекСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ВычисляемоеВыражение") Тогда 
			ПолучениеПараметровИзФормы(ТекСтрока, СтрЗаменить(ТекСтрока.ИДСтрокиРаспределения," ", ""));
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеПараметровИзФормы(ТекСтрока, ИДСтроки) 	
	ВсеПараметры = ПолучитьИзВременногоХранилища(АдресПараметров);

	Если ВсеПараметры <> Неопределено Тогда
		Если ВсеПараметры.Свойство(ИДСтроки) Тогда
			ПараметрыДляСтроки = ВсеПараметры[ИДСтроки];
		Иначе ПараметрыДляСтроки = Новый Структура; 
		КонецЕсли;
	Иначе 
		ВсеПараметры = Новый Структура;
		ПараметрыДляСтроки = Новый Структура; 
	КонецЕсли;

	Данные = Неопределено;

	ОткрытьФорму("Документ.ИА_ФП_Настройка.Форма.ФормаПараметров", Новый Структура("ЗначенияПараметров", ПараметрыДляСтроки),ЭтаФорма,,,, Новый ОписаниеОповещения("ПолучениеПараметровИзФормыЗавершение", ЭтотОбъект, Новый Структура("ВсеПараметры, ИДСтроки, ТекСтрока", ВсеПараметры, ИДСтроки, ТекСтрока)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеПараметровИзФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВсеПараметры = ДополнительныеПараметры.ВсеПараметры;
	ИДСтроки = ДополнительныеПараметры.ИДСтроки;
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;
	
	
	Данные = Результат;
	
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Если Данные.Количество() > 0 Тогда 
			СтрокаПараметров = "";
			Для Каждого ПараметрОтФормы Из Данные Цикл
				СтрокаПараметров = СтрокаПараметров + " " + ПараметрОтФормы.Ключ + ",";
			КонецЦикла;
			СтрокаПараметров = Лев(СтрокаПараметров, СтрДлина(СтрокаПараметров) - 1);
			ТекСтрока.ПараметрыСтр = СокрЛП(СтрокаПараметров);
			Модифицированность = Истина;
		Иначе 
			СтрокаПараметров = "";
		КонецЕсли; 
		ВсеПараметры.Вставить(ИДСтроки, Данные);
		ПоместитьВоВременноеХранилище(ВсеПараметры, АдресПараметров);	
		
		ПеренестиВОбъектДоходы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ФП_По_ТБ ТОгда
		Объект.Политика2.Очистить();
	КонецЕсли;
	ЗаписатьХранилищеПараметров(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьХранилищеПараметров(ТекущийОбъект) 
	
	Если ЗначениеЗаполнено(АдресПараметров) Тогда
		СохраняемыеПараметры = ПолучитьИзВременногоХранилища(АдресПараметров);
		ХранилищеПараметров = Новый ХранилищеЗначения(СохраняемыеПараметры);
		ТекущийОбъект.ХранилищеПараметров = ХранилищеПараметров;	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура Распределение2ПриАктивизацииЯчейки(Элемент)

	ТекСтрока = Элемент.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        Если    Текстрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.Процент")
            ИЛИ Текстрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ФиксированнаяСумма")
            ИЛИ Текстрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.РучнойВвод")
            Тогда
            Элементы.Распределение2Значение.ОграничениеТипа = Новый ОписаниеТипов("Число");
        ИначеЕсли    Текстрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ВычисляемоеВыражение") Тогда
            Элементы.Распределение2Значение.ОграничениеТипа = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0));
        Иначе
            Элементы.Распределение2Значение.ОграничениеТипа = Новый ОписаниеТипов();
        КонецЕсли; 
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Распределение2ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
        ТекСтрока = Элемент.ТекущиеДанные;
		ТекСтрока.ИДСтрокиРаспределения = иа_БФКС.СформироватьУИД(); 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Распределение2ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока = Элемент.Родитель.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
    	Если Текстрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ВычисляемоеВыражение") Тогда
        	СтандартнаяОбработка = Ложь;
            
            ПараметрыФормулы = Распределение2ЗначениеНачалоВыбора_СформироватьПараметрыФормулы(ТекСтрока.ПолучитьИдентификатор());

            Данные = Неопределено;

            ОткрытьФорму("Документ.ИА_ФП_Настройка.Форма.ФормаРедакторФормулРаспределения", Новый Структура("ПараметрыФормулы", ПараметрыФормулы),ЭтаФорма,,,, Новый ОписаниеОповещения("Распределение2ЗначениеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
        КонецЕсли; 
    КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура Распределение2ЗначениеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;
	
	
	Данные = Результат;
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		ТекСтрока.Значение = Данные.ТекстФормулы;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры


Функция Распределение2ЗначениеНачалоВыбора_СформироватьПараметрыФормулы(ТекСтрокаИД)
    ТекСтрока = Объект.Политика2.НайтиПоИдентификатору(ТекСтрокаИД);
    
    ПараметрыФормулы = Новый Структура;
	ПараметрыФормулы.Вставить("ТекстФормулы", ТекСтрока.Значение);
	
	Результат = Объект.ВидыДоходов.Выгрузить().ВыгрузитьКолонку("ВидДохода");	
	ПараметрыФормулы.Вставить("Доходы", результат);
	
	ПараметрыФормулы.Вставить("Политика1", истина);
	ПараметрыФормулы.Вставить("ТаблицаПолитика1", ИА_БФС.ТЗ2ТЗФ(Объект.Политика1.Выгрузить()));
		
	Результат = ИА_БФС.ТЗ2ТЗФ(Объект.Политика2.Выгрузить());
	
	ПараметрыФормулы.Вставить("Политика2", Истина);
	ПараметрыФормулы.Вставить("ТаблицаПолитика2", результат);
	
	ПараметрыФормулы.Вставить("ФП_По_ТБ", ФП_По_ТБ);
    
    Возврат ПараметрыФормулы;
КонецФункции

&НаКлиенте
Процедура Распределение2ПараметрыСтрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока = Элемент.Родитель.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Если ТекСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ВычисляемоеВыражение") 
			Тогда 
				ПолучениеПараметровИзФормы(ТекСтрока, СтрЗаменить(ТекСтрока.ИДСтрокиРаспределения," ", ""));
			КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВместеСПолитикой(Команда)
	тд = Элементы.ВидыДоходов.ТекущиеДанные;
	Если тд = Неопределено ТОгда
		возврат;
	КонецЕсли;
	
	Новстр = Объект.ВидыДоходов.Добавить();
	ЗаполнитьЗначенияСвойств(Новстр, тд);
	Новстр.ИДСтроки = иа_БФКС.СформироватьУИД();
	
	нСтроки = объект.Политика1.НайтиСтроки(Новый Структура("ИДСтроки",тд.ИДСтроки));
	Для каждого стр из нСтроки Цикл
		НовСтрП = объект.Политика1.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрП, стр);
		
		НовСтрП.ИДСтрокиРаспределения = иа_БФКС.СформироватьУИД();
		НовСтрП.ИДСтроки = Новстр.ИДСтроки;
	КонецЦикла;
	
	ВидыДоходовПриИзменении(Элементы.ВидыДоходов);
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовВидДоходаПриИзменении(Элемент)
	тд = Элементы.ВидыДоходов.ТекущиеДанные;
	Если тд = Неопределено ТОгда
		возврат;
	КонецЕсли;
	
	нСтроки = объект.Политика1.НайтиСтроки(Новый Структура("ИДСтроки",тд.ИДСтроки));
	Для каждого стр из нСтроки Цикл
		стр.ВидДохода = тд.ВидДохода;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМатрицуКлиент()
	ОчиститьМатрицуП1();
	ОбновитьМатрицуП1();
	ОбновитьИтогиМатрицы();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьМатрицуП1()
	сч = 0;
    Пока сч < Объект.Политика1.Количество() Цикл
    	Стр = Объект.Политика1[сч];
        
        Если Объект.ВидыДоходов.НайтиСтроки(Новый Структура("ИДСтроки", Стр.ИДСтроки)).Количество() = 0   Тогда
        	Объект.Политика1.Удалить(сч);
        Иначе
            сч = сч + 1;
        КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура ВидыДоходовПослеУдаления(Элемент)
	ПеренестиВОбъектДоходы();
	ПересчитатьДоходыИтого();
	//
	СохранитьСостояниеМатрицыП1();
	ЗаполнитьСуммыНаСервере();
	//
	ОбновитьИтогиТаблицыДоходов();
	ОбновитьИтогиДереваДоходов();
	ОбновитьМатрицуКлиент();
	
	ПересчитатьРасходы();
	ЗаполнитьДеревоРасходы();
	ОбновитьИтогиРасходов();
КонецПроцедуры


&НаКлиенте
Процедура Распределение1ПослеУдаления(Элемент)
	ПересчитатьРасходы();
	ЗаполнитьДеревоРасходы();
	ОбновитьИтогиРасходов();
КонецПроцедуры


&НаКлиенте
Процедура Распределение1ПриИзменении(Элемент)
	//ОбновитьНедельныеПредставленияКолонок();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВОбъектДоходы(менятьМодиф = истина)
	Если не ИспДоходыПодр Тогда
		возврат;
	КонецЕсли;
	
	Если менятьМодиф тогда
		Модифицированность = истина;
	КонецЕсли;
	
	Объект.ВидыДоходов.Очистить();
	Для каждого стрПодр из Доходы.ПолучитьЭлементы() Цикл
		Для каждого стрДоход из стрПодр.ПолучитьЭлементы() Цикл
			Если ЗначениеЗаполнено(стрДоход.ВидДохода) Тогда
				Новстр = Объект.ВидыДоходов.Добавить();
				ЗаполнитьЗначенияСвойств(Новстр, стрДоход);
				Новстр.Подразделение = стрПодр.ВидДохода;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
	
&НаКлиенте
Процедура ВидыДоходовПриИзменении(Элемент)
	//тд = Элемент.ТекущиеДанные;
	//Если тд = Неопределено или тд.ИДСтроки = "" Тогда
	//	возврат;
	//КонецЕсли;
	
	ПеренестиВОбъектДоходы();
	ПересчитатьДоходыИтого();
	
	// пересчет п1
	Если ПересчитыватьСуммыПриИзменении Тогда
		ОчиститьМатрицуП1();
		СоздатьКолонкиМатрицы();
		//
		ЗаполнитьСуммыНаСервере();
		//
		ОбновитьИтогиМатрицы();
		ПересчитатьРасходы();
		ЗаполнитьДеревоРасходы();
		ОбновитьИтогиРасходов();
	Иначе
		ОбновитьМатрицуКлиент();
	КонецЕсли;
	//
	
	ОбновитьИтогиТаблицыДоходов();
	ОбновитьИтогиДереваДоходов();
	
	Если не Элементы.ГруппаМатрицаП1.Скрыта() Тогда
		ПодключитьОбработчикОжидания("ПоказатьСкрытьМатрицу_Глюк", 0.3, истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура МесяцПриИзмененииНаСервере()
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МИНИМУМ(ИА_РаспределениеНедель.Период) КАК Период,
	               |	МАКСИМУМ(ИА_РаспределениеНедель.КонецНедели) КАК КонецНедели
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Месяц = &Месяц";
	Запрос.УстановитьПараметр("Месяц", Объект.Месяц);
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ДатаНачала = Выборка.Период;
		Объект.ДатаКонца = Выборка.КонецНедели;
	КонецЕсли;
	
	ОбновитьНедельныеПредставленияКолонок();
	ЗаполнитьДеревоРасходы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеДиапазона()
	ПредставлениеДиапазона = "";
	Если ЗначениеЗаполнено(Объект.ДатаНачала) и ЗначениеЗаполнено(Объект.ДатаКонца) Тогда
		ПредставлениеДиапазона = " с " + формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + формат(Объект.ДатаКонца, "ДФ=dd.MM.yyyy") + " ( "+колДней+" дн )";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	
		
КонецПроцедуры

&НаКлиенте
Процедура Распределение1ПодразделениеПриИзменении(Элемент)
	ПересчитатьРасходы();
	ЗаполнитьДеревоРасходы();
	ОбновитьИтогиРасходов();
КонецПроцедуры

&НаКлиенте
Процедура Распределение1СтатьяРасходовПриИзменении(Элемент)
	//ОбновитьНедельныеПредставленияКолонок();
	ЗаполнитьДеревоРасходы();
	ОбновитьИтогиРасходов();
КонецПроцедуры

&НаКлиенте
Процедура Распределение1СуммаПриИзменении(Элемент)
	ПересчитатьРасходы();
	ЗаполнитьДеревоРасходы();
	ОбновитьИтогиРасходов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммыНаСервере()
	ИсточникЗаполнения = Новый Соответствие;
    Для каждого Стр Из Объект.ВидыДоходов Цикл
    	ИсточникЗаполнения.Вставить(Стр.ИДСтроки, Стр.ВидДохода);
    КонецЦикла;       
    Для каждого Стр Из Объект.Политика1 Цикл
    	Стр.ВидДохода = ИсточникЗаполнения [Стр.ИДСтроки]; 
	КонецЦикла;	
	ДокНастройка = РеквизитФормыВЗначение("Объект");	
	//
	
	ДокФП = Документы.ИА_ФинансовоеПланирование.СоздатьДокумент();
	ДокФП.Дата = ТекущаяДата();
	ДокФП.Организация = объект.Организация;
	
	Для счНед = 1 по КолНедель Цикл
		КолонкаНед = "Неделя"+счНед;
		
		ДокФП.ДоходыИтого.Очистить();
		для каждого стр из объект.ДоходыИтого Цикл
			новстр = ДокФП.ДоходыИтого.Добавить();
			новстр.ВидДохода = стр.ВидДохода;
			новстр.Подразделение = стр.Подразделение;
			//новстр.СуммаБезнал = стр.сумма;
			новстр.СуммаБезнал = стр[КолонкаНед];
		КонецЦикла;
		
		ИА_ФПСервер.ЗаполнитьДокумент(ДокФП, ложь, ложь, истина, ложь, ложь, ложь, Неопределено, истина, ДокНастройка, ИспДоходыПодр);
		
		для каждого стр из ДокФП.Политика1 цикл
			отбор = Новый структура("ВидДохода,Подразделение,Статья", стр.ВидДохода, стр.Подразделение, стр.Статья);
			Нстроки = Объект.Политика1.НайтиСтроки(отбор);
			Если Нстроки.количество()>0 ТОгда
				//Нстроки[0].Сумма = стр.Сумма;
				Нстроки[0][КолонкаНед] = стр.Сумма;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// итоговая сумма
	для каждого стрП1 из Объект.Политика1 цикл
		стрП1.сумма = 0;
		Для счНед = 1 по КолНедель Цикл
			КолонкаНед = "Неделя"+счНед;
			стрП1.сумма = стрП1.сумма + стрП1[КолонкаНед];
		КонецЦикла;
	КонецЦикла;
	
	//
	ЗагрузитьДанныеМатрицы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммы(Команда)
	ЗаполнитьСуммыНаСервере();
	ОбновитьИтогиМатрицы();
	ПересчитатьРасходы();
	ЗаполнитьДеревоРасходы();
	ОбновитьИтогиРасходов();
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПолитика1ПриИзменении(Элемент)
	
	тд = Элементы.МатрицаПолитика1.ТекущиеДанные;
	текФонд = Неопределено;
	Если тд <> Неопределено Тогда
		текФонд = тд.Фонд;
		текПодр = тд.Подразделение;
	КонецЕсли;
	
	СохранитьСостояниеМатрицыП1();
	ЗаполнитьСуммыНаСервере();
	
	АктуализироватьДоступностьМатрицы();
	ОбновитьИтогиМатрицы();
	ПересчитатьРасходы();
	ЗаполнитьДеревоРасходы();
	ОбновитьИтогиРасходов();
	
	// восстановление тек строки
	Если текФонд <> Неопределено Тогда
		КоллСтрок = МатрицаПолитика1.ПолучитьЭлементы();
		Если ИспДоходыПодр Тогда
			для каждого стрПодр из КоллСтрок Цикл
				Если стрПодр.Подразделение = текПодр Тогда
					КоллСтрок = стрПодр.ПолучитьЭлементы();
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		для каждого стрФонд из КоллСтрок Цикл
			Если стрФонд.Фонд = текФонд Тогда
				Элементы.МатрицаПолитика1.ТекущаяСтрока = стрФонд.получитьИдентификатор();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	//ПоказатьСкрытьМатрицу_Глюк();
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПолитика1ПослеУдаления(Элемент)
	
	СохранитьСостояниеМатрицыП1();
	ОбновитьИтогиМатрицы();
	ПересчитатьРасходы();
	ЗаполнитьДеревоРасходы();
	ОбновитьИтогиРасходов();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСостояниеМатрицыП1()
	Модифицированность = Истина;
	объект.Политика1.Очистить();
	
	Если ИспДоходыПодр Тогда
		для каждого стрПодр из МатрицаПолитика1.ПолучитьЭлементы() Цикл
			СохранитьСостояниеСтрокиМатрицыП1(стрПодр);
		КонецЦикла;
	Иначе
		СохранитьСостояниеСтрокиМатрицыП1(МатрицаПолитика1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСостояниеСтрокиМатрицыП1(СтрокаМатр)
		
	для каждого стрФонд из СтрокаМатр.ПолучитьЭлементы() Цикл
		Если не стрФонд.Фонд.пустая() Тогда
			ОбДоходы = новый массив;
			Для каждого стрДоход из Объект.ВидыДоходов Цикл
				Если ОбДоходы.Найти(стрДоход.ИДСтроки) = Неопределено Тогда
					ОбДоходы.Добавить(стрДоход.ИДСтроки);
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если ИспДоходыПодр Тогда
					СтрокиДохПоПодр = Объект.ВидыДоходов.НайтиСтроки(Новый Структура("Подразделение, ВидДохода", СтрокаМатр.Подразделение, стрДоход.ВидДохода));	
					Если СтрокиДохПоПодр.Количество() = 0 тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				Новстр = Объект.Политика1.Добавить();
				ЗаполнитьЗначенияСвойств(Новстр, стрДоход);
				ЗаполнитьЗначенияСвойств(Новстр, стрФонд);
				Новстр.Статья =  стрФонд.Фонд;
				
				Если стрФонд["СпособРасчета_"+стрДоход.ИДСтроки].Пустая() Тогда
					стрФонд["СпособРасчета_"+стрДоход.ИДСтроки] = предопределенноезначение("Перечисление.ИА_РежимРасчетаСуммы.Процент");
					стрФонд["Картинка_"+стрДоход.ИДСтроки] = 2;
				КонецЕсли;
				
				Новстр.СпособРасчета =  стрФонд["СпособРасчета_"+стрДоход.ИДСтроки];		
				Новстр.Значение =  стрФонд["Значение_"+стрДоход.ИДСтроки];
				Новстр.Сумма =  стрФонд["Сумма_"+стрДоход.ИДСтроки];
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПолитика1ПриАктивизацииЯчейки(Элемент)
	ТекСтрока = Элементы.МатрицаПолитика1.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ТекЭл = Элемент.ТекущийЭлемент;
				
		Если найти(ТекЭл.Имя,"МатрицаПолитика1Значение_")>0 и не (ИспДоходыПодр и ТекСтрока.ПолучитьРодителя() = Неопределено) Тогда
			ид = прав(ТекЭл.Имя,32);
			способ = ТекСтрока["СпособРасчета_"+ид];
			
			элемЗнач = элементы["МатрицаПолитика1Значение_"+ид];
			//элемЗнач.ТолькоПросмотр = Ложь;
			Если    способ = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.Процент")
			    ИЛИ способ = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ФиксированнаяСумма")
			    ИЛИ способ = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.РучнойВвод")
			    Тогда
				квЧ =  Новый КвалификаторыЧисла(15,2);
			    элемЗнач.ОграничениеТипа = Новый ОписаниеТипов("Число", квЧ);
			ИначеЕсли    способ = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ВычисляемоеВыражение") Тогда
			    элемЗнач.ОграничениеТипа = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0));
			Иначе
			    элемЗнач.ОграничениеТипа = Новый ОписаниеТипов();
				элемЗнач.ТолькоПросмотр = истина;
			КонецЕсли; 
		КонецЕсли; 
		
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура МатрицаПолитика1СуммаПриИзменении(Элемент)
	ОбновитьИтогиМатрицы();
	ПересчитатьРасходы();
	ЗаполнитьДеревоРасходы();
	ОбновитьИтогиРасходов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтогиМатрицы()
	Если ИспДоходыПодр Тогда
		ОбщийИтог = 0;
		для каждого стр из МатрицаПолитика1.ПолучитьЭлементы() Цикл
			врИтог = ОбновитьИтогиМатрицыПоСтроке(стр);
			стр.Итого = врИтог;
			ОбщийИтог = ОбщийИтог + врИтог;
		КонецЦикла;
	Иначе
		ОбщийИтог = ОбновитьИтогиМатрицыПоСтроке(МатрицаПолитика1);
	КонецЕсли;
	
	Элементы.МатрицаПолитика1Итого.ТекстПодвала = Формат(ОбщийИтог,"ЧДЦ=2; ЧН=");
	
	для каждого стрДоход из Объект.ВидыДоходов Цикл		
		ид = стрДоход.ИДСтроки;
		Если ид="" Тогда
			Продолжить;
		КонецЕсли;
		
		ИтогДоход = 0;
		ИмяКолСумма = "Сумма_"+ид;
		Если ИспДоходыПодр ТОгда
			для каждого стрПодр из МатрицаПолитика1.ПолучитьЭлементы() Цикл							
				ИтогПоПодр = 0;
				для каждого стрФонд из стрПодр.ПолучитьЭлементы() Цикл							
					ИтогПоПодр = ИтогПоПодр + стрФонд[ИмяКолСумма];
				КонецЦикла;
				стрПодр[ИмяКолСумма] = ИтогПоПодр;
				ИтогДоход = ИтогДоход + ИтогПоПодр;
			КонецЦикла;
		Иначе
			для каждого стрФонд из МатрицаПолитика1.ПолучитьЭлементы() Цикл							
				ИтогДоход = ИтогДоход + стрФонд[ИмяКолСумма];
			КонецЦикла;
		КонецЕсли;
		
		Элементы["МатрицаПолитика1"+ИмяКолСумма].ТекстПодвала = Формат(ИтогДоход,"ЧДЦ=2; ЧН=");
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ОбновитьИтогиМатрицыПоСтроке(строкаМатр)
	ОбщийИтог = 0;
	для каждого стрФонд из строкаМатр.ПолучитьЭлементы() Цикл
		ИтогФонда = 0;
		СущИд = новый массив;
		для каждого стрДоход из Объект.ВидыДоходов Цикл
			ид = стрДоход.ИДСтроки;
			Если ид = "" или СущИд.Найти(ид)<>Неопределено тогда 
				Продолжить;
			КонецЕсли;
			
			ИмяКолСумма = "Сумма_"+ид;
			ИтогФонда = ИтогФонда + стрФонд[ИмяКолСумма];
			
			СущИд.Добавить(ид);
		КонецЦикла;
		стрФонд.Итого = ИтогФонда;
		ОбщийИтог = ОбщийИтог +ИтогФонда; 
	КонецЦикла;
	
	Возврат ОбщийИтог;
КонецФункции

&НаКлиенте
Процедура МатрицаПолитика1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	если найти(поле.имя,"Картинка_")>0 Тогда
		СтандартнаяОбработка = ложь;
		
		ид = прав(поле.имя,32);
		Если не МатрицаПолитика1.НайтиПоИдентификатору(ВыбраннаяСтрока)["Доступность_" + ид] Тогда
			возврат;
		КонецЕсли;
			
		допПарам = Новый Структура("ид,ВыбраннаяСтрока",ид,ВыбраннаяСтрока);
		оп = новый ОписаниеОповещения("ИзменениеСпособаРед", ЭтотОбъект, допПарам);
		
		сп = новый СписокЗначений;
		//сп.Добавить(ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.РучнойВвод"));
		//сп.Добавить(ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ФиксированнаяСумма"));
		сп.Добавить(ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.Процент"));
		сп.Добавить(ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.ВычисляемоеВыражение"));		
		
		ПоказатьВыборИзСписка(оп,сп,Поле);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеСпособаРед(выбЗн, дп) Экспорт
	Если выбЗн <> Неопределено Тогда
		стр = МатрицаПолитика1.НайтиПоИдентификатору(дп.ВыбраннаяСтрока);
		стр["СпособРасчета_"+ дп.ид] = выбЗн.Значение;
		стр["Картинка_"+ дп.ид] = НомерКартинки(выбЗн.Значение);
		//СохранитьСостояниеМатрицыП1();
		МатрицаПолитика1ПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьСуммы(Команда)
	Элементы.МатрицаПолитика1ПоказатьСкрытьСуммы.Пометка = не Элементы.МатрицаПолитика1ПоказатьСкрытьСуммы.Пометка;
	для каждого видД из Объект.ВидыДоходов Цикл
		Элементы["МатрицаПолитика1Сумма_"+видД.ИдСтроки].видимость = Элементы.МатрицаПолитика1ПоказатьСкрытьСуммы.Пометка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРасход(Команда)
	
	тд = Элементы.Расходы.ТекущиеДанные;
	Если тд = Неопределено Тогда 
		возврат;
	КонецЕсли;
	
	
	Если тд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ПеременныеРасходы")  Тогда
		ПоказатьПредупреждение(,"Переменные расходы настраиваются выше, в разеделе ""Добавление и настройка переменных расходов""!");
		Возврат;
	КонецЕсли;
	
	Если тд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль")  Тогда
		ПоказатьПредупреждение(,"Это рассчитанная строка маржинальной прибыли. В нее фонды нельзя добавлять!");
		Возврат;
	КонецЕсли;
	
	Если тд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ИтогКЗаливке") Тогда
		ПоказатьПредупреждение(,"Это итоговая строка. В нее фонды нельзя добавлять!");
		Возврат;
	КонецЕсли;

	
	Если не (тд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ПостоянныеРасходы") 
		ИЛИ тд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.УчредительскиеФонды")) Тогда
		ПоказатьПредупреждение(,"Добавлять фонды можно только в разделы: Постоянные расходы, Учредительские фонды!");
		Возврат;
	КонецЕсли;
	
	ТекРод = тд.ПолучитьРодителя();
	Если ТекРод <> Неопределено и тд.ТипСтроки = ТекРод.ТипСтроки Тогда
		тд = ТекРод;
	КонецЕсли;
	
	//  
	если ИспПодразделения и не ИспДоходыПодр Тогда
		Парам = новый Структура("тд", тд);
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияПодразделенияВРасходы", ЭтотОбъект, Парам);
		зн = ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка");
		ПоказатьВводЗначения(Оповещение,зн,"Выберите подразделение");
	Иначе
		ДобавитьФОндВРасходы(тд, тд.Подразделение);
	КонецЕсли;
	
	//
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияПодразделенияВРасходы(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда
		ДобавитьФОндВРасходы(Параметры.тд, ВыбЗнач);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФОндВРасходы(тд, Подр = Неопределено)
	ИсключитьФонды = ПолучитьИсключаемыеФондыРасходов(Неопределено, Подр);
	ОпОп = Новый ОписаниеОповещения("ВводФондаВРасходыЗавершение",ЭтотОбъект, Новый Структура("ТекРод, Подразделение", тд, Подр));
	отборФ = новый Структура("ПометкаУдаления", Ложь);
	ОткрытьФорму("Справочник.ИА_Фонды.ФормаВыбора", Новый структура("ИсключитьФонды, отбор",ИсключитьФонды,отборФ), ЭтаФорма,,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВводФондаВРасходыЗавершение(ВыбЗн, ДопПарам) Экспорт
	Если ВыбЗн <> Неопределено ТОгда
		тд = ДопПарам.ТекРод;
		
		новстр = тд.ПолучитьЭлементы().Добавить();

		Если ИспДоходыПодр ТОгда	
			новстр.подразделение = тд.ПолучитьРодителя().Подразделение;
			новстр.ПодразделениеСтрока = строка(новстр.Подразделение);
		Иначе
			новстр.подразделение = ДопПарам.Подразделение;
		КонецЕсли;
		новстр.ТипСтроки = тд.ТипСтроки;
		новстр.Фонд = ВыбЗн;
		
		СохранитьРасходы();
		
		Элементы.Расходы.ТекущаяСтрока = новстр.ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриАктивизацииСтроки(Элемент)
	тд = Элементы.Расходы.ТекущиеДанные;
	
	доступноДоб = тд <> Неопределено и 
	(тд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ПостоянныеРасходы") ИЛИ тд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.УчредительскиеФонды"));
	
	//Элементы.РасходыДобавить.Доступность = доступноДоб; 
	Элементы.РасходыПереместитьВверх.Доступность = доступноДоб И тд.ЭтоЗаголовок = ложь;
	Элементы.РасходыПереместитьВниз.Доступность = доступноДоб И тд.ЭтоЗаголовок = ложь;
	Элементы.РасходыУдалить.Доступность = доступноДоб И тд.ЭтоЗаголовок = ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПередУдалением(Элемент, Отказ)
	тд = Элементы.Расходы.ТекущиеДанные;
	МожноУдалить = 
	(тд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ПостоянныеРасходы") 
	ИЛИ тд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.УчредительскиеФонды")) и тд.ЭтоЗаголовок = ложь;
	если МожноУдалить = ложь Тогда
		отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	СохранитьРасходы();
	ОбновитьИтогиРасходов();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРасходы()
	Модифицированность = Истина;
	объект.Расчет.Очистить();
	объект.УчредительскиеФонды.Очистить();
	объект.ИтогоКЗаливке.Очистить();
	
	Если ИспДоходыПодр Тогда
		для каждого стрПодр из Расходы.ПолучитьЭлементы() Цикл
			ЗаписатьРасходы(стрПодр.ПолучитьЭлементы());
		КонецЦикла;
	Иначе
		ЗаписатьРасходы(Расходы.ПолучитьЭлементы());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьРасходы(источникСтроки)
	Для каждого стр из источникСтроки Цикл
		Если стр.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ПостоянныеРасходы") Тогда;
			для каждого стрФонд из стр.ПолучитьЭлементы() Цикл
				Новстр = Объект.Расчет.Добавить();
				ЗаполнитьЗначенияСвойств(Новстр, стрФонд);
			КонецЦикла;
		ИначеЕсли стр.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.УчредительскиеФонды") Тогда;
			для каждого стрФонд из стр.ПолучитьЭлементы() Цикл
				Новстр = Объект.УчредительскиеФонды.Добавить();
				ЗаполнитьЗначенияСвойств(Новстр, стрФонд);
			КонецЦикла;
		ИначеЕсли стр.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ИтогКЗаливке") Тогда;
			Новстр = Объект.ИтогоКЗаливке.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр, стр);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РасходыПослеУдаления(Элемент)
	СохранитьРасходы();
	
	ПересчитатьИтогоКРаспределению();
	
	ОбновитьИтогиРасходов();
	
	Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура РасходыСуммаПриИзменении(Элемент)
	// сумма может меняться только по постоянным расходам. Пересчет постоянных расходов	
	тд = Элементы.Расходы.ТекущиеДанные; 
	
	СтрРодитель = тд.ПолучитьРодителя().ПолучитьРодителя();
	Если СтрРодитель = Неопределено Тогда
		СтрРодитель = Расходы;
	КонецЕсли;
	СтрИтогоКРаспр = Неопределено;
	Для каждого стрРаздел из СтрРодитель.ПолучитьЭлементы() Цикл
		Если стрРаздел.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ИтогКЗаливке") Тогда
			СтрИтогоКРаспр = стрРаздел;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрИтогоКРаспр = Неопределено тогда
		возврат;
	КонецЕсли;
	
	
	ИтогоПоНеделям = 0;
	для счНед = 1 по КолНедель Цикл
		если СтрИтогоКРаспр.Сумма = 0 Тогда
			тд["Неделя" + счНед] = 0;
		Иначе
			тд["Неделя" + счНед] = окр(тд.Сумма * (СтрИтогоКРаспр["Неделя" + счНед] / СтрИтогоКРаспр.Сумма));
		КонецЕсли;
		ИтогоПоНеделям = ИтогоПоНеделям + тд["Неделя" + счНед];
	КонецЦикла;
	
	// корректировка округления. Последняя неделя
	тд["Неделя" + КолНедель] = тд["Неделя" + КолНедель] + (тд.Сумма - ИтогоПоНеделям);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтогиРасходов()
	колонки = новый массив;
	колонки.Добавить("Сумма");
	колонки.Добавить("Процент");
	колонки.Добавить("Неделя1");
	колонки.Добавить("Неделя2");
	колонки.Добавить("Неделя3");
	колонки.Добавить("Неделя4");
	колонки.Добавить("Неделя5");
	колонки.Добавить("Неделя6");
	колонки.Добавить("Неделя7");
	колонки.Добавить("Неделя8");
	колонки.Добавить("Неделя9");
	колонки.Добавить("Неделя10");
	колонки.Добавить("Неделя11");
	колонки.Добавить("Неделя12");
	
	Для каждого кол из колонки Цикл
		Если ИспДоходыПодр Тогда
			ИтогКолонки = 0;
			Для каждого стрПодр из расходы.ПолучитьЭлементы() Цикл
				ИтогоПоПодр = ОбновитьИтогКолонкиРасхода(стрПодр.ПолучитьЭлементы(), кол);
				стрПодр[кол] = ИтогоПоПодр;
				ИтогКолонки = ИтогКолонки + ИтогоПоПодр; 				
				
				Если кол = "Сумма" Тогда
					СуммаДохода = 0;
					Для каждого стрДоход из Объект.ДоходыИтого Цикл
						если стрДоход.Подразделение = стрПодр.Подразделение Тогда
							СуммаДохода = СуммаДохода + стрДоход.Сумма;
						КонецЕсли;
					КонецЦикла;

					
					стрПодр.ПодразделениеСтрока = строка(стрПодр.Подразделение);
					Если ИтогоПоПодр <> СуммаДохода Тогда
						стрПодр.ПодразделениеСтрока = стрПодр.ПодразделениеСтрока + " (" + строка(СуммаДохода - ИтогоПоПодр) + ")";
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
		Иначе
			ИтогКолонки = ОбновитьИтогКолонкиРасхода(расходы.ПолучитьЭлементы(), кол);
		КонецЕсли;	
		
		Если кол = "Сумма" Тогда
			
			СуммаДохода = Итог("ДоходыИтого", кол);
			
			//Если Объект.Проведен Тогда
			//	Спойлер = новый ФорматированнаяСтрока("   ТБ утверждена!", Новый шрифт("Arial", 13, истина), Новый цвет(161,185,34));
			//ИначеЕсли объект.Месяц = дата(1,1,1) Тогда
			//	Спойлер = новый ФорматированнаяСтрока("   Выберите месяц!", Новый шрифт("Arial", 13, истина), Новый цвет(236,236,236));
			//ИначеЕсли ИтогКолонки = 0 И СуммаДохода = 0 Тогда
			//	Спойлер = новый ФорматированнаяСтрока("   Заполните доходы и расходы!", Новый шрифт("Arial", 13, истина), Новый цвет(236,236,236));	
			//ИначеЕсли ИтогКолонки = СуммаДохода Тогда
			//	Спойлер = новый ФорматированнаяСтрока("   Расходы и доходы сбалансированы, можно утверждать ТБ!", Новый шрифт("Arial", 13, истина), Новый цвет(161,185,34));
			//ИначеЕсли ИтогКолонки > СуммаДохода Тогда  // расходы больше
			//	СпойлерСтрока = новый ФорматированнаяСтрока("   Расходы превышают доход:  ", Новый шрифт("Arial", 12, ложь), Новый цвет(236,236,236));
			//	СпойлерЧисло = новый ФорматированнаяСтрока(Формат(СуммаДохода - ИтогКолонки, "ЧДЦ=2"), Новый шрифт("Arial", 13, истина), Новый цвет(255,0,0));
			//	Спойлер = новый ФорматированнаяСтрока(СпойлерСтрока, СпойлерЧисло); 
			//Иначе  // доходы больше
			//	СпойлерСтрока = новый ФорматированнаяСтрока("   Осталось нераспределенных средств:  ", Новый шрифт("Arial", 12, ложь), Новый цвет(236,236,236));
			//	СпойлерЧисло = новый ФорматированнаяСтрока(Формат(СуммаДохода - ИтогКолонки, "ЧДЦ=2"), Новый шрифт("Arial", 13, истина), Новый цвет(251,237,158));
			//	Спойлер = новый ФорматированнаяСтрока(СпойлерСтрока, СпойлерЧисло);
			//КонецЕсли;
			
			УмШрифта = 0;
			#Если ТолстыйКлиентОбычноеПриложение тогда
				УмШрифта = 2;
			#КонецЕсли
			
			Если Объект.Проведен Тогда
				Спойлер = новый ФорматированнаяСтрока("   Т Б   у т в е р ж д е н а!", Новый шрифт("Arial", 13 - УмШрифта, истина), Новый цвет(161,185,34));
			ИначеЕсли объект.Месяц = дата(1,1,1) Тогда
				Спойлер = новый ФорматированнаяСтрока("   В ы б е р и т е   м е с я ц!", Новый шрифт("Arial", 13 - УмШрифта, истина), Новый цвет(236,236,236));
			ИначеЕсли ИтогКолонки = 0 И СуммаДохода = 0 Тогда
				Спойлер = новый ФорматированнаяСтрока("   З а п о л н и т е   д о х о д ы   и   р а с х о д ы!", Новый шрифт("Arial", 13 - УмШрифта, истина), Новый цвет(236,236,236));	
			ИначеЕсли ИтогКолонки = СуммаДохода Тогда
				Спойлер = новый ФорматированнаяСтрока("   Р а с х о д ы   и   д о х о д ы   с б а л а н с и р о в а н ы,   м о ж н о   у т в е р ж д а т ь   Т Б!", Новый шрифт("Arial", 13 - УмШрифта, истина), Новый цвет(161,185,34));
			ИначеЕсли ИтогКолонки > СуммаДохода Тогда  // расходы больше
				СпойлерСтрока = новый ФорматированнаяСтрока("   Р а с х о д ы   п р е в ы ш а ю т   д о х о д :     ", Новый шрифт("Arial", 12 - УмШрифта, ложь), Новый цвет(236,236,236));
				СпойлерЧисло = новый ФорматированнаяСтрока(Формат(СуммаДохода - ИтогКолонки, "ЧДЦ=2"), Новый шрифт("Arial", 14 - УмШрифта, истина), Новый цвет(236,107,41));
				Спойлер = новый ФорматированнаяСтрока(СпойлерСтрока, СпойлерЧисло); 
			Иначе  // доходы больше
				СпойлерСтрока = новый ФорматированнаяСтрока("   О с т а л о с ь   н е р а с п р е д е л е н н ы х   с р е д с т в :     ", Новый шрифт("Arial", 12 - УмШрифта, ложь), Новый цвет(236,236,236));
				СпойлерЧисло = новый ФорматированнаяСтрока(Формат(СуммаДохода - ИтогКолонки, "ЧДЦ=2"), Новый шрифт("Arial", 14 - УмШрифта, истина), Новый цвет(236,107,41));
				Спойлер = новый ФорматированнаяСтрока(СпойлерСтрока, СпойлерЧисло);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Функция Итог(имяТЧ,ИмяКолонки)
	рез = 0;
	для каждого стр из Объект[имяТЧ] Цикл
		рез = рез + стр[ИмяКолонки];
	КонецЦикла;
	Возврат рез;
КонецФункции
	
&НаКлиенте
Функция ОбновитьИтогКолонкиРасхода(Строки, кол)
	ИтогКолонки = 0;
	для каждого СТРполитика из Строки Цикл
		
		Если СТРполитика.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль") ИЛИ
			СТРполитика.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ИтогКЗаливке") Тогда
			Продолжить;
		КонецЕсли;
		ИтогПолитики = 0;
		для каждого СТРфонд из СТРполитика.ПолучитьЭлементы() Цикл
			
			Если СТРфонд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль") ИЛИ
				СТРфонд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ИтогКЗаливке") Тогда
				Продолжить;
			КонецЕсли;
		
			ИтогКолонки = ИтогКолонки + СТРфонд[кол];
			ИтогПолитики = ИтогПолитики + СТРфонд[кол];
			СТРфонд.ПодразделениеСтрока = строка(СТРфонд.Подразделение);
		КонецЦикла;
		СТРполитика[кол] = ИтогПолитики;
		//СТРполитика.ПодразделениеСтрока = строка(СТРполитика.Подразделение);
	КонецЦикла;
	
	возврат ИтогКолонки;
КонецФункции

&НаСервереБезКонтекста
Процедура ПечатьТБ_серверВывестиДоходы(макет, табдок, КолНедель, строки, ИспДоходыПодр=ложь)
	для каждого стрДоход из строки Цикл
		обл = макет.ПолучитьОбласть("КолонкаГруппа");
		обл.Параметры.КолонкаГруппа = ?(ИспДоходыПодр, "- ","") + стрДоход.ВидДохода;
		табДок.Вывести(Обл);
		
		обл = макет.ПолучитьОбласть("КолонкаСумма");
		обл.Параметры.Сумма = стрДоход["Сумма"];
		табДок.Присоединить(обл);
		Для сч = 1 по КолНедель Цикл
			обл = макет.ПолучитьОбласть("КолонкаСумма");
			обл.Параметры.Сумма = стрДоход["Неделя"+сч];
			табДок.Присоединить(обл);
		КонецЦикла;
	КонецЦикла;		
КонецПроцедуры
	
&НаСервере
Функция ПечатьТБ_сервер()
		
	табДок = Новый ТабличныйДокумент;
	Макет = Документы.ИА_ФП_Настройка.ПолучитьМакет("Макет");
	
	обл = макет.ПолучитьОбласть("Шапка");
	обл.Параметры.Номер = Объект.Номер;
	обл.Параметры.месяц = врег(формат(Объект.Месяц,"ДФ='MMMM yyyy'"));
	табДок.Вывести(Обл);
	
	обл = макет.ПолучитьОбласть("Заголовок");
	обл.Параметры.Заголовок = "ДОХОДЫ:";
	табДок.Вывести(Обл);
	
	
	//// ДОХОДЫ шапка
	обл = макет.ПолучитьОбласть("КолонкаГруппаШапка");
	обл.Параметры.КолонкаГруппа = "Вид дохода";
	табДок.Вывести(Обл);
	обл = макет.ПолучитьОбласть("КолонкаСуммаШапка");
	обл.Параметры.Сумма = "Сумма";
	табДок.Присоединить(обл);
	
	ИмяЭлДоходы = ?(ИспДоходыПодр, "ВидыДоходовПодрНеделя", "ВидыДоходовНеделя");

	для счСкр = 1 по КолНедель Цикл
		ИмяКолонки = ИмяЭлДоходы +счСкр;
		элем = Элементы[ИмяКолонки];
		
		обл = макет.ПолучитьОбласть("КолонкаСуммаШапка");
		обл.Параметры.Сумма = элем.Заголовок;
		табДок.Присоединить(обл);	
	КонецЦикла;
	
	//// ДОХОДЫ Строки
	Если ИспДоходыПодр Тогда
		тзПодр = Объект.ВидыДоходов.Выгрузить();
		тзПодр.Свернуть("Подразделение");
		для каждого стрПодр из тзПодр Цикл
			строкиДохода = Объект.ВидыДоходов.НайтиСтроки(новый Структура("Подразделение",стрПодр.Подразделение)); 
			
			обл = макет.ПолучитьОбласть("КолонкаГруппаЖ");
			обл.Параметры.КолонкаГруппа = стрПодр.Подразделение;
			табДок.Вывести(Обл);
			
			////////////// итоги
			// сумма
			обл = макет.ПолучитьОбласть("КолонкаСуммаЖ");
			ИтогоСуммаПодр = 0;
			для каждого стрД из строкиДохода Цикл
				ИтогоСуммаПодр = ИтогоСуммаПодр + стрД.Сумма;
			КонецЦикла;
			обл.Параметры.Сумма = ИтогоСуммаПодр;
			табДок.Присоединить(обл);
			
			// недели
			Для сч = 1 по КолНедель Цикл
				обл = макет.ПолучитьОбласть("КолонкаСуммаЖ");
				ИтогоСуммаПодр = 0;
				для каждого стрД из строкиДохода Цикл
					ИтогоСуммаПодр = ИтогоСуммаПодр + стрД["Неделя"+сч];
				КонецЦикла;
				обл.Параметры.Сумма = ИтогоСуммаПодр;
				табДок.Присоединить(обл);
			КонецЦикла;

			////////// строки
			ПечатьТБ_серверВывестиДоходы(макет, табдок, КолНедель, строкиДохода, истина);
		КонецЦикла;
	Иначе
		ПечатьТБ_серверВывестиДоходы(макет, табдок, КолНедель, Объект.ВидыДоходов);
	КонецЕсли;
	
	///////////// РАСХОДЫ
	
	обл = макет.ПолучитьОбласть("Заголовок");
	обл.Параметры.Заголовок = "РАСХОДЫ:";
	табДок.Вывести(Обл);
	
	
	//// РАСХОДЫ шапка
	постф = ?(ИспПодразделения, "Подр", "");
	
	обл = макет.ПолучитьОбласть("КолонкаГруппаШапка"+постф);
	обл.Параметры.КолонкаГруппа = "Фонд";
	табДок.Вывести(Обл);
	обл = макет.ПолучитьОбласть("КолонкаСуммаШапка");
	обл.Параметры.Сумма = "Сумма";
	табДок.Присоединить(обл);
	
	для счСкр = 1 по КолНедель Цикл
		ИмяКолонки = ИмяЭлДоходы+счСкр;
		элем = Элементы[ИмяКолонки];
		
		обл = макет.ПолучитьОбласть("КолонкаСуммаШапка");
		обл.Параметры.Сумма = элем.Заголовок;
		табДок.Присоединить(обл);				
	КонецЦикла;
	
	//// РАСХОДЫ Строки
	для каждого стрПолитика из Расходы.ПолучитьЭлементы() Цикл
		обл = макет.ПолучитьОбласть("КолонкаГруппаЖ"+постф);
		обл.Параметры.КолонкаГруппа = ?(ИспПодразделения, стрПолитика.Подразделение, стрПолитика.Фонд);
		табДок.Вывести(Обл);
		
		обл = макет.ПолучитьОбласть("КолонкаСуммаЖ");
		обл.Параметры.Сумма = стрПолитика["Сумма"];
		табДок.Присоединить(обл);
		Для сч = 1 по КолНедель Цикл
			обл = макет.ПолучитьОбласть("КолонкаСуммаЖ");
			обл.Параметры.Сумма = стрПолитика["Неделя"+сч];
			табДок.Присоединить(обл);
		КонецЦикла;
		
		Для каждого стрФонд из стрПолитика.получитьЭлементы() Цикл
			обл = макет.ПолучитьОбласть("КолонкаГруппа"+постф);
			Если ИспПодразделения Тогда
				обл.Параметры.Подразделение = стрФонд.Подразделение;
				обл.Параметры.Фонд = стрФонд.Фонд;
			Иначе
				обл.Параметры.КолонкаГруппа = " -" + стрФонд.Фонд;
			КонецЕсли;
			табДок.Вывести(Обл);
			
			обл = макет.ПолучитьОбласть("КолонкаСумма");
			обл.Параметры.Сумма = стрФонд["Сумма"];
			табДок.Присоединить(обл);
			Для сч = 1 по КолНедель Цикл
				обл = макет.ПолучитьОбласть("КолонкаСумма");
				обл.Параметры.Сумма = стрФонд["Неделя"+сч];
				табДок.Присоединить(обл);
			КонецЦикла;
			
			Если ИспДоходыПодр Тогда
				Для каждого стрФонд1 из стрФонд.получитьЭлементы() Цикл
					обл = макет.ПолучитьОбласть("КолонкаГруппа"+постф);
					обл.Параметры.Фонд = стрФонд1.Фонд;
					табДок.Вывести(Обл);
					
					обл = макет.ПолучитьОбласть("КолонкаСумма");
					обл.Параметры.Сумма = стрФонд1["Сумма"];
					табДок.Присоединить(обл);
					Для сч = 1 по КолНедель Цикл
						обл = макет.ПолучитьОбласть("КолонкаСумма");
						обл.Параметры.Сумма = стрФонд1["Неделя"+сч];
						табДок.Присоединить(обл);
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	
	обл = макет.ПолучитьОбласть("Подвал");
	табДок.Вывести(Обл);
	
	табДок.АвтоМасштаб = Истина;
	возврат табДок;
КонецФункции

&НаКлиенте
Процедура ПечатьТБ(Команда)
	ПеренестиВОбъектДоходы(ложь);
	тд = ПечатьТБ_сервер();
	тд.Показать();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВидДохода(Команда)
	тд = Элементы.ВидыДоходовПодр.ТекущиеДанные;
	Если тд<>Неопределено Тогда
		
		Если тд.получитьРодителя() <> Неопределено ТОгда
			тд = тд.получитьРодителя();    
		КонецЕсли;
		
		ИсключитьДоходы = новый массив;
		для каждого стр из тд.ПолучитьЭлементы() Цикл
			Если ЗначениеЗаполнено(стр.ВидДохода) Тогда
				ИсключитьДоходы.Добавить(стр.ВидДохода);
			КонецЕсли;
		КонецЦикла;
	
		ПарамФорм = Новый Структура("ИсключитьДоходы", ИсключитьДоходы);
		ПарамОп = новый Структура("тд", тд);
		оп = новый ОписаниеОповещения("ПослеВводаЗначенияВидаДохода", ЭтотОбъект, ПарамОп);
		ОткрытьФорму("Справочник.ИА_ВидыДоходов.ФормаВыбора", ПарамФорм, ЭтаФорма, , ,, оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияВидаДохода(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда
		тд = Параметры.тд;
		Если тд.получитьРодителя() = Неопределено ТОгда
			Новстр = тд.ПолучитьЭлементы().Добавить();    
		Иначе
			Новстр = тд.получитьРодителя().ПолучитьЭлементы().Добавить();    
		КонецЕсли;    	
		Новстр.ВидДохода = ВыбЗнач;
		Новстр.ИДСтроки = СформироватьУИДДохода(ВыбЗнач);
		Новстр.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Вручную");
		
		ВидыДоходовПриИзменении(Неопределено);
		
		Элементы.ВидыДоходовПодр.ТекущаяСтрока = новстр.получитьИдентификатор();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодразделение(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияПодразделения", ЭтотОбъект);
	зн = ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка");
	ПоказатьВводЗначения(Оповещение,зн,"Выберите подразделение");

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияПодразделения(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда		
		Для каждого стр из Доходы.ПолучитьЭлементы() Цикл
			Если стр.ВидДохода = ВыбЗнач Тогда
				Сообщить("Выбранное подразделение уже добавлено");
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		Новстр = Доходы.ПолучитьЭлементы().Добавить();    	    	
		Новстр.ВидДохода = ВыбЗнач;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовПодрПриАктивизацииСтроки(Элемент)
	ОбновитьДоступностьРедСтрДоходов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьРедСтрДоходов()
	тд = Элементы.ВидыДоходовПодр.ТекущиеДанные;
	Если тд <> Неопределено Тогда
		ДоступностьРед = ложь;
		если тд.ПолучитьРодителя() <> Неопределено Тогда
			УстановкаОтбораТипа_ВидыДохода();
			ДоступностьРед = истина;
		КонецЕсли;
		
		Элементы.ВидыДоходовПодрСпособЗаполнения.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрЗначение.ТолькоПросмотр =  (не ДоступностьРед) или тд.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Вручную");
		Элементы.ВидыДоходовПодрПараметрыСтр.ТолькоПросмотр = не ДоступностьРед;
		Элементы.ВидыДоходовПодрСумма.ТолькоПросмотр =  не ДоступностьРед;
		
		Элементы.ВидыДоходовПодрНеделя1.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрНеделя2.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрНеделя3.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрНеделя4.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрНеделя5.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрНеделя6.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрНеделя7.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрНеделя8.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрНеделя9.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрНеделя10.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрНеделя11.ТолькоПросмотр =  не ДоступностьРед;
		Элементы.ВидыДоходовПодрНеделя12.ТолькоПросмотр =  не ДоступностьРед;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовПодрСпособЗаполненияПриИзменении(Элемент)
	УстановкаОтбораТипа_ВидыДохода();
	ОбновитьДоступностьРедСтрДоходов();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодразделениеВМатрицу(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияПодразделенияВМатр", ЭтотОбъект);
	зн = ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка");
	ПоказатьВводЗначения(Оповещение,зн,"Выберите подразделение");
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияПодразделенияВМатр(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда		
		Для каждого стрПодр из МатрицаПолитика1.ПолучитьЭлементы() Цикл
			Если стрПодр.подразделение = ВыбЗнач Тогда
				ПоказатьПредупреждение(,"Выбранное подразделение уже добавлено");
				возврат;
			КонецЕсли;			
		КонецЦикла;
		
		Новстр = МатрицаПолитика1.ПолучитьЭлементы().Добавить();    	    	
		Новстр.подразделение = ВыбЗнач;
		Новстр.подразделениеФонд = ВыбЗнач;
		
		АктуализироватьДоступностьМатрицы();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФондВМатрицу(Команда)
	тд = Элементы.МатрицаПолитика1.ТекущиеДанные;
	Если тд<>Неопределено Тогда
		Парам = новый Структура("тд", тд);		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияФондаВМатр", ЭтотОбъект, Парам);
		зн = ПредопределенноеЗначение("Справочник.ИА_Фонды.ПустаяСсылка");
		ПоказатьВводЗначения(Оповещение,зн,"Выберите фонд");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияПодразделения1ВМатр(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда
		ДобавитьФондПеремРасход(ВыбЗнач);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияФондаВМатр(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда
		тд = Параметры.тд;
		Если тд.получитьРодителя() = Неопределено ТОгда
			Новстр = тд.ПолучитьЭлементы().Добавить();    
			Новстр.Подразделение = тд.Подразделение;
		Иначе
			Новстр = тд.получитьРодителя().ПолучитьЭлементы().Добавить();    
			Новстр.Подразделение = тд.получитьРодителя().Подразделение;
		КонецЕсли;    	
		Новстр.Фонд = ВыбЗнач;
		Если ИспПодразделения и не ИспДоходыПодр Тогда
			Новстр.Подразделение = Параметры.Подразделение;
		КонецЕсли;
		Новстр.ПодразделениеФонд = ВыбЗнач;
		
		СохранитьСостояниеМатрицыП1();
		Элементы.МатрицаПолитика1.ТекущаяСтрока = новстр.получитьИдентификатор();
		
		АктуализироватьДоступностьМатрицы();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовПодрПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодразделения(Команда)
	Для каждого стрПодрДох из Доходы.ПолучитьЭлементы() Цикл
		УжеЕсть = ложь;
		Для каждого стрПодр из МатрицаПолитика1.ПолучитьЭлементы() Цикл
			Если стрПодр.подразделение = стрПодрДох.ВидДохода Тогда
				УжеЕсть = истина;
				Прервать;
			КонецЕсли;			
		КонецЦикла;
		
		Если не УжеЕсть Тогда
			Новстр = МатрицаПолитика1.ПолучитьЭлементы().Добавить();    	    	
			Новстр.подразделение = стрПодрДох.ВидДохода;
			Новстр.подразделениеФонд = стрПодрДох.ВидДохода;
		КонецЕсли;
	
	КонецЦикла;
	
	АктуализироватьДоступностьМатрицы();
КонецПроцедуры


&НаКлиенте
Процедура ВидыДоходовПодрВидДоходаПриИзменении(Элемент)
	тд = Элементы.ВидыДоходовПодр.ТекущиеДанные;
	
	Если ТипЗнч(тд.ВидДохода) = тип("СправочникСсылка.ИА_ВидыДоходов") Тогда
		тд.ИДСтроки = СформироватьУИДДохода(тд.ВидДохода);
	КонецЕсли;
	
	Если ТипЗнч(тд.ВидДохода) = тип("СправочникСсылка.ИА_ЦФО") Тогда
		Для каждого стр из Доходы.ПолучитьЭлементы() Цикл
			Если стр.ВидДохода = тд.ВидДохода и тд.ПолучитьИдентификатор() <> стр.ПолучитьИдентификатор() Тогда
				Сообщить("Выбранное подразделение уже добавлено");
				тд.ВидДохода = ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка");
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура МатрицаПолитика1ПриАктивизацииСтроки(Элемент)
	//ТекСтрока = Элементы.МатрицаПолитика1.ТекущиеДанные;
	//Если ТекСтрока <> Неопределено и ИспДоходыПодр Тогда
	//	ЭтоПодр = ТекСтрока.ПолучитьРодителя() = Неопределено; 
	//	
	//	Элементы.МатрицаПолитика1Подразделение.ТолькоПросмотр = не ЭтоПодр;
	//	Элементы.МатрицаПолитика1Фонд.ТолькоПросмотр = ЭтоПодр;
	//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура МатрицаПолитика1ПодразделениеПриИзменении(Элемент)
	тд = Элементы.МатрицаПолитика1.ТекущиеДанные;
	
	если ИспДоходыПодр Тогда
		Для каждого стр из МатрицаПолитика1.ПолучитьЭлементы() Цикл
			Если стр.Подразделение = тд.Подразделение и тд.ПолучитьИдентификатор() <> стр.ПолучитьИдентификатор() Тогда
				Сообщить("Выбранное подразделение уже добавлено");
				тд.Подразделение = ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка");
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		для каждого стр из тд.ПолучитьЭлементы() Цикл
			стр.Подразделение = тд.Подразделение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВидыДоходовНеделя1ПриИзменении(Элемент)
	НомерНедели = число(прав(Элемент.Имя,1));
	тд = Элемент.Родитель.ТекущиеДанные;
	
	Если НомерНедели = КолНедель или тд.НезависимыйРежим Тогда // пересчитываем месячную квоту как сумму недель
		ПересчетСуммИтогДоходов(тд);
	Иначе
		ПересчетСуммНедель(тд, НомерНедели);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммНедель(тд, ВыбНеделя)
	итогСуммаУжеРаспр = 0;
	Для сч = 1 по ВыбНеделя цикл
		итогСуммаУжеРаспр = итогСуммаУжеРаспр + тд["Неделя"+сч];
	КонецЦикла;
	
	ОсталосьРаспределить = тд.сумма - итогСуммаУжеРаспр;
	
	Если ОсталосьРаспределить < 0 Тогда
		Для сч = ВыбНеделя + 1 по КолНедель цикл
			тд["Неделя" + сч] = 0;
		КонецЦикла;
		тд.сумма = тд.сумма - ОсталосьРаспределить;
		Возврат;
	КонецЕсли;
	
	// распределеяем пропорционально уже введенным суммам
	СуммаДо = 0;
	для счНед = ВыбНеделя + 1  по КолНедель Цикл
		СуммаДо = СуммаДо + тд["Неделя" + счНед];
	КонецЦикла;
	
	ИтогоПоНеделям = итогСуммаУжеРаспр;
	Для сч = ВыбНеделя + 1 по КолНедель цикл
		тд["Неделя" + сч] = окр(ОсталосьРаспределить * (тд["Неделя" + сч] / СуммаДо));
		ИтогоПоНеделям = ИтогоПоНеделям + тд["Неделя" + сч];
	КонецЦикла;
	
	// корректировка округления. Последняя неделя
	тд["Неделя" + КолНедель] = тд["Неделя" + КолНедель] + (тд.Сумма - ИтогоПоНеделям);
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммДоходовПоНеделям(тд, источникДанных)
	ВсеНули = истина;
	для счНед = 1 по КолНедель Цикл
		Если тд["неделя"+счНед] <> 0 Тогда
			ВсеНули = ложь;
			прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьНедельныеСуммыПропорционально(тд.ПолучитьИдентификатор(), источникДанных, ВсеНули);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммИтогДоходов(тд)
	итогСумма = 0;
	Для сч = 1 по КолНедель цикл
		итогСумма = итогСумма + тд["Неделя"+сч];
	КонецЦикла;
	
	тд.сумма = итогСумма; 
	//тд.СуммаПлан = тд.сумма - тд.СуммаОтложенныйДоход;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНедельныеСуммыПропорционально(ИДСтроки, источникДанных, поДнямНедель = истина)
	Если источникДанных = "ВидыДоходов" тогда
		СтрокаДанных = объект.ВидыДоходов.НайтиПоИдентификатору(ИДСтроки);
	Иначе
		СтрокаДанных = ЭтаФорма[источникДанных].НайтиПоИдентификатору(ИДСтроки);
	КонецЕсли;
	
	ЗаполнитьНедельныеСуммыСтрокиПропорционально(СтрокаДанных, поДнямНедель);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНедельныеСуммыСтрокиПропорционально(СтрокаДанных, поДнямНедель)
	
	ИтогоПоНеделям = 0;
	Если поДнямНедель Тогда
		для счНед = 1 по КолНедель Цикл
			СтрокаНед = Тз_Недели[счНед-1];
			СтрокаДанных["Неделя" + счНед] = окр(СтрокаДанных.Сумма / колДней * СтрокаНед.КолДней);
			
			ИтогоПоНеделям = ИтогоПоНеделям + СтрокаДанных["Неделя" + счНед];
		КонецЦикла;
	Иначе
		СуммаДо = 0;
		для счНед = 1 по КолНедель Цикл
			СуммаДо = СуммаДо + СтрокаДанных["Неделя" + счНед];
		КонецЦикла;
		
		
		для счНед = 1 по КолНедель Цикл
			СтрокаДанных["Неделя" + счНед] = окр(СтрокаДанных.Сумма * (СтрокаДанных["Неделя" + счНед] / СуммаДо));
			ИтогоПоНеделям = ИтогоПоНеделям + СтрокаДанных["Неделя" + счНед];
		КонецЦикла;
	КонецЕсли;
	
	// корректировка округления. Последняя неделя
	СтрокаДанных["Неделя" + КолНедель] = СтрокаДанных["Неделя" + КолНедель] + (СтрокаДанных.Сумма - ИтогоПоНеделям);
	
	//ОбновитьНедельныеПредставленияКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовПодрСуммаПриИзменении(Элемент)
	тд = Элементы.ВидыДоходовПодр.ТекущиеДанные;

	ПеренестиВОбъектДоходы();
	ПересчетСуммДоходовПоНеделям(тд, "Доходы");
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовПодрНеделя1ПриИзменении(Элемент)
	//ПересчетСуммИтогДоходов(Элемент.Родитель.ТекущиеДанные);
	
	НомерНедели = число(прав(Элемент.Имя,1));
	тд = Элемент.Родитель.ТекущиеДанные;
	
	Если НомерНедели = КолНедель или тд.НезависимыйРежим Тогда // пересчитываем месячную квоту как сумму недель
		ПересчетСуммИтогДоходов(тд);
	Иначе
		ПересчетСуммНедель(тд, НомерНедели);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РасходыНеделя1ПриИзменении(Элемент)
	//ПересчетСуммИтогДоходов(Элемент.Родитель.ТекущиеДанные);
	//ОбновитьИтогиРасходов();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьИтогиДереваДоходов()
	Если не ИспДоходыПодр тогда
		возврат;
	КонецЕсли;
	
	ОбщИтоги = новый Структура("СуммаПлан,СуммаОтложенныйДоход,Сумма,Неделя1,Неделя2,Неделя3,Неделя4,Неделя5,Неделя6, Неделя7,Неделя8,Неделя9,Неделя10,Неделя11,Неделя12", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
	
	Для каждого стрПодр из Доходы.ПолучитьЭлементы() Цикл
		итоги = новый Структура("СуммаПлан,СуммаОтложенныйДоход,Сумма,Неделя1,Неделя2,Неделя3,Неделя4,Неделя5,Неделя6, Неделя7,Неделя8,Неделя9,Неделя10,Неделя11,Неделя12", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
		Для каждого стрДох из стрПодр.ПолучитьЭлементы() Цикл
			для каждого имяКолонк из итоги Цикл
				итоги[имяКолонк.Ключ] = итоги[имяКолонк.Ключ] + стрДох[имяКолонк.Ключ];
			КонецЦикла;
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(стрПодр, итоги);
		
		для каждого имяКолонк из итоги Цикл
			ОбщИтоги[имяКолонк.Ключ] = ОбщИтоги[имяКолонк.Ключ] + итоги[имяКолонк.Ключ] ;
		КонецЦикла;
	КонецЦикла;
	
	для каждого имяКолонк из ОбщИтоги Цикл
		Элементы["ВидыДоходовПодр"+имяКолонк.Ключ].ТекстПодвала = формат(ОбщИтоги[имяКолонк.Ключ],"ЧДЦ=2; ЧН=");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтогиТаблицыДоходов()
	Если ИспДоходыПодр тогда
		возврат;
	КонецЕсли;
	
	итоги = новый Структура("СуммаОтложенныйДоход,Сумма,Неделя1,Неделя2,Неделя3,Неделя4,Неделя5,Неделя6, Неделя7,Неделя8,Неделя9,Неделя10,Неделя11,Неделя12", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
	
	для каждого имяКолонк из итоги Цикл
		ИтогоКолонки = 0;
		Для каждого стрПодр из Объект.ВидыДоходов Цикл
			ИтогоКолонки = ИтогоКолонки + стрПодр[имяКолонк.Ключ];
		КонецЦикла;
		Элементы["ВидыДоходов"+имяКолонк.Ключ].ТекстПодвала = формат(ИтогоКолонки,"ЧДЦ=2; ЧН=");
	КонецЦикла;
КонецПроцедуры

//&НаКлиенте
//Процедура ВидыДоходовСуммаПланПриИзменении(Элемент)
//	тд = Элементы.ВидыДоходов.ТекущиеДанные;
//	тд.Сумма = тд.СуммаПлан + тд.СуммаОтложенныйДоход;
//	ПересчетСуммДоходовПоНеделям(тд, "ВидыДоходов");
//КонецПроцедуры

&НаКлиенте
Процедура ОтложенныйДоходПриИзменении(Элемент)
	ВидыДоходовПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОтложенныйДоходПослеУдаления(Элемент)
	ВидыДоходовПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ОтметитьПревышение(Подразделение, ВидДохода, обнулить = ложь)
	Отб = новый Структура("Подразделение,ВидДохода", Подразделение, ВидДохода);
	нсСТроки = объект.ОтложенныйДоход.НайтиСтроки(Отб);
	Для каждого стр из нсСТроки Цикл
		стр.Превышение = истина;
		Если обнулить Тогда
			Сообщить("Сумма отложенного дохода превышает сумму дохода!");
			стр.Сумма = 0;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
	
&НаСервере
Процедура ПересчитатьДоходыИтого()
	
	Объект.ДоходыИтого.Очистить();
	Для каждого стр из Объект.ВидыДоходов Цикл
		Новстр = Объект.ДоходыИтого.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр, , "СуммаОтложенныйДоход");
		Новстр.СуммаПлан = стр.Сумма;
	КонецЦикла;
	
	// подготовка таблицы отложенного дохода
	Для каждого стр из Объект.ОтложенныйДоход Цикл
		стр.превышение = ложь;	
	КонецЦикла;
	
	тзОтложДок = Объект.ОтложенныйДоход.Выгрузить();
	тзОтлож = Новый ТаблицаЗначений;
	тзОтлож.Колонки.Добавить("Подразделение");
	тзОтлож.Колонки.Добавить("ВидДохода");
	тзОтлож.Колонки.Добавить("Сумма");
	Для каждого стр из тзОтложДок Цикл
		Новстр = тзОтлож.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		
		Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить Тогда
			Новстр.Сумма = - Новстр.Сумма;
		КонецЕсли;
	КонецЦикла;
	тзОтлож.Свернуть("Подразделение, ВидДохода", "Сумма");
	
	// заполнение колонки отложенного дохода
	Для каждого стр из тзОтлож Цикл
		Если стр.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИспПодразделения Тогда
			нСтр = Объект.ДоходыИтого.НайтиСтроки(новый структура("Подразделение,ВидДохода", Стр.Подразделение, стр.ВидДохода));
		Иначе
			нСтр = Объект.ДоходыИтого.НайтиСтроки(новый структура("ВидДохода", стр.ВидДохода));
		КонецЕсли;
		
		Если нстр.количество() = 0 Тогда
			Если стр.Сумма > 0 Тогда
				тд = Объект.ДоходыИтого.Добавить();
				тд.ВидДохода = стр.ВидДохода;
				тд.Подразделение = стр.Подразделение;
			Иначе
				//Сообщить("Доход "+стр.ВидДохода+" не должен быть отрицательным. Сначала добавьте данный вид дохода в раздел Доходы, затем его можно будет отложить!");
				ОтметитьПревышение(стр.Подразделение, стр.ВидДохода , истина);
				Продолжить;
			КонецЕсли;
		Иначе
			тд = нстр[0];
		КонецЕсли;
		
		тд.СуммаОтложенныйДоход = стр.Сумма;
	КонецЦикла;

			
	// Пересчет сумм таблицы доходов
	Для каждого стр из Объект.ДоходыИтого Цикл
		Если стр.СуммаОтложенныйДоход = 0 Тогда // ничего не надо делать
			Продолжить;
		КонецЕсли;
		
		Если стр.СуммаПлан + стр.СуммаОтложенныйДоход < 0 Тогда
			//Сообщить("Доход "+стр.ВидДохода+" не должен быть отрицательным. Отложенный доход больше самого дохода!");
			ОтметитьПревышение(стр.Подразделение, стр.ВидДохода);
		КонецЕсли;
		
		стр.Сумма = стр.СуммаПлан + стр.СуммаОтложенныйДоход;
		
		ВсеНули = истина;
		для счНед = 1 по КолНедель Цикл
			Если стр["неделя"+счНед] <> 0 Тогда
				ВсеНули = ложь;
				прервать;
			КонецЕсли;
		КонецЦикла;
		ЗаполнитьНедельныеСуммыСтрокиПропорционально(стр, ВсеНули);
		//КонецЕсли;
	КонецЦикла;
	
	ОбновитьИтогоВЗаливку();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогоВЗаливку()
	ИтогоВЗаливку.Очистить();
	
	СтрИтого = ИтогоВЗаливку.Добавить();
	СтрИтого.Заголовок = "Сумма на заливку с учетом отложенного дохода";
	Для сч = 1 по КолНедель Цикл
		СтрИтого["Неделя"+сч] = Объект.ДоходыИтого.Итог("Неделя"+сч);
	КонецЦикла;
	СтрИтого.Сумма = Объект.ДоходыИтого.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПодборОтложенногоДохода(Команда)
	Парам = новый Структура("Док,	Организация,	ИспДоходыПоПодразделениям, 	Только1, 	ДатаОстатков",
				          Неопределено, Объект.Организация, ИспДоходыПодр, ложь, ?(Объект.Дата = дата(1,1,1), ТекущаяДата(), объект.Дата));

	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ФормаПодбораДБПУпр", Парам,,,,, Новый ОписаниеОповещения("КомандаПодобратьЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура КомандаПодобратьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	рез = Результат;
	
	Если ТипЗнч(рез) = тип("Массив") Тогда
		Для каждого стр из рез Цикл
			Новстр = Объект.ОтложенныйДоход.Добавить();
			Новстр.Подразделение = стр.Подразделение;
			Новстр.ВидДохода = стр.ВидДохода; 
			Новстр.Сумма = стр.Сумма;
			Новстр.Комментарий = стр.Комментарий;
			Новстр.ТипОперации = ПредопределенноеЗначение("Перечисление.КСУ_ОперацииСОтложеннымДоходом.Вернуть");
		КонецЦикла;
		
		ОтложенныйДоходПриИзменении(Неопределено);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура МатрицаПолитика1ФондНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ИсключитьФонды = новый массив;
	тс = Элементы.МатрицаПолитика1.ТекущиеДанные;
	для каждого стр из МатрицаПолитика1.ПолучитьЭлементы() Цикл
		Если ЗначениеЗаполнено(стр.Фонд) и стр <> тс и стр.Подразделение = тс.Подразделение Тогда
			ИсключитьФонды.Добавить(стр.Фонд);
		КонецЕсли;
		
		для каждого стр1 из стр.ПолучитьЭлементы() Цикл
			Если ЗначениеЗаполнено(стр1.Фонд) и стр1 <> тс и стр1.Подразделение = тс.Подразделение  Тогда
				ИсключитьФонды.Добавить(стр1.Фонд);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Парам = Новый Структура("ИсключитьФонды", ИсключитьФонды);
	оп = новый ОписаниеОповещения("ЗавершениеВыбораФонда", ЭтотОбъект);
	ОткрытьФорму("Справочник.ИА_Фонды.ФормаВыбора", Парам, ЭтаФорма, , ,, оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораФонда(РезультатЗакрытия, ДопПарам) Экспорт
	Если РезультатЗакрытия<>Неопределено Тогда
		Элементы.МатрицаПолитика1.ТекущиеДанные.Фонд = РезультатЗакрытия;
		МатрицаПолитика1ПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИсключаемыеФондыРасходов(тс, текПодр = Неопределено)
	ИсключитьФонды = новый массив;
	
	для каждого стр из Расходы.ПолучитьЭлементы() Цикл
		Если ЗначениеЗаполнено(стр.Фонд) и стр <> тс и 
			(ИспПодразделения = ложь или ((тс = Неопределено или стр.Подразделение = тс.Подразделение)   и (текПодр = Неопределено или стр.Подразделение = текПодр)))  Тогда
			ИсключитьФонды.Добавить(стр.Фонд);
		КонецЕсли;
		
		для каждого стр1 из стр.ПолучитьЭлементы() Цикл
			Если ЗначениеЗаполнено(стр1.Фонд) и стр1 <> тс и 
				(ИспПодразделения = ложь или ((тс = Неопределено или стр1.Подразделение = тс.Подразделение)  и (текПодр = Неопределено или стр1.Подразделение = текПодр)))  Тогда
				ИсключитьФонды.Добавить(стр1.Фонд);
			КонецЕсли;
			для каждого стр2 из стр1.ПолучитьЭлементы() Цикл
				Если ЗначениеЗаполнено(стр2.Фонд) и стр2 <> тс и 
					(ИспПодразделения = ложь или ((тс = Неопределено или стр2.Подразделение = тс.Подразделение)   и (текПодр = Неопределено или стр2.Подразделение = текПодр)))  Тогда
					ИсключитьФонды.Добавить(стр2.Фонд);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ИсключитьФонды;
КонецФункции

&НаКлиенте
Процедура РасходыФондНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	тс = Элементы.Расходы.ТекущиеДанные;
	ИсключитьФонды = ПолучитьИсключаемыеФондыРасходов(тс);
	
	отборФ = новый Структура("ПометкаУдаления", Ложь);
	Парам = Новый Структура("ИсключитьФонды, Отбор", ИсключитьФонды,отборФ);
	оп = новый ОписаниеОповещения("ЗавершениеВыбораФондаРасходы", ЭтотОбъект);
	ОткрытьФорму("Справочник.ИА_Фонды.ФормаВыбора", Парам, ЭтаФорма, , ,, оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораФондаРасходы(РезультатЗакрытия, ДопПарам) Экспорт
	Если РезультатЗакрытия<>Неопределено Тогда
		Элементы.Расходы.ТекущиеДанные.Фонд = РезультатЗакрытия;
		РасходыПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьВидимостьКнопкиПроведения();
	ОбновитьИтогиРасходов();
	ДоступностьФормыПоПроведению();
	
	ПоказатьСкрытьМатрицу_Глюк();
КонецПроцедуры


&НаКлиенте
Процедура ПредставлениеМесяцаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	//ПараметрыФормы 	   = Новый Структура("Значение, РежимВыбораПериода", Объект.Месяц, "МЕСЯЦ");
	ПараметрыФормы 	   = Новый Структура("ТекМесяц", Объект.Месяц);
	
	//ОткрытьФорму("ОбщаяФорма.КСУ_ВыборПериода",
	//	ПараметрыФормы, 
	//	ЭтотОбъект, 
	//	УникальныйИдентификатор,
	//	,
	//	, 
	//	ОбработчикЗакрытия,
	//	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ОткрытьФорму("ОбщаяФорма.КСУ_ФормаВыбораМесяца",
		ПараметрыФормы, 
		ЭтотОбъект, 
		УникальныйИдентификатор,
		,
		, 
		ОбработчикЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйПериод <> Неопределено Тогда
		
		Объект.Месяц = ВыбранныйПериод;
		ОбновитьПредставлениеМесяца();
		
		//
		МесяцПриИзмененииНаСервере();
		Объект.Дата = Объект.ДатаНачала;
		ОбновитьПредставлениеДиапазона();
		//
		Если ИспДоходыПодр Тогда
			ЗаполнитьДеревоДоходыПоПодразделениям();
			
			Для каждого стрПодр из Доходы.ПолучитьЭлементы() цикл
				Для каждого стр из стрПодр.ПолучитьЭлементы() цикл
					стр.НезависимыйРежим = ложь;
					ЗаполнитьНедельныеСуммыПропорционально(стр.ПолучитьИдентификатор(), "Доходы");
				КонецЦикла;
			КонецЦикла;
			ВидыДоходовПриИзменении(Элементы.ВидыДоходовПодр);
		Иначе
			Для каждого стр из Объект.ВидыДоходов цикл
				стр.НезависимыйРежим = ложь;
				ЗаполнитьНедельныеСуммыПропорционально(стр.ПолучитьИдентификатор(), "ВидыДоходов");
			КонецЦикла;
			
			ВидыДоходовПриИзменении(Элементы.ВидыДоходов);
		КонецЕсли;
		//
		ОбновитьИтогиРасходов();
		//
		
		Элементы.ГруппаТело.Доступность = ЗначениеЗаполнено(объект.Месяц);

		
		ОбновитьНадписьКнопкиОтДохода();
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьСкрытьНастрокиДоходов(Команда)
	ПоказатьНастройкиДохода = не ПоказатьНастройкиДохода;
	ОбновитьВидимостьНастроекДохода();
КонецПроцедуры


&НаКлиенте
Процедура ВидыДоходовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ВидыДоходовНезависимыйРежим" Тогда
		СтандартнаяОбработка = ложь;
		Элемент.ТекущиеДанные.НезависимыйРежим = не Элемент.ТекущиеДанные.НезависимыйРежим;
	ИначеЕсли Поле.Имя = "ВидыДоходовСбросРежима" Тогда
		СтандартнаяОбработка = ложь;
		Элемент.ТекущиеДанные.НезависимыйРежим = ложь;
		ЗаполнитьНедельныеСуммыПропорционально(Элемент.ТекущиеДанные.ПолучитьИдентификатор(), "ВидыДоходов");
		
		ВидыДоходовПриИзменении(Элементы.ВидыДоходов);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВидыДоходовПодрВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ВидыДоходовПодрНезависимыйРежим" Тогда
		СтандартнаяОбработка = ложь;
		Элемент.ТекущиеДанные.НезависимыйРежим = не Элемент.ТекущиеДанные.НезависимыйРежим;
	ИначеЕсли Поле.Имя = "ВидыДоходовПодрСбросРежима" Тогда
		СтандартнаяОбработка = ложь;
		Элемент.ТекущиеДанные.НезависимыйРежим = ложь;
		ЗаполнитьНедельныеСуммыПропорционально(Элемент.ТекущиеДанные.ПолучитьИдентификатор(), "Доходы");
		
		ВидыДоходовПриИзменении(Элементы.ВидыДоходовПодр);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РасходыПроцентПриИзменении(Элемент)
	// Проверка процента
	тд = Элементы.Расходы.ТекущиеДанные;
	СтрРодитель = тд.ПолучитьРодителя();
	ИтогоПроцентов = 0;
	Для каждого стр из СтрРодитель.ПолучитьЭлементы() Цикл
		ИтогоПроцентов = ИтогоПроцентов + стр.Процент;
	КонецЦикла;
	Если  ИтогоПроцентов > 100  Тогда
		стр.Процент = стр.Процент - (ИтогоПроцентов - 100);
	КонецЕсли;
	
	// пересчет сумм недель учредительских фондов
	СтрРодитель = тд.ПолучитьРодителя().ПолучитьРодителя();
	Если СтрРодитель = Неопределено Тогда
		СтрРодитель = Расходы;
	КонецЕсли;
	
	СтрМаржа = Неопределено;
	Для каждого стрРаздел из СтрРодитель.ПолучитьЭлементы() Цикл
		Если стрРаздел.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль") Тогда
			СтрМаржа = стрРаздел;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрМаржа = Неопределено тогда
		возврат;
	КонецЕсли;	
	
	ИтогоПоНеделям = 0;
	для счНед = 1 по КолНедель Цикл
		тд["Неделя" + счНед] = СтрМаржа["Неделя" + счНед] / 100 * тд.Процент;
		ИтогоПоНеделям = ИтогоПоНеделям + тд["Неделя" + счНед];
	КонецЦикла;
	//тд.Сумма = ИтогоПоНеделям;
	тд.Сумма = СтрМаржа.Сумма / 100 * тд.Процент;
	Если КолНедель > 1 Тогда // корр. округления
		Дельта = ИтогоПоНеделям - тд.Сумма;
		тд["Неделя" + КолНедель] = тд["Неделя" + КолНедель] - Дельта;
	КонецЕсли;
	//
	
	ПересчитатьИтогоКРаспределению();

	ОбновитьИтогиРасходов();

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогоКРаспределению()
	Если ИспДоходыПодр ТОгда
		Для каждого стрПодр из Расходы.ПолучитьЭлементы() Цикл
			ПересчитатьСтрокиИтогоКРаспределению(стрПодр.ПолучитьЭлементы());
		КонецЦикла;
	Иначе
		ПересчитатьСтрокиИтогоКРаспределению(Расходы.ПолучитьЭлементы());		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокиИтогоКРаспределению(СтрокиРасх)
	СтрокаМаржа = Неопределено;
	ИтогоПоУчр = Новый Структура("Сумма, Неделя1, Неделя2, Неделя3, Неделя4, Неделя5, Неделя6, Неделя7,Неделя8, Неделя9, Неделя10, Неделя11, Неделя12", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
	Для каждого стр из СтрокиРасх цикл
		Если стр.типСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.МаржинальнаяПрибыль") Тогда
			СтрокаМаржа = стр;
		ИначеЕсли стр.типСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.УчредительскиеФонды") Тогда
			Для каждого стрУчрФ из стр.ПолучитьЭлементы() Цикл
				Для каждого Кол из ИтогоПоУчр Цикл
					ИтогоПоУчр[Кол.Ключ] = ИтогоПоУчр[Кол.Ключ] + стрУчрФ[Кол.Ключ];
				КонецЦикла;
			КонецЦикла;
		ИначеЕсли стр.типСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ИтогКЗаливке") и СтрокаМаржа<>Неопределено Тогда
			Для каждого Кол из ИтогоПоУчр Цикл
				стр[Кол.Ключ] = СтрокаМаржа[Кол.Ключ] - ИтогоПоУчр[Кол.Ключ];
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗписатьТБ(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИсключаемыеДоходы(тс)
	ИсключитьДоходы = новый массив;
	
	для каждого стр из Объект.ВидыДоходов Цикл
		Если ЗначениеЗаполнено(стр.ВидДохода) и стр <> тс Тогда
			ИсключитьДоходы.Добавить(стр.ВидДохода);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИсключитьДоходы;
КонецФункции

&НаКлиенте
Процедура ВидыДоходовВидДоходаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	тс = Элементы.ВидыДоходов.ТекущиеДанные;
	ИсключитьДоходы = ПолучитьИсключаемыеДоходы(тс);
	
	Парам = Новый Структура("ИсключитьДоходы", ИсключитьДоходы);
	оп = новый ОписаниеОповещения("ЗавершениеВыбораДохода", ЭтотОбъект, новый Структура("НоваяСтрока", ложь));
	ОткрытьФорму("Справочник.ИА_ВидыДоходов.ФормаВыбора", Парам, ЭтаФорма, , ,, оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораДохода(РезультатЗакрытия, ДопПарам) Экспорт
	Если РезультатЗакрытия<>Неопределено Тогда
		Если ДопПарам.НоваяСтрока Тогда
			Новстр = Объект.ВидыДоходов.Добавить();
			Новстр.ВидДохода = РезультатЗакрытия;
			Новстр.ИДСтроки = иа_БФКС.СформироватьУИД();
			Новстр.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Вручную");
			
			Элементы.ВидыДоходов.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
		Иначе
			Элементы.ВидыДоходов.ТекущиеДанные.ВидДохода = РезультатЗакрытия;
		КонецЕсли;
		
		ВидыДоходовВидДоходаПриИзменении(Неопределено);
		ВидыДоходовПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовПодрВидДоходаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.ВидыДоходовПодр.ТекущиеДанные;
	Если тд<>Неопределено И тд.получитьРодителя() <> Неопределено Тогда // строка с видом дохода
		СтандартнаяОбработка = ложь;
		
		ИсключитьДоходы = новый массив;
		для каждого стр из тд.получитьРодителя().ПолучитьЭлементы() Цикл
			Если ЗначениеЗаполнено(стр.ВидДохода) и стр <> тд Тогда
				ИсключитьДоходы.Добавить(стр.ВидДохода);
			КонецЕсли;
		КонецЦикла;
	
		ПарамФорм = Новый Структура("ИсключитьДоходы", ИсключитьДоходы);
		ПарамОп = новый Структура("тд", тд);
		оп = новый ОписаниеОповещения("ПослеВводаЗначенияВидаДохода1", ЭтотОбъект, ПарамОп);
		ОткрытьФорму("Справочник.ИА_ВидыДоходов.ФормаВыбора", ПарамФорм, ЭтаФорма, , ,, оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияВидаДохода1(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда
		тд = Параметры.тд;
		    	
		тд.ВидДохода = ВыбЗнач;
		тд.ИДСтроки = СформироватьУИДДохода(ВыбЗнач);
		
		ВидыДоходовПриИзменении(Неопределено);
		
		Элементы.ВидыДоходовПодр.ТекущаяСтрока = тд.получитьИдентификатор();
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОтложенныйДоходВидДоходаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	масс = новый массив;
	ДЛя каждого стр из Объект.ВидыДоходов Цикл
		Если масс.Найти(стр.ВидДохода) = Неопределено Тогда
			масс.Добавить(стр.ВидДохода);
		КонецЕсли;
	КонецЦикла;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(масс);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВидДохода1(Команда)
	
	ИсключитьДоходы = ПолучитьИсключаемыеДоходы(Неопределено);
	
	Парам = Новый Структура("ИсключитьДоходы", ИсключитьДоходы);
	оп = новый ОписаниеОповещения("ЗавершениеВыбораДохода", ЭтотОбъект, новый Структура("НоваяСтрока", истина));
	ОткрытьФорму("Справочник.ИА_ВидыДоходов.ФормаВыбора", Парам, ЭтаФорма, , ,, оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПеремРасход(Команда)
	Если ИспПодразделения и не ИспДоходыПодр Тогда
		Парам = новый Структура;
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияПодразделения1ВМатр", ЭтотОбъект, Парам);
		зн = ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка");
		ПоказатьВводЗначения(Оповещение,зн,"Выберите подразделение");
	Иначе
		ДобавитьФондПеремРасход();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФондПеремРасход(Подр = Неопределено)
	
	ИсключитьФонды = новый массив;
	для каждого стр из МатрицаПолитика1.ПолучитьЭлементы() Цикл
		Если ЗначениеЗаполнено(стр.Фонд) и (Подр = Неопределено или стр.Подразделение = Подр) Тогда
			ИсключитьФонды.Добавить(стр.Фонд);
		КонецЕсли;
		
		для каждого стр1 из стр.ПолучитьЭлементы() Цикл
			Если ЗначениеЗаполнено(стр1.Фонд) и (Подр = Неопределено или стр1.Подразделение = Подр) Тогда
				ИсключитьФонды.Добавить(стр1.Фонд);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	отборФ = новый Структура("ПометкаУдаления", Ложь);
	Парам = Новый Структура("ИсключитьФонды,Подразделение,отбор", ИсключитьФонды,Подр,отборФ);
	оп = новый ОписаниеОповещения("ЗавершениеВыбораФондаНс", ЭтотОбъект, Парам);
	ОткрытьФорму("Справочник.ИА_Фонды.ФормаВыбора", Парам, ЭтаФорма, , ,, оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораФондаНс(РезультатЗакрытия, ДопПарам) Экспорт
	Если РезультатЗакрытия<>Неопределено Тогда
		Новстр = МатрицаПолитика1.ПолучитьЭлементы().Добавить();
		Новстр.Фонд = РезультатЗакрытия;
		Новстр.Подразделение = ДопПарам.Подразделение;
		МатрицаПолитика1ПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПолитика1ПодразделениеФондПриИзменении(Элемент)
	ТекСтрока = Элементы.МатрицаПолитика1.ТекущиеДанные;
	ЭтоПодр = ТекСтрока.ПолучитьРодителя() = Неопределено;
	
	Если ЭтоПодр Тогда 
		ТекСтрока.Подразделение = ТекСтрока.ПодразделениеФонд;
		Для каждого стрФ из ТекСтрока.ПолучитьЭлементы() Цикл
			стрФ.Подразделение = ТекСтрока.ПодразделениеФонд;
		КонецЦикла;
	Иначе
		ТекСтрока.Фонд = ТекСтрока.ПодразделениеФонд;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитыватьСуммыПриИзмененииПриИзменении(Элемент)
	Если ПересчитыватьСуммыПриИзменении Тогда
		ЗаполнитьСуммы(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоходовСуммаПриИзменении(Элемент)
	тд = Элементы.ВидыДоходов.ТекущиеДанные;
	ПересчетСуммДоходовПоНеделям(тд, "ВидыДоходов");
КонецПроцедуры

//&НаКлиенте
//Процедура СброситьНастройки(Команда)
//	СброситьНастройкиС();
//КонецПроцедуры

//&НаСервере
//Процедура СброситьНастройкиС()
//	
//	КлючОбъекта = "Документ.ИА_ФП_Настройка.Форма.ФормаДокумента/Такси/НастройкиОкна";
//    ИмяПользователя = ИмяПользователя();
//    ХранилищеСистемныхНастроек.Удалить(КлючОбъекта,"", Неопределено);
//    КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);
//КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьКнопкиОтДохода()
	ост = ИА_ФПСервер.ПолучитьОстатокОтлДохода(объект.Месяц, объект.Организация);
	элементы.ОтложенныйДоходПодборОтложенногоДохода.Заголовок = "Ранее отложенные средства ( "+формат(ост, "ЧДЦ=2; ЧН=")+" руб. )";
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьНадписьКнопкиОтДохода();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	тд = Расходы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если (поле = Элементы.РасходыФонд ИЛИ поле = Элементы.РасходыПодразделениеСтрока)
		и (тд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.УчредительскиеФонды") ИЛИ тд.ТипСтроки = ПредопределенноеЗначение("Перечисление.КСУ_ВидыСтрокТБ.ПостоянныеРасходы"))
		И тд.ЭтоЗаголовок Тогда
		ДобавитьРасход(Неопределено);
		СтандартнаяОбработка = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СправкаДоходы(Команда)
	ТекстСправки = "<html><head>
                    |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
                    |<link rel=""stylesheet"" type=""text/css"" href=""v8help://service_book/service_style"">
                    |<base href=""v8config://884a9bdc-1245-4501-9671-550a4b274bf3/mdobject/ideba5be67-4765-4073-af49-2d3604e74915/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">
                    |</head>
                    |<body><span id=""docs-internal-guid-f3fd83c4-7fff-8342-bb1d-f913fdbde160"">
                    |<p dir=""ltr"" style=""line-height:1.7999999999999998;margin-top:0pt;margin-bottom:0pt;""><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;"">Общий принцип действия с разделом ""Доходы"" такой:&nbsp;</span></p>
                    |<p dir=""ltr"" style=""line-height:1.7999999999999998;margin-top:0pt;margin-bottom:0pt;""><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;""><br></span><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;"">(1) добавляем виды доходов, </span><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;""><br></span><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;"">(2) вносим план по доходу на месяц по каждому виду дохода, </span><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;""><br></span><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;"">(3) если нужно скорректировать доход по неделям, то устанавливаем нужный режим ручной корректировки по неделям (двойной клик по иконке </span><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;""><span style=""border:none;display:inline-block;overflow:hidden;width:16px;height:16px;""><img src=""https://lh4.googleusercontent.com/04J5_lKchejS6D6FuE3ZNfhvXEakyXjVfsdwyze3kTVkqxS184P0Be5Wl3PBJ5r39l7dWkOrh0fmrjLhZJET8ke3Y6t-mpqGf9Ex4Q7bGnGbaTFixIFLjKw-j7ZPOUVC6ghoLbC-"" width=""16"" height=""16"" style=""margin-left:0px;margin-top:0px;""></span></span><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;""> или по </span><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;""><span style=""border:none;display:inline-block;overflow:hidden;width:16px;height:16px;""><img src=""https://lh4.googleusercontent.com/N7gEDthyL4Nrpl5d1ztD2MeMox7tBepX7YoCCDOAaOIklUNvL-NRq_9eU6ag7pYx9St44AySW2AuNCdKb4yGopn9xvVcybhh-5GYuQXnwvM7n9S3woUZ4lkQiLfoESXYiaCjuvtz"" width=""16"" height=""16"" style=""margin-left:0px;margin-top:0px;""></span></span><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;""> ) и уточняем план по доходу по неделям. Если нужно откатиться к распределению по умолчанию (пропорционально количеству дней в неделе), то делаем сброс двойным кликом по иконке </span><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;""><span style=""border:none;display:inline-block;overflow:hidden;width:16px;height:16px;""><img src=""https://lh5.googleusercontent.com/eVoKo7lu6GEDlFi0pbNQwOGNXGJ9cyLu6SV0tnMaN00fV84U0aEBOpR2EChjfh4rjurEEFc9-9kdFwVl-FekgCvjgeBthRzujPrcp4_yMmBVrMzGB-001IAOYZj4wKnfrC9w0d3K"" width=""16"" height=""16"" style=""margin-left:0px;margin-top:0px;""></span></span><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;"">.&nbsp;</span></p>
                    |<p dir=""ltr"" style=""line-height:1.7999999999999998;margin-top:0pt;margin-bottom:0pt;""><b style=""font-weight:normal;"" id=""docs-internal-guid-d2ab7066-7fff-3617-a8ea-5e40e4f17d80""><br></b></p>
                    |<p dir=""ltr"" style=""line-height:1.7999999999999998;margin-top:0pt;margin-bottom:0pt;""><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;"">Помимо известных видов доходов мы рекомендуем добавлять отдельными строками виды дохода ""Прочее (за услуги)"" и ""Прочее (за товары)"" для случая, если в течение месяца поступил доход из источника, о котором вы заранее не могли предугадать. План по доходу для этих двух строк установите ноль. Если вы поймете, что эти доходы могут стать систематическими, то в ТБ на следующий месяц вы сможете добавить подходящий новый вид дохода.&nbsp;</span></p>
                    |<p dir=""ltr"" style=""line-height:1.7999999999999998;margin-top:0pt;margin-bottom:0pt;""><br></p>
                    |<p dir=""ltr"" style=""line-height:1.7999999999999998;margin-top:0pt;margin-bottom:0pt;""><span style=""font-size:9pt;font-family:Arial;color:#000000;background-color:#ffffff;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;"">При проведении еженедельных финансовых планирований данные о фактических доходах за неделю можно собирать в одном из трех режимов – ручном, в автоматическом режиме (через специальный запрос к входящим платежам) или в режиме настраиваемой формулы. Для этого в разделе ТБ ""Доходы"" необходимо произвести специальную настройку для каждого вида доходов. Такую настройку может выполнить только специалист 1С или специалист компании-разработчика ""ИНСАЙТ"".&nbsp;</span></p></span>
                    |
                    |
                    |</body></html>";
	ОткрытьФорму("ОбщаяФорма.КСУ_Справка", новый Структура("ТекстСправки, Заголовок", ТекстСправки, "Доходы"));
КонецПроцедуры

&НаКлиенте
Процедура СправкаОтлДоход(Команда)
	ТекстСправки = "<html><head>
                    |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
                    |<link rel=""stylesheet"" type=""text/css"" href=""v8help://service_book/service_style"">
                    |<base href=""v8config://05402c2a-8cf1-4912-8a65-ee362c6944a5/mdobject/id3c0aa1ce-744a-450b-9aa5-8974c3ebe1be/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">
                    |</head>
                    |<body><span style=""font-family: Arial; font-size: 13px; font-variant-ligatures: normal; orphans: 2; white-space: pre-wrap; widows: 2;"">Если вы предполагаете, что часть средств, которые вы планируете получить в течение месяца, вы не сможете отработать и поэтому хотели бы отложить их ""в сторону"", чтобы случайно не истратить их на нужды компании, используйте операции с отложенным доходом с конкретного вида дохода. Вы можете запланировать откладывание средств и возврат средств с ранее отложенных средств.
                    |
                    |Обратите внимание, что отложенные средства уменьшают сумму средств, спускаемых вниз на заливку всех без исключения фондов. Таким образом вы можете запланировать такой доход, который покроет все расходы даже с учетом отложенных средств (или вовзращенных из ранее отложенных).</span>
                    |
                    |
                    |</body></html>";
	ОткрытьФорму("ОбщаяФорма.КСУ_Справка", новый Структура("ТекстСправки, Заголовок", ТекстСправки, "Планируемые операции с отложенным доходом"));
КонецПроцедуры

&НаКлиенте
Процедура СправкаПеремРасходы(Команда)
	ТекстСправки = "<html><head>
                    |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
                    |<link rel=""stylesheet"" type=""text/css"" href=""v8help://service_book/service_style"">
                    |<base href=""v8config://05402c2a-8cf1-4912-8a65-ee362c6944a5/mdobject/id3c0aa1ce-744a-450b-9aa5-8974c3ebe1be/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">
                    |</head>
                    |<body><span style=""font-family: Arial; font-size: 13px; font-variant-ligatures: normal; orphans: 2; white-space: pre-wrap; widows: 2;"">Переменные расходы – это расходы, которые увеличиваются при увеличении дохода, продажи услуг или объема производства. Например, «Расчеты с поставщиками».
                    |(1) Добавьте фонды переменных расходов. (2) Настройте правила заливки для каждого фонда. Расчеты по заливке каждой недели будут пересчитываться автоматически пропорционально распределению дохода для каждой недели.</span></body></html>";
	ОткрытьФорму("ОбщаяФорма.КСУ_Справка", новый Структура("ТекстСправки, Заголовок", ТекстСправки, "Настройка переменных расходов"));
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасходы(Команда)
	ТекстСправки = "<html><head>
                    |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
                    |<link rel=""stylesheet"" type=""text/css"" href=""v8help://service_book/service_style"">
                    |<base href=""v8config://05402c2a-8cf1-4912-8a65-ee362c6944a5/mdobject/id3c0aa1ce-744a-450b-9aa5-8974c3ebe1be/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">
                    |</head>
                    |<body><span id=""docs-internal-guid-f06c11eb-7fff-bda1-82ef-274745c1c6d9"">
                    |<p dir=""ltr"" style=""line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;""><span style=""font-size: 8.5pt; font-family: Verdana; background-color: transparent; font-variant-ligatures: normal; font-variant-east-asian: normal; font-variant-position: normal; vertical-align: baseline; white-space: pre-wrap;"">В этом разделе показываются числовые показатели расчетной заливки в фонды переменных расходов (сами настройки регулируются в разделе ""Добавление и настройки переменных расходов""), расчетная маржинальная прибыль, настройки и перечень фондов для заливки фондов в процентном выражении от маржинальной прибыли, а также фонды постоянных расходов, выраженные в явных суммах расхода за месяц.&nbsp;</span></p>
                    |<p dir=""ltr"" style=""line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;"">&nbsp;</p>
                    |<p dir=""ltr"" style=""line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;""><span style=""font-size: 8.5pt; font-family: Verdana; background-color: transparent; font-variant-ligatures: normal; font-variant-east-asian: normal; font-variant-position: normal; vertical-align: baseline; white-space: pre-wrap;"">Чтобы добавить фонд в подраздел ""Фонды из маржи"", поставьте курсор на строку ""Фонды из маржи"" и кликните кнопку ( </span><span style=""font-size: 8.5pt; font-family: Verdana; background-color: transparent; font-variant-ligatures: normal; font-variant-east-asian: normal; font-variant-position: normal; vertical-align: baseline; white-space: pre-wrap;""><span style=""border:none;display:inline-block;overflow:hidden;width:14px;height:14px;""><img src=""https://lh6.googleusercontent.com/nimI2xzUV3D2Q4D7MLF97x4BC5d9kS7HwTiT0Ll77j9FOWCUnHnN95auBq1H1PZnVJPRqi7bPREEcTQVwTD0olK5MwNkAfxSLmrkJT2GbMr48cyGyc8XvW4V0nuISkhUhZbOrgak"" width=""14"" height=""14"" style=""margin-left:0px;margin-top:0px;""></span></span><span style=""font-size: 8.5pt; font-family: Verdana; background-color: transparent; font-variant-ligatures: normal; font-variant-east-asian: normal; font-variant-position: normal; vertical-align: baseline; white-space: pre-wrap;""> ). Для добавления строки с фондом в раздел ""Постоянные расходы"" – поступите аналогичным образом.&nbsp;</span></p>
                    |<p dir=""ltr"" style=""line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;"">&nbsp;</p>
                    |<p dir=""ltr"" style=""line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;""><span style=""font-size: 8.5pt; font-family: Verdana; background-color: transparent; font-variant-ligatures: normal; font-variant-east-asian: normal; font-variant-position: normal; vertical-align: baseline; white-space: pre-wrap;"">ВАЖНО: помните, что самый нижний фонд в перечне фондов постоянных расходов в рамках еженедельных финансовых планирований заливается в последнюю очередь! Если вы хотите весь месячный перелив (перевыполнение плана на месяц) залить в этот фонд и эти средства попали бы только на последней неделе месяца, введите в эту строку нулевой план по расходу на месяц.</span></p><br></span></body></html>";
	ОткрытьФорму("ОбщаяФорма.КСУ_Справка", новый Структура("ТекстСправки, Заголовок", ТекстСправки, "Расходы"));
КонецПроцедуры


