
//++ №12763
Функция ПолучитьНастройкуВремениРеакцииПоЛидам() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЛида.Ссылка КАК СтатусЛида,
	|	ЕСТЬNULL(НастройкиВремениРеакцииПоЛидам.ВремяВЧасах, 0) КАК ВремяВЧасах
	|ИЗ
	|	Справочник.СтатусыЛида КАК СтатусыЛида
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВремениРеакцииПоЛидам КАК НастройкиВремениРеакцииПоЛидам
	|		ПО СтатусыЛида.Ссылка = НастройкиВремениРеакцииПоЛидам.СтатусЛида
	|
	|ГДЕ
	|	НЕ СтатусыЛида.ПометкаУдаления
	|	И НЕ СтатусыЛида.Наименование ПОДОБНО ""%(не используется)%""
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыЛида.РеквизитДопУпорядочивания
	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура СохранитьНастройкуВремениРеакцииПоЛидам(НастройкиВремениРеакцииПоЛидам) Экспорт
	
	// Очищаем настройки в регистре, т.к. туда фиксируем только данные со значениями
	НаборЗаписей = РегистрыСведений.НастройкиВремениРеакцииПоЛидам.СоздатьНаборЗаписей();
	НаборЗаписей.Очистить();
	
	Для Каждого ТекущаяСтрока Из НастройкиВремениРеакцииПоЛидам Цикл
		
		Если НЕ ТекущаяСтрока.ВремяВЧасах = 0 Тогда
			
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
//-- №12763