&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Организация = иа_фп.ПолучитьГоловнуюОрганизацию(Организация);
	КонецЕсли;

	
	// Вставить содержимое обработчика.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ФинансовоеПланированиеОтложенныйДоход.ид КАК ИсточникОтлДохода,
	               |	СУММА(ИА_ФинансовоеПланированиеОтложенныйДоход.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ Возвраты
	               |ИЗ
	               |	Документ.ИА_ФинансовоеПланирование.ОтложенныйДоход КАК ИА_ФинансовоеПланированиеОтложенныйДоход
	               |ГДЕ
	               |	ИА_ФинансовоеПланированиеОтложенныйДоход.ТипОперации = ЗНАЧЕНИЕ(Перечисление.КСУ_ОперацииСОтложеннымДоходом.Вернуть)
	               |	И ИА_ФинансовоеПланированиеОтложенныйДоход.Ссылка = &Док
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_ФинансовоеПланированиеОтложенныйДоход.ид
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Перемещения.ИсточникОтложенногоДохода КАК ИсточникОтлДохода,
	               |	СУММА(Перемещения.СуммаБезнал) КАК Сумма
	               |ПОМЕСТИТЬ Займы
	               |ИЗ
	               |	Документ.ИА_ФинансовоеПланирование.РаспределениеПоФондам КАК Перемещения
	               |ГДЕ
	               |	Перемещения.ЗаймВозврат = ЗНАЧЕНИЕ(Перечисление.ИА_ЗаймВозврат.Займ)
	               |	И Перемещения.Ссылка = &Док
	               |	И Перемещения.ИсточникОтложенногоДохода <> НЕОПРЕДЕЛЕНО
	               |	И Перемещения.ИсточникОтложенногоДохода <> ЗНАЧЕНИЕ(Справочник.ИА_ИсточникиСпецДохода.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Перемещения.ИсточникОтложенногоДохода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_ДоходыБудущихПериодов.ВидДохода КАК ВидДохода,
	               |	ИА_ДоходыБудущихПериодов.Источник КАК Источник,
	               |	ИА_ДоходыБудущихПериодов.Источник.НаименованиеИД КАК НаименованиеИД,
	               |	ИА_ДоходыБудущихПериодов.Источник.ДатаОперации КАК ДатаОперации,
	               |	ИА_ДоходыБудущихПериодов.СуммаБезналОстаток - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(Займы.Сумма, 0) КАК Сумма,
	               |	ЕСТЬNULL(Займы.Сумма, 0) + ЕСТЬNULL(ЗаймыСФондов.СуммаБезналОстаток, 0) КАК Займ,
	               |	ИА_ДоходыБудущихПериодов.Подразделение КАК Подразделение,
	               |	ИА_ДоходыБудущихПериодов.Источник.Комментарий КАК Комментарий,
	               |	ИА_ДоходыБудущихПериодов.Источник.ДоДаты КАК ДоДаты
	               |ИЗ
	               |	РегистрНакопления.ИА_ДоходыБудущихПериодов.Остатки(
	               |			&ДатаОстатков,
	               |			Организация = &Организация
	               |				ИЛИ &НеРазделять) КАК ИА_ДоходыБудущихПериодов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_ЗаймыСФондов.Остатки(&ДатаОстатков, ) КАК ЗаймыСФондов
	               |		ПО (ЗаймыСФондов.ИсточникОтложенногоДохода = ИА_ДоходыБудущихПериодов.Источник)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Возвраты КАК Возвраты
	               |		ПО (Возвраты.ИсточникОтлДохода = ИА_ДоходыБудущихПериодов.Источник)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Займы КАК Займы
	               |		ПО (Займы.ИсточникОтлДохода = ИА_ДоходыБудущихПериодов.Источник)
	               |ГДЕ
	               |	ИА_ДоходыБудущихПериодов.СуммаБезналОстаток - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(Займы.Сумма, 0) > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ИА_ФинансовоеПланированиеОтложенныйДоход.ВидДохода,
	               |	ИА_ФинансовоеПланированиеОтложенныйДоход.ид,
	               |	ИА_ФинансовоеПланированиеОтложенныйДоход.ид.НаименованиеИД,
	               |	&ДатаДокумента,
	               |	ИА_ФинансовоеПланированиеОтложенныйДоход.Сумма,
	               |	0,
	               |	ИА_ФинансовоеПланированиеОтложенныйДоход.Подразделение,
	               |	ИА_ФинансовоеПланированиеОтложенныйДоход.Комментарий,
	               |	ИА_ФинансовоеПланированиеОтложенныйДоход.ДоДаты
	               |ИЗ
	               |	Документ.ИА_ФинансовоеПланирование.ОтложенныйДоход КАК ИА_ФинансовоеПланированиеОтложенныйДоход
	               |ГДЕ
	               |	ИА_ФинансовоеПланированиеОтложенныйДоход.ТипОперации = ЗНАЧЕНИЕ(Перечисление.КСУ_ОперацииСОтложеннымДоходом.Отложить)
	               |	И ИА_ФинансовоеПланированиеОтложенныйДоход.Ссылка = &Док
	               |	И &ВключитьТекДок = ИСТИНА
	               |	И ИА_ФинансовоеПланированиеОтложенныйДоход.ид <> ЗНАЧЕНИЕ(Справочник.ИА_ИсточникиСпецДохода.Пустаяссылка)";
	Запрос.УстановитьПараметр("ДатаОстатков", новый Граница(ДатаОстатков,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаОстатков);
	
	орг1 = ИА_ФП.ПолучитьГоловнуюОрганизацию(Организация);
	Запрос.УстановитьПараметр("Организация", орг1);
	
	Запрос.УстановитьПараметр("НеРазделять", не Константы.ИА_ФП_ВестиФППоОрганизациям.Получить());
	Запрос.УстановитьПараметр("Док", Док);
	Запрос.УстановитьПараметр("ВключитьТекДок", ВключитьТекДок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаНал = 0;
	СуммаБезнал = 0;
	СуммаЗайм = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сумма <> 0 Тогда
			Новстр = ТаблицаДоходов.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр, Выборка);
			                                                            
			СуммаБезнал = СуммаБезнал + Выборка.Сумма;
			СуммаЗайм = СуммаЗайм + Выборка.Займ;
		КонецЕсли;
	КонецЦикла;
		
	Элементы.ТаблицаДоходов.ПодчиненныеЭлементы.ТаблицаДоходовСумма.ТекстПодвала = СуммаБезнал;
	Элементы.ТаблицаДоходовПодразделение.Видимость = ИспДоходыПоПодразделениям;

	Элементы.ДекорацияДоступно.Заголовок = формат(СуммаБезнал, "ЧДЦ=2; ЧН=");
	Элементы.ДекорацияЗаймы.Заголовок = формат(СуммаЗайм, "ЧДЦ=2; ЧН=");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	// Вставить содержимое обработчика.
	Если Только1 Тогда
		сч = 0;
		Для Каждого стр из ТаблицаДоходов Цикл
			Если стр.выбрать Тогда
				сч = сч + 1;
			КонецЕсли;
		КонецЦикла;
		Если сч> 1 Тогда
			ПоказатьПредупреждение(,"Необходимо выбрать только 1 строчку!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Рез = новый Массив;

	Для Каждого стр из ТаблицаДоходов Цикл
		стр.СуммаБезнал = стр.Сумма;
		Если стр.Выбрать Тогда
			НовЗап = Новый структура("СуммаБезнал,ВидДохода,Источник,Подразделение,Сумма,ДоДаты,Комментарий");
			ЗаполнитьЗначенияСвойств(НовЗап,стр);
			Рез.Добавить(НовЗап);
		КонецЕсли;
	КонецЦикла;
		
	Закрыть(Рез);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Док",Док);
	Параметры.Свойство("Организация",Организация);
	Параметры.Свойство("Только1", Только1);
	Параметры.Свойство("ИспДоходыПоПодразделениям", ИспДоходыПоПодразделениям);
	Параметры.Свойство("ДатаОстатков", ДатаОстатков);
	Параметры.Свойство("ВключитьТекДок", ВключитьТекДок);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Организация = иа_фп.ПолучитьГоловнуюОрганизацию(Организация);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДоходовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	тд = Элементы.ТаблицаДоходов.ТекущиеДанные;
	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ИсторияОтложенногоДохода", новый Структура("Период,Источник", ДатаОстатков, тд.Источник));
КонецПроцедуры

