#Область ОбработкаСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		Валюта 		= ДанныеЗаполнения.Валюта;
		ВидЦеныПоставщика = ДанныеЗаполнения.ВидЦеныПоставщика;
		Контрагент 	= ДанныеЗаполнения.Контрагент;
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Основание 	= ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
				СтруктураЦветаИФактуры = Справочники.ЦветФактуры.ПолучитьЦветИФактуруНоменклатуры(ТекСтрокаТовары.Номенклатура);
				Если СтруктураЦветаИФактуры.Результат Тогда				
					НоваяСтрока = Материалы.Добавить();
					НоваяСтрока.Фактура 	= СтруктураЦветаИФактуры.Фактура;
					НоваяСтрока.ЦветФактуры = СтруктураЦветаИФактуры.ЦветФактуры;
					НоваяСтрока.Цена 		= ТекСтрокаТовары.Цена;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЦеныМатериаловПоставщиков
	Движения.ЦеныМатериаловПоставщиков.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		Движение = Движения.ЦеныМатериаловПоставщиков.Добавить();
		Движение.Период 			= Дата;
		Движение.Контрагент 		= Контрагент;
		Движение.ВидЦеныПоставщика 	= ВидЦеныПоставщика;
		Движение.Валюта 			= Валюта;
		Движение.ВидНоменклатуры 	= ВидНоменклатуры;
		Движение.Фактура 			= ТекСтрокаМатериалы.Фактура;
		Движение.ЦветФактуры 		= ТекСтрокаМатериалы.ЦветФактуры;
		Движение.Цена 				= ТекСтрокаМатериалы.Цена;
		Движение.ЦенаСФотопечатью 	= ТекСтрокаМатериалы.ЦенаСФотопечатью;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
