
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.ПоКоманде Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСозданияПоВопросу;
		Элементы.Сформировать.КнопкаПоУмолчанию = Истина;
		
		Если ТипЗнч(Параметры.ПозицииКПеремещению) = Тип("Структура") Тогда
			Для Каждого ТекущаяСтрока Из Параметры.ПозицииКПеремещению.ТЗ_КВыдаче Цикл
				НоваяСтрока = КПеремещению.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				НоваяСтрока.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Выдача;
			КонецЦикла;
			Для Каждого ТекущаяСтрока Из Параметры.ПозицииКПеремещению.ТЗ_КВозврату Цикл
				НоваяСтрока = КПеремещению.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				НоваяСтрока.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Возврат;
			КонецЦикла;
		КонецЕсли;	
	Иначе
		Заголовок = "Подбор позиций к перемещению";
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСозданияПоКоманде;
		Элементы.ПодтвердитьСозданиеПеремещения.КнопкаПоУмолчанию = Истина;
		
		Если ТипЗнч(Параметры.ПозицииКПеремещению) = Тип("Массив") Тогда
			Для Каждого ТекущаяСтрока Из Параметры.ПозицииКПеремещению Цикл
				НоваяСтрока = КПеремещению.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Закрыть(КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьСозданиеПеремещения(Команда)
	
	ТаблицаПеремещения = Новый Массив;	
	Для каждого СтрокаПотребности из КПеремещению Цикл
		Если СтрокаПотребности.Пометка И СтрокаПотребности.Количество > 0 Тогда			
			НовСтрока = ПолучитьСтруктуруСтрокиДляПеремещения();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаПотребности);
			ТаблицаПеремещения.Добавить(НовСтрока);
		КонецЕсли;	
	КонецЦикла;
	
	Закрыть(ТаблицаПеремещения);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруСтрокиДляПеремещения()
	
	Возврат Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Количество, Таблица,
							|КоличествоМонтаж, Выдано, Возврат, Осталось");
	
КонецФункции

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого СтрокаПеремещения из КПеремещению Цикл
		СтрокаПеремещения.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого СтрокаПеремещения из КПеремещению Цикл
		СтрокаПеремещения.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КПеремещению1КоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КПеремещению1.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Пометка = (ТекущиеДанные.Количество > 0);
	
КонецПроцедуры



