Процедура ЗарегистрироватьНоменклатуру(Ссылка)
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Если Ссылка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Портал.Ссылка
	|ИЗ
	|	ПланОбмена.Портал КАК Портал
	|ГДЕ
	|	НЕ Портал.ПометкаУдаления
	|	И Портал.ВыполнятьОбменНоменклатурой";
	УзлыОбмена = Запрос.Выполнить().Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка.ФильтрНоменклатура.Количество() = 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
		Иначе
			ЗапросФильтр = Новый Запрос;
			ЗапросФильтр.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка = &Ссылка
			|	И Номенклатура.Ссылка В ИЕРАРХИИ(&СписокНоменклатуры)";
			ЗапросФильтр.УстановитьПараметр("Ссылка", Ссылка);
			ЗапросФильтр.УстановитьПараметр("СписокНоменклатуры", УзлыОбмена.Ссылка.ФильтрНоменклатура.ВыгрузитьКолонку("Номенклатура"));
			Если ЗапросФильтр.Выполнить().Выбрать().Количество() > 0 Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьЦвет(Ссылка)
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Если Ссылка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Портал.Ссылка
	|ИЗ
	|	ПланОбмена.Портал КАК Портал
	|ГДЕ
	|	НЕ Портал.ПометкаУдаления
	|	И Портал.ВыполнятьОбменФактурами";
	УзлыОбмена = Запрос.Выполнить().Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка.ФильтрФактура.Количество() = 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
		Иначе
			ЗапросФильтр = Новый Запрос;
			ЗапросФильтр.Текст = 
			"ВЫБРАТЬ
			|	Цвет.Ссылка
			|ИЗ
			|	Справочник.ЦветФактуры КАК Цвет
			|ГДЕ
			|	Цвет.Ссылка = &Ссылка
			|	И Цвет.Владелец.Ссылка В ИЕРАРХИИ(&СписокФактур)";
			ЗапросФильтр.УстановитьПараметр("Ссылка", Ссылка);
			ЗапросФильтр.УстановитьПараметр("СписокФактур", УзлыОбмена.Ссылка.ФильтрФактура.ВыгрузитьКолонку("Фактура"));
			Если ЗапросФильтр.Выполнить().Выбрать().Количество() > 0 Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры

Процедура ЗарегистрироватьФактуру(Ссылка)
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Если Ссылка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Портал.Ссылка
	|ИЗ
	|	ПланОбмена.Портал КАК Портал
	|ГДЕ
	|	НЕ Портал.ПометкаУдаления
	|	И Портал.ВыполнятьОбменФактурами";
	УзлыОбмена = Запрос.Выполнить().Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка.ФильтрФактура.Количество() = 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
		Иначе
			ЗапросФильтр = Новый Запрос;
			ЗапросФильтр.Текст = 
			"ВЫБРАТЬ
			|	Цвет.Ссылка
			|ИЗ
			|	Справочник.ЦветФактуры КАК Цвет
			|ГДЕ
			|	Цвет.Владелец.Ссылка = &Ссылка
			|	И Цвет.Владелец.Ссылка В ИЕРАРХИИ(&СписокФактур)";
			ЗапросФильтр.УстановитьПараметр("Ссылка", Ссылка);
			ЗапросФильтр.УстановитьПараметр("СписокФактур", УзлыОбмена.Ссылка.ФильтрФактура.ВыгрузитьКолонку("Фактура"));
			ВыборкаФильтр = ЗапросФильтр.Выполнить().Выбрать();
			Пока ВыборкаФильтр.Следующий() Цикл
				ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, ВыборкаФильтр.Ссылка);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ДатаЗамераЛидаАктуальная(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лид.Ссылка
	|ИЗ
	|	Документ.Лид.Замеры КАК Лид
	|ГДЕ
	|	Лид.ДатаЗамера >= &ДатаЗамера
	|	И Лид.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаЗамера", НачалоДня(ТекущаяДатаСеанса()));
	Если Запрос.Выполнить().Выбрать().Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Процедура ЗарегистрироватьЛид(Ссылка)
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ДатаЗамераЛидаАктуальная(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Портал.Ссылка
	|ИЗ
	|	ПланОбмена.Портал КАК Портал
	|ГДЕ
	|	НЕ Портал.ПометкаУдаления
	|	И Портал.ВыполнятьОбменЗамерами";
	УзлыОбмена = Запрос.Выполнить().Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка.ФильтрЗамерщики.Количество() = 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
		Иначе
			ЗапросФильтр = Новый Запрос;
			ЗапросФильтр.Текст = 
			"ВЫБРАТЬ
			|	Сотрудники.Ссылка
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	Сотрудники.Ссылка = &Ссылка
			|	И Сотрудники.Ссылка В ИЕРАРХИИ(&Список)
			|	И Сотрудники.ВыполняетЗамеры";
			ЗапросФильтр.УстановитьПараметр("Ссылка", Ссылка);
			ЗапросФильтр.УстановитьПараметр("Список", УзлыОбмена.Ссылка.ФильтрЗамерщики.ВыгрузитьКолонку("Сотрудник"));
			Если ЗапросФильтр.Выполнить().Выбрать().Количество() > 0 Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
		
КонецПроцедуры

Процедура ЗарегистрироватьОбъектКОбмену(Ссылка) Экспорт

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Фактура") Тогда
		ЗарегистрироватьФактуру(Ссылка);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.ЦветФактуры") Тогда
		ЗарегистрироватьЦвет(Ссылка.Владелец);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		ЗарегистрироватьНоменклатуру(Ссылка);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.Лид") Тогда
		ЗарегистрироватьЛид(Ссылка);
	КонецЕсли;

КонецПроцедуры
 