&НаСервере
Процедура СинхронизироватьСПодразделениями1СНаСервере()
	Запрос = новый запрос;
	
	попытка
		с = Справочники["Подразделения"].ПустаяСсылка();
		запрос.Текст = "ВЫБРАТЬ
		               |	Подразделения.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Подразделения КАК Подразделения
		               |ГДЕ
		               |	Подразделения.ПометкаУдаления = ЛОЖЬ";
	Исключение
		запрос.Текст = "ВЫБРАТЬ
		               |	Подразделения.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.СтруктурныеЕдиницы КАК Подразделения
		               |ГДЕ
		               |	Подразделения.ПометкаУдаления = ЛОЖЬ";
	КонецПопытки;
	
	выборка = запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() цикл
		ИА_ФП.КСУ_ПриЗаписиПодразделенияПриЗаписи( выборка.ссылка, ложь);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьСПодразделениями1С(Команда)
	СинхронизироватьСПодразделениями1СНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ФормаСинхронизироватьСПодразделениями1С.Видимость = Константы.КСУ_СинхронизацияСтатейИПодразделений.Получить();
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПомеченные(Команда)
	Элементы.КомандаПоказатьПомеченные.Пометка = не Элементы.КомандаПоказатьПомеченные.Пометка;
	
	УстОтборПомеченных(Элементы.КомандаПоказатьПомеченные.Пометка);
КонецПроцедуры

&НаСервере
Процедура УстОтборПомеченных(ТекЗн)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ТекЗн);
КонецПроцедуры
