
//Функция контроля остатков по регистру
//Возвращает:
//истина 	- контроль остатков пройден, бонусы могут быть списаны
//ложь 		- контроль остатков не пройден 
//
Функция КонтрольОстатков(Знач Документ, Знач Контрагент, Знач ДисконтнаяКарта, Знач СуммаБонусовКСписанию) Экспорт
	
	Результат = Истина;

	ДатаДвижения = Документ.Дата;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекДата", Новый Граница(ДатаДвижения, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта);

	ТекстОшибки = "Недостаточно бонусов (%1, %2) для списания. Остаток: %3, списывается: %4";
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Контрагент КАК Контрагент,
	|	Остатки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	Остатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.БонусыКонтрагентов.Остатки(
	|			&ТекДата,
	|			Контрагент = &Контрагент
	|				И ДисконтнаяКарта = &ДисконтнаяКарта) КАК Остатки";
	
	ВыборкаОстаток = Запрос.Выполнить().Выбрать();
	Если ВыборкаОстаток.Следующий() Тогда
		Если ВыборкаОстаток.Сумма < СуммаБонусовКСписанию Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Контрагент, ДисконтнаяКарта, ВыборкаОстаток.Сумма, СуммаБонусовКСписанию);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Результат = Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Контрагент, ДисконтнаяКарта, 0, СуммаБонусовКСписанию);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;

	
КонецФункции
