
Функция ПреобразоватьТекстВHTML(Знач ИсходныйТекст)
	
	Возврат СтрЗаменить(ИсходныйТекст,Символы.ПС,"<br>");
	
КонецФункции

//отправляет указанное электронное письмо
//параметры:
//ссылка - ссылка на документ "Электронное письмо"
//
//возвращаемое значение:
//строка с текстом ошибки отправки. пустая строка, если успешно отправлено
Функция ОтправитьЭлектронноеПисьмо(Ссылка) Экспорт
	
	Если НЕ Ссылка.Входящее Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		//++ №8201 текст ошибок будет накапливаться и сразу меняем в объекте
		ОписаниеОшибки = "";
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		//-- №8201
			
		//Если Не Ссылка.Получатели.Количество() = 0 Тогда
		Для Каждого Строка Из ДокументОбъект.Получатели Цикл //Ссылка.Получатели Цикл
			
			//++ №8201 новый реквизит взводится при успешной отправке, соответственно если уже отправлялось ранее, повторно не отправляем
			Если Строка.Отправлено Тогда
				Продолжить;
			КонецЕсли;
			//-- №8201
			
			ОтправитьЭлектронноеПисьмоПроцесс(Ссылка, Строка.Контрагент, Строка.Email, Строка, ОписаниеОшибки); //++ вывели в отдельную процедуру
				
			//++ №8201 закомментировано, объект меняем после попытки отправки каждому получателю
			//ДокументОбъект = Ссылка.ПолучитьОбъект();
			//ДокументОбъект.Отправлен = Истина;
			//ДокументОбъект.ДатаОтправки = ТекущаяДатаСеанса();
			//ДокументОбъект.Записать();
			//-- №8201
			
			//Возврат ""; ++ №8201 сразу не возвращаем, иначе 2 и более получатель не получат письмо
						
		КонецЦикла;
		
		//++ №8201 Один получатель
		Если ДокументОбъект.Получатели.Количество() = 0 Тогда
			ОтправитьЭлектронноеПисьмоПроцесс(Ссылка, ДокументОбъект.Контрагент, ДокументОбъект.АдресПолучателя, Неопределено, ОписаниеОшибки);
			Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ДокументОбъект.Отправлен = Истина;
				ДокументОбъект.ДатаОтправки = ТекущаяДатаСеанса();
			КонецЕсли;	
		КонецЕсли;
		//-- №8201
		
		//++ №8201
		Попытка
			ДокументОбъект.Записать();
		Исключение
			ТекстОшибки = "Не удалось записать документ: " + ОписаниеОшибки();
			ОписаниеОшибки = ОписаниеОшибки + ?(ЗначениеЗаполнено(ОписаниеОшибки), Символы.ПС, "") + ТекстОшибки;
		КонецПопытки;
		
		Возврат ОписаниеОшибки;
		//-- №8201
		
		
		//++ №8201 закомментировано, т.к. сейчас в любом случае будут данные в ТЧ, даже если галочка "Несколько получаетелей" не установлена
		//		и плюс дублирование кода
		//Иначе
		//	Попытка
		//		Почта = новый ИнтернетПочта;
		//		Почта.Подключиться(Справочники.УчетныеЗаписиЭлектроннойПочты.ПолучитьИнтернетПочтовыйПрофиль(Ссылка.Отправитель));
		//		
		//		Сообщение = Новый ИнтернетПочтовоеСообщение;
		//		Сообщение.Отправитель.Адрес = Ссылка.Отправитель.АдресЭлектроннойПочты;
		//		Сообщение.Получатели.Добавить(Ссылка.АдресПолучателя);
		//		Сообщение.Тема = Ссылка.Заголовок;
		//		ТекстПисьма = ?(НЕ ПустаяСтрока(Ссылка.ТекстHTML), Ссылка.ТекстHTML, ПреобразоватьТекстВHTML(Ссылка.ТекстПисьма));
		//		Текст = Сообщение.Тексты.Добавить(ТекстПисьма);
		//		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
		//		
		//		//получаем и прикрепляем вложения
		//		Запрос = Новый Запрос;
		//		Запрос.Текст = 
		//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.Период,
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.СсылкаНаОбъект,
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.ИмяФайла,
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.Данные,
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.Расширение
		//		|ИЗ
		//		|	РегистрСведений.ПрикрепленныеДанныеЭлектронныхПисем КАК ПрикрепленныеДанныеЭлектронныхПисем
		//		|ГДЕ
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.СсылкаНаОбъект = &СсылкаНаОбъект";
		//		Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
		//		Выборка = Запрос.Выполнить().Выбрать();
		//		Пока Выборка.Следующий() Цикл
		//			Данные = Выборка.Данные.Получить();
		//			Вложение = Сообщение.Вложения.Добавить(Данные, СокрЛП(Выборка.ИмяФайла) + СокрЛП(Выборка.Расширение));
		//		КонецЦикла;
		//		
		//		
		//		Почта.Послать(Сообщение);
		//		Почта.Отключиться();
		//		
		//		ДокументОбъект = Ссылка.ПолучитьОбъект();
		//		ДокументОбъект.Отправлен = Истина;
		//		ДокументОбъект.ДатаОтправки = ТекущаяДатаСеанса();
		//		ДокументОбъект.Записать();
		//		Возврат "";
		//	Исключение
		//		Возврат "Ошибка отправки письма: " + ОписаниеОшибки();
		//	КонецПопытки;
		//КонецЕсли;
		//-- №8201
	КонецЕсли;
	
КонецФункции

Процедура ОтправитьЭлектронноеПисьмоПроцесс(Ссылка, Контрагент, Email, Строка = Неопределено, ОписаниеОшибки)
	
	Попытка
		
		Почта = новый ИнтернетПочта;
		Почта.Подключиться(Справочники.УчетныеЗаписиЭлектроннойПочты.ПолучитьИнтернетПочтовыйПрофиль(Ссылка.Отправитель));
		
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Отправитель.Адрес = Ссылка.Отправитель.АдресЭлектроннойПочты;
		Сообщение.Получатели.Добавить(Email);
		Сообщение.Тема = Ссылка.Заголовок;
		ТекстПисьма = ?(НЕ ПустаяСтрока(Ссылка.ТекстHTML), Ссылка.ТекстHTML, ПреобразоватьТекстВHTML(Ссылка.ТекстПисьма));
		Текст = Сообщение.Тексты.Добавить(ТекстПисьма);
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
		
		//получаем и прикрепляем вложения
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрикрепленныеДанныеЭлектронныхПисем.Период,
		|	ПрикрепленныеДанныеЭлектронныхПисем.СсылкаНаОбъект,
		|	ПрикрепленныеДанныеЭлектронныхПисем.ИмяФайла,
		|	ПрикрепленныеДанныеЭлектронныхПисем.Данные,
		|	ПрикрепленныеДанныеЭлектронныхПисем.Расширение
		|ИЗ
		|	РегистрСведений.ПрикрепленныеДанныеЭлектронныхПисем КАК ПрикрепленныеДанныеЭлектронныхПисем
		|ГДЕ
		|	ПрикрепленныеДанныеЭлектронныхПисем.СсылкаНаОбъект = &СсылкаНаОбъект";
		Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Данные = Выборка.Данные.Получить();
			Вложение = Сообщение.Вложения.Добавить(Данные, СокрЛП(Выборка.ИмяФайла) + СокрЛП(Выборка.Расширение));
		КонецЦикла;
		
		
		Почта.Послать(Сообщение);
		Почта.Отключиться();
		
		//++ №8201 добавлены новые реквизиты в ТЧ, сразу меняем в объекте
		Если НЕ Строка = Неопределено Тогда
			Строка.Отправлено = Истина;
			Строка.ДатаОтправки = ТекущаяДатаСеанса();
		КонецЕсли;	
		//-- №8201
		
	Исключение
		
		//++ №8201 ошибку запомним, сразу не возвращаем
		//Возврат "Ошибка отправки письма контрагенту " + Строка.Контрагент + ": " + ОписаниеОшибки();
		ТекстОшибки = СтрШаблон("Ошибка отправки письма %1: %2", ?(ЗначениеЗаполнено(Контрагент), "контрагенту " + Контрагент, ""), ОписаниеОшибки());
		ОписаниеОшибки = ОписаниеОшибки + ?(ЗначениеЗаполнено(ОписаниеОшибки), Символы.ПС, "") + ТекстОшибки;
		
	КонецПопытки;
		
КонецПроцедуры	