
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспПодразд = константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	Элементы.ВернутьНаФондыПодразделение.Видимость = ИспПодразд;
	
	Если Объект.Ссылка.Пустая() Тогда
		объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	ОбновитьДанныеПоЗаказу();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоЗаказу()
	ОбновитьОстатокРезерва();
	Предмет = ВРЕГ(Объект.ЗаказОснование.ПредметЗаказа);
	
	РезСтр = новый Массив;
	стрОргФ = Новый ФорматированнаяСтрока("ОРГАНИЗАЦИЯ: ", новый шрифт(,8));
	СтрокаОрг = новый ФорматированнаяСтрока(стрОргФ , новый ФорматированнаяСтрока(строка(Объект.ЗаказОснование.организация), Новый Шрифт(,,истина)));
	РезСтр.Добавить(СтрокаОрг);
	Если ЗначениеЗаполнено(Объект.ЗаказОснование.Подразделение) Тогда	
		стрПодрФ = Новый ФорматированнаяСтрока(" ::  ПОДРАЗДЕЛЕНИЕ: ", новый шрифт(,8));
		СтрокаПодр = новый ФорматированнаяСтрока(стрПодрФ, новый ФорматированнаяСтрока(строка(Объект.ЗаказОснование.Подразделение), Новый Шрифт(,,истина)));
		РезСтр.Добавить(СтрокаПодр);
	КонецЕсли;
	стрФондФ = Новый ФорматированнаяСтрока(" ::  ФОНД: ", новый шрифт(,8));
	СтрокаФонд = новый ФорматированнаяСтрока(стрФондФ, новый ФорматированнаяСтрока(строка(Объект.ЗаказОснование.Фонд), Новый Шрифт(,,истина)));
	РезСтр.Добавить(СтрокаФонд);
	
	Элементы.ДекорацияРеквизитыЗаказа.Заголовок = Новый ФорматированнаяСтрока(РезСтр);
	
	ТЗ_Подробности.Параметры.УстановитьЗначениеПараметра("ЗП", Объект.ЗаказОснование);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьКнопкиПроведения();
	ОбновитьДоступностьПоУтверждению();
КонецПроцедуры

&НаСервере
Процедура ОбработкаЗаполненияСервер()
	ОбъектЗнач = РеквизитФормыВЗначение("Объект");
	ОбъектЗнач.ОбработкаЗаполнения(Объект.ЗаказОснование, Ложь);
	ЗначениеВРеквизитФормы(ОбъектЗнач,"Объект");
	
	ОбновитьДанныеПоЗаказу();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказОснованиеПриИзменении(Элемент)
	ОбработкаЗаполненияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбработкаЗаполненияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.Режимзаписи = РежимЗаписиДокумента.Проведение и объект.Дата > КонецДня(ТекущаяДата()) ТОгда		
		ПоказатьПредупреждение(,"Закрытие заказа можно сохранять как черновик с датой будущего периода. Но утверждать можно не позднее текущей даты (сегодняшней даты). Измените дату и повторите операцию, если вы действительно решили утвердить Закрытие заказа.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;        
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстатокРезерва()
	ОстатокЗарезервированныхСредств = 0;
	Одобрено = 0;
	Выплачено = 0;
	
	Если не объект.ЗаказОснование.Пустая() ТОгда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_СредстваВРезервеНаФондахОстаткиИОбороты.СуммаБезналПриход КАК СуммаБезналПриход,
		               |	ИА_СредстваВРезервеНаФондахОстаткиИОбороты.СуммаБезналРасход КАК СуммаБезналРасход,
		               |	ИА_СредстваВРезервеНаФондахОстаткиИОбороты.СуммаБезналКонечныйОстаток КАК СуммаБезналКонечныйОстаток
		               |ИЗ
		               |	РегистрНакопления.ИА_СредстваВРезервеНаФондах.ОстаткиИОбороты(, &НаДату, , , ЗП = &Ссылка) КАК ИА_СредстваВРезервеНаФондахОстаткиИОбороты";
		Запрос.УстановитьПараметр("Ссылка", Объект.ЗаказОснование);
		Запрос.УстановитьПараметр("НаДату", ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата-1,ТекущаяДата()));
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ОстатокЗарезервированныхСредств = выборка.СуммаБезналКонечныйОстаток;
			Одобрено = выборка.СуммаБезналПриход;
			Выплачено = выборка.СуммаБезналРасход;
		КонецЕсли;
	КонецЕсли;
	
	ВозможноВернутьВФонды = ОстатокЗарезервированныхСредств - Объект.ВернутьНаФонды.Итог("Сумма"); 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВозможноВернуть()	
	итогоВернули =0;
	Для каждого стр из ОБъект.ВернутьНаФонды Цикл
		итогоВернули = итогоВернули + стр.сумма;
	КонецЦикла;
	
	ВозможноВернутьВФонды = ОстатокЗарезервированныхСредств - итогоВернули; 
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаФондыСуммаПриИзменении(Элемент)
	ОбновитьВозможноВернуть();
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаФондыПослеУдаления(Элемент)
	ОбновитьВозможноВернуть();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьВидимостьКнопкиПроведения()
	Если Элементы.Найти("ФормаПровести") <> Неопределено тогда
		Элементы.ФормаПровести.Видимость = не объект.Проведен;
	КонецЕсли;
	Если Элементы.Найти("ФормаОтменаПроведения") <> Неопределено тогда
		Элементы.ФормаОтменаПроведения.Видимость = объект.Проведен;
	КонецЕсли;
	Если Элементы.Найти("ФормаЗаписать") <> Неопределено тогда
		Элементы.ФормаЗаписать.Видимость = не объект.Проведен;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьВидимостьКнопкиПроведения();
	ОбновитьДоступностьПоУтверждению();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьПоУтверждению()
	
	Элементы.ГруппаЦ.ТолькоПросмотр = объект.Проведен;
	Элементы.ВернутьНаФонды.КоманднаяПанель.Доступность = не объект.Проведен;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗ_ПодробностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ПоказатьЗначение(,элемент.текущиеданные.Регистратор);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТЗ_ПодробностиПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Для каждого стр из Строки Цикл
		стрД = стр.Значение.Данные;
		стрД.ПредставлениеРегистратора = формат(стрД.Период, "ДФ=dd.MM.yyyy") + " " + строка(стрД.ТипРег) + " №" + стрД.РегистраторНомер;
	КонецЦикла;
КонецПроцедуры



