
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//    Отчет = Отчеты["ПрайсЛистПолотна"].Создать();
//	СхемаКомпоновкиДанных = Отчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

//	//Из схемы возьмем настройки по умолчанию
//	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;

//	//Если ЗначениеЗаполнено(ИмяВарианта)  Тогда
//	//	Настройки=СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВарианта].Настройки;
//	//КонецЕсли;  

//	Настройки.ПараметрыДанных.Элементы[0].Значение.Период = ТекущаяДата();

//	//Помещаем в переменную данные о расшифровке данных
//	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

//	//Формируем макет, с помощью компоновщика макета
//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

//	//Передаем в макет компоновки схему, настройки и данные расшифровки
//	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
//                                        Настройки, ДанныеРасшифровки);

//	//Выполним компоновку с помощью процессора компоновки
//	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
//	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,
//                                                   ДанныеРасшифровки, Истина);

//	//Очищаем поле табличного документа
//	Результат = Новый ТабличныйДокумент;

//	//Выводим результат в табличный документ
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//	ПроцессорВывода.УстановитьДокумент(Результат);

//	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

//	//Результат.ПоказатьУровеньГруппировокСтрок(3);

//	Каталог = КаталогВременныхФайлов();

//	ИмяДляФайла = ЭтотОбъект.Метаданные().Синоним;

//	Если не ЗначениеЗаполнено(ИмяДляФайла)  Тогда
//    	ИмяДляФайла=ЭтотОбъект.Метаданные().Имя;
//	КонецЕсли;  

//	ИмяФайла="Отчет.xls";
//	Результат.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
//	
//КонецПроцедуры 

&НаСервере
Процедура СформироватьОтчетНаСервере(ПараметрыФормирования, АдресДляРазмещенияРезультата = Неопределено) Экспорт 
		
	ИмяФайлаРезультат = ПолучитьИмяФайлаДляОтчетаНаСервере("Прайс-Лист " + Формат(ТекущаяДата(), "ДЛФ=DD"));
	
	
	МассивСтраницДляПолученияДанных = ПолучитьМассивСтраниц();
	
	
	ИмяФайла = ПолучитьИмяФайлаДляОтчетаНаСервере("Содержание");	
	ТДРезультат = ПолучитьТабличныйДокументСтраницыСодержание();	
	ТДРезультат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);

	
	МассивСтраниц = Новый Массив;
	
	МассивСтраниц.Добавить(Новый Структура("ИмяФайла, ИмяСтраницы", ИмяФайла, "СОДЕРЖАНИЕ"));
	
	Для Каждого СтраницаДляПолученияДанных Из МассивСтраницДляПолученияДанных Цикл
		
		Если ВРег(СтраницаДляПолученияДанных.СтраницаПрайсЛистаИмя) = "ПОЛОТНА" Тогда
			
	        ТДРезультат = ПолучитьТабличныйДокументРезультатОтчетПолотна();
			
		Иначе
			
			ТДРезультат = ПолучитьТабличныйДокументРезультатОтчетСтраницы(СтраницаДляПолученияДанных.СтраницаПрайсЛистаСсылка);
			
		КонецЕсли;
		
		Если ТДРезультат <> Неопределено Тогда
			
			ИмяФайла = ПолучитьИмяФайлаДляОтчетаНаСервере(СтраницаДляПолученияДанных.СтраницаПрайсЛистаИмя);
			ТДРезультат.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLSX);
			МассивСтраниц.Добавить(Новый Структура("ИмяФайла, ИмяСтраницы", ИмяФайла, СтраницаДляПолученияДанных.ИмяСтраницы));
			
		КонецЕсли;
		
	КонецЦикла;	

    Эксель = New COMObject("Excel.Application");
	Эксель.DisplayAlerts = ЛОЖЬ;			
	
	Книга = Эксель.WorkBooks.Add(); 
	
	А = 1;
	
	Для Каждого СтраницаКВыводу Из МассивСтраниц Цикл
		
    	ДобавитьСраницуВФайлРезультатНаСервере(Эксель, Книга, СтраницаКВыводу.ИмяФайла, СтраницаКВыводу.ИмяСтраницы, А);
		
		Эксель.ActiveWindow.DisplayGridlines = ЛОЖЬ;
		Эксель.ActiveWindow.DisplayHeadings = ЛОЖЬ;
		
		А = А + 1;
		
	КонецЦикла;	
	
	ПервыйЛист = Книга.Sheets(1);
	ПервыйЛист.Delete(); 
	
	ЛистСодержание=Книга.Sheets(1);
	
	ЛистСодержание.Tab.ColorIndex = 3; 
	
	Для А = 1 По 7 Цикл 
		
		Если А >= МассивСтраниц.Количество() Тогда
			НайденнаяЯчейка = ЛистСодержание.Cells.Find("@" + А + "страница@",ЛистСодержание.Cells(1,1),-4123,1);
		 	НайденнаяЯчейка.Value = "";
		Иначе	
		 	НайденнаяЯчейка = ЛистСодержание.Cells.Find("@" + А + "страница@",ЛистСодержание.Cells(1,1),-4123,1);
		 	НайденнаяЯчейка.Value = МассивСтраниц[А].ИмяСтраницы;
			ЛистСодержание.Hyperlinks.Add(НайденнаяЯчейка, , "'" + СокрЛП(МассивСтраниц[А].ИмяСтраницы) + "'!R1C");
		КонецЕсли;
		
	КонецЦикла;	
	
	КоличествоЛистов = Эксель.ActiveWorkbook.Worksheets.Count;
    КоллекцияЛистов = Эксель.ActiveWorkbook.Worksheets;
	Для ТекНомерЛиста = 1 По КоличествоЛистов  Цикл
    	ТекЛист = Эксель.ActiveWorkbook.Worksheets(ТекНомерЛиста);

		Попытка 
			НайденнаяЯчейка = ТекЛист.Cells.Find("www.optceiling.ru",ТекЛист.Cells(1,1),-4123,1);
			ТекЛист.Hyperlinks.Add(НайденнаяЯчейка, "http://optceiling.ru", "", "www.optceiling.ru", "www.optceiling.ru");
		Исключение
			
		КонецПопытки;
		
		Попытка  
			НачатьПоискСЯчейки = ТекЛист.Cells(1,1); 
			ПоследняяЯчейка = ТекЛист.Cells(ТекЛист.UsedRange.Rows.Count,ТекЛист.UsedRange.Columns.Count);
			Пока Истина Цикл
				Если НачатьПоискСЯчейки.Row >= ПоследняяЯчейка.Row Тогда
					Прервать;
				КонецЕсли;	
				НайденнаяЯчейка = ТекЛист.Range(НачатьПоискСЯчейки, ПоследняяЯчейка).Find("https://optceiling.ru/", НачатьПоискСЯчейки,-4123,2);
				Если НайденнаяЯчейка = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				НачатьПоискСЯчейки = ТекЛист.Cells(НайденнаяЯчейка.Row + 1, 1); 
				
				НайденнаяЯчейкаСоСдвигомВлево = ТекЛист.Cells(НайденнаяЯчейка.Row, НайденнаяЯчейка.Column - 1);
				
				К = НайденнаяЯчейка.Column - 2;
				Пока НайденнаяЯчейкаСоСдвигомВлево.Value = Неопределено ИЛИ К >= 1 Цикл 
					НайденнаяЯчейкаСоСдвигомВлево = ТекЛист.Cells(НайденнаяЯчейка.Row, К);
					К = К - 1;
				КонецЦикла;   
				
				Если НайденнаяЯчейкаСоСдвигомВлево = Неопределено ИЛИ НайденнаяЯчейкаСоСдвигомВлево.Value = Неопределено Тогда
					ТекЛист.Hyperlinks.Add(НайденнаяЯчейка, НайденнаяЯчейка.Value, "", НайденнаяЯчейка.Value, НайденнаяЯчейка.Value);
				Иначе	
					ТекЛист.Hyperlinks.Add(НайденнаяЯчейкаСоСдвигомВлево, НайденнаяЯчейка.Value, "", НайденнаяЯчейкаСоСдвигомВлево.Value, НайденнаяЯчейкаСоСдвигомВлево.Value);
				КонецЕсли;	
			КонецЦикла;
		Исключение
			
		КонецПопытки;				
	КонецЦикла; 
	
	//удалим все предыдущие прайсы
	УдалитьФайлы(ПолучитьКаталогДляОтчетаНаСервере(), "Прайс*.xlsx");
	
	Файл = Новый Файл(ИмяФайлаРезультат);   // если существует то заменяем его
	Если Файл.Существует() Тогда
		УдалитьФайлы(ИмяФайлаРезультат);
	КонецЕсли;
		
	Книга.SaveAs(ИмяФайлаРезультат, 51); //xlWorkbookNormal -4143 Workbook normal 
КонецПроцедуры

Процедура ДобавитьСраницуВФайлРезультатНаСервере(Эксель, КнигаКудаДобавляемСтраницу, ИмяДобавляемогоФайла, ИмяСтраницы, НомерСтраницы)
	
	Книга = Эксель.Workbooks.Open(ИмяДобавляемогоФайла);
	
	Лист = Книга.Sheets("TDSheet"); // потому что сформированный из mxl-ки лист Excel получает по умолчанию имя "TDSheet"
		
	Лист.Copy(,КнигаКудаДобавляемСтраницу.Worksheets(НомерСтраницы)); 
	
	КнигаКудаДобавляемСтраницу.Sheets("TDSheet").Name = ИмяСтраницы;
		
	Книга.Close(); 
	
	Файл = Новый Файл(ИмяДобавляемогоФайла);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ИмяДобавляемогоФайла);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМассивСтраниц()
	
	МассивСтраниц = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста.Ссылка КАК СтраницаПрайсЛистаСсылка,
		|	НастройкиПрайсЛиста.Наименование КАК ИмяСтраницы,
		|	НастройкиПрайсЛиста.Порядок КАК Порядок,
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста.ИмяПредопределенныхДанных КАК СтраницаПрайсЛистаИмя
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НЕ НастройкиПрайсЛиста.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСтраниц.Добавить(Новый Структура("ИмяСтраницы, СтраницаПрайсЛистаСсылка, СтраницаПрайсЛистаИмя", 
		ВыборкаДетальныеЗаписи.ИмяСтраницы, ВыборкаДетальныеЗаписи.СтраницаПрайсЛистаСсылка, ВыборкаДетальныеЗаписи.СтраницаПрайсЛистаИмя));
	КонецЦикла;
	
	Возврат МассивСтраниц;
	
КонецФункции	

Функция ПолучитьПредопределеннуюСтраницуПрайсЛиста(ИмяЭлемента)
	
	Возврат Справочники.СтраницыПрайсЛиста[ИмяЭлемента];
	
КонецФункции

Функция ПолучитьИмяСтраницыПрайсЛиста(СтраницаПрайсЛиста)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.Наименование КАК НаименованиеСтраницы
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста = &СтраницаПрайсЛиста";
	
	Запрос.Параметры.Вставить("СтраницаПрайсЛиста", СтраницаПрайсЛиста);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НаименованиеСтраницы;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТабличныйДокументСтраницыСодержание()
	
	ПрайсЛистДляРассылки = Отчеты["ПрайсЛистДляРассылки"].Создать();
	
	МакетСодержание =  ПрайсЛистДляРассылки.ПолучитьМакет("СОДЕРЖАНИЕ");
		
	Возврат МакетСодержание;
	
КонецФункции

Функция ПолучитьТабличныйДокументРезультатОтчетПолотна()
	
	ПрайсЛистПолотна = Отчеты["ПрайсЛистПолотна"].Создать();
	
	Возврат ПрайсЛистПолотна.СформироватьОтчет();
	
КонецФункции	

Функция ПолучитьТабличныйДокументРезультатОтчетСтраницы(СтраницаПрайсЛиста)
	
	ПрайсЛистПолотна = Отчеты["ПрайсЛистНоменклатура"].Создать();
	СхемаКомпоновкиДанных = ПрайсЛистПолотна.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	// получаем сохранённые настройки, если они есть
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста = &СтраницаПрайсЛиста";
	
	Запрос.Параметры.Вставить("СтраницаПрайсЛиста", СтраницаПрайсЛиста);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Настройки = ВыборкаДетальныеЗаписи.Ссылка.Настройки.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Настройки) <> Тип("НастройкиКомпоновкиДанных") Тогда
		//Из схемы возьмем настройки по умолчанию
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(ИмяВарианта)  Тогда
	//	Настройки=СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВарианта].Настройки;
	//КонецЕсли;  

	ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрПериод.Значение = ТекущаяДата();
	ПараметрПериод.Использование = Истина;

	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
                                        Настройки, ДанныеРасшифровки);

	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,
                                                   ДанныеРасшифровки, Истина);

	//Очищаем поле табличного документа
	Результат = Новый ТабличныйДокумент;

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИмяФайлаДляОтчетаНаСервере(ИмяФайла)
	
	//Каталог = КаталогВременныхФайлов(); 
	Каталог = ПолучитьКаталогДляОтчетаНаСервере();
	
	ПолныйПутьКФайлу = Каталог + ИмяФайла + ".xlsx";
	
	Возврат ПолныйПутьКФайлу;
	
КонецФункции 

Функция ПолучитьКаталогДляОтчетаНаСервере()
	
	Каталог = "C:\Users\v.nikiforov\YandexDisk-teh.dir@optceiling.ru\Прайс\";
	
	Возврат Каталог;
	
КонецФункции

