
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформлениеФормы();
	
	УзелОбменаЭтаИБ = ПроверитьУзелОбменаЭтаИБСервер();
	
	Если УзелОбменаЭтаИБ Тогда
		Возврат;
	КонецЕсли;
	
	//РазделениеВключено = Ложь;
	
	ВыполнитьДействияПриСозданииНаСервере();
	
	УстановитьВидимостьИДоступностьЭлементов();
		
	Элементы.СопоставлениеОплатТипОплаты.СписокВыбора.Очистить();
	Элементы.СопоставлениеОплатТипОплаты.СписокВыбора.Добавить("card");
	Элементы.СопоставлениеОплатТипОплаты.СписокВыбора.Добавить("QR");
	Элементы.СопоставлениеОплатТипОплаты.СписокВыбора.Добавить("QR_PM");
	Элементы.СопоставлениеОплатТипОплаты.СписокВыбора.Добавить("Оплатить через СБП");
	Элементы.СопоставлениеОплатТипОплаты.СписокВыбора.Добавить("cash");
	
	Элементы.СопоставлениеОплатПризнакОтменыОплаты.СписокВыбора.Очистить();
	Элементы.СопоставлениеОплатПризнакОтменыОплаты.СписокВыбора.Добавить("n");  // проведен / оплата
	Элементы.СопоставлениеОплатПризнакОтменыОплаты.СписокВыбора.Добавить("y");  // проведен / возврат
	Элементы.СопоставлениеОплатПризнакОтменыОплаты.СписокВыбора.Добавить("d");  // не проведен
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьРасписаниеЗадания("ОбменТоварами", ТекущийОбъект, РасписаниеРегламентногоЗаданияОбменаТоварами);
	ЗаполнитьРасписаниеЗадания("ОбменЗаказами", ТекущийОбъект, РасписаниеРегламентногоЗаданияОбменаЗаказами);
	ЗаполнитьРасписаниеЗадания("ОбменОплатами", ТекущийОбъект, РасписаниеРегламентногоЗаданияОбменаОплатами);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если УзелОбменаЭтаИБ Тогда
		
		ОчиститьСообщения();
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Узел соответствует этой информационной базе и не может использоваться в обмене. Используйте другой узел обмена или создайте новый.'"));
			
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Элементы.НастроитьРасписаниеОбменаТоварами.Заголовок = УстановитьНадписьРасписания(РасписаниеРегламентногоЗаданияОбменаТоварами);
	Элементы.НастроитьРасписаниеОбменаЗаказами.Заголовок = УстановитьНадписьРасписания(РасписаниеРегламентногоЗаданияОбменаЗаказами);
	Элементы.НастроитьРасписаниеОбменаОплатами.Заголовок = УстановитьНадписьРасписания(РасписаниеРегламентногоЗаданияОбменаОплатами);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Обмен по расписанию
	Если ТекущийОбъект.ИспользоватьРегламентноеЗаданиеОбменаТоварами
		И (РасписаниеРегламентногоЗаданияОбменаТоварами = Неопределено
			ИЛИ НЕ ТекущийОбъект.ОбменТоварами)
		Тогда		
		ТекущийОбъект.ИспользоватьРегламентноеЗаданиеОбменаТоварами = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);	
	ТекущийОбъект.ВключитьОтключитьРегламентноеЗадание("ОбменТоварами", РасписаниеРегламентногоЗаданияОбменаТоварами);	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТекущийОбъект.ИспользоватьРегламентноеЗаданиеОбменаЗаказами
		И (РасписаниеРегламентногоЗаданияОбменаЗаказами = Неопределено
			ИЛИ НЕ ТекущийОбъект.ОбменЗаказами)
		Тогда		
		ТекущийОбъект.ИспользоватьРегламентноеЗаданиеОбменаЗаказами = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);	
	ТекущийОбъект.ВключитьОтключитьРегламентноеЗадание("ОбменЗаказами", РасписаниеРегламентногоЗаданияОбменаЗаказами);	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТекущийОбъект.ИспользоватьРегламентноеЗаданиеОбменаОплатами
		И (РасписаниеРегламентногоЗаданияОбменаОплатами = Неопределено
			ИЛИ НЕ ТекущийОбъект.ОбменОплатами)
		Тогда		
		ТекущийОбъект.ИспользоватьРегламентноеЗаданиеОбменаОплатами = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);	
	ТекущийОбъект.ВключитьОтключитьРегламентноеЗадание("ОбменОплатами", РасписаниеРегламентногоЗаданияОбменаОплатами);	
	УстановитьПривилегированныйРежим(Ложь);
	
	// отборы
	ТекущийОбъект.СохраненныйОтборТоваров = Новый ХранилищеЗначения(ОтборТоваров.ПолучитьНастройки());
	ТекущийОбъект.СохраненныйОтборБезлимитныхТоваров = Новый ХранилищеЗначения(ОтборБезлимитныхТоваров.ПолучитьНастройки());
	
	ТекущийОбъект.СохраненныйОтборЗаказов = Новый ХранилищеЗначения(ОтборЗаказов.ПолучитьНастройки());
	
	ТекущийОбъект.СохраненныйОтборОплат = Новый ХранилищеЗначения(ОтборОплат.ПолучитьНастройки());
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Если Объект.ОбменТоварами И ТаблицаКаталогов.Количество() = 0 Тогда
	//	
	//	Отказ = Истина;
	//	
	//	Сообщение = НСтр("ru = 'Таблица каталогов не заполнена!'");
	//	Поле = "ТаблицаКаталогов";
	//	
	//	ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение, Объект.Ссылка, Поле);
	//	
	//КонецЕсли;
	//
	//Если Объект.ОбменТоварами И СписокВидовЦен.Количество() = 0 Тогда
	//	
	//	Отказ = Истина;
	//	
	//	Сообщение = НСтр("ru = 'Вид цен для товаров не выбран!'");
	//	Поле = "ВыбратьВидыЦенНоменклатуры";
	//	
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, Объект.Ссылка, Поле);
	//	
	//КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы


// Процедура - обработчик события ПриИзменении поля флажка ОбменТоварами.
//
&НаКлиенте
Процедура ОбменТоварамиПриИзменении(Элемент)
	
	УстановитьВидимостьСтраницФормы();
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля флажка ОбменЗаказами.
//
&НаКлиенте
Процедура ОбменЗаказамиПриИзменении(Элемент)
	
	УстановитьВидимостьСтраницФормы();
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменОплатамиПриИзменении(Элемент)
	
	УстановитьВидимостьСтраницФормы();
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля переключателя ПереключательНазначениеОбмена.
//
//&НаКлиенте
//Процедура ПереключательНазначениеОбменаПриИзменении(Элемент)
//	
//	ПриИзмененииПереключательНазначениеОбмена();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриИзмененииПереключательНазначениеОбмена()
//	
//	Объект.ВыгружатьНаСайт = ПереключательНазначениеОбмена = 0;
//	УстановитьВидимостьСтраницТипаОбмена();
//	Модифицированность = Истина;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПереключательВыгрузкаИзмененийПриИзменении(Элемент)
	
	ПриИзмененииПереключательВыгрузкаИзменений()
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПереключательВыгрузкаИзменений()
	
	Объект.ВыгружатьИзменения = (ПереключательВыгрузкаИзменений = 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатурыНастройкиОтборОчистка(Элемент, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновкуДанныхТоваров(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборБезлимитныхТоваровНастройкиОтборОчистка(Элемент, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновкуДанныхБезлимитныхТоваров(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗаказовНастройкиОтборОчистка(Элемент, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновкуДанныхЗаказов(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОплатНастройкиОтборОчистка(Элемент, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновкуДанныхОплат(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПротоколПередачиИзображенийПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаИзображенийПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаЗаказовПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаЗаказовПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеОплатВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.СопоставлениеОплат.ТекущиеДанные;
	
	Если ТекущиеДанные.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ОплатаБанковскойКартой") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийОплатаБанковскойКартой");
	ИначеЕсли ТекущиеДанные.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ПриходныйКассовыйОрдер") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПриходныйКассовыйОрдер");
	ИначеЕсли ТекущиеДанные.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.РасходныйКассовыйОрдер") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийРасходныйКассовыйОрдер");
	ИначеЕсли ТекущиеДанные.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ПоступлениеНаРасчетныйСчет") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоступлениеНаРасчетныйСчет");
	ИначеЕсли ТекущиеДанные.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.СписаниеСРасчетногоСчета") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийСписаниеСРасчетногоСчета");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеОплатАналитикаОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СопоставлениеОплат.ТекущиеДанные;
	
	Если ТекущиеДанные.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ОплатаБанковскойКартой") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЭквайринговыеТерминалы");
	ИначеЕсли ТекущиеДанные.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ПриходныйКассовыйОрдер")
		  ИЛИ ТекущиеДанные.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.РасходныйКассовыйОрдер") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
	ИначеЕсли ТекущиеДанные.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ПоступлениеНаРасчетныйСчет")
		  ИЛИ ТекущиеДанные.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.СписаниеСРасчетногоСчета") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентноеЗаданиеОбменаТоварамиПриИзменении(Элемент)
	
	ПриИзмененииИспользоватьРегламентныеЗадания("ИспользоватьРегламентноеЗаданиеОбменаТоварами", 
	                                            "РасписаниеРегламентногоЗаданияОбменаТоварами",												 
												Элементы.НастроитьРасписаниеОбменаТоварами);
	 
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентноеЗаданиеОбменаЗаказамиПриИзменении(Элемент)
	
	ПриИзмененииИспользоватьРегламентныеЗадания("ИспользоватьРегламентноеЗаданиеОбменаЗаказами",
												"РасписаниеРегламентногоЗаданияОбменаЗаказами",												
												Элементы.НастроитьРасписаниеОбменаЗаказами);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентноеЗаданиеОбменаОплатамиПриИзменении(Элемент)
	
	ПриИзмененииИспользоватьРегламентныеЗадания("ИспользоватьРегламентноеЗаданиеОбменаОплатами",
												"РасписаниеРегламентногоЗаданияОбменаОплатами",												 
												Элементы.НастроитьРасписаниеОбменаОплатами);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	
	ОчиститьСообщения();
	Если Не Модифицированность И ЗначениеЗаполнено(Объект.АдресСайта) И ЗначениеЗаполнено(Объект.ТокенАвторизации) Тогда
		СтруктураПроверки = ПроверитьСоединениеНаСервере();
	Иначе
		Если Модифицированность Тогда
			ТекстВозврата = "Предварительно необходимо записать текущую настройку!";
		Иначе
			ТекстВозврата = "Необходимо заполнить настройки подключения!";	
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураПроверки.Успешно Тогда
		ПоказатьПредупреждение(Неопределено, "Соединение успешно установлено!", 10, "Результат проверки соединения");
	Иначе
		ПоказатьПредупреждение(Неопределено, СтруктураПроверки.ОписаниеОшибки, 10, "Результат проверки соединения");
	КонецЕсли;
	
	Если СтруктураПроверки.IDОрганизацииИзменен Тогда
		ПоказатьОповещениеПользователя("Заполнен ID организации");	
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПроверитьСоединениеНаСервере()
	
	НастройкиПодключения = Новый Структура;
	НастройкиПодключения.Вставить("АдресСайта", Объект.АдресСайта);
	НастройкиПодключения.Вставить("ТокенАвторизации", Объект.ТокенАвторизации);
	
	СтруктураПроверки = Новый Структура("Успешно, IDОрганизацииИзменен, ОписаниеОшибки", Ложь, Ложь, "");
	ОписаниеОшибки = "";
	РезультатПодключения = ОбменСWikki.ВыполнитьТестовоеПодключениеКСайту(НастройкиПодключения, ОписаниеОшибки);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		СтруктураПроверки.ОписаниеОшибки = ОписаниеОшибки;
		Возврат СтруктураПроверки;
	КонецЕсли;
	
	Если РезультатПодключения.Результат = Ложь ИЛИ НЕ РезультатПодключения.КодОтвета = 200 Тогда
		СтруктураПроверки.ОписаниеОшибки = РезультатПодключения.ТелоОтвета;
		Возврат СтруктураПроверки;
	КонецЕсли;
	
	СтруктураПроверки.Успешно = Истина;
	//ТекстВозврата = "Соединение успешно установлено!";
	
	ТекID = "";
	Для Каждого ТекВитрина Из РезультатПодключения.Данные.stores Цикл
		Если Не ЗначениеЗаполнено(ТекID) Тогда
			ТекID = ТекВитрина.company_id;
		КонецЕсли;
		//Сообщить("По данной учетной записи числится витрина " + ТекВитрина.company + " с ID " + ТекВитрина.company_id);		
	КонецЦикла;
	
	Если НЕ Объект.IDОрганизации = ТекID И ЗначениеЗаполнено(ТекID) Тогда
		Объект.IDОрганизации = ТекID;
		СтруктураПроверки.IDОрганизацииИзменен = Истина;
		Модифицированность = Истина;
	КонецЕсли;
	
	Возврат СтруктураПроверки;
	
КонецФункции

&НаКлиенте
Процедура НастроитьРасписаниеОбмена(Команда)
	
	Если Команда.Имя = "НастроитьРасписаниеОбменаТоварами" Тогда
		//РасписаниеРЗ = РасписаниеРегламентногоЗаданияОбменаТоварами;
		ЭлементНастроитьРЗ = Элементы.НастроитьРасписаниеОбменаТоварами;
		РеквизитРасписаниеРЗ = "РасписаниеРегламентногоЗаданияОбменаТоварами";
		
	ИначеЕсли Команда.Имя = "НастроитьРасписаниеОбменаЗаказами" Тогда
		//РасписаниеРЗ = РасписаниеРегламентногоЗаданияОбменаЗаказами;
		ЭлементНастроитьРЗ = Элементы.НастроитьРасписаниеОбменаЗаказами;
		РеквизитРасписаниеРЗ = "РасписаниеРегламентногоЗаданияОбменаЗаказами";
		
	ИначеЕсли Команда.Имя = "НастроитьРасписаниеОбменаОплатами" Тогда
		//РасписаниеРЗ = РасписаниеРегламентногоЗаданияОбменаОплатами;
		ЭлементНастроитьРЗ = Элементы.НастроитьРасписаниеОбменаОплатами;
		РеквизитРасписаниеРЗ = "РасписаниеРегламентногоЗаданияОбменаОплатами";
	КонецЕсли;
	
	НастроитьРасписание(РеквизитРасписаниеРЗ, ЭлементНастроитьРЗ); //, РеквизитРасписаниеРЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрКатегорийСайта(Команда)
	
	ОчиститьСообщения();
	Если НЕ ЗначениеЗаполнено(Объект.АдресСайта) 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ТокенАвторизации) Тогда
		Сообщить("Необходимо заполнить настройки подключения!");
		Возврат;
	КонецЕсли;
	
	СтруктураКатегорий = ЗагрузитьКатегорииССайтаНаСервере();
	Если НЕ ЗначениеЗаполнено(СтруктураКатегорий) Тогда
		Сообщить("Не удалось получить категории!");
		Возврат;	
	КонецЕсли;
	
	МассивКатегорий = СтруктураКатегорий.Получить("categories");
	МассивКатегорийОбработано = Новый Массив;
	Для каждого ОписаниеКатегории из МассивКатегорий Цикл
		СтруктураКатегории = Новый Структура;
		СтруктураКатегории.Вставить("ИДРодителя", ОписаниеКатегории.Получить("parent_id"));
		СтруктураКатегории.Вставить("ИД", ОписаниеКатегории.Получить("category_id"));
		СтруктураКатегории.Вставить("Категория", ОписаниеКатегории.Получить("category"));
		СтруктураКатегории.Вставить("Статус", ОписаниеКатегории.Получить("status"));
		СтруктураКатегории.Вставить("Позиция", ОписаниеКатегории.Получить("position"));
		
		МассивКатегорийОбработано.Добавить(СтруктураКатегории);
	КонецЦикла;
	
	ОткрытьФорму("ПланОбмена.ОбменСWikki.Форма.КатегорииСайта", Новый Структура("МассивКатегорий", МассивКатегорийОбработано), ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКатегорииССайтаНаСервере()
	
	НастройкиПодключения = Новый Структура;
	НастройкиПодключения.Вставить("АдресСайта", Объект.АдресСайта);
	НастройкиПодключения.Вставить("ТокенАвторизации", Объект.ТокенАвторизации);
	
	ОписаниеОшибки = "";
	РезультатЗапроса = ОбменСWikki.ЗагрузитьКатегорииССайта(НастройкиПодключения, ОписаниеОшибки);
	
	Если РезультатЗапроса.Результат = Истина И ТипЗнч(РезультатЗапроса.Данные) = Тип("Соответствие") Тогда
		Возврат РезультатЗапроса.Данные;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПросмотрСтатусовСайта(Команда)
	
	ОчиститьСообщения();
	Если НЕ ЗначениеЗаполнено(Объект.АдресСайта) 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ТокенАвторизации) Тогда
		Сообщить("Необходимо заполнить настройки подключения!");
		Возврат;
	КонецЕсли;
	
	СтруктураСтатусов = ЗагрузитьСтатусыССайтаНаСервере();
	Если НЕ ЗначениеЗаполнено(СтруктураСтатусов) Тогда
		Сообщить("Не удалось получить статусы!");
		Возврат;	
	КонецЕсли;
	
	Для каждого ОписаниеСтатуса из СтруктураСтатусов.statuses Цикл		
		Сообщить(СтрШаблон("%1 - %2", ОписаниеСтатуса.status, ОписаниеСтатуса.description));
	КонецЦикла;
	 
КонецПроцедуры

&НаСервере
Функция ЗагрузитьСтатусыССайтаНаСервере()
	
	НастройкиПодключения = Новый Структура;
	НастройкиПодключения.Вставить("АдресСайта", Объект.АдресСайта);
	НастройкиПодключения.Вставить("ТокенАвторизации", Объект.ТокенАвторизации);
	
	ОписаниеОшибки = "";
	РезультатЗапроса = ОбменСWikki.ЗагрузитьСтатусыССайта(НастройкиПодключения, ОписаниеОшибки);
	
	Если РезультатЗапроса.Результат = Истина И ТипЗнч(РезультатЗапроса.Данные) = Тип("Структура") Тогда
		Возврат РезультатЗапроса.Данные;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьНаименованияГруппКонтрагентовССайта(Команда)
	
	ОчиститьСообщения();
	Если НЕ ЗначениеЗаполнено(Объект.АдресСайта) 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ТокенАвторизации) Тогда
		Сообщить("Необходимо заполнить настройки подключения!");
		Возврат;
	КонецЕсли;
	
	СтруктураГрупп = ЗагрузитьГруппыКонтрагентовССайтаНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьГруппыКонтрагентовССайтаНаСервере()
	
	НастройкиПодключения = Новый Структура;
	НастройкиПодключения.Вставить("АдресСайта", Объект.АдресСайта);
	НастройкиПодключения.Вставить("ТокенАвторизации", Объект.ТокенАвторизации);
	
	ОписаниеОшибки = "";
	РезультатЗапроса = ОбменСWikki.ЗагрузитьГруппыКонтрагентовССайта(НастройкиПодключения, ОписаниеОшибки);
	
	Если РезультатЗапроса.Результат = Истина И ТипЗнч(РезультатЗапроса.Данные) = Тип("Соответствие") Тогда
		Для каждого СтрокаТЧ из Объект.ВидыЦенПоГруппам Цикл
			ИдГруппы = Формат(СтрокаТЧ.IDГруппы, "ЧГ=");
			ДанныеГруппы = РезультатЗапроса.Данные.Получить(ИдГруппы);
			Если НЕ ДанныеГруппы = Неопределено Тогда
				СтрокаТЧ.НаименованиеНаСайте = ДанныеГруппы.Получить("usergroup");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСопоставлениеСтатусовПоУмолчанию(Команда)
	ЗаполнитьСопоставлениеСтатусовПоУмолчаниюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСопоставлениеСтатусовПоУмолчаниюНаСервере()
	
	СписокСтатусов = Справочники.СтатусыЗаказовПокупателей.СписокСтатусов();
	Для Каждого Статус1С из СписокСтатусов Цикл
		НоваяСтрока = Объект.СопоставлениеСтатусовЗаказов.Добавить();
		НоваяСтрока.Статус1С = Статус1С.Значение;
		
		Если НоваяСтрока.Статус1С = Справочники.СтатусыЗаказовПокупателей.Новый
			ИЛИ НоваяСтрока.Статус1С = Справочники.СтатусыЗаказовПокупателей.ВРаботе Тогда
			НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
		КонецЕсли;
		
		Если НоваяСтрока.Статус1С = Справочники.СтатусыЗаказовПокупателей.Новый Тогда
			НоваяСтрока.СимвольноеОбозначение = "O"; // латинская
		ИначеЕсли НоваяСтрока.Статус1С = Справочники.СтатусыЗаказовПокупателей.ВРаботе Тогда
			НоваяСтрока.СимвольноеОбозначение = "A";
		//ИначеЕсли НоваяСтрока.Статус1С = Справочники.СтатусыЗаказовПокупателей. Тогда
		//	НоваяСтрока.СимвольноеОбозначение = "B";
		ИначеЕсли НоваяСтрока.Статус1С = Справочники.СтатусыЗаказовПокупателей.Выполнен Тогда
			НоваяСтрока.СимвольноеОбозначение = "C";
		ИначеЕсли НоваяСтрока.Статус1С = Справочники.СтатусыЗаказовПокупателей.Выполнен Тогда
			НоваяСтрока.СимвольноеОбозначение = "C";
		ИначеЕсли НоваяСтрока.Статус1С = Справочники.СтатусыЗаказовПокупателей.Отменен Тогда
			НоваяСтрока.СимвольноеОбозначение = "F";
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСопоставлениеОплатПоУмолчанию(Команда)
	
	// ОплатаБанковскойКартой
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "QR_PM";
	НоваяСтрока.ПризнакОтменыОплаты = "n";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ОплатаБанковскойКартой");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой");
	НоваяСтрока.Проведен = Истина;
	НоваяСтрока.ИспользуетсяПриЗагрузке = Истина;
	
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "Оплатить через СБП";
	НоваяСтрока.ПризнакОтменыОплаты = "n";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ОплатаБанковскойКартой");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой");
	НоваяСтрока.Проведен = Истина;
	НоваяСтрока.ИспользуетсяПриЗагрузке = Истина;
	
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "card";
	НоваяСтрока.ПризнакОтменыОплаты = "n";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ОплатаБанковскойКартой");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой");
	НоваяСтрока.Проведен = Истина;
	НоваяСтрока.ИспользуетсяПриЗагрузке = Истина;
	НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
	
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "card";
	НоваяСтрока.ПризнакОтменыОплаты = "y";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ОплатаБанковскойКартой");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту");
	НоваяСтрока.Проведен = Истина;
	НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
	
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "card";
	НоваяСтрока.ПризнакОтменыОплаты = "d";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ОплатаБанковскойКартой");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту");
	НоваяСтрока.Проведен = Ложь;
	НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
	
	// ПоступлениеНаРасчетныйСчет
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "QR";
	НоваяСтрока.ПризнакОтменыОплаты = "n";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ПоступлениеНаРасчетныйСчет");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя");
	НоваяСтрока.Проведен = Истина;
	НоваяСтрока.ИспользуетсяПриЗагрузке = Истина;
	НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
	
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "QR";
	НоваяСтрока.ПризнакОтменыОплаты = "d";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ПоступлениеНаРасчетныйСчет");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя");
	НоваяСтрока.Проведен = Ложь;
	НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
	
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "Оплатить через СБП";
	НоваяСтрока.ПризнакОтменыОплаты = "n";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ПоступлениеНаРасчетныйСчет");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя");
	НоваяСтрока.ИспользуетсяПриЗагрузке = Истина;
	
	// СписаниеСРасчетногоСчета
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "QR";
	НоваяСтрока.ПризнакОтменыОплаты = "y";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.СписаниеСРасчетногоСчета");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю");
	НоваяСтрока.Проведен = Истина;
	НоваяСтрока.ИспользуетсяПриЗагрузке = Истина;
	НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
	
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "QR";
	НоваяСтрока.ПризнакОтменыОплаты = "d";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.СписаниеСРасчетногоСчета");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю");
	НоваяСтрока.Проведен = Ложь;
	НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
	
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "Оплатить через СБП";
	НоваяСтрока.ПризнакОтменыОплаты = "y";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.СписаниеСРасчетногоСчета");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю");
	НоваяСтрока.Проведен = Истина;
	НоваяСтрока.ИспользуетсяПриЗагрузке = Истина;
	
	// ПриходныйКассовыйОрдер
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "cash";
	НоваяСтрока.ПризнакОтменыОплаты = "n";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ПриходныйКассовыйОрдер");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя");
	НоваяСтрока.Проведен = Истина;
	НоваяСтрока.ИспользуетсяПриЗагрузке = Истина;
	НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
	
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "cash";
	НоваяСтрока.ПризнакОтменыОплаты = "d";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.ПриходныйКассовыйОрдер");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя");
	НоваяСтрока.Проведен = Ложь;
	НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
	
	// РасходныйКассовыйОрдер
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "cash";
	НоваяСтрока.ПризнакОтменыОплаты = "y";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.РасходныйКассовыйОрдер");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю");
	НоваяСтрока.Проведен = Истина;
	НоваяСтрока.ИспользуетсяПриЗагрузке = Истина;
	НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
	
	НоваяСтрока = Объект.СопоставлениеОплат.Добавить();
	НоваяСтрока.ТипОплаты = "cash";
	НоваяСтрока.ПризнакОтменыОплаты = "d";
	НоваяСтрока.ТипДокумента = ПредопределенноеЗначение("Перечисление.Wikki_ТипыДокументовОплаты.РасходныйКассовыйОрдер");
	НоваяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю");
	НоваяСтрока.Проведен = Ложь;
	НоваяСтрока.ИспользуетсяПриВыгрузке = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	УсловноеОформление.Элементы.Очистить();
		
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СопоставлениеОплатВидОперации");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СопоставлениеОплат.ТипДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СопоставлениеОплатВидОперации");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СопоставлениеОплат.ТипДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);

КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействияПриСозданииНаСервере()
		
	Элементы.ПодразделениеЗаказа.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	Элементы.ПодразделениеОплаты.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	
	НастройкиКомпоновки = РеквизитФормыВЗначение("Объект").СохраненныйОтборТоваров.Получить();
	// отбор товаров
	ИнициализироватьКомпоновкуДанныхТоваров(НастройкиКомпоновки);
	
	НастройкиКомпоновки = РеквизитФормыВЗначение("Объект").СохраненныйОтборБезлимитныхТоваров.Получить();
	// отбор безлимитных товаров
	ИнициализироватьКомпоновкуДанныхБезлимитныхТоваров(НастройкиКомпоновки);
	
	НастройкиКомпоновки = РеквизитФормыВЗначение("Объект").СохраненныйОтборЗаказов.Получить();
	// отбор заказов
	ИнициализироватьКомпоновкуДанныхЗаказов(НастройкиКомпоновки);
	
	НастройкиКомпоновки = РеквизитФормыВЗначение("Объект").СохраненныйОтборОплат.Получить();
	// отбор оплат
	ИнициализироватьКомпоновкуДанныхОплат(НастройкиКомпоновки);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасписаниеЗадания(РежимОбмена, ТекущийОбъект, РасписаниеРЗ)
	
	Задание = ТекущийОбъект.СуществующееЗадание(РежимОбмена);
	
	Если Не Задание = Неопределено Тогда
		
		Если ТипЗнч(Задание.Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
			РасписаниеРЗ = Задание.Расписание;
		ИначеЕсли ТипЗнч(Задание.Расписание) = Тип("ХранилищеЗначения") Тогда
			РасписаниеРЗ = Задание.Расписание.Получить();
		Иначе
			РасписаниеРЗ = Неопределено;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПроверитьУзелОбменаЭтаИБСервер()
	
	ЭтотУзел = ПланыОбмена.ОбменСWikki.ЭтотУзел();
	Возврат Объект.Ссылка = ЭтотУзел;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьКомпоновкуДанныхТоваров(НастройкиКомпоновки)
	
	СхемаВыгрузкиТоваров = ПланыОбмена.ОбменСWikki.ПолучитьМакет("СхемаВыгрузкиТоваров");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаВыгрузкиТоваров, УникальныйИдентификатор);
	ОтборТоваров.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	
	Если НастройкиКомпоновки = Неопределено Тогда
		ОтборТоваров.ЗагрузитьНастройки(СхемаВыгрузкиТоваров.НастройкиПоУмолчанию);
	Иначе
		ОтборТоваров.ЗагрузитьНастройки(НастройкиКомпоновки);
		ОтборТоваров.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновкуДанныхБезлимитныхТоваров(НастройкиКомпоновки)
	
	СхемаВыгрузкиТоваров = ПланыОбмена.ОбменСWikki.ПолучитьМакет("БезлимитныеТовары");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаВыгрузкиТоваров, УникальныйИдентификатор);
	ОтборБезлимитныхТоваров.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	
	Если НастройкиКомпоновки = Неопределено Тогда
		ОтборБезлимитныхТоваров.ЗагрузитьНастройки(СхемаВыгрузкиТоваров.НастройкиПоУмолчанию);
	Иначе
		ОтборБезлимитныхТоваров.ЗагрузитьНастройки(НастройкиКомпоновки);
		ОтборБезлимитныхТоваров.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновкуДанныхЗаказов(НастройкиКомпоновки)
	
	СхемаВыгрузкиЗаказов = ПланыОбмена.ОбменСWikki.ПолучитьМакет("СхемаВыгрузкиЗаказов");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаВыгрузкиЗаказов, УникальныйИдентификатор);
	ОтборЗаказов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	
	Если НастройкиКомпоновки = Неопределено Тогда
		ОтборЗаказов.ЗагрузитьНастройки(СхемаВыгрузкиЗаказов.НастройкиПоУмолчанию);
	Иначе
		ОтборЗаказов.ЗагрузитьНастройки(НастройкиКомпоновки);
		ОтборЗаказов.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновкуДанныхОплат(НастройкиКомпоновки)
	
	СхемаВыгрузкиЗаказов = ПланыОбмена.ОбменСWikki.ПолучитьМакет("СхемаВыгрузкиОплат");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаВыгрузкиЗаказов, УникальныйИдентификатор);
	ОтборОплат.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	
	Если НастройкиКомпоновки = Неопределено Тогда
		ОтборОплат.ЗагрузитьНастройки(СхемаВыгрузкиЗаказов.НастройкиПоУмолчанию);
	Иначе
		ОтборОплат.ЗагрузитьНастройки(НастройкиКомпоновки);
		ОтборОплат.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементов()
	
	УстановитьВидимостьСтраницФормы();
	
	//УстановитьДоступностьПолейОбменЗаказами();	
	
	//Если Не РазделениеВключено Тогда
	//	Элементы.ГруппаАвтообменСтраницы.ТекущаяСтраница = Элементы.ГруппаАвтообменСтраница1;
		Элементы.НастроитьРасписаниеОбменаТоварами.Доступность = Объект.ИспользоватьРегламентноеЗаданиеОбменаТоварами;
		Элементы.НастроитьРасписаниеОбменаЗаказами.Доступность = Объект.ИспользоватьРегламентноеЗаданиеОбменаЗаказами;
		Элементы.НастроитьРасписаниеОбменаОплатами.Доступность = Объект.ИспользоватьРегламентноеЗаданиеОбменаОплатами;
	//Иначе
	//	Элементы.ГруппаАвтообменСтраницы.ТекущаяСтраница = Элементы.ГруппаАвтообменСтраница2;
	//	Элементы.ИнтервалОбменаССайтом.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	//КонецЕсли;
	//
	//Если Объект.СпособИдентификацииКонтрагентов = ПредопределенноеЗначение("Перечисление.СпособыИдентификацииКонтрагентов.ПредопределенноеЗначение") Тогда
	//	Элементы.КонтрагентДляПодстановкиВЗаказы.Видимость = Истина;
	//	Элементы.ГруппаДляНовыхКонтрагентов.Доступность = Ложь;
	//Иначе
	//	Элементы.КонтрагентДляПодстановкиВЗаказы.Видимость = Ложь;
	//	Элементы.ГруппаДляНовыхКонтрагентов.Доступность = Истина;
	//КонецЕсли;
	
	//Если Объект.ВыгружатьНаСайт Тогда
	//	Элементы.СтраницыТипОбмена.ТекущаяСтраница = Элементы.СтраницаВыгрузкаНаСайт;
	//	ПереключательНазначениеОбмена = 0;
	//Иначе
	//	Элементы.СтраницыТипОбмена.ТекущаяСтраница = Элементы.СтраницаВыгрузкаВКаталог;
	//	ПереключательНазначениеОбмена = 1;
	//КонецЕсли;	
	
	//Элементы.ВыгружатьОстаткиПоСкладам.Видимость = Истина;
	//	
	//Если Объект.РежимВыгрузкиЦен=1 Тогда
	//	Элементы.ГруппаНастройки.Доступность = Ложь;
	//Иначе
	//	Элементы.ГруппаНастройки.Доступность = Истина;
	//КонецЕсли;
	
	Если Объект.ВыгружатьИзменения Тогда
		ЭтотОбъект.ПереключательВыгрузкаИзменений = 1;
	Иначе
		ЭтотОбъект.ПереключательВыгрузкаИзменений = 0;
	КонецЕсли;
	
	Элементы.ГруппаНастройкиВыгрузкиИзображения.Видимость = Объект.ВыгрузкаФайлов;
	Если Объект.ВыгрузкаФайлов И (Объект.ПротоколПередачиФайлов = Перечисления.Wikki_ПротоколПередачиФайлов.FTP) Тогда
		Элементы.СтраницыПротоколаПередачиИзображений.Видимость = Истина;
		Элементы.СтраницыПротоколаПередачиИзображений.ТекущаяСтраница = Элементы.ГруппаFTP;
	ИначеЕсли Объект.ВыгрузкаФайлов И (Объект.ПротоколПередачиФайлов = Перечисления.Wikki_ПротоколПередачиФайлов.sFTP) Тогда
		Элементы.СтраницыПротоколаПередачиИзображений.Видимость = Истина;
		Элементы.СтраницыПротоколаПередачиИзображений.ТекущаяСтраница = Элементы.ГруппаsFTP;
	Иначе
		Элементы.СтраницыПротоколаПередачиИзображений.Видимость = Ложь;
	КонецЕсли;

	Элементы.ДатаНачалаВыгрузкиЗаказов.Доступность = Объект.ОбменЗаказами И Объект.ВыгрузкаЗаказов;
	Элементы.ДатаНачалаЗагрузкиЗаказов.Доступность = Объект.ОбменЗаказами И Объект.ЗагрузкаЗаказов;
	Элементы.СтраницаНастройкаВыгрузкиЗаказов.Видимость = Объект.ОбменЗаказами И Объект.ВыгрузкаЗаказов;
	
	УстановитьВидимостьСтраницФормы();
	
	//ВидимостьСпособИдентификацииКонтрагентов();
			
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтраницТипаОбмена()
	
	Если Объект.ВыгружатьНаСайт Тогда
		Элементы.СтраницыТипОбмена.ТекущаяСтраница = Элементы.СтраницаВыгрузкаНаСайт;
	Иначе
		Элементы.СтраницыТипОбмена.ТекущаяСтраница = Элементы.СтраницаВыгрузкаВКаталог;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницФормы()
	
	Элементы.СтраницаВыгрузкаТоваров.Видимость = Объект.ОбменТоварами;
	Элементы.СтраницаОбменЗаказами.Видимость = Объект.ОбменЗаказами;
	Элементы.СтраницаОбменОплатами.Видимость = Объект.ОбменОплатами;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание(ИмяРеквизитаРасписание, Элемент)

	ВыполнитьНастройкуРасписания(ИмяРеквизитаРасписание, Элемент);
	Элемент.Заголовок = УстановитьНадписьРасписания(ЭтотОбъект[ИмяРеквизитаРасписание]);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьНадписьРасписания(Расписание)
	
	Если Расписание = Неопределено Тогда
		ТекстЗаголовка = НСтр("ru='Настроить расписание обмена'");
	Иначе
		ТекстЗаголовка = Расписание;
	КонецЕсли;
	
	Возврат ТекстЗаголовка;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьНастройкуРасписания(ИмяРеквизитаРасписание, Элемент)
	
	РасписаниеЗадания = ЭтотОбъект[ИмяРеквизитаРасписание];
	
	Если РасписаниеЗадания = Неопределено Тогда
		РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеЗадания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьНастройкуРасписанияЗавершение", ЭтотОбъект, Новый Структура("ЭлементФормы, ИмяРеквизитаРасписание", Элемент, ИмяРеквизитаРасписание));
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписанияЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[ДополнительныеПараметры.ИмяРеквизитаРасписание] = Расписание;		
	ДополнительныеПараметры.ЭлементФормы.Заголовок = УстановитьНадписьРасписания(Расписание);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИспользоватьРегламентныеЗадания(ИмяРеквизитаУзлаИспользоватьРегламентноеЗадание, ИмяРеквизитаРасписание, ЭлементНастроитьРасписаниеОбмена)
	
	ЭлементНастроитьРасписаниеОбмена.Доступность = Объект[ИмяРеквизитаУзлаИспользоватьРегламентноеЗадание];
	
	Если Объект[ИмяРеквизитаУзлаИспользоватьРегламентноеЗадание] Тогда	
		ВыполнитьНастройкуРасписания(ИмяРеквизитаРасписание, ЭлементНастроитьРасписаниеОбмена);
		
		ЭлементНастроитьРасписаниеОбмена.Заголовок = УстановитьНадписьРасписания(ЭтотОбъект[ИмяРеквизитаРасписание]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти