
Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка = истина Тогда
		Возврат;
	КонецЕсли;
	
	// на случай непосредственного изменения настройки (не через форму настроек / журнал лога)
	Если ЭтотОбъект.Значение = Истина Тогда
		Если НЕ ЗначениеЗаполнено(Константы.ЛогСобытийАТСОтключитьПосле.Получить()) Тогда
			Константы.ЛогСобытийАТСОтключитьПосле.Установить(ТекущаяДатаСеанса() + 3*60*60);
		КонецЕсли;
	Иначе
		Константы.ЛогСобытийАТСОтключитьПосле.Установить(Дата(1, 1, 1));
	КонецЕсли;
	
КонецПроцедуры
