
//++ №14649
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимОтказа = Параметры.Свойство("РежимОтказа");
	
	Если РежимОтказа Тогда
		ВремяСдвигаВСекундах = ОбщийМодульСервер.ПолучитьВремяСдвигаДатыСледующегоКонтактаЛида(Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида.ПриЗакрытииВыездаБезВыполненияВыезда);
	Иначе
		ВремяСдвигаВСекундах = ОбщийМодульСервер.ПолучитьВремяСдвигаДатыСледующегоКонтактаЛида(Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида.ПриЗакрытииВыездаСВыполнениемВыезда);
	КонецЕсли;
	
	Дата = ТекущаяДатаСеанса() + ВремяСдвигаВСекундах;
		
	ИнформацияОСтатусеЛида = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Статус лида: %1 -> %2", Параметры.ТекущийСтатус, Параметры.СтатусПерехода);
	
	ДатаСледующегоКонтакта = Параметры.ДатаСледующегоКонтакта;
	
	Элементы.ПричинаОтказа.Видимость = РежимОтказа;
	Если РежимОтказа Тогда 
		//#15955 
		ПричинаОтказа = Справочники.ПричиныОтказаЗамера.ПричинаПоУмолчанию();	
		ПроверятьКомментарий = Константы.КонтролироватьЗаполнениеКомментарияПриОтказеПоВыезду.Получить();
		Элементы.Комментарий.АвтоОтметкаНезаполненного = ПроверятьКомментарий;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьИнформациюОДатеСледующегоКонтакта();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОДатеСледующегоКонтакта()
	
	НоваяДатаСледующегоКонтакта = СокрЛП(Формат(Дата, "ДФ='dd.MM.yyyy HH:mm'"));
	ИнформацияОДатеСледующегоКонтакта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"Дата следующего контакта: %1 -> %2"
		, ?(ПустаяСтрока(ДатаСледующегоКонтакта), """Пустая""", ДатаСледующегоКонтакта)
		, ?(ПустаяСтрока(НоваяДатаСледующегоКонтакта), """Пустая""", НоваяДатаСледующегоКонтакта)
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьИнформациюОДатеСледующегоКонтакта();
	
КонецПроцедуры
//-- №14649

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если РежимОтказа Тогда
		Если ПричинаОтказа.Пустая() Тогда
			ПоказатьОповещениеПользователя("Не указана причина отказа.");
			Возврат;
		КонецЕсли;
		Если ПроверятьКомментарий И ПустаяСтрока(Комментарий) Тогда
			ПоказатьОповещениеПользователя("Не указан комментарий.");
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("РезультатВыезда", Комментарий);
	//++ №14649
	СтруктураОтвета.Вставить("Дата", Дата);
	СтруктураОтвета.Вставить("ПричинаОтказа", ПричинаОтказа);
	//-- №14649
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры



