&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//МассивНоменклатуры = Новый Массив;
	//
	//СтруктураОтбора = Новый Структура;
	//
	//// множественный выбор
	//Если ПараметрКоманды.Количество() > 0 Тогда
	//	
	//	Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.Номенклатура") Тогда
	//		МассивНоменклатуры = ПараметрКоманды;
	//		
	//	ИначеЕсли ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	//		ЗаполнитьНоменклатуруПоДокументам(ПараметрКоманды, МассивНоменклатуры);
	//		
	//		//ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("ВыбСклад");
	//		//ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	//		//ПараметрСКД.Значение = ПараметрКоманды[0].Склад;
	//		//ПараметрСКД.Использование = Истина; 
	//	КонецЕсли;
	//КонецЕсли;
	//СтруктураОтбора.Вставить("Номенклатура", МассивНоменклатуры); 
	//

	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	//ПараметрыФормы.Вставить("КлючНазначенияИспользования", "Основной");
	//ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	//Если ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	//	ПараметрыФормы.Вставить("ВыбСклад", ПараметрКоманды[0].Склад);
	//КонецЕсли;	

	//ОткрытьФорму("Отчет.АнализДоступностиТоваровИзЗаказа.Форма", 
	//			 ПараметрыФормы, 
	//			 ПараметрыВыполненияКоманды.Источник, 
	//			 Новый УникальныйИдентификатор,  
	//			 ПараметрыВыполненияКоманды.Окно, 
	//			 ПараметрыВыполненияКоманды.НавигационнаяСсылка); 
	//			 
	//			 
	//			 
	//ФормаОтчета = ПолучитьФорму("Отчет.АнализДоступностиТоваровИзЗаказа.Форма");
	//
	//КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
	//Настройки = КомпоновщикНастроек.Настройки;
	//Если ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	//	ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыбСклад"));
	//	ЭлементНастройки.Значение = ПараметрКоманды[0].Склад; 
	//	Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
	//    	ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки);
	//    	Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//        	ПользовательскийПараметр.Значение = ЭлементНастройки.Значение;
	//    	КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли; 
	//
	//
	//


	//ФормаОтчета.Открыть();
	//ФормаОтчета.СкомпоноватьРезультат();  
	
	
	ИмяОтчета = "АнализДоступностиТоваровИзЗаказа"; 
	
	МассивНоменклатуры = Новый Массив;
	
	// множественный выбор
	Если ПараметрКоманды.Количество() > 0 Тогда
		
		Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.Номенклатура") Тогда
			МассивНоменклатуры = ПараметрКоманды;
			ВыбСклад = Неопределено;
			
		ИначеЕсли ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ЗаполнитьНоменклатуруПоДокументам(ПараметрКоманды, МассивНоменклатуры);
			ВыбСклад = ПолучитьСклад(ПараметрКоманды[0]);
			
		КонецЕсли;
	КонецЕсли; 
	
	ПараметрыОткрытия = ПолучитьПараметрыОткрытияОтчета(ИмяОтчета, МассивНоменклатуры, ВыбСклад);
	ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыОткрытия, ЭтотОбъект);
				 
КонецПроцедуры

Функция ПолучитьСклад(Заказ)
	
	Возврат Заказ.Склад;
	
КонецФункции	

&НаСервере
Процедура УстановитьЭлементОтбораСКД(КомпоновщикНастроек, ВидСравнения, ИмяПоля, Значение)
	
	ЭлементОтбора =  КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	//ЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
	ЭлементОтбора.ВидСравнения = ВидСравнения;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ПравоеЗначение = Значение;
	ЭлементОтбора.Использование = Истина;

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОткрытияОтчета(ИмяОтчета, МассивНоменклатуры, ВыбСклад)
	
	ОтчетОбъект = Отчеты[ИмяОтчета].Создать();
	
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек; 
	
	СписокНоменклатуры = Новый СписокЗначений;
	
	СписокНоменклатуры.ЗагрузитьЗначения(МассивНоменклатуры);
	
	УстановитьЭлементОтбораСКД(КомпоновщикНастроек, ВидСравненияКомпоновкиДанных.ВСписке, 
		"Номенклатура", СписокНоменклатуры);
	
	СписокСкладов = Новый СписокЗначений;
	СписокСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000001"));//Склад Юг
	СписокСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000004"));//Склад Север
	СписокСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000007"));//Склад Восток
	СписокСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000005"));//Склад Запад  
	
	УстановитьЭлементОтбораСКД(КомпоновщикНастроек, ВидСравненияКомпоновкиДанных.ВСписке, 
		"Склад", СписокСкладов);
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("ВыбСклад");
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	ПараметрСКД.Значение = ВыбСклад;
	ПараметрСКД.Использование = Истина;
	
	Если ЗначениеЗаполнено(ПараметрСКД.ИдентификаторПользовательскойНастройки) Тогда
	
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрСКД.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = ПараметрСКД.Значение;
		КонецЕсли;

	КонецЕсли;
		
	ПараметрыОткрытия = Новый Структура(); 	
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("Вариант", КомпоновщикНастроек.Настройки);
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
				
	Возврат ПараметрыОткрытия;

КонецФункции

&НаСервере
Процедура ЗаполнитьНоменклатуруПоДокументам(МассивСсылок, МассивНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В(&МассивСсылок)
	|	И ЗаказПокупателяТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивНоменклатуры.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
КонецПроцедуры
