Процедура ИзменитьПорядокРеквизита(Реквизит, Направление) Экспорт
	Если Не ЗначениеЗаполнено(Реквизит) Тогда
    	Возврат
    КонецЕсли;
    
    Таб = ИА_БФС.Запрос_ВыполнитьВТЗ(
    "ВЫБРАТЬ
    |   Т.Ссылка КАК Спр,
    |   Т.Порядок КАК ПорядокСтарый,
    |   Т.Порядок КАК ПорядокНовый,
    |   ВЫБОР
    |       КОГДА Т.Ссылка = &Спр
    |           ТОГДА ИСТИНА
    |       ИНАЧЕ ЛОЖЬ
    |   КОНЕЦ КАК Изменяемый
    |ИЗ
    |   ПланВидовХарактеристик.ИА_БПРеквизиты КАК Т
    |ГДЕ
    |   Т.Родитель = &Родитель
    |
    |УПОРЯДОЧИТЬ ПО
    |   ПорядокСтарый,
    |   Т.Наименование"
    ,Новый Структура("Спр, Родитель", Реквизит, Реквизит.Родитель)); 
    
    Ц =  0;
    Для каждого Стр Из Таб Цикл
        Ц = Ц + 1;
        Стр.ПорядокНовый = Ц;
    КонецЦикла;
    
    СтрокаИзменяемого = Таб.Найти(Истина, "Изменяемый");
    Если СтрокаИзменяемого = Неопределено Тогда
    	ВызватьИсключение "Не найден реквизит """ + Реквизит + """среди своих же!";
    КонецЕсли; 
    
    СтрокаИзменяемого.ПорядокНовый = СтрокаИзменяемого.ПорядокНовый + Направление;
    
    Если СтрокаИзменяемого.ПорядокНовый = 0 И СтрокаИзменяемого.ПорядокСтарый = 1 Тогда
        // В конец
    	СтрокаИзменяемого.ПорядокНовый = Таб.Количество() + 1;
    ИначеЕсли СтрокаИзменяемого.ПорядокНовый = Таб.Количество() + 1 И СтрокаИзменяемого.ПорядокСтарый = Таб.Количество() Тогда
        // В начало
    	СтрокаИзменяемого.ПорядокНовый = 0;
    КонецЕсли;
    
    Таб.Сортировать("ПорядокНовый, Изменяемый " + ?(Направление > 0, "", "УБЫВ"));
    
    Ц =  0;
    Для каждого Стр Из Таб Цикл
        Ц = Ц + 1;
        Стр.ПорядокНовый = Ц;
    КонецЦикла;
    
    // Изменим в базе
    Для каждого Стр Из Таб Цикл
    	Если Стр.ПорядокНовый <> Стр.ПорядокСтарый Тогда
        	Спр = Стр.Спр.ПолучитьОбъект();
            Спр.Порядок = Стр.ПорядокНовый;
            Спр.Записать();
        КонецЕсли; 
    КонецЦикла; 
КонецПроцедуры
