
Функция ПолучитьМассивНастроекПоУмолчанию(ОтборТекущийСтатус)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЛида.Ссылка КАК ТекущийСтатус
	|ИЗ
	|	Справочник.СтатусыЛида КАК СтатусыЛида
	|ГДЕ
	|	НЕ СтатусыЛида.ПометкаУдаления
	//#11332
	|	И НЕ СтатусыЛида.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.УДАЛИТЬ_Сервис)
	|	И НЕ СтатусыЛида.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.УДАЛИТЬ_Рекламация)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыЛида.РеквизитДопУпорядочивания";
		
	МассивСтатусов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТекущийСтатус");
	
	//МассивСтатусов = Новый Массив;
	
	//МассивСтатусов.Добавить(Справочники.СтатусыЛида.НазначитьЗамер);   			//НазначитьЗамер				Новый ЛИД
	//МассивСтатусов.Добавить(Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера);  		//ЗаполнитьДанныеЗамера			Заявка на замер
	//МассивСтатусов.Добавить(Справочники.СтатусыЛида.ОформитьДоговор); 			//ОформитьДоговор				Оформить договор	
	//МассивСтатусов.Добавить(Справочники.СтатусыЛида.ДоговорОформлен);        		//ДоговорОформлен				Договор оформлен

	//МассивСтатусов.Добавить(Справочники.СтатусыЛида.ОтложенныйНазначитьЗамер); 	//ОтложенныйНазначитьЗамер		Отложенный замер
	//МассивСтатусов.Добавить(Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор);	//ОтложенныйЗаключитьДоговор	Отложенный договор
	
	//МассивСтатусов.Добавить(Справочники.СтатусыЛида.Отказ);     					//Отказ							Отказные	
	
	//МассивСтатусов.Добавить(Справочники.СтатусыЛида.Рекламация); 					//Рекламация					Рекламация
	//МассивСтатусов.Добавить(Справочники.СтатусыЛида.Сервис); 						//Сервис						Сервис
	
	//МассивСтатусов.Добавить(Справочники.СтатусыЛида.Сервис); 						//Обращение						Обращение

	//МассивСтатусов.Добавить(Справочники.СтатусыЛида.НеЦелевой); 					//НеЦелевой						Не целевые
		
	МассивНастроек = Новый Массив;
	
	Для каждого ТекущийСтатус из МассивСтатусов Цикл		
		Для каждого СледующийСтатус из МассивСтатусов Цикл
			Если ТекущийСтатус = СледующийСтатус Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ОтборТекущийСтатус.Пустая() И НЕ ОтборТекущийСтатус = ТекущийСтатус Тогда
				Продолжить;
			КонецЕсли;
			
			Разрешено = Ложь;			
			
			// переход в Отложенный замер
			Если СледующийСтатус = Справочники.СтатусыЛида.ОтложенныйНазначитьЗамер Тогда			
				Если ТекущийСтатус = Справочники.СтатусыЛида.НазначитьЗамер
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ОформитьДоговор Тогда
					Разрешено = Истина;
				КонецЕсли;
			КонецЕсли;
			
			// переход в Заявка на замер
			Если СледующийСтатус = Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера Тогда
				Если ТекущийСтатус = Справочники.СтатусыЛида.НазначитьЗамер
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ОтложенныйНазначитьЗамер
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ОформитьДоговор Тогда				
					Разрешено = Истина;
				КонецЕсли;
			КонецЕсли;
			
			// переход в Отложенный договор
			Если СледующийСтатус = Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор Тогда			
				Если ТекущийСтатус = Справочники.СтатусыЛида.НазначитьЗамер
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера Тогда
					Разрешено = Истина;
				КонецЕсли;
			КонецЕсли;
			
			// переход в Оформить договор
			Если СледующийСтатус = Справочники.СтатусыЛида.ОформитьДоговор Тогда
				Если ТекущийСтатус = Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера 
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор Тогда
					Разрешено = Истина;
				КонецЕсли;
			КонецЕсли;
			
			// переход в Договор оформлен
			Если СледующийСтатус = Справочники.СтатусыЛида.ДоговорОформлен Тогда
				Если ТекущийСтатус = Справочники.СтатусыЛида.ОформитьДоговор 
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор Тогда
					Разрешено = Истина;
				КонецЕсли;
			КонецЕсли;
			
			//// переход в Сервис
			//Если СледующийСтатус = Справочники.СтатусыЛида.Сервис Тогда
			//	Если ТекущийСтатус = Справочники.СтатусыЛида.НазначитьЗамер Тогда
			//		Разрешено = Истина;
			//	КонецЕсли;
			//КонецЕсли;
			//
			//// переход в Рекламация
			//Если СледующийСтатус = Справочники.СтатусыЛида.Рекламация Тогда
			//	Если ТекущийСтатус = Справочники.СтатусыЛида.НазначитьЗамер Тогда
			//		Разрешено = Истина;
			//	КонецЕсли;
			//КонецЕсли;
			
			// переход в Обращение
			Если СледующийСтатус = Справочники.СтатусыЛида.Обращение Тогда
				Если ТекущийСтатус = Справочники.СтатусыЛида.НазначитьЗамер Тогда
					Разрешено = Истина;
				КонецЕсли;
			КонецЕсли;
			
			// переход в Отказ
			Если СледующийСтатус = Справочники.СтатусыЛида.Отказ Тогда
				Если ТекущийСтатус = Справочники.СтатусыЛида.НазначитьЗамер
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ОтложенныйНазначитьЗамер
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера					
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор
					ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ОформитьДоговор Тогда				
					Разрешено = Истина;
				КонецЕсли;
			КонецЕсли;			
			
			// переход в НеЦелевой
			Если СледующийСтатус = Справочники.СтатусыЛида.НеЦелевой Тогда
				Если ТекущийСтатус = Справочники.СтатусыЛида.НазначитьЗамер Тогда
					Разрешено = Истина;
				КонецЕсли;
			КонецЕсли;
			
			ДобавитьНастройку(МассивНастроек, ТекущийСтатус, СледующийСтатус, Разрешено);	
		КонецЦикла;		
	КонецЦикла;	
			
	Возврат МассивНастроек;
	
КонецФункции

Процедура ЗаполнитьНастройкиПоУмолчанию(ПерезаполнитьВесьРегистр = Ложь, ИмяТекущегоСтатусаСтрокой = "") Экспорт
	
	ТекущийСтатус = Справочники.СтатусыЛида.ПустаяСсылка();
	Если НЕ ПустаяСтрока(ИмяТекущегоСтатусаСтрокой) Тогда
		ТекущийСтатус = Справочники.СтатусыЛида[ИмяТекущегоСтатусаСтрокой];
	КонецЕсли;
	
	Если ПерезаполнитьВесьРегистр Тогда
		Если ПустаяСтрока(ИмяТекущегоСтатусаСтрокой) Тогда
			// очистка всего регистра
			НаборЗаписей = РегистрыСведений.ПорядокПереводаСтатусаЛида.СоздатьНаборЗаписей();
			НаборЗаписей.Записать();
		Иначе
			// очистка по статусу
			НаборЗаписей = РегистрыСведений.ПорядокПереводаСтатусаЛида.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТекущийСтатус.Установить(ТекущийСтатус);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
	
	МассивНастроек = ПолучитьМассивНастроекПоУмолчанию(ТекущийСтатус);
	Для каждого ЭлементМассива из МассивНастроек Цикл
		ДобавитьОбновитьЗапись(ЭлементМассива.ТекущийСтатус, ЭлементМассива.СледующийСтатус, ЭлементМассива.Разрешено);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНастройку(МассивНастроек, ТекущийСтатус, СледующийСтатус, Разрешено=Ложь)
	
	МассивНастроек.Добавить(Новый Структура("ТекущийСтатус, СледующийСтатус, Разрешено", ТекущийСтатус, СледующийСтатус, Разрешено)); 
	
КонецПроцедуры

Процедура ДобавитьОбновитьЗапись(ТекущийСтатус, СледующийСтатус, Разрешено, ЗамещатьЗапись = Ложь) Экспорт

	МенеджерЗаписи = РегистрыСведений.ПорядокПереводаСтатусаЛида.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТекущийСтатус = ТекущийСтатус;
	МенеджерЗаписи.СледующийСтатус = СледующийСтатус;
	МенеджерЗаписи.Прочитать();
	
	Если НЕ МенеджерЗаписи.Выбран() Тогда			
		МенеджерЗаписи.ТекущийСтатус 	= ТекущийСтатус; 
		МенеджерЗаписи.СледующийСтатус 	= СледующийСтатус; 
		МенеджерЗаписи.Разрешено 		= Разрешено;
		МенеджерЗаписи.Записать();
		
	ИначеЕсли ЗамещатьЗапись Тогда
		МенеджерЗаписи.ТекущийСтатус 	= ТекущийСтатус; 
		МенеджерЗаписи.СледующийСтатус 	= СледующийСтатус; 
		МенеджерЗаписи.Разрешено 		= Разрешено;
		МенеджерЗаписи.Записать(Истина);	
		
	КонецЕсли;	
		
КонецПроцедуры

Функция РазрешенПереводСтатуса(ТекущийСтатус, СледующийСтатус) Экспорт

	//Если ПараметрыСеанса.ТекущийПользователь.РазрешеноПереводитьЛидыВЛюбыеСтатусы Тогда
	//	ИЛИ ТекущийСтатус = СледующийСтатус Тогда
	//	Возврат Истина;
	//КонецЕсли;
	//
	//Разрешено = Ложь;
	//
	//МенеджерЗаписи = РегистрыСведений.ПорядокПереводаСтатусаЛида.СоздатьМенеджерЗаписи();
	//МенеджерЗаписи.ТекущийСтатус = ТекущийСтатус;
	//МенеджерЗаписи.СледующийСтатус = СледующийСтатус;
	//МенеджерЗаписи.Прочитать();
	//
	//Если МенеджерЗаписи.Выбран() Тогда
	//	Разрешено = МенеджерЗаписи.Разрешено;		
	//КонецЕсли;
	//
	//Возврат Разрешено;
	
	//++ №10183 если статус равен самому себе, разрешаем
	Если ЗначениеЗаполнено(ТекущийСтатус) И ТекущийСтатус = СледующийСтатус Тогда
		Возврат Истина;
	КонецЕсли;
	//-- №10183
	
	МассивДоступныхСтатусов = ДоступныеДляПереводаСтатусы(ТекущийСтатус);
	Возврат НЕ (МассивДоступныхСтатусов.Найти(СледующийСтатус) = Неопределено);
		
КонецФункции

Функция ДоступныеДляПереводаСтатусы(ТекущийСтатус) Экспорт

	МассивДоступныхСтатусов = Новый Массив;
	
	РазрешеноПереводитьЛидыВЛюбыеСтатусы = ПараметрыСеанса.ТекущийПользователь.РазрешеноПереводитьЛидыВЛюбыеСтатусы;
	
	НеДоступенНеЦелевой = ПараметрыСеанса.ТекущийПользователь.НеДоступенПереводЛидаВНеЦелевой;
	НеДоступенОтказ     = ПараметрыСеанса.ТекущийПользователь.НеДоступенПереводЛидаВОтказ;
		
	НаборЗаписей = РегистрыСведений.ПорядокПереводаСтатусаЛида.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТекущийСтатус.Установить(ТекущийСтатус);
	НаборЗаписей.Прочитать();
	Для каждого ЗаписьРегистра из НаборЗаписей Цикл
		Если ЗаписьРегистра.Разрешено ИЛИ РазрешеноПереводитьЛидыВЛюбыеСтатусы Тогда
			Если НЕ (ЗаписьРегистра.СледующийСтатус = Справочники.СтатусыЛида.НеЦелевой И НеДоступенНеЦелевой) 
				И НЕ (ЗаписьРегистра.СледующийСтатус = Справочники.СтатусыЛида.Отказ И НеДоступенОтказ) Тогда
			
				МассивДоступныхСтатусов.Добавить(ЗаписьРегистра.СледующийСтатус);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МассивДоступныхСтатусов.Добавить(ТекущийСтатус); //++ №10183 текущий статус
			
	Возврат МассивДоступныхСтатусов;
		
КонецФункции


