
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Если НЕ ДоступнаРольАдминистратора() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЖурнал(Команда)
		
	ОчиститьЖурналНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОчиститьЖурналНаСервере()
	
	Если НЕ РольДоступна("АдминистраторСистемы") Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИсторияЗвонковАТС.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Функция ДоступнаРольАдминистратора()
	
	Возврат РольДоступна("АдминистраторСистемы");
	
КонецФункции

#КонецОбласти



