&НаКлиенте
Процедура УстановитьВидимостьДоступность()
    //Элементы.Состав.Видимость = Объект.ГруппаВсеПользователи;
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ГруппаВсе = Объект.Ссылка = Справочники.ИА_ПраваГруппыПользователей.ВсеПользователи;
    Элементы.Порядок.Видимость = Не ГруппаВсе;
    Элементы.Состав.Видимость = Не ГруппаВсе;
КонецПроцедуры
