
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    Оповестить("ЗначениеПраваИзменено", Запись.Пользователь);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если НЕ ИА_ПраваС.ЕстьПолныеПраваНаПодсистему(Отказ, Истина) Тогда
	//    Возврат;
	//КонецЕсли; 
    Если Параметры.Свойство("ТолькоВвод")
        И Параметры.ТолькоВвод Тогда
    	Элементы.Пользователь.Доступность = Ложь;
        Элементы.Право.Доступность = Ложь;
    КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
    Оповестить("ЗначениеПраваИзменено", Запись.Пользователь);
КонецПроцедуры
