
&НаКлиенте
Процедура ВыполнитьРегистрацию(Команда)
	Результат = ОбщийМодуль.ВыполнитьРегистрациюБазы(Логин, Пароль);
	Если Результат.Успешно Тогда
		ОП = Новый ОписаниеОповещения("ПослеОповещенияОбУспешнойРегистрации", ЭтаФорма);
		ПоказатьПредупреждение(ОП,Результат.ТекстовоеОписание);
	Иначе
		ПоказатьПредупреждение(,Результат.ТекстовоеОписание);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОповещенияОбУспешнойРегистрации(Парам1) Экспорт
	ЭтаФорма.Закрыть();
КонецПроцедуры