
// вход id вида аналитики 
// выход id, value - значения аналитики
Функция GetDataOfAnalyticsGetData(Запрос)
	идАн = Запрос.ПараметрыURL["id"];
	ан = Справочники.ИА_ВидыАналитикиСтатистики.НайтиПоРеквизиту("ВебУИД",идАн);
	
	Если ан.Пустая() ТОгда
		Ответ = Новый HTTPСервисОтвет(400,"No such analytics");					
		Возврат Ответ;
	КонецЕсли;
	
	
	ЗначТип1 = ан.ТипАналитикиПолный;
	Если ЗначТип1 = "Булево" ИЛИ ЗначТип1 = "Строка" ИЛИ ЗначТип1 = "Число" ИЛИ ЗначТип1 = "Дата" тогда 
		Ответ = Новый HTTPСервисОтвет(400,"Primitive type");					
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		ЗначТип1 = СтрЗаменить(ЗначТип1, "СправочникСсылка", "Справочник");
		ЗначТип1 = СтрЗаменить(ЗначТип1, "ДокументСсылка", "Документ");
		ЗначТип1 = СтрЗаменить(ЗначТип1, "ПеречислениеСсылка", "Перечисление");  
		ЗначТип1 = СтрЗаменить(ЗначТип1, "ЗадачаСсылка", "Задача");
		
		ЭтоПеречисл = Найти(ЗначТип1,"Перечисление.")>0;
		
		Запрос = новый запрос;
		Если ЗначТип1 = "" Тогда 		
			Запрос.Текст = "ВЫБРАТЬ
			               |	ИА_ЗначениеАналитики.Ссылка
			               |ИЗ
			               |	Справочник.ИА_ЗначениеАналитики КАК ИА_ЗначениеАналитики
			               |ГДЕ
			               |	ИА_ЗначениеАналитики.Владелец = &Владелец
			               |	И ИА_ЗначениеАналитики.ПометкаУдаления = ложь";
			Запрос.УстановитьПараметр("Владелец", ан);
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
			               |	ИА_ЗначениеАналитики.Ссылка
			               |ИЗ
			               |	Справочник.ИА_ЗначениеАналитики КАК ИА_ЗначениеАналитики
			               |ГДЕ
			               |	ИА_ЗначениеАналитики.ПометкаУдаления = ложь";
			запрос.Текст = СтрЗаменить(запрос.Текст,"Справочник.ИА_ЗначениеАналитики", ЗначТип1);
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();

		МассивРез = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Если ЭтоПеречисл тогда    
				идЗн = КСУ_СтатистикиВеб.ПолучитьИмяЗначенияПеречисления(Выборка.ссылка);
				МассивРез.Добавить(Новый Структура("id, value", идЗн, идЗн));      
			Иначе
				МассивРез.Добавить(Новый Структура("id, value", строка(Выборка.ссылка.УникальныйИдентификатор()), строка(Выборка.ссылка)));      
			КонецЕсли;
		КонецЦикла;

		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();	
		ЗаписатьJSON(ЗаписьJSON, МассивРез);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			
		Ответ = Новый HTTPСервисОтвет(200);	
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);		
		Возврат Ответ;
	Исключение
		Ответ = Новый HTTPСервисОтвет(400,строка(ОписаниеОшибки()));					
		Возврат Ответ;
	КонецПопытки;
КонецФункции

// вход id статистики, дата начала, конца, значения аналитик
// выход  период, кол-во (значение статистики), комментарий и значение Аналитики 1,значение Аналитики 2,значение Аналитики 3
Функция GetStatisticsDataGetData(Запрос)
	идСтат = Запрос.ПараметрыURL["statisticId"];
	ДатаНачалаСтр = Запрос.ПараметрыURL["StartDate"];
	ДатаКонцаСтр = Запрос.ПараметрыURL["EndDate"];	
	ТипПериодаСтр = строка(Запрос.ПараметрыURL["periodType"]); // по дням/неделям/месяцам/годам 10, 20, 30, 40
	
	ан1 = Запрос.ПараметрыЗапроса.Получить("anValue1");
	ан2 = Запрос.ПараметрыЗапроса.Получить("anValue2");
	ан3 = Запрос.ПараметрыЗапроса.Получить("anValue3");
	
	ВидСтат = Справочники.ИА_ВидыСтатистик.НайтиПоРеквизиту("ВебУИД",идСтат);
	Если ВидСтат.Пустая() ТОгда
		Ответ = Новый HTTPСервисОтвет(400,"No such statistic");					
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
	    ДатаНачала = МестноеВремя(дата(ДатаНачалаСтр));
		ДатаКонца = КонецДня(МестноеВремя(дата(ДатаКонцаСтр)));
		
		ЗначАн1 = КСУ_СтатистикиВеб.получитьЗначениеАналитики(ВидСтат, 1, ан1);
		ЗначАн2 = КСУ_СтатистикиВеб.получитьЗначениеАналитики(ВидСтат, 2, ан2);
		ЗначАн3 = КСУ_СтатистикиВеб.получитьЗначениеАналитики(ВидСтат, 3, ан3);		
		
		Если ТипПериодаСтр = "10"  или ТипПериодаСтр = "20" Тогда // день или неделя
			ТипПериода = Перечисления.ИА_ПериодыДетализации.День;
		ИначеЕсли ТипПериодаСтр = "30" Тогда
			ТипПериода = Перечисления.ИА_ПериодыДетализации.Месяц;
		ИначеЕсли ТипПериодаСтр = "40" Тогда
			ТипПериода = Перечисления.ИА_ПериодыДетализации.Год;
		КонецЕсли;
		тз = КСУ_СтатистикиВеб.ПолучитьДанныеСтатистики(ДатаНачала, ДатаКонца, ТипПериода, ВидСтат, ЗначАн1, ЗначАн2, ЗначАн3); 
		
		МассивРез = Новый Массив;
		для каждого стр из тз Цикл
			UTC = УниверсальноеВремя(стр.Период);
			прАн1 = КСУ_СтатистикиВеб.получитьИДЗначенияАналитики(ВидСтат, 1, стр.Аналитика1);
			прАн2 = КСУ_СтатистикиВеб.получитьИДЗначенияАналитики(ВидСтат, 2, стр.Аналитика2);
			прАн3 = КСУ_СтатистикиВеб.получитьИДЗначенияАналитики(ВидСтат, 3, стр.Аналитика3);
			МассивРез.Добавить(Новый Структура("date, value, analitics1, analitics2, analitics3", формат(UTC,"ДФ=yyyy-MM-ddTHH:mm:ss.000Z"), формат(стр.Количество,"ЧН=; ЧГ="),прАн1,прАн2,прАн3 ));     
		КонецЦикла;

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();	
		ЗаписатьJSON(ЗаписьJSON, МассивРез);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			
		Ответ = Новый HTTPСервисОтвет(200);	
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);		
		Возврат Ответ;
	Исключение
		
		Ответ = Новый HTTPСервисОтвет(400,строка(ОписаниеОшибки()));					
		Возврат Ответ;
	КонецПопытки;
КонецФункции

