
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Представление = Данные.Наименование;
	
	Если не Данные.Родитель.Пустая() Тогда
		Представление = Представление + " (";
		ТекРод = Данные.Родитель;
		ЭтоПервый = истина;
		Пока не ТекРод.Пустая() цикл
			Если не ЭтоПервый Тогда 
				Представление = Представление + " / ";
			КонецЕсли;
			
			Представление = Представление + ТекРод.Наименование;
			ЭтоПервый = ложь;
			
			ТекРод = ТекРод.родитель;
		КонецЦикла;
		Представление = Представление + ")";
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Родитель");
	Поля.Добавить("Наименование");
КонецПроцедуры
