
&НаСервере
Перем ТекстФайлIni;

&НаКлиенте
Перем ПредыдущееОснование; // №14089

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Ложь);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ИспользоватьАвтоматическиеСкидки = Константы.ИспользоватьАвтоматическиеСкидки.Получить();
	ИспользоватьКонтрольКратности = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольКратностиЕдиницИзмерения");
	
	Если Параметры.Ключ.Пустая() Тогда
		ПриСозданииЧтенииНаСервере();
		
	ИначеЕсли НЕ ЭтаФорма.ТолькоПросмотр Тогда
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// управление доступностью элементов
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ДополнительныеПраваЗапретРедактированияЦенВДокументах, ДополнительныеПраваЗапретПримененияСкидок");
	
	Если РеквизитыПользователя.ДополнительныеПраваЗапретРедактированияЦенВДокументах Тогда
		
		МассивИменЭлементов = Документы.ПредварительныйРасчетЗаказДоговора.ПолучитьМассивРеквизитовПоЦенам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
		
	КонецЕсли;
	
	//#7771
	Если РеквизитыПользователя.ДополнительныеПраваЗапретПримененияСкидок Тогда
		
		МассивИменЭлементов = Документы.ПредварительныйРасчетЗаказДоговора.ПолучитьМассивРеквизитовПоСкидкам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
		
	КонецЕсли;
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	
	ПереключательНаНазваниеКомнат = Константы.ИспользоватьСправочникКомнатВРознице.Получить();
	
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию, , 36);
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("ДеревоТоваровНоменклатураАртикул");
	МассивЭлементов.Добавить("ДеревоМатериаловНоменклатураАртикул");
	МассивЭлементов.Добавить("ВыработкаНоменклатураАртикул");
	МассивЭлементов.Добавить("ОбъектВыработкаНоменклатураАртикул");
	МассивЭлементов.Добавить("ВыработкаПлановаяНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
	ЗаполнитьСтавкуНДСПоОрганизацииСервер();
	
	//Если Объект.ТоварыУслуги.Количество() = 0 Тогда
	//	
	//	// добавим первую комнату
	//	НоваяСтрока = Объект.ТоварыУслуги.Добавить();
	//	НоваяСтрока.Комната = "Комната 1";
	//	
	//КонецЕсли;
	
	// проверим и перезаполним комнаты в материалах, если их там нет
	Если Объект.Материалы.Количество() = 0 Тогда
		
		ВременнаяТаблица = Объект.ТоварыУслуги.Выгрузить();
		ВременнаяТаблица.Свернуть("Комната");
		
		Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
			
			Если НЕ ПустаяСтрока(ТекущаяСтрока.Комната) Тогда
				НоваяСтрока = Объект.Материалы.Добавить();
				НоваяСтрока.Комната = ТекущаяСтрока.Комната;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураДействийПоСТ = СопутствующиеТоварыСервер.СтруктураДействийПоСопутствующимТоварамВРознице();
	
	//++15925
	СтруктураСпособовДобавленияПродукции = ОбщийМодульСервер.СтруктураСпособовДобавленияПродукции();
	Элементы.ДеревоТоваровЗагрузитьПотолокИзEasyCeiling.Видимость = СтруктураСпособовДобавленияПродукции.СпособДобавленияПродукцииЗагрузитьИзПостроителя; 
	Элементы.ДеревоТоваровДобавитьУстановкуПотолка.Видимость = СтруктураСпособовДобавленияПродукции.СпособДобавленияПродукцииВыбратьПотолок;
	Элементы.ДеревоТоваровДобавитьПотолок.Видимость = СтруктураСпособовДобавленияПродукции.СпособДобавленияПродукцииСоздатьПотолок;
	Элементы.ДеревоТоваровДобавитьПродукцию.Видимость = СтруктураСпособовДобавленияПродукции.СпособДобавленияПродукцииСоздатьПродукцию;
	Элементы.ДеревоТоваровДобавитьКонструкцию.Видимость = СтруктураСпособовДобавленияПродукции.СпособДобавленияПродукцииСоздатьКонструкцию;
	//--15925
	
	// построим дерево
	ПерестроитьДеревоНаФорме();
	
	Если РольДоступна("ОтчетПредварительнаяСебестоимостьЗаказДоговораПросмотр") 
		или РольДоступна("АдминистраторСистемы") 
		или РольДоступна("ПолныеПрава") Тогда
		Элементы.ПредварительныйРасчет.Видимость = Истина;
	Иначе
		Элементы.ПредварительныйРасчет.Видимость = Ложь;
	КонецЕсли;
	
	ОбновитьДопИнформацию();
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	ВидСпецификацииПоУмолчанию = Перечисления.ВидыСпецификации.СопутствующиеМатериалы;
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ЗаполнитьСтавкуНДСПоОрганизацииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	ОбновитьЭлементыФормы();
	
	РассчитатьИтоговыеПоказателиКлиент(ТолькоПросмотр);
	
	ПредыдущееОснование = Объект.Основание; // №14089
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПеренестиДеревоВТабличнуюЧасть();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	//#16345
	Если ИспользоватьКонтрольКратности Тогда
		ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(Отказ, Объект, Перечисления.ВидыДокументовПроверкиКратности.ПредварительныйРасчет);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("СозданПредварительныйРасчет", Объект.Основание);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда
		Если НЕ ПодборВМатериалы Тогда
			ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, "Подбор");
		Иначе
			ПодборВМатериалы = Ложь;
			ОбработкаВыбораПодборМатериаловНаКлиенте(ВыбранноеЗначение);
		КонецЕсли;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ШаблоныКомнатДляЗаказДоговора.Форма.ФормаПодбора" Тогда	
		ОповещениеЗаполнитьКомнатуПоШаблонуЗавершение = Новый ОписаниеОповещения("ЗаполнитьКомнатуПоШаблонуЗавершение", ЭтотОбъект);
		ОбщийМодульКлиент.Розница_ОбработкаВыбораЗаполненияПоШаблону(ЭтотОбъект, ОповещениеЗаполнитьКомнатуПоШаблонуЗавершение, ВыбранноеЗначение);
		
	// #10992
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.НазваниеКомнат.Форма.ФормаВыбора" И ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		//ДобавитьКомнатуЗавершение(ВыбранноеЗначение);
		ОбщийМодульКлиент.Розница_ДобавитьКомнатуЗавершение(Новый Структура("Форма", ЭтаФорма), ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Контрагенты") Тогда
		Объект.Контрагент = ВыбранноеЗначение;
		КонтрагентПриИзменении(Неопределено);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "РегистрСведений.СопутствующиеТоварыИУслуги.Форма.ФормаПодбора" Тогда	
		
		//Удаляем сопутствующие товары для текущей номенклатуры без подтверждения
		МассивСопутствующихТоваровНаУдаление = ОбщийМодульКлиент.ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(Элементы.ДеревоТоваров, ДеревоТоваров);
		ОбщийМодульКлиент.УдалитьСопутствующиеТовары(ДеревоТоваров, МассивСопутствующихТоваровНаУдаление);
	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, "ДобавлениеСопутки", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ПеренестиДеревоВТабличнуюЧасть();
	ЗадатьВопросОПересчетеЦен();
	
	ВалютаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()

	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьСтавкуНДСПоОрганизацииКлиент();
	РассчитатьИтоговыеПоказателиКлиент();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()

	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию, , 36);

КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	
	Если ПраваПользователей.ВидЦенДоступенПользователю(Объект.ВидЦен) Тогда
		ПеренестиДеревоВТабличнуюЧасть();
		ЗадатьВопросОПересчетеЦен();
	Иначе
		Объект.ВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	
	//++ №14089
	Если Не ПроверитьИспользованиеРасчетаКакОсновного(ПредыдущееОснование) Тогда
		Объект.Основание = ПредыдущееОснование;
	Иначе
		ПредыдущееОснование = Объект.Основание;
	КонецЕсли;
	//-- №14089
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтрагента(Команда)
	
	//#16308
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСозданииКонтрагента", ЭтаФорма);	
	ПоказатьВопрос(ОписаниеОповещения, "Создать нового контрагента?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСозданииКонтрагента(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда			
		ПараметрыНовогоКонтрагента = ПараметрыНовогоКонтрагентаНаСервере();
		ПараметрыФормы = Новый Структура("Основание, ВыборНового", ПараметрыНовогоКонтрагента, Истина);
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
		// получение контрагента в процедуре ОбработкаВыбора				
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийДереваТоваров

&НаКлиенте
Процедура ДеревоТоваровПриИзменении(Элемент)
	
	//в этом методе нелья вызывать ПеренестиДеревоВТабличнуюЧасть(), т.к. иначе если при обрабтке изменения значения реквизита вызвать асинхронный дилог вопроса, то 
	//к тому времени как пользователь даст ответ на вопрос, его внесенные данные будут затерты в дереве

	
	//ТекущаяКомната = Неопределено;
	//ТекущаяНоменклатура = Неопределено;
	//Если НЕ Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено Тогда
	//	ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
	//	ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
	//КонецЕсли;
	//
	//ПеренестиДеревоВТабличнуЧасть();
	//ОбновитьЭлементыФормы(ТекущаяКомната, ТекущаяНоменклатура);
	//
	//ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПередНачаломИзменения(Элемент, Отказ)
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если ТекущиеДанные.Номенклатура.Пустая() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПередУдалением(Элемент, Отказ)
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоТоваров.ВыделенныеСтроки Цикл
		ТекущиеДанные = ДеревоТоваров.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 Тогда
			//не даем удалить саму комнату, иначе нижние проверки не сработают
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Отказ И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги Тогда
		МассивСопутствующихТоваровНаУдаление = ОбщийМодульКлиент.ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(Элементы.ДеревоТоваров, ДеревоТоваров);
		Если МассивСопутствующихТоваровНаУдаление.Количество() > 0 Тогда 		
			Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриУдаленииНоменклатуры Тогда
				ДопПараметры = Новый Структура("МассивСопутствующихТоваровНаУдаление", МассивСопутствующихТоваровНаУдаление);
				Если ЗначениеЗаполнено(ТекущиеДанные.ХарактеристикаНоменклатуры) Тогда
					ДляВопросаОНоменклатуре = ", характеристика: """ + ТекущиеДанные.ХарактеристикаНоменклатуры + """";
				Иначе
					ДляВопросаОНоменклатуре = "";
				КонецЕсли;
				ПоказатьВопрос(Новый ОписаниеОповещения("ВопросУдалениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Удалить сопутствующие товары и услуги для номенклатуры: """ + ТекущиеДанные.Номенклатура + """" + ДляВопросаОНоменклатуре + "?", РежимДиалогаВопрос.ДаНет);			
			Иначе
				ОбщийМодульКлиент.УдалитьСопутствующиеТовары(ДеревоТоваров, МассивСопутствующихТоваровНаУдаление);
				МассивСопутствующихТоваровНаУдаление.Очистить();
				РассчитатьИтоговыеПоказателиКлиент();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдалениеСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОбщийМодульКлиент.УдалитьСопутствующиеТовары(ДеревоТоваров, ДополнительныеПараметры.МассивСопутствующихТоваровНаУдаление);
		РассчитатьИтоговыеПоказателиКлиент();
	КонецЕсли;
	Если ДополнительныеПараметры.Свойство("СтрокаТабличнойЧасти") Тогда
		    Элементы.ДеревоТоваров.ТекущаяСтрока = ДополнительныеПараметры.СтрокаТабличнойЧасти.ПолучитьИдентификатор();
			ДеревоТоваровНоменклатураПриИзменении(ДополнительныеПараметры.СтрокаТабличнойЧасти);
	КонецЕсли;	
	Если ДополнительныеПараметры.Свойство("СтрокаХарактеристикиТабличнойЧасти") Тогда
		    Элементы.ДеревоТоваров.ТекущаяСтрока = ДополнительныеПараметры.СтрокаХарактеристикиТабличнойЧасти.ПолучитьИдентификатор();
			ДеревоТоваровХарактеристикаНоменклатурыПриИзменении(ДополнительныеПараметры.СтрокаХарактеристикиТабличнойЧасти);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РассчитатьИтоговыеПоказателиКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПослеУдаления(Элемент)
	
	ПеренестиДеревоВТабличнуюЧасть();
	//ПерестроитьДеревоНаФорме();
	//РазвернутьДеревоТоваров();
	//РазвернутьДеревоМатериалов();
	
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандДереваТоваров

#КонецОбласти

#Область ОбработчикиСобытийДереваМатериалов

#КонецОбласти

#Область ОбработчикиКомандДереваМатериалов

&НаКлиенте
Процедура ДобавитьМатериал(Команда)
	Если Элементы.ДеревоМатериалов.ТекущиеДанные <> Неопределено  Тогда
		Если Не ПустаяСтрока(Элементы.ДеревоМатериалов.ТекущиеДанные.Комната) Тогда
			ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,,,,,Новый ОписаниеОповещения("ПослеВыбораМатериала",ЭтаФорма,Элементы.ДеревоМатериалов.ТекущиеДанные.Комната));
		Иначе
			ПоказатьОповещениеПользователя("Выберите комнату");
		КонецЕсли;	
	Иначе
		ПоказатьОповещениеПользователя("Выберите комнату");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьМатериалы(Команда)
	
	ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;	
	
	Если ПустаяСтрока(ТекущиеДанные.Комната) Тогда		
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	ПодборВМатериалы = Истина;
	ПараметрыПодбора = ПараметрыПодбора();
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборМатериаловНаКлиенте(ВыбранноеЗначение)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ДеревоМатериалов.ТекущиеДанные;
	ТекущаяКомната = ТекущаяСтрока.Комната;

	ОбработатьПодборМатериаловНаСервере(ВыбранноеЗначение, ТекущаяКомната);
	ПеренестиДеревоВТабличнуюЧасть();

КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборМатериаловНаСервере(ВыбранноеЗначение, ТекущаяКомната)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Если Строка.Комната = ТекущаяКомната Тогда
			Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
				Стр = Строка.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(Стр, ТекущаяСтрока);
				Стр.Комната = ТекущаяКомната;
			КонецЦикла;
			
			ЗначениеВДанныеФормы(Дерево, ДеревоМатериалов);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// оформление строки комнаты в дереве товаров
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоТоваров.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоТоваров.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	//Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина)); // жирным
	
	// представление вида номенклатуры "Товар"
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоТоваровВидНоменклатуры.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоТоваров.ВидНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.ВидыНоменклатуры.Материал;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Товар");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтавкуНДСПоОрганизацииКлиент(ИзменятьСтавку = Истина)
	
	ЗаполнитьСтавкуНДСПоОрганизацииСервер();
	Если ИзменятьСтавку Тогда		
		СтрокиКомнат = ДеревоТоваров.ПолучитьЭлементы();
		Для Каждого СтрокаКомнаты из СтрокиКомнат Цикл
			СтрокиТоваров = СтрокаКомнаты.ПолучитьЭлементы();	
			Для Каждого СтрокаТовара Из СтрокиТоваров Цикл
				СтрокаТовара.СтавкаНДС = СтавкаНДСПоУмолчанию;
				ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТовара, УчитыватьНДС);
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизацииСервер()
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
	СтавкаНДСПоУмолчанию = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);
	
	Элементы.ДеревоТоваровСтавкаНДС.Видимость 	= УчитыватьНДС;
	Элементы.ДеревоТоваровСуммаНДС.Видимость 	= УчитыватьНДС;
	
КонецПроцедуры

//++ №14089
&НаСервере
Функция ПроверитьИспользованиеРасчетаКакОсновного(ДокументОснование)
	
	КВозврату = Истина;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат КВозврату;
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лид.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.ОсновнойПредварительныйРасчет = &ДокументСсылка
	|";
	Запрос.УстановитьПараметр("ДокументСсылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сообщить("Данный предварительный расчет является основным для лида: " + Выборка.Ссылка + " Предварительно следует снять отметку ""Основной"" для данного расчета в лиде.");
		
		КВозврату = Ложь;
		
	КонецЦикла;
	
	Возврат КВозврату;
	
КонецФункции
//-- №14089

&НаСервере
Функция ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("Цена", ПолучитьЦенуНоменклатуры(СтруктураДанные.Номенклатура, СтруктураДанные.ХарактеристикаНоменклатуры, СтруктураДанные.ЕдиницаИзмерения));
	СтруктураДанные.Вставить("ЦенаПоПрайсу", СтруктураДанные.Цена);
	СтруктураДанные.Вставить("СтавкаНДС", ?(УчитыватьНДС, Объект.СтавкаНДС, Перечисления.СтавкиНДС.ПустаяСсылка()));
	
	//#16345
	Если СтруктураДанные.ИспользоватьКонтрольКратности 
		И НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешитьНесоответствиеКратностиЕдиницИзмерения") Тогда
		
		СтруктураПоиска = Новый Структура("ВидДокумента, ЕдиницаИзмерения", Перечисления.ВидыДокументовПроверкиКратности.ПредварительныйРасчет, СтруктураДанные.ЕдиницаИзмерения);
		НайденныеСтроки = СтруктураДанные.Номенклатура.Кратность.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда		
			СтруктураДанные.Вставить("Количество", 0); //#16345
		Иначе
			СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
		КонецЕсли;
	Иначе
		СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
	КонецЕсли;
	
	СтруктураДанные.Вставить("ПроцентСкидки", ПолучитьПроцентСкидки(СтруктураДанные.ИспользоватьАвтоматическиеСкидки, СтруктураДанные.ВидСкидки, СтруктураДанные.Дата, СтруктураДанные.Номенклатура, СтруктураДанные.Количество));
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПроцентСкидки(ИспользоватьАвтоматическиеСкидки, ВидСкидки, Дата, Номенклатура, Количество)
	Возврат ПолучитьПроцентВидаСкидки(ВидСкидки) + ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Дата, Номенклатура, Количество);
КонецФункции

&НаКлиенте
Функция СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",						"ТоварыУслуги");                          
	//СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);  
	СтруктураДанные.Вставить("ВидСпецификации",					ВидСпецификацииПоУмолчанию); 	
	СтруктураДанные.Вставить("Номенклатура",					СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", 		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 				СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 						СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 							Объект.Дата);
	//СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	//СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	//СтруктураДанные.Вставить("Организация",			Объект.Организация);
	//СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	//СтруктураДанные.Вставить("Контрагент",			Объект.Контрагент);
	СтруктураДанные.Вставить("ИспользоватьАвтоматическиеСкидки",ИспользоватьАвтоматическиеСкидки);
	СтруктураДанные.Вставить("ВидСкидки", 						Объект.ВидСкидки);
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);
										
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция СтруктураДанныхПоСтрокеТабличнойЧастиСервер(СтрокаТабличнойЧасти)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",						"ТоварыУслуги");                          
	//СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);  
	СтруктураДанные.Вставить("ВидСпецификации",					ВидСпецификацииПоУмолчанию); 		
	СтруктураДанные.Вставить("Номенклатура",					СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", 		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 				СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 						СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 							Объект.Дата);
	//СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	//СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	//СтруктураДанные.Вставить("Организация",			Объект.Организация);
	//СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	//СтруктураДанные.Вставить("Контрагент",			Объект.Контрагент);
	СтруктураДанные.Вставить("ИспользоватьАвтоматическиеСкидки",ИспользоватьАвтоматическиеСкидки);
	СтруктураДанные.Вставить("ВидСкидки", 						Объект.ВидСкидки);
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Процедура ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества)
	
	ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(ОтказВИзмененииКоличества, СтруктураДанные, Перечисления.ВидыДокументовПроверкиКратности.ПредварительныйРасчет);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыНовогоКонтрагентаНаСервере()

	ПараметрыНовогоКонтрагента = Новый Структура;
	ПараметрыНовогоКонтрагента.Вставить("Родитель", Константы.ГруппаНовыхКонтрагентовРозницы.Получить());
	ПараметрыНовогоКонтрагента.Вставить("Розница", Истина);
	ПараметрыНовогоКонтрагента.Вставить("Покупатель", Истина); 
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Лид") И ЗначениеЗаполнено(Объект.Основание) Тогда	
		РеквизитыЛида = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание, "ИмяКлиента, Город, Адрес");
		ПараметрыНовогоКонтрагента.Вставить("Наименование", 		 РеквизитыЛида.ИмяКлиента);
		ГородЛида = Строка(РеквизитыЛида.Город);
		АдресЛида = СтрШаблон("%1%2", ?(ПустаяСтрока(ГородЛида), "", ГородЛида + ", "), РеквизитыЛида.Адрес);
		ПараметрыНовогоКонтрагента.Вставить("ФактическийАдрес", 	 АдресЛида);
		ПараметрыНовогоКонтрагента.Вставить("ДополнительнаяКонтактнаяИнформация", ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.Основание.ДополнительнаяКонтактнаяИнформация.Выгрузить()));
	КонецЕсли;
	Возврат ПараметрыНовогоКонтрагента;
	
КонецФункции

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

&НаКлиенте
Процедура ЗадатьВопросОПересчетеЦен()

	Если Объект.ТоварыУслуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПересчетеЦен", ЭтотОбъект);	
	ПоказатьВопрос(ОписаниеОповещения, "Изменился вид цен или валюта документа. Пересчитать цены товаров и услуг?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПересчетеЦен(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьЦеныПоВидуЦен();
		ПересчитатьСуммуДокумента();
		ОбновитьЭлементыФормы();
		РазвернутьДеревоТоваров();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЦеныПоВидуЦен()
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого ТекущаяСтрока Из Дерево.Строки Цикл
		Для Каждого СтрСтрока Из ТекущаяСтрока.Строки Цикл
			СтрСтрока.Цена = ПолучитьЦенуНоменклатуры(СтрСтрока.Номенклатура, СтрСтрока.ХарактеристикаНоменклатуры, СтрСтрока.ЕдиницаИзмерения);
			СтрСтрока.ЦенаПоПрайсу = СтрСтрока.Цена;
			РассчитатьСуммуСтрокиНаСервере(СтрСтрока);
		КонецЦикла;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	ПеренестиДеревоВТабличнуюЧасть();
КонецФункции

&НаКлиенте
Процедура ВидСкидкиПриИзменении(Элемент)

	ВидСкидкиПриИзмененииНаСервере();
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ВидСкидкиПриИзмененииНаСервере()
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Для Каждого СтрНоменклатура из Строка.Строки Цикл
			СтрНоменклатура.ПроцентСкидки = ПолучитьПроцентВидаСкидки(Объект.ВидСкидки) + ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Объект.Дата, СтрНоменклатура.Номенклатура,СтрНоменклатура.Количество);
			РассчитатьСуммуСтрокиНаСервере(СтрНоменклатура);
		КонецЦикла;	
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	ПеренестиДеревоВТабличнуюЧасть();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСуммуДокумента(Команда)
	ОповещениеПослеВводаНовойСуммыДокумента = Новый ОписаниеОповещения("ПослеВводаНовойСуммыДокумента", ЭтаФорма);
	//ПоказатьВводЧисла(ОповещениеПослеВводаНовойСуммыДокумента, Объект.СуммаДокумента, "Введите новую сумму документа", 15, 2);
	ПараметрыФормыИзмененияСуммы = Новый Структура("СуммаДокумента", Объект.СуммаДокумента);
	ОткрытьФорму("ОбщаяФорма.ИзменениеСуммыДокумента", ПараметрыФормыИзмененияСуммы, ЭтаФорма, , , , ОповещениеПослеВводаНовойСуммыДокумента);
КонецПроцедуры

//&НаКлиенте
//Процедура ПослеВводаНовойСуммыДокумента(НоваяСуммаДокумента, Параметры) Экспорт
//	Если НоваяСуммаДокумента = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если НоваяСуммаДокумента = Объект.СуммаДокумента Тогда
//		Возврат;
//	КонецЕсли;	
//	ТекущаяКомната = Неопределено;
//	ТекущаяНоменклатура = Неопределено;
//	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
//	Если НЕ ТекущиеДанные = Неопределено Тогда			
//		ТекущаяКомната 		= ТекущиеДанные.Комната;
//		ТекущаяНоменклатура = ТекущиеДанные.Номенклатура;
//	КонецЕсли;
//	ПослеВводаНовойСуммыДокументаНаСервере(НоваяСуммаДокумента);
//	ПеренестиДеревоВТабличнуюЧасть();
//	Состояние("Сумма документа изменена");
//	ОбновитьЭлементыФормы(ТекущаяКомната, ТекущаяНоменклатура);
//	РассчитатьИтоговыеПоказателиКлиент();
//КонецПроцедуры


&НаКлиенте
Процедура ПослеВводаНовойСуммыДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НоваяСуммаДокумента = Результат.НоваяСуммаДокумента; 
	СброситьРанееУстановленныеСкидки = Результат.СброситьРанееУстановленныеСкидки;
	ПрименятьСкидкуНаПотолки = Результат.ПрименятьСкидкуНаПотолки;	
	ПрименятьСкидкуНаТовары = Результат.ПрименятьСкидкуНаТовары;	
	ПрименятьСкидкуНаУслуги = Результат.ПрименятьСкидкуНаУслуги;	
	
	Если НоваяСуммаДокумента = Объект.СуммаДокумента Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущаяКомната = Неопределено;
	ТекущаяНоменклатура = Неопределено;
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда			
		ТекущаяКомната 		= ТекущиеДанные.Комната;
		ТекущаяНоменклатура = ТекущиеДанные.Номенклатура;
	КонецЕсли;
	
	ПослеВводаНовойСуммыДокументаНаСервере(НоваяСуммаДокумента, СброситьРанееУстановленныеСкидки, ПрименятьСкидкуНаПотолки, ПрименятьСкидкуНаТовары, ПрименятьСкидкуНаУслуги);
	ПеренестиДеревоВТабличнуюЧасть();
	Состояние("Сумма документа изменена");
	
	ОбновитьЭлементыФормы(ТекущаяКомната, ТекущаяНоменклатура);
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры




&НаСервере
//Процедура ПослеВводаНовойСуммыДокументаНаСервере(НоваяСуммаДокумента)
//	
//	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
//	
//	СтрокаСНаибольшейСуммой = Неопределено;
//	НаибольшаяСумма = 0;
//	СуммаДокументаПослеИзменения = 0;
//	
//	СуммаДокументаДоИзменения = Объект.СуммаДокумента;
//	Разница = СуммаДокументаДоИзменения - НоваяСуммаДокумента;
//	Если НЕ СуммаДокументаДоИзменения = 0 Тогда 
//		КоэффициентИзменения = Разница / СуммаДокументаДоИзменения;
//		Для Каждого ТекущаяКомната Из Дерево.Строки Цикл
//			Для Каждого ТекущийТовар Из ТекущаяКомната.Строки Цикл
//				Если ТекущийТовар.Сумма >= НаибольшаяСумма Тогда
//					НаибольшаяСумма = ТекущийТовар.Сумма;
//					СтрокаСНаибольшейСуммой = ТекущийТовар;
//				КонецЕсли;
//				ТекущийТовар.ПроцентСкидки = ТекущийТовар.ПроцентСкидки + (КоэффициентИзменения*100);
//				РассчитатьСуммуСтрокиНаСервере(ТекущийТовар);
//				СуммаДокументаПослеИзменения = СуммаДокументаПослеИзменения + ТекущийТовар.Сумма;
//			КонецЦикла;
//		КонецЦикла;
//		
//		//пересчитаем строку с наибольшей суммой, если после пересчета по строкам итог не сошелся с желаемым
//		Если НЕ СуммаДокументаПослеИзменения = НоваяСуммаДокумента Тогда
//			Если НЕ СтрокаСНаибольшейСуммой = Неопределено Тогда
//				Разница = НоваяСуммаДокумента - СуммаДокументаПослеИзменения;
//				СтрокаСНаибольшейСуммой.Сумма = СтрокаСНаибольшейСуммой.Сумма + Разница;
//				//СуммаБезРучнойСкидки = СтрокаСНаибольшейСуммой.Цена * СтрокаСНаибольшейСуммой.Количество - (СтрокаСНаибольшейСуммой.Цена * СтрокаСНаибольшейСуммой.Количество * (СтрокаСНаибольшейСуммой.ПроцентАвтоматическойСкидки/100));
//				СуммаБезРучнойСкидки = СтрокаСНаибольшейСуммой.Цена * СтрокаСНаибольшейСуммой.Количество;
//				Если НЕ СуммаБезРучнойСкидки = 0 Тогда
//					СтрокаСНаибольшейСуммой.ПроцентСкидки = 100 - (СтрокаСНаибольшейСуммой.Сумма / СуммаБезРучнойСкидки)*100;
//					СтрокаСНаибольшейСуммой.СуммаСкидки = СуммаБезРучнойСкидки * СтрокаСНаибольшейСуммой.ПроцентСкидки / 100;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//		
//		ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
//		Модифицированность = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ПослеВводаНовойСуммыДокументаНаСервере(НоваяСуммаДокумента, СброситьСкидки, СкидкаПотолки, СкидкаТовары, СкидкаУслуги)
	
	Если СброситьСкидки Тогда
		Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
		
		СтрокаСНаибольшейСуммой = Неопределено;
		НаибольшаяСумма = 0;
		СуммаДокументаПослеИзменения = 0;
		
		//сначала переопределим скидку по шапке документа
		СуммаДокумента = 0;
		СуммаДокументаПоСкидочнымПозициям = 0;
		
		Для Каждого Строка из Дерево.Строки Цикл
			Для Каждого СтрНоменклатура из Строка.Строки Цикл
				СтрНоменклатура.ПроцентСкидки = ПолучитьПроцентВидаСкидки(Объект.ВидСкидки);
				РассчитатьСуммуСтрокиНаСервере(СтрНоменклатура);
				//РассчитатьСуммуНДСТабЧастиНаСервере(СтрНоменклатура);
				ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрНоменклатура, УчитыватьНДС);
				
				СуммаДокумента = СуммаДокумента + СтрНоменклатура.Сумма;
				
				Если (СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок"))
					ИЛИ (СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"))
					ИЛИ (СкидкаТовары И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"))	
					ИЛИ (СкидкаУслуги И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга")) Тогда
					СуммаДокументаПоСкидочнымПозициям = СуммаДокументаПоСкидочнымПозициям + СтрНоменклатура.Сумма;
				КонецЕсли;
								
			КонецЦикла;	
		КонецЦикла;
		
		СуммаДокументаДоИзменения = СуммаДокумента;
		Разница = СуммаДокументаДоИзменения - НоваяСуммаДокумента;
		
		Если СуммаДокументаПоСкидочнымПозициям = 0 Тогда
			Сообщить("В данном документе отсутствуют позиции выбранного вида. Изменение суммы документа отменено");
			Возврат;
		КонецЕсли;	
		
		Если СуммаДокументаПоСкидочнымПозициям < Разница Тогда
			Сообщить("Объем скидки больше суммы товаров и услуг по выбранным категориям");
			СуммаДокументаПоСкидочнымПозициям = 0;
		КонецЕсли;	
		
		//изменим скидки
		Если НЕ СуммаДокументаПоСкидочнымПозициям = 0 Тогда 
			КоэффициентИзменения = Разница / СуммаДокументаПоСкидочнымПозициям;
			Для Каждого ТекущаяКомната Из Дерево.Строки Цикл
				Для Каждого ТекущийТовар Из ТекущаяКомната.Строки Цикл
					
					Если (СкидкаПотолки И ТекущийТовар.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок"))
					 ИЛИ (СкидкаПотолки И ТекущийТовар.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"))	
					 ИЛИ (СкидкаТовары И ТекущийТовар.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"))	
					 ИЛИ (СкидкаУслуги И ТекущийТовар.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга")) Тогда
						Если ТекущийТовар.Сумма >= НаибольшаяСумма Тогда
							НаибольшаяСумма = ТекущийТовар.Сумма;
							СтрокаСНаибольшейСуммой = ТекущийТовар;
						КонецЕсли;
						ТекущийТовар.ПроцентСкидки = ТекущийТовар.ПроцентСкидки + (КоэффициентИзменения*100);
						РассчитатьСуммуСтрокиНаСервере(ТекущийТовар);
						//РассчитатьСуммуНДСТабЧастиНаСервере(ТекущийТовар);
						ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущийТовар, УчитыватьНДС);
						СуммаДокументаПослеИзменения = СуммаДокументаПослеИзменения + ТекущийТовар.Сумма;
					Иначе
						РассчитатьСуммуСтрокиНаСервере(ТекущийТовар);
						ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущийТовар, УчитыватьНДС);
						СуммаДокументаПослеИзменения = СуммаДокументаПослеИзменения + ТекущийТовар.Сумма;
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
			
			//пересчитаем строку с наибольшей суммой, если после пересчета по строкам итог не сошелся с желаемым
			Если НЕ СуммаДокументаПослеИзменения = НоваяСуммаДокумента Тогда
				Если НЕ СтрокаСНаибольшейСуммой = Неопределено Тогда
					Разница = НоваяСуммаДокумента - СуммаДокументаПослеИзменения;
					СтрокаСНаибольшейСуммой.Сумма = СтрокаСНаибольшейСуммой.Сумма + Разница;
					//СуммаБезРучнойСкидки = СтрокаСНаибольшейСуммой.Цена * СтрокаСНаибольшейСуммой.Количество - (СтрокаСНаибольшейСуммой.Цена * СтрокаСНаибольшейСуммой.Количество * (СтрокаСНаибольшейСуммой.ПроцентАвтоматическойСкидки/100));
					СуммаБезРучнойСкидки = СтрокаСНаибольшейСуммой.Цена * СтрокаСНаибольшейСуммой.Количество;
					Если НЕ СуммаБезРучнойСкидки = 0 Тогда
						СтрокаСНаибольшейСуммой.ПроцентСкидки = 100 - (СтрокаСНаибольшейСуммой.Сумма / СуммаБезРучнойСкидки)*100;
						СтрокаСНаибольшейСуммой.СуммаСкидки = СуммаБезРучнойСкидки * СтрокаСНаибольшейСуммой.ПроцентСкидки / 100;
					КонецЕсли;
					//РассчитатьСуммуНДСТабЧастиНаСервере(СтрокаСНаибольшейСуммой);
					ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаСНаибольшейСуммой, УчитыватьНДС);
				КонецЕсли;
			КонецЕсли;
			
			ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
			Модифицированность = Истина;
		КонецЕсли;
		
	Иначе
		//#5374
		Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
				
		//определим сумму строк, участвующих в пересчете
		// Скидку 100% и выше не увеличивать.
		СуммаДокументаПоСкидочнымПозициям = 0;
		СуммаКРаспределению = НоваяСуммаДокумента; // в этой переменной учтем новую сумму документа с учетом строк, не участвующих в изменении
		СуммаДокумента = 0;
		КоличествоИзменяемыхСтрок = 0 ;
		КоличествоИзменяемыхСтрокПоКатегориям = 0 ;
		Для Каждого Строка из Дерево.Строки Цикл
			Для Каждого СтрНоменклатура из Строка.Строки Цикл
				
				Если СтрНоменклатура.ПроцентСкидки >= 100 ИЛИ НЕ ((СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок"))
					ИЛИ (СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"))
					ИЛИ (СкидкаТовары И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"))	
					ИЛИ (СкидкаУслуги И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга"))) Тогда
					СуммаКРаспределению  = СуммаКРаспределению - СтрНоменклатура.Сумма;
				Иначе
					КоличествоИзменяемыхСтрок = КоличествоИзменяемыхСтрок + 1;
				КонецЕсли;
				
				Если ((СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок"))
					ИЛИ (СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"))
					ИЛИ (СкидкаТовары И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"))	
					ИЛИ (СкидкаУслуги И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга"))) Тогда
					КоличествоИзменяемыхСтрокПоКатегориям = КоличествоИзменяемыхСтрокПоКатегориям + 1;
				КонецЕсли;
				
				СуммаДокумента = СуммаДокумента + СтрНоменклатура.Сумма;
				
			КонецЦикла;	
		КонецЦикла;
		СуммаПропорции = СуммаДокумента - (НоваяСуммаДокумента - СуммаКРаспределению); // сумма старых строк, участвующих в изменении
		Если КоличествоИзменяемыхСтрок = 0 Тогда
			Если КоличествоИзменяемыхСтрокПоКатегориям = 0 Тогда
				Сообщить("В данном документе отсутствуют позиции выбранного вида. Изменение суммы документа отменено");
			Иначе
				Сообщить("Во всех строках выбранных категорий указаны скидки более 100%, изменение не выполнено");
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		ПозицияИзменяемойСтроки = 1;
		КоэффициентИзменения = СуммаКРаспределению / СуммаПропорции;
		Для Каждого Строка из Дерево.Строки Цикл
			Для Каждого СтрНоменклатура из Строка.Строки Цикл
				
				Если СтрНоменклатура.ПроцентСкидки >= 100 ИЛИ НЕ ((СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок"))
					ИЛИ (СкидкаПотолки И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"))
					ИЛИ (СкидкаТовары И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал"))	
					ИЛИ (СкидкаУслуги И СтрНоменклатура.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга"))) Тогда
						// ничего не делаем
					Иначе
						Если ПозицияИзменяемойСтроки = КоличествоИзменяемыхСтрок Тогда  // исправить ошибку в сумме распределения
							СтрНоменклатура.Сумма = СуммаКРаспределению;
						Иначе
							СтрНоменклатура.Сумма = СтрНоменклатура.Сумма * КоэффициентИзменения;
						КонецЕсли;
						СтрНоменклатура.СуммаСкидки = СтрНоменклатура.Цена * СтрНоменклатура.Количество - СтрНоменклатура.Сумма;
						ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(СтрНоменклатура, "ПроцентСкидки", "СуммаСкидки");
						ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрНоменклатура, УчитыватьНДС);
						ПозицияИзменяемойСтроки = ПозицияИзменяемойСтроки + 1;					
						СуммаКРаспределению = СуммаКРаспределению - СтрНоменклатура.Сумма;				
					КонецЕсли;
				
			КонецЦикла;	
		КонецЦикла;
		
		ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ПредварительныйРасчет(Команда)
	
	//++ №14357 открываем по предварительному расчету а не лиду
	//ПараметрыОтчета = Новый Структура;
	//ПараметрыОтчета.Вставить("ЗаказДоговор", Объект.Основание);
	//ОткрытьФорму("Отчет.ПредварительнаяСебестоимостьЗаказДоговора.ФормаОбъекта", ПараметрыОтчета);
	
	Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ОписаниеОповещения = новый ОписаниеОповещения("ОткрытьОтчетПредварительныйРасчетФрагмент", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Для продолжения документ следует записать. 
			|Записать документ?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОткрытьОтчетПредварительныйРасчетЗавершение();
		
	КонецЕсли;
	//-- №14357
	
КонецПроцедуры

//++ №14357
&НаКлиенте
Процедура ОткрытьОтчетПредварительныйРасчетФрагмент(Результат, ДопПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;	
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если Записать(новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись)) Тогда
		ОткрытьОтчетПредварительныйРасчетЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПредварительныйРасчетЗавершение()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ЗаказДоговор", Объект.Ссылка);
	
	ОткрытьФорму("Отчет.ПредварительнаяСебестоимостьЗаказДоговора.ФормаОбъекта", ПараметрыОтчета);
	
КонецПроцедуры
//-- №14357

&НаСервере
Функция ПолучитьСкладТоваровПользователяПоУмолчанию()
	Возврат ОбщийМодульСервер.НастройкаПользователя("СкладРозница");
КонецФункции

&НаСервере
Процедура ПеренестиДеревоВТабличнуюЧасть()
	
	//ТОВАРЫ И УСЛУГИ
	СуммаДокумента = 0;
	Объект.ТоварыУслуги.Очистить();
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Для Каждого СтрНоменклатура из Строка.Строки Цикл
			Если НЕ СтрНоменклатура.Номенклатура.Пустая() Тогда
				Стр = Объект.ТоварыУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(Стр, СтрНоменклатура);
				СуммаДокумента = СуммаДокумента + СтрНоменклатура.Сумма;
				Стр.СуммаПоПрайсу = Стр.ЦенаПоПрайсу * Стр.Количество;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Объект.СуммаДокумента = СуммаДокумента;
	
	ПересчитатьСуммуДокументаНаСервере();
	
	КомнатыТоваров = Объект.ТоварыУслуги.Выгрузить(); //нужна для отслеживания удаленных комнат в товарах
	КомнатыТоваров.Свернуть("Комната");
	
	//МАТЕРИАЛЫ
	Объект.Материалы.Очистить();
	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		НайденнаяКомната = КомнатыТоваров.Найти(Строка.Комната, "Комната");
		Если НЕ НайденнаяКомната = Неопределено Тогда //переносим данные только по тем комнатам, что есть в товарах
			Стр = Объект.Материалы.Добавить();
			Стр.Комната = Строка.Комната;
			Для Каждого СтрНоменклатура из Строка.Строки Цикл
				Если НЕ СтрНоменклатура.Номенклатура.Пустая() Тогда
					Стр = Объект.Материалы.Добавить();
					ЗаполнитьЗначенияСвойств(Стр, СтрНоменклатура);
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПерестроитьДеревоНаФорме()
	
	//ТОВАРЫ И УСЛУГИ
	//ключ строки дерева: комната
	//Объект.ТоварыУслуги.Сортировать("Комната Возр");
	Комната = Неопределено;
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
	Для Каждого Стр из Объект.ТоварыУслуги Цикл
		Если Стр.Комната <> Комната Тогда
			СтрДерево = Дерево.Строки.Добавить();
			СтрДерево.Комната = Стр.Комната;
			Комната = Стр.Комната;
		КонецЕсли;
		Если НЕ Стр.Номенклатура.Пустая() Тогда
			СтрДеревоВид = СтрДерево.Строки.Добавить();
			СтрДеревоВид.Уровень = 1;
			ЗаполнитьЗначенияСвойств(СтрДеревоВид, Стр);
			СтрДеревоВид.ВидНоменклатуры = Стр.Номенклатура.ВидНоменклатуры;
			СтрДеревоВид.УчитыватьКакПотолок = Стр.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности; // №14690
			Если ПустаяСтрока(Стр.УИСтроки) Тогда
				//по какой-то причине УИ пустой - заполним
				Стр.УИСтроки = Новый УникальныйИдентификатор;
				СтрДерево.УИСтроки = Стр.УИСтроки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	
	//МАТЕРИАЛЫ
	Комната = "";
	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
	Для Каждого Стр из Объект.Материалы Цикл
		Если Стр.Комната <> Комната Тогда
			СтрДерево = Дерево.Строки.Добавить();
			СтрДерево.Комната = Стр.Комната;
			Комната = Стр.Комната;
		КонецЕсли;
		Если НЕ Стр.Номенклатура.Пустая() Тогда
			СтрДеревоВид = СтрДерево.Строки.Добавить();
			СтрДеревоВид.Уровень = 1;
			ЗаполнитьЗначенияСвойств(СтрДеревоВид, Стр);
			Если ПустаяСтрока(Стр.УИСтроки) Тогда
				//по какой-то причине УИ пустой - заполним
				Стр.УИСтроки = Новый УникальныйИдентификатор;
				СтрДерево.УИСтроки = Стр.УИСтроки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоМатериалов);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуДокументаНаСервере()
	Объект.СуммаДокумента = Объект.ТоварыУслуги.Итог("Сумма");
	Объект.СуммаДокументаПоПрайсу = Объект.ТоварыУслуги.Итог("СуммаПоПрайсу");
	
	ОбновитьДопИнформацию();
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьДопИнформацию()
	
	ДопИнфоПлощадьЗаказа = Документы.ЗаказДоговор.РассчитатьПлощадьПотолков(Объект.ТоварыУслуги);
	ДопИнфоСтоимостьКВМ  = ?(ДопИнфоПлощадьЗаказа = 0, 0, Объект.СуммаДокумента / ДопИнфоПлощадьЗаказа);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоТоваров(Комната = Неопределено, Номенклатура = Неопределено)
	ИдТекущейСтроки = Неопределено;
	КоллекцияЭлементовДерева = ЭтаФорма.ДеревоТоваров.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Для Каждого СтрокаВКомнате Из Строка.ПолучитьЭлементы() Цикл
			Если СтрокаВКомнате.Комната = Комната И СтрокаВКомнате.Номенклатура = Номенклатура Тогда
				ИдТекущейСтроки = СтрокаВКомнате.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЦикла;
		// для случаев добавления новой комнаты / переименования
		Если Строка.Комната = Комната И (Строка.ПолучитьЭлементы().Количество() = 0 ИЛИ Номенклатура = Неопределено) Тогда
			ИдТекущейСтроки = ИдентификаторСтроки;			
		КонецЕсли;
		Элементы.ДеревоТоваров.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
	Элементы.ДеревоТоваров.ТекущаяСтрока = ИдТекущейСтроки;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры = Неопределено, ЕдиницаИзмерения = Неопределено, Количество = 1)
												
	Возврат ЦеныКомпании.ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество,
												Объект.Дата, Объект.ВидЦен, Объект.Валюта, 												 
												Объект.Организация, Объект.Подразделение, 
												Объект.Контрагент, Объект.Контрагент.ОсновнойДоговор);											
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПроцентВидаСкидки(ВидСкидки)
	Если ВидСкидки.Пустая() Тогда
		Возврат 0;
	Иначе
		Возврат ВидСкидки.Процент;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура РассчитатьСуммуСтрокиНаСервере(ТекущаяСтрока = Неопределено)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = Элементы.ТоварыУслуги.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущаяСтрока.ПроцентСкидки = 100 Тогда
		ТекущаяСтрока.Сумма = 0;
		ТекущаяСтрока.СуммаСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	Иначе
		Если НЕ ТекущаяСтрока.ПроцентСкидки = 0 Тогда
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * (1 - ТекущаяСтрока.ПроцентСкидки / 100);
			ТекущаяСтрока.СуммаСкидки = (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена) - ТекущаяСтрока.Сумма;
		Иначе
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			ТекущаяСтрока.СуммаСкидки = 0;
		КонецЕсли;
	КонецЕсли;
	ТекущаяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	ТекущаяСтрока.СуммаПоПрайсу = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаПоПрайсу;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуДерева(Дерево, Комната, Номенклатура)
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Для Каждого ТекЭлемент из ЭлементыДерева Цикл
		ПодчиненныеСтроки = ТекЭлемент.ПолучитьЭлементы();
		Для Каждого ПодчиненыйЭлемент Из ПодчиненныеСтроки Цикл
			Если СокрЛП(ПодчиненыйЭлемент.Комната) = СокрЛП(Комната)
				и ПодчиненыйЭлемент.Номенклатура = Номенклатура Тогда
				Возврат ПодчиненыйЭлемент;
			КонецеСли;
		КонецЦикла;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ДобавитьКомнату(Команда)
	
	//Если ПереключательНаНазваниеКомнат Тогда
	//	ПараметрыФормыВыбора = Новый Структура("ПодборВЗаказДоговор", Истина);
	//	// #10992 изменена схема наименования комнаты
	//	//ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКомнаты", ЭтотОбъект);
	//	//ОткрытьФорму("Справочник.НазваниеКомнат.ФормаВыбора", ПараметрыФормыВыбора, , , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//	ОткрытьФорму("Справочник.НазваниеКомнат.ФормаВыбора", ПараметрыФормыВыбора, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Иначе
	//	ДобавитьКомнатуЗавершение(Неопределено);
	//КонецЕсли;
	
	ПараметрыДобавления = Новый Структура;
	ПараметрыДобавления.Вставить("Форма", ЭтаФорма);
	ПараметрыДобавления.Вставить("ПереключательНаНазваниеКомнат", ПереключательНаНазваниеКомнат);
	ОбщийМодульКлиент.Розница_ДобавитьКомнату(ПараметрыДобавления);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ДобавитьКомнатуЗавершение(ДанныеВыборкаКомнаты)
//	
//	//добавим комнату в товары
//	ИмяНовойКомнаты = "";
//	Если ДанныеВыборкаКомнаты = Неопределено Тогда
//		// простое добавление комнаты с номером
//		ИмяНовойКомнаты = ПолучитьНаименованиеНовойКомнаты(Неопределено);
//	Иначе
//		// добавление из справочника		
//		ИмяНовойКомнаты = СокрЛП(ДанныеВыборкаКомнаты.Комната);
//		Если НЕ ДанныеВыборкаКомнаты.НеДобавлятьПрефиксКомнаты Тогда
//			// с префиксом "Комната Х ..."
//			ИмяНовойКомнаты = ПолучитьНаименованиеНовойКомнаты(ДанныеВыборкаКомнаты.Комната);
//		КонецЕсли;
//	КонецЕсли;
//	
//	КомнатыТоваров = ДеревоТоваров.ПолучитьЭлементы();
//	Для каждого КомнатаТовара из КомнатыТоваров Цикл
//		Если КомнатаТовара.Комната = ИмяНовойКомнаты Тогда
//			ТекстСообщения = "Комната с наименованием """ + ИмяНовойКомнаты + """ уже имеется в заказе";
//			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
//			ПоказатьПредупреждение(, ТекстСообщения);
//			Возврат;
//		КонецЕсли;
//	КонецЦикла;
//	
//	НоваяСтрокаТовары = ДеревоТоваров.ПолучитьЭлементы().Добавить();
//	НоваяСтрокаТовары.Комната = ИмяНовойКомнаты;
//	Элементы.ДеревоТоваров.ТекущаяСтрока = НоваяСтрокаТовары.ПолучитьИдентификатор();

//	//добавим комнату в материалах
//	НоваяСтрокаМатериалы = ДеревоМатериалов.ПолучитьЭлементы().Добавить();
//	НоваяСтрокаМатериалы.Комната = ИмяНовойКомнаты;
//	
//	//РассчитатьИтоговыеПоказателиКлиент();

//КонецПроцедуры

//&НаСервере
//Функция ПолучитьНаименованиеНовойКомнаты(НазваниеКомнаты)
//	
//	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
//	
//	ТаблицаНомеров = Новый ТаблицаЗначений;
//	ТаблицаНомеров.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число"));	
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//				"ВЫБРАТЬ
//				|	НазваниеКомнат.Наименование КАК НазКомнаты
//				|ИЗ
//				|	Справочник.НазваниеКомнат КАК НазваниеКомнат";
//			
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Для Каждого ТекущаяСтрока Из Дерево.Строки Цикл
//		НоваяСтрока = ТаблицаНомеров.Добавить();
//		Попытка
//			СтрокаЗамены =  СтрЗаменить(ТекущаяСтрока.Комната, "Комната ", "");
//			Выборка.Сбросить();
//			Пока Выборка.Следующий() Цикл
//				Если Найти(СтрокаЗамены, Выборка.НазКомнаты) Тогда
//					СтрокаЗамены = СтрЗаменить(СтрокаЗамены, Выборка.НазКомнаты, "");
//					СтрокаЗамены = СтрЗаменить(СтрокаЗамены, " ", "");
//				КонецЕсли;
//			 КонецЦикла;
//			 
//			 НоваяСтрока.Номер = Число(СтрокаЗамены);
//			
//			//НоваяСтрока.Номер = Число(СтрЗаменить(ТекущаяСтрока.Комната, "Комната ", ""));
//		Исключение
//		КонецПопытки;
//	КонецЦикла;
//	
//	ТаблицаНомеров.Свернуть("Номер");
//	ТаблицаНомеров.Сортировать("Номер Убыв");
//	
//	Если НЕ НазваниеКомнаты = Неопределено Тогда
//		Если ТаблицаНомеров.Количество() > 0 Тогда
//			Возврат "Комната " + СтрЗаменить(Строка(ТаблицаНомеров[0].Номер+1), Символ(160), "") + " " + НазваниеКомнаты;
//		Иначе
//			Возврат "Комната 1" + " " + НазваниеКомнаты;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Если НазваниеКомнаты = Неопределено  Тогда
//		Если ТаблицаНомеров.Количество() > 0 Тогда
//			Возврат "Комната " + СтрЗаменить(Строка(ТаблицаНомеров[0].Номер+1), Символ(160), "");
//		Иначе
//			Возврат "Комната 1";
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецФункции

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если НЕ ОбщийМодульКлиент.Розница_КомнатаЗаполнена(ТекущиеДанные) Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	СтрокаКомнаты = ТекущиеДанные;
	Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда	
		СтрокаКомнаты = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	ИдКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораНоменклатуры", ЭтотОбъект, ИдКомнаты); //ТекущиеДанные.Комната
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНоменклатуры(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		//ДобавитьНоменклатуруВДеревоНаСервере(ВыбЗнач, ДополнительныеПараметры.Комната, ДополнительныеПараметры.Количество);
		//ИмяКомнаты = ДополнительныеПараметры.Комната;
		ВозвращеннаяСтрока = ДобавитьНоменклатуруВДеревоТоваровКлиент(ВыбранноеЗначение.Номенклатура, , ВыбранноеЗначение.Количество, ВыбранноеЗначение.УИСтроки, ДополнительныеПараметры);
		ДобавленнаяСтрока = ВозвращеннаяСтрока.Строка;
	Иначе
		// ДополнительныеПараметры = Имя комнаты
		//ДобавитьНоменклатуруВДеревоНаСервере(ВыбЗнач, ДополнительныеПараметры);
		//ИмяКомнаты = ДополнительныеПараметры;
		ВозвращеннаяСтрока = ДобавитьНоменклатуруВДеревоТоваровКлиент(ВыбранноеЗначение, , , , ДополнительныеПараметры);
		ДобавленнаяСтрока = ВозвращеннаяСтрока.Строка;
	КонецЕсли;
	
	//++ #16036
	Если НЕ ДобавленнаяСтрока = Неопределено
		И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги
		И ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(ДобавленнаяСтрока.Номенклатура, ДобавленнаяСтрока.ХарактеристикаНоменклатуры) Тогда
		Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриДобавленииНоменклатуры Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Номенклатура", ДобавленнаяСтрока.Номенклатура); 
			ДопПараметры.Вставить("ХарактеристикаНоменклатуры", ДобавленнаяСтрока.ХарактеристикаНоменклатуры); 
			ДопПараметры.Вставить("УИСтроки", ДобавленнаяСтрока.УИСтроки); 
			ДопПараметры.Вставить("Количество", ДобавленнаяСтрока.Количество); 
			ДопПараметры.Вставить("ИДКомнаты", ДополнительныеПараметры);
			ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Добавить сопутствующие товары и услуги для" + Символы.ПС + "номенклатуры: """ + ДобавленнаяСтрока.Номенклатура + """?", РежимДиалогаВопрос.ДаНет);
		Иначе
			//ИДКомнаты = ДополнительныеПараметры;
			//МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(ДобавленнаяСтрока.Номенклатура, ДобавленнаяСтрока.ХарактеристикаНоменклатуры, ДобавленнаяСтрока.УИСтроки, 	ДобавленнаяСтрока.Количество, ИДКомнаты, 0);
			ПодборСопутствующейНоменклатуры(ДополнительныеПараметры);
			РассчитатьИтоговыеПоказателиКлиент();	
		КонецЕсли;
	КонецЕсли;	
	//-- #16036
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросДобавлениеСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	ПодборСопутствующейНоменклатуры(ДополнительныеПараметры.ИДКомнаты);

	//ДобавитьСопутствующуюНоменклатуру(ДополнительныеПараметры.Номенклатура, ДополнительныеПараметры.ХарактеристикаНоменклатуры, ДополнительныеПараметры.УИСтроки,  ДополнительныеПараметры.Количество, ДополнительныеПараметры.ИДКомнаты, 0);
		
КонецПроцедуры

&НаКлиенте
Функция ДобавитьСопутствующуюНоменклатуру(Номенклатура, Характеристика = Неопределено, УИСтрокиРодителя, Количество = 1, ИДкомнаты, Уровень, МассивДобавленнойСП = Неопределено)
		Если МассивДобавленнойСП = Неопределено Тогда
		МассивДобавленнойСП = Новый Массив;
	КонецЕсли;	
	Если Уровень < СтруктураДействийПоСТ.ДопустимаяГлубинаВложенностиСопутствующихТоваров Тогда
		МассивЗаписей = ОбщийМодульВызовСервера.ПолучитьСписокСопутствующихТоваров(Номенклатура, Характеристика, Количество);
		Если МассивЗаписей.Количество() > 0 Тогда
			Для Каждого Запись из МассивЗаписей Цикл
				ВозвращеннаяСтрока = ДобавитьНоменклатуруВДеревоТоваровКлиент(Запись.Номенклатура, Запись.Характеристика, Запись.Количество, УИСтрокиРодителя, ИДкомнаты);
				Если ВозвращеннаяСтрока.Новая  Тогда
					ДобавленнаяСтрока = ВозвращеннаяСтрока.Строка;
					МассивДобавленнойСП.Добавить(ДобавленнаяСтрока);
					ДобавитьСопутствующуюНоменклатуру(ДобавленнаяСтрока.Номенклатура, ДобавленнаяСтрока.ХарактеристикаНоменклатуры, ДобавленнаяСтрока.УИСтроки, ДобавленнаяСтрока.Количество, ИДкомнаты, Уровень+1, МассивДобавленнойСП);
				Иначе
					СуществующаяСтрока = ВозвращеннаяСтрока.Строка;
					ДобавитьСопутствующуюНоменклатуру(СуществующаяСтрока.Номенклатура, СуществующаяСтрока.ХарактеристикаНоменклатуры, СуществующаяСтрока.УИСТроки, СуществующаяСтрока.Количество, ИДкомнаты, Уровень+1, МассивДобавленнойСП);
				КонецЕсли;		
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	Возврат МассивДобавленнойСП;
КонецФункции

//#16036
&НаСервереБезКонтекста
Функция ПолучитьСписокСопутствующихТоваров(Родитель, Характеристика = Неопределено, Количество)
	
	НаборЗаписей = РегистрыСведений.СопутствующиеТоварыИУслуги.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Родитель, Истина);
	НаборЗаписей.Отбор.Характеристика.Установить(Характеристика, Истина);
	НаборЗаписей.Прочитать();
	МассивЗаписей = Новый Массив;	
	
	Для Каждого Запись из НаборЗаписей Цикл
		
		СтруктураЗаписи =  Новый Структура;
		СтруктураЗаписи.Вставить("Номенклатура", Запись.СопутствующийТовар);
		СтруктураЗаписи.Вставить("Характеристика", Запись.ХарактеристикаСопутствующегоТовара);
		Если Запись.ФиксированноеКоличество Тогда
			СтруктураЗаписи.Вставить("Количество", Запись.Количество);
		ИначеЕсли Запись.ПорядокОкругленияЧислом > 0 Тогда
			//Округляем до точности указанной в "ПорядокОкругленияЧислом" 
			РасчетноеКоличество = Запись.Количество * Количество;
			КратПоПорядкуОкругления = Окр(РасчетноеКоличество/Запись.ПорядокОкругленияЧислом, 0);
			ОкругленноеКоличество = КратПоПорядкуОкругления * Запись.ПорядокОкругленияЧислом;
			Остаток = РасчетноеКоличество - ОкругленноеКоличество;
			Если Остаток > 0 И (Остаток > Запись.ПорядокОкругленияЧислом/2 ИЛИ Запись.ОкруглятьВБольшуюСторону) Тогда
				ОкругленноеКоличество = ОкругленноеКоличество + Запись.ПорядокОкругленияЧислом;
			КонецЕсли;	
			СтруктураЗаписи.Вставить("Количество", ОкругленноеКоличество);
		Иначе
			СтруктураЗаписи.Вставить("Количество", Запись.Количество * Количество);
		КонецЕсли;
		МассивЗаписей.Добавить(СтруктураЗаписи);
		
	КонецЦикла;	
	
	Возврат МассивЗаписей;
	
КонецФункции

//#16036
&НаСервереБезКонтекста
Функция ЕстьСопутствующаяНоменклатураВРегистре(Номенклатура, Характеристика)
	
    НаборЗаписей = РегистрыСведений.СопутствующиеТоварыИУслуги.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура, Истина);
	НаборЗаписей.Отбор.Характеристика.Установить(Характеристика, Истина);
	НаборЗаписей.Прочитать();
	Возврат НаборЗаписей.Количество() > 0;
	
КонецФункции	

&НаКлиенте
Функция ДобавитьНоменклатуруВДеревоТоваровКлиент(Номенклатура, Характеристика = Неопределено, Количество=1, УИСтрокиРодителя, ИдКомнаты)
	
	ВозвращаемСтроку = Новый Структура;
	СтрокаКомнаты = ДеревоТоваров.НайтиПоИдентификатору(ИдКомнаты);	
	СтрокиНоменклатуры = СтрокаКомнаты.ПолучитьЭлементы();
	
	// Проверяе наличие сопуствующей номенклатуры в дереве чтобы не добавить дубликат или чтобц не затереть параметры номенклатуры в дереве
	Для каждого Строка	Из СтрокиНоменклатуры Цикл 
		Если Строка.Номенклатура = Номенклатура И Строка.ХарактеристикаНоменклатуры = Характеристика И Строка.УИСтрокиРодителя = УИСтрокиРодителя Тогда
			ВозвращаемСтроку.Вставить("Строка", Строка);
			ВозвращаемСтроку.Вставить("Новая", Ложь);
			Возврат ВозвращаемСтроку;
		КонецЕсли;	
	КонецЦикла;
	
	СтрокаТабличнойЧасти = СтрокиНоменклатуры.Добавить();
	СтрокаТабличнойЧасти.Уровень = 1;
	СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
	СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Характеристика;
	СтрокаТабличнойЧасти.УИСтрокиРодителя = УИСтрокиРодителя;
	СтрокаТабличнойЧасти.Комната = СтрокаКомнаты.Комната;
	
	СтрокаТабличнойЧасти.Количество = Количество;
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, Количество, ВидНоменклатуры, Спецификация, УчитыватьКакПотолок");
	
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена, ЦенаПоПрайсу, ПроцентСкидки, Количество"); //#16345 добавлено Количество 
	
	//++ №13814
	Если ТипЗнч(ИдКомнаты) = Тип("Структура") И ИдКомнаты.Свойство("УИСтроки") Тогда
		СтрокаТабличнойЧасти.УИСтроки = ИдКомнаты.УИСтроки;
	//-- №13814
	Иначе
		СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
		
	РассчитатьСуммуСтроки(СтрокаТабличнойЧасти);
	
	Элементы.ДеревоТоваров.ТекущаяСтрока = СтрокаТабличнойЧасти.ПолучитьИдентификатор();
	
	ВозвращаемСтроку.Вставить("Строка", СтрокаТабличнойЧасти);
	ВозвращаемСтроку.Вставить("Новая", Истина);
	Возврат ВозвращаемСтроку;
	
КонецФункции

//&НаСервере
//Процедура ПослеВыбораНоменклатурыНаСервере(ВыбЗнач, ДопПараметры)
//	
//	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
//	Для Каждого Строка из Дерево.Строки Цикл
//		Если Строка.Комната = ДопПараметры Тогда
//			СтрокаТабличнойЧасти = Строка.Строки.Добавить();
//			СтрокаТабличнойЧасти.Номенклатура = ВыбЗнач;
//			СтрокаТабличнойЧасти.Комната = ДопПараметры;
//			
//			СтруктураДанные = Новый Структура("Номенклатура, ВидСпецификации", СтрокаТабличнойЧасти.Номенклатура, ВидСпецификацииПоУмолчанию);
//			СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
//			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, ВидНоменклатуры, Спецификация");
//			
//			//СтрокаТабличнойЧасти.ВидНоменклатуры = СтрокаТабличнойЧасти.Номенклатура.ВидНоменклатуры;
//			//СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
//			//СтрокаТабличнойЧасти.Коэффициент = 1;
//			//Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(Стр.Номенклатура) Тогда // #12667 спецификация только для услуг, в рамках той же заявки отменено
//			//СтрокаТабличнойЧасти.Спецификация = ОбщийМодульСервер.ПолучитьОсновнуюСпецификациюНоменклатуры(Стр.Номенклатура, ВидСпецификацииПоУмолчанию);
//			//КонецЕсли;
//			СтрокаТабличнойЧасти.Количество = 1;
//			СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
//			СтрокаТабличнойЧасти.ПроцентСкидки = ПолучитьПроцентВидаСкидки(Объект.ВидСкидки) + ПолучитьПроцентАвтоматическойСкидкиСервер(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Количество);
//			СтрокаТабличнойЧасти.ЦенаПоПрайсу = СтрокаТабличнойЧасти.Цена;
//			СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
//			РассчитатьСуммуСтрокиНаСервере(СтрокаТабличнойЧасти);
//			
//			ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
//			Возврат;
//		КонецЕсли
//	КонецЦикла;	
//	
//КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУстановкуПотолка(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если НЕ ОбщийМодульКлиент.Розница_КомнатаЗаполнена(ТекущиеДанные) Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	СтрокаКомнаты = ТекущиеДанные;
	Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда	
		СтрокаКомнаты = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	ИдКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораНоменклатуры", ЭтотОбъект, ИдКомнаты);
	ОткрытьФорму("Справочник.ЦветФактуры.Форма.ФормаВыбораУстановкиПотолка",,,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПотолок(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	
	Если НЕ ОбщийМодульКлиент.Розница_КомнатаЗаполнена(ТекущиеДанные) Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	//++16164
	//НаименованиеПотолкаПоНомеруДоговора = НаименованиеПотолкаСодержитНомерДоговора();
	//КоличествоПотолковВДокументе = 0;
	//Если НаименованиеПотолкаПоНомеруДоговора Тогда
	//	Если ПустаяСтрока(Объект.Номер) Тогда
	//		ПоказатьПредупреждение(,"Не заполнен номер документа. Вам следует сначала записать документ");
	//		Возврат;
	//	Иначе
	//		КоличествоПотолковВДокументе = ПолучитьКоличествоПотолковВДокументе();
	//	КонецЕсли;
	//КонецЕсли;
	//
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("ПоНомеруДоговора", НаименованиеПотолкаПоНомеруДоговора);
	//СтруктураПараметров.Вставить("НомерДоговора", "л" + Объект.Номер);
	//СтруктураПараметров.Вставить("КоличествоПотолковВДокументе", КоличествоПотолковВДокументе);
	//--16164
	
	//++ №12147 комментируем, т.к. форма другая + убираем модальное открытие
	//СтруктураОтвета = ОткрытьФормуМодально("Документ.Лид.Форма.ФормаДобавленияПродукции",СтруктураПараметров,ЭтаФорма);
	//Если НЕ СтруктураОтвета = Неопределено Тогда
	//	
	//	ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
	//	ДобавленнаяНоменклатура = ДобавитьПотолокНаСервере(Элементы.ДеревоТоваров.ТекущиеДанные.Комната, СтруктураОтвета.Номенклатура, СтруктураОтвета.НомерПотолка, СтруктураОтвета.Фактура, СтруктураОтвета.Цвет);
	//	ПеренестиДеревоВТабличнуюЧасть();
	//	РазвернутьДеревоТоваров(ТекущаяКомната, ДобавленнаяНоменклатура);
	//	ДобавленнаяСтрока = НайтиСтрокуДерева(ДеревоТоваров, ТекущаяКомната, ДобавленнаяНоменклатура);
	//	Если НЕ ДобавленнаяСтрока = Неопределено Тогда
	//		Элементы.ДеревоТоваров.ТекущаяСтрока = ДобавленнаяСтрока.ПолучитьИдентификатор();
	//	КонецЕсли;
	//	
	//	
	//КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДанныхПотолка", ЭтотОбъект, новый Структура("ТекущиеДанные", ТекущиеДанные));
	ОткрытьФорму("ОбщаяФорма.ФормаДобавленияПродукции",, ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//-- №12147
	
КонецПроцедуры

//++ №12147
&НаКлиенте
Процедура ПослеВводаДанныхПотолка(СтруктураОтвета, ДопПараметры) Экспорт
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Модифицированность = Истина;
	
	ТекущиеДанные = ДопПараметры.ТекущиеДанные;
	ТекущаяКомната = ТекущиеДанные.Комната;
	
	УИСтроки = Новый УникальныйИдентификатор;
	СтруктураОтвета.Вставить("УИСтроки", УИСтроки);
	ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ЗаказДоговор");
	
	ДобавленнаяНоменклатура = ДобавитьПотолокНаСервере(ТекущиеДанные.Комната, СтруктураОтвета.Номенклатура, СтруктураОтвета.Количество, СтруктураОтвета.НомерПотолка); //, СтруктураОтвета.Фактура, СтруктураОтвета.Цвет);
	
	//#11670
	ОбщийМодульКлиент.РасширеннаяОбработкаДобавленнойПродукции(ЭтаФорма, ВидЗаказа, Ложь, ТекущаяКомната, СтруктураОтвета);
	
	ПеренестиДеревоВТабличнуюЧасть();
	
	РазвернутьДеревоТоваров(ТекущаяКомната, ДобавленнаяНоменклатура);
	
	ДобавленнаяСтрока = НайтиСтрокуДерева(ДеревоТоваров, ТекущаяКомната, ДобавленнаяНоменклатура);
	Если НЕ ДобавленнаяСтрока = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущаяСтрока = ДобавленнаяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры
//-- №12147

&НаСервере
Функция ДобавитьПотолокНаСервере(ДопПараметры, Номенклатура, Количество, НомерПотолка = "") //, Фактура = "", Цвет = "")
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Если Строка.Комната = ДопПараметры Тогда
			СтрокаТабличнойЧасти = Строка.Строки.Добавить();
			
			СтрокаТабличнойЧасти.Уровень = 1;
			//Если НЕ ПустаяСтрока(Номенклатура) Тогда
			СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
			//Иначе
			//	СтрокаТабличнойЧасти.Номенклатура = Справочники.Номенклатура.Потолок; // #12540 удалено
			//КонецЕсли;
			СтрокаТабличнойЧасти.Комната = ДопПараметры;
			
			СтрокаТабличнойЧасти.НомерПотолка = НомерПотолка;
			//Стр.НомерПотолка = Фактура;
			//Стр.ЦветФактуры = Цвет; // #12539
			
			СтруктураДанные = Новый Структура("Номенклатура, ВидСпецификации", СтрокаТабличнойЧасти.Номенклатура, ВидСпецификацииПоУмолчанию);
			СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, ВидНоменклатуры, Спецификация, УчитыватьКакПотолок");
			
			//Стр.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Стр.Номенклатура);
			//Стр.Коэффициент = 1;
			//Стр.Спецификация = ОбщийМодульСервер.ПолучитьОсновнуюСпецификациюНоменклатуры(Стр.Номенклатура, ВидСпецификацииПоУмолчанию);
			СтрокаТабличнойЧасти.Количество = Количество;
			СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения); //, Цвет.Владелец, Цвет);
			СтрокаТабличнойЧасти.ПроцентСкидки = ПолучитьПроцентВидаСкидки(Объект.ВидСкидки);
			СтрокаТабличнойЧасти.ЦенаПоПрайсу = СтрокаТабличнойЧасти.Цена;
			СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
			РассчитатьСуммуСтрокиНаСервере(СтрокаТабличнойЧасти);
			
			ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
			Возврат СтрокаТабличнойЧасти.Номенклатура;
		КонецЕсли
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоПотолковВДокументе()
	Результат = 0;
	Для Каждого ТекущаяСтрока Из Объект.ТоварыУслуги Цикл
		Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок
			или ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Отрез Тогда
			Результат = Результат + 1;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция НаименованиеПотолкаСодержитНомерДоговора()
	Если Константы.ПорядокФормированияНаименованияПотолкаРозницы.Получить() = 1 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПотолокИзEasyCeiling(Команда)
	
	ПеренестиДеревоВТабличнуюЧасть();
	
	ОбщийМодульКлиент.ЗагрузитьПотолокИзПостроителя(ЭтотОбъект, "ПредварительныйРасчет",);
	
	//Если НЕ ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала() тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если Элементы.ДеревоТоваров.ТекущиеДанные <> Неопределено  Тогда
	//	Если Не ПустаяСтрока(Элементы.ДеревоТоваров.ТекущиеДанные.Комната) Тогда
	//		ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
	//		ДопПараметры = Новый Структура();
	//		ДопПараметры.Вставить("ТекущаяКомната",ТекущаяКомната);
	//		
	//		Если ОбменСEasyCeiling.ИспользоватьСтандартныйДиалогWindowsДляВыбораФайлаВыгрузкиИзПостроителяй() Тогда
	//			
	//			Режим = РежимДиалогаВыбораФайла.Открытие;
	//			ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	//			ДиалогОткрытияФайла.Каталог = ОбщийМодуль.ПолучитьКаталогВыгрузиИзПостроителяДляТекущегоПользователя(Истина);
	//			Фильтр = "Выгрузка из построителя (*.ini)|*.ini";
	//			ДиалогОткрытияФайла.Фильтр = Фильтр;
	//			ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	//			ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	//			Если ДиалогОткрытияФайла.Выбрать() Тогда
	//				МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
	//				Для Каждого ИмяФайла Из МассивФайлов Цикл
	//					ВыбФайл = Новый Файл(ИмяФайла);
	//					ОбработатьВыборФайлаEasyCeiling(ВыбФайл.ПолноеИмя, ДопПараметры);
	//				КонецЦикла;
	//			КонецЕсли;
	//			
	//		Иначе
	//			
	//			МассивФайлов = ОткрытьФормуМодально("ОбщаяФорма.ФормаВыбораФайла", Новый Структура("НачальныйКаталог", ОбщийМодуль.ПолучитьКаталогВыгрузиИзПостроителяДляТекущегоПользователя(Истина)));
	//			Если НЕ МассивФайлов = Неопределено Тогда
	//				Для Каждого ИмяФайла Из МассивФайлов Цикл
	//					ОбработатьВыборФайлаEasyCeiling(ИмяФайла, ДопПараметры);
	//				КонецЦикла;
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//	Иначе
	//		ПоказатьОповещениеПользователя("Выберите комнату");
	//	КонецЕсли;	
	//Иначе
	//	ПоказатьОповещениеПользователя("Выберите комнату");	
	//КонецЕсли;	
	//Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПотолокИзПостроителяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Модифицированность = Истина;
	
	ПерестроитьДеревоНаФорме();
	
	//ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Номенклатура") Тогда
		РазвернутьДеревоТоваров(ДополнительныеПараметры.ТекущаяКомната, Результат);
		//РассчитатьИтоговыеПоказателиКлиент();
		ДобавленнаяСтрока = НайтиСтрокуДерева(ДеревоТоваров, ДополнительныеПараметры.ТекущаяКомната, Результат);
		Если НЕ ДобавленнаяСтрока = Неопределено Тогда
			Элементы.ДеревоТоваров.ТекущаяСтрока = ДобавленнаяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
		//Оповестить("ОбновитьСписокФайлов", Результат);
	КонецЕсли;
		
	ПоказатьОповещениеПользователя("Данные загружены");
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПродукцию(Команда)
	
	//ВМатериалы = (СтрНайти(Команда.Имя, "ВМатериалы") > 0);
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;	
	//Если ВМатериалы Тогда
	//	ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	//КонецЕсли;
	
	Если НЕ ОбщийМодульКлиент.Розница_КомнатаЗаполнена(ТекущиеДанные) Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;	
		
	СтруктураПараметров = Новый Структура;	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаДанныхПродукцииПоВиду", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаДобавленияПродукцииПоВиду", СтруктураПараметров, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДанныхПродукцииПоВиду(СтруктураОтвета, ДополнительныеПараметры) Экспорт
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;	
	ТекущаяКомната = ТекущиеДанные.Комната;
	
	УИСтроки = Новый УникальныйИдентификатор;
	СтруктураОтвета.Вставить("УИСтроки", УИСтроки);
	ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ЗаказДоговор");
	
	СтрокаКомнаты = ТекущиеДанные;
	Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда	
		СтрокаКомнаты = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	ИдКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
	
	ДополнительныеПараметрыДобавления = Новый Структура("Комната, Количество", ТекущаяКомната, СтруктураОтвета.Количество);
	
	// №13814
	ОбщийМодульКлиент.РасширеннаяОбработкаДобавленнойПродукции(ЭтаФорма, ВидЗаказа, Ложь, ТекущаяКомната, СтруктураОтвета, Истина);
	
	ПослеВыбораНоменклатуры(СтруктураОтвета, ИдКомнаты);
			
КонецПроцедуры

&НаКлиенте
Функция ПараметрыПодбора()
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",				Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",		Объект.Организация);
	ПараметрыПодбора.Вставить("ВидЦены",			Объект.ВидЦен);
	ПараметрыПодбора.Вставить("Валюта",				Объект.Валюта);
	ПараметрыПодбора.Вставить("ТипДокумента",		"ПредварительныйРасчет");
	Если НЕ ПодборВМатериалы Тогда
		ПараметрыПодбора.Вставить("Склад",				ПолучитьСкладТоваровПользователяПоУмолчанию()); 		
		//#16345
		Если ИспользоватьКонтрольКратности Тогда
			ПараметрыПодбора.Вставить("ВидДокументаПроверкиКратности",ПредопределенноеЗначение("Перечисление.ВидыДокументовПроверкиКратности.ПредварительныйРасчет")); 
		КонецЕсли;
	Иначе
		ПараметрыПодбора.Вставить("Склад",				ПолучитьСкладМатериаловПользователяПоУмолчанию());
		ПараметрыПодбора.Вставить("НеЗапрашиватьЦену",  Истина);
	КонецЕсли;	
	Возврат ПараметрыПодбора;
	
КонецФункции
	
&НаКлиенте
Процедура ПодобратьНоменклатуру(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;	
	
	Если ПустаяСтрока(ТекущиеДанные.Комната) Тогда		
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	ПараметрыПодбора = ПараметрыПодбора();
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

// вызывается:
// - по ОбработкаВыбора из формы подбора                      ИсточникВызова = "Подбор"
// - по ЗаполнитьКомнатуПоШаблонуЗавершение                                    "ЗаполнениеПоШаблону"
// - по ОбработкаВыбора из формы СопутствующиеТоварыИУслуги                    "ДобавлениеСопутки"
&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, ИсточникВызова, ПерезаполнятьЦены = Ложь)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	ТекущаяКомната = ТекущаяСтрока.Комната;

	ОбработатьПодборНаСервере(ВыбранноеЗначение, ТекущаяКомната, ИсточникВызова, ПерезаполнятьЦены);
	
	ПеренестиДеревоВТабличнуюЧасть();
	РазвернутьДеревоТоваров();
	ОбновитьЭлементыФормы(ТекущаяКомната, Неопределено);

КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборНаСервере(ВыбранноеЗначение, ИмяТекущейКомнаты, ИсточникВызова, ПерезаполнятьЦены)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	СтрокиКомнат = Дерево.Строки;
	
	СтрокаКомнаты = СтрокиКомнат.Найти(ИмяТекущейКомнаты, "Комната", Ложь);
	
	УИСтрокиПодбора = Неопределено;
	
	//Для Каждого Строка из Дерево.Строки Цикл
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
		Если ИсточникВызова = "ДобавлениеСопутки" Тогда
			// комнату определяем на каждом шаге, так как могла выделить разные позиции разных комнат
			СтрокаРодителяСТ = СтрокиКомнат.Найти(ТекущаяСтрока.УИСтрокиРодителя, "УИСтроки", Истина);
			СтрокаКомнаты = СтрокаРодителяСТ.Родитель;
			
			Если НЕ ТекущаяСтрока.УИСтрокиПодбора = УИСтрокиПодбора Тогда
				УИСтрокиПодбора = ТекущаяСтрока.УИСтрокиПодбора;
				ИндексСтроки = СтрокаКомнаты.Строки.Индекс(СтрокаРодителяСТ) + 1;
			Иначе
				ИндексСтроки = ИндексСтроки + 1;
			КонецЕсли;			
		КонецЕсли;
		
		СтрокиПозиций = СтрокаКомнаты.Строки;
		
		Если ИсточникВызова = "ДобавлениеСопутки" Тогда
			СтрокаТабличнойЧасти = СтрокиПозиций.Вставить(ИндексСтроки);
		Иначе
			СтрокаТабличнойЧасти = СтрокиПозиций.Добавить();			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ТекущаяСтрока);
		СтрокаТабличнойЧасти.Комната = СтрокаКомнаты.Комната;
		
		СтрокаТабличнойЧасти.Уровень = 1;
		
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧастиСервер(СтрокаТабличнойЧасти);
		СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ВидНоменклатуры, Спецификация, УчитыватьКакПотолок");
		
		СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
		
		Если ИсточникВызова = "Подбор" ИЛИ ИсточникВызова = "ДобавлениеСопутки" Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЦенаПоПрайсу, ПроцентСкидки");
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЦенаПоПрайсу, ПроцентСкидки, Количество"); //#16345 добавлено количество
		КонецЕсли;		
		Если ПерезаполнятьЦены Тогда
			СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
		КонецЕсли;
		
		РассчитатьСуммуСтрокиНаСервере(СтрокаТабличнойЧасти);
		
		Если ПустаяСтрока(СтрокаТабличнойЧасти.УИСтроки) Тогда
			// при подборе сопутствующих уже заполнено
			СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомнатуПоШаблону(Команда)
		
	ОбщийМодульКлиент.Розница_ЗаполнитьКомнатуПоШаблону(ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомнатуПоШаблонуЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
			
	ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, "ЗаполнениеПоШаблону");
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуНаПотолок(Команда)
	
	//УстановитьСкидку = 0;
	//ПараметрыПроцедуры = Новый Структура;
	//ПараметрыПроцедуры.Вставить("Предмет", "Потолок");
	//ПараметрыПроцедуры.Вставить("ТекстСообщения", "Введите % скидки на полотно");
	//ПроцедураПослеВВодаСкидки = Новый ОписаниеОповещения("ПроцедураПослеВВодаСкидки", ЭтаФорма, ПараметрыПроцедуры);
	//ПоказатьВводЗначения(ПроцедураПослеВВодаСкидки, УстановитьСкидку, "Введите % скидки на полотно");
	//
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Форма", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ЭтоЗаказ", Ложь);
	ПараметрыПроцедуры.Вставить("Предмет", "Потолок");
	ПараметрыПроцедуры.Вставить("ТекстСообщения", "Введите % скидки на полотно");
	ОповещениеПослеИзмененияСкидки = Новый ОписаниеОповещения("ИзменитьСкидкуПослеИзмененияСкидки", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ОповещениеПослеИзмененияСкидки", ОповещениеПослеИзмененияСкидки);
		
	ОбщийМодульКлиент.Розница_ИзменитьСкидку(ПараметрыПроцедуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуНаУслуги(Команда)
	
	//УстановитьСкидку = 0;
	//ПараметрыПроцедуры = Новый Структура;
	//ПараметрыПроцедуры.Вставить("Предмет","Услуги");
	//ПроцедураПослеВВодаСкидки = Новый ОписаниеОповещения("ПроцедураПослеВВодаСкидки", ЭтаФорма, ПараметрыПроцедуры);
	//ПоказатьВводЗначения(ПроцедураПослеВВодаСкидки, УстановитьСкидку, "Введите % скидки на услуги");

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Форма", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ЭтоЗаказ", Ложь);
	ПараметрыПроцедуры.Вставить("Предмет", "Услуги");
	ПараметрыПроцедуры.Вставить("ТекстСообщения", "Введите % скидки на услуги");
	ОповещениеПослеИзмененияСкидки = Новый ОписаниеОповещения("ИзменитьСкидкуПослеИзмененияСкидки", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ОповещениеПослеИзмененияСкидки", ОповещениеПослеИзмененияСкидки);
		
	ОбщийМодульКлиент.Розница_ИзменитьСкидку(ПараметрыПроцедуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуТовары(Команда)
	
	//УстановитьСкидку = 0;
	//ПараметрыПроцедуры = Новый Структура;
	//ПараметрыПроцедуры.Вставить("Предмет","Товары");
	//ПроцедураПослеВВодаСкидки = Новый ОписаниеОповещения("ПроцедураПослеВВодаСкидки", ЭтаФорма, ПараметрыПроцедуры);
	//ПоказатьВводЗначения(ПроцедураПослеВВодаСкидки, УстановитьСкидку, "Введите % скидки на товары");
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Форма", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ЭтоЗаказ", Ложь);
	ПараметрыПроцедуры.Вставить("Предмет", "Товары");
	ПараметрыПроцедуры.Вставить("ТекстСообщения", "Введите % скидки на товары");
	ОповещениеПослеИзмененияСкидки = Новый ОписаниеОповещения("ИзменитьСкидкуПослеИзмененияСкидки", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ОповещениеПослеИзмененияСкидки", ОповещениеПослеИзмененияСкидки);
		
	ОбщийМодульКлиент.Розница_ИзменитьСкидку(ПараметрыПроцедуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуНаВсе(Команда)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Форма", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ЭтоЗаказ", Ложь);
	ПараметрыПроцедуры.Вставить("Предмет", "Все");
	ПараметрыПроцедуры.Вставить("ТекстСообщения", "Введите % скидки на все");
	ОповещениеПослеИзмененияСкидки = Новый ОписаниеОповещения("ИзменитьСкидкуПослеИзмененияСкидки", ЭтаФорма);
	ПараметрыПроцедуры.Вставить("ОповещениеПослеИзмененияСкидки", ОповещениеПослеИзмененияСкидки);
		
	ОбщийМодульКлиент.Розница_ИзменитьСкидку(ПараметрыПроцедуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуПослеИзмененияСкидки(Результат, ДополнительныеПараметры) Экспорт
	
	РассчитатьИтоговыеПоказателиКлиент();
	Состояние("Скидка установлена");
		
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСкидки(Команда)
	
	Объект.ВидСкидки = ПредопределенноеЗначение("Справочник.ВидыСкидок.ПустаяСсылка");
	ВидСкидкиПриИзмененииНаСервере();
	//ОбновитьОтображениеЭлементовФормы();
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереименоватьКомнату(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИдТекущейСтрокиКомнаты = ТекущиеДанные.ПолучитьИдентификатор();
	Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		ИдТекущейСтрокиКомнаты = ТекущиеДанные.ПолучитьРодителя().ПолучитьИдентификатор();
	КонецЕсли;

	ТекущееНаименование = ТекущиеДанные.Комната;
	
	ПараметрыПереименования = Новый Структура;
	ПараметрыПереименования.Вставить("Форма", ЭтаФорма);
	ПараметрыПереименования.Вставить("СтароеНаименование", ТекущееНаименование);
	ПараметрыПереименования.Вставить("ИдТекущейСтрокиКомнаты", ИдТекущейСтрокиКомнаты);
	
	ОбщийМодульКлиент.Розница_ПереименоватьКомнату(ПараметрыПереименования);
	
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаНовогоНаименованияКомнаты",ЭтаФорма,ПараметрыПереименования);
	//ПоказатьВводСтроки(ОписаниеОповещения, ТекущееНаименование, "Введите название комнаты");

КонецПроцедуры

&НаСервере
Функция ЭтоПотолок(Номенклатура)
	Возврат Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Номенклатура);
КонецФункции

&НаКлиенте
Процедура ДеревоТоваровНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Неопределено;
	
	//корневые строки редактировать нельзя
	Если СтрокаТабличнойЧасти.ПолучитьРодителя() = Неопределено Тогда
		СтрокаТабличнойЧасти.Номенклатура = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Количество = 1;
	
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, ВидНоменклатуры, Спецификация, УчитыватьКакПотолок");
		
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена, ЦенаПоПрайсу, ПроцентСкидки, Количество"); //#16345 добавлено Количество 
	
	РассчитатьСуммуСтроки(СтрокаТабличнойЧасти);

	СтрокаКомнаты = СтрокаТабличнойЧасти;
	Если НЕ СтрокаТабличнойЧасти.ПолучитьРодителя() = Неопределено Тогда	
		СтрокаКомнаты = СтрокаТабличнойЧасти.ПолучитьРодителя();
	КонецЕсли;
	ИдКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
	
	Если НЕ СтрокаТабличнойЧасти = Неопределено
		И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги
		И ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
		Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииНоменклатуры Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура); 
			ДопПараметры.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры); 
			ДопПараметры.Вставить("УИСтроки", СтрокаТабличнойЧасти.УИСтроки); 
			ДопПараметры.Вставить("Количество", СтрокаТабличнойЧасти.Количество); 
			ДопПараметры.Вставить("ИДКомнаты", ИдКомнаты);
			ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Добавить сопутствующие товары и услуги для номенклтатуры: """ + СтрокаТабличнойЧасти.Номенклатура + """?", РежимДиалогаВопрос.ДаНет);
		Иначе
			ПодборСопутствующейНоменклатуры(ИДКомнаты);
			//МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.УИСтроки, 	СтрокаТабличнойЧасти.Количество, ИДКомнаты, 0);
		КонецЕсли;
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСопутствующейНоменклатуры(ИДКомнаты)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	ИдентификаторСтрокиРодителя = ТекущиеДанные.ПолучитьИдентификатор();
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Позиция = Новый Структура;
	Позиция.Вставить("Номенклатура",								ТекущиеДанные.Номенклатура);
	Позиция.Вставить("ХарактеристикаНоменклатуры",		ТекущиеДанные.ХарактеристикаНоменклатуры);
	Позиция.Вставить("УИСтроки",										ТекущиеДанные.УИСтроки);
	Позиция.Вставить("Количество",									ТекущиеДанные.Количество);
	
	ТаблицаСопутствующейНоменклатуры = СопутствующиеТоварыВызовСервера.ПодборСопутствующейНоменклатурыНаСервере(Позиция);
	ОбработатьДобавлениеСННаСервере(ТаблицаСопутствующейНоменклатуры, ТекущиеДанные.УИСтроки);
	РазвернутьДеревоТоваров();
	
	Элементы.ДеревоТоваров.ТекущаяСтрока =  ОбщийМодульКлиент.ПолучитьИдентификаторПоУИстроки(ДеревоТоваров, Позиция.УИСтроки);
	
	//СтрокаКомнаты = ДеревоТоваров.НайтиПоИдентификатору(ИдКомнаты);	
	//СтрокиНоменклатуры = СтрокаКомнаты.ПолучитьЭлементы();
	//
		
	//Для Каждого СтрокаСопутствующейНоменклатуры Из ТаблицаСопутствующейНоменклатуры Цикл
	//	
	//	НоменклатураПрисутствует = Ложь;
	//	// Проверяе наличие сопуствующей номенклатуры в дереве чтобы не добавить дубликат или чтобц не затереть параметры номенклатуры в дереве
	//	Для каждого Строка	Из СтрокиНоменклатуры Цикл 
	//		Если Строка.Номенклатура = СтрокаСопутствующейНоменклатуры.Номенклатура 
	//			И Строка.ХарактеристикаНоменклатуры = СтрокаСопутствующейНоменклатуры.Характеристика
	//			И Строка.ЕдиницаИзмерения = СтрокаСопутствующейНоменклатуры.ЕдиницаИзмерения
	//			И Строка.УИСтрокиРодителя = СтрокаСопутствующейНоменклатуры.УИСтрокиРодителя Тогда
	//			НоменклатураПрисутствует = Истина;
	//		КонецЕсли;	
	//	КонецЦикла;
	//	Если НоменклатураПрисутствует Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	
	//	
	//	
	//	СтрокаТабличнойЧасти = СтрокиНоменклатуры.Добавить();
	//			
	//	СтрокаТабличнойЧасти.Номенклатура = СтрокаСопутствующейНоменклатуры.Номенклатура;
	//	СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаСопутствующейНоменклатуры.Характеристика;
	//	СтрокаТабличнойЧасти.УИСтрокиРодителя = СтрокаСопутствующейНоменклатуры.УИСтрокиРодителя;
	//	СтрокаТабличнойЧасти.УИСтроки = СтрокаСопутствующейНоменклатуры.УИСтроки;
	//	СтрокаТабличнойЧасти.Уровень = 1;
	//	СтрокаТабличнойЧасти.Комната = СтрокаКомнаты.Комната;
	//	
	//	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаСопутствующейНоменклатуры.ЕдиницаИзмерения;
	//	СтрокаТабличнойЧасти.Коэффициент = СтрокаСопутствующейНоменклатуры.Коэффициент;
	//	СтрокаТабличнойЧасти.Количество = СтрокаСопутствующейНоменклатуры.Количество;
	//	
	//	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	//	СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	//	//ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, Количество, ВидНоменклатуры, Спецификация, УчитыватьКакПотолок");
	//	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ВидНоменклатуры, Спецификация, УчитыватьКакПотолок");
	//	
	//	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	//	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена, ЦенаПоПрайсу, ПроцентСкидки, Количество"); //#16345 добавлено Количество 
	//	
	//	РассчитатьСуммуСтроки(СтрокаТабличнойЧасти);
	//	
	//КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ОбработатьДобавлениеСННаСервере(ТаблицаТоваров, УИСтрокиРодителя)
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	СтрокиКомнат = Дерево.Строки;
	ИндексСтроки = 0;
	//СтрокаТекущегоРодителя = СтрокиКомнат.Найти(УИСтрокиРодителя, "УИСтроки", Истина);
	СтрокаТекущегоРодителя = Неопределено;
	//СтрокаКомнаты = СтрокаТекущегоРодителя.Родитель;
	//ИндексСтроки = СтрокаКомнаты.Строки.Индекс(СтрокаТекущегоРодителя) + 1;
	
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
		// Проверяем наличие номенклатуры в дереве (в случае добавления недостающей номенклатуры)
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Номенклатура",ТекущаяСтрока.Номенклатура);
		ПараметрыПоиска.Вставить("ХарактеристикаНоменклатуры",ТекущаяСтрока.Характеристика);
		ПараметрыПоиска.Вставить("УИСтрокиРодителя",ТекущаяСтрока.УИСтрокиРодителя);
		//поиск строк
		СтрокиСТВДереве = СтрокиКомнат.НайтиСтроки(ПараметрыПоиска, Истина);
		Если СтрокиСТВДереве.Количество() > 0 Тогда
				СтрокиСТВДереве[0].УИСтроки = ТекущаяСтрока.УИСтроки;
			   ИндексСтроки = ИндексСтроки + 1;
			   Продолжить;
		КонецЕсли;	
		
		СтрокаРодителя = Дерево.Строки.Найти(ТекущаяСтрока.УИСтрокиРодителя, "УИСтроки", Истина);
		Если НЕ СтрокаТекущегоРодителя = СтрокаРодителя Тогда
			СтрокаТекущегоРодителя = СтрокиКомнат.Найти(ТекущаяСтрока.УИСтрокиРодителя, "УИСтроки", Истина);
			СтрокаКомнаты = СтрокаТекущегоРодителя.Родитель;
			ИндексСтроки = СтрокаКомнаты.Строки.Индекс(СтрокаТекущегоРодителя) + 1;
		Иначе
			ИндексСтроки = ИндексСтроки + 1;
		КонецЕсли;	
		
		СтрокиПозиций = СтрокаКомнаты.Строки;
		СтрокаТабличнойЧасти = СтрокиПозиций.Вставить(ИндексСтроки);
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ТекущаяСтрока);
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ТекущаяСтрока.Характеристика;
		СтрокаТабличнойЧасти.Комната = СтрокаКомнаты.Комната;
		
		СтрокаТабличнойЧасти.Уровень = 1;
		
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧастиСервер(СтрокаТабличнойЧасти);
		СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ВидНоменклатуры, Спецификация, УчитыватьКакПотолок");
		
		СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
		
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЦенаПоПрайсу, ПроцентСкидки");
		РассчитатьСуммуСтрокиНаСервере(СтрокаТабличнойЧасти);
		
		Если ПустаяСтрока(СтрокаТабличнойЧасти.УИСтроки) Тогда
			// при подборе сопутствующих уже заполнено
			СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
		
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
КонецПроцедуры





&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущаяСтрока = Неопределено, НеПересчитыватьСуммуРучнойСкидки = Ложь)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = Элементы.ТоварыУслуги.ТекущиеДанные;
	КонецЕсли;	
	
	Если ТекущаяСтрока.ПроцентСкидки = 100 Тогда
		ТекущаяСтрока.Сумма = 0;
		Если НЕ НеПересчитыватьСуммуРучнойСкидки Тогда
			ТекущаяСтрока.СуммаСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		КонецЕсли;
	Иначе
		Если НЕ ТекущаяСтрока.ПроцентСкидки = 0 Тогда
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * (1 - ТекущаяСтрока.ПроцентСкидки / 100);
			Если НЕ НеПересчитыватьСуммуРучнойСкидки Тогда
				ТекущаяСтрока.СуммаСкидки = (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена) - ТекущаяСтрока.Сумма;
			КонецЕсли;
		Иначе
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			Если НЕ НеПересчитыватьСуммуРучнойСкидки Тогда
				ТекущаяСтрока.СуммаСкидки = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	ТекущаяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	
	ТекущаяСтрока.СуммаПоПрайсу = ТекущаяСтрока.ЦенаПоПрайсу * ТекущаяСтрока.Количество;
	
	ПеренестиДеревоВТабличнуюЧасть();
	ПересчитатьСуммуДокумента();
	
	РассчитатьИтогиПоКомнатам();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровХарактеристикаНоменклатурыПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтрокаТабличнойЧасти.УИСтроки = Новый УникальныйИдентификатор;
	СтрокаТабличнойЧасти.УИСтрокиРодителя = Неопределено;
	РассчитатьСуммуСтроки(СтрокаТабличнойЧасти);
	
	СтрокаКомнаты = СтрокаТабличнойЧасти;
	Если НЕ СтрокаТабличнойЧасти.ПолучитьРодителя() = Неопределено Тогда	
		СтрокаКомнаты = СтрокаТабличнойЧасти.ПолучитьРодителя();
	КонецЕсли;
	ИдКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
	
	Если НЕ СтрокаТабличнойЧасти = Неопределено
		И СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги
		И ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
		Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриДобавленииНоменклатуры Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура); 
			ДопПараметры.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры); 
			ДопПараметры.Вставить("УИСтроки", СтрокаТабличнойЧасти.УИСтроки); 
			ДопПараметры.Вставить("Количество", СтрокаТабличнойЧасти.Количество); 
			ДопПараметры.Вставить("ИДКомнаты", ИдКомнаты);
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
				ДляВопросаОНоменклатуре = ", характеристика: """ + СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры + """";
			Иначе
				ДляВопросаОНоменклатуре = "";
			КонецЕсли;
			ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Добавить сопутствующие товары и услуги для" + Символы.ПС + "номенклатуры: """ + СтрокаТабличнойЧасти.Номенклатура + """" + ДляВопросаОНоменклатуре + "?", РежимДиалогаВопрос.ДаНет);
		Иначе
			//МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.УИСтроки, 	СтрокаТабличнойЧасти.Количество, ИДКомнаты, 0);
			ПодборСопутствующейНоменклатуры(ИдКомнаты);
		КонецЕсли;
	КонецЕсли;	
	
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	
	//корневые строки редактировать нельзя
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		ТекущиеДанные.Количество = 0;
		Возврат;
	КонецЕсли;
	
	РодительЭлемент = ТекущиеДанные.ПолучитьРодителя();
	ИдКомнаты = РодительЭлемент.ПолучитьИдентификатор();
	
	//#16345
	Если ИспользоватьКонтрольКратности Тогда
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(ТекущиеДанные);
		ОтказВИзмененииКоличества = Ложь;
		ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества);
		Если ОтказВИзмененииКоличества Тогда
			ТекущиеДанные.Количество = 0;
		КонецЕсли;
	КонецЕсли;
	
	ПроцентАвтоматическойСкидки = ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Объект.Дата, ТекущиеДанные.Номенклатура, ТекущиеДанные.Количество);
	Если НЕ ПроцентавтоматическойСкидки = 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОбИзмененииАвтоматическойСкидки",ЭтаФорма, ТекущиеДанные), "Изменить скидку согласно настроек автоматических скидок?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ПослеИзмененияКоличестваТоваров(Элементы.ДеревоТоваров.ТекущиеДанные, Ложь);
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	
	Если СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги	Тогда
		МассивСопутствующихТоваров = ОбщийМодульКлиент.ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(Элементы.ДеревоТоваров, ДеревоТоваров);
		КоличествоСопутствующихТоваровВРегистре = ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(ТекущиеДанные.Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, Истина);
		ТребуетсяДополнить = ?(МассивСопутствующихТоваров.Количество()<КоличествоСопутствующихТоваровВРегистре, Истина, Ложь);
		Если МассивСопутствующихТоваров.Количество() > 0 Тогда
			Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииКоличества Тогда
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура); 
				ДопПараметры.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры); 
				ДопПараметры.Вставить("УИСтроки", ТекущаяСтрока.УИСтроки); 
				ДопПараметры.Вставить("Количество", ТекущаяСтрока.Количество); 
				ДопПараметры.Вставить("ИДКомнаты", ИДкомнаты);
				ДопПараметры.Вставить("ТребуетсяДополнить", ТребуетсяДополнить);
				Если ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) Тогда
					ДляВопросаОНоменклатуре = ", характеристика: """ + ТекущаяСтрока.ХарактеристикаНоменклатуры + """";
				Иначе
					ДляВопросаОНоменклатуре = "";
				КонецЕсли;
				ПоказатьВопрос(Новый ОписаниеОповещения("ВопросИзменениеКоличестваСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Изменить количество сопутствующих товаров и услуг для" + Символы.ПС + "номенклатуры: """ + ТекущаяСтрока.Номенклатура + """" + ДляВопросаОНоменклатуре + "?", РежимДиалогаВопрос.ДаНет);
			Иначе
				Если ТребуетсяДополнить Тогда
					Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриДобавленииНоменклатуры Тогда
						ДопПараметры = Новый Структура;
						ДопПараметры.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура); 
						ДопПараметры.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры); 
						ДопПараметры.Вставить("УИСтроки", ТекущаяСтрока.УИСтроки); 
						ДопПараметры.Вставить("Количество", ТекущаяСтрока.Количество); 
						ДопПараметры.Вставить("ИДКомнаты", ИдКомнаты);
						ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Добавить сопутствующие товары и услуги для номенклтатуры: """ + ТекущаяСтрока.Номенклатура + """?", РежимДиалогаВопрос.ДаНет);
					Иначе
						//МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.УИСтроки, ТекущаяСтрока.Количество, ИДКомнаты, 0);
						ПодборСопутствующейНоменклатуры(ИдКомнаты);
					КонецЕсли;
				КонецЕсли;	
				ИзмененныеСтроки = ОбщийМодульКлиент.ИзменитьКоличествоСопутствущихТоваров(ДеревоТоваров, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.УИСтроки, ТекущаяСтрока.Количество, ИдКомнаты);
				Для каждого СтрокаТовара Из ИзмененныеСтроки Цикл
					ПослеИзмененияКоличестваТоваров(СтрокаТовара, Ложь);
				КонецЦикла;	
				РассчитатьИтоговыеПоказателиКлиент();	
			КонецЕсли;
		Иначе
			Если ОбщийМодульВызовСервера.ЕстьСопутствующаяНоменклатураВРегистре(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры) Тогда
				Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриДобавленииНоменклатуры Тогда
					ДопПараметры = Новый Структура;
					ДопПараметры.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура); 
					ДопПараметры.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры); 
					ДопПараметры.Вставить("УИСтроки", ТекущаяСтрока.УИСтроки); 
					ДопПараметры.Вставить("Количество", ТекущаяСтрока.Количество); 
					ДопПараметры.Вставить("ИДКомнаты", ИДкомнаты);
					ДопПараметры.Вставить("ТребуетсяДополнить", ТребуетсяДополнить);
					Если ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) Тогда
						ДляВопросаОНоменклатуре = ", характеристика: """ + ТекущаяСтрока.ХарактеристикаНоменклатуры + """";
					Иначе
						ДляВопросаОНоменклатуре = "";
					КонецЕсли;
					ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Добавить сопутствующие товары и услуги для" + Символы.ПС + "номенклатуры: """ + ТекущаяСтрока.Номенклатура + """" + ДляВопросаОНоменклатуре +"?", РежимДиалогаВопрос.ДаНет);
				Иначе
					//МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.УИСтроки, ТекущаяСтрока.Количество, ИДкомнаты, 0);
					ПодборСопутствующейНоменклатуры(ИдКомнаты);
					РассчитатьИтоговыеПоказателиКлиент();	
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВопросИзменениеКоличестваСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	
	// Если не нужно изменять количество сопутствующей номенклатуры и не требуется дополнять недостающую номенклатуру
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да И НЕ ДополнительныеПараметры.ТребуетсяДополнить Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ИзмененныеСтроки = ОбщийМодульКлиент.ИзменитьКоличествоСопутствущихТоваров(ДеревоТоваров, ДополнительныеПараметры.Номенклатура, ДополнительныеПараметры.ХарактеристикаНоменклатуры, ДополнительныеПараметры.УИСтроки, ДополнительныеПараметры.Количество, ДополнительныеПараметры.ИдКомнаты);
		Для каждого СтрокаТовара Из ИзмененныеСтроки Цикл
			ПослеИзмененияКоличестваТоваров(СтрокаТовара, Ложь);
		КонецЦикла;	
	КонецЕсли;
	
	Если  ДополнительныеПараметры.ТребуетсяДополнить Тогда
		Если ЗначениеЗаполнено(ДополнительныеПараметры.ХарактеристикаНоменклатуры) Тогда
			ДляВопросаОНоменклатуре = ", характеристика: """ + ДополнительныеПараметры.ХарактеристикаНоменклатуры + """";
		Иначе
			ДляВопросаОНоменклатуре = "";
		КонецЕсли;
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросДобавлениеНедостающейСопутствующейНоменклатуры", ЭтотОбъект, ДополнительныеПараметры), "Добавить недостающие сопутствующие товары и услуги для" + Символы.ПС + "номенклатуры: """ + ДополнительныеПараметры.Номенклатура + """" + ДляВопросаОНоменклатуре + "?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросДобавлениеНедостающейСопутствующейНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	
	// Не требуется дополнять недостающую номенклатуру
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да  Тогда
		// Просто изменяем количество существующей сопутствующей номенклатуры
		ИзмененныеСтроки = ОбщийМодульКлиент.ИзменитьКоличествоСопутствущихТоваров(ДеревоТоваров, ДополнительныеПараметры.Номенклатура, ДополнительныеПараметры.ХарактеристикаНоменклатуры, ДополнительныеПараметры.УИСтроки, ДополнительныеПараметры.Количество, ДополнительныеПараметры.ИдКомнаты);
		Для каждого СтрокаТовара Из ИзмененныеСтроки Цикл
			ПослеИзмененияКоличестваТоваров(СтрокаТовара, Ложь);
		КонецЦикла;	
	Иначе
		//МассивДобавленнойСП = ДобавитьСопутствующуюНоменклатуру(ДополнительныеПараметры.Номенклатура, ДополнительныеПараметры.ХарактеристикаНоменклатуры, ДополнительныеПараметры.УИСтроки, ДополнительныеПараметры.Количество, ДополнительныеПараметры.ИДКомнаты, 0);
		ПодборСопутствующейНоменклатуры(ДополнительныеПараметры.ИДКомнаты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЕдиницаИзмеренияПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.ЕдиницаИзмерения = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровКоэффициентПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Коэффициент = 0;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЦенаПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Цена = 0;
		Возврат;
	КонецЕсли;
	
	//Если мИспользоватьАвтоматическиеСкидки Тогда
	//	Если ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат() Тогда 
	//		РассчитатьСуммуСтроки(Элементы.ДеревоТоваров.ТекущиеДанные);
	//	Иначе			
	//		РасчетПроцентаАвтоматическойСкидки(Элементы.ДеревоТоваров.ТекущиеДанные);
	//	КонецЕсли;		
	//Иначе
		РассчитатьСуммуСтроки(Элементы.ДеревоТоваров.ТекущиеДанные);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПроцентСкидкиПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.ПроцентСкидки = 0;
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуСтроки(Элементы.ДеревоТоваров.ТекущиеДанные);
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровСуммаСкидкиПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.СуммаСкидки = 0;
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если НЕ ТекущаяСтрока.СуммаСкидки = 0 Тогда
		Если НЕ ТекущаяСтрока.Количество = 0 и НЕ ТекущаяСтрока.Цена = 0 Тогда
			ТекущаяСтрока.ПроцентСкидки = Окр((ТекущаяСтрока.СуммаСкидки / (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена)) * 100,2);
			РассчитатьСуммуСтроки(ТекущаяСтрока, Истина);
		Иначе
			ТекущаяСтрока.ПроцентСкидки = 100;
			РассчитатьСуммуСтроки(ТекущаяСтрока, Истина);
		КонецЕсли;
	Иначе 
		ТекущаяСтрока.ПроцентСкидки = 0;
		РассчитатьСуммуСтроки(ТекущаяСтрока, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;	
	ОбщийМодульКлиент.Розница_ТоварыСуммаПриИзменении(ЭтотОбъект, СтрокаТабличнойЧасти);
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоМатериалов(Комната = Неопределено, Номенклатура = Неопределено)
	ИдТекущейСтроки = Неопределено;
	КоллекцияЭлементовДерева = ЭтаФорма.ДеревоМатериалов.ПолучитьЭлементы();
    Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
        ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Если Строка.Комната = Комната И Строка.Номенклатура = Номенклатура Тогда
			ИдТекущейСтроки = ИдентификаторСтроки;
		КонецЕсли;
        Элементы.ДеревоМатериалов.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
	Элементы.ДеревоМатериалов.ТекущаяСтрока = ИдТекущейСтроки;
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуИтогоПоКомнате(Комната)
	
	Если ПустаяСтрока(Комната) тогда
		Возврат "";
	КонецЕсли;
	
	ВременнаяТаблица = Объект.ТоварыУслуги.Выгрузить();
	ВременнаяТаблица.Свернуть("Комната","Сумма");
	
	Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
		Если ТекущаяСтрока.Комната = Комната Тогда
			Возврат ТекущаяСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура РассчитатьИтогиПоКомнатам()
	
	ЭлементыДерева = ДеревоТоваров.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из ЭлементыДерева Цикл
		СтрокаДерева.Сумма = ПолучитьСуммуИтогоПоКомнате(СтрокаДерева.Комната);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат()
	Возврат Константы.ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат.Получить();	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Дата, Номенклатура, Количество)

	Скидка = 0;
	
	Если ИспользоватьАвтоматическиеСкидки Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияАвтоматическихСкидокСрезПоследних.КоличествоОт,
		|	ЗначенияАвтоматическихСкидокСрезПоследних.РазмерСкидки
		|ИЗ
		|	РегистрСведений.ЗначенияАвтоматическихСкидок.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЗначенияАвтоматическихСкидокСрезПоследних";
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда 
			Возврат Скидка;
		КонецЕсли;
		
		ТаблицаСкидок = РезультатЗапроса.Выгрузить();
		ТаблицаСкидок.Сортировать("КоличествоОт");
		Для Каждого Стр из ТаблицаСкидок Цикл
			Если Количество >= Стр.КоличествоОт Тогда 
				Скидка = Стр.РазмерСкидки;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;

	Возврат Скидка;	
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	ПересчитатьСуммуДокументаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбИзмененииАвтоматическойСкидки(Результат, ТекущаяСтрока) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        ПослеИзмененияКоличестваТоваров(ТекущаяСтрока, Ложь);
	Иначе
		ПослеИзмененияКоличестваТоваров(ТекущаяСтрока, Истина);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияКоличестваТоваров(ТекущаяСтрока, Знач ПерезаполнитьСкидки = Истина)
	
	//проставим автоматическую скидку + скидку вида
	Если ПерезаполнитьСкидки Тогда
		ТекущаяСтрока.ПроцентСкидки = ПолучитьПроцентАвтоматическойСкидкиСервер(ИспользоватьАвтоматическиеСкидки, Объект.Дата, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Количество) + ПолучитьПроцентВидаСкидки(Объект.ВидСкидки);
	КонецЕсли;
	
	//Если мИспользоватьАвтоматическиеСкидки Тогда
	//	Если ИспользоватьАвтоматическиеСкидкиВРазрезеКомнат() Тогда 
	//		РассчитатьСуммуСтроки(Элементы.ДеревоТоваров.ТекущиеДанные);
	//	Иначе			
	//		РасчетПроцентаАвтоматическойСкидки(Элементы.ДеревоТоваров.ТекущиеДанные);
	//	КонецЕсли;		
	//Иначе
		РассчитатьСуммуСтроки(ТекущаяСтрока);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДругуюКомнату(Команда)
	
	ВыделенныеСтроки = Элементы.ДеревоТоваров.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выберите товар или услугу комнаты, который нужно перенести");
		Возврат;
	КонецЕсли;
	
	ТекущаяКомната = Неопределено;
	
	Для каждого ТекущаяСтрока из ВыделенныеСтроки Цикл
		СтрокаТЧ = ДеревоТоваров.НайтиПоИдентификатору(ТекущаяСтрока);

		Если ТекущаяКомната = Неопределено Тогда
			ТекущаяКомната = СтрокаТЧ.Комната;
		КонецЕсли;
		Если НЕ ТекущаяКомната = СтрокаТЧ.Комната Тогда
			ПоказатьПредупреждение(,"Выберите товары / услуги из одной комнаты!");
			Возврат;
		КонецЕсли;
		
		СтрокаТЧ = ДеревоТоваров.НайтиПоИдентификатору(ТекущаяСтрока);
		
		Если СтрокаТЧ.Номенклатура.Пустая() Тогда
			ПоказатьПредупреждение(,"Выберите товар или услугу комнаты, который нужно скопировать");
			Возврат;
		КонецЕсли;	
	КонецЦикла;		
	
	ПараметрыПереносаПозиции = Новый Структура;
	ПараметрыПереносаПозиции.Вставить("Форма", ЭтаФорма);
	ПараметрыПереносаПозиции.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	ПараметрыПереносаПозиции.Вставить("ТекущаяКомната",  ТекущаяКомната);
		
	ОбщийМодульКлиент.Розница_ПеренестиПозициюВДругуюКомнату(ПараметрыПереносаПозиции);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкладМатериаловПользователяПоУмолчанию()
	Возврат ОбщийМодульСервер.НастройкаПользователя("СкладМатериаловРозница");
КонецФункции

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСпецификации(Команда)
		
	Если Объект.Материалы.Количество() > 0 тогда
		НовоеОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОбОчисткеМатериалов",ЭтаФорма);
		ПоказатьВопрос(НовоеОписаниеОповещения, "Табличная часть ""Материалы"" будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьМатериалыПоСпецификацииНаСервере();
		РазвернутьДеревоМатериалов();
		РазвернутьДеревоТоваров();
		ОбновитьЭлементыФормы();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоСпецификацииНаСервере()
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	
	Объект.Материалы.Очистить();
	
	ВременнаяТаблица = Новый ТаблицаЗначений; //хранит общее количество необходимых материалов по спецификации после округления общего количества товаров
	ВременнаяТаблица.Колонки.Добавить("Номенклатура");
	ВременнаяТаблица.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ВременнаяТаблица.Колонки.Добавить("ОкруглятьВБольшуюСторону");
	ВременнаяТаблица.Колонки.Добавить("ПорядокОкругленияЧислом");
	ВременнаяТаблица.Колонки.Добавить("КоличествоДоОкругления");
	ВременнаяТаблица.Колонки.Добавить("КоличествоПослеОкругления");
	ВременнаяТаблица.Колонки.Добавить("УИСтроки");
	
	ТаблицаМатериалов = Новый ТаблицаЗначений;
	ТаблицаМатериалов.Колонки.Добавить("Комната");
	ТаблицаМатериалов.Колонки.Добавить("Номенклатура");
	ТаблицаМатериалов.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаМатериалов.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаМатериалов.Колонки.Добавить("Коэффициент");
	ТаблицаМатериалов.Колонки.Добавить("Количество");
	ТаблицаМатериалов.Колонки.Добавить("УИСтроки");

	Для Каждого ТекущаяСтрокаКомнаты Из Дерево.Строки Цикл
		Для Каждого ТекущаяСтрока Из ТекущаяСтрокаКомнаты.Строки Цикл
			НоваяСтрока = ТаблицаМатериалов.Добавить();
			НоваяСтрока.Комната = ТекущаяСтрока.Комната;
			Если НЕ ТекущаяСтрока.Спецификация.Пустая() Тогда
				Для Каждого СтрокаСпецификации Из ТекущаяСтрока.Спецификация.Состав Цикл
					КоэффициентИзменения = ?(СтрокаСпецификации.ФиксированноеКоличество, 1, ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент);
					КоличествоКДобавлению = ОбщийМодуль.ОкруглитьЧисло(КоэффициентИзменения * СтрокаСпецификации.Количество,СтрокаСпецификации.ПорядокОкругленияЧислом,СтрокаСпецификации.ОкруглятьВБольшуюСторону); 
					Если КоличествоКДобавлению > 0 Тогда
						НоваяСтрока = ТаблицаМатериалов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСпецификации);
						НоваяСтрока.Комната = ТекущаяСтрока.Комната;
						НоваяСтрока.Количество = КоличествоКДобавлению;
						НоваяСтрока.УИСтроки = ТекущаяСтрока.УИСтроки;
						
						НоваяВремСтрока = ВременнаяТаблица.Добавить();
						НоваяВремСтрока.Номенклатура = СтрокаСпецификации.Номенклатура;
						НоваяВремСтрока.ХарактеристикаНоменклатуры = СтрокаСпецификации.ХарактеристикаНоменклатуры;
						НоваяВремСтрока.ОкруглятьВБольшуюСторону = СтрокаСпецификации.ОкруглятьВБольшуюСторону;
						НоваяВремСтрока.ПорядокОкругленияЧислом = СтрокаСпецификации.ПорядокОкругленияЧислом;
						НоваяВремСтрока.КоличествоДоОкругления = КоэффициентИзменения * СтрокаСпецификации.Количество;
						НоваяВремСтрока.КоличествоПослеОкругления = 0;
						НоваяВремСтрока.УИСтроки = ТекущаяСтрока.УИСтроки;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаМатериалов.Свернуть("Комната, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, УИСтроки","Количество");
	ВременнаяТаблица.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ОкруглятьВБольшуюСторону, ПорядокОкругленияЧислом, УИСтроки", "КоличествоДоОкругления, КоличествоПослеОкругления");
	
	//посчитаем сколько какого материала должно быть итого с применением округления
	Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
		ТекущаяСтрока.КоличествоПослеОкругления = ОбщийМодуль.ОкруглитьЧисло(ТекущаяСтрока.КоличествоДоОкругления,ТекущаяСтрока.ПорядокОкругленияЧислом,ТекущаяСтрока.ОкруглятьВБольшуюСторону);
	КонецЦикла;
	
	//получаем итоговое количество каждого материала после всех округлений
	ВременнаяТаблица.Свернуть("Номенклатура, ХарактеристикаНоменклатуры", "КоличествоПослеОкругления");
	
	//перезаполняем количество в результирующей таблице на основании того, сколько должно было бы получиьтся при общем итоге после округления
	Для Каждого ТекущийМатериал Из ТаблицаМатериалов Цикл
		КоличествоБыло = ТекущийМатериал.Количество;
		ТекущийМатериал.Количество = 0;
		Для Каждого ТекущийИтогМатериала Из ВременнаяТаблица Цикл
			Если ТекущийМатериал.Номенклатура = ТекущийИтогМатериала.Номенклатура Тогда
				Если ТекущийИтогМатериала.КоличествоПослеОкругления >= КоличествоБыло Тогда
					ТекущийМатериал.Количество = КоличествоБыло;
					ТекущийИтогМатериала.КоличествоПослеОкругления = ТекущийИтогМатериала.КоличествоПослеОкругления - КоличествоБыло;
				Иначе
					ТекущийМатериал.Количество = ТекущийИтогМатериала.КоличествоПослеОкругления;
					ТекущийИтогМатериала.КоличествоПослеОкругления = 0;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла
	КонецЦикла;
	
	//переносим таблицу в документ
	Для Каждого ТекущийМатериал Из ТаблицаМатериалов Цикл
		Если НЕ ТекущийМатериал.Количество = 0 Тогда
			НоваяСтрока = Объект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийМатериал);
		КонецЕсли;
	КонецЦикла;
	
	ПерестроитьДеревоНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеМатериалов(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьМатериалыПоСпецификацииНаСервере();
	РазвернутьДеревоМатериалов();
	РазвернутьДеревоТоваров();
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровСпецификацияПриИзменении(Элемент)
		//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Сумма = 0;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораМатериала(ВыбЗнач, ДопПараметры) Экспорт
	Если НЕ ВыбЗнач = Неопределено Тогда
		ПослеВыбораМатериалаНаСервере(ВыбЗнач, ДопПараметры);
		ПеренестиДеревоВТабличнуюЧасть();
		РазвернутьДеревоМатериалов();
		ДобавленнаяСтрока = НайтиСтрокуДерева(ДеревоМатериалов, ДопПараметры, ВыбЗнач);
		Если НЕ ДобавленнаяСтрока = Неопределено Тогда
			Элементы.ДеревоМатериалов.ТекущаяСтрока = ДобавленнаяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораМатериалаНаСервере(ВыбЗнач, ДопПараметры)
	
	Дерево = ДанныеФормыВЗначение(ДеревоМатериалов, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Если Строка.Комната = ДопПараметры Тогда
			Стр = Строка.Строки.Добавить();
			Стр.Номенклатура = ВыбЗнач;
			Стр.Комната = ДопПараметры;			
			
			Стр.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Стр.Номенклатура);
			Стр.Коэффициент = 1;			
			Стр.Количество = 1;
			Стр.УИСтроки = Новый УникальныйИдентификатор;
			
			ЗначениеВДанныеФормы(Дерево, ДеревоМатериалов);
			Возврат;
		КонецЕсли
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВДругуюКомнату(Команда)
		
	ВыделенныеСтроки = Элементы.ДеревоТоваров.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выберите товар или услугу комнаты, который нужно скопировать");
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущаяСтрока из ВыделенныеСтроки Цикл
		СтрокаТЧ = ДеревоТоваров.НайтиПоИдентификатору(ТекущаяСтрока);
		
		Если СтрокаТЧ.Номенклатура.Пустая() Тогда
			ПоказатьПредупреждение(,"Выберите товар или услугу комнаты, который нужно скопировать");
			Возврат;
		КонецЕсли;
	
		ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(СтрокаТЧ.Номенклатура);
		Если ДанныеНоменклатуры.ЭтоУникальныйПотолок Тогда
			ПоказатьПредупреждение(,"Копирование потолков запрещено!");
			Возврат;
		КонецЕсли;
	КонецЦикла;	
	
	СписокКомнат = ОбщийМодульКлиент.ПолучитьСписокКомнатПоДереву(ДеревоТоваров);	
	ДопПараметры = Новый Структура;
	
	СкопироватьВДругуюКомнатуПодтверждение = Новый ОписаниеОповещения("СкопироватьВДругуюКомнатуПодтверждение", ЭтаФорма, ДопПараметры);
	СписокКомнат.ПоказатьВыборЭлемента(СкопироватьВДругуюКомнатуПодтверждение, "Выберите комнату");
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВДругуюКомнатуПодтверждение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКомнаты = Результат.Значение;
	Если ИмяКомнаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Неопределено;
	ЭлементыДерева = ДеревоТоваров.ПолучитьЭлементы();
	Для Каждого ТекЭлемент из ЭлементыДерева Цикл
		Если СокрЛП(ТекЭлемент.Комната) = СокрЛП(ИмяКомнаты) Тогда			
			ВыделенныеСтроки = Элементы.ДеревоТоваров.ВыделенныеСтроки;	
			Для каждого ТекущаяСтрока из ВыделенныеСтроки Цикл
				СтрокаТЧ = ДеревоТоваров.НайтиПоИдентификатору(ТекущаяСтрока);
				
				НоваяСтрока = ТекЭлемент.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , "Комната, УИСтроки");
				НоваяСтрока.Комната = ИмяКомнаты;
				НоваяСтрока.УИСтроки = Новый УникальныйИдентификатор;
				
				Если НЕ НоваяСтрока.Спецификация.Пустая() Тогда
				//	ПерезаполнитьМатериалыПоСпецификации(НоваяСтрока, , "ДобавлениеНоменклатуры");
				КонецЕсли;
			КонецЦикла;
			
			// на случай, если в комнате не было позиций
			ИдентификаторСтроки = ТекЭлемент.ПолучитьИдентификатор();
			Элементы.ДеревоТоваров.Развернуть(ИдентификаторСтроки);
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьМатериалыВДругуюКомнату(Команда)
		
	ВыделенныеСтроки = Элементы.ДеревоМатериалов.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выберите материалы, которые нужно скопировать");
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущаяСтрока из ВыделенныеСтроки Цикл
		СтрокаТЧ = ДеревоМатериалов.НайтиПоИдентификатору(ТекущаяСтрока);
		
		Если СтрокаТЧ.Номенклатура.Пустая() Тогда
			ПоказатьПредупреждение(,"Выберите материалы, которые нужно скопировать");
			Возврат;
		КонецЕсли;
	
		//ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(СтрокаТЧ.Номенклатура);
		//Если ДанныеНоменклатуры.ЭтоУникальныйПотолок Тогда
		//	ПоказатьПредупреждение(,"Копирование потолков запрещено!");
		//	Возврат;
		//КонецЕсли;
	КонецЦикла;	
	
	СписокКомнат = ОбщийМодульКлиент.ПолучитьСписокКомнатПоДереву(ДеревоТоваров);	
	ДопПараметры = Новый Структура;
	
	СкопироватьВДругуюКомнатуПодтверждение = Новый ОписаниеОповещения("СкопироватьМатериалыВДругуюКомнатуПодтверждение", ЭтаФорма, ДопПараметры);
	СписокКомнат.ПоказатьВыборЭлемента(СкопироватьВДругуюКомнатуПодтверждение, "Выберите комнату");
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьМатериалыВДругуюКомнатуПодтверждение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКомнаты = Результат.Значение;
	Если ИмяКомнаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Неопределено;
	ЭлементыДерева = ДеревоМатериалов.ПолучитьЭлементы();
	Для Каждого ТекЭлемент из ЭлементыДерева Цикл
		Если СокрЛП(ТекЭлемент.Комната) = СокрЛП(ИмяКомнаты) Тогда			
			ВыделенныеСтроки = Элементы.ДеревоМатериалов.ВыделенныеСтроки;	
			Для каждого ТекущаяСтрока из ВыделенныеСтроки Цикл
				СтрокаТЧ = ДеревоМатериалов.НайтиПоИдентификатору(ТекущаяСтрока);
				
				НоваяСтрока = ТекЭлемент.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , "Комната, УИСтроки, КоличествоВМонтажах");
				НоваяСтрока.Комната = ИмяКомнаты;
				НоваяСтрока.УИСтроки = Новый УникальныйИдентификатор;
			КонецЦикла;
			
			// на случай, если в комнате не было позиций
			ИдентификаторСтроки = ТекЭлемент.ПолучитьИдентификатор();
			Элементы.ДеревоМатериалов.Развернуть(ИдентификаторСтроки);
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПеренестиДеревоВТабличнуюЧасть();
	
	Если НоваяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы(Знач ТекущаяКомната = Неопределено, Знач ТекущаяНоменклатура = Неопределено)
	
	// обновим отображение деревьев
	РассчитатьИтогиПоКомнатам();
	
	Если НЕ Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено Тогда
		Если ТекущаяКомната = Неопределено Тогда
			ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
		КонецЕсли;
		Если ТекущаяНоменклатура = Неопределено Тогда
			ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	РазвернутьДеревоТоваров(ТекущаяКомната,ТекущаяНоменклатура);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатуры(ПозицияНоменклатуры)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ЭтоПотолок", Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ПозицияНоменклатуры));
	СтруктураОтвета.Вставить("ЭтоУникальныйПотолок", Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ПозицияНоменклатуры));
	СтруктураОтвета.Вставить("Потолок_КоличествоПродукция", ПозицияНоменклатуры.Потолок_КоличествоПродукция);
	Возврат СтруктураОтвета;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьИтоговыеПоказателиКлиент(ФормаТолькоПросмотр = Ложь) Экспорт
	//#7556
		
	ИтогСумма = 0;
	ИтогСуммаБезСкидки = 0;
	ИтогСуммаПоПрайсу = 0;
	ИтогСуммаНДС = 0;
	ИтогСуммаСкидки = 0;
	ИтогКоличествоКомнат = 0;
	
	ИтогКоличествоПотолков = 0; // реквизит формы
	ИтогПлощадьПотолков = 0; // реквизит формы
	
	ЭлементыДерева = ДеревоТоваров.ПолучитьЭлементы();
	ИтогКоличествоКомнат = ЭлементыДерева.Количество();
	
	Для Каждого СтрокаКомнаты из ЭлементыДерева Цикл
		
		СуммаПоКомнате = 0;
		СуммаПоПрайсуКомнате = 0;
		ИтогБесплатноПоКомнате = 0;
		ИтогПлатноПоКомнате = 0;
		
		Для Каждого СтрокаТовара Из СтрокаКомнаты.ПолучитьЭлементы() Цикл
			ИтогСумма = ИтогСумма + СтрокаТовара.Сумма;
			ИтогСуммаБезСкидки = ИтогСуммаБезСкидки + СтрокаТовара.Количество * СтрокаТовара.Цена;
			ИтогСуммаПоПрайсу = ИтогСуммаПоПрайсу + СтрокаТовара.СуммаПоПрайсу;
			ИтогСуммаНДС = ИтогСуммаНДС + СтрокаТовара.СуммаНДС;
			ИтогСуммаСкидки = ИтогСуммаСкидки + СтрокаТовара.СуммаСкидки;			
			Если ЗначениеЗаполнено(СтрокаТовара.Номенклатура) И ОбщийМодульВызовСервера.ЭтоНоменклатураПотолкаРозницы(СтрокаТовара.Номенклатура) Тогда
				ИтогКоличествоПотолков = ИтогКоличествоПотолков + 1; 
				ИтогПлощадьПотолков = ИтогПлощадьПотолков + СтрокаТовара.Количество;	
			КонецЕсли;
			
			СуммаПоКомнате = СуммаПоКомнате + СтрокаТовара.Сумма;
			СуммаПоПрайсуКомнате = СуммаПоПрайсуКомнате + СтрокаТовара.СуммаПоПрайсу;			
			ИтогБесплатноПоКомнате = ИтогБесплатноПоКомнате + ?(СтрокаТовара.Бесплатно, 1, 0);
			ИтогПлатноПоКомнате    = ИтогПлатноПоКомнате    + ?(СтрокаТовара.Бесплатно, 0, 1);
		КонецЦикла;
		
		СтрокаКомнаты.Сумма = СуммаПоКомнате;
		СтрокаКомнаты.СуммаПоПрайсу = СуммаПоПрайсуКомнате;
		СтрокаКомнаты.Бесплатно = (ИтогБесплатноПоКомнате > 0 И ИтогПлатноПоКомнате = 0);
	КонецЦикла;
	ИтогОтклонениеОтПрайса = ИтогСумма - ИтогСуммаПоПрайсу; //как в отчете по эффективностям
	
	Если НЕ ФормаТолькоПросмотр Тогда
		//Если Объект.КоличествоКомнат <> ИтогКоличествоКомнат Тогда
		//	Объект.КоличествоКомнат = ИтогКоличествоКомнат;
		//	Модифицированность = Истина;
		//КонецЕсли;
		
		Если Объект.СуммаДокумента <> ИтогСумма Тогда
			Объект.СуммаДокумента = ИтогСумма;
			Модифицированность = Истина;
		КонецЕсли;
		Если Объект.СуммаДокументаПоПрайсу <> ИтогСуммаПоПрайсу Тогда
			Объект.СуммаДокументаПоПрайсу = ИтогСуммаПоПрайсу;
			Модифицированность = Истина;
		КонецЕсли;
		//Если Объект.ОтклонениеОтПрайса <> ИтогОтклонениеОтПрайса Тогда
		//	Объект.ОтклонениеОтПрайса = ИтогОтклонениеОтПрайса;
		//	Модифицированность = Истина;
		//КонецЕсли;
		//Если Объект.СуммаСкидки <> ИтогСуммаСкидки Тогда
		//	Объект.СуммаСкидки = ИтогСуммаСкидки;
		//	Объект.ПроцентСкидки = ИтогСуммаСкидки;
		//	Если ИтогСуммаБезСкидки <> 0 Тогда
		//		Объект.ПроцентСкидки = Окр(100*ИтогСуммаСкидки / (ИтогСуммаБезСкидки), 2);
		//	Иначе
		//		Объект.ПроцентСкидки = 0;
		//	КонецЕсли;
		//	Модифицированность = Истина;
		//КонецЕсли;
	КонецЕсли;

	СуммаНДС = ИтогСуммаНДС;	
	//Если УчитыватьНДС Тогда
	//	Элементы.ИтогиВсегоНДС.Заголовок = Формат(ИтогСуммаНДС, "ЧРГ=; ЧН=0,00");
	//КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонструкцию(Команда)
	
	ПараметрыФормы = Новый Структура("РежимДобавленияКонструкции", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаДанныхПродукцииПоВиду", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаДобавленияПродукцииПоВиду", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

//++16633
&НаКлиенте
Процедура ДобавитьСопутствующиеТовары(Команда)
	
	СопутствующиеТоварыКлиент.ОткрытьФормуПодбора(ЭтотОбъект);
	// Обработка ответа формы на ОбработкаВыбораСопутствующейНомеклатурыНаКлиенте
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровХарактеристикаНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	// Если характеристика фактически не изменилась тогда ничего не делаем
	Если  СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры <> ВыбранноеЗначение Тогда
		Если СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги	Тогда
			МассивСопутствующихТоваровНаУдаление = ОбщийМодульКлиент.ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(Элементы.ДеревоТоваров, ДеревоТоваров);
			Если МассивСопутствующихТоваровНаУдаление.Количество() > 0 Тогда 		
				Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииНоменклатуры Тогда
					ДопПараметры = Новый Структура;
					ДопПараметры.Вставить("МассивСопутствующихТоваровНаУдаление", МассивСопутствующихТоваровНаУдаление);
					ДопПараметры.Вставить("СтрокаХарактеристикиТабличнойЧасти", СтрокаТабличнойЧасти);
					ПоказатьВопрос(Новый ОписаниеОповещения("ВопросУдалениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Удалить сопутствующие товары и услуги" + Символы.ПС + "измененной номенклатуры """ + СтрокаТабличнойЧасти.Номенклатура + """" +  ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры), Символы.ПС + "Характеристика """ + СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры + """", "") + "?", РежимДиалогаВопрос.ДаНет);			
					СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ВыбранноеЗначение;
					СтандартнаяОбработка = Ложь;
				Иначе
					ОбщийМодульКлиент.УдалитьСопутствующиеТовары(ДеревоТоваров, МассивСопутствующихТоваровНаУдаление);
					МассивСопутствующихТоваровНаУдаление.Очистить();
					РассчитатьИтоговыеПоказателиКлиент();
				КонецЕсли;
			Иначе
				СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ВыбранноеЗначение;
				ДеревоТоваровХарактеристикаНоменклатурыПриИзменении(СтрокаТабличнойЧасти);
				СтандартнаяОбработка = Ложь;	
			КонецЕсли;
		Иначе
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ВыбранноеЗначение;
			ДеревоТоваровХарактеристикаНоменклатурыПриИзменении(СтрокаТабличнойЧасти);
			СтандартнаяОбработка = Ложь;	
		КонецЕсли;	
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровХарактеристикаНоменклатурыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	// Необходимо для обработки выбора пустого значения.
	Если ПараметрыПолученияДанных.СтрокаПоиска="" И НЕ СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка")  Тогда
		Элементы.ДеревоТоваров.ЗакончитьРедактированиеСтроки (Ложь); 
		ДеревоТоваровХарактеристикаНоменклатурыОбработкаВыбора(Элемент, ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"), СтандартнаяОбработка);
		//СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	
	// Если номенклатура фактически не изменилась тогда ничего не делаем
	Если  СтрокаТабличнойЧасти.Номенклатура = ВыбранноеЗначение Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
	
	Если СтруктураДействийПоСТ.АвтоматическиДобавлятьСопутствующиеТоварыИУслуги	Тогда
		МассивСопутствующихТоваровНаУдаление = ОбщийМодульКлиент.ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(Элементы.ДеревоТоваров, ДеревоТоваров);
		Если МассивСопутствующихТоваровНаУдаление.Количество() > 0 Тогда 
			Если СтруктураДействийПоСТ.ЗапрашиватьПодтверждениеПриИзмененииНоменклатуры Тогда
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("МассивСопутствующихТоваровНаУдаление", МассивСопутствующихТоваровНаУдаление);
				ДопПараметры.Вставить("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти);
				ПоказатьВопрос(Новый ОписаниеОповещения("ВопросУдалениеСопутствующейНоменклатуры", ЭтотОбъект, ДопПараметры), "Удалить сопутствующие товары и услуги" + Символы.ПС + "измененной номенклатуры """ + СтрокаТабличнойЧасти.Номенклатура + """" +  ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры), Символы.ПС + "Характеристика """ + СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры + """", "") + "?", РежимДиалогаВопрос.ДаНет);			
				СтрокаТабличнойЧасти.Номенклатура = ВыбранноеЗначение;
				СтандартнаяОбработка = Ложь;
			Иначе
				ОбщийМодульКлиент.УдалитьСопутствующиеТовары(ДеревоТоваров, МассивСопутствующихТоваровНаУдаление);
				МассивСопутствующихТоваровНаУдаление.Очистить();
				РассчитатьИтоговыеПоказателиКлиент();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
//--16633




