
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Замеры
	Если НЕ Результат = Справочники.РезультатыЗамера.ОтказПоЗвонку Тогда
		Попытка
			Движения.Замеры.Записывать = Истина;
			Движение = Движения.Замеры.Добавить();
			Движение.Дата = ДатаЗамера;
			Движение.Сотрудник = Исполнитель;
			Движение.ВремяНачала = ВремяНачалаЗамера;
			Движение.ВремяОкончания = ВремяОкончанияЗамера;
			Движение.Замер = Ссылка;
			Движение.ИмяКлиента = ИмяКлиента;
			Движение.Адрес = Адрес;
			Движение.Результат = Результат;
			Движение.ДокументЗамер = Ссылка;
		Исключение
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	//++ №10986 комментируем, т.к. теперь данные берутся напрямую из регистра "Замеры"
	//// регистр КонверсияВходящихКонтактов 
	//Если Результат = Справочники.РезультатыЗамера.ЗаключениеДоговора Тогда
	//	Если НЕ Основание = Неопределено Тогда
	//		Если НЕ Основание.Пустая() Тогда
	//			Если ТипЗнч(Основание) = ТипЗнч(Документы.ВходящийКонтакт.ПустаяСсылка()) Тогда
	//				Движения.КонверсияВходящихКонтактов.Записывать = Истина;
	//				Движение = Движения.КонверсияВходящихКонтактов.Добавить();
	//				Движение.Период = Дата;
	//				Движение.Контакт = Основание;
	//				Движение.РекламныйИсточник = Основание.РекламныйИсточник;
	//				Движение.ТочкаПродаж = Основание.ТочкаПродаж;
	//				Движение.КоличествоЗамеров = 1;
	//				Движение.КоличествоЗамеровУспех = 1;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//ИначеЕсли Результат = Справочники.РезультатыЗамера.ОтказНаЗамере Тогда
	//	Если НЕ Основание = Неопределено Тогда
	//		Если НЕ Основание.Пустая() Тогда
	//			Если ТипЗнч(Основание) = ТипЗнч(Документы.ВходящийКонтакт.ПустаяСсылка()) Тогда
	//				Движения.КонверсияВходящихКонтактов.Записывать = Истина;
	//				Движение = Движения.КонверсияВходящихКонтактов.Добавить();
	//				Движение.Период = Дата;
	//				Движение.Контакт = Основание;
	//				Движение.РекламныйИсточник = Основание.РекламныйИсточник;
	//				Движение.ТочкаПродаж = Основание.ТочкаПродаж;
	//				Движение.КоличествоЗамеров = 1;
	//				Движение.КоличествоЗамеровОтказ = 1;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//ИначеЕсли НЕ Результат = Справочники.РезультатыЗамера.ОтказПоЗвонку Тогда
	//	Если НЕ Основание = Неопределено Тогда
	//		Если НЕ Основание.Пустая() Тогда
	//			Если ТипЗнч(Основание) = ТипЗнч(Документы.ВходящийКонтакт.ПустаяСсылка()) Тогда
	//				Движения.КонверсияВходящихКонтактов.Записывать = Истина;
	//				Движение = Движения.КонверсияВходящихКонтактов.Добавить();
	//				Движение.Период = Дата;
	//				Движение.Контакт = Основание;
	//				Движение.РекламныйИсточник = Основание.РекламныйИсточник;
	//				Движение.ТочкаПродаж = Основание.ТочкаПродаж;
	//				Движение.КоличествоЗамеров = 1;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//-- №10986

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 	
	
	//Отправка E-mail замерщику
	Если Результат = Справочники.РезультатыЗамера.ПустаяСсылка() и не Исполнитель = справочники.Сотрудники.ПустаяСсылка() и Константы.ОтправлятьEmailЗамерщикуПриПланированииЗамера.Получить() Тогда 
		Если не ПустаяСтрока(Исполнитель.УДАЛИТЬ_ОсновнойEMail) Тогда 
			ЗаголовокНовогоПисьма = "Запланирован замер. Клиент: " + ИмяКлиента + ", Адрес: " + Адрес;
			ПисьмоОтправленное = Документы.ЭлектронноеПисьмо.НайтиПоРеквизиту("Основание",Ссылка);
			Если ПисьмоОтправленное = Документы.ЭлектронноеПисьмо.ПустаяСсылка() Тогда 
				ТекстПисьма = "Вам назначен замер.
				| Клиент: " + ИмяКлиента + "
				| Телефон: " + СотовыйТелефонКлиента + "
				| Адрес: " + Адрес + "
				| Дата замера: " + Формат(ДатаЗамера,"ДЛФ=DD") + " в " + Формат(ВремяНачалаЗамера,"ДФ=Ч:мм") + " ч.";
				
				НовоеПисьмо = РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмо(ЗаголовокНовогоПисьма,Исполнитель, ТекстПисьма, Ссылка);
				
				Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(НовоеПисьмо);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



