
#Область ПрограммныйИнтерфейс

// Определяет количество элементов для заданного типа значений
//
// Параметры:
//   ТипЗначения     - Тип - Тип значения, для которого выполняется расчет
//   ПараметрыВыбора - ФиксированныйМассив - Фиксированный массив из элементов типа ПараметрВыбора
//
// Возвращаемое значение: 
//   * Число         - Количество элементов заданного типа
//
Функция ОпределитьКоличествоЭлементов(ТипЗначения, ПараметрыВыбора = Неопределено) Экспорт
	
	Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
		Ссылка = Новый(ТипЗначения);
		МетаданныеОбъекта = Ссылка.Метаданные();
		Возврат МетаданныеОбъекта.ЗначенияПеречисления.Количество();
	Иначе
		ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Новый(ТипЗначения));
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	%1 КАК Объект",
		ИмяТаблицы);
		Если НЕ ПараметрыВыбора=Неопределено И ПараметрыВыбора.Количество()>0 Тогда
			Условия = "";
			Для каждого Параметр Из ПараметрыВыбора Цикл
				Если Найти(Параметр.Имя, "Отбор.")=0 Тогда
					Продолжить;
				КонецЕсли; 
				Если ТипЗнч(ПараметрыВыбора)=Тип("ПараметрыВыбораКомпоновкиДанных") Тогда
					Индекс = ПараметрыВыбора.Индекс(Параметр);
				ИначеЕсли ТипЗнч(ПараметрыВыбора)=Тип("Массив") Тогда 
					Индекс = ПараметрыВыбора.Найти(Параметр);
				Иначе
					Продолжить;
				КонецЕсли;
				ИмяРеквизита = СтрЗаменить(Параметр.Имя, "Отбор.", "");
				Если МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита)=Неопределено И НЕ СуществуетСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ИмяРеквизита) Тогда
					Продолжить;
				КонецЕсли; 
				Условия = Условия+
				?(ПустаяСтрока(Условия), "ГДЕ ", Символы.ПС+"	И")+
				" Объект."+ИмяРеквизита+
				?(ТипЗнч(Параметр.Значение)=Тип("СписокЗначений") ИЛИ ТипЗнч(Параметр.Значение)=Тип("ФиксированныйМассив"), " В (&Значение"+Индекс+")", " = &Значение"+Индекс);
				Если ТипЗнч(Параметр.Значение)=Тип("СписокЗначений") Тогда
					ЗначениеПараметра = Параметр.Значение.ВыгрузитьЗначения();
				ИначеЕсли ТипЗнч(Параметр.Значение)=Тип("ФиксированныйМассив") Тогда
					ЗначениеПараметра = Новый Массив(Параметр.Значение);
				Иначе
					ЗначениеПараметра = Параметр.Значение;
				КонецЕсли; 
				Запрос.УстановитьПараметр("Значение"+Индекс, ЗначениеПараметра);
			КонецЦикла; 
			Если НЕ ПустаяСтрока(Условия) Тогда
				Запрос.Текст = Запрос.Текст+Символы.ПС+Условия;
			КонецЕсли; 
		КонецЕсли; 
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат ?(Выборка.Количество=Null, 0, Выборка.Количество);
		Иначе
			Возврат 0;
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции

// Возвращает список элементов заданного типа с учетом параметров выбора
//
// Параметры:
//   ТипЗначения     - Тип - Тип значения, для которого выполняется выборка элементов
//   ПараметрыВыбора - ФиксированныйМассив - Фиксированный массив из элементов типа ПараметрВыбора
//
// Возвращаемое значение: 
//   * Массив        - Массив элементов заданного типа
//
Функция ПолучитьСписокЭлементов(ТипЗначения, ПараметрыВыбора) Экспорт
	
	Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
		Ссылка = Новый(ТипЗначения);
		МетаданныеОбъекта = Ссылка.Метаданные();
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
		МассивЗначений = Новый Массив;
		Для каждого Значение Из МетаданныеОбъекта.ЗначенияПеречисления Цикл
			МассивЗначений.Добавить(МенеджерОбъекта[Значение.Имя]);
		КонецЦикла; 
		Возврат МассивЗначений;
	Иначе
		ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Новый(ТипЗначения));
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Объект.Ссылка КАК Ссылка
		|ИЗ
		|	%1 КАК Объект",
		ИмяТаблицы);
		Если НЕ ПараметрыВыбора=Неопределено И ПараметрыВыбора.Количество()>0 Тогда
			Условия = "";
			Для каждого Параметр Из ПараметрыВыбора Цикл
				Если Найти(Параметр.Имя, "Отбор.")=0 Тогда
					Продолжить;
				КонецЕсли; 
				Если ТипЗнч(ПараметрыВыбора)=Тип("ПараметрыВыбораКомпоновкиДанных") Тогда
					Индекс = ПараметрыВыбора.Индекс(Параметр);
				ИначеЕсли ТипЗнч(ПараметрыВыбора)=Тип("Массив") Тогда 
					Индекс = ПараметрыВыбора.Найти(Параметр);
				Иначе
					Продолжить;
				КонецЕсли; 
				ИмяРеквизита = СтрЗаменить(Параметр.Имя, "Отбор.", "");
				Если МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита)=Неопределено И НЕ СуществуетСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ИмяРеквизита) Тогда
					Продолжить;
				КонецЕсли; 
				Условия = Условия+
				?(ПустаяСтрока(Условия), "ГДЕ ", Символы.ПС+"	И")+
				" Объект."+ИмяРеквизита+
				?(ТипЗнч(Параметр.Значение)=Тип("СписокЗначений") ИЛИ ТипЗнч(Параметр.Значение)=Тип("ФиксированныйМассив"), " В (&Значение"+Индекс+")", " = &Значение"+Индекс);
				Если ТипЗнч(Параметр.Значение)=Тип("СписокЗначений") Тогда
					ЗначениеПараметра = Параметр.Значение.ВыгрузитьЗначения();
				ИначеЕсли ТипЗнч(Параметр.Значение)=Тип("ФиксированныйМассив") Тогда
					ЗначениеПараметра = Новый Массив(Параметр.Значение);
				Иначе
					ЗначениеПараметра = Параметр.Значение;
				КонецЕсли; 
				Запрос.УстановитьПараметр("Значение"+Индекс, ЗначениеПараметра);
			КонецЦикла; 
			Если НЕ ПустаяСтрока(Условия) Тогда
				Запрос.Текст = Запрос.Текст+Символы.ПС+Условия;
			КонецЕсли; 
		КонецЕсли;
		Запрос.Текст = Запрос.Текст+Символы.ПС+"АВТОУПОРЯДОЧИВАНИЕ";
		ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
		Если ТаблицаЗначений.Количество()>0 Тогда
			Возврат ТаблицаЗначений.ВыгрузитьКолонку("Ссылка");
		Иначе
			Возврат Новый Массив;
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции

// Возвращает строку списка ширин фактуры
//
// Параметры:
//   МатериалФактуры     - Строка - Строка название материала фактуры
//
// Возвращаемое значение: 
//   * Строка        - Строка со списком ширин фактуры
//
Функция ПолучитьСтрокуСпискаШиринФактуры(МатериалФактуры, ЦветФактуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Фактура.ШиринаПолотна КАК ШиринаПолотна
		|ИЗ
		|	Справочник.ЦветФактуры КАК ЦветФактуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Фактура КАК Фактура
		|		ПО ЦветФактуры.Владелец = Фактура.Ссылка
		|ГДЕ
		|	(ВЫРАЗИТЬ(Фактура.Материал КАК СТРОКА(100))) = &Материал
		|	И НЕ Фактура.ПометкаУдаления
		|	И НЕ ЦветФактуры.ПометкаУдаления
		|	И (ВЫРАЗИТЬ(ЦветФактуры.Наименование КАК СТРОКА(100))) = &ЦветФактуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	ШиринаПолотна";
	
	Запрос.УстановитьПараметр("Материал", МатериалФактуры);
	Запрос.УстановитьПараметр("ЦветФактуры", ЦветФактуры);
	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	
	Если ТЗРезультат.Количество() > 0 Тогда
		МассивШирин = ТЗРезультат.ВыгрузитьКолонку("ШиринаПолотна");
		Возврат СтрСоединить(МассивШирин, " /"); 
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция СтроковоеПредставлениеПериодаПоНомеруНедели(НомерНедели, ДатаНач, ДатаКон, ВыводитьНомерНедели = Ложь) Экспорт
   
   ИсходнаяДата = НачалоНедели(НачалоГода(ДатаНач));
   
   Запрос = Новый Запрос();
   Запрос.Текст =
   "ВЫБРАТЬ
   |	ДОБАВИТЬКДАТЕ(&ИсходнаяДата, НЕДЕЛЯ, &НомерНедели - 1) КАК ДатаНачалоНедели,
   |	ДОБАВИТЬКДАТЕ(&ИсходнаяДата, НЕДЕЛЯ, &НомерНедели) КАК ДатаКонецНедели";
   
   Запрос.УстановитьПараметр("ИсходнаяДата", ИсходнаяДата);
   Запрос.УстановитьПараметр("НомерНедели", Число(НомерНедели));
   Выборка = Запрос.Выполнить().Выбрать();
   Выборка.Следующий();
   
   Если Выборка.ДатаНачалоНедели < ДатаНач Тогда
	   ДатаНачалоНедели = ДатаНач;
   Иначе
	   ДатаНачалоНедели = Выборка.ДатаНачалоНедели;
   КонецЕсли;
   
   Если Выборка.ДатаКонецНедели > ДатаКон Тогда
	   ДатаКонецНедели = ДатаКон;
   Иначе
	   ДатаКонецНедели = Выборка.ДатаКонецНедели;
   КонецЕсли;
   
   Если ВыводитьНомерНедели Тогда
	   СтроковоеПредставлениеНедели = "Неделя " + Формат(НомерНедели, "ЧЦ=2; ЧДЦ=0; ЧВН=") + " 
	   |" + Формат(ДатаНачалоНедели, "ДФ=dd.MM.yyyy") + " - " + Формат(ДатаКонецНедели, "ДФ=dd.MM.yyyy");
   Иначе
	   СтроковоеПредставлениеНедели = Формат(ДатаНачалоНедели, "ДФ=dd.MM.yyyy") + " - " + Формат(ДатаКонецНедели, "ДФ=dd.MM.yyyy");
   КонецЕсли;
   
   Возврат СтроковоеПредставлениеНедели;
   
КонецФункции

Функция СуществуетСтандартныйРеквизит(СтандартныеРеквизиты, Имя)
	
	Для каждого СтандартныйРеквизит Из СтандартныеРеквизиты Цикл
		Если СтандартныйРеквизит.Имя=Имя Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#Область ФиксированныеСтроки

Функция ПредставлениеУдаляемойНастройки()
	
	Возврат "УдалитьПослеФормирования";	
	
КонецФункции

#КонецОбласти

#КонецОбласти

