//#7426

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сотрудник") Тогда
		Сотрудник = Параметры.Сотрудник;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидНачисления") Тогда
		ВидНачисления = Параметры.ВидНачисления;
	КонецЕсли; 
	
	Если Параметры.Свойство("Валюта") Тогда
		Валюта = Параметры.Валюта;
	КонецЕсли;
	
	УправлениеФормой();
	
	// №12788 комментируем ЗаполнитьСуммуНаСервере();

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ОбъектВыработки.Доступность = ЗначениеЗаполнено(ВидНачисления);

КонецПроцедуры

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ВидНачисления) Тогда
		ОбъектВыработки = Неопределено;
	КонецЕсли;
	УправлениеФормой();
	
	// №12788 комментируем ЗаполнитьСуммуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	// №12788 комментируем ЗаполнитьСуммуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкиПриИзменении(Элемент)
	// №12788 комментируем ЗаполнитьСуммуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Выработка.Сотрудник КАК Сотрудник,
	|	Выработка.СтоимостьОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Выработка
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейРозницы.Обороты(
	|			,
	|			,
	|			,
	|			Сотрудник = &Сотрудник
	|				И ВидНачисления = &ВидНачисления
	|				И (ОбъектВыработки = &ОбъектВыработки ИЛИ &ОбъектВыработки = Неопределено)) КАК Выработка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Выработка.Сотрудник,
	|	Выработка.СтоимостьОборот
	|ИЗ
	|	РегистрНакопления.ВыработкаИсполнителейПроизводства.Обороты(
	|			,
	|			,
	|			,
	|			Сотрудник = &Сотрудник
	|				И ВидНачисления = &ВидНачисления
	|				И (ОбъектВыработки = &ОбъектВыработки ИЛИ &ОбъектВыработки = Неопределено)) КАК Выработка
	|
	//++ №14125 комментируем, т.к. регистр больше не используется
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	Выработка.Сотрудник,
	//|	-Выработка.СуммаОборот
	//|ИЗ
	//|	РегистрНакопления.ОтветственностьЗаБракиНаПроизводстве.Обороты(, , Регистратор, Сотрудник = &Сотрудник) КАК Выработка
	//|ГДЕ
	//|	&ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ШтрафЗаБрак)
	//|	И Выработка.Регистратор = &ОбъектВыработки
	//-- №14125
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Выработка.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ_Выработка.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_Выработка КАК ВТ_Выработка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Выработка.Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", 		Сотрудник);	
	Запрос.УстановитьПараметр("ВидНачисления", 	ВидНачисления);
	Запрос.УстановитьПараметр("ОбъектВыработки", ?(ЗначениеЗаполнено(ОбъектВыработки), ОбъектВыработки, Неопределено));
		
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		Сумма = Выборка.Сумма;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура Добавить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		Сообщить("Не заполнено поле ""Сотрудник""!");
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сумма) Тогда
		Сообщить("Не заполнено поле ""Сумма""!");
		Возврат;	
	КонецЕсли;
	
	Закрыть(Новый Структура("Сотрудник, Валюта, ВидНачисления, ОбъектВыработки, Сумма", Сотрудник, Валюта, ВидНачисления, ОбъектВыработки, Сумма));
	
КонецПроцедуры

