&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если сервер 1С запущен на ОС Linux, то обмен через COM-соединение не поддерживается.
	Если ОбщегоНазначения.ЭтоLinuxСервер() Тогда
		Элементы.СписокСоздатьНастройкуСинхронизации.Доступность = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоБазаПроизводства") Тогда
		Элементы.СписокСоздатьНастройкуСинхронизации.Доступность = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтоБазаПроизводства", Истина, , , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтоБазаПроизводства", Ложь, , , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуСинхронизации(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьНастройкуСинхронизацииЗавершение", ЭтотОбъект);
	ФормаНовойСинхронизацииДанных = "ПланОбмена.ОбменБазаПроизводстваБазаРозницы.Форма.НоваяСинхронизацияДанных";	
	ОткрытьФорму(ФормаНовойСинхронизацииДанных, , , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуСинхронизацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
