Функция ОтправитьЗадачуПоКомлиниям(Объект) Экспорт
	
	Если Объект.ПостАвтора.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_АдресацияЗадачПланаДействий.Пост,
		               |	ИА_АдресацияЗадачПланаДействий.Пост.ТипТерминала.Порядок КАК Порядок
		               |ИЗ
		               |	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
		               |ГДЕ
		               |	ИА_АдресацияЗадачПланаДействий.Пользователь = &Пользователь
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ИА_АдресацияЗадачПланаДействий.Пост.ТипТерминала.Порядок";
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		МойПост = Неопределено;
		
		Если Выборка.Следующий() Тогда
			МойПост = Выборка.Пост;
		КонецЕсли;
		
		Если МойПост = Неопределено Тогда
			Сообщить("Ваш пост не обозначен в адресации комцентра!");
			Возврат ложь;
		КонецЕсли;
	Иначе
		МойПост = Объект.ПостАвтора;
	КонецЕсли;
	
	// составим массивы руководителей
	МассивРукАдресата = Новый массив;
	МассивРукАдресата.Добавить(Объект.Пост);
	ТекРук = Объект.Пост.Родитель;
	Пока не ТекРук.Пустая() Цикл
		МассивРукАдресата.Добавить(ТекРук);
		ТекРук = ТекРук.Родитель;
	КонецЦикла;
	
	МассивРукМои = Новый массив;
	МассивРукМои.Добавить(МойПост);
	ТекРук = МойПост.Родитель;
	Пока не ТекРук.Пустая() Цикл
		МассивРукМои.Добавить(ТекРук);
		ТекРук = ТекРук.Родитель;
	КонецЦикла;
	
	// найдем общего руководителя
	ОбщийРук = Неопределено;
	Для каждого терминал из МассивРукАдресата Цикл
		Если МассивРукМои.Найти(терминал)<>Неопределено Тогда
			ОбщийРук = терминал;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщийРук = Неопределено Тогда
		Сообщить("У Вас нет общего руководителя!");
		Возврат ложь;
	КонецЕсли;
	
	// обозначим путь по моей линии и добавим в маршрут
	ТекТерминал = МойПост;
	
	Пока ТекТерминал <> ОбщийРук Цикл		
		Если ПолучитьКоличествоПользователейНаПосту(ТекТерминал) = 0 Тогда // пропускаем пустые терминалы
			ТекТерминал = ТекТерминал.Родитель;
			Если ТекТерминал = ОбщийРук Тогда // если уже выше некуда
				Пока ПолучитьКоличествоПользователейНаПосту(ТекТерминал) = 0 и ТекТерминал.Родитель.ТипТерминала<>Перечисления.ТипТерминалаОргСхемы.Организация Цикл // найдем хоть кого-то с руководителем (сотрудником)
					ТекТерминал = ТекТерминал.Родитель;
					ОбщийРук = ТекТерминал;
				КонецЦикла;
				
				НовЗап = Объект.Маршрут.Добавить();
				НовЗап.Пост = ТекТерминал;		
				Прервать;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		НовЗап = Объект.Маршрут.Добавить();
		НовЗап.Пост = ТекТерминал;		
		ТекТерминал = ТекТерминал.Родитель;
	КонецЦикла;
	//
	
	// обозначим путь по линии адресата и добавим в маршрут
	МассивМаршрут = Новый Массив;
	ТекТерминал = Объект.Пост;
	Пока ТекТерминал <> ОбщийРук Цикл
		Если ПолучитьКоличествоПользователейНаПосту(ТекТерминал) = 0 Тогда // пропускаем пустые терминалы
			ТекТерминал = ТекТерминал.Родитель;
			Продолжить;
		КонецЕсли;
		
		МассивМаршрут.Добавить(ТекТерминал);
		ТекТерминал = ТекТерминал.Родитель;
	КонецЦикла;
	
	сч = МассивМаршрут.Количество()-1;
	Пока сч >= 0 Цикл
		НовЗап = Объект.Маршрут.Добавить();
		НовЗап.Пост = МассивМаршрут[сч];
		сч = сч - 1;
	КонецЦикла;
	//
	
	// если учредитель
	Если Объект.Пост = ОбщийРук ИЛИ МойПост = ОбщийРук Тогда
		Если МойПост = ОбщийРук Тогда
			НовЗап = Объект.Маршрут.Вставить(0);
			НовЗап.Пост = ОбщийРук;
			Новзап.ВсеВерно = Истина;
			Новзап.ДатаПодтверждения = ТекущаяДата();
		Иначе
			НовЗап = Объект.Маршрут.Добавить();
			НовЗап.Пост = ОбщийРук;
		КонецЕсли;
	КонецЕсли;
	
	Объект.ПостАвтора = МойПост;                
	
	КолШагов = Объект.Маршрут.Количество();
	
	Если КолШагов>1 Тогда
		Объект.Маршрут[0].ВсеВерно = Истина;
		Объект.Маршрут[0].ДатаПодтверждения = ТекущаяДата();
		
		// сразу утвердим на всех моих постах
		сч = 1;
		ПервыйНаУтверждение = Неопределено;
		Пока сч < КолШагов Цикл
			Если ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПользовательНаПосту(ПараметрыСеанса.ТекущийПользователь, Объект.Маршрут[сч].Пост) Тогда
				Объект.Маршрут[сч].ВсеВерно = Истина;
				Объект.Маршрут[сч].ДатаПодтверждения = ТекущаяДата();
			ИначеЕсли ПервыйНаУтверждение = Неопределено тогда
				ПервыйНаУтверждение = сч;
			КонецЕсли;
			сч = сч + 1;
		КонецЦикла;
		//
		// идем дальше по утверждению
		Если ПервыйНаУтверждение = Неопределено Тогда
			Объект.Пост = Объект.Маршрут[сч-1].Пост; 
		Иначе
			Объект.Пост = Объект.Маршрут[ПервыйНаУтверждение].Пост; 
		КонецЕсли;
		
		Объект.ПоКомлиниям = Истина;
		Объект.Маршрут[КолШагов-1].Пользователь = Объект.Пользователь;
		Объект.Пользователь = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Сообщить("У вас нет командных линий с указанным постом!");
		Возврат ложь;
	КонецЕсли;
	
	Возврат истина;
КонецФункции

//Арчил Тваладзе 29.05.2016   
Функция ПолучитьКоличествоПользователейНаПосту(пПост) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОргСхемаСотрудники.ФизЛицо,
		|	ИА_ДанныеФизЛиц.Пользователь
		|ПОМЕСТИТЬ ВТПостыДанныеФизлиц
		|ИЗ
		|	Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
		|		ПО ОргСхемаСотрудники.ФизЛицо = ИА_ДанныеФизЛиц.ФизЛицо
		|ГДЕ
		|	ОргСхемаСотрудники.Ссылка = &Пост
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПостыДанныеФизлиц.ФизЛицо,
		|	ВТПостыДанныеФизлиц.Пользователь
		|ИЗ
		|	ВТПостыДанныеФизлиц КАК ВТПостыДанныеФизлиц
		|ГДЕ
		|	ВТПостыДанныеФизлиц.Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И НЕ ВТПостыДанныеФизлиц.Пользователь ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПостыДанныеФизлиц.ФизЛицо,
		|	ВТПостыДанныеФизлиц.Пользователь";
		
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ИА_АдресацияЗадачПланаДействий.Пользователь,
	//	|	ИА_АдресацияЗадачПланаДействий.Пост
	//	|ИЗ
	//	|	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	//	|ГДЕ
	//	|	ИА_АдресацияЗадачПланаДействий.Пользователь <> Значение(Справочник.Пользователи.ПустаяСсылка)
	//	|	И ИА_АдресацияЗадачПланаДействий.Пост = &Пост";
	
	Запрос.УстановитьПараметр("Пост", пПост);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество();
	
КонецФункции
//конец Арчил Тваладзе 16.05.2016 

Функция ПолучитьПользователяНаПосту(пост) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь
	               |ИЗ
	               |	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |ГДЕ
	               |	ИА_АдресацияЗадачПланаДействий.Пост = &Пост";
	Запрос.УстановитьПараметр("Пост", пост);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		возврат Выборка.Пользователь;
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
КонецФункции