
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// №11868
	ДанныеВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЗаявокНаДоставку.Ссылка КАК Статус
	|ИЗ
	|	Справочник.СтатусыЗаявокНаДоставку КАК СтатусыЗаявокНаДоставку
	|ГДЕ
	|	НЕ СтатусыЗаявокНаДоставку.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыЗаявокНаДоставку.РеквизитДопУпорядочивания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ДанныеВыбора.Добавить(Выборка.Статус);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Процедура заполняет справочник по умолчанию
//
Процедура ЗаполнитьПоставляемыеСтатусы() Экспорт
	
	СтатусОбъект = Справочники.СтатусыЗаявокНаДоставку.Заявка.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 1;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЗаявокНаДоставку.Подготовлено.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 2;
	СтатусОбъект.Записать();
	
	СтатусОбъект = Справочники.СтатусыЗаявокНаДоставку.Доставлено.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 3; //4;
	СтатусОбъект.Записать();

	СтатусОбъект = Справочники.СтатусыЗаявокНаДоставку.Отправлено.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 4; //3;
	СтатусОбъект.Записать();	
		
	СтатусОбъект = Справочники.СтатусыЗаявокНаДоставку.Отказ.ПолучитьОбъект();
	СтатусОбъект.РеквизитДопУпорядочивания = 5;
	СтатусОбъект.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗаявокНаДоставку.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыЗаявокНаДоставку КАК СтатусыЗаявокНаДоставку
	|ГДЕ
	|	НЕ СтатусыЗаявокНаДоставку.Предопределенный";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтатусОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтатусОбъект.РеквизитДопУпорядочивания = 99999;
		СтатусОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
