&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПотолкиПроизводятся = НЕ Объект.ПотолкиЗакупаютсяУПоставщика;
	ОбновитьЭлементыФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.ВидМонтажнойБригады) И ЗначениеЗаполнено(Объект.ТарифИсполнителя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не допускается одновременное заполнения вида бригады и тарифа исполнителя", , , , Отказ);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы(ОткрытиеФормы = Ложь)
	
	Элементы.ГруппаЗакупаемУПоставщика.Доступность = Объект.ПотолкиЗакупаютсяУПоставщика;
	Элементы.ГруппаПроизводим.Доступность = НЕ Объект.ПотолкиЗакупаютсяУПоставщика;
	
	Элементы.ВидЦенТовары.Видимость = (Объект.ПравилаОпределенияСебестоимостиТоваров = 0);
	Элементы.ПоставщикТоваров.Видимость = (Объект.ПравилаОпределенияСебестоимостиТоваров = 1);
	Элементы.ВидЦеныПоставщикаТоваров.Видимость = (Объект.ПравилаОпределенияСебестоимостиТоваров = 1);
	Элементы.ТоварыКоличествоАнализируемыхМесяцев.Видимость = (Объект.ПравилаОпределенияСебестоимостиТоваров = 3);
	Элементы.УчитыватьОприходованиеТоваров.Видимость = (Объект.ПравилаОпределенияСебестоимостиТоваров = 3);
	Если Объект.ПравилаОпределенияСебестоимостиТоваров = 3 И Объект.ТоварыКоличествоАнализируемыхМесяцев = 0 Тогда
		Объект.ТоварыКоличествоАнализируемыхМесяцев = 12;
	КонецЕсли;
	
	Элементы.ВидЦенУслуги.Видимость = (Объект.ПравилаОпределенияСебестоимостиУслуг = 1);
	Элементы.ПоставщикУслуг.Видимость = (Объект.ПравилаОпределенияСебестоимостиУслуг = 2);
	Элементы.ВидЦеныПоставщикаУслуг.Видимость = (Объект.ПравилаОпределенияСебестоимостиУслуг = 2);
	Элементы.УслугиКоличествоАнализируемыхМесяцев.Видимость = (Объект.ПравилаОпределенияСебестоимостиУслуг = 4);
	Элементы.УчитыватьОприходованиеУслуг.Видимость = (Объект.ПравилаОпределенияСебестоимостиУслуг = 4);
	Если Объект.ПравилаОпределенияСебестоимостиУслуг = 4 И Объект.УслугиКоличествоАнализируемыхМесяцев = 0 Тогда
		Объект.УслугиКоличествоАнализируемыхМесяцев = 12;
	КонецЕсли;
	
	Элементы.ВидЦенМатериалы.Видимость = (Объект.ПравилаОпределенияСебестоимостиМатериалов = 0);
	Элементы.ПоставщикМатериалов.Видимость = (Объект.ПравилаОпределенияСебестоимостиМатериалов = 1);
	Элементы.ВидЦеныПоставщикаМатериалов.Видимость = (Объект.ПравилаОпределенияСебестоимостиМатериалов = 1);
	Элементы.МатериалыКоличествоАнализируемыхМесяцев.Видимость = (Объект.ПравилаОпределенияСебестоимостиМатериалов = 3);
	Элементы.УчитыватьОприходованиеМатериалов.Видимость = (Объект.ПравилаОпределенияСебестоимостиМатериалов = 3);
	Если Объект.ПравилаОпределенияСебестоимостиМатериалов = 3 И Объект.МатериалыКоличествоАнализируемыхМесяцев = 0 Тогда
		Объект.МатериалыКоличествоАнализируемыхМесяцев = 12;
	КонецЕсли;
	
	// вкладка Выработка
	//++ #12320
	//Элементы.ВидМонтажнойБригады.Доступность = Объект.УчитыватьВыработку;
	//Элементы.ТарифИсполнителя.Доступность = Объект.УчитыватьВыработку;
	Элементы.ГруппаНастройкиВыработки.Доступность = Объект.УчитыватьВыработку;
	Элементы.ТарифИсполнителя.Видимость    = (Объект.СпособРаспределенияВыработкиПоМонтажникам = Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.Индивидуально);
	Элементы.ВидМонтажнойБригады.Видимость = (Объект.СпособРаспределенияВыработкиПоМонтажникам = Перечисления.СпособыРаспределенияВыработкиПоМонтажникам.ПоКоэффициентам);
	//-- #12320		
	Если НЕ Объект.УчитыватьВыработку И НЕ ОткрытиеФормы Тогда
		Объект.ВидМонтажнойБригады = Справочники.ВидыМонтажныхБригад.ПустаяСсылка();
		Объект.ТарифИсполнителя	= Справочники.ТарифыИсполнителей.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПотолкиЗакупаютсяУПоставщикаПриИзменении(Элемент)
	ПотолкиПроизводятся = НЕ Объект.ПотолкиЗакупаютсяУПоставщика;
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПотолкиПроизводятсяПриИзменении(Элемент)
	Объект.ПотолкиЗакупаютсяУПоставщика = НЕ ПотолкиПроизводятся;
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПравилаОпределенияСебестоимостиТоваровПриИзменении(Элемент)
	ОбновитьЭлементыФормы();	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаОпределенияСебестоимостиУслугПриИзменении(Элемент)
	ОбновитьЭлементыФормы();	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаОпределенияСебестоимостиМатериаловПриИзменении(Элемент)
	ОбновитьЭлементыФормы();	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьВыработкуПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияВыработкиПоМонтажникамПриИзменении(Элемент)
	ОбновитьЭлементыФормы();	
КонецПроцедуры

