
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
    СтандартнаяОбработка = Ложь;
    Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    
    Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	ПараметрВалютаУчета 	 = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВалютаУчета"));
	ПараметрВалютаУчета.Значение = Константы.ВалютаУчета.Получить();
	
	ПараметрОрганизацияОтбор = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОрганизацияОтбор"));
	ПараметрОрганизация 	 = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));

	ОрганизацияОтбор = Справочники.Организации.ПустаяСсылка();
	Если ПараметрОрганизацияОтбор.Использование Тогда
		ОрганизацияОтбор = ПараметрОрганизацияОтбор.Значение;
	КонецЕсли;
	ПараметрОрганизация.Значение = ОрганизацияОтбор;
	ПараметрОрганизация.Использование = (НЕ ОрганизацияОтбор = Справочники.Организации.ПустаяСсылка());
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
	
    ПараметрПериода 	  = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтПериод"));
	ПараметрОрганизация   = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
    НачалоПериодаЗначение = ПараметрПериода.Значение.ДатаНачала;
    КонецПериодаЗначение  = ПараметрПериода.Значение.ДатаОкончания;
	ОрганизацияЗначение   = ПараметрОрганизация.Значение;
	
    ДебиторыВнешняя  = СформироватьДебиторыВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, ОрганизацияЗначение);
    КредиторыВнешняя = СформироватьКредиторыВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, ОрганизацияЗначение);
	
	ЗаймыАктивНачалоПериода = СформироватьЗаймыИКредитыАктивНачалоПериодаВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, ОрганизацияЗначение);
	//техническая запись для расчета ресурса при пустой таблице
	НоваяСтрокаИтог = ЗаймыАктивНачалоПериода.Добавить();
	НоваяСтрокаИтог.Организация = ОрганизацияОтбор;
	НоваяСтрокаИтог.ЗаймыАктивНГ = 0;
	
	ЗаймыАктивКонецПериода = СформироватьЗаймыИКредитыАктивКонецПериодаВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, ОрганизацияЗначение);
	//техническая запись для расчета ресурса при пустой таблице
	НоваяСтрокаИтог = ЗаймыАктивКонецПериода.Добавить();
	НоваяСтрокаИтог.Организация = ОрганизацияОтбор;
	НоваяСтрокаИтог.ЗаймыАктив = 0;
	
	ЗаймыПассивНачалоПериода = СформироватьЗаймыИКредитыПассивНачалоПериодаВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, ОрганизацияЗначение);
	//техническая запись для расчета ресурса при пустой таблице
	НоваяСтрокаИтог = ЗаймыПассивНачалоПериода.Добавить();
	НоваяСтрокаИтог.Организация = ОрганизацияОтбор;
	НоваяСтрокаИтог.ЗаймыПассивНГ = 0;
	
	ЗаймыПассивКонецПериода = СформироватьЗаймыИКредитыПассивКонецПериодаВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, ОрганизацияЗначение);
	//техническая запись для расчета ресурса при пустой таблице
	НоваяСтрокаИтог = ЗаймыПассивКонецПериода.Добавить();
	НоваяСтрокаИтог.Организация = ОрганизацияОтбор;
	НоваяСтрокаИтог.ЗаймыПассив = 0;
	
	
	ДебиторыИтогВнешняя = ДебиторыВнешняя.Скопировать();
	ДебиторыИтогВнешняя.Свернуть("Организация", "ДебиторыНГ, Дебиторы");
	ДебиторыИтогВнешняя.Колонки.ДебиторыНГ.Имя = "ДебиторыИтогНГ";	
	ДебиторыИтогВнешняя.Колонки.Дебиторы.Имя = "ДебиторыИтог";
	//техническая запись для расчета ресурса при пустой таблице
	НоваяСтрокаИтог = ДебиторыИтогВнешняя.Добавить();
	НоваяСтрокаИтог.Организация = ОрганизацияОтбор;
	НоваяСтрокаИтог.ДебиторыИтогНГ = 0;
	НоваяСтрокаИтог.ДебиторыИтог = 0;
	
	КредиторыИтогВнешняя = КредиторыВнешняя.Скопировать();
	КредиторыИтогВнешняя.Свернуть("Организация", "КредиторыНГ, Кредиторы");
	КредиторыИтогВнешняя.Колонки.КредиторыНГ.Имя = "КредиторыИтогНГ";	
	КредиторыИтогВнешняя.Колонки.Кредиторы.Имя = "КредиторыИтог";
	//техническая запись для расчета ресурса при пустой таблице
	НоваяСтрокаИтог = КредиторыИтогВнешняя.Добавить();
	НоваяСтрокаИтог.Организация = ОрганизацияОтбор;
	НоваяСтрокаИтог.КредиторыИтогНГ = 0;
	НоваяСтрокаИтог.КредиторыИтог = 0;
	
    ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ДебиторыВнешняя",  ДебиторыВнешняя);
    ВнешниеНаборыДанных.Вставить("КредиторыВнешняя", КредиторыВнешняя);
	ВнешниеНаборыДанных.Вставить("ДебиторыИтогВнешняя", ДебиторыИтогВнешняя);
	ВнешниеНаборыДанных.Вставить("КредиторыИтогВнешняя", КредиторыИтогВнешняя);
	ВнешниеНаборыДанных.Вставить("ЗаймыАктивНачалоПериода",  ЗаймыАктивНачалоПериода);
	ВнешниеНаборыДанных.Вставить("ЗаймыАктивКонецПериода",  ЗаймыАктивКонецПериода);
	ВнешниеНаборыДанных.Вставить("ЗаймыПассивНачалоПериода",  ЗаймыПассивНачалоПериода);
	ВнешниеНаборыДанных.Вставить("ЗаймыПассивКонецПериода",  ЗаймыПассивКонецПериода);
	
	
    //Инициализируем процессор компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	    
    //Выводим отчет в документ
    ПроцессорВывода = Новый
    ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	УдалитьПустыеСтроки(ДокументРезультат);
	
КонецПроцедуры

Функция СформироватьДебиторыВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоПериодаЗначение, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода",  Новый Граница(КонецПериодаЗначение, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",  Организация);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Расчеты с покупателями"" КАК СчетДебиторы,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаНачальныйОстаток > 0
	|			ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДебиторыНГ,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаКонечныйОстаток > 0
	|			ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Дебиторы,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Организация КАК Организация
	| 
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			,
	|			Организация = &Организация
	|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Расчеты с подотчетными лицами"",
	|	РасчетыСПодотчетникамиОстаткиИОбороты.Сотрудник,
	|	ВЫБОР
	|		КОГДА РасчетыСПодотчетникамиОстаткиИОбороты.СуммаНачальныйОстаток > 0
	|			ТОГДА РасчетыСПодотчетникамиОстаткиИОбороты.СуммаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыСПодотчетникамиОстаткиИОбороты.СуммаКонечныйОстаток > 0
	|			ТОГДА РасчетыСПодотчетникамиОстаткиИОбороты.СуммаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	РасчетыСПодотчетникамиОстаткиИОбороты.Организация
	|ИЗ
	|	РегистрНакопления.РасчетыСПодотчетниками.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			,
	|			Организация = &Организация
	|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК РасчетыСПодотчетникамиОстаткиИОбороты";
	
	ТЗРезультат	= Запрос.Выполнить().Выгрузить();
	ТЗРезультат.Свернуть("СчетДебиторы, Организация", "ДебиторыНГ,Дебиторы");
	Возврат ТЗРезультат;
	
КонецФункции

Функция СформироватьКредиторыВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоПериодаЗначение, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода",  Новый Граница(КонецПериодаЗначение, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",  Организация);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Расчеты с поставщиками"" КАК СчетКредиторы,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаНачальныйОстаток < 0
	|			ТОГДА -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КредиторыНГ,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаКонечныйОстаток < 0
	|			ТОГДА -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Кредиторы,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Организация = &Организация
	|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Расчеты с подотчетными лицами"",
	|	РасчетыСПодотчетникамиОстаткиИОбороты.Сотрудник,
	|	ВЫБОР
	|		КОГДА РасчетыСПодотчетникамиОстаткиИОбороты.СуммаНачальныйОстаток < 0
	|			ТОГДА -РасчетыСПодотчетникамиОстаткиИОбороты.СуммаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыСПодотчетникамиОстаткиИОбороты.СуммаКонечныйОстаток < 0
	|			ТОГДА -РасчетыСПодотчетникамиОстаткиИОбороты.СуммаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	РасчетыСПодотчетникамиОстаткиИОбороты.Организация
	|ИЗ
	|	РегистрНакопления.РасчетыСПодотчетниками.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Организация = &Организация
	|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК РасчетыСПодотчетникамиОстаткиИОбороты";
	
	ТЗРезультат	= Запрос.Выполнить().Выгрузить();
	ТЗРезультат.Свернуть("СчетКредиторы, Организация", "КредиторыНГ,Кредиторы");
	Возврат ТЗРезультат;
	
КонецФункции

Процедура УдалитьПустыеСтроки(ТабличныйДокумент)
	
	МассивПустыхСтрок = Новый Массив;
	
	Для ИндексСтроки = 5 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		ЭтоПустаяСтрока = Истина;
		
		Для ИндексКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
			Если ЗначениеЗаполнено(ТабличныйДокумент.Область(ИндексСтроки, ИндексКолонки).Текст) Тогда
				ЭтоПустаяСтрока = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоПустаяСтрока Тогда
			МассивПустыхСтрок.Вставить(0, ИндексСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекЭлемент Из МассивПустыхСтрок Цикл
		ТабличныйДокумент.УдалитьОбласть(ТабличныйДокумент.Область(ТекЭлемент,, ТекЭлемент), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЦикла;
	
КонецПроцедуры


Функция СформироватьЗаймыИКредитыАктивНачалоПериодаВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Новый Граница(НачалоПериодаЗначение, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",  Организация);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КредитыИЗаймыОстатки.Контрагент КАК Контрагент,
	|	КредитыИЗаймыОстатки.Договор КАК Договор,
	|	КредитыИЗаймыОстатки.СуммаОстаток КАК ЗаймыАктивНГ
	|ИЗ
	|	РегистрНакопления.КредитыИЗаймы.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК КредитыИЗаймыОстатки
	|ГДЕ
	|	КредитыИЗаймыОстатки.СуммаОстаток > 0";
	
	ТЗРезультат	= Запрос.Выполнить().Выгрузить();
	ТЗРезультат.Свернуть("Организация", "ЗаймыАктивНГ");
	Возврат ТЗРезультат;
	
КонецФункции

Функция СформироватьЗаймыИКредитыАктивКонецПериодаВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Новый Граница(КонецПериодаЗначение, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",  Организация);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КредитыИЗаймыОстатки.Контрагент КАК Контрагент,
	|	КредитыИЗаймыОстатки.Договор КАК Договор,
	|	КредитыИЗаймыОстатки.СуммаОстаток КАК ЗаймыАктив
	|ИЗ
	|	РегистрНакопления.КредитыИЗаймы.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК КредитыИЗаймыОстатки
	|ГДЕ
	|	КредитыИЗаймыОстатки.СуммаОстаток > 0";
	
	ТЗРезультат	= Запрос.Выполнить().Выгрузить();
	ТЗРезультат.Свернуть("Организация", "ЗаймыАктив");
	Возврат ТЗРезультат;
	
КонецФункции

Функция СформироватьЗаймыИКредитыПассивНачалоПериодаВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Новый Граница(НачалоПериодаЗначение, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",  Организация);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КредитыИЗаймыОстатки.Контрагент КАК Контрагент,
	|	КредитыИЗаймыОстатки.Договор КАК Договор,
	|	-КредитыИЗаймыОстатки.СуммаОстаток КАК ЗаймыПассивНГ
	|ИЗ
	|	РегистрНакопления.КредитыИЗаймы.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК КредитыИЗаймыОстатки
	|ГДЕ
	|	КредитыИЗаймыОстатки.СуммаОстаток < 0";
	
	ТЗРезультат	= Запрос.Выполнить().Выгрузить();
	ТЗРезультат.Свернуть("Организация", "ЗаймыПассивНГ");
	Возврат ТЗРезультат;
	
КонецФункции

Функция СформироватьЗаймыИКредитыПассивКонецПериодаВнешняя(НачалоПериодаЗначение, КонецПериодаЗначение, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Новый Граница(КонецПериодаЗначение, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",  Организация);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КредитыИЗаймыОстатки.Контрагент КАК Контрагент,
	|	КредитыИЗаймыОстатки.Договор КАК Договор,
	|	-КредитыИЗаймыОстатки.СуммаОстаток КАК ЗаймыПассив
	|ИЗ
	|	РегистрНакопления.КредитыИЗаймы.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК КредитыИЗаймыОстатки
	|ГДЕ
	|	КредитыИЗаймыОстатки.СуммаОстаток < 0";
	
	ТЗРезультат	= Запрос.Выполнить().Выгрузить();
	ТЗРезультат.Свернуть("Организация", "ЗаймыПассив");
	Возврат ТЗРезультат;
	
КонецФункции

