
Процедура ПередЗаписью(Отказ)
	
	//-> Григорьева
	//очистка ненужных данных
	Если ВариантныйОтвет Тогда
		БаллВопроса = 0;
		ОтветВопроса = 0;
	Иначе
		ВариантыОтветов.Очистить();
	КонецЕсли; 
	//<- Григорьева
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//-> Григорьева
	Если ВариантныйОтвет Тогда
		ПроверяемыеРеквизиты.Добавить("ВариантыОтветов");
		
		//проверим на дубли ответов
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВариантыОтветов.НомерСтроки,
		               |	ВариантыОтветов.Ответ
		               |ПОМЕСТИТЬ ДанныеТабличнойЧасти
		               |ИЗ
		               |	&ВариантыОтветов КАК ВариантыОтветов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеТабличнойЧасти.НомерСтроки) КАК НомерСтроки,
		               |	ДанныеТабличнойЧасти.Ответ
		               |ИЗ
		               |	ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДанныеТабличнойЧасти.Ответ
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеТабличнойЧасти.НомерСтроки) > 1";
					   
		Запрос.УстановитьПараметр("ВариантыОтветов", ВариантыОтветов.Выгрузить());
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ИА_КСУОбщийКлиентСервер.СообщитьПользователю("Дублируется ответ: " + Выборка.Ответ,,,, Отказ);
		КонецЦикла; 
	Иначе
		ПроверяемыеРеквизиты.Добавить("ОтветВопроса");
	КонецЕсли;
	//<- Григорьева
	
КонецПроцедуры
