
&НаСервере
Функция ПолучитьДанные(СсылкаНаОбъект, ИмяФайла)
	
	Возврат ОбщийМодульВызовСервера.ПолучитьДанныеФайла(СсылкаНаОбъект, ИмяФайла,, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяВременногоФайлаСерв(Расширение)
	Возврат ПолучитьИмяВременногоФайла(Расширение);
КонецФункции

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		АдресФайла = ПолучитьДанные(ТекущиеДанные.СсылкаНаОбъект, ТекущиеДанные.ИмяФайла);
		Если НЕ АдресФайла = Неопределено Тогда // №7253
			ВременноеИмя = ПолучитьИмяВременногоФайлаСерв(ТекущиеДанные.Расширение);
	    	ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.ОбъектОтбор = Неопределено И ЗначениеЗаполнено(Параметры.ОбъектОтбор) Тогда
		
		ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
		ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СсылкаНаобъект");
		ЭО.ПравоеЗначение=Параметры.ОбъектОтбор.Ссылка;
		ЭО.Использование=Истина;
		
	КонецЕсли;
	
	//++ №14707
	Если Параметры.Отбор.Свойство("СсылкаНаОбъект") Тогда
		ВладелецФайла = Параметры.Отбор.СсылкаНаОбъект;
	КонецЕсли;
	//-- №14707
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	АдресФайла = ПолучитьДанные(ТекущиеДанные.СсылкаНаОбъект, ТекущиеДанные.ИмяФайла);
	
	Если НЕ АдресФайла = Неопределено Тогда // №7253
		ВременноеИмя = ПолучитьИмяВременногоФайлаСерв(ТекущиеДанные.Расширение);
		ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	//++ №14707
	Если НЕ ВладелецФайла = Неопределено И ЗначениеЗаполнено(ВладелецФайла) Тогда
		СсылкаНаОбъект = ВладелецФайла;
	//-- №14707
	ИначеЕсли ТекущиеДанные = Неопределено Тогда
		Возврат;
	Иначе
		СсылкаНаОбъект = ТекущиеДанные.СсылкаНаОбъект;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ДействиеПослеПрикрепления", ОписаниеОповещения);
	
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(СсылкаНаОбъект, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрикрепленияФайлаЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРезультата.Результат Тогда
		Элементы.Список.Обновить();
	КонецЕсли;	
	
КонецПроцедуры

