#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПечатьЧека

// Возвращает предварительные параметры фискализации чека для документа.
//
// Параметры:
//   ДокументСсылка - ДокументСсылка.ПриходныйКассовыйОрдер - Документ.
//   ВерсияФФД - Строка - Версия ФФД.
//
// ВозвращаемоеЗначение:
//  Неопределено, Структура - см. функцию МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека().
//
Функция ПараметрыОперацииФискализацииЧека(ДокументСсылка, ВерсияФФД = Неопределено, ЭкземплярПодключаемогоОборудования = Неопределено) Экспорт
	
	// Общие параметры чека
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
			
	// Общие реквизиты для всех типов оборудования.
	ПотолкиКассыОнлайн.ЗаполнитьОбщиеРеквизиты(ДокументСсылка, ОбщиеПараметры, ЭкземплярПодключаемогоОборудования);
			
	// Товарные позиции И Таблица оплат	
	Если ВерсияФФД = "1.0" Тогда
		ДополнитьТоварамиПараметрыПриПробитииЧека_1_0(ДокументСсылка, ОбщиеПараметры);
	Иначе
		Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту Тогда
			НомерСтрокиТовара = 0;
			МассивДокументовВозврата = Новый Массив;			
		    Для каждого СтрокаТЧ из ДокументСсылка.Основания Цикл
				Если ТипЗнч(СтрокаТЧ.Основание) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
					МассивДокументовВозврата.Добавить(Новый Структура("Документ, СуммаДокумента, СуммаРаспределения", СтрокаТЧ.Основание, СтрокаТЧ.Основание.СуммаДокумента, СтрокаТЧ.Основание.СуммаДокумента));
				КонецЕсли;
			КонецЦикла;
			Если МассивДокументовВозврата.Количество() > 0 Тогда
				// возврат оплаты по документам Возврат от покупателя
				НомерСтрокиТовара = 0;
				ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;
				ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
				ПотолкиКассыОнлайн.ДобавитьПозицииЧекаПоДокументамРасчетов(МассивДокументовВозврата, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета, ПризнакПредметаРасчета);			
				ПотолкиКассыОнлайн.ДобавитьСтрокуОплаты(ОбщиеПараметры, ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"), ДокументСсылка.Сумма); // #12169 исправление  
			Иначе
				// возврат оплаты - аванса
				// возврат оплаты по заказу (заказ - в ТЧ Распределение)
				// возврат оплаты по реализации (реализация - в ТЧ Распределение)
				ПотолкиКассыОнлайн.ДополнитьТоварамиПараметрыПриПробитииЧека(ДокументСсылка, ОбщиеПараметры);
			КонецЕсли;
		Иначе
			// поступление ДС
			ПотолкиКассыОнлайн.ДополнитьТоварамиПараметрыПриПробитииЧека(ДокументСсылка, ОбщиеПараметры);
		КонецЕсли;
	КонецЕсли;

	Возврат ОбщиеПараметры;
	
КонецФункции

#КонецОбласти

#Область ПечатьЧекаФФД_1_0

Процедура ДополнитьТоварамиПараметрыПриПробитииЧека_1_0(ДокументСсылка, ОбщиеПараметры)
	
	ТаблицаТоваров = ЗаполнитьТаблицуТоваровПоОснованию(ДокументСсылка);
	
	Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		//СтрокаПозицииЧека = Новый Структура();
		//СтрокаПозицииЧека.Вставить("ФискальнаяСтрока");
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		Если ПустаяСтрока(Строка(СтрокаТЧ.Номенклатура)) Тогда
			СтрокаПозицииЧека.Вставить("Наименование", "Предоплата");
		Иначе
			СтрокаПозицииЧека.Вставить("Наименование", Строка(СтрокаТЧ.Номенклатура));
		КонецЕсли;
		СтрокаПозицииЧека.Вставить("Количество"  , СтрокаТЧ.Количество);
		СтрокаПозицииЧека.Вставить("Цена"        , СтрокаТЧ.Цена);
		СтрокаПозицииЧека.Вставить("Сумма"       , СтрокаТЧ.Сумма);
		СтрокаПозицииЧека.Вставить("НомерСекции" , СтрокаТЧ.НомерСекции);
		СтрокаПозицииЧека.Вставить("СтавкаНДС"   , ВернутьСтавкуНДС(СтрокаТЧ.СтавкаНДС));
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	КонецЦикла;
	
	// Подготовка таблицы оплат
	СуммаВидаОплаты = ДокументСсылка.Сумма;	
	Если СуммаВидаОплаты <> 0 Тогда
		СтрокаОплаты = Новый Структура();
		//СтрокаОплаты.Вставить("ТипОплаты", 1);
		СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"));
		СтрокаОплаты.Вставить("Наименование", "Платежная карта");
		СтрокаОплаты.Вставить("Сумма", СуммаВидаОплаты);
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьТаблицуТоваровПоОснованию(ДокументСсылка) Экспорт
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("Сумма");
	ТаблицаТоваров.Колонки.Добавить("НомерСекции");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	
	ДокументСсылкаОснование = Неопределено;
	Если ДокументСсылка.Основания.Количество() > 0 Тогда
		ДокументСсылкаОснование = ДокументСсылка.Основания[0].Основание;
	КонецЕсли;
	
	Если ЭтоПолнаяОплата(ДокументСсылка) Тогда
		//заполним табличную часть товаров (товары и услуги) по основанию
		Если ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаказДоговор") 
			или ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.Монтаж") 
			Тогда
			//ТоварыУслуги
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.ТоварыУслуги Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ?(ЗначениеЗаполнено(ДокументСсылка.Касса), ДокументСсылка.Касса.СекцияПоУмолчанию, 1);
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
			
		// Исключено в 2.0
		//ИначеЕсли ТипЗнч(ДокументСсылка.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство")  
		//	Тогда
		//	//продукция
		//	Если НЕ ДокументСсылка.Основание.ЗаказНаПродажу Тогда
		//		НоваяСтрока = ТаблицаТоваров.Добавить();
		//		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		//		НоваяСтрока.Количество = ДокументСсылка.Основание.ПродукцияКоличество;
		//		НоваяСтрока.Цена = ДокументСсылка.Основание.ПродукцияЦена;
		//		НоваяСтрока.Сумма = ДокументСсылка.Основание.ПродукцияСумма;
		//		НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
		//		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		//		//цену высчитаем из суммы, т.к. могли быьт скидки
		//		Если НЕ НоваяСтрока.Количество = 0 Тогда
		//			НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
		//		КонецЕсли;
		//	КонецЕсли;
		//	//товары
		//	Для Каждого ТекущаяСтрока Из ДокументСсылка.Основание.Товары Цикл
		//		НоваяСтрока = ТаблицаТоваров.Добавить();
		//		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		//		НоваяСтрока.Количество = ТекущаяСтрока.Количество;
		//		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
		//		НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
		//		НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
		//		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		//		//цену высчитаем из суммы, т.к. могли быьт скидки
		//		Если НЕ НоваяСтрока.Количество = 0 Тогда
		//			НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
		//		КонецЕсли;
		//	КонецЦикла;
		//	//услуги
		//	Для Каждого ТекущаяСтрока Из ДокументСсылка.Основание.Услуги Цикл
		//		НоваяСтрока = ТаблицаТоваров.Добавить();
		//		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		//		НоваяСтрока.Количество = ТекущаяСтрока.Количество;
		//		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
		//		НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
		//		НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
		//		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		//		//цену высчитаем из суммы, т.к. могли быьт скидки
		//		Если НЕ НоваяСтрока.Количество = 0 Тогда
		//			НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
		//		КонецЕсли;
		//	КонецЦикла;
		
		ИначеЕсли ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.РеализацияТоваровИУслуг")  
			или ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.СчетНаОплату")  
			Тогда
			//товары
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.Товары Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ?(ЗначениеЗаполнено(ДокументСсылка.Касса), ДокументСсылка.Касса.СекцияПоУмолчанию, 1);
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быть скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
			//услуги
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.Услуги Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ?(ЗначениеЗаполнено(ДокументСсылка.Касса), ДокументСсылка.Касса.СекцияПоУмолчанию, 1);
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаявкаНаДоставку")  
			Тогда
			//одна строка - доставка груза
			НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ДокументСсылка.Сумма;
			НоваяСтрока.Сумма = ДокументСсылка.Сумма;
			НоваяСтрока.НомерСекции = ?(ЗначениеЗаполнено(ДокументСсылка.Касса), ДокументСсылка.Касса.СекцияПоУмолчанию, 1);
			НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		КонецЕсли;
	Иначе
		//укажем что это предоплата
		НоваяСтрока = ТаблицаТоваров.Добавить();
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = ДокументСсылка.Сумма;
		НоваяСтрока.Сумма = ДокументСсылка.Сумма;
		НоваяСтрока.НомерСекции = ?(ЗначениеЗаполнено(ДокументСсылка.Касса), ДокументСсылка.Касса.СекцияПоУмолчанию, 1);
		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	КонецЕсли;
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция ЭтоПолнаяОплата(ДокументСсылка)
	
	Результат = Ложь;
	
	ДокументСсылкаОснование = Неопределено;
	Если ДокументСсылка.Основания.Количество() > 0 Тогда
		ДокументСсылкаОснование = ДокументСсылка.Основания[0].Основание;
	КонецЕсли;
	
	Если НЕ ДокументСсылкаОснование = Неопределено Тогда
		Если ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаявкаНаДоставку") Тогда
			Если ДокументСсылка.Сумма = ДокументСсылкаОснование.СтоимостьДоставки Тогда
				Результат = Истина;
			КонецЕсли;
		Иначе
			Если ДокументСсылка.Сумма = ДокументСсылкаОснование.СуммаДокумента Тогда
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция преобразования значения реквизита СтавкаНДС к типу Число.
Функция ВернутьСтавкуНДС(СтавкаНДС)
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		Ставка = 10;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
		Ставка = 18;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
		Ставка = 0;
	Иначе
		Ставка = Неопределено;
	КонецЕсли;
	
	Возврат Ставка;
	
КонецФункции

#КонецОбласти

Функция ЗаголовокДокументаПоВидуОперации(Документ, НомерДокумента, ДатаДокумента, ВидОперации) Экспорт
	
	Заголовок = "";
	
	Если ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой Тогда
			Заголовок = ?(ЗначениеЗаполнено(Документ.Ссылка),
							НСтр("ru = 'Оплата банковской картой %1 от %2'"),
							НСтр("ru = 'Оплата банковской картой (создание)'"));

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту Тогда
			Заголовок = ?(ЗначениеЗаполнено(Документ.Ссылка),
							НСтр("ru = 'Оплата банковской картой (возврат) %1 от %2'"),
							НСтр("ru = 'Оплата банковской картой (возврат) (создание)'"));
							
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.Кредит Тогда
			Заголовок = ?(ЗначениеЗаполнено(Документ.Ссылка),
							НСтр("ru = 'Оплата кредитом  %1 от %2'"),
							НСтр("ru = 'Оплата кредитом (создание)'"));
							
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок, НомерДокумента, ДатаДокумента);
	
КонецФункции

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, Истина);
		
КонецПроцедуры

// Добавляет команду создания данного документа
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, ЭтоВозврат = Ложь, Порядок = 0) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ОплатаБанковскойКартой) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ОплатаБанковскойКартой.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ОплатаБанковскойКартой.Представление() + ?(ЭтоВозврат, " (возврат)", "");
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.Порядок = Порядок;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Добавляет команду создания документа "Оплата банковской картой".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ОплатаБанковскойКартой) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.ОплатаБанковскойКартойСоздатьНаОснованииМножественныйВыбор";
		КомандаСоздатьНаОсновании.Представление = "Оплата банковской картой";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция ДобавитьКомандуСоздатьНаОснованииОплатаКредитомМножественныйВыбор(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ОплатаБанковскойКартой) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.ОплатаКредитомСоздатьНаОснованииМножественныйВыбор";
		КомандаСоздатьНаОсновании.Представление = "Оплата кредитом";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли