  
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//   // Отчет = Отчеты["ПрайсЛистНоменклатура"].Создать();
//	СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

//	//Из схемы возьмем настройки по умолчанию
//	Настройки = ЭтотОбъект.КомпоновщикНастроек.Настройки;
//	//Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;

//	//Если ЗначениеЗаполнено(ИмяВарианта)  Тогда
//	//	Настройки=СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВарианта].Настройки;
//	//КонецЕсли;  

//	ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти("Период");
//	ПараметрПериод.Значение = ТекущаяДата();
//	ПараметрПериод.Использование = Истина;

//	//Помещаем в переменную данные о расшифровке данных
//	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

//	//Формируем макет, с помощью компоновщика макета
//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

//	//Передаем в макет компоновки схему, настройки и данные расшифровки
//	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
//                                        Настройки, ДанныеРасшифровки);

//	//Выполним компоновку с помощью процессора компоновки
//	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
//	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,
//                                                   ДанныеРасшифровки, Истина);
//	//Очищаем поле табличного документа
//	Результат = Новый ТабличныйДокумент;

//	//Выводим результат в табличный документ
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//	ПроцессорВывода.УстановитьДокумент(Результат);

//	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

//	//Результат.ПоказатьУровеньГруппировокСтрок(3); 
//	
//    ПроцессорВывода.НачатьВывод();
// 
//    Пока Истина Цикл
//        ЭлементРезультатаКомпоновкиДанных = ПроцессорКомпоновкиДанных.Следующий();
//        Если ЭлементРезультатаКомпоновкиДанных = Неопределено Тогда
//            Прервать;
//    	КонецЕсли;
//    	//Поиск метки и удаление из вывода. 
//        Параметр1=ЭлементРезультатаКомпоновкиДанных.ЗначенияПараметров.Найти("П1");
//        Если Параметр1<>Неопределено и Параметр1.Значение="!!УдалитьСтрокуПриВыводе!!" Тогда
//            Продолжить;//не выводим        
//        КонецЕсли;
//        
//        ПроцессорВывода.ВывестиЭлемент(ЭлементРезультатаКомпоновкиДанных);
// 
//    КонецЦикла;
//    
//    ПроцессорВывода.ЗакончитьВывод();
//		
//	ДокументРезультат.Вывести(Результат);
//	
//	//ДокументРезультат.ОтображатьГруппировки = ЛОЖЬ;
//	
//		
//КонецПроцедуры 