
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = Параметры.Дата;
	//Время = Параметры.Время;  //#11632
	Время = Параметры.Дата; // #13969 возвращено
	
	//#15988 	
	ПроверятьКомментарий = Константы.КонтролироватьЗаполнениеКомментарияПриИзмененииДатыСледующегоКонтакта.Получить();
	Элементы.Комментарий.АвтоОтметкаНезаполненного = ПроверятьКомментарий;

	//#16861	
	Элементы.Время.СписокВыбора.Очистить();
	СписокИнтервалов = ОбщийМодульСервер.ПолучитьИнтервалыВремениСледующегоКонтакта();
	Элементы.Время.КнопкаВыпадающегоСписка = СписокИнтервалов.Количество() > 0;
	Для каждого КлючПредставление из СписокИнтервалов Цикл
		Элементы.Время.СписокВыбора.Добавить(КлючПредставление.Значение, КлючПредставление.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Дата = Дата(1,1,1) Тогда
		ПоказатьОповещениеПользователя("Не указана дата");
		Возврат;
	КонецЕсли;
	
	Если ПроверятьКомментарий И ПустаяСтрока(Комментарий) Тогда
		ПоказатьОповещениеПользователя("Не указан комментарий");
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	//СтруктураОтвета.Вставить("Дата", Дата);
	СтруктураОтвета.Вставить("Дата", ОбщийМодульКлиентСервер.СоединитьДатуИВремя(Дата, Время));
	//СтруктураОтвета.Вставить("Время", Время);  //#11632
	СтруктураОтвета.Вставить("Комментарий", Комментарий);
	Закрыть(СтруктураОтвета);
			
КонецПроцедуры


