&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьЭлементыФормыНаСервере();
	
	Элементы.ГруппаИмяРекламногоИсточникаВРойстат.Видимость = Константы.ИспользуетсяИнтеграцияСРойстат.Получить();
	Элементы.Подразделение.Видимость = Константы.ИспользоватьПодразделения.Получить();
	 
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормыНаСервере()
	
	//Элементы.ПроцентАгентские.Видимость = Объект.ДоступенВРознице;
	//Элементы.ТелефонныеНомера.Видимость = Объект.ДоступенВРознице;	
	Элементы.ГруппаСтраницаРозница.Видимость = Объект.ДоступенВРознице;
	Элементы.ГруппаСтраницаЗначенияЗаполнения.Видимость = Объект.ДоступенВРознице;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступенВРозницеПриИзменении(Элемент)
	
	ОбновитьЭлементыФормыНаСервере();
	
КонецПроцедуры
