
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// #10613
	// UPD: 2021-01-21 комментируем №10613
	//Если НЕ Константы.ТелефонияСтрана.Получить() = Справочники.СтраныМира.Украина И СтрДлина(Объект.НомерСчета) <= 20 Тогда
	//	ОграничениеТипа = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(20));
	//	Элементы.НомерСчета.ОграничениеТипа = ОграничениеТипа;
	//КонецЕсли;

	ИспользоватьИнтернетПлатежи = Константы.ИспользоватьИнтернетПлатежи.Получить();
	
	ДеятельностьБанкаПрекращена = ДеятельностьБанкаПрекращена(Объект.БИК);
	УправлениеЭлементамиФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыБанка();
	УправлениеЭлементамиФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура БИКПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыБанкаПоБИК(Объект[Элемент.Имя]);
	УправлениеЭлементамиФормыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыБанкаПоБИК(БИК)
	ЗаписьОБанке = "";
	
	Объект.Банк              = "";
	Объект.БИК          	 = "";
	Объект.КоррСчет     	 = "";
	Объект.НаименованиеБанка = "";
	Объект.ГородБанка        = "";
		
	РаботаСБанками.ПолучитьДанныеКлассификатора(БИК,,ЗаписьОБанке);
	Если НЕ ПустаяСтрока(ЗаписьОБанке) Тогда
		Объект.Банк              = ЗаписьОБанке;
		Объект.БИК          	 = ЗаписьОБанке.Код;
		Объект.КоррСчет     	 = ЗаписьОБанке.КоррСчет;
		Объект.НаименованиеБанка = ЗаписьОБанке.Наименование;
		Объект.ГородБанка        = ЗаписьОБанке.Город;
	КонецЕсли;
	
	ДеятельностьБанкаПрекращена = ДеятельностьБанкаПрекращена(Объект.БИК);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыБанка()
	Объект.БИК          	 = "";
	Объект.КоррСчет     	 = "";
	Объект.НаименованиеБанка = "";
	Объект.ГородБанка        = "";
	Если ЗначениеЗаполнено(Объект.Банк) Тогда
		Объект.БИК          	 = Объект.Банк.Код;
		Объект.КоррСчет     	 = Объект.Банк.КоррСчет;
		Объект.НаименованиеБанка = Объект.Банк.Наименование;
		Объект.ГородБанка        = Объект.Банк.Город;
	    ДеятельностьБанкаПрекращена = Объект.Банк.ДеятельностьПрекращена;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыНаСервере()
	Элементы.НадписьДеятельностьБанкаПрекращена.Видимость = ДеятельностьБанкаПрекращена;	
	
	Элементы.ИспользоватьИнтернетПлатежи.Видимость = ИспользоватьИнтернетПлатежи;
	Элементы.ГруппаИнтернетОплатаТинькофф.Видимость = ИспользоватьИнтернетПлатежи И Объект.ИспользоватьИнтернетПлатежи;
	
	//#11230
	Элементы.БанкПринимаетПлатежиСБП.Видимость = ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Организации");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДеятельностьБанкаПрекращена(БИК)
	
	Результат = Ложь;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КлассификаторБанков.ДеятельностьПрекращена
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|ГДЕ
	|	КлассификаторБанков.Код = &БИК
	|	И НЕ КлассификаторБанков.ЭтоГруппа";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("БИК", БИК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ДеятельностьПрекращена;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИспользоватьИнтернетПлатежиПриИзменении(Элемент)
	УправлениеЭлементамиФормыНаСервере();
КонецПроцедуры

