
Процедура ОбработкаПроведения(Отказ, Режим) Экспорт

	Если НЕ ВходящийКонтакт.Пустая() Тогда
	// регистр КонверсияВходящихКонтактов 
		Движения.КонверсияВходящихКонтактов.Записывать = Истина;
		Движение = Движения.КонверсияВходящихКонтактов.Добавить();
		Движение.Период = Дата;
		Движение.Контакт = ВходящийКонтакт;
		Движение.РекламныйИсточник = ВходящийКонтакт.РекламныйИсточник;
		Движение.ТочкаПродаж = ВходящийКонтакт.ТочкаПродаж;
		Движение.КоличествоЛидов = 1;
	КонецЕсли;
	
	//РегистрСведений КонверсияКонтактов
	

КонецПроцедуры
