
Функция Печать() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИА_ФинансовоеПланирование_ПланПоДоходу";
	
	Макет = ПолучитьМакет("ПланПоДоходу");
	
	РазделениеНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапка.Параметры.Номер = Число(Прав(СсылкаНаОбъект.Номер,5));
	
	ДатаНачалаОтчета =  ?(СсылкаНаОбъект.НачалоПланирования,СсылкаНаОбъект.Дата,СсылкаНаОбъект.Дата + 60*60*24);
	
	ОблШапка.Параметры.ДатаНачала = Формат(ДатаНачалаОтчета, "ДФ='dd MMMM yyyy ""г.""'");    
	ОблШапка.Параметры.ДатаКонца = Формат(ДатаНачалаОтчета + 60*60*24*6 , "ДФ='dd MMMM yyyy ""г.""'");
	
	ТабДокумент.Вывести(ОблШапка);
	
	ОблШапкаПФ = Макет.ПолучитьОбласть("ШапкаТаблицы|ВидДоходаКонтрагент");
	ОблШапкаСумма = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
	ТабДокумент.Вывести(ОблШапкаПФ);
	
	
	Если РазделениеНалБезнал Тогда
		ОблШапкаСумма.Параметры.НалБезнал = "нал" ;
		ТабДокумент.Присоединить(ОблШапкаСумма);

		ОблШапкаСумма.Параметры.НалБезнал = "безнал" ;
		ТабДокумент.Присоединить(ОблШапкаСумма);
	Иначе
		
		ТабДокумент.Присоединить(ОблШапкаСумма);
	КонецЕсли;
	
	
	ОблСтрокаПФ = Макет.ПолучитьОбласть("Строка|ВидДоходаКонтрагент");
	ОблСтрокаСумма = Макет.ПолучитьОбласть("Строка|Сумма");
	
	Для каждого стр из СсылкаНаОбъект.ПланДоходов Цикл
		ОблСтрокаПФ.Параметры.Заполнить(стр) ;
		ТабДокумент.Вывести(ОблСтрокаПФ);
		
		Если РазделениеНалБезнал Тогда
			ОблСтрокаСумма.Параметры.Сумма = Формат(стр.СуммаНал,"ЧЦ=15; ЧДЦ=2") ;
			ТабДокумент.Присоединить(ОблСтрокаСумма);
			
			ОблСтрокаСумма.Параметры.Сумма = Формат(стр.СуммаБезнал,"ЧЦ=15; ЧДЦ=2") ;
			ТабДокумент.Присоединить(ОблСтрокаСумма);
		Иначе
			ОблСтрокаСумма.Параметры.Сумма = Формат(стр.СуммаНал + стр.СуммаБезнал,"ЧЦ=15; ЧДЦ=2");
			ТабДокумент.Присоединить(ОблСтрокаСумма);
		КонецЕсли;		
		
	КонецЦикла;
	
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОблПодвал);
	
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб=Истина;
	
	Возврат ТабДокумент;
	
	
КонецФункции