
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиПараметров = Константы.ДанныеАвторизацииЯндексAPI.Получить().Получить();
	
	Если ТипЗнч(НастройкиПараметров) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиПараметров);
	КонецЕсли;
	
	ОбновитьСостояниеАвторизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиНаСервере();
		
	мМодифицированность = Ложь;
	
	ОбновитьСостояниеАвторизации();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	НастройкиПараметров = новый Структура("ИдентификаторКлиента, СекретныйКодКлиента, ПутьАрхивации, Порт");
	ЗаполнитьЗначенияСвойств(НастройкиПараметров, ЭтаФорма);
	
	Константы.ДанныеАвторизацииЯндексAPI.Установить(новый ХранилищеЗначения(НастройкиПараметров));
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьСостояниеАвторизации()
	
	АвторизацияВыполнена = РаботаСЯндексAPIВызовСервера.АвторизацияВыполнена();
	Элементы.ВыполнитьАвторизацию.Видимость = (НЕ АвторизацияВыполнена);
	Элементы.ДекорацияАвторизация.Заголовок = ?(АвторизацияВыполнена, "Авторизация выполнена успешно", "Авторизация не выполнена");
	Элементы.ДекорацияАвторизация.ЦветТекста = ?(АвторизацияВыполнена, ЦветаСтиля.РезультатУспехЦвет, ЦветаСтиля.ПоясняющийОшибкуТекст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвторизацию(Команда)
	
	Если мМодифицированность Тогда
		ПоказатьПредупреждение(, "Необходимо сохранить настройки.");
		Возврат
	КонецЕсли;
		
	РаботаСЯндексAPIКлиент.ВыполнитьАвторизацию(новый ОписаниеОповещения("ПослеВыполненияАвторизации", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияАвторизации(Результат, ДопПараметры) Экспорт
	
	ОбновитьСостояниеАвторизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторКлиентаПриИзменении(Элемент)
	
	мМодифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СекретныйКодКлиентаПриИзменении(Элемент)
	
	мМодифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПортПриИзменении(Элемент)
	
	мМодифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьАрхивацииПриИзменении(Элемент)
	
	мМодифицированность = Истина;
	
КонецПроцедуры

