&НаСервере
Процедура ОтметитьУслугиИТоварыПотолка(Заказывать, Потолок)
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		Если ТекущаяСтрока.Потолок = Потолок Тогда
			ТекущаяСтрока.Заказывать = Заказывать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.СписокПотолков = Неопределено Тогда
		МассивПотолков = Параметры.СписокПотолков;
		Для НомерСтроки = 0 По МассивПотолков.Количество() - 1 Цикл
			НоваяСтрока = СписокТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивПотолков[НомерСтроки], 
				"Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,Количество,ЕдиницаИзмерения,НомерСтроки,ЗаказНаПроизводство,Коэффициент,ПроцентРучнойСкидки,СуммаРучнойСкидки,Цена,Сумма,Потолок,Назначение,КоличествоКВыработке,БонусыКНачислению, ЗаказПокупателя");
			НоваяСтрока.ВидНоменклатуры = НоваяСтрока.Номенклатура.ВидНоменклатуры;
			
			//добавляем подчиненные строки по услугам
			МассивУслуг = Параметры.СписокУслуг;
			Для НомерСтрокиУслуги = 0 По МассивУслуг.Количество() - 1 Цикл
				Если МассивУслуг[НомерСтрокиУслуги].Потолок = НоваяСтрока.Номенклатура Тогда
					НоваяПодчиненнаяСтрока = СписокТоваров.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяПодчиненнаяСтрока, МассивУслуг[НомерСтрокиУслуги]);
					НоваяПодчиненнаяСтрока.ВидНоменклатуры = НоваяПодчиненнаяСтрока.Номенклатура.ВидНоменклатуры;
					НоваяПодчиненнаяСтрока.ПодчиненнаяСтрока = Истина;
				КонецЕсли;
			КонецЦикла;

		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Параметры.СписокУслуг = Неопределено Тогда
		МассивУслуг = Параметры.СписокУслуг;
		Для НомерСтроки = 0 По МассивУслуг.Количество() - 1 Цикл
			НоваяСтрока = СписокУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивУслуг[НомерСтроки]);
			НоваяСтрока.ВидНоменклатуры = НоваяСтрока.Номенклатура.ВидНоменклатуры;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		ТекущаяСтрока.Заказывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСоВсех(Команда)
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		ТекущаяСтрока.Заказывать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Функция ПустаяСтруктураТовара()
	СтруктураТовара = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,Количество,ЕдиницаИзмерения,НомерСтроки,ЗаказНаПроизводство,
									|Коэффициент,ПроцентРучнойСкидки,Цена,СуммаРучнойСкидки,Сумма,
									|Потолок,КоличествоКВыработке,БонусыКНачислению, ЗаказПокупателя");
	Возврат СтруктураТовара;
КонецФункции

&НаКлиенте
Процедура КВозврату(Команда)
	
	СписокКВозврату = Новый Массив;
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		Если ТекущаяСтрока.Заказывать И НЕ ТекущаяСтрока.ПодчиненнаяСтрока Тогда
			СтруктураТовара = ПустаяСтруктураТовара();
			ЗаполнитьЗначенияСвойств(СтруктураТовара, ТекущаяСтрока); 
			СписокКВозврату.Добавить(СтруктураТовара);
			
			Для каждого СтрокаУслуг из СписокУслуг Цикл
				Если СтрокаУслуг.Потолок = ТекущаяСтрока.Номенклатура Тогда
					СтруктураТовара = ПустаяСтруктураТовара();
					ЗаполнитьЗначенияСвойств(СтруктураТовара, СтрокаУслуг);
					СписокКВозврату.Добавить(СтруктураТовара);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	Закрыть(СписокКВозврату);	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриИзменении(Элемент)
	
	ТекДанные = Элементы.СписокТоваров.ТекущиеДанные;
	Если ЭтоПотолок(ТекДанные.Номенклатура) Тогда
		ОтметитьУслугиИТоварыПотолка(ТекДанные.Заказывать, ТекДанные.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭтоПотолок(Номенклатура)
	Возврат Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Номенклатура);
КонецФункции

&НаКлиенте
Процедура СписокТоваровЗаказыватьПриИзменении(Элемент)
	
	ТекДанные = Элементы.СписокТоваров.ТекущиеДанные;
	Если ЭтоПотолок(ТекДанные.Номенклатура) Тогда
		ОтметитьУслугиИТоварыПотолка(ТекДанные.Заказывать, ТекДанные.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

