
&НаСервере
Процедура ОбновитьКарты()
    ОбрМенеджер = Обработки.ИА_БПМенеджер.СоздатьПоБизнесПроцессу(БП);
    
    КартаБПТекущая = ОбрМенеджер.ПолучитьКартуМаршрута();
    
    Если КартаМаршрутаТекущая <> КартаМаршрутаНовая Тогда
        КартаБПНовая = Справочники.ИА_БПКартыМаршрутов.ПолучитьКартуМаршрута(КартаМаршрутаНовая);	
    Иначе
        КартаБПНовая = ОбрМенеджер.ПолучитьКартуМаршрута();
    КонецЕсли; 
    
    КартаБПРезультат = ОбрМенеджер.БП_ПолучитьКартуМаршрутаПослеПерехода(КартаМаршрутаНовая, ТабВыполняемыеДействия);
    Элементы.ТабРекомендации.Видимость = ТабРекомендации.Количество() > 0;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
    ЭлРедактор = ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаРедактор;   
    
    
    Элементы.ГруппаРедактор.Видимость                                          = ЭлРедактор.Пометка;
    Элементы.ГруппаОтображатьКартыРедактор.Видимость                           = ЭлРедактор.Пометка;
    ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппаРедактор.Видимость = ЭлРедактор.Пометка;
    
    Элементы.ГруппаТекущая.Видимость        = ОтображатьКартуТекущую;
    Элементы.ГруппаНовая.Видимость          = ОтображатьКартуНовую;
    Элементы.ГруппаРезультат.Видимость      = ОтображатьКартуРезультат;	
КонецПроцедуры

&НаСервере
Процедура СформироватьПланДействийНаСервере()
    
    М = ТабЗадачиКИзменению.Выгрузить().ВыгрузитьКолонку("Точка");
    М = ИА_БФКС.Массив_ПолучитьУникальныеЭлементы(М);
    ИА_БФКС.Массив_УдалитьПоУсловию(М, "НЕ ЗначениеЗаполнено(Эл)");
    
    Если М.Количество() > 0 Тогда
        ОбрМенеджер = Обработки.ИА_БПМенеджер.Создать();
        ОбрМенеджер.Инициализировать(БП);
        Результат = ОбрМенеджер.БП_ПолучитьДействияДляПерехода(М, КартаМаршрутаНовая);
        
        ТабВыполняемыеДействия.Загрузить(Результат.ТабВыполняемыеДействия);
        ТабРекомендации.Загрузить(Результат.ТабРекомендации);
    Иначе
        ТабВыполняемыеДействия.Очистить();
        ТабРекомендации.Очистить();
    КонецЕсли;     
КонецПроцедуры


//_____________________________________________________________

&НаКлиенте
Процедура БППриИзменении(Элемент)
    БППриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура БППриИзмененииНаСервере()
    КартаМаршрутаТекущая = БП.ИА_КартаМаршрутаБП;
    КартаМаршрутаНовая   = БП.ИА_КартаМаршрутаБП;
    
    ТабЗадачиКИзменению.Очистить();
    ТабВыполняемыеДействия.Очистить();
    ТабРекомендации.Очистить();
    ОбновитьКарты();
КонецПроцедуры

&НаКлиенте
Процедура КартаБПТекущаяВыбор(Элемент)
	Если Элемент.ТекущийЭлемент <> Неопределено Тогда
		ИА_БПК.ПоказатьЗадачиПоТочке(БП, Элемент.ТекущийЭлемент.Имя);
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура КартаБПТекущаяВыборНаСервере(ИмяТочки)
    ОбрМенеджер = Обработки.ИА_БПМенеджер.Создать();
    ОбрМенеджер.Инициализировать(БП, КартаМаршрутаНовая);
    
    Точка = ОбрМенеджер.Точки_ПолучитьПоИмениТочки(ИмяТочки);
    Если не ЗначениеЗаполнено(Точка) Тогда
        ВызватьИсключение "Точки такой нет """ + ИмяТочки + """ !";
    КонецЕсли;
    
    ПереходныеТочки = ОбрМенеджер.Точки_ТипыДляЗадач();
    ПереходныеТочки.Добавить(Перечисления.ИА_БПТипыТочекМаршрута.Завершение);
    
    Если      Точка.ЭтоУведомление Тогда
        ИА_БФКС.СообщениеОбОшибке("На данную точку нельзя перейти, т.к. она является уведомлением!"); 
    ИначеЕсли Точка.Тип = Перечисления.ИА_БПТипыТочекМаршрута.ВложенныйБизнесПроцесс Тогда
        ИА_БФКС.СообщениеОбОшибке("На данную точку нельзя перейти, т.к. она создает вложенный бизнес-процесс!"); 
    ИначеЕсли ПереходныеТочки.Найти(Точка.Тип) <> Неопределено Тогда
        Если ТабЗадачиКИзменению.НайтиСтроки(Новый Структура("Точка", Точка)).Количество() = 0 Тогда
            НовСтрока = ТабЗадачиКИзменению.Добавить();
            НовСтрока.Точка = Точка;
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСхемы(Команда)
    ОбновитьКарты();
КонецПроцедуры

&НаКлиенте
Процедура КартаМаршрутаНоваяПриИзменении(Элемент)
    ТабЗадачиКИзменению.Очистить();
    ОбновитьКарты();
КонецПроцедуры

&НаКлиенте
Процедура КартаБПНоваяВыбор(Элемент)
    ТекЭл = Элемент.ТекущийЭлемент;
    Если ТекЭл <> Неопределено Тогда
        КартаБПТекущаяВыборНаСервере(ТекЭл.Имя);	
        СформироватьПланДействийНаСервере();
        ОбновитьКарты();
    КонецЕсли;     
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьКартуРезультатПриИзменении(Элемент)
    УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьКартуТекущуюПриИзменении(Элемент)
    УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьКартуНовуюПриИзменении(Элемент)
    УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если НЕ ИА_Защита_Общий.ЛицензияДоступна("НФ", Отказ) Тогда Возврат КонецЕсли; 
    
    ОтображатьКартуТекущую = Истина;
    ОтображатьКартуНовую = Истина;
    ОтображатьКартуРезультат = Истина;
    
    Элементы.ТабРекомендации.Видимость = Ложь;
	
	Если Параметры.Свойство("БП") Тогда
		БП = Параметры.БП;
		БППриИзмененииНаСервере();		
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура СформироватьПланДействий(Команда)
    СформироватьПланДействийНаСервере();
    ОбновитьКарты();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ТабЗадачиКИзменениюПриИзменении(Элемент)
    СформироватьПланДействийНаСервере();
    ОбновитьКарты();
КонецПроцедуры

&НаКлиенте
Процедура ТабВыполняемыеДействияПриИзменении(Элемент)
    ОбновитьКарты();
КонецПроцедуры

&НаКлиенте
Процедура Редактор(Команда)
    Эл = ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаРедактор;
    Эл.Пометка = НЕ Эл.Пометка;
    
    Если Эл.Пометка Тогда
    	Если КартаМаршрутаТекущая = КартаМаршрутаНовая Тогда
        	ОтображатьКартуТекущую = Ложь;
        КонецЕсли; 
    КонецЕсли; 
    
    УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНовыеЗадачи(Команда)
    ТабЗадачиКИзменению.Очистить();
    СформироватьПланДействийНаСервере();
    ОбновитьКарты();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПереходКНовомуСостояниюНаСервере()
    ОбрМенеджер = Обработки.ИА_БПМенеджер.Создать();
    ОбрМенеджер.Инициализировать(БП);
    ОбрМенеджер.БП_ВыполнитьПереход(КартаМаршрутаНовая, ТабВыполняемыеДействия);
    
    БППриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереходКНовомуСостоянию(Команда)
    Если ТабВыполняемыеДействия.Количество() > 0 Тогда
        ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьПереходКНовомуСостояниюДействие",ЭтаФорма)
        ,"Выполнить переход ?" + ?(ТабРекомендации.Количество() = 0 , ""
        , Символы.ПС + "ВНИМАНИЕ! Есть рекомендации по устранению конфликтов. Всё равно продолжить ?")
        ,РежимДиалогаВопрос.ОКОтмена);	
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереходКНовомуСостояниюДействие(РезультатВопроса, Параметры) Экспорт
    Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
        ВыполнитьПереходКНовомуСостояниюНаСервере();
		ОповеститьОбИзменении(БП);
		Оповестить("ОбновитьКарты", БП);
    КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ИмяСобытия = "ОбновитьКарты" И Параметр = БП Тогда
    	ОбновитьКарты();
    КонецЕсли; 
КонецПроцедуры

