
#Область НастройкиПодключения

Функция СформироватьНастройкиСинхронизации(НастройкаСинхронизации, ВидСинхронизации) Экспорт
	
	//пПараметры = Новый Структура;
	//пПараметры.Вставить("Операция"		, "");
	//пПараметры.Вставить("ВремяЗапуска"	, Формат(ТекущаяДата(), "ДЛФ=T"));
	//пПараметры.Вставить("ВидЗапуска"	, "Служебное выполнение rest api");
	//пПараметры.Вставить("НомерСообщения", 0);
	//
	//ОбщиеНастройки = ОбменСБитрикс24ВызовСервера.ПолучитьБазовыеДанныеДляСинхронизации(НастройкаСинхронизации , пПараметры);	
	//
	//Если ОбщиеНастройки = Неопределено Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить настройки. Подробности в логе синхронизации.");
	//	Возврат Неопределено;
	//КонецЕсли;   
	
	//ВремяЗапуска = Формат(ТекущаяДата(), "ДЛФ=T");
	Если ВидСинхронизации = 1 Тогда
		ВидСинхронизацииСтрокой = "Обмен в режиме реального времени";
	ИначеЕсли ВидСинхронизации = 0 Тогда
		ВидСинхронизацииСтрокой = "По расписанию";
	ИначеЕсли ВидСинхронизации = 7 Тогда
		ВидСинхронизацииСтрокой = "Выгрузка печатных форм";
	ИначеЕсли ВидСинхронизации = 9 Тогда
		ВидСинхронизацииСтрокой = "Через команду перейти";
	Иначе
		ВидСинхронизацииСтрокой = "Интерактивная синхронизация";
	КонецЕсли;
	
	//БазовыеПараметры = Новый Структура;
	//БазовыеПараметры.Вставить("Операция"	, "");
	//БазовыеПараметры.Вставить("ВремяЗапуска"	, ВремяЗапуска);
	//БазовыеПараметры.Вставить("ВидЗапуска"		, ВидСинхронизацииСтрокой);
	//БазовыеПараметры.Вставить("НомерСообщения"	, 0);
	
	ОбщиеНастройки = ОбменСБитрикс24ВызовСервера.СформироватьСтруктуруНастроек(НастройкаСинхронизации); //, БазовыеПараметры);  
	
	Если ОбщиеНастройки = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить настройки. Подробности в логе синхронизации.");
		Возврат Неопределено;
	КонецЕсли;   
	
	//ОбщиеНастройки.Вставить("ВремяЗапуска"					, ВремяЗапуска);
	ОбщиеНастройки.Вставить("ПолнаяЗагрузка"				, Истина);
	ОбщиеНастройки.Вставить("ВидСинхронизации"				, ВидСинхронизацииСтрокой);
	ОбщиеНастройки.Вставить("СтатусПроверки"				, 0);
	//ОбщиеНастройки.Вставить("НомерСообщения"				, 0);
	
	ОбщиеНастройки.Вставить("ВыполненоБезОшибок"			, Истина);
	ОбщиеНастройки.Вставить("ИдПроцессаЗагрузки"			, "");
	
	Возврат ОбщиеНастройки;
	
КонецФункции

Функция ПолучитьНастройкиПодключения(СтруктураНастроек) Экспорт

	НастройкиПодключения = Новый Структура;
	лАдрес = СтруктураНастроек.НастройкиПодключения.АдресСайта;
	
	//ИнформацияОПриложении = ИнформацияОПриложении();
	//
	//НастройкиПодключения.Вставить("КодПриложения"			, ИнформацияОПриложении.КодПриложения);
	//НастройкиПодключения.Вставить("СекретныйКодПриложения"	, ИнформацияОПриложении.СекретныйКодПриложения);
	//НастройкиПодключения.Вставить("ОбластьВидимости"		, ИнформацияОПриложении.ОбластьВидимости);
	//НастройкиПодключения.Вставить("АдресСайта"				, лАдрес);

	НастройкиПодключения.Вставить("АдресСайта", лАдрес);
	
	Если НЕ РазобратьАдресСайта(лАдрес, НастройкиПодключения) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат НастройкиПодключения;
	
КонецФункции

Функция ДобавлениеНастроекПодключения(ОбщиеНастройки) Экспорт
	
	Если НЕ ПолучитьНастройкиАвторизации(ОбщиеНастройки) Тогда
		ОбменСБитрикс24ВызовСервера.ДобавитьВЛог(ОбщиеНастройки, ПредопределенноеЗначение("Перечисление.ТипыСообщенийОбменаСБитрикс24.КритическаяОшибка"), "Ошибка при получении параметров подключения к сайту авторизации. Выгрузка отчетов невозможна.");
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьНастройкиАвторизации(ОсновныеНастройки)
	
	НастройкиПодключения = Новый Структура;
	
	ИнформацияОПриложении = ИнформацияОПриложении();
	
	НастройкиПодключения.Вставить("КодПриложения"			, ИнформацияОПриложении.КодПриложения);
	НастройкиПодключения.Вставить("СекретныйКодПриложения"	, ИнформацияОПриложении.СекретныйКодПриложения);
	НастройкиПодключения.Вставить("ОбластьВидимости"		, ИнформацияОПриложении.ОбластьВидимости);
	НастройкиПодключения.Вставить("АдресСайта"				, ИнформацияОПриложении.АдресСайта);
	
	НастройкиПодключения.Вставить("Токен"					, "");
	НастройкиПодключения.Вставить("ВременныйТокен"			, "");
	НастройкиПодключения.Вставить("НовыйТокен"				, "");
	
	Если НЕ РазобратьАдресСайта(ИнформацияОПриложении.АдресСайта, НастройкиПодключения) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ОсновныеНастройки.Вставить("НастройкиПодключенияАвторизации", НастройкиПодключения);
	
	
	НастройкиПодключения = Новый Структура;
	НастройкиПодключения.Вставить("АдресСайта", "");
	ОсновныеНастройки.Вставить("НастройкиПодключения", НастройкиПодключения);
	
	Возврат Истина;
	
КонецФункции

Функция ИнформацияОПриложении()
	
	Результат = Новый Структура;
	
	//Результат.Вставить("КодПриложения"			, "app.5c924250175064.25846993");              //Приложение бэкофиса
	//Результат.Вставить("СекретныйКодПриложения"	, "WMybJCuyBXXON42V6VyVfT8PF65oMYDBCQz3QP6y7RDc9o5qSe");
	
	//Результат.Вставить("КодПриложения"			, "app.552d288cc83c88.78059741");             //Синхронизация
	//Результат.Вставить("СекретныйКодПриложения"	, "a49b3d28c435cec6ea7d8ba53cd9c9be");
		
	Результат.Вставить("КодПриложения"			, "app.60671a49a3ea13.12951119");                 //Коннектор
	Результат.Вставить("СекретныйКодПриложения"	, "jmfeaApP01e61AfIhpgKDnPgD1BimrowXtFR7slj39IERWslbV");
	
	Результат.Вставить("АдресСайта"				, "https://oauth.bitrix.info");
	Результат.Вставить("ОбластьВидимости"		, "user,department,log,sonet_group");
	
	Возврат Результат;
	
КонецФункции

Функция РазобратьАдресСайта(Знач АдресСайта, НастройкиПодключения)Экспорт 
	
	АдресСайта = СокрЛП(АдресСайта); 
	
	Сервер		 		 = ""; 
	Порт				 = 0;
	АдресСкрипта 		 = "";
	ЗащищенноеСоединение = Ложь;
	
	Если НЕ ПустаяСтрока(АдресСайта) Тогда
		
		АдресСайта = СтрЗаменить(АдресСайта, "\", "/");
		АдресСайта = СтрЗаменить(АдресСайта, " ", "");
		
		Если НРег(Лев(АдресСайта, 7)) = "http://" Тогда
			
			АдресСайта = Сред(АдресСайта, 8);
			
		ИначеЕсли НРег(Лев(АдресСайта, 8)) = "https://" Тогда
			
			АдресСайта = Сред(АдресСайта, 9);
			ЗащищенноеСоединение = Истина;
			
		КонецЕсли;
		
		ПозицияСлэша = Найти(АдресСайта, "/");
		
		Если ПозицияСлэша > 0 Тогда
			
			Сервер 		 = Лев(АдресСайта, ПозицияСлэша - 1);	
			АдресСкрипта = Прав(АдресСайта, СтрДлина(АдресСайта) - ПозицияСлэша);
			
		Иначе
			
			Сервер 		 = АдресСайта;
			АдресСкрипта = "";
			
		КонецЕсли;
		
		ПозицияДвоеточия = Найти(Сервер, ":");
		ПортСтрока = "0";
		
		Если ПозицияДвоеточия > 0 Тогда
			
			СерверСПортом = Сервер;
			Сервер		  = Лев(СерверСПортом, ПозицияДвоеточия - 1);
			ПортСтрока 	  = Прав(СерверСПортом, СтрДлина(СерверСПортом) - ПозицияДвоеточия);
			
		КонецЕсли;
		
		Попытка
			
			Порт = Число(ПортСтрока);
			
		Исключение
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось получить номер порта ('") + ПортСтрока + ")"
			+ Символы.ПС + НСтр("ru = 'Проверьте правильность ввода адреса сайта.'"));
			
			Возврат Ложь;
			
		КонецПопытки;
		
		Если Порт = 0 Тогда
			
			Порт = ?(ЗащищенноеСоединение, 443, 80);
			
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиПодключения.Вставить("Сервер"	  				, Сервер); 
	НастройкиПодключения.Вставить("Порт"		   			, Порт);
	НастройкиПодключения.Вставить("АдресСкрипта"			, АдресСкрипта);
	НастройкиПодключения.Вставить("ЗащищенноеСоединение"	, ЗащищенноеСоединение);
	
	Если НЕ НастройкиПодключения.Свойство("АдресСайта") Тогда
		АдресСайта = ?(ЗащищенноеСоединение, "https://", "http://") + Сервер;
		НастройкиПодключения.Вставить("АдресСайта", АдресСайта);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьВЛогИОповестить(ОбщиеНастройки, ТипСообщения, ТекстСообщения) Экспорт
	
	// оптимизируем передачу, т.к. часто используется
	ПередаваемыеДанныеНаСервер = Новый Структура( );
	ПередаваемыеДанныеНаСервер.Вставить("НастройкаПодключения"		, ОбщиеНастройки.НастройкаПодключения);
	ПередаваемыеДанныеНаСервер.Вставить("Операция"					, ОбщиеНастройки.Операция);
	
	Логирование = Новый Структура;
	Логирование.Вставить("НомерСообщения"			, ОбщиеНастройки.Логирование.НомерСообщения);
	Логирование.Вставить("ВремяЗапуска"				, ОбщиеНастройки.Логирование.ВремяЗапуска);
	Логирование.Вставить("Измерение1"				, ОбщиеНастройки.Логирование.Измерение1);
	Логирование.Вставить("Измерение2"				, ОбщиеНастройки.Логирование.Измерение2);
	Логирование.Вставить("Измерение3"				, ОбщиеНастройки.Логирование.Измерение3);
	Логирование.Вставить("Измерение4"				, ОбщиеНастройки.Логирование.Измерение4);
	Логирование.Вставить("Измерение5"				, ОбщиеНастройки.Логирование.Измерение5);
	Логирование.Вставить("Измерение6"				, ОбщиеНастройки.Логирование.Измерение6);
	ПередаваемыеДанныеНаСервер.Вставить("Логирование", Логирование);
	
	ОбменСБитрикс24ВызовСервера.ДобавитьВЛог(ПередаваемыеДанныеНаСервер, ТипСообщения, ТекстСообщения);  
	
	ОбщиеНастройки.Логирование.НомерСообщения = ПередаваемыеДанныеНаСервер.Логирование.НомерСообщения;
	    
КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////
#Область ВыполнениеОбмена

&НаСервере
Процедура ВыполнитьСинхронизациюПоРасписанию(НастройкаСинхронизации) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	Если НЕ ЗначениеЗаполнено(НастройкаСинхронизации) Тогда
		
		ЗаписьЖурналаРегистрации("Обмен с Битрикс 24",
			УровеньЖурналаРегистрации.Ошибка,
			НастройкаСинхронизации.Метаданные(),
			НастройкаСинхронизации,
			НСтр("ru = 'Не найдена настройка обмена'") + " " + НастройкаСинхронизации);
		
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьСинхронизацию(НастройкаСинхронизации, 0);
	
КонецПроцедуры

Процедура ВыполнитьСинхронизациюПоФоновомуЗаданию(ПараметрыСинхронизации, АдресРезультата = Неопределено) Экспорт
	
	НастройкаСинхронизации  = ПараметрыСинхронизации.НастройкаСинхронизации;
	ВидСинхронизации		= ПараметрыСинхронизации.ВидСинхронизации;
	
	ВыполнитьСинхронизацию(НастройкаСинхронизации, ВидСинхронизации);
	
	#Если Сервер Тогда
	ПоместитьВоВременноеХранилище(ПолучитьСообщенияПользователю(Истина), АдресРезультата);
	#КонецЕсли	

КонецПроцедуры

Процедура ВыполнитьСинхронизацию(НастройкаСинхронизации, ВидСинхронизации) Экспорт
	
	ОбщиеНастройки = СформироватьНастройкиСинхронизации(НастройкаСинхронизации, ВидСинхронизации);
	
	Если ОбщиеНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеНастройки.ВыполненоБезОшибок = Истина;
		
	ОбщиеНастройки.Логирование.Измерение2 = "Загрузка данных с Битрикс24";
	ЗапуститьВыполнениеЗагрузки(ОбщиеНастройки);
	
	Если ОбщиеНастройки.ВыполненоБезОшибок Тогда
		
		ОбщиеНастройки.Логирование.Измерение2 = "Выгрузка данных в Битрикс24";
		ЗапуститьВыполнениеОчередиВыгрузки(ОбщиеНастройки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанных

Процедура ЗапуститьВыполнениеЗагрузки(ОбщиеНастройки) Экспорт
	
	Если ОбщиеНастройки.НастройкаПодключения.СинхронизацияСделок Тогда
		ОбработатьЗагрузкуДанныхПолнойВыгрузки(ОбщиеНастройки, "Сделки");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьЗагрузкуДанныхПолнойВыгрузки(ОбщиеНастройки, Операция)
	
	ОбщиеНастройки.Логирование.Измерение3 = "Полная загрузка данных с портала с типом: " + Строка(Операция);
		
	ОбщиеНастройки.Операция = Операция; 
	ЗагрузитьСПорталаИОбработать(ОбщиеНастройки);
	
	ОбщиеНастройки.Логирование.Измерение3 = "";
	
КонецПроцедуры

Процедура ЗагрузитьСПорталаИОбработать(ОбщиеНастройки, МассивЭлементов = Неопределено) Экспорт 
	
	ОбщиеНастройки.Логирование.Измерение4 = Строка(ОбщиеНастройки.Операция);
	
	Если ОбщиеНастройки.Операция = "Сделки" Тогда
		ОтборПоПараметру = "filter[>DATE_MODIFY]=" + Формат(ОбщиеНастройки.ДатаНачала_Модифицированы, "ДФ=dd.MM.yyyyTHH:mm:ss"); // Формат 2020-04-06T00:00:00
		//++ №9040 меняем метод на загрузку сделок
		//ЗагрузитьДанныеСПортала(ОбщиеНастройки, "crm.lead.list", "select[]=ID",, ОтборПоПараметру);
		ЗагрузитьДанныеСПортала(ОбщиеНастройки, "crm.deal.list", "select[]=ID",, ОтборПоПараметру);
		//-- №9040
	КонецЕсли;
	
	ОбщиеНастройки.Логирование.Измерение4 = "";
	
КонецПроцедуры

Процедура ЗагрузитьДанныеСПортала(ОбщиеНастройки, Метод, Фильтр = "" ,ОбязательныйОтбор = "", ОтборПоПараметру = "")
	
	МетодПолностью 			= "/rest/" + Метод;
	ПараметрыHTTPЗапроса 	= ?(ЗначениеЗаполнено(Фильтр), "&" + Фильтр, "" ) + ?(ЗначениеЗаполнено(ОбязательныйОтбор), "&" + ОбязательныйОтбор, "" ) + ?(ЗначениеЗаполнено(ОтборПоПараметру), "&" + ОтборПоПараметру, "");
	
	СтруктураОтвета 	 		= Неопределено;
	КоличествоВыполнений 		= 0;
	ОбщиеНастройки.Логирование.Измерение6 	= "0";
	КоличествоПовторенийПриОшибках = 0;
	
	Пока СтруктураОтвета = Неопределено И (КоличествоВыполнений < КоличествоПовторенийПриОшибках ИЛИ КоличествоВыполнений = 0) Цикл
		
		Если КоличествоВыполнений > 0 Тогда
			ОбщиеНастройки.Логирование.Измерение5 = "Повторная загрузка данных с портала с типом: " + Строка(ОбщиеНастройки.Операция);
		Иначе
			ОбщиеНастройки.Логирование.Измерение5 = "Загрузка данных с портала с типом: " + Строка(ОбщиеНастройки.Операция);
		КонецЕсли;
		
		ДобавитьВЛогИОповестить(ОбщиеНастройки, ОбщиеНастройки.ТипыСообщений.Информация, "Начало загрузки данных с портала с типом: " + Строка(ОбщиеНастройки.Операция));
		
		СтруктураОтвета = ОбменСБитрикс24ВызовСервера.ОтправкаДанныхНаПортал(ОбщиеНастройки, МетодПолностью, ПараметрыHTTPЗапроса);
		
		ДобавитьВЛогИОповестить(ОбщиеНастройки, ОбщиеНастройки.ТипыСообщений.Информация, "Завершение загрузки данных с портала с типом: " + Строка(ОбщиеНастройки.Операция));
		
		КоличествоВыполнений = КоличествоВыполнений + 1;
		
	КонецЦикла;
	
	Если СтруктураОтвета = Неопределено Тогда
		ОбщиеНастройки.ВыполненоБезОшибок = Ложь;
		Возврат;
	КонецЕсли;
	
	ОбщиеНастройки.Логирование.Измерение5 = "Обработка данных с типом: " + Строка(ОбщиеНастройки.Операция) + " в 1С";
	
	ДобавитьВЛогИОповестить(ОбщиеНастройки, ОбщиеНастройки.ТипыСообщений.Информация, "Начало обработки данных в 1С, пришедших  с портала с типом: " + Строка(ОбщиеНастройки.Операция));
	ОбработатьДанныеСПортала(ОбщиеНастройки, СтруктураОтвета);
	ДобавитьВЛогИОповестить(ОбщиеНастройки, ОбщиеНастройки.ТипыСообщений.Информация, "Завершена обработка данных в 1С, пришедших  с портала с типом: " + Строка(ОбщиеНастройки.Операция));
	
	Следующие = СтруктураОтвета.Получить("next");
	
	Пока ЗначениеЗаполнено(Следующие) Цикл
		
		Следующие = Формат(Следующие, "ЧГ=0");
		
		ОбщиеНастройки.Логирование.Измерение6 = Строка(Следующие);
		
		КоличествоВыполнений = 0;
		
		ТелоHTTPЗапроса = ПараметрыHTTPЗапроса + "&start="+Следующие;	
		
		Пока СтруктураОтвета = Неопределено И КоличествоВыполнений < ОбщиеНастройки.КоличествоПовторенийПриОшибках Цикл
			
			Если КоличествоВыполнений > 0 Тогда
				ОбщиеНастройки.Логирование.Измерение5 = "Повторная загрузка данных с портала с типом: " + Строка(ОбщиеНастройки.Операция);
			Иначе
				ОбщиеНастройки.Логирование.Измерение5 = "Загрузка данных с портала с типом: " + Строка(ОбщиеНастройки.Операция);
			КонецЕсли;
			
			ДобавитьВЛогИОповестить(ОбщиеНастройки, ОбщиеНастройки.ТипыСообщений.Информация, "Начало загрузки данных с портала с типом: " + Строка(ОбщиеНастройки.Операция));
			
			СтруктураОтвета = ОбменСБитрикс24ВызовСервера.ОтправкаДанныхНаПортал(ОбщиеНастройки, МетодПолностью, ТелоHTTPЗапроса); 
			
			ДобавитьВЛогИОповестить(ОбщиеНастройки, ОбщиеНастройки.ТипыСообщений.Информация, "Завершение загрузки данных с портала с типом: " + Строка(ОбщиеНастройки.Операция));
			
			КоличествоВыполнений = КоличествоВыполнений + 1;
			
		КонецЦикла;
		
		Если СтруктураОтвета = Неопределено Тогда
			ОбщиеНастройки.ВыполненоБезОшибок = Ложь;
			Возврат;
		КонецЕсли;
		
		ОбщиеНастройки.Логирование.Измерение5 = "Обработка данных с типом: " + Строка(ОбщиеНастройки.Операция) + " в 1С";
		
		ДобавитьВЛогИОповестить(ОбщиеНастройки, ОбщиеНастройки.ТипыСообщений.Информация, "Начало обработки данных в 1С, пришедших  с портала с типом: " + Строка(ОбщиеНастройки.Операция));
		ОбработатьДанныеСПортала(ОбщиеНастройки, СтруктураОтвета);
		ДобавитьВЛогИОповестить(ОбщиеНастройки, ОбщиеНастройки.ТипыСообщений.Информация, "Завершена обработка данных в 1С, пришедших  с портала с типом: " + Строка(ОбщиеНастройки.Операция));
		
		Следующие = СтруктураОтвета.Получить("next");
		СтруктураОтвета = Неопределено;
	КонецЦикла;
	
	ОбщиеНастройки.Логирование.Измерение5 = "";
	ОбщиеНастройки.Логирование.Измерение6 = "";
	
КонецПроцедуры

Процедура ОбработатьДанныеСПортала(ОбщиеНастройки, СтруктураОтвета, ДополнительныйКлюч = Неопределено)
	
	мДанных = Новый Массив;
	                             
	Если СтруктураОтвета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	result = СтруктураОтвета.Получить("result");
	Если result <> Неопределено Тогда
		
		Если ТипЗнч(result)=Тип("Массив") Тогда
			мДанных = result;	
		Иначе
			
			Если ДополнительныйКлюч = Неопределено Тогда
			
				result2 = result.Получить("result");
				
				Если result2 <> Неопределено Тогда
					
					Для каждого ТекЭлемент Из result2 Цикл
						Для каждого ТекЭлемент2 Из ТекЭлемент Цикл
							мДанных.Добавить(ТекЭлемент2);
						КонецЦикла;
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе                 
				
				result2 = result.Получить(ДополнительныйКлюч);
				
				Если result2 <> Неопределено Тогда
					
					Для каждого ТекЭлемент Из result2 Цикл
						мДанных.Добавить(ТекЭлемент);
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если мДанных.количество() > 0 Тогда
		
		Если ОбщиеНастройки.Операция = "Сделки" Тогда
			
			ПодробныеДанные = Новый Структура;
			
			//++ №9040 меняем метод на загрузку сделок, а также необходимо получить контакты
			//ПодробныеДанные.Вставить("ИнформацияОЛидах", ПолучитьПодробныеДанныеЧерезGET(ОбщиеНастройки, "crm.lead.get", мДанных));
			//РезультатОбработки = ОбменСБитрикс24ВызовСервера.ЗагрузитьОбновитьЛиды(ОбщиеНастройки, ПодробныеДанные);
			
			ПодробныеДанные.Вставить("ИнформацияОСделках", ПолучитьПодробныеДанныеЧерезGET(ОбщиеНастройки, "crm.deal.get", мДанных));
			ПодробныеДанные.Вставить("ИнформацияОКонтактах", ПолучитьИнформациюОКонтактах(ОбщиеНастройки, ПодробныеДанные.ИнформацияОСделках));
			
			РезультатОбработки = ОбменСБитрикс24ВызовСервера.ЗагрузитьОбновитьСделки(ОбщиеНастройки, ПодробныеДанные);
			//-- №9040
		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

//++ №9040 получаем контакты по сделкам
Функция ПолучитьИнформациюОКонтактах(ОбщиеНастройки, ДанныеСделок)
	
	// Получим список ИД контактов, указанных в сделках, после получим по ИД все данные из Битрикса
	МассивИДКонтактов = новый Массив;
	Для Каждого ТекущаяСделка Из ДанныеСделок Цикл
		КонтактИД = ТекущаяСделка.Получить("CONTACT_ID");
		Если НЕ КонтактИД = Неопределено 
			И ЗначениеЗаполнено(КонтактИД) 
			И НЕ КонтактИД = "0" 
			Тогда
			СоответствиеИД = новый Соответствие;
			СоответствиеИД.Вставить("ID", КонтактИД);
			МассивИДКонтактов.Добавить(СоответствиеИД);
		КонецЕсли;		
	КонецЦикла;
	
	Возврат ПолучитьПодробныеДанныеЧерезGET(ОбщиеНастройки, "crm.contact.get", МассивИДКонтактов);
	
КонецФункции
//-- №9040

Функция ПолучитьПодробныеДанныеЧерезGET(ОбщиеНастройки, Метод, мДанных, НазваниеПараметра= "id")
	
	РезультатОбработки = Новый Массив; 
	
	ТелоHTTPЗапроса= "";
	
	Для каждого ТекЭлемент Из мДанных Цикл
		
		ИдЭлемента = Формат(ТекЭлемент.Получить("ID"), "ЧГ=0");
		ИдЭлемента = ?(ЗначениеЗаполнено(ИдЭлемента), ИдЭлемента, Формат(ТекЭлемент.Получить("id"), "ЧГ=0"));
			
		ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd[]=" + ОбменСБитрикс24ВызовСервера.ЗакодироватьСтрокуСервер(Метод + "?"+НазваниеПараметра+"=" + ИдЭлемента);
	КонецЦикла;
	
	СтруктураОтвета = ОбменСБитрикс24ВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(ОбщиеНастройки, ТелоHTTPЗапроса);
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат РезультатОбработки;
	КонецЕсли;
	
	result = СтруктураОтвета.Получить("result");
	Если result <> Неопределено Тогда
		result2 = result.Получить("result");
		Если result2 <> Неопределено Тогда
			РезультатОбработки = result2;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатОбработки;			
	
КонецФункции

#КонецОбласти

//++ №9700
#Область ВыгрузкаДанных

Процедура ЗапуститьВыполнениеОчередиВыгрузки(ОбщиеНастройки) Экспорт
	
	//СформироватьИОтправить(ОбщиеНастройки, "Выгрузка номенклатуры");
	
	//ТипДанных = "Выгрузка заказов как счетов";
	//СформироватьИОтправить(ОбщиеНастройки, ТипДанных);
	
	//++ №14571
	Если ОбщиеНастройки.НастройкаПодключения.СинхронизацияКонтрагентов Тогда
		
		ТипДанных = "Выгрузка контрагентов";
		
		ОбщиеНастройки.Логирование.Измерение3 = "Полная выгрузка данных на портал с типом: " + ТипДанных;
		СформироватьИОтправить(ОбщиеНастройки, ТипДанных);
		
	КонецЕсли;
	
	Если ОбщиеНастройки.НастройкаПодключения.СинхронизацияКонтрагентов Тогда
		
		ТипДанных = "Выгрузка контактных лиц";
		
		ОбщиеНастройки.Логирование.Измерение3 = "Полная выгрузка данных на портал с типом: " + ТипДанных;
		СформироватьИОтправить(ОбщиеНастройки, ТипДанных);
		
	КонецЕсли;
	//-- №14571
	
	Если ОбщиеНастройки.НастройкаПодключения.СинхронизацияСделок 
		И ОбменСБитрикс24ВызовСервера.НастройкиСинхронизацииЛидов(ОбщиеНастройки.НастройкаПодключения, "ВыгружатьИнформациюПоЛидам") = Истина Тогда
		
		ТипДанных = "Информация по лидам";
		
		ОбщиеНастройки.Логирование.Измерение3 = "Полная выгрузка данных на портал с типом: " + ТипДанных;
		СформироватьИОтправить(ОбщиеНастройки, ТипДанных);
		
	КонецЕсли;
	
	ОбщиеНастройки.Логирование.Измерение3 = "";
	
КонецПроцедуры

Процедура СформироватьИОтправить(ОбщиеНастройки, ТипДанных) Экспорт
	
	ОбщиеНастройки.Логирование.Измерение4 = Строка(ТипДанных);
	
	Если ОбщиеНастройки.СтатусПроверкиОчереди = 0 Тогда
		ОбщиеНастройки.Логирование.Измерение5 = "Первая отправка данных на портал"
	ИначеЕсли ОбщиеНастройки.СтатусПроверкиОчереди = 2 Тогда
		ОбщиеНастройки.Логирование.Измерение5 = "Повторная отправка данных на портал"
	КонецЕсли;
	
	Если ОбщиеНастройки.СтатусПроверкиОчереди = 0 Тогда
		ДобавитьВЛогИОповестить(ОбщиеНастройки, ОбщиеНастройки.ТипыСообщений.Информация, "Начало выгрузки объектов с типом: " + Строка(ТипДанных));
	ИначеЕсли ОбщиеНастройки.СтатусПроверкиОчереди = 2 Тогда
		ДобавитьВЛогИОповестить(ОбщиеНастройки, ОбщиеНастройки.ТипыСообщений.Информация, "Повторная выгрузки объектов с типом: " + Строка(ТипДанных));
	КонецЕсли;
	
	ПодготовкаИВыгрузкаДанныхНаПортал(ОбщиеНастройки, ТипДанных);
	
	Если ОбщиеНастройки.СтатусПроверкиОчереди = 0 Тогда
		ДобавитьВЛогИОповестить(ОбщиеНастройки,  ОбщиеНастройки.ТипыСообщений.Информация, "Завершение выгрузки объектов с типом: " + Строка(ТипДанных));
	ИначеЕсли ОбщиеНастройки.СтатусПроверкиОчереди = 2 Тогда
		ДобавитьВЛогИОповестить(ОбщиеНастройки, ОбщиеНастройки.ТипыСообщений.Информация, "Повторная выгрузка объектов с типом: " + Строка(ТипДанных) + " завершена");
	КонецЕсли;
	
	ОбщиеНастройки.Логирование.Измерение4 = "";
	ОбщиеНастройки.Логирование.Измерение5 = "";
	ОбщиеНастройки.Логирование.Измерение6 = "";
	
КонецПроцедуры

Процедура ПодготовкаИВыгрузкаДанныхНаПортал(ОбщиеНастройки, ТипДанных)
	
	СформированныеДанные = Новый Массив;
	
	ТипОбъекта = Неопределено;
	
	Если ТипДанных = "Информация по лидам" Тогда    			
		
		ТипОбъекта = Тип("ДокументСсылка.Лид");
		СформированныеДанные =  ОбменСБитрикс24ВызовСервера.СформироватьДанныеПоЛидам(ОбщиеНастройки);
		
	ИначеЕсли ТипДанных = "Выгрузка контрагентов" Тогда    			
		
		ТипОбъекта = Тип("СправочникСсылка.Контрагенты");
		СформированныеДанные =  ОбменСБитрикс24ВызовСервера.СформироватьДанныеПоКонтрагентам(ОбщиеНастройки);
		
	ИначеЕсли ТипДанных = "Выгрузка контактных лиц" Тогда    			
		
		ТипОбъекта = Тип("СправочникСсылка.КонтактныеЛица");
		СформированныеДанные =  ОбменСБитрикс24ВызовСервера.СформироватьДанныеПоКонтактнымЛицам(ОбщиеНастройки);
		
	ИначеЕсли ТипДанных = "Выгрузка номенклатуры" Тогда	
		ТипОбъекта = Тип("СправочникСсылка.Номенклатура");
		СформированныеДанные = ОбменСБитрикс24ВызовСервера.СформироватьДанныеНоменклатуры(ОбщиеНастройки);
		
	ИначеЕсли ТипДанных = "Выгрузка заказов как счетов" Тогда
		ТипОбъекта = Тип("ДокументСсылка.ЗаказПокупателя");
		СформированныеДанные = ОбменСБитрикс24ВызовСервера.СформироватьДанныеПоЗаказамПокупателейКакПоСчетам(ОбщиеНастройки);
		
	КонецЕсли;
	
	ВыгрузкаДанныхНаПортал(ОбщиеНастройки, ТипДанных, СформированныеДанные, ТипОбъекта);
	
	ОбщиеНастройки.Логирование.Измерение6 = "";
	
КонецПроцедуры

Процедура ВыгрузкаДанныхНаПортал(ОбщиеНастройки, ТипДанных, СформированныеДанные, ТипОбъекта)
	
	Если СформированныеДанные.Количество() > 0 Тогда
		
		ТелоHTTPЗапроса= "";
		Для каждого ТекЭлемент Из СформированныеДанные Цикл
			ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + ТекЭлемент;	
		КонецЦикла;
		
		СтруктураОтвета = ОбменСБитрикс24ВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(ОбщиеНастройки, ТелоHTTPЗапроса);
		
		Если СтруктураОтвета = Неопределено Тогда
			ОбщиеНастройки.ВыполненоБезОшибок = Ложь;
			Возврат;	
		КонецЕсли;
		
		Если СтруктураОтвета.Получить("result") <> Неопределено Тогда
			
			СтруктураОтвета2 = СтруктураОтвета.Получить("result");
			
			Если СтруктураОтвета2.Получить("result") <> Неопределено Тогда
				
				Для каждого ТекСтрока Из СтруктураОтвета2.Получить("result") Цикл
					
					лОбъект = ОбменСБитрикс24ВызовСервера.ПолучитьЗначениеПоXML(ТипОбъекта, ТекСтрока.Ключ);	
					
					Если НЕ ЗначениеЗаполнено(лОбъект) Тогда
						ДобавитьВЛогИОповестить(ОбщиеНастройки,  ОбщиеНастройки.ТипыСообщений.Ошибка, "Не найден объект с ид: " + Строка(ТекСтрока.Ключ));  
						ОбщиеНастройки.ВыполненоБезОшибок = Ложь;
					Иначе
						
						Если ТипЗнч(ТекСтрока.Значение) = Тип("Булево") Тогда
							
							Если ТекСтрока.Значение Тогда
								ОбменСБитрикс24ВызовСервера.УдалитьОбъектИзОчереди(ОбщиеНастройки, лОбъект);
							КонецЕсли;
							
						Иначе 
							
							Если ОбменСБитрикс24ВызовСервера.ЗаписатьИдБ24Объекта(ОбщиеНастройки, лОбъект, ТекСтрока.Значение) Тогда
								ОбменСБитрикс24ВызовСервера.УдалитьОбъектИзОчереди(ОбщиеНастройки, лОбъект);
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			Если СтруктураОтвета2.Получить("result_error") <> Неопределено Тогда
				
				Для каждого ТекСтрока Из СтруктураОтвета2.Получить("result_error") Цикл
					
					лОписаниеОшибки = ТекСтрока.Значение.Получить("error_description");
					
					лОбъект = ОбменСБитрикс24ВызовСервера.ПолучитьЗначениеПоXML(ТипОбъекта, ТекСтрока.Ключ);	
					
					Если НЕ ЗначениеЗаполнено(лОбъект) Тогда
						ДобавитьВЛогИОповестить(ОбщиеНастройки,  ОбщиеНастройки.ТипыСообщений.Ошибка, лОписаниеОшибки + " у не найденного объекта с ид: " + Строка(ТекСтрока.Ключ));   
					Иначе
						ДобавитьВЛогИОповестить(ОбщиеНастройки,  ОбщиеНастройки.ТипыСообщений.Ошибка, лОписаниеОшибки + " у объекта: " + Строка(лОбъект));   
						РазобратьОшибку(ОбщиеНастройки, ТипДанных, лОбъект, лОписаниеОшибки);
					КонецЕсли;	
					
					ОбщиеНастройки.ВыполненоБезОшибок = Ложь;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			ДобавитьВЛогИОповестить(ОбщиеНастройки,  ОбщиеНастройки.ТипыСообщений.Ошибка, "Не удалось разобрать JSON ответа");
			ДобавитьВЛогИОповестить(ОбщиеНастройки,  ОбщиеНастройки.ТипыСообщений.Ошибка, "Тело отправляемого запроса: " + ТелоHTTPЗапроса);
			
			ОбщиеНастройки.ВыполненоБезОшибок = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РазобратьОшибку(ОбщиеНастройки, ТипДанных, Объект, ОписаниеОшибки)
	
	НастройкаСинхронизации = ОбщиеНастройки.НастройкаПодключения;
	
	Если ОбщиеНастройки.Операция = "Сделки" Тогда
		
		Если СтрНайти(ОписаниеОшибки, "ot found") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
			ОбменСБитрикс24ВызовСервера.УдалитьОбъектИзОчереди(ОбщиеНастройки, Объект);  
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
//-- №9700


