Процедура ВыполнитьОбмен() Экспорт
	ВнешняяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Выгрузка цен на сайт (обмен с сайтом)");
	ДвоичныеДанные = ВнешняяОбработка.ХранилищеОбработки.Получить();
	ИмяВременногоФайла = КаталогВременныхФайлов()+"ОбработкаХМЛ.epf";
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	СтруктураЗащита=новый ОписаниеЗащитыОтОпасныхДействий;
	СтруктураЗащита.ПредупреждатьОбОпасныхДействиях=ложь;
	//Создаем структуру защиты от опасных действий
	Обработка = ВнешниеОбработки.Создать(ИмяВременногоФайла,Ложь,СтруктураЗащита);
	Обработка.ВыгрузитьЦеныНаСайт();
	
	
КонецПроцедуры