
#Область ПрограммныйИнтерфейс

//Процедура РаспределитьСкидкуБонусамиПоСтрокамДокумента(ДокОбъект) Экспорт
//	
//	БонусыСервер.РаспределитьСкидкуБонусамиПоСтрокамДокумента(ДокОбъект);
//	
//КонецПроцедуры

//Процедура ПересчитатьБонусыПоДокументу(ДокОбъект) Экспорт
//	
//	БонусыСервер.ПересчитатьБонусыПоДокументу(ДокОбъект);
//	
//КонецПроцедуры

Функция МаксимальныйРазмерБонусовКСписаниюПоДокументу() Экспорт
	
	Возврат Константы.МаксимальныйРазмерБонусовКСписаниюПоДокументу.Получить();
	
КонецФункции

#КонецОбласти
