
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторЕдиницИзмерения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Результат = Запрос.Выполнить();
	
	//Элементы.Наименование.РежимВыбораИзСписка = Истина; // так не делаем, иначе не дает набрать свой текст
	Элементы.Наименование.КнопкаВыпадающегоСписка = Истина;
	Элементы.Наименование.СписокВыбора.ЗагрузитьЗначения(Результат.Выгрузить().ВыгрузитьКолонку("Наименование"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокБазовыхЕдиницПриАктивизацииСтроки(Элемент)
	Объект.Наименование = Элементы.СписокБазовыхЕдиниц.ТекущиеДанные.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ТекДанные = Объект;
	Если ЕстьДубли(ТекДанные) Тогда
		Отказ = Истина;
		Сообщить("Такая единица измерения уже заведена для данной номенклатуры");
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьДубли(Данные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕдиницыИзмерений.Владелец,
		|	ЕдиницыИзмерений.Наименование
		|ИЗ
		|	Справочник.ЕдиницыИзмерений КАК ЕдиницыИзмерений
		|ГДЕ
		|	ЕдиницыИзмерений.Владелец = &Владелец
		|	И ЕдиницыИзмерений.Наименование = &Наименование
		|	И ЕдиницыИзмерений.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Владелец", Данные.Владелец);
	Запрос.УстановитьПараметр("Наименование", Данные.Наименование);	
	Запрос.УстановитьПараметр("Ссылка", Данные.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции	
