
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПустаяСтрока(Параметры.ЗаголовокФормы) Тогда
		Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;
	
	Элементы.Отборы.Заголовок = Параметры.ПредставлениеОтборов;
	Элементы.Отборы.Видимость = НЕ ПустаяСтрока(Параметры.ПредставлениеОтборов);
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресТабличногоДокумента) Тогда
		ТабДок = ПолучитьИзВременногоХранилища(Параметры.АдресТабличногоДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
		
	Если ЭтоСсылка(ТипЗнч(Расшифровка)) Тогда
		ПоказатьЗначение(, Расшифровка);	
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Функция ЭтоСсылка(Тип)
	
	Возврат Справочники.ТипВсеСсылки().СодержитТип(Тип) 
		ИЛИ Документы.ТипВсеСсылки().СодержитТип(Тип);
	
КонецФункции
