#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать
	
// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Акт выполненных работ
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.АвансовыйОтчет";
    КомандаПечати.Идентификатор = "АвансовыйОтчет";
    КомандаПечати.Представление = НСтр("ru = 'Авансовый отчет'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АвансовыйОтчет");
    Если НужноПечататьМакет Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "АвансовыйОтчет",
        НСтр("ru = 'Авансовый отчет'"),
        ПечатьАвансовыйОтчет(МассивОбъектов, ОбъектыПечати),
        ,
        "Документ.АвансовыйОтчет.ПФ_MXL_АвансовыйОтчет");
    КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
    "ВЫБРАТЬ
    |	АвансовыйОтчет.Ссылка КАК Ссылка,
    |	АвансовыйОтчет.Номер КАК НомерДокумента,
    |	АвансовыйОтчет.Дата КАК Дата,
    |	""текстовая строка"" КАК ДатаДокумента,
    |	АвансовыйОтчет.СуммаДокумента КАК СуммаДокумента,
    |	АвансовыйОтчет.Валюта КАК Валюта,
    |	АвансовыйОтчет.Организация КАК Организация,
    |	АвансовыйОтчет.Организация.Представление КАК ПредставлениеОрганизации,
    |	АвансовыйОтчет.Организация.Руководитель КАК РуководительПредставление,
    |	АвансовыйОтчет.Организация.ГлавныйБухгалтер КАК ПредставлениеГлавногоБухгалтера,
    |	АвансовыйОтчет.Организация.Руководитель.Должность КАК ДолжностьРуководителяПредставление,
    |	АвансовыйОтчет.Автор КАК Автор,
    |	АвансовыйОтчет.Склад КАК Склад,
    |	АвансовыйОтчет.Сотрудник КАК ПредставлениеПодотчетногоЛица,
    |	АвансовыйОтчет.Сотрудник КАК ПредставлениеПодотчетногоЛицаОт,
    |	АвансовыйОтчет.Сотрудник.Должность КАК ДолжностьПодотчетногоЛицаПредставление
    |ИЗ
    |	Документ.АвансовыйОтчет КАК АвансовыйОтчет
    |ГДЕ
    |	АвансовыйОтчет.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	АвансовыйОтчет.Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ДанныеТабличнойЧасти.Номенклатура КАК НаименованиеРасхода,
	|	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ДанныеТабличнойЧасти.СерияНоменклатуры КАК СерияНоменклатуры,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ДанныеТабличнойЧасти.Цена КАК Цена,
    |	ДанныеТабличнойЧасти.Сумма КАК Сумма,
    |	ДанныеТабличнойЧасти.Сумма КАК ПоОтчету,
    |	ДанныеТабличнойЧасти.Сумма КАК ПоУчету,
    |	ДанныеТабличнойЧасти.ВходящийДокументДата КАК ДокументДата,
    |	ДанныеТабличнойЧасти.ВходящийДокументНомер КАК ДокументНомер
    |ИЗ
    |	Документ.АвансовыйОтчет.Товары КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ДанныеТабличнойЧасти.Номенклатура КАК НаименованиеРасхода,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ДанныеТабличнойЧасти.Цена КАК Цена,
    |	ДанныеТабличнойЧасти.Сумма КАК Сумма,
    |	ДанныеТабличнойЧасти.Сумма КАК ПоОтчету,
    |	ДанныеТабличнойЧасти.Сумма КАК ПоУчету,
    |	ДанныеТабличнойЧасти.ВходящийДокументДата КАК ДокументДата,
    |	ДанныеТабличнойЧасти.ВходящийДокументНомер КАК ДокументНомер
    |ИЗ
    |	Документ.АвансовыйОтчет.Услуги КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ДанныеТабличнойЧасти.Документ КАК Документ,
    |	ДанныеТабличнойЧасти.Сумма КАК Сумма,
	|	ЕСТЬNULL(РасходИзКассы.Сумма, 0) КАК ПолученоИзКассы
    |ИЗ
    |	Документ.АвансовыйОтчет.ВыданныеАвансы КАК ДанныеТабличнойЧасти
	//++ #13973 
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер КАК РасходИзКассы
	|	ПО РасходИзКассы.Ссылка = ДанныеТабличнойЧасти.Документ
	//-- #13973
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(ПолученоИзКассы)
	|ПО
    |	Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ДанныеТабличнойЧасти.Контрагент КАК Контрагент,
    |	ДанныеТабличнойЧасти.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |	ДанныеТабличнойЧасти.Документ КАК НаименованиеРасхода,
    |	ДанныеТабличнойЧасти.СуммаОплаты КАК СуммаОплаты,
    |	ДанныеТабличнойЧасти.СуммаОплаты КАК Сумма,
    |	ДанныеТабличнойЧасти.СуммаОплаты КАК ПоОтчету,
    |	ДанныеТабличнойЧасти.СуммаОплаты КАК ПоУчету,
    |	ДанныеТабличнойЧасти.Документ.Дата КАК ДокументДата,
    |	ДанныеТабличнойЧасти.Документ.Номер КАК ДокументНомер
    |ИЗ
    |	Документ.АвансовыйОтчет.Оплаты КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка";
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиТовары = МассивРезультатов[1];
	РезультатПоТабличнойЧастиУслуги = МассивРезультатов[2];
	РезультатПоТабличнойЧастиАвансы = МассивРезультатов[3];
	РезультатПоТабличнойЧастиОплаты = МассивРезультатов[4];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары, РезультатПоТабличнойЧастиУслуги, РезультатПоТабличнойЧастиАвансы, РезультатПоТабличнойЧастиОплаты",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиТовары, РезультатПоТабличнойЧастиУслуги, РезультатПоТабличнойЧастиАвансы, РезультатПоТабличнойЧастиОплаты);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоАвансам) Экспорт

	РезультатЗапроса.Колонки.Добавить("ИзрасходованоРуб");
	РезультатЗапроса.Колонки.Добавить("ИзрасходованоКоп");
	РезультатЗапроса.Колонки.Добавить("СуммаОтчетаПрописью");
	РезультатЗапроса.Колонки.Добавить("ИтогоПолучено");
	РезультатЗапроса.Колонки.Добавить("Израсходовано");
	РезультатЗапроса.Колонки.Добавить("ИтогоПоОтчету");
	РезультатЗапроса.Колонки.Добавить("ИтогоПоУчету");
	РезультатЗапроса.Колонки.Добавить("ПолученоИзКассы");
	
	РезультатЗапроса.Колонки.Добавить("КонечныйОстаток");
	РезультатЗапроса.Колонки.Добавить("КонечныйПерерасход");		
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		ТекущаяСтрока.ДатаДокумента = Формат(ТекущаяСтрока.Дата,"ДЛФ=Д");
		Попытка
			ТекущаяСтрока.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.НомерДокумента);
		Исключение
		КонецПопытки;
		
		ТекущаяСтрока.ИзрасходованоРуб = Цел(ТекущаяСтрока.СуммаДокумента);
		ТекущаяСтрока.ИзрасходованоКоп = Формат((ТекущаяСтрока.СуммаДокумента - Цел(ТекущаяСтрока.СуммаДокумента))*100, "ЧН=00");
		ТекущаяСтрока.СуммаОтчетаПрописью = РаботаСВалютой.СформироватьЧислоПрописью(ТекущаяСтрока.СуммаДокумента, ТекущаяСтрока.Валюта);		
		ТекущаяСтрока.Израсходовано = ТекущаяСтрока.СуммаДокумента;
		ТекущаяСтрока.ИтогоПоОтчету = ТекущаяСтрока.СуммаДокумента;
		ТекущаяСтрока.ИтогоПоУчету  = ТекущаяСтрока.СуммаДокумента;
		//ТекущаяСтрока.ПолученоИзКассы  = ТекущаяСтрока.СуммаДокумента;  //#13973 закомментировано
		//ТекущаяСтрока.ИтогоПолучено = ТекущаяСтрока.Ссылка.ВыданныеАвансы.Итог("Сумма");

		ПолученоИзКассы = 0; //#13973
		//ИтогоПолучено = 0;
		СтруктураПоиска = Новый Структура("Ссылка", ТекущаяСтрока.Ссылка);
		ВыборкаПоАвансам.Сбросить();
		Если ВыборкаПоАвансам.НайтиСледующий(СтруктураПоиска) Тогда
			//ИтогоПолучено = ВыборкаПоАвансам.Сумма;
			ПолученоИзКассы = ВыборкаПоАвансам.ПолученоИзКассы; //#13973
		КонецЕсли;						
		//ТекущаяСтрока.ИтогоПолучено = ИтогоПолучено;
		ТекущаяСтрока.ПолученоИзКассы = ПолученоИзКассы; //#13973 
		ТекущаяСтрока.ИтогоПолучено = ПолученоИзКассы;
		
		СуммаДоДокумента = 0;
		ОстатокНаКонец = СуммаДоДокумента + ТекущаяСтрока.ИтогоПолучено - ТекущаяСтрока.Израсходовано;
		Если ОстатокНаКонец >= 0  Тогда
			ТекущаяСтрока.КонечныйОстаток    = ОстатокНаКонец;
		Иначе
			ТекущаяСтрока.КонечныйПерерасход = - ОстатокНаКонец;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
	
Функция ПечатьАвансовыйОтчет(МассивОбъектов, ОбъектыПечати)
    
    ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_АвансовыйОтчет";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АвансовыйОтчет.ПФ_MXL_АвансовыйОтчет");
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоУслугам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоОплатам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиОплаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоАвансам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиАвансы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоАвансам);	
	    
    ПервыйДокумент = Истина;
    Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Титул");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		НомерСтроки = 1;
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоТоварам.Сбросить();
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда				
			Выборка = ВыборкаПоТоварам.Выбрать();
			Пока Выборка.Следующий() Цикл					 
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				
				//++ №12909
				ОбластьМакета.Параметры.НаименованиеРасхода = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.НаименованиеРасхода, Выборка.ХарактеристикаНоменклатуры);
				//-- №12909
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
		КонецЕсли;
		
		ВыборкаПоУслугам.Сбросить();
		Если ВыборкаПоУслугам.НайтиСледующий(СтруктураПоиска) Тогда				
			Выборка = ВыборкаПоУслугам.Выбрать();
			Пока Выборка.Следующий() Цикл					 
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				
				//++ №12909
				ОбластьМакета.Параметры.НаименованиеРасхода = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.НаименованиеРасхода);
				//-- №12909
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
		КонецЕсли;
		
	    ВыборкаПоОплатам.Сбросить();
		Если ВыборкаПоОплатам.НайтиСледующий(СтруктураПоиска) Тогда				
			Выборка = ВыборкаПоОплатам.Выбрать();
			Пока Выборка.Следующий() Цикл					 
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				Если НЕ Выборка.НаименованиеРасхода = Неопределено Тогда
					Если ТипЗнч(Выборка.НаименованиеРасхода) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
						ОбластьМакета.Параметры.ДокументДата  = Выборка.НаименованиеРасхода.ВхДата;
						ОбластьМакета.Параметры.ДокументНомер = Выборка.НаименованиеРасхода.ВхНомер;
					Иначе
						ОбластьМакета.Параметры.ДокументНомер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.НаименованиеРасхода.Номер);			
					КонецЕсли;					
					ОбластьМакета.Параметры.НаименованиеРасхода = Выборка.НаименованиеРасхода.Метаданные().Синоним;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;		
		
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Добавляет команду создания данного документа
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.АвансовыйОтчет) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.АвансовыйОтчет.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.АвансовыйОтчет.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли