#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		ЗаполнитьПоРКО(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		ЗаполнитьПоСРС(ДанныеЗаполнения);
	КонецЕсли;
	
	СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, , Ложь);

	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры
 
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//#4901
	Если Товары.Количество() = 0 Тогда
		РеквизитСклад = ПроверяемыеРеквизиты.Найти("Склад");
		Если НЕ РеквизитСклад = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитСклад);
		КонецЕсли;
	КонецЕсли;
		
	ИзрасходованоИтог = ВыданныеАвансы.Итог("Сумма");
	ТоварыИтог = Товары.Итог("Сумма");
	УслугиИтог = Услуги.Итог("Сумма");
	ОплатыИтог = Оплаты.Итог("СуммаОплаты");
	
	Если ИзрасходованоИтог > ТоварыИтог + УслугиИтог + ОплатыИтог Тогда
		ТекстСообщения = НСтр("ru = 'Израсходованная сумма авансов превышает сумму по документу!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВыданныеАвансы[0].Сумма", ,Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма") + Оплаты.Итог("СуммаОплаты");

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	// регистр ТоварыНаСкладах
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого Товар Из Товары Цикл
		Приход = Движения.ТоварыНаСкладах.Добавить();
		Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
		Приход.Период = Дата;
		Приход.Организация = ОрганизацияТоваров;
		Приход.Склад = Склад;
		Приход.Номенклатура = Товар.Номенклатура;
		Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		Приход.СерияНоменклатуры = Товар.СерияНоменклатуры;
		Приход.Количество = Товар.Количество * Товар.Коэффициент;
		Приход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.Сумма);
		Приход.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Товар.Сумма); //#8288
	КонецЦикла;
	
	// регистр РасчетыСПодотчетникамиПоДокументамАвансов
	Движения.РасчетыСПодотчетникамиПоДокументамАвансов.Записывать = Истина;
	Для каждого Аванс из ВыданныеАвансы Цикл
		Движение = Движения.РасчетыСПодотчетникамиПоДокументамАвансов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сотрудник = Сотрудник;
		Движение.ДокументВыдачиДС = Аванс.Документ;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Аванс.Сумма);
		//Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товары.Итог("Сумма") + Услуги.Итог("Сумма") + Оплаты.Итог("СуммаОплаты"));
	КонецЦикла;
	
	// регистр РасчетыСПодотчетниками
	Движения.РасчетыСПодотчетниками.Записывать = Истина;
	Движение = Движения.РасчетыСПодотчетниками.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сотрудник = Сотрудник;		
	Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товары.Итог("Сумма") + Услуги.Итог("Сумма") + Оплаты.Итог("СуммаОплаты"));

	// регистр ДоходыРасходы
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод
			Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движения.ДоходыРасходы.Записывать = Истина;
			Для Каждого ТекущаяСтрока Из Товары Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяРасходов.Пустая(), ТекущаяСтрока.СтатьяРасходов, СтатьяРасходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= 0;
				Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);				
			КонецЦикла;
			Для Каждого ТекущаяСтрока Из Услуги Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяРасходов.Пустая(), ТекущаяСтрока.СтатьяРасходов, СтатьяРасходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;				
				
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= 0;
				Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
	Для каждого СтрокаТабличнойЧасти из Оплаты Цикл
		
		// регистр ВзаиморасчетыСКонтрагентами Приход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период 	 = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент  = СтрокаТабличнойЧасти.Контрагент;
		Движение.Договор 	 = СтрокаТабличнойЧасти.ДоговорКонтрагента;
		//Движение.Документ 	 = Ссылка;
		Движение.Сумма 		 = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СтрокаТабличнойЧасти.СуммаОплаты);
		
		//Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период 	 = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент  = СтрокаТабличнойЧасти.Контрагент;
		Движение.Договор 	 = СтрокаТабличнойЧасти.ДоговорКонтрагента;
		Движение.Валюта 	 = Валюта;
		Движение.Сумма 		 = СтрокаТабличнойЧасти.СуммаОплаты;
		
		// регистр РасчетыСКонтрагентами Приход
		Движения.РасчетыСКонтрагентами.Записывать = Истина;			
		Если ТипЗнч(СтрокаТабличнойЧасти.Документ) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Движение = Движения.РасчетыСКонтрагентами.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период 	 = Дата;
			Движение.Заказ 		 = СтрокаТабличнойЧасти.Документ;
			Движение.Контрагент  = СтрокаТабличнойЧасти.Контрагент;
			Движение.Организация = Организация;
			Движение.Сумма 		 = СтрокаТабличнойЧасти.СуммаОплаты;
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

// Обработчик ввода на основании документа РасходныйКассовыйОрдер	
Процедура ЗаполнитьПоРКО(ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения.ВидОперации <> Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя ввести Авансовый отчет на основании расходного кассового ордера с этим видом операции!'");
	КонецЕсли;
	
	Организация 		= ДанныеЗаполнения.Организация;
	Подразделение 		= ДанныеЗаполнения.Подразделение;
	Валюта 				= ДанныеЗаполнения.Валюта;
	//ДокументОснование 	= ДокументСсылкаРасходИзКассы.Ссылка;
	Сотрудник 			= ДанныеЗаполнения.Сотрудник;
		
	ВыданныеАвансы.Очистить();
	НоваяСтрока = ВыданныеАвансы.Добавить();
	НоваяСтрока.Документ = ДанныеЗаполнения;
	НоваяСтрока.Сумма = ДанныеЗаполнения.Сумма;
	
КонецПроцедуры

// Обработчик заполнения на основании документа СписаниеСРасчетногоСчета
Процедура ЗаполнитьПоСРС(ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения.ВидОперации <> Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя ввести Авансовый отчет на основании списания с расчетного счета с этим видом операции!'");
	КонецЕсли;
	
	Организация 		= ДанныеЗаполнения.Организация;
	Подразделение 		= ДанныеЗаполнения.Подразделение;
	Валюта 				= ДанныеЗаполнения.Валюта;
	//ДокументОснование 	= ДокументСсылкаРасходИзКассы.Ссылка;
	Сотрудник 			= ДанныеЗаполнения.Контрагент;
		
	ВыданныеАвансы.Очистить();
	НоваяСтрока = ВыданныеАвансы.Добавить();
	НоваяСтрока.Документ = ДанныеЗаполнения;
	НоваяСтрока.Сумма = ДанныеЗаполнения.Сумма;
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли