
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидыЦен.Очистить();
	Для НомерЭлемента = 0 По Параметры.ВидыЦен.Количество()-1 Цикл
		ВидыЦен.Добавить(Параметры.ВидыЦен.Получить(НомерЭлемента).Значение);
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	Для НомерЭлемента = 0 По ВидыЦен.Количество()-1 Цикл
		ДанныеВыбора.Добавить(ВидыЦен.Получить(НомерЭлемента).Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ВидЦен.Пустая() Тогда
		ПоказатьПредупреждение(,"Укажите вид цен для заполнения");
		Возврат;
	КонецЕсли;
	Если Контрагент.Пустая() Тогда
		ПоказатьПредупреждение(,"Укажите поставщика, чьи цены следует использовать");
		Возврат;
	КонецЕсли;
	
	ПараметрыОтвета = Новый Структура;
	ПараметрыОтвета.Вставить("ВидЦен", ВидЦен);
	ПараметрыОтвета.Вставить("Контрагент", Контрагент);
	Закрыть(ПараметрыОтвета);
КонецПроцедуры
