
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивСайтов = Новый Массив;
	МассивИД = Новый Массив;
	МассивОбъектов = Новый Массив;
	
	Для каждого ОписаниеЗаписи из Параметры.ДанныеЗаписей Цикл
		Если МассивСайтов.Найти(ОписаниеЗаписи.Сайт) = Неопределено Тогда
			МассивСайтов.Добавить(ОписаниеЗаписи.Сайт);
		КонецЕсли;
		Если МассивИД.Найти(ОписаниеЗаписи.Идентификатор) = Неопределено Тогда
			МассивИД.Добавить(ОписаниеЗаписи.Идентификатор);
		КонецЕсли;
		Если МассивОбъектов.Найти(ОписаниеЗаписи.Объект) = Неопределено Тогда
			МассивОбъектов.Добавить(ОписаниеЗаписи.Объект);
		КонецЕсли;
	КонецЦикла;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Сайт", 		 МассивСайтов,   ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Идентификатор", МассивИД, 		 ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Объект", 		 МассивОбъектов, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
КонецПроцедуры
