
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = тип("Структура") и  ДанныеЗаполнения.Свойство("ЭтоПлатежка") Тогда
		Платежка = ДанныеЗаполнения.Ссылка;
		
		ОрганизацияДочерняя = Платежка.организация;
		Организация = ИА_ФП.ПолучитьГоловнуюОрганизацию(ОрганизацияДочерняя);
		Основание = Платежка;
		Дата = Платежка.Дата;
		СуммаДокумента = Платежка.СуммаДокумента;
		Если ИсточникСредств = "" Тогда 
			Попытка
				ИсточникСредств = Платежка.Контрагент;
			Исключение
				Попытка
					ИсточникСредств = Платежка.Партнер;
				Исключение
				КонецПопытки;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если СуммаДокумента <> ИА_ЗаказыНаПриобретение.Итог("Сумма") + ИА_Фонды.Итог("Сумма") Тогда
		Сообщить("Распределите всю сумму!");
		Отказ = Истина;
		возврат;
	КонецЕсли;
КонецПроцедуры
