
#Область ПрограммныйИнтерфейс

Функция ПараметрыШК(РежимФормированияШК, Сотрудник = Неопределено, Операция = Неопределено) Экспорт
	
	Если РежимФормированияШК = 1 Тогда
		// ШК сотрудника
		// #13536: вместо 86 было 88
		//Сформируем ш/к [86] [00000] [КодСотрудника(последние 5)]	
		ДанныеСотрудника = ОбщийМодульВызовСервера.ЗначенияРеквизитовОбъекта(Сотрудник, "Код, Наименование");
		
		КодСотрудника = Формат(Прав(ДанныеСотрудника.Код, 5), "ЧЦ=5; ЧВН=; ЧГ=");
		Штрихкод = "8600000" + КодСотрудника;
		Штрихкод = Штрихкод + ОбщийМодульВызовСервера.КонтрольныйСимволEAN(ШтрихКод, 13);
		Возврат Новый Структура("ЗначениеКода, Заголовок", Штрихкод, Строка(ДанныеСотрудника.Наименование));
		
	ИначеЕсли РежимФормированияШК = 2 Тогда
		// ШК производственной операции
		// #13536: вместо 87 было 88
		//	//Сформируем ш/к [88][КодОперации(последние 5)] [00000]
		ДанныеПроизводственнойОперации = ОбщийМодульВызовСервера.ЗначенияРеквизитовОбъекта(Операция, "Код, Наименование");
		
		КодОперации = Формат(Прав(ДанныеПроизводственнойОперации.Код, 5), "ЧЦ=5; ЧВН=; ЧГ=");
		Штрихкод = "87" + КодОперации + "00000";
		Штрихкод = Штрихкод + ОбщийМодульВызовСервера.КонтрольныйСимволEAN(ШтрихКод, 13);
		Возврат Новый Структура("ЗначениеКода, Заголовок", Штрихкод, Строка(ДанныеПроизводственнойОперации.Наименование));
		
	ИначеЕсли РежимФормированияШК = 3 Тогда
		// ШК сотрудника + производственной операции	
		//Сформируем ш/к [88][КодОперации(последние 5)][КодСотрудника(последние 5)]
		ДанныеСотрудника = ОбщийМодульВызовСервера.ЗначенияРеквизитовОбъекта(Сотрудник, "Код, Наименование");
		ДанныеПроизводственнойОперации = ОбщийМодульВызовСервера.ЗначенияРеквизитовОбъекта(Операция, "Код, Наименование");
		
		КодОперации = Формат(Прав(ДанныеПроизводственнойОперации.Код, 5), "ЧЦ=5; ЧВН=; ЧГ=");
		КодСотрудника = Формат(Прав(ДанныеСотрудника.Код, 5), "ЧЦ=5; ЧВН=; ЧГ=");
		Штрихкод = "88" + КодОперации + КодСотрудника;	
		Штрихкод = Штрихкод + ОбщийМодульВызовСервера.КонтрольныйСимволEAN(ШтрихКод, 13);
		
		Возврат Новый Структура("ЗначениеКода, Заголовок", Штрихкод, Строка(ДанныеПроизводственнойОперации.Наименование + " + " + ДанныеСотрудника.Наименование));
		
	ИначеЕсли РежимФормированияШК = 4 Тогда
		// ШК сотрудника + операции над документами	
		//Сформируем ш/к [89][КодОперации(последние 5)][КодСотрудника(последние 5)]
		ДанныеСотрудника = ОбщийМодульВызовСервера.ЗначенияРеквизитовОбъекта(Сотрудник, "Код, Наименование");
		ДанныеОперацииНадДокументами = ОбщийМодульВызовСервера.ЗначенияРеквизитовОбъекта(Операция, "Код, Наименование");
		
		КодОперации = Формат(Прав(ДанныеОперацииНадДокументами.Код, 5), "ЧЦ=5; ЧВН=; ЧГ=");
		КодСотрудника = Формат(Прав(ДанныеСотрудника.Код, 5), "ЧЦ=5; ЧВН=; ЧГ=");
		Штрихкод = "89" + КодОперации + КодСотрудника;	
		Штрихкод = Штрихкод + ОбщийМодульВызовСервера.КонтрольныйСимволEAN(ШтрихКод, 13);
		
		Возврат Новый Структура("ЗначениеКода, Заголовок", Штрихкод, Строка(ДанныеОперацииНадДокументами.Наименование + " + " + ДанныеСотрудника.Наименование));

	ИначеЕсли РежимФормированияШК = 50 Тогда
		// Отмена или Действие по умолчанию
		Если Операция = "Отмена" Тогда			
			Штрихкод = "000000000000";
		ИначеЕсли Операция = "Кнопка по умолчанию" Тогда
			Штрихкод = "000000000001";			
		КонецЕсли;
		
		Штрихкод = Штрихкод + ОбщийМодульВызовСервера.КонтрольныйСимволEAN(ШтрихКод, 13);
		Возврат Новый Структура("ЗначениеКода, Заголовок", Штрихкод, Операция);
		
	КонецЕсли;
	
КонецФункции

Функция ОбработатьШтрихкод(Штрихкод, РежимФормированияШК = Неопределено) Экспорт
	
	ШК_ИД = Лев(Штрихкод, 2);
	
	//Если РежимФормированияШК = 4 И НЕ ШК_ИД = "89" Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Неверный формат штрихкода: %1'"),
	//		Штрихкод));
	//	Возврат Неопределено;
	//КонецЕсли;
	
	Если РежимФормированияШК = 1 И НЕ ШК_ИД = "86" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Неверный формат штрихкода: %1'"),
			Штрихкод));
		Возврат Неопределено;
	КонецЕсли;
	
	Если ШК_ИД = "86" Тогда
		// ШК сотрудника
		ШКСотрудника = Сред(Штрихкод, 8, 5);		
		Результат = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоКоду(Строка("0000" + ШКСотрудника));
		Если ТипЗнч(Результат) = тип("Строка") Тогда
			ПоказатьПредупреждение(,Результат);
			Возврат Неопределено;
		Иначе
			Сотрудник = Результат;
		КонецЕсли;		
		
		Возврат Новый Структура("Сотрудник", Сотрудник);
		
	ИначеЕсли ШК_ИД = "87" Тогда
		// ШК производственной операции
		ШКОперации = Сред(Штрихкод, 3, 5);		
		Результат = ОбщийМодульВызовСервера.ПолучитьПроизводственнуюОперациюПоКоду(Строка("0000" + ШКОперации));
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			ПоказатьПредупреждение(,Результат);
			Возврат Неопределено;
		Иначе
			ПроизводственнаяОперация = Результат;
		КонецЕсли;		
		
		Возврат Новый Структура("Операция", ПроизводственнаяОперация);
		
	ИначеЕсли ШК_ИД = "88" Тогда
		// ШК сотрудника + производственной операции
		
		ШКОперации = Сред(Штрихкод, 3, 5);		
		Результат = ОбщийМодульВызовСервера.ПолучитьПроизводственнуюОперациюПоКоду(Строка("0000" + ШКОперации));
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			ПоказатьПредупреждение(,Результат);
			Возврат Неопределено;
		Иначе
			ПроизводственнаяОперация = Результат;
		КонецЕсли;
		
		ШКСотрудника = Сред(Штрихкод, 8, 5);		
		Результат = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоКоду(Строка("0000" + ШКСотрудника));
		Если ТипЗнч(Результат) = тип("Строка") Тогда
			ПоказатьПредупреждение(,Результат);
			Возврат Неопределено;
		Иначе
			Сотрудник = Результат;
		КонецЕсли;			
		
		Возврат Новый Структура("Операция, Сотрудник", ПроизводственнаяОперация, Сотрудник);
		
	//#14908 закомментировано
	//ИначеЕсли ШК_ИД = "89" Тогда
	//	// ШК сотрудника + операции над документами	
	//	
	//	ШКОперации = Сред(Штрихкод, 3, 5);		
	//	Результат = ОбщийМодульВызовСервера.ПолучитьОперациюНадДокументомПоКоду(Строка("0000" + ШКОперации));
	//	Если ТипЗнч(Результат) = Тип("Строка") Тогда
	//		ПоказатьПредупреждение(,Результат);
	//		Возврат Неопределено;
	//	Иначе
	//		ОперацияНадДокументом = Результат;
	//	КонецЕсли;
	//	
	//	ШКСотрудника = Сред(Штрихкод, 8, 5);		
	//	Результат = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоКоду(Строка("0000" + ШКСотрудника));
	//	Если ТипЗнч(Результат) = тип("Строка") Тогда
	//		ПоказатьПредупреждение(,Результат);
	//		Возврат Неопределено;
	//	Иначе
	//		Сотрудник = Результат;
	//	КонецЕсли;			
	//	
	//	Возврат Новый Структура("Операция, Сотрудник", ОперацияНадДокументом, Сотрудник);
		
	Иначе
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Неизвестный формат штрихкода: %1'"),
			Штрихкод));		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
