&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	ОбщийМодульСервер.ОбновитьЭлементыФормыПоследовательностьСебестоимости(ЭтотОбъект, , , Ложь);
	
	//Если ОбщийМодуль.ПоследовательностьПоСебестоимостиНарушена() Тогда
	//	Элементы.ГруппаПоследовательность.Видимость = Истина;
	//	Элементы.ДекорацияНарушенаПоследовательность.Заголовок = 
	//	"Для корректного расчёта себестоимости все документы должны проводиться строго в хронологическом порядке." + Символы.ПС 
	//	+ "В базе имеются документы которые были проведены или изменены задним числом, что привело к нарушению хронологии последовательности." + Символы.ПС 
	//	+ "Последний документ до которого себестоимость посчитана правильно: " + Символы.ПС + ОбщийМодуль.ПолучитьГраницуПоследовательностиПоСебестоимости() + Символы.ПС 
	//	+ "Для перепроведения документов в хронологическом порядке (для пересчета себестоимости) нажмите на кнопку ""Восстановить""."+ Символы.ПС 
	//	+ "Если система не сможет какой-то документ провести автоматически, восстановление последовательности будет остановлено." + Символы.ПС 
	//	+ "Необходимо такой документ исправить и провести вручную и повторно запустить восстановление последовательности."
	//Иначе
	//	Элементы.ГруппаПоследовательность.Видимость = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоследовательность(Команда)
	//ВосстановитьПоследовательностьНаСервере();
	//ПоказатьПредупреждение(,"Восстановление последовательности по себестоимости завершено");
	
	Если ОбщийМодуль.ПоследовательностьПоСебестоимостиНарушена() Тогда
		Сообщение = "";
		Идентификатор = "";
			
		ОбщийМодуль.ЗапуститьФоновоеЗаданиеВосстановлениеПоследовательностиПоСебестоимости(Сообщение, Идентификатор);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			ИдентификаторФоновогоЗадания = Идентификатор;			
			ПодключитьОбработчикОжидания("СообщитьОбОкончанииВосстановленияПоследовательности", 0.1, Истина);
		КонецЕсли;
		
		ПоказатьПредупреждение(, Сообщение);
		
		ОтключитьОбработчикОжидания("ОбработчикОбновленияСостоянияПоследовательности");
		Если ИнтервалОбновленияСостоянияПоследовательности > 0 Тогда
			ПодключитьОбработчикОжидания("ОбработчикОбновленияСостоянияПоследовательности", ИнтервалОбновленияСостоянияПоследовательности);	
		КонецЕсли;
			
	КонецЕсли;	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОкончанииВосстановленияПоследовательности()
	
	ОповещенияОбОкончанииВыполнения = ОбщийМодуль.ОповещенияОбОкончанииВыполненияРегламентныхЗаданий(ИдентификаторФоновогоЗадания);
	
	Если ТипЗнч(ОповещенияОбОкончанииВыполнения) = Тип("Структура") Тогда
		
		ПоказатьОповещениеПользователя(
			"Выполнена процедура восстановления последовательности",
			, "Восстановление последовательности завершено в фоновом задании " + Строка(ОповещенияОбОкончанииВыполнения.МоментОкончания)
			+ ?(ЗначениеЗаполнено(ОповещенияОбОкончанииВыполнения.ОписаниеОшибки), Символы.ПС + "Завершено с ошибками: " + ОповещенияОбОкончанииВыполнения.ОписаниеОшибки, ""),				
			БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		
		ПодключитьОбработчикОжидания(
			"СообщитьОбОкончанииВосстановленияПоследовательности", 2, Истина);	
		
	Иначе	
		ОбновитьЭлементыФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновленияСостоянияПоследовательности()
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеПоследовательности(Команда)
	ОбновитьЭлементыФормы();	
КонецПроцедуры

//&НаСервере
//Процедура ВосстановитьПоследовательностьНаСервере()
//	
//	Последовательности.СебестоимостьЗапасов.Восстановить();
//	ОбновитьЭлементыФормы();
//	
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Настройки);	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
КонецПроцедуры
