
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидЦены = 1;
	Если Параметры.Свойство("ВидНоменклатуры") И Параметры.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
		Элементы.ВидЦены.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ЦенаСФотопечатьюОтличается") Тогда
		Если НЕ Параметры.ЦенаСФотопечатьюОтличается Тогда
			ВидЦены = 3;
			Элементы.ВидЦены.Доступность = Ложь;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураВозврата = Новый Структура("ВидЦены, ИзменитьНаСумму", ВидЦены, ИзменитьНаСумму);	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти