#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаОшибкаПроведенияВыпуска.Видимость = ПолучитьФункциональнуюОпцию("АвтоматическиРегистрироватьВыпускПриЗаказеНаПроизводство");
	
	//#10918 изменена схема
	ВызовИзФормыОбъекта = Параметры.ЭтоФормаОбъекта;
	ВызовИзАРМПроизводства = НЕ Параметры.ЭтоФормаОбъекта;
	
	КоличествоПозиций = 0;
	Для каждого ЭлементМассива из Параметры.МассивНоменклатур Цикл
		ИскомаяСтрокаЗаказа = Неопределено;
		СтрокиЗаказов = ДеревоЗаказов.ПолучитьЭлементы();
		Для каждого СтрокаЗаказа из СтрокиЗаказов Цикл
			Если СтрокаЗаказа.ЗаказПокупателя = ЭлементМассива.Заказ Тогда
				ИскомаяСтрокаЗаказа = СтрокаЗаказа;
			КонецЕсли;
		КонецЦикла;
		Если ИскомаяСтрокаЗаказа = Неопределено Тогда
			ИскомаяСтрокаЗаказа = СтрокиЗаказов.Добавить();
			ИскомаяСтрокаЗаказа.ЗаказПокупателя = ЭлементМассива.Заказ;
		КонецЕсли;
		
		НоваяСтрока = ИскомаяСтрокаЗаказа.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		НоваяСтрока.ЗаказПокупателя = ЭлементМассива.Заказ;
		НоваяСтрока.Код = НоваяСтрока.Номенклатура.Код;
		НоваяСтрока.ИндексМассива = КоличествоПозиций;
		КоличествоПозиций = КоличествоПозиций + 1;
		
		СписокНоменклатуры.Добавить(ЭлементМассива);
	КонецЦикла;
	
	//СтруктураСозданныхИОбновленныхЗаказовНаПроизводство.Очистить();
	//Если Параметры.МассивСозданныхИОбновленныхЗаказов <> Неопределено 
	//	И ТипЗнч(Параметры.МассивСозданныхИОбновленныхЗаказов) = Тип("Массив") Тогда		
	//	
	//	Для Каждого ТекущаяСтрока Из Параметры.МассивСозданныхИОбновленныхЗаказов Цикл
	//		НоваяСтрока = СтруктураСозданныхИОбновленныхЗаказовНаПроизводство.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	//	КонецЦикла;
	//	
	//КонецЕсли;	
	//
	//СтруктураСозданныхИОбновленныхЗаказовНаПроизводство.Добавить();
	//
	//ВывестиТабличныйДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ЗапуститьЗаполнение", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеЗаполнение

&НаКлиенте
Процедура ЗапуститьЗаполнение()
	
	ОчиститьСообщения();	
	ЗапуститьРасчетСледующегоЭтапаВФоне();
	
КонецПроцедуры

&НаКлиенте
Функция ЗапуститьРасчетСледующегоЭтапаВФоне()
	
	// Инициализируем расчет.
	ПрерватьРасчет = Ложь;
	РасчетЗапущен = Истина;
	РасчетЗавершен = Ложь;
	
	СостояниеРасчета = ИнициализироватьСтруктуруСостоянияРасчетаЭтапов();
	
	СтрокиЗаказов = ДеревоЗаказов.ПолучитьЭлементы();
	ПрерватьЦиклЗаказов = Ложь;
	Для каждого СтрокаЗаказа из СтрокиЗаказов Цикл
		Если СтрокаЗаказа.Выполнен Тогда
		Иначе
			ВывестиВТабличныйДокумент(СтрокаЗаказа.ЗаказПокупателя);
			СтрокаЗаказа.Выполнен = Истина;
		КонецЕсли;
		
		СтрокиНоменклатуры = СтрокаЗаказа.ПолучитьЭлементы();
		
		Для каждого СтрокаПродукции из СтрокиНоменклатуры Цикл
			
			Если СтрокаПродукции.Выполнен Тогда				
				Если СтрокаПродукции.ИндексМассива = КоличествоПозиций-1 Тогда
					РасчетЗавершен = Истина;
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			
			//ТекущийРассчитываемыйЭтап = СтрокаДерева.Код;
			
			СостояниеРасчета.ПредставлениеЭтапа = СтрокаПродукции.Номенклатура;
			
			ИДЗадания = Неопределено;
			
			ПараметрыЗапуска = Новый Структура;
			ПараметрыЗапуска.Вставить("ИмяМетода", СтрокаПродукции.Код);
			ПараметрыЗапуска.Вставить("Заказ", СтрокаЗаказа.ЗаказПокупателя);
			ПараметрыЗапуска.Вставить("Продукция", СписокНоменклатуры.Получить(СтрокаПродукции.ИндексМассива).Значение);
			ПараметрыЗапуска.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
			
			СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
			ИДЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
			ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
			ПараметрыОжидания.Интервал = 2;
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект, СтрокаПродукции.ПолучитьИдентификатор()), ПараметрыОжидания);
			
			//ПодключитьОбработчикОжидания("ПроверитьАктивностьФоновогоЗаданияРасчета", 1);
			//ПроверитьАктивностьФоновогоЗаданияРасчета();
			
			ПрерватьЦиклЗаказов = Истина;
			Прервать;			
		КонецЦикла;
		
		Если ПрерватьЦиклЗаказов Тогда 
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если РасчетЗавершен Тогда
		//ТекущийРассчитываемыйЭтап = Неопределено;
		СостояниеРасчета.РасчетЗавершен = Истина;
		//ОтключитьОбработчикОжидания("ПроверитьАктивностьФоновогоЗаданияРасчета");
		
		Оповестить("ОбновитьАРМПроизводства",,"ЗаказНаПроизводство");
		Оповестить("ОбновитьАРМПроизводства",,"ЗаказПокупателя");
	КонецЕсли;
	
	НастроитьЭлементыВЗависимостиОтНаличияФоновыхЗаданий();
	
	Возврат РасчетЗапущен;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)

	НаименованиеЗадания = НСтр("ru = 'Запуск длительной операции'");
	
	ВыполняемыйМетод = "ОбщийМодульСервер.СозданиеЗаказаНаПроизводствоПоФоновомуЗаданию";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		//ЗафиксироватьПроблемуРасчета(ДополнительныеПараметры);
		
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		// обрабатываем результат
		РезультатЭтапа = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Для Каждого ЭлементМассива Из РезультатЭтапа.СозданоНовых Цикл
			//МассивСозданныхИОбновленныхЗаказов.Добавить(Новый Структура("ЗаказПокупателя, ЗаказНаПроизводство, Создан, ПроведенВыпуск", ОбъектОтбора, ТекущаяСтрока, Истина, СтруктураВозврата.ПроведенВыпуск));
			ЦветОбласти = WebЦвета.ЛимонноЗеленый;
			Если Элементы.ГруппаОшибкаПроведенияВыпуска.Видимость И НЕ РезультатЭтапа.ПроведенВыпуск Тогда
				ЦветОбласти = WebЦвета.ОранжевоКрасный;
			КонецЕсли;
			ВывестиВТабличныйДокумент(ЭлементМассива, ЦветОбласти);
		КонецЦикла;
		
		Для Каждого ЭлементМассива Из РезультатЭтапа.Обновлено Цикл
			//МассивСозданныхИОбновленныхЗаказов.Добавить(Новый Структура("ЗаказПокупателя, ЗаказНаПроизводство, Создан, ПроведенВыпуск", ОбъектОтбора, ТекущаяСтрока, Ложь, СтруктураВозврата.ПроведенВыпуск));			
			ЦветОбласти = WebЦвета.Золотой;
			Если Элементы.ГруппаОшибкаПроведенияВыпуска.Видимость И НЕ РезультатЭтапа.ПроведенВыпуск Тогда
				ЦветОбласти = WebЦвета.ОранжевоКрасный;
			КонецЕсли;
			ВывестиВТабличныйДокумент(ЭлементМассива, ЦветОбласти);
		КонецЦикла;

		Если Элементы.ГруппаОшибкаПроведенияВыпуска.Видимость Тогда
			Для Каждого ЭлементМассива Из РезультатЭтапа.Выпуски Цикл						
				ЦветОбласти = ?(ЭлементМассива.Новый, WebЦвета.ЛимонноЗеленый, WebЦвета.Золотой);
				Если НЕ РезультатЭтапа.ПроведенВыпуск Тогда
					ЦветОбласти = WebЦвета.ОранжевоКрасный;
				КонецЕсли;
				ВывестиВТабличныйДокумент(ЭлементМассива.Документ, ЦветОбласти);
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого ЭлементМассива Из РезультатЭтапа.МассивСообщений Цикл
			ВывестиВТабличныйДокумент(ЭлементМассива.Текст);
		КонецЦикла;
	   	ВывестиВТабличныйДокумент("");
	   
		СтрокаДерева = ДеревоЗаказов.НайтиПоИдентификатору(ДополнительныеПараметры);
		СтрокаДерева.Выполнен = Истина;
		
		Если ВызовИзФормыОбъекта Тогда
			Оповестить("ОбновитьЗаказПокупателяПослеСозданияЗаказовНаПроизводство", СтрокаДерева.ЗаказПокупателя);
		КонецЕсли;
		
		ЗапуститьРасчетСледующегоЭтапаВФоне();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ИнициализироватьСтруктуруСостоянияРасчетаЭтапов() Экспорт
	
	СостояниеРасчета = Новый Структура;
	СостояниеРасчета.Вставить("ПредставлениеЭтапа", 	   "");
	СостояниеРасчета.Вставить("РасчетЗавершен", Ложь);
	
	Возврат СостояниеРасчета;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекущееСостояниеФоновогоЗадания(ИдентификаторЗадания, ДляЧтенияНаКлиенте = Истина)
	
	СостояниеЗадания = ОбщийМодульСервер.ТекущееСостояниеФоновогоЗадания(ИдентификаторЗадания);
	
	Если ДляЧтенияНаКлиенте Тогда
		СостояниеЗадания.Удалить("Задание"); // тип значения этого свойства недоступен на клиенте
	КонецЕсли;
	
	Возврат СостояниеЗадания;
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыВЗависимостиОтНаличияФоновыхЗаданий()
	
	ИдетРасчет = НЕ СостояниеРасчета.РасчетЗавершен;

	
	//Элементы.ГруппаПериод.Доступность 	  			  			  = НЕ ИдетРасчет;
	//Элементы.ПредставлениеОрганизаций.Доступность 	  			  = НЕ ИдетРасчет И НЕ ИдетОбновление;
	//Элементы.ГруппаСтатусРасчета.Доступность 	  				  = НЕ ИдетРасчет;
	//Элементы.ПредставлениеРассчитываемогоЭтапа.Высота 			  = ?(ИдетОбновление, 3, 1);
	//Элементы.ГруппаОтменаРасчетаВФоне.Видимость 	  			  = НЕ ИдетОбновление;
	Элементы.ГруппаФоновоеЗаполнение.Видимость   			  	= ИдетРасчет;
	//Элементы.ОстановитьРасчетВФоне.Доступность   				  = НЕ ПрерватьРасчет;
	//Элементы.КнопкаВыполнитьЗакрытие.Доступность 	  			  = НЕ ИдетРасчет И НЕ ИдетОбновление И НЕ ИзмененияЗапрещены;
	//Элементы.КнопкаОбновитьФорму.Доступность 		  			  = НЕ ИдетРасчет И НЕ ИдетОбновление;
	//Элементы.ГруппаКнопокНастройкаОтображенияСтрок.Доступность 	  = НЕ ИдетРасчет И НЕ ИдетОбновление;
	Элементы.ТаблицаОтчета.Доступность 				   	  = НЕ ИдетРасчет;
	
	//Элементы.ДеревоЭтаповГиперссылкаВыполнить.Доступность		  = НЕ ИдетРасчет И НЕ ИдетОбновление И НЕ ИзмененияЗапрещены;
	//Элементы.ДеревоЭтаповГиперссылкаПодробнее.Доступность		  = НЕ ИдетРасчет И НЕ ИдетОбновление;
	
	//Если ИдетОбновление Тогда
	//	// Пока ничего не делаем
	//ИначеЕсли ЗначениеЗаполнено(ОбщаяДатаНачалаРасчета) И ОбщаяДатаНачалаРасчета < Объект.ПериодРегистрации Тогда
	//	
	//	Элементы.ДекорацияПериода.Видимость = Истина;
	//	Элементы.ДекорацияПериода.Подсказка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//		НСтр("ru = 'Требуется пересчет операций начиная с периода %1'"),
	//		РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ОбщаяДатаНачалаРасчета));
	//	
	//Иначе
	//	
	//	Элементы.ДекорацияПериода.Видимость = Ложь;
	//	Элементы.ДекорацияПериода.Подсказка = "";
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАктивностьФоновогоЗаданияРасчета()
	
	СостояниеЗадания = ТекущееСостояниеФоновогоЗадания(ИДЗадания);
	
	Если ЗначениеЗаполнено(СостояниеЗадания.ТекстОшибки) Тогда
		
		//ЗафиксироватьПроблемуАварийногоЗавершенияРасчета(СостояниеЗадания.ТекстОшибки);
		
	ИначеЕсли СостояниеЗадания.Отменено ИЛИ СостояниеЗадания.ЗавершеноАварийно ИЛИ СостояниеЗадания.НеНайдено Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Фоновое задание расчета %1.'"),
			?(СостояниеЗадания.Отменено,
				НСтр("ru='отменено администратором'"),
				?(СостояниеЗадания.ЗавершеноАварийно,
					НСтр("ru='завершено аварийно'"),
					НСтр("ru='не найдено в списке заданий'"))));
		
		//ЗафиксироватьПроблемуАварийногоЗавершенияРасчета(ТекстОшибки);
		
	КонецЕсли;
	
	Если СостояниеЗадания.Активно Тогда // запущен расчет следующего этапа
	 
		ПредставлениеРассчитываемогоЭтапа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Выполняется операция ""%1""...'"),
			СостояниеРасчета.ПредставлениеЭтапа);
		
	 	//ПодключитьОбработчикОжидания("ПроверитьАктивностьФоновогоЗаданияРасчета", 1, Истина);
		ПроверитьАктивностьФоновогоЗаданияРасчета();
		Возврат;
		
	КонецЕсли;
	
	//Если ПрерватьРасчет Тогда
	Если Ложь Тогда
		
		// Расчет прерван.
		СостояниеРасчета.РасчетЗавершен = Истина;
		НастроитьЭлементыВЗависимостиОтНаличияФоновыхЗаданий();
		
	Иначе
		
		// Расчет завершен.
		НастроитьЭлементыВЗависимостиОтНаличияФоновыхЗаданий();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ВывестиВТабличныйДокумент(ДокументСсылка, ЦветОбласти = Неопределено)
		
	Макет = ПолучитьОбщийМакет("МакетСозданныхИОбновленныхЗаказов");
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДокумента");
	ОбластьПустаяЯчейка = Макет.ПолучитьОбласть("ПустаяЯчейка");
	ОбластьДокументЗаписан = Макет.ПолучитьОбласть("ДокументЗаписан");
	ОбластьДокументПомеченНаУдаление = Макет.ПолучитьОбласть("ДокументПомеченНаУдаление");
	ОбластьДокументПроведен = Макет.ПолучитьОбласть("ДокументПроведен");
	ОбластьОшибка = Макет.ПолучитьОбласть("Ошибка");
	
	ОбластьПустая = Макет.ПолучитьОбласть("ПустаяСтрока");	
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Выборка = ПолучитьВыборкуПоРеквизитамОбъекта(ДокументСсылка);
		Если Выборка.Следующий() Тогда			
			ПереопределяемоеПредставление = "";
			СтруктураПодчиненностиПереопределяемый.ПриПолученииПредставления(ТипЗнч(ДокументСсылка), Выборка, ПереопределяемоеПредставление, Истина);		
			Если ЗначениеЗаполнено(ПереопределяемоеПредставление) Тогда
				ОбластьСтатус = ?(Выборка.ПометкаУдаления, ОбластьДокументПомеченНаУдаление, ?(Выборка.Проведен, ОбластьДокументПроведен, ОбластьДокументЗаписан));
				ТаблицаОтчета.Вывести(ОбластьСтатус);
				ОбластьМакета.Параметры.Документ = ДокументСсылка;
				ОбластьМакета.Параметры.Представление = ПереопределяемоеПредставление;
				ТаблицаОтчета.Присоединить(ОбластьМакета);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		Выборка = ПолучитьВыборкуПоРеквизитамОбъекта(ДокументСсылка);
		Если Выборка.Следующий() Тогда			
			ПереопределяемоеПредставлениеЭлемент = "";
			СтруктураПодчиненностиПереопределяемый.ПриПолученииПредставления(ТипЗнч(ДокументСсылка), Выборка, ПереопределяемоеПредставлениеЭлемент, Истина);			
			Если ЗначениеЗаполнено(ПереопределяемоеПредставлениеЭлемент) Тогда
				
				ТаблицаОтчета.Вывести(ОбластьПустаяЯчейка);
				ОбластьСтатус = ?(Выборка.ПометкаУдаления, ОбластьДокументПомеченНаУдаление, ?(Выборка.Проведен, ОбластьДокументПроведен, ОбластьДокументЗаписан));
				ТаблицаОтчета.Присоединить(ОбластьСтатус);
				
				ОбластьМакета.Параметры.Документ = ДокументСсылка;
				ОбластьМакета.Параметры.Представление = ПереопределяемоеПредставлениеЭлемент;
				ТекущаяОбласть = ТаблицаОтчета.Присоединить(ОбластьМакета);						
								
				Если НЕ ЦветОбласти = Неопределено Тогда
					ТаблицаОтчета.Область(ТекущаяОбласть.Верх, ТекущаяОбласть.Лево-10, ТекущаяОбласть.Низ, ТекущаяОбласть.Право+10).ЦветФона = ЦветОбласти;
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВыпускПродукции") Тогда
		Выборка = ПолучитьВыборкуПоРеквизитамОбъекта(ДокументСсылка);
		Если Выборка.Следующий() Тогда			
			ПереопределяемоеПредставлениеЭлемент = "";
			СтруктураПодчиненностиПереопределяемый.ПриПолученииПредставления(ТипЗнч(ДокументСсылка), Выборка, ПереопределяемоеПредставлениеЭлемент, Истина);			
			Если ЗначениеЗаполнено(ПереопределяемоеПредставлениеЭлемент) Тогда
				
				ТаблицаОтчета.Вывести(ОбластьПустаяЯчейка);
				ТаблицаОтчета.Присоединить(ОбластьПустаяЯчейка);
				ОбластьСтатус = ?(Выборка.ПометкаУдаления, ОбластьДокументПомеченНаУдаление, ?(Выборка.Проведен, ОбластьДокументПроведен, ОбластьДокументЗаписан));
				ТаблицаОтчета.Присоединить(ОбластьСтатус);
				
				ОбластьМакета.Параметры.Документ = ДокументСсылка;
				ОбластьМакета.Параметры.Представление = ПереопределяемоеПредставлениеЭлемент;
				ТекущаяОбласть = ТаблицаОтчета.Присоединить(ОбластьМакета);						
								
				Если НЕ ЦветОбласти = Неопределено Тогда
					ТаблицаОтчета.Область(ТекущаяОбласть.Верх, ТекущаяОбласть.Лево-10, ТекущаяОбласть.Низ, ТекущаяОбласть.Право+10).ЦветФона = ЦветОбласти;
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("Строка") Тогда		
		ОбластьОшибка.Параметры.ОписаниеОшибки = ДокументСсылка;
		ТаблицаОтчета.Вывести(ОбластьОшибка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УДАЛИТЬ_ВывестиТабличныйДокумент()
	
	ТаблицаОтчета.Очистить();
	
	Макет = ПолучитьОбщийМакет("МакетСозданныхИОбновленныхЗаказов");
	ОбластьРодитель = Макет.ПолучитьОбласть("Родитель");
	ОбластьЭлемент = Макет.ПолучитьОбласть("ПодчиненныйЭлемент");
	ОбластьПустая = Макет.ПолучитьОбласть("ПустаяСтрока");	
	
	ЗаказыПокупателей = УДАЛИТЬ_СтруктураСозданныхИОбновленныхЗаказовНаПроизводство.Выгрузить(, "ЗаказПокупателя");
	ЗаказыПокупателей.Свернуть("ЗаказПокупателя");
	
	Для Каждого ТекущийЗаказПокупателя Из ЗаказыПокупателей Цикл
		Выборка = ПолучитьВыборкуПоРеквизитамОбъекта(ТекущийЗаказПокупателя.ЗаказПокупателя);
		Если Выборка.Следующий() Тогда
			
			ПереопределяемоеПредставление = СтруктураПодчиненностиПереопределяемый.ПредставлениеОбъектаДляВыводаВОтчет(Выборка);
		
			Если ПереопределяемоеПредставление <> Неопределено Тогда
				ОбластьРодитель.Параметры.Документ = ТекущийЗаказПокупателя.ЗаказПокупателя;
				ОбластьРодитель.Параметры.Представление = ПереопределяемоеПредставление;
				ТаблицаОтчета.Вывести(ОбластьРодитель);
				
				//Вывод подчиненных элементов: заказы на производство
				НайденныеПодчиненныеЭлементы = УДАЛИТЬ_СтруктураСозданныхИОбновленныхЗаказовНаПроизводство.НайтиСтроки(Новый Структура("ЗаказПокупателя", ТекущийЗаказПокупателя.ЗаказПокупателя));
				
				Для Каждого ТекущаяСтрока Из НайденныеПодчиненныеЭлементы Цикл
					
					ВыборкаЭлемент = ПолучитьВыборкуПоРеквизитамОбъекта(ТекущаяСтрока.ЗаказНаПроизводство);
					Если ВыборкаЭлемент.Следующий() Тогда
						
						ПереопределяемоеПредставлениеЭлемент = СтруктураПодчиненностиПереопределяемый.ПредставлениеОбъектаДляВыводаВОтчет(ВыборкаЭлемент);
					
						Если ПереопределяемоеПредставлениеЭлемент <> Неопределено Тогда
							ОбластьЭлемент.Параметры.Документ = ТекущаяСтрока.ЗаказНаПроизводство;
							ОбластьЭлемент.Параметры.Представление = ПереопределяемоеПредставлениеЭлемент;
							ТекущаяОбласть = ТаблицаОтчета.Вывести(ОбластьЭлемент);						
							
							//ЦветОбласти = WebЦвета.ОранжевоКрасный;
							ЦветОбласти = WebЦвета.Золотой;
							Если ТекущаяСтрока.Создан Тогда
								ЦветОбласти = WebЦвета.ЛимонноЗеленый;
							ИначеЕсли Элементы.ГруппаОшибкаПроведенияВыпуска.Видимость И НЕ ТекущаяСтрока.ПроведенВыпуск Тогда
								ЦветОбласти = WebЦвета.ОранжевоКрасный;
							КонецЕсли;	
							
							ТаблицаОтчета.Область(ТекущаяОбласть.Верх, ТекущаяОбласть.Лево-10, ТекущаяОбласть.Низ, ТекущаяОбласть.Право+10).ЦветФона = ЦветОбласти;
							
						КонецЕсли;	
						
					КонецЕсли;	
					
				КонецЦикла;				
				
			ТаблицаОтчета.Вывести(ОбластьПустая);	
				
			КонецЕсли;	
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВыборкуПоРеквизитамОбъекта(ОбъектСсылка)
	
	МетаданныеОбъекта = ОбъектСсылка.Метаданные();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка,
	|	#Проведен,
	|	ПометкаУдаления,
	|	#Сумма ,
	|	#Валюта,
	|	#Представление
	|ИЗ
	|	" + МетаданныеОбъекта.ПолноеИмя() + "
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	
	Если ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда
		ИмяРеквизитаСумма    = ИмяРеквизитаДокумента(МетаданныеОбъекта.Имя, "СуммаДокумента");
		ИмяРеквизитаВалюта   = ИмяРеквизитаДокумента(МетаданныеОбъекта.Имя, "Валюта");
		ИмяРеквизитаПроведен = "Проведен";
	Иначе
		ИмяРеквизитаСумма    = Неопределено;
		ИмяРеквизитаВалюта   = Неопределено;
		ИмяРеквизитаПроведен = "Ложь";
	КонецЕсли;
	
	ЗаменитьТекстЗапроса(ТекстЗапроса, МетаданныеОбъекта, "#Проведен", ИмяРеквизитаПроведен, "Проведен", Истина);
	ЗаменитьТекстЗапроса(ТекстЗапроса, МетаданныеОбъекта, "#Сумма", ИмяРеквизитаСумма, "СуммаДокумента");
	ЗаменитьТекстЗапроса(ТекстЗапроса, МетаданныеОбъекта, "#Валюта", ИмяРеквизитаВалюта, "Валюта");
	
	МассивДопРеквизитов = СтруктураПодчиненностиПереопределяемый.МассивРеквизитовОбъектаДляФормированияПредставления(МетаданныеОбъекта.Имя);
	
	ДополнитьТекстЗапросаПоРеквизитамОбъекта(ТекстЗапроса, МассивДопРеквизитов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	Возврат Запрос.Выполнить().Выбрать(); 
	
КонецФункции

&НаСервере
Функция ИмяРеквизитаДокумента(ИмяОбъекта, Реквизит) 
	
	ИмяРеквизитаДокумента = СтруктураПодчиненностиПереопределяемый.ИмяРеквизитаДокумента(ИмяОбъекта, Реквизит); 
	
	Если Реквизит = "СуммаДокумента" Тогда
		Возврат ?(ИмяРеквизитаДокумента = Неопределено,"СуммаДокумента",ИмяРеквизитаДокумента);
	ИначеЕсли Реквизит = "Валюта" Тогда
		Возврат ?(ИмяРеквизитаДокумента = Неопределено,"Валюта",ИмяРеквизитаДокумента);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаменитьТекстЗапроса(ТекстЗапроса, МетаданныеОбъекта, ЧтоЗаменять, ИмяРеквизита, Представление, НеИскатьВРеквизитах = Ложь)

	Если НеИскатьВРеквизитах Или МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменять, ИмяРеквизита + " КАК " + Представление);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменять, " NULL КАК " + Представление);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДополнитьТекстЗапросаПоРеквизитамОбъекта(ТекстЗапроса, МассивРеквизитов)
	
	ТекстПредставление = "Представление КАК Представление";
	
	Для Инд = 1 По 3 Цикл
		
		ТекстПредставление = ТекстПредставление + ",
			|	" + ?(МассивРеквизитов.Количество() >= Инд,МассивРеквизитов[инд - 1],"NULL") + " Как ДополнительныйРеквизит" + Инд;
		
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#Представление", ТекстПредставление);
	
КонецПроцедуры
