
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Параметры:
	// ИспользуемыеВидыЦен - массив доступных и разрешенных к выбору видов цен
	// ВыбранныеВидыЦен - массив выбранных видов цен
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВыбранныеВидыЦен", Параметры.ВыбранныеВидыЦен); 
	Запрос.УстановитьПараметр("ИспользуемыеВидыЦен", Параметры.ИспользуемыеВидыЦен);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА ВидыЦен.Ссылка В (&ВыбранныеВидыЦен)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Устанавливать,
	|	ЛОЖЬ КАК Запрещенный,
	|	ВидыЦен.ЭтоГруппа КАК ЭтоГруппа,
	|	ВидыЦен.Архивный КАК Архивный
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	(ВидыЦен.Ссылка В (&ИспользуемыеВидыЦен)
	|			ИЛИ ВидыЦен.ЭтоГруппа)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыЦен.Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Дерево.Строки.Сортировать("ЭтоГруппа УБЫВ", Истина);
	
	УстановкаЦенСервер.УбратьНеиспользуемыеГруппыРекурсивно(Дерево.Строки);
	УстановкаЦенСервер.ИзменитьПризнакУстанавливатьДляГрупп(Дерево);
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоВидовЦен");
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановкаЦенКлиент.РазвернутьДерево(Элементы, ДеревоВидовЦен, "ДеревоВидовЦен");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоВидовЦенУстанавливатьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоВидовЦен.ТекущиеДанные;	
	УстановкаЦенКлиент.ДеревоВидовЦенУстанавливатьПриИзменении(ДеревоВидовЦен, ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВидыЦенУстановитьВсе(Команда)
		
	УстановкаЦенКлиент.ДеревоВидовЦенИзменитьПризнакУстанавливать(ДеревоВидовЦен, Истина);
	Модифицированность = Истина;
	ЦеныИзменены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенСнятьВсе(Команда)
		
	УстановкаЦенКлиент.ДеревоВидовЦенИзменитьПризнакУстанавливать(ДеревоВидовЦен, Ложь);
	Модифицированность = Истина;
	ЦеныИзменены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивВыбранныхЦен = Новый Массив;	
	УстановкаЦенКлиент.НайтиВыбранныеВидыЦенРекурсивно(ДеревоВидовЦен, МассивВыбранныхЦен);
	
	Закрыть(МассивВыбранныхЦен);
	
КонецПроцедуры

#КонецОбласти
