
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ПоказыватьТаблицуЦенВСправочникеНоменклатуры = ПараметрыСеанса.ПоказыватьТаблицуЦенВСправочникеНоменклатуры;
	Элементы.ЦеныНоменклатуры.Видимость = ПоказыватьТаблицуЦенВСправочникеНоменклатуры;
	
	Если Параметры.Свойство("ТипДокумента") И Параметры.Свойство("Назначение") Тогда
		
		Если Параметры.ТипДокумента = "ЗаказДоговор"
			И Параметры.Назначение = "Товары"
			И ПолучитьФункциональнуюОпцию("ОграничитьВыборТоваровВЗаказДоговор")
		Тогда
			
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьОтбор(1, Список, "Ссылка");	
			
			//++ №11160
			//Если ПолучитьФункциональнуюОпцию("ВариантОтображенияСпискаТоваровПриОграниченииВЗаказДоговоре") = Перечисления.ВариантОтображенияСпискаПриОграничении.ВВидеСпискаБезИерархии Тогда
			//	ВыводитьСписокБезИерархии = Истина;
			//КонецЕсли;
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьУсловноеОформлениеНедоступныеГруппы(1, Список);
			//-- №11160
			
		ИначеЕсли (Параметры.ТипДокумента = "ЗаказДоговор"
				Или Параметры.ТипДокумента = "Монтаж") // №11160
			И Параметры.Назначение = "Материалы"
			И ПолучитьФункциональнуюОпцию("ОграничитьВыборМатериаловВЗаказДоговор")
		Тогда
				
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьОтбор(2, Список, "Ссылка");
		
			//++ №11160
			//Если ПолучитьФункциональнуюОпцию("ВариантОтображенияСпискаМатериаловПриОграниченииВЗаказДоговоре") = Перечисления.ВариантОтображенияСпискаПриОграничении.ВВидеСпискаБезИерархии Тогда
			//	
			//	ВыводитьСписокБезИерархии = Истина;
			//	
			//ИначеЕсли ПолучитьФункциональнуюОпцию("ВариантОтображенияСпискаМатериаловПриОграниченииВЗаказДоговоре") = Перечисления.ВариантОтображенияСпискаПриОграничении.ИерархияТолькоДоступныхПапок Тогда
			//	
			//	РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьУсловноеОформлениеНедоступныеГруппы(2, Список);
			//	
			//КонецЕсли;
			
			РегистрыСведений.РазрешеннаяНоменклатураРозницы.УстановитьУсловноеОформлениеНедоступныеГруппы(2, Список);
			
			//-- №11160
				
		КонецЕсли;
			
	КонецЕсли;
	
	// №9226
	Если Параметры.Свойство("БезУслуг") И Параметры.БезУслуг Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список
			, "ВидНоменклатуры"
			, Справочники.ВидыНоменклатуры.Услуга
			, ВидСравненияКомпоновкиДанных.НеРавно
			,
			, Истина);
	КонецЕсли;
	
	// №12232 не даем выбрать "Типовой отрез"
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список
		, "ВидНоменклатуры"
		, Справочники.ВидыНоменклатуры.ТиповойОтрез
		, ВидСравненияКомпоновкиДанных.НеРавно
		,
		, Истина);
	
	УстановитьОтборАрхивнаяНоменклатура(ЭтотОбъект); // №6744
	
КонецПроцедуры

&НаСервере
Функция ПолучитьГруппыНеВИерархии(Группа)
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |    Номенклатура.Ссылка
    |ИЗ
    |    Справочник.Номенклатура КАК Номенклатура
    |ГДЕ
    |    НЕ Номенклатура.Ссылка В ИЕРАРХИИ (&Группа)
    |    И Номенклатура.ЭтоГруппа";
    Запрос.УстановитьПараметр("Группа",Группа);
	
    Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьГруппыПредпросмотрИзображения();
	
	//++ №11160
	Если ВыводитьСписокБезИерархии Тогда
		
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		Элементы.ФормаРежимПросмотра.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюРежимПросмотра.Видимость = Ложь;
		
	КонецЕсли;
	//-- №11160
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Оформление архивной номенклатуры
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(
		УсловноеОформление.Элементы, "Список", 
		Новый ПолеКомпоновкиДанных("Список.Архивная"), ВидСравненияКомпоновкиДанных.Равно, Истина,
		ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
КонецПроцедуры
	
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Если НЕ ТекущиеДанные.Ссылка = ТекущаяНоменклатура Тогда
			
			ТекущаяНоменклатура = ТекущиеДанные.Ссылка;
			
			Если ПоказыватьТаблицуЦенВСправочникеНоменклатуры Тогда
				ПоказатьЦеныНоменклатурыТекущегоПользователя(ТекущиеДанные.Ссылка);
			КонецЕсли;
			
			//++ №9160
			Если ПоказыватьИзображенияНоменклатуры Тогда
				ПодключитьОбработчикОжидания("ОбработчикОжиданияФайлыПриАктивизацииСтроки", 0.1, Истина);
			КонецЕсли;	
			//-- №9160
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьЦеныНоменклатурыТекущегоПользователя(Номенклатура)
	
	ЦеныНоменклатуры.Очистить();
	
	Если НЕ Номенклатура.ЭтоГруппа Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПользователиВидыЦенОтображаемыеВСправочникеНоменклатуры.ВидЦены КАК ВидЦены,
		|	ПользователиВидыЦенОтображаемыеВСправочникеНоменклатуры.Валюта КАК Валюта,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК Дата,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.Пользователи.ВидыЦенОтображаемыеВСправочникеНоменклатуры КАК ПользователиВидыЦенОтображаемыеВСправочникеНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ПользователиВидыЦенОтображаемыеВСправочникеНоменклатуры.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
		|			И ПользователиВидыЦенОтображаемыеВСправочникеНоменклатуры.Валюта = ЦеныНоменклатурыСрезПоследних.Валюта
		|ГДЕ
		|	ПользователиВидыЦенОтображаемыеВСправочникеНоменклатуры.Ссылка = &Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидЦены";
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЦеныНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииПоля(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьАрхивнуюПриИзменении(Элемент)
		
	УстановитьОтборАрхивнаяНоменклатура(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборАрхивнаяНоменклатура(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список,
		"Архивная",
		Ложь,
		,
		,
		Не Форма.ПоказыватьАрхивную);
	
КонецПроцедуры

//++ №9160
&НаКлиенте
Процедура ОбновитьВидимостьГруппыПредпросмотрИзображения()
	
	Элементы.ГруппаФайлыПредпросмотр.Видимость = ПоказыватьИзображенияНоменклатуры;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьИзображенияНоменклатурыПриИзменении(Элемент)
	
	ОбновитьВидимостьГруппыПредпросмотрИзображения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияФайлыПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзображениеСтруктура = ПоместитьДанныеВХранилище(ТекущиеДанные);
	Если ИзображениеСтруктура.ЕстьИзображение Тогда
		ОбщийМодульКлиент.ПредпросмотрФайла(ИзображениеСтруктура.Хранилище, ИзображениеСтруктура.Расширение, Предпросмотр, Элементы.Предпросмотр);
	Иначе	
		Предпросмотр = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВХранилище(ТекущиеДанные)
	
	Данные = новый Структура();
	Данные.Вставить("ЕстьИзображение", (НЕ ТекущиеДанные.Ссылка.ФайлКартинки.ФайлХранилище.Получить() = Неопределено));
	Данные.Вставить("Хранилище", ПоместитьВоВременноеХранилище(ТекущиеДанные.Ссылка.ФайлКартинки.ФайлХранилище.Получить(), ЭтаФорма.УникальныйИдентификатор));
	Данные.Вставить("Расширение", ТекущиеДанные.Ссылка.ФайлКартинки.Расширение);
	
	Возврат Данные;
	
КонецФункции
//-- №9160

