#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда		

	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	//#15936
	Элементы.ОрганизацияПолучатель.ТолькоПросмотр = НЕ Константы.РазрешитьПеремещениеДенежныхСредствМеждуОрганизациями.Получить();
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Объект.Валюта = Объект.ВалютаПолучатель Тогда
			Если НЕ Объект.Сумма = Объект.СуммаПолучатель Тогда
				ПоказатьПредупреждение(,"Сумма отправленная и сумма полученная не равны");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КассаОтправительПриИзменении(Элемент)
	Если НЕ КассаОтправительПриИзмененииНаСервере() Тогда
		ПоказатьПредупреждение(,"Выбрана касса, не принадлежащая организации-отправителю");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КассаОтправительПриИзмененииНаСервере()
	Если НЕ Объект.КассаОтправитель.Владелец = Объект.Организация Тогда
		Объект.КассаОтправитель = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	Если НЕ Объект.КассаОтправитель.Валюта.Пустая() Тогда
		Объект.Валюта = Объект.КассаОтправитель.Валюта;
	Иначе
		Объект.Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура КассаПолучательПриИзменении(Элемент)
	Если НЕ КассаПолучательПриИзмененииНаСервере() Тогда
		ПоказатьПредупреждение(,"Выбрана касса, не принадлежащая организации-получателю");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КассаПолучательПриИзмененииНаСервере()
	Если НЕ Объект.КассаПолучатель.Владелец = Объект.ОрганизацияПолучатель Тогда
		Объект.КассаПолучатель = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	Объект.ВалютаПолучатель = Объект.КассаПолучатель.Валюта;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.ОрганизацияПолучатель = Объект.Организация;
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Если Объект.ВалютаПолучатель = Объект.Валюта Тогда 
		Объект.СуммаПолучатель = Объект.Сумма;
		
	ИначеЕсли Объект.СуммаПолучатель = 0 И НЕ ЗначениеЗаполнено(Объект.ВалютаПолучатель) Тогда
		Объект.СуммаПолучатель = Объект.Сумма;	
		Объект.ВалютаПолучатель = Объект.Валюта;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПолучательПриИзменении(Элемент)
	
	Если Объект.ВалютаПолучатель = Объект.Валюта Тогда 
		Объект.Сумма = Объект.СуммаПолучатель;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если Объект.Валюта = Объект.ВалютаПолучатель Тогда 
		Объект.Сумма = Объект.СуммаПолучатель;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПолучательПриИзменении(Элемент)
	
	Если Объект.ВалютаПолучатель = Объект.Валюта Тогда 
		Объект.СуммаПолучатель = Объект.Сумма;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	ТолькоПросмотрЭлементов = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаНаПеремещениеДенежныхСредств") Тогда
		ТолькоПросмотрЭлементов = Истина;
	КонецЕсли;
		
	ЭлементыТолькоПросмотр = Новый Массив;
	ЭлементыТолькоПросмотр.Добавить(Элементы.Номер);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Основание);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Кассы);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Статья);
	
	Для каждого Элемент Из ЭлементыТолькоПросмотр Цикл
		Элемент.ТолькоПросмотр = ТолькоПросмотрЭлементов;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
