//_____________________________________________________________
// Обработчики НФ

&НаСервере
Функция ЕстьБизнесПроцессы()
	Возврат ЗначениеЗаполнено(Объект.БизнесПроцесс) И ЗначениеЗаполнено(Объект.ИА_ТочкаБП);
КонецФункции

&НаСервере
Процедура БП_ЗаполнитьСвязанныеДанные()
    Если ЕстьБизнесПроцессы() Тогда
    	ИА_БПС.ФормаЗадачи_ЗаполнитьРеквизитыБП(Объект, ИА_БПРеквизиты);
    КонецЕсли;  
КонецПроцедуры
 
&НаСервере
Процедура БП_ПриСозданииНаСервере()
    Если ЕстьБизнесПроцессы() Тогда
        Если ЗначениеЗаполнено(Объект.БизнесПроцесс) Тогда
            Элементы.ГруппаБП.Видимость = Истина;
            Элементы.ИА_ВариантУсловияБП.Видимость = Справочники.ИА_БПТочкиМаршрута.ВТочкеТребуетсяВыборВарианта(Объект.ИА_ТочкаБП);          
        Иначе
            Элементы.ГруппаБП.Видимость = Ложь;
        КонецЕсли; 
        БП_ЗаполнитьСвязанныеДанные();
        
        Элементы.ИА_БПДанные.Видимость = ИА_БПРеквизиты.Количество() > 0;
        Элементы.ИА_БПВладелец.Видимость = Объект.БизнесПроцесс.ИА_МаршрутЗадачБП.ВыводитьВладельцаБПВЗадаче;
        ИА_БПВладелец = Объект.БизнесПроцесс.ИА_Владелец;
    КонецЕсли;     
КонецПроцедуры

&НаСервере
Процедура БП_ЗаписатьСвязанныеДанные()
    Если ЕстьБизнесПроцессы() Тогда
        ИА_БПС.ФормаЗадачи_ЗаписатьСвязанныеДанныеБП(Объект, ИА_БПРеквизиты);
    КонецЕсли; 
КонецПроцедуры

//_____________________________________________________________



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Взаимодействия1с = Константы.КСУ_КЦ_ИспользоватьВзаимодействия1С.Получить();
	
	// Заполнение новой
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = ТекПользователь;
		Объект.ПостАвтора = ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПолучитьВысокийПостПользователя(ТекПользователь);
		
		Если Параметры.ЭтоЗРС Тогда
			Объект.ЭтоЗРС = Истина;
		КонецЕсли;
		
		Если Параметры.ЭтоПослание Тогда
			Объект.ЭтоПослание = Истина;
		КонецЕсли;
		
		Параметры.Свойство("Пост", Объект.Пост);
		Параметры.Свойство("Пользователь", Объект.Пользователь);
		Параметры.Свойство("ЗадачаСУ", Объект.ЗадачаСУ);
		Параметры.Свойство("Наименование", Объект.Наименование);
		Параметры.Свойство("Содержание", Объект.Содержание);
		
		Если не Объект.ЭтоПослание Тогда
			Объект.Приоритет = Перечисления.КСУ_ПриоритетЗадачи.Средний;
		КонецЕсли;
	КонецЕсли;
	
	// Определение режима
	ЭтоЗРС = Объект.ЭтоЗРС;
	ЭтоПослание = Объект.ЭтоПослание;
	ЭтоЗадача = не (ЭтоЗРС или ЭтоПослание);
	
	//
	Если ЭтоЗадача Тогда
		ЭтоАдмин = ИА_ПраваС.ЗначениеПрава(ТекПользователь, ПредопределенноеЗначение("ПланВидовХарактеристик.ИА_ПраваПользователей.АдминистраторЗадач"));
		ЭтоДоклад = ЗначениеЗаполнено(Объект.ЗадачаСУ);
		БП_ПриСозданииНаСервере();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура ОбновитьЗаголовкиЭлементовШапки() Экспорт
	Элементы.Автор.Заголовок = Объект.Автор;
	Элементы.ПостАвтора.Заголовок = ?(Объект.ПостАвтора.Пустая(), "<выбрать пост>",СокрЛП(Объект.ПостАвтора.Наименование));
	
	Если Объект.ЗРСП Тогда
		Если Объект.ПоКомлиниям И Объект.Маршрут.Количество()>0 Тогда 
			Элементы.Пользователь.Заголовок = ""; 
			Элементы.Пост.Заголовок = "[ЗРСП] " + Объект.Маршрут[Объект.Маршрут.Количество()-1].Пост;
		Иначе
			Элементы.Пользователь.Заголовок = "[ЗРСП] " + Объект.ИсполнительЗРС; 
			Элементы.Пост.Заголовок = "";
		КонецЕсли;
	Иначе
		Если ВводСпискаИсполнителей Тогда
			ТекстСпис = "";
			Для каждого стр из СписокИсполнителей Цикл
				ТекстСпис = ТекстСпис + стр.Значение + "; ";
			КонецЦикла;
			
			Элементы.Пользователь.Заголовок = ?(СписокИсполнителей.Количество()=0, "<выбрать сотрудников>", ТекстСпис); 
		Иначе
			Элементы.Пользователь.Заголовок = ?(Объект.Пользователь.Пустая(), "<выбрать сотрудника>",Объект.Пользователь); 
		КонецЕсли;
		Элементы.Пост.Заголовок = ?(Объект.Пост.Пустая(), "<выбрать пост>",СокрЛП(Объект.Пост.Наименование));
	КонецЕсли;
	
	Элементы.Срок.Заголовок = ?(ЗначениеЗаполнено(Объект.СрокИсполнения), Формат(Объект.СрокИсполнения,"ДФ=dd.MM.yyyy"),"<указать срок>");
КонецПроцедуры
	
&НаСервере 
Процедура ОбновитьЗаголовокИФотоАвтора()
	Заголовок = "Задача";
	Если Объект.ЭтоЗРС Тогда
		Заголовок = "ЗРС";
	ИначеЕсли Объект.ЭтоПослание Тогда
		Заголовок = "Послание";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		Заголовок = Заголовок + " от " + Объект.Дата;
	КонецЕсли;
	//
	Фото = РегистрыСведений.ИА_ДанныеФизЛиц.ПолучитьФотоПользователя(Объект.Автор,"Аватар");
	ФотоАвтора = ПоместитьВоВременноеХранилище(Фото, ЭтаФорма.УникальныйИдентификатор); 
	
	Фото = РегистрыСведений.ИА_ДанныеФизЛиц.ПолучитьФотоПользователя(ТекПользователь,"Аватар");
	ФотоТекПользователя = ПоместитьВоВременноеХранилище(Фото, Новый УникальныйИдентификатор); 
	
	Фото = РегистрыСведений.ИА_ДанныеФизЛиц.ПолучитьФотоПользователя(Объект.Исполнитель,"Аватар");
	ФотоИсполнителя = ПоместитьВоВременноеХранилище(Фото, Новый УникальныйИдентификатор); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если не ИА_Защита_Общий.ЛицензияДоступна("КЦ") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	ОбновитьНаСервере();
	
	ОбновитьВидимостьКнопок();
	ОбновитьВидимостьДоступностьЭлементов();
	ОбновитьСвернутыеЗаголовки();
	ОбновитьКоличествоФайлов();
	ОбновитьНадписьПрикрОбъекта();
	ОбновитьНадписьОснование();
	ОбновитьНадписьПриоритет();
	ОбновитьГруппуПодзадачи();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ОбновитьЗаголовокИФотоАвтора();
	ОбновитьЗаголовкиЭлементовШапки();
	Если не Взаимодействия1с Тогда
		СформироватьЛенту();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Функция ИтогПоМаршруту(пКолонка)
	рез = 0;
	Для каждого стр из Объект.Маршрут Цикл
		Если стр[пКолонка] Тогда
			рез = рез + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат рез;
КонецФункции

&НаКлиенте
Функция ЭтоВыполнениеПоКомандЛинии()
	Если не Объект.ПоКомлиниям Тогда
		Возврат ложь;
	КонецЕсли;
	
	всегоШагов = Объект.Маршрут.Количество();
	ИтогоВыполнено = ИтогПоМаршруту("ВсеВерно");
	Если ИтогоВыполнено < всегоШагов И ИтогоВыполнено > 0 Тогда
		Возврат истина;
	Иначе
		Возврат ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ЭтоСерединаКомандЛинии()
	Если не Объект.ПоКомлиниям Тогда
		Возврат ложь;
	КонецЕсли;
	
	всегоШагов = Объект.Маршрут.Количество();
	ИтогоВыполнено = ИтогПоМаршруту("ВсеВерно");
	Если ИтогоВыполнено < всегоШагов-1 И ИтогоВыполнено > 0 Тогда
		Возврат истина;
	Иначе
		Возврат ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ЭтоВозвратПоКомандЛинии()
	Если не Объект.ПоКомлиниям Тогда
		Возврат ложь;
	КонецЕсли;
	
	всегоШагов = Объект.Маршрут.Количество();
	ИтогоВыполнено = ИтогПоМаршруту("ВсеВерно");
	
	Возврат ИтогоВыполнено = всегоШагов;
КонецФункции

&НаКлиенте                                                      
Функция ЗапретитьВыполнение(ТекПользователь)
	
	Если Объект.Ссылка.Пустая() или Объект.Выполнена или не Объект.Отправлена Тогда // запретим выполнение новых, выполненных и черновиков
		возврат истина;
	КонецЕсли;
	
	Если (Объект.Автор <> ТекПользователь или Объект.ПоКомлиниям или ЭтоДоклад) и не ИА_Защита_КЦ.ЭтоМояЗадача(Объект.Ссылка) Тогда // не может выполнить задачу тот, кому она не адресована если он не автор и не по командной линии
		возврат истина;
	КонецЕсли;
	
	Возврат  Ложь;
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьКнопок()	
	ЗапретитьВыполнение = ЗапретитьВыполнение(ТекПользователь); // простая проверка на автора или того, кому задача адресована
	МояЗадача = ИА_Защита_КЦ.ЭтоМояЗадача(Объект.Ссылка);
	ЭтоНовый = Объект.Ссылка.Пустая();
	ЭтоМойЧерновик = ЭтоНовый ИЛИ (Объект.Автор = ТекПользователь и не Объект.Отправлена);
	Выполнена = Объект.Выполнена;
	ВыполнениеПоКоманднойЛинии = ЭтоВыполнениеПоКомандЛинии();
	СерединаКоманднойЛинии = ЭтоСерединаКомандЛинии();
	ВозвратАторуВыполненнойЗадачи = ЭтоВозвратПоКомандЛинии();
	ОтклонениеЗРС = Объект.ОтклонениеЗРС;
	ЗРСП = Объект.ЗРСП;
	
	// командная панель
	Элементы.ГруппКнПослание.Видимость = ЭтоПослание;
	Элементы.ГруппКнЗадача_ЗРС.Видимость = ЭтоЗадача или ЭтоЗРС;
	
	Если ЭтоПослание Тогда
		Если Объект.Отправлена Тогда
	        Элементы.ОК.Видимость = Ложь;
			Если не Объект.Выполнена Тогда
				Элементы.ФормаОтветить.Видимость = МояЗадача и (Объект.Пользователь<>Объект.Автор ИЛИ Объект.ЭтоПереписка);
			КонецЕсли;
	    Иначе
	        Элементы.ОК.Видимость = истина;
	        //Элементы.ОК.КнопкаПоУмолчанию = истина;
			Элементы.ФормаОтветить.Видимость = Ложь;
		КонецЕсли;
		
	    Элементы.Прочитано.Видимость = (не Объект.Выполнена) И (не ЭтоНовый) и МояЗадача;
		//Элементы.Прочитано.КнопкаПоУмолчанию = Элементы.Прочитано.Видимость;
	Иначе
		
		// черновик                                                       
		Элементы.ФормаЗаписатьЧерновик.Видимость = ЭтоМойЧерновик и не ЭтоДоклад;
		Элементы.ФормаЗаписатьЗакрыть.Видимость = Объект.Отправлена И не Выполнена;
		
		НоваяОтправка = ТекПользователь = Объект.Автор И (не Объект.Отправлена или ЗРСП) и не Выполнена;
		Элементы.Отправить.Видимость = НоваяОтправка;
		Элементы.ОтправитьПоКомлиниям.Видимость = НоваяОтправка;
		
		// Выполнить
		Элементы.Выполнено.Видимость = не ЗапретитьВыполнение и не ЗРСП;   
		Если Объект.ЭтоЗРС Тогда // по зрс другая схема - одобрено или уже в архив
			Если (ВозвратАторуВыполненнойЗадачи ИЛИ ОтклонениеЗРС ИЛИ не Объект.ПоКомлиниям) И ТекПользователь = Объект.Автор Тогда  // ЗРС вернулась автору
				Элементы.Выполнено.Заголовок = "В архив";
			Иначе
				Элементы.Выполнено.Заголовок = "Одобрено";
			КонецЕсли;
		ИначеЕсли СерединаКоманднойЛинии Тогда // если задача идет по маршруту и это не автор и не конечный исполнитель 
			Элементы.Выполнено.Заголовок = "Всё верно";
		ИначеЕсли ТекПользователь = Объект.Автор Тогда
			Элементы.Выполнено.Заголовок = "Принять";
		КонецЕсли;
		
		Если Объект.ОтказЗадачи Тогда
			Элементы.Выполнено.Заголовок = "В архив";
		ИначеЕсли ЭтоДоклад Тогда
			Если ЗначениеЗаполнено(Объект.Исполнитель) Тогда
				Элементы.Выполнено.Заголовок = "В архив";
			Иначе
				Элементы.Выполнено.Заголовок = "Подтверждено";
			КонецЕсли;
		КонецЕсли;
		
		
		// На доработку
		Элементы.ВернутьНаДоработку.Видимость = (не Выполнена) И (не ЭтоНовый) И МояЗадача
		И (    Объект.Пользователь = Объект.Автор или (ТекПользователь = ОБъект.Пользователь и ОБъект.Пользователь<>Объект.Исполнитель) или ВозвратАторуВыполненнойЗадачи ) 
		И (не Объект.Исполнитель.Пустая()) и не Объект.ЭтоЗРС и не ЭтоДоклад;
		
		// ЗРСП
		Элементы.ЗРСП.Видимость = Объект.ЭтоЗРС И (не Объект.Выполнена) И (не ЭтоНовый) И МояЗадача и ТекПользователь <> Объект.Автор;
		
		// В РАБОТЕ
		Элементы.ВРаботе.Видимость = (не Выполнена) И (не Объект.Отложена) И (не ЭтоНовый) И Объект.Пользователь = ТекПользователь И Объект.Отправлена;
		
		// Удалить
		Элементы.УдалитьЗадачу.Видимость = Объект.Автор = ТекПользователь и не ЭтоНовый и не Выполнена и не ЭтоДоклад;
		
		// Отказаться
		Элементы.Отказаться.Видимость = МояЗадача и не Выполнена И ТекПользователь <> Объект.Автор И Объект.Отправлена;
		Если Объект.ЭтоЗРС Тогда
			Элементы.Отказаться.Заголовок = "Не одобрено";
		ИначеЕсли СерединаКоманднойЛинии Тогда // если задача идет по маршруту и это не автор и не конечный исполнитель 
			Элементы.Отказаться.Заголовок = "Отклонено";
		ИначеЕсли ЭтоДоклад Тогда
			Элементы.Отказаться.Заголовок = "Отклонено";
		КонецЕсли;
		
		Элементы.ВзятьВРаботу.Видимость = Объект.Пользователь.Пустая() и (не Выполнена) И (не ЭтоНовый) И ТекПользователь <> Объект.Автор и МояЗадача;
		Элементы.ПередатьДругомуСотруднику.Видимость = (не Выполнена) И (не ЭтоНовый) И Объект.Пользователь = ТекПользователь и не Объект.ЭтоЗРС И Объект.Отправлена и не ЭтоДоклад;
		Элементы.ОткрытьЗадачуСУ.Видимость = ЭтоДоклад;	
	КонецЕсли;
	
	Элементы.СписокПользователей.Видимость = (ЭтоПослание или ЭтоЗадача) и ЭтоНовый;
	
	СделатьКнопкуОсновной();
КонецПроцедуры

&НаСервере
Процедура СделатьКнопкуОсновной()
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП_Главная);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	
	// проверка даты исполнения
	// в новой задачи даты еше нет, сравниваем с текущей датой
	Если ЗначениеЗаполнено(Объект.СрокИсполнения) И (Объект.СрокИсполнения<=?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата())) Тогда
		Сообщить("Срок исполнения не может быть раньше, чем дата создания задачи.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Объект.Наименование = "" Тогда
		Сообщить("Укажите наименование!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	// оба реквизита ПОСТ и ПОЛЬЗОВТЕЛЬ не могу быть пустыми
	Если Объект.Пост.Пустая() Тогда
		
		Если ВводСпискаИсполнителей И СписокИсполнителей.Количество()=0 Тогда
			Сообщить("Пост и список сотрудников не могут быть одновременно пустыми. Укажите пост и/или список сотрудников.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
		Если НЕ ВводСпискаИсполнителей И Объект.Пользователь.Пустая() Тогда
			Сообщить("Пост и сотрудник не могут быть одновременно пустыми. Укажите пост и/или сотрудника.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяем заполнен ли пост и есть ли у него сотрудники, 
// если сотрудников нет, то по иерархии поднимаемся до ближайшего
// поста с сотрудниками и заменяем текущий пост на заполненный
// 
&НаКлиенте
Процедура ПроверкаПоста()
	
	// проверяем заполнен ли пост и есть ли у него родитель, если что
	Если ЗначениеЗаполнено(Объект.Пост) Тогда
		//
		//КоличествоСотрудников = ПолучитьКоличествоСотрНаПосту(Объект.Пост);
		КоличествоСотрудников = ПолучитьКоличествоПользователейНаПосту(Объект.Пост);
		Родитель = ИА_КСУОбщийСервер.ПолучитьЗначениеРеквизита(Объект.Пост, "Родитель");
		
		Если КоличествоСотрудников = 0 И ЗначениеЗаполнено(Родитель) Тогда
			Объект.Пост = ПолучитьЗанятыйПост(Объект.Пост);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры // ПроверкаПоста()

&НаСервереБезКонтекста
Функция ПолучитьКоличествоПользователейНаПосту(пПост)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОргСхемаСотрудники.ФизЛицо,
		|	ИА_ДанныеФизЛиц.Пользователь
		|ПОМЕСТИТЬ ВТПостыДанныеФизлиц
		|ИЗ
		|	Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
		|		ПО ОргСхемаСотрудники.ФизЛицо = ИА_ДанныеФизЛиц.ФизЛицо
		|ГДЕ
		|	ОргСхемаСотрудники.Ссылка = &Пост
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПостыДанныеФизлиц.ФизЛицо,
		|	ВТПостыДанныеФизлиц.Пользователь
		|ИЗ
		|	ВТПостыДанныеФизлиц КАК ВТПостыДанныеФизлиц
		|ГДЕ
		|	ВТПостыДанныеФизлиц.Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И НЕ ВТПостыДанныеФизлиц.Пользователь ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПостыДанныеФизлиц.ФизЛицо,
		|	ВТПостыДанныеФизлиц.Пользователь";
			
	Запрос.УстановитьПараметр("Пост", пПост);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗанятыйПост(Пост)
	
	ТекПост = Пост;
	Пока Истина Цикл //поднимаемся вверх до поста, который будет заполнен или до упора
		Если ПолучитьКоличествоПользователейНаПосту(ТекПост) = 0 И
			ЗначениеЗаполнено(ТекПост.Родитель) Тогда
			ТекПост = ТекПост.Родитель;
		Иначе  // останавливаемся как только пост заполнен 
			Сообщить("Пост изменен на вышестоящий занятый по иерархии", СтатусСообщения.Информация);
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ТекПост;
	
КонецФункции

&НаСервере
Функция  НапечататьДокумент()
	
	Если ЭтоЗРС Тогда
		ТабДок = РеквизитФормыВЗначение("Объект").ПечатьЗРС();
	ИначеЕсли  ЭтоЗадача Тогда
		ТабДок = РеквизитФормыВЗначение("Объект").ПечатьЗадачи();
	Иначе
		ТабДок = РеквизитФормыВЗначение("Объект").ПечатьПослания();
	КонецЕсли;
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ОтправитьПоКомлиниямНаСервере()
	
	Возврат ИА_ОбщиеПроцедурыКЦиОргсхема.ОтправитьЗадачуПоКомлиниям(Объект);
	
КонецФункции

&НаСервере
Процедура ЗадачаВыполнитьНаСервере()
	
	ОбъектЗадачи = РеквизитФормыВЗначение("Объект");
	ИА_Защита_КЦ.ЗадачаВыполнитьНаСервере(ТекПользователь, ОбъектЗадачи);
	ЗначениеВРеквизитФормы(ОбъектЗадачи,"Объект");
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьЗадачу(Команда)
	
	Если СокрЛП(объект.Наименование) = "" Тогда
		Сообщить("Заполните тему!");
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ПроверкаПоста();
	
	ПроверитьЗаполнениеРеквизитов(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Отправлена = Истина;
	
	Если Объект.ЗРСП и Объект.Маршрут.Количество()>1 Тогда // отправим опять по маршруту
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтправитьЗадачуЗавершение", ЭтотОбъект), "ЗРС будет отправлена по командной линии на пост: "+ Объект.Маршрут[1].Пост + ". Продолжить?", РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	ОтправитьЗадачуФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗадачуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		Объект.Маршрут[0].ВсеВерно = истина;
		Объект.Маршрут[0].ДатаПодтверждения = ТекущаяДата();
		
		сч = 1;
		СледующийПост = Объект.Маршрут[1].Пост;				
		ПостНайден = ложь;
		Пока сч < Объект.Маршрут.Количество() Цикл
			Если ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПользовательНаПосту(ТекПользователь, Объект.Маршрут[сч].Пост) И не Объект.Маршрут[сч].ВсеВерно Тогда
				Объект.Маршрут[сч].ВсеВерно = Истина;
				Объект.Маршрут[сч].ДатаПодтверждения = ТекущаяДата();
			Иначе
				СледующийПост = Объект.Маршрут[сч].Пост; 
				ПостНайден = истина;
				Прервать;
			КонецЕсли;
			сч = сч + 1;
		КонецЦикла;
		
		Объект.Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		Если ПостНайден тогда
			Объект.Пост = СледующийПост; 
		Иначе
			Объект.Пост = Объект.Маршрут[0].Пост; 
		КонецЕсли;
	Иначе
		возврат;
	КонецЕсли;
	
	ОтправитьЗадачуФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗадачуФрагмент()
	
	Если ЗначениеЗаполнено(Объект.ИсполнительЗРС) Тогда // возврат зрс
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтправитьЗадачуФрагментЗавершение", ЭтотОбъект), "ЗРС будет отправлена пользователю: "+ Объект.ИсполнительЗРС + ". Продолжить?", РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	
	ОтправитьЗадачуФрагментФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗадачуФрагментЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		Объект.Пользователь = Объект.ИсполнительЗРС;
		Объект.Пост = ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка");
		Объект.ИсполнительЗРС = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	Иначе
		возврат;
	КонецЕсли;
	
	ОтправитьЗадачуФрагментФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗадачуФрагментФрагмент()
	
	Объект.ЗРСП = Ложь;
	Объект.ОтказЗадачи = Ложь;
	
	Записать();
	
	ПроверитьИсоздатьЗадачиПоСписку();
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоКомлиниям(Команда)
	
	Если СокрЛП(объект.Наименование) = "" Тогда
		Сообщить("Заполните тему!");
		Возврат;
	КонецЕсли;
	
	ПроверкаПоста();
	
	Если ОтправитьПоКомлиниямНаСервере() Тогда
		Объект.Отправлена = Истина;
		Объект.ЗРСП = Ложь;
		Записать();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выполненно(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполненноЗавершение", ЭтотОбъект), "Вы уверены?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВыполненноЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		Если Не Объект.ЭтоЗРС и Не СерединаКоманднойЛинии и Не ЭтоДоклад и СокрЛП(Объект.ДокладОбИсполнении) = "" и Не Объект.ОтказЗадачи Тогда 
			Сообщить("Должен быть заполнен доклад об исполнении!");
			Возврат;
		КонецЕсли;
		
		Если Модифицированность Тогда
			ЭтаФорма.Записать();
		КонецЕсли; 
		ЗадачаВыполнитьНаСервере();
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отказаться(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтказатьсяЗавершение1", ЭтотОбъект), "Вы уверены?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьсяЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		
		Если Объект.ЭтоЗРС Тогда
			ЗаголовокФ = "Введите причину отклонения ЗРС";
		Иначе
			ЗаголовокФ = "Введите причину отказа";
		КонецЕсли;
		Парам = новый Структура("Заголовок", ЗаголовокФ);
		ОткрытьФорму("ОбщаяФорма.ИА_ФормаРедактированияСтрокиУправляемая", Парам,,,,, Новый ОписаниеОповещения("ОтказатьсяЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКоммент(Комментарий, получатель = Неопределено) Экспорт
	Если Взаимодействия1с Тогда
		пол = получатель;
		Если пол = ТекПользователь тогда
			пол = Неопределено;
		КонецЕсли;
		ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ДобавитьЗаписьВЗадачу(объект.ссылка,Комментарий,пол);
	Иначе
		Новстр = Объект.ХодВыполнения.Вставить(0);
		Новстр.Дата = ТекущаяДата();
		Новстр.Комментарий = Комментарий;
		Новстр.Пользователь = ТекПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьсяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	рез = Результат;
	
	ОтказДобавлен = Ложь;
	Если Результат<>Неопределено Тогда
		зн = Результат;
		Если СОКРЛП(зн)<>"" Тогда			
			ДобавитьКоммент(СОКРЛП(зн));					
			ОтказДобавлен = истина;
		КонецЕсли;
	КонецЕсли; 
	
	Если не ОтказДобавлен Тогда
		ПоказатьПредупреждение(,"Необходимо указать причину отказа!");
		возврат;
	КонецЕсли;
	
	
	Если Объект.ЭтоЗРС Тогда
		Комментарий = "ЗРС не одобрена";
	Иначе
		Комментарий = "Исполнитель отказался от задачи";
	КонецЕсли;
	ДобавитьКоммент(Комментарий);
	
	КолМарш = Объект.МаршрутПередачи.Количество();
	Если КолМарш > 0 Тогда
		СтрокаМаршрута = Объект.МаршрутПередачи[КолМарш-1];
		Объект.Пользователь = СтрокаМаршрута.Пользователь;	
		Объект.МаршрутПередачи.Удалить(СтрокаМаршрута);
	Иначе
		Объект.Пользователь = Объект.Автор;
	КонецЕсли;
	
	Объект.Отложена = Ложь;
	Объект.Пост = ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка");
	
	Если Объект.ЭтоЗРС Тогда
		Объект.ОтклонениеЗРС = истина;
		Объект.ИсполнительОтказЗРС = ТекПользователь;
	Иначе
		Объект.ОтказЗадачи = истина;
	КонецЕсли;
	
	Если ЭтоДоклад Тогда
		Объект.Наименование = "[Отклонено] " + Объект.Наименование;
		Объект.Содержание = Объект.Содержание + Символы.ПС + ТекПользователь + " отлонил доклад " + ТекущаяДата() + ":" + Символы.ПС +  СОКРЛП(зн);
	КонецЕсли;
	
	Записать();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДоработку(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВернутьНаДоработкуЗавершение1", ЭтотОбъект), "Вы уверены?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДоработкуЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда	
		
		Если Объект.ПоКомлиниям Тогда
			
			Объект.Маршрут[Объект.Маршрут.Количество()-1].ВсеВерно = Ложь;
			Объект.Маршрут[Объект.Маршрут.Количество()-1].ДатаПодтверждения = Дата(1,1,1);
			
			Объект.Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
			Объект.Пост = Объект.Маршрут[Объект.Маршрут.Количество()-1].Пост;
			Объект.Отложена = Ложь;
			Объект.ДатаВыполнения = Дата(1,1,1);
			Объект.Исполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		Иначе
			Объект.Пользователь = Объект.Исполнитель;
			Объект.Пост = ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка");
			Объект.Отложена = Ложь;
			Объект.ДатаВыполнения = Дата(1,1,1);
			Объект.Исполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		КонецЕсли;
		
		
		Парам = новый Структура("Заголовок", "Введите причину");
		ОткрытьФорму("ОбщаяФорма.ИА_ФормаРедактированияСтрокиУправляемая", Парам,,,,, Новый ОписаниеОповещения("ВернутьНаДоработкуЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДоработкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено или СокрЛП(Результат)= "" Тогда
		Возврат;
	КонецЕсли;
	
	зн = СОКРЛП(Результат);
	
	Комментарий = "Возвращено на доработку" + ?(зн = "", "", ": " + зн);
	ДобавитьКоммент(Комментарий);
	
	ИА_Защита_КЦ.ВключитьНапоминание(ТекПользователь, Объект.Ссылка);
	
	
	Объект.Отложена = Ложь;
	Объект.ДатаВыполнения = Дата(1,1,1);
	
	Если ТекПользователь <> Объект.Автор и не Объект.ПоКомлиниям Тогда // маршрут передачи
		Новстр = Объект.МаршрутПередачи.Добавить();
		Новстр.Пользователь = ТекПользователь;
	КонецЕсли;
	
	Записать();	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ЗРСП(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗРСПЗавершение1", ЭтотОбъект), "Вы уверены?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗРСПЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда	
		Парам = новый Структура("Заголовок", "Введите данные (поле должно быть заполнено)");
		
		ОткрытьФорму("ОбщаяФорма.ИА_ФормаРедактированияСтрокиУправляемая", Парам,,,,, Новый ОписаниеОповещения("ЗРСПЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗРСПЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено или СокрЛП(Результат)= "" Тогда
		Возврат;
	КонецЕсли;
	
	зн = СОКРЛП(Результат); 	
	
	Если не Объект.ПоКомлиниям Тогда // запомним исполнителя ЗРС
		Объект.ИсполнительЗРС = ТекПользователь;
	КонецЕсли;
	
	Объект.Пользователь = Объект.Автор;
	Объект.Пост = ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка");
	Объект.Отложена = Ложь;
	
	Для каждого стр из Объект.Маршрут Цикл
		стр.ВсеВерно = Ложь;
		стр.ДатаПодтверждения = Дата(1,1,1);
	КонецЦикла;
	
	Комментарий = "Требуется уточнение: "+ зн;
	ДобавитьКоммент(Комментарий);
	
	ИА_Защита_КЦ.ВключитьНапоминание(ТекПользователь, Объект.Ссылка);
	
	Объект.ЗРСП = Истина;
	
	Записать();	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВРаботе(Команда)
	
	Комментарий = "В работе";
	ДобавитьКоммент(Комментарий, Объект.Автор);
	
	Объект.Отложена = Истина;
	Записать();
	
	Если ТекПользователь <>  Объект.Автор Тогда
		ИА_ОбщиеПроцедуры_Технология_КоммЦентр.СоздатьУведомление(Объект.Ссылка, Объект.Автор, ПредопределенноеЗначение("Перечисление.ИА_ВидСобытия.ВРаботе"), "Задача взята в работу");
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗадачу(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьЗадачуЗавершение", ЭтотОбъект), "Вы уверены?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗадачуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да тогда
		Объект.ПометкаУдаления = истина;
		Если Записать() Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВзятьВРаботу(Команда)
	
	Если Объект.ПоКомлиниям И не ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПользовательНаПосту(ТекПользователь, Объект.Пост) тогда
		ПоказатьПредупреждение(,"Вы не занимаете пост " + Объект.Пост+"! Вы не можете взять эту задачу.");
		Возврат;
	КонецЕсли;
	
	Комментарий = "Задача взята пользователем";	
	ДобавитьКоммент(Комментарий);
	
	Объект.Пользователь = ТекПользователь;
	Если не Объект.ПоКомлиниям Тогда
		Объект.Пост = ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка");
	КонецЕсли;
	
	Записать();
	ОбновитьВидимостьКнопок();
	ОбновитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьДругомуСотруднику(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПередатьДругомуСотрудникуЗавершение", ЭтотОбъект), "Вы уверены?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьДругомуСотрудникуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		польз = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		ПоказатьВводЗначения(Новый ОписаниеОповещения("ПередатьДругомуСотрудникуЗавершениеЗавершение", ЭтотОбъект, Новый Структура("польз", польз)), польз, "Кому передать задачу?");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередатьДругомуСотрудникуЗавершениеЗавершение(Значение, ДополнительныеПараметры1) Экспорт
	
	польз = ?(Значение = Неопределено, ДополнительныеПараметры1.польз, Значение);
	
	
	Если (Значение <> Неопределено) Тогда
		Если ЗначениеЗаполнено(польз) Тогда
			
			// если отказались от задачи, то можно пустить другому исполнителю вне комлиний
			Если Объект.ПоКомлиниям и Объект.ОтказЗадачи и ТекПользователь = Объект.Автор Тогда
				Объект.ПоКомлиниям = ложь;
			КонецЕсли;	
			
			Если Объект.ПоКомлиниям Тогда
				Если не ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПользовательНаПосту(польз, Объект.Пост) тогда
					ПоказатьПредупреждение(,"Выбранный пользователь не занимает пост " + Объект.Пост+"! Это недопустимо при работе с ЗРС.");
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			// при передаче задачи, пишем кто передал и на кого
			Комментарий = "Задачу передал " + ТекПользователь + " на " + польз;
			Если Объект.ДокладОбИсполнении<>"" Тогда
				Комментарий = Комментарий + Символы.ПС + "Предыдущий доклад: "+ Объект.ДокладОбИсполнении;
				Объект.ДокладОбИсполнении = "";
			КонецЕсли;
			ДобавитьКоммент(Комментарий, Объект.Автор);
			
			// сбросить "в работе" при передаче задачи
			Объект.Отложена = Ложь;
			
			// уведомления
			Если ТекПользователь <>  Объект.Автор Тогда
				ИА_ОбщиеПроцедуры_Технология_КоммЦентр.СоздатьУведомление(Объект.Ссылка, Объект.Автор, ПредопределенноеЗначение("Перечисление.ИА_ВидСобытия.ПереданаДругомуИсполнителю"), "Задача """+Объект.Наименование+""" передана на: "+ польз);
			КонецЕсли;
			Для каждого стр из объект.МаршрутПередачи Цикл
				Если ТекПользователь <>  стр.Пользователь Тогда
					ИА_ОбщиеПроцедуры_Технология_КоммЦентр.СоздатьУведомление(Объект.Ссылка, стр.Пользователь, ПредопределенноеЗначение("Перечисление.ИА_ВидСобытия.ПереданаДругомуИсполнителю"), "Задача """+Объект.Наименование+""" передана на: "+ польз);
				КонецЕсли;
			КонецЦикла;
			
			// Маршрут передачи
			Если не Объект.ПоКомлиниям Тогда
				// если он уже есть в маршруте, то удалим его. Еще раз проходить через него не надо
				Отбор = новый Структура("Пользователь", Объект.Пользователь);
				стрРез = объект.МаршрутПередачи.НайтиСтроки(Отбор);
				Если стрРез.Количество()>0 Тогда
					объект.МаршрутПередачи.Удалить(стрРез[0]);	
				КонецЕсли;
				
				// если ранее передавали на него, то еще раз уведомлять не надо
				Отбор = новый Структура("Пользователь", польз);
				стрРез = объект.МаршрутПередачи.НайтиСтроки(Отбор);
				Если стрРез.Количество()>0 Тогда
					объект.МаршрутПередачи.Удалить(стрРез[0]);	
				КонецЕсли;
				
				Если Объект.Пользователь <> Объект.Автор Тогда
					Новстр = объект.МаршрутПередачи.Добавить();
					Новстр.Пользователь = Объект.Пользователь;
				КонецЕсли;
			КонецЕсли;
			
			Объект.ОтказЗадачи = Ложь;
			Объект.ОтклонениеЗРС = Ложь;
			
			Объект.Пост = ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка");
			Объект.Пользователь = польз;
			Записать();
			Закрыть();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИсоздатьЗадачиПоСписку()
	Если ВводСпискаИсполнителей Тогда
		
		КолИсп = СписокИсполнителей.Количество();
	    Для н=1 По СписокИсполнителей.Количество() Цикл 
	        
	        Если н=1 Тогда 
	            Продолжить; 
	        КонецЕсли;
	        
	        Исполнитель = СписокИсполнителей.Получить(н-1);
	        СоздатьЗадачуПоСпискуИсполнителей(Исполнитель.Значение);				        
	    КонецЦикла;
	    	  
	    СписокИсполнителей.Очистить();
	    
	    ВводСпискаИсполнителей = Ложь;
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
    
    Отказ = Ложь;
    
    ПроверитьЗаполнениеРеквизитов(Отказ);
    
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
    
    Объект.Отправлена = Истина;
    
    Записать();
	
	ПроверитьИсоздатьЗадачиПоСписку();
	
    Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура Прочитано(Команда)
    
    ПоказатьВопрос(Новый ОписаниеОповещения("ПрочитаноЗавершение", ЭтотОбъект), "Вы уверены?",РежимДиалогаВопрос.ДаНет);
    
КонецПроцедуры

&НаКлиенте
Процедура ПрочитаноЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		Комментарий = "Послание прочитано";
		ДобавитьКоммент(Комментарий,Объект.Автор);
		
		ВыполнитьДаннуюЗадачу();
		
		Если ТекПользователь <>  Объект.Автор Тогда
			ИА_ОбщиеПроцедуры_Технология_КоммЦентр.СоздатьУведомление(Объект.Ссылка, Объект.Автор, ПредопределенноеЗначение("Перечисление.ИА_ВидСобытия.ПосланиеПрочитано"), "Прочитано послание: "+ Объект.Наименование);
		КонецЕсли;
		
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьДаннуюЗадачу()
    
    ОбъектЗадачи = РеквизитФормыВЗначение("Объект");
	Если не ЗначениеЗаполнено(ОбъектЗадачи.Исполнитель) Тогда
		ОбъектЗадачи.Исполнитель = ТекПользователь;
	КонецЕсли;
    ОбъектЗадачи.ВыполнитьЗадачу();
    ЗначениеВРеквизитФормы(ОбъектЗадачи,"Объект");
    
КонецПроцедуры	


&НаКлиенте
Процедура Ответить(Команда)
	
	Парам = новый Структура("Заголовок", "Введите ответ (поле должно быть заполнено)");

	ОткрытьФорму("ОбщаяФорма.ИА_ФормаРедактированияСтрокиУправляемая", Парам,,,,, Новый ОписаниеОповещения("ОтветитьЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 

КонецПроцедуры

&НаКлиенте
Процедура ОтветитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено или СокрЛП(Результат)= "" Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОтвета = Результат;
	
	Если не ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		Объект.Исполнитель = ТекПользователь;
	КонецЕсли;
	
	// формирование текст
	ТекТекст = ОБъект.Содержание;
	
	Если не Объект.ЭтоПереписка Тогда // первый ответ
		ТекТекст = Символы.ПС + "   " + Объект.Дата + " " + Объект.Автор + ":" + Символы.ПС + ТекТекст;
	КонецЕсли;
	ТекТекст = Строка(ТекущаяДата()) + " " + ТекПользователь + ":" + Символы.ПС + ТекстОтвета + Символы.ПС + ТекТекст;
	
	Объект.Содержание = ТекТекст;
	
	//
	Объект.ЭтоПереписка = истина;
	Объект.Пост = ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка");
	
	Если ТекПользователь = Объект.Автор Тогда
		Объект.Пользователь = Объект.Исполнитель;
	Иначе
		Объект.Пользователь = Объект.Автор;
	КонецЕсли;
	
	ЭтоОтвет = Истина;
	
	Записать();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект), "Перед печатью необходимо записать задачу. Продолжить?", РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	ПечатьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		Записать();
	Иначе
		возврат;
	КонецЕсли;
	
	ПечатьФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ПечатьФрагмент()
	
	Перем ТабДок;
	
	ТабДок = НапечататьДокумент();
	ТабДок.АвтоМасштаб = истина;
	ТабДок.Показать();

КонецПроцедуры

&НаКлиенте
Процедура СправкаПоЗадаче(Команда)
	
	Если ЭтоЗРС Тогда
		ФормаСправки = ПолучитьФорму("Задача.ИА_ЗадачаПланаДействий.Форма.ФормаСправки", Новый Структура("ТипСправки","СправкаЗРС"));
	ИначеЕсли ЭтоЗадача Тогда
		ФормаСправки = ПолучитьФорму("Задача.ИА_ЗадачаПланаДействий.Форма.ФормаСправки", Новый Структура("ТипСправки","СправкаЗадачи"));
	Иначе
		ФормаСправки = ПолучитьФорму("Задача.ИА_ЗадачаПланаДействий.Форма.ФормаСправки", Новый Структура("ТипСправки","СправкаПослания"));
	КонецЕсли;
	
	ФормаСправки.Открыть();
	
КонецПроцедуры

&НаСервере 
Процедура СформироватьЛенту() Экспорт
	//
	ЦветФонаЭл = Элементы.НовыйКоммент.ЦветФона;
	// очистка
	сч = 1;
	удРекв = Новый Массив;
	Пока Элементы.ГруппаЛента.ПодчиненныеЭлементы.Количество() >0 Цикл
		Элементы.Удалить(Элементы.ГруппаЛента.ПодчиненныеЭлементы.Получить(0));
		
		удРекв.Добавить("ФотоКоммент"+сч);
		удРекв.Добавить("КомментТекст_"+сч);
		сч = сч + 1;
	КонецЦикла;
	ИзменитьРеквизиты(,удРекв);
	
	//
	ТекНомер = 1;
	тз = Объект.ХодВыполнения.Выгрузить();
	тз.Сортировать("Дата УБЫВ");
	//
	Для каждого стр из тз Цикл
		// реквизит
		ИмяРеквЭл = "КомментТекст_"+ТекНомер;
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквЭл, Новый ОписаниеТипов("Строка")));
		ИзменитьРеквизиты(МассивРеквизитов);
		ЭтаФорма[ИмяРеквЭл]= стр.Комментарий;
		
		// элементы
		
		ГруппаКоммент = ДобавитьГруппуИФото(ТекНомер, стр.Пользователь);				
		
		фДатаЮзер = Новый ФорматированнаяСтрока(Формат(стр.Дата,"ДФ='dd.MM.yy HH:mm'") +"    "+ стр.Пользователь,Новый Шрифт("Calibri", 10,истина,истина), Новый Цвет(85,85,85));
		НовыйЭлементКомментЮзер = Элементы.Добавить("КомментСтрЮзер"+ТекНомер, Тип("ДекорацияФормы"), ГруппаКоммент);
		НовыйЭлементКомментЮзер.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлементКомментЮзер.РастягиватьПоГоризонтали = Истина;
		НовыйЭлементКомментЮзер.АвтоМаксимальнаяВысота = ложь;
		НовыйЭлементКомментЮзер.Заголовок = фДатаЮзер;
		НовыйЭлементКомментЮзер.РастягиватьПоВертикали = ложь;
		НовыйЭлементКомментЮзер.Высота = 1;
		//НовыйЭлементКомментЮзер.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная,1); 
		
		НовыйЭлементКоммент = Элементы.Добавить("КомментСтр"+ТекНомер, Тип("ПолеФормы"), ГруппаКоммент);
		НовыйЭлементКоммент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлементКоммент.путьКДанным = ИмяРеквЭл;
		НовыйЭлементКоммент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлементКоммент.многострочныйРежим = истина;
		НовыйЭлементКоммент.Шрифт = Новый Шрифт("Calibri",11,истина);
		НовыйЭлементКоммент.ЦветФона = ЦветФонаЭл;
		НовыйЭлементКоммент.ЦветРамки = ЦветФонаЭл;
		НовыйЭлементКоммент.ТолькоПросмотр = истина;
		
		НовыйЭлементКоммент.АвтоМаксимальнаяВысота = ложь;
		НовыйЭлементКоммент.РастягиватьПоВертикали = ложь;
		НовыйЭлементКоммент.Высота = 3;
		
		//
		ТекНомер = ТекНомер + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ДобавитьГруппуИФото(ТекИндекс, Пользователь)
	ГруппаКоммент = Элементы.Добавить("Коммент"+ТекИндекс, Тип("ГруппаФормы"), Элементы.ГруппаЛента);
	ГруппаКоммент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКоммент.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКоммент.ОтображатьЗаголовок = Ложь;
	ГруппаКоммент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаКоммент.РастягиватьПоГоризонтали = Истина;
	
	//
	ИмяРеквЭл = "ФотоКоммент"+ТекИндекс;
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквЭл, Новый ОписаниеТипов("Строка")));
	ИзменитьРеквизиты(МассивРеквизитов);
	Фото = РегистрыСведений.ИА_ДанныеФизЛиц.ПолучитьФотоПользователя(Пользователь,"Аватар");
	ЭтаФорма[ИмяРеквЭл] = ПоместитьВоВременноеХранилище(Фото, Новый УникальныйИдентификатор); 		
	
	НовыйЭлементФото = Элементы.Добавить(ИмяРеквЭл, Тип("ПолеФормы"), ГруппаКоммент);
	ЗаполнитьЗначенияСвойств(НовыйЭлементФото, Элементы.ФотоАвтора,,"ПутьКДанным,Родитель");
	НовыйЭлементФото.ПутьКДанным = ИмяРеквЭл;
	НовыйЭлементФото.Ширина = 6;
	НовыйЭлементФото.Высота = 2;

	ГруппаКомментПрав = Элементы.Добавить("КомментПрав"+ТекИндекс, Тип("ГруппаФормы"), ГруппаКоммент);
	ГруппаКомментПрав.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомментПрав.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКомментПрав.ОтображатьЗаголовок = Ложь;
	ГруппаКомментПрав.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаКомментПрав.РастягиватьПоГоризонтали = Истина;
	
	Возврат ГруппаКомментПрав;
КонецФункции

&НаКлиенте 
Процедура ОбновитьВидимостьДоступностьЭлементов()
	// общие настройки
	Если ЭтоЗРС Тогда
		Элементы.СтраницыРежим.ТекущаяСтраница = Элементы.ЗРС;
	ИначеЕсли ЭтоПослание Тогда
		Элементы.СтраницыРежим.ТекущаяСтраница = Элементы.Послание;
	ИначеЕсли ЭтоЗадача Тогда
		Элементы.СтраницыРежим.ТекущаяСтраница = Элементы.Задача;
	КонецЕсли;
	
	Элементы.ГруппаСрок.Видимость =  ЭтоЗадача;
	Элементы.ГруппаДокладОбИсполнении.Видимость = Объект.Отправлена;
	
	// видимость ленты
	СкрытьЛенту = ИА_НастройкиСПИ.ЗначениеНастройки(ТекПользователь, ПредопределенноеЗначение("ПланВидовХарактеристик.ИА_НастройкиПользователей.СкрытьХодВыполнения"));
	Если ЭтоПослание или СкрытьЛенту или ЭтоДоклад или ЭтоНовый или Взаимодействия1с Тогда 
		Элементы.ГруппаЗаголовокЛенты.Видимость = Ложь;
		Элементы.ГруппаЛента.Видимость = Ложь;
		Элементы.ДобавитьКомментарий.Видимость = Ложь;
	КонецЕсли;
	Элементы.ГруппаКомЛинии.Видимость = Объект.Маршрут.Количество()>0;
	
	Если Объект.ПометкаУдаления Тогда
		ЭтаФорма.ТолькоПросмотр = истина;
		ЭтаФорма.КоманднаяПанель.Видимость = ложь;
		возврат;
	КонецЕсли;
	МожноРедакт = (не Объект.Отправлена) И ОБъект.Автор = ТекПользователь;
	///
	Элементы.Наименование.ТолькоПросмотр = не МожноРедакт;
	Ред_ПостАвтора = МожноРедакт;  
	Ред_Пользователь = МожноРедакт или ЭтоАдмин;
	Ред_Пост = МожноРедакт или ЭтоАдмин;	
	Ред_Срок = МожноРедакт;
	
	Элементы.ГруппаКП_Подзадачи.Видимость = МожноРедакт;
	Элементы.ПодзадачиЗадача.ТолькоПросмотр = не МожноРедакт;
	Элементы.ПодзадачиПользователь.ТолькоПросмотр = не МожноРедакт;
	
	Элементы.Содержание.ТолькоПросмотр = не МожноРедакт;
	Элементы.Содержание1.ТолькоПросмотр = не МожноРедакт;
	
	Элементы.УточнитьЗадачу.Видимость = ЭтоЗадача и не МожноРедакт;
	
	Элементы.Ситуация.ТолькоПросмотр = не МожноРедакт И не Объект.ЗРСП;
	Элементы.Данные.ТолькоПросмотр = не МожноРедакт И не Объект.ЗРСП;;
	Элементы.Решение.ТолькоПросмотр = не МожноРедакт И не Объект.ЗРСП;;
	
	Элементы.ПрикрепленныйОбъектКонтекстноеМенюОчиститьПрикрепленныйОбъект.Видимость = МожноРедакт;
	
	Элементы.ДокладОбИсполнении.ТолькоПросмотр = не (Объект.Автор = ТекПользователь ИЛИ МояЗадача);
	
	Если ЭтоДоклад Тогда
		Элементы.ГруппаСрок.Видимость = ложь;
		Элементы.Наименование.ТолькоПросмотр = истина;
		Элементы.ГруппаДокладОбИсполнении.Видимость = ложь;
	КонецЕсли;
	
	Если Объект.ЭтоКоррекцияСУ ТОгда
		Элементы.Решение.ТолькоПросмотр = истина;
		Ред_Пользователь = ложь;
		Ред_Пост = ложь;	
		Элементы.Наименование.ТолькоПросмотр = истина;
		Элементы.ОтправитьПоКомлиниям.Видимость = ложь;
	КонецЕсли;

	Элементы.ГруппаПодзадачи.Видимость = МожноРедакт или Объект.Подзадачи.Количество()>0;
	Если (не МожноРедакт) и Объект.Подзадачи.Количество()>0 Тогда
		Элементы.ГруппаПодзадачи.Показать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	Элементы.ГруппаНовыйКоммент.Видимость = истина;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	СформироватьЛенту();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НовыйКоммент <> "" Тогда
		Новстр = ТекущийОбъект.ХодВыполнения.Добавить();
		Новстр.Дата = ТекущаяДата();
		Новстр.Пользователь = ТекПользователь;
		Новстр.Комментарий = НовыйКоммент;
		Новстр.ЭтоКомментарий = Истина;
		
		Элементы.ГруппаНовыйКоммент.Видимость = Ложь;
		//
		Если ТекПользователь <>  Объект.Автор Тогда
			ИА_ОбщиеПроцедуры_Технология_КоммЦентр.СоздатьУведомление(Объект.Ссылка, Объект.Автор, ПредопределенноеЗначение("Перечисление.ИА_ВидСобытия.НовыйКомментарий"), НовыйКоммент);
		КонецЕсли;
		
		НовыйКоммент = "";

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Парам = Новый Структура("Ссылка,ВладелецФормы,ПоКомлиниям,Пост");
	ЗаполнитьЗначенияСвойств(Парам,Объект);
	Парам.ВладелецФормы = ВладелецФормы;
	
	Оповестить("ЗакрытиеЗадачиБП",Парам);
	Если ИА_БФКС.РеквизитЕсть(Объект, "БизнесПроцесс") Тогда
		Оповестить("ОбновитьКарты", Объект["БизнесПроцесс"]);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы и СписокДобавленныхФайлов.Количество()>0 Тогда
		ТекстПредупреждения = "Сначала закройте задачу";
		отказ = Истина;
	ИначеЕсли не ЗавершениеРаботы Тогда
		УдаляемСписокФайловСервер(СписокДобавленныхФайлов);
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура УдаляемСписокФайловСервер(СписокДобавленныхФайлов)
	
	// удаляем лишние файлы, если они есть несохраненные
	Для каждого с из СписокДобавленныхФайлов Цикл
		УдалитьФайлы(с.Значение);
	КонецЦикла;	
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьНомер()
	Если НЕ ЗначениеЗаполнено(Объект.Номер) Тогда
		об = РеквизитФормыВЗначение("Объект");
		об.УстановитьНовыйНомер();
		ЗначениеВРеквизитФормы(об, "Объект");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьЗаполнениеРеквизитов(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	
	Если ВводСпискаИсполнителей Тогда
        Объект.Пользователь = СписокИсполнителей[0].Значение; 
    КонецЕсли;
			
    БП_ЗаписатьСвязанныеДанные();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗадачуПоСпискуИсполнителей(Исполнитель)
    
    НоваяЗадача = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
    ЗаполнитьЗначенияСвойств(НоваяЗадача, Объект,,"Номер");
    НоваяЗадача.Пользователь 	= Исполнитель;
    НоваяЗадача.Файлы.Загрузить(Объект.Файлы.Выгрузить());
    НоваяЗадача.Записать();
    
    // перенесем файлы
    КаталогХранения = Константы.ИА_КаталогХраненияФайлов.Получить();
    КаталогХраненияИсх = КаталогХранения + СОКРЛП(Объект.Номер) + "\";
    папка = Новый Файл(КаталогХраненияИсх);
    
    Если папка.Существует() Тогда
        КаталогХраненияРез = КаталогХранения + СОКРЛП(НоваяЗадача.Номер) + "\";
        СоздатьКаталог(КаталогХраненияРез);
        
        МассивКопируемыхФайлов = НайтиФайлы(КаталогХраненияИсх, "*");
        
        Для каждого ФайлИзМассива из МассивКопируемыхФайлов Цикл
            КопироватьФайл(ФайлИзМассива.ПолноеИмя, КаталогХраненияРез + ФайлИзМассива.Имя)
        КонецЦикла;
    КонецЕсли;
    
    
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ИА_БФКС.РеквизитЕсть(Объект, "БизнесПроцесс") Тогда
		Оповестить("ОбновитьКарты", Объект["БизнесПроцесс"]);	
	КонецЕсли;
	
	//Если ВводСпискаИсполнителей Тогда
	//	
	//	КолИсп = СписокИсполнителей.Количество();
	//    Для н=1 По СписокИсполнителей.Количество() Цикл 
	//        
	//        Если н=1 Тогда 
	//            Продолжить; 
	//        КонецЕсли;
	//        
	//        Исполнитель = СписокИсполнителей.Получить(н-1);
	//        СоздатьЗадачуПоСпискуИсполнителей(Исполнитель.Значение);				        
	//    КонецЦикла;
	//    	  
	//    СписокИсполнителей.Очистить();
	//    
	//    ВводСпискаИсполнителей = Ложь;
	//КонецЕсли;
			
	СписокДобавленныхФайлов.Очистить();	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачуСУ(Команда)
	ф = ПолучитьФорму("Обработка.ИА_РабочийСтолСтратегическогоУправления.Форма.Форма");
	ф.Открыть();
	ф.АктивизироватьСтроку(Объект.ЗадачаСУ, ф.СтратегияДерево.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ПостАвтораНажатие(Элемент)
	Если не Ред_ПостАвтора Тогда
		Возврат;
	КонецЕсли;
	
	м = ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПолучитьМассивПостов(Объект.Автор);
	список = новый СписокЗначений;
	список.ЗагрузитьЗначения(м);
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораПостаАвтора", ЭтаФорма);
	//ПоказатьВыборИзСписка(Оп, список, Элементы.ГруппаОт); 
	ПоказатьВыборИзСписка(Оп, список, Элементы.ПостАвтора); 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораПостаАвтора(рез, парам) Экспорт
	Если рез <> Неопределено Тогда
		Объект.ПостАвтора = рез.Значение;
		ОбновитьЗаголовкиЭлементовШапки();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПостНажатие(Элемент)
	Если не Ред_Пост Тогда
		Возврат;
	КонецЕсли;
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораПоста", ЭтаФорма);
	парам = Новый Структура("ОтборПользователь, ОтборИерархия", Объект.Пользователь, Объект.ПостАвтора);
	ОткрытьФорму("Справочник.ОргСхема.ФормаВыбора", парам,ЭтаФорма,,,,оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораПоста(рез, парам) Экспорт
	Если рез <> Неопределено Тогда
		Объект.Пост = рез;
		ОбновитьЗаголовкиЭлементовШапки();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СрокНажатие(Элемент)
	Если не Ред_Срок Тогда
		Возврат;
	КонецЕсли;
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораСрока", ЭтаФорма);
	Если Объект.Пользователь.Пустая() тогда
		ПоказатьВводДаты(Оп, Объект.СрокИсполнения, "Введите срок");
	Иначе
		ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.Форма.ВыборСрока",Новый Структура("Пользователь", Объект.Пользователь),,,,,оп);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораСрока(рез, парам) Экспорт
	Если рез <> Неопределено Тогда
		Объект.СрокИсполнения = рез;
		
		тд = ТекущаяДата();	
		Если Объект.СрокИсполнения = НачалоДня(тд) Тогда
			Объект.СрокИсполнения = тд + 300;
		КонецЕсли;
		
		Если  Объект.СрокИсполнения < (тд + 300) Тогда
			Объект.СрокИсполнения = тд + 300;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Срок должен быть больше текущей даты. Установлен соответствующий срок!";
			Сообщение.Поле = "Объект.СрокИсполнения";
			Сообщение.ПутьКДанным = "Объект.СрокИсполнения";
			Сообщение.УстановитьДанные(Объект.СрокИсполнения);
			Сообщение.Сообщить();
		КонецЕсли;

		ОбновитьЗаголовкиЭлементовШапки();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПользовательНажатие(Элемент)
	Если не Ред_Пользователь Тогда
		Возврат;
	КонецЕсли;
	
	Если ВводСпискаИсполнителей Тогда
		парамФ = Новый Структура("Значения", СписокИсполнителей.ВыгрузитьЗначения());
		опов = Новый ОписаниеОповещения("ОткрытьВыборСписокИсполнителейЗавершение", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ИА_ВводСпискаПользователей",парамФ, ЭтаФорма,,,, опов, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораПользователя", ЭтаФорма);
		ПоказатьВводЗначения(Оп, Объект.Пользователь, "Введите сотрудника");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораПользователя(рез, парам) Экспорт
	Если рез <> Неопределено Тогда
		Объект.Пользователь = рез;
		Если ЭтоПослание Тогда
			Объект.Пост = ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка");
		Иначе
			Объект.Пост = ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПолучитьВысокийПостПользователя(Объект.Пользователь, Объект.ПостАвтора);
		КонецЕсли;
		ОбновитьЗаголовкиЭлементовШапки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСвернутыеЗаголовки()
	Элементы.ГруппаСодержание1.ЗаголовокСвернутогоОтображения = "Содержание: " + Объект.Содержание;
	Элементы.ГруппаДокладОбИсполнении.ЗаголовокСвернутогоОтображения = "Доклад об исполнении: " + Объект.ДокладОбИсполнении;
	Элементы.ГруппаСодержание.ЗаголовокСвернутогоОтображения = "Содержание: " + Объект.Содержание;
	Элементы.ГруппаСитуация.ЗаголовокСвернутогоОтображения = "Ситуация: " + Объект.Ситуация;
	Элементы.ГруппаДанные.ЗаголовокСвернутогоОтображения = "Данные: " + Объект.Данные;
	Элементы.ГруппаРешение.ЗаголовокСвернутогоОтображения = "Решение: " + Объект.Содержание;
КонецПроцедуры


&НаКлиенте
Процедура Содержание1ПриИзменении(Элемент)
	ОбновитьСвернутыеЗаголовки();
КонецПроцедуры


&НаКлиенте
Процедура ДокладОбИсполненииПриИзменении(Элемент)
	ОбновитьСвернутыеЗаголовки();
КонецПроцедуры


&НаКлиенте
Процедура СодержаниеПриИзменении(Элемент)
	ОбновитьСвернутыеЗаголовки();
КонецПроцедуры


&НаКлиенте
Процедура СитуацияПриИзменении(Элемент)
	ОбновитьСвернутыеЗаголовки();
КонецПроцедуры


&НаКлиенте
Процедура ДанныеПриИзменении(Элемент)
	ОбновитьСвернутыеЗаголовки();
КонецПроцедуры


&НаКлиенте
Процедура РешениеПриИзменении(Элемент)
	ОбновитьСвернутыеЗаголовки();
КонецПроцедуры


&НаКлиенте
Процедура ПрикрепленныйФайлНажатие(Элемент)
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	
		Если Объект.Номер = "" тогда
			возврат;
		КонецЕсли;

	КонецЕсли;
	
	СтрПарам = Новый Структура;
	СтрПарам.Вставить("Номер",Объект.Номер);
	
	МассисФайлов = Новый Массив;
	Для каждого стр из Объект.Файлы Цикл
		Струк = Новый Структура();
		Струк.Вставить("Дата", Стр.Дата);
		Струк.Вставить("Имя", Стр.Имя);
		МассисФайлов.Добавить(Струк);
	КонецЦикла;
	СтрПарам.Вставить("Файлы",МассисФайлов);
	
	Оповещение  = Новый ОписаниеОповещения("ПослеЗакрытияФормыПрикрепленных", ЭтаФорма);

	ф = ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.Форма.ФормаПрикрепленныхФайлов",СтрПарам,ЭтаФорма,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПрикрепленных(Результат, Параметры) Экспорт
	Если Результат <> КодВозвратаДиалога.Отмена 
		И Результат <> Неопределено Тогда
		//Значит Сохраняем
		
		Модифицированность = истина;
		Объект.Файлы.Очистить();
		Для каждого стр из Результат.Файлы Цикл
			Новстр = Объект.Файлы.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр, стр);
		КонецЦикла;	
		
		Для каждого стр из Результат.СписокДобавленныхФайлов Цикл
			СписокДобавленныхФайлов.Добавить(стр);
		КонецЦикла;
		ОбновитьКоличествоФайлов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоФайлов()
	к = Объект.Файлы.Количество();
	Элементы.ПрикрепленныйФайл.Заголовок = ?(к = 0, "Прикрепить файлы", "Прикрепленные файлы (" + к + ")");
КонецПроцедуры

&НаКлиенте
Процедура КомандныеЛинииНажатие(Элемент)
	ф = ПолучитьФорму("Задача.ИА_ЗадачаПланаДействий.Форма.ФормаКомандныеЛинии");
	ф.КомЛинии.Очистить();
	Для каждого стр из Объект.Маршрут Цикл
		Новстр = ф.КомЛинии.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
	КонецЦикла;
	
	Если не Объект.ЭтоЗРС ТОгда
		ф.Элементы.КомЛинииВсеВерно.Заголовок = "Выполнено";
	КонецЕсли;
	
	ф.Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоМоеЗаданиеДИ(задание)
	возврат задание.сотрудник = ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура ПрикрепленныйОбъектНажатие(Элемент)
	Если ЗначениеЗаполнено(Объект.ПрикрепленныйОбъект) Тогда   // просто откроем
		ОткрытьДолжностныеИнструкции = Ложь;
		ОткрытьЗаданиеДИ = Ложь;
	
		Попытка 
			Если ТипЗнч(Объект.ПрикрепленныйОбъект) = Тип("СправочникСсылка.ИА_Инструкции")Тогда
				ОткрытьДолжностныеИнструкции = Истина;
			КонецЕсли;       
		Исключение
		КонецПопытки;
		
		Попытка 
			Если ТипЗнч(Объект.ПрикрепленныйОбъект) = Тип("ДокументСсылка.ИА_ЗаданиеНаИзучениеДИ")Тогда
				Если ЭтоМоеЗаданиеДИ(Объект.ПрикрепленныйОбъект) Тогда
					ОткрытьЗаданиеДИ = Истина;
				КонецЕсли;
			КонецЕсли;       
		Исключение
		КонецПопытки;
		
		Если ОткрытьЗаданиеДИ Тогда
			СтруктураПараметров = Новый Структура("ДокЗадание", Объект.ПрикрепленныйОбъект);
			ФормаСпискаИнструкции = ПолучитьФорму("Обработка.ИА_РаботаСИнструкциями.Форма.ФормаУправляемая", СтруктураПараметров,ЭтаФорма);
			ФормаСпискаИнструкции.Открыть();
		ИначеЕсли ОткрытьДолжностныеИнструкции Тогда
			
			СтруктураПараметров = Новый Структура("Инструкция", Объект.ПрикрепленныйОбъект);
			
			ФормаСпискаИнструкции = ПолучитьФорму("Обработка.ИА_РаботаСИнструкциями.Форма.ФормаУправляемая", СтруктураПараметров,ЭтаФорма);
			ФормаСпискаИнструкции.ВыбИнструкция = Объект.ПрикрепленныйОбъект;
			ФормаСпискаИнструкции.Открыть();
			ФормаСпискаИнструкции.ОткрытьИнструкциюНаВесьЭкран(Объект.ПрикрепленныйОбъект);
		ИначеЕсли ОБъект.ЭтоКоррекцияСУ Тогда
			ФормаСУ = ПолучитьФорму("Обработка.ИА_РабочийСтолСтратегическогоУправления.Форма.Форма");
			ФормаСУ.Отбор_ЗРС = Объект.Ссылка;
			ФормаСУ.Открыть();
			ФормаСУ.СледующаяКоррекция(Неопределено);
		Иначе
			ПоказатьЗначение(,Объект.ПрикрепленныйОбъект);
		КонецЕсли;
	ИначеЕсли не Объект.Выполнена Тогда
		ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.Форма.ФормаВопросаПрикрепленногоОбъекта",,,,,, Новый ОписаниеОповещения("ПрикрепленныйОбъектНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленныйОбъектНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.ПрикрепленныйОбъект = Результат;
		ОбновитьНадписьПрикрОбъекта();
		Модифицированность = истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
процедура ОбновитьНадписьПрикрОбъекта()
	Если ЗначениеЗаполнено(Объект.ПрикрепленныйОбъект) ТОгда
		Элементы.ПрикрепленныйОбъект.Заголовок = Объект.ПрикрепленныйОбъект;
	Иначе
		Элементы.ПрикрепленныйОбъект.Заголовок = "Прикрепить элемент справочника, документ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
процедура ОбновитьНадписьОснование()
	Если ЗначениеЗаполнено(Объект.Основание) ТОгда
		Элементы.ДекорацияОснование.Заголовок = "Основание: "+Объект.Основание;
	Иначе
		Элементы.ДекорацияОснование.Видимость = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовыйКомментПриИзменении(Элемент)
	Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПрикрепленныйОбъект(Команда)
	Объект.ПрикрепленныйОбъект = Неопределено;
	Модифицированность = Истина;
	ОбновитьНадписьПрикрОбъекта();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Вид)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо сначала записать частицу!");
		Возврат;
	КонецЕсли;
	
	
	парам = Новый Структура("Задача,Вид", Объект.Ссылка, Вид);
	Парам1 = Новый Структура("Основание",парам);
	ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.ФормаОбъекта",Парам1);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОснованииЗадачу(Команда)
	СоздатьНаОсновании("ЗАДАЧА");
КонецПроцедуры


&НаКлиенте
Процедура СоздатьНаОснованииЗРС(Команда)
	СоздатьНаОсновании("ЗРС");
КонецПроцедуры


&НаКлиенте
Процедура СоздатьНаОснованииПослание(Команда)
	СоздатьНаОсновании("ПОСЛАНИЕ");
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияОснованиеНажатие(Элемент)
	ПоказатьЗначение(,Объект.Основание);
КонецПроцедуры


&НаКлиенте
Процедура СписокПользователей(Команда)
	ВводСпискаИсполнителей = не ВводСпискаИсполнителей;
	Элементы.СписокПользователей.Пометка = ВводСпискаИсполнителей;
	
	Элементы.Пост.Доступность = не ВводСпискаИсполнителей;
	Если ВводСпискаИсполнителей Тогда
		Объект.Пост = ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка");
		
        парамФ = Новый Структура("Значения", СписокИсполнителей.ВыгрузитьЗначения());
		опов = Новый ОписаниеОповещения("ОткрытьВыборСписокИсполнителейЗавершение", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ИА_ВводСпискаПользователей",парамФ, ЭтаФорма,,,, опов, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
    КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьВыборСписокИсполнителейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат<>Неопределено Тогда
		СписокИсполнителей.ЗагрузитьЗначения(Результат);
	КонецЕсли;
	
	ОбновитьЗаголовкиЭлементовШапки();
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияПриоритетНажатие(Элемент)
	Если не МожноРедакт Тогда
		возврат;
	КонецЕсли;
	новПриоритет = ПредопределенноеЗначение("Перечисление.КСУ_ПриоритетЗадачи.ПустаяСсылка");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ДекорацияПриоритетНажатиеЗавершение", ЭтотОбъект, Новый Структура("новПриоритет", новПриоритет)), новПриоритет, "Выберите приоритет");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПриоритетНажатиеЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	новПриоритет = ?(Значение = Неопределено, ДополнительныеПараметры.новПриоритет, Значение);
	
	
	Если (Значение <> Неопределено) Тогда
		Объект.Приоритет = новПриоритет;
		ОбновитьНадписьПриоритет();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
процедура ОбновитьНадписьПриоритет()
	Если Объект.ЭтоПослание Тогда
		Элементы.ДекорацияПриоритет.Видимость = Ложь;
		Элементы.ДекорацияПриоритетЗаг.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияПриоритет.Заголовок = строка(объект.Приоритет);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодзадачиВыполненоПриИзменении(Элемент)
	тд = Элементы.Подзадачи.ТекущиеДанные;
	если тд.Выполнено тогда
		тд.ДатаВыполнения = ТекущаяДата();
		тд.Выполнил = ТекПользователь;
	Иначе
		тд.ДатаВыполнения = Дата(1,1,1);
		тд.Выполнил = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодзадачиПередУдалением(Элемент, Отказ)
	Если не МожноРедакт ТОгда
		отказ=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГруппуПодзадачи()
	заг = "Подзадачи ( " + Объект.Подзадачи.Количество() + " )";
	Элементы.ГруппаПодзадачи.Заголовок = заг;
	Элементы.ГруппаПодзадачи.ЗаголовокСвернутогоОтображения = заг;
КонецПроцедуры

&НаКлиенте
Процедура ПодзадачиПриИзменении(Элемент)
	ОбновитьГруппуПодзадачи();
КонецПроцедуры

&НаКлиенте
Процедура УточнитьЗадачу(Команда)
	Подсказка = "Введите текст уточнения";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтрокиУточнения", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтрокиУточнения(Строка, Параметры) Экспорт
    Если НЕ Строка = Неопределено Тогда
        Объект.Содержание = Объект.Содержание + Символы.ПС + Символы.ПС + "Уточнение ("+ТекПользователь + "  "+ТекущаяДата()+ "):" + Символы.ПС + строка;
		Модифицированность = Истина;
    КонецЕсли;
КонецПроцедуры;

