
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокЗаданияОтМеня.Параметры.УстановитьЗначениеПараметра("Автор", ПараметрыСеанса.ТекущийПользователь);
	СписокВсе.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Элементы.ВсеЗадания.Видимость = (РольДоступна("АдминистраторСистемы") ИЛИ ПараметрыСеанса.ТекущийПользователь.РазрешенПросмотрВсехЗадач);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	// Зеленым цветом в списке "Задачи на меня" если задача в работе
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ПринятВРаботу");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	//Только просмотр для номенклатуры подчиненных элементов, чтобы только характеристику можно было изменить
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокВсе.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокВсе.ЗадачаДругогоАвтораИсполнителя");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоСерый);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадание(Команда)
	ОткрытьФорму("БизнесПроцесс.Задание.Форма.ФормаБизнесПроцесса");
КонецПроцедуры

&НаСервере
Процедура ПринятьВРаботуНаСервере()
	Если не Элементы.Список.ТекущаяСтрока = Неопределено Тогда 
		Задание = Элементы.Список.ТекущаяСтрока.Ссылка.ПолучитьОбъект();
		Задание.ПринятВРаботу = Истина;
		Задание.ДатаНачалаИсполнения = ТекущаяДатаСеанса();
		Задание.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПринятьВРаботу(Команда)
	ПринятьВРаботуНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаданияОтМеняВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если БизнесПроцессаНет(ВыбраннаяСтрока) Тогда 
		СтандартнаяОбработка = Ложь;
		П = Новый Структура ("Ключ", ВыбраннаяСтрока); 
		ОткрытьФорму("Задача.Задачи.Форма.ФормаЗадачи",П,ЭтотОбъект);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция БизнесПроцессаНет(ВыбраннаяСтрока)
	Если ВыбраннаяСтрока.БизнесПроцесс.Пустая() Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// проверка просроченных задач
	ПодключитьОбработчикОжидания("ПроверкаПросроченныхЗадач", 600, Ложь); 
	
	// предупреждение о новых задачах
	ПодключитьОбработчикОжидания("ПроверитьНовыеЗадачи", 60, Ложь);

	// отбор по статусу заявки
	УстановитьОтборПоВыполненным();
	
	// отбор по галочке "Показать выполненные"
	ПоказатьВыполненные();
	
	// видимость и доступность элементов
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПросроченныхЗадач()
	КоличествоПросроченных = ПолучитьКоличествоПросроченных();
	Если КоличествоПросроченных > 0 Тогда 
		//ПоказатьПредупреждение(, "Внимание! У вас " + КоличествоПросроченных + " просроченных задач!", ,"Внимание!");
		ПараметрыНовойФормы = Новый Структура;
		ПараметрыНовойФормы.Вставить("КоличествоПросроченных", КоличествоПросроченных);
		ОткрытьФорму("Задача.Задачи.Форма.ФормаПредупреждениеОПросроченныхЗадачах",ПараметрыНовойФормы, ЭтаФорма, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоПросроченных()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачиЗадачиПоИсполнителю.Ссылка
	|ИЗ
	|	Задача.Задачи.ЗадачиПоИсполнителю КАК ЗадачиЗадачиПоИсполнителю
	|ГДЕ
	|	ЗадачиЗадачиПоИсполнителю.ПометкаУдаления = ЛОЖЬ
	|	И ЗадачиЗадачиПоИсполнителю.Выполнена = ЛОЖЬ
	|	И ЗадачиЗадачиПоИсполнителю.СрокИсполнения < &СрокИсполнения";
	
	Запрос.УстановитьПараметр("СрокИсполнения", ТекущаяДатаСеанса());
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.Количество();
КонецФункции

&НаКлиенте
Процедура ПроверитьНовыеЗадачи()
	КоличествоНовыхЗадач = ПроверитьКоличествоНовыхЗадач();
	Ссылка = ПолучитьНавигационнуюСсылку(ПолучитьФорму("Задача.Задачи.Форма.ФормаСпискаНаРабочемСтоле"))+ "?ref=" + """" + "Открыть задачи"+ """";
	Если КоличествоНовыхЗадач > 0 Тогда 
		ПоказатьОповещениеПользователя("
		|Вам назначена задача!
		|",Ссылка,"Открыть окно задач",БиблиотекаКартинок.Информация32);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьКоличествоНовыхЗадач()
	КоличествоЗадач = 0;
	
	ЗадачиЕсть = РегистрыСведений.УведомленияОНовыхЗадачах.СоздатьНаборЗаписей();
	ЗадачиЕсть.Отбор.Исполнитель.Установить(ПараметрыСеанса.ТекущийПользователь);
	ЗадачиЕсть.Прочитать();
	КоличествоЗадач = ЗадачиЕсть.Количество();
	Если не ЗадачиЕсть.Количество()=0 Тогда 		
		Для Каждого сЗадача из ЗадачиЕсть Цикл
			ЗадачиЕсть.Удалить(сЗадача);
		КонецЦикла;
		ЗадачиЕсть.Записать();
	КонецЕсли;   	
	   	
	Возврат КоличествоЗадач;
КонецФункции

&НаКлиенте
Процедура ПоказатьВыполненные()
	
	Если ПоказыватьВыполненные Тогда
		Список.Отбор.Элементы.Очистить();
		СписокЗаданияОтМеня.Отбор.Элементы.Очистить();
		СписокВсе.Отбор.Элементы.Очистить();
	Иначе
		УстановитьОтборПоВыполненным();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоВыполненным()
		
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Выполнена");
	ЭО.ПравоеЗначение=Ложь;
	ЭО.Использование=Истина;
	
	ЭО=СписокЗаданияОтМеня.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Выполнена");
	ЭО.ПравоеЗначение=Ложь;
	ЭО.Использование=Истина;
	
	ЭО=СписокВсе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Выполнена");
	ЭО.ПравоеЗначение=Ложь;
	ЭО.Использование=Истина;

	
КонецПроцедуры

&НаКлиенте
Процедура СписокВсеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если БизнесПроцессаНет(ВыбраннаяСтрока) Тогда 
		СтандартнаяОбработка = Ложь;
		П = Новый Структура ("Ключ", ВыбраннаяСтрока); 
		ОткрытьФорму("Задача.Задачи.Форма.ФормаЗадачи",П,ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИДоступностьЭлементов()
	
	Элементы.ФормаПринятьВРаботу.Доступность = (Элементы.СтраницыЗаданий.ТекущаяСтраница.Имя = "МоиЗадания");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВыполненныеПриИзменении(Элемент)
	
	ПоказатьВыполненные();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыЗаданийПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрАвторПриИзменении(Элемент)
	
	УстановитьОтборыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрИсполнительПриИзменении(Элемент)
	
	УстановитьОтборыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТочкаПродажПриИзменении(Элемент)
	
	УстановитьОтборыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборыДинамическогоСписка()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокВсе, "Автор", 	  ФильтрАвтор, 		 ВидСравненияКомпоновкиДанных.Равно,, НЕ ФильтрАвтор.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокВсе, "Исполнитель", ФильтрИсполнитель, ВидСравненияКомпоновкиДанных.Равно,, НЕ ФильтрИсполнитель.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокВсе, "ТочкаПродаж", ФильтрТочкаПродаж, ВидСравненияКомпоновкиДанных.Равно,, НЕ ФильтрТочкаПродаж.Пустая());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Задание" Тогда
		Элементы.Список.Обновить();
		Элементы.СписокВсе.Обновить();
		Элементы.СписокЗаданияОтМеня.Обновить();
	КонецЕсли;
	
КонецПроцедуры
