
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТД = Элемент.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	ФормаПросмотраАрхива = ПолучитьФорму("Обработка.ИА_РаботаСИнструкциями.Форма.ФормаПоказаСодержимогоАрхива");
	
	Инструкция = ПолучитьМакет(ТД.Период, ТД.Наименование);
	ФормаПросмотраАрхива.ПолеHTML = Инструкция;
	ФормаПросмотраАрхива.Открыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьМакет(Период, Наименование)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АрхивИнструкций.Макет
		|ИЗ
		|	РегистрСведений.ИА_АрхивИнструкций КАК АрхивИнструкций
		|ГДЕ
		|	АрхивИнструкций.Период = &Период
		|	И АрхивИнструкций.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Период", Период);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Макет.Получить();
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура Выбрать(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Закрыть(ПолучитьМакет(ТекДанные.Период, ТекДанные.Наименование));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерегрузитьСтраницу()
	ИмяРеквизита = "ПолеHTML_Просмотр";
	УстановитьТекстHTML(ИмяРеквизита, НовыйТекстHTML);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстHTML(ИмяРеквизита, ИсходныйТекст)
	#Если ВебКлиент или ТолстыйКлиентОбычноеПриложение Тогда
		ЭтаФорма[ИмяРеквизита] = ИсходныйТекст;
	#Иначе
		Элементы[ИмяРеквизита].Документ.open  ("text/html","replace");
		Элементы[ИмяРеквизита].Документ.write (ИсходныйТекст);
		Элементы[ИмяРеквизита].Документ.close ();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстHTML(ИмяРеквизита)
	Если НЕ ЭтоИЕ Тогда
		Возврат Элементы[ИмяРеквизита].Документ.children[0].outerHTML;
	Иначе
		Возврат Элементы[ИмяРеквизита].Документ.all.tags("html").item(0).outerHTML;
	КонецЕсли
КонецФункции

&НаСервереБезКонтекста 
Функция ПолучитьДанныеИнструкции(Инструкция)
	Спр = Инструкция.ПолучитьОбъект();
	Возврат Новый Структура("Текст, ТекстКолонтитула", Спр.Текст, Спр.ТекстКолонтитула);
КонецФункции

&НаСервереБезКонтекста 
Функция ПолучитьДанныеОпределения(Инструкция)
	Спр = Инструкция.ПолучитьОбъект();
	Возврат Новый Структура("Определение", Спр.Определение);
КонецФункции

&НаКлиенте
Процедура ПолеHTML_ПросмотрПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	pEvtObj = Новый Структура("srcElement,returnValue",ДанныеСобытия.Element,Неопределено);
	
	элИнструкция  = ИА_ОбщиеПроцедуры_Технология.ИА_ПолучитьСсылкуOnClickПоляHTML(Неопределено, pEvtObj);
	элОпределение = ИА_ОбщиеПроцедуры_Технология.ИА_ПолучитьСсылкуНаГлоссарийOnClickПоляHTML(Неопределено, pEvtObj);
	
	Если ЗначениеЗаполнено(элИнструкция) Тогда
		ЗагрузитьИнструкцию(элИнструкция);
	ИначеЕсли ЗначениеЗаполнено(элОпределение) Тогда
		ЗагрузитьОпределение(элОпределение);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTML_ПросмотрДокументСформирован(Элемент)
	Элемент.Документ.Body.ContentEditable = "false";
	Элемент.Документ.body.scroll = "auto";
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИнструкцию(Инструкция, ИгнорироватьИсторию = Ложь)
	ТекущаяИнструкция = Инструкция;
	Данные = ПолучитьДанныеИнструкции(Инструкция);
	
	НовТекст = ИА_ДИ_КлиентСервер.ПропарситьХТМЛДокументИОбновитьНаименованияСсылокИПеременные(Данные.Текст, Инструкция);
	НовТекст = ИА_ОбщиеПроцедуры_Технология.ВставитьСсылкиНаОпределения(НовТекст);
	
	НовыйТекстHTML = НовТекст;
	ПодключитьОбработчикОжидания("ПерегрузитьСтраницу", 0.1, истина);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОпределение(Определение, ИгнорироватьИсторию = Ложь)
	Данные = ПолучитьДанныеОпределения(Определение);
	НовТекст = ИА_ОбщиеПроцедуры_Технология.ВставитьСсылкиНаОпределения(Данные.Определение);
	НовыйТекстHTML = НовТекст;
	ПодключитьОбработчикОжидания("ПерегрузитьСтраницу", 0.1, истина);	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда
		СисИнфо = Новый СистемнаяИнформация;
		ЭтоИЕ = (Найти(СисИнфо.ИнформацияПрограммыПросмотра, "MSIE")>0);
	#Иначе
		ЭтоИЕ = Истина;
	#КонецЕсли
КонецПроцедуры

