
Процедура ПередЗаписью(Отказ, Замещение)
	//Если Не КоличествоОт > Константы.КоличествоУгловПриБесплатномРаскрое Тогда
	//	ПоказатьПредупреждение(, "Количество не может быть меньше количества углов при бесплатном раскрое!");
	//	Отказ = Истина;
	//Иначе
	//	Запрос = Новый Запрос;
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	НастройкиДифференцированнойСтоимостиУглов.КоличествоОт,
	//	|	НастройкиДифференцированнойСтоимостиУглов.Цена
	//	|ИЗ
	//	|	РегистрСведений.НастройкиДифференцированнойСтоимостиУглов КАК НастройкиДифференцированнойСтоимостиУглов
	//	|ГДЕ
	//	|	НастройкиДифференцированнойСтоимостиУглов.КоличествоОт = &КоличествоОт";
	//	Запрос.УстановитьПараметр("КоличествоОт", КоличествоОт);
	//	Результат = Запрос.Выполнить();
	//	Если Не Результат.Пустой() Тогда
	//		ПоказатьПредупреждение(, "Количество """ + СокрЛП(Строка(КоличествоОт)) + """ уже было установлено ранее!");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры
