
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	СтруктураОтбора = Новый Структура;
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		СтруктураОтбора.Вставить("Контрагент", ОбщийМодульВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "Контрагент"));	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	//ПараметрыФормы.Вставить("КлючНазначенияИспользования", "По заказам покупателя");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина); 

	ОткрытьФорму("Отчет.ДетализацияВзаиморасчетовСКонтрагентом.Форма", 
				 ПараметрыФормы, 
				 ПараметрыВыполненияКоманды.Источник, 
				 Новый УникальныйИдентификатор,  
				 ПараметрыВыполненияКоманды.Окно, 
				 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
				 
КонецПроцедуры
