
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.ВремяНачала = ТекущаяДата();
		ЗаполнитьНеделюПоДате();
	Иначе
		ОбновитьПредставлениеПостов();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеПостов()
	Для каждого стр из объект.ПрисутствиеРуководителей цикл
		стр.ПостСтрока = стр.Отделение.КраткоеНаименование;
	КонецЦикла;
	Для каждого стр из объект.ГлавныеСтатистики цикл
		стр.ПостСтрока = стр.Отделение.КраткоеНаименование;
	КонецЦикла;
	Для каждого стр из объект.ЗадачиНаНеделю цикл
		стр.ПостСтрока = стр.Пост.КраткоеНаименование;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНеделюПоДате()
	если Объект.Дата = дата(1,1,1) Тогда
		возврат;
	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_РаспределениеНедель.Период
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Период <= &Период
	               |	И ИА_РаспределениеНедель.КонецНедели >= &Период";
	Запрос.УстановитьПараметр("Период", НачалоДня(Объект.Дата));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() Тогда
		Объект.Неделя = выборка.период;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НачальноеЗаполнение(ТолькоСтатистики = ложь)

	// председатель
	Если не ТолькоСтатистики Тогда
		ПостРекСовет = Константы.ИА_ПостРекСовет.Получить();
		Если не ПостРекСовет.Пустая() ТОгда		
			Если ПостРекСовет.Сотрудники.Количество()>0 Тогда
				Объект.Председатель = ПостРекСовет.Сотрудники[0].ФизЛицо;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если не ТолькоСтатистики Тогда
		Объект.ПрисутствиеРуководителей.Очистить();
	КонецЕсли;
	Объект.ГлавныеСтатистики.Очистить();
	
	Если Объект.Организация.Пустая() Тогда
		Возврат;
	КонецЕсли;

	// список руководителей
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка КАК Отделение,
				   |	ОргСхема.КраткоеНаименование КАК ПостСтрока,				   
	               |	ИА_ПланыДействий.Ссылка КАК План,
	               |	ИА_ПланыДействий.Состояние КАК Состояние,
	               |	ОргСхемаСотрудники.ФизЛицо КАК Сотрудник 
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_ПланыДействий КАК ИА_ПланыДействий
	               |		ПО ОргСхема.Ссылка = ИА_ПланыДействий.Пост
	               |			И (ИА_ПланыДействий.ДатаНачала = &Неделя)
	               |			И (ИА_ПланыДействий.ПометкаУдаления = ЛОЖЬ)
	               |			И (ИА_ПланыДействий.Родитель = ЗНАЧЕНИЕ(справочник.ИА_ПланыДействий.Пустаяссылка))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
	               |		ПО ОргСхема.Ссылка = ОргСхемаСотрудники.Ссылка И ОргСхемаСотрудники.НомерСтроки = 1
	               |ГДЕ
	               |	ОргСхема.Ссылка В ИЕРАРХИИ(&организация)
	               |	И ОргСхема.ТипТерминала = &Отделение
	               |	И ОргСхема.ПометкаУдаления = ЛОЖЬ
	               |	И ОргСхема.Родитель.ТипТерминала <> &Учредитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОргСхема.ПорядокВСхеме";
	Запрос.УстановитьПараметр("организация", Объект.Организация);
	Запрос.УстановитьПараметр("Неделя", Объект.Неделя);
	Запрос.УстановитьПараметр("Отделение", Перечисления.ТипТерминалаОргСхемы.Департамент);
	Запрос.УстановитьПараметр("Учредитель", Перечисления.ТипТерминалаОргСхемы.Учредитель);
	
	рукПланы = Запрос.Выполнить().Выгрузить();
	
	Если не ТолькоСтатистики Тогда
		Для каждого стрОтд из рукПланы Цикл
			Новстр = Объект.ПрисутствиеРуководителей.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр,стрОтд); 
		КонецЦикла;	
	КонецЕсли;
	

	// статистик
	Для каждого стрОтд из рукПланы Цикл
		если ЗначениеЗаполнено(стрОтд.План) Тогда
			для каждого стрСтат из стрОтд.План.План Цикл
				новстр = Объект.ГлавныеСтатистики.Добавить();
				ЗаполнитьЗначенияСвойств(Новстр,стрОтд); 
				ЗаполнитьЗначенияСвойств(Новстр,стрСтат); 
				Новстр.Квота = стрСтат.КвотаПлан;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	НачальноеЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПравильноПриИзменении(Элемент)
	Если Объект.ЭтоПравильно тогда
		Объект.ВремяЗавершения = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиНаНеделюПриАктивизацииСтроки(Элемент)
	сп = Элементы.ЗадачиНаНеделюПостСтрока.СписокВыбора;
	сп.Очистить();
	для каждого стр из Объект.ПрисутствиеРуководителей цикл
		сп.Добавить(стр.Отделение, стр.ПостСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗадачиНаНеделюПостСтрокаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Элементы.ЗадачиНаНеделю.ТекущиеДанные.Пост = ВыбранноеЗначение;
		Элементы.ЗадачиНаНеделю.ТекущиеДанные.ПостСтрока = КраткоеНаименование(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезконтекста
Функция КраткоеНаименование(пост)
	возврат пост.КраткоеНаименование;
КонецФункции

&НаКлиенте
Процедура ОбновитьДокумент(Команда)
	ОбновитьДокументСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументСервер()
	ЗаполнитьНеделюПоДате();
	НачальноеЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПротокола(Команда)
		ТабДок = ПечатьНовогоПротоколаНаСервере();
	ТабДок.Показать();
КонецПроцедуры
&НаСервере
Функция ПечатьНовогоПротоколаНаСервере()
	ТабДокИтог = Новый ТабличныйДокумент;
	ТабДокВрем = Новый ТабличныйДокумент;
 
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетНоваяПФ");
	//Первая страница
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Вступление");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Даты");
	ОбластьМакета.Параметры.Заполнить(Объект);
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Участники");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаУчастники");
	ТабДокВрем.Вывести(ОбластьМакета);  

    Для Каждого Стр Из Объект.ПрисутствиеРуководителей Цикл    
                
        ОбластьМакета = Макет.ПолучитьОбласть("СтрокаУчастники");
        ОбластьМакета.Параметры.Номер = Стр.НомерСтроки;
		ОбластьМакета.Параметры.Пост = Стр.ПостСтрока;
		ОбластьМакета.Параметры.ФИО = Стр.Сотрудник;
		ОбластьМакета.Параметры.ПЛАН = Стр.План;
        ОбластьМакета.Параметры.СОСТ = Стр.Состояние;
		ТабДокВрем.Вывести(ОбластьМакета);
		
	КонецЦикла;
	ОбластьМакета = Макет.ПолучитьОбласть("ПредседСекретарь");
	ОбластьМакета.Параметры.ПРЕДСЕДАТЕЛЬ = Объект.Председатель;
	ОбластьМакета.Параметры.СЕКРЕТАРЬ = Объект.Секретарь;
	ТабДокВрем.Вывести(ОбластьМакета);	
	ТабДокВрем.ВывестиГоризонтальныйРазделительСтраниц();
	
	Если ТабДокИтог.ПроверитьВывод(ТабДокВрем) Тогда
		ТабДокИтог.Вывести(ТабДокВрем);
	Иначе
		ТабДокИтог.Вывести(ТабДокВрем);
		ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокИтог = Новый ТабличныйДокумент;
		ТабДокИтог.Присоединить(ТабДокВрем);
	КонецЕсли;
		
	
	//Вторая страница
	
	ОбластьМакета = Макет.ПолучитьОбласть("АнализДеятЗаг");
	ТабДокИтог.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокИтог.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("АнализДеятОтчет");
	ТабДокИтог.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокИтог.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Комментарии");
	ОбластьМакета.Параметры.Комментарий = Объект.Комментари;
	ТабДокИтог.Вывести(ОбластьМакета);
	ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
	
	//Третья страница
	
	ОбластьМакета = Макет.ПолучитьОбласть("НазначСостЗаг");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ТабПроизвШапка");
	ТабДокВрем.Вывести(ОбластьМакета);
	
	Для Каждого Стр Из Объект.ПрисутствиеРуководителей Цикл
	ОбластьМакета = Макет.ПолучитьОбласть("ТабСостСтрока");
	ОбластьМакета.Параметры.РО = Стр.ПостСтрока;
	ОбластьМакета.Параметры.СОСТОЯНИЕ = Стр.Состояние;
	ОбластьМакета.Параметры.ПРИЧИНАСОСТОЯНИЯ = Стр.ПричинаСостояния;	
	ТабДокВрем.Вывести(ОбластьМакета);
	КонецЦикла;	
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Комментарии");
	ОбластьМакета.Параметры.Комментарий = Объект.КомментариСостояний;
	ТабДокВрем.Вывести(ОбластьМакета);
	
	
	Если ТабДокИтог.ПроверитьВывод(ТабДокВрем) Тогда
		ТабДокИтог.Вывести(ТабДокВрем);
	Иначе
		ТабДокИтог.Вывести(ТабДокВрем);
		ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокИтог = Новый ТабличныйДокумент;
		ТабДокИтог.Присоединить(ТабДокВрем);
	КонецЕсли;
	
	
	//Четвертая страница
	//ТабДокВрем.Очистить();
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПроизвЗадачиЗаг");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ТабПроизвШапка");
	ТабДокВрем.Вывести(ОбластьМакета);
	
	Для Каждого Стр Из Объект.ГлавныеСтатистики Цикл
	ОбластьМакета = Макет.ПолучитьОбласть("ТабПроизвСтрока");
	ОбластьМакета.Параметры.ПОСТ = Стр.ПостСтрока;
	ОбластьМакета.Параметры.СТАТИСТИКА = Стр.ВидСтатистики;
	ОбластьМакета.Параметры.ФАКТ = Стр.ТекущееЗначениеСтатистики;
	ОбластьМакета.Параметры.КВОТА = Стр.Квота;
	ТабДокВрем.Вывести(ОбластьМакета);
	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	Если ТабДокИтог.ПроверитьВывод(ТабДокВрем) Тогда
		ТабДокИтог.Вывести(ТабДокВрем);
	Иначе
		ТабДокИтог.Вывести(ТабДокВрем);
		ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокИтог = Новый ТабличныйДокумент;
		ТабДокИтог.Присоединить(ТабДокВрем);
	КонецЕсли;
	
	//Пятая страница
	//ТабДокВрем.Очистить();
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("СитуацЗаг");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ТабСитуацШапка");
	ТабДокВрем.Вывести(ОбластьМакета);

	Для Каждого Стр Из Объект.Ситуации Цикл
	ОбластьМакета = Макет.ПолучитьОбласть("ТабСитуацСтрока");
	ОбластьМакета.Параметры.СИТУАЦИЯ = Стр.Ситуация;
	ОбластьМакета.Параметры.ПОЧЕМУ = Стр.Почему;
	ТабДокВрем.Вывести(ОбластьМакета);
	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("Комментарии");
	ОбластьМакета.Параметры.Комментарий = Объект.КомментариСитуации;
	
	Если ТабДокИтог.ПроверитьВывод(ТабДокВрем) Тогда
		ТабДокИтог.Вывести(ТабДокВрем);
	Иначе
		ТабДокИтог.Вывести(ТабДокВрем);
		ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокИтог = Новый ТабличныйДокумент;
		ТабДокИтог.Присоединить(ТабДокВрем);
	КонецЕсли;
	
	
	//Шестая страница
	//ТабДокВрем.Очистить();

	ОбластьМакета = Макет.ПолучитьОбласть("АнализСостЗаг");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("АнализСостТекст");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ТабАнализСост");
	ОбластьМакета.Параметры.СостояниеКомпании = Объект.Состояние;
	ОбластьМакета.Параметры.ПричинаСостояния = Объект.ОсновнаяПричина;
	ТабДокВрем.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("РамкаАнализСитуация");
	ОбластьМакета.Параметры.СитуацияВКомпании = Объект.Ситуация;	
	ТабДокВрем.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("РамкаАнализПриказ");
	ОбластьМакета.Параметры.ГлавныйПриказ = Объект.ГлавныйПриказ;
	ТабДокВрем.Вывести(ОбластьМакета);
	
	Если ТабДокИтог.ПроверитьВывод(ТабДокВрем) Тогда
		ТабДокИтог.Вывести(ТабДокВрем);	
	Иначе
		ТабДокИтог.Вывести(ТабДокВрем);
		ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокИтог = Новый ТабличныйДокумент;
		ТабДокИтог.Присоединить(ТабДокВрем);
	КонецЕсли;

	
	//Седьмая страница
//	ТабДокВрем.Очистить();

	ОбластьМакета = Макет.ПолучитьОбласть("ПланКомпанииЗаг");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПланКомпанииТекст");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ТабПланЗадачиШапка");
	ТабДокВрем.Вывести(ОбластьМакета);

	Для Каждого Стр Из Объект.ЗадачиНаНеделю Цикл	
	ОбластьМакета = Макет.ПолучитьОбласть("ТабПланЗадачиСтрока");
	ОбластьМакета.Параметры.Номер = Стр.НомерСтроки ;
	ОбластьМакета.Параметры.Задача = Стр.Задача ;
	ОбластьМакета.Параметры.Пост = Стр.ПостСтрока ;
	ОбластьМакета.Параметры.Срок = Стр.Срок ;
	ТабДокВрем.Вывести(ОбластьМакета);	
	КонецЦикла;	
		
	ОбластьМакета = Макет.ПолучитьОбласть("Комментарии");
	ОбластьМакета.Параметры.Комментарий = Объект.КомментариЗадачи;
	
	Если ТабДокИтог.ПроверитьВывод(ТабДокВрем) Тогда
		ТабДокИтог.Вывести(ТабДокВрем);	
	Иначе
		ТабДокИтог.Вывести(ТабДокВрем);
		ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокИтог = Новый ТабличныйДокумент;
		ТабДокИтог.Присоединить(ТабДокВрем);
	КонецЕсли;


	
	//Восьмая страница
//	ТабДокВрем.Очистить();
	
	ОбластьМакета = Макет.ПолучитьОбласть("ДопПредЗаг");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ДопПредТекст");
	ТабДокВрем.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ДопПредПредлож");
	ОбластьМакета.Параметры.Предложения = Объект.ДопПредложения;
	ТабДокВрем.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокВрем.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ВремКонц");
	ОбластьМакета.Параметры.ВремяЗавершения = Объект.ВремяЗавершения;
	ТабДокВрем.Вывести(ОбластьМакета);
	
	Если ТабДокИтог.ПроверитьВывод(ТабДокВрем) Тогда
		ТабДокИтог.Вывести(ТабДокВрем);	
	Иначе
		ТабДокИтог.Вывести(ТабДокВрем);
		ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокИтог = Новый ТабличныйДокумент;
		ТабДокИтог.Присоединить(ТабДокВрем);
	КонецЕсли;


	
	ТабДокИтог.ПолеСнизу = 10;
	ТабДокИтог.ОтображатьЗаголовки = Ложь;
	ТабДокИтог.ОтображатьСетку = Ложь;
	
	ТабДокИтог.НижнийКолонтитул.НачальнаяСтраница = 1;
	ТабДокИтог.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	ТабДокИтог.НижнийКолонтитул.ТекстСлева = "";
	ТабДокИтог.НижнийКолонтитул.ТекстСправа = "";
	ТабДокИтог.НижнийКолонтитул.ТекстВЦентре = "- [&НомерСтраницы] из [&СтраницВсего] -";
	ТабДокИтог.НижнийКолонтитул.ТекстСправа = "";
	ТабДокИтог.НижнийКолонтитул.Выводить = Истина;
	
	ТабДокИтог.РазмерСтраницы = "A4";
	ТабДокИтог.УстановитьРастягиваниеПоГоризонтали(Истина);	
	Возврат ТабДокИтог;

КонецФункции

&НаКлиенте
Процедура ОбновитьСтатистики(Команда)
	НачальноеЗаполнение(истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПредставлениеПостов();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьФайл(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ДобавитьФайлЗавершение1", ЭтотОбъект), ,, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлЗавершение1(Результат, Адрес, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
	Модифицированность = истина;
	
	ф = новый Файл(ВыбранноеИмя);
	ПоместитьФайлОбъектаОкончание(Адрес,ф.Имя);
КонецПроцедуры

&НаСервере
Процедура ПоместитьФайлОбъектаОкончание(АдресВременногоХранилища, ВыбранноеИмя)
	
	КаталогФайлов = ПолучитьПутьКФайлам(объект.Номер);	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	КаталогХранения = КаталогФайлов + ВыбранноеИмя;
	ДвоичныеДанные.Записать(КаталогХранения);
	
	НоваяСтрока = Объект.Файлы.Добавить();	
	НоваяСтрока.Имя = ВыбранноеИмя;
	НоваяСтрока.Дата = ТекущаяДата();
	
КонецПроцедуры



&НаКлиенте
Процедура ОткрытьФайл(Команда)
	имяФайла = Элементы.Файлы.ТекущиеДанные.Имя;
	АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(имяФайла);
	Если ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		врИмяФайла = КаталогВременныхФайлов() + имяФайла;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		ДвоичныеДанные.Записать(врИмяФайла);
		ЗапуститьПриложение(врИмяФайла);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПоместитьТекущийФайлВБуфер(ВыбранноеИмя)
	
	КаталогФайлов = ПолучитьПутьКФайлам(объект.Номер);	
	КаталогХранения = КаталогФайлов + ВыбранноеИмя;
	ФайлДляПередачи = Новый ДвоичныеДанные(КаталогХранения);
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ФайлДляПередачи, УникальныйИдентификатор);
	
	Возврат АдресВременногоХранилища;
	
КонецФункции


&НаКлиенте
Процедура СохранитьФайл(Команда)
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Элементы.Файлы.ТекущиеДанные.Имя;
	ДиалогОткрытияФайла.Заголовок = "Сохранение файла";
	Расширение = Сред(Элементы.Файлы.ТекущиеДанные.Имя,Найти(Элементы.Файлы.ТекущиеДанные.Имя, ".")+1);
	Фильтр = "(*."+ Расширение +")|*."+Расширение+"";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Расширение = Расширение;	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		ВыбранныйКаталог = Новый Файл(ДиалогОткрытияФайла.Каталог);
		
		АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(Элементы.Файлы.ТекущиеДанные.Имя);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		
		Попытка
			ДвоичныеДанные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПутьКФайлам(номер)
	Возврат Константы.ИА_КаталогХраненияФайлов.Получить()+"RS\"+номер+"\";
КонецФункции
