
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", Строки.ПолучитьКлючи());	
	Запрос.Текст = Документы.ЗаказПокупателя.ПолучитьТекстЗапросаСпискаВыбора();
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();		
	ВыборкаОплачено = РезультатЗапроса[0].Выбрать();	
	
	Пока ВыборкаОплачено.Следующий() Цикл
		СтрокаСписка = Строки[ВыборкаОплачено.Ссылка];
		Если СтрокаСписка.Данные.Свойство("КОплате") Тогда
			СтрокаСписка.Данные["КОплате"] = ВыборкаОплачено.КОплате;
		КонецЕсли;
		Если СтрокаСписка.Данные.Свойство("Оплачен") Тогда
			СтрокаСписка.Данные["Оплачен"] = ВыборкаОплачено.Оплачен;
		КонецЕсли;
		Если СтрокаСписка.Данные.Свойство("ЧастичноОплачен") Тогда
			СтрокаСписка.Данные["ЧастичноОплачен"] = ВыборкаОплачено.ЧастичноОплачен;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
