&НаКлиенте
Процедура ОтображатьТолькоНеОбработанные()
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
    ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Результат");
    ЭО.ПравоеЗначение=ПолучитьПустойРезультатКонтакта();
    ЭО.Использование=Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьПустойРезультатКонтакта()
	Возврат Справочники.РезультатыКонтактов.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура ОтображатьНеОбработанные(Команда)
	
	ОтображатьТолькоНеОбработанные();

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьВсе(Команда)
	Список.Отбор.Элементы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтображатьТолькоНеОбработанные();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоСегодня(Команда)
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
    ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ПланируемаяДата");
    ЭО.ПравоеЗначение=НачалоДня(ТекущаяДата());
    ЭО.Использование=Истина;
КонецПроцедуры
