
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.СписокПотолков <> Неопределено И ТипЗнч(Параметры.СписокПотолков) = Тип("СписокЗначений") Тогда
		
		Для Каждого ТекущаяСтрока Из Параметры.СписокПотолков Цикл
			
			НоваяСтрока = СписокПотолков.Добавить();
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Значение.Потолок;
			НоваяСтрока.УИСтроки = ТекущаяСтрока.Значение.УИСтроки;
			НоваяСтрока.Отметка = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТолькоОдноЗначение = Параметры.ТолькоОдноЗначение;
	
	Элементы.СписокПотолковКоманднаяПанель.Видимость = НЕ ТолькоОдноЗначение;
	Элементы.СписокПотолковОтметка.Видимость = НЕ ТолькоОдноЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивПотолков = новый Массив;
	
	Для Каждого ТекущаяСтрока Из СписокПотолков Цикл
		
		Если ТекущаяСтрока.Отметка Тогда
			СтруктураСтрокиПотолка = Новый Структура;
			СтруктураСтрокиПотолка.Вставить("Потолок",ТекущаяСтрока.Номенклатура);
			СтруктураСтрокиПотолка.Вставить("УИСтроки",ТекущаяСтрока.УИСтроки);
			МассивПотолков.Добавить(СтруктураСтрокиПотолка);
		КонецЕсли;
		
	КонецЦикла;
	
	
	Если ТолькоОдноЗначение Тогда
		ТекущиеДанные = Элементы.СписокПотолков.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
	    	Сообщить("Необходимо выбрать позицию!", СтатусСообщения.Важное);
		Иначе
			СтруктураСтрокиПотолка = Новый Структура;
			СтруктураСтрокиПотолка.Вставить("Потолок",ТекущиеДанные.Номенклатура);
			СтруктураСтрокиПотолка.Вставить("УИСтроки",ТекущиеДанные.УИСтроки);

			Закрыть(СтруктураСтрокиПотолка);
		КонецЕсли;
	Иначе	
		Если МассивПотолков.Количество() = 0 И НЕ ТолькоОдноЗначение Тогда
			Сообщить("Необходимо выбрать минимум одну позицию!", СтатусСообщения.Важное);
		Иначе
			Закрыть(МассивПотолков);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого ТекущаяСтрока Из СписокПотолков Цикл
		ТекущаяСтрока.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого ТекущаяСтрока Из СписокПотолков Цикл
		ТекущаяСтрока.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокПотолковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СписокПотолков.ТекущиеДанные;
	Если НЕ ТекДанные = неопределено Тогда
		Если ТолькоОдноЗначение Тогда
			СтруктураСтрокиПотолка = Новый Структура;
			СтруктураСтрокиПотолка.Вставить("Потолок",ТекДанные.Номенклатура);
			СтруктураСтрокиПотолка.Вставить("УИСтроки",ТекДанные.УИСтроки);

			Закрыть(СтруктураСтрокиПотолка);

		Иначе
			
			МассивПотолков = новый Массив;

			СтруктураСтрокиПотолка = Новый Структура;
			СтруктураСтрокиПотолка.Вставить("Потолок",ТекДанные.Номенклатура);
			СтруктураСтрокиПотолка.Вставить("УИСтроки",ТекДанные.УИСтроки);
			МассивПотолков.Добавить(СтруктураСтрокиПотолка);
			
			Закрыть(МассивПотолков);

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


