
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВсеПоддерживаемыеМенеджеры = ШтрихкодированиеПечатныхФормКлиентСервер.ВсеПоддерживаемыеМенеджеры();
	
	Для Каждого ПустаяСсылка Из ВсеПоддерживаемыеМенеджеры Цикл
		ТипСсылки = ТипЗнч(ПустаяСсылка);
		ТипДокумента = Строка(ТипСсылки);
		
		МенеджерЗаписи = РегистрыСведений.ИспользованиеШтрихкодированияВПечатныхФормахДокументов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ТипДокумента = ТипДокумента;
		МенеджерЗаписи.Прочитать();
		Если НЕ МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.ТипДокумента = ТипДокумента;
			МенеджерЗаписи.Записать();	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры
