&НаСервере
Процедура ПроверитьИУстановитьПоследнееЗначение(ИмяТаблицы)
	
	КоличествоЗаписейВТаблице = Объект[ИмяТаблицы].Количество();
	Если КоличествоЗаписейВТаблице > 0 Тогда
		Если НЕ Объект[ИмяТаблицы][КоличествоЗаписейВТаблице-1].КоличествоДо = 999999 Тогда
			Объект[ИмяТаблицы][КоличествоЗаписейВТаблице-1].КоличествоДо = 999999;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
		
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
		
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//насильно пропишем последнее значение как самое большое, чтобы избежать ошибок, если пользователь этого не сделал сам
	ПроверитьИУстановитьПоследнееЗначение("Углы");
	ПроверитьИУстановитьПоследнееЗначение("ВырезыApply");
	ПроверитьИУстановитьПоследнееЗначение("Фотопечать");
	ПроверитьИУстановитьПоследнееЗначение("ДлинаШвов");
	ПроверитьИУстановитьПоследнееЗначение("ДлинаПользовательскихШвов");
	ПроверитьИУстановитьПоследнееЗначение("ВнутренниеВырезы");
	ПроверитьИУстановитьПоследнееЗначение("Кривые");
	ПроверитьИУстановитьПоследнееЗначение("ДлинаШвовМногофактурный");
КонецПроцедуры
