&НаСервере
Процедура УстановитьОтборПоКонтрагенту()
	
	Список.Отбор.Элементы.Очистить();
	
	Если НЕ Контрагент.Пустая() Тогда
		ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
		ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Контрагент");
		ЭО.ПравоеЗначение=Контрагент;
		ЭО.Использование=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент = Параметры.Контрагент;
	УстановитьОтборПоКонтрагенту();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	УстановитьОтборПоКонтрагенту();
КонецПроцедуры
