Функция Stringify(СтрJSON) Экспорт
	Возврат СтрЗаменить(СтрJSON,"'","""");
КонецФункции

Функция JSON2URL(ДанныеJSON) Экспорт

	Если Не ЗначениеЗаполнено(ДанныеJSON) Тогда
		Возврат "";
	КонецЕсли;
	
	JSON=ПолучитьДанныеJSON(ДанныеJSON);
	Если JSON=Неопределено Тогда
		Возврат "";
	КонецЕсли; 

	Данные=""; Разделитель="="; РазделительПары="&";
	Для каждого Элемент Из JSON Цикл
		
		Значение=Элемент.Значение;
		Если ТипЗнч(Значение)=Тип("Число") Тогда
			Значение=Формат(Значение,"ЧГ=0");
		КонецЕсли;
		
		Данные=Данные+СофтФонВызовСервера.КодироватьДанныеПакета(Элемент.Ключ)+Разделитель+СофтФонВызовСервера.КодироватьДанныеПакета(Значение)+РазделительПары;
	
	КонецЦикла; 
	
	Данные=Лев(Данные,СтрДлина(Данные)-1);
	
	Возврат Данные;

КонецФункции

Функция URL2JSON(Знач ДанныеURL, ПрочитатьВСоответствие=Ложь) Экспорт

	Если Не ЗначениеЗаполнено(ДанныеURL) Тогда
		Возврат "";
	КонецЕсли;
	
	ДанныеJSON=""; Разделитель="="; РазделительПары="&";
	ТекДанные=ДанныеURL+РазделительПары;
	
	Колво=СтрЧислоВхождений(ТекДанные,РазделительПары);
	Для Индекс=1 ПО Колво Цикл
		
		ПозицияПары=Найти(ТекДанные,РазделительПары);
		Если ПозицияПары>0 Тогда
		
			СтрПары=Лев(ТекДанные,ПозицияПары-1);
			
			Позиция=Найти(СтрПары,Разделитель);
			Если Позиция>0 Тогда
				
				Ключ=Лев(СтрПары,Позиция-1);
				Значение=СофтФонВызовСервера.ДекодироватьДанныеПакета(Сред(СтрПары,Позиция+1));
				
				Если Лев(Значение,1)="{" ИЛИ Лев(Значение,1)="[" Тогда
				
					ДанныеJSON=ДанныеJSON+"'"+Ключ+"':"+Значение+",";
				Иначе
					ДанныеJSON=ДанныеJSON+"'"+Ключ+"':"+"'"+Значение+"',";
				КонецЕсли; 
			
			КонецЕсли;
			
			ТекДанные=Сред(ТекДанные,ПозицияПары+1);
		
		КонецЕсли; 
		
	КонецЦикла; 
	
	ДанныеJSON=Лев(ДанныеJSON,СтрДлина(ДанныеJSON)-1);
	ДанныеJSON=Stringify("{"+ДанныеJSON+"}");
	
	JSON=ПолучитьДанныеJSON(ДанныеJSON, ПрочитатьВСоответствие);
	Если JSON=Неопределено Тогда
		Возврат "";
	КонецЕсли; 
	
	Возврат JSON;

КонецФункции

// Возвращает строковый пакет Asterisk как коллекцию типа "Соответствие" 
//
// Параметры:
//  Данные	- пакет Asterisk
// 
// Возвращаемое значение:
//  Массив	- Соответствие
//
Функция ДанныеВСоответствие(Знач Данные) Экспорт
	
	Массив=Новый Соответствие;
	СтрБуфер=Данные;
	// Пакет может быть завершен CR-ом, без LF-а. Дополним...
	Если Прав(СтрБуфер,1)=Chars.CR Тогда
		СтрБуфер=СтрБуфер+Chars.LF;
	КонецЕсли; 
	
	// переменные для разбора строк
	CRLF=Chars.CR+Chars.LF;
	КолвоСтрок=СтрЧислоВхождений(СтрБуфер,CRLF);
	ДлинаCRLF=СтрДлина(CRLF);
	
	// переменные для разбора ключ-значение, внутри строки
	Разделитель=": ";
	ДлинаРазделителя=СтрДлина(Разделитель);
	
	Для Индекс=1 По КолвоСтрок Цикл
		// выборка строк, разделенных CRLF
		ПозицияCRLF=Найти(СтрБуфер,CRLF);
		ТекСтрока=Лев(СтрБуфер,ПозицияCRLF-1);
		
		// в строке, ключ и значение разделены ": "
		ПозицияРазделителя=Найти(СтрБуфер,Разделитель);
		Ключ=Лев(ТекСтрока,ПозицияРазделителя-1);
		Значение=Сред(ТекСтрока,ПозицияРазделителя+ДлинаРазделителя);
		Если ЗначениеЗаполнено(Ключ) Тогда
			Массив.Вставить(Ключ,Значение);
		КонецЕсли; 
		
		// отрезаем прочитанную часть
		СтрБуфер=Сред(СтрБуфер,ПозицияCRLF+ДлинаCRLF);
		
	КонецЦикла; 
	Массив.Вставить("Пакет",Данные);
	Возврат Массив;
	
КонецФункции

Функция ПолучитьДанныеJSON(ДанныеСобытия, Знач ПрочитатьВСоответствие = Ложь) Экспорт
	
	Результат=Неопределено;
	
	// данные уже структурированы - ничего не делаем
	//Если Не ТипЗнч(ДанныеСобытия)=Тип("Строка") Тогда
	Если ТипЗнч(ДанныеСобытия)=Тип("Структура") ИЛИ ТипЗнч(ДанныеСобытия) = Тип("Соответствие") Тогда
		Возврат ДанныеСобытия;
	КонецЕсли; 
	
	ДанныеСобытия = СокрЛП(ДанныеСобытия);
	// корректность начала пакета
	Если Не Лев(ДанныеСобытия,1)="{" Тогда
		Если Не Лев(ДанныеСобытия,1)="[" Тогда
			Возврат Результат;
		КонецЕсли; 
	КонецЕсли; 
	
	// корректность окончания пакета
	Если Не Прав(ДанныеСобытия,1)="}" Тогда
		Если Не Прав(ДанныеСобытия,1)="]" Тогда
			Возврат Результат;
		КонецЕсли; 
	КонецЕсли; 
	
	//заменим запрещенные строки
	ДанныеСобытия=СтрЗаменить(ДанныеСобытия,"z-flag","zflag");
	
	// чтение из JSON
	Попытка
		ЧтениеJSON=Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ДанныеСобытия);
		#Если НЕ ВебКлиент Тогда
			Результат=ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
		#КонецЕсли
	Исключение
		
		// приведение JavaScript-типа "undefined" к строке
		ДанныеСобытия=СтрЗаменить(ДанныеСобытия,"undefined","""undefined""");
		
		// повторная попытка чтения
		Попытка
			ЧтениеJSON=Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ДанныеСобытия);
			#Если НЕ ВебКлиент Тогда
				Результат=ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
			#КонецЕсли
		Исключение
			Возврат Результат;
		КонецПопытки; 
		
	КонецПопытки; 
	
	Возврат Результат;

КонецФункции

Функция ЕстьНеЦифры(Знач Номер) Экспорт;

	Для Индекс=1 По СтрДлина(Номер) Цикл
		Символ=Сред(Номер,Индекс,1);
		Если Не (КодСимвола(Символ)>47 И КодСимвола(Символ)<58) Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Ложь;

КонецФункции

Функция ЭтоВнутренний_Mango(Номер1,Номер2) Экспорт

	Результат=Ложь;
	
	Флаг1=Найти(Номер1,"@");
	Флаг2=Найти(Номер2,"@");
	
	Результат=(Флаг1 И Флаг2);
	
	Возврат Результат;

КонецФункции

Функция ЭтоВходящий_Mango(Источник,Приемник) Экспорт

	// если в одном из номеров 74994033649, а в другом user6@mirp.mango.ru
	НеЦифрыИсточник=ЕстьНеЦифры(Источник);
	НеЦифрыПриемник=ЕстьНеЦифры(Приемник);
	
	Если НеЦифрыИсточник<>НеЦифрыПриемник Тогда
	
		Если НеЦифрыИсточник Тогда
			Возврат Ложь;
		КонецЕсли; 
	
		Если НеЦифрыПриемник Тогда
			Возврат Истина;
		КонецЕсли; 
	
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

Функция ЗвонокПринят_Mango(Код) Экспорт

	СтрКод=Формат(Код,"ЧГ=0");
	УспешныеОтветы=Новый Массив;
	
	УспешныеОтветы.Добавить("1100");
	УспешныеОтветы.Добавить("1110");
	УспешныеОтветы.Добавить("1120");
	УспешныеОтветы.Добавить("1180");
	УспешныеОтветы.Добавить("1181");
	
	Результат=Не (УспешныеОтветы.Найти(СтрКод)=Неопределено);
	
	Возврат Результат;

КонецФункции

Функция ПолучитьПредставлениеОтветаАТС_Mango(Код) Экспорт

	СтрКод=Формат(Код,"ЧГ=0");
	КраткоеОписание=Новый Соответствие;
	
	КраткоеОписание.Вставить("1100", "Ответ");
	КраткоеОписание.Вставить("1110", "Ответ");
	КраткоеОписание.Вставить("1120", "Ответ");
	КраткоеОписание.Вставить("1180", "Ответ");
	КраткоеОписание.Вставить("1181", "Ответ");
	
	КраткоеОписание.Вставить("1111", "Нет ответа");
	КраткоеОписание.Вставить("1121", "Нет ответа");
	КраткоеОписание.Вставить("1122", "Нет ответа");
	КраткоеОписание.Вставить("1123", "Нет ответа");
	
	Результат=КраткоеОписание.Получить(СтрКод);
	Если Результат=Неопределено Тогда
		Результат="Ошибка";
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

Функция ПолучитьПредставлениеОтветаАТС_Phonet(ОтветАТС) Экспорт
	
	ОписаниеОтвета=Новый Соответствие;
	
	ОписаниеОтвета.Вставить("ANSWERED","Ответ");
	
	ОписаниеОтвета.Вставить(0,		"Ответ");
	ОписаниеОтвета.Вставить(1,		"Нет ответа");
	ОписаниеОтвета.Вставить(2,		"Перегружено направление");
	ОписаниеОтвета.Вставить(3,		"Ошибка");
	ОписаниеОтвета.Вставить(4,		"Занято");
	
	ОписаниеОтвета.Вставить("0",	"Ответ");
	ОписаниеОтвета.Вставить("1",	"Нет ответа");
	ОписаниеОтвета.Вставить("2",	"Перегружено направление");
	ОписаниеОтвета.Вставить("3",	"Ошибка");
	ОписаниеОтвета.Вставить("4",	"Занято");
	
	Результат=ОписаниеОтвета.Получить(ОтветАТС);
	Если Результат=Неопределено Тогда
		Результат="Ошибка";
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

Функция ПолучитьМассивУспешныхОтветов_Phonet() Экспорт

	УспешныеОтветы=Новый Массив;
	УспешныеОтветы.Добавить(0);
	УспешныеОтветы.Добавить("0");
	УспешныеОтветы.Добавить("ANSWERED");
	
	Возврат УспешныеОтветы;
	
КонецФункции

Функция АдресВнешнейСистемыДляВАТС(Таргет, КлючAPI) Экспорт
	
	АдресВС = СтрШаблон("https://api.smartceilings.ru/webhooks?target=%1&apikey=%2",  Таргет, КлючAPI);
	Если Таргет = "beeline" Тогда
		АдресВС = СтрШаблон("https://api.smartceilings.ru/webhooks?apikey=%1&target=%2", КлючAPI, Таргет);	
	КонецЕсли;
	
	Возврат АдресВС;
	
КонецФункции
											
Функция ДатаИзUT(UT, ПреобразовыватьВМестноеВремя = Истина, ПреобразованиеPhonetBeeline = Ложь) Экспорт
	
	// UnixTime -> Дата
	Результат='00010101';
	
	Если ПреобразованиеPhonetBeeline Тогда
		Если ТипЗнч(UT) = Тип("Число") Тогда
			UT = Формат(UT, "ЧГ=0");
		КонецЕсли; 
		UT = Лев(UT, 10);
	КонецЕсли;

	ДатаЧисло=0;
	Попытка
		ДатаЧисло=Число(UT);
	Исключение
	КонецПопытки;
	
	Если ДатаЧисло > 0 Тогда		
		Если ПреобразовыватьВМестноеВремя Тогда
			Результат = МестноеВремя(Дата('19700101000000') + ДатаЧисло);
		Иначе
			 Результат = Дата('19700101000000') + ДатаЧисло;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции
