#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	//// Заполняем счета учета взаиморасчетов
	//ТаблицаСчетов = УчетВзаиморасчетов.ПолучитьТаблицуСчетовУчетаВзаиморасчетов(Истина, Ложь);
	//ТаблицаСчетов.Колонки.СчетРасчетов.Имя = "Счет";
	//ТаблицаСчетов.Колонки.Добавить("УчаствуетВРасчетах", Новый ОписаниеТипов("Булево"));
	//ТаблицаСчетов.ЗаполнитьЗначения(Истина, "УчаствуетВРасчетах");
	//СписокСчетов.Загрузить(ТаблицаСчетов);
	//
	//Если ЗначениеЗаполнено(Контрагент) Тогда
	//	ПредставительКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ОсновноеКонтактноеЛицо");
	//КонецЕсли;
	Если ЗначениеЗаполнено(Организация) Тогда
		ПредставительОрганизации = Документы.АктСверкиВзаиморасчетов.ПредставительОрганизации(Организация);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ТекущаяДатаСеанса());

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли