#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	// №6316 чтобы можно было делать проверку заполненности
	Если ЭтоНовый() Тогда
		СлужебныйУчетБонусовПоДисконтнымКартам = Константы.УчетБонусовПоДисконтнымКартам.Получить();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		НоваяСтрока = Бонусы.Добавить();
		НоваяСтрока.Контрагент = ДанныеЗаполнения.Контрагент;
		НоваяСтрока.ДисконтнаяКарта = ДанныеЗаполнения.ДисконтнаяКарта;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// №6316 проверку заполненности дисконтной карты делаем только при включенной настройке
	Если НЕ СлужебныйУчетБонусовПоДисконтнымКартам Тогда
		Если ПроверяемыеРеквизиты.Найти("Бонусы.ДисконтнаяКарта") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Бонусы.ДисконтнаяКарта"));
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СписаниеБонусов.ДисконтнаяКарта"));
		КонецЕсли;
	КонецЕсли;
	
	//#12518
	Для Индекс = 0 по Бонусы.Количество()-1 Цикл
		СтрокаТабличнойЧасти = Бонусы[Индекс];
		Если СтрокаТабличнойЧасти.Сумма < 0 Тогда
			ТекстСообщения = "Недопустимое (отрицательное) значение в поле ""Сумма""";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Бонусы[" + Формат(Индекс, "ЧГ=0") + "].Сумма", , Отказ);
		КонецЕсли;
	КонецЦикла;
	
	// проверка на дублирующиеся строки для контроля остатков при проведении
	Для Каждого ТекСтрока Из СписаниеБонусов Цикл
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("Контрагент", ТекСтрока.Контрагент);
		СтруктураПоиска.Вставить("ДисконтнаяКарта", ТекСтрока.ДисконтнаяКарта);
		
		РезПоиска = СписаниеБонусов.НайтиСтроки(СтруктураПоиска);
		Если РезПоиска.Количество()  > 1 Тогда
			Сообщить("Обнаружена дублирующаяся строка для позиции: " + ТекСтрока.Контрагент +
			         " (" + ТекСтрока.ДисконтнаяКарта + ")");
			
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр БонусыКонтрагентов
	Движения.БонусыКонтрагентов.Записывать = Истина;
	Для Каждого ТекСтрокаБонусы Из Бонусы Цикл
		Движение = Движения.БонусыКонтрагентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаБонусы.Контрагент;
		Если СлужебныйУчетБонусовПоДисконтнымКартам Тогда
			Движение.ДисконтнаяКарта = ТекСтрокаБонусы.ДисконтнаяКарта;
		КонецЕсли;
		Движение.Сумма = ТекСтрокаБонусы.Сумма;
	КонецЦикла;
	Для Каждого ТекСтрокаБонусы Из СписаниеБонусов Цикл
		
		Контрагент = ТекСтрокаБонусы.Контрагент;
		ДисконтнаяКарта = Справочники.ДисконтныеКарты.ПустаяСсылка();
		Если СлужебныйУчетБонусовПоДисконтнымКартам Тогда
			ДисконтнаяКарта = ТекСтрокаБонусы.ДисконтнаяКарта;
		КонецЕсли;		
		//#13339 
		Если НЕ РегистрыНакопления.БонусыКонтрагентов.КонтрольОстатков(Ссылка, Контрагент, ДисконтнаяКарта, ТекСтрокаБонусы.Сумма) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Движение = Движения.БонусыКонтрагентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.ДисконтнаяКарта = ДисконтнаяКарта;		
		Движение.Сумма = ТекСтрокаБонусы.Сумма;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли