
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НоменклатураПрофиля = Константы.НоменклатураПрофиля.Получить();
	
	Если ЗначениеЗаполнено(Параметры.МассивДляДобавленияПрофиля) Тогда
		Для каждого ЭлементМассива из Параметры.МассивДляДобавленияПрофиля Цикл
		НоваяСтрока = ТаблицаПрофиля.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		НоваяСтрока.Пометка = Истина;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого ТекущаяСтрока Из ТаблицаПрофиля Цикл
		ТекущаяСтрока.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСоВсех(Команда)
	
	Для Каждого ТекущаяСтрока Из ТаблицаПрофиля Цикл
		ТекущаяСтрока.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВДокумент(Команда)
	
	Если НЕ ЗначениеЗаполнено((НоменклатураПрофиля)) Тогда
		Сообщить("Не выбрана номенклатура профиля");
		Возврат;
	Иначе
		ЗапомнитьНоменклатуруПрофиля(); 
	КонецЕсли;
	
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);
		
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьНоменклатуруПрофиля()
	Константы.НоменклатураПрофиля.Установить(НоменклатураПрофиля);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент Тогда
		РезультатВозврата = Новый Массив;
		Для Каждого ТекущаяСтрока Из ТаблицаПрофиля Цикл
			Если ТекущаяСтрока.Пометка Тогда
				НоваяСтрока = Новый Структура("Номенклатура, Количество, Комната", НоменклатураПрофиля, ТекущаяСтрока.Количество, ТекущаяСтрока.Комната);
				РезультатВозврата.Добавить(НоваяСтрока);
			КонецЕсли;	
		КонецЦикла;
		
		ОповеститьОВыборе(РезультатВозврата);	
	КонецЕсли;

КонецПроцедуры
