#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьТаблицОтборов();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Обновление заголовка после сохранения
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьОтборНоменклатурыПриИзменении(Элемент)
	УстановитьДоступностьТаблицОтборовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборКонтрагентовПриИзменении(Элемент)
	УстановитьДоступностьТаблицОтборовНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьТаблицОтборов()
	Элементы.ОтборыНоменклатуры.Доступность     = Объект.ИспользоватьОтборНоменклатуры;
	Элементы.ОтборыНоменклатуры.Видимость     = Объект.ИспользоватьОтборНоменклатуры;
	Элементы.ОтборыКонтрагентов.Доступность     = Объект.ИспользоватьОтборКонтрагентов;
	Элементы.ОтборыКонтрагентов.Видимость     = Объект.ИспользоватьОтборКонтрагентов;
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьТаблицОтборовНаСервере()
	УстановитьДоступностьТаблицОтборов();
КонецПроцедуры

#КонецОбласти