
Процедура ПередЗаписью(Отказ, Замещение)
	
	// #13365 зацикливается на монтажах из-за изменения Периода на Дату выполнения
	Если ТипЗнч(ЭтотОбъект.Регистратор) = Тип("ДокументСсылка.Монтаж") Тогда
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Регистратор, "Проведен, ДатаВыполнения");
		Если РеквизитыДокумента.Проведен И ЗначениеЗаполнено(РеквизитыДокумента.ДатаВыполнения) Тогда
			Для каждого Запись из ЭтотОбъект Цикл				
				Запись.Период = РеквизитыДокумента.ДатаВыполнения;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
