
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	Валюта = Константы.ВалютаУчета.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	Если Объект.РазделятьПоВидамТоваров тогда
		Элементы.ГруппаБезРазделенияПоВидам.Видимость = Ложь;
		Элементы.ГруппаСРазделениемПоВидам.Видимость = Истина;
	Иначе
		Элементы.ГруппаБезРазделенияПоВидам.Видимость = Истина;
		Элементы.ГруппаСРазделениемПоВидам.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаИсключаемыеПозиции.Заголовок = "Исключаемые позиции (" + Объект.ИсключаемыеПозиции.Количество() + ")";
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура РазделятьПоВидамТоваровПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппе(Команда)
	Форма = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбораГруппы", , ЭтаФорма);
	ВыбранноеЗначение = Форма.ОткрытьМодально();
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		Если Объект.ИсключаемыеПозиции.Количество() > 0 Тогда
			Если Вопрос("Очистить табличную часть исключаемых позиций?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				ЗаполнитьТоварыПоГруппеНоменклатуры(ВыбранноеЗначение, Истина);
			Иначе
				ЗаполнитьТоварыПоГруппеНоменклатуры(ВыбранноеЗначение, Ложь);
			КонецЕсли;
		Иначе
			ЗаполнитьТоварыПоГруппеНоменклатуры(ВыбранноеЗначение, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТоварыПоГруппеНоменклатуры(Знач ГруппаНоменклатуры, ОчищатьТаблицуТовары = Ложь)
	
	Если ОчищатьТаблицуТовары Тогда
		Объект.ИсключаемыеПозиции.Очистить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.Родитель В ИЕРАРХИИ(&Родитель)";
	Запрос.УстановитьПараметр("Родитель", ГруппаНоменклатуры);
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		НоваяСтрока = Объект.ИсключаемыеПозиции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗапроса);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключаемыеПозицииПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры
