
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения(Отказ);	
	
КонецПроцедуры

Процедура Движения(Отказ)
	
	// регистр ИА_КвотыСтатистик
	Движения.ИА_КвотыСтатистик.Записывать = Истина;
	Движения.ИА_КвотыСтатистик.Очистить();
	Движение = Движения.ИА_КвотыСтатистик.Добавить();
	Движение.Период = Дата;
	Движение.ВидСтатистики = ВидСтатистики;
	Движение.ПериодДетализации = ПериодДетализации;
	Движение.Аналитика1 = ?(ЗначениеЗаполнено(Аналитика1), Аналитика1, Неопределено);
	Движение.Аналитика2 = ?(ЗначениеЗаполнено(Аналитика2), Аналитика2, Неопределено);
	Движение.Аналитика3 = ?(ЗначениеЗаполнено(Аналитика3), Аналитика3, Неопределено);
	Движение.ТипКвоты = ТипКвоты;
	Движение.Квота = Квота;   
	
КонецПроцедуры

	
