Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр НастройкиКатегорийКонтрагентов
	Движения.НастройкиКатегорийКонтрагентов.Записывать = Истина;
	Для Каждого ТекСтрокаКатегорииПоСуммеПродаж Из КатегорииПоСуммеПродаж Цикл
		Движение = Движения.НастройкиКатегорийКонтрагентов.Добавить();
		Движение.Период = Дата;
		Движение.Категория = ТекСтрокаКатегорииПоСуммеПродаж.Категория;
		Движение.СуммаОт = ТекСтрокаКатегорииПоСуммеПродаж.СуммаОт;
		Движение.СуммаДо = ТекСтрокаКатегорииПоСуммеПродаж.СуммаДо;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

