
Процедура ОбработкаПроведения(Отказ, Режим) Экспорт

	Если НЕ Результат = Справочники.РезультатыКонтактов.Прочее Тогда
		// регистр ВходящиеКонтакты
		Движения.ВходящиеКонтакты.Записывать = Истина;
		Движение = Движения.ВходящиеКонтакты.Добавить();
		Движение.Сотрудник = Ответственный;
		Движение.Дата = Дата;
		Движение.ВидКонтакта = ВидКонтакта;
		Движение.ВходящийКонтакт = Ссылка;
		Движение.РекламныйИсточник = РекламныйИсточник;
		Движение.Результат = Результат;
		
		// регистр КонверсияВходящихКонтактов 
		Движения.КонверсияВходящихКонтактов.Записывать = Истина;
		Движение = Движения.КонверсияВходящихКонтактов.Добавить();
		Движение.Период = Дата;
		Движение.Контакт = Ссылка;
		Движение.РекламныйИсточник = РекламныйИсточник;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.КоличествоЛидов = 1;
	КонецЕсли;
	
	//РегистрСведений КонверсияКонтактов
	

КонецПроцедуры
