#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Параметры
// - РезультатОбработки - структура("Успешно, ОписаниеОшибки")
// - ПоляСвертки - массив
Процедура ОбработатьДокумент_Версия_2_8_25(РезультатОбработки, ДокСсылка, ИмяТЧ, ПоляСвертки) Экспорт
	
	// все в одну транзакцию
	Попытка
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		ПоляСверткиСтрокой = СтрСоединить(ПоляСвертки, ",");
		
		ТаблицаДокумента = ДокОбъект[ИмяТЧ].Выгрузить();
		ТаблицаДокумента.Свернуть(ПоляСверткиСтрокой);
		Для каждого СтрокаТЗ из ТаблицаДокумента Цикл
			НовыйДокОбъект = Документы.ВводОстатков.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовыйДокОбъект, ДокОбъект, "Автор, Комментарий, Дата, ТипОперации");
			// заполняем новые шапочные реквизиты
			Для каждого ПолеСвертки из ПоляСвертки Цикл
				НовыйДокОбъект[СтрЗаменить(ПолеСвертки, "УДАЛИТЬ_", "")] = СтрокаТЗ[ПолеСвертки];
			КонецЦикла;
			НовыйДокОбъект.УстановитьНовыйНомер();
			
			Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.Валюта) Тогда
				НовыйДокОбъект.Валюта = Константы.ВалютаУчета.Получить();
			КонецЕсли;
			
			СтруктураОтбора = Новый Структура(ПоляСверткиСтрокой);
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТЗ);
			
			НайденныеСтроки = ДокОбъект[ИмяТЧ].НайтиСтроки(СтруктураОтбора);
			Для каждого СтрокаТЧ из НайденныеСтроки Цикл
				НоваяСтрока = НовыйДокОбъект[ИмяТЧ].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , ПоляСверткиСтрокой);
				
				// новые реквизиты
				Если ИмяТЧ = "ТоварыНаСкладах" Тогда
					Если НЕ ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) Тогда
						НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
						НоваяСтрока.Коэффициент = 1;
					КонецЕсли;
				КонецЕсли;
		
			КонецЦикла;
			НовыйДокОбъект.Комментарий = НовыйДокОбъект.Комментарий + " #Создан автоматически при обновлении на версию 2.8.25 по документу " + Строка(ДокСсылка);
			НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			
		КонецЦикла;
		
		ДокОбъект.Комментарий = ДокОбъект.Комментарий + " #Отменено при обновлении на версию 2.8.25 по документу " + Строка(ДокСсылка);
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		РезультатОбработки.Успешно = Истина;
	Исключение
		РезультатОбработки.Успешно = Ложь;
		РезультатОбработки.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры
		
#КонецОбласти
		
#КонецЕсли 