
&НаКлиенте
Перем мПредыдущийИдентификатор;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Элементы.АдресМонтажа.Видимость = Ложь;
	Элементы.Контрагент.Видимость = Ложь;
	Элементы.НомерРасчета.Видимость = Ложь;
	Элементы.ВидФайлаПредпросмотраЗаказа.Видимость = Ложь;
	
	Если ПустаяСтрока(Параметры.НачальныйКаталог) Тогда
		НачальныйКаталог = "c:\";
	Иначе
		НачальныйКаталог = Параметры.НачальныйКаталог;
	КонецЕсли;
	
	Если ПустаяСтрока(ВидФайлаПредпросмотраЗаказа) Тогда
		ВидФайлаПредпросмотраЗаказа = "Макет";
	КонецЕсли;
	
	Если Параметры.Свойство("МножественныйВыбор") Тогда
		МножественныйВыбор = Параметры.МножественныйВыбор;	
	КонецЕсли;
	
	Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("Макет", "Макет");
	Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("ЧертежПокупатель", "ЧертежПокупатель");
	
	СтруктураФайлов = ОбменСEasyCeiling.ПолучитьСтруктуруДляЗагрузкиПриложенныхФайловПостроителя();
	Для каждого ЭлементСтруктуры из СтруктураФайлов Цикл
		Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Ключ);
	КонецЦикла;
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFECДляКлиента", "PDFECДляКлиента");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFECДляКлиентаART", "PDFECДляКлиентаART");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFECДляМонтажников", "PDFECДляМонтажников");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFECДляПроизводителяРаскрой", "PDFECДляПроизводителяРаскрой");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFECДляПроизводителяРаскройПоПолотнам", "PDFECДляПроизводителяРаскройПоПолотнам");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFECДляПроизволдителяЕдиныйРаскрой", "PDFECДляПроизволдителяЕдиныйРаскрой");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFECДляПроизводителяРисунок", "PDFECДляПроизводителяРисунок");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFECТаблицаКоординат", "PDFECТаблицаКоординат");
	//
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFNMФакс", "PDFNMФакс");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFNMРисунок", "PDFNMРисунок");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFNMЧертеж", "PDFNMЧертеж");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFNMПолотна", "PDFNMПолотна");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFNMКоординаты", "PDFNMКоординаты");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFNMГарантия", "PDFNMГарантия");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFNMМонтаж", "PDFNMМонтаж");
	//
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFSBДляКлиентаВидСверху", "PDFSBДляКлиентаВидСверху");
	//Элементы.ВидФайлаПредпросмотраЗаказа.СписокВыбора.Добавить("PDFSBДляПроизводителяВидСверху", "PDFSBДляПроизводителяВидСверху");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Элементы.АдресМонтажа.Видимость = Ложь;
	//Элементы.Контрагент.Видимость = Ложь;
	//Элементы.НомерРасчета.Видимость = Ложь;
	
	ПоказыватьТолькоФайлыВыгрузкиИзПостроителя = Истина;
	
	ПоказатьСписокФайловКаталога(НачальныйКаталог);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура МойКомпьютер(Команда)
	
	#Если НЕ ВебКлиент Тогда	
		ПолучитьСписокЛогическихДисков(); //нна
	#Иначе 
		Подключить(Истина);
		//НачатьПомещениеФайла(ПриЗавершении, , ДиалогВыбораФайлов, Истина, , ПередПомещением);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура РабочийСтол(Команда)
	#Если НЕ ВебКлиент Тогда	
		WSS=Новый COMОбъект("WScript.Shell"); //нна
		ПоказатьСписокФайловКаталога(WSS.SpecialFolders().Item("Desktop"));	
	#Иначе
		
		//cmdf5		
		//ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайлаЗавершение", ЭтаФорма);
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Фильтр =  "Конфигурационный файл (*.ini)|*.ini|JSON (*.json)|*.json";
		//    
		//НачатьПомещениеФайлов(ОписаниеОповещения, ДиалогОткрытияФайла,, УникальныйИдентификатор);
		
		Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайлаЗавершение", ЭтотОбъект);
		ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, ДиалогОткрытияФайла);
		
	#КонецЕсли
	
КонецПроцедуры

//cmdf5
&НаКлиенте
Процедура ОбработатьВыборФайлаЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

	Если Не ЗначениеЗаполнено(ПомещенныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ПомещенныеФайлы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокФайлов(Команда)
	
	ПоказатьСписокФайловКаталога(Элементы.ДекорацияТекущийКаталог.Заголовок);
		
КонецПроцедуры

&НаКлиенте
Процедура ПометитьФайлы(Команда)
	
	// #13248
	//Пометка = (Команда.Имя = "ВыделитьВсеФайлы");
	//Для каждого СтрокаТЗ из ТаблицаФайлов Цикл
	//	Если НЕ СтрокаТЗ.ЭтоПапка Тогда
	//		СтрокаТЗ.Выбран = Пометка;
	//	КонецЕсли;
	//	Если НЕ СтрокаТЗ.Тип = ".ini" И СтрокаТЗ.Выбран Тогда
	//		СтрокаТЗ.Выбран = Ложь;
	//	КонецЕсли;
	//КонецЦикла;
	
	ВыделенныеСтроки = Элементы.ТаблицаФайлов.ВыделенныеСтроки;
	ВыделенныеСтроки.Очистить();
	Первый = Истина;
	Для каждого СтрокаТЗ из ТаблицаФайлов Цикл
		Если НЕ СтрокаТЗ.ЭтоПапка И СтрокаТЗ.Тип = ".ini" Тогда
			Если Первый Тогда
				Элементы.ТаблицаФайлов.ТекущаяСтрока = СтрокаТЗ.ПолучитьИдентификатор();
				Первый = Ложь;
			КонецЕсли;
			ВыделенныеСтроки.Добавить(СтрокаТЗ.ПолучитьИдентификатор());			
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыполнитьВыборФайлов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПоказыватьТолькоФайлыВыгрузкиИзПостроителяПриИзменении(Элемент)
	
	ТекущийКаталог = Элементы.ДекорацияТекущийКаталог.Заголовок;	
	ПоказатьСписокФайловКаталога(ТекущийКаталог);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидФайлаПредпросмотраЗаказаПриИзменении(Элемент)
	
	//++ №8265 сразу вызываем обработчик, т.к. вызов активизации не позволит нам добраться до процедуры
	//ТаблицаФайловПриАктивизацииСтроки(Элемент);
	ОбработчикОжиданияТаблицаФайловПриАктивизацииСтроки();
	//-- №8265
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФайлов

&НаКлиенте
Процедура ТаблицаФайловПриАктивизацииСтроки(Элемент)
	
	Если мПредыдущийИдентификатор = Элементы.ТаблицаФайлов.ТекущиеДанные.ПолучитьИдентификатор() Тогда
		Возврат;
	Иначе
		мПредыдущийИдентификатор = Элементы.ТаблицаФайлов.ТекущиеДанные.ПолучитьИдентификатор();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияТаблицаФайловПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияТаблицаФайловПриАктивизацииСтроки()
	
	Элементы.АдресМонтажа.Видимость = Ложь;
	Элементы.Контрагент.Видимость = Ложь;
	Элементы.НомерРасчета.Видимость = Ложь;
	Элементы.ВидФайлаПредпросмотраЗаказа.Видимость = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйФайл=ТаблицаФайлов.НайтиПоИдентификатору(ТекущиеДанные.ПолучитьИдентификатор());
	Если ВыбранныйФайл=Неопределено тогда
		Возврат;
	ИначеЕсли ВыбранныйФайл.Тип = ".ini" ИЛИ ВыбранныйФайл.Тип = ".json" Тогда
		
		Потолок = Неопределено;
		Попытка
			Потолок = ПолучитьСтруктуруФайла(ВыбранныйФайл.ПолноеИмя, ВыбранныйФайл.Тип);
			
			Если НЕ Потолок = Неопределено Тогда
				ЭтаФорма.Элементы.Просмотр.Вид =   ВидПоляФормы.ПолеКартинки;
				ЭтаФорма.Элементы.Просмотр.РазмерКартинки = РазмерКартинки.АвтоРазмер;
				
				Попытка
					//Если Потолок.ЧертежПокупатель <> "" И Потолок.ЧертежПокупатель <> Неопределено Тогда
					Если Потолок[ВидФайлаПредпросмотраЗаказа] <> "" И Потолок[ВидФайлаПредпросмотраЗаказа] <> Неопределено Тогда
						АдресВХ = ПрочитатьФайл(Потолок[ВидФайлаПредпросмотраЗаказа]);
						ЭтаФорма.Просмотр = АдресВХ;
					Иначе
						ЭтаФорма.Просмотр = "";
					КонецЕсли;	
				Исключение
				КонецПопытки;
				
				Если Потолок.Свойство("Адрес") Тогда
					АдресМонтажа = Потолок.Адрес;					
				Иначе
					Попытка
						//АдресМонтажа = Потолок.Потолок_Адрес;
						АдресМонтажа = Потолок.СекцияКонтрагент.АдресМонтажа;
					Исключение
					КонецПопытки;
				КонецЕсли;
				НомерРасчета = Потолок.НомерРасчета;
				
				Если ЗначениеЗаполнено(Потолок.Контрагент) Тогда					
					Контрагент = Потолок.Контрагент;				
				ИначеЕсли Потолок.Свойство("СекцияДилер") Тогда
					Если НЕ ПустаяСтрока(Потолок.СекцияДилер.ПечатаемоеНазвание) Тогда 
						Контрагент = Потолок.СекцияДилер.ПечатаемоеНазвание;
					Иначе
						Контрагент = Потолок.СекцияКонтрагент.Наименование;
					КонецЕсли;
				КонецЕсли;				
				Если НЕ ЗначениеЗаполнено(Контрагент) И Потолок.Свойство("СекцияКонтрагент") Тогда
					Контрагент = Потолок.СекцияКонтрагент.Наименование;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Контрагент) И Потолок.Свойство("Дилер") И ТипЗнч(Потолок.Дилер) = Тип("Структура") Тогда
					Контрагент = Потолок.Дилер.Наименование;
				КонецЕсли;
				
				Элементы.АдресМонтажа.Видимость = Истина;
				Элементы.Контрагент.Видимость = Истина;
				Элементы.НомерРасчета.Видимость = Истина;
				Элементы.ВидФайлаПредпросмотраЗаказа.Видимость = Истина;
				
			КонецЕсли;
		Исключение
			
			ЭтаФорма.Элементы.Просмотр.Вид =   ВидПоляФормы.ПолеТекстовогоДокумента;
			ЭтаФорма.Просмотр = ОписаниеОшибки();
			
		КонецПопытки;
		
	ИначеЕсли ВыбранныйФайл.Тип = ".pdf"  тогда
		
		ЭтаФорма.Элементы.Просмотр.Вид =   ВидПоляФормы.ПолеHTMLДокумента;
		ЭтаФорма.Просмотр = ВыбранныйФайл.ПолноеИмя;

	ИначеЕсли ВыбранныйФайл.Тип = ".txt"  тогда
		//файл выгрузки из построителя. попробуем в нем найти путь к файлу чертежа
		ЭтаФорма.Элементы.Просмотр.Вид =   ВидПоляФормы.ПолеТекстовогоДокумента;
		ТекстовыйФайл = Новый ТекстовыйДокумент;
		ТекстовыйФайл.Прочитать(ВыбранныйФайл.ПолноеИмя);
		ЭтаФорма.Просмотр = ТекстовыйФайл.ПолучитьТекст();
		
	ИначеЕсли ВыбранныйФайл.Тип = ".png"  
		или ВыбранныйФайл.Тип = ".bmp"  
		или ВыбранныйФайл.Тип = ".jpg"  
		или ВыбранныйФайл.Тип = ".jpeg"  
		тогда
		
		ЭтаФорма.Элементы.Просмотр.Вид =   ВидПоляФормы.ПолеКартинки;
		ЭтаФорма.Элементы.Просмотр.РазмерКартинки = РазмерКартинки.АвтоРазмер;
		АдресВХ= ПрочитатьФайл(ВыбранныйФайл.ПолноеИмя);
		ЭтаФорма.Просмотр = АдресВХ;
		
	Иначе
		
		ЭтаФорма.Элементы.Просмотр.Вид =   ВидПоляФормы.ПолеТекстовогоДокумента;
		ЭтаФорма.Просмотр = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыполнитьВыборФайлов();

	//ВыбранныйФайл=ТаблицаФайлов.НайтиПоИдентификатору(Элементы.ТаблицаФайлов.ТекущиеДанные.ПолучитьИдентификатор());
	//Если ВыбранныйФайл=Неопределено тогда
	//	Возврат;
	//ИначеЕсли НЕ ПустаяСтрока(ВыбранныйФайл.ПолноеИмя) И НЕ ВыбранныйФайл.ЭтоПапка тогда
	//	
	//	СписокФайлов = Новый Массив;
	//	Для НомерСтроки = 0 По Элементы.ТаблицаФайлов.ВыделенныеСтроки.Количество()-1 Цикл
	//		Попытка
	//			ВыбранныйФайл = ТаблицаФайлов.НайтиПоИдентификатору(Элементы.ТаблицаФайлов.ВыделенныеСтроки.Получить(НомерСтроки));
	//			Если ВыбранныйФайл = Неопределено тогда
	//				//
	//			ИначеЕсли ВыбранныйФайл.Тип = ".ini"  тогда
	//				СписокФайлов.Добавить(ВыбранныйФайл.ПолноеИмя);
	//			КонецЕсли;
	//			Исключение
	//		КонецПопытки;
	//	КонецЦикла;
	//	Закрыть(СписокФайлов);
	//	
	//Иначе
	//	ПоказатьСписокФайловКаталога(ВыбранныйФайл.ПолноеИмя);
	//КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	// #17200 удаление файла
	ТекущиеДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.ЭтоПапка Тогда
		ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
		ТекстВопроса = СтрШаблон("Вы действительно хотите удалить файл ""%1"" без возможности восстановления?", ТекущиеДанные.Имя);
		ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаФайловУдалениеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловУдалениеЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйФайл = ТаблицаФайлов.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	
	Попытка
		УдалитьФайлы(ВыбранныйФайл.ПолноеИмя);
	Исключение
		ПоказатьПредупреждение(, ОписаниеОшибки());
		Возврат;
	КонецПопытки; 		
	
	ТаблицаФайлов.Удалить(ВыбранныйФайл);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
 	Если ТекущиеДанные.Выбран И НЕ ТекущиеДанные.Тип = ".ini" Тогда
		ТекущиеДанные.Выбран = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	//#13248	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаФайловВыбран.Имя);
	
	ГруппаЭлементовОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаФайлов.ЭтоПапка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаФайлов.Тип");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = ".ini";

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);

КонецПроцедуры	

&НаКлиенте
Процедура ПолучитьСписокЛогическихДисков()
	
	ТаблицаФайлов.Очистить();
	#Если НЕ ВебКлиент Тогда	
		ИмяКомпьютера = ИмяКомпьютера(); //нна	
	#Иначе
		ИмяКомпьютера = ннаАдаптацияВебКлиента.ИмяКомпьютераСервер();	
	#КонецЕсли
	 
	ServicesSet = ПолучитьCOMОбъект("winmgmts:\\" + ИмяКомпьютера + "\root\cimv2");
	MyItems = ServicesSet.ExecQuery("Select * From Win32_LogicalDisk");// WHERE DriveType=2""");
	Для Каждого MyItem Из MyItems Цикл		
		Имя = ""; ОбщийРазмер = "";	Тип = "";  СвободноеМесто = ""; ПолныйПуть = "";		
		For Each objClassProperty In MyItem.Properties_ Цикл
			Если objClassProperty.Name = "Name" Тогда				
				Имя = Лев(objClassProperty.value,Найти(objClassProperty.value,":")-1);				
			ИначеЕсли objClassProperty.Name = "Caption" Тогда				
				ПолныйПуть = objClassProperty.value;				
			ИначеЕсли objClassProperty.Name = "Size" Тогда					
				Если objClassProperty.value = null Тогда					
					ОбщийРазмер = "";					
				Иначе						
					ОбщийРазмер = Строка(Окр(Число(objClassProperty.value)/1000000000)) + " Гб";
				КонецЕсли;					
			ИначеЕсли objClassProperty.Name = "Description" Тогда					
				Тип = objClassProperty.value;				
			ИначеЕсли objClassProperty.Name = "FreeSpace" Тогда					
				Если objClassProperty.value = null Тогда					
					СвободноеМесто = "";					
				Иначе						
					СвободноеМесто = Строка(Окр(Число(objClassProperty.value)/1000000000)) + " Гб";					
				КонецЕсли;					
			КонецЕсли;			
		КонецЦикла;
		
		НоваяСтрока = ТаблицаФайлов.Добавить();
		НоваяСтрока.Имя = "Диск "+Имя + " (Свободно:"+СвободноеМесто+")";
		НоваяСтрока.Тип = Тип;
		НоваяСтрока.Размер= ОбщийРазмер;
		НоваяСтрока.ПолноеИмя = ПолныйПуть;//+"/"; // заранее поставим чтоб переходы работали
		НоваяСтрока.Картинка=БиблиотекаКартинок.ЖесткийДиск32;
		НоваяСтрока.ЭтоПапка=Истина;	
	КонецЦикла;		

КонецПроцедуры

&НаКлиенте
Функция ПрочитатьФайл(ПолноеИмяФайла)
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	АдресВХ = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор());
	Возврат АдресВХ;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруФайла(ПолноеИмяФайла, РасширениеФайла)
	
	Потолок = Новый Структура;
		
	СтруктураФайлов = ОбменСEasyCeiling.ПолучитьСтруктуруДляЗагрузкиПриложенныхФайловПостроителя();
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Потолок, СтруктураФайлов);
	
	Потолок.Вставить("ЧертежПокупатель", 						""); 
	Потолок.Вставить("НомерРасчета", 							"");
	Потолок.Вставить("Макет",		 							""); //++ №8265
	Потолок.Вставить("Контрагент",                              "");
	
	Потолок.Вставить("Адрес",                              "");
	Потолок.Вставить("Дилер",                              );
	
	СекцияКонтрагент = Новый Структура;
	СекцияКонтрагент.Вставить("Наименование","");
	СекцияКонтрагент.Вставить("АдресМонтажа","");
	Потолок.Вставить("СекцияКонтрагент", СекцияКонтрагент);
	
	СекцияДилер = Новый Структура;
	СекцияДилер.Вставить("ПечатаемоеНазвание","");
	Потолок.Вставить("СекцияДилер", СекцияДилер);
	
	СтруктураФайла = ОбменСПостроителемКлиентСервер.ПрочитатьФайлПостроителя(ПолноеИмяФайла);
	
	Если РасширениеФайла = ".json" Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Потолок, СтруктураФайла, Истина);
		Для Каждого КлючЗначение Из СтруктураФайла Цикл				
			Если Потолок.Свойство(КлючЗначение.Ключ) Тогда
				Потолок.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЕсли;	
		КонецЦикла;
		
	ИначеЕсли РасширениеФайла = ".ini" Тогда
		ТекущаяСекция = "";
		Для каждого КлючЗначениеСтруктуры из СтруктураФайла Цикл
			СписокЭлементовСекцииФайла = КлючЗначениеСтруктуры.Значение;
			Если НЕ ТипЗнч(СписокЭлементовСекцииФайла) = Тип("СписокЗначений") Тогда
				Продолжить;
			КонецЕсли;
			
			Если Потолок.Свойство("Секция" + КлючЗначениеСтруктуры.Ключ) Тогда
				ТекущаяСекция = "Секция" + КлючЗначениеСтруктуры.Ключ;
			Иначе
				ТекущаяСекция = "";
			КонецЕсли;
				
			// перебор элементов списка
			Для каждого ЭлементСписка из СписокЭлементовСекцииФайла Цикл
				Если ПустаяСтрока(ЭлементСписка.Значение) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПустаяСтрока(ТекущаяСекция) Тогда
					Если Потолок.Свойство(ЭлементСписка.Значение) Тогда
						Потолок.Вставить(ЭлементСписка.Значение, ЭлементСписка.Представление);
					КонецЕсли;
				Иначе
					Если Потолок[ТекущаяСекция].Свойство(ЭлементСписка.Значение) Тогда
						Потолок[ТекущаяСекция].Вставить(ЭлементСписка.Значение, ЭлементСписка.Представление);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат Потолок;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСписокФайловКаталога(ПолныйПуть)
	
	Элементы.ДекорацияТекущийКаталог.Заголовок = ПолныйПуть;
	
	Если Не ЗначениеЗаполнено(ПолныйПуть) тогда
		ПолучитьСписокЛогическихДисков();
		Возврат;
	КонецЕсли;
	
	ТаблицаФайлов.Очистить();	
	
	// строка возврата в предыдущий каталог
	НоваяСтрока = ТаблицаФайлов.Добавить();
	НоваяСтрока.Имя = "...";
	НоваяСтрока.Размер= "Папка";
	НоваяСтрока.ПолноеИмя = ПолучитьРодителя(ПолныйПуть);
	НоваяСтрока.Картинка=БиблиотекаКартинок.Выбрать;
	НоваяСтрока.ЭтоПапка=Истина; 
	
	#Если НЕ ВебКлиент Тогда	
		МассивВсехФайлов = НайтиФайлы(ПолныйПуть,"*"); //нна	
	#Иначе
		//МассивВсехФайлов = НайтиФайлы(ПолныйПуть,"*");
		МассивВсехФайлов = Новый Массив;
	#КонецЕсли
		
	
	// нужна группировка и сортировка
	СписокКаталогов=Новый СписокЗначений;
	СписокФайлов=Новый СписокЗначений;
	
	Для каждого Файл из  МассивВсехФайлов цикл
			Попытка
				Если Файл.ЭтоКаталог() тогда
					СписокКаталогов.Добавить(Файл,Файл.Имя);
				Иначе
					СписокФайлов.Добавить(Файл,Файл.Имя);
				конецЕсли;
			Исключение
			КонецПопытки;
	КонецЦикла;
	
	СписокКаталогов.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	СписокФайлов.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
	Для каждого Файл из  СписокФайлов цикл
		СписокКаталогов.Добавить(Файл.Значение);
	КонецЦикла;	
		
	Для каждого Файл из  СписокКаталогов цикл		
		Если НЕ Файл.Значение.ЭтоКаталог() и ПоказыватьТолькоФайлыВыгрузкиИзПостроителя и НЕ (Файл.Значение.Расширение = ".ini" Или Файл.Значение.Расширение = ".json") Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаФайлов.Добавить();
		НоваяСтрока.Имя = Файл.Значение.Имя;
		НоваяСтрока.Тип = ?(Файл.Значение.ЭтоКаталог(),"",Файл.Значение.Расширение);
		НоваяСтрока.Размер= ?(Файл.Значение.ЭтоКаталог(),"Папка",Строка(Файл.Значение.Размер()));
		НоваяСтрока.Дата = Файл.Значение.ПолучитьВремяИзменения();
		НоваяСтрока.ПолноеИмя = СтрЗаменить(Файл.Значение.ПолноеИмя,"\","/");
		Если Файл.Значение.ЭтоКаталог() Тогда
			НоваяСтрока.Картинка = БиблиотекаКартинок.Папка;
		ИначеЕсли НоваяСтрока.Тип = ".ini" Тогда
			НоваяСтрока.Картинка = БиблиотекаКартинок.Шестеренки;
		ИначеЕсли НоваяСтрока.Тип = ".json" Тогда
			НоваяСтрока.Картинка = БиблиотекаКартинок.ФорматJSON;
		ИначеЕсли НоваяСтрока.Тип = ".pdf" Тогда
			НоваяСтрока.Картинка = БиблиотекаКартинок.ФорматPDF;
		ИначеЕсли	НоваяСтрока.Тип = ".png"  
			или НоваяСтрока.Тип = ".bmp"  
			или НоваяСтрока.Тип = ".jpg"  
			или НоваяСтрока.Тип = ".jpeg"  
			Тогда
			НоваяСтрока.Картинка = БиблиотекаКартинок.ФорматPNG;
		ИначеЕсли	НоваяСтрока.Тип = ".xls"  
			или НоваяСтрока.Тип = ".xlsx"  
			Тогда
			НоваяСтрока.Картинка = БиблиотекаКартинок.ФорматExcel2007;
		ИначеЕсли	НоваяСтрока.Тип = ".doc"  
			или НоваяСтрока.Тип = ".docx"  
			Тогда
			НоваяСтрока.Картинка = БиблиотекаКартинок.ФорматWord2007;
		Иначе
			НоваяСтрока.Картинка = БиблиотекаКартинок.ФорматПустой;
		КонецЕсли;
		НоваяСтрока.ЭтоПапка=?(Файл.Значение.ЭтоКаталог(),Истина,Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте	
Функция ПолучитьРодителя(ПолныйПуть)
	
	Родитель="";
	МассивКаталогов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолныйПуть,"/");
	ц=0;
	Пока ц+1<МассивКаталогов.Количество() цикл		
		Родитель=Родитель+?(Родитель="","","/")+МассивКаталогов[ц];
		ц=ц+1;
	КонецЦикла;
	
	Возврат Родитель;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьВыборФайлов()
	
	МассивФайлов = Новый Массив;
	
	ТекущиеДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// #13248 схема с пометками
	//Для каждого СтрокаТЗ из ТаблицаФайлов Цикл
	//	Если СтрокаТЗ.Выбран И СтрокаТЗ.Тип = ".ini"  тогда
	//		МассивФайлов.Добавить(СтрокаТЗ.ПолноеИмя);
	//	КонецЕсли;	
	//КонецЦикла;
	//
	//Если НЕ МассивФайлов.Количество() = 0 Тогда
	//	Закрыть(МассивФайлов);
	//КонецЕсли;	
	
	ВыбранныйФайл = ТаблицаФайлов.НайтиПоИдентификатору(ТекущиеДанные.ПолучитьИдентификатор());
	Если ВыбранныйФайл = Неопределено тогда
		Возврат;
		
	ИначеЕсли НЕ ПустаяСтрока(ВыбранныйФайл.ПолноеИмя) И НЕ ВыбранныйФайл.ЭтоПапка тогда
		
		Для НомерСтроки = 0 По Элементы.ТаблицаФайлов.ВыделенныеСтроки.Количество()-1 Цикл
			Попытка
				ВыбранныйФайл = ТаблицаФайлов.НайтиПоИдентификатору(Элементы.ТаблицаФайлов.ВыделенныеСтроки.Получить(НомерСтроки));
				
				Если ВыбранныйФайл = Неопределено Тогда
					//
				ИначеЕсли ВыбранныйФайл.Тип = ".ini" Или ВыбранныйФайл.Тип = ".json" Тогда
					МассивФайлов.Добавить(ВыбранныйФайл.ПолноеИмя);
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Если НЕ МножественныйВыбор Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Закрыть(МассивФайлов);
		
	Иначе
		ПоказатьСписокФайловКаталога(ВыбранныйФайл.ПолноеИмя);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ПоместитьФайлКомандаЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	//Сообщить("Результат выбора: " + Результат);
	//Сообщить("Адрес в хранилище: " + Адрес);
	//Сообщить("Выбранное имя файла: " + ВыбранноеИмяФайла);
	
	ТаблицаФайлов.Очистить();
	НоваяСтрока = ТаблицаФайлов.Добавить();
	НоваяСтрока.Имя = ВыбранноеИмяФайла;
	МассивСтр = СтрРазделить(ВыбранноеИмяФайла,".");
	НоваяСтрока.Тип = "." + МассивСтр[МассивСтр.ВГраница()];
	НоваяСтрока.ПолноеИмя = Адрес + "/" + ВыбранноеИмяФайла;

КонецПроцедуры

&НаКлиенте
Процедура ПоместитьФайлКомандаПередПомещением(ПомещаемыйФайл, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт
    Если ПомещаемыйФайл.Размер() > 5*1024*1024 Тогда
        ПоказатьПредупреждение(, "Превышен максимальный размер файла");
        ОтказОтПомещенияФайла = Истина;
    КонецЕсли;
КонецПроцедуры  

//&НаКлиенте
//Процедура ВыполнитьПослеОкончания(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
//	ВыбранныйФайл = ВыбранныеФайлы[0];
//	
//	ТаблицаФайлов.Очистить();
//	НоваяСтрока = ТаблицаФайлов.Добавить();
//	НоваяСтрока.Имя = ВыбранныйФайл;
//	МассивСтр = СтрРазделить(ВыбранныйФайл,".");
//	НоваяСтрока.Тип = "." + МассивСтр[МассивСтр.ВГраница()];
//	НоваяСтрока.ПолноеИмя = ВыбранныйФайл;

//КонецПроцедуры


&НаКлиенте
Процедура Подключить(УстановитьЕслиНеПодключено) Экспорт
	НачатьПодключениеРасширенияРаботыСФайлами(
	Новый ОписаниеОповещения( "ПослеПодключения", ЭтотОбъект, УстановитьЕслиНеПодключено));
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключения(Подключено,УстановитьЕслиНеПодключено) Экспорт
	Если Подключено Тогда 
		ПриЗавершении = Новый ОписаниеОповещения("ПоместитьФайлКомандаЗавершение", ЭтотОбъект);
		ПередПомещением = Новый ОписаниеОповещения("ПоместитьФайлКомандаПередПомещением", ЭтотОбъект);
		
		ДиалогВыбораФайлов = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбораФайлов.Заголовок = "Выбор файла для помещения";
		ДиалогВыбораФайлов.МножественныйВыбор = Ложь; 
		ДиалогВыбораФайлов.Показать(Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект)); // Пользовательская служенная процедура 
	ИначеЕсли УстановитьЕслиНеПодключено Тогда
		НачатьУстановкуРасширенияРаботыСФайлами(
		Новый ОписаниеОповещения( "Подключить",ЭтотОбъект, Ложь));
	Иначе           
		ВызватьИсключение "Не удалось подключить расширение работы с файлами!";
	КонецЕсли;    
КонецПроцедуры





