
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//ПараметрТипДокумента = Неопределено;
	//Для каждого ПараметрЭлемент из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//	Если ТипЗнч(ПараметрЭлемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//		Если ПараметрЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("ТипДокумента") Тогда
	//			ПараметрТипДокумента = ПараметрЭлемент;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//ПараметрОтбор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипДокументаОтбор"));
	//ПараметрОтбор.Значение = Неопределено;
	//
	//Если НЕ ПараметрТипДокумента = Неопределено И ПараметрТипДокумента.Использование Тогда
	//	ПараметрОтбор.Значение = ПараметрТипДокумента.Значение;
	//КонецЕсли;
	
КонецПроцедуры
