
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат 
	КонецЕсли;
	
	ИспПодр			    = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	ФППоТБ              = ИА_ФП_ПовторИсп.ФП_по_ТБ(дата);
	
	Если не ИспПодр Тогда
		очиститьПодразделение(ВидыДоходов);
		очиститьПодразделение(ОтложенныйДоход);
		очиститьПодразделение(ДоходыИтого);
		очиститьПодразделение(Политика1);
		очиститьПодразделение(Политика2);
		очиститьПодразделение(Маржа);
		очиститьПодразделение(УчредительскиеФонды);
		очиститьПодразделение(ИтогоКЗаливке);
		очиститьПодразделение(Расчет);
	КонецЕсли;
	
	// проверки
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если не (ИА_ПраваС.ЗначениеПраваТекПользователя("УтверждениеТБ") ИЛИ ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_ПолныеПрава")) Тогда
			Сообщить("У вас нет прав на проведение или отмену проведения ТБ. Должно быть право ""Может утверждать ТБ""");
			отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_ФинансовоеПланирование.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ИА_ФинансовоеПланирование КАК ИА_ФинансовоеПланирование
		               |ГДЕ
		               |	ИА_ФинансовоеПланирование.Проведен
		               |	И ИА_ФинансовоеПланирование.МесяцТБ = &МесяцТБ
		               |	И ИА_ФинансовоеПланирование.Организация = &Организация";
		Запрос.УстановитьПараметр("МесяцТБ", Месяц); 
		Запрос.УстановитьПараметр("Организация", Организация);
		Выборка = запрос.Выполнить().Выбрать();
		
		Если выборка.Следующий() Тогда
			Сообщить("В указанном месяце уже есть проведенные ФП! Сначала нужно отменить проведение ФП!"); 
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ФППоТБ Тогда
			Запрос = новый запрос;
			запрос.Текст = "ВЫБРАТЬ
			               |	ИА_ФП_Настройка.Ссылка
			               |ИЗ
			               |	Документ.ИА_ФП_Настройка КАК ИА_ФП_Настройка
			               |ГДЕ
			               |	ИА_ФП_Настройка.Месяц = &Месяц
			               |	И ИА_ФП_Настройка.Проведен
			               |	И ИА_ФП_Настройка.Ссылка <> &Ссылка
			               |	И ИА_ФП_Настройка.Организация = &Организация";
			Запрос.УстановитьПараметр("Месяц", Месяц);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("Организация", Организация);
			Выборка = запрос.Выполнить().Выбрать();
			
			Если выборка.Следующий() Тогда
				Сообщить("На данный месяц уже есть расчет ТБ: " + выборка.ссылка);
				Отказ = истина;
				возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		///// проверка отложенного дохода	
		// подготовка таблицы отложенного дохода
		тзОтложДок = ОтложенныйДоход.Выгрузить();
		тзОтложДок.Свернуть("ТипОперации,Подразделение, ВидДохода", "Сумма");
		Для каждого стрОтлож из тзОтложДок Цикл
			Если стрОтлож.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить Тогда
				стркиДох = ВидыДоходов.НайтиСтроки(Новый Структура("Подразделение,ВидДохода",стрОтлож.Подразделение,стрОтлож.ВидДохода));
				Дох = 0;
				Если стркиДох.Количество() > 0 Тогда
					Дох = стркиДох[0].Сумма;
				КонецЕсли;
				
				Если стрОтлож.Сумма > Дох Тогда
					Сообщить("Доход "+стрОтлож.ВидДохода+" не должен быть отрицательным. Отложенный доход больше самого дохода!");
					Отказ = истина;
					возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если не Проведен Тогда
			ДатаПроведения = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	//
	
    ИсточникЗаполнения = Новый Соответствие;
    Для каждого Стр Из ВидыДоходов Цикл
    	ИсточникЗаполнения.Вставить(Стр.ИДСтроки, Стр.ВидДохода);
    КонецЦикла;   
    
    Для каждого Стр Из Политика1 Цикл
    	Стр.ВидДохода = ИсточникЗаполнения [Стр.ИДСтроки]; 
    КонецЦикла;  
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ФППоТБ              = ИА_ФП_ПовторИсп.ФП_по_ТБ(дата);
	ИспПодр			    = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	
	Если Константы.ИА_ФП_ИспользоватьРазделыПолитики.Получить() ТОгда
		ПроверяемыеРеквизиты.Добавить("Политика1.Раздел");
		ПроверяемыеРеквизиты.Добавить("Политика2.Раздел");
	КонецЕсли;
	
	Если ФППоТБ ТОгда
		ПроверяемыеРеквизиты.Добавить("Месяц");
	КонецЕсли;
	
	Если ИспПодр ТОгда
		ПроверяемыеРеквизиты.Добавить("Политика1.Подразделение");
		ПроверяемыеРеквизиты.Добавить("Политика2.Подразделение");
		ПроверяемыеРеквизиты.Добавить("УчредительскиеФонды.Подразделение");
		ПроверяемыеРеквизиты.Добавить("Расчет.Подразделение");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ФППоОрганизациям    = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ИспПодр			    = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	ФППоТБ              = ИА_ФП_ПовторИсп.ФП_по_ТБ(дата);

	
	коэф = (ДатаКонца - ДатаНачала) / (60*60*24) + 1;
	тзНедели = ИА_ФПСервер.ПолучитьНедели(Месяц);
	
	Движения.КСУ_ПорядокРаспределенияПоФондам.Записывать = Истина;
	Движения.КСУ_ПорядокРаспределенияПоФондам.Очистить();
	
	Движения.КСУ_РаспределениеТБ.Записывать = Истина;
	Движения.КСУ_РаспределениеТБ.Очистить();
	
	Движения.КСУ_ЗаливкаПолитики1.Записывать = Истина;
	Движения.КСУ_ЗаливкаПолитики1.Очистить();
	
	Движения.КСУ_РаспределениеДоходовТБ.Записывать = Истина;
	Движения.КСУ_РаспределениеДоходовТБ.Очистить();
	
	Движения.КСУ_ПравилоУчредительскихФондов.Записывать = Истина;
	Движения.КСУ_ПравилоУчредительскихФондов.Очистить();
	
	Движения.КСУ_УчредительскиеФонды.Записывать = Истина;
	Движения.КСУ_УчредительскиеФонды.Очистить();
	
	Движения.КСУ_ПланФактМаржинальнойПрибыли.Записывать = Истина;
	Движения.КСУ_ПланФактМаржинальнойПрибыли.Очистить();
	
	// доходы
	ИстДоходов = ВидыДоходов;
	
	Для Каждого стрДоход Из ИстДоходов Цикл
		
		счНед = 1;
		Для каждого нед из тзНедели Цикл
			Движение = Движения.КСУ_РаспределениеДоходовТБ.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Неделя = нед.НачалоНедели;
			Если ФППоОрганизациям Тогда
				Движение.Организация = Организация;
			КонецЕсли;
			Движение.ВидДохода = стрДоход.ВидДохода;
			Движение.Подразделение = стрДоход.Подразделение;	
			//Движение.Сумма = стрДоход.Сумма*нед.КолДней/коэф;			
			Движение.Сумма = стрДоход["Неделя"+счНед];
			счНед = счНед + 1;
		КонецЦикла;
	КонецЦикла;
	
	// политика 1
	Политика1тз = Политика1.Выгрузить();
	Политика1тз.Свернуть("Подразделение,Статья,ВидДохода","Сумма, Неделя1, Неделя2, Неделя3, Неделя4, Неделя5, Неделя6, Неделя7, Неделя8, Неделя9, Неделя10, Неделя11, Неделя12");
	
	Для Каждого ТекП1 Из Политика1тз Цикл
		счНед = 1;
		Для каждого нед из тзНедели Цикл
			Движение = Движения.КСУ_ЗаливкаПолитики1.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Неделя = нед.НачалоНедели;
			Если ФППоОрганизациям Тогда
				Движение.Организация = Организация;
			КонецЕсли;
			Движение.Подразделение = ТекП1.Подразделение;
			Движение.Фонд = ТекП1.Статья;
			Движение.ВидДохода = ТекП1.ВидДохода;
			
			//Движение.Сумма = ТекП1.Сумма*нед.КолДней/коэф;
			Движение.Сумма = ТекП1["Неделя"+счНед];
			счНед = счНед + 1;
		КонецЦикла;		
	КонецЦикла;

	Политика1тз.Свернуть("Подразделение,Статья");
	счС= 1;
	Для Каждого ТекП1 Из Политика1тз Цикл		
		Движение = Движения.КСУ_ПорядокРаспределенияПоФондам.Добавить();
		Движение.Период = Дата;
		Если ФППоОрганизациям Тогда
			Движение.Организация = Организация;
		КонецЕсли;
		Движение.Подразделение = ТекП1.Подразделение;
		Движение.Фонд = ТекП1.Статья;
		Движение.Порядок = счС;
		Движение.НомерПолитики = 1;
		
		счС = счС + 1;
	КонецЦикла;
	
	// маржа
	Для каждого стр из Маржа цикл
		счНед = 1;
		Для каждого нед из тзНедели Цикл
					
			Движение = Движения.КСУ_ПланФактМаржинальнойПрибыли.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Месяц = Месяц;
			Движение.Неделя = нед.НачалоНедели;
			Движение.Сумма = стр["Неделя"+счНед];
			
			счНед = счНед + 1;
		КонецЦикла;
	КонецЦикла;
	
	
	// учредительские фонды
	счС = 1;
	Для Каждого уф Из УчредительскиеФонды Цикл		
		Движение = Движения.КСУ_ПравилоУчредительскихФондов.Добавить();
		Движение.Месяц = Месяц;
		Если ФППоОрганизациям Тогда
			Движение.Организация = Организация;
		КонецЕсли;
		Движение.Подразделение = уф.Подразделение;
		Движение.Фонд = уф.Фонд;
		Движение.Процент = уф.Процент;
		
		счНед = 1;
		Для каждого нед из тзНедели Цикл
			Движение = Движения.КСУ_УчредительскиеФонды.ДобавитьПриход();
			Движение.Период = Дата;
			Если ФППоОрганизациям Тогда
				Движение.Организация = Организация;
			КонецЕсли;
			Движение.Неделя = нед.НачалоНедели;;
			
			Движение.Подразделение = уф.Подразделение;
			Движение.Фонд = уф.Фонд;
			Движение.Сумма = уф["Неделя" + счНед];
			
			счНед = счНед + 1;
		КонецЦикла;
		
		Движение = Движения.КСУ_ПорядокРаспределенияПоФондам.Добавить();
		Движение.Период = Дата;
		Если ФППоОрганизациям Тогда
			Движение.Организация = Организация;
		КонецЕсли;
		Движение.Подразделение = уф.Подразделение;
		Движение.Фонд = уф.Фонд;
		Движение.Порядок = счС;
		Движение.НомерПолитики = 3;

		счС = счС + 1;
	КонецЦикла;
	
	// заливка
	Для Каждого ТекСтрокаРасчет Из Расчет Цикл
		счНед = 1;
		Для каждого нед из тзНедели Цикл
			Движение = Движения.КСУ_РаспределениеТБ.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Неделя = нед.НачалоНедели;			
			Если ФППоОрганизациям Тогда
				Движение.Организация = Организация;
			КонецЕсли;
			Движение.Подразделение = ТекСтрокаРасчет.Подразделение;
			Движение.Фонд = ТекСтрокаРасчет.Фонд;
			//Движение.Сумма = ТекСтрокаРасчет.Сумма*нед.КолДней/коэф;
			Движение.Сумма = ТекСтрокаРасчет["Неделя"+счНед];
			
			счНед = счНед + 1;
		КонецЦикла;
		
		Движение = Движения.КСУ_ПорядокРаспределенияПоФондам.Добавить();
		Движение.Период = Дата;
		Если ФППоОрганизациям Тогда
			Движение.Организация = Организация;
		КонецЕсли;
		Движение.Подразделение = ТекСтрокаРасчет.Подразделение;
		Движение.Фонд = ТекСтрокаРасчет.Фонд;
		Движение.НомерПолитики = 2;
		Движение.Порядок = счС + ТекСтрокаРасчет.НомерСтроки;
	КонецЦикла;
	
	
	Если не ИспПодр Тогда
		очиститьПодразделение(Движения.КСУ_ПорядокРаспределенияПоФондам);
		очиститьПодразделение(Движения.КСУ_ПравилоУчредительскихФондов);
		очиститьПодразделение(Движения.КСУ_РаспределениеТБ);
		очиститьПодразделение(Движения.КСУ_ЗаливкаПолитики1);
		очиститьПодразделение(Движения.КСУ_УчредительскиеФонды);
		очиститьПодразделение(Движения.КСУ_РаспределениеДоходовТБ);
	КонецЕсли;
КонецПроцедуры

Процедура очиститьПодразделение(дв)
	для каждого стр из дв Цикл
		стр.Подразделение = Справочники.ИА_ЦФО.ПустаяСсылка();
	КонецЦикла;
КонецПроцедуры
	
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = прав(год(Дата),2)+".";
КонецПроцедуры
