&НаКлиенте
Процедура Отчеты(Команда)
	сп = новый СписокЗначений;
	сп.Добавить("КСУ_НезакрытыеЗаказы","Незакрытые заказы");
	сп.Добавить("КСУ_РасходыПоПодразделениям","Расходы по подразделениям");	
	сп.Добавить("КСУ_ДвиженияПоФондам","Движение по фондам");
	сп.Добавить("КСУ_СостояниеФондов","Остатки на счетах и фондах");
		
	оп = новый ОписаниеОповещения("ВыбОтчет", ЭтотОбъект);
	ПоказатьВыборИзСписка(оп, сп, Элементы.Декорация6);
КонецПроцедуры

&НаКлиенте
Процедура ВыбОтчет(выбЗн, ДопПарам) Экспорт
	Если выбЗн <> Неопределено Тогда
		ОткрытьФорму("Отчет."+выбЗн.Значение+".Форма");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	тд = Элементы.Список.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	Если поле = Элементы.ПредставлениеЗаказов тогда
		Если тд.ПредставлениеЗаказов<>"" тогда
			СтандартнаяОбработка = ложь;
			
			СписокЗаказов = ПолучитьСписокЗаказов(тд.ссылка);
			Если СписокЗаказов.Количество() = 1 тогда
				ПоказатьЗначение(, СписокЗаказов[0]);
			Иначе
				сп = Новый СписокЗначений;
				сп.ЗагрузитьЗначения(СписокЗаказов);
				
				ОпОп = новый ОписаниеОповещения("ВыборРег", ЭтотОбъект);
				ПоказатьВыборИзСписка(ОпОп, сп);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВыборРег(ВыбЗн, дп) Экспорт
	если ВыбЗн<>Неопределено Тогда
		ПоказатьЗначение(, ВыбЗн.Значение);
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСписокЗаказов(рег)
	возврат рег.иа_ЗаказыНаПриобретение.выгрузитьКолонку("ЗП");
КонецФункции

&НаКлиенте
Процедура КомандаПоказатьПомеченные(Команда)
	Элементы.КомандаПоказатьПомеченные.Пометка = не Элементы.КомандаПоказатьПомеченные.Пометка;
	
	УстОтборПомеченных(Элементы.КомандаПоказатьПомеченные.Пометка);
КонецПроцедуры

&НаСервере
Процедура УстОтборПомеченных(ТекЗн)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ТекЗн);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ложь);
КонецПроцедуры
