
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();	
	УстановитьОтборАрхивная(ЭтотОбъект); // №6744
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьАрхивныеПриИзменении(Элемент)
		
	УстановитьОтборАрхивная(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборАрхивная(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список, "Архивная", Ложь, , , НЕ Форма.ПоказыватьАрхивные);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Оформление архивных
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(
		УсловноеОформление.Элементы, "Список", 
		Новый ПолеКомпоновкиДанных("Список.Архивная"), ВидСравненияКомпоновкиДанных.Равно, Истина,
		ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
КонецПроцедуры
