
&НаКлиенте
Процедура ВыборЦветаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда	
		Элементы["ДекорацияЦвет"].ЦветФона = Результат;
		Элементы["ДекорацияЦвет"].ЦветТекста = Результат;
		Элементы["ПолеТекстДляПримера"].ЦветТекста = Результат;
		ТекущаяНастройкаЦвета = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЦветНажатие(Элемент)
	
	ИмяЭлемента = "ДекорацияЦвет";
	
	ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
	ДиалогВыбораЦвета.Цвет = Элементы[ИмяЭлемента].ЦветФона;
	
	Оповещение = Новый ОписаниеОповещения("ВыборЦветаЗавершение", ЭтотОбъект);
	ДиалогВыбораЦвета.Показать(Оповещение);
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ТекстДляПримера = "Александр Евгеньевич Сергиевский";
	
	Если ЗначениеЗаполнено(Объект.НастройкаЦвета) Тогда	
		ТекущаяНастройкаЦвета = СериализаторXDTO.XMLЗначение(Тип("Цвет"), Объект.НастройкаЦвета);
	Иначе
		ТекущаяНастройкаЦвета = "";
	КонецЕсли;	
	
	Элементы.ДекорацияЦвет.Гиперссылка = Истина; 
	Элементы.ДекорацияЦвет.УстановитьДействие("Нажатие", "ДекорацияЦветНажатие");
	
	Если Не ЗначениеЗаполнено(ТекущаяНастройкаЦвета) Тогда                   
		Элементы["ДекорацияЦвет"].ЦветФона = ЦветаСтиля.ЦветТекстаПоля;
		Элементы["ДекорацияЦвет"].ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
		Элементы["ПолеТекстДляПримера"].ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	Иначе	
		Элементы["ДекорацияЦвет"].ЦветФона = ТекущаяНастройкаЦвета;
		Элементы["ДекорацияЦвет"].ЦветТекста = ТекущаяНастройкаЦвета;
		Элементы["ПолеТекстДляПримера"].ЦветТекста = ТекущаяНастройкаЦвета;
	КонецЕсли;
		
КонецПроцедуры   

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НастройкаЦвета = СериализаторXDTO.XMLСтрока(ТекущаяНастройкаЦвета);
	
КонецПроцедуры

Процедура ПослеЗаписи(ПараметрыЗаписи)
    
    ОповеститьОЗаписиНового(Объект.Ссылка);
    
КонецПроцедуры

