&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = Параметры.Дата;
	Валюта = Параметры.Валюта;
	Ссылка = Параметры.Ссылка;
	СуммаДокумента = Параметры.СуммаДокумента;
		
	ЭквайринговыйТерминал = Параметры.ЭквайринговыйТерминал;
 	Организация = Параметры.Организация;
	
	ВалютаУчета = Валюта; //Константы.ВалютаУчета.Получить();
	
	АдресЭквайринговыеОперацииВХранилище = Параметры.АдресЭквайринговыеОперацииВХранилище;
	ОтобранныеДолги.Загрузить(ПолучитьИзВременногоХранилища(АдресЭквайринговыеОперацииВХранилище));
	
	ПериодРасчетовДатаОкончания = Ссылка.Дата; 
	ЗаполнитьДолги();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассчитатьСуммаИтог();
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура РассчитатьСуммаИтог()
		
	СуммаИтогКомиссия = ОтобранныеДолги.Итог("СуммаКомиссии") - ОтобранныеДолги.Итог("СуммаКомиссииВозврата");
	СуммаИтог = ОтобранныеДолги.Итог("Сумма") - ОтобранныеДолги.Итог("СуммаВозврата") - СуммаИтогКомиссия;
	
КонецПроцедуры // РассчитатьСуммаИтог()

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ТаблицаОтобранныеДолги = ОтобранныеДолги.Выгрузить();
	ПоместитьВоВременноеХранилище(ТаблицаОтобранныеДолги, АдресЭквайринговыеОперацииВХранилище);
	
КонецПроцедуры // ЗаписатьПодборВХранилище()

&НаКлиенте
Процедура СписокДолговВыборЗначения(Элемент, СтандартнаяОбработка, Значение)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура("Документ", ТекущаяСтрока.Документ);
	Строки = ОтобранныеДолги.НайтиСтроки(СтруктураПоиска);
	
	Если Строки.Количество() > 0 Тогда
		НоваяСтрока = Строки[0];
		НоваяСтрока.Сумма = НоваяСтрока.Сумма + ТекущаяСтрока.Сумма;
		НоваяСтрока.СуммаКомиссии = НоваяСтрока.СуммаКомиссии + ТекущаяСтрока.СуммаКомиссии;
		НоваяСтрока.СуммаВозврата = НоваяСтрока.СуммаВозврата + ТекущаяСтрока.СуммаВозврата;
		НоваяСтрока.СуммаКомиссииВозврата = НоваяСтрока.СуммаКомиссииВозврата + ТекущаяСтрока.СуммаКомиссииВозврата;
	Иначе
		НоваяСтрока = ОтобранныеДолги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЕсли;
	
	СписокДолгов.Удалить(ТекущаяСтрока);
	
	Элементы.ОтобранныеДолги.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
	РассчитатьСуммаИтог();
	ЗаполнитьДолги();

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьПодборВХранилище();
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры // ОК()

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьДолги();
	
КонецПроцедуры // Обновить()

&НаКлиенте
Процедура ОтобранныеДолгиПриИзменении(Элемент)
	
	РассчитатьСуммаИтог();
	ЗаполнитьДолги();
	
КонецПроцедуры // ОтобранныеДолгиПриИзменении()

&НаКлиенте
Процедура ОтобранныеДолгиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		РассчитатьСуммаИтог();
		ЗаполнитьДолги();
	КонецЕсли;
	
КонецПроцедуры // ОтобранныеАвансыПриНачалеРедактирования()

&НаСервере
Процедура ЗаполнитьДолги()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", 	НачалоДня(ПериодРасчетовДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(ПериодРасчетовДатаОкончания));
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	Запрос.УстановитьПараметр("Регистратор", 	Ссылка);
	Запрос.УстановитьПараметр("ТаблицаОтобранныеДолги", ОтобранныеДолги.Выгрузить());
	Запрос.УстановитьПараметр("Валюта", 		Валюта);

	//схожий запрос на форме документа Поступление на РС
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтобранныеДолги.Документ КАК Документ,
	|	ОтобранныеДолги.Сумма КАК Сумма,
	|	ОтобранныеДолги.СуммаКомиссии КАК СуммаКомиссии,
	|	ОтобранныеДолги.СуммаВозврата КАК СуммаВозврата,
	|	ОтобранныеДолги.СуммаКомиссииВозврата КАК СуммаКомиссииВозврата
	|ПОМЕСТИТЬ ТаблицаОтобранныеДолги
	|ИЗ
	|	&ТаблицаОтобранныеДолги КАК ОтобранныеДолги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыПоЭквайрингу.Документ КАК Документ,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ОплатаБанковскойКартой
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту)
	|				ТОГДА 0
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ЧекККМ
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыПоЭквайрингу.СуммаПриход - РасчетыПоЭквайрингу.СуммаРасход
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ОплатаБанковскойКартой
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту)
	|				ТОГДА 0
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ЧекККМ
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыПоЭквайрингу.КомиссияБанкаПриход - РасчетыПоЭквайрингу.КомиссияБанкаРасход
	|		КОНЕЦ) КАК СуммаКомиссии,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ОплатаБанковскойКартой
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту)
	|				ТОГДА РасчетыПоЭквайрингу.СуммаПриход - РасчетыПоЭквайрингу.СуммаРасход
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ЧекККМ
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	|				ТОГДА РасчетыПоЭквайрингу.СуммаПриход - РасчетыПоЭквайрингу.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВозврата,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ОплатаБанковскойКартой
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту)
	|				ТОГДА РасчетыПоЭквайрингу.КомиссияБанкаПриход - РасчетыПоЭквайрингу.КомиссияБанкаРасход
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ЧекККМ
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	|				ТОГДА РасчетыПоЭквайрингу.КомиссияБанкаПриход - РасчетыПоЭквайрингу.КомиссияБанкаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаКомиссииВозврата
	|ПОМЕСТИТЬ РасчетыПоЭквайрингуОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыПоЭквайрингу.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Организация = &Организация
	|				И ЭквайринговыйТерминал = &ЭквайринговыйТерминал
	|				И Документ.Дата >= &ДатаНачала
	|				И (&ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ Документ.Дата <= &ДатаОкончания)) КАК РасчетыПоЭквайрингу
	|ГДЕ
	|	РасчетыПоЭквайрингу.Регистратор <> &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоЭквайрингу.Документ
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыПоЭквайрингу.СуммаПриход - РасчетыПоЭквайрингу.СуммаРасход) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОтобранныеДолги.Документ,
	|	СУММА(-ТаблицаОтобранныеДолги.Сумма),
	|	СУММА(-ТаблицаОтобранныеДолги.СуммаКомиссии),
	|	СУММА(-ТаблицаОтобранныеДолги.СуммаВозврата),
	|	СУММА(-ТаблицаОтобранныеДолги.СуммаКомиссииВозврата)
	|ИЗ
	|	ТаблицаОтобранныеДолги КАК ТаблицаОтобранныеДолги
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОтобранныеДолги.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыПоЭквайрингуОстатки.Документ КАК Документ,
	|	СУММА(РасчетыПоЭквайрингуОстатки.Сумма) КАК Сумма,
	|	СУММА(РасчетыПоЭквайрингуОстатки.СуммаКомиссии) КАК СуммаКомиссии,
	|	СУММА(РасчетыПоЭквайрингуОстатки.СуммаВозврата) КАК СуммаВозврата,
	|	СУММА(РасчетыПоЭквайрингуОстатки.СуммаКомиссииВозврата) КАК СуммаКомиссииВозврата
	|ИЗ
	|	РасчетыПоЭквайрингуОстатки КАК РасчетыПоЭквайрингуОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоЭквайрингуОстатки.Документ
	|
	|ИМЕЮЩИЕ
	|	(СУММА(РасчетыПоЭквайрингуОстатки.Сумма) > 0
	|		ИЛИ СУММА(РасчетыПоЭквайрингуОстатки.СуммаВозврата) > 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	СписокДолгов.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // ЗаполнитьДолги()

&НаКлиенте
Процедура ОтобранныеДолгиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры // ОтобранныеДолгиПередНачаломДобавления()
