
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаСинхронизации 	= Параметры.НастройкаСинхронизации;
	ВидСинхронизации 		= Параметры.ВидСинхронизации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ЗапуститьВыполнениеОбмена", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("ОбновлениеИнформацииОСинхронизации", 3);

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВыполнениеОбмена()
	
	ПараметрыСинхронизации = Новый Структура;
	ПараметрыСинхронизации.Вставить("НастройкаСинхронизации", НастройкаСинхронизации);
	ПараметрыСинхронизации.Вставить("ВидСинхронизации"		, ВидСинхронизации);
	
	ДлительнаяОперация = ВыполнитьСинхронизациюСБитрикс24НаСервере(ПараметрыСинхронизации);
	
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииОперацииЗагрузки", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеИнформацииОСинхронизации()
	
	ОбновлениеИнформацииОСинхронизацииСервер();	
	
	ДлинаПротокола = СтрДлина(Протокол);
	
	Если ДлинаПротокола > 0 Тогда           
		Элементы.Протокол.ТекущаяОбласть  = ТабличныйПротокол.Области[ТабличныйПротокол.Области.Количество()-1];
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ОбновлениеИнформацииОСинхронизацииСервер(Сообщения = Неопределено)
	
	Макет = Справочники.НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("МакетЛога");
	
	Если Сообщения = Неопределено Тогда
		
		Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("УникальныйИдентификатор", ИдентификаторЗадания));
		
		Если Задания.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Задание = Задания[0];
		
		Сообщения = Задание.ПолучитьСообщенияПользователю(Истина);
		
	КонецЕсли;
	
	Для Каждого Сообщение Из Сообщения Цикл
		
		Если Лев(Сообщение.Текст, 26)= "Тело запроса HTTP запроса:" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Лев(Сообщение.Текст, 16)= "Ответ с портала:" Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстСообщения = Сообщение.Поле + ?(ЗначениеЗаполнено(Сообщение.Поле), " -- ", "") + Сообщение.Текст;
		
		Протокол = Протокол + ТекстСообщения + Символы.ПС; 
		
		Если Сообщение.ПутьКДанным = "КритическаяОшибка" Тогда
			ОбластьМакета= Макет.ПолучитьОбласть("КритическаяОшибка");                                                                                                                                                                                                                                                                                                                                                
		ИначеЕсли Сообщение.ПутьКДанным = "Ошибка" Тогда
			ОбластьМакета= Макет.ПолучитьОбласть("Ошибка");                                                                                                                                                                                                                                                                                                                                                
		Иначе
			ОбластьМакета= Макет.ПолучитьОбласть("Информация");                                                                                                                                                                                                                                                                                                                                                
		КонецЕсли;
		
		ОбластьМакета.Параметры.ТекстСообщения = ТекстСообщения; 
		ТабличныйПротокол.Вывести(ОбластьМакета);
	
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриЗавершенииОперацииЗагрузки(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ГруппаКнопки.Видимость 	= Истина;
	Элементы.КнопкаЗакрыть.Видимость 	= Истина;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	             
	Если Протокол = "" Тогда
		
		Данные = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если ТипЗнч(Данные) = Тип("ФиксированныйМассив") Тогда
			ОбновлениеИнформацииОСинхронизацииСервер(Данные);	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.ПодробноеПредставлениеОшибки) Тогда
		
		ОписаниеОшибки 										= Результат.ПодробноеПредставлениеОшибки; 
		Элементы.СтраницыФормы.ТекущаяСтраница 				= Элементы.СтраницаОшибка;
		
	Иначе
		
		ПоказатьОповещениеПользователя(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 ""%2""'"),
		Формат(ТекущаяДата(), "ДЛФ=DT"),
		НастройкаСинхронизации) 
		,,
		НСтр("ru = 'Синхронизация с Битрикс24 завершена'"),
		БиблиотекаКартинок.Информация32);
		
		Элементы.НадписьВыполняетсяОбмен.Заголовок 	= "Синхронизация завершена";
		Элементы.КартинкаВыполняетсяОбмен.Видимость = Ложь;
		Элементы.КнопкаЗакрыть.КнопкаПоУмолчанию 	= Истина;
		
	КонецЕсли;
	
	ОбновлениеИнформацииОСинхронизации();
	ОтключитьОбработчикОжидания("ОбновлениеИнформацииОСинхронизации");
	
	// №9655 добавляем оповещения АРМ Розницы
	ОбщийМодуль.УстановитьНеобходимостьОбновленияАРМРозницы();
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьСинхронизациюСБитрикс24НаСервере(ПараметрыСинхронизации)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение синхронизации с Битрикс24'");
	
	Результат = ДлительныеОперации.ВыполнитьВФоне("ОбменСБитрикс24КлиентСервер.ВыполнитьСинхронизациюПоФоновомуЗаданию", ПараметрыСинхронизации, ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции
