			 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивНоменклатуры = Новый Массив;
	
	СтруктураОтбора = Новый Структура;
	
	// множественный выбор
	Если ПараметрКоманды.Количество() > 0 Тогда
		
		Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.Номенклатура") Тогда
			МассивНоменклатуры = ПараметрКоманды;
			
		ИначеЕсли ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ЗаполнитьНоменклатуруПоДокументам(ПараметрКоманды, МассивНоменклатуры);
			
		КонецЕсли;
	КонецЕсли;
	СтруктураОтбора.Вставить("Номенклатура", МассивНоменклатуры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "Основной");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина); 

	ОткрытьФорму("Отчет.АнализДоступностиТоваров.Форма", 
				 ПараметрыФормы, 
				 ПараметрыВыполненияКоманды.Источник, 
				 Новый УникальныйИдентификатор,  
				 ПараметрыВыполненияКоманды.Окно, 
				 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
				 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуруПоДокументам(МассивСсылок, МассивНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В (&МассивСсылок)";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивНоменклатуры.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
КонецПроцедуры
