
&НаКлиенте
Процедура ЗавершитьСмену(Команда)
	
	ОчиститьСообщения();
	Период = ОбщийМодуль.ЗаписьОНачалеРаботыПользователя();
	Если Период = Неопределено Тогда
		Сообщить("Отсутствуют открытые смены");
		Возврат;
	КонецЕсли;
	
	//#12261
	//1. При закрытии смены прошлого периода, смотреть что нет записей в РС по этому сотруднику 
	//с даты начала незакрытой смены и по текущий момент	
	Если НЕ НачалоДня(Период) = НачалоДня(ТекущаяДата()) Тогда
		Сообщить("В регистре учета рабочего времени имеются неразрешенные конфликты по сменам: перед закрытием смены следует вручную указать корректные периоды по ранее созданным сменам");
		Возврат;
	КонецЕсли;
	
	Если ОбщийМодуль.ЗанестиЗаписьОбОкончанииРаботыПользователя() Тогда
		Состояние("Выполнено");
	Иначе
		Сообщить("Отсутствуют открытые смены");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСмену(Команда)
	
	ОчиститьСообщения();
	Если НачатьСменуНаСервере() Тогда
		Состояние("Выполнено");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьСменуНаСервере()
		 
	ЗаписьОНачале = ОбщийМодуль.ЗаписьОНачалеРаботыПользователя();
	Если НЕ ЗаписьОНачале = Неопределено Тогда
		Сообщить("Имеется незакрытая смена: " + Строка(ЗаписьОНачале) + ". Завершите смену");
		Возврат Ложь;
	Иначе
		ОбщийМодуль.ЗанестиЗаписьОНачалеРаботыПользователя(Ложь, Ложь);
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
