&НаКлиенте
Процедура ОбновитьФорму()
	Если Контрагент.Пустая() Тогда
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.ДекорацияНеНайден.Видимость = Истина;
	Иначе
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ДекорацияНеНайден.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Контрагент", Контрагент);
	СтруктураОтвета.Вставить("ДисконтнаяКарта", ДисконтнаяКарта);
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаСервере
Процедура ШтрихКодПриИзмененииНаСервере()
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	ДисконтнаяКарта = Справочники.ДисконтныеКарты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДисконтныеКарты.Владелец,
	|	ДисконтныеКарты.Ссылка
	|ИЗ
	|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|ГДЕ
	|	ДисконтныеКарты.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", ШтрихКод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Контрагент = Выборка.Владелец;
		ДисконтнаяКарта = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихКодПриИзменении(Элемент)
	ШтрихКодПриИзмененииНаСервере();
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьФорму();
КонецПроцедуры
