
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сотрудник",   Сотрудник);
	Параметры.Свойство("РежимПечати", РежимПечати);	

	//Элементы.ПроизводственнаяОперация.Видимость = (РежимПечати = 3);
	//Элементы.ОперацияНадДокументами.Видимость = (РежимПечати = 4);
	Если РежимПечати = 3 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПроизводственнаяОперация;

	//#14908 закомментировано
	//ИначеЕсли РежимПечати = 4 Тогда
	//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОперацияНадДокументами;
	//	ОперацияНадДокументами = Справочники.ОперацииНадДокументами.СборкаЗаказаПокупателя;
		
	ИначеЕсли РежимПечати = 50 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРабочееМесто;
		ДействиеРМ = "Кнопка по умолчанию";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если РежимПечати = 3 Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОперацияНадДокументами"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДействиеРМ"));
	ИначеЕсли РежимПечати = 4 Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПроизводственнаяОперация"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДействиеРМ"));
	ИначеЕсли РежимПечати = 50 Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПроизводственнаяОперация"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОперацияНадДокументами"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Сотрудник"));
	КонецЕсли;

КонецПроцедуры

//&НаСервере
//Функция ПараметрыШК()
//	
//	//Сформируем ш/к [88][КодОперации(последние 5)][КодСотудника(последние 5)]	
//	КодОперации = Формат(Прав(ПроизводственнаяОперация.Код, 5), "ЧЦ=5; ЧВН=; ЧГ=");
//	КодСотрудника = Формат(Прав(Сотрудник.Код, 5), "ЧЦ=5; ЧВН=; ЧГ=");
//	Штрихкод = "88" + КодОперации + КодСотрудника;	
//	Штрихкод = Штрихкод + ОбщийМодульВызовСервера.КонтрольныйСимволEAN(ШтрихКод, 13);
//	
//	Возврат Новый Структура("ЗначениеКода, Заголовок", Штрихкод, Строка(ПроизводственнаяОперация.Наименование + " + " + Сотрудник.Наименование));
//	
//КонецФункции

&НаКлиенте
Процедура ПрисвоитьШК(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда		
		Возврат;
	КонецЕсли;
	
	//ПараметрыШК = ПараметрыШК();
	Если РежимПечати = 3 Тогда
		ПараметрыШК = ШтрихкодированиеПотолкиКлиент.ПараметрыШК(3, Сотрудник, ПроизводственнаяОперация);
	ИначеЕсли РежимПечати = 4 Тогда
		ПараметрыШК = ШтрихкодированиеПотолкиКлиент.ПараметрыШК(4, Сотрудник, ОперацияНадДокументами);
	ИначеЕсли РежимПечати = 50 Тогда
		ПараметрыШК = ШтрихкодированиеПотолкиКлиент.ПараметрыШК(50, , ДействиеРМ);
	КонецЕсли;
	ОбщийМодульКлиент.ОткрытьФормуПечатиШК(ПараметрыШК.ЗначениеКода, , ПараметрыШК.Заголовок);
	
КонецПроцедуры





