
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("", );
    //{ ИА_Аврамов 21.11.2014
    // БЫЛО:
    ////ОткрытьФорму("Отчет.ИА_ДокументыБезДвиженийПоФондам.Форма"
    // СТАЛО:
    ОткрытьФорму("Отчет.ИА_КонтрольПлатежейВнеФондов.ФормаОбъекта"
    //} 
    , ПараметрыФормы
    , ПараметрыВыполненияКоманды.Источник
    , ПараметрыВыполненияКоманды.Уникальность
    , ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
