
&НаКлиенте
Процедура ОргсхемаПриАктивизацииСтроки(Элемент)
	тд = Элементы.Оргсхема.ТекущиеДанные;
	Если тд<>Неопределено Тогда
		пост = тд.ссылка;
		Если ЗначениеЗаполнено(пост) Тогда
			СписокСтатистик = ПолучитьСтатистикиПоста(пост); 
			
			Список.Отбор.Элементы.Очистить();
			Элемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Элемент.ПравоеЗначение = СписокСтатистик;
			Элемент.Использование = истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатистикиПоста(пПост)
	рез = Новый СписокЗначений;
	рез.ЗагрузитьЗначения(пПост.Статистики.ВыгрузитьКолонку("Статистика"));
	Возврат рез;
КонецФункции

&НаКлиенте
Процедура ОчиститьОтбор(Команда)
	Список.Отбор.Элементы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РазвернутьДерево(Оргсхема.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Строки)          
	Для каждого стр из Строки Цикл
		Элементы.Оргсхема.Развернуть(стр.ПолучитьИдентификатор());
		Если стр.ТипТерминала <> ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент") ТОгда
			РазвернутьДерево(стр.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьОргсхему();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОргсхему()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка КАК Ссылка,
	               |	ОргСхема.Наименование,
	               |	ОргСхема.ПометкаУдаления,
	               |	ОргСхема.ТипТерминала,
	               |	ОргСхема.ПорядокВСхеме
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка ИЕРАРХИЯ";
	Дер = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	УдалитьПомеченных(Дер.Строки);
	Дер.Строки.Сортировать("ПорядокВСхеме",Истина);
	Дер.Колонки.Удалить("ПометкаУдаления");
	Дер.Колонки.Удалить("ПорядокВСхеме");
	ЗначениеВРеквизитФормы(Дер, "Оргсхема");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьПомеченных(Строки)
	сч = Строки.Количество() -1;
	
	Пока сч >= 0 Цикл
		стр = строки[сч];
		Если стр.ПометкаУдаления ТОгда
			строки.Удалить(стр);
		Иначе
			УдалитьПомеченных(стр.Строки);
		КонецЕсли;
		сч = сч - 1;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	тд = Элементы.Список.ТекущиеДанные;
	Если тд = Неопределено или тд.ЭтоГруппа ТОгда
		Описание = "";
		Возврат;
	КонецЕсли;
	
	Описание = тд.Описание;
	
	Если ЗначениеЗаполнено(тд.Аналитика1) Тогда
		Описание = Описание + Символы.ПС + Символы.ПС + "Статистика содержит следующие аналитики:" + Символы.ПС + тд.Аналитика1;
		Если ЗначениеЗаполнено(тд.Аналитика2) Тогда
			Описание = Описание +Символы.ПС+ тд.Аналитика2;
		КонецЕсли;
		Если ЗначениеЗаполнено(тд.Аналитика3) Тогда
			Описание = Описание +Символы.ПС+ тд.Аналитика3;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
	
