
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстПисьма = "";
	ТекстHTML = "";
	Параметры.Свойство("ТекстПисьма", ТекстПисьма);
	Параметры.Свойство("ТекстHTML", ТекстHTML);
	
	ЕстьHTMLТекст    = НЕ ПустаяСтрока(ТекстHTML);
	
	ТекстСтрокДляРазбора = ТекстПисьма;
	
	Если ЕстьHTMLТекст Тогда		
		Попытка
			НовыйHTMLДокумент = Новый COMОбъект("HtmlFile");
			НовыйHTMLДокумент.open("text/html");
			НовыйHTMLДокумент.write(СокрЛП(ТекстHTML));
			НовыйHTMLДокумент.close();
			
			ТекстСтрокДляРазбора = СтрЗаменить(НовыйHTMLДокумент.all.item(0).innerText, Символ(13), "");
			Если НЕ ЗначениеЗаполнено(ТекстСтрокДляРазбора) Тогда
				ТекстСтрокДляРазбора = СтрЗаменить(НовыйHTMLДокумент.all.item(1).innerText, Символ(13), "");
			КонецЕсли;			
		Исключение	
			Построитель = Новый ПостроительDOM;
			ЧтениеHTML = Новый ЧтениеHTML;
			ЧтениеHTML.УстановитьСтроку(СокрЛП(ТекстHTML));
			ДокументHTML = Построитель.Прочитать(ЧтениеHTML);
			
			ТекстСтрокДляРазбора = СокрЛП(ДокументHTML.Тело.ТекстовоеСодержимое);
		КонецПопытки;		
	КонецЕсли;
	
	ДопИнфо = ТекстСтрокДляРазбора;
	
КонецПроцедуры
