
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Пользователь = Параметры.Пользователь;
	ОбновитьПланы();
КонецПроцедуры


&НаСервере
Процедура ОбновитьПланы()
	ИА_Планы.УстановитьРабочееВремя(ПланировщикДень,Пользователь);
	
	Начало = НачалоДня(ТекущаяДата());
	Конец = КонецДня(Начало+60*60*24*10);
	
	ПланировщикДень.ТекущиеПериодыОтображения.Очистить();
	выходные = ИА_Защита_Статистика.ПолучитьВыходныеЗаПериод(Начало, Конец);
	
	ТекНачало = Начало;
	Пока ТекНачало < Конец Цикл
		если выходные.найти(ТекНачало) = Неопределено Тогда
			ПланировщикДень.ТекущиеПериодыОтображения.Добавить(ТекНачало, КонецДня(ТекНачало));
		КонецЕсли;
		ТекНачало = ТекНачало + 60*60*24;
	КонецЦикла;
	
	ИА_Планы.ОбновитьДневныеПланы(ПланировщикДень, Начало,Конец,Пользователь);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Срок);
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Закрыть(НачалоДня(Начало));
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПередУдалением(Элемент, Отказ)
	СтандартнаяОбработка = Ложь;
	отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	ОтменаРедактирования = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньВыбор(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Закрыть(НачалоДня(Элемент.ВыделенныеЭлементы[0].Начало));
КонецПроцедуры
