
#Область ПрограммныйИнтерфейс

//&НаКлиенте
//Процедура ОповещениеОткрытьФормуПроверкиНепробитыхЧеков(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
//	
//	Если РезультатОткрытияФормы = НСтр("ru = 'Закрытие смены'") Тогда
//		ПродолжитьОткрытиеОбработкиЗакрытияКассовойСмены(ДополнительныеПараметры.КассаККМ);
//	Иначе
//		
//		ТекстОшибки = НСтр("ru = 'Закрытие кассовой смены прервано пользователем.'");
//		
//		ОбщийМодульКлиент.ВывестиИнформациюДляРМКУправляемой(ТекстОшибки)
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеОткрытьФормуВводаСуммыФактическойВыемки(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
//	
//	СуммаФактическойВыемки = 0;
//	
//	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
//		ЗначениеВыбораЧисло = РезультатОткрытияФормы.ВведенноеЧисло;
//		Если ЗначениеЗаполнено(ЗначениеВыбораЧисло) Тогда
//			СуммаФактическойВыемки = ЗначениеВыбораЧисло;
//		КонецЕсли;
//		
//		ЗавершитьОткрытиеОбработкиЗакрытияКассовойСмены(ДополнительныеПараметры.КассаККМ, СуммаФактическойВыемки);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеОткрытьФормуНастройкиРМК(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
//	
//	УстановитьДоступностьЭлементов();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеОткрытьФормуЗакрытияКассовойСмены(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
//	
//	Оповестить("ИзменениеСостоянияКассовойСмены", ДополнительныеПараметры.КассаККМ);
//	
//КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВопросаЗакрытьСмену(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		Если НЕ ВРЕГ(РезультатОткрытияФормы) = "ДА" Тогда
			Возврат;
		КонецЕсли;
		КассаККМ = ДополнительныеПараметры.КассаККМ;
		ТекстОшибки = "";
		Если НЕ ВозможностьЗакрытияСмены(КассаККМ, ТекстОшибки) Тогда
			ОбщийМодульКлиент.ВывестиИнформациюДляРМКУправляемой(ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		//ДополнительныеПараметры = Новый Структура;
		//ДополнительныеПараметры.Вставить("КассаККМ", ККТ);
		//ОбработчикОповещения= Новый ОписаниеОповещения("ОповещениеОткрытьФормуПроверкиНепробитыхЧеков", ЭтотОбъект, ДополнительныеПараметры);
		//ПройденаПроверкаНепробитыхЧеков = РозничныеПродажиКлиент.ПройденаПроверкаНепробитыхЧеков(КассаККМ, ОбработчикОповещения);
		//
		//Если ПройденаПроверкаНепробитыхЧеков Тогда
			ПродолжитьОткрытиеОбработкиЗакрытияКассовойСмены(КассаККМ);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВопросаЗакрытьРМК(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		Если НЕ ВРЕГ(РезультатОткрытияФормы) = "ДА" Тогда
			ПараметрЗакрытияФормы = "";
			СанкционированноеЗакрытие = Ложь;
			Возврат;
		КонецЕсли;
		
		ПроверятьЗакрытиеКассовойСменыПередВыходомИзРМК = Ложь;
		
		Если ДополнительныеПараметры.Действие = "ПередЗакрытием" Тогда
			Если ЗначениеЗаполнено(ПараметрЗакрытияФормы)  Тогда
				Закрыть(ПараметрЗакрытияФормы);
			Иначе
				Закрыть();
			КонецЕсли;
		ИначеЕсли ДополнительныеПараметры.Действие = "ЗавершитьРаботуСистемы" Тогда
			ЗавершитьРаботуСистемы(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрЗакрытияФормы = "";
	СанкционированноеЗакрытие = Ложь;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеОткрытьОсновнуюФормуРМК(РезультатОткрытияФормы, ДополнительныеПараметр) Экспорт
//	
//	ОткрытьОсновнуюФормуРМК();
//	
//КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
//	ПараметрыСеанса.ФормаРабочегоМестаКассира = Строка(УникальныйИдентификатор);
//	
//	УстановитьДоступностьЭлементов();
//	
	Магазин = ОбщийМодульСервер.НастройкаПользователя("Магазин");
	
	Если НЕ ЗначениеЗаполнено(Магазин) Тогда
//		ПолучитьДоступныеМагазины();
//		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВыбораМагазина;
	Иначе
		СтрокаТаблицыМагазинов = Магазины.Добавить();
		СтрокаТаблицыМагазинов.Магазин = Магазин;
	КонецЕсли;
	
	ИспользоватьПодключаемоеОборудование = ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если Не ВебКлиент Тогда
	мИмяКомпьютера = ИмяКомпьютера();
	#КонецЕсли  
	
	ПолучитьРабочееМесто();	

	// ПодключаемоеОборудование
	//ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);  	
	//МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(ОповещенияПриПодключении, ЭтаФорма, "ДисплейПокупателя");
	// Конец ПодключаемоеОборудование
	
	ПодключитьОбработчикОжидания("ПроверитьВозможностьРаботыПриОткрытии", 0.1, Истина);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
//	
//	Если Не РезультатВыполнения.Результат Тогда
//		ЗаголовокИнформации = НСтр("ru = 'При подключении оборудования произошла ошибка:'");
//		ТекстИнформации     = РезультатВыполнения.ОписаниеОшибки;
//		ОбщийМодульКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстИнформации);
//	Иначе
//		ВывестиИнформациюНаДисплейПокупателя();
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если (НЕ СанкционированноеЗакрытие И Магазины.Количество() > 0) ИЛИ ЗавершениеРаботы Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Действие", "ПередЗакрытием");
	
//	ПроверитьЗакрытиеКассовойСменыПередВыходомИзРМК(Отказ, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	// Конец ПодключаемоеОборудование
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
//	ОбщегоНазначенияРТВызовСервера.УстановитьЗначениеПараметраСеанса("ФормаРабочегоМестаКассира", "");
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
//	
//	Если ИмяСобытия = "ОбновитьФормуМенюРМК" Тогда
//		
//		УстановитьДоступностьЭлементов();
//		
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//&НаКлиенте
//Процедура МагазиныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	ВыборМагазинаКлиент()
//	
//КонецПроцедуры

&НаКлиенте
Процедура КассыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыборКассыКлиент()
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРегистрацияПродажНажатие(Элемент)
	
	ОчиститьСообщения();
	ПолучитьРабочееМесто();
	СменаНаАвтономнойККМОткрыта = Ложь;
	
	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	АвтоматическиОткрытьСменуАвтономнойККМ = Ложь;
	Если ПроверитьВозможностьРегистрацииПродаж(ПараметрыИнформации, АвтоматическиОткрытьСменуАвтономнойККМ) Тогда
		ОткрытьОсновнуюФормуРМК();
	Иначе
		// Если тип ККМ "Без подключения ККМ", то попытаемся автоматически открыть смену
		Если АвтоматическиОткрытьСменуАвтономнойККМ Тогда
			ДекорацияОткрытиеСменыНажатие(Неопределено);
			Если СменаНаАвтономнойККМОткрыта Тогда
				ОткрытьОсновнуюФормуРМК();
			КонецЕсли;
		Иначе
			ОбщийМодульКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОсновнуюФормуРМК()
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РабочееМесто"  , РабочееМесто);
	ПараметрыФормы.Вставить("Магазин"       , Магазин);
	ПараметрыФормы.Вставить("мИмяКомпьютера", мИмяКомпьютера);
	
	ПараметрыФормы.Вставить("РасчетноеВремяЗакрытияКассы", РасчетноеВремяЗакрытияКассы);
	
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Обработка.РМКУправляемыйРежим.Форма.Форма", ПараметрыФормы, ЭтотОбъект,,,,, Режим);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОткрытиеСменыНажатие(Элемент)
	
	ОчиститьСообщения();
	ПолучитьРабочееМесто();
	
	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	Если ПроверитьОбщуюВозможностьРаботы(ПараметрыИнформации) Тогда
		
		Если ДоступныеКассыККМ = Неопределено ИЛИ ДоступныеКассыККМ.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьДоступныеКассыСУчетомОткрытия(Ложь);
		
		Если Кассы.Количество() = 0 Тогда
			
			ЗаголовокИнформации = НСтр("ru = 'Ошибка открытия смены'");
			ТекстИнформации = НСтр("ru = 'Нет касс с закрытыми сменами.'");
			ОбщийМодульКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстИнформации);
			
			Возврат;
			
		КонецЕсли;
		
		РежимВыбораКассы = "ОткрытьСмену";
		Если Кассы.Количество() > 1  Тогда
			
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВыбораКассы;
			Возврат;
			
		КонецЕсли;
		
		ОткрытьСмену(Кассы[0].Касса);
		
	Иначе
		ОбщийМодульКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтчетБезГашенияНажатие(Элемент)
	
	ОчиститьСообщения();
	ПолучитьРабочееМесто();
	
	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	Если ПроверитьОбщуюВозможностьРаботы(ПараметрыИнформации) Тогда
		
		Если ДоступныеКассыККМ = Неопределено ИЛИ ДоступныеКассыККМ.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьДоступныеКассыСУчетомОткрытия(Истина); //, Истина);
		
		Если Кассы.Количество() = 0 Тогда
			
			ЗаголовокИнформации = НСтр("ru = 'Ошибка печати отчета без гашения'");
			ТекстИнформации = НСтр("ru = 'Нет доступных касс.'");
			ОбщийМодульКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстИнформации);
			
			Возврат;
			
		КонецЕсли;
		
		Если Кассы.Количество() > 1  Тогда
			
			РежимВыбораКассы = "НапечататьОтчетБезГашения";
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВыбораКассы;
			Возврат;
			
		КонецЕсли;
		
		НапечататьОтчетБезГашения(Кассы[0].Касса)
		
	Иначе
		ОбщийМодульКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗакрытиеСменыНажатие(Элемент)
	
	ОчиститьСообщения();
	ПолучитьРабочееМесто();
	
	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	Если ПроверитьОбщуюВозможностьРаботы(ПараметрыИнформации) Тогда
		
		Если ДоступныеКассыККМ = Неопределено ИЛИ ДоступныеКассыККМ.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьДоступныеКассыСУчетомОткрытия(Истина);
		
		Если Кассы.Количество() = 0 Тогда
			
			ЗаголовокИнформации = НСтр("ru = 'Ошибка закрытия смены'");
			ТекстИнформации = НСтр("ru = 'Нет касс с открытыми сменами.'");
			ОбщийМодульКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстИнформации);
			
			Возврат;
			
		КонецЕсли;
		
		Если Кассы.Количество() > 1  Тогда
			
			РежимВыбораКассы = "ЗакрытьСмену";
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВыбораКассы;
			Возврат;
			
		КонецЕсли;
		
		ЗакрытьСмену(Кассы[0].Касса)
		
	Иначе
		ОбщийМодульКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗакрытьНажатие(Элемент)
	
	СанкционированноеЗакрытие = Истина;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗавершениеРаботыНажатие(Элемент)
	
	СанкционированноеЗакрытие = Истина;
	
	Если МодальныйРежим Тогда
		СоединенияИБКлиент.ЗавершитьРаботуЭтогоСеанса(Ложь);
		ПараметрЗакрытияФормы = "ЗавершитьРаботуСистемы";
		Закрыть(ПараметрЗакрытияФормы);
	Иначе
		Отказ = Ложь;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Действие", "ЗавершитьРаботуСистемы");
		
		ПроверитьЗакрытиеКассовойСменыПередВыходомИзРМК(Отказ, ДополнительныеПараметры);
		Если НЕ Отказ Тогда
			ЗавершитьРаботуСистемы(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНазадКСпискуКнопок(Команда)
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаКнопок;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКассы(Команда)
	ВыборКассыКлиент();
КонецПроцедуры

//&НаКлиенте
//Процедура ВыборМагазина(Команда)
//	
//	ВыборМагазинаКлиент()
//	
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//&НаСервере
//Процедура УстановитьДоступностьЭлементов()
//	
//	Пользователь = глЗначениеПеременной("ПользовательИзмененныхПрав");
//	Если Пользователь = Неопределено 
//		ИЛИ НЕ ЗначениеЗаполнено(Пользователь) Тогда
//		Пользователь = Пользователи.ТекущийПользователь();
//	КонецЕсли;
//	
//	Элементы.ДекорацияОтчетБезГашения.Доступность = УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьОтчетОСменеБезГашения, Ложь, Пользователь);
//	
//	Элементы.ДекорацияЗакрытиеСмены.Доступность = УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьЗакрытиеСмены, Ложь, Пользователь);
//	
//	Элементы.ДекорацияСводныйОтчет.Доступность = УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьФормированиеСводныйОтчетПоКассовойСмене, Ложь, Пользователь)
//											   И НЕ ПланыОбмена.ПоРабочемуМесту.ЭтоРабочееМесто();
//	
//	Элементы.ДекорацияНастройкаРМК.Доступность = УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьНастройкуРМК, Ложь, Пользователь);
//	
//	Элементы.ДекорацияОбменДанными.Доступность = ПланыОбмена.ПоРабочемуМесту.ЭтоРабочееМесто();
//	
//	Элементы.ДекорацияЗакрыть.Доступность = УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьВыходИзРМК, Ложь, Пользователь);
//	
//	ПроверятьЗакрытиеКассовойСменыПередВыходомИзРМК = УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ПроверятьЗакрытиеКассовойСменыПередВыходомИзРМК, Ложь, Пользователь);
//	
//КонецПроцедуры // УстановитьДоступностьЭлементов()

&НаСервере
// Проверяет и заполняет необходимые параметры для работы.
//
// Параметры:
//  Отказ - Булево
//
Функция ПроверитьОбщуюВозможностьРаботы(ПараметрыИнформации)
	
	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка определения рабочего места'");
		
		ПараметрыИнформации.ТекстИнформации = НСтр("ru = 'Не смогли определить рабочее место.
													|Обратитесь к администратору системы.'");
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассыККМ.Ссылка КАК КассаККМ,
	|	КассыККМ.Магазин,
	|	КассыККМ.Владелец КАК Организация,
	|	ВЫБОР
	|		КОГДА КассыККМ.ПодключаемоеОборудование.ТипОборудования = &ККТОнлайн
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеобходимостьПроверятьФизЛицо
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	НЕ КассыККМ.ПометкаУдаления
	|	И НЕ КассыККМ.Магазин = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|	И КассыККМ.РабочееМесто = &РабочееМесто
	|	И КассыККМ.Магазин = &Магазин
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассыККМ.Наименование";
	
	Запрос.УстановитьПараметр("Магазин"     , Магазин);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("ККТОнлайн"   , Перечисления.ТипыПодключаемогоОборудования.ККТ);
	
	Результат = Запрос.Выполнить();
	ТаблицаРезультатаЗапроса = Результат.Выгрузить();
	
	Если ТаблицаРезультатаЗапроса.Количество() = 0  Тогда
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка определения доступных ККМ'");
		
		ПараметрыИнформации.ТекстИнформации = НСтр("ru = 'Не смогли определить доступные ККМ.
													|Обратитесь к администратору системы.'");
		Возврат Ложь;
	КонецЕсли;
		
	Пользователь = Пользователи.ТекущийПользователь();
	Если НЕ ЗначениеЗаполнено(Пользователь.ВидЦеныРМК) Тогда
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка определения вида цен'");
			
		ПараметрыИнформации.ТекстИнформации = НСтр("ru = 'Не смогли определить вид цен (РМК).
													|Администратору необходимо задать пользователю соответствующий вид цен.'");
		Возврат Ложь;
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Пользователь.Магазин) Тогда
	//	ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка определения магазина'");
	//		
	//	ПараметрыИнформации.ТекстИнформации = НСтр("ru = 'Не смогли определить магазин.
	//												|Администратору необходимо задать пользователю соответствующий магазин.'");
	//	Возврат Ложь;
	//КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("НеобходимостьПроверятьФизЛицо", Истина);	
	СтрокиТаблицы = ТаблицаРезультатаЗапроса.НайтиСтроки(СтруктураПоиска);	
	Если СтрокиТаблицы.Количество() > 0 И НЕ ЗначениеЗаполнено(Пользователь.Сотрудник) Тогда
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка определения кассира'");
			
		ПараметрыИнформации.ТекстИнформации = НСтр("ru = 'Не смогли определить кассира.
													|Администратору необходимо задать пользователю соответствующее физ. лицо.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Пользователь.НастройкаРМК) Тогда
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка определения настроек РМК'");
			
		ПараметрыИнформации.ТекстИнформации = НСтр("ru = 'Не смогли определить настройки РМК.
													|Администратору необходимо задать пользователю соответствующую настройку РМК.'");
		Возврат Ложь;
	КонецЕсли;
	
	// Проверка кассы
	ТаблицаОрганизацииККМ = ТаблицаРезультатаЗапроса.Скопировать();
	ТаблицаОрганизацииККМ.Свернуть("Организация");
	Если НЕ (ТаблицаОрганизацииККМ[0].Организация = Пользователь.НастройкаРМК.Касса.Владелец) Тогда
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка указания кассы в настройка РМК'");
			
		ПараметрыИнформации.ТекстИнформации = НСтр("ru = 'Владелец кассы указанной в настройках РМК не совпадает с организацией подключаемого оборудования.
													|Администратору необходимо корректно указать пользователю кассу в настройках РМК.'");
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаТаблицаРезультатаЗапросаСкопированная = ТаблицаРезультатаЗапроса.Скопировать();
	ТаблицаТаблицаРезультатаЗапросаСкопированная.Свернуть("КассаККМ");
	ДоступныеКассыККМ.ЗагрузитьЗначения(ТаблицаТаблицаРезультатаЗапросаСкопированная.ВыгрузитьКолонку("КассаККМ"));
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьРегистрацииПродаж(ПараметрыИнформации, АвтоматическиОткрытьСменуАвтономнойККМ)
	
	Если ПроверитьОбщуюВозможностьРаботы(ПараметрыИнформации) Тогда
		
		Дата = Дата('00010101');
		РасчетноеВремяЗакрытияКассы = Дата('00010101');
		Для каждого ПроверяемаяКасса Из ДоступныеКассыККМ Цикл
		
			СтруктураСостояниеКассовойСмены = ПотолкиКассыОнлайн.ПолучитьСостояниеКассовойСмены(ПроверяемаяКасса.Значение);
			
			КассоваяСмена = СтруктураСостояниеКассовойСмены.КассоваяСмена;
			
			ТекстОшибкиЗаголовок = НСтр("ru='Кассовая смена не открыта.'");
			Если НЕ ЗначениеЗаполнено(Дата) Тогда
				Дата = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Если КассоваяСмена = Неопределено Тогда
				ПараметрыИнформации.ЗаголовокИнформации = ТекстОшибкиЗаголовок;
				
				ПараметрыИнформации.ТекстИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Касса ККМ №%1 -'") +" " + ТекстОшибкиЗаголовок,
					ПроверяемаяКасса.Значение);
				
				Дата = Дата('00010101');
				
				Возврат Ложь;
			Иначе
				РасчетноеВремяЗакрытияТекущейКассы = КассоваяСмена.НачалоКассовойСмены + 60*60*24;
				
				Если РасчетноеВремяЗакрытияТекущейКассы > Дата Тогда
					Если РасчетноеВремяЗакрытияКассы = Дата('00010101') 
						ИЛИ РасчетноеВремяЗакрытияКассы > РасчетноеВремяЗакрытияТекущейКассы Тогда
							РасчетноеВремяЗакрытияКассы = РасчетноеВремяЗакрытияТекущейКассы;
					КонецЕсли;
				КонецЕсли;
				
				Если НЕ ПотолкиКассыОнлайн.СменаОткрыта(КассоваяСмена, Дата, ТекстОшибкиЗаголовок) Тогда
					
					// Если тип ККМ "Без подключения ККМ", то попытаемся автоматически открыть смену
					Если ПроверяемаяКасса.Значение.ТипКассы = Перечисления.ТипыКассККМ.АвтономнаяККМ Тогда
						
						АвтоматическиОткрытьСменуАвтономнойККМ = Истина;
						
					Иначе	
						
						ПараметрыИнформации.ЗаголовокИнформации = ТекстОшибкиЗаголовок;
						
						ПараметрыИнформации.ТекстИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Касса ККМ №%1 -'") +" " + ТекстОшибкиЗаголовок,
							ПроверяемаяКасса.Значение);
						
						Дата = Дата('00010101');
						
					КонецЕсли;	
						
					Возврат Ложь;
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьРабочееМесто()
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО.
		РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	КонецЕсли;
	
	ОбновитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокФормы()
	
	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
		Заголовок = НСтр("ru = 'РМК: не указано рабочее место'");
	Иначе
		Заголовок = НСтр("ru = 'РМК:'") + " " + РабочееМесто;
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура ПолучитьДоступныеМагазины()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	Магазины.Ссылка КАК Магазин
//	|ИЗ
//	|	Справочник.Магазины КАК Магазины
//	|ГДЕ
//	|	НЕ Магазины.ПометкаУдаления
//	|	И НЕ Магазины.СкладУправляющейСистемы";
//	
//	Результат = Запрос.Выполнить();
//	ТаблицаЗапроса = Результат.Выгрузить();
//	
//	Магазины.Загрузить(ТаблицаЗапроса);
//	
//КонецПроцедуры

// Процедура формирует массив касс с учетом открытия смен.
//
// Параметры:
//  ПроверкаКассСОткрытымиСменами - Булево: 
//                                  Истина - формируется список касс с открытыми сменами
//                                  Ложь   - формируется список касс с закрытыми сменами.
//
&НаСервере
Процедура ЗаполнитьДоступныеКассыСУчетомОткрытия(ПроверкаКассСОткрытымиСменами) //, ВсеКассы = Ложь)
	
	Кассы.Очистить();
	
	Для каждого ЭлементМассива Из ДоступныеКассыККМ Цикл
		
		ПроверяемаяКасса = ЭлементМассива.Значение;
		
		СтруктураСостояниеКассовойСмены = ПотолкиКассыОнлайн.ПолучитьСостояниеКассовойСмены(ПроверяемаяКасса);
		
		Если СтруктураСостояниеКассовойСмены.СменаОткрыта = ПроверкаКассСОткрытымиСменами
//			ИЛИ ВсеКассы 
			Тогда
			
			СтрокаКассы = Кассы.Добавить();
			СтрокаКассы.Касса = ПроверяемаяКасса;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//&НаСервере
Функция ВозможностьЗакрытияСмены(КассаККМ, ТекстОшибки)
	
	СтруктураСостояниеКассовойСмены = ПотолкиКассыОнлайн.ПолучитьСостояниеКассовойСмены(КассаККМ);
	
	Если НЕ СтруктураСостояниеКассовойСмены.СменаОткрыта Тогда
		
		ТекстОшибки = НСтр("ru='Кассовая смена не открыта.'");
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьСмену(КассаККМ)
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КассаККМ", КассаККМ);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВопросаЗакрытьСмену", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщийМодульКлиент.ВывестиВопросДляРМКУправляемой(НСтр("ru = 'Закрыть смену?'"),,,ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОткрытиеОбработкиЗакрытияКассовойСмены(КассаККМ)
	
	ПараметрыКассыККМ       = ПотолкиКассыОнлайн.ПараметрыКассыККМ(КассаККМ);
	ИдентификаторУстройства = ПараметрыКассыККМ.ИдентификаторУстройства;
	
	ИспользоватьКассуККМБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
	
	Если ИспользоватьПодключаемоеОборудование И НЕ ИспользоватьКассуККМБезПодключенияОборудования И ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
		
		ЭтаФорма.Доступность = Ложь;
		
		ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
		РеквизитыКассира = ПотолкиКассыОнлайн.РеквизитыКассира();
		ПараметрыОперации.Кассир = РеквизитыКассира.Наименование;
		
		Контекст = Новый Структура("ККМ", КассаККМ);
		Оповещение = Новый ОписаниеОповещения("ЗакрытьСменуЗавершение", ЭтотОбъект, Контекст);
		МенеджерОборудованияКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства);
		
	Иначе
		ОписаниеОшибки = "";
		Результат = ЗакрытьКассовуюСменуСервер(КассаККМ, ОписаниеОшибки);
		Если Не Результат Тогда
			ТекстЗаголовка = НСтр("ru = 'При закрытии смены произошла ошибка.'");
			ТекстСообщения = НСтр("ru = 'Смена не закрыта.
			                            |Дополнительное описание:
			                            |%ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	//СуммаФактическойВыемки = 0;
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ККТ", ККТ);
	
	//ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВводаСуммыФактическойВыемки", ЭтотОбъект, ДополнительныеПараметры);
	//СуммаВыемкиЗапрошена = РозничныеПродажиКлиент.ЗапроситьСуммуФактическойВыемки(КассаККМ, ОбработчикОповещения, УникальныйИдентификатор);
	//Если НЕ СуммаВыемкиЗапрошена Тогда
	//	ЗавершитьОткрытиеОбработкиЗакрытияКассовойСмены(КассаККМ); //, СуммаФактическойВыемки);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина;
	
	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка закрытия смены'");
	
	Если РезультатВыполнения.Результат Тогда 
		
	Иначе
		ТекстСообщения = НСтр("ru = 'При закрытии смены произошла ошибка.
						|%ОписаниеОшибки%
						|Смена не закрыта на фискальном устройстве.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		ПараметрыИнформации.ТекстИнформации = ТекстСообщения;
		ОбщийМодульКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗакрытьКассовуюСменуСервер(КассаККМ, ОписаниеОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Истина;
	
	СтруктураСостояниеКассовойСмены = ПотолкиКассыОнлайн.ПолучитьСостояниеКассовойСмены(КассаККМ);
	
	Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
		
		КассоваяСменаОбъект = СтруктураСостояниеКассовойСмены.КассоваяСмена.ПолучитьОбъект();
		КассоваяСменаОбъект.Дата                   = ТекущаяДатаСеанса();
		КассоваяСменаОбъект.Статус    = Перечисления.СтатусыКассовойСмены.Закрыта;
		КассоваяСменаОбъект.ОкончаниеКассовойСмены = КассоваяСменаОбъект.Дата;
		
		Попытка
			КассоваяСменаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			
			Результат = Ложь;			
			ОписаниеОшибки = НСтр("ru = 'При закрытии кассовой смены произошла ошибка.
			                            |Дополнительное описание:
			                            |%ДополнительноеОписание%'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);
			
		КонецПопытки;
		
	Иначе
				
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


//&НаКлиенте
//Процедура ЗавершитьОткрытиеОбработкиЗакрытияКассовойСмены(ККТ) //, СуммаФактическойВыемки)
//                 
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("ККТ"                   , ККТ);
//	ПараметрыФормы.Вставить("ВыполнитьЗакрытиеСразу"     , Истина);
//	ПараметрыФормы.Вставить("ДокументыОткрыватьМодально" , Истина);
//	ПараметрыФормы.Вставить("ВыводитьСообщенияВРежимеРМК", Истина);
//	//ПараметрыФормы.Вставить("СуммаФактическойВыемки"     , СуммаФактическойВыемки);
//	
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ККТ", ККТ);
//	
//	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуЗакрытияКассовойСмены", ЭтотОбъект, ДополнительныеПараметры);
//	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
//	ОткрытьФорму("Обработка.ЗакрытиеКассовойСмены.Форма.Форма", ПараметрыФормы, ЭтотОбъект,,,, ОбработчикОповещения, Режим);
//	
//КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСмену(КассаККМ)
	
	ПараметрыКассыККМ       = ПотолкиКассыОнлайн.ПараметрыКассыККМ(КассаККМ);
	ИдентификаторУстройства = ПараметрыКассыККМ.ИдентификаторУстройства;
	
	ИспользоватьКассуККМБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
	
	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка открытия смены'");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КассаККМ", КассаККМ);
	ДополнительныеПараметры.Вставить("Магазин", ПараметрыКассыККМ.Магазин);
	ДополнительныеПараметры.Вставить("Организация", ПараметрыКассыККМ.Организация);
	Если ИспользоватьПодключаемоеОборудование И НЕ ИспользоватьКассуККМБезПодключенияОборудования И ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
			
		ЭтаФорма.Доступность = Ложь;
		
		ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
		РеквизитыКассира = ПотолкиКассыОнлайн.РеквизитыКассира();
		ПараметрыОперации.Кассир = РеквизитыКассира.Наименование;
		
		Контекст = Новый Структура("КассаККМ", КассаККМ);
		Оповещение = Новый ОписаниеОповещения("ОткрытьСменуЗавершение", ЭтотОбъект, Контекст);
		МенеджерОборудованияКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства, , ДополнительныеПараметры);
		
	Иначе
		
		ОписаниеОшибки = "";
		//ТекстПереходящегоОстатка = "";
		
		Результат = ОткрытьКассовуюСменуСервер(КассаККМ, ОписаниеОшибки);
		Если Не Результат Тогда
			ТекстСообщения = НСтр("ru = 'При открытии смены произошла ошибка. Смена не открыта.
			                            |Дополнительное описание:
			                            |%ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
			ПараметрыИнформации.ТекстИнформации = ТекстСообщения;
			ОбщийМодульКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
		//ИначеЕсли ЗначениеЗаполнено(ТекстПереходящегоОстатка) Тогда
		//	ЗаголовокИнформации = НСтр("ru = 'Сумма остатка в кассе на начало смены'");
		//	ОбщийМодульКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстПереходящегоОстатка);
		Иначе
			СменаНаАвтономнойККМОткрыта = Истина;
		КонецЕсли;
		//Оповестить("ИзменениеСостоянияКассовойСмены", КассаККМ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСменуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина;
	
	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка открытия смены'");
	
	Если РезультатВыполнения.Результат Тогда 
		
		ОписаниеОшибки = "";
		//ТекстПереходящегоОстатка = "";  
		
		Результат = ОткрытьКассовуюСменуСервер(Параметры.КассаККМ, ОписаниеОшибки);
		Если Не Результат Тогда
			ТекстСообщения = НСтр("ru = 'При открытии смены произошла ошибка.
		                            |Смена не открыта.
		                            |Дополнительное описание:
		                            |%ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
			ПараметрыИнформации.ТекстИнформации = ТекстСообщения;
			ОбщийМодульКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
		//ИначеЕсли ЗначениеЗаполнено(ТекстПереходящегоОстатка) Тогда
		//	ЗаголовокИнформации = НСтр("ru = 'Сумма остатка в кассе на начало смены'");
		//	ОбщийМодульКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстПереходящегоОстатка);
		КонецЕсли;
//		
//		Оповестить("ИзменениеСостоянияКассовойСмены", Параметры.КассаККМ);
	
	Иначе
		ТекстСообщения = НСтр("ru = 'При открытии смены произошла ошибка.
						|%ОписаниеОшибки%
						|Смена не открыта на фискальном устройстве.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		ПараметрыИнформации.ТекстИнформации = ТекстСообщения;
		ОбщийМодульКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОткрытьКассовуюСменуСервер(КассаККМ, ОписаниеОшибки)
	
	Результат = Истина;
	
	СтруктураСостояниеКассовойСмены = ПотолкиКассыОнлайн.ПолучитьСостояниеКассовойСмены(КассаККМ);
	
	ДатаОткрытияКассовойСмены = ТекущаяДатаСеанса();
	
	//ТекстПереходящегоОстатка = "";
	Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
		
		// Если смена открыта, то с момента открытия должно пройти не больше чем 24 часа.
		Если ДатаОткрытияКассовойСмены - СтруктураСостояниеКассовойСмены.ДатаИзмененияСтатуса < 86400 Тогда
			
			// Все в порядке
			
		Иначе
			
			Результат = Ложь;
			// Вероятно, что смена была не закрыта.
			ОписаниеОшибки = НСтр("ru = 'С момента открытия кассовой смены истекло более 24 часов.'");
			
		КонецЕсли;
		
	Иначе
		
		// Смена закрыта. Откроем новую кассовую смену.
		
		НоваяКассоваяСмена = Документы.КассоваяСмена.СоздатьДокумент();
		РеквизитыКассыККМ = Справочники.КассыККМ.РеквизитыКассыККМ(КассаККМ);
		ЗаполнитьЗначенияСвойств(НоваяКассоваяСмена, РеквизитыКассыККМ);
		
		НоваяКассоваяСмена.Дата                   = ДатаОткрытияКассовойСмены;
		НоваяКассоваяСмена.Статус    = Перечисления.СтатусыКассовойСмены.Открыта;
		НоваяКассоваяСмена.НачалоКассовойСмены    = ДатаОткрытияКассовойСмены;
		НоваяКассоваяСмена.ОкончаниеКассовойСмены = '00010101';
		//НоваяКассоваяСмена.Кассир                 = Пользователи.ТекущийПользователь();
		
		Если НоваяКассоваяСмена.ПроверитьЗаполнение() Тогда
			НоваяКассоваяСмена.Записать(РежимЗаписиДокумента.Проведение);
			
			//СуммаОстатка = РозничныеПродажиСервер.СуммаОстаткаДСПоКассеККМ(КассаККМ);
			//Если СуммаОстатка <> 0 Тогда
			//	ТекстПереходящегоОстатка = НСтр("ru = 'Сумма остатка в кассе: %1 руб.'");
			//	ТекстПереходящегоОстатка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПереходящегоОстатка, 
			//																			 Формат(СуммаОстатка, "ЧЦ=15; ЧДЦ=2; ЧРГ=' '; ЧН=0,00; ЧГ=3,0"));
			//КонецЕсли;
		Иначе
			Результат = Ложь;
			ОписаниеОшибки = НСтр("ru = 'Проверьте настройки кассы ККМ.'");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НапечататьОтчетБезГашения(КассаККМ)

	Результат = Ложь;
	
	ПараметрыКассыККМ       = ПотолкиКассыОнлайн.ПараметрыКассыККМ(КассаККМ);
	ИдентификаторУстройства = ПараметрыКассыККМ.ИдентификаторУстройства;
	
	ИспользоватьКассуККМБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
	
	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка печати отчета без гашения'");
	
	Если ИспользоватьПодключаемоеОборудование И НЕ ИспользоватьКассуККМБезПодключенияОборудования Тогда
		
		ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
		РеквизитыКассира = ПотолкиКассыОнлайн.РеквизитыКассира();
		ПараметрыОперации.Кассир = РеквизитыКассира.Наименование;
		
		ЭтаФорма.Доступность = Ложь;
		Оповещение = Новый ОписаниеОповещения("НапечататьОтчетБезГашенияЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьФормированиеОтчетаБезГашения(Оповещение, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьОтчетБезГашенияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина;
	
	Если НЕ РезультатВыполнения.Результат Тогда 
		
		ТекстСообщения = НСтр("ru = 'При снятии отчета на фискальном устройсве произошла ошибка.
						|%ОписаниеОшибки%
						|Отчет на фискальном регистраторе не сформирован.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		
		ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка печати отчета без гашения'");
		ПараметрыИнформации.ТекстИнформации = ТекстСообщения;
		
		ОбщийМодульКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
	КонецЕсли;
	
КонецПроцедуры

//// Процедура осуществляет вывод информации на дисплей покупателя по команде.
////
//&НаКлиенте
//Процедура ВывестиИнформациюНаДисплейПокупателя()

//	Если Не ИспользоватьПодключаемоеОборудование Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Строка1 = НСтр("ru = 'КАССА НЕ РАБОТАЕТ'");
//	Строка2 = НСтр("ru = 'СЕРВИСНЫЙ РЕЖИМ'");
//	
//	Описание = Новый ОписаниеОповещения("ВывестиИнформациюНаДисплейПокупателяЗавершение", ЭтотОбъект);
//	МенеджерОборудованияКлиент.НачатьВыводИнформацииНаДисплейПокупателя(Описание,,, Строка1 + Символы.ПС + Строка2);
//	
//КонецПроцедуры 

//&НаКлиенте
//Процедура ВывестиИнформациюНаДисплейПокупателяЗавершение(РезультатВыполнения, Параметры) Экспорт
//	
//	Если НЕ РезультатВыполнения.Результат Тогда
//		ЗаголовокИнформации = НСтр("ru = 'При использовании дисплея покупателя произошла ошибка.'"); 
//		ОбщийМодульКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, РезультатВыполнения.ОписаниеОшибки);
//	КонецЕсли;
//	
//КонецПроцедуры 

//&НаСервереБезКонтекста
//Функция ОткрытьКассовуюСменуСервер(КассаККМ, ОписаниеОшибки, ТекстПереходящегоОстатка)
//	
//	Возврат РозничныеПродажиСервер.ОткрытьКассовуюСмену(КассаККМ, ОписаниеОшибки, ТекстПереходящегоОстатка);
//	
//КонецФункции

&НаКлиенте
Процедура ВыборКассыКлиент()
	
	ТекущиеДанные = Элементы.Кассы.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если РежимВыбораКассы = "ОткрытьСмену" Тогда
			ОткрытьСмену(ТекущиеДанные.Касса);
		ИначеЕсли РежимВыбораКассы = "ЗакрытьСмену" Тогда
			ЗакрытьСмену(ТекущиеДанные.Касса);
		ИначеЕсли РежимВыбораКассы = "НапечататьОтчетБезГашения" Тогда
			НапечататьОтчетБезГашения(ТекущиеДанные.Касса);
		КонецЕсли;
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаКнопок;
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ВыборМагазинаКлиент()
//	
//	ТекущиеДанные = Элементы.Магазины.ТекущиеДанные;
//	
//	Если НЕ ТекущиеДанные = Неопределено Тогда
//		
//		Магазин = ТекущиеДанные.Магазин;
//		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаКнопок;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗакрытиеКассовойСменыПередВыходомИзРМК(Отказ, ДополнительныеПараметры)
	
	Если ПроверятьЗакрытиеКассовойСменыПередВыходомИзРМК Тогда
		
		ЗаполнитьДоступныеКассыСУчетомОткрытия(Истина);
		Если Кассы.Количество() > 0 Тогда
			Отказ = Истина;
			Если Кассы.Количество() > 1 Тогда
				ЗаголовокИнформации = НСтр("ru = 'Смены не закрыты.'");
			Иначе
				ЗаголовокИнформации = НСтр("ru = 'Смена не закрыта.'");
			КонецЕсли;
			ТекстИнформации = НСтр("ru = 'Хотите выйти из РМК?'");
			
			ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВопросаЗакрытьРМК", ЭтотОбъект, ДополнительныеПараметры);
			ОбщийМодульКлиент.ВывестиВопросДляРМКУправляемой(ЗаголовокИнформации, ТекстИнформации, , ОбработчикОповещения);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьРаботыПриОткрытии()
	ОчиститьСообщения();
	ПолучитьРабочееМесто();
	
	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	Если НЕ ПроверитьОбщуюВозможностьРаботы(ПараметрыИнформации) Тогда
		ОбщийМодульКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
	КонецЕсли;
	
КонецПроцедуры
 
#КонецОбласти