Функция ПолучитьПоясненияОтказов()
	
	Возврат МобильныйКлиент.ПолучитьПоясненияОтказов();

КонецФункции

Функция ПолучитьСреднее(СтруктураДанных, СериализованнаяСтруктураДанных)
	
	Возврат МобильныйКлиент.ПолучитьЗамеры(СтруктураДанных, СериализованнаяСтруктураДанных);
	
КонецФункции

Функция ПередатьЗакрытыеЗамерыНаСервер(СериализованнаяСтруктураДанных)
	
	Возврат МобильныйКлиент.ПередатьЗакрытыеЗамерыНаСервер(СериализованнаяСтруктураДанных);
	
КонецФункции

Функция ПередатьПрикрепленныеДанныеЗакрытыхЗамеров(СериализованнаяСтруктураДанных)
	
	Возврат МобильныйКлиент.ПередатьПрикрепленныеДанныеЗакрытыхЗамеров(СериализованнаяСтруктураДанных);
	
КонецФункции

Функция ЗапроситьОбратныйЗвонок(url)
	
	ЗапуститьПриложение(url);
	Возврат Истина;
	
КонецФункции
