
&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
	
	УстановитьВидимостьОтбораПоОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Настройки);	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СохранитьПользовательскиеНастройкиНаСервере();	
КонецПроцедуры

&НаСервере
Процедура СохранитьПользовательскиеНастройкиНаСервере()
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
КонецПроцедуры	

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
	
	УстановитьВидимостьОтбораПоОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтбораПоОрганизации()
	
	РежимОтображения = ?(Константы.ОбщиеСклады.Получить(), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
			
	// Организация
	ИдентификаторПользовательскойНастройки = Неопределено;
	Для Каждого ТекущаяСтрока Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТекущаяСтрока.ЛевоеЗначение = новый ПолеКомпоновкиДанных("Организация") Тогда
			ИдентификаторПользовательскойНастройки = ТекущаяСтрока.ИдентификаторПользовательскойНастройки;
		КонецЕсли;	
	КонецЦикла;
	
	Если ИдентификаторПользовательскойНастройки <> Неопределено И ЗначениеЗаполнено(ИдентификаторПользовательскойНастройки) Тогда
		
		ОтборОрганизация = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
		ОтборОрганизация.РежимОтображения = РежимОтображения;
		// Отключаем использование отбора если включены общие склады, т.к. могли в другом режиме включить использование
		Если Константы.ОбщиеСклады.Получить() Тогда
			ОтборОрганизация.Использование = Ложь;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьОтбораПоОрганизации();
	
КонецПроцедуры
