
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//++ №5011 комментируем т.к. теперь для звонков отдельная форма
	//ПараметрыФормы = Новый Структура("ТолькоИсториюЗвонков", Истина);
	//ОткрытьФорму("Обработка.РабочееМестоМенеджераРозничныхПродаж.Форма.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//-- №5011
	
	//++ №5011 новая форма
	ПараметрыФормы = новый Структура();
	ОткрытьФорму("ОбщаяФорма.ЖурналЗвонков", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//-- №5011
	
КонецПроцедуры
