
&НаКлиенте
Процедура СоздатьПоУмолчанию(Команда)
	СоздатьЭлементыПоУмолчанию();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыПоУмолчанию()
	макет = Справочники.ИА_Состояния.ПолучитьМакет("Шаги");
	сч = 1;
	Состояние = СокрЛП(макет.Область("R"+сч+"C1").Текст);
	Пока Состояние <> "" Цикл
		Наименование = СокрЛП(макет.Область("R"+сч+"C2").Текст);
		Шаг = СокрЛП(макет.Область("R"+сч+"C3").Текст); 
		
		Если Справочники.ИА_Состояния.НайтиПоНаименованию(Наименование,Истина) = Справочники.ИА_Состояния.ПустаяСсылка() Тогда	
			НовЭлемент = Справочники.ИА_Состояния.СоздатьЭлемент();
			НовЭлемент.Родитель = Справочники.ИА_Состояния[Состояние];
			НовЭлемент.Наименование = Наименование;
			НовЭлемент.ШагФормулы = Шаг;
			НовЭлемент.Записать();
		КонецЕсли;
		
		сч = сч + 1;
		Состояние = СокрЛП(макет.Область("R"+сч+"C1").Текст);
	КонецЦикла;
КонецПроцедуры
