Процедура ОбработкаПроведения(Отказ, Режим)
	
	//проверим, был ли введен по данному году документ ранее
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланированиеВходящихКонтактов.Ссылка
	|ИЗ
	|	Документ.ПланированиеВходящихКонтактов КАК ПланированиеВходящихКонтактов
	|ГДЕ
	|	ПланированиеВходящихКонтактов.Год = &Год
	|	И ПланированиеВходящихКонтактов.Проведен = ИСТИНА
	|	И ПланированиеВходящихКонтактов.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Год",Год);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Отказ = Истина;
		Сообщить("По данному году уже имеется проведенный документ плана: " + ВыборкаЗапроса.Ссылка,СтатусСообщения.Важное);
	КонецЦикла;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	
	Для Каждого СтрокаПлан Из План Цикл
		
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 1, СтрокаПлан.Январь);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 2, СтрокаПлан.Февраль);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 3, СтрокаПлан.Март);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 4, СтрокаПлан.Апрель);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 5, СтрокаПлан.Май);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 6, СтрокаПлан.Июнь);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 7, СтрокаПлан.Июль);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 8, СтрокаПлан.Август);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 9, СтрокаПлан.Сентябрь);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 10, СтрокаПлан.Октябрь);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 11, СтрокаПлан.Ноябрь);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 12, СтрокаПлан.Декабрь);
				
	КонецЦикла;
	
КонецПроцедуры