Функция ЛицензияДоступна(Модуль, Отказ = Ложь, Тихо = ложь) Экспорт
    
    Попытка // Для "безопасности"
    	Стр = Новый Структура(Модуль);
    Исключение
        Возврат Ложь;
    КонецПопытки; 
    
    Код = "ИА_Защита_" + Модуль + ".ЕстьЛицензия()";
    
	Попытка
		Результат = Вычислить(Код);
        Возврат Результат;
	Исключение
		Если не тихо Тогда
	        ТекстОшибки = ОписаниеОшибки();
	        Сообщение = Новый СообщениеПользователю;
	        Сообщение.Текст = "Недостаточно лицензий КСУ!";
	        Сообщение.Сообщить(); 
		КонецЕсли;
		Отказ = Истина;
    КонецПопытки;
    
    Возврат Ложь;
КонецФункции
 