
#Область ОбработчикиСобытий

Функция СформироватьТабличныйДокумент(СтруктураПараметров, АдресДляРазмещенияРезультата = Неопределено) Экспорт
	
	ТаблицаТекущихПоказателей = СтруктураПараметров.ТаблицаПоказателей;
	Период = СтруктураПараметров.Период;
	
	ВыводитьДетальныеЗаписи = СтруктураПараметров.ВыводитьДетальныеЗаписи; // для отчета "ОтчетЭффективностьМаркетинга" не требуется
	
	Таб = Новый ТабличныйДокумент;
	Таб.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + СтруктураПараметров.ИмяОтчета;
	
	Макет = ПолучитьОбщийМакет("МакетОтчетаЭффективности");
		
	Запрос = Новый Запрос(СтруктураПараметров.ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ПустойИдентификатор", новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	// #13446
	Запрос.УстановитьПараметр("ОтборПоОрганизации", СтруктураПараметров.ОтборПоОрганизации);
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);		
	
	Запрос.УстановитьПараметр("ОтборПоПоказателю", СтруктураПараметров.ОтборПоПоказателю);
	Запрос.УстановитьПараметр("Показатель", СтруктураПараметров.Показатель);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДанных.Свернуть("Раздел, ИдПоказателя, Лид, Документ, ДатаЛида, ДатаДокумента, ИсполнительРодитель, Исполнитель, ВесЗнаменателя", 
						   "ЗначениеПоказателя, Знаменатель");
	ТаблицаДанных.Сортировать("ДатаЛида, ДатаДокумента"); //#16032 для расшифровки
	
	Если НЕ ВыводитьДетальныеЗаписи Тогда
		ТаблицаДанных.ЗаполнитьЗначения(Неопределено, "Исполнитель, ИсполнительРодитель");	
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.ВыводитьГруппы Тогда
		ТаблицаДанных.ЗаполнитьЗначения(Неопределено, "ИсполнительРодитель");
	КонецЕсли;
	//
	ТаблицаГруппИсполнителей = ТаблицаДанных.Скопировать();
	ТаблицаГруппИсполнителей.Свернуть("ИсполнительРодитель");

	//
	ТаблицаИсполнителей = ТаблицаДанных.Скопировать();
	ТаблицаИсполнителей.Свернуть("ИсполнительРодитель, Исполнитель");
	
	ТаблицаИсполнителей.Сортировать("ИсполнительРодитель, Исполнитель");	
	КоличествоИсполнителей = ТаблицаИсполнителей.Количество();
	Если КоличествоИсполнителей = 0 Тогда
		//Возврат Таб;	// отчет формируем "пустым"
	КонецЕсли;
	//
	ТаблицаПоказателейИсполнителей = ТаблицаДанных.Скопировать();
	ТаблицаПоказателейИсполнителей.Свернуть("Исполнитель, Раздел, ИдПоказателя, ВесЗнаменателя", "ЗначениеПоказателя, Знаменатель");
	// расчет процентов / конверсий
	Для каждого СтрокаТЗ из ТаблицаПоказателейИсполнителей Цикл
		Если СтрокаТЗ.ВесЗнаменателя = -1 Тогда 
			Продолжить;
		КонецЕсли;
		Если СтрокаТЗ.Знаменатель = 0 Тогда
			СтрокаТЗ.ЗначениеПоказателя = 0;
			Продолжить;
		КонецЕсли;
		СтрокаТЗ.ЗначениеПоказателя = СтрокаТЗ.ЗначениеПоказателя / СтрокаТЗ.Знаменатель  * СтрокаТЗ.ВесЗнаменателя;
	КонецЦикла;
	
	//
	ТаблицаПоказателейГрупп = ТаблицаДанных.Скопировать();
	ТаблицаПоказателейГрупп.Свернуть("ИсполнительРодитель, Раздел, ИдПоказателя, ВесЗнаменателя", "ЗначениеПоказателя, Знаменатель");
	// расчет процентов / конверсий
	Для каждого СтрокаТЗ из ТаблицаПоказателейГрупп Цикл
		Если СтрокаТЗ.ВесЗнаменателя = -1 Тогда 
			Продолжить;
		КонецЕсли;
		Если СтрокаТЗ.Знаменатель = 0 Тогда
			СтрокаТЗ.ЗначениеПоказателя = 0;
			Продолжить;
		КонецЕсли;
		СтрокаТЗ.ЗначениеПоказателя = СтрокаТЗ.ЗначениеПоказателя / СтрокаТЗ.Знаменатель  * СтрокаТЗ.ВесЗнаменателя;
	КонецЦикла;
	
	//
	ТаблицаИтоговПоказателей = ТаблицаДанных.Скопировать();
	ТаблицаИтоговПоказателей.Свернуть("Раздел, ИдПоказателя", "ЗначениеПоказателя, Знаменатель");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.НаименованиеОтчета = СтруктураПараметров.ПредставлениеОтчета;
	ОбластьМакета.Параметры.НачалоПериода = Формат(Период.ДатаНачала, "ДЛФ=Д");
	ОбластьМакета.Параметры.КонецПериода = Формат(Период.ДатаОкончания, "ДЛФ=Д");
	Таб.Вывести(ОбластьМакета);
		
	//шапка
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Исполнитель");
	ОбластьМакета.Параметры.Показатель = СтруктураПараметров.ПредставлениеПоказателя;
	Таб.Вывести(ОбластьМакета);
	
	ИдПредыдущегоРаздела = Неопределено;
	ИдПредыдущегоРаздела2 = Неопределено;
	ПозицияТекРаздела = 2;
	ПозицияТекРаздела2 = 2;
	
	ТекПозиция = 2;
	Для каждого СтрокаПоказателя из ТаблицаТекущихПоказателей Цикл

		УровеньПоказателя = 2;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Показатель");
		//ОбластьМакета.Параметры.Заполнить(СтрокаПоказателя);
		ОбластьМакета.Параметры.Группировка1 = СтрокаПоказателя.ПредставлениеРаздела;
		ОбластьМакета.Параметры.Группировка2 = СтрокаПоказателя.ПредставлениеРаздела2;
		Если НЕ ЗначениеЗаполнено(СтрокаПоказателя.ИдРаздела2) Тогда
			ОбластьМакета.Параметры.Группировка2 = СтрокаПоказателя.ПредставлениеПоказателя;
		Иначе
			ОбластьМакета.Параметры.Группировка3 = СтрокаПоказателя.ПредставлениеПоказателя;
			УровеньПоказателя = 3;
		КонецЕсли;
		
		// #14909 пока убрано в рамках той же заявки
		//Если НЕ ПустаяСтрока(СтрокаПоказателя.ОписаниеПоказателя) Тогда
		//	ОбластьКолонкиЯчейки = ОбластьМакета.Область(УровеньПоказателя, 1, УровеньПоказателя, 1);
		//	ОбластьКолонкиЯчейки.Примечание.Текст = СтрокаПоказателя.ОписаниеПоказателя;
		//	
		//	ПараметрРасшифровки = "ЗначениеРасшифровкиГруппировки" + УровеньПоказателя;
		//	ОбластьМакета.Параметры[ПараметрРасшифровки] = СтрокаПоказателя.ОписаниеПоказателя;			
		//КонецЕсли;

		ОбластьЯчеек = Таб.Присоединить(ОбластьМакета);
				
		// "объединение" шапки показателя
		Если НЕ ЗначениеЗаполнено(СтрокаПоказателя.ИдРаздела2) Тогда
			ОбластьЗаголовка = Таб.Область(Таб.ВысотаТаблицы - 1, ТекПозиция, Таб.ВысотаТаблицы, ТекПозиция);
			ОбластьЗаголовка.Объединить();
		КонецЕсли;
		
		// "объединение" шапки верхнего раздела
		Если НЕ СтрокаПоказателя.ИдРаздела = ИдПредыдущегоРаздела И НЕ ИдПредыдущегоРаздела = Неопределено Тогда
			ОбластьЗаголовка = Таб.Область(Таб.ВысотаТаблицы - 2, ПозицияТекРаздела, Таб.ВысотаТаблицы - 2, ТекПозиция-1);
			ОбластьЗаголовка.Объединить();
			
			ПозицияТекРаздела = ТекПозиция;
		КонецЕсли;
		
		// "объединение" шапки раздела уровня 2
		Если НЕ СтрокаПоказателя.ИдРаздела2 = ИдПредыдущегоРаздела2 И НЕ ИдПредыдущегоРаздела2 = Неопределено Тогда
			Если ЗначениеЗаполнено(ИдПредыдущегоРаздела2) Тогда
				ОбластьЗаголовка = Таб.Область(Таб.ВысотаТаблицы - 1, ПозицияТекРаздела2, Таб.ВысотаТаблицы - 1, ТекПозиция-1);
				ОбластьЗаголовка.Объединить();
			КонецЕсли;
			
			ПозицияТекРаздела2 = ТекПозиция;
		КонецЕсли;
		
		ИдПредыдущегоРаздела = СтрокаПоказателя.ИдРаздела;
		ИдПредыдущегоРаздела2 = СтрокаПоказателя.ИдРаздела2;
		ТекПозиция = ТекПозиция + 1;
		
	КонецЦикла;
	// "объединение" шапки разделов (последние столбцы)
	ОбластьЗаголовка = Таб.Область(Таб.ВысотаТаблицы - 2, ПозицияТекРаздела, Таб.ВысотаТаблицы - 2, ТекПозиция-1);
	ОбластьЗаголовка.Объединить();
	Если ЗначениеЗаполнено(ИдПредыдущегоРаздела2) Тогда
		ОбластьЗаголовка = Таб.Область(Таб.ВысотаТаблицы - 1, ПозицияТекРаздела2, Таб.ВысотаТаблицы - 1, ТекПозиция-1);
		ОбластьЗаголовка.Объединить();
	КонецЕсли;
	
	Если ВыводитьДетальныеЗаписи Тогда
		
		Таб.НачатьАвтогруппировкуСтрок();
		
		Для каждого СтрокаГруппы из ТаблицаГруппИсполнителей Цикл
			
			Если СтруктураПараметров.ВыводитьГруппы Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Группа|Исполнитель");
				ОбластьМакета.Параметры.Заполнить(СтрокаГруппы);
				Таб.Вывести(ОбластьМакета, 1);
				Для каждого СтрокаПоказателя из ТаблицаТекущихПоказателей Цикл
					
					ОбластьМакета = Макет.ПолучитьОбласть("Группа|Показатель");	
					
					СтруктураПоиска = Новый Структура("ИсполнительРодитель, Раздел, ИдПоказателя", 
					СтрокаГруппы.ИсполнительРодитель, СтрокаПоказателя.ИдРаздела, СтрокаПоказателя.ИдПоказателя);
					ЗначениеПоказателя = ОтчетыЭффективности.ЗначениеПоказателя(ТаблицаПоказателейГрупп, СтруктураПоиска);								
					ОбластьМакета.Параметры.ЗначениеПоказателя = ОтчетыЭффективности.ФорматЯчейки(ЗначениеПоказателя, СтрокаПоказателя.Формат);
					
					Таб.Присоединить(ОбластьМакета, 1);	
					
				КонецЦикла;
			КонецЕсли;
			
			// строки исполнителей
			НайденныеСтрокиИсполнителей = ТаблицаИсполнителей.НайтиСтроки(Новый Структура("ИсполнительРодитель", СтрокаГруппы.ИсполнительРодитель));
			Для каждого СтрокаИсполнителя из НайденныеСтрокиИсполнителей Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Исполнитель");
				Исполнитель = ?(ЗначениеЗаполнено(СтрокаИсполнителя.Исполнитель), СтрокаИсполнителя.Исполнитель, НСтр("ru = '<не указан>'"));
				ОбластьМакета.Параметры.Заполнить(СтрокаИсполнителя);
				ОбластьМакета.Параметры.Исполнитель = Исполнитель;
				Таб.Вывести(ОбластьМакета, 2);
				
				Для каждого СтрокаПоказателя из ТаблицаТекущихПоказателей Цикл
					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Показатель");
					
					СтруктураПоиска = Новый Структура("Исполнитель, Раздел, ИдПоказателя", 
					СтрокаИсполнителя.Исполнитель, СтрокаПоказателя.ИдРаздела, СтрокаПоказателя.ИдПоказателя);
					ЗначениеПоказателя = ОтчетыЭффективности.ЗначениеПоказателя(ТаблицаПоказателейИсполнителей, СтруктураПоиска);								
					ОбластьМакета.Параметры.ЗначениеПоказателя = ОтчетыЭффективности.ФорматЯчейки(ЗначениеПоказателя, СтрокаПоказателя.Формат);
					
					СтруктураПоиска.Вставить("Показатель", СтрокаПоказателя.ПредставлениеПоказателя);
					СтруктураПоиска.Вставить("ПредставлениеРаздела", СтрокаПоказателя.ПредставлениеРаздела);
					СтруктураПоиска.Вставить("Формат", СтрокаПоказателя.Формат);
					ОбластьМакета.Параметры.ЗначениеРасшифровки = СтруктураПоиска;
					
					Таб.Присоединить(ОбластьМакета, 2);	
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Таб.ЗакончитьАвтогруппировкуСтрок();
		
	КонецЕсли;
	
	// ИТОГ: Сумма
	Итоги = Новый Соответствие;
	ОбластьМакета = Макет.ПолучитьОбласть("Итог|Исполнитель"); 
	Таб.Вывести(ОбластьМакета);
	
	Для каждого СтрокаПоказателя из ТаблицаТекущихПоказателей Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Итог|Показатель");
		
		СтруктураИтогов = СтрокаПоказателя.СтруктураИтогов;
		
		ЗначениеПоказателя = 0;
		Если СтруктураИтогов.ЕстьСумма Тогда
			
			// сумма как сумма показателей
			Если СтруктураИтогов.ВариантСуммы = 0 Тогда
				СтруктураПоиска = Новый Структура("Раздел, ИдПоказателя", СтрокаПоказателя.ИдРаздела, СтрокаПоказателя.ИдПоказателя);
				ЗначениеПоказателя = ОтчетыЭффективности.ЗначениеПоказателя(ТаблицаИтоговПоказателей, СтруктураПоиска);
				
			// сумма как отношение сумм двух показателей
			ИначеЕсли СтруктураИтогов.ВариантСуммы = 1 Тогда
				СтруктураПоиска = Новый Структура("Раздел, ИдПоказателя", СтрокаПоказателя.ИдРаздела, СтрокаПоказателя.ИдПоказателя);
				ЗначениеПоказателя = ОтчетыЭффективности.ЗначениеПоказателяСоЗнаменателем(ТаблицаИтоговПоказателей, СтруктураПоиска);
				
			КонецЕсли;
			
			ЗначениеПоказателя = ЗначениеПоказателя * СтруктураИтогов.ДополнительныйВесСуммы;
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.ЗначениеПоказателя = ОтчетыЭффективности.ФорматЯчейки(ЗначениеПоказателя, СтрокаПоказателя.Формат);
		
		// расшифровка итога
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Раздел", СтрокаПоказателя.ИдРаздела);
		СтруктураПоиска.Вставить("ИдПоказателя", СтрокаПоказателя.ИдПоказателя);
		СтруктураПоиска.Вставить("Показатель", СтрокаПоказателя.ПредставлениеПоказателя);
		СтруктураПоиска.Вставить("ПредставлениеРаздела", СтрокаПоказателя.ПредставлениеРаздела);
		СтруктураПоиска.Вставить("Формат", СтрокаПоказателя.Формат);
		ОбластьМакета.Параметры.ЗначениеРасшифровки = СтруктураПоиска;
		
		Итоги.Вставить(СтрокаПоказателя.ИдПоказателя, ЗначениеПоказателя);
		
		Таб.Присоединить(ОбластьМакета);	
		
	КонецЦикла;
	
	// ИТОГ: Среднее
	Если ВыводитьДетальныеЗаписи Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Среднее|Исполнитель"); 
		Таб.Вывести(ОбластьМакета);
		
		Для каждого СтрокаПоказателя из ТаблицаТекущихПоказателей Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Среднее|Показатель");
			
			СтруктураИтогов = СтрокаПоказателя.СтруктураИтогов;
			
			ЗначениеПоказателя = 0;
			Если СтруктураИтогов.ЕстьСреднее Тогда
				ЗначениеПоказателя = Итоги.Получить(СтрокаПоказателя.ИдПоказателя);
				Если ЗначениеПоказателя = Неопределено Тогда
					ЗначениеПоказателя = 0;
				КонецЕсли;	
			КонецЕсли;
			
			Если НЕ КоличествоИсполнителей = 0 Тогда
				ОбластьМакета.Параметры.ЗначениеПоказателя = ОтчетыЭффективности.ФорматСумм(ЗначениеПоказателя / КоличествоИсполнителей);
			КонецЕсли;
			
			Таб.Присоединить(ОбластьМакета);	
			
		КонецЦикла;
	КонецЕсли;
	
	Если СтруктураПараметров.КлючВарианта = "ВсеПоказатели" Тогда
		Таб.ФиксацияСлева = 1;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТабличныйДокумент", Таб);
	СтруктураВозврата.Вставить("ТаблицаДанных", ТаблицаДанных);
	
	АдресХранения = ПоместитьВоВременноеХранилище(СтруктураВозврата, АдресДляРазмещенияРезультата);
	Возврат СтруктураВозврата;
	
КонецФункции

Функция СформироватьРасшифровку(ТаблицаДанных, СтруктураРасшифровки, УникальныйИдентификатор) Экспорт
	
	Таб = Новый ТабличныйДокумент;
	Таб.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭффективностьРасшифровка";
	Макет = ПолучитьОбщийМакет("МакетРасшифровкиОтчетаЭффективности"); //ПолучитьМакет("МакетРасшифровки");
	
	ФорматПоказателя = "";
	СтруктураРасшифровки.Свойство("Формат", ФорматПоказателя);
		
	//шапка
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Исполнитель"); 
	Таб.Вывести(ОбластьМакета);	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Показатель");
	ОбластьМакета.Параметры.ПредставлениеРаздела = СтруктураРасшифровки.ПредставлениеРаздела;
	ОбластьМакета.Параметры.Показатель = СтруктураРасшифровки.Показатель;
	Таб.Присоединить(ОбластьМакета);
	
	// строки
	Итог = 0;
	СтруктураПоиска = Новый Структура("Раздел, ИдПоказателя");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтруктураРасшифровки);
	Если СтруктураРасшифровки.Свойство("Исполнитель") Тогда
		СтруктураПоиска.Вставить("Исполнитель", СтруктураРасшифровки.Исполнитель); // расшифровка по строке отчета, иначе по итогу
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаДанных.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаПоказателя из НайденныеСтроки Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка|Исполнитель");
		ОбластьМакета.Параметры.Заполнить(СтрокаПоказателя);
		Таб.Вывести(ОбластьМакета);
	
		ОбластьМакета = Макет.ПолучитьОбласть("Строка|Показатель");
		ОбластьМакета.Параметры.ЗначениеПоказателя = ОтчетыЭффективности.ФорматЯчейки(СтрокаПоказателя.ЗначениеПоказателя, ФорматПоказателя);
		Таб.Присоединить(ОбластьМакета);
		
		Итог = Итог + СтрокаПоказателя.ЗначениеПоказателя;
	КонецЦикла;
	
	// итог
	ОбластьМакета = Макет.ПолучитьОбласть("Итог|Исполнитель"); 
	Таб.Вывести(ОбластьМакета);	
	ОбластьМакета = Макет.ПолучитьОбласть("Итог|Показатель");
	ОбластьМакета.Параметры.ЗначениеПоказателя = ОтчетыЭффективности.ФорматЯчейки(Итог, ФорматПоказателя); //Итог;
	Таб.Присоединить(ОбластьМакета);
		
	Возврат ПоместитьВоВременноеХранилище(Таб, УникальныйИдентификатор);
	
КонецФункции

Процедура СохранитьПользовательскиеНастройки(Форма) Экспорт //, ДополнительныйКлючОтчета) Экспорт
	
	// с версии 8.3.13 вызывает ошибку, так как нельзя устанвливать значение "Параметр"
	// переделано на структуру
	
	//Настройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	//ЭлементыНастройки = Настройки.Элементы; //КоллекцияЭлементовПользовательскихНастроекКомпоновкиДанных
	//	
	//ПараметрОтчета = ЭлементыНастройки.Добавить(Тип("ЗначениеПараметраНастроекКомпоновкиДанных"));
	//ПараметрОтчета.Параметр = Новый ПараметрКомпоновкиДанных("Период");
	//ПараметрОтчета.ИдентификаторПользовательскойНастройки = "Период";
	//ПараметрОтчета.Значение = Форма.Период;
	//
	//ПараметрОтчета = ЭлементыНастройки.Добавить(Тип("ЗначениеПараметраНастроекКомпоновкиДанных"));
	//ПараметрОтчета.Параметр = Новый ПараметрКомпоновкиДанных("ВыводитьГруппы");
	//ПараметрОтчета.ИдентификаторПользовательскойНастройки = "ВыводитьГруппы";
	//ПараметрОтчета.Значение = Форма.ВыводитьГруппы;
	
	ЭлементыНастроек = Новый Массив;
	Настройки = Новый Структура("Элементы", ЭлементыНастроек);

	ЭлементыНастроек.Добавить(Новый Структура("Параметр, ИдентификаторПользовательскойНастройки, Значение", "Период", "Период", Форма.Период));
	ЭлементыНастроек.Добавить(Новый Структура("Параметр, ИдентификаторПользовательскойНастройки, Значение", "ВыводитьГруппы", "ВыводитьГруппы", Форма.ВыводитьГруппы));
	
	//Если ЗначениеЗаполнено(ДополнительныйКлючОтчета) Тогда 
	//	КлючОбъекта = "Отчет." + Форма.ОтчетИмя + "/" + ДополнительныйКлючОтчета + "/ПоследниеПользовательскиеНастройки";
	//Иначе
		КлючОбъекта = "Отчет." + Форма.ОтчетИмя + "/ПоследниеПользовательскиеНастройки";
	//КонецЕсли;
		
	ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта, "", Настройки);

КонецПроцедуры

Процедура ЗагрузитьПользовательскиеНастройки(Форма) Экспорт //, ДополнительныйКлючОтчета) Экспорт
	
	//Если ЗначениеЗаполнено(ДополнительныйКлючОтчета) Тогда 
	//	КлючОбъекта = "Отчет." + Форма.ОтчетИмя + "/" + ДополнительныйКлючОтчета + "/ПоследниеПользовательскиеНастройки";
	//Иначе
		КлючОбъекта = "Отчет." + Форма.ОтчетИмя + "/ПоследниеПользовательскиеНастройки";
	//КонецЕсли;
	
	ПоследниеПользовательскиеНастройки = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта,"");
	
	Если ПоследниеПользовательскиеНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПоследниеПользовательскиеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		
		Для каждого ЭлементНастройки из ПоследниеПользовательскиеНастройки.Элементы Цикл
			
			Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
				Если СтрНайти(ЭлементНастройки.ИдентификаторПользовательскойНастройки, "-") > 0 Тогда
					Продолжить;	
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
					Форма[ЭлементНастройки.ИдентификаторПользовательскойНастройки] = ЭлементНастройки.Значение;
				КонецЕсли;    
			КонецЕсли; 
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ПоследниеПользовательскиеНастройки) = Тип("Структура") Тогда
		
		Для каждого ЭлементНастройки из ПоследниеПользовательскиеНастройки.Элементы Цикл			
			Если ТипЗнч(ЭлементНастройки) = Тип("Структура") Тогда
				Если СтрНайти(ЭлементНастройки.ИдентификаторПользовательскойНастройки, "-") > 0 Тогда
					Продолжить;	
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
					Форма[ЭлементНастройки.ИдентификаторПользовательскойНастройки] = ЭлементНастройки.Значение;
				КонецЕсли;    
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ВариантыОтчетовПриОбновлении

// используется для ВариантыОтчетов.ДеревоПредопределенных
Процедура ДобавитьПредопределенныеВариантыОтчетаЭффективностьЗамерщиков(ТаблицаВариантов, ОписаниеОтчета, ОтчетТип) Экспорт
	
	ВариантыНастроек = Новый Массив;
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "ВсеПоказатели", 			"Все показатели"));  // основной	
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализЗамеровПоЗамерам", 	"1. Анализ замеров (по дате замера)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализДоговоровПоЗамерам", "2. Анализ договоров (по дате замера)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализДоговоров", 			"3. Анализ договоров (по дате договора)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализПрайсаПоЗамерам", 	"4. Анализ работы с прайсом (по дате замера)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализПрайсаПоДоговорам", 	"5. Анализ работы с прайсом (по дате договора)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализМонтажей", 			"6. Анализ монтажей (по замерщикам)"));
		
	ДобавитьПредопределенныеВариантыОтчета(ТаблицаВариантов, ОписаниеОтчета, ОтчетТип, ВариантыНастроек);
	
КонецПроцедуры

// используется для ВариантыОтчетов.ДеревоПредопределенных
Процедура ДобавитьПредопределенныеВариантыОтчетаЭффективностьМенеджеров(ТаблицаВариантов, ОписаниеОтчета, ОтчетТип) Экспорт
	
	ВариантыНастроек = Новый Массив;
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "ВсеПоказатели", 								"Все показатели"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализЛидовВПериодеОтчета", 					"1. Анализ лидов (по дате лида в разрезе менеджера лида)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализЗамеровПоДатеЛида", 						"2. Анализ замеров (по дате лида в разрезе менеджера замера)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализЗамеровПоДатеНазначения",				"3. Анализ замеров (по дате назначения замера в разрезе менеджера замера)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализДоговоровПоДатеЛида", 					"4. Анализ договоров (по дате лида в разрезе менеджера лида)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализДоговоровПоМенеджеруЛидаИДатеДоговора", 	"5. Анализ договоров (по дате договора в разрезе менеджера лида)")); // #14776
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализДоговоровПоДатеДоговора", 				"6. Анализ договоров (по дате договора в разрезе менеджера договора)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализПрайсаПоДатеЛида", 						"7. Анализ работы с прайсом (по дате лида в разрезе менеджера лида)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализПрайсаПоДатеДоговора", 					"8. Анализ работы с прайсом (по дате договора в разрезе менеджера договора)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализМонтажейПоМенеджерамЛида", 				"9. Анализ монтажей (по менеджеру лида)"));
		
	ДобавитьПредопределенныеВариантыОтчета(ТаблицаВариантов, ОписаниеОтчета, ОтчетТип, ВариантыНастроек);
	
КонецПроцедуры

// используется для ВариантыОтчетов.ДеревоПредопределенных
Процедура ДобавитьПредопределенныеВариантыОтчетаЭффективностьПоЛидам(ТаблицаВариантов, ОписаниеОтчета, ОтчетТип) Экспорт
	
	РасшифровкаПоказателя = ""; // для ЭффективностьМаркетинга
	Если ОписаниеОтчета.Метаданные = Метаданные.Отчеты.ЭффективностьВидовКонтакта Тогда
		РасшифровкаПоказателя = " (по видам контактов)";
	ИначеЕсли ОписаниеОтчета.Метаданные = Метаданные.Отчеты.ЭффективностьРекламныхАкций Тогда
		РасшифровкаПоказателя = " (по рекламным акциям)";
	ИначеЕсли ОписаниеОтчета.Метаданные = Метаданные.Отчеты.ЭффективностьРекламныхИсточников Тогда
		РасшифровкаПоказателя = " (по рекламным источникам)";
	ИначеЕсли ОписаниеОтчета.Метаданные = Метаданные.Отчеты.ЭффективностьТочекПродаж Тогда
		РасшифровкаПоказателя = " (по точкам продаж)";
	КонецЕсли;	
	
	ВариантыНастроек = Новый Массив;
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "ВсеПоказатели", 					"Все показатели"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализЛидовВПериодеОтчета", 		"1. Анализ лидов (по дате лида)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализЗамеровПоДатеЛида", 			"2. Анализ замеров (по дате лида)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализЗамеровПоДатеНазначения",	"3. Анализ замеров (по дате назначения замера)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализДоговоровПоДатеЛида", 		"4. Анализ договоров (по дате лида)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализДоговоровПоДатеДоговора", 	"5. Анализ договоров (по дате договора)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализПрайсаПоДатеЛида", 			"6. Анализ работы с прайсом (по дате лида)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализПрайсаПоДатеДоговора", 		"7. Анализ работы с прайсом (по дате договора)"));
	ВариантыНастроек.Добавить(Новый Структура("Имя, Представление", "АнализМонтажейПоМенеджерамЛида", 	СтрШаблон("8. Анализ монтажей%1", РасшифровкаПоказателя)));
		
	ДобавитьПредопределенныеВариантыОтчета(ТаблицаВариантов, ОписаниеОтчета, ОтчетТип, ВариантыНастроек);
	
КонецПроцедуры

Процедура НастроитьОтчеты(Настройки) Экспорт
	
	ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЭффективностьВидовКонтакта, "ВсеПоказатели").Включен = Истина;
	ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЭффективностьЗамерщиков, "ВсеПоказатели").Включен = Истина;
	ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЭффективностьМаркетинга, "ВсеПоказатели").Включен = Истина;
	ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЭффективностьМенеджеров, "ВсеПоказатели").Включен = Истина;
	ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЭффективностьРекламныхАкций, "ВсеПоказатели").Включен = Истина;
	ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЭффективностьРекламныхИсточников, "ВсеПоказатели").Включен = Истина;
	ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЭффективностьТочекПродаж, "ВсеПоказатели").Включен = Истина;
	
КонецПроцедуры

Процедура ДобавитьПредопределенныеВариантыОтчета(ТаблицаВариантов, ОписаниеОтчета, ОтчетТип, ВариантыНастроек)
	
	Для каждого ВариантНастроек из ВариантыНастроек Цикл
		ОписаниеВарианта = ТаблицаВариантов.Добавить();
		ОписаниеВарианта.Отчет        = ОписаниеОтчета.Отчет;
		//ОписаниеВарианта.ОтчетМетаданные = ОтчетМетаданные;
		ОписаниеВарианта.КлючВарианта = ВариантНастроек.Имя;
		ОписаниеВарианта.Наименование = ВариантНастроек.Представление;
		ОписаниеВарианта.Тип          = ОтчетТип;
		ОписаниеВарианта.ЭтоВариант   = Истина;
		//ОписаниеВарианта.Включен      = ВариантНастроек.Включен;
		//Если СтрокаОтчет.ОсновнойВариант = Неопределено Тогда
		//	СтрокаОтчет.ОсновнойВариант = Вариант;
		//КонецЕсли;
		Если ПустаяСтрока(ОписаниеОтчета.ОсновнойВариант) Тогда
			ОписаниеОтчета.ОсновнойВариант = ОписаниеВарианта.КлючВарианта;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВариантыОтчетов

Функция ВариантыОтчета(Отчет) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВариантыОтчетов.*,
	|	ВариантыОтчетов.Представление КАК Наименование, 
	|	НЕ Пользовательский КАК Предопределенный
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.Отчет = &Отчет
	|	И НЕ ВариантыОтчетов.ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Отчет", Отчет);
	
	Вариант = Запрос.Выполнить().Выбрать();
	
	Пока Вариант.Следующий() Цикл
		Результат.Добавить(Новый Структура("Ссылка, Предопределенный, КлючВарианта, ИмяКоманды, Представление, ТолькоДляАвтора, Автор",
			                    Вариант.Ссылка,
								Вариант.Предопределенный,
								Вариант.КлючВарианта,
								"Вариант_" + СтрЗаменить(Вариант.КлючВарианта, "-", ""), 
								Вариант.Наименование,
								Вариант.ТолькоДляАвтора,
								Вариант.Автор));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//Процедура ПользовательскиеВариантыОтчета(Отчет, ДополнительныйКлючОтчета, Результат) Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ВариантыОтчетов.*,
//	|	ВариантыОтчетов.Представление КАК Наименование
//	|ИЗ
//	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
//	|ГДЕ
//	|	ВариантыОтчетов.Отчет = &Отчет
//	|	И ВариантыОтчетов.ДополнительныйКлючОтчета = &ДополнительныйКлючОтчета
//	|	И НЕ ВариантыОтчетов.ПометкаУдаления
//	|	И (ВариантыОтчетов.ПредопределенныйВариант = ЗНАЧЕНИЕ(Справочник.ПредопределенныеВариантыОтчетов.ПустаяСсылка)
//	|        ИЛИ ВариантыОтчетов.ПредопределенныйВариант = НЕОПРЕДЕЛЕНО)
//	|";
//	
//	Запрос.УстановитьПараметр("Отчет", Отчет);
//	Запрос.УстановитьПараметр("ДополнительныйКлючОтчета", ДополнительныйКлючОтчета);
//	
//	Вариант = Запрос.Выполнить().Выбрать();
//	
//	Пока Вариант.Следующий() Цикл
//		Результат.Добавить(Новый Структура("КлючВарианта, ИмяКоманды, Представление, ТолькоДляАвтора, Автор",
//			                    Вариант.КлючВарианта,
//								"Вариант_" + СтрЗаменить(Вариант.КлючВарианта, "-", ""), 
//								Вариант.Наименование,
//								Вариант.ТолькоДляАвтора,
//								Вариант.Автор));
//	КонецЦикла;
//							
//КонецПроцедуры

Процедура ЗаполнитьНастройкиПользовательскогоВариантаОтчета(ОтчетСсылка, КлючВарианта, ТаблицаДоступныхПоказателей, Результат) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВариантыОтчетов.Настройки КАК Настройки
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.Отчет = &Отчет
	|	И ВариантыОтчетов.КлючВарианта = &КлючВарианта
	//|	И ВариантыОтчетов.ДополнительныйКлючОтчета = &ДополнительныйКлючОтчета
	|";
	
	Запрос.УстановитьПараметр("Отчет", ОтчетСсылка);
	Запрос.УстановитьПараметр("КлючВарианта", КлючВарианта);
	//Запрос.УстановитьПараметр("ДополнительныйКлючОтчета", ДополнительныйКлючОтчета);
	
	Вариант = Запрос.Выполнить().Выбрать();
	Если Вариант.Следующий() Тогда
		
		НастройкиОтчета = Вариант.Настройки.Получить();
		Если НЕ НастройкиОтчета = Неопределено И ТипЗнч(НастройкиОтчета) = Тип("Структура") Тогда
			Если НастройкиОтчета.Свойство("ТаблицаПоказателей") И ТипЗнч(НастройкиОтчета.ТаблицаПоказателей) = Тип("ТаблицаЗначений") Тогда
				Для каждого ПоказательПользователя из НастройкиОтчета.ТаблицаПоказателей Цикл
					Найденные = ТаблицаДоступныхПоказателей.НайтиСтроки(Новый Структура("ИдПоказателя", ПоказательПользователя.ИдПоказателя));
					НоваяСтрока = Результат.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Найденные[0]);					
				КонецЦикла;
			Иначе
				// настройки невалидные
			КонецЕсли;
		Иначе
			// настройки невалидные	
		КонецЕсли;				
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, ИдПоказателя, Результат) Экспорт
	
	НайденныеСтроки = ТаблицаДоступныхПоказателей.НайтиСтроки(Новый Структура("ИдПоказателя", ИдПоказателя));
	НоваяСтрока = Результат.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[0]);
	
КонецПроцедуры
		
#КонецОбласти

#Область ОбщиеПоказатели

Процедура ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
	                              ИДПоказателя, ПолеПоказателя, ТипПоказателя = "",
								  НаименованиеПоказателя = ""
								  ) Экспорт

	СтруктураИтоговПоУмолчанию = СтруктураИтогов();
	
	СтруктураИтоговОтношениеБезСреднего = ОтчетыЭффективности.СтруктураИтогов();
	СтруктураИтоговОтношениеБезСреднего.ЕстьСреднее = Ложь;
	СтруктураИтоговОтношениеБезСреднего.ВариантСуммы = 1;
	СтруктураИтоговОтношениеБезСреднего.ДополнительныйВесСуммы = 1;
	
	СтруктураИтоговПроцентБезСреднего = СтруктураИтогов();
	СтруктураИтоговПроцентБезСреднего.ЕстьСреднее = Ложь;
	СтруктураИтоговПроцентБезСреднего.ВариантСуммы = 1;
	СтруктураИтоговПроцентБезСреднего.ДополнительныйВесСуммы = 100;
	
	
	#Область КоличествоЗамеров
	Если ИДПоказателя = "КоличествоЗамеров" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя,
			"Назначено замеров, шт.",
			"Количество назначенных замеров: неотмененных замеров, дата которых попадает в период отчета, шт. (выезды не включаются)",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""%1"" КАК ИдПоказателя,
			|	Замеры.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	Замеры.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	Замеры.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ Замеры.Сотрудник.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	Замеры.Сотрудник КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя		
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|ГДЕ
			|	НЕ Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	И Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ Замеры.ЭтоВыезд
			|"
			, ИДПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоНеЗакрытыхЗамеров
	ИначеЕсли ИДПоказателя = "КоличествоНеЗакрытыхЗамеров" Тогда
		//КоличествоНЕЗакрытыхЗамеров = КоличествоЗамеров - (КоличествоЗамеровУспех+КоличествоЗамеровОтказ+КоличествоЗамеровНевыполнен)
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя,
			"Замеры в работе, шт.",
			"Замеры в работе: назначенных замеров, дата которых попадает в период отчета, за минусом замеров закрытых с любым результатом, шт. (выезды не включаются)",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""%1"" КАК ИдПоказателя,
			|	Замеры.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	Замеры.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	Замеры.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ Замеры.Сотрудник.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	Замеры.Сотрудник КАК Исполнитель,	
			|	1 - ВЫБОР КОГДА Замеры.Результат В (Значение(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился),
			|                         Значение(Справочник.РезультатЗамераЛида.ЗаключенДоговор),
			|                         Значение(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен))
			|        ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|ГДЕ
			|	НЕ Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	И Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ Замеры.ЭтоВыезд   
			|
			|"
			, ИДПоказателя)
			);
	#КонецОбласти

	#Область КоличествоЗакрытыхЗамеров
	ИначеЕсли ИДПоказателя = "КоличествоЗакрытыхЗамеров" Тогда
		//КоличествоЗакрытыхЗамеров = КоличествоЗамеровУспех+КоличествоЗамеровОтказ+КоличествоЗамеровНевыполнен
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗакрытыхЗамеров",
			"Закрытые замеры, шт.",
			"Количество закрытых замеров: неотмененных замеров, дата которых попадает в период отчета, и закрытых с любым результатом, шт. (выезды не включаются)",
		    , СтруктураИтоговПоУмолчанию,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""КоличествоЗакрытыхЗамеров"" КАК ИдПоказателя,
			|	Замеры.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	Замеры.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	Замеры.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ Замеры.Сотрудник.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	Замеры.Сотрудник КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|ГДЕ
			|	НЕ Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	И Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ Замеры.ЭтоВыезд
			|
			|   И Замеры.Результат В (Значение(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился),
			|                         Значение(Справочник.РезультатЗамераЛида.ЗаключенДоговор),
			|                         Значение(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен))
			|
			|");
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ЛидПоЗакрытымЗамерам";
	СтруктураРазделов.ПредставлениеРаздела2 = "В закрытых замерах";
	
	//#Область КоличествоВыполненныхЗамеров
	//ИначеЕсли ИДПоказателя = "КоличествоВыполненныхЗамеров" Тогда
	//	ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
	//		"КоличествоВыполненныхЗамеров",
	//		"Количество выполненных замеров",
	//		"Количество выполненных замеров: неотмененных замеров, дата которых попадает в период отчета, с признаком ""Выполнен"", шт. (выезды не включаются)",
	//	    , СтруктураИтоговПоУмолчанию,
	//		
	//		"ВЫБРАТЬ
	//		|	""Лид"" КАК Раздел,
	//		|   ""КоличествоВыполненныхЗамеров"" КАК ИдПоказателя,
	//		|	Замеры.ДокументЗамер КАК Документ,
	//		|	НЕОПРЕДЕЛЕНО КАК Организация,
	//		|	Замеры.Сотрудник КАК Исполнитель,
	//		|	1 КАК ЗначениеПоказателя
	//		|ИЗ
	//		|	РегистрСведений.Замеры КАК Замеры
	//		|ГДЕ
	//		|	НЕ Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
	//		|	И Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	//		|	И НЕ Замеры.ЭтоВыезд
	//		|
	//		|   И Замеры.ЗамерВыполнен
	//		|");
	//#КонецОбласти

	#Область КоличествоВыполненныхЗамеровСДоговором
	ИначеЕсли ИДПоказателя = "КоличествоВыполненныхЗамеровСДоговором" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоВыполненныхЗамеровСДоговором",
			"Замеры выполненные с договором, шт.",
			"Замеры выполненные с договором: количество неотмененных замеров, дата которых попадает в период отчета, с признаком ""Выполнен"" и результатом ""Договор заключен"", шт. (выезды не включаются)",
		    , СтруктураИтоговПоУмолчанию,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""КоличествоВыполненныхЗамеровСДоговором"" КАК ИдПоказателя,
			|	Замеры.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	Замеры.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	Замеры.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ Замеры.Сотрудник.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	Замеры.Сотрудник КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|ГДЕ
			|	НЕ Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	И Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ Замеры.ЭтоВыезд
			|
			|   И Замеры.ЗамерВыполнен
			|
			|   И Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|");
	#КонецОбласти
	
	#Область КоличествоВыполненныхЗамеровБезДоговора
	ИначеЕсли ИДПоказателя = "КоличествоВыполненныхЗамеровБезДоговора" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоВыполненныхЗамеровБезДоговора",
			"Замеры выполненные без договора, шт.",
			"Замеры выполненные без договора: количество неотмененных замеров, дата которых попадает в период отчета, с признаком ""Выполнен"" и результатом, от личным от ""Договор заключен"", шт. (выезды не включаются)",
		    , СтруктураИтоговПоУмолчанию,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""КоличествоВыполненныхЗамеровБезДоговора"" КАК ИдПоказателя,
			|	Замеры.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	Замеры.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	Замеры.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ Замеры.Сотрудник.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	Замеры.Сотрудник КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|ГДЕ
			|	НЕ Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	И Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ Замеры.ЭтоВыезд
			|
			|   И Замеры.ЗамерВыполнен
			|
			|   И НЕ Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|");
	#КонецОбласти

	#Область КоличествоЗамеровНевыполнен
	ИначеЕсли ИДПоказателя = "КоличествоЗамеровНевыполнен" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗамеровНевыполнен",
			"Количество невыполненных замеров",
			"Количество невыполненных замеров: неотмененных замеров, дата которых попадает в период отчета, и закрытых с результатом ""Замер не выполнен"", шт. (выезды не включаются)",
		    , СтруктураИтоговПоУмолчанию,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""КоличествоЗамеровНевыполнен"" КАК ИдПоказателя,
			|	Замеры.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	Замеры.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	Замеры.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ Замеры.Сотрудник.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	Замеры.Сотрудник КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|ГДЕ
			|	НЕ Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	И Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ Замеры.ЭтоВыезд
			|
			|   И Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился)
			|
			|");
	#КонецОбласти
		
	#Область КоличествоДоговоровНаЗамерах
	ИначеЕсли ИДПоказателя = "КоличествоДоговоровНаЗамерах" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоДоговоровНаЗамерах", 
			"Количество договоров на замерах, шт.",
			"Количество договоров на неотмененных замерах, дата которых попадает в период отчета, и закрытых с результатом ""Заключен договор"", шт. (выезды не включаются)",
		    , СтруктураИтоговПоУмолчанию,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""КоличествоДоговоровНаЗамерах"" КАК ИдПоказателя,
			|	Замеры.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	Замеры.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	Замеры.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ Замеры.Сотрудник.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	Замеры.Сотрудник КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|ГДЕ
			|	НЕ Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	И Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ Замеры.ЭтоВыезд
			|
			|   И Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|
			|");
	#КонецОбласти
	
	#Область СуммаДоговоровНаЗамерах
	ИначеЕсли ИДПоказателя = "СуммаДоговоровНаЗамерах" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаДоговоровНаЗамерах",
			"Сумма договоров",
			"Сумма договоров на неотмененных замерах, дата которых попадает в период отчета, и закрытых с результатом ""Заключен договор"", шт. (выезды не включаются)",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""СуммаДоговоровНаЗамерах"" КАК ИдПоказателя,
			|	Замеры.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	Замеры.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	Замеры.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ Замеры.Сотрудник.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	Замеры.Сотрудник КАК Исполнитель,
			|	Замеры.СуммаДоговора КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|ГДЕ
			|	НЕ Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	И Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ Замеры.ЭтоВыезд
			|
			|   И Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|
			|");
	#КонецОбласти

	#Область КоличествоДоговоровПоВыполненнымЗамерам
	ИначеЕсли ИДПоказателя = "КоличествоДоговоровПоВыполненнымЗамерам" Тогда
		
		// №14841 показатель нужно рассчитывать по договорам на замерах
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоДоговоровПоВыполненнымЗамерам", 
			"Договоры на замере / Выполненные замеры, %",
			"Договоры на замере / Выполненные замеры, %",
			"Сумма", СтруктураИтоговПроцентБезСреднего,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КоличествоДоговоровПоВыполненнымЗамерам"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже во вложенных запросах
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ Замеры.Сотрудник.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	Замеры.Сотрудник КАК Исполнитель,
			|	ВЫБОР
			|		КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|ГДЕ
			|	Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ Замеры.ЭтоВыезд
			|	И Замеры.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор), ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен))
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР КОГДА &ОтборПоОрганизации ТОГДА Замеры.ДокументЗамер.Организация = &Организация ИНАЧЕ ИСТИНА КОНЕЦ
			|");
		
	#КонецОбласти
	
	#Область КоличествоДоговоровПоНазначеннымЗамерам
	ИначеЕсли ИДПоказателя = "КоличествоДоговоровПоНазначеннымЗамерам" Тогда
	
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, 
			"Договоры на замере / Назначенные замеры, %",
			"Договоры на замере / Назначенные замеры, %",
	    	"Сумма", СтруктураИтоговПроцентБезСреднего,
	
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КоличествоДоговоровПоНазначеннымЗамерам"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже во вложенных запросах
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ Замеры.Сотрудник.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	Замеры.Сотрудник КАК Исполнитель,
			|	ВЫБОР
			|		КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|ГДЕ
			|	Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ Замеры.ЭтоВыезд
			|	И Замеры.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор), ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен), ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился))
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР КОГДА &ОтборПоОрганизации ТОГДА Замеры.ДокументЗамер.Организация = &Организация ИНАЧЕ ИСТИНА КОНЕЦ
			|");
		
	#КонецОбласти

	#Область КоличествоОформленныхДоговоровПоВыполненнымЗамерам
	ИначеЕсли ИДПоказателя = "КоличествоОформленныхДоговоровПоВыполненнымЗамерам" Тогда
		
		// #15996 
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоОформленныхДоговоровПоВыполненнымЗамерам", 
			"Количество оформленных договоров / Выполненные замеры, %",
			"Количество оформленных договоров / Выполненные замеры, %",
	    	"Сумма", СтруктураИтоговПроцентБезСреднего,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже во вложенных запросах
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ВложенныйЗапрос.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ВложенныйЗапрос.ИсполнительЗамера КАК Исполнитель,
			|	ВложенныйЗапрос.КоличествоДоговоров КАК ЗначениеПоказателя,
			|	ВложенныйЗапрос.КоличествоВыполненныхЗамеров КАК Знаменатель,		
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	(ВЫБРАТЬ
			// знаменатель: количество выполненных замеров (с договором или без)
			|		Замеры.Сотрудник КАК ИсполнительЗамера,
			|		1 КАК КоличествоВыполненныхЗамеров,
			|		0 КАК КоличествоДоговоров
			|	ИЗ
			|		РегистрСведений.Замеры КАК Замеры
			|	ГДЕ
			|		НЕ Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|		И Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|		И НЕ Замеры.ЭтоВыезд
			|		И Замеры.ЗамерВыполнен
			// для отдельных показателей отбор по организации применяем "сразу"
			|		И ВЫБОР
			|			КОГДА &ОтборПоОрганизации 
			|				ТОГДА Замеры.ДокументЗамер.Организация = &Организация 
			|			ИНАЧЕ 
			|				ИСТИНА 
			|		КОНЕЦ
			|		
			|	ОБЪЕДИНИТЬ ВСЕ
			// договоры, замеры которых попадают в указанный период
			|		
			|	ВЫБРАТЬ
			|		КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера,
			|		0,
			|		КонверсияВходящихКонтактовОбороты.КоличествоДоговоровОборот
			|	ИЗ
			|		РегистрНакопления.КонверсияВходящихКонтактов.Обороты(, , Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
			
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|			ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|				И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИДЗамера
			|				И ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	ГДЕ
			|		КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			// для отдельных показателей отбор по организации применяем "сразу"
			|		И ВЫБОР 
			|			КОГДА &ОтборПоОрганизации 
			|				ТОГДА ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация = &Организация 
			|			ИНАЧЕ ИСТИНА 
			|		КОНЕЦ
			|	) КАК ВложенныйЗапрос
			|	
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоОформленныхДоговоровПоНазначеннымЗамерам
	ИначеЕсли ИДПоказателя = "КоличествоОформленныхДоговоровПоНазначеннымЗамерам" Тогда
		
		// #15996 
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоОформленныхДоговоровПоНазначеннымЗамерам", 
			"Количество оформленных договоров / Назначенные замеры, %",
			"Количество оформленных договоров по дате замера / Назначенные замеры, %",
	    	"Сумма", СтруктураИтоговПроцентБезСреднего,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже во вложенных запросах
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ВложенныйЗапрос.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ВложенныйЗапрос.ИсполнительЗамера КАК Исполнитель,
			|	ВложенныйЗапрос.КоличествоДоговоров КАК ЗначениеПоказателя,
			|	ВложенныйЗапрос.КоличествоВыполненныхЗамеров КАК Знаменатель,		
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	(ВЫБРАТЬ
			// знаменатель: количество неотмененных замеров
			|		Замеры.Сотрудник КАК ИсполнительЗамера,
			|		1 КАК КоличествоВыполненныхЗамеров,
			|		0 КАК КоличествоДоговоров
			|	ИЗ
			|		РегистрСведений.Замеры КАК Замеры
			|	ГДЕ
			|		Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|		И Замеры.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор), ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен), ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился))
			|		И НЕ Замеры.ЭтоВыезд
			// для отдельных показателей отбор по организации применяем "сразу"
			|		И ВЫБОР
			|			КОГДА &ОтборПоОрганизации 
			|				ТОГДА Замеры.ДокументЗамер.Организация = &Организация 
			|			ИНАЧЕ 
			|				ИСТИНА 
			|		КОНЕЦ
			|		
			|	ОБЪЕДИНИТЬ ВСЕ
			// договоры, замеры которых попадают в указанный период
			|		
			|	ВЫБРАТЬ
			|		КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера,
			|		0,
			|		КонверсияВходящихКонтактовОбороты.КоличествоДоговоровОборот
			|	ИЗ
			|		РегистрНакопления.КонверсияВходящихКонтактов.Обороты(, , Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
			
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|			ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|				И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИДЗамера
			|				И ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	ГДЕ
			|		КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			// для отдельных показателей отбор по организации применяем "сразу"
			|		И ВЫБОР 
			|			КОГДА &ОтборПоОрганизации 
			|				ТОГДА ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация = &Организация 
			|			ИНАЧЕ ИСТИНА 
			|		КОНЕЦ
			|	) КАК ВложенныйЗапрос
			|	
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя)
			);
	#КонецОбласти	
	
	#Область КоличествоДоговоров
	ИначеЕсли ИДПоказателя = "КоличествоДоговоров" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоДоговоров",
			"Количество оформленных договоров, шт.",
			"Количество оформленных договоров, дата замера которых попадает в период отчета, шт.",
		    , СтруктураИтоговПоУмолчанию,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КоличествоДоговоров"" КАК ИдПоказателя,
			|	КонверсияВходящихКонтактовОбороты.Контакт КАК Лид,
			|	КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ,
			|	КонверсияВходящихКонтактовОбороты.Контакт.Дата КАК ДатаЛида,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.Дата КАК ДатаДокумента,
			|	ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,
			|	КонверсияВходящихКонтактовОбороты.КоличествоДоговоровОборот КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя		
			|ИЗ
			|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(,, Регистратор) КАК КонверсияВходящихКонтактовОбороты
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|      	ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|      		И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИдЗамера
			|      		И ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|ГДЕ
			|	КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			|");
	#КонецОбласти
	
	#Область СуммаДоговоров
	ИначеЕсли ИДПоказателя = "СуммаДоговоров" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаДоговоров", 
			"Сумма договоров",
			"Сумма оформленных договоров, дата замера которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СуммаДоговоров"" КАК ИдПоказателя,
			|	КонверсияВходящихКонтактовОбороты.Контакт КАК Лид,
			|	КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ,
			|	КонверсияВходящихКонтактовОбороты.Контакт.Дата КАК ДатаЛида,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.Дата КАК ДатаДокумента,
			|	ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокумента КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя		
			|ИЗ
			|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(,, Регистратор) КАК КонверсияВходящихКонтактовОбороты
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|      	ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|      		И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИдЗамера
			|      		И ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|ГДЕ
			|	КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			|");
	#КонецОбласти
	
	#Область СуммаДоговоровПоПрайсу
	ИначеЕсли ИДПоказателя = "СуммаДоговоровПоПрайсу" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаДоговоровПоПрайсу",
			"Сумма договоров по прайсу",
			"Сумма по прайсу оформленных договоров, дата замера которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СуммаДоговоровПоПрайсу"" КАК ИдПоказателя,
			|	КонверсияВходящихКонтактовОбороты.Контакт КАК Лид,
			|	КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ,
			|	КонверсияВходящихКонтактовОбороты.Контакт.Дата КАК ДатаЛида,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.Дата КАК ДатаДокумента,
			|	ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокументаПоПрайсу КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя		
			|ИЗ
			|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(,, Регистратор) КАК КонверсияВходящихКонтактовОбороты
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|      	ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|      		И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИдЗамера
			|      		И ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|ГДЕ
			|	КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			|");
	#КонецОбласти
	
	#Область СуммаОтклоненияОтПрайса
	ИначеЕсли ИДПоказателя = "СуммаОтклоненияОтПрайса" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаОтклоненияОтПрайса",
			"Сумма отклонения от прайса",
			"Разница между суммой и суммой по прайсу договоров, дата замера которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СуммаОтклоненияОтПрайса"" КАК ИдПоказателя,
			|	КонверсияВходящихКонтактовОбороты.Контакт КАК Лид,
			|	КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ,
			|	КонверсияВходящихКонтактовОбороты.Контакт.Дата КАК ДатаЛида,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.Дата КАК ДатаДокумента,
			|	ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокумента - КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокументаПоПрайсу КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя		
			|ИЗ
			|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(,, Регистратор) КАК КонверсияВходящихКонтактовОбороты
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|      	ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|      		И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИдЗамера
			|      		И ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|ГДЕ
			|	КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			|");
	#КонецОбласти

	#Область ПроцентОтклоненияОтПрайса
	ИначеЕсли ИДПоказателя = "ПроцентОтклоненияОтПрайса" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"ПроцентОтклоненияОтПрайса", 
			"Отклонение от прайса, %",
			"% отклонения от прайса по договорам, дата замера которых попадает в период отчета.",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""ПроцентОтклоненияОтПрайса"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.Дата КАК ДатаДокумента,
			|	ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокумента - КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокументаПоПрайсу КАК ЗначениеПоказателя,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокументаПоПрайсу КАК Знаменатель,		
			|	100 КАК ВесЗнаменателя
			|	ИЗ
			|		РегистрНакопления.КонверсияВходящихКонтактов.Обороты(, , Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|			ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|				И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИДЗамера
			|				И (ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
			|	ГДЕ
			|		КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			|	
			|");
	#КонецОбласти

	#Область СуммаСкидкиДоговоров
	ИначеЕсли ИДПоказателя = "СуммаСкидкиДоговоров" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаСкидкиДоговоров",
			"Сумма скидки по договорам",
			"Сумма скидки по оформленным договорам, дата замера которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СуммаСкидкиДоговоров"" КАК ИдПоказателя,
			|	КонверсияВходящихКонтактовОбороты.Контакт КАК Лид,
			|	КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ,
			|	КонверсияВходящихКонтактовОбороты.Контакт.Дата КАК ДатаЛида,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.Дата КАК ДатаДокумента,
			|	ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.СуммаСкидки КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя		
			|ИЗ
			|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(,, Регистратор) КАК КонверсияВходящихКонтактовОбороты
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|      	ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|      		И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИдЗамера
			|      		И ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|ГДЕ
			|	КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			|");
	#КонецОбласти
	
	#Область СреднийПроцентСкидкиДоговоров
	ИначеЕсли ИДПоказателя = "СреднийПроцентСкидкиДоговоров" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СреднийПроцентСкидкиДоговоров", 
			"Средняя скидка по договорам, %",
			"Средний % скидки по договорам, дата замера которых попадает в период отчета.",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СреднийПроцентСкидкиДоговоров"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.Дата КАК ДатаДокумента,
			|	ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.СуммаСкидки КАК ЗначениеПоказателя,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокумента + КонверсияВходящихКонтактовОбороты.Регистратор.СуммаСкидки КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(, , Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|		ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|			И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИДЗамера
			|			И (ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
			|	ГДЕ
			|		КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			|	
			|");
	#КонецОбласти	
	
	#Область КоличествоПотолков
	ИначеЕсли ИДПоказателя = "КоличествоПотолков" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоПотолков",
			"Количество потолков, шт.",
			"Количество потолков в оформленных договорах, дата замера которых попадает в период отчета, шт.",
		    , СтруктураИтоговПоУмолчанию,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КоличествоПотолков"" КАК ИдПоказателя,
			|	Замеры.ДокументЗамер КАК Лид,
			|	ИнфоПоТоварамДоговора.Ссылка КАК Документ,
			|	Замеры.ДокументЗамер.Дата КАК ДатаЛида,
			|	ИнфоПоТоварамДоговора.Дата КАК ДатаДокумента,
			|	ИнфоПоТоварамДоговора.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ИнфоПоТоварамДоговора.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ИнфоПоТоварамДоговора.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ИнфоПоТоварамДоговора.ИсполнительЗамера КАК Исполнитель,
			|	ИнфоПоТоварамДоговора.КоличествоПотолков КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЗаказДоговорТоварыУслуги.Ссылка КАК Ссылка,
			|			ЗаказДоговорТоварыУслуги.Ссылка.Дата КАК Дата,
			|			ЗаказДоговорТоварыУслуги.Ссылка.Организация КАК Организация,
			|			ЗаказДоговорТоварыУслуги.Ссылка.ИдентификаторЗамера КАК ИдентификаторЗамера,
			|			ЗаказДоговорТоварыУслуги.Ссылка.ИсполнительЗамера КАК ИсполнительЗамера,
			|			КОЛИЧЕСТВО(ЗаказДоговорТоварыУслуги.Номенклатура) КАК КоличествоПотолков
			|		ИЗ
			|			Документ.ЗаказДоговор.ТоварыУслуги КАК ЗаказДоговорТоварыУслуги
			|		ГДЕ
			|			(ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
			|					ИЛИ ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
			|					ИЛИ ЗаказДоговорТоварыУслуги.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности)
			|			И ЗаказДоговорТоварыУслуги.Ссылка.Проведен
			|			И ЗаказДоговорТоварыУслуги.Ссылка.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЗаказДоговорТоварыУслуги.Ссылка,
			|			ЗаказДоговорТоварыУслуги.Ссылка.Дата,
			|			ЗаказДоговорТоварыУслуги.Ссылка.Организация,
			|			ЗаказДоговорТоварыУслуги.Ссылка.ИдентификаторЗамера,
			|			ЗаказДоговорТоварыУслуги.Ссылка.ИсполнительЗамера) КАК ИнфоПоТоварамДоговора
			|		ПО (ИнфоПоТоварамДоговора.ИдентификаторЗамера = Замеры.ИДЗамера)
			|ГДЕ
			|	Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|");
	#КонецОбласти
	
	#Область Площадь
	ИначеЕсли ИДПоказателя = "Площадь" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"Площадь",
			"Площадь потолков, м2",
			"Площадь в договорах, дата замера которых попадает в период отчета. Учитываются позиции с видом ""Потолок"", ""Отрез"" и позиции с галкой ""Учитывать как потолок""",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""Площадь"" КАК ИдПоказателя,
			| 	КонверсияВходящихКонтактовОбороты.Контакт КАК Лид,
			|	КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ,
			|	КонверсияВходящихКонтактовОбороты.Контакт.Дата КАК ДатаЛида,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.Дата КАК ДатаДокумента,
			|	ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,
			|	ВТ_ПлощадиПоЗаказам.Площадь КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(,, Регистратор) КАК КонверсияВходящихКонтактовОбороты
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|      	ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|      		И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИдЗамера
			|      		И ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО КонверсияВходящихКонтактовОбороты.Регистратор = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
			|			И КонверсияВходящихКонтактовОбороты.Контакт = ВТ_ПлощадиПоЗаказам.Основание
		    |
			|ГДЕ
			|	КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			|
			|");
	#КонецОбласти

	#Область СреднееКоличествоПотолков
	ИначеЕсли ИДПоказателя = "СреднееКоличествоПотолков" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СреднееКоличествоПотолков", 
			"Среднее количество потолков, шт.",
			"Среднее количество потолков в оформленных договорах, дата замера которых попадает в период отчета",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СреднееКоличествоПотолков"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже во вложенных запросах
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ВложенныйЗапрос.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ВложенныйЗапрос.ИсполнительЗамера КАК Исполнитель,
			|	ВложенныйЗапрос.КоличествоПотолков КАК ЗначениеПоказателя,
			|	ВложенныйЗапрос.КоличествоДоговоров КАК Знаменатель,		
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	(ВЫБРАТЬ
			|			ИнфоПоТоварамДоговора.ИсполнительЗамера КАК ИсполнительЗамера,
			|			ИнфоПоТоварамДоговора.КоличествоПотолков КАК КоличествоПотолков,
			|			0 КАК КоличествоДоговоров
			|		ИЗ
			|			РегистрСведений.Замеры КАК Замеры
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					ЗаказДоговорТоварыУслуги.Ссылка.ИдентификаторЗамера КАК ИдентификаторЗамера,
			|					ЗаказДоговорТоварыУслуги.Ссылка.ИсполнительЗамера КАК ИсполнительЗамера,
			|					КОЛИЧЕСТВО(ЗаказДоговорТоварыУслуги.Номенклатура) КАК КоличествоПотолков
			|				ИЗ
			|					Документ.ЗаказДоговор.ТоварыУслуги КАК ЗаказДоговорТоварыУслуги
			|				ГДЕ
			|					(ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
			|							ИЛИ ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
			|							ИЛИ ЗаказДоговорТоварыУслуги.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности)
			|					И ЗаказДоговорТоварыУслуги.Ссылка.Проведен
			|					И ЗаказДоговорТоварыУслуги.Ссылка.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			// для отдельных показателей отбор по организации применяем "сразу"
			|					И ВЫБОР 
			|						КОГДА &ОтборПоОрганизации 
			|							ТОГДА ЗаказДоговорТоварыУслуги.Ссылка.Организация = &Организация 
			|						ИНАЧЕ ИСТИНА 
			|					КОНЕЦ
			|				
			|				СГРУППИРОВАТЬ ПО
			|					ЗаказДоговорТоварыУслуги.Ссылка.ИдентификаторЗамера,
			|					ЗаказДоговорТоварыУслуги.Ссылка.ИсполнительЗамера) КАК ИнфоПоТоварамДоговора
			|				ПО (ИнфоПоТоварамДоговора.ИдентификаторЗамера = Замеры.ИДЗамера)
			|		ГДЕ
			|			Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера,
			|			0,
			|			КонверсияВходящихКонтактовОбороты.КоличествоДоговоровОборот
			|		ИЗ
			|			РегистрНакопления.КонверсияВходящихКонтактов.Обороты(, , Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|				ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|					И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИДЗамера
			|					И (ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
			|		ГДЕ
			|           КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			// для отдельных показателей отбор по организации применяем "сразу"
			|			И ВЫБОР 
			|				КОГДА &ОтборПоОрганизации 
			|					ТОГДА ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация = &Организация 
			|				ИНАЧЕ ИСТИНА 
			|			КОНЕЦ
			|	) КАК ВложенныйЗапрос
			|	
			|");	
	#КонецОбласти
	
	#Область СредняяСуммаДоговора
	ИначеЕсли ИДПоказателя = "СредняяСуммаДоговора" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СредняяСуммаДоговора", 
			"Средняя сумма договоров",
			"Средняя сумма договоров, дата замера которых попадает в период отчета.",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СредняяСуммаДоговора"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокумента КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,		
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(, , Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|		ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|			И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИДЗамера
			|			И (ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
			|ГДЕ
			|	КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация = &Организация 
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|	
			|");
	#КонецОбласти
	
	#Область СреднийЧек
	ИначеЕсли ИДПоказателя = "СреднийЧек" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СреднийЧек", 
			"Средний чек",
			"Средний чек по договорам, дата замера которых попадает в период отчета.",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СреднийЧек"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,
			|	ЕСТЬNULL(ВТ_ОбщиеПродажиПоЛидамЗаказам.СреднийЧекСумма, 0) КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,	
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(, , Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|			ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|				И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИДЗамера
			|				И (ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПродажиПоЛидамЗаказам КАК ВТ_ОбщиеПродажиПоЛидамЗаказам
			|			ПО КонверсияВходящихКонтактовОбороты.Регистратор = ВТ_ОбщиеПродажиПоЛидамЗаказам.ЗаказДоговор
			|				И КонверсияВходящихКонтактовОбороты.Контакт = ВТ_ОбщиеПродажиПоЛидамЗаказам.Лид
			|ГДЕ
			|	КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация = &Организация 
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|	
			|");
	#КонецОбласти
	
	#Область СредняяСтоимостьМетра
	ИначеЕсли ИДПоказателя = "СредняяСтоимостьМетра" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СредняяСтоимостьМетра", 
			"Средняя стоимость 1 м2 потолков",
			"Средняя стоимость 1 м2 потолков по договорам, дата замера которых попадает в период отчета.",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СредняяСтоимостьМетра"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.СуммаДокумента КАК ЗначениеПоказателя,
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.Площадь, 0) КАК Знаменатель,
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(, , Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|		ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|			И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИДЗамера
			|			И (ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО КонверсияВходящихКонтактовОбороты.Регистратор = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
			|			И КонверсияВходящихКонтактовОбороты.Контакт = ВТ_ПлощадиПоЗаказам.Основание
			|ГДЕ
			|	КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация = &Организация 
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|	
			|");
	#КонецОбласти

	#Область СредняяПлощадь
	ИначеЕсли ИДПоказателя = "СредняяПлощадь" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СредняяПлощадь", 
			"Средняя площадь, м2",
			"Средняя площадь потолков по договорам, дата замера которых попадает в период отчета.",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СредняяПлощадь"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера КАК Исполнитель,		
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.Площадь, 0) КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,		
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрНакопления.КонверсияВходящихКонтактов.Обороты(, , Регистратор, ) КАК КонверсияВходящихКонтактовОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыВПериодОтчета
			|		ПО КонверсияВходящихКонтактовОбороты.Контакт = ЗамерыВПериодОтчета.ДокументЗамер
			|			И КонверсияВходящихКонтактовОбороты.Регистратор.ИдентификаторЗамера = ЗамерыВПериодОтчета.ИДЗамера
			|			И (ЗамерыВПериодОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО КонверсияВходящихКонтактовОбороты.Регистратор = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
			|			И КонверсияВходящихКонтактовОбороты.Контакт = ВТ_ПлощадиПоЗаказам.Основание
			|ГДЕ
			|	КонверсияВходящихКонтактовОбороты.Регистратор ССЫЛКА Документ.ЗаказДоговор
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ВЫРАЗИТЬ(КонверсияВходящихКонтактовОбороты.Регистратор КАК Документ.ЗаказДоговор).Организация = &Организация 
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|	
			|");
	#КонецОбласти

	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	#Область КоличествоДоговоровПоДоговорам
	ИначеЕсли ИДПоказателя = "КоличествоДоговоровПоДоговорам" 
		  ИЛИ ИДПоказателя = "КоличествоДоговоровПоДоговорамСМенеджеромЛида"
		Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, //"КоличествоДоговоровПоДоговорам",
			?(ПустаяСтрока(НаименованиеПоказателя), "Количество оформленных договоров, шт.", НаименованиеПоказателя),
			"Количество договоров, оформленных в период отчета, шт.",
			, СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%3, ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|		ИНАЧЕ %3.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%3, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДоговорам
	ИначеЕсли ИДПоказателя = "СуммаДоговоровПоДоговорам" 
	      ИЛИ ИДПоказателя = "СуммаДоговоровПоДоговорамСМенеджеромЛида"
		Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, //"СуммаДоговоровПоДоговорам",
			?(ПустаяСтрока(НаименованиеПоказателя), "Сумма договоров", НаименованиеПоказателя),
			"Сумма договоров, оформленных в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%3, ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|		ИНАЧЕ %3.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%3, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаДокумента КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти		
		
	#Область КоличествоПотолковПоДоговорам
	ИначеЕсли ИДПоказателя = "КоличествоПотолковПоДоговорам"
		  ИЛИ ИДПоказателя = "КоличествоПотолковПоДоговорамСМенеджеромЛида"
		Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, //"КоличествоПотолковПоДоговорам",
			?(ПустаяСтрока(НаименованиеПоказателя), "Количество потолков, шт.", НаименованиеПоказателя),
			"Количество потолков в договорах, оформленных в период отчета. Учитываются позиции с видом ""Потолок"", ""Отрез"" и позиции с галкой ""Учитывать как потолок""",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%3, ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|		ИНАЧЕ %3.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%3, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.КоличествоПотолков, 0) КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
		
	#Область ПлощадьПоДоговорам
	ИначеЕсли ИДПоказателя = "ПлощадьПоДоговорам"
		  ИЛИ ИДПоказателя = "ПлощадьПоДоговорамСМенеджеромЛида"
		Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, //"ПлощадьПоДоговорам",
			?(ПустаяСтрока(НаименованиеПоказателя), "Площадь потолков, м2", НаименованиеПоказателя),
			"Площадь в договорах, оформленных в период отчета. Учитываются позиции с видом ""Потолок"", ""Отрез"" и позиции с галкой ""Учитывать как потолок""",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%3, ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|		ИНАЧЕ %3.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%3, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.Площадь, 0) КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СреднееКоличествоПотолковПоДоговорам
	ИначеЕсли ИДПоказателя = "СреднееКоличествоПотолковПоДоговорам" 
	      ИЛИ ИДПоказателя = "СреднееКоличествоПотолковПоДоговорамСМенеджеромЛида"
		Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, //"СреднееКоличествоПотолковПоДоговорам", 
			"Среднее количество потолков, шт.",
			"Среднее количество потолков в договорах, оформленных в период отчета",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%3, ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|		ИНАЧЕ %3.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%3, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.КоличествоПотолков, 0) КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,		
			|	1 КАК ВесЗнаменателя		
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СредняяСуммаДоговораПоДоговорам
	ИначеЕсли ИДПоказателя = "СредняяСуммаДоговораПоДоговорам" 
	      ИЛИ ИДПоказателя = "СредняяСуммаДоговораПоДоговорамСМенеджеромЛида"
		Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, //"СредняяСуммаДоговораПоДоговорам", 
			"Средняя сумма договоров",
			"Средняя сумма договоров, оформленных в период отчета",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%3, ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|		ИНАЧЕ %3.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%3, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаДокумента КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,		
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация 
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СреднийЧекПоДоговорам
	ИначеЕсли ИДПоказателя = "СреднийЧекПоДоговорам" 
	      ИЛИ ИДПоказателя = "СреднийЧекПоДоговорамСМенеджеромЛида"
		Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, //"СреднийЧекПоДоговорам", 
			"Средний чек",
			"Средняя чек по договорам, оформленным в период отчета",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%3, ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|		ИНАЧЕ %3.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%3, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ЕСТЬNULL(ВТ_ОбщиеПродажиПоЗаказам.СреднийЧекСумма, 0) КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,		
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПродажиПоЗаказам КАК ВТ_ОбщиеПродажиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ОбщиеПродажиПоЗаказам.ЗаказДоговор
			
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация 
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СредняяСтоимостьМетраПоДоговорам
	ИначеЕсли ИДПоказателя = "СредняяСтоимостьМетраПоДоговорам" 
	      ИЛИ ИДПоказателя = "СредняяСтоимостьМетраПоДоговорамСМенеджеромЛида"
		Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, //"СредняяСтоимостьМетраПоДоговорам", 
			"Средняя стоимость 1 м2 потолка",
			"Средняя стоимость 1 м2 потолка по договорам, оформленным в период отчета",
		    "Сумма",СтруктураИтоговОтношениеБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%3, ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|		ИНАЧЕ %3.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%3, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаДокумента КАК ЗначениеПоказателя,
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.Площадь, 0) КАК Знаменатель,
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
			
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация 
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СредняяПлощадьПоДоговорам
	ИначеЕсли ИДПоказателя = "СредняяПлощадьПоДоговорам" 
	      ИЛИ ИДПоказателя = "СредняяПлощадьПоДоговорамСМенеджеромЛида"
		Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, //"СредняяПлощадьПоДоговорам", 
			"Средняя площадь",
			"Средняя площадь по договорам, оформленным в период отчета",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%3, ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%4.ПустаяСсылка)
			|		ИНАЧЕ %3.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%3, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.Площадь, 0) КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ПлощадиПоЗаказам.ЗаказДоговор		
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	#Область СуммаДоговоровПоДоговорамПоПрайсу
	ИначеЕсли ИДПоказателя = "СуммаДоговоровПоДоговорамПоПрайсу" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаДоговоровПоДоговорамПоПрайсу",
			"Сумма договоров по прайсу",
			"Сумма по прайсу договоров, оформленных в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Договор"" КАК Раздел,
			|   ""СуммаДоговоровПоДоговорамПоПрайсу"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаДокументаПоПрайсу КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СуммаОтклоненияПоДоговорам
	ИначеЕсли ИДПоказателя = "СуммаОтклоненияПоДоговорам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаОтклоненияПоДоговорам",
			"Сумма отклонения от прайса",
			"Разница между суммой и суммой по прайсу договоров, оформленных в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Договор"" КАК Раздел,
			|   ""СуммаОтклоненияПоДоговорам"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаДокумента - ДанныеДокумента.СуммаДокументаПоПрайсу КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	#Область ПроцентОтклоненияОтПрайсаПоДоговорам
	ИначеЕсли ИДПоказателя = "ПроцентОтклоненияОтПрайсаПоДоговорам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"ПроцентОтклоненияОтПрайсаПоДоговорам", 
			"Отклонение от прайса, %",
			"Процент отклонения суммы от суммы по прайсу договоров, оформленных в период отчета",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Договор"" КАК Раздел,
			|	""ПроцентОтклоненияОтПрайсаПоДоговорам"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаДокумента - ДанныеДокумента.СуммаДокументаПоПрайсу КАК ЗначениеПоказателя,
			|	ДанныеДокумента.СуммаДокументаПоПрайсу КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	#Область СуммаСкидкиДоговоровПоДоговорам
	ИначеЕсли ИДПоказателя = "СуммаСкидкиДоговоровПоДоговорам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаСкидкиДоговоровПоДоговорам",
			"Сумма скидки по договорам",
			"Сумма скидки по договорам, оформленных в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Договор"" КАК Раздел,
			|   ""СуммаСкидкиДоговоровПоДоговорам"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаСкидки КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СреднийПроцентСкидкиДоговоровПоДоговорам
	ИначеЕсли ИДПоказателя = "СреднийПроцентСкидкиДоговоровПоДоговорам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СреднийПроцентСкидкиДоговоровПоДоговорам", 
			"Средняя скидка по договорам, %",
			"Средний процент скидки по договорам, оформленным в период отчета",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Договор"" КАК Раздел,
			|	""СреднийПроцентСкидкиДоговоровПоДоговорам"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаСкидки КАК ЗначениеПоказателя,
			|	ДанныеДокумента.СуммаДокумента + ДанныеДокумента.СуммаСкидки КАК Знаменатель,	
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти	
		
#Область КоличествоОформленныхДоговоровПоДоговорамПоВыполненнымЗамерам
	ИначеЕсли ИДПоказателя = "КоличествоОформленныхДоговоровПоДоговорамПоВыполненнымЗамерам" Тогда
		
		// #15996 
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, 
			"Количество оформленных договоров / Выполненные замеры, %",
			"Количество оформленных договоров в период отчета / Выполненные замеры, %",
	    	"Сумма", СтруктураИтоговПроцентБезСреднего,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже во вложенных запросах
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ВложенныйЗапрос.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ВложенныйЗапрос.ИсполнительЗамера КАК Исполнитель,
			|	ВложенныйЗапрос.КоличествоДоговоров КАК ЗначениеПоказателя,
			|	ВложенныйЗапрос.КоличествоВыполненныхЗамеров КАК Знаменатель,		
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	(ВЫБРАТЬ
			// знаменатель: количество выполненных замеров (с договором или без)
			|		Замеры.Сотрудник КАК ИсполнительЗамера,
			|		1 КАК КоличествоВыполненныхЗамеров,
			|		0 КАК КоличествоДоговоров
			|	ИЗ
			|		РегистрСведений.Замеры КАК Замеры
			|	ГДЕ
			|		НЕ Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|		И Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|		И НЕ Замеры.ЭтоВыезд
			|		И Замеры.ЗамерВыполнен
			// для отдельных показателей отбор по организации применяем "сразу"
			|		И ВЫБОР
			|			КОГДА &ОтборПоОрганизации 
			|				ТОГДА Замеры.ДокументЗамер.Организация = &Организация 
			|			ИНАЧЕ 
			|				ИСТИНА 
			|		КОНЕЦ
			|		
			|	ОБЪЕДИНИТЬ ВСЕ
			// договоры, дата которых попадает в указанный период
			|		
			|	ВЫБРАТЬ
			|		ДанныеДокумента.ИсполнительЗамера,
			|		0,
			|		1
			|	ИЗ
			|		Документ.ЗаказДоговор КАК ДанныеДокумента
			|	ГДЕ
			|		ДанныеДокумента.Проведен
			|		И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|		И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|		И ВЫБОР 
			|			КОГДА &ОтборПоОрганизации 
			|				ТОГДА ДанныеДокумента.Организация = &Организация 
			|			ИНАЧЕ ИСТИНА 
			|		КОНЕЦ
			|	) КАК ВложенныйЗапрос
			|	
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоОформленныхДоговоровПоДоговорамПоНазначеннымЗамерам
	ИначеЕсли ИДПоказателя = "КоличествоОформленныхДоговоровПоДоговорамПоНазначеннымЗамерам" Тогда
		
		// #15996 
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя, 
			"Количество оформленных договоров / Назначенные замеры, %",
			"Количество оформленных договоров в период отчета / Назначенные замеры, %",
	    	"Сумма", СтруктураИтоговПроцентБезСреднего,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""%1"" КАК Раздел,
			|   ""%2"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже во вложенных запросах
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.ИсполнительЗамера = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ВложенныйЗапрос.ИсполнительЗамера.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ВложенныйЗапрос.ИсполнительЗамера КАК Исполнитель,
			|	ВложенныйЗапрос.КоличествоДоговоров КАК ЗначениеПоказателя,
			|	ВложенныйЗапрос.КоличествоВыполненныхЗамеров КАК Знаменатель,		
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	(ВЫБРАТЬ
			// знаменатель: количество неотмененных замеров
			|		Замеры.Сотрудник КАК ИсполнительЗамера,
			|		1 КАК КоличествоВыполненныхЗамеров,
			|		0 КАК КоличествоДоговоров
			|	ИЗ
			|		РегистрСведений.Замеры КАК Замеры
			|	ГДЕ
			|		Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|		И Замеры.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор), ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен), ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился))
			|		И НЕ Замеры.ЭтоВыезд
			// для отдельных показателей отбор по организации применяем "сразу"
			|		И ВЫБОР
			|			КОГДА &ОтборПоОрганизации 
			|				ТОГДА Замеры.ДокументЗамер.Организация = &Организация 
			|			ИНАЧЕ 
			|				ИСТИНА 
			|		КОНЕЦ
			|		
			|	ОБЪЕДИНИТЬ ВСЕ
			// договоры, дата которых попадает в указанный период
			|		
			|	ВЫБРАТЬ
			|		ДанныеДокумента.ИсполнительЗамера,
			|		0,
			|		1
			|	ИЗ
			|		Документ.ЗаказДоговор КАК ДанныеДокумента
			|	ГДЕ
			|		ДанныеДокумента.Проведен
			|		И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|		И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|		И ВЫБОР 
			|			КОГДА &ОтборПоОрганизации 
			|				ТОГДА ДанныеДокумента.Организация = &Организация 
			|			ИНАЧЕ ИСТИНА 
			|		КОНЕЦ
			|	) КАК ВложенныйЗапрос
			|	
			|"
			, СтруктураРазделов.ИдРаздела, ИДПоказателя)
			);
	#КонецОбласти	

	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	#Область КоличествоДоговоровПоЛидам
	ИначеЕсли ИДПоказателя = "КоличествоДоговоровПоЛидам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоДоговоровПоЛидам",
			"Количество оформленных договоров, шт.",
			"Количество оформленных договоров, основание-лид которых попадает в период отчета, шт.",
			, СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			//|	""ЛидДоговор"" КАК Раздел,
			|	""Лид"" КАК Раздел,
			|   ""КоличествоДоговоровПоЛидам"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДатеЛида
	ИначеЕсли ИДПоказателя = "СуммаДоговоровПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаДоговоровПоДатеЛида",
			"Сумма договоров",
			"Сумма договоров, основание-лид которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""СуммаДоговоровПоДатеЛида"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаДокумента КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоПотолковПоЛидам
	ИначеЕсли ИДПоказателя = "КоличествоПотолковПоЛидам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоПотолковПоЛидам",
			"Количество потолков, шт.",
			"Количество потолков в договорах, основание-лид которых попадает в период отчета. Учитываются позиции с видом ""Потолок"", ""Отрез"" и позиции с галкой ""Учитывать как потолок""",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""КоличествоПотолковПоЛидам"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.КоличествоПотолков, 0) КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка

			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
		
	#Область ПлощадьПотолковПоЛидам
	ИначеЕсли ИДПоказателя = "ПлощадьПотолковПоЛидам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"ПлощадьПотолковПоЛидам",
			"Площадь потолков, м2",
			"Площадь в договорах, основание-лид которых попадает в период отчета. Учитываются позиции с видом ""Потолок"", ""Отрез"" и позиции с галкой ""Учитывать как потолок""",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""ПлощадьПотолковПоЛидам"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.Площадь, 0) КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка

			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	#Область СреднееКоличествоПотолковПоЛидам
	ИначеЕсли ИДПоказателя = "СреднееКоличествоПотолковПоЛидам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СреднееКоличествоПотолковПоЛидам", 
			"Среднее количество потолков, шт.",
			"Среднее количество потолков в договорах, основание-лид которых попадает в период отчета",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СреднееКоличествоПотолковПоЛидам"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.КоличествоПотолков, 0) КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,		
			|	1 КАК ВесЗнаменателя		
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СредняяСуммаДоговораПоЛидам
	ИначеЕсли ИДПоказателя = "СредняяСуммаДоговораПоЛидам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СредняяСуммаДоговораПоЛидам", 
			"Средняя сумма договоров",
			"Средняя сумма договоров, основание-лид которых попадает в период отчета",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СредняяСуммаДоговораПоЛидам"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаДокумента КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,		
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка

			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	#Область СреднийЧекПоЛидам
	ИначеЕсли ИДПоказателя = "СреднийЧекПоЛидам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СреднийЧекПоЛидам", 
			"Средний чек",
			"Средний чек по договорам, основание-лид которых попадает в период отчета",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СреднийЧекПоЛидам"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ЕСТЬNULL(ВТ_ОбщиеПродажиПоЗаказам.СреднийЧекСумма, 0) КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,		
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПродажиПоЗаказам КАК ВТ_ОбщиеПродажиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ОбщиеПродажиПоЗаказам.ЗаказДоговор
			
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СредняяСтоимостьМетраПоЛидам
	ИначеЕсли ИДПоказателя = "СредняяСтоимостьМетраПоЛидам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СредняяСтоимостьМетраПоЛидам", 
			"Средняя стоимость 1 м2 потолка",
			"Средняя стоимость 1 м2 потолка по договорам, основание-лид которых попадает в период отчета",
		    "Сумма",СтруктураИтоговОтношениеБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СредняяСтоимостьМетраПоЛидам"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаДокумента КАК ЗначениеПоказателя,
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.Площадь, 0) КАК Знаменатель,
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка

			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ПлощадиПоЗаказам.ЗаказДоговор
			
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СредняяПлощадьПоЛидам
	ИначеЕсли ИДПоказателя = "СредняяПлощадьПоЛидам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СредняяПлощадьПоЛидам", 
			"Средняя площадь",
			"Средняя площадь по договорам, основание-лид которых попадает в период отчета",
		    "Сумма", СтруктураИтоговОтношениеБезСреднего,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СредняяПлощадьПоЛидам"" КАК ИдПоказателя,
			|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка) КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			// отбор по организации ниже в условии
			|	НЕОПРЕДЕЛЕНО КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ЕСТЬNULL(ВТ_ПлощадиПоЗаказам.Площадь, 0) КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка

			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадиПоЗаказам КАК ВТ_ПлощадиПоЗаказам
			|		ПО ДанныеДокумента.Ссылка = ВТ_ПлощадиПоЗаказам.ЗаказДоговор		
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			// для отдельных показателей отбор по организации применяем "сразу"
			|	И ВЫБОР 
			|		КОГДА &ОтборПоОрганизации 
			|			ТОГДА ДанныеДокумента.Организация = &Организация
			|		ИНАЧЕ ИСТИНА 
			|	КОНЕЦ
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	#Область СуммаДоговоровПоПрайсуПоДатеЛида
	ИначеЕсли ИДПоказателя = "СуммаДоговоровПоПрайсуПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаДоговоровПоПрайсуПоДатеЛида",
			"Сумма договоров по прайсу",
			"Сумма по прайсу договоров, основание-лид которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""СуммаДоговоровПоПрайсуПоДатеЛида"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаДокументаПоПрайсу КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СуммаОтклоненияОтПрайсаПоДатеЛида
	ИначеЕсли ИДПоказателя = "СуммаОтклоненияОтПрайсаПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаОтклоненияОтПрайсаПоДатеЛида",
			"Сумма отклонения от прайса",
			"Сумма отклонения от прайса по договорам, основание-лид которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""СуммаОтклоненияОтПрайсаПоДатеЛида"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.ОтклонениеОтПрайса КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область ПроцентОтклоненияОтПрайсаПоДатеЛида
	ИначеЕсли ИДПоказателя = "ПроцентОтклоненияОтПрайсаПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"ПроцентОтклоненияОтПрайсаПоДатеЛида",
			"Отклонение от прайса, %",
			"Процент отклонения от прайса по договорам, основание-лид которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""ПроцентОтклоненияОтПрайсаПоДатеЛида"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.ОтклонениеОтПрайса КАК ЗначениеПоказателя,
			|	ДанныеДокумента.СуммаДокументаПоПрайсу КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	#Область СуммаСкидкиДоговоровПоДатеЛида
	ИначеЕсли ИДПоказателя = "СуммаСкидкиДоговоровПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаСкидкиДоговоровПоДатеЛида",
			"Сумма скидки по договорам",
			"Сумма скидки по договорам, основание-лид которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""СуммаСкидкиДоговоровПоДатеЛида"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаСкидки КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
		
	#Область СреднийПроцентСкидкиДоговоровПоДатеЛида
	ИначеЕсли ИДПоказателя = "СреднийПроцентСкидкиДоговоровПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СреднийПроцентСкидкиДоговоровПоДатеЛида",
			"Средний % скидки по договорам",
			"Средний % скидки по договорам, основание-лид которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""СреднийПроцентСкидкиДоговоровПоДатеЛида"" КАК ИдПоказателя,
			| 	ДанныеЛида.Ссылка КАК Лид,
			| 	ДанныеДокумента.Ссылка КАК Документ,
			| 	ДанныеЛида.Дата КАК ДатаЛида,
			| 	ДанныеДокумента.Дата КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(%1, ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ЕСТЬNULL(%1, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
			|	ДанныеДокумента.СуммаСкидки КАК ЗначениеПоказателя,
			|	ДанныеДокумента.СуммаДокумента + ДанныеДокумента.СуммаСкидки КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.ЗаказДоговор КАК ДанныеДокумента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеЛида
			|		ПО ДанныеДокумента.Основание = ДанныеЛида.Ссылка
			|
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеДокумента.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
			|	И ДанныеЛида.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	#Область СуммаМонтажейПоДатеЗамера
	ИначеЕсли ИДПоказателя = "СуммаМонтажейПоДатеЗамера" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаМонтажейПоДатеЗамера",
			"Сумма монтажей",
			"Сумма выполненных монтажей, замер по заказ-договору которых попадает в период отчета. Учитываются документы по цепочке ""Лид - Заказ-договор - Монтаж""",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Монтаж"" КАК Раздел,
			|   ""СуммаМонтажейПоДатеЗамера"" КАК ИдПоказателя,
			|	Замеры.ДокументЗамер КАК Лид,
			|	ВТ_ОбщиеДанныеПоМонтажам.Монтаж КАК Документ,
			|	Замеры.ДокументЗамер.Дата КАК ДатаЛида,
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаМонтажа КАК ДатаДокумента,
			|	ВТ_ОбщиеДанныеПоМонтажам.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	ВТ_ОбщиеДанныеПоМонтажам.СуммаМонтажа КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбщиеДанныеПоМонтажам КАК ВТ_ОбщиеДанныеПоМонтажам
			|		ПО ВТ_ОбщиеДанныеПоМонтажам.Лид = Замеры.ДокументЗамер
			|		И Замеры.ИДЗамера = ВТ_ОбщиеДанныеПоМонтажам.ИдентификаторЗамера
			|
			|ГДЕ
			|	Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеЗамера
	ИначеЕсли ИДПоказателя = "ПлощадьПотолковМонтажейПоДатеЗамера" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"ПлощадьПотолковМонтажейПоДатеЗамера",
			"Площадь потолков, м2",
			"Площадь потолков в выполненных монтажах, замер по заказ-договору которых попадает в период отчета. Учитываются документы по цепочке ""Лид - Заказ-договор - Монтаж""",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Монтаж"" КАК Раздел,
			|   ""ПлощадьПотолковМонтажейПоДатеЗамера"" КАК ИдПоказателя,
			|	Замеры.ДокументЗамер КАК Лид,
			|	ВТ_ОбщиеДанныеПоМонтажам.Монтаж КАК Документ,
			|	Замеры.ДокументЗамер.Дата КАК ДатаЛида,
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаМонтажа КАК ДатаДокумента,
			|	ВТ_ОбщиеДанныеПоМонтажам.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	ВТ_ОбщиеДанныеПоМонтажам.ПлощадьПотолков КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК Замеры
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбщиеДанныеПоМонтажам КАК ВТ_ОбщиеДанныеПоМонтажам
			|		ПО ВТ_ОбщиеДанныеПоМонтажам.Лид = Замеры.ДокументЗамер
			|		И Замеры.ИДЗамера = ВТ_ОбщиеДанныеПоМонтажам.ИдентификаторЗамера
			|
			|ГДЕ
			|	Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
		
	#Область СуммаМонтажейПоДатеДоговора
	ИначеЕсли ИДПоказателя = "СуммаМонтажейПоДатеДоговора" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаМонтажейПоДатеДоговора",
			"Сумма монтажей",
			"Сумма выполненных монтажей, дата заказ-договора которых попадает в период отчета. Учитываются документы по цепочке ""Заказ-договор - Монтаж""",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Монтаж"" КАК Раздел,
			|   ""СуммаМонтажейПоДатеДоговора"" КАК ИдПоказателя,
			|	ВТ_ОбщиеДанныеПоМонтажам.Лид КАК Лид,
			|	ВТ_ОбщиеДанныеПоМонтажам.ЗаказДоговор КАК Документ,
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаЛида КАК ДатаЛида,
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаДоговора КАК ДатаДокумента,
			|	ВТ_ОбщиеДанныеПоМонтажам.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	ВТ_ОбщиеДанныеПоМонтажам.СуммаМонтажа КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	ВТ_ОбщиеДанныеПоМонтажам КАК ВТ_ОбщиеДанныеПоМонтажам
			|
			|ГДЕ
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаДоговора МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеДоговора
	ИначеЕсли ИДПоказателя = "ПлощадьПотолковМонтажейПоДатеДоговора" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"ПлощадьПотолковМонтажейПоДатеДоговора",
			"Площадь потолков, м2",
			"Площадь потолков в выполненных монтажах, дата заказ-договора которых попадает в период отчета. Учитываются документы по цепочке ""Заказ-договор - Монтаж""",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Монтаж"" КАК Раздел,
			|   ""ПлощадьПотолковМонтажейПоДатеДоговора"" КАК ИдПоказателя,
			|	ВТ_ОбщиеДанныеПоМонтажам.Лид КАК Лид,
			|	ВТ_ОбщиеДанныеПоМонтажам.ЗаказДоговор КАК Документ,
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаЛида КАК ДатаЛида,
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаДоговора КАК ДатаДокумента,
			|	ВТ_ОбщиеДанныеПоМонтажам.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	ВТ_ОбщиеДанныеПоМонтажам.ПлощадьПотолков КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	ВТ_ОбщиеДанныеПоМонтажам КАК ВТ_ОбщиеДанныеПоМонтажам
			|
			|ГДЕ
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаДоговора МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
		
	#Область СуммаМонтажейПоДатеМонтажа
	ИначеЕсли ИДПоказателя = "СуммаМонтажейПоДатеМонтажа" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаМонтажейПоДатеМонтажа",
			"Сумма монтажей",
			"Сумма выполненных монтажей, дата выполнения которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Монтаж"" КАК Раздел,
			|   ""СуммаМонтажейПоДатеМонтажа"" КАК ИдПоказателя,
			|	ВТ_ОбщиеДанныеПоМонтажам.Лид КАК Лид,
			|	ВТ_ОбщиеДанныеПоМонтажам.Монтаж КАК Документ,
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаЛида КАК ДатаЛида,
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаМонтажа КАК ДатаДокумента,
			|	ВТ_ОбщиеДанныеПоМонтажам.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	ВТ_ОбщиеДанныеПоМонтажам.СуммаМонтажа КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	ВТ_ОбщиеДанныеПоМонтажам КАК ВТ_ОбщиеДанныеПоМонтажам
			|
			|ГДЕ
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаВыполненияМонтажа МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеМонтажа
	ИначеЕсли ИДПоказателя = "ПлощадьПотолковМонтажейПоДатеМонтажа" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"ПлощадьПотолковМонтажейПоДатеМонтажа",
			"Площадь потолков, м2",
			"Площадь потолков в выполненных монтажах, дата выполнения которых попадает в период отчета",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Монтаж"" КАК Раздел,
			|   ""ПлощадьПотолковМонтажейПоДатеМонтажа"" КАК ИдПоказателя,
			|	ВТ_ОбщиеДанныеПоМонтажам.Лид КАК Лид,
			|	ВТ_ОбщиеДанныеПоМонтажам.Монтаж КАК Документ,
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаЛида КАК ДатаЛида,
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаМонтажа КАК ДатаДокумента,
			|	ВТ_ОбщиеДанныеПоМонтажам.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	ВТ_ОбщиеДанныеПоМонтажам.ПлощадьПотолков КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	ВТ_ОбщиеДанныеПоМонтажам КАК ВТ_ОбщиеДанныеПоМонтажам
			|
			|ГДЕ
			|	ВТ_ОбщиеДанныеПоМонтажам.ДатаВыполненияМонтажа МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	#Область КоличествоСозданныхЛидов
	ИначеЕсли ИДПоказателя = "КоличествоСозданныхЛидов" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоСозданныхЛидов",
			"Количество созданных лидов, шт.",
			"Количество лидов, дата которых попадает в период отчета; анализ ведется по реквизиту ""Менеджер"" документа ""Лид""",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КоличествоСозданныхЛидов"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеДокумента.%1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ ДанныеДокумента.%1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеДокумента.%1 КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.Лид КАК ДанныеДокумента
			|ГДЕ
			|	НЕ ДанныеДокумента.ПометкаУдаления
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоЦелевыхЛидов
	ИначеЕсли ИДПоказателя = "КоличествоЦелевыхЛидов" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЦелевыхЛидов",
			"Целевые лиды, шт.",
			"Количество лидов, дата которых попадает в период отчета и статус которых отличается от ""Нецелевой"", ""Обращение""; анализ ведется по реквизиту ""Менеджер"" документа ""Лид""",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КоличествоЦелевыхЛидов"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеДокумента.%1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ ДанныеДокумента.%1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеДокумента.%1 КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.Лид КАК ДанныеДокумента
			|ГДЕ
			|	НЕ ДанныеДокумента.ПометкаУдаления
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеДокумента.ТекущийСтатус В (ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НеЦелевой), ЗНАЧЕНИЕ(Справочник.СтатусыЛида.Обращение))
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область ПроцентЦелевыхЛидов
	ИначеЕсли ИДПоказателя = "ПроцентЦелевыхЛидов" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"ПроцентЦелевыхЛидов",
			"Целевые лиды, %",
			"Процент целевых лидов от общего количества созданных лидов",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,	
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""ПроцентЦелевыхЛидов"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеДокумента.%1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ ДанныеДокумента.%1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеДокумента.%1 КАК Исполнитель,
			|	ВЫБОР
			|		КОГДА ДанныеДокумента.ТекущийСтатус В (ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НеЦелевой), ЗНАЧЕНИЕ(Справочник.СтатусыЛида.Обращение))
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.Лид КАК ДанныеДокумента
			|ГДЕ
			|	НЕ ДанныеДокумента.ПометкаУдаления
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);	
	#КонецОбласти
	
	#Область КоличествоЛидовОбращений
	ИначеЕсли ИДПоказателя = "КоличествоЛидовОбращений" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЛидовОбращений",
			"Обращения, шт.",
			"Количество лидов, дата которых попадает в период отчета и статус которых ""Обращение""; анализ ведется по реквизиту ""Менеджер"" документа ""Лид""",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КоличествоЛидовОбращений"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеДокумента.%1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ ДанныеДокумента.%1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеДокумента.%1 КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя		
			|ИЗ
			|	Документ.Лид КАК ДанныеДокумента
			|ГДЕ
			|	НЕ ДанныеДокумента.ПометкаУдаления
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.Обращение)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область ПроцентЛидовОбращений
	ИначеЕсли ИДПоказателя = "ПроцентЛидовОбращений" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"ПроцентЛидовОбращений",
			"Обращения, %",
			"Процент лидов в статусе ""Обращение"" от общего количества созданных лидов",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,	
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""ПроцентЛидовОбращений"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеДокумента.%1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ ДанныеДокумента.%1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеДокумента.%1 КАК Исполнитель,
			|	ВЫБОР
			|		КОГДА ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.Обращение)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.Лид КАК ДанныеДокумента
			|ГДЕ
			|	НЕ ДанныеДокумента.ПометкаУдаления
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	#Область КоличествоНецелевыхЛидов
	ИначеЕсли ИДПоказателя = "КоличествоНецелевыхЛидов" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоНецелевыхЛидов",
			"Нецелевые лиды, шт.",
			"Количество лидов, дата которых попадает в период отчета и статус которых ""Нецелевой""; анализ ведется по реквизиту ""Менеджер"" документа ""Лид""",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КоличествоНецелевыхЛидов"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеДокумента.%1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ ДанныеДокумента.%1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеДокумента.%1 КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.Лид КАК ДанныеДокумента
			|ГДЕ
			|	НЕ ДанныеДокумента.ПометкаУдаления
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НеЦелевой)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область ПроцентНецелевыхЛидов
	ИначеЕсли ИДПоказателя = "ПроцентНецелевыхЛидов" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"ПроцентНецелевыхЛидов",
			"Нецелевые лиды, %",
			"Процент лидов в статусе ""Нецелевой"" от общего количества созданных лидов",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,	
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""ПроцентНецелевыхЛидов"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеДокумента.%1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ ДанныеДокумента.%1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеДокумента.%1 КАК Исполнитель,
			|	ВЫБОР
			|		КОГДА ДанныеДокумента.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НеЦелевой)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	Документ.Лид КАК ДанныеДокумента
			|ГДЕ
			|	НЕ ДанныеДокумента.ПометкаУдаления
			|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоЗамеровПоДатеЛида
	ИначеЕсли ИДПоказателя = "КоличествоЗамеровПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗамеровПоДатеЛида",
			"Назначено замеров, шт.",
			"Количество замеров в лидах, дата которых попадает в период отчета, выезды не учитываются",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			//|	""ЗамерыПоДатеЛида"" КАК Раздел,
			|	""Лид"" КАК Раздел,
			|	""КоличествоЗамеровПоДатеЛида"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|	ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоЗамеровПоДатеЛидаМенеджерСовпадает
	ИначеЕсли ИДПоказателя = "КоличествоЗамеровПоДатеЛидаМенеджерСовпадает" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗамеровПоДатеЛидаМенеджерСовпадает",
			"Количество, шт.",
			"",
		    , СтруктураИтоговПоУмолчанию,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КоличествоЗамеровПоДатеЛидаМенеджерСовпадает"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеРегистра.НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ДанныеРегистра.НазначилЗамер.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеРегистра.НазначилЗамер КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|	ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|		И ДанныеРегистра.НазначилЗамер = ДанныеДокумента.Менеджер
			|ГДЕ
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|
			|");
	#КонецОбласти
	
	#Область КонверсияЗамеровПоДатеЛидаМенеджерСовпадает
	ИначеЕсли ИДПоказателя = "КонверсияЗамеровПоДатеЛидаМенеджерСовпадает" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КонверсияЗамеровПоДатеЛидаМенеджерСовпадает",
			"Конверсия, %",
			"Конверсия, %",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КонверсияЗамеровПоДатеЛидаМенеджерСовпадает"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеРегистра.НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ДанныеРегистра.НазначилЗамер.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеРегистра.НазначилЗамер КАК Исполнитель,
			|	ВЫБОР КОГДА ДанныеРегистра.НазначилЗамер = ДанныеДокумента.Менеджер ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|	ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|
			|");
	#КонецОбласти
	
	#Область КоличествоЗамеровПоДатеЛидаМенеджерНеСовпадает
	ИначеЕсли ИДПоказателя = "КоличествоЗамеровПоДатеЛидаМенеджерНеСовпадает" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗамеровПоДатеЛидаМенеджерНеСовпадает",
			"Количество, шт.",
			"Количество замеров в лидах, дата которых попадает в период отчета, выезды не учитываются",
		    , СтруктураИтоговПоУмолчанию,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КоличествоЗамеровПоДатеЛидаМенеджерНеСовпадает"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеРегистра.НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ДанныеРегистра.НазначилЗамер.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеРегистра.НазначилЗамер КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|			И НЕ ДанныеРегистра.НазначилЗамер = ДанныеДокумента.Менеджер
			|ГДЕ
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|
			|");
	#КонецОбласти
	
	#Область КонверсияЗамеровПоДатеЛидаМенеджерНеСовпадает 
	ИначеЕсли ИДПоказателя = "КонверсияЗамеровПоДатеЛидаМенеджерНеСовпадает" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КонверсияЗамеровПоДатеЛидаМенеджерНеСовпадает",
			"Конверсия, %",
			"Конверсия, %",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
			
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КонверсияЗамеровПоДатеЛидаМенеджерНеСовпадает"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеРегистра.НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ДанныеРегистра.НазначилЗамер.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеРегистра.НазначилЗамер КАК Исполнитель,
			|	ВЫБОР КОГДА НЕ ДанныеРегистра.НазначилЗамер = ДанныеДокумента.Менеджер ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|
			|");
	#КонецОбласти
	
	#Область КоличествоЗамеровВРаботеПоДатеЛида
	ИначеЕсли ИДПоказателя = "КоличествоЗамеровВРаботеПоДатеЛида" Тогда
		//КоличествоЗамеров - (КоличествоЗамеровУспех+КоличествоЗамеровОтказ+КоличествоЗамеровНевыполнен)
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗамеровВРаботеПоДатеЛида",
			"Замеры в работе, шт.",
			"Замеры в работе: назначенных замеров, дата лида которых попадает в период отчета, за минусом замеров закрытых с любым результатом, шт. (выезды не включаются)",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""КоличествоЗамеровВРаботеПоДатеЛида"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	1 - ВЫБОР КОГДА ДанныеРегистра.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился),
			|                         ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор),
			|                         ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен),
			|						  ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен))
			|        ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			//|	И НЕ ДанныеРегистра.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	И НЕ ДанныеРегистра.ЭтоВыезд   
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровПоДатеЛида
	ИначеЕсли ИДПоказателя = "КоличествоЗакрытыхЗамеровПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗакрытыхЗамеровПоДатеЛида",
			"Итого закрытых замеров в периоде, шт.",
			"Количество закрытых замеров: замеров, дата лида которых попадает в период отчета, и закрытых с любым результатом, шт. (выезды не включаются)",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""КоличествоЗакрытыхЗамеровПоДатеЛида"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			//|	И НЕ ДанныеРегистра.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|   И ДанныеРегистра.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился),
			|                         ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор),
			|                         ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен),
			|                         ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
		
	#Область КоличествоЗакрытыхЗамеровОтмененныеПоДатеЛида
	ИначеЕсли ИДПоказателя = "КоличествоЗакрытыхЗамеровОтмененныеПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗакрытыхЗамеровОтмененныеПоДатеЛида",
			"Отмененные замеры",
			"",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""КоличествоЗакрытыхЗамеровОтмененныеПоДатеЛида"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеЛида
	ИначеЕсли ИДПоказателя = "КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя,
			"Замеры без заключенного договора",
			"",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""%1"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %2 = ЗНАЧЕНИЕ(Справочник.%3.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%3.ПустаяСсылка)
			|		ИНАЧЕ %2.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%2 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен)
			|
			|"
			, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеЛида
	ИначеЕсли ИДПоказателя = "КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя,
			"Замеры с заключенным договором",
			"",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""%1"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %2 = ЗНАЧЕНИЕ(Справочник.%3.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%3.ПустаяСсылка)
			|		ИНАЧЕ %2.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%2 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|
			|"
			, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеЛида
	ИначеЕсли ИДПоказателя = "КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеЛида",
			"Невыполненные замеры",
			"",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|   ""КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеЛида"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	#Область КоличествоДоговоровЗамерщикаПоДатеЛида
	ИначеЕсли ИДПоказателя = "КоличествоДоговоровЗамерщикаПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоДоговоровЗамерщикаПоДатеЛида", 
			"Количество договоров на замерах, шт.",
			"Количество договоров на замерах по данным замерщика",
		    "", СтруктураИтоговПоУмолчанию,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КоличествоДоговоровЗамерщикаПоДатеЛида"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СуммаДоговоровЗамерщикаПоДатеЛида
	ИначеЕсли ИДПоказателя = "СуммаДоговоровЗамерщикаПоДатеЛида" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаДоговоровЗамерщикаПоДатеЛида", 
			"Сумма договоров на замерах",
			"Сумма договоров на замерах по данным замерщика",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""СуммаДоговоровЗамерщикаПоДатеЛида"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,	
			|	ДанныеРегистра.СуммаДоговора КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КонверсияПоДатеЛидаДоговоровКВыполненнымЗамерам
	ИначеЕсли ИДПоказателя = "КонверсияПоДатеЛидаДоговоровКВыполненнымЗамерам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КонверсияПоДатеЛидаДоговоровКВыполненнымЗамерам",
			"Договоры на замере / Выполненные замеры, %",
			"Договоры на замере / Выполненные замеры, %",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КонверсияПоДатеЛидаДоговоровКВыполненнымЗамерам"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	ВЫБОР КОГДА ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И (ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|      ИЛИ ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен))
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КонверсияПоДатеЛидаДоговоровКНазначеннымЗамерам
	ИначеЕсли ИДПоказателя = "КонверсияПоДатеЛидаДоговоровКНазначеннымЗамерам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КонверсияПоДатеЛидаДоговоровКНазначеннымЗамерам",
			"Договоры на замере / Назначенные замеры, %",
			"Договоры на замере / Назначенные замеры, %",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""Лид"" КАК Раздел,
			|	""КонверсияПоДатеЛидаДоговоровКНазначеннымЗамерам"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	ВЫБОР КОГДА ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ
			|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И (ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|      ИЛИ ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен)
			|      ИЛИ ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился))
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	#Область КоличествоЗамеровПоДатеНазначения
	ИначеЕсли ИДПоказателя = "КоличествоЗамеровПоДатеНазначения" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗамеровПоДатеНазначения",
			"Назначено замеров, шт.",
			"Количество замеров, дата назначения которых попадает в период отчета, выезды не учитываются",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|	""КоличествоЗамеровПоДатеНазначения"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	
	#Область КоличествоЗамеровПоДатеНазначенияМенеджерСовпадает
	ИначеЕсли ИДПоказателя = "КоличествоЗамеровПоДатеНазначенияМенеджерСовпадает" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗамеровПоДатеНазначенияМенеджерСовпадает",
			"Количество, шт.",
			"",
		    , СтруктураИтоговПоУмолчанию,
			
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|	""КоличествоЗамеровПоДатеНазначенияМенеджерСовпадает"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеРегистра.НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ДанныеРегистра.НазначилЗамер.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеРегистра.НазначилЗамер КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|	ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|		И ДанныеРегистра.НазначилЗамер = ДанныеДокумента.Менеджер
			|ГДЕ
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|
			|");
	#КонецОбласти
	
	#Область КонверсияЗамеровПоДатеНазначенияМенеджерСовпадает
	ИначеЕсли ИДПоказателя = "КонверсияЗамеровПоДатеНазначенияМенеджерСовпадает" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КонверсияЗамеровПоДатеНазначенияМенеджерСовпадает",
			"Конверсия, %",
			"Конверсия, %",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
			
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|	""КонверсияЗамеровПоДатеНазначенияМенеджерСовпадает"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеРегистра.НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ДанныеРегистра.НазначилЗамер.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеРегистра.НазначилЗамер КАК Исполнитель,
			|	ВЫБОР КОГДА ДанныеРегистра.НазначилЗамер = ДанныеДокумента.Менеджер ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|	ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			
			|ГДЕ
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|
			|");
	#КонецОбласти
	
	#Область КоличествоЗамеровПоДатеНазначенияМенеджерНеСовпадает 
	ИначеЕсли ИДПоказателя = "КоличествоЗамеровПоДатеНазначенияМенеджерНеСовпадает" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗамеровПоДатеНазначенияМенеджерНеСовпадает",
			"Количество, шт.",
			"Количество замеров в лидах, дата которых попадает в период отчета, выезды не учитываются",
		    , СтруктураИтоговПоУмолчанию,
			
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|	""КоличествоЗамеровПоДатеНазначенияМенеджерНеСовпадает"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеРегистра.НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ДанныеРегистра.НазначилЗамер.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеРегистра.НазначилЗамер КАК Исполнитель,
			|	1 КАК ЗначениеПоказателя,
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|			И НЕ ДанныеРегистра.НазначилЗамер = ДанныеДокумента.Менеджер
			
			|ГДЕ
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|
			|");
	#КонецОбласти
	
	#Область КонверсияЗамеровПоДатеНазначенияМенеджерНеСовпадает
	ИначеЕсли ИДПоказателя = "КонверсияЗамеровПоДатеНазначенияМенеджерНеСовпадает" Тогда	
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КонверсияЗамеровПоДатеНазначенияМенеджерНеСовпадает",
			"Конверсия, %",
			"Конверсия, %",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
			
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|	""КонверсияЗамеровПоДатеНазначенияМенеджерНеСовпадает"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ДанныеРегистра.НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|		ИНАЧЕ ДанныеРегистра.НазначилЗамер.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	ДанныеРегистра.НазначилЗамер КАК Исполнитель,
			|	ВЫБОР КОГДА НЕ ДанныеРегистра.НазначилЗамер = ДанныеДокумента.Менеджер ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка		
			|ГДЕ
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|
			|");
	#КонецОбласти
	
	#Область КоличествоЗамеровВРаботеПоДатеНазначения
	ИначеЕсли ИДПоказателя = "КоличествоЗамеровВРаботеПоДатеНазначения" Тогда
		//КоличествоЗамеров - (КоличествоЗамеровУспех+КоличествоЗамеровОтказ+КоличествоЗамеровНевыполнен)
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗамеровВРаботеПоДатеНазначения",
			"Замеры в работе, шт.",
			"Замеры в работе: назначенных замеров, дата назначения которых попадает в период отчета, за минусом замеров закрытых с любым результатом, шт. (выезды не включаются)",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|   ""КоличествоЗамеровВРаботеПоДатеНазначения"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	1 - ВЫБОР КОГДА ДанныеРегистра.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился),
			|                         ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор),
			|                         ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен),
			|						  ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен))
			|        ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			//|	И НЕ ДанныеРегистра.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	И НЕ ДанныеРегистра.ЭтоВыезд   
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровПоДатеНазначения
	ИначеЕсли ИДПоказателя = "КоличествоЗакрытыхЗамеровПоДатеНазначения" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗакрытыхЗамеровПоДатеНазначения",
			"Итого закрытых замеров в периоде, шт.",
			"Количество закрытых замеров: замеров, дата назначения которых попадает в период отчета, и закрытых с любым результатом, шт. (выезды не включаются)",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|   ""КоличествоЗакрытыхЗамеровПоДатеНазначения"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			//|	И НЕ ДанныеРегистра.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|   И ДанныеРегистра.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился),
			|                         ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор),
			|                         ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен),
			|                         ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|	)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
		
	#Область КоличествоЗакрытыхЗамеровОтмененныеПоДатеНазначения
	ИначеЕсли ИДПоказателя = "КоличествоЗакрытыхЗамеровОтмененныеПоДатеНазначения" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗакрытыхЗамеровОтмененныеПоДатеНазначения",
			"Отмененные замеры",
			"",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|   ""КоличествоЗакрытыхЗамеровОтмененныеПоДатеНазначения"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеНазначения
	ИначеЕсли ИДПоказателя = "КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеНазначения" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя,
			"Замеры без заключенного договора",
			"",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|   ""%1"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %2 = ЗНАЧЕНИЕ(Справочник.%3.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%3.ПустаяСсылка)
			|		ИНАЧЕ %2.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%2 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен)
			|
			|"
			, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеНазначения
	ИначеЕсли ИДПоказателя = "КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеНазначения" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			ИДПоказателя,
			"Замеры с заключенным договором",
			"",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|   ""%1"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %2 = ЗНАЧЕНИЕ(Справочник.%3.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%3.ПустаяСсылка)
			|		ИНАЧЕ %2.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%2 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|
			|"
			, ИДПоказателя, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеНазначения
	ИначеЕсли ИДПоказателя = "КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеНазначения" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеНазначения",
			"Невыполненные замеры",
			"",
		    , СтруктураИтоговПоУмолчанию,
			
			СтрШаблон(
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|   ""КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеНазначения"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	#Область КоличествоДоговоровПоДатеНазначения
	ИначеЕсли ИДПоказателя = "КоличествоДоговоровПоДатеНазначения" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КоличествоДоговоровПоДатеНазначения", 
			"Количество договоров на замерах, шт.",
			"Количество договоров на замерах по данным замерщика",
		    "", СтруктураИтоговПоУмолчанию,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|	""КоличествоДоговоровПоДатеНазначения"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,	
			|	1 КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДатеНазначения
	ИначеЕсли ИДПоказателя = "СуммаДоговоровПоДатеНазначения" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"СуммаДоговоровПоДатеНазначения", 
			"Сумма договоров на замерах",
			"Сумма договоров на замерах по данным замерщика",
		    "Сумма", СтруктураИтоговПоУмолчанию,
		
			СтрШаблон(
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|	""СуммаДоговоровПоДатеНазначения"" КАК ИдПоказателя,
			|	ДанныеРегистра.ДокументЗамер КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеРегистра.ДокументЗамер.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеРегистра.ДокументЗамер.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,	
			|	ДанныеРегистра.СуммаДоговора КАК ЗначениеПоказателя,		
			|	0 КАК Знаменатель,
			|	-1 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ		
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
		
	#Область КонверсияПоНазначенияЛидаДоговоровКВыполненнымЗамерам
	ИначеЕсли ИДПоказателя = "КонверсияПоНазначенияЛидаДоговоровКВыполненнымЗамерам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КонверсияПоДатеНазначенияДоговоровКВыполненнымЗамерам",
			"Договоры / Выполненные замеры, %",
			"Договоры / Выполненные замеры, %",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|	""КонверсияПоДатеНазначенияДоговоровКВыполненнымЗамерам"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	ВЫБОР КОГДА ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И (ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|      ИЛИ ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен))
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти
	
	#Область КонверсияПоДатеНазначенияДоговоровКНазначеннымЗамерам
	ИначеЕсли ИДПоказателя = "КонверсияПоДатеНазначенияДоговоровКНазначеннымЗамерам" Тогда
		ОтчетыЭффективности.ДобавитьПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
			"КонверсияПоДатеНазначенияДоговоровКНазначеннымЗамерам",
			"Договоры / Назначенные замеры, %",
			"Договоры / Назначенные замеры, %",
		    "Сумма", СтруктураИтоговПроцентБезСреднего,
		
		    СтрШаблон(
			"ВЫБРАТЬ
			|	""ЗамерыПоДатеНазначения"" КАК Раздел,
			|	""КонверсияПоДатеНазначенияДоговоровКНазначеннымЗамерам"" КАК ИдПоказателя,
			|	ДанныеДокумента.Ссылка КАК Лид,
			|	НЕОПРЕДЕЛЕНО КАК Документ,
			|	ДанныеДокумента.Дата КАК ДатаЛида,
			|	ДАТАВРЕМЯ(1,1,1) КАК ДатаДокумента,
			|	ДанныеДокумента.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА %1 = ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
			|		ИНАЧЕ %1.Родитель
			|	КОНЕЦ КАК ИсполнительРодитель,
			|	%1 КАК Исполнитель,
			|	ВЫБОР КОГДА ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ЗначениеПоказателя,
			|	1 КАК Знаменатель,
			|	100 КАК ВесЗнаменателя
			|ИЗ
			|	РегистрСведений.Замеры КАК ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лид КАК ДанныеДокумента
			|		ПО ДанныеРегистра.ДокументЗамер = ДанныеДокумента.Ссылка
			|ГДЕ
			|	ДанныеРегистра.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ ДанныеРегистра.ЭтоВыезд
			|   И (ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
			|      ИЛИ ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен)
			|      ИЛИ ДанныеРегистра.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился))
			|
			|"
			, ПолеПоказателя, ТипПоказателя)
			);
	#КонецОбласти

	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаВТ(ТекстЗапроса) Экспорт

	Если СтрНайти(ТекстЗапроса, "ВТ_ПлощадиПоЗаказам") > 0 Тогда
		
		ТекстЗапроса =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ЗаказДоговорТоварыУслуги.Ссылка КАК ЗаказДоговор,
		|	ЗаказДоговорТоварыУслуги.Ссылка.Основание КАК Основание,
		|	КОЛИЧЕСТВО(ЗаказДоговорТоварыУслуги.Номенклатура) КАК КоличествоПотолков,
		|	СУММА(ЗаказДоговорТоварыУслуги.Количество * ЗаказДоговорТоварыУслуги.Коэффициент) КАК Площадь
		|ПОМЕСТИТЬ ВТ_ПлощадиПоЗаказам
		|ИЗ
		|	Документ.ЗаказДоговор.ТоварыУслуги КАК ЗаказДоговорТоварыУслуги
		|ГДЕ
		|	(ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
		|			ИЛИ ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
		|			ИЛИ ЗаказДоговорТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
		|			ИЛИ ЗаказДоговорТоварыУслуги.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности)
		|	И ЗаказДоговорТоварыУслуги.Ссылка.Проведен
		|	И НЕ ЗаказДоговорТоварыУслуги.Ссылка.ПометкаУдаления
		|	И ЗаказДоговорТоварыУслуги.Ссылка.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказДоговоров.Договор)
		|{ГДЕ
		|	(ЗаказДоговорТоварыУслуги.Ссылка.Основание.Дата >= &НачалоПериода
		|				И ЗаказДоговорТоварыУслуги.Ссылка.Основание.Дата <= &КонецПериода
		|			ИЛИ ЗаказДоговорТоварыУслуги.Ссылка.Дата >= &НачалоПериода
		|				И ЗаказДоговорТоварыУслуги.Ссылка.Дата <= &КонецПериода
		|			ИЛИ ЗаказДоговорТоварыУслуги.Ссылка.Основание.ПоследняяДатаЗамера >= &НачалоПериода
		|				И ЗаказДоговорТоварыУслуги.Ссылка.Основание.ПоследняяДатаЗамера <= &КонецПериода)}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказДоговорТоварыУслуги.Ссылка,
		|	ЗаказДоговорТоварыУслуги.Ссылка.Основание
		|;
		|
		|"	+ ТекстЗапроса;
		
	КонецЕсли;
	
	Если СтрНайти(ТекстЗапроса, "ВТ_ОбщиеПродажиПоЗаказам") > 0 Тогда
		ТекстЗапроса =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажиПоЗаказДоговорамОбороты.Регистратор КАК ЗаказДоговор,
		|	СУММА(ПродажиПоЗаказДоговорамОбороты.СуммаОборот) КАК СреднийЧекСумма
		|ПОМЕСТИТЬ ВТ_ОбщиеПродажиПоЗаказам
		|ИЗ
		|	РегистрНакопления.ПродажиПоЗаказДоговорам.Обороты(, , Регистратор, ) КАК ПродажиПоЗаказДоговорамОбороты,
		|	Константа.ВсяНоменклатураПоУмолчаниюВСреднемЧеке КАК ВсяНоменклатураПоУмолчаниюВСреднемЧеке
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВсяНоменклатураПоУмолчаниюВСреднемЧеке.Значение
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПродажиПоЗаказДоговорамОбороты.Номенклатура.УчитыватьВСреднемЧеке = ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиПоЗаказДоговорамОбороты.Регистратор
		|;
		|
		|"	+ ТекстЗапроса;
	КонецЕсли;
	
	Если СтрНайти(ТекстЗапроса, "ВТ_ОбщиеДанныеПоМонтажам") > 0 Тогда
		
		ТекстЗапроса =	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МонтажТоварыУслуги.Ссылка КАК Монтаж,
		|	МонтажТоварыУслуги.Ссылка.Организация КАК Организация,
		|	МонтажТоварыУслуги.Ссылка.ДатаВыполнения КАК ДатаМонтажа,
		|	МонтажТоварыУслуги.Ссылка.ДатаВыполнения КАК ДатаВыполненияМонтажа,
		|	МонтажТоварыУслуги.Ссылка.Основание КАК ЗаказДоговор,
		|	МонтажТоварыУслуги.Ссылка.Основание.Дата КАК ДатаДоговора,
		|	ЕСТЬNULL(МонтажТоварыУслуги.Ссылка.Основание.Основание.Менеджер, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МенеджерЛида,
		
		|	ЕСТЬNULL(МонтажТоварыУслуги.Ссылка.Основание.Основание.ВидКонтакта, ЗНАЧЕНИЕ(Справочник.ВидыКонтактов.ПустаяСсылка)) КАК ВидКонтакта,
		|	ЕСТЬNULL(МонтажТоварыУслуги.Ссылка.Основание.Основание.РекламнаяАкция, ЗНАЧЕНИЕ(Справочник.РекламнаяАкция.ПустаяСсылка)) КАК РекламнаяАкция,
		|	ЕСТЬNULL(МонтажТоварыУслуги.Ссылка.Основание.Основание.РекламныйИсточник, ЗНАЧЕНИЕ(Справочник.РекламныеИсточники.ПустаяСсылка)) КАК РекламныйИсточник,
		|	ЕСТЬNULL(МонтажТоварыУслуги.Ссылка.Основание.Основание.ТочкаПродаж, ЗНАЧЕНИЕ(Справочник.ТочкиПродаж.ПустаяСсылка)) КАК ТочкаПродаж,
		
		|	МонтажТоварыУслуги.Ссылка.Основание.ИсполнительЗамера КАК ИсполнительЗамера,
		|	МонтажТоварыУслуги.Ссылка.Основание.ИдентификаторЗамера КАК ИдентификаторЗамера,
		|	МонтажТоварыУслуги.Ссылка.Основание.Основание КАК Лид,
		|	МонтажТоварыУслуги.Ссылка.Основание.Основание.Дата КАК ДатаЛида,
		|	СРЕДНЕЕ(МонтажТоварыУслуги.Ссылка.СуммаДокумента) КАК СуммаМонтажа,
		|	СУММА(ВЫБОР
		|			КОГДА МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
		|					ИЛИ МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
		|					ИЛИ МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
		|					ИЛИ МонтажТоварыУслуги.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоПотолков,
		|	СУММА(ВЫБОР
		|			КОГДА МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
		|					ИЛИ МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
		|					ИЛИ МонтажТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
		|					ИЛИ МонтажТоварыУслуги.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности
		|				ТОГДА МонтажТоварыУслуги.Количество * МонтажТоварыУслуги.Коэффициент
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПлощадьПотолков
		|ПОМЕСТИТЬ ВТ_ОбщиеДанныеПоМонтажам
		|ИЗ
		|	Документ.Монтаж.ТоварыУслуги КАК МонтажТоварыУслуги
		|ГДЕ
		|	МонтажТоварыУслуги.Ссылка.Проведен
		|	И МонтажТоварыУслуги.Ссылка.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Выполнен), ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Закрыт))
		|	И МонтажТоварыУслуги.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыМонтажа.Монтаж)
		
		//#12853 закомментировано: в отчете "Эффективность по лидам" в таблице "Монтажи за период по дате монтажа" должны попадать все монтажи, 
		// не важно привязаны они к лидам\договорам или нет. 
		//|	И МонтажТоварыУслуги.Ссылка.Основание ССЫЛКА Документ.ЗаказДоговор
		//|	И МонтажТоварыУслуги.Ссылка.Основание.Основание ССЫЛКА Документ.Лид
		
		|
		|СГРУППИРОВАТЬ ПО
		|	МонтажТоварыУслуги.Ссылка,
		|	МонтажТоварыУслуги.Ссылка.Организация,
		|	МонтажТоварыУслуги.Ссылка.ДатаВыполнения,
		|	МонтажТоварыУслуги.Ссылка.Основание,
		|	МонтажТоварыУслуги.Ссылка.Основание.Дата,
		
		|	ЕСТЬNULL(МонтажТоварыУслуги.Ссылка.Основание.Основание.Менеджер, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)),
		|	ЕСТЬNULL(МонтажТоварыУслуги.Ссылка.Основание.Основание.ВидКонтакта, ЗНАЧЕНИЕ(Справочник.ВидыКонтактов.ПустаяСсылка)),
		|	ЕСТЬNULL(МонтажТоварыУслуги.Ссылка.Основание.Основание.РекламнаяАкция, ЗНАЧЕНИЕ(Справочник.РекламнаяАкция.ПустаяСсылка)),
		|	ЕСТЬNULL(МонтажТоварыУслуги.Ссылка.Основание.Основание.РекламныйИсточник, ЗНАЧЕНИЕ(Справочник.РекламныеИсточники.ПустаяСсылка)),
		|	ЕСТЬNULL(МонтажТоварыУслуги.Ссылка.Основание.Основание.ТочкаПродаж, ЗНАЧЕНИЕ(Справочник.ТочкиПродаж.ПустаяСсылка)),
		
		|	МонтажТоварыУслуги.Ссылка.Основание.ИсполнительЗамера,
		|	МонтажТоварыУслуги.Ссылка.Основание.ИдентификаторЗамера,
		|	МонтажТоварыУслуги.Ссылка.Основание.Основание,
		|	МонтажТоварыУслуги.Ссылка.Основание.Основание.Дата
		|;
		|
		|"	+ ТекстЗапроса;
		
	КонецЕсли;
	
	// таблицы отчета
	Если СтрНайти(ТекстЗапроса, "ВТ_ОбщиеПродажиПоЛидамЗаказам") > 0 Тогда
		ТекстЗапроса =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажиПоЗаказДоговорамОбороты.Регистратор КАК ЗаказДоговор,
		|	ПродажиПоЗаказДоговорамОбороты.Регистратор.Основание КАК Лид,
		|	СУММА(ПродажиПоЗаказДоговорамОбороты.СуммаОборот) КАК СреднийЧекСумма
		|ПОМЕСТИТЬ ВТ_ОбщиеПродажиПоЛидамЗаказам
		|ИЗ
		|	РегистрНакопления.ПродажиПоЗаказДоговорам.Обороты(, , Регистратор, ) КАК ПродажиПоЗаказДоговорамОбороты,
		|	Константа.ВсяНоменклатураПоУмолчаниюВСреднемЧеке КАК ВсяНоменклатураПоУмолчаниюВСреднемЧеке
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВсяНоменклатураПоУмолчаниюВСреднемЧеке.Значение
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПродажиПоЗаказДоговорамОбороты.Номенклатура.УчитыватьВСреднемЧеке = ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиПоЗаказДоговорамОбороты.Регистратор,
		|	ПродажиПоЗаказДоговорамОбороты.Регистратор.Основание
		|;
		|
		|"	+ ТекстЗапроса;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЭффективностьПоЗамерщикам

Функция ТаблицаДоступныхПоказателейПоЗамерщикам(Знач ПолеПоказателя="", Знач ТипПоказателя="") Экспорт

	ПолеПоказателя = "Менеджер";
	ТипПоказателя  = "Сотрудники";
	
	ТаблицаДоступныхПоказателей = ПустаяТаблицаПоказателей();
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СтруктураРазделов = Новый Структура("ИдРаздела, ПредставлениеРаздела, ИдРаздела2, ПредставлениеРаздела2");
	СтруктураРазделов.ИдРаздела = "Лид";                                            // идентификатор раздела
	СтруктураРазделов.ПредставлениеРаздела = "Данные по замерам в периоде отчета";  // наименование, которое выводится в шапке таблицы отчета
	СтруктураРазделов.ИдРаздела2 = "";                                              // идентификатор раздела второго уровня
	СтруктураРазделов.ПредставлениеРаздела2 = "";                                   // наименование раздела второго уровня, которое выводится в шапке таблицы отчета
	
	СтруктураИтоговПоУмолчанию = ОтчетыЭффективности.СтруктураИтогов();
	
	СтруктураИтоговБезСреднего = ОтчетыЭффективности.СтруктураИтогов();
	СтруктураИтоговБезСреднего.ЕстьСреднее = Ложь;
	
	СтруктураИтоговОтношениеБезСреднего = ОтчетыЭффективности.СтруктураИтогов();
	СтруктураИтоговОтношениеБезСреднего.ЕстьСреднее = Ложь;
	СтруктураИтоговОтношениеБезСреднего.ВариантСуммы = 1;
	СтруктураИтоговОтношениеБезСреднего.ДополнительныйВесСуммы = 1;

	СтруктураИтоговПроцентБезСреднего = ОтчетыЭффективности.СтруктураИтогов();
	СтруктураИтоговПроцентБезСреднего.ЕстьСреднее = Ложь;
	СтруктураИтоговПроцентБезСреднего.ВариантСуммы = 1;
	СтруктураИтоговПроцентБезСреднего.ДополнительныйВесСуммы = 100;
	
	#Область КоличествоЗамеров
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеров", "Замеры.Сотрудник", ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоНеЗакрытыхЗамеров
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоНеЗакрытыхЗамеров", "Замеры.Сотрудник", ТипПоказателя);
	#КонецОбласти

	#Область КоличествоЗакрытыхЗамеров
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеров", "Замеры.Сотрудник", ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ЛидПоЗакрытымЗамерам";
	СтруктураРазделов.ПредставлениеРаздела2 = "В закрытых замерах";
		
	#Область КоличествоВыполненныхЗамеровСДоговором
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоВыполненныхЗамеровСДоговором", "Замеры.Сотрудник", ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоВыполненныхЗамеровБезДоговора
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоВыполненныхЗамеровБезДоговора", "Замеры.Сотрудник", ТипПоказателя);
	#КонецОбласти

	#Область КоличествоЗамеровНевыполнен
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровНевыполнен", "Замеры.Сотрудник", ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ЛидДоговорыНаЗамерах";
	СтруктураРазделов.ПредставлениеРаздела2 = "Договоры на замерах";
	
	#Область КоличествоДоговоровНаЗамерах
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровНаЗамерах", "Замеры.Сотрудник", ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровНаЗамерах
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровНаЗамерах", "Замеры.Сотрудник", ТипПоказателя);
	#КонецОбласти

	// №14841 показатели конверсии определяем в раздел
	СтруктураРазделов.ИдРаздела2 = "ЛидКонверсия";
	СтруктураРазделов.ПредставлениеРаздела2 = "Конверсия";
	
	#Область КоличествоДоговоровПоВыполненнымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровПоВыполненнымЗамерам", "", ТипПоказателя);
	#КонецОбласти
	
	//++ №14841 показатель конверсии договора на замере / назначенные замеры
	#Область КоличествоДоговоровПоНазначеннымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровПоНазначеннымЗамерам", "", ТипПоказателя);
	#КонецОбласти
	//-- №14841
	
	//++ #15996 
	#Область КоличествоОформленныхДоговоровПоВыполненнымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоОформленныхДоговоровПоВыполненнымЗамерам", "", ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоОформленныхДоговоровПоНазначеннымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоОформленныхДоговоровПоНазначеннымЗамерам", "", ТипПоказателя);
	#КонецОбласти
	//-- #15996 
	
	СтруктураРазделов.ИдРаздела2 = "";
	СтруктураРазделов.ПредставлениеРаздела2 = "";
	
	#Область КоличествоДоговоров
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоров", "Замеры.Сотрудник", ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоров
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоров", "КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоПрайсу
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоПрайсу", "КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаОтклоненияОтПрайса
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаОтклоненияОтПрайса", "КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти

	#Область ПроцентОтклоненияОтПрайса
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентОтклоненияОтПрайса", "КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти

	#Область СуммаСкидкиДоговоров
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаСкидкиДоговоров", "КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийПроцентСкидкиДоговоров
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийПроцентСкидкиДоговоров", "", ТипПоказателя);
	#КонецОбласти	
	
	#Область КоличествоПотолков
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоПотолков", "", ТипПоказателя);
	#КонецОбласти
	
	#Область Площадь
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"Площадь", "КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти

	СтруктураРазделов.ИдРаздела2 = "СреднееПоЗамерам";
	СтруктураРазделов.ПредставлениеРаздела2 = "Среднее";
	
	#Область СреднееКоличествоПотолков
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднееКоличествоПотолков", "", ТипПоказателя);	
	#КонецОбласти
	
	#Область СредняяСуммаДоговора
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСуммаДоговора", "КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийЧек
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийЧек", "КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяСтоимостьМетра
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСтоимостьМетра", "КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти

	#Область СредняяПлощадь
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяПлощадь", "КонверсияВходящихКонтактовОбороты.Регистратор.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СтруктураРазделов.ИдРаздела = "Договор";
	СтруктураРазделов.ПредставлениеРаздела = "Данные по договорам в периоде отчета";
	
	СтруктураРазделов.ИдРаздела2 = "";
	СтруктураРазделов.ПредставлениеРаздела2 = "";
	
	#Область КоличествоДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДоговорамПоПрайсу
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоДоговорамПоПрайсу", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаОтклоненияПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаОтклоненияПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти

	#Область ПроцентОтклоненияОтПрайсаПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентОтклоненияОтПрайсаПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти

	#Область СуммаСкидкиДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаСкидкиДоговоровПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийПроцентСкидкиДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийПроцентСкидкиДоговоровПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоПотолковПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоПотолковПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "СреднееПоДоговорам";
	СтруктураРазделов.ПредставлениеРаздела2 = "Среднее";
	
	#Область СреднееКоличествоПотолковПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднееКоличествоПотолковПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяСуммаДоговораПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСуммаДоговораПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийЧекПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийЧекПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяСтоимостьМетраПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСтоимостьМетраПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяПлощадьПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяПлощадьПоДоговорам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ДоговорКонверсия";
	СтруктураРазделов.ПредставлениеРаздела2 = "Конверсия";
	
	//++ #15996 
	#Область КоличествоОформленныхДоговоровПоДоговорамПоВыполненнымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоОформленныхДоговоровПоДоговорамПоВыполненнымЗамерам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоОформленныхДоговоровПоДоговорамПоНазначеннымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоОформленныхДоговоровПоДоговорамПоНазначеннымЗамерам", "ДанныеДокумента.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	//-- #15996 
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СтруктураРазделов.ИдРаздела = "Монтаж";
	СтруктураРазделов.ПредставлениеРаздела = "Данные по монтажам";

	СтруктураРазделов.ИдРаздела2 = "МонтажиПоДатеЗамера";
	СтруктураРазделов.ПредставлениеРаздела2 = "По дате замера";
		
	#Область СуммаМонтажейПоДатеЗамера
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаМонтажейПоДатеЗамера", "ВТ_ОбщиеДанныеПоМонтажам.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеЗамера
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПотолковМонтажейПоДатеЗамера", "ВТ_ОбщиеДанныеПоМонтажам.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "МонтажиПоДатеДоговора";
	СтруктураРазделов.ПредставлениеРаздела2 = "По дате договора";
	
	#Область СуммаМонтажейПоДатеДоговора
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаМонтажейПоДатеДоговора", "ВТ_ОбщиеДанныеПоМонтажам.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеДоговора
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПотолковМонтажейПоДатеДоговора", "ВТ_ОбщиеДанныеПоМонтажам.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "МонтажиПоДатеМонтажа";
	СтруктураРазделов.ПредставлениеРаздела2 = "По дате монтажа";
	
	#Область СуммаМонтажейПоДатеМонтажа
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаМонтажейПоДатеМонтажа", "ВТ_ОбщиеДанныеПоМонтажам.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеМонтажа
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПотолковМонтажейПоДатеМонтажа", "ВТ_ОбщиеДанныеПоМонтажам.ИсполнительЗамера", ТипПоказателя);
	#КонецОбласти	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Возврат ТаблицаДоступныхПоказателей;
	
КонецФункции

#КонецОбласти

#Область ЭффективностьПоМенеджерам

Функция ТаблицаДоступныхПоказателейПоМенеджерам(Знач ПолеПоказателя="", Знач ТипПоказателя="") Экспорт

	ТаблицаДоступныхПоказателей = ПустаяТаблицаПоказателей();
	
	ПолеПоказателя = "Менеджер";
	ТипПоказателя  = "Сотрудники";
	
	ПолеПоказателяДанныеРегистраНазначилЗамер = "ДанныеРегистра.НазначилЗамер";
	ПолеПоказателяДанныеЛидаМенеджер = "ДанныеЛида.Менеджер";
	ПолеПоказателяМенеджерЛида = "Менеджер";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СтруктураРазделов = Новый Структура("ИдРаздела, ПредставлениеРаздела, ИдРаздела2, ПредставлениеРаздела2");
	СтруктураРазделов.ИдРаздела = "Лид";                                            // идентификатор раздела
	СтруктураРазделов.ПредставлениеРаздела = "Данные по лидам в периоде отчета (в разрезе менеджера лида)";    // наименование, которое выводится в шапке таблицы отчета
	СтруктураРазделов.ИдРаздела2 = "";                                              // идентификатор раздела второго уровня
	СтруктураРазделов.ПредставлениеРаздела2 = "";                                   // наименование раздела второго уровня, которое выводится в шапке таблицы отчета
	
	
	СтруктураИтоговПоУмолчанию = ОтчетыЭффективности.СтруктураИтогов();
							
	СтруктураИтоговПроцентБезСреднего = ОтчетыЭффективности.СтруктураИтогов();
	СтруктураИтоговПроцентБезСреднего.ЕстьСреднее = Ложь;
	СтруктураИтоговПроцентБезСреднего.ВариантСуммы = 1;
	СтруктураИтоговПроцентБезСреднего.ДополнительныйВесСуммы = 100;
		
	#Область КоличествоСозданныхЛидов
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоСозданныхЛидов", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ВСозданныхЛидах";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "В созданных лидах";
	
	#Область КоличествоЦелевыхЛидов
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЦелевыхЛидов", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	#Область ПроцентЦелевыхЛидов
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентЦелевыхЛидов", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти

	#Область КоличествоЛидовОбращений
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЛидовОбращений", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти

	#Область ПроцентЛидовОбращений
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентЛидовОбращений", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти

	#Область КоличествоНецелевыхЛидов
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоНецелевыхЛидов", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	#Область ПроцентНецелевыхЛидов
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентНецелевыхЛидов", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	//СтруктураРазделов.ИдРаздела = "ЗамерыПоДатеЛида";
	СтруктураРазделов.ИдРаздела = "Лид";
	СтруктураРазделов.ПредставлениеРаздела = "Данные по лидам в периоде отчета (в разрезе менеджера замера)";    
	СтруктураРазделов.ИдРаздела2 = "";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "";                                   
	
	#Область КоличествоЗамеровПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровПоДатеЛида", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеЛидаМенеджерСовпадает";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "В назначенных замерах, менеджер замера совпадает с менеджером лида";	
	
	#Область КоличествоЗамеровПоДатеЛидаМенеджерСовпадает
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровПоДатеЛидаМенеджерСовпадает", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КонверсияЗамеровПоДатеЛидаМенеджерСовпадает
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияЗамеровПоДатеЛидаМенеджерСовпадает", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеЛидаМенеджерНеСовпадает";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "В назначенных замерах, менеджер замера отличается от менеджера лида";	
	
	#Область КоличествоЗамеровПоДатеЛидаМенеджерНеСовпадает
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровПоДатеЛидаМенеджерНеСовпадает", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КонверсияЗамеровПоДатеЛидаМенеджерНеСовпадает 
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияЗамеровПоДатеЛидаМенеджерНеСовпадает", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "";
	
	#Область КоличествоЗамеровВРаботеПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровВРаботеПоДатеЛида", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровПоДатеЛида", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеЛидаПоЗакрытымЗамерам";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "В закрытых замерах";
	
	#Область КоличествоЗакрытыхЗамеровОтмененныеПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровОтмененныеПоДатеЛида", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеЛида", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеЛида", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеЛида", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
		
	СтруктураРазделов.ИдРаздела2 = "ПоДатеЛидаДанныеДоговоров";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "Договоры на замере";
	
	#Область КоличествоДоговоровЗамерщикаПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровЗамерщикаПоДатеЛида", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровЗамерщикаПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровЗамерщикаПоДатеЛида", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
		
	СтруктураРазделов.ИдРаздела2 = "ПоДатеЛидаКонверсияДоговорыЗамеры";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "Конверсия";	
	
	#Область КонверсияПоДатеЛидаДоговоровКВыполненнымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияПоДатеЛидаДоговоровКВыполненнымЗамерам", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КонверсияПоДатеЛидаДоговоровКНазначеннымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияПоДатеЛидаДоговоровКНазначеннымЗамерам", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СтруктураРазделов.ИдРаздела = "ЗамерыПоДатеНазначения";                                           
	СтруктураРазделов.ПредставлениеРаздела = "Данные по дате назначения замера в периоде отчета  (в разрезе менеджера замера)";    
	СтруктураРазделов.ИдРаздела2 = "";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = ""; 
	
	#Область КоличествоЗамеровПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровПоДатеНазначения", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
			
	СтруктураРазделов.ИдРаздела2 = "ПоДатеНазначенияМенеджерСовпадает";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "В назначенных замерах, менеджер замера совпадает с менеджером лида";	
	
	#Область КоличествоЗамеровПоДатеНазначенияМенеджерСовпадает 
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровПоДатеНазначенияМенеджерСовпадает", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КонверсияЗамеровПоДатеНазначенияМенеджерСовпадает 
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияЗамеровПоДатеНазначенияМенеджерСовпадает", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеНазначенияМенеджерНеСовпадает";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "В назначенных замерах, менеджер замера отличается от менеджера лида";	
	
	#Область КоличествоЗамеровПоДатеНазначенияМенеджерНеСовпадает 
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровПоДатеНазначенияМенеджерНеСовпадает", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КонверсияЗамеровПоДатеНазначенияМенеджерНеСовпадает
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияЗамеровПоДатеНазначенияМенеджерНеСовпадает", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "";

	#Область КоличествоЗамеровВРаботеПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровВРаботеПоДатеНазначения", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровПоДатеНазначения", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеНазначенияПоЗакрытымЗамерам";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "В закрытых замерах";
	
	#Область КоличествоЗакрытыхЗамеровОтмененныеПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровОтмененныеПоДатеНазначения", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеНазначения", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеНазначения", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеНазначения", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеНазначенияДанныеДоговоров";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "Договоры на замере";
	
	#Область КоличествоДоговоровПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровПоДатеНазначения", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоДатеНазначения", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеЛидаКонверсияДоговорыЗамеры";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "Конверсия";	
	
	#Область КонверсияПоНазначенияЛидаДоговоровКВыполненнымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияПоНазначенияЛидаДоговоровКВыполненнымЗамерам", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти
	
	#Область КонверсияПоДатеНазначенияДоговоровКНазначеннымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияПоДатеНазначенияДоговоровКНазначеннымЗамерам", ПолеПоказателяДанныеРегистраНазначилЗамер, ТипПоказателя);
	#КонецОбласти

	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	
	//СтруктураРазделов.ИдРаздела = "ЛидДоговор";
	СтруктураРазделов.ИдРаздела = "Лид";
	СтруктураРазделов.ПредставлениеРаздела = "Данные по лидам в периоде отчета (в разрезе менеджера лида)";
	
	СтруктураРазделов.ИдРаздела2 = "";
	СтруктураРазделов.ПредставлениеРаздела2 = "";

	#Область КоличествоДоговоровПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровПоЛидам", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоДатеЛида", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоПрайсуПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоПрайсуПоДатеЛида", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаОтклоненияОтПрайсаПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаОтклоненияОтПрайсаПоДатеЛида", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	#Область ПроцентОтклоненияОтПрайсаПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентОтклоненияОтПрайсаПоДатеЛида", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаСкидкиДоговоровПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаСкидкиДоговоровПоДатеЛида", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийПроцентСкидкиДоговоровПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийПроцентСкидкиДоговоровПоДатеЛида", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоПотолковПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоПотолковПоЛидам", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПотолковПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПотолковПоЛидам", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "СреднееПоЛидамДоговорам";
	СтруктураРазделов.ПредставлениеРаздела2 = "Среднее";
	
	#Область СреднееКоличествоПотолковПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднееКоличествоПотолковПоЛидам", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти

	#Область СредняяСуммаДоговораПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСуммаДоговораПоЛидам", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийЧекПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийЧекПоЛидам", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяСтоимостьМетраПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСтоимостьМетраПоЛидам", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяПлощадьПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяПлощадьПоЛидам", ПолеПоказателяДанныеЛидаМенеджер, ТипПоказателя);
	#КонецОбласти
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
	СтруктураРазделов.ИдРаздела = "Договор";
	СтруктураРазделов.ПредставлениеРаздела = "Данные по договорам в периоде отчета (в разрезе менеджера договора)";
	
	СтруктураРазделов.ИдРаздела2 = "";
	СтруктураРазделов.ПредставлениеРаздела2 = "";
	
	#Область КоличествоДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоПотолковПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоПотолковПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДоговорамПоПрайсу
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоДоговорамПоПрайсу", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаОтклоненияПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаОтклоненияПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти

	#Область ПроцентОтклоненияОтПрайсаПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентОтклоненияОтПрайсаПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти

	#Область СуммаСкидкиДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаСкидкиДоговоровПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийПроцентСкидкиДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийПроцентСкидкиДоговоровПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "СреднееПоДоговорам";
	СтруктураРазделов.ПредставлениеРаздела2 = "Среднее";
	
	#Область СреднееКоличествоПотолковПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднееКоличествоПотолковПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяСуммаДоговораПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСуммаДоговораПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийЧекПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийЧекПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяСтоимостьМетраПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСтоимостьМетраПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяПлощадьПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяПлощадьПоДоговорам", "ДанныеДокумента.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	//++ #14776
	СтруктураРазделов.ИдРаздела = "ДоговорМенеджерЛид";
	СтруктураРазделов.ПредставлениеРаздела = "Данные по договорам в периоде отчета (в разрезе менеджера лида)";
	
	СтруктураРазделов.ИдРаздела2 = "";
	СтруктураРазделов.ПредставлениеРаздела2 = "";
		
	#Область КоличествоДоговоровПоДоговорамСМенеджеромЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровПоДоговорамСМенеджеромЛида", "ДанныеЛида.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДоговорамСМенеджеромЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоДоговорамСМенеджеромЛида", "ДанныеЛида.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоПотолковПоДоговорамСМенеджеромЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоПотолковПоДоговорамСМенеджеромЛида", "ДанныеЛида.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПоДоговорамСМенеджеромЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПоДоговорамСМенеджеромЛида", "ДанныеЛида.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "СреднееПоДоговорамМенеджерЛид";
	СтруктураРазделов.ПредставлениеРаздела2 = "Среднее";
	
	#Область СреднееКоличествоПотолковПоДоговорамСМенеджеромЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднееКоличествоПотолковПоДоговорамСМенеджеромЛида", "ДанныеЛида.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяСуммаДоговораПоДоговорамСМенеджеромЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСуммаДоговораПоДоговорамСМенеджеромЛида", "ДанныеЛида.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийЧекПоДоговорамСМенеджеромЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийЧекПоДоговорамСМенеджеромЛида", "ДанныеЛида.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяСтоимостьМетраПоДоговорамСМенеджеромЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСтоимостьМетраПоДоговорамСМенеджеромЛида", "ДанныеЛида.Менеджер", ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяПлощадьПоДоговорамСМенеджеромЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяПлощадьПоДоговорамСМенеджеромЛида", "ДанныеЛида.Менеджер", ТипПоказателя);
	#КонецОбласти
	//-- #14776
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СтруктураРазделов.ИдРаздела = "Монтаж";
	СтруктураРазделов.ПредставлениеРаздела = "Данные по монтажам (в разрезе менеджера лида)";

	СтруктураРазделов.ИдРаздела2 = "МонтажиПоДатеЗамера";
	СтруктураРазделов.ПредставлениеРаздела2 = "По дате замера";
	
	#Область СуммаМонтажейПоДатеЗамера
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаМонтажейПоДатеЗамера", "ВТ_ОбщиеДанныеПоМонтажам.МенеджерЛида", ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеЗамера
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПотолковМонтажейПоДатеЗамера", "ВТ_ОбщиеДанныеПоМонтажам.МенеджерЛида", ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "МонтажиПоДатеДоговора";
	СтруктураРазделов.ПредставлениеРаздела2 = "По дате договора";
	
	#Область СуммаМонтажейПоДатеДоговора
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаМонтажейПоДатеДоговора", "ВТ_ОбщиеДанныеПоМонтажам.МенеджерЛида", ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеДоговора
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПотолковМонтажейПоДатеДоговора", "ВТ_ОбщиеДанныеПоМонтажам.МенеджерЛида", ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "МонтажиПоДатеМонтажа";
	СтруктураРазделов.ПредставлениеРаздела2 = "По дате монтажа";
	
	#Область СуммаМонтажейПоДатеМонтажа
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаМонтажейПоДатеМонтажа", "ВТ_ОбщиеДанныеПоМонтажам.МенеджерЛида", ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеМонтажа
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПотолковМонтажейПоДатеМонтажа", "ВТ_ОбщиеДанныеПоМонтажам.МенеджерЛида", ТипПоказателя);
	#КонецОбласти
	
	Возврат ТаблицаДоступныхПоказателей;
	
КонецФункции

#КонецОбласти

#Область ЭффективностьПоЛидам
// общие процедуры для отчетов ЭффективностьМаркетинга / ЭффективностьВидовКонтакта / ЭффективностьРекламныхАкций / ЭффективностьРекламныхИсточников / ЭффективностьТочекПродаж

// основная функция, где описываются разделы, показатели, тексты запросов для их вычисления
Функция ТаблицаДоступныхПоказателейПоЛидам(Знач ПолеПоказателя="", Знач ТипПоказателя="") Экспорт
	
	ПолеПоказателяПоДокументу = "ДанныеДокумента." + ПолеПоказателя;
	ПолеПоказателяПоЛиду = "ДанныеЛида." + ПолеПоказателя;
	
	ТаблицаДоступныхПоказателей = ПустаяТаблицаПоказателей();
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СтруктураРазделов = Новый Структура("ИдРаздела, ПредставлениеРаздела, ИдРаздела2, ПредставлениеРаздела2");
	СтруктураРазделов.ИдРаздела = "Лид";                                            // идентификатор раздела
	СтруктураРазделов.ПредставлениеРаздела = "Данные по лидам в периоде отчета";    // наименование, которое выводится в шапке таблицы отчета
	СтруктураРазделов.ИдРаздела2 = "";                                              // идентификатор раздела второго уровня
	СтруктураРазделов.ПредставлениеРаздела2 = "";                                   // наименование раздела второго уровня, которое выводится в шапке таблицы отчета
	
	
	СтруктураИтоговПоУмолчанию = ОтчетыЭффективности.СтруктураИтогов();
							
	СтруктураИтоговПроцентБезСреднего = ОтчетыЭффективности.СтруктураИтогов();
	СтруктураИтоговПроцентБезСреднего.ЕстьСреднее = Ложь;
	СтруктураИтоговПроцентБезСреднего.ВариантСуммы = 1;
	СтруктураИтоговПроцентБезСреднего.ДополнительныйВесСуммы = 100;
	
	#Область КоличествоСозданныхЛидов
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоСозданныхЛидов", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ВСозданныхЛидах";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "В созданных лидах";
	
	#Область КоличествоЦелевыхЛидов
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЦелевыхЛидов", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	#Область ПроцентЦелевыхЛидов
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентЦелевыхЛидов", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти

	#Область КоличествоЛидовОбращений
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЛидовОбращений", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти

	#Область ПроцентЛидовОбращений
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентЛидовОбращений", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти

	#Область КоличествоНецелевыхЛидов
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоНецелевыхЛидов", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	#Область ПроцентНецелевыхЛидов
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентНецелевыхЛидов", ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
		
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	//СтруктураРазделов.ИдРаздела = "ЗамерыПоДатеЛида";                                           
	СтруктураРазделов.ИдРаздела = "Лид";
	СтруктураРазделов.ПредставлениеРаздела = "Данные по лидам в периоде отчета";    
	СтруктураРазделов.ИдРаздела2 = "";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "";                                   
	
	#Область КоличествоЗамеровПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровПоДатеЛида", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗамеровВРаботеПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровВРаботеПоДатеЛида", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровПоДатеЛида", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеЛидаПоЗакрытымЗамерам";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "В закрытых замерах";
	
	#Область КоличествоЗакрытыхЗамеровОтмененныеПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровОтмененныеПоДатеЛида", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеЛида", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеЛида", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеЛида", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеЛидаДанныеДоговоров";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "Договоры на замере";
	
	#Область КоличествоДоговоровЗамерщикаПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровЗамерщикаПоДатеЛида", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровЗамерщикаПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровЗамерщикаПоДатеЛида", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеЛидаКонверсияДоговорыЗамеры";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "Конверсия";	
	
	#Область КонверсияПоДатеЛидаДоговоровКВыполненнымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияПоДатеЛидаДоговоровКВыполненнымЗамерам", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КонверсияПоДатеЛидаДоговоровКНазначеннымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияПоДатеЛидаДоговоровКНазначеннымЗамерам", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	
	//СтруктураРазделов.ИдРаздела = "ЛидДоговор";
	СтруктураРазделов.ИдРаздела = "Лид";
	СтруктураРазделов.ПредставлениеРаздела = "Данные по лидам в периоде отчета";
	
	СтруктураРазделов.ИдРаздела2 = "";
	СтруктураРазделов.ПредставлениеРаздела2 = "";

	#Область КоличествоДоговоровПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровПоЛидам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоДатеЛида", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоПрайсуПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоПрайсуПоДатеЛида", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаОтклоненияОтПрайсаПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаОтклоненияОтПрайсаПоДатеЛида", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область ПроцентОтклоненияОтПрайсаПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентОтклоненияОтПрайсаПоДатеЛида", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаСкидкиДоговоровПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаСкидкиДоговоровПоДатеЛида", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийПроцентСкидкиДоговоровПоДатеЛида
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийПроцентСкидкиДоговоровПоДатеЛида", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоПотолковПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоПотолковПоЛидам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПотолковПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПотолковПоЛидам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "СреднееПоЛидамДоговорам";
	СтруктураРазделов.ПредставлениеРаздела2 = "Среднее";
	
	#Область СреднееКоличествоПотолковПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднееКоличествоПотолковПоЛидам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти

	#Область СредняяСуммаДоговораПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСуммаДоговораПоЛидам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийЧекПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийЧекПоЛидам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяСтоимостьМетраПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСтоимостьМетраПоЛидам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяПлощадьПоЛидам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяПлощадьПоЛидам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СтруктураРазделов.ИдРаздела = "ЗамерыПоДатеНазначения";                                           
	СтруктураРазделов.ПредставлениеРаздела = "Данные по дате назначения замера в периоде отчета";    
	СтруктураРазделов.ИдРаздела2 = "";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = ""; 
	
	#Область КоличествоЗамеровПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровПоДатеНазначения", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗамеровВРаботеПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗамеровВРаботеПоДатеНазначения", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровПоДатеНазначения", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеНазначенияПоЗакрытымЗамерам";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "В закрытых замерах";
	
	#Область КоличествоЗакрытыхЗамеровОтмененныеПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровОтмененныеПоДатеНазначения", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеНазначения", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеНазначения", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеНазначения", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеНазначенияДанныеДоговоров";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "Договоры на замере";
	
	#Область КоличествоДоговоровПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровПоДатеНазначения", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДатеНазначения
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоДатеНазначения", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "ПоДатеЛидаКонверсияДоговорыЗамеры";                                              
	СтруктураРазделов.ПредставлениеРаздела2 = "Конверсия";	
	
	#Область КонверсияПоНазначенияЛидаДоговоровКВыполненнымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияПоНазначенияЛидаДоговоровКВыполненнымЗамерам", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	#Область КонверсияПоДатеНазначенияДоговоровКНазначеннымЗамерам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КонверсияПоДатеНазначенияДоговоровКНазначеннымЗамерам", ПолеПоказателяПоДокументу, ТипПоказателя);
	#КонецОбласти
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
	СтруктураРазделов.ИдРаздела = "Договор";
	СтруктураРазделов.ПредставлениеРаздела = "Данные по договорам в периоде отчета";
	
	СтруктураРазделов.ИдРаздела2 = "";
	СтруктураРазделов.ПредставлениеРаздела2 = "";
	
	#Область КоличествоДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоДоговоровПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область КоличествоПотолковПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"КоличествоПотолковПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаДоговоровПоДоговорамПоПрайсу
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаДоговоровПоДоговорамПоПрайсу", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СуммаОтклоненияПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаОтклоненияПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти

	#Область ПроцентОтклоненияОтПрайсаПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПроцентОтклоненияОтПрайсаПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти

	#Область СуммаСкидкиДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаСкидкиДоговоровПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийПроцентСкидкиДоговоровПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийПроцентСкидкиДоговоровПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "СреднееПоДоговорам";
	СтруктураРазделов.ПредставлениеРаздела2 = "Среднее";
	
	#Область СреднееКоличествоПотолковПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднееКоличествоПотолковПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяСуммаДоговораПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСуммаДоговораПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СреднийЧекПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СреднийЧекПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяСтоимостьМетраПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяСтоимостьМетраПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
	#Область СредняяПлощадьПоДоговорам
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СредняяПлощадьПоДоговорам", ПолеПоказателяПоЛиду, ТипПоказателя);
	#КонецОбласти
	
    ///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СтруктураРазделов.ИдРаздела = "Монтаж";
	СтруктураРазделов.ПредставлениеРаздела = "Данные по монтажам";

	СтруктураРазделов.ИдРаздела2 = "МонтажиПоДатеЗамера";
	СтруктураРазделов.ПредставлениеРаздела2 = "По дате замера";
	
	#Область СуммаМонтажейПоДатеЗамера
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаМонтажейПоДатеЗамера", "ВТ_ОбщиеДанныеПоМонтажам." + ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеЗамера
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПотолковМонтажейПоДатеЗамера", "ВТ_ОбщиеДанныеПоМонтажам." + ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "МонтажиПоДатеДоговора";
	СтруктураРазделов.ПредставлениеРаздела2 = "По дате договора";
	
	#Область СуммаМонтажейПоДатеДоговора
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаМонтажейПоДатеДоговора", "ВТ_ОбщиеДанныеПоМонтажам." + ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеДоговора
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПотолковМонтажейПоДатеДоговора", "ВТ_ОбщиеДанныеПоМонтажам." + ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	СтруктураРазделов.ИдРаздела2 = "МонтажиПоДатеМонтажа";
	СтруктураРазделов.ПредставлениеРаздела2 = "По дате монтажа";
	
	#Область СуммаМонтажейПоДатеМонтажа
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"СуммаМонтажейПоДатеМонтажа", "ВТ_ОбщиеДанныеПоМонтажам." + ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	#Область ПлощадьПотолковМонтажейПоДатеМонтажа
	ОтчетыЭффективности.ДобавитьОбщийПоказатель(ТаблицаДоступныхПоказателей, СтруктураРазделов,
		"ПлощадьПотолковМонтажейПоДатеМонтажа", "ВТ_ОбщиеДанныеПоМонтажам." + ПолеПоказателя, ТипПоказателя);
	#КонецОбласти
	
	Возврат ТаблицаДоступныхПоказателей;
	
КонецФункции
	
Функция НастройкиВариантаОтчетаПоЛидам(ОтчетСсылка, КлючВарианта, Предопределенный) Экспорт
	
	Результат = ПустаяТаблицаПоказателей();
	
	СтруктураРезультата = ОтчетыЭффективности.ДанныеПоИмениОтчета(ОтчетСсылка.Имя);
	ПолеПоказателя = СтруктураРезультата.ПолеПоказателя;
	ТипПоказателя  = СтруктураРезультата.ТипПоказателя;
	
	ТаблицаДоступныхПоказателей = ТаблицаДоступныхПоказателейПоЛидам(ПолеПоказателя, ТипПоказателя);
	
	// настройки предопределенных храним "внутри" отчета
	Если Предопределенный Тогда		
		
		Если КлючВарианта = "ВсеПоказатели" Тогда
			Для каждого СтрокаТЗ из ТаблицаДоступныхПоказателей Цикл
				НоваяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			КонецЦикла;
			
		ИначеЕсли КлючВарианта = "АнализЛидовВПериодеОтчета" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоСозданныхЛидов", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЦелевыхЛидов", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентЦелевыхЛидов", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЛидовОбращений", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентЛидовОбращений", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоНецелевыхЛидов", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентНецелевыхЛидов", Результат);
			
		ИначеЕсли КлючВарианта = "АнализЗамеровПоДатеЛида" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровПоДатеЛида", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровВРаботеПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровПоДатеЛида", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровОтмененныеПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеЛида", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровЗамерщикаПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровЗамерщикаПоДатеЛида", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияПоДатеЛидаДоговоровКВыполненнымЗамерам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияПоДатеЛидаДоговоровКНазначеннымЗамерам", Результат);
				
		ИначеЕсли КлючВарианта = "АнализЗамеровПоДатеНазначения" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровПоДатеНазначения", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровВРаботеПоДатеНазначения", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровПоДатеНазначения", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровОтмененныеПоДатеНазначения", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеНазначения", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеНазначения", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеНазначения", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровПоДатеНазначения", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДатеНазначения", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияПоДатеНазначенияДоговоровКВыполненнымЗамерам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияПоДатеНазначенияДоговоровКНазначеннымЗамерам", Результат);
			
		ИначеЕсли КлючВарианта = "АнализДоговоровПоДатеЛида" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоПотолковПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПотолковПоЛидам", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднееКоличествоПотолковПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСуммаДоговораПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийЧекПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСтоимостьМетраПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяПлощадьПоЛидам", Результат);
			
		ИначеЕсли КлючВарианта = "АнализДоговоровПоДатеДоговора" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоПотолковПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПоДоговорам", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднееКоличествоПотолковПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСуммаДоговораПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийЧекПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСтоимостьМетраПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяПлощадьПоДоговорам", Результат);
						
		ИначеЕсли КлючВарианта = "АнализПрайсаПоДатеЛида" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоПрайсуПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаОтклоненияОтПрайсаПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентОтклоненияОтПрайсаПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаСкидкиДоговоровПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийПроцентСкидкиДоговоровПоДатеЛида", Результат);
			
		ИначеЕсли КлючВарианта = "АнализПрайсаПоДатеДоговора" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДоговорамПоПрайсу", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаОтклоненияПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентОтклоненияОтПрайсаПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаСкидкиДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийПроцентСкидкиДоговоровПоДоговорам", Результат);
			
		ИначеЕсли КлючВарианта = "АнализМонтажейПоМенеджерамЛида" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаМонтажейПоДатеЗамера", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПотолковМонтажейПоДатеЗамера", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаМонтажейПоДатеДоговора", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПотолковМонтажейПоДатеДоговора", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаМонтажейПоДатеМонтажа", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПотолковМонтажейПоДатеМонтажа", Результат);

		КонецЕсли;
		
	Иначе
		
		ОтчетыЭффективности.ЗаполнитьНастройкиПользовательскогоВариантаОтчета(ОтчетСсылка, КлючВарианта, ТаблицаДоступныхПоказателей, Результат);
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураИтогов() Экспорт
	
	//Вариант:
	// 0 - как сумма значений показателя
	// 1 - как ЗначениеПоказателя / Знаменатель
	//Дополнительный вес - значение, на которое дополнительно умножается итог
	// 1 - по умолчанию 
	// 100 - например, для процентов
	Возврат Новый Структура("ЕстьСумма, ЕстьСреднее, ВариантСуммы, ВариантСреднего, ДополнительныйВесСуммы, ДополнительныйВесСреднего", 
							Истина, Истина, 0, 0, 1, 1);
	
КонецФункции

Функция ДанныеПоИмениОтчета(ИмяОтчета) Экспорт
	
	СтруктураРезультата = Новый Структура("ПредставлениеПоказателя, ПолеПоказателя, ТипПоказателя", "", "", "");
	
	Если ИмяОтчета = "ЭффективностьМаркетинга" Тогда
		СтруктураРезультата.ПредставлениеПоказателя = "";
		
		// поля, по которым осуществляется сбор данных
		// но в отчете эти детальные записи не выводятся
		СтруктураРезультата.ПолеПоказателя 			= "ВидКонтакта";
		СтруктураРезультата.ТипПоказателя  			= "ВидыКонтактов";

	ИначеЕсли ИмяОтчета = "ЭффективностьВидовКонтакта" Тогда
		СтруктураРезультата.ПредставлениеПоказателя = "Вид контакта";
		СтруктураРезультата.ПолеПоказателя 			= "ВидКонтакта";
		СтруктураРезультата.ТипПоказателя  			= "ВидыКонтактов";
		
	ИначеЕсли ИмяОтчета = "ЭффективностьРекламныхАкций" Тогда
		СтруктураРезультата.ПредставлениеПоказателя = "Рекламная акция";
		СтруктураРезультата.ПолеПоказателя			= "РекламнаяАкция";
		СтруктураРезультата.ТипПоказателя  			= "РекламнаяАкция";
		
	ИначеЕсли ИмяОтчета = "ЭффективностьРекламныхИсточников" Тогда
		СтруктураРезультата.ПредставлениеПоказателя = "Рекламный источник";
		СтруктураРезультата.ПолеПоказателя 			= "РекламныйИсточник";
		СтруктураРезультата.ТипПоказателя  			= "РекламныеИсточники";
		
	ИначеЕсли ИмяОтчета = "ЭффективностьТочекПродаж" Тогда
		СтруктураРезультата.ПредставлениеПоказателя = "Точка продаж";
		СтруктураРезультата.ПолеПоказателя 			= "ТочкаПродаж";
		СтруктураРезультата.ТипПоказателя  			= "ТочкиПродаж";

	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции
	
Функция ПустаяТаблицаПоказателей() Экспорт
	
	// при добавлении колонок также добавлять их в:
	// - общая форма "ФормаОтчетаЭффективности" / реквизит формы "ТаблицаТекущихПоказателей"
	// - общая форма "ФормаНастроекЭффективности" / реквизит формы "ВыбранныеПоказатели"
	// - общая форма "ФормаНастроекЭффективности" / реквизит формы "ДеревоПоказателей"
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИдПоказателя", 				Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПредставлениеПоказателя", 	Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОписаниеПоказателя", 		Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ТекстЗапроса", 				Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЕстьСумма", 				Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ЕстьСреднее", 				Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("СтруктураИтогов", 			Новый ОписаниеТипов("Структура"));
	Результат.Колонки.Добавить("Формат", 					Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИдРаздела", 				Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПредставлениеРаздела", 		Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИдРаздела2", 				Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПредставлениеРаздела2", 	Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

// добавляет очередной показатель в таблицу доступных показателей
// Параметры:
// ТаблицаДоступныхПоказателей - таблица, в которую добавляется показатель
// СтруктураРазделов - структура с описанием разделов 1 и 2 уровня
// ИдПоказателя - уникальный в рамках отчета идентификатор показателя
// ПредставлениеПоказателя - представление показателя для отчета
// ОписаниеПоказателя - текстовое описание показателя, выводится на форме настроек
// Формат поля - доступные значение "Количество", "Сумма", учитывается в функции ФорматЯчейки(Значение, Формат)
// СтруктураИтогов - определяет параметры расчета и наличие итогов
// //ЕстьСумма - определяет необходимость вывода итога в строке "Сумма"
// //ЕстьСреднее - определяет необходимость вывода итога в строке "Среднее"
// ТекстЗапроса - текст запроса для вычисления значения показателя
    // Структура запроса:  
	// Раздел - идентификатор раздела, совпадает с параметром "СтруктураРазделов.ИдРаздела"
	// ИдПоказателя - идентификатор показателя - совпадает с параметром "ИдПоказателя"
	// Документ - ссылка на лид
	// Исполнитель - ссылка на исполнителя
	// ЗначениеПоказателя - значение показателя
	// Знаменатель - значение знаменателя (при расчете процентов, конверсии)
	// ВесЗнаменателя - использовать знаменатель при расчете показателя по исполнителю: -1 (нет), 1 (обычная конверсия), 100 (при расчете процента)
Процедура ДобавитьПоказатель(ТаблицаДоступныхПоказателей, 
									СтруктураРазделов,
									ИдПоказателя, ПредставлениеПоказателя, ОписаниеПоказателя, 
									Формат = "Количество",
									//ЕстьСумма = Истина, ЕстьСреднее = Истина,
									СтруктураИтогов,
									ТекстЗапроса 
									) Экспорт
	
	НоваяСтрока = ТаблицаДоступныхПоказателей.Добавить();

	НоваяСтрока.ИдПоказателя = ИдПоказателя;
	НоваяСтрока.ПредставлениеПоказателя = ПредставлениеПоказателя;
	НоваяСтрока.ОписаниеПоказателя = ОписаниеПоказателя;
	НоваяСтрока.ТекстЗапроса = ТекстЗапроса;
	НоваяСтрока.СтруктураИтогов = СтруктураИтогов;
	//НоваяСтрока.ЕстьСумма = ЕстьСумма;
	//НоваяСтрока.ЕстьСреднее = ЕстьСреднее;
	НоваяСтрока.Формат = Формат;
	
	НоваяСтрока.ИдРаздела = СтруктураРазделов.ИдРаздела;
	НоваяСтрока.ПредставлениеРаздела = СтруктураРазделов.ПредставлениеРаздела;
	НоваяСтрока.ИдРаздела2 = СтруктураРазделов.ИдРаздела2;
	НоваяСтрока.ПредставлениеРаздела2 = СтруктураРазделов.ПредставлениеРаздела2;
	
КонецПроцедуры

Функция ЗначениеПоказателя(ТаблицаДанныхДляПоиска, СтруктураПоиска, ЗначениеПоУмолчанию = 0) Экспорт
	
	ЗначениеПоказателя = ЗначениеПоУмолчанию;

	НайденныеСтроки = ТаблицаДанныхДляПоиска.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЗначениеПоказателя = НайденныеСтроки[0].ЗначениеПоказателя;
	КонецЕсли;
	
	Возврат ЗначениеПоказателя;
	
КонецФункции

Функция ЗначениеПоказателяСоЗнаменателем(ТаблицаДанныхДляПоиска, СтруктураПоиска, ЗначениеПоУмолчанию = 0) Экспорт
	
	ЗначениеПоказателя = ЗначениеПоУмолчанию;

	НайденныеСтроки = ТаблицаДанныхДляПоиска.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Если НайденныеСтроки[0].Знаменатель = 0 Тогда
			ЗначениеПоказателя = 0;
		Иначе
			ЗначениеПоказателя = НайденныеСтроки[0].ЗначениеПоказателя / НайденныеСтроки[0].Знаменатель;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеПоказателя;
	
КонецФункции

Функция ФорматЯчейки(Значение, Формат) Экспорт
	
	Если Формат = "Сумма" Тогда
		Возврат Формат(Значение, "ЧДЦ=2");
	ИначеЕсли Формат = "Количество" Тогда
		Возврат Формат(Значение, "ЧДЦ=0");
	Иначе
		Возврат Значение;		
	КонецЕсли;
	
КонецФункции

Функция ФорматСумм(Значение) Экспорт
		
	Возврат Формат(Значение, "ЧДЦ=2");
	
КонецФункции

#КонецОбласти
