Функция MobileZamerGET(Запрос)
	
	СтруктураОтвета = Новый Структура;
	
	Если Не Константы.ИспользуетсяМобильныйКлиентЗамерщика.Получить() Тогда
		
		Ответ = Новый HTTPСервисОтвет(200);
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("message", "Интеграция с мобильным клиентом в программе не подключена");
		СтруктураОтвета.Вставить("error", СтруктураОшибки);
		
	Иначе
		
		Ответ = Новый HTTPСервисОтвет(200);
		ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
		ПользовательБД = ПараметрыСеанса.ТекущийПользователь;
		     		
		//ОБРАБОТКА ЗАПРОСОВ
		Если НРЕГ(ИмяМетода) = "otkazspis" Тогда
			//получение списка причин отказов
			СтруктураОтвета= МобильныйКлиент.ПолучитьСписокПричинОтказаДляJSON();
		ИначеЕсли НРЕГ(ИмяМетода) = "zamerlist" Тогда
			//получение списка замеров
			ПоказыватьВыезды = Запрос.ПараметрыЗапроса.Получить("showdepartures");
			Если НРЕГ(СокрЛП(ПоказыватьВыезды)) = "true" Тогда
				ПоказыватьВыезды = Истина;
			КонецЕсли;
			СтруктураОтвета = МобильныйКлиент.ПолучитьСписокЗамеровПользователяДляJSON(ПользовательБД,,ПоказыватьВыезды)
		ИначеЕсли НРЕГ(ИмяМетода) = "getzamer" Тогда
			//получение данных по одному замеру
			ИДЗамера = Запрос.ПараметрыЗапроса.Получить("id");
			ПоказыватьВыезды = Запрос.ПараметрыЗапроса.Получить("showdepartures");
			Если НРЕГ(СокрЛП(ПоказыватьВыезды)) = "true" Тогда
				ПоказыватьВыезды = Истина;
			КонецЕсли;
			СтруктураОтвета = МобильныйКлиент.ПолучитьСписокЗамеровПользователяДляJSON(ПользовательБД, ИДЗамера, ПоказыватьВыезды);
		ИначеЕсли НРЕГ(ИмяМетода) = "montajlist" Тогда
			//получение списка монтажей на дату
			ДатаГрафикаМонтажейСтрока = Запрос.ПараметрыЗапроса.Получить("date");
			
			СтруктураОтвета = МобильныйКлиент.ПолучитьГрафикМонтажейНаДату(ДатаГрафикаМонтажейСтрока);
		ИначеЕсли НРЕГ(ИмяМетода) = "getfile" Тогда
			
			//получение файла прикрепленного к лиду. у этой ветки условия свой ответ - после выполнения сразу выходим из процедуры
			ИдЛида = Запрос.ПараметрыЗапроса.Получить("id");
			ИмяФайла = СокрЛП(Запрос.ПараметрыЗапроса.Получить("filename"));
			РасширениеФайла = СокрЛП(Запрос.ПараметрыЗапроса.Получить("fileext"));
			
			Ответ = Новый HTTPСервисОтвет(200);
			
			ХранилищеФайла = МобильныйКлиент.ПолучитьПрикрепленныйФайлКЛиду(ИдЛида, ИмяФайла, РасширениеФайла);
			Если ТипЗнч(ХранилищеФайла) = Тип("ХранилищеЗначения") Тогда
				//пришло хранилище значения с данными файла
				Ответ.УстановитьТелоИзДвоичныхДанных(ХранилищеФайла.Получить());
				Ответ.Заголовки.Вставить("Content-Type", "application/octet-stream");
				Ответ.Заголовки.Вставить("Content-Disposition", "attachment; filename=" + КодироватьСтроку(ИмяФайла+"."+РасширениеФайла, СпособКодированияСтроки.КодировкаURL));
				Возврат Ответ;
			Иначе
				//пришёл текст с ошибкой
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("message", ХранилищеФайла);
				СтруктураОтвета.Вставить("error", СтруктураОшибки);
			КонецЕсли;
			
		ИначеЕсли НРЕГ(ИмяМетода) = "positionsrelevanceflag" Тогда
			//получение флага актуальности сопутствующих справочников
			СтруктураОтвета = МобильныйКлиент.ПолучитьФлагАктуальностиНоменклатуры();
			
		ИначеЕсли НРЕГ(ИмяМетода) = "positionslist" Тогда
			//получение элементов доступных номенклатур с сопутствующими справочниками
			СтруктураОтвета = МобильныйКлиент.ПолучитьСписокНоменклатурJSON();
			
		ИначеЕсли НРЕГ(ИмяМетода) = "position" Тогда
			//получение сведений по определенной номенклатуре с сопутствующими справочниками
			гуидНоменклатуры = Запрос.ПараметрыЗапроса.Получить("guid");
			СтруктураОтвета = МобильныйКлиент.ПолучитьСписокНоменклатурJSON(гуидНоменклатуры);
			
		ИначеЕсли НРЕГ(ИмяМетода) = "getprintsettingsfile" Тогда
			
			//получение файла настроек печати смет (логотип, факсимиле)
			гуидФайла = Запрос.ПараметрыЗапроса.Получить("guid");
			имяФайла = Запрос.ПараметрыЗапроса.Получить("filename");
						
			Ответ = Новый HTTPСервисОтвет(200);
			
			ХранилищеФайла = МобильныйКлиент.ПолучитьФайлНастройкиПечатиСметы(гуидФайла);
			Если ТипЗнч(ХранилищеФайла) = Тип("ХранилищеЗначения") Тогда
				//пришло хранилище значения с данными файла
				Ответ.УстановитьТелоИзДвоичныхДанных(ХранилищеФайла.Получить());
				Ответ.Заголовки.Вставить("Content-Type", "application/octet-stream");
				Ответ.Заголовки.Вставить("Content-Disposition", "attachment; filename=" + КодироватьСтроку(ИмяФайла, СпособКодированияСтроки.КодировкаURL));
				Возврат Ответ;
			Иначе
				//пришёл текст с ошибкой
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("message", ХранилищеФайла);
				СтруктураОтвета.Вставить("error", СтруктураОшибки);
			КонецЕсли;
			
		ИначеЕсли НРЕГ(ИмяМетода) = "offersprintform" Тогда
			//получение файла печатной формы предварительного расчета
			
			ГуидПредварительногоРасчета = Запрос.ПараметрыЗапроса.Получить("offersguid");
			ИдентификаторФормы = Запрос.ПараметрыЗапроса.Получить("id");
			ГуидВнешнейОбработки = Запрос.ПараметрыЗапроса.Получить("formguid");
						
			Ответ = Новый HTTPСервисОтвет(200);
			
			ХранилищеФайла = МобильныйКлиент.ПолучитьПечатнуюФормуДокументаПредварительныйРасчетЗаказДоговора(ГуидПредварительногоРасчета, ИдентификаторФормы, ГуидВнешнейОбработки);
			Если ТипЗнч(ХранилищеФайла) = Тип("ХранилищеЗначения") Тогда
				//пришло хранилище значения с данными файла
				Ответ.УстановитьТелоИзДвоичныхДанных(ХранилищеФайла.Получить());
				Ответ.Заголовки.Вставить("Content-Type", "application/octet-stream");
				Ответ.Заголовки.Вставить("Content-Disposition", "attachment; filename=" + КодироватьСтроку(ИмяФайла, СпособКодированияСтроки.КодировкаURL));
				Возврат Ответ;
			Иначе
				//пришёл текст с ошибкой
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("message", ХранилищеФайла);
				СтруктураОтвета.Вставить("error", СтруктураОшибки);
			КонецЕсли;
			
		ИначеЕсли НРЕГ(ИмяМетода) = "montajshedule" Тогда
			//получение графика монтажей
			СтруктураОтвета = МобильныйКлиент.ПолучитьГрафикМонтажей();
			
		ИначеЕсли НРЕГ(ИмяМетода) = "positionsimage" Тогда
			
			//получение изображения номенклтаруы
			ИдПрикрепленногоФайла = СокрЛП(Запрос.ПараметрыЗапроса.Получить("guid"));
			
			Ответ = Новый HTTPСервисОтвет(200);
			
			ХранилищеФайла = МобильныйКлиент.ПолучитьИзображениеНоменклатуры(ИдПрикрепленногоФайла);
			Если ТипЗнч(ХранилищеФайла) = Тип("ХранилищеЗначения") Тогда
				//пришло хранилище значения с данными файла
				Ответ.УстановитьТелоИзДвоичныхДанных(ХранилищеФайла.Получить());
				Ответ.Заголовки.Вставить("Content-Type", "application/octet-stream");
				Ответ.Заголовки.Вставить("Content-Disposition", "attachment; filename=" + КодироватьСтроку(ИдПрикрепленногоФайла, СпособКодированияСтроки.КодировкаURL));
				Возврат Ответ;
			Иначе
				//пришёл текст с ошибкой
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("message", ХранилищеФайла);
				СтруктураОтвета.Вставить("error", СтруктураОшибки);
			КонецЕсли;
			
			
		Иначе
			//пришел запрос на неизвестный метод
			Ответ.КодСостояния = 200;
			
			СтруктураОшибки = Новый Структура;
			СтруктураОшибки.Вставить("message", "Получен неизвестный запрос. Вероятно вам следует обновить вашу конфигурацию CRM&ERP SmartCeilings");
			СтруктураОтвета.Вставить("error", СтруктураОшибки);
		КонецЕсли; 
	КонецЕсли;
	
	//формируем jSON ответ
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета,КодировкаТекста.UTF8);	
	
	Возврат Ответ;

КонецФункции

Функция MobileZamerPOST(Запрос)
	
	СтруктураОтвета = Новый Структура;
	
	Если Не Константы.ИспользуетсяМобильныйКлиентЗамерщика.Получить() Тогда
		
		Ответ = Новый HTTPСервисОтвет(200);
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("message", "Интеграция с мобильным клиентом в программе не подключена");
		СтруктураОтвета.Вставить("error", СтруктураОшибки);
		
	Иначе
		
		Ответ = Новый HTTPСервисОтвет(200);
		
		ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
		ПользовательБД = ПараметрыСеанса.ТекущийПользователь;
		
		
		//ОБРАБОТКА ЗАПРОСОВ
		Если НРЕГ(ИмяМетода = "zamerresult") Тогда
			//запрос на внесение результатов замеров
			
			ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
			
			Ответ.КодСостояния = 200;
			СтруктураОтвета = МобильныйКлиент.ЗаписатьРезультатыЗамеров(ЗапросОтКлиента, ПользовательБД);
			
		ИначеЕсли НРЕГ(ИмяМетода = "zamerfile") Тогда
			//запрос на передачу прикрепленных к замерам файлов
			
			Ответ.КодСостояния = 200;
			СтруктураОтвета = МобильныйКлиент.СохранитьПрикрепленныеДанные(Запрос);
			
		ИначеЕсли НРЕГ(ИмяМетода = "setusertoken") Тогда
			//запрос на сохранение пользовательского токена для ПУШ уведомлений
			
			ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
			
			Ответ.КодСостояния = 200;
			СтруктураОтвета = МобильныйКлиент.СохранитьТокенПользователя(ЗапросОтКлиента, ПользовательБД)
			
		ИначеЕсли НРЕГ(ИмяМетода = "zamerhistory") Тогда
			//запрос на внесение результатов замеров
			
			ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
			
			Ответ.КодСостояния = 200;
			СтруктураОтвета = МобильныйКлиент.ЗаписатьИсториюЛида(ЗапросОтКлиента, ПользовательБД);
			
		ИначеЕсли НРЕГ(ИмяМетода = "offer") Тогда
			//запрос на добавление сметы (предварительного расчета)
			
			ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
			
			Ответ.КодСостояния = 200;
			СтруктураОтвета = МобильныйКлиент.ЗаписатьПредварительныйРасчет(ЗапросОтКлиента, ПользовательБД);
			
			
		ИначеЕсли НРЕГ(ИмяМетода = "zamernewdate") Тогда
			//запрос на добавление сметы (предварительного расчета)
			
			ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
			
			Ответ.КодСостояния = 200;
			СтруктураОтвета = МобильныйКлиент.ИзменитьДатуВремяЗамера(ЗапросОтКлиента, ПользовательБД);
			
		ИначеЕсли НРЕГ(ИмяМетода = "zamernewclientname") Тогда
			//запрос на добавление сметы (предварительного расчета)
			
			ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
			
			Ответ.КодСостояния = 200;
			СтруктураОтвета = МобильныйКлиент.ИзменитьИмяКлиентаВЛиде(ЗапросОтКлиента, ПользовательБД);
			
		ИначеЕсли НРЕГ(ИмяМетода = "setofferasbasic") Тогда
			//запрос на установку сметы (предварительного расчета) как основного для лида
			
			ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
			
			Ответ.КодСостояния = 200;
			СтруктураОтвета = МобильныйКлиент.УстановитьПредварительныйРасчетОсновным(ЗапросОтКлиента, ПользовательБД);
			
		Иначе
			
			//пришел запрос на неизвестный метод
			Ответ.КодСостояния = 200;
			
			СтруктураОшибки = Новый Структура;
			СтруктураОшибки.Вставить("message", "Получен неизвестный запрос. Вероятно вам следует обновить вашу конфигурацию CRM&ERP SmartCeilings");
			СтруктураОтвета.Вставить("error", СтруктураОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//формируем jSON ответ
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета,КодировкаТекста.UTF8);	
	
	Возврат Ответ;
	
КонецФункции

