
&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаГотово(Команда)
	ПеренестиОдинТиповойПотолок();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Фактура = Параметры.Фактура;
	Цвет = Параметры.Цвет;
	//Количество = Параметры.Количество;
	Длина = Параметры.Количество;
	Организация = Параметры.Организация;
	Склад = Параметры.Склад;
	РасчитатьПлощадь();
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоНоменклатуре(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Организация",			Организация);
	ПараметрыПодбора.Вставить("ПодборТиповых",			Истина);
	Если Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка") Тогда 
		ПараметрыПодбора.Вставить("Склад", 				ПолучитьСкладТекущегоПользователя());
	Иначе
		ПараметрыПодбора.Вставить("Склад",				Склад);
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыПолотно());
	ВозвращенноеЗначение = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораНоменклатуры",ПараметрыПодбора);
	
	Если НЕ ВозвращенноеЗначение = Неопределено Тогда
		Если ВозвращенноеЗначение.Количество() = 1 Тогда
			Для Каждого ТекущаяСтрока из ВозвращенноеЗначение Цикл
				Номенклатура = ТекущаяСтрока.Номенклатура;
				Количество = ТекущаяСтрока.Количество;
				ЗаполнитьФактуруИЦветПоНоменклатуре();
			КонецЦикла;
		Иначе	
			//если больше одного нужно заполнить ТЧ типовыми отрезами
			ПеренестиНесколькоТиповыхПотолков(ВозвращенноеЗначение);						
		КонецЕсли;			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНесколькоТиповыхПотолков(ВозвращенноеЗначение)
	ТаблицаПотолков.Очистить();
	Для Каждого ТекущаяСтрока из ВозвращенноеЗначение Цикл
		НоваяСтрока = ТаблицаПотолков.Добавить();				
		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		НоваяСтрока.Количество = ТекущаяСтрока.Количество;		
		НоваяСтрока.Цвет = ТекущаяСтрока.Цвет;		
		НоваяСтрока.Фактура = ТекущаяСтрока.Фактура;
	КонецЦикла;
	
	Закрыть(ТаблицаПотолков);
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиОдинТиповойПотолок()
	ТаблицаПотолков.Очистить();	
	НоваяСтрока = ТаблицаПотолков.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Фактура = Фактура;
	НоваяСтрока.Цвет = Цвет;
	НоваяСтрока.Количество = Количество;
	НоваяСтрока.Длина = Длина;
	НоваяСтрока.Ширина = ШиринаПолотна;
	Закрыть(ТаблицаПотолков);	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьФактуруИЦветПоНоменклатуре()
	
	Если Номенклатура.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦветФактуры.Ссылка,
	|	ЦветФактуры.Владелец
	|ИЗ
	|	Справочник.ЦветФактуры КАК ЦветФактуры
	|ГДЕ
	|	ЦветФактуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Цвет = Выборка.Ссылка;
		Фактура = Выборка.Владелец;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкладТекущегоПользователя()
	Возврат ОбщийМодульСервер.НастройкаПользователя("Склад");
КонецФункции

&НаСервере
Функция ПолучитьСписокВидовНоменклатурыПолотно()
	
	Список = Новый СписокЗначений;
	Список.Добавить(Справочники.ВидыНоменклатуры.ОстатокПленки);
	Возврат Список;

	
КонецФункции

&НаСервере
Процедура ФактураПриИзмененииНаСервере()
	ШиринаПолотна = Фактура.ШиринаПолотна;
	РасчитатьПлощадь();
КонецПроцедуры

&НаКлиенте
Процедура ФактураПриИзменении(Элемент)
	ФактураПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РасчитатьПлощадь()
	
	Количество = (ШиринаПолотна * Длина) / 10000;
	
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	РасчитатьПлощадь();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)
	РасчитатьПлощадь();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Если НЕ ШиринаПолотна = 0 Тогда
		Длина = Количество * 10000 / ШиринаПолотна
	КонецЕсли;
КонецПроцедуры
