
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ИА_ЗаказыНаПриобретение.Записывать = Истина;
	Движения.ИА_ЗаказыНаПриобретение.Очистить();
	
	//Движения.КСУ_ЛентаСобытий.Записывать = Истина;
	//Движения.КСУ_ЛентаСобытий.Очистить();
	
	//Движения.ИА_ИсторияСтатусовЗВС.Записывать = Истина;
	//Движения.ИА_ИсторияСтатусовЗВС.Очистить();

	ПоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	
	//Движения.ИА_НачислениеЗарплаты.Записывать = Истина;
	//Движения.ИА_НачислениеЗарплаты.Очистить();

	Движение = Движения.ИА_ЗаказыНаПриобретение.ДобавитьПриход();
    Движение.ЗП = Ссылка;
	Движение.Организация = Организация;
	Движение.Период = Дата;
	Движение.Сумма = Сумма;
	
	//Для Каждого ТекСтрокаРасчет Из Зарплата Цикл
	//	Движение = Движения.ИА_НачислениеЗарплаты.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.ЗаМесяц = ЗаМесяц;
	//	Движение.ЗаНеделю = ЗаНеделю;
	//	
	//	Движение.Сотрудник = ТекСтрокаРасчет.Сотрудник;
	//	Если ПоОрганизациям тогда
	//		Движение.Организация = Организация;
	//	КонецЕсли;
	//	Движение.Сумма = ТекСтрокаРасчет.Сумма;
	//КонецЦикла;
	
	Если НЕ Отказ Тогда 
		ЗаписьИсторииСтатусовЗВС();		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаписьИсторииСтатусовЗВС()
	
	НовыйСтатус = Неопределено;
	НоваяПричинаОтказа = Неопределено;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("Статус",НовыйСтатус) Тогда 
		Возврат;
	КонецЕсли;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("ПричинаОтказа",НоваяПричинаОтказа); 
	
	Движения.ИА_ИсторияСтатусовЗВС.Записывать = Истина;
	
	Новстр = Движения.ИА_ИсторияСтатусовЗВС.Добавить();	
	Если НовыйСтатус = Перечисления.ИА_СостояниеЗаказа.Отклонен Тогда
		Новстр.Период = ТекущаяДата();
	Иначе
		Новстр.Период = Дата;
	КонецЕсли;	
	Новстр.ЗВС = Ссылка;
	Новстр.Статус = НовыйСтатус;
	Новстр.ПричинаОтказа = НоваяПричинаОтказа;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//НовыйСтатус = Неопределено;
	//Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("Статус",НовыйСтатус) Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ИА_ИсторияСтатусовЗВССрезПоследних.Статус
	//	|ИЗ
	//	|	РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних(, ЗВС = &ЗВС) КАК ИА_ИсторияСтатусовЗВССрезПоследних";
	//	
	//	Запрос.УстановитьПараметр("ЗВС", Ссылка);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Если РезультатЗапроса.Пустой() Тогда 
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Выборка.Следующий();
	//	НовыйСтатус = Выборка.Статус;
	//КонецЕсли;
	//
	//Если НовыйСтатус <> Перечисления.ИА_СостояниеЗаказа.Подготовлен И НовыйСтатус <> Перечисления.ИА_СостояниеЗаказа.Черновик Тогда
	//	Отказ = Истина;
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Отменить проведение документа - " + Ссылка + ", можно только в статусе ""Подготовлен"" или ""Черновик""";
	//	Сообщение.Сообщить();
	//	возврат;
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	статусы.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ИА_ИсторияСтатусовЗВС КАК статусы
	|ГДЕ
	|	статусы.ЗВС = &ЗВС
	|	И статусы.Регистратор ССЫЛКА Документ.ИА_ФинансовоеПланирование";
	Запрос.УстановитьПараметр("ЗВС", Ссылка);
	Выборка = запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Невозможно отменить проведение документа - " + Ссылка + " т.к. он прошел через Финансовое планирование!";
		Сообщение.Сообщить();
		возврат;
	КонецЕсли;
	
	Движение = РегистрыСведений.КСУ_ЛентаСобытий.СоздатьМенеджерЗаписи();
	Движение.ПериодСобытия = Дата;
	Движение.ДатаСобытия = ТекущаяДата();
	Движение.Объект = Ссылка;		
	Движение.Событие = "Отмена проведения";
	Движение.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Движение.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Ссылка.Проведен и РежимЗаписи = РежимЗаписиДокумента.Проведение тогда // документ проводится
		ДополнительныеСвойства.Вставить("НадоОповестить", Истина);		
	КонецЕсли;
	
	Если Зарплата.Количество()>0 и (ЗаМесяц = Дата(1,1,1) ИЛИ ЗаНеделю = Дата(1,1,1)) Тогда
		Сообщить("Необходимо указать расчетный месяц и неделю зарплаты!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Если ЗначениеЗаполнено(ЭтотОбъект.Основание) и ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ИА_ЗаявкаНаОбязательства") Тогда
			
			СуммаЗВСПоОснованию = СуммаЗВСПоОснованию(Основание, Ссылка);
			СуммаЗВС = СуммаЗВСПоОснованию + Сумма;
			СуммаОснования = Основание.Сумма;
			
			Если СуммаЗВС > СуммаОснования Тогда
				Сообщить("Сумма ЗВС с учетом текущего документа превышает сумму по " + Основание +" на "+ (СуммаЗВС - СуммаОснования));
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;
	
	Если Ссылка.Лента.Количество() < Лента.Количество() Тогда
		ДополнительныеСвойства.Вставить("СтрокаЛентыСсылка", Ссылка.Лента.Количество());		
	КонецЕсли;
	Если Ссылка.Файлы.Количество() < Файлы.Количество() Тогда
		ДополнительныеСвойства.Вставить("СтрокаФайлыСсылка", Ссылка.Файлы.Количество());		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтатусЗВС = Неопределено;
	Если ДополнительныеСвойства.Свойство("Статус") Тогда  
		СтатусЗВС = ДополнительныеСвойства.Статус;
	КонецЕсли;
	СтарыйСтатусЗВС = Неопределено;
	Если ДополнительныеСвойства.Свойство("СтатусСсылка") Тогда  
		СтарыйСтатусЗВС =  ДополнительныеСвойства.СтатусСсылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатусЗВС) и СтатусЗВС <> Перечисления.ИА_СостояниеЗаказа.Подготовлен и СтатусЗВС <> Перечисления.ИА_СостояниеЗаказа.Черновик Тогда
		Если Фонд.Пустая() тогда 
			отказ= Истина; 
			сообщить("Заполните фонд"); 
		КонецЕсли;
		
		выбСтат = Справочники.КСУ_СтатьиРасходов.Выбрать(,фонд);
		Если Статья.Пустая() И ИА_ФП_ПовторИсп.ФП_по_ТБ(Дата) и Фонд.Пустая() = ложь и выбСтат.Следующий() тогда 
			отказ= Истина; 
			сообщить("Заполните статью"); 
		КонецЕсли;
	КонецЕсли;

	
	Если (ЗначениеЗаполнено(СтатусЗВС) И ЗначениеЗаполнено(СтарыйСтатусЗВС) И СтатусЗВС <> СтарыйСтатусЗВС) тогда // поменялся статус
		ДополнительныеСвойства.Вставить("НадоОповестить", Истина);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НадоОповестить") И ДополнительныеСвойства.НадоОповестить Тогда
		
		Если ЗначениеЗаполнено(СтатусЗВС) Тогда //Запись из ЗВС
			СтатусОповещения = СтатусЗВС;
		Иначе
			СтатусОповещения = ИА_ФП.ВернутьСтатусЗВС(Ссылка).Статус; //Запись из ФП
		КонецЕсли;
		
		Запись = РегистрыСведений.ИА_Оповещение.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.Заказ = Ссылка;
		Запись.Автор = ПараметрыСеанса.ТекущийПользователь;
		Запись.Статус = СтатусОповещения;
		Если ДополнительныеСвойства.Свойство("ОтклонениеИзФП") Тогда
			Запись.Автоотклонение = ДополнительныеСвойства.ОтклонениеИзФП;
		КонецЕсли;
		
		Запись.Записать(Истина);
	КонецЕсли;


	//// ЛЕНТА
	Если ДополнительныеСвойства.Свойство("СтрокаЛентыСсылка") Тогда
		Для сч = ДополнительныеСвойства.СтрокаЛентыСсылка по Лента.Количество() - 1 Цикл
			ТекСтр = Лента[сч];
			Движение = РегистрыСведений.КСУ_ЛентаСобытий.СоздатьМенеджерЗаписи();
			Движение.ПериодСобытия = ТекСтр.Период;
			Движение.ДатаСобытия = ТекущаяДата();
			ЗаполнитьЗначенияСвойств(Движение, ТекСтр);
			Движение.Объект = Ссылка;
			
			Движение.Записать();
		КонецЦикла;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("СтрокаФайлыСсылка") Тогда
		Для сч = ДополнительныеСвойства.СтрокаФайлыСсылка по Файлы.Количество() - 1 Цикл
			ТекСтр = Файлы[сч];
			Движение = РегистрыСведений.КСУ_ЛентаСобытий.СоздатьМенеджерЗаписи();
			Движение.ПериодСобытия = ТекущаяДата();
			Движение.ДатаСобытия = ТекущаяДата();
			Движение.Объект = Ссылка;
			Движение.Событие = "Прикреплен файл " + ТекСтр.Имя; 
			Движение.Ответственный = ТекСтр.Ответственный;
			
			Движение.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОбязательноеУказаниеСрокаОплатыВЗВС = Константы.ИА_ФП_ОбязательноеУказаниеСрокаОплатыВЗВС.Получить();
	Если ОбязательноеУказаниеСрокаОплатыВЗВС Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаОплаты");
	КонецЕсли;
	
	ИспользоватьВидДССправочно = Константы.ИА_ФП_ИспользоватьВидДССправочно.Получить();
	Если ИспользоватьВидДССправочно Тогда
		ПроверяемыеРеквизиты.Добавить("ВидДССправочно");
	КонецЕсли;
		
КонецПроцедуры

Функция СуммаЗВСПоОснованию(ДокументОснование, ТекущийДокумент)
	
	СуммаЗВС = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ИА_ЗаказНаПриобретение.Сумма), 0) КАК Сумма
	               |ИЗ
	               |	Документ.ИА_ЗаказНаПриобретение КАК ИА_ЗаказНаПриобретение
	               |ГДЕ
	               |	ИА_ЗаказНаПриобретение.Основание = &Основание
	               |	И ИА_ЗаказНаПриобретение.Ссылка <> &ТекущийДокумент
	               |	И ИА_ЗаказНаПриобретение.Проведен";
	
	Запрос.УстановитьПараметр("Основание",       ДокументОснование);
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СуммаЗВС = ВыборкаДетальныеЗаписи.Сумма;
	КонецЕсли;
	
	Возврат СуммаЗВС;
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	//Файлы.Очистить();
	Для каждого стр из Файлы Цикл
		Если стр.НомерЗВС = "" Тогда
			стр.НомерЗВС = ОбъектКопирования.Номер; 
		КонецЕсли;
	КонецЦикла;
	
	лента.Очистить();
	
	ДокументыОснования.Очистить();
	Основание = Неопределено;
	НФ_Заказ = БизнесПроцессы.ИА_БПНоситель.ПустаяСсылка();
	Сотрудник = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ИА_ЗадачаПланаДействий") Тогда
		Основание = ДанныеЗаполнения;
		
		Ситуация = ДанныеЗаполнения.Ситуация;
		Данные = ДанныеЗаполнения.Данные;
		Решение = ДанныеЗаполнения.Содержание;
		
		ПредметЗаказа = ДанныеЗаполнения.Наименование; 
	КонецЕсли;
КонецПроцедуры
