//_____________________________________________________________
//***
// Обмен данными идет в структуре:
// 1) СКД - Схема компоновки данных, 
// 2) Настройки - Настройки (на текущий момент только "отбор") 
// 3) ИДОтбора  - Строка-Ключ открытой формы
// 4) СообщениеЕслиУсловиеВыполнено - если есть, будет показано 
// 5) СообщениеЕслиУсловиеНеВыполнено
// 6) Заголовок - Будет заголовком формы


&НаСервере
Функция ПодготовитьДанныеВыбора()
    Настройки = Компоновщик.ПолучитьНастройки();
    СКД = ПолучитьИзВременногоХранилища(АдресСКД);
    Результат = Новый Структура("Настройки, СКД, ИДОтбора", Настройки, СКД, ИДОтбора);
    Если СообщениеЕслиУсловиеВыполненоЕсть Тогда
    	Результат.Вставить("СообщениеЕслиУсловиеВыполнено", СообщениеЕслиУсловиеВыполнено);
    КонецЕсли; 
    Если СообщениеЕслиУсловиеНеВыполненоЕсть Тогда
    	Результат.Вставить("СообщениеЕслиУсловиеНеВыполнено", СообщениеЕслиУсловиеНеВыполнено);
    КонецЕсли; 
    
    Результат = ПоместитьВоВременноеХранилище(Результат, ЭтаФорма);
    Возврат Результат;
КонецФункции
 

//_____________________________________________________________

&НаКлиенте
Процедура ОК(Команда)
    Отказ = Ложь;
    Если СообщениеЕслиУсловиеВыполненоЕсть И НЕ ЗначениеЗаполнено(СообщениеЕслиУсловиеВыполнено) Тогда
    	Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Введите сообщение для ""условие выполнено"" !";
        Сообщение.Сообщить(); 
        Отказ  = Истина;
    КонецЕсли; 
    
    Если СообщениеЕслиУсловиеНеВыполненоЕсть И НЕ ЗначениеЗаполнено(СообщениеЕслиУсловиеНеВыполнено) Тогда
    	Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Введите сообщение для ""условие не выполнено"" !";
        Сообщение.Сообщить(); 
        Отказ  = Истина;
    КонецЕсли; 
    
    Если Не Отказ Тогда
        Хранилище = ПодготовитьДанныеВыбора();
        ДанныеВыбора = Новый Структура("ДанныеНастроек, Вид", Хранилище, "РедакторОтбораСКД");
        ОповеститьОВыборе(ДанныеВыбора);
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если НЕ Параметры.Свойство("ДанныеНастроек") Тогда
        Отказ = Истина;
    	Возврат;
    КонецЕсли; 
    
    ДанныеНастроек = ПолучитьИзВременногоХранилища(Параметры.ДанныеНастроек);
    СКД  = ДанныеНастроек.СКД;
    Настройка = ДанныеНастроек.Настройки;
    
    АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
    
    Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
    Если Настройка <> Неопределено  Тогда
        Компоновщик.ЗагрузитьНастройки(Настройка);
        //Компоновщик.Восстановить();
    Иначе
        Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
    КонецЕсли; 
    
    Если ДанныеНастроек.Свойство("ИДОтбора") Тогда
    	ИДОтбора = ДанныеНастроек.ИДОтбора;
    Иначе
        ИДОтбора = ИА_БФКС.СформироватьУИД();
    КонецЕсли; 
    
    Если ДанныеНастроек.Свойство("СообщениеЕслиУсловиеВыполнено") Тогда    
        СообщениеЕслиУсловиеВыполненоЕсть = Истина;
        СообщениеЕслиУсловиеВыполнено = ДанныеНастроек.СообщениеЕслиУсловиеВыполнено;
    КонецЕсли;
    
    Если ДанныеНастроек.Свойство("СообщениеЕслиУсловиеНеВыполнено") Тогда    
        СообщениеЕслиУсловиеНеВыполненоЕсть = Истина;
        СообщениеЕслиУсловиеНеВыполнено = ДанныеНастроек.СообщениеЕслиУсловиеНеВыполнено;
    КонецЕсли;
    
    Элементы.СообщениеЕслиУсловиеВыполнено.Видимость = СообщениеЕслиУсловиеВыполненоЕсть;
    Элементы.СообщениеЕслиУсловиеВыполнено.АвтоОтметкаНезаполненного = СообщениеЕслиУсловиеВыполненоЕсть;
    
    Элементы.СообщениеЕслиУсловиеНеВыполнено.Видимость = СообщениеЕслиУсловиеНеВыполненоЕсть;
    Элементы.СообщениеЕслиУсловиеНеВыполнено.АвтоОтметкаНезаполненного = СообщениеЕслиУсловиеНеВыполненоЕсть;
    
    Если ДанныеНастроек.Свойство("Заголовок") Тогда
        ЭтаФорма.Заголовок = ДанныеНастроек.Заголовок;
    КонецЕсли; 
КонецПроцедуры
