#Область ПеременныеФормы

&НаКлиенте
Перем СтараяСуммаДокумента Экспорт;

&НаКлиенте
Перем мСуммаБонусов;

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	ЗаполнитьСтавкуНДСПоОрганизации(Истина);
	 
	ДобавлятьЗаказыВторогоПорядкаВРаспределение = НЕ Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();	
	Элементы.Статья.АвтоОтметкаНезаполненного = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();	
	ДобавлятьДокументыПродажиПоЗаказамПокупателей = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
										И Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить();
	ДобавлятьДокументыПродажиПоЗаказДоговорам = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
										И Константы.ВестиРасчетыПоЗаказамПоМонтажу.Получить();
										
	Если Параметры.Ключ.Пустая() тогда	
		
		ПересчитатьБонусыПоДокументу();
		//ЗаполнитьОснованияПоРаспределению(); //Заккоментировано по заявке #5186
		ПриЧтенииСозданииНаСервере(); // №11237
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
		
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	Элементы.ГруппаФискальныйРегистратор.Видимость = Константы.ИспользоватьПодключаемоеОборудование.Получить();
	Элементы.ФормаПечатьЧека.Видимость = Элементы.ГруппаФискальныйРегистратор.Видимость;
	Элементы.ФормаПоказатьТовары.Видимость = Элементы.ГруппаФискальныйРегистратор.Видимость;
	
	УстановитьВидимостьКнопокРаспределения();
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
	ОбновитьДанные();
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере(); // №11237
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ВалютаДокумента = Объект.Валюта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ОбновитьДанные();
	СтараяСуммаДокумента = Объект.Сумма;
	мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте;
	ОбновитьВидимостьГруппыБонусов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ФинансыСервер.ПроверитьСуммуРаспределенияПоТипамДокументов(Объект, , Объект.Сумма, Отказ, ПараметрыЗаписи.РежимЗаписи, Истина);
	
	// #15647
	Если ЗаписьПослеПробития Тогда
		ЗаписьПослеПробития = Ложь;
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзмененияПроведенногоДокумента", Истина);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте;
	Оповестить("ОбновитьАРМПроизводства",,"ПриходныйКассовыйОрдер");
	Оповестить("ОбновитьСписокРеализаций",,"ПриходныйКассовыйОрдер");
	Оповестить("Запись_ДокументОплаты",, Объект.Ссылка);
	
	ОбщийМодульКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если НЕ Объект.Валюта = ВалютаУчета Тогда
		ОбновитьДанные();
		//пересчитаем сумму распределения в валюте документа, т.к. сменился курс валюты
		ОбработкаТабличныхЧастейСервер.ПересчитатьИзВалютыВВалюту(Объект.РаспределениеПлатежа, Объект.Валюта, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ЗаполнитьСтатьюДоходовРасходовСервер();
	ПересчитатьБонусыПоДокументу();
	
	ОбновитьВидимостьГруппыБонусов();
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьСтавкуНДСПоОрганизации();
	ЗаполнитьСтатьюДоходовРасходовСервер();
	ПересчитатьБонусыПоДокументу();
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.РаспределениеПлатежа.Очистить();
	КонтрагентПриИзмененииНаСервере();
	ПересчитатьБонусыПоДокументу();
	ОбновитьДанные();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()	
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Контрагент, "ОсновнойДоговор, Категория");	
		Объект.Договор = РеквизитыКонтрагента.ОсновнойДоговор;
		Объект.КатегорияКонтрагента = РеквизитыКонтрагента.Категория;
	Иначе
		Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		Объект.КатегорияКонтрагента = Справочники.КатегорииКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	Если НЕ КассаПриИзмененииНаСервере() Тогда
		ПоказатьПредупреждение(,"Выбрана касса, не принадлежащая организации");
		Возврат;
	КонецЕсли;
	ПересчитатьБонусыПоДокументу();
КонецПроцедуры

&НаСервере
Функция КассаПриИзмененииНаСервере()
	Если НЕ Объект.Касса.Владелец = Объект.Организация Тогда
		Объект.Касса = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ Объект.Касса.Валюта.Пустая() Тогда
		Объект.Валюта = Объект.Касса.Валюта;
	Иначе
		Объект.Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	ОбновитьДанные();
	
	Если НЕ Объект.Валюта = ВалютаДокумента Тогда // №11237 пересчитываем если валюта была другая, было: Если НЕ Объект.Валюта = ВалютаУчета Тогда
		
		//++ №11237 сумму документа также пересчитываем
		ДатаКурса    = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
		Объект.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаДокумента, Объект.Валюта, ДатаКурса, Объект.Сумма);
		//-- №11237
		
		//пересчитаем сумму распределения в валюте документа, т.к. сменился курс валюты
		ОбработкаТабличныхЧастейСервер.ПересчитатьИзВалютыВВалюту(Объект.РаспределениеПлатежа, Объект.Валюта, Объект.Дата, Истина);
		
	КонецЕсли;
	
	ВалютаДокумента = Объект.Валюта;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Если Объект.Сумма > 0 И Объект.Сумма > Объект.СуммаПроцентовПоЗайму Тогда
		Объект.СуммаОсновногоТелаЗайма = Объект.Сумма - Объект.СуммаПроцентовПоЗайму;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("СтараяСуммаДокумента", СтараяСуммаДокумента);
	ВыполнитьРаспределениеОплаты(ДополнительныеПараметры);
	
	СуммаПриИзмененииКлиент();
	 
КонецПроцедуры

// Экспорт - вызывается из ФинансыКлиент 
&НаКлиенте
Процедура СуммаПриИзмененииКлиент() Экспорт
	
	СтараяСуммаДокумента = Объект.Сумма;
	
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);
	ПересчитатьБонусыПоДокументу();
	 
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	//++ №11237 нужно пересчитать из валюты в валюту если она поменялась, предварительно уточнив у пользователя
	//ОбновитьДанные();
	Если ЗначениеЗаполнено(Объект.Валюта) И НЕ ВалютаДокумента = Объект.Валюта Тогда
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя") Тогда
			ТекстВопроса = "Пересчитать суммы документа по курсу новой валюты?";
			ОписаниеОповещения = Новый ОписаниеОповещения("ВалютаПриИзмененииФрагмент", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ВалютаПриИзмененииЗавершение();
		КонецЕсли;
	Иначе
		ВалютаПриИзмененииЗавершение();
	КонецЕсли;
	//-- №11237
	
КонецПроцедуры

//++ №11237
&НаКлиенте
Процедура ВалютаПриИзмененииФрагмент(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВалютаПриИзмененииСервер(Объект.Валюта,	Истина);		
	Иначе
		Объект.Валюта = ВалютаДокумента;
	КонецЕсли;
	
	ВалютаПриИзмененииЗавершение();
		
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзмененииЗавершение()
	
	ВалютаДокумента = Объект.Валюта;	
	ОбновитьДанные();
		
КонецПроцедуры 

&НаСервере
Процедура ВалютаПриИзмененииСервер(НоваяВалюта, ПересчитатьСуммы = Истина)
		
	Если ПересчитатьСуммы Тогда 
		
		СтараяВалюта = ВалютаДокумента;
		ДатаКурса    = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
		
		Объект.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(СтараяВалюта, НоваяВалюта, ДатаКурса, Объект.Сумма);
		РаспределитьСуммуОплатыПоДокументам();
		
	КонецЕсли;
		
КонецПроцедуры
//-- №11237

//++ №13755
&НаКлиенте
Процедура СтатьяДоходовПриИзменении(Элемент)
	
	Объект.СтатьяДоходовПоНачислению = Объект.СтатьяДоходов;
	
КонецПроцедуры
//-- №13755

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийИКоманд_ТЧРаспределение

&НаКлиенте
Процедура Распределение_Документ(Команда)
	ФинансыКлиент.Распределение_Документ(Команда, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//Процедура ПослеВыбораДокумента(ВыбранныйДокумент, ДополнительныеПараметры) Экспорт
	
	Для каждого ВыбранныйДокумент из ВыбранноеЗначение Цикл
		Если НЕ ВыбранныйДокумент.Пустая() Тогда
			НоваяСтрока = Объект.РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ВыбранныйДокумент;
			//НоваяСтрока.Сумма = ПолучитьСуммуДокумента(НоваяСтрока.Документ);
			НоваяСтрока.Сумма = Объект.Сумма;
			
			Если ДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
				ДобавитьОснованиеЗаказаСервер(НоваяСтрока.Документ);
			КонецЕсли;
			//#7709
			Если ДобавлятьДокументыПродажиПоЗаказамПокупателей ИЛИ ДобавлятьДокументыПродажиПоЗаказДоговорам Тогда
				ДобавитьДокументыПродажиПоЗаказамСервер(НоваяСтрока.Документ);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		РаспределениеОплаты(Неопределено);
		ОбновитьДанные();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока Тогда
		РаспределениеОплаты(Неопределено);
		ОбновитьДанные();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаПослеУдаления(Элемент)
	РаспределениеОплаты(Неопределено);
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОплаты(Команда)
	
	//Если Объект.РаспределениеПлатежа.Количество() = 0 Тогда
	//	Возврат;
	//Конецесли;
	//
	//Если Объект.Проведен Тогда
	//	ОповещениеВопрос = Новый ОписаниеОповещения("ОповещениеВопросОтменаПроведениеПередРаспределением", ЭтаФорма);
	//	ПоказатьВопрос(ОповещениеВопрос, "Будет произведено распределение суммы по документам и документ будет распроведен. Продолжить?", РежимДиалогаВопрос.ДаНет); 
	//Иначе
	//	РаспределитьСуммуОплатыПоДокументам();
	//	Модифицированность = Истина;
	//КонецЕсли;
	
	ВыполнитьРаспределениеОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРаспределениеОплаты(ДополнительныеПараметры=Неопределено)

	ОписаниеОповещенияОбновитьДанные = Новый ОписаниеОповещения("ОписаниеОповещенияОбновитьДанные", ЭтотОбъект);
	ФинансыКлиент.РаспределениеОплаты(ЭтаФорма, "РаспределениеПлатежа", СтрокиРаспределенияПлатежей(), Объект.Сумма, ОписаниеОповещенияОбновитьДанные, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Функция СтрокиРаспределенияПлатежей()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.РаспределениеПлатежа.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ОписаниеОповещенияОбновитьДанные(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьДанные();
КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеВопросОтменаПроведениеПередРаспределением(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
//		Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения)) Тогда
//			РаспределитьСуммуОплатыПоДокументам();
//			ОповещениеВопрос = Новый ОписаниеОповещения("ОповещениеВопросПроведениеПослеРаспределения", ЭтаФорма);
//			ПоказатьВопрос(ОповещениеВопрос, "Провести документ?", РежимДиалогаВопрос.ДаНет);
//		КонецЕсли;
//	Иначе
//		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
//			Если ДополнительныеПараметры.Свойство("СтараяСуммаДокумента") Тогда	
//				Объект.Сумма = ДополнительныеПараметры.СтараяСуммаДокумента;
//				СтараяСуммаДокумента = ДополнительныеПараметры.СтараяСуммаДокумента;
//			КонецЕсли;
//		КонецЕсли;		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеВопросПроведениеПослеРаспределения(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
//		Если НЕ Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
//			Модифицированность = Истина;
//		КонецЕсли;
//	Иначе
//		Модифицированность = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры
		
&НаСервере
Процедура РаспределитьСуммуОплатыПоДокументам()
	
	ОбработкаТабличныхЧастейСервер.РаспределитьСуммуОплатыПоДокументам(СтрокиРаспределенияПлатежей(), Объект.Сумма, Объект.Дата, Объект.Валюта);
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереплатаНаПоследнийДокумент(Команда)
	РаспределитьПереплатуНаПоследнийДокумент();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура РаспределитьПереплатуНаПоследнийДокумент()
	ОбработкаТабличныхЧастейСервер.РаспределитьПереплатуНаПоследнийДокумент(Объект.РаспределениеПлатежа, Объект.Сумма, Объект.Дата, Объект.Валюта);
	ОбновитьДанные();
КонецПроцедуры 

&НаКлиенте
Процедура РаспределениеПлатежаСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.РаспределениеПлатежа.ТекущиеДанные;
	
	// №7373 нужно определить различие в валютах, чтобы корректно отображать определенные колонки и суммы
	ВалютаЗаказаРавнаВалютеДокумента = ОпределитьРазличиеВалютыЗаказаИВалютыДокументаНаСервере();
	
	Если НЕ (Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента) И НЕ ТекущаяСтрока = Неопределено Тогда
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьИзВалютыВВалютуВСтрокеТЧ(ТекущаяСтрока, Объект.Валюта, Объект.Дата);
	КонецЕсли;
	ОбновитьНадписиРаспеределениеПлатежаНаСервере(ВалютаЗаказаРавнаВалютеДокумента);
	
КонецПроцедуры

&НаСервере
Функция ОпределитьРазличиеВалютыЗаказаИВалютыДокументаНаСервере()
	
	Возврат ФинансыСервер.ОпределитьРазличиеВалютыЗаказаИВалютыДокумента(Объект);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТЧРаспределение

&НаКлиенте
Процедура РаспределениеПлатежаДатаПлатежаПоРассрочкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.РаспределениеПлатежа.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		СписокВариантов = ПолучитьДатыОплатыПоДоговоруРассрочки(ТекущиеДанные.Документ);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборДатыПлатежаПоРассрочке", ЭтаФорма);
		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокВариантов, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДатыПлатежаПоРассрочке(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.РаспределениеПлатежа.ТекущиеДанные.ДатаПлатежаПоРассрочке = ВыбранныйЭлемент.Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаДатаПлатежаПоРассрочкеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаДатаПлатежаПоРассрочкеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПоказатьОповещениеПользователя("Сообщение", , "Дату следует выбирать согласно предложенных вариантов");
	Элементы.РаспределениеПлатежа.ТекущиеДанные.ДатаПлатежаПоРассрочке = Дата(1,1,1);
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщийМодульКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщийМодульКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщийМодульКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДетализацияВзаиморасчетов(Команда)
	ПараметрыОтчета = Новый Структура("Отбор, СформироватьПриОткрытии", 
                                    Новый Структура("Контрагент", Объект.Контрагент), 
                                    Истина);
	//ПараметрыОтчета = Новый Структура;
	//ПараметрыОтчета.Вставить("Контрагент",Объект.Контрагент);
	ОткрытьФорму("Отчет.ДетализацияВзаиморасчетовСКонтрагентом.Форма",ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТовары(Команда)
	Элементы.ГруппаТовары.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧека(Команда)
	
	Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя") Тогда
		ТекстСообщения = НСтр("ru = 'Пробитие чека по виду операции не предусмотрено!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Объект.ЧекФискализирован Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на оборудовании!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	//++ №7951 необходимо проверить права на объекты распределения, как минимум должно быть чтение
	Если НЕ ПотолкиКассыОнлайн.ПроверитьДоступКДокументамРаспределения(Объект) Тогда
		Возврат;
	КонецЕсли;	
	//-- №7951
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросПроведениеПередПечатьюЧека", ЭтотОбъект);	
	Если ПотолкиКассыОнлайнКлиент.ПроверитьВозможностьПечатиЧека(ОбработчикОповещения, ЭтотОбъект) Тогда
		ПечатьЧекаКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекаКлиент()
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ДокументСсылка",           Объект.Ссылка);
	ПараметрыОперации.Вставить("Партнер",                  Объект.Контрагент);
	ПараметрыОперации.Вставить("Организация",              Объект.Организация);
	ПараметрыОперации.Вставить("ПодключенноеОборудование", Неопределено); //ФискальнаяОперацияПодключенноеОборудование);
		
	ОписаниеОповещенияПриЗавершении = Новый ОписаниеОповещения("ФискализацияЧека_Завершение", ЭтотОбъект);
	ОткрытьФорму(
			"Обработка.ПредпросмотрЧека.Форма",
			ПараметрыОперации,
			ЭтотОбъект,,,,
			ОписаниеОповещенияПриЗавершении);
			
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросПроведениеПередПечатьюЧека(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
			ПечатьЧекаКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализацияЧека_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения = Неопределено И НЕ РезультатВыполнения = КодВозвратаДиалога.Отмена Тогда
		Если РезультатВыполнения.Результат Тогда
			// Установить полученное значение номера чека реквизиту документа.
			Объект.НомерСменыККМ = РезультатВыполнения.НомерСмены;
			Объект.НомерЧекаККМ = РезультатВыполнения.НомерЧекаККМ;
			
			Объект.ЧекФискализирован = Истина;;
			Объект.Дата = МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса();
			Если Не ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
				Объект.НомерЧекаККМ = 1;
			КонецЕсли;
			
			Если РезультатВыполнения.ВерсияФФД = "1.0" Тогда
				ЗаполнитьТаблицуТоваровПоОснованиюНаСервере();
			КонецЕсли;
			
			ПараметрыЗаписи = Новый Структура("РежимЗаписи, РежимПроведения",
				РежимЗаписиДокумента.Проведение,
				РежимПроведенияДокумента.Оперативный);
			ЗаписьПослеПробития = Истина; // #15647
			
			Если ЗаписатьДокументНаСервере(ПараметрыЗаписи) Тогда
				//
			Иначе
				ТекстСообщения = НСтр("ru = 'Ошибка записи документа'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьЖурналаФискальныхОпераций(Команда)
	
	ФискальнаяОперацияДанныеЖурнала = Неопределено;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ФискальнаяОперацияДанныеЖурнала = ПотолкиКассыОнлайн.ДанныеЖурналаФискальныхОпераций(Объект.Ссылка);
	КонецЕсли;
	Если ФискальнаяОперацияДанныеЖурнала = Неопределено Тогда
		Сообщить("Документ не проведен, не пробит чек или отсутствует запись в журнале");
	Иначе
		ПотолкиКассыОнлайнКлиент.ОткрытьЗаписьЖурналаФискальныхОпераций(ЭтотОбъект, ФискальнаяОперацияДанныеЖурнала);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура РасчетСдачи(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КОплате", Объект.Сумма);
	ОписаниеОповещения = Новый ОписаниеОповещения("РасчетСдачиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаРасчетаСдачи", ПараметрыФормы, ЭтотОБъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетСдачиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Число") Тогда
		Если НЕ Объект.Сумма = Результат Тогда
			СтараяСуммаДокумента = Объект.Сумма;
			Объект.Сумма = Результат;
			Модифицированность = Истина;
			СуммаПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанные()
	
	Элементы.ГруппаКонтрагент.Видимость = Ложь;
	Элементы.ГруппаТекущийДолг.Видимость = Ложь;
	Элементы.ГруппаТекущийДолгПоЗаказу.Видимость = Ложь;
	Элементы.ГруппаСтоимостьЗаказовВРаботе.Видимость = Ложь;
	Элементы.ГруппаСотрудник.Видимость = Ложь;
	Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
	Элементы.ГруппаСуммыРаспределения.Видимость = Истина;	
	Элементы.ГруппаВыданныеАвансы.Видимость = Ложь;
	Элементы.РаспределениеПлатежаДатаПлатежаПоРассрочке.Видимость = Ложь;
	Элементы.ЗаполнитьОснованияПоРаспределению.Видимость = Истина;  
	Элементы.СуммаОсновногоТелаЗайма.Видимость = Ложь;  
	Элементы.СуммаПроцентовПоЗайму.Видимость = Ложь;  
	Элементы.РаспределениеПлатежаГруппаВозврат.Видимость = Ложь; //#7080
	Элементы.РаспределениеПлатежаГруппаОплата.Видимость = Ложь;  //#7080
	
	//#9708
	Элементы.СтатьяДоходовПоНачислению.Видимость = ПолучитьФункциональнуюОпцию("НекассовыйМетодВеденияУчетаДоходовРасходов") 
									И Объект.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.Прочее
									//++ №13755
									И ЗначениеЗаполнено(Объект.Ссылка)
									И НЕ (Объект.СтатьяДоходов = Объект.СтатьяДоходовПоНачислению);
									//-- №13755
									
	Элементы.СтатьяДоходов.Видимость = Истина; // #12545
	
	ДокументОснование = Неопределено;
	Если Объект.Основания.Количество() > 0 Тогда
		ДокументОснование = Объект.Основания[0].Основание;
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.Прочее Тогда
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь; 
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ПолучениеНаличныхИзБанка Тогда
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь; // #12545
		Элементы.СтатьяДоходов.Видимость = Ложь; // #12545
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя Тогда
		Элементы.РаспределениеПлатежаГруппаОплата.Видимость = Истина;  //#7080
		Элементы.РаспределениеПлатежаДатаПлатежаПоРассрочке.Видимость = Истина;
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Если Объект.Контрагент.Пустая() Тогда
			Элементы.ГруппаТекущийДолг.Видимость = Ложь;
			Элементы.ГруппаСтоимостьЗаказовВРаботе.Видимость = Ложь;
		Иначе
			Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьСтоимостьЗаказовВРаботе(Объект.Контрагент, Объект.Валюта, ТекущаяДатаСеанса()) +    //nva
				ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, ТекущаяДатаСеанса()); //Объект.Дата);//nva
			Элементы.ДекорацияСтоимостьЗаказовВРаботе.Заголовок = ПолучитьСтоимостьЗаказовВРаботе(Объект.Контрагент, Объект.Валюта, ТекущаяДатаСеанса()); //Объект.Дата);
			Элементы.ГруппаТекущийДолг.Видимость = Истина;
			//Если НЕ (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказДоговор")   // #12822 группа видима всегда
			//	или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Монтаж"))
			//Тогда
				Элементы.ГруппаСтоимостьЗаказовВРаботе.Видимость = Истина;
			//КонецЕсли;			
			// №7373 валюту показываем выбранную в текущем документе
			//ВалютаУчета = Константы.ВалютаУчета.Получить();
			Элементы.ДекорацияНадписьВалютаДолга1.Заголовок = Объект.Валюта; //ВалютаУчета;
			Элементы.ДекорацияНадписьВалютаДолга2.Заголовок = Объект.Валюта; //ВалютаУчета;
		КонецЕсли;
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказДоговор")
			или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
			Тогда
			
			Элементы.ГруппаТекущийДолгПоЗаказу.Видимость = Истина;
			// №7373 валюту показываем выбранную в текущем документе
			Элементы.ДекорацияНадписьВалютаДолга3.Заголовок = Объект.Валюта; //ВалютаУчета;
			Элементы.ДекорацияСуммаДолгаПоЗаказу.Заголовок = "0";
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасчетыПоЗаказамОстатки.СуммаОстаток
			|ИЗ
			|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ = &Заказ) КАК РасчетыПоЗаказамОстатки";
			Запрос.УстановитьПараметр("Заказ", ДокументОснование);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СуммаОстатокПоЗаказу = Выборка.СуммаОстаток;
				// №7373 если валюта текущего документа отличается от валюты заказа, показываем сумму в валюте текущего документа
				Если НЕ Объект.Валюта = ДокументОснование.Валюта Тогда
					СуммаОстатокПоЗаказу = Окр(РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ДокументОснование.Валюта, Объект.Валюта, ТекущаяДатаСеанса(), СуммаОстатокПоЗаказу), 2);
				КонецЕсли;	
				Элементы.ДекорацияСуммаДолгаПоЗаказу.Заголовок = СуммаОстатокПоЗаказу;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Монтаж") Тогда
			
			Элементы.ГруппаТекущийДолгПоЗаказу.Видимость = Истина;
			// №7373 валюту показываем выбранную в текущем документе
			Элементы.ДекорацияНадписьВалютаДолга3.Заголовок = Объект.Валюта; //ВалютаУчета;
			Элементы.ДекорацияСуммаДолгаПоЗаказу.Заголовок = "0";
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасчетыПоЗаказамОстатки.СуммаОстаток
			|ИЗ
			|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ = &Заказ) КАК РасчетыПоЗаказамОстатки";
			Запрос.УстановитьПараметр("Заказ", ДокументОснование);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Элементы.ДекорацияСуммаДолгаПоЗаказу.Заголовок = Выборка.СуммаОстаток;
			КонецЦикла;
			
		Иначе
			Элементы.ГруппаТекущийДолгПоЗаказу.Видимость = Ложь;
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПодотчетника Тогда
		Элементы.ГруппаСотрудник.Видимость = Истина;
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
		Элементы.ГруппаВыданныеАвансы.Видимость = Истина;
		
	//#7080
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПоставщика Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ГруппаТекущийДолг.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаВозврат.Видимость = Истина;  
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
		Элементы.ГруппаСуммыРаспределения.Видимость = Ложь;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьСтоимостьЗаказовВРаботе(Объект.Контрагент, Объект.Валюта, ТекущаяДатаСеанса()) +    //nva
			ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, ТекущаяДатаСеанса());
		
	//#4119
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ПолучениеКредита ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратЗайма Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ГруппаТекущийДолг.Видимость = Истина;
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
		Элементы.РаспределениеПлатежаГруппаВозврат.Видимость = Ложь;  
		Элементы.ГруппаСуммыРаспределения.Видимость = Ложь;
		Элементы.СтатьяДоходов.Видимость = Ложь;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьСтоимостьЗаказовВРаботе(Объект.Контрагент, Объект.Валюта, ТекущаяДатаСеанса()) +    //nva
			ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, ТекущаяДатаСеанса());
		Элементы.ЗаполнитьОснованияПоРаспределению.Видимость = Ложь;  
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратЗайма Тогда
		Элементы.СтатьяДоходов.Видимость = Истина;
		Элементы.СуммаОсновногоТелаЗайма.Видимость = Истина;  
		Элементы.СуммаПроцентовПоЗайму.Видимость = Истина;  
	КонецЕсли;
	
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию, , 36);
	
	СписокДокументовРаспределения = Объект.РаспределениеПлатежа.Выгрузить(,"Документ");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыПоЗаказамОстатки.СуммаОстаток КАК ОсталосьРаспределить,
	|	РасчетыПоЗаказамОстатки.Заказ КАК Заказ,
	|	РасчетыПоЗаказамОстатки.Заказ.СуммаДокумента КАК СуммаДокумента,
	|	РасчетыПоЗаказамОстатки.Заказ.Валюта КАК Валюта
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ В (&Заказ)) КАК РасчетыПоЗаказамОстатки";
	Запрос.УстановитьПараметр("Заказ", СписокДокументовРаспределения);
	ТаблицаПоДокументам = Запрос.Выполнить().Выгрузить();
	
	// №7373 нужно определить различие в валютах, чтобы корректно отображать определенные колонки и суммы
	ВалютаЗаказаРавнаВалютеДокумента = ФинансыСервер.ОпределитьРазличиеВалютыЗаказаИВалютыДокумента(Объект);
	
	Для Каждого СтрокаРаспределения Из Объект.РаспределениеПлатежа Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Заказ", СтрокаРаспределения.Документ);
		НайденныеСтроки = ТаблицаПоДокументам.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента Тогда 
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, НайденныеСтроки[0]);
			Иначе
				СтрокаРаспределения.ВалютаДокумента = НайденныеСтроки[0].Валюта; 
				СтрокаРаспределения.СуммаДокументаВВалютеДокумента = НайденныеСтроки[0].СуммаДокумента;
				СтрокаРаспределения.СуммаДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(НайденныеСтроки[0].Валюта, Объект.Валюта, Объект.Дата, НайденныеСтроки[0].СуммаДокумента);
				СтрокаРаспределения.ОсталосьРаспределить = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(НайденныеСтроки[0].Валюта, Объект.Валюта, Объект.Дата, НайденныеСтроки[0].ОсталосьРаспределить);
			КонецЕсли;
		Иначе
			Попытка
				Если Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента Тогда
					СтрокаРаспределения.СуммаДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
				Иначе
					СтрокаРаспределения.ВалютаДокумента = СтрокаРаспределения.Документ.Валюта; 
					СтрокаРаспределения.СуммаДокументаВВалютеДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
					СтрокаРаспределения.СуммаДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(СтрокаРаспределения.Документ.Валюта, Объект.Валюта, Объект.Дата, СтрокаРаспределения.Документ.СуммаДокумента);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ФинансыСервер.ОбновитьНадписиРаспеределениеПлатежа(ЭтаФорма, Объект, , ВалютаУчета, ВалютаЗаказаРавнаВалютеДокумента);
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	
	Если НЕ Объект.ВидОперации.Пустая() Тогда     	
		Объект.СтатьяДоходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, Объект.ВидОперации);
		Объект.СтатьяДоходовПоНачислению = Объект.СтатьяДоходов; //#9708
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопокРаспределения()
	Элементы.РаспределениеПлатежаРаспределение_ЗаказДоговор.Видимость 		 = Константы.ВестиРасчетыПоЗаказамПоЗаказДоговору.Получить();
	Элементы.ГруппаРаспределениеЗаказДоговор.Видимость = Элементы.РаспределениеПлатежаРаспределение_ЗаказДоговор.Видимость;
	
	Элементы.РаспределениеПлатежаРаспределение_СчетНаОплату.Видимость 		 = Константы.ВестиРасчетыПоЗаказамПоСчетуНаОплату.Получить();
	Элементы.ГруппаРаспределениеСчетНаОплату.Видимость = Элементы.РаспределениеПлатежаРаспределение_СчетНаОплату.Видимость;
	
	//НАЧАЛО: переход на 2.0
	//Элементы.РаспределениеПлатежаРаспределение_ЗаказНаПроизводство.Видимость = Константы.ВестиРасчетыПоЗаказамПоЗаказуНаПроизводство.Получить();
	//Элементы.ГруппаРаспределениеЗаказНаПроизводство.Видимость = Элементы.РаспределениеПлатежаРаспределение_ЗаказНаПроизводство.Видимость;
	//КОНЕЦ: переход на 2.0
	
	Элементы.РаспределениеПлатежаРаспределение_ЗаказПокупателя.Видимость	 = Константы.ВестиРасчетыПоЗаказамПоЗаказуПокупателя.Получить();
	Элементы.ГруппаРаспределениеЗаказПокупателя.Видимость = Элементы.РаспределениеПлатежаРаспределение_ЗаказПокупателя.Видимость;
	
	Элементы.РаспределениеПлатежаРаспределение_Реализация.Видимость 		 = Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить();
	Элементы.ГруппаРаспределенияРТИУ.Видимость = Элементы.РаспределениеПлатежаРаспределение_Реализация.Видимость;
	
	Элементы.РаспределениеПлатежаРаспределение_Монтаж.Видимость				 = Константы.ВестиРасчетыПоЗаказамПоМонтажу.Получить();
	Элементы.ГруппаРаспределениеМонтаж.Видимость = Элементы.РаспределениеПлатежаРаспределение_Монтаж.Видимость; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущийДолгКлиента(Знач Организация, Знач Контрагент, Знач Договор, Знач ВалютаДокумента, Знач ВалютаУчета, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			Договор = &Договор
	|				И Контрагент = &Контрагент
	|				И Организация = &Организация) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// №7373 сумму долга показываем в валюте текущего документа, если валюта отличается от валюты учета
		Сумма = Выборка.СуммаОстаток;
		Если НЕ ВалютаДокумента = ВалютаУчета Тогда
			Сумма = Окр(РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, ВалютаДокумента, Дата, Сумма), 2);
		КонецЕсли;	
		Возврат Сумма;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьЗаказовВРаботе(Знач Контрагент, Знач ВалютаДокумента, Дата)
	
	ТекущийСтатус = Новый СписокЗначений;
	ТекущийСтатус.Добавить(Справочники.СтатусыЗаказовПокупателей.ВРаботе);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗаказыПокупателей.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ЗаказыПокупателей.ЗаказНаПроизводство.Валюта КАК Валюта,
	//|	ЗаказыПокупателей.ЗаказНаПроизводство.ТекущийСтатус КАК ТекущийСтатус,
	//|	ЗаказыПокупателей.ЗаказНаПроизводство.СуммаДокумента КАК СуммаДокумента,
	//|	ЗаказыПокупателей.ЗаказНаПроизводство.Комментарий КАК Комментарий,
	|	ЗаказыПокупателей.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			&ТекущаяДата,
	|			ЗаказНаПроизводство.Контрагент = &Контрагент
	|				И ЗаказНаПроизводство.ТекущийСтатус В (&ТекущийСтатус)) КАК ЗаказыПокупателей";
	Запрос.УстановитьПараметр("ТекущаяДата",КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ТекущийСтатус",ТекущийСтатус);
	
	// №7373 сумму долга показываем в валюте текущего документа, если валюта отличается от валюты учета
	//ОжидаемаяСумма = Запрос.Выполнить().Выгрузить().Итог("СуммаДокумента");
	ОжидаемаяСумма = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПересчитаннаяСумма = Выборка.СуммаОстаток; //Выборка.СуммаДокумента;
		Если НЕ ВалютаДокумента = Выборка.Валюта Тогда
			ПересчитаннаяСумма = Окр(РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Выборка.Валюта, ВалютаДокумента, Дата, ПересчитаннаяСумма), 2);
		КонецЕсли;
		ОжидаемаяСумма = ОжидаемаяСумма + ПересчитаннаяСумма;
	КонецЦикла;	
	
	Возврат ОжидаемаяСумма;
	
КонецФункции

&НаСервере
Функция ПолучитьОстатокДолгаПоЗаказуНаСервере(ОбъектОснование)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ДокументОбъект.ПолучитьОстатокДолгаПоЗаказу(ОбъектОснование);
КонецФункции	

&НаСервере
Функция ЗаписатьДокументНаСервере(ПараметрыЗаписи)
	
	Попытка
		Результат = Записать(ПараметрыЗаписи);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось провести документ'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуТоваровПоОснованиюНаСервере()
	ТаблицаТоваров = Документы.ПриходныйКассовыйОрдер.ЗаполнитьТаблицуТоваровПоОснованию(Объект.Ссылка);
	Объект.Товары.Очистить();
	Для каждого СтрокаТЗ из ТаблицаТоваров Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатыОплатыПоДоговоруРассрочки(СсылкаНаЗаказ)
	
	Возврат ФинансыСервер.ПолучитьДатыОплатыПоДоговоруРассрочки(СсылкаНаЗаказ);
	
КонецФункции

&НаСервере
Процедура ДобавитьОснованиеЗаказаСервер(ОбъектОснование)
	ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ОбъектОснование, Объект.РаспределениеПлатежа, Объект.Сумма);
	//ДокументОбъект = РеквизитФормыВЗначение("Объект");
	//ДокументОбъект.ДобавитьОснованиеЗаказа(ОбъектОснование);
	//ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ДобавитьДокументыПродажиПоЗаказамСервер(ОбъектОснование)
	ФинансыСервер.ДобавитьДокументыПродажиПоЗаказам(Объект, ОбъектОснование);
КонецПроцедуры

&НаКлиенте
Процедура АвансыПодбор(Команда)
	
	АдресВыданныеАвансыВХранилище = ПоместитьВыданныеАвансыВХранилище();
	
	ПараметрыПодбора = Новый Структура(
		"АдресВыданныеАвансыВХранилище,
		|Организация,
		|Период,
		|Сотрудник,
		|Валюта,
		|Ссылка",
		АдресВыданныеАвансыВХранилище,
		Объект.Организация,
		Объект.Дата,
		Объект.Сотрудник,
		Объект.Валюта,
		Объект.Ссылка
	);
	
	Результат = Неопределено;	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАвансовПодотчетнику", ПараметрыПодбора,,,,, 
		Новый ОписаниеОповещения("АвансыПодборЗавершение", ЭтотОбъект, Новый Структура("АдресВыданныеАвансыВХранилище", АдресВыданныеАвансыВХранилище)));
		
КонецПроцедуры
	
	// Функция помещает табличную часть ВыданныеАвансы во временное хранилище
// и возвращает адрес
//
&НаСервере
Функция ПоместитьВыданныеАвансыВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.ВыданныеАвансы.Выгрузить(,
			"Документ,
			|Сумма"
		),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьВыданныеАвансыВХранилище()

&НаКлиенте
Процедура АвансыПодборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	АдресВыданныеАвансыВХранилище = ДополнительныеПараметры.АдресВыданныеАвансыВХранилище;
	
	Если Результат = КодВозвратаДиалога.OK Тогда
		ПолучитьВыданныеАвансыИзХранилища(АдресВыданныеАвансыВХранилище);	
	КонецЕсли;

КонецПроцедуры // АвансыПодбор()

// Функция получает табличную часть ВыданныеАвансы из временного хранилища.
//
&НаСервере
Процедура ПолучитьВыданныеАвансыИзХранилища(АдресВыданныеАвансыВХранилище)
	
	ТаблицаВыданныеАвансы = ПолучитьИзВременногоХранилища(АдресВыданныеАвансыВХранилище);
	Объект.ВыданныеАвансы.Очистить();
	Для каждого СтрокаВыданныеАвансы Из ТаблицаВыданныеАвансы Цикл
		Строка = Объект.ВыданныеАвансы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаВыданныеАвансы);
	КонецЦикла;
	
КонецПроцедуры // ПолучитВыданныеАвансыИзХранилища()

&НаСервере
Процедура ОбновитьНадписиРаспеределениеПлатежаНаСервере(ВалютаЗаказаРавнаВалютеДокумента)
	
	ФинансыСервер.ОбновитьНадписиРаспеределениеПлатежа(ЭтаФорма, Объект, , ВалютаУчета, ВалютаЗаказаРавнаВалютеДокумента);
	
КонецПроцедуры	

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщийМодульКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	ДополнительныеПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
	
	Отказ = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.НачислятьБонусы 
		И НЕ мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте Тогда
		
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеБонусовПодтверждениеПередЗаписью", ЭтотОбъект, ДополнительныеПараметры);
		БонусыКлиент.ПодтвердитьИзменениеСуммыБонусов(ОписаниеОповещения, Объект.СуммаБонусовКНачислениюПоДисконтнойКарте, мСуммаБонусов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеБонусовПодтверждениеПередЗаписью(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗаписи,, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизации(ТолькоИзменениеФормы = Ложь)
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
	Элементы.ГруппаНДС.Видимость = УчитыватьНДС;
	
	Если НЕ ТолькоИзменениеФормы Тогда
		Объект.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);	
		ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ОбновитьВидимостьГруппыБонусов()
	
	Элементы.ГруппаБонусыТекущиеДанные.Видимость = Объект.НачислятьБонусы И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя"));
	Элементы.ДисконтнаяКарта.Видимость = Объект.НачислятьБонусы И Объект.СлужебныйУчетБонусовПоДисконтнымКартам;
		
КонецПроцедуры

&НаСервере
Процедура ПересчитатьБонусыПоДокументу()
	
	Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = 0;
	Если Объект.НачислятьБонусы Тогда		
		//Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = БонусыСервер.ПолучитьСуммуБонусовКНачислениюПоДокументуОплаты(Объект.Дата, Объект.Организация, Объект.Контрагент.Категория, Объект.Касса, Объект.Сумма, Объект.Ссылка, Объект.ДисконтнаяКарта, Объект.СлужебныйУчетБонусовПоДисконтнымКартам); 
		СтруктураБонусов = БонусыСервер.ПолучитьСуммуБонусовКНачислениюПоДокументуОплаты(Объект.Дата, Объект.Организация, Объект.КатегорияКонтрагента, Объект.Касса, Объект.Сумма, Объект.Ссылка, Объект.ДисконтнаяКарта, Объект.СлужебныйУчетБонусовПоДисконтнымКартам);
		Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = СтруктураБонусов.СуммаБонусов;
		Объект.ДокументНАНБ = СтруктураБонусов.ДокументНАНБ;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДисконтнаяКартаПриИзменении(Элемент)
	ПересчитатьБонусыПоДокументу();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОснованияПоРаспределениюКоманда(Команда)
	
	Если Объект.Основания.Количество() > 0 Тогда
		ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОбОчищенииТаблицыОснования", ЭтотОбъект), "Табличная часть основания будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьОснованияПоРаспределению();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчищенииТаблицыОснования(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Основания.Очистить();
		ЗаполнитьОснованияПоРаспределению();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОснованияПоРаспределению()
	
	ОбработкаТабличныхЧастейСервер.ЗаполнитьОснованияПоРаспределению(Объект.Основания, Объект.РаспределениеПлатежа);
		
КонецПроцедуры

&НаКлиенте
Процедура СуммаОсновногоТелаЗаймаПриИзменении(Элемент)
	Если Объект.Сумма > 0 И Объект.Сумма > Объект.СуммаОсновногоТелаЗайма Тогда
		Объект.СуммаПроцентовПоЗайму = Объект.Сумма - Объект.СуммаОсновногоТелаЗайма;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаПроцентовПоЗаймуПриИзменении(Элемент)
	Если Объект.Сумма > 0 И Объект.Сумма > Объект.СуммаПроцентовПоЗайму Тогда
		 Объект.СуммаОсновногоТелаЗайма = Объект.Сумма - Объект.СуммаПроцентовПоЗайму;
	КонецЕсли;
КонецПроцедуры

//nva+++
&НаКлиенте
Процедура Распределение_ПоНеоплаченнымЗаказам(Команда)
	
	ТЗДолгиПоЗаказам = ПолучитьДолгиПоКонтрагентуПоЗазамСервер(Объект.Контрагент, Объект.Сумма);       
	
	Если ТЗДолгиПоЗаказам <> Неопределено И ТЗДолгиПоЗаказам.Количество() > 0 Тогда
		
		Объект.РаспределениеПлатежа.Очистить();
		РаспределениеПлатежаОбработкаВыбора(Элементы.РаспределениеПлатежаПоНеоплаченнымЗаказам, ТЗДолгиПоЗаказам, Истина);
	
		ДополнительныеПараметры = Неопределено;
		ОписаниеОповещенияОбновитьДанные = Новый ОписаниеОповещения("ОписаниеОповещенияОбновитьДанные", ЭтотОбъект);
		ФинансыКлиент.РаспределениеОплаты(ЭтаФорма, "РаспределениеПлатежа", СтрокиРаспределенияПлатежей(), Объект.Сумма, ОписаниеОповещенияОбновитьДанные, ДополнительныеПараметры);
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьДолгиПоКонтрагентуПоЗазамСервер(Контрагент, СуммаПлатежа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПокупателя.Ссылка КАК Документ,
		|	РасчетыПоЗаказамОстатки.СуммаОстаток КАК КОплате,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Оплачен,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) > 0
		|				И ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) < ЗаказПокупателя.СуммаДокумента
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЧастичноОплачен
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
		|		ПО ЗаказПокупателя.Ссылка = РасчетыПоЗаказамОстатки.Заказ
		|ГДЕ
		|	ЗаказПокупателя.Контрагент = &Контрагент
		|	И ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	
	
	Запрос.Параметры.Вставить("Контрагент", Контрагент);
	ТЗОстаткиПоДолгам = Запрос.Выполнить().Выгрузить();
	
	Если ТЗОстаткиПоДолгам.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОстатокОтСуммыПлатежа = СуммаПлатежа;
	ТЗОстаткиПоДолгам.Колонки.Добавить("Сумма");
	Для Каждого СтрокаДолга Из ТЗОстаткиПоДолгам Цикл
		Если СтрокаДолга.КОплате > ОстатокОтСуммыПлатежа Тогда
			СтрокаДолга.Сумма = ОстатокОтСуммыПлатежа;
		Иначе
			СтрокаДолга.Сумма = СтрокаДолга.КОплате;
		КонецЕсли;
		
		ОстатокОтСуммыПлатежа = ОстатокОтСуммыПлатежа - СтрокаДолга.Сумма;
	КонецЦикла;	
	
	//Нам нужны только строки с заполненной суммой
	ИтоговаяТз = ТЗОстаткиПоДолгам.СкопироватьКолонки();
	Для Каждого СтрокаТЗДолги Из ТЗОстаткиПоДолгам Цикл           
		Если СтрокаТЗДолги.Сумма > 0 Тогда
			СтрокаИтоговойТЗ = ИтоговаяТз.Добавить();                 
			ЗаполнитьЗначенияСвойств(СтрокаИтоговойТЗ, СтрокаТЗДолги);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ИтоговаяТз.ВыгрузитьКолонку("Документ");
	
КонецФункции	

//nva---









