
#Область Сервер

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ВестиФППоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	РазделятьНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	Если НЕ Параметры      = Неопределено Тогда
		ЭтоТолстыйКлиент   = Параметры.ЭтоТолстыйКлиент;
		Если ЭтоТолстыйКлиент Тогда
			ИА_ЗаказыНаПриобретение.Загрузить(Параметры.ИА_ЗаказыНаПриобретение);
		Иначе
			АдресХранилища = Параметры.АдресХранилища;  
			Попытка
				ТЗ = ПолучитьИзВременногоХранилища(АдресХранилища);
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "ОШИБКА: " + ОписаниеОшибки();
				Сообщение.УстановитьДанные(ЭтаФорма); 
				Сообщение.Сообщить(); 
				Отказ = Истина;  
				Возврат;
			КонецПопытки; 
			ТЗ.Колонки.Добавить("Остаток"); 
			Массив = ТЗ.ВыгрузитьКолонку("Сумма"); 
			ТЗ.ЗагрузитьКолонку(Массив, "Остаток");
			ИА_ЗаказыНаПриобретение.Загрузить(ТЗ);
		КонецЕсли;
		//ЭтоНал = Параметры.ЭтоНал;
		Организация = Параметры.Организация;
		ОбновитьСписокЗаявок();
	КонецЕсли; 	
	
	//ИА_ФП.ВидимостьЭлементовФормыНастройкиОрганизаций(ЭтаФорма);
	
	ВидимостьЭлементовФорм();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЗаявок()
	МассивОрганизаций = ИА_ФП.ПолучитьСписокОрганизацийГК(Организация);

	СписокЗаявок.Параметры.УстановитьЗначениеПараметра("ВестиФППоОрганизациям", ВестиФППоОрганизациям);
	СписокЗаявок.Параметры.УстановитьЗначениеПараметра("МассивОрганизаций", МассивОрганизаций);
	СписокЗаявок.Параметры.УстановитьЗначениеПараметра("СписокВыбранных", ИА_ЗаказыНаПриобретение.Выгрузить().ВыгрузитьКолонку("ЗП"));

КонецПроцедуры

&НаСервере
Процедура СписокЗаявокВыборНаСервере(Данные)
	Стр = ЭтаФорма.ИА_ЗаказыНаПриобретение.Добавить(); 
	ЗаполнитьЗначенияСвойств(Стр,Данные); 
	Стр.Остаток = Стр.Сумма; 
	ОбновитьСписокЗаявок();
КонецПроцедуры

&НаСервере
Функция ПеренестиВДокументНаСервере()
	Парам = Новый Структура; Парам.Очистить();
	Парам.Вставить("АдресХранилища",   АдресХранилища);
	Парам.Вставить("ЭтоФонды",         Ложь);        
	ТЗ    = ИА_ЗаказыНаПриобретение.Выгрузить().Скопировать();
	Если ЭтоТолстыйКлиент Тогда
		Парам.Вставить("ИА_ЗаказыНаПриобретение", Новый ТаблицаЗначений);
		Парам.ИА_ЗаказыНаПриобретение = ТЗ; 
	Иначе
		АдресХранилища = ПоместитьВоВременноеХранилище(ТЗ, ЭтаФорма.УникальныйИдентификатор); 
		Парам.Вставить("АдресХранилища",   АдресХранилища);
	КонецЕсли;
	Возврат Парам;
КонецФункции

&НаСервере
Процедура ВидимостьЭлементовФорм()
	
	РазделятьНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	ИспользоватьВидДССправочно = Константы.ИА_ФП_ИспользоватьВидДССправочно.Получить();
	испПодр = константы.КСУ_ФП_ИспользоватьПодразделения.Получить();

	Если РазделятьНалБезнал Тогда
		
		Элементы.ВидДС.Видимость = Истина;
		Элементы.ВидДССправочно.Видимость = ложь;
		
	Иначе	
		
		Элементы.ВидДС.Видимость = Ложь;
		Элементы.ВидДССправочно.Видимость = ИспользоватьВидДССправочно;
		
	КонецЕсли;
	
	Элементы.Подразделение.Видимость = испПодр;

КонецПроцедуры

#КонецОбласти 

#Область КлиентскийБлок

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Парам = ПеренестиВДокументНаСервере();
	ЭтаФорма.ВладелецФормы.ОбработкаПодбораЗаказовФондов(Парам); 
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаявокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Данные = Элементы.СписокЗаявок.ТекущиеДанные;   
	Если НЕ Данные = Неопределено Тогда 
		СписокЗаявокВыборНаСервере(Данные); 
	КонецЕсли; 		
КонецПроцедуры

&НаКлиенте
Процедура ИА_ЗаказыНаПриобретениеСуммаПриИзменении(Элемент)
	Данные = Элементы.ИА_ЗаказыНаПриобретение.ТекущиеДанные;
	Если НЕ Данные = Неопределено Тогда
		Если (Данные.Остаток < Данные.Сумма)  Тогда
			Сообщить("Введена сумма больше доступной к выплате!");
			Данные.Сумма = Данные.Остаток;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИА_ЗаказыНаПриобретениеПослеУдаления(Элемент)
	ОбновитьСписокЗаявок();	
КонецПроцедуры

&НаКлиенте
Процедура ИА_ЗаказыНаПриобретениеОстатокПриИзменении(Элемент)
	
КонецПроцедуры

#КонецОбласти 