
&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	Если ПолучитьКоличествоСтраницВОтчете() = 0 Тогда
		ПоказатьОповещениеПользователя("Сначала необходимо сформировать отчет");
		Возврат;
	КонецЕсли;
		
	Если Вопрос("Создать новое электронное письмо?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		СсылкаНаЭлектронноеПисьмо = СформироватьЭлектронноеПисьмоСОтчетом();
		
		Парам = Новый Структура("Ключ",СсылкаНаЭлектронноеПисьмо);
		ОткрытьФорму("Документ.ЭлектронноеПисьмо.ФормаОбъекта",Парам);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоСтраницВОтчете()
	Возврат Результат.КоличествоСтраниц();
КонецФункции

&НаСервере
Функция СформироватьЭлектронноеПисьмоСОтчетом()
	Возврат РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмоСОтчетом(Результат, "Остатки пленки", , "pdf");	
КонецФункции