&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметр(Элементы, Имя, Значение)
    Эл = Элементы.Найти(Имя);
    Если Эл <> Неопределено Тогда
        Эл.Значение = Значение;
        Эл.Использование = Истина;
    КонецЕсли; 
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписи(Отбор)
    МЗ = РегистрыСведений.ИА_НастройкиЗначения.СоздатьМенеджерЗаписи();
    ЗаполнитьЗначенияСвойств(МЗ, Отбор);
    МЗ.Записать();    
    
    Результат = РегистрыСведений.ИА_НастройкиЗначения.СоздатьКлючЗаписи(Отбор);    
    Возврат Результат;
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Параметры.Свойство("Пользователь") Тогда
        Пользователь = Параметры.Пользователь;
    КонецЕсли;
    
    УстановитьПараметр(Таблица.Параметры.Элементы, "Пользователь", Пользователь);
КонецПроцедуры

&НаКлиенте
Процедура Перечитать(Команда)
    Элементы.Таблица.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
    УстановитьПараметр(Таблица.Параметры.Элементы, "Пользователь", Пользователь);
    Элементы.Таблица.Обновить();
    УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
    Элементы.Таблица.Доступность = ЗначениеЗаполнено(Пользователь);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ИмяСобытия="ЗначениеНастройкиИзменено"
        И Параметр = Пользователь
        Тогда
        Элементы.Таблица.Обновить();   	
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    
    ТекСтрока = Элемент.ТекущиеДанные;
    Если ТекСтрока <> Неопределено
        И НЕ ТекСтрока.ЭтоГруппа
        Тогда
        ТипЗнач = ТекСтрока.ТипЗначения;
        ВыбЗнач = ТекСтрока.Значение;
        
        Отбор = Новый Структура("Пользователь, Настройка, Значение"
        , Пользователь, ТекСтрока.Настройка, ТекСтрока.Значение);
        
        КлючЗаписи =  ПолучитьКлючЗаписи(Отбор);
        П = Новый Структура("Ключ, ТолькоВвод", КлючЗаписи, Истина); 
        ОткрытьФорму("РегистрСведений.ИА_НастройкиЗначения.ФормаЗаписи", П);
    КонецЕсли; 
КонецПроцедуры
