#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработкаСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	Валюта = Константы.ВалютаУчета.Получить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Валюта.Пустая() Тогда
		Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	
	//#11866
	ОбщийМодульСервер.ПроверитьПересечениеИнтерваловВЦенахНаУслугиПроизводства(ЭтотОбъект, Метаданные.Документы.УстановкаИндивидуальныхЦенНаУслугиПроизводства, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СоответствиеИндивидуальныхЦенЦенамУслугРаскроя
	Движения.СоответствиеИндивидуальныхЦенЦенамУслугРаскроя.Записывать = Истина;
	Движение = Движения.СоответствиеИндивидуальныхЦенЦенамУслугРаскроя.Добавить();
	Движение.Период 					= Дата;
	Движение.Валюта 					= Валюта;
	Движение.ВидНоменклатуры 			= ВидНоменклатуры;
	Движение.Контрагент 				= Контрагент;
	Движение.ДоговорКонтрагента 		= ДоговорКонтрагента;
	Движение.Документ 					= Ссылка;
	Движение.ВидЦеныНаУслугиПроизводства= ВидЦеныНаУслугиПроизводства;
	Движение.Отменена					= (ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена);		
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
	