&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаДобавитьИзКлассификатора.Доступность = ПравоДоступа("Добавление", Метаданные.Справочники.Города);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзКлассификатора(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИзКлассификатораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.Города.Форма.ФормаДобавленияИзКлассификатора", , , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзКлассификатораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) ТОгда
		Возврат;
	КонецЕсли;
	
	ДобавитьИзКлассификатораСервер(Результат);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ДобавитьИзКлассификатораСервер(МассивГородов)
	
	Справочники.Города.ДобавитьИзКлассификатора(МассивГородов);

КонецФункции
