
&НаСервере
Функция СформироватьНаСервере()
	
	Таб = Новый ТабличныйДокумент;
	Таб.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетДетализацияВыпусковПродукции";
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = ЭтотОтчет.ПолучитьМакет("Макет");
	
	Таб.ФиксацияСверху = 4;
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.НачалоПериода = Формат(Отчет.НачалоПериода,"ДЛФ=Д");
	ОбластьМакета.Параметры.КонецПериода = Формат(Отчет.КонецПериода,"ДЛФ=Д");
	Таб.Вывести(ОбластьМакета);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыпускПродукции.Ссылка,
	|	ВыпускПродукции.ПродукцияНоменклатура КАК Продукция,
	|	ЕСТЬNULL(ВыпускПродукции.ПродукцияНоменклатура.Потолок_КоличествоГарпун,0) КАК КоличествоГарпун,
	|	ВыпускПродукции.Материалы.(
	|		Номенклатура,
	|		Количество КАК РаскройКоличество,
	|		КоличествоКВыработке КАК РаскройВыработка,
	|		Коэффициент
	|	) КАК Материалы,
	|	ВыпускПродукции.Основание КАК ЗаказНаПроизводство,
	|	ВыпускПродукции.Основание.УДАЛИТЬ_ВидЦенНаУслугиРаскроя.Углы.(
	|		Номенклатура КАК Услуга
	|	) КАК УслугиУглы,
	|	ВыпускПродукции.Основание.УДАЛИТЬ_ВидЦенНаУслугиРаскроя.ВырезыApply.(
	|		Номенклатура КАК Услуга
	|	) КАК УслугиВырезыApply,
	|	ВыпускПродукции.Основание.УДАЛИТЬ_ВидЦенНаУслугиРаскроя.Фотопечать.(
	|		Номенклатура КАК Услуга
	|	) КАК УслугиФотопечать,
	|	ВыпускПродукции.Основание.УДАЛИТЬ_ВидЦенНаУслугиРаскроя.ДлинаШвов.(
	|		Номенклатура КАК Услуга
	|	) КАК УслугиДлинаШвов,
	|	ВыпускПродукции.Основание.УДАЛИТЬ_ВидЦенНаУслугиРаскроя.ДлинаПользовательскихШвов.(
	|		Номенклатура КАК Услуга
	|	) КАК УслугиДлинаПользовательскихШвов,
	|	ВыпускПродукции.Основание.УДАЛИТЬ_ВидЦенНаУслугиРаскроя.ВнутренниеВырезы.(
	|		Номенклатура КАК Услуга
	|	) КАК УслугиВнутренниеВырезы,
	|	ВыпускПродукции.Основание.УДАЛИТЬ_ВидЦенНаУслугиРаскроя.Кривые.(
	|		Номенклатура КАК Услуга
	|	) КАК УслугиКривые,
	|	ВыпускПродукции.Основание.Услуги.(
	|		Номенклатура,
	|		Количество
	|	) КАК Услуги
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Проведен
	|	И ВыпускПродукции.Дата >= &ДатаНачала
	|	И ВыпускПродукции.Дата <= &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Отчет.КонецПериода));
	
	РаскройКоличествоИтог = 0;
	РаскройВыработкаИтог = 0;
	УглыИтог = 0;
	КриволинейныйУчастокИтог = 0;
	ПрямолинейныеШвыИтог = 0;
	КриволинейныеШвыИтог = 0;
	ФотопечатьИтог = 0;
	ГарпунИтог = 0;
	НомерСтроки = 1;	
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Продукция = Выборка.Продукция;
		ОбластьМакета.Параметры.Ссылка = Выборка.Ссылка;
		ОбластьМакета.Параметры.Гарпун = Выборка.КоличествоГарпун;
		ГарпунИтог = ГарпунИтог + Выборка.КоличествоГарпун;
		
		Раскрой = 0;
		Углы = 0;
		КриволинейныйУчасток = 0;
		ПрямолинейныеШвы = 0;
		КриволинейныеШвы = 0;
		Фотопечать = 0;
		
		РаскройКоличество = 0;
		РаскройВыработка = 0;
		
		Материал = Выборка.Материалы.Выбрать();
		Пока Материал.Следующий() Цикл
			
			Если Материал.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
				РаскройКоличество = РаскройКоличество + Материал.РаскройКоличество * Материал.Коэффициент;
				РаскройВыработка = РаскройВыработка + Материал.РаскройВыработка;
			КонецЕсли;
			
		КонецЦикла;
		
		ТаблицаУглы 					= Выборка.УслугиУглы.Выгрузить();
		ТаблицаКриволинейныйУчасток 	= Выборка.УслугиКривые.Выгрузить();
		ТаблицаПрямолинейныеШвы 		= Выборка.УслугиДлинаШвов.Выгрузить();
		ТаблицаКриволинейныеШвы 		= Выборка.УслугиДлинаПользовательскихШвов.Выгрузить();
		ТаблицаФотопечать 				= Выборка.УслугиФотопечать.Выгрузить();
		
		Услуги = Выборка.Услуги.Выбрать();
		Пока Услуги.Следующий() Цикл
			
			Если НЕ ТаблицаУглы.Найти(Услуги.Номенклатура,"Услуга") = Неопределено Тогда
				Углы = Углы + Услуги.Количество;
			КонецЕсли;
			Если НЕ ТаблицаКриволинейныйУчасток.Найти(Услуги.Номенклатура,"Услуга") = Неопределено Тогда
				КриволинейныйУчасток = КриволинейныйУчасток + Услуги.Количество;
			КонецЕсли;
			Если НЕ ТаблицаПрямолинейныеШвы.Найти(Услуги.Номенклатура,"Услуга") = Неопределено Тогда
				ПрямолинейныеШвы = ПрямолинейныеШвы + Услуги.Количество;
			КонецЕсли;
			Если НЕ ТаблицаКриволинейныеШвы.Найти(Услуги.Номенклатура,"Услуга") = Неопределено Тогда
				КриволинейныеШвы = КриволинейныеШвы + Услуги.Количество;
			КонецЕсли;
			Если НЕ ТаблицаФотопечать.Найти(Услуги.Номенклатура,"Услуга") = Неопределено Тогда
				Фотопечать = Фотопечать + Услуги.Количество;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Углы >= 4 Тогда
			Углы = Углы - 4;
		КонецЕсли;
		
		ОбластьМакета.Параметры.РаскройКоличество = РаскройКоличество;		
		ОбластьМакета.Параметры.РаскройВыработка = РаскройВыработка;
		ОбластьМакета.Параметры.Углы = Углы;
		ОбластьМакета.Параметры.КриволинейныйУчасток = КриволинейныйУчасток;
		ОбластьМакета.Параметры.ПрямолинейныеШвы = ПрямолинейныеШвы;
		ОбластьМакета.Параметры.КриволинейныеШвы = КриволинейныеШвы;
		ОбластьМакета.Параметры.Фотопечать = Фотопечать;
		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
		
		РаскройКоличествоИтог = РаскройКоличествоИтог + РаскройКоличество;
		РаскройВыработкаИтог = РаскройВыработкаИтог + РаскройВыработка;
		УглыИтог = УглыИтог + Углы;
		КриволинейныйУчастокИтог = КриволинейныйУчастокИтог + КриволинейныйУчасток;
		ПрямолинейныеШвыИтог = ПрямолинейныеШвыИтог + ПрямолинейныеШвы;
		КриволинейныеШвыИтог = КриволинейныеШвыИтог + КриволинейныеШвы;
		ФотопечатьИтог = ФотопечатьИтог + Фотопечать;
		НомерСтроки = НомерСтроки + 1;
		
		
		Таб.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итог");
	ОбластьМакета.Параметры.РаскройКоличествоИтог = РаскройКоличествоИтог;
	ОбластьМакета.Параметры.РаскройВыработкаИтог = РаскройВыработкаИтог;
	ОбластьМакета.Параметры.УглыИтог = УглыИтог;
	ОбластьМакета.Параметры.КриволинейныйУчастокИтог = КриволинейныйУчастокИтог;
	ОбластьМакета.Параметры.ПрямолинейныеШвыИтог = ПрямолинейныеШвыИтог;
	ОбластьМакета.Параметры.КриволинейныеШвыИтог = КриволинейныеШвыИтог;
	ОбластьМакета.Параметры.ФотопечатьИтог = ФотопечатьИтог;
	ОбластьМакета.Параметры.ГарпунИтог = ГарпунИтог;
	Таб.Вывести(ОбластьМакета);
		
	Возврат Таб;
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Если Отчет.НачалоПериода = Дата(1,1,1) Тогда
		Отчет.НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	Если Отчет.КонецПериода = Дата(1,1,1) Тогда
		Отчет.КонецПериода = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	Результат = СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	Отчет.КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
КонецПроцедуры
