&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	ЗаполнитьДеревоСтатей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьГруппировкуПоТипамСтатей();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НастройкиСтатейДоходовРасходовПоУмолчанию" Тогда
		ДеревоСтатейПриАктивизацииСтрокиОбработчикОжидания();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСтатейТипСтатьи");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСтатей.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСтатейТипДокумента");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСтатей.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОрганизацийОрганизация");
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОрганизацийПодразделение");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОрганизаций.ПерваяСтрока");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "(для всех)");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
	//Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОрганизацийОрганизация");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОрганизаций.Организация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "(для всех)");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОрганизацийПодразделение");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОрганизаций.Подразделение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "(для всех)");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоСтатей()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиСтатейДоходовРасходовПоУмолчанию.ТипДокумента КАК ТипДокумента,
	|	ВЫБОР
	|		КОГДА НастройкиСтатейДоходовРасходовПоУмолчанию.ВидОперации = ""Доход""
	|				ИЛИ НастройкиСтатейДоходовРасходовПоУмолчанию.ВидОперации = ""Расход""
	|			ТОГДА НастройкиСтатейДоходовРасходовПоУмолчанию.ВидОперации
	|		КОГДА НастройкиСтатейДоходовРасходовПоУмолчанию.ВидОперации.Ссылка ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НастройкиСтатейДоходовРасходовПоУмолчанию.ВидОперации
	|	КОНЕЦ КАК ВидОперации,
	|	НастройкиСтатейДоходовРасходовПоУмолчанию.ТипСтатьи КАК ТипСтатьи,
	|	1 КАК Уровень
	|ИЗ
	|	РегистрСведений.НастройкиСтатейДоходовРасходовПоУмолчанию КАК НастройкиСтатейДоходовРасходовПоУмолчанию
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипСтатьи,
	|	ТипДокумента,
	|	ВидОперации
	|ИТОГИ
	|	СУММА(Уровень)
	|ПО
	|	ТипСтатьи";
	
	мДеревоСтатей = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(мДеревоСтатей, "ДеревоСтатей");
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТипыДокументовИВидыОперацииПоУмолчанию(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Новый Структура());	
 
    ПоказатьВопрос(Оповещение,
		"Выполнить заполнение? Имеющиеся записи не будут затронуты",
        РежимДиалогаВопрос.ДаНет); 	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Новый Структура("Перезаполнить", Истина));	
 
    ПоказатьВопрос(Оповещение,
        "Текущие настройки будут утеряны. Продолжить?",
        РежимДиалогаВопрос.ДаНет);    
 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
    	ЗаполнитьНастройкиПоУмолчанию(ДополнительныеПараметры.Свойство("Перезаполнить"));    
	КонецЕсли;
	
	ЗаполнитьДеревоСтатей();
	ДеревоСтатейПриАктивизацииСтрокиОбработчикОжидания();
	
	//Элементы.Список.Обновить();
 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию(Перезаполнить)

	РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.ЗаполнитьНастройкиПоУмолчанию(Перезаполнить);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПоТипамСтатей(Команда)
	УстановитьГруппировкуПоТипамСтатей();	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГруппировкуПоТипамСтатей()
	
	Элементы.ФормаГруппировкаПоТипамСтатей.Пометка = НЕ Элементы.ФормаГруппировкаПоТипамСтатей.Пометка;
	
	Для Каждого ЭлементГруппировки Из Список.Группировка.Элементы Цикл
		Если ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("ТипСтатьи")  Тогда
			Список.Группировка.Элементы.Удалить(ЭлементГруппировки);
		КонецЕсли;
	КонецЦикла;
	
	Если Элементы.ФормаГруппировкаПоТипамСтатей.Пометка Тогда		
		ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("ТипСтатьи"); 	
		ЭлементГруппировки.Использование = Истина; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСтатейПриАктивизацииСтроки(Элемент)
		ПодключитьОбработчикОжидания("ДеревоСтатейПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСтатейПриАктивизацииСтрокиОбработчикОжидания()
	
	ТаблицаОрганизаций.Очистить();
	ТекущиеДанные = Элементы.ДеревоСтатей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.Уровень > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияПоОрганизациям = ПолучитьИнформациюПоОрганизациям(ТекущиеДанные.ТипДокумента, ТекущиеДанные.ВидОперации, ТекущиеДанные.ТипСтатьи);
	
	Для каждого СтрокаТЗ из ИнформацияПоОрганизациям Цикл
		НоваяСтрока = ТаблицаОрганизаций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюПоОрганизациям(ТипДокумента, ВидОперации, ТипСтатьи)
	
	Результат = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСтатейДоходовРасходовПоУмолчанию.Организация КАК Организация,
	|	НастройкиСтатейДоходовРасходовПоУмолчанию.Подразделение КАК Подразделение,
	|	НастройкиСтатейДоходовРасходовПоУмолчанию.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	НастройкиСтатейДоходовРасходовПоУмолчанию.СтатьяДоходовРасходовПоУмолчанию КАК СтатьяДоходовРасходовПоУмолчанию,
	|	ВЫБОР
	|		КОГДА НастройкиСтатейДоходовРасходовПоУмолчанию.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				И НастройкиСтатейДоходовРасходовПоУмолчанию.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПерваяСтрока
	|ИЗ
	|	РегистрСведений.НастройкиСтатейДоходовРасходовПоУмолчанию КАК НастройкиСтатейДоходовРасходовПоУмолчанию
	|ГДЕ
	|	НастройкиСтатейДоходовРасходовПоУмолчанию.ТипДокумента = &ТипДокумента
	|	И (НастройкиСтатейДоходовРасходовПоУмолчанию.ВидОперации = &ВидОперации ИЛИ &ВидОперации = НЕОПРЕДЕЛЕНО)
	|	И НастройкиСтатейДоходовРасходовПоУмолчанию.ТипСтатьи = &ТипСтатьи
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиСтатейДоходовРасходовПоУмолчанию.Организация";
	
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	Запрос.УстановитьПараметр("ТипСтатьи", ТипСтатьи);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Новый Структура("Организация, Подразделение, СтатьяДоходовРасходовПоУмолчанию, СтатьяДоходовРасходов, ПерваяСтрока", 
			Выборка.Организация, Выборка.Подразделение, Выборка.СтатьяДоходовРасходовПоУмолчанию, Выборка.СтатьяДоходовРасходов, Выборка.ПерваяСтрока));	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаОрганизацийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ДеревоСтатей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ТекущиеДанные.Уровень = 1 Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураКлючаРегистра = Новый Структура("Организация, Подразделение, ТипДокумента, ВидОперации, ТипСтатьи");	
	ЗаполнитьЗначенияСвойств(СтруктураКлючаРегистра, ТекущиеДанные, "ТипДокумента, ВидОперации, ТипСтатьи");

	ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаОрганизацийПередНачаломДобавленияЗавершение", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения, ПерваяСтрока", СтруктураКлючаРегистра, Ложь), , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОрганизацийПередНачаломДобавленияЗавершение(Резуллтат, ДополнительныеПараметры) Экспорт
	ДеревоСтатейПриАктивизацииСтрокиОбработчикОжидания();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтруктураКлючаРегистра = Новый Структура("Организация, Подразделение, ТипДокумента, ВидОперации, ТипСтатьи");
	ЗаполнитьЗначенияСвойств(СтруктураКлючаРегистра, Элемент.ТекущиеДанные, "Организация, Подразделение");
	ПерваяСтрока = Элемент.ТекущиеДанные.ПерваяСтрока;
	
	ТекущиеДанные = Элементы.ДеревоСтатей.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(СтруктураКлючаРегистра, ТекущиеДанные, "ТипДокумента, ВидОперации, ТипСтатьи");

	МассивКонструктораКлюча = Новый Массив;
	МассивКонструктораКлюча.Добавить(СтруктураКлючаРегистра);
	
	КлючЗаписиРегистра = Новый ("РегистрСведенийКлючЗаписи.НастройкиСтатейДоходовРасходовПоУмолчанию", МассивКонструктораКлюча);
	ОткрытьФорму("РегистрСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.ФормаЗаписи", Новый Структура("Ключ, ПерваяСтрока", КлючЗаписиРегистра, ПерваяСтрока));

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОрганизацийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ТаблицаОрганизаций.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Организация) И НЕ ЗначениеЗаполнено(ТекущиеДанные.Подразделение) Тогда
		Сообщить("Нельзя удалять настройку по умолчанию");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаОрганизацийПередУдалениемЗавершение", ЭтотОбъект, Элемент.ТекущаяСтрока);
	ПоказатьВопрос(ОписаниеОповещения, "Удалить настройку?", РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОрганизацийПередУдалениемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеДерева = Элементы.ДеревоСтатей.ТекущиеДанные;
	ТекущиеДанные = Элементы.ТаблицаОрганизаций.ТекущиеДанные;

	Если УдалитьЗаписьРегистра(ТекущиеДанныеДерева.ТипДокумента, ТекущиеДанныеДерева.ВидОперации, ТекущиеДанныеДерева.ТипСтатьи, ТекущиеДанные.Организация, ТекущиеДанные.Подразделение) Тогда
		СтрокаТаблицы = ТаблицаОрганизаций.НайтиПоИдентификатору(ДополнительныеПараметры);
		ТаблицаОрганизаций.Удалить(СтрокаТаблицы);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УдалитьЗаписьРегистра(ТипДокумента, ВидОперации, ТипСтатьи, Организация, Подразделение)
	
	МенеджерЗаписи = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипДокумента 	= ТипДокумента;
	МенеджерЗаписи.ВидОперации 		= ВидОперации;
	МенеджерЗаписи.ТипСтатьи 		= ТипСтатьи;
	МенеджерЗаписи.Организация 		= Организация;
	МенеджерЗаписи.Подразделение 	= Подразделение;
	МенеджерЗаписи.Прочитать();	
	Если МенеджерЗаписи.Выбран() Тогда
		Попытка
			МенеджерЗаписи.Удалить();
			Возврат Истина;
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

