
#Область ПеременныеФормы

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	ВариантОпределенияОтветственностиПоУмолчанию = Константы.СпособОпределенияОтветственностиПоВозврату.Получить();

	Если Параметры.Ключ.Пустая() Тогда		
		//Если Объект.ОтветственностьИсполнителейПоСебестоимости Тогда
		//	ЗаполнитьОтветственностьНаСервере();
		//	//ПересчитатьСуммыПоОтветственным();
		//КонецЕсли;
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	НарушенаПоследовательностьПоСебестоимости = ПоследовательностьПоСебестоимостиНаДатуДокументаНарушена(Объект.Дата);
	
	ОбновитьДанныеДокумента();
	УправлениеФормой();
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	// бонусы
	УчетБонусовПо = ?(Объект.СлужебныйУчетБонусовПоДисконтнымКартам, 1, 0);
	Элементы.ГруппаБонусы.Видимость   = Объект.СлужебныйУчитыватьБонусы;
	Элементы.ГруппаДисконтнаяКарта.Видимость   = Объект.СлужебныйУчетБонусовПоДисконтнымКартам;
	Элементы.ТоварыБонусыКНачислению.Видимость = Объект.СлужебныйУчитыватьБонусы;
	
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
	ФинансыСервер.УстановитьОтметкуНезаполненныхСтатейДоходовРасходов(Элементы);
	
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма);
	
	ОбновитьДанныеТаблицыАвансов();
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	Если Объект.ПриходоватьТоварНаСклад ИЛИ Объект.БракПроизводства Тогда
		ЗаполнитьСебестоимостьПродажиСервер();
	КонецЕсли;
	//Если Объект.ОтветственностьИсполнителейПоСебестоимости Тогда
	//	ЗаполнитьСебестоимостьПродажНаСервере();
	//КонецЕсли;
			
	ПересчитатьСуммыПоОтветственным(); // №14125
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
	СписокВидовДокументовПоКоторымВедутсяРасчеты = ОбщийМодуль.ПолучитьМассивТиповДокументовПоКоторымВедутсяРасчетыПоЗаказам();
	Элементы.РаспределениеПлатежаРаспределение_ЗаказПокупателя.Доступность = 
			НЕ СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(Тип("ДокументСсылка.ЗаказПокупателя")) = Неопределено;
	Элементы.РаспределениеПлатежаРаспределение_Реализация.Доступность = 
			НЕ СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(Тип("ДокументСсылка.РеализацияТоваровИУслуг")) = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//++ №14187
	Если НЕ Объект.РучнаяКорректировкаВыработки Тогда
		Объект.Выработка.Очистить();
	КонецЕсли;
	//-- №14187
	
	Если НЕ Объект.УменьшитьДолгКонтрагента Тогда
		Объект.ЗачетАванса.Очистить();	
	КонецЕсли;
	
	//#13359 перенесено в ПослеЗаписи
	//Если НЕ Отказ 
	//	И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
	//	И UDS_ОбщийМодульВызовСервера.ИспользуетсяUDS() Тогда
	//	UDS_ОбщийМодульКлиент.ПередатьВозврат(Объект, Отказ);
	//КонецЕсли;
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДанныеДокумента();
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = НЕ ПраваПользователей.РазрешеноПриходоватьНаСклад(Объект.Склад);
		Если Отказ Тогда
			Сообщить("У текущего пользователя нет прав для оформления прихода на склад """ + Объект.Склад + """");
			Возврат;
		КонецЕсли;
		
		//Если Объект.ОтветственностьИсполнителейПоСебестоимости Тогда
		//	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		//		Если ТекущаяСтрока.Себестоимость = 0 И НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
		//			Сообщить("В строке " + Формат(ТекущаяСтрока.НомерСтроки,"ЧГ=") + " не указана себестоимость");
		//			Отказ = Истина;
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
	КонецЕсли;
	
	// проверяем заполненность статей доходов/расходов
	ФинансыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	СуммаЗачета = ПолучитьСуммуЗачета();
	ФинансыСервер.ПроверитьСуммуРаспределенияПоТипамДокументов(Объект, "ЗачетАванса", СуммаЗачета, Отказ, ПараметрыЗаписи.РежимЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	
	//Если Объект.ОтветственностьИсполнителейПоСебестоимости Тогда
	//	ЗаполнитьСебестоимостьПродажНаСервере();
	//	ПересчитатьСуммыПоОтветственным(); // №14125
	//КонецЕсли;
		
	Если ТекущийОбъект.ПриходоватьТоварНаСклад ИЛИ ТекущийОбъект.БракПроизводства Тогда
		ЗаполнитьСебестоимостьПродажиСервер();
	КонецЕсли;
	
	ОбновитьДанныеДокумента();		
	ОбновитьДанныеТаблицыАвансов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//#13359
		//Если UDS_ОбщийМодульВызовСервера.ИспользуетсяUDS() Тогда
		Если Объект.СлужебныйВидБонуснойСистемы = ПредопределенноеЗначение("Перечисление.ВидыБонусныхСистем.UDS") Тогда
			СостояниеОбменаUDS = UDS_ОбщийМодульКлиент.ПередатьВозврат(Объект);
			Если СостояниеОбменаUDS = 0 Тогда // не требуется
				// продолжаем процедуру ПослеЗаписи
			ИначеЕсли СостояниеОбменаUDS = 1 Тогда 
				// успешно отправлено
				Записать(ПараметрыЗаписи);
				Возврат;
			Иначе
				// ошибка при отправке, пользователь получит сообщение
				ПараметрыЗаписи.ПринудительноЗакрытьФорму = Ложь;
				//Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбщийМодульКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор;
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьДолгКонтрагентаПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриходоватьТоварНаСкладПриИзменении(Элемент)
	
	УправлениеФормой();
	Если Объект.ПриходоватьТоварНаСклад Тогда		
		Для каждого СтрокаТабличнойЧасти из Объект.Товары Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВариантОпределенияСебестоимости) Тогда
				СтрокаТабличнойЧасти.ВариантОпределенияСебестоимости = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументПродажи), 
																		ПредопределенноеЗначение("Перечисление.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи"),
																		ПредопределенноеЗначение("Перечисление.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание"));
			КонецЕсли;
		КонецЦикла;
	
		ЗаполнитьСебестоимостьПродажиСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БракПроизводстваПриИзменении(Элемент)
	
	Если Объект.БракПроизводства И ЗначениеЗаполнено(ВариантОпределенияОтветственностиПоУмолчанию) Тогда		
		Для каждого СтрокаТабличнойЧасти из Объект.Товары Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВариантОпределенияОтветственности) Тогда
				СтрокаТабличнойЧасти.ВариантОпределенияОтветственности = ВариантОпределенияОтветственностиПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ЗаполнитьСебестоимостьПродажиСервер();
	ЗаполнитьОтветственностьНаСервере();
	
	ОбновитьДанныеДокумента();
	УправлениеФормой();
	
	ПересчитатьСуммыПоОтветственным();
	
КонецПроцедуры

&НаКлиенте
Процедура ДисконтнаяКартаПриИзменении(Элемент)
	ОбновитьДанныеДокумента();
КонецПроцедуры

//&НаКлиенте
//Процедура ОтветственностьИсполнителейПоСебестоимостиПриИзменении(Элемент)
//	
//	НарушенаПоследовательностьПоСебестоимости = ПоследовательностьПоСебестоимостиНаДатуДокументаНарушена(Объект.Дата);
//	
//	ЗаполнитьОтветственностьНаСервере();
//	
//	ОбновитьДанныеДокумента();
//	УправлениеФормой();
//	
//	ПересчитатьСуммыПоОтветственным(); // №14125
//	
//КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыТоваров

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Коэффициент = 1;
	ПроставитьВидНоменклатуры();
	
	Если Объект.ПриходоватьТоварНаСклад ИЛИ Объект.БракПроизводства Тогда
		ЗаполнитьСебестоимостьПродажиСервер(СтрокаТабличнойЧасти.НомерСтроки);
	КонецЕсли;
	Если Объект.БракПроизводства Тогда
		ЗаполнитьОтветственностьНаСервере(СтрокаТабличнойЧасти.НомерСтроки);
		ПересчитатьСуммыПоОтветственным();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена - СтрокаТабличнойЧасти.БонусыКНачислению;
	
	Если Объект.ПриходоватьТоварНаСклад ИЛИ Объект.БракПроизводства Тогда
		ЗаполнитьСебестоимостьПродажиСервер(СтрокаТабличнойЧасти.НомерСтроки);
	КонецЕсли;
	Если Объект.БракПроизводства Тогда		
		ЗаполнитьОтветственностьНаСервере(СтрокаТабличнойЧасти.НомерСтроки);																	
		ПересчитатьСуммыПоОтветственным();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена - СтрокаТабличнойЧасти.БонусыКНачислению;
	
	Если Объект.БракПроизводства Тогда
		ЗаполнитьОтветственностьНаСервере(СтрокаТабличнойЧасти.НомерСтроки);
		ПересчитатьСуммыПоОтветственным();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = (СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.БонусыКНачислению) / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	Если Объект.БракПроизводства Тогда
		ЗаполнитьОтветственностьНаСервере(СтрокаТабличнойЧасти.НомерСтроки);
		ПересчитатьСуммыПоОтветственным();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказПокупателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	СписокЗаказовПокупателей = новый СписокЗначений;
	//ПодготовитьСписокЗаказовПокупателей(СписокЗаказовПокупателей);	
	ПодготовитьСписокЗаказовПокупателей(Объект.Ссылка, ТекущаяСтрока.ДокументПродажи, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.СерияНоменклатуры, СписокЗаказовПокупателей);		
		
	Отбор = новый Структура;
	Отбор.Вставить("Ссылка", СписокЗаказовПокупателей);
	
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаВыбора", новый Структура("Отбор, ТекущаяСтрока", Отбор, ТекущаяСтрока.ЗаказПокупателя), Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВариантОпределенияСебестоимостиПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Себестоимость = 0;
	СтрокаТабличнойЧасти.ДокументПродажи = ПредопределенноеЗначение("Документ.РеализацияТоваровИУслуг.ПустаяСсылка");
	
	//Если Объект.БракПроизводства Тогда
	//	ЗаполнитьОтветственностьНаСервере(СтрокаТабличнойЧасти.НомерСтроки);
	//	ПересчитатьСуммыПоОтветственным();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДокументПродажиПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументПродажи) И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЗаказПокупателя) Тогда
		СписокЗаказовПокупателей = Новый СписокЗначений;
		ПодготовитьСписокЗаказовПокупателей(Объект.Ссылка, СтрокаТабличнойЧасти.ДокументПродажи, 
											СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.СерияНоменклатуры, СписокЗаказовПокупателей);	
		Если СписокЗаказовПокупателей.Количество() > 0 Тогда
			СтрокаТабличнойЧасти.ЗаказПокупателя = СписокЗаказовПокупателей.Получить(0).Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ПриходоватьТоварНаСклад ИЛИ Объект.БракПроизводства Тогда
		ЗаполнитьСебестоимостьПродажиСервер(СтрокаТабличнойЧасти.НомерСтроки);
	КонецЕсли;
	Если Объект.БракПроизводства Тогда
		ЗаполнитьОтветственностьНаСервере(СтрокаТабличнойЧасти.НомерСтроки);
		ПересчитатьСуммыПоОтветственным();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДокументПродажиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	СписокРеализацийПоЗаказу = Новый СписокЗначений;
	ПодготовитьСписокРеализаций(Объект.Ссылка, ТекущаяСтрока.ЗаказПокупателя, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.СерияНоменклатуры, СписокРеализацийПоЗаказу);	
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", СписокРеализацийПоЗаказу);
	
	ОткрытьФорму("Документ.РеализацияТоваровИУслуг.ФормаВыбора", Новый Структура("Отбор, ТекущаяСтрока", Отбор, ТекущаяСтрока.ЗаказПокупателя), Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСебестоимостьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	//Если Объект.БракПроизводства Тогда
	//	ЗаполнитьОтветственностьНаСервере(СтрокаТабличнойЧасти.НомерСтроки);
	//	ПересчитатьСуммыПоОтветственным();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыБонусыКНачислениюПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена - СтрокаТабличнойЧасти.БонусыКНачислению;
	
	Если Объект.БракПроизводства Тогда
		ЗаполнитьОтветственностьНаСервере(СтрокаТабличнойЧасти.НомерСтроки);
		ПересчитатьСуммыПоОтветственным();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВариантОпределенияОтветственностиПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	ЗаполнитьСебестоимостьПродажиСервер(СтрокаТабличнойЧасти.НомерСтроки);
	ЗаполнитьОтветственностьНаСервере(СтрокаТабличнойЧасти.НомерСтроки);
	ПересчитатьСуммыПоОтветственным();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОтветственностьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.ВариантОпределенияОтветственности = ПредопределенноеЗначение("Перечисление.ВариантыОпределенияОтветственностиПоВозвратам.РучноеУказание");
	
	ПересчитатьСуммыПоОтветственным();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыОтветственных

//++ №14125
&НаКлиенте
Процедура ОтветственныеПриИзменении(Элемент)
	
	ПересчитатьСуммыПоОтветственным();
	
КонецПроцедуры
//-- №14125

&НаКлиенте
Процедура ОтветственныеСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Ответственные.ТекущиеДанные;
	ТекущиеДанные.Коэффициент = 1;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщийМодульКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщийМодульКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщийМодульКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	ПараметрыПодбора.Вставить("Склад",					Объект.Склад);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыТовары());
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	ОбновитьДанныеДокумента(); 
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОтветственныхПоВыпуску(Команда)
		
	Если Объект.Товары.Количество() = 0 Тогда
		Состояние("В документе не указаны возвращенные товары или продукция");
		Возврат;
	КонецЕсли;
	
	Если Объект.Ответственные.Количество() > 0 Тогда
		
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВопросаОбОчисткеОтветственныхПриЗаполненииПоВыпуску", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "При продолжении табличная часть ""Ответственные"" будет очищена, продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
		
	Иначе		
		ЗаполнитьОтветственныхПоВыпускуНаСервере();
		ПересчитатьСуммыПоОтветственным();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеОтветственныхПриЗаполненииПоВыпуску(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОтветственныхПоВыпускуНаСервере();
	ПересчитатьСуммыПоОтветственным();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоИСтоимостьПоПоследнейПродаже(Команда)
	ЗаполнитьКоличествоИСтоимостьПоПоследнейПродажеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоИСтоимостьПоПоследнейПродажеНаСервере()
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, КонецДня(ТекущаяДатаСеанса())));
		Запрос.УстановитьПараметр("Организация",			Объект.Организация);
		Запрос.УстановитьПараметр("Контрагент",				Объект.Контрагент);
		Запрос.УстановитьПараметр("ДоговорКонтрагента",		Объект.ДоговорКонтрагента);
		
		Запрос.УстановитьПараметр("Номенклатура",				ТекущаяСтрока.Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",	ТекущаяСтрока.ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("СерияНоменклатуры",			ТекущаяСтрока.СерияНоменклатуры);
			
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи) КАК ВариантОпределенияСебестоимости,
		|	ПродажиОбороты.Регистратор КАК ДокументПродажи,
		|	ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ПродажиОбороты.КоличествоОборот КАК Количество,
		|	ПродажиОбороты.СуммаОборот КАК Сумма,
		|	ЕСТЬNULL(ТоварыНаСкладахОбороты.СуммаРасход, 0) КАК Себестоимость
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			,
		|			&ДатаДокумента,
		|			Регистратор,
		|			Организация = &Организация
		|				И Контрагент = &Контрагент
		|				И ДоговорКонтрагента = &ДоговорКонтрагента
		|				И Номенклатура = &Номенклатура
		|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|				И СерияНоменклатуры = &СерияНоменклатуры) КАК ПродажиОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, ) КАК ТоварыНаСкладахОбороты
		|		ПО ПродажиОбороты.Регистратор = ТоварыНаСкладахОбороты.Регистратор
		|			И ПродажиОбороты.Номенклатура = ТоварыНаСкладахОбороты.Номенклатура
		|			И ПродажиОбороты.ХарактеристикаНоменклатуры = ТоварыНаСкладахОбороты.ХарактеристикаНоменклатуры
		|			И ПродажиОбороты.СерияНоменклатуры = ТоварыНаСкладахОбороты.СерияНоменклатуры
		|			И ПродажиОбороты.КоличествоОборот = ТоварыНаСкладахОбороты.КоличествоРасход
		|ГДЕ
		|	ПродажиОбороты.КоличествоОборот > 0
		|	ИЛИ ПродажиОбороты.СуммаОборот > 0";
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка, "ВариантОпределенияСебестоимости, ЗаказПокупателя, ДокументПродажи, Количество, Сумма");
			//ТекущаяСтрока.ЗаказПокупателя = Выборка.ЗаказПокупателя;
			//ТекущаяСтрока.Количество = Выборка.Количество;
			//ТекущаяСтрока.Сумма = Выборка.Сумма;
			//ТекущаяСтрока.Себестоимость = Выборка.Себестоимость;
						
			Если НЕ Выборка.Количество = 0 Тогда
				ТекущаяСтрока.Цена = Выборка.Сумма / Выборка.Количество;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Объект.БракПроизводства Тогда
		ЗаполнитьОтветственностьНаСервере();
		ПересчитатьСуммыПоОтветственным();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКотрагентаПоДисконтнойКарте(Команда)
	ОП = Новый ОписаниеОповещения("ПослеПолученияКонтрагентаПоДисконтноКарте", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ПолучитьКонтрагентаПоДисконтнойКарте",,,,,,ОП);
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияКонтрагентаПоДисконтноКарте(ПараметрыВозврата, ДопПараметры) Экспорт
	
	Если НЕ ПараметрыВозврата = Неопределено Тогда
		Объект.Контрагент = ПараметрыВозврата.Контрагент;
		Объект.ДисконтнаяКарта = ПараметрыВозврата.ДисконтнаяКарта;
		
		КонтрагентПриИзмененииНаСервере();
		ОбновитьДанныеДокумента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)	
	ЗаполнитьПоОснованиюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованиюНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		
		РеквизитыДокумента = Новый Структура("Валюта, Организация, Контрагент, ДоговорКонтрагента, Подразделение, Склад, ДисконтнаяКарта");
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, Объект);
		
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");
		ТекущийОбъект.Товары.Очистить();
		ТекущийОбъект.Заполнить(Объект.Основание);
		ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
		
		ЗаполнитьЗначенияСвойств(Объект, РеквизитыДокумента);
		
		//заполним отвественность
		Если Объект.БракПроизводства Тогда
			Для каждого СтрокаТабличнойЧасти из Объект.Товары Цикл
				СтрокаТабличнойЧасти.ВариантОпределенияОтветственности = ВариантОпределенияОтветственностиПоУмолчанию;
			КонецЦикла;			
			
			ЗаполнитьОтветственностьНаСервере();
			ПересчитатьСуммыПоОтветственным();
		КонецЕсли;
		
		ОбновитьДанныеДокумента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// "Сумма себестоимости" = "Заполнение не требуется", если себестоимость по документу продажи
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСебестоимость.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи;

	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Заполнение не требуется");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	// "Документ продажи" = "Заполнение не требуется", если себестоимость вручную
	//Элемент = УсловноеОформление.Элементы.Добавить();

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыДокументПродажи.Имя);
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание;

	//Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	//Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Заполнение не требуется");
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	// "Сумма себестоимости" = "Укажите стоимость", если себестоимость вручную и равно 0
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСебестоимость.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Себестоимость");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Укажите стоимость");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	// "Документ продажи" = "Укажите документ продажи", если ДокументПродажи не заполнен и (себестоимость по документу продажи или ответственность по себестоимости документа продажи) 
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыДокументПродажи.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ДокументПродажи");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ГруппаОтбора2 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
	
	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияОтветственности");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПоСебестоимости;
		
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Укажите документ продажи");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	// Контроль = "нарушена последовательность определения себестоимости"
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКонтрольСебестоимости.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	//ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияОтветственности");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПоСебестоимости;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("НарушенаПоследовательностьПоСебестоимости");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Себестоимость может быть не корректной - нарушена последовательность определения себестоимости");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	// Контроль = "Заполнение не требуется"
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКонтрольСебестоимости.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	//ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияОтветственности");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПоСебестоимости;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("НарушенаПоследовательностьПоСебестоимости");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Заполнение не требуется");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	// Контроль = "Значение отличается от фактической себестоимости"
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКонтрольСебестоимости.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	//ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("НарушенаПоследовательностьПоСебестоимости");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.Ответственность");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СебестоимостьПродажи");
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Значение отличается от фактической себестоимости");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	////
	//Элемент = УсловноеОформление.Элементы.Добавить();

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКонтрольСебестоимости.Имя);
	//
	//ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	//
	//ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание;

	//ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.Ответственность");
	//ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	//ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Себестоимость");
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Значение отличается от указанной себестоимости");
	//Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(Элементы.ТоварыКонтрольСебестоимости.Шрифт, , , Истина));
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	// 
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыОтветственность.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияОтветственности");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.РучноеУказание;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Ответственность");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Укажите сумму ответственности");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	// Контроль = "Заполнение не требуется"
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКонтрольСебестоимости.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияОтветственности");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.РучноеУказание;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Заполнение не требуется");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	// Контроль = "Заполнение не требуется"
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКонтрольСебестоимости.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияОтветственности");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПоСумме;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Заполнение не требуется");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	//
	//Элемент = УсловноеОформление.Элементы.Добавить();

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКонтрольСебестоимости.Имя);
	//
	//ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	//
	//ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание;

	//ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияОтветственности");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПоСебестоимости;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Заполнение не требуется");
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщийМодульКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, "Расход", Ложь);
	Объект.СтатьяДоходов  = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, "Доход");
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеДокумента()
	
	СуммаДокументаВрем = Объект.Товары.Итог("Сумма");
	Если НЕ Объект.СуммаДокумента = СуммаДокументаВрем Тогда
		Объект.СуммаДокумента = СуммаДокументаВрем;
	КонецЕсли;
	
	Если Объект.СлужебныйУчитыватьБонусы Тогда		
		//ОпределитьОстатокПоДисконтнойКарте();
		БонусыСервер.ОпределитьОстатокПоДисконтнойКарте(ЭтаФорма);
		БонусыКНачислениюИтог = Объект.Товары.Итог("БонусыКНачислению");
		Если Не Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = БонусыКНачислениюИтог Тогда
			Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = БонусыКНачислениюИтог;
		КонецЕсли;
	Иначе
		//Если НЕ Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = 0 Тогда
		Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = 0;
		//КонецЕсли;
	КонецЕсли;
	
	ПроставитьВидНоменклатуры();

	//Элементы.ТоварыСебестоимость.Видимость = Объект.ОтветственностьИсполнителейПоСебестоимости;
	//Элементы.ТоварыСебестоимость.АвтоОтметкаНезаполненного = Объект.ОтветственностьИсполнителейПоСебестоимости;
	//Элементы.СтраницаОтветственные.Видимость = Объект.БракПроизводства;
	//
	//	
	////++ №14187
	//Элементы.ГруппаВыработка.Видимость = Объект.БракПроизводства;
	//Элементы.ГруппаВыработка.Заголовок = ?(Объект.Проведен, "Выработка - Факт", "Выработка - План");
	//
	//Элементы.ОбъектВыработка.Видимость = Объект.РучнаяКорректировкаВыработки;
	//Элементы.Выработка.Видимость = НЕ Объект.РучнаяКорректировкаВыработки;
	
	СуммаВыработки = ?(Объект.РучнаяКорректировкаВыработки, Объект.Выработка.Итог("Стоимость"), Выработка.Итог("Стоимость"));
	//-- №14187
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ГруппаРаспределение.Видимость = Объект.УменьшитьДолгКонтрагента;
	
	//Элементы.ОтветственностьИсполнителейПоСебестоимости.Доступность = Объект.БракПроизводства;

	// #15628
	Элементы.ТоварыГруппаСебестоимость.Видимость = Объект.ПриходоватьТоварНаСклад;
	
	//Элементы.ТоварыОтветственность.Видимость = Объект.ОтветственностьИсполнителейПоСебестоимости;
	//Элементы.ТоварыКонтрольСебестоимости.Видимость = Объект.ОтветственностьИсполнителейПоСебестоимости;
	Элементы.ТоварыГруппаОтветственность.Видимость = Объект.БракПроизводства;

	//Элементы.ТоварыСебестоимость.АвтоОтметкаНезаполненного = Объект.ОтветственностьИсполнителейПоСебестоимости;
	Элементы.СтраницаОтветственные.Видимость = Объект.БракПроизводства;	
		
	//++ №14187
	Элементы.ГруппаВыработка.Видимость = Объект.БракПроизводства;
	Элементы.ГруппаВыработка.Заголовок = ?(Объект.Проведен, "Выработка - Факт", "Выработка - План");
	
	Элементы.ОбъектВыработка.Видимость = Объект.РучнаяКорректировкаВыработки;
	Элементы.Выработка.Видимость = НЕ Объект.РучнаяКорректировкаВыработки;	
	//-- №14187

КонецПроцедуры

&НаСервере
Процедура ПроставитьВидНоменклатуры()
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ТекущаяСтрока.ВидНоменклатуры = ТекущаяСтрока.Номенклатура.ВидНоменклатуры;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоэффициентЕдиницыИзмерения(ЕдиницаИзмерения)
	
	Возврат ЕдиницаИзмерения.Коэффициент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции
	
&НаСервере
Функция ПолучитьСписокВидовНоменклатурыТовары()
	
	Возврат Справочники.Номенклатура.ПолучитьСписокВидовНоменклатурыТовары();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОтветственныхПоВыпускуНаСервере()
	
	//переберем все указанные товары\продукция и по выработке найдем ответственных
	ТаблицаОтветственных = Новый ТаблицаЗначений;
	ТаблицаОтветственных.Колонки.Добавить("Сотрудник");
	ТаблицаОтветственных.Колонки.Добавить("Коэффициент");
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладахОбороты.Регистратор
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОбороты
		|ГДЕ
		|	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ВыпускПродукции
		|	И ТоварыНаСкладахОбороты.КоличествоПриход > 0";
		Запрос.УстановитьПараметр("Номенклатура",ТекущаяСтрока.Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СсылкаНаДокумент = Выборка.Регистратор;
			Для Каждого ТекущаяСтрока Из СсылкаНаДокумент.Исполнители Цикл
				НоваяСтрока = ТаблицаОтветственных.Добавить();
				НоваяСтрока.Сотрудник = ТекущаяСтрока.Сотрудник;
				НоваяСтрока.Коэффициент = ТекущаяСтрока.Коэффициент;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаОтветственных.Свернуть("Сотрудник","Коэффициент");
	Объект.Ответственные.Очистить();
	Для Каждого ТекущаяСтрока Из ТаблицаОтветственных Цикл
		НоваяСтрока = Объект.Ответственные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

//&НаСервере
//Процедура ОпределитьОстатокПоДисконтнойКарте()
//	
//	ДатаЗапроса = Объект.Дата;
//	Если ДатаЗапроса = Дата(1,1,1) Тогда
//		ДатаЗапроса = ТекущаяДатаСеанса();
//	КонецЕсли;
//	
//	ОстатокПоДисконтнойКарте = 0;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	БонусыКонтрагентовОстатки.СуммаОстаток
//	|ИЗ
//	|	РегистрНакопления.БонусыКонтрагентов.Остатки(
//	|			&ДатаЗапроса,
//	|			Контрагент = &Контрагент
//	|				И ДисконтнаяКарта = &ДисконтнаяКарта) КАК БонусыКонтрагентовОстатки";
//	Запрос.УстановитьПараметр("ДатаЗапроса", КонецДня(ДатаЗапроса));
//	Запрос.УстановитьПараметр("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
//	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл
//		ОстатокПоДисконтнойКарте = Выборка.СуммаОстаток;
//	КонецЦикла;

//КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственностьНаСервере(НомерСтроки = Неопределено)
	
	Для каждого СтрокаТабличнойЧасти из Объект.Товары Цикл
		Если НЕ НомерСтроки = Неопределено И НЕ СтрокаТабличнойЧасти.НомерСтроки = НомерСтроки Тогда
			Продолжить;
		КонецЕсли;
		
		//СтрокаТабличнойЧасти.СебестоимостьПродажи = 0;
		Если СтрокаТабличнойЧасти.ВариантОпределенияОтветственности = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПоСебестоимости Тогда
			СтрокаТабличнойЧасти.Ответственность = СтрокаТабличнойЧасти.СебестоимостьПродажи;
																
			//Если СтрокаТабличнойЧасти.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание Тогда
			//	СтрокаТабличнойЧасти.Ответственность = СтрокаТабличнойЧасти.Себестоимость;
			//
			//ИначеЕсли СтрокаТабличнойЧасти.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи Тогда
				//СтрокаТабличнойЧасти.Ответственность = СебестоимостьПродажи(СтрокаТабличнойЧасти.ДокументПродажи, СтрокаТабличнойЧасти.Номенклатура, 
				//															СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры,  СтрокаТабличнойЧасти.СерияНоменклатуры,
				//															СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Коэффициент);
			//	СтрокаТабличнойЧасти.СебестоимостьПродажи = СтрокаТабличнойЧасти.Ответственность;															
			//КонецЕсли;
			
		ИначеЕсли СтрокаТабличнойЧасти.ВариантОпределенияОтветственности = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПоСумме Тогда															
			СтрокаТабличнойЧасти.Ответственность = СтрокаТабличнойЧасти.Сумма;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСебестоимостьПродажиСервер(НомерСтроки = Неопределено)
	
	Для каждого СтрокаТабличнойЧасти из Объект.Товары Цикл
		Если НЕ НомерСтроки = Неопределено И НЕ СтрокаТабличнойЧасти.НомерСтроки = НомерСтроки Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.СебестоимостьПродажи = 0;
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументПродажи) Тогда
			СтрокаТабличнойЧасти.СебестоимостьПродажи = СебестоимостьПродажи(СтрокаТабличнойЧасти.ДокументПродажи, СтрокаТабличнойЧасти.Номенклатура, 
																			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры,  СтрокаТабличнойЧасти.СерияНоменклатуры,
																			СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Коэффициент);															
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//&НаСервере
//Процедура ПодготовитьСписокЗаказовПокупателей(СписокЗаказовПокупателей) 
//	
//	Если Объект.Основание <> Неопределено И НЕ Объект.Основание.Пустая() Тогда
//		Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
//			СписокЗаказовПокупателей.Добавить(Объект.Основание);
//		ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
//			Для Каждого ТекущаяСтрока Из Объект.Основание.Товары Цикл
//				Если ТекущаяСтрока.Заказ <> Неопределено И НЕ  ТекущаяСтрока.Заказ.Пустая()
//					И ТипЗнч(ТекущаяСтрока.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") 
//				Тогда 
//					СписокЗаказовПокупателей.Добавить(ТекущаяСтрока.Заказ);	
//				КонецЕсли;
//			КонецЦикла;			
//		ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
//			Если Объект.Основание.ДокументОснование <> Неопределено И НЕ Объект.Основание.ДокументОснование.Пустая()
//				И ТипЗнч(Объект.Основание.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") 
//			Тогда
//				СписокЗаказовПокупателей.Добавить(Объект.Основание.ДокументОснование);				
//			КонецЕсли;
//		ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ВыпускПродукции") Тогда
//			Если Объект.Основание.Основание.ДокументОснование <> Неопределено И НЕ Объект.Основание.Основание.ДокументОснование.Пустая()
//				И ТипЗнч(Объект.Основание.Основание.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") 
//			Тогда
//				СписокЗаказовПокупателей.Добавить(Объект.Основание.Основание.ДокументОснование);				
//			КонецЕсли;	
//		КонецЕсли;	
//	КонецЕсли;	
//	
//КонецПроцедуры

&НаСервереБезКонтекста
Функция СебестоимостьПродажи(ДокументПродажи, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Количество)
	
	Если НЕ ЗначениеЗаполнено(ДокументПродажи) Тогда
		Возврат 0;
	КонецЕсли;
	
	МассивДокументовПродаж = Новый Массив;
	МассивДокументовПродаж.Добавить(ДокументПродажи);
	ТаблицаСебестоимости = ОбщийМодульСервер.ТаблицаСебестоимостиПродаж(МассивДокументовПродаж);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", 				 Номенклатура);
	Отбор.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Отбор.Вставить("СерияНоменклатуры", 		 СерияНоменклатуры);
	Отбор.Вставить("Регистратор", 				 ДокументПродажи);
	
	НайденныеСтроки = ТаблицаСебестоимости.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0].Цена * Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоследовательностьПоСебестоимостиНаДатуДокументаНарушена(Дата)
	
	Если Дата = Дата(1,1,1) Тогда
		МоментВремениДокумента = Новый МоментВремени(КонецДня(ТекущаяДатаСеанса()));
	Иначе
		МоментВремениДокумента = Новый МоментВремени(КонецДня(Дата));
	КонецЕсли;

	Результат = Ложь;
	
	Если ОбщийМодуль.ПоследовательностьПоСебестоимостиНарушена() Тогда
		ГраницаПоследовательности = ОбщийМодуль.ПолучитьГраницуПоследовательностиПоСебестоимости();
		
		Если МоментВремениДокумента.Сравнить(ГраницаПоследовательности) = 1 Тогда			
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПодготовитьСписокЗаказовПокупателей(ВозвратСсылка, ДокументПродажи, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, СписокЗаказовПокупателей) 
			
	МассивЗаказов = ОбщийМодульСервер.МассивЗаказовПоРеализациям(ВозвратСсылка, ДокументПродажи, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры);	
	СписокЗаказовПокупателей.ЗагрузитьЗначения(МассивЗаказов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьСписокРеализаций(ВозвратСсылка, ЗаказПокупателя, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, СписокРеализацийПоЗаказу) 
	
	МассивРеализаций = ОбщийМодульСервер.МассивРеализацийПоЗаказуИНоменклатуре(ВозвратСсылка, ЗаказПокупателя, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры);	
	СписокРеализацийПоЗаказу.ЗагрузитьЗначения(МассивРеализаций);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиВыработки

//++ №14125
&НаСервере
Процедура ПересчитатьСуммыПоОтветственным()
	
	//++ №14187 комментируем, т.к. теперь используется ТЧ Выработка
	//СуммаКоэффициентов = Объект.Ответственные.Итог("Коэффициент");
	//
	//СуммаРаспределения = ?(Объект.ОтветственностьИсполнителейПоСебестоимости, Объект.Товары.Итог("Себестоимость"), Объект.Товары.Итог("Сумма"));
	//
	//Для Каждого ТекущаяСтрока Из Объект.Ответственные Цикл
	//	
	//	КоэффициентРасределения = ?(СуммаКоэффициентов = 0, 0, Окр(ТекущаяСтрока.Коэффициент / СуммаКоэффициентов, 4)*100);
	//	
	//	ТекущаяСтрока.Сумма = (КоэффициентРасределения / 100) * СуммаРаспределения;
	//	
	//КонецЦикла;
	//
	//ИтогСуммаПоОтветственным = Объект.Ответственные.Итог("Сумма");
	//-- №14187 комментируем
	
	//++ №14187 через ТЧ Выработка
	Если Объект.РучнаяКорректировкаВыработки Тогда
		Возврат;
	КонецЕсли;
	
	Выработка.Очистить();
	
	ТаблицаВыработки = Документы.ВозвратПродукции.ПолучитьТаблицуВыработки(Объект);
	
	Для Каждого СтрокаВыработки Из ТаблицаВыработки Цикл		
		НоваяСтрока = Выработка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыработки);		
	КонецЦикла;
	
	ОбновитьДанныеДокумента();
	//-- №14187
		
КонецПроцедуры
//-- №14125

//++ №14187
&НаКлиенте
Процедура РучнаяКорректировкаВыработкиПриИзменении(Элемент)
	
	РучнаяКорректировкаВыработкиПриИзмененииНаСервере();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаВыработкиПриИзмененииНаСервере()
	
	Объект.Выработка.Очистить();
	
	Если Объект.РучнаяКорректировкаВыработки Тогда
		
		ТаблицаВыработки = Документы.ВозвратПродукции.ПолучитьТаблицуВыработки(Объект);
		
		Для Каждого СтрокаВыработки Из ТаблицаВыработки Цикл
			
			НоваяСтрока = Объект.Выработка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыработки);
			
		КонецЦикла;
		
		ОбновитьДанныеДокумента();
		
	Иначе
		
		ПересчитатьСуммыПоОтветственным();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыработкуПоУстановленнымПравиламРасчета(Команда)
	
	РучнаяКорректировкаВыработкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаКоличествоПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСтоимостьВСтрокеТЧ(Элементы.ОбъектВыработка.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаЦенаПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСтоимостьВСтрокеТЧ(Элементы.ОбъектВыработка.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаСуммаПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьЦенуПоСтоимостиВСтрокеТЧ(Элементы.ОбъектВыработка.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ОбъектВыработка.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ОбъектВыработка.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыработкаПриИзменении(Элемент)
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры
//-- №14187

#КонецОбласти

#Область ВкладкаЗачетАванса
//#15395

&НаКлиенте
Процедура Распределение_Документ(Команда)
	ФинансыКлиент.Распределение_Документ(Команда, ЭтаФорма, "ЗачетАванса");
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СуммаЗачета = ПолучитьСуммуЗачета();
	
	Для каждого ВыбранныйДокумент из ВыбранноеЗначение Цикл
		Если НЕ ВыбранныйДокумент.Пустая() Тогда
			НоваяСтрока = Объект.ЗачетАванса.Добавить();
			НоваяСтрока.Документ = ВыбранныйДокумент;
			НоваяСтрока.Сумма = СуммаЗачета;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		РаспределениеОплаты(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока Тогда
		ВыполнитьРаспределениеОплаты();
		ОбновитьДанныеТаблицыАвансов();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансаПослеУдаления(Элемент)
	
	ВыполнитьРаспределениеОплаты();
	ОбновитьДанныеТаблицыАвансов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансаСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЗачетАванса.ТекущиеДанные;
	
	// №7373 нужно определить различие в валютах, чтобы корректно отображать определенные колонки и суммы
	ВалютаЗаказаРавнаВалютеДокумента = ОпределитьРазличиеВалютыЗаказаИВалютыДокументаНаСервере();
	
	Если НЕ (Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента) И НЕ ТекущаяСтрока = Неопределено Тогда
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьИзВалютыВВалютуВСтрокеТЧ(ТекущаяСтрока, Объект.Валюта, Объект.Дата);
	КонецЕсли;
	//ОбновитьНадписиРаспеределениеПлатежаНаСервере(ВалютаЗаказаРавнаВалютеДокумента);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуЗачета()
	
	//СуммаЗачета = 0;
	//Для каждого СтрокаТЧ из Объект.Товары Цикл
	//	Если СтрокаТЧ.КомпенсацияПоВозврату = ПредопределенноеЗначение("Перечисление.ВариантыКомпенсацииПоВозврату.ЗачестьВернуть") Тогда
	//		СуммаЗачета = СуммаЗачета + СтрокаТЧ.Сумма;	
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Возврат СуммаЗачета;
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ДокОбъект.ПолучитьСуммуЗачета();
	
КонецФункции

&НаКлиенте
Процедура РаспределениеОплаты(Команда)
	
	ВыполнитьРаспределениеОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРаспределениеОплаты(ДополнительныеПараметры=Неопределено)

	ОчиститьСообщения();
	СуммаЗачета = ПолучитьСуммуЗачета();
	Если СуммаЗачета = 0 Тогда
		Сообщить("Нет суммы к распределению! Сумма формируется по строкам с видом компенсации ""Зачесть как аванс / вернуть оплату""");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияОбновитьДанные = Новый ОписаниеОповещения("ОписаниеОповещенияОбновитьДанные", ЭтотОбъект);
	ФинансыКлиент.РаспределениеОплаты(ЭтаФорма, "ЗачетАванса", СтрокиРаспределенияПлатежей(), СуммаЗачета, ОписаниеОповещенияОбновитьДанные);
	
КонецПроцедуры

&НаСервере
Функция СтрокиРаспределенияПлатежей()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.ЗачетАванса.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ОписаниеОповещенияОбновитьДанные(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанныеТаблицыАвансов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеТаблицыАвансов()
	
	СписокДокументовРаспределения = Объект.ЗачетАванса.Выгрузить(,"Документ");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыПоЗаказамОстатки.СуммаОстаток КАК ОсталосьРаспределить,
	|	РасчетыПоЗаказамОстатки.Заказ КАК Заказ,
	|	РасчетыПоЗаказамОстатки.Заказ.СуммаДокумента КАК СуммаДокумента,
	|	РасчетыПоЗаказамОстатки.Заказ.Валюта КАК Валюта
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ В (&Заказ)) КАК РасчетыПоЗаказамОстатки";
	Запрос.УстановитьПараметр("Заказ", СписокДокументовРаспределения);
	ТаблицаПоДокументам = Запрос.Выполнить().Выгрузить();
	
	// №7373 нужно определить различие в валютах, чтобы корректно отображать определенные колонки и суммы
	ВалютаЗаказаРавнаВалютеДокумента = ФинансыСервер.ОпределитьРазличиеВалютыЗаказаИВалютыДокумента(Объект, "ЗачетАванса");
	
	Для Каждого СтрокаРаспределения Из Объект.ЗачетАванса Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Заказ", СтрокаРаспределения.Документ);
		НайденныеСтроки = ТаблицаПоДокументам.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента Тогда 
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, НайденныеСтроки[0]);
				СтрокаРаспределения.ВалютаДокумента = НайденныеСтроки[0].Валюта;
			Иначе
				СтрокаРаспределения.ВалютаДокумента = НайденныеСтроки[0].Валюта; 
				СтрокаРаспределения.СуммаДокументаВВалютеДокумента = НайденныеСтроки[0].СуммаДокумента;
				СтрокаРаспределения.СуммаДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(НайденныеСтроки[0].Валюта, Объект.Валюта, Объект.Дата, НайденныеСтроки[0].СуммаДокумента);
				СтрокаРаспределения.ОсталосьРаспределить = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(НайденныеСтроки[0].Валюта, Объект.Валюта, Объект.Дата, НайденныеСтроки[0].ОсталосьРаспределить);
			КонецЕсли;
		Иначе
			Попытка
				Если Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента Тогда
					СтрокаРаспределения.СуммаДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
					СтрокаРаспределения.ВалютаДокумента = СтрокаРаспределения.Документ.Валюта;
				Иначе
					СтрокаРаспределения.ВалютаДокумента = СтрокаРаспределения.Документ.Валюта; 
					СтрокаРаспределения.СуммаДокументаВВалютеДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
					СтрокаРаспределения.СуммаДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(СтрокаРаспределения.Документ.Валюта, Объект.Валюта, Объект.Дата, СтрокаРаспределения.Документ.СуммаДокумента);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ФинансыСервер.ОбновитьНадписиРаспеределениеПлатежа(ЭтаФорма, Объект, "ЗачетАванса", ВалютаУчета, ВалютаЗаказаРавнаВалютеДокумента);
	
КонецПроцедуры

&НаСервере
Функция ОпределитьРазличиеВалютыЗаказаИВалютыДокументаНаСервере()
	
	Возврат ФинансыСервер.ОпределитьРазличиеВалютыЗаказаИВалютыДокумента(Объект, "ЗачетАванса");
	
КонецФункции

#КонецОбласти
