
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений;
	
	СтандартнаяОбработка = Ложь;
	
	Если Константы.ТелефонияСтрана.Получить() = Справочники.СтраныМира.Литва Тогда
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС0);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС21);
	Иначе
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС0);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10);
		//ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС22);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС5);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС7);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
