&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ИзменятьВидЦенВДоговорах.Видимость = Объект.ВРазрезеДоговоров;
	Если НЕ Объект.ВРазрезеДоговоров Тогда
		Объект.ИзменятьВидЦенВДоговорах = Ложь;
	КонецЕсли;
	
	Элементы.КатегорииПоОбъемуПродажДоговор.Видимость = Объект.ВРазрезеДоговоров;
	Элементы.КатегорииПоОбъемуПродажТекущийВидЦен.Видимость = Объект.ИзменятьВидЦенВДоговорах;
	Элементы.КатегорииПоОбъемуПродажУстановитьВидЦен.Видимость = Объект.ИзменятьВидЦенВДоговорах;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКатегориюПоСуммеПродаж(СуммаПродаж)
	
	Результат = Справочники.КатегорииКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиКатегорийКонтрагентовСрезПоследних.Категория
	|ИЗ
	|	РегистрСведений.НастройкиКатегорийКонтрагентов.СрезПоследних КАК НастройкиКатегорийКонтрагентовСрезПоследних
	|ГДЕ
	|	НастройкиКатегорийКонтрагентовСрезПоследних.СуммаОт <= &СуммаПродаж
	|	И НастройкиКатегорийКонтрагентовСрезПоследних.СуммаДо > &СуммаПродаж";
	Запрос.УстановитьПараметр("СуммаПродаж", СуммаПродаж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Категория;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьТекущуюКатегориюКонтрагента(Контрагент)
	Возврат Контрагент.Категория;
КонецФункции

&НаСервере
Функция ПолучитьСуммуПродажКонтрагенту(Контрагент, Договор)
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.Контрагент = &Контрагент";
	Если НЕ Договор.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + "
		| И ПродажиОбороты.ДоговорКонтрагента = &ДоговорКонтрагента";
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.СуммаОборот;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КатегорииПоОбъемуПродажКонтрагентПриИзменении(Элемент)
	ТекущиеДанные = Элементы.КатегорииПоОбъемуПродаж.ТекущиеДанные;
	ТекущиеДанные.ТекущаяКатегория = ПолучитьТекущуюКатегориюКонтрагента(ТекущиеДанные.Контрагент);
	ТекущиеДанные.СуммаПродаж = ПолучитьСуммуПродажКонтрагенту(ТекущиеДанные.Контрагент, ТекущиеДанные.Договор);
	ТекущиеДанные.УстановитьКатегорию = ПолучитьКатегориюПоСуммеПродаж(ТекущиеДанные.СуммаПродаж);
	Если НЕ ТекущиеДанные.ТекущаяКатегория = ТекущиеДанные.УстановитьКатегорию Тогда
		ТекущиеДанные.Изменять = Истина;
	КонецЕсли;
	ТекущиеДанные.ТекущийВидЦен = ПолучитьВидЦенДоговора(ТекущиеДанные.Договор);
	ТекущиеДанные.УстановитьВидЦен = ПолучитьВидЦенКатегории(ТекущиеДанные.УстановитьКатегорию);
	
	Если Объект.ИзменятьВидЦенВДоговорах Тогда
		Если НЕ ТекущиеДанные.ТекущийВидЦен = ТекущиеДанные.УстановитьВидЦен Тогда
			ТекущиеДанные.Изменять = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Период.ДатаНачала = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	Объект.Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	ОбновитьЭлементыФормы();
	
	Если ПараметрыСеанса.ОграничиватьПереченьДоступныхКатегорийКонтрагентов Тогда
		Элементы.КатегорииПоОбъемуПродажУстановитьВидЦен.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоГруппе(Команда)
	ГруппаКонтрагентов = ОткрытьФормуМодально("Справочник.Контрагенты.ФормаВыбораГруппы");
	Если ЗначениеЗаполнено(ГруппаКонтрагентов) Тогда 
		ДобавитьПоГруппеНаСервере(ГруппаКонтрагентов);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоГруппеНаСервере(ГруппаКонтрагентов)
	
	Запрос = Новый Запрос;
	Если НЕ Объект.ВРазрезеДоговоров Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент,
		|	Контрагенты.Категория КАК ТекущаяКатегория,
		|	ПродажиОбороты.СуммаОборот КАК СуммаПродаж
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&ПериодНачало, &ПериодОкончание, , ) КАК ПродажиОбороты
		|		ПО Контрагенты.Ссылка = ПродажиОбороты.Контрагент
		|ГДЕ
		|	Контрагенты.Ссылка В ИЕРАРХИИ(&ГруппаКонтрагентов)
		|	И НЕ Контрагенты.ЭтоГруппа";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент,
		|	Контрагенты.Категория КАК ТекущаяКатегория,
		|	ПродажиОбороты.СуммаОборот КАК СуммаПродаж,
		|	ПродажиОбороты.ДоговорКонтрагента КАК Договор
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&ПериодНачало, &ПериодОкончание, , ) КАК ПродажиОбороты
		|		ПО Контрагенты.Ссылка = ПродажиОбороты.Контрагент
		|ГДЕ
		|	Контрагенты.Ссылка В ИЕРАРХИИ(&ГруппаКонтрагентов)
		|	И НЕ Контрагенты.ЭтоГруппа";
	КонецЕсли;
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ПериодОкончание",КонецДня(Объект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ГруппаКонтрагентов", ГруппаКонтрагентов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.КатегорииПоОбъемуПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.УстановитьКатегорию = ПолучитьКатегориюПоСуммеПродаж(НоваяСтрока.СуммаПродаж);
		Если НЕ НоваяСтрока.ТекущаяКатегория = НоваяСтрока.УстановитьКатегорию Тогда
			НоваяСтрока.Изменять = Истина;
		КонецЕсли;
		НоваяСтрока.ТекущийВидЦен = ПолучитьВидЦенДоговора(НоваяСтрока.Договор);
		НоваяСтрока.УстановитьВидЦен = ПолучитьВидЦенКатегории(НоваяСтрока.УстановитьКатегорию);
		Если Объект.ИзменятьВидЦенВДоговорах Тогда
			Если НЕ НоваяСтрока.ТекущийВидЦен = НоваяСтрока.УстановитьВидЦен Тогда
				НоваяСтрока.Изменять = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоПродажамНаСервере()
	
	Запрос = Новый Запрос;
	Если НЕ Объект.ВРазрезеДоговоров Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиОбороты.Контрагент,
		|	ПродажиОбороты.СуммаОборот КАК СуммаПродаж,
		|	ПродажиОбороты.Контрагент.Категория КАК ТекущаяКатегория
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ПериодНачало, &ПериодОкончание, , ) КАК ПродажиОбороты";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиОбороты.Контрагент,
		|	ПродажиОбороты.ДоговорКонтрагента КАК Договор,
		|	ПродажиОбороты.СуммаОборот КАК СуммаПродаж,
		|	ПродажиОбороты.Контрагент.Категория КАК ТекущаяКатегория
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ПериодНачало, &ПериодОкончание, , ) КАК ПродажиОбороты";
	КонецЕсли;
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ПериодОкончание",КонецДня(Объект.Период.ДатаОкончания));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.КатегорииПоОбъемуПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.УстановитьКатегорию = ПолучитьКатегориюПоСуммеПродаж(НоваяСтрока.СуммаПродаж);
		Если НЕ НоваяСтрока.ТекущаяКатегория = НоваяСтрока.УстановитьКатегорию Тогда
			НоваяСтрока.Изменять = Истина;
		КонецЕсли;
		
		НоваяСтрока.ТекущийВидЦен = ПолучитьВидЦенДоговора(НоваяСтрока.Договор);
		НоваяСтрока.УстановитьВидЦен = ПолучитьВидЦенКатегории(НоваяСтрока.УстановитьКатегорию);
		Если Объект.ИзменятьВидЦенВДоговорах Тогда
			Если НЕ НоваяСтрока.ТекущийВидЦен = НоваяСтрока.УстановитьВидЦен Тогда
				НоваяСтрока.Изменять = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоПродажам(Команда)
	ДобавитьПоПродажамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьКатегориюНаСервере()
	
	Для Каждого ТекущаяСтрока Из Объект.КатегорииПоОбъемуПродаж Цикл
		Если ТекущаяСтрока.Изменять и НЕ (ТекущаяСтрока.ТекущаяКатегория = ТекущаяСтрока.УстановитьКатегорию) Тогда
			ЭлементОбъект = ТекущаяСтрока.Контрагент.ПолучитьОбъект();
			ЭлементОбъект.Категория = ТекущаяСтрока.УстановитьКатегорию;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Сообщить("Не удалось изменить категорию контрагента " + ТекущаяСтрока.Контрагент + ". Ошибка: " + ОписаниеОшибки());
			КонецПопытки;   
			ТекущаяСтрока.ТекущаяКатегория = ТекущаяСтрока.Контрагент.Категория;
		КонецЕсли;
		Если Объект.ИзменятьВидЦенВДоговорах Тогда
			Если ТекущаяСтрока.Изменять  и НЕ (ТекущаяСтрока.ТекущийВидЦен = ТекущаяСтрока.УстановитьВидЦен) и НЕ  ТекущаяСтрока.УстановитьВидЦен.Пустая() Тогда
				ЭлементОбъект = ТекущаяСтрока.Договор.ПолучитьОбъект();
				ЭлементОбъект.ВидЦен = ТекущаяСтрока.УстановитьВидЦен;
				Попытка
					ЭлементОбъект.Записать();
				Исключение
					Сообщить("Не удалось изменить вид цен в договоре контрагента " + ТекущаяСтрока.Контрагент + ". Ошибка: " + ОписаниеОшибки());
				КонецПопытки; 
				ТекущаяСтрока.ТекущийВидЦен = ТекущаяСтрока.Договор.ВидЦен;
			КонецЕсли;
		КонецЕсли;
		Если (ТекущаяСтрока.ТекущаяКатегория = ТекущаяСтрока.УстановитьКатегорию) и (ТекущаяСтрока.ТекущийВидЦен = ТекущаяСтрока.УстановитьВидЦен) Тогда
			ТекущаяСтрока.Изменять = Ложь;
		Иначе
			ТекущаяСтрока.Изменять = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКатегорию(Команда)
	ИзменитьКатегориюНаСервере();
	ПоказатьПредупреждение(,"Изменения записаны");
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Объект.КатегорииПоОбъемуПродаж.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого ТекущаяСтрока Из Объект.КатегорииПоОбъемуПродаж Цикл
		Если НЕ (ТекущаяСтрока.ТекущаяКатегория = ТекущаяСтрока.УстановитьКатегорию) Тогда
			ТекущаяСтрока.Изменять = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтметкуВсех(Команда)
	Для Каждого ТекущаяСтрока Из Объект.КатегорииПоОбъемуПродаж Цикл
		ТекущаяСтрока.Изменять = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВРазрезеДоговоровПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИзменятьВидЦенВДоговорахПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура КатегорииПоОбъемуПродажДоговорПриИзменении(Элемент)
	ТекущиеДанные = Элементы.КатегорииПоОбъемуПродаж.ТекущиеДанные;
	ТекущиеДанные.СуммаПродаж = ПолучитьСуммуПродажКонтрагенту(ТекущиеДанные.Контрагент, ТекущиеДанные.Договор);
	ТекущиеДанные.УстановитьКатегорию = ПолучитьКатегориюПоСуммеПродаж(ТекущиеДанные.СуммаПродаж);
	Если НЕ ТекущиеДанные.ТекущаяКатегория = ТекущиеДанные.УстановитьКатегорию Тогда
		ТекущиеДанные.Изменять = Истина;
	КонецЕсли;
	ТекущиеДанные.ТекущийВидЦен = ПолучитьВидЦенДоговора(ТекущиеДанные.Договор);
	ТекущиеДанные.УстановитьВидЦен = ПолучитьВидЦенКатегории(ТекущиеДанные.УстановитьКатегорию);
	
	Если Объект.ИзменятьВидЦенВДоговорах Тогда
		Если НЕ ТекущиеДанные.ТекущийВидЦен = ТекущиеДанные.УстановитьВидЦен Тогда
			ТекущиеДанные.Изменять = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьВидЦенДоговора(Договор)
	Возврат Договор.ВидЦен;
КонецФункции

&НаСервере
Функция ПолучитьВидЦенКатегории(Категория)
	Возврат Категория.ВидЦен;
КонецФункции