Функция MobileLeadGET(Запрос)
	
	СтруктураОтвета = Новый Структура;
	
	Если Не Константы.ИспользуетсяМобильныйКлиентЗамерщика.Получить() Тогда //СОЗДАТЬ ОТДЕЛЬНУЮ КОНСТАНТУ!!!
		
		Ответ = Новый HTTPСервисОтвет(200);
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("message", "Интеграция с мобильным клиентом в программе не подключена");
		СтруктураОтвета.Вставить("error", СтруктураОшибки);
		
	Иначе
		
		Ответ = Новый HTTPСервисОтвет(200);
		ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
		ПользовательБД = ПараметрыСеанса.ТекущийПользователь;
		     		
		//ОБРАБОТКА ЗАПРОСОВ
		
		Если НРЕГ(ИмяМетода) = "leadlist" Тогда
			ФильтрПоСтатусу = Запрос.ПараметрыЗапроса.Получить("statusfilter");
			Если ФильтрПоСтатусу = Неопределено Тогда
				СтруктураОтвета = МобильныйКлиент.ПолучитьСписокЛидов();
			Иначе
				СтруктураОтвета = МобильныйКлиент.ПолучитьСписокЛидов(ФильтрПоСтатусу);
			КонецЕсли;
		ИначеЕсли НРЕГ(ИмяМетода) = "lead" Тогда
			ГУИД = Запрос.ПараметрыЗапроса.Получить("id");
			СтруктураОтвета = МобильныйКлиент.ПолучитьЛид(ГУИД);
		Иначе
			//пришел запрос на неизвестный метод
			Ответ.КодСостояния = 200;
			
			СтруктураОшибки = Новый Структура;
			СтруктураОшибки.Вставить("message", "Получен неизвестный запрос. Вероятно вам следует обновить вашу конфигурацию SC:УПБ");
			СтруктураОтвета.Вставить("error", СтруктураОшибки);
		КонецЕсли; 
		
	КонецЕсли;
	
	//формируем jSON ответ
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета,КодировкаТекста.UTF8);	
	
	Возврат Ответ;

КонецФункции

Функция MobileLeadPOST(Запрос)
	
	СтруктураОтвета = Новый Структура;
	
	Если Не Константы.ИспользуетсяМобильныйКлиентЗамерщика.Получить() Тогда //СОЗДАТЬ ОТДЕЛЬНУЮ КОНСТАНТУ!!!
		
		Ответ = Новый HTTPСервисОтвет(200);
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("message", "Интеграция с мобильным клиентом в программе не подключена");
		СтруктураОтвета.Вставить("error", СтруктураОшибки);
		
	Иначе
		
		Ответ = Новый HTTPСервисОтвет(200);
		
		ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
		ПользовательБД = ПараметрыСеанса.ТекущийПользователь;
		
		
		//ОБРАБОТКА ЗАПРОСОВ
		//Если НРЕГ(ИмяМетода = "zamerresult") Тогда
		//	//запрос на внесение результатов замеров
		//	
		//	ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
		//	
		//	Ответ.КодСостояния = 200;
		//	СтруктураОтвета = МобильныйКлиент.ЗаписатьРезультатыЗамеров(ЗапросОтКлиента, ПользовательБД);
		//	
		//ИначеЕсли НРЕГ(ИмяМетода = "zamerfile") Тогда
		//	//запрос на передачу прикрепленных к замерам файлов
		//	
		//	Ответ.КодСостояния = 200;
		//	СтруктураОтвета = МобильныйКлиент.СохранитьПрикрепленныеДанные(Запрос);
		//	
		//ИначеЕсли НРЕГ(ИмяМетода = "setusertoken") Тогда
		//	//запрос на сохранение пользовательского токена для ПУШ уведомлений
		//	
		//	ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
		//	
		//	Ответ.КодСостояния = 200;
		//	СтруктураОтвета = МобильныйКлиент.СохранитьТокенПользователя(ЗапросОтКлиента, ПользовательБД)
		//	
		//ИначеЕсли НРЕГ(ИмяМетода = "zamerhistory") Тогда
		//	//запрос на внесение результатов замеров
		//	
		//	ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
		//	
		//	Ответ.КодСостояния = 200;
		//	СтруктураОтвета = МобильныйКлиент.ЗаписатьИсториюЛида(ЗапросОтКлиента, ПользовательБД);
		//	
		//ИначеЕсли НРЕГ(ИмяМетода = "offer") Тогда
		//	//запрос на добавление сметы (предварительного расчета)
		//	
		//	ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
		//	
		//	Ответ.КодСостояния = 200;
		//	СтруктураОтвета = МобильныйКлиент.ЗаписатьПредварительныйРасчет(ЗапросОтКлиента, ПользовательБД);
		//	
		//	
		//ИначеЕсли НРЕГ(ИмяМетода = "zamernewdate") Тогда
		//	//запрос на добавление сметы (предварительного расчета)
		//	
		//	ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
		//	
		//	Ответ.КодСостояния = 200;
		//	СтруктураОтвета = МобильныйКлиент.ИзменитьДатуВремяЗамера(ЗапросОтКлиента, ПользовательБД);
		//	
		//ИначеЕсли НРЕГ(ИмяМетода = "setofferasbasic") Тогда
		//	//запрос на установку сметы (предварительного расчета) как основного для лида
		//	
		//	ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
		//	
		//	Ответ.КодСостояния = 200;
		//	СтруктураОтвета = МобильныйКлиент.УстановитьПредварительныйРасчетОсновным(ЗапросОтКлиента, ПользовательБД);
		//	
		//Иначе
		//	
		//	//пришел запрос на неизвестный метод
		//	Ответ.КодСостояния = 200;
		//	
		//	СтруктураОшибки = Новый Структура;
		//	СтруктураОшибки.Вставить("message", "Получен неизвестный запрос. Вероятно вам следует обновить вашу конфигурацию SC:УПБ");
		//	СтруктураОтвета.Вставить("error", СтруктураОшибки);
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
	//формируем jSON ответ
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета,КодировкаТекста.UTF8);	
	
	Возврат Ответ;
	
КонецФункции

