#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьПоставляемыеСтатусы() Экспорт
	
	СтатусОбъект = Справочники.ВидыПродукции.Конструкция.ПолучитьОбъект();
	СтатусОбъект.Префикс = "Конструкция";
	СтатусОбъект.УникальнаяПродукция = Истина;
	СтатусОбъект.СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоШаблону;
	СтатусОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли