&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидСпецификации") Тогда
		ВидСпецификации = Параметры.ВидСпецификации;
	КонецЕсли;
	
	//#12667
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатуры, "ВидСпецификации", ВидСпецификации);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СписокНоменклатуры.ТекущиеДанные <> Неопределено Тогда		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокСпецификаций, "Владелец",
			Элементы.СписокНоменклатуры.ТекущиеДанные.НоменклатураСсылка);
		//#12667
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокСпецификаций, "ВидСпецификации",
			ВидСпецификации);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СоставСпецификации, "Ссылка",
			ПустаяСпецификация());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСпецификацийПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СписокСпецификаций.ТекущиеДанные <> Неопределено Тогда		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СоставСпецификации, "Ссылка",
			Элементы.СписокСпецификаций.ТекущиеДанные.Ссылка);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СоставСпецификации, "Ссылка",
			ПустаяСпецификация());
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПустаяСпецификация()
	Возврат Справочники.Спецификации.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ТекущиеДанные = Элементы.СписокСпецификаций.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбрана спецификация");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект, ТекущиеДанные.Ссылка);
	ПоказатьВводЧисла(ОписаниеОповещения, 1, "Укажите количество");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Сообщить("Не указано количество");
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Спецификация", ДополнительныеПараметры);
	СтруктураОтвета.Вставить("Количество", Результат);
    Закрыть(СтруктураОтвета);
	
КонецПроцедуры;

