
&НаСервере
Процедура СформироватьНаСервере()
    Эл = Элементы.Группа1.ПодчиненныеЭлементы.ПанельНастроек;
    Эл.Пометка = Ложь;
    Элементы.Группа2.Видимость = Эл.Пометка;
    
    Результат.Очистить();
    СКД = ПолучитьИзВременногоХранилища(АдресСКД);
    
    ДР = Новый ДанныеРасшифровкиКомпоновкиДанных;    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    
    Макет = КомпоновщикМакета.Выполнить(СКД, Компоновщик.ПолучитьНастройки(), ДР);

    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(Макет,,ДР);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
    
    ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДР, ЭтаФорма.УникальныйИдентификатор);
	
	Настройки = Компоновщик.ПользовательскиеНастройки;
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет_КПВФ_Настройки", , Настройки);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
     СформироватьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Об = РеквизитФормыВЗначение("Отчет");
    
    Схема = Об.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    
    Источник = Схема.ИсточникиДанных.Добавить();
    Источник.Имя = "ЛокальнаяБаза";
    Источник.СтрокаСоединения = "";
    Источник.ТипИсточникаДанных = "Local";
    НаборДанных = Схема.НаборыДанных[0];
    НаборДанных.Имя = "Таб1";
    НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
    НаборДанных.АвтоЗаполнениеДоступныхПолей = Ложь;
    НаборДанных.Запрос = Об.СформироватьТекстЗапроса();
    
    АдресСКД = ПоместитьВоВременноеХранилище(Схема, ЭтаФорма.УникальныйИдентификатор);
	
	Попытка
    	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
	Исключение
		Сообщить(ОписаниеОшибки());
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	//Компоновщик.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
	Компоновщик.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
	знНастр = ХранилищеНастроекДанныхФорм.Загрузить("Отчет_КПВФ_Настройки");
	Если знНастр <> Неопределено Тогда
		Компоновщик.ЗагрузитьПользовательскиеНастройки(знНастр);	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПанельНастроек(Команда)
    Эл = Элементы.Группа1.ПодчиненныеЭлементы.ПанельНастроек;
    Эл.Пометка = НЕ Эл.Пометка;
    Элементы.Группа2.Видимость = Эл.Пометка;
КонецПроцедуры


&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    ЗначенияКОткрытию = Новый Массив;
    РезультатОбработкаРасшифровкиНаСервере(Расшифровка, ЗначенияКОткрытию);
    Для каждого Значение Из ЗначенияКОткрытию Цикл
    	ПоказатьЗначение(,Значение);
    КонецЦикла; 
КонецПроцедуры


&НаСервере
Процедура РезультатОбработкаРасшифровкиНаСервере(Расшифровка, ЗначенияКОткрытию)
    ДР = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
    Эл = ДР.Элементы.Получить(Расшифровка);
    Если Эл <> Неопределено Тогда
        Поля = Эл.ПолучитьПоля();
        Для каждого Поле Из Поля Цикл
            Если Поле.Значение <> Null Тогда
                ЗначенияКОткрытию.Добавить(Поле.Значение);	
            КонецЕсли;         	
        КонецЦикла; 
    КонецЕсли;     
КонецПроцедуры

&НаСервере
Процедура СтандартныеНастройкиНаСервере()
	Схема = ПолучитьИзВременногоХранилища(АдресСКД);
	Компоновщик.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	Настройки = Компоновщик.ПользовательскиеНастройки;
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет_КПВФ_Настройки", , Настройки);
КонецПроцедуры

&НаКлиенте
Процедура СтандартныеНастройки(Команда)
	СтандартныеНастройкиНаСервере();
КонецПроцедуры


 

