
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	Элементы.СписокПодразделение.Видимость = ИспПодразделения;
	
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаКонца", Параметры.Дата);
	Список.Параметры.УстановитьЗначениеПараметра("ИсклЗаказы", Параметры.ИсклЗаказы);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	рез = новый Структура("ЗП, Выплачено");
	ЗаполнитьЗначенияСвойств(рез, Элемент.текущиеДанные);
	
	Закрыть(рез);
КонецПроцедуры
