&НаКлиенте
Процедура УстановитьВидимость()
	Эл = ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаВсеРеквизиты;
	Элементы.ГруппаВсе.Видимость = Эл.Пометка;
    
    Элементы.ГруппаУсловия.Видимость = Объект.Тип = ПредопределенноеЗначение("Перечисление.ИА_БПТипыТочекМаршрута.Условие")
    И Объект.ПрограммнаяОбработка;
    
    Элементы.ГруппаДлительность.Видимость = ИспользоватьДлительностьЗадач
    И НЕ Объект.ЭтоУведомление
    И (Объект.Тип = ПредопределенноеЗначение("Перечисление.ИА_БПТипыТочекМаршрута.Действие")
    ИЛИ Объект.Тип = ПредопределенноеЗначение("Перечисление.ИА_БПТипыТочекМаршрута.Условие"));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСобытия()
	Массив = Справочники.ИА_БПТочкиМаршрута.ПолучитьМассивСобытий(Объект.Тип);
    Для каждого Эл Из Массив Цикл
        М = Объект.Обработчики.НайтиСтроки(Новый Структура("Событие", Эл));
    	Если М.Количество() = 0 Тогда
        	Объект.Обработчики.Добавить().Событие = Эл
        КонецЕсли; 
    КонецЦикла; 
    
    Справочники.ИА_БПТочкиМаршрута.ЗаполнитьЗначенияОбработчиковПоУмолчаниюВТочке(Объект);
    
    
    Элементы.ГруппаОбработчики.Видимость = Объект.Обработчики.Количество() > 0;
КонецПроцедуры
 
&НаСервере
Процедура ЗагрузитьДанныеХранилищ()
    ОбъектДанных = РеквизитФормыВЗначение("Объект");
    
    ТаблицаХранилищ.Очистить();
    
    Для каждого СтрокаТЧ Из ОбъектДанных.Обработчики Цикл
        ХЗ = СтрокаТЧ.ХранилищеДанных.Получить();
        ЗаписатьДанныеВТаблицХранилищ(СтрокаТЧ.Событие, ХЗ);
    КонецЦикла; 
    
    
    ХранилищеДопРеквизиты.Очистить();
    
    Для каждого Стр Из ОбъектДанных.РеквизитыВложенногоБП Цикл
    	ХЗ = Стр.ХранилищеДанных.Получить();
        Если ХЗ <> Неопределено Тогда
        	ЗаписатьДанныеВХранилищеДопРеквизиты(Стр.Реквизит, ХЗ);
        КонецЕсли; 
    КонецЦикла;  
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоРеквизитов_ИзМД()
    ПараметрыЗапроса = Новый Структура("ВложНФ", Объект.МаршрутЗадачВложенногоБП); 
    ТабРеквизиты = ИА_БФС.Запрос_ВыполнитьВТЗ(
    //#Область ТекстЗапроса
    "ВЫБРАТЬ
    |	ИА_БПРеквизиты.Ссылка КАК Реквизит,
    |	ИА_БПРеквизиты.Родитель,
    |	ИА_БПРеквизиты.ЗначениеПоУмолчанию,
    |	ИА_БПРеквизиты.ЭтоГруппа
    |ИЗ
    |	ПланВидовХарактеристик.ИА_БПРеквизиты КАК ИА_БПРеквизиты
    |ГДЕ
    |	ИА_БПРеквизиты.ВладелецРеквизита = &ВложНФ"
    //#КонецОбласти 
    , ПараметрыЗапроса); 
    
    Таб = Объект.РеквизитыВложенногоБП.Выгрузить();
    Таб.Колонки.Добавить("ДеревоИдентификаторСтроки");
    Таб.Колонки.Добавить("ДеревоИдентификаторРодителя");
    Таб.Колонки.Добавить("ЭтоГруппа");
    Таб.Колонки.Добавить("ЗначениеПоУмолчанию");
    Таб.Колонки.Добавить("Родитель");
    ИА_БФС.ТЗ_ЗаполнитьПоТаблице(ТабРеквизиты, Таб);
    
    Для каждого Стр Из Таб Цикл
    	Стр.ДеревоИдентификаторСтроки   = ""+Стр.Реквизит.УникальныйИдентификатор();
        Если ЗначениеЗаполнено(Стр.Родитель) Тогда
        	Стр.ДеревоИдентификаторРодителя = ""+Стр.Родитель.УникальныйИдентификатор();
        Иначе
            Стр.ДеревоИдентификаторРодителя = "";
        КонецЕсли; 
        
        М = Объект.РеквизитыВложенногоБП.НайтиСтроки(Новый Структура("Реквизит", Стр.Реквизит));
        Если М.Количество() > 0 Тогда
        	СтрокаТЧ = М [0];
            ЗаполнитьЗначенияСвойств(Стр, СтрокаТЧ);
        ИначеЕсли НЕ Стр.ЭтоГруппа Тогда
            Стр.СпособЗаполнения = Перечисления.ИА_БПСпособыЗаполненияДопРеквизитов.НеИзменять;
        КонецЕсли; 
    КонецЦикла; 
    
    
    ДЗ = РеквизитФормыВЗначение("ДеревоРеквизитов");
    ДЗ = ИА_БФС.ТЗ2ДЗ(Таб, ДЗ);
    
    ЗначениеВРеквизитФормы(ДЗ, "ДеревоРеквизитов");
    
    Элементы.ГруппаДопРеквизитыВложенногоБП.Видимость = Таб.Количество() > 0;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоРеквизитов()
	Для каждого СтрокаД Из ДеревоРеквизитов.ПолучитьЭлементы() Цикл
    	ИД = СтрокаД.ПолучитьИдентификатор();
        Элементы.ДеревоРеквизитов.Развернуть(ИД,Истина);
    КонецЦикла; 
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПустыхНастроек(Событие)
    СКД = Справочники.ИА_БПТочкиМаршрута.ПолучитьМакет("СКДДляОбработчиков");
    Опции = Новый Структура("Настройки, СообщениеЕслиУсловиеНеВыполнено"
    , СКД.НастройкиПоУмолчанию, "");
    Возврат Опции;
КонецФункции


&НаСервере
Функция ПодготовитьДаныеДляСпецРедактора(Событие)
    Результат = Неопределено;
    
    Если ТипЗнч(Событие) = Тип("ПланВидовХарактеристикСсылка.ИА_БПРеквизиты") Тогда
        // Редактор формул для реквизита
        Результат = Новый Структура("ДанныеФормулы, Уникальность"
                , ПодготовитьФормулуДляРедактора(Событие)
                , "РЕКВИЗИТ_" + Событие.УникальныйИдентификатор());
    ИначеЕсли Событие = Перечисления.ИА_БПСобытияТочекБП.ФормированиеНаименования
        ИЛИ Событие = Перечисления.ИА_БПСобытияТочекБП.ФормированиеСодержания
        ИЛИ Событие = Перечисления.ИА_БПСобытияТочекБП.УстановкаОтветственного
        Тогда
        // Редактор формул
        Результат = Новый Структура("ДанныеФормулы, Уникальность"
                , ПодготовитьФормулуДляРедактора(Событие)
                , "" + ИА_БФС.Перечисление_Имя(Событие));
                
    ИначеЕсли Событие = Перечисления.ИА_БПСобытияТочекБП.Действие_ПриВыполнении
        ИЛИ Событие = Перечисления.ИА_БПСобытияТочекБП.Условие_ПроверкаУсловия
        Тогда
        // Редактор СКД
        СКД = Справочники.ИА_БПТочкиМаршрута.ПолучитьМакет("СКДДляОбработчиков");
        М = ТаблицаХранилищ.НайтиСтроки(Новый Структура("Событие", Событие) );
        Если М.Количество() > 0 И ЭтоАдресВременногоХранилища(М[0].Адрес) Тогда
            Опции = ПолучитьИзВременногоХранилища(М[0].Адрес);
        Иначе
            Опции = ПолучитьСтруктуруПустыхНастроек(Событие);
        КонецЕсли; 
        
        Эл = СКД.Параметры.Найти("ВладелецРеквизитов");
        Если Эл <> Неопределено Тогда
            Эл.Значение = Объект.Владелец.МаршрутЗадач;
        КонецЕсли; 
        
        Данные = Новый Структура("СКД, ИДОтбора, Заголовок, Настройки, СообщениеЕслиУсловиеНеВыполнено"
        , СКД, ИА_БФС.Перечисление_Имя(Событие)
        , "Конструктор условия """ + Событие + """");
        Если Опции <> Неопределено Тогда
            ЗаполнитьЗначенияСвойств(Данные, Опции);	
        КонецЕсли;     
        
        Если Событие = Перечисления.ИА_БПСобытияТочекБП.Условие_ПроверкаУсловия Тогда
            Данные.Удалить("СообщениеЕслиУсловиеНеВыполнено");
        КонецЕсли; 
        Результат = ПоместитьВоВременноеХранилище(Данные);
    КонецЕсли; 
	
    Возврат Результат;
КонецФункции

&НаСервере
Функция ПодготовитьФормулуДляРедактора(Событие)
	Результат = ИА_БФКС.РедакторФормул_СформироватьПустуюФормулу();
    
    ЭтоФормулаРеквизита = ТипЗнч(Событие) = Тип("ПланВидовХарактеристикСсылка.ИА_БПРеквизиты");
    ЭтоСобытие          = ТипЗнч(Событие) = Тип("ПеречислениеСсылка.ИА_БПСобытияТочекБП");
    
    Если  ЭтоФормулаРеквизита Тогда
    	Результат.Вид = Перечисления.ИА_БФФормулыТип.ОдноЗначение;
        Результат.ОбработкаПроверкиФормулы = "ИА_БПС.ПроверкаФормулыДляУстановкиЗначенияРеквизита(Контекст)";
    ИначеЕсли Событие = Перечисления.ИА_БПСобытияТочекБП.УстановкаОтветственного Тогда
    	Результат.Вид = Перечисления.ИА_БФФормулыТип.ОдноЗначение;
        Результат.ОбработкаПроверкиФормулы = "ИА_БПС.ПроверкаФормулыДляУстановкиОтветственного(Контекст)";
    Иначе
        Результат.Вид = Перечисления.ИА_БФФормулыТип.Строка;
    КонецЕсли; 
    
    Результат.Переменные = ИА_БПС.СформироватьТаблицуПеременных(Объект.Владелец.МаршрутЗадач);
    
    
    Если ЭтоСобытие Тогда
        Таб = ИА_БФС.ТЗ_ФильтрПоОтбору(ТаблицаХранилищ, Новый Структура("Событие", Событие));
        Если Таб.Количество() > 0 И ЭтоАдресВременногоХранилища(Таб[0].Адрес) Тогда
            Данные = ПолучитьИзВременногоХранилища(Таб[0].Адрес);
            Если Данные <> Неопределено Тогда
                Результат.СоставФормулы = Данные.СоставФормулы;
            Иначе
                Результат.СоставФормулы = Новый Массив;
            КонецЕсли; 
        Иначе
            Результат.СоставФормулы = Новый Массив;
        КонецЕсли;
    ИначеЕсли ЭтоФормулаРеквизита Тогда
        Таб = ИА_БФС.ТЗ_ФильтрПоОтбору(ХранилищеДопРеквизиты, Новый Структура("Реквизит", Событие));
        Если Таб.Количество() > 0 И ЭтоАдресВременногоХранилища(Таб[0].Адрес) Тогда
            Данные = ПолучитьИзВременногоХранилища(Таб[0].Адрес);
            Если Данные <> Неопределено Тогда
                Результат.СоставФормулы = Данные.СоставФормулы;
            Иначе
                Результат.СоставФормулы = Новый Массив;
            КонецЕсли; 
        Иначе
            Результат.СоставФормулы = Новый Массив;
        КонецЕсли;
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкиОтбораСКД(ВЗ)
	Данные = ИА_БФС.ОтборСКД_ПолучитьДанные(ВЗ);
    
    Опции = Новый Структура("Настройки, СообщениеЕслиУсловиеНеВыполнено");
    ЗаполнитьЗначенияСвойств(Опции, Данные);
    ЗаписатьДанныеВТаблицХранилищ(Перечисления.ИА_БПСобытияТочекБП[Данные.ИДОтбора], Опции);
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДляРедатора(Событие)
    Результат = Новый Структура("ИД, Текст, ТекстСправки", ИА_БФС.Перечисление_Имя(Событие)
    , ""
    , ИА_БПС.Обработчики_ПолучитьСправку(Событие));
    
    М = Объект.Обработчики.НайтиСтроки(Новый Структура("Событие", Событие));
    Если М.Количество() > 0 Тогда
    	Результат.Текст = М[0].Код;
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции
 
&НаСервере
Процедура ЗагрузитьДанныеРедактора(ДанныеРедактора)
    Для каждого СтрокаК Из Объект.Обработчики Цикл
        Если ИА_БФС.Перечисление_Имя(СтрокаК.Событие) = ДанныеРедактора.ИД Тогда
        	СтрокаК.Код = ДанныеРедактора.Текст;
            Прервать;
        КонецЕсли; 
    КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеРедактораФормул(ВыбранноеЗначение)
    Данные = ИА_БФКС.РедакторФормул_ИзВыбЗначенияПолучитьДанныеФормулы(ВыбранноеЗначение);
    
    Если Лев(ВыбранноеЗначение.Уникальность, 9) = "РЕКВИЗИТ_" Тогда
    	// Это событие
        ИД = Сред(ВыбранноеЗначение.Уникальность, 10);
        Реквизит = ПланыВидовХарактеристик.ИА_БПРеквизиты.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));
        ЗаписатьДанныеВХранилищеДопРеквизиты(Реквизит, Данные);
    Иначе
        Событие = Перечисления.ИА_БПСобытияТочекБП[ВыбранноеЗначение.Уникальность];
        ЗаписатьДанныеВТаблицХранилищ(Событие, Данные);
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВТаблицХранилищ(Событие, Данные)
    М = ТаблицаХранилищ.НайтиСтроки(Новый Структура("Событие", Событие));
    Если М.Количество() > 0 Тогда
        СтрокаК = М[0];
    Иначе
        СтрокаК = ТаблицаХранилищ.Добавить();
    КонецЕсли; 
    СтрокаК.Событие = Событие;
    СтрокаК.Адрес = ПоместитьВоВременноеХранилище(Данные, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВХранилищеДопРеквизиты(Реквизит, Данные)
    М = ХранилищеДопРеквизиты.НайтиСтроки(Новый Структура("Реквизит", Реквизит));
    Если М.Количество() > 0 Тогда
        СтрокаК = М[0];
    Иначе
        СтрокаК = ХранилищеДопРеквизиты.Добавить();
    КонецЕсли; 
    СтрокаК.Реквизит = Реквизит;
    СтрокаК.Адрес = ПоместитьВоВременноеХранилище(Данные, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры
 

&НаСервере
Функция СформироватьСписокДоступныхОбработчиков(Событие)
	М = ИА_БПС.Обработчики_ПолучитьСписокДоступныхВариантовДляТипаТочки(Объект.Тип, Событие);
    
    Возврат ИА_БФКС.Массив2СписокЗначений(М);
КонецФункции
 

&НаКлиенте
Процедура ЗаполнитьПредставление()
	Для каждого СтрокаК Из Объект.Обработчики Цикл
    	Если СтрокаК.Обработчик = ПредопределенноеЗначение("Перечисление.ИА_БПВариантыОбработчиков.ПрограммныйОбработчик") Тогда
        	СтрокаК.Представление = СтрокаК.Код;
    	ИначеЕсли СтрокаК.Обработчик = ПредопределенноеЗначение("Перечисление.ИА_БПВариантыОбработчиков.КонструкторУсловия") Тогда
        	СтрокаК.Представление = "<<Условие>>";
        Иначе
            СтрокаК.Представление = "";
        КонецЕсли; 
    КонецЦикла; 
КонецПроцедуры
 
//_____________________________________________________________

&НаСервере
Процедура ЗаполнитьВходящие()
    ТабВходящие.Очистить();
    М = Справочники.ИА_БПТочкиМаршрута.ПолучитьВходящиеТочки(Объект.Ссылка);	
    Для каждого Точка Из М Цикл
        ТабВходящие.Добавить().Адрес = Точка;
    КонецЦикла; 
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если НЕ ИА_Защита_Общий.ЛицензияДоступна("НФ", Отказ) Тогда Возврат КонецЕсли; 
    
    Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
    	Объект.Ответственный = Перечисления.ИА_БПТипыАдресацииЗадач.ОтветственныйЗаБП;        
    КонецЕсли; 
    
    УстановитьНеизменяемыеПараметры();

    
    МаршрутЗадач = Объект.Владелец.МаршрутЗадач;
    
    Элементы.ДеревоРеквизитов.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
    ЗагрузитьДанныеХранилищ();
    
    ЗаполнитьВходящие();
    ЗаполнитьСобытия();
    
    мен = Перечисления.ИА_БПТипыТочекМаршрута;
    МассивЗаполняемыхТочек = Новый Массив;
    МассивЗаполняемыхТочек.Добавить(мен.Действие);
    МассивЗаполняемыхТочек.Добавить(мен.Условие);
    МассивЗаполняемыхТочек.Добавить(мен.ВложенныйБизнесПроцесс);
    
    
    Элементы.ГруппаРеквизитыТочки.Видимость = МассивЗаполняемыхТочек.Найти(Объект.Тип) <> Неопределено;
    
    Если Объект.Тип = мен.ВложенныйБизнесПроцесс Тогда
    	Элементы.ЭтоУведомление.Видимость       = Ложь;
        Элементы.ГруппаДлительность.Видимость   = Ложь;
        Элементы.ГруппаВложенныйБП.Видимость    = Истина;
        Элементы.МаршрутЗадачВложенногоБП.Заголовок = "Запуск БП с " + Метаданные.Справочники.ИА_БПМаршрутЗадач.ПредставлениеОбъекта;
        ЗаполнитьДеревоРеквизитов_ИзМД();
    Иначе
        Элементы.ГруппаВложенныйБП.Видимость = Ложь;
    КонецЕсли; 
    
    Параметры.Свойство("РежимПакета",  РежимПакета);
    Параметры.Свойство("ДанныеПакета", ДанныеПакета);
    
    Контекст = Новый Структура("Параметры, Объект, Форма", Параметры, Объект, ЭтаФорма);
    ИА_БПСПереопределяемый.Формы_Точка_Форма_ПриСозданииНаСервере(Контекст);
КонецПроцедуры

&НаСервере
Процедура УстановитьНеизменяемыеПараметры()
    Настройки = ИА_БПС.ОбщиеНастройкиБП();
    
    Элементы.ТипЗадачи.Видимость          = Настройки.ТипыЗадач;
    ИспользоватьДлительностьЗадач         = Настройки.ДлительностьЗадач;
    Элементы.ГруппаДлительность.Видимость = ИспользоватьДлительностьЗадач;
    
    
    Элементы.ВыводимыеРеквизиты.Видимость = Справочники.ИА_БПМаршрутЗадач.ЕстьДопРеквизиты(Объект.Владелец.МаршрутЗадач);
КонецПроцедуры


&НаКлиенте
Процедура ИсходящиеЛинииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    Если Найти(Поле.Имя, "Вариант") > 0 Тогда
        ПоказатьЗначение(,Элементы.ИсходящиеЛинии.ТекущиеДанные.Вариант);
    Иначе
        ПоказатьЗначение(,Элементы.ИсходящиеЛинии.ТекущиеДанные.Адрес);	
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура ТабВходящиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    ПоказатьЗначение(,Элементы.ТабВходящие.ТекущиеДанные.Адрес);
КонецПроцедуры

&НаКлиенте
Процедура ВсеРеквизиты(Команда)
	Эл = ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаВсеРеквизиты;
	Эл.Пометка = НЕ Эл.Пометка;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    БылоСохранениеДанных = Истина;
    ЗагрузитьДанныеХранилищ();
    ЗаполнитьПредставление();
    
    ОповеститьОбИзменении(Объект.Ссылка);
	Оповестить("ОбновитьКарты", Объект.Владелец);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиКодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    // Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиПриИзменении(Элемент)
    ОбработчикиПриИзмененииНаСервере();
    УстановитьВидимость();
    ЗаполнитьПредставление();
КонецПроцедуры

&НаСервере
Процедура ОбработчикиПриИзмененииНаСервере()
	ОбъектДанных = РеквизитФормыВЗначение("Объект");
    ОбъектДанных.ЗаполнитьСвязанныеРеквизиты();
    ЗначениеВРеквизитФормы(ОбъектДанных, "Объект");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимость();
    ЗаполнитьПредставление();
    РазвернутьДеревоРеквизитов();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    Таб = ИА_БФС.ДЗ2ТЗ(РеквизитФормыВЗначение("ДеревоРеквизитов"));
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(Таб, "СтрокаТЗ.ЭтоГруппа");
    
    ТекущийОбъект.РеквизитыВложенногоБП.Загрузить(Таб);
    
    Для каждого СтрокаТЗ Из ТаблицаХранилищ Цикл
        НайдСтрока = ТекущийОбъект.Обработчики.Найти(СтрокаТЗ.Событие, "Событие");
        Если НайдСтрока <> Неопределено Тогда
            Данные = ПолучитьИзВременногоХранилища(СтрокаТЗ.Адрес);
            НайдСтрока.ХранилищеДанных = Новый ХранилищеЗначения(Данные);
        КонецЕсли; 
    КонецЦикла; 
    
    Для каждого СтрокаТЗ Из ХранилищеДопРеквизиты Цикл
        НайдСтрока = ТекущийОбъект.РеквизитыВложенногоБП.Найти(СтрокаТЗ.Реквизит, "Реквизит");
        Если НайдСтрока <> Неопределено Тогда
            Данные = ПолучитьИзВременногоХранилища(СтрокаТЗ.Адрес);
            НайдСтрока.ХранилищеДанных = Новый ХранилищеЗначения(Данные);
        КонецЕсли; 
    КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    ЗагрузитьДанныеХранилищ();    
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    СтандартнаяОбработка = Истина;
    
    ТекСтрока = Элементы.Обработчики.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        Если ТекСтрока.Событие = ПредопределенноеЗначение("Перечисление.ИА_БПСобытияТочекБП.Действие_ПриВыполнении")
            ИЛИ ТекСтрока.Событие = ПредопределенноеЗначение("Перечисление.ИА_БПСобытияТочекБП.Условие_ПроверкаУсловия")
            Тогда
            
            Если ТекСтрока.Обработчик = ПредопределенноеЗначение("Перечисление.ИА_БПВариантыОбработчиков.ПрограммныйОбработчик") Тогда
                ИА_БФК.РедакторТекста_Открыть(ПодготовитьДанныеДляРедатора(ТекСтрока.Событие), ЭтаФорма);
            ИначеЕсли ТекСтрока.Обработчик = ПредопределенноеЗначение("Перечисление.ИА_БПВариантыОбработчиков.КонструкторУсловия") Тогда
                ИА_БФК.ОтборСКД_ОткрытьРедакторСКД(ПодготовитьДаныеДляСпецРедактора(ТекСтрока.Событие), ЭтаФорма);
            КонецЕсли; 
            
        ИначеЕсли ТекСтрока.Событие = ПредопределенноеЗначение("Перечисление.ИА_БПСобытияТочекБП.ФормированиеНаименования")
            ИЛИ ТекСтрока.Событие = ПредопределенноеЗначение("Перечисление.ИА_БПСобытияТочекБП.ФормированиеСодержания")
            Тогда
            
            Если ТекСтрока.Обработчик = ПредопределенноеЗначение("Перечисление.ИА_БПВариантыОбработчиков.ПрограммныйОбработчик") Тогда
                ИА_БФК.РедакторТекста_Открыть(ПодготовитьДанныеДляРедатора(ТекСтрока.Событие), ЭтаФорма);
            ИначеЕсли ТекСтрока.Обработчик = ПредопределенноеЗначение("Перечисление.ИА_БПВариантыОбработчиков.КонструкторУсловия") Тогда
                ИА_БФК.РедакторФормул_Открыть(ПодготовитьДаныеДляСпецРедактора(ТекСтрока.Событие), ЭтаФорма);
            КонецЕсли; 
        ИначеЕсли ТекСтрока.Событие = ПредопределенноеЗначение("Перечисление.ИА_БПСобытияТочекБП.УстановкаОтветственного") Тогда
            
            Если ТекСтрока.Обработчик = ПредопределенноеЗначение("Перечисление.ИА_БПВариантыОбработчиков.ПрограммныйОбработчик") Тогда
                ИА_БФК.РедакторТекста_Открыть(ПодготовитьДанныеДляРедатора(ТекСтрока.Событие), ЭтаФорма);
            ИначеЕсли ТекСтрока.Обработчик = ПредопределенноеЗначение("Перечисление.ИА_БПВариантыОбработчиков.КонструкторУсловия") Тогда
                ИА_БФК.РедакторФормул_Открыть(ПодготовитьДаныеДляСпецРедактора(ТекСтрока.Событие), ЭтаФорма);
            КонецЕсли; 
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
    Если ИА_БФК.ОтборСКД_ВыбраноЗначение(ВыбранноеЗначение) Тогда
    	ЗагрузитьНастройкиОтбораСКД(ВыбранноеЗначение);
        ЗаполнитьПредставление();
        Модифицированность = Истина;
    ИначеЕсли ИА_БФК.РедакторТекста_ВыбраноЗначение(ВыбранноеЗначение) Тогда
        ДанныеРедактора = ИА_БФК.РедакторТекста_ПолучитьРезультат(ВыбранноеЗначение);
        Если ДанныеРедактора <> Неопределено Тогда
        	ЗагрузитьДанныеРедактора(ДанныеРедактора);
            ЗаполнитьПредставление();
            Модифицированность = Истина;
        КонецЕсли; 
    ИначеЕсли ИА_БФКС.РедакторФормул_ВыбраноЗначение(ВыбранноеЗначение) Тогда
        Модифицированность = Истина;
        ЗагрузитьДанныеРедактораФормул(ВыбранноеЗначение);
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
//    ЗаполнитьПредставление();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиОбработчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    ДанныеВыбора = СформироватьСписокДоступныхОбработчиков(Элемент.Родитель.ТекущиеДанные.Событие);
    СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиОбработчикПриИзменении(Элемент)
    ТекСтрока = Элементы.Обработчики.ТекущиеДанные;
    ТекОбработчик = ТекСтрока.Обработчик;
    
    //Если ТекОбработчик = ПредопределенноеЗначение("Перечисление.ИА_БПВариантыОбработчиков.КонструкторУсловия") Тогда
    //	СоздатьСтрокуВХранилищеЕслиНет(ТекСтрока.Событие);
    //КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
    // Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
    Если РежимПакета И БылоСохранениеДанных Тогда
    	Оповестить("ИА_ТочкаКМИзменена", Новый Структура("Точка, ВладелецФормы, ДанныеПакета"
        , Объект.Ссылка
        , ЭтаФорма.ВладелецФормы
        , ДанныеПакета));
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЭтоУведомлениеПриИзменении(Элемент)
    УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовПриИзменении(Элемент)
    ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовПриАктивизацииЯчейки(Элемент)
    ТекСтрока = Элемент.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        ПодчЭлементы = Элементы.ДеревоРеквизитов.ПодчиненныеЭлементы;
        ПодчЭлементы.ДеревоРеквизитовСпособЗаполнения.ТолькоПросмотр     = ТекСтрока.ЭтоГруппа;
        ПодчЭлементы.ДеревоРеквизитовЗначение.ТолькоПросмотр             = ТекСтрока.ЭтоГруппа;
        
        Если НЕ ТекСтрока.ЭтоГруппа Тогда
            Мен = "Перечисление.ИА_БПСпособыЗаполненияДопРеквизитов.";
            Если ТекСтрока.СпособЗаполнения = ПредопределенноеЗначение(мен + "НеИзменять") Тогда
                ПодчЭлементы.ДеревоРеквизитовЗначение.ТолькоПросмотр             = Истина;
            ИначеЕсли ТекСтрока.СпособЗаполнения = ПредопределенноеЗначение(мен + "Установить") Тогда
                ПодчЭлементы.ДеревоРеквизитовЗначение.ФорматРедактирования       = "";
            ИначеЕсли ТекСтрока.СпособЗаполнения = ПредопределенноеЗначение(мен + "Перенести") Тогда
                ПодчЭлементы.ДеревоРеквизитовЗначение.ФорматРедактирования       = "ДФ=''; БЛ=''; БИ=''";
            КонецЕсли; 
        КонецЕсли; 
        
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовСпособЗаполненияПриИзменении(Элемент)
    ТекСтрока = Элементы.ДеревоРеквизитов.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        мен = "Перечисление.ИА_БПСпособыЗаполненияДопРеквизитов.";
        Если ТекСтрока.СпособЗаполнения = ПредопределенноеЗначение(мен + "ПустаяСсылка") Тогда
        	ТекСтрока.СпособЗаполнения = ПредопределенноеЗначение(мен + "НеИзменять");
        КонецЕсли; 
    	Если ТекСтрока.СпособЗаполнения = ПредопределенноеЗначение(мен + "НеИзменять") Тогда
            ТекСтрока.Значение = Неопределено;
    	ИначеЕсли ТекСтрока.СпособЗаполнения = ПредопределенноеЗначение(мен + "Установить") Тогда
    	ИначеЕсли ТекСтрока.СпособЗаполнения = ПредопределенноеЗначение(мен + "Перенести") Тогда
            ТекСтрока.Значение = Неопределено;
        КонецЕсли; 
    КонецЕсли; 
     
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовРеквизитРодительскийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    // Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура МаршрутЗадачВложенногоБППриИзменении(Элемент)
    МаршрутЗадачВложенногоБППриИзмененииНаСервере();
    РазвернутьДеревоРеквизитов();
КонецПроцедуры

&НаСервере
Процедура МаршрутЗадачВложенногоБППриИзмененииНаСервере()
    Объект.РеквизитыВложенногоБП.Очистить();
    ЗаполнитьДеревоРеквизитов_ИзМД();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    ТекСтрока = Элементы.ДеревоРеквизитов.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        Если ТекСтрока.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.ИА_БПСпособыЗаполненияДопРеквизитов.Перенести") Тогда
            СтандартнаяОбработка = Ложь;
            ИА_БФК.РедакторФормул_Открыть(ПодготовитьДаныеДляСпецРедактора(ТекСтрока.Реквизит), ЭтаФорма);
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры
