
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаКонтрагентовИзExcel.Форма.ФормаЗагрузкиВзаиморасчетов" Тогда	
		ЗагрузитьИзExcelЗавершение(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УменьшениеДолгаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УменьшениеДолга.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Валюта.Пустая() тогда
		ТекущиеДанные.Валюта = ПолучитьВалютуУчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличениеДолгаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УвеличениеДолга.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Валюта.Пустая() тогда
		ТекущиеДанные.Валюта = ПолучитьВалютуУчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшениеДолгаПоставщиковПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УменьшениеДолгаПоставщиков.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Валюта.Пустая() тогда
		ТекущиеДанные.Валюта = ПолучитьВалютуУчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличениеДолгаПоставщиковПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УвеличениеДолгаПоставщиков.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Валюта.Пустая() тогда
		ТекущиеДанные.Валюта = ПолучитьВалютуУчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличениеДолгаКонтрагентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УвеличениеДолга.ТекущиеДанные;
	
	Если ТекущиеДанные.Договор.Пустая() Тогда
		//если у Контрагента только один договор, то его заполняем автоматически
		ТекущиеДанные.Договор = ПолучитьДоговорПоУмолчанию(ТекущиеДанные.Контрагент);
		Если НЕ ТекущиеДанные.Договор.Пустая() Тогда 
			//перепрыгиваем на Сумму
			Элементы.УвеличениеДолга.ТекущийЭлемент = Элементы.УвеличениеДолгаСумма;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшениеДолгаКонтрагентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УменьшениеДолга.ТекущиеДанные;
	
	Если ТекущиеДанные.Договор.Пустая() Тогда
		//если у Контрагента только один договор, то его заполняем автоматически
		ТекущиеДанные.Договор = ПолучитьДоговорПоУмолчанию(ТекущиеДанные.Контрагент);
		Если НЕ ТекущиеДанные.Договор.Пустая() Тогда 
			//перепрыгиваем на Сумму
			Элементы.УменьшениеДолга.ТекущийЭлемент = Элементы.УменьшениеДолгаСумма;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличениеДолгаПоставщиковКонтрагентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УвеличениеДолгаПоставщиков.ТекущиеДанные;
	
	Если ТекущиеДанные.Договор.Пустая() Тогда
		//если у Контрагента только один договор, то его заполняем автоматически
		ТекущиеДанные.Договор = ПолучитьДоговорПоУмолчанию(ТекущиеДанные.Контрагент);
		Если НЕ ТекущиеДанные.Договор.Пустая() Тогда 
			//перепрыгиваем на Сумму
			Элементы.УвеличениеДолгаПоставщиков.ТекущийЭлемент = Элементы.УвеличениеДолгаСумма;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшениеДолгаПоставщиковКонтрагентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УменьшениеДолгаПоставщиков.ТекущиеДанные;
	
	Если ТекущиеДанные.Договор.Пустая() Тогда
		//если у Контрагента только один договор, то его заполняем автоматически
		ТекущиеДанные.Договор = ПолучитьДоговорПоУмолчанию(ТекущиеДанные.Контрагент);
		Если НЕ ТекущиеДанные.Договор.Пустая() Тогда 
			//перепрыгиваем на Сумму
			Элементы.УменьшениеДолгаПоставщиков.ТекущийЭлемент = Элементы.УменьшениеДолгаСумма;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	
	ИмяТЧУвеличение = "УвеличениеДолга";
	ИмяТЧУменьшение = "УменьшениеДолга";
	
	Если Команда.Имя = "ЗагрузитьИзExcelРасчетыСПоставщиками" Тогда
		ИмяТЧУвеличение = "УвеличениеДолгаПоставщиков";
		ИмяТЧУменьшение = "УменьшениеДолгаПоставщиков";
	КонецЕсли;
		
	Если Объект[ИмяТЧУвеличение].Количество() + Объект[ИмяТЧУменьшение].Количество() > 0 Тогда
		ОписаниеОповещения = новый ОписаниеОповещения("ЗагрузитьИзExcelПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Очистить таблицы перед загрузкой?", РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ЗагрузитьИзExcelФрагмент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcelПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект[ИмяТЧУвеличение].Очистить();
		Объект[ИмяТЧУменьшение].Очистить();
	КонецЕсли;
	
	ЗагрузитьИзExcelФрагмент();
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcelФрагмент()
	
	ОткрытьФорму("Обработка.ЗагрузкаКонтрагентовИзExcel.Форма.ФормаЗагрузкиВзаиморасчетов", , ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcelЗавершение(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ЗагрузитьИзExcelНаСервере(ВыбранноеЗначение);	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзExcelНаСервере(ВыбранноеЗначение)
	
	ТаблицаДолгов = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	Для Каждого СтрокаТЗ из ТаблицаДолгов Цикл
		
		Если СтрокаТЗ.Сумма > 0 Тогда
			НоваяСтрока = Объект[ИмяТЧУвеличение].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			
		ИначеЕсли СтрокаТЗ.Сумма < 0 Тогда
			НоваяСтрока = Объект[ИмяТЧУменьшение].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			НоваяСтрока.Сумма = -НоваяСтрока.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДолгиДляУменьшения(Команда)
	
	Если Объект.Организация.Пустая() Тогда
		ПоказатьПредупреждение(, "Не указана организация");
		Возврат;
	КонецЕсли;
	
	ИмяТЧУменьшение = "УменьшениеДолга";
	Если Команда.Имя = "ЗаполнитьДолгиПоставщиковДляУменьшения" Тогда
		ИмяТЧУменьшение = "УменьшениеДолгаПоставщиков";	
	КонецЕсли;
	
	Если Объект[ИмяТЧУменьшение].Количество() > 0 Тогда
		ОписаниеОповещения = новый ОписаниеОповещения("ЗаполнитьДолгиДляУменьшенияПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Очистить таблицу уменьшения долга?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьТаблицуУменьшенияПоТекущимДолгам();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДолгиДляУменьшенияПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект[ИмяТЧУменьшение].Очистить();
	КонецЕсли;
	
	ЗаполнитьТаблицуУменьшенияПоТекущимДолгам();
	 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуУменьшенияПоТекущимДолгам()
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Договор КАК Договор,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&Период, Организация = &Организация) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект[ИмяТЧУменьшение].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Валюта = ВалютаУчета;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьВалютуУчета()
	Возврат Константы.ВалютаУчета.Получить();
КонецФункции

&НаСервере
Функция ПолучитьДоговорПоУмолчанию(Контрагент)
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчанию(Объект.Организация, Контрагент)	
	
КонецФункции

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
