Процедура УстановитьСтандартныйСтиль(НовыйHTMLДокумент, ПодчеркиватьСсылки = Истина) Экспорт
	//знСтиль =  "p {line-height: 100%;} A {text-decoration: none; color:black;} A:hover {text-decoration: underline;color:black;} a:visited {text-decoration: none; color: black;} a:visited:hover {text-decoration: underline;color:black;}";
	Если ПодчеркиватьСсылки Тогда
		знСтиль =  "p {line-height: 100%;} A {text-decoration: underline; color:black;} A:hover {text-decoration: underline;color:black;} a:visited {text-decoration: underline; color: black;} a:visited:hover {text-decoration: underline;color:black;}";
	Иначе
		знСтиль =  "p {line-height: 100%;} A {text-decoration: none; color:black;} A:hover {text-decoration: underline;color:black;} a:visited {text-decoration: none; color: black;} a:visited:hover {text-decoration: underline;color:black;}";
	КонецЕсли;
	Если НовыйHTMLДокумент.getElementsByTagName("STYLE").Length = 0 Тогда
		Стиль = НовыйHTMLДокумент.createElement("STYLE");
		Стиль.setAttribute("type", "text/css");
		Стиль.styleSheet.cssText = знСтиль;
		
		head = НовыйHTMLДокумент.getElementsByTagName("head");
		Если head.length>0 Тогда
			head.item(0).appendChild(Стиль);
		КонецЕсли;
		
	Иначе
		СтарыйСтиль = НовыйHTMLДокумент.getElementsByTagName("STYLE").item(0).styleSheet.cssText;
		Если найти(СтарыйСтиль,знСтиль) = 0 Тогда  
			НовыйHTMLДокумент.getElementsByTagName("STYLE").item(0).styleSheet.cssText = НовыйHTMLДокумент.getElementsByTagName("STYLE").item(0).styleSheet.cssText + Символы.ПС + знСтиль;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПропарситьХТМЛДокументИОбновитьНаименованияСсылокИПеременные(Знач Текст, Объект) Экспорт
	
	Текст = СтрЗаменить(Текст,"<META content=IE=9 http-equiv=X-UA-Compatible>","");
	Текст = СтрЗаменить(Текст,"<META http-equiv=X-UA-Compatible content=IE=9>","");
    //{ ИА_Аврамов 16.12.2014
    Текст = Стрзаменить(Текст, "1CRef_Inst_", "1CRefInst");
    //} 
    
	
	НовыйHTMLДокумент = Новый COMОбъект("HtmlFile");
	НовыйHTMLДокумент.open("text/html");
	НовыйHTMLДокумент.write(Текст);
	
	
	элСсылки = НовыйHTMLДокумент.getElementsByTagName("A");
	сч= 0;
	Пока сч<элСсылки.length Цикл
		элСсылка = элСсылки.item(сч);
		href = "";
		Попытка
			href = элСсылка.href;
		Исключение
			Продолжить;
		КонецПопытки;
		Если СтрЧислоВхождений(href, "1CRefInst") > 0 Тогда
			НайденаСсылка = Истина;
			Копияhref = СтрЗаменить(href, "about:1CRefInst", "");
			
			Попытка
				UUID = Новый УникальныйИдентификатор(Копияhref);
				Ссылка = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьСсылкуСправочника("ИА_Инструкции", UUID); 				 
			Исключение
				НайденаСсылка = Ложь;
			КонецПопытки;
			
			Если ЗначениеЗаполнено(Ссылка) И НайденаСсылка Тогда
				текСсылка = элСсылка;
				
				Пока текСсылка.childNodes.length > 0 Цикл
					текСсылка =  текСсылка.childNodes(0);
				КонецЦикла;
				
				Попытка
					текСсылка.innerHTML = Строка(Ссылка);
				Исключение
					Попытка
						текСсылка.nodeValue = Строка(Ссылка);
					Исключение
						сообщить(ОписаниеОшибки());
					КонецПопытки;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		сч = сч +1;
	КонецЦикла;
	
	// переменные
	элСсылки = НовыйHTMLДокумент.getElementsByTagName("A");
	сч= 0;
	Пока сч<элСсылки.length Цикл
		элСсылка = элСсылки.item(сч);
		id = "";
		Попытка
			id = элСсылка.id;
		Исключение
			Продолжить;
		КонецПопытки;
		Если СтрЧислоВхождений(id, "1CParam_Inst_") > 0 Тогда
			НайденаСсылка = Истина;
			Копияhref = СтрЗаменить(id, "1CParam_Inst_", "");
			переменная = Копияhref;
			резПерем = ИА_ОбщиеПроцедуры_Технология_Сервер.ИА_ВычислитьПеременную(Объект,переменная); 				
			
			элСсылка.style.textDecoration = "none";
			текСсылка = элСсылка;
			
			ЕстьРазрыв = Ложь;
			счЧайл = 0;
			пока счЧайл<текСсылка.childNodes.length Цикл
				если НРЕГ(СОКРЛП(текСсылка.childNodes(счЧайл).nodeName)) = "br" Тогда
					ЕстьРазрыв = Истина;
					Прервать;
				КонецЕсли;
				счЧайл = счЧайл + 1;
			КонецЦикла;
			
			Пока текСсылка.childNodes.length > 0 и не ЕстьРазрыв Цикл
				текСсылка =  текСсылка.childNodes(0);
				
				ЕстьРазрыв = Ложь;
				счЧайл = 0;
				пока счЧайл<текСсылка.childNodes.length Цикл
					если НРЕГ(СОКРЛП(текСсылка.childNodes(счЧайл).nodeName)) = "br" Тогда
						ЕстьРазрыв = Истина;
						Прервать;
					КонецЕсли;
					счЧайл = счЧайл + 1;
				КонецЦикла;
			КонецЦикла;
			
			Попытка
				текСсылка.innerHTML = резПерем;
			Исключение
				Попытка
					текСсылка.nodeValue = резПерем;
				Исключение
					сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецПопытки;
		КонецЕсли;
		сч = сч +1;
	КонецЦикла;
	
	//НовыйHTMLДокумент.all.tags("body").item(0).style.lineHeight = "1pt";
	УстановитьСтандартныйСтиль(НовыйHTMLДокумент);
			
	НовыйHTMLДокумент.close();
	НовТекст = НовыйHTMLДокумент.all.tags("html").item(0).outerHTML;
	НовТекст = СтрЗаменить(НовТекст, "&lt;BR&gt;", "<BR>");
	НовТекст = СтрЗаменить(НовТекст, "&lt;br&gt;", "<BR>");
	Возврат НовТекст;
КонецФункции

Функция ЭтоБуква(Символ) Экспорт
	
	Код = КодСимвола(Символ);
	
	//Если (Код<=57) ИЛИ (Код>=58 И Код<=64) ИЛИ (Код>=91 И Код<=96)  ИЛИ (Код>=123 И Код<=126) Тогда
	//	Возврат Ложь;
	//Иначе
	//	Возврат Истина;
	//КонецЕсли;
	
	Если (Код>=97) И (Код<=122) Тогда // a..z
		Возврат Истина;
	ИначеЕсли (Код>=65) И (Код<=90) Тогда // A..Z
		Возврат Истина;
	ИначеЕсли (Код>=1072) И (Код<=1103) Тогда // а..я
		Возврат Истина;
	ИначеЕсли (Код>=1040) И (Код<=1071) Тогда // А..Я
		Возврат Истина;
	ИначеЕсли (Код=45) Тогда // -
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

