
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТД = Элемент.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	Закрыть(ПолучитьМакет(ТД.Период, ТД.Наименование));
КонецПроцедуры

&НаСервере
Функция ПолучитьМакет(Период, Наименование)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АрхивОргсхем.Макет
		|ИЗ
		|	РегистрСведений.АрхивОргсхем КАК АрхивОргсхем
		|ГДЕ
		|	АрхивОргсхем.Период = &Период
		|	И АрхивОргсхем.Наименование = &Наименование";

	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Период", Период);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Макет.Получить();
	КонецЦикла;
	
	Возврат Неопределено;


	
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ТД = Элементы.Список.ТекущиеДанные;
	Если тд <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Закрыть(ПолучитьМакет(ТД.Период, ТД.Наименование));
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
КонецПроцедуры

