#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	СрокДействия = ТекущаяДатаСеанса() + 14 * (24 * 60 * 60); //по умолчанию доверенность выдается на 2 недели
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Область ПроцедурыЗаполнения

Процедура ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения) Экспорт
	
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Ссылка)
		И НЕ (ПустаяСтрока(ДанныеЗаполнения.НомерВходящегоДокумента)
				ИЛИ ПустаяСтрока(ДанныеЗаполнения.ДатаВходящегоДокумента)) Тогда
		
		ПоДокументу = НСтр("ru ='Счет на оплату покупателя №'") + СокрЛП(ДанныеЗаполнения.НомерВходящегоДокумента) + НСтр("ru =' от '") + СокрЛП(ДанныеЗаполнения.ДатаВходящегоДокумента);
		
	Иначе
		
		ПоДокументу = ДанныеЗаполнения.Ссылка;
		
	КонецЕсли;
	
	БанковскийСчет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
	
	// Заполнение табличной части документа.
	Товары.Очистить();
	
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Товары Цикл
		
		Если НЕ СтрокаТабличнойЧасти.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Наименование = СтрокаТабличнойЧасти.Номенклатура.Наименование;
			НоваяСтрока.ЕдиницаИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения;
			НоваяСтрока.Количество = СтрокаТабличнойЧасти.Количество;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
