
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = "ФВ-";
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ПредставлениеЗаказов = "";
	Для каждого стр из иа_ЗаказыНаПриобретение Цикл
		Если ПредставлениеЗаказов<>"" ТОгда
			ПредставлениеЗаказов = ПредставлениеЗаказов + ", ";
		КонецЕсли;
		ПредставлениеЗаказов = ПредставлениеЗаказов + ИА_ФПСервер.УбратьНули(стр.ЗП.Номер);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = тип("ДокументСсылка.ИА_ЗаказНаПриобретение") Тогда
		Организация = ДанныеЗаполнения.Организация;
		ОрганизацияДочерняя = ДанныеЗаполнения.ОрганизацияДочерняя;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

КонецПроцедуры
