


&НаКлиенте
Процедура ОтборПоПостуПриИзменении(Элемент)
	Эл = Список.Параметры.Элементы.Найти("Пост");
	Эл.Значение = ОтборПоПосту;
	Эл.Использование = Истина;
	
	Эл = Список.Параметры.Элементы.Найти("НО_Пост");
	Эл.Значение = ОтборПоПосту.Пустая();
	Эл.Использование = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Эл = Список.Параметры.Элементы.Найти("Пост");
	Эл.Значение = ОтборПоПосту;
	Эл.Использование = Истина;
	
	Эл = Список.Параметры.Элементы.Найти("НО_Пост");
	Эл.Значение = ОтборПоПосту.Пустая();
	Эл.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Команда)
	Элементы.ФормаОтбор.Пометка = НЕ Элементы.ФормаОтбор.Пометка;
	Элементы.ГруппаОтбор.Видимость = Элементы.ФормаОтбор.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Команда)
	//ОтборПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборПриИзмененииНаСервере()
	// ДатаВыпускаДатаНачала
	//ДатаВыпускаДатаОкончания
	//Пост - ТЧ Коды распределения
	//ТипИнструкции - реквизит
	//Серия - ТЧ Серии
	//Текст - реквизит
	//Теги - реквизит
	//ТипИнструкции1 - реквизит
	//Статус1 - реквизит
	//Список.ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	СправочникИА_Инструкции.Ссылка,
	//|	СправочникИА_Инструкции.ПометкаУдаления,
	//|	СправочникИА_Инструкции.Предопределенный,
	//|	СправочникИА_Инструкции.Родитель,
	//|	СправочникИА_Инструкции.ЭтоГруппа,
	//|	СправочникИА_Инструкции.Код,
	//|	СправочникИА_Инструкции.Наименование,
	//|	СправочникИА_Инструкции.ТипИнструкции,
	//|	СправочникИА_Инструкции.ДатаСоздания,
	//|	СправочникИА_Инструкции.Версия,
	//|	СправочникИА_Инструкции.ДатаОбновления,
	//|	СправочникИА_Инструкции.Комментарий,
	//|	СправочникИА_Инструкции.Теги,
	//|	СправочникИА_Инструкции.Текст,
	//|	СправочникИА_Инструкции.НаименованиеИнструкции,
	//|	СправочникИА_Инструкции.Статус,
	//|	СправочникИА_Инструкции.ТекстКолонтитула,
	//|	СправочникИА_Инструкции.Подписант,
	//|	СправочникИА_Инструкции.ИмяВремКаталогаВорд
	//|ИЗ
	//|	Справочник.ИА_Инструкции КАК СправочникИА_Инструкции
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_Инструкции.КодыРаспределения КАК ИА_ИнструкцииКодыРаспределения
	//|		ПО (ИА_ИнструкцииКодыРаспределения.Ссылка = СправочникИА_Инструкции.Ссылка)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_Инструкции.Серии КАК ИА_ИнструкцииСерии
	//|		ПО (ИА_ИнструкцииСерии.Ссылка = СправочникИА_Инструкции.Ссылка)";
	//
	//Если ЗначениеЗаполнено(ДатаВыпуска.ДатаНачала) ИЛИ ЗначениеЗаполнено(ДатаВыпуска.ДатаОкончания) ИЛИ ЗначениеЗаполнено(Пост) ИЛИ ЗначениеЗаполнено(ТипИнструкции) ИЛИ
	//	ЗначениеЗаполнено(Серия) ИЛИ ЗначениеЗаполнено(Текст) ИЛИ ЗначениеЗаполнено(Теги) ИЛИ ЗначениеЗаполнено(Статус) Тогда
	//	
	//	Список.ТекстЗапроса = Список.ТекстЗапроса + Символы.ПС + "ГДЕ";
	//	
	//	Если ЗначениеЗаполнено(ТипИнструкции) Тогда
	//		Список.ТекстЗапроса = Список.ТекстЗапроса + Символы.ПС + "СправочникИА_Инструкции.ТипИнструкции = &ТипИнструкции И";
	//		Список.Параметры.УстановитьЗначениеПараметра("ТипИнструкции", ТипИнструкции);
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(Теги) Тогда
	//		Список.ТекстЗапроса = Список.ТекстЗапроса + Символы.ПС + "СправочникИА_Инструкции.Теги = &Теги И";
	//		Список.Параметры.УстановитьЗначениеПараметра("Теги", Теги);
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(Статус) Тогда
	//		Список.ТекстЗапроса = Список.ТекстЗапроса + Символы.ПС + "СправочникИА_Инструкции.Статус = &Статус И";
	//		Список.Параметры.УстановитьЗначениеПараметра("Статус", Статус);
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(Пост) Тогда
	//		Список.ТекстЗапроса = Список.ТекстЗапроса + Символы.ПС + "ИА_ИнструкцииКодыРаспределения.КодРаспределения = &Пост И";
	//		Список.Параметры.УстановитьЗначениеПараметра("Пост", Пост);
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(Серия) Тогда
	//		Список.ТекстЗапроса = Список.ТекстЗапроса + Символы.ПС + "ИА_ИнструкцииСерии.Серия = &Серия И";
	//		Список.Параметры.УстановитьЗначениеПараметра("Серия", Серия);
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(Текст) Тогда
	//		Список.ТекстЗапроса = Список.ТекстЗапроса + Символы.ПС + "СправочникИА_Инструкции.Текст ПОДОБНО &Текст И";
	//		Список.Параметры.УстановитьЗначениеПараметра("Текст", Текст);
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(ДатаВыпуска.ДатаНачала) Тогда
	//		Список.ТекстЗапроса = Список.ТекстЗапроса + Символы.ПС + "СправочникИА_Инструкции.ДатаСоздания >= &ДатаСозданияДатаНачала И";
	//		Список.Параметры.УстановитьЗначениеПараметра("ДатаСозданияДатаНачала", ДатаВыпуска.ДатаНачала);
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(ДатаВыпуска.ДатаОкончания) Тогда
	//		Список.ТекстЗапроса = Список.ТекстЗапроса + Символы.ПС + "СправочникИА_Инструкции.ДатаСоздания <= &ДатаСозданияДатаОкончания И";
	//		Список.Параметры.УстановитьЗначениеПараметра("ДатаСозданияДатаОкончания", ДатаВыпуска.ДатаОкончания);
	//	КонецЕсли;
	//КонецЕсли;
	
	
КонецПроцедуры

