
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("МассивЦен") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Валюта = Параметры.Валюта;
	Основание = Параметры.Основание;
	
	Для Каждого ТекущаяСтрока Из Параметры.МассивЦен Цикл
		
		НоваяСтрока = ЦеныКУстановке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		НоваяСтрока.Разница = ((НоваяСтрока.ТекущаяЦенаПоВидуЦен / НоваяСтрока.ЦенаПоступления) -1 ) * 100;
		
		НоваяСтрока.Отметка = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из ЦеныКУстановке Цикл
		ТекущаяСтрока.Отметка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из ЦеныКУстановке Цикл
		ТекущаяСтрока.Отметка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	
	МассивЦен = ПолучитьМассивЦенКУстановке();
	
	Если МассивЦен.Количество() = 0 Тогда
		Сообщить("Выберите цены к установке.");
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = новый Структура;
	СтруктураЗаполнения.Вставить("МассивЦен", 		МассивЦен); 
	СтруктураЗаполнения.Вставить("Основание", 		Основание);
	СтруктураЗаполнения.Вставить("ПоКонтролюЦен", 	Истина);
	СтруктураЗаполнения.Вставить("Валюта", 			Валюта);
	
	ПараметрыФормы = новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения);
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.ФормаОбъекта", ПараметрыФормы);

	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивЦенКУстановке()
	
	ОтборСтрок = ЦеныКУстановке.НайтиСтроки(новый Структура("Отметка", Истина));
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ЦеныКУстановке.Выгрузить(ОтборСтрок));
	
КонецФункции

