
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ПараметрыФормы - СписокТоваров, НастройкаИнтеркампани, ДоступныАналогиМатериалов		
	Если Параметры.СписокТоваров = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("ДоступныАналогиМатериалов") Тогда
		ДоступныАналогиМатериалов = Параметры.ДоступныАналогиМатериалов;
	КонецЕсли;
	
	//++16864
	Если  Константы.ИспользоватьИнтеркампани.Получить() И НЕ Константы.УчетОбеспеченностиРозницыПоКомнатам.Получить() Тогда
		
		//СтруктураПоиска = Новый Структура;
		//СтруктураПоиска.Вставить("ВидНоменклатуры");
		//СтруктураПоиска.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал;
		//МассивСтрок = Параметры.СписокТоваров.ОтборСтрок(СтруктураПоиска);
		//
		//СвернутьТоварыИМатералы = Истина;
	КонецЕсли;	
	//--16864
		
	ПотолокПоНомеруРасчета = Новый Соответствие;
	МассивПотолков = Новый Массив;
	
	МассивТоваров = Параметры.СписокТоваров;
	Для НомерСтроки = 0 По МассивТоваров.Количество() - 1 Цикл
		НоваяСтрока = СписокТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивТоваров[НомерСтроки], 
		"НомерСтроки, Комната, Номенклатура, ХарактеристикаНоменклатуры, 
		| Количество, ЕдиницаИзмерения, НомерПотолка, Коэффициент, 
		| Назначение, КоличествоКОбеспечению");
		
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(НоваяСтрока.Номенклатура) Тогда								
			МассивПотолков.Добавить(НоваяСтрока.Номенклатура);
			Если НЕ ПустаяСтрока(НоваяСтрока.НомерПотолка) Тогда
				ПотолокПоНомеруРасчета.Вставить(НоваяСтрока.НомерПотолка, НоваяСтрока.Номенклатура);
			ИначеЕсли НЕ ПустаяСтрока(НоваяСтрока.Номенклатура.Потолок_НомерРасчета) Тогда
				ПотолокПоНомеруРасчета.Вставить(НоваяСтрока.Номенклатура.Потолок_НомерРасчета, НоваяСтрока.Номенклатура);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	СписокТоваров.Сортировать("Назначение УБЫВ, Комната, НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры");
	
	ПозицииКЗаказу = СписокТоваров.Выгрузить();
	СписокТоваров.Очистить();
	
	// заполним реквизиты шапки предполагаемого заказа
	СтруктураШапки = ОбщийМодульСервер.РеквизитыЗаказаПоИнтеркампани(Параметры.НастройкаИнтеркампани);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураШапки);
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("Контрагент");
	МассивЭлементов.Добавить("ДоговорКонтрагента");
	МассивЭлементов.Добавить("ВидЦен");
	МассивЭлементов.Добавить("СписокТоваровЦена");
	МассивЭлементов.Добавить("СписокТоваровСумма");
	МассивЭлементов.Добавить("ГруппаПодвалИтоги");
	ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Видимость", НЕ ОднаОрганизацияПроизводстваИПродажиПотолков);
	
	ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокТоваровВРезерве", "Видимость", ПолучитьФункциональнуюОпцию("ИспользоватьРезервирование"));	
	
	//ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокТоваровЗаменитьНаАналог", "Видимость", Параметры.Свойство("ИзЗаказа"));	
		
	ОбщийМодульСервер.ПодготовитьТаблицыЗаказаПоИнтеркампани(НастройкаИнтеркампани,
	                                            МассивПотолков, ПотолокПоНомеруРасчета,
												СтруктураШапки, ПозицииКЗаказу, СписокТоваров);

	Для каждого СтрокаТЧ из СписокТоваров Цикл
		СтрокаТЧ.ПодчиненнаяСтрока = (СтрокаТЧ.НомерСтроки = 0);
		СтрокаТЧ.УслугаРаскроя = СтрокаТЧ.УслугаРаскроя + " - номенклатура не определена"; 
	КонецЦикла;
	
	// №6482 если по потолку и его подчиненным строкам есть заказ покупателя (в работе или выполнен), запрещаем их заказывать
	ЗаказПоНомеруРасчета = Новый Соответствие;
	
	// получим заказы покупателя (на производство по потолкам)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивПотолков", МассивПотолков);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоПотолкам.ЗаказНаПроизводство КАК ЗаказПокупателяНаПроизводство,
	|	ЗаказыПоПотолкам.Номенклатура КАК Номенклатура,
	|	ЗаказыПоПотолкам.Номенклатура.Потолок_НомерРасчета КАК НомерПотолка
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(
	|			,
	|			,
	|			,
	|			ТИПЗНАЧЕНИЯ(ЗаказНаПроизводство) = ТИП(Документ.ЗаказПокупателя)
	|				И номенклатура В (&МассивПотолков)) КАК ЗаказыПоПотолкам";
			
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаказПоНомеруРасчета.Вставить(Выборка.НомерПотолка, Выборка.ЗаказПокупателяНаПроизводство);
	КонецЦикла;
	
	Для каждого СтрокаЗаказа из СписокТоваров Цикл
		СтрокаЗаказа.ЗаказПокупателя = ЗаказПоНомеруРасчета.Получить(СтрокаЗаказа.НомерПотолка);
		
		// запретим заказывать позицию
		Если НЕ СтрокаЗаказа.ЗаказПокупателя.Пустая() 
			// для подчиненных строк заказ покупателя не указываем, поэтому просто проверяем по номеру расчета привязонного потолка
			ИЛИ НЕ ЗаказПоНомеруРасчета.Получить(СтрокаЗаказа.Потолок.Потолок_НомерРасчета) = Неопределено
		Тогда
			СтрокаЗаказа.ЗапрещеноЗаказывать = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	ЗаполнитьДополнительныеКолонки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеКолонки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ТЗЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТЗЗаказПокупателяТовары.Количество КАК Количество,
	|	ТЗЗаказПокупателяТовары.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ ВремЗаказПокупателяТовары
	|ИЗ
	|	&ТаблицаДокумента КАК ТЗЗаказПокупателяТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|					ТОГДА ТоварыНаСкладахОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
	|				ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
	|			КОНЕЦ, 0)) КАК Остаток,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|					ТОГДА ВРезервеОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
	|				ИНАЧЕ ВРезервеОстатки.КоличествоОстаток
	|			КОНЕЦ, 0)) КАК ВРезерве
	|ИЗ
	|	ВремЗаказПокупателяТовары КАК ЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ) КАК ТоварыНаСкладахОстатки
	|		ПО ЗаказПокупателяТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ЗаказПокупателяТовары.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ) КАК ВРезервеОстатки
	|		ПО ЗаказПокупателяТовары.Номенклатура = ВРезервеОстатки.Номенклатура
	|			И ЗаказПокупателяТовары.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры";
	
	Запрос.УстановитьПараметр("ТаблицаДокумента",			СписокТоваров.Выгрузить());
	Запрос.УстановитьПараметр("ИспользуютсяОбщиеСклады",	Константы.ОбщиеСклады.Получить());
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("Склад",						Склад);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл	
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
		Отбор.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
		
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, НайденныеСтроки[0], "Остаток, ВРезерве");
		КонецЕсли;
	КонецЦикла; 	

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьСтроки(Назначение = "Все", Заказывать = Истина, Инвертировать = Ложь)
	
	Если Назначение = "Все" Тогда
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			Если Заказывать И ТекущаяСтрока.ЗапрещеноЗаказывать Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ Инвертировать Тогда
				ТекущаяСтрока.Заказывать = Заказывать;
			Иначе
				ТекущаяСтрока.Заказывать = НЕ ТекущаяСтрока.Заказывать;
			КонецЕсли;
		КонецЦикла;
		СписокТоваровПриАктивизации();
		
	ИначеЕсли Назначение = "Материалы" Тогда
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			Если ТекущаяСтрока.ЗапрещеноЗаказывать Тогда
				Продолжить;
			КонецЕсли;
			Если ТекущаяСтрока.Назначение = "Материалы" Тогда
				ТекущаяСтрока.Заказывать = Истина;
			КонецЕсли;
		КонецЦикла;
		СписокТоваровПриАктивизации();
		
	ИначеЕсли Назначение = "Потолки" ИЛИ Назначение = "Продукцию" ИЛИ Назначение = "Товары" Тогда
		ОтметитьСтрокиНаСервере(Назначение, Заказывать);
		
	КонецЕсли;
	
	ПересчитатьИтоговыеПоказатели();
	
	// №7908
	ЗаполнитьОжидаемуюОтгрузкуПоПотолку();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОжидаемуюОтгрузкуПоПотолку()
	
	ОжидаемаяДатаОтгрузки = Дата(1,1,1);
	ОжидаемоеВремяОтгрузки = Дата(1,1,1);
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		
		Если НЕ ТекущаяСтрока.Заказывать Тогда
			Продолжить;
		КонецЕсли;
		
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			
			ДатаОтгрузкиВКарточке = ТекущаяСтрока.Номенклатура.Потолок_ПланируемаяДата;
			ВремяОтгрузкиВКарточке = ТекущаяСтрока.Номенклатура.Потолок_ПланируемоеВремя;
			
			Если ЗначениеЗаполнено(ДатаОтгрузкиВКарточке) и ДатаОтгрузкиВКарточке > ОжидаемаяДатаОтгрузки Тогда
				ОжидаемаяДатаОтгрузки = ДатаОтгрузкиВКарточке;
				ОжидаемоеВремяОтгрузки = ВремяОтгрузкиВКарточке;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьСтрокиНаСервере(Назначение, Заказывать = Истина)
	
	Если Назначение = "Потолки" Тогда
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			Если Заказывать И ТекущаяСтрока.ЗапрещеноЗаказывать Тогда
				Продолжить;
			КонецЕсли;
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
				ТекущаяСтрока.Заказывать = Заказывать;
				Для Каждого ПодчиненнаяСтрока Из СписокТоваров Цикл
					Если ПодчиненнаяСтрока.Потолок = ТекущаяСтрока.Номенклатура Тогда
						ПодчиненнаяСтрока.Заказывать = Заказывать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли Назначение = "Продукцию" Тогда
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			Если Заказывать И ТекущаяСтрока.ЗапрещеноЗаказывать Тогда
				Продолжить;
			КонецЕсли;
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПродукция(ТекущаяСтрока.Номенклатура) Тогда
				ТекущаяСтрока.Заказывать = Заказывать;
				Для Каждого ПодчиненнаяСтрока Из СписокТоваров Цикл
					Если ПодчиненнаяСтрока.Потолок = ТекущаяСтрока.Номенклатура Тогда
						ПодчиненнаяСтрока.Заказывать = Заказывать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли Назначение = "Товары" Тогда
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			Если Заказывать И ТекущаяСтрока.ЗапрещеноЗаказывать Тогда
				Продолжить;
			КонецЕсли;
			Если ТекущаяСтрока.Назначение = "Товары"
				И НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
				ТекущаяСтрока.Заказывать = Заказывать;
			КонецЕсли;
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ОтметитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСоВсех(Команда)
	
	ОтметитьСтроки(, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьПометки(Команда)
	
	ОтметитьСтроки(, Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьПотолки(Команда)
	ОтметитьСтроки("Потолки");
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьТовары(Команда)
	
	ОтметитьСтроки("Товары");

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьМатериалы(Команда)
	
	ОтметитьСтроки("Материалы");
		
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьПродукцию(Команда)
	
	ОтметитьСтроки("Продукцию");
		
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровЗаказыватьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокТоваров.ТекущиеДанные;
	Для Каждого ПодчиненнаяСтрока Из СписокТоваров Цикл
		Если ПодчиненнаяСтрока.Потолок = ТекущиеДанные.Номенклатура Тогда
			ПодчиненнаяСтрока.Заказывать = ТекущиеДанные.Заказывать;
		КонецЕсли;
	КонецЦикла;
	
	СписокТоваровПриАктивизации();	
	ПересчитатьИтоговыеПоказатели();
	// №7908
	ЗаполнитьОжидаемуюОтгрузкуПоПотолку();
			
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтоговыеПоказатели()
	Если ОднаОрганизацияПроизводстваИПродажиПотолков Тогда 
		Возврат;
	КонецЕсли;
	
	ТоварыИтогСуммаВрем = 0;
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		Если ТекущаяСтрока.Заказывать Тогда
			ТоварыИтогСуммаВрем = ТоварыИтогСуммаВрем + ТекущаяСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;
	ТоварыИтогСумма = ТоварыИтогСуммаВрем;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("СписокТоваровПриАктивизации", 0.1, Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриАктивизации()
	
	ТекущиеДанные = Элементы.СписокТоваров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	Элементы.СписокТоваровЗаменитьНаАналог.Доступность = ДоступныАналогиМатериалов И ТекущиеДанные.Заказывать И ТекущиеДанные.Назначение = "Материалы";
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокТоваровНоменклатура" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыВыбора = Новый Структура("Ключ", Элемент.ТекущиеДанные.Номенклатура);
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ПараметрыВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьНаАналог(Команда)
	
	ТекущаяСтрока = Элементы.СписокТоваров.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Сообщить("Не выбрана позиция");
		Возврат;
	КонецЕсли;
	
	Если НЕ (ТекущаяСтрока.Заказывать И ТекущаяСтрока.Назначение = "Материалы") Тогда
		Сообщить("Замена на аналог поддерживается только для выбранных позиций с назначением ""Материалы""");
		Возврат;
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Номенклатура",			ТекущаяСтрока.Номенклатура);
	ПараметрыПодбора.Вставить("Организация",			Организация);
	Если Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка") Тогда 
		//ПараметрыПодбора.Вставить("Склад", 				ПолучитьСкладТекущегоПользователя());
	Иначе
		ПараметрыПодбора.Вставить("Склад",				Склад);
	КонецЕсли;
	ПараметрыПодбора.Вставить("ВидЦены",				ВидЦен);
	ПараметрыПодбора.Вставить("Контрагент",				Контрагент);
	ПараметрыПодбора.Вставить("ДоговорКонтрагента",		ДоговорКонтрагента);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораАналога", ЭтаФорма, ТекущаяСтрока.ПолучитьИдентификатор());
	ОткрытьФорму("РегистрСведений.АналогиНоменклатуры.Форма.ФормаВыбораАналога", ПараметрыПодбора, ЭтаФорма,,,,ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораАналога(Результат, ИдТекущейСтроки) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	Элементы.СписокТоваров.ТекущаяСтрока = ИдТекущейСтроки;
	ТекущаяСтрока = Элементы.СписокТоваров.ТекущиеДанные;
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Результат);
	ТекущаяСтрока.ПроцентРучнойСкидки = 0;
	ТекущаяСтрока.СуммаРучнойСкидки = 0;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, Ложь);
	//ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
	ПересчитатьИтоговыеПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Заказать(Команда)

	СтруктураОтвета = новый Структура;
	СписокЗаказать = Новый Массив;
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		Если ТекущаяСтрока.Заказывать И НЕ ТекущаяСтрока.ПодчиненнаяСтрока Тогда 
			СтруктураТовара = Новый Структура;
			СтруктураТовара.Вставить("Комната", 			ТекущаяСтрока.Комната);
			СтруктураТовара.Вставить("Номенклатура", 		ТекущаяСтрока.Номенклатура);
			СтруктураТовара.Вставить("ХарактеристикаНоменклатуры", 		
															ТекущаяСтрока.ХарактеристикаНоменклатуры);
			СтруктураТовара.Вставить("Количество", 			ТекущаяСтрока.Количество);
			СтруктураТовара.Вставить("ЕдиницаИзмерения", 	ТекущаяСтрока.ЕдиницаИзмерения);
			СтруктураТовара.Вставить("НомерСтроки", 		ТекущаяСтрока.НомерСтроки);
			СтруктураТовара.Вставить("НомерПотолка", 		ТекущаяСтрока.НомерПотолка);
			//СтруктураТовара.Вставить("ЗаказНаПроизводство", ТекущаяСтрока.ЗаказНаПроизводство);
			СтруктураТовара.Вставить("Коэффициент", 		ТекущаяСтрока.Коэффициент);
			//СтруктураТовара.Вставить("ПроцентСкидки", 		ТекущаяСтрока.ПроцентСкидки);
			//СтруктураТовара.Вставить("Цена", 				ТекущаяСтрока.Цена);
			//СтруктураТовара.Вставить("СуммаСкидки", 		ТекущаяСтрока.СуммаСкидки);
			//СтруктураТовара.Вставить("Сумма", 				ТекущаяСтрока.Сумма);
			СтруктураТовара.Вставить("Назначение", 			ТекущаяСтрока.Назначение);
			СписокЗаказать.Добавить(СтруктураТовара);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОтвета.Вставить("СписокЗаказать", СписокЗаказать);
	СтруктураОтвета.Вставить("ОжидаемаяДатаОтгрузки", ОжидаемаяДатаОтгрузки);
	СтруктураОтвета.Вставить("ОжидаемоеВремяОтгрузки", ОжидаемоеВремяОтгрузки);
	
	Закрыть(СтруктураОтвета);	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокТоваровПодчиненнаяСтрока");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокТоваров.ПодчиненнаяСтрока");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокТоваров");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокТоваров.ПодчиненнаяСтрока");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокТоваровНоменклатура");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокТоваров.Номенклатура");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокТоваров.ЭтоУслугаРаскроя");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("СписокТоваров.УслугаРаскроя"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	// №6482 запрет заказа позиций, по которым есть заказ покупателя, а также раскраска серым фоном
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокТоваров");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокТоваров.ЗапрещеноЗаказывать");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоСерый);

КонецПроцедуры
