#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ВыпускПродукции";
    КомандаПечати.Идентификатор = "ТоварнаяНакладнаяНаВыпускПродукции";
    КомандаПечати.Представление = НСтр("ru = 'Накладная на выпуск'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварнаяНакладнаяНаВыпускПродукции") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        	КоллекцияПечатныхФорм,
        	"ТоварнаяНакладнаяНаВыпускПродукции",
        	НСтр("ru = 'Накладная на выпуск'"),
        	СформироватьПечатнуюФормуНакладнойНавыпуск(МассивОбъектов, ОбъектыПечати));
    КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.ВерсияДанных КАК ВерсияДанных,
	|	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Бригада КАК Бригада,
	|	ДанныеДокумента.ВидЗаказа КАК ВидЗаказа,
	|	ДанныеДокумента.ВключатьВыработкуСотрудниковПроизводстваВСебестоимостьПродукции КАК ВключатьВыработкуСотрудниковПроизводстваВСебестоимостьПродукции,
	|	ДанныеДокумента.ИспользоватьКТУВПроизводственныхОперациях КАК ИспользоватьКТУВПроизводственныхОперациях,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.НесколькоТочекПроизводства КАК НесколькоТочекПроизводства,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.ПродукцияНоменклатура КАК ПродукцияНоменклатура,
	|	ДанныеДокумента.ПродукцияНоменклатураЕдиницаИзмерения КАК ПродукцияНоменклатураЕдиницаИзмерения,
	|	ДанныеДокумента.ПродукцияНоменклатураКоличество КАК ПродукцияНоменклатураКоличество,
	|	ДанныеДокумента.ПродукцияНоменклатураКоэффициент КАК ПродукцияНоменклатураКоэффициент,
	|	ДанныеДокумента.ПродукцияНомерРасчета КАК ПродукцияНомерРасчета,
	|	ДанныеДокумента.РучнаяКорректировкаВыработки КАК РучнаяКорректировкаВыработки,
	|	ДанныеДокумента.СкладМатериалов КАК СкладМатериалов,
	|	ДанныеДокумента.СкладПродукции КАК СкладПродукции,
	|	ДанныеДокумента.СпособНачисленияВыработки КАК СпособНачисленияВыработки,
	|	ДанныеДокумента.Цех КАК Цех
	|ИЗ
	|	Документ.ВыпускПродукции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	1 КАК НомерСтроки,
	|	ДанныеДокумента.ПродукцияНоменклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.ПродукцияНоменклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.ПродукцияНоменклатураКоличество КАК Количество,
	|	ДанныеДокумента.ПродукцияНоменклатураЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.ПродукцияНоменклатураКоэффициент КАК Коэффициент,
	|	ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка) КАК Спецификация
	|ПОМЕСТИТЬ ВТ_Продукция
	|ИЗ
	|	Документ.ВыпускПродукции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|	И НЕ ДанныеДокумента.ПродукцияНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Ссылка.ПродукцияНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.НомерСтроки + 1
	|		ИНАЧЕ ДанныеДокумента.НомерСтроки
	|	КОНЕЦ,
	|	ДанныеДокумента.Номенклатура.Артикул,
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент,
	|	ДанныеДокумента.Спецификация
	|ИЗ
	|	Документ.ВыпускПродукции.Продукция КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Артикул КАК Артикул,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.Спецификация КАК Спецификация
	|ИЗ
	|	ВТ_Продукция КАК ДанныеДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.КоличествоКВыработке КАК КоличествоКВыработке,
	|	ДанныеДокумента.Продукция КАК Продукция
	|ИЗ
	|	Документ.ВыпускПродукции.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиПродукция = МассивРезультатов[2];
	РезультатПоТабличнойЧастиМатериалы = МассивРезультатов[3];

	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиПродукция, РезультатПоТабличнойЧастиМатериалы",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиПродукция, РезультатПоТабличнойЧастиМатериалы);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам = Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуНакладнойНавыпуск(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыпускПродукции_Накладная";
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоПродукции  = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиПродукция.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоМатериалам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиМатериалы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = ПолучитьОбщийМакет("ТоварнаяНакладнаяНаВыпускПродукции");
		
		ТекстЗаголовка = "Накладная на списание товаров №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.Дата, "ДЛф=Д");
	
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
	
		ОбластьМакета = Макет.ПолучитьОбласть("СкладОтправитель");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СкладПолучатель");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Операция");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ОбластьМакета.Параметры.ОписаниеОперации = "Выпущена продукция:";
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Изменения размера колоноки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		// Вывод выпущенной продукции
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если ВыводитьАртикул Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
		//Если ЗначениеЗаполнено(Шапка.Номенклатура) Тогда
		//	ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
		//	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//	
		//	Если ВыводитьАртикул Тогда
		//		ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
		//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);
		//	КонецЕсли;
		//	
		//	ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
		//	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
		//	ТабличныйДокумент.Присоединить(ОбластьМакета);
		//КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоПродукции.Сбросить();
		Если ВыборкаПоПродукции.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоПродукции.Выбрать();			
			Пока Выборка.Следующий() Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(Выборка);
				
				//++ №12909
				ОбластьМакета.Параметры.Номенклатура = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);
				//-- №12909
				
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЦикла;
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если ВыводитьАртикул Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Операция");
		ОбластьМакета.Параметры.ОписаниеОперации = "Затрачены материалы:";
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Вывод табличной части		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если ВыводитьАртикул Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоМатериалам.Сбросить();
		Если ВыборкаПоМатериалам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоМатериалам.Выбрать();			
			Пока Выборка.Следующий() Цикл			
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(ОбщийМодульСервер.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЦикла;
		КонецЕсли;
	
		ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если ВыводитьАртикул Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Ответственный");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);		
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область Прочее

Процедура ВыполнитьЗаполнениеПоЗаказамДляМассовогоВыпускаИнтерактивно(ПараметрыОбмена, АдресРезультата = Неопределено) Экспорт
	
	МассивЗаказов = ПараметрыОбмена.МассивЗаказов;
	
	ДокОбъект = Документы.ВыпускПродукции.СоздатьДокумент();
	ТаблицаМатериалов = ДокОбъект.Материалы.Выгрузить();
	//ТаблицаМатериалов.Колонки.Добавить("Продукция", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаМатериалов.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство"));
	
	ТаблицаУслуг = ДокОбъект.Услуги.Выгрузить();
	ТаблицаУслуг.Колонки.Добавить("Продукция", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаУслуг.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство"));

	ТаблицаПродукции = ДокОбъект.Продукция.Выгрузить();
	ТаблицаПродукции.Колонки.Добавить("НомерРасчета", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50)));
	ТаблицаПродукции.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство"));

	ТаблицаИсполнителей = ДокОбъект.Исполнители.Выгрузить();
	ТаблицаИсполнителей.Колонки.Добавить("Продукция", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаИсполнителей.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство"));
	
	ТаблицаИсполнителейПоОперациям = ДокОбъект.ИсполнителиПоОперациям.Выгрузить();
	ТаблицаИсполнителейПоОперациям.Колонки.Добавить("Продукция", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаИсполнителейПоОперациям.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство"));
	
	Для каждого ЗаказСсылка из МассивЗаказов Цикл		
		
		ДокОбъект = Документы.ВыпускПродукции.СоздатьДокумент();
		ДокОбъект.Заполнить(ЗаказСсылка);
		
		УникальноеПроизводство = (ДокОбъект.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка);
		Если УникальноеПроизводство Тогда
			Продукция = ДокОбъект.ПродукцияНоменклатура;
		КонецЕсли;
		
		Для каждого СтрокаТЧ из ДокОбъект.Материалы Цикл
			НоваяСтрока = ТаблицаМатериалов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.Заказ = ЗаказСсылка;
			Если УникальноеПроизводство Тогда
				НоваяСтрока.Продукция = Продукция;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрокаТЧ из ДокОбъект.Услуги Цикл
			НоваяСтрока = ТаблицаУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.Заказ = ЗаказСсылка;
			Если УникальноеПроизводство Тогда
				НоваяСтрока.Продукция = Продукция;
			КонецЕсли;
		КонецЦикла;
		
		Если УникальноеПроизводство Тогда
			НоваяСтрока = ТаблицаПродукции.Добавить();
			НоваяСтрока.Номенклатура = ДокОбъект.ПродукцияНоменклатура;
			НоваяСтрока.Заказ = ЗаказСсылка;
			НоваяСтрока.Количество = ДокОбъект.ПродукцияНоменклатураКоличество;
			НоваяСтрока.ЕдиницаИзмерения = ДокОбъект.ПродукцияНоменклатураЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = ДокОбъект.ПродукцияНоменклатураКоэффициент;
			НоваяСтрока.НомерРасчета = ДокОбъект.ПродукцияНомерРасчета;
			
		Иначе
			Для Каждого СтрокаТЧ Из ДокОбъект.Продукция Цикл
				НоваяСтрока = ТаблицаПродукции.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.Заказ = ЗаказСсылка;
			КонецЦикла;
		КонецЕсли;
	
		Для каждого СтрокаТЧ из ДокОбъект.Исполнители Цикл
			НоваяСтрока = ТаблицаИсполнителей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.Заказ = ЗаказСсылка;
			Если УникальноеПроизводство Тогда
				НоваяСтрока.Продукция = Продукция;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрокаТЧ из ДокОбъект.ИсполнителиПоОперациям Цикл
			НоваяСтрока = ТаблицаИсполнителейПоОперациям.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.Заказ = ЗаказСсылка;
			Если УникальноеПроизводство Тогда
				НоваяСтрока.Продукция = Продукция;
			КонецЕсли;
		КонецЦикла;
				
	КонецЦикла;
		
	ПараметрыОбмена.Вставить("ТаблицаПродукции", 				ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаПродукции));
	ПараметрыОбмена.Вставить("ТаблицаМатериалов", 				ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаМатериалов));
	ПараметрыОбмена.Вставить("ТаблицаУслуг", 					ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаУслуг));
	ПараметрыОбмена.Вставить("ТаблицаИсполнителей", 			ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаИсполнителей));
	ПараметрыОбмена.Вставить("ТаблицаИсполнителейПоОперациям", 	ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаИсполнителейПоОперациям));
	
	ПоместитьВоВременноеХранилище(ПараметрыОбмена, АдресРезультата);	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ВозвратПродукции.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.НачислениеЗарплаты.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ОприходованиеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.Премия.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.Штраф.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания данного документа
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ВыпускПродукции) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ВыпускПродукции.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ВыпускПродукции.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Добавляет команду создания документа "Выпуск продукции" для заказа на производство
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОснованииЗаказаНаПроизводство(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ВыпускПродукции) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.ВыпускПродукцииСоздатьНаОснованииЗаказаНаПроизводство";
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ВыпускПродукции.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Добавляет команду массового создания документа "Выпуск продукции" для заказа на производство
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОснованииЗаказаНаПроизводствоМассовый(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ВыпускПродукции) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.ВыпускПродукцииМассовыйСоздатьНаОснованииЗаказаНаПроизводство";
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ВыпускПродукции.Представление() + " (массовый выпуск)";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		КомандаСоздатьНаОсновании.ВидимостьВФормах = "ФормаСписка,АРМПроизводства";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
