#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		ИнициализироватьСлужебныеРеквизиты();
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	НесколькоТочекПроизводства = Константы.НесколькоТочекПроизводства.Получить();
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	ИсполнителиНеЗаполнены = Истина;
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда		
		ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения, ИсполнителиНеЗаполнены);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Заказ") Тогда
			ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения.Заказ, ИсполнителиНеЗаполнены);
			Если ДанныеЗаполнения.Свойство("Материалы") Тогда
				Материалы.Очистить();
				Для каждого СтрокаТЧ из ДанныеЗаполнения.Материалы Цикл
					НоваяСтрока = Материалы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				КонецЦикла;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("Услуги") Тогда
				Услуги.Очистить();
				Для каждого СтрокаТЧ из ДанныеЗаполнения.Услуги Цикл
					НоваяСтрока = Услуги.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				КонецЦикла;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("Исполнители") Тогда
				Исполнители.Очистить();
				Для каждого СтрокаТЧ из ДанныеЗаполнения.Исполнители Цикл
					НоваяСтрока = Исполнители.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				КонецЦикла;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ИсполнителиПоОперациям") Тогда
				ИсполнителиПоОперациям.Очистить();
				Для каждого СтрокаТЧ из ДанныеЗаполнения.ИсполнителиПоОперациям Цикл
					НоваяСтрока = ИсполнителиПоОперациям.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				КонецЦикла;
			КонецЕсли;
			
			//#13345
			Если ДанныеЗаполнения.Свойство("ВыпускИзОстатков") И ДанныеЗаполнения.ВыпускИзОстатков Тогда
				 ОбщийМодульСервер.ИзменитьПолотнаВМатериалах(ЭтотОбъект, Истина, Истина);
			КонецЕсли;
			//#13345
			Если ДанныеЗаполнения.Свойство("ВыпускИзМатериаловЗаказчика") И ДанныеЗаполнения.ВыпускИзМатериаловЗаказчика Тогда
				 ОбщийМодульСервер.ИзменитьПолотнаВМатериалах(ЭтотОбъект, Истина, Ложь);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// инициализация прочих полей
	Если Константы.АвтоматическиЗаполнятьСоставСменыПриВыпускеПродукции.Получить() 
		И ИсполнителиНеЗаполнены Тогда
		//Очищаем исполнителей, если перезаполняем непроведенный
		Исполнители.Очистить();
		ЗаполнитьИсполнителейПоСмене();
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//#801
	Если Константы.КонтролироватьЗаполнениеИсполнителейВВыпуске.Получить() Тогда
		//++ №6687 теперь способ определяется в документе
		//Если Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить() Тогда
		Если СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации Тогда
		//-- №6687
			Если ИсполнителиПоОперациям.Количество() = 0 Тогда
				ПроверяемыеРеквизиты.Добавить("ИсполнителиПоОперациям");				
			КонецЕсли;	
		Иначе
			Если ИсполнителиПоОперациям.Количество() = 0 Тогда
				ПроверяемыеРеквизиты.Добавить("Исполнители");				
			КонецЕсли;
		КонецЕсли;
		
		//#12077
		Если СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации Тогда
			//#13441 добавлена настройка СпособКонтроляЗаполненияИсполнителейВВыпуске
			Если Константы.СпособКонтроляЗаполненияИсполнителейВВыпуске.Получить() = 0 Тогда
				// требуется заполнение исполнителей у всех производственных операция
				Для Индекс = 0 по ИсполнителиПоОперациям.Количество() - 1 Цикл
					СтрокаИсполнителя = ИсполнителиПоОперациям[Индекс];
					Если НЕ ЗначениеЗаполнено(СтрокаИсполнителя.Сотрудник1)
						И НЕ ЗначениеЗаполнено(СтрокаИсполнителя.Сотрудник2)
						И НЕ ЗначениеЗаполнено(СтрокаИсполнителя.Сотрудник3)
						И НЕ ЗначениеЗаполнено(СтрокаИсполнителя.Сотрудник4)
						Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + Строка(Индекс+1) + " не указан ни один исполнитель", ЭтотОбъект, "ИсполнителиПоОперациям["+Формат(Индекс, "ЧГ=0")+"].Сотрудник1", , Отказ);
					КонецЕсли;
				КонецЦикла;
			Иначе
				// требуется заполнения исполнителей хотя бы у одной производственной операции
				ЕстьИсполнители = Ложь;
				Для Индекс = 0 по ИсполнителиПоОперациям.Количество() - 1 Цикл
					СтрокаИсполнителя = ИсполнителиПоОперациям[Индекс];
					Если ЗначениеЗаполнено(СтрокаИсполнителя.Сотрудник1)
						ИЛИ ЗначениеЗаполнено(СтрокаИсполнителя.Сотрудник2)
						ИЛИ ЗначениеЗаполнено(СтрокаИсполнителя.Сотрудник3)
						ИЛИ ЗначениеЗаполнено(СтрокаИсполнителя.Сотрудник4)
						Тогда
						ЕстьИсполнители = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НЕ ЕстьИсполнители И ИсполнителиПоОперациям.Количество() > 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В таблице исполнителей не указан ни один исполнитель", ЭтотОбъект, "ИсполнителиПоОперациям[0].Сотрудник1", , Отказ);
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	// #13826 
	Для Индекс = 0 по Материалы.Количество()-1 Цикл
		СтрокаТабличнойЧасти = Материалы[Индекс];
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаТабличнойЧасти.Номенклатура) Тогда
			ТекстОшибки = "В строке " + Строка(Индекс+1) + " таблицы ""Материалы"" выбрана номенклатура-услуга";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Материалы["+Формат(Индекс, "ЧГ=0")+"].Номенклатура", , Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ НесколькоТочекПроизводства Тогда
		РеквизитЦех = ПроверяемыеРеквизиты.Найти("Цех");
		Если НЕ РеквизитЦех = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитЦех);
		КонецЕсли;
	КонецЕсли;

	// #15041
	Если ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
		РеквизитОснование = ПроверяемыеРеквизиты.Найти("Основание");
		Если НЕ РеквизитОснование = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитОснование);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
		
		ПродукцияНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
		ПродукцияНоменклатураЕдиницаИзмерения = Справочники.ЕдиницыИзмерений.ПустаяСсылка();
		ПродукцияНоменклатураКоличество  = 0;
		ПродукцияНоменклатураКоэффициент = 0;
		ПродукцияНомерРасчета 			 = "";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	#Область ДополнительныеПроверки
	//проверки
	Если ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
		Для Каждого ТекущаяСтрока Из Материалы Цикл
			Если ТекущаяСтрока.Продукция.Пустая() Тогда
				Сообщить("В строке " + ТекущаяСтрока.НомерСтроки + " материалов не указана продукция, на которую относится данный материал");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//если выпуск продукии по заказу, то проверим исполнин ли он ранее
	Если НЕ Основание = Неопределено Тогда
		Если НЕ Основание.Пустая() Тогда
			Если ЗаказНаПроизводствоИсполнен(Основание, Ссылка) Тогда
				Сообщить("Заказ на производство № " + Основание.Номер + " от " + Формат(Основание.Дата, "ДФ=""дд.ММ.гггг""") + " уже исполнен. Повторный выпуск продукции по исполненному заказу на производство не предусмотрен.", СтатусСообщения.Важное);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//++ №6687 теперь способ определяется в документе
	//РасчетЗарплатыПроизводстваПоОперациям = Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить();
	//Если НЕ РасчетЗарплатыПроизводстваПоОперациям
	Если СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.Бригадная
	//-- №6687
		И Исполнители.Количество() > 0 
		И Исполнители.Итог("Коэффициент") = 0 Тогда
		Сообщить("У исполнителей не заданы коэффициенты участия. Проведение документа отменено");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
			
	#КонецОбласти
	
	СтруктураОсновнойФактуры = Справочники.Номенклатура.ПолучитьОсновнуюФактуруИЦветПотолка(ПродукцияНоменклатура);
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	#Область РН_ТоварыНаСкладах_РасходМатериалов
	// регистр ТоварыНаСкладах Расход Материалов
	ДатаДвижения = Дата;
	Если ДатаДвижения = Дата(1,1,1) Тогда
		ДатаДвижения = ТекущаяДатаСеанса();
	КонецЕсли;
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, СкладМатериалов, Материалы, ДатаДвижения);
	Если Отказ Тогда
		Возврат;
	Иначе
		//++ №8793 нужно свернуть, чтобы корректно списать себестоимость
		мМатериалы = Материалы.Выгрузить();
		мМатериалы.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество"); 
		
		//nva+++
		Потолок_КоличествоВыработка = ПродукцияНоменклатура.Потолок_КоличествоВыработка;
		Потолок_КоличествоРасход = ПродукцияНоменклатура.Потолок_КоличествоРасход;
		ОстатокПленкиКоличество = Потолок_КоличествоРасход - Потолок_КоличествоВыработка;
		
		СебестоимостьОстаткаПленки = 0; 
		СебестоимостьОстаткаПленкиВал = 0; 
		//nva---
		//-- №8793
		Для Каждого Товар Из мМатериалы Цикл
			Расход = Движения.ТоварыНаСкладах.Добавить();
			Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
			Расход.Период = ДатаДвижения;
			Расход.Организация = ОрганизацияТоваров;
			Расход.Склад = СкладМатериалов;
			Расход.Номенклатура = Товар.Номенклатура;
			Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Расход.СерияНоменклатуры = Товар.СерияНоменклатуры;
			Расход.Количество = Товар.Количество * Товар.Коэффициент;
			//#8288
			//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, СкладМатериалов, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
			СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, СкладМатериалов, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
			Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
			Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
			
			//nva+++
			Если Товар.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда 
				СебестоимостьЕдПленки = ?(Расход.Количество = 0, 0, Расход.Сумма/Расход.Количество);
				СебестоимостьЕдПленкиВал = ?(Расход.Количество = 0, 0, Расход.СуммаВал/Расход.Количество);
				Приход = Движения.ТоварыНаСкладах.Добавить();
				Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
				Приход.Период = ДатаДвижения;
				Приход.Организация = ОрганизацияТоваров;
				Приход.Склад = СкладМатериалов;
				Приход.Номенклатура = Справочники.Номенклатура.ОстаткиПленки;
				//Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
				//Приход.СерияНоменклатуры = Товар.СерияНоменклатуры;
				Приход.Количество = ОстатокПленкиКоличество;
				//#8288
				//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, СкладМатериалов, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
				//СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, СкладМатериалов, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
				Приход.Сумма = ОстатокПленкиКоличество * СебестоимостьЕдПленки;
				Приход.СуммаВал = ОстатокПленкиКоличество * СебестоимостьЕдПленкиВал;
				СебестоимостьОстаткаПленки = СебестоимостьОстаткаПленки + Приход.Сумма; 
				СебестоимостьОстаткаПленкиВал = СебестоимостьОстаткаПленкиВал + Приход.СуммаВал;
			КонецЕсли;
			//nva---
		КонецЦикла;
	КонецЕсли;	
	#КонецОбласти
	
	#Область РН_ТоварыНаСкладах_ПриходПродукции	
	// регистр ТоварыНаСкладах Приход Продукции
	ТаблицаМатериалов = Новый ТаблицаЗначений;
	ТаблицаМатериалов = Материалы.Выгрузить();
	ТаблицаМатериалов.Колонки.Добавить("Сумма",Новый ОписаниеТипов("число"));
	ЗаполнитьСтоимостьПриходаПоСписанию(ТаблицаМатериалов);
	
	ТаблицаПродукции = Новый ТаблицаЗначений;
	ТаблицаПродукции.Колонки.Добавить("Номенклатура");
	ТаблицаПродукции.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаПродукции.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаПродукции.Колонки.Добавить("Количество");
	ТаблицаПродукции.Колонки.Добавить("Коэффициент");
	ТаблицаПродукции.Колонки.Добавить("Сумма");
	ТаблицаПродукции.Колонки.Добавить("КоэффициентСтоимости", Новый ОписаниеТипов("Число")); //для распределения себестоимости выработки
	
	Если ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
		Для Каждого ТекущаяСтрока Из Продукция Цикл
			НоваяСтрока = ТаблицаПродукции.Добавить();
			НоваяСтрока.Сумма = ПолучитьИтогПоТаблицеМатериаловПоПродукции(ТаблицаМатериалов, ТекущаяСтрока.Номенклатура);
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			НоваяСтрока.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
			НоваяСтрока.Количество = ТекущаяСтрока.Количество;
			НоваяСтрока.Коэффициент = ТекущаяСтрока.Коэффициент;
		КонецЦикла;
	Иначе
		НоваяСтрока = ТаблицаПродукции.Добавить();
		НоваяСтрока.Сумма = ТаблицаМатериалов.Итог("Сумма");
		НоваяСтрока.Номенклатура = ПродукцияНоменклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		НоваяСтрока.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
		НоваяСтрока.Количество = ПродукцияНоменклатураКоличество;
		НоваяСтрока.Коэффициент = ПродукцияНоменклатураКоэффициент;
	КонецЕсли;
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	ОбщаяСебестоимостьПродукции = ТаблицаПродукции.Итог("Сумма");
	//себестоимость по прямым затратам (материалы)
	Для Каждого Товар Из ТаблицаПродукции Цикл
		Приход = Движения.ТоварыНаСкладах.Добавить();
		Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
		Приход.Период = Дата;
		Приход.Организация = ОрганизацияТоваров;
		Приход.Склад = СкладПродукции;
		Приход.Номенклатура = Товар.Номенклатура;
		Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		Приход.СерияНоменклатуры = Товар.СерияНоменклатуры;
		Приход.Количество = Товар.Количество * Товар.Коэффициент;
		Приход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.Сумма) - СебестоимостьОстаткаПленки; //nva
		Приход.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Товар.Сумма) - СебестоимостьОстаткаПленкиВал; //#8288 //nva
		//определяем коэффицент себестоимости данной продукции в общей себестоимости продукции выпуска
		Если НЕ ОбщаяСебестоимостьПродукции = 0 Тогда
			Товар.КоэффициентСтоимости = Приход.Сумма / ОбщаяСебестоимостьПродукции;
		Иначе
			Товар.КоэффициентСтоимости = 1;
		КонецЕсли;
	КонецЦикла;
	#КонецОбласти
	
	#Область РН_РасходМатериаловНаПроизводстве
	
	//расход материалов на производстве
	ВремРасходТоваров = Движения.ТоварыНаСкладах.Выгрузить();
	ВремРасходТоваров.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", "Сумма, Количество");
	
	Движения.РасходМатериаловНаПроизводстве.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из Материалы Цикл
		Движение = Движения.РасходМатериаловНаПроизводстве.Добавить();
		Движение.Период = Дата;
		Движение.ДокументСписания = Ссылка;
		Движение.Организация = Организация;      //+ #13763
		Движение.Подразделение = Подразделение;  //+ #13763
		Движение.Склад = СкладМатериалов;  		 //+ #13763
		Если ЗначениеЗаполнено(ТекущаяСтрока.Продукция) Тогда
			Движение.Продукция = ТекущаяСтрока.Продукция;  		 //+ #13763
		ИначеЕсли ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
			Движение.Продукция = ПродукцияНоменклатура;  		 //+ #13763
		КонецЕсли;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.НомерРасчета = ПродукцияНомерРасчета; //НомерРасчетаОснования; // исправлено 2017-07-31
		Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		Движение.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
		Движение.Количество = ТекущаяСтрока.Количество;
		Движение.КоличествоВБазовыхЕдиницах = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент; //+ #13763
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",Движение.Номенклатура);
		Отбор.Вставить("ХарактеристикаНоменклатуры",Движение.ХарактеристикаНоменклатуры);
		Отбор.Вставить("СерияНоменклатуры",Движение.СерияНоменклатуры);
		НайденныеСтроки = ВремРасходТоваров.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если НЕ НайденныеСтроки[0].Количество = 0 Тогда
				Движение.Сумма = (НайденныеСтроки[0].Сумма / НайденныеСтроки[0].Количество) * Движение.Количество;
			КонецЕсли;
		КонецЕсли; 		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область РН_ЗаказыНаПроизводство
	// регистр ЗаказыНаПроизводство Расход
	Движения.ЗаказыНаПроизводство.Записывать = Истина;
	Движения.ЗаказыНаТиповоеПроизводство.Записывать = Истина;
	Если ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
		//типовое производство
		Для Каждого ТекущаяСтрока Из Продукция Цикл
			Движение = Движения.ЗаказыНаТиповоеПроизводство.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ЗаказНаПроизводство = Основание;
			Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
			Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		КонецЦикла;
		//производство потолка из спецификаций
		Для Каждого ТекущаяСтрока Из Продукция Цикл
			Для Каждого ТекущаяСтрокаСпецификации Из ТекущаяСтрока.Спецификация.Состав Цикл
				Если ТекущаяСтрокаСпецификации.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ТиповойОтрез Тогда
					Движение = Движения.ЗаказыНаПроизводство.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.ЗаказНаПроизводство = Основание;
					Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент * ТекущаяСтрокаСпецификации.Количество;
					Движение.ОжидаемаяДатаПроизводства = Дата;
					
					СтруктураОсновнойФактурыСпецификации = Справочники.Номенклатура.ПолучитьОсновнуюФактуруИЦветПотолка(ТекущаяСтрокаСпецификации.Номенклатура);
					Движение.Фактура = СтруктураОсновнойФактурыСпецификации.ПродукцияФактура;
					Движение.ЦветФактуры = СтруктураОсновнойФактурыСпецификации.ПродукцияЦвет;
					Движение.НомерРасчета = ТекущаяСтрокаСпецификации.Номенклатура.Потолок_НомерРасчета;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Иначе
		//производство потолка
		Движение = Движения.ЗаказыНаПроизводство.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗаказНаПроизводство = Основание;
		Движение.Фактура = СтруктураОсновнойФактуры.ПродукцияФактура;
		Движение.Количество = ПродукцияНоменклатураКоличество;
		Движение.ОжидаемаяДатаПроизводства = Дата;
		Движение.Фактура = СтруктураОсновнойФактуры.ПродукцияФактура;
		Движение.ЦветФактуры = СтруктураОсновнойФактуры.ПродукцияЦвет;
		Движение.НомерРасчета = ПродукцияНомерРасчета;
	КонецЕсли;	
	#КонецОбласти
	
	#Область РН_ВыработкаПроизводства
	//выработка производства
	Движения.ВыработкаПроизводства.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из Материалы Цикл
		Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно 
			ИЛИ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ОстатокПленки Тогда
			Если НЕ ТекущаяСтрока.КоличествоКВыработке = 0 Тогда
				Движение = Движения.ВыработкаПроизводства.Добавить();
				Движение.Период = Дата;
				Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
				Движение.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
				Движение.Количество = ТекущаяСтрока.КоличествоКВыработке;
				Движение.ЗаказНаПроизводство = Основание;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	#КонецОбласти
	
	#Область РН_ЗаказыПокупателейВПроизводстве
	Движения.ЗаказыПокупателейВПроизводстве.Записывать = Истина;
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") и НЕ Основание.Пустая() Тогда
		Если ТипЗнч(Основание.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") и НЕ Основание.ДокументОснование.Пустая() Тогда
			Если ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
				Движение = Движения.ЗаказыПокупателейВПроизводстве.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.ЗаказПокупателя = Основание.ДокументОснование;
				Движение.Номенклатура = ПродукцияНоменклатура;
				Движение.Количество = ПродукцияНоменклатураКоличество;
			ИначеЕсли ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
				Для Каждого СтрокаПродукция Из Продукция Цикл
					Движение = Движения.ЗаказыПокупателейВПроизводстве.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.ЗаказПокупателя = Основание.ДокументОснование;
					Движение.Номенклатура = СтрокаПродукция.Номенклатура;
					Движение.Количество = СтрокаПродукция.Количество;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
	//nva+++ //резервирование материалов
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда 
		Если ТипЗнч(Основание.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Движения.ТоварыВРезервеНаСкладах.Записывать = Истина;
			
			лМатериалы = Материалы.Выгрузить();
			лМатериалы.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", "Количество");
			лМатериалы.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
			лМатериалы.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
			лМатериалы.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
			лМатериалы.ЗаполнитьЗначения(Перечисления.ВидыТабличнойЧасти.Материалы, "ВидТабличнойЧасти");
			лМатериалы.ЗаполнитьЗначения(СкладМатериалов, "Склад"); 
			лМатериалы.ЗаполнитьЗначения(Основание.ДокументОснование, "Заказ");
			
			рзМатериалы = НВД_ПолучитьОстаткиПоРезервамНамоментВремени(Ссылка.МоментВремени(), лМатериалы, Организация);
			
			Для Каждого Материал Из рзМатериалы Цикл
				Движения.ТоварыВРезервеНаСкладах.Записывать = Истина;
				Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.ДокументРезерва = Материал.ДокументРезерва;
				Движение.Организация = Материал.Организация;
				Движение.Склад = Материал.Склад;			
				Движение.Номенклатура = Материал.Номенклатура;
				Движение.ХарактеристикаНоменклатуры = Материал.ХарактеристикаНоменклатуры;
				Движение.СерияНоменклатуры = Материал.СерияНоменклатуры;
				Движение.ВидТабличнойЧасти = Материал.ВидТабличнойЧасти;
				Движение.Количество = ?(Материал.КоличествоВДокументе > Материал.КоличествоВРезерве, Материал.КоличествоВРезерве, Материал.КоличествоВДокументе);			
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	//nva---

	//выработка исполнителей (зарплата)
	// №6687 если способ начисления выработки "Пустой", движения по выработке не формируем
	Если НЕ СпособНачисленияВыработки.Пустая() Тогда
		
		Движения.ВыработкаИсполнителейПроизводства.Записывать = Истина;
		Если РучнаяКорректировкаВыработки Тогда // №1083 теперь доступно ручное изменение зарплаты
			НаборЗаписейПоВыработке = Выработка.Выгрузить();
			ДополнитьТаблицуВыработки(НаборЗаписейПоВыработке);
		Иначе	
			НаборЗаписейПоВыработке = Зарплата.РассчитатьВыработкуПоДокументу(Ссылка);
		КонецЕсли;
		
		Для Каждого СтрокаВыработки Из НаборЗаписейПоВыработке Цикл
			Движение = Движения.ВыработкаИсполнителейПроизводства.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаВыработки);
		КонецЦикла;
		
		//++ №8747
		//Если Константы.ВключатьВыработкуСотрудниковПроизводстваВСебестоимостьПродукции.Получить() Тогда
		Если ВключатьВыработкуСотрудниковПроизводстваВСебестоимостьПродукции Тогда
			//-- №8747
			ВыработкаДляСебестоимости = НаборЗаписейПоВыработке.Скопировать(); 
			ВыработкаДляСебестоимости.Свернуть("Продукция", "Стоимость");
			//добавим себестоимость выработки производства
			//++ #11766
			//СебестоимостьВыработки = Движения.ВыработкаИсполнителейПроизводства.Итог("Стоимость");		
			Для каждого СтрокаВыработки из ВыработкаДляСебестоимости Цикл
				Если ЗначениеЗаполнено(СтрокаВыработки.Продукция) Тогда
					Приход = Движения.ТоварыНаСкладах.Добавить();
					Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
					Приход.Период = Дата;
					Приход.Организация = ОрганизацияТоваров;
					Приход.Склад = СкладПродукции;
					Приход.Номенклатура = СтрокаВыработки.Продукция;
					НайденнаяПродукция = ТаблицаПродукции.НайтиСтроки(Новый Структура("Номенклатура", СтрокаВыработки.Продукция));
					Если НайденнаяПродукция.Количество() > 0 Тогда
						Приход.ХарактеристикаНоменклатуры = НайденнаяПродукция[0].ХарактеристикаНоменклатуры;
						Приход.СерияНоменклатуры = НайденнаяПродукция[0].СерияНоменклатуры;
					КонецЕсли;
					Приход.Сумма = СтрокаВыработки.Стоимость;
					Приход.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Приход.Сумма); //#8288			
				Иначе
					//-- #11766
					СебестоимостьВыработки = СтрокаВыработки.Стоимость;
					Для Каждого Товар Из ТаблицаПродукции Цикл
						Приход = Движения.ТоварыНаСкладах.Добавить();
						Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
						Приход.Период = Дата;
						Приход.Организация = ОрганизацияТоваров;
						Приход.Склад = СкладПродукции;
						Приход.Номенклатура = Товар.Номенклатура;
						Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
						Приход.СерияНоменклатуры = Товар.СерияНоменклатуры;
						Приход.Сумма = Товар.КоэффициентСтоимости * СебестоимостьВыработки;
						Приход.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Приход.Сумма); //#8288
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	НесколькоТочекПроизводства = Константы.НесколькоТочекПроизводства.Получить();
	
	// №8747
	ВключатьВыработкуСотрудниковПроизводстваВСебестоимостьПродукции = Константы.ВключатьВыработкуСотрудниковПроизводстваВСебестоимостьПродукции.Получить();
			
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	// №6687 если способ начисления выработки не заполнился по основанию, установим по константе
	Если СпособНачисленияВыработки.Пустая() Тогда
		СпособНачисленияВыработки = ?(Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить(), Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации, Перечисления.СпособыНачисленияВыработки.Бригадная);
	КонецЕсли;
		
	// №6283 если основание не заполнилось, устанавливаем по константе признак использования КТУ
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		ИспользоватьКТУВПроизводственныхОперациях = Константы.ИспользоватьКТУВПроизводственныхОперациях.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения, ИсполнителиНеЗаполненыВЗаказеНаПроизводство)
	
	Документы.ЗаказНаПроизводство.ПроверитьВозможностьВводаНаОснованииЗаказа(ДанныеЗаполнения);
	
	Основание = ДанныеЗаполнения;
	Организация = ДанныеЗаполнения.Организация;
	Подразделение = ДанныеЗаполнения.Подразделение;
	Цех = ДанныеЗаполнения.Цех;
	СкладПродукции = ДанныеЗаполнения.Склад;
	//СкладМатериалов = ОбщийМодульСервер.НастройкаПользователя("СкладМатериалов");
	СкладМатериалов = ДанныеЗаполнения.СкладМатериалов; //nva
	Если ЗначениеЗаполнено(Цех) 
		И ЗначениеЗаполнено(Цех.СкладМатериалов) Тогда	
		СкладМатериалов = Цех.СкладМатериалов;	// #14812
	КонецЕсли;
	ВидЗаказа = ДанныеЗаполнения.ВидЗаказа;
	
	СпособНачисленияВыработки = ДанныеЗаполнения.СпособНачисленияВыработки; // №6687
	ИспользоватьКТУВПроизводственныхОперациях = ДанныеЗаполнения.ИспользоватьКТУВПроизводственныхОперациях; // №6283
	
	ПродукцияНомерРасчета = ДанныеЗаполнения.ПродукцияНомерРасчета;
	ПродукцияНоменклатура = ДанныеЗаполнения.ПродукцияНоменклатура;
	ПродукцияНоменклатураКоличество = ДанныеЗаполнения.ПродукцияНоменклатураКоличество;
	ПродукцияНоменклатураЕдиницаИзмерения = ДанныеЗаполнения.ПродукцияНоменклатураЕдиницаИзмерения;
	ПродукцияНоменклатураКоэффициент = ДанныеЗаполнения.ПродукцияНоменклатураКоэффициент;				
	
	Для Каждого ОснованиеСтрока Из ДанныеЗаполнения.Продукция Цикл
		НоваяСтрока = Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОснованиеСтрока);
	КонецЦикла;
	
	Для Каждого ОснованиеСтрока Из ДанныеЗаполнения.Услуги Цикл
		НоваяСтрока = Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОснованиеСтрока);
	КонецЦикла;
	
	Для Каждого ОснованиеСтрокаМатериалов Из ДанныеЗаполнения.Материалы Цикл
		НоваяСтрока = Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОснованиеСтрокаМатериалов);
		Если ДанныеЗаполнения.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
			//для типового производства отнесем материалы к конкретной продукции
			Отбор = Новый Структура("УИСтроки", ОснованиеСтрокаМатериалов.УИСтроки);
			НайденнаяСтрокаПродукции = ДанныеЗаполнения.Продукция.НайтиСтроки(Отбор);
			Если НайденнаяСтрокаПродукции.Количество() > 0 Тогда
				НоваяСтрока.Продукция = НайденнаяСтрокаПродукции[0].Номенклатура;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОснованиеИсполнитель Из ДанныеЗаполнения.Исполнители Цикл
		НоваяСтрока = Исполнители.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОснованиеИсполнитель);
		ИсполнителиНеЗаполненыВЗаказеНаПроизводство = Ложь;
	КонецЦикла;
	
	Для Каждого ОснованиеИсполнитель Из ДанныеЗаполнения.ИсполнителиПоОперациям Цикл
		НоваяСтрока = ИсполнителиПоОперациям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОснованиеИсполнитель);
		ИсполнителиНеЗаполненыВЗаказеНаПроизводство = Ложь;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДату() Экспорт
	
	ТребуетсяНовыйНомер = НЕ Год(ТекущаяДатаСеанса()) = Год(Дата);
	Дата = ТекущаяДатаСеанса();
	Если ТребуетсяНовыйНомер Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 

//nva+++
#Область ВспомогательныеПроцедуры

// Получение остатков по резервам
Функция НВД_ПолучитьОстаткиПоРезервамНамоментВремени(МоментВремени, СписокПозиций, Организация)
	
	//++ №13982 на случай, когда резервы списываются по заказу покупателя, сделаем заглушку
	Если СписокПозиций.Колонки.Найти("ЗаказДоговор") = Неопределено Тогда
		СписокПозиций.Колонки.Добавить("ЗаказДоговор", новый ОписаниеТипов("ДокументСсылка.ЗаказДоговор"));
	КонецЕсли;
	//-- №13982
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Организация КАК Организация,
	|	Позиции.Склад КАК Склад,
	|	Позиции.Номенклатура КАК Номенклатура,
	|	Позиции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Позиции.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Позиции.Заказ КАК ДокументРезерва,
	//++ №13982
	|	Позиции.ЗаказДоговор КАК ЗаказДоговор,
	//-- №13982
	|	Позиции.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	Позиции.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Позиции			
	|ИЗ
	|	&СписокТоваров КАК Позиции
	|;	
	|//////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Позиции.Организация КАК Организация,
	|	Позиции.Склад КАК Склад,
	|	Позиции.Номенклатура КАК Номенклатура,
	|	Позиции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Позиции.ДокументРезерва КАК ДокументРезерва,
	//++ №13982
	|	Позиции.ЗаказДоговор КАК ЗаказДоговор,
	//-- №13982
	|	Позиции.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Позиции.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(Позиции.Количество, 0) КАК КоличествоВДокументе,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоВРезерве,
	//++ №13982
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиПоДоговору.КоличествоОстаток, 0) КАК КоличествоВРезервеПоДоговору
	//-- №13982
	|ИЗ
	|	ВТ_Позиции КАК Позиции
	|
	// №11431|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ТекДата) КАК ТоварыВРезервеНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&МоментВремени) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО Позиции.Организация = ТоварыВРезервеНаСкладахОстатки.Организация
	|			И Позиции.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
	|			И Позиции.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|			И Позиции.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И Позиции.ДокументРезерва = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
	|			И Позиции.СерияНоменклатуры = ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры
	|			И Позиции.ВидТабличнойЧасти = ТоварыВРезервеНаСкладахОстатки.ВидТабличнойЧасти
	|		
	//++ №13982
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&МоментВремени) КАК ТоварыВРезервеНаСкладахОстаткиПоДоговору
	|		ПО Позиции.Организация = ТоварыВРезервеНаСкладахОстаткиПоДоговору.Организация
	|			И Позиции.Склад = ТоварыВРезервеНаСкладахОстаткиПоДоговору.Склад
	|			И Позиции.Номенклатура = ТоварыВРезервеНаСкладахОстаткиПоДоговору.Номенклатура
	|			И Позиции.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстаткиПоДоговору.ХарактеристикаНоменклатуры
	|			И Позиции.ЗаказДоговор = ТоварыВРезервеНаСкладахОстаткиПоДоговору.ДокументРезерва
	|			И Позиции.СерияНоменклатуры = ТоварыВРезервеНаСкладахОстаткиПоДоговору.СерияНоменклатуры
	|			И Позиции.ВидТабличнойЧасти = ТоварыВРезервеНаСкладахОстаткиПоДоговору.ВидТабличнойЧасти
	//-- №13982
	|
	|ГДЕ
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
	//++ №13982
	|	Или ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиПоДоговору.КоличествоОстаток, 0) > 0
	//-- №13982
	|
	|";
	// №11431 комментируем т.к. остатки резервов берем на текущую дату Запрос.УстановитьПараметр("ТекДата", Дата);
	Запрос.УстановитьПараметр("СписокТоваров", СписокПозиций);
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


#КонецОбласти
//nva---

Функция ЗаказНаПроизводствоИсполнен(ЗаказНаПроизводство, Регистратор)
	
	Результат = Истина;
	
	Если ЗаказНаПроизводство.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка или ЗаказНаПроизводство.ВидЗаказа.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыНаПроизводствоОбороты.КоличествоПриход,
		|	ЗаказыНаПроизводствоОбороты.КоличествоРасход
		|ИЗ
		|	РегистрНакопления.ЗаказыНаПроизводство.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыНаПроизводствоОбороты
		|ГДЕ
		|	ЗаказыНаПроизводствоОбороты.Регистратор <> &Регистратор";
		
		Запрос.УстановитьПараметр("ЗаказНаПроизводство",ЗаказНаПроизводство);
		Запрос.УстановитьПараметр("Регистратор",Регистратор);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Итог("КоличествоПриход") > РезультатЗапроса.Итог("КоличествоРасход") Тогда
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли ЗаказНаПроизводство.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыНаПроизводствоОбороты.КоличествоПриход,
		|	ЗаказыНаПроизводствоОбороты.КоличествоРасход
		|ИЗ
		|	РегистрНакопления.ЗаказыНаТиповоеПроизводство.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыНаПроизводствоОбороты
		|ГДЕ
		|	ЗаказыНаПроизводствоОбороты.Регистратор <> &Регистратор";
		
		Запрос.УстановитьПараметр("ЗаказНаПроизводство",ЗаказНаПроизводство);
		Запрос.УстановитьПараметр("Регистратор",Регистратор);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Итог("КоличествоПриход") > РезультатЗапроса.Итог("КоличествоРасход") Тогда
			Результат = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСтоимостьПриходаПоСписанию(ТаблицаТоваров)
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Для Каждого ТекущийТовар Из ТаблицаТоваров Цикл
		Цена = Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(Дата, ОрганизацияТоваров, СкладМатериалов, ТекущийТовар.Номенклатура, ТекущийТовар.ХарактеристикаНоменклатуры, ТекущийТовар.СерияНоменклатуры);
		ТекущийТовар.Сумма = ТекущийТовар.Количество * ТекущийТовар.Коэффициент * Цена;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИтогПоТаблицеМатериаловПоПродукции(Знач ТаблицаМатериалов, Знач Продукция)
	
	Сумма = 0;
	Для Каждого ТекущаяСтрока Из ТаблицаМатериалов Цикл
		Если ТекущаяСтрока.Продукция = Продукция Тогда
			Сумма = Сумма + ТекущаяСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;
	Возврат Сумма;
КонецФункции

Процедура ЗаполнитьИсполнителейПоСмене() Экспорт
	
	ОбщийМодульСервер.ЗаполнитьИсполнителейПроизводстваПоСмене(ЭтотОбъект);
		
КонецПроцедуры

Процедура ДополнитьТаблицуВыработки(ТаблицаПоВыработке)
	
	ТаблицаПоВыработке.Колонки.Добавить("Период");
	ТаблицаПоВыработке.Колонки.Добавить("Регистратор");
	//ТаблицаПоВыработке.Колонки.Добавить("Продукция");
	ТаблицаПоВыработке.Колонки.Добавить("НомерРасчета");
	ТаблицаПоВыработке.Колонки.Добавить("ОбъектВыработки");
	ТаблицаПоВыработке.Колонки.Добавить("Подразделение");
	
	ТаблицаПоВыработке.ЗаполнитьЗначения(?(Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Дата), "Период");
	ТаблицаПоВыработке.ЗаполнитьЗначения(Ссылка, "Регистратор");
	//ТаблицаПоВыработке.ЗаполнитьЗначения(ПродукцияНоменклатура, "Продукция");
	ТаблицаПоВыработке.ЗаполнитьЗначения(ПродукцияНомерРасчета, "НомерРасчета");
	ТаблицаПоВыработке.ЗаполнитьЗначения(Ссылка, "ОбъектВыработки");
	ТаблицаПоВыработке.ЗаполнитьЗначения(Подразделение, "Подразделение");
	
КонецПроцедуры	

#КонецЕсли