#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	// проверяем условие уникальности наименования
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Наименование = &СкладыНаименование
	|	И Склады.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("СкладыНаименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
	    Сообщить("Склад с таким наименованием уже существует. Введите другое наименование.");
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли