
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Неактивный", Ложь, , , Истина);

	//++ #7273	
	Если Параметры.Свойство("РежимПодбора") Тогда
		РежимРаботыФормы = "Подбор";
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Элементы.ФормаВыбрать.Видимость = Ложь;
		Элементы.ФормаСоздать.Видимость = Ложь;
		Элементы.ФормаСоздатьГруппу.Видимость = Ложь;
		Элементы.ФормаСкопировать.Видимость = Ложь;
		Элементы.ФормаПеренести.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	//-- #7273
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
		Для Каждого м Из ВладелецФормы.ТекущийЭлемент.ПараметрыВыбора Цикл
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, СтрЗаменить(м.Имя, "Отбор.", ""), м.Значение,
				?(ТипЗнч(м.Значение) = Тип("СписокЗначений"), ВидСравненияКомпоновкиДанных.ВСписке, ВидСравненияКомпоновкиДанных.Равно),
				, Истина);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//++ #7273
	Если РежимРаботыФормы = "Подбор" Тогда
		СтандартнаяОбработка = Ложь;
		НоваяСтрока = ВыбранныеЗначения.Добавить();
		НоваяСтрока.Сотрудник = ВыбраннаяСтрока;
	КонецЕсли;
	//-- #7273

КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНеактивныхСотрудниковПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Неактивный", Ложь, , , НЕ ПоказыватьНеактивныхСотрудников);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//++ #7273
&НаКлиенте
Процедура Перенести(Команда)
	
	Для каждого ВыбранныйСотрудник из ВыбранныеЗначения Цикл
		ОповеститьОВыборе(ВыбранныйСотрудник.Сотрудник);	
	КонецЦикла;
	Закрыть();
	
КонецПроцедуры
//-- #7273

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Оформление неактивных
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(
		УсловноеОформление.Элементы, "Список", 
		Новый ПолеКомпоновкиДанных("Список.Неактивный"), ВидСравненияКомпоновкиДанных.Равно, Истина,
		ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
КонецПроцедуры
	
#КонецОбласти

