// обработчик команды "+ Документ"
Процедура Распределение_Документ(Команда, Форма, ИмяТЧ = "РаспределениеПлатежа") Экспорт
	
	ВидДокумента = СтрЗаменить(Команда.Имя, "Распределение_", "");
	ИмяФормы = "Документ." + ВидДокумента + ".ФормаВыбора";
	
	Контрагент = Форма.Объект.Контрагент;
	ЭлементРаспределениеПлатежа = Форма.Элементы[ИмяТЧ]; //.РаспределениеПлатежа;
	
	Если Не Контрагент.Пустая() Тогда		
		ПараметрВыбора = Новый Структура;
		ПараметрВыбора.Вставить("Отбор", 			  Новый Структура("Контрагент",  Контрагент));
		ПараметрВыбора.Вставить("МножественныйВыбор", Истина);
		
		ОткрытьФорму(ИмяФормы, ПараметрВыбора, ЭлементРаспределениеПлатежа);
		// результат обрабатывается в РаспределениеПлатежаОбработкаВыбора как владельца формы выбора
	Иначе
		ПоказатьОповещениеПользователя("Не указан контрагент");
	КонецЕсли;
	
КонецПроцедуры

Процедура РаспределениеОплаты(Форма, ИмяТЧ = "РаспределениеПлатежа", СтрокиРаспределения, СуммаРаспределения, ОписаниеОповещенияЗавершение = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Объект = Форма.Объект;
	
	//Если Объект[ИмяТЧ].Количество() = 0 Тогда
	Если СтрокиРаспределения.Количество() = 0 Тогда
		Возврат;
	Конецесли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Дата", Объект.Дата);
	ДополнительныеПараметры.Вставить("Валюта", Объект.Валюта);
	ДополнительныеПараметры.Вставить("ИмяТЧ", ИмяТЧ);
	ДополнительныеПараметры.Вставить("СтрокиРаспределения", СтрокиРаспределения);
	ДополнительныеПараметры.Вставить("СуммаРаспределения", СуммаРаспределения);
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияЗавершение", ОписаниеОповещенияЗавершение);
	
	Если НЕ ДопПараметры = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДополнительныеПараметры, ДопПараметры);
	КонецЕсли;
	
	//++ #16759 для новых документов отмена проведения не требуется, но при этом Проведен = Истина
	//Если Объект.Проведен Тогда
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.Проведен Тогда
	//-- #16759
		ОповещениеВопрос = Новый ОписаниеОповещения("ОповещениеВопросОтменаПроведениеПередРаспределением", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОповещениеВопрос, "Будет произведено распределение суммы по документам и документ будет распроведен. Продолжить?", РежимДиалогаВопрос.ДаНет); 
	Иначе
		РаспределитьСуммуОплатыПоДокументам(ДополнительныеПараметры);
		Форма.Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОповещениеВопросОтменаПроведениеПередРаспределением(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения)) Тогда
			РаспределитьСуммуОплатыПоДокументам(ДополнительныеПараметры);
			ОповещениеВопрос = Новый ОписаниеОповещения("ОповещениеВопросПроведениеПослеРаспределения", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(ОповещениеВопрос, "Провести документ?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	Иначе
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
			Если ДополнительныеПараметры.Свойство("СтараяСуммаДокумента") Тогда	
				Форма.Объект.Сумма = ДополнительныеПараметры.СтараяСуммаДокумента;
				//Форма.СтараяСуммаДокумента = ДополнительныеПараметры.СтараяСуммаДокумента;
				Форма.СуммаПриИзмененииКлиент();
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещениеВопросПроведениеПослеРаспределения(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если НЕ Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
			Форма.Модифицированность = Истина;
		КонецЕсли;
	Иначе
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура РаспределитьСуммуОплатыПоДокументам(ПараметрыРаспределения)
	
	Форма = ПараметрыРаспределения.Форма;
	Объект = Форма.Объект;
	
	СтрокиРаспределения = ПараметрыРаспределения.СтрокиРаспределения;
	ОбработкаТабличныхЧастейВызовСервера.РаспределитьСуммуОплатыПоДокументам(СтрокиРаспределения, ПараметрыРаспределения.СуммаРаспределения, ПараметрыРаспределения.Дата, ПараметрыРаспределения.Валюта);
	
	Для каждого ДанныеСтроки из СтрокиРаспределения Цикл
		ЗаполнитьЗначенияСвойств(Объект[ПараметрыРаспределения.ИмяТЧ][ДанныеСтроки.НомерСтроки - 1], ДанныеСтроки);
	КонецЦикла;
	
	//ОбновитьДанные();
	Если НЕ ПараметрыРаспределения.ОписаниеОповещенияЗавершение = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ПараметрыРаспределения.ОписаниеОповещенияЗавершение, Неопределено);	
	КонецЕсли;
	
КонецПроцедуры
