
Функция ПолучитьМинимальнуюСтоимость(Знач ДатаЦены, Знач ВидЦены, Знач Валюта, 
									 Знач Организация, Знач Подразделение, 
									 Знач ФактураШаблон, Знач ЦветФактуры = Неопределено, 
									 Знач ВидНоменклатуры) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Стоимость", 0);
	СтруктураВозврата.Вставить("СпособОпределения");
	СтруктураВозврата.Вставить("ПорядокНаценки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.Фактура КАК Фактура,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.ЦветФактуры КАК ЦветФактуры,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.Шаблон КАК Шаблон,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.Стоимость КАК Стоимость,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.СпособОпределения КАК СпособОпределения,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.ПорядокНаценки КАК ПорядокНаценки
	|ИЗ
	|	РегистрСведений.МинимальнаяСтоимостьПродукции.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	// №13380 |	И Подразделение = &Подразделение
	|				И Валюта = &Валюта
	|				И ВидНоменклатуры = &ВидНоменклатуры
	|				И ВидЦены = &ВидЦены
	|				И ВЫБОР КОГДА &ОтборПоПродукции ТОГДА Шаблон = &ФактураШаблон 
	|				  ИНАЧЕ Фактура = &ФактураШаблон И ЦветФактуры = &ЦветФактуры
	|                 КОНЕЦ
	|	) КАК МинимальнаяСтоимостьПродукцииСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", 		КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("ВидЦены", 		ВидЦены);
	
	Запрос.УстановитьПараметр("Организация", 	Организация);	
	// №13380 Запрос.УстановитьПараметр("Подразделение", 	Подразделение);
	Запрос.УстановитьПараметр("Валюта", 		Валюта);
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	
	Запрос.УстановитьПараметр("ОтборПоПродукции",	ТипЗнч(ФактураШаблон) = Тип("СправочникСсылка.ШаблоныПродукции"));
	Запрос.УстановитьПараметр("ФактураШаблон", 	ФактураШаблон);
	Запрос.УстановитьПараметр("ЦветФактуры", 	ЦветФактуры);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции
