#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработкаСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ДатаДвижения = Дата;
	Если ДатаДвижения = Дата(1,1,1) Тогда
		ДатаДвижения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	//проверка наличия остатков на складах
	ТаблицаНоменклатур = Новый ТаблицаЗначений;
	ТаблицаНоменклатур.Колонки.Добавить("Номенклатура");
	ТаблицаНоменклатур.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаНоменклатур.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаНоменклатур.Колонки.Добавить("Количество");
	ТаблицаНоменклатур.Колонки.Добавить("Коэффициент");
	Для Каждого ТекущаяСтрока Из Товары Цикл
		НоваяСтрока = ТаблицаНоменклатур.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		//НоваяСтрока.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
	КонецЦикла;
	
	//++ №8793 нужно свернуть, чтобы корректно списать себестоимость
	ТаблицаНоменклатур.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Коэффициент", "Количество"); 
	//-- №8793
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;

	
	Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, СкладИсточник, ТаблицаНоменклатур, ДатаДвижения);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	СтоимостьСписания = 0;
	СтоимостьСписанияВал = 0;
	
	//расход товаров-комплектующих
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого Товар Из ТаблицаНоменклатур Цикл
		Расход = Движения.ТоварыНаСкладах.Добавить();
		Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
		Расход.Период = ДатаДвижения;
		Расход.Организация = ОрганизацияТоваров;
		Расход.Склад = СкладИсточник;
		Расход.Номенклатура = Товар.Номенклатура;
		Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		Расход.СерияНоменклатуры = Товар.СерияНоменклатуры;
		Расход.Количество = Товар.Количество * Товар.Коэффициент; //Товар.Количество;
		//#8288
		//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, СкладИсточник, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
		СтруктураЦенОстатков =Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, СкладИсточник, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
		Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
		Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
		
		СтоимостьСписания = СтоимостьСписания + Расход.Сумма;
		СтоимостьСписанияВал = СтоимостьСписанияВал + Расход.СуммаВал;
	КонецЦикла;
	
	//приход товара-комплекта
	Приход = Движения.ТоварыНаСкладах.Добавить();
	Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
	Приход.Период = Дата;
	Приход.Организация = ОрганизацияТоваров;
	Приход.Склад = СкладПриемник;
	Приход.Номенклатура = Номенклатура;
	Приход.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	Приход.СерияНоменклатуры = СерияНоменклатуры;
	Приход.Количество = Количество * Коэффициент;
	Приход.Сумма = СтоимостьСписания;
	Если ПолучитьФункциональнуюОпцию("ДополнительнаяОценкаЗапасовВВалюте") Тогда
		Приход.СуммаВал = СтоимостьСписанияВал; //#8288
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли