
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("НастройкаСинхронизации") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("АдресКомпоновки") Тогда
		Возврат;
	КонецЕсли;
	
	АдресКомпоновки = Параметры.АдресКомпоновки;
	НастройкаСинхронизации = Параметры.НастройкаСинхронизации;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из Данные Цикл
		ТекущаяСтрока.Отметка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из Данные Цикл
		ТекущаяСтрока.Отметка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОбъектыКРегистрации(Команда)
	
	ПолучитьОбъектыКРегистрацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьКСинхронизации(Команда)
	
	ЗарегистрироватьКСинхронизацииНаСервере();
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьОбъектыКРегистрацииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Данные.Очистить();
	
	НастройкиСхемыКД = ПолучитьИзВременногоХранилища(АдресКомпоновки);
	
	Запрос = ОбменСБитрикс24ВызовСервера.ПолучитьЗапросДляПроверкиРегистрацииКонтрагента(НастройкаСинхронизации,, НастройкиСхемыКД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Данные.Добавить();
		
		НоваяСтрока.Отметка = Истина;
		НоваяСтрока.Ссылка = Выборка.Контрагент;
		НоваяСтрока.ТипДанных = ТипЗнч(Выборка.Контрагент);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


&НаСервере
Процедура ЗарегистрироватьКСинхронизацииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ТекущаяСтрока Из Данные Цикл
		
		Если НЕ ТекущаяСтрока.Отметка Или НЕ ЗначениеЗаполнено(ТекущаяСтрока.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = РегистрыСведений.ОчередьНаОтправкуВБитрикс24.СоздатьМенеджерЗаписи();
		НоваяЗапись.НастройкаСинхронизации	= НастройкаСинхронизации;
		НоваяЗапись.Объект 					= ТекущаяСтрока.Ссылка;
		НоваяЗапись.ДатаИзменения 			= ТекущаяДатаСеанса();
		НоваяЗапись.Записать();
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

