
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура СсылочныйВидЦеныПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ВидЦеныНоменклатуры.Видимость 			= Объект.СсылочныйВидЦены;
	Элементы.ВидЦеныНаПродукцию.Видимость 			= Объект.СсылочныйВидЦены;
	Элементы.ВидЦеныНаУслугиПроизводства.Видимость 	= Объект.СсылочныйВидЦены;
	
КонецПроцедуры

