#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//Если Объект.Проведен Тогда
	//	ЭтаФорма.ИспользоватьРежимПроведения=ИспользованиеРежимаПроведения.Неоперативный;
	//КонецЕсли;
	
	ФинансыСервер.УстановитьОтметкуНезаполненныхСтатейДоходовРасходов(Элементы);
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ТоварыСтатьяДоходов");
	ФинансыСервер.УстановитьВидимостьКолонокСтатейДиРВТабличнойЧасти(ЭтаФорма, МассивЭлементов, Истина);
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма);
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
	//nva+++
	ИспользоватьКонтрольКратности = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольКратностиЕдиницИзмерения");
	//nva---
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДанныеДокумента();
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = НЕ ПраваПользователей.РазрешеноПриходоватьНаСклад(Объект.Склад);
		Если Отказ Тогда
			Сообщить("У текущего пользователя нет прав для оформления прихода на склад """ + Объект.Склад + """");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// проверяем заполненность статей доходов/расходов
	ФинансыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);	
	//Если Объект.Проведен Тогда
	//	ЭтаФорма.ИспользоватьРежимПроведения=ИспользованиеРежимаПроведения.Неоперативный;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиИВыделить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаСтрокиПоиска", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаАльтернативногоПоиска", , ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтрокиПоиска(СтрокаПоиска, Параметры) Экспорт
	
	// Разметка выделяемых строк
	Если СтрокаПоиска <> "" И СтрокаПоиска <> Неопределено  Тогда
		Элементы.ТоварыСнятьВыделениеПоНайти.Видимость=Истина;
		Элементы.ТоварыНайтиИВыделить.Видимость=Ложь;
		Для каждого Строка Из Объект.Товары	Цикл
			Если СтрНайти(Строка.Номенклатура, СтрокаПоиска) > 0 ИЛИ СтрНайти(Строка.ХарактеристикаНоменклатуры, СтрокаПоиска) > 0  Тогда
				Строка.ВыделятьПриПоиске = Истина;
			Иначе
				Строка.ВыделятьПриПоиске = Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Элементы.ТоварыСнятьВыделениеПоНайти.Видимость=Ложь;
		Элементы.ТоварыНайтиИВыделить.Видимость=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеПоНайти(Команда)
	Для каждого Строка Из Объект.Товары	Цикл
		Строка.ВыделятьПриПоиске = Ложь;
	КонецЦикла;
	Элементы.ТоварыСнятьВыделениеПоНайти.Видимость=Ложь;
	Элементы.ТоварыНайтиИВыделить.Видимость=Истина;
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	Объект.СтатьяДоходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьДанныеДокумента()
	
	СуммаДокументаВрем = Объект.Товары.Итог("Сумма");
	Если НЕ Объект.СуммаДокумента = СуммаДокументаВрем Тогда
		Объект.СуммаДокумента = СуммаДокументаВрем;
	КонецЕсли;  
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАльтернативнуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.АльтернативнаяЕдиницаИзмерения;
КонецФункции
	
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ОбновитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	//nva+++
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	//#2792
	Если ИспользоватьКонтрольКратности Тогда
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
		ОтказВИзмененииКоличества = Ложь;
		ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества);
		Если ОтказВИзмененииКоличества Тогда
			СтрокаТабличнойЧасти.Количество = 0;
		КонецЕсли;
	КонецЕсли;
	//nva---
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
КонецПроцедуры

//nva+++
&НаСервере
Процедура ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества)
	
	ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(ОтказВИзмененииКоличества, СтруктураДанные, Перечисления.ВидыДокументовПроверкиКратности.ОприходованиеТоваров);
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ИмяТаблицы = "Товары")
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",			ИмяТаблицы);
	СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 	СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 			СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 				Объект.Дата);
//	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	СтруктураДанные.Вставить("Организация",			Объект.Организация);
	СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
//	СтруктураДанные.Вставить("Контрагент",			Объект.Контрагент);
//	СтруктураДанные.Вставить("ДоговорКонтрагента", 	Объект.ДоговорКонтрагента);
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);

	Возврат СтруктураДанные;
	
КонецФункции
//nva---

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Если НЕ Элементы.Товары.ТекущиеДанные.Количество = 0 Тогда
		Элементы.Товары.ТекущиеДанные.Цена = Элементы.Товары.ТекущиеДанные.Сумма / Элементы.Товары.ТекущиеДанные.Количество;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяДоходов");
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура КомандаПечатьНакладнаяНаТовары(Команда)
//	
//	УправлениеПечатьюКлиент.ПотолкиПечать(ЭтотОбъект, "НакладнаяНаТовары");
//	
//КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
			
	//++ #4208		
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	ГруппаОтбора1 = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВыделятьПриПоиске");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ВесеннеЗеленый);		
	//-- #4208		
			
КонецПроцедуры



&НаСервере
Функция ПолучитьСписокВидовНоменклатурыТовары()
	
	Возврат Справочники.Номенклатура.ПолучитьСписокВидовНоменклатурыТовары();
	
КонецФункции

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	ПараметрыПодбора.Вставить("Склад",					Объект.Склад);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыТовары());
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	ОбновитьДанныеДокумента();
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоГруппе(Команда)
	
	//Форма = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбораГруппы", , ЭтаФорма);
	//ВыбранноеЗначение = Форма.ОткрытьМодально();
	//
	//Если НЕ ВыбранноеЗначение = Неопределено Тогда
	//	Если Объект.Товары.Количество() > 0 Тогда
	//		Если Вопрос("Очистить табличную часть товаров?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	//			ЗаполнитьТоварыПоГруппеНоменклатуры(ВыбранноеЗначение, Истина);
	//		Иначе
	//			ЗаполнитьТоварыПоГруппеНоменклатуры(ВыбранноеЗначение, Ложь);
	//		КонецЕсли;
	//	Иначе
	//		ЗаполнитьТоварыПоГруппеНоменклатуры(ВыбранноеЗначение, Ложь);
	//	КонецЕсли;
	//КонецЕсли;
	
	Если Объект.Товары.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТоварыПоГруппеФрагмент", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Очистить табличную часть товаров?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьТоварыПоГруппеФрагмент(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварыПоГруппеФрагмент(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",,ЭтаФорма,,,,
		Новый ОписаниеОповещения("ЗаполнитьТоварыПоГруппеПриЗавершенииВыбора",ЭтотОбъект));
		
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьТоварыПоГруппеПриЗавершенииВыбора(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьТоварыПоГруппеНоменклатуры(Результат);
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТоварыПоГруппеНоменклатуры(Знач ГруппаНоменклатуры) //, ОчищатьТаблицуТовары = Ложь)
	
	//Если ОчищатьТаблицуТовары Тогда
	//	Объект.Товары.Очистить();
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	1 КАК Коэффициент,
	|	1 КАК Количество
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&Родитель)";
	Запрос.УстановитьПараметр("Родитель", ГруппаНоменклатуры);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//НоваяСтрока = Объект.Товары.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		//НоваяСтрока.Коэффициент = 1;
		//НоваяСтрока.Количество = 1;
		СтруктураОтбора = Новый Структура("Номенклатура", Выборка.Номенклатура);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦену(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияНовойЦены", ЭтаФорма);
	ПоказатьВводЗначения(Оповещение, 0, "Введите цену", Новый ОписаниеТипов("число"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияНовойЦены(ВыбЗнач, Параметры) Экспорт
    Если НЕ ВыбЗнач = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
			ТекущаяСтрока.Цена = ВыбЗнач;
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		КонецЦикла;
		Модифицированность = Истина;
		ОбновитьДанныеДокумента();
    КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьЦенуПоПоступлениям(Команда)
	
	ЦеныЗаполнены = Ложь;
	ЗаполнитьЦенуПоОприходованиямПоступлениямНаСервере(ЦеныЗаполнены);
	
	Если ЦеныЗаполнены Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены заполнены'"),
			,
			НСтр("ru= 'В строках документа заполнены цены'"),
			БиблиотекаКартинок.Информация32);
		Модифицированность = Истина;
		ОбновитьДанныеДокумента();
	Иначе
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены не заполнены'"),
			,
			НСтр("ru= 'Ни в одной строке цена не заполнена'"),
			БиблиотекаКартинок.Информация32);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦенуПоОприходованиямПоступлениямНаСервере(ЦеныЗаполнены)
                  
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ИсходнаяТаблица.Номенклатура КАК Номенклатура,
	|	ИсходнаяТаблица.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ИсходнаяТаблица.СерияНоменклатуры КАК Серия
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	&ИсходнаяТаблица КАК ИсходнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОприходованиеТоваров.Ссылка.МоментВремени КАК МоментВремени,
	|	ОприходованиеТоваров.Номенклатура КАК Номенклатура,
	|	ОприходованиеТоваров.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ОприходованиеТоваров.СерияНоменклатуры КАК Серия,
	|	ОприходованиеТоваров.Цена КАК Цена,
	|	ОприходованиеТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ЦеныОприходований
	|ИЗ
	|	Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
	|		ПО ОприходованиеТоваров.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ОприходованиеТоваров.ХарактеристикаНоменклатуры = ТаблицаТовары.Характеристика
	|			И ОприходованиеТоваров.СерияНоменклатуры = ТаблицаТовары.Серия
	|ГДЕ
	|	ОприходованиеТоваров.Ссылка.Проведен
	|	И ОприходованиеТоваров.Ссылка.Дата < &Дата
	|	И ОприходованиеТоваров.Цена <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваров.Ссылка.МоментВремени КАК МоментВремени,
	|	ПоступлениеТоваров.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваров.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ПоступлениеТоваров.СерияНоменклатуры КАК Серия,
	|	ПоступлениеТоваров.Цена КАК Цена,
	|	ПоступлениеТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ЦеныПоступлений
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
	|		ПО ПоступлениеТоваров.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ПоступлениеТоваров.ХарактеристикаНоменклатуры = ТаблицаТовары.Характеристика
	|			И ПоступлениеТоваров.СерияНоменклатуры = ТаблицаТовары.Серия
	|ГДЕ
	|	ПоступлениеТоваров.Ссылка.Проведен
	|	И ПоступлениеТоваров.Ссылка.Дата < &Дата
	|	И ПоступлениеТоваров.Цена <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныОприходований.Номенклатура КАК Номенклатура,
	|	ЦеныОприходований.Характеристика КАК Характеристика,
	|	ЦеныОприходований.Серия КАК Серия,
	|	ЦеныОприходований.Цена КАК Цена,
	|	ЦеныОприходований.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ЦеныПоследнихОприходований
	|ИЗ
	|	ЦеныОприходований КАК ЦеныОприходований
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныОприходований КАК ОтборПоследних
	|		ПО ЦеныОприходований.Номенклатура = ОтборПоследних.Номенклатура
	|			И ЦеныОприходований.Характеристика = ОтборПоследних.Характеристика
	|			И ЦеныОприходований.Серия = ОтборПоследних.Серия
	|			И ЦеныОприходований.МоментВремени < ОтборПоследних.МоментВремени
	|ГДЕ
	|	ОтборПоследних.МоментВремени ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныПоступлений.Номенклатура КАК Номенклатура,
	|	ЦеныПоступлений.Характеристика КАК Характеристика,
	|	ЦеныПоступлений.Серия КАК Серия,
	|	ЦеныПоступлений.Цена КАК Цена,
	|	ЦеныПоступлений.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ЦеныПоследнихПоступлений
	|ИЗ
	|	ЦеныПоступлений КАК ЦеныПоступлений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныПоступлений КАК ОтборПоследних
	|		ПО ЦеныПоступлений.Номенклатура = ОтборПоследних.Номенклатура
	|			И ЦеныПоступлений.Характеристика = ОтборПоследних.Характеристика
	|			И ЦеныПоступлений.Серия = ОтборПоследних.Серия
	|			И ЦеныПоступлений.МоментВремени < ОтборПоследних.МоментВремени
	|ГДЕ
	|	ОтборПоследних.МоментВремени ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЦеныПоследнихПоступлений.Номенклатура.БазоваяЕдиницаИзмерения, ЦеныПоследнихОприходований.Номенклатура.БазоваяЕдиницаИзмерения) = ВЫБОР
	|				КОГДА ЕСТЬNULL(ЦеныПоследнихПоступлений.Цена, 0) = 0
	|					ТОГДА ЦеныПоследнихОприходований.ЕдиницаИзмерения
	|				ИНАЧЕ ЦеныПоследнихПоступлений.ЕдиницаИзмерения
	|			КОНЕЦ
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЦеныПоследнихПоступлений.Цена, 0) = 0
	|						ТОГДА ЕСТЬNULL(ЦеныПоследнихОприходований.Цена, 0)
	|					ИНАЧЕ ЕСТЬNULL(ЦеныПоследнихПоступлений.Цена, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ЦеныПоследнихПоступлений.Цена, 0) = 0
	|					ТОГДА ЕСТЬNULL(ЦеныПоследнихОприходований.Цена, 0)
	|				ИНАЧЕ ЕСТЬNULL(ЦеныПоследнихПоступлений.Цена, 0)
	|			КОНЕЦ / ВЫБОР
	|				КОГДА ЕСТЬNULL(ЦеныПоследнихПоступлений.Цена, 0) = 0
	|					ТОГДА ЦеныПоследнихОприходований.ЕдиницаИзмерения.Коэффициент
	|				ИНАЧЕ ЦеныПоследнихПоступлений.ЕдиницаИзмерения.Коэффициент
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЦеныПоследнихПоступлений.Цена, 0) = 0
	|			ТОГДА ЦеныПоследнихОприходований.ЕдиницаИзмерения
	|		ИНАЧЕ ЦеныПоследнихПоступлений.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныПоследнихОприходований КАК ЦеныПоследнихОприходований
	|		ПО ТаблицаТовары.Номенклатура = ЦеныПоследнихОприходований.Номенклатура
	|			И ТаблицаТовары.Характеристика = ЦеныПоследнихОприходований.Характеристика
	|			И ТаблицаТовары.Серия = ЦеныПоследнихОприходований.Серия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныПоследнихПоступлений КАК ЦеныПоследнихПоступлений
	|		ПО ТаблицаТовары.Характеристика = ЦеныПоследнихПоступлений.Характеристика
	|			И ТаблицаТовары.Серия = ЦеныПоследнихПоступлений.Серия
	|			И ТаблицаТовары.Номенклатура = ЦеныПоследнихПоступлений.Номенклатура";
		
	Запрос.УстановитьПараметр("ИсходнаяТаблица", Объект.Товары.Выгрузить(,"НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры"));
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));

	   //Запрос.Выполнить().Выгрузить()
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаТЧ = Объект.Товары[Выборка.НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка, "Цена");	
		СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		ЦеныЗаполнены = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОстатокПленки(Команда)
	
	//Парам = Новый Структура;
	//Парам.Вставить("Организация", Объект.Организация);
	//Парам.Вставить("Склад", Объект.Склад);
	//ОткрытьФорму("Документ.ОприходованиеТоваров.Форма.ФормаПараметрыОстаткаПленки",Парам,,,ВариантОткрытияОкна.ОтдельноеОкно,,Новый ОписаниеОповещения("ПослеВводаДанныхОстатка",ЭтаФорма));
	
	ПараметрыФормы = Новый Структура("РежимДобавленияОстаткаПленки", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаДанныхОстатка", ЭтотОбъект, ПараметрыФормы);	
	ОткрытьФорму("ОбщаяФорма.ФормаДобавленияПродукции", ПараметрыФормы, ЭтотОбъект, ,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДанныхОстатка(Результат, Парам2) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	//Для Каждого Отрез из Результат Цикл
	//	ОстатокФактура = Отрез.Фактура;
	//	ОстатокЦвет = Отрез.Цвет;
	//	ОстатокКоличество = Отрез.Количество; //в м2
	//	ПродукцияНомерРасчета = ОбменСEasyCeiling.ПолучитьНомерТиповогоОтреза(Формат(Отрез.Длина,"ЧГ="),Формат(Отрез.Ширина,"ЧГ="));
	//	
	//	НоменклатураОстатка = СоздатьНоменклатуруОстаткаНаСервере(ПродукцияНомерРасчета, ОстатокЦвет, ОстатокКоличество);
	//	
	НоменклатураОстатка = Результат.Номенклатура;
	Если НЕ НоменклатураОстатка.Пустая() Тогда
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = НоменклатураОстатка;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.ЕдиницаИзмерения = ПолучитьАльтернативнуюЕдиницуИзмеренияНоменклатуры(НоваяСтрока.Номенклатура);
		НоваяСтрока.Коэффициент = ПолучитьКоэффициентАльтернативнойЕдиницыИзмерения(НоваяСтрока.Номенклатура);
		Модифицированность = Истина;
	КонецЕсли;			
	//КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоэффициентАльтернативнойЕдиницыИзмерения(Номенклатура)
	Возврат Номенклатура.АльтернативнаяЕдиницаИзмерения.Коэффициент;
КонецФункции

&НаСервере
Функция СоздатьНоменклатуруОстаткаНаСервере(НомерРасчета, Цвет, Количество)
	
	Возврат ОбменСEasyCeiling.ПолучитьНоменклатуруОстатка(НомерРасчета, Цвет, Количество); 
	
КонецФункции


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	//#2792
	Если ИспользоватьКонтрольКратности Тогда
		ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(Отказ, Объект, Перечисления.ВидыДокументовПроверкиКратности.ОприходованиеТоваров);
	КонецЕсли;
	
КонецПроцедуры

