Функция КодироватьДанныеПакета(ДанныеПакета) Экспорт
	Возврат КодироватьСтроку(ДанныеПакета,СпособКодированияСтроки.КодировкаURL);
КонецФункции

Функция ДекодироватьДанныеПакета(ДанныеПакета) Экспорт
	Возврат РаскодироватьСтроку(ДанныеПакета,СпособКодированияСтроки.КодировкаURL);
КонецФункции

// Функция проверяет находится ли телефон в исключениях 
Функция НомерТелефонаВИсключениях(Знач НомерТелефона) Экспорт
	
	НомерТелефона = СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(НомерТелефона);
	МенеджерЗаписи = РегистрыСведений.НомераТелефоновИсключений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НомерТелефона = НомерТелефона;
	МенеджерЗаписи.Прочитать();
	
	Возврат МенеджерЗаписи.Выбран();
	
КонецФункции