&НаКлиенте
Процедура ИнициализироватьКартуЯндекс()
	
	Если ПустаяСтрока(Город) Тогда
		Город = ПолучитьГородПоУмолчанию();
	КонецЕсли;
	
	КартаЯндекс = КартыЯндекс.ИнициализироватьКартуМеток(Город, Адрес, Геометка, РежимСовместимости);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИнициализироватьКартуЯндекс();
КонецПроцедуры

&НаСервере
Функция ПолучитьГородПоУмолчанию()
	Возврат Константы.ГородПоУмолчанию.Получить();
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимСовместимости = ХранилищеОбщихНастроек.Загрузить("ЯндексКарты_РежимСовместимости",, Пользователи.ТекущийПользователь());
	
	Город = Параметры.Город;
	Адрес = Параметры.Адрес;
	ИспользоватьКартыЯндекс = Параметры.ИспользоватьКартыЯндекс;
	Геометка = Параметры.Геометка;
	
	Элементы.КартаЯндекс.Видимость = ИспользоватьКартыЯндекс;
	Элементы.ГруппаНастройки.Видимость = ИспользоватьКартыЯндекс;
	
	Если ПустаяСтрока(Город) Тогда
		Элементы.Город.Видимость = Ложь;
	КонецЕсли;
	
	Если ИспользоватьКартыЯндекс Тогда
		Элементы.ДекорацияЗаголовок.Заголовок = "Укажите геометку щелкнув мышкой по карте или введите геометку вручную в соответствующем поле";
	Иначе
		Элементы.ДекорацияЗаголовок.Заголовок = "Введите геометку (два числа, разделенных запятой)";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСовместимостиПриИзменении(Элемент)
	РежимСовместимостиПриИзмененииНаСервере();
	ИнициализироватьКартуЯндекс();
КонецПроцедуры

&НаСервере
Процедура РежимСовместимостиПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("ЯндексКарты_РежимСовместимости",, РежимСовместимости,, Пользователи.ТекущийПользователь());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КартаЯндексПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Попытка
		Геометка = Строка(Элемент.Документ.parentWindow.MyCoords["0"]) + ", " + Строка(Элемент.Документ.parentWindow.MyCoords["1"]);
		КартаЯндекс = КартыЯндекс.ИнициализироватьКартуМеток(Город, Адрес, Геометка, РежимСовместимости);
	Исключение
		//ПоказатьПредупреждение(,"Не удалось получить координаты геометки: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЭтаФорма.Закрыть(Геометка);
	
КонецПроцедуры
