&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();	
	УстановитьОтборАрхивныеЭлементы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Оформление архивных
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(
		УсловноеОформление.Элементы, "Список", 
		Новый ПолеКомпоновкиДанных("Список.Архивная"), ВидСравненияКомпоновкиДанных.Равно, Истина,
		ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПоказыватьАрхивныеПриИзменении(Элемент)
		
	УстановитьОтборАрхивныеЭлементы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборАрхивныеЭлементы(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список,
		"Архивная",
		Ложь,
		,
		,
		Не Форма.ПоказыватьАрхивные);
	
КонецПроцедуры

