&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// запретим сортировку по указанным полям, так как есть спортировка по полю РеквизитДопУпорядочивания
	ЗапрещенныеПоляСортировки = Новый Массив;
	ЗапрещенныеПоляСортировки.Добавить("Наименование");
	ЗапрещенныеПоляСортировки.Добавить("Код");

	Список.УстановитьОграниченияИспользованияВПорядке(ЗапрещенныеПоляСортировки);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПорядок(Команда)
	
	Вверх = (Команда.Имя = "ПереместитьВверх");
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ИзменитьПорядокНаСервере(ТекущиеДанные.Ссылка, Вверх);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

Процедура ИзменитьПорядокНаСервере(ТекущееПоле, Вверх)
	
	Если Вверх Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	ПорядокЗаполненияПолейЛида.Ссылка КАК Ссылка,
		|	ПорядокЗаполненияПолейЛида.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	Справочник.ПорядокЗаполненияПолейЛида КАК ПорядокЗаполненияПолейЛида
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПорядокЗаполненияПолейЛида КАК ТекущееПоле
		|		ПО (ТекущееПоле.Ссылка = &ТекущееПоле)
		|ГДЕ
		|	ПорядокЗаполненияПолейЛида.РеквизитДопУпорядочивания <= ТекущееПоле.РеквизитДопУпорядочивания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокЗаполненияПолейЛида.РеквизитДопУпорядочивания УБЫВ";	
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	ПорядокЗаполненияПолейЛида.Ссылка КАК Ссылка,
		|	ПорядокЗаполненияПолейЛида.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	Справочник.ПорядокЗаполненияПолейЛида КАК ПорядокЗаполненияПолейЛида
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПорядокЗаполненияПолейЛида КАК ТекущееПоле
		|		ПО (ТекущееПоле.Ссылка = &ТекущееПоле)
		|ГДЕ
		|	ПорядокЗаполненияПолейЛида.РеквизитДопУпорядочивания >= ТекущееПоле.РеквизитДопУпорядочивания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокЗаполненияПолейЛида.РеквизитДопУпорядочивания";
	КонецЕсли;
	 
	 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущееПоле", ТекущееПоле);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если НЕ Выборка.Количество() = 2 Тогда
		Возврат;
	КонецЕсли;
	
	Выборка.Следующий();
	СпрОбъект1 = Выборка.Ссылка.ПолучитьОбъект();	
	Порядок1 = Выборка.РеквизитДопУпорядочивания;
	
	Выборка.Следующий();
	СпрОбъект2 = Выборка.Ссылка.ПолучитьОбъект();
	Порядок2 = Выборка.РеквизитДопУпорядочивания;
	
	СпрОбъект1.РеквизитДопУпорядочивания = Порядок2;
	СпрОбъект2.РеквизитДопУпорядочивания = Порядок1;
	
	Попытка
		СпрОбъект1.Записать();	
		СпрОбъект2.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

