
&НаКлиенте
Процедура ФактураПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Фактура.ТекущиеДанные;
	
	ЦветаФактуры.Отбор.Элементы.Очистить();
	
	ЭО=ЦветаФактуры.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
    ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Владелец");
    ЭО.ПравоеЗначение=ТекущиеДанные.ССылка;
    ЭО.Использование=Истина;
	
	Элементы.ЦветаФактуры.Обновить();
КонецПроцедуры

&НаСервере
Процедура СвернутьТаблицуВыбранныхЗначений()
	ВременнаяТаблица = Новый ТаблицаЗначений;
	ВременнаяТаблица = ВыбранныеЗначения.Выгрузить();
	ВременнаяТаблица.Свернуть("Фактура, ЦветФактуры","");
	
	ВыбранныеЗначения.Очистить();
	
	Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
		НоваяСтрока = ВыбранныеЗначения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаФактурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НоваяСтрока = ВыбранныеЗначения.Добавить();
	НоваяСтрока.Фактура = Элементы.Фактура.ТекущиеДанные.Ссылка;
	НоваяСтрока.ЦветФактуры = Элементы.ЦветаФактуры.ТекущиеДанные.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	СвернутьТаблицуВыбранныхЗначений();
	Закрыть(ВыбранныеЗначения);
КонецПроцедуры
