
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

//++ №14608 создаём группы в справочнике "Виды файлов программы построителя" и раскидываем предопределенные элементы по группам
Процедура РазместитьПреопределенныеЭлементыПоГруппам() Экспорт
	
	МассивКПеремещению = новый Массив;
	
	// Общие
	МассивЭлементов = новый Массив;
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.Макет);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.ФайлПотолка);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.ЧертежПокупатель);
	
	МассивКПеремещению.Добавить(новый Структура("Группа, МассивЭлементов", НайтиСоздатьГруппу("Общие"), МассивЭлементов));
	
	// EasyCeilings
	МассивЭлементов = новый Массив;
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFECДляКлиента);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFECДляКлиентаART);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFECДляМонтажников);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFECДляПроизводителяЕдиныйРаскрой);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFECДляПроизводителяРаскрой);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFECДляПроизводителяРаскройПоПолотнам);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFECДляПроизводителяРисунок);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFECТаблицаКоординат);
	
	МассивКПеремещению.Добавить(новый Структура("Группа, МассивЭлементов", НайтиСоздатьГруппу("EasyCeilings"), МассивЭлементов));
	
	// NewMatRos
	МассивЭлементов = новый Массив;
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFNMГарантия);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFNMКоординаты);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFNMМонтаж);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFNMПолотна);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFNMРисунок);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFNMФакс);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFNMЧертеж);
	
	МассивКПеремещению.Добавить(новый Структура("Группа, МассивЭлементов", НайтиСоздатьГруппу("NewMatRos"), МассивЭлементов));
	
	// SmartBuilder
	МассивЭлементов = новый Массив;
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFSBДляКлиентаВидСверху);
	МассивЭлементов.Добавить(Справочники.ВидыФайловПрограммыПостроителя.PDFSBДляПроизводителяВидСверху);
	
	МассивКПеремещению.Добавить(новый Структура("Группа, МассивЭлементов", НайтиСоздатьГруппу("SmartBuilder"), МассивЭлементов));
	
	// Размещаем по группам
	Для Каждого ДанныеКПеремещению Из МассивКПеремещению Цикл
		
		Для Каждого ТекущийЭлементСправочника Из ДанныеКПеремещению.МассивЭлементов Цикл
			
			СправочникОбъект = ТекущийЭлементСправочника.ПолучитьОбъект();
			СправочникОбъект.Родитель = ДанныеКПеремещению.Группа;
			
			СправочникОбъект.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиСоздатьГруппу(Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыФайловПрограммыПостроителя.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыФайловПрограммыПостроителя КАК ВидыФайловПрограммыПостроителя
	|ГДЕ
	|	ВидыФайловПрограммыПостроителя.Наименование = &Наименование
	|	И ВидыФайловПрограммыПостроителя.ЭтоГруппа
	|";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	СправочникОбъект = Справочники.ВидыФайловПрограммыПостроителя.СоздатьГруппу();
	
	СправочникОбъект.Наименование = Наименование;
	СправочникОбъект.Записать();
	
	Возврат СправочникОбъект.Ссылка;
	
КонецФункции
//-- №14608

#КонецОбласти

#КонецЕсли