
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// предопределнные элементы
	
	//Начало изменен при переходе на 2.0
	//Параметры.Отгружен = Справочники.СтатусыЗаказовНаПроизводство.Отгружен;
	Параметры.Произведен = Справочники.СтатусыЗаказовНаПроизводство.Произведен;
	//Конец изменен при переходе на 2.0
	
	//Параметры.Полотно = Справочники.ВидыНоменклатуры.Полотно;
	Параметры.Остаток = Справочники.Номенклатура.ОстаткиПленки;
	
	МассивВидовНоменклатурПолотна = Новый Массив;
	МассивВидовНоменклатурПолотна.Добавить(Справочники.ВидыНоменклатуры.Полотно);
	МассивВидовНоменклатурПолотна.Добавить(Справочники.ВидыНоменклатуры.ОстатокПленки);	

	//Начало изменен при переходе на 2.0
	//Список.Параметры.УстановитьЗначениеПараметра("Отгружен",Параметры.Отгружен);
	Список.Параметры.УстановитьЗначениеПараметра("Произведен", Параметры.Произведен);
	//Конец изменен при переходе на 2.0
	
	Список.Параметры.УстановитьЗначениеПараметра("ПолотноИОстатокПленки", МассивВидовНоменклатурПолотна);
//	Список.Параметры.УстановитьЗначениеПараметра("Остаток", Параметры.Остаток);
	Список.Параметры.УстановитьЗначениеПараметра("Год", 	Параметры.Год);	
	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", 	Параметры.Подразделение);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоМесяцу", 	Параметры.ОтборПоМесяцу);
	Список.Параметры.УстановитьЗначениеПараметра("Месяц", 	Параметры.Месяц);
	Список.Параметры.УстановитьЗначениеПараметра("ПоДатеПроизводства", 	Параметры.ПоДатеПроизводства);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти