&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьКонстанты();	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ВремяУстановкиПризнакаЗагрузки = Дата(1, 1, 1) Тогда
		РазницаВремениЗапуска = ТекущаяДата() - ВремяУстановкиПризнакаЗагрузки;
		Если РазницаВремениЗапуска < 180 Тогда
			Элементы.ФормаСброситьФлагЗагрузкиИЗакрыть.Доступность = Ложь;
			Элементы.ФормаСброситьФлаг.Доступность = Ложь;
			Элементы.ГруппаКнопкаБудетДоступна.Видимость = Истина;
			ПодключитьОбработчикОжидания("ПроверитьВремяУстановкиПризнакаЗагрузки", 1);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВремяУстановкиПризнакаЗагрузки() Экспорт
	РазницаВремениЗапуска = ТекущаяДата() - ВремяУстановкиПризнакаЗагрузки;
	Если РазницаВремениЗапуска < 180 Тогда
		Элементы.ДекорацияСекунд.Заголовок = "" + (180-РазницаВремениЗапуска) + " сек."; 
	Иначе
		Элементы.ГруппаКнопкаБудетДоступна.Видимость = Ложь;
		Элементы.ФормаСброситьФлагЗагрузкиИЗакрыть.Доступность = Истина;
		Элементы.ФормаСброситьФлаг.Доступность = Истина;
		ОтключитьОбработчикОжидания("ПроверитьВремяУстановкиПризнакаЗагрузки");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКонстанты()

	//ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры);
	ИдетПакетнаяЗагрузкаРасчетовИзИзиСилинг = Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилинг.Получить();
	Если НЕ ИдетПакетнаяЗагрузкаРасчетовИзИзиСилинг Тогда
		ВремяУстановкиПризнакаЗагрузки = Дата(1, 1, 1);
		ПользовательУстановкиПризнака = Справочники.Пользователи.ПустаяСсылка();
		Элементы.ФормаСброситьФлагЗагрузкиИЗакрыть.Доступность = Ложь;
		Элементы.ДекорацияИдетЗагрузка.Видимость = Ложь;
	Иначе
		ВремяУстановкиПризнакаЗагрузки = Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилингВремя.Получить();
		ПользовательУстановкиПризнака = Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилингПользователь.Получить();
		Элементы.ФормаСброситьФлагЗагрузкиИЗакрыть.Доступность = Истина;
		Элементы.ДекорацияИдетЗагрузка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СброситьФлагЗагрузкиНаСервере()
	
	Попытка
		Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилинг.Установить(Ложь);
		Возврат Истина;		
	Исключение
		Сообщить("Не удается сбросить флаг загрузки: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура СброситьФлагЗагрузки(Команда)
	Если СброситьФлагЗагрузкиНаСервере() Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаСервере
Процедура СброситьФлагНаСервере()
	Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилинг.Установить(Ложь);
	Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилингВремя.Установить(Дата(1,1,1));
	Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилингПользователь.Установить(Справочники.Пользователи.ПустаяСсылка());
	ПрочитатьКонстанты();
КонецПроцедуры

&НаКлиенте
Процедура СброситьФлаг(Команда)
	СброситьФлагНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагНаСервере()
	Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилинг.Установить(Истина);
	Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилингВремя.Установить(ТекущаяДата());
	Константы.ИдетПакетнаяЗагрузкаРасчетовИзИзиСилингПользователь.Установить(параметрыСеанса.ТекущийПользователь);
	ПрочитатьКонстанты();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаг(Команда)
	УстановитьФлагНаСервере();
КонецПроцедуры



