
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаНачала") Тогда
		ДатаНачала = Параметры.ДатаНачала;
	КонецЕсли;
	
	Если Параметры.Свойство("СуммаДокумента") Тогда
		СуммаПервоначальногоВзноса = Параметры.СуммаДокумента;
		Сумма = Параметры.СуммаДокумента;
	КонецЕсли;
	
	Элементы.Платеж.Формат = СтрШаблон("ЧДЦ=2; ЧН=0,00; ЧФ='Ч %1'", Параметры.Валюта);
	
	ОбщийМодульСервер.ЗаполнитьПредопределенныеПорядкиОкругления(Элементы.ПорядокОкругленияЧислом);	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УправлениеФормой();
	РассчитатьПлатеж();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СуммаПервоначальногоВзносаПриИзменении(Элемент)
	РассчитатьПлатеж();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПериодовПриИзменении(Элемент)
	РассчитатьПлатеж();
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОкругленияЧисломПриИзменении(Элемент)
	РассчитатьПлатеж();
КонецПроцедуры

&НаКлиенте
Процедура ОкруглятьВБольшуюСторонуПриИзменении(Элемент)
	РассчитатьПлатеж();
КонецПроцедуры

&НаКлиенте
Процедура ОкруглятьПлатежПриИзменении(Элемент)
	
	Если НЕ ОкруглятьПлатеж Тогда
		ПорядокОкругленияЧислом = 0;
		ОкруглятьВБольшуюСторону = Ложь;
	КонецЕсли;
	УправлениеФормой();
	РассчитатьПлатеж();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Распределить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("ДатаНачала, СуммаПервоначальногоВзноса, Периодичность, КоличествоПериодов,
										|ОкруглятьПлатеж, ПорядокОкругленияЧислом, ОкруглятьВБольшуюСторону");
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, ЭтотОбъект);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьПлатеж()
	
	ПараметрыГрафика = Новый Структура("Сумма, СуммаПервоначальногоВзноса, КоличествоПериодов,
										|ОкруглятьПлатеж, ПорядокОкругленияЧислом, ОкруглятьВБольшуюСторону");
	ЗаполнитьЗначенияСвойств(ПараметрыГрафика, ЭтотОбъект);

	Платеж = ОбщийМодульКлиентСервер.РассчитатьПлатежПоГрафику(ПараметрыГрафика);
	
КонецПроцедуры


&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ПорядокОкругленияЧислом.Доступность = ОкруглятьПлатеж;
	Элементы.ОкруглятьВБольшуюСторону.Доступность = ОкруглятьПлатеж;
	
КонецПроцедуры

#КонецОбласти
