
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр НастройкиНачисленияБонусовПоПродажам
	Движения.НастройкиНачисленияБонусовПоПродажам.Записывать = Истина;
	
	Если ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.РеализацияТоваровИУслуг Тогда
		
		//по видам и категориям номенклатуры
		Для Каждого ТекСтрока Из НастройкаПоВидамНоменклатуры Цикл
			Движение = Движения.НастройкиНачисленияБонусовПоПродажам.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.КатегорияКонтрагента = КатегорияКонтрагента;
			Движение.ВидНоменклатуры = ТекСтрока.ВидНоменклатуры;
			Движение.ВидДокумента = ВидДокумента;
			Движение.Категория = ТекСтрока.Категория;
			
			Движение.БонусСуммой = ТекСтрока.БонусСуммой;
			Движение.БонусПроцентом = ТекСтрока.БонусПроцентом;
			Движение.НеНачислятьБонусы = ТекСтрока.НеНачислятьБонусы;
		КонецЦикла;
		
		//по номенклатуре
		Для Каждого ТекСтрока Из НастройкаПоНоменклатуре Цикл
			Движение = Движения.НастройкиНачисленияБонусовПоПродажам.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.КатегорияКонтрагента = КатегорияКонтрагента;
			Движение.ВидДокумента = ВидДокумента;
			Движение.Номенклатура = ТекСтрока.Номенклатура;
			
			Движение.БонусСуммой = ТекСтрока.БонусСуммой;
			Движение.БонусПроцентом = ТекСтрока.БонусПроцентом;
			Движение.НеНачислятьБонусы = ТекСтрока.НеНачислятьБонусы;
		КонецЦикла;
		
	Иначе
		
		Для Каждого ТекСтрока Из СчетаИКассы Цикл
			Движение = Движения.НастройкиНачисленияБонусовПоПродажам.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.КатегорияКонтрагента = КатегорияКонтрагента;		
			Движение.ВидДокумента = ВидДокумента;				
			Движение.БонусПроцентом = БонусПроцентом;
			Движение.СчетКасса = ТекСтрока.СчетКасса;
		КонецЦикла;	
			
	КонецЕсли;	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// проверка на уникальность записей
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ДатаДок = НачалоДня(Дата);
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаДок", 	  			ДатаДок);
		Запрос.УстановитьПараметр("Организация",  			Организация);
		Запрос.УстановитьПараметр("КатегорияКонтрагента",  	КатегорияКонтрагента);
		Запрос.УстановитьПараметр("ВидДокумента", 			ВидДокумента);
		Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиНачисленияБонусовПоПродажам.Регистратор,
		|	НастройкиНачисленияБонусовПоПродажам.Номенклатура,
		|	НастройкиНачисленияБонусовПоПродажам.ВидНоменклатуры,
		|	НастройкиНачисленияБонусовПоПродажам.Категория
		|ИЗ
		|	РегистрСведений.НастройкиНачисленияБонусовПоПродажам КАК НастройкиНачисленияБонусовПоПродажам
		|ГДЕ
		|	НастройкиНачисленияБонусовПоПродажам.Период = &ДатаДок
		|	И НастройкиНачисленияБонусовПоПродажам.Организация = &Организация
		|	И НастройкиНачисленияБонусовПоПродажам.КатегорияКонтрагента = &КатегорияКонтрагента
		|	И НастройкиНачисленияБонусовПоПродажам.ВидДокумента = &ВидДокумента
		|	И НастройкиНачисленияБонусовПоПродажам.Регистратор <> &Ссылка";
		ТабЗнач = Запрос.Выполнить().Выгрузить();
		
		
		Для Каждого ТекСтрока Из НастройкаПоВидамНоменклатуры Цикл
			НайденныеСтроки = ТабЗнач.НайтиСтроки(Новый Структура("ВидНоменклатуры, Категория", ТекСтрока.ВидНоменклатуры, ТекСтрока.Категория));
			
			Если НайденныеСтроки.Количество() > 0 Тогда 
				ТекстСообщения = "Для вида номенклатуры """ + ТекСтрока.ВидНоменклатуры + """ и категории """ + ТекСтрока.Категория + 
				""" уже установлено правило начисления бонусов на дату " + Формат(ДатаДок, "ДЛФ=D") + " документом " +
				Строка(НайденныеСтроки[0].Регистратор);
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
				
				Отказ = Истина;
			КонецЕсли;    
		КонецЦикла;
		
		Для Каждого ТекСтрока Из НастройкаПоНоменклатуре Цикл
			НайденныеСтроки = ТабЗнач.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрока.Номенклатура));
			
			Если НайденныеСтроки.Количество() > 0 Тогда 
				ТекстСообщения = "Для номенклатуры """ + ТекСтрока.Номенклатура +  
				""" уже установлено правило начисления бонусов на дату " + Формат(ДатаДок, "ДЛФ=D") + " документом " +
				Строка(НайденныеСтроки[0].Регистратор);
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
				
				Отказ = Истина;
			КонецЕсли;    
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.РеализацияТоваровИУслуг Тогда		
		Если ПроверяемыеРеквизиты.Найти("СчетаИКассы") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СчетаИКассы"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
КонецПроцедуры
