&НаСервере
Процедура ОбновитьЭлементыФормы()
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПриоритетПоСуммеПродаж(СуммаПродаж)
	
	Результат = Справочники.ПриоритетыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ПриоритетыКонтрагентов.Ссылка КАК Приоритет
	|ИЗ
	|	Справочник.ПриоритетыКонтрагентов КАК ПриоритетыКонтрагентов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(&СуммаПродаж, 0) >= 0
	|				ТОГДА ЕСТЬNULL(ПриоритетыКонтрагентов.ОборотОт, 0) <= &СуммаПродаж
	|						И ВЫБОР
	|							КОГДА ЕСТЬNULL(ПриоритетыКонтрагентов.ОборотДо, 0) = 0
	|								ТОГДА 999999999
	|							ИНАЧЕ ЕСТЬNULL(ПриоритетыКонтрагентов.ОборотДо, 0)
	|						КОНЕЦ > &СуммаПродаж
	|			ИНАЧЕ ЕСТЬNULL(ПриоритетыКонтрагентов.ОборотОт, 0) = 0
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("СуммаПродаж", СуммаПродаж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Приоритет;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьТекущийПриоритетКонтрагента(Контрагент)
	Возврат Контрагент.Приоритет;
КонецФункции

&НаСервере
Функция ПолучитьСуммуПродажКонтрагенту(Контрагент, Договор)
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.Контрагент = &Контрагент";
	Если НЕ Договор.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + "
		| И ПродажиОбороты.ДоговорКонтрагента = &ДоговорКонтрагента";
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.СуммаОборот;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриоритетыПоОбъемуПродажКонтрагентПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПриоритетыПоОбъемуПродаж.ТекущиеДанные;
	ТекущиеДанные.ТекущийПриоритет = ПолучитьТекущийПриоритетКонтрагента(ТекущиеДанные.Контрагент);
	ТекущиеДанные.СуммаПродаж = ПолучитьСуммуПродажКонтрагенту(ТекущиеДанные.Контрагент, ТекущиеДанные.Договор);
	ТекущиеДанные.УстановитьПриоритет = ПолучитьПриоритетПоСуммеПродаж(ТекущиеДанные.СуммаПродаж);
	Если НЕ ТекущиеДанные.ТекущийПриоритет = ТекущиеДанные.УстановитьПриоритет Тогда
		ТекущиеДанные.Изменять = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Период.ДатаНачала = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	Объект.Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	ОбновитьЭлементыФормы();	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоГруппе(Команда)
	ГруппаКонтрагентов = ОткрытьФормуМодально("Справочник.Контрагенты.ФормаВыбораГруппы");
	Если ЗначениеЗаполнено(ГруппаКонтрагентов) Тогда 
		Объект.ПриоритетыПоОбъемуПродаж.Очистить();
		ДобавитьПоГруппеНаСервере(ГруппаКонтрагентов);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоГруппеНаСервере(ГруппаКонтрагентов)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.Приоритет КАК ТекущийПриоритет,
	|	ПродажиОбороты.СуммаОборот КАК СуммаПродаж,
	|	ПродажиОбороты.ДоговорКонтрагента КАК Договор
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&ПериодНачало, &ПериодОкончание, , ) КАК ПродажиОбороты
	|		ПО Контрагенты.Ссылка = ПродажиОбороты.Контрагент
	|ГДЕ
	|	Контрагенты.Ссылка В ИЕРАРХИИ(&ГруппаКонтрагентов)
	|	И НЕ Контрагенты.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ПериодОкончание",КонецДня(Объект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ГруппаКонтрагентов", ГруппаКонтрагентов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ПриоритетыПоОбъемуПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.УстановитьПриоритет = ПолучитьПриоритетПоСуммеПродаж(НоваяСтрока.СуммаПродаж);
		Если НЕ НоваяСтрока.ТекущийПриоритет = НоваяСтрока.УстановитьПриоритет Тогда
			НоваяСтрока.Изменять = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоПродажамНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Контрагент,
	|	ПродажиОбороты.ДоговорКонтрагента КАК Договор,
	|	ПродажиОбороты.СуммаОборот КАК СуммаПродаж,
	|	ПродажиОбороты.Контрагент.Приоритет КАК ТекущийПриоритет
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ПериодНачало, &ПериодОкончание, , ) КАК ПродажиОбороты";
	
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ПериодОкончание",КонецДня(Объект.Период.ДатаОкончания));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ПриоритетыПоОбъемуПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.УстановитьПриоритет = ПолучитьПриоритетПоСуммеПродаж(НоваяСтрока.СуммаПродаж);
		Если НЕ НоваяСтрока.ТекущийПриоритет = НоваяСтрока.УстановитьПриоритет Тогда
			НоваяСтрока.Изменять = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоПродажам(Команда) 
	Объект.ПриоритетыПоОбъемуПродаж.Очистить();
	ДобавитьПоПродажамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьПриоритетНаСервере()
	
	Для Каждого ТекущаяСтрока Из Объект.ПриоритетыПоОбъемуПродаж Цикл
		Если ТекущаяСтрока.Изменять и НЕ (ТекущаяСтрока.ТекущийПриоритет = ТекущаяСтрока.УстановитьПриоритет) Тогда
			ЭлементОбъект = ТекущаяСтрока.Контрагент.ПолучитьОбъект();
			ЭлементОбъект.Приоритет = ТекущаяСтрока.УстановитьПриоритет;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Сообщить("Не удалось изменить приоритет контрагента " + ТекущаяСтрока.Контрагент + ". Ошибка: " + ОписаниеОшибки());
			КонецПопытки;   
			ТекущаяСтрока.ТекущийПриоритет = ТекущаяСтрока.Контрагент.Приоритет;
		КонецЕсли;
		Если ТекущаяСтрока.ТекущийПриоритет = ТекущаяСтрока.УстановитьПриоритет Тогда
			ТекущаяСтрока.Изменять = Ложь;
		Иначе
			ТекущаяСтрока.Изменять = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПриоритет(Команда)
	ИзменитьПриоритетНаСервере();
	ПоказатьПредупреждение(,"Изменения записаны");
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Объект.ПриоритетыПоОбъемуПродаж.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого ТекущаяСтрока Из Объект.ПриоритетыПоОбъемуПродаж Цикл
		Если НЕ (ТекущаяСтрока.ТекущийПриоритет = ТекущаяСтрока.УстановитьПриоритет) Тогда
			ТекущаяСтрока.Изменять = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтметкуВсех(Команда)
	Для Каждого ТекущаяСтрока Из Объект.ПриоритетыПоОбъемуПродаж Цикл
		ТекущаяСтрока.Изменять = Ложь;
	КонецЦикла;
КонецПроцедуры
