#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() тогда		
					
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	СостояниеОплачено = Объект.Проведен И РегистрыНакопления.ДенежныеСредстваКВыплате.ОпределитьСостояниеОплаты(Объект.Ссылка);
	ПравоУтверждения = РольДоступна("УтверждениеЗаявокНаПеремещениеДенежныхСредств")
					   ИЛИ РольДоступна("ПолныеПрава")
					   ИЛИ РольДоступна("АдминистраторСистемы");
	УстановитьСписокСтатусов();
	УстановитьДоступностьЭлементовПоСтатусу();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Объект.Валюта = Объект.ВалютаПолучатель Тогда
			Если НЕ Объект.Сумма = Объект.СуммаПолучатель Тогда
				ПоказатьПредупреждение(,"Сумма отправленная и сумма полученная не равны");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КассаОтправительПриИзменении(Элемент)
	КассаОтправительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КассаОтправительПриИзмененииНаСервере()
	Если НЕ Объект.КассаОтправитель.Валюта.Пустая() Тогда
		Объект.Валюта = Объект.КассаОтправитель.Валюта;
	Иначе
		Объект.Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КассаПолучательПриИзменении(Элемент)
	КассаПолучательПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КассаПолучательПриИзмененииНаСервере()
	Объект.ВалютаПолучатель = Объект.КассаПолучатель.Валюта;
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Объект.ОрганизацияПолучатель = Объект.Организация;
	Объект.КассаПолучатель = Справочники.Кассы.ПустаяСсылка();
	Объект.ВалютаПолучатель = Справочники.Валюты.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтатусУтвержденияПлатежаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Если Объект.ВалютаПолучатель = Объект.Валюта Тогда 
		Объект.СуммаПолучатель = Объект.Сумма;
		
	ИначеЕсли Объект.СуммаПолучатель = 0 И НЕ ЗначениеЗаполнено(Объект.ВалютаПолучатель) Тогда
		Объект.СуммаПолучатель = Объект.Сумма;	
		Объект.ВалютаПолучатель = Объект.Валюта;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПолучательПриИзменении(Элемент)
	
	Если Объект.ВалютаПолучатель = Объект.Валюта Тогда 
		Объект.Сумма = Объект.СуммаПолучатель;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если Объект.Валюта = Объект.ВалютаПолучатель Тогда 
		Объект.Сумма = Объект.СуммаПолучатель;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПолучательПриИзменении(Элемент)
	
	Если Объект.ВалютаПолучатель = Объект.Валюта Тогда 
		Объект.СуммаПолучатель = Объект.Сумма;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УстановитьСписокСтатусов()
	
	СписокВыбора = Элементы.СтатусУтвержденияПлатежа.СписокВыбора;
	Если Не ПравоУтверждения Тогда		
		СписокВыбора.Очистить();
		СписокВыбора.Добавить(Перечисления.СтатусыУтвержденияПлатежей.НеУтвержден);
		
		Если Объект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда
			СписокВыбора.Добавить(Перечисления.СтатусыУтвержденияПлатежей.Утвержден);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовПоСтатусу()
	ТолькоПросмотрЭлементов = Ложь;
	
	Если Объект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда	
		ТолькоПросмотрЭлементов = Истина;
	КонецЕсли;
		
	ЭлементыТолькоПросмотр = Новый Массив;
	ЭлементыТолькоПросмотр.Добавить(Элементы.НомерДата);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Кассы);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Дополнительно);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаСтатус);
	
	Для каждого Элемент Из ЭлементыТолькоПросмотр Цикл
		Элемент.ТолькоПросмотр = ТолькоПросмотрЭлементов;
	КонецЦикла;
	
	//ЭлементыДоступность = Новый Массив;
	//
	//Для каждого Элемент Из ЭлементыДоступность Цикл
	//	Элемент.Доступность = Не ТолькоПросмотрЭлементов;
	//КонецЦикла;
		
	Если ПравоУтверждения 
		И Объект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден
		И НЕ СостояниеОплачено Тогда
		Элементы.ГруппаСтатус.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
