#Область ПрограммныйИнтерфейс

// Описание поддерживаемых менеджеров
// 
// Возвращаемое значение:
// 	Массив - пустые ссылки объектов, которые поддерживают штрихкодирование печатных форм.
Функция ВсеПоддерживаемыеМенеджеры() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка"));
	Результат.Добавить(ПредопределенноеЗначение("Документ.РеализацияТоваровИУслуг.ПустаяСсылка"));
	Результат.Добавить(ПредопределенноеЗначение("Документ.ПеремещениеТоваров.ПустаяСсылка")); //nva
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти