
функция проверитьВозвраты()
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Дата", дата -1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТЗ", РаспределениеПоФондам.Выгрузить());
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Фонд КАК Фонд,
	               |	ТЗ.СуммаБезнал КАК СуммаБезнал,
	               |	ТЗ.СФонда КАК СФонда,
	               |	ТЗ.Подразделение КАК Подразделение,
	               |	ТЗ.СПодразделения КАК СПодразделения,
	               |	ТЗ.ПричинаЗайма КАК ПричинаЗайма,
	               |	ТЗ.КрайнийСрок КАК КрайнийСрок,
	               |	ТЗ.ИсточникОтложенногоДохода КАК ИсточникОтложенногоДохода,
	               |	ТЗ.ЗаймВозврат КАК ЗаймВозврат,
	               |	ТЗ.ид КАК ид
	               |ПОМЕСТИТЬ ВозвратыДок1
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВозвратыДок1.Фонд КАК Фонд,
	               |	ВозвратыДок1.СуммаБезнал КАК Сумма,
	               |	ВозвратыДок1.СФонда КАК СФонда,
	               |	ВозвратыДок1.Подразделение КАК Подразделение,
	               |	ВозвратыДок1.СПодразделения КАК СПодразделения,
	               |	ВозвратыДок1.ПричинаЗайма КАК ПричинаЗайма,
	               |	ВозвратыДок1.КрайнийСрок КАК КрайнийСрок,
	               |	ВозвратыДок1.ИсточникОтложенногоДохода КАК ИсточникОтложенногоДохода,
	               |	ВозвратыДок1.ЗаймВозврат КАК ЗаймВозврат,
	               |	ВозвратыДок1.ид КАК ид
	               |ПОМЕСТИТЬ ВозвратыДок
	               |ИЗ
	               |	ВозвратыДок1 КАК ВозвратыДок1
	               |ГДЕ
	               |	ВозвратыДок1.ЗаймВозврат = ЗНАЧЕНИЕ(Перечисление.ИА_ЗаймВозврат.Возврат)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВозвратыДок.Фонд КАК Фонд,
	               |	ВозвратыДок.Подразделение КАК Подразделение,
	               |	ЕСТЬNULL(Остатки.СуммаБезналОстаток, 0) КАК СуммаБезналОстаток,
	               |	ЕСТЬNULL(Остатки.СуммаБезналОстаток, 0) - ВозвратыДок.Сумма КАК ОстатокПосле
	               |ИЗ
	               |	ВозвратыДок КАК ВозвратыДок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_ЗаймыСФондов.Остатки(&Дата, Организация = &Организация) КАК Остатки
	               |		ПО (        ВозвратыДок.Фонд = Остатки.Фонд
	               |					И ВозвратыДок.Подразделение = Остатки.Подразделение
	               |					И ВозвратыДок.СПодразделения = Остатки.НаПодразделение
	               |					И ВозвратыДок.СФонда = Остатки.НаФонд
	               |					И ВозвратыДок.ПричинаЗайма = Остатки.ПричинаЗайма
	               |					И ВозвратыДок.КрайнийСрок = Остатки.КрайнийСрок
	               |					И ВозвратыДок.ИсточникОтложенногоДохода = Остатки.ИсточникОтложенногоДохода
	               |				ИЛИ Остатки.ид = ВозвратыДок.ид
	               |					И ВозвратыДок.ид <> ЗНАЧЕНИЕ(Справочник.КСУ_Займы.пустаяСсылка)
	               |					И ВозвратыДок.ид <> ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)       )
	               |ГДЕ
	               |	ЕСТЬNULL(Остатки.СуммаБезналОстаток, 0) - ВозвратыДок.Сумма < 0";
	Выборка = запрос.Выполнить().Выбрать();
	
	ВсёОк = истина;
	
	пока Выборка.Следующий() Цикл
		Сообщить("Возврат превышает заём! Фонд """+Выборка.Фонд+""" ");
		ВсёОк = ложь;
	КонецЦикла;
	
	Возврат ВсёОк;
КонецФункции

функция проверитьЗаймыИзОтложенногоДохода()
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Дата", дата -1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТекДок", Ссылка);
	Запрос.УстановитьПараметр("ТЗ", РаспределениеПоФондам.Выгрузить());
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Фонд КАК Фонд,
	               |	ТЗ.СуммаБезнал КАК СуммаБезнал,
	               |	ТЗ.СФонда КАК СФонда,
	               |	ТЗ.Подразделение КАК Подразделение,
	               |	ТЗ.СПодразделения КАК СПодразделения,
	               |	ТЗ.ПричинаЗайма КАК ПричинаЗайма,
	               |	ТЗ.КрайнийСрок КАК КрайнийСрок,
	               |	ТЗ.ИсточникОтложенногоДохода КАК ИсточникОтложенногоДохода,
	               |	ТЗ.ЗаймВозврат КАК ЗаймВозврат
	               |ПОМЕСТИТЬ ЗаймыДок1
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЗаймыДок1.СуммаБезнал) КАК Сумма,
	               |	ЗаймыДок1.ИсточникОтложенногоДохода КАК ИсточникОтложенногоДохода
	               |ПОМЕСТИТЬ ЗаймыДок
	               |ИЗ
	               |	ЗаймыДок1 КАК ЗаймыДок1
	               |ГДЕ
	               |	ЗаймыДок1.ЗаймВозврат = ЗНАЧЕНИЕ(Перечисление.ИА_ЗаймВозврат.Займ)
	               |	И ЗаймыДок1.ИсточникОтложенногоДохода <> НЕОПРЕДЕЛЕНО
	               |	И ЗаймыДок1.ИсточникОтложенногоДохода <> ЗНАЧЕНИЕ(Справочник.ИА_ИсточникиСпецДохода.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаймыДок1.ИсточникОтложенногоДохода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОтложенныйДоход.Сумма КАК Сумма,
	               |	ОтложенныйДоход.ид КАК ИсточникОтложенногоДохода
	               |ПОМЕСТИТЬ ОтлДоходТекДок
	               |ИЗ
	               |	Документ.ИА_ФинансовоеПланирование.ОтложенныйДоход КАК ОтложенныйДоход
	               |ГДЕ
	               |	ОтложенныйДоход.ТипОперации = ЗНАЧЕНИЕ(Перечисление.КСУ_ОперацииСОтложеннымДоходом.Отложить)
	               |	И ОтложенныйДоход.Ссылка = &ТекДок
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаймыДок.Сумма КАК сумма,
	               |	ЗаймыДок.ИсточникОтложенногоДохода КАК Источник,
	               |	ЕСТЬNULL(ОтложОстатки.СуммаБезналОстаток, 0) - ЗаймыДок.Сумма + ЕСТЬNULL(ОтлДоходТекДок.Сумма, 0) КАК ОстатокПосле
	               |ИЗ
	               |	ЗаймыДок КАК ЗаймыДок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_ДоходыБудущихПериодов.Остатки(&Дата, Организация = &Организация) КАК ОтложОстатки
	               |		ПО ЗаймыДок.ИсточникОтложенногоДохода = ОтложОстатки.Источник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОтлДоходТекДок КАК ОтлДоходТекДок
	               |		ПО ЗаймыДок.ИсточникОтложенногоДохода = ОтлДоходТекДок.ИсточникОтложенногоДохода
	               |ГДЕ
	               |	ЕСТЬNULL(ОтложОстатки.СуммаБезналОстаток, 0) - ЗаймыДок.Сумма + ЕСТЬNULL(ОтлДоходТекДок.Сумма, 0) < 0";
	Выборка = запрос.Выполнить().Выбрать();
	
	ВсёОк = истина;
	
	пока Выборка.Следующий() Цикл
		Сообщить("Заём из отложенного дохода превышает остаток по отложенному доходу """+Выборка.Источник+""" !");
		ВсёОк = ложь;
	КонецЦикла;
	
	Возврат ВсёОк;
КонецФункции
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	Если не проверитьВозвраты() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если не проверитьЗаймыИзОтложенногоДохода() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СтатусыОдобрено = ИА_ФП.СтатусыОдобрено();
	ДоходыПоПодр = Константы.КСУ_ДоходыПоПодразделениям.Получить();
	
	ВестиФППоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ОтклонятьЗаказы = АвтоотклонениеЗаказовПослеФП;
	//ОтклонятьЗаказы = истина;
	ОрганизацияДляДвижений =?(ВестиФППоОрганизациям, Организация, Справочники.Организации.ПустаяСсылка());

	//
	Движения.ИА_СредстваНаФондах.Записывать = Истина;
	Движения.ИА_СредстваНаФондах.Очистить();
	//
	Движения.ИА_СредстваВРезервеНаФондах.Записывать = Истина;
	Движения.ИА_СредстваВРезервеНаФондах.Очистить();
	//
	Движения.ИА_ДоходыБудущихПериодов.Записать(); // ИА_Аврамов 21.06.2016  
	Движения.ИА_ДоходыБудущихПериодов.Записывать = Истина;
	Движения.ИА_ДоходыБудущихПериодов.Очистить();
	//
	Движения.ИА_ЗаймыСФондов.Записывать = Истина;
	Движения.ИА_ЗаймыСФондов.Очистить();
	//
	//Движения.ИА_УтвержденныйПланПродаж.Записывать = Истина;
	//Движения.ИА_УтвержденныйПланПродаж.Очистить();
	//
	Движения.ИА_ИсторияСтатусовЗВС.Записывать = Истина;
	Движения.ИА_ИсторияСтатусовЗВС.Очистить();
	//
	Движения.КСУ_РаспределениеТБ.Записывать = Истина;
	Движения.КСУ_РаспределениеТБ.Очистить();
	//
	Движения.КСУ_ЗаливкаСостояниеСуммыФП.Записывать = Истина;
	Движения.КСУ_ЗаливкаСостояниеСуммыФП.Очистить();
	//
	Движения.КСУ_ЗаливкаПолитики1.Записывать = Истина;
	Движения.КСУ_ЗаливкаПолитики1.Очистить();
	//
	Движения.КСУ_РаспределениеДоходовТБ.Записывать = Истина;
	Движения.КСУ_РаспределениеДоходовТБ.Очистить();
	//
	Движения.КСУ_УчредительскиеФонды.Записывать = Истина;
	Движения.КСУ_УчредительскиеФонды.Очистить();
	//
	Движения.КСУ_ПланФактМаржинальнойПрибыли.Записывать = Истина;
	Движения.КСУ_ПланФактМаржинальнойПрибыли.Очистить();
	//
	Движения.КСУ_ФП_ДоходыИтого.Записывать = Истина;
	Движения.КСУ_ФП_ДоходыИтого.Очистить();
	//
	//Движения.КСУ_ЛентаСобытий.Записывать = Истина;
	//Движения.КСУ_ЛентаСобытий.Очистить();
	//
	Движения.ИА_УчетСтатистик.Записывать = Истина;
	Движения.ИА_УчетСтатистик.Очистить();
	//
	Движения.КСУ_КомментарииФП.Записывать = Истина;
	Движения.КСУ_КомментарииФП.Очистить();

	// статистики
	Для каждого стр из ФинПоказатели цикл
		Если стр.Ручная Тогда
			дв = движения.ИА_УчетСтатистик.Добавить();
			дв.Период = дата;
			дв.ВидСтатистики = стр.Показатель;
			дв.Количество = стр.Значение;
			
			Если стр.Показатель.Аналитика1.ТипАналитикиПолный = "СправочникСсылка.Организации" Тогда
				дв.Аналитика1 = Организация;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	// маржа
	Движение = Движения.КСУ_ПланФактМаржинальнойПрибыли.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Месяц = МесяцТБ;
	Движение.Неделя = НеделяТБ;
	Движение.Сумма = МаржинальнаяПрибыль;

			
	// распределение средств с фондов
	Для каждого стр из РаспределениеСредствСФондов Цикл
		Если стр.СуммаНал+стр.СуммаБезнал > 0 Тогда
			Движение = Движения.ИА_СредстваНаФондах.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Фонд = стр.Фонд;
			Движение.Подразделение = стр.Подразделение;	
			Движение.СуммаНал = стр.СуммаНал;
			Движение.СуммаБезнал = стр.СуммаБезнал;
		КонецЕсли;
	КонецЦикла;
	
	// Перемещения средств по политике
	Для каждого стр из Политика1 Цикл
		Если стр.Сумма > 0 Тогда
			ПеревестиСФондаНаФонд(Движения.ИА_СредстваНаФондах, , ,стр.Статья, стр.Подразделение, 0, стр.Сумма, Перечисления.КСУ_ОперацииПоФондам.ЗаливкаФонда);
		КонецЕсли;	
	КонецЦикла;
	
	Для каждого стр из Политика2 Цикл
		Если стр.Сумма > 0 Тогда
			ПеревестиСФондаНаФонд(Движения.ИА_СредстваНаФондах, , ,стр.Статья, стр.Подразделение, 0, стр.Сумма, Перечисления.КСУ_ОперацииПоФондам.ЗаливкаФонда);
		КонецЕсли;
	КонецЦикла;
	
	/////////////
	// ЗАЛИВКА
	/////////////
	Для каждого стр из Доходы Цикл			
		Движение = Движения.КСУ_РаспределениеДоходовТБ.ДобавитьРасход();
		Движение.Организация = Организация;
		Движение.Период = Дата;			
		Движение.Неделя = НеделяТБ;			
		Движение.ВидДохода = стр.ВидДохода;
		Движение.Подразделение = стр.Подразделение;
		Движение.Сумма = стр.СуммаБезнал;
	КонецЦикла;
	
	Для каждого стр из ДоходыИтого Цикл			
		Движение = Движения.КСУ_ФП_ДоходыИтого.Добавить();
		Движение.Организация = Организация;
		Движение.Период = Дата;			
		Движение.Неделя = НеделяТБ;			
		Движение.ВидДохода = стр.ВидДохода;
		Движение.Подразделение = стр.Подразделение;
		Движение.Сумма = стр.СуммаБезнал;
	КонецЦикла;
	
	Для каждого стр из ЗаливкаФондовСостояние Цикл			
		Движение = Движения.КСУ_ЗаливкаСостояниеСуммыФП.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,стр);
		Движение.Организация = Организация;
		Движение.Период = Дата;			
		Движение.НеделяТБ = НеделяТБ;
	КонецЦикла;
	
	Для каждого стр из ЗаливкаФондов Цикл
		Если стр.Сумма > 0 Тогда
			ПеревестиСФондаНаФонд(Движения.ИА_СредстваНаФондах, , ,стр.Фонд, стр.Подразделение, 0, стр.Сумма, Перечисления.КСУ_ОперацииПоФондам.ЗаливкаФонда);
			
			Движение = Движения.КСУ_РаспределениеТБ.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Неделя = стр.Неделя;	
			Движение.Организация = Организация;
			Движение.Фонд = стр.Фонд;	
			Движение.Подразделение = стр.Подразделение;	
			Движение.Сумма = стр.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого стр из Политика1 Цикл
		Если стр.Сумма > 0 Тогда
			Движение = Движения.КСУ_ЗаливкаПолитики1.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Неделя = НеделяТБ;
			Движение.Организация = Организация;
			Движение.Фонд = стр.Статья;	
			Движение.Подразделение = стр.Подразделение;	
			Движение.Сумма = стр.Сумма;			
		КонецЕсли;		
	КонецЦикла;
	
	Для каждого стр из УчредительскиеФонды Цикл
		Если стр.Сумма > 0 Тогда
			Движение = Движения.КСУ_УчредительскиеФонды.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Неделя = НеделяТБ;
			Движение.Организация = Организация;
			Движение.Фонд = стр.Фонд;	
			Движение.Подразделение = стр.Подразделение;	
			Движение.Сумма = стр.Сумма;	
			
			ПеревестиСФондаНаФонд(Движения.ИА_СредстваНаФондах, , ,стр.Фонд, стр.Подразделение, 0, стр.Сумма, Перечисления.КСУ_ОперацииПоФондам.ЗаливкаФонда);
		КонецЕсли;		
	КонецЦикла;
	
	// Начисления в фонды со свободных средств
	Для каждого стр из НачисленияВФонды Цикл
		Если стр.СуммаНал+стр.СуммаБезнал > 0 Тогда
			ПеревестиСФондаНаФонд(Движения.ИА_СредстваНаФондах, , ,стр.Фонд, стр.Подразделение, стр.СуммаНал, стр.СуммаБезнал);
		КонецЕсли;
	КонецЦикла;
	
	//Если не ПроверитьЗаймы() Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	
	// Перемещения между фондами
	Для каждого стр из РаспределениеПоФондам Цикл
		Если стр.Фонд.Пустая() или стр.СФонда.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		Если стр.СуммаБезнал > 0 И стр.СписатьДолг = ложь Тогда		
			ТекОп = Перечисления.КСУ_ОперацииПоФондам.ПеремещениеВДругойФонд;
			Если стр.ЗаймВозврат = Перечисления.ИА_ЗаймВозврат.Займ Тогда
				ТекОп = Перечисления.КСУ_ОперацииПоФондам.ПредоставлениеЗайма;
			ИначеЕсли стр.ЗаймВозврат = Перечисления.ИА_ЗаймВозврат.Возврат ТОгда
				ТекОп = Перечисления.КСУ_ОперацииПоФондам.ВозвратПолученногоЗайма;
			КонецЕсли;
			ПеревестиСФондаНаФонд(Движения.ИА_СредстваНаФондах, стр.СФонда, стр.СПодразделения ,стр.Фонд, стр.Подразделение, стр.СуммаНал, стр.СуммаБезнал, ТекОп);	
		КонецЕсли;
				
		Если стр.ЗаймВозврат = Перечисления.ИА_ЗаймВозврат.Займ Тогда
			
			Движение = Движения.ИА_ЗаймыСФондов.ДобавитьПриход();
			ЗаполнитьЗначенияСвойств(Движение, стр);
			
			Движение.Период = Дата;
			Движение.Организация = ОрганизацияДляДвижений;
			
			Движение.Фонд = стр.СФонда;
			Движение.Подразделение = стр.СПодразделения;
			Движение.НаФонд = стр.Фонд;
			Движение.НаПодразделение = стр.Подразделение;
			
			Если ЗначениеЗаполнено(стр.ИсточникОтложенногоДохода) Тогда
				Движение = Движения.ИА_ДоходыБудущихПериодов.ДобавитьРасход();
				Движение.Организация = Организация;
				Движение.Источник = стр.ИсточникОтложенногоДохода;
				Движение.СуммаБезнал = стр.СуммаБезнал;
				Движение.Подразделение = стр.ИсточникОтложенногоДохода.Подразделение;
				Движение.ВидДохода = стр.ИсточникОтложенногоДохода.ВидДохода;
				Движение.Период = Дата;
				Движение.Операция = "Займ";
				Движение.ОперацияСсылка = Перечисления.КСУ_ОперацииПоФондам.ПредоставлениеЗайма;
				Движение.ФондЗаемщик = стр.Фонд;
				Движение.КомментарийЗайма = стр.Комментарий;
			КонецЕсли;
			
		ИначеЕсли стр.ЗаймВозврат = Перечисления.ИА_ЗаймВозврат.Возврат ТОгда
			
			Движение = Движения.ИА_ЗаймыСФондов.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(Движение, стр);
			
			Движение.Период = Дата;
			Движение.Организация = ОрганизацияДляДвижений;
			
			Движение.Фонд = стр.Фонд;
			Движение.Подразделение = стр.Подразделение;
			Движение.НаФонд = стр.СФонда;
			Движение.НаПодразделение = стр.СПодразделения;
			
			Если стр.ид <> Справочники.КСУ_Займы.ПереходНа84 Тогда
				ЗаполнитьЗначенияСвойств(Движение, стр.ид,, "Комментарий");
				Движение.Фонд = стр.ид.СФонда;
				Движение.Подразделение = стр.ид.СПодразделения;
				Движение.НаФонд = стр.ид.НаФонд;
				Движение.НаПодразделение = стр.ид.НаПодразделение;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стр.ИсточникОтложенногоДохода) Тогда
				Движение = Движения.ИА_ДоходыБудущихПериодов.ДобавитьПриход();
				Движение.Организация = Организация;
				Движение.Источник = стр.ИсточникОтложенногоДохода;
				Движение.СуммаБезнал = стр.СуммаБезнал;
				Движение.Подразделение = стр.ИсточникОтложенногоДохода.Подразделение;
				Движение.ВидДохода = стр.ИсточникОтложенногоДохода.ВидДохода;
				Движение.Период = Дата;
				Движение.Операция = "Возвращен займ";
				Движение.ОперацияСсылка = Перечисления.КСУ_ОперацииПоФондам.ВозвратВыданногоЗайма;
				Движение.ФондЗаемщик = стр.СФонда;
				Движение.КомментарийЗайма = стр.Комментарий;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// Движения по доходам БП
	ФондДБП = Константы.ИА_ФП_ФондДоходовБП.Получить();
	ПодразделениеДБП = Константы.ИА_ФП_ПодразделениеДоходовБП.Получить();
	
	Если не ПроверитьДоходыБП() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	//// списание
	// старая схема:
	Для каждого стр из ДоходыБП_Распределение Цикл 		
		Если стр.СуммаНал+стр.СуммаБезнал > 0 Тогда
			Движение = Движения.ИА_ДоходыБудущихПериодов.ДобавитьРасход();
			Движение.Организация = Организация;
			ЗаполнитьЗначенияСвойств(Движение, стр);
			Движение.Период = Дата;
		   	Движение.Операция = "Возвращен ранее отложенный доход";
			Движение.ОперацияСсылка = Перечисления.КСУ_ОперацииПоФондам.ВозвращеноВДоход;
			ПеревестиСФондаНаФонд(Движения.ИА_СредстваНаФондах, ФондДБП, ПодразделениеДБП, , ,стр.СуммаНал, стр.СуммаБезнал, 
									Перечисления.КСУ_ОперацииПоФондам.ВозвращеноВДоход, стр.ВидДохода.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	// новая схема:
	Для каждого стр из ОтложенныйДоход Цикл 		
		Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Вернуть Тогда
			Движение = Движения.ИА_ДоходыБудущихПериодов.ДобавитьРасход();
			Движение.Организация = Организация;
			ЗаполнитьЗначенияСвойств(Движение, стр);
			Движение.Источник = стр.ид;
			Движение.СуммаБезнал = стр.Сумма;
			Движение.ВидДохода = стр.ид.ВидДохода;
			Движение.Период = Дата;
			Движение.Операция = "Возвращен ранее отложенный доход";
			Движение.ОперацияСсылка = Перечисления.КСУ_ОперацииПоФондам.ВозвращеноВДоход;
			
			ПодрОтлДох = ПодразделениеДБП;
			Если ДоходыПоПодр тогда
				ПодрОтлДох = стр.Подразделение;	
			КонецЕсли;
			ПеревестиСФондаНаФонд(Движения.ИА_СредстваНаФондах, ФондДБП, ПодрОтлДох, , ,0, 
									стр.Сумма, Перечисления.КСУ_ОперацииПоФондам.ВозвращеноВДоход, стр.ВидДохода.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	//// откладывание
	// старая схема:
	Для каждого стр из ДоходыБП Цикл // начисление		
		Движение = Движения.ИА_ДоходыБудущихПериодов.ДобавитьПриход();
		Движение.Организация = Организация;
		ЗаполнитьЗначенияСвойств(Движение, стр);
		Движение.Период = Дата;
		Движение.Операция = "Отложено из дохода";
		Движение.ОперацияСсылка = Перечисления.КСУ_ОперацииПоФондам.ОтложеноИзДохода;
		
		ПеревестиСФондаНаФонд(Движения.ИА_СредстваНаФондах,,, ФондДБП, ПодразделениеДБП, стр.СуммаНал, стр.СуммаБезнал, 
							Перечисления.КСУ_ОперацииПоФондам.ОтложеноИзДохода, стр.ВидДохода.Наименование);
	КонецЦикла;
	
	// новая схема:
	Для каждого стр из ОтложенныйДоход Цикл 
		Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить Тогда
			Движение = Движения.ИА_ДоходыБудущихПериодов.ДобавитьПриход();
			Движение.Организация = Организация;
			Движение.Источник = стр.ид;
			Движение.СуммаБезнал = стр.Сумма;
			Движение.Период = Дата;
			Движение.Операция = "Отложено с дохода";
			Движение.ОперацияСсылка = Перечисления.КСУ_ОперацииПоФондам.ОтложеноИзДохода;
			ЗаполнитьЗначенияСвойств(Движение, стр);
			
			ПодрОтлДох = ПодразделениеДБП;
			Если ДоходыПоПодр тогда
				ПодрОтлДох = стр.Подразделение;	
			КонецЕсли;
			
			ПеревестиСФондаНаФонд(Движения.ИА_СредстваНаФондах,,, ФондДБП, ПодрОтлДох, 0, стр.Сумма, 
							Перечисления.КСУ_ОперацииПоФондам.ОтложеноИзДохода, стр.ВидДохода.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	//
	
	// План продаж
	Если ПланПродажУтвержден Тогда
		Для каждого стр из ПланПродаж Цикл
			Новстр = Движения.ИА_УтвержденныйПланПродаж.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр,стр);
			Новстр.Период = НеделяПланирования;
			Новстр.Организация = Организация;
			Новстр.Номер = стр.НомерСтроки;
		КонецЦикла;
	КонецЕсли;
	
	// статусы ЗВС
	АвтоотклоненныеЗаказы = новый массив;
	Для каждого стр из ЭтотОбъект.ЗаказыНаПриобретение Цикл
		Новстр = Движения.ИА_ИсторияСтатусовЗВС.Добавить();
		ТекСтатус = стр.Статус;
		Если (стр.СтатусИсходный = Перечисления.ИА_СостояниеЗаказа.РассмотретьНаФП или стр.СтатусИсходный = Перечисления.ИА_СостояниеЗаказа.ПереносНаСледующееФП) 
			И СтатусыОдобрено.Найти(ТекСтатус) = Неопределено и ТекСтатус<>Перечисления.ИА_СостояниеЗаказа.Отклонен и ТекСтатус<>Перечисления.ИА_СостояниеЗаказа.ПереносНаСледующееФП Тогда
			Если ОтклонятьЗаказы тогда
				ТекСтатус = Перечисления.ИА_СостояниеЗаказа.Отклонен;
				АвтоотклоненныеЗаказы.Добавить(стр.Заказ);
			Иначе
				ТекСтатус = Перечисления.ИА_СостояниеЗаказа.ПереносНаСледующееФП;
			КонецЕсли;
		КонецЕсли;
		Новстр.ЗВС = стр.Заказ;
		Новстр.Статус = ТекСтатус;
		Новстр.ПричинаОтказа = стр.ПричинаОтказа;
		Новстр.Период = Дата;
		
		ЗаписьЛенты = РегистрыСведений.КСУ_ЛентаСобытий.СоздатьМенеджерЗаписи();
		ЗаписьЛенты.ПериодСобытия = Дата;
		ЗаписьЛенты.ДатаСобытия = ТекущаяДата();
		ЗаписьЛенты.Объект = стр.Заказ;
		Если СтатусыОдобрено.Найти(ТекСтатус) <> Неопределено Тогда
			ЗаписьЛенты.Событие = "Одобрен. "  + формат(стр.УтвержденнаяСумма,"ЧДЦ=2; ЧН=");
		ИначеЕсли ТекСтатус = Перечисления.ИА_СостояниеЗаказа.ПереносНаСледующееФП Тогда 
			ЗаписьЛенты.Событие = "Перенесен на следующее ФП.";
		Иначе
			ЗаписьЛенты.Событие = "Отклонен.";
		КонецЕсли;
		ЗаписьЛенты.Событие = ЗаписьЛенты.Событие + " ФП №" + Номер;
		
		ЗаписьЛенты.Детали = ТекСтатус;
		ЗаписьЛенты.Ответственный = Ответственный;
		ЗаписьЛенты.Записать();

		
		Новстр = Движения.КСУ_КомментарииФП.Добавить();		
		Новстр.Заказ = стр.Заказ;
		Новстр.Комментарий = стр.КомментарийСФП;
		Новстр.Период = Дата;
	КонецЦикла;
	
	// статусы ЗНО
	Для каждого стр из ЭтотОбъект.ЗНО Цикл
		Новстр = Движения.ИА_ИсторияСтатусовЗВС.Добавить();
		Новстр.ЗВС = стр.Заказ;
		Новстр.Статус = стр.Статус;
		Новстр.ПричинаОтказа = стр.ПричинаОтказа;
		Новстр.Период = Дата;
	КонецЦикла;
	
	// Аннуляция заказов
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату", дата);
	Запрос.УстановитьПараметр("тз", ЗаказыНаПриобретение.Выгрузить());
	Запрос.Текст = "ВЫБРАТЬ
	               |	тз.Заказ КАК Заказ,
	               |	тз.Статус КАК Статус
	               |ПОМЕСТИТЬ ТЗ
	               |ИЗ
	               |	&тз КАК тз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_ЗаказНаПриобретение.Ссылка КАК Заказ,
	               |	ЕСТЬNULL(ИА_ЗаказыНаПриобретениеОстатки.СуммаОстаток, 0) КАК ОстатокЗаказа,
	               |	ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток КАК ОстатокРезерва,
	               |	ИА_ЗаказНаПриобретение.Подразделение КАК Подразделение,
	               |	ИА_ЗаказНаПриобретение.Фонд КАК Фонд,
	               |	ИА_ЗаказНаПриобретение.Организация КАК Организация
	               |ИЗ
	               |	Документ.ИА_ЗаказНаПриобретение КАК ИА_ЗаказНаПриобретение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_ЗаказыНаПриобретение.Остатки(&НаДату, ) КАК ИА_ЗаказыНаПриобретениеОстатки
	               |		ПО ИА_ЗаказНаПриобретение.Ссылка = ИА_ЗаказыНаПриобретениеОстатки.ЗП
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(&НаДату, ) КАК ИА_СредстваВРезервеНаФондахОстатки
	               |		ПО ИА_ЗаказНаПриобретение.Ссылка = ИА_СредстваВРезервеНаФондахОстатки.ЗП
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ
	               |		ПО (ТЗ.Заказ = ИА_ЗаказНаПриобретение.Ссылка)
	               |			И (ТЗ.Статус = ЗНАЧЕНИЕ(Перечисление.ИА_СостояниеЗаказа.ОдобренЧастично_Закрыт)
	               |				ИЛИ ТЗ.Статус = ЗНАЧЕНИЕ(Перечисление.ИА_СостояниеЗаказа.Закрыт))";
	Выборка = запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		Движение = Движения.ИА_ЗаказыНаПриобретение.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Организация =  выборка.Организация; 
		Движение.ЗП = выборка.Заказ;
		Движение.Сумма = выборка.ОстатокЗаказа;
		
		Движение = Движения.ИА_СредстваВРезервеНаФондах.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Организация =  выборка.Организация; 
		Движение.Подразделение =  выборка.Подразделение; 
		Движение.Фонд =  выборка.Фонд; 
		Движение.ЗП =  выборка.Заказ;
		Движение.СуммаБезнал =  выборка.ОстатокРезерва;
	КонецЦикла;

	
	//Старые статусы
	МассивЗаказов = ОбработкаСтатусов(Движения.ИА_ИсторияСтатусовЗВС.Выгрузить());//Массив заказов которые нужно провести/перепровести для оповещения
		
	Если не Отказ Тогда
				
		//Установим статусы заявкам и сделаем резервирование
		Для каждого стр из ЗаказыНаПриобретение Цикл
			Если не ЗначениеЗаполнено(стр.Заказ) Тогда
				Продолжить;
			КонецЕсли;
			
			//Если Стр.Заказ.ПометкаУдаления Тогда //Помечен на удаление
			//	ДокОб = Стр.Заказ.ПолучитьОбъект();
			//	ДокОб.УстановитьПометкуУдаления(ложь);
			//	ДокОб.Записать();
			//	ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			//ИначеЕсли НЕ Стр.Заказ.Проведен Тогда //Записан
			//	ДокОб = Стр.Заказ.ПолучитьОбъект();
			//	ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			//Иначе
			//	Если МассивЗаказов.Найти(Стр.Заказ) <> Неопределено Тогда //Перепроведем только те ЗВС по которым изменилась история
			//		ДокОб = Стр.Заказ.ПолучитьОбъект();
			//		ДокОб.ДополнительныеСвойства.Вставить("НадоОповестить", Истина);
			//		Если АвтоотклоненныеЗаказы.Найти(Стр.Заказ) <> Неопределено Тогда
			//			ДокОб.ДополнительныеСвойства.Вставить("ОтклонениеИзФП", Истина);
			//		КонецЕсли;
			//		ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			//	КонецЕсли;
			//КонецЕсли;
			
			Если МассивЗаказов.Найти(Стр.Заказ) <> Неопределено Тогда
				Запись = РегистрыСведений.ИА_Оповещение.СоздатьМенеджерЗаписи();
				Запись.Период = ТекущаяДата();
				Запись.Заказ = Стр.Заказ;
				Запись.Автор = ПараметрыСеанса.ТекущийПользователь;
				Запись.Статус = стр.Статус;
				Если АвтоотклоненныеЗаказы.Найти(Стр.Заказ) <> Неопределено Тогда
					Запись.Автоотклонение = истина;
				КонецЕсли;			
				Запись.Записать(Истина);
			КонецЕсли;
			            
			Если СтатусыОдобрено.Найти(стр.Статус) <> Неопределено Тогда
				НовРезерв = Движения.ИА_СредстваВРезервеНаФондах.ДобавитьПриход();
				НовРезерв.Период = Дата;
				НовРезерв.Организация = Организация;
				НовРезерв.Фонд = стр.Заказ.Фонд;
				НовРезерв.Подразделение = стр.Заказ.Подразделение;
				НовРезерв.ЗП = стр.Заказ;
				НовРезерв.СуммаБезнал = стр.УтвержденнаяСумма;	
			КонецЕсли;
					
		КонецЦикла;
		
		Движения.ИА_СредстваВРезервеНаФондах.Записать();
		Движения.ИА_СредстваНаФондах.Записать();
		Движения.ИА_ДоходыБудущихПериодов.Записать();
		Движения.ИА_ЗаймыСФондов.Записать();
		//Движения.ИА_УтвержденныйПланПродаж.Записать();
		Движения.ИА_ИсторияСтатусовЗВС.Записать();
		Движения.ИА_УчетСтатистик.Записать();
		Движения.КСУ_КомментарииФП.Записать();

	КонецЕсли;
	
КонецПроцедуры


Функция ОбработкаСтатусов(ТабДвиж)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабДвиж.ЗВС,
		|	ТабДвиж.Статус
		|ПОМЕСТИТЬ ВТ_НовыеДвижения
		|ИЗ
		|	&ТабДвиж КАК ТабДвиж
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИА_ИсторияСтатусовЗВС.ЗВС,
		|	ИА_ИсторияСтатусовЗВС.Статус,
		|	ИА_ИсторияСтатусовЗВС.Период
		|ПОМЕСТИТЬ ВТ_ТекущиеСтатусыДоФП
		|ИЗ
		|	РегистрСведений.ИА_ИсторияСтатусовЗВС КАК ИА_ИсторияСтатусовЗВС
		|ГДЕ
		|	ИА_ИсторияСтатусовЗВС.ЗВС В
		|			(ВЫБРАТЬ
		|				А.ЗВС
		|			ИЗ
		|				ВТ_НовыеДвижения КАК А)
		|	И ИА_ИсторияСтатусовЗВС.Период <= &ДатаФП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТекущиеСтатусыДоФП.ЗВС,
		|	МАКСИМУМ(ВТ_ТекущиеСтатусыДоФП.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ПоследниеСтатусыДоФП
		|ИЗ
		|	ВТ_ТекущиеСтатусыДоФП КАК ВТ_ТекущиеСтатусыДоФП
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТекущиеСтатусыДоФП.ЗВС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ПоследниеСтатусыДоФП.ЗВС,
		|	ВТ_ТекущиеСтатусыДоФП.Статус
		|ПОМЕСТИТЬ ВТ_СтарыеДвижения2
		|ИЗ
		|	ВТ_ПоследниеСтатусыДоФП КАК ВТ_ПоследниеСтатусыДоФП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеСтатусыДоФП КАК ВТ_ТекущиеСтатусыДоФП
		|		ПО ВТ_ПоследниеСтатусыДоФП.ЗВС = ВТ_ТекущиеСтатусыДоФП.ЗВС
		|			И ВТ_ПоследниеСтатусыДоФП.Период = ВТ_ТекущиеСтатусыДоФП.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_НовыеДвижения.ЗВС, ВТ_СтарыеДвижения2.ЗВС) КАК ЗВС
		|ИЗ
		|	ВТ_НовыеДвижения КАК ВТ_НовыеДвижения
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СтарыеДвижения2 КАК ВТ_СтарыеДвижения2
		|		ПО ВТ_НовыеДвижения.ЗВС = ВТ_СтарыеДвижения2.ЗВС
		|ГДЕ
		|	ЕСТЬNULL(ВТ_НовыеДвижения.Статус, 0) <> ЕСТЬNULL(ВТ_СтарыеДвижения2.Статус, 0)";
	
	Запрос.УстановитьПараметр("ФП", Ссылка);
	Запрос.УстановитьПараметр("ДатаФП", Дата);
	Запрос.УстановитьПараметр("ТабДвиж", ТабДвиж);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Массив = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Массив.Добавить(ВыборкаДетальныеЗаписи.ЗВС);
	КонецЦикла;
	Возврат Массив;
КонецФункции

Функция ПроверитьДоходыБП()
	Запрос = новый Запрос;
	мен = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = мен;
	
	//текущее распределение
	тз_тек = ДоходыБП.Выгрузить();
	Для каждого стр из тз_тек Цикл
		Если стр.Период > КонецДня(Дата) Тогда
			тз_тек.Удалить(стр);
		КонецЕсли;
	КонецЦикла;
	тз_тек.Свернуть("Источник,ВидДохода","СуммаНал,СуммаБезнал");
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.ВидДохода,
	               |	ТЗ.СуммаНал,
	               |	ТЗ.СуммаБезнал,
	               |	ТЗ.Источник
	               |ПОМЕСТИТЬ ВТЗ
	               |ИЗ
	               |	&ТЗ КАК ТЗ";
	Запрос.УстановитьПараметр("ТЗ",тз_тек);
	Запрос.Выполнить();
	//
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ИА_ДоходыБудущихПериодовОстатки.СуммаНалОстаток, 0) - ИА_ФинансовоеПланированиеДоходыБП.СуммаНал + ЕСТЬNULL(ТекРаспр.СуммаНал, 0) КАК ОстатокНал,
	               |	ЕСТЬNULL(ИА_ДоходыБудущихПериодовОстатки.СуммаБезналОстаток, 0) - ИА_ФинансовоеПланированиеДоходыБП.СуммаБезнал + ЕСТЬNULL(ТекРаспр.СуммаБезнал, 0) КАК ОстатокБезнал,
	               |	ИА_ФинансовоеПланированиеДоходыБП.ВидДохода,
	               |	ИА_ФинансовоеПланированиеДоходыБП.Источник
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ИА_ФинансовоеПланированиеДоходыБП.ВидДохода КАК ВидДохода,
	               |		СУММА(ИА_ФинансовоеПланированиеДоходыБП.СуммаНал) КАК СуммаНал,
	               |		СУММА(ИА_ФинансовоеПланированиеДоходыБП.СуммаБезнал) КАК СуммаБезнал,
	               |		ИА_ФинансовоеПланированиеДоходыБП.Источник КАК Источник
	               |	ИЗ
	               |		Документ.ИА_ФинансовоеПланирование.ДоходыБП_Распределение КАК ИА_ФинансовоеПланированиеДоходыБП
	               |	ГДЕ
	               |		ИА_ФинансовоеПланированиеДоходыБП.Ссылка = &ссылка
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ИА_ФинансовоеПланированиеДоходыБП.ВидДохода,
	               |		ИА_ФинансовоеПланированиеДоходыБП.Источник) КАК ИА_ФинансовоеПланированиеДоходыБП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_ДоходыБудущихПериодов.Остатки(&МВ
	               |				,
	               |				Организация = &Организация
	               |					ИЛИ &НеРазделять) КАК ИА_ДоходыБудущихПериодовОстатки
	               |		ПО ИА_ФинансовоеПланированиеДоходыБП.ВидДохода = ИА_ДоходыБудущихПериодовОстатки.ВидДохода
	               |			И ИА_ФинансовоеПланированиеДоходыБП.Источник = ИА_ДоходыБудущихПериодовОстатки.Источник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗ КАК ТекРаспр
	               |		ПО ИА_ФинансовоеПланированиеДоходыБП.ВидДохода = ТекРаспр.ВидДохода
	               |			И ИА_ФинансовоеПланированиеДоходыБП.Источник = ТекРаспр.Источник";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НеРазделять", не Константы.ИА_ФП_ВестиФППоОрганизациям.Получить());
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("ссылка", Ссылка);
	Запрос.УстановитьПараметр("МВ", МоментВремени()); // ИА_Аврамов 21.06.2016  
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОстатокНал < 0 или Выборка.ОстатокБезнал < 0 Тогда
			Сообщить("Отрицательный остаток по доходу будущего периода: "+ Выборка.ВидДохода + " " + Выборка.Источник);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	
	///////////// НОВАЯ СХЕМА
	тз_тек = ОтложенныйДоход.Выгрузить();
	Сч = тз_тек.Количество() - 1;
	Пока сч >= 0 Цикл
		стр = тз_тек[сч];
		Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить Тогда
			тз_тек.Удалить(стр);
		КонецЕсли;
		
		сч = сч - 1;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТЗ", тз_тек);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Сумма КАК Сумма,
	               |	ТЗ.ид КАК Источник
	               |ПОМЕСТИТЬ ОтложенныйДоход
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_ДоходыБудущихПериодов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	               |				ТОГДА ИА_ДоходыБудущихПериодов.СуммаБезнал
	               |			ИНАЧЕ -ИА_ДоходыБудущихПериодов.СуммаБезнал
	               |		КОНЕЦ) КАК СуммаБезнал,
	               |	ИА_ДоходыБудущихПериодов.Источник КАК Источник
	               |ПОМЕСТИТЬ ТЕкОСтатки
	               |ИЗ
	               |	РегистрНакопления.ИА_ДоходыБудущихПериодов КАК ИА_ДоходыБудущихПериодов
	               |ГДЕ
	               |	ИА_ДоходыБудущихПериодов.Регистратор <> &ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_ДоходыБудущихПериодов.Источник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЕкОСтатки.СуммаБезнал - ЕСТЬNULL(ОтложенныйДоход.Сумма, 0) КАК ОстатокБезнал,
	               |	ТЕкОСтатки.Источник КАК Источник
	               |ИЗ
	               |	ТЕкОСтатки КАК ТЕкОСтатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтложенныйДоход КАК ОтложенныйДоход
	               |		ПО (ОтложенныйДоход.Источник = ТЕкОСтатки.Источник)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОстатокБезнал < 0 Тогда
			Сообщить("Отрицательный остаток по отложенному доходу: "+ Выборка.Источник.ВидДохода + " " + Выборка.Источник);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат истина;
КонецФункции

Процедура ПеревестиСФондаНаФонд(ДвиженияПоФондам, СФонда = Неопределено, СЦФО = Неопределено, 
	НаФонд = Неопределено, НаЦФО = Неопределено, СуммаНал, СуммаБезнал, Операция = Неопределено, ПояснениеТекст = "", ПояснениеСсылка = Неопределено)
	
	Если СФонда <> Неопределено Тогда
		Движение = ДвиженияПоФондам.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Фонд = СФонда;	
		Движение.Подразделение = СЦФО;	
		Движение.СуммаНал = СуммаНал;
		Движение.СуммаБезнал = СуммаБезнал;
		
		Движение.Операция = Операция;
		Движение.ПояснениеТекст = ПояснениеТекст;
		Движение.ПояснениеСсылка = ПояснениеСсылка;
		
		Движение.ПояснениеТекст = "В фонд " + НаФонд;
	КонецЕсли;
	
	Если НаФонд <> Неопределено Тогда
		Движение = ДвиженияПоФондам.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Фонд = НаФонд;
		Движение.Подразделение = НаЦФО;	
		Движение.СуммаНал = СуммаНал;
		Движение.СуммаБезнал = СуммаБезнал;
		
		Движение.Операция = Операция;
		Движение.ПояснениеТекст = ПояснениеТекст;
		Движение.ПояснениеСсылка = ПояснениеСсылка;
		
		Если Операция = Перечисления.КСУ_ОперацииПоФондам.ПредоставлениеЗайма Тогда
			Движение.Операция = Перечисления.КСУ_ОперацииПоФондам.ПолучениеЗайма;
			Движение.ПояснениеТекст = "С фонда " + СФонда;
		ИначеЕсли Операция = Перечисления.КСУ_ОперацииПоФондам.ВозвратПолученногоЗайма ТОгда
			Движение.Операция = Перечисления.КСУ_ОперацииПоФондам.ВозвратВыданногоЗайма;
			Движение.ПояснениеТекст = "С фонда " + СФонда;
		ИначеЕсли Операция = Перечисления.КСУ_ОперацииПоФондам.ПеремещениеВДругойФонд Тогда
			Движение.Операция = Перечисления.КСУ_ОперацииПоФондам.ПеремещениеСДругогоФонда;
			Движение.ПояснениеТекст = "С фонда " + СФонда;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли; // ИА_Аврамов 06.11.2014  
	
	Если Дата <= Константы.ИА_ФП_ДатаЗапретаРедактирования.Получить() Тогда
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Установлена дата запрета редактирования!";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;	
		
	// проверки на корректность
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для каждого стр из ЗаказыНаПриобретение Цикл
			Если стр.Статус.Пустая() тогда
				Сообщить("Заполните статус для заказа "+ стр.Заказ);
				Отказ = истина;
			КонецЕсли;
						
			//Если ЗначениеЗаполнено(стр.Заказ) И стр.Статус = Перечисления.ИА_СостояниеЗаказа.Отклонен И СокрЛП(стр.ПричинаОтказа) = "" Тогда
			//	Сообщить("Заполните причину отказа для заказа "+ стр.Заказ);
			//КонецЕсли;		
		КонецЦикла;
		
		Если СальдоСредствКРаспределениюНал + СальдоСредствКРаспределениюБезнал < 0 Тогда
			Сообщить("Сальдо средств отрицательное!");
			Отказ = истина;
		КонецЕсли;
		
		Если Ответственный.Пустая() и не Отказ Тогда
			Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ тогда
		возврат;
	КонецЕсли;
	
	// Отложенный доход	
	ДЛя каждого стр из ОтложенныйДоход Цикл
		Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить Тогда
			Если стр.ид.Пустая() Тогда
				ИстОб = Справочники.ИА_ИсточникиСпецДохода.СоздатьЭлемент();
			Иначе
				ИстОб = стр.ид.ПолучитьОбъект();
			КонецЕсли;
			
			ИстОб.Наименование = стр.Комментарий + " до " + формат(стр.ДоДаты,"ДФ=dd.MM.yyyy");
			ИстОб.ДатаОперации = Дата;
			
			ЗаполнитьЗначенияСвойств(ИстОб,стр);
			ИстОб.Записать();
			
			стр.ид = ИстОб.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	// Займы	
	ДЛя каждого стр из РаспределениеПоФондам Цикл
		Если стр.ЗаймВозврат = Перечисления.ИА_ЗаймВозврат.Займ Тогда
			Если стр.ид = Справочники.КСУ_Займы.ПереходНа84 Тогда
				Продолжить;
			КонецЕсли;
				
			Если стр.ид.Пустая() Тогда
				ИстОб = Справочники.КСУ_Займы.СоздатьЭлемент();
			Иначе
				ИстОб = стр.ид.ПолучитьОбъект();
			КонецЕсли;
			
			ИстОб.Наименование = строка(стр.Фонд) + " до " + формат(стр.КрайнийСрок,"ДФ=dd.MM.yyyy");
			ИстОб.ДатаЗайма = Дата;			
			ЗаполнитьЗначенияСвойств(ИстОб,стр);
			ИстОб.НаФонд = стр.Фонд;
			ИстОб.НаПодразделение = стр.Подразделение;
			ИстОб.Сумма = стр.СуммаБезнал;
			ИстОб.Записать();
			
			стр.ид = ИстОб.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	для каждого стр из ЗаказыНаПриобретение цикл
		Если стр.Статус = Перечисления.ИА_СостояниеЗаказа.Отклонен или стр.Статус = Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_Закрыт тогда
			стр.ПричинаОтказа = стр.КомментарийСФП;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры         

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

КонецПроцедуры // Печать

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = прав(год(Дата),2)+".";
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ДЛя каждого стр из ОтложенныйДоход Цикл
		Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить Тогда
			Если не стр.ид.Пустая() Тогда
				ИстОб = стр.ид.ПолучитьОбъект();
				ИстОб.НаименованиеИД = "#" + Номер+ "-" + стр.НомерСтроки + "/ОД";
				ИстОб.Записать();
			КонецЕсли;			 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	для каждого стр из ЗаказыНаПриобретение Цикл
		Движение = РегистрыСведений.КСУ_ЛентаСобытий.СоздатьМенеджерЗаписи();
		Движение.ПериодСобытия = Дата;
		Движение.ДатаСобытия = ТекущаяДата();
		Движение.Объект = стр.Заказ;		
		Движение.Событие = "Отмена проведения ФП №" + Номер+". В ФП был статус заказа "+ стр.Статус;
		Движение.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Движение.Записать();
	КонецЦикла;
КонецПроцедуры
