Процедура ПолучитьОстаткиКОбеспечению(МенеджерВТ, Заказ, Регистратор = Неопределено, УчетПоКомнатам = Истина) Экспорт
	
	//НастройкаИнтеркампани = ОбщийМодуль.ПолучитьНастройкуИнтеркампани(Заказ.ТочкаПродаж, Заказ.Подразделение);	
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ИсключитьДокумент", НЕ Регистратор = Неопределено);
	Запрос.УстановитьПараметр("ЗаказДоговор", Заказ);
	//Запрос.УстановитьПараметр("ЗаказыватьМатериалы", НастройкаИнтеркампани.ЗаказПоставщикуЗаказыватьМатериалы);
	Запрос.УстановитьПараметр("ЗаказыватьМатериалы", Истина);
	Запрос.УстановитьПараметр("УчетПоКомнатам", УчетПоКомнатам);  //#14675
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА &УчетПоКомнатам
	|			ТОГДА ОбеспечениеЗаказовРозницыОбороты.Комната
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комната,
	|	ОбеспечениеЗаказовРозницыОбороты.Номенклатура КАК Номенклатура,
	|	ОбеспечениеЗаказовРозницыОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОбеспечениеЗаказовРозницыОбороты.КоличествоОборот) КАК Обеспечено,
	|	СУММА(ВЫБОР
	|			КОГДА ОбеспечениеЗаказовРозницыОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателя
	|				ТОГДА ОбеспечениеЗаказовРозницыОбороты.КоличествоОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбеспеченоПроизводством
	|ПОМЕСТИТЬ ВТ_ТоварыОбеспеченные
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказовРозницы.Обороты(
	|			,
	|			,
	|			Авто,
	|			Заказ = &ЗаказДоговор
	|				И Назначение = ""Товары"") КАК ОбеспечениеЗаказовРозницыОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИсключитьДокумент
	|				ТОГДА ОбеспечениеЗаказовРозницыОбороты.Регистратор <> &Регистратор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА &УчетПоКомнатам
	|			ТОГДА ОбеспечениеЗаказовРозницыОбороты.Комната
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОбеспечениеЗаказовРозницыОбороты.Номенклатура,
	|	ОбеспечениеЗаказовРозницыОбороты.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА &УчетПоКомнатам
	|			ТОГДА ОбеспечениеЗаказовРозницыОбороты.Комната
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комната,
	|	ОбеспечениеЗаказовРозницыОбороты.Номенклатура КАК Номенклатура,
	|	ОбеспечениеЗаказовРозницыОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОбеспечениеЗаказовРозницыОбороты.КоличествоОборот) КАК Обеспечено,
	|	СУММА(ВЫБОР
	|			КОГДА ОбеспечениеЗаказовРозницыОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателя
	|				ТОГДА ОбеспечениеЗаказовРозницыОбороты.КоличествоОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбеспеченоПроизводством
	|ПОМЕСТИТЬ ВТ_МатериалыОбеспеченные
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказовРозницы.Обороты(
	|			,
	|			,
	|			Авто,
	|			Заказ = &ЗаказДоговор
	|				И Назначение = ""Материалы"") КАК ОбеспечениеЗаказовРозницыОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИсключитьДокумент
	|				ТОГДА ОбеспечениеЗаказовРозницыОбороты.Регистратор <> &Регистратор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА &УчетПоКомнатам
	|			ТОГДА ОбеспечениеЗаказовРозницыОбороты.Комната
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОбеспечениеЗаказовРозницыОбороты.Номенклатура,
	|	ОбеспечениеЗаказовРозницыОбороты.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА &УчетПоКомнатам
	|			ТОГДА ДокументРозницыТоварыУслуги.Комната
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комната,
	|	ДокументРозницыТоварыУслуги.Номенклатура КАК Номенклатура,
	|	ДокументРозницыТоварыУслуги.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокументРозницыТоварыУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДокументРозницыТоварыУслуги.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ДокументРозницыТоварыУслуги.Номенклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_ТоварыОбеспеченные.Обеспечено, 0) = 0
	|						ТОГДА ДокументРозницыТоварыУслуги.Количество
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ДокументРозницыТоварыУслуги.Количество - ЕСТЬNULL(ВТ_ТоварыОбеспеченные.Обеспечено, 0)
	|	КОНЕЦ КАК КоличествоКОбеспечению,
	|	ВЫБОР
	|		КОГДА ДокументРозницыТоварыУслуги.Номенклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_ТоварыОбеспеченные.ОбеспеченоПроизводством, 0) = 0
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ТоварыОбеспеченные.ОбеспеченоПроизводством, 0)
	|	КОНЕЦ КАК ОбеспеченоПроизводством,
	|	ДокументРозницыТоварыУслуги.Коэффициент КАК Коэффициент,
	|	ДокументРозницыТоварыУслуги.НомерПотолка КАК НомерПотолка,
	|	ДокументРозницыТоварыУслуги.Цена КАК Цена,
	|	ДокументРозницыТоварыУслуги.Сумма КАК Сумма,
	|	ДокументРозницыТоварыУслуги.ПроцентСкидки КАК ПроцентСкидки,
	|	ДокументРозницыТоварыУслуги.СуммаСкидки КАК СуммаСкидки,
	|	ДокументРозницыТоварыУслуги.НомерСтроки КАК НомерСтроки,
	|	""Товары"" КАК Назначение
	|ПОМЕСТИТЬ ВТ_ТоварыКОбеспечению
	|ИЗ
	|	Документ.ЗаказДоговор.ТоварыУслуги КАК ДокументРозницыТоварыУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыОбеспеченные КАК ВТ_ТоварыОбеспеченные
	|		ПО (ВЫБОР
	|				КОГДА &УчетПоКомнатам
	|					ТОГДА ВТ_ТоварыОбеспеченные.Комната = ДокументРозницыТоварыУслуги.Комната
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВТ_ТоварыОбеспеченные.Номенклатура = ДокументРозницыТоварыУслуги.Номенклатура)
	|			И (ВТ_ТоварыОбеспеченные.ХарактеристикаНоменклатуры = ДокументРозницыТоварыУслуги.ХарактеристикаНоменклатуры)
	|ГДЕ
	|	ДокументРозницыТоварыУслуги.Ссылка = &ЗаказДоговор
	|	И НЕ ДокументРозницыТоварыУслуги.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НЕ ДокументРозницыТоварыУслуги.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
	|	И ДокументРозницыТоварыУслуги.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА &УчетПоКомнатам
	|			ТОГДА ДокументРозницыМатериалы.Комната
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комната,
	|	ДокументРозницыМатериалы.Номенклатура КАК Номенклатура,
	|	ДокументРозницыМатериалы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокументРозницыМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДокументРозницыМатериалы.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ДокументРозницыМатериалы.Номенклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_МатериалыОбеспеченные.Обеспечено, 0) = 0
	|						ТОГДА ДокументРозницыМатериалы.Количество
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ДокументРозницыМатериалы.Количество - ЕСТЬNULL(ВТ_МатериалыОбеспеченные.Обеспечено, 0)
	|	КОНЕЦ КАК КоличествоКОбеспечению,
	|	ВЫБОР
	|		КОГДА ДокументРозницыМатериалы.Номенклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез), ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_МатериалыОбеспеченные.ОбеспеченоПроизводством, 0) = 0
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ВТ_МатериалыОбеспеченные.ОбеспеченоПроизводством, 0)
	|	КОНЕЦ КАК ОбеспеченоПроизводством,
	|	ДокументРозницыМатериалы.Коэффициент КАК Коэффициент,
	|	ДокументРозницыМатериалы.НомерСтроки КАК НомерСтроки,
	|	""Материалы"" КАК Назначение
	|ПОМЕСТИТЬ ВТ_МатериалыКОбеспечению
	|ИЗ
	|	Документ.ЗаказДоговор.Материалы КАК ДокументРозницыМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МатериалыОбеспеченные КАК ВТ_МатериалыОбеспеченные
	|		ПО (ВЫБОР
	|				КОГДА &УчетПоКомнатам
	|					ТОГДА ВТ_МатериалыОбеспеченные.Комната = ДокументРозницыМатериалы.Комната
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВТ_МатериалыОбеспеченные.Номенклатура = ДокументРозницыМатериалы.Номенклатура)
	|			И (ВТ_МатериалыОбеспеченные.ХарактеристикаНоменклатуры = ДокументРозницыМатериалы.ХарактеристикаНоменклатуры)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЗаказыватьМатериалы
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ДокументРозницыМатериалы.Ссылка = &ЗаказДоговор
	|	И НЕ ДокументРозницыМатериалы.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НЕ ДокументРозницыМатериалы.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
	|	И ДокументРозницыМатериалы.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТоварыКОбеспечению.Назначение КАК Назначение,
	|	ВТ_ТоварыКОбеспечению.Комната КАК Комната,
	|	ВТ_ТоварыКОбеспечению.НомерПотолка КАК НомерПотолка,
	|	ВТ_ТоварыКОбеспечению.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыКОбеспечению.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТоварыКОбеспечению.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ТоварыКОбеспечению.Коэффициент КАК Коэффициент,
	|	СУММА(ВТ_ТоварыКОбеспечению.Количество) КАК Количество,
	|	СУММА(ВТ_ТоварыКОбеспечению.КоличествоКОбеспечению) КАК КоличествоКОбеспечению,
	|	СУММА(ВТ_ТоварыКОбеспечению.ОбеспеченоПроизводством) КАК ОбеспеченоПроизводством
	|ПОМЕСТИТЬ ВТ_ТоварыКОбеспечениюСвернуто
	|ИЗ
	|	ВТ_ТоварыКОбеспечению КАК ВТ_ТоварыКОбеспечению
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыКОбеспечению.Назначение,
	|	ВТ_ТоварыКОбеспечению.Комната,
	|	ВТ_ТоварыКОбеспечению.НомерПотолка,
	|	ВТ_ТоварыКОбеспечению.Номенклатура,
	|	ВТ_ТоварыКОбеспечению.ХарактеристикаНоменклатуры,
	|	ВТ_ТоварыКОбеспечению.ЕдиницаИзмерения,
	|	ВТ_ТоварыКОбеспечению.Коэффициент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_МатериалыКОбеспечению.Назначение КАК Назначение,
	|	ВТ_МатериалыКОбеспечению.Комната КАК Комната,
	|	ВТ_МатериалыКОбеспечению.Номенклатура КАК Номенклатура,
	|	ВТ_МатериалыКОбеспечению.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_МатериалыКОбеспечению.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_МатериалыКОбеспечению.Коэффициент КАК Коэффициент,
	|	СУММА(ВТ_МатериалыКОбеспечению.Количество) КАК Количество,
	|	СУММА(ВТ_МатериалыКОбеспечению.КоличествоКОбеспечению) КАК КоличествоКОбеспечению,
	|	СУММА(ВТ_МатериалыКОбеспечению.ОбеспеченоПроизводством) КАК ОбеспеченоПроизводством
	|ПОМЕСТИТЬ ВТ_МатериалыКОбеспечениюСвернуто
	|ИЗ
	|	ВТ_МатериалыКОбеспечению КАК ВТ_МатериалыКОбеспечению
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МатериалыКОбеспечению.Назначение,
	|	ВТ_МатериалыКОбеспечению.Комната,
	|	ВТ_МатериалыКОбеспечению.Номенклатура,
	|	ВТ_МатериалыКОбеспечению.ХарактеристикаНоменклатуры,
	|	ВТ_МатериалыКОбеспечению.ЕдиницаИзмерения,
	|	ВТ_МатериалыКОбеспечению.Коэффициент";
	
	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.Монтаж") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ЗаказДоговор", "Документ.Монтаж");
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокументРозницыТоварыУслуги.НомерПотолка", """""");		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
		
КонецПроцедуры

Функция ТребуетсяЗаписьПоОснованию(ДокументОснование) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказДоговор") ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Монтаж") Тогда
			Возврат Истина; //ДокументОснование.СлужебныйОбеспечениеПоДокументу;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции
