
&НаКлиенте
Процедура ИнструкцииСданоПриИзменении(Элемент)
	тд = Элементы.Инструкции.ТекущиеДанные;
	тд.ДатаСдачи = ?(тд.Сдано, ТекущаяДата(), Дата(1,1,1));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если объект.Ссылка.Пустая() Тогда
		объект.Автор = ТекПользователь;
	КонецЕсли;
	
	// доступность
	Если объект.Автор <> ТекПользователь Тогда
		Элементы.ГруппаШапка.ТолькоПросмотр = истина;
		
		Элементы.ИнструкцииИнструкция.ТолькоПросмотр = истина;
		Элементы.ИнструкцииСдано.ТолькоПросмотр = истина;
		Элементы.ИнструкцииДатаСдачи.ТолькоПросмотр = истина;
		
		Элементы.ВопросыВопрос.ТолькоПросмотр = истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнструкцииИнструкцияПриИзменении(Элемент)
	тд = Элементы.Инструкции.ТекущиеДанные;
	Если тд.УИДстроки = "" Тогда
		тд.УИДстроки = строка(новый УникальныйИдентификатор);
	КонецЕсли;
	ОбновитьВопросы();	
	
	УстановитьОтборВопросов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВопросы()
	ТекСтрока = Элементы.Инструкции.ТекущиеДанные;
    Если ТекСтрока <> Неопределено и ЗначениеЗаполнено(ТекСтрока.УИДстроки) и ЗначениеЗаполнено(ТекСтрока.Инструкция) Тогда
        УИДстроки = ТекСтрока.УИДстроки;
		
		сч = Объект.Вопросы.Количество()-1;
		Пока сч>=0 Цикл
			если Объект.Вопросы[сч].УИДстроки = УИДстроки Тогда
				Объект.Вопросы.Удалить(сч);
			КонецЕсли;
			
			сч = сч -1;
		КонецЦикла;
		
		вопросыДИ = ПолучитьВопросыДИ(ТекСтрока.Инструкция);
		Для каждого стр из вопросыДИ Цикл
			Новстр = Объект.Вопросы.Добавить();
			Новстр.УИДстроки = УИДстроки;
			Новстр.Вопрос = стр;
		КонецЦикла;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборВопросов()
	ТекСтрока = Элементы.Инструкции.ТекущиеДанные;
    Если ТекСтрока <> Неопределено и ЗначениеЗаполнено(ТекСтрока.УИДстроки) Тогда
        УИДстроки = ТекСтрока.УИДстроки;
    Иначе
        УИДстроки = "424242424242424242424242424242";
    КонецЕсли; 
    
    Элементы.Вопросы.ОтборСтрок = Новый ФиксированнаяСтруктура("УИДстроки", УИДстроки);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВопросыДИ(ди)
	возврат ди.Вопросы.Выгрузить().ВыгрузитьКолонку("Вопрос");
КонецФункции


&НаКлиенте
Процедура ИнструкцииПриАктивизацииСтроки(Элемент)
	УстановитьОтборВопросов();
КонецПроцедуры


&НаКлиенте
Процедура ИнструкцииПослеУдаления(Элемент)
	УстановитьОтборВопросов();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьВсемиДоступнымиНаСервере(ТолькоНовые = ложь)
	
	Объект.Инструкции.Очистить();
	Объект.Вопросы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ДоступныеИнструкции.Инструкция
	               |ИЗ
	               |	РегистрСведений.ИА_ДоступныеИнструкции КАК ИА_ДоступныеИнструкции
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ИзучениеДИ.СрезПоследних КАК ИА_ИзучениеДИСрезПоследних
	               |		ПО ИА_ДоступныеИнструкции.Пользователь = ИА_ИзучениеДИСрезПоследних.Пользователь
	               |			И ИА_ДоступныеИнструкции.Инструкция = ИА_ИзучениеДИСрезПоследних.Инструкция
	               |ГДЕ
	               |	ИА_ДоступныеИнструкции.Пользователь = &Пользователь
	               |	И (ИА_ИзучениеДИСрезПоследних.Инструкция ЕСТЬ NULL
	               |			ИЛИ НЕ &ТолькоНовые)
	               |	И ИА_ДоступныеИнструкции.Инструкция.ЭтоГруппа = ложь";
	Запрос.УстановитьПараметр("Пользователь", Объект.Сотрудник);
	Запрос.УстановитьПараметр("ТолькоНовые", ТолькоНовые);
	выб = Запрос.Выполнить().Выбрать();
	
	Пока выб.Следующий() Цикл
		Новстр = Объект.Инструкции.Добавить();
		Новстр.Инструкция = выб.Инструкция;
		Новстр.УИДстроки = строка(новый УникальныйИдентификатор);
		
		Для каждого стр из выб.Инструкция.Вопросы Цикл
			Новстр1 = Объект.Вопросы.Добавить();
			Новстр1.УИДстроки = Новстр.УИДстроки;
			Новстр1.Вопрос = стр.Вопрос;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьВсемиДоступными(Команда)
	Если Объект.Сотрудник.Пустая() Тогда
		ПоказатьПредупреждение(,"Укажите сотрудника");
		возврат;
	КонецЕсли;
	ЗаполнитьВсемиДоступнымиНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьНовыми(Команда)
	ЗаполнитьВсемиДоступнымиНаСервере(истина);
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Проведен Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_ЗадачаПланаДействий.Ссылка
		               |ИЗ
		               |	Задача.ИА_ЗадачаПланаДействий КАК ИА_ЗадачаПланаДействий
		               |ГДЕ
		               |	ИА_ЗадачаПланаДействий.ПрикрепленныйОбъект = &ПрикрепленныйОбъект";
		Запрос.УстановитьПараметр("ПрикрепленныйОбъект", ТекущийОбъект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если не Выборка.Следующий() Тогда // нет задачи на ознакомление
			НоваяЗадача = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
			НоваяЗадача.Автор = ТекущийОбъект.Автор;
			НоваяЗадача.ПостАвтора = ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПолучитьВысокийПостПользователя(НоваяЗадача.Автор);
			НоваяЗадача.Дата = ТекущаяДата();
			НоваяЗадача.Наименование = "Ознакомиться с должностными инструкциями";
			НоваяЗадача.Содержание = "Задание находится в прикрепленном объекте." + Символы.ПС ;
			
			Для Каждого стр из ТекущийОбъект.инструкции Цикл
				НоваяЗадача.Содержание  = НоваяЗадача.Содержание  + Символы.ПС + стр.Инструкция.Наименование; 
			КонецЦикла;
			
			НоваяЗадача.Пользователь = ТекущийОбъект.Сотрудник;
			
			НоваяЗадача.ПрикрепленныйОбъект = ТекущийОбъект.Ссылка;
			НоваяЗадача.Отправлена = истина;
			НоваяЗадача.СрокИсполнения = ТекущийОбъект.Срок;
			
			НоваяЗадача.Записать();
			Сообщить("Отправлена задача сотруднику!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

