
&НаКлиенте
Процедура ГоловнаяОрганизацияПриИзменении(Элемент)
	Объект.Наименование = Объект.ГоловнаяОрганизация;	
КонецПроцедуры

//&НаСервере
//Функция МожноИспользоватьОрганизацию(пОрг)
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка
//	               |ИЗ
//	               |	Справочник.ИА_ГруппыКомпаний.ДочерниеОрганизации КАК ИА_ГруппыКомпанийДочерниеОрганизации
//	               |ГДЕ
//	               |	(ИА_ГруппыКомпанийДочерниеОрганизации.Организация = &Организация
//	               |			ИЛИ ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка.ГоловнаяОрганизация = &Организация)
//	               |	И ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка.ПометкаУдаления = ЛОЖЬ
//	               |	И ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка <> &Ссылка";
//	Запрос.УстановитьПараметр("Организация", пОрг);
//	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Возврат не Выборка.Следующий();
//КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ДочерниеОрганизации.Количество() = 0 Тогда
		Сообщить("Дочерние организации должны быть указаны!");
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ГруппыКомпаний.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ИА_ГруппыКомпаний КАК ИА_ГруппыКомпаний
	               |ГДЕ
	               |	ИА_ГруппыКомпаний.Наименование = &Наименование
	               |	И ИА_ГруппыКомпаний.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Наименование", ТекущийОбъект.Наименование);
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	Выборка = запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() тогда
		Сообщить("Уже есть группа компаний с таким наименованием. Переименуйте эту группу компаний.");
		Отказ = истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДочерниеОрганизацииОрганизацияПриИзменении(Элемент)
	//тд = Элементы.ДочерниеОрганизации.ТекущиеДанные;
	//Если не МожноИспользоватьОрганизацию(тд.Организация) Тогда
	//	тд.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
		Сообщить("Группы компаний нельзя копировать");
    	Отказ = Истина; 
		СтандартнаяОбработка = Ложь;
		возврат;
	КонецЕсли;
	
	Если не объект.ГоловнаяОрганизация.Пустая() тогда
		Элементы.ГоловнаяОрганизация.СписокВыбора.Добавить(объект.ГоловнаяОрганизация);	
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоступныеОрганизации(ОбъектСсылка)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Организации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_ГруппыКомпаний.ДочерниеОрганизации КАК ИА_ГруппыКомпанийДочерниеОрганизации
	               |		ПО (Организации.Ссылка = ИА_ГруппыКомпанийДочерниеОрганизации.Организация
	               |				ИЛИ Организации.Ссылка = ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка.ГоловнаяОрганизация)
	               |			И (ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка <> &ОбъектСсылка)
	               |ГДЕ
	               |	Организации.ПометкаУдаления = ЛОЖЬ
	               |	И ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	Рез = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	возврат рез;
КонецФункции
	
&НаКлиенте
Процедура СправкаГлавная(Команда)
	ТекстСправки = "<html><head>
                    |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
                    |<link rel=""stylesheet"" type=""text/css"" href=""v8help://service_book/service_style"">
                    |<base href=""v8config://7d32e633-0199-4299-a901-d784bf219591/mdobject/idc249fa8c-34da-4e48-8698-cbad0394a17c/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">
                    |</head>
                    |<body><span id=""docs-internal-guid-9478dc80-7fff-c9cc-231e-6e181428d335""><span style=""font-size: 10pt; font-family: Arial; background-color: transparent; font-variant-ligatures: normal; font-variant-east-asian: normal; font-variant-position: normal; vertical-align: baseline; white-space: pre-wrap;"">Выберите организацию, которая будет головной в группе. Добавьте другие организация (юридические лица), 
                    |доступные в 1С. Запишите и закройте элемент справочника.</span></span>
                    |
                    |
                    |</body></html>";
	ОткрытьФорму("ОбщаяФорма.КСУ_Справка", новый Структура("ТекстСправки, Заголовок", ТекстСправки, "Группа компаний"));
КонецПроцедуры

&НаКлиенте
Процедура СправкаСостав(Команда)
	ТекстСправки = "<html><head>
                    |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
                    |<link rel=""stylesheet"" type=""text/css"" href=""v8help://service_book/service_style"">
                    |<base href=""v8config://f9cda539-6a0c-44c3-88ed-3d2447979e09/mdobject/id268c9cc5-e178-473e-872c-04891dbedd5c/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">
                    |</head>
                    |<body>
                    |<div>Организации, добавленные в группу, могут входить только в одну группу. <br>Помните, что помимо организаций в таблице, в группу входит и головная&nbsp;</div>
                    |<div>&nbsp;организация, добавляемая в поле “Головная организация”.</div>
                    |<div><br></div>
                    |<div>В списке показываются только те организации, которые еще не вошли в&nbsp;</div>
                    |<div>&nbsp;другие группы. Организации, помеченные на удаление, не отображаются.</div>
                    |<div><br></div>
                    |
                    |
                    |</body></html>";
	ОткрытьФорму("ОбщаяФорма.КСУ_Справка", новый Структура("ТекстСправки, Заголовок", ТекстСправки, "Состав группы"));
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеПредупреждения(дп) Экспорт
	Закрыть();
КонецПроцедуры
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	оргМ = ПолучитьДоступныеОрганизации(Объект.Ссылка);
	Если оргМ.Количество() = 0 и объект.Ссылка.Пустая() Тогда
		ОпОп = новый ОписаниеОповещения("ЗакрытиеПредупреждения", ЭтотОбъект);
		ПоказатьПредупреждение(,"Новую группу компаний сформировать невозможно. 
		|Нет организаций, свободных для формирования группы. 
		|Если у вас есть организации, не вошедшие в группы компаний, 
		|убедитесь в том, что они не помечены на удаление (такие 
		|организации игнорируются при формировании групп компаний).");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДочерниеОрганизацииПриАктивизацииСтроки(Элемент)
	тд = Элементы.ДочерниеОрганизации.ТекущиеДанные;
	Если тд = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	оргМ = ПолучитьДоступныеОрганизации(Объект.Ссылка);
	инд = оргМ.Найти(объект.ГоловнаяОрганизация);
	Если инд <> Неопределено тогда
		оргМ.удалить(инд);
	КонецЕсли;
	
	для каждого стр из объект.ДочерниеОрганизации цикл
		если стр<>тд тогда
			инд = оргМ.Найти(стр.Организация);
			Если инд <> Неопределено тогда
				оргМ.удалить(инд);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ДочерниеОрганизацииОрганизация.СписокВыбора.ЗагрузитьЗначения(оргМ);
КонецПроцедуры

&НаКлиенте
Процедура ГоловнаяОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	оргМ = ПолучитьДоступныеОрганизации(Объект.Ссылка);
	Если объект.ГоловнаяОрганизация.Пустая() = ложь и оргМ.Найти(объект.ГоловнаяОрганизация) = Неопределено тогда
		оргМ.Добавить(объект.ГоловнаяОрганизация);
	КонецЕсли;
	для каждого стр из объект.ДочерниеОрганизации цикл
		инд = оргМ.Найти(стр.Организация);
		Если инд <> Неопределено тогда
			оргМ.удалить(инд);
		КонецЕсли;
	КонецЦикла;
	Элементы.ГоловнаяОрганизация.СписокВыбора.ЗагрузитьЗначения(оргМ);
КонецПроцедуры
