
&НаКлиенте
Процедура НеОдобреноПредседателемИСПриИзменении(Элемент)
    Если Объект.НеОдобреноПредседателемИС Тогда
        Объект.ОдобреноПредседателемИС = Ложь;
        Пользователь = ИА_БФС.ТекущийПользователь();
        Если ИА_БФКС.РеквизитЕсть(Пользователь,"ФизЛицо") Тогда
            Объект.ОдобрилОтклонил = Пользователь.ФизЛицо;
        КонецЕсли;
        Иначе Объект.ОдобрилОтклонил = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОдобреноПредседателемИСПриИзменении(Элемент)
    Если Объект.ОдобреноПредседателемИС Тогда
        Объект.НеОдобреноПредседателемИС = Ложь;
        Пользователь = ИА_БФС.ТекущийПользователь();
        Если ИА_БФКС.РеквизитЕсть(Пользователь,"ФизЛицо") Тогда
            Объект.ОдобрилОтклонил = Пользователь.ФизЛицо;
        КонецЕсли;
        Иначе Объект.ОдобрилОтклонил = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Сообщить("Протоколы РС запрещено копировать");
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	ПостРекСовет = Константы.ИА_ПостРекСовет.Получить();
	
	Если Объект.Ссылка.Пустая() и Объект.БоевойПлан.Количество() = 0 Тогда
		НачальноеЗаполнение();
	Иначе
		УстановитьДатуНачала();
	КонецЕсли;
	
	ЗаполнитьБоевойПланПредыдущий();
	
	СоздатьЭлементыПрисутствуют();
	
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
	
	СокрВид = Константы.КСУ_СокращенныйВидПлана.Получить();
	ВидГруппировки = константы.КСУ_ГруппировкаЗадачПлана.Получить();

	Если СокрВид Тогда
		Элементы.ДеревоПланаПродукт.Видимость = ложь;
		Элементы.ДеревоПланаСрокИсполнения.Видимость = ложь;
		Элементы.ДеревоПланаВремяФакт.Видимость = ложь;
		Элементы.ДеревоПланаСодержание.Заголовок = "Задача";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыПрисутствуют()
	УдРекв = новый массив;
	для сч = 0 по 20 Цикл
		попытка 
			з = ЭтаФорма["ПрисутствРук_"+сч];
			УдРекв.Добавить("ПрисутствРук_"+сч);
			Элементы.Удалить(элементы["ПрисутствРукЭл_"+сч]);
		Исключение
			Прервать;
		КонецПопытки;
	КонецЦикла;
	ИзменитьРеквизиты(,УдРекв);
	
	ТекНомер = 0;	
	Для каждого стр из объект.ПрисутствиеРуководителей Цикл
		// реквизит
		ИмяРеквЭл = "ПрисутствРук_"+ТекНомер;
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквЭл, Новый ОписаниеТипов("Булево")));
		ИзменитьРеквизиты(МассивРеквизитов);
		ЭтаФорма[ИмяРеквЭл]= стр.Присутствует;
		
		// элементы
		НовыйЭлементКоммент = Элементы.Добавить("ПрисутствРукЭл_"+ТекНомер, Тип("ПолеФормы"), Элементы.ГруппаПрисутствие);
		НовыйЭлементКоммент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлементКоммент.путьКДанным = ИмяРеквЭл;
		НовыйЭлементКоммент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		НовыйЭлементКоммент.Заголовок = стр.Отделение.КраткоеНаименование;
		//
		ТекНомер = ТекНомер + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуНачала()
	Если Объект.БоевойПлан.Количество()> 0 И ЗначениеЗаполнено(Объект.БоевойПлан[0].План) Тогда
		ДатаНачала = НачалоДня(Объект.БоевойПлан[0].План.ДатаНачала);	
	Иначе
		ДатаНачала = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеСтатистики(ВидСтатистики, ДатаНачала)
	
	ДатаНач = НачалоДня(ДатаНачала) - 60*60*24*7;
	ДатаКон = НачалоДня(ДатаНачала) - 1;
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("ДатаНачала");
	Данные.Колонки.Добавить("ДатаКонца");
	Новстр = Данные.Добавить();
	Новстр.ДатаНачала = ДатаНач;
	Новстр.ДатаКонца = ДатаКон;
	СтрокаСтатистик = Новый Структура("ВидСтатистики,Аналитика1,Аналитика2,Аналитика3,Данные",ВидСтатистики, Неопределено, Неопределено, Неопределено,Данные);
	
	ТЗ = ИА_Защита_Статистика.ПолучитьТЗДанныеСтатистики(СтрокаСтатистик,ДатаНач,ДатаКон);
	
	возврат тз.Итог("Количество");	
КонецФункции

&НаСервере
Функция ПолучитьПланОтделения(пОтделение, ДоДаты = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_ПланыДействий.Ссылка
	               |ИЗ
	               |	Справочник.ИА_ПланыДействий КАК ИА_ПланыДействий
	               |ГДЕ
	               |	ИА_ПланыДействий.Пост = &Пост
	               |	И ИА_ПланыДействий.ПометкаУдаления = ЛОЖЬ
	               |	И ИА_ПланыДействий.Родитель = &Родитель
	               |	И (ИА_ПланыДействий.ДатаНачала >= &ДатаНачала
	               |			ИЛИ &ДоДаты <> НЕОПРЕДЕЛЕНО)
	               |	И (ИА_ПланыДействий.ДатаНачала < &ДоДаты
	               |			ИЛИ &ДоДаты = НЕОПРЕДЕЛЕНО)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ПланыДействий.ДатаНачала УБЫВ";
	Запрос.УстановитьПараметр("Пост", пОтделение);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.Дата - 60*60*24*5);
	Запрос.УстановитьПараметр("ДоДаты", ДоДаты);
	Запрос.УстановитьПараметр("Родитель", Справочники.ИА_ПланыДействий.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ИА_ПланыДействий.ПустаяСсылка();
	КонецЕсли;
КонецФункции	
	
&НаСервере
Процедура НачальноеЗаполнение()
	СтатистикиПоОтделам = Константы.ИА_ПротоколРССтатистикиПоОтделам.Получить();
	ПланыПоОтделам = Константы.ИА_ПротоколРСПланыПоОтделам.Получить();
	
	Объект.Дата = ТекущаяДата();
	
	Если ПостРекСовет.Пустая() ТОгда
		Сообщить("Заполните константу Пост Рекомендательный совет!");
	Иначе
		// председатель
		Если ПостРекСовет.Сотрудники.Количество()>0 Тогда
			Объект.Председатель = ПостРекСовет.Сотрудники[0].ФизЛицо;
		КонецЕсли;
		
		//статистика
		Если ПостРекСовет.НастройкаСтатистик.Статистики.Количество()>0 Тогда
			Объект.СтатистикаРС = ПостРекСовет.НастройкаСтатистик.Статистики[0].ВидСтатистики;
		КонецЕсли;
	КонецЕсли;
	
	// отделения, боевые планы
	организация = объект.Организация;
	
	Если Организация.Пустая() Тогда
		организация = ПостРекСовет; 
		Пока не организация.Родитель.Пустая() Цикл
			организация = организация.Родитель;
		КонецЦикла;
	КонецЕсли;
	
	Объект.ПрисутствиеРуководителей.Очистить();
	Объект.БоевойПлан.Очистить();
	Объект.ГлавныеСтатистики.Очистить();
	Если Организация.Пустая() Тогда
		Возврат;
	Иначе
		объект.Организация = организация; 
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |ГДЕ
	               |	ОргСхема.Ссылка В ИЕРАРХИИ(&организация)
	               |	И ОргСхема.ТипТерминала = &Отдел
	               |	И ОргСхема.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОргСхема.Родитель.ПорядокВСхеме,
	               |	ОргСхема.ПорядокВСхеме";
	Запрос.УстановитьПараметр("организация", организация);
	Запрос.УстановитьПараметр("Отдел", Перечисления.ТипТерминалаОргСхемы.Отдел);
	
	массивОтделов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	// список руководителей
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |ГДЕ
	               |	ОргСхема.Ссылка В ИЕРАРХИИ(&организация)
	               |	И ОргСхема.ТипТерминала = &Отделение
	               |	И ОргСхема.ПометкаУдаления = ЛОЖЬ
	               |	И ОргСхема.Родитель.ТипТерминала <> &Учредитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОргСхема.ПорядокВСхеме";
	Запрос.УстановитьПараметр("организация", организация);
	Запрос.УстановитьПараметр("Отделение", Перечисления.ТипТерминалаОргСхемы.Департамент);
	Запрос.УстановитьПараметр("Учредитель", Перечисления.ТипТерминалаОргСхемы.Учредитель);
	
	массивОтделений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Для каждого стрОтд из массивОтделений Цикл
		Новстр = Объект.ПрисутствиеРуководителей.Добавить();
		Новстр.Отделение = стрОтд;
	КонецЦикла;	
	
	//БП
	ИсточникПланов = ?(ПланыПоОтделам, массивОтделов, массивОтделений);
	Для каждого стрОтд из ИсточникПланов Цикл
		Новстр = Объект.БоевойПлан.Добавить();
		Новстр.Отделение = стрОтд;
		план = ПолучитьПланОтделения(стрОтд);
		Новстр.План = план;		
	КонецЦикла;
	
	
	// статистики
	ИсточникПланов = ?(СтатистикиПоОтделам, массивОтделов, массивОтделений);
	Для каждого стрОтд из ИсточникПланов Цикл
		план = ПолучитьПланОтделения(стрОтд);
		
		//
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(0);
		ТЗСтат = стрОтд.НастройкаСтатистик.Статистики.Выгрузить();
		ТЗСтат.Свернуть("ВидСтатистики");
		
		Для каждого стрСтатистика из ТЗСтат Цикл
			Новстр = Объект.ГлавныеСтатистики.Добавить();
			Новстр.Отделение = стрОтд;
			Новстр.ВидСтатистики = стрСтатистика.ВидСтатистики;
			
			Если ЗначениеЗаполнено(план) Тогда
				стрПлан = план.План.Найти(стрСтатистика.ВидСтатистики);
				Если ЗначениеЗаполнено(стрПлан) Тогда
					Новстр.ТекущееЗначениеСтатистики = стрПлан.ТекущееЗначениеСтатистики;			
					Новстр.Квота = стрПлан.КвотаПлан;
				КонецЕсли;
			КонецЕсли;
			Прервать;//будет только первый элемент
		КонецЦикла;
		
		Если ТЗСтат.Количество() = 0 Тогда
			Новстр = Объект.ГлавныеСтатистики.Добавить();
			Новстр.Отделение = стрОтд;
		КонецЕсли;
	КонецЦикла;
	
	// пред план организации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ПротоколРС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ИА_ПротоколРС КАК ИА_ПротоколРС
	               |ГДЕ
	               |	ИА_ПротоколРС.Проведен
	               |	И ИА_ПротоколРС.Дата < &Дата
	               |	И ИА_ПротоколРС.Организация = &Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ПротоколРС.Дата УБЫВ";
	Запрос.УстановитьПараметр("Дата", ?(объект.Дата=дата(1,1,1), ТекущаяДата(), объект.Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() Тогда
		Объект.ПредыдущийПротокол = Выборка.Ссылка;
		объект.БоевойПланОрганизацииПредыдущий.Загрузить(Выборка.Ссылка.БоевойПланОрганизации.Выгрузить());
		
		// статистики
		предКвоты = Выборка.Ссылка.ГлавныеСтатистики.Выгрузить();
		Для каждого стрПредКв из предКвоты Цикл
			СтруктПоиска = Новый Структура("Отделение,ВидСтатистики",стрПредКв.Отделение,стрПредКв.ВидСтатистики);
			НСтр = Объект.ГлавныеСтатистики.НайтиСтроки(СтруктПоиска);
			Для каждого стрТекСт из НСтр Цикл
				стрТекСт.ПредыдущаяКвота =  стрПредКв.Квота;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	
	Если ЗначениеЗаполнено(Объект.СтатистикаРС) Тогда
		УстановитьДатуНачала();

		Объект.ЗначениеСтатистики = ПолучитьЗначениеСтатистики(Объект.СтатистикаРС, ДатаНачала);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтогиПоШагам()
	ВремяИтого = Дата(1,1,1);
	ВремяИтогоФакт = Дата(1,1,1);
	Для каждого стр из ДеревоПлана.ПолучитьЭлементы() Цикл  // шаги, типы		
		Итог11 = Дата(1,1,1);
		Итог11Ф = Дата(1,1,1);
		Для каждого стр1 из стр.ПолучитьЭлементы() Цикл // задачи
			ВремяИтого = СложитьВремя(ВремяИтого , стр1.ВремяПлан);  
			ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр1.ВремяФакт);  
			
			Итог11 = СложитьВремя(Итог11 , стр1.ВремяПлан);
			Итог11Ф = СложитьВремя(Итог11Ф , стр1.ВремяФакт);
		КонецЦикла;
		стр.ВремяПлан = ФорматИтога(Итог11);
		стр.ВремяФакт = ФорматИтога(Итог11Ф);
	КонецЦикла;
	
	время = ФорматИтога(ВремяИтого);
	ВремяФакт = ФорматИтога(ВремяИтогоФакт);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ФорматИтога(д1)
	
	Если д1 = дата(1,1,1) Тогда
		возврат "";
	КонецЕсли;
	
	КолЧасов = (День(д1)-1)*24 + Час(д1);
	возврат формат(КолЧасов,"ЧЦ=2; ЧН=; ЧВН=")+":"+формат(Минута(д1),"ЧЦ=2; ЧН=; ЧВН=");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СложитьВремя(в1, в2)
	Если не ЗначениеЗаполнено(в2) Тогда
		возврат в1;
	КонецЕсли;
	
	возврат в1 + (в2 - Дата(1,1,1));
КонецФункции

&НаКлиенте
Процедура БоевойПланПриАктивизацииСтроки(Элемент)
	Если Элементы.БоевойПлан.ТекущаяСтрока = ПредИДСтрокиБП И Элемент <> Неопределено Тогда  // обход глюка 1с с повторным вызовом активизации строки
		возврат;
	КонецЕсли;
	
	тд = Элементы.БоевойПлан.ТекущиеДанные;
	ПредИДСтрокиБП = Элементы.БоевойПлан.ТекущаяСтрока;
	
	ДеревоПлана.ПолучитьЭлементы().Очистить();
	Если тд<>Неопределено и ЗначениеЗаполнено(тд.Отделение) и ЗначениеЗаполнено(тд.План) Тогда
		ЗагрузитьПлан(тд.План, тд.Отделение);
	КонецЕсли;
	
	ОбновитьИтогиПоШагам();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПлан(План, пост)
	ДерРез = РеквизитФормыВЗначение("ДеревоПлана");
	
	ИА_Защита_БП.ПолучитьДеревоПлана(ДерРез, План, План.Состояние,,пост);
			
	ЗначениеВРеквизитФормы(ДерРез, "ДеревоПлана");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПредИДСтрокиБП = 10000;
	ПредИДСтрокиБП1 = 10000;
	
	Если Объект.Дата = Дата(1,1,1) Тогда
		ДневникПериодС =  ТекущаяДата() - 60*60*24*14;
	Иначе
		ДневникПериодС =  Объект.Дата - 60*60*24*14;
	КонецЕсли;
	ОбновитьДневник(Неопределено);
	ОбновитьНадписьПрикрОбъекта();
КонецПроцедуры


&НаКлиенте
Процедура ПечатьПротокола(Команда)
	ТабДок = ПечатьНовогоПротоколаНаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция ПечатьНовогоПротоколаНаСервере()
	
	
	ТабДок = Новый ТабличныйДокумент;	
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетНовый");

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Объект);
	ТабДок.Вывести(ОбластьМакета);
	
	первый = истина;
    Для Каждого Стр Из Объект.ПрисутствиеРуководителей Цикл    
                
        ОбластьМакета = Макет.ПолучитьОбласть("Область2|Область1");
        ОбластьМакета.Параметры.Присутствует = Стр.Присутствует;
        ОбластьМакета.Параметры.Отделение = Стр.Отделение.КраткоеНаименование;
        
		Если первый Тогда
			ТабДок.Вывести(ОбластьМакета);                     
        Иначе 
           	ТабДок.Присоединить(ОбластьМакета); 
        КонецЕсли;  
		
		первый = ложь;
    КонецЦикла;
    
    ОбластьМакета = Макет.ПолучитьОбласть("Блок1");
	ОбластьМакета.Параметры.Заполнить(Объект);
	ТабДок.Вывести(ОбластьМакета);
        
	ОбластьМакета = Макет.ПолучитьОбласть("Блок2Шапка");
	ОбластьМакета.Параметры.Заполнить(Объект);
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Блок2Строка");
	Для Каждого Стр Из Объект.ГлавныеСтатистики Цикл
		ОбластьМакета.Параметры.Заполнить(Стр);
		ОбластьМакета.Параметры.Отделение = Стр.Отделение.Наименование;
		ТабДок.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Блок2Подвал");
	ТабДок.Вывести(ОбластьМакета);
		
	ОбластьМакета = Макет.ПолучитьОбласть("Блок3Шапка");
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Блок3Строка");
	Для Каждого Стр Из Объект.ЗапланированныеЗадачиСУ Цикл
		ОбластьМакета.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьМакета);
	КонецЦикла;
		
	ОбластьМакета = Макет.ПолучитьОбласть("Блок4Шапка");
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Блок4Строка");
	Для Каждого Стр Из Объект.ЗадачиПоТактическимПланам Цикл
		ОбластьМакета.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьМакета);
	КонецЦикла;
		
	ОбластьМакета = Макет.ПолучитьОбласть("Блок5Шапка");
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Блок5Строка");
	ТЗЗадачиБП = ВернутьПредставлениеБП();
	Для Каждого Стр Из ТЗЗадачиБП Цикл
		ОбластьМакета.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Блок6");
	ОбластьМакета.Параметры.Заполнить(Объект);
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Блок7");
	ОбластьМакета.Параметры.Заполнить(Объект);
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Блок8");
    ПоощренияИНаказания = ?(ЗначениеЗаполнено(Объект.Поощряем), Объект.Поощряем,"");
	ОбластьМакета.Параметры.ПоощренияИНаказания = ПоощренияИНаказания;
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Блок9");
	ОбластьМакета.Параметры.Заполнить(Объект);
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Блок10");
	ОбластьМакета.Параметры.Заполнить(Объект);
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Блок11");
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
    ОбластьМакета.Параметры.Председатель = Объект.Председатель;
    Если Объект.ОдобреноПредседателемИС Тогда
        ОбластьМакета.Параметры.Одобрил = Объект.ОдобрилОтклонил;
        ОбластьМакета.Параметры.НеОдобрил = "___________________";
    ИначеЕсли Объект.НеОдобреноПредседателемИС Тогда
        ОбластьМакета.Параметры.Одобрил = "___________________";
        ОбластьМакета.Параметры.НеОдобрил = Объект.ОдобрилОтклонил;    
    КонецЕсли; 
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Коррекция");
	ОбластьМакета.Параметры.Заполнить(Объект);
	ТабДок.Вывести(ОбластьМакета);
	
	ТабДок.ПолеСнизу = 10;
	
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;

	ТабДок.НижнийКолонтитул.НачальнаяСтраница = 1;
	ТабДок.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	ТабДок.НижнийКолонтитул.ТекстСлева = "";
	ТабДок.НижнийКолонтитул.ТекстСправа = "";
	ТабДок.НижнийКолонтитул.ТекстВЦентре = "";
	ТабДок.НижнийКолонтитул.ТекстСправа = "- [&НомерСтраницы] из [&СтраницВсего] -";
	ТабДок.НижнийКолонтитул.Выводить = Истина;
	
	Возврат ТабДок;
		
КонецФункции

&НаСервере
Функция ВернутьПредставлениеБП()
	
	тзПредПланы = РеквизитФормыВЗначение("БоевойПланПредыдущий");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тзПредПланы.Отделение,
	|	тзПредПланы.План
	|ПОМЕСТИТЬ тзПредПланы
	|ИЗ
	|	&ТЗПред КАК тзПредПланы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзТекПланы.Отделение,
	|	тзТекПланы.План
	|ПОМЕСТИТЬ тзТекПланы
	|ИЗ
	|	&ТЗТек КАК тзТекПланы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзТекПланы.Отделение КАК ОтдСсылка,
	|	тзТекПланы.План КАК ТекПлан,
	|	тзПредПланы.План КАК ПредПлан
	|ИЗ
	|	тзТекПланы КАК тзТекПланы
	|		ЛЕВОЕ СОЕДИНЕНИЕ тзПредПланы КАК тзПредПланы
	|		ПО тзТекПланы.Отделение = тзПредПланы.Отделение";
	
	Запрос.УстановитьПараметр("ТЗПред", тзПредПланы);
	Запрос.УстановитьПараметр("ТЗТек", Объект.БоевойПлан.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();	
	ТЗБП = Новый ТаблицаЗначений;
	ТЗБП.Колонки.Добавить("Отделение");
	ТЗБП.Колонки.Добавить("ПланПрошлый");
	ТЗБП.Колонки.Добавить("План");
	
	Пока Выборка.Следующий() Цикл
		Новстр = ТЗБП.Добавить();		
		Новстр.Отделение = Выборка.ОтдСсылка.наименование;
		Если ЗначениеЗаполнено(Выборка.ПредПлан) Тогда
			Новстр.ПланПрошлый = ВернутьЗадачиБП(Выборка.ПредПлан,Истина);
		КонецЕсли;
		Новстр.План = ВернутьЗадачиБП(Выборка.ТекПлан,Ложь);
	КонецЦикла;
	
	Возврат ТЗБП;
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьЗадачиБП(ПланСсылка, ВыгружатьТолькоВыполненные);
	ЗадачиБП = "";
	Шаги = Справочники.ИА_ЗадачиПлана.Выбрать(,ПланСсылка);
	
	Пока Шаги.Следующий() Цикл
		Если не шаги.ПометкаУдаления Тогда
			Если Шаги.Выполнено ИЛИ не ВыгружатьТолькоВыполненные Тогда
				ЗадачиБП = ЗадачиБП + Шаги.Содержание + "; ";
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	Возврат ЗадачиБП;
КонецФункции	

&НаКлиенте
Процедура БоевойПланПланПриИзменении(Элемент)
	тд = Элементы.БоевойПлан.ТекущиеДанные;

	Если тд<>Неопределено и ЗначениеЗаполнено(тд.Отделение) и ЗначениеЗаполнено(тд.План) Тогда
		ЗагрузитьПлан(тд.План, тд.Отделение);
	Иначе
		ДеревоПлана.ПолучитьЭлементы().Очистить();
	КонецЕсли;
	
	ОбновитьИтогиПоШагам();
КонецПроцедуры

&НаСервере
Процедура ОбновитьБПНаСервере()
	Объект.Дата = ТекущаяДата();
	
	// отделения, боевые планы
	организация = ПостРекСовет; 
	Пока не организация.Родитель.Пустая() Цикл
		организация = организация.Родитель;
	КонецЦикла;	
	
	// список руководителей
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |ГДЕ
	               |	ОргСхема.Ссылка В ИЕРАРХИИ(&организация)
	               |	И ОргСхема.ТипТерминала = &Отделение
	               |	И ОргСхема.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОргСхема.ПорядокВСхеме";
	Запрос.УстановитьПараметр("организация", организация);
	Запрос.УстановитьПараметр("Отделение", Перечисления.ТипТерминалаОргСхемы.Департамент);
	
	массивОтделений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Объект.БоевойПлан.Очистить();
	Для каждого стрОтд из массивОтделений Цикл
		план = ПолучитьПланОтделения(стрОтд);
		Новстр = Объект.БоевойПлан.Добавить();
		Новстр.Отделение = стрОтд;
		Новстр.План = план;		
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьБП(Команда)
	ОбновитьБПНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БоевойПланОтделениеПриИзменении(Элемент)
	тд = Элементы.БоевойПлан.ТекущиеДанные;
	
	план = ПолучитьПланОтделения(тд.Отделение);
	тд.План = план;	
КонецПроцедуры

&НаКлиенте
Процедура ШагиПланаВремяПриИзменении(Элемент)
	ОбновитьИтогиПоШагам();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьБП(Команда)
	Если Элементы.ГруппаНедели.ТекущаяСтраница = Элементы.ГруппаТекНеделя Тогда
		тд = Элементы.БоевойПлан.ТекущиеДанные;
	Иначе
		тд = Элементы.БоевойПланПредыдущий.ТекущиеДанные;
	КонецЕсли;
	
	Если тд<>Неопределено и ЗначениеЗаполнено(тд.План) Тогда
		ПоказатьЗначение(,тд.План);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонецРедактированияПлана(пПлан)
	тд = Элементы.БоевойПлан.ТекущиеДанные;
	Если тд<>Неопределено и тд.План = пПлан Тогда
		ЗагрузитьПлан(тд.План, тд.Отделение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИА_ПланыДействий_Запись" Тогда 
		КонецРедактированияПлана(Параметр);
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаполнитьПредыдущиеЗадачи(ПредыдущиеЗадачи, ТекущиеЗадачи)
	
	тз = ТекущиеЗадачи.Выгрузить();
	Для Каждого Стр Из ПредыдущиеЗадачи Цикл
		Если тз.Найти(Стр.Задача) = Неопределено Тогда 
			НовСтр = тз.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
		КонецЕсли;
	КонецЦикла;
	ТекущиеЗадачи.Загрузить(тз);
	
КонецПроцедуры	
	
&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	сч =0 ;
	Для каждого стр из Объект.ПрисутствиеРуководителей Цикл
		стр.Присутствует = ЭтаФорма["ПрисутствРук_"+сч];
		сч = сч + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//перенестиДеревоВОбъект(ТекущийОбъект);
	//перенестиДеревоПредПланВОбъект(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ШагиПередУдалением(Элемент, Отказ)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ШагФормулы) И Элемент.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Сообщить("Нельзя удалять шаги формулы состояния!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗадачуБезФормулы(Команда)
	//Новстр = БП_Организации.ПолучитьЭлементы().Добавить();
	//Новстр.Содержание = "";
	//Элементы.БП_Организации.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте    
Функция ПроверитьВозможностьПереноса(ПереносимыйЭлемент, Знач НовыйРодитель) 
	
	Пока НЕ НовыйРодитель = Неопределено Цикл 
		Если ПереносимыйЭлемент = НовыйРодитель Тогда 
			Возврат Ложь; 
		КонецЕсли; 
		НовыйРодитель = НовыйРодитель.ПолучитьРодителя(); 
	КонецЦикла; 

	Возврат Истина; 

КонецФункции


&НаКлиенте
Процедура СкрытьПоказатьПредыдущийПлан(Команда)
	
	//Если Элементы.БП_ОрганизацииПредыдущий.Видимость Тогда
	//	Элементы.БП_ОрганизацииСкрытьПоказатьПредыдущийПлан.Заголовок = "Показать предыдущий план"; 
	//	Элементы.БП_ОрганизацииПредыдущий.Видимость = Ложь;
	//Иначе
	//	Элементы.БП_ОрганизацииСкрытьПоказатьПредыдущийПлан.Заголовок = "Скрыть предыдущий план"; 
	//	Элементы.БП_ОрганизацииПредыдущий.Видимость = Истина;
	//	ЭтаФорма.ТекущийЭлемент = Элементы.БП_ОрганизацииПредыдущий; 
	//КонецЕсли;	 	
		
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьПредыдущиеЗадачи(Команда)
	
	//Если Элементы.ЗадачиНаНеделюПредыдущий.Видимость Тогда
	//	Элементы.СкрытьПоказатьПредыдущиеЗадачи.Заголовок = "Показать предыдущие задачи"; 
	//	Элементы.ЗадачиНаНеделюПредыдущий.Видимость = Ложь;
	//Иначе
	//	Элементы.СкрытьПоказатьПредыдущиеЗадачи.Заголовок = "Скрыть предыдущие задачи"; 
	//	Элементы.ЗадачиНаНеделюПредыдущий.Видимость = Истина;
	//	ЭтаФорма.ТекущийЭлемент = Элементы.ЗадачиНаНеделюПредыдущий; 
	//КонецЕсли;
	//Элементы.ЗадачиНаНеделюПредыдущий.Высота = 2;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаРСПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтатистикаРС) Тогда
		УстановитьДатуНачала();
		
		Объект.ЗначениеСтатистики = ПолучитьЗначениеСтатистики(Объект.СтатистикаРС, ДатаНачала);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуПоБоевомуПлану(БоевойПлан)

  Возврат НачалоДня(БоевойПлан.ДатаНачала); 

КонецФункции // ПолучитьДатуПоБоевомуПлану()


&НаКлиенте
Процедура ПеренестиНевыполненные(Команда)
	//Для каждого стр из БП_ОрганизацииПредыдущий.ПолучитьЭлементы() Цикл
	//	Если стр.УО = 0 и не стр.Выполнено Тогда
	//		Новстр = БП_Организации.ПолучитьЭлементы().Добавить();
	//		ЗаполнитьЗначенияСвойств(Новстр, стр);
	//	КонецЕсли;
	//	
	//	Для каждого стр1 из стр.ПолучитьЭлементы() Цикл
	//		Если (не стр1.Выполнено) или стр.ШагФормулы = ПредопределенноеЗначение("Перечисление.ИА_ТипыЗадачБП.Регулярные") Тогда
	//			найдСтрока = Неопределено;
	//			Для каждого стрТипЗадачи из БП_Организации.ПолучитьЭлементы() Цикл
	//				Если стрТипЗадачи.Содержание = стр.ШагФормулы Тогда
	//					найдСтрока = стрТипЗадачи;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			
	//			Если найдСтрока <> Неопределено Тогда
	//				Новстр = найдСтрока.ПолучитьЭлементы().Добавить();
	//				ЗаполнитьЗначенияСвойств(Новстр, стр1);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкуСтатистикРС()
	Возврат Константы.ИА_ПостРекСовет.Получить().НастройкаСтатистик;
КонецФункции

&НаКлиенте
Процедура ПоказатьСтатистику(Команда)	
	
	настр = ПолучитьНастройкуСтатистикРС();
	
	Если ЗначениеЗаполнено(настр) Тогда
		ф = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма.Форма");
		ф.Объект.Настройка = настр;
		
		ф.Объект.ДатаКонца = ДатаНачала-1;
		ф.Объект.ДатаНачала = ДатаНачала - 60*60*24*7*6; // 6 недель назад
				
		ф.Открыть();
		ф.ЗагрузитьНастройкуБезПериодов();
	Иначе
		Сообщить("У поста РС не указана настройка статистик!");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиЗадачиСтратегии(Команда)
	//Для каждого стр из Объект.ЗадачиНаНеделюПредыдущий Цикл		
	//	Если не стр.Выполнено Тогда
	//		Новстр = Объект.ЗадачиНаНеделю.Добавить();
	//		ЗаполнитьЗначенияСвойств(Новстр, стр);
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьПредБП(Команда)
	//Для каждого стр из БП_ОрганизацииПредыдущий.ПолучитьЭлементы() Цикл
	//	Элементы.БП_ОрганизацииПредыдущий.Развернуть(стр.ПолучитьИдентификатор());
	//КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьБП(Команда)
	//Для каждого стр из БП_Организации.ПолучитьЭлементы() Цикл
	//	Элементы.БП_Организации.Развернуть(стр.ПолучитьИдентификатор());
	//КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьБППоста(Команда)
	Для каждого стр из ДеревоПлана.ПолучитьЭлементы() Цикл
		Элементы.ДеревоПлана.Развернуть(стр.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

//// ДНЕВНИК

&НаКлиенте
Процедура ПоказатьСкрытьДневник(Команда)
	Элементы.ГруппаДневник.Видимость = не Элементы.ГруппаДневник.Видимость;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДневник(Команда)
	//ОбновитьДневникСервер();
	//обновитьНовыеСостояния();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДневникСервер()
	//тз = ИА_Планы.ПолучитьДневникСервер(ДневникПериодС, КонецДня(Объект.Дата), ПостРекСовет);
	//ЗначениеВРеквизитФормы(тз ,"Дневник");
КонецПроцедуры


&НаКлиенте
Процедура ДневникПериодСПриИзменении(Элемент)
	ОбновитьДневник(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонцаПриИзменении(Элемент)
	ОбновитьДневник(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДневникПриИзменении(Элемент)
	//тд = Элементы.Дневник.ТекущиеДанные;
	//
	//Если тд<>Неопределено Тогда 
	//	стрДн = Новый Структура("Период,ИД,Пост,Наклон,Состояние,Шаг,Задача,Выполнено,ДатаВыполнения");
	//	ЗаполнитьЗначенияСвойств(стрДн, тд);
	//	ИА_Планы.СохранитьИзмененияДневника(стрДн);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДневникПередУдалением(Элемент, Отказ)
	//Если Вопрос("Вы уверены?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда 
	//	Отказ=Истина;
	//	Возврат;
	//КонецЕсли;
	//
	//тд = Элементы.Дневник.ТекущиеДанные;
	//
	//Если тд<>Неопределено Тогда 
	//	ИА_Планы.УдалитьСтрокуДневника(тд.ИД);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДневник(Команда)
	//ДобавитьСтрокуВДневникКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДневникКлиент(Задача = "")
	//Если ПостРекСовет.Пустая() Тогда
	//	Сообщить("Укажите пост рекомендательного совета в настройках КСУ!");
	//	Возврат;
	//КонецЕсли;
	//	
	//новстр = Дневник.Добавить();
	//новстр.ИД = новый УникальныйИдентификатор;
	//новстр.Период = ТекущаяДата();
	//новстр.пост = ПостРекСовет;
	//новстр.Задача =  Задача;
	//
	//Если Дневник.Количество()>1 Тогда
	//	ПредСтрока = Дневник[Дневник.Количество()-2];
	//	новстр.Шаг = ПредСтрока.Шаг;
	//	новстр.Состояние = ПредСтрока.Состояние;
	//КонецЕсли;
	//
	//Элементы.Дневник.ТекущаяСтрока = новстр.ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура обновитьНовыеСостояния()
	//ПредСост = Неопределено;
	//Для каждого стр из Дневник Цикл
	//	Стр.НовоеСостояние = стр.Состояние <> ПредСост и ПредСост<>Неопределено;
	//	ПредСост = стр.Состояние;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДневникПослеУдаления(Элемент)
	//обновитьНовыеСостояния();
КонецПроцедуры

&НаКлиенте
Процедура ДневникПриАктивизацииПоля(Элемент)
	//тд = Элементы.Дневник.ТекущиеДанные;
	//Если тд<>Неопределено Тогда
	//	массивШагов = ИА_Планы.ПолучитьШагиСостояния(тд.Состояние); 
	//	Элемент.ПодчиненныеЭлементы.ДневникШаг.СписокВыбора.ЗагрузитьЗначения(массивШагов);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИЦО(Команда)
	Ф = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма.Форма",,,истина); 
	Ф.Открыть();
	Ф.Объект.Настройка = ПредопределенноеЗначение("Справочник.ИА_НастройкиРабочегоСтолаСтатистик.СтатистикиРС");
	Ф.НастройкаПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗадачиПоТактическимПланам()
	
	Объект.ЗадачиПоТактическимПланам.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ПротоколРС.Ссылка
		|ИЗ
		|	Документ.ИА_ПротоколРС КАК ИА_ПротоколРС
		|ГДЕ
		|	ИА_ПротоколРС.Проведен
		|	И ИА_ПротоколРС.Дата < &ДатаДок
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИА_ПротоколРС.Дата УБЫВ";
		
		ДатаДок = ?(ЗначениеЗаполнено(Объект.Ссылка),Объект.Дата, ТекущаяДата());
		Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ПрошлыйПротокол = Неопределено;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПрошлыйПротокол = ВыборкаДетальныеЗаписи.Ссылка;
		Прервать;
	КонецЦикла;
	Для Каждого Стр Из ПрошлыйПротокол.ЗадачиПоТактическимПланам Цикл
		Если Стр.Выполнено И Не ЗначениеЗаполнено(СокрЛП(Стр.ЗадачиНаПредстоящуюНеделю)) Тогда
			Продолжить;
		ИначеЕсли Стр.Выполнено Тогда
			Новстр = Объект.ЗадачиПоТактическимПланам.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр,Стр);
			Новстр.ЗадачиЗаПрошлуюНеделю = Стр.ЗадачиНаПредстоящуюНеделю;
			Новстр.Выполнено = Ложь;
		Иначе
			Новстр = Объект.ЗадачиПоТактическимПланам.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр,Стр);
			Новстр.ЗадачиЗаПрошлуюНеделю = ?(ЗначениеЗаполнено(СокрЛП(Стр.ЗадачиЗаПрошлуюНеделю)),СокрЛП(Стр.ЗадачиЗаПрошлуюНеделю) + ". ","") + Стр.ЗадачиНаПредстоящуюНеделю;
		КонецЕсли;
		Новстр.ЗадачиНаПредстоящуюНеделю = "";
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьБоевойПланПредыдущий()
	
	БоевойПланПредыдущий.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ПротоколРС.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИА_ПротоколРС КАК ИА_ПротоколРС
	|ГДЕ
	|	ИА_ПротоколРС.Проведен
	|	И ИА_ПротоколРС.Дата < &ДатаДок
	|	И ИА_ПротоколРС.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИА_ПротоколРС.Дата УБЫВ";
	
	ДатаДок = ?(ЗначениеЗаполнено(Объект.Ссылка),Объект.Дата, ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
	Запрос.УстановитьПараметр("Организация", объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	БоевойПланПредыдущий.Очистить();
	Если Выборка.Следующий() Тогда
		ЗначениеВРеквизитФормы(Выборка.Ссылка.БоевойПлан.Выгрузить(,"Отделение,План"),"БоевойПланПредыдущий");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура БоевойПланПредыдущийПриАктивизацииСтроки(Элемент)
	Если Элементы.БоевойПланПредыдущий.ТекущаяСтрока = ПредИДСтрокиБП1 И Элемент <> Неопределено Тогда  // обход глюка 1с с повторным вызовом активизации строки
		возврат;
	КонецЕсли;
	
	тд = Элементы.БоевойПланПредыдущий.ТекущиеДанные;
	ПредИДСтрокиБП1 = Элементы.БоевойПланПредыдущий.ТекущаяСтрока;
	
	ДеревоПлана.ПолучитьЭлементы().Очистить();
	Если тд<>Неопределено и ЗначениеЗаполнено(тд.Отделение) и ЗначениеЗаполнено(тд.План) Тогда
		ЗагрузитьПлан(тд.План, тд.Отделение);
	КонецЕсли;
	
	ОбновитьИтогиПоШагам();
КонецПроцедуры


&НаКлиенте
Процедура Группа2ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.ГруппаТекНеделя Тогда
		БоевойПланПриАктивизацииСтроки(Неопределено);
	Иначе
		БоевойПланПредыдущийПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьСтратегЗадачу(Команда)
	Новстр = Объект.ЗапланированныеЗадачиСУ.Добавить();
	Новстр.Ответственный = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	Новстр.НазваниеПрограммы = ПредопределенноеЗначение("Справочник.ИА_СтратегическоеУправление.ПустаяСсылка");
	Новстр.НомераВыполненныхЗадач = ПредопределенноеЗначение("Справочник.ИА_СтратегическоеУправление.ПустаяСсылка");
	Новстр.НомераПредстоящихЗадач = ПредопределенноеЗначение("Справочник.ИА_СтратегическоеУправление.ПустаяСсылка");
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьФайл(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ДобавитьФайлЗавершение1", ЭтотОбъект), ,, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлЗавершение1(Результат, Адрес, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
	Модифицированность = истина;
	
	ф = новый Файл(ВыбранноеИмя);
	ПоместитьФайлОбъектаОкончание(Адрес,ф.Имя);
КонецПроцедуры

&НаСервере
Процедура ПоместитьФайлОбъектаОкончание(АдресВременногоХранилища, ВыбранноеИмя)
	
	КаталогФайлов = ПолучитьПутьКФайлам(объект.Номер);	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	КаталогХранения = КаталогФайлов + ВыбранноеИмя;
	ДвоичныеДанные.Записать(КаталогХранения);
	
	НоваяСтрока = Объект.Файлы.Добавить();	
	НоваяСтрока.Имя = ВыбранноеИмя;
	НоваяСтрока.Дата = ТекущаяДата();
	
КонецПроцедуры



&НаКлиенте
Процедура ОткрытьФайл(Команда)
	имяФайла = Элементы.Файлы.ТекущиеДанные.Имя;
	АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(имяФайла);
	Если ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		врИмяФайла = КаталогВременныхФайлов() + имяФайла;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		ДвоичныеДанные.Записать(врИмяФайла);
		ЗапуститьПриложение(врИмяФайла);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПоместитьТекущийФайлВБуфер(ВыбранноеИмя)
	
	КаталогФайлов = ПолучитьПутьКФайлам(объект.Номер);	
	КаталогХранения = КаталогФайлов + ВыбранноеИмя;
	ФайлДляПередачи = Новый ДвоичныеДанные(КаталогХранения);
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ФайлДляПередачи, УникальныйИдентификатор);
	
	Возврат АдресВременногоХранилища;
	
КонецФункции


&НаКлиенте
Процедура СохранитьФайл(Команда)
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Элементы.Файлы.ТекущиеДанные.Имя;
	ДиалогОткрытияФайла.Заголовок = "Сохранение файла";
	Расширение = Сред(Элементы.Файлы.ТекущиеДанные.Имя,Найти(Элементы.Файлы.ТекущиеДанные.Имя, ".")+1);
	Фильтр = "(*."+ Расширение +")|*."+Расширение+"";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Расширение = Расширение;	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		ВыбранныйКаталог = Новый Файл(ДиалогОткрытияФайла.Каталог);
		
		АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(Элементы.Файлы.ТекущиеДанные.Имя);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		
		Попытка
			ДвоичныеДанные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПутьКФайлам(номер)
	Возврат Константы.ИА_КаталогХраненияФайлов.Получить()+"RS\"+номер+"\";
КонецФункции

&НаКлиенте
Процедура ОчиститьПрикрепленныйОбъект(Команда)
	Объект.ПрикрепленныйОбъект = Неопределено;
	Модифицированность = Истина;
	ОбновитьНадписьПрикрОбъекта();
КонецПроцедуры

&НаКлиенте
процедура ОбновитьНадписьПрикрОбъекта()
	Если ЗначениеЗаполнено(Объект.ПрикрепленныйОбъект) ТОгда
		Элементы.ПрикрепленныйОбъект.Заголовок = Объект.ПрикрепленныйОбъект;
	Иначе
		Элементы.ПрикрепленныйОбъект.Заголовок = "Прикрепить элемент справочника, документ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленныйОбъектНажатие(Элемент)
	Если ЗначениеЗаполнено(Объект.ПрикрепленныйОбъект) Тогда   // просто откроем
		ПоказатьЗначение(,Объект.ПрикрепленныйОбъект);
	Иначе
		ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.Форма.ФормаВопросаПрикрепленногоОбъекта",,,,,, Новый ОписаниеОповещения("ПрикрепленныйОбъектНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленныйОбъектНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.ПрикрепленныйОбъект = Результат;
		ОбновитьНадписьПрикрОбъекта();
		Модифицированность = истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапланированныеЗадачиСУНомераВыполненныхЗадачПриИзменении(Элемент)
	тд = Элементы.ЗапланированныеЗадачиСУ.ТекущиеДанные;
	тд.ДатаВыполнения = получитьДатуЗавершения(тд.ВыполненнаяЗадача);
КонецПроцедуры

&НаСервереБезКонтекста
Функция получитьДатуЗавершения(задачаСу)
	возврат задачаСу.ДатаВыполнения;
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	НачальноеЗаполнение();
	ЗаполнитьБоевойПланПредыдущий();
	СоздатьЭлементыПрисутствуют();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатистикиНаСервере()
	Объект.ГлавныеСтатистики.Очистить();
	Для каждого стрОтд из Объект.БоевойПлан Цикл
		план = стрОтд.план;
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(0);
		ТЗСтат = стрОтд.Отделение.НастройкаСтатистик.Статистики.Выгрузить();
		ТЗСтат.Свернуть("ВидСтатистики");
		
		Для каждого стрСтатистика из ТЗСтат Цикл
			Новстр = Объект.ГлавныеСтатистики.Добавить();
			Новстр.Отделение = стрОтд.Отделение;
			Новстр.ВидСтатистики = стрСтатистика.ВидСтатистики;
			
			Если ЗначениеЗаполнено(план) Тогда
				стрПлан = план.План.Найти(стрСтатистика.ВидСтатистики);
				Если ЗначениеЗаполнено(стрПлан) Тогда
					Новстр.ТекущееЗначениеСтатистики = стрПлан.ТекущееЗначениеСтатистики;			
					Новстр.Квота = стрПлан.КвотаПлан;
				КонецЕсли;
			КонецЕсли;
			Прервать;//будет только первый элемент
		КонецЦикла;
		
		Если ТЗСтат.Количество() = 0 Тогда
			Новстр = Объект.ГлавныеСтатистики.Добавить();
			Новстр.Отделение = стрОтд;
		КонецЕсли;
	КонецЦикла;
	

	предКвоты = Объект.ПредыдущийПротокол.ГлавныеСтатистики.Выгрузить();
	Для каждого стрПредКв из предКвоты Цикл
		СтруктПоиска = Новый Структура("Отделение,ВидСтатистики",стрПредКв.Отделение,стрПредКв.ВидСтатистики);
		НСтр = Объект.ГлавныеСтатистики.НайтиСтроки(СтруктПоиска);
		Для каждого стрТекСт из НСтр Цикл
			стрТекСт.ПредыдущаяКвота =  стрПредКв.Квота;
		КонецЦикла;
	КонецЦикла;

	
	Если ЗначениеЗаполнено(Объект.СтатистикаРС) Тогда
		Объект.ЗначениеСтатистики = ПолучитьЗначениеСтатистики(Объект.СтатистикаРС, ДатаНачала);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатистики(Команда)
	ОбновитьСтатистикиНаСервере();
КонецПроцедуры
