
#Область СлужебныеПроцедурыИФункции

Функция ОбъектыСКомандамиСозданияНаОсновании() Экспорт
	
	Объекты = Новый Массив;
	//ИнтеграцияПодсистемБСП.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты);
	СозданиеНаОснованииПереопределяемый.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты);
	
	Результат = Новый Соответствие;
	Для Каждого ОбъектМетаданных Из Объекты Цикл
		Результат.Вставить(ОбъектМетаданных.ПолноеИмя(), Истина);
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

#КонецОбласти

