
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КомментарийОбщий = Справочники.ЭтапыВнедрения.ОБЩИЙ.Комментарий;
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	ЭлОб = Справочники.ЭтапыВнедрения.ОБЩИЙ.ПолучитьОбъект();
	ЭлОб.Комментарий = КомментарийОбщий;
	ЭлОб.Записать();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ЭлОб = Справочники.ЭтапыВнедрения.ОБЩИЙ.ПолучитьОбъект();
	ЭлОб.Комментарий = КомментарийОбщий;
	ЭлОб.Записать();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийОбщийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
