Процедура ОбработкаПроведения(Отказ, Режим)
	
	//проверим, был ли введен по данному году и менеджеру документ ранее
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланированиеПродажМенеджеров.Ссылка
	|ИЗ
	|	Документ.ПланированиеПродажМенеджеров КАК ПланированиеПродажМенеджеров
	|ГДЕ
	|	ПланированиеПродажМенеджеров.Год = &Год
	|	И ПланированиеПродажМенеджеров.Проведен = ИСТИНА
	|	И ПланированиеПродажМенеджеров.Ссылка <> &Ссылка
	|	И ПланированиеПродажМенеджеров.МенеджерПродаж = &МенеджерПродаж";
	Запрос.УстановитьПараметр("Год",Год);
	Запрос.УстановитьПараметр("МенеджерПродаж",МенеджерПродаж);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Отказ = Истина;
		Сообщить("По данному году и менеджеру уже имеется проведенный документ плана: " + ВыборкаЗапроса.Ссылка,СтатусСообщения.Важное);
	КонецЦикла;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	//запишем новые
	Движения.ПланПродажМенеджеров.Записывать = Истина;
	Для Каждого СтрокаПлан Из План Цикл
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 1;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Январь;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 2;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Февраль;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 3;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Март;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 4;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Апрель;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 5;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Май;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 6;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Июнь;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 7;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Июль;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 8;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Август;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 9;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Сентябрь;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 10;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Октябрь;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 11;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Ноябрь;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 12;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Декабрь;
		
	КонецЦикла;
	
КонецПроцедуры