&НаСервере
Процедура ЗаполнитьДеревоПланов()
	
	ДеревоПланов = ИА_Защита_БП.ПолучитьДеревоПланов(ОтборПост,ОтборОтветсвенный,ОтборПланыПодчиненных,ложь,ГлубинаПросмотра,РежимПросмотра=1);
	ЗначениеВРеквизитФормы(ДеревоПланов,"Планы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПланы(Команда)
	ЗаполнитьДеревоПланов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьДеревоПланов();
КонецПроцедуры

&НаКлиенте
Процедура ПланыПриАктивизацииСтроки(Элемент)
	
	ОбновитьШаги();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьШаги() 
	
	Если Элементы.Планы.ТекущаяСтрока = ПредИДСтрокиБП Тогда  // обход глюка 1с с повторным вызовом активизации строки
		возврат;
	КонецЕсли;
	
	Статистика = ПредопределенноеЗначение("Справочник.ИА_ВидыСтатистик.ПустаяСсылка");
	Состояние = ПредопределенноеЗначение("Справочник.ИА_Состояния.ПустаяСсылка");
	ТекЗначение = 0;
	Квота = 0;
	
	ДеревоПлана.ПолучитьЭлементы().Очистить();
	
	тд = Элементы.Планы.ТекущиеДанные;
	ПредИДСтрокиБП = Элементы.Планы.ТекущаяСтрока;

	Если тд = Неопределено Тогда
		ОбновитьИтогиПоШагам();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тд.План) Тогда		
		ЗагрузитьПлан(тд.План,тд.Пост);
	КонецЕсли;
	
	ОбновитьИтогиПоШагам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	 СтандартнаяОбработка = Ложь;
	 
КонецПроцедуры

 &НаКлиенте
 Процедура ПланыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	 
	 СтандартнаяОбработка = Ложь;
	 
	 тд = Элементы.Планы.ТекущиеДанные;
	 Если ЗначениеЗаполнено(тд.План) Тогда 
		 СтандартнаяОбработка = Ложь;
		 струк = Новый Структура("Ключ", тд.План);
		 ф = ПолучитьФорму("Справочник.ИА_ПланыДействий.ФормаОбъекта",струк);
		 ф.Открыть();
	 КонецЕсли;
	 
 КонецПроцедуры

&НаКлиенте
 Процедура ОтборПостПриИзменении(Элемент)
	 ЗаполнитьДеревоПланов();
 КонецПроцедуры

&НаКлиенте
 Процедура ОтборОтветсвенныйПриИзменении(Элемент)
	 ЗаполнитьДеревоПланов();
 КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	 
	Если ИмяСобытия = "ИА_ПланыДействий_Запись" Тогда
		
		// изменен план действий
		тд = Элементы.Планы.ТекущиеДанные;
		
		Если тд<>Неопределено и тд.План = Параметр Тогда	
			ЗагрузитьПлан(тд.План,тд.Пост);
			ОбновитьИтогиПоШагам();
		КонецЕсли;
		
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПлан(План, Пост)
	
	ДерРез = РеквизитФормыВЗначение("ДеревоПлана");
	
	ОтборПост1 = ?(РежимПросмотра=1, Неопределено, Пост);
	ИА_Защита_БП.ПолучитьДеревоПлана(ДерРез, План, План.Состояние,,ОтборПост1);
	
	Если План.План.Количество()>0 Тогда
		СтрПлан = План.План[0];
		Статистика = СтрПлан.ВидСтатистики;
		ТекЗначение = СтрПлан.ТекущееЗначениеСтатистики;
		Квота = СтрПлан.КвотаПлан;
	КонецЕсли;
			
	ЗначениеВРеквизитФормы(ДерРез, "ДеревоПлана");
КонецПроцедуры

&НаКлиенте
Процедура ОтборПланыПодчиненныхПриИзменении(Элемент)
	ЗаполнитьДеревоПланов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборПланыПодчиненных = Параметры.ОтборПланыПодчиненных;
	ОтборПост             = Параметры.ОтборПост;
	
	СокрВид = Константы.КСУ_СокращенныйВидПлана.Получить();
	ВидГруппировки = константы.КСУ_ГруппировкаЗадачПлана.Получить();

	Если СокрВид Тогда
		Элементы.ДеревоПланаПродукт.Видимость = ложь;
		Элементы.ДеревоПланаСрокИсполнения.Видимость = ложь;
		Элементы.ДеревоПланаВремяФакт.Видимость = ложь;
		Элементы.ДеревоПланаСодержание.Заголовок = "Задача";
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ГлубинаПросмотраПриИзменении(Элемент)
	ЗаполнитьДеревоПланов();
КонецПроцедуры


&НаКлиенте
Процедура РежимПросмотраПриИзменении(Элемент)
	ЗаполнитьДеревоПланов();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СложитьВремя(в1, в2)
	Если не ЗначениеЗаполнено(в2) Тогда
		возврат в1;
	КонецЕсли;
	
	возврат в1 + (в2 - Дата(1,1,1));
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФорматИтога(д1)
	
	Если д1 = дата(1,1,1) Тогда
		возврат "";
	КонецЕсли;
	
	КолЧасов = (День(д1)-1)*24 + Час(д1);
	возврат формат(КолЧасов,"ЧЦ=2; ЧН=; ЧВН=")+":"+формат(Минута(д1),"ЧЦ=2; ЧН=; ЧВН=");
КонецФункции


&НаКлиенте
Процедура ОбновитьИтогиПоШагам()
	//ВремяИтого = Дата(1,1,1);
	//ВремяИтогоФакт = Дата(1,1,1);
	//Выполнено1 = Дата(1,1,1);
	//Для каждого стр из ДеревоПлана.ПолучитьЭлементы() Цикл  // шаги, типы		
	//	Итог11 = Дата(1,1,1);
	//	Итог11Ф = Дата(1,1,1);
	//	Для каждого стр1 из стр.ПолучитьЭлементы() Цикл // задачи
	//		ВремяИтого = СложитьВремя(ВремяИтого , стр1.ВремяПлан);  
	//		ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр1.ВремяФакт);  
	//		
	//		Итог11 = СложитьВремя(Итог11 , стр1.ВремяПлан);
	//		Итог11Ф = СложитьВремя(Итог11Ф , стр1.ВремяФакт);
	//		Если стр1.Выполнено Тогда
	//			Выполнено1 = СложитьВремя(Выполнено1 , стр1.ВремяПлан);
	//		КонецЕсли;
	//	КонецЦикла;
	//	стр.ВремяПлан = ФорматИтога(Итог11);
	//	стр.ВремяФакт = ФорматИтога(Итог11Ф);
	//	
	//	Элементы.ДеревоПлана.Развернуть(стр.ПолучитьИдентификатор());
	//КонецЦикла;
	//
	//время = ФорматИтога(ВремяИтого);
	//ВремяФакт = ФорматИтога(ВремяИтогоФакт);

	//Выполнено = ФорматИтога(Выполнено1);;
	//
	///////////////////////
	ВремяИтого = Дата(1,1,1);
	ВремяИтогоФакт = Дата(1,1,1);
	Выполнено1 = Дата(1,1,1);
	
	Если ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") Тогда
		Для каждого стр1 из ДеревоПлана.ПолучитьЭлементы() Цикл // задачи
			ВремяИтого = СложитьВремя(ВремяИтого , стр1.ВремяПлан);  
			ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр1.ВремяФакт);  
			Если стр1.Выполнено Тогда
				Выполнено1 = СложитьВремя(Выполнено1 , стр1.ВремяПлан);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого стр из ДеревоПлана.ПолучитьЭлементы() Цикл  // шаги, типы		
			Если стр.Группировка = Неопределено Тогда
				ВремяИтого = СложитьВремя(ВремяИтого , стр.ВремяПлан);  
				ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр.ВремяФакт);  
				Если стр.Выполнено Тогда
					Выполнено1 = СложитьВремя(Выполнено1 , стр.ВремяПлан);
				КонецЕсли;
			Иначе
				Итог11 = Дата(1,1,1);
				Итог11Ф = Дата(1,1,1);
				Для каждого стр1 из стр.ПолучитьЭлементы() Цикл // задачи
					ВремяИтого = СложитьВремя(ВремяИтого , стр1.ВремяПлан);  
					ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр1.ВремяФакт);  
					
					Итог11 = СложитьВремя(Итог11 , стр1.ВремяПлан);
					Итог11Ф = СложитьВремя(Итог11Ф , стр1.ВремяФакт);
					Если стр1.Выполнено Тогда
						Выполнено1 = СложитьВремя(Выполнено1 , стр1.ВремяПлан);
					КонецЕсли;
				КонецЦикла;
				стр.ВремяПлан = ФорматИтога(Итог11);
				стр.ВремяФакт = ФорматИтога(Итог11Ф);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	время = ФорматИтога(ВремяИтого);
	ВремяФакт = ФорматИтога(ВремяИтогоФакт);

	Выполнено = ФорматИтога(Выполнено1);;
КонецПроцедуры
