#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

// Процедура заполняет справочник по умолчанию
//
Процедура ЗаполнитьПоставляемыеДанные(НоваяБаза = Ложь) Экспорт
	
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.Организация.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 10;
	СпрОбъект.Использовать = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.Подразделение.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 20;
	СпрОбъект.Использовать = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.Территория.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 30;
	СпрОбъект.Использовать = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.ТочкаПродаж.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 40;
	СпрОбъект.Использовать = НЕ НоваяБаза;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.ВидКонтакта.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 50;
	СпрОбъект.Использовать = НЕ НоваяБаза;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.РекламныйИсточник.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 60;
	СпрОбъект.Использовать = НЕ НоваяБаза;
	СпрОбъект.Записать();	
	
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.РекламнаяАкция.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 70;
	СпрОбъект.Использовать = НЕ НоваяБаза;
	СпрОбъект.Записать();
	
	// #16755
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.Ответственный.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 80;
	СпрОбъект.Использовать = НЕ НоваяБаза;
	СпрОбъект.Записать();
	
	// #16755
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.Замерщик.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 90;
	СпрОбъект.Использовать = Ложь;
	СпрОбъект.Записать();
	
	// #16755
	СпрОбъект = Справочники.ДетализацияУчетаЛидов.Технолог.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 100;
	СпрОбъект.Использовать = Ложь;
	СпрОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли