&НаСервере
Функция АвторизацияПользователя() Экспорт
	
	ИмяПользователя = СокрЛП(ИмяПользователя());
	Если ПустаяСтрока(ИмяПользователя) Тогда
		//++ №8209 переименовываем пользователя Администратор
		//ИмяПользователя = "Администратор";
		ИмяПользователя = "Служба поддержки SmartCeilings";
		//-- №8209
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);
	//Если Пользователь.Пустая() Тогда
	//	Попытка
	//		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	//		НовыйПользователь.Наименование = СокрЛП(ИмяПользователя);
	//		НовыйПользователь.Записать();
	//		                
	//		НоваяЗаписьПрав = РегистрыСведений.ПраваПользователей.СоздатьМенеджерЗаписи();
	//		НоваяЗаписьПрав.Пользователь = НовыйПользователь;
	//		НоваяЗаписьПрав.Период = ТекущаяДата();
	//		НоваяЗаписьПрав.Прочитать();
	//		НоваяЗаписьПрав.Пользователь = НовыйПользователь;
	//		НоваяЗаписьПрав.Записать(Истина);
	//		
	//		Сообщить("Пользователь " + НовыйПользователь.Наименование + " зарегистрирован в системе");
	//		Возврат НовыйПользователь.Ссылка;
	//	Исключение
	//		Сообщить("Ошибка регистрации нового пользователя!" + Символы.ПС + ОписаниеОшибки());
	//		Зарегистрирован = Ложь;
	//	КонецПопытки;
	//Иначе
	//	Возврат Пользователь;
	//КонецЕсли;
	//	
	//Возврат Зарегистрирован;
	Возврат Пользователь;
	
КонецФункции

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	Если ИменаПараметровСеанса = Неопределено Тогда

		// Раздел безусловной установки параметров сеанса.

	// Конец УниверсальныеМеханизмы
	
	// Переопределяемый блок
	//
	// Конец переопределяемого блока.
	
	// УниверсальныеМеханизмы
	Иначе
		// Установка параметров сеанса "по требованию".
		
		// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
		// следует инициализировать сразу группой. для того, чтобы избежать их повторной инициализации, 
		// имена уже установленных параметров сеанса сохраняются в структуре УстановленныеПараметры.
		УстановленныеПараметры = Новый Массив();
		Для Каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
		
	КонецЕсли;

	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	Пользователь = Справочники.Пользователи.ПустаяСсылка();
	Попытка
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
		ПараметрыСеанса.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Исключение
		ПараметрыСеанса.Пользователь = АвторизацияПользователя();
		Если НЕ ПараметрыСеанса.Пользователь = Ложь Тогда
			Пользователь = ПараметрыСеанса.Пользователь;
			ПараметрыСеанса.ТекущийПользователь = Пользователь;
		КонецЕсли;
	КонецПопытки;
	
	ПараметрыСеанса.ОграничиватьДоступПоСкладам = Пользователь.ОграничиватьДоступПоСкладам;
	ПараметрыСеанса.ОграничиватьДоступПоСкладамВЗависимостиОтРабочегоМеста = Пользователь.ОграничиватьДоступПоСкладамВЗависимостиОтРабочегоМеста;
	ПараметрыСеанса.ОграничиватьДоступПоОрганизациям = Пользователь.ОграничиватьДоступПоОрганизациям;
	ПараметрыСеанса.ОграничиватьДоступККонтрагентамПоГруппамДоступа = Пользователь.ОграничиватьДоступККонтрагентамПоГруппамДоступа;
	ПараметрыСеанса.ОграничиватьПереченьДоступныхВидовЦен = Пользователь.ОграничиватьПереченьДоступныхВидовЦен;
	ПараметрыСеанса.ТелефонияПринимаетВходящиеЗвонки = Пользователь.ТелефонияПринимаетВходящиеЗвонки;
	ПараметрыСеанса.ТелефонияВыполняетИсходящиеЗвонки = Пользователь.ТелефонияВыполняетИсходящиеЗвонки; // №9362
	ПараметрыСеанса.ОграничениеДоступаКЗаказДоговорамДляЗамерщика = Пользователь.ОграничениеДоступаКЗаказДоговорамДляЗамерщика;
	ПараметрыСеанса.ОграничениеДоступаКЛидамДляЗамерщика = Пользователь.ОграничениеДоступаКЛидамДляЗамерщика;
	ПараметрыСеанса.ОграничениеДоступаКЛидамДляТехнолога = Пользователь.ОграничениеДоступаКЛидамДляТехнолога; // #16927
	ПараметрыСеанса.ТекущийСотрудник = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	
	ПараметрыСеанса.ОграничиватьДоступПоКассамИБанковскимСчетамОрганизаций = Пользователь.ОграничиватьДоступПоКассамИБанковскимСчетамОрганизаций 
							И Пользователь.ВидОграниченияДоступаПоКассамИБанковскимСчетам = Перечисления.ВидыОграниченияДоступа.ВсеЗапрещеныКромеУказанных;
	ПараметрыСеанса.ОграничиватьДоступПоКассамИБанковскимСчетамОрганизацийПоЗапрещенным = Пользователь.ОграничиватьДоступПоКассамИБанковскимСчетамОрганизаций
	                        И Пользователь.ВидОграниченияДоступаПоКассамИБанковскимСчетам = Перечисления.ВидыОграниченияДоступа.ВсеРазрешеныКромеУказанных;
							
	ПараметрыСеанса.ОграничиватьДоступПоЭквайринговымТерминалам = Пользователь.ОграничиватьДоступПоЭквайринговымТерминалам; // #9431	
	ПараметрыСеанса.ОграничитьВидимостьЛидовПоТочкамПродаж = Пользователь.ОграничитьВидимостьЛидовПоТочкамПродаж;
	ПараметрыСеанса.ПриПоднятииТрубкиОткрыватьКарточкуКонтрагента = Пользователь.ПриПоднятииТрубкиОткрыватьКарточкуКонтрагента;
	ПараметрыСеанса.ВариантНастроекТелефонии = Константы.ВариантНастроекТелефонии.Получить();
	ПараметрыСеанса.ЗапретитьСниматьОтборПоОтветственномуВСпискеЛидов = Пользователь.ЗапретитьСниматьОтборПоОтветственномуВСпискеЛидов;
	ПараметрыСеанса.НеДоступенПереводЛидаВНеЦелевой = Пользователь.НеДоступенПереводЛидаВНеЦелевой;
	ПараметрыСеанса.НеДоступенПереводЛидаВОтказ = Пользователь.НеДоступенПереводЛидаВОтказ;
	ПараметрыСеанса.ОграничиватьПереченьДоступныхКатегорийКонтрагентов = Пользователь.ОграничиватьПереченьДоступныхКатегорийКонтрагентов;
	ПараметрыСеанса.СкрыватьСуммуДокументовВСтруктуреПодчиненности = Пользователь.СкрыватьСуммуДокументовВСтруктуреПодчиненности;
	ПараметрыСеанса.РазрешеноИзменятьГалочкуОтгрузкаРазрешенаВЗаказах = Пользователь.РазрешеноИзменятьГалочкуОтгрузкаРазрешенаВЗаказах;
	ПараметрыСеанса.ИнтервалЗапросаИсторииЗвонков = Константы.ИнтервалЗапросаИсторииЗвонков.Получить();
	ПараметрыСеанса.РазрешеноРедактироватьВыполненныеИЗакрытыеМонтажи = Пользователь.РазрешеноРедактироватьВыполненныеИЗакрытыеМонтажи;
	ПараметрыСеанса.ТелефонияСтрана = Константы.ТелефонияСтрана.Получить();
	ПараметрыСеанса.ПоказыватьТаблицуЦенВСправочникеНоменклатуры = Пользователь.ПоказыватьТаблицуЦенВСправочникеНоменклатуры;
	ПараметрыСеанса.ОграничитьДоступКЛидамПоСтатусуЛида = Пользователь.ОграничитьДоступКЛидамПоСтатусуЛида; // №12217
	
	//проверим необходимость уведомлять о просроченных лидах
	ПараметрыСеанса.УведомлятьОПросроченныхЛидах = Ложь;
	Если Константы.КонтролироватьВремяРеакцииПоЛидам.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолучателиУведомленийОПросроченныхЛидах.Пользователь
		|ИЗ
		|	РегистрСведений.ПолучателиУведомленийОПросроченныхЛидах КАК ПолучателиУведомленийОПросроченныхЛидах
		|ГДЕ
		|	ПолучателиУведомленийОПросроченныхЛидах.Пользователь = &Пользователь";
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПараметрыСеанса.УведомлятьОПросроченныхЛидах = Истина;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов    = Константы.ИспользоватьВедениеУчетаДоходовРасходов.Получить();
	ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов = Константы.НекассовыйМетодВеденияУчетаДоходовРасходов.Получить();	
	ПараметрыСеанса.ФинРезультатКассовыйМетодВеденияУчетаДоходовРасходов   = Константы.КассовыйМетодВеденияУчетаДоходовРасходов.Получить();	
	
	ПараметрыСеанса.УведомлятьОСостоянииОтправкиСМС = Пользователь.УведомлятьОСостоянииОтправкиСМС;
	ПараметрыСеанса.УведомлятьОСостоянииОтправкиСМСТолькоПриЗапускеПрограммы = Пользователь.УведомлятьОСостоянииОтправкиСМСТолькоПриЗапускеПрограммы;
	ПараметрыСеанса.ВремяПослеКоторогоСМСПросрочена = Пользователь.ВремяПослеКоторогоСМСПросрочена;	
	
	//Если в карточке пользователя задана РМК, поставим её в параметры сеанса
	Если НЕ Пользователь.РМК.Пустая() Тогда
		ПараметрыСеанса.РабочееМестоКлиента = Пользователь.РМК;
	КонецЕсли;	
	
	ПараметрыСеанса.ТекущийПользовательНомерСессииНаСервере = НомерСеансаИнформационнойБазы();
	//СеансыИнформационнойБазы = ПолучитьСеансыИнформационнойБазы();
	//Для НомерВМассиве = 0 По СеансыИнформационнойБазы.Количество()-1 Цикл
	//	Если СеансыИнформационнойБазы[НомерВМассиве].Пользователь.УникальныйИдентификатор = ПараметрыСеанса.ТекущийПользователь.ИдентификаторПользователяИБ Тогда			
	//		ПараметрыСеанса.ТекущийПользовательНомерСессииНаСервере = СеансыИнформационнойБазы[НомерВМассиве].НомерСеанса;
	//	КонецЕсли;
	//КонецЦикла;

	#Если НЕ ТолстыйКлиентУправляемоеПриложение И НЕ ТолстыйКлиентОбычноеПриложение Тогда
	// №7253
	ОбщийМодуль.УстановитьПризнакЭтоОблако(ПараметрыСеанса.ЭтоОблако);
	#КонецЕсли
	
КонецПроцедуры

Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	
	// Конец УниверсальныеМеханизмы
	Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Конец УниверсальныеМеханизмы

	// Переопределяемый блок

	// ПодключаемоеОборудование
	МенеджерОборудованияВызовСервера.УстановитьПараметрыСеансаПодключаемогоОборудования(ИмяПараметра, УстановленныеПараметры);
	// Конец ПодключаемоеОборудование

	// Конец переопределяемого блока.

КонецПроцедуры