
&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
    ТЗФ = СохранитьИЗакрытьФрагмент();
    
    Закрыть(ТЗФ);
КонецПроцедуры

&НаСервере
Функция СохранитьИЗакрытьФрагмент()
    Возврат ИА_БФС.ТЗ2ТЗФ(ТабРаспределение.Выгрузить());
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьРазделы = Константы.ИА_ФП_ИспользоватьРазделыПолитики.Получить();
	ИспПодр = константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	
	Элементы.ТабРаспределениеРаздел.Видимость = ИспользоватьРазделы;
	Элементы.ТабРаспределениеПодразделение.Видимость = ИспПодр;
	
    Для каждого Стр Из Параметры.Распределение1 Цикл
    	НовСтрока = ТабРаспределение.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
	КонецЦикла;  
	
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
КонецПроцедуры
