&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Лид = Параметры.Лид;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПередатьПараметрыВСписокПредварительныхРасчетов();
КонецПроцедуры

&НаКлиенте
Процедура ПередатьПараметрыВСписокПредварительныхРасчетов()
	СписокПредварительныхРасчетов.Параметры.УстановитьЗначениеПараметра("Лид", Лид);
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	Если Не Элементы.СписокПредварительныхРасчетов.ТекущиеДанные = Неопределено Тогда
		Закрыть(Новый Структура("ПредварительныйРасчет",Элементы.СписокПредварительныхРасчетов.ТекущиеДанные.ПредварительныйРасчет));
	Иначе
		Закрыть(Неопределено);
	КонецЕсли;
КонецПроцедуры


