
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Имя = Константы.ЗадатьВопросИмя.Получить();
	Город = Константы.ЗадатьВопросГород.Получить();
	Скайп = Константы.ЗадатьВопросСкайп.Получить();
	НазваниеКомпании = Константы.ЗадатьВопросНазваниеКомпании.Получить();
	ЕМайл = Константы.ЗадатьВопросЕМайл.Получить();
	
	Попытка
		Вопрос = Параметры.ТекстЗапроса;
	Исключение
	КонецПопытки;


КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыЗапроса()
	
	Константы.ЗадатьВопросИмя.Установить(Имя);
	Константы.ЗадатьВопросГород.Установить(Город);
	Константы.ЗадатьВопросСкайп.Установить(Скайп);
	Константы.ЗадатьВопросНазваниеКомпании.Установить(НазваниеКомпании);
	Константы.ЗадатьВопросЕМайл.Установить(ЕМайл);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Если ПустаяСтрока(Вопрос) Тогда
		ПоказатьПредупреждение(,"Не указан текст запроса");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(Имя) Тогда
		ПоказатьПредупреждение(,"Пожалуйста, укажите Ваше имя");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЕМайл) Тогда
		ПоказатьПредупреждение(,"Пожалуйста, укажите Ваш E-Mail");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(Город) Тогда
		ПоказатьПредупреждение(,"Пожалуйста, укажите Ваш город");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НазваниеКомпании) Тогда
		ПоказатьПредупреждение(,"Пожалуйста, укажите название Вашей компании");
		Возврат;
	КонецЕсли;
	
	СохранитьПараметрыЗапроса();
	
	МассивДляЗаписи = Новый Массив;
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("Имя",Имя);
	СтруктураЗапроса.Вставить("Скайп",Скайп);
	СтруктураЗапроса.Вставить("Город",Город);
	СтруктураЗапроса.Вставить("НазваниеКомпании",НазваниеКомпании);
	СтруктураЗапроса.Вставить("Емайл",ЕМайл);
	СтруктураЗапроса.Вставить("Вопрос",Вопрос);
	
	
	МассивДляЗаписи.Добавить(СтруктураЗапроса);
	
	АдресСервера = "1c.smartceilings.ru";
	РесурсНаСервере = "/zapros.php";
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, МассивДляЗаписи);
	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	ФайлСообщения = Новый Файл(ПолучитьИмяВременногоФайла("out"));
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(СтрокаДляОтвета);
	Текст.Записать(ФайлСообщения.ПолноеИмя);
	
	ФайлОтвета = Новый Файл(ПолучитьИмяВременногоФайла("in"));
	
	// устанавливаем соединение с сервером
	
	Попытка
		Соединение = Новый HTTPСоединение(АдресСервера);
	Исключение
		ВызватьИсключение "Ошибка соединения с сервером: " + ОписаниеОшибки();
		Возврат;
	КонецПопытки;
	
	// посылаем запрос
	
	Попытка
		
		HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

		
		Результат  = Соединение.ОтправитьДляОбработки(HTTPЗапрос, ФайлОтвета.ПолноеИмя);
		Соединение = Неопределено;
		Если Результат.КодСостояния >= 299 Тогда
			ВызватьИсключение "Ошибка отправки данных о версии на портал. Код ответа портала: " + Результат.КодСостояния;
		КонецЕсли;
		Ответ = Новый ТекстовыйДокумент();
		Ответ.Прочитать(ФайлОтвета.ПолноеИмя, КодировкаТекста.UTF8);
		ТекстОтвета = Ответ.ПолучитьТекст();
		
	Исключение
		ВызватьИсключение "Ошибка отправки запроса на сервер: " + ОписаниеОшибки();
		Возврат;
	КонецПопытки;
	
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры
