
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Год = Год(ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ТекОбъект = ЭтаФорма.РеквизитФормыВЗначение("Отчет");
	
	Макет = ТекОбъект.ПолучитьМакет("Макет");
	ТабличныйДокумент = МодульОтчетов.СформироватьОтчетИсполнениеПланаКонтактов(Макет, Отчет.Год, Отчет.ТочкаПродаж);
	
	Макет = ТекОбъект.ПолучитьМакет("МакетГрафик");
	ОтчетГрафик = МодульОтчетов.СформироватьОтчетИсполнениеПланаКонтактовГрафик(Макет, Отчет.ТочкаПродаж, Отчет.Год);
	
	ТабличныйДокумент.Вывести(ОтчетГрафик);
	
КонецПроцедуры