Функция ПолучитьИмяВременногоФайлаСервер(ОжидаемоеРасширениеФайла = Неопределено) Экспорт
	Если ЗначениеЗаполнено(ОжидаемоеРасширениеФайла) Тогда
		Возврат ПолучитьИмяВременногоФайла(ОжидаемоеРасширениеФайла)
	Иначе
		Возврат ПолучитьИмяВременногоФайла()	
	КонецЕсли;
КонецФункции

Функция ЗаписатьJSONНаСервере(Запись_JSON, СтруктураКода) Экспорт
	
	ЗаписатьJSON(Запись_JSON, СтруктураКода);
	Строка_JSON	= Запись_JSON.Закрыть();
	
	Возврат Строка_JSON; 

КонецФункции

Функция ПрочитатьJSONСервер(ЧтениеJSON) Экспорт
	Возврат ПрочитатьJSON(ЧтениеJSON);
КонецФункции

Функция НайтиФайлыСервер(ПолныйПуть,Маска) Экспорт
	Возврат НайтиФайлы(ПолныйПуть,Маска)
КонецФункции 

Функция ИмяКомпьютераСервер() Экспорт
	Возврат ИмяКомпьютера();
КонецФункции

Функция РабочийСтол() Экспорт 
	WSS=Новый COMОбъект("WScript.Shell");
	Возврат WSS.SpecialFolders().Item("Desktop");	
КонецФункции

Функция ПрочитатьФайлIni(Знач ПолныйПутьКФайлу, МассивСообщений = Неопределено) Экспорт
	
	Результат = Новый Структура("ТипФайла", "INI");;
	
	ТекстФайлIni = Новый ТекстовыйДокумент;
	ФайлПостроителя = Новый Файл(ПолныйПутьКФайлу);
	ФорматФайловПостроителя =  ОбменСEasyCeiling.ФорматФайловПостроителя();
	
	Если ФайлПостроителя.Существует() Тогда
		Попытка
			Если ПустаяСтрока(ФорматФайловПостроителя) Тогда
				ТекстФайлIni.Прочитать(ПолныйПутьКФайлу);
			Иначе
				ТекстФайлIni.Прочитать(ПолныйПутьКФайлу, ФорматФайловПостроителя);
			КонецЕсли;
		Исключение
			ДобавитьВМассивСообщений(МассивСообщений, "Не удалось прочитать файл: " + ОписаниеОшибки(), Истина);
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Результат.Вставить("ДанныеФайлаИмпорта", ТекстФайлIni.ПолучитьТекст());
	
	СписокЗначенийСекции = Новый СписокЗначений;
	КлючТекущейСекции = "";
	
	КоличествоСтрокФайла = ТекстФайлIni.КоличествоСтрок();
	Если КоличествоСтрокФайла <= 1 Тогда
		ДобавитьВМассивСообщений(МассивСообщений, "Файл не содержит данных: " + ПолныйПутьКФайлу, Истина);
		Возврат Неопределено;
	КонецЕсли;
	
	Для Индекс = 1 По КоличествоСтрокФайла Цикл
		СтрокаФайлаIni = СокрЛП(ТекстФайлIni.ПолучитьСтроку(Индекс));

		Если ЭтоСекцияIniФайла(СтрокаФайлаIni) Тогда
			ИмяСекции = Сред(СтрокаФайлаIni, 2, СтрДлина(СтрокаФайлаIni) - 2);
			Результат.Вставить(ИмяСекции, Новый СписокЗначений); //СписокЗначений, а не Структура потому что могут быть неуникальные параметры
			КлючТекущейСекции = ИмяСекции;
		Иначе
			ИмяПараметра = "";
			ЗначениеПараметра = "";
			ПрочитатьПараметрIni(СтрокаФайлаIni, ИмяПараметра, ЗначениеПараметра);
			Если НЕ ПустаяСтрока(ИмяПараметра) Тогда
				Результат[КлючТекущейСекции].Добавить(ИмяПараметра, ЗначениеПараметра);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьВМассивСообщений(МассивСообщений, ТекстОшибки, ЭтоОшибка = Ложь)
	
	Если МассивСообщений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МассивСообщений.Добавить(Новый Структура("ТекстОшибки, ЭтоОшибка", ТекстОшибки, ЭтоОшибка)); 
	
КонецПроцедуры

Функция ЭтоСекцияIniФайла(Знач СтрокаФайлаIni) Экспорт
	
	ТекстСтр = СокрЛП(СтрокаФайлаIni);
	
	Если Лев(ТекстСтр, 1) = "[" И Прав(ТекстСтр, 1) = "]" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции 

Процедура ПрочитатьПараметрIni(Знач СтрокаФайлаIni, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	ИмяПараметра       = "";	
	ЗначениеПараметра  = "";
	
	Разделитель        = "=";
	СимволКомментария  = ";";
	ТекстСтр           = СокрЛП(СтрокаФайлаIni);
	
	ПозицияРазделителя = Найти(ТекстСтр, Разделитель);
	
	Если Лев(ТекстСтр, 1) <> СимволКомментария Тогда
		Если ПозицияРазделителя > 0 Тогда
			ИмяПараметра      = Лев(ТекстСтр, ПозицияРазделителя - 1);
			
			Если СтрДлина(ТекстСтр) > (СтрДлина(ИмяПараметра) + 1) Тогда
				ЗначениеПараметра = Сред(ТекстСтр, ПозицияРазделителя + 1);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
