Процедура СоздатьНовуюВерсиюДляМаршрутаЗадач(МаршрутЗадач) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        МаршрутЗадач = Справочники.ИА_БПМаршрутЗадач.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    СпрМЗ = МаршрутЗадач.ПолучитьОбъект();
    
    Если НЕ ЗначениеЗаполнено(МаршрутЗадач.ТекущаяКартаМаршрута) Тогда
        // Создать новую
        Спр = Справочники.ИА_БПКартыМаршрутов.СоздатьЭлемент();
        Спр.МаршрутЗадач = МаршрутЗадач;
    Иначе // Скопировать существующую
        Спр = Справочники.ИА_БПКартыМаршрутов.СоздатьЭлемент();
        Спр.Заполнить(МаршрутЗадач.ТекущаяКартаМаршрута);
    КонецЕсли; 
    Спр.Версия = ПолучитьНовуюВерсию(МаршрутЗадач);
    Спр.Наименование = МаршрутЗадач.Наименование + ", версия " + Спр.Версия;
    Спр.Записать();        
    
    СпрМЗ.ТекущаяКартаМаршрута = Спр.Ссылка;
    СпрМЗ.Записать();
КонецПроцедуры

Функция ПолучитьНовуюВерсию(МаршрутЗадач)
    Запрос = Новый Запрос(
    "ВЫБРАТЬ   разрешенные
    |	МАКСИМУМ(ИА_БПКартыМаршрутов.Версия) КАК Версия
    |ИЗ
    |	Справочник.ИА_БПКартыМаршрутов КАК ИА_БПКартыМаршрутов
    |ГДЕ
    |	ИА_БПКартыМаршрутов.МаршрутЗадач = &МаршрутЗадач");
    Запрос.УстановитьПараметр("МаршрутЗадач", МаршрутЗадач);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() И Выборка.Версия <> NULL Тогда
        ТекущаяВерсия = Выборка.Версия;
    Иначе	
        ТекущаяВерсия = -1;
    КонецЕсли; 
    Возврат ТекущаяВерсия + 1;
КонецФункции

Функция ПолучитьСписокМаршрутовПоОбъекту(Объект) Экспорт
    М = Новый Массив;
    М.Добавить(ТипЗнч(Объект));
    
    ОписаниеТиповОбъекта = Новый ОписаниеТипов(М);
    Таб = ИА_БФС.Типы_ОписаниеТипов2ТаблицаСтроковыхТипов(ОписаниеТиповОбъекта);
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Т.Имя
    |ПОМЕСТИТЬ Таб
    |ИЗ
    |   &ТЗ КАК Т
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ   разрешенные
    |   Т.Ссылка
    |ИЗ
    |   Таб КАК Таб
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИА_БПМаршрутЗадач.ДоступныеВладельцы КАК Т
    |       ПО Таб.Имя = Т.Имя
    |
    |СГРУППИРОВАТЬ ПО
    |   Т.Ссылка";
    Запрос.УстановитьПараметр("ТЗ", Таб);
    Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    Возврат Результат;
КонецФункции

Функция ПолучитьТаблицуДопРеквизитов(МаршрутЗадач) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ   разрешенные
    |	ИА_БПРеквизиты.Ссылка Реквизит,
    |	ИА_БПРеквизиты.Наименование + "" ("" + ИА_БПРеквизиты.УниКод + "")"" КАК Наименование
    |ИЗ
    |	ПланВидовХарактеристик.ИА_БПРеквизиты КАК ИА_БПРеквизиты
    |ГДЕ
    |	ИА_БПРеквизиты.ВладелецРеквизита = &МаршрутЗадач
    |	И НЕ ИА_БПРеквизиты.ЭтоГруппа
    |	И НЕ ИА_БПРеквизиты.ПометкаУдаления";
    Запрос.УстановитьПараметр("МаршрутЗадач", МаршрутЗадач);
    Результат = Запрос.Выполнить().Выгрузить();
    Возврат Результат;
КонецФункции

Функция ЕстьДопРеквизиты(МаршрутЗадач) Экспорт
    Возврат ПолучитьТаблицуДопРеквизитов(МаршрутЗадач).Количество() > 0;
КонецФункции
 