Процедура ПоказатьЗадачиПоТочке(БП, ИмяТочки, ВключатьИсключенные = Ложь) Экспорт
    Рез =ИА_БПС.ПолучитьИнформациюОЗадачахПоИмениТочки(БП, ИмяТочки, ВключатьИсключенные);
    Если Рез.ВложенныеБП.Количество() > 0 Тогда
        Для каждого Эл Из Рез.ВложенныеБП Цикл
        	ПоказатьЗначение(,Эл);
        КонецЦикла;  
    Иначе
        СписокЗадач = Рез.СписокЗадач;
        Если СписокЗадач.Количество() = 0 Тогда
            ПоказатьПредупреждение(,"Нет задач в точке """ + ИмяТочки + """ у """ + БП + """ !");
        ИначеЕсли СписокЗадач.Количество() = 1 Тогда
            ПоказатьЗначение(,СписокЗадач[0]);
        Иначе
            Отбор = Новый Структура("БизнесПроцесс, ИА_ТочкаБП", БП, Рез.Точка);
            Если НЕ ВключатьИсключенные Тогда
                Отбор.Вставить("ИА_ИсключенаИзОбработки", Ложь);
            КонецЕсли; 
            П = Новый Структура("Отбор", Отбор);		
            ОткрытьФорму("Обработка.ИА_БПМенеджер.Форма.ФормаСпискаЗадач", П);
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

Процедура ОповеститьОбИзмененииСостоянияБП(БП) Экспорт
    Оповестить("ОбновитьКарты", БП);
    
    Список = ИА_БПС.ПолучитьРодительскиеБП(БП);
    Для каждого Эл Из Список Цикл
    	Оповестить("ОбновитьКарты", Эл);
    КонецЦикла; 
КонецПроцедуры
