#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет указан ли исполнитель или роль исполнителя.
// 
// Возвращаемое значение:
//  Булево - Возвращает Истина, если в задаче указан исполнитель или роль исполнителя.
//
Функция РеквизитыАдресацииЗаполнены() Экспорт
	
	Возврат ЗначениеЗаполнено(УДАЛИТЬ_Исполнитель) ИЛИ НЕ РольИсполнителя.Пустая();

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаОбъект.Задачи") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, 
			"БизнесПроцесс,ТочкаМаршрута,Наименование,Исполнитель,РольИсполнителя," 
			+ "Важность,ДатаИсполнения,Автор,ОписаниеЗадачи,СрокИсполнения," 
			+ "ДатаНачалаИсполнения,РезультатИсполнения,ПредметЗадачи");
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Важность) Тогда
		Важность = Перечисления.ВариантыВажности.Обычная;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		Если ЗначениеЗаполнено(ПредметЗадачи) И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПредметЗадачи, "ТочкаПродаж") Тогда
			ТочкаПродаж = ПредметЗадачи.ТочкаПродаж;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗадачаБылаВыполнена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Выполнена");
	Если НЕ ЗадачаБылаВыполнена И Выполнена Тогда
		
		Если НЕ РеквизитыАдресацииЗаполнены() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Необходимо указать исполнителя задачи.'"),,,
				"Объект.Исполнитель", Отказ);
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ЗадачаБылаВыполнена И Выполнена Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Эта задача уже была выполнена ранее.'"),,,, Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Ссылка.Пустая() Тогда
		ИсходныеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, 
			"Выполнена, ПометкаУдаления");
	Иначе
		ИсходныеРеквизиты = Новый Структура(
			"Выполнена, ПометкаУдаления",
			Ложь, Ложь);
	КонецЕсли;
		
	Если ИсходныеРеквизиты.ПометкаУдаления <> ПометкаУдаления Тогда
		БизнесПроцессыИЗадачиСервер.ПриПометкеУдаленияЗадачи(Ссылка, ПометкаУдаления);
	КонецЕсли;
	
	Если НЕ ИсходныеРеквизиты.Выполнена И Выполнена Тогда
		
		// Если задача выполнена, то запишем в реквизит Исполнитель того
		// пользователя, который фактически выполнил задачу. Это нам потом
		// потребуется для отчетов. Такую запись делаем только в том
		// случае, если в базе было не выполнено, а в объекте стало выполнено.
		Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
			Исполнитель = Пользователи.АвторизованныйПользователь();
		КонецЕсли;
		Если ДатаИсполнения = Дата(1, 1, 1) Тогда
			ДатаИсполнения = ТекущаяДатаСеанса();
		КонецЕсли;
	ИначеЕсли НЕ ПометкаУдаления И ИсходныеРеквизиты.Выполнена И Выполнена Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Эта задача уже была выполнена ранее.'"),,,, Отказ);
			Возврат;
	КонецЕсли;
	
	Если Важность.Пустая() Тогда
		//++
		//Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
		Важность = Перечисления.ВариантыВажности.Обычная;
		//--
	КонецЕсли;
	
	Если Выполнена И Не ПринятВРаботу Тогда
		ПринятВРаботу = Истина;
		ДатаНачалаИсполнения = ТекущаяДатаСеанса();
	КонецЕсли;
		
	// Заполнение реквизита ДатаНачалаИсполнения.
	Если ПринятВРаботу И ДатаНачалаИсполнения = Дата('00010101') Тогда
		ДатаНачалаИсполнения = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	
	//Если ТочкаМаршрута.Имя = "Выполнить" и ПустаяСтрока(РезультатИсполнения) Тогда 
	//	Отказ = Истина;
	//	Сообщить ("Необходимо заполнить результат исполнения");
	//	возврат;
	//КонецЕсли;
			
	//Если ТочкаМаршрута.Имя = "Выполнить" Тогда 
	//	БП = БизнесПроцесс.ПолучитьОбъект();
	//	БП.РезультатИсполнения = РезультатИсполнения;
	//	БП.РезультатПроверки = "";
	//	БП.ИсторияВыполнения = ИсторияВыполнения + "
	//	|" + Формат(ТекущаяДатаСеанса(),"ДЛФ=DDT") + " " + ПараметрыСеанса.ТекущийПользователь + ?(НЕ БП.Отменено, " выполнил(а)",  " отменил(а)") + " задание.
	//	|Результат: " + РезультатИсполнения + "
	//	|";
	//	БП.Записать();
	//	ДатаИсполнения = ТекущаяДатаСеанса();			
	//КонецЕсли;
	//
	//Если ТочкаМаршрута.Имя = "Проверить" и ПодтвержденаПроверка Тогда 
	//	БП = БизнесПроцесс.ПолучитьОбъект();
	//	БП.Подтверждено = Истина;
	//	БП.ИсторияВыполнения = ИсторияВыполнения + "
	//	|" + Формат(ТекущаяДатаСеанса(),"ДЛФ=DDT") + " " + ПараметрыСеанса.ТекущийПользователь + " проверил(а) и закрыл(а) задание.
	//	|" + РезультатПроверки + "
	//	|";
	//	БП.РезультатПроверки = РезультатПроверки;
	//	БП.Записать();
	//	ДатаИсполнения = ТекущаяДатаСеанса();
	//ИначеЕсли ТочкаМаршрута.Имя = "Проверить" и не ПодтвержденаПроверка Тогда 
	//	БП = БизнесПроцесс.ПолучитьОбъект();
	//	БП.ИсторияВыполнения = ИсторияВыполнения + "
	//	|" + Формат(ТекущаяДатаСеанса(),"ДЛФ=DDT") + " " + ПараметрыСеанса.ТекущийПользователь + " вернул(а) задание на доработку
	//	|"+ РезультатПроверки + "
	//	|";
	//	БП.РезультатПроверки = РезультатПроверки;
	//	БП.РезультатИсполнения = "";
	//	БП.Записать();
	//	ДатаИсполнения = ТекущаяДатаСеанса();		
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

