//#13359

#Область ПрограммныйИнтерфейс

Функция ЗапросБаллов(Форма, ДокОбъект) Экспорт
	
	//ДокОбъект.UDS_Клиент = "SM";	      // на время отладки
	//Форма.ОстатокПоДисконтнойКарте = 300; // на время отладки
	
	СведенияОтСервера = UDS_ОбщийМодульКлиентСервер.ПолучитьИнформациюССервераUDS(ДокОбъект.Организация, ДокОбъект.UDS_КодСкидки, ДокОбъект.UDS_НомерТелефона);
	Если СведенияОтСервера = Неопределено Тогда		
		Возврат Неопределено;
	КонецЕсли;
	
	ДокОбъект.UDS_Клиент = СведенияОтСервера.user.displayName;	
	Форма.ОстатокПоДисконтнойКарте = Окр(СведенияОтСервера.user.participant.points-0.49,0); // доступно бонусов
	
	Если ДокОбъект.СписыватьБонусы Тогда
		Форма.ДоступноПоДисконтнойКарте = Мин(Форма.ОстатокПоДисконтнойКарте,
											  БонусыВызовСервера.МаксимальныйРазмерБонусовКСписаниюПоДокументу() / 100 * Форма.СуммаДокументаБезУчетаБонусов 
											  );
											  
		// пока не разрешаем списание бонусов по телефону									 
		Если ЗначениеЗаполнено(ДокОбъект.UDS_НомерТелефона) И НЕ ЗначениеЗаполнено(ДокОбъект.UDS_КодСкидки) Тогда
			Форма.ДоступноПоДисконтнойКарте = 0;	
		КонецЕсли;
		
		// пользователь заполняет руками для распределения бонусов									  
		//ДокОбъект.СуммаБонусовКСписаниюПоДисконтнойКарте = Форма.ДоступноПоДисконтнойКарте;
	КонецЕсли;
	
КонецФункции

Процедура ОчиститьПоля(ДокОбъект) Экспорт
	
	ДокОбъект.UDS_КодСкидки = "";
	ДокОбъект.UDS_НомерТелефона = "";
	
КонецПроцедуры

// Функция - ПередатьТранзакцию
//
// Параметры:
//  ДокОбъект	 - 	 документ 
//  ЕстьУслуги	 - 	 наличие табличной части с услугами 
// 
// Возвращаемое значение:
//   0 - не требуется отражение (либо уже отправлено) 
//   1 - успешно отправлено
//   2 - ошибка
//
Функция ПередатьТранзакцию(ДокОбъект, ЕстьУслуги) Экспорт
	
	Если НЕ ДокОбъект.СлужебныйВидБонуснойСистемы = ПредопределенноеЗначение("Перечисление.ВидыБонусныхСистем.UDS") Тогда
		Возврат 0;
	КонецЕсли;
	
	СтруктураСумм = БонусыКлиент.ПолучитьСуммыПоСтрокамДокумента(ДокОбъект, ЕстьУслуги);
	//СтруктураСумм = Новый Структура("СуммаБезСкидок, СуммаСкидки, СуммаСкидкиБонусами, Сумма, СуммаСтрокСоСкидками"
	
	ТребуетсяОтправлять = Ложь;
	Если НЕ ЗначениеЗаполнено(ДокОбъект.UDS_ИдентификаторОперации) Тогда
		Если СтруктураСумм.СуммаСкидкиБонусами > 0 
			//И ЗначениеЗаполнено(ДокОбъект.UDS_КодСкидки) // передаем все транзакции, если UDS: бонусы могли списать по телефону
			Тогда 
			ТребуетсяОтправлять = Истина;
		КонецЕсли;
		Если СтруктураСумм.СуммаСкидкиБонусами = 0 
			И (ЗначениеЗаполнено(ДокОбъект.UDS_КодСкидки) ИЛИ ЗначениеЗаполнено(ДокОбъект.UDS_НомерТелефона))
			И ДокОбъект.НачислятьБонусы
			Тогда 
			ТребуетсяОтправлять = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ТребуетсяОтправлять Тогда
		Возврат 0;
	КонецЕсли;
		
	ПараметрыОперации = Новый Структура;
		
	//Проведём транзакцию на сервере UDS
	Режим = UDS_ОбщийМодульВызовСервера.ПолучитьРежимНачисленияБонусов(ДокОбъект.Организация);										 
										 
	Если Режим.РежимНачисленияБонусов = ПредопределенноеЗначение("Перечисление.РежимыНачисленияБонусов.НаВсеТовары") Тогда //"НаВсе" Тогда
		ПараметрыОперации.Вставить("total",		Формат(СтруктураСумм.СуммаБезСкидок, "ЧГ="));
		ПараметрыОперации.Вставить("cash",		Формат(СтруктураСумм.СуммаБезСкидок - СтруктураСумм.СуммаСкидкиБонусами, "ЧГ="));
		ПараметрыОперации.Вставить("points",	Формат(СтруктураСумм.СуммаСкидкиБонусами, "ЧН=0; ЧГ="));
		ПараметрыОперации.Вставить("number",	Транслитерация(ДокОбъект.Номер));
			
	ИначеЕсли Режим.РежимНачисленияБонусов = ПредопределенноеЗначение("Перечисление.РежимыНачисленияБонусов.ИсключитьСуммуСкидок") Тогда //Режим = "КромеСуммСкидок" Тогда
		ПараметрыОперации.Вставить("total",		Формат(СтруктураСумм.СуммаБезСкидок - СтруктураСумм.СуммаСкидки, "ЧГ="));
		ПараметрыОперации.Вставить("cash",		Формат(СтруктураСумм.Сумма, "ЧН=0; ЧГ="));
		ПараметрыОперации.Вставить("points",	Формат(СтруктураСумм.СуммаСкидкиБонусами, "ЧН=0; ЧГ="));
		ПараметрыОперации.Вставить("number",	Транслитерация(ДокОбъект.Номер));
		
	ИначеЕсли Режим.РежимНачисленияБонусов = ПредопределенноеЗначение("Перечисление.РежимыНачисленияБонусов.ИсключитьТоварыСоСкидкой") Тогда // Режим = "КромеТоваровСоСкидкой" Тогда
		Если СтруктураСумм.СуммаДокументаБезСкидок - СтруктураСумм.СуммаСтрокСоСкидками > 0 Тогда 
			ПараметрыОперации.Вставить("total",		Формат(СтруктураСумм.СуммаБезСкидок - СтруктураСумм.СуммаСтрокСоСкидками, "ЧГ="));
			ПараметрыОперации.Вставить("cash",		Формат(СтруктураСумм.СуммаБезСкидок - СтруктураСумм.СуммаСтрокСоСкидками - СтруктураСумм.СуммаСкидкиБонусами, "ЧГ="));
			ПараметрыОперации.Вставить("points",	Формат(СтруктураСумм.СуммаСкидкиБонусами, "ЧН=0; ЧГ="));
			ПараметрыОперации.Вставить("number",	Транслитерация(ДокОбъект.Номер));
		Иначе // Весь товар скидочный
			ПараметрыОперации.Вставить("total",		"0,01");
			ПараметрыОперации.Вставить("cash",		"0,01");
			ПараметрыОперации.Вставить("points",	"0");
			ПараметрыОперации.Вставить("number",	Транслитерация(ДокОбъект.Номер));
		КонецЕсли;
		
	КонецЕсли;
			
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("receipt", ПараметрыОперации);
	
	Если ЗначениеЗаполнено(ДокОбъект.UDS_КодСкидки) И СтрДлина(ДокОбъект.UDS_КодСкидки) = 6 Тогда
		ПараметрыПередачи.Вставить("code", ДокОбъект.UDS_КодСкидки);
		
	ИначеЕсли ЗначениеЗаполнено(ДокОбъект.UDS_НомерТелефона) И СтрДлина(ДокОбъект.UDS_НомерТелефона) = 10 Тогда
		СтруктураПартипанта = Новый Структура;
		СтруктураПартипанта.Вставить("phone", "+7" + ДокОбъект.UDS_НомерТелефона);
		ПараметрыПередачи.Вставить("participant", СтруктураПартипанта);
	КонецЕсли;
	ПараметрыКассира = Новый Структура;
	//ПараметрыКассира.Вставить("externalId", Транслитерация(ДокОбъект.Менеджер));
	ПараметрыКассира.Вставить("externalId", ?(ЗначениеЗаполнено(ДокОбъект.Менеджер), Транслитерация(ДокОбъект.Менеджер), Транслитерация(ДокОбъект.Автор)));
	ПараметрыПередачи.Вставить("cashier", ПараметрыКассира);
	
	ИдентификаторОперации = UDS_ОбщийМодульКлиентСервер.ОтразитьОперациюНаСервереUDS(ДокОбъект.Организация, ПараметрыПередачи);
	Если ИдентификаторОперации = Неопределено тогда
		Отказ = Истина;
		Сообщить("Не удалось передать информацию на сервер UDS");
		Возврат 2;
	Иначе
		ДокОбъект.UDS_СуммаСкидки = СтруктураСумм.СуммаСкидкиБонусами;
		ДокОбъект.UDS_ДатаОперации = ТекущаяДата();
		ДокОбъект.UDS_ИдентификаторОперации = ИдентификаторОперации;
		Возврат 1;
	КонецЕсли;
	
КонецФункции

// Функция - ПередатьВозврат
//
// Параметры:
//  ДокОбъект	 - 	 документ  
// 
// Возвращаемое значение:
//   0 - не требуется отражение (либо уже отправлено) 
//   1 - успешно отправлено
//   2 - ошибка
//
Функция ПередатьВозврат(ДокОбъект) Экспорт	
	
	СтруктураДокументов = Новый Массив;
	Для каждого СтрокаТЧ из ДокОбъект.Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ДокументПродажи) И НЕ ЗначениеЗаполнено(СтрокаТЧ.UDS_ИдентификаторОперации) Тогда
			СтруктураДокументов.Добавить(Новый Структура("ДокументПродажи, СуммаВозврата", 
											СтрокаТЧ.ДокументПродажи, СтрокаТЧ.Сумма + СтрокаТЧ.БонусыКНачислению));
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураДокументов.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	ТаблицаТранзакций = UDS_ОбщийМодульВызовСервера.ПолучитьДанныеПоТранзакциям(СтруктураДокументов);
	// ТаблицаТранзакций - массив структур(ДокументПродажи , СуммаВозврата, ИдентификаторОперации)
	Если ТаблицаТранзакций.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	ЕстьУспешные = Ложь;
	
	Для каждого СтруктураТранзации из ТаблицаТранзакций Цикл
		ИдентификаторОперации = UDS_ОбщийМодульКлиентСервер.ОтразитьВозвратНаСервереUDS(ДокОбъект.Организация, СтруктураТранзации.ИдентификаторОперации, СтруктураТранзации.СуммаВозврата);
		Если ИдентификаторОперации = Неопределено тогда
			Отказ = Истина;
			Сообщить("Не удалось передать информацию на сервер UDS");
		Иначе
			СтруктураПоиска = Новый Структура("ДокументПродажи", СтрокаТЧ.ДокументПродажи);
			НайденныеСтроки = ДокОбъект.Товары.НайтиСтроки(СтруктураПоиска);
			Для каждого СтрокаТЧ из НайденныеСтроки Цикл
				СтрокаТЧ.UDS_ДатаОперации = ТекущаяДата();
				СтрокаТЧ.UDS_ИдентификаторОперации = ИдентификаторОперации;
			КонецЦикла;
			ЕстьУспешные = Истина;
		КонецЕсли;
	КонецЦикла;

	Если ЕстьУспешные Тогда
		Возврат 1;
	ИначеЕсли Отказ Тогда
		Возврат 2;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Транслитерация(Слово) Экспорт

	 НовоеСлово= "";
	 спТранслит = Новый СписокЗначений;
	 
	 спТранслит.Добавить("й","j");
	 спТранслит.Добавить("ц","c");
	 спТранслит.Добавить("у","u");
	 спТранслит.Добавить("к","k");
	 спТранслит.Добавить("е","e");
	 спТранслит.Добавить("н","n");
	 спТранслит.Добавить("г","g");
	 спТранслит.Добавить("ш","sh");
	 спТранслит.Добавить("щ","sch");
	 спТранслит.Добавить("з","z");
	 спТранслит.Добавить("х","h");
	 спТранслит.Добавить("ъ","_");
	 спТранслит.Добавить("ф","f");
	 спТранслит.Добавить("ы","y");
	 спТранслит.Добавить("в","v");
	 спТранслит.Добавить("а","a"); 
	 спТранслит.Добавить("п","p"); 
	 спТранслит.Добавить("р","r"); 
	 спТранслит.Добавить("о","o"); 
	 спТранслит.Добавить("л","l"); 
	 спТранслит.Добавить("д","d"); 
	 спТранслит.Добавить("ж","zh"); 
	 спТранслит.Добавить("э","je"); 
	 спТранслит.Добавить("я","ja"); 
	 спТранслит.Добавить("ч","ch"); 
	 спТранслит.Добавить("с","s"); 
	 спТранслит.Добавить("м","m"); 
	 спТранслит.Добавить("и","i"); 
	 спТранслит.Добавить("т","t"); 
	 спТранслит.Добавить("ь","_"); 
	 спТранслит.Добавить("б","b"); 
	 спТранслит.Добавить("ю","ju");
	 спТранслит.Добавить("ё","jo");
	 //////Укр
	 ////спТранслит.Добавить("je","є");
	 ////спТранслит.Добавить("i'","ї");
	 ////спТранслит.Добавить("i","і");
	 //Лат
	 спТранслит.Добавить("i","i"); 
	 спТранслит.Добавить("q","q");
	 спТранслит.Добавить("w","w");
	 спТранслит.Добавить("e","e");
	 спТранслит.Добавить("r","r");
	 спТранслит.Добавить("t","t");
	 спТранслит.Добавить("y","y");
	 спТранслит.Добавить("u","u");
	 спТранслит.Добавить("i","i");
	 спТранслит.Добавить("o","o");
	 спТранслит.Добавить("p","p");
	 спТранслит.Добавить("","");
	 спТранслит.Добавить("a","a");
	 спТранслит.Добавить("s","s");
	 спТранслит.Добавить("d","d");
	 спТранслит.Добавить("f","f");
	 спТранслит.Добавить("g","g");
	 спТранслит.Добавить("h","h");
	 спТранслит.Добавить("j","j");
	 спТранслит.Добавить("k","k");
	 спТранслит.Добавить("l","l");
	 спТранслит.Добавить("z","z");
	 спТранслит.Добавить("x","x");
	 спТранслит.Добавить("c","c");
	 спТранслит.Добавить("v","v");
	 спТранслит.Добавить("b","b");
	 спТранслит.Добавить("n","n");
	 спТранслит.Добавить("m","m");
	  
	 спТранслит.Добавить(" ","_");
	 спТранслит.Добавить("""","""");
	 спТранслит.Добавить("-","_");
	 спТранслит.Добавить(".","_");
	 спТранслит.Добавить(",","_");
	 спТранслит.Добавить("/","_");
	 спТранслит.Добавить("\","_");
	 спТранслит.Добавить("*","_");
	 спТранслит.Добавить("#","_");  
	 спТранслит.Добавить("#","_"); 
	 спТранслит.Добавить("|","_"); 
	 
	 спТранслит.Добавить("!","_"); 
	 спТранслит.Добавить("?","_"); 
	 
	 спТранслит.Добавить("$","_"); 
	 спТранслит.Добавить("%","_"); 
	 спТранслит.Добавить("@","_"); 
	 спТранслит.Добавить("&","_"); 
	 спТранслит.Добавить("=","_"); 
	 спТранслит.Добавить("+","_"); 
	 
	 спТранслит.Добавить("~","_"); 
	 спТранслит.Добавить("'","_"); 
	 спТранслит.Добавить("`","_"); 
	 спТранслит.Добавить(":","_"); 
	 спТранслит.Добавить(";","_"); 
	 
	 спТранслит.Добавить("(","_");
	 спТранслит.Добавить(")","_");  
	 спТранслит.Добавить("[","_"); 
	 спТранслит.Добавить("]","_");  
	 спТранслит.Добавить("}","_"); 
	 спТранслит.Добавить("{","_");
	 спТранслит.Добавить("0","0");
	 спТранслит.Добавить("1","1");
	 спТранслит.Добавить("2","2");
	 спТранслит.Добавить("3","3");
	 спТранслит.Добавить("4","4");
	 спТранслит.Добавить("5","5");
	 спТранслит.Добавить("6","6");
	 спТранслит.Добавить("7","7");
	 спТранслит.Добавить("8","8");  
	 спТранслит.Добавить("9","9");
	 Для а=1 по СтрДлина(Слово) Цикл
	  НовоеСлово = НовоеСлово + спТранслит.НайтиПоЗначению(НРЕГ(Сред(Слово,а,1)));
	 КонецЦикла; 
	 
	 Возврат НРЕГ(НовоеСлово);
	
 КонецФункции
 
#КонецОбласти

