
&НаСервере
Процедура ПоказатьСлужебныеНаСервере()
    Эл = Элементы.ФормаПоказатьСлужебные;
    
    Список.Отбор.Элементы.Очистить();
    
    //{ ИА_Аврамов 30.06.2015
    // Надо обработать нормально, с учетом режима совместимости и галки "пользов. настройки"
    Попытка
        Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
    Исключение
        ТекстОшибки = ОписаниеОшибки();
    КонецПопытки; 
    //} 
    
    Элемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СлужебнаяНастройка");
    Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    Элемент.ПравоеЗначение = Эл.Пометка;
    Элемент.Использование = истина;
    
    Элементы.СписокПостов.Видимость = Эл.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСлужебные(Команда)
    Эл = Элементы.ФормаПоказатьСлужебные;
    
    Эл.Пометка = НЕ Эл.Пометка;
    
    ПоказатьСлужебныеНаСервере();
    
    Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Эл = СписокПостов.Параметры.Элементы.Найти("НастройкаСтатистик");
    Если Эл <> Неопределено Тогда
        Эл.Значение = 0;
        Эл.Использование = Истина;
    КонецЕсли; 
    
    Элементы.СписокПостов.Видимость = Ложь;
	
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
    ТекСтрока = Элемент.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        Эл = СписокПостов.Параметры.Элементы.Найти("НастройкаСтатистик");
        Если Эл <> Неопределено Тогда
            Эл.Значение = ТекСтрока.Ссылка;;
            Эл.Использование = Истина;
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СписокПостовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    ТекСтрока = Элемент.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
    	ПоказатьЗначение(, ТекСтрока.Пост);
    КонецЕсли; 
КонецПроцедуры
