Процедура ПриСозданииНаСервере(Форма, Объект) Экспорт

	СписокРеквизитовФормы = Форма.ПолучитьРеквизиты();
	ИмяРеквизитаТаблицы = "КонтрольЗаполненияОписаниеДополнительныхРеквизитов";
	
	СоздатьТаблицуКонтроля = Истина;
	Для Каждого Реквизит Из СписокРеквизитовФормы Цикл		
		Если Реквизит.Имя = ИмяРеквизитаТаблицы Тогда
			СоздатьТаблицуКонтроля = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	Если СоздатьТаблицуКонтроля Тогда
		Строка500 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500));

		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИмяРеквизита", Строка500, ИмяРеквизитаТаблицы));		
	
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	
	// контроль заполнения реквизитов - АвтоОтметкаНезаполненного
	УстановитьАвтоОтметкуНезаполненного(Форма, Объект);
		
КонецПроцедуры

Процедура ПриИзмененииВлияющихРеквизитов(Форма, Объект) Экспорт
	
	// снимаем отметку незаполненного
	Для каждого РанееКонтролируемыйРеквизит из Форма.КонтрольЗаполненияОписаниеДополнительныхРеквизитов Цикл		
		Элемент = Форма.Элементы.Найти(РанееКонтролируемыйРеквизит.ИмяРеквизита);
		Если НЕ Элемент = Неопределено Тогда
			Элемент.АвтоОтметкаНезаполненного = Неопределено;
			Элемент.ОтметкаНезаполненного = Ложь;
		КонецЕсли;
	КонецЦикла;
	Форма.КонтрольЗаполненияОписаниеДополнительныхРеквизитов.Очистить();

	УстановитьАвтоОтметкуНезаполненного(Форма, Объект);
			
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Форма, Объект, Отказ) Экспорт
	
	//Если Источник.ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//// если нужно отключить контроль при программной записи
	//Если Источник.ДополнительныеСвойства.Свойство("ОтключитьКонтрольРеквизитов") Тогда
	//	Возврат;	
	//КонецЕсли;
	
	ИсточникМетаданные = Объект.Ссылка.Метаданные();
	
	ШаблонСообщения = "Поле ""%ПредставлениеРеквизита%"" не заполнено";
	ШаблонСообщенияУникальности = "Не пройден контроль уникальности. Имеется объект со схожими полями: ""%Ссылка%"". Поля контроля: %ПоляКонтроля%";
	
	// контроль заполнения реквизитов
	КонтролируемыеРеквизиты = РегистрыСведений.РеквизитыДляКонтроля.КонтролируемыеРеквизитыПроверкиЗаполнения(Объект);
	
	Для каждого КонтролируемыйРеквизит из КонтролируемыеРеквизиты Цикл
				
		Если КонтролируемыйРеквизит = "Контактная информация.Телефон" ИЛИ КонтролируемыйРеквизит = "Контактная информация.Email" Тогда
			Для каждого СтрокаТаблицы из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл				
				ВидИнформации = СтрокаТаблицы.Вид;
				ИмяРеквизита  = СтрокаТаблицы.ИмяРеквизита;
				
				Если ВидИнформации.ОбязательноеЗаполнение ИЛИ ЗначениеЗаполнено(Форма[ИмяРеквизита]) Тогда
					Продолжить;
				КонецЕсли;
				
				Если (ВидИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента И КонтролируемыйРеквизит = "Контактная информация.Телефон") 
					ИЛИ (ВидИнформации = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента И КонтролируемыйРеквизит = "Контактная информация.Email") Тогда					
					СообщениеОбОшибке = СтрЗаменить(ШаблонСообщения, "%ПредставлениеРеквизита%", ВидИнформации.Наименование);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, , , ИмяРеквизита, Отказ);
				КонецЕсли;
			КонецЦикла;
			
		Иначе			
			Если ЗначениеЗаполнено(Объект[КонтролируемыйРеквизит]) Тогда
				Продолжить;
			КонецЕсли;
			
			Если КонтролируемыйРеквизит = "Родитель" Тогда
				ПредставлениеРеквизита = "Группа";
			Иначе
				Реквизит = ИсточникМетаданные.Реквизиты.Найти(КонтролируемыйРеквизит);
				ПредставлениеРеквизита = Реквизит.Синоним;
			КонецЕсли;
			
			СообщениеОбОшибке = СтрЗаменить(ШаблонСообщения, "%ПредставлениеРеквизита%", ПредставлениеРеквизита);	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, , "Объект." + КонтролируемыйРеквизит, , Отказ);
			
		КонецЕсли;
			
	КонецЦикла;
	
	// проверяем условие уникальности
	КонтролируемыеРеквизиты = РегистрыСведений.РеквизитыДляКонтроля.КонтролируемыеРеквизитыУникальности(Объект);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ТекстЗапроса =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|	%КонтактнаяИнформацияСтроки
	|ИЗ
	|	%Таблица КАК ДанныеСправочника
	|	%КонтактнаяИнформация
	|ГДЕ
	|	НЕ ДанныеСправочника.ЭтоГруппа
	|	И ДанныеСправочника.Ссылка <> &Ссылка
	|	И (%Условия)";
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Таблица", "Справочник.Номенклатура");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%КонтактнаяИнформацияСтроки", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%КонтактнаяИнформация", "");
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Таблица", "Справочник.Контрагенты");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%КонтактнаяИнформацияСтроки", ", ЕСТЬNULL(КонтактныйТелефон.Представление, """") КАК Телефон, ЕСТЬNULL(КонтактныйEmail.Представление, """") КАК Email");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%КонтактнаяИнформация", "ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактныйТелефон
		                                                                |   ПО КонтактныйТелефон.Ссылка = ДанныеСправочника.Ссылка
																		|		И КонтактныйТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
																		|		И КонтактныйТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
																		|  ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактныйEmail
		                                                                |   ПО КонтактныйEmail.Ссылка = ДанныеСправочника.Ссылка
																		|		И КонтактныйEmail.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
																		|		И КонтактныйEmail.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)");
	КонецЕсли;
	
	Условия = "";
	ПоляКонтроля = "";
	Для каждого КонтролируемыйРеквизит из КонтролируемыеРеквизиты Цикл
		ИмяКонтролируемогоРеквизита = КонтролируемыйРеквизит.ИмяРеквизита;
		
		Если ИмяКонтролируемогоРеквизита = "Контактная информация.Телефон" ИЛИ ИмяКонтролируемогоРеквизита = "Контактная информация.Email" Тогда
			
			Для каждого СтрокаТаблицы из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл				
				ВидИнформации = СтрокаТаблицы.Вид;
				ИмяРеквизитаКИ  = СтрокаТаблицы.ИмяРеквизита;
				
				Если НЕ ЗначениеЗаполнено(Форма[ИмяРеквизитаКИ]) Тогда
					Продолжить;
				КонецЕсли;
				
				Если (ВидИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента И ИмяКонтролируемогоРеквизита = "Контактная информация.Телефон") Тогда										
					
					Условия = Условия + ?(ПустаяСтрока(Условия), "", " ИЛИ ");
					Условия = Условия + "ЕСТЬNULL(КонтактныйТелефон.Представление, """") = &" + ИмяРеквизитаКИ; // на случай если несколько элементов КИ
					
					ПоляКонтроля = ПоляКонтроля + ?(ПустаяСтрока(ПоляКонтроля), "", ", ");
					ПоляКонтроля = ПоляКонтроля + "Телефон";
					
					Запрос.УстановитьПараметр(ИмяРеквизитаКИ, Форма[ИмяРеквизитаКИ]);
					
				ИначеЕсли (ВидИнформации = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента И ИмяКонтролируемогоРеквизита = "Контактная информация.Email") Тогда
					Условия = Условия + ?(ПустаяСтрока(Условия), "", " ИЛИ ");
					Условия = Условия + "ЕСТЬNULL(КонтактныйEmail.Представление, """") = &" + ИмяРеквизитаКИ;
					
					ПоляКонтроля = ПоляКонтроля + ?(ПустаяСтрока(ПоляКонтроля), "", ", ");
					ПоляКонтроля = ПоляКонтроля + "Email" ;
					
					Запрос.УстановитьПараметр(ИмяРеквизитаКИ, Форма[ИмяРеквизитаКИ]);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			Если НЕ ЗначениеЗаполнено(Объект[ИмяКонтролируемогоРеквизита]) Тогда
				// пустые поля на уникальность не проверяем
				Продолжить;
			КонецЕсли;
			
			ЗнакСравнения = " = ";
			Если НЕ ИмяКонтролируемогоРеквизита = "Родитель" Тогда
				Реквизит = ИсточникМетаданные.Реквизиты.Найти(ИмяКонтролируемогоРеквизита);
				Если НЕ Реквизит = Неопределено Тогда
					Если Реквизит.Тип = Новый ОписаниеТипов("Строка") Тогда
						ЗнакСравнения = " ПОДОБНО ";	
					КонецЕсли;
				КонецЕсли;					
			КонецЕсли;
			Условия = Условия + ?(ПустаяСтрока(Условия), "", " ИЛИ ");
			Условия = Условия + "ДанныеСправочника." + ИмяКонтролируемогоРеквизита + ЗнакСравнения + "&" + ИмяКонтролируемогоРеквизита;
			
			ПоляКонтроля = ПоляКонтроля + ?(ПустаяСтрока(ПоляКонтроля), "", ", ");
			ПоляКонтроля = ПоляКонтроля + КонтролируемыйРеквизит.ПредставлениеРеквизита;
			
			Запрос.УстановитьПараметр(ИмяКонтролируемогоРеквизита, Объект[ИмяКонтролируемогоРеквизита]);
			
		КонецЕсли;
	КонецЦикла;
	Если ПустаяСтрока(Условия) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условия", Условия);
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда	
		СообщениеОбОшибке = СтрЗаменить(ШаблонСообщенияУникальности, "%Ссылка%", Выборка.Ссылка);
		СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%ПоляКонтроля%", ПоляКонтроля);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, , , , Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьАвтоОтметкуНезаполненного(Форма, Объект)

	// контроль заполнения реквизитов - АвтоОтметкаНезаполненного
	КонтролируемыеРеквизиты = РегистрыСведений.РеквизитыДляКонтроля.КонтролируемыеРеквизитыПроверкиЗаполнения(Объект);	
		
	Для каждого КонтролируемыйРеквизит из КонтролируемыеРеквизиты Цикл
		Если СтрНайти(КонтролируемыйРеквизит, "Контактная информация.") = 0 Тогда
			
			Если НЕ КонтролируемыйРеквизит = "Родитель" Тогда
				Реквизит = Объект.Ссылка.Метаданные().Реквизиты.Найти(КонтролируемыйРеквизит);
			Иначе				
				Реквизит = Объект.Ссылка.Метаданные().СтандартныеРеквизиты[КонтролируемыйРеквизит];				
			КонецЕсли;
			Если Реквизит = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			// заполнение контролируется платформенно, пропускаем
			Если Реквизит.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементФормы = Форма.Элементы.Найти(КонтролируемыйРеквизит);
			Если НЕ ЭлементФормы = Неопределено Тогда
				ЭлементФормы.АвтоОтметкаНезаполненного = Истина;				
				НоваяСтрока = Форма.КонтрольЗаполненияОписаниеДополнительныхРеквизитов.Добавить();
				НоваяСтрока.ИмяРеквизита = КонтролируемыйРеквизит;
			КонецЕсли;
			
		Иначе
			
			Для каждого СтрокаТаблицы из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл				
				ВидИнформации = СтрокаТаблицы.Вид;
				ИмяРеквизита  = СтрокаТаблицы.ИмяРеквизита;
				
				Если ВидИнформации.ОбязательноеЗаполнение Тогда
					Продолжить;
				КонецЕсли;
				
				Если (ВидИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента И КонтролируемыйРеквизит = "Контактная информация.Телефон") 
					ИЛИ (ВидИнформации = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента И КонтролируемыйРеквизит = "Контактная информация.Email") Тогда					
					
					ЭлементФормы = Форма.Элементы.Найти(СтрокаТаблицы.ИмяРеквизита);
					Если НЕ ЭлементФормы = Неопределено Тогда
						ЭлементФормы.АвтоОтметкаНезаполненного = Истина;				
						НоваяСтрока = Форма.КонтрольЗаполненияОписаниеДополнительныхРеквизитов.Добавить();
						НоваяСтрока.ИмяРеквизита = СтрокаТаблицы.ИмяРеквизита;
					КонецЕсли;
			
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры