
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Результат = Новый Структура;
	Результат.Вставить("Отправить", Ложь);
	ЭтаФорма.Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Если ПустаяСтрока(НомерТелефона) Тогда
		ПоказатьПредупреждение(,"Введите номер телефона получателя сообщения в международном формате");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		ПоказатьПредупреждение(,"Введите текст сообщения");
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Отправить", Истина);
	Результат.Вставить("Получатель", НомерТелефона);
	Результат.Вставить("Текст", ТекстСообщения);
	ЭтаФорма.Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НомерТелефона = Параметры.НомерТелефона;
	
КонецПроцедуры
