
// НАЧАЛО: №1842, удалили ТЧ
//&НаКлиенте
//Процедура ЗаполнитьПоГруппе(Команда)
//	ГруппаНоменклатуры = ОткрытьФормуМодально("Справочник.Номенклатура.ФормаВыбораГруппы");
//	Если ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда 
//		ЗаполнитьПоГруппеНаСервере(ГруппаНоменклатуры);
//	КонецЕсли;	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьПоГруппеНаСервере(ГруппаНоменклатуры)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	Номенклатура.Ссылка КАК Номенклатура,
//	|	Номенклатура.ВидНоменклатуры
//	|ИЗ
//	|	Справочник.Номенклатура КАК Номенклатура
//	|ГДЕ
//	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры)
//	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Номенклатура";
//	Запрос.УстановитьПараметр("ГруппаНоменклатуры", ГруппаНоменклатуры);
//	Результат = Запрос.Выполнить();
//	Если Результат.Пустой() Тогда 
//		Сообщить ("Выбранная папка Номенклатуры пустая", СтатусСообщения.Важное);
//		Возврат;
//	Иначе
//		Выборка = Запрос.Выполнить().Выбрать();
//		Пока Выборка.Следующий() Цикл
//			НоваяСтрока = Объект.СписокНоменклатуры.Добавить();
//			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
//			НоваяСтрока.ВидНоменклатуры = Выборка.ВидНоменклатуры;
//		КонецЦикла;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВсеПоВыработке(Команда)
//	Для Каждого ТекущаяСтрока Из Объект.СписокНоменклатуры Цикл
//		ТекущаяСтрока.КоличествоПоВыработке = Истина;
//	КонецЦикла;
//КонецПроцедуры

//&НаКлиенте
//Процедура ВсеПоКоличеству(Команда)
//	Для Каждого ТекущаяСтрока Из Объект.СписокНоменклатуры Цикл
//		ТекущаяСтрока.КоличествоПоВыработке = Ложь;
//	КонецЦикла;
//КонецПроцедуры

//&НаСервере
//Функция  ПолучитьВидНоменклатуры(Номенклатура)
//	Если ЗначениеЗаполнено(Номенклатура) Тогда
//		Возврат Номенклатура.ВидНоменклатуры;
//	КонецЕсли;
//	Возврат Справочники.ВидыНоменклатуры.ПустаяСсылка();	
//КонецФункции

//&НаКлиенте
//Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
//	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
//	Если ТекДанные <> Неопределено Тогда
//		ТекДанные.ВидНоменклатуры = ПолучитьВидНоменклатуры(ТекДанные.Номенклатура);	
//	КонецЕсли;
//КонецПроцедуры

//&НаСервере
//Функция ПроверитьНоменклатуруНаСервере()
//	Отказ = Ложь;
//	Для каждого Строка Из Объект.СписокНоменклатуры Цикл
//		
//		Если ЗначениеЗаполнено(Строка.Номенклатура) И Строка.Номенклатура.ВидНоменклатуры <> Строка.ВидНоменклатуры Тогда
//			Сообщить("Номер строки " + Строка.НомерСтроки + ". Не совпадает значение вида номенклатуры в таблице с видом самой номенклатуры.");
//			Отказ = Истина;
//		КонецЕсли;
//		
//	КонецЦикла;
//	Возврат Отказ;
//КонецФункции

//&НаКлиенте
//Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//	Отказ = ПроверитьНоменклатуруНаСервере();
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьОбщуюСтоимостьПоСтроке(Команда)
//	Если Элементы.СписокНоменклатуры.ТекущиеДанные <> Неопределено Тогда
//		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОтветУстановитьОбщуюСтоимость", ЭтаФорма, Элементы.СписокНоменклатуры.ТекущиеДанные.НомерСтроки);
//		ПоказатьВопрос(ОписаниеОповещенияВопрос, "Установить общую стоимость по строке для всех видов продукции?", РежимДиалогаВопрос.ДаНет);
//	КонецЕсли;	
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьОбщуюСтоимость(Команда)
//	
//	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОтветУстановитьОбщуюСтоимость", ЭтаФорма);
//	ПоказатьВопрос(ОписаниеОповещенияВопрос,"Установить общую стоимость для всех видов продукции?", РежимДиалогаВопрос.ДаНет);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОтветУстановитьОбщуюСтоимость(Результат, ДополнительныеПараметры) Экспорт
//    Если Результат = КодВозвратаДиалога.Нет Тогда
//        Возврат;
//    КонецЕсли;

//	ОписаниеОповещенияВыборСтоимости = Новый ОписаниеОповещения("УстановитьСтоимостьПослеВыбора",ЭтаФорма, ДополнительныеПараметры);
//	ПоказатьВводЗначения(ОписаниеОповещенияВыборСтоимости, 0.00, "Введите стоимость");
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьСтоимостьПослеВыбора(ВыбЗнач, ДополнительныеПараметры) Экспорт
//	Если ВыбЗнач = Неопределено Тогда
//		Возврат;	
//	КонецЕсли;
//	
//	Для Каждого СтрокаТЧ из Объект.СписокНоменклатуры Цикл
//		Если ДополнительныеПараметры = Неопределено ИЛИ ДополнительныеПараметры = СтрокаТЧ.НомерСтроки Тогда		 
//			СтрокаТЧ.СтоимостьВыработкиПотолок = ВыбЗнач;
//			СтрокаТЧ.СтоимостьВыработкиОтрез = ВыбЗнач;
//			СтрокаТЧ.СтоимостьВыработкиМногофактурныйПотолок = ВыбЗнач;
//			СтрокаТЧ.СтоимостьВыработкиМногофактурныйОтрез = ВыбЗнач;
//		КонецЕсли;
//	КонецЦикла;
//КонецПроцедуры
// КОНЕЦ: №1842, удалили ТЧ

//&НаСервере
//Функция ПараметрыШК()
//	
//	//Сформируем ш/к [88][КодОперации(последние 5)] [00000]		
//	КодОперации = Формат(Прав(Объект.Код, 5), "ЧЦ=5; ЧВН=; ЧГ=");
//	Штрихкод = "88" + КодОперации + "00000";
//	Штрихкод = Штрихкод + ОбщийМодульВызовСервера.КонтрольныйСимволEAN(ШтрихКод, 13);
//	Возврат Новый Структура("ЗначениеКода, Заголовок", Штрихкод, Строка(Объект.Наименование));
//	
//КонецФункции

&НаКлиенте
Процедура ПечатьШК(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И Не Модифицированность Тогда
		// #13536
		//ПараметрыШК = ПараметрыШК();
		ПараметрыШК = ШтрихкодированиеПотолкиКлиент.ПараметрыШК(2, , Объект.Ссылка);
		ОбщийМодульКлиент.ОткрытьФормуПечатиШК(ПараметрыШК.ЗначениеКода, , ПараметрыШК.Заголовок);
	Иначе	
		Сообщить("Предварительно необходимо записать элемент!");
	КонецЕсли;
	
КонецПроцедуры
