
Функция ПолучитьСебестоимостьНоменклатурыОрганизации(Знач ДатаОстатков, Знач Организация, Знач Номенклатура, Знач Склад = Неопределено, Знач ХарактеристикаНоменклатуры = Неопределено, Знач СерияНоменклатуры = Неопределено) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ТоварыНаСкладахОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ДатаОстатков,
	|				Организация = &Организация
	|				И Номенклатура = &Номенклатура";
	Если НЕ Склад = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
	|				И Склад = &Склад";
	КонецЕсли;
	Если НЕ ХарактеристикаНоменклатуры = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	КонецЕсли;
	Если НЕ СерияНоменклатуры = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
	|				И СерияНоменклатуры = &СерияНоменклатуры";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|) КАК ТоварыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("ДатаОстатков",ДатаОстатков);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("СерияНоменклатуры",СерияНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.КоличествоОстаток = 0 Тогда
			Результат = Окр(Выборка.СуммаОстаток / Выборка.КоличествоОстаток,2); 
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции