

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ПараметрСКД_ДатаНачала = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	//ПараметрСКД_ДатаНачала.Использование = Истина;
	//ПараметрСКД_ДатаНачала.Значение = НачалоНедели(ТекущаяДата());
	//
	//ПараметрСКД_ДатаКонца = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	//ПараметрСКД_ДатаКонца.Использование = Истина;
	//ПараметрСКД_ДатаКонца.Значение = КонецНедели(ТекущаяДата());
КонецПроцедуры

