
&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)
	ОтображениеПодразделений();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтображениеПодразделений();
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПодразделений()
	Элементы.Подразделения.Видимость = Объект.ОтображатьВСписке и Элементы.ОтображатьВСписке.Видимость;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если (не Объект.Ссылка.Счет.Пустая()) И ТекущийОбъект.Счет <> Объект.Ссылка.Счет Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ИА_СредстваНаФондах.Регистратор
	//	               |ИЗ
	//	               |	РегистрНакопления.ИА_СредстваНаФондах КАК ИА_СредстваНаФондах
	//	               |ГДЕ
	//	               |	ИА_СредстваНаФондах.Фонд = &Фонд";
	//	Запрос.УстановитьПараметр("Фонд", Объект.Ссылка);
	//	Если не Запрос.Выполнить().Пустой() Тогда
	//		Отказ = Истина;
	//		Сообщить("По данной статье есть обороты. Счет нельзя менять!");
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЕстьВеб = КСУ_ВебПИ.ЕстьИнтеграцияВеб();
	ЕстьВеб = ложь;
	ФП_по_ТБ = ИА_ФП_ПовторИсп.ФП_по_ТБ(ТекущаяДата());
	
	Элементы.ВебУИД.Видимость =  ЕстьВеб;
	Элементы.ОтображатьВСписке.Видимость =  не ФП_по_ТБ;

	Если ЗначениеЗаполнено(объект.Счет) тогда
		//Элементы.Счет.Доступность = (ИА_ПраваС.ЗначениеПраваТекПользователя("УтверждениеТБ") ИЛИ ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_ПолныеПрава"));
	Иначе
		объект.Счет = Справочники.ИА_Счета.ГлавныйСчет;
	КонецЕсли;
	
	Элементы.Защищенный.Доступность = (ИА_ПраваС.ЗначениеПраваТекПользователя("УтверждениеТБ") ИЛИ ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_ПолныеПрава"));
КонецПроцедуры
