
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = Константы.ИспользоватьПодключаемоеОборудование.Получить();
	ИспользоватьСтатусы = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыСборкиЗаказовПокупателей");
	
	ТекущийЭлемент = Элементы.ИмитацияШК;
	Действие = Параметры.Действие;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;

	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда 
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияПотолкиКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;	
	КонецЕсли; 
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИмитацияШКПриИзменении(Элемент)
	
	ПараметрыКОтправке = Новый Массив;
	ПараметрыКОтправке.Добавить(ИмитацияШК);
	ПараметрыКОтправке.Добавить(Неопределено);
	ОбработкаОповещения("ScanData", ПараметрыКОтправке, "ПодключаемоеОборудование");
	ИмитацияШК = "";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	//Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
	//	Возврат;
	//КонецЕсли;
	
	СтруктураРезультата = ОбщийМодульКлиент.РМРаботникаСклада_ОписаниеДействия(Действие, ИспользоватьСтатусы, Сотрудник);
	
	Закрыть(СтруктураРезультата);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
		
	// штрихкод сотрудника
	ОчиститьСообщения();
	ДанныеПоШК = ШтрихкодированиеПотолкиКлиент.ОбработатьШтрихкод(Данные.Штрихкод, 1);		
	Если НЕ ДанныеПоШК = Неопределено Тогда
		Сотрудник = ДанныеПоШК.Сотрудник;
		ОК(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
