
#Область СправочникСотрудники

Функция ПечатьШКСотрудника(ОписаниеКоманды) Экспорт
	
	ПараметрыФормы = Новый Структура("Печать", Истина);
	ДополнительныеПараметры = Новый Структура("ОписаниеКоманды", ОписаниеКоманды);
	
	Если ТипЗнч(ОписаниеКоманды.ОбъектыПечати) = Тип("Массив") 
		И ОписаниеКоманды.ОбъектыПечати.Количество() > 0 Тогда
		ПараметрыШК = ШтрихкодированиеПотолкиКлиент.ПараметрыШК(1, ОписаниеКоманды.ОбъектыПечати[0]);
		ОбщийМодульКлиент.ОткрытьФормуПечатиШК(ПараметрыШК.ЗначениеКода, , ПараметрыШК.Заголовок);
	КонецЕсли;
	
КонецФункции

Функция ГенерацияШКСотрудникПроизводственнаяОперация(ОписаниеКоманды) Экспорт
		
	ПараметрыФормы = Новый Структура("Сотрудник, РежимПечати", ОписаниеКоманды.ОбъектыПечати[0], 3);

	Если ТипЗнч(ОписаниеКоманды.ОбъектыПечати) = Тип("Массив") 
		И ОписаниеКоманды.ОбъектыПечати.Количество() > 0 Тогда
		ОткрытьФорму(
			"ОбщаяФорма.ФормированиеШтрихкодаПоОперациям", 
			ПараметрыФормы,
		    ОписаниеКоманды.Форма,
			ОписаниеКоманды.Форма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецФункции

//#14908 закомментировано
//Функция ГенерацияШКСотрудникОперацияНадДокументами(ОписаниеКоманды) Экспорт
//		
//	ПараметрыФормы = Новый Структура("Сотрудник, РежимПечати", ОписаниеКоманды.ОбъектыПечати[0], 4);

//	Если ТипЗнч(ОписаниеКоманды.ОбъектыПечати) = Тип("Массив") 
//		И ОписаниеКоманды.ОбъектыПечати.Количество() > 0 Тогда
//		ОткрытьФорму(
//			"ОбщаяФорма.ФормированиеШтрихкодаПоОперациям", 
//			ПараметрыФормы,
//		    ОписаниеКоманды.Форма,
//			ОписаниеКоманды.Форма.УникальныйИдентификатор);
//	КонецЕсли;
//	
//КонецФункции

Функция ГенерацияШКРМ(ОписаниеКоманды) Экспорт
		
	ПараметрыФормы = Новый Структура("Сотрудник, РежимПечати", Неопределено, 50);

	//Если ТипЗнч(ОписаниеКоманды.ОбъектыПечати) = Тип("Массив") 
	//	И ОписаниеКоманды.ОбъектыПечати.Количество() > 0 Тогда
		ОткрытьФорму(
			"ОбщаяФорма.ФормированиеШтрихкодаПоОперациям", 
			ПараметрыФормы,
		    ОписаниеКоманды.Форма,
			ОписаниеКоманды.Форма.УникальныйИдентификатор);
	//КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
