
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Получатели.Количество() = 0 Тогда
		Сообщить("Не указано ни одного получателя");
		Отказ = Истина;
		Отправлено = Ложь;		
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщийМодуль.РасширенныйФункционалДоступен() Тогда
		Отказ = Истина;
		Отправлено = Ложь;		
		Возврат;
	КонецЕсли;
	
	//отправляем СМС
	strLogin = Константы.ЕВостокСМСЛогин.Получить();
	strPass = Константы.ЕВостокСМСПароль.Получить();
	strSpace = Константы.ЕВостокСМСПодпись.Получить();
	numService = Константы.ЕВостокСМСНомерСервиса.Получить();
	
	Если Число(РаботаССМС.ПолучитьБаланс(strLogin, strPass, numService, 1, Истина)) = 0 Тогда
		Сообщить("Баланс отправки СМС равен 0. Отправить СМС не удалось");
		Отказ = Истина;
		Отправлено = Ложь;
		Возврат;
	КонецЕсли;
	
	ТаблицаСМС = Новый ТаблицаЗначений;
	ТаблицаСМС.Колонки.Добавить("ДокументОснование");
	ТаблицаСМС.Колонки.Добавить("Контрагент");
	ТаблицаСМС.Колонки.Добавить("НомерТелефона",Новый ОписаниеТипов("Строка"));
	ТаблицаСМС.Колонки.Добавить("ТекстСообщения",Новый ОписаниеТипов("Строка"));
	ТаблицаСМС.Колонки.Добавить("Отправлено",Новый ОписаниеТипов("Булево"));
	ТаблицаСМС.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
	Для Каждого ТекущаяСтрока Из Получатели Цикл
		НоваяСтрока = ТаблицаСМС.Добавить();
		НоваяСтрока.ДокументОснование = Ссылка;
		НоваяСтрока.Контрагент = ТекущаяСтрока.Контрагент;
		НоваяСтрока.НомерТелефона = ТекущаяСтрока.НомерТелефона;
		НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
		НоваяСтрока.ТекстСообщения = РаботаССМС.ЗаменитьПараметрыВШаблонеСМС(ТекстСообщения, НоваяСтрока);
		НоваяСтрока.Отправлено = Ложь;
	КонецЦикла;
	
	Для Каждого СМС Из ТаблицаСМС Цикл
		Если НЕ СМС.Отправлено = Истина Тогда
			РезультатОтправки = РаботаССМС.ОтправитьСМС(strLogin, strPass, strSpace, СМС.НомерТелефона, СМС.ТекстСообщения, numService, 1);
			Если РезультатОтправки = "OK" Тогда
				СМС.Отправлено = Истина;
			Иначе
				//Запишем в СМС к отправке, т.к. смс не ушла, но её нужно отправить
				НачатьТранзакцию();
				МенеджерЗаписи = РегистрыСведений.СМСКОтправке.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ТекущаяДатаСеанса();
				МенеджерЗаписи.ДокументОснование = СМС.ДокументОснование;
				МенеджерЗаписи.Контрагент = СМС.Контрагент;
				МенеджерЗаписи.ПризнакСМС = Перечисления.ПризнакиСМС.Новая;
				МенеджерЗаписи.Прочитать();
				МенеджерЗаписи.Период = ТекущаяДатаСеанса();
				МенеджерЗаписи.ДокументОснование = СМС.ДокументОснование;
				МенеджерЗаписи.ДатаОтправки = ТекущаяДатаСеанса();
				МенеджерЗаписи.Контрагент = СМС.Контрагент;
				МенеджерЗаписи.ПризнакСМС = Перечисления.ПризнакиСМС.Новая;
				МенеджерЗаписи.ТекстСообщения = СМС.ТекстСообщения;
				МенеджерЗаписи.НомерТелефона = СМС.НомерТелефона;
				МенеджерЗаписи.Записать();
				ЗафиксироватьТранзакцию();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//записываем СМС в журнал отправленных
	Для Каждого СМС Из ТаблицаСМС Цикл
		Если СМС.Отправлено Тогда
			НачатьТранзакцию();
			МенеджерЗаписи = РегистрыСведений.СМСОтправленные.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			МенеджерЗаписи.ДокументОснование = СМС.ДокументОснование;
			МенеджерЗаписи.Контрагент = СМС.Контрагент;
			МенеджерЗаписи.ПризнакСМС = Перечисления.ПризнакиСМС.Новая;
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			МенеджерЗаписи.ДокументОснование = СМС.ДокументОснование;
			МенеджерЗаписи.ДатаОтправки = ТекущаяДатаСеанса();
			МенеджерЗаписи.Контрагент = СМС.Контрагент;
			МенеджерЗаписи.ПризнакСМС = Перечисления.ПризнакиСМС.Новая;
			МенеджерЗаписи.ТекстСообщения = СМС.ТекстСообщения;
			МенеджерЗаписи.НомерТелефона = СМС.НомерТелефона;
			МенеджерЗаписи.Записать();
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(ДанныеЗаполнения);
		
		Основание = ДанныеЗаполнения;
		Дата = ТекущаяДатаСеанса();
		ТекстСообщения = ПолучитьТекстСМСЗаказаПокупателя(ДанныеЗаполнения);
		НоваяСтрока = Получатели.Добавить();
		НоваяСтрока.Контрагент = ДанныеЗаполнения.Контрагент;
		НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(НоваяСтрока.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		НоваяСтрока.НомерТелефона = РаботаССМС.УбратьСимволыИзНомераТелефона(НомерТелефона);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаДоставку") Тогда
		Основание = ДанныеЗаполнения;
		Дата = ТекущаяДатаСеанса();
		ТекстСообщения = ПолучитьТекстСМСЗаявкаНаДоставку(ДанныеЗаполнения);
		НоваяСтрока = Получатели.Добавить();
		НоваяСтрока.Контрагент = ДанныеЗаполнения.Получатель;
		НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(НоваяСтрока.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		НоваяСтрока.НомерТелефона = РаботаССМС.УбратьСимволыИзНомераТелефона(НомерТелефона);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Лид") Тогда // №5385
		
		Основание = ДанныеЗаполнения;
		Дата = ТекущаяДатаСеанса();
		НоваяСтрока = Получатели.Добавить();
		НоваяСтрока.Контрагент = ДанныеЗаполнения.ИмяКлиента;
		НомерТелефона = УправлениеКонтактнойИнформациейПотолки.КонтактнаяИнформацияОбъекта(ДанныеЗаполнения, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		НоваяСтрока.НомерТелефона = РаботаССМС.УбратьСимволыИзНомераТелефона(НомерТелефона);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи);

КонецПроцедуры

Функция ПолучитьТекстСМСЗаказаПокупателя(Заказ)
	
	ТекстСМС = Константы.ШаблонТекстаСМСПоЗаказуПокупателя.Получить();
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Дата", Лев(Заказ.Дата,10));
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Организация", Заказ.Организация);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Контрагент", Заказ.Контрагент);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Сумма", СтрЗаменить(Заказ.СуммаДокумента,Символ(160),""));
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Склад", Заказ.Склад);
	
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Статус", Заказ.ТекущийСтатус);
	
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Адрес", Заказ.АдресМонтажа);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%НомерВхДокумента", Заказ.НомерВходящегоДокументаЭлектронногоОбмена);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%ДатаВхДокумента", Лев(Заказ.ДатаВходящегоДокументаЭлектронногоОбмена,10));
	
	Возврат ТекстСМС;
	
КонецФункции

Функция ПолучитьТекстСМСЗаявкаНаДоставку(Заказ)
	
	ТекстСМС = Константы.ШаблонТекстаСМСПоЗаявкеНаДоставку.Получить();
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Дата", Лев(Заказ.Дата,10));
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Организация", Заказ.Организация);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Получатель", Заказ.Получатель);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%АдресДоставки", Заказ.АдресДоставки);
	
	ТекстСМС = СтрЗаменить(ТекстСМС, "%ТранспортнаяКомпания", Заказ.Экспедитор);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%НомерОтправления", Заказ.НомерОтправления);
	
	ТекстСМС = СтрЗаменить(ТекстСМС, "%СтоимостьДоставки", Заказ.СтоимостьДоставки);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Валюта", Заказ.Валюта);
	
	ТекстСМС = СтрЗаменить(ТекстСМС, "%ОтправленоДата", ?(Заказ.ОтправленоДата = Дата(1,1,1), "", Заказ.ОтправленоДата));
	ТекстСМС = СтрЗаменить(ТекстСМС, "%ДоставленоДата", ?(Заказ.ДоставленоДата = Дата(1,1,1), "", Заказ.ДоставленоДата));

	ТекстСМС = СтрЗаменить(ТекстСМС, "%АвтоГосНомер", Заказ.авто_ГосНомер);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%АвтоМодель", Заказ.авто_Модель);
	
	Возврат ТекстСМС;
	
КонецФункции
	