#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	//#13834
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	//#13834 изменена настройка			
	//Если ПолучитьФункциональнуюОпцию("АвтоматическийУчетБонусов") Тогда
		ДанныеВыбора.Добавить(Справочники.ВидыДокументовНачисленияБонусов.РеализацияТоваровИУслуг);
	//КонецЕсли;
	//Если ПолучитьФункциональнуюОпцию("АвтоматическиНачислятьБонусыВДокументахОплаты") Тогда
		ДанныеВыбора.Добавить(Справочники.ВидыДокументовНачисленияБонусов.ОплатаБанковскойКартой);
		ДанныеВыбора.Добавить(Справочники.ВидыДокументовНачисленияБонусов.ПоступлениеНаРасчетныйСчет);
		ДанныеВыбора.Добавить(Справочники.ВидыДокументовНачисленияБонусов.ПриходныйКассовыйОрдер);
		ДанныеВыбора.Добавить(Справочники.ВидыДокументовНачисленияБонусов.РасходныйКассовыйОрдер);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли