///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыЗаписиПриПроверкеПервогоАдминистратора;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	//++ №14991 унифицируем, чтобы можно было вызывать из нескольких мест
	//ЭтоКарточкаТехподдержки = (Объект.Наименование = "Служба поддержки SmartCeilings");
	//Если ЭтоКарточкаТехподдержки И НЕ Строка(ПараметрыСеанса.ТекущийПользователь) = "Служба поддержки SmartCeilings" Тогда
	//	Сообщить("Нарушение прав доступа");
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	ДанныеПользователя = ОбщийМодульВызовСервера.ПроверитьПользователяТехподдержки(Объект.Наименование);
	
	Потолки_ЭтоКарточкаТехподдержки = ДанныеПользователя.ЭтоКарточкаТехподдержки;
	
	Если Потолки_ЭтоКарточкаТехподдержки И НЕ ДанныеПользователя.ТекущийСеансПоддержки Тогда
		Сообщить("Нарушение прав доступа");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//-- №14991
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		
		ДоступноИзменениеПользователей = Истина;
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ПользователиВМоделиСервиса") Тогда
			МодульПользователиСлужебныйВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("ПользователиСлужебныйВМоделиСервиса");
			ДоступноИзменениеПользователей = МодульПользователиСлужебныйВМоделиСервиса.ДоступноИзменениеПользователей();
		КонецЕсли;
		
		Если НЕ ДоступноИзменениеПользователей Тогда
			Если Объект.Ссылка.Пустая() Тогда
				ВызватьИсключение
					НСтр("ru = 'В демонстрационном режиме не поддерживается
					           |создание новых пользователей.'");
			КонецЕсли;
			ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Если Объект.Ссылка <> Пользователи.АвторизованныйПользователь() Тогда
			Элементы.Отступ.Видимость = Ложь;
			Элементы.НадписьНаличиеПароля.Видимость = Ложь;
			Элементы.СменитьПароль.Видимость = Ложь;
		КонецЕсли;
		Элементы.ПользовательИБАутентификацияOpenID.Видимость      = Ложь;
		Элементы.ПользовательИБАутентификацияСтандартная.Видимость = Ложь;
		Элементы.ПотребоватьСменуПароляПриВходе.Видимость = Ложь;
		Элементы.ПользовательИБЗапрещеноИзменятьПароль.Видимость = Ложь;
		Элементы.СвойстваАутентификацииОС.Видимость  = Ложь;
		Элементы.ПользовательИБРежимЗапуска.Видимость = Ложь;
	КонецЕсли;
	
	Если СтандартныеПодсистемыСервер.ЭтоУчебнаяПлатформа() Тогда
		Элементы.СвойстваАутентификацииОС.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// Заполнение вспомогательных данных.
	
	// Заполнение списка выбора режимов запуска.
	Для каждого РежимЗапуска Из РежимЗапускаКлиентскогоПриложения Цикл
		ПолноеИмяЗначения = ПолучитьПолноеИмяПредопределенногоЗначения(РежимЗапуска);
		ИмяЗначения = Сред(ПолноеИмяЗначения, СтрНайти(ПолноеИмяЗначения, ".") + 1);
		Элементы.ПользовательИБРежимЗапуска.СписокВыбора.Добавить(ИмяЗначения, Строка(РежимЗапуска));
	КонецЦикла;
	Элементы.ПользовательИБРежимЗапуска.СписокВыбора.СортироватьПоПредставлению();
	
	// Заполнение списка выбора языка.
	Если Метаданные.Языки.Количество() < 2 Тогда
		Элементы.ПользовательИБЯзык.Видимость = Ложь;
	Иначе
		Для каждого МетаданныеЯзыка Из Метаданные.Языки Цикл
			Элементы.ПользовательИБЯзык.СписокВыбора.Добавить(
				МетаданныеЯзыка.Имя, МетаданныеЯзыка.Синоним);
		КонецЦикла;
	КонецЕсли;
	
	УровеньДоступа = ПользователиСлужебный.УровеньДоступаКСвойствамПользователя(Объект);
	
	// Подготовка к интерактивным действиям с учетом сценариев открытия формы.
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		// Создание нового элемента.
		Если Параметры.ГруппаНовогоПользователя <> Справочники.ГруппыПользователей.ВсеПользователи Тогда
			ГруппаНовогоПользователя = Параметры.ГруппаНовогоПользователя;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			// Копирование элемента.
			ЗначениеКопирования = Параметры.ЗначениеКопирования;
			Объект.Наименование = "";
			
			Если Не ПользователиСлужебный.УровеньДоступаПользователяВыше(ЗначениеКопирования, УровеньДоступа) Тогда
				ПрочитатьПользователяИБ(ЗначениеЗаполнено(ЗначениеКопирования.ИдентификаторПользователяИБ));
			Иначе
				ПрочитатьПользователяИБ();
			КонецЕсли;
			
			Если Не УровеньДоступа.ИзменениеРазрешенияНаВход Тогда
				ВходВПрограммуРазрешен = Ложь;
				ВходВПрограммуРазрешенЗначениеПрямогоИзменения = Ложь;
			КонецЕсли;
		Иначе
			// Добавление элемента.
			
			// Чтение начальных значений свойств пользователя ИБ.
			ПрочитатьПользователяИБ();
			
			Если Не ЗначениеЗаполнено(Параметры.ИдентификаторПользователяИБ) Тогда
				ПользовательИБАутентификацияСтандартная = Истина;
				
				Если ОбщегоНазначения.РазделениеВключено() Тогда
					ПользовательИБПоказыватьВСпискеВыбора = Ложь;
					ПользовательИБАутентификацияOpenID = Истина;
				КонецЕсли;
				
				Если УровеньДоступа.ИзменениеРазрешенияНаВход Тогда
					ВходВПрограммуРазрешен = Истина;
					ВходВПрограммуРазрешенЗначениеПрямогоИзменения = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		// Открытие существующего элемента.
		ПрочитатьПользователяИБ();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбработатьИнтерфейсРолей("НастроитьИнтерфейсРолейПриСозданииФормы", ПользовательИБСуществует);
	НачальноеОписаниеПользователяИБ = НачальноеОписаниеПользователяИБ();
	ТребуетсяСинхронизацияССервисом = Объект.Ссылка.Пустая();
	
	//++ Потолки
	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
	//	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	//	МодульУправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "КонтактнаяИнформация");
	//	ПереопределитьРедактированиеКонтактнойИнформацииВСервисе();
	//КонецЕсли;
	//-- Потолки
	
	ОбщаяНастройкаФормы(Объект, Истина);
	
	Если ОбщегоНазначения.ЭтоАвтономноеРабочееМесто() Тогда
		Элементы.ГруппаШапка.ТолькоПросмотр = Истина;
		Элементы.КонтактнаяИнформация.ТолькоПросмотр = Истина;
		Элементы.СтраницаДополнительныеРеквизиты.ТолькоПросмотр = Истина;
		Элементы.СтраницаКомментарий.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация")
	//	И ДействияСПользователемСервиса <> Неопределено Тогда
	//		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	//		МодульУправлениеКонтактнойИнформацией.УстановитьДоступностьЭлементовКонтактнойИнформации(ЭтотОбъект,
	//			ОпределитьДоступностьЭлементовКонтактнойИнформации());
	//КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "СтраницаДополнительныеРеквизиты");
		ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;
	
	ПодготовитьНеобязательныйРеквизит("ФизическоеЛицо");
	ПодготовитьНеобязательныйРеквизит("Подразделение");
	
	ОбновитьВидимостьРеквизитаПоказыватьВСпискеВыбора();
	
	Если Не ПользователиСлужебныйПовтИсп.Настройки().ОбщиеНастройкиВхода Тогда
		Элементы.ГруппаИзменитьОграничение.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ПотребоватьСменуПароляПриВходе.РасширеннаяПодсказка.Заголовок =
		ПользователиСлужебный.ПодсказкаПотребоватьСменуПароляПриВходе(Ложь);
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ФормаЗаписатьИЗакрыть.Отображение = ОтображениеКнопки.Картинка;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
		МодульОбсужденияСлужебный = ОбщегоНазначения.ОбщийМодуль("ОбсужденияСлужебный");
		МодульОбсужденияСлужебный.ПриСозданииНаСервереПользователя(Отказ, ЭтотОбъект, Объект);
	КонецЕсли;
	
	//++ Потолки
	ПотолкиПриСозданииНаСервере();
	//-- Потолки
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
	Элементы.ПользовательИБПользовательОС.КнопкаВыбора = Ложь;
	#КонецЕсли
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
	//++Потолки
	ОбновитьВидимостьЭлементов();
	//#11364
	Если НЕ Элементы.РолиПоказатьПодсистемыРолей.Пометка Тогда 
		ГруппировкаРолейПоПодсистемам(Неопределено);
	КонецЕсли;
	//--Потолки

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		Если МодульУправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
			ОбновитьЭлементыДополнительныхРеквизитов();
			МодульУправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	Если ВРег(ИмяСобытия) = ВРег("Запись_НаборКонстант")
	   И ВРег(Источник) = ВРег("ИспользоватьВнешнихПользователей") Тогда
		
		ПодключитьОбработчикОжидания("ПриИзмененияИспользованияВнешнихПользователей", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	
	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
	//	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	//	МодульУправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, "КонтактнаяИнформация");
	//КонецЕсли;
	
	ОбщаяНастройкаФормы(ТекущийОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОчиститьСообщения();
	ЗаголовокВопросов = НСтр("ru = 'Запись пользователя информационной базы'");
	
	// Копирование прав пользователя.
	Если ЗначениеЗаполнено(ЗначениеКопирования)
	   И Не ЗначениеЗаполнено(Объект.Ссылка)
	   И ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом")
	   И (Не ПараметрыЗаписи.Свойство("НеКопироватьПраваПользователя")
	      И Не ПараметрыЗаписи.Свойство("КопироватьПраваПользователя")) Тогда
		
		Отказ = Истина;
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПослеОтветаНаВопросОКопированииПрав", ЭтотОбъект, ПараметрыЗаписи),
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Скопировать также права пользователя ""%1""?'"), Строка(ЗначениеКопирования)),
			РежимДиалогаВопрос.ДаНет,
			,
			,
			ЗаголовокВопросов);
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыЗаписи.Свойство("СПустымСпискомРолей")
	   И ВходВПрограммуРазрешен
	   И ДействияВФорме.Роли = "Редактирование"
	   И ПользовательИБРоли.Количество() = 0 Тогда
	
		Отказ = Истина;
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаписиСПустымСпискомРолей", ЭтотОбъект, ПараметрыЗаписи),
			НСтр("ru = 'Пользователю информационной базы не установлено ни одной роли. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет,
			,
			,
			ЗаголовокВопросов);
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыЗаписи.Свойство("ССозданиемПервогоАдминистратора")
	   И ЗначениеЗаполнено(ПользовательИБИмя)
	   И СписокПользователейИБПустой() Тогда
		
		Отказ = Истина;
		ПараметрыЗаписиПриПроверкеПервогоАдминистратора = ПараметрыЗаписи;
		ПодключитьОбработчикОжидания("ПроверитьПервогоАдминистратора", 0.1, Истина);
		Возврат;
	КонецЕсли;
	
	Если СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().РазделениеВключено
		И ТребуетсяСинхронизацияССервисом
		И ПарольПользователяСервиса = Неопределено Тогда
		
		Отказ = Истина;
		ПользователиСлужебныйКлиент.ЗапроситьПарольДляАутентификацииВСервисе(
			Новый ОписаниеОповещения("ПослеЗапросаПароляДляАутентификацииВСервисеПередЗаписью", ЭтотОбъект, ПараметрыЗаписи),
			ЭтотОбъект,
			ПарольПользователяСервиса);
		Возврат;
	КонецЕсли;
	
	//++ Потолки
	Объект.МобильныйКлиентМонтажникаДоступныеВидыМонтажа.Очистить();
	Для Каждого ТекСтрока Из МобильныйКлиентМонтажникаДоступныеВидыМонтажаНаФорме Цикл
		Если ТекСтрока.Доступен Тогда
			НоваяСтрока = Объект.МобильныйКлиентМонтажникаДоступныеВидыМонтажа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	//#11190 ЗапрещенныеПослеПроведенияДокументы
	Объект.ЗапрещенныеПослеПроведенияДокументы.Очистить();	
	Если Объект.ДополнительныеПраваЗапретРедактированияПроведенныхДокументовПоТипам Тогда
		Для каждого СтрокаСписка из ТаблицаЗапрещенныеПослеПроведенияДокументы Цикл
			Если СтрокаСписка.Пометка Тогда
				НоваяСтрока = Объект.ЗапрещенныеПослеПроведенияДокументы.Добавить();
				НоваяСтрока.ТипДокумента = СтрокаСписка.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//#15997 ЗапрещенныеКПометкеУдаленияТипыДокументов
	Объект.ЗапрещенныеКПометкеУдаленияТипыДокументов.Очистить();	
	Если Объект.ДополнительныеПраваЗапретПометкиНаУдалениеДокументовПоТипам Тогда
		Для каждого СтрокаСписка из ТаблицаЗапрещенныеКПометкеУдаленияТипыДокументов Цикл
			Если СтрокаСписка.Пометка Тогда
				НоваяСтрока = Объект.ЗапрещенныеКПометкеУдаленияТипыДокументов.Добавить();
				НоваяСтрока.ТипДокумента = СтрокаСписка.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//-- Потолки
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗначениеКопирования", ЗначениеКопирования);
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПарольПользователяСервиса", ПарольПользователяСервиса);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СинхронизироватьССервисом", ТребуетсяСинхронизацияССервисом);
	
	Если ТребуетсяЗаписьПользователяИБ(ЭтотОбъект) Тогда
		
		ОписаниеПользователяИБ = ОписаниеПользователяИБ();
		
		Если ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ) Тогда
			ОписаниеПользователяИБ.Вставить("УникальныйИдентификатор", Объект.ИдентификаторПользователяИБ);
		КонецЕсли;
		ОписаниеПользователяИБ.Вставить("Действие", "Записать");
		
		//++ №10802 наличие роли "Терминал самообслуживания" теперь регулируется по галочке
		РольТерминалСамообслуживания = ОписаниеПользователяИБ.Роли.Найти("ТерминалСамообслуживания");
		
		Если Объект.ПриЗапускеПрограммыЗапускатьТерминалСамообслуживания И РольТерминалСамообслуживания = Неопределено Тогда
			ОписаниеПользователяИБ.Роли.Добавить("ТерминалСамообслуживания");
		ИначеЕсли НЕ Объект.ПриЗапускеПрограммыЗапускатьТерминалСамообслуживания И НЕ РольТерминалСамообслуживания = Неопределено Тогда
			ОписаниеПользователяИБ.Роли.Удалить(РольТерминалСамообслуживания);
		КонецЕсли;
		//-- №10802
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
		
		Если ПараметрыЗаписи.Свойство("ССозданиемПервогоАдминистратора") Тогда
			ТекущийОбъект.ДополнительныеСвойства.Вставить("СозданиеАдминистратора",
				НСтр("ru = 'Первый пользователь информационной базы назначается администратором.'"));
		КонецЕсли;
	КонецЕсли;
	
	Если ДействияВФорме.СвойстваЭлемента <> "Редактирование" Тогда
		ЗаполнитьЗначенияСвойств(ТекущийОбъект, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ТекущийОбъект.Ссылка, "Наименование, ПометкаУдаления"));
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ГруппаНовогоПользователя", ГруппаНовогоПользователя);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	
	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
	//	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	//	Если НЕ Отказ И ДействияВФорме.КонтактнаяИнформация = "Редактирование" Тогда
	//		МодульУправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	//	КонецЕсли;
	//КонецЕсли;
	
	//++ Потолки 
	ПотолкиПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	//-- Потолки
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	ПользователиСлужебный.ЗаписатьСведенияОПользователе(ЭтотОбъект, ТекущийОбъект);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ПараметрыЗаписи.Свойство("КопироватьПраваПользователя") Тогда
		Источник = ЗначениеКопирования;
		Приемник = ТекущийОбъект.Ссылка;
		МодульУправлениеДоступомСлужебный = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступомСлужебный");
		МодульУправлениеДоступомСлужебный.ПриКопированииПравНовомуПользователю(Источник, Приемник);
		ПользователиСлужебный.СкопироватьГруппыПользователя(Источник, Приемник);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ТребуетсяСинхронизацияССервисом = Ложь;
	
	Если ТребуетсяЗаписьПользователяИБ(ЭтотОбъект) Тогда
		ПараметрыЗаписи.Вставить(
			ТекущийОбъект.ДополнительныеСвойства.ОписаниеПользователяИБ.РезультатДействия);
	КонецЕсли;
	
	ОбщаяНастройкаФормы(ТекущийОбъект, , ПараметрыЗаписи);
		
	//++Потолки
	//ОбновитьСпособИзмененияEMailВСервисе();

	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
	//	МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
	//	МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	//КонецЕсли;

	//обновим дополнительные права текущего пользователя
	МенеджерЗаписи = РегистрыСведений.ПраваПользователей.СоздатьНаборЗаписей();
	МенеджерЗаписи.Отбор.Пользователь.Установить(Объект.Ссылка);
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Количество() = 0 Тогда
		НаборПрав = МенеджерЗаписи.Добавить();
	Иначе
		НаборПрав = МенеджерЗаписи[0];
	КонецЕсли;
	НаборПрав.Пользователь = Объект.Ссылка;
	НаборПрав.ИспользованиеСофтФона = Потолки_РазрешеноИспользованиеСофтФона;
	НаборПрав.ВидВходящегоКонтактаСофтФон = ВидВходящегоКонтактаСофтФон;
	МенеджерЗаписи.Записать(Истина);
	//--Потолки
	
	Если Потолки_ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента Тогда
		МобильныйКлиент.ОбновитьФлагАктуальностиНоменклатуры(Объект.Ссылка);
		Потолки_ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_Пользователи", Новый Структура, Объект.Ссылка);
	
	Если ПараметрыЗаписи.Свойство("ДобавленПользовательИБ") Тогда
		Оповестить("ДобавленПользовательИБ", ПараметрыЗаписи.ДобавленПользовательИБ, ЭтотОбъект);
		
	ИначеЕсли ПараметрыЗаписи.Свойство("ИзмененПользовательИБ") Тогда
		Оповестить("ИзмененПользовательИБ", ПараметрыЗаписи.ИзмененПользовательИБ, ЭтотОбъект);
		
	ИначеЕсли ПараметрыЗаписи.Свойство("УдаленПользовательИБ") Тогда
		Оповестить("УдаленПользовательИБ", ПараметрыЗаписи.УдаленПользовательИБ, ЭтотОбъект);
		
	ИначеЕсли ПараметрыЗаписи.Свойство("ОчищеноСопоставлениеСНесуществующимПользователемИБ") Тогда
		Оповестить(
			"ОчищеноСопоставлениеСНесуществующимПользователемИБ",
			ПараметрыЗаписи.ОчищеноСопоставлениеСНесуществующимПользователемИБ,
			ЭтотОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппаНовогоПользователя) Тогда
		ОповеститьОбИзменении(ГруппаНовогоПользователя);
		Оповестить("Запись_ГруппыПользователей", Новый Структура, ГруппаНовогоПользователя);
		ГруппаНовогоПользователя = Неопределено;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
		ОписаниеЗавершения = Новый ОписаниеОповещения("ПослеЗаписиЗавершение", ЭтотОбъект, ПараметрыЗаписи);
		МодульОбсужденияСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбсужденияСлужебныйКлиент");
		МодульОбсужденияСлужебныйКлиент.ПослеЗаписиПользователя(ЭтотОбъект, ОписаниеЗавершения);
		Возврат;
	КонецЕсли;
	
	ПослеЗаписиЗавершение(Неопределено, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ТребуетсяЗаписьПользователяИБ(ЭтотОбъект) Тогда
		ОписаниеПользователяИБ = ОписаниеПользователяИБ();
		ОписаниеПользователяИБ.Вставить("ИдентификаторПользователяИБ", Объект.ИдентификаторПользователяИБ);
		ПользователиСлужебный.ПроверитьОписаниеПользователяИБ(ОписаниеПользователяИБ, Отказ, Ложь);
	КонецЕсли;
	
	Если ВходВПрограммуРазрешен
	   И ЗначениеЗаполнено(СрокДействия)
	   И СрокДействия <= НачалоДня(ТекущаяДатаСеанса()) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Ограничение должно быть до завтра или более.'"),, "ВходВПрограммуРазрешен",, Отказ);
	КонецЕсли;
	
	//++ Потолки
	//// Проверка наличия ролей в метаданных.
	//Если Не Элементы.Роли.ТолькоПросмотр Тогда
	//	Ошибки = Неопределено;
	//	ЭлементыДерева = Роли.ПолучитьЭлементы();
	//	Для Каждого Строка Из ЭлементыДерева Цикл
	//		Если Не Строка.Пометка Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		Если Строка.ЭтоНесуществующаяРоль Тогда
	//			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
	//				"Роли[%1].РолиСиноним",
	//				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Роль ""%1"" не найдена в метаданных.'"), Строка.Синоним),
	//				"Роли",
	//				ЭлементыДерева.Индекс(Строка),
	//				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Роль ""%1"" в строке %%1 не найдена в метаданных.'"), Строка.Синоним));
	//		КонецЕсли;
	//		Если Строка.ЭтоНедоступнаяРоль Тогда
	//			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
	//				"Роли[%1].РолиСиноним",
	//				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Роль ""%1"" недоступна для пользователей.'"), Строка.Синоним),
	//				"Роли",
	//				ЭлементыДерева.Индекс(Строка),
	//				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Роль ""%1"" в строке %%1 недоступна для пользователей.'"), Строка.Синоним));
	//		КонецЕсли;
	//	КонецЦикла;
	//	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	//КонецЕсли;
	//-- Потолки
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
	
	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
	//	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	//	МодульУправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	//	Если ОбщегоНазначения.РазделениеВключено() Тогда
	//		ПроверитьЗаполнениеEmail(Отказ);
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОбработатьИнтерфейсРолей("НастроитьИнтерфейсРолейПриЗагрузкеНастроек", Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаполнитьИзПользователяИБ(Команда)
	
	ЗаполнитьПоляПоПользователюИБНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ОбновитьИмяДляВхода(ЭтотОбъект, Истина);
	
	УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НедействителенПриИзменении(Элемент)
	
	Если Объект.Недействителен Тогда
		ВходВПрограммуРазрешен = Ложь;
	Иначе
		ВходВПрограммуРазрешен = ВходВПрограммуРазрешенЗначениеПрямогоИзменения
			И (ПользовательИБАутентификацияOpenID
			   Или ПользовательИБАутентификацияСтандартная
			   Или ПользовательИБАутентификацияОС);
	КонецЕсли;
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
	УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВходВПрограммуРазрешенПриИзменении(Элемент)
	
	Если Объект.ПометкаУдаления И ВходВПрограммуРазрешен Тогда
		ВходВПрограммуРазрешен = Ложь;
		ПоказатьПредупреждение(,
			НСтр("ru = 'Чтобы разрешить вход в программу, требуется снять
			           |пометку на удаление с этого пользователя.'"));
		Возврат;
	КонецЕсли;
	
	ОбновитьИмяДляВхода(ЭтотОбъект);
	
	Если ВходВПрограммуРазрешен
	   И НЕ ПользовательИБАутентификацияOpenID
	   И НЕ ПользовательИБАутентификацияСтандартная
	   И НЕ ПользовательИБАутентификацияОС Тогда
	
		ПользовательИБАутентификацияСтандартная = Истина;
	КонецЕсли;
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
	УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
	
	Если Не УровеньДоступа.ИзменениеРазрешенияНаВход
	   И Не ВходВПрограммуРазрешен Тогда
		
		ПоказатьПредупреждение(,
			НСтр("ru = 'После записи вход в программу сможет разрешить только администратор.'"));
	КонецЕсли;
	
	ВходВПрограммуРазрешенЗначениеПрямогоИзменения = ВходВПрограммуРазрешен;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОграничениеНаВходВПрограмму(Команда)
	
	ОткрытьФорму("Справочник.Пользователи.Форма.ОграничениеНаВходВПрограмму",, ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ИзменитьОграничениеНаВходВПрограммуЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБИмяПриИзменении(Элемент)
	
	ПользовательИБИмя = СокрЛП(ПользовательИБИмя);
	ПользовательИБИмяЗначениеПрямогоИзменения = ПользовательИБИмя;
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБАутентификацияСтандартнаяПриИзменении(Элемент)
	
	АутентификацияПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПотребоватьСменуПароляПриВходеПриИзменении(Элемент)
	
	Если ПотребоватьСменуПароляПриВходе Тогда
		ПользовательИБЗапрещеноИзменятьПароль = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБПоказыватьВСпискеВыбораПриИзменении(Элемент)
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБЗапрещеноИзменятьПарольПриИзменении(Элемент)
	
	Если ПользовательИБЗапрещеноИзменятьПароль Тогда
		ПотребоватьСменуПароляПриВходе = Ложь;
	КонецЕсли;
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБАутентификацияOpenIDПриИзменении(Элемент)
	
	АутентификацияПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБАутентификацияОСПриИзменении(Элемент)
	
	АутентификацияПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБПользовательОСПриИзменении(Элемент)
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБПользовательОСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		ОткрытьФорму("Справочник.Пользователи.Форма.ВыборПользователяОперационнойСистемы", , Элемент);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБЯзыкПриИзменении(Элемент)
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
	УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБРежимЗапускаПриИзменении(Элемент)
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБРежимЗапускаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства")
		И ТекущаяСтраница.Имя = "СтраницаДополнительныеРеквизиты"
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		
		СвойстваВыполнитьОтложеннуюИнициализацию();
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПотребоватьСменуПароляПриВходеРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ОбщаяФорма.НастройкиВходаПользователей", , ЭтотОбъект);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Поддержка контактной информации.

&НаКлиенте
Процедура Подключаемый_EMailПриИзменении(Элемент)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		
	МодульУправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
	
	УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКИ = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	
	СтрокаEMail = ТаблицаКИ.НайтиСтроки(Новый Структура("Вид",
		ВидКонтактнойИнформацииEmailПользователя()))[0];
	
	Если ЗначениеЗаполнено(ЭтотОбъект[СтрокаEMail.ИмяРеквизита]) Тогда
		ПользовательИБПароль = "" + Новый УникальныйИдентификатор + "qQ";
		УстановитьНаличиеПароля(ЭтотОбъект, Истина, ПользователиКлиент.АвторизованныйПользователь());
	КонецЕсли;
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_EMailОчистка(Элемент, СтандартнаяОбработка)
	
	Если Не Элемент.РедактированиеТекста Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	МодульУправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТелефонПриИзменении(Элемент)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	МодульУправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
	
	УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_EMailНачалоВыбора(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПарольПользователяСервиса = Неопределено Тогда
		ПользователиСлужебныйКлиент.ЗапроситьПарольДляАутентификацииВСервисе(
			Новый ОписаниеОповещения("Подключаемый_EMailНачалоВыбораЗавершение", ЭтотОбъект),
			ЭтотОбъект,
			ПарольПользователяСервиса);
	Иначе
		Подключаемый_EMailНачалоВыбораЗавершение(Null, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_EMailНачалоВыбораЗавершение(НовыйПарольПользователяСервиса, Контекст) Экспорт
	
	Если НовыйПарольПользователяСервиса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НовыйПарольПользователяСервиса <> Null Тогда
		ПарольПользователяСервиса = НовыйПарольПользователяСервиса;
	КонецЕсли;
	
	ТаблицаКИ = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	
	Отбор = Новый Структура("Вид", ВидКонтактнойИнформацииEmailПользователя());
	
	СтрокаEMail = ТаблицаКИ.НайтиСтроки(Отбор)[0];
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПарольПользователяСервиса", ПарольПользователяСервиса);
	ПараметрыФормы.Вставить("СтараяПочта",  ЭтотОбъект[СтрокаEMail.ИмяРеквизита]);
	ПараметрыФормы.Вставить("Пользователь", Объект.Ссылка);
	
	Попытка
		ОткрытьФорму("Справочник.Пользователи.Форма.СменаПочты", ПараметрыФормы, ЭтотОбъект,,,,
			Новый ОписаниеОповещения("ПослеСменыПочты", ЭтотОбъект));
	Исключение
		ПарольПользователяСервиса = Неопределено;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРоли

////////////////////////////////////////////////////////////////////////////////
// Для работы интерфейса ролей.

&НаКлиенте
Процедура РолиПометкаПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Роли.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//++ #12942 
	Если НЕ Потолки_ЭтоКарточкаТехподдержки
		И СтрокаТаблицы.Пометка 
		И СтрокаТаблицы.Имя = "ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок" 
		И Потолки_ЭтоОблако 
		Тогда
		СтрокаТаблицы.Пометка = Ложь;
		Возврат;
	КонецЕсли;
	//-- #12942
	
	Если СтрокаТаблицы.Пометка И СтрокаТаблицы.Имя = "ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок" Тогда
		Оповещение = Новый ОписаниеОповещения("РолиПометкаПриИзмененииПослеПодтверждения", ЭтотОбъект);
		ПараметрыФормы = Новый Структура("Ключ", "ПередВыборомРоли");
		ОткрытьФорму("ОбщаяФорма.ПредупреждениеБезопасности", ПараметрыФормы, , , , , Оповещение);
	Иначе
		Если СтрокаТаблицы.Имя = "ПолныеПрава" Тогда
			УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
		КонецЕсли;
		ОбработатьИнтерфейсРолей("ОбновитьСоставРолей");
	КонецЕсли;
	
	//++ #12942
	Если СтрокаТаблицы.Имя = "ДополнительныеПрава"
		И СтрокаТаблицы.Пометка
		И НЕ Потолки_ЭтоКарточкаТехподдержки 
		И Потолки_ЭтоОблако 
		Тогда
		СнятьОтметкуРолиИнтерактивноеОткрытиеВнешнихОтчетовИОбработок();
	КонецЕсли;
	//-- #12942
	
КонецПроцедуры

&НаКлиенте
Процедура РолиПометкаПриИзмененииПослеПодтверждения(Ответ, ПараметрыВыполнения) Экспорт
	СтрокаТаблицы = Элементы.Роли.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Ответ = "Продолжить" Тогда
		ОбработатьИнтерфейсРолей("ОбновитьСоставРолей");
	Иначе
		СтрокаТаблицы.Пометка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Записать(Новый Структура("ЗаписатьИЗакрыть"));
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьПароль(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВернутьПарольБезУстановки", Истина);
	ДополнительныеПараметры.Вставить("СтарыйПароль", ПользовательИБСтарыйПароль);
	
	ПользователиСлужебныйКлиент.ОткрытьФормуСменыПароля(Объект.Ссылка, Новый ОписаниеОповещения(
		"СменитьПарольПослеПолученияПароля", ЭтотОбъект), ДополнительныеПараметры);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Для работы интерфейса ролей.

&НаКлиенте
Процедура ПоказатьТолькоВыбранныеРоли(Команда)
	
	ОбработатьИнтерфейсРолей("ТолькоВыбранныеРоли");
	ПользователиСлужебныйКлиент.РазвернутьПодсистемыРолей(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаРолейПоПодсистемам(Команда)
	
	ОбработатьИнтерфейсРолей("ГруппировкаПоПодсистемам");
	ПользователиСлужебныйКлиент.РазвернутьПодсистемыРолей(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРоли(Команда)
	
	ОбработатьИнтерфейсРолей("ОбновитьСоставРолей", "ВключитьВсе");
	
	//++ #12942
	Если НЕ Потолки_ЭтоКарточкаТехподдержки И Потолки_ЭтоОблако Тогда
		СнятьОтметкуРолиИнтерактивноеОткрытиеВнешнихОтчетовИОбработок();
	КонецЕсли;
	//-- #12942
	
	ПользователиСлужебныйКлиент.РазвернутьПодсистемыРолей(ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьРоли(Команда)
	
	ОбработатьИнтерфейсРолей("ОбновитьСоставРолей", "ИсключитьВсе");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Поддержка дополнительных реквизитов.

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РолиПометка.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Роли.Имя");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = НСтр("ru = 'ПолныеПрава'");

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗапретИзмененияАдминистративногоДоступа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РолиПометка.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РолиСиноним.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Роли.Имя");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = НСтр("ru = 'ПолныеПрава'");

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗапретИзмененияАдминистративногоДоступа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	//
	Если Не Константы.СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции.Получить() Тогда
		Элементы.ВЗаказеНаПроизводствоПодсветкаОстатковПоСкладуОтгрузки.Видимость = Ложь;
		Объект.ВЗаказеНаПроизводствоПодсветкаОстатковПоСкладуОтгрузки = Ложь;
	КонецЕсли;
	
	//++ #12942
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РолиПометка.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РолиСиноним.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Роли.Имя");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = НСтр("ru = 'ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок'");

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоКарточкаТехподдержки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоОблако");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
		
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	//-- #12942 
	
	// №5782 Группа доступа к контрагентам "Без группы"
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДоступныеГруппыКонтрагентовГруппаКонтрагентов.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДоступныеГруппыКонтрагентов.ГруппаКонтрагентов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Без группы>'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененияИспользованияВнешнихПользователей()
	
	ОбновитьВидимостьРеквизитаПоказыватьВСпискеВыбора();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьРеквизитаПоказыватьВСпискеВыбора()
	
	Элементы.ПользовательИБПоказыватьВСпискеВыбора.Видимость =
		  Не ОбщегоНазначения.РазделениеВключено()
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьВнешнихПользователей")
	
КонецПроцедуры

&НаСервере
Процедура ОбщаяНастройкаФормы(ТекущийОбъект, ПриСозданииНаСервере = Ложь, ПараметрыЗаписи = Неопределено)
	
	Если НачальноеОписаниеПользователяИБ = Неопределено Тогда
		Возврат; // Вызов ПриЧтенииНаСервере до вызова ПриСозданииНаСервере.
	КонецЕсли;
	
	Если Не ПриСозданииНаСервере Тогда
		ПрочитатьПользователяИБ();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ПользователиСлужебный.ПрочитатьСведенияОПользователе(ЭтотОбъект);
	УстановитьПривилегированныйРежим(Ложь);
	
	УровеньДоступа = ПользователиСлужебный.УровеньДоступаКСвойствамПользователя(ТекущийОбъект);
	
	ОпределитьДействияВФорме();
	
	ОпределитьНесоответствияПользователяСПользователемИБ(ПараметрыЗаписи);
	
	ОбработатьИнтерфейсРолей("УстановитьТолькоПросмотрРолей",
		    ПользователиСлужебный.ЗапретРедактированияРолей()
		Или ДействияВФорме.Роли <> "Редактирование"
		Или Не УровеньДоступа.НастройкиДляВхода);
	
	Если ОбщегоНазначения.РазделениеВключено()
	   И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ПользователиВМоделиСервиса") Тогда
		
		МодульПользователиСлужебныйВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("ПользователиСлужебныйВМоделиСервиса");
		ДействияСПользователемСервиса = МодульПользователиСлужебныйВМоделиСервиса.ПолучитьДействияСПользователемСервиса(
			ТекущийОбъект.Ссылка);
	КонецЕсли;
	
	// Настройка возможности просмотра.
	//Элементы.КонтактнаяИнформация.Видимость   = ЗначениеЗаполнено(ДействияВФорме.КонтактнаяИнформация); //+- Потолки
	Элементы.СвойстваПользователяИБ.Видимость = ЗначениеЗаполнено(ДействияВФорме.СвойстваПользователяИБ);
	
	ВыводитьСписокРолей = ЗначениеЗаполнено(ДействияВФорме.Роли);
	Элементы.ОтображениеРолей.Видимость = ВыводитьСписокРолей;
	Элементы.СвойстваАутентификации1СПредприятия.Отображение =
		?(ВыводитьСписокРолей, ОтображениеОбычнойГруппы.Нет, ОтображениеОбычнойГруппы.ОбычноеВыделение);
	
	Элементы.РекомендуетсяПроверитьНастройкиДляВхода.Видимость =
		  УровеньДоступа.ИзменениеРазрешенияНаВход
		И ТекущийОбъект.Подготовлен
		И Не ПриЧтенииВходВПрограммуРазрешен;
	
	// Настройка возможности изменения.
	Если ТекущийОбъект.Служебный Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	Элементы.ГруппаСлужебныйПользователь.Видимость = ТекущийОбъект.Служебный;
	
	ТолькоПросмотр = ТолькоПросмотр
		ИЛИ ДействияВФорме.Роли                   <> "Редактирование"
		  И ДействияВФорме.СвойстваЭлемента       <> "Редактирование"
		  И ДействияВФорме.КонтактнаяИнформация   <> "Редактирование"
		  И ДействияВФорме.СвойстваПользователяИБ <> "Редактирование";
	
	ДоступностьКнопки = Не ТолькоПросмотр И ПравоДоступа("Редактирование",
		Метаданные.Справочники.Пользователи);
	
	Если Элементы.ФормаЗаписатьИЗакрыть.Доступность <> ДоступностьКнопки Тогда
		Элементы.ФормаЗаписатьИЗакрыть.Доступность = ДоступностьКнопки;
	КонецЕсли;
	
	Если Элементы.ИзменитьОграничениеНаВходВПрограмму.Доступность <> ДоступностьКнопки Тогда
		Элементы.ИзменитьОграничениеНаВходВПрограмму.Доступность = ДоступностьКнопки;
	КонецЕсли;
	
	Если Элементы.СменитьПароль.Доступность <> ДоступностьКнопки Тогда
		Элементы.СменитьПароль.Доступность = ДоступностьКнопки;
	КонецЕсли;
	
	Элементы.Наименование.ТолькоПросмотр =
		Не (ДействияВФорме.СвойстваЭлемента = "Редактирование" И УровеньДоступа.УправлениеСписком);
	
	Элементы.Недействителен.ТолькоПросмотр = Элементы.Наименование.ТолькоПросмотр;
	Элементы.ФизическоеЛицо.ТолькоПросмотр = Элементы.Наименование.ТолькоПросмотр;
	Элементы.Подразделение.ТолькоПросмотр  = Элементы.Наименование.ТолькоПросмотр;
	
	Элементы.ОсновныеСвойства.ТолькоПросмотр =
		Не (  ДействияВФорме.СвойстваПользователяИБ = "Редактирование"
		    И (УровеньДоступа.УправлениеСписком Или УровеньДоступа.ИзменениеТекущего));
	
	Элементы.ПользовательИБИмя1.ТолькоПросмотр                      = Не УровеньДоступа.НастройкиДляВхода;
	Элементы.ПользовательИБИмя2.ТолькоПросмотр                      = Не УровеньДоступа.НастройкиДляВхода;
	Элементы.ПользовательИБАутентификацияСтандартная.ТолькоПросмотр = Не УровеньДоступа.НастройкиДляВхода;
	Элементы.ПользовательИБАутентификацияOpenID.ТолькоПросмотр      = Не УровеньДоступа.НастройкиДляВхода;
	Элементы.ПользовательИБАутентификацияОС.ТолькоПросмотр          = Не УровеньДоступа.НастройкиДляВхода;
	Элементы.ПользовательИБПользовательОС.ТолькоПросмотр            = Не УровеньДоступа.НастройкиДляВхода;
	
	Элементы.ПользовательИБПоказыватьВСпискеВыбора.ТолькоПросмотр = Не УровеньДоступа.УправлениеСписком;
	Элементы.ПотребоватьСменуПароляПриВходе.ТолькоПросмотр        = Не УровеньДоступа.УправлениеСписком;
	Элементы.ПользовательИБЗапрещеноИзменятьПароль.ТолькоПросмотр = Не УровеньДоступа.УправлениеСписком;
	Элементы.ПользовательИБРежимЗапуска.ТолькоПросмотр            = Не УровеньДоступа.УправлениеСписком;
	
	Элементы.Комментарий.ТолькоПросмотр =
		Не (ДействияВФорме.СвойстваЭлемента = "Редактирование" И УровеньДоступа.УправлениеСписком);
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьНеобязательныйРеквизит(ИмяРеквизита)
	
	Если ТипЗнч(Объект[ИмяРеквизита]) = Тип("Строка") Тогда
		Элементы[ИмяРеквизита].Видимость = Ложь;
	Иначе
		ТипыПодразделения = Метаданные.ОпределяемыеТипы[ИмяРеквизита].Тип.Типы();
		Если ТипыПодразделения.Количество() = 1 И ОбщегоНазначения.ЭтоСсылка(ТипыПодразделения[0]) Тогда
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипыПодразделения[0]);
			Элементы[ИмяРеквизита].Заголовок = ПредставлениеОбъекта(ОбъектМетаданных);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеОбъекта(ОбъектМетаданных)
	
	Если ЗначениеЗаполнено(ОбъектМетаданных.ПредставлениеОбъекта) Тогда
		Возврат ОбъектМетаданных.ПредставлениеОбъекта;
	КонецЕсли;
	
	Возврат ОбъектМетаданных.Представление();
	
КонецФункции

// Продолжение обработчика события ПередЗаписью.
&НаКлиенте
Процедура ПослеЗапросаПароляДляАутентификацииВСервисеПередЗаписью(НовыйПарольПользователяСервиса, ПараметрыЗаписи) Экспорт
	
	Если НовыйПарольПользователяСервиса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПарольПользователяСервиса = НовыйПарольПользователяСервиса;
	
	Попытка
		Записать(ПараметрыЗаписи);
	Исключение
		ПарольПользователяСервиса = Неопределено;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИмяДляВхода(Форма, ПриИзмененииНаименования = Ложь)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ПользовательИБСуществует Тогда
		Возврат;
	КонецЕсли;
	
	КраткоеИмя = Форма.Объект.Наименование; //ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБ(Форма.Объект.Наименование);
	
	Если Элементы.ИмяПереключениеОтметкиНезаполненного.ТекущаяСтраница = Элементы.ИмяБезОтметкиНезаполненного Тогда
		
		Если Не ЗначениеЗаполнено(Форма.ПользовательИБИмяЗначениеПрямогоИзменения)
		   И Форма.ПользовательИБИмя = КраткоеИмя Тогда
			
			Форма.ПользовательИБИмя = "";
		КонецЕсли;
	Иначе
		Если ПриИзмененииНаименования
		 Или Не ЗначениеЗаполнено(Форма.ПользовательИБИмя) Тогда
			
			Форма.ПользовательИБИмя = КраткоеИмя;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АутентификацияПриИзменении()
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
	Если НЕ ПользовательИБАутентификацияOpenID
	   И НЕ ПользовательИБАутентификацияСтандартная
	   И НЕ ПользовательИБАутентификацияОС Тогда
	
		ВходВПрограммуРазрешен = Ложь;
		
	ИначеЕсли Не ВходВПрограммуРазрешен Тогда
		ВходВПрограммуРазрешен = ВходВПрограммуРазрешенЗначениеПрямогоИзменения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСменыПочты(Результат, Контекст) Экспорт
	
	Если Результат = "" Тогда
		ПарольПользователяСервиса = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Продолжение процедуры СменитьПароль.
&НаКлиенте
Процедура СменитьПарольПослеПолученияПароля(Результат, Контекст) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ПользовательИБПароль       = Результат.НовыйПароль;
	ПользовательИБСтарыйПароль = Результат.СтарыйПароль;
	
	Если Результат.СтарыйПароль <> Неопределено Тогда
		ПарольПользователяСервиса = Результат.СтарыйПароль;
	КонецЕсли;
	УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
	
	УстановитьНаличиеПароля(ЭтотОбъект, ЗначениеЗаполнено(ПользовательИБПароль),
		ПользователиКлиент.АвторизованныйПользователь());
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНаличиеПароля(Форма, ПарольУстановлен, АвторизованныйПользователь)
	
	ПользователиСлужебныйКлиентСервер.УстановитьНаличиеПароля(Форма, ПарольУстановлен, АвторизованныйПользователь);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьДействияВФорме()
	
	ДействияВФорме = Новый Структура;
	
	// "", "Просмотр", "Редактирование".
	ДействияВФорме.Вставить("Роли", "");
	
	// "", "Просмотр", "Редактирование".
	ДействияВФорме.Вставить("КонтактнаяИнформация", "Просмотр");
	
	// "", "ПросмотрВсех", "Редактирование".
	ДействияВФорме.Вставить("СвойстваПользователяИБ", "");
	
	// "", "Просмотр", "Редактирование".
	ДействияВФорме.Вставить("СвойстваЭлемента", "Просмотр");
	
	Если Не УровеньДоступа.АдминистраторСистемы
	   И УровеньДоступа.ПолныеПрава
	   И Пользователи.ЭтоПолноправныйПользователь(Объект.Ссылка, Истина) Тогда
		
		// Администратор системы доступен только на просмотр.
		ДействияВФорме.Роли                   = "Просмотр";
		ДействияВФорме.СвойстваПользователяИБ = "Просмотр";
	
	ИначеЕсли УровеньДоступа.АдминистраторСистемы
	      ИЛИ УровеньДоступа.ПолныеПрава Тогда
		
		ДействияВФорме.Роли                   = "Редактирование";
		ДействияВФорме.КонтактнаяИнформация   = "Редактирование";
		ДействияВФорме.СвойстваПользователяИБ = "Редактирование";
		ДействияВФорме.СвойстваЭлемента       = "Редактирование";
	Иначе
		Если УровеньДоступа.ИзменениеТекущего Тогда
			ДействияВФорме.СвойстваПользователяИБ = "Редактирование";
			ДействияВФорме.КонтактнаяИнформация   = "Редактирование";
		КонецЕсли;
		
		Если УровеньДоступа.УправлениеСписком Тогда
			// Ответственный за список пользователей и групп пользователей.
			// (Исполнитель распоряжений о приеме на работу и переводу,
			//  переназначению, созданию отделов, подразделений и рабочих групп).
			ДействияВФорме.СвойстваПользователяИБ = "Редактирование";
			ДействияВФорме.КонтактнаяИнформация   = "Редактирование";
			ДействияВФорме.СвойстваЭлемента       = "Редактирование";
			
			Если УровеньДоступа.НастройкиДляВхода Тогда
				ДействияВФорме.Роли = "Редактирование";
			КонецЕсли;
			Если Пользователи.ЭтоПолноправныйПользователь(Объект.Ссылка) Тогда
				ДействияВФорме.Роли = "Просмотр";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПользователиСлужебный.ПриОпределенииДействийВФорме(Объект.Ссылка, ДействияВФорме);
	
	// Проверка имен действий в форме.
	Если СтрНайти(", Просмотр, Редактирование,", ", " + ДействияВФорме.Роли + ",") = 0 Тогда
		ДействияВФорме.Роли = "";
		
	ИначеЕсли ДействияВФорме.Роли = "Редактирование"
	        И ПользователиСлужебный.ЗапретРедактированияРолей() Тогда
		
		ДействияВФорме.Роли = "Просмотр";
	КонецЕсли;
	
	Если СтрНайти(", Просмотр, Редактирование,", ", " + ДействияВФорме.КонтактнаяИнформация + ",") = 0 Тогда
		ДействияВФорме.КонтактнаяИнформация = "";
	КонецЕсли;
	
	Если СтрНайти(", Просмотр, ПросмотрВсех, Редактирование, РедактированиеСвоих, РедактированиеВсех,",
	           ", " + ДействияВФорме.СвойстваПользователяИБ + ",") = 0 Тогда
		
		ДействияВФорме.СвойстваПользователяИБ = "";
		
	Иначе // Поддержка обратной совместимости.
		Если СтрНайти(ДействияВФорме.СвойстваПользователяИБ, "Просмотр") Тогда
			ДействияВФорме.СвойстваПользователяИБ = "Просмотр";
			
		ИначеЕсли СтрНайти(ДействияВФорме.СвойстваПользователяИБ, "Редактирование") Тогда
			ДействияВФорме.СвойстваПользователяИБ = "Редактирование";
		КонецЕсли;
	КонецЕсли;
	
	Если СтрНайти(", Просмотр, Редактирование,", ", " + ДействияВФорме.СвойстваЭлемента + ",") = 0 Тогда
		ДействияВФорме.СвойстваЭлемента = "";
	КонецЕсли;
	
	Если Объект.Служебный Тогда
		Если ДействияВФорме.Роли = "Редактирование" Тогда
			ДействияВФорме.Роли = "Просмотр";
		КонецЕсли;
		
		Если ДействияВФорме.КонтактнаяИнформация = "Редактирование" Тогда
			ДействияВФорме.КонтактнаяИнформация = "Просмотр";
		КонецЕсли;
		
		Если ДействияВФорме.СвойстваПользователяИБ = "Редактирование" Тогда
			ДействияВФорме.СвойстваПользователяИБ = "Просмотр";
		КонецЕсли;
		
		Если ДействияВФорме.СвойстваЭлемента = "Редактирование" Тогда
			ДействияВФорме.СвойстваЭлемента = "Просмотр";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеПользователяИБ(ДляПроверкиПервогоАдминистратора = Ложь)
	
	Если УровеньДоступа.УправлениеСписком
	   И ДействияВФорме.СвойстваЭлемента = "Редактирование" Тогда
		
		ПользовательИБПолноеИмя = Объект.Наименование;
	КонецЕсли;
	
	Если УровеньДоступа.АдминистраторСистемы
	 Или УровеньДоступа.ПолныеПрава Тогда
		
		Результат = Пользователи.НовоеОписаниеПользователяИБ();
		Пользователи.СкопироватьСвойстваПользователяИБ(
			Результат,
			ЭтотОбъект,
			,
			"УникальныйИдентификатор,
			|Роли",
			"ПользовательИБ");
		
		Результат.Вставить("ВходВПрограммуРазрешен", ВходВПрограммуРазрешен);
	Иначе
		Результат = Новый Структура;
		
		Если УровеньДоступа.ИзменениеТекущего Тогда
			Результат.Вставить("Пароль", ПользовательИБПароль);
			Результат.Вставить("Язык",   ПользовательИБЯзык);
		КонецЕсли;
		
		Если УровеньДоступа.УправлениеСписком Тогда
			Результат.Вставить("ВходВПрограммуРазрешен",  ВходВПрограммуРазрешен);
			Результат.Вставить("ПоказыватьВСпискеВыбора", ПользовательИБПоказыватьВСпискеВыбора
				И Не ПолучитьФункциональнуюОпцию("ИспользоватьВнешнихПользователей"));
			Результат.Вставить("ЗапрещеноИзменятьПароль", ПользовательИБЗапрещеноИзменятьПароль);
			Результат.Вставить("Язык",                    ПользовательИБЯзык);
			Результат.Вставить("РежимЗапуска",            ПользовательИБРежимЗапуска);
			
			Если ДействияВФорме.СвойстваЭлемента = "Редактирование" Тогда
				Результат.Вставить("ПолноеИмя", ПользовательИБПолноеИмя);
			КонецЕсли;
		КонецЕсли;
		
		Если УровеньДоступа.НастройкиДляВхода Тогда
			Результат.Вставить("АутентификацияСтандартная", ПользовательИБАутентификацияСтандартная);
			Результат.Вставить("Имя",                       ПользовательИБИмя);
			Результат.Вставить("Пароль",                    ПользовательИБПароль);
			Результат.Вставить("АутентификацияOpenID",      ПользовательИБАутентификацияOpenID);
			Результат.Вставить("АутентификацияОС",          ПользовательИБАутентификацияОС);
			Результат.Вставить("ПользовательОС",            ПользовательИБПользовательОС);
		КонецЕсли;
	КонецЕсли;
	
	Если Не УровеньДоступа.НастройкиДляВхода Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ПользователиСлужебный.ЗапретРедактированияРолей() Тогда
		ТекущиеРоли = ПользовательИБРоли.Выгрузить(, "Роль").ВыгрузитьКолонку("Роль");
		Результат.Вставить("Роли", ТекущиеРоли);
	КонецЕсли;
	
	Если ДляПроверкиПервогоАдминистратора Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Добавление ролей требуемых при создании первого администратора.
	Если ПользователиСлужебный.ТребуетсяСоздатьПервогоАдминистратора(Результат) Тогда
		
		Если Результат.Свойство("Роли") И Результат.Роли <> Неопределено Тогда
			РолиАдминистратора = Результат.Роли;
		Иначе
			РолиАдминистратора = Новый Массив;
		КонецЕсли;
		
		Если РолиАдминистратора.Найти("ПолныеПрава") = Неопределено Тогда
			РолиАдминистратора.Добавить("ПолныеПрава");
		КонецЕсли;
		
		Если РолиАдминистратора.Найти("АдминистраторСистемы") = Неопределено Тогда
			РолиАдминистратора.Добавить("АдминистраторСистемы");
		КонецЕсли;
		Результат.Вставить("Роли", РолиАдминистратора);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТребуетсяСоздатьПервогоАдминистратора(ТекстВопроса = Неопределено)
	
	Возврат ПользователиСлужебный.ТребуетсяСоздатьПервогоАдминистратора(
		ОписаниеПользователяИБ(Истина), ТекстВопроса);
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокПользователейИБПустой()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Не ЗначениеЗаполнено(ПользователиИнформационнойБазы.ТекущийПользователь().Имя)
		И ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНеобходимостьСинхронизацииССервисом(Форма)
	
	Форма.ТребуетсяСинхронизацияССервисом = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗаписиСПустымСпискомРолей(Ответ, ПараметрыЗаписи) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("СПустымСпискомРолей");
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПервогоАдминистратора() 
	
	ПараметрыЗаписи = ПараметрыЗаписиПриПроверкеПервогоАдминистратора;
	ПараметрыЗаписиПриПроверкеПервогоАдминистратора = Неопределено;
	
	ТекстВопроса = "";
	Если Не ТребуетсяСоздатьПервогоАдминистратора(ТекстВопроса) Тогда
		ПараметрыЗаписи.Вставить("ССозданиемПервогоАдминистратора");
		Попытка
			Записать(ПараметрыЗаписи);
		Исключение
			ПарольПользователяСервиса = Неопределено;
			ВызватьИсключение;
		КонецПопытки;
		Возврат;
	КонецЕсли;
	
	ЗаголовокВопроса = НСтр("ru = 'Запись пользователя информационной базы'");
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ПослеПодтвержденияСозданияПервогоАдминистратора", ЭтотОбъект, ПараметрыЗаписи),
		ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияСозданияПервогоАдминистратора(Ответ, ПараметрыЗаписи) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВходВПрограммуРазрешен = Истина;
	ПользовательИБАутентификацияСтандартная = Истина;
	
	ПараметрыЗаписи.Вставить("ССозданиемПервогоАдминистратора");
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОКопированииПрав(Ответ, ПараметрыЗаписи) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("КопироватьПраваПользователя");
	Иначе
		ПараметрыЗаписи.Вставить("НеКопироватьПраваПользователя");
	КонецЕсли;
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если ПараметрыЗаписи <> Неопределено И ПараметрыЗаписи.Свойство("ЗаписатьИЗакрыть") Тогда
		ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Поддержка контактной информации.

&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
	
	МодульУправлениеКонтактнойИнформацией =
		ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	МодульУправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПереопределитьРедактированиеКонтактнойИнформацииВСервисе()
	
	Если НЕ ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	КонтактнаяИнформация = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	
	СтрокаEMail = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники["ВидыКонтактнойИнформации"].EmailПользователя))[0];
	ЭлементEMail = Элементы[СтрокаEMail.ИмяРеквизита];
	ЭлементEMail.УстановитьДействие("ПриИзменении", "Подключаемый_EMailПриИзменении");
	ЭлементEMail.УстановитьДействие("Очистка",      "Подключаемый_EMailОчистка");
	ЭлементEMail.АвтоОтметкаНезаполненного = Истина;
	
	ЭлементEMail.КнопкаВыбора = ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(ЭтотОбъект[СтрокаEMail.ИмяРеквизита]);
	ЭлементEMail.РедактированиеТекста = Не ЭлементEMail.КнопкаВыбора;
	ЭлементEMail.УстановитьДействие("НачалоВыбора", "Подключаемый_EMailНачалоВыбора");
	
	СтрокаТелефон = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники["ВидыКонтактнойИнформации"].ТелефонПользователя))[0];
	ЭлементТелефон = Элементы[СтрокаТелефон.ИмяРеквизита];
	ЭлементТелефон.УстановитьДействие("ПриИзменении", "Подключаемый_ТелефонПриИзменении");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпособИзмененияEMailВСервисе()
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	КонтактнаяИнформация = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	
	СтрокаEMail = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники["ВидыКонтактнойИнформации"].EmailПользователя))[0];
	ЭлементEMail = Элементы[СтрокаEMail.ИмяРеквизита];
	
	ЭлементEMail.КнопкаВыбора = ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(ЭтотОбъект[СтрокаEMail.ИмяРеквизита]);
	ЭлементEMail.РедактированиеТекста = Не ЭлементEMail.КнопкаВыбора;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВидКонтактнойИнформацииEmailПользователя()
	
	ИмяПредопределенногоЗначения = "Справочник." + "ВидыКонтактнойИнформации" + ".EmailПользователя";
	
	Возврат ПредопределенноеЗначение(ИмяПредопределенногоЗначения);
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеEmail(Отказ)
	
	ТаблицаКИ = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	
	СтрокаEMail = ТаблицаКИ.НайтиСтроки(Новый Структура("Вид",
		ВидКонтактнойИнформацииEmailПользователя()))[0];
	
	Если ЗначениеЗаполнено(ЭтотОбъект[СтрокаEMail.ИмяРеквизита]) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(
		НСтр("ru = 'Не заполнен адрес электронной почты'"),,
		СтрокаEMail.ИмяРеквизита,, Отказ);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Поддержка дополнительных реквизитов.

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработка пользователя ИБ

&НаСервере
Функция НачальноеОписаниеПользователяИБ()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НачальноеОписаниеПользователяИБ <> Неопределено Тогда
		НачальноеОписаниеПользователяИБ.Роли = Новый Массив;
		Возврат НачальноеОписаниеПользователяИБ;
	КонецЕсли;
	
	ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Ложь;
	Иначе
		ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора =
			НЕ Константы.ИспользоватьВнешнихПользователей.Получить();
	КонецЕсли;
	ОписаниеПользователяИБ.АутентификацияСтандартная = Истина;
	ОписаниеПользователяИБ.Роли = Новый Массив;
	
	Возврат ОписаниеПользователяИБ;
	
КонецФункции

&НаСервере
Процедура ПрочитатьПользователяИБ(ПриКопированииЭлемента = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПрочитанныеСвойства      = Неопределено;
	ОписаниеПользователяИБ   = НачальноеОписаниеПользователяИБ();
	ПользовательИБСуществует = Ложь;
	ПользовательИБОсновной   = Ложь;
	ВходВПрограммуРазрешен   = Ложь;
	ВходВПрограммуРазрешенЗначениеПрямогоИзменения = Ложь;
	
	Если ПриКопированииЭлемента Тогда
		
		ПрочитанныеСвойства = Пользователи.СвойстваПользователяИБ(Параметры.ЗначениеКопирования.ИдентификаторПользователяИБ);
		Если ПрочитанныеСвойства <> Неопределено Тогда
			
			// Сопоставление пользователя ИБ с пользователем в справочнике.
			Если Пользователи.ВходВПрограммуРазрешен(ПрочитанныеСвойства) Тогда
				ВходВПрограммуРазрешен = Истина;
				ВходВПрограммуРазрешенЗначениеПрямогоИзменения = Истина;
			КонецЕсли;
			
			// Копирование свойств и ролей пользователяИБ.
			ЗаполнитьЗначенияСвойств(
				ОписаниеПользователяИБ,
				ПрочитанныеСвойства,
				"ЗапрещеноИзменятьПароль,
				|ПоказыватьВСпискеВыбора,
				|ОсновнойИнтерфейс,
				|РежимЗапуска" + ?(Не Элементы.ПользовательИБЯзык.Видимость, "", ",
				|Язык") + ?(ПользователиСлужебный.ЗапретРедактированияРолей(), "", ",
				|Роли"));
		КонецЕсли;
		Объект.ИдентификаторПользователяИБ = Неопределено;
		УстановитьНаличиеПароля(ЭтотОбъект, Ложь, Пользователи.АвторизованныйПользователь());
	Иначе
		ПрочитанныеСвойства = Пользователи.СвойстваПользователяИБ(Объект.ИдентификаторПользователяИБ);
		Если ПрочитанныеСвойства <> Неопределено Тогда
		
			ПользовательИБСуществует = Истина;
			ПользовательИБОсновной = Истина;
		
		ИначеЕсли Параметры.Свойство("ИдентификаторПользователяИБ")
		        И ЗначениеЗаполнено(Параметры.ИдентификаторПользователяИБ) Тогда
			
			Объект.ИдентификаторПользователяИБ = Параметры.ИдентификаторПользователяИБ;
			ПрочитанныеСвойства = Пользователи.СвойстваПользователяИБ(Объект.ИдентификаторПользователяИБ);
			Если ПрочитанныеСвойства <> Неопределено Тогда
				
				ПользовательИБСуществует = Истина;
				Если Объект.Наименование <> ПрочитанныеСвойства.ПолноеИмя Тогда
					Объект.Наименование = ПрочитанныеСвойства.ПолноеИмя;
					Модифицированность = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ПользовательИБСуществует Тогда
			
			Если Пользователи.ВходВПрограммуРазрешен(ПрочитанныеСвойства) Тогда
				ВходВПрограммуРазрешен = Истина;
				ВходВПрограммуРазрешенЗначениеПрямогоИзменения = Истина;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(
				ОписаниеПользователяИБ,
				ПрочитанныеСвойства,
				"Имя,
				|ПолноеИмя,
				|АутентификацияOpenID,
				|АутентификацияСтандартная,
				|ПоказыватьВСпискеВыбора,
				|ЗапрещеноИзменятьПароль,
				|АутентификацияОС,
				|ПользовательОС,
				|ОсновнойИнтерфейс,
				|РежимЗапуска" + ?(Не Элементы.ПользовательИБЯзык.Видимость, "", ",
				|Язык") + ?(ПользователиСлужебный.ЗапретРедактированияРолей(), "", ",
				|Роли"));
		КонецЕсли;
		
		Если ПрочитанныеСвойства = Неопределено Тогда
			УстановитьНаличиеПароля(ЭтотОбъект, Ложь,
				Пользователи.АвторизованныйПользователь());
		Иначе
			УстановитьНаличиеПароля(ЭтотОбъект, ПрочитанныеСвойства.ПарольУстановлен,
				Пользователи.АвторизованныйПользователь());
		КонецЕсли;
	КонецЕсли;
	
	Пользователи.СкопироватьСвойстваПользователяИБ(
		ЭтотОбъект,
		ОписаниеПользователяИБ,
		,
		"УникальныйИдентификатор,
		|Роли" + ?(ПолучитьФункциональнуюОпцию("ИспользоватьВнешнихПользователей"), ",
		|ПоказыватьВСпискеВыбора", ""),
		"ПользовательИБ");
	
	Если ПользовательИБОсновной И Не ВходВПрограммуРазрешен Тогда
		ХранимыеСвойства = ПользователиСлужебный.ХранимыеСвойстваПользователяИБ(Объект.Ссылка);
		ПользовательИБАутентификацияOpenID      = ХранимыеСвойства.АутентификацияOpenID;
		ПользовательИБАутентификацияСтандартная = ХранимыеСвойства.АутентификацияСтандартная;
		ПользовательИБАутентификацияОС          = ХранимыеСвойства.АутентификацияОС;
	КонецЕсли;
	
	ОбработатьИнтерфейсРолей("ЗаполнитьРоли", ОписаниеПользователяИБ.Роли);
	
	ПриЧтенииВходВПрограммуРазрешен = ВходВПрограммуРазрешен;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьНесоответствияПользователяСПользователемИБ(ПараметрыЗаписи = Неопределено)
	
	// Проверка соответствия свойства ПолноеИмя пользователяИБ и
	// реквизита Наименование пользователя.
	
	ПоказатьНесоответствие = Истина;
	ПоказатьКомандыУстраненияРазличий = Ложь;
	
	Если НЕ ПользовательИБСуществует Тогда
		ПоказатьНесоответствие = Ложь;
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Наименование = ПользовательИБПолноеИмя;
		ПоказатьНесоответствие = Ложь;
		
	ИначеЕсли УровеньДоступа.УправлениеСписком Тогда
		
		УточнениеСвойств = Новый Массив;
		
		Если ПользовательИБПолноеИмя <> Объект.Наименование Тогда
			ПоказатьКомандыУстраненияРазличий =
				    ПоказатьКомандыУстраненияРазличий
				Или ДействияВФорме.СвойстваЭлемента = "Редактирование";
			
			УточнениеСвойств.Вставить(0, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Полное имя ""%1""'"),
				ПользовательИБПолноеИмя));
		КонецЕсли;
		
		Если УточнениеСвойств.Количество() > 0 Тогда
			СтрокаУточненияСвойств = "";
			ТекущаяСтрока = "";
			Для каждого УточнениеСвойства Из УточнениеСвойств Цикл
				Если СтрДлина(ТекущаяСтрока + УточнениеСвойства) > 90 Тогда
					СтрокаУточненияСвойств = СтрокаУточненияСвойств + СокрП(ТекущаяСтрока) + ", " + Символы.ПС;
					ТекущаяСтрока = "";
				КонецЕсли;
				ТекущаяСтрока = ТекущаяСтрока + ?(ЗначениеЗаполнено(ТекущаяСтрока), ", ", "") + УточнениеСвойства;
			КонецЦикла;
			Если ЗначениеЗаполнено(ТекущаяСтрока) Тогда
				СтрокаУточненияСвойств = СтрокаУточненияСвойств + ТекущаяСтрока;
			КонецЕсли;
			Если ПоказатьКомандыУстраненияРазличий Тогда
				Рекомендация = Символы.ПС
					+ НСтр("ru = 'Нажмите ""Записать"", чтобы устранить различия и не выводить это предупреждение.'");
			
			ИначеЕсли Не Пользователи.ЭтоПолноправныйПользователь() Тогда
				Рекомендация = Символы.ПС
					+ НСтр("ru = 'Обратитесь к администратору, чтобы устранить различия.'");
			Иначе
				Рекомендация = "";
			КонецЕсли;
			Элементы.СвойстваПояснениеНесоответствия.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Следующие свойства пользователя информационной базы отличаются от указанных в этой форме:
				           |%1.'"),
				СтрокаУточненияСвойств) + Рекомендация;
		Иначе
			ПоказатьНесоответствие = Ложь;
		КонецЕсли;
	Иначе
		ПоказатьНесоответствие = Ложь;
	КонецЕсли;
	
	Элементы.СвойстваОбработкаНесоответствия.Видимость   = ПоказатьНесоответствие;
	Элементы.СвойстваКомандыУстраненияРазличий.Видимость = ПоказатьКомандыУстраненияРазличий;
	Элементы.СвойстваПояснениеНесоответствия.ВертикальноеПоложение = ?(ЗначениеЗаполнено(Рекомендация),
		ВертикальноеПоложениеЭлемента.Верх, ВертикальноеПоложениеЭлемента.Центр);
	
	// Определение сопоставление несуществующего пользователя ИБ с пользователем в справочнике.
	ЕстьНовоеСопоставлениеСНесуществующимПользователемИБ
		= НЕ ПользовательИБСуществует
		И ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ);
	
	Если ПараметрыЗаписи <> Неопределено
	   И ЕстьСопоставлениеСНесуществующимПользователемИБ
	   И НЕ ЕстьНовоеСопоставлениеСНесуществующимПользователемИБ Тогда
		
		ПараметрыЗаписи.Вставить("ОчищеноСопоставлениеСНесуществующимПользователемИБ", Объект.Ссылка);
	КонецЕсли;
	ЕстьСопоставлениеСНесуществующимПользователемИБ = ЕстьНовоеСопоставлениеСНесуществующимПользователемИБ;
	
	Если УровеньДоступа.УправлениеСписком Тогда
		Элементы.СопоставлениеОбработкаНесоответствия.Видимость = ЕстьСопоставлениеСНесуществующимПользователемИБ;
	Иначе
		// Сопоставление не может быть изменено.
		Элементы.СопоставлениеОбработкаНесоответствия.Видимость = Ложь;
	КонецЕсли;
	
	Если ДействияВФорме.СвойстваЭлемента = "Редактирование" Тогда
		Рекомендация = Символы.ПС
			+ НСтр("ru = 'Нажмите ""Записать"", чтобы устранить проблему и не выводить это предупреждение.'");
		
	ИначеЕсли Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Рекомендация = Символы.ПС
			+ НСтр("ru = 'Обратитесь к администратору, чтобы устранить различия.'");
	Иначе
		Рекомендация = "";
	КонецЕсли;
	
	Элементы.СопоставлениеПояснениеНесоответствия.Заголовок =
		НСтр("ru = 'Пользователь информационной базы не найден.'") + Рекомендация;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляПоПользователюИБНаСервере()
	
	Если УровеньДоступа.УправлениеСписком
	   И ДействияВФорме.СвойстваЭлемента = "Редактирование" Тогда
		
		Объект.Наименование = ПользовательИБПолноеИмя;
	КонецЕсли;
	
	ОпределитьНесоответствияПользователяСПользователемИБ();
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
	УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Начальное заполнение, проверка заполнения, доступность свойств.

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвойств(Форма)
	
	Элементы       = Форма.Элементы;
	Объект         = Форма.Объект;
	УровеньДоступа = Форма.УровеньДоступа;
	ДействияСПользователемСервиса = Форма.ДействияСПользователемСервиса;
	
	// Настройка возможности изменения.
	Элементы.ВходВПрограммуРазрешен.ТолькоПросмотр =
		Не (  Элементы.ОсновныеСвойства.ТолькоПросмотр = Ложь
		    И (    УровеньДоступа.ИзменениеРазрешенияНаВход
		       Или УровеньДоступа.ОтключениеРазрешенияНаВход И Форма.ПриЧтенииВходВПрограммуРазрешен));
	
	Элементы.СменитьПароль.Доступность =
		(    УровеньДоступа.НастройкиДляВхода
		 Или УровеньДоступа.ИзменениеТекущего
		   И Не Форма.ПользовательИБЗапрещеноИзменятьПароль)
		И Не Объект.Служебный;
	
	// Настройка необходимости заполнения.
	Если ТребуетсяЗаписьПользователяИБ(Форма, Ложь) Тогда
		НоваяСтраница = Элементы.ИмяСОтметкойНезаполненного;
	Иначе
		НоваяСтраница = Элементы.ИмяБезОтметкиНезаполненного;
	КонецЕсли;
	
	Если Элементы.ИмяПереключениеОтметкиНезаполненного.ТекущаяСтраница <> НоваяСтраница Тогда
		Элементы.ИмяПереключениеОтметкиНезаполненного.ТекущаяСтраница = НоваяСтраница;
	КонецЕсли;
	ОбновитьИмяДляВхода(Форма);
	
	// Настройка доступности связанных элементов.
	Элементы.ВходВПрограммуРазрешен.Доступность    = Не Объект.Недействителен;
	Элементы.ОсновныеСвойства.Доступность          = Не Объект.Недействителен;
	Элементы.ГруппаИзменитьОграничение.Доступность = Не Объект.Недействителен
	                                               И Не Элементы.Наименование.ТолькоПросмотр;
	
	Элементы.ПараметрыАутентификации1СПредприятия.Доступность = Форма.ПользовательИБАутентификацияСтандартная;
	Элементы.ПользовательИБПользовательОС.Доступность         = Форма.ПользовательИБАутентификацияОС;
	
	// Уточнение настроек в модели сервиса.
	Если ДействияСПользователемСервиса <> Неопределено Тогда
		
		// Доступность редактирования КИ.
		Отбор = Новый Структура("Вид", ВидКонтактнойИнформацииEmailПользователя());
		НайденныеСтроки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
		Если НайденныеСтроки <> Неопределено Тогда
			ЗаполненEMail = ЗначениеЗаполнено(Форма[НайденныеСтроки[0].ИмяРеквизита]);
		Иначе
			ЗаполненEMail = Ложь;
		КонецЕсли;
		
		Если Объект.Ссылка.Пустая() И ЗаполненEMail Тогда
			МожноИзменятьПароль = Ложь;
		Иначе
			МожноИзменятьПароль = ДействияСПользователемСервиса.ИзменениеПароля;
		КонецЕсли;
		
		Элементы.СменитьПароль.Доступность = Элементы.СменитьПароль.Доступность И МожноИзменятьПароль;
		
		Элементы.ПользовательИБИмя1.ТолькоПросмотр = Элементы.ПользовательИБИмя1.ТолькоПросмотр
			ИЛИ НЕ ДействияСПользователемСервиса.ИзменениеИмени;
		
		Элементы.ПользовательИБИмя2.ТолькоПросмотр = Элементы.ПользовательИБИмя2.ТолькоПросмотр
			ИЛИ НЕ ДействияСПользователемСервиса.ИзменениеИмени;
		
		Элементы.Наименование.ТолькоПросмотр = Элементы.Наименование.ТолькоПросмотр 
			ИЛИ НЕ ДействияСПользователемСервиса.ИзменениеПолногоИмени;
		
		Элементы.ВходВПрограммуРазрешен.Доступность = Элементы.ВходВПрограммуРазрешен.Доступность
			И ДействияСПользователемСервиса.ИзменениеДоступа;
		
		Элементы.Недействителен.Доступность = Элементы.Недействителен.Доступность
			И ДействияСПользователемСервиса.ИзменениеДоступа;
		
		Форма.ЗапретИзмененияАдминистративногоДоступа =
			НЕ ДействияСПользователемСервиса.ИзменениеАдминистративногоДоступа;
	КонецЕсли;
	
	ПользователиСлужебныйКлиентСервер.ОбновитьОграничениеСрокаДействия(Форма);
	
КонецПроцедуры

&НаСервере
Функция ОпределитьДоступностьЭлементовКонтактнойИнформации()
	
	Результат = Новый Соответствие;
	Для Каждого СтрокаКонтактнойИнформации Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
		ДействияВидаКонтактнойИнформации = ДействияСПользователемСервиса.КонтактнаяИнформация.Получить(СтрокаКонтактнойИнформации.Вид);
		Если ДействияВидаКонтактнойИнформации = Неопределено Тогда
			// Возможность редактирования этого вида КИ не регулируется менеджером сервиса.
			Продолжить;
		КонецЕсли;
		ЭлементКонтактнойИнформации = Элементы[СтрокаКонтактнойИнформации.ИмяРеквизита];
		Результат.Вставить(СтрокаКонтактнойИнформации.Вид,
			Не ЭлементКонтактнойИнформации.ТолькоПросмотр
			И ДействияВидаКонтактнойИнформации.Изменение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Продолжение процедуры ИзменитьОграничениеНаВходВПрограмму.
&НаКлиенте
Процедура ИзменитьОграничениеНаВходВПрограммуЗавершение(Результат, Контекст) Экспорт
	
	УстановитьДоступностьСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТребуетсяЗаписьПользователяИБ(Форма, УчитыватьСтандартноеИмя = Истина)
	
	Если Форма.ДействияВФорме.СвойстваПользователяИБ <> "Редактирование" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Шаблон = Форма.НачальноеОписаниеПользователяИБ;
	
	ТекущееИмя = "";
	Если Не УчитыватьСтандартноеИмя Тогда
		КраткоеИмя = ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБ(
			Форма.Объект.Наименование);
		
		Если Форма.ПользовательИБИмя = КраткоеИмя Тогда
			ТекущееИмя = КраткоеИмя;
		КонецЕсли;
	КонецЕсли;
	
	Если Форма.ПользовательИБСуществует
	 ИЛИ Форма.ВходВПрограммуРазрешен
	 ИЛИ Форма.ПользовательИБИмя                       <> ТекущееИмя
	 ИЛИ Форма.ПользовательИБАутентификацияСтандартная <> Шаблон.АутентификацияСтандартная
	 ИЛИ Форма.ПользовательИБПоказыватьВСпискеВыбора   <> Шаблон.ПоказыватьВСпискеВыбора
	 ИЛИ Форма.ПользовательИБЗапрещеноИзменятьПароль   <> Шаблон.ЗапрещеноИзменятьПароль
	 ИЛИ Форма.ПользовательИБПароль                    <> Неопределено
	 ИЛИ Форма.ПользовательИБАутентификацияОС          <> Шаблон.АутентификацияОС
	 ИЛИ Форма.ПользовательИБПользовательОС            <> ""
	 ИЛИ Форма.ПользовательИБАутентификацияOpenID      <> Шаблон.АутентификацияOpenID
	 ИЛИ Форма.ПользовательИБРежимЗапуска              <> Шаблон.РежимЗапуска
	 ИЛИ Форма.ПользовательИБЯзык                      <> Шаблон.Язык
	 ИЛИ Форма.ПользовательИБРоли.Количество()         <> 0 Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Для работы интерфейса ролей.

&НаСервере
Процедура ОбработатьИнтерфейсРолей(Действие, ОсновнойПараметр = Неопределено)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("ОсновнойПараметр", ОсновнойПараметр);
	ПараметрыДействия.Вставить("Форма",            ЭтотОбъект);
	ПараметрыДействия.Вставить("КоллекцияРолей",   ПользовательИБРоли);
	ПараметрыДействия.Вставить("ЗапретИзмененияАдминистративногоДоступа",
		ЗапретИзмененияАдминистративногоДоступа);
	
	ПараметрыДействия.Вставить("НазначениеРолей", "ДляАдминистраторов");
	
	БылУстановленАдминистративныйДоступ = ПользовательИБРоли.НайтиСтроки(
		Новый Структура("Роль", "ПолныеПрава")).Количество() > 0;
	
	ПользователиСлужебный.ОбработатьИнтерфейсРолей(Действие, ПараметрыДействия);
	
	УстановленАдминистративныйДоступ = ПользовательИБРоли.НайтиСтроки(
		Новый Структура("Роль", "ПолныеПрава")).Количество() > 0;
	
	Если УстановленАдминистративныйДоступ <> БылУстановленАдминистративныйДоступ Тогда
		УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПотолкиМодификация

&НаСервере
Процедура ПотолкиПриСозданииНаСервере()
	
	Потолки_ЭтоОблако = ПараметрыСеанса.ЭтоОблако;
	
	//получим дополнительные права пользователя
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПраваПользователей.ИспользованиеСофтФона,
	|	ПраваПользователей.ВидВходящегоКонтактаСофтФон
	|ИЗ
	|	РегистрСведений.ПраваПользователей КАК ПраваПользователей
	|ГДЕ
	|	ПраваПользователей.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь",Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Потолки_РазрешеноИспользованиеСофтФона = Выборка.ИспользованиеСофтФона;
		ВидВходящегоКонтактаСофтФон = Выборка.ВидВходящегоКонтактаСофтФон;
	КонецЦикла;
	
	//пользователь не может настраивать доступы и ограничения, если у него нет полных прав
	Если НЕ ОбщийМодуль.ЕстьПраваАдминистратора() Тогда
		Элементы.ДополнительныеПрава.Доступность = Ложь;
		Элементы.ОграниченияДоступа.Доступность = Ложь;
		Элементы.Мониторы.Доступность = Ложь;
	КонецЕсли;
	
	//скрываем\отображаем вкладку настроек ip телефонии
	Элементы.ДополнительныеПрава.Видимость = СофтФон.ИспользуетсяИнтеграцияСIPАТС(); 
	
	Если Объект.ПриПоднятииТрубкиОткрыватьКарточкуКонтрагента Тогда
		ПриВходящемЗвонкеСоздаватьЛид = Ложь;
		ПриВходящемЗвонкеОткрыватьКарточкуКонтрагента = Истина;
	Иначе
		ПриВходящемЗвонкеСоздаватьЛид = Истина;
		ПриВходящемЗвонкеОткрыватьКарточкуКонтрагента = Ложь;
	КонецЕсли;
	
	//скрываем\отображаем галочку "РазрешитьЗаписыватьЛидыСДублирующимиТелефонами"
	
	Элементы.РазрешитьЗаписыватьЛидыСДублирующимиТелефонами.Видимость = Константы.КонтролироватьСозданиеЛидовПоНомеруКлиента.Получить(); 
	Если Не Константы.КонтролироватьСозданиеЛидовПоНомеруКлиента.Получить() Тогда
		РазрешитьЗаписыватьЛидыСДублирующимиТелефонами = Ложь;
	КонецЕсли;
	
	// №10802 регулируется галочкой ПроверитьНаличиеРолиТерминалСамообслуживания();
	
	Элементы.ГруппаКонтроляСМС.Видимость = Константы.АвтоматическаяРассылкаСМС.Получить();
	
	//#7881 закомментировано, в отдельных случаях и для OnlinePBX
	//Элементы.ЛогинIPТелефонии.Видимость  = Константы.ИспользоватьSIOМегафон.Получить() ИЛИ Константы.ИспользоватьSIODomRu.Получить();
	Элементы.КаналИсходящегоВызова.Видимость = Константы.ИспользоватьROMAsterisk.Получить();
	
	Элементы.СкладПродукции.Видимость = Константы.СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции.Получить();
	
	Элементы.Цех.Видимость = Константы.НесколькоТочекПроизводства.Получить();
	
	ИспользуетсяМобильныйЗамерщик  = Константы.ИспользуетсяМобильныйКлиентЗамерщика.Получить();
	ИспользуетсяМобильныйМонтажник = Константы.ИспользуетсяМобильныйКлиентМонтажника.Получить();
	ИспользуютсяИндивидуальныеНастройкиМобильногоЗамерщика = Константы.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаДляПользователей.Получить();
	ИспользуютсяИндивидуальныеНастройкиМобильногоМонтажника = Константы.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаМонтажникаДляПользователей.Получить();
	
	Элементы.ГруппаМобильныйКлиент.Доступность = ИспользуетсяМобильныйЗамерщик ИЛИ ИспользуетсяМобильныйМонтажник; //МобильныйКлиент.ИспользуетсяМобильныйКлиентSmartCeilings();
	Элементы.ДекорацияНастройкиМобильногоКлиентаЗамерщика.Видимость = НЕ ИспользуютсяИндивидуальныеНастройкиМобильногоЗамерщика;
	
	//++ №12135 галочки "Показывать в моб. приложении замеры/монтажи всех сотрудников" должны регулироваться вне зависимости от глобальной настройки
	//Элементы.ГруппаМобильныйКлиентЗамерщика.Доступность  = ИспользуютсяИндивидуальныеНастройкиМобильногоЗамерщика;
	//Элементы.ГруппаМобильныйКлиентМонтажника.Доступность = ИспользуютсяИндивидуальныеНастройкиМобильногоМонтажника;
	Элементы.ГруппаМобильныйКлиентЗамерщикаДоп.Доступность  = ИспользуютсяИндивидуальныеНастройкиМобильногоЗамерщика;
	Элементы.ГруппаМобильныйКлиентМонтажникаДоп.Доступность = ИспользуютсяИндивидуальныеНастройкиМобильногоМонтажника;
	//-- №12135
	Элементы.ГруппаМобильныйЗамерщикНастройкиПредварительныхРасчетов.Доступность = ИспользуютсяИндивидуальныеНастройкиМобильногоЗамерщика;
	
	
	//заполним таблицу доступных видов монтажей
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыМонтажа.Ссылка КАК ВидМонтажа,
	|	ЛОЖЬ КАК Доступен
	|ИЗ
	|	Справочник.ВидыМонтажа КАК ВидыМонтажа
	|ГДЕ
	|	НЕ ВидыМонтажа.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыМонтажа.Наименование";
	ВремТаблица = Запрос.Выполнить().Выгрузить();
	Для Каждого ТекСтрокаЗапроса Из ВремТаблица Цикл
		НоваяСтрока = МобильныйКлиентМонтажникаДоступныеВидыМонтажаНаФорме.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаЗапроса);
		Для Каждого ТекСтрокаОбъекта Из Объект.МобильныйКлиентМонтажникаДоступныеВидыМонтажа Цикл
			Если ТекСтрокаОбъекта.ВидМонтажа = НоваяСтрока.ВидМонтажа Тогда
				НоваяСтрока.Доступен = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Элементы.ГруппаПоУмолчаниюМагазин.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьРМК");
	Элементы.ВидЦенРМК.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьРМК");
	
	Если НЕ Потолки_КопированиеРолейИОграничений Тогда // №9422
		СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	
	Элементы.РазрешеноРаспределениеПулаЗамеровНаЗамерщиков.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПулЗамеров");  //#6384
	Элементы.РазрешеноРаспределениеПулаМонтажейНаБригады.Видимость   = ПолучитьФункциональнуюОпцию("ИспользоватьПулМонтажей"); //#9168
	
	Потолки_ДоступныИсходящиеЗвонки = СофтФон.ДоступныИсходящиеЗвонки(); // №9362
	
	Элементы.РазрешитьИзменениеДатыЗакрытияЗаказаПокупателя.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусЗакрытВЗаказеПокупателя");
	
	//#11190
	Для каждого ТипДокумента из Метаданные.Документы Цикл
		Если СтрНайти(ТипДокумента.Имя, "УДАЛИТЬ_") > 0 Тогда
			Продолжить;
		КонецЕсли;
		НайденныеСтроки = Объект.ЗапрещенныеПослеПроведенияДокументы.НайтиСтроки(Новый Структура("ТипДокумента", ТипДокумента.Имя));
		ПометкаСтроки = (НайденныеСтроки.Количество() > 0);
		ТаблицаЗапрещенныеПослеПроведенияДокументы.Добавить(ТипДокумента.Имя, ТипДокумента.Синоним, ПометкаСтроки);
		
		//#15997
		НайденныеСтроки = Объект.ЗапрещенныеКПометкеУдаленияТипыДокументов.НайтиСтроки(Новый Структура("ТипДокумента", ТипДокумента.Имя));
		ПометкаСтроки = (НайденныеСтроки.Количество() > 0);
		ТаблицаЗапрещенныеКПометкеУдаленияТипыДокументов.Добавить(ТипДокумента.Имя, ТипДокумента.Синоним, ПометкаСтроки);
	КонецЦикла;	
	
	//МобильныйКлиентЗамерщикаЛоготипОрганизацииПоле = ПолучитьНавигационнуюСсылку(Объект.МобильныйКлиентЗамерщикаЛоготипОрганизации, "Файл");
	//МобильныйКлиентЗамерщикаПечатьОрганизацииПоле = ПолучитьНавигационнуюСсылку(Объект.МобильныйКлиентЗамерщикаПечатьОрганизации, "Файл");
	
	//++ №13830 печатная форма заказа покупателя по умолчанию для кладовщика
	КомандыПечатиЗаказаПокупателя = УправлениеПечатью.КомандыПечатиФормы("Документ.ЗаказПокупателя.Форма.ФормаДокумента").Скопировать();	
	Для Каждого ТекущаяСтрока Из КомандыПечатиЗаказаПокупателя Цикл		
		Элементы.ПечатнаяФормаЗаказаПокупателяВРабочемМестеКладовщика.СписокВыбора.Добавить(ТекущаяСтрока.Идентификатор, ТекущаяСтрока.Представление);		
	КонецЦикла;
	//-- №13830
	
	Элементы.РазрешитьНесоответствиеКратностиЕдиницИзмерения.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольКратностиЕдиницИзмерения");
	
	Если НЕ Константы.ИспользоватьПодразделения.Получить() Тогда
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.ПодразделениеРозница.Видимость = Ложь;
	КонецЕсли;
	
	//#16755
	МенеджерОбъектаДетализации = Справочники.ДетализацияУчетаЛидов;
	Элементы.РазрешеноМенятьОтветственногоВЛиде.Видимость = МенеджерОбъектаДетализации.Ответственный.Использовать;
	Элементы.РазрешеноМенятьЗамерщикаВЛиде.Видимость = МенеджерОбъектаДетализации.Замерщик.Использовать;
	Элементы.РазрешеноМенятьТехнологаВЛиде.Видимость = МенеджерОбъектаДетализации.Технолог.Использовать;
	
	//--Потолки
	
КонецПроцедуры

&НаСервере
Процедура ПотолкиПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);

	////проверим, что указанный логин мобильного клиента отсутствует у других действительных пользователей
	//Если НЕ ПустаяСтрока(Объект.МобильныйКлиент_Логин) и не Объект.Недействителен Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Пользователи.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.Пользователи КАК Пользователи
	//	|ГДЕ
	//	|	НЕ Пользователи.Ссылка = &Ссылка
	//	|	И НЕ Пользователи.Недействителен
	//	|	И Пользователи.МобильныйКлиент_Логин = &МобильныйКлиент_Логин";
	//	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	//	Запрос.УстановитьПараметр("МобильныйКлиент_Логин",СокрЛП(Объект.МобильныйКлиент_Логин));
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Количество() > 0 Тогда
	//		Отказ = Истина;
	//		ТекстСообщения = "";
	//		Пока Выборка.Следующий() Цикл
	//			ТекстСообщения = ТекстСообщения + Выборка.Ссылка + " ";	
	//		КонецЦикла;
	//		
	//		ТекстСообщения = НСтр("ru = 'Пользователю назначен логин мобильного приложения, который указан у других активных пользователей "+ТекстСообщения+"'");
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.МобильныйКлиент_Логин", , Отказ);
	//	КонецЕсли;
	//КонецЕсли;
	
	Если Объект.ОграничиватьДоступПоОрганизациям И ЗначениеЗаполнено(Объект.ОрганизацияРозницы) Тогда
		НайденныеСтроки = Объект.ДоступныеОрганизации.НайтиСтроки(Новый Структура("Организация", Объект.ОрганизацияРозницы));
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			ТекстСообщения = НСтр("ru = 'Пользователю назначена организация розницы, к которой отсутствует доступ в ограничениях'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.ОрганизацияРозницы", , Отказ);

		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ОграничиватьДоступПоОрганизациям И ЗначениеЗаполнено(Объект.Организация) Тогда
		НайденныеСтроки = Объект.ДоступныеОрганизации.НайтиСтроки(Новый Структура("Организация", Объект.Организация));
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			ТекстСообщения = НСтр("ru = 'Пользователю назначена организация оптовых документов, к которой отсутствует доступ в ограничениях'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Организация", , Отказ);

		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ОграничиватьДоступПоКассамИБанковскимСчетамОрганизаций И ЗначениеЗаполнено(Объект.Касса) Тогда
		НайденныеСтроки = Объект.ДоступныеКассы.НайтиСтроки(Новый Структура("Касса", Объект.Касса));
		Если (НайденныеСтроки.Количество() = 0 
			И Объект.ВидОграниченияДоступаПоКассамИБанковскимСчетам = Перечисления.ВидыОграниченияДоступа.ВсеЗапрещеныКромеУказанных)
			ИЛИ
			(НайденныеСтроки.Количество() > 0 
			И Объект.ВидОграниченияДоступаПоКассамИБанковскимСчетам = Перечисления.ВидыОграниченияДоступа.ВсеРазрешеныКромеУказанных)
			Тогда			
			ТекстСообщения = НСтр("ru = 'Пользователю назначена касса, к которой отсутствует доступ в ограничениях'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Касса", , Отказ);

		КонецЕсли;
	КонецЕсли;
	
	//#7881
	Если Софтфон.ИспользуетсяИнтеграцияСIPАТС() Тогда
		Если (Объект.ТелефонияПринимаетВходящиеЗвонки
			ИЛИ (Объект.ТелефонияВыполняетИсходящиеЗвонки И Потолки_ДоступныИсходящиеЗвонки)) // №9362
			И ПустаяСтрока(Объект.ТелефонияЛогин) Тогда
			
			//++ №9362 текст ошибки
			ЧастьТекстаОшибки = "";
			Если Объект.ТелефонияПринимаетВходящиеЗвонки Тогда
				ЧастьТекстаОшибки = """Принимает входящие звонки""";
			КонецЕсли;
			Если Объект.ТелефонияВыполняетИсходящиеЗвонки И Потолки_ДоступныИсходящиеЗвонки Тогда
				ЧастьТекстаОшибки = ЧастьТекстаОшибки + ?(ПустаяСтрока(ЧастьТекстаОшибки), "", " и галочке ") + """Выполняет исходящие звонки""";
			КонецЕсли;
			//-- №9362
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         		НСтр("ru = 'При установленной галочке " + ЧастьТекстаОшибки + " должен быть заполнен ""Внутренний номер""!'"), , "Объект.ТелефонияЛогин",,Отказ);
		КонецЕсли;

		// раскомментировать при необходимости в зависимости от используемой АТС
		//ЛогинIPТелефонииОбязательно = Константы.ИспользоватьМегафон.Получить() И РазрешеноИспользованиеСофтФона;	
		//Если НЕ ЗначениеЗаполнено(Объект.ЛогинIPТелефонии) И ЛогинIPТелефонииОбязательно Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		// 		НСтр("ru = 'Не заполнено поле Логин IP-телефонии!'"), , "Объект.ЛогинIPТелефонии",,Отказ);
		//КонецЕсли;
	КонецЕсли;
	
	ВремТаблицаВидовЦенМобильногоЗамерщика = Объект.МобильныйКлиентЗамерщикаДоступныеВидыЦен.Выгрузить();
	ВремТаблицаВидовЦенМобильногоЗамерщика.Колонки.Добавить("Количество", Новый ОписаниеТипов("число"));
	Для Каждого ТекСтрока Из ВремТаблицаВидовЦенМобильногоЗамерщика Цикл
		ТекСтрока.Количество = 1;
	КонецЦикла;
	ВремТаблицаВидовЦенМобильногоЗамерщика.Свернуть("ВидЦены", "Количество");
	Для Каждого ТекСтрока Из ВремТаблицаВидовЦенМобильногоЗамерщика Цикл
		Если ТекСтрока.Количество > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Мобильный клиент"": доступные виды цен мобильного замерщика - вид цены """+ТекСтрока.ВидЦены+""" указан более одного раза", , "Объект.МобильныйКлиентЗамерщикаДоступныеВидыЦен",,Отказ);
		КонецЕсли;
	КонецЦикла;
	
	ВремТаблицаВидовСкидокМобильногоЗамерщика = Объект.МобильныйКлиентЗамерщикаДоступныеВидыСкидок.Выгрузить();
	ВремТаблицаВидовСкидокМобильногоЗамерщика.Колонки.Добавить("Количество", Новый ОписаниеТипов("число"));
	Для Каждого ТекСтрока Из ВремТаблицаВидовСкидокМобильногоЗамерщика Цикл
		ТекСтрока.Количество = 1;
	КонецЦикла;
	ВремТаблицаВидовСкидокМобильногоЗамерщика.Свернуть("ВидСкидки", "Количество");
	Для Каждого ТекСтрока Из ВремТаблицаВидовСкидокМобильногоЗамерщика Цикл
		Если ТекСтрока.Количество > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Мобильный клиент"": доступные виды скидок мобильного замерщика - вид скидки """+ТекСтрока.ВидСкидки+""" указан более одного раза", , "Объект.МобильныйКлиентЗамерщикаДоступныеВидыСкидок",,Отказ);
		КонецЕсли;
	КонецЦикла;
	
	ВремМобильныйКлиентЗамерщикаДоступнаяНоменклатура = Объект.МобильныйКлиентЗамерщикаДоступнаяНоменклатура.Выгрузить();
	ВремМобильныйКлиентЗамерщикаДоступнаяНоменклатура.Колонки.Добавить("Количество", Новый ОписаниеТипов("число"));
	Для Каждого ТекСтрока Из ВремМобильныйКлиентЗамерщикаДоступнаяНоменклатура  Цикл
		ТекСтрока.Количество = 1;
	КонецЦикла;
	ВремМобильныйКлиентЗамерщикаДоступнаяНоменклатура.Свернуть("Номенклатура", "Количество");
	Для Каждого ТекСтрока Из ВремМобильныйКлиентЗамерщикаДоступнаяНоменклатура  Цикл
		Если ТекСтрока.Количество > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Мобильный клиент"": доступная номенклатура мобильного замерщика - """+ТекСтрока.Номенклатура+""" указана более одного раза", , "МобильныйКлиентЗамерщикаДоступнаяНоменклатура",,Отказ);
		КонецЕсли;
	КонецЦикла;
	
	//Если Объект.ИспользуетсяПредварительныйРасчетВМобильномКлиентеЗамерщика и Объект.МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию.Пустая() Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел ""Мобильный клиент"": не указана организация замерщика (мобильный клиент)", , "МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию",,Отказ);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешеноИспользованиеСофтФонаПриИзменении(Элемент)
	Если НЕ Потолки_РазрешеноИспользованиеСофтФона Тогда
		Объект.ТелефонияПринимаетВходящиеЗвонки = Ложь;
	КонецЕсли;
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузокИзИзиСилингПриИзменении(Элемент)
	Если Не ПустаяСтрока(Объект.КаталогВыгрузокИзИзиСилинг) Тогда
		Если НЕ Прав(Объект.КаталогВыгрузокИзИзиСилинг,1) = "\" Тогда
			Объект.КаталогВыгрузокИзИзиСилинг = СокрЛП(Объект.КаталогВыгрузокИзИзиСилинг) + "\";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогДляРезеврныхКопийВыгрузокИзИзиСилингПриИзменении(Элемент)
	Если Не ПустаяСтрока(Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг) Тогда
		Если НЕ Прав(Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг,1) = "\" Тогда
			Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг = СокрЛП(Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг) + "\";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьДоступПоСкладамПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьПравоСписыватьИОприходоватьНаСкладыПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьВидимостьКонтрагентовПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьВидимостьЛидовПоТочкамПродажПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьДоступПоОрганизациямПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьПереченьДоступныхВидовЦенПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	Если ПраваПользователей.ВидЦенДоступенПользователю(Объект.ВидЦен) Тогда
	Иначе
		Объект.ВидЦен = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозницаПриИзменении(Элемент)
	Если Не ПустаяСтрока(Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница) Тогда
		Если НЕ Прав(Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница,1) = "\" Тогда
			Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница = СокрЛП(Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница) + "\";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВыбратьКаталогНаКлиенте(Каталог) 
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = Каталог; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	
	Если ДиалогОткрытия.Выбрать() Тогда 
		Возврат ?(Прав(ДиалогОткрытия.Каталог, 1) = "\", ДиалогОткрытия.Каталог, ДиалогОткрытия.Каталог+ "\"); 
	КонецЕсли;
	Возврат Каталог;	
КонецФункции

&НаКлиенте
Процедура КаталогВыгрузокИзИзиСилингНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Объект.КаталогВыгрузокИзИзиСилинг = ВыбратьКаталогНаКлиенте(Объект.КаталогВыгрузокИзИзиСилинг); 
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КаталогДляРезеврныхКопийВыгрузокИзИзиСилингНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг = ВыбратьКаталогНаКлиенте(Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг); 
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница = ВыбратьКаталогНаКлиенте(Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница); 
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьДоступККонтрагентамПоГруппамДоступаПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьДоступПоКассамИБанковскимСчетамОрганизацийПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьДоступПоЭквайринговымТерминаламПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузокИзИзиСилингРозницаПриИзменении(Элемент)
	Если Не ПустаяСтрока(Объект.КаталогВыгрузокИзИзиСилингРозница) Тогда
		Если НЕ Прав(Объект.КаталогВыгрузокИзИзиСилингРозница,1) = "\" Тогда
			Объект.КаталогВыгрузокИзИзиСилингРозница = СокрЛП(Объект.КаталогВыгрузокИзИзиСилингРозница) + "\";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузокИзИзиСилингРозницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Объект.КаталогВыгрузокИзИзиСилингРозница = ВыбратьКаталогНаКлиенте(Объект.КаталогВыгрузокИзИзиСилингРозница); 
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьРолиИОграничения(Команда)
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Предварительно следует записать элемент");
		Возврат;
	КонецЕсли;
	
	
	ПользовательДляКопирования = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
	ПослеВыбораПользователяДляКопирования = Новый ОписаниеОповещения("ПослеВыбораПользователяДляКопирования",ЭтаФорма);
	ПоказатьВводЗначения(ПослеВыбораПользователяДляКопирования,ПользовательДляКопирования,"Выберите пользователя для копирования");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПользователяДляКопирования(ВыбЗнач, Параметры) Экспорт
	
	Если НЕ ВыбЗнач = Неопределено Тогда
        //Сообщить("Введенное значение: " + ВыбЗнач);
		СкопироватьРолиИОграниченияНаСервере(ВыбЗнач);
		ОбновитьВидимостьЭлементов();
		ПоказатьПредупреждение(,"Роли пользователя скопированы и сохранены");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьРолиИОграниченияНаСервере(ПараметрПользовательОснование)
	
	ПользовательОснование = Неопределено;
	ТекущийПользователь = Неопределено;
	
	СписокПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для НомерПользователя = 0 По СписокПользователей.Количество()-1 Цикл
		ТекПользователь = СписокПользователей[НомерПользователя];
		Если ТекПользователь.Имя = ПараметрПользовательОснование.Наименование
			ИЛИ ТекПользователь.ПолноеИмя = ПараметрПользовательОснование.Наименование Тогда
			ПользовательОснование = ТекПользователь;
		КонецЕсли;
		Если ТекПользователь.Имя = ПользовательИБИмя Тогда
			ТекущийПользователь = ТекПользователь;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПользовательОснование = Неопределено И НЕ ТекущийПользователь = Неопределено Тогда
		
		Потолки_КопированиеРолейИОграничений = Истина; // №9422 флаг, чтобы при вызове СозданииНаСервере повторно не создавать реквизиты
		
		//копируем роли
		ТекущийПользователь.Роли.Очистить();
		Для Каждого ТекущаяРоль Из Метаданные.Роли Цикл
			Если ПользовательОснование.Роли.Содержит(ТекущаяРоль) Тогда
				ТекущийПользователь.Роли.Добавить(ТекущаяРоль);
			КонецЕсли;
		КонецЦикла;
		ТекущийПользователь.Записать();
		ПриСозданииНаСервере(Ложь, Истина);
		
		// №9422 ограничения постоянно добавляются, поэтому реализуем универсальное копирование
		СкопироватьОграничения(ЭтаФорма.Элементы.Найти("ОграниченияДоступа"), ПараметрПользовательОснование);
		
		//++ №9422 комментируем, т.к. выше реализовано универсальное копирование
		//копируем ограничения
		//Объект.ОграничиватьДоступПоКассамИБанковскимСчетамОрганизаций = ПараметрПользовательОснование.ОграничиватьДоступПоКассамИБанковскимСчетамОрганизаций;
		//Объект.ДоступныеКассы.Очистить();
		//Для Каждого СтрокаИсточника Из ПараметрПользовательОснование.ДоступныеКассы Цикл
		//	СтрокаПриемника = Объект.ДоступныеКассы.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		//КонецЦикла;
		//Объект.ДоступныеБанковскиеСчета.Очистить();
		//Для Каждого СтрокаИсточника Из ПараметрПользовательОснование.ДоступныеБанковскиеСчета Цикл
		//	СтрокаПриемника = Объект.ДоступныеБанковскиеСчета.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		//КонецЦикла;
		//
		//Объект.ОграничиватьПравоСписыватьИОприходоватьНаСклады = ПараметрПользовательОснование.ОграничиватьПравоСписыватьИОприходоватьНаСклады;
		//Объект.СкладыНаКоторыеЗапрещеноПриходовать.Очистить();
		//Для Каждого СтрокаИсточника Из ПараметрПользовательОснование.СкладыНаКоторыеЗапрещеноПриходовать Цикл
		//	СтрокаПриемника = Объект.СкладыНаКоторыеЗапрещеноПриходовать.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		//КонецЦикла;
		//Объект.СкладыСКоторыхЗапрещеноРасходовать.Очистить();
		//Для Каждого СтрокаИсточника Из ПараметрПользовательОснование.СкладыСКоторыхЗапрещеноРасходовать Цикл
		//	СтрокаПриемника = Объект.СкладыСКоторыхЗапрещеноРасходовать.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		//КонецЦикла;
		//
		//Объект.ОграничиватьДоступПоСкладам = ПараметрПользовательОснование.ОграничиватьДоступПоСкладам;
		//Объект.ДоступныеСклады.Очистить();
		//Для Каждого СтрокаИсточника Из ПараметрПользовательОснование.ДоступныеСклады Цикл
		//	СтрокаПриемника = Объект.ДоступныеСклады.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		//КонецЦикла;
		//	
		//Объект.ОграничиватьДоступККонтрагентамПоГруппамДоступа = ПараметрПользовательОснование.ОграничиватьДоступККонтрагентамПоГруппамДоступа;
		//Объект.ДоступныеГруппыКонтрагентов.Очистить();
		//Для Каждого СтрокаИсточника Из ПараметрПользовательОснование.ДоступныеГруппыКонтрагентов Цикл
		//	СтрокаПриемника = Объект.ДоступныеГруппыКонтрагентов.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		//КонецЦикла;
		//
		//Объект.ОтображатьТолькоСвоиЛидыВСписке = ПараметрПользовательОснование.ОтображатьТолькоСвоиЛидыВСписке;
		//
		//Объект.ОграничитьВидимостьЛидовПоТочкамПродаж = ПараметрПользовательОснование.ОграничитьВидимостьЛидовПоТочкамПродаж;
		//Объект.ДоступныеТочкиПродаж.Очистить();
		//Для Каждого СтрокаИсточника Из ПараметрПользовательОснование.ДоступныеТочкиПродаж Цикл
		//	СтрокаПриемника = Объект.ДоступныеТочкиПродаж.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		//КонецЦикла;
		//
		//Объект.ОграничиватьДоступПоОрганизациям = ПараметрПользовательОснование.ОграничиватьДоступПоОрганизациям;
		//Объект.ДоступныеОрганизации.Очистить();
		//Для Каждого СтрокаИсточника Из ПараметрПользовательОснование.ДоступныеОрганизации Цикл
		//	СтрокаПриемника = Объект.ДоступныеОрганизации.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		//КонецЦикла;
		//
		//Объект.ОграничиватьПереченьДоступныхВидовЦен = ПараметрПользовательОснование.ОграничиватьПереченьДоступныхВидовЦен;
		//Объект.ДоступныеВидыЦен.Очистить();
		//Для Каждого СтрокаИсточника Из ПараметрПользовательОснование.ДоступныеВидыЦен Цикл
		//	СтрокаПриемника = Объект.ДоступныеВидыЦен.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		//КонецЦикла;
		//
		//Объект.ОграничиватьПереченьДоступныхКатегорийКонтрагентов = ПараметрПользовательОснование.ОграничиватьПереченьДоступныхКатегорийКонтрагентов;
		//Объект.ДоступныеКатегорииКонтрагентов.Очистить();
		//Для Каждого СтрокаИсточника Из ПараметрПользовательОснование.ДоступныеКатегорииКонтрагентов Цикл
		//	СтрокаПриемника = Объект.ДоступныеКатегорииКонтрагентов.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		//КонецЦикла;

		//Объект.ОграничениеДоступаКЛидамДляЗамерщика = ПараметрПользовательОснование.ОграничениеДоступаКЛидамДляЗамерщика;
		//Объект.ОграничениеДоступаКЗаказДоговорамДляЗамерщика = ПараметрПользовательОснование.ОграничениеДоступаКЗаказДоговорамДляЗамерщика;
		//Объект.РазрешеноМенятьОтветсвенногоВЛиде = ПараметрПользовательОснование.РазрешеноМенятьОтветсвенногоВЛиде;
		//
		//Объект.ДополнительныеПраваЗапретРедактированияЦенВДокументах = ПараметрПользовательОснование.ДополнительныеПраваЗапретРедактированияЦенВДокументах;
		////Объект.ДополнительныеПраваЗапретРедактированияДокументовПоступления = ПараметрПользовательОснование.ДополнительныеПраваЗапретРедактированияДокументовПоступления;
		////Объект.ДополнительныеПраваЗапретРедактированияДокументовРеализации = ПараметрПользовательОснование.ДополнительныеПраваЗапретРедактированияДокументовРеализации;
		//Объект.ДополнительныеПраваЗапретРедактированияПроведенныхДокументовДругихПользователей = ПараметрПользовательОснование.ДополнительныеПраваЗапретРедактированияПроведенныхДокументовДругихПользователей;
		//Объект.ДополнительныеПраваЗапретПечатиНепроведенныхДокументов = ПараметрПользовательОснование.ДополнительныеПраваЗапретПечатиНепроведенныхДокументов;
		//-- №9422 комментируем
		
		Записать();
		
		Потолки_КопированиеРолейИОграничений = Ложь; // №9422
		
	КонецЕсли;
	
	
	
КонецПроцедуры

// №9422 ограничения постоянно добавляются, поэтому реализуем универсальное копирование
&НаСервере
Процедура СкопироватьОграничения(мЭлемент, ПользовательОснование)
	
	Для Каждого ПодчиненныйЭлемент Из мЭлемент.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы") И ПодчиненныйЭлемент.ПодчиненныеЭлементы.Количество() > 0 Тогда
			
			СкопироватьОграничения(ПодчиненныйЭлемент, ПользовательОснование);
			
		ИначеЕсли ТипЗнч(ПодчиненныйЭлемент) = Тип("ПолеФормы") И ЗначениеЗаполнено(ПодчиненныйЭлемент.ПутьКДанным) И Лев(ПодчиненныйЭлемент.ПутьКДанным, 7) = "Объект." Тогда
			
			ИмяРеквизита = Прав(ПодчиненныйЭлемент.ПутьКДанным, СтрДлина(ПодчиненныйЭлемент.ПутьКДанным)-7);
			Объект[ИмяРеквизита] = ПользовательОснование[ИмяРеквизита];
			
		ИначеЕсли ТипЗнч(ПодчиненныйЭлемент) = Тип("ТаблицаФормы") И ЗначениеЗаполнено(ПодчиненныйЭлемент.ПутьКДанным) И Лев(ПодчиненныйЭлемент.ПутьКДанным, 7) = "Объект." Тогда
			
			ИмяРеквизита = Прав(ПодчиненныйЭлемент.ПутьКДанным, СтрДлина(ПодчиненныйЭлемент.ПутьКДанным)-7);
			Объект[ИмяРеквизита].Загрузить(ПользовательОснование[ИмяРеквизита].Выгрузить());
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВходящемЗвонкеСоздаватьЛидПриИзменении(Элемент)
	ПриВходящемЗвонкеОткрыватьКарточкуКонтрагента = НЕ ПриВходящемЗвонкеСоздаватьЛид;
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПриВходящемЗвонкеОткрыватьКарточкуКонтрагентаПриИзменении(Элемент)
	ПриВходящемЗвонкеСоздаватьЛид = НЕ ПриВходящемЗвонкеОткрыватьКарточкуКонтрагента;
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ТелефонияПринимаетВходящиеЗвонкиПриИзменении(Элемент)
	
	Если НЕ Объект.ТелефонияПринимаетВходящиеЗвонки
		И НЕ Объект.ТелефонияВыполняетИсходящиеЗвонки // №9362
	Тогда
		Объект.ТелефонияЛогин = "";
		Объект.ЛогинIPТелефонии = "";
	КонецЕсли;
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьПереченьДоступныхКатегорийКонтрагентовПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПраваЗапретРедактированияПроведенныхДокументовПоТипамПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПраваЗапретПометкинаУдалениеДокументовПоТипамПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Функция КаталогиЗагрузкиИзПостроителяНаСервере()
	Возврат Константы.КаталогиЗагрузкиИзПостроителяУказываютНаПапкиСервера.Получить();
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	
	ВидимостьЭлементовТелефонии = СофтФон.ИспользуютсяСофтФон() ИЛИ СофтФон.ИспользуетсяИнтеграцияСIPАТС();
	Элементы.РазрешеноИспользованиеСофтФона.Видимость = ВидимостьЭлементовТелефонии;
	// №5011 комментируем, т.к. звонки теперь отдельно
	//Элементы.НеОтображатьВкладкуЗвонкиВАРМ.Видимость  = ВидимостьЭлементовТелефонии; //#5171 (персональная)
	
	Элементы.ВидВходящегоКонтактаСофтФон.Видимость 		 = Потолки_РазрешеноИспользованиеСофтФона;
	Элементы.ТелефонияПринимаетВходящиеЗвонки.Видимость  = Потолки_РазрешеноИспользованиеСофтФона;
	Элементы.ГруппаЛогиныТелефонии.Видимость 			 = Потолки_РазрешеноИспользованиеСофтФона И (Объект.ТелефонияПринимаетВходящиеЗвонки
		ИЛИ (Объект.ТелефонияВыполняетИсходящиеЗвонки И Потолки_ДоступныИсходящиеЗвонки)); // №9362
	//Элементы.ТелефонияЛогин.Видимость 				 = РазрешеноИспользованиеСофтФона И Объект.ТелефонияПринимаетВходящиеЗвонки;
	//Элементы.ЛогинIPТелефонии.Видимость 				 = РазрешеноИспользованиеСофтФона И Объект.ТелефонияПринимаетВходящиеЗвонки;	
	Элементы.ГруппаПриВходящемЗвонке.Видимость 			 = Потолки_РазрешеноИспользованиеСофтФона И Объект.ТелефонияПринимаетВходящиеЗвонки;
	Элементы.ТелефонияВыполняетИсходящиеЗвонки.Видимость = Потолки_РазрешеноИспользованиеСофтФона И Потолки_ДоступныИсходящиеЗвонки; // №9362
	
	//Если ПраваПользователей.РазрешеноИспользованиеСофтФона() Тогда
	//	Элементы.ПозвонитьПоНомеру.Видимость = Истина;
	//Иначе
	//	Элементы.ПозвонитьПоНомеру.Видимость = Ложь;
	//КонецЕсли;
	
	//Элементы.ГруппаПриВходящемЗвонке.Видимость = Объект.ТелефонияПринимаетВходящиеЗвонки;
	
	Элементы.ГруппаКаталогВыгрузокИзИзиСилинг.Доступность = ПапкиПостроителяОпределяютсяВКарточкеПользователя();
	Элементы.ПереноситьВАрхивРасчетыПостроителяПроизводство.Доступность = ПапкиПостроителяОпределяютсяВКарточкеПользователя();
	Элементы.ГруппаКаталогДляРезеврныхКопийВыгрузокИзИзиСилинг.Доступность = ПапкиПостроителяОпределяютсяВКарточкеПользователя() И ПереноситьВАрхивЧертежиПостроителя();
	
	Элементы.ГруппаКаталогВыгрузокИзИзиСилингРозница.Доступность = ПапкиПостроителяОпределяютсяВКарточкеПользователяРозница();
	Элементы.ПереноситьВАрхивРасчетыПостроителяРозница.Доступность = ПапкиПостроителяОпределяютсяВКарточкеПользователяРозница();
	Элементы.ГруппаКаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница.Доступность = ПапкиПостроителяОпределяютсяВКарточкеПользователяРозница() И ПереноситьВАрхивЧертежиПостроителяРозница();
		
	Элементы.ГруппаДоступаПоСкладам.Видимость = Объект.ОграничиватьДоступПоСкладам;
	Элементы.ГруппаОграниченияНаОприходованиеИСписываниеСоСкладов.Видимость = Объект.ОграничиватьПравоСписыватьИОприходоватьНаСклады;
	Элементы.ГруппаДоступныеГруппыДоступаККонтрагентам.Видимость = Объект.ОграничиватьДоступККонтрагентамПоГруппамДоступа;
	Элементы.ДоступныеТочкиПродаж.Видимость = Объект.ОграничитьВидимостьЛидовПоТочкамПродаж;
	Элементы.ГруппаДоступаПоОрганизациям.Видимость = Объект.ОграничиватьДоступПоОрганизациям;
	Элементы.ДоступныеВидыЦен.Видимость = Объект.ОграничиватьПереченьДоступныхВидовЦен;
	Элементы.ДоступныеСтатусыЛида.Видимость = Объект.ОграничитьДоступКЛидамПоСтатусуЛида; // №12217
	
	Элементы.ТаблицаЗапрещенныеПослеПроведенияДокументы.Видимость = Объект.ДополнительныеПраваЗапретРедактированияПроведенныхДокументовПоТипам;
	Элементы.ТаблицаЗапрещенныеКПометкеУдаленияТипыДокументов.Видимость = Объект.ДополнительныеПраваЗапретПометкиНаУдалениеДокументовПоТипам;
	
	Если НЕ КаталогиЗагрузкиИзПостроителяНаСервере() Тогда
		Элементы.КаталогВыгрузокИзИзиСилинг.Подсказка = "* Указывается путь, как его видит клиентский компьютер";
		Элементы.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг.Подсказка = "* Указывается путь, как его видит клиентский компьютер";
		Элементы.КаталогВыгрузокИзИзиСилингРозница.Подсказка = "* Указывается путь, как его видит клиентский компьютер";
		Элементы.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница.Подсказка = "* Указывается путь, как его видит клиентский компьютер";
	Иначе
		Элементы.КаталогВыгрузокИзИзиСилинг.Подсказка = "* Если используется клиент-серверный вариант, указывается путь, как его видит сервер
		|* Если используется файловый вариант, указывается путь, как его видит клиент";
		Элементы.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг.Подсказка =  "* Если используется клиент-серверный вариант, указывается путь, как его видит сервер
		|* Если используется файловый вариант, указывается путь, как его видит клиент";
		Элементы.КаталогВыгрузокИзИзиСилингРозница.Подсказка = "* Если используется клиент-серверный вариант, указывается путь, как его видит сервер
		|* Если используется файловый вариант, указывается путь, как его видит клиент";
		Элементы.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница.Подсказка =  "* Если используется клиент-серверный вариант, указывается путь, как его видит сервер
		|* Если используется файловый вариант, указывается путь, как его видит клиент";
	КонецЕсли;
	
	Элементы.ГруппаКассыИСчета.Видимость = Объект.ОграничиватьДоступПоКассамИБанковскимСчетамОрганизаций;	
	Элементы.ГруппаЭквайринговыеТерминалы.Видимость = Объект.ОграничиватьДоступПоЭквайринговымТерминалам; //#9431
	
	Элементы.ДоступныеКатегорииКонтрагентов.Видимость = Объект.ОграничиватьПереченьДоступныхКатегорийКонтрагентов;
	
	Если ПриВходящемЗвонкеОткрыватьКарточкуКонтрагента Тогда
		Объект.ПриПоднятииТрубкиОткрыватьКарточкуКонтрагента = Истина;
	ИначеЕсли ПриВходящемЗвонкеСоздаватьЛид Тогда
		Объект.ПриПоднятииТрубкиОткрыватьКарточкуКонтрагента = Ложь;
	КонецЕсли;
	
	Элементы.ВидыЦенОтображаемыеВСправочникеНоменклатуры.Видимость = Объект.ПоказыватьТаблицуЦенВСправочникеНоменклатуры;
	
	ОбновитьВидимостьЭлементовНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПапкиПостроителяОпределяютсяВКарточкеПользователя()
	
	Возврат Константы.ИндивидуальныеКаталогиЗагрузкиЧертежейИзEasyCeiling.Получить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПапкиПостроителяОпределяютсяВКарточкеПользователяРозница()
	
	Возврат Константы.ПапкиОпределяютсяВКарточкеПользователяРозница.Получить();
	
КонецФункции

&НаСервере
Функция ПереноситьВАрхивЧертежиПостроителя()
	
	//Возврат Константы.ПереноситьВАрхивРасчетыПостроителяПроизводство.Получить();
	Возврат Объект.ПереноситьВАрхивРасчетыПостроителяПроизводство;
	
КонецФункции

&НаСервере
Функция ПереноситьВАрхивЧертежиПостроителяРозница()
	
	//Возврат Константы.ПереноситьФайлыВАрхивПриЗагрузкеПотолкаИзПостроителяВРознице.Получить();
	Возврат Объект.ПереноситьФайлыВАрхивПриЗагрузкеПотолкаИзПостроителяВРознице;
	
КонецФункции

&НаСервере
Процедура ОбновитьВидимостьЭлементовНаСервере()
	
	Элементы.ДекорацияЕстьРольТерминалСамообслуживания.Видимость = Объект.ПриЗапускеПрограммыЗапускатьТерминалСамообслуживания; //++ №10802 теперь регулируется галочкой, было: ЕстьРольТерминалСамообслуживания;
	Элементы.ВестиТабель.Видимость = Константы.ВестиТабельСотрудников.Получить();
	Элементы.УведомлятьОСостоянииОтправкиСМС.Видимость = Константы.АвтоматическаяРассылкаСМС.Получить();
	
	Элементы.ГруппаМобильныйЗамерщикНастройкиПредварительныхРасчетов.Видимость = Объект.ИспользуетсяПредварительныйРасчетВМобильномКлиентеЗамерщика И Константы.ИспользуютсяИндивидуальныеНастройкиМобильногоКлиентаДляПользователей.Получить();
	
КонецПроцедуры

//++ №10802 кмоментируем, т.к. теперь регулируется галочкой
//&НаСервере
//Процедура ПроверитьНаличиеРолиТерминалСамообслуживания()
//	
//	ВремРоли = РеквизитФормыВЗначение("Роли");
//	Для Каждого ТекСтрока Из ВремРоли.Строки Цикл
//		Если ТекСтрока.Имя = "ТерминалСамообслуживания" Тогда
//			ЕстьРольТерминалСамообслуживания = ТекСтрока.Пометка;
//		КонецЕсли;
//	КонецЦикла;
//	ОбновитьВидимостьЭлементовНаСервере();
//	
//КонецПроцедуры
//-- №10802

&НаКлиенте
Процедура МобильныйКлиент_ЛогинПриИзменении(Элемент)
	//Объект.МобильныйКлиент_Логин = СокрЛП(Объект.МобильныйКлиент_Логин);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТаблицуЦенВСправочникеНоменклатурыПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Функция ПолучитьВалютуУчета()
	Возврат Константы.ВалютаУчета.Получить();
КонецФункции

&НаКлиенте
Процедура ВидыЦенОтображаемыеВСправочникеНоменклатурыВидЦеныПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВидыЦенОтображаемыеВСправочникеНоменклатуры.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.Валюта = ПолучитьВалютуУчета();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентМонтажникаПоказыватьВыполненныеМонтажиПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентМонтажникаПоказыватьМонтажиВРаботеПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаПоказыватьЗакрытыеЗамерыПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаПоказыватьЗамерыВРаботеПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПереноситьВАрхивРасчетыПостроителяРозницаПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПереноситьВАрхивРасчетыПостроителяПроизводствоПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайлыВКаталоге(Путь)
	
	Попытка
		Если НЕ ПустаяСтрока(Путь) Тогда
			МассивНайденныхФайлов = НайтиФайлы(Путь,"*", Ложь);
			Для Каждого Файл Из МассивНайденныхФайлов Цикл
				Если НЕ Файл.ЭтоКаталог() Тогда
					УдалитьФайлы(Путь,Файл.Имя);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ПоказатьПредупреждение(,"Все файлы в папке " + Путь + " удалены");
	Исключение
		ПоказатьПредупреждение(,"Ошибка удаления файлов: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУдаленииФайловВКаталоге(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        УдалитьФайлыВКаталоге(Параметры.Путь);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьПодтверждениеУдаленияФайловВКаталоге(Путь)
	
	Парам = Новый Структура;
	Парам.Вставить("Путь", Путь);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУдаленииФайловВКаталоге", ЭтаФорма, Парам);
	ПоказатьВопрос(Оповещение, "Удалить все файлы в папке " 
	+ Символы.ПС
	+ Символы.ПС
	+ Путь + " ?"
	+ Символы.ПС
	+ Символы.ПС + "ВНИМАНИЕ! Файлы будут удалены безвозвратно!", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогРезервныхКопийРозница(Команда)
	
	ЗапроситьПодтверждениеУдаленияФайловВКаталоге(Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилингРозница);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогВыгрузкиИзПостроителяРозница(Команда)
	
	ЗапроситьПодтверждениеУдаленияФайловВКаталоге(Объект.КаталогВыгрузокИзИзиСилингРозница);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогРезервныхКопийПроизводство(Команда)
	
	ЗапроситьПодтверждениеУдаленияФайловВКаталоге(Объект.КаталогДляРезеврныхКопийВыгрузокИзИзиСилинг);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогВыгрузкиИзПостроителяПроизводство(Команда)
	
	ЗапроситьПодтверждениеУдаленияФайловВКаталоге(Объект.КаталогВыгрузокИзИзиСилинг);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТелефонияВыполняетИсходящиеЗвонкиПриИзменении(Элемент)
	
	Если НЕ Объект.ТелефонияПринимаетВходящиеЗвонки И НЕ Объект.ТелефонияВыполняетИсходящиеЗвонки Тогда
		Объект.ТелефонияЛогин = "";
		Объект.ЛогинIPТелефонии = "";
	КонецЕсли;
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

//++ №10802
&НаКлиенте
Процедура ПриЗапускеПрограммыЗапускатьТерминалСамообслуживанияПриИзменении(Элемент)
	
	// Нужно получить подтверждение от пользователя на установку данной галочки
	Если Объект.ПриЗапускеПрограммыЗапускатьТерминалСамообслуживания Тогда
		
		ТекстВопроса = "При продолжении пользователю будет добавлена специальная роль ""Терминал самообслуживания"".
		|Это роль установки ограничений для стоек с сенсорным экраном - данному пользователю будет урезан интерфейс и для закрытия программы для пользователя будет запрашиваться пароль из соответствующих настроек.
		|Продолжить?";
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВопросаОДобавленииРолиТерминалСамообслуживания", ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Добавление роли ""Терминал самообслуживания""");
		
	Иначе
		
		ОбновитьВидимостьЭлементовНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОДобавленииРолиТерминалСамообслуживания(Ответ, ДопПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.ПриЗапускеПрограммыЗапускатьТерминалСамообслуживания = Ложь;
		Модифицированность = Истина;
		
	КонецЕсли;
	
	ОбновитьВидимостьЭлементовНаСервере();
	
КонецПроцедуры
//-- №10802

&НаКлиенте
Процедура ОграничитьДоступКЛидамПоСтатусуЛидаПриИзменении(Элемент)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаДоступныеВидыЦенПоУмолчаниюПриИзменении(Элемент)
	ТекущиеДанные = Элементы.МобильныйКлиентЗамерщикаДоступныеВидыЦен.ТекущиеДанные;
	Если ТекущиеДанные.ПоУмолчанию Тогда
		Для Каждого ТекСтрока Из Объект.МобильныйКлиентЗамерщикаДоступныеВидыЦен Цикл
			Если ТекСтрока.ВидЦены = ТекущиеДанные.ВидЦены Тогда
				ТекСтрока.ПоУмолчанию = Истина;
			Иначе
				ТекСтрока.ПоУмолчанию = Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ТекСтрока Из Объект.МобильныйКлиентЗамерщикаДоступныеВидыЦен Цикл
			ТекСтрока.ПоУмолчанию = Ложь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаДоступныеВидыЦенПриИзменении(Элемент)
	Потолки_ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаДоступныеВидыСкидокПриИзменении(Элемент)
	Потолки_ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаДоступнаяНоменклатураПриИзменении(Элемент)
	Потолки_ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

//&НаСервере
//Процедура МобильныйКлиентЗамерщикаОрганизацияПоУмолчаниюПриИзмененииНаСервере()
	//Объект.МобильныйКлиентЗамерщикаПредставлениеОрганизации = Объект.МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию.ПолноеНаименование;
	
	//НовыйФайл = Справочники.ОрганизацииФайлы.СоздатьЭлемент();
	//НовыйФайл.Файл = Новый ХранилищеЗначения(Объект.МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию.ФайлЛоготип.Файл.Получить());
	//НовыйФайл.Записать();
	//
	//Если Объект.МобильныйКлиентЗамерщикаЛоготипОрганизации.Пустая() = Ложь и Объект.МобильныйКлиентЗамерщикаЛоготипОрганизации.ПолучитьОбъект()<>Неопределено Тогда		
	//	Попытка
	//		СтарыйФайл = Объект.МобильныйКлиентЗамерщикаЛоготипОрганизации.ПолучитьОбъект();
	//		СтарыйФайл.Удалить();
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//
	//Объект.МобильныйКлиентЗамерщикаЛоготипОрганизации = НовыйФайл.Ссылка;
	//МобильныйКлиентЗамерщикаЛоготипОрганизацииПоле = ПолучитьНавигационнуюСсылку(НовыйФайл, "Файл");
	//
	//
	//НовыйФайл = Справочники.ОрганизацииФайлы.СоздатьЭлемент();
	//НовыйФайл.Файл = Новый ХранилищеЗначения(Объект.МобильныйКлиентЗамерщикаОрганизацияПоУмолчанию.ФайлПечать.Файл.Получить());
	//НовыйФайл.Записать();
	//
	//Если Объект.МобильныйКлиентЗамерщикаПечатьОрганизации.Пустая() = Ложь и Объект.МобильныйКлиентЗамерщикаПечатьОрганизации.ПолучитьОбъект()<>Неопределено Тогда		
	//	Попытка
	//		СтарыйФайл = Объект.МобильныйКлиентЗамерщикаПечатьОрганизации.ПолучитьОбъект();
	//		СтарыйФайл.Удалить();
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//
	//Объект.МобильныйКлиентЗамерщикаПечатьОрганизации = НовыйФайл.Ссылка;
	//МобильныйКлиентЗамерщикаПечатьОрганизацииПоле = ПолучитьНавигационнуюСсылку(НовыйФайл, "Файл");
	
//КонецПроцедуры

//&НаКлиенте
//Процедура МобильныйКлиентЗамерщикаОрганизацияПоУмолчаниюПриИзменении(Элемент)
//	МобильныйКлиентЗамерщикаОрганизацияПоУмолчаниюПриИзмененииНаСервере();
//	Потолки_ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
//КонецПроцедуры

//&НаКлиенте
//Процедура МобильныйКлиентЗамерщикаПредставлениеОрганизацииПриИзменении(Элемент)
//	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗагрузитьОчиститьЛоготип(Команда)
//	ЗагрузитьОчиститьКартинку(МобильныйКлиентЗамерщикаЛоготипОрганизацииПоле, Объект.МобильныйКлиентЗамерщикаЛоготипОрганизации);	
//	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗагрузитьОчиститьКартинку(ПолеКартинки, ОбъектКартинки)	
//	Если ОбъектКартинки.Пустая() Тогда
//		ЗагрузитьКартинку(ПолеКартинки, ОбъектКартинки);
//	Иначе
//		ОчиститьКартинку(ПолеКартинки, ОбъектКартинки);
//	КонецЕсли;	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОчиститьКартинку(ПолеКартинки, ОбъектКартинки)
//	Если ОбъектКартинки.Пустая() = Ложь Тогда		
//		УдалитьКартинку(ОбъектКартинки);
//		ОбъектКартинки = Неопределено;
//		ПолеКартинки = "";
//	конецесли;
//КонецПроцедуры

//&НаСервере
//Процедура УдалитьКартинку(ОбъектКартинки)
//	Попытка
//		СтарыйФайл = ОбъектКартинки.ПолучитьОбъект();
//		СтарыйФайл.Удалить();
//	Исключение
//	КонецПопытки;
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗагрузитьКартинку(ПолеКартинки, ОбъектКартинки)
//	ИмяФайла = "";
//	ПутьФайла = "";
//	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда	
//		ПолеКартинки = ПутьФайла;

//		УстановитьКартинку(ПолеКартинки, ОбъектКартинки);
//		Модифицированность=Истина;
//	КонецЕсли; 
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьКартинку(ПолеКартинки, ОбъектКартинки)
//	НовыйФайл = Справочники.ОрганизацииФайлы.СоздатьЭлемент();
//	НовыйФайл.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ПолеКартинки));
//	ПолеКартинки = ПоместитьВоВременноеХранилище(НовыйФайл.Файл.Получить());
//	НовыйФайл.Записать();
//	
//	Если ОбъектКартинки.Пустая() = Ложь и ОбъектКартинки.ПолучитьОбъект()<>Неопределено Тогда		
//		СтарыйФайл = ОбъектКартинки.ПолучитьОбъект();
//		СтарыйФайл.Удалить();
//	КонецЕсли;

//	ОбъектКартинки = НовыйФайл.Ссылка;
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗагрузитьОчиститьПечатьМобильныйКлиентЗамерщика(Команда)
//	ЗагрузитьОчиститьКартинку(МобильныйКлиентЗамерщикаПечатьОрганизацииПоле, Объект.МобильныйКлиентЗамерщикаПечатьОрганизации);	
//	ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
//КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентЗамерщикаРучнаяУстановкаЦенПриИзменении(Элемент)
	Потолки_ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуРолиИнтерактивноеОткрытиеВнешнихОтчетовИОбработок()
	
	Для каждого СтрокаПодсистемы из Роли.ПолучитьЭлементы() Цикл
		Если СтрокаПодсистемы.Имя = "ДополнительныеПрава" Тогда
			Для каждого СтрокаРоли из СтрокаПодсистемы.ПолучитьЭлементы() Цикл
				Если СтрокаРоли.Имя = "ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок" Тогда
					СтрокаРоли.Пометка = Ложь;
					СтрокаПодсистемы.Пометка = Ложь;
					
					НайденныеРоли = ПользовательИБРоли.НайтиСтроки(Новый Структура("Роль", "ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок"));
					Если НайденныеРоли.Количество() > 0 Тогда
						ПользовательИБРоли.Удалить(НайденныеРоли[0]);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяПредварительныйРасчетВМобильномКлиентеЗамерщикаПриИзменении(Элемент)
	ОбновитьВидимостьЭлементовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентПредлагатьСопутствующиеТоварыПриИзменении(Элемент)
	Потолки_ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентИзменятьСопутствующиеТоварыПриИзменении(Элемент)
	Потолки_ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентУдалятьСопутствующиеТоварыПриИзменении(Элемент)
	Потолки_ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиента = Истина;
КонецПроцедуры

#КонецОбласти
