
Процедура ПередЗаписью(Отказ, Замещение)
	Отказ = ЭтотОбъект.Отбор.Регистратор.Значение.Дата <= Константы.ИА_ФП_ДатаЗапретаРедактирования.Получить();
	Если Отказ Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Установлена дата запрета редактирования!";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
	Если ИА_ФП_ПовторИсп.ОтключитьПодразделения() Тогда
		для каждого стр из ЭтотОбъект Цикл
			стр.Подразделение = Справочники.ИА_ЦФО.ПустаяСсылка();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


