&НаКлиенте
Процедура РасписаниеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РедакторРасписания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	РедакторРасписания.Показать(Новый ОписаниеОповещения("ДекРасписаниеНажатиеЗавершение", ЭтотОбъект));		
	
КонецПроцедуры

&НаКлиенте
Процедура ДекРасписаниеНажатиеЗавершение(Расписание11, ДополнительныеПараметры) Экспорт
		
	Если Расписание11<>Неопределено Тогда
		Расписание = Расписание11;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Расписание = Новый РасписаниеРегламентногоЗадания;
	Иначе
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Объект.РегламентноеЗадание);
		Если Задание =  Неопределено Тогда
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.КСУ_ЗадачаКоммцентра);
			Задание.Записать();
			Объект.РегламентноеЗадание = Задание.УникальныйИдентификатор;
		КонецЕсли;
		Расписание = Задание.Расписание;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ТекущийОбъект.РегламентноеЗадание);
	Если Задание =  Неопределено Тогда
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.КСУ_ЗадачаКоммцентра);
		Задание.Записать();
		ТекущийОбъект.РегламентноеЗадание = Задание.УникальныйИдентификатор;
		Расписание = Задание.Расписание;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ТекущийОбъект.РегламентноеЗадание);
	Задание.Ключ = ТекущийОбъект.Код;
	Задание.Расписание = Расписание;
	Задание.Использование = ТекущийОбъект.Использование;
	Задание.Наименование = "Периодические задачи КСУ " +Задание.Ключ;
	
	П = Новый Массив;
	П.Добавить(ТекущийОбъект.Код);
	
	Задание.Параметры = П;
	Задание.Записать();
КонецПроцедуры

