#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;	
		
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Инвентаризация") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			Если ТекСтрокаТовары.КоличествоОтклонение > 0 Тогда
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
				НоваяСтрока.Количество = ТекСтрокаТовары.КоличествоОтклонение;
				НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
				НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
				НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
				
				НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
				НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		
		Документы.ЗаказНаПроизводство.ПроверитьВозможностьВводаНаОснованииЗаказа(ДанныеЗаполнения);
		
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		Основание = ДанныеЗаполнения;
		
		//#13705
		Для каждого СтрокаТЧ из ДанныеЗаполнения.Материалы Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыпускПродукции") Тогда
				
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.СкладМатериалов;
		Основание = ДанныеЗаполнения.Ссылка;		
		Подразделение = ДанныеЗаполнения.Подразделение;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		
		//#16921 для возврата товаров с рекламаций
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.СкладТоваров;
		Основание = ДанныеЗаполнения;
		
		// пока не нужно
		//Для каждого СтрокаТЧ из ДанныеЗаполнения.ТоварыУслуги Цикл
		//	Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаТЧ.Номенклатура) Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	НоваяСтрока = Товары.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		//КонецЦикла;
		
	КонецЕсли;
	
	СтатьяДоходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект);
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	// регистр ТоварыНаСкладах
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого Товар Из Товары Цикл
		Приход = Движения.ТоварыНаСкладах.Добавить();
		Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
		Приход.Период = Дата;
		Приход.Организация = ОрганизацияТоваров;
		Приход.Склад = Склад;
		Приход.Номенклатура = Товар.Номенклатура;
		Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		Приход.СерияНоменклатуры = Товар.СерияНоменклатуры;
		Приход.Количество = Товар.Количество * Товар.Коэффициент;
		Приход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.Сумма);
		Приход.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Товар.Сумма); //#8288
	КонецЦикла;
	
	// регистр ДоходыРасходы
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод
			Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движения.ДоходыРасходы.Записывать = Истина;
			Для Каждого ТекущаяСтрока Из Товары Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяДоходов.Пустая(), ТекущаяСтрока.СтатьяДоходов, СтатьяДоходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;				
				
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
				Движение.СуммаРасходов 	= 0;				
			КонецЦикла;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли