Функция ПолучитьЭлемент(ИмяКлюча) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ИА_Константы.Ссылка
    |ИЗ
    |	Справочник.ИА_Константы КАК ИА_Константы
    |ГДЕ
    |	ИА_Константы.Ключ = &Ключ
    |	И НЕ ИА_Константы.ПометкаУдаления";
    Запрос.УстановитьПараметр("Ключ", ИмяКлюча);
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если Выборка.Следующий() Тогда
        Результат = Выборка.Ссылка;                
    Иначе
        Попытка
            Результат = Справочники.ИА_Константы[ИмяКлюча];
        Исключение
            Результат = Справочники.ИА_Константы.ПустаяСсылка();    
        КонецПопытки; 
    КонецЕсли;
    Возврат Результат;
КонецФункции


Функция ЗначениеКонстанты(ИмяКлюча) Экспорт
    Эл = ПолучитьЭлемент(ИмяКлюча);
    Возврат Эл.Значение;
КонецФункции
 