
Процедура ПередЗаписью(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
    ОбновитьПовторноИспользуемыеЗначения();
    Если ПометкаУдаления Тогда Возврат КонецЕсли;
    
    Попытка
        Врем = Справочники.ИА_Константы[Ключ].Значение;
        ЕстьПредопределенное = Истина;
    Исключение
        ЕстьПредопределенное = Ложь;
    КонецПопытки; 
    
    Если ЭтотОбъект.Предопределенный Тогда
        Ключ = "";
    ИначеЕсли НЕ ЗначениеЗаполнено(Ключ) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Заполните ""Ключ""!";
        Сообщение.Сообщить(); 
    ИначеЕсли ЕстьПредопределенное Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Уже есть предопределенный элемент по имени ""Ключ""!";
        Сообщение.Сообщить(); 
    Иначе
        Попытка
            Стр = Новый Структура(Ключ, "1");
        Исключение
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Недопустимое значение для реквизита ""Ключ""!";
            Сообщение.Сообщить(); 
        КонецПопытки; 
    КонецЕсли; 
КонецПроцедуры
