
//Хранит значения настроек пользователя
Перем СохраненнаяНастройка Экспорт; 

//Таблица вариантов доступных текущему пользователю
Перем ТаблицаВариантовСохраненныхНастроекОтчета Экспорт;    

//
//
Процедура ЗаполнитьТаблицуДоступныхВариантовСохраненныхНастроек() Экспорт
	
	ТаблицаВариантовСохраненныхНастроекОтчета.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СохраненныеНастройкиПользователи.Ссылка,
	|	СохраненныеНастройкиПользователи.Ссылка.Наименование КАК Наименование,
	|	СохраненныеНастройкиПользователи.Ссылка.Описание
	|ИЗ
	|	Справочник.СохраненныеНастройки.Пользователи КАК СохраненныеНастройкиПользователи
	|ГДЕ
	|	СохраненныеНастройкиПользователи.Ссылка.НастраиваемыйОбъект = &НастраиваемыйОбъект
	|	И (СохраненныеНастройкиПользователи.Пользователь.Ссылка = &Пользователь
	|			ИЛИ СохраненныеНастройкиПользователи.Пользователь.Ссылка В
	|				(ВЫБРАТЬ
	|					ГруппыПользователейПользователиГруппы.Ссылка
	|				ИЗ
	|					Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейПользователиГруппы
	|				ГДЕ
	|					ГруппыПользователейПользователиГруппы.Пользователь.Ссылка = &Пользователь
	|				СГРУППИРОВАТЬ ПО
	|								ГруппыПользователейПользователиГруппы.Ссылка)
	|			ИЛИ СохраненныеНастройкиПользователи.Пользователь.Ссылка = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи))
	|	И (НЕ СохраненныеНастройкиПользователи.Ссылка.ПометкаУдаления)
	|	И (НЕ СохраненныеНастройкиПользователи.Ссылка.ЭтоГруппа)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	//Запрос.УстановитьПараметр("Пользователь"		  , ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Пользователь"		  , ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("НастраиваемыйОбъект"   , "ОтчетОбъект." + ЭтотОбъект.Метаданные().Имя);
	Запрос.УстановитьПараметр("ПолныеПрава"		      , РольДоступна("ПолныеПрава"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = ТаблицаВариантовСохраненныхНастроекОтчета.Добавить();
		
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		
		Если ТаблицаВариантовСохраненныхНастроекОтчета.Индекс(Запись) = 7 Тогда
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Сохранение настроек
//
Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("НастройкиКомпоновщика" , КомпоновщикНастроек.ПолучитьНастройки());	
	
	Лен_СохранениеНастроекСервер.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

//Применение настроек
//
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	
	Для Каждого Значение Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Значение.Использование
			И Значение.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект") Тогда
			
			ВрОбъектЛЗ = Значение.ЛевоеЗначение;
			ВрОбъектВС = Значение.ВидСравнения;
			ВрОбъектПЗ = Значение.ПравоеЗначение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		
		КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураПараметров.НастройкиКомпоновщика);
		
	Исключение
	КонецПопытки;	
	
	Если ЗначениеЗаполнено(ВрОбъектПЗ) Тогда
		
		Для Каждого Значение Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			
			Если Значение.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект") Тогда
				
				Значение.ЛевоеЗначение  = ВрОбъектЛЗ;
				Значение.ВидСравнения   = ВрОбъектВС;
				Значение.ПравоеЗначение = ВрОбъектПЗ;
				
			КонецЕсли
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

//
//
Процедура УстановитьПроверитьПериодОтчета() Экспорт
	
	//Если начало периода больше его окончания, то выведем предупреждение
	//и автоматически откорректируем период
	Если НачалоПериода > КонецПериода Тогда
		
		Сообщить("Начало периода не может быть больше его окончания: " + "Дата начала: " + Формат(НачалоПериода,"ДЛФ = Д") + " > " + "Дата окончания: " + Формат(КонецПериода,"ДЛФ = Д") + ", период отчета установлен в исходное состояние.",СтатусСообщения.Важное);
		
		НачалоПериода = ТекущаяДата();
		
		КонецПериода  = КонецДня(ТекущаяДата());		
		
	КонецЕсли;
	
КонецПроцедуры

//
//
Процедура ВывестиКорпоративныйЗаголовокОтчета(ТабличныйДокумент)
	
	Макет = ПолучитьМакет("Заголовок");
	
	Область = Макет.ПолучитьОбласть("Заголовок");	
	Область.Параметры.ЗаголовокОтчета	= ЭтотОбъект.Метаданные().Синоним;	
	
	Если ЗначениеЗаполнено(НачалоПериода)
	   И ЗначениеЗаполнено(КонецПериода) Тогда
	   
		Область.Параметры.ОписаниеПериода	= "Период с " + Формат(НачалоПериода,"ДЛФ=Д") + " по " + Формат(КонецПериода,"ДЛФ=Д");			
		
	Иначе
		
		Область.Параметры.ОписаниеПериода	= "Период: без ограничения";	
		
	КонецЕсли;
	
	//Область.Параметры.Организация		= "Организация: "  + Справочники.Организации.Основная_Организация;
	//Область.Параметры.Пользователь		= "Пользователь: " + СокрЛП(ПараметрыСеанса.ТекущийПользователь.Наименование);
	Область.Параметры.Пользователь		= "Пользователь: " + СокрЛП(ПараметрыСеанса.ТекущийПользователь.Наименование);
	Область.Параметры.Дата			    = "Дата формирования отчета: " + ТекущаяДата();
	
	ТекстОтбора = "Отбор: ";
	
	Для Каждого Значение Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если НЕ Значение.Использование Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ПолеОтбора = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Значение.ЛевоеЗначение);
		
		Если ПолеОтбора <> Неопределено Тогда
			ИмяПоля = ПолеОтбора.Заголовок;
		Иначе
			ИмяПоля = Значение.ЛевоеЗначение;			
		КонецЕсли;
		
		ТекстОтбора = ТекстОтбора + ИмяПоля + " " + Значение.ВидСравнения + " " + Значение.ПравоеЗначение + Символы.ПС;
		
	КонецЦикла;
	
	Область.Параметры.Отбор			    = ТекстОтбора;	
	
	ТабличныйДокумент.Вывести(Область);
	
	ТабличныйДокумент.ФиксацияСверху = 9;
	
КонецПроцедуры

//
//
Процедура ДобавитьОтбор(Значение,Отбор,Имя,ВидСравненияКомпоновки)
	
	Элемент = Отбор.Найти(Имя);
	
	Если Элемент = Неопределено Тогда
		
		Элемент = Отбор.Добавить(Имя);
		
	КонецЕсли;
	
	Элемент.ВидСравнения  = ПолучитьСопостовлениеТипаВидаСравненияКопоновщикаИПостроителя(ВидСравненияКомпоновки,Элемент.ТипЗначения);
	
	Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		
		СписокЗначений = Новый СписокЗначений;
		
		Для Каждого Запись Из Значение Цикл
			
			Если Имя = "Пользователь" Тогда
				СписокЗначений.Добавить(СокрЛП(Запись.Значение.Наименование));				
			ИначеЕсли Имя = "Данные"
				ИЛИ Имя = "ЗначениеРеквизита" Тогда
				СписокЗначений.Добавить(ЗначениеВСтрокуВнутр(Запись.Значение));
			Иначе
				СписокЗначений.Добавить(СокрЛП(Запись.Значение));					
			КонецЕсли;
			
		КонецЦикла;
		
		Элемент.Значение = СписокЗначений;
		
	Иначе
		
		Если Имя = "Пользователь" Тогда
			Элемент.Значение = СокрЛП(Значение.Наименование);
		ИначеЕсли (Имя = "Объект"
			ИЛИ Имя = "ЗначениеРеквизита") Тогда			
			Элемент.Значение = ЗначениеВСтрокуВнутр(Значение);
		Иначе
			Элемент.Значение = СокрЛП(Значение);			
		КонецЕсли;
		
	КонецЕсли;
	
	Элемент.Использование = Истина;	
	
КонецПроцедуры

//
//
Процедура СинхронизироватьОтборПотсроителяОтчетаИКомпоновщика(ПостроительОтчета)
	
	Для Каждого Значение Из ПостроительОтчета.ДоступныеПоля Цикл
		
		Если Не Значение.Отбор Тогда
			
			Значение.Отбор = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПостроительОтчета.Отбор.Количество() = 0 Тогда
		
		ПостроительОтчета.Отбор.Добавить("Объект");
		ПостроительОтчета.Отбор.Добавить("Метаданные");
		ПостроительОтчета.Отбор.Добавить("Реквизит");
		ПостроительОтчета.Отбор.Добавить("ЗначениеРеквизита");
		ПостроительОтчета.Отбор.Добавить("Компьютер");
		ПостроительОтчета.Отбор.Добавить("ПериодОбъекта");
		ПостроительОтчета.Отбор.Добавить("Пользователь");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НачалоПериода)
		И ЗначениеЗаполнено(КонецПериода) Тогда
		
		ОтборПериод = ПостроительОтчета.Отбор.Добавить("ПериодОбъекта");
		
		ОтборПериод.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
		
		ОтборПериод.ЗначениеС     = НачалоПериода;
		
		ОтборПериод.ЗначениеПо    = КонецДня(КонецПериода);
		
		ОтборПериод.Использование = Истина;
		
	КонецЕсли;
	
	Для Каждого Значение Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Не Значение.Использование Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ИмяЭлементаОтбора = Строка(Значение.ЛевоеЗначение);			
		
		ДобавитьОтбор(Значение.ПравоеЗначение,ПостроительОтчета.Отбор,ИмяЭлементаОтбора,Значение.ВидСравнения);
			
	КонецЦикла;
	
КонецПроцедуры

//
//
Процедура УстановитьАвтоОтбор()
	
	Если АтоматическийРежим Тогда	
		
		Для Каждого Значение Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			
			Если Значение.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект") 
			   //И Не ЗначениеЗаполнено(Значение.ПравоеЗначение) //Никифоров
			  И ЗначениеЗаполнено(АнализируемыйОбъект) Тогда
				
				ИспользоватьВнешнююБазу = Истина;					
				
				Значение.ПравоеЗначение = АнализируемыйОбъект;
				
				Значение.Использование = Истина;
				
				Прервать;
				
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

//
//
Процедура ОтключитьОтборКомпоновщикаОтчета()
	
	Для Каждого Значение Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Значение.Использование Тогда
			
			Значение.Использование = Ложь;
			
			Значение.Представление = "ОПВ";
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
	
//
//
Процедура ВключитьОтборКомпоновщикаОтчета()
	
	Для Каждого Значение Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Не Значение.Использование И Значение.Представление = "ОПВ" Тогда
			
			Значение.Использование = Истина;
			
			Значение.Представление = "";
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
		
//
//
функция ПолучитьСопостовлениеТипаВидаСравненияКопоновщикаИПостроителя(АнализируемыйВидСравнения,ТипЗначения)
	
	Если АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
		
		Возврат ВидСравнения.Больше;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
		
		Возврат ВидСравнения.БольшеИлиРавно;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
		
		Возврат ВидСравнения.ВИерархии;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
		
		Возврат ВидСравнения.ВСписке;
	
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
		
		Возврат ВидСравнения.ВСпискеПоИерархии;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
		
		Возврат ВидСравнения.Меньше;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
		
		Возврат ВидСравнения.МеньшеИлиРавно;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
		
		Возврат ВидСравнения.НеВИерархии;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
		
		Возврат ВидСравнения.НеВСписке;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		
		Возврат ВидСравнения.НеВСпискеПоИерархии;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
		
		Если ТипЗначения.КвалификаторыСтроки.Длина = 0 Тогда
			Возврат ВидСравнения.НеСодержит;
		Иначе
			Возврат ВидСравнения.НеРавно;
		КонецЕсли;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит Тогда
		
		Возврат ВидСравнения.НеСодержит;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		
		Если ТипЗначения.КвалификаторыСтроки.Длина = 0 Тогда
			Возврат ВидСравнения.Содержит;
		Иначе
			Возврат ВидСравнения.Равно;
		КонецЕсли;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.Содержит Тогда
		
		Возврат ВидСравнения.Содержит;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
		
		Возврат ВидСравнения.Равно;
		
	ИначеЕсли АнализируемыйВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
		
		Возврат ВидСравнения.НеРавно;
		
	Иначе
		
		Возврат ВидСравнения.Равно;
		
	КонецЕсли;
				
КонецФункции

//
//
Функция ПолучитьПользователяПоКоду(Наименование = "")
	
	//Пользователь = Справочники.Пользователи.НайтиПоКоду(Наименование);
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Возврат Наименование;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Пользователь = Справочники.Пользователи.НайтиПоНаименованию(Наименование);
	
	Если Не Пользователь.Пустая() Тогда
		Возврат Пользователь;			
	Иначе
		Возврат Наименование;
	КонецЕсли;
	
КонецФункции

//
//
Функция ПолучитьПредставлениеСобытияТЧ(Событие = "")
	
	Если СокрЛП(Событие) = "Добавлены строки в табличную часть" Тогда
		Возврат "+";
	ИначеЕсли СокрЛП(Событие) = "Удалены строки из табличной части" Тогда
		Возврат "-";
	КонецЕсли;
	
КонецФункции

//
//
Функция ПолучитьЧислоСортировочногоПоляПоСобытиюТЧ(Событие = "")
	
	Если СокрЛП(Событие) = "Добавлены строки в табличную часть" Тогда
		Возврат 2;
	ИначеЕсли СокрЛП(Событие) = "Удалены строки из табличной части" Тогда
		Возврат 1;
	КонецЕсли;
	
КонецФункции

//
//
Функция СоздатьТаблицуДанныхРеквизитов(ДляВнешнейБазы = Ложь)
	
	ТаблицаДанныхРеквизитов = Новый ТаблицаЗначений;
	
	ТаблицаДанныхРеквизитов.Колонки.Добавить("Объект"            ,?(ДляВнешнейБазы,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)),Новый ОписаниеТипов));
	ТаблицаДанныхРеквизитов.Колонки.Добавить("Метаданные"        ,?(ДляВнешнейБазы,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)),Новый ОписаниеТипов));	
	ТаблицаДанныхРеквизитов.Колонки.Добавить("Реквизит"          ,?(ДляВнешнейБазы,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)),Новый ОписаниеТипов));
	ТаблицаДанныхРеквизитов.Колонки.Добавить("ЗначениеРеквизита" ,?(ДляВнешнейБазы,Новый ОписаниеТипов("Строка"),Новый ОписаниеТипов));
	ТаблицаДанныхРеквизитов.Колонки.Добавить("Компьютер"         ,?(ДляВнешнейБазы,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)),Новый ОписаниеТипов));
	ТаблицаДанныхРеквизитов.Колонки.Добавить("ПериодОбъекта"            ,?(ДляВнешнейБазы,Новый ОписаниеТипов("Дата"),Новый ОписаниеТипов));
	ТаблицаДанныхРеквизитов.Колонки.Добавить("Пользователь"      ,?(ДляВнешнейБазы,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)),Новый ОписаниеТипов));
	ТаблицаДанныхРеквизитов.Колонки.Добавить("Событие"           ,?(ДляВнешнейБазы,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)),Новый ОписаниеТипов));	
	
	Возврат ТаблицаДанныхРеквизитов;
	
КонецФункции

//
//
Функция СоздатьТаблицуДанныхТЧ()
	
	ТаблицаДляТЧ = Новый ТаблицаЗначений;
	
	ТаблицаДляТЧ.Колонки.Добавить("Объект");
	ТаблицаДляТЧ.Колонки.Добавить("ИмяТЧ");		
	ТаблицаДляТЧ.Колонки.Добавить("ТаблицаЗначений");
	
	Возврат ТаблицаДляТЧ;
	
КонецФункции

//
//
Процедура ПолучитьДанныеИзВнешнейБазы(ТаблицаЗначений)
	
	ТаблицаДанныхРеквизитов = СоздатьТаблицуДанныхРеквизитов(Истина);
	
	Если Константы.ЕдинаяБазаВнедрена.Получить() = Ложь Тогда  
		Сервер		= СокрЛП(Справочники.Организации.Основная_Организация.СерверБазаАрхив);
		Логин		= СокрЛП(Справочники.Организации.Основная_Организация.ЛогинБазаАрхив);
		Пароль		= СокрЛП(Справочники.Организации.Основная_Организация.ПарольБазаАрхив);
		ИмяБазы		= СокрЛП(Справочники.Организации.Основная_Организация.ИмяБазыАрхив);
		ИмяТаблицы	= СокрЛП(Справочники.Организации.Основная_Организация.ИмяТаблицыЖурналаИзменений);
	Иначе	
		Сервер				= СокрЛП(Справочники.Константы.СерверБазаАрхив.Значение);
		Логин				= СокрЛП(Справочники.Константы.ЛогинБазаАрхив.Значение);
		Пароль				= СокрЛП(Справочники.Константы.ПарольБазаАрхив.Значение);
		ИмяБазы				= СокрЛП(Справочники.Константы.ИмяБазыАрхив.Значение);
		ИмяТаблицы			= СокрЛП(Справочники.Константы.ИмяТаблицыБазаАрхив.Значение);    		
	КонецЕсли;
	
	СтрокаПодключения = "Provider=SQLOLEDB.1;Password=" + Пароль + ";Persist Security Info=True;User ID=" + Логин + ";Initial Catalog=" + ИмяБазы + ";Data Source=" + Сервер;	
	
	Попытка
		
		Приложение	= Новый COMОбъект("ADODB.Connection");
		
		Коннект		= Приложение.Open(СтрокаПодключения);
		
	Исключение
		
		Возврат;
		
	КонецПопытки;
	
	Для Каждого Значение Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Не Значение.Использование Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если Значение.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект") Тогда
			
			Объект = ЗначениеВСтрокуВнутр(Значение.ПравоеЗначение);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Команда	= Новый COMОбъект("ADODB.Command");
	
	Result	= Новый COMОбъект("ADODB.Recordset");
	
	Result.ActiveConnection = Приложение;
		
	ТекстЗапроса = "
	|SELECT
	|	Период как ПериодОбъекта,
	|	Метаданные,
	|	Событие,
	|	Реквизит,
	|	Данные AS Объект,
	|	ЗначениеРеквизита,
	|	Пользователь,
	|	Компьютер
	|FROM
	|	" + ИмяБазы + "." + Логин + "." + ИмяТаблицы + "	
	|   " + ?(ЗначениеЗаполнено(Объект),"WHERE Данные = '" + Объект + "'",""); 
	
	Команда.CommandText = ТекстЗапроса;
		
	Команда.ActiveConnection = Приложение;
		
	Попытка
		
		Result = Команда.Execute();
		
	Исключение
		
		Возврат;
		
	КонецПопытки; 	
	
	Пока Не Result.EOF Цикл
		
		НоваяЗапись = ТаблицаДанныхРеквизитов.Добавить();
		
		Для Каждого Колонка Из ТаблицаДанныхРеквизитов.Колонки Цикл
			
			Если Колонка.Имя = "ПериодОбъекта" Тогда
				
				Попытка
					
					Значение = Дата(СокрЛП(Result.Fields(Колонка.Имя).Value)); 
					
				Исключение
					
					Значение = '00010101';
					
				КонецПопытки;
				
			Иначе
				
				Значение = Result.Fields(Колонка.Имя).Value;				
				
			КонецЕсли;
				
			НоваяЗапись[Колонка.Имя] = Значение;
		
		КонецЦикла;
		
		Result.MoveNext();
		
	КонецЦикла;	
	
	ПостроительОтчета = Новый ПостроительОтчета;
	
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанныхРеквизитов);
	
	ПостроительОтчета.ЗаполнитьНастройки();
	
	СинхронизироватьОтборПотсроителяОтчетаИКомпоновщика(ПостроительОтчета);
	
	ПостроительОтчета.Выполнить();
	
	ВременнаяТаблица = ПостроительОтчета.Результат.Выгрузить();
	
	Для Каждого Значение Из ВременнаяТаблица Цикл
		
		НоваяЗапись = ТаблицаЗначений.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Значение);
		
	КонецЦикла;
		
КонецПроцедуры

//
//
Функция ПолучитьДанные()
	
	ТаблицаДанныхРеквизитов = СоздатьТаблицуДанныхРеквизитов();
	
	ТаблицаДляТЧ = СоздатьТаблицуДанныхТЧ();
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		
		Для Каждого Значение Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			
			Если Значение.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект")
				И (Не ЗначениеЗаполнено(Значение.ПравоеЗначение)ИЛИ Не Значение.Использование) Тогда
				
				Возврат ТаблицаДанныхРеквизитов;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
	СтруктураДанных = Новый Структура;
	
	Если ВходящиеДанные.Количество() > 0 Тогда
		//Курочкин будем сравнивать в отчете собственные данные
		ТаблицаЗначений = ВходящиеДанные.Выгрузить();
	Иначе
		ПостроительОтчета = Новый ПостроительОтчета;
		
		ПостроительОтчета.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Журнал.Период как ПериодОбъекта,
		|	Журнал.Метаданные,
		|	Журнал.Событие,
		|	Журнал.Реквизит,
		|	Журнал.Данные КАК Объект,
		|	Журнал.ЗначениеРеквизита,
		|	Журнал.Пользователь,
		|	Журнал.Компьютер
		|ИЗ
		|	РегистрСведений.Лен_ЖурналИзменений КАК Журнал";
		
		ПостроительОтчета.ЗаполнитьНастройки();
		
		СинхронизироватьОтборПотсроителяОтчетаИКомпоновщика(ПостроительОтчета);
		
		ПостроительОтчета.Выполнить();
		
		ТаблицаЗначений = ПостроительОтчета.Результат.Выгрузить();
	КонецЕсли;
	
	
	//Если ИспользоватьВнешнююБазу Тогда
	//	
	//	ПолучитьДанныеИзВнешнейБазы(ТаблицаЗначений);
	//	
	//КонецЕсли;
		
	Для Каждого Значение Из ТаблицаЗначений Цикл
		
		Попытка
			
			Объект = ЗначениеИзСтрокиВнутр(Значение.Объект); 
			
			Если Не ЗначениеЗаполнено(Объект) Тогда
				Продолжить;
			КонецЕсли;
                                   
		Исключение
			Продолжить;
		КонецПопытки;
		
		Попытка		
			
			ЗначениеРеквизита = ЗначениеИзСтрокиВнутр(Значение.ЗначениеРеквизита);
			
		Исключение
			Продолжить;
		КонецПопытки;
		
		СтруктураПараметров = Новый Структура;
		
		СтруктураПараметров.Вставить("Объект",Объект);
		
		Если СокрЛП(Значение.Событие) = "Изменение реквизита шапки" 
		 ИЛИ СокрЛП(Значение.Событие) = "Сдвинута граница последовательности по договору" Тогда
			
			СтруктураПараметров.Вставить("Событие","Общие реквизиты");
			
			Попытка 
				СтруктураПараметров.Вставить("Реквизит",Объект.Метаданные().Реквизиты[Значение.Реквизит].Синоним);
			Исключение
				СтруктураПараметров.Вставить("Реквизит",Значение.Реквизит);
			КонецПопытки;			
			
		ИначеЕсли СокрЛП(Значение.Событие) = "Добавлены строки в табличную часть" 
			ИЛИ СокрЛП(Значение.Событие) = "Удалены строки из табличной части" Тогда
			
			Если ТаблицаДляТЧ.НайтиСтроки(Новый Структура("ИмяТЧ, Объект",Значение.Реквизит,Объект)).Количество() = 0 Тогда
				
				НоваяЗапись = ТаблицаДляТЧ.Добавить();
				
				НоваяЗапись.Объект = Объект;
				НоваяЗапись.ИмяТЧ  = Значение.Реквизит;
				
				ВременнаяТаблица = Новый ТаблицаЗначений;
				
				ВременнаяТаблица.Колонки.Добавить("Метаданные");				
				ВременнаяТаблица.Колонки.Добавить("ПериодОбъекта");
				ВременнаяТаблица.Колонки.Добавить("Пользователь");
				ВременнаяТаблица.Колонки.Добавить("Компьютер");
				ВременнаяТаблица.Колонки.Добавить("Событие");	
				ВременнаяТаблица.Колонки.Добавить("СортировкаСобытие");				
				
				Для Каждого Колонка Из ЗначениеРеквизита.Колонки Цикл
				
					ВременнаяТаблица.Колонки.Добавить(Колонка.Имя);
				
				КонецЦикла;
				
				Для Каждого Элемент Из ЗначениеРеквизита Цикл
					
					Запись = ВременнаяТаблица.Добавить();
					
					ЗаполнитьЗначенияСвойств(Запись,Элемент);
					
					Запись.Метаданные   = Значение.Метаданные;					
					
					Запись.ПериодОбъекта = Значение.ПериодОбъекта;
					
					Запись.Пользователь = ПолучитьПользователяПоКоду(Значение.Пользователь);			
						
					Запись.Компьютер    = Значение.Компьютер;
					
					Запись.Событие      = ПолучитьПредставлениеСобытияТЧ(Значение.Событие);
					
					Запись.СортировкаСобытие = ПолучитьЧислоСортировочногоПоляПоСобытиюТЧ(Значение.Событие);					
									
				КонецЦикла;
				
				НоваяЗапись.ТаблицаЗначений = ВременнаяТаблица;
				
			Иначе
				
				ВременнаяТаблица= ТаблицаДляТЧ.НайтиСтроки(Новый Структура("ИмяТЧ, Объект",Значение.Реквизит,Объект))[0].ТаблицаЗначений;
				
				Для Каждого Элемент Из ЗначениеРеквизита Цикл
					
					Запись = ВременнаяТаблица.Добавить();
					
					ЗаполнитьЗначенияСвойств(Запись,Элемент);
					
					Запись.Метаданные   = Значение.Метаданные;
					
					Запись.ПериодОбъекта = Значение.ПериодОбъекта;
					
					Запись.Пользователь = ПолучитьПользователяПоКоду(Значение.Пользователь);			
					
					Запись.Компьютер    = Значение.Компьютер;	
					
					Запись.Событие      = ПолучитьПредставлениеСобытияТЧ(Значение.Событие);			
					
					Запись.СортировкаСобытие = ПолучитьЧислоСортировочногоПоляПоСобытиюТЧ(Значение.Событие);					
					
				КонецЦикла; 				
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		СтруктураПараметров.Вставить("ЗначениеРеквизита",ЗначениеРеквизита);	
		
		СтруктураПараметров.Вставить("Компьютер",Значение.Компьютер);		
		
		СтруктураПараметров.Вставить("ПериодОбъекта",Значение.ПериодОбъекта);		
		
		СтруктураПараметров.Вставить("Пользователь",ПолучитьПользователяПоКоду(Значение.Пользователь));		
		
		СтруктураПараметров.Вставить("Метаданные",Значение.Метаданные);			
		
		Запись = ТаблицаДанныхРеквизитов.Добавить();	
		
		ЗаполнитьЗначенияСвойств(Запись,СтруктураПараметров);
				
	КонецЦикла;
	
	Если ТаблицаДляТЧ.Количество() > 0 Тогда
		
		СтруктураДанных.Вставить("ТаблицаДляТЧ",ТаблицаДляТЧ);	
		
	КонецЕсли;
	
	СтруктураДанных.Вставить("ТаблицаДанныхРеквизитов",ТаблицаДанныхРеквизитов);
	
	Возврат СтруктураДанных;
	
КонецФункции

//
//
Процедура ВывестиДанныеПоТЧ(ТабличныйДокумент,СтруктураДанных)
	
	Если Не СтруктураДанных.Свойство("ТаблицаДляТЧ") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Макет = ПолучитьМакет("ТабличныеЧасти");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ТабличныйДокумент.НачатьГруппуСтрок();
	
	Для Каждого ЭлементТаблица Из СтруктураДанных.ТаблицаДляТЧ Цикл
		
		ОбластьШапка = Макет.ПолучитьОбласть("НаименованиеТаблицы");		
		
		//Если ТипЗнч(ЭлементТаблица.Объект) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		//	
		//	Если ЭлементТаблица.ИмяТЧ = "Товары"
		//		ИЛИ ЭлементТаблица.ИмяТЧ = "Работы" 
		//		ИЛИ ЭлементТаблица.ИмяТЧ = "Исполнители" Тогда
		//		
		//		ОбластьШапка.Параметры.Наименование = ЭлементТаблица.ИмяТЧ;
		//		
		//	Иначе
		//		
		//		ОбластьШапка.Параметры.Наименование = ЭлементТаблица.Объект.Метаданные().ТабличныеЧасти[ЭлементТаблица.ИмяТЧ].Синоним
		//		
		//	КонецЕсли;
		//	
		//Иначе
			
			ОбластьШапка.Параметры.Наименование = ЭлементТаблица.Объект.Метаданные().ТабличныеЧасти[ЭлементТаблица.ИмяТЧ].Синоним;			
			
		//КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ТабличныйДокумент.НачатьГруппуСтрок();
		
		Проход = 0;
		
		Для Каждого ЭлементКолонка Из ЭлементТаблица.ТаблицаЗначений.Колонки Цикл	
			
			Если 
				//ЭлементКолонка.Имя = "НомерСтроки"  //Никифоров
				//ИЛИ 
				ЭлементКолонка.Имя = "СортировкаСобытие" 
				ИЛИ
				ЭлементКолонка.Имя = "Метаданные" Тогда
				Продолжить;
			КонецЕсли;
			
			Проход = Проход + 1;
			
			Если ЭлементКолонка.Имя = "Событие" Тогда
				
				Область = Макет.ПолучитьОбласть("ШапкаРеквизит|Событие");
				
			Иначе
				
				Область = Макет.ПолучитьОбласть("ШапкаРеквизит|Основание");
				
				Попытка
					
					//Если ТипЗнч(ЭлементТаблица.Объект) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
					//	
					//	Если ЭлементТаблица.ИмяТЧ = "Товары" Тогда
					//		
					//		Область.Параметры.Реквизит = Метаданные.Документы.Товары.ТабличныеЧасти[ЭлементТаблица.ИмяТЧ].Реквизиты[ЭлементКолонка.Имя].Синоним;
					//		
					//	ИначеЕсли ЭлементТаблица.ИмяТЧ = "Работы" 
					//		ИЛИ ЭлементТаблица.ИмяТЧ = "Исполнители" Тогда
					//		
					//		Область.Параметры.Реквизит = Метаданные.Документы.Работы.ТабличныеЧасти[ЭлементТаблица.ИмяТЧ].Реквизиты[ЭлементКолонка.Имя].Синоним;
					//		
					//	Иначе
					//		
					//		Область.Параметры.Реквизит = ЭлементТаблица.Объект.Метаданные().ТабличныеЧасти[ЭлементТаблица.ИмяТЧ].Реквизиты[ЭлементКолонка.Имя].Синоним;
					//		
					//	КонецЕсли;
					//	
					//Иначе
						
						Область.Параметры.Реквизит = ЭлементТаблица.Объект.Метаданные().ТабличныеЧасти[ЭлементТаблица.ИмяТЧ].Реквизиты[ЭлементКолонка.Имя].Синоним;			
						
					//КонецЕсли;
					
				Исключение
					
					Область.Параметры.Реквизит = ЭлементКолонка.Имя;
					
				КонецПопытки;
				
			КонецЕсли;
			
			Если Проход = 1 Тогда
				
				ТабличныйДокумент.Вывести(Область);
				
			Иначе
				
				ТабличныйДокумент.Присоединить(Область);
				
			КонецЕсли;
			
		КонецЦикла;
		
		//Никифоров
		//ЭлементТаблица.ТаблицаЗначений.Сортировать("Период,СортировкаСобытие");
		ЭлементТаблица.ТаблицаЗначений.Сортировать("ПериодОбъекта, НомерСтроки, СортировкаСобытие");
		
		Для Каждого ЭлементЗапись Из ЭлементТаблица.ТаблицаЗначений Цикл
						
			Проход = 0;
			
			Для Каждого ЭлементКолонка Из ЭлементТаблица.ТаблицаЗначений.Колонки Цикл
				
				Если
				 //   ЭлементКолонка.Имя = "НомерСтроки"    //Никифоров
				 //ИЛИ 			 
				 ЭлементКолонка.Имя = "СортировкаСобытие" 
				 ИЛИ 
				 ЭлементКолонка.Имя = "Метаданные" Тогда
					Продолжить;
				КонецЕсли;
									
				Проход = Проход + 1;		
				
				Если ЭлементКолонка.Имя = "Событие" Тогда
					
					Область = Макет.ПолучитьОбласть("ДетальныеЗаписи|Событие");
					
					Если ЭлементЗапись[ЭлементКолонка.Имя] = "+" Тогда
						
						Область.ТекущаяОбласть.ЦветФона = WebЦвета.СветлоЗеленый;
						
					Иначе
						
						Область.ТекущаяОбласть.ЦветФона = WebЦвета.СветлоРозовый;						
						
					КонецЕсли;
					
				Иначе
					
					Область = Макет.ПолучитьОбласть("ДетальныеЗаписи|Основание");					
					
				КонецЕсли;
								
				Область.Параметры.Значение = ЭлементЗапись[ЭлементКолонка.Имя];					
				
				Если ТипЗнч(ЭлементЗапись[ЭлементКолонка.Имя]) = Тип("Число") Тогда
					
					Область.ТекущаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
					
				ИначеЕсли ЭлементКолонка.Имя = "Событие" Тогда
					
					Область.ТекущаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;						
					
				ИначеЕсли ТипЗнч(ЭлементЗапись[ЭлементКолонка.Имя]) = Тип("Строка") Тогда
					
					Область.ТекущаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;					
					
				КонецЕсли;
				
				//Никифоров
				Если  ЭлементКолонка.Имя <> "ПериодОбъекта"
					И ЭлементКолонка.Имя <> "Пользователь"
					И ЭлементКолонка.Имя <> "Компьютер"
					И ЭлементКолонка.Имя <> "Событие"
					И ЭлементКолонка.Имя <> "НомерСтроки" Тогда
					ИндексИсх = ЭлементТаблица.ТаблицаЗначений.Индекс(ЭлементЗапись); 
					Если ИндексИсх > 0 Тогда
						//Получаем предыдущую строку
						ПредСтрока = ЭлементТаблица.ТаблицаЗначений.Получить(ИндексИсх-1);	
						Если ЭлементЗапись.НомерСтроки = ПредСтрока.НомерСтроки И ЭлементЗапись.Событие <> ПредСтрока.Событие Тогда
							Если ЭлементЗапись[ЭлементКолонка.Имя] <> ПредСтрока[ЭлементКолонка.Имя] Тогда
								Область.ТекущаяОбласть.ЦветФона = WebЦвета.Оранжевый;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
					
				Если Проход = 1 Тогда
					
					ТабличныйДокумент.Вывести(Область);
					
				Иначе
					
					ТабличныйДокумент.Присоединить(Область);
					
				КонецЕсли;				
				
			КонецЦикла;
			
		КонецЦикла;
		
		ТабличныйДокумент.ЗакончитьГруппуСтрок();
		
	КонецЦикла;	
	
	ТабличныйДокумент.ЗакончитьГруппуСтрок();
	
КонецПроцедуры

//
//
Процедура Сформировать(ТабличныйДокумент,ДанныеРасшифровки) Экспорт
	
	//Сообщить("зашли в процедуру Сформировать");
	УстановитьАвтоОтбор();
	
	ТабличныйДокумент.Очистить();		
	СтруктураДанных = ПолучитьДанные();		
	ВывестиКорпоративныйЗаголовокОтчета(ТабличныйДокумент);	
	
	Структура = Новый Структура;
	Структура.Вставить("ВнешнийНаборДанных",СтруктураДанных.ТаблицаДанныхРеквизитов);	
	
	ОтключитьОтборКомпоновщикаОтчета();	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,ДанныеРасшифровки);	
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,Структура,ДанныеРасшифровки);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 	
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ТабличныйДокумент); 	
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных,Истина);	
	
	ВывестиДанныеПоТЧ(ТабличныйДокумент,СтруктураДанных);	
	ВключитьОтборКомпоновщикаОтчета();	
	
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(2);		
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;	
	ТабличныйДокумент.АвтоМасштаб = Истина;	
	
КонецПроцедуры

 ТаблицаВариантовСохраненныхНастроекОтчета = Новый ТаблицаЗначений;
 ТаблицаВариантовСохраненныхНастроекОтчета.Колонки.Добавить("Ссылка");
 ТаблицаВариантовСохраненныхНастроекОтчета.Колонки.Добавить("Наименование");
 ТаблицаВариантовСохраненныхНастроекОтчета.Колонки.Добавить("Описание");

	

