#Область ПеременныеФормы

&НаКлиенте
Перем мСуммаБонусов;

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	ОтображениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	ОтображатьПериодРегистрации   = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		ПриЧтенииСозданииНаСервере();
		ПересчитатьБонусыПоДокументу();		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	Элементы.Статья.АвтоОтметкаНезаполненного = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();
	
	ДоступноИзменениеОрганизацииВДокументахНаОснованииЗаявки = Константы.ДоступноИзменениеОрганизацииВДокументахНаОснованииЗаявки.Получить();
	ДоступноИзменениеКассыВДокументахНаОснованииЗаявки = Константы.ДоступноИзменениеКассыВДокументахНаОснованииЗаявки.Получить();
	УстановитьДоступностьЭлементов();
	
	Элементы.ГруппаФискальныйРегистратор.Видимость = Константы.ИспользоватьПодключаемоеОборудование.Получить();
	Элементы.ФормаПечатьЧека.Видимость = Элементы.ГруппаФискальныйРегистратор.Видимость;
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
	ОбновитьВидимостьИОстаткиДС();
	
	ОграничениеТипаДоговор = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	Элементы.Договор.ОграничениеТипа = ОграничениеТипаДоговор;
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДанные();
	ОбновитьВидимостьГруппыБонусов();
	мСуммаБонусов = Объект.СуммаБонусовКСписаниюПоДисконтнойКарте;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ВалютаДокумента = Объект.Валюта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Сотрудник.Пустая() И Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику Тогда
		Сообщить("Не заполнен сотрудник (подотчетное лицо)");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если (Объект.СуммаОсновногоТелаЗайма + Объект.СуммаПроцентовПоЗайму) <> Объект.Сумма И Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратКредита Тогда
		Сообщить("Сумма документа не равна сумме суммы основного долга и суммы процентов");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ФинансыСервер.ПроверитьСуммуРаспределенияПоТипамДокументов(Объект, , Объект.Сумма, Отказ, ПараметрыЗаписи.РежимЗаписи);	
	
	// #15647
	Если ЗаписьПослеПробития Тогда
		ЗаписьПослеПробития = Ложь;
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзмененияПроведенногоДокумента", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	мСуммаБонусов = Объект.СуммаБонусовКСписаниюПоДисконтнойКарте;
	// №11352
	Оповестить("Запись_ДокументОплаты",, Объект.Ссылка);
	
	ОбщийМодульКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ОбновитьДанные();
	ОбновитьВидимостьИОстаткиДС();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И СтрНайти(ИсточникВыбора.ИмяФормы, "ФормаКалендаря") > 0 Тогда
		
		Объект.ПериодРегистрации 		= НачалоМесяца(ВыбранноеЗначение);
		ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
		Модифицированность = Истина;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораПоРасчетамСКонтрагентами" Тогда
		
		ПолучитьРаспределениеПлатежаИзХранилища(ВыбранноеЗначение.АдресПлатежейВХранилище);
		
	КонецЕсли;
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// #14544 на случай если включат данную настройку, чтобы в документе был корректный период = дате документа
	Если НЕ ОтображатьПериодРегистрации И ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПересчитатьБонусыПоДокументу();
	ОбновитьВидимостьИОстаткиДС();
	ЗаполнитьСтавкуНДСПоОрганизации();
	ЗаполнитьСтатьюДоходовРасходовСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	Если НЕ КассаПриИзмененииНаСервере() Тогда
		ПоказатьПредупреждение(,"Выбрана касса, не принадлежащая организации");
		Возврат;
	КонецЕсли;
	ПересчитатьБонусыПоДокументу();
	ОбновитьВидимостьИОстаткиДС();
КонецПроцедуры

Функция КассаПриИзмененииНаСервере()
	Если НЕ Объект.Касса.Владелец = Объект.Организация Тогда
		Объект.Касса = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Валюта) И НЕ ВалютаДокумента = Объект.Валюта Тогда
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам") Тогда
			ТекстВопроса = "Пересчитать суммы документа по курсу новой валюты?";
			ОписаниеОповещения = Новый ОписаниеОповещения("ВалютаПриИзмененииФрагмент", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ВалютаПриИзмененииЗавершение();
		КонецЕсли;
	Иначе
		ВалютаПриИзмененииЗавершение();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВалютаПриИзмененииФрагмент(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВалютаПриИзмененииСервер(Объект.Валюта,	Истина);		
	Иначе
		Объект.Валюта = ВалютаДокумента;
	КонецЕсли;
	
	ВалютаПриИзмененииЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзмененииЗавершение()
	
	ВалютаДокумента = Объект.Валюта;
	
	ОбновитьДанные();
	ОбновитьВидимостьИОстаткиДС();
	
КонецПроцедуры 

&НаСервере
Процедура ВалютаПриИзмененииСервер(НоваяВалюта, ПересчитатьСуммы = Истина)
	
	Если ПересчитатьСуммы Тогда 
		СтараяВалюта = ВалютаДокумента;
		ДатаКурса    = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам Тогда
			Для каждого СтрокаТЧ из Объект.ЗарплатаСотрудникам Цикл
				СтрокаТЧ.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(СтараяВалюта, НоваяВалюта, ДатаКурса, СтрокаТЧ.Сумма);	
			КонецЦикла;
			Объект.Сумма = Объект.ЗарплатаСотрудникам.Итог("Сумма");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") 
		И Элементы.ГруппаРаспределениеПлатежа.Видимость Тогда
		
		НовоеОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОЗаполненииРаспределения",ЭтаФорма);
		ПоказатьВопрос(НовоеОписаниеОповещения, "Очистить и перезаполнить распределение платежа согласно заявке?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОЗаполненииРаспределения(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьРаспределениеНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьРаспределениеНаСервере()
	
	Объект.РаспределениеПлатежа.Очистить();
	Для каждого СтрокаРаспределения из Объект.Основание.РаспределениеПлатежа Цикл
		НоваяСтрока = Объект.РаспределениеПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	ОбновитьДанные();
	ПересчитатьБонусыПоДокументу();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Контрагент, "ОсновнойДоговор, Категория, СтатьяРасходов");	
		Объект.Договор = РеквизитыКонтрагента.ОсновнойДоговор;
		Объект.КатегорияКонтрагента = РеквизитыКонтрагента.Категория;
		Если ЗначениеЗаполнено(РеквизитыКонтрагента.СтатьяРасходов) Тогда
			Объект.СтатьяРасходов = РеквизитыКонтрагента.СтатьяРасходов;
		КонецЕсли;	
	Иначе
		Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		Объект.КатегорияКонтрагента = Справочники.КатегорииКонтрагентов.ПустаяСсылка();
		Объект.СтатьяРасходов = Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();
	КонецЕсли;
	
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	// #14544 на случай если включат данную настройку, чтобы в документе был корректный период = дате документа
	Если НЕ ОтображатьПериодРегистрации И ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	
	ЗаполнитьСтатьюДоходовРасходовСервер();
	
	ЗаполнитьСтавкуНДСПоОрганизации();
	ОбновитьВидимостьГруппыБонусов();
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСотрудникамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.Сумма = Объект.ЗарплатаСотрудникам.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Если Объект.РаспределениеПлатежа.Количество() = 1 Тогда
		Если Объект.РаспределениеПлатежа[0].Документ = Объект.Основания[0].Основание Тогда
			Объект.РаспределениеПлатежа[0].Сумма = Объект.Сумма;
		КонецЕсли;
	КонецЕсли;
	
	Объект.СуммаОсновногоТелаЗайма = Объект.Сумма - Объект.СуммаПроцентовПоЗайму;  
	
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);
	ПересчитатьБонусыПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРегистрации = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), 
	ДобавитьМесяц(Объект.ПериодРегистрации, Направление),
	ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), Направление));							
	Объект.ПериодРегистрации 		= НачалоМесяца(Объект.ПериодРегистрации);
	ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	 = Ложь;	
	ДатаКалендаряПриОткрытии = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), Объект.ПериодРегистрации, ТекущаяДата());
	СтруктураПараметров 	 = Новый Структура("ДатаКалендаря, ЗакрыватьПриВыборе, МножественныйВыбор", ДатаКалендаряПриОткрытии, Истина, Ложь);
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

//++ №13755
&НаКлиенте
Процедура СтатьяРасходовПриИзменении(Элемент)
	
	Объект.СтатьяРасходовПоНачислению = Объект.СтатьяРасходов;
	
КонецПроцедуры
//-- №13755

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);	
КонецПроцедуры

#КонецОбласти

//&НаКлиенте
//Процедура ПечатьРасходноКассовыйОрдер(Команда)
//	
//	Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам") Тогда	
//		УправлениеПечатьюКлиент.ПотолкиПечать(ЭтотОбъект, "РКО");		
//	Иначе
//		УправлениеПечатьюКлиент.ПотолкиПечать(ЭтотОбъект, "РКОСотрудники");
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПечатьРасходноКассовыйОрдерСотрудникиОбший(Команда)	
//		
//	УправлениеПечатьюКлиент.ПотолкиПечать(ЭтотОбъект, "РКОСотрудникиОбщий");
//	
//КонецПроцедуры

&НаКлиенте
Процедура Распределение_ЗаказПоставщику(Команда)
	Если Не Объект.Контрагент.Пустая() Тогда 
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораДокумента",ЭтаФорма);
		
		ЗначениеОтбора = Новый Структура("Контрагент", Объект.Контрагент);
		ПараметрВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора", ПараметрВыбора, ЭтаФорма,,,,ОповещениеОЗакрытии);
	Иначе
		Состояние("Не указан контрагент");
	КонецЕсли;
	
	Модифицированность = Истина;	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораДокумента(ВыбранныйДокумент, ДополнительныеПараметры) Экспорт
	Если НЕ ВыбранныйДокумент = Неопределено Тогда
		Если НЕ ВыбранныйДокумент.Пустая() Тогда
			НоваяСтрока = Объект.РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ВыбранныйДокумент;
			НоваяСтрока.Сумма = ВыбранныйДокумент.СуммаДокумента;
			
			//ДобавитьОснаваниеЗаказа(НоваяСтрока.Документ);
			
			//ОбновитьДанные();
		КонецЕсли;
	КонецЕсли;	
	
	ОбновитьДанные();
КонецПроцедуры


#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	ТолькоПросмотрЭлементов = Ложь;
	
	ДокументОснование = Неопределено;
	Если Объект.Основания.Количество() > 0 Тогда
		ДокументОснование = Объект.Основания[0].Основание;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		ТолькоПросмотрЭлементов = Истина;
		
		Элементы.Организация.ТолькоПросмотр = НЕ ДоступноИзменениеОрганизацииВДокументахНаОснованииЗаявки;
		Элементы.Касса.ТолькоПросмотр = НЕ ДоступноИзменениеКассыВДокументахНаОснованииЗаявки;
	КонецЕсли;
	
	ЭлементыТолькоПросмотр = Новый Массив;
	ЭлементыТолькоПросмотр.Добавить(Элементы.Номер);
	//ЭлементыТолькоПросмотр.Добавить(Элементы.Организация);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Подразделение);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Сумма);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Валюта);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Статья);
	ЭлементыТолькоПросмотр.Добавить(Элементы.СтатьяРасходов);
	ЭлементыТолькоПросмотр.Добавить(Элементы.СтатьяРасходовПоНачислению);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ВидОперации);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Контрагент);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Договор);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Сотрудник);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаРаспределениеПлатежа);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаЗарплатаСотрудникам);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ОтображениеПериодаРегистрации);
	
	Для каждого Элемент Из ЭлементыТолькоПросмотр Цикл
		Элемент.ТолькоПросмотр = ТолькоПросмотрЭлементов;
	КонецЦикла;
	
	ЭлементыДоступность = Новый Массив;
	ЭлементыДоступность.Добавить(Элементы.РаспределениеПлатежаРаспределение_ЗаказПоставщику);
	Для каждого Элемент Из ЭлементыДоступность Цикл
		Элемент.Доступность = НЕ ТолькоПросмотрЭлементов;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущийДолгКлиента(Знач Организация, Знач Контрагент, Знач Договор, Знач ВалютаДокумента, Знач ВалютаУчета, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			Договор = &Договор
	|				И Контрагент = &Контрагент
	|				И Организация = &Организация) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// №7942 сумму долга показываем в валюте текущего документа, если валюта отличается от валюты учета
		Сумма = Выборка.СуммаОстаток;
		Если НЕ ВалютаДокумента = ВалютаУчета Тогда
			Сумма = Окр(РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, ВалютаДокумента, Дата, Сумма), 2);
		КонецЕсли;	
		Возврат Сумма;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанные()
	
	Элементы.ГруппаКонтрагент.Видимость = Ложь;
	Элементы.ГруппаСотрудник.Видимость = Ложь;
	Элементы.ГруппаЗарплатаСотрудникам.Видимость = Ложь;
	Элементы.ГруппаЗарплатаСотрудникамПериод.Видимость = Ложь;
	Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
	Элементы.ОснованияЗаполнитьОснованияПоРаспределению.Видимость = Ложь;
	Элементы.ГруппаРеквизитовЗайма.Видимость = Ложь;
	Элементы.Сумма.ТолькоПросмотр = Ложь;
	Элементы.Сотрудник.АвтоОтметкаНезаполненного = Ложь;
	//КоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаПечать").ПодчиненныеЭлементы.Найти("ФормаПечатьРасходноКассовыйОрдерСотрудникиОбший").Видимость = Ложь;	
	Элементы.ФормаПечатьЧека.Доступность = Ложь;
	Элементы.РаспределениеПлатежаГруппаВозвратПокупателю.Видимость = Ложь;
	Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Ложь;
	
	//#9708
	Элементы.СтатьяРасходовПоНачислению.Видимость = ПолучитьФункциональнуюОпцию("НекассовыйМетодВеденияУчетаДоходовРасходов") 
	И Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ПрочееСписание
	//++ №13755
	И ЗначениеЗаполнено(Объект.Ссылка)
	И НЕ (Объект.СтатьяРасходов = Объект.СтатьяРасходовПоНачислению);
	//-- №13755
	
	Элементы.СтатьяРасходов.Видимость = Истина;	// #12545							
	//управляем видимостью элементов в зависимости от того, какой вид операции
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, ТекущаяДатаСеанса());
		// №7942 валюту показываем выбранную в текущем документе
		Элементы.ДекорацияНадписьВалютаДолга.Заголовок = Объект.Валюта; //Константы.ВалютаУчета.Получить();
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
		Элементы.ОснованияЗаполнитьОснованияПоРаспределению.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Истина;
		
		// №4119
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаЗайма Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, ТекущаяДатаСеанса());
		Элементы.ДекорацияНадписьВалютаДолга.Заголовок = Объект.Валюта;
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
		Элементы.СтатьяРасходов.Видимость = Ложь;
		Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Истина;	
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратКредита Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ГруппаРеквизитовЗайма.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, ТекущаяДатаСеанса());
		Элементы.ДекорацияНадписьВалютаДолга.Заголовок = Объект.Валюта;
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
		Элементы.СтатьяРасходов.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Истина;	
		
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, ТекущаяДатаСеанса());
		// №7942 валюту показываем выбранную в текущем документе
		Элементы.ДекорацияНадписьВалютаДолга.Заголовок = Объект.Валюта; //Константы.ВалютаУчета.Получить();
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
		Элементы.ОснованияЗаполнитьОснованияПоРаспределению.Видимость = Истина;
		Элементы.ФормаПечатьЧека.Доступность = Истина;
		Элементы.РаспределениеПлатежаГруппаВозвратПокупателю.Видимость = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику Тогда
		Элементы.ГруппаСотрудник.Видимость = Истина;
		Элементы.Сотрудник.АвтоОтметкаНезаполненного = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам Тогда
		//КоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаПечать").ПодчиненныеЭлементы.Найти("ФормаПечатьРасходноКассовыйОрдерСотрудникиОбший").Видимость = Истина;
		Элементы.ГруппаЗарплатаСотрудникам.Видимость = Истина;
		Элементы.ГруппаЗарплатаСотрудникамПериод.Видимость = ОтображатьПериодРегистрации;
		Элементы.Сумма.ТолькоПросмотр = Истина;
		Объект.Сумма = Объект.ЗарплатаСотрудникам.Итог("Сумма");
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.Инкассация Тогда
		Элементы.СтатьяРасходов.Видимость = Ложь; // #12545
		
	КонецЕсли;
	
	СписокДокументовРаспределения = Объект.РаспределениеПлатежа.Выгрузить(,"Документ");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА 
	|		РасчетыСКонтрагентами.СуммаОстаток < 0 
	|			ТОГДА -РасчетыСКонтрагентами.СуммаОстаток
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ОсталосьРаспределить,
	|	РасчетыСКонтрагентами.Заказ КАК Заказ,
	|	РасчетыСКонтрагентами.Заказ.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСКонтрагентами.Остатки(, Заказ В (&Заказ)) КАК РасчетыСКонтрагентами";
	Запрос.УстановитьПараметр("Заказ", СписокДокументовРаспределения);
	ТаблицаПоДокументам = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаРаспределения Из Объект.РаспределениеПлатежа Цикл
		Если ТипЗнч(СтрокаРаспределения.Документ) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			СтрокаРаспределения.Поставщик = СтрокаРаспределения.Документ.Контрагент;
			СтрокаРаспределения.СрокПоставки = СтрокаРаспределения.Документ.СрокПоставки;
			Если ТипЗнч(СтрокаРаспределения.Документ.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
				СтрокаРаспределения.НомерДоговора = СтрокаРаспределения.Документ.Основание.НомерДоговора;
			КонецЕсли;	
			Отбор = Новый Структура;
			Отбор.Вставить("Заказ", СтрокаРаспределения.Документ);
			НайденныеСтроки = ТаблицаПоДокументам.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, НайденныеСтроки[0]);
			Иначе
				Попытка
					СтрокаРаспределения.СуммаДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьДоступностьЭлементов();
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщийМодульКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщийМодульКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщийМодульКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоЗаявке(Команда)
	
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда	
		НовоеОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОПерезаполненииоПоЗаявке",ЭтаФорма);
		ПоказатьВопрос(НовоеОписаниеОповещения, "Очистить и перезаполнить документ согласно заявке?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПерезаполненииоПоЗаявке(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если ПерезаполнитьПоЗаявкеНаСервере() Тогда	
		ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
		ОбновитьДанные();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПерезаполнитьПоЗаявкеНаСервере()
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДокументОбъект.ЗарплатаСотрудникам.Очистить();
		ДокументОбъект.РаспределениеПлатежа.Очистить();
		ДокументОбъект.Заполнить(объект.Основание);
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		ОбновитьВидимостьИОстаткиДС();
		Возврат Истина;
	Иначе
		Сообщить("Предварительно объект должен быть записан!");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ПечатьЧека(Команда)
	
	Если Объект.ЧекФискализирован Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на оборудовании!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	//++ №7951 необходимо проверить права на объекты распределения, как минимум должно быть чтение
	Если НЕ ПотолкиКассыОнлайн.ПроверитьДоступКДокументамРаспределения(Объект) Тогда
		Возврат;
	КонецЕсли;	
	//-- №7951
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросПроведениеПередПечатьюЧека", ЭтотОбъект);	
	Если ПотолкиКассыОнлайнКлиент.ПроверитьВозможностьПечатиЧека(ОбработчикОповещения, ЭтотОбъект) Тогда
		ПечатьЧекаКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекаКлиент()
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ДокументСсылка",           Объект.Ссылка);
	ПараметрыОперации.Вставить("Партнер",                  Объект.Контрагент);
	ПараметрыОперации.Вставить("Организация",              Объект.Организация);
	ПараметрыОперации.Вставить("ПодключенноеОборудование", Неопределено); //ФискальнаяОперацияПодключенноеОборудование);
	
	ОписаниеОповещенияПриЗавершении = Новый ОписаниеОповещения("ФискализацияЧека_Завершение", ЭтотОбъект);
	ОткрытьФорму(
	"Обработка.ПредпросмотрЧека.Форма",
	ПараметрыОперации,
	ЭтотОбъект,,,,
	ОписаниеОповещенияПриЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросПроведениеПередПечатьюЧека(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
			ПечатьЧекаКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализацияЧека_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения = Неопределено И НЕ РезультатВыполнения = КодВозвратаДиалога.Отмена Тогда
		Если РезультатВыполнения.Результат Тогда
			// Установить полученное значение номера чека реквизиту документа.
			Объект.НомерСменыККМ = РезультатВыполнения.НомерСмены;
			Объект.НомерЧекаККМ = РезультатВыполнения.НомерЧекаККМ;
			
			Объект.ЧекФискализирован = Истина;;
			//Объект.Дата = МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса();
			Если Не ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
				Объект.НомерЧекаККМ = 1;
			КонецЕсли;
			
			Если РезультатВыполнения.ВерсияФФД = "1.0" Тогда
				ТаблицаТоваров = ЗаполнитьТаблицуТоваровПоОснованиюНаСервере();
				Объект.Товары.Очистить();
				Для каждого СтрокаТЗ из ТаблицаТоваров Цикл
					НоваяСтрока = Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
				КонецЦикла;
			КонецЕсли;
			
			ПараметрыЗаписи = Новый Структура("РежимЗаписи, РежимПроведения",
			РежимЗаписиДокумента.Проведение,
			РежимПроведенияДокумента.Оперативный);
			ЗаписьПослеПробития = Истина; // #15647
			
			Если ЗаписатьДокументНаСервере(ПараметрыЗаписи) Тогда
				//
			Иначе
				ТекстСообщения = НСтр("ru = 'Ошибка записи документа'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция записи и проведения документа.
//
&НаСервере
Функция ЗаписатьДокументНаСервере(ПараметрыЗаписи)
	
	Попытка
		Результат = Записать(ПараметрыЗаписи);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось провести документ'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуТоваровПоОснованиюНаСервере()
	Возврат Документы.ПриходныйКассовыйОрдер.ЗаполнитьТаблицуТоваровПоОснованию(Объект.Ссылка);	
КонецФункции

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ОбновитьДанные();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИОстаткиДС()
	
	ТекущаяКасса = Объект.Касса;
	
	//Элементы.ОстатокДенежныхСредств.Видимость = НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(ТекущаяКасса);
	Элементы.ОстатокДенежныхСредств.Видимость = ЗначениеЗаполнено(ТекущаяКасса);
	ОстатокДенежныхСредств = 0;
	
	Если НЕ Элементы.ОстатокДенежныхСредств.Видимость Тогда
		//Только для новых объектов
		Элементы.Касса.АвтоМаксимальнаяШирина = Истина;
		
		//Если ТолькоПросмотр Тогда
		//	Возврат;
		//КонецЕсли;
	Иначе
		Элементы.Касса.АвтоМаксимальнаяШирина = Ложь;
		Элементы.Касса.МаксимальнаяШирина = 22;
	КонецЕсли;
	
	Элементы.ОстатокДенежныхСредств.Заголовок = ФинансыСервер.ЗаголовокНадписиОстатковДС(ТекущаяКасса, Объект.Организация, ОстатокДенежныхСредств, Объект.Валюта);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	
	Если НЕ Объект.ВидОперации.Пустая() Тогда
		Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, Объект.ВидОперации, Ложь);
		Объект.СтатьяРасходовПоНачислению = Объект.СтатьяРасходов; //#9708
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщийМодульКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	ДополнительныеПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
	
	Отказ = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.СписыватьБонусы 
		И НЕ мСуммаБонусов = Объект.СуммаБонусовКСписаниюПоДисконтнойКарте Тогда
		
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеБонусовПодтверждениеПередЗаписью", ЭтотОбъект, ДополнительныеПараметры);
		БонусыКлиент.ПодтвердитьИзменениеСуммыБонусов(ОписаниеОповещения, Объект.СуммаБонусовКСписаниюПоДисконтнойКарте, мСуммаБонусов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеБонусовПодтверждениеПередЗаписью(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗаписи,, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизации()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю Тогда
		УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
		Объект.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);
	Иначе
		УчитыватьНДС = Истина;
	КонецЕсли;
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбновитьВидимостьГруппыБонусов()
	
	Элементы.ГруппаБонусыТекущиеДанные.Видимость = Объект.СписыватьБонусы И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю"));
	Элементы.ДисконтнаяКарта.Видимость = Объект.СписыватьБонусы И Объект.СлужебныйУчетБонусовПоДисконтнымКартам;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьБонусыПоДокументу()
	
	Объект.СуммаБонусовКСписаниюПоДисконтнойКарте = 0;
	Если Объект.СписыватьБонусы Тогда		
		//Объект.СуммаБонусовКСписаниюПоДисконтнойКарте = БонусыСервер.ПолучитьСуммуБонусовКНачислениюПоДокументуОплаты(Объект.Дата, Объект.Организация, Объект.Контрагент.Категория, Объект.Касса, Объект.Сумма, Объект.Ссылка, Объект.ДисконтнаяКарта, Объект.СлужебныйУчетБонусовПоДисконтнымКартам);
		СтруктураБонусов = БонусыСервер.ПолучитьСуммуБонусовКНачислениюПоДокументуОплаты(Объект.Дата, Объект.Организация, Объект.КатегорияКонтрагента, Объект.Касса, Объект.Сумма, Объект.Ссылка, Объект.ДисконтнаяКарта, Объект.СлужебныйУчетБонусовПоДисконтнымКартам);
		Объект.СуммаБонусовКСписаниюПоДисконтнойКарте = СтруктураБонусов.СуммаБонусов;
		Объект.ДокументНАНБ = СтруктураБонусов.ДокументНАНБ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДисконтнаяКартаПриИзменении(Элемент)
	ПересчитатьБонусыПоДокументу();
КонецПроцедуры

&НаКлиенте
Процедура Распределение_ПодобратьПоОстаткам(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПодобратьПоОстаткамЗавершение", ЭтотОбъект);
	ОбщийМодульКлиент.ПроверитьВозможностьПодбораЗаказовВДокументРасхода(Оповещение, ЭтаФорма, Объект.РаспределениеПлатежа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПоОстаткамЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	АдресПлатежейВХранилище = ПоместитьРасшифровкуПлатежаВХранилище();
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("АдресПлатежейВХранилище", АдресПлатежейВХранилище);
	ПараметрыПодбора.Вставить("Организация", Объект.Организация);
	ПараметрыПодбора.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыПодбора.Вставить("Валюта", Объект.Валюта);
	ПараметрыПодбора.Вставить("СуммаДокумента", Объект.Сумма);
	ПараметрыПодбора.Вставить("ДатаДокумента", Объект.Дата);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораПоРасчетамСКонтрагентами",	ПараметрыПодбора, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьРасшифровкуПлатежаВХранилище()
	
	АдресПлатежейВХранилище = ПоместитьВоВременноеХранилище(Объект.РаспределениеПлатежа.Выгрузить(), УникальныйИдентификатор);
	Возврат АдресПлатежейВХранилище;
	
КонецФункции

&НаСервере
Процедура ПолучитьРаспределениеПлатежаИзХранилища(АдресПлатежейВХранилище)
	
	Объект.РаспределениеПлатежа.Загрузить(ПолучитьИзВременногоХранилища(АдресПлатежейВХранилище));
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура Распределение_Команда(Команда)
	
	ИмяФормыВыбора = "Документ." + СтрЗаменить(Команда.Имя, "Распределение_", "") + ".ФормаВыбора";
	Если Не Объект.Контрагент.Пустая() Тогда
		ЗначениеОтбора = Новый Структура("Контрагент", Объект.Контрагент);
		ПараметрВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		ПараметрВыбора.Вставить("МножественныйВыбор", Истина);
		ОткрытьФорму(ИмяФормыВыбора, ПараметрВыбора, Элементы.РаспределениеПлатежа);
		// результат обрабатывается в РаспределениеПлатежаОбработкаВыбора как владельца формы выбора
	Иначе
		Состояние("Не указан контрагент");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для каждого ВыбранныйДокумент из ВыбранноеЗначение Цикл
		Если НЕ ВыбранныйДокумент.Пустая() Тогда
			НоваяСтрока = Объект.РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ВыбранныйДокумент;
			НоваяСтрока.Сумма = Объект.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	//ОбновитьДанные();
	
КонецПроцедуры

//++ №12092
&НаКлиенте
Процедура ЗарплатаСотрудникам_ЗаполнитьПоОстаткам(Команда)
	
	Если Объект.ЗарплатаСотрудникам.Количество() > 0 Тогда
		
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВопросаОбОчищенииТабличнойЧастиЗарплатаСотрудникам", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "При продолжении табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗарплатаСотрудникам_ЗаполнитьПоОстаткамНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчищенииТабличнойЧастиЗарплатаСотрудникам(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаСотрудникам_ЗаполнитьПоОстаткамНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗарплатаСотрудникам_ЗаполнитьПоОстаткамНаСервере()
	
	Объект.ЗарплатаСотрудникам.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПерсоналомОстатки.Сотрудник КАК Сотрудник,
	|   РасчетыСПерсоналомОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыСПерсоналом.Остатки(&Дата, Организация = &Организация) КАК РасчетыСПерсоналомОстатки
	|ГДЕ
	|	РасчетыСПерсоналомОстатки.СуммаОстаток > 0
	|";
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.ЗарплатаСотрудникам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
	Объект.Сумма = Объект.ЗарплатаСотрудникам.Итог("Сумма");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСотрудникамПослеУдаления(Элемент)
	
	Объект.Сумма = Объект.ЗарплатаСотрудникам.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПроцентовПоЗаймуПриИзменении(Элемент)
	Если Объект.Сумма > 0 И Объект.Сумма > Объект.СуммаПроцентовПоЗайму Тогда
		 Объект.СуммаОсновногоТелаЗайма = Объект.Сумма - Объект.СуммаПроцентовПоЗайму;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаОсновногоТелаЗаймаПриИзменении(Элемент)
	Если Объект.Сумма > 0 И Объект.Сумма > Объект.СуммаОсновногоТелаЗайма Тогда
		Объект.СуммаПроцентовПоЗайму = Объект.Сумма - Объект.СуммаОсновногоТелаЗайма;
	КонецЕсли;
КонецПроцедуры

//-- №12092

//++15531
&НаКлиенте
Процедура ЗаполнитьОснованияПоРаспределениюКоманда(Команда)
	Если Объект.Основания.Количество() > 0 Тогда
		ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОбОчищенииТаблицыОснования", ЭтотОбъект), "Табличная часть основания будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьОснованияПоРаспределению();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчищенииТаблицыОснования(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Основания.Очистить();
		ЗаполнитьОснованияПоРаспределению();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОснованияПоРаспределению()
	
	ОбработкаТабличныхЧастейСервер.ЗаполнитьОснованияПоРаспределению(Объект.Основания, Объект.РаспределениеПлатежа);
		
КонецПроцедуры


//--15531

