
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.ЗакрыватьПриВыборе            = Истина;
	Параметры.ЗакрыватьПриЗакрытииВладельца = Ложь;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры);
	
	//Элементы.ПредполагаемыйМонтажДата.Доступность  = НЕ ПредполагаемыйМонтажДатаМонтажаНеОпределена;  //#8409
	//Элементы.ПредполагаемыйМонтажВремя.Доступность = НЕ ПредполагаемыйМонтажДатаМонтажаНеОпределена;  //#8409
	
	ОбновитьИнформациюПоЗамеруЛида(); // №11768
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Модифицированность И Не Готово Тогда
		
		Отказ = Истина;
		
		СписокКнопок = Новый СписокЗначений();
		СписокКнопок.Добавить("Закрыть", НСтр("ru = 'Закрыть'"));
		СписокКнопок.Добавить("НеЗакрывать", НСтр("ru = 'Не закрывать'"));
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), 
			НСтр("ru = 'Все измененные данные будут потеряны. Закрыть форму?'"), 
			СписокКнопок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = "Закрыть" Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОчиститьСообщения();
	
	Если Не Модифицированность ИЛИ ТолькоПросмотр Тогда
		
		Закрыть();
		
	Иначе
		
		СтруктураОбъекта = Новый Структура;
		СтруктураОбъекта.Вставить("ПредполагаемыйМонтажДатаМонтажаНеОпределена",      ПредполагаемыйМонтажДатаМонтажаНеОпределена);
		СтруктураОбъекта.Вставить("ПредполагаемыйМонтажДата",          	ПредполагаемыйМонтажДата);
		СтруктураОбъекта.Вставить("ПредполагаемыйМонтажВремя",         	ПредполагаемыйМонтажВремя);
		
		//++ №11768
		СтруктураОбъекта.Вставить("ИдентификаторЗамера", ИдентификаторЗамера);
		СтруктураОбъекта.Вставить("Замерщик", Замерщик);
		//-- №11768
		
		Готово = Истина;
		Закрыть(СтруктураОбъекта);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредполагаемыйМонтажДатаМонтажаНеОпределенаПриИзменении(Элемент)
	
	Если ПредполагаемыйМонтажДатаМонтажаНеОпределена Тогда
		ПредполагаемыйМонтажДата  = Дата(1,1,1); //"";
		ПредполагаемыйМонтажВремя = Дата(1,1,1); //"";
		//Элементы.ПредполагаемыйМонтажДата.Доступность = Ложь;    //#8409
		//Элементы.ПредполагаемыйМонтажВремя.Доступность = Ложь;   //#8409
	Иначе
		//Элементы.ПредполагаемыйМонтажДата.Доступность = Истина;  //#8409
		//Элементы.ПредполагаемыйМонтажВремя.Доступность = Истина; //#8409
	КонецЕсли;

КонецПроцедуры

//++ №11768
&НаСервере
Процедура ОбновитьИнформациюПоЗамеруЛида()
	
	ИмяКлиентаЛида			= Лид.ИмяКлиента;
	АдресКлиентаЛида 		= Лид.Адрес;

	СуммаДоговораНаЗамере 	= 0;
	ДатаЗамера 				= Дата(1, 1, 1);
	ВремяНачалаЗамера 		= Дата(1, 1, 1);
	РезультатЗамера 		= Справочники.РезультатЗамераЛида.ПустаяСсылка();
	Замерщик				= Справочники.Сотрудники.ПустаяСсылка();
	КомментарийЗамерщика	= "";
	
	Если ЗначениеЗаполнено(ИдентификаторЗамера) И ЗначениеЗаполнено(Лид) Тогда
		
		НайденнаяСтрока = Лид.Замеры.НайтиСтроки(новый Структура("ИДЗамера", ИдентификаторЗамера));
		Если НайденнаяСтрока.Количество() > 0 Тогда
			
			СуммаДоговораНаЗамере	= НайденнаяСтрока[0].СуммаДоговораНаЗамере;
			ДатаЗамера 				= НайденнаяСтрока[0].ДатаЗамера;
			ВремяНачалаЗамера 		= НайденнаяСтрока[0].ВремяНачалаЗамера;
			РезультатЗамера 		= НайденнаяСтрока[0].РезультатЗамера;
			Замерщик				= НайденнаяСтрока[0].ИсполнительЗамера;
			КомментарийЗамерщика	= НайденнаяСтрока[0].КомментарийЗамерщика;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГруппаДанныеЗамераДополнительно.Видимость = (РезультатЗамера = Справочники.РезультатЗамераЛида.ЗаключенДоговор);
	Элементы.ОтвязатьЗамер.Видимость = ЗначениеЗаполнено(ИдентификаторЗамера);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтвязатьЗамер(Команда)
	
	ИдентификаторЗамера = Неопределено;
	ЗамерщикВДоговоре = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	Модифицированность = Истина;
	
	ОбновитьИнформациюПоЗамеруЛида();
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьЗамер(Команда)
	
	СписокЗамеровДляОформления = ПолучитьЗамерыДляОформленияДоговора();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораЗамераДляПривязки", ЭтотОбъект);
	ОткрытьФорму("Документ.Лид.Форма.ВыборИсполнителяЗаказа", новый Структура("СписокЗамеровДляОформления", СписокЗамеровДляОформления), ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗамерыДляОформленияДоговора()
	
	МассивЗамеров = новый Массив;
	
	Для Каждого ТекущаяСтрока Из Лид.Замеры Цикл
		
		Если НЕ ТекущаяСтрока.ЗамерВыполнен И НЕ ТекущаяСтрока.РезультатЗамера = ПредопределенноеЗначение("Справочник.РезультатЗамераЛида.ЗаключенДоговор") Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураЗамера = Новый Структура("ДатаЗамера, ИсполнительЗамера, РезультатЗамера, ИдентификаторЗамера, ВремяНачалаЗамера, ВремяОкончанияЗамера, НомерЗамера");
		ЗаполнитьЗначенияСвойств(СтруктураЗамера, ТекущаяСтрока);
		
		СтруктураЗамера.ИдентификаторЗамера = ТекущаяСтрока.ИдЗамера;
		СтруктураЗамера.НомерЗамера = ТекущаяСтрока.НомерСтроки;
		
		МассивЗамеров.Добавить(СтруктураЗамера);
		
	КонецЦикла;
	
	Возврат МассивЗамеров;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораЗамераДляПривязки(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗамерщикВДоговоре) И НЕ ВыбранноеЗначение.Исполнитель = ЗамерщикВДоговоре Тогда
		
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВопросаОбИзмененииЗамерщика", ЭтотОбъект, ВыбранноеЗначение);
		ПоказатьВопрос(ОписаниеОповещения, "Замерщик будет изменен на исполнителя выбранного замера, продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПослеВыбораЗамераЗавершение(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбИзмененииЗамерщика(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПослеВыбораЗамераЗавершение(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗамераЗавершение(ПереданныеПараметры)
	
	Замерщик = ПереданныеПараметры.Исполнитель;
	ЗамерщикВДоговоре = ПереданныеПараметры.Исполнитель;
	ИдентификаторЗамера = ПереданныеПараметры.ИдентификаторЗамера;
	
	Модифицированность = Истина;
	
	ОбновитьИнформациюПоЗамеруЛида();
	
КонецПроцедуры
//-- №11768

#КонецОбласти
