
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НомерРозничногоДоговора") Тогда
		ОтборНомерРозничногоДоговора = Параметры.НомерРозничногоДоговора;
		УстановитьОтборПоНомеруДоговораСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерРозничногоДоговораПриИзменении(Элемент)
	
	УстановитьОтборПоНомеруДоговораСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерРозничногоДоговораОчистка(Элемент, СтандартнаяОбработка)
	
	Если ПустаяСтрока(ОтборНомерРозничногоДоговора) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоНомеруДоговораСервер()
			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "НомерРозничногоДоговора", ОтборНомерРозничногоДоговора, ВидСравненияКомпоновкиДанных.Равно,, НЕ ПустаяСтрока(ОтборНомерРозничногоДоговора));
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Оповестить("Запись_ПоступлениеТоваровИУслугСписок", ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти