&НаСервере
Функция ПолучитьЗаключениеДоговора()
	Возврат Справочники.РезультатыЗамера.ЗаключениеДоговора;
КонецФункции

&НаКлиенте
Процедура ПоказатьТолькоНаСтадииЗаключенияДоговора(Команда)
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
    ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Результат");
    ЭО.ПравоеЗначение=ПолучитьЗаключениеДоговора();
    ЭО.Использование=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсе(Команда)
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Результат");
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
