
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#9756 проверяем условие уникальности наименования
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыДополнительныхСвойствЛида КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.Наименование = &Наименование
	|	И ДанныеСправочника.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
	    Сообщить("Вид свойства с таким наименованием уже существует. Введите другое наименование.");
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры
