
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ #16764
	ЭтоЧертежМакет = Объект.Ссылка = Справочники.ВидыФайловПрограммыПостроителя.ЧертежПокупатель
	                 ИЛИ Объект.Ссылка = Справочники.ВидыФайловПрограммыПостроителя.Макет;
					 
	Элементы.Загружать.Видимость = НЕ ЭтоЧертежМакет;				 
	Элементы.ЗагружатьКакИзображениеНоменклатуры.Видимость = ЭтоЧертежМакет;
	//-- #16764

КонецПроцедуры

#КонецОбласти
