&НаКлиенте
Перем ПанельSimplitРасчетХэш; //специальная панель Simplit для получения ХешСумма для подписи наших запросов на OnlinePBX (расчет выполняется на сервере Simplit)

&НаКлиенте
Перем КлючЗапрашивался, КлючИД; //, КлючСессии - определена в модуле упр. приложения;
//, СостоянияЗвонка, СостоянияBLF, СостоянияРегистрации, СостоянияЗавершения, ТипыЗвонка, Расширение, Схема, ИмяМакета, ИмяМакетаHMAC, ИмяИсточника;

&НаКлиенте
Перем СтатусыНомеров, ИнфоОшибок, УчастникиГруппы;

&НаКлиенте
Перем СоответствиеКода_Mango;

///////////////////////////////////////////////////////////////////////////////////////////////////////

// ОбработчикиСобытийформы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Доступен = ОбщийМодуль.РасширенныйФункционалДоступен();
	Если НЕ Доступен тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИнтервалПроверкиПодключенияКАТС = Константы.ИнтервалПроверкиПодключенияКАТС.Получить();
	ИнтервалАвтоподключения = 30;
	
	ВерсияИсторииАТС = Константы.УДАЛИТЬ_ВерсияИсторииАТС.Получить();

	ИспользуетсяROMHMAC 	= СофтФон.ИспользуетсяROMHMAC();
	ИспользуетсяROMAsterisk = СофтФон.ИспользуетсяROMAsterisk();
	ИспользуетсяSIOМегафон 	= СофтФон.ИспользуетсяМегафон();
	ИспользуетсяSIOUIS 		= СофтФон.ИспользуетсяUIS();
	ИспользуетсяSIODomRu 	= СофтФон.ИспользуетсяDomRu();
	ИспользуетсяSIOSipuni 	= СофтФон.ИспользуетсяSipuni();
	ИспользуетсяSIOBinotel 	= СофтФон.ИспользуетсяBinotel(); //++2020-06-29
	ИспользуетсяSIOMango    = СофтФон.ИспользуетсяMango(); //++2021-08
	ИспользуетсяSIOPhonet   = СофтФон.ИспользуетсяPhonet(); //++2021-12

	Если ИспользуетсяSIOМегафон Тогда
		ИДВАТС = "megafon";
	ИначеЕсли ИспользуетсяSIOUIS Тогда
		ИДВАТС = "uis";
	ИначеЕсли ИспользуетсяSIODomRu Тогда
		ИДВАТС = "domru";
	ИначеЕсли ИспользуетсяROMAsterisk Тогда
		ИДВАТС = "asterisk";
	ИначеЕсли ИспользуетсяSIOSipuni Тогда
		ИДВАТС = "sipuni";
	ИначеЕсли ИспользуетсяSIOBinotel Тогда
		ИДВАТС = "binotel";
		ВерсияAPI="2.0";
	ИначеЕсли ИспользуетсяSIOMango Тогда
		ИДВАТС = "mango";
	ИначеЕсли ИспользуетсяSIOPhonet Тогда
		ИДВАТС = "phonet";
	КонецЕсли;
	
	ВнутреннийНомер = СофтФон.ПолучитьВнутреннийНомерПользователя();
	ЛогинТелефонии  = СофтФон.ПолучитьЛогинТелефонииПользователя();
	
	Схема="https://";
	КлючAPI  = СофтФон.ПолучитьПарольАдминистратораАТС();
	ДоменAPI = СофтФон.ПолучитьТелефонияАдресСервера();
	АдресAPI = ДоменAPI; // используется: sipuni, mango
	Если ИспользуетсяSIOSipuni Тогда
		АдресAPI = ДоменAPI+"/api";		
	КонецЕсли;
	КлючWSS  = СофтФон.ПолучитьКлючWSS(); // используется: sipuni
	НомерВАТС= СофтФон.ПолучитьНомерВАТС(); // используется: sipuni
	ПарольAPI= СофтФон.ПолучитьПарольAPI(); // используется: binotel
	КлючДляПодписи = СофтФон.ПолучитьКлючДляПодписи(); // используется: mango
	
	ЛогинSimplit = СофтФон.ПолучитьЛогинSimplit();
	ПарольSimplit = СофтФон.ПолучитьПарольSimplit();
	
	Вариант53_Asterisk   = (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_53"));
	Вариант85_Asterisk   = (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_85"));
	Вариант85_2_Asterisk = (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_85_2"));
	Вариант93_Asterisk   = (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_93"));
	Вариант296_Asterisk  = (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_296"));
	Вариант93_1_Asterisk   	= (ВариантНастроекТелефонии_Asterisk() = ПредопределенноеЗначение("Справочник.ВариантыНастроекТелефонии.Вариант_93_1"));
	
	//#10674
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	КаналИсходящегоВызова = ОбщийМодульСервер.НастройкаПользователя("КаналИсходящегоВызова", ТекущийПользователь);
	КаналИсходящегоВызова = ?(ПустаяСтрока(КаналИсходящегоВызова), "SIP/"+ВнутреннийНомер, КаналИсходящегоВызова);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыСеансаТелефонияСтрана()
	Возврат ПараметрыСеанса.ТелефонияСтрана;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СофтФон.ТекущемуПользователюРазрешеноИспользованиеIPТелефонии() Тогда
		Подключиться(Неопределено);
		ИнтервалЗапросаИсторииЗвонков = ИнтервалЗапросаИсторииЗвонков();
		Если ИнтервалЗапросаИсторииЗвонков > 0 Тогда
			ПодключитьОбработчикОжидания("АвтоматическиЗапроситьИсториюЗвонков",1,Истина); //запустить прямо сейчас
			ПодключитьОбработчикОжидания("АвтоматическиЗапроситьИсториюЗвонков",ИнтервалЗапросаИсторииЗвонков,Ложь); //запускать периодическии
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользуетсяSIOBinotel Тогда
		ИнициализироватьИнфоОшибок_Binotel();
		УчастникиГруппы = Новый Массив;
	ИначеЕсли ИспользуетсяSIOMango Тогда	
		ИнициализироватьОписаниеКода_Mango();
	ИначеЕсли ИспользуетсяSIOPhonet Тогда
		ИнициализироватьИнфоОшибок_Phonet();
		ИнициализироватьСтатусы_Phonet();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ПанельRomHMac<>Неопределено Тогда
		Если ПанельRomHMac.Подключено Тогда
			ПанельRomHMac.Отключиться();
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ПанельRomAsterisk = Неопределено;
	ПанельRomHMac = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	ДанныеСобытия=СофтФон.ДанныеВСоответствие(Данные);
	СтрокаЛога = "Источник="+Источник+". Событие="+Событие+". Данные="+Данные;
	
	ЗаписатьСобытиеВЛог(СокрЛП(ДанныеСобытия.Получить("Event")),СтрокаЛога, Данные);
	
	Если Источник = "SoftPhone" Тогда
		//СОБЫТИЕ Рарус-СофтФон 3.0 //////////////////////////////////////////////
		
		МассивСоответствия = UnJSON(ЗаменитьНедопустимыеСимволыXML(Данные));
		Если МассивСоответствия = Неопределено Тогда
			Возврат;
		ИначеЕсли НЕ (ТипЗнч(МассивСоответствия)  = Тип("Соответствие")) Тогда
			Возврат;
		ИначеЕсли МассивСоответствия.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		СтруктураДанных = Новый Структура();
		Для Каждого ЭлементМассива Из МассивСоответствия Цикл
			СтруктураДанных.Вставить(ЭлементМассива.Ключ, ЭлементМассива.Значение); 
		КонецЦикла;
		
		Если Событие = "OnCallInfoEx" Тогда
			Если СтруктураДанных.State = 5 и НЕ СокрЛП(СтруктураДанных.CallerID) = СокрЛП(ВнутреннийНомер) Тогда
				//входящий звонок текущему пользователю
				
				Если ПользовательПринимаетВходящиеЗвонки() Тогда
					СтруктураНовойФормы = Новый Структура;
					СтруктураНовойФормы.Вставить("НомерАбонента",СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(СтруктураДанных.CallerID));
					СтруктураНовойФормы.Вставить("ВнешняяЛиния",СтруктураДанных.CalledId);
					СтруктураНовойФормы.Вставить("НашВнутреннийНомер",ВнутреннийНомер);
					ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок",СтруктураНовойФормы,,СтруктураДанных.CallerID,ВариантОткрытияОкна.ОтдельноеОкно,,,);
				КонецЕсли;
				
			КонецЕсли;
		ИначеЕсли  Событие = "PutSettingsJSON" Тогда	
			//
		ИначеЕсли  Событие = "OnEvent" Тогда
			//
		ИначеЕсли  Событие = "OnEventData" Тогда
			//
		ИначеЕсли  Событие = "OnAllLinesInfo" Тогда
			//
		ИначеЕсли  Событие = "OnLinesStatus" Тогда	
			//
		ИначеЕсли  Событие = "OnRecordInfo" Тогда	
			//
		ИначеЕсли  Событие = "OnResultInfo" Тогда
			//
		ИначеЕсли  Событие = "OnCallInfoCoMagic" Тогда
			//
		КонецЕсли;

	
	ИначеЕсли Источник = "ROM-Asterisk-Native" Тогда
		//СОБЫТИЕ АСТЕРИСК //////////////////////////////////////////////
		
		//Вариант получения событий:
		//1. Пишется под каждого клиента (в зависимости от очереди, от настрое к и т.д. в ряде случаев подходит то что уже делали
		//
		//Вариант получения истории:
		//1. в таблице используется filename (формат свой) 
		//1462348401.7930-2016-05-04-10_53-201-89178797700.mp3
		//2. в таблице используется recordingfile (формат свой) in-435405-89878631473-20171022-161042-1508670642.4457.wav
		//
		//Вариант получения записи звонка:
		//1. по ссылке dl.php?BASE64. Указать каталог размещения сайта. Все функции поиска и отдачи файла выполняет веб сервер, со стороны клиента ОС ведет себя как обычное открытие/скачивание файлв.
		//2. ftp - если исп. 2 вариант выше берем из поля cdrdate, YY\MM\DD. FTP и FTPs (не sFTP) реализовать нет проблем 
		//3. samba - если исп. 2 вариант выше берем из поля cdrdate, YY\MM\DD. Авторизация? если нет доступа к сетевой папке, 1с при прослушивании не запросит авторизацию, пользователю нужно будет зайти в папки виндовыми средствами и открыть папку.
		//4. по другой ссылке http запрос либо получать ссылку на файл или в двоичном виде
		//необходимо разрабатывать api на сервере и отправку/прием в 1с
		//		
		//Имя поля записи [filename, recordingfile]
		//Вариант доступа к записям. Выбор из вариантов: "DL.php, Ftp-сервер, samba, http-запрос"
		//
		//когда Вариант доступа к записям = DL.php
		//должна быть настройка начального каталога
		//
		//Ftp-сервер, samba
		//хост, порт, логин, пароль, начальный каталог, формат иерархии папок 
		//
		//http-запрос
		//url,запросом отправляем имя файла, в ответ получаем двоичные данные записи звонка
		
		Если Событие="Disconnect" Тогда
						
			ПодключенКАТС = Ложь;
			УстановитьСтатусПользовательПодключен(ПодключенКАТС);
			//Подключиться(Неопределено); //пробуем переподключиться //пока убрана, т.к. в случае обрыва связи с АТС 1с наглухо зависает в попытках подключиться
			//#13668			
			ПодключитьОбработчикОжидания("ПодключитьсяКСерверуAsterisk", ИнтервалАвтоПодключения, Ложь);
			Возврат;
			
		ИначеЕсли ВРег(СокрЛП(ДанныеСобытия.Получить("Response"))) = "FOLLOWS" Тогда
			
			//идет запрос состояния подключения телефона (программнорго ил иаппаратного) к АТС
			ПакетДанных = ДанныеСобытия.Получить("Пакет");
			
			МассивЗначений = СтрРазделить(ПакетДанных, Символы.ПС);
			Для Ном = 0 По МассивЗначений.Количество()-1 Цикл
				Если СтрНайти(МассивЗначений[Ном], "Status") > 0 Тогда
					Если СтрНайти(ВРег(МассивЗначений[Ном]), "UNKNOWN") > 0 Тогда
						ПоказатьОповещениеПользователя("Для работы с ip-телефонией" + Символы.ПС + "следует подключить программный " + Символы.ПС + "или аппаратный телефон к АТС");
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			//отрабатываем событие в зависимости от вариантов настроек
			ВидСобытия=ВРег(СокрЛП(ДанныеСобытия.Получить("Event")));                                 
			//Если ВРег(ВидСобытия)="DIALBEGIN" ИЛИ ВРег(ВидСобытия)="NEWCHANNEL" ИЛИ ВРег(ВидСобытия)="AGENTCALLED" Тогда
				
				Если Вариант53_Asterisk Тогда
					//вариант 53
					Вариант_53_Asterisk(ВидСобытия, ДанныеСобытия)
				ИначеЕсли Вариант85_Asterisk Тогда
					//вариант 85
					Вариант_85_Asterisk(ВидСобытия, ДанныеСобытия)
				ИначеЕсли Вариант85_2_Asterisk Тогда
					//вариант 85 (очереди)
					Вариант_85_2_Asterisk(ВидСобытия, ДанныеСобытия)
				ИначеЕсли Вариант93_Asterisk Тогда
					//вариант 93
					ОбработкаСобытий_Вариант_93_Asterisk(ВидСобытия, ДанныеСобытия);
				ИначеЕсли Вариант296_Asterisk Тогда
					//вариант 296
					ОбработкаСобытий_Вариант_296_Asterisk(ВидСобытия, ДанныеСобытия);
				ИначеЕсли Вариант93_1_Asterisk Тогда
					//вариант 93.1
					ОбработкаСобытий_Вариант_93_1_Asterisk(ВидСобытия, ДанныеСобытия);
				Иначе
					//неизвестный вариант. не реагируем 
				КонецЕсли;
			//КонецЕсли;
			
		КонецЕсли;
	
	ИначеЕсли Источник="SimplitIO-WS.OnPBX" 
		ИЛИ Источник="SimplitIO-WS.megafon" ИЛИ Источник="SimplitIO-WS.domru"
		ИЛИ Источник="SimplitIO-WS.uis" 
		ИЛИ Источник="SimplitIO-WS.sipuni" 
		ИЛИ Источник="SimplitIO-WS.binotel"
		ИЛИ Источник="SimplitIO-WS.mango"
		ИЛИ Источник="SimplitIO-WS.phonet"
		Тогда
		//СОБЫТИЕ SimplitIO ///////////////////////////////////////////
		
		Если Данные="{""Connection"": ""Close""}" ИЛИ Данные="{""Connection"": ""Fail""}" Тогда
			
			ПодключенКАТС = Ложь;
			//пытаемся переподключиться
			ПодключитьсяКАТС();
			
		ИначеЕсли Данные="{""Connection"": ""Open""}" Тогда
			
			ПодключенКАТС = Истина;			
			
		КонецЕсли;
		
		Если Событие="{""Event"": ""Message""}" Тогда
			//обработка событий различается в части разбора JSON (структура или соответствие)
			Если Источник="SimplitIO-WS.OnPBX" Тогда
 				ОбработкаСобытийСервераSimplitOnPbx(Источник, Данные);
			Иначе
				ОбработкаСобытийСервераSimplitOther(Источник, Данные);
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// событие по кнопкам Скачать / Прослушать для OnPbx (Журнал звонков, форма контрагента, форма лида, форма списка истории АТС)
	Если ИмяСобытия = "ПолучитьСсылкуНаЗаписьOnPbxОткрыть"
		ИЛИ ИмяСобытия = "ПолучитьСсылкуНаЗаписьOnPbxСкачать" Тогда
		
		//ЗагружатьЗаписьOnPbx = (ИмяСобытия = "ПолучитьСсылкуНаЗаписьOnPbxСЗагрузкой");
		Если ИмяСобытия = "ПолучитьСсылкуНаЗаписьOnPbxОткрыть" Тогда
			РежимЗагрузкиЗаписиOnPbx = 0;
		Иначе
			Запустить = Параметр.Свойство("ЗапуститьПослеСкачивания") И Параметр.ЗапуститьПослеСкачивания;
			Если НЕ Запустить Тогда
				РежимЗагрузкиЗаписиOnPbx = 1;
			Иначе
				РежимЗагрузкиЗаписиOnPbx = 2;
			КонецЕсли;
		КонецЕсли;
		
		ИД = Параметр.ИДЗвонка;
		КаталогЗаписи = Параметр.Каталог;
		
		Маркер = "";

		Путь="history/search.json";
		Если ВерсияИсторииАТС = 1 Тогда
			Путь="mongo_history/search.json";
		КонецЕсли;
		
		ДанныеJSON="{'uuid':'"+ИД+"','download':true}";		
		
		Пакет = СформироватьПакетREST(ДанныеJSON, Путь, , Маркер);
		ПанельRomHMac.Отправить(Пакет);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСсылкуНаЗаписьBinotelОткрыть"
		ИЛИ ИмяСобытия = "ПолучитьСсылкуНаЗаписьBinotelСкачать" Тогда
		
		//ЗагружатьЗаписьBinotel = (ИмяСобытия = "ПолучитьСсылкуНаЗаписьBinotelСЗагрузкой");
		Если ИмяСобытия = "ПолучитьСсылкуНаЗаписьBinotelОткрыть" Тогда
			РежимЗагрузкиЗаписиBinotel = 0;
		Иначе
			Запустить = Параметр.Свойство("ЗапуститьПослеСкачивания") И Параметр.ЗапуститьПослеСкачивания;
			Если НЕ Запустить Тогда
				РежимЗагрузкиЗаписиBinotel = 1;
			Иначе
				РежимЗагрузкиЗаписиBinotel = 2;
			КонецЕсли;
		КонецЕсли;
		
		ИДЗаписи = Параметр.ИДЗвонка;
		КаталогЗаписи = Параметр.Каталог;
		Маркер = "";

		Путь="/stats/call-record.json";
		ДанныеJSON="{'callID':["+ИДЗаписи+"]}";	
		
		Пакет = СформироватьПакетREST(ДанныеJSON, Путь, , Маркер);
		ОтправитьПакетSimplitIO(Пакет);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСсылкуНаЗаписьMangoОткрыть"
		ИЛИ ИмяСобытия = "ПолучитьСсылкуНаЗаписьMangoСкачать" Тогда
		
		Если ИмяСобытия = "ПолучитьСсылкуНаЗаписьMangoОткрыть" Тогда
			РежимЗагрузкиЗаписиMango = 0;
		Иначе
			Запустить = Параметр.Свойство("ЗапуститьПослеСкачивания") И Параметр.ЗапуститьПослеСкачивания;
			Если НЕ Запустить Тогда
				РежимЗагрузкиЗаписиMango = 1;
			Иначе
				РежимЗагрузкиЗаписиMango = 2;
			КонецЕсли;
		КонецЕсли;
		
		ИДЗаписи = Параметр.ФайлЗаписиСсылка;
		КаталогЗаписи = Параметр.Каталог;
		Маркер = "";
		Команда = ?(ИмяСобытия = "ПолучитьСсылкуНаЗаписьMangoСкачать", "download", "play");
		Путь="queries/recording/post";
		ДанныеJSON = "{'recording_id':'"+ИДЗаписи+"','action':'"+Команда+"'}";	
		
		Маркер="record-request."+Команда+"." + ИДЗаписи;
		
		Пакет = СформироватьПакетREST(ДанныеJSON, Путь, "post", Маркер);
		ОтправитьПакетSimplitIO(Пакет);
		
	// событие с Журнала звонков по кнопке ПолучитьИсториюИзАТСВручную
	ИначеЕсли ИмяСобытия = "ПолучитьИсториюИзАТСВручную" Тогда
		ПолучитьИсторию(Параметр.ДатаНачала, Параметр.ДатаОкончания);
		
	ИначеЕсли ИмяСобытия = "ВыполнитьИсходящийЗвонок" Тогда
		ВыполнитьИсходящийЗвонок(Параметр.ТелефонКлиента, Параметр.ИмяКлиента);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусПользовательПодключен(ТекущийСтатус)
	ПраваПользователей.ТекущийПользовательПодключенКТелефонии(ТекущийСтатус);
КонецПроцедуры

/////////////////// СЕРВИСНЫЕ ПРОЦЕДУРЫ ///////////////////////////////////////////////////////////////////
&НаСервере
Функция MD5(СтрХеширования)

	Возврат СофтФонСервер.MD5(СтрХеширования);

КонецФункции

&НаСервере
Функция ПолучитьДатуGMT()
	Возврат ТекущаяУниверсальнаяДата();
КонецФункции

&НаСервере
Функция ПолучитьИдСобытияДоТочки(Знач ИдСобытия)
	
	НомерТочки = СтрНайти(ИдСобытия, ".");
	Если НомерТочки > 0 Тогда
		Возврат Лев(ИдСобытия,НомерТочки-1);
	Иначе
		Возврат ИдСобытия;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПользовательПринимаетВходящиеЗвонки()
	Возврат ПараметрыСеанса.ТелефонияПринимаетВходящиеЗвонки;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьСобытиеВЛог(ИД, СтрокаЛога, Данные)
	
	//Если НЕ Константы.ВестиЛоггированиеСобытийАТС.Получить() Тогда
	//	Возврат;
	//КонецЕсли;
	
	НаборКонстант = Константы.СоздатьНабор("ВестиЛоггированиеСобытийАТС, ЛогСобытийАТСОтключитьПосле");
	НаборКонстант.Прочитать();
	Если НаборКонстант.ВестиЛоггированиеСобытийАТС
		И НаборКонстант.ЛогСобытийАТСОтключитьПосле < ТекущаяДата() Тогда  // именно ТекущаяДата() а не ТекущаяДатаСеанса()
		НаборКонстант.ВестиЛоггированиеСобытийАТС = Ложь;
		НаборКонстант.Записать();
		Возврат;
	КонецЕсли;
	
	Если НЕ НаборКонстант.ВестиЛоггированиеСобытийАТС Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(МАКСИМУМ(ЛогАТС.ИдСобытия), 1) КАК ИдСобытия
	|ИЗ
	|	РегистрСведений.ЛогАТС КАК ЛогАТС";
	Количество = 1;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Количество = Выборка.ИдСобытия;	
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛогАТС.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период 		= ТекущаяДатаСеанса();
		МенеджерЗаписи.ИдСобытия 	= Количество + 1;
		МенеджерЗаписи.Событие 		= СтрокаЛога;
		МенеджерЗаписи.Данные 		= Данные;		
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КодироватьДанныеПакета(ДанныеПакета)
	Возврат КодироватьСтроку(ДанныеПакета,СпособКодированияСтроки.КодировкаURL);
КонецФункции

&НаСервереБезКонтекста
Функция ДекодироватьДанныеПакета(ДанныеПакета)
	Возврат РаскодироватьСтроку(ДанныеПакета,СпособКодированияСтроки.КодировкаURL);
КонецФункции

&НаКлиенте
Процедура Пауза(КоличествоСекунд)
	
	ВС_Шелл = Новый COMОбъект("WScript.Shell");
	ВС_Шелл.Run("ping 127.0.0.1 -n "+КоличествоСекунд, 0, 1);
	
КонецПроцедуры

&НаКлиенте
Функция Base64РаскодироватьCDO(Знач Строка64)
	
	Результат=Строка64;
	
	Попытка
		
		// раскодирование Base64 средствами Win-библиотеки CDO
		// достоинства - быстрая обработка
		CDO=Новый COMОбъект("CDO.Message");
		BodyPart=CDO.BodyPart;
		BodyPart.ContentTransferEncoding="base64";
		
		Stream=BodyPart.GetEncodedContentStream();
		Поля=BodyPart.Fields;
		Поле=Поля.Item("urn:schemas:mailheader:content-type");
		Поле.Value="text/plain;charset=""windows-1251""";
		Поля.Update();
		Stream.WriteText(Строка64);
		Stream.Flush();
		Stream=BodyPart.GetDecodedContentStream();
		Stream.charset="utf-8";
		Результат=Stream.ReadText();
		
	Исключение
	КонецПопытки; 
	
	Если Результат="" Тогда
		Результат=Строка64;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Base64РаскодироватьСимволы(Знач Строка64)
	
	Результат=Строка64;
	Попытка
	
		// раскодирование Base64, 
		// достоинства - без файловых операций и серверных вызовов
		// недостаток - медленная, посимвольная обработка
		// на базе mxm2
		Если Лев(Строка64, 4) = "77u/" Тогда
			Строка64 = Сред(Строка64, 5);
		КонецЕсли;
		
		Массив64 = Новый Массив;
		Для Код = КодСимвола("A") По КодСимвола("Z") Цикл
			Массив64.Добавить(Символ(Код));
		КонецЦикла;
		
		Для Код = КодСимвола("a") По КодСимвола("z") Цикл
			Массив64.Добавить(Символ(Код));
		КонецЦикла;
		
		Для Код = КодСимвола("0") По КодСимвола("9") Цикл
			Массив64.Добавить(Символ(Код)); 
		КонецЦикла;
		Массив64.Добавить("+");
		Массив64.Добавить("/");
		
		МассивВрем = Новый Массив;
		
		Строка64 = СтрЗаменить(СтрЗаменить(Строка64, Символ(13), ""), Символ(10), "");
		
		Количество4 = Цел(СтрДлина(Строка64) / 4);
		Результат = "";
		Заглушек = 0;
		Для Индекс4 = 0 По Количество4 - 1 Цикл
			Накопитель = 0;
			Для Индекс = 0 По 3 Цикл
				Символ = Сред(Строка64, Индекс4 * 4 + 1 + Индекс, 1);
				Если Символ = "=" Тогда
					Заглушек = Заглушек + 1;
					Накопитель = Накопитель * 64; // Поднимаем разрядность
					Продолжить;
				КонецЕсли;
				
				ИндексЭлемента = Массив64.Найти(Символ);
				Накопитель = Накопитель * 64 + ИндексЭлемента;
			КонецЦикла;
			
			Для Индекс3 = - 2 По 0 Цикл
				Остаток = Накопитель % 256;
				Если МассивВрем.ВГраница() >= Индекс4 * 3 - Индекс3 Тогда
					МассивВрем[Индекс4 * 3 - Индекс3] = Остаток;
				Иначе
					МассивВрем.Вставить(Индекс4 * 3 - Индекс3, Остаток);
				КонецЕсли;
				Накопитель = (Накопитель - Остаток) / 256;
			КонецЦикла;
		КонецЦикла;
		
		КоличествоЭлементов = МассивВрем.Количество() - Заглушек;
		Индекс = 0;
		Пока Индекс < КоличествоЭлементов Цикл
			Если Индекс + 3 < КоличествоЭлементов И МассивВрем[Индекс] >= 240 И МассивВрем[Индекс + 1] >= 128 И МассивВрем[Индекс + 2] >= 128 И МассивВрем[Индекс + 3] >= 128 Тогда
				Результат = Результат + Символ(64 * 64 * 64 *(МассивВрем[Индекс] - 240) + 64 * 64 *(МассивВрем[Индекс + 1]) - 128 + 64 * (МассивВрем[Индекс + 2] - 128) + МассивВрем[Индекс + 3] - 128);
				Индекс = Индекс + 4;
				Продолжить;
			ИначеЕсли Индекс + 2 < КоличествоЭлементов И МассивВрем[Индекс] >= 224 И МассивВрем[Индекс + 1] >= 128 И МассивВрем[Индекс + 2] >= 128 Тогда
				Результат = Результат + Символ(64 * 64 * (МассивВрем[Индекс] - 224) + 64 * (МассивВрем[Индекс + 1] - 128) + МассивВрем[Индекс + 2] - 128);
				Индекс = Индекс + 3;
				Продолжить;
			ИначеЕсли Индекс + 1 < КоличествоЭлементов И МассивВрем[Индекс] >= 192 И МассивВрем[Индекс + 1] >= 128 Тогда
				Результат = Результат + Символ(64 * (МассивВрем[Индекс] - 192) + МассивВрем[Индекс + 1] - 128);
				Индекс = Индекс + 2;
				Продолжить;
			Иначе
				Результат = Результат + Символ(МассивВрем[Индекс]);
				Индекс = Индекс + 1;
				Продолжить;
			КонецЕсли;
		КонецЦикла;
	Исключение
		//
	КонецПопытки; 
	
	Результат = СтрЗаменить(Результат, Символы.ВК + Символы.ПС, Символы.ПС);
	
	Если Результат="" Тогда
		Результат=Строка64;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции
 
&НаКлиенте
Функция Base64Раскодировать(Знач Строка64)

	Результат=Base64РаскодироватьCDO(Строка64);
	
	Если Результат=Строка64 Тогда
		Если ЗначениеЗаполнено(Base64Значение(Строка64)) Тогда
			Результат=Base64РаскодироватьСимволы(Строка64);
		КонецЕсли; 
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ОбработкаИсторияАТСКлиент(СтруктПараметры)
		
	ДлительнаяОперация = ОбработкаИсторияАТССервер(СтруктПараметры);
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИсторияАТСЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбработкаИсторияАТССервер(СтруктПараметры)
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обработка истории звонков АТС'");
	
	Результат = ДлительныеОперации.ВыполнитьВФоне("СофтФон.ОбработкаИсторииЗвонковАТС", СтруктПараметры, ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИсторияАТСЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
			
		//ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		//	НСтр("ru = 'Задание прервано по причине:
		//		|%1'"),
		//	Результат.КраткоеПредставлениеОшибки);			
		//Сообщить(ТекстОшибки);
		
		Возврат;
	КонецЕсли;
	
	Оповестить("ЗагруженаИсторияАТС");

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучениеСсылкиФайлаЗаписиЗвонка(РежимЗагрузкиЗаписи, ФайлЗаписиСсылка)
	// РежимЗагрузкиЗаписи = 0 - открыть ссылку
	// РежимЗагрузкиЗаписи = 1 - скачать
	// РежимЗагрузкиЗаписи = 2 - скачать и запустить
	
	Если РежимЗагрузкиЗаписи = 0 Тогда
		// открыть по ссылке
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", СофтФонКлиент);
		НачатьЗапускПриложения(ОписаниеОповещения, ФайлЗаписиСсылка);
	ИначеЕсли РежимЗагрузкиЗаписи = 1 ИЛИ РежимЗагрузкиЗаписи = 2 Тогда
		ПараметрыЗаписи = Новый Структура("ФайлЗаписиСсылка, ЗапуститьПослеСкачивания, Каталог", ФайлЗаписиСсылка, РежимЗагрузкиЗаписи = 2, КаталогЗаписи);
		СофтФонКлиент.ПолучитьФайлЗаписиПоHttpСсылке(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры
		
/////////////////// ПРОЦЕДУРЫ ASTERISK /////////////////////////////

&НаКлиенте
Функция ПодключитьКомпоненту_Asterisk_Синхронно()
	
	ИмяМакета="ОбщийМакет.ROMAsteriskZIP";
	
	// попытка установить компоненту
	Результат=ПодключитьВнешнююКомпоненту(ИмяМакета,"Simplit");
	
	Если Не Результат Тогда
		
		// неудачно, возможно еще не устанавлен
		УстановитьВнешнююКомпоненту(ИмяМакета);
		Результат=ПодключитьВнешнююКомпоненту(ИмяМакета,"Simplit");
		
	КонецЕсли; 
	
	// флаг, создание объекта
	ФлагПодключенияВК=Результат;
	Если Результат Тогда
		ПанельRomAsterisk=Новый("AddIn.Simplit.ROM-Asterisk-Native");
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключитьПанель_Asterisk()
	
	ПодключенКАТС = Ложь;
	Результат = Ложь;
	Попытка
		Результат = ПодключитьКомпоненту_Asterisk_Синхронно();
	Исключение
		ПоказатьОповещениеПользователя("Не удалось установить компоненту для АТС Asterisk " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Если НЕ Результат Тогда
		ПоказатьОповещениеПользователя("Не удалось подключить компоненту для АТС Asterisk");
		Возврат;
	КонецЕсли;
		
	ПодключитьсяКСерверуAsterisk();
	
КонецПроцедуры		
		
&НаКлиенте
Процедура ПодключитьсяКСерверуAsterisk()
	
	//подключаемся к серверу
	// IP-адрес или DNS-имя должны быть указаны обязательно
	ПодключитьсяКСерверуТелефонии = Истина;
	Адрес = СофтФон.ПолучитьТелефонияАдресСервера();
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		ПоказатьОповещениеПользователя("Не указан параметр соединения: IP-адрес сервера телефонии");
		ПодключитьсяКСерверуТелефонии = Ложь;
		Возврат;
	КонецЕсли; 
	
	// если не указан порт, тогда дефолтный порт AMI - 5038
	Порт = СофтФон.ПолучитьТелефонияНомерПорта();
	Если Не ЗначениеЗаполнено(Порт) Тогда
		Порт=5038;
	КонецЕсли; 
	
	Если ПодключитьсяКСерверуТелефонии Тогда
		Попытка
			Успешно=ПанельRomAsterisk.Подключиться(Адрес,Порт);
		Исключение
			ПоказатьОповещениеПользователя("Не удалось подключиться к серверу ip-телефонии. " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		// установки режима вывода всех сообщений сокета во внешнее событие
		Если Успешно Тогда
			ПанельRomAsterisk.РежимПрослушивания(1);
			
			CRLF=Chars.CR+Chars.LF;
			ТекстКоманды=
			"Action: Login"+CRLF+
			"Username: "+ЛогинАТС+CRLF+
			"Secret: "+ПарольАТС+CRLF+CRLF;
			
			УспешнаяОтправка=ПанельRomAsterisk.ВыполнитьКоманду(ТекстКоманды);
			
			ПодключенКАТС = Истина;
			УстановитьСтатусПользовательПодключен(ПодключенКАТС);
			ОтключитьОбработчикОжидания("ПодключитьсяКСерверуAsterisk");
			
			//применим наложение фильтра на получение событий
			Если Вариант53_Asterisk 
				ИЛИ Вариант296_Asterisk
				ИЛИ Вариант85_Asterisk // #11582 для получения "родительского" звонка, в котором хранится информация о внешней линии
				Тогда
				// для указанных вариантов получаем все события Newchannel
				// для варианта 296 использется для получения "родительского" звонка, в котором хранится информация о внешней линии
				РегулярноеВыражение = "DialBegin.{1,}?ВнутреннийНомер|Newchannel|AgentCalled.{1,}?ВнутреннийНомер|Hangup.{1,}?ВнутреннийНомер|BridgeEnter.{1,}?ВнутреннийНомер|Disconnect.{1,}?ВнутреннийНомер|AgentConnect.{1,}?ВнутреннийНомер|Bridge.{1,}?ВнутреннийНомер|Dial.{1,}?ВнутреннийНомер";
			Иначе
				РегулярноеВыражение = "DialBegin.{1,}?ВнутреннийНомер|Newchannel.{1,}?ВнутреннийНомер|AgentCalled.{1,}?ВнутреннийНомер|Hangup.{1,}?ВнутреннийНомер|BridgeEnter.{1,}?ВнутреннийНомер|Disconnect.{1,}?ВнутреннийНомер|AgentConnect.{1,}?ВнутреннийНомер|Bridge.{1,}?ВнутреннийНомер|Dial.{1,}?ВнутреннийНомер";
			КонецЕсли;
			РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение,"ВнутреннийНомер",ВнутреннийНомер);
			ПанельRomAsterisk.УстановитьРегулярноеВыражение(РегулярноеВыражение);
			
		Иначе
			ПоказатьОповещениеПользователя("Не удалось подключиться к серверу Asterisk");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВариантНастроекТелефонии_Asterisk()
	Возврат ПараметрыСеанса.ВариантНастроекТелефонии;
КонецФункции

&НаКлиенте
Процедура Вариант_53_Asterisk(ВидСобытия, ДанныеСобытия)
	
	Если ВРег(ВидСобытия)="NEWCHANNEL" Тогда
		
		ВнешняяЛиния = ДанныеСобытия.Получить("Exten");
		НомерАбонента = ДанныеСобытия.Получить("CallerIDNum");
		ИдЗвонка = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid"));
		
		Если НЕ ПустаяСтрока(ВнешняяЛиния) Тогда
			//пришло событие с входящим звонком на очередь, тут нет номера внутреннего абонента
			//копим историю
			НоваяСтрока = ИсторияAsterisk.Добавить();
			НоваяСтрока.Event = ВидСобытия;
			НоваяСтрока.Uniqueid = ИдЗвонка;
			НоваяСтрока.Exten = ВнешняяЛиния;
			НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
			НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");
		ИначеЕсли СокрЛП(НомерАбонента) = СокрЛП(ВнутреннийНомер) Тогда
			//событие звонка упало на наш внутренний номер
			
			//найдем внешнюю линию в истории
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("Uniqueid",ИдЗвонка);
			НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(ОтборСтрок);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ВнешняяЛиния = НайденныеСтроки[0].Exten;
				КтоЗвонит = НайденныеСтроки[0].CallerID2;
			КонецЕсли;
			
			Если ПользовательПринимаетВходящиеЗвонки() Тогда
				СтруктураНовойФормы = Новый Структура;
				СтруктураНовойФормы.Вставить("НомерАбонента",СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(КтоЗвонит));
				СтруктураНовойФормы.Вставить("ВнешняяЛиния",ВнешняяЛиния);
				СтруктураНовойФормы.Вставить("НашВнутреннийНомер",ВнутреннийНомер);
				СтруктураНовойФормы.Вставить("ИДсобытия",ИдЗвонка);
				ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок",СтруктураНовойФормы,,НомерАбонента,ВариантОткрытияОкна.ОтдельноеОкно,,,);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура Вариант_85_Asterisk(ВидСобытия, ДанныеСобытия)
	
	Если ВРег(ВидСобытия)="DIALBEGIN" Тогда
		
		//Начался звонок до поднятия трубки. Тут показываем окошко входящего звонка
		CallerID = ДанныеСобытия.Получить("CallerIDNum");
		DestCallerIDNum = ДанныеСобытия.Получить("DestCallerIDNum");
		
		Если НЕ СокрЛП(ВнутреннийНомер) = СокрЛП(CallerID) 
			И СокрЛП(ВнутреннийНомер) = СокрЛП(DestCallerIDNum) Тогда //ROM-Asterisk сначала звонит самому себе при исходящем звонке, такие события нужно исключить, реагируем когда позвонили именно нам
			
			НомерАбонента = ДанныеСобытия.Получить("DestConnectedLineNum");
			ВнешняяЛиния = "";
			ВнутреннийНомер = ВнутреннийНомер;
			
			//найдем внешнюю линию в истории
			ИдЗвонка = ДанныеСобытия.Получить("DestLinkedid");
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("Uniqueid",ИдЗвонка);
			НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(ОтборСтрок);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ВнешняяЛиния = НайденныеСтроки[0].Exten;
			КонецЕсли;
			// для клиента 164 (14.0)
			Если ПустаяСтрока(ВнешняяЛиния) И НЕ ДанныеСобытия.Получить("ConnectedLineNum") = Неопределено Тогда
				ВнешняяЛиния = ДанныеСобытия.Получить("ConnectedLineNum");
			КонецЕсли;
			
			Если ПользовательПринимаетВходящиеЗвонки() 
				И НЕ НомерАбонента = ВнутреннийНомер 	// обратный звонок АТС при исходящем звонке из 1с
				Тогда
				СтруктураНовойФормы = Новый Структура;
				СтруктураНовойФормы.Вставить("НомерАбонента",СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(НомерАбонента));
				СтруктураНовойФормы.Вставить("ВнешняяЛиния",ВнешняяЛиния);
				СтруктураНовойФормы.Вставить("НашВнутреннийНомер",ВнутреннийНомер);
				СтруктураНовойФормы.Вставить("ИДсобытия",ИдЗвонка);
				ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок",СтруктураНовойФормы,,НомерАбонента,ВариантОткрытияОкна.ОтдельноеОкно,,,);
			КонецЕсли;
			
			//КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия)="NEWCHANNEL" Тогда
		
		CallerID=ДанныеСобытия.Получить("CallerIDNum");
		Если НЕ СокрЛП(ВнутреннийНомер) = СокрЛП(CallerID) Тогда
			//копим историю
			НоваяСтрока = ИсторияAsterisk.Добавить();
			НоваяСтрока.Event = ВидСобытия;
			НоваяСтрока.Uniqueid = ДанныеСобытия.Получить("Uniqueid");
			НоваяСтрока.Uniqueid1 = ДанныеСобытия.Получить("Linkedid");
			НоваяСтрока.Exten = ДанныеСобытия.Получить("Exten");
			НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура Вариант_85_2_Asterisk(ВидСобытия, ДанныеСобытия)
	
	Если ВРег(ВидСобытия)="AGENTCALLED" Тогда
		
		//Начался звонок до поднятия трубки. Тут показываем окошко входящего звонка
		CallerID = ДанныеСобытия.Получить("CallerIDNum"); //номер телефона клиента (кто звонит)
		Interface = ДанныеСобытия.Получить("Interface"); //строка вида "SIP/ВнутреннийНомерПользователя"
		ИдЗвонка = ДанныеСобытия.Получить("Linkedid");
		
		Если НЕ СокрЛП(ВнутреннийНомер) = СокрЛП(CallerID) 
			И СтрНайти(Interface, СокрЛП(ВнутреннийНомер)) > 0 Тогда //ROM-Asterisk сначала звонит самому себе при исходящем звонке, такие события нужно исключить, реагируем когда позвонили именно нам
			
			НомерАбонента =CallerID;
			ВнешняяЛиния = ДанныеСобытия.Получить("Exten");
						
			Если ПользовательПринимаетВходящиеЗвонки() Тогда
				СтруктураНовойФормы = Новый Структура;
				СтруктураНовойФормы.Вставить("НомерАбонента",СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(НомерАбонента));
				СтруктураНовойФормы.Вставить("ВнешняяЛиния",ВнешняяЛиния);
				СтруктураНовойФормы.Вставить("НашВнутреннийНомер",ВнутреннийНомер);
				СтруктураНовойФормы.Вставить("ИДсобытия",ИдЗвонка);
				ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок",СтруктураНовойФормы,,НомерАбонента,ВариантОткрытияОкна.ОтдельноеОкно,,,);
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСобытий_Вариант_93_Asterisk(ВидСобытия, ДанныеСобытия)
	
	//копим историю звонков
	Если ВРег(ВидСобытия)="NEWCHANNEL" Тогда
		//1. Пришел звонок на наш внешний номер
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВидСобытия;
		НоваяСтрока.Uniqueid = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid"));
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Exten = ДанныеСобытия.Получить("Exten");
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");
		НоваяСтрока.CallerIDName = ДанныеСобытия.Получить("CallerIDName");

	ИначеЕсли ВРег(ВидСобытия)="DIAL" Тогда
		//2. АТС перепросила звонок на менеджера
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВидСобытия;
		НоваяСтрока.Uniqueid = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("UniqueID"));
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Uniqueid2 = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("DestUniqueID"));
		НоваяСтрока.Exten = "";
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");
		
	ИначеЕсли ВРег(ВидСобытия) = "HANGUP" Тогда	
		
		//Разорвал канал - положили трубку или разговор окончен - закрываем окно входящего звонка
		CallerIDNum = ДанныеСобытия.Получить("CallerIDNum");
		Uniqueid = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid"));
		ConnectedLineNum = ДанныеСобытия.Получить("ConnectedLineNum");
		ConnectedLineNum = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ConnectedLineNum);
		Channel = ДанныеСобытия.Получить("Channel");
		
		Если (СокрЛП(CallerIDNum) = СокрЛП(ВнутреннийНомер) ИЛИ (СтрНайти(Channel, "SIP/"+ВнутреннийНомер)=1)) 
			//И СокрЛП(ConnectedLineNum) = СокрЛП(НомерАбонента) 
			Тогда
			ЗакрытьФормуВходящегоЗвонка(Uniqueid);
			ИсторияAsterisk.Очистить();
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия)="BRIDGE" Тогда
		//3. Менеджер поднял трубку....
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВидСобытия;
		НоваяСтрока.Uniqueid = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid1"));
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Uniqueid2 = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid2"));
		НоваяСтрока.Exten = "";
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerID1");
		
	КонецЕсли;
		
	
	//отрабатываем события
	Если ВРег(ВидСобытия)="DIAL" Тогда
		Если ПользовательПринимаетВходящиеЗвонки() Тогда
			
			ВнутреннийНомерКудаУпалЗвонок = ДанныеСобытия.Получить("Dialstring");
			Если СокрЛП(ВнутреннийНомерКудаУпалЗвонок) = СокрЛП(ВнутреннийНомер) 
				Тогда
				//к нам упал
				
				НашВнешнийНомер = "";
				Отбор = Новый Структура;
				Отбор.Вставить("Uniqueid", ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("UniqueID")));
				Отбор.Вставить("Event","NEWCHANNEL");
				НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда						                                          				
					НашВнешнийНомер = НайденныеСтроки[0].Exten;						 						
				КонецЕсли;
				
				СтруктураНовойФормы = Новый Структура;
				СтруктураНовойФормы.Вставить("НомерАбонента",СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(ДанныеСобытия.Получить("CallerIDNum")));
				СтруктураНовойФормы.Вставить("ВнешняяЛиния",НашВнешнийНомер);
				СтруктураНовойФормы.Вставить("НашВнутреннийНомер",ВнутреннийНомер);
				СтруктураНовойФормы.Вставить("ИДсобытия",ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("UniqueID")));				
				ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок",СтруктураНовойФормы,,ДанныеСобытия.Получить("CallerIDNum"),ВариантОткрытияОкна.ОтдельноеОкно,,,);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия) = "BRIDGE" Тогда
		
		времИДсобытия = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid1"));
		
		Если СокрЛП(ДанныеСобытия.Получить("CallerID2")) = СокрЛП(ВнутреннийНомер) Тогда
			//создался канал между 2 мя - подняли трубку и начали разговор. Тут создаем документ "Лид"		
			НомерАбонента = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(СокрЛП(ДанныеСобытия.Получить("CallerID1")));
			ДействияПриПоднятииТрубки_Asterisk(НомерАбонента, времИДсобытия);
		КонецЕсли; 
		ЗакрытьФормуВходящегоЗвонка(времИДсобытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСобытий_Вариант_296_Asterisk(ВидСобытия, ДанныеСобытия)
	
	// порядок событий
	// NEWCHANNEL с CallerIDName / Exten. Uniqueid = ИД1 - первый ид звонка (в частности используется в истории)
	// DIAL Dialstring = ВнутреннийНомер@...  UniqueID = ИД1, DestUniqueID = ИД2
	// DIAL Dialstring = ВнутреннийНомер. Только здесь должна появляться форма звонка. UniqueID = ИД3, DestUniqueID = ИД4
	// BRIDGE CallerID2 = ВнутреннийНомер. Подняли трубку
	// HANGUP CallerIDNum = ВнутреннийНомер. Сброс. Посылаем оповещение закрытия формы входящего звонка. ИД? 
	
	//копим историю звонков
	Если ВРег(ВидСобытия)="NEWCHANNEL" Тогда
		//1. Пришел звонок на наш внешний номер
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВРег(ВидСобытия);
		НоваяСтрока.Uniqueid = ДанныеСобытия.Получить("Uniqueid");
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Exten = ДанныеСобытия.Получить("Exten");
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");
		НоваяСтрока.CallerIDName = ДанныеСобытия.Получить("CallerIDName");

	ИначеЕсли ВРег(ВидСобытия)="DIAL" Тогда
		//2. АТС перепросила звонок на менеджера
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВРег(ВидСобытия);
		НоваяСтрока.Uniqueid = ДанныеСобытия.Получить("UniqueID");
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Uniqueid2 = ДанныеСобытия.Получить("DestUniqueID");
		НоваяСтрока.Exten = "";
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");
		НоваяСтрока.Dialstring = ДанныеСобытия.Получить("Dialstring");
		
	ИначеЕсли ВРег(ВидСобытия) = "HANGUP" Тогда	
		
		//Разорвал канал - положили трубку или разговор окончен - закрываем окно входящего звонка
		CallerIDNum = ДанныеСобытия.Получить("CallerIDNum");
		Uniqueid = ДанныеСобытия.Получить("Uniqueid");
		ConnectedLineNum = ДанныеСобытия.Получить("ConnectedLineNum");
		//ConnectedLineNum = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ConnectedLineNum);
		Channel = ДанныеСобытия.Получить("Channel");
		
		Если //(СокрЛП(CallerIDNum) = СокрЛП(ВнутреннийНомер) ИЛИ (СтрНайти(Channel, "SIP/"+ВнутреннийНомер)=1)) 
			СокрЛП(ConnectedLineNum) = СокрЛП(ВнутреннийНомер) 
			Тогда
			ЗакрытьФормуВходящегоЗвонка(Uniqueid);
			ИсторияAsterisk.Очистить();
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия)="BRIDGE" Тогда
		//3. Менеджер поднял трубку....
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВРег(ВидСобытия);
		НоваяСтрока.Uniqueid = ДанныеСобытия.Получить("Uniqueid1");
		НоваяСтрока.Uniqueid1 = НоваяСтрока.Uniqueid;
		НоваяСтрока.Uniqueid2 = ДанныеСобытия.Получить("Uniqueid2");
		НоваяСтрока.Exten = "";
		НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerID1");
		
	КонецЕсли;
		
	
	//отрабатываем события
	Если ВРег(ВидСобытия)="DIAL" Тогда
		Если ПользовательПринимаетВходящиеЗвонки() Тогда
			
			ВнутреннийНомерКудаУпалЗвонок = ДанныеСобытия.Получить("Dialstring");
			ВнутреннийНомерМод = СокрЛП(ВнутреннийНомер) + "@";
			Если СокрЛП(ВнутреннийНомерКудаУпалЗвонок) = СокрЛП(ВнутреннийНомер) 
				//ИЛИ Лев(СокрЛП(ВнутреннийНомерКудаУпалЗвонок), СтрДлина(ВнутреннийНомерМод)) = ВнутреннийНомерМод
				Тогда
				//к нам упал
				
				Отбор = Новый Структура;
				Отбор.Вставить("CallerID2", ДанныеСобытия.Получить("CallerIDNum"));
				Отбор.Вставить("Event",    "DIAL");
				НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
				UniqueID = "";
				Колво = НайденныеСтроки.Количество();
				Для Индекс = 1 По Колво Цикл
					СтрокаТЗ = НайденныеСтроки[Колво-Индекс];
					Если Лев(СокрЛП(СтрокаТЗ.Dialstring), СтрДлина(ВнутреннийНомерМод)) = ВнутреннийНомерМод Тогда
						UniqueID = СтрокаТЗ.UniqueID;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				НашВнешнийНомер = "";
				Если НЕ ПустаяСтрока(UniqueID) Тогда
					НоваяСтрока.Uniqueid1 = UniqueID; // сохраним ИД сессии
					Отбор = Новый Структура;
					Отбор.Вставить("Uniqueid", UniqueID);
					Отбор.Вставить("Event","NEWCHANNEL");
					НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
					Если НайденныеСтроки.Количество() > 0 Тогда
						НашВнешнийНомер = ?(НЕ ПустаяСтрока(НайденныеСтроки[0].CallerIDName), НайденныеСтроки[0].CallerIDName, НайденныеСтроки[0].Exten); 						
					КонецЕсли;
					
					СтруктураНовойФормы = Новый Структура;
					СтруктураНовойФормы.Вставить("НомерАбонента",СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(ДанныеСобытия.Получить("CallerIDNum")));
					СтруктураНовойФормы.Вставить("ВнешняяЛиния",НашВнешнийНомер);
					СтруктураНовойФормы.Вставить("НашВнутреннийНомер",ВнутреннийНомер);
					СтруктураНовойФормы.Вставить("ИДсобытия", ДанныеСобытия.Получить("UniqueID"));
					СтруктураНовойФормы.Вставить("ИДСессииСобытия", UniqueID);
					
					ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок",СтруктураНовойФормы,,ДанныеСобытия.Получить("CallerIDNum"),ВариантОткрытияОкна.ОтдельноеОкно,,,);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия) = "BRIDGE" Тогда
		
		времИДсобытия = ДанныеСобытия.Получить("Uniqueid1");
		ИДСессии = ""; 
		Отбор = Новый Структура;
		Отбор.Вставить("Uniqueid", времИДсобытия);
		Отбор.Вставить("Event",    "DIAL");
		НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ИДСессии = НайденныеСтроки[0].Uniqueid1;
		КонецЕсли;
		
		Если СокрЛП(ДанныеСобытия.Получить("CallerID2")) = СокрЛП(ВнутреннийНомер) Тогда
			//создался канал между 2 мя - подняли трубку и начали разговор		
			НомерАбонента = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(СокрЛП(ДанныеСобытия.Получить("CallerID1")));
			ДействияПриПоднятииТрубки_Asterisk(НомерАбонента, времИДсобытия, ИДСессии);
		КонецЕсли; 
		ЗакрытьФормуВходящегоЗвонка(времИДсобытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСобытий_Вариант_93_1_Asterisk(ВидСобытия, ДанныеСобытия)
	
	//2. Звонок поступает по очереди: на номер 220, затем 215, 203 ...
	// номер 215 только в событии DialBegin
	
	//++Newchannel 
	//CallerIDNum: 220            
	//Uniqueid: 1647587456.836
	//Linkedid: 1647587439.834
	//
	//
	//++DialBegin входящий звонок на менеджера (форма входящий звонок)
	//
	//ConnectedLineNum: 215    - внутренний номер менеджера
	//CallerIDNum: 89270480522 - номер абонента
	//
	//Uniqueid: 1647587439.834
	//Linkedid: 1647587439.834
	//
	//
	//++BridgeEnter (поднятие трубки, 2 события. реакция на второе)
	//++BridgeEnter 
	//CallerIDNum: 89270480522
	//ConnectedLineNum: 220
	//ConnectedLineName: 220
	//Uniqueid: 1647587439.834
	//Linkedid: 1647587439.834
	//
	//
	//
	//++Hangup (2 события)
	//CallerIDNum: 220
	//CallerIDName: 220
	//ConnectedLineNum: 89270480522
	//Uniqueid: 1647587456.836
	//Linkedid: 1647587439.834

	//копим историю звонков
	Если ВРег(ВидСобытия)="NEWCHANNEL" Тогда
		//1. Пришел звонок на наш внешний номер (группу номеров)
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВидСобытия;
		НоваяСтрока.Uniqueid  = ДанныеСобытия.Получить("Uniqueid");
		НоваяСтрока.Linkedid  = ДанныеСобытия.Получить("Linkedid");
		НоваяСтрока.Exten = ДанныеСобытия.Получить("Exten");
		//НоваяСтрока.ДанныеСобытия = ДанныеСобытия;
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");       // внутренний номер менеджера
		//НоваяСтрока.CallerIDName = ДанныеСобытия.Получить("CallerIDName");

	ИначеЕсли ВРег(ВидСобытия) = "DIALBEGIN" Тогда
		//2. АТС перебросила звонок на менеджера
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВРег(ВидСобытия);
		НоваяСтрока.Uniqueid  = ДанныеСобытия.Получить("DestUniqueid");
		НоваяСтрока.Linkedid  = ДанныеСобытия.Получить("DestLinkedid");
		НоваяСтрока.DestCallerIDNum = СокрЛП(ДанныеСобытия.Получить("DestCallerIDNum"));  // внутренний номер менеджера 
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerIDNum");  // номер клиента
		ВнешняяЛиния = ДанныеСобытия.Получить("DestExten");
		
		Если СокрЛП(НоваяСтрока.DestCallerIDNum) = СокрЛП(ВнутреннийНомер) Тогда			
			ДействияПриНачалеВходящегоЗвонка(НоваяСтрока.CallerID2, ВнешняяЛиния, ВнутреннийНомер, НоваяСтрока.Uniqueid, НоваяСтрока.Linkedid);			
		КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия) = "HANGUP" Тогда	
		
		//Разорвал канал - положили трубку или разговор окончен - закрываем окно входящего звонка
		//CallerIDNum = ДанныеСобытия.Получить("CallerIDNum");
		Uniqueid = ДанныеСобытия.Получить("Uniqueid");
		//ConnectedLineNum = ДанныеСобытия.Получить("ConnectedLineNum");
		//ConnectedLineNum = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ConnectedLineNum);
		//Channel = ДанныеСобытия.Получить("Channel");
		//
		//Если (СокрЛП(CallerIDNum) = СокрЛП(ВнутреннийНомер) Тогда
			ЗакрытьФормуВходящегоЗвонка(Uniqueid);
			ИсторияAsterisk.Очистить();
		//КонецЕсли;
		
	ИначеЕсли ВРег(ВидСобытия)="BRIDGEENTER" Тогда
		//3. Менеджер поднял трубку
		
		НоваяСтрока = ИсторияAsterisk.Добавить();
		НоваяСтрока.Event = ВидСобытия;
		НоваяСтрока.Uniqueid  = ДанныеСобытия.Получить("Uniqueid");
		НоваяСтрока.Linkedid  = ДанныеСобытия.Получить("Linkedid");
		НоваяСтрока.CallerID2 = ДанныеСобытия.Получить("CallerID1"); //номер группы		
		
		Отбор = Новый Структура;
		Отбор.Вставить("Uniqueid", 			ДанныеСобытия.Получить("Uniqueid"));
		Отбор.Вставить("Linkedid", 			ДанныеСобытия.Получить("Linkedid"));
		Отбор.Вставить("Event", 			"DIALBEGIN");
		Отбор.Вставить("DestCallerIDNum", 	СокрЛП(ВнутреннийНомер));
		
		НайденныеСтроки = ИсторияAsterisk.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
		//времИДсобытия = ПолучитьИдСобытияДоТочки(ДанныеСобытия.Получить("Uniqueid1"));
		//
		//Если СокрЛП(ДанныеСобытия.Получить("CallerID2")) = СокрЛП(ВнутреннийНомер) Тогда		
			НомерАбонента = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(НайденныеСтроки[0].CallerID2);
			ДействияПриПоднятииТрубки_Asterisk(НомерАбонента, НоваяСтрока.Uniqueid);
		//КонецЕсли; 
			ЗакрытьФормуВходящегоЗвонка(НоваяСтрока.Uniqueid);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаИсторияАТСAsteriskНаСервере(ДатаНачала, ДатаОкончания)
	
	МассивПараметров = Новый Массив;	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);	
	СтруктПараметры.Вставить("ДатаНачала", ДатаНачала);
	СтруктПараметры.Вставить("ДатаОкончания", ДатаОкончания);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", ТекущаяДатаСеанса());
	МассивПараметров.Добавить(СтруктПараметры);
	
	// сначала проверим завершилось ли предыдущее задание
	ТребуетсяЗапускЗадания = Истина;
	Если НЕ ПустаяСтрока(ИдентификаторФоновогоЗаданияИстории) И ИдентификаторФоновогоЗаданияИстории <> "00000000-0000-0000-0000-000000000000" Тогда
		НайденноеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ИдентификаторФоновогоЗаданияИстории));
		Если НЕ НайденноеЗадание = Неопределено Тогда
			Если НайденноеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				ТребуетсяЗапускЗадания = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТребуетсяЗапускЗадания Тогда
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("СофтФон.ОбработкаИсторииЗвонковАТС", МассивПараметров, , "Обработка истории звонков АТС");
		ИдентификаторФоновогоЗаданияИстории = Строка(ФоновоеЗадание.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры


/////////////////// ПРОЦЕДУРЫ Simplit ХЭШ /////////////////////////////

&НаКлиенте
Процедура ПодключитьПанель_SimplitХэш()
	
	ПанельSimplitРасчетХэш = Неопределено;
	ИмяМакетаБиблиотеки = "ROM_HMAC_ZIP";
	ИмяИсточникаСобытий = "OnPBXHMAC";
	
	Результат = Ложь;
	
	// попытка установить компоненту
	Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
	
	Если Не Результат Тогда
		// неудачно, возможно еще не устанавлена
		УстановитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки);
		Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
	КонецЕсли; 
	
	Если Результат Тогда
		Попытка
			ПанельSimplitРасчетХэш=Новый("AddIn.OnPBXHMAC.ROM_HMAC");
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки; 
	Иначе
		Сообщить("Не удалось установить компоненту для SimplitХэш");
	КонецЕсли; 

	
КонецПроцедуры

/////////////////// ПРОЦЕДУРЫ Simplit OnlinePBX /////////////////////////////

&НаКлиенте
Процедура ПодключитьПанель_OnlinePBX()
	
	ПанельRomHMac = Неопределено;
	//ИмяМакетаБиблиотеки = "ROMWebSocketZIP";
	ИмяМакетаБиблиотеки = "SIO_WS_ZIP";
	ИмяИсточникаСобытий = "OnPBX";
	
	Результат = Ложь;
	
	// попытка установить компоненту
	Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
	
	Если Не Результат Тогда
		// неудачно, возможно еще не устанавлена
		УстановитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки);
		Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
	КонецЕсли;
	
	Если Результат Тогда
		Попытка
			ПанельRomHMac=Новый("AddIn.OnPBX.SimplitIO-WS");
			ПанельRomHMac.ИсточникСобытия="OnPBX";
			ПанельRomHMac.РегулярноеВыражение=СофтФонКлиентСервер.Stringify("'service':'(simplit.io|onpbx|onpbx-rest)'");
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки; 
	Иначе
		Сообщить("Не удалось установить компоненту для OnlinePBX");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьПакетREST(ДанныеJSON,Путь,Метод="post",Маркер="")

	Результат="";
	
	Если ИспользуетсяSIOМегафон ИЛИ ИспользуетсяSIODomRu Тогда
		ИмяИсточника = ИДВАТС;
		// нет ключа 
		Если Не ЗначениеЗаполнено(КлючAPI) Тогда
			Возврат Результат;
		КонецЕсли; 
		
		// нет команды
		Если Не ЗначениеЗаполнено(ДанныеJSON) Тогда
			Возврат Результат;
		КонецЕсли; 
		
		//ДоменAPI = СофтФон.ПолучитьТелефонияАдресСервера();
		БазовыйПуть=ДоменAPI+"/sys/crm_api.wcgp";
		Если Не ЗначениеЗаполнено(Путь) Тогда
			Путь=БазовыйПуть;
		КонецЕсли;
		
		Данные="";
		Если НРег(Метод)="post" Тогда
			Данные=СофтФонКлиентСервер.JSON2URL(ДанныеJSON);
		ИначеЕсли НРег(Метод)="get" Тогда
			Путь=Путь+"?"+СофтФонКлиентСервер.JSON2URL(ДанныеJSON);
		КонецЕсли; 
		
		// формирование заголовков
		ContentType="application/x-www-form-urlencoded; charset=UTF-8;";
		ДанныеЗаголовка="'Accept': 'application/json', 'Content-Type': '"+ContentType+"'";
		
		Пакет=
		"{
		|'service': '"+НРег(ИмяИсточника)+"', 
		|'data': 
		|	{
		|		'url': '"+"https://"+Путь+"',
		|		'header': {"+ДанныеЗаголовка+"}, 
		|		'method': '"+ВРег(Метод)+"',";
		
		Если ЗначениеЗаполнено(Маркер) Тогда
			Пакет=Пакет+"
			|		'marker': '"+Маркер+"',";
		КонецЕсли; 
		
		Пакет=Пакет+"
		|		'data': '"+Данные+"' 
		|	}
		|}";
		
		Результат=СофтФонКлиентСервер.Stringify(Пакет);
				
	ИначеЕсли ИспользуетсяSIOUIS Тогда
		Схема="https://";
		ИмяИсточника = "uis";
		ВерсияAPI 	= "2.0";
		//ДоменAPI 	= СофтФон.ПолучитьТелефонияАдресСервера(); //"dataapi.uiscom.ru";
		//КлючAPI 	= СофтФон.ПолучитьПарольАдминистратораАТС();
		
		// нет ключа 
		Если Не ЗначениеЗаполнено(КлючAPI) Тогда 
			Возврат Результат;
		КонецЕсли; 
		
		// нет команды
		Если Не ЗначениеЗаполнено(ДанныеJSON) Тогда
			Возврат Результат;
		КонецЕсли; 
		
		БазовыйПуть=ДоменAPI+"/v"+ВерсияAPI;
		Если Не ЗначениеЗаполнено(Путь) Тогда
			Путь=БазовыйПуть;
		КонецЕсли;
		
		Данные=ДанныеJSON;
		
		// формирование заголовков
		ContentType="application/json; charset=UTF-8;";
		ДанныеЗаголовка="'Content-Type': '"+ContentType+"'";
		
		Пакет=
		"{
		|'service': '"+НРег(ИмяИсточника)+"', 
		|'data': 
		|	{
		|		'url': '"+Схема+Путь+"',
		|		'header': {"+ДанныеЗаголовка+"}, 
		|		'method': '"+ВРег(Метод)+"',";
		
		Если ЗначениеЗаполнено(Маркер) Тогда
			Пакет=Пакет+"
			|		'marker': '"+Маркер+"',";
		КонецЕсли; 
		
		Пакет=Пакет+"
		|		'data': "+Данные+"
		|	}
		|}";
		
		Результат=СофтФонКлиентСервер.Stringify(Пакет);
		
	ИначеЕсли ИспользуетсяSIOSipuni Тогда
		
		Если Не ЗначениеЗаполнено(Путь) Тогда
			Возврат Результат;
		КонецЕсли;
		
		ДанныеЗаголовка="'Content-Type': 'application/json'";
		
		url=Схема+АдресAPI+Путь;
		data=ДанныеJSON;
		Если НРег(Метод)="get" Тогда
			url=url+"?"+СофтФонКлиентСервер.JSON2URL(ДанныеJSON);
			data="''";
		ИначеЕсли НРег(Метод)="post" Тогда
			ДанныеЗаголовка="'Content-Type': 'application/x-www-form-urlencoded'";
			data="'"+СофтФонКлиентСервер.JSON2URL(ДанныеJSON)+"'";
		КонецЕсли; 
		
		Пакет=
		"{
		|'service': '"+НРег(ИДВАТС)+"', 
		|'data': 
		|	{
		|		'url': '"+url+"',
		|		'header': {"+ДанныеЗаголовка+"}, 
		|		'method': '"+ВРег(Метод)+"',";
		
		Если ЗначениеЗаполнено(Маркер) Тогда
			Пакет=Пакет+"
			|		'marker': '"+Маркер+"',";
		КонецЕсли; 
		
		Пакет=Пакет+"
		|		'data': "+data+" 
		|	}
		|}";
		
		Результат=СофтФонКлиентСервер.Stringify(Пакет);
		
	ИначеЕсли ИспользуетсяSIOBinotel Тогда
		
		// без ключа все команды запрещены
		Если Не ЗначениеЗаполнено(КлючAPI) ИЛИ Не ЗначениеЗаполнено(ПарольAPI) Тогда
			Возврат Результат;
		КонецЕсли; 
		
		// проверка корректности переданных параметров
		Если Не ЗначениеЗаполнено(Путь) Тогда
			Возврат Результат;
		КонецЕсли;
		
		СтрокаХеширования="[]";
		Если ЗначениеЗаполнено(ДанныеJSON) Тогда
			
			СтрокаХеширования=ДанныеJSON;
			ДанныеJSONСодержимое=СтрЗаменить(ДанныеJSON,"{","");
			ДанныеJSONСодержимое=СтрЗаменить(ДанныеJSONСодержимое,"}","");
			ДанныеJSONСодержимое=","+ДанныеJSONСодержимое;
			
		КонецЕсли; 
		
		// формирование и хеширование параметров
		ДанныеMD5=MD5(ПарольAPI+СофтФонКлиентСервер.Stringify(СтрокаХеширования));
		
		ДанныеТела="{'signature':'"+ДанныеMD5+"','key':'"+КлючAPI+"'"+ДанныеJSONСодержимое+"}";
		
		// добавление заголовков
		ДанныеЗаголовка="'Content-Length': '"+СтрДлина(СофтФонКлиентСервер.Stringify(ДанныеТела))+"', 'Content-Type': 'application/json'";
		
		Пакет=
		"{
		|'service': '"+НРег(ИДВАТС)+"', 
		|'data': 
		|	{
		|		'url': '"+Схема+ДоменAPI+ВерсияAPI+Путь+"',
		|		'header': {"+ДанныеЗаголовка+"}, 
		|		'method': '"+ВРег(Метод)+"',";
		
		Если ЗначениеЗаполнено(Маркер) Тогда
			Пакет=Пакет+"
			|		'marker': '"+Маркер+"',";
		КонецЕсли; 
		
		Пакет=Пакет+"
		|		'data': "+ДанныеТела+"
		|	}
		|}";
		
		Результат=СофтФонКлиентСервер.Stringify(Пакет);
		
	ИначеЕсли ИспользуетсяSIOMango Тогда
		
		Если Не ЗначениеЗаполнено(Путь) Тогда
			Возврат Результат;
		КонецЕсли;
		
		Подпись=ПодписатьПакет_Mango(СофтФонКлиентСервер.Stringify(ДанныеJSON));
		Данные="vpbx_api_key="+КлючAPI+"&sign="+Подпись+"&json="+КодироватьДанныеПакета(СофтФонКлиентСервер.Stringify(ДанныеJSON));
		
		ДанныеЗаголовка="";
		
		url=Схема+АдресAPI+Путь;
		data=Данные;
		Если НРег(Метод)="get" Тогда
			url=url+"?"+Данные;
			data="";
		ИначеЕсли НРег(Метод)="post" Тогда
			ДанныеЗаголовка=ДанныеЗаголовка+"'Content-Type': 'application/x-www-form-urlencoded'";
		КонецЕсли; 
		
		Пакет=
		"{
		|'service': 'mango', 
		|'data': 
		|	{
		|		'url': '"+url+"',
		|		'header': {"+ДанныеЗаголовка+"}, 
		|		'method': '"+ВРег(Метод)+"',";
		
		Если ЗначениеЗаполнено(Маркер) Тогда
			Пакет=Пакет+"
			|		'marker': '"+Маркер+"',";
		КонецЕсли; 
		
		Пакет=Пакет+"
		|		'data': '"+Данные+"' 
		|	}
		|}";
		
		Результат=СофтФонКлиентСервер.Stringify(Пакет);
		
	ИначеЕсли ИспользуетсяSIOPhonet Тогда
		
		Результат="";
		
		// проверка корректности переданных параметров
		Если Не ЗначениеЗаполнено(Путь) Тогда
			//Если Отладка Тогда
			//	Сообщить("Не указан путь REST-запроса");
			//КонецЕсли; 
			Возврат Результат;
		КонецЕсли;
		
		// без ключа все команды запрещены
		Если Не ЗначениеЗаполнено(КлючСессии) И Путь<>"/rest/security/authorize" Тогда
			//Если Отладка Тогда
			//	Сообщить("Отсутствует ключ сессии");
			//КонецЕсли; 
			Возврат Результат;
		КонецЕсли; 
		
		// формирование заголовков
		ДанныеЗаголовка="'Content-Type':'application/json'";
		Если ЗначениеЗаполнено(КлючСессии) Тогда
			ДанныеЗаголовка=ДанныеЗаголовка+",'Cookie':'"+КлючСессии+"'";
		КонецЕсли; 
		
		ДанныеТела="''";
		Если ЗначениеЗаполнено(ДанныеJSON) Тогда
			ДанныеТела=ДанныеJSON;
		КонецЕсли;
		
		Если НРег(Метод)="get" Тогда
			Если ЗначениеЗаполнено(ДанныеJSON) Тогда
				Путь=Путь+"?"+СофтФонКлиентСервер.JSON2URL(СофтФонКлиентСервер.Stringify(ДанныеJSON));
			КонецЕсли; 
		КонецЕсли; 
		
		Пакет=
		"{
		|'service': 'phonet', 
		|'data': 
		|	{
		|		'url': '"+Схема+ДоменAPI+Путь+"',
		|		'header': {"+ДанныеЗаголовка+"}, 
		|		'method': '"+ВРег(Метод)+"',";
		
		Если ЗначениеЗаполнено(Маркер) Тогда
			Пакет=Пакет+"
			|		'marker': '"+Маркер+"',";
		КонецЕсли; 
		
		Пакет=Пакет+"
		|		'data': "+ДанныеТела+"
		|	}
		|}";
		
		Результат=СофтФонКлиентСервер.Stringify(Пакет);
		
	ИначеЕсли ИспользуетсяROMHMAC Тогда
		
		Схема="https://";
		
		Если Не ЗначениеЗаполнено(Путь) Тогда 
			Возврат Результат;
		КонецЕсли;
		
		// без ключа все команды кроме auth запрещены
		Если Не ЗначениеЗаполнено(КлючСессии) И Путь<>"auth.json" Тогда 
			Возврат Результат;
		КонецЕсли; 
		
		БазовыйПуть="api2.onlinepbx.ru/"+АдресАТС+"/"; //2021-07-21 изменено на api2 с api 
		
		Данные=СофтФонКлиентСервер.JSON2URL(ДанныеJSON);
		
		// формирование заголовков
		ContentType="application/x-www-form-urlencoded; charset=UTF-8;";
		ДанныеЗаголовка="'Accept': 'application/json', 'Content-Type': '"+ContentType+"'";
		
		Если ЗначениеЗаполнено(КлючСессии) Тогда
			
			ДатаEET=Формат(ПолучитьДатуGMT(),"ДФ='yyyy-MM-dd ЧЧ:мм:сс'");
			ДанныеMD5=MD5(Данные);
			ЗаголовокURL=БазовыйПуть+Путь;
			
			//LF=Chars.LF;
			//СтрХеширования=ВРег(Метод)+LF+ДанныеMD5+LF+ContentType+LF+ДатаEET+LF+ЗаголовокURL+LF;
			
			//ПодписьHex=ПанельSimplitРасчетХэш.ХешСумма(КлючСессии,СтрХеширования);
			//КлючBase64=Base64ИзСтроки(ПодписьHex);
			
			//2021-07-21 изменено на КлючСессии с КлючBase64
			//ДанныеЗаголовка="'x-pbx-date': '"+ДатаEET+"', "+ДанныеЗаголовка+
			//", 'Content-MD5': '"+ДанныеMD5+"', 'x-pbx-authentication': '"+КлючИД+":"+КлючBase64+"'";  
			ДанныеЗаголовка="'x-pbx-date': '"+ДатаEET+"', "+ДанныеЗаголовка+
			", 'Content-MD5': '"+ДанныеMD5+"', 'x-pbx-authentication': '"+КлючИД+":"+КлючСессии+"'"; 
			
		КонецЕсли; 
		
		Пакет=
		"{
		|'service': 'onpbx-rest', 
		|'data': 
		|	{
		|		'url': '"+Схема+БазовыйПуть+Путь+"',
		|		'header': {"+ДанныеЗаголовка+"}, 
		|		'method': '"+ВРег(Метод)+"',";
		
		Если ЗначениеЗаполнено(Маркер) Тогда
			Пакет=Пакет+"
			|		'marker': '"+Маркер+"',";
		КонецЕсли; 
		
		Пакет=Пакет+"
		|		'data': '"+Данные+"' 
		|	}
		|}";
		
		Результат=СофтФонКлиентСервер.Stringify(Пакет);
		
	Иначе
		//
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция СформироватьПакетOnPBX(ДанныеJSON,Команда,Метод="command")

	// проверка корректности переданных параметров
	Результат="";
	Если Не ЗначениеЗаполнено(Команда) Тогда
		Сообщить("Не указана команда Realtime-запроса");
		Возврат Результат;
	КонецЕсли;
	
	Данные=СофтФонКлиентСервер.Stringify(ДанныеJSON);

	Пакет=
	"{
	|'service': 'onpbx', 
	|'data': 
	|	{
	|		'header': '"+Команда+"', 
	|		'method': '"+Метод+"', 
	|		'data': "+Данные+"
	|	}
	|}";
	
	Результат=СофтФонКлиентСервер.Stringify(Пакет);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ОтправитьЗапросНаПолучениеКлючаREST(ЗапроситьНовыйКлюч=Ложь)

	//КлючAPI = СофтФон.ПолучитьПарольАдминистратораАТС();
	
	СтрНовыйКлюч="";
	Если ЗапроситьНовыйКлюч Тогда
		СтрНовыйКлюч=",'new':true";
	КонецЕсли; 
	ДанныеJSON="{'auth_key': '"+КлючAPI+"'"+СтрНовыйКлюч+"}";
	
	Пакет=СформироватьПакетREST(ДанныеJSON,"auth.json");
	ПанельRomHMac.Отправить(Пакет);

КонецФункции

&НаКлиенте
Функция ПолучитьСписокОператоров_Onpbx()

	ДанныеJSON="''";
	Пакет=СформироватьПакетOnPBX(ДанныеJSON,"user_list");
	ПанельRomHMac.Отправить(Пакет);

КонецФункции
  
&НаКлиенте
Функция ПолучитьСписокОператоровREST_Onpbx()

	Путь="user/get.json";
	
	ДанныеJSON="''";
	Пакет=СформироватьПакетREST(ДанныеJSON,Путь);
	ПанельRomHMac.Отправить(Пакет);

КонецФункции

&НаКлиенте
Функция ОбработкаСобытийOnpbx(Событие,Данные)
			
	Если Событие="connect" Тогда
		
		//включаем подписки на события АТС
		ДанныеJSON=
		"{
		|'events':{
		|	'calls':true,
		|	'blf':true,
		|	'fax':true,
		|	'conference':true,
		|	'messages':true,
		|	'callback':true,
		|	'registration':true,
		|	'api':true}
		|}";
		Пакет=СформироватьПакетOnPBX(ДанныеJSON,"subscribe");
		ПанельRomHMac.Отправить(Пакет);
		
		ПолучитьСписокОператоров_Onpbx();
		ПолучитьСписокОператоровREST_Onpbx();
		
	ИначеЕсли Событие="error" Тогда
		
		Сообщить("Сервис: onpbx Ошибка: "+Данные);
		
	ИначеЕсли Событие="blf" Тогда
		//ОтобразитьСостояниеВнутреннегоНомера(Данные);
		
		// обработка в channel_bridge / channel_destroy

		
		// поднятие трубки
		//Если Не ТипЗнч(Данные)=Тип("Структура") Тогда
		//	Возврат Ложь;
		//КонецЕсли; 
		//
		//времИД = "";
		//времСтатус = "";
		//времНаправление = "";
		//времНомерАбонента = "";
		//времИДсобытия = "";
		//
		//Данные.Свойство("uid", 		 времИД);
		//Данные.Свойство("status",	 времСтатус);
		//Данные.Свойство("direction", времНаправление);
		//Данные.Свойство("other_leg", времНомерАбонента);
		//Данные.Свойство("uuid", 	 времИДсобытия);
		//
		//// бывают 2 ситуации в данном событии (событии blf,  "status":"answered")
		//// 1. uuid совпадает с uuid из события channel_create
		//// 2. uuid совпадает с aleg_uuid из события channel_create (в данном случае ИДСессииЗвонка = Неопределено)
		//ИДСессииЗвонка = "";
		//СтрТекущиеЗвонки=ПолучитьСтрокуИсторииOnlinePBX(времИДсобытия, Ложь);
		//Если НЕ СтрТекущиеЗвонки = Неопределено Тогда
		//	ИДСессииЗвонка = СтрТекущиеЗвонки.aleg_uuid;
		//КонецЕсли;
		//	
		//Если времИД = ВнутреннийНомер И времСтатус = "answered" и времНаправление = "in" и НЕ времНомерАбонента = "api" Тогда
		//	
		//	//входящий звонок на наш номер
		//	//подняли трубку
		//				
		//	ДействияПриПоднятииТрубки_OnlinePBX(времНомерАбонента, времИДсобытия, ИДСессииЗвонка);
		//	ЗакрытьФормуВходящегоЗвонка(времИДсобытия);
		//	ЗакрытьФормуВходящегоЗвонка(ИДСессииЗвонка);
		//	
		//ИначеЕсли времИД = ВнутреннийНомер И времСтатус = "answered" и времНаправление = "in" и времНомерАбонента = "api" Тогда
		//	
		//	//это каллбек, закроем форму
		//	ЗакрытьФормуВходящегоЗвонка(времИДсобытия);
		//	ЗакрытьФормуВходящегоЗвонка(ИДСессииЗвонка);
		//	
		//ИначеЕсли времИД = ВнутреннийНомер И времСтатус = "hangup"  и времНаправление = "in" Тогда
		//	
		//	//положили трубку
		//	//ЗакрытьФормуВходящегоЗвонка(времИДсобытия);
		//	//ЗакрытьФормуВходящегоЗвонка(ИДСессииЗвонка);

		//КонецЕсли;
				
	ИначеЕсли Событие="registration" Тогда
		//ОтобразитьСостояниеРегистрации(Данные);
		
	ИначеЕсли Событие="channel_create" Тогда		
		ОбработкаСозданияКанала_Onpbx(Данные);
		
	ИначеЕсли Событие="channel_answer" Тогда
		
		//ОтобразитьСостояниеВнутреннегоНомера(Данные);
		//ОтобразитьОтветКанала(Данные);
		//ОтобразитьСозданиеКанала(Данные);
				
	ИначеЕсли Событие="channel_bridge" Тогда
		ОбработкаСоединениеКанала_Onpbx(Данные);
		
	ИначеЕсли Событие="channel_destroy" Тогда
		ОбработкаЗакрытиеКанала_Onpbx(Данные);
		
	ИначеЕсли Событие="user_list" Тогда
		ОбработкаСписокОператоров_Onpbx(Данные);
		
	ИначеЕсли Событие="user_status" Тогда
		//ОтобразитьСтатусПользователя(Данные);
	КонецЕсли; 

КонецФункции

&НаКлиенте
Функция ОбработкаСозданияКанала_Onpbx(Данные)
	
	Если Не ТипЗнч(Данные)=Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	destination_number=""; ИД=""; aleg_uuid=""; gate=""; 
	//bleg_uuid="";
	Если Не Данные.Свойство("destination_number",destination_number) Тогда
		Возврат Ложь;
	КонецЕсли; 
	Если Не Данные.Свойство("uuid",ИД) Тогда
		Возврат Ложь;
	КонецЕсли;
	Данные.Свойство("gate", gate);
	
	СтрТекущиеЗвонки = ПолучитьСтрокуИсторииOnlinePBX(Новый Структура("uuid", ИД));
	
	//2020-12-25 Не перетираем данные родительской строки СтрТекущиеЗвонки, так как при наличии нескольких пользователей, звонок отображается только у одного пользователя
	
	Если Данные.Свойство("aleg_uuid", aleg_uuid) Тогда		
		
		СтрРодительскийЗвонок = ПолучитьСтрокуИсторииOnlinePBX(Новый Структура("uuid", aleg_uuid), Ложь);
		Если НЕ СтрРодительскийЗвонок = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрТекущиеЗвонки, СтрРодительскийЗвонок, "direction, caller_number, gate");	
		КонецЕсли;
		
		//bleg_uuid=ИД;
		ИД=aleg_uuid;
	Иначе		

		Данные.Свойство("direction",		СтрТекущиеЗвонки.direction);
		Данные.Свойство("caller_number",	СтрТекущиеЗвонки.caller_number);
		СтрТекущиеЗвонки.gate=gate;
	КонецЕсли;
	
	СтрТекущиеЗвонки.destination_number=destination_number;
	//Данные.Свойство("uuid",				СтрТекущиеЗвонки.uuid);
	//Данные.Свойство("direction",		СтрТекущиеЗвонки.direction);
	Данные.Свойство("created_stamp",	СтрТекущиеЗвонки.created_stamp);
	Данные.Свойство("state",			СтрТекущиеЗвонки.state);
	Данные.Свойство("endpoint",			СтрТекущиеЗвонки.endpoint);
	Данные.Свойство("domain",			СтрТекущиеЗвонки.domain);
	//Данные.Свойство("caller_number",	СтрТекущиеЗвонки.caller_number);
	Данные.Свойство("caller_name",		СтрТекущиеЗвонки.caller_name);
	Данные.Свойство("destination_host",	СтрТекущиеЗвонки.destination_host);
	Данные.Свойство("aleg_uuid",		СтрТекущиеЗвонки.aleg_uuid);
	
	Если Не ЗначениеЗаполнено(СтрТекущиеЗвонки.direction) Тогда
		Данные.Свойство("direction",	СтрТекущиеЗвонки.direction);
	КонецЕсли;
	//Если ЗначениеЗаполнено(gate) Тогда
	//	СтрТекущиеЗвонки.gate=gate;
	//Иначе
	//	//пытаемся найти гейт из таблицы текущих звонков
	//	ПараметрыОтбора=Новый Структура;
	//	ПараметрыОтбора.Вставить("aleg_uuid", ИД);
	//	МассивСтрок=ИсторияOnlinePBX.НайтиСтроки(ПараметрыОтбора);
	//	Для чНом = 0 По МассивСтрок.Количество()-1 Цикл
	//		Если НЕ ПустаяСтрока(МассивСтрок[чНом].gate) Тогда
	//			СтрТекущиеЗвонки.gate=МассивСтрок[чНом].gate;
	//		КонецЕсли;
	//	КонецЦикла
	//КонецЕсли;
	
	
	//Если ЗначениеЗаполнено(bleg_uuid) Тогда
	//	СтрТекущиеЗвонки.bleg_uuid=bleg_uuid;
	//КонецЕсли;
	
	СтрТекущиеЗвонки.internal=ЭтоВнутреннийЗвонок_Onpbx(СтрТекущиеЗвонки.caller_number,СтрТекущиеЗвонки.destination_number);
	Если СтрТекущиеЗвонки.internal Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если destination_number=ВнутреннийНомер 
		ИЛИ (СтрТекущиеЗвонки.endpoint = ЛогинТелефонии И НЕ ПустаяСтрока(ЛогинТелефонии)) //#7881
		Тогда
		// входящий
		ИДТекущегоЗвонка=ИД;
		Состояние="Вызов";
		НомерАбонента=СтрТекущиеЗвонки.caller_number;
		СтрТекущиеЗвонки.extension=ВнутреннийНомер;
		СтрТекущиеЗвонки.number=НомерАбонента;
		
		НаправлениеЗвонка="";
		Если ПользовательПринимаетВходящиеЗвонки() Тогда
			Если ЗначениеЗаполнено(СтрТекущиеЗвонки.direction) 
				И НЕ СтрТекущиеЗвонки.direction = "outbound" // не исходящий (callback) ++2020-10-20 
				Тогда
				НаправлениеЗвонка="Входящий";
				ВнешняяЛиния=СтрТекущиеЗвонки.gate;
				
				СтруктураНовойФормы = Новый Структура;
				СтруктураНовойФормы.Вставить("НомерАбонента",СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(НомерАбонента));
				СтруктураНовойФормы.Вставить("ВнешняяЛиния",ВнешняяЛиния);
				СтруктураНовойФормы.Вставить("НашВнутреннийНомер",ВнутреннийНомер);
				СтруктураНовойФормы.Вставить("ИДсобытия",СтрТекущиеЗвонки.uuid);
				СтруктураНовойФормы.Вставить("ИДСессииСобытия",СтрТекущиеЗвонки.aleg_uuid);
				ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок",СтруктураНовойФормы,,НомерАбонента,ВариантОткрытияОкна.ОтдельноеОкно,,,); //ТЕСТ!
				
			КонецЕсли; 
		КонецЕсли;
		СтрТекущиеЗвонки.incoming=1;
		
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаСоединениеКанала_Onpbx(Данные)

	Если Не ЗначениеЗаполнено(ИДТекущегоЗвонка) Тогда
		Возврат Ложь;
	КонецЕсли; 
	Если Не ТипЗнч(Данные)=Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	aleg_uuid=""; bleg_uuid=""; direction="";
	Данные.Свойство("aleg_uuid",aleg_uuid);
	Данные.Свойство("bleg_uuid",bleg_uuid);
	Данные.Свойство("direction",direction);	
	
	Если aleg_uuid=ИДТекущегоЗвонка ИЛИ bleg_uuid=ИДТекущегоЗвонка Тогда
		
		СтрЗвонок = ПолучитьСтрокуИсторииOnlinePBX(Новый Структура("uuid", bleg_uuid), Ложь);
		Если СтрЗвонок = Неопределено Тогда
			СтрЗвонок = ПолучитьСтрокуИсторииOnlinePBX(Новый Структура("uuid", aleg_uuid), Ложь);
			Если СтрЗвонок = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		//ПараметрыОтбора = Новый Структура;
		//ПараметрыОтбора.Вставить("aleg_uuid", aleg_uuid);
		//МассивСтрок=ИсторияOnlinePBX.НайтиСтроки(ПараметрыОтбора);
		//Если Не ЗначениеЗаполнено(МассивСтрок) Тогда
		//	ПараметрыОтбора.Вставить("aleg_uuid", bleg_uuid);
		//	МассивСтрок=ИсторияOnlinePBX.НайтиСтроки(ПараметрыОтбора);
		//	Если Не ЗначениеЗаполнено(МассивСтрок) Тогда
		//		Возврат Ложь;
		//	КонецЕсли;
		//КонецЕсли;
		
		//МассивСтрок[0].bleg_uuid=bleg_uuid;
		Если СтрЗвонок.extension = ВнутреннийНомер Тогда
			Если НЕ СтрЗвонок.internal                // не внутренний
				И НЕ СтрЗвонок.direction = "outbound" // не исходящий (callback) ++2020-10-20				
				Тогда
				Состояние="Разговор";
				ИД=aleg_uuid;
				//Если МассивСтрок[0].incoming=1 Тогда
				//	ВнешняяЛиния=ПолучитьЛинию(aleg_uuid);
				//Иначе
				//	ВнешняяЛиния=ПолучитьЛинию(bleg_uuid);
				//КонецЕсли;
				НомерАбонента=СтрЗвонок.caller_number;
				
				ДействияПриПоднятииТрубки_OnlinePBX(НомерАбонента, aleg_uuid, bleg_uuid);
				ЗакрытьФормуВходящегоЗвонка(bleg_uuid);
				ЗакрытьФормуВходящегоЗвонка(aleg_uuid);

			КонецЕсли; 
		Иначе
			ОбновитьСтатусВнутреннегоНомера_Onpbx(СтрЗвонок.destination_number,4,,Ложь);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Функция ОбработкаЗакрытиеКанала_Onpbx(Данные)

	Если Не ТипЗнч(Данные)=Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ИД="";
	Если Не Данные.Свойство("uuid",ИД) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрТекущиеЗвонки=ПолучитьСтрокуИсторииOnlinePBX(Новый Структура("uuid", ИД), Ложь);
	Если СтрТекущиеЗвонки=Неопределено Тогда
		
		// закрытие внешнего канала
		//Если ФлагСобытиеОткрыть Тогда
		//	Приемник=""; Данные.Свойство("destination_number",Приемник);
		//	Источник=""; Данные.Свойство("caller_number",Источник);
		//	
		//	Если ЭтоВнутреннийЗвонок(Источник,Приемник) Тогда
		//		Возврат Ложь;
		//	КонецЕсли; 
		//	
		//	Если Источник=ВнутреннийНомер ИЛИ Приемник=ВнутреннийНомер Тогда
		//		
		//		Направление=""; Данные.Свойство("direction",Направление);
		//		Если Направление="inbound" Тогда
		//			Если ИДЗвонка=ИД Тогда
		//				Данные.Вставить("destination_number",ВнутреннийНомер);
		//				Данные.Вставить("caller_number",НомерАбонента);
		//			КонецЕсли; 
		//		КонецЕсли; 
		//		ДокСобытие=ДействияПриЗавершенииЗвонка(Данные);
		//		
		//		Ответ=""; Данные.Свойство("hangup_cause",Ответ);
		//		Если Ответ="NORMAL_CLEARING" Тогда
		//			Если ЗначениеЗаполнено(ДокСобытие) Тогда
		//				ПоказатьЗначение(,ДокСобытие);
		//			КонецЕсли; 
		//		КонецЕсли; 
		//	КонецЕсли; 
		//КонецЕсли;
		
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрТекущиеЗвонки.extension=ВнутреннийНомер Тогда
		Если Не СтрТекущиеЗвонки.internal Тогда
			Состояние="Завершен";
			Если СтрТекущиеЗвонки.incoming=0 Тогда
				ИДТекущегоЗвонка="";
			КонецЕсли; 
			ЗакрытьФормуВходящегоЗвонка(Данные.uuid);
			ЗакрытьФормуВходящегоЗвонка(СтрТекущиеЗвонки.aleg_uuid);
		КонецЕсли; 
	Иначе
		ОбновитьСтатусВнутреннегоНомера_Onpbx(СтрТекущиеЗвонки.destination_number,1,,Ложь);
	КонецЕсли;
	
	УдалитьТекущийЗвонок = Ложь;
	СтрРодительскийЗвонок=ПолучитьСтрокуИсторииOnlinePBX(Новый Структура("uuid", СтрТекущиеЗвонки.aleg_uuid), Ложь);
	Если НЕ СтрРодительскийЗвонок = Неопределено Тогда
		УдалитьТекущийЗвонок = НЕ (СтрРодительскийЗвонок.uuid = СтрТекущиеЗвонки.uuid);
		ИсторияOnlinePBX.Удалить(СтрРодительскийЗвонок);	
	КонецЕсли;
	Если УдалитьТекущийЗвонок Тогда
		ИсторияOnlinePBX.Удалить(СтрТекущиеЗвонки);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаСписокОператоров_Onpbx(Данные)

	Если Не ТипЗнч(Данные)=Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Статус=Ложь;
	Данные.Свойство("status",Статус);
	Если Не Статус Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ДанныеМассив=""; 
	Данные.Свойство("data",ДанныеМассив);
	
	Если Не ТипЗнч(ДанныеМассив)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого ЭлементМассива Из ДанныеМассив Цикл
		ОбновитьСтатусВнутреннегоНомера_Onpbx(ЭлементМассива.uid,1,ЭлементМассива.name);
	КонецЦикла;
	ВнутренниеНомера_OnPbx.Сортировать("Статус Убыв, Номер Возр");
	//ЗаполнитьПользователей();
	
КонецФункции

&НаКлиенте
Функция ОбновитьСтатусВнутреннегоНомера_Onpbx(Номер,Статус,Имя="",ФлагНового=Истина)

	Если Номер=ВнутреннийНомер Тогда
		Если Не Статус=Неопределено Тогда
			СтатусТелефона=Статус;
		КонецЕсли; 
		Возврат Истина;
	КонецЕсли; 
	
	СтрВнутренниеНомера=Неопределено;
	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("Номер", Номер);
	МассивСтрок=ВнутренниеНомера_OnPbx.НайтиСтроки(ПараметрыОтбора);
	Если Не ЗначениеЗаполнено(МассивСтрок) Тогда
		Если ФлагНового Тогда
			СтрВнутренниеНомера=ВнутренниеНомера_OnPbx.Добавить();
			СтрВнутренниеНомера.Номер=Номер;
			СтрВнутренниеНомера.Имя=Номер;
		КонецЕсли; 
		
	Иначе
		СтрВнутренниеНомера=МассивСтрок[0];
	КонецЕсли;

	Если Не Статус=Неопределено Тогда
		Если Не СтрВнутренниеНомера=Неопределено Тогда
			СтрВнутренниеНомера.Статус=Статус;
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Функция ЭтоВнутреннийЗвонок_Onpbx(Источник, Приемник)

	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("Номер",Источник);
	МассивСтрок=ВнутренниеНомера_OnPbx.НайтиСтроки(ПараметрыОтбора);
	ВнутрИсточник=(МассивСтрок.Количество()>0 ИЛИ Источник=ВнутреннийНомер);
	
	ПараметрыОтбора.Вставить("Номер",Приемник);
	МассивСтрок=ВнутренниеНомера_OnPbx.НайтиСтроки(ПараметрыОтбора);
	ВнутрПриемник=(МассивСтрок.Количество()>0 ИЛИ Приемник=ВнутреннийНомер);
	
	Возврат (ВнутрИсточник И ВнутрПриемник);

КонецФункции

&НаКлиенте
Функция ОбработкаСобытийOnpbxREST(СобытиеПакета,ДанныеПакета,Маркер="")
	
	ДоменAPI = АдресАТС;
	Схема="https://";
	
	БазовыйПуть=Схема+"api2.onlinepbx.ru/"+ДоменAPI+"/"; //2021-07-21 изменено на api2 с api
	Событие=СтрЗаменить(СобытиеПакета,БазовыйПуть,"");
	
	ДанныеСобытия=Base64ВСтроку(ДанныеПакета);
	Данные=СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия);
			
	// json не прошел валидацию
	Если Данные=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Содержимое="";
	Комментарий="";
	Статус=0;
	
	Данные.Свойство("status",Статус);
	Данные.Свойство("comment",Комментарий);
	Данные.Свойство("data",Содержимое);
	
	// обработка ошибок
	Если Статус=0 Тогда
		// аутенфификация имеет свой обработчик ошибок
		Если Не Событие="auth.json" Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	Если Событие="auth.json" Тогда
		
		// обработка ошибок
		Если Статус=0 Тогда
			Если Не КлючЗапрашивался Тогда
				КлючЗапрашивался=Истина;
				ОтправитьЗапросНаПолучениеКлючаREST(Истина);
				Возврат Истина;
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли; 
			
		// получение ключа
		Попытка
			КлючСессии=Данные.data.key;
			КлючИД=Данные.data.key_id;
			//ПриПолученииКлюча();
		Исключение
			КлючСессии=""; КлючИД="";
		КонецПопытки; 
		
	ИначеЕсли Событие="history/search.json" ИЛИ Событие="mongo_history/search.json" Тогда
		
		// обработка ответа на запрос истории
		МассивСтрок=Содержимое;
		Если Не ЗначениеЗаполнено(МассивСтрок) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ТипЗнч(МассивСтрок)=Тип("Массив") Тогда
			Если ЗначениеЗаполнено(Маркер) Тогда
				//ОбработкаИсторияКлиента(МассивСтрок,Маркер);
			Иначе
				//ОбработкаИстория(МассивСтрок);
				ВерсияИстории = Лев(Событие, СтрДлина(Событие) - СтрДлина("/search.json")); 
				ОбработкаИсторияАТСOnPBX(МассивСтрок, , ТекущаяДата(), ВерсияИстории);
			КонецЕсли; 
		ИначеЕсли ТипЗнч(МассивСтрок)=Тип("Строка") Тогда
			ОбработкаФайлЗаписи_OnPbx(МассивСтрок, Маркер);
		КонецЕсли; 
		

	ИначеЕсли Событие="queues/list.json" Тогда
		
		// обработка ответа на запрос списка очередей
		Если Не ТипЗнч(Содержимое)=Тип("Структура") Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		Попытка
			МассивСтрок=Содержимое.queues;
		Исключение
			Возврат Ложь;
		КонецПопытки; 
		
		//ОбработкаОчереди(МассивСтрок);
		
	ИначеЕсли Событие="user/get.json" Тогда
		
		// обработка ответа на запрос списка пользователей
		Если Не ТипЗнч(Содержимое)=Тип("Массив") Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		МассивСтрок=Содержимое;
		
		Для каждого ЭлементМассива Из МассивСтрок Цикл
			//ОбновитьСтатусВнутреннегоНомера(ЭлементМассива,Неопределено,ЭлементМассива);
		КонецЦикла; 
		
		//ВнутренниеНомера.Сортировать("Статус Убыв, Номер Возр");
		//ЗаполнитьПользователей();
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуИсторииOnlinePBX(СтруктураПоиска, ФлагСоздания=Истина)

	Результат=Неопределено;
	
	//Если Не ЗначениеЗаполнено(ИД) Тогда
	//	Возврат Результат;
	//КонецЕсли; 
	
	//ПараметрыОтбора=Новый Структура;
	//ПараметрыОтбора.Вставить("uuid", ИД);
	МассивСтрок=ИсторияOnlinePBX.НайтиСтроки(СтруктураПоиска);
	Если Не ЗначениеЗаполнено(МассивСтрок) Тогда
		Если ФлагСоздания Тогда
			Результат=ИсторияOnlinePBX.Добавить();
			ЗаполнитьЗначенияСвойств(Результат, СтруктураПоиска);
			//Результат.uuid=ИД;
		КонецЕсли; 
	Иначе	
		Результат=МассивСтрок[0];
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработкаИсторияАТСOnPBXНаСервере(Данные, Маркер="", ДатаЗапросаИстории=Неопределено, ВерсияИстории)
	
	МассивПараметров = Новый Массив;
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС",				"OnlinePBX");
	СтруктПараметры.Вставить("ДатаЗапросаИстории",	ДатаЗапросаИстории);
	СтруктПараметры.Вставить("Данные", 				Данные);
	СтруктПараметры.Вставить("ВерсияИстории", 		ВерсияИстории);
	
	МассивПараметров.Добавить(СтруктПараметры);
	
	ФоновыеЗадания.Выполнить("СофтФон.ОбработкаИсторииЗвонковАТС", МассивПараметров, , "Обработка истории звонков АТС");
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаИсторияАТСOnPBX(Данные, Маркер="", ДатаЗапросаИстории=Неопределено, ВерсияИстории = "history")
	
	Если ВерсияИстории = "mongo_history" Тогда
		// на клиенте выполним получение времени из-за разницы в часовых поясах
		// на сервере может быть другой часовой пояс
		Для каждого СтрокаЗаписи из Данные Цикл
			СтрокаЗаписи.Вставить("ДатаНачалаЗвонка", СофтФонКлиент.ДатаИзUT(СтрокаЗаписи.start_stamp));	
		КонецЦикла;	
	КонецЕсли;
	
	ОбработкаИсторияАТСOnPBXНаСервере(Данные, Маркер, ДатаЗапросаИстории, ВерсияИстории);
	
КонецФункции

&НаКлиенте
Функция ОбработкаФайлЗаписи_OnPbx(СсылкаНаФайлЗаписи, Маркер="")

	ИД=""; Адрес="";
	Если ЗначениеЗаполнено(СсылкаНаФайлЗаписи) Тогда
		
		РазделительСхемы="://"; 
		ПозицияСхемы = Найти(СсылкаНаФайлЗаписи,РазделительСхемы);
		Если ПозицияСхемы = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		//Если РежимЗагрузкиЗаписиOnPbx Тогда
		//	СофтФонКлиент.ПолучитьФайлЗаписиПоHttpСсылке(СсылкаНаФайлЗаписи);
		//Иначе			
		//	Оповещение=Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтаФорма);
		//	НачатьЗапускПриложения(Оповещение, СсылкаНаФайлЗаписи);
		//КонецЕсли;
		ОбработатьПолучениеСсылкиФайлаЗаписиЗвонка(РежимЗагрузкиЗаписиOnPbx, СсылкаНаФайлЗаписи);
		
	КонецЕсли; 
	
КонецФункции
 
&НаКлиенте
Процедура ЗавершитьЗапускПриложения(КодВозврата, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры


/////////////////// ПРОЦЕДУРЫ Simplit ITooLabs (Megafon, Domru) /////////////////////////////
&НаКлиенте
Функция ПодключитьПанель_ITooLabs()
	
	ПанельRomHMac = Неопределено;
	ИмяМакетаБиблиотеки = "SIO_WS_ZIP";
	ИмяИсточникаСобытий = ИДВАТС; //"megafon";
	
	// попытка установить компоненту
	Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
	
	Если Не Результат Тогда
		
		// неудачно, возможно еще не устанавлена
		УстановитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки);
		Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
		
	КонецЕсли; 
	
	
	Если Результат Тогда
		ПанельRomHMac=Новый("AddIn."+ИмяИсточникаСобытий+".SimplitIO-WS");
		ПанельRomHMac.ИсточникСобытия=ИмяИсточникаСобытий;
		ПанельRomHMac.РегулярноеВыражение=СофтФонКлиентСервер.Stringify("'service':'(simplit.io|"+ИмяИсточникаСобытий+")'");
	КонецЕсли; 
	
	ПодключенКАТС=ПанельRomHMac.Подключено;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоОшибкаITooLabs(Значение)
	
	ФлагОшибки=Найти(Значение,"{""error"":")>0;
	Если Не ФлагОшибки Тогда
		ФлагОшибки=Найти(Значение,"</html>")>0;
	КонецЕсли; 
	
	Возврат ФлагОшибки;
	
КонецФункции

&НаКлиенте
Функция ЭтоОшибка(Значение)
	
	ФлагОшибки=Найти(Значение,"{""error"":")>0;
	Если Не ФлагОшибки Тогда
		ФлагОшибки=Найти(Значение,"</html>")>0;
	КонецЕсли; 
	
	Возврат ФлагОшибки;
	
КонецФункции

&НаКлиенте
Функция ОбработкаСписокОператоровITooLabs(Данные)
	
	Если Не ТипЗнч(Данные)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ВнутренниеНомера.Очистить();
	Для каждого ЭлементМассива Из Данные Цикл
		
		ВнутрНомер = Неопределено;
		ЭлементМассива.Свойство("ext", ВнутрНомер);
		Если ВнутрНомер=ВнутреннийНомер Тогда
			ЭлементМассива.Свойство("name",ВнутреннийЛогин_ITooLabs);
			Продолжить;
		КонецЕсли;
		
		СтрВнутренниеНомера=ВнутренниеНомера.Добавить();
		ЭлементМассива.Свойство("ext",СтрВнутренниеНомера.Номер);
		ЭлементМассива.Свойство("name",СтрВнутренниеНомера.Имя);
		СтрВнутренниеНомера.ВнутреннийЛогин=СтрВнутренниеНомера.Имя+"@"+ДоменAPI;
		
	КонецЦикла;
		
КонецФункции 

&НаСервере
Процедура ОбработкаИсторияАТСITooLabsНаСервере(Данные,Маркер="", ДатаЗапросаИстории=Неопределено)
	
	МассивПараметров = Новый Массив;
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории",ДатаЗапросаИстории);
	СтруктПараметры.Вставить("Данные",Данные);
	СтруктПараметры.Вставить("КоллекцияВнутрНомера", ПолучитьСоответствиеВнутреннихНомеровITooLabs());
	
	МассивПараметров.Добавить(СтруктПараметры);
	
	ФоновыеЗадания.Выполнить("СофтФон.ОбработкаИсторииЗвонковАТС", МассивПараметров, , "Обработка истории звонков АТС");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеВнутреннихНомеровITooLabs()

	КоллекцияВнутрНомера=Новый Соответствие;
	Для каждого Элемент Из ВнутренниеНомера Цикл
		КоллекцияВнутрНомера.Вставить(Элемент.ВнутреннийЛогин, Элемент.Номер);
	КонецЦикла; 
	
	Возврат КоллекцияВнутрНомера;

КонецФункции

&НаКлиенте
Функция ОбработкаИсторияАТСITooLabs(Данные,Маркер="", ДатаЗапросаИстории=Неопределено)
	
	ОбработкаИсторияАТСITooLabsНаСервере(Данные,Маркер, ДатаЗапросаИстории);
	
КонецФункции

&НаКлиенте
Функция ОбработкаСобытийITooLabs(СобытиеПакета,ДанныеПакета,Маркер="",ИДОтвета="")
	
	БазовыйПуть="https://"+ДоменAPI+"/sys/crm_api.wcgp";
	Событие=СтрЗаменить(СобытиеПакета,БазовыйПуть,"");
	
	ДанныеСобытия=Base64Раскодировать(ДанныеПакета);
	
	Если ЭтоОшибкаITooLabs(ДанныеСобытия) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если Маркер="history" ИЛИ Маркер="api.history.load" Тогда
		ОбработкаИсторияАТСITooLabs(ДанныеСобытия,Маркер);
		
	ИначеЕсли Маркер="makeCall" Тогда
		//Состояние="Вызов";
		
	ИначеЕсли Маркер="accounts" Тогда
	
		Данные=СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия);
		Если Данные=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		ОбработкаСписокОператоровITooLabs(Данные);
	
	Иначе
		
		Данные=СофтФонКлиентСервер.URL2JSON(ДанныеСобытия);
		Если ТипЗнч(Данные)=Тип("Структура") Тогда
				
			cmd=""; Данные.Свойство("cmd",cmd);
			Если НРег(cmd)="contact" Тогда
				
				Номер=""; Данные.Свойство("phone",Номер);
				//МаршрутизацияНаОтветственного(ИДОтвета,Номер);
				
			ИначеЕсли НРег(cmd)="event" Тогда
				
				КудаЗвонит =""; Данные.Свойство("ext",КудаЗвонит); //определяем что команда относится именно к нашему пользователю
				Если СокрЛП(КудаЗвонит) = СокрЛП(ВнутреннийНомер) Тогда
					
					type=""; Данные.Свойство("type",type);
					Если НРег(type)="incoming" Тогда
						//ОбработкаСозданиеКанала(Данные);
						
						
						ИДЗвонка=""; Данные.Свойство("callid",ИДЗвонка);
						НомерАбонента=""; Данные.Свойство("phone",НомерАбонента);
						
						Если ПользовательПринимаетВходящиеЗвонки() Тогда
							ВнешняяЛиния=""; Данные.Свойство("diversion",ВнешняяЛиния);
							
							СтруктураНовойФормы = Новый Структура;
							СтруктураНовойФормы.Вставить("НомерАбонента",СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(НомерАбонента));
							СтруктураНовойФормы.Вставить("ВнешняяЛиния",ВнешняяЛиния);
							СтруктураНовойФормы.Вставить("НашВнутреннийНомер",ВнутреннийНомер);
							СтруктураНовойФормы.Вставить("ИДсобытия",ИДЗвонка);
							ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок",СтруктураНовойФормы,,НомерАбонента,ВариантОткрытияОкна.ОтдельноеОкно,,,);
						КонецЕсли;
						
					ИначеЕсли НРег(type)="outgoing" Тогда
						//ОбработкаСозданиеКаналаИсходящий(Данные);
						
					ИначеЕсли НРег(type)="accepted" Тогда
						//ОбработкаОтветКанала(Данные);
						
					ИначеЕсли НРег(type)="completed" Тогда
						//ОбработкаЗакрытиеКанала(Данные);
						
					ИначеЕсли НРег(type)="cancelled" Тогда
						//ОбработкаОтменаКанала(Данные);
						
					КонецЕсли; 
				КонецЕсли; 
				
			ИначеЕсли НРег(cmd)="history" Тогда
				//ОбработкаСтрокаИстории(Данные);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	
КонецФункции

/////////////////// ПРОЦЕДУРЫ Simplit UIS /////////////////////////////

&НаКлиенте
Функция ПодключитьПанель_UIS()
	
	ПанельRomHMac = Неопределено;
	ИмяМакетаБиблиотеки = "SIO_WS_ZIP";
	ИмяИсточникаСобытий = "uis";
	
	// попытка установить компоненту
	Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
	
	Если Не Результат Тогда
		
		// неудачно, возможно еще не устанавлена
		УстановитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки);
		Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
		
	КонецЕсли; 
	
	
	Если Результат Тогда
		ПанельRomHMac=Новый("AddIn."+ИмяИсточникаСобытий+".SimplitIO-WS");
		ПанельRomHMac.ИсточникСобытия=ИмяИсточникаСобытий;
		ПанельRomHMac.РегулярноеВыражение=СофтФонКлиентСервер.Stringify("'service':'(simplit.io|"+ИмяИсточникаСобытий+")'");
	КонецЕсли; 
	
	ПодключенКАТС=ПанельRomHMac.Подключено;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокОператоров_UIS()

	ИмяМетода="get.employees";
	ДанныеJSON="{'jsonrpc':'2.0','id':'"+ИмяМетода+"','method':'"+ИмяМетода+"','params':{'access_token':'"+КлючAPI+"'}}";
	Пакет=СформироватьПакетREST(ДанныеJSON,,,ИмяМетода);
	ОтправитьПакетSimplitIO(Пакет);

КонецФункции

&НаКлиенте
Функция ПолучитьСписокSIP_UIS()

	ИмяМетода="get.sip_lines";
	ДанныеJSON="{'jsonrpc':'2.0','id':'"+ИмяМетода+"','method':'"+ИмяМетода+"','params':{'access_token':'"+КлючAPI+"'}}";
	Пакет=СформироватьПакетREST(ДанныеJSON,,,ИмяМетода);
	ОтправитьПакетSimplitIO(Пакет);

КонецФункции

&НаКлиенте
Функция ОбработкаСобытийUis(СобытиеПакета,ДанныеСобытия,Маркер="",ИДОтвета="")
	
	Данные = СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия, Истина);
	
	Если ЭтоОшибкаUIS(Данные) Тогда
		Возврат Ложь;
	КонецЕсли;		
	
	Если Маркер="history" ИЛИ Маркер="api.history.load" Тогда
		ОбработкаИсторияАТСUIS(Данные, Маркер);
		Возврат Истина;
	ИначеЕсли Маркер="get.employees" Тогда
	    ОбработкаСписокОператоровUIS(Данные);
		Возврат Истина;
	ИначеЕсли Маркер="get.sip_lines" Тогда
		ОбработкаСписокSIPUIS(Данные);
	КонецЕсли;
			
	Если ТипЗнч(Данные)=Тип("Соответствие") Тогда
		
		ВидСобытия = Данные.Получить("notification_mnemonic");
		
		Если НРег(ВидСобытия)="in_call_session" Тогда
			
			//ОбработкаСозданиеКанала(Данные);
			
		ИначеЕсли НРег(ВидСобытия)="out_call_session" Тогда
			
			//ОбработкаВызоваКанала(Данные);
			
		ИначеЕсли НРег(ВидСобытия)="call_proceeding" Тогда
			
			//входящий звонок
			КудаЗвонит = Данные.Получить("extension_phone_number");
			Если СокрЛП(КудаЗвонит) = СокрЛП(ВнутреннийНомер) И ПользовательПринимаетВходящиеЗвонки() Тогда
				ВнешняяЛиния = Данные.Получить("virtual_phone_number");
				ИДЗвонка = Данные.Получить("call_session_id");
				ИДЗвонка = СтрЗаменить(ИДЗвонка, Символ(160), "");
				НомерАбонента = Данные.Получить("calling_phone_number");
				
				СтруктураНовойФормы = Новый Структура;
				СтруктураНовойФормы.Вставить("НомерАбонента",СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(НомерАбонента));
				СтруктураНовойФормы.Вставить("ВнешняяЛиния",ВнешняяЛиния);
				СтруктураНовойФормы.Вставить("НашВнутреннийНомер",ВнутреннийНомер);
				СтруктураНовойФормы.Вставить("ИДсобытия",ИДЗвонка);
				ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок",СтруктураНовойФормы,,НомерАбонента,ВариантОткрытияОкна.ОтдельноеОкно,,,);
			КонецЕсли;

			
		ИначеЕсли НРег(ВидСобытия)="call_connected" Тогда
			
			//подняли трубку
			//ОбработкаОтветКанала(Данные);
			
		ИначеЕсли НРег(ВидСобытия)="talk_finished" Тогда
			
			//ОбработкаЗакрытиеКанала(Данные);
			
		ИначеЕсли НРег(ВидСобытия)="call_session_finished" Тогда
			
			//ОбработкаОкончанияЗвонка(Данные);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеВнутреннихНомеровUis()

	КоллекцияВнутрНомера=Новый Соответствие;
	КоллекцияВнутрНомера.Вставить(ВнутреннийИД_UIS, ВнутреннийНомер);
	Для каждого Элемент Из ВнутренниеНомера_UIS Цикл
		КоллекцияВнутрНомера.Вставить(Элемент.ИД,Элемент.Номер);
	КонецЦикла; 
	
	Возврат КоллекцияВнутрНомера;

КонецФункции

&НаКлиенте
Функция ОбработкаСписокОператоровUis(Данные)

	Результат = Данные.Получить("result");
	Если Результат=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	ДанныеКоллекция = Результат.Получить("data");
	Если ДанныеКоллекция = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ТипЗнч(ДанныеКоллекция)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ВнутренниеНомера_UIS.Очистить();
	Для каждого ЭлементМассива Из ДанныеКоллекция Цикл
		
		extension=ЭлементМассива.Получить("extension");
		Если extension=Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		ИД=Формат(ЭлементМассива.Получить("id"),"ЧГ=0");
		ВнутрНомер=extension.Получить("extension_phone_number");
		Если ВнутрНомер=ВнутреннийНомер Тогда
			ВнутреннийИД_UIS=ИД;
			Продолжить;
		КонецЕсли;
		Если НЕ ВнутрНомер = Неопределено Тогда
			СтрВнутренниеНомера=ВнутренниеНомера_UIS.Добавить();
			СтрВнутренниеНомера.ИД=ИД;
			СтрВнутренниеНомера.Номер=ВнутрНомер;
			СтрВнутренниеНомера.Имя=ЭлементМассива.Получить("full_name");
		КонецЕсли;
	КонецЦикла;
	
КонецФункции 

&НаКлиенте
Функция ОбработкаСписокSIPUIS(Данные)
	
	Результат = Данные.Получить("result");
	Если Результат=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	ДанныеКоллекция = Результат.Получить("data");
	Если ДанныеКоллекция = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ТипЗнч(ДанныеКоллекция)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Для каждого ЭлементМассива Из ДанныеКоллекция Цикл
		
		ИД=Формат(ЭлементМассива.Получить("employee_id"),"ЧГ=0");
		Статус=(ЭлементМассива.Получить("physical_state")="Зарегистрирован");
		
		Если ИД=ВнутреннийИД_UIS Тогда
			//СтатусТелефона=Статус;
			ВнутреннийВиртНомер_UIS=ЭлементМассива.Получить("virtual_phone_number");
			//ВнутреннийSIPНомер=ЭлементМассива.Получить("phone_number");
			Продолжить;
		КонецЕсли; 
		
		ПараметрыОтбора=Новый Структура;
		ПараметрыОтбора.Вставить("ИД",ИД);
		МассивСтрок=ВнутренниеНомера_UIS.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество()>0 Тогда
			МассивСтрок[0].Статус=Статус;
		КонецЕсли; 
		
	КонецЦикла;
	
	ВнутренниеНомера_UIS.Сортировать("Статус Убыв, Номер Возр");
	
КонецФункции 

&НаСервере
Процедура ОбработкаИсторияАТСUISНаСервере(Данные,Маркер="", ДатаЗапросаИстории=Неопределено)
	
	Результат = Данные.Получить("result");
	ДанныеКоллекция = Результат.Получить("data");
	
	МассивПараметров = Новый Массив;
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС","Uis");
	СтруктПараметры.Вставить("ДатаЗапросаИстории",ДатаЗапросаИстории);
	СтруктПараметры.Вставить("Данные", ДанныеКоллекция);
	СтруктПараметры.Вставить("КоллекцияВнутрНомера", ПолучитьСоответствиеВнутреннихНомеровUis());

	
	МассивПараметров.Добавить(СтруктПараметры);
	
	ФоновыеЗадания.Выполнить("СофтФон.ОбработкаИсторииЗвонковАТС", МассивПараметров, , "Обработка истории звонков АТС");
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаИсторияАТСUIS(Данные,Маркер="", ДатаЗапросаИстории=Неопределено)
	
	Результат = Данные.Получить("result");
	Если Результат=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	ДанныеКоллекция = Результат.Получить("data");
	Если ДанныеКоллекция = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбработкаИсторияАТСUISНаСервере(Данные, Маркер, ДатаЗапросаИстории);
	
КонецФункции

&НаКлиенте
Функция ЭтоОшибкаUIS(Значение)
	
	ТекущийТип=ТипЗнч(Значение);
	Если ТекущийТип=Тип("Строка") Тогда
		ФлагОшибки=Найти(Значение,"{""error"":")>0;
		Если Не ФлагОшибки Тогда
			ФлагОшибки=Найти(Значение,"</html>")>0;
		КонецЕсли; 
	ИначеЕсли ТекущийТип=Тип("Соответствие") Тогда
		ФлагОшибки=Не (Значение.Получить("error")=Неопределено);
	КонецЕсли; 
	
	Возврат ФлагОшибки;
	
КонецФункции

/////////////////// ПРОЦЕДУРЫ Simplit Sipuni /////////////////////////////

&НаКлиенте
Функция ПодключитьПанель_Sipuni()
	
	ПанельRomHMac = Неопределено;
	ИмяМакетаБиблиотеки = "SIO_WS_ZIP";
	ИмяИсточникаСобытий = "sipuni";
	
	// попытка установить компоненту
	Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
	
	Если Не Результат Тогда
		
		// неудачно, возможно еще не устанавлена
		УстановитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки);
		Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
		
	КонецЕсли; 
	
	
	Если Результат Тогда
		ПанельRomHMac=Новый("AddIn."+ИмяИсточникаСобытий+".SimplitIO-WS");
		ПанельRomHMac.ИсточникСобытия=ИмяИсточникаСобытий;
		//ПанельRomHMac.РегулярноеВыражение=СофтФонКлиентСервер.Stringify("'service':'(simplit.io|"+ИмяИсточникаСобытий+")'");
		ПанельRomHMac.РегулярноеВыражение=СофтФонКлиентСервер.Stringify("'service':'(simplit.io|"+НРег(ИмяИсточникаСобытий)+"|"+НРег(ИмяИсточникаСобытий)+"-wss)'");
	КонецЕсли; 
	
	ПодключенКАТС=ПанельRomHMac.Подключено;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СоединитьсяWSS()

	Если Не ЗначениеЗаполнено(КлючWSS) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеJSON="{'key':'"+КлючWSS+"'}";
	Пакет=СформироватьПакетWSS(ДанныеJSON,"connect");
 
	ПанельRomHMac.Отправить(Пакет);

КонецФункции

&НаКлиенте
Функция ПолучитьСписокОператоров_Sipuni()

	Если Не ЗначениеЗаполнено(НомерВАТС) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Хеш=MD5(НомерВАТС+"+"+КлючAPI);
	ДанныеJSON="{'hash':'"+Хеш+"','user':'"+НомерВАТС+"'}";
	
	Пакет=СформироватьПакетREST(ДанныеJSON,"/states","post");
	
	ПанельRomHMac.Отправить(Пакет);

КонецФункции

&НаКлиенте
Функция ОбработкаСобытийSipuni(Событие,Данные,Маркер="",ИДОтвета="", Сервис)

	Если Сервис="sipuni" Тогда
		
		//обработка событий REST API
		Если Найти(Событие,"://api.simplit.io/"+ЛогинSimplit+"/sipuni")>0 Тогда
		
			// webhooks
			ОбработкаСобытийWebhooks(Событие,Данные,ИДОтвета);
		
		ИначеЕсли Найти(Событие,Схема+АдресAPI)>0 Тогда
			
			// ответы API Sipuni на команды пользователя
			// все ответы приходят в формате JSON, за исключением статистики - она приходит в формате CSV
			
			Если Событие=Схема+АдресAPI+"/statistic/export" Тогда
				ДанныеПакета=Base64Раскодировать(Данные);
				ОбработкаИсторияАТСSipuni(ДанныеПакета,Маркер);
			Иначе
				// ОбработкаОтветаНаКоманду и ОбработкаВнутренниеНомера
				//ОбработкаСобытийREST(Событие,Данные,Маркер);
			КонецЕсли; 
			
		Иначе
			
			// неизвестно
			//Если Отладка Тогда
			//	ДанныеПакета=Base64Раскодировать(Данные);
			//	Сообщить(ДанныеПакета);
			//КонецЕсли; 
			
		КонецЕсли; 
		
	ИначеЕсли Сервис="sipuni-wss" Тогда
		ОбработкаСобытийWSS_Sipuni(Событие,Данные,Маркер);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбработкаИсторияАТСSipuniНаСервере(Данные, Маркер="")
		
	МассивПараметров = Новый Массив;
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", ТекущаяДатаСеанса());
	СтруктПараметры.Вставить("Данные", Данные);
	СтруктПараметры.Вставить("НомерВАТС", НомерВАТС);
	СтруктПараметры.Вставить("ДоменAPI", ДоменAPI);
	СтруктПараметры.Вставить("КлючAPI", КлючAPI);
		
	МассивПараметров.Добавить(СтруктПараметры);
	
	ФоновыеЗадания.Выполнить("СофтФон.ОбработкаИсторииЗвонковАТС", МассивПараметров, , "Обработка истории звонков АТС");
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаИсторияАТСSipuni(Данные, Маркер="")

	Если ЭтоОшибкаSipuni(Данные) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбработкаИсторияАТСSipuniНаСервере(Данные, Маркер);
	
КонецФункции

&НаКлиенте
Функция ЭтоОшибкаSipuni(Данные)

	Результат=Ложь;
	
	Если ТипЗнч(Данные)=Тип("Строка") Тогда
	
		Если Найти(НРег(Данные),"</html>")>0 Тогда
			Результат=Ложь;
		КонецЕсли; 
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ОбработкаСобытийWSS_Sipuni(Событие,ДанныеПакета,ИД)

	ДанныеСобытия=Base64Раскодировать(ДанныеПакета);
	Данные=СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия,Истина);

	// json не прошел валидацию
	Если Данные=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ТипЗнч(Данные)=Тип("Соответствие") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Событие="auth" Тогда
		
		Если Данные.Получить("action")="auth" Тогда
			ФлагAPI=(Данные.Получить("status")=1);
		КонецЕсли; 
		
	ИначеЕсли Событие="message" Тогда
		
		Если Данные.Получить("action")="notify" Тогда
			ДанныеЗапроса=Данные.Получить("request");
			Если ТипЗнч(ДанныеЗапроса)=Тип("Соответствие") Тогда
			
				ТипСобытия=ДанныеЗапроса.Получить("event");
				
				Если ТипСобытия=1 Тогда
				
					ОбработкаНачалаЗвонка_Sipuni(ДанныеЗапроса, ИД);
					
				ИначеЕсли ТипСобытия=2 Тогда
			
					ОбработкаЗавершенияЗвонка_Sipuni(ДанныеЗапроса);
					
				ИначеЕсли ТипСобытия=3 Тогда
				
					ОбработкаСоединенияЗвонка_Sipuni(ДанныеЗапроса);
					
				ИначеЕсли ТипСобытия=4 Тогда
				
					ОбработкаЗавершенияЗвонкаПромежуточное_Sipuni(ДанныеЗапроса);
					
				КонецЕсли; 
				
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаНачалаЗвонка_Sipuni(Данные,ИДОтвета)

	ИД=Данные.Получить("call_id");
	Если ИД=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
		
	СтрТекущиеЗвонки=ПолучитьСтрокуТекущегоЗвонка_Sipuni(ИД);
	ЗаполнитьДанныеТекущиеЗвонки_Sipuni(СтрТекущиеЗвонки,Данные);
	ЗаполнитьЛинию_Sipuni(СтрТекущиеЗвонки);
	
	ЭтоВходящий=ЭтоВходящий_Sipuni(СтрТекущиеЗвонки);
	Номер=СтрТекущиеЗвонки.src_num;
	ВнутрНомер=СтрТекущиеЗвонки.short_dst_num;
	ЭтоВнутренний=ЭтоВнутренний_Sipuni(СтрТекущиеЗвонки);
	Если ЭтоВнутренний Тогда
		Номер=СтрТекущиеЗвонки.short_src_num;
	КонецЕсли; 
	Если Не ЭтоВходящий Тогда
		ВнутрНомер=СтрТекущиеЗвонки.short_src_num;
		Номер=СтрТекущиеЗвонки.dst_num;
		Если ЭтоВнутренний Тогда
			Номер=СтрТекущиеЗвонки.short_dst_num;
		КонецЕсли; 
	КонецЕсли; 
	
	// действия по отслеживаемому внутреннему номеру
	Если ВнутрНомер=ВнутреннийНомер Тогда
		ИДТекущегоЗвонка=ИД;
		НаправлениеЗвонка="Исходящий";
		Если ЭтоВходящий Тогда
			НаправлениеЗвонка="Входящий";			
			Если ПользовательПринимаетВходящиеЗвонки() Тогда
				СтруктураНовойФормы = Новый Структура;
				СтруктураНовойФормы.Вставить("НомерАбонента", СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(Номер));
				СтруктураНовойФормы.Вставить("ВнешняяЛиния", СтрТекущиеЗвонки.Линия);
				СтруктураНовойФормы.Вставить("НашВнутреннийНомер", ВнутреннийНомер);
				СтруктураНовойФормы.Вставить("ИДСобытия", ИДТекущегоЗвонка);
				ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок", СтруктураНовойФормы, , Номер, ВариантОткрытияОкна.ОтдельноеОкно,,,);
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция ОбработкаЗавершенияЗвонка_Sipuni(Данные)

	ИД=Данные.Получить("call_id");
	Если ИД=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрТекущиеЗвонки=ПолучитьСтрокуТекущегоЗвонка_Sipuni(ИД);
	ЗаполнитьДанныеТекущиеЗвонки_Sipuni(СтрТекущиеЗвонки,Данные);
	
	ЭтоВходящий=ЭтоВходящий_Sipuni(СтрТекущиеЗвонки);
	Номер=СтрТекущиеЗвонки.src_num;
	ВнутрНомер=СтрТекущиеЗвонки.short_dst_num;
	ЭтоВнутренний=ЭтоВнутренний_Sipuni(СтрТекущиеЗвонки);
	Если ЭтоВнутренний Тогда
		Номер=СтрТекущиеЗвонки.short_src_num;
	КонецЕсли; 
	Если Не ЭтоВходящий Тогда
		ВнутрНомер=СтрТекущиеЗвонки.short_src_num;
		Номер=СтрТекущиеЗвонки.dst_num;
		Если ЭтоВнутренний Тогда
			Номер=СтрТекущиеЗвонки.short_dst_num;
		КонецЕсли; 
	КонецЕсли; 
	
	// действия по отслеживаемому внутреннему номеру
	Если ВнутрНомер=ВнутреннийНомер ИЛИ ИДТекущегоЗвонка=ИД Тогда	 
		ЗакрытьФормуВходящегоЗвонка(ИДТекущегоЗвонка);	
	КонецЕсли;
		
	ТекущиеЗвонки_Sipuni.Удалить(СтрТекущиеЗвонки);
	
КонецФункции

&НаКлиенте
Функция ОбработкаСоединенияЗвонка_Sipuni(Данные)

	ИД=Данные.Получить("call_id");
	Если ИД=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрТекущиеЗвонки=ПолучитьСтрокуТекущегоЗвонка_Sipuni(ИД);
	ЗаполнитьДанныеТекущиеЗвонки_Sipuni(СтрТекущиеЗвонки,Данные);
	
	ЭтоВходящий=ЭтоВходящий_Sipuni(СтрТекущиеЗвонки);
	Номер=СтрТекущиеЗвонки.src_num;
	ВнутрНомер=СтрТекущиеЗвонки.short_dst_num;
	ЭтоВнутренний=ЭтоВнутренний_Sipuni(СтрТекущиеЗвонки);
	Если ЭтоВнутренний Тогда
		Номер=СтрТекущиеЗвонки.short_src_num;
	КонецЕсли; 
	Если Не ЭтоВходящий Тогда
		ВнутрНомер=СтрТекущиеЗвонки.short_src_num;
		Номер=СтрТекущиеЗвонки.dst_num;
		Если ЭтоВнутренний Тогда
			Номер=СтрТекущиеЗвонки.short_dst_num;
		КонецЕсли; 
	КонецЕсли; 
	
	// действия по отлеживаемому внутреннему номеру
	Если ВнутрНомер=ВнутреннийНомер Тогда
		
		//ИДТекущегоЗвонка=ИД;
		
		НаправлениеЗвонка="Исходящий";
		Если ЭтоВходящий Тогда
			НаправлениеЗвонка="Входящий";
			ДействияПриПоднятииТрубки_Sipuni(Номер, ИДТекущегоЗвонка);
		КонецЕсли; 
		ЗакрытьФормуВходящегоЗвонка(ИДТекущегоЗвонка);
	
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция ОбработкаЗавершенияЗвонкаПромежуточное_Sipuni(Данные)
	// здесь можно ничего не делать
	// будет сгенерировано ОбработкаЗавершенияЗвонка_Sipuni
		
КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуТекущегоЗвонка_Sipuni(ИД, Создавать=Истина)

	Результат = Неопределено;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("call_id", ИД);
	МассивСтрок = ТекущиеЗвонки_Sipuni.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество()=0 Тогда
		Если Создавать Тогда
			Результат = ТекущиеЗвонки_Sipuni.Добавить();
			Результат.call_id=ИД;
		КонецЕсли;
	Иначе
		Результат=МассивСтрок[0];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ЗаполнитьДанныеТекущиеЗвонки_Sipuni(СтрТекущиеЗвонки, Данные)

	Для каждого Элемент Из Данные Цикл
	
		ИДПоля=Элемент.Ключ;
		ЗначениеПоля=Элемент.Значение;
	
		Если Не ЗначениеПоля=Неопределено Тогда
			Если СтрТекущиеЗвонки.Свойство(ИДПоля) Тогда
				СтрТекущиеЗвонки[ИДПоля]=ЗначениеПоля;
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьЛинию_Sipuni(СтрТекущиеЗвонки)

	Если СтрТекущиеЗвонки.dst_type=1 И СтрТекущиеЗвонки.src_type=1 Тогда // оба номера внешние
		Если СтрТекущиеЗвонки.is_inner_call Тогда //НРег(СтрТекущиеЗвонки.treeName)="входящая" Тогда  // имя задается в настройках личного кабинета и может отличаться от "входящая"
			СтрТекущиеЗвонки.Линия = СтрТекущиеЗвонки.dst_num;
		КонецЕсли; 
	КонецЕсли; 
	
	//++ 2019-11-19
	Если СтрТекущиеЗвонки.dst_type=2 И СтрТекущиеЗвонки.src_type=1 Тогда // dst - внутренний,  src - внешний
		Если СтрТекущиеЗвонки.is_inner_call Тогда 
			СтрТекущиеЗвонки.Линия = СтрТекущиеЗвонки.treeName; // treeName - имя линии 
		КонецЕсли; 
	КонецЕсли;
	//-- 2019-11-19
	
КонецФункции

&НаКлиенте
Функция ЭтоВходящий_Sipuni(СтрТекущиеЗвонки)

	Результат=(СтрТекущиеЗвонки.src_type=1);
	Если СтрТекущиеЗвонки.src_type=СтрТекущиеЗвонки.dst_type Тогда
		Если СтрТекущиеЗвонки.src_type=1 Тогда
			// оба номера - внешние
			Результат = СтрТекущиеЗвонки.is_inner_call;//(НРег(СтрТекущиеЗвонки.treeName)="входящая"); нельзя проверять по имени транка, имя задается вличном кабинете и может отличаться
		Иначе
			// оба номера - внутрение
			Результат=Истина;
			Если СтрТекущиеЗвонки.short_src_num=ВнутреннийНомер Тогда
				Результат=Ложь;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
 
&НаКлиенте
Функция ЭтоВнутренний_Sipuni(СтрТекущиеЗвонки)

	Результат=(СтрТекущиеЗвонки.src_type=СтрТекущиеЗвонки.dst_type И СтрТекущиеЗвонки.src_type=2);
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СортироватьПоляПакета_Sipuni(JSONПакет)
	
	Возврат СофтФонСервер.СортироватьПоляПакета_Sipuni(JSONПакет);
	
КонецФункции
 	
&НаСервере
Функция ПодписатьПакет_Sipuni(JSONПакет)
	
	Возврат СофтФонСервер.ПодписатьПакет_Sipuni(JSONПакет, КлючAPI);
	
КонецФункции

/////////////////// ПРОЦЕДУРЫ Simplit Binotel /////////////////////////////
&НаКлиенте
Функция ПолучитьСписокОператоров_Binotel()

	Путь="/settings/list-of-employees.json";
	
	ДанныеJSON="";             
	Пакет=СформироватьПакетREST(ДанныеJSON,Путь);
	ОтправитьПакетSimplitIO(Пакет);

КонецФункции

&НаКлиенте
Функция ПолучитьСписокРингГрупп_Binotel()

	Путь="/settings/list-of-ring-groups.json";
	
	ДанныеJSON="";
	Пакет=СформироватьПакетREST(ДанныеJSON,Путь);
	ОтправитьПакетSimplitIO(Пакет);

КонецФункции

&НаКлиенте
Процедура ИнициализироватьИнфоОшибок_Binotel()

	// инициализация информации об ошибках
	ИнфоОшибок = Новый Соответствие;
	Для Индекс = 1 По 10 Цикл
		ИнфоОшибок.Вставить("Requests are too frequent. You can do this request after "+Индекс+" sec.","Слишком частые запросы. Повторите запрос через "+Индекс+" секунд.");
	КонецЦикла; 
	ИнфоОшибок.Вставить("Can't call to the ext",	"Ошибка вызова внутреннего номера");
	ИнфоОшибок.Вставить("Wrong data",				"Ошибка получения данных");
	ИнфоОшибок.Вставить("Access Denied",			"Доступ запрещен");
	
	//http://developers.binotel.ua/
	//102	No such method
	//103	Not enough data
	//104	Wrong data
	//105	Something went wrong
	//106	Requests are too frequent
	//120	Your company is disabled
	//121	Your key or secret is wrong
	//150	Can't call to the ext
	//151	Can't call to the external number

КонецПроцедуры

&НаКлиенте
Функция ОбработкаСобытийBinotel(Событие, Данные, Маркер="", ИДОтвета="")
	
	// события API Binotel
	ПутьВходящихОповещенийHTTP  = "http://api.simplit.io/"+ЛогинSimplit+"/binotel";
	ПутьВходящихОповещенийHTTPS = "https://api.simplit.io/"+ЛогинSimplit+"/binotel";
	
	Если Событие = ПутьВходящихОповещенийHTTP ИЛИ Событие = ПутьВходящихОповещенийHTTPS Тогда
		ОбработкаСобытийPush_Binotel(Данные, ИДОтвета);
	Иначе
		ОбработкаСобытийREST_Binotel(Событие, Данные, Маркер);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаСобытийPush_Binotel(ДанныеПакета, ИДОтвета="")
	
	ДанныеСобытия=Base64Раскодировать(ДанныеПакета);
	
	//Если Отладка Тогда
	//	Сообщить(ДанныеСобытия);
	//КонецЕсли;
	
	Если Найти(ДанныеСобытия,"requestType=apiCallCompleted&")>0 Тогда
		//ОбработкаСобытийCallCompleted(ДанныеСобытия);
		Возврат Ложь;
	КонецЕсли; 
	
	Данные=СофтФонКлиентСервер.URL2JSON(ДанныеСобытия,Истина);
		
	// json не прошел валидацию
	Если Данные=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ТипЗнч(Данные)=Тип("Соответствие") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Статус=Данные.Получить("status");
	
	// обработка ошибок
	Если Статус="error" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ФлагAPI=Истина;
	Событие=Данные.Получить("requestType");
	
	Если Событие="receivedTheCall" Тогда
		
		ОбработкаСозданияКанала_Binotel(Данные);
		
	ИначеЕсли Событие="answeredTheCall" Тогда
		
		ОбработкаОтветаНаЗвонок_Binotel(Данные);
		
	ИначеЕсли Событие="transferredTheCall" Тогда
		
		ОбработкаПереводаЗвонка_Binotel(Данные);
		
	ИначеЕсли Событие="hangupTheCall" Тогда
		
		ОбработкаЗавершенияЗвонка_Binotel(Данные);
		
	ИначеЕсли Событие="gettingCallSettings" Тогда
		
		//ОбработкаПолученияСвойствЗвонка(Данные,ИДОтвета);
		
	КонецЕсли; 
	
КонецФункции
 
&НаКлиенте
Функция ОбработкаСобытийREST_Binotel(СобытиеПакета, ДанныеПакета, Маркер="")
	
	ДанныеСобытия=Base64Раскодировать(ДанныеПакета);
	
	//Если Отладка Тогда
	//	Сообщить(ДанныеСобытия);
	//КонецЕсли;
	
	Данные = СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия,Истина);
		
	// json не прошел валидацию
	Если Данные=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Событие=СтрЗаменить(СобытиеПакета, Схема+ДоменAPI+ВерсияAPI, "");
	
	Статус="";
	
	Если Не ТипЗнч(Данные)=Тип("Соответствие") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Статус=Данные.Получить("status");
	
	// обработка ошибок
	Если Статус="error" Тогда
		ТекстОшибки=ИнфоОшибок.Получить(Данные.Получить("message"));
		Если ТекстОшибки=Неопределено Тогда
			ТекстОшибки=Данные.Получить("message");
		КонецЕсли; 
		ПоказатьОповещениеПользователя("Ошибка",,ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	ФлагAPI=Истина;
	
	Если Событие="/settings/list-of-employees.json" Тогда
		
		// список внутренних номеров
		ОбработкаВнутренниеНомера_Binotel(Данные);
		
	ИначеЕсли Событие="/settings/list-of-ring-groups.json" Тогда
		
		// список участников ринг-груп
		ОбработкаРингГруппы_Binotel(Данные);
		
	ИначеЕсли Найти(Событие,"/stats/call-record.json")>0 Тогда
		
		// ссылка на файл записи
		ОбработкаФайлЗаписи_Binotel(Данные,Маркер);
		
	ИначеЕсли Событие="/stats/list-of-calls-for-period.json" Тогда
		
		// история за день
		ОбработкаИсторияАТСBinotel(Данные);
		
	ИначеЕсли Найти(Событие,"/stats/")>0 Тогда
		
		// история звонков
		Если ЗначениеЗаполнено(Маркер) Тогда
			Если Маркер="background.history.binotel" Тогда
				ОбработкаИсторияАТСBinotel(Данные);
			КонецЕсли; 
		Иначе
			ОбработкаИсторияАТСBinotel(Данные);
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецФункции

&НаКлиенте
Функция ОбработкаСозданияКанала_Binotel(Данные)

	Попытка
				
		generalCallID=Данные.Получить("generalCallID");
		
		СтрТекущиеСобытия=ПолучитьСтрокуСобытия_Binotel(generalCallID);
		Если СтрТекущиеСобытия=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		СтрТекущиеСобытия.requestType=Данные.Получить("requestType");
		СтрТекущиеСобытия.callType=Данные.Получить("callType");
		СтрТекущиеСобытия.extNumber=Данные.Получить("extNumber");
		СтрТекущиеСобытия.externalNumber=Данные.Получить("externalNumber");
		СтрТекущиеСобытия.internalNumber=Данные.Получить("internalNumber");
		СтрТекущиеСобытия.companyID=Данные.Получить("companyID");
		СтрТекущиеСобытия.didNumber=Данные.Получить("didNumber");
		Если Не ЗначениеЗаполнено(СтрТекущиеСобытия.didNumber) Тогда
			СтрТекущиеСобытия.didNumber=Данные.Получить("did");
		КонецЕсли; 
	
		Если ЭтоСобытиеТекущегоВнутреннего_Binotel(СтрТекущиеСобытия) Тогда
			
			Если Не СуществуетТекущийРазговор_Binotel() Тогда // приходят несколько повторяющихся событий
			
				// звонок, принадлежащий этому оператору или звонок, 
				// который еще ни на кого не размещен отображается всем
				НомерАбонента=СтрТекущиеСобытия.externalNumber;
				Если СтрТекущиеСобытия.callType="0" Тогда
					
					НаправлениеЗвонка="Входящий";
					Линия=СтрТекущиеСобытия.didNumber;
					
				ИначеЕсли СтрТекущиеСобытия.callType="1" Тогда
					
					НаправлениеЗвонка="Исходящий";
					Линия="";
					
				КонецЕсли;
				
				//Состояние="Вызов";
				ИДТекущегоЗвонка=generalCallID;
				 
				Если НаправлениеЗвонка="Входящий" Тогда
					//ДействияПриНачалеВходящегоЗвонка(СтрТекущиеСобытия);
					ВнешняяЛиния = Линия;
					
					СтруктураНовойФормы = Новый Структура;
					СтруктураНовойФормы.Вставить("НомерАбонента",	СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(НомерАбонента));
					СтруктураНовойФормы.Вставить("ВнешняяЛиния",	ВнешняяЛиния);
					СтруктураНовойФормы.Вставить("НашВнутреннийНомер",ВнутреннийНомер);
					СтруктураНовойФормы.Вставить("ИДсобытия",		ИДТекущегоЗвонка);
					ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок",СтруктураНовойФормы,,НомерАбонента,ВариантОткрытияОкна.ОтдельноеОкно,,,);
					
				КонецЕсли; 
			
			КонецЕсли; 
			
		КонецЕсли;
		
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеСобытия.extNumber,"ringing");
		
	Исключение
	КонецПопытки; 
	
КонецФункции

&НаКлиенте
Функция ОбработкаОтветаНаЗвонок_Binotel(Данные)

	Попытка
				
		generalCallID=Данные.Получить("generalCallID");
		
		СтрТекущиеСобытия=ПолучитьСтрокуСобытия_Binotel(generalCallID);
		Если СтрТекущиеСобытия=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		// дополнение буфера новыми данными
		СтрТекущиеСобытия.callType=Данные.Получить("callType");
		СтрТекущиеСобытия.extNumber=Данные.Получить("extNumber");
		СтрТекущиеСобытия.didNumber=Данные.Получить("didNumber");
		Если Не ЗначениеЗаполнено(СтрТекущиеСобытия.didNumber) Тогда
			СтрТекущиеСобытия.didNumber=Данные.Получить("did");
		КонецЕсли; 
		СтрТекущиеСобытия.companyID=Данные.Получить("companyID");
		СтрТекущиеСобытия.externalNumber=Данные.Получить("externalNumber");
		СтрТекущиеСобытия.internalNumber=Данные.Получить("internalNumber");
		
		// звонок текущего оператора
		Если СтрТекущиеСобытия.extNumber=ВнутреннийНомер ИЛИ СтрТекущиеСобытия.internalNumber=ВнутреннийНомер Тогда
			Если СтрТекущиеСобытия.callType="0" Тогда
				
				//НаправлениеЗвонка="Входящий";
				Линия=СтрТекущиеСобытия.didNumber;
				НомерАбонента=СтрТекущиеСобытия.externalNumber;
				
			ИначеЕсли СтрТекущиеСобытия.callType="1" Тогда
				
				//НаправлениеЗвонка="Исходящий";
				Линия="";
				НомерАбонента=СтрТекущиеСобытия.externalNumber;
				
			КонецЕсли;
			
			//Состояние="Разговор";
			ИДТекущегоЗвонка=generalCallID;
			
			//ДействияПриПоднятииТрубки(СтрТекущиеСобытия);			
			Если СтрТекущиеСобытия.callType="0" И ПользовательПринимаетВходящиеЗвонки() Тогда
				ДействияПриПоднятииТрубки_Binotel(НомерАбонента, ИДТекущегоЗвонка);
			КонецЕсли; 
			ЗакрытьФормуВходящегоЗвонка(ИДТекущегоЗвонка);
			
		Иначе
			
			//Если Не СуществуетТекущийРазговор_Binotel() Тогда
			//	ОчиститьОтображениеЗвонка_Binotel(generalCallID);
			//КонецЕсли; 
			
		КонецЕсли;
		
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеСобытия.extNumber,"inuse");
		
	Исключение
		//Если Отладка Тогда
		//	Сообщить(ОписаниеОшибки());
		//КонецЕсли; 
	КонецПопытки; 
	
КонецФункции

&НаКлиенте
Функция ОбработкаПереводаЗвонка_Binotel(Данные)

	Попытка
				
		generalCallID=Данные.Получить("generalCallID");
		internalNumber=Данные.Получить("internalNumber");
		
		СтрТекущиеСобытия=ПолучитьСтрокуСобытия_Binotel(generalCallID);
		Если СтрТекущиеСобытия=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		СтрТекущиеСобытия.internalNumber=internalNumber;
		
		Если СтрТекущиеСобытия.extNumber=ВнутреннийНомер Тогда
			
			// исходящий перевод
			
			//Состояние="Переведен на номер: "+internalNumber;
			//ИДЗвонка="";
			НомерАбонента=СтрТекущиеСобытия.externalNumber;
			Если СтрТекущиеСобытия.callType="0" Тогда
				Линия=СтрТекущиеСобытия.didNumber;
			Иначе
				Линия="";
			КонецЕсли; 
			
		ИначеЕсли internalNumber=ВнутреннийНомер Тогда
			
			// входящий перевод
			
			//Состояние="Переведен с номера: "+СтрТекущиеСобытия.extNumber;
			//ИДЗвонка=generalCallID;
			НомерАбонента=СтрТекущиеСобытия.externalNumber;
			Если СтрТекущиеСобытия.callType="0" Тогда
				НаправлениеЗвонка="Входящий";
				Линия=СтрТекущиеСобытия.didNumber;
			Иначе
				НаправлениеЗвонка="Исходящий";
				Линия="";
			КонецЕсли; 
			
		КонецЕсли; 
		
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеСобытия.extNumber,"online");
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеСобытия.internalNumber,"ringing");
		
	Исключение
	КонецПопытки; 
	
КонецФункции
 
&НаКлиенте
Функция ОбработкаЗавершенияЗвонка_Binotel(Данные)

	Попытка
		
		generalCallID=Данные.Получить("generalCallID");
		
		СтрТекущиеСобытия=ПолучитьСтрокуСобытия_Binotel(generalCallID,Ложь);
		Если СтрТекущиеСобытия=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		Если СтрТекущиеСобытия.extNumber=ВнутреннийНомер ИЛИ СтрТекущиеСобытия.internalNumber=ВнутреннийНомер Тогда
			//Состояние="Завершен";
			ИДТекущегоЗвонка="";
			ЗакрытьФормуВходящегоЗвонка(generalCallID);
		Иначе
			//Если Не СуществуетТекущийРазговор() Тогда
			//	ОчиститьОтображениеЗвонка(generalCallID);
			//КонецЕсли; 
		КонецЕсли; 
		
		//Если ФлагПромежуточныеДанные Тогда
		//	
		//	disposition=Данные.Получить("disposition");
		//	billsec=Данные.Получить("billsec");
		//	
		//	ДанныеЗвонка=Новый Соответствие;
		//	ДанныеЗвонка.Вставить("generalCallID",СтрТекущиеСобытия.generalCallID);
		//	ДанныеЗвонка.Вставить("callType",СтрТекущиеСобытия.callType);
		//	ДанныеЗвонка.Вставить("externalNumber",СтрТекущиеСобытия.externalNumber);
		//	ДанныеЗвонка.Вставить("internalNumber",СтрТекущиеСобытия.internalNumber);
		//	ДанныеЗвонка.Вставить("did",СтрТекущиеСобытия.didNumber);
		//	ДанныеЗвонка.Вставить("trunkNumber",СтрТекущиеСобытия.didNumber);
		//	ДанныеЗвонка.Вставить("disposition",disposition);
		//	ДанныеЗвонка.Вставить("billsec",billsec);
		//	ДанныеЗвонка.Вставить("waitsec",billsec);
		//	ДанныеЗвонка.Вставить("startTime",UT(УниверсальноеВремя(ТекущаяДата()))-Число(billsec));
		//	
		//	ДобавитьПромежуточныеДанныеВИсторию(ДанныеЗвонка);
		//	
		//КонецЕсли; 
		
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеСобытия.extNumber,"online");
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеСобытия.internalNumber,"online");
		ТекущиеСобытия_Binotel.Удалить(СтрТекущиеСобытия);
		
	Исключение
	КонецПопытки; 

КонецФункции
 
&НаКлиенте
Функция ЭтоСобытиеТекущегоВнутреннего_Binotel(СтрТекущиеСобытия)

	Результат=Ложь;
	
	Если СтрТекущиеСобытия.extNumber=ВнутреннийНомер Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Если СтрТекущиеСобытия.internalNumber=ВнутреннийНомер Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(УчастникиГруппы) Тогда
		Результат=(Не УчастникиГруппы.Найти(СтрТекущиеСобытия.internalNumber+"_"+ВнутреннийНомер)=Неопределено);
	Иначе
		Результат=(Не ЭтоВнутреннийНомер_Binotel(СтрТекущиеСобытия.internalNumber));
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ЭтоВнутреннийНомер_Binotel(Номер)

	Если Не ЗначениеЗаполнено(Номер) Тогда
		Возврат Ложь;
	КонецЕсли; 
	Если Номер=ВнутреннийНомер Тогда
		Возврат Истина;
	КонецЕсли; 
	
	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("Номер", Номер);
	МассивСтрок = ВнутренниеНомера_Binotel.НайтиСтроки(ПараметрыОтбора);
	Если ЗначениеЗаполнено(МассивСтрок) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуСобытия_Binotel(ИД, ФлагСоздания=Истина)

	Результат=Неопределено;
	
	Если Не ЗначениеЗаполнено(ИД) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("generalCallID", ИД);
	МассивСтрок=ТекущиеСобытия_Binotel.НайтиСтроки(ПараметрыОтбора);
	Если Не ЗначениеЗаполнено(МассивСтрок) Тогда
		Если ФлагСоздания Тогда
			Результат=ТекущиеСобытия_Binotel.Добавить();
			Результат.generalCallID=ИД;
		КонецЕсли; 
	Иначе	
		Результат=МассивСтрок[0];
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбработкаВнутренниеНомера_Binotel(Данные)

	ВнутренниеНомера_Binotel.Очистить();
	
	КоллекцияСотрудники=Данные.Получить("listOfEmployees");
	Для каждого ЭлементСотрудник Из КоллекцияСотрудники Цикл
	
		ОбъектКлюч=ЭлементСотрудник.Ключ;
		ОбъектСотрудник=ЭлементСотрудник.Значение;
		
		Если ТипЗнч(ОбъектСотрудник)=Тип("Соответствие") Тогда
		
			extNumber=ОбъектСотрудник.Получить("extNumber");
			Если Не ЗначениеЗаполнено(extNumber) Тогда
				Продолжить;
			КонецЕсли;
			
			ОбъектСтатус=ОбъектСотрудник.Получить("extStatus");
			
			Если Не extNumber=ВнутреннийНомер Тогда
			
				СтрВнутренниеНомера = ВнутренниеНомера_Binotel.Добавить();
				СтрВнутренниеНомера.Имя=ОбъектСотрудник.Получить("name");
				СтрВнутренниеНомера.Номер=extNumber;
				СтрВнутренниеНомера.НомерSIP=ОбъектСотрудник.Получить("extHash");
				СтрВнутренниеНомера.Мобильный=ОбъектСотрудник.Получить("mobilePhoneNumber");
				СтрВнутренниеНомера.Присутствие=ОбъектСотрудник.Получить("presenceState");
				СтрВнутренниеНомера.Статус=ОбъектСтатус.Получить("status");
				//СтрВнутренниеНомера.ИндексСтатуса=ПолучитьИндексСтатуса(СтрВнутренниеНомера.Статус);
			
			Иначе
				//СтатусТелефона=(Не ОбъектСтатус.Получить("status")="offline");
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЦикла;
	
	ВнутренниеНомера_Binotel.Сортировать("ИндексСтатуса Убыв, Номер Возр");
	//ЗаполнитьПользователей();

КонецФункции

&НаКлиенте
Функция ОбработкаРингГруппы_Binotel(Данные)

	УчастникиГруппы=Новый Массив;
	
	КоллекцияГруппы=Данные.Получить("listOfRingGroups");
	Для каждого ЭлементГруппы Из КоллекцияГруппы Цикл
	
		ОбъектКлюч=ЭлементГруппы.Ключ;
		ОбъектГруппа=ЭлементГруппы.Значение;
		
		Если ТипЗнч(ОбъектГруппа)=Тип("Соответствие") Тогда
		
			НомерГруппы=ОбъектГруппа.Получить("number");
			Если Не ЗначениеЗаполнено(НомерГруппы) Тогда
				Продолжить;
			КонецЕсли;
			
			ЧленыГруппы=ОбъектГруппа.Получить("members");
			Если Не ТипЗнч(ЧленыГруппы)=Тип("Массив") Тогда
				Продолжить;
			КонецЕсли; 
			
			Для каждого УчастникГруппы Из ЧленыГруппы Цикл
				УчастникиГруппы.Добавить(НомерГруппы+"_"+УчастникГруппы);
			КонецЦикла; 
		
		КонецЕсли; 
	
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ОбработкаФайлЗаписи_Binotel(Данные, Маркер="")

	Успех=Данные.Получить("status");
	Если Не Успех="success" Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ФайлЗаписиСсылка=Данные.Получить("url");
	Если ЗначениеЗаполнено(ФайлЗаписиСсылка) Тогда				
		//Если РежимЗагрузкиЗаписиBinotel Тогда
		//	СофтФонКлиент.ПолучитьФайлЗаписиПоHttpСсылке(СсылкаНаФайлЗаписи);
		//Иначе			
		//	Оповещение=Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", СофтФонКлиент);
		//	НачатьЗапускПриложения(Оповещение, СсылкаНаФайлЗаписи);
		//КонецЕсли;
		ОбработатьПолучениеСсылкиФайлаЗаписиЗвонка(РежимЗагрузкиЗаписиBinotel, ФайлЗаписиСсылка);
	КонецЕсли;
	
КонецФункции
	
&НаКлиенте
Функция ОбработкаИсторияАТСBinotel(Данные)

	// входящие за период
	КоллекцияЗвонки=Данные.Получить("callDetails");
	Если КоллекцияЗвонки=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбработкаИсторияАТСBinotelНаСервере(КоллекцияЗвонки); 
	
КонецФункции

&НаСервере
Процедура ОбработкаИсторияАТСBinotelНаСервере(Данные)
		
	МассивПараметров = Новый Массив;
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", ТекущаяДатаСеанса());
	СтруктПараметры.Вставить("Данные", Данные);
	//СтруктПараметры.Вставить("НомерВАТС", НомерВАТС);
	//СтруктПараметры.Вставить("ДоменAPI", ДоменAPI);
	//СтруктПараметры.Вставить("КлючAPI", КлючAPI);
		
	МассивПараметров.Добавить(СтруктПараметры);
	
	ФоновыеЗадания.Выполнить("СофтФон.ОбработкаИсторииЗвонковАТС", МассивПараметров, , "Обработка истории звонков АТС");
	
КонецПроцедуры

&НаКлиенте
Функция СуществуетТекущийРазговор_Binotel()

	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("internalNumber",ВнутреннийНомер);
	МассивСтрок=ТекущиеСобытия_Binotel.НайтиСтроки(ПараметрыОтбора);
	Результат=(МассивСтрок.Количество()>0 И ЗначениеЗаполнено(ИДТекущегоЗвонка));
	
	Возврат Результат;

КонецФункции

/////////////////// ПРОЦЕДУРЫ Simplit Mango /////////////////////////////

&НаКлиенте
Процедура ИнициализироватьОписаниеКода_Mango()

	// инициализация описания кода завершения
	СоответствиеКода_Mango=Новый Соответствие;
	СоответствиеКода_Mango.Вставить("1000","Действие успешно выполнено");
	СоответствиеКода_Mango.Вставить("1100","Вызов завершен в нормальном режиме");
	СоответствиеКода_Mango.Вставить("1110","Вызов завершен вызывающим абонентом");
	СоответствиеКода_Mango.Вставить("1111","Вызов не получил ответа в течение времени ожидания");
	
	СоответствиеКода_Mango.Вставить("1120","Вызов завершен вызываемым абонентом");
	СоответствиеКода_Mango.Вставить("1121","Получен ответ 'Занято' от удаленной стороны");
	СоответствиеКода_Mango.Вставить("1122","Вызов отклонен вызываемым абонентом");
	СоответствиеКода_Mango.Вставить("1123","Получен сигнал 'Не беспокоить'");

	СоответствиеКода_Mango.Вставить("1130","Ограничения для вызываемого номера");
	СоответствиеКода_Mango.Вставить("1131","Вызываемый номер недоступен");
	СоответствиеКода_Mango.Вставить("1132","Вызываемый номер не обслуживается");
	СоответствиеКода_Mango.Вставить("1133","Вызываемый номер не существует");
	СоответствиеКода_Mango.Вставить("1134","Превышено максимальное число переадресаций");
	
	СоответствиеКода_Mango.Вставить("1140","Вызовы на регион запрещены настройками ВАТС");
	
	СоответствиеКода_Mango.Вставить("1150","Ограничения для вызывающего номера");
	СоответствиеКода_Mango.Вставить("1151","Вызывающий номер в черном списке");
	СоответствиеКода_Mango.Вставить("1152","Вызывающий номер не найден в белом списке");
	
	СоответствиеКода_Mango.Вставить("1160","Вызов на группу не удался");
	СоответствиеКода_Mango.Вставить("1161","Удержание запрещено настройками ВАТС");
	СоответствиеКода_Mango.Вставить("1162","Очередь удержания заполнена");
	СоответствиеКода_Mango.Вставить("1163","Превышено время ожидания в очереди удержания");
	СоответствиеКода_Mango.Вставить("1164","Все операторы в данный момент недоступны");
	
	СоответствиеКода_Mango.Вставить("1170","Вызов завершен согласно схеме переадресации");
	СоответствиеКода_Mango.Вставить("1171","Неверно настроена схема переадресации");
	
	СоответствиеКода_Mango.Вставить("1180","Вызов завершен командой пользователя");
	СоответствиеКода_Mango.Вставить("1181","Вызов завершен по команде из внешней системы");
	СоответствиеКода_Mango.Вставить("1182","Вызов завершен перехватом на другого оператора");
	СоответствиеКода_Mango.Вставить("1183","Назначен новый оператор");
	
	СоответствиеКода_Mango.Вставить("1190","Вызываемый номер неактивен либо нерабочее расписание");
	СоответствиеКода_Mango.Вставить("1191","Вызываемый номер неактивен");
	СоответствиеКода_Mango.Вставить("1192","Вызываемый номер неактивен по расписанию");
	
	СоответствиеКода_Mango.Вставить("2000","Ограничение биллинговой системы");
	СоответствиеКода_Mango.Вставить("2100","Доступ к счету невозможен");
	СоответствиеКода_Mango.Вставить("2110","Счет заблокирован");
	СоответствиеКода_Mango.Вставить("2120","Счет закрыт");
	СоответствиеКода_Mango.Вставить("2130","Счет не обслуживается");
	СоответствиеКода_Mango.Вставить("2140","Счет недействителен");
	
	СоответствиеКода_Mango.Вставить("2200","Доступ к счету ограничен");
	СоответствиеКода_Mango.Вставить("2210","Доступ ограничен периодом использования");
	СоответствиеКода_Mango.Вставить("2211","Достигнут дневной лимит использования услуги");
	СоответствиеКода_Mango.Вставить("2212","Достигнут месячный лимит использования услуги");
	
	СоответствиеКода_Mango.Вставить("2220","Количество одновременных вызовов/действий ограничено");
	СоответствиеКода_Mango.Вставить("2230","Услуга недоступна");
	СоответствиеКода_Mango.Вставить("2240","Недостаточно средств на счете");
	СоответствиеКода_Mango.Вставить("2250","Ограничение на количество использований услуги в биллинге");
	СоответствиеКода_Mango.Вставить("2300","Направление заблокировано");
	СоответствиеКода_Mango.Вставить("2400","Ошибка биллинга");
	
	СоответствиеКода_Mango.Вставить("3000","Неверный запрос");
	СоответствиеКода_Mango.Вставить("3100","Переданы неверные параметры команды");
	СоответствиеКода_Mango.Вставить("3101","Запрос выполнен по методу, отличному от POST");
	СоответствиеКода_Mango.Вставить("3102","Значение ключа не соответствуют расчитанному");
	СоответствиеКода_Mango.Вставить("3103","В запросе отсутствует обязательный параметр");
	СоответствиеКода_Mango.Вставить("3104","Параметр передан в неправильном формате");
	СоответствиеКода_Mango.Вставить("3105","Неверный ключ доступа");
	СоответствиеКода_Mango.Вставить("3200","Неверно указан номер абонента");
	СоответствиеКода_Mango.Вставить("3300","Объект не существует");
	СоответствиеКода_Mango.Вставить("3310","Вызов не найден");
	СоответствиеКода_Mango.Вставить("3320","Запись разговора не найдена");
	СоответствиеКода_Mango.Вставить("3330","Номер не найден у ВАТС или сотрудника");
	
	СоответствиеКода_Mango.Вставить("4000","Действие не может быть выполнено");
	СоответствиеКода_Mango.Вставить("4001","Команда не поддерживается");
	СоответствиеКода_Mango.Вставить("4002","Продолжительность записи меньше минимально возможной в ВАТС, запись не будет сохранена");
	СоответствиеКода_Mango.Вставить("4100","Выполнить команду по логике работы ВАТС невозможно");
	СоответствиеКода_Mango.Вставить("4101","Вызов завершен либо не существует");
	СоответствиеКода_Mango.Вставить("4102","Запись разговора уже осуществляется");
	СоответствиеКода_Mango.Вставить("4200","Связаться с абонентом в данный момент невозможно");
	СоответствиеКода_Mango.Вставить("4300","SMS сообщение отправить не удалось");
	СоответствиеКода_Mango.Вставить("4301","SMS сообщение устарело");
	
	СоответствиеКода_Mango.Вставить("5000","Ошибка сервера");
	СоответствиеКода_Mango.Вставить("5001","Перегрузка");
	СоответствиеКода_Mango.Вставить("5002","Перезапуск");
	СоответствиеКода_Mango.Вставить("5003","Технические проблемы");
	СоответствиеКода_Mango.Вставить("5004","Проблемы доступа к базе данных");
	
КонецПроцедуры
 
&НаКлиенте
Функция ПолучитьСписокОператоров_Mango(ВнутрНомер="")

	ДанныеJSON="{}";
	Если ЗначениеЗаполнено(ВнутрНомер) Тогда
		ДанныеJSON="{'extension':'"+ВнутрНомер+"'}";
	КонецЕсли;	
	Пакет=СформироватьПакетREST(ДанныеJSON,"config/users/request");	
	ОтправитьПакетSimplitIO(Пакет);

КонецФункции
 
&НаКлиенте
Функция ПолучитьСписокЛиний_Mango()

	ДанныеJSON="{}";	
	Пакет=СформироватьПакетREST(ДанныеJSON,"incominglines");	
	ОтправитьПакетSimplitIO(Пакет);

КонецФункции

&НаСервере
Функция ПодписатьПакет_Mango(JSONПакет)
	
	//sign = sha256(vpbx_api_key + json + vpbx_api_salt). 
	
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(КлючAPI+JSONПакет+КлючДляПодписи);
	
	ДвДанныеСумма=Хеш.ХешСумма;
	СтрПодпись=НРег(Строка(ДвДанныеСумма));
	СтрПодпись=СтрЗаменить(СтрПодпись," ","");
	Возврат СтрПодпись;
	
КонецФункции

&НаКлиенте
Функция ОбработкаСобытийMango(Событие, Данные, Маркер="", ИДОтвета="")

	Если Найти(Событие,Схема+"api.simplit.io"+"/"+ЛогинSimplit+"/mango/") > 0 Тогда
	
		// webhooks
		ОбработкаСобытийХуков_Mango(Событие,Данные,ИДОтвета);
	
	ИначеЕсли Найти(Событие,Схема+АдресAPI)>0 Тогда
		
		// ответы API Mango на команды пользователя
		// все ответы приходят в формате JSON, за исключением статистики - она приходит в формате CSV
		
		Если Событие=Схема+АдресAPI+"stats/result" Тогда
			ДанныеПакета = Base64Раскодировать(Данные);
			ОбработкаИсторияАТС_Mango(ДанныеПакета, Маркер);
		Иначе
			ОбработкаСобытийREST_Mango(Событие,Данные,Маркер);
		КонецЕсли; 
		
	Иначе		
		// неизвестно
		ДанныеПакета=Base64Раскодировать(Данные);
		Сообщить(ДанныеПакета); 
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаСобытийХуков_Mango(СобытиеПакета,ДанныеПакета,ИД)

	БазовыйПуть=Схема+"api.simplit.io/"+ЛогинSimplit+"/mango/";
	Событие=СтрЗаменить(СобытиеПакета,БазовыйПуть,"");
	
	ДанныеСобытия=Base64Раскодировать(ДанныеПакета);
	Данные=СофтФонКлиентСервер.URL2JSON(ДанныеСобытия,Истина);
	
	// json не прошел валидацию
	Если Не ЗначениеЗаполнено(Данные) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СодержимоеПакета=Данные.Получить("json");
	Если СодержимоеПакета=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Событие="events/call" Тогда
		
		Если Не ТипЗнч(СодержимоеПакета)=Тип("Соответствие") Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		ТипСобытияЗвонка=СодержимоеПакета.Получить("call_state");
		Если ТипСобытияЗвонка=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		Если НРег(ТипСобытияЗвонка)="appeared" Тогда
		
			// начало звонка
			ОбработкаНачалаЗвонка_Mango(СодержимоеПакета, ИД);
		
		ИначеЕсли НРег(ТипСобытияЗвонка)="connected" Тогда
		
			// соединение
			ОбработкаСоединенияЗвонка_Mango(СодержимоеПакета);
		
		ИначеЕсли НРег(ТипСобытияЗвонка)="onhold" Тогда
		
			// удержание
			//ОбработкаУдержанияЗвонка(СодержимоеПакета);
		
		ИначеЕсли НРег(ТипСобытияЗвонка)="disconnected" Тогда
		
			// завершение
			ОбработкаЗавершенияЗвонка_Mango(СодержимоеПакета);
		
		КонецЕсли; 
		
	ИначеЕсли Событие="events/recording" Тогда
		
		//ОбработкаСостоянияЗаписи(СодержимоеПакета);
		
	ИначеЕсли Событие="result/stat" Тогда
		
		// событие готовности данных истории
		КлючИстории=СодержимоеПакета.Получить("key");
		ИДЗапроса=СодержимоеПакета.Получить("request_id");
		
		Если ИДЗапроса="api.history."+ВнутреннийНомер Тогда
			ПолучитьИсторию_Mango(КлючИстории);
		Иначе
			ПолучитьИсторию_Mango(КлючИстории,ИДЗапроса);
		КонецЕсли; 
		
	ИначеЕсли Событие="events/summary" Тогда
		
		//ОбработкаРезультатаЗвонка(СодержимоеПакета);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаСобытийREST_Mango(СобытиеПакета,ДанныеПакета,Маркер="")
	
	БазовыйПуть=Схема+АдресAPI;
	Событие=СтрЗаменить(СобытиеПакета,БазовыйПуть,"");
	
	ДанныеСобытия=Base64Раскодировать(ДанныеПакета);
	Данные = СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия,Истина);
	
	Если Не ТипЗнч(Данные)=Тип("Соответствие") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// json не прошел валидацию
	Если Данные=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	//ФлагAPI=Истина;
	
	// обработка ошибок
	Статус=Данные.Получить("status");
	Если Не Статус=Неопределено Тогда
		Если ТипЗнч(Статус)=Тип("Число") Тогда
			Если Статус>400 Тогда
				Текст=Данные.Получить("message");
				ИмяОшибки=Данные.Получить("name");
				КодОшибки=Данные.Получить("code");
				//Если Не Отладка Тогда
					Если ЗначениеЗаполнено(Текст) Тогда
						ПоказатьОповещениеПользователя(ИмяОшибки,,Текст);
					КонецЕсли; 
				//КонецЕсли;
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
	// обработка событий согласно Mango-Office API
	Метка="&json=";
	Если Событие="result/callback" Тогда
		
		ОбработкаОтветаНаКоманду_Mango(Данные);
		
	ИначеЕсли Событие="result/call/hangup" Тогда
		
		ОбработкаОтветаНаКоманду_Mango(Данные);
		
	ИначеЕсли Событие="result/route" Тогда
		
		ОбработкаОтветаНаКоманду_Mango(Данные);
		
	ИначеЕсли Событие="result/transfer" Тогда
		
		ОбработкаОтветаНаКоманду_Mango(Данные);
		
	ИначеЕсли Событие="config/users/request" Тогда
		
		ОбработкаВнутренниеНомера_Mango(Данные);
		
	ИначеЕсли Событие="incominglines" Тогда
		
		ОбработкаЛинии_Mango(Данные);
		
	ИначеЕсли Событие="stats/request" Тогда
		
		// в ответ должен вернуться ключ
		КлючИстории=Данные.Получить("key");
		Если Не ЗначениеЗаполнено(КлючИстории) Тогда
			СтрСообщения="Запрос истории не выполнен";
			Если ЗначениеЗаполнено(Данные.Получить("message")) Тогда
				СтрСообщения=Данные.Получить("message");
			КонецЕсли; 
			ПоказатьОповещениеПользователя("Ошибка запроса истории",,СтрСообщения);
		КонецЕсли; 
		
	ИначеЕсли Событие="queries/recording/post" Тогда
		
		// в ответ должен вернуться линк
		ОбработкаЗапросФайлаЗаписи_Mango(Данные,Маркер);
		
	ИначеЕсли Событие="stats/result" Тогда
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Функция ОбработкаОтветаНаКоманду_Mango(Данные)

	ИДКоманды=Данные.Получить("command_id");
	КодРезультата=Данные.Получить("result");
	
	Если ИДКоманды="api.outgoing."+ВнутреннийНомер 
		ИЛИ ИДКоманды="api.transfer."+ВнутреннийНомер
		ИЛИ ИДКоманды="api.hangup."+ВнутреннийНомер
		ИЛИ ИДКоманды="api.route."+ВнутреннийНомер Тогда
		
		Если КодРезультата>1000 Тогда
		
			ОписаниеПричины=ПолучитьОписаниеКода_Mango(КодРезультата);
			ПоказатьОповещениеПользователя("Ошибка",,ОписаниеПричины);
		
		КонецЕсли; 
	
	КонецЕсли; 

КонецФункции

&НаКлиенте
Функция ОбработкаЗапросФайлаЗаписи_Mango(Данные, Маркер)
	
	КодОтвета=Данные.Получить("code");
	ФайлЗаписиСсылка=Данные.Получить("location");
	
	Если Не КодОтвета=302 Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ФайлЗаписиСсылка) Тогда
		
		ПараметрыОтбора=Новый Структура;
		
		Разделитель=".";
		СтрПоиска="record-request"+Разделитель;
		Длина=СтрДлина(СтрПоиска);
		Позиция=Найти(Маркер,СтрПоиска);
		Если Позиция=0 Тогда
			Возврат Ложь;
		КонецЕсли;
		СтрМаркер=СтрЗаменить(Маркер,СтрПоиска,"")+Разделитель;
		
		Команда1С=""; ФайлЗаписиИД=""; ИДФормыОповещения="";
		Колво=СтрЧислоВхождений(СтрМаркер,Разделитель);
		Для Индекс=1 По Колво Цикл
			
			ПозицияРазделителя=Найти(СтрМаркер,Разделитель);
			Если ПозицияРазделителя>0 Тогда
			
				Значение=Лев(СтрМаркер,ПозицияРазделителя-1);
				Если Индекс=1 Тогда
					Команда1С=Значение;
				ИначеЕсли Индекс=2 Тогда
					ФайлЗаписиИД=Значение;
				ИначеЕсли Индекс=3 Тогда
					ИДФормыОповещения=Значение;
				КонецЕсли;
				СтрМаркер=Сред(СтрМаркер,ПозицияРазделителя+1);
			
			КонецЕсли; 
		
		КонецЦикла; 
		
		Если Не ЗначениеЗаполнено(ФайлЗаписиИД) Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		//Если Команда1С="download" Тогда
		//	СохранитьФайлЗаписи(ФайлЗаписиСсылка,ФайлЗаписиИД,ИДФормыОповещения);
		//ИначеЕсли Команда1С="play" Тогда
		//	Если ФлагФайлыПрослушивание Тогда
		//		ОткрытьФормуВоспроизведения(ФайлЗаписиСсылка);
		//	Иначе
		//		НачатьЗапускПриложения(Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", ЭтаФорма), ФайлЗаписиСсылка);
		//	КонецЕсли; 
		//КонецЕсли;
		//Если ЗагружатьЗаписьMango Тогда
		//	СофтФонКлиент.ПолучитьФайлЗаписиПоHttpСсылке(ФайлЗаписиСсылка);
		//Иначе			
		//	Оповещение=Новый ОписаниеОповещения("ЗавершитьЗапускПриложения", СофтФонКлиент);
		//	НачатьЗапускПриложения(Оповещение, ФайлЗаписиСсылка);
		//КонецЕсли;
		ОбработатьПолучениеСсылкиФайлаЗаписиЗвонка(РежимЗагрузкиЗаписиMango, ФайлЗаписиСсылка);		
	КонецЕсли; 

КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеКода_Mango(Код)

	// строковое представление кода завершения
	Результат=Код;
	Если Не ЗначениеЗаполнено(Код) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	Попытка
		ЧислоКод=Число(Код);
	Исключение
		Возврат Результат;
	КонецПопытки; 
	
	ЧислоКласс=Окр(ЧислоКод,-3);
	СтрКласс=Формат(ЧислоКласс,"ЧГ=0");
	СтрКод=Формат(ЧислоКод,"ЧГ=0");
	ОписаниеКласса=СоответствиеКода_Mango.Получить(СтрКласс);
	ОписаниеКода=СоответствиеКода_Mango.Получить(СтрКод);
	
	Результат=ОписаниеКода;
	Если ЗначениеЗаполнено(ОписаниеКласса) Тогда
		Если ЧислоКласс>2000 Тогда
			Результат=ОписаниеКласса+": "+ОписаниеКода;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ОбработкаВнутренниеНомера_Mango(Данные)

	Содержимое=Данные.Получить("users");
	Если Не ТипЗнч(Содержимое)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыОтбора=Новый Структура;
	
	Для каждого ЭлементМассива Из Содержимое Цикл
		Попытка
			
			Общие=ЭлементМассива.Получить("general"); 
			Если Общие=Неопределено  Тогда
				Продолжить;
			КонецЕсли;
			
			Телефоны=ЭлементМассива.Получить("telephony");
			Если Телефоны=Неопределено  Тогда
				Продолжить;
			КонецЕсли;
			
			Номера=Телефоны.Получить("numbers");
			Если Номера=Неопределено  Тогда
				Продолжить;
			КонецЕсли; 
			
			Номер=Телефоны.Получить("extension");
			
			Для каждого ЭлементНомера Из Номера Цикл
				
				Протокол=ЭлементНомера.Получить("protocol");
				Статус=ЭлементНомера.Получить("status");
				УчЗапись=ЭлементНомера.Получить("number");
				
				Если НРег(Протокол)="sip" Тогда
					
					Если Не Номер=ВнутреннийНомер Тогда
						ПараметрыОтбора.Вставить("Номер",Номер);
						МассивСтрок=ВнутренниеНомера_Mango.НайтиСтроки(ПараметрыОтбора);
						Если МассивСтрок.Количество()>0 Тогда
							СтрВнутренниеНомера=МассивСтрок[0];
						Иначе
							СтрВнутренниеНомера=ВнутренниеНомера_Mango.Добавить();
						КонецЕсли; 
						СтрВнутренниеНомера.Номер=Номер;
						СтрВнутренниеНомера.Протокол=Протокол;
						СтрВнутренниеНомера.УчетнаяЗапись=УчЗапись;
						СтрВнутренниеНомера.Имя=Общие.Получить("name");
						СтрВнутренниеНомера.Статус=Макс((Статус="on"),СтрВнутренниеНомера.Статус);
					Иначе
						//СтатусТелефона=Макс((Статус="on"),СтатусТелефона);
						УчетнаяЗапись_Mango = УчЗапись;
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		Исключение
		КонецПопытки; 
	КонецЦикла;
	
	//ЗаполнитьПользователей();
	ВнутренниеНомера_Mango.Сортировать("Номер");

КонецФункции

&НаКлиенте
Функция ОбработкаЛинии_Mango(Данные)

	Содержимое=Данные.Получить("lines");
	Если Не ТипЗнч(Содержимое)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыОтбора=Новый Структура;
	
	Для каждого ЭлементМассива Из Содержимое Цикл
					
		ИД=ЭлементМассива.Получить("line_id");
		
		ПараметрыОтбора.Вставить("ИД",ИД);
		МассивСтрок=Линии_Mango.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество()>0 Тогда
			СтрЛинии=МассивСтрок[0];
		Иначе
			СтрЛинии=Линии_Mango.Добавить();
		КонецЕсли; 
		СтрЛинии.УчетнаяЗапись=ЭлементМассива.Получить("number");;
		СтрЛинии.Номер=ЭлементМассива.Получить("name");;
					
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ОбработкаИсторияАТС_Mango(Данные, Маркер="")
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", ТекущаяДата());
	СтруктПараметры.Вставить("Данные", Данные);
	СтруктПараметры.Вставить("КоллекцияВнутрНомера", ПолучитьСоответствиеВнутреннихНомеров_Mango());
	СтруктПараметры.Вставить("КоллекцияЛинии", ПолучитьСоответствиеЛиний_Mango());
	
	ОбработкаИсторияАТСКлиент(СтруктПараметры);
	
КонецФункции

&НаКлиенте
Функция ПолучитьСоответствиеВнутреннихНомеров_Mango()

	КоллекцияВнутрНомера=Новый Соответствие;
	КоллекцияВнутрНомера.Вставить(УчетнаяЗапись_Mango, ВнутреннийНомер);
	Для каждого Элемент Из ВнутренниеНомера_Mango Цикл
		КоллекцияВнутрНомера.Вставить(Элемент.УчетнаяЗапись, Элемент.Номер);
	КонецЦикла; 
	
	Возврат КоллекцияВнутрНомера;

КонецФункции

&НаКлиенте
Функция ПолучитьСоответствиеЛиний_Mango()

	КоллекцияЛинии = Новый Соответствие;
	Для каждого Элемент Из Линии_Mango Цикл
		КоллекцияЛинии.Вставить(Элемент.УчетнаяЗапись,Элемент.Номер);
	КонецЦикла; 
	
	Возврат КоллекцияЛинии;

КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуТекущегоЗвонка_Mango(ИД, Создавать=Истина, ИДПлеча="")

	Результат=Неопределено;
	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("ИД",ИД);
	Если ЗначениеЗаполнено(ИДПлеча) Тогда
		ПараметрыОтбора.Вставить("call_id",ИДПлеча);
	КонецЕсли; 
	МассивСтрок=ТекущиеЗвонки_Mango.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество()=0 Тогда
		Если Создавать Тогда
			Результат=ТекущиеЗвонки_Mango.Добавить();
			Результат.ИД=ИД;
		КонецЕсли;
	Иначе
		Результат=МассивСтрок[0];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ПолучитьПредставлениеЛинии_Mango(УчетнаяЗапись)

	Результат=УчетнаяЗапись;
	
	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("УчетнаяЗапись",УчетнаяЗапись);
	
	МассивСтрок=Линии_Mango.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество()>0 Тогда
		Результат=МассивСтрок[0].Номер;
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ОбработкаНачалаЗвонка_Mango(Данные,ИДОтвета)

	ИД=Данные.Получить("entry_id");
	Если ИД=Неопределено  Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрТекущиеЗвонки = ПолучитьСтрокуТекущегоЗвонка_Mango(ИД);
	
	СтрТекущиеЗвонки.call_id=			Данные.Получить("call_id");
	СтрТекущиеЗвонки.timestamp=			Данные.Получить("timestamp");
	СтрТекущиеЗвонки.seq=				Данные.Получить("seq");
	СтрТекущиеЗвонки.call_state=		Данные.Получить("call_state");
	СтрТекущиеЗвонки.location=			Данные.Получить("location");
	СтрТекущиеЗвонки.disconnect_reason=	Данные.Получить("disconnect_reason");
	СтрТекущиеЗвонки.command_id=		Данные.Получить("command_id");
	
	Откуда=Данные.Получить("from");
	Если Не Откуда=Неопределено Тогда
		СтрТекущиеЗвонки.from_extension=	Откуда.Получить("extension");
		СтрТекущиеЗвонки.from_number=		Откуда.Получить("number");
		СтрТекущиеЗвонки.taken_from_call_id=Откуда.Получить("taken_from_call_id");
	КонецЕсли; 
	
	Куда=Данные.Получить("to");
	Если Не Куда=Неопределено Тогда
		СтрТекущиеЗвонки.to_extension=	Куда.Получить("extension");
		СтрТекущиеЗвонки.to_number=		Куда.Получить("number");
		СтрТекущиеЗвонки.to_line_number=Куда.Получить("line_number");
		СтрТекущиеЗвонки.acd_group=		Куда.Получить("acd_group");
	КонецЕсли; 
	
	// внутренние не регистрируются
	ЭтоВнутренний=СофтФонКлиентСервер.ЭтоВнутренний_Mango(СтрТекущиеЗвонки.from_number,СтрТекущиеЗвонки.to_number);
	Если ЭтоВнутренний Тогда
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеЗвонки.from_extension,2,ИД);
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеЗвонки.to_extension,2,ИД);
		Возврат Ложь;
	КонецЕсли; 
	
	ЭтоЗвонокAPI=(Найти(СтрТекущиеЗвонки.command_id,"api.outgoing.")>0);
	ЭтоВходящий=(Откуда.Получить("extension")=Неопределено И Не ЭтоЗвонокAPI);
	СтрТекущиеЗвонки.Входящий=ЭтоВходящий;
	
	// определения номеров
	Номер=СтрТекущиеЗвонки.to_number;
	ВнутрНомер=СтрТекущиеЗвонки.from_extension;
	Если ЭтоВходящий=Истина Тогда
		Номер=СтрТекущиеЗвонки.from_number;
		ВнутрНомер=СтрТекущиеЗвонки.to_extension;
	КонецЕсли;
	СтрТекущиеЗвонки.Номер=Номер;
	СтрТекущиеЗвонки.ВнутрНомер=ВнутрНомер;
	СтрТекущиеЗвонки.Входящий=ЭтоВходящий;
	
	// маршрутизация на ответственного
	Если ЭтоВходящий=Истина Тогда
		Если СтрТекущиеЗвонки.location="ivr" Тогда
			//ВыполнитьМаршрутизацию(СтрТекущиеЗвонки);
		КонецЕсли; 
	КонецЕсли; 
	
	// действия по отлеживаемому внутреннему номеру
	Если ВнутрНомер=ВнутреннийНомер Тогда
		
		Если Не СофтФонКлиентСервер.ЭтоВнутренний_Mango(СтрТекущиеЗвонки.from_number,СтрТекущиеЗвонки.to_number) Тогда
		 
			Состояние="Вызов";
			ВнешняяЛиния=ПолучитьПредставлениеЛинии_Mango(СтрТекущиеЗвонки.to_line_number);
			СтрТекущиеЗвонки.Линия=ВнешняяЛиния;
			НомерАбонента=Номер;
			
			НаправлениеЗвонка="Исходящий";
			Если ЭтоВходящий=Истина Тогда
				НаправлениеЗвонка="Входящий";
				ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, ИД);
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЕсли; 

	// обновление списка внутренних
	Если НРег(СтрТекущиеЗвонки.location)="abonent" Тогда
		//ОбновитьСтатусВнутреннегоНомера(ВнутрНомер,2,ИД);
	КонецЕсли; 
		
КонецФункции

&НаКлиенте
Функция ОбработкаСоединенияЗвонка_Mango(Данные)

	ИД=Данные.Получить("entry_id");
	Если ИД=Неопределено  Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрТекущиеЗвонки=ПолучитьСтрокуТекущегоЗвонка_Mango(ИД);
	
	СтрТекущиеЗвонки.call_id=			Данные.Получить("call_id");
	СтрТекущиеЗвонки.timestamp=			Данные.Получить("timestamp");
	СтрТекущиеЗвонки.seq=				Данные.Получить("seq");
	СтрТекущиеЗвонки.call_state=		Данные.Получить("call_state");
	СтрТекущиеЗвонки.location=			Данные.Получить("location");
	СтрТекущиеЗвонки.disconnect_reason=	Данные.Получить("disconnect_reason");
	СтрТекущиеЗвонки.command_id=		Данные.Получить("command_id");
	
	Откуда=Данные.Получить("from");
	Если Не Откуда=Неопределено Тогда
		СтрТекущиеЗвонки.from_extension=	Откуда.Получить("extension");
		СтрТекущиеЗвонки.from_number=		Откуда.Получить("number");
		СтрТекущиеЗвонки.taken_from_call_id=Откуда.Получить("taken_from_call_id");
	КонецЕсли; 
	
	Куда=Данные.Получить("to");
	Если Не Куда=Неопределено Тогда
		СтрТекущиеЗвонки.to_extension=	Куда.Получить("extension");
		СтрТекущиеЗвонки.to_number=		Куда.Получить("number");
		СтрТекущиеЗвонки.to_line_number=Куда.Получить("line_number");
		СтрТекущиеЗвонки.acd_group=		Куда.Получить("acd_group");
	КонецЕсли; 
	
	// внутренние не регистрируются
	ЭтоВнутренний=СофтФонКлиентСервер.ЭтоВнутренний_Mango(СтрТекущиеЗвонки.from_number,СтрТекущиеЗвонки.to_number);
	Если ЭтоВнутренний Тогда
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеЗвонки.from_extension,4,ИД);
		//ОбновитьСтатусВнутреннегоНомера(СтрТекущиеЗвонки.to_extension,4,ИД);
		Возврат Ложь;
	КонецЕсли; 
	
	ЭтоЗвонокAPI=(Найти(СтрТекущиеЗвонки.command_id,"api.outgoing.")>0);
	ЭтоВходящий=(Откуда.Получить("extension")=Неопределено И Не ЭтоЗвонокAPI);
	СтрТекущиеЗвонки.Входящий=ЭтоВходящий;
	
	// определения номеров
	Номер=СтрТекущиеЗвонки.to_number;
	ВнутрНомер=СтрТекущиеЗвонки.from_extension;
	Если ЭтоВходящий=Истина Тогда
		Номер=СтрТекущиеЗвонки.from_number;
		ВнутрНомер=СтрТекущиеЗвонки.to_extension;
	КонецЕсли; 
	СтрТекущиеЗвонки.Номер=Номер;
	СтрТекущиеЗвонки.ВнутрНомер=ВнутрНомер;
	СтрТекущиеЗвонки.Входящий=ЭтоВходящий;
	
	Если НРег(СтрТекущиеЗвонки.location)="abonent" Тогда
		
		
		Если ВнутрНомер=ВнутреннийНомер Тогда
			
			Если Не СофтФонКлиентСервер.ЭтоВнутренний_Mango(СтрТекущиеЗвонки.from_number,СтрТекущиеЗвонки.to_number) Тогда
				
				ДействияПриПоднятииТрубки_Mango(Номер, ИД);
				
				
				//			ОпределитьКлиента(СтрТекущиеЗвонки);
				//
				//			Клиент=СтрТекущиеЗвонки.Клиент;
				//			КонтактноеЛицо=СтрТекущиеЗвонки.КонтактноеЛицо;
				//			Если Не ЗначениеЗаполнено(КонтактноеЛицо) Тогда
				//				КонтактноеЛицо=СтрТекущиеЗвонки.Контрагент;
				//			КонецЕсли; 
				//			Состояние="Разговор";
				//			Линия=ПолучитьПредставлениеЛинии(СтрТекущиеЗвонки.to_line_number);
				//			СтрТекущиеЗвонки.Линия=Линия;
				//			НомерАбонента=Номер;
				//			
				//			ДействияПриПоднятииТрубки(СтрТекущиеЗвонки);
				//			ЗакрытьФормуОповещения();
				
			КонецЕсли;		
		КонецЕсли;
		
		ЗакрытьФормуВходящегоЗвонка(ИД);
			
		//ПараметрыОтбора=Новый Структура;
		//ПараметрыОтбора.Вставить("ИД",ИД);
		//МассивСтрок=ВнутренниеНомера.НайтиСтроки(ПараметрыОтбора);
		//Для каждого СтрВнутренниеНомера Из МассивСтрок Цикл
		//	ОбновитьСтатусВнутреннегоНомера(СтрВнутренниеНомера.Номер,1,"");
		//КонецЦикла; 
		//	
		//ОбновитьСтатусВнутреннегоНомера(ВнутрНомер,4,ИД);
		
	КонецЕсли; 
		
КонецФункции

&НаКлиенте
Функция ОбработкаЗавершенияЗвонка_Mango(Данные)

	ИД=Данные.Получить("entry_id");
	Если ИД=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Расположение=Данные.Получить("location");
	Если НРег(Расположение)="abonent" Тогда
		ИДПлеча=Данные.Получить("call_id");
	КонецЕсли; 
	
	СтрТекущиеЗвонки=ПолучитьСтрокуТекущегоЗвонка_Mango(ИД);
	Если СтрТекущиеЗвонки=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	СтрТекущиеЗвонки.call_id=			Данные.Получить("call_id");
	СтрТекущиеЗвонки.timestamp=			Данные.Получить("timestamp");
	СтрТекущиеЗвонки.seq=				Данные.Получить("seq");
	СтрТекущиеЗвонки.call_state=		Данные.Получить("call_state");
	СтрТекущиеЗвонки.location=			Данные.Получить("location");
	СтрТекущиеЗвонки.disconnect_reason=	Данные.Получить("disconnect_reason");
	СтрТекущиеЗвонки.command_id=		Данные.Получить("command_id");
	
	Откуда=Данные.Получить("from");
	Если Не Откуда=Неопределено Тогда
		СтрТекущиеЗвонки.from_extension=	Откуда.Получить("extension");
		СтрТекущиеЗвонки.from_number=		Откуда.Получить("number");
		СтрТекущиеЗвонки.taken_from_call_id=Откуда.Получить("taken_from_call_id");
	КонецЕсли; 
	
	Куда=Данные.Получить("to");
	Если Не Куда=Неопределено Тогда
		СтрТекущиеЗвонки.to_extension=	Куда.Получить("extension");
		СтрТекущиеЗвонки.to_number=		Куда.Получить("number");
		СтрТекущиеЗвонки.to_line_number=Куда.Получить("line_number");
		СтрТекущиеЗвонки.acd_group=		Куда.Получить("acd_group");
	КонецЕсли; 
	
	ЭтоВходящий=(Откуда.Получить("extension")=Неопределено);
	
	// определения внутр. номера
	ВнутрНомер=СтрТекущиеЗвонки.from_extension;
	Если ЭтоВходящий=Истина Тогда
		ВнутрНомер=СтрТекущиеЗвонки.to_extension;
	КонецЕсли; 
	СтрТекущиеЗвонки.Входящий=ЭтоВходящий;
	
	Если ВнутрНомер=ВнутреннийНомер Тогда
		Если Не СофтФонКлиентСервер.ЭтоВнутренний_Mango(СтрТекущиеЗвонки.from_number,СтрТекущиеЗвонки.to_number) Тогда
			ЗакрытьФормуВходящегоЗвонка(ИД);
			//Состояние="Завершен";
			//ЗакрытьФормуОповещения();
			//НажатьКнопкуЗаписи(Ложь);
		КонецЕсли; 
	КонецЕсли; 
	
	//ТекущиеЗвонки.Удалить(СтрТекущиеЗвонки);
	
КонецФункции

&НаКлиенте
Функция ПолучитьИсторию_Mango(Ключ,Маркер="")

	ДанныеJSON="{'key':'"+Ключ+"'}";
	Пакет=СформироватьПакетREST(ДанныеJSON,"stats/result",,Маркер);	
	ОтправитьПакетSimplitIO(Пакет);

КонецФункции

/////////////////// ПРОЦЕДУРЫ Simplit Phonet /////////////////////////////

&НаКлиенте
Процедура ИнициализироватьИнфоОшибок_Phonet()

	// инициализация информации об ошибках
	ИнфоОшибок=Новый Соответствие;
	ИнфоОшибок.Вставить("Too Many Requests","Слишком много запросов");
	ИнфоОшибок.Вставить("More than 1 request per 1.0 second(s)","Больше чем 1 запрос в секунду");
	ИнфоОшибок.Вставить("Bad Request","Неверный запрос");
	ИнфоОшибок.Вставить("Invalid date range","Неверный диапазон дат");
	ИнфоОшибок.Вставить("Access Denied","Доступ запрещен");

КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьСтатусы_Phonet()

	// инициализация состояний звонка
	СтатусыНомеров=Новый Соответствие;
	СтатусыНомеров.Вставить("online",	1);
	СтатусыНомеров.Вставить("inuse",	4);
	СтатусыНомеров.Вставить("ringing",	4);
	СтатусыНомеров.Вставить("offline",	0);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьКлючREST_Phonet()

	КлючСессии=""; Таймаут=5;
	SSL = Новый ЗащищенноеСоединениеOpenSSL();
	HTTPСоединение=Новый HTTPСоединение(ДоменAPI,,,,,Таймаут,SSL);
	
	ДанныеJSON="{'domain':'"+ДоменAPI+"','apiKey':'"+КлючAPI+"'}";
	HTTPЗапрос=Новый HTTPЗапрос();
	HTTPЗапрос.АдресРесурса="/rest/security/authorize";
	HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json");
	HTTPЗапрос.УстановитьТелоИзСтроки(СофтФонКлиентСервер.Stringify(ДанныеJSON));
	
	Попытка
		HTTPОтвет=HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния=200 Тогда
			КлючСессии=HTTPОтвет.Заголовки.Получить("Set-Cookie");
		КонецЕсли; 
	Исключение
		//Если Отладка Тогда
		Сообщить("Ошибка получения ключа сессии: " + ОписаниеОшибки());
		//КонецЕсли; 
	КонецПопытки; 
	
	Возврат КлючСессии;

КонецФункции

&НаКлиенте
Функция ПолучитьСписокОператоров_Phonet()

	Путь="/rest/users";
	ДанныеJSON="";
	Пакет=СформироватьПакетREST(ДанныеJSON,Путь,"get");
	ОтправитьПакетSimplitIO(Пакет);

КонецФункции

&НаКлиенте
Функция ОбработкаСобытийPhonet(Событие, Данные, Маркер="", ИДОтвета="")

	// события API Phonet
	Если Найти(Событие, ДоменAPI) > 0 Тогда
		// response
		ОбработкаСобытийREST_Phonet(Событие, Данные, Маркер);
	Иначе
		// webhooks
		ОбработкаСобытийPush_Phonet(Событие, Данные, ИДОтвета);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработкаСобытийPush_Phonet(Путь,ДанныеПакета,ИДОтвета="")
	
	ДанныеСобытия=Base64Раскодировать(ДанныеПакета);
		
	Данные=СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия,Истина);
		
	// json не прошел валидацию
	Если Данные=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ТипЗнч(Данные)=Тип("Соответствие") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ФлагAPI=Истина;
	
	// запрос контакта
	Событие=Данные.Получить("request");
	Если Не Событие=Неопределено Тогда
		Если Событие="call.settings" Тогда
			ОбработкаПолученияСвойствЗвонка_Phonet(Данные,ИДОтвета);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	// webhooks
	Событие=Данные.Получить("event");
	БазовыйПуть="https://api.simplit.io/"+ЛогинSimplit+"/"+ИДВАТС;
	
	Если Событие="call.dial" Тогда
		
		ОбработкаНачалаЗвонкаНомера_Phonet(Данные);
		
	ИначеЕсли Событие="call.bridge" Тогда
		
		ОбработкаОтветаНаЗвонок_Phonet(Данные);
		
	ИначеЕсли Событие="call.hangup" Тогда
		
		Если Путь=БазовыйПуть+"/hangup" Тогда
			
			ОбработкаЗавершенияЗвонкаНомера_Phonet(Данные);
			
		ИначеЕсли Путь=БазовыйПуть+"/end" Тогда
			
			ОбработкаЗавершенияЗвонкаГруппы_Phonet(Данные);
			
		КонецЕсли; 
		
		
	ИначеЕсли Событие="call.join-queue" Тогда
		
		ОбработкаНачалаЗвонкаГруппы_Phonet(Данные);
		
	Иначе
		
		Если Путь=БазовыйПуть+"/finish" Тогда
			
			ОбработкаЗавершенияЗвонка_Phonet(Данные);
		
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Функция ОбработкаПолученияСвойствЗвонка_Phonet(Данные,ИДОтвета="")

	//Если ФлагМаршрутизация Тогда
	//	ЛинияНомер=Данные.Получить("trunkNum");
	//	Номер=Данные.Получить("otherLegNum");
	//	Номер=СтрЗаменить(Номер,"+","");
	//	Если ЗначениеЗаполнено(Номер) Тогда
	//		ВыполнитьМаршрутизацию(Номер,ИДОтвета);
	//	КонецЕсли; 
	//КонецЕсли; 

КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуСобытия_Phonet(ИД, ФлагСоздания=Истина)

	Результат=Неопределено;
	
	Если Не ЗначениеЗаполнено(ИД) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("ИД", ИД);
	МассивСтрок=ТекущиеСобытия_Phonet.НайтиСтроки(ПараметрыОтбора);
	Если Не ЗначениеЗаполнено(МассивСтрок) Тогда
		Если ФлагСоздания Тогда
			Результат=ТекущиеСобытия_Phonet.Добавить();
			Результат.ИД=ИД;
		КонецЕсли; 
	Иначе	
		Результат=МассивСтрок[0];
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбработкаНачалаЗвонкаНомера_Phonet(Данные)

	Попытка
				
		ИД=Данные.Получить("parentUuid");
		
		СтрТекущиеСобытия=ПолучитьСтрокуСобытия_Phonet(ИД);
		Если СтрТекущиеСобытия=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		СтрТекущиеСобытия.ИДПлеча=Данные.Получить("uuid");
		СтрТекущиеСобытия.Направление=Данные.Получить("lgDirection");
		СтрТекущиеСобытия.ЛинияНомер=Данные.Получить("trunkNum");
		СтрТекущиеСобытия.ЛинияИмя=Данные.Получить("trunkName");
		СтрТекущиеСобытия.ДатаНачала=Данные.Получить("dialAt");
		СтрТекущиеСобытия.ДатаОтвета=Данные.Получить("bridgeAt");
		
		КоллекцияВнутрНомер=Данные.Получить("leg");
		Если ТипЗнч(КоллекцияВнутрНомер)=Тип("Соответствие") Тогда
			СтрТекущиеСобытия.ВнутреннийНомер=КоллекцияВнутрНомер.Получить("ext");
			СтрТекущиеСобытия.ВнутреннийНомерТип=КоллекцияВнутрНомер.Получить("type");
		КонецЕсли; 
		
		КоллекцияНомер=Данные.Получить("otherLegs");
		Если ТипЗнч(КоллекцияНомер)=Тип("Массив") Тогда
			Если КоллекцияНомер.Количество()>0 Тогда
				СтрТекущиеСобытия.Номер=КоллекцияНомер[0].Получить("num");
				СтрТекущиеСобытия.Номер=СтрЗаменить(СтрТекущиеСобытия.Номер,"+","");
			КонецЕсли; 
		КонецЕсли; 
		
		Если СтрТекущиеСобытия.ВнутреннийНомер=ВнутреннийНомер Тогда
			
			Состояние="Вызов";
			ИДТекущегоЗвонка=ИД;
			
			// звонок, принадлежащий этому оператору
			Если СтрТекущиеСобытия.Направление=4 Тогда
				
				НаправлениеЗвонка="Входящий";
				Линия=СтрТекущиеСобытия.ЛинияНомер;
				НомерАбонента=СтрТекущиеСобытия.Номер;
				
				ДействияПриНачалеВходящегоЗвонка(НомерАбонента, Линия, ВнутреннийНомер, ИДТекущегоЗвонка);
				
			ИначеЕсли СтрТекущиеСобытия.Направление=2 Тогда
				
				НаправлениеЗвонка="Исходящий";
				Линия=СтрТекущиеСобытия.ЛинияНомер;
				НомерАбонента=СтрТекущиеСобытия.Номер;
				
			ИначеЕсли СтрТекущиеСобытия.Направление=1 Тогда
				
				НаправлениеЗвонка="Внутренний";
				КоллекцияВнутрНомер2=Данные.Получить("leg2");
				Если ТипЗнч(КоллекцияВнутрНомер2)=Тип("Соответствие") Тогда
					НомерАбонента=КоллекцияВнутрНомер2.Получить("ext");
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;
		
//		ОбновитьСтатусВнутреннегоНомера(СтрТекущиеСобытия.ВнутреннийНомер,"ringing");
		
	Исключение
//		Если Отладка Тогда
//			Сообщить(ОписаниеОшибки());
//		КонецЕсли; 
	КонецПопытки; 
	
КонецФункции

&НаКлиенте
Функция ОбработкаНачалаЗвонкаГруппы_Phonet(Данные)
	
КонецФункции

&НаКлиенте
Функция ОбработкаОтветаНаЗвонок_Phonet(Данные)

	Попытка
				
		ИД=Данные.Получить("parentUuid");
		
		СтрТекущиеСобытия=ПолучитьСтрокуСобытия_Phonet(ИД);
		Если СтрТекущиеСобытия=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		СтрТекущиеСобытия.ИДПлеча=Данные.Получить("uuid");
		СтрТекущиеСобытия.Направление=Данные.Получить("lgDirection");
		СтрТекущиеСобытия.ЛинияНомер=Данные.Получить("trunkNum");
		СтрТекущиеСобытия.ЛинияИмя=Данные.Получить("trunkName");
		СтрТекущиеСобытия.ДатаНачала=Данные.Получить("dialAt");
		СтрТекущиеСобытия.ДатаОтвета=Данные.Получить("bridgeAt");
		
		КоллекцияВнутрНомер=Данные.Получить("leg");
		Если ТипЗнч(КоллекцияВнутрНомер)=Тип("Соответствие") Тогда
			СтрТекущиеСобытия.ВнутреннийНомер=КоллекцияВнутрНомер.Получить("ext");
			СтрТекущиеСобытия.ВнутреннийНомерТип=КоллекцияВнутрНомер.Получить("type");
		КонецЕсли; 
		
		КоллекцияНомер=Данные.Получить("otherLegs");
		Если ТипЗнч(КоллекцияНомер)=Тип("Массив") Тогда
			Если КоллекцияНомер.Количество()>0 Тогда
				СтрТекущиеСобытия.Номер=КоллекцияНомер[0].Получить("num");
				СтрТекущиеСобытия.Номер=СтрЗаменить(СтрТекущиеСобытия.Номер,"+","");
			КонецЕсли; 
		КонецЕсли; 
		
		Если СтрТекущиеСобытия.ВнутреннийНомер=ВнутреннийНомер Тогда
			
			Состояние="Разговор";
			ИДТекущегоЗвонка=ИД;
			
			// звонок, принадлежащий этому оператору
			Если СтрТекущиеСобытия.Направление=4 Тогда
				
				НаправлениеЗвонка="Входящий";
				Линия=СтрТекущиеСобытия.ЛинияНомер;
				НомерАбонента=СтрТекущиеСобытия.Номер;
				
				ДействияПриПоднятииТрубки_Phonet(НомерАбонента, ИДТекущегоЗвонка);
				
			ИначеЕсли СтрТекущиеСобытия.Направление=2 Тогда
				
				НаправлениеЗвонка="Исходящий";
				Линия=СтрТекущиеСобытия.ЛинияНомер;
				НомерАбонента=СтрТекущиеСобытия.Номер;
								
			ИначеЕсли СтрТекущиеСобытия.Направление=1 Тогда
				
				НаправлениеЗвонка="Внутренний";
				КоллекцияВнутрНомер2=Данные.Получить("leg2");
				Если ТипЗнч(КоллекцияВнутрНомер2)=Тип("Соответствие") Тогда
					НомерАбонента=КоллекцияВнутрНомер2.Получить("ext");
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;
		
//		ОбновитьСтатусВнутреннегоНомера(СтрТекущиеСобытия.ВнутреннийНомер,"ringing");
		
	Исключение
//		Если Отладка Тогда
//			Сообщить(ОписаниеОшибки());
//		КонецЕсли; 
	КонецПопытки; 
	
КонецФункции
 
&НаКлиенте
Функция ОбработкаЗавершенияЗвонкаНомера_Phonet(Данные)

	Попытка
		
		ВнутрНомер="";
		КоллекцияВнутрНомер=Данные.Получить("leg");
		Если ТипЗнч(КоллекцияВнутрНомер)=Тип("Соответствие") Тогда
			ВнутрНомер=КоллекцияВнутрНомер.Получить("ext");
		КонецЕсли; 
		
		Если ВнутрНомер=ВнутреннийНомер Тогда
			ЗакрытьФормуВходящегоЗвонка(ИДТекущегоЗвонка);
			Состояние="Завершен";
			ИДТекущегоЗвонка="";
			//ЗакрытьФормуОповещения();
		Иначе
			//ОбновитьСтатусВнутреннегоНомера(ВнутрНомер,"online");
		КонецЕсли; 
		
	Исключение
		//Если Отладка Тогда
		//	Сообщить(ОписаниеОшибки());
		//КонецЕсли; 
	КонецПопытки; 

КонецФункции
 
&НаКлиенте
Функция ОбработкаЗавершенияЗвонкаГруппы_Phonet(Данные)
	
КонецФункции

&НаКлиенте
Функция ОбработкаЗавершенияЗвонка_Phonet(Данные)

	Попытка
		
		МассивДанных=Данные.Получить("calls");
		Если Не ТипЗнч(МассивДанных)=Тип("Массив") Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		Для каждого ЭлементМассива Из МассивДанных Цикл
		
			ИД=ЭлементМассива.Получить("parentUuid");
			
			СтрТекущиеСобытия=ПолучитьСтрокуСобытия_Phonet(ИД,Ложь);
			Если СтрТекущиеСобытия=Неопределено Тогда
				Продолжить;
			КонецЕсли; 
		
			Направление=ЭлементМассива.Получить("lgDirection");
			Если Направление=1 Тогда
				Продолжить;
			КонецЕсли;
			
			Источник=ЭлементМассива.Получить("caller");
			Если Не ТипЗнч(Источник)=Тип("Соответствие") Тогда
				Продолжить;
			КонецЕсли; 
			Приемник=ЭлементМассива.Получить("callee");
			Если Не ТипЗнч(Приемник)=Тип("Соответствие") Тогда
				Продолжить;
			КонецЕсли; 
			
			ВнутрНомер=Источник.Получить("num");
			Номер=Приемник.Получить("num");
			Если Направление=4 Тогда
				Номер=Источник.Получить("num");
				ВнутрНомер=Приемник.Получить("num");
			КонецЕсли;
			
			Если ВнутрНомер=ВнутреннийНомер Тогда
				Состояние="Завершен";
				ИДЗвонка="";
				//ЗакрытьФормуОповещения();
				ЗакрытьФормуВходящегоЗвонка(ИД);			
				
			КонецЕсли; 
			
			//ОбновитьСтатусВнутреннегоНомера(ВнутрНомер,"online");
			ТекущиеСобытия_Phonet.Удалить(СтрТекущиеСобытия);
			
		КонецЦикла; 
		
	Исключение
		//Если Отладка Тогда
		//	Сообщить(ОписаниеОшибки());
		//КонецЕсли; 
	КонецПопытки; 

КонецФункции
 
&НаКлиенте
Функция ОбработкаСобытийREST_Phonet(СобытиеПакета, ДанныеПакета, Маркер="")
	
	ДанныеСобытия = Base64Раскодировать(ДанныеПакета);
	
	Данные = СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия,Истина);
		
	// json не прошел валидацию
	Если Данные=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ФлагAPI=Истина;
	
	// обработка сообщений об ошибках от API
	Если ТипЗнч(Данные)=Тип("Соответствие") Тогда
	
		Статус=Данные.Получить("error");
		Если Не Статус=Неопределено Тогда
			
			СтатусОшибки=ИнфоОшибок.Получить(Статус);
			Если СтатусОшибки=Неопределено Тогда
				СтатусОшибки=Статус;
			КонецЕсли; 
			
			ТекстОшибки=ИнфоОшибок.Получить(Данные.Получить("message"));
			Если ТекстОшибки=Неопределено Тогда
				ТекстОшибки=Данные.Получить("message");
			КонецЕсли; 
			ПоказатьОповещениеПользователя(СтатусОшибки,,ТекстОшибки);
		
		КонецЕсли; 
	
	КонецЕсли; 
	
	// определение имени события
	Событие=СтрЗаменить(СобытиеПакета,Схема+ДоменAPI,"");
	ПозицияПараметров=Найти(Событие,"?");
	Если ПозицияПараметров>0 Тогда
		Событие=Лев(Событие,ПозицияПараметров-1);
	КонецЕсли; 
	
	Если Событие="/rest/users" Тогда
		
		// список внутренних номеров
		ОбработкаВнутренниеНомера_Phonet(Данные);
		
	ИначеЕсли Найти(Событие,"/rest/calls/company.api")>0 Тогда
		
		// история
		ОбработкаИсторияАТС_Phonet(Данные, Маркер);
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Функция ОбработкаВнутренниеНомера_Phonet(Данные)

	Если Не ЗначениеЗаполнено(Данные) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ДанныеСобытия=СофтФонКлиентСервер.ПолучитьДанныеJSON(Данные,Истина);
	
	Если Не ТипЗнч(ДанныеСобытия)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ВнутренниеНомера_Phonet.Очистить();
	
	Для каждого ЭлементСотрудник Из ДанныеСобытия Цикл
		
		Если Не ТипЗнч(ЭлементСотрудник)=Тип("Соответствие") Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		Номер=ЭлементСотрудник.Получить("ext");
		Если Не Номер=ВнутреннийНомер Тогда
			СтрВнутренниеНомера=ВнутренниеНомера_Phonet.Добавить();
			СтрВнутренниеНомера.ИД=Формат(ЭлементСотрудник.Получить("id"),"ЧГ=0");
			СтрВнутренниеНомера.Номер=Номер;
			СтрВнутренниеНомера.Почта=ЭлементСотрудник.Получить("email");
			СтрВнутренниеНомера.Имя=ЭлементСотрудник.Получить("displayName");
			СтрВнутренниеНомера.Статус="online";
			СтрВнутренниеНомера.ИндексСтатуса=ПолучитьИндексСтатуса_Phonet(СтрВнутренниеНомера.Статус);
		Иначе
			СтатусТелефона=Истина;
		КонецЕсли; 
		
	КонецЦикла;
	
	ВнутренниеНомера_Phonet.Сортировать("ИндексСтатуса Убыв, Номер Возр");
	//ЗаполнитьПользователей();

КонецФункции

&НаКлиенте
Функция ПолучитьИндексСтатуса_Phonet(СтрокаСтатуса)

	Результат = СтатусыНомеров.Получить(СтрокаСтатуса);
	Если Результат=Неопределено Тогда
		Результат=0;
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ОбработкаИсторияАТС_Phonet(ДанныеСобытия, Маркер="")

	Если НЕ ЗначениеЗаполнено(ДанныеСобытия) Тогда
		Возврат Ложь;		
	КонецЕсли;
	
	Данные = ДанныеСобытия; //СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия, Истина);
	
	Если Не ТипЗнч(Данные)=Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	СтруктПараметры = Новый Структура;
	СтруктПараметры.Вставить("ВидАТС", ИДВАТС);
	СтруктПараметры.Вставить("ДатаЗапросаИстории", ТекущаяДата());
	СтруктПараметры.Вставить("Данные", Данные);
	//СтруктПараметры.Вставить("КоллекцияВнутрНомера", ПолучитьСоответствиеВнутреннихНомеров_Phonet());
	//СтруктПараметры.Вставить("КоллекцияЛинии", ПолучитьСоответствиеЛиний_Mango());
	
	ОбработкаИсторияАТСКлиент(СтруктПараметры);
	
КонецФункции

//////////////////// ПРОЦЕДУРЫ Simplit ОБЩИЕ /////////////////////////////

&НаКлиенте
Функция ПодключитьПанель_Simplit()
	
	ПанельRomHMac = Неопределено;
	ИмяМакетаБиблиотеки = "SIO_WS_ZIP";
	ИмяИсточникаСобытий = ИДВАТС;
	
	// попытка установить компоненту
	Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
	
	Если Не Результат Тогда
		
		// неудачно, возможно еще не устанавлена
		УстановитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки);
		Результат=ПодключитьВнешнююКомпоненту("ОбщийМакет."+ИмяМакетаБиблиотеки,ИмяИсточникаСобытий,ТипВнешнейКомпоненты.Native);
		
	КонецЕсли;
	
	Если Результат Тогда
		ПанельRomHMac=Новый("AddIn."+ИмяИсточникаСобытий+".SimplitIO-WS");
		ПанельRomHMac.ИсточникСобытия=ИмяИсточникаСобытий;
		ПанельRomHMac.РегулярноеВыражение=СофтФонКлиентСервер.Stringify("'service':'(simplit.io|"+ИмяИсточникаСобытий+")'");
	КонецЕсли; 
	
	ПодключенКАТС=ПанельRomHMac.Подключено;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция АвторизоватьсяНаSimplitIO()
	
	Пакет="{'service': 'simplit.io','data': {'action': 'auth','user': '"+СокрЛП(ЛогинSimplit)+"', 'key': '"+СокрЛП(ПарольSimplit)+"'}}";
	Пакет=СофтФонКлиентСервер.Stringify(Пакет);
	ПанельRomHMac.Отправить(Пакет);
		
КонецФункции

&НаКлиенте
Функция ОтправитьПакетSimplitIO(Пакет)

	Если Не ПанельRomHMac=Неопределено Тогда
		Если НЕ ПустаяСтрока(Пакет) Тогда
			ПанельRomHMac.Отправить(Пакет);
		КонецЕсли; 
	КонецЕсли; 

КонецФункции

&НаКлиенте
Процедура ПодключитьсяКСерверуSimplit()
	
	КоличествоВыполненныхПопытокПодключения = КоличествоВыполненныхПопытокПодключения + 1;
	
	Если КоличествоВыполненныхПопытокПодключения > 10 тогда
		Возврат;
	ИначеЕсли КоличествоВыполненныхПопытокПодключения > 2 Тогда
		Пауза(3);
	КонецЕсли;
	
	Если ПанельRomHMac=Неопределено Тогда
		ПодключенКАТС=Ложь;
		Возврат;
	КонецЕсли; 
	
	Если Не ПанельRomHMac.Подключено Тогда
		Если ЗначениеЗаполнено(ЛогинSimplit) Тогда
			Если НЕ ПанельRomHMac.Подключиться(ЛогинSimplit) Тогда
				//пробуем еще раз
				ПодключитьсяКСерверуSimplit();
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	ПодключенКАТС=ПанельRomHMac.Подключено;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаСобытийСервераSimplitOnPBX(Источник, ДанныеСобытия)

	JSON=СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия);
	Если JSON=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	// получение данных
	Сервис=""; Событие=""; Данные=""; Маркер=""; ИДОтвета="";
	JSON.Свойство("service",Сервис);
	JSON.Свойство("event",Событие);
	JSON.Свойство("data",Данные);
	JSON.Свойство("marker",Маркер);
	JSON.Свойство("response",ИДОтвета);
	
	// проверки
	Если Не ЗначениеЗаполнено(Сервис) Тогда
		Возврат Ложь;
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(Событие) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Данные) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	// json не прошел валидацию
	Если Не ТипЗнч(JSON)=Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если Сервис="simplit.io" Тогда
		//СОБЫТИЯ ОТ СЕРВЕРА SIMPLIT
		Если Событие="connection" Тогда
			
			//отправляем запрос на авторизацию на сервере Simplit
			Если НЕ ПанельRomHMac = Неопределено Тогда
				АвторизоватьсяНаSimplitIO();
				//Пакет="{'service': 'simplit.io','data': {'action': 'auth','user': '"+СокрЛП(ЛогинSimplit)+"', 'key': '"+СокрЛП(ПарольSimplit)+"'}}";
				//Пакет=СофтФонКлиентСервер.Stringify(Пакет);
				//ПанельRomHMac.Отправить(Пакет);
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
			
		ИначеЕсли Событие="auth" Тогда
			
			Результат=Ложь;
			Если Данные.status="allow" Тогда
				Результат=Истина;
				
				Если НЕ ПанельRomHMac = Неопределено Тогда
					Если Источник = "SimplitIO-WS.OnPBX" Тогда
						//отправляем запрос на авторизацию на сервере OnlinePBX
						
						ДанныеJSON=
						"{
						|'domain':'"+АдресАТС+"',
						|'key':'"+ПарольАТС+"',
						|'secure':true,
						|'port':8093
						|}";
						Пакет=СформироватьПакетOnPBX(ДанныеJSON,"connect","connect");
						ПанельRomHMac.Отправить(Пакет);
						ОтправитьЗапросНаПолучениеКлючаREST();
						
					КонецЕсли;
				КонецЕсли;				
			КонецЕсли; 
			Возврат Результат;		
			
		ИначеЕсли Событие="error" Тогда
			
			//получили ошибку от сервера Simplit
			ПоказатьОповещениеПользователя("Сервис: "+Сервис+" Ошибка: "+ДанныеСобытия);
			Возврат Ложь;
			
		КонецЕсли; 
		
	// события API OnlinePBX
	ИначеЕсли Сервис="onpbx" Тогда
		ОбработкаСобытийOnpbx(Событие,Данные);
	ИначеЕсли Сервис="onpbx-rest" Тогда
		ОбработкаСобытийOnpbxREST(Событие,Данные,Маркер);
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Функция ОбработкаСобытийСервераSimplitOther(Источник, ДанныеСобытия)

	JSON = СофтФонКлиентСервер.ПолучитьДанныеJSON(ДанныеСобытия, Истина);
	Если JSON = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	// получение данных
	Сервис=""; Событие=""; Данные=""; Маркер=""; ИДОтвета="";
	// получение данных
	Сервис=JSON.Получить("service");
	Событие=JSON.Получить("event");
	Данные=JSON.Получить("data");
	Маркер=JSON.Получить("marker");
	ИДОтвета=JSON.Получить("response");
	
	// проверки
	Если Не ЗначениеЗаполнено(Сервис) Тогда
		Возврат Ложь;
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(Событие) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Данные) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	// json не прошел валидацию
	Если Не ТипЗнч(JSON)=Тип("Соответствие") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если Сервис="simplit.io" Тогда
		//СОБЫТИЯ ОТ СЕРВЕРА SIMPLIT
		Если Событие="connection" Тогда
			
			//отправляем запрос на авторизацию на сервере Simplit
			Если НЕ ПанельRomHMac = Неопределено Тогда
				АвторизоватьсяНаSimplitIO();
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
			
		ИначеЕсли Событие = "too many connections" Тогда
			ПоказатьОповещениеПользователя("Ошибка: " + Сервис, , "Слишком много соединений");
			ПодключенКАТС = Ложь;
			Возврат Ложь;
			
		ИначеЕсли Событие="auth" Тогда
			
			Результат=Ложь;
			Если Данные.Получить("status")="allow" Тогда
				Результат=Истина;
								
				Если НЕ ПанельRomHMac = Неопределено Тогда
					Если Источник="SimplitIO-WS.megafon" ИЛИ Источник="SimplitIO-WS.domru" Тогда
						//запросим список пользователей онлайн
						ДанныеJSON="{'cmd':'accounts','token':'"+КлючAPI+"'}";
						Пакет=СформироватьПакетREST(ДанныеJSON,,,"accounts");
						ПанельRomHMac.Отправить(Пакет);
						
					ИначеЕсли Источник="SimplitIO-WS.uis" Тогда
						//запросим список внтуренних номеров и id
						ПолучитьСписокОператоров_UIS();
						//ИмяМетода="get.employees";
						//ДанныеJSON="{'jsonrpc':'2.0','id':'"+ИмяМетода+"','method':'"+ИмяМетода+"','params':{'access_token':'"+КлючAPI+"'}}";
						//Пакет=СформироватьПакетREST(ДанныеJSON,,,ИмяМетода);
						//ПанельRomHMac.Отправить(Пакет);
						ПолучитьСписокSIP_UIS();
						
					ИначеЕсли Источник="SimplitIO-WS.sipuni" Тогда
						СоединитьсяWSS();
						ПолучитьСписокОператоров_Sipuni();
						
					ИначеЕсли Источник="SimplitIO-WS.binotel" Тогда
						ПолучитьСписокОператоров_Binotel();
						ПолучитьСписокРингГрупп_Binotel();

					ИначеЕсли Источник="SimplitIO-WS.mango" Тогда
						ПолучитьСписокОператоров_Mango();
						ПолучитьСписокЛиний_Mango();
						
					ИначеЕсли Источник="SimplitIO-WS.phonet" Тогда
						Если Не ЗначениеЗаполнено(КлючСессии) Тогда
							ПолучитьКлючREST_Phonet();
						КонецЕсли;						
						ПолучитьСписокОператоров_Phonet();
	
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли; 
			Возврат Результат;
					
		ИначеЕсли Событие="error" Тогда
			
			//получили ошибку от сервера Simplit
			ПоказатьОповещениеПользователя("Сервис: "+Сервис+" Ошибка: "+ДанныеСобытия);
			Возврат Ложь;
			
		КонецЕсли; 
		
	ИначеЕсли Сервис="megafon" или Сервис="domru" Тогда
		//СОБЫТИЯ ОТ СЕРВЕРА ITooLabs (Megafon, Domru)
		ОбработкаСобытийITooLabs(Событие, Данные, Маркер, ИДОтвета);
	ИначеЕсли Сервис="uis" Тогда
		//СОБЫТИЯ ОТ СЕРВЕРА uis
		ОбработкаСобытийUis(Событие, Данные, Маркер, ИДОтвета);
	ИначеЕсли Сервис="sipuni" ИЛИ Сервис="sipuni-wss" Тогда
		//СОБЫТИЯ ОТ СЕРВЕРА sipuni
		ОбработкаСобытийSipuni(Событие, Данные, Маркер, ИДОтвета, Сервис);
	ИначеЕсли Сервис="binotel" Тогда
		//СОБЫТИЯ ОТ СЕРВЕРА binotel
		ОбработкаСобытийBinotel(Событие, Данные, Маркер, ИДОтвета);
	ИначеЕсли Сервис="mango" Тогда
		//СОБЫТИЯ ОТ СЕРВЕРА mango
		ОбработкаСобытийMango(Событие, Данные, Маркер, ИДОтвета);
	ИначеЕсли Сервис="phonet" Тогда
		//СОБЫТИЯ ОТ СЕРВЕРА phonet
		ОбработкаСобытийPhonet(Событие, Данные, Маркер, ИДОтвета);
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПодключениеКАТС() Экспорт
	
	//Если ПанельRomHMac = Неопределено Тогда
	//    ПодключенКАТС = Ложь;
	//    ЗаписатьСобытиеВЛог(1, "ПанельRomHMac = Неопределено", "ПанельRomHMac = Неопределено");
	//    УстановитьСтатусПользовательПодключен(ПодключенКАТС);
	//    Возврат;
	//КонецЕсли; 
	//
	//Если Не ПанельRomHMac.Подключено Тогда
	//    ЗаписатьСобытиеВЛог(1, "Не ПанельRomHMac.Подключено", "Не ПанельRomHMac.Подключено");
	//    Если ЗначениеЗаполнено(ЛогинSimplit) Тогда
	//        Если НЕ ПанельRomHMac.Подключиться(ЛогинSimplit) Тогда
	//            ЗаписатьСобытиеВЛог(1, "Не ПанельRomHMac.Подключиться", "Не ПанельRomHMac.Подключиться");    
	//        КонецЕсли;
	//    КонецЕсли; 
	//КонецЕсли;
	//
	//ПодключенКАТС = ПанельRomHMac.Подключено;
	//УстановитьСтатусПользовательПодключен(ПодключенКАТС);	
	
	// отправляем "легкий" запрос на АТС, который вызовет Connection Close со стороны компоненты, если нет подключения
	
	//Если ИспользуетсяROMHMAC Тогда 		
	//	Путь="user/get.json";		
	//	ДанныеJSON="''";
	//	Пакет = СформироватьПакетREST(ДанныеJSON,Путь);
	//	ПанельRomHMac.Отправить(Пакет);
	//	
	//ИначеЕсли ИспользуетсяSIOМегафон ИЛИ ИспользуетсяSIODomRu Тогда
	//	ДанныеJSON="{'cmd':'accounts','token':'"+КлючAPI+"'}";
	//	Пакет = СформироватьПакетREST(ДанныеJSON,,,"accounts");
	//	ПанельRomHMac.Отправить(Пакет);
	//	
	//ИначеЕсли ИспользуетсяSIOUIS Тогда 		
	//	ИмяМетода="get.sip_lines";
	//	ДанныеJSON="{'jsonrpc':'2.0','id':'"+ИмяМетода+"','method':'"+ИмяМетода+"','params':{'access_token':'"+КлючAPI+"'}}";
	//	Пакет=СформироватьПакетREST(ДанныеJSON,,,ИмяМетода);
	//	ПанельRomHMac.Отправить(Пакет);
	//	
	//ИначеЕсли ИспользуетсяSIOSipuni Тогда
	//	ПолучитьСписокОператоров_Sipuni();
	
	// #7883 добавлен новый функционал со стороны Simplit
	Если ИспользуетсяROMHMAC 
		ИЛИ ИспользуетсяSIOМегафон ИЛИ ИспользуетсяSIODomRu 
		ИЛИ ИспользуетсяSIOUIS ИЛИ ИспользуетсяSIOSipuni Тогда
		
		Пакет =
		"{
		|'service': 'simplit.io', 
		|'data': 
		|	{
		|		'action': 'command', 
		|		'command': 'ping'
		|	}
		|}";
		
		Пакет = СофтФонКлиентСервер.Stringify(Пакет);
		ПанельRomHMac.Отправить(Пакет);
	Иначе
		ОтключитьОбработчикОжидания("ПроверитьПодключениеКАТС");
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция СформироватьПакетWSS(ДанныеJSON,Метод="command")

	// проверка корректности переданных параметров
	Результат="";
	Если Не ЗначениеЗаполнено(Метод) Тогда
		//Если Отладка Тогда
		//	Сообщить("Не указана команда Realtime-запроса");
		//КонецЕсли; 
		Возврат Результат;
	КонецЕсли;
	
	Данные=СофтФонКлиентСервер.Stringify(ДанныеJSON);

	Пакет=
	"{
	|'service': '"+НРег(ИДВАТС)+"-wss', 
	|'data': 
	|	{
	|		'method': '"+Метод+"', 
	|		'data': "+Данные+"
	|	}
	|}";
	
	Результат=СофтФонКлиентСервер.Stringify(Пакет);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ОбработкаСобытийWebhooks(СобытиеПакета,ДанныеПакета,ИД)

	Метка="&label=routing";
	Если Найти(СобытиеПакета,Метка)=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РазделительПараметров="?";
	ПозицияПараметров=Найти(СобытиеПакета,РазделительПараметров);
	Если ПозицияПараметров=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	СтрПараметров=Сред(СобытиеПакета,ПозицияПараметров+1);
	
	Данные=СофтФонКлиентСервер.URL2JSON(СтрПараметров,Истина);

	// json не прошел валидацию
	Если Данные=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Метка=Данные.Получить("label");
	
	Если Метка="routing" Тогда
		
		//пока не используем
		// маршрутизация на ответственного
		//Если ФлагМаршрутизация Тогда
		//	Номер=Данные.Получить("fromnum");			
		//	МаршрутизацияНаОтветственногоWebhooks(ИД,Номер);
		//КонецЕсли; 
		
	КонецЕсли;
	
КонецФункции
 
//////////////////// ПРОЦЕДУРЫ Рарус СофтФон  /////////////////////////////

&НаКлиенте
Функция УстановитьПанель_РарусСофтФон()
	
		// Новый алгоритм получения пути установки
	Оболочка = Новый COMОбъект("WScript.Shell");
	КаталогДанныхПользователя = Оболочка.ExpandEnvironmentStrings("%APPDATA%");
	КаталогСофтфона = КаталогДанныхПользователя + "\1C-Rarus\1C-Rarus SoftPhone\";
	ПроверитьФайл = Новый Файл(КаталогСофтфона);
	Если НЕ ПроверитьФайл.Существует() Тогда
		ПоказатьПредупреждение(,Нстр("ru = 'Не установлена панель Софтфона!'"));
		Возврат Ложь;
	КонецЕсли;					
	ФайлСофтфона = Новый ЧтениеТекста(КаталогСофтфона + "SoftPhoneClient.ini");
	ТекстФайла = ФайлСофтфона.Прочитать(1000);
	
	НомерСимволаПутиКПанели = Найти(ТекстФайла, "[ClientPath]");
	// проверка
	Если НомерСимволаПутиКПанели = 0 Тогда
		ПоказатьПредупреждение(,Нстр("ru = 'Не удалось найти установленную панель Софтфона. Пожалуйста, переустановите панель!'"));
		Возврат Ложь;
	КонецЕсли;		
	ТекНомерСимвола = НомерСимволаПутиКПанели + 12;
	ПутьККомпоненте = "";
	Пока Сред(ТекстФайла,ТекНомерСимвола,1) <> "[" Цикл
		ПутьККомпоненте = ПутьККомпоненте + Сред(ТекстФайла,ТекНомерСимвола,1);
		ТекНомерСимвола = ТекНомерСимвола + 1;
	КонецЦикла;		
	
	СистемнаяИнформация = Новый СистемнаяИнформация;	
	ТипСистемы = СистемнаяИнформация.ТипПлатформы;
	Если ТипСистемы = ТипПлатформы.Linux_x86_64 
		ИЛИ ТипСистемы = ТипПлатформы.MacOS_x86_64 
		ИЛИ ТипСистемы = ТипПлатформы.Windows_x86_64 Тогда
		// 64 бита
		ИмяКаталогаКомпоненты = "x64";
	Иначе
		// 32 бита
		ИмяКаталогаКомпоненты = "x32";
	КонецЕсли;
	
	ФайлСофтфона.Закрыть();	

	ПутьККомпоненте = СокрЛП(ПутьККомпоненте);
	ПутьККомпоненте = СтрЗаменить(ПутьККомпоненте, "SPPanel=", "");
	ПутьККомпоненте = СтрЗаменить(ПутьККомпоненте, "SPPanel3.exe", "NativeComponent\" + ИмяКаталогаКомпоненты + "\SP_ClientNative.dll");
	// +Дополнительная проверка на нужную версию СФ
	ПроверитьФайл = Новый Файл(ПутьККомпоненте);
	Если НЕ ПроверитьФайл.Существует() Тогда
		ПоказатьПредупреждение(,Нстр("ru = 'Не найдена компонента для работы с Софтфоном. Версия панели Софтфона устарела!'"));
		Возврат Ложь;
	КонецЕсли;				
	КудаКопировать = КаталогВременныхФайлов() + "SP_ClientNative_"+ ИмяКаталогаКомпоненты + ".dll";
	Попытка
		КопироватьФайл(ПутьККомпоненте, КудаКопировать); 
	Исключение
	КонецПопытки;		
	
	РезультатПодключения = ПодключитьВнешнююКомпоненту(КудаКопировать, "SP_ClientNative", ТипВнешнейКомпоненты.Native);
	Если НЕ РезультатПодключения Тогда 
		ПоказатьПредупреждение(, НСтр("ru='Не удалось подключить компоненту Софтфона! Проверьте правильность её установки и наличия на диске.'"), 5);
		Возврат Ложь; 
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПодключитьПанель_РарусСофтФон()
	
	ПанельСофтФон = Неопределено;
	Результат = УстановитьПанель_РарусСофтФон();
	
	ПодключенКАТС = Результат;
	Если НЕ Результат Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Запускаем внешнюю панель
	Попытка
		ПанельСофтФон	= Новый("AddIn.SP_ClientNative.SPPanelNative");
		ПанельСофтФон.RegistrationEvents("2=Карточка клиента;");
		Результат = Истина;
	Исключение
		ПанельСофтФон = Неопределено;
		Результат =  Ложь;
	КонецПопытки;
	
	Результат =  Истина;
	
	ПодключенКАТС = Результат;
	Возврат Результат;
	
КонецФункции

// Функция получает описание объекта из модели JSON 
//
// Параметры:
//  СтрJSON	- Строка	- Описание объекта в виде модели json
//
// Возвращаемое значение:
//  Значение	- Соответствие	- Соответствие свойств и значений объекта 
//
Функция UnJSON(СтрJSON) Экспорт 
	СтрJSON	= ЗаменитьНедопустимыеСимволыXML(СтрJSON);	
	Значение = "";
	Если ПолучитьЗначениеJSON(СтрJSON, Значение) = 0 Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции // сфпUnJSON()

// Функция заменяет недопустимые символы в XML-строке на заданные символы
//
// Параметры:
//   Текст			– Строка	– Строка, в которой требуется выполнить замену недопустимых символов.
//   СимволЗамены	– Строка	– Строка, на которую требуется выполнить замену недопустимого символа в XML-строке
// 
//  Возвращаемое значение:
//    Строка - Строка, полученная заменой недопустимых символов в XML-строке.
//
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") Экспорт
	ПозицияНачала = 1;
	Пока Истина Цикл
		Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
		Если Позиция = 0 Тогда
			Прервать;
		КонецЕсли;
		Если Позиция > 1 Тогда
			НедопустимыйСимвол = Сред(Текст, Позиция - 1, 1);
			Если НайтиНедопустимыеСимволыXML(НедопустимыйСимвол) > 0 Тогда
				Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
			КонецЕсли;
		КонецЕсли;
		НедопустимыйСимвол = Сред(Текст, Позиция, 1);
		Если НайтиНедопустимыеСимволыXML(НедопустимыйСимвол) > 0 Тогда
			Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
		КонецЕсли;
		ПозицияНачала = Позиция + 1;
	КонецЦикла;
	Возврат Текст;
КонецФункции // сфпЗаменитьНедопустимыеСимволыXML()

// Вспомогательная функция перевода шестнацатиричного числа в десятичное 
//
// Параметры:
//	Hex	- Строка	- Число в шестнадцатиричном представлении
//
// Возвращаемое значение:
//	Число	- Десятичное число
//
Функция Hex2Число(Hex) 
	Стр	= ВРег(СокрЛП(Hex));
	Dec	= 0;
	Для Х = 1 По СтрДлина(Стр) Цикл
		Dec	= Dec + Найти("123456789ABCDEF", Сред(Стр, Х, 1)) * Pow(16, СтрДлина(Стр) - Х);
	КонецЦикла;
	Возврат Dec;
КонецФункции

// Функция осуществляет непосредственный разбор JSON 
//
// Параметры:
//  СтрJSON		- Строка		- Описание объекта в виде модели json
//  Значение	- Соответствие	- Соответствие свойств и значений объекта 
//	Позиция		- Число			- Позиция в описании
//	Ключ		- Строка		- Ключ соответствия
//
// Возвращаемое значение:
//  Число	- Позиция в описании
//
Функция ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция = 1, Ключ = "") Экспорт
	Кавычка			= "";
	ЗначениеВСтроке	= "";
	Кавычек			= 0;
	Комментарий		= Ложь;
	Строка			= Ложь;
	Пока Позиция <= СтрДлина(СтрJSON) Цикл
		ХХ		= Сред(СтрJSON, Позиция, 2);
		Х		= Лев(ХХ,1);
		Позиция	= Позиция + 1;
		Если Х > " " ИЛИ Строка Тогда // Отсекаем всякий хлам
			Если Комментарий Тогда
				// Это комментарий. Крутимся в цикле пока не встретится конец комментария
				Если ХХ = "*/" Тогда
					// Комментарий закончился
					Комментарий	= Ложь;
					Позиция		= Позиция + 1;
				КонецЕсли;
			ИначеЕсли Х = "\" Тогда
				Позиция	= Позиция + 1;
				ХХ		= ВРег(ХХ);
				Если ХХ = "\""" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + """";
				ИначеЕсли ХХ = "\\" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + "\";
				ИначеЕсли ХХ = "\/" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + "/";
				ИначеЕсли ХХ = "\B" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символ(8);
				ИначеЕсли ХХ = "\F" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ПФ; // Перевод формы (страницы)
				ИначеЕсли ХХ = "\N" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ПС; // Перевод строки
				ИначеЕсли ХХ = "\R" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ВК; // Возврат каретки
				ИначеЕсли ХХ = "\T" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символы.ВТаб; // Символ вертикальной табуляции
				ИначеЕсли ХХ = "\U" Тогда
					ЗначениеВСтроке	= ЗначениеВСтроке + Символ(Hex2Число(Сред(СтрJSON, Позиция, 4))); // Шестнадцатиричное число
					Позиция = Позиция + 4;
				КонецЕсли;
			ИначеЕсли Строка Тогда
				// Если строка не закончилась, то пропускаем управляющие символы
				Если Х = Кавычка Тогда
					//Закончилась строка
					Строка	= Ложь;
					Кавычек	= Кавычек + 1;
				Иначе
					ЗначениеВСтроке	= ЗначениеВСтроке + Х;
				КонецЕсли;
			ИначеЕсли ХХ = "/*" Тогда
				// Начался комментарий
				Комментарий	= Истина;
				Позиция		= Позиция + 1;
			ИначеЕсли Найти("""'{}[]:,", Х) > 0 Тогда
				Если (Х = """") ИЛИ (Х = "'") Тогда
					// Началась строка
					// Строка - коллекция нуля или больше символов Unicode, заключенная в
					// двойные кавычки, используя "\" в качестве символа экранирования.
					// Символ представляется как односимвольная строка.
					// Похожий синтаксис используется в C и Java.
					Строка	= Истина;
					Кавычка	= Х;
					Кавычек	= Кавычек + 1;
				ИначеЕсли Х = "{" Тогда
					// Начался объект
					// Объект - неупорядоченный набор пар ключ/значение.
					// Объект начинается с "{" и заканчивается "}".
					// Каждое имя сопровождается ":", пары ключ/значение разделяются ",".
					вОбъект	= Новый Соответствие;
					Пока Истина Цикл
						// Получим ключ и значение
						Ключ	= "";
						Режим	= ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция, Ключ);
						// 0 - есть значение и не конец объекта (запятая)
						// 1 - есть значение и конец объекта
						// 2 - нет значения и не конец объекта (запятая)
						// 3 - нет значения и конец объекта
						Если Режим = 0 Тогда
							вОбъект.Вставить(Ключ, Значение);
						ИначеЕсли Режим = 1 Тогда
							вОбъект.Вставить(Ключ, Значение);
							Прервать;
						ИначеЕсли Режим = 3 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Значение	= вОбъект;
					Возврат 0;
				ИначеЕсли Х = "[" Тогда
					// Начался массив
					// Массив - упорядоченная коллекция значений.
					// Массив начинается с "[" и заканчивается "]".
					// Значения разделены ",".
					Массив	= Новый Массив;
					Пока Истина Цикл
						Режим	= ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция);
						// 0 - есть значение и не конец массива (запятая)
						// 1 - есть значение и конец массива
						// 2 - нет значения и не конец массива (запятая)
						// 3 - нет значения и конец массива
						Если Режим = 0 Тогда
							Массив.Добавить(Значение);
						ИначеЕсли Режим = 1 Тогда
							Массив.Добавить(Значение);
							Прервать;
						ИначеЕсли Режим = 3 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Значение	= Массив;
					Возврат 0;
				ИначеЕсли (Х = "]") ИЛИ (Х = "}") Тогда
					// Закончился массив/объект
					Если (ЗначениеВСтроке = "") И (Кавычек = 0) Тогда
						Возврат 3; // Нет значения и конец массива/объекта
					Иначе
						Значение	= ПолучитьЗначениеИзСтроки(ЗначениеВСтроке,Кавычек);
						Возврат 1; // Есть значение и конец массива/объекта
					КонецЕсли;
				ИначеЕсли Х = ":" Тогда
					Ключ	= ЗначениеВСтроке;
					Возврат ПолучитьЗначениеJSON(СтрJSON, Значение, Позиция);
				Иначе
					// Запятая
					Прервать;
				КонецЕсли;
			Иначе
				ЗначениеВСтроке	= ЗначениеВСтроке + Х;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Кавычек > 0 Тогда
		Значение = ЗначениеВКавычках(ЗначениеВСтроке);
	Иначе
		Если ЗначениеВСтроке = "" Тогда
			Возврат 2;
		Иначе
			Значение	= ЗначениеБезКавычек(ЗначениеВСтроке);
		КонецЕсли;
	КонецЕсли;
	Возврат 0;
КонецФункции 

// Функция получает значение из строки
//
// Параметры:
//	ЗначениеВСтроке	- Строка	- Строка, содержащая значение
//	Кавычек			- Число		- Количество кавычек в строке
//
// Возвращаемое значение:
//	Произвольный	- Значение из строки
//
Функция ПолучитьЗначениеИзСтроки(ЗначениеВСтроке, Кавычек)
	Если ЗначениеВСтроке = "" Тогда
		Возврат Неопределено;
	ИначеЕсли Кавычек > 0 Тогда
		Возврат ЗначениеВКавычках(ЗначениеВСтроке);
	Иначе
		Возврат ЗначениеБезКавычек(ЗначениеВСтроке);
	КонецЕсли;
КонецФункции

// Функция получает значение из строки без кавычек
//
// Параметры:
//	ЗначениеВСтроке	- Строка	- Строка, содержащая значение
//
// Возвращаемое значение:
//	Строка	- Значение из строки
//
Функция ЗначениеВКавычках(ЗначениеВСтроке)
	Возврат ЗначениеВСтроке;
КонецФункции 

// Функция получает значение из строки с кавычками
//
// Параметры:
//	ЗначениеВСтроке	- Строка	- Строка, содержащая значение
//
// Возвращаемое значение:
//	Произвольный	- Значение из строки
//
Функция ЗначениеБезКавычек(ЗначениеВСтроке)
	// Это число, булево или null.
	// Хотя здесь могут быть и строки. Например: {Code:123}
	Стр = ВРег(ЗначениеВСтроке);
	Если Стр = "TRUE" Тогда
		Возврат Истина;
	ИначеЕсли Стр = "FALSE" Тогда
		Возврат Ложь;
	ИначеЕсли Стр = "NULL" Тогда
		Возврат Неопределено;
	КонецЕсли;
	// Пробежимся по предполагаемому "числу"
	Экспонента	= Ложь;
	ХХ			= " ";
	Для Индекс = 1 По СтрДлина(Стр) Цикл
		Х = Сред(Стр, Индекс, 1);
		Если Найти("0123456789.+-", Х) Тогда
			ХХ = ХХ + Х;
		ИначеЕсли Х = "E" Тогда
			#Если ВебКлиент Тогда
				Возврат ЗначениеВСтроке;
			#Иначе
				Экспонента = Истина;
				УУ = XMLЗначение(Тип("Число"),ХХ);
				ХХ = " ";
			#КонецЕсли
		Иначе
			// Это не число, а строка
			Возврат ЗначениеВСтроке;
		КонецЕсли;
	КонецЦикла;
	#Если ВебКлиент Тогда
		Попытка
			ХХ = Число(ХХ);
		Исключение
		КонецПопытки;	
	#Иначе
		ХХ = XMLЗначение(Тип("Число"), ХХ);
		Если Экспонента Тогда
			ХХ = УУ * Pow(10, ХХ);
		КонецЕсли;
	#КонецЕсли
	Возврат ХХ;
КонецФункции


///////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПодключитьсяКАТС()
	
	ПодключенКАТС = Ложь;
	
	Если ИспользуетсяROMAsterisk Тогда

		ПодключитьПанель_Asterisk();
		
	ИначеЕсли ИспользуетсяROMHMAC Тогда
		
		//справка: общий принцип подключения
		//скачиваем и подключаем библиотеку (панель) Simplit OnlinePBX
		//создаем внешнюю компоненту Simplit OnlinePBX которая будет отлавливать события OnlinePBX Simplit
		//Подключаем библиотеку к серверу Simplit и слушаем события
		//Если приходит событие Авторизации - отправляем логин\пароль авторизации, после прохождения авторизации к нам начинают падать события АТС OnlinePBX
		//Параллельно создаем внешнюю компоненту (панель), которая подключится к серверу Simplit и создаст ХЭШ для авторизации
		
		ПодключитьПанель_OnlinePBX(); //установили и включили компоненту
		ПодключитьсяКСерверуSimplit(); //подключидлисьподключились к серверу Simplit
		ПодключитьПанель_SimplitХэш(); //установили и включили компоненту
		
	ИначеЕсли ИспользуетсяSIOМегафон ИЛИ ИспользуетсяSIODomRu Тогда
		
		//справка: общий принцип подключения
		//скачиваем и подключаем библиотеку (панель) Simplit
		//создаем внешнюю компоненту Simplit которая будет отлавливать события 
		//Подключаем библиотеку к серверу Simplit и слушаем события
		
		ПодключитьПанель_ITooLabs();
		ПодключитьсяКСерверуSimplit(); //подключились к серверу Simplit
		
	ИначеЕсли ИспользуетсяSIOUIS Тогда
		
		//справка: общий принцип подключения
		//скачиваем и подключаем библиотеку (панель) Simplit
		//создаем внешнюю компоненту Simplit UIS которая будет отлавливать события UIS Simplit
		//Подключаем библиотеку к серверу Simplit и слушаем события
		
		ПодключитьПанель_UIS();
		ПодключитьсяКСерверуSimplit(); //подключились к серверу Simplit
		
	ИначеЕсли ИспользуетсяSIOSipuni Тогда
		
		//справка: общий принцип подключения
		//скачиваем и подключаем библиотеку (панель) Simplit
		//создаем внешнюю компоненту Simplit UIS которая будет отлавливать события UIS Simplit
		//Подключаем библиотеку к серверу Simplit и слушаем события
		
		ПодключитьПанель_Sipuni();
		ПодключитьсяКСерверуSimplit(); //подключились к серверу Simplit

	ИначеЕсли ИспользуетсяSIOBinotel 
		ИЛИ ИспользуетсяSIOMango 
		ИЛИ ИспользуетсяSIOPhonet Тогда
		
		//справка: общий принцип подключения
		//скачиваем и подключаем библиотеку (панель) Simplit
		//создаем внешнюю компоненту Simplit, которая будет отлавливать события Simplit
		//Подключаем библиотеку к серверу Simplit и слушаем события
		
		ПодключитьПанель_Simplit();
		ПодключитьсяКСерверуSimplit(); //подключились к серверу Simplit
		
	ИначеЕсли СофтФон.ИспользуютсяСофтФон() Тогда
		
		//справка: общий принцип подключения
		//устанавливаем сервер Рарус СофтФон
		//устанавилаем клиент Рарус СофтФон, подключаем к серверу и подколчаем к SIP. Указываем что основной канал - SIP
		//подключаем компоненту и слушаем внешние события
		
		ПодключитьПанель_РарусСофтФон();
		
	КонецЕсли;
	
	Если ПодключенКАТС И ИнтервалПроверкиПодключенияКАТС > 0 Тогда
	    ОтключитьОбработчикОжидания("ПроверитьПодключениеКАТС");
		ПодключитьОбработчикОжидания("ПроверитьПодключениеКАТС", ИнтервалПроверкиПодключенияКАТС, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИнтервалЗапросаИсторииЗвонков()
	Возврат ПараметрыСеанса.ИнтервалЗапросаИсторииЗвонков;
КонецФункции

&НаКлиенте
Процедура Подключиться(Команда)
	
	#Если ВебКлиент Тогда
		ПоказатьОповещениеПользователя("Компоненты работы с АТС не доступны в web-клиенте");
		Возврат;
	#КонецЕсли	
	
	ПодключенКАТС = Ложь;
	КоличествоВыполненныхПопытокПодключения = 0;
	
	Если ПараметрыСеансаТелефонияСтрана().Пустая() Тогда
		ПанельRomAsterisk = Неопределено;
		ПанельRomHMac = Неопределено;
		УстановитьСтатусПользовательПодключен(Ложь);
		ПоказатьПредупреждение(,"В настройках программы не указана страна (в разделе ""Основные""). Использование телефонии не доступно.");
		Возврат;
	КонецЕсли;
	
	//ВнутреннийНомер = СофтФон.ПолучитьВнутреннийНомерПользователя();
	//ЛогинТелефонии  = СофтФон.ПолучитьЛогинТелефонииПользователя();
	
	ЛогинАТС = СофтФон.ПолучитьЛогинАдминистратораАТС();
	ПарольАТС = СофтФон.ПолучитьПарольАдминистратораАТС();
	АдресАТС = СофтФон.ПолучитьТелефонияАдресСервера();
	
	Если СофтФон.ТекущемуПользователюРазрешеноИспользованиеIPТелефонии() Тогда
		ПодключитьсяКАТС();
		УстановитьСтатусПользовательПодключен(ПодключенКАТС);
	Иначе
		ПоказатьПредупреждение(,"Для использования софтфона у вас должно быть соответствующее право и внутренний номер SIP");
		ПанельRomAsterisk = Неопределено;
		ПанельRomHMac = Неопределено;
		УстановитьСтатусПользовательПодключен(Ложь);
	КонецЕсли;
	
КонецПроцедуры

////////////////////процедуры работы с историей  звонков
&НаСервере
Функция ТелефонияДатаПоследнегоЗапросаИстории()
	Возврат Константы.ТелефонияДатаНачальногоЗапросаИсторииЗвонков.Получить();
КонецФункции

&НаКлиенте
Процедура АвтоматическиЗапроситьИсториюЗвонков()
	
	ДатаНачала = ТелефонияДатаПоследнегоЗапросаИстории();
	Если ДатаНачала = Дата(1, 1, 1) Тогда
		ДатаНачала =  НачалоДня(ТекущаяДата());
	КонецЕсли;
	ДатаОкончания = ТекущаяДата();
	
	Если ДатаНачала + ИнтервалЗапросаИсторииЗвонков() <= ТекущаяДата() Тогда
		ПолучитьИсторию(ДатаНачала, ДатаОкончания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИсторию(Дата1,Дата2)
	
	СмещениеЧасовогоПоясаАТС = Софтфон.СмещениеЧасовогоПоясаАТС();
	Если СмещениеЧасовогоПоясаАТС <> 0 Тогда
		Дата1 = Дата1 - СмещениеЧасовогоПоясаАТС;		
		Дата2 = Дата2 - СмещениеЧасовогоПоясаАТС;
	КонецЕсли;
	
	//#6061
	// по истории АТС есть "проблема". примерно так: в 18:52 поступил звонок, например в 18:55 в 1с производится запрос истории, 
	// который фиксирует время последнего успешного получения данных на 18:54 (когда был последний звонок). 
	// Звонок 18:52 длился 10 минут и завершился в 19:02 и только после этого попал в историю на стороне АТС (со временем 18:52). 
	// в следующий раз 1с при запросе запрашивает звонки с 18:54. В итоге звонок 18:52 в истории 1с не появляется.
	// Пока следующее решение: запрашивать 3 часа назад от последнего успешного
	Дата1 = Дата1 - 3*60*60;
	
	Пакет = "";
	Пакет2 = "";
	
	Если ИспользуетсяSIOМегафон ИЛИ ИспользуетсяSIODomRu Тогда
		
		СтрДата1="";
		Если ЗначениеЗаполнено(Дата1) Тогда
			UTCДата1=ПолучитьДатуUTC(Дата1);
			СтрДата1=",'start':'"+UTCДата1+"'";
		КонецЕсли;
		
		СтрДата2="";
		Если ЗначениеЗаполнено(Дата2) Тогда
			UTCДата2=ПолучитьДатуUTC(Дата2);
			СтрДата2=",'end':'"+UTCДата2+"'";
		КонецЕсли;
		
		СтрПериод=",'period':'this_month'";
		Если ЗначениеЗаполнено(СтрДата1) И ЗначениеЗаполнено(СтрДата2) Тогда
			СтрПериод=СтрДата1+СтрДата2;
		КонецЕсли; 
		
		МаксСтрокПорции = 999;
		СтрЛимит=",'limit':"+Формат(МаксСтрокПорции,"ЧГ=0");
		
		ДанныеJSON="{'cmd':'history','token':'"+КлючAPI+"'"+СтрПериод+СтрЛимит+"}";
		Пакет=СформироватьПакетREST(ДанныеJSON,,"get","history");

	ИначеЕсли ИспользуетсяSIOUIS Тогда
		//2018-10-26
		//КлючAPI = СофтФон.ПолучитьПарольАдминистратораАТС();
		Маркер="history";
		//Маркер="api.history.load";

		
		ФорматДаты="ДФ='гггг-ММ-дд ЧЧ:мм:сс'";
		Если Не ЗначениеЗаполнено(Дата1) Тогда
			Дата1=НачалоДня(ТекущаяДата());
		КонецЕсли;
		СтрДата1=Формат(Дата1,ФорматДаты);
		
		Если Не ЗначениеЗаполнено(Дата2) Тогда
			Дата2=КонецДня(ТекущаяДата());
		КонецЕсли;
		СтрДата2=Формат(Дата2,ФорматДаты);
		
		ИмяМетода="get.calls_report";
		//ИмяМетода="get.call_legs_report";
		
		СтрСортировка="'sort':[{'field':'start_time','order':'asc'}]";
		СтрПоля="'fields':['source','communication_id','communication_type','start_time','finish_time','finish_reason','direction','is_lost','virtual_phone_number','contact_phone_number','employees','last_answered_employee_id','last_talked_employee_id','total_duration','total_wait_duration','clean_talk_duration','call_records']";
		ДанныеJSON="{'jsonrpc':'2.0','id':'"+ИмяМетода+"','method':'"+ИмяМетода+"','params':{'access_token':'"+КлючAPI+"','date_from':'"+СтрДата1+"','date_till':'"+СтрДата2+"',"+СтрСортировка+","+СтрПоля+"}}";
		
		Пакет=СформироватьПакетREST(ДанныеJSON,,,Маркер);
		//ОтправитьПакет(Пакет);

	ИначеЕсли ИспользуетсяSIOSipuni Тогда
		Маркер="api.history.load";
		ФорматДаты="ДФ=дд.ММ.гггг";
		Если Не ЗначениеЗаполнено(Дата1) Тогда
			Дата1=НачалоДня(ТекущаяДата());
		КонецЕсли;
		СтрДата1=Формат(Дата1,ФорматДаты);
		
		Если Не ЗначениеЗаполнено(Дата2) Тогда
			Дата2=КонецДня(ТекущаяДата());
		КонецЕсли;
		СтрДата2=Формат(Дата2,ФорматДаты);
		
		ТипЗвонка="0"; СтатусЗвонка="0"; НомерСхемы="";
		НомерОткуда=""; НомерКуда=""; НомерОтветил="";
		anonymous="1"; ТолькоНовыеКлиенты="0";
		
		ДанныеJSON=
		"'user':'"+НомерВАТС+"',"+
		"'from':'"+СтрДата1+"',"+
		"'to':'"+СтрДата2+"',"+
		"'type':'"+ТипЗвонка+"',"+
		"'state':'"+СтатусЗвонка+"',"+
		"'tree':'"+НомерСхемы+"',"+
		"'fromNumber':'"+НомерОткуда+"',"+
		"'toNumber':'"+НомерКуда+"',"+
		"'toAnswer':'"+НомерОтветил+"',"+
		"'anonymous':'"+anonymous+"',"+
		"'firstTime':'"+ТолькоНовыеКлиенты+"'";
		
		ДанныеJSON="{"+ДанныеJSON+"}";
		Подпись=ПодписатьПакет_Sipuni(ДанныеJSON);
		ДанныеJSON=СортироватьПоляПакета_Sipuni(ДанныеJSON);
		ДанныеJSON="{"+ДанныеJSON+",'hash':'"+Подпись+"'}";
		ДанныеJSON=СофтФонКлиентСервер.Stringify(ДанныеJSON);
		
		Пакет=СформироватьПакетREST(ДанныеJSON,"/statistic/export","post",Маркер);
		
	ИначеЕсли ИспользуетсяSIOBinotel Тогда		
				
		Если Не ЗначениеЗаполнено(Дата1) Тогда
			Дата1=НачалоДня(ТекущаяДата());
		КонецЕсли;
		СтрДата1="'startTime':" + ПолучитьДатуUT(Дата1);
		
		Если Не ЗначениеЗаполнено(Дата2) Тогда
			Дата2=ТекущаяДата();
		КонецЕсли;
		СтрДата2=",'stopTime':" + ПолучитьДатуUT(Дата2);
		
		ДанныеJSON="{"+СтрДата1+СтрДата2+"}";
		Если НачалоДня(Дата1)=НачалоДня(Дата2) Тогда
			Маркер= ""; //?(ЗаполнитьКлиентов,"update","");
			Путь  = "/stats/list-of-calls-for-period.json";
			Пакет = СформироватьПакетREST(ДанныеJSON, Путь, , Маркер);
		Иначе
			Маркер = "background.history.binotel";
			Путь   = "/stats/incoming-calls-for-period.json";
			Путь2  = "/stats/outgoing-calls-for-period.json";
			Пакет  = СформироватьПакетREST(ДанныеJSON, Путь, , Маркер);
			Пакет2 = СформироватьПакетREST(ДанныеJSON, Путь2, , Маркер);
		КонецЕсли;
		
	ИначеЕсли ИспользуетсяSIOMango Тогда
		Поля=",'fields':'records,start,finish,from_extension,from_number,to_extension,to_number,disconnect_reason,entry_id,answer,line_number,location'";
	
		ИДЗапроса="'api.history.load'";	
		ДанныеJSON="{'date_from':'"+ПолучитьДатуUT(УниверсальноеВремя(Дата1))+"','date_to':'"+ПолучитьДатуUT(УниверсальноеВремя(Дата2))+"'"+Поля+",'request_id':"+ИДЗапроса+"}";	
		Пакет=СформироватьПакетREST(ДанныеJSON, "stats/request");
	
	ИначеЕсли ИспользуетсяSIOPhonet Тогда
		Если Не ЗначениеЗаполнено(Дата1) Тогда
			Дата1=НачалоДня(ТекущаяДата());
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(Дата2) Тогда
			Дата2=ТекущаяДата();
		КонецЕсли; 
		
		СтрДата1 = ПолучитьДатуUT(Дата1,Истина);
		СтрДата2 = ПолучитьДатуUT(Дата2,Истина);
		
		Путь="/rest/calls/company.api";
		Маркер = ""; // "api.history.load"
		ДанныеJSON="{'timeFrom':"+СтрДата1+",'timeTo':"+СтрДата2+"}";
		
		Пакет=СформироватьПакетREST(ДанныеJSON, Путь, "get", Маркер);
	
	ИначеЕсли ИспользуетсяROMHMAC Тогда
		// OnlinePBX	
		Если ВерсияИсторииАТС = 0 Тогда
			Путь="history/search.json";
			
			СтрДата1="";
			Если ЗначениеЗаполнено(Дата1) Тогда
				// дата в формате RFC 2822
				rfcДата1=ПолучитьДатуRFC(Дата1);
				СтрДата1=",'date_from':'"+rfcДата1+"'";
			КонецЕсли;
			
			СтрДата2="";
			Если ЗначениеЗаполнено(Дата2) Тогда
				// дата в формате RFC 2822
				rfcДата2=ПолучитьДатуRFC(Дата2);
				СтрДата2=",'date_to':'"+rfcДата2+"'";
			КонецЕсли;
			
			СтрНомер="'out_number':''";
			
			ДанныеJSON="{"+СтрНомер+СтрДата1+СтрДата2+"}";
			Пакет=СформироватьПакетREST(ДанныеJSON,Путь);
			
		ИначеЕсли  ВерсияИсторииАТС = 1 Тогда  		
			// OnlinePBX (новая версия)
			Путь="mongo_history/search.json";
			
			СтрДата1="";
			Если ЗначениеЗаполнено(Дата1) Тогда
				ДатаЗапроса1 = УниверсальноеВремя(Дата1); // согласно инструкции требуется GMT 0
				// дата в формате UT
				ПредставлениеДата1 = ПолучитьДатуUT(ДатаЗапроса1); //Формат(ДатаЗапроса1 - Дата(1970,1,1,0,0,0), "ЧГ=0");
				СтрДата1="'start_stamp_from':'"+ПредставлениеДата1+"'";
			КонецЕсли;
			
			СтрДата2="";
			Если ЗначениеЗаполнено(Дата2) Тогда
				ДатаЗапроса2 = УниверсальноеВремя(Дата2); // согласно инструкции требуется GMT 0
				// дата в формате UT
				ПредставлениеДата2 = ПолучитьДатуUT(ДатаЗапроса2); //Формат(ДатаЗапроса2 - Дата(1970,1,1,0,0,0), "ЧГ=0");
				СтрДата2="'start_stamp_to':'"+ПредставлениеДата2+"'";
			КонецЕсли;
			
			ДанныеJSON="{"+СтрДата1+ ?(ПустаяСтрока(СтрДата1),"", ",") + СтрДата2+"}";
			Пакет=СформироватьПакетREST(ДанныеJSON,Путь);
		КонецЕсли;
		
	ИначеЕсли ИспользуетсяROMAsterisk Тогда
		ОбработкаИсторияАТСAsteriskНаСервере(Дата1, Дата2);

	Иначе
		Возврат Неопределено; 	
	КонецЕсли;
	
	Если (ИспользуетсяROMHMAC 
		ИЛИ ИспользуетсяSIOМегафон 
		ИЛИ ИспользуетсяSIODomRu 
		ИЛИ ИспользуетсяSIOUIS 
		ИЛИ ИспользуетсяSIOSipuni 
		ИЛИ ИспользуетсяSIOBinotel 
		ИЛИ ИспользуетсяSIOMango
		ИЛИ ИспользуетсяSIOPhonet) Тогда
		
		Если НЕ ПанельRomHMac = Неопределено Тогда 
			Если НЕ ПустаяСтрока(Пакет) Тогда
				ПанельRomHMac.Отправить(Пакет);
			КонецЕсли;
			Если ИспользуетсяSIOBinotel И НЕ ПустаяСтрока(Пакет2) Тогда
				ПанельRomHMac.Отправить(Пакет2);
			КонецЕсли;
		Иначе
			ПоказатьПредупреждение(,"Нет подключения к серверу телефонии");
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДатуUTC(Дата='00010101')
	
	ФорматДаты="ДФ=гггг-ММ-ддTЧЧ:мм:сс";
	СтрДатаUTC=Формат(Дата,ФорматДаты)+"Z";
	
	Возврат СтрДатаUTC;

КонецФункции

&НаКлиенте
Функция ПолучитьДатуRFC(ТекДата='00010101')
	
	// Дата в формате RFC 2822
	Если Не ЗначениеЗаполнено(ТекДата) Тогда
		ТекДата=ПолучитьДатуGMT();
	КонецЕсли;
	
	Если ТекДата=НачалоДня(ТекДата) ИЛИ ТекДата=КонецДня(ТекДата) Тогда
		ДатаRFC=Формат(ТекДата,"Л=en_GB; ДФ='дд МММ гггг ЧЧ:мм:сс'")+" GMT";
	Иначе
		ДатаRFC=Формат(УниверсальноеВремя(ТекДата),"Л=en_GB; ДФ='дд МММ гггг ЧЧ:мм:сс'")+" GMT";
	КонецЕсли; 
	
	Возврат ДатаRFC;

КонецФункции

&НаКлиенте
Функция ПолучитьДатуUT(ТекДата='00010101', Миллисекунды=Ложь) 

	// Дата -> UnixTime	
	Возврат Формат(ТекДата - Дата(1970,1,1,0,0,0), "ЧГ=0") + ?(Миллисекунды, "000", "");
	
КонецФункции

&НаКлиенте
Функция Base64ИзСтроки(Знач СтрокаСимволов)
	Массив64 = Новый Массив;
	Для Код = КодСимвола("A") По КодСимвола("Z") Цикл Массив64.Добавить(Символ(Код)); КонецЦикла;
	Для Код = КодСимвола("a") По КодСимвола("z") Цикл Массив64.Добавить(Символ(Код)); КонецЦикла;
	Для Код = КодСимвола("0") По КодСимвола("9") Цикл Массив64.Добавить(Символ(Код)); КонецЦикла;
	Массив64.Добавить("+");
	Массив64.Добавить("/");

	Рет = "";   
	РетХ = "";
	СтрокаСимволов = СтрЗаменить(СтрокаСимволов, Символы.ПС, Символы.ВК + Символы.ПС);
	КоличествоСимволов = СтрДлина(СтрокаСимволов);
	
	КоличествоУчтенных = 0;
	Накопитель = 0;
	Для Индекс = 0 По КоличествоСимволов - 1 Цикл
		МассивВрем = ПреобразоватьСимволЮникод(Сред(СтрокаСимволов, Индекс + 1, 1));
		
		Для ИндексВ = 0 По МассивВрем.Количество() - 1 Цикл
			Накопитель = Накопитель * 256 + МассивВрем[ИндексВ];
			Если КоличествоУчтенных = 2 Или (Индекс = КоличествоСимволов - 1 И ИндексВ = МассивВрем.Количество() - 1) Тогда
				Пока КоличествоУчтенных < 2 Цикл Накопитель = Накопитель * 256; КоличествоУчтенных = КоличествоУчтенных + 1; РетХ = РетХ + "="; КонецЦикла;
				МассивГрупп = Новый Массив(4);
				Для Индекс4 = -3 По 0 Цикл
					Остаток = Накопитель % 64;
					Накопитель = (Накопитель - Остаток) / 64;
					МассивГрупп[ - Индекс4] = Остаток;
				КонецЦикла;
				Для Индекс4 = 0 По 3 Цикл Рет = Рет + Массив64[МассивГрупп[Индекс4]]; КонецЦикла;	
				КоличествоУчтенных = 0;
			Иначе
				КоличествоУчтенных = КоличествоУчтенных + 1;
			КонецЕсли
		КонецЦикла;
	КонецЦикла;

	Возврат "" + ?(ЗначениеЗаполнено(РетХ), Лев(Рет, СтрДлина(Рет) - СтрДлина(РетХ)) + РетХ, Рет);
	
КонецФункции

&НаКлиенте
Функция Base64ВСтроку(Знач Строка64)
	
	// раскодирование Base64, без файловых операций и серверных вызовов
	// на базе mxm2
	Если Лев(Строка64, 4) = "77u/" Тогда
		Строка64 = Сред(Строка64, 5);
	КонецЕсли;
	
	Массив64 = Новый Массив;
	Для Код = КодСимвола("A") По КодСимвола("Z") Цикл
		Массив64.Добавить(Символ(Код));
	КонецЦикла;
	
	Для Код = КодСимвола("a") По КодСимвола("z") Цикл
		Массив64.Добавить(Символ(Код));
	КонецЦикла;
	
	Для Код = КодСимвола("0") По КодСимвола("9") Цикл
		Массив64.Добавить(Символ(Код)); 
	КонецЦикла;
	Массив64.Добавить("+");
	Массив64.Добавить("/");
	
	МассивВрем = Новый Массив;
	
	Строка64 = СтрЗаменить(СтрЗаменить(Строка64, Символ(13), ""), Символ(10), "");
	
	Количество4 = Цел(СтрДлина(Строка64) / 4);
	Результат = "";
	Заглушек = 0;
	Для Индекс4 = 0 По Количество4 - 1 Цикл
		Накопитель = 0;
		Для Индекс = 0 По 3 Цикл
			Символ = Сред(Строка64, Индекс4 * 4 + 1 + Индекс, 1);
			Если Символ = "=" Тогда
				Заглушек = Заглушек + 1;
				Накопитель = Накопитель * 64; // Поднимаем разрядность
				Продолжить;
			КонецЕсли;
			
			ИндексЭлемента = Массив64.Найти(Символ);
			Накопитель = Накопитель * 64 + ИндексЭлемента;
		КонецЦикла;
		
		Для Индекс3 = - 2 По 0 Цикл
			Остаток = Накопитель % 256;
			Если МассивВрем.ВГраница() >= Индекс4 * 3 - Индекс3 Тогда
				МассивВрем[Индекс4 * 3 - Индекс3] = Остаток;
			Иначе
				МассивВрем.Вставить(Индекс4 * 3 - Индекс3, Остаток);
			КонецЕсли;
			Накопитель = (Накопитель - Остаток) / 256;
		КонецЦикла;
	КонецЦикла;
	
	КоличествоЭлементов = МассивВрем.Количество() - Заглушек;
	Индекс = 0;
	Пока Индекс < КоличествоЭлементов Цикл
		Если Индекс + 3 < КоличествоЭлементов И МассивВрем[Индекс] >= 240 И МассивВрем[Индекс + 1] >= 128 И МассивВрем[Индекс + 2] >= 128 И МассивВрем[Индекс + 3] >= 128 Тогда
			Результат = Результат + Символ(64 * 64 * 64 *(МассивВрем[Индекс] - 240) + 64 * 64 *(МассивВрем[Индекс + 1]) - 128 + 64 * (МассивВрем[Индекс + 2] - 128) + МассивВрем[Индекс + 3] - 128);
			Индекс = Индекс + 4;
			Продолжить;
		ИначеЕсли Индекс + 2 < КоличествоЭлементов И МассивВрем[Индекс] >= 224 И МассивВрем[Индекс + 1] >= 128 И МассивВрем[Индекс + 2] >= 128 Тогда
			Результат = Результат + Символ(64 * 64 * (МассивВрем[Индекс] - 224) + 64 * (МассивВрем[Индекс + 1] - 128) + МассивВрем[Индекс + 2] - 128);
			Индекс = Индекс + 3;
			Продолжить;
		ИначеЕсли Индекс + 1 < КоличествоЭлементов И МассивВрем[Индекс] >= 192 И МассивВрем[Индекс + 1] >= 128 Тогда
			Результат = Результат + Символ(64 * (МассивВрем[Индекс] - 192) + МассивВрем[Индекс + 1] - 128);
			Индекс = Индекс + 2;
			Продолжить;
		Иначе
			Результат = Результат + Символ(МассивВрем[Индекс]);
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	Результат = СтрЗаменить(Результат, Символы.ВК + Символы.ПС, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПреобразоватьСимволЮникод(Символ)
	Код = КодСимвола(Символ);
	Если Код >= 2048 Тогда // Число кодируется 3 байтами 1110хххх, 10хххххх, 10хххххх = (224+), (128+), (128+) (максимально что поддерживается функцией 1с КодСимвола)
		КоличествоБайт = 2; //с нуля
		Байты = Новый Массив; Байты.Добавить(224); Байты.Добавить(128); Байты.Добавить(128);
	ИначеЕсли Код >= 128 Тогда // Число кодируется 2 байтами типа 110ххххх, 10хххххх = (192+ ), (128+ )
		КоличествоБайт = 1; //с нуля
		Байты = Новый Массив; Байты.Добавить(192); Байты.Добавить(128); 
	Иначе//Если Код < 128 Тогда //Как Есть
		Байты = Новый Массив; Байты.Добавить(Код);
		Возврат Байты;
	КонецЕсли;	
	
	Для ИндексБайт = - КоличествоБайт По 0 Цикл
		Остаток = (Код % 64);
		Байты[- ИндексБайт] = Байты[- ИндексБайт] + Остаток;
		Код = (Код - Остаток) / 64;
	КонецЦикла;
    Возврат Байты;
КонецФункции

&НаКлиенте
Функция ЗакрытьФормуВходящегоЗвонка(ИДЗвонка, ИДСессииЗвонка="")
	
	// 2022-05-23
	//Оповестить("ЗакрытьФормуВходящегоЗвонка", ИДЗвонка);
	Если ИДСессииЗвонка = "" Тогда
		Оповестить("ЗакрытьФормуВходящегоЗвонка", ИДЗвонка);
	Иначе
		Оповестить("ЗакрытьФормуВходящегоЗвонка", Новый Структура("ИДЗвонка, ИДСессииЗвонка", ИДЗвонка, ИДСессииЗвонка) );
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция ДействияПриНачалеВходящегоЗвонка(НомерАбонента, ВнешняяЛиния, ВнутреннийНомер, ИДТекущегоЗвонка="", ИДСессииСобытия = "")
	
	Если ПользовательПринимаетВходящиеЗвонки() Тогда
		СтруктураНовойФормы = Новый Структура;
		СтруктураНовойФормы.Вставить("НомерАбонента", СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(НомерАбонента));
		СтруктураНовойФормы.Вставить("ВнешняяЛиния", ВнешняяЛиния);
		СтруктураНовойФормы.Вставить("НашВнутреннийНомер", ВнутреннийНомер);
		СтруктураНовойФормы.Вставить("ИДСобытия", ИДТекущегоЗвонка);
		Если ЗначениеЗаполнено(ИДСессииСобытия) Тогда
			СтруктураНовойФормы.Вставить("ИДСессииСобытия", ИДСессииСобытия);
		КонецЕсли;
		ОткрытьФорму("ОбщаяФорма.ФормаВходящийЗвонок", СтруктураНовойФормы, , НомерАбонента, ВариантОткрытияОкна.ОтдельноеОкно,,,);
	КонецЕсли;
	
КонецФункции
		
&НаКлиенте
Функция ДействияПриПоднятииТрубки_Sipuni(НомерАбонента, ИДЗвонка)
	
	Оповестить( "ПоднятиеТрубки_Sipuni", Новый Структура("НомерАбонента, ИДЗвонка", НомерАбонента, ИДЗвонка) );
		
КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_OnlinePBX(НомерАбонента, ИДЗвонка, ИДСессииЗвонка)
	
	Оповестить( "ПоднятиеТрубки_OnlinePBX", Новый Структура("НомерАбонента, ИДЗвонка, ИДСессииЗвонка", НомерАбонента, ИДЗвонка, ИДСессииЗвонка) );
		
КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_Asterisk(НомерАбонента, ИДЗвонка, ИДСессииЗвонка="")
	
	Оповестить( "ПоднятиеТрубки_Asterisk", Новый Структура("НомерАбонента, ИДЗвонка, ИДСессииЗвонка", НомерАбонента, ИДЗвонка, ИДСессииЗвонка) );
		
КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_Binotel(НомерАбонента, ИДЗвонка)
	
	Оповестить( "ПоднятиеТрубки_Binotel", Новый Структура("НомерАбонента, ИДЗвонка", НомерАбонента, ИДЗвонка) );
		
КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_Mango(НомерАбонента, ИДЗвонка)
	
	Оповестить( "ПоднятиеТрубки_Mango", Новый Структура("НомерАбонента, ИДЗвонка", НомерАбонента, ИДЗвонка) );
		
КонецФункции

&НаКлиенте
Функция ДействияПриПоднятииТрубки_Phonet(НомерАбонента, ИДЗвонка)
	
	Оповестить( "ПоднятиеТрубки_Phonet", Новый Структура("НомерАбонента, ИДЗвонка", НомерАбонента, ИДЗвонка) );
		
КонецФункции

////////////////////процедуры по исходящим звонкам
&НаКлиенте
Процедура ВыполнитьИсходящийЗвонок(ТелефонКлиента, ИмяКлиента)
	
	Если СофтФон.ИспользуютсяСофтФон() Тогда
		Если НЕ ПанельСофтФон = Неопределено Тогда
			Если НЕ ПанельСофтФон.MakeCall("", ТелефонКлиента, , ИмяКлиента, ИмяКлиента,) = 0 Тогда
				Состояние("Не удалось соединиться с СофтФон");
			КонецЕсли;
		Иначе
			Состояние("Не удалось соединиться с СофтФон");
		КонецЕсли;
		
	ИначеЕсли ИспользуетсяROMAsterisk Тогда
		
		Контекст = СофтФон.ПолучитьКонтекстИсходящихЗвонков();
		Если Не ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Состояние("Не указан внутренний номер, с которого выполняется звонок");
			Возврат;
		КонецЕсли;
		
		СтрокаНабораЦифры = ПодготовитьНомерДляЗвонка(ТелефонКлиента);
		Если ПустаяСтрока(СтрокаНабораЦифры) Тогда
			Состояние("Телефонный номер должен содержать цифры");
			Возврат;
		КонецЕсли;
		
		//отправим комнду проверки на наличие запущенного программного телефона или подключенного аппаратного. ответ поймает и отработает функция в обработке "СофтФон"
		CRLF=Chars.CR+Chars.LF;
		ТекстКоманды = "Action: Command"+CRLF+
		"Command: sip show peer 118"+CRLF+CRLF;
		ПанельRomAsterisk.ВыполнитьКоманду(ТекстКоманды);
		
		//отправляем команду звонка
		CRLF=Chars.CR+Chars.LF;
		ТекстКоманды="Action: Originate"+CRLF+
		//"Channel: SIP/"+ВнутреннийНомер+CRLF+
		"Channel: "+КаналИсходящегоВызова+CRLF+
		"Context: "+Контекст+CRLF+
		"Exten: "+СтрокаНабораЦифры+CRLF+
		"Priority: 1"+CRLF+
		"Callerid: "+ВнутреннийНомер+CRLF+
		"Timeout: 30000"+CRLF+CRLF;
		
		ПанельRomAsterisk.ВыполнитьКоманду(ТекстКоманды);
		
	ИначеЕсли ИспользуетсяROMHMAC Тогда
		
		Номер = СофтФон.ОставитьТолькоЦифры(ТелефонКлиента);
		Если Не ЗначениеЗаполнено(Номер) Тогда
			Состояние("Не указан номер, куда выполняется звонок");
			Возврат;
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Состояние("Не указан внутренний номер");
			Возврат;
		КонецЕсли;
		
		ДанныеJSON=
		"{
		|'from':'"+ВнутреннийНомер+"',
		|'to':'"+Номер+"',
		|'from_orig_number':'"+Номер+"',
		|'from_orig_name':'"+Номер+"',
		|'domain_to':'"+ДоменAPI+"',
		|'from_name':'"+ВнутреннийНомер+"'
		|}";
		
		Пакет = СформироватьПакетOnPBX(ДанныеJSON, "make_call");
		ПанельRomHMac.Отправить(Пакет);
		
	ИначеЕсли ИспользуетсяSIOМегафон ИЛИ ИспользуетсяSIODomRu Тогда //++2020-08-26
		
		Номер = СофтФон.ОставитьТолькоЦифры(ТелефонКлиента);
		Если ПустаяСтрока(Номер) Тогда
			Состояние("Телефонный номер должен содержать цифры");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеJSON="{'cmd':'makeCall','phone':'"+Номер+"','user':'"+ВнутреннийЛогин_ITooLabs+"','token':'"+КлючAPI+"'}";
		Пакет=СформироватьПакетREST(ДанныеJSON,,"post","makeCall");
		ОтправитьПакетSimplitIO(Пакет);

	ИначеЕсли ИспользуетсяSIOUIS Тогда //++2020-08-26
		
		Номер = СофтФон.ОставитьТолькоЦифры(ТелефонКлиента);
		Если ПустаяСтрока(Номер) Тогда
			Состояние("Телефонный номер должен содержать цифры");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Возврат;
		КонецЕсли;
		
		Путь = "callapi.uiscom.ru/v4.0";
		ИмяМетода = "start.employee_call";
		ДанныеJSON = "{'jsonrpc':'2.0','id':'"+ИмяМетода+"','method':'"+ИмяМетода+"','params':{'access_token':'"+КлючAPI+"','first_call':'employee','virtual_phone_number':'"+ВнутреннийВиртНомер_UIS+
		"','contact':'"+Номер+"','employee':{'id':"+ВнутреннийИД_UIS+"}}}";
		Пакет=СформироватьПакетREST(ДанныеJSON,Путь,,ИмяМетода);
		ОтправитьПакетSimplitIO(Пакет);
		
	ИначеЕсли ИспользуетсяSIOBinotel Тогда //++2020-06-29
		
		СтрокаНабораЦифры = ПодготовитьНомерДляЗвонка(ТелефонКлиента);
		Если ПустаяСтрока(СтрокаНабораЦифры) Тогда
			Состояние("Телефонный номер должен содержать цифры");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Возврат;
		КонецЕсли;
	
		Путь="/calls/ext-to-phone.json";	
		СтрАвтоответ="";
		//Если ФлагАвтоответ Тогда
		//	СтрАвтоответ="'autoAnswer':'TRUE',";
		//КонецЕсли; 
	
		ДанныеJSON = "{"+СтрАвтоответ+"'ext_number':'"+ВнутреннийНомер+"','phone_number':'"+СтрокаНабораЦифры+"','playbackWaiting':0}";
	
		Пакет = СформироватьПакетREST(ДанныеJSON,Путь);
		ПанельRomHMac.Отправить(Пакет);
		
	ИначеЕсли ИспользуетсяSIOMango Тогда //++2021-08
		Номер = СофтФон.ОставитьТолькоЦифры(ТелефонКлиента);
		Если ПустаяСтрока(Номер) Тогда
			Состояние("Телефонный номер должен содержать цифры");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
			Возврат;
		КонецЕсли;
		
		ЛинияИЗ = "";
		СтрАвтоответ=",'sip_headers':{'Call-Info/answer-after':'0'}"; //автоответ внутреннего телефона при исходящем звонке; может оставить пустым
		
		ДанныеJSON="{'command_id':'api.outgoing."+ВнутреннийНомер+"','from':{'extension':'"+ВнутреннийНомер+"','number':'"+ЛинияИЗ+"'},'to_number':'"+Номер+"'"+СтрАвтоответ+"}";
		Пакет=СформироватьПакетREST(ДанныеJSON,"commands/callback");
		ОтправитьПакетSimplitIO(Пакет);

	ИначеЕсли ИспользуетсяSIOPhonet Тогда //++2021-12		
		Путь = "/rest/user/makeCall";
		ДанныеJSON = "{'legExt':'"+ВнутреннийНомер+"','otherLegNum':'"+ТелефонКлиента+"'}";
		
		Пакет=СформироватьПакетREST(ДанныеJSON, Путь, "post");
		ОтправитьПакетSimplitIO(Пакет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьНомерДляЗвонка(Знач Номер)
	
	Номер = СтрЗаменить(Номер, "+7", "8");
	ТолькоЦифры="";
	Для Индекс=1 По СтрДлина(Номер) Цикл
		Символ=Сред(Номер,Индекс,1);
		Если КодСимвола(Символ)>47 и КодСимвола(Символ)<58 Тогда
			ТолькоЦифры=ТолькоЦифры+Символ;
		КонецЕсли; 
	КонецЦикла; 
	Возврат ТолькоЦифры;

КонецФункции

	
КлючЗапрашивался=Ложь;