#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Ведомость получения материальных ценностей.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыплатаЗарплатыВНатуральнойФорме";
	КомандаПечати.Идентификатор = "ПФ_MXL_ВедомостьПолученияМатериальныхЦенностей";
	КомандаПечати.Представление = НСтр("ru = 'Ведомость получения материальных ценностей'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы.
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьВедомость = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВедомостьПолученияМатериальныхЦенностей");
	
	Если НужноПечататьВедомость Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ВедомостьПолученияМатериальныхЦенностей",
			НСтр("ru = 'Ведомость получения материальных ценностей'"), ПечатьВедомости(МассивОбъектов, ОбъектыПечати), ,
			"Документ.ВыплатаЗарплатыВНатуральнойФорме.ПФ_MXL_ВедомостьПолученияМатериальныхЦенностей");
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ	
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	""01.01.2001"" КАК Дата,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.Наименование КАК ОрганизацияНаименованиеСокращенное,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.Автор.Сотрудник.РасшифровкаПодписи КАК ИсполнительРасшифровкаПодписи,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Организация.Руководитель.РасшифровкаПодписи
	|		ИНАЧЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи
	|	КОНЕЦ КАК РуководительРасшифровкаПодписи,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ГлавныйБухгалтер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Организация.ГлавныйБухгалтер.РасшифровкаПодписи
	|		ИНАЧЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	|	КОНЕЦ КАК ГлавныйБухгалтерРасшифровкаПодписи,
	|	ДанныеДокумента.Руководитель КАК Руководитель,
	|	ДанныеДокумента.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ДанныеДокумента.Автор КАК Исполнитель,
	|	ДанныеДокумента.Автор.Сотрудник.Должность КАК ДолжностьИсполнителя,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Организация.Руководитель.Должность
	|		ИНАЧЕ ДанныеДокумента.Руководитель.Должность
	|	КОНЕЦ КАК ДолжностьРуководителя
	|ИЗ
	|	Документ.ВыплатаЗарплатыВНатуральнойФорме КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыплатаЗарплатыВНатуральнойФормеВыплаты.Ссылка КАК Ссылка,
	|	ВыплатаЗарплатыВНатуральнойФормеВыплаты.НомерСтроки КАК НомерСтроки,
	|	ВыплатаЗарплатыВНатуральнойФормеВыплаты.Сотрудник КАК Сотрудник,
	|	ВыплатаЗарплатыВНатуральнойФормеВыплаты.Сотрудник.Код КАК ТабельныйНомер,
	|	ВыплатаЗарплатыВНатуральнойФормеВыплаты.Номенклатура КАК Номенклатура,
	|	ВыплатаЗарплатыВНатуральнойФормеВыплаты.Номенклатура.Артикул КАК Артикул,
	|	ВыплатаЗарплатыВНатуральнойФормеВыплаты.Количество КАК Количество,
	|	ВыплатаЗарплатыВНатуральнойФормеВыплаты.Сумма КАК Сумма
	|ИЗ
	|	Документ.ВыплатаЗарплатыВНатуральнойФорме.Выплаты КАК ВыплатаЗарплатыВНатуральнойФормеВыплаты
	|ГДЕ
	|	ВыплатаЗарплатыВНатуральнойФормеВыплаты.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыплатаЗарплатыВНатуральнойФормеВыплаты.Ссылка,
	|	ВыплатаЗарплатыВНатуральнойФормеВыплаты.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиВыплаты = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиВыплаты",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиВыплаты);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента,"ДЛФ=Д");
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер); 
		Исключение
		КонецПопытки;
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПечатьВедомости(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыплатаЗарплатыВНатуральнойФорме_ВедомостьПолученияМатериальныхЦенностей";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыплатаЗарплатыВНатуральнойФорме.ПФ_MXL_ВедомостьПолученияМатериальныхЦенностей");
	
	ОбластьШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(ОбластьСтрока);
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоВыплатам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиВыплаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьШапкаДокумента.Параметры.Заполнить(ДанныеПечати);		
		ТабличныйДокумент.Вывести(ОбластьШапкаДокумента);
		
		ОбластьШапка.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		
		ВыборкаПоВыплатам.Сбросить();
		Если ВыборкаПоВыплатам.НайтиСледующий(СтруктураПоиска) Тогда			
			ДанныеСотрудника = ВыборкаПоВыплатам.Выбрать();			
			Пока ДанныеСотрудника.Следующий() Цикл
			
				// Проверим, уместится ли строка на странице или надо открывать новую страницу.
				Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ВыводимыеОбласти) Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьШапка);
				КонецЕсли;
			
				ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
				ОбластьСтрока.Параметры.Заполнить(ДанныеСотрудника);
				
				//++ №12909
				ОбластьСтрока.Параметры.Номенклатура = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ДанныеСотрудника.Номенклатура);
				//-- №12909
				
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			КонецЦикла;
		КонецЕсли;
		
		ОбластьПодвал.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Добавляет команду создания документа "ВыплатаЗарплатыВНатуральнойФорме".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ВыплатаЗарплатыВНатуральнойФорме) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ВыплатаЗарплатыВНатуральнойФорме.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ВыплатаЗарплатыВНатуральнойФорме.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли

