
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	ОбщийМодуль.ОбработкаЗаполненияПодписей(ЭтотОбъект);

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		ЗаполнитьПоМонтажу(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
		Организация 		= ДанныеЗаполнения.Организация;
		Подразделение 		= ДанныеЗаполнения.Подразделение;
		Основание 			= ДанныеЗаполнения;
		ПериодРегистрации 	= ДанныеЗаполнения.ПериодРегистрации;
		Для Каждого ТекСтрокаНачисление Из ДанныеЗаполнения.Начисление Цикл			
			НайденныеСтроки = Выплаты.НайтиСтроки(Новый Структура("Сотрудник", ТекСтрокаНачисление.Сотрудник));
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = Выплаты.Добавить();
				НоваяСтрока.Сотрудник = ТекСтрокаНачисление.Сотрудник;
			
				Валюта = ТекСтрокаНачисление.Валюта;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Выплаты.Итог("Сумма");
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ИспользуетсяПериодРегистрации = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;	
	ДатаДвижения = Дата;
	Если ДатаДвижения = Дата(1,1,1) Тогда
		ДатаДвижения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// регистр РасчетыСПерсоналом Расход
	Движения.РасчетыСПерсоналом.Записывать = Истина;
	Для Каждого ТекСтрока Из Выплаты Цикл
		Движение = Движения.РасчетыСПерсоналом.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата; 
		Движение.ПериодРегистрации = ?(ИспользуетсяПериодРегистрации, ПериодРегистрации, Дата(1,1,1));
		Движение.Организация = Организация;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекСтрока.Сумма);
	КонецЦикла;
	
	// регистр ТоварыНаСкладах Расход
	ТаблицаСписания = Выплаты.ВыгрузитьКолонки();
	Для Каждого ТекущаяСтрока Из Выплаты Цикл
		Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
			НоваяСтрока = ТаблицаСписания.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;		
	// нужно свернуть, чтобы корректно списать себестоимость
	ТаблицаСписания.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Коэффициент", "Количество");
		
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, Склад, ТаблицаСписания, ДатаДвижения);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	Для Каждого Товар Из ТаблицаСписания Цикл
		Расход = Движения.ТоварыНаСкладах.Добавить();
		Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
		Расход.Период = ДатаДвижения;
		Расход.Организация = ОрганизацияТоваров;
		Расход.Склад = Склад;
		Расход.Номенклатура = Товар.Номенклатура;
		Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		Расход.СерияНоменклатуры = Товар.СерияНоменклатуры;
		Расход.Количество = Товар.Количество * Товар.Коэффициент;
		
		СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, Склад, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
		Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
		Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
	КонецЦикла;
	
	// регистр ДоходыРасходы
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			
			Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движения.ДоходыРасходы.Записывать = Истина;
			
			Для Каждого ТекущаяСтрока Из Выплаты Цикл
				//СуммаСписания = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, Организация, Склад, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.СерияНоменклатуры);
	            Статья = ?(НЕ ТекущаяСтрока.СтатьяРасходов.Пустая(), ТекущаяСтрока.СтатьяРасходов, СтатьяРасходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;				
					Движение = Движения.ДоходыРасходы.Добавить();
					Движение.Период 		= Дата;
					Движение.Организация 	= Организация;
					Движение.Подразделение 	= Подразделение;
					Движение.Статья 		= Статья;
					Движение.Метод		 	= Метод;
					Движение.СуммаДоходов 	= 0;
					Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения)
	
	Организация 		= ДанныеЗаполнения.Организация;
	Подразделение 		= ДанныеЗаполнения.Подразделение;
	Основание 			= ДанныеЗаполнения;
	ПериодРегистрации	= НачалоМесяца(ДанныеЗаполнения.Дата);	
	
КонецПроцедуры

Процедура ЗаполнитьПоМонтажу(ДанныеЗаполнения)
	
	Организация 		= ДанныеЗаполнения.Организация;
	Подразделение 		= ДанныеЗаполнения.Подразделение;
	Основание 			= ДанныеЗаполнения;
	ПериодРегистрации	= НачалоМесяца(ДанныеЗаполнения.Дата);
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли