
&НаКлиенте
Процедура Список(Команда)
	Элементы.ФормаСписок.Пометка = НЕ Элементы.ФормаСписок.Пометка;
	Элементы.ГруппаИнструкции.Видимость = Элементы.ФормаСписок.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Команда)
	Элементы.ФормаОтбор.Пометка = НЕ Элементы.ФормаОтбор.Пометка;
	Элементы.ГруппаОтбор.Видимость = Элементы.ФормаОтбор.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	Элементы.ФормаИстория.Пометка = НЕ Элементы.ФормаИстория.Пометка;
	Элементы.ГруппаИстория.Видимость = Элементы.ФормаИстория.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьСписокНаСервере();
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНаСервере()
	
	дерево = ИА_Защита_ДИ.ЗаполнитьСписокДИНаСервере(Пост, "", Текст, Серия, ТипИнструкции, Статус, ДатаВыпуска);
	
	ЗначениеВРеквизитФормы(дерево, "СписокИнструкций");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если не ИА_Защита_Общий.ЛицензияДоступна("ДИ") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		СисИнфо = Новый СистемнаяИнформация;
		ЭтоИЕ = (Найти(СисИнфо.ИнформацияПрограммыПросмотра, "MSIE")>0);
		
		ПодключитьРасширениеРаботыСФайлами();
	#Иначе
		ЭтоИЕ = Истина;
	#КонецЕсли
	
	
	Если ДокЗадание.Пустая() Тогда
		Элементы.ФормаСписок.Пометка = Истина;
		Элементы.ФормаОтбор.Пометка = Ложь;
		Элементы.ФормаИстория.Пометка = Истина;
		
		//Элементы.ГруппаОтбор.Видимость = Элементы.ФормаОтбор.Пометка;
		
		ЗаполнитьСписокНаСервере();
		
		Если ЗначениеЗаполнено(ВыбИнструкция) Тогда
			ид = ПолучитьИДСтрокиПОИнструкции(СписокИнструкций.ПолучитьЭлементы(), ВыбИнструкция);
			Если ид <> Неопределено Тогда
				Элементы.СписокИнструкций.ТекущаяСтрока = ид;
			КонецЕсли;
		КонецЕсли;
		
		Элементы.Серия.Видимость = ИспользоватьКонтрольПоСериям;
		Элементы.ТипИнструкции.Видимость = ИспользоватьКонтрольПоТипамИнструкций;
		
		Элементы.ФормаПечать.Видимость = не Гугл;
		Элементы.ФормаСохранитьИнструкцииВПапку.Видимость = не Гугл;
		
		Элементы.ГруппаИнструкции.Видимость = истина;
		Элементы.ГруппаЗадание.Видимость = ложь;
		
		Элементы.ФормаСохранить.Видимость = ложь;
	Иначе
		Элементы.ФормаКнопкиВидимость.Видимость = ложь;
		Элементы.ФормаГруппа1.Видимость = ложь;
		Элементы.ФормаГруппа3.Видимость = ложь;
		Элементы.РаботаСАрхивом.Видимость = ложь;
		Элементы.Группа2.Видимость = ложь;
		Элементы.ФормаСохранитьИнструкцииВПапку.Видимость = ложь;
		
		Элементы.ГруппаИстория.Видимость = ложь;
		
		Элементы.ГруппаИнструкции.Видимость = ложь;
		Элементы.ГруппаЗадание.Видимость = истина;
		
		Элементы.ФормаСохранить.Видимость = истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИДСтрокиПОИнструкции(пСтроки, пИнструкция)
	ид = Неопределено;
	Для каждого стр из пСтроки Цикл
		Если стр.Ссылка = пИнструкция Тогда
			Возврат стр.ПолучитьИдентификатор();
		КонецЕсли;
		ид = ПолучитьИДСтрокиПОИнструкции(стр.ПолучитьЭлементы(), пИнструкция);
		Если ид<>Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ид;
КонецФункции

&НаКлиенте
Процедура СписокИнструкцийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если не Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		ОткрытьИнструкциюНаВесьЭкран(Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструкциюНаВесьЭкран(инстр) Экспорт
	флОтбор = Элементы.ФормаОтбор.Пометка;
	флСписок = Элементы.ФормаСписок.Пометка;
	флИстория = Элементы.ФормаИстория.Пометка;
	
	Элементы.ФормаОтбор.Пометка = ложь;
	Элементы.ГруппаОтбор.Видимость = ложь;
	Элементы.ФормаИстория.Пометка = ложь;
	Элементы.ГруппаИстория.Видимость = ложь;
	Элементы.ФормаСписок.Пометка = ложь;
	Элементы.ГруппаИнструкции.Видимость = ложь;
	
	Элементы.ФормаВернутьсяКСписку.Видимость = истина;
	Элементы.ФормаКнопкиВидимость.Видимость = ложь;
	Элементы.ФормаГруппа1.Видимость = ложь;
	
	ЗагрузитьИнструкцию(инстр);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИнструкцию(Инструкция, ИгнорироватьИсторию = Ложь)
	
	Если Не ИгнорироватьИсторию Тогда
		ДобавитьСсылкуВИсторию(Инструкция);
	КонецЕсли;
	
	ТекущаяИнструкция = Инструкция;
	
	НовыйТекстHTML = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьПредставлениеИнструкции(Инструкция);
	
	ПодключитьОбработчикОжидания("ПерегрузитьСтраницу", 0.1, истина);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОпределение(Определение, ИгнорироватьИсторию = Ложь)
	
	Если Не ИгнорироватьИсторию Тогда
		ДобавитьСсылкуВИсторию(Определение);
	КонецЕсли;
	
	ОпределениеТекст = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьДанныеОпределения(Определение);
	
	НовТекст = ИА_ОбщиеПроцедуры_Технология.ВставитьСсылкиНаОпределения(ОпределениеТекст);
	
	НовыйТекстHTML = НовТекст;	
	ПодключитьОбработчикОжидания("ПерегрузитьСтраницу", 0.1, истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерегрузитьСтраницу()
	ИмяРеквизита = "ПолеHTML_Просмотр";
	УстановитьТекстHTML(ИмяРеквизита, НовыйТекстHTML);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстHTML(ИмяРеквизита, ИсходныйТекст)
	#Если ВебКлиент или ТолстыйКлиентОбычноеПриложение Тогда
		ЭтаФорма[ИмяРеквизита] = ИсходныйТекст;
	#Иначе
		Элементы[ИмяРеквизита].Документ.open  ("text/html","replace");
		Элементы[ИмяРеквизита].Документ.write (ИсходныйТекст);
		Элементы[ИмяРеквизита].Документ.close ();
	#КонецЕсли
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьДанныеИнструкции(Инструкция)
	// ИА_Аврамов 05.02.2016  Спр = Инструкция.ПолучитьОбъект();
	Спр = Инструкция;
	Возврат Новый Структура("Текст, ТекстКолонтитула", Спр.Текст, Спр.ТекстКолонтитула);
КонецФункции

&НаКлиенте
Процедура ПолеHTML_ПросмотрПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	pEvtObj = Новый Структура("srcElement,returnValue",ДанныеСобытия.Element,Неопределено);
	
	элИнструкция  = ИА_ОбщиеПроцедуры_Технология.ИА_ПолучитьСсылкуOnClickПоляHTML(Неопределено, pEvtObj);
	элОпределение = ИА_ОбщиеПроцедуры_Технология.ИА_ПолучитьСсылкуНаГлоссарийOnClickПоляHTML(Неопределено, pEvtObj);
	
	Если ЗначениеЗаполнено(элИнструкция) Тогда
		ЗагрузитьИнструкцию(элИнструкция);
	ИначеЕсли ЗначениеЗаполнено(элОпределение) Тогда
		ЗагрузитьОпределение(элОпределение);
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		Попытка
			ЗапуститьПриложение(ДанныеСобытия.Href);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTML_ПросмотрДокументСформирован(Элемент)
	Элемент.Документ.Body.ContentEditable = "false";
	Элемент.Документ.body.scroll = "auto";
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПереходовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	инд = ИсторияПереходов.Индекс(ИсторияПереходов.НайтиПоЗначению(Элемент.ТекущиеДанные.Значение));
	Пока инд>0 Цикл
		ИсторияПереходов.Удалить(0);
		инд = инд - 1;
	КонецЦикла;
	
	ВыбранноеЗначение = Элемент.ТекущиеДанные.Значение;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ИА_Инструкции") Тогда
		ЗагрузитьИнструкцию(ВыбранноеЗначение);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ИА_Определения") Тогда
		ЗагрузитьОпределение(ВыбранноеЗначение);
	Иначе
		ПоказатьПредупреждение(,"Неизвестный тип ссылки.");
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСсылкуВИсторию(Ссылка)
	
	// удаляем всю историю "ВПЕРЕД"
	Если Элементы.ИсторияПереходов.ТекущаяСтрока <> Неопределено Тогда
		знДляУдаления = ИсторияПереходов.НайтиПоИдентификатору(Элементы.ИсторияПереходов.ТекущаяСтрока).Значение;
		
		Кол = ИсторияПереходов.Количество();
		сч = кол-1;
		Удалять = Ложь;
		Пока сч>=0 Цикл
			стр = ИсторияПереходов[сч];
			
			Если удалять тогда
				ИсторияПереходов.Удалить(стр);
				сч = сч - 1;
				Продолжить;
			КонецЕсли;
			
			Если стр.Значение = знДляУдаления Тогда
				Удалять = Истина;
			КонецЕсли;
			сч = сч - 1;
		КонецЦикла;
	КонецЕсли;
	
	// удаляем предыдущие
	НайденныйЭлемент = ИсторияПереходов.НайтиПоЗначению(Ссылка);
	Если НайденныйЭлемент<>Неопределено Тогда
		ИсторияПереходов.Удалить(НайденныйЭлемент);
	КонецЕсли;
	
	ИсторияПереходов.Вставить(0, Ссылка);
	
	Если Элементы.ИсторияПереходов.ВыделенныеСтроки.Количество() = 0 Тогда
		Элементы.ИсторияПереходов.ВыделенныеСтроки.Добавить(ИсторияПереходов[0].ПолучитьИдентификатор());
	Иначе
		Элементы.ИсторияПереходов.ВыделенныеСтроки[0] = ИсторияПереходов[0].ПолучитьИдентификатор();
	КонецЕсли;
	
	Элементы.ИсторияПереходов.ТекущаяСтрока = ИсторияПереходов[0].ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ИА_Инструкции") Тогда
		ЗагрузитьИнструкцию(ВыбранноеЗначение);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ИА_Определения") Тогда
		ЗагрузитьОпределение(ВыбранноеЗначение);
	Иначе
		ПоказатьПредупреждение(,"Неизвестный тип ссылки.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ф = ПолучитьФорму("ОбщаяФорма.ИА_ПечатьДолжностнойИнструкцииУправляемая");
	ф.Текст = ПолучитьТекстHTML("ПолеHTML_Просмотр");
	ф.Инструкция = ТекущаяИнструкция;
	ф.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Навигация(Команда)
	
	Если ИсторияПереходов.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтр = ИсторияПереходов.НайтиПоИдентификатору(Элементы.ИсторияПереходов.ТекущаяСтрока);
	
	Если ТекСтр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИндексТекСтроки = ИсторияПереходов.Индекс(ТекСтр);
	
	Если Команда.Имя = "Назад" Тогда
		ИндексТекСтроки = ИндексТекСтроки + 1;
		Если ИндексТекСтроки>=ИсторияПереходов.Количество() Тогда
			Возврат;
		КонецЕсли;
	ИначеЕсли Команда.Имя = "Вперед" Тогда
		ИндексТекСтроки = ИндексТекСтроки - 1;
		Если ИндексТекСтроки<0 Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Сообщить("Не известная команда "+Команда.Имя+".");
		Возврат;
	КонецЕсли;
	
	Элементы.ИсторияПереходов.ТекущаяСтрока = ИсторияПереходов[ИндексТекСтроки].ПолучитьИдентификатор();
	
	Если Элементы.ИсторияПереходов.ВыделенныеСтроки.Количество() = 0 Тогда
		Элементы.ИсторияПереходов.ВыделенныеСтроки.Добавить(Элементы.ИсторияПереходов.ТекущаяСтрока);
	Иначе
		Элементы.ИсторияПереходов.ВыделенныеСтроки[0] = Элементы.ИсторияПереходов.ТекущаяСтрока;
	КонецЕсли;
	
	ВыбранноеЗначение = ИсторияПереходов[ИндексТекСтроки].Значение;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ИА_Инструкции") Тогда
		ЗагрузитьИнструкцию(ВыбранноеЗначение, Истина);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ИА_Определения") Тогда
		ЗагрузитьОпределение(ВыбранноеЗначение, Истина);
	Иначе
		ПоказатьПредупреждение(,"Неизвестный тип ссылки.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	ЗаполнитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокИнструкцийПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные<>Неопределено Тогда
		Если не Элемент.ТекущиеДанные.ЭтоГруппа Тогда
			ЗагрузитьИнструкцию(Элемент.ТекущиеДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКСписку(Команда)
	Элементы.ФормаОтбор.Пометка = флОтбор;
	Элементы.ГруппаОтбор.Видимость = истина;
	Элементы.ФормаИстория.Пометка = флИстория;
	Элементы.ГруппаИстория.Видимость = флИстория;
	Элементы.ФормаСписок.Пометка = флСписок;
	Элементы.ГруппаИнструкции.Видимость = истина;
	
	Элементы.ФормаВернутьсяКСписку.Видимость = ложь;
	Элементы.ФормаКнопкиВидимость.Видимость = истина;
	Элементы.ФормаГруппа1.Видимость = истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Инструкция", ВыбИнструкция);
	Параметры.Свойство("ДокЗадание", ДокЗадание);
	
	ИспользоватьКонтрольПоСериям          = Константы.ИА_ДИ_КонтрольПоСериям.Получить();
	ИспользоватьКонтрольПоСтатусам        = Константы.ИА_ДИ_КонтрольПоСтатусам.Получить();
	ИспользоватьКонтрольПоТипамИнструкций = Константы.ИА_ДИ_КонтрольПоТипамИнструкций.Получить();
	
	Гугл = Константы.ИА_ДИ_ИспользоватьGoogleДокументы.Получить();
	
	Если не ДокЗадание.Пустая() Тогда
		тзДИ = ДокЗадание.Инструкции.Выгрузить(,"Инструкция,Изучено,УИДстроки,Сдано,ДатаСдачи");
		ЗначениеВРеквизитФормы(тзДИ,"ТабИнструкции");
		
		тзВопр = ДокЗадание.Вопросы.Выгрузить(,"Вопрос,Ответ,УИДстроки");
		ЗначениеВРеквизитФормы(тзВопр,"ТабВопросы");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстХТМЛИнструкции(пСсылка)
	Возврат пСсылка.Текст;
КонецФункции

&НаКлиенте
Процедура ОткрытьВВорде(Команда)		
	ИА_ОбщиеПроцедуры_Технология.ОткрытьВВорде(ТекущаяИнструкция, ПолучитьПодписанта(ТекущаяИнструкция));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПодписанта(ТекИнстр)
	Возврат ТекИнстр.Подписант;
КонецФункции

&НаКлиенте
Процедура ПолучитьИзАрхива(Команда)
	
	ОткрытьФорму("Обработка.ИА_РаботаСИнструкциями.Форма.ФормаПолученияИзАрхиваУпр",,,,,, Новый ОписаниеОповещения("ПолучитьИзАрхиваЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзАрхиваЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	Результат = Результат1;
	
	Если Результат <> Неопределено Тогда
		ПолучитьИзАрхиваНаСервере(Результат);
		ЗагруженаИзАрхива = Истина;
		Элементы.ОргСхемаКонтекстноеМенюГруппа.Доступность = Не ЗагруженаИзАрхива;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИзАрхиваНаСервере(Макет)
	//ОргСхема.Очистить();
	//ОргСхема.Вывести(Макет);
	//ОргСхема.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВАрхив(Команда)
	НаименованиеЗаписи = Строка(Элементы.СписокИнструкций.ТекущиеДанные.Наименование);
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПоместитьВАрхивЗавершение", ЭтотОбъект, Новый Структура("НаименованиеЗаписи", НаименованиеЗаписи)), НаименованиеЗаписи, "Наименование инструкции");
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВАрхивЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	НаименованиеЗаписи = ?(Значение = Неопределено, ДополнительныеПараметры.НаименованиеЗаписи, Значение);
	
	
	Если (Значение <> Неопределено) И СокрЛП(НаименованиеЗаписи) <> "" Тогда
		ТекстХТМЛ = ПолучитьТекстHTML("ПолеHTML_Просмотр");
		ПоместитьВАрхивНаСервере(НаименованиеЗаписи, ТекстХТМЛ);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьВАрхивНаСервере(ИмяМакета, ТекстХТМЛ)
	//МенеджерЗаписи = РегистрыСведений.ИА_АрхивИнструкций.СоздатьМенеджерЗаписи();
	//МенеджерЗаписи.Период = ТекущаяДата();
	//МенеджерЗаписи.Наименование = ИмяМакета;
	//МенеджерЗаписи.Макет = Новый ХранилищеЗначения(ТекстХТМЛ);
	//МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстHTML(ИмяРеквизита)
	Если НЕ ЭтоИЕ Тогда
		Возврат Элементы[ИмяРеквизита].Документ.children[0].outerHTML;
	Иначе
		Возврат Элементы[ИмяРеквизита].Документ.all.tags("html").item(0).outerHTML;
	КонецЕсли
КонецФункции


&НаКлиенте
Процедура ДатаВыпускаДатаНачалаПриИзменении(Элемент)
	ЗаполнитьСписокНаСервере();
	
	ОбновитьОтображениеДанных();
КонецПроцедуры


&НаКлиенте
Процедура ДатаВыпускаДатаОкончанияПриИзменении(Элемент)
	ЗаполнитьСписокНаСервере();
	
	ОбновитьОтображениеДанных();
КонецПроцедуры


&НаКлиенте
Процедура Редактировать(Команда)
	ПоказатьЗначение(,ТекущаяИнструкция);
КонецПроцедуры


&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	Если ЗначениеЗаполнено(ВыбИнструкция) Тогда
		ид = ПолучитьИДСтрокиПОИнструкции(СписокИнструкций.ПолучитьЭлементы(), ВыбИнструкция);
		Если ид <> Неопределено Тогда
			Элементы.СписокИнструкций.ТекущаяСтрока = ид;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИА_Инструкции_Изменен" Тогда
		Если ЗначениеЗаполнено(ТекущаяИнструкция) Тогда
			ЗагрузитьИнструкцию(ТекущаяИнструкция);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СохранитьИнструкцииВПапку(Команда)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогВыбораКаталога= Новый ДиалогВыбораФайла(Режим);
	
	ДиалогВыбораКаталога.Показать(Новый ОписаниеОповещения("СохранитьИнструкцииВПапкуЗавершение", ЭтотОбъект));    
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИнструкцииВПапкуЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ВыбраныйКаталог = ВыбранныеФайлы[0]+"\";
		Состояние("Получение инструкций",,"",); 
		Результат = ПолучитьИнструкцииПоОтбору();
		
		Для каждого ТекЭлемент Из Результат Цикл
			Для каждого ТекСоответствие Из ТекЭлемент Цикл
				Если ТекСоответствие.Значение = Неопределено Тогда              
					Продолжить;
				КонецЕсли;
				
				ПолныйПутьКФайлу = ВыбраныйКаталог+ТекСоответствие.Ключ+".doc";
				Состояние("Сохранение инструкции",,ТекСоответствие.Ключ,);
				
				ТекСоответствие.Значение.НачатьЗапись(Новый ОписаниеОповещения("ЗаписьЗавершение", ЭтотОбъект),ПолныйПутьКФайлу);
				
			КонецЦикла; 
		КонецЦикла;      
		Состояние("Сохранение инструкция",,"Сохранение завершено",);     
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран каталог для сохранения инструкций";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписьЗавершение(ДополнительныеПараметры) Экспорт
КонецПроцедуры

&НаСервере
Функция ПолучитьИнструкцииПоОтбору()
	
	ДеревоИнструкций = ИА_Защита_ДИ.ЗаполнитьСписокДИНаСервере(Пост, "", Текст, Серия, ТипИнструкции, Статус, ДатаВыпуска);
	
	ИнструкцииПоОтбору = Новый Массив;
	
	ОбработатьДерево(ДеревоИнструкций,ИнструкцииПоОтбору);    
	
	Возврат ИнструкцииПоОтбору;
	
КонецФункции // ПолучитьИнструкцииПоОтбору()


&НаСервере
Процедура ОбработатьДерево(СтрокаДерева, ИнструкцииПоОтбору)
	
	Для каждого Строка Из СтрокаДерева.Строки Цикл
		Если Строка.Строки.Количество()>0 Тогда
			ОбработатьДерево(Строка, ИнструкцииПоОтбору)
		КонецЕсли;
		
		Если НЕ Строка.Ссылка.ЭтоГруппа  Тогда  
			ПараметрыИнструкции = Новый Соответствие;
			
			СтруктураЗаполнения = ИА_Защита_ДИ.ПолучитьДанныеДокФайла(Строка.Ссылка);
			
			Если СтруктураЗаполнения = Неопределено Тогда						  
				Продолжить;
			Иначе
				ДанныеЗаполнения = ИА_Защита_ДИ.ПолучитьДанныеДокФайла(Строка.Ссылка).Данные; 
			КонецЕсли; 
			
			ПараметрыИнструкции.Вставить(Строка.Наименование, ДанныеЗаполнения);		  
			ИнструкцииПоОтбору.Добавить(ПараметрыИнструкции); 
			
		КонецЕсли;             
	КонецЦикла; 
	
КонецПроцедуры // ОбработатьДерево()


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Элементы.ФормаВернутьсяКСписку.Видимость Тогда
		ВернутьсяКСписку(Неопределено);
		СтандартнаяОбработка = ложь;
		отказ = истина;
	КонецЕсли;
	
	Если измЗадания = истина Тогда
		отказ = Истина;
		СтандартнаяОбработка = ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Сохранить изменения в задании?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		СохранитьНаСервере();
		Закрыть();
	Иначе
		измЗадания = ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ТабИнструкцииПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элемент.ТекущиеДанные;
	Если ТекСтрока<>Неопределено Тогда
		ЗагрузитьИнструкцию(ТекСтрока.Инструкция);
		УИДстроки = ТекСтрока.УИДстроки;
	Иначе
		УИДстроки = "424242424242424242424242424242";
	КонецЕсли;
	    
    Элементы.ТабВопросы.ОтборСтрок = Новый ФиксированнаяСтруктура("УИДстроки", УИДстроки);

КонецПроцедуры


&НаСервере
Процедура СохранитьНаСервере()
	тзИнстр = РеквизитФормыВЗначение("ТабИнструкции");
	тзВопр = РеквизитФормыВЗначение("ТабВопросы");
	
	ДокОб = ДокЗадание.ПолучитьОбъект();
	ДокОб.Инструкции.Загрузить(тзИнстр);
	ДокОб.Вопросы.Загрузить(тзВопр);
	
	Если не ДокОб.ПометкаУдаления Тогда
		ДокОб.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ДокОб.Записать();
	КонецЕсли;
	измЗадания = ложь;
КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ТабИнструкцииПриИзменении(Элемент)
	измЗадания = истина;
КонецПроцедуры


&НаКлиенте
Процедура ТабВопросыПриИзменении(Элемент)
	измЗадания = истина;
КонецПроцедуры

