
&НаКлиенте
Процедура ПробитьЧек(Команда)
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ДополнительныеПраваЗапретРедактированияЦенВДокументах, ДополнительныеПраваЗапретПримененияСкидок");
	
	//управление доступностью элементов
	Если РеквизитыПользователя.ДополнительныеПраваЗапретРедактированияЦенВДокументах Тогда
		МассивИменЭлементов = Документы.ЧекККМ.ПолучитьМассивРеквизитовПоЦенам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
	//#7771
	Если РеквизитыПользователя.ДополнительныеПраваЗапретПримененияСкидок Тогда
		МассивИменЭлементов = Документы.ЧекККМ.ПолучитьМассивРеквизитовПоСкидкам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Для каждого СтрокаТабличнойЧасти из Объект.Товары Цикл	
		ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьПризнакИспользованияХарактеристик(СтрокаТабличнойЧасти);
	КонецЦикла;
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ТоварыСтатьяДоходов");
	МассивЭлементов.Добавить("ТоварыСтатьяРасходов");
	ФинансыСервер.УстановитьВидимостьКолонокСтатейДиРВТабличнойЧасти(ЭтаФорма, МассивЭлементов, Истина);
	
	ОбновитьИтоговыеПоказателиКлиентСервер(ЭтотОбъект);
	
	ТолькоПросмотр = ТолькоПросмотр 
	             ИЛИ Объект.СтатусЧекаККМ = Перечисления.СтатусыЧековККМ.Пробитый
	             ИЛИ Объект.СтатусЧекаККМ = Перечисления.СтатусыЧековККМ.Архивный
	             ИЛИ Объект.СтатусЧекаККМ = Перечисления.СтатусыЧековККМ.Аннулированный;
				 
	Элементы.ФормаЗаписать.Видимость = НЕ ТолькоПросмотр;
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоговыеПоказателиКлиентСервер(Форма)

	Объект = Форма.Объект;
	
	ОбновитьСуммыПодвала(Объект.Товары, Объект.ЦенаВключаетНДС, Форма.СуммаВсего);
	ЗаполнитьСуммуВсегоВТаблице(Объект.Товары, Объект.ЦенаВключаетНДС);
	ОбновитьСуммыПодвала(Объект.Оплата, Истина, Форма.СуммаОплачено);
	
	СуммаРучнойСкидки = Объект.Товары.Итог("СуммаРучнойСкидки");
	СкидкиНаценкиИтогСумма = СуммаРучнойСкидки;
	
	Форма.СкидкиНаценкиИтогСумма = СкидкиНаценкиИтогСумма;
	Форма.СуммаБезСкидки = Форма.СуммаВсего + Форма.СкидкиНаценкиИтогСумма;
	Форма.СуммаКОплате = Форма.СуммаВсего - Форма.СуммаОплачено;
	Форма.Элементы.Контрагент.Видимость = ЗначениеЗаполнено(Объект.Контрагент);
	Форма.Элементы.ЧекККМПродажа.Видимость = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Возврат"));
	
	РассчитатьСдачуКлиентСервер(Форма);
	
	Форма.Элементы.СтатьяДоходов.Видимость = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Продажа"));
	Форма.Элементы.СтатьяРасходов.Видимость = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Возврат"));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСуммыПодвала(Знач Товары, Знач ЦенаВключаетНДС, СуммаВсего) Экспорт

	СуммаДокумента = СуммаДокумента(Товары, ЦенаВключаетНДС);

	Если СуммаДокумента <> СуммаВсего Тогда
		СуммаВсего = СуммаДокумента;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСуммуВсегоВТаблице(Таблица, ЦенаВключаетНДС) Экспорт
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		ЗаполнитьСуммуВсегоВСтрокеТаблицы(СтрокаТаблицы, ЦенаВключаетНДС);
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьСуммуВсегоВТаблице()

&НаКлиентеНаСервереБезКонтекста
Функция СуммаДокумента(Знач Товары, Знач ЦенаВключаетНДС) Экспорт

	СуммаДокумента = Товары.Итог("Сумма");

	Если Не ЦенаВключаетНДС Тогда
		СуммаДокумента = СуммаДокумента + Товары.Итог("СуммаНДС");
	КонецЕсли;

	Возврат СуммаДокумента;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСуммуВсегоВСтрокеТаблицы(СтрокаТаблицы, ЦенаВключаетНДС) Экспорт
	
	Если ЦенаВключаетНДС Тогда
		СтрокаТаблицы.СуммаВсего = СтрокаТаблицы.Сумма;
	Иначе
		СтрокаТаблицы.СуммаВсего = СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСуммуВсегоВСтрокеТаблицы()

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСдачуКлиентСервер(Форма)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ВидОплаты", ПредопределенноеЗначение("Перечисление.ВидыОплатЧекаККМ.Наличные"));
	
	СуммаНаличных  = 0;
	СтрокиНаличных = Форма.Объект.Оплата.НайтиСтроки(СтруктураПоиска);
	
	Для каждого СтрокаНаличных Из СтрокиНаличных Цикл
		СуммаНаличных = СуммаНаличных + СтрокаНаличных.Сумма;
	КонецЦикла;
	
	Форма.Сдача = Макс(Форма.Объект.Оплата.Итог("Сумма") - Форма.СуммаВсего, 0);
	Форма.Сдача = Мин(Форма.Сдача, СуммаНаличных);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ОбновитьИтоговыеПоказателиКлиентСервер(ЭтотОбъект);
	
КонецПроцедуры

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти