&НаСервере
Функция ПолучитьИмяЭлементаСпарвочникаПоИмениЭлементаФормы(ИмяЭлементаФормы)
	
	//ПРОИЗВОДСТВО
	Если ИмяЭлементаФормы = "Декорация2" Тогда Возврат "ПРОИЗВОДСТВО_ПросмотрСтартовогоВидео";
	ИначеЕсли ИмяЭлементаФормы = "Декорация4" Тогда Возврат "ПРОИЗВОДСТВО_СозданиеУчетныхЗаписей";
	ИначеЕсли ИмяЭлементаФормы = "Декорация6" Тогда Возврат "ПРОИЗВОДСТВО_СозданиеНоменклатуры";
	ИначеЕсли ИмяЭлементаФормы = "Декорация8" Тогда Возврат "ПРОИЗВОДСТВО_ЗагрузкаФактурыИзПостроителя";
	ИначеЕсли ИмяЭлементаФормы = "Декорация10" Тогда Возврат "ПРОИЗВОДСТВО_СозданиеИНазначениеЦенНоменклатуры";
	ИначеЕсли ИмяЭлементаФормы = "Декорация12" Тогда Возврат "ПРОИЗВОДСТВО_УстановкаЦенМатериаловДляРасчетаСтоимостиПотолка";
	ИначеЕсли ИмяЭлементаФормы = "Декорация14" Тогда Возврат "ПРОИЗВОДСТВО_УстановкаЦенНаУслугиПроизводства";
	ИначеЕсли ИмяЭлементаФормы = "Декорация16" Тогда Возврат "ПРОИЗВОДСТВО_АудитБизнесПроцессовВыборВариантаУчета";
	ИначеЕсли ИмяЭлементаФормы = "Декорация18" Тогда Возврат "ПРОИЗВОДСТВО_ТестоваяЗагрузкаПотолков";
	ИначеЕсли ИмяЭлементаФормы = "Декорация20" Тогда Возврат "ПРОИЗВОДСТВО_ОчисткаБазыОтТестовыхДокументов";
	ИначеЕсли ИмяЭлементаФормы = "Декорация22" Тогда Возврат "ПРОИЗВОДСТВО_ВводНачальныхОстатковПоСкладу";
	ИначеЕсли ИмяЭлементаФормы = "Декорация24" Тогда Возврат "ПРОИЗВОДСТВО_ВводНачальныхВзаиморасчетовСКонтрагентами";
	ИначеЕсли ИмяЭлементаФормы = "Декорация26" Тогда Возврат "ПРОИЗВОДСТВО_ВводНачальныхОстатковПоКассе";
	ИначеЕсли ИмяЭлементаФормы = "Декорация28" Тогда Возврат "ПРОИЗВОДСТВО_НачалоРаботы";
	ИначеЕсли ИмяЭлементаФормы = "Декорация94" Тогда Возврат "ПРОИЗВОДСТВО_ПерезаказОтреза";
	ИначеЕсли ИмяЭлементаФормы = "Декорация96" Тогда Возврат "ПРОИЗВОДСТВО_ПерезаказПотолка";
	ИначеЕсли ИмяЭлементаФормы = "Декорация98" Тогда Возврат "ПРОИЗВОДСТВО_Перераскрой";
	ИначеЕсли ИмяЭлементаФормы = "Декорация100" Тогда Возврат "ПРОИЗВОДСТВО_ИзменениеФактурыИлиПотолка";
	ИначеЕсли ИмяЭлементаФормы = "Декорация102" Тогда Возврат "ПРОИЗВОДСТВО_ВозвратПродукции";
	ИначеЕсли ИмяЭлементаФормы = "Декорация104" Тогда Возврат "ПРОИЗВОДСТВО_ВозвратТовараПокупателем";
	ИначеЕсли ИмяЭлементаФормы = "Декорация106" Тогда Возврат "ПРОИЗВОДСТВО_ОбучениеСотрудников";
		
	ИначеЕсли ИмяЭлементаФормы = "Декорация110" Тогда Возврат "ПРОИЗВОДСТВО_СозданиеКонтрагентов";
	ИначеЕсли ИмяЭлементаФормы = "Декорация112" Тогда Возврат "ПРОИЗВОДСТВО_НастройкаПравПользователей";
	//РОЗНИЦА
	ИначеЕсли ИмяЭлементаФормы = "Декорация30" Тогда Возврат "РОЗНИЦА_ПросмотрСтартовогоВидео";
	ИначеЕсли ИмяЭлементаФормы = "Декорация32" Тогда Возврат "РОЗНИЦА_СозданиеУчетныхЗаписей";
	ИначеЕсли ИмяЭлементаФормы = "Декорация34" Тогда Возврат "РОЗНИЦА_СозданиеНоменклатурыДляРозницы";
	ИначеЕсли ИмяЭлементаФормы = "Декорация36" Тогда Возврат "РОЗНИЦА_СозданиеНоменклатурыМатериалов";
	ИначеЕсли ИмяЭлементаФормы = "Декорация38" Тогда Возврат "РОЗНИЦА_ИмпортИлиСозданиеФактур";
	ИначеЕсли ИмяЭлементаФормы = "Декорация40" Тогда Возврат "РОЗНИЦА_СозданиеИУстановкаЦенНоменклатуры";
	ИначеЕсли ИмяЭлементаФормы = "Декорация42" Тогда Возврат "РОЗНИЦА_УстановкаЦенДляРасчетаСтоимостиПотолка";
	ИначеЕсли ИмяЭлементаФормы = "Декорация44" Тогда Возврат "РОЗНИЦА_ОзнакомлениеСВариантомУчетаБизнесПроцессов";
	ИначеЕсли ИмяЭлементаФормы = "Декорация46" Тогда Возврат "РОЗНИЦА_ТестирвоаниеЦепочкиДокументовЛидДоговорМонтаж";
	ИначеЕсли ИмяЭлементаФормы = "Декорация48" Тогда Возврат "РОЗНИЦА_УдалениеТестовыхДокументов";
	ИначеЕсли ИмяЭлементаФормы = "Декорация50" Тогда Возврат "РОЗНИЦА_ВводНачальныхОстатковПоСкладу";
	ИначеЕсли ИмяЭлементаФормы = "Декорация52" Тогда Возврат "РОЗНИЦА_ВводНачальныхВзаиморасчетовСКонтрагентами";
	ИначеЕсли ИмяЭлементаФормы = "Декорация54" Тогда Возврат "РОЗНИЦА_ВводНачальныхОстатковПоКассе";
	ИначеЕсли ИмяЭлементаФормы = "Декорация56" Тогда Возврат "РОЗНИЦА_НачалоРаботы";
	ИначеЕсли ИмяЭлементаФормы = "Декорация58" Тогда Возврат "РОЗНИЦА_СозданиеСпецификацийДляУслуг";
	ИначеЕсли ИмяЭлементаФормы = "Декорация60" Тогда Возврат "РОЗНИЦА_УстановкаМобильногоПриложения";
	ИначеЕсли ИмяЭлементаФормы = "Декорация62" Тогда Возврат "РОЗНИЦА_НастройкаПравПользователей";
	ИначеЕсли ИмяЭлементаФормы = "Декорация108" Тогда Возврат "РОЗНИЦА_ОбучениеСотрудников";
	//НЕИЗВЕСТНЫЙ ЭЛМЕНТ
	Иначе Возврат Неопределено; КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначениеГалочки(ИмяЭлементаФормы)
	
	ИмяЭлементаСправочника = ПолучитьИмяЭлементаСпарвочникаПоИмениЭлементаФормы(ИмяЭлементаФормы);
	
	Если Справочники.ЭтапыВнедрения[ИмяЭлементаСправочника].Выполнен Тогда
		Элементы[ИмяЭлементаФормы].Картинка = БиблиотекаКартинок.Успешно16;
	Иначе
		Элементы[ИмяЭлементаФормы].Картинка = БиблиотекаКартинок.Пустая;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗначениеГалочки(ИмяЭлементаФормы)
	
	ИмяЭлементаСправочника = ПолучитьИмяЭлементаСпарвочникаПоИмениЭлементаФормы(ИмяЭлементаФормы);
	
	ЭлОб = Справочники.ЭтапыВнедрения[ИмяЭлементаСправочника].ПолучитьОбъект();
	ЭлОб.Выполнен = НЕ ЭлОб.Выполнен;
	Если ЭлОб.Выполнен Тогда
		ЭлОб.ДатаВыполнения = ТекущаяДатаСеанса();
		ЭлОб.КтоВыполнил = Пользователи.ТекущийПользователь();
	КонецЕсли;
	ЭлОб.Записать();
	УстановитьЗначениеГалочки(ИмяЭлементаФормы);
	
	ОбновитьДоступнстьГалочек();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПроизводству(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПроизводство;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКРознице(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРозница;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступнстьГалочек()
	
	//производство
	НомерПервойГалочки = 0;
	ТекущаяГалочка = 0;
	Для Каждого ТекГалочка Из ГалочкиПроизводства Цикл
		//определяем доступность по значению реквизита элемента справочника
		Если ТекущаяГалочка = НомерПервойГалочки Тогда
			//первая доступна всегда
			ТекГалочка.Доступность = Истина;
		Иначе
			Если Справочники.ЭтапыВнедрения[ПолучитьИмяЭлементаСпарвочникаПоИмениЭлементаФормы(ГалочкиПроизводства[ТекущаяГалочка-1].Галочка)].Выполнен Тогда
				ТекГалочка.Доступность = Истина;
			Иначе
				ТекГалочка.Доступность = Ложь;
			КонецЕсли;
		КонецЕсли;
		ТекущаяГалочка = ТекущаяГалочка + 1;
		
		//делаем доступными элементы формы
		Элементы[ТекГалочка.Галочка].Доступность = ТекГалочка.Доступность;
		Элементы[ТекГалочка.Надпись].Доступность = ТекГалочка.Доступность;
		//Элементы[ТекГалочка.КнопкаВопрос].Доступность = ТекГалочка.Доступность;
	КонецЦикла;
	
	//розница
	НомерПервойГалочки = 0;
	ТекущаяГалочка = 0;
	Для Каждого ТекГалочка Из ГалочкиРозницы Цикл
		//определяем доступность по значению реквизита элемента справочника
		Если ТекущаяГалочка = НомерПервойГалочки Тогда
			//первая доступна всегда
			ТекГалочка.Доступность = Истина;
		Иначе
			Если Справочники.ЭтапыВнедрения[ПолучитьИмяЭлементаСпарвочникаПоИмениЭлементаФормы(ГалочкиРозницы[ТекущаяГалочка-1].Галочка)].Выполнен Тогда
				ТекГалочка.Доступность = Истина;
			Иначе
				ТекГалочка.Доступность = Ложь;
			КонецЕсли;
		КонецЕсли;
		ТекущаяГалочка = ТекущаяГалочка + 1;
		
		//делаем доступными элементы формы
		Элементы[ТекГалочка.Галочка].Доступность = ТекГалочка.Доступность;
		Элементы[ТекГалочка.Надпись].Доступность = ТекГалочка.Доступность;
		//Элементы[ТекГалочка.КнопкаВопрос].Доступность = ТекГалочка.Доступность;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОписаниеГалочкиПроизводство(ИмяГалочки, ИмяНадписи, Доступно, ИмяКнопкиВопрос = "")
	
	НоваяСтрока = ГалочкиПроизводства.Добавить();
	НоваяСтрока.Галочка = ИмяГалочки;
	НоваяСтрока.Надпись = ИмяНадписи;
	НоваяСтрока.Доступность = Доступно;
	//НоваяСтрока.КнопкаВопрос = ИмяКнопкиВопрос;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОписаниеГалочкиРозница(ИмяГалочки, ИмяНадписи, Доступно, ИмяКнопкиВопрос = "")
	
	НоваяСтрока = ГалочкиРозницы.Добавить();
	НоваяСтрока.Галочка = ИмяГалочки;
	НоваяСтрока.Надпись = ИмяНадписи;
	НоваяСтрока.Доступность = Доступно;
	//НоваяСтрока.КнопкаВопрос = ИмяКнопкиВопрос;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	//заполним значения - ПРОИЗВОДСТВО
	ДобавитьОписаниеГалочкиПроизводство("Декорация2","Декорация1",Истина, "Декорация63");
	ДобавитьОписаниеГалочкиПроизводство("Декорация4","Декорация3", Ложь, "Декорация64");
	ДобавитьОписаниеГалочкиПроизводство("Декорация6","Декорация5", Ложь, "Декорация65");
	ДобавитьОписаниеГалочкиПроизводство("Декорация8","Декорация7", Ложь, "Декорация66");
	ДобавитьОписаниеГалочкиПроизводство("Декорация10","Декорация9", Ложь, "Декорация67");
	ДобавитьОписаниеГалочкиПроизводство("Декорация12","Декорация11", Ложь, "Декорация68");
	ДобавитьОписаниеГалочкиПроизводство("Декорация14","Декорация13", Ложь, "Декорация69");
	ДобавитьОписаниеГалочкиПроизводство("Декорация16","Декорация15", Ложь, "Декорация70");
	ДобавитьОписаниеГалочкиПроизводство("Декорация18","Декорация17", Ложь, "Декорация71");
	ДобавитьОписаниеГалочкиПроизводство("Декорация20","Декорация19", Ложь, "Декорация72");
	ДобавитьОписаниеГалочкиПроизводство("Декорация22","Декорация21", Ложь, "Декорация73");
	ДобавитьОписаниеГалочкиПроизводство("Декорация24","Декорация23", Ложь, "Декорация74");
	ДобавитьОписаниеГалочкиПроизводство("Декорация26","Декорация25", Ложь, "Декорация75");
	ДобавитьОписаниеГалочкиПроизводство("Декорация28","Декорация27", Ложь, "Декорация76");
	
	//ДобавитьОписаниеГалочкиПроизводство("Декорация94","Декорация95", Ложь, "");
	//ДобавитьОписаниеГалочкиПроизводство("Декорация96","Декорация97", Ложь, "");
	//ДобавитьОписаниеГалочкиПроизводство("Декорация98","Декорация99", Ложь, "");
	//ДобавитьОписаниеГалочкиПроизводство("Декорация100","Декорация101", Ложь, "");
	//ДобавитьОписаниеГалочкиПроизводство("Декорация102","Декорация103", Ложь, "");
	//ДобавитьОписаниеГалочкиПроизводство("Декорация104","Декорация105", Ложь, "");
	
	ДобавитьОписаниеГалочкиПроизводство("Декорация110","Декорация111", Ложь, "");
	ДобавитьОписаниеГалочкиПроизводство("Декорация112","Декорация113", Ложь, "");
	
	ДобавитьОписаниеГалочкиПроизводство("Декорация106","Декорация107", Ложь, "");
	
		
	Для Каждого ТекГалочка Из ГалочкиПроизводства Цикл
		УстановитьЗначениеГалочки(ТекГалочка.Галочка);
	КонецЦикла;
	
	//заполним значения - РОЗНИЦА
	ДобавитьОписаниеГалочкиРозница("Декорация30","Декорация29", Истина, "Декорация77");
	ДобавитьОписаниеГалочкиРозница("Декорация32","Декорация31", Ложь, "Декорация78");
	ДобавитьОписаниеГалочкиРозница("Декорация34","Декорация33", Ложь, "Декорация79");
	ДобавитьОписаниеГалочкиРозница("Декорация36","Декорация35", Ложь, "Декорация80");
	ДобавитьОписаниеГалочкиРозница("Декорация38","Декорация37", Ложь, "Декорация81");
	ДобавитьОписаниеГалочкиРозница("Декорация40","Декорация39", Ложь, "Декорация82");
	ДобавитьОписаниеГалочкиРозница("Декорация42","Декорация41", Ложь, "Декорация83");
	ДобавитьОписаниеГалочкиРозница("Декорация44","Декорация43", Ложь, "Декорация84");
	ДобавитьОписаниеГалочкиРозница("Декорация46","Декорация45", Ложь, "Декорация85");
	ДобавитьОписаниеГалочкиРозница("Декорация48","Декорация47", Ложь, "Декорация86");
	ДобавитьОписаниеГалочкиРозница("Декорация50","Декорация49", Ложь, "Декорация87");
	ДобавитьОписаниеГалочкиРозница("Декорация52","Декорация51", Ложь, "Декорация88");
	ДобавитьОписаниеГалочкиРозница("Декорация54","Декорация53", Ложь, "Декорация89");
	ДобавитьОписаниеГалочкиРозница("Декорация56","Декорация55", Ложь, "Декорация90");
	ДобавитьОписаниеГалочкиРозница("Декорация58","Декорация57", Ложь, "Декорация91");
	ДобавитьОписаниеГалочкиРозница("Декорация62","Декорация61", Ложь, "Декорация93");
	ДобавитьОписаниеГалочкиРозница("Декорация108","Декорация109", Ложь, "");
	ДобавитьОписаниеГалочкиРозница("Декорация60","Декорация59", Ложь, "Декорация92");
	Для Каждого ТекГалочка Из ГалочкиРозницы Цикл
		УстановитьЗначениеГалочки(ТекГалочка.Галочка);
	КонецЦикла;
	
	
	ОбновитьДоступнстьГалочек();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаПервуюСтраницу(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПервая;
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	
	ИзменитьЗначениеГалочки(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяГалочкиПоИмениКнопкиВопрос(ИмяКнопкиВопрос)
	
	Отбор = Новый Структура;
	Отбор.Вставить("КнопкаВопрос", ИмяКнопкиВопрос);
	НайденныеСтроки = ГалочкиПроизводства.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0].Галочка;
	Иначе
		НайденныеСтроки = ГалочкиРозницы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат НайденныеСтроки[0].Галочка;
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ПолучитьНазваниеЭтапаИзПредопределенногоЭлемента(ИмяЭлемента)
	Возврат Справочники.ЭтапыВнедрения[ИмяЭлемента].Наименование;
КонецФункции

&НаКлиенте
Процедура Декорация63Нажатие(Элемент)
	
	СтруктураВопроса = Новый Структура;
	СтруктураВопроса.Вставить("Галочка", ПолучитьИмяГалочкиПоИмениКнопкиВопрос(Элемент.Имя));
	СтруктураВопроса.Вставить("ИмяЭлемента", ПолучитьИмяЭлементаСпарвочникаПоИмениЭлементаФормы(СтруктураВопроса.Галочка));
	СтруктураВопроса.Вставить("ИмяЭтапа", ПолучитьНазваниеЭтапаИзПредопределенногоЭлемента(СтруктураВопроса.ИмяЭлемента));
	ОткрытьФорму("Справочник.ЭтапыВнедрения.Форма.ОтправкаВопросаПоЭтапуВнедрения", СтруктураВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаметки(Команда)
	
	ОткрытьФорму("Справочник.ЭтапыВнедрения.Форма.ФормаЗаметок",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
