Процедура ЗаполнитьИспользованиеСтатейВУчетеДоходовИРасходовПоУмолчанию() Экспорт
	
	//выполнять в любом случае
	//Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВедениеУчетаДоходовРасходов") Тогда
	//	Возврат;
	//КонецЕсли;
	
	Выборка = Справочники.СтатьиДоходовИРасходов.Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Предопределенный Тогда
			
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			СпрОбъект.ИспользуетсяВУчетеДоходов  = Ложь;
			СпрОбъект.ИспользуетсяВУчетеРасходов = Ложь;
			
			Если Выборка.ИмяПредопределенныхДанных = "Продажи"			
				ИЛИ Выборка.ИмяПредопределенныхДанных = "ВозвратПоставщику"  
				ИЛИ Выборка.ИмяПредопределенныхДанных = "ПрочиеДоходы" 
				ИЛИ Выборка.ИмяПредопределенныхДанных = "ОприходованиеТоваров"
				ИЛИ Выборка.ИмяПредопределенныхДанных = "ВозвратДСОтПоставщика"
				Тогда
				
				СпрОбъект.ИспользуетсяВУчетеДоходов = Истина;
			Иначе
				СпрОбъект.ИспользуетсяВУчетеРасходов = Истина;				
			КонецЕсли;
			
			Попытка
				СпрОбъект.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
