Функция ПолучитьРекламныйИсточникПоНомеруТелефонаНаСервере(НомерТелефона) Экспорт
	
	Результат = Справочники.РекламныеИсточники.ПустаяСсылка();
	
	Если ПустаяСтрока(НомерТелефона) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РекламныеИсточникиТелефонныеНомера.Ссылка
	|ИЗ
	|	Справочник.РекламныеИсточники.ТелефонныеНомера КАК РекламныеИсточникиТелефонныеНомера
	|ГДЕ
	|	РекламныеИсточникиТелефонныеНомера.ТелефонныйНомер ПОДОБНО &ТелефонныйНомер
	|	И РекламныеИсточникиТелефонныеНомера.Ссылка.ДоступенВРознице";
	Запрос.УстановитьПараметр("ТелефонныйНомер",НомерТелефона);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.ССылка;
		Прервать;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
