
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ФормаУдлитьВсе.Видимость = Ложь;
	
	Если Параметры.Фильтр Тогда
		Элемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
		Элемент.Использование = истина;
		
		Элементы.ФормаУдлитьВсе.Видимость = истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	Оповестить("ИА_ОбновитьУведомления");
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Задача = ПолучитьЗадачу(ВыбраннаяСтрока);
	ПоказатьЗначение(,Задача);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗадачу(ВыбраннаяСтрока)
	Возврат ВыбраннаяСтрока.Задача;
КонецФункции

&НаСервере
Процедура УдалитьВсеНаСервере()
	Набор = РегистрыСведений.ИА_УведомленияКЦ.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Значение = ПараметрыСеанса.ТекущийПользователь;
	Набор.Отбор.Пользователь.Использование = истина;
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьВсеЗавершение", ЭтотОбъект), "Вы уверены?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		УдалитьВсеНаСервере();
		Оповестить("ИА_ОбновитьУведомления");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

