
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//++ №9919 на основании монтажа запрещено создавать более одного документа начисления
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.Монтаж") Тогда
		
		СуществующийДокументНачисления = ОбщийМодульВызовСервера.УжеЕстьДокументНачисленияЗарплатыПоМонтажу(ПараметрКоманды);
		
		Если ЗначениеЗаполнено(СуществующийДокументНачисления) Тогда
			
			ПараметрыФормы = Новый Структура("Ключ", СуществующийДокументНачисления);
			
		Иначе
			
			ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
			
		КонецЕсли;
		
		ОткрытьФорму("Документ.НачислениеЗарплаты.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	//-- №9919
	
КонецПроцедуры
