&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Подразделение.Видимость = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	ТекущиеДанные.Коэффициент = 1;
	ТекущиеДанные.ТарифИсполнителя = ПолучитьТарифПоУмолчаниюНаСервере(ТекущиеДанные.Сотрудник);
КонецПроцедуры

&НаСервере
Функция ПолучитьТарифПоУмолчаниюНаСервере(Сотрудник)
	Возврат Сотрудник.ТарифМонтажа;
КонецФункции	

