
// Функция проверяет возможность печати чека на фискальном регистраторе.
//
// Параметры:
//	ФормаОбъекта - УправляемаяФорма - Форма документа.
//
// Возвращаемое значение:
//	Булево - Признак возможности печати.
//
Функция ПроверитьВозможностьПечатиЧека(ОбработчикОповещения, ФормаОбъекта) Экспорт
	
	ПечататьЧек = Истина;
	
	// Если объект не проведен или модифицирован - выполним проведение.
	Если НЕ ФормаОбъекта.Объект.Проведен
		ИЛИ НЕ ЗначениеЗаполнено(ФормаОбъекта.Объект.Ссылка)
		ИЛИ ФормаОбъекта.Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru='Операция возможна только после проведения документа, провести документ?'");
		ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		ПечататьЧек = Ложь;
		
	КонецЕсли;
	
	Возврат ПечататьЧек;

КонецФункции // ПроверитьВозможностьПечатиЧека()

// Получить структуру реквизитов фискальной операции кассового узла.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * Дата - Дата - Дата операции.
//   * ДокументОснование - ДокументСсылка - Ссылка на документ-основание.
//   * Организация - ОпределяемыйТип.ОрганизацияБПО - Организация.
//   * ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектБПО - Торговый объект.
//   * Устройство - СправочникСсылка.ПодключаемоеОборудование - Устройство.
//   * ТипОперации - ПеречислениеСсылка.ТипыОперацииКассовогоУзла - Тип операции.
//   * ТипРасчета - ПеречислениеСсылка.ТипыРассылкиЭлектронныхЧеков - Тип расчета.
//   * НомерЧекаККМ - Число - Номер чека ККМ.
//   * НомерСмены - Число - Номер смены ККМ.
//   * ВариантОтправкиЭлектронногоЧека - ПеречилениеСсылка.ВариантыОтправкиЭлектронногоЧека.
//   * КонтактныеДанныеЭлектронногоЧека - Строка - Контактные данные.
//   * Сумма - Число - Сумма.
//   * СуммаОплатыНаличные - Число - Сумма.
//   * СуммаОплатыПлатежнаяКарта - Число - Сумма.
//   * СуммаКредит - Число - Сумма.
//   * СуммаПредоплаты - Число - Сумма.
//   * СуммаВзаимозачет - Число - Сумма.
//   * Данные - Строка - XML фискальной операции.
//   * ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Функция СтруктураРеквизитыФискальнойОперации() Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	
	Реквизиты = Новый Структура;
	
	Реквизиты.Вставить("Результат");
	Реквизиты.Вставить("ВерсияФФД");
	
	Реквизиты.Вставить("Дата");
	Реквизиты.Вставить("ДокументОснование");
	Реквизиты.Вставить("Организация");
	//Реквизиты.Вставить("ТорговыйОбъект");
	Реквизиты.Вставить("Устройство");
	
	//Реквизиты.Вставить("ТипОперации");
	Реквизиты.Вставить("ТипРасчета");
	
	Реквизиты.Вставить("НомерЧекаККМ");
	Реквизиты.Вставить("НомерСмены");
	Реквизиты.Вставить("ВариантОтправкиЭлектронногоЧека");
	Реквизиты.Вставить("КонтактныеДанныеЭлектронногоЧека");
	
	Реквизиты.Вставить("Сумма");
	Реквизиты.Вставить("СуммаОплатыНаличные");
	Реквизиты.Вставить("СуммаОплатыПлатежнаяКарта");
	Реквизиты.Вставить("СуммаКредит");
	Реквизиты.Вставить("СуммаПредоплаты");
	Реквизиты.Вставить("СуммаВзаимозачет");
	
	Реквизиты.Вставить("Данные");
	
	Реквизиты.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Возврат Реквизиты;
	
КонецФункции

Процедура ВыполнитьДействиеПослеЗаписиФискальнойОперацииВЖурнал(Форма, ОповещениеПриЗавершении, ТекстСообщения) Экспорт
	
	ТребуетсяПовторнаяПопыткаЗаписи = Ложь;
	ИзмененныеДанныеЗаписаны = ПотолкиКассыОнлайн.ЗаписатьВЖурналФискальныхОпераций(
		ТребуетсяПовторнаяПопыткаЗаписи,
		ОповещениеПриЗавершении.ДополнительныеПараметры.ФискальнаяОперацияРеквизиты);
	
	Если Не ИзмененныеДанныеЗаписаны Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ДополнительныеПараметры.Вставить("ОписаниеОповещения", ОповещениеПриЗавершении);
		ДополнительныеПараметры.Вставить("ТекстСообщения", ТекстСообщения);
		ДополнительныеПараметры.Вставить("ВозвращатьРезультатФункции", Ложь);
		ДополнительныеПараметры.Вставить("РезультатПриУспешномПроведении", Новый Структура("ВыполненаОперацияНаУстройстве, ИзмененныеДанныеЗаписаны", Истина, Истина));
		ДополнительныеПараметры.Вставить("РезультатПриОтмене", Новый Структура("ВыполненаОперацияНаУстройстве, ИзмененныеДанныеЗаписаны", Истина, Ложь));
		ДополнительныеПараметры.Вставить("ИмяПроцедуры", "ЗаписатьВЖурналФискальныхОпераций");
		ДополнительныеПараметры.Вставить("РезультатОперации", ИзмененныеДанныеЗаписаны);
		
		Если Не ТребуетсяПовторнаяПопыткаЗаписи Тогда
			ОшибкаПриПроведенииЧекаВопросЗавершение(КодВозвратаДиалога.Отмена, ДополнительныеПараметры);
			Возврат;
		КонецЕсли;
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ОшибкаПриПроведенииЧекаВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры),
			ДополнительныеПараметры.ТекстСообщения,
			РежимДиалогаВопрос.ПовторитьОтмена, 10, КодВозвратаДиалога.Повторить,,КодВозвратаДиалога.Повторить);
		Возврат;
		
	Иначе
		
		ВыполнитьОбработкуОповещения(
			ОповещениеПриЗавершении,
			Новый Структура("ВыполненаОперацияНаУстройстве, ИзмененныеДанныеЗаписаны",
				Истина, Истина));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОшибкаПриПроведенииЧекаВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Отмена Тогда
		
		ТребуетсяПовторнаяПопыткаЗаписи = Ложь;
		Если ДополнительныеПараметры.ИмяПроцедуры = "ЗаписатьВЖурналФискальныхОпераций" Тогда
			РезультатОперации = ПотолкиКассыОнлайн.ЗаписатьВЖурналФискальныхОпераций(
				ТребуетсяПовторнаяПопыткаЗаписи,
				ДополнительныеПараметры.ОписаниеОповещения.ДополнительныеПараметры.ФискальнаяОперацияРеквизиты);
		КонецЕсли;
		
		Если (ТипЗнч(РезультатОперации) = Тип("Булево") И РезультатОперации) Тогда
			
			ВыполнитьОбработкуОповещения(
				ДополнительныеПараметры.ОписаниеОповещения,
				?(ДополнительныеПараметры.ВозвращатьРезультатФункции, РезультатОперации, ДополнительныеПараметры.РезультатПриУспешномПроведении));
			
		Иначе
			
			ПоказатьВопрос(
				Новый ОписаниеОповещения("ОшибкаПриПроведенииЧекаВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры),
				ДополнительныеПараметры.ТекстСообщения,
				РежимДиалогаВопрос.ПовторитьОтмена, 10, КодВозвратаДиалога.Повторить,,КодВозвратаДиалога.Повторить);
			
		КонецЕсли;
		
	Иначе
		
		ВыполнитьОбработкуОповещения(
			ДополнительныеПараметры.ОписаниеОповещения,
			?(ДополнительныеПараметры.ВозвращатьРезультатФункции, ДополнительныеПараметры.РезультатОперации, ДополнительныеПараметры.РезультатПриОтмене));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ФискальнаяОперацияЗаписанаВЖурнал(Результат, ДополнительныеПараметры) Экспорт
	
	ФискальнаяОперацияРеквизиты = ДополнительныеПараметры.ФискальнаяОперацияРеквизиты;
	
	ДополнительныеПараметры.Форма.Закрыть(ФискальнаяОперацияРеквизиты);
	
	//Если Результат.ВыполненаОперацияНаУстройстве
	//	И Результат.ИзмененныеДанныеЗаписаны Тогда
	//	
	//	ПараметрыОповещения = Новый Структура;
	//	ПараметрыОповещения.Вставить("ДокументСсылка", ФискальнаяОперацияРеквизиты.ДокументОснование);
	//	
	//	Оповестить("ОбновитьСтатусФискальныхОпераций", ПараметрыОповещения, ДополнительныеПараметры.Форма);
	//	
	//	Если ДополнительныеПараметры.ЗакрытьФорму Тогда
	//		ДополнительныеПараметры.Форма.Закрыть(ФискальнаяОперацияРеквизиты);
	//	Иначе
	//		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении);
	//	КонецЕсли;
	//	
	//Иначе
	//	
	//	Если Результат.ВыполненаОперацияНаУстройстве И Не Результат.ИзмененныеДанныеЗаписаны Тогда
	//		
	//		ПараметрыФормы = Новый Структура;
	//		ПараметрыФормы.Вставить("Данные", ФискальнаяОперацияРеквизиты.ДокументОснование);
	//		ПараметрыФормы.Вставить("ДанныеДляЖурналаРегистрации", ФискальнаяОперацияРеквизиты);
	//		ПараметрыФормы.Вставить("ТекстСообщения",
	//			НСтр("ru = 'ВНИМАНИЕ! Произошла исключительная ситуация:
	//			           |Чек ККМ пробит, но не зафиксирован в системе.'"));
	//		
	//		ОткрытьФорму("Документ.ЧекККМ.Форма.ОшибкаЗаписи", ПараметрыФормы, ЭтотОбъект);
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьЗаписьЖурналаФискальныхОпераций(Форма, ДанныеЖурналаФискальныхОпераций) Экспорт
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("ИдентификаторЗаписи", ДанныеЖурналаФискальныхОпераций.ИдентификаторЗаписи);
	ПараметрыЗаписи.Вставить("ДокументОснование",   ДанныеЖурналаФискальныхОпераций.ДокументОснование);
	
	ЗначениеКлюча = Новый Массив;
	ЗначениеКлюча.Добавить(ПараметрыЗаписи);
	
	КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.ФискальныеОперации", ЗначениеКлюча);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
	
	ОткрытьФорму("РегистрСведений.ФискальныеОперации.Форма.ФормаЗаписи", ПараметрыФормы, Форма);
	
КонецПроцедуры

// Открывает кассовую смену
//
// Параметры:
//  ПараметрыКассыККМ - Структура - Параметры кассы ККМ (ИдентификаторУстройства,
//                                  ИспользоватьБезПодключенияОборудования, КассаККМ)
//  ОписаниеОповещенияЗавершение - ОписаниеОповещения - Описание оповещения при завершении операции.
//
Процедура ОткрытьКассовуюСмену(ПараметрыКассыККМ, ОписаниеОповещенияЗавершение = Неопределено) Экспорт
		
	Если ТипЗнч(ПараметрыКассыККМ) = Тип("фиксированнаяСтруктура")
		Или ТипЗнч(ПараметрыКассыККМ) = Тип("Структура") Тогда
		ФискальноеУстройство = ПараметрыКассыККМ.ИдентификаторУстройства;
	Иначе
		ФискальноеУстройство = ПараметрыКассыККМ;
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ФискальноеУстройство",         ФискальноеУстройство);
	Контекст.Вставить("ОписаниеОповещенияЗавершение", ОписаниеОповещенияЗавершение);
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	
	РеквизитыКассира = ПотолкиКассыОнлайн.РеквизитыКассира();
	ПараметрыОперации.Кассир = РеквизитыКассира.Наименование;
	ПараметрыОперации.КассирИНН = РеквизитыКассира.ИНН;
	
	РеквизитыАдресаМестаРасчетов = ПотолкиКассыОнлайн.РеквизитыАдресаМестаРасчетов(ФискальноеУстройство);
	ПараметрыОперации.АдресРасчетов = РеквизитыАдресаМестаРасчетов.АдресРасчетов;
	ПараметрыОперации.МестоРасчетов = РеквизитыАдресаМестаРасчетов.МестоРасчетов;
	
	МенеджерОборудованияКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(
		Новый ОписаниеОповещения("ПослеВыполненияКомандыОткрытияСмены", ЭтотОбъект, Контекст),
		Новый УникальныйИдентификатор,
		ПараметрыОперации,
		ФискальноеУстройство);
	
КонецПроцедуры

// Закрывает кассовую смену
//
// Параметры:
//  ПараметрыКассыККМ - Структура - Параметры кассы ККМ (ИдентификаторУстройства,
//                                  ИспользоватьБезПодключенияОборудования, КассаККМ)
//  ОписаниеОповещенияЗавершение - ОписаниеОповещения - Описание оповещения при завершении операции.
//
Процедура ЗакрытьКассовуюСмену(ПараметрыКассыККМ, ОписаниеОповещенияЗавершение = Неопределено) Экспорт
		
	Если ТипЗнч(ПараметрыКассыККМ) = Тип("фиксированнаяСтруктура")
		Или ТипЗнч(ПараметрыКассыККМ) = Тип("Структура") Тогда
		//ФискальноеУстройство = ПараметрыКассыККМ.ИдентификаторУстройства;
		//ОборудованиеПодключено = МенеджерОборудованияУТКлиент.ОборудованиеПодключено(ФискальноеУстройство);
	Иначе
		ФискальноеУстройство   = ПараметрыКассыККМ;
		ОборудованиеПодключено = Истина;
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ФискальноеУстройство",         ФискальноеУстройство);
	Контекст.Вставить("ОписаниеОповещенияЗавершение", ОписаниеОповещенияЗавершение);
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	
	РеквизитыКассира = ПотолкиКассыОнлайн.РеквизитыКассира();
	ПараметрыОперации.Кассир = РеквизитыКассира.Наименование;
	ПараметрыОперации.КассирИНН = РеквизитыКассира.ИНН;
	
	РеквизитыАдресаМестаРасчетов = ПотолкиКассыОнлайн.РеквизитыАдресаМестаРасчетов(ФискальноеУстройство);
	ПараметрыОперации.АдресРасчетов = РеквизитыАдресаМестаРасчетов.АдресРасчетов;
	ПараметрыОперации.МестоРасчетов = РеквизитыАдресаМестаРасчетов.МестоРасчетов;
	
	МенеджерОборудованияКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(
		Новый ОписаниеОповещения("ПослеВыполненияКомандыЗакрытияСмены", ЭтотОбъект, Контекст),
		Новый УникальныйИдентификатор,
		ПараметрыОперации,
		ФискальноеУстройство);
	
КонецПроцедуры

#Область УправлениеСостояниемСмены

// Контролирует параметры текущей кассовой смены, при необходимости открывает и закрывает кассовую смену.
//
// Параметры:
//  Форма - Форма - Форма документа в которой выполняется контроль кассовой смены
//  ОписаниеОповещенияЗавершение - ОписаниеОповещения - Описание оповещения при завершении операции
//
Процедура ОбработатьСостояниеСмены(Форма, ОписаниеОповещенияЗавершение) Экспорт
		
	ПараметрыКассыККМ = Форма.ПараметрыККТ.ИдентификаторУстройства;
	Форма.СтруктураСостояниеКассовойСмены = ПотолкиКассыОнлайн.ПолучитьСостояниеКассовойСмены(Форма.ПараметрыККТ.ИдентификаторУстройства);
	
	
	ЗаполнитьЗначенияСвойств(Форма.Объект, Форма.СтруктураСостояниеКассовойСмены);
	
	Если Не Форма.СтруктураСостояниеКассовойСмены.СменаОткрыта Тогда
		
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		//НСтр("ru = 'Кассовая смена не открыта.'"));
		//
		//ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершение, Ложь);
		//Возврат;
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("ОткрытьКассовуюСмену", НСтр("ru = 'Открыть смену'"));
		Кнопки.Добавить("Отмена",               НСтр("ru = 'Отмена'"));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОбработкаОповещения", ОписаниеОповещенияЗавершение);
		ДополнительныеПараметры.Вставить("ПараметрыКассыККМ", ПараметрыКассыККМ);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("УправлениеСостояниемСменыОбработкаКоманды", ПотолкиКассыОнлайнКлиент, ДополнительныеПараметры),
			НСтр("ru = 'Перед выполнением операции требуется открыть новую кассовую смену.'"), Кнопки);
		Возврат;
		
	КонецЕсли;
	
	Если Форма.СтруктураСостояниеКассовойСмены.Ошибка24Часа
		И Форма.СтруктураСостояниеКассовойСмены.СменаОткрыта Тогда
		
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		//НСтр("ru = 'С момента открытия смены прошло более 24 часов. Перед выполнением операции требуется открыть новую кассовую смену.'"));
		//
		//ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершение, Ложь);
		//Возврат;
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("ЗакрытьИОткрытьКассовуюСмену", НСтр("ru = 'Открыть смену'"));
		Кнопки.Добавить("Отмена",                       НСтр("ru = 'Отмена'"));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОбработкаОповещения", ОписаниеОповещенияЗавершение);
		ДополнительныеПараметры.Вставить("ПараметрыКассыККМ", ПараметрыКассыККМ);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("УправлениеСостояниемСменыОбработкаКоманды", ПотолкиКассыОнлайнКлиент, ДополнительныеПараметры),
			НСтр("ru = 'С момента открытия смены прошло более 24 часов. Перед выполнением операции требуется открыть новую кассовую смену.'"), Кнопки);
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершение, Истина);
	
КонецПроцедуры

Процедура УправлениеСостояниемСменыОбработкаКоманды(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = "ОткрытьКассовуюСмену" Тогда
		ОткрытьКассовуюСмену(
			ДополнительныеПараметры.ПараметрыКассыККМ,
			Новый ОписаниеОповещения("УправлениеСостояниемСменыПослеОткрытияКассовойСмены", ПотолкиКассыОнлайнКлиент, ДополнительныеПараметры));
	КонецЕсли;
	
	Если Результат = "ЗакрытьИОткрытьКассовуюСмену" Тогда
		ЗакрытьКассовуюСмену(
			ДополнительныеПараметры.ПараметрыКассыККМ,
			Новый ОписаниеОповещения("УправлениеСостояниемСменыПослеЗакрытияКассовойСмены", ПотолкиКассыОнлайнКлиент, ДополнительныеПараметры));
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеСостояниемСменыПослеЗакрытияКассовойСмены(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.ПараметрыКассыККМ) = Тип("Структура")
			Или ТипЗнч(ДополнительныеПараметры.ПараметрыКассыККМ) = Тип("ФиксированнаяСтруктура") Тогда
			КассаККМФискальноеУстройство = ДополнительныеПараметры.ПараметрыКассыККМ.КассаККМ;
		Иначе
			КассаККМФискальноеУстройство = ДополнительныеПараметры.ПараметрыКассыККМ;
		КонецЕсли;
		
		ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены = ПотолкиКассыОнлайн.ПолучитьСостояниеКассовойСмены(КассаККМФискальноеУстройство);
		
		//Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма, "Объект")
		//	И ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма.Объект, "Кассир") Тогда
		//	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены,,"Кассир");
		//ИначеЕсли ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма, "Объект") Тогда
		//	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены);
		//КонецЕсли;
		
		Если Не ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены.СменаОткрыта Тогда
			ОткрытьКассовуюСмену(ДополнительныеПараметры.ПараметрыКассыККМ, ДополнительныеПараметры.ОбработкаОповещения);
		Иначе
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаОповещения, Ложь);
		КонецЕсли;
		
	Иначе
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаОповещения, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеСостояниемСменыПослеОткрытияКассовойСмены(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.ПараметрыКассыККМ) = Тип("Структура")
			Или ТипЗнч(ДополнительныеПараметры.ПараметрыКассыККМ) = Тип("ФиксированнаяСтруктура") Тогда
			КассаККМФискальноеУстройство = ДополнительныеПараметры.ПараметрыКассыККМ.КассаККМ;
		Иначе
			КассаККМФискальноеУстройство = ДополнительныеПараметры.ПараметрыКассыККМ;
		КонецЕсли;
		
		ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены = ПотолкиКассыОнлайн.ПолучитьСостояниеКассовойСмены(КассаККМФискальноеУстройство);
		
		//Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма, "Объект")
		//	И ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма.Объект, "Кассир") Тогда
		//	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены,,"Кассир");
		//ИначеЕсли ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма, "Объект") Тогда
		//	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены);
		//КонецЕсли;
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаОповещения, Истина);
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаОповещения, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КассовыеСмены

Процедура ПослеВыполненияКомандыОткрытияСмены(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	СменаОткрытаНаУстройстве = РезультатВыполнения.Результат;
	Если Не СменаОткрытаНаУстройстве Тогда
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'При открытии смены произошла ошибка.
			           |Смена не открыта на фискальном устройстве.
			           |Дополнительное описание:
			           |%1'"),
			РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОписаниеОповещенияЗавершение <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияЗавершение, СменаОткрытаНаУстройстве);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВыполненияКомандыЗакрытияСмены(РезультатВыполнения, Контекст) Экспорт
	
	СнятZОтчетНаУстройстве = РезультатВыполнения.Результат;
	Если СнятZОтчетНаУстройстве Тогда
		
		//СформироватьОтчетОРозничныхПродажах(Контекст.ФискальноеУстройство);
		
		Если Контекст.ОписаниеОповещенияЗавершение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОписаниеОповещенияЗавершение, Истина);
		КонецЕсли;
		
	Иначе
		
		ТекстВопроса = НСтр("ru = 'При снятии отчета на фискальном устройстве произошла ошибка.
		                    |""%ОписаниеОшибки%""
		                    |
		                    |Если смена на фискальном устройстве закрыта, то
		                    |нажмите ""Да"".
		                    |
		                    |Закрыть смену?'");
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОписаниеОшибки",               РезультатВыполнения.ОписаниеОшибки);
		ДополнительныеПараметры.Вставить("ОписаниеОповещенияЗавершение", Контекст.ОписаниеОповещенияЗавершение);
		ДополнительныеПараметры.Вставить("ФискальноеУстройство",         Контекст.ФискальноеУстройство);
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения(
				"ПослеОтветаНаВопросОПринудительномФормированииОтчетаОРозничныхПродажах",
				ПотолкиКассыОнлайнКлиент,
				ДополнительныеПараметры),
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеОтветаНаВопросОПринудительномФормированииОтчетаОРозничныхПродажах(РезультатВопроса, Контекст) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		//СформироватьОтчетОРозничныхПродажах(Контекст.ФискальноеУстройство);
		
		Если Контекст.ОписаниеОповещенияЗавершение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОписаниеОповещенияЗавершение, Истина);
		КонецЕсли;
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'При снятии отчета на фискальном устройстве произошла ошибка.
		                     |""%ОписаниеОшибки%""
		                     |Отчет на фискальном устройстве не сформирован.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", Контекст.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Если Контекст.ОписаниеОповещенияЗавершение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОписаниеОповещенияЗавершение, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

