
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Невыходы
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Сотрудник");
	ТаблицаДвижений.Колонки.Добавить("ТочкаПродаж");
	ТаблицаДвижений.Колонки.Добавить("Бригада");
	ТаблицаДвижений.Колонки.Добавить("Дата", новый ОписаниеТипов("Дата"));
	ТаблицаДвижений.Колонки.Добавить("ВремяНачала", новый ОписаниеТипов("Дата"));
	ТаблицаДвижений.Колонки.Добавить("ВремяОкончания", новый ОписаниеТипов("Дата"));
	ТаблицаДвижений.Колонки.Добавить("Комментарий", новый ОписаниеТипов("Строка"));
	
	//нужно невыход разбить на дневные интервалы, т.к. в регистре запись хранится в разрезе дней
	Для Каждого ТекущаяСтрока Из Сотрудники Цикл
		ВремДатаНачала = ТекущаяСтрока.ДатаНачала;
		Пока ВремДатаНачала <= ТекущаяСтрока.ДатаОкончания Цикл
			НоваяСтрока = ТаблицаДвижений.Добавить();
			НоваяСтрока.Сотрудник = ТекущаяСтрока.Сотрудник;
			НоваяСтрока.ТочкаПродаж = ТекущаяСтрока.ТочкаПродаж;
			НоваяСтрока.Комментарий = ТекущаяСтрока.Комментарий;
			НоваяСтрока.Дата = ВремДатаНачала;
			НоваяСтрока.ВремяНачала = ?(ВремДатаНачала = ТекущаяСтрока.ДатаНачала, ТекущаяСтрока.ВремяНачала, Дата(1,1,1,0,0,1));
			НоваяСтрока.ВремяОкончания = ?(ВремДатаНачала < ТекущаяСтрока.ДатаОкончания, Дата(1,1,1,23,59,59), ТекущаяСтрока.ВремяОкончания);
			ВремДатаНачала = ВремДатаНачала + 86400;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из Бригады Цикл
		ВремДатаНачала = ТекущаяСтрока.ДатаНачала;
		Пока ВремДатаНачала <= ТекущаяСтрока.ДатаОкончания Цикл
			НоваяСтрока = ТаблицаДвижений.Добавить();
			НоваяСтрока.Бригада = ТекущаяСтрока.Бригада;
			НоваяСтрока.Комментарий = ТекущаяСтрока.Комментарий;
			НоваяСтрока.Дата = ВремДатаНачала;
			НоваяСтрока.ВремяНачала = ?(ВремДатаНачала = ТекущаяСтрока.ДатаНачала, ТекущаяСтрока.ВремяНачала, Дата(1,1,1,0,0,1));
			НоваяСтрока.ВремяОкончания = ?(ВремДатаНачала < ТекущаяСтрока.ДатаОкончания, Дата(1,1,1,23,59,59), ТекущаяСтрока.ВремяОкончания);
			ВремДатаНачала = ВремДатаНачала + 86400;
		КонецЦикла;	
	КонецЦикла;
	
	Движения.Невыходы.Записывать = Истина;	
	Для Каждого ТекущаяСтрока Из ТаблицаДвижений Цикл
		Движение = Движения.Невыходы.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекущаяСтрока);
	КонецЦикла;
	
	//Движения.Замеры.Записывать = Истина;
	//Если ТаблицаДвижений.Количество() > 0 Тогда
	//	Для Каждого ТекущаяСтрока Из ТаблицаДвижений Цикл
	//		Движение = Движения.Замеры.Добавить();
	//		Движение.Замер = Ссылка;
	//		Движение.Сотрудник = ТекущаяСтрока.Сотрудник;
	//		Движение.Дата = ТекущаяСтрока.Дата;
	//		Движение.ВремяНачала = ТекущаяСтрока.ВремяНачала;
	//		Движение.ВремяОкончания = ТекущаяСтрока.ВремяОкончания;
	//		Если НЕ ПустаяСтрока(ТекущаяСтрока.Комментарий) Тогда
	//			Движение.Комментарий = ТекущаяСтрока.Комментарий;
	//		Иначе
	//			Движение.Комментарий = "Отсутствует";
	//		КонецЕсли;
	//		Движение.ОтсутствиеИсполнителя = Истина;
	//		Движение.Результат = Справочники.РезультатыЗамера.ПустаяСсылка();
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры
