&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	рез = новый Массив;
	
	Для каждого стр из ТаблицаЗаймов Цикл
		Если стр.Выбрать Тогда
			НовСтрукт = Новый Структура("Фонд,Подразделение,Сумма,ПричинаЗайма,СФонда,СПодразделения,КрайнийСрок,ИсточникОтложенногоДохода,ид,ДатаЗайма");
			ЗаполнитьЗначенияСвойств(НовСтрукт, стр);
			Рез.Добавить(НовСтрукт);
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(рез);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	
	Элементы.ТаблицаЗаймовПодразделние.Видимость = ИспПодразделения;
	Элементы.ТаблицаЗаймовСПодразделения.Видимость = ИспПодразделения;
	
	Для каждого стр из Параметры.тзЗаймов Цикл 
		Новстр = ТаблицаЗаймов.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
	КонецЦикла;
КонецПроцедуры

