#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.РасходныйКассовыйОрдер";
    КомандаПечати.Идентификатор = "РКО";
    КомандаПечати.Представление = НСтр("ru = 'Расходный кассовый ордер'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.РасходныйКассовыйОрдер";
    КомандаПечати.Идентификатор = "РКОСотрудникиОбщий";
    КомандаПечати.Представление = НСтр("ru = 'РКО (список сотрудников)'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РКО") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        	КоллекцияПечатныхФорм,
        	"РКО",
        	НСтр("ru = 'РКО'"),
        	СформироватьПечатнуюФормуРКО(МассивОбъектов, ОбъектыПечати));
		КонецЕсли;
		
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РКОСотрудники") Тогда
	//    УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	//    	КоллекцияПечатныхФорм,
	//    	"РКОСотрудники",
	//    	НСтр("ru = 'РКОСотрудники'"),
	//    	СформироватьПечатнуюФормуРКОЗарплатаСотрудникам(МассивОбъектов, ОбъектыПечати));
	//КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РКОСотрудникиОбщий") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        	КоллекцияПечатныхФорм,
        	"РКОСотрудникиОбщий",
        	НСтр("ru = 'РКОСотрудникиОбщий'"),
        	СформироватьПечатнуюФормуРКОЗарплатаСотрудникамОбщая(МассивОбъектов, ОбъектыПечати));
    КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Организация.ПолноеНаименование <> """"
	|			ТОГДА ДанныеДокумента.Организация.ПолноеНаименование
	|		ИНАЧЕ ДанныеДокумента.Организация.Наименование
	|	КОНЕЦ КАК ПредставлениеОрганизации,
	|	ДанныеДокумента.Организация.ИНН КАК ОрганизацияИНН,
	|	ДанныеДокумента.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Контрагент.НаименованиеПолное <> """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.ВидОперации КАК ВидОперации,
	|	ДанныеДокумента.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.Касса КАК Касса,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Касса) КАК ПредставлениеКассы,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.НомерСменыККМ КАК НомерСменыККМ,
	|	ДанныеДокумента.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.СписыватьБонусы КАК СписыватьБонусы,
	|	ДанныеДокумента.СлужебныйУчетБонусовПоДисконтнымКартам КАК СлужебныйУчетБонусовПоДисконтнымКартам,
	|	ДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ДанныеДокумента.Статья КАК Статья,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаБонусовКСписаниюПоДисконтнойКарте КАК СуммаБонусовКСписаниюПоДисконтнойКарте,
	|	ДанныеДокумента.ЧекФискализирован КАК ЧекФискализирован,
	|	ДанныеДокумента.СлужебныйКонтролироватьЗаполнениеЗаявки КАК СлужебныйКонтролироватьЗаполнениеЗаявки,
	|	ДанныеДокумента.СтатьяРасходовПоНачислению КАК СтатьяРасходовПоНачислению,
	|	ДанныеДокумента.Организация.Руководитель КАК ФИОРуководителя,
	|	ДанныеДокумента.Организация.ГлавныйБухгалтер КАК ФИОГлавногоБухгалтера
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.Сумма КАК СуммаПолучателя
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.ЗарплатаСотрудникам КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Документ КАК Документ,
	|	ДанныеДокумента.Сумма КАК Сумма
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.РаспределениеПлатежа КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиЗарплата 		= МассивРезультатов[1];
	РезультатПоТабличнойЧастиРаспределение  = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиЗарплата, РезультатПоТабличнойЧастиРаспределение",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиЗарплата, РезультатПоТабличнойЧастиРаспределение);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам = Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	РезультатЗапроса.Колонки.Добавить("ДатаДокумента", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));
	РезультатЗапроса.Колонки.Добавить("СуммаПрописью", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("НомерДокумента", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ПредставлениеПодразделения",   Новый ОписаниеТипов("Строка"));
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
		
		ТекущаяСтрока.ДатаДокумента = Формат(ТекущаяСтрока.Дата, "ДЛФ=Д");
		ТекущаяСтрока.НомерДокумента = ТекущаяСтрока.Номер;
		//ТекущаяСтрока.СуммаПрописью = ЧислоПрописью(СсылкаНаОбъект.Сумма, ,"Рубль, рублей, рубля, м, копейка, копейки, копеек, ж, 2");
		ТекущаяСтрока.СуммаПрописью = РаботаСВалютой.СформироватьЧислоПрописьюВсп(ТекущаяСтрока.Сумма, ТекущаяСтрока.Валюта, "Л = ru_RU; ДП = Ложь");
		
		ТекущаяСтрока.ПредставлениеПодразделения = ТекущаяСтрока.ПредставлениеОрганизации + " (" + ТекущаяСтрока.ПредставлениеКассы + ")";
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);

	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуРКО(МассивОбъектов, ОбъектыПечати) Экспорт
		
	Макет = Документы.РасходныйКассовыйОрдер.ПолучитьМакет("КО2");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ВыборкаПоЗарплате 		 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиЗарплата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ПервыйДокумент = Истина;
    Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если НЕ ДанныеПечати.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам Тогда
	    	ЗаполнитьПечатнуюФормуРКО(ТабличныйДокумент, Макет, ДанныеПечати);
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходныйКассовыйОрдер_КО";
		Иначе
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходныйКассовыйОрдер_КО2Сотрудникам";
			ЗаполнитьПечатнуюФормуРКОЗарплатаСотрудникам(ТабличныйДокумент, Макет, ДанныеПечати, ВыборкаПоЗарплате);
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
		
	Возврат ТабличныйДокумент;
	
КонецФункции
	
Процедура ЗаполнитьПечатнуюФормуРКО(ТабличныйДокумент, Макет, ДанныеПечати)
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	
	Если ДанныеПечати.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику
		ИЛИ ДанныеПечати.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю Тогда
		ОбластьМакета.Параметры.ФИОПолучателя = ДанныеПечати.ПредставлениеКонтрагента;
		
	ИначеЕсли ДанныеПечати.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику Тогда 
		ОбластьМакета.Параметры.ФИОПолучателя = ДанныеПечати.Сотрудник;
		
		РеквизитыПаспорта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПечати.Сотрудник, "ПаспортДатаВыдачи, ПаспортСерия, ПаспортНомер, ПаспортКемВыдан");
		РеквизитыПаспорта.Вставить("ПаспортВид", "Паспорт гражданина РФ");
		ОбластьМакета.Параметры.РеквизитыДокументаУдостоверяющегоЛичность = ОбщийМодульСервер.ПредставлениеДокументаФизлица(РеквизитыПаспорта);		
	КонецЕсли;	
	
	ТабличныйДокумент.Вывести(ОбластьМакета);		
	
КонецПроцедуры

Процедура ЗаполнитьПечатнуюФормуРКОЗарплатаСотрудникам(ТабличныйДокумент, Макет, ДанныеПечати, ВыборкаПоЗарплате)
	
	СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
	ВыборкаПоЗарплате.Сбросить();
	Если ВыборкаПоЗарплате.НайтиСледующий(СтруктураПоиска) Тогда			
		Выборка = ВыборкаПоЗарплате.Выбрать();			
		Пока Выборка.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Заполнить(Выборка);
			
			ОбластьМакета.Параметры.ФИОПолучателя = Выборка.Сотрудник;
			
			РеквизитыПаспорта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Сотрудник, "ПаспортДатаВыдачи, ПаспортСерия, ПаспортНомер, ПаспортКемВыдан");
			РеквизитыПаспорта.Вставить("ПаспортВид", "Паспорт гражданина РФ");
			ОбластьМакета.Параметры.РеквизитыДокументаУдостоверяющегоЛичность = ОбщийМодульСервер.ПредставлениеДокументаФизлица(РеквизитыПаспорта);
			
			ОбластьМакета.Параметры.СуммаПрописью = РаботаСВалютой.СформироватьЧислоПрописьюВсп(Выборка.Сумма, ДанныеПечати.Валюта, "Л = ru_RU; ДП = Ложь"); // №13632
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуРКОЗарплатаСотрудникамОбщая(МассивОбъектов, ОбъектыПечати) Экспорт
	
	Макет = Документы.РасходныйКассовыйОрдер.ПолучитьМакет("КО_сотрудники");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходныйКассовыйОрдер_КО_сотрудники";

	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ВыборкаПоЗарплате 		 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиЗарплата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ПервыйДокумент = Истина;
    Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если НЕ ДанныеПечати.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам Тогда
			Сообщить("Печать не предусмотрена для данного вида операции");
			Продолжить;
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоЗарплате.Сбросить();
		Если ВыборкаПоЗарплате.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоЗарплате.Выбрать();			
			Пока Выборка.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСотрудник");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.ФИОПолучателя = Выборка.Сотрудник;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла; 
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	
		ТабличныйДокумент.Вывести(ОбластьМакета);
	
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
		
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область ПечатьЧека

// Возвращает предварительные параметры фискализации чека для документа.
//
// Параметры:
//   ДокументСсылка - ДокументСсылка.ПриходныйКассовыйОрдер - Документ.
//   ВерсияФФД - Строка - Версия ФФД.
//
// ВозвращаемоеЗначение:
//  Неопределено, Структура - см. функцию МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека().
//
Функция ПараметрыОперацииФискализацииЧека(ДокументСсылка, ВерсияФФД = Неопределено, ЭкземплярПодключаемогоОборудования = Неопределено) Экспорт
	
	// Общие параметры чека
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
		
	// Общие реквизиты для всех типов оборудования.
	ПотолкиКассыОнлайн.ЗаполнитьОбщиеРеквизиты(ДокументСсылка, ОбщиеПараметры, ЭкземплярПодключаемогоОборудования);
	
	// Товарные позиции и таблица оплат
	Если ВерсияФФД = "1.0" Тогда
		ДополнитьТоварамиПараметрыПриПробитииЧека_1_0(ДокументСсылка, ОбщиеПараметры);
	Иначе
		
		ДокументСсылкаОснование = Неопределено;
		Если ДокументСсылка.Основания.Количество() > 0 Тогда
			ДокументСсылкаОснование = ДокументСсылка.Основания[0].Основание;
		КонецЕсли;
	
		// Товарные позиции
		НомерСтрокиТовара = 0;
		МассивДокументовРасчетов = Новый Массив;
		ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
		
		Если ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда			
			МассивДокументовРасчетов.Добавить(Новый Структура("Документ, СуммаДокумента, СуммаРаспределения", ДокументСсылкаОснование, ДокументСсылка.Сумма, ДокументСсылка.Сумма));
			ПотолкиКассыОнлайн.ДобавитьПозицииЧекаПоДокументамРасчетов(МассивДокументовРасчетов, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета, ПризнакПредметаРасчета);
			Если ДокументСсылкаОснование.СуммаДокумента < ДокументСсылка.Сумма Тогда
				ПотолкиКассыОнлайн.ДобавитьСтрокуОплаты(ОбщиеПараметры, ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"), ДокументСсылкаОснование.СуммаДокумента); // #12169 исправление
				ПотолкиКассыОнлайн.ДобавитьСтрокуАванса(ОбщиеПараметры, НомерСтрокиТовара, ДокументСсылка.Контрагент, ДокументСсылка.Сумма - ДокументСсылкаОснование.СуммаДокумента);	
			КонецЕсли;
		ИначеЕсли ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю Тогда //#11287
			// возврат по заказам, возврат без основания
			ПотолкиКассыОнлайн.ДополнитьТоварамиПараметрыПриПробитииЧека(ДокументСсылка, ОбщиеПараметры);
		Иначе
			// документ возврата без основания
			ПотолкиКассыОнлайн.ДобавитьСтрокуАванса(ОбщиеПараметры, НомерСтрокиТовара, ДокументСсылка.Контрагент, ДокументСсылка.Сумма);
		КонецЕсли;	
		
		// Таблица оплат
		Если ОбщиеПараметры.ТаблицаОплат.Количество() = 0 Тогда
			СтрокаОплаты  = МенеджерОборудованияКлиентСервер.ПараметрыСтрокиОплаты();
			СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"); //Наличные
			СтрокаОплаты.Сумма = ДокументСсылка.Сумма;
			ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
		
		Если ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
			Постоплата = ДокументСсылкаОснование.СуммаДокумента - ДокументСсылка.Сумма;
			Если Постоплата > 0 Тогда
				СтрокаОплаты  = МенеджерОборудованияКлиентСервер.ПараметрыСтрокиОплаты();
				СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата");
				СтрокаОплаты.Сумма = Постоплата;
				ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат ОбщиеПараметры;
	
КонецФункции

#КонецОбласти

#Область ПечатьЧекаФФД_1_0

Процедура ДополнитьТоварамиПараметрыПриПробитииЧека_1_0(ДокументСсылка, ОбщиеПараметры)
	
	ТаблицаТоваров = ЗаполнитьТаблицуТоваровПоОснованию(ДокументСсылка);
	
	Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		//СтрокаПозицииЧека = Новый Структура();
		//СтрокаПозицииЧека.Вставить("ФискальнаяСтрока");
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		Если ПустаяСтрока(Строка(СтрокаТЧ.Номенклатура)) Тогда
			СтрокаПозицииЧека.Вставить("Наименование", "Предоплата");
		Иначе
			СтрокаПозицииЧека.Вставить("Наименование", Строка(СтрокаТЧ.Номенклатура));
		КонецЕсли;
		СтрокаПозицииЧека.Вставить("Количество"  , СтрокаТЧ.Количество);
		СтрокаПозицииЧека.Вставить("Цена"        , СтрокаТЧ.Цена);
		СтрокаПозицииЧека.Вставить("Сумма"       , СтрокаТЧ.Сумма);
		СтрокаПозицииЧека.Вставить("НомерСекции" , СтрокаТЧ.НомерСекции);
		СтрокаПозицииЧека.Вставить("СтавкаНДС"   , ВернутьСтавкуНДС(СтрокаТЧ.СтавкаНДС));
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	КонецЦикла;
	
	// Подготовка таблицы оплат
	// Наличные
	СуммаВидаОплаты = ДокументСсылка.Сумма;
	Если СуммаВидаОплаты <> 0 Тогда
		СтрокаОплаты = Новый Структура();
		//СтрокаОплаты.Вставить("ТипОплаты", 0); // Наличные
		СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"));
		СтрокаОплаты.Вставить("Наименование", "Наличная оплата");
		СтрокаОплаты.Вставить("Сумма", СуммаВидаОплаты);
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;
	
	Если ДокументСсылка.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю") Тогда
		ОбщиеПараметры.ТипРасчета          = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств");
	Иначе
		ОбщиеПараметры.ТипРасчета          = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств");
	КонецЕсли;

	
КонецПроцедуры

Функция ЗаполнитьТаблицуТоваровПоОснованию(ДокументСсылка) Экспорт
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("Сумма");
	ТаблицаТоваров.Колонки.Добавить("НомерСекции");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	
	ДокументСсылкаОснование = Неопределено;
	Если ДокументСсылка.Основания.Количество() > 0 Тогда
		ДокументСсылкаОснование = ДокументСсылка.Основания[0].Основание;
	КонецЕсли;
	
	Если ЭтоПолнаяОплата(ДокументСсылка) Тогда
		//заполним табличную часть товаров (товары и услуги) по основанию
		Если ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаказДоговор") 
			или ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.Монтаж") 
			Тогда
			//ТоварыУслуги
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.ТоварыУслуги Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаказНаПроизводство")  
			Тогда
			//продукция
			Если НЕ ДокументСсылкаОснование.ЗаказНаПродажу Тогда
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ДокументСсылкаОснование.ПродукцияКоличество;
				НоваяСтрока.Цена = ДокументСсылкаОснование.ПродукцияЦена;
				НоваяСтрока.Сумма = ДокументСсылкаОснование.ПродукцияСумма;
				НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЕсли;
			//товары
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.Товары Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
			//услуги
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.Услуги Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.РеализацияТоваровИУслуг")  
			или ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.СчетНаОплату")  
			Тогда
			//товары
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.Товары Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
			//услуги
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.Услуги Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаявкаНаДоставку")  
			Тогда
			//одна строка - доставка груза
			НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ДокументСсылка.Сумма;
			НоваяСтрока.Сумма = ДокументСсылка.Сумма;
			НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
			НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		КонецЕсли;
	Иначе
		//укажем что это предоплата
		НоваяСтрока = ТаблицаТоваров.Добавить();
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = ДокументСсылка.Сумма;
		НоваяСтрока.Сумма = ДокументСсылка.Сумма;
		НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	КонецЕсли;
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция ЭтоПолнаяОплата(ДокументСсылка)
	
	Результат = Ложь;
	
	ДокументСсылкаОснование = Неопределено;
	Если ДокументСсылка.Основания.Количество() > 0 Тогда
		ДокументСсылкаОснование = ДокументСсылка.Основания[0].Основание;
	КонецЕсли;
	
	Если НЕ ДокументСсылкаОснование = Неопределено Тогда
		Если ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаявкаНаДоставку") Тогда
			Если ДокументСсылка.Сумма = ДокументСсылкаОснование.СтоимостьДоставки Тогда
				Результат = Истина;
			КонецЕсли;
		Иначе
			Если ДокументСсылка.Сумма = ДокументСсылкаОснование.СуммаДокумента Тогда
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция преобразования значения реквизита СтавкаНДС к типу Число.
Функция ВернутьСтавкуНДС(СтавкаНДС)
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		Ставка = 10;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
		Ставка = 18;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
		Ставка = 0;
	Иначе
		Ставка = Неопределено;
	КонецЕсли;
	
	Возврат Ставка;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.АвансовыйОтчет.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Расходный кассовый ордер"
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, Порядок = 0) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РасходныйКассовыйОрдер) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РасходныйКассовыйОрдер.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.РасходныйКассовыйОрдер.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.Порядок = Порядок;

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли