#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		
		ФинансыСервер.ПроверитьВозможностьВводаНаОснованииЗаявки(ДанныеЗаполнения, Истина);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,
		"Контрагент, Договор, Касса, Организация, Подразделение, Статья, СтатьяРасходов, СтатьяРасходовПоНачислению, ПериодРегистрации");
		Если ТипЗнч(ДанныеЗаполнения.Контрагент) = Тип("СправочникСсылка.Сотрудники") Тогда
			Сотрудник = ДанныеЗаполнения.Контрагент;
		Иначе
			Контрагент = ДанныеЗаполнения.Контрагент;
		КонецЕсли;
		ВидОперации = ДанныеЗаполнения.ВидОперацииРКО;
		Валюта = ДанныеЗаполнения.ВалютаДокумента;
		Сумма = ДанныеЗаполнения.СуммаДокумента;
	    ДобавитьОснование(ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.ЖелательнаяДатаПлатежа <> Дата(1,1,1) Тогда
			Дата = ДанныеЗаполнения.ЖелательнаяДатаПлатежа;
		КонецЕсли;
		Для каждого ЭлементТЗ из ДанныеЗаполнения.ЗарплатаСотрудникам Цикл
			НоваяСтрока = ЗарплатаСотрудникам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЗ);
		КонецЦикла;
		Для каждого ЭлементТЗ из ДанныеЗаполнения.РаспределениеПлатежа Цикл
			НоваяСтрока = РаспределениеПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЗ);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
		
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Сумма = ДанныеЗаполнения.Начисление.Итог("Сумма");
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение; // №12857
		ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам;
		ПериодРегистрации = ДанныеЗаполнения.ПериодРегистрации;
		ДобавитьОснование(ДанныеЗаполнения);
		
		//++ №14304 сворачиваем по сотрудникам
		Начисления = ДанныеЗаполнения.Начисление.Выгрузить(, "Сотрудник, Сумма");
		Начисления.Свернуть("Сотрудник", "Сумма");
		//-- №14304
		
		Для Каждого ТекСтрокаНачисление Из Начисления Цикл
			
			НоваяСтрока = ЗарплатаСотрудникам.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаНачисление.Сотрудник;
			//НоваяСтрока.ВидНачисления = ТекСтрокаНачисление.ВидНачисления;  //#6576
			НоваяСтрока.Сумма = ТекСтрокаНачисление.Сумма;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение; // №12857
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента;		
		Сумма = ДанныеЗаполнения.СуммаДокумента;
		Валюта = ДанныеЗаполнения.Валюта;
		ДобавитьОснование(ДанныеЗаполнения);
		
		//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		//	ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
		//	Договор = ДанныеЗаполнения.ДоговорКонтрагента;  //Договор = ДанныеЗаполнения.Ссылка; //если подставлять заказ-договор, то не сходятся взаиморасеты в разрезе договоров, потому что в ПКО в реквизит встает Договор контрагента
		//	Контрагент = ДанныеЗаполнения.Контрагент;
		//	Организация = ДанныеЗаполнения.Организация;
		//	Основание = ДанныеЗаполнения;
		//	Валюта = ДанныеЗаполнения.Валюта;
		//	
		//	//предложим к заполнению сумму равную сумму нашего долга на текущий момент
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//	|	РасчетыПоЗаказамОстатки.СуммаОстаток
		//	|ИЗ
		//	|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ = &ЗаказДоговор) КАК РасчетыПоЗаказамОстатки";
		//	Запрос.УстановитьПараметр("ЗаказДоговор",ДанныеЗаполнения.Ссылка);
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	Пока Выборка.Следующий() Цикл
		//		Сумма = Выборка.СуммаОстаток * -1;
		//	КонецЦикла;
		//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Замена") Тогда
		//	// Заполнение шапки
		//	//Комментарий = ДанныеЗаполнения.Основание.Комментарий; //#5849
		//	Контрагент = ДанныеЗаполнения.Основание.Контрагент;
		//	ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
		//	Договор = ДанныеЗаполнения.Основание.ДоговорКонтрагента;
		//	Контрагент = ДанныеЗаполнения.Основание.Контрагент;
		//	Организация = ДанныеЗаполнения.Основание.Организация;
		//	Валюта = ДанныеЗаполнения.Основание.Валюта;
		//	Сумма = ?(ДанныеЗаполнения.СуммаДокумента < 0, -ДанныеЗаполнения.СуммаДокумента, 0);
		//	Основание = ДанныеЗаполнения.Ссылка;
		//	
		//	Если Сумма > 0 И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		//		НоваяСтрока = РаспределениеПлатежа.Добавить();
		//		НоваяСтрока.Документ = ДанныеЗаполнения.Основание;
		//		НоваяСтрока.Сумма = Сумма;
		//	КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение; // №12857
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента;
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Сумма = Документы.ЗаказПоставщику.СуммаКОплате(ДанныеЗаполнения); //ДанныеЗаполнения.СуммаДокумента; //#14377
		Валюта = ДанныеЗаполнения.Валюта;
		ДобавитьОснование(ДанныеЗаполнения);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения.Ссылка;
		НоваяСтрока.Сумма = Сумма;
	
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаДоставку") Тогда		
		Организация = ДанныеЗаполнения.Организация;
		Контрагент 	= ДанныеЗаполнения.Экспедитор;
		Договор 	= Контрагент.ОсновнойДоговор;
		Сумма 		= ДанныеЗаполнения.СтоимостьДоставки;
		Валюта 		= ДанныеЗаполнения.Валюта;
		ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ПрочееСписание;
		Если ДанныеЗаполнения.СпособДоставки = Справочники.СпособыДоставкиТовара.НайтиПоКоду("000000008") Тогда // это Индрайвер
			СтатьяРасходов = Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("000000199");//Индрайвер
		КонецЕсли;	
		ДобавитьОснование(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
		ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение; // №12857
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента;
		Сумма = ДанныеЗаполнения.СуммаДокумента;
		Валюта = ДанныеЗаполнения.Валюта;
		ДобавитьОснование(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратПродукции") Тогда
		ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента;
		Сумма = ДанныеЗаполнения.СуммаДокумента;
		Валюта = ДанныеЗаполнения.Валюта;
		ДобавитьОснование(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		Сумма = ДанныеЗаполнения.Сумма;
		Валюта = ДанныеЗаполнения.Валюта;
		Касса = ДанныеЗаполнения.Касса;
		ДобавитьОснование(ДанныеЗаполнения);
		
		//++ №8498
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ПрочееСписание;
		Организация = ДанныеЗаполнения.Организация;
		ДобавитьОснование(ДанныеЗаполнения);
		//-- №8498
		
	КонецЕсли;
		
	// №9078 определение статьи перенесено сюда сверху, т.к. вид операции может быть изменен в зависимости от основания
	Если НЕ ЗначениеЗаполнено(СтатьяРасходов) Тогда
		СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, ВидОперации, Ложь);
	КонецЕсли;	
	СтатьяРасходовПоНачислению = СтатьяРасходов; //#9708
	
	ФинансыСервер.ДокументРасходаОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(Касса) И Касса.Владелец <> Организация Тогда
		Касса = Справочники.Кассы.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		КатегорияКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Категория");	
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); //#14482
	
	ЧекФискализирован = Ложь;
	НомерСменыККМ = 0;
	НомерЧекаККМ = 0;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПолеПериодРегистрацииОбязательно = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();	
	Если Не ЗначениеЗаполнено(ПериодРегистрации) И ПолеПериодРегистрацииОбязательно
		И ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Не указан Период регистрации!'"), ,
		"ОтображениеПериодаРегистрации",,Отказ);	
	КонецЕсли;
	
	ПолеСтатьяДДСОбязательно = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();	
	Если НЕ ЗначениеЗаполнено(Статья) И ПолеСтатьяДДСОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Не заполнена статья движения денежных средств!'"), ЭтотОбъект,
		"Статья",,Отказ);
	КонецЕсли;
	
	//++ №12420
	Если ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику
		Или ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю
		Тогда 
		ПроверяемыеРеквизиты.Добавить("Контрагент");
		ПроверяемыеРеквизиты.Добавить("Договор");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику Тогда
		ПроверяемыеРеквизиты.Добавить("Сотрудник");
	КонецЕсли;
	//-- №12420
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ФинансыСервер.ПроверитьЗаполнениеНаОснованииЗаявкиНаРасходование(ЭтотОбъект, Отказ, РежимЗаписи);
	
	ФинансыСервер.ДокументРасходаПередЗаписью(ЭтотОбъект, Истина, ВидОперации, Отказ, РежимЗаписи, РежимПроведения); 
	
	Если НЕ ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику 
		И НЕ ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю 
		И НЕ ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратКредита 
		И НЕ ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаЗайма Тогда
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		
	КонецЕсли;
	
	Если НЕ ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику Тогда
		Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ Касса.Владелец = Организация Тогда
		Сообщить("Касса " + Касса + " не принадлежит организации "+Организация+". Проведение отменено.");
		Отказ = Истина;
	КонецЕсли;
	
	ИспользуетсяПериодРегистрации = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();
	
	Если НЕ Касса.Валюта = Валюта Тогда
		Если Касса.КонтролироватьВалюту Тогда
			Сообщить("Касса " + Касса + " хранит только валюту " + Касса.Валюта + ". В документе указана валюта " + Валюта + ". Проведение отменено.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ФинансыСервер.КонтрольОстатковДС(ЭтотОбъект, Истина, Отказ);
	
	Если ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику Тогда
		
		//++ №12420 комментируем, т.к. перенесено в обработку проверки заполнения
		//Если Контрагент.Пустая() Тогда
		//	Сообщить("Не указан контрагент. Проведение отменено");
		//	Отказ = Истина;
		//	Возврат;
		//КонецЕсли;
		//-- №12420 комментируем, т.к. перенесено в обработку проверки заполнения
		
		// регистр ВзаиморасчетыСКонтрагентами Приход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		//Движение.Документ = Ссылка;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		
		//Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения =ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Валюта = Валюта;
		Движение.Сумма = Сумма;
			
		// РасчетыСКонтрагентами
		Движения.РасчетыСКонтрагентами.Записывать = Истина;		
		Если РаспределениеПлатежа.Количество() > 0 Тогда
			Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
				Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
					Движение = Движения.РасчетыСКонтрагентами.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период 	 = Дата;
					Движение.Заказ 		 = ТекущаяСтрока.Документ;
					Движение.Контрагент  = Контрагент;
					Движение.Организация = Организация;
					Движение.Сумма 		 = ТекущаяСтрока.Сумма;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ТекущаяСтрока Из Основания Цикл
				Если ТипЗнч(ТекущаяСтрока.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда						
					Движение = Движения.РасчетыСКонтрагентами.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период 	 = Дата;
					Движение.Заказ 		 = ТекущаяСтрока.Основание;
					Движение.Контрагент  = Контрагент;
					Движение.Организация = Организация;
					Движение.Сумма 		 = Сумма;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю Тогда
		
		//++ №12420 комментируем, т.к. перенесено в обработку проверки заполнения
		//Если Контрагент.Пустая() Тогда
		//	Сообщить("Не указан контрагент. Проведение отменено");
		//	Отказ = Истина;
		//	Возврат;
		//КонецЕсли;
		//-- №12420 комментируем, т.к. перенесено в обработку проверки заполнения
		
		// регистр ВзаиморасчетыСКонтрагентами Приход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		//Движение.Документ = Ссылка;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		
		//Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Валюта = Валюта;
		Движение.Сумма = Сумма;
		
		
		// регистр РасчетыПоЗаказам
		Движения.РасчетыПоЗаказам.Записывать = Истина;
		Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
			Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказДоговор")
				ИЛИ ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.Монтаж") 
				ИЛИ ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказПокупателя") 
				ИЛИ ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") 
				ИЛИ ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.СчетНаОплату") Тогда
				Движение = Движения.РасчетыПоЗаказам.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Заказ = ТекущаяСтрока.Документ;
				Движение.Сумма = -РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(ТекущаяСтрока.Документ, ТекущаяСтрока.Сумма);
				Движение.Контрагент = Контрагент; // №6496 добавлен контрагент в измерение
			КонецЕсли;
		КонецЦикла;
		
		//Если ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю Тогда
		//	Если НЕ Основание = Неопределено Тогда
		//		Если НЕ Основание.Пустая() Тогда
		//			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор")
		//				ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		//				Движения.РасчетыПоЗаказам.Записывать = Истина;
		//				Движение = Движения.РасчетыПоЗаказам.Добавить();
		//				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//				Движение.Период = Дата;
		//				Движение.Заказ = Основание;
		//				Движение.Сумма = -РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		//			КонецЕсли;
		//			
		//			//2018-03-22
		//			Если РаспределениеПлатежа.Количество() > 0 Тогда
		//				Если ТипЗнч(Основание) = Тип("ДокументСсылка.Замена")   
		//					ИЛИ (ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") И ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.Замена"))  Тогда
		//					Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
		//						Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		//							Движения.РасчетыПоЗаказам.Записывать = Истина;
		//							Движение = Движения.РасчетыПоЗаказам.Добавить();
		//							Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//							Движение.Период = Дата;
		//							Движение.Заказ = ТекущаяСтрока.Документ;
		//							Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(ТекущаяСтрока.Документ, ТекущаяСтрока.Сумма);								
		//						КонецЕсли;
		//					КонецЦикла;
		//				КонецЕсли;
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		
		//Бонусы контрагентов
		Движения.БонусыКонтрагентов.Записывать = Истина;
		Если СписыватьБонусы 
			И ?(СлужебныйУчетБонусовПоДисконтнымКартам, НЕ ДисконтнаяКарта.Пустая(), Истина) // №6316 нужно проверить заполнение дисконтной карты
			Тогда
			Если НЕ СуммаБонусовКСписаниюПоДисконтнойКарте = 0 Тогда
				Движение = Движения.БонусыКонтрагентов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Контрагент = Контрагент;
				Движение.ДисконтнаяКарта = ДисконтнаяКарта;
				Движение.Сумма = -СуммаБонусовКСписаниюПоДисконтнойКарте;
				Движение.ДокументНАНБ = ДокументНАНБ;
				Движение.КатегорияКонтрагента = КатегорияКонтрагента;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику Тогда
		
		// регистр РасчетыСПодотчетникамиПоДокументамАвансов Приход
		Движения.РасчетыСПодотчетникамиПоДокументамАвансов.Записывать = Истина;
		Движение = Движения.РасчетыСПодотчетникамиПоДокументамАвансов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сотрудник = Сотрудник;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		Движение.ДокументВыдачиДС = Ссылка;
		
		// регистр РасчетыСПодрядчиками Приход
		Движения.РасчетыСПодотчетниками.Записывать = Истина;
		Движение = Движения.РасчетыСПодотчетниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сотрудник = Сотрудник;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);		
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам Тогда
		// регистр РасчетыСПерсоналом Расход
		Движения.РасчетыСПерсоналом.Записывать = Истина;
		Для Каждого ТекСтрокаНачисление Из ЗарплатаСотрудникам Цикл
			Движение = Движения.РасчетыСПерсоналом.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата; 
			Движение.ПериодРегистрации = ?(ИспользуетсяПериодРегистрации, ПериодРегистрации, Дата(1,1,1));
			Движение.Организация = Организация;
			Движение.Сотрудник = ТекСтрокаНачисление.Сотрудник;
			//Движение.ВидНачисления = ТекСтрокаНачисление.ВидНачисления; //#6576 закомментировано
			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекСтрокаНачисление.Сумма);
		КонецЦикла;
		
	#Область ВозвратКредита_ИЛИ_ВыдачаЗайма
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаЗайма Тогда
		
		// регистр КредитыИЗаймы Приход
		Движения.КредитыИЗаймы.Записывать = Истина;		
		Движение = Движения.КредитыИЗаймы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент  = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);		
			
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратКредита Тогда
		
		// регистр КредитыИЗаймы Приход
		Движения.КредитыИЗаймы.Записывать = Истина;		
		Движение = Движения.КредитыИЗаймы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент  = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаОсновногоТелаЗайма);		
			
	#КонецОбласти
				
	КонецЕсли;
	
	// регистр ВзаиморасчетыСКонтрагентамиПоЗаказам Приход
	Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Записывать = Истина;
	Если ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю Тогда
		Для Каждого ТекущаяСтрока Из Основания Цикл
			Если ТипЗнч(ТекущаяСтрока.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
				Движение = Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Заказ = ТекущаяСтрока.Основание;
				Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// регистр ДенежныеСредства Расход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.СчетКасса = Касса;
	Движение.Валюта = Валюта;
	Движение.Сумма = Сумма;
	
	// регистр ДвиженияДенежныеСредства Расход
	Если ЗначениеЗаполнено(Статья) И ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоСтатьямДДС") Тогда
		Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СчетКасса = Касса;
		Движение.СуммаРасход = Сумма;
		Движение.Статья = Статья;
		Движение.Валюта = Валюта;
	КонецЕсли;
	
	// регистр ДенежныеСредстваКВыплате Расход
	Движения.ДенежныеСредстваКВыплате.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из Основания Цикл
		Если ТипЗнч(ТекущаяСтрока.Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда			
			Движение = Движения.ДенежныеСредстваКВыплате.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Заявка = ТекущаяСтрока.Основание;
			Движение.Сумма  = Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов И НЕ (ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратКредита	ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаЗайма) Тогда
		Если НЕ СтатьяРасходов.Пустая() И ПараметрыСеанса.ФинРезультатКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//кассовый метод
			Движения.ДоходыРасходы.Записывать = Истина;
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяРасходов;
			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
			Движение.СуммаДоходов 	= 0;
			Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		КонецЕсли;
		//#9708
		Если ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ПрочееСписание 
			И НЕ СтатьяРасходовПоНачислению.Пустая() И ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод
			Движения.ДоходыРасходы.Записывать = Истина;
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяРасходовПоНачислению;
			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движение.СуммаДоходов 	= 0;
			Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов И ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратКредита И СуммаПроцентовПоЗайму > 0 Тогда
		Движения.ДоходыРасходы.Записывать = Истина;
		
		Движение = Движения.ДоходыРасходы.Добавить();
		Движение.Период 		= Дата;
		Движение.Организация 	= Организация;
		Движение.Подразделение 	= Подразделение;
		Движение.Статья 		= СтатьяРасходов;
		Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
		Движение.СуммаДоходов 	= 0;
		Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаПроцентовПоЗайму);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	СлужебныйКонтролироватьЗаполнениеЗаявки = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств");
	
	// №6960 настройки по бонусам делаем только если глобально включен учет бонусов
	Если ПолучитьФункциональнуюОпцию("УчетБонусов") Тогда
		//#13834 изменена настройка
		//НачислятьБонусы 						= Константы.АвтоматическиНачислятьБонусыВДокументахОплаты.Получить();
		СписыватьБонусы 						= Константы.АвтоматическиНачислятьБонусы.Получить();
		СлужебныйУчетБонусовПоДисконтнымКартам 	= Константы.УчетБонусовПоДисконтнымКартам.Получить();
	Иначе
		СписыватьБонусы = Ложь;
		СлужебныйУчетБонусовПоДисконтнымКартам = Ложь;
	КонецЕсли;
	
	ДисконтнаяКарта = Справочники.ДисконтныеКарты.ПустаяСсылка();
	СуммаБонусовКСписаниюПоДисконтнойКарте = 0;
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	Если ЗначениеЗаполнено(Организация)
		И Не ЗначениеЗаполнено(СтавкаНДС)
		И ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю Тогда
		УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
		СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
	
		ФинансыКлиентСервер.ПересчитатьСуммуНДС(ЭтотОбъект, УчитыватьНДС);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОснование(ДанныеЗаполнения) Экспорт
	
	НайденныеСтроки = Основания.НайтиСтроки(Новый Структура("Основание", ДанныеЗаполнения));
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = Основания.Добавить();
		НоваяСтрока.Основание = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти
	
#КонецЕсли