

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьЗначениеНастроекЛогАТС();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НастройкиПрограммы" Тогда
		ПрочитатьЗначениеНастроекЛогАТС();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОчиститьЛог(Команда)
	ОчиститьЛогНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьЛогНаСервере()
	
	НаборЗаписей = РегистрыСведений.ЛогАТС.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВестиЛогАТСПриИзменении(Элемент)
	
	// #13221 убрано на сервер
	//Если ВестиЛогАТС Тогда
	//	ОтключитьПосле = ТекущаяДата() + 3*60*60;
	//Иначе
	//	ОтключитьПосле = Дата(1, 1, 1);
	//КонецЕсли;
	
	ВестиЛогАТСПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВестиЛогАТСПриИзмененииНаСервере()
	
	Если ВестиЛогАТС Тогда
		ОтключитьПосле = ТекущаяДата() + 3*60*60; // именно ТекущаяДата()
	Иначе
		ОтключитьПосле = Дата(1, 1, 1);
	КонецЕсли;
	
	МенеджерЗначения = Константы.ВестиЛоггированиеСобытийАТС.СоздатьМенеджерЗначения();
	МенеджерЗначения.ОбменДанными.Загрузка = Истина;
	МенеджерЗначения.Значение = ВестиЛогАТС;
	МенеджерЗначения.Записать();
	
	Константы.ЛогСобытийАТСОтключитьПосле.Установить(ОтключитьПосле);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ПрочитатьЗначениеНастроекЛогАТС()
	
	//ВестиЛогАТС = Константы.ВестиЛоггированиеСобытийАТС.Получить();
	
	НаборКонстант = Константы.СоздатьНабор("ВестиЛоггированиеСобытийАТС, ЛогСобытийАТСОтключитьПосле");
	НаборКонстант.Прочитать();
	ВестиЛогАТС = НаборКонстант.ВестиЛоггированиеСобытийАТС;
	ОтключитьПосле = НаборКонстант.ЛогСобытийАТСОтключитьПосле;
	
КонецПроцедуры

#КонецОбласти



