
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивТипов(ВыбираемыеОбъекты)
	Если ВыбираемыеОбъекты = "Справочники" Тогда
		возврат Справочники.ТипВсеСсылки().Типы();
	ИначеЕсли ВыбираемыеОбъекты = "Документы" Тогда
		возврат Документы.ТипВсеСсылки().Типы();
	ИначеЕсли ВыбираемыеОбъекты = "Задачи" Тогда
		возврат Задачи.ТипВсеСсылки().Типы();
	ИначеЕсли ВыбираемыеОбъекты = "БизнесПроцессы" Тогда
		возврат БизнесПроцессы.ТипВсеСсылки().Типы();
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВыбираемыеОбъектыПриИзменении(Элемент)
	Элементы.ПрикрепленныйОбъект.ОграничениеТипа = Новый ОписаниеТипов(ПолучитьМассивТипов(ВыбираемыеОбъекты));
КонецПроцедуры


&НаКлиенте
Процедура КомандаОК(Команда)
	Закрыть(ПрикрепленныйОбъект);
КонецПроцедуры

