#Область ПрограммныйИнтерфейс

#Область ОбщиеЗначения

// Получение значения константы.
//
// Параметры:
//  ИмяКонстанты - Строка - наименование константы.
//
// Возвращаемое значение:
//  Значение - значение константы.
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт

	Возврат Константы[ИмяКонстанты].Получить();

КонецФункции

Функция ПолучитьМаксимальныйУровеньИерархииРазрешеннойНоменклатурыРозницы() Экспорт

	// Определим уровень иерархии
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СправочникНоменклатура.Родитель КАК Родитель
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ГДЕ
	|	СправочникНоменклатура.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				РазрешеннаяНоменклатураРозницы.Номенклатура
	|			ИЗ
	|				РегистрСведений.РазрешеннаяНоменклатураРозницы КАК РазрешеннаяНоменклатураРозницы)
	|	И НЕ СправочникНоменклатура.Родитель = Значение(Справочник.Номенклатура.ПустаяСсылка)
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	
	МаксимальныйУровень = 2;
	
	Пока Выборка.Следующий() Цикл
		МаксимальныйУровень = Макс(Выборка.Родитель.Уровень() + 1, МаксимальныйУровень);
	КонецЦикла;
	
	Возврат МаксимальныйУровень;
	
КонецФункции

#КонецОбласти

#КонецОбласти