
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("IDПриложения", IDПриложения);
	Параметры.Свойство("ПраваДоступа", ПраваДоступа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.HTMLСтраница.Документ.location.href = "https://oauth.vk.com/authorize?client_id=" +
		IDПриложения + "&scope=" + ПраваДоступа +
		"&redirect_uri=http://api.vk.com/blank.html&display=page&response_type=token";
	
КонецПроцедуры

&НаКлиенте
Процедура HTMLСтраницаДокументСформирован(Элемент)
	
	access_token = "";
	Если ПолучитьКлючДоступаИзСтраницы(Элемент, access_token)  Тогда
		Оповестить("АвторизацияНаСайте_ПолученКлючДоступа", access_token, ЭтаФорма);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКлючДоступаИзСтраницы(Элемент, access_token) Экспорт
		
	access_token = "";
	
	Если Элемент.Документ.location.host = "api.vk.com" Тогда
		hash = Сред(Элемент.Документ.location.hash, 2);
		МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(hash, "&");
		
		Для каждого Параметр ИЗ МассивСтрок Цикл
			
			ИмяПараметра = "";
			ЗначениеПараметра = "";
			
			Поз = Найти(Параметр, "=");
			Если Поз = 0 Тогда
				ИмяПараметра = Параметр;
				ЗначениеПараметра = "";
			Иначе
				ИмяПараметра = НРег(СокрЛП(Лев(Параметр,Поз-1)));
				ЗначениеПараметра = СокрЛП(Сред(Параметр, Поз+1));
			КонецЕсли;
			
			Если ИмяПараметра = "access_token" Тогда
				access_token = ЗначениеПараметра;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
