
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если НЕ Параметры.СписокТоваров = Неопределено Тогда
		МассивПотолков = Параметры.СписокТоваров;
		Для НомерСтроки = 0 По МассивПотолков.Количество() - 1 Цикл
			НоваяСтрока = СписокТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивПотолков[НомерСтроки], 
				"НомерСтроки, Комната, Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, НомерПотолка, Коэффициент, ПроцентСкидки, СуммаСкидки, Цена, Сумма, Назначение, КоличествоКОбеспечению");
		КонецЦикла;
		//Для НомерСтроки = 0 По Параметры.СписокТоваров.Количество() - 1 Цикл
		//	НоваяСтрока = СписокТоваров.Добавить();
		//	НоваяСтрока.Комната 			= Параметры.СписокТоваров[НомерСтроки].Значение.Комната;
		//	НоваяСтрока.Номенклатура 		= Параметры.СписокТоваров[НомерСтроки].Значение.Номенклатура;
		//	НоваяСтрока.ХарактеристикаНоменклатуры
		//									= Параметры.СписокТоваров[НомерСтроки].Значение.ХарактеристикаНоменклатуры;
		//	НоваяСтрока.Количество 			= Параметры.СписокТоваров[НомерСтроки].Значение.Количество;			
		//	НоваяСтрока.ЕдиницаИзмерения 	= Параметры.СписокТоваров[НомерСтроки].Значение.ЕдиницаИзмерения;
		//	НоваяСтрока.НомерСтроки 		= Параметры.СписокТоваров[НомерСтроки].Значение.НомерСтроки;
		//	НоваяСтрока.НомерПотолка 		= Параметры.СписокТоваров[НомерСтроки].Значение.НомерПотолка;
		//	НоваяСтрока.ЗаказНаПроизводство = Параметры.СписокТоваров[НомерСтроки].Значение.ЗаказНаПроизводство;
		//	НоваяСтрока.Коэффициент 		= Параметры.СписокТоваров[НомерСтроки].Значение.Коэффициент;
		//	НоваяСтрока.ПроцентСкидки 		= Параметры.СписокТоваров[НомерСтроки].Значение.ПроцентСкидки;
		//	НоваяСтрока.Цена 				= Параметры.СписокТоваров[НомерСтроки].Значение.Цена;
		//	НоваяСтрока.СуммаСкидки 		= Параметры.СписокТоваров[НомерСтроки].Значение.СуммаСкидки;
		//	НоваяСтрока.Сумма 				= Параметры.СписокТоваров[НомерСтроки].Значение.Сумма;
		//	НоваяСтрока.Назначение 			= Параметры.СписокТоваров[НомерСтроки].Значение.Назначение;
		//КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл		
			ТекущаяСтрока.Заказывать = Истина;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСоВсех(Команда)
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		ТекущаяСтрока.Заказывать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Заказать(Команда)
	
	//СписокЗаказать = Новый СписокЗначений;
	СписокЗаказать = Новый Массив;
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		Если ТекущаяСтрока.Заказывать Тогда 
			СтруктураТовара = Новый Структура;
			СтруктураТовара.Вставить("Комната", 			ТекущаяСтрока.Комната);
			СтруктураТовара.Вставить("Номенклатура", 		ТекущаяСтрока.Номенклатура);
			СтруктураТовара.Вставить("ХарактеристикаНоменклатуры", 		
															ТекущаяСтрока.ХарактеристикаНоменклатуры);
			СтруктураТовара.Вставить("Количество", 			ТекущаяСтрока.Количество);
			СтруктураТовара.Вставить("ЕдиницаИзмерения", 	ТекущаяСтрока.ЕдиницаИзмерения);
			СтруктураТовара.Вставить("НомерСтроки", 		ТекущаяСтрока.НомерСтроки);
			СтруктураТовара.Вставить("НомерПотолка", 		ТекущаяСтрока.НомерПотолка);
			СтруктураТовара.Вставить("ЗаказНаПроизводство", ТекущаяСтрока.ЗаказНаПроизводство);
			СтруктураТовара.Вставить("Коэффициент", 		ТекущаяСтрока.Коэффициент);
			СтруктураТовара.Вставить("ПроцентСкидки", 		ТекущаяСтрока.ПроцентСкидки);
			СтруктураТовара.Вставить("Цена", 				ТекущаяСтрока.Цена);
			СтруктураТовара.Вставить("СуммаСкидки", 		ТекущаяСтрока.СуммаСкидки);
			СтруктураТовара.Вставить("Сумма", 				ТекущаяСтрока.Сумма);
			СтруктураТовара.Вставить("Назначение", 			ТекущаяСтрока.Назначение);
			СписокЗаказать.Добавить(СтруктураТовара);
		КонецЕсли;
	КонецЦикла;
	Закрыть(СписокЗаказать);	
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьПотолкиНаСервере()
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл		
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			ТекущаяСтрока.Заказывать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьПотолки(Команда)
	ОтметитьПотолкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьТовары(Команда)
	
	ОтметитьТоварыНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОтметитьТоварыНаСервере()
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		Если ТекущаяСтрока.Назначение = "Товары"
			И НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			ТекущаяСтрока.Заказывать = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьМатериалы(Команда)
	
	 Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		Если ТекущаяСтрока.Назначение = "Материалы" Тогда
			ТекущаяСтрока.Заказывать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
