#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ПриходныйКассовыйОрдер";
    КомандаПечати.Идентификатор = "ПКО";
    КомандаПечати.Представление = НСтр("ru = 'Приходный кассовый ордер'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПКО") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        	КоллекцияПечатныхФорм,
        	"ПКО",
        	НСтр("ru = 'Приходный кассовый ордер'"),
        	СформироватьПечатнуюФормуПКО(МассивОбъектов, ОбъектыПечати));
    КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Организация.ПолноеНаименование <> """"
	|			ТОГДА ДанныеДокумента.Организация.ПолноеНаименование
	|		ИНАЧЕ ДанныеДокумента.Организация.Наименование
	|	КОНЕЦ КАК ПредставлениеОрганизации,
	|	ДанныеДокумента.Организация.ИНН КАК ОрганизацияИНН,
	|	ДанныеДокумента.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Контрагент.НаименованиеПолное <> """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.ВидОперации КАК ВидОперации,
	|	ДанныеДокумента.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.Касса КАК Касса,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Касса) КАК ПредставлениеКассы,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.НомерСменыККМ КАК НомерСменыККМ,
	|	ДанныеДокумента.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.НачислятьБонусы КАК НачислятьБонусы,
	|	ДанныеДокумента.СлужебныйУчетБонусовПоДисконтнымКартам КАК СлужебныйУчетБонусовПоДисконтнымКартам,
	|	ДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ДанныеДокумента.Статья КАК Статья,
	|	ДанныеДокумента.СтатьяДоходов КАК СтатьяДоходов,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.ЧекФискализирован КАК ЧекФискализирован,
	|	ДанныеДокумента.Организация.Руководитель КАК ФИОРуководителя,
	|	ДанныеДокумента.Организация.ГлавныйБухгалтер КАК ФИОГлавногоБухгалтера,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Организация.Кассир = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Автор.Сотрудник
	|		ИНАЧЕ ДанныеДокумента.Организация.Кассир
	|	КОНЕЦ КАК Кассир
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Документ КАК Документ,
	|	ДанныеДокумента.Сумма КАК Сумма
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РаспределениеПлатежа КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Основание КАК Основание
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.Основания КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиРаспределение  = МассивРезультатов[1];
	РезультатПоТабличнойЧастиОснования      = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиРаспределение, РезультатПоТабличнойЧастиОснования",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиРаспределение, РезультатПоТабличнойЧастиОснования);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам = Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	РезультатЗапроса.Колонки.Добавить("ДатаДокумента", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));
	РезультатЗапроса.Колонки.Добавить("СуммаПрописью", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("НомерДокумента", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ПредставлениеПодразделения",   Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ПредставлениеСтруктурногоПодразделения",   Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ПринятоОт",   Новый ОписаниеТипов("Строка"));
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
		
		ТекущаяСтрока.ДатаДокумента = Формат(ТекущаяСтрока.Дата, "ДЛФ=Д");
		ТекущаяСтрока.НомерДокумента = ТекущаяСтрока.Номер;
		//ТекущаяСтрока.СуммаПрописью = ЧислоПрописью(СсылкаНаОбъект.Сумма, ,"Рубль, рублей, рубля, м, копейка, копейки, копеек, ж, 2");
		ТекущаяСтрока.СуммаПрописью = РаботаСВалютой.СформироватьЧислоПрописьюВсп(ТекущаяСтрока.Сумма, ТекущаяСтрока.Валюта, "Л = ru_RU; ДП = Ложь");
		
		ТекущаяСтрока.ПредставлениеПодразделения = ТекущаяСтрока.ПредставлениеОрганизации + " (" + ТекущаяСтрока.ПредставлениеКассы + ")";
		ТекущаяСтрока.ПредставлениеСтруктурногоПодразделения = ТекущаяСтрока.ПредставлениеПодразделения;
		ТекущаяСтрока.ПринятоОт = ТекущаяСтрока.ПредставлениеКонтрагента;
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);

	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуПКО(МассивОбъектов, ОбъектыПечати) Экспорт
	
	Макет = Документы.ПриходныйКассовыйОрдер.ПолучитьМакет("ПКО");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриходныйКассовыйОрдер_ПКО";
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ВыборкаПоОснованиям 		 = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиОснования.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		
		ОснованиеДляПечати = "";
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоОснованиям.Сбросить();
		Если ВыборкаПоОснованиям.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоОснованиям.Выбрать();			
			Пока Выборка.Следующий() Цикл
				Если (ТипЗнч(Выборка.Основание) = Тип("ДокументСсылка.ЗаказДоговор")) Тогда
					РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Основание, "НомерДоговора, Дата");
					
					Если ЗначениеЗаполнено(РеквизитыОснования.НомерДоговора) Тогда
						ОснованиеДляПечати = ОснованиеДляПечати + ?(ПустаяСтрока(ОснованиеДляПечати), "", ", ") + 
								"Заказ-договор №" + РеквизитыОснования.НомерДоговора + " от " + Формат(РеквизитыОснования.Дата, "ДФ=dd.MM.yyyy");
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.Основание) Тогда
					РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Основание, "Номер, Дата");
					ОснованиеДляПечати =  ОснованиеДляПечати + ?(ПустаяСтрока(ОснованиеДляПечати), "", ", ") +
						Строка(ТипЗнч(Выборка.Основание)) + " №" + Строка(ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыОснования.Номер))
						+ " от " + Формат(РеквизитыОснования.Дата, "ДФ=dd.MM.yyyy");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
		ОбластьМакета.Параметры.Основание = ОснованиеДляПечати;
		
		Руб = Цел(ДанныеПечати.Сумма);
		Коп = ОКР(100 * (ДанныеПечати.Сумма - Руб), 0, 1);
		Если ДанныеПечати.Валюта = Справочники.Валюты.RUB Тогда
			//RUB
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
			
			ОбластьМакета.Параметры.СуммаРубКоп = "" + Руб + " "+ДанныеПечати.Валюта+" " + Цел(Коп/10) + (Коп - 10 * Цел(Коп / 10)) + " коп.";
		ИначеЕсли ДанныеПечати.Валюта = Справочники.Валюты.BYR Тогда
			//BYR
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
			
			ОбластьМакета.Параметры.СуммаРубКоп = "" + Руб + " "+ДанныеПечати.Валюта+" " + Цел(Коп/10) + (Коп - 10 * Цел(Коп / 10)) + " коп.";
		ИначеЕсли ДанныеПечати.Валюта = Справочники.Валюты.UAH Тогда
			//UAH
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="гривна,гривны,гривен,ж,копейка,копейки,копеек,ж,2";
			
			ОбластьМакета.Параметры.СуммаРубКоп = "" + Руб + " "+ДанныеПечати.Валюта+" " + Цел(Коп/10) + (Коп - 10 * Цел(Коп / 10)) + " коп.";
		ИначеЕсли ДанныеПечати.Валюта = Справочники.Валюты.EUR Тогда
			//EUR
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="евро,евро,евро,с,цент,цента,центов,м,2";
			
			ОбластьМакета.Параметры.СуммаРубКоп = "" + Руб + " "+ДанныеПечати.Валюта+" " + Цел(Коп/10) + (Коп - 10 * Цел(Коп / 10)) + " центов";
		ИначеЕсли ДанныеПечати.Валюта = Справочники.Валюты.USD Тогда
			//USD
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="доллар,доллара,долларов,м,цент,цента,центов,м,2";
			
			ОбластьМакета.Параметры.СуммаРубКоп = "" + Руб + " "+ДанныеПечати.Валюта+" " + Цел(Коп/10) + (Коп - 10 * Цел(Коп / 10)) + " центов";
		КонецЕсли;
		
		ОбластьМакета.Параметры.СуммаПрописью = ЧислоПрописью(ДанныеПечати.Сумма, ФормСтрока, ПарПредмета);		
		
		ОбластьМакета.Параметры.ФИОКассира = ОбщийМодуль.ФамилияИнициалы(ДанныеПечати.Кассир);	
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
		
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область ПечатьЧека
// Возвращает предварительные параметры фискализации чека для документа.
//
// Параметры:
//   ДокументСсылка - ДокументСсылка.ПриходныйКассовыйОрдер - Документ.
//   ВерсияФФД - Строка - Версия ФФД.
//
// ВозвращаемоеЗначение:
//  Неопределено, Структура - см. функцию МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека().
//
Функция ПараметрыОперацииФискализацииЧека(ДокументСсылка, ВерсияФФД = Неопределено, ЭкземплярПодключаемогоОборудования = Неопределено) Экспорт
	
	// Общие параметры чека
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
			
	// Общие реквизиты для всех типов оборудования.
	ПотолкиКассыОнлайн.ЗаполнитьОбщиеРеквизиты(ДокументСсылка, ОбщиеПараметры, ЭкземплярПодключаемогоОборудования);
	
	// Товарные позиции И Таблица оплат
	Если ВерсияФФД = "1.0" Тогда
		ДополнитьТоварамиПараметрыПриПробитииЧека_1_0(ДокументСсылка, ОбщиеПараметры);
	Иначе
		ПотолкиКассыОнлайн.ДополнитьТоварамиПараметрыПриПробитииЧека(ДокументСсылка, ОбщиеПараметры);
	КонецЕсли;
	
	Возврат ОбщиеПараметры;
	
КонецФункции

#КонецОбласти

#Область ПечатьЧекаФФД_1_0

Процедура ДополнитьТоварамиПараметрыПриПробитииЧека_1_0(ДокументСсылка, ОбщиеПараметры)
	
	ТаблицаТоваров = ЗаполнитьТаблицуТоваровПоОснованию(ДокументСсылка);
	
	Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		//СтрокаПозицииЧека = Новый Структура();
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		//СтрокаПозицииЧека.Вставить("ФискальнаяСтрока");
		Если ПустаяСтрока(Строка(СтрокаТЧ.Номенклатура)) Тогда
			СтрокаПозицииЧека.Вставить("Наименование", "Предоплата");
		Иначе
			СтрокаПозицииЧека.Вставить("Наименование", Строка(СтрокаТЧ.Номенклатура));
		КонецЕсли;
		СтрокаПозицииЧека.Вставить("Количество"  , СтрокаТЧ.Количество);
		СтрокаПозицииЧека.Вставить("Цена"        , СтрокаТЧ.Цена);
		СтрокаПозицииЧека.Вставить("Сумма"       , СтрокаТЧ.Сумма);
		СтрокаПозицииЧека.Вставить("НомерСекции" , СтрокаТЧ.НомерСекции);
		СтрокаПозицииЧека.Вставить("СтавкаНДС"   , ВернутьСтавкуНДС(СтрокаТЧ.СтавкаНДС));
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	КонецЦикла;
	
	// Подготовка таблицы оплат
	// Наличные
	СуммаВидаОплаты = ДокументСсылка.Сумма;
	Если СуммаВидаОплаты <> 0 Тогда
		СтрокаОплаты = Новый Структура();
		//СтрокаОплаты.Вставить("ТипОплаты", 0); // Наличные
		СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"));
		СтрокаОплаты.Вставить("Наименование", "Наличная оплата");
		СтрокаОплаты.Вставить("Сумма", СуммаВидаОплаты);
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьТаблицуТоваровПоОснованию(ДокументСсылка) Экспорт
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("Сумма");
	ТаблицаТоваров.Колонки.Добавить("НомерСекции");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	
	ДокументСсылкаОснование = Неопределено;
	Если ДокументСсылка.Основания.Количество() > 0 Тогда
		ДокументСсылкаОснование = ДокументСсылка.Основания[0].Основание;
	КонецЕсли;
	 
	Если ЭтоПолнаяОплата(ДокументСсылка) Тогда
		//заполним табличную часть товаров (товары и услуги) по основанию
		Если ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаказДоговор") 
			или ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.Монтаж") 
			Тогда
			//ТоварыУслуги
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.ТоварыУслуги Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
			
		//Исключено в 2.0	
		//ИначеЕсли ТипЗнч(ДокументСсылка.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство")  
		//	Тогда
		//	//продукция
		//	Если НЕ ДокументСсылка.Основание.ЗаказНаПродажу Тогда
		//		НоваяСтрока = ТаблицаТоваров.Добавить();
		//		НоваяСтрока.Номенклатура = ДокументСсылка.Основание.ПродукцияНоменклатура;
		//		НоваяСтрока.Количество = ДокументСсылка.Основание.ПродукцияНоменклатураКоличество;
		//		НоваяСтрока.Цена = ДокументСсылка.Основание.ПродукцияЦена;
		//		НоваяСтрока.Сумма = ДокументСсылка.Основание.ПродукцияСумма;
		//		НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
		//		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		//		//цену высчитаем из суммы, т.к. могли быьт скидки
		//		Если НЕ НоваяСтрока.Количество = 0 Тогда
		//			НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
		//		КонецЕсли;
		//	КонецЕсли;
		//	//товары
		//	Для Каждого ТекущаяСтрока Из ДокументСсылка.Основание.Товары Цикл
		//		НоваяСтрока = ТаблицаТоваров.Добавить();
		//		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		//		НоваяСтрока.Количество = ТекущаяСтрока.Количество;
		//		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
		//		НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
		//		НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
		//		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		//		//цену высчитаем из суммы, т.к. могли быьт скидки
		//		Если НЕ НоваяСтрока.Количество = 0 Тогда
		//			НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
		//		КонецЕсли;
		//	КонецЦикла;
		//	//услуги
		//	Для Каждого ТекущаяСтрока Из ДокументСсылка.Основание.Услуги Цикл
		//		НоваяСтрока = ТаблицаТоваров.Добавить();
		//		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		//		НоваяСтрока.Количество = ТекущаяСтрока.Количество;
		//		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
		//		НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
		//		НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
		//		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		//		//цену высчитаем из суммы, т.к. могли быьт скидки
		//		Если НЕ НоваяСтрока.Количество = 0 Тогда
		//			НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
		//		КонецЕсли;
		//	КонецЦикла;
		
		ИначеЕсли ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.РеализацияТоваровИУслуг")  
			или ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.СчетНаОплату")  
			Тогда
			//товары
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.Товары Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
			//услуги
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.Услуги Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаявкаНаДоставку")  
			Тогда
			//одна строка - доставка груза
			НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ДокументСсылка.Сумма;
			НоваяСтрока.Сумма = ДокументСсылка.Сумма;
			НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
			НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		КонецЕсли;
	Иначе
		//укажем что это предоплата
		НоваяСтрока = ТаблицаТоваров.Добавить();
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = ДокументСсылка.Сумма;
		НоваяСтрока.Сумма = ДокументСсылка.Сумма;
		НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	КонецЕсли;
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция ЭтоПолнаяОплата(ДокументСсылка)
	
	Результат = Ложь;
	
	ДокументСсылкаОснование = Неопределено;
	Если ДокументСсылка.Основания.Количество() > 0 Тогда
		ДокументСсылкаОснование = ДокументСсылка.Основания[0].Основание;
	КонецЕсли;
	
	Если НЕ ДокументСсылкаОснование = Неопределено Тогда
		Если ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаявкаНаДоставку") Тогда
			Если ДокументСсылка.Сумма = ДокументСсылкаОснование.СтоимостьДоставки Тогда
				Результат = Истина;
			КонецЕсли;
		Иначе
			Если ДокументСсылка.Сумма = ДокументСсылкаОснование.СуммаДокумента Тогда
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция преобразования значения реквизита СтавкаНДС к типу Число.
Функция ВернутьСтавкуНДС(СтавкаНДС)
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		Ставка = 10;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
		Ставка = 18;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		Ставка = 20;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22") Тогда
		Ставка = 22;	
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5") Тогда
		Ставка = 5;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7") Тогда
		Ставка = 7;	
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
		Ставка = 0;
	Иначе
		Ставка = Неопределено;
	КонецЕсли;
	
	Возврат Ставка;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ВнутреннееПеремещениеДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	//#12229
	Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания данного документа
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПриходныйКассовыйОрдер) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ПриходныйКассовыйОрдер.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ПриходныйКассовыйОрдер.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Добавляет команду создания документа "Приходный кассовый ордер".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПриходныйКассовыйОрдер) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.ПриходныйКассовыйОрдерСоздатьНаОснованииМножественныйВыбор";
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ПриходныйКассовыйОрдер.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли