#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	Статья = Автор.СтатьяДДСПКО;	
	Если Касса.Владелец <> Организация Тогда
		Касса = Справочники.Кассы.ПустаяСсылка();
	КонецЕсли;
	
	ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("МассивДокументов") Тогда
			
			Если ДанныеЗаполнения.МассивДокументов.Количество() > 0 Тогда
				Если ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения.МассивДокументов);
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
					ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения.МассивДокументов);
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.Монтаж") Тогда
					ЗаполнитьПоМонтажу(ДанныеЗаполнения.МассивДокументов);
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
					ЗаполнитьПоРеализации(ДанныеЗаполнения.МассивДокументов);
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.СчетНаОплату") Тогда
					ЗаполнитьПоСчетуНаОплату(ДанныеЗаполнения.МассивДокументов);	
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("Основание") Тогда
			
			Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказДоговор")
				И ДанныеЗаполнения.Свойство("РассрочкаДатаПлатежа") 
				И ДанныеЗаполнения.Свойство("РассрочкаСумма") Тогда
				ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения.Основание, ДанныеЗаполнения.РассрочкаДатаПлатежа, ДанныеЗаполнения.РассрочкаСумма);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Замена") Тогда
		// Заполнение шапки
		//Комментарий = ДанныеЗаполнения.Основание.Комментарий; //#5849
		Контрагент = ДанныеЗаполнения.Основание.Контрагент;
		Договор = ДанныеЗаполнения.Основание.ДоговорКонтрагента;
		Сумма = ?(ДанныеЗаполнения.СуммаДокумента > 0, ДанныеЗаполнения.СуммаДокумента, 0);
		Валюта = ДанныеЗаполнения.Основание.Валюта;
		ДобавитьОснование(ДанныеЗаполнения);
		Организация = ДанныеЗаполнения.Основание.Организация;
		
		Если Сумма > 0 И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			НоваяСтрока = РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ДанныеЗаполнения.Основание;
			НоваяСтрока.Сумма = Сумма;
			НоваяСтрока.СуммаВВалютеДокумента = Сумма;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		ЗаполнитьПоРеализации(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		ЗаполнитьПоМонтажу(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаДоставку") Тогда
		
		ДобавитьОснование(ДанныеЗаполнения);
		Организация = ДанныеЗаполнения.Организация;
		Контрагент  = ДанныеЗаполнения.Получатель;
		Договор 	= ДанныеЗаполнения.Получатель.ОсновнойДоговор;
		Сумма  		= ДанныеЗаполнения.СтоимостьДоставки;
		Валюта 		= ДанныеЗаполнения.Валюта;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда	
		
		ЗаполнитьПоСчетуНаОплату(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		ДобавитьОснование(ДанныеЗаполнения);
		Организация 	= ДанныеЗаполнения.Организация;
		Подразделение 	= ДанныеЗаполнения.Подразделение; // № 12857
		Контрагент 		= ДанныеЗаполнения.Контрагент;
		Договор 		= ДанныеЗаполнения.Договор;
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Валюта 			= ДанныеЗаполнения.Валюта;
		Сумма  			= ДанныеЗаполнения.Сумма;
		Касса  			= ДанныеЗаполнения.Касса;
		Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику Тогда
			ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПодотчетника;
			//УДАЛИТЬ_ДокументВыдачиДС = ДанныеЗаполнения;
			Сотрудник = ДанныеЗаполнения.Сотрудник;
			
			//#14021 
			Сумма = 0;			
			ЗапросОстатка = Новый Запрос;
			ЗапросОстатка.УстановитьПараметр("ДокументВыдачиДС", ДанныеЗаполнения);
			ЗапросОстатка.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасчетыОстатки.ДокументВыдачиДС КАК Документ,
			|	РасчетыОстатки.СуммаОстаток КАК Сумма
			|ИЗ
			|	РегистрНакопления.РасчетыСПодотчетникамиПоДокументамАвансов.Остатки(, ДокументВыдачиДС = &ДокументВыдачиДС) КАК РасчетыОстатки";
			ВыборкаОстатка = ЗапросОстатка.Выполнить().Выбрать();
			Если ВыборкаОстатка.Следующий() Тогда
				Сумма =   ВыборкаОстатка.Сумма;
				ЗаполнитьЗначенияСвойств(ВыданныеАвансы.Добавить(), ВыборкаОстатка);
			КонецЕсли;			  
			
			//#7080	
		ИначеЕсли ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику Тогда
			ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПоставщика;
			//Основания.Очистить(); // #13456 закомментировано
			РаспределениеПлатежа.Загрузить(ДанныеЗаполнения.РаспределениеПлатежа.Выгрузить());
		КонецЕсли;
		
		//#7080
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ВидОперации 	= Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПоставщика;
		Организация 	= ДанныеЗаполнения.Организация;
		Подразделение 	= ДанныеЗаполнения.Подразделение; // № 12857
		Контрагент 		= ДанныеЗаполнения.Контрагент;
		Договор 		= ДанныеЗаполнения.ДоговорКонтрагента;
		Сумма  			= ДанныеЗаполнения.СуммаДокумента;
		Валюта 			= ДанныеЗаполнения.Валюта;
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения;
		НоваяСтрока.Сумма = ДанныеЗаполнения.СуммаДокумента;
		
		ДобавитьОснование(ДанныеЗаполнения);
		
	КонецЕсли;
	
	// №9078 определение статьи перенесено сюда сверху, т.к. вид операции может быть изменен взависимости от основания
	СтатьяДоходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, ВидОперации);
	СтатьяДоходовПоНачислению = СтатьяДоходов; //#9708
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		КатегорияКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Категория");	
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)	
	
	ИнициализироватьСлужебныеРеквизиты(); //#14482
	
	РаспределениеПлатежа.Очистить();	
	ЧекФискализирован = Ложь;
	НомерСменыККМ = 0;
	НомерЧекаККМ = 0;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПолеСтатьяДДСОбязательно = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();	
	Если НЕ ЗначениеЗаполнено(Статья) И ПолеСтатьяДДСОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Не заполнена статья движения денежных средств!'"), ЭтотОбъект,
		"Статья",,Отказ);
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПодотчетника Тогда
		ИзрасходованоИтог = ВыданныеАвансы.Итог("Сумма");	
		
		Если ИзрасходованоИтог > Сумма Тогда
			ТекстСообщения = НСтр("ru = 'Израсходованная сумма авансов превышает сумму по документу!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВыданныеАвансы[0].Сумма", ,Отказ);
		КонецЕсли;	
	КонецЕсли;
	
	//++ №12420
	Если ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя
		Или ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПоставщика
		Или ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ПолучениеКредита
		Или ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратЗайма
		Тогда
		ПроверяемыеРеквизиты.Добавить("Контрагент");
		ПроверяемыеРеквизиты.Добавить("Договор");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПодотчетника Тогда
		ПроверяемыеРеквизиты.Добавить("Сотрудник");
	КонецЕсли;
	//-- №12420
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи);
	
	ФинансыСервер.ДокументПриходаПередЗаписью(ЭтотОбъект, Истина, ВидОперации, Отказ, РежимЗаписи, РежимПроведения);
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ Касса.Владелец = Организация Тогда
		Сообщить("Касса " + Касса + " не принадлежит организации "+Организация+". Проведение отменено.");
		Отказ = Истина;
	КонецЕсли;
	Если НЕ Касса.Валюта = Валюта Тогда
		Если Касса.КонтролироватьВалюту Тогда
			Сообщить("Касса " + Касса + " хранит только валюту " + Касса.Валюта + ". В документе указана валюта " + Валюта + ". Проведение отменено.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	#Область ОплатаОтПокупателя	
	Если ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя Тогда
		
		//++ №12420 комментируем, т.к. перенесено в обработку проверки заполнения
		////проверка
		//Если Контрагент.Пустая() Тогда
		//	Сообщить("Не указан контрагент. Проведение отменено");
		//	Отказ = Истина;
		//	Возврат;
		//КонецЕсли;
		//-- №12420 комментируем, т.к. перенесено в обработку проверки заполнения
		
		// регистр ВзаиморасчетыСКонтрагентами Расход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		//Движение.Документ = Ссылка;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		
		//Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения =ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Валюта = Валюта;
		Движение.Сумма = Сумма;
		
		//Бонусы контрагентов
		Движения.БонусыКонтрагентов.Записывать = Истина;
		Если НачислятьБонусы
			И ?(СлужебныйУчетБонусовПоДисконтнымКартам, НЕ ДисконтнаяКарта.Пустая(), Истина) // №6316 нужно проверить заполнение дисконтной карты
			Тогда
			Если НЕ СуммаБонусовКНачислениюПоДисконтнойКарте = 0 Тогда
				Движение = Движения.БонусыКонтрагентов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Контрагент = Контрагент;
				Движение.ДисконтнаяКарта = ДисконтнаяКарта;
				Движение.Сумма = СуммаБонусовКНачислениюПоДисконтнойКарте;
				Движение.ДокументНАНБ = ДокументНАНБ;
				Движение.КатегорияКонтрагента = КатегорияКонтрагента;
			КонецЕсли;
		КонецЕсли;
		
		//nva+++
		//изменяем статус оплаты распределенных заказов покупателей	
		//НачатьТранзакцию();
		//Для Каждого СтрокаРаспределениеПлатежа Из РаспределениеПлатежа Цикл
		//	Если ТипЗнч(СтрокаРаспределениеПлатежа.Документ) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	ЗаказПокупателя = СтрокаРаспределениеПлатежа.Документ;
		//	СуммаВЗаказеПокупателя =  ЗаказПокупателя.СуммаДокумента;
		//	Если СуммаВЗаказеПокупателя < СтрокаРаспределениеПлатежа.Сумма Тогда
		//		СпособОплатыЗаказа = Справочники.СпособыОплатыЗаказа.ЧастичноОплачен;
		//	Иначе
		//		СпособОплатыЗаказа = Касса.СпособОплатыЗаказа;
		//	КонецЕсли;
		//	
		//	Если ОбщийМодульВызовСервера.ПроверкаОбъектЗаблокирован(ЗаказПокупателя).Заблокирован Тогда
		//		Если НЕ ОбменДанными.Загрузка Тогда
		//			Отказ = Истина;
		//		КонецЕсли;
		//		Сообщить("Документ: " + ЗаказПокупателя + " заблокирован другим пользователем!");
		//		Продолжить;
		//	КонецЕсли;
		//	ЗаказПокупателяОбъект = ЗаказПокупателя.ПолучитьОбъект();			
		//	Если ЗаказПокупателяОбъект.СпособОплаты <> СпособОплатыЗаказа Тогда
		//		ЗаказПокупателяОбъект.СпособОплаты = СпособОплатыЗаказа;
		//		ЗаказПокупателяОбъект.Записать();
		//	КонецЕсли;	
		//КонецЦикла;	  
		//Если Отказ Тогда
		//	ОтменитьТранзакцию(); 
		//Иначе	
		//	ЗафиксироватьТранзакцию();
		//КонецЕсли;		
		//nva---
		
		#КонецОбласти
		
		#Область ВозвратОтПодотчетника	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПодотчетника Тогда
		
		//++ №12420 комментируем, т.к. перенесено в обработку проверки заполнения
		////проверка
		//Если Сотрудник.Пустая() Тогда
		//	Сообщить("Не указан сотрудник. Проведение отменено");
		//	Отказ = Истина;
		//	Возврат;
		//КонецЕсли;
		//-- №12420 комментируем, т.к. перенесено в обработку проверки заполнения
		
		// регистр РасчетыСПодотчетниками Расход
		Движения.РасчетыСПодотчетниками.Записывать = Истина;		
		Движение = Движения.РасчетыСПодотчетниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сотрудник = Сотрудник;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);		
		
		// регистр РасчетыСПодотчетникамиПоДокументамАвансов Расход
		Движения.РасчетыСПодотчетникамиПоДокументамАвансов.Записывать = Истина;
		Для Каждого Аванс Из ВыданныеАвансы Цикл
			Движение = Движения.РасчетыСПодотчетникамиПоДокументамАвансов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Сотрудник = Сотрудник;
			Движение.ДокументВыдачиДС = Аванс.Документ;
			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Аванс.Сумма);			
		КонецЦикла;
		
		#КонецОбласти		
		
		#Область ВозвратОтПоставщика	
		//#7080
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПоставщика Тогда
		
		//++ №12420 комментируем, т.к. перенесено в обработку проверки заполнения
		////проверка
		//Если Контрагент.Пустая() Тогда
		//	Сообщить("Не указан контрагент. Проведение отменено");
		//	Отказ = Истина;
		//	Возврат;
		//КонецЕсли;
		//-- №12420 комментируем, т.к. перенесено в обработку проверки заполнения
		
		// регистр ВзаиморасчетыСКонтрагентами Расход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		//Движение.Документ = Ссылка;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		
		//Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения =ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Валюта = Валюта;
		Движение.Сумма = Сумма;
		
		// регистр РасчетыСКонтрагентами Расход
		Движения.РасчетыСКонтрагентами.Записывать = Истина;
		Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
			Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Движение = Движения.РасчетыСКонтрагентами.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период 	 = Дата;
				Движение.Заказ 		 = ТекущаяСтрока.Документ;
				Движение.Контрагент  = Контрагент;
				Движение.Организация = Организация;
				Движение.Сумма 		 = ТекущаяСтрока.Сумма;
			КонецЕсли;
		КонецЦикла;
		
		#КонецОбласти				
		
		#Область ПолучениеКредита_ИЛИ_ВозвратЗайма	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ПолучениеКредита ИЛИ ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратЗайма Тогда
		
		// регистр КредитыИЗаймы Расход
		Движения.КредитыИЗаймы.Записывать = Истина;		
		Движение = Движения.КредитыИЗаймы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент  = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаОсновногоТелаЗайма);		
		
		РаспределениеПлатежа.Очистить();
	КонецЕсли;
	#КонецОбласти			
	
	// регистр ДенежныеСредства Приход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.СчетКасса = Касса;
	Движение.Валюта = Валюта;
	Движение.Сумма = Сумма;
	
	// регистр ДвиженияДенежныеСредства Приход
	Если ЗначениеЗаполнено(Статья) И ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоСтатьямДДС") Тогда
		Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СчетКасса = Касса;
		Движение.СуммаПриход = Сумма;
		Движение.Статья = Статья;
		Движение.Валюта = Валюта;
	КонецЕсли;
	
	//регистр ДолгиПоРассрочкам
	Движения.ДолгиПоРассрочкам.Записывать = Истина;
	Для Каждого СтрокаРаспределения Из РаспределениеПлатежа Цикл
		Если ТипЗнч(СтрокаРаспределения.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Если НЕ СтрокаРаспределения.Документ.Пустая() Тогда
				Если НЕ СтрокаРаспределения.ДатаПлатежаПоРассрочке = Дата(1,1,1) Тогда
					Движение = Движения.ДолгиПоРассрочкам.Добавить();
					Движение.Период = Дата;
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.СрокПлатежа = СтрокаРаспределения.ДатаПлатежаПоРассрочке;
					Движение.ЗаказДоговор = СтрокаРаспределения.Документ;
					//#9779
					//Движение.Сумма = СтрокаРаспределения.Сумма;
					Если СтрокаРаспределения.Документ.Валюта = Валюта ИЛИ СтрокаРаспределения.СуммаВВалютеДокумента = 0 Тогда 
						Движение.Сумма = СтрокаРаспределения.Сумма;
					Иначе
						Движение.Сумма = СтрокаРаспределения.СуммаВВалютеДокумента; 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//Распределение РасчетыПоЗаказам
	СписокВидовДокументовПоКоторымВедутсяРасчеты = ОбщийМодуль.ПолучитьМассивТиповДокументовПоКоторымВедутсяРасчетыПоЗаказам();
	Движения.РасчетыПоЗаказам.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл		
		НайденныйВидДокумента = СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(ТипЗнч(ТекущаяСтрока.Документ));
		Если НайденныйВидДокумента <> Неопределено Тогда  
			Если НЕ ТекущаяСтрока.Сумма = 0 Тогда
				Движение = Движения.РасчетыПоЗаказам.Добавить();
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Заказ = ТекущаяСтрока.Документ;
				Если ТекущаяСтрока.Документ.Валюта = Валюта ИЛИ ТекущаяСтрока.СуммаВВалютеДокумента = 0 Тогда 
					Движение.Сумма = ТекущаяСтрока.Сумма;
				Иначе
					Движение.Сумма = ТекущаяСтрока.СуммаВВалютеДокумента; 
				КонецЕсли;
				Движение.Контрагент = Контрагент; // №6496 добавлен контрагент в измерение
			КонецЕсли;
		КонецЕсли;			
	КонецЦикла;
	
	//регистр ВзаиморасчетыСКонтрагентамиПоЗаказам Расход
	Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
		Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Движение = Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Заказ = ТекущаяСтрока.Документ;
			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
		КонецЕсли;					
	КонецЦикла;
	
	
	//отправка СМС
	Если НЕ Отказ 
		И СМСОтправлятьПриПроведении
		И РаботаССМС.ИспользоватьОтправкуСМС() 
		И РаботаССМС.ОтправлятьСМСКонтрагентуПоПКО() 
		И Константы.АвтоматическаяРассылкаСМС.Получить()
		И РаботаССМС.ОтправлятьСМСКонтрагенту(Контрагент) Тогда
		
		НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		НомерТелефона = РаботаССМС.ПодготовитьНомерТелефонаДляОтправкиСМС(СокрЛП(НомерТелефона));
		Если НЕ ПустаяСтрока(НомерТелефона) Тогда
			
			//проверим, не отправлялось ли новая СМС по данному документу ранее или не находится в очереди
			ПризнакСМС = Перечисления.ПризнакиСМС.Новая;
			СМСОтправляласьИлиВОчереди = РаботаССМС.СМСОтправляласьРанее(Ссылка, Контрагент, ПризнакСМС);			
			//СМСОтправляласьРанее("СМСКОтправке", Ссылка, Контрагент, ПризнакСМС)
			//ИЛИ СМСОтправляласьРанее("СМСОтправленные", Ссылка, Контрагент, ПризнакСМС);				
			
			Если Не СМСОтправляласьИлиВОчереди Тогда				
				//ставим СМС в очередь на отправку
				МенеджерЗаписи = РегистрыСведений.СМСКОтправке.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ТекущаяДатаСеанса();
				МенеджерЗаписи.ДокументОснование = Ссылка;
				МенеджерЗаписи.ПризнакСМС = ПризнакСМС;
				МенеджерЗаписи.Прочитать();
				МенеджерЗаписи.Период = ТекущаяДатаСеанса();
				МенеджерЗаписи.ДокументОснование = Ссылка;
				МенеджерЗаписи.Контрагент = Контрагент;
				МенеджерЗаписи.ПризнакСМС = ПризнакСМС;
				МенеджерЗаписи.НомерТелефона = НомерТелефона;
				ТекстСМС = ЗаменитьПараметрыВШаблоне(Константы.ШаблонСМСКонтрагентуПоПКО.Получить());				
				МенеджерЗаписи.ТекстСообщения = ТекстСМС;
				МенеджерЗаписи.Записать();
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов 
		И НЕ (ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ПолучениеКредита 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратЗайма) Тогда
		Если НЕ СтатьяДоходов.Пустая() И ПараметрыСеанса.ФинРезультатКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//кассовый метод
			Движения.ДоходыРасходы.Записывать = Истина;
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяДоходов;
			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
			Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
			Движение.СуммаРасходов 	= 0;
		КонецЕсли;
		
		//#9708
		Если ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.Прочее 
			И НЕ СтатьяДоходовПоНачислению.Пустая() И ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод
			Движения.ДоходыРасходы.Записывать = Истина;
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяДоходовПоНачислению;
			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
			Движение.СуммаРасходов 	= 0;
		КонецЕсли;
	КонецЕсли;
	
	Если  ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратЗайма И ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов И СуммаПроцентовПоЗайму > 0  Тогда
		Движения.ДоходыРасходы.Записывать = Истина;
		Движение = Движения.ДоходыРасходы.Добавить();
		Движение.Период 		= Дата;
		Движение.Организация 	= Организация;
		Движение.Подразделение 	= Подразделение;
		Движение.Статья 		= СтатьяДоходов;
		Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
		Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаПроцентовПоЗайму);
		Движение.СуммаРасходов 	= 0;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	СМСОтправлятьПриПроведении = РаботаССМС.ИспользоватьОтправкуСМС() и РаботаССМС.ОтправлятьСМСКонтрагентуПоПКО();
	
	// №6960 настройки по бонусам делаем только если глобально включен учет бонусов
	Если ПолучитьФункциональнуюОпцию("УчетБонусов") Тогда
		//#13834 изменена настройка
		//НачислятьБонусы 						= Константы.АвтоматическиНачислятьБонусыВДокументахОплаты.Получить();
		НачислятьБонусы 						= Константы.АвтоматическиНачислятьБонусы.Получить();
		СлужебныйУчетБонусовПоДисконтнымКартам 	= Константы.УчетБонусовПоДисконтнымКартам.Получить();
	Иначе
		НачислятьБонусы = Ложь;
		СлужебныйУчетБонусовПоДисконтнымКартам = Ложь;
	КонецЕсли;
	
	ДисконтнаяКарта = Справочники.ДисконтныеКарты.ПустаяСсылка();
	СуммаБонусовКНачислениюПоДисконтнойКарте = 0;
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	Если ЗначениеЗаполнено(Организация) Тогда
		УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
		СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
		
		ФинансыКлиентСервер.ПересчитатьСуммуНДС(ЭтотОбъект, УчитыватьНДС);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивДокументов);
	
	Контрагент 		= МассивДокументов[0].Контрагент;
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; //#5775
	Валюта 			= МассивДокументов[0].Валюта; 		 //#7373
	
	ДобавлятьЗаказыВторогоПорядкаВРаспределение = НЕ Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	ДобавлятьДокументыПродажиПоЗаказам = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
	И Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить(); 
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;				
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если ДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, РаспределениеПлатежа, Сумма);
		КонецЕсли;		
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
	//#7709 
	//после определения суммы документа
	Если ДобавлятьДокументыПродажиПоЗаказам Тогда
		Для каждого ЭлементМассива из МассивДокументов Цикл
			ФинансыСервер.ДобавитьДокументыПродажиПоЗаказам(ЭтотОбъект, ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения, ДатаПлатежаПоРассрочке = '00010101', СуммаПлатежаРассрочки = 0)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;	
	
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; //#12846
	Контрагент 		= МассивДокументов[0].Контрагент;
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 			= МассивДокументов[0].Валюта; //#7373
	//Комментарий	= МассивДокументов[0].Комментарий;
	
	ДобавлятьДокументыПродажиПоЗаказам = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
	И Константы.ВестиРасчетыПоЗаказамПоМонтажу.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ);
		Если СуммаПлатежаРассрочки > 0 Тогда
			НоваяСтрока.Сумма = СуммаПлатежаРассрочки;
			НоваяСтрока.ДатаПлатежаПоРассрочке = ДатаПлатежаПоРассрочке;
		КонецЕсли;
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
	//#7709 
	//после определения суммы документа
	Если ДобавлятьДокументыПродажиПоЗаказам Тогда
		Для каждого ЭлементМассива из МассивДокументов Цикл
			ФинансыСервер.ДобавитьДокументыПродажиПоЗаказам(ЭтотОбъект, ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоРеализации(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Контрагент 		= МассивДокументов[0].Контрагент;		
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; // № 12857
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 			= МассивДокументов[0].Валюта; //#7373
	
	НеДобавлятьЗаказыВторогоПорядкаВРаспределение = Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;				
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если НЕ НеДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, РаспределениеПлатежа, Сумма);
		КонецЕсли;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоМонтажу(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Контрагент 	= МассивДокументов[0].Контрагент;		
	Организация = МассивДокументов[0].Организация;
	Договор 	= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 		= МассивДокументов[0].Валюта; //#7373
	
	НеДобавлятьЗаказыВторогоПорядкаВРаспределение = Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;				
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если НЕ НеДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, РаспределениеПлатежа, Сумма);
		КонецЕсли;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоСчетуНаОплату(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Контрагент 	= МассивДокументов[0].Контрагент;		
	Организация = МассивДокументов[0].Организация;
	Договор 	= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 		= МассивДокументов[0].Валюта; //#7373
	
	НеДобавлятьЗаказыВторогоПорядкаВРаспределение = Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;				
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если НЕ НеДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, РаспределениеПлатежа, Сумма);
		КонецЕсли;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
КонецПроцедуры

Процедура ДобавитьОснование(ДанныеЗаполнения) Экспорт
	
	НайденныеСтроки = Основания.НайтиСтроки(Новый Структура("Основание", ДанныеЗаполнения));
	Если  НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = Основания.Добавить();
		НоваяСтрока.Основание = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ЗаменитьПараметрыВШаблоне(ТекстСМС)
	//Допустимые параметры:
	//%Организация - наименование организации
	//%Контрагент - наименование контрагента
	//%ДатаДокумента - дата ПКО
	//%НомерДокумента - номер ПКО
	//%СуммаДокумента - сумма ПКО
	//%ВалютаДокумента - валюта ПКО
	
	Если ПустаяСтрока(ТекстСМС) Тогда
		Сообщить ("ВНИМАНИЕ!!! В системе не заданы шаблоны СМС по ПКО!!!", СтатусСообщения.ОченьВажное);
		ТекстСМС = "%ДатаДокумента. Поступил платеж на сумму %СуммаДокумента. %Организация";
	КонецЕсли;
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Организация",    Организация.Наименование);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%Контрагент",     Контрагент.Наименование);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%ДатаДокумента",  Лев(Дата, 10));
	Попытка
		ТекстСМС = СтрЗаменить(ТекстСМС, "%НомерДокумента", Формат(Число(СтрЗаменить(Номер, Организация.ПрефиксОрганизации, "")), "ЧГ=0"));
	Исключение
	КонецПопытки;
	ТекстСМС = СтрЗаменить(ТекстСМС, "%СуммаДокумента", Сумма);
	ТекстСМС = СтрЗаменить(ТекстСМС, "%ВалютаДокумента", Валюта.Наименование);
	Возврат ТекстСМС;
	
КонецФункции

Функция ПолучитьОстатокДолгаПоЗаказу(Документ) ЭКСПОРТ
		
		Заказ = Неопределено;
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.Монтаж") Тогда
			Заказ = Документ.Основание;
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Заказ = Документ;
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Заказ = Документ;
			//НАЧАЛО: Переход на 2.0
			//ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
			//	Заказ = Документ;
			//КОНЕЦ: Переход на 2.0
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СчетНаОплату") Тогда
			Заказ = Документ;
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
			Возврат Документ.СуммаДокумента;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоЗаказамОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ = &Заказ) КАК РасчетыПоЗаказамОстатки";
		Запрос.УстановитьПараметр("Заказ",Заказ);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.СуммаОстаток;
		КонецЦикла;
		
		Возврат 0;
		
	КонецФункции
	
#КонецЕсли