//#13148

#Область ПрограммныйИнтерфейс

Процедура ОтправитьДокументВRevvy(ОбъектСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Сообщить("Документ должен быть записан");
		Возврат;
	КонецЕсли;
	
	СтруктураСостоянияДокумента = RVY_ОбщийМодульВызовСервера.ПолучитьСостояниеДокумента(ОбъектСсылка);
	Если СтруктураСостоянияДокумента.Состояние = 2 Тогда
		Сообщить("Документ был отправен в Revvy " + Строка(СтруктураСостоянияДокумента.ДатаОтправки));
		Возврат;
	КонецЕсли;
	
	// выбор контакта	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьДокументВRevvyЗавершение", ЭтотОбъект, ОбъектСсылка);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаОбъект", ОбъектСсылка); 
 	
	ОткрытьФорму("РегистрСведений.RVY_Вебхуки.Форма.ФормаВыбораКонтакта", ПараметрыФормы, ,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОтправитьДокументВRevvyЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДанныеКонтакта = Результат;
	Если НЕ ТипЗнч(ДанныеКонтакта) = Тип("Структура") Тогда
		Возврат; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеКонтакта.НомерТелефона) Тогда
		Сообщить("Не указан контактный телефон");
		Возврат;
	КонецЕсли;
	
	ОбъектСсылка = ДополнительныеПараметры;	
	ДатаДобавления = ТекущаяДата();
	РезультатОтправки = RVY_ОбщийМодульКлиентСервер.ОтправитьВRevvy(ДанныеКонтакта.Контакт, ДанныеКонтакта.НомерТелефона);
	Если РезультатОтправки Тогда
		RVY_ОбщийМодульВызовСервера.СохранитьСостояниеДокумента(ОбъектСсылка, ДанныеКонтакта.Контакт, ДанныеКонтакта.НомерТелефона, ДатаДобавления, ДатаДобавления);	
		Оповестить("ОтправитьДокументВRevvy", ОбъектСсылка);
	Иначе
		// запрос отправить не удалось, сохраним информацию в регистр без заполнения даты отправки
		RVY_ОбщийМодульВызовСервера.СохранитьСостояниеДокумента(ОбъектСсылка, ДанныеКонтакта.Контакт, ДанныеКонтакта.НомерТелефона, ДатаДобавления);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
