#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ПлатежноеПоручениеИсходящее";
    КомандаПечати.Идентификатор = "ПлатежноеПоручение";
    КомандаПечати.Представление = НСтр("ru = 'Платежное поручение'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Платежное поручение'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПлатежноеПоручениеИсходящее";
	КомандаПечати.Идентификатор  = "ПриложениеСписокСотрудников";
	КомандаПечати.Представление  = НСтр("ru = 'Приложение (список сотрудников)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Приложение (список сотрудников)'");
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПлатежноеПоручение") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        	КоллекцияПечатныхФорм,
        	"ПлатежноеПоручение",
        	НСтр("ru = 'ПлатежноеПоручение'"),
        	ФинансыСервер.СформироватьПечатнуюФормуПлатежногоПоручения(МассивОбъектов, ОбъектыПечати));
    КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриложениеСписокСотрудников") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        	КоллекцияПечатныхФорм,
        	"ПриложениеСписокСотрудников",
        	НСтр("ru = 'Приложение'"),
        	ФинансыСервер.СформироватьПечатнуюФормуПриложения(МассивОбъектов, ОбъектыПечати));
    КонецЕсли;

КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.ВерсияДанных КАК ВерсияДанных,
	|	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.ВидОперации КАК ВидОперации,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.ИсхДата КАК ИсхДата,
	|	ДанныеДокумента.ИсхНомер КАК ИсхНомер,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Организация.ПолноеНаименование <> """"
	|			ТОГДА ДанныеДокумента.Организация.ПолноеНаименование
	|		ИНАЧЕ ДанныеДокумента.Организация.Наименование
	|	КОНЕЦ КАК ТекстПлательщика,
	|	ДанныеДокумента.Организация.ИНН КАК ОрганизацияИНН,
	|	ДанныеДокумента.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Контрагент ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Контрагент.НаименованиеПолное <> """"
	|						ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|					ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Контрагент ССЫЛКА Справочник.Сотрудники
	|			ТОГДА ДанныеДокумента.Контрагент.Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТекстПолучателя,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.Статья КАК Статья,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.Счет КАК Счет,
	|	ДанныеДокумента.Счет.НомерСчета КАК НомерСчетаПлательщика,
	|	ДанныеДокумента.Счет.БИК КАК БИКБанкаПлательщика,
	|	ДанныеДокумента.Счет.КоррСчет КАК СчетБанкаПлательщика,
	|	ДанныеДокумента.Счет.НаименованиеБанка КАК НаименованиеБанкаПлательщика,
	|	ДанныеДокумента.Счет.ГородБанка КАК ГородБанкаПлательщика,
	|	ДанныеДокумента.СчетКонтрагента КАК СчетКонтрагента,
	|	ДанныеДокумента.СчетКонтрагента.НомерСчета КАК НомерСчетаПолучателя,
	|	ДанныеДокумента.СчетКонтрагента.БИК КАК БИКБанкаПолучателя,
	|	ДанныеДокумента.СчетКонтрагента.КоррСчет КАК СчетБанкаПолучателя,
	|	ДанныеДокумента.СчетКонтрагента.НаименованиеБанка КАК НаименованиеБанкаПолучателя,
	|	ДанныеДокумента.СчетКонтрагента.ГородБанка КАК ГородБанкаПолучателя,
	|	ДанныеДокумента.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	ДанныеДокумента.ПеречислениеВБюджет КАК ПеречислениеВБюджет,
	|	ДанныеДокумента.СтатусСоставителя КАК СтатусСоставителя,
	|	ДанныеДокумента.КодБК КАК КодБК,
	|	ДанныеДокумента.КодОКАТО КАК КодОКАТО,
	|	ДанныеДокумента.ПоказательОснования КАК ПоказательОснования,
	|	ДанныеДокумента.ПоказательПериода КАК ПоказательПериода,
	|	ДанныеДокумента.ПоказательНомера КАК ПоказательНомера,
	|	ДанныеДокумента.ПоказательДаты КАК ПоказательДаты,
	|	ДанныеДокумента.ПоказательТипа КАК ПоказательТипа,
	|	ДанныеДокумента.ТипПлатежногоДокумента КАК ТипПлатежногоДокумента,
	|	ДанныеДокумента.ОчередностьПлатежа КАК ОчередностьПлатежа,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	ДанныеДокумента.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеДокумента.СлужебныйКонтролироватьЗаполнениеЗаявки КАК СлужебныйКонтролироватьЗаполнениеЗаявки,
	|	ДанныеДокумента.КодВидаДохода КАК КодВидаДохода,
	|	ДанныеДокумента.СтатьяРасходовПоНачислению КАК СтатьяРасходовПоНачислению
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ДанныеДокумента.СчетСотрудника.НомерСчета КАК НомерСчета,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СчетСотрудника КАК СчетСотрудника
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее.ЗарплатаСотрудникам КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Документ КАК Документ,
	|	ДанныеДокумента.Сумма КАК Сумма
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее.РаспределениеПлатежа КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиЗарплата 		= МассивРезультатов[1];
	РезультатПоТабличнойЧастиРаспределение  = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиЗарплата, РезультатПоТабличнойЧастиРаспределение",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиЗарплата, РезультатПоТабличнойЧастиРаспределение);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам = Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	РезультатЗапроса.Колонки.Добавить("ДатаДокумента", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));
	РезультатЗапроса.Колонки.Добавить("СуммаПрописью", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("СуммаЧислом",   Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ИННПлательщика", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("КПППлательщика",   Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ИННПолучателя", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("КПППолучателя",   Новый ОписаниеТипов("Строка"));
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
		
		ТекущаяСтрока.ДатаДокумента = Формат(ТекущаяСтрока.Дата, "ДЛФ=Д");
		ТекущаяСтрока.СуммаПрописью = РаботаСВалютой.СформироватьЧислоПрописьюВсп(ТекущаяСтрока.Сумма, ТекущаяСтрока.Валюта, "Л = ru_RU; ДП = Ложь");
		ТекущаяСтрока.СуммаЧислом   = Формат(ТекущаяСтрока.Сумма, "ЧДЦ=2; ЧРД=-");
		
		ТекущаяСтрока.ИННПлательщика = "ИНН " + ТекущаяСтрока.ОрганизацияИНН;
		ТекущаяСтрока.КПППлательщика = "КПП " + ТекущаяСтрока.ОрганизацияКПП;
		
		ТекущаяСтрока.ИННПолучателя = "ИНН " + ТекущаяСтрока.КонтрагентИНН;
		ТекущаяСтрока.КПППолучателя = "КПП " + ТекущаяСтрока.КонтрагентКПП;
		
		Если ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);
		Иначе
			ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.СписаниеСРасчетногоСчета.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Платежное поручение исходящее"
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПлатежноеПоручениеИсходящее) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ПлатежноеПоручениеИсходящее.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ПлатежноеПоручениеИсходящее.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли