
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Параметры.ЗакрыватьПриВыборе            = Истина;
	Параметры.ЗакрыватьПриЗакрытииВладельца = Истина;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры);
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = "Закрыть" Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтатусСоставителяПриИзменении(Элемент)
	
	Если ПустаяСтрока(СтатусСоставителя) Тогда
		СтатусСоставителя = "01";
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусСоставителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Список = СтатусыПлательщика();
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("СтатусСоставителяНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), Список, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусСоставителяНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ЭлементСписка = ВыбранныйЭлемент;
	Если ЭлементСписка <> Неопределено Тогда
		СтатусСоставителя = ЭлементСписка.Значение;
		СтатусСоставителяПриИзменении(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательОснованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Список = ОснованияПлатежа();
	
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ПоказательОснованияНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), Список, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательОснованияНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ЭлементСписка = ВыбранныйЭлемент;
	Если ЭлементСписка <> Неопределено Тогда
		ПоказательОснования = ЭлементСписка.Значение;
		СтатусСоставителяПриИзменении(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательДатыПриИзменении(Элемент)
	
	Если ПустаяСтрока(СтрЗаменить(ПоказательДаты, ".", "")) Тогда
		ПоказательДаты = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательТипаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Список = ТипыПлатежа();	
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ПоказательТипаНачалоВыбораЗавершение", ЭтотОбъект), Список, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательТипаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ЭлементСписка = ВыбранныйЭлемент;
	Если ЭлементСписка <> Неопределено Тогда
		ПоказательТипа = ЭлементСписка.Значение;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОчиститьСообщения();
	
	Если Не Модифицированность Или ТолькоПросмотр Тогда		
		Закрыть();	
	Иначе
		СтруктураОбъекта = Новый Структура;
		СтруктураОбъекта.Вставить("КодБК",                  КодБК);
		СтруктураОбъекта.Вставить("КодОКАТО",               КодОКАТО);
		СтруктураОбъекта.Вставить("ПоказательДаты",         ПоказательДаты);
		СтруктураОбъекта.Вставить("ПоказательНомера",       ПоказательНомера);
		СтруктураОбъекта.Вставить("ПоказательОснования",    ПоказательОснования);
		СтруктураОбъекта.Вставить("ПоказательПериода",      ПоказательПериода);
		СтруктураОбъекта.Вставить("ПоказательТипа",         ПоказательТипа);
		СтруктураОбъекта.Вставить("СтатусСоставителя",      СтатусСоставителя);
		
		Готово = Истина;
		
		Закрыть(СтруктураОбъекта);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция СтатусыПлательщика()
	
	Статусы = Новый Соответствие;
	
	Статусы.Вставить("01", НСтр("ru='01 - налогоплательщик (плательщик сборов) - юридическое лицо'"));
	Статусы.Вставить("02", НСтр("ru='02 - налоговый агент'"));
	Статусы.Вставить("03", НСтр("ru='03 - организация федеральной почтовой связи, составившая распоряжение по каждому платежу физического лица'"));
	Статусы.Вставить("04", НСтр("ru='04 - налоговый орган'"));
	Статусы.Вставить("05", НСтр("ru='05 - территориальные органы Федеральной службы судебных приставов'"));
	Статусы.Вставить("06", НСтр("ru='06 - участник внешнеэкономической деятельности - юридическое лицо'"));
	Статусы.Вставить("07", НСтр("ru='07 - таможенный орган'"));
	Статусы.Вставить("08", НСтр("ru='08 - юридическое лицо (индивидуальный предприниматель), уплачивающее страховые взносы и иные платежи'")); 
	Статусы.Вставить("09", НСтр("ru='09 - налогоплательщик (плательщик сборов) - ИП'"));
	Статусы.Вставить("10", НСтр("ru='10 - налогоплательщик (плательщик сборов) – нотариус, занимающийся частной практикой'")); 
	Статусы.Вставить("11", НСтр("ru='11 - налогоплательщик (плательщик сборов) - адвокат'")); 
	Статусы.Вставить("12", НСтр("ru='12 - налогоплательщик (плательщик сборов) - глава КФХ'")); 
	Статусы.Вставить("13", НСтр("ru='13 - налогоплательщик (плательщик сборов) - иное физическое лицо'")); 
	Статусы.Вставить("14", "14 - налогоплательщик, производящий выплаты физическим лицам");
	Статусы.Вставить("15", НСтр("ru='15 - кредитная организация (филиал кредитной организации), платежный агент, организация федеральной почтовой связи, составившие платежное поручение на общую сумму с реестром'"));
	Статусы.Вставить("16", НСтр("ru='16 - участник внешнеэкономической деятельности - физическое лицо'")); 
	Статусы.Вставить("17", НСтр("ru='17 - участник внешнеэкономической деятельности - ИП'")); 
	Статусы.Вставить("18", НСтр("ru='18 - плательщик таможенных платежей, не являющийся декларантом'")); 
	Статусы.Вставить("19", НСтр("ru='19 - организации, переводящие средства, удержанные из заработной платы на основании исполнительного документа'"));
	Статусы.Вставить("20", НСтр("ru='20 - кредитная организация (филиал кредитной организации), платежный агент, составившие распоряжение по каждому платежу физического лица'"));
	Статусы.Вставить("21", НСтр("ru='21 - ответственный участник консолидированной группы налогоплательщиков'"));
	Статусы.Вставить("22", НСтр("ru='22 - участник консолидированной группы налогоплательщиков'"));
	Статусы.Вставить("23", НСтр("ru='23 - органы контроля за уплатой страховых взносов'"));
	Статусы.Вставить("24", НСтр("ru='24 - физическое лицо, уплачивающее страховые взносы и иные платежи'"));
	Статусы.Вставить("25", НСтр("ru='25 - банки – гаранты, составившие распоряжение о переводе денежных средств в бюджетную систему Российской Федерации за плательщика суммы налога на добавленную стоимость, излишне полученной им (зачтенной ему) в результате возмещения налога на добавленную стоимость в заявительном порядке, а также по уплате акцизов, исчисленных по операциям реализации подакцизных товаров за пределы территории Российской Федерации, и акцизов в размере авансового платежа акцизов по алкогольной и (или) подакцизной спиртосодержащей продукции'"));
	Статусы.Вставить("26", НСтр("ru='26 - учредители (участники) должника, собственники имущества должника – унитарного предприятия или третьи лица, составившие распоряжение на погашение задолженности по обязательным платежам, включенным в реестр требований кредиторов, в ходе процедур, применяемых в деле о банкротстве'"));
			
	Список = Новый СписокЗначений;
	Для Каждого КлючИЗначение Из Статусы Цикл
		Список.Добавить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	Список.СортироватьПоЗначению();
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Функция ОснованияПлатежа()	
	ОснованияПлатежа = Новый СписокЗначений;
	
	ОснованияПлатежа.Добавить("ТП", НСтр("ru='ТП - платежи текущего года'"));
	ОснованияПлатежа.Добавить("ЗД", НСтр("ru='ЗД - добровольное погашение задолженности по истекшим налоговым периодам, расчетным (отчетным) периодам при отсутствии требования налогового органа об уплате налогов (сборов)'"));
	ОснованияПлатежа.Добавить("БФ", НСтр("ru='БФ - текущий платеж физического лица – клиента банка (владельца счета), уплачиваемые со своего банковского счета'"));	
	ОснованияПлатежа.Добавить("ТР", НСтр("ru='ТР - погашение задолженности по требованию налогового органа об уплате налогов (сборов)'"));
	
	ОснованияПлатежа.Добавить("РС", НСтр("ru='РС - погашение рассроченной задолженности'"));
	ОснованияПлатежа.Добавить("ОТ", НСтр("ru='ОТ - погашение отсроченной задолженности'"));
	ОснованияПлатежа.Добавить("РТ", НСтр("ru='РТ - погашение реструктурируемой задолженности'"));	
	ОснованияПлатежа.Добавить("ПБ", НСтр("ru='ПБ - погашение должником задолженности в ходе процедур, применяемых в деле о банкротстве'"));
	
	ОснованияПлатежа.Добавить("ПР", НСтр("ru='ПР - погашение задолженности, приостановленной к взысканию'"));
	ОснованияПлатежа.Добавить("АП", НСтр("ru='АП - погашение задолженности по акту проверки'"));
	ОснованияПлатежа.Добавить("АР", НСтр("ru='АР - погашение задолженности по исполнительному документу'"));
	ОснованияПлатежа.Добавить("ИН", НСтр("ru='ИН – погашение инвестиционного налогового кредита'"));
	
	ОснованияПлатежа.Добавить("ТЛ", НСтр("ru='ТЛ – погашение учредителем (участником) должника, собственником имущества должника – унитарного предприятия или третьим лицом задолженности в ходе процедур, применяемых в деле о банкротстве'"));
	ОснованияПлатежа.Добавить("ЗТ", НСтр("ru='ЗТ – погашение текущей задолженности в ходе процедур, применяемых в деле о банкротстве'"));
		
	ОснованияПлатежа.Добавить("0", НСтр("ru = '0 - значение не заполняется'"));
	
	Возврат ОснованияПлатежа;
	
КонецФункции

&НаКлиенте
Функция ТипыПлатежа() 
	
	ТипыПлатежа = Новый СписокЗначений;
	
	ТипыПлатежа.Добавить("0", НСтр("ru = '0 - все, кроме пени и процентов'"));
	ТипыПлатежа.Добавить("ПЕ", НСтр("ru = 'ПЕ - уплата пени'"));
	ТипыПлатежа.Добавить("ПЦ", НСтр("ru = 'ПЦ - уплата процентов'"));
	
	Возврат ТипыПлатежа;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗавершениеРаботы И Модифицированность И Не Готово Тогда		
		
		Отказ = Истина;
		
		ТекстПредупреждения = "Все измененные данные будут потеряны. Нажмите Продолжить, чтобы сохранить данные."
		
	ИначеЕсли Модифицированность И Не Готово Тогда	
		
		Отказ = Истина;
		
		СписокКнопок = Новый СписокЗначений();
		СписокКнопок.Добавить("Закрыть", НСтр("ru = 'Закрыть'"));
		СписокКнопок.Добавить("НеЗакрывать", НСтр("ru = 'Не закрывать'"));
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), 
			НСтр("ru = 'Все измененные данные будут потеряны. Закрыть форму?'"), 
			СписокКнопок);
		
	КонецЕсли;	

КонецПроцедуры
