
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщийМодульСервер.УстановитьВидимостьКомандыВывестиСписокВСпискахЛидов(ЭтаФорма); // №11556
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьКнопок()
	
	ЗапросВсего = Новый Запрос;
	ЗапросВсего.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лид.ТекущийСтатус,
	|	1 КАК Количество
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.Проведен";
	РезультатВсего = ЗапросВсего.Выполнить().Выгрузить();
	РезультатВсего.Свернуть("ТекущийСтатус","Количество");
	
	ЗапросСегодня = Новый Запрос;
	ЗапросСегодня.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лид.ТекущийСтатус,
	|	1 КАК Количество
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.Проведен
	|	И Лид.ПоследняяДатаПерезвонить < &Завтра";
	ЗапросСегодня.УстановитьПараметр("Завтра",НачалоДня(ТекущаяДатаСеанса()+60*60*24));
	РезультатСегодня = ЗапросСегодня.Выполнить().Выгрузить();
	РезультатСегодня.Свернуть("ТекущийСтатус","Количество");
	
	ЗапросВидыСтатусов = Новый Запрос;
	ЗапросВидыСтатусов.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЛида.ИмяПредопределенныхДанных,
	|	СтатусыЛида.Ссылка,
	|	СтатусыЛида.Наименование
	|ИЗ
	|	Справочник.СтатусыЛида КАК СтатусыЛида
	|ГДЕ
	|	НЕ СтатусыЛида.ПометкаУдаления";
	ВыборкаВидыСтатусов = ЗапросВидыСтатусов.Выполнить().Выбрать();
	
	Пока ВыборкаВидыСтатусов.Следующий() Цикл
		
		Сегодня = 0;
		НайденнаяСтрока = РезультатСегодня.Найти(ВыборкаВидыСтатусов.Ссылка,"ТекущийСтатус");
		Если НЕ НайденнаяСтрока = Неопределено Тогда
			Сегодня = НайденнаяСтрока.Количество;
		КонецЕсли;
		
		Всего = 0;
		НайденнаяСтрока = РезультатВсего.Найти(ВыборкаВидыСтатусов.Ссылка,"ТекущийСтатус");
		Если НЕ НайденнаяСтрока = Неопределено Тогда
			Всего = НайденнаяСтрока.Количество;
		КонецЕсли;
		
		ИскомыйЭлемент = Элементы.Найти("Фильтр_"+ВыборкаВидыСтатусов.ИмяПредопределенныхДанных);
		Если НЕ ИскомыйЭлемент = Неопределено Тогда
			ИскомыйЭлемент.Заголовок = ВыборкаВидыСтатусов.Наименование + Символы.ПС +"(" + Сегодня + "/" + Всего + ")";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписьКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	ОбновитьНадписьКнопок();
КонецПроцедуры

&НаКлиенте
Процедура КомандаФильтрНазначитьЗамер(Команда)
	
	Список.Отбор.Элементы.Очистить();
	
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
    ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ТекущийСтатус");
    ЭО.ПравоеЗначение=ПредопределенноеЗначение("Справочник.СтатусыЛида.НазначитьЗамер");
    ЭО.Использование=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомантаФильтрОтложенныйНазначитьЗамер(Команда)
	Список.Отбор.Элементы.Очистить();
	
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
    ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ТекущийСтатус");
    ЭО.ПравоеЗначение=ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер");
    ЭО.Использование=Истина;
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_ОтложенныйЗаключитьДоговор(Команда)
	Список.Отбор.Элементы.Очистить();
	
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
    ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ТекущийСтатус");
    ЭО.ПравоеЗначение=ПредопределенноеЗначение("Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор");
    ЭО.Использование=Истина;
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_ЗаполнитьДанныеЗамера(Команда)
	Список.Отбор.Элементы.Очистить();
	
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
    ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ТекущийСтатус");
    ЭО.ПравоеЗначение=ПредопределенноеЗначение("Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера");
    ЭО.Использование=Истина;
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_ОформитьДоговор(Команда)
	Список.Отбор.Элементы.Очистить();
	
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
    ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ТекущийСтатус");
    ЭО.ПравоеЗначение=ПредопределенноеЗначение("Справочник.СтатусыЛида.ОформитьДоговор");
    ЭО.Использование=Истина;
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_Отказ(Команда)
	Список.Отбор.Элементы.Очистить();
	
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
    ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ТекущийСтатус");
    ЭО.ПравоеЗначение=ПредопределенноеЗначение("Справочник.СтатусыЛида.Отказ");
    ЭО.Использование=Истина;
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_Все(Команда)
	Список.Отбор.Элементы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_НеЦелевые(Команда)
	Список.Отбор.Элементы.Очистить();
	
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
    ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ТекущийСтатус");
    ЭО.ПравоеЗначение=ПредопределенноеЗначение("Справочник.СтатусыЛида.НеЦелевой");
    ЭО.Использование=Истина;
КонецПроцедуры


