#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.Резервирование";
	КомандаПечати.Идентификатор = "Резервирование";
	КомандаПечати.Представление = НСтр("ru = 'Резервирование'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
    
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Резервирование") Тогда
	    УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"Резервирование", 
			НСтр("ru = 'Резервирование'"), 
			СформироватьПечатнуюФормуРезервирование(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьПечатнуюФормуРезервирование(МассивОбъектов, ОбъектыПечати) 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Резервирование";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Резервирование.ПФ_MXL_Резервирование");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Резервирование.Ссылка,
	|	Резервирование.Автор,
	|	Резервирование.Дата,
	|	Резервирование.ДокументРезерва,
	|	Резервирование.Комментарий,
	|	Резервирование.Контрагент,
	|	Резервирование.Номер,
	|	Резервирование.Организация,
	|	Резервирование.Склад,
	|	Резервирование.Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		СерияНоменклатуры,
	|		ЕдиницаИзмерения,
	|		Количество,
	|		Коэффициент,
	|		ВидТабличнойЧасти
	|	)
	|ИЗ
	|	Документ.Резервирование КАК Резервирование
	|ГДЕ
	|	Резервирование.Ссылка В (&МассивОбъектов)";
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	
	ПервыйДокумент = Истина;	
   	Пока Выборка.Следующий() Цикл

        Если Не ПервыйДокумент Тогда
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;		
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер);
		Попытка
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовок.Параметры.Заполнить(Выборка);
			ОбластьЗаголовок.Параметры.Номер = НомерДокумента;
			ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD");
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		Исключение
		КонецПопытки;
		
		ОбластьШапка.Параметры.Заполнить(Выборка);		
		ТабличныйДокумент.Вывести(ОбластьШапка);

		ТабличныйДокумент.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабличныйДокумент.Вывести(ОбластьТовары);
		КонецЦикла;

		Попытка
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ОбластьПодвал.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьПодвал);
		Исключение
		КонецПопытки;
		
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
		
    Возврат ТабличныйДокумент;
	
КонецФункции    

#КонецОбласти
	
#Область СозданиеНаОсновании

// Добавляет команду создания документа "Резервирование"
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.Резервирование) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.Резервирование.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.Резервирование.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьРезервирование";	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Добавляет команду создания документа "Резервирование" для монтажа / заказ-договора
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОснованииДокументаРозницы(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.Резервирование) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.РезервированиеСоздатьНаОснованииДокументаРозницы";
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.Резервирование.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";		
		КомандаСоздатьНаОсновании.МножественныйВыбор = Ложь;
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьРезервирование";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли

Функция ПолучитьСписокТоваровКЗаполнению(ДанныеЗаполнения, ТекущийДокумент = Неопределено) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда	
		ВТ_Товары = ДанныеЗаполнения.Товары.Выгрузить();
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		ВТ_Товары = ДанныеЗаполнения.ТоварыУслуги.Выгрузить();
	//#13982
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ВТ_Товары = ДанныеЗаполнения.ТоварыУслуги.Выгрузить();
	КонецЕсли;
	
	//++ №12337 убираем услуги
	КоличествоСтрок = ВТ_Товары.Количество()-1;
	Для Сч = 0 По КоличествоСтрок Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ВТ_Товары[КоличествоСтрок - Сч].Номенклатура) Тогда
			ВТ_Товары.Удалить(КоличествоСтрок - Сч);
		КонецЕсли;
	КонецЦикла;
	//-- №12337
	
	//nva+++
	КоличествоСтрок = ВТ_Товары.Количество()-1;
	Для Сч = 0 По КоличествоСтрок Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ВТ_Товары[КоличествоСтрок - Сч].Номенклатура) Тогда
			ВТ_Товары.Удалить(КоличествоСтрок - Сч);
		КонецЕсли;
	КонецЦикла;
	//nva---
	
	ВТ_Товары.Колонки.Добавить("ВидТабличнойЧасти", новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
	ВТ_Товары.ЗаполнитьЗначения(Перечисления.ВидыТабличнойЧасти.Товары, "ВидТабличнойЧасти");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор")	
		Тогда
		
		Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Материалы Цикл
			
			//++ №12337 убираем услуги
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			//-- №12337
			
			НоваяСтрока = ВТ_Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ВидТабличнойЧасти = Перечисления.ВидыТабличнойЧасти.Материалы;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Вычитать будем из документов резервирования + снятие с резервов (а не из регистра), т.к. в документе по единице измерения
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезервированиеТовары.Номенклатура,
	|	РезервированиеТовары.ХарактеристикаНоменклатуры,
	|	РезервированиеТовары.СерияНоменклатуры,
	|	РезервированиеТовары.ЕдиницаИзмерения,
	|	РезервированиеТовары.ВидТабличнойЧасти,
	|	СУММА(РезервированиеТовары.Количество)
	|ПОМЕСТИТЬ ВТ_РезервированиеТовары
	|ИЗ
	|   Документ.Резервирование.Товары КАК РезервированиеТовары
	|ГДЕ
	|   РезервированиеТовары.Ссылка.Проведен
	|	И РезервированиеТовары.Ссылка.ДокументРезерва = &ДокументРезерва
	|	И НЕ РезервированиеТовары.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	РезервированиеТовары.Номенклатура,
	|	РезервированиеТовары.ХарактеристикаНоменклатуры,
	|	РезервированиеТовары.СерияНоменклатуры,
	|	РезервированиеТовары.ЕдиницаИзмерения,
	|	РезервированиеТовары.ВидТабличнойЧасти
	|;
	|///////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СнятиеРезервовТовары.Номенклатура,
	|	СнятиеРезервовТовары.ХарактеристикаНоменклатуры,
	|	СнятиеРезервовТовары.СерияНоменклатуры,
	|	СнятиеРезервовТовары.ЕдиницаИзмерения,
	|	СнятиеРезервовТовары.ВидТабличнойЧасти,
	|	СУММА(СнятиеРезервовТовары.Количество)
	|ПОМЕСТИТЬ ВТ_СнятиеРезервовТовары
	|ИЗ
	|   Документ.СнятиеРезервов.Товары КАК СнятиеРезервовТовары
	|ГДЕ
	|   СнятиеРезервовТовары.Ссылка.Проведен
	|	И СнятиеРезервовТовары.ДокументРезерва = &ДокументРезерва
	|
	|СГРУППИРОВАТЬ ПО
	|	СнятиеРезервовТовары.Номенклатура,
	|	СнятиеРезервовТовары.ХарактеристикаНоменклатуры,
	|	СнятиеРезервовТовары.СерияНоменклатуры,
	|	СнятиеРезервовТовары.ЕдиницаИзмерения,
	|	СнятиеРезервовТовары.ВидТабличнойЧасти
	|;
	|///////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезервированиеТовары.Номенклатура,
	|	РезервированиеТовары.ХарактеристикаНоменклатуры,
	|	РезервированиеТовары.СерияНоменклатуры,
	|	РезервированиеТовары.ЕдиницаИзмерения,
	|	РезервированиеТовары.ВидТабличнойЧасти,
	|	ЕСТЬNULL(РезервированиеТовары.Количество, 0) - ЕСТЬNULL(СнятиеРезервовТовары.Количество, 0) КАК Количество
	|ИЗ
	|   ВТ_РезервированиеТовары КАК РезервированиеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СнятиеРезервовТовары КАК СнятиеРезервовТовары
	|		ПО РезервированиеТовары.Номенклатура = СнятиеРезервовТовары.Номенклатура 
	|			И РезервированиеТовары.ХарактеристикаНоменклатуры = СнятиеРезервовТовары.ХарактеристикаНоменклатуры
	|			И РезервированиеТовары.СерияНоменклатуры = СнятиеРезервовТовары.СерияНоменклатуры
	|			И РезервированиеТовары.ЕдиницаИзмерения = СнятиеРезервовТовары.ЕдиницаИзмерения
	|			И РезервированиеТовары.ВидТабличнойЧасти = СнятиеРезервовТовары.ВидТабличнойЧасти
	|
	|";
	Запрос.УстановитьПараметр("ДокументРезерва", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	РезервированныеПозиции = Запрос.Выполнить().Выгрузить();
	
	СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, ВидТабличнойЧасти");
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ВидТабличнойЧасти");	
	КонецЕсли;
	
	// Вычтем количество уже зарезервированных
	Для Каждого ТекущаяСтрока Из ВТ_Товары Цикл
		
		// Найдем позицию
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
		НайденнаяПозиция = РезервированныеПозиции.НайтиСтроки(СтруктураПоиска);			
		Если НайденнаяПозиция.Количество() > 0 Тогда
			// Мин() используется на всякий случай, если вдруг вычеталось минусовое количество
			НовоеКоличество = Мин(ТекущаяСтрока.Количество - НайденнаяПозиция[0].Количество, ТекущаяСтрока.Количество);
			ТекущаяСтрока.Количество = НовоеКоличество;
		КонецЕсли;
		
	КонецЦикла;
	
	// Уберем позиции, которые меньше или равны 0
	КоличествоСтрок = ВТ_Товары.Количество()-1;
	Для Сч = 0 По КоличествоСтрок Цикл
		Если ВТ_Товары[КоличествоСтрок - Сч].Количество <=0 Тогда
			ВТ_Товары.Удалить(КоличествоСтрок - Сч);
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат ВТ_Товары;
	
КонецФункции