#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Процедура заполняет справочник по умолчанию
//
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	СпрОбъект = Справочники.ПорядокЗаполненияПолейЛида.ИмяКлиента.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 10;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ПорядокЗаполненияПолейЛида.ТелефонКлиента.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 20;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ПорядокЗаполненияПолейЛида.ВидКонтакта.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 30;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ПорядокЗаполненияПолейЛида.РекламнаяАкция.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 40;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ПорядокЗаполненияПолейЛида.РекламныйИсточник.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 50;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ПорядокЗаполненияПолейЛида.ТочкаПродаж.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 60;
	СпрОбъект.Записать();	
	
	СпрОбъект = Справочники.ПорядокЗаполненияПолейЛида.Организация.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 70;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ПорядокЗаполненияПолейЛида.Подразделение.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 80;
	СпрОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли