Функция НайтиПоНаименованиюИШирине(Материал, ШиринаПолотна) Экспорт
	
	Результат = Справочники.Фактура.ПустаяСсылка();
	
	Если ТипЗнч(ШиринаПолотна) = Тип("Строка") Тогда
		Попытка
			ШиринаПолотнаЧислом = Число(ШиринаПолотна);
		Исключение
			Возврат Результат;
		КонецПопытки;
	Иначе
		ШиринаПолотнаЧислом = ШиринаПолотна;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фактура.Ссылка
		|ИЗ
		|	Справочник.Фактура КАК Фактура
		|ГДЕ
		|	НЕ Фактура.ЭтоГруппа
		|	И Фактура.Материал ПОДОБНО &Материал
		|	И Фактура.ШиринаПолотна = &ШиринаПолотна";
	
	Запрос.УстановитьПараметр("Материал", Материал);
	Запрос.УстановитьПараметр("ШиринаПолотна", ШиринаПолотнаЧислом);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
