#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("Сотрудник, ОграничениеДоступаКЛидамДляЗамерщика, 
												|ОтображатьТолькоСвоиЛидыВСписке, ОткрыватьСписокЛидовСОтборомПоОтветственному,
												|ЧастотаАвтоматическогоОбновленияСписковВАРМРозницы", ТекущийПользователь);
	
	//++ #12503
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗамерыВыезды, "СотрудникЗамерщик",  РеквизитыПользователя.Сотрудник);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗамерыВыезды, "ИспользоватьОтборПоСотруднику",  РеквизитыПользователя.ОграничениеДоступаКЛидамДляЗамерщика);
	Элементы.ЗамерыВыездыФильтрПоказыватьЗамеры.Пометка = Истина;
	Элементы.ЗамерыВыездыФильтрПоказыватьВыезды.Пометка = Истина;
	УстановитьОтборВыездовЗамеров();
	//-- #12503
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗаказДоговоры, "ПустойИдентификатор",  ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый ОписаниеТипов("ДокументСсылка.ЗаказДоговор");
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ФормаКоманднаяПанель;
	ПараметрыРазмещения.ПрефиксГрупп = "ЗаказДоговорыРМ"; 	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);

	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый ОписаниеТипов("ДокументСсылка.Монтаж");
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ФормаКоманднаяПанель;
	ПараметрыРазмещения.ПрефиксГрупп = "МонтажиРМ"; 	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаСписка(ЭтотОбъект, Элементы.ЗаказДоговоры);
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаСписка(ЭтотОбъект, Элементы.Монтажи);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	Если РеквизитыПользователя.ОтображатьТолькоСвоиЛидыВСписке Тогда
		Элементы.ЛидОтборПоАвтору.Видимость = Ложь;
	Иначе
		Если РеквизитыПользователя.ОткрыватьСписокЛидовСОтборомПоОтветственному Тогда
			ЛидОтборПоАвтору = ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;
	Если ПараметрыСеанса.ЗапретитьСниматьОтборПоОтветственномуВСпискеЛидов Тогда
		Элементы.ЛидОтборПоАвтору.Доступность = Ложь;
	КонецЕсли;
	
	//++ №7938 видимость вкладок по правам первоначальная
	Элементы.ГруппаПисьма.Видимость 				= ПравоДоступа("Просмотр", Метаданные.Документы.ЭлектронноеПисьмо);
	Элементы.ГруппаЛиды.Видимость 					= ПравоДоступа("Просмотр", Метаданные.Документы.Лид);
	Элементы.ГруппаДоговоры.Видимость 				= ПравоДоступа("Просмотр", Метаданные.Документы.ЗаказДоговор);
	Элементы.ГруппаМонтажи.Видимость 				= ПравоДоступа("Просмотр", Метаданные.Документы.Монтаж);
	//Элементы.ГруппаСервисныеЗаявки.Видимость 		= ПравоДоступа("Просмотр", Метаданные.Документы.Монтаж);
	Элементы.ГруппаПоступленияПотолков.Видимость 	= ПравоДоступа("Просмотр", Метаданные.Документы.ПоступлениеТоваровИУслуг);
	//-- №7938
	
	//#16875
	СоответствиеКнопок = Новый Соответствие;
	СоответствиеКнопок.Вставить("ГруппаЭлементовНовыйЛид", 				"НазначитьЗамер");
	СоответствиеКнопок.Вставить("ГруппаЭлементовРасчетДоЗамера", 		"РасчетДоЗамера");    
	СоответствиеКнопок.Вставить("ГруппаЭлементовЗамерыВыезды", 			"ЗаполнитьДанныеЗамера");
	СоответствиеКнопок.Вставить("ГруппаЭлементовОтложенныйЗамер", 		"ОтложенныйНазначитьЗамер");
	СоответствиеКнопок.Вставить("ГруппаЭлементовОтложенныйДоговор", 	"ОтложенныйЗаключитьДоговор");	
	СоответствиеКнопок.Вставить("ГруппаЭлементовОбработкаПослеЗамера", 	"ОбработкаПослеЗамера");
	СоответствиеКнопок.Вставить("ГруппаЭлементовОформитьДоговор", 		"ОформитьДоговор");
	СоответствиеКнопок.Вставить("ГруппаЭлементовДоговорОформлен", 		"ДоговорОформлен");
	СоответствиеКнопок.Вставить("ГруппаЭлементовОбращение", 			"Обращение");
	СоответствиеКнопок.Вставить("ГруппаЭлементовОтказные", 				"Отказ");
	СоответствиеКнопок.Вставить("ГруппаЭлементовНецелевые", 			"НеЦелевой");
	Для каждого КлючЗначение из СоответствиеКнопок Цикл		
		Элементы[КлючЗначение.Ключ].Видимость = Справочники.СтатусыЛида[КлючЗначение.Значение].Использовать;
	КонецЦикла;

	//#15605
	Элементы.ЛидОтборПоПодразделению.Видимость = Константы.ИспользоватьПодразделения.Получить();
	
	// отборы по заказ-договорам
	СписокЗаказДоговоровТекстЗапроса = ЗаказДоговоры.ТекстЗапроса;
	ЗаказДоговорОтборПоОплате = -9;
	ЗаказДоговорОтборПоПозициямВМонтажах = -9;
	ЗаказДоговорОтборПоВыполнениюМонтажей = -9;
	ЗаказДоговорОтборПоСтатусуПроизводства = -9;
	ЗаказДоговорОтборПоСтатусуЗакупки = -9;
	УстановитьОтборЗаказДоговоров();
	
	// отборы по монтажам
	СписокМонтажейТекстЗапроса = Монтажи.ТекстЗапроса;
	МонтажиОтборПоСтатусуПроизводства = -9;
	МонтажиОтборПоСтатусуЗакупки = -9;
	МонтажиОтборПоВыдачеМатериалов = -9;
	УстановитьОтборМонтажей();
	
	ДоговорыОтбиратьПоСтатусу = Истина;
	ДоговорыОтборПоСтатусуТекущийСтатус = Справочники.СтатусыЗаказДоговоров.ВРаботе;
	ДобавитьФильтрЛидовПоОграничениям();
	
	УстановитьПараметрПоЛидам();
	УстановитьВидимостьПоляПросроченДляЛидов(Константы.КонтролироватьВремяРеакцииПоЛидам.Получить());
	
	Если РольДоступна("ВКонтакте") или ОбщийМодуль.ЕстьПраваАдминистратора() Тогда
		Объект.access_token = Константы.ВКонтакте_access_token.Получить();
	КонецЕсли;
	Элементы.ВКонтакте_ОпубликоватьЗаписьНаСтене.Доступность = НЕ ПустаяСтрока(Объект.access_token);
		
	//Элементы.ГруппаНастройкиИстории.Доступность = ПользователюРазрешеноИспользованиеIPТелефонии();
	
	//++ №5011 комментируем, т.к. звонки теперь в отделной общей форме "ЖурналЗвонков"
	//Элементы.ГруппаЗвонки.Видимость = СофтФон.ТекущемуПользователюРазрешеноИспользованиеIPТелефонии()
	//                                  И НЕ ПараметрыСеанса.ТекущийПользователь.НеОтображатьВкладкуЗвонкиВАРМ; //#5171 (персональная)
	//-- №5011
	
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыНовые;
	
	ИспользуетсяПолучениеЛидов = РаботаСЭлектроннойПочтой.ЕстьЭлектронныеЯщикиавтоматическогоСозданияЛидов()
								ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьОбменСБитрикс24"); // #16453
	Элементы.КомандаПолучитьНовыеЛиды.Видимость = ИспользуетсяПолучениеЛидов;
	
	Элементы.ГруппаПоступленияПотолков.Видимость = (Константы.РучнойЗапускОбработкиСозданияДокументовПоступленийПотолковВРозницеОтПроизводства.Получить()
	                                               //#7381
											  	   ИЛИ Константы.РучнойЗапускОбработкиСозданияДокументовПоступленийПоРучнымЗаказам.Получить()
												   //#10822
	                                               ИЛИ  Константы.РучнойЗапускОбработкиСозданияДокументовПоступленийПоУдаленнойБазе.Получить())
												   И Элементы.ГруппаПоступленияПотолков.Видимость; //++ №7938 если первоначально вкладка включена
	
	Элементы.ГруппаПисьма.Видимость = Константы.СоздаватьВходящиеКонтактыПоВходящимЭлектроннымПисьмам.Получить()
		И Элементы.ГруппаПисьма.Видимость; //++ №7938 если первоначально вкладка включена
	
	//ТолькоИсториюЗвонков = Параметры.ТолькоИсториюЗвонков;	
	
	// видимость элементов отбора по заказ-договорам
	Элементы.ЗаказДоговорОтборПоПодразделению.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	ОбеспеченностьРозницыПоЗаказДоговорам = ПолучитьФункциональнуюОпцию("ОбеспеченностьРозницыПоЗаказДоговорам");
	Элементы.ЗаказДоговорыСтатусЗаказаРозницыНаПроизводство.Видимость = ОбеспеченностьРозницыПоЗаказДоговорам;
	Элементы.ЗаказДоговорыСтатусЗаказаРозницыПоставщикам.Видимость    = ОбеспеченностьРозницыПоЗаказДоговорам;
	Элементы.ЗаказДоговорОтборПоСтатусуПроизводства.Видимость    	  = ОбеспеченностьРозницыПоЗаказДоговорам;  //#16544
	Элементы.ЗаказДоговорОтборПоСтатусуЗакупки.Видимость    		  = ОбеспеченностьРозницыПоЗаказДоговорам;  //#16544
	
	// видимость элементов отбора по монтажам
	Если Элементы.ГруппаМонтажи.Видимость Тогда //++ №7938
		ИспользоватьСтатусЗакрытВМонтаже = Константы.ИспользоватьСтатусЗакрытВМонтаже.Получить();
		Элементы.МонтажиДатаЗакрытия.Видимость = ИспользоватьСтатусЗакрытВМонтаже;
		Элементы.МонтажиОтборПериодЗакрытия.Видимость = ИспользоватьСтатусЗакрытВМонтаже;      //++ 16027
		
		Элементы.МонтажиОтборПоПодразделению.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");  //++ 16027
		
		ОбеспеченностьРозницыПоМонтажам = ПолучитьФункциональнуюОпцию("ОбеспеченностьРозницыПоМонтажам");
		Элементы.МонтажиСтатусЗаказаРозницыНаПроизводство.Видимость = ОбеспеченностьРозницыПоМонтажам;
		Элементы.МонтажиСтатусЗаказаРозницыПоставщикам.Видимость    = ОбеспеченностьРозницыПоМонтажам;
		Элементы.МонтажиОтборПоСтатусуПроизводства.Видимость    	= ОбеспеченностьРозницыПоМонтажам;  //#16544 
		Элементы.МонтажиОтборПоСтатусуЗакупки.Видимость    		    = ОбеспеченностьРозницыПоМонтажам;  //#16544				
	КонецЕсли;
	
	//#7414
	Если Элементы.ГруппаПисьма.Видимость Тогда
		ОбновитьЭлементыСостоянияПолученияПисемНаСервере(); 
	КонецЕсли;
	
	//++ №9919
	ИспользоватьНачислениеЗаработнойПлатыНаОснованииМонтажа = ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗаработнойПлатыНаОснованииМонтажа");
	//Если ПравоДоступа("Изменение", Метаданные.Документы.НачислениеЗарплаты) Тогда // проверка для типовой команды
	//	
	//	Элементы.МонтажиДокументНачислениеЗарплатыСоздатьНаОсновании.Видимость = ИспользоватьНачислениеЗаработнойПлатыНаОснованииМонтажа;
	//	//Элементы.СервисныеЗаявкиДокументНачислениеЗарплатыСоздатьНаОсновании.Видимость = ИспользоватьНачислениеЗаработнойПлатыНаОснованииМонтажа;
	//	
	//КонецЕсли;
	
	Элементы.МонтажиИндикацияНачисленияЗарплаты.Видимость = ИспользоватьНачислениеЗаработнойПлатыНаОснованииМонтажа;
	//-- №9919
	
	ОбщийМодульСервер.УстановитьВидимостьКомандыВывестиСписокВСпискахЛидов(ЭтаФорма, Истина); // №11556
	
	// №13388
	ОбщийМодульСервер.УстановитьПериодАвтоОбновленияДляВсехДинамическихСписков(ЭтаФорма, РеквизитыПользователя.ЧастотаАвтоматическогоОбновленияСписковВАРМРозницы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	//Если ТолькоИсториюЗвонков Тогда
	//	Элементы.ФормаОбновитьСписок.Видимость = Ложь;
	//	Для Каждого ТекущаяСтрока Из Элементы Цикл
	//		Если ТипЗнч(ТекущаяСтрока) = Тип("ГруппаФормы")
	//			И Врег(Лев(ТекущаяСтрока.Имя, 6)) = "ГРУППА"
	//			И ТекущаяСтрока.Имя <> "ГруппаЗвонки"
	//			И ТекущаяСтрока.Имя <> "ГруппаСтраницы"
	//			Тогда	
	//			ТекущаяСтрока.Видимость = Ложь;
	//		КонецЕсли;	
	//	КонецЦикла;
	//	ЭтаФорма.АвтоЗаголовок = Ложь;
	//	ЭтаФорма.Заголовок = "История звонков АТС";
	//КонецЕсли;
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ГруппаСтраницыПриСменеСтраницы(Неопределено, Элементы.ГруппаСтраницы.ТекущаяСтраница);
	
	//УстановкаФильтраЗаказДоговоры();
	//УстановкаФильтраСервисныеЗаявки();
	//ОбновитьНадписиКнопокНаКлиенте();  //#16089 закомментировано
	Фильтр_НазначитьЗамер(Неопределено);
	//Фильтр_Договоры_Все(Неопределено);
	
	ПодключитьОбработчикОжидания("ПроверкаПросроченныхЛидов", 600, Ложь); 
	//ПодключитьОбработчикОжидания("ОбновитьНадписиКнопокНаКлиенте", 60, Ложь);  //каждую минуту //#16089 закомментировано
	Если Элементы.ГруппаПисьма.Видимость Тогда
		ПодключитьОбработчикОжидания("ОбновитьЭлементыСостоянияПолученияПисем", 60, Ложь); //#7414 //каждую минуту
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Объект.access_token) Тогда
		ПолучитьСписокБесед();
		ПодключитьОбработчикОжидания("ПолучитьСписокБесед", 15);
		Элементы.ГруппаВКонтакте.Видимость = Истина;
	Иначе
		Элементы.ГруппаВКонтакте.Видимость = Ложь;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПроверитьНеобходимостьОбновленияСпискаЛидов", 60); //каждую минуту уточняем, были ли созданы новые лиды (при парсинге почты или разборе истории звонков)
	Оповестить("ПолучитьКоличествоЛидовПринудительно"); //#16089
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник="Лид" Тогда
		//Если ИмяСобытия = "ЗапроситьИсториюЗвонков" Тогда 
		//	ИсторияДатаНачала = Параметр.ИсторияДатаНачала;
		//	ИсторияДатаОкончания = Параметр.ИсторияДатаОкончания;
		//	ИсторияОтборПоНомеру = Параметр.ИсторияОтборПоНомеру;
		//	//ПолучитьИсториюЗвонков(Неопределено);
		//	УстановкаФильтраИсторияЗвонковАТС();
		//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЗвонки;
		//КонецЕсли;
		
	ИначеЕсли Врег(ИмяСобытия) = Врег("Запись_Лид") Тогда
		ОбновитьСпискиРМ(Истина);
		
	ИначеЕсли ИмяСобытия = "ЗакрытаФормаЗаказДоговора" И Источник = "ЗаказДоговор" Тогда
		Элементы.ЗаказДоговоры.Обновить();
		
	ИначеЕсли ИмяСобытия = "ЗакрытаФормаМонтажа" и Источник = "Монтаж" Тогда
		Элементы.ЗаказДоговоры.Обновить();
		
	ИначеЕсли ИмяСобытия = "Запись_ДокументОплаты" Тогда
		Элементы.ЗаказДоговоры.Обновить();
		Элементы.Монтажи.Обновить();
		
	ИначеЕсли ИмяСобытия = "ОбновитьАРМРозницы" Тогда		
		Если Источник = "ЗаказДоговор"
			ИЛИ Источник = "Монтаж" Тогда
			Элементы.ЗаказДоговоры.Обновить();
		КонецЕсли;

	//#16089
	ИначеЕсли ИмяСобытия = "ОбновитьКнопкиАРМРозницы" Тогда		
		ПредставлениеСчетчикаНовыйЛид 				= СтрШаблон("%1/%2", Формат(Параметр.ЛидыНовыеВРаботе, "ЧН=0; ЧГ=0"), Формат(Параметр.ЛидыНовыеВсего, "ЧН=0; ЧГ=0"));
		ПредставлениеСчетчикаРасчетДоЗамера 		= СтрШаблон("%1/%2", Формат(Параметр.ЛидыРасчетДоЗамераВРаботе, "ЧН=0; ЧГ=0"), Формат(Параметр.ЛидыРасчетДоЗамераВсего, "ЧН=0; ЧГ=0"));   //#16875
		ПредставлениеСчетчикаЗаявкаНаЗамер 			= СтрШаблон("%1/%2", Формат(Параметр.ЛидыЗаявкаНаЗамерВРаботе, "ЧН=0; ЧГ=0"), Формат(Параметр.ЛидыЗаявкаНаЗамерВсего, "ЧН=0; ЧГ=0"));
		ПредставлениеСчетчикаОтложенныйЗамер 		= СтрШаблон("%1/%2", Формат(Параметр.ЛидыОтложенныеЗамерыВРаботе, "ЧН=0; ЧГ=0"), Формат(Параметр.ЛидыОтложенныеЗамерыВсего, "ЧН=0; ЧГ=0")); 
		ПредставлениеСчетчикаОтложенныйДоговор 		= СтрШаблон("%1/%2", Формат(Параметр.ЛидыОтложенныеДоговорыВРаботе, "ЧН=0; ЧГ=0"), Формат(Параметр.ЛидыОтложенныеДоговорыВсего, "ЧН=0; ЧГ=0"));
		ПредставлениеСчетчикаОбработкаПослеЗамера 	= СтрШаблон("%1/%2", Формат(Параметр.ЛидыОбработкаПослеЗамераВРаботе, "ЧН=0; ЧГ=0"), Формат(Параметр.ЛидыОбработкаПослеЗамераВсего, "ЧН=0; ЧГ=0"));  //#16875
		ПредставлениеСчетчикаОформитьДоговор 		= СтрШаблон("%1", Формат(Параметр.ЛидыОформитьДоговорВсего, "ЧН=0; ЧГ=0"));
		ПредставлениеСчетчикаДоговорОформлен 		= СтрШаблон("%1", Формат(Параметр.ЛидыДоговорОформленВсего, "ЧН=0; ЧГ=0"));
		ПредставлениеСчетчикаОбращения 				= СтрШаблон("%1/%2", Формат(Параметр.ЛидыОбращениеВРаботе, "ЧН=0; ЧГ=0"), Формат(Параметр.ЛидыОбращениеВсего, "ЧН=0; ЧГ=0")); 
		ПредставлениеСчетчикаОтказные 				= СтрШаблон("%1", Формат(Параметр.ЛидыОтказныеВсего, "ЧН=0; ЧГ=0")); 
		ПредставлениеСчетчикаНецелевые 				= СтрШаблон("%1", Формат(Параметр.ЛидыНецелевыеВсего, "ЧН=0; ЧГ=0"));
		ПредставлениеСчетчикаВсеЛиды 				= СтрШаблон("%1", Формат(Параметр.ЛидыВсеВсего, "ЧН=0; ЧГ=0"));

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаСписка(ИмяСобытия, ЭтотОбъект, Элементы.ЗаказДоговоры);
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаСписка(ИмяСобытия, ЭтотОбъект, Элементы.Монтажи);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОбновитьСпискиРМ();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСпискиРМ(ТолькоЛиды = Ложь)
 
	УстановитьПараметрПоЛидам();
	
	//**16055
	//Элементы.Лиды.Обновить();
	//Элементы.ЛидыНовые.Обновить();
	//Элементы.ЛидыОтказные.Обновить();
	//Элементы.ЛидыОтложенныеЗамер.Обновить();
	//Элементы.ЛидыОформитьДоговор.Обновить();
	//Элементы.ЛидыДоговорОформлен.Обновить();
	//Элементы.ЛидыНецелевые.Обновить();
	//Элементы.ЛидыОтложенныеДоговоры.Обновить();
	//Элементы.ЛидыЗаявкаНаЗамер.Обновить();
	Если Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыНовые Тогда
		Элементы.ЛидыНовые.Обновить();
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаРасчетДоЗамера Тогда
		Элементы.ЛидыРасчетДоЗамера.Обновить();
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаОтложенныеЗамер Тогда
		Элементы.ЛидыОтложенныеЗамер.Обновить();
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыЗаявкаНаЗамер Тогда
		Элементы.ЛидыЗаявкаНаЗамер.Обновить();	
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыОтложенныйДоговор Тогда
		Элементы.ЛидыОтложенныеДоговоры.Обновить();
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаОбработкаПослеЗамера Тогда
		Элементы.ЛидыОбработкаПослеЗамера.Обновить();
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыОформитьДоговор Тогда
		Элементы.ЛидыОформитьДоговор.Обновить();
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыДоговорОформлен Тогда
		Элементы.ЛидыДоговорОформлен.Обновить();
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыОбращение Тогда
		Элементы.ЛидыОбращение.Обновить();
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыОтказные Тогда
		Элементы.ЛидыОтказные.Обновить();
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыНецелевые Тогда
		Элементы.ЛидыНецелевые.Обновить();
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыВсе Тогда
		Элементы.Лиды.Обновить();
	КонецЕсли;
	//**16055
	
	//ОбновитьНадписиКнопокНаКлиенте(); //#16089 закомментировано
	
	Если ТолькоЛиды Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ЗаказДоговоры.Обновить();
	Элементы.Монтажи.Обновить();
	Элементы.Поступления.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыЛидыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыНовые Тогда
		ВыделитьКнопкуФильтраЛида("Фильтр_НазначитьЗамер");
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаОтложенныеЗамер Тогда
		ВыделитьКнопкуФильтраЛида("Фильтр_ОтложенныйНазначитьЗамер");
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыЗаявкаНаЗамер Тогда
		ВыделитьКнопкуФильтраЛида("Фильтр_ЗаполнитьДанныеЗамера");
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыОтложенныйДоговор Тогда
		ВыделитьКнопкуФильтраЛида("Фильтр_ОтложенныйЗаключитьДоговор");
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыОформитьДоговор Тогда
		ВыделитьКнопкуФильтраЛида("Фильтр_ОформитьДоговор");
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыДоговорОформлен Тогда
		ВыделитьКнопкуФильтраЛида("Фильтр_ДоговорОформлен");
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыОтказные Тогда
		ВыделитьКнопкуФильтраЛида("Фильтр_Отказ");
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыНецелевые Тогда
		ВыделитьКнопкуФильтраЛида("Фильтр_НеЦелевой");
	ИначеЕсли Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыВсе Тогда
		ВыделитьКнопкуФильтраЛида("Фильтр_Все");
	КонецЕсли;
	
	ОбновитьСпискиРМ(Истина); //++ 16055
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПроверкуРекламныхЭлектронныхЯщиков(Команда)
	
	Сообщение = "";
	Идентификатор = "";		
	РаботаСЭлектроннойПочтой.ЗапуститьФоновоеЗаданиеПроверитьРекламныеЭлектронныеЯщики(Сообщение, Идентификатор);
	Если НЕ ПустаяСтрока(Сообщение) Тогда
		ПоказатьПредупреждение(, Сообщение);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	//ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДоговоры Тогда
		Список = Элементы.ЗаказДоговоры;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаМонтажи Тогда
		Список = Элементы.Монтажи;
	КонецЕсли;
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Список);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	//ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Нет отбора по оплатам";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоОплате");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоОплате");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -9;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Нет отбора по позициям заказа в монтажах";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоПозициямВМонтажах");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоПозициямВМонтажах");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -9;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Нет отбора по выполнению монтажей";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоВыполнениюМонтажей");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоВыполнениюМонтажей");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -9;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Нет отбора по производству заказов клиентов";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоСтатусуПроизводства");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоСтатусуПроизводства");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -9;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Нет отбора по закупкам заказов клиентов";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоСтатусуЗакупки");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказДоговорОтборПоСтатусуЗакупки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -9;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Нет отбора по производству реализаций клиентам";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("МонтажиОтборПоСтатусуПроизводства");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МонтажиОтборПоСтатусуПроизводства");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -9;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Нет отбора по закупкам реализаций клиентам";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("МонтажиОтборПоСтатусуЗакупки");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МонтажиОтборПоСтатусуЗакупки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -9;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Нет отбора по выдачам по реализациям клиентам";
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("МонтажиОтборПоВыдачеМатериалов");
			
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МонтажиОтборПоВыдачеМатериалов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -9;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрПоЛидам()
	
	Лиды.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЛидыНовые.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЛидыРасчетДоЗамера.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЛидыОтказные.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЛидыОтложенныеЗамер.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЛидыОбработкаПослеЗамера.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЛидыОформитьДоговор.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЛидыДоговорОформлен.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЛидыНецелевые.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЛидыОтложенныеДоговоры.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());	
	ЛидыЗаявкаНаЗамер.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	//ЛидыРекламация.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЛидыОбращение.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаСервере	
Процедура УстановитьВидимостьПоляПросроченДляЛидов(ФлагВидимости)
	
	Элементы.ЛидыПросрочен.Видимость = ФлагВидимости;
	Элементы.ЛидыНовыеПросрочен.Видимость = ФлагВидимости;
	Элементы.ЛидыРасчетДоЗамераПросрочен.Видимость = ФлагВидимости;
	Элементы.ЛидыОтказныеПросрочен.Видимость = ФлагВидимости;
	Элементы.ЛидыОтложенныеЗамерПросрочен.Видимость = ФлагВидимости;
	Элементы.ЛидыОбработкаПослеЗамераПросрочен.Видимость = ФлагВидимости;
	Элементы.ЛидыОформитьДоговорПросрочен.Видимость = ФлагВидимости;
	Элементы.ЛидыДоговорОформленПросрочен.Видимость = ФлагВидимости;
	Элементы.ЛидыНецелевыеПросрочен.Видимость = ФлагВидимости;
	Элементы.ЛидыОтложенныеДоговорыПросрочен.Видимость = ФлагВидимости;
	Элементы.ЛидыЗаявкаНаЗамерПросрочен.Видимость = ФлагВидимости;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтборПоПолю(ЭлементТаблица, ВидСравнения, ИмяПоляЛевоеЗначение, ПравоеЗначение)
	
	ЭО = ЭлементТаблица.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭО.ВидСравнения		= ВидСравнения;
	ЭО.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных(ИмяПоляЛевоеЗначение);
	ЭО.ПравоеЗначение	= ПравоеЗначение;
	ЭО.Использование	= Истина;	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОтборПоПолю(ЭлементТаблица, Поле1, Поле2, Поле3, Поле4)
	
	ЭОКоличество = ЭлементТаблица.Отбор.Элементы.Количество();
	Для Индекс = 1 По ЭОКоличество Цикл
		ЭлементОтбора = ЭлементТаблица.Отбор.Элементы[ЭОКоличество - Индекс];
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле1) 
			ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле2)
			ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле3)
			ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле4)
		Тогда
			ЭлементТаблица.Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВкладкаЛиды

&НаКлиенте
Процедура СоздатьНовыйЛид(Команда)
	ОткрытьФорму("Документ.Лид.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_Все(Команда)
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыВсе;
	ВыделитьКнопкуФильтраЛида("Фильтр_Все");
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_ЗаполнитьДанныеЗамера(Команда)
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыЗаявкаНаЗамер;
	ВыделитьКнопкуФильтраЛида("Фильтр_ЗаполнитьДанныеЗамера");
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_НазначитьЗамер(Команда)
	
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыНовые;
	ВыделитьКнопкуФильтраЛида("Фильтр_НазначитьЗамер");
	
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_Отказ(Команда)
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыОтказные;
	ВыделитьКнопкуФильтраЛида("Фильтр_Отказ");
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_ОтложенныйЗаключитьДоговор(Команда)
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыОтложенныйДоговор;
	ВыделитьКнопкуФильтраЛида("Фильтр_ОтложенныйЗаключитьДоговор");
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_ОтложенныйНазначитьЗамер(Команда)
	
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаОтложенныеЗамер;
	ВыделитьКнопкуФильтраЛида("Фильтр_ОтложенныйНазначитьЗамер");
	
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_ОформитьДоговор(Команда)
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыОформитьДоговор;
	ВыделитьКнопкуФильтраЛида("Фильтр_ОформитьДоговор");
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьКнопкуФильтраЛида(НазваниеКнопки)
	
	Элементы.Фильтр_НазначитьЗамер.ЦветФона 			= WebЦвета.СветлоЖелтыйЗолотистый;
	Элементы.Фильтр_РасчетДоЗамера.ЦветФона 			= WebЦвета.СветлоЖелтыйЗолотистый;
	Элементы.Фильтр_ОтложенныйНазначитьЗамер.ЦветФона 	= WebЦвета.СветлоЖелтыйЗолотистый;
	Элементы.Фильтр_ОтложенныйЗаключитьДоговор.ЦветФона = WebЦвета.СветлоЖелтыйЗолотистый;
	Элементы.Фильтр_ЗаполнитьДанныеЗамера.ЦветФона 		= WebЦвета.СветлоЖелтыйЗолотистый;
	Элементы.Фильтр_ОбработкаПослеЗамера.ЦветФона 		= WebЦвета.СветлоЖелтыйЗолотистый;
	Элементы.Фильтр_ОформитьДоговор.ЦветФона 			= WebЦвета.СветлоЖелтыйЗолотистый;	
	Элементы.Фильтр_ДоговорОформлен.ЦветФона 			= WebЦвета.СветлоЖелтыйЗолотистый;
	Элементы.Фильтр_Все.ЦветФона 						= WebЦвета.СветлоЖелтыйЗолотистый;
	
	//#16089
	СоответствиеНадписей = Новый Соответствие;
	СоответствиеНадписей.Вставить("Фильтр_НазначитьЗамер", 				"ПредставлениеСчетчикаНовыйЛид");
	СоответствиеНадписей.Вставить("Фильтр_РасчетДоЗамера", 				"ПредставлениеСчетчикаРасчетДоЗамера");    //#16875
	СоответствиеНадписей.Вставить("Фильтр_ЗаполнитьДанныеЗамера", 		"ПредставлениеСчетчикаЗаявкаНаЗамер");
	СоответствиеНадписей.Вставить("Фильтр_ОтложенныйНазначитьЗамер", 	"ПредставлениеСчетчикаОтложенныйЗамер");
	СоответствиеНадписей.Вставить("Фильтр_ОтложенныйЗаключитьДоговор", 	"ПредставлениеСчетчикаОтложенныйДоговор");	
	СоответствиеНадписей.Вставить("Фильтр_ОбработкаПослеЗамера", 		"ПредставлениеСчетчикаОбработкаПослеЗамера");   //#16875
	СоответствиеНадписей.Вставить("Фильтр_ОформитьДоговор", 			"ПредставлениеСчетчикаОформитьДоговор");
	СоответствиеНадписей.Вставить("Фильтр_ДоговорОформлен", 			"ПредставлениеСчетчикаДоговорОформлен");
	СоответствиеНадписей.Вставить("Фильтр_Обращение", 					"ПредставлениеСчетчикаОбращения");
	СоответствиеНадписей.Вставить("Фильтр_Отказ", 						"ПредставлениеСчетчикаОтказные");
	СоответствиеНадписей.Вставить("Фильтр_НеЦелевой", 					"ПредставлениеСчетчикаНецелевые");
	СоответствиеНадписей.Вставить("Фильтр_Все", 						"ПредставлениеСчетчикаВсеЛиды");
	Для каждого КлючЗначение из СоответствиеНадписей Цикл
		Элементы[КлючЗначение.Значение].ЦветФона = WebЦвета.СветлоЖелтыйЗолотистый;
	КонецЦикла;
	
	Элементы.Фильтр_Отказ.ЦветФона 						= WebЦвета.Лосось; // №6627 заменен на цвет бледно красный, был WebЦвета.СеребристоСерый;
	Элементы.Фильтр_НеЦелевой.ЦветФона 					= WebЦвета.Лосось; // №6627 заменен на цвет бледно красный, был WebЦвета.СеребристоСерый;
	Элементы[СоответствиеНадписей.Получить("Фильтр_Отказ")].ЦветФона = WebЦвета.Лосось;
	Элементы[СоответствиеНадписей.Получить("Фильтр_НеЦелевой")].ЦветФона = WebЦвета.Лосось;
	
	Элементы.Фильтр_Обращение.ЦветФона 					= WebЦвета.СеребристоСерый;
	Элементы[СоответствиеНадписей.Получить("Фильтр_Обращение")].ЦветФона = WebЦвета.СеребристоСерый;
	
	Элементы.Фильтр_ЗамерыИВыезды.ЦветФона 				= Новый Цвет();
	
	Элементы[НазваниеКнопки].ЦветФона = WebЦвета.Оранжевый;
	//#16089
	Если НЕ СоответствиеНадписей.Получить(НазваниеКнопки) = Неопределено Тогда
		Элементы[СоответствиеНадписей.Получить(НазваниеКнопки)].ЦветФона = WebЦвета.Оранжевый;
	КонецЕсли;
	
	Элементы.ГруппаБыстрыеФильтрыЛидыОбращение.Видимость = (НРег(НазваниеКнопки) = "фильтр_обращение"); // №11332
	Элементы.ГруппаБыстрыеФильтрыЛидыВсе.Видимость = (НРег(НазваниеКнопки) = "фильтр_все");
	
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_ДоговорОформлен(Команда)
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыДоговорОформлен;
	ВыделитьКнопкуФильтраЛида("Фильтр_ДоговорОформлен");
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_НеЦелевой(Команда)
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыНецелевые;
	ВыделитьКнопкуФильтраЛида("Фильтр_НеЦелевой");
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_Обращение(Команда)
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыОбращение;
	ВыделитьКнопкуФильтраЛида("Фильтр_Обращение");
	
	УстановитьФильтрыСпискаОбращений();
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_ЗамерыИВыезды(Команда)
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаЛидыЗамерыВыезды;
	ВыделитьКнопкуФильтраЛида("Фильтр_ЗамерыИВыезды");
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_РасчетДоЗамера(Команда)
	
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаРасчетДоЗамера;
	ВыделитьКнопкуФильтраЛида("Фильтр_РасчетДоЗамера");
	
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_ОбработкаПослеЗамера(Команда)
	
	Элементы.ГруппаСтраницыЛиды.ТекущаяСтраница = Элементы.ГруппаОбработкаПослеЗамера;
	ВыделитьКнопкуФильтраЛида("Фильтр_ОбработкаПослеЗамера");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидОбращенияПриИзменении(Элемент)
	УстановитьФильтрыСпискаОбращений();	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоказыватьЗакрытыеОбращенияПриИзменении(Элемент)
	УстановитьФильтрыСпискаОбращений();	
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтрыСпискаОбращений()
	
	// Вид обращения
	ВидОбращенияЭлемент = ?(ОтборВидОбращения = "БезВида" ИЛИ ПустаяСтрока(ОтборВидОбращения), Справочники.ВидыОбращенийЛида.ПустаяСсылка(), Справочники.ВидыОбращенийЛида[ОтборВидОбращения]); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЛидыОбращение, 
		"ВидОбращения", 
		ВидОбращенияЭлемент,
		ВидСравненияКомпоновкиДанных.Равно, ,
		НЕ ПустаяСтрока(ОтборВидОбращения)
	);
	
	// Закрытые 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЛидыОбращение, 
		"РезультатОбращения", 
		Справочники.РезультатыЛида.Закрыт,
		ВидСравненияКомпоновкиДанных.НеРавно, ,
		НЕ ОтборПоказыватьЗакрытыеОбращения
	);	
	
КонецПроцедуры

//&НаКлиенте
//Процедура КомандаОбновитьНадписиКнопок(Команда)
//	ОбновитьНадписиКнопокНаКлиенте();
//КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНеобходимостьОбновленияСпискаЛидов()
	
	Если НужноОбновитьСписокЛидов() И ЭтотОбъект.ВводДоступен() Тогда
		ОбновитьСпискиРМ(Истина);

		//ОбновитьНадписиКнопокНаКлиенте(); //#16089 закомментировано
		УбратьФлагНужноОбновитьСписокЛидов();
		Состояние("Получены новые лиды");
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция НужноОбновитьСписокЛидов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ		
	|	ОбновленияАРМРозницы.Обновить
	|ИЗ 
	|   РегистрСведений.НеобходимостьОбновленияАРМРозницы КАК ОбновленияАРМРозницы
	|ГДЕ
	|   ОбновленияАРМРозницы.Пользователь = &Пользователь
	|   И ОбновленияАРМРозницы.Обновить
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();		
	
КонецФункции

&НаСервере
Процедура УбратьФлагНужноОбновитьСписокЛидов()
	
	МенеджерЗаписи = РегистрыСведений.НеобходимостьОбновленияАРМРозницы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Обновить = Ложь;
	
	Попытка
		МенеджерЗаписи.Записать();	
	Исключение
	КонецПопытки;
	
КонецПроцедуры	

&НаСервере
Процедура ДобавитьФильтрЛидовПоОграничениям()
	
	МассивСписков = Новый Массив;
	МассивСписков.Добавить(Лиды);
	МассивСписков.Добавить(ЛидыНовые);
	МассивСписков.Добавить(ЛидыРасчетДоЗамера);
	МассивСписков.Добавить(ЛидыОтказные);
	МассивСписков.Добавить(ЛидыОтложенныеЗамер);
	МассивСписков.Добавить(ЛидыОбработкаПослеЗамера);
	МассивСписков.Добавить(ЛидыОформитьДоговор);
	МассивСписков.Добавить(ЛидыДоговорОформлен);
	МассивСписков.Добавить(ЛидыНецелевые);
	МассивСписков.Добавить(ЛидыОтложенныеДоговоры);
	МассивСписков.Добавить(ЛидыЗаявкаНаЗамер);
	МассивСписков.Добавить(ЛидыОбращение);
	МассивСписков.Добавить(ЗамерыВыезды);
	
	Для каждого СписокЛидов из МассивСписков Цикл
		УдалитьОтборПоПолю(СписокЛидов, "Автор", "ТочкаПродаж", "Подразделение", "Менеджер");
	КонецЦикла;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если ОбщийМодульСервер.НастройкаПользователя("ОтображатьТолькоСвоиЛидыВСписке", ТекущийПользователь) Тогда
		Для каждого СписокЛидов из МассивСписков Цикл
			ДобавитьОтборПоПолю(СписокЛидов, ВидСравненияКомпоновкиДанных.Равно, "Автор", ТекущийПользователь);
		КонецЦикла;
	КонецЕсли;
			
	Если НЕ ЛидОтборПоАвтору.Пустая() Тогда
		Для каждого СписокЛидов из МассивСписков Цикл
			ДобавитьОтборПоПолю(СписокЛидов, ВидСравненияКомпоновкиДанных.Равно, "Автор", ЛидОтборПоАвтору);
		КонецЦикла;
	КонецЕсли;
	
	//++ №14722
	Если НЕ ЛидОтборПоМенеджеру.Пустая() Тогда
		Для каждого СписокЛидов из МассивСписков Цикл
			ДобавитьОтборПоПолю(СписокЛидов, ВидСравненияКомпоновкиДанных.Равно, "Менеджер", ЛидОтборПоМенеджеру);
		КонецЦикла;
	КонецЕсли;
	//-- №14722
	
	//#12515
	Если НЕ ЛидОтборПоПодразделению.Пустая() Тогда
		Для каждого СписокЛидов из МассивСписков Цикл
			ДобавитьОтборПоПолю(СписокЛидов, ВидСравненияКомпоновкиДанных.Равно, "Подразделение", ЛидОтборПоПодразделению);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЛидОтборПоТочкеПродаж.Пустая() Тогда
		Для каждого СписокЛидов из МассивСписков Цикл
			ДобавитьОтборПоПолю(СписокЛидов, ВидСравненияКомпоновкиДанных.Равно, "ТочкаПродаж", ЛидОтборПоТочкеПродаж);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьКолонокСпискаЛидов(Фильтр="")
	
	//колонки, которые видны всегда
	Элементы.ЛидыДата.Видимость 							= Истина;
	Элементы.ЛидыНомер.Видимость 							= Истина;
	Элементы.ЛидыВидКонтакта.Видимость 						= Истина;
	Элементы.ЛидыИмяКлиента.Видимость 						= Истина;
	Элементы.ЛидыТекущийСтатус.Видимость 					= Истина;
	Элементы.ЛидыПоследнийКомментарий.Видимость 			= Истина;
	Элементы.ЛидыАдрес.Видимость 							= Истина;
	
	//колонки с переменной видимостью
	Элементы.ЛидыПоследняяДатаПерезвонить.Видимость 		= Истина;
	//Элементы.ЛидыПоследнееВремяПерезвонить.Видимость 		= Истина;
	Элементы.ЛидыПоследнийРезультатЗамера.Видимость 		= Истина;
	Элементы.ЛидыПоследняяСуммаДоговораНаЗамере.Видимость 	= Истина;
	Элементы.ЛидыПоследнееЗамерВыполнен.Видимость 			= Истина;
	Элементы.ЛидыПоследняяДатаЗамера.Видимость				= Истина;
	Элементы.ЛидыПоследнееВремяНачалаЗамера.Видимость 		= Истина;
	Элементы.ЛидыПоследнийИсполнительЗамера.Видимость 		= Истина;
	
	Если Фильтр = "ЗаполнитьЗамер" Тогда
		Элементы.ЛидыПоследняяДатаПерезвонить.Видимость 		= Ложь;
		//Элементы.ЛидыПоследнееВремяПерезвонить.Видимость 		= Ложь;
		Элементы.ЛидыПоследнийРезультатЗамера.Видимость 		= Истина;
		Элементы.ЛидыПоследняяСуммаДоговораНаЗамере.Видимость 	= Ложь;
		Элементы.ЛидыПоследнееЗамерВыполнен.Видимость 			= Ложь;
		Элементы.ЛидыПоследняяДатаЗамера.Видимость				= Истина;
		Элементы.ЛидыПоследнееВремяНачалаЗамера.Видимость 		= Ложь;
		Элементы.ЛидыПоследнийИсполнительЗамера.Видимость 		= Истина;
	ИначеЕсли Фильтр = "ОтложенныйНазначитьЗамер" Тогда
		Элементы.ЛидыПоследняяДатаПерезвонить.Видимость 		= Истина;
		//Элементы.ЛидыПоследнееВремяПерезвонить.Видимость 		= Истина;
		Элементы.ЛидыПоследнийРезультатЗамера.Видимость 		= Ложь;
		Элементы.ЛидыПоследняяСуммаДоговораНаЗамере.Видимость 	= Ложь;
		Элементы.ЛидыПоследнееЗамерВыполнен.Видимость 			= Ложь;
		Элементы.ЛидыПоследняяДатаЗамера.Видимость				= Ложь;
		Элементы.ЛидыПоследнееВремяНачалаЗамера.Видимость 		= Ложь;
		Элементы.ЛидыПоследнийИсполнительЗамера.Видимость 		= Ложь;
	ИначеЕсли Фильтр = "ОформитьДоговор" Тогда
		Элементы.ЛидыПоследняяДатаПерезвонить.Видимость 		= Ложь;
		//Элементы.ЛидыПоследнееВремяПерезвонить.Видимость 		= Ложь;
		Элементы.ЛидыПоследнийРезультатЗамера.Видимость 		= Ложь;
		Элементы.ЛидыПоследняяСуммаДоговораНаЗамере.Видимость 	= Истина;
		Элементы.ЛидыПоследнееЗамерВыполнен.Видимость 			= Ложь;
		Элементы.ЛидыПоследняяДатаЗамера.Видимость				= Истина;
		Элементы.ЛидыПоследнееВремяНачалаЗамера.Видимость 		= Ложь;
		Элементы.ЛидыПоследнийИсполнительЗамера.Видимость 		= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНадписиКнопок()
	
	// процедура переделана на функцию с директивой НаСервереБезКонтекста
	// ранее возникала ошибка: если вызвать окно "Вывести список", в это время срабатывало "ОбновитьНадписиКнопокНаКлиенте" (каждые 60 сек) с вызовом серверной процедуры, 
	// что приводило к обновлению данных на сервере, вызову процедуры "ПриПолученииДанныхНаСервере" для списков и при нажатии кнопки "ОК" программа падала в краш
	
	// убрано в отдельную процедуру ОбновитьЭлементыСостоянияПолученияПисем
	//ПроверкаРекламныхЭлектронныхЯщиков_ПоследняяДатаПроверки = Константы.ПроверкаРекламныхЭлектронныхЯщиков_ПоследняяДатаПроверки.Получить();
	//ПроверкаРекламныхЭлектронныхЯщиков_ТекстОшибки = Константы.ПроверкаРекламныхЭлектронныхЯщиков_ТекстОшибки.Получить();
	//Элементы.ПроверкаРекламныхЭлектронныхЯщиков_ТекстОшибки.Видимость = НЕ ПустаяСтрока(ПроверкаРекламныхЭлектронныхЯщиков_ТекстОшибки);
	
	//ИсторияАТС_ДатаПоследнегоПолучения = Константы.ТелефонияДатаПоследнегоПолученияИсторииИзАТС.Получить();
	//Если ТекущаяДатаСеанса() - ИсторияАТС_ДатаПоследнегоПолучения > 86400 Тогда
	//	Элементы.ИсторияАТС_ДатаПоследнегоПолучения.ЦветТекста = WebЦвета.Красный;
	//	Элементы.ИсторияАТС_ДатаПоследнегоПолучения.Шрифт = Новый Шрифт(Элементы.ИсторияАТС_ДатаПоследнегоПолучения.Шрифт,,,Истина);
	//Иначе
	//	Элементы.ИсторияАТС_ДатаПоследнегоПолучения.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	//	Элементы.ИсторияАТС_ДатаПоследнегоПолучения.Шрифт = Новый Шрифт(Элементы.ИсторияАТС_ДатаПоследнегоПолучения.Шрифт,,,Ложь);
	//КонецЕсли;
	
	РезультатЭлементы = Новый Структура();
	
	Автор = Пользователи.ТекущийПользователь();
	ФильтрПоОтветственному = ОбщийМодульСервер.НастройкаПользователя("ОтображатьТолькоСвоиЛидыВСписке", Автор);
	
	//все статусы кроме "ЗапросВсего"
	ЗапросВсегоИСегодня = Новый Запрос;
	ЗапросВсегоИСегодня.УстановитьПараметр("Завтра",НачалоДня(ТекущаяДатаСеанса()+60*60*24));
	ЗапросВсегоИСегодня.УстановитьПараметр("ЗаполнитьЗамер", Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера);
	ЗапросВсегоИСегодня.УстановитьПараметр("ФильтрПоОтветственному", ФильтрПоОтветственному);
	ЗапросВсегоИСегодня.УстановитьПараметр("Автор", Автор);
	ЗапросВсегоИСегодня.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лид.ТекущийСтатус КАК ТекущийСтатус,
	|	1 КАК Количество
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.Проведен
	|	И Лид.ТекущийСтатус <> &ЗаполнитьЗамер
	|	И ВЫБОР
	|			КОГДА &ФильтрПоОтветственному
	|				ТОГДА Лид.Автор = &Автор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лид.ТекущийСтатус КАК ТекущийСтатус,
	|	ВЫБОР
	|		КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.Обращение)
	|				И Лид.РезультатОбращения = ЗНАЧЕНИЕ(Справочник.РезультатыЛида.Закрыт)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.Проведен
	|	И ВЫБОР
	|			КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.Обращение)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лид.ПоследняяДатаПерезвонить < &Завтра
	|		КОНЕЦ
	|	И Лид.ТекущийСтатус <> &ЗаполнитьЗамер
	|	И ВЫБОР
	|			КОГДА &ФильтрПоОтветственному
	|				ТОГДА Лид.Автор = &Автор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	РезультатЗапроса = ЗапросВсегоИСегодня.ВыполнитьПакет();
	
	РезультатВсего = РезультатЗапроса[0].Выгрузить();
	РезультатВсего.Свернуть("ТекущийСтатус","Количество");	
	РезультатСегодня = РезультатЗапроса[1].Выгрузить();
	РезультатСегодня.Свернуть("ТекущийСтатус","Количество");
	
	ЗапросВидыСтатусов = Новый Запрос;
	ЗапросВидыСтатусов.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЛида.ИмяПредопределенныхДанных,
	|	СтатусыЛида.Ссылка,
	|	СтатусыЛида.Наименование
	|ИЗ
	|	Справочник.СтатусыЛида КАК СтатусыЛида
	|ГДЕ
	|	НЕ СтатусыЛида.ПометкаУдаления
	|	И СтатусыЛида.Ссылка <> &ЗаполнитьЗамер
	//#11332
	|	И НЕ СтатусыЛида.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.УДАЛИТЬ_Сервис)
	|	И НЕ СтатусыЛида.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.УДАЛИТЬ_Рекламация)
	|";
	ЗапросВидыСтатусов.УстановитьПараметр("ЗаполнитьЗамер", Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера);
	ВыборкаВидыСтатусов = ЗапросВидыСтатусов.Выполнить().Выбрать();
	
	Пока ВыборкаВидыСтатусов.Следующий() Цикл
		
		Сегодня = 0;
		НайденнаяСтрока = РезультатСегодня.Найти(ВыборкаВидыСтатусов.Ссылка,"ТекущийСтатус");
		Если НЕ НайденнаяСтрока = Неопределено Тогда
			Сегодня = НайденнаяСтрока.Количество;
		КонецЕсли;
		
		Всего = 0;
		НайденнаяСтрока = РезультатВсего.Найти(ВыборкаВидыСтатусов.Ссылка,"ТекущийСтатус");
		Если НЕ НайденнаяСтрока = Неопределено Тогда
			Всего = НайденнаяСтрока.Количество;
		КонецЕсли;
		
		Если НЕ "Фильтр_"+ВыборкаВидыСтатусов.ИмяПредопределенныхДанных = "Фильтр_НазначитьЗамер"
			и НЕ "Фильтр_"+ВыборкаВидыСтатусов.ИмяПредопределенныхДанных = "Фильтр_ОформитьДоговор" 
			и НЕ "Фильтр_"+ВыборкаВидыСтатусов.ИмяПредопределенныхДанных = "Фильтр_Отказ"
			//и НЕ "Фильтр_"+ВыборкаВидыСтатусов.ИмяПредопределенныхДанных = "Фильтр_Сервис"
			//и НЕ "Фильтр_"+ВыборкаВидыСтатусов.ИмяПредопределенныхДанных = "Фильтр_Рекламация"
			и НЕ "Фильтр_"+ВыборкаВидыСтатусов.ИмяПредопределенныхДанных = "Фильтр_НеЦелевой" Тогда
			
			ЗаголовокЭлемента = ВыборкаВидыСтатусов.Наименование + Символы.ПС +"(" + Сегодня + "/" + Всего + ")";
			//ИскомыйЭлемент = Элементы.Найти("Фильтр_"+ВыборкаВидыСтатусов.ИмяПредопределенныхДанных);
			//Если НЕ ИскомыйЭлемент = Неопределено Тогда
			//	ИскомыйЭлемент.Заголовок = ЗаголовокЭлемента;
			//КонецЕсли; 
			РезультатЭлементы.Вставить("Фильтр_"+ВыборкаВидыСтатусов.ИмяПредопределенныхДанных, ЗаголовокЭлемента);
		Иначе
			ЗаголовокЭлемента = ВыборкаВидыСтатусов.Наименование + Символы.ПС +"(" + Всего + ")";
			//ИскомыйЭлемент = Элементы.Найти("Фильтр_"+ВыборкаВидыСтатусов.ИмяПредопределенныхДанных);
			//Если НЕ ИскомыйЭлемент = Неопределено Тогда
			//	ИскомыйЭлемент.Заголовок =ЗаголовокЭлемента;
			//КонецЕсли;
			РезультатЭлементы.Вставить("Фильтр_"+ВыборкаВидыСтатусов.ИмяПредопределенныхДанных, ЗаголовокЭлемента);
		КонецЕсли;
		
	КонецЦикла;
	
	//статус "ЗапросВсего"
	//Элементы.Фильтр_ЗаполнитьДанныеЗамера.Заголовок = "Заявка на замер (0/0)";
	РезультатЭлементы.Вставить("Фильтр_ЗаполнитьДанныеЗамера", "Замер/Выезд (0/0)");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Всего,
	|	ВЫБОР
	|		КОГДА Лид.ПоследняяДатаЗамера >= &НачалоСегодня
	|				И Лид.ПоследняяДатаЗамера <= &КонецСегодня
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сегодня
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.Проведен
	|	И Лид.ТекущийСтатус = &ЗаполнитьЗамер";
	Если ФильтрПоОтветственному Тогда
		Запрос.Текст = Запрос.Текст + "
			|	И Лид.Автор = &Автор";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗаполнитьЗамер", Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера);
	Запрос.УстановитьПараметр("НачалоСегодня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("КонецСегодня", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Автор", Автор);
	Выборка = Запрос.Выполнить().Выгрузить();
	Выборка.Свернуть(,"Всего,Сегодня");
	Если Выборка.Количество() > 0 Тогда
		ЗаголовокЭлемента = "Замер/Выезд" + Символы.ПС + "("+Выборка[0].Сегодня + "/" + Выборка[0].Всего + ")";
		//Элементы.Фильтр_ЗаполнитьДанныеЗамера.Заголовок = ЗаголовокЭлемента;
		РезультатЭлементы.Вставить("Фильтр_ЗаполнитьДанныеЗамера", ЗаголовокЭлемента);
	КонецЕсли;
	
	//Договор оформлен
	ЗаголовокЭлемента = "Договор оформлен (0/0)";
	//Элементы.Фильтр_ДоговорОформлен.Заголовок = ЗаголовокЭлемента;
	РезультатЭлементы.Вставить("Фильтр_ДоговорОформлен", ЗаголовокЭлемента);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА Лид.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСегодня,
	|	1 КАК КоличествоВсего	
	|ИЗ
	|	Документ.Лид КАК Лид	
	|ГДЕ
	|	Лид.Проведен
	|	И Лид.ТекущийСтатус = &ДоговорОформлен";
	Если ФильтрПоОтветственному Тогда
		Запрос.Текст = Запрос.Текст + "
			|	И Лид.Автор = &Автор";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Автор", Автор);
	Запрос.УстановитьПараметр("ДоговорОформлен", Справочники.СтатусыЛида.ДоговорОформлен);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда 
		ДоговорОформлен = РезультатЗапроса.Выгрузить();
		ЗаголовокЭлемента = "Договор оформлен" + Символы.ПС + "(" + ДоговорОформлен.Итог("КоличествоСегодня") + "/" + ДоговорОформлен.Итог("КоличествоВсего") + ")";
		//Элементы.Фильтр_ДоговорОформлен.Заголовок = ЗаголовокЭлемента;
		РезультатЭлементы.Вставить("Фильтр_ДоговорОформлен", ЗаголовокЭлемента);
	КонецЕсли;
	
	////договоры монтаж не назначен
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ДокументЗаказДоговор.Ссылка
	//|ИЗ
	//|	Документ.ЗаказДоговор КАК ДокументЗаказДоговор
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыполнениеМонтажейПоДоговорам.Обороты КАК ВыполнениеМонтажейПоДоговорам
	//|		ПО ДокументЗаказДоговор.Ссылка = ВыполнениеМонтажейПоДоговорам.ЗаказДоговор
	//|ГДЕ
	//|	1 = 1
	//|	И ДокументЗаказДоговор.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказДоговоров.ВРаботе)
	//|	И ЕСТЬNULL(ВыполнениеМонтажейПоДоговорам.ЗапланированОборот, 0) <= 0";
	//КоличествоДоговоров = Запрос.Выполнить().Выбрать().Количество();
	//Элементы.Фильтр_Договоры_МонтажНеНазначен.Заголовок = "Монтаж НЕ назначен (" + СтрЗаменить(КоличествоДоговоров,Символ(160),"") + ")";
	//
	////договоры монтаж назначен
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ДокументЗаказДоговор.Ссылка
	//|ИЗ
	//|	Документ.ЗаказДоговор КАК ДокументЗаказДоговор
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыполнениеМонтажейПоДоговорам.Обороты КАК ВыполнениеМонтажейПоДоговорам
	//|		ПО ДокументЗаказДоговор.Ссылка = ВыполнениеМонтажейПоДоговорам.ЗаказДоговор
	//|ГДЕ
	//|	1 = 1
	//|	И ДокументЗаказДоговор.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказДоговоров.ВРаботе)
	//|	И ЕСТЬNULL(ВыполнениеМонтажейПоДоговорам.ЗапланированОборот, 0) > 0";
	//КоличествоДоговоров = Запрос.Выполнить().Выбрать().Количество();
	//Элементы.Фильтр_Договоры_МонтажНазначен.Заголовок = "Монтаж назначен (" + СтрЗаменить(КоличествоДоговоров,Символ(160),"") + ")";
	
	Возврат РезультатЭлементы;
	
КонецФункции

//#16089 закомментировано
//&НаКлиенте
//Процедура ОбновитьНадписиКнопокНаКлиенте()
	
	//НадписиКнопокЛидов = ПолучитьНадписиКнопок();
	//Для каждого КлючЗначение из НадписиКнопокЛидов Цикл
	//	ИскомыйЭлемент = Элементы.Найти(КлючЗначение.Ключ);
	//	Если НЕ ИскомыйЭлемент = Неопределено Тогда
	//		ИскомыйЭлемент.Заголовок = КлючЗначение.Значение;
	//	КонецЕсли;
	//КонецЦикла;

//КонецПроцедуры

&НаКлиенте
Процедура ЛидыПриИзменении(Элемент)
	//ОбновитьНадписиКнопокНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЛидыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СтрНайти(Поле.Имя, "ЕстьФайлы") > 0 И Элемент.ТекущиеДанные.ЕстьФайлы Тогда
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора = Новый Структура("СсылкаНаОбъект", ВыбраннаяСтрока);
		ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		
		ОткрытьФорму("РегистрСведений.ПрикрепленныеДанные.ФормаСписка", ПараметрыВыбора,,ВыбраннаяСтрока);
		
	//#6588
	ИначеЕсли Прав(Поле.Имя, 7) = "Договор" Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Договор) Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущиеДанные.Договор);
		
			ОткрытьФорму("Документ.ЗаказДоговор.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЛидОтборПоОтветственномуПриИзменении(Элемент)
	ДобавитьФильтрЛидовПоОграничениям();
КонецПроцедуры

&НаКлиенте
Процедура ЛидОтборПоПодразделениюПриИзменении(Элемент)
	//#12515
	ДобавитьФильтрЛидовПоОграничениям();
КонецПроцедуры

&НаКлиенте
Процедура ЛидОтборПоТочкеПродажПриИзменении(Элемент)
	ДобавитьФильтрЛидовПоОграничениям();
КонецПроцедуры

&НаКлиенте
Процедура ЛидОтборПоМенеджеруПриИзменении(Элемент)
	
	ДобавитьФильтрЛидовПоОграничениям();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПросроченныхЛидов()
	ПолучитьПросроченныеЛиды();
	КоличествоПросроченных = МассивПросроченныхЛидов.Количество();
	Если КоличествоПросроченных > 0 Тогда 
		ПараметрыНовойФормы = Новый Структура;
		ПараметрыНовойФормы.Вставить("КоличествоПросроченных", КоличествоПросроченных);
		ПараметрыНовойФормы.Вставить("СписокПросроченных", МассивПросроченныхЛидов);
		ОткрытьФорму("Обработка.РабочееМестоМенеджераРозничныхПродаж.Форма.ФормаПредупреждениеОПросроченныхЛидах",ПараметрыНовойФормы, ЭтаФорма, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьПросроченныеЛиды()
	
	МассивПросроченныхЛидов.Очистить();
	
	КоличествоПросроченных = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	// #11632
	//|		КОГДА НЕ Лид.ДатаПоследнейРеакции = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		КОГДА НЕ Лид.ПоследняяДатаПерезвонить = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйНазначитьЗамер)
	|							ИЛИ Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ОтложенныйЗаключитьДоговор)
	|							ИЛИ Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера)
	|					ТОГДА ВЫБОР 
	|						  КОГДА Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера) ТОГДА
	|								ВЫБОР
	|									КОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Лид.ПоследняяДатаЗамера, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), Лид.ПоследнееВремяОкончанияЗамера, СЕКУНДА)), СЕКУНДА, НастройкиВремениРеакцииПоЛидам.ВремяВЧасах * 3600) < &ТекущаяДата
	|										ТОГДА 2
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						  ИНАЧЕ	
	|								ВЫБОР
	//|									КОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Лид.ПоследняяДатаПерезвонить, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), Лид.ПоследнееВремяПерезвонить, СЕКУНДА)), СЕКУНДА, НастройкиВремениРеакцииПоЛидам.ВремяВЧасах * 3600) < &ТекущаяДата
	|									КОГДА ДОБАВИТЬКДАТЕ(Лид.ПоследняяДатаПерезвонить, СЕКУНДА, НастройкиВремениРеакцииПоЛидам.ВремяВЧасах * 3600) < &ТекущаяДата
	|										ТОГДА 2
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|					КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	// #11632
	//|							КОГДА ДОБАВИТЬКДАТЕ(Лид.ДатаПоследнейРеакции, СЕКУНДА, НастройкиВремениРеакцииПоЛидам.ВремяВЧасах * 3600) < &ТекущаяДата
	//|							КОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Лид.ПоследняяДатаПерезвонить, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), Лид.ПоследнееВремяПерезвонить, СЕКУНДА)), СЕКУНДА, НастройкиВремениРеакцииПоЛидам.ВремяВЧасах * 3600) < &ТекущаяДата
	|							КОГДА ДОБАВИТЬКДАТЕ(Лид.ПоследняяДатаПерезвонить, СЕКУНДА, НастройкиВремениРеакцииПоЛидам.ВремяВЧасах * 3600) < &ТекущаяДата
	|								ТОГДА 2
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Просрочен,
	|	Лид.Ссылка
	|ИЗ
	|	Документ.Лид КАК Лид
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВремениРеакцииПоЛидам КАК НастройкиВремениРеакцииПоЛидам
	|		ПО Лид.ТекущийСтатус = НастройкиВремениРеакцииПоЛидам.СтатусЛида
	|ГДЕ
	|	Лид.Автор = &Автор";
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Автор", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		Если РезультатЗапроса.Просрочен = 2 Тогда
			МассивПросроченныхЛидов.Добавить(РезультатЗапроса.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПросроченныеЛиды(Команда)
	Если ОбщийМодуль.УведомлятьОПросроченныхЛидах() Тогда		
		МассивПросроченныхЛидовВсех = ОбщийМодуль.ПолучитьПросроченныеЛиды();
		КоличествоПросроченных = МассивПросроченныхЛидовВсех.Количество();
		ПараметрыНовойФормы = Новый Структура;
		ПараметрыНовойФормы.Вставить("КоличествоПросроченных", КоличествоПросроченных);
		ПараметрыНовойФормы.Вставить("СписокПросроченных", МассивПросроченныхЛидовВсех);
		ПараметрыНовойФормы.Вставить("ИзСпискаУведомления", Истина);
		ОткрытьФорму("Обработка.РабочееМестоМенеджераРозничныхПродаж.Форма.ФормаПредупреждениеОПросроченныхЛидах",ПараметрыНовойФормы, , Ложь);
	Иначе
		ПолучитьПросроченныеЛиды();
		КоличествоПросроченных = МассивПросроченныхЛидов.Количество();		
		ПараметрыНовойФормы = Новый Структура;
		ПараметрыНовойФормы.Вставить("КоличествоПросроченных", КоличествоПросроченных);
		ПараметрыНовойФормы.Вставить("СписокПросроченных", МассивПросроченныхЛидов);
		ПараметрыНовойФормы.Вставить("ИзСпискаУведомления", Ложь);		
		ОткрытьФорму("Обработка.РабочееМестоМенеджераРозничныхПродаж.Форма.ФормаПредупреждениеОПросроченныхЛидах",ПараметрыНовойФормы, ЭтаФорма, Ложь);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НайтиЛидПоНомеруТелефона(Команда)
	ОткрытьФорму("Обработка.РабочееМестоМенеджераРозничныхПродаж.Форма.ПоискЛидаПоНомеруТелефона");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНовыеЛиды(Команда)
	
	//РаботаСЭлектроннойПочтой.ПроверитьРекламныеЭлектронныеЯщики();
	//ПоказатьПредупреждение(,"Получение лидов по электронной почте завершено");
	ОткрытьФорму("Обработка.РабочееМестоМенеджераРозничныхПродаж.Форма.ФормаПолученияЛидов", , ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорыПриИзменении(Элемент)
	//ОбновитьНадписиКнопокНаКлиенте();
КонецПроцедуры

//++ #12503
&НаКлиенте
Процедура ФильтрПоказыватьВыезды(Команда)
	Элементы.ЗамерыВыездыФильтрПоказыватьВыезды.Пометка = НЕ Элементы.ЗамерыВыездыФильтрПоказыватьВыезды.Пометка;
	УстановитьОтборВыездовЗамеров();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоказыватьЗамеры(Команда)
	Элементы.ЗамерыВыездыФильтрПоказыватьЗамеры.Пометка = НЕ Элементы.ЗамерыВыездыФильтрПоказыватьЗамеры.Пометка;
	УстановитьОтборВыездовЗамеров();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборВыездовЗамеров()
	
	Если Элементы.ЗамерыВыездыФильтрПоказыватьЗамеры.Пометка И Элементы.ЗамерыВыездыФильтрПоказыватьВыезды.Пометка Тогда
		// отбор не используется
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗамерыВыезды,
			"ЭтоВыезд", Истина, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
		
	ИначеЕсли Элементы.ЗамерыВыездыФильтрПоказыватьЗамеры.Пометка И НЕ Элементы.ЗамерыВыездыФильтрПоказыватьВыезды.Пометка Тогда
		// отбор используется
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗамерыВыезды,
			"ЭтоВыезд", Ложь, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		
	ИначеЕсли НЕ Элементы.ЗамерыВыездыФильтрПоказыватьЗамеры.Пометка И Элементы.ЗамерыВыездыФильтрПоказыватьВыезды.Пометка Тогда
		// отбор используется
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗамерыВыезды,
			"ЭтоВыезд", Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		
	Иначе		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗамерыВыезды,
			"ЭтоВыезд", -1, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		
	КонецЕсли;
	
КонецПроцедуры
//-- #12503

#КонецОбласти

#Область ВкладкаЗаказыКлиентов

#Область ВкладкаЗаказыКлиентовОтборы

&НаСервере
Процедура УстановитьОтборЗаказДоговоров()
		
	ЗаказДоговоры.Отбор.Элементы.Очистить();
	
	Элементы.ФильтрДоговорыДопМонтаж.Пометка = ФильтрДоговорыТребуетсяДополнительныйМонтаж;
	Элементы.ФильтрДоговорыРассрочки.Пометка = ЗаказДоговорОтборРассрочки;
	Элементы.УстановкаФильтраДоговорыМонтажНеНазначен.Пометка = ФильтрДоговорыМонтажНеНазначен;
	Элементы.УстановкаФильтраДоговорыМонтажНазначен.Пометка = ФильтрДоговорыМонтажНазначен;	
	
	Если ФильтрДоговорыМонтажНазначен 
		ИЛИ ФильтрДоговорыМонтажНеНазначен 
		ИЛИ ФильтрДоговорыТребуетсяДополнительныйМонтаж Тогда
		
		ЗаказДоговорОтборПоСтатусу = Справочники.СтатусыЗаказДоговоров.ВРаботе;
	КонецЕсли;
									
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"ТребуетсяДополнительныйМонтаж", ФильтрДоговорыТребуетсяДополнительныйМонтаж, ВидСравненияКомпоновкиДанных.Равно,, ФильтрДоговорыТребуетсяДополнительныйМонтаж);
	
	Если ФильтрДоговорыМонтажНеНазначен Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"СтатусЗаказаРозницыМонтаж", 0, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ИначеЕсли ФильтрДоговорыМонтажНазначен Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"СтатусЗаказаРозницыМонтаж", 1, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"СтатусЗаказаРозницыМонтаж", -1, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"Подразделение", ЗаказДоговорОтборПоПодразделению, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЗаказДоговорОтборПоПодразделению.Пустая());										
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"Контрагент", ЗаказДоговорОтборПоКонтрагенту, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЗаказДоговорОтборПоКонтрагенту.Пустая());
	
	//#16242
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"ВидЗаказа", ЗаказДоговорОтборПоВиду, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЗаказДоговорОтборПоВиду.Пустая());
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"ТекущийСтатус", ЗаказДоговорОтборПоСтатусу, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЗаказДоговорОтборПоСтатусу.Пустая());										
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"Менеджер", ЗаказДоговорОтборПоМенеджеру, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЗаказДоговорОтборПоМенеджеру.Пустая());
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"СостояниеОплаты", ЗаказДоговорОтборПоОплате, ВидСравненияКомпоновкиДанных.Равно,, ЗаказДоговорОтборПоОплате >= -1);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"ЭтоРассрочка", ЗаказДоговорОтборРассрочки, ВидСравненияКомпоновкиДанных.Равно,, ЗаказДоговорОтборРассрочки);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"СостояниеВыполненияМонтажей", ЗаказДоговорОтборПоВыполнениюМонтажей, ВидСравненияКомпоновкиДанных.Равно,, ЗаказДоговорОтборПоВыполнениюМонтажей >= -1);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"СостояниеПозицийВМонтажах", ЗаказДоговорОтборПоПозициямВМонтажах, ВидСравненияКомпоновкиДанных.Равно,, ЗаказДоговорОтборПоПозициямВМонтажах >= -1);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"СтатусЗаказаРозницыНаПроизводство", ЗаказДоговорОтборПоСтатусуПроизводства, ВидСравненияКомпоновкиДанных.Равно,, ЗаказДоговорОтборПоСтатусуПроизводства >= -1);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказДоговоры,
			"СтатусЗаказаРозницыПоставщикам", ЗаказДоговорОтборПоСтатусуЗакупки, ВидСравненияКомпоновкиДанных.Равно,, ЗаказДоговорОтборПоСтатусуЗакупки >= -1);
	
КонецПроцедуры

// #14593 группа отборов, требующих подмены текста запроса Динамического списка "ЗаказДоговоры"
&НаСервере
Процедура ЗаказДоговорОсобыйОтборПриИзмененииНаСервере()
			
	ПоляОтбора = Новый Структура;  
	ПоляОтбора.Вставить("ЗаказДоговорОтборПоВыполнениюМонтажей", ЗаказДоговорОтборПоВыполнениюМонтажей);
	ПоляОтбора.Вставить("ЗаказДоговорОтборПоПозициямВМонтажах", ЗаказДоговорОтборПоПозициямВМонтажах);
	ПоляОтбора.Вставить("ЗаказДоговорОтборПоСтатусуПроизводства", ЗаказДоговорОтборПоСтатусуПроизводства);
	ПоляОтбора.Вставить("ЗаказДоговорОтборПоСтатусуЗакупки", ЗаказДоговорОтборПоСтатусуЗакупки);

	ОбщийМодульСервер.ЗаказДоговорОсобыйОтборПриИзменении(ЗаказДоговоры, СписокЗаказДоговоровТекстЗапроса, ПоляОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоПодразделениюПриИзменении(Элемент)
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоКонтрагентуПриИзменении(Элемент)
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоВидуПриИзменении(Элемент)
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоСтатусуПриИзменении(Элемент)
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоМенеджеруПриИзменении(Элемент)
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоОплатеПриИзменении(Элемент)
	
	//ЗаказДоговорОсобыйОтборПриИзмененииНаСервере();	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоОплатеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаказДоговорОтборПоОплате = -9;
	
	ЗаказДоговорОтборПоОплатеПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоСтатусуПроизводстваПриИзменении(Элемент)
	
	ЗаказДоговорОсобыйОтборПриИзмененииНаСервере();	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоСтатусуПроизводстваОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаказДоговорОтборПоСтатусуПроизводства = -9;
	
	ЗаказДоговорОтборПоСтатусуПроизводстваПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоСтатусуЗакупкиПриИзменении(Элемент)
	
	ЗаказДоговорОсобыйОтборПриИзмененииНаСервере();	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоСтатусуЗакупкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаказДоговорОтборПоСтатусуЗакупки = -9;
	
	ЗаказДоговорОтборПоСтатусуЗакупкиПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоПозициямВМонтажахПриИзменении(Элемент)
	
	ЗаказДоговорОсобыйОтборПриИзмененииНаСервере();	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоПозициямВМонтажахОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаказДоговорОтборПоПозициямВМонтажах = -9;
	
	ЗаказДоговорОтборПоПозициямВМонтажахПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоВыполнениюМонтажейПриИзменении(Элемент)
	
	ЗаказДоговорОсобыйОтборПриИзмененииНаСервере();	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорОтборПоВыполнениюМонтажейОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаказДоговорОтборПоВыполнениюМонтажей = -9;
	
	ЗаказДоговорОтборПоВыполнениюМонтажейПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФильтраДоговорыМонтажНазначен(Команда)
	
	ФильтрДоговорыМонтажНазначен   = НЕ ФильтрДоговорыМонтажНазначен;
	ФильтрДоговорыМонтажНеНазначен = Ложь;
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФильтраДоговорыМонтажНеНазначен(Команда)
	
	ФильтрДоговорыМонтажНеНазначен = НЕ ФильтрДоговорыМонтажНеНазначен;
	ФильтрДоговорыМонтажНазначен = Ложь;
		
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрДоговорыДопМонтаж(Команда)
	ФильтрДоговорыТребуетсяДополнительныйМонтаж = НЕ ФильтрДоговорыТребуетсяДополнительныйМонтаж;
	УстановитьОтборЗаказДоговоров();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрДоговорыРассрочки(Команда)
	
	ЗаказДоговорОтборРассрочки = НЕ ЗаказДоговорОтборРассрочки;
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФильтраДоговорыВсе(Команда)
	
	//ПолеКомпоновки = Новый ПолеКомпоновкиДанных("СтатусЗаказаРозницыМонтаж");
	//Для Каждого ЭлементОтбора Из ЗаказДоговоры.Отбор.Элементы Цикл
	//	Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
	//		И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
	//		ЗаказДоговоры.Отбор.Элементы.Удалить(ЭлементОтбора);
	//	КонецЕсли;
	//КонецЦикла;
	
	ФильтрДоговорыТребуетсяДополнительныйМонтаж = Ложь;
	ЗаказДоговорОтборРассрочки = Ложь;
	ФильтрДоговорыМонтажНеНазначен = Ложь;
	ФильтрДоговорыМонтажНазначен = Ложь;
	
	УстановитьОтборЗаказДоговоров();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СоздатьЗаказКлиента(Команда)
	
	ОбщийМодульКлиент.СоздатьЗаказКлиента(Команда);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаказДоговорыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриПолученииДанныхНаСервере(Строки); 
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	МассивСсылок = Строки.ПолучитьКлючи();
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// когда ЕстьОтборПо..., то заменяется текст запроса и колонка вычисляется в запросе
	ЕстьОтборПоСостояниюВыполненияМонтажей = Настройки.ДополнительныеСвойства.Свойство("ОтборПоСостояниюВыполненияМонтажей") И НЕ Настройки.ДополнительныеСвойства.ОтборПоСостояниюВыполненияМонтажей = -9;
	ЕстьОтборПоСостояниюПозицийВМонтажах = Настройки.ДополнительныеСвойства.Свойство("ОтборПоСостояниюПозицийВМонтажах") И НЕ Настройки.ДополнительныеСвойства.ОтборПоСостояниюПозицийВМонтажах = -9;
	ЕстьОтборПоСтатусуПроизводства = Настройки.ДополнительныеСвойства.Свойство("ОтборПоСтатусуПроизводства") И НЕ Настройки.ДополнительныеСвойства.ОтборПоСтатусуПроизводства = -9;
	ЕстьОтборПоСтатусуЗакупки = Настройки.ДополнительныеСвойства.Свойство("ОтборПоСтатусуЗакупки") И НЕ Настройки.ДополнительныеСвойства.ОтборПоСтатусуЗакупки = -9;
	
	КэшКолонок = Новый Структура;
	СтрокаДС = Строки.Получить(МассивСсылок[0]);
	КэшКолонок.Вставить("ЕстьКолонкаСтатусЗаказаРозницыНаПроизводство", СтрокаДС.Данные.Свойство("СтатусЗаказаРозницыНаПроизводство") И НЕ ЕстьОтборПоСтатусуПроизводства);
	КэшКолонок.Вставить("ЕстьКолонкаСтатусЗаказаРозницыПоставщикам", СтрокаДС.Данные.Свойство("СтатусЗаказаРозницыПоставщикам") И НЕ ЕстьОтборПоСтатусуЗакупки);
	
	КэшКолонок.Вставить("ЕстьКолонкаСостояниеВыполненияМонтажей", СтрокаДС.Данные.Свойство("СостояниеВыполненияМонтажей") И НЕ ЕстьОтборПоСостояниюВыполненияМонтажей);	
	КэшКолонок.Вставить("ЕстьКолонкаСостояниеПозицийВМонтажах", СтрокаДС.Данные.Свойство("СостояниеПозицийВМонтажах") И НЕ ЕстьОтборПоСостояниюПозицийВМонтажах);	
		
	ОбщийМодульСервер.РозницаПриПолученииДанныхНаСервере(Строки, "ЗаказДоговор", КэшКолонок);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ЗаказДоговорыСтатусЗаказаРозницыНаПроизводство" Тогда
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора = Новый Структура("Основание", ВыбраннаяСтрока);
		ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		
		ОткрытьФорму("Документ.ЗаказПокупателя.ФормаСписка", ПараметрыВыбора);
			                           
	ИначеЕсли Поле.Имя = "ЗаказДоговорыСтатусЗаказаРозницыПоставщикам" Тогда
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора = Новый Структура("Основание", ВыбраннаяСтрока);
		ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);		
		ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ФормаСпискаИзАРМ", ПараметрыВыбора);
		
	ИначеЕсли Поле.Имя = "ЗаказДоговорыСтатусЗаказаРозницыМонтаж" Тогда
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора = Новый Структура("Основание", ВыбраннаяСтрока);
		ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		
		Форма = ОткрытьФорму("Документ.Монтаж.Форма.ФормаСпискаИзАРМ", ПараметрыВыбора);
		
	//#6588
	ИначеЕсли Прав(Поле.Имя, 9) = "Основание" Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Основание) Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущиеДанные.Основание);
		
			ОткрытьФорму("Документ.Лид.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	
	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.СписокВыбор(Поле.Имя, ЭтотОбъект, Элементы.ЗаказДоговоры, СтандартнаяОбработка);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

#КонецОбласти

#Область ВкладкаРеализацииКлиентам

#Область ВкладкаРеализацииКлиентамОтборы

&НаСервере
Процедура УстановитьОтборМонтажей()
	
	// №9871 КоличествоФильтров = 0;
	
	Монтажи.Отбор.Элементы.Очистить();
	
	//++ 16281
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"Подразделение", МонтажиОтборПоПодразделению, ВидСравненияКомпоновкиДанных.Равно,, НЕ МонтажиОтборПоПодразделению.Пустая());
	
	//#16544
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"Контрагент", МонтажиОтборПоКонтрагенту, ВидСравненияКомпоновкиДанных.Равно,, НЕ МонтажиОтборПоКонтрагенту.Пустая());
	
	//#16544
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"ВидОперации", МонтажиОтборПоВиду, ВидСравненияКомпоновкиДанных.Равно,, НЕ МонтажиОтборПоВиду.Пустая());
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"Результат", МонтажиОтборПоРезультату, ВидСравненияКомпоновкиДанных.Равно,, НЕ МонтажиОтборПоРезультату.Пустая());
	
	ОтборДинамическогоСпискаМонтажи = Монтажи.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	
	//#16544 поле изменено: 2-в-1
	Если ПустаяСтрока(МонтажиОтборПоДатеМонтажа) ТОгда
		// Фильтр по дате монтажа сброшен
	ИначеЕсли МонтажиОтборПоДатеМонтажа = "Не определена" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"ДатаМонтажаНеОпределена", Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"ДатаМонтажа", МонтажиОтборПоДатеМонтажаНачалоПериода, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина);		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ОтборДинамическогоСпискаМонтажи,
			"ДатаМонтажа", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, МонтажиОтборПоДатеМонтажаКонецПериода,, Истина);
	КонецЕсли;
	//--	

	//++ 16027
	Если ЗначениеЗаполнено(МонтажиОтборПериодВыполнения) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"ДатаВыполнения", МонтажиОтборПериодВыполнения.ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ОтборДинамическогоСпискаМонтажи,
			"ДатаВыполнения", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, МонтажиОтборПериодВыполнения.ДатаОкончания,, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МонтажиОтборПериодЗакрытия) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"ДатаЗакрытия", МонтажиОтборПериодЗакрытия.ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ОтборДинамическогоСпискаМонтажи,
			"ДатаЗакрытия", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, МонтажиОтборПериодЗакрытия.ДатаОкончания,, Истина);
	КонецЕсли;
	//-- 16027	
	 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"Бригада", МонтажиОтборПоБригаде, ВидСравненияКомпоновкиДанных.Равно,, НЕ МонтажиОтборПоБригаде.Пустая());
	
	Если НЕ МонтажиОтборПоЗамерщику.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"Ссылка", ПолучитьСписокСсылокНаМонтажиПоОтборуДоговора(МонтажиОтборПоЗамерщику), ВидСравненияКомпоновкиДанных.ВСписке,, НЕ МонтажиОтборПоЗамерщику.Пустая());		
	КонецЕсли;
	
	//++ №9894 фильтр по номеру заказ-договора, в привилегированном режиме (если нет доступа на просмотр)
	Если ЗначениеЗаполнено(МонтажиОтборНомерДоговора) Тогда
		
		ЭО = Монтажи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭО.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭО.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Ссылка");
		ЭО.ПравоеЗначение	= ПолучитьСписокСсылокНаМонтажиПоОтборуДоговора(МонтажиОтборНомерДоговора);
		ЭО.Использование	= Истина;
		
	КонецЕсли;
	//-- №9894
	
	//#10804
	Если Элементы.МонтажиУстановкаФильтраМонтажиМонтаж.Пометка 
		ИЛИ Элементы.МонтажиУстановкаФильтраМонтажиСервиснаяЗаявка.Пометка 
		ИЛИ Элементы.МонтажиУстановкаФильтраМонтажиРекламация.Пометка
		ИЛИ Элементы.МонтажиУстановкаФильтраМонтажиПродажи.Пометка Тогда // №12721
		
		СписокВидовМонтажа = Новый СписокЗначений;
		Если Элементы.МонтажиУстановкаФильтраМонтажиМонтаж.Пометка Тогда
			СписокВидовМонтажа.Добавить(ПредопределенноеЗначение("Справочник.ВидыМонтажа.Монтаж"));
		КонецЕсли;
		Если Элементы.МонтажиУстановкаФильтраМонтажиСервиснаяЗаявка.Пометка Тогда
			СписокВидовМонтажа.Добавить(ПредопределенноеЗначение("Справочник.ВидыМонтажа.СервиснаяЗаявка"));
		КонецЕсли;
		Если Элементы.МонтажиУстановкаФильтраМонтажиРекламация.Пометка Тогда
			СписокВидовМонтажа.Добавить(ПредопределенноеЗначение("Справочник.ВидыМонтажа.Рекламация"));
		КонецЕсли;
		
		//++ №12721
		Если Элементы.МонтажиУстановкаФильтраМонтажиПродажи.Пометка Тогда
			СписокВидовМонтажа.Добавить(ПредопределенноеЗначение("Справочник.ВидыМонтажа.Продажа"));
		КонецЕсли;
		//-- №12721
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи, "ВидОперации", СписокВидовМонтажа, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);		
	КонецЕсли;
	
	//#16544
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"СтатусЗаказаРозницыНаПроизводство", МонтажиОтборПоСтатусуПроизводства, ВидСравненияКомпоновкиДанных.Равно,, МонтажиОтборПоСтатусуПроизводства >= -1);
	
	//#16544
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"СтатусЗаказаРозницыПоставщикам", МонтажиОтборПоСтатусуЗакупки, ВидСравненияКомпоновкиДанных.Равно,, МонтажиОтборПоСтатусуЗакупки >= -1);
	
	//#16544
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Монтажи,
			"ОбеспечениеМатериалами", МонтажиОтборПоВыдачеМатериалов, ВидСравненияКомпоновкиДанных.Равно,, МонтажиОтборПоВыдачеМатериалов >= -1);
	
КонецПроцедуры

&НаСервере
Процедура МонтажиОсобыйОтборПриИзмененииНаСервере()
			
	ПоляОтбора = Новый Структура;  
	ПоляОтбора.Вставить("МонтажиОтборПоСтатусуПроизводства", МонтажиОтборПоСтатусуПроизводства);
	ПоляОтбора.Вставить("МонтажиОтборПоСтатусуЗакупки", 	 МонтажиОтборПоСтатусуЗакупки);
	
	ОбщийМодульСервер.МонтажиОсобыйОтборПриИзменении(Монтажи, СписокМонтажейТекстЗапроса, ПоляОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоПодразделениюПриИзменении(Элемент)
	УстановитьОтборМонтажей();
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоКонтрагентуПриИзменении(Элемент)
	УстановитьОтборМонтажей();
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоВидуПриИзменении(Элемент)
	УстановитьОтборМонтажей();
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоРезультатуТекущийРезультатПриИзменении(Элемент)
	УстановитьОтборМонтажей();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораПериодаМонтажа()
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	СтандартныйПериод = Новый СтандартныйПериод();				
	СтандартныйПериод.ДатаНачала = МонтажиОтборПоДатеМонтажаНачалоПериода;
	СтандартныйПериод.ДатаОкончания = МонтажиОтборПоДатеМонтажаКонецПериода;
	
	Диалог.Период = СтандартныйПериод;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПериодаМонтажей",ЭтаФорма);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры
	
&НаКлиенте
Процедура МонтажиОтборПоДатеМонтажаПриИзменении(Элемент)
	
	Если МонтажиОтборПоДатеМонтажа = "Выбрать период..." Тогда
		ПоказатьДиалогВыбораПериодаМонтажа();		
	Иначе
		УстановитьОтборМонтажей();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПериодаМонтажей(Период, Параметры) Экспорт

    Если Период <> Неопределено Тогда        
        МонтажиОтборПоДатеМонтажаНачалоПериода = Период.ДатаНачала;
        МонтажиОтборПоДатеМонтажаКонецПериода = Период.ДатаОкончания; 
		
		МонтажиОтборПоДатеМонтажа = Строка(Период);		
	Иначе
		МонтажиОтборПоДатеМонтажа = "";
	КонецЕсли;
	
	УстановитьОтборМонтажей();

КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоДатеМонтажаОчистка(Элемент, СтандартнаяОбработка)
	
	//УстановитьОтборМонтажей();
	
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоДатеМонтажаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить("Не определена"); //, "Не определена");
	ДанныеВыбора.Добавить("Выбрать период..."); //, "Выбрать период...");
	Если ЗначениеЗаполнено(МонтажиОтборПоДатеМонтажаНачалоПериода) Тогда
		//ДанныеВыбора.Добавить("Период", СтрШаблон("%1 - %2",Формат(НачалоПериода, "ДЛФ=D"),Формат(КонецПериода, "ДЛФ=D") ));
	Иначе
		//ДанныеВыбора.Добавить("ВыбратьПериод", "Выбрать период...");	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПериодВыполненияПриИзменении(Элемент)
	УстановитьОтборМонтажей();
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПериодЗакрытияПриИзменении(Элемент)
	УстановитьОтборМонтажей();
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоСтатусуПроизводстваПриИзменении(Элемент)
	
	МонтажиОсобыйОтборПриИзмененииНаСервере();	
	УстановитьОтборМонтажей();
	
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоСтатусуПроизводстваОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МонтажиОтборПоСтатусуПроизводства = -9;
	
	МонтажиОтборПоСтатусуПроизводстваПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоСтатусуЗакупкиПриИзменении(Элемент)
	
	МонтажиОсобыйОтборПриИзмененииНаСервере();	
	УстановитьОтборМонтажей();
	
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоСтатусуЗакупкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МонтажиОтборПоСтатусуЗакупки = -9;
	
	МонтажиОтборПоСтатусуЗакупкиПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоВыдачеМатериаловПриИзменении(Элемент)
	
	//МонтажиОсобыйОтборПриИзмененииНаСервере();	
	УстановитьОтборМонтажей();
	
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоВыдачеМатериаловОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МонтажиОтборПоВыдачеМатериалов = -9;
	
	МонтажиОтборПоВыдачеМатериаловПриИзменении(Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура МонтажиОтборПоБригадеПриИзменении(Элемент)
	УстановитьОтборМонтажей();
КонецПроцедуры

&НаКлиенте
Процедура МонтажиОтборПоЗамерщикуПриИзменении(Элемент)
	УстановитьОтборМонтажей();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФильтраМонтажиВсе(Команда)
	
	Элементы.МонтажиУстановкаФильтраМонтажиМонтаж.Пометка = Ложь;
	Элементы.МонтажиУстановкаФильтраМонтажиСервиснаяЗаявка.Пометка = Ложь;
	Элементы.МонтажиУстановкаФильтраМонтажиРекламация.Пометка = Ложь;
	Элементы.МонтажиУстановкаФильтраМонтажиПродажи.Пометка = Ложь; // №12721
	
	УстановитьОтборМонтажей();

КонецПроцедуры

&НаКлиенте
Процедура УстановкаФильтраМонтажиМонтаж(Команда)
	
	Элементы.МонтажиУстановкаФильтраМонтажиМонтаж.Пометка = НЕ Элементы.МонтажиУстановкаФильтраМонтажиМонтаж.Пометка;
	УстановитьОтборМонтажей();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФильтраМонтажиСервиснаяЗаявка(Команда)
	
	Элементы.МонтажиУстановкаФильтраМонтажиСервиснаяЗаявка.Пометка = НЕ Элементы.МонтажиУстановкаФильтраМонтажиСервиснаяЗаявка.Пометка;
	УстановитьОтборМонтажей();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФильтраМонтажиРекламация(Команда)
	
	Элементы.МонтажиУстановкаФильтраМонтажиРекламация.Пометка = НЕ Элементы.МонтажиУстановкаФильтраМонтажиРекламация.Пометка;
	УстановитьОтборМонтажей();
	
КонецПроцедуры

//++ №12721
&НаКлиенте
Процедура УстановкаФильтраМонтажиПродажи(Команда)
	
	Элементы.МонтажиУстановкаФильтраМонтажиПродажи.Пометка = НЕ Элементы.МонтажиУстановкаФильтраМонтажиПродажи.Пометка;
	УстановитьОтборМонтажей();
	
КонецПроцедуры
//-- №12721

#КонецОбласти

&НаКлиенте
Процедура СоздатьМонтаж(Команда)
	
	ОбщийМодульКлиент.СоздатьМонтаж(Команда);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура МонтажиПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриПолученииДанныхНаСервере(Строки); 
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	МассивСсылок = Строки.ПолучитьКлючи();
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// когда ЕстьОтборПо..., то заменяется текст запроса и колонка вычисляется в запросе
	ЕстьОтборПоСтатусуПроизводства = Настройки.ДополнительныеСвойства.Свойство("ОтборПоСтатусуПроизводства") И НЕ Настройки.ДополнительныеСвойства.ОтборПоСтатусуПроизводства = -9;
	ЕстьОтборПоСтатусуЗакупки = Настройки.ДополнительныеСвойства.Свойство("ОтборПоСтатусуЗакупки") И НЕ Настройки.ДополнительныеСвойства.ОтборПоСтатусуЗакупки = -9;
	
	КэшКолонок = Новый Структура;
	СтрокаДС = Строки.Получить(МассивСсылок[0]);	
	КэшКолонок.Вставить("ЕстьКолонкаСтатусЗаказаРозницыНаПроизводство", СтрокаДС.Данные.Свойство("СтатусЗаказаРозницыНаПроизводство") И НЕ ЕстьОтборПоСтатусуПроизводства);
	КэшКолонок.Вставить("ЕстьКолонкаСтатусЗаказаРозницыПоставщикам", СтрокаДС.Данные.Свойство("СтатусЗаказаРозницыПоставщикам") И НЕ ЕстьОтборПоСтатусуЗакупки);
	
	ОбщийМодульСервер.РозницаПриПолученииДанныхНаСервере(Строки, "Монтаж", КэшКолонок);
	
	//++ №7938 номер и дата заказ-договора
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", Строки.ПолучитьКлючи());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Ссылка КАК Монтаж,
	|	ВЫБОР
	|		КОГДА НЕ Монтаж.Основание.НомерДоговора = """"
	|			ТОГДА Монтаж.Основание.НомерДоговора
	|		ИНАЧЕ Монтаж.Основание.Номер
	|	КОНЕЦ КАК Номер,
	|	Монтаж.Основание.Дата КАК Дата
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Ссылка В (&МассивСсылок)
	|	И Монтаж.Основание ССЫЛКА Документ.ЗаказДоговор";
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	ЕстьКолонки = Истина;
	Пока ВыборкаДокументов.Следующий() Цикл
				
		СтрокаСписка = Строки[ВыборкаДокументов.Монтаж];
		
		Если СтрокаСписка.Данные.Свойство("ЗаказДоговорНомер") Тогда
			СтрокаСписка.Данные["ЗаказДоговорНомер"] = ВыборкаДокументов.Номер;
		Иначе
			ЕстьКолонки = Ложь;
		КонецЕсли;
		
		Если СтрокаСписка.Данные.Свойство("ЗаказДоговорДата") Тогда
			СтрокаСписка.Данные["ЗаказДоговорДата"] = ВыборкаДокументов.Дата;
		Иначе
			ЕстьКолонки = Ложь;
		КонецЕсли;
		
		Если НЕ ЕстьКолонки Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	//-- №7938
	
	Для каждого СтрокаСписка из Строки Цикл
		Если СтрокаСписка.Значение.Данные.ЗаказДоговорКартинка = 0 Тогда
			НомерДата = ?(ПустаяСтрока(СтрокаСписка.Значение.Данные.ЗаказДоговорНомер), "от ", СтрокаСписка.Значение.Данные.ЗаказДоговорНомер + " от ") + Формат(СтрокаСписка.Значение.Данные.ЗаказДоговорДата, "ДЛФ=D");
			СтрокаСписка.Значение.Данные.ЗаказДоговорНомерДата = НомерДата;
		КонецЕсли;
	КонецЦикла;
	
	//++ №9919 индикация начисления ЗП по выработке
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗаработнойПлатыНаОснованииМонтажа") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыСПерсоналом.ОбъектВыработки КАК ДокументМонтаж,
		|	ЕСТЬNULL(СУММА(РасчетыСПерсоналом.Сумма), 0) КАК СуммаНачислений
		|
		|ПОМЕСТИТЬ ВТ_Начисления
		|
		|ИЗ
		|	РегистрНакопления.РасчетыСПерсоналом КАК РасчетыСПерсоналом
		|ГДЕ
		|	РасчетыСПерсоналом.ОбъектВыработки В (&МассивСсылок)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСПерсоналом.ОбъектВыработки
		|
		|;/////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыСПерсоналом.ДокументМонтаж КАК ДокументМонтаж,
		|	ВЫБОР
		|		КОГДА РасчетыСПерсоналом.СуммаНачислений > 0 И РасчетыСПерсоналом.СуммаНачислений > ЕСТЬNULL(ВыработкаИсполнителейРозницыОбороты.СтоимостьОборот, 0)
		|			ТОГДА 5
		|		КОГДА РасчетыСПерсоналом.СуммаНачислений > 0 И РасчетыСПерсоналом.СуммаНачислений = ЕСТЬNULL(ВыработкаИсполнителейРозницыОбороты.СтоимостьОборот, 0)
		|			ТОГДА 0
		|		КОГДА РасчетыСПерсоналом.СуммаНачислений > 0 И РасчетыСПерсоналом.СуммаНачислений < ЕСТЬNULL(ВыработкаИсполнителейРозницыОбороты.СтоимостьОборот, 0)
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ИндикацияНачисленияЗарплаты
		|	
		|ИЗ
		|	ВТ_Начисления КАК РасчетыСПерсоналом
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаИсполнителейРозницы.Обороты(,, Авто) КАК ВыработкаИсполнителейРозницыОбороты
		|		ПО РасчетыСПерсоналом.ДокументМонтаж = ВыработкаИсполнителейРозницыОбороты.ОбъектВыработки
		|
		|";
		Запрос.УстановитьПараметр("МассивСсылок", Строки.ПолучитьКлючи());
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			СтрокаСписка = Строки[ВыборкаДокументов.ДокументМонтаж];
			
			Если СтрокаСписка.Данные.Свойство("ИндикацияНачисленияЗарплаты") Тогда
				СтрокаСписка.Данные["ИндикацияНачисленияЗарплаты"] = ВыборкаДокументов.ИндикацияНачисленияЗарплаты;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	//-- №9919
	
КонецПроцедуры

&НаКлиенте
Процедура МонтажиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "МонтажиЗаказДоговорНомерДата" Тогда
		Если Элемент.ТекущиеДанные.ЗаказДоговорКартинка = 0 Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыВыбора = Новый Структура("Ключ", Элемент.ТекущиеДанные.Основание);
			ОткрытьФорму("Документ.ЗаказДоговор.ФормаОбъекта", ПараметрыВыбора,,Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.СписокВыбор(Поле.Имя, ЭтотОбъект, Элементы.Монтажи, СтандартнаяОбработка);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСсылокНаМонтажиПоОтборуДоговора(ЗначениеОтбора)
	
	// Если строка, то по номеру договора, иначе по замерщику
	ОтборПоНомеруДоговора = (ТипЗнч(ЗначениеОтбора) = Тип("Строка"));
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументМонтаж.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Монтаж КАК ДокументМонтаж
	|ГДЕ
	|	ДокументМонтаж.Основание ССЫЛКА Документ.ЗаказДоговор
	|	И ВЫБОР
	|			КОГДА &ОтборПоНомеруДоговора
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ ДокументМонтаж.Основание.НомерДоговора = """"
	|							ТОГДА ДокументМонтаж.Основание.НомерДоговора ПОДОБНО &НомерДоговора
	|						ИНАЧЕ ДокументМонтаж.Основание.Номер ПОДОБНО &НомерДоговора
	|					КОНЕЦ
	|			ИНАЧЕ ДокументМонтаж.Основание.ИсполнительЗамера = &Замерщик
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("НомерДоговора", ?(ОтборПоНомеруДоговора, "%" + ЗначениеОтбора + "%", ""));
	Запрос.УстановитьПараметр("Замерщик", ?(ОтборПоНомеруДоговора, Справочники.Сотрудники.ПустаяСсылка(), ЗначениеОтбора));
	Запрос.УстановитьПараметр("ОтборПоНомеруДоговора", ОтборПоНомеруДоговора);
	
	УстановитьПривилегированныйРежим(Истина);
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат МассивСсылок;
	
КонецФункции

#КонецОбласти

#Область ВкладкаСервисныеЗаявкиИРекламации

//&НаКлиенте
//Процедура УстановкаФильтраСервисныеЗаявки()
//	// 2017-07-14
//	УДАЛИТЬ_СервисныеЗаявки.Отбор.Элементы.Очистить();	
//	Если СервисныеЗаявкиОтбиратьПоСтатусу Тогда
//		ЭО = УДАЛИТЬ_СервисныеЗаявки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	    ЭО.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
//	    ЭО.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Результат");
//	    ЭО.ПравоеЗначение 	= СервисныеЗаявкиОтборПоСтатусуТекущийСтатус;
//	    ЭО.Использование	= Истина;
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура СервисныеЗаявкиОтборПоСтатусуТекущийСтатусПриИзменении(Элемент)
//	Если НЕ СервисныеЗаявкиОтборПоСтатусуТекущийСтатус.Пустая() Тогда
//		СервисныеЗаявкиОтбиратьПоСтатусу = Истина;
//	КонецЕсли;
//	УстановкаФильтраСервисныеЗаявки();
//КонецПроцедуры

//&НаКлиенте
//Процедура СервисныеЗаявкиОтбиратьПоСтатусуПриИзменении(Элемент)
//	УстановкаФильтраСервисныеЗаявки();
//КонецПроцедуры

#КонецОбласти

#Область ВкладкаПоступленияОтПроизводства

&НаСервере
Функция ЗагрузитьПотолкиИзПроизводстваНаСервере()
	
	КоличествоПоИнтеркампани = ОбщийМодуль.СозданиеПоступленийОтПроизводстваПоИнтеркампани();
	КоличествоПоРучным = ОбщийМодуль.СозданиеПоступленийОтПроизводстваПоРучнымЗаказам();
	КоличествоПоУИБ = ОбщийМодульСервер.СозданиеПоступленийТоваровОтПроизводстваПоУдаленнойБазе();

	Возврат КоличествоПоИнтеркампани + КоличествоПоРучным + КоличествоПоУИБ;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПотолкиИзПроизводства(Команда)
	КоличествоСозданныхДокументов = ЗагрузитьПотолкиИзПроизводстваНаСервере();
	Элементы.Поступления.Обновить();
	ПоказатьОповещениеПользователя("Загружено " + КоличествоСозданныхДокументов + " документов поступлений");
КонецПроцедуры

#КонецОбласти

#Область ВкладкаВконтакте

&НаКлиенте
Процедура ВКонтакте_ОпубликоватьЗаписьНаСтене(Команда)
	ПараметрыБеседы = Новый Структура;
	ПараметрыБеседы.Вставить("access_token",Объект.access_token);
	ОткрытьФорму("Обработка.РабочееМестоМенеджераРозничныхПродаж.Форма.ВКонтакте_ФормаЗаписьНаСтене", ПараметрыБеседы);
КонецПроцедуры

&НаКлиенте
Процедура БеседыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПараметрыБеседы = Новый Структура;
	ПараметрыБеседы.Вставить("access_token",Объект.access_token);
	ПараметрыБеседы.Вставить("uid",Элементы.Беседы.ТекущиеДанные.uid);
	ПараметрыБеседы.Вставить("mid",Элементы.Беседы.ТекущиеДанные.mid);
	ПараметрыБеседы.Вставить("chat_id",Элементы.Беседы.ТекущиеДанные.chat_id);
	ПараметрыБеседы.Вставить("Пользователи",ТаблицаПользователей);
	ОткрытьФорму("Обработка.РабочееМестоМенеджераРозничныхПродаж.Форма.ВКонтакте_ФормаБеседы", ПараметрыБеседы);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокБесед()
	
	Если НЕ ПустаяСтрока(Объект.access_token) Тогда
		
		КоличествоНепрочитанных = 0;
		
		Если НЕ Элементы.Беседы.ТекущиеДанные = Неопределено Тогда
			ТекущийMid = Элементы.Беседы.ТекущиеДанные.mid;
		КонецЕсли;
		
		//перед получением новых бесед, сохраним старый список бесед для определения новых сообщений
		БеседыПредыдущее.Очистить();
		Для Каждого ТекущаяБеседа Из Беседы Цикл
			НоваяСтрока = БеседыПредыдущее.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяБеседа);
		КонецЦикла;
		
		Беседы.Очистить();
		СписокБесед = РаботаССайтомВКонтакте.ПолучитьСписокБесед(Объект.access_token,,200);
		Для НомерБеседы = 0 По СписокБесед.Количество()-1 Цикл
			НоваяСтрока = Беседы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СписокБесед[НомерБеседы]);
			НоваяСтрока.body = СтрЗаменить(НоваяСтрока.body, "<br>", Символы.ПС);
			НоваяСтрока.Дата = Дата(1970,1,1,1,0,0) + НоваяСтрока.date;
			Если НоваяСтрока.read_state = "0" и НоваяСтрока.out = "0" Тогда
				КоличествоНепрочитанных = КоличествоНепрочитанных + 1;
			КонецЕсли;
		КонецЦикла;
		
		//получим ФИО пользователей
		СписокПользователей = "";
		Для Каждого Беседа Из Беседы Цикл
			Если НЕ ПустаяСтрока(СписокПользователей) Тогда
				СписокПользователей = СписокПользователей + ", ";
			КонецЕсли;
			СписокПользователей = СписокПользователей + Беседа.uid;
		КонецЦикла;
		СписокПользователей = РаботаССайтомВКонтакте.ПолучитьИнформациюОПользователях(Объект.access_token, СписокПользователей);
		Для НомерЗаписи = 0 По СписокПользователей.Количество()-1 Цикл
			НоваяСтрока = ТаблицаПользователей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СписокПользователей[НомерЗаписи]);
		КонецЦикла;
		//теперь сопоставим пользователей в беседах
		Для Каждого Беседа Из Беседы Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("uid", Беседа.uid);
			ЗаписиФИО = ТаблицаПользователей.НайтиСтроки(Отбор);
			Если ЗаписиФИО.Количество() > 0 Тогда
				Беседа.Пользователь = "" + ЗаписиФИО[0].first_name + " " + ЗаписиФИО[0].last_name;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ Беседы.НайтиСтроки(Новый Структура ("mid", ТекущийMid)).Количество() = 0  Тогда
			Ид = Беседы.НайтиСтроки(Новый Структура ("mid", ТекущийMid))[0].ПолучитьИдентификатор();
			Элементы.Беседы.ТекущаяСтрока = Ид;
		КонецЕсли;
		
		Если КоличествоНепрочитанных > 0 Тогда
			Элементы.ГруппаВКонтакте.Заголовок = "ВКонтакте (" + КоличествоНепрочитанных + "*)";
		Иначе
			Элементы.ГруппаВКонтакте.Заголовок = "ВКонтакте";
		КонецЕсли;
		
		//проверим соответствие нового списка бесед старому и выдадим уведомление о новом сообщении, если надо
		Если БеседыПредыдущее.Количество() > 0 Тогда
			Для Каждого ТекущаяБеседа Из Беседы Цикл
				Если ТекущаяБеседа.out = "0" Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("mid", ТекущаяБеседа.mid);
					ПредыдущиеБеседы = БеседыПредыдущее.НайтиСтроки(Отбор);
					Если ПредыдущиеБеседы.Количество() > 0 Тогда
						Если НЕ ПредыдущиеБеседы[0].body = ТекущаяБеседа.body Тогда
							ПоказатьОповещениеПользователя("ВКонтакте: новое сообщение от " + Символы.ПС + ТекущаяБеседа.Пользователь);
						КонецЕсли;
					Иначе
						ПоказатьОповещениеПользователя("ВКонтакте: новое сообщение от " + Символы.ПС + ТекущаяБеседа.Пользователь);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ПолучитьРезультатЗамераЗаключениеДоговора()
	Возврат Справочники.РезультатыЗамера.ЗаключениеДоговора;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПустойРезультатКонтакта()
	Возврат Справочники.РезультатыКонтактов.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура ПоказатьПропущенные(Команда)
	УстановитьОтборПропущенные(Не Элементы.ПоказатьПропущенные.Пометка);
	Элементы.ПоказатьПропущенные.Пометка=Не Элементы.ПоказатьПропущенные.Пометка;
	Если Элементы.ПоказатьПропущенные.Пометка Тогда
		Элементы.ПоказатьПропущенные.ЦветРамки=WebЦвета.Красный;
	Иначе
		Элементы.ПоказатьПропущенные.ЦветРамки=WebЦвета.Серый;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПропущенные(Режим)

	Если Режим Тогда
		Элементы.ИсторияЗвонков.ОтборСтрок=Новый ФиксированнаяСтруктура("Пропущен", 1); 
	Иначе
		Элементы.ИсторияЗвонков.ОтборСтрок=Неопределено;
	КонецЕсли; 

КонецПроцедуры

//&НаКлиенте
//Процедура ОтборСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	//Если НЕ ЗначениеЗаполнено(УсловияОтбора)Тогда 
//	//	УсловияОтбора = "Равно";
//	//КонецЕсли;
//	//ОтборСтатусНачалоВыбораНаСервере();
//КонецПроцедуры

//&НаСервере
//Процедура ОтборСтатусНачалоВыбораНаСервере()
//	Элементы.ОтборСтатус.СписокВыбора.Очистить();

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	СтатусыЛида.Наименование
//		|ИЗ
//		|	Справочник.СтатусыЛида КАК СтатусыЛида";
// 	РезультатЗапроса = Запрос.Выполнить();
// 	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Элементы.ОтборСтатус.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Наименование,ВыборкаДетальныеЗаписи.Наименование);
//	КонецЦикла;
//КонецПроцедуры

&НаСервере
Процедура ОтборСтатусПриИзмененииНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Лиды,
			"ТекущийСтатус", ЛидОтборПоСтатусу, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЛидОтборПоСтатусу.Пустая());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	ОтборСтатусПриИзмененииНаСервере();
КонецПроцедуры

//&НаКлиенте
//Процедура УсловияОтбораПриИзменении(Элемент)
//	Если ЗначениеЗаполнено(ЛидОтборПоСтатусу) Тогда
//		ОтборСтатусПриИзмененииНаСервере();
//	КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЛидыИзExcel(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаЗагрузкиЛидовИзExcel");
КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗвонковАТСПередУдалением(Элемент, Отказ)
	
	Если НЕ ДоступнаРольАдминистратора() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступнаРольАдминистратора()
	Возврат РольДоступна("АдминистраторСистемы");
КонецФункции

&НаКлиенте
Процедура ОбновитьЭлементыСостоянияПолученияПисем()
	//#7414
	ОбновитьЭлементыСостоянияПолученияПисемНаСервере();
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьЭлементыСостоянияПолученияПисемНаСервере()
	
	ДатаПоследнейПроверки = Константы.ПроверкаРекламныхЭлектронныхЯщиков_ПоследняяДатаПроверки.Получить();
	ПроверкаРекламныхЭлектронныхЯщиков_ПоследняяДатаПроверки = ДатаПоследнейПроверки;
	ПроверкаРекламныхЭлектронныхЯщиков_ПоследняяДатаУспешнойПроверки = Константы.ПроверкаРекламныхЭлектронныхЯщиков_ПоследняяДатаУспешнойПроверки.Получить();
	ПроверкаРекламныхЭлектронныхЯщиков_ТекстОшибки = Константы.ПроверкаРекламныхЭлектронныхЯщиков_ТекстОшибки.Получить();
	// 1. ошибка при работе регламентного задания
	ЕстьОшибкаПолученияПисем = НЕ ПустаяСтрока(ПроверкаРекламныхЭлектронныхЯщиков_ТекстОшибки);
	// 2. проверим запускалось ли само задание
	УстановитьПривилегированныйРежим(Истина);
	Задание = РегламентныеЗаданияСервер.Задание(Метаданные.РегламентныеЗадания.ПроверкаРекламныхЭлектронныхЯщиков);
	Если Задание.Использование Тогда
		ЗаданиеВыполняется = Ложь;
		Если НЕ Задание.ПоследнееЗадание = Неопределено Тогда
			ЗаданиеВыполняется = НЕ ЗначениеЗаполнено(Задание.ПоследнееЗадание.Конец);
		КонецЕсли;
		Если НЕ ЗаданиеВыполняется Тогда
			МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый структура ("Наименование", "Запуск вручную: " + Задание.Наименование));
			Если МассивЗаданий.Количество() > 0 Тогда
				ЗаданиеВыполняется = НЕ ЗначениеЗаполнено(МассивЗаданий[0].Конец);	
			КонецЕсли;
		КонецЕсли;	
		Если НЕ ЗаданиеВыполняется И Задание.Расписание.ТребуетсяВыполнение(ТекущаяДатаСеанса(), ДатаПоследнейПроверки) Тогда
			ЕстьОшибкаПолученияПисем = Истина;
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Элементы.ГруппаПроверкаЭлектронныхЯщиковОшибки.Видимость = ЕстьОшибкаПолученияПисем;
	Элементы.ГруппаПисьма.Картинка = ?(ЕстьОшибкаПолученияПисем, БиблиотекаКартинок.КритическаяОшибка, Новый Картинка());
	
	Элементы.СостояниеПроверкиРекламныхЭлектронныхЯщиков.Картинка = ?(ЕстьОшибкаПолученияПисем, БиблиотекаКартинок.ОформлениеКругКрасный, БиблиотекаКартинок.ОформлениеКругЗеленый);
	
КонецПроцедуры

&НаКлиенте
Процедура СобытияПолученияПисем(Команда)
	//#7414
	ПараметрыФормы = ДанныеОтбораЖурналаРегистрацииПолученияПисем();
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ДанныеОтбораЖурналаРегистрацииПолученияПисем()
	
	Отбор = Новый Структура;
	Отбор.Вставить("СобытиеЖурналаРегистрации", "ФоновоеЗадание.ПроверкаРекламныхЭлектронныхЯщиков");
	Отбор.Вставить("ДатаНачала",                Константы.ПроверкаРекламныхЭлектронныхЯщиков_ПоследняяДатаУспешнойПроверки.Получить());
	Отбор.Вставить("ДатаОкончания",             Константы.ПроверкаРекламныхЭлектронныхЯщиков_ПоследняяДатаПроверки.Получить());
	
	Возврат Отбор;
	
КонецФункции

&НаКлиенте
Процедура МонтажиОтборНомерДоговораПриИзменении(Элемент)
	
	УстановитьОтборМонтажей();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Элементы.ЗаказДоговорыРМКоманднаяПанель.Видимость = (ТекущаяСтраница = Элементы.ГруппаДоговоры);
	Элементы.МонтажиРМКоманднаяПанель.Видимость = (ТекущаяСтраница = Элементы.ГруппаМонтажи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйРасчет(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ЗаказДоговор", Элементы.ЗаказДоговоры.ТекущаяСтрока);
	ОткрытьФорму("Отчет.ПредварительнаяСебестоимостьЗаказДоговора.ФормаОбъекта", ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПроверкиРекламныхЭлектронныхЯщиков(Команда)
	
	// #15742
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.СостоянияПроверки");
	
КонецПроцедуры

