
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыАвторизации = Параметры.ПараметрыАвторизации;
	Если НЕ ТипЗнч(ПараметрыАвторизации) = Тип("Структура") Тогда 
		Сообщить("Необходимо выполнить настройки авторизации Google API.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
функция ПолучитьНастройки()
	
	СтруктураНастроек = новый Структура;	
	СтруктураНастроек.Вставить("ТокенОбновления", ТокенОбновления);
	СтруктураНастроек.Вставить("ТокенДоступа", ТокенДоступа);
	СтруктураНастроек.Вставить("ВремяЖизниТокенаAPI", ВремяЖизниТокенаAPI);
	
	Возврат СтруктураНастроек;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Авторизоваться();
КонецПроцедуры

&НаКлиенте
Процедура Авторизоваться()
	
	ЧастьЗапроса = "response_type=code"+"&";
	ЧастьЗапроса = ЧастьЗапроса + "client_id="+ ПараметрыАвторизации.ИдентификаторКлиента + "&";
	ЧастьЗапроса = ЧастьЗапроса + "redirect_uri=http://localhost" + "&";
	ЧастьЗапроса = ЧастьЗапроса + "access_type=offline"+"&";
	
	//scope для работы с сервисами google
	//подробнее https://developers.google.com/admin-sdk/directory/v1/guides/authorizing
	ЧастьЗапроса = ЧастьЗапроса + "scope=https://www.googleapis.com/auth/drive " + 
								//"https://www.googleapis.com/auth/spreadsheets " + 
								"https://www.googleapis.com/auth/drive.apps.readonly " + 
								"https://www.googleapis.com/auth/drive.file " +
								"https://www.googleapis.com/auth/drive.appdata " + 
								"https://www.googleapis.com/auth/drive.metadata " + 
								"https://www.googleapis.com/auth/drive.metadata.readonly " +
								"https://www.googleapis.com/auth/drive.photos.readonly " +
								"https://www.googleapis.com/auth/drive.readonly ";
								//"https://www.googleapis.com/auth/spreadsheets.readonly"; 
	
	АдресАвторизации = "https://accounts.google.com/o/oauth2/auth?";
	ПолныйАдресАвторизации = АдресАвторизации + ЧастьЗапроса;
    
    HTML_Поле = ПолныйАдресАвторизации;	
	
КонецПроцедуры

&НаКлиенте
Процедура HTML_ПолеДокументСформирован(Элемент)
	
	Попытка
		ПолеДляЧтения = Элементы.HTML_Поле.Документ.documentURI;
	Исключение
		ПолеДляЧтения = Элементы.HTML_Поле.Документ.URLUnencoded;
	КонецПопытки;
	
	ПоискВхождения = СтрНайти(ПолеДляЧтения, "http://localhost/?code=");
	
	Если ПоискВхождения = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	КодДоступа = Сред(ПолеДляЧтения, ПоискВхождения + 23);
	Если НЕ ПолучитьТокены() Тогда 
		Возврат;
	КонецЕсли;	
	
	ЗавершитьАвторизацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьАвторизацию()
	
	Если ЭтаФорма.Открыта() Тогда 
		
		СтруктураНастроек = ПолучитьНастройки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Параметры успешно сохранены.");	
		ЭтаФорма.Закрыть(СтруктураНастроек);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТокены()
	
	СтрокаЗапроса = СтрШаблон("client_id=%1&client_secret=%2&grant_type=authorization_code&code=%3&redirect_uri=http://localhost", 
		ПараметрыАвторизации.ИдентификаторКлиента, 
		ПараметрыАвторизации.СекретныйКодКлиента, 
		КодДоступа);

	Соединение = Новый HTTPСоединение(ПараметрыАвторизации.СерверАвторизации, ПараметрыАвторизации.Порт,,,,, Новый ЗащищенноеСоединениеOpenSSL);

	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/x-www-form-urlencoded");
	
	ЗапросХТТП = Новый HTTPЗапрос(ПараметрыАвторизации.РесурсАвторизации, Заголовки);
	ЗапросХТТП.УстановитьТелоИзСтроки(СтрокаЗапроса);

	Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросХТТП);
	
	Если Не Ответ.КодСостояния = 200 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка получения параметров авторизации: %1", Ответ.ПолучитьТелоКакСтроку()));		
		Возврат Ложь; 
	КонецЕсли;

	Строка = Ответ.ПолучитьТелоКакСтроку();
	
    Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(Строка);

	Фабрика = ФабрикаXDTO.ПрочитатьJSON(Чтение);
	
    Чтение.Закрыть();
	
    ТокенДоступа 		= Фабрика.access_token;
	ТокенОбновления 	= Фабрика.refresh_token;	
	ВремяЖизниТокенаAPI = ТекущаяДата() + Число(Фабрика.expires_in) - 25; //так как есть небольшая задержка между проверкой и работой с google	
	
	Возврат Истина;
	
КонецФункции


