
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	// дополнить регистр реквизитами
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаборыРеквизитовДляКонтроля.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НаборыРеквизитовДляКонтроля КАК НаборыРеквизитовДляКонтроля
		|ГДЕ
		|	НаборыРеквизитовДляКонтроля.Ссылка = &ЭлементСправочника
		|	Или НаборыРеквизитовДляКонтроля.Родитель = &ЭлементСправочника";
	
	Запрос.УстановитьПараметр("ЭлементСправочника", Справочники.НаборыРеквизитовДляКонтроля.Справочник_Номенклатура);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого Реквизит Из Метаданные.Справочники.Номенклатура.Реквизиты Цикл			
			ОбработатьРеквизитОбъекта(Выборка, Реквизит);		
		КонецЦикла;
		ОбработатьРеквизитОбъекта(Выборка, Метаданные.Справочники.Номенклатура.СтандартныеРеквизиты["Родитель"]);		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ЭлементСправочника", Справочники.НаборыРеквизитовДляКонтроля.Справочник_Контрагенты);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого Реквизит Из Метаданные.Справочники.Контрагенты.Реквизиты Цикл			
			ОбработатьРеквизитОбъекта(Выборка, Реквизит);
		КонецЦикла;
		ОбработатьРеквизитОбъекта(Выборка, Метаданные.Справочники.Контрагенты.СтандартныеРеквизиты["Родитель"]);
		ОбработатьРеквизитОбъекта(Выборка, "Контактная информация.Телефон");
		ОбработатьРеквизитОбъекта(Выборка, "Контактная информация.Email");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("НаборыОбъектовПриАктивизацииСтрокиОбработчикОжидания", 0.2, Истина);
КонецПроцедуры

&НаСервере
Процедура ОбработатьРеквизитОбъекта(Выборка, Реквизит)
	
	Если ТипЗнч(Реквизит) = Тип("ОбъектМетаданных") ИЛИ ТипЗнч(Реквизит) = Тип("ОписаниеСтандартногоРеквизита") Тогда		
		ТипРеквизитаБулево = (Реквизит.Тип = Новый ОписаниеТипов("Булево"));
		Если ТипРеквизитаБулево Тогда
			Возврат;		
		КонецЕсли;
		
		ИмяРеквизита = Реквизит.Имя;
		Синоним = Реквизит.Синоним;
	Иначе
		// строка
		ИмяРеквизита = Реквизит;
		Синоним = Реквизит;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.РеквизитыДляКонтроля.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Выборка.Ссылка;
	МенеджерЗаписи.ИмяРеквизита = ИмяРеквизита;
	МенеджерЗаписи.Прочитать();
	
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Если СтрНайти(ИмяРеквизита, "УДАЛИТЬ") = 0 Тогда
			МенеджерЗаписи.Объект = Выборка.Ссылка;
			МенеджерЗаписи.ИмяРеквизита = ИмяРеквизита;
			МенеджерЗаписи.ПредставлениеРеквизита = ?(ПустаяСтрока(Синоним), ИмяРеквизита, Синоним);
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
		// пока закомментировано: если при обновлении для поля будет убран признак обязательного заполнения, 
		// то в регистре этот признак останется
		//Иначе
		//	Если НЕ МенеджерЗаписи.ЗаполнятьОбязательно 
		//		И Реквизит.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
		//		МенеджерЗаписи.ЗаполнятьОбязательно = Истина;
		//		МенеджерЗаписи.Записать(Истина);
		//	КонецЕсли;
	КонецЕсли;
	
	Если НЕ СтрНайти(ИмяРеквизита, "УДАЛИТЬ") = 0 Тогда				
		МенеджерЗаписи = РегистрыСведений.РеквизитыДляКонтроля.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Выборка.Ссылка;
		МенеджерЗаписи.ИмяРеквизита = Сред(ИмяРеквизита, 9); //без "УДАЛИТЬ_"
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборыОбъектовПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("НаборыОбъектовПриАктивизацииСтрокиОбработчикОжидания", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборыОбъектовПриАктивизацииСтрокиОбработчикОжидания()
	
	ОбъектСсылка = ПредопределенноеЗначение("Справочник.НаборыРеквизитовДляКонтроля.ПустаяСсылка");
	ТекущиеДанные = Элементы.НаборыОбъектов.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ОбъектСсылка = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Объект", ОбъектСсылка);
		
КонецПроцедуры

