
&НаСервере
Функция СкачатьОбработкуНаСервере()
	ВременноеИмяФайла = ПолучитьИмяВременногоФайла("epf");
	МакетСДанными = ПолучитьОбщийМакет("ОбработкаВыгрузкиНоменклатурыСХарактеристикамиИзУТ103");
	МакетСДанными.Записать(ВременноеИмяФайла);
	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременноеИмяФайла), ЭтаФорма.УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура СкачатьОбработку(Команда)
	
	
	АдресФайла = СкачатьОбработкуНаСервере();
	ВременноеИмя="Выгрузка номенклатуры с характеристиками из УТ 10.3 по остаткам.epf";
    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	
КонецПроцедуры
