#Область Общее

Процедура ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока, ИмяРеквизитаПроцентРучнойСкидки=Неопределено, ИмяРеквизитаСуммаРучнойСкидки=Неопределено) Экспорт
	
	Если ИмяРеквизитаПроцентРучнойСкидки=Неопределено Тогда 
		ИмяРеквизитаПроцентРучнойСкидки = "ПроцентРучнойСкидки";
	КонецЕсли;
	Если ИмяРеквизитаСуммаРучнойСкидки=Неопределено Тогда 
		ИмяРеквизитаСуммаРучнойСкидки = "СуммаРучнойСкидки";
	КонецЕсли;
	
	Если ТекущаяСтрока.Количество * ТекущаяСтрока.Цена <> 0 Тогда
		ТекущаяСтрока[ИмяРеквизитаПроцентРучнойСкидки] = Окр(100*ТекущаяСтрока[ИмяРеквизитаСуммаРучнойСкидки] / (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена), 2);
	Иначе
		ТекущаяСтрока[ИмяРеквизитаПроцентРучнойСкидки] = 0;
	КонецЕсли;

КонецПроцедуры

Процедура ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока, ИмяРеквизитаПроцентРучнойСкидки=Неопределено, ИмяРеквизитаСуммаРучнойСкидки=Неопределено) Экспорт
	
	Если ИмяРеквизитаПроцентРучнойСкидки=Неопределено Тогда 
		ИмяРеквизитаПроцентРучнойСкидки = "ПроцентРучнойСкидки";
	КонецЕсли;
	
	Если ИмяРеквизитаСуммаРучнойСкидки=Неопределено Тогда 
		ИмяРеквизитаСуммаРучнойСкидки = "СуммаРучнойСкидки";
	КонецЕсли;

	ТекущаяСтрока[ИмяРеквизитаСуммаРучнойСкидки] = Окр(ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * ТекущаяСтрока[ИмяРеквизитаПроцентРучнойСкидки] / 100, 2);
	
КонецПроцедуры

Процедура ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, ИспользуютсяАвтоматическиеСкидки, ИмяРеквизитаСуммаРучнойСкидки = Неопределено, ИспользуютсяСкидки = Истина, ИспользуютсяБонусы = Ложь) Экспорт
	
	Если ИмяРеквизитаСуммаРучнойСкидки=Неопределено Тогда 
		ИмяРеквизитаСуммаРучнойСкидки = "СуммаРучнойСкидки";
	КонецЕсли;
	
	СуммаАвтоматическойСкидки = 0;
	Если ИспользуютсяАвтоматическиеСкидки Тогда
		СуммаАвтоматическойСкидки = ТекущаяСтрока.СуммаАвтоматическойСкидки;
	КонецЕсли;
	
	СуммаРучнойСкидки = 0;
	Если ИспользуютсяСкидки Тогда	
		СуммаРучнойСкидки = ТекущаяСтрока[ИмяРеквизитаСуммаРучнойСкидки];
	КонецЕсли;
	
	СкидкаБонусами = 0;
	Если ИспользуютсяБонусы Тогда	
		СкидкаБонусами = ТекущаяСтрока.СкидкаБонусами;
	КонецЕсли;
	
	Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	ТекущаяСтрока.Сумма = Сумма - СуммаРучнойСкидки - СуммаАвтоматическойСкидки - СкидкаБонусами;
	ТекущаяСтрока.Сумма = Макс(ТекущаяСтрока.Сумма, 0);	

КонецПроцедуры

Процедура ПересчитатьСуммуПоПрайсуВСтрокеТЧ(ТекущаяСтрока) Экспорт
	
	ТекущаяСтрока.СуммаПоПрайсу = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаПоПрайсу;	

КонецПроцедуры

Процедура ПересчитатьЦенуВСтрокеТЧ(ТекущаяСтрока, ИмяРеквизитаСуммаРучнойСкидки = Неопределено, ИспользуютсяСкидки = Истина) Экспорт
	
	Если ИмяРеквизитаСуммаРучнойСкидки=Неопределено Тогда 
		ИмяРеквизитаСуммаРучнойСкидки = "СуммаРучнойСкидки";
	КонецЕсли;
		
	СуммаРучнойСкидки = 0;
	Если ИспользуютсяСкидки Тогда	
		СуммаРучнойСкидки = ТекущаяСтрока[ИмяРеквизитаСуммаРучнойСкидки];
	КонецЕсли;
	
	Если ТекущаяСтрока.Количество = 0 Тогда
		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма + СуммаРучнойСкидки;
	Иначе
		ТекущаяСтрока.Цена = (ТекущаяСтрока.Сумма + СуммаРучнойСкидки) / ТекущаяСтрока.Количество;
	КонецЕсли;

КонецПроцедуры

Процедура ОкруглитьСтрокуТЧ(СтрокаДокумента, ПорядокОкругления, ОкруглятьВБольшуюСторону, ВариантОкругления, 
	ИмяРеквизитаПроцентРучнойСкидки = Неопределено, 
	ИмяРеквизитаСуммаРучнойСкидки = Неопределено,
	ИспользуютсяАвтоматическиеСкидки = Ложь) Экспорт
	
	Если ИмяРеквизитаПроцентРучнойСкидки=Неопределено Тогда 
		ИмяРеквизитаПроцентРучнойСкидки = "ПроцентРучнойСкидки";
	КонецЕсли;
	Если ИмяРеквизитаСуммаРучнойСкидки=Неопределено Тогда 
		ИмяРеквизитаСуммаРучнойСкидки = "СуммаРучнойСкидки";
	КонецЕсли;
	
	СуммаДоОкругления = СтрокаДокумента.Сумма;
	СтрокаДокумента.Сумма = ОбщийМодуль.ОкруглитьЧисло(СтрокаДокумента.Сумма, ПорядокОкругления, ОкруглятьВБольшуюСторону);
	СуммаБезСкидки = СтрокаДокумента.Сумма + СтрокаДокумента[ИмяРеквизитаСуммаРучнойСкидки];
	Если ВариантОкругления = 0 Тогда
		//изменять цену после округления
		Если НЕ СтрокаДокумента.Количество = 0 Тогда
			СтрокаДокумента.Цена = Окр(СуммаБезСкидки / СтрокаДокумента.Количество, 2);
		КонецЕсли;
	Иначе
		//изменять сумму ручной скидки
		ИзменениеСуммыРучнойСкидки = СуммаДоОкругления - СтрокаДокумента.Сумма;
		СтрокаДокумента[ИмяРеквизитаСуммаРучнойСкидки] = СтрокаДокумента[ИмяРеквизитаСуммаРучнойСкидки] + ИзменениеСуммыРучнойСкидки;
		ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(СтрокаДокумента, ИмяРеквизитаПроцентРучнойСкидки, ИмяРеквизитаСуммаРучнойСкидки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС) Экспорт
	СтрокаТабличнойЧасти.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма,
	                                                   УчитыватьНДС, ,
	                                                   УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));	
КонецПроцедуры

Процедура ЗаполнитьКоэффициентЕдиницуИзмерения(СтрокаТабличнойЧасти) Экспорт
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Коэффициент = 1;
		
КонецПроцедуры

Процедура ЗаполнитьКоличествоПоПризнакуПотолка(СтрокаТабличнойЧасти) Экспорт
	
	СтрокаТабличнойЧасти.Количество = ОбщийМодульВызовСервера.КоличествоНоменклатурыПоПризнакуПотолка(СтрокаТабличнойЧасти.Номенклатура);
			
КонецПроцедуры

Процедура ЗаполнитьПризнакИспользованияХарактеристик(СтрокаТабличнойЧасти) Экспорт
	
	СтрокаТабличнойЧасти.ХарактеристикиИспользуются = ОбщийМодульВызовСервера.ИспользуютсяХарактеристикиНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
			
КонецПроцедуры

Процедура ЗаполнитьСтавкуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, СтавкаНДСПоУмолчанию, УчитыватьНДС) Экспорт

	СтрокаТабличнойЧасти.СтавкаНДС = ?(УчитыватьНДС, СтавкаНДСПоУмолчанию, ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
	
КонецПроцедуры

// Заполняет поле СуммаВсего в зависимости от признака включения НДС в цену.
//
// Параметры:
// Таблица         - ДанныеФормыКоллекция - таблица, в которой необходимо заполнить колонку СуммаВсего.
// ЦенаВключаетНДС - Булево - признак включения НДС в цену.
//
Процедура ЗаполнитьСуммуВсегоВТаблице(Таблица, ЦенаВключаетНДС) Экспорт
	
	Для Каждого СтрокаТабличнойЧасти Из Таблица Цикл
		ЗаполнитьСуммуВсегоВСтрокеТаблицы(СтрокаТабличнойЧасти, ЦенаВключаетНДС);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСуммуВсегоВТаблице()

// Заполняет поле СуммаВсего в зависимости от признака включения НДС в цену.
//
// Параметры:
// СтрокаТаблицы   - ДанныеФормыЭлементКоллекции - Строка таблицы, в которой необходимо заполнить поле СуммаВсего.
// ЦенаВключаетНДС - Булево - признак включения НДС в цену.
//
Процедура ЗаполнитьСуммуВсегоВСтрокеТаблицы(СтрокаТабличнойЧасти, ЦенаВключаетНДС) Экспорт
	
	Если ЦенаВключаетНДС Тогда
		СтрокаТабличнойЧасти.СуммаВсего = СтрокаТабличнойЧасти.Сумма;
	Иначе
		СтрокаТабличнойЧасти.СуммаВсего = СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.СуммаНДС;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаТабличныхЧастей_РаспределениеПлатежа

Процедура ПересчитатьИзВалютыВВалютуВСтрокеТЧ(ТекущаяСтрока, Знач Валюта, Знач Дата) Экспорт
	
	ТекущаяСтрока.СуммаВВалютеДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Валюта, ТекущаяСтрока.ВалютаДокумента, Дата, ТекущаяСтрока.Сумма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаТабличныхЧастей_ЗаказДоговор

Процедура ПроставитьИРассчитатьДанныеПоПрайсу(ТекущаяСтрока) Экспорт
	
	ТекущаяСтрока.ЦенаПоПрайсу  = ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаПоПрайсу = ТекущаяСтрока.ЦенаПоПрайсу * ТекущаяСтрока.Количество;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаТабличныхЧастей_ЗаказПокупателя

Процедура ПересчитатьЦенуПоЦенеВалВСтрокеТЧ(СтрокаТабличнойЧасти, СтруктураДанные) Экспорт
	
	СтрокаТабличнойЧасти.Цена = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(СтруктураДанные.ДопВалюта, СтруктураДанные.Валюта, СтруктураДанные.Дата, СтрокаТабличнойЧасти.ЦенаВал);
	
КонецПроцедуры

Процедура ПересчитатьЦенуВалПоЦенеВСтрокеТЧ(СтрокаТабличнойЧасти, СтруктураДанные) Экспорт 	
	
	// обратный пересчет
	ЦенаОбратная = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(СтруктураДанные.ДопВалюта, СтруктураДанные.Валюта, СтруктураДанные.Дата, 1);
	Если ЦенаОбратная <> 0 Тогда
		СтрокаТабличнойЧасти.ЦенаВал = СтрокаТабличнойЧасти.Цена / ЦенаОбратная;
	Иначе
		СтрокаТабличнойЧасти.ЦенаВал = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаТабличныхЧастей_УстановкаЦен

Процедура ЗаполнитьИндексКартинкиСтрокиДереваЦен(СтрокаДереваЦен) Экспорт
	
	Если ТипЗнч(СтрокаДереваЦен) = Тип("ДанныеФормыЭлементДерева") Тогда
		Если СтрокаДереваЦен.ПолучитьРодителя() = Неопределено Тогда
			СтрокаДереваЦен.ИндексКартинки = 0;
			Если ЗначениеЗаполнено(СтрокаДереваЦен.Номенклатура) И ОбщийМодульВызовСервера.ОбъектПомеченНаУдаление(СтрокаДереваЦен.Номенклатура) Тогда
				СтрокаДереваЦен.ИндексКартинки = 1;
			КонецЕсли;
		Иначе
			СтрокаДереваЦен.ИндексКартинки = 2;
			Если ЗначениеЗаполнено(СтрокаДереваЦен.ХарактеристикаНоменклатуры) И ОбщийМодульВызовСервера.ОбъектПомеченНаУдаление(СтрокаДереваЦен.ХарактеристикаНоменклатуры) Тогда
				СтрокаДереваЦен.ИндексКартинки = 3;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(СтрокаДереваЦен) = Тип("СтрокаДереваЗначений") Тогда
		Если СтрокаДереваЦен.Родитель = Неопределено Тогда
			СтрокаДереваЦен.ИндексКартинки = 0;
			Если ЗначениеЗаполнено(СтрокаДереваЦен.Номенклатура) И ОбщийМодульВызовСервера.ОбъектПомеченНаУдаление(СтрокаДереваЦен.Номенклатура) Тогда
				СтрокаДереваЦен.ИндексКартинки = 1;
			КонецЕсли;
		Иначе
			СтрокаДереваЦен.ИндексКартинки = 2;
			Если ЗначениеЗаполнено(СтрокаДереваЦен.ХарактеристикаНоменклатуры) И ОбщийМодульВызовСервера.ОбъектПомеченНаУдаление(СтрокаДереваЦен.ХарактеристикаНоменклатуры) Тогда
				СтрокаДереваЦен.ИндексКартинки = 3;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

