
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСписокГородовИнтерактивно(ПараметрыОперации, АдресРезультата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛОЖЬ КАК Пометка,
	|	АдресныеОбъектыСубъекты.Наименование + "" "" + АдресныеОбъектыСубъекты.Сокращение КАК СубъектРФ,
	|	АдресныеОбъектыГорода.Идентификатор КАК УИ,
	|	АдресныеОбъектыГорода.КодКЛАДР КАК КодКЛАДР,
	|	АдресныеОбъектыГорода.Наименование КАК Город,
	|	ВЫБОР
	|		КОГДА АдресныеОбъектыРодитель.Идентификатор = АдресныеОбъектыСубъекты.Идентификатор
	|			ТОГДА АдресныеОбъектыГорода.Наименование + "" "" + АдресныеОбъектыГорода.Сокращение
	|		ИНАЧЕ АдресныеОбъектыГорода.Наименование + "" "" + АдресныеОбъектыГорода.Сокращение + "" ("" + АдресныеОбъектыРодитель.Наименование + "" "" + АдресныеОбъектыРодитель.Сокращение + "")""
	|	КОНЕЦ КАК ГородПредставление,
	|	4 КАК Уровень
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыГорода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыСубъекты
	|		ПО (АдресныеОбъектыСубъекты.Уровень = 1)
	|			И (АдресныеОбъектыСубъекты.КодСубъектаРФ = АдресныеОбъектыГорода.КодСубъектаРФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыРодитель
	|		ПО (АдресныеОбъектыРодитель.Идентификатор = АдресныеОбъектыГорода.РодительскийИдентификатор)
	|ГДЕ
	|	АдресныеОбъектыГорода.Уровень В (4, 6)
	|	И НЕ АдресныеОбъектыРодитель.Уровень В (4, 6)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СубъектРФ,
	|	Город
	|ИТОГИ
	|	1 КАК Уровень
	|ПО
	|	СубъектРФ
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛОЖЬ КАК Пометка,
	|	АдресныеОбъектыСубъекты.Наименование + "" "" + АдресныеОбъектыСубъекты.Сокращение КАК СубъектРФ,
	|	АдресныеОбъектыГорода.Идентификатор КАК УИ,
	|	АдресныеОбъектыГорода.РодительскийИдентификатор КАК УИРодителя,
	|	АдресныеОбъектыГорода.КодКЛАДР КАК КодКЛАДР,
	|	АдресныеОбъектыГорода.Наименование КАК Город,
	|	АдресныеОбъектыГорода.Наименование + "" "" + АдресныеОбъектыГорода.Сокращение КАК ГородПредставление,
	|	4 КАК Уровень
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыГорода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыСубъекты
	|		ПО (АдресныеОбъектыСубъекты.Уровень = 1)
	|			И (АдресныеОбъектыСубъекты.КодСубъектаРФ = АдресныеОбъектыГорода.КодСубъектаРФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыРодитель
	|		ПО (АдресныеОбъектыРодитель.Идентификатор = АдресныеОбъектыГорода.РодительскийИдентификатор)
	|ГДЕ
	|	АдресныеОбъектыГорода.Уровень В (4, 6)
	|	И АдресныеОбъектыРодитель.Уровень В (4, 6)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СубъектРФ,
	|	Город
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	//ДеревоГородов = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ДеревоГородов = РезультатЗапроса[0].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ГНППодчиненныеГНП = РезультатЗапроса[1].Выгрузить();
	
	СтрокиСубъектов = ДеревоГородов.Строки;
	Для каждого СтрокаСубъекта из СтрокиСубъектов Цикл
		СтрокиГНП = СтрокаСубъекта.Строки;
		Для каждого СтрокаГНП из СтрокиГНП Цикл
			СтруктураПоиска = Новый Структура("УИРодителя, СубъектРФ", СтрокаГНП.УИ, СтрокаГНП.СубъектРФ);
			НС = ГНППодчиненныеГНП.НайтиСтроки(СтруктураПоиска);
			Если НС.Количество() > 0 Тогда
				СтрокиПодчиненныхГНП = СтрокаГНП.Строки;
				для каждого СтрокаНс из НС Цикл
					НоваяСтрока =  СтрокиПодчиненныхГНП.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНС);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	ПараметрыОбмена = Новый Структура("ДеревоГородов", ДеревоГородов);	
	ПоместитьВоВременноеХранилище(ПараметрыОбмена, АдресРезультата);	
	
КонецПроцедуры

Функция ДобавитьИзКлассификатора(МассивГородов, ИспользуетсяВРознице, ИспользуетсяВПроизводстве) Экспорт
	
	Добавлено = Ложь;
	
	Для каждого ЭлементГорода из МассивГородов Цикл
		НайденныйГород = Справочники.Города.НайтиПоНаименованию(ЭлементГорода.Город, Истина);
		Если НЕ ЗначениеЗаполнено(НайденныйГород) ТОгда
			СпрОбъект = Справочники.Города.СоздатьЭлемент();
			СпрОбъект.Наименование = ЭлементГорода.Город;
			СпрОбъект.КодКЛАДР = ЭлементГорода.КодКЛАДР;
			СпрОбъект.ИспользуетсяВРознице = ИспользуетсяВРознице;
			СпрОбъект.ИспользуетсяВПроизводстве = ИспользуетсяВПроизводстве;
			СпрОбъект.Записать();
			Добавлено = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Добавлено;

КонецФункции

#КонецОбласти

#КонецЕсли