
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем условие уникальности наименования
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Города.Наименование
	|ИЗ
	|	Справочник.Города КАК Города
	|ГДЕ
	|	Города.Наименование = &Наименование
	|	И Города.Ссылка <> &Ссылка
	|";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
	    Сообщить("Город с таким наименованием уже существует. Введите другое наименование.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
