
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОписаниеТипа = Параметры.ОписаниеТипа;
	ТипРеквизита = ОписаниеТипа.Типы()[0];
	Элементы.СЗЗначение.ОграничениеТипа = ОписаниеТипа;
	Для Каждого Эл Из Параметры.СписокЗначений Цикл
		Новстр = СЗ.Добавить();
		Новстр.Значение = Эл.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	СписокЗначений = Новый СписокЗначений;
	Для Каждого Стр Из СЗ Цикл
		СписокЗначений.Добавить(Стр.Значение, "" + Стр.Значение);
	КонецЦикла;
	ЭтаФорма.ВладелецФормы.ТекущийЭлемент.ТекущиеДанные.Значение = СписокЗначений;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СЗЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДанные = Элементы[Элемент.Родитель.Имя].ТекущиеДанные;
	
	//Особенность с подчиненными справочниками которые просто так открыть нельзя
	СодержитБС = ТипРеквизита = Тип("СправочникСсылка.БанковскиеСчета"); 
	Если СодержитБС Тогда
		СтандартнаяОбработка = ложь;
		Если ТипРеквизита = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			Попытка
				//обычное приложение
				ф = ПолучитьФорму("Справочник.БанковскиеСчета.ФормаВыбора");
				ф.Отбор.Владелец.Значение = ВернутьЛюбогоКонтрагента();
				ф.Отбор.Владелец.Использование = Ложь;
				рез = ф.ОткрытьМодально();
				Если Рез <> Неопределено Тогда
					//ЗаполнитьнаСервере(Рез);
					Элементы.СЗ.ТекущиеДанные.Значение = Рез;
				КонецЕсли;
				Возврат;
			Исключение
				//управляемое приложение
				СтандартнаяОбработка = Истина;
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипРеквизита); 
				Элемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	//

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьнаСервере(Рез);
	Элементы.СЗ.ТекущиеДанные.Значение = Рез;
КонецПроцедуры

Функция ВернутьЛюбогоКонтрагента()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура Добавить(Команда)
	Новстр = СЗ.Добавить();
	Элементы.СЗ.ТекущаяСтрока  = СЗ[СЗ.Количество()-1].ПолучитьИдентификатор();
КонецПроцедуры
