
Процедура СформироватьДвиженияПлатежкиПоСтатусам(ЭтотОбъект, ТЗ_ЗаказыНаПриобретение ,ЭтоИсходящаяПлатежка = истина)
	
	ЭтоВПС = ТипЗнч(ЭтотОбъект) = тип("ДокументОбъект.КСУ_ВнедоходноеПоступлениеСредств");
		
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("коэф", ?(ЭтоИсходящаяПлатежка, 1, -1));
	Запрос.УстановитьПараметр("ТЗ_ЗаказыНаПриобретение", ТЗ_ЗаказыНаПриобретение);
	Запрос.УстановитьПараметр("НаДату", КонецДня(ЭтотОбъект.Дата));//Списываем платежки на дату ФП, даже если ФП позже по времени
	Запрос.УстановитьПараметр("ДатаДокумента", ЭтотОбъект.Дата);
	
	//статусы зкаказов
	Запрос.Текст = "ВЫБРАТЬ
	               |	тз.зп КАК Заказ,
	               |	&коэф * тз.Сумма КАК Сумма
	               |ПОМЕСТИТЬ ТЗ_Заказы
	               |ИЗ
	               |	&ТЗ_ЗаказыНаПриобретение КАК тз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОборотыРезерв.ЗП КАК Заказ,
	               |	СУММА(ОборотыРезерв.СуммаБезналРасход) КАК Оплачено,
	               |	СУММА(ОборотыРезерв.СуммаБезналПриход) КАК Одобрено
	               |ПОМЕСТИТЬ Оплаты
	               |ИЗ
	               |	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, &НаДату, Регистратор, ) КАК ОборотыРезерв
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ_Заказы КАК ТЗ_Заказы
	               |		ПО ОборотыРезерв.ЗП = ТЗ_Заказы.Заказ
	               |ГДЕ
	               |	ОборотыРезерв.Регистратор <> &Регистратор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОборотыРезерв.ЗП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ_Заказы.Заказ КАК Заказ,
	               |	ТЗ_Заказы.Сумма КАК СуммаВПлатежке,
	               |	ТЗ_Заказы.Сумма + ЕСТЬNULL(Оплаты.Оплачено, 0) КАК Оплачено,
	               |	ЕСТЬNULL(Оплаты.Одобрено, 0) КАК Одобрено,
	               |	ИА_ЗаказНаПриобретение.Сумма КАК СуммаЗаказа
	               |ИЗ
	               |	ТЗ_Заказы КАК ТЗ_Заказы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Оплаты КАК Оплаты
	               |		ПО (Оплаты.Заказ = ТЗ_Заказы.Заказ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИА_ЗаказНаПриобретение КАК ИА_ЗаказНаПриобретение
	               |		ПО ТЗ_Заказы.Заказ = ИА_ЗаказНаПриобретение.Ссылка
	               |ГДЕ
	               |	ТЗ_Заказы.Сумма <> 0";
	Выборка = запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		дв = ЭтотОбъект.Движения.ИА_ИсторияСтатусовЗВС.Добавить();
		
		ДатаДвижения = ЭтотОбъект.Дата;
		
		дв.Период = ДатаДвижения;
		дв.ЗВС = выборка.Заказ;
		Если выборка.Одобрено >= выборка.СуммаЗаказа Тогда // одобрено полностью  
			дв.Статус = ?(выборка.Оплачено = выборка.Одобрено, Перечисления.ИА_СостояниеЗаказа.ОдобренПолностью_ВсёВыплачено, Перечисления.ИА_СостояниеЗаказа.ОдобренПолностью_ЧастичныеВыплаты);
		Иначе // одобрен частично
			дв.Статус = ?(выборка.Оплачено = выборка.Одобрено, Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_ВсёВыплачено, Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_ЧастичныеВыплаты);
		КонецЕсли;
		
		ЗаписьЛенты = РегистрыСведений.КСУ_ЛентаСобытий.СоздатьМенеджерЗаписи();
		ЗаписьЛенты.ПериодСобытия = ЭтотОбъект.Дата;
		ЗаписьЛенты.ДатаСобытия = ТекущаяДата();
		ЗаписьЛенты.Объект = выборка.Заказ;
		//ЗаписьЛенты.Событие = строка(дв.Статус) + ". Сумма " +?(ЭтоВПС,"возврата оплаты ","") + формат(выборка.СуммаВПлатежке,"ЧДЦ=2; ЧН=");
		Если не ЭтоИсходящаяПлатежка Тогда
			ЗаписьЛенты.Событие = "Возврат средств. " + формат(-выборка.СуммаВПлатежке,"ЧДЦ=2; ЧН=") + " внедоходное поступление средств №" + ЭтотОбъект.номер;
		Иначе
			ЗаписьЛенты.Событие = "Выплата по заказу. " + формат(выборка.СуммаВПлатежке,"ЧДЦ=2; ЧН=") + " выплата №" + ЭтотОбъект.номер;
		КонецЕсли;
		ЗаписьЛенты.Детали = дв.Статус;
		Попытка 
			Если ЗначениеЗаполнено(ЭтотОбъект.Ответственный) Тогда
				ЗаписьЛенты.Ответственный = ЭтотОбъект.Ответственный;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если ЗаписьЛенты.Ответственный.пустая() Тогда
			ЗаписьЛенты.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		ЗаписьЛенты.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ИА_ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Экспорт
	
	ЭтотОбъект.Движения.ИА_СредстваНаФондах.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_СредстваНаФондах.Очистить();
	
	ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.Очистить();
	
	ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.Очистить();
	
	ЭтотОбъект.Движения.ИА_ИсторияСтатусовЗВС.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_ИсторияСтатусовЗВС.Очистить();
	
	//ЭтотОбъект.Движения.КСУ_ЛентаСобытий.Записывать = Истина;
	//ЭтотОбъект.Движения.КСУ_ЛентаСобытий.Очистить();
	
	
	ДатаОплаты = ЭтотОбъект.Дата;
	Попытка
		Если не ЭтотОбъект.Оплачено Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ДатаОплаты) и НачалоДня(ЭтотОбъект.ДатаОплаты)<>НачалоДня(ЭтотОбъект.Дата) Тогда
			ДатаОплаты = КонецДня(ЭтотОбъект.ДатаОплаты);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Если не ЭтотОбъект.ПроведеноБанком Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	СтруктураНастройкиРеквизитов = ИА_ФП_ПовторИсп.ПолучитьЗначениеКонстанты_ФП_НастройкиРеквизитов(); 
	
	ФППоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ЗапретПустых = Константы.КСУ_ЗапретитьПроведениеПлатежкиБезФондовИЗаказов.Получить();
	ИспПодр = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	ОрганизацияФП = ПолучитьГоловнуюОрганизацию(ЭтотОбъект.Организация);
	
	Попытка
		ТипРКО = Тип("ДокументОбъект.РасходныйКассовыйОрдер");
	Исключение
		Попытка
			ТипРКО = Тип("ДокументОбъект.РасходИзКассы");
		Исключение
			Сообщ = Новый СообщениеПользователю;
			Сообщ.Текст = "Не определен документ Расхода ФП по Налу";
			Если Константы.ИА_ФП_РазделятьНалИБезнал.Получить() Тогда 
				Сообщ.Сообщить();
			КонецЕсли;
			ТипРКО = Неопределено;
		КонецПопытки;
	КонецПопытки;
	
	//проведение по заказам
	ПроводкаНал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить() и ТипЗнч(ЭтотОбъект) = ТипРКО;	
	СуммаДокумента = 0;
	
	Попытка
		Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.КСУ_ФормальнаяВыплата") Тогда
			СуммаДокумента = ЭтотОбъект.СуммаДокумента;
		иначе 	
			СуммаДокумента = ЭтотОбъект.Сумма;
		КонецЕсли;	
	Исключение
		
	КонецПопытки;
	
	Если ЗапретПустых и ЭтотОбъект.ИА_ЗаказыНаПриобретение.Количество() = 0 И ЭтотОбъект.ИА_Фонды.Количество() = 0 Тогда
		Сообщ = Новый СообщениеПользователю;
		Сообщ.Текст = "Запрещено проводить платежки без фондов и заказов КСУ";
		Сообщ.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ИА_Фонды.Количество() > 0 И НЕ (ИА_ПраваС.ЗначениеПраваТекПользователя("ВыплатаНапрямуюСФондов")
		ИЛИ ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_ПолныеПрава")) Тогда
		Сообщ = Новый СообщениеПользователю;
		Сообщ.Текст = "У вас нет прав на выплату напрямую с фондов!";
		Сообщ.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если СуммаДокумента = 0 ИЛИ (ЭтотОбъект.ИА_ЗаказыНаПриобретение.Количество() = 0 И ЭтотОбъект.ИА_Фонды.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;
	
	ФормальнаяВыплата = ТипЗнч(ЭтотОбъект) = тип("ДокументОбъект.КСУ_ФормальнаяВыплата");
	Если ФормальнаяВыплата Тогда
		ПересчитыватьВВалюту = Ложь;
	Иначе
		ВалютаУПР = Константы[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаУПР].Получить();
		ВалютаДокумента = ЭтотОбъект[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаДокумента];
		
		Если ВалютаДокумента = ВалютаУПР Тогда
			ПересчитыватьВВалюту = Ложь;
			СтрокаКурсыВалют = Ложь;
		Иначе
			ПересчитыватьВВалюту = Истина;
			СтрокаКурсыВалют = ПолучитьКурсКратностьВалют(ЭтотОбъект.дата,ВалютаУПР, ВалютаДокумента);
		КонецЕсли;
	КонецЕсли;
	
	Отказ = ДатаВыплатыНеКорректна(ЭтотОбъект.Ссылка);
	
	СуммаДокумента = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(ЭтотОбъект.СуммаДокумента, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), СуммаДокумента);					
	
	ПоФондам = ЭтотОбъект.ИА_Фонды.Количество()>0;	
	Запрос = Новый Запрос;
	
	КонтрольРасходов = Константы.ИА_ФП_КонтрольРасходов.Получить();
	
	ТЗ_Фонды = ЭтотОбъект.ИА_Фонды.Выгрузить();
	ТЗ_Фонды.Свернуть("Фонд,Подразделение","Сумма");
	
	Для каждого стр из ТЗ_Фонды Цикл
		Запрос.Текст = "ВЫБРАТЬ
		|	СредстваНаФондахОстатки.СуммаБезналОстаток - ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток, 0) КАК СуммаОстаток,
		|	СредстваНаФондахОстатки.Фонд,
		|	СредстваНаФондахОстатки.Подразделение
		|ИЗ
		|	РегистрНакопления.ИА_СредстваНаФондах.Остатки(
		|			&НаДату,
		|			Фонд = &Фонд
		|				И (Организация = &Организация или &НеРазделять)
		|				И Подразделение = &Подразделение) КАК СредстваНаФондахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(
		|				&НаДату,
		|				Фонд = &Фонд
		|					И (Организация = &Организация или &НеРазделять)
		|					И Подразделение = &Подразделение) КАК ИА_СредстваВРезервеНаФондахОстатки
		|		ПО (ИСТИНА)";
		Запрос.УстановитьПараметр("НаДату", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Организация", ОрганизацияФП);
		Запрос.УстановитьПараметр("НеРазделять", не ФППоОрганизациям);
		Запрос.УстановитьПараметр("Фонд", стр.Фонд);
		Запрос.УстановитьПараметр("Подразделение", стр.Подразделение);
		
		Если ПроводкаНал Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СуммаБезнал", "СуммаНал");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		//ДенегОсталось = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
		ИтогоПогасилиВал = 0;
		ИтогоПогасили = 0;
		ДенегОсталосьПогаситьВал = стр.Сумма;
		
		Пока Выборка.Следующий() И ДенегОсталосьПогаситьВал > 0 Цикл
			
			//Сальдо = Выборка.СуммаОстаток;
			
			СальдоВал = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(Выборка.СуммаОстаток, ВалютаУПР, ВалютаДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КратностьУпрУчета, СтрокаКурсыВалют.КратностьДокумента), Выборка.СуммаОстаток);
			ГасимВал = Мин(СальдоВал, ДенегОсталосьПогаситьВал);
			
			Фонд = Выборка.Фонд;
			
			Проводка = ЭтотОбъект.Движения.ИА_СредстваНаФондах.ДобавитьРасход();
			Проводка.Период     = ДатаОплаты;
			Если ФППоОрганизациям Тогда
				Проводка.Организация = ОрганизацияФП;
			КонецЕсли;
			Проводка.Фонд 	= Фонд;
			Проводка.Подразделение 	= Выборка.Подразделение;
			
			Гасим = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(ГасимВал, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), ГасимВал);
			Проводка.СуммаБезНал = мин(Гасим, Выборка.СуммаОстаток);
			Проводка.СуммаВал = ГасимВал;
			
			Проводка.операция = Перечисления.КСУ_ОперацииПоФондам.ПрямаяВыплатаИзФонда;
			Если ФормальнаяВыплата ТОгда			
				Проводка.ПояснениеТекст = ЭтотОбъект.Комментарий;				
	    	КонецЕсли;
			
			ИтогоПогасилиВал = ИтогоПогасилиВал + ГасимВал;
			ИтогоПогасили = ИтогоПогасили + Проводка.СуммаБезНал;
			ДенегОсталосьПогаситьВал = ДенегОсталосьПогаситьВал - ГасимВал;
			
		КонецЦикла;
		
		Если ИтогоПогасилиВал < стр.Сумма Тогда
			//Сообщить("На фонде недостаточно средств. Затребовано "+ ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма) + ", возможно списать "+ ИтогоПогасили);
			Потр = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
			Сообщить("Недостаточно средств на фонде "+ стр.Фонд +". Сумма выплаты " + формат(Потр,"ЧДЦ=2; ЧН=") + ", остаток на фонде "  + формат(ИтогоПогасили,"ЧДЦ=2; ЧН=") + ", превышение " + формат(Потр-ИтогоПогасили,"ЧДЦ=2; ЧН=") + ".");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ТЗ_ЗаказыНаПриобретение = ЭтотОбъект.ИА_ЗаказыНаПриобретение.Выгрузить();
	ТЗ_ЗаказыНаПриобретение.Свернуть("ЗП","Сумма");
	
	// Статусы и лента
	СформироватьДвиженияПлатежкиПоСтатусам(ЭтотОбъект, ТЗ_ЗаказыНаПриобретение, Истина);
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("НаДату", КонецДня(ЭтотОбъект.Дата));//Списываем платежки на дату ФП, даже если ФП позже по времени
	
	//заказы по фнодам, резервам
	ПроблемыФондов = новый ТаблицаЗначений;
	ПроблемыФондов.Колонки.Добавить("Фонд");
	ПроблемыФондов.Колонки.Добавить("Остаток");
	ПроблемыФондов.Колонки.Добавить("Потребность");
	
	Для каждого стр из ТЗ_ЗаказыНаПриобретение Цикл
		ЗП = стр.ЗП;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИА_СредстваВРезервеНаФондахОбороты.Фонд КАК Фонд,
		|	ИА_СредстваВРезервеНаФондахОбороты.Подразделение КАК Подразделение,
		|	ИА_СредстваВРезервеНаФондахОбороты.Организация КАК Организация,
		|	СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналОборот) КАК ОстатокПоЗаказу,
		|	МАКСИМУМ(ЕСТЬNULL(СредстваНаФондахОстатки.СуммаБезналОстаток,0)) КАК ОстатокФонда
		|ИЗ
		|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, &НаДату, Регистратор, ЗП = &ЗП) КАК ИА_СредстваВРезервеНаФондахОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваНаФондах.Остатки(
		|				&НаДату1,
		|				Организация = &Организация
		|					ИЛИ &НеРазделять) КАК СредстваНаФондахОстатки
		|		ПО (ИА_СредстваВРезервеНаФондахОбороты.Подразделение = СредстваНаФондахОстатки.Подразделение или не &ИспПодр)
		|			И ИА_СредстваВРезервеНаФондахОбороты.Фонд = СредстваНаФондахОстатки.Фонд
		|ГДЕ
		|	ИА_СредстваВРезервеНаФондахОбороты.Регистратор <> &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ИА_СредстваВРезервеНаФондахОбороты.Фонд,
		|	ИА_СредстваВРезервеНаФондахОбороты.Подразделение,
		|	ИА_СредстваВРезервеНаФондахОбороты.Организация";
		
		
		Запрос.УстановитьПараметр("ЗП", ЗП);
		Запрос.УстановитьПараметр("НаДату1", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("ИспПодр", ИспПодр);
		Запрос.УстановитьПараметр("Организация", ОрганизацияФП);
		Запрос.УстановитьПараметр("НеРазделять", не ФППоОрганизациям);
		
		Если ПроводкаНал Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СуммаБезнал", "СуммаНал");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		//ДенегОсталось = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
		ИтогоПогасили = 0;
		ИтогоПогасилиВал = 0; 
		ОстатокФонда = 0;
		ДенегОсталосьПогаситьВал = стр.Сумма;
		
		Пока Выборка.Следующий() И ДенегОсталосьПогаситьВал > 0 Цикл
			ОстатокФонда = Выборка.ОстатокФонда;
			//Сальдо = Выборка.ОстатокПоЗаказу;
			//Гасим = Мин(Сальдо, ДенегОсталось);
			
			СальдоВал = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(Выборка.ОстатокПоЗаказу, ВалютаУПР, ВалютаДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КратностьУпрУчета, СтрокаКурсыВалют.КратностьДокумента), Выборка.ОстатокПоЗаказу);
			ГасимВал = Мин(СальдоВал, ДенегОсталосьПогаситьВал);
			
			Гасим = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(ГасимВал, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), ГасимВал);
			Гасим = мин(Гасим, Выборка.ОстатокПоЗаказу);
			
			Фонд = Выборка.Фонд;
			Подразделение = Выборка.Подразделение;
			
			
			Проводка = ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.ДобавитьРасход();
			Проводка.Период     = ДатаОплаты;
			Если ФППоОрганизациям Тогда
				Проводка.Организация = ОрганизацияФП;
			КонецЕсли;
			Проводка.Фонд 	= Фонд;
			Проводка.Подразделение 	= Подразделение;
			Проводка.ЗП = ЗП;
			Если ПроводкаНал Тогда
				Проводка.СуммаНал = Гасим;
			Иначе
				Проводка.СуммаБезНал = Гасим;
			КонецЕсли;
			
			
			Проводка = ЭтотОбъект.Движения.ИА_СредстваНаФондах.ДобавитьРасход();
			Проводка.Период     = ДатаОплаты;
			Если ФППоОрганизациям Тогда
				Проводка.Организация = ОрганизацияФП;
			КонецЕсли;
			Проводка.Фонд 	= Фонд;       
			Проводка.Подразделение 	= Подразделение;
			
			Проводка.СуммаБезНал = Гасим;
			Проводка.СуммаВал = ГасимВал;
			
			Проводка.операция = Перечисления.КСУ_ОперацииПоФондам.ВыплатаПоЗаказу;
			Если ФормальнаяВыплата ТОгда			
				Проводка.ПояснениеТекст = ЭтотОбъект.Комментарий;				
				Проводка.ПояснениеСсылка = ЗП; 
	    	КонецЕсли;
			
			ИтогоПогасилиВал = ИтогоПогасилиВал + ГасимВал;
			ИтогоПогасили = ИтогоПогасили + Проводка.СуммаБезНал;
			ДенегОсталосьПогаситьВал = ДенегОсталосьПогаситьВал - ГасимВал;
		КонецЦикла;
		
		Потр = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
		Если ИтогоПогасилиВал < стр.Сумма Тогда			
			Сообщить("Недостаточно одобренных средств на заказе №"+ЗП.Номер+". Сумма выплаты " + формат(Потр,"ЧДЦ=2; ЧН=") + ", остаток одобренных средств "  + формат(ИтогоПогасили,"ЧДЦ=2; ЧН=") + ", превышение " + формат(Потр-ИтогоПогасили,"ЧДЦ=2; ЧН=") + ".");		
			Отказ = Истина;
		КонецЕсли;
		
		Если ОстатокФонда < ИтогоПогасили И КонтрольРасходов Тогда
			Сообщить("Недостаточно средств на фонде "+ ЗП.фонд +" заказ №"+ЗП.Номер+".");
			Отказ = Истина;
			
			нстр = ПроблемыФондов.Найти(ЗП.фонд);
			Если нстр = Неопределено тогда
				нстр = ПроблемыФондов.Добавить();
				нстр.Фонд = ЗП.фонд;
				нстр.Остаток = ОстатокФонда;
				нстр.Потребность = 0;
			КонецЕсли;
			нстр.Потребность = нстр.Потребность + Потр;
		КонецЕсли;
		
		
		Проводка = ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.ДобавитьРасход();
		Проводка.Период     = ДатаОплаты;
		Проводка.Организация = ЗП.Организация;
		Проводка.ЗП 	= ЗП;       
		Проводка.Сумма = ИтогоПогасили;
		
	КонецЦикла;
	
	Если ПроблемыФондов.Количество() >0 Тогда
		Сообщить("При проведении выплаты по заказам обнаружены следующие ошибки:");
	КонецЕсли;
	Для каждого стрПр из ПроблемыФондов цикл
		Сообщить("Недостаточно средств на фонде "+ стрПр.Фонд +". Требуется на выплаты " + формат(стрПр.Потребность,"ЧДЦ=2; ЧН=") + ", остаток на фонде "  + формат(стрПр.Остаток,"ЧДЦ=2; ЧН=") + ", превышение " + формат(стрПр.Потребность-стрПр.Остаток,"ЧДЦ=2; ЧН=") + ".");
	КонецЦикла;
	
	// проведение по спецдоходу
	ЭтотОбъект.Движения.ИА_ДоходыБудущихПериодов.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_ДоходыБудущихПериодов.Очистить();
	фСпецдохода = Константы.ИА_ФП_ФондДоходовБП.Получить();
	Для каждого стр из ЭтотОбъект.ИА_Фонды Цикл
		Если стр.Фонд = фСпецдохода Тогда
			Если не (ЗначениеЗаполнено(стр.Источник) И ЗначениеЗаполнено(стр.ВидДохода)) Тогда
				Сообщить("При списании спецдохода необходимо указать вид дохода и источник!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Движение = ЭтотОбъект.Движения.ИА_ДоходыБудущихПериодов.ДобавитьРасход();
			Движение.Период = ДатаОплаты;
			Если ФППоОрганизациям Тогда
				Движение.Организация = ОрганизацияФП;
			КонецЕсли;
			Движение.Источник = стр.Источник;
			Движение.ОперацияСсылка = Перечисления.КСУ_ОперацииПоФондам.ПрямаяВыплатаИзФонда;
			Движение.Операция = "Возврат покупателю";
			Движение.ВидДохода = стр.ВидДохода;
			Движение.Подразделение = стр.ПодразделениеДохода;
			Если ПроводкаНал тогда
				Движение.Сумманал = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
			Иначе
				Движение.СуммаБезнал = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ДатаВыплатыНеКорректна(Ссылка);
	
	ЗП = Новый Массив;
	
	Для Каждого Стр Из Ссылка.ИА_ЗаказыНаПриобретение Цикл
		ЗП.Добавить(Стр.ЗП);
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_СредстваВРезервеНаФондахОстаткиИОбороты.ЗП,
	|	МИНИМУМ(ИА_СредстваВРезервеНаФондахОстаткиИОбороты.Период) КАК Период
	|ИЗ
	|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.ОстаткиИОбороты(, , Регистратор, , ЗП В (&ЗП)) КАК ИА_СредстваВРезервеНаФондахОстаткиИОбороты
	|ГДЕ
	|	ИА_СредстваВРезервеНаФондахОстаткиИОбороты.Регистратор ССЫЛКА Документ.ИА_ФинансовоеПланирование
	|
	|СГРУППИРОВАТЬ ПО
	|	ИА_СредстваВРезервеНаФондахОстаткиИОбороты.ЗП";
	
	Запрос.УстановитьПараметр("ЗП", ЗП);
	
	РезультатЗапроса = Запрос.Выполнить();
	Отказ = Ложь;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Период > Ссылка.Дата Тогда
			Сообщ = Новый СообщениеПользователю;
			Сообщ.Текст = "Дата платежного документа " + Ссылка.Дата + " меньше даты документа ФП " + ВыборкаДетальныеЗаписи.Период + ", в котором было принято одобрение по заявке: " + ВыборкаДетальныеЗаписи.ЗП;
			Сообщ.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Отказ;
КонецФункции

Функция ПолучитьОдобренныеСуммыПоЗаказам(заказы, регистратор, дата) Экспорт
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналОборот) КАК СуммаБезналОстаток
	|ИЗ
	|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, &НаДату, Регистратор, ЗП В (&ЗП)) КАК ИА_СредстваВРезервеНаФондахОбороты
	|ГДЕ
	|	ИА_СредстваВРезервеНаФондахОбороты.Регистратор <> &Регистратор ";
	Запрос.УстановитьПараметр("Регистратор", регистратор);
	Запрос.УстановитьПараметр("НаДату", КонецДня(Дата));
	Запрос.УстановитьПараметр("ЗП", заказы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() и ЗначениеЗаполнено(Выборка.СуммаБезналОстаток) Тогда
		возврат Выборка.СуммаБезналОстаток;
	Иначе
		возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучитьКурсКратностьВалют(Дата, ВалютаУПР, ВалютаДокумента) Экспорт 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КурсыДокумента.Курс ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ КурсыДокумента.Курс
	|	КОНЕЦ КАК КурсДокумента,
	|	ВЫБОР
	|		КОГДА КурсыДокумента.Кратность ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ КурсыДокумента.Кратность
	|	КОНЕЦ КАК КратностьДокумента,
	|	ВЫБОР
	|		КОГДА КурсыУпрУчета.Курс ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ КурсыУпрУчета.Курс
	|	КОНЕЦ КАК КурсУпрУчета,
	|	ВЫБОР
	|		КОГДА КурсыУпрУчета.Кратность ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ КурсыУпрУчета.Кратность
	|	КОНЕЦ КАК КратностьУпрУчета
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта = &ВалютаУпрУчета) КАК КурсыУпрУчета
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта = &ВалютаДокумента) КАК КурсыДокумента
	|		ПО (ИСТИНА = ИСТИНА)";
	
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Запрос.УстановитьПараметр("ВалютаУпрУчета", ВалютаУПР);
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	
	ТаблицаПлатежейУпр = Запрос.Выполнить().Выгрузить();	
	Если ТаблицаПлатежейУпр.Количество()=0 тогда
		Новстр = ТаблицаПлатежейУпр.Добавить();
		Новстр.КурсДокумента = 1;
		Новстр.КратностьДокумента = 1;
		Новстр.КурсУпрУчета = 1;
		Новстр.КратностьУпрУчета = 1;
	КонецЕсли;
	
	СтрокаКурсыВалют = ТаблицаПлатежейУпр[0];
	
	рез = новый Структура("КурсДокумента,КратностьДокумента,КурсУпрУчета,КратностьУпрУчета");
	ЗаполнитьЗначенияСвойств(рез, СтрокаКурсыВалют);
	Возврат рез;
КонецФункции

Функция ПересчитатьИзВалютыВВалюту1(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон, ПоКратностьНач =1, ПоКратностьКон = 1 , ОбрезатьДробь = ложь) Экспорт
	
	Если (ВалютаНач = ВалютаКон) Тогда
		
		// Считаем, что пересчет не нужен.
		Возврат Сумма;
	КонецЕсли;
	
	Если (ПоКурсуНач = ПоКурсуКон) 
		и (ПоКратностьНач = ПоКратностьКон) Тогда
		
		// пересчет суммы не требуется
		Возврат Сумма;
	КонецЕсли;
	
	Если ПоКурсуНач     = 0 
		или ПоКурсуКон     = 0 
		или ПоКратностьНач = 0 
		или ПоКратностьКон = 0 Тогда
		Сообщить("При пересчете из валюты '"+ВалютаНач+"' в валюту '"+ВалютаКон+"' обнаружен нулевой курс. Пересчет не произведен!");
		Возврат 0;
	КонецЕсли;
	
	рез = (Сумма * ПоКурсуНач * ПоКратностьКон) / (ПоКурсуКон * ПоКратностьНач);
	
	Если ОбрезатьДробь Тогда
		Возврат Цел(рез*100)/100;
	Иначе
		Возврат Окр(рез, 2);
	КонецЕсли;
	
КонецФункции //ПересчитатьИзВалютыВВалюту1()

Процедура ИА_ФП_ПередЗаписьюПлатежкиПриЗаписи(Источник, Отказ) Экспорт
	СуммаДокумента = 0;
	
	Попытка 
		СуммаДокумента = Источник.Сумма;
	Исключение
	КонецПопытки;
	
	Если СуммаДокумента = 0 ИЛИ (Источник.ИА_ЗаказыНаПриобретение.Количество() = 0 И Источник.ИА_Фонды.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;
	
	//Если Источник.ИА_ЗаказыНаПриобретение.Количество() > 0 И Источник.ИА_Фонды.Количество() > 0 Тогда
	//	Сообщить("Должен быть указан фонд ИЛИ заказ!");
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	СуммаПоТЧ = Источник.ИА_ЗаказыНаПриобретение.Итог("Сумма") + Источник.ИА_Фонды.Итог("Сумма");
	Если СуммаПоТЧ > 0 И СуммаПоТЧ<> СуммаДокумента Тогда
		Сообщить("Сумма по заказам и статьям расхода не совпадает с суммой документа!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ИА_ОбработкаЗаполненияПлатежкиОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) <> тип("ДокументСсылка.ИА_ЗаказНаПриобретение") Тогда
		возврат;
	КонецЕсли;
	
	//Арчил Тваладзе 20.04.2016
	//настроки заполнения реквизитов, заполняются в зависимости от базовой конфигурации, в Настройки
	СтруктураНастройкиРеквизитов = ИА_ФП_ПовторИсп.ПолучитьЗначениеКонстанты_ФП_НастройкиРеквизитов(); 
	//конец Арчил Тваладзе 20.04.2016
	
	Попытка
		Если Источник.РасшифровкаПлатежа.Количество() = 0 Тогда
			НовРасшифровка = Источник.РасшифровкаПлатежа.Добавить();
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_СредстваВРезервеНаФондахОстатки.СуммаНалОстаток,
	|	ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток
	|ИЗ
	|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(, ЗП = &ЗП) КАК ИА_СредстваВРезервеНаФондахОстатки";
	Запрос.УстановитьПараметр("ЗП", ДанныеЗаполнения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Остаток = 0;
	
	Попытка
		ТипРКО = Тип("ДокументОбъект.РасходныйКассовыйОрдер");
	Исключение
		Попытка
			ТипРКО = Тип("ДокументОбъект.РасходИзКассы");
		Исключение
			Сообщ = Новый СообщениеПользователю;
			Сообщ.Текст = "Не определен документ Расхода ФП по Налу";
			Если Константы.ИА_ФП_РазделятьНалИБезнал.Получить() Тогда 
				Сообщ.Сообщить();
			КонецЕсли;
			ТипРКО = Неопределено;
		КонецПопытки;
	КонецПопытки;
	
	Если выборка.Следующий() Тогда
		Если Константы.ИА_ФП_РазделятьНалИБезнал.Получить() и ТипЗнч(Источник) = ТипРКО Тогда
			Остаток = выборка.СуммаНалОстаток;
		Иначе
			Остаток = выборка.СуммаБезналОстаток;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Если ЗначениеЗаполнено( ДанныеЗаполнения.Организация) тогда
			Источник.Организация = ДанныеЗаполнения.Организация;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Источник.Контрагент = ДанныеЗаполнения.Контрагент;
	Исключение
	КонецПопытки;
	
	Попытка
		Источник.РасшифровкаПлатежа[0][СтруктураНастройкиРеквизитов.ИмяРеквизитаРасшифровкаПлатежаСумма] = Остаток;
	Исключение
	КонецПопытки;	
	
	Попытка
		Источник.РасшифровкаПлатежа[0].СуммаВзаиморасчетов = Остаток;
	Исключение
	КонецПопытки;
	
	Попытка
		Источник.РасшифровкаПлатежа[0].СуммаПлатежаПлан = Остаток;
	Исключение
	КонецПопытки;
	
	Попытка
		Источник.РасшифровкаПлатежа[0].СуммаРасчетов = Остаток;
	Исключение
	КонецПопытки;
	
	Попытка
		Источник.РасшифровкаПлатежа[0].СуммаПлатежа = Остаток;
	Исключение
	КонецПопытки;
	
	Попытка
		Источник.СуммаДокумента = Остаток;
	Исключение
	КонецПопытки;
	
	Попытка
		Источник.Сумма = Остаток;
	Исключение
	КонецПопытки;
	Попытка
		Если СтруктураНастройкиРеквизитов.ПересчитатьСуммуНДСВРасшифровкеПлатежа Тогда 
			ПересчитатьСуммуНДС(Источник.РасшифровкаПлатежа[0]);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	НовСтр = Источник.ИА_ЗаказыНаПриобретение.Добавить();
	НовСтр.ЗП = ДанныеЗаполнения;
	НовСтр.Сумма =  Остаток;
КонецПроцедуры

Функция ИА_ПолучитьКонстантуРазделятьНалИБезнал() Экспорт
	Возврат Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
КонецФункции

Процедура ПересчитатьСуммуНДС(СтрокаПлатеж) Экспорт
	
	ЗначениеСтавкиНДС     = ПолучитьСтавкуНДС1(СтрокаПлатеж.СтавкаНДС);
	СтрокаПлатеж.СуммаНДС = СтрокаПлатеж.СуммаПлатежа*ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС);
	
КонецПроцедуры

Функция ПолучитьСтавкуНДС1(СтавкаНДС) Экспорт
	
	//ИА_Арчил Тваладзе 2016.07.18 
	//СтавкиНДС в основоном это перечисление, но в некоторых конфигурациях СтавкиНДС это справочник, поэтому пришлось универсализировать процедуру
	Если ТипЗнч(СтавкаНДС) = Тип("Число") тогда
		Возврат СтавкаНДС;	
	КонецЕсли;
	
	
	МетаданныеПеречисления = Метаданные.Перечисления;
	Если МетаданныеПеречисления.Найти(СтавкаНДС.Метаданные().Имя) <> Неопределено Тогда
		Если СтавкаНДС = Перечисления["СтавкиНДС"].НДС20 ИЛИ СтавкаНДС = Перечисления["СтавкиНДС"].НДС20_120 Тогда
			Возврат 20;
		ИначеЕсли СтавкаНДС = Перечисления["СтавкиНДС"].НДС22 ИЛИ СтавкаНДС = Перечисления["СтавкиНДС"].НДС22_122 Тогда
			Возврат 22;	
		ИначеЕсли СтавкаНДС = Перечисления["СтавкиНДС"].НДС5 ИЛИ СтавкаНДС = Перечисления["СтавкиНДС"].НДС5_105 Тогда
			Возврат 7;	
		ИначеЕсли СтавкаНДС = Перечисления["СтавкиНДС"].НДС7 ИЛИ СтавкаНДС = Перечисления["СтавкиНДС"].НДС7_107 Тогда
			Возврат 7;
			
		ИначеЕсли СтавкаНДС = Перечисления["СтавкиНДС"].НДС18 ИЛИ СтавкаНДС = Перечисления["СтавкиНДС"].НДС18_118 Тогда
			Возврат 18;
			
		КонецЕсли;
		
		Возврат 0;
		
	КонецЕсли;
	
	МетаданныеСправочники = Метаданные.Справочники;
	Если МетаданныеСправочники.Найти(СтавкаНДС.Метаданные().Имя) <> Неопределено Тогда
		Если СтавкаНДС.Метаданные().Реквизиты.Найти("Ставка") <> Неопределено Тогда
			
			Возврат  СтавкаНДС.Ставка;
			
		КонецЕсли;;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции // ПолучитьСтавкуНДС1()

Функция  ПолучитьКонстантыДляФП(Константа) Экспорт	
	Если Константа = "ИА_ФП_РазделятьНалИБезнал" Тогда
		Возврат Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	ИначеЕсли Константа = "ИА_ФП_ПодразделениеДоходовБП" Тогда
		Возврат Константы.ИА_ФП_ПодразделениеДоходовБП.Получить();
	ИначеЕсли Константа = "ИА_ФП_ФондДоходовБП" Тогда
		Возврат Константы.ИА_ФП_ФондДоходовБП.Получить();
	ИначеЕсли Константа = "КСУ_ДоходыПоПодразделениям" Тогда
		Возврат Константы.КСУ_ДоходыПоПодразделениям.Получить();
	ИначеЕсли Константа = "РасходныйКассовыйОрдер" Тогда	
		Возврат Тип("ДокументСсылка.РасходныйКассовыйОрдер");
	КонецЕсли; 
КонецФункции

Функция ПолучитьРегистрПоИмени(имяРегистра) Экспорт
	Если найти(имяРегистра, "РегистрНакопления") > 0 Тогда
		ЧистоеИмяРегистра = сред(имяРегистра, 19);
		регистр = Метаданные.РегистрыНакопления[ЧистоеИмяРегистра];
	Иначе
		ЧистоеИмяРегистра = сред(имяРегистра, 20);
		регистр = Метаданные.РегистрыБухгалтерии[ЧистоеИмяРегистра];
	КонецЕсли;
	
	Возврат регистр;
КонецФункции

Функция ПолучитьСписокРеквизитов(имяРегистра, РесурсыРеквизиты) Экспорт
	Рез = Новый Массив;
	регистр = ПолучитьРегистрПоИмени(имяРегистра);
	ЭтоБух = Найти(ИмяРегистра, "РегистрБухгалтерии")>0;
	
	Для каждого изм из регистр[РесурсыРеквизиты] Цикл
		Если ЭтоБух и не изм.Балансовый Тогда
			Рез.Добавить(изм.Имя+"Дт");
			Рез.Добавить(изм.Имя+"Кт");
		Иначе
			Рез.Добавить(изм.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если РесурсыРеквизиты = "Измерения" Тогда 
		Если ЭтоБух Тогда
			Рез.Добавить("СчетДт");
			Рез.Добавить("СчетКт");
			сч = 1;
			Пока сч <= регистр.ПланСчетов.МаксКоличествоСубконто Цикл
				Рез.Добавить("СубконтоДт"+сч);
				Рез.Добавить("СубконтоКт"+сч);
				сч = сч + 1;
			КонецЦикла;
		Иначе
			Для каждого изм из регистр.СтандартныеРеквизиты Цикл
				Рез.Добавить(изм.Имя);
			КонецЦикла;
			Для каждого изм из регистр.Реквизиты Цикл //Добавим реквизиты регистра дополнительно
				Рез.Добавить(изм.Имя);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Процедура ОповеститьПользователяПоЗаказуПотребления() Экспорт
	
	СтОдобр = ИА_ФП.СтатусыОдобрено();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ОповещениеСрезПоследних.Заказ КАК Заказ,
	|	ИА_ОповещениеСрезПоследних.Статус КАК Статус,
	|	ИА_ОповещениеСрезПоследних.Автор КАК Автор,
	|	ИА_ОповещениеСрезПоследних.Заказ.Ситуация КАК Ситуация,
	|	ИА_ОповещениеСрезПоследних.Заказ.Данные КАК Данные,
	|	ИА_ОповещениеСрезПоследних.Заказ.Решение КАК Решение,
	|	ИА_ОповещениеСрезПоследних.Заказ.Подразделение КАК Подразделение,
	|	ИА_ОповещениеСрезПоследних.Заказ.Подразделение.Руководитель КАК Руководитель,
	|	ИА_ОповещениеСрезПоследних.Заказ.ПредметЗаказа КАК ПредметЗаказа,
	|	ИА_ОповещениеСрезПоследних.Заказ.Сумма КАК Сумма,
	|	ИА_ОповещениеСрезПоследних.Заказ.Сотрудник КАК Сотрудник,
	|	ИА_ОповещениеСрезПоследних.Заказ.Номер КАК Номер,
	|	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход, 0) + ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаНалПриход, 0) КАК СуммаОдобрено,
	|	ИА_ОповещениеСрезПоследних.Автоотклонение КАК Автоотклонение
	|ИЗ
	|	РегистрСведений.ИА_Оповещение.СрезПоследних КАК ИА_ОповещениеСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ПоследниеОповещения КАК ИА_ПоследниеОповещения
	|		ПО ИА_ОповещениеСрезПоследних.Заказ = ИА_ПоследниеОповещения.Заказ
	|			И ИА_ОповещениеСрезПоследних.Статус = ИА_ПоследниеОповещения.Статус
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты КАК ИА_СредстваВРезервеНаФондахОбороты
	|		ПО ИА_ОповещениеСрезПоследних.Заказ = ИА_СредстваВРезервеНаФондахОбороты.ЗП
	|ГДЕ
	|	ИА_ПоследниеОповещения.Заказ ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяЗадача = Задачи["ИА_ЗадачаПланаДействий"].СоздатьЗадачу();
		НоваяЗадача.Автор        = Выборка.Автор;
		НоваяЗадача.Дата         = ТекущаяДата();
		НоваяЗадача.ПрикрепленныйОбъект = Выборка.Заказ;
		НоваяЗадача.Отправлена = истина;
		НоваяЗадача.СрокИсполнения = ТекущаяДата()+60*60*24;
		
		Если Выборка.Статус = Перечисления.ИА_СостояниеЗаказа.Подготовлен Тогда
			Если ЗначениеЗаполнено(Выборка.Руководитель) и не ПользовательНаПосту(Выборка.Автор, Выборка.Руководитель) Тогда  // если сам руководитель написал, то уведомление не надо
				НоваяЗадача.ЭтоЗРС = Истина;
				НоваяЗадача.Пост = Выборка.Руководитель; 
				//				
				НоваяЗадача.Наименование = "Прошу одобрить заказ "+Выборка.Номер+" на приобретение на " + Выборка.ПредметЗаказа+". Сумма " + Выборка.Сумма;
				НоваяЗадача.Ситуация = Выборка.Ситуация;
				НоваяЗадача.Данные = Выборка.Данные;
				НоваяЗадача.Содержание = Выборка.Решение;
				НоваяЗадача.Записать();
			КонецЕсли;
		ИначеЕсли Выборка.Статус = Перечисления.ИА_СостояниеЗаказа.УтвержденРуководителем Тогда
			ОтвФП = Константы.ИА_ОтветственныйЗаФП.Получить();
			Если ЗначениеЗаполнено(ОтвФП) и не ПользовательНаПосту(Выборка.Автор, ОтвФП) Тогда
				НоваяЗадача.Пост = ОтвФП; 
				//				
				НоваяЗадача.Наименование = "Прошу отправить заказ "+Выборка.Номер+" (" + Выборка.ПредметЗаказа+ ") на рассмотрение на ФП";
				НоваяЗадача.Содержание = "ЗП на " + Выборка.ПредметЗаказа+". Сумма " + Выборка.Сумма;
				НоваяЗадача.Записать();
			КонецЕсли;
		ИначеЕсли Выборка.Статус = Перечисления.ИА_СостояниеЗаказа.РассмотретьНаФП Тогда
			Если Выборка.Сотрудник <> Выборка.Автор Тогда
				НоваяЗадача.Пользователь = Выборка.Сотрудник; 
				НоваяЗадача.ЭтоПослание = истина;
				//				
				НоваяЗадача.Наименование = "Ваш заказ "+Выборка.Номер+" (" + Выборка.ПредметЗаказа+ ") будет рассмотрен на ФП";
				НоваяЗадача.Содержание = "ЗП на " + Выборка.ПредметЗаказа+". Сумма " + Выборка.Сумма;
				НоваяЗадача.Записать();
			КонецЕсли;
		ИначеЕсли Выборка.Статус = Перечисления.ИА_СостояниеЗаказа.ПереносНаСледующееФП Тогда
			Если Выборка.Сотрудник <> Выборка.Автор Тогда
				НоваяЗадача.Пользователь = Выборка.Сотрудник; 
				НоваяЗадача.ЭтоПослание = истина;
				//				
				НоваяЗадача.Наименование = "Ваш заказ "+Выборка.Номер+" (" + Выборка.ПредметЗаказа+ ") перенесен на следущее ФП";
				НоваяЗадача.Содержание = "ЗП на " + Выборка.ПредметЗаказа+". Сумма " + Выборка.Сумма;
				НоваяЗадача.Записать();
			КонецЕсли;
		ИначеЕсли СтОдобр.найти(Выборка.Статус) <>Неопределено ИЛИ Выборка.Статус = Перечисления.ИА_СостояниеЗаказа.Отклонен Тогда
			Если Выборка.Сотрудник <> Выборка.Автор Тогда
				НоваяЗадача.Пользователь = Выборка.Сотрудник; 
				НоваяЗадача.ЭтоПослание = истина;
				//				
				Если Выборка.Автоотклонение Тогда
					НоваяЗадача.Наименование = "Ваш заказ "+Выборка.Номер+" на """ + Выборка.ПредметЗаказа+ """ не был одобрен на Фин. планировании";
				Иначе
					НоваяЗадача.Наименование = "Ваш заказ "+Выборка.Номер+" на """ + Выборка.ПредметЗаказа+ """ " + НРег(Выборка.Статус);
					НоваяЗадача.Содержание = "ЗП на " + Выборка.ПредметЗаказа+". Сумма " + Выборка.Сумма;
				КонецЕсли;
				Если СтОдобр.найти(Выборка.Статус) <>Неопределено Тогда
					НоваяЗадача.Содержание = НоваяЗадача.Содержание+ ". Итого одобрено по заказу " + Выборка.СуммаОдобрено;
				ИначеЕсли не Выборка.Автоотклонение Тогда // отклонен
					НоваяЗадача.Содержание = НоваяЗадача.Содержание+ ". Причина отказа: " + ВернутьСтатусЗВС(Выборка.Заказ).ПричинаОтказа;
				КонецЕсли;
				НоваяЗадача.Записать();
			КонецЕсли;
		КонецЕсли;
		
		мен = РегистрыСведений.ИА_ПоследниеОповещения.СоздатьМенеджерЗаписи();
		мен.Заказ = Выборка.Заказ;
		мен.Статус = Выборка.Статус;
		мен.Записать(истина);
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.ИА_Оповещение.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	
	
КонецПроцедуры

Функция ПользовательНаПосту(польз, пост)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_АдресацияЗадачПланаДействий.Пользователь
	|ИЗ
	|	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	|ГДЕ
	|	ИА_АдресацияЗадачПланаДействий.Пользователь = &Пользователь
	|	И ИА_АдресацияЗадачПланаДействий.Пост = &Пост";
	Запрос.УстановитьПараметр("Пользователь", польз);
	Запрос.УстановитьПараметр("Пост", пост);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий();
КонецФункции

Функция ПолучитьСуммуПоВидуДохода(СтрокаНастройки, НачалоПериода, КонецПериода, Доходы_Детализация = Неопределено) Экспорт
	
	РазделятьНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	
	ИтогПоВидуДоходаБезнал = 0;
	ИтогПоВидуДоходаНал = 0;
	
	Если СтрокаНастройки.ВидПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхВидыДоходов.Вручную Тогда
	ИначеЕсли СтрокаНастройки.ВидПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхВидыДоходов.ДвиженияДС Тогда
		//Конструктор формирования данных из одиночного регистра
		ИмяРегистраБезнал             	= СтрокаНастройки.ИмяРегистраБезнал;
		ПредставлениеРегистраБезнал     = СтрокаНастройки.ТекстВыраженияЗапросаБезнал;
		РесурсРегистраБезнал 			= СтрокаНастройки.РесурсРегистраБезнал;
		ТаблицаПараметровБезнал 		= ПолучитьПараметрыЗапроса(СтрокаНастройки.Ссылка, СтрокаНастройки.ВидДохода,Перечисления.ИА_ТипДвиженияДенежныхСредств.Безналичные);
		
		
		ПользовательскийЗапросБезнал = СформироватьЗапросПоРегистру(ИмяРегистраБезнал, РесурсРегистраБезнал, ТаблицаПараметровБезнал, СтрокаНастройки, СтрокаНастройки.ВидДохода, СтрокаНастройки.ПолеСтатьяДДСБезнал, Перечисления.ИА_ТипДвиженияДенежныхСредств.Безналичные );
		ПользовательскийЗапросБезнал.УстановитьПараметр("НачалоПериода", НачалоПериода);
		ПользовательскийЗапросБезнал.УстановитьПараметр("КонецПериода", КонецПериода);
		
		
		Попытка
			ПользовательскаяВыборкаБезнал = ПользовательскийЗапросБезнал.Выполнить().Выгрузить();
			Если Доходы_Детализация <> Неопределено Тогда
				Для Каждого ТекСтрока Из ПользовательскаяВыборкаБезнал Цикл
					НоваяСтрока 			= Доходы_Детализация.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
					НоваяСтрока.ВидДохода 	= СтрокаНастройки.ВидДохода;
				КонецЦикла;
			КонецЕсли;
			ИтогПоВидуДоходаБезнал = ПользовательскаяВыборкаБезнал.Итог("Сумма");
		Исключение
			ТекстОшибка = ОписаниеОшибки();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Возникла ошибка выборки данных по виду доходов (" + СтрокаНастройки.ВидДохода.Наименование + ")"
			+ " Ошибка: " + ТекстОшибка;
			Сообщение.Сообщить(); 
		КонецПопытки;
		
		Если РазделятьНалБезнал Тогда
			ИмяРегистраНал             	= СтрокаНастройки.ИмяРегистраНал;
			ПредставлениеРегистраНал    = СтрокаНастройки.ТекстВыраженияЗапросаНал;
			РесурсРегистраНал 			= СтрокаНастройки.РесурсРегистраНал;
			ТаблицаПараметровНал 		= ПолучитьПараметрыЗапроса(СтрокаНастройки.Ссылка, СтрокаНастройки.ВидДохода,Перечисления.ИА_ТипДвиженияДенежныхСредств.Наличные);
			
			ПользовательскийЗапросНал = СформироватьЗапросПоРегистру(ИмяРегистраНал, РесурсРегистраНал, ТаблицаПараметровНал, СтрокаНастройки, СтрокаНастройки.ВидДохода, СтрокаНастройки.ПолеСтатьяДДСНал,Перечисления.ИА_ТипДвиженияДенежныхСредств.Наличные);
			ПользовательскийЗапросНал.УстановитьПараметр("НачалоПериода", НачалоПериода);
			ПользовательскийЗапросНал.УстановитьПараметр("КонецПериода", КонецПериода);
			
			Попытка
				ПользовательскаяВыборкаНал = ПользовательскийЗапросНал.Выполнить().Выгрузить();
				Если Доходы_Детализация <> Неопределено Тогда
					Для Каждого ТекСтрока Из ПользовательскаяВыборкаНал Цикл
						НоваяСтрока 			= Доходы_Детализация.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,,"Сумма");
						НоваяСтрока.СуммаНал = ТекСтрока.Сумма;
						НоваяСтрока.ВидДохода 	= СтрокаНастройки.ВидДохода;
					КонецЦикла;
				КонецЕсли;
				ИтогПоВидуДоходаНал = ПользовательскаяВыборкаНал.Итог("Сумма");
			Исключение
				ТекстОшибка = ОписаниеОшибки();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Возникла ошибка выборки данных по виду доходов (" + СтрокаНастройки.ВидДохода.Наименование + ")"
				+ " Ошибка: " + ТекстОшибка;
				Сообщение.Сообщить(); 
			КонецПопытки;
		КонецЕсли;
		
	ИначеЕсли СтрокаНастройки.ВидПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхВидыДоходов.Запрос Тогда
		//Конструктор формирования данных из запроса
		
		ТекстПользовательскогоЗапросаБезнал   = СтрокаНастройки.ТекстВыраженияЗапросаБезнал;
		ТекстПользовательскогоЗапросаНал      = СтрокаНастройки.ТекстВыраженияЗапросаНал;
		
		ТаблицаПараметровБезнал               = ПолучитьПараметрыЗапроса(СтрокаНастройки.Ссылка, СтрокаНастройки.ВидДохода, Перечисления.ИА_ТипДвиженияДенежныхСредств.Безналичные);
		ТаблицаПараметровНал                  = ПолучитьПараметрыЗапроса(СтрокаНастройки.Ссылка, СтрокаНастройки.ВидДохода, Перечисления.ИА_ТипДвиженияДенежныхСредств.Наличные);
		
		ПользовательскийЗапросПоДоходамБезнал = Новый Запрос;
		ПользовательскийЗапросПоДоходамБезнал.Текст = ТекстПользовательскогоЗапросаБезнал;
		
		Для каждого ТекПараметр из ТаблицаПараметровБезнал Цикл      				
			ПользовательскийЗапросПоДоходамБезнал.УстановитьПараметр(ТекПараметр.Параметр, ТекПараметр.Значение);
		КонецЦикла;
		
		ПользовательскийЗапросПоДоходамБезнал.УстановитьПараметр("ДатаНачала", НачалоПериода);
		ПользовательскийЗапросПоДоходамБезнал.УстановитьПараметр("ДатаКонца",  КонецПериода);
		
		Попытка
			ВыборкаПоДоходамБезнал = ПользовательскийЗапросПоДоходамБезнал.Выполнить().Выгрузить();
			ВыборкаПоДоходамБезнал.Колонки.Добавить("ВидДохода");
			
			Если Доходы_Детализация <> Неопределено Тогда
				Для Каждого ТекСтрока Из ВыборкаПоДоходамБезнал Цикл
					НоваяСтрока = Доходы_Детализация.Добавить();
					
					Если НЕ ВыборкаПоДоходамБезнал.Колонки.Найти("Документ") = Неопределено	Тогда 
						НоваяСтрока.Документ = ТекСтрока.Документ;
					КонецЕсли;
					
					Если НЕ ВыборкаПоДоходамБезнал.Колонки.Найти("Контрагент") = Неопределено	Тогда 
						НоваяСтрока.Контрагент 	= ТекСтрока.Контрагент;		
					КонецЕсли;
					
					Если НЕ ВыборкаПоДоходамБезнал.Колонки.Найти("Продукт") = Неопределено	Тогда 
						НоваяСтрока.Продукт 	= ТекСтрока.Продукт;		
					КонецЕсли;
					
					Если НЕ ВыборкаПоДоходамБезнал.Колонки.Найти("Менеджер") = Неопределено Тогда 
						НоваяСтрока.Ответственный = ТекСтрока.Менеджер;		
					КонецЕсли;
					
					Если НЕ ВыборкаПоДоходамБезнал.Колонки.Найти("Сумма") = Неопределено Тогда 
						НоваяСтрока.Сумма = ТекСтрока.Сумма;
					КонецЕсли;
					
					Если НЕ ВыборкаПоДоходамБезнал.Колонки.Найти("Валюта") = Неопределено	Тогда 
						НоваяСтрока.Валюта = ТекСтрока.Валюта;			
					КонецЕсли;
					
					НоваяСтрока.ВидДохода = СтрокаНастройки.ВидДохода;
				КонецЦикла;
			КонецЕсли;
			ИтогПоВидуДоходаБезнал = ВыборкаПоДоходамБезнал.Итог("Сумма");
		Исключение
			Сообщить("Ошибка при формировании запроса по безналичным ДС для вида дохода: " + СтрокаНастройки.ВидДохода.Наименование + Символы.ПС + ОписаниеОшибки());
			//Сообщить("По виду доходов (" + СтрокаНастройки.ВидДохода.Наименование + ") не указан способ получения данных в последнем документе настройки финпланирования");
		КонецПопытки;
		
		
		Если РазделятьНалБезнал Тогда
			
			ПользовательскийЗапросПоДоходамНал = Новый Запрос;
			ПользовательскийЗапросПоДоходамНал.Текст = ТекстПользовательскогоЗапросаНал;
			
			Для каждого ТекПараметр из ТаблицаПараметровНал Цикл      				
				ПользовательскийЗапросПоДоходамНал.УстановитьПараметр(ТекПараметр.Параметр, ТекПараметр.Значение);
			КонецЦикла;
			
			ПользовательскийЗапросПоДоходамНал.УстановитьПараметр("ДатаНачала", НачалоПериода);
			ПользовательскийЗапросПоДоходамНал.УстановитьПараметр("ДатаКонца",  КонецПериода);
			
			Попытка
				ВыборкаПоДоходамНал = ПользовательскийЗапросПоДоходамНал.Выполнить().Выгрузить();
				ВыборкаПоДоходамНал.Колонки.Добавить("ВидДохода");
				Если Доходы_Детализация <> Неопределено Тогда
					Для Каждого ТекСтрока Из ВыборкаПоДоходамНал Цикл
						НоваяСтрока = Доходы_Детализация.Добавить();
						
						Если НЕ ВыборкаПоДоходамНал.Колонки.Найти("Документ") = Неопределено	Тогда 
							НоваяСтрока.Документ = ТекСтрока.Документ;
						КонецЕсли;
						
						Если НЕ ВыборкаПоДоходамНал.Колонки.Найти("Контрагент") = Неопределено	Тогда 
							НоваяСтрока.Контрагент 	= ТекСтрока.Контрагент;		
						КонецЕсли;
						
						Если НЕ ВыборкаПоДоходамНал.Колонки.Найти("Продукт") = Неопределено	Тогда 
							НоваяСтрока.Продукт 	= ТекСтрока.Продукт;		
						КонецЕсли;
						
						Если НЕ ВыборкаПоДоходамНал.Колонки.Найти("Менеджер") = Неопределено Тогда 
							НоваяСтрока.Ответственный = ТекСтрока.Менеджер;		
						КонецЕсли;
						
						Если НЕ ВыборкаПоДоходамНал.Колонки.Найти("Сумма") = Неопределено Тогда 
							НоваяСтрока.Сумма = ТекСтрока.Сумма;
						КонецЕсли;
						
						Если НЕ ВыборкаПоДоходамНал.Колонки.Найти("Валюта") = Неопределено	Тогда 
							НоваяСтрока.Валюта = ТекСтрока.Валюта;			
						КонецЕсли;
						
						НоваяСтрока.ВидДохода = СтрокаНастройки.ВидДохода;
					КонецЦикла;
				КонецЕсли;
				ИтогПоВидуДоходаНал = ВыборкаПоДоходамНал.Итог("Сумма");
			Исключение
				Сообщить("Ошибка при формировании запроса по наличным ДС для вида дохода: " + СтрокаНастройки.ВидДохода.Наименование + Символы.ПС + ОписаниеОшибки());
				//Сообщить("По виду доходов (" + СтрокаНастройки.ВидДохода.Наименование + ") не указан способ получения данных в последнем документе настройки финпланирования");
			КонецПопытки;
		КонецЕсли;
	Иначе
		//Если попали сюда, то вариант получения данных не указан в последних настройках ФП
		Сообщить("По виду доходов (" + СтрокаНастройки.ВидДохода.Наименование + ") не указан способ получения данных в последнем документе настройки финпланирования");
	КонецЕсли;
	
	Возврат Новый Структура("СуммаНал,СуммаБезнал", ИтогПоВидуДоходаНал, ИтогПоВидуДоходаБезнал);
КонецФункции

Функция СформироватьЗапросПоРегистру(ИмяРегистра, РесурсРегистра, ТаблицаПараметров, НастройкаФП, ВидДохода, ПолеСтатьяДДС, ТипОплаты)
	
	ПользЗапрос = Новый Запрос;
	Если Лев(ИмяРегистра, 18) = "РегистрБухгалтерии" Тогда
		//Новый вариант
		ПользЗапросТекст =
		"ВЫБРАТЬ
		|   Т.Регистратор КАК Документ,
		|   Т.Продукт КАК Продукт,
		|   Т.СуммаОборот КАК Сумма
		|ИЗ
		|   РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, Авто, &ОтборСчетДт, , &ОтборСчетКт, , &ДопОтбор) КАК Т";
		
		ПользЗапросТекст = СтрЗаменить(ПользЗапросТекст, "РегистрБухгалтерии.Хозрасчетный", ИмяРегистра);
		ПользЗапросТекст = СтрЗаменить(ПользЗапросТекст, "Т.Сумма", "Т." + РесурсРегистра);
		ПользЗапросТекст = СтрЗаменить(ПользЗапросТекст, "Т.Продукт", ?(ПолеСтатьяДДС="", "НЕОПРЕДЕЛЕНО", "Т." + ПолеСтатьяДДС));
		ДопОтбор = "";
		ОтборСчетДт = "";
		ОтборСчетКт = "";
		Для Каждого СтрокаТЗ Из ТаблицаПараметров Цикл
			Если СтрокаТЗ.Значение <> Неопределено И СтрокаТЗ.Значение <> "" Тогда
				ЭтоСчетДт = Ложь;
				ЭтоСчетКт = Ложь;
				Условие = "";
				П = СтрокаТЗ.Параметр;
				Если Лев(П, 8) = "Субконто" Тогда
					Суффикс = Прав(П, 2);
					П = "Субконто" + Суффикс + Сред(П, 9, 1);
				ИначеЕсли П = "СчетДт" Тогда 
					ЭтоСчетДт = Истина;
				ИначеЕсли П = "СчетКт" Тогда 
					ЭтоСчетКт = Истина;	
				КонецЕсли; 
				
				ПользЗапрос.УстановитьПараметр(П, СтрокаТЗ.Значение);
				
				Если СтрокаТЗ.ТипСравнения = ВидСравнения.Равно Тогда
					Условие = П + " = &" + П;
				ИначеЕсли СтрокаТЗ.ТипСравнения = ВидСравнения.НеРавно Тогда
					Условие = П + " <> &" + П;
				ИначеЕсли СтрокаТЗ.ТипСравнения = ВидСравнения.ВСписке Тогда
					Условие = П + " В (&" + П + ")";
					
				ИначеЕсли СтрокаТЗ.ТипСравнения = ВидСравнения.ВИерархии Тогда
					Условие = П + " В ИЕРАРХИИ (&" + П + ")";
				ИначеЕсли СтрокаТЗ.ТипСравнения = ВидСравнения.НеВИерархии Тогда
					Условие = "НЕ " + П + " В ИЕРАРХИИ (&" + П + ")";
					
				ИначеЕсли СтрокаТЗ.ТипСравнения = ВидСравнения.ВСпискеПоИерархии Тогда
					Условие = П + " В ИЕРАРХИИ (&" + П + ")";
				ИначеЕсли СтрокаТЗ.ТипСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
					Условие = "НЕ " + П + " В ИЕРАРХИИ (&" + П + ")";                                
					
				ИначеЕсли СтрокаТЗ.ТипСравнения = ВидСравнения.НеВСписке Тогда
					Условие = "НЕ " + П + " В (&" + П + ")";
				ИначеЕсли СтрокаТЗ.ТипСравнения = ВидСравнения.БольшеИлиРавно Тогда
					Условие = П + " >= &" + П;
				ИначеЕсли СтрокаТЗ.ТипСравнения = ВидСравнения.Больше Тогда
					Условие = П + " > &" + П;
				ИначеЕсли СтрокаТЗ.ТипСравнения = ВидСравнения.МеньшеИлиРавно Тогда
					Условие = П + " <= &" + П;
				ИначеЕсли СтрокаТЗ.ТипСравнения = ВидСравнения.Меньше Тогда
					Условие = П + " < &" + П;
				КонецЕсли;
				Если ЭтоСчетДт Тогда 
					ОтборСчетДт = ОтборСчетДт + " И " + Условие;
				ИначеЕсли ЭтоСчетКт Тогда 
					ОтборСчетКт = ОтборСчетКт + " И " + Условие;
				Иначе	
					ДопОтбор = ДопОтбор + " И " + Условие;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ДопОтбор <> "" Тогда
			ДопОтбор = Сред(ДопОтбор, 3);
		КонецЕсли;
		Если ОтборСчетДт <> "" Тогда 
			ОтборСчетДт = Сред(ОтборСчетДт, 3);
		КонецЕсли;
		Если ОтборСчетКт <> "" Тогда 
			ОтборСчетКт = Сред(ОтборСчетКт, 3);
		КонецЕсли;
		
		ПользЗапросТекст = СтрЗаменить(ПользЗапросТекст, "&ДопОтбор", ДопОтбор); 
		ПользЗапросТекст = СтрЗаменить(ПользЗапросТекст, "&ОтборСчетДт", ОтборСчетДт); 
		ПользЗапросТекст = СтрЗаменить(ПользЗапросТекст, "&ОтборСчетКт", ОтборСчетКт);                              
	Иначе
		//Отдельно соберем запрос по регистру накопления                
		РегКонтрагент = РеквизитЕстьПриВыборкеИзРегистра(ИмяРегистра, "Контрагент");
		РегОтветственный = РеквизитЕстьПриВыборкеИзРегистра(ИмяРегистра, "Ответственный");
		
		
		МД = Метаданные.РегистрыНакопления[Сред(ИмяРегистра,  Найти(ИмяРегистра, ".")+1)];
		ЭтоРегистрОстатков = МД.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки;
		
		ПользЗапросТекст = "ВЫБРАТЬ" + Символы.ПС
		+ ?(ЭтоРегистрОстатков, "ВЫБОР КОГДА ВидДвижения=Значение(ВидДвиженияНакопления.Приход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ * ", "")
		+ "ТребуемыйРегистр." + РесурсРегистра + " КАК Сумма," + Символы.ПС 
		+ ?(МД.Измерения.Найти("Контрагент") = Неопределено, ?(РегКонтрагент, "Регистратор.Контрагент", "Неопределено"), "Контрагент") + " как Контрагент," + Символы.ПС 
		+ ?(ПолеСтатьяДДС="", "НЕОПРЕДЕЛЕНО", ПолеСтатьяДДС) + " КАК Продукт," + Символы.ПС 
		+ ?(МД.Измерения.Найти("Ответственный") = Неопределено, ?(РегОтветственный, "Регистратор.Ответственный", "Неопределено"), "Ответственный") + " как Ответственный," + Символы.ПС 
		+ "ТребуемыйРегистр.Регистратор КАК Документ" + Символы.ПС + "ИЗ" + Символы.ПС + ИмяРегистра + " КАК ТребуемыйРегистр";
		
		ПользЗапросТекст = ПользЗапросТекст + Символы.ПС + " ГДЕ ";
		
		Для Каждого ТекПараметр Из ТаблицаПараметров Цикл
			Если НЕ ТекПараметр.Значение = Неопределено Тогда
				ПользЗапросТекст = ПользЗапросТекст + Символы.ПС + "ТребуемыйРегистр." + ТекПараметр.Параметр;
				Если ТекПараметр.ТипСравнения = ВидСравнения.Равно Тогда ПользЗапросТекст = ПользЗапросТекст + " = &" + ТекПараметр.Параметр + Символы.ПС + "И ";
				ИначеЕсли ТекПараметр.ТипСравнения = ВидСравнения.НеРавно Тогда ПользЗапросТекст = ПользЗапросТекст + " <> &" + ТекПараметр.Параметр + Символы.ПС + "И ";
					
				ИначеЕсли ТекПараметр.ТипСравнения = ВидСравнения.ВСписке Тогда 
					ТекПараметр.Значение = ПолучитьСписокПараметров(НастройкаФП, ВидДохода, ТекПараметр.Параметр, ТипОплаты);  
					ПользЗапросТекст = ПользЗапросТекст + " В (&" + ТекПараметр.Параметр + ")" + Символы.ПС + "И ";
				ИначеЕсли ТекПараметр.ТипСравнения = ВидСравнения.НеВСписке Тогда 
					ТекПараметр.Значение = ПолучитьСписокПараметров(НастройкаФП, ВидДохода, ТекПараметр.Параметр, ТипОплаты);
					ПользЗапросТекст = ПользЗапросТекст + " НЕ В (&" + ТекПараметр.Параметр + ")" + Символы.ПС + "И ";
					
				ИначеЕсли ТекПараметр.ТипСравнения = ВидСравнения.ВИерархии Тогда 
					ПользЗапросТекст = ПользЗапросТекст + " В ИЕРАРХИИ (&" + ТекПараметр.Параметр + ")" + Символы.ПС + " И ";
				ИначеЕсли ТекПараметр.ТипСравнения = ВидСравнения.НеВИерархии Тогда 
					ПользЗапросТекст = ПользЗапросТекст + " НЕ В ИЕРАРХИИ (&" + ТекПараметр.Параметр + ")" + Символы.ПС + " И ";
					
				ИначеЕсли ТекПараметр.ТипСравнения = ВидСравнения.БольшеИлиРавно Тогда ПользЗапросТекст = ПользЗапросТекст + " >= &" + ТекПараметр.Параметр + Символы.ПС + "И ";
				ИначеЕсли ТекПараметр.ТипСравнения = ВидСравнения.Больше Тогда ПользЗапросТекст = ПользЗапросТекст + " > &" + ТекПараметр.Параметр + Символы.ПС + "И ";
				ИначеЕсли ТекПараметр.ТипСравнения = ВидСравнения.МеньшеИлиРавно Тогда ПользЗапросТекст = ПользЗапросТекст + " <= &" + ТекПараметр.Параметр + Символы.ПС + "И ";
				ИначеЕсли ТекПараметр.ТипСравнения = ВидСравнения.Меньше Тогда ПользЗапросТекст = ПользЗапросТекст + " < &" + ТекПараметр.Параметр + Символы.ПС + "И ";
				КонецЕсли;
				
				
				Если ТекПараметр.Параметр = "ВидДвижения" И ЗначениеЗаполнено(ТекПараметр.Значение) Тогда
					Если ТипЗнч(ТекПараметр.Значение) = Тип("СписокЗначений") Тогда
						мЗначение = Новый СписокЗначений;
						Для Каждого Эл Из ТекПараметр.Значение Цикл
							мЗначение.Добавить(ВидДвиженияНакопления[Эл.Значение]);
						КонецЦикла;
					Иначе
						мЗначение = ВидДвиженияНакопления[ТекПараметр.Значение]; // Пока так сделано
					КонецЕсли;
				Иначе
					мЗначение = ТекПараметр.Значение;
				КонецЕсли;
				ПользЗапрос.УстановитьПараметр(ТекПараметр.Параметр, мЗначение);
			КонецЕсли;
		КонецЦикла;
		ПользЗапросТекст = ПользЗапросТекст + Символы.ПС + "ТребуемыйРегистр.Период >= &НачалоПериода И ТребуемыйРегистр.Период <= &КонецПериода";
	КонецЕсли;
	
	ПользЗапрос.Текст = ПользЗапросТекст;
	
	Возврат ПользЗапрос;
	
КонецФункции

Функция ПолучитьПараметрыЗапроса(НастройкаФП, ВидДохода, ТипОплаты)
	
	ПараметрыЗапроса = Новый ТаблицаЗначений;
	ПараметрыЗапроса.Колонки.Добавить("Параметр");
	ПараметрыЗапроса.Колонки.Добавить("ТипСравнения");
	ПараметрыЗапроса.Колонки.Добавить("Значение");
	
	ТаблицаПараметров = НастройкаФП.ПараметрыВыраженияЗапроса;
	СписокЗначПараметров = НастройкаФП.СпискиЗначенийПараметров;
	
	Для Каждого ТекСтрока Из ТаблицаПараметров Цикл
		Если НЕ ТекСтрока.ВидДохода = ВидДохода ИЛИ
			НЕ ТекСтрока.ТипОплаты = ТипОплаты Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ПараметрыЗапроса.Добавить();
		НоваяСтрока.Параметр = ТекСтрока.Параметр;
		
		Если ТекСтрока.КлючСписка > 0 Тогда 
			//Это Список
			ЗначениеПараметра = Новый Массив;
			Для Каждого Стр Из СписокЗначПараметров Цикл
				Если Стр.КлючСписка = ТекСтрока.КлючСписка 
					И Стр.ВидДохода = ТекСтрока.ВидДохода Тогда 
					ЗначениеПараметра.Добавить(Стр.Значение);
				КонецЕсли;
			КонецЦикла;
		Иначе
			ЗначениеПараметра = ТекСтрока.Значение;
		КонецЕсли;
		
		Если ТекСтрока.ТипСравнения = "В списке" Тогда
			НоваяСтрока.ТипСравнения = ВидСравнения.ВСписке;
		ИначеЕсли ТекСтрока.ТипСравнения = "Не в списке" Тогда
			НоваяСтрока.ТипСравнения = ВидСравнения.НеВСписке;
			
		ИначеЕсли ТекСтрока.ТипСравнения = "В группе" Тогда
			НоваяСтрока.ТипСравнения = ВидСравнения.ВИерархии;
			
		ИначеЕсли ТекСтрока.ТипСравнения = "Не в группе" Тогда
			НоваяСтрока.ТипСравнения = ВидСравнения.НеВИерархии;
			
		Иначе
			Если ТекСтрока.ТипСравнения = "Равно" Тогда
				НоваяСтрока.ТипСравнения = ВидСравнения.Равно;
			ИначеЕсли ТекСтрока.ТипСравнения = "Не равно" Тогда
				НоваяСтрока.ТипСравнения = ВидСравнения.НеРавно;
			ИначеЕсли ТекСтрока.ТипСравнения = "Меньше или" Тогда
				НоваяСтрока.ТипСравнения = ВидСравнения.МеньшеИлиРавно;
			ИначеЕсли ТекСтрока.ТипСравнения = "Меньше" Тогда
				НоваяСтрока.ТипСравнения = ВидСравнения.Меньше;
			ИначеЕсли ТекСтрока.ТипСравнения = "Больше или" Тогда
				НоваяСтрока.ТипСравнения = ВидСравнения.БольшеИлиРавно;
			ИначеЕсли ТекСтрока.ТипСравнения = "Больше" Тогда
				НоваяСтрока.ТипСравнения = ВидСравнения.Больше;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока.Значение = ЗначениеПараметра;
		
	КонецЦикла;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция РеквизитЕстьПриВыборкеИзРегистра(ИмяРегистра, ИмяРеквизита)
	ЗапросВсехРеквизитов = Новый Запрос("ВЫБРАТЬ Т.Регистратор." + ИмяРеквизита + " ИЗ " + ИмяРегистра + " КАК Т ГДЕ ЛОЖЬ");
	Попытка
		ТабВсехРеквизитов = ЗапросВсехРеквизитов.Выполнить();
		Возврат Истина
	Исключение
		Возврат Ложь;
	КонецПопытки; 
КонецФункции

Функция ПолучитьСписокПараметров(НастройкаФП, ВидДохода, Параметр, ТипОплаты)
	СписокПараметров = Новый СписокЗначений;
	ТаблицаПараметров = НастройкаФП.Ссылка.СпискиЗначенийПараметров;
	Для Каждого ТекСтрока Из ТаблицаПараметров Цикл
		
		Если НЕ ТекСтрока.ВидДохода = ВидДохода Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ТекСтрока.ТипОплаты = ТипОплаты И ЗначениеЗаполнено(ТекСтрока.ТипОплаты) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ТекСтрока.Параметр = Параметр Тогда
			Продолжить;
		КонецЕсли;	
		
		СписокПараметров.Добавить(ТекСтрока.Значение);
		
	КонецЦикла;
	Возврат СписокПараметров;	
КонецФункции

Функция ПолучитьПоследнююНастройку(Организация, ФППоОрганизациям, НаДату) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_ФП_Настройка.Ссылка
	|ИЗ
	|	Документ.ИА_ФП_Настройка КАК ИА_ФП_Настройка
	|ГДЕ
	|	ИА_ФП_Настройка.Проведен = ИСТИНА
	|	И (ИА_ФП_Настройка.Организация = &Организация
	|			ИЛИ &НеРазделять)
	|	И ИА_ФП_Настройка.Дата <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИА_ФП_Настройка.Дата УБЫВ";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НеРазделять", не ФППоОрганизациям);
	Запрос.УстановитьПараметр("Дата", НаДату);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ИА_ФП_Настройка.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ПолучитьГраницыМесяца(пМесяц) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МИНИМУМ(ИА_РаспределениеНедель.Период) КАК Период,
	|	МАКСИМУМ(ИА_РаспределениеНедель.КонецНедели) КАК КонецНедели
	|ИЗ
	|	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	|ГДЕ
	|	ИА_РаспределениеНедель.Месяц = &Месяц";
	Запрос.УстановитьПараметр("Месяц", пМесяц);
	Выборка = Запрос.Выполнить().Выбрать();
	Рез = Новый Структура("ДатаНачала,ДатаКонца", Дата(1,1,1), Дата(1,1,1));
	Если Выборка.Следующий() и ЗначениеЗаполнено(Выборка.Период) Тогда
		Рез.ДатаНачала = Выборка.Период;
		Рез.ДатаКонца = КонецДня(Выборка.КонецНедели);
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Функция ПолучитьГоловнуюОрганизацию(Организация) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка,
	|	ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ИЗ
	|	Справочник.ИА_ГруппыКомпаний.ДочерниеОрганизации КАК ИА_ГруппыКомпанийДочерниеОрганизации
	|ГДЕ
	|	ИА_ГруппыКомпанийДочерниеОрганизации.Организация = &Организация
	|	И ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ГоловнаяОрганизация;
	Иначе
		Возврат Организация;
	КонецЕсли;
КонецФункции

Функция ВычислитьФормулу(ДеревоПолитикаПервичнаяЗнач, ДеревоПолитикаЗнач, Объект, пФормула, пНал, ФП1=Ложь) Экспорт
	
	Постфикс = ?(ФП1, "ФП1","");
	
	Если СокрЛП(пФормула) = "" Тогда
		Возврат "0";
	КонецЕсли;
	
	СтруктураПеременных = Новый Соответствие;
	
	Если не фп1 Тогда
		Для каждого стр из Объект.РаспределениеСредствСФондов Цикл
			СтруктураПеременных.Вставить("[РСФ Сумма:"+стр.Подразделение+"$"+стр.Фонд+"]", ?(пНал, стр.СуммаНал, стр.СуммаБезнал));
		КонецЦикла;
		
		СтруктураПеременных.Вставить("[РСФИтого]", ?(пНал,Объект.РаспределениеСредствСФондов.Итог("СуммаНал"), Объект.РаспределениеСредствСФондов.Итог("СуммаБезнал")));
	КонецЕсли;
	
	Для каждого стр из Объект["Доходы"+Постфикс] Цикл
		СтруктураПеременных.Вставить("[Доход:"+стр.ВидДохода+"]", ?(пНал, стр.СуммаНал, стр.СуммаБезнал));
	КонецЦикла;
	
	Для каждого стр из Объект.ЗапросыДанных Цикл
		СтруктураПеременных.Вставить(стр.ИмяПараметра, ?(пНал, стр.СуммаНал, стр.Сумма));
	КонецЦикла;
	
	СтруктураПеременных.Вставить("[ДоходыИтого]", ?(пНал,Объект["Доходы"+Постфикс].Итог("СуммаНал"), Объект["Доходы"+Постфикс].Итог("СуммаБезнал")));
	
	СтруктураПеременных.Вставить("[СКР1]", ?(пНал, Объект.ПредварительнаяСуммаКРаспределениюНал1, Объект["ПредварительнаяСуммаКРаспределениюБезнал1"+Постфикс]));
	
	// политика1
	ПредРаздел = Неопределено;
	Для каждого стр из ДеревоПолитикаПервичнаяЗнач.Строки Цикл
		Если ТипЗнч(стр.Раздел) = Тип("Строка") Тогда // итог
			СтруктураПеременных.Вставить("[П1 Итог:"+ПредРаздел+"]", ?(пНал, стр.СуммаНал, стр.СуммаБезнал));
		КонецЕсли;
		
		Для каждого стрФонд из стр.Строки Цикл
			СтруктураПеременных.Вставить("[П1 Сумма:"+стрФонд.Подразделение+"$"+стрФонд.Фонд+"]", ?(пНал, стрФонд.СуммаНал, стрФонд.СуммаБезнал));
		КонецЦикла;
		ПредРаздел = стр.Раздел;
	КонецЦикла;
	
	СтруктураПеременных.Вставить("[СКР2]", ?(пНал, Объект.ПредварительнаяСуммаКРаспределениюНал, Объект["ПредварительнаяСуммаКРаспределениюБезнал"+Постфикс]));
	
	Если не ФП1 Тогда
		// спецдоход
		ДоходыБПСвернуто = Объект.ДоходыБП_Распределение.Выгрузить();
		ДоходыБПСвернуто.Свернуть("ВидДохода","СуммаНал,СуммаБезнал");
		Для каждого стр из ДоходыБПСвернуто Цикл
			СтруктураПеременных.Вставить("[СпецдоходРаспр:"+стр.ВидДохода+"]", ?(пНал, стр.СуммаНал, стр.СуммаБезнал));
		КонецЦикла;
		
		ОтложенныйДоходСвернуто = Объект.ОтложенныйДоход.Выгрузить();
		ОтложенныйДоходСвернуто.Свернуть("ВидДохода,ТипОперации","Сумма");
		Для каждого стр из ОтложенныйДоходСвернуто Цикл
			Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Вернуть Тогда
				СтруктураПеременных.Вставить("[СпецдоходРаспр:"+стр.ВидДохода+"]", стр.Сумма);
			КонецЕсли;
		КонецЦикла;
		
		//
		ДоходыБПСвернуто = Объект.ДоходыБП.Выгрузить();
		ДоходыБПСвернуто.Свернуть("ВидДохода","СуммаНал,СуммаБезнал");
		Для каждого стр из ДоходыБПСвернуто Цикл
			СтруктураПеременных.Вставить("[Спецдоход:"+стр.ВидДохода+"]", ?(пНал, стр.СуммаНал, стр.СуммаБезнал));
		КонецЦикла;
		Для каждого стр из ОтложенныйДоходСвернуто Цикл
			Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить Тогда
				СтруктураПеременных.Вставить("[СпецдоходРаспр:"+стр.ВидДохода+"]", стр.Сумма);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураПеременных.Вставить("[МаржПр]", ?(пНал, Объект.МаржинальнаяПрибыльНал, Объект["МаржинальнаяПрибыльБезНал"+Постфикс]));
	
	// политика2
	ПредРаздел = Неопределено;
	
	Для каждого стр из ДеревоПолитикаЗнач.Строки Цикл
		Если ТипЗнч(стр.Раздел) = Тип("Строка") Тогда // итог
			СтруктураПеременных.Вставить("[П2 Итог:"+ПредРаздел+"]", ?(пНал, стр.СуммаНал, стр.СуммаБезнал));
		КонецЕсли;
		
		Для каждого стрФонд из стр.Строки Цикл
			СтруктураПеременных.Вставить("[П2 Сумма:"+стрФонд.Подразделение+"$"+стрФонд.Фонд+"]", ?(пНал, стрФонд.СуммаНал, стрФонд.СуммаБезнал));
		КонецЦикла;
		ПредРаздел = стр.Раздел;
	КонецЦикла;
	
	//вычисление
	пФормула1 = пФормула;
	Для каждого переменная из СтруктураПеременных Цикл
		пФормула1 = СтрЗаменить(пФормула1, переменная.Ключ, Формат(переменная.Значение,"ЧРД=.; ЧН=; ЧГ="));	
	КонецЦикла;
	пФормула1 = СтрЗаменить(пФормула1, Символы.ПС, "");	
	
	// Проверка на пустые значения
	СтеретьПустыеЗначенияФормулы(пФормула1, "[РСФ");
	СтеретьПустыеЗначенияФормулы(пФормула1, "[П1");
	СтеретьПустыеЗначенияФормулы(пФормула1, "[П2");
	СтеретьПустыеЗначенияФормулы(пФормула1, "[СпецдоходРаспр:");
	СтеретьПустыеЗначенияФормулы(пФормула1, "[Спецдоход:");
	СтеретьПустыеЗначенияФормулы(пФормула1, "[Доход:");
	СтеретьПустыеЗначенияФормулы(пФормула1, "[Запрос:");
	
	Если СокрЛП(пФормула1) = "" Тогда
		Возврат "0";
	КонецЕсли;
	
	Возврат пФормула1;
КонецФункции

Процедура СтеретьПустыеЗначенияФормулы(пФормула1, пПерфикс)
	
	поз = Найти(пФормула1, пПерфикс);
	Пока поз>0 Цикл
		левЧасть = лев(пФормула1, поз-1);
		правЧасть = Прав(пФормула1, СтрДлина(пФормула1)-поз);
		ПозЗакр = найти(правЧасть,"]");
		
		Если ПозЗакр = 0 Тогда
			Сообщить("Ошибка формулы:" + пФормула1);
			Возврат;
		КонецЕсли;
		
		правЧасть = прав(правЧасть, СтрДлина(правЧасть)-ПозЗакр); 
		пФормула1 = левЧасть + "0" + правЧасть; 
		поз = Найти(пФормула1, пПерфикс);
	КонецЦикла;
КонецПроцедуры

Функция ЭтоРСФ() Экспорт
	возврат ИА_ПраваС.ЗначениеПраваТекПользователя(ПланыВидовХарактеристик.ИА_ПраваПользователей.РСФ) ИЛИ ИА_ПраваС.ЗначениеПраваТекПользователя(ПланыВидовХарактеристик.ИА_ПраваПользователей.ФП_ПолныеПрава);
КонецФункции

Функция ПолучитьПодразделениеПоФонду(Отбор) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ТекущееПодразделение = Справочники.ИА_ЦФО.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИА_НастройкаФП.Ссылка
	|ПОМЕСТИТЬ втПоследнийРегистратор
	|ИЗ
	|	Документ.ИА_ФП_Настройка КАК ИА_НастройкаФП
	|ГДЕ
	|	ИА_НастройкаФП.Проведен = ИСТИНА
	|	И ИА_НастройкаФП.Организация = &Организация
	|	И ИА_НастройкаФП.Дата <= &НаДату
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИА_НастройкаФП.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПоследнийРегистратор.Ссылка,
	|	ИА_НастройкаФППолитикаРаспределения.Подразделение
	|ПОМЕСТИТЬ втПодразделения
	|ИЗ
	|	втПоследнийРегистратор КАК втПоследнийРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИА_ФП_Настройка.Политика2 КАК ИА_НастройкаФППолитикаРаспределения
	|		ПО втПоследнийРегистратор.Ссылка = ИА_НастройкаФППолитикаРаспределения.Ссылка
	|ГДЕ
	|	ИА_НастройкаФППолитикаРаспределения.Статья = &Фонд
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втПоследнийРегистратор.Ссылка,
	|	ИА_НастройкаФППолитикаРаспределенияПервичная.Подразделение
	|ИЗ
	|	втПоследнийРегистратор КАК втПоследнийРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИА_ФП_Настройка.Политика1 КАК ИА_НастройкаФППолитикаРаспределенияПервичная
	|		ПО втПоследнийРегистратор.Ссылка = ИА_НастройкаФППолитикаРаспределенияПервичная.Ссылка
	|ГДЕ
	|	ИА_НастройкаФППолитикаРаспределенияПервичная.Статья = &Фонд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	втПодразделения.Подразделение
	|ИЗ
	|	втПодразделения КАК втПодразделения";
	
	
	Запрос.УстановитьПараметр("НаДату",      КонецДня(Отбор.Дата));
	Запрос.УстановитьПараметр("Организация", Отбор.Организация);
	Запрос.УстановитьПараметр("Фонд",        Отбор.Фонд);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ Выборка.Количество() = 0 Тогда
		Пока Выборка.Следующий() Цикл
			ТекущееПодразделение = Выборка.Подразделение;     	
		КонецЦикла; 
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|   ИА_ФондыПодразделения.Подразделение
		|ИЗ
		|   Справочник.ИА_Фонды.Подразделения КАК ИА_ФондыПодразделения
		|ГДЕ
		|   ИА_ФондыПодразделения.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Отбор.Фонд);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТекущееПодразделение = Выборка.Подразделение; 
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТекущееПодразделение;
	
КонецФункции // ПолучитьПодразделениеПоФонду()

Функция ЗаполнитьСписокФондамиПоПодразделениям(Отбор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Неопределено;
	ТекстЗапроса = "";
	
	Запрос = Новый Запрос;
	ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИА_НастройкаФП.Ссылка
	|ПОМЕСТИТЬ втПоследнийРегистратор
	|ИЗ
	|	Документ.ИА_ФП_Настройка КАК ИА_НастройкаФП
	|ГДЕ
	|	ИА_НастройкаФП.Проведен";
	
	Если НЕ Отбор.Организация = Справочники.Организации.ПустаяСсылка() Тогда	   
		ТекстЗапроса = ТекстЗапроса+"  
		|	И ИА_НастройкаФП.Организация = &Организация";
	КонецЕсли;									  
	
	ТекстЗапроса = ТекстЗапроса+"							  
	|	И ИА_НастройкаФП.Дата <= &НаДату
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИА_НастройкаФП.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПоследнийРегистратор.Ссылка,
	|	ИА_НастройкаФППолитикаРаспределения.Статья КАК Фонд
	|ПОМЕСТИТЬ втФонды
	|ИЗ
	|	втПоследнийРегистратор КАК втПоследнийРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИА_ФП_Настройка.Политика2 КАК ИА_НастройкаФППолитикаРаспределения
	|		ПО втПоследнийРегистратор.Ссылка = ИА_НастройкаФППолитикаРаспределения.Ссылка
	|ГДЕ
	|	ИА_НастройкаФППолитикаРаспределения.Подразделение = &Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втПоследнийРегистратор.Ссылка,
	|	ИА_НастройкаФППолитикаРаспределенияПервичная.Статья
	|ИЗ
	|	втПоследнийРегистратор КАК втПоследнийРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИА_ФП_Настройка.Политика1 КАК ИА_НастройкаФППолитикаРаспределенияПервичная
	|		ПО втПоследнийРегистратор.Ссылка = ИА_НастройкаФППолитикаРаспределенияПервичная.Ссылка
	|ГДЕ
	|	ИА_НастройкаФППолитикаРаспределенияПервичная.Подразделение = &Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втФонды.Фонд
	|ИЗ
	|	втФонды КАК втФонды";
	
	Запрос.Текст = ТекстЗапроса;		   
	Запрос.УстановитьПараметр("НаДату",        Отбор.НаДату );
	Если НЕ Отбор.Организация = Справочники.Организации.ПустаяСсылка() Тогда	
		Запрос.УстановитьПараметр("Организация",   Отбор.Организация);
	КонецЕсли;
	Запрос.УстановитьПараметр("Подразделение", Отбор.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Фонд");
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции // ЗаполнитьСписокФондамиПоПодразделениям()

Функция ВернутьСтатусЗВС(ЗВС) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ИсторияСтатусовЗВССрезПоследних.Статус,
	|	ИА_ИсторияСтатусовЗВССрезПоследних.ПричинаОтказа,
	|	ИА_ИсторияСтатусовЗВССрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних(, ЗВС = &ЗВС) КАК ИА_ИсторияСтатусовЗВССрезПоследних";
	
	Запрос.УстановитьПараметр("ЗВС", ЗВС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Структура = Новый Структура;
	
	Если Выборка.Количество() = 0 Тогда 
		Структура.Вставить("Статус",Перечисления.ИА_СостояниеЗаказа.ПустаяСсылка());
		Структура.Вставить("ПричинаОтказа","");
		Структура.Вставить("РегистраторФП",Ложь);
	Иначе
		Выборка.Следующий();
		Структура.Вставить("Статус",Выборка.Статус);
		Структура.Вставить("ПричинаОтказа",Выборка.ПричинаОтказа);
		Структура.Вставить("РегистраторФП",?(ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ИА_ФинансовоеПланирование"),Истина,Ложь));
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

//ИА_Арчил Тваладзе 2016.05.29
Процедура ВидимостьЭлементовФормыНастройкиОрганизаций(Форма)  Экспорт
	
	ВестиФППоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ИспользуютсяГруппыКомпаний = Справочники.ИА_ГруппыКомпаний.ПолучитьПризнакИспользованияГруппКомпаний();
	
	Форма.Элементы.ГруппаОрганизация.Видимость = ВестиФППоОрганизациям;
	
	Форма.Элементы.Организация.ТолькоПросмотр = ИспользуютсяГруппыКомпаний;
	Форма.Элементы.ОрганизацияДочерняя.Видимость = ИспользуютсяГруппыКомпаний;
	
	Форма.Элементы.Организация.Заголовок         =?(ИспользуютсяГруппыКомпаний, "Организация (головная)", "Организация");
	Форма.Элементы.ОрганизацияДочерняя.Заголовок =?(ИспользуютсяГруппыКомпаний, "Организация (дочерняя)", "Организация");
	
КонецПроцедуры
//Конец Арчил Тваладзе

Процедура ИА_ОбработкаПроведенияВходящейПлатежкиОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Экспорт
	
	Попытка
		тч = ЭтотОбъект.ИА_ЗаказыНаПриобретение;
	Исключение
		Возврат; // по новой схеме нет ТЧ
	КонецПопытки;
	
	Попытка
		Если не ЭтотОбъект.Оплачено Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ЭтотОбъект.ИА_ЗаказыНаПриобретение.Количество() = 0 И ЭтотОбъект.ИА_Фонды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	СуммаДокумента = 0;
	Попытка 
		СуммаДокумента = ЭтотОбъект.СуммаДокумента;
	Исключение
	КонецПопытки;
	Если СуммаДокумента > 0 И ЭтотОбъект.ИА_ЗаказыНаПриобретение.Итог("Сумма")+ЭтотОбъект.ИА_Фонды.Итог("Сумма")> 0 И ЭтотОбъект.ИА_ЗаказыНаПриобретение.Итог("Сумма")+ЭтотОбъект.ИА_Фонды.Итог("Сумма") <> СуммаДокумента  Тогда
		Сообщить("Сумма по фондам и заявкам должна быть равна сумме документа!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ФППоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ОрганизацияФП = ПолучитьГоловнуюОрганизацию(ЭтотОбъект.Организация);
	
	ЭтоВПС = ТипЗнч(ЭтотОбъект) = тип("ДокументОбъект.КСУ_ВнедоходноеПоступлениеСредств");
	// валюта
	Если ЭтоВПС Тогда
		ПересчитыватьВВалюту = Ложь;
		СтрокаКурсыВалют = Ложь;
	Иначе
		СтруктураНастройкиРеквизитов = ИА_ФП_ПовторИсп.ПолучитьЗначениеКонстанты_ФП_НастройкиРеквизитов(); 
		ВалютаУПР = Константы[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаУПР].Получить();
		ВалютаДокумента = ЭтотОбъект[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаДокумента];	
		Если ВалютаДокумента = ВалютаУПР Тогда
			ПересчитыватьВВалюту = Ложь;
			СтрокаКурсыВалют = Ложь;
		Иначе
			ПересчитыватьВВалюту = Истина;
			СтрокаКурсыВалют = ПолучитьКурсКратностьВалют(ЭтотОбъект.Дата,ВалютаУПР, ВалютаДокумента);
		КонецЕсли;
	КонецЕсли;
		
	// движения
	ЭтотОбъект.Движения.ИА_СредстваНаФондах.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_СредстваНаФондах.Очистить();
	
	ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.Очистить();
	
	ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.Очистить();
	
	ЭтотОбъект.Движения.ИА_ИсторияСтатусовЗВС.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_ИсторияСтатусовЗВС.Очистить();
	
	//ЭтотОбъект.Движения.КСУ_ЛентаСобытий.Записывать = Истина;
	//ЭтотОбъект.Движения.КСУ_ЛентаСобытий.Очистить();
	
	
	// ФОНДЫ
	Для каждого стр из ЭтотОбъект.ИА_Фонды Цикл
		Проводка = ЭтотОбъект.Движения.ИА_СредстваНаФондах.ДобавитьПриход();
		Проводка.Период     = ЭтотОбъект.Дата;
		Если ФППоОрганизациям Тогда
			Проводка.Организация = ОрганизацияФП;
		КонецЕсли;
		Проводка.Фонд 	= стр.Фонд;
		Проводка.Подразделение 	= Стр.Подразделение;
		Проводка.СуммаБезНал = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
		
		Проводка.Операция = Перечисления.КСУ_ОперацииПоФондам.ВнедоходноеПоступление;
		Если ЭтоВПС ТОгда			
			Проводка.ПояснениеТекст = строка(ЭтотОбъект.ТипИсточникаСредств) + " " + ЭтотОбъект.ИсточникСредств;
	    КонецЕсли;
	КонецЦикла;
	
	
	// Заказы
	ТЗ_ЗаказыНаПриобретение = ЭтотОбъект.ИА_ЗаказыНаПриобретение.Выгрузить();
	ТЗ_ЗаказыНаПриобретение.Свернуть("ЗП","Сумма");
	
	Для каждого стр из ТЗ_ЗаказыНаПриобретение Цикл
		ЗП = стр.ЗП;
		
		// Проверка на превышение оплаты
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	-СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, &ДатаКонца, Регистратор, ЗП = &ЗП) КАК ИА_СредстваВРезервеНаФондахОбороты
		|ГДЕ
		|	НЕ(ИА_СредстваВРезервеНаФондахОбороты.Регистратор ССЫЛКА Документ.ИА_ФинансовоеПланирование
		|				ИЛИ ИА_СредстваВРезервеНаФондахОбороты.Регистратор ССЫЛКА Документ.ИА_ЗакрытиеЗаказаНаПриобретение)";
		Запрос.УстановитьПараметр("ЗП", ЗП);
		Запрос.УстановитьПараметр("ДатаКонца", ЭтотОбъект.Дата - 1);
		Выборка = Запрос.Выполнить().Выбрать();
		МаксСумма =0;
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Сумма) Тогда
			МаксСумма = Выборка.Сумма;
		КонецЕсли;
		
		Если Стр.Сумма > МаксСумма Тогда
			Сообщить("По заказу "+ЗП.Номер+" сумма к возврату больше выплаченной (выплачено "+МаксСумма+")!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		//
		
		Фонд = ЗП.Фонд;
		Подразделение = ЗП.Подразделение;
		
		Проводка = ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.ДобавитьРасход();
		Проводка.Период     = ЭтотОбъект.Дата;
		Если ФППоОрганизациям Тогда
			Проводка.Организация = ОрганизацияФП;
		КонецЕсли;
		Проводка.Фонд 	= Фонд;
		Проводка.Подразделение 	= Подразделение;
		Проводка.ЗП = ЗП;
		Проводка.СуммаБезНал = -Стр.Сумма;
		
		
		Проводка = ЭтотОбъект.Движения.ИА_СредстваНаФондах.ДобавитьРасход();
		Проводка.Период     = ЭтотОбъект.Дата;
		Если ФППоОрганизациям Тогда
			Проводка.Организация = ОрганизацияФП;
		КонецЕсли;
		Проводка.Фонд 	= Фонд;       
		Проводка.Подразделение 	= Подразделение;
		Проводка.СуммаБезНал = -Стр.Сумма;
		
		Проводка.Операция = Перечисления.КСУ_ОперацииПоФондам.ВнедоходноеПоступление;
		Если ЭтоВПС ТОгда			
			Проводка.ПояснениеТекст = строка(ЭтотОбъект.ТипИсточникаСредств) + " " + ЭтотОбъект.ИсточникСредств;
			Проводка.ПояснениеСсылка = ЗП;
	    КонецЕсли;
				
		Проводка = ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.ДобавитьПриход();
		Проводка.Период     = ЭтотОбъект.Дата;
		Проводка.Организация = ЗП.Организация;
		Проводка.ЗП 	= ЗП;       
		Проводка.Сумма = -Стр.Сумма;
	КонецЦикла;
	
	СформироватьДвиженияПлатежкиПоСтатусам(ЭтотОбъект, ТЗ_ЗаказыНаПриобретение, ложь);
	
КонецПроцедуры

Функция ПолучитьСписокОрганизацийГК(Организация) Экспорт
	ИспользуютсяГруппыКомпаний = Справочники.ИА_ГруппыКомпаний.ПолучитьПризнакИспользованияГруппКомпаний();
	Массив = Новый Массив;
	Если НЕ ИспользуютсяГруппыКомпаний Тогда
		Массив.Добавить(Организация);
		Возврат Массив;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка
		|ПОМЕСТИТЬ ГКВсе
		|ИЗ
		|	Справочник.ИА_ГруппыКомпаний.ДочерниеОрганизации КАК ИА_ГруппыКомпанийДочерниеОрганизации
		|ГДЕ
		|	ИА_ГруппыКомпанийДочерниеОрганизации.Организация = &Организация
		|	И НЕ ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка
		|ИЗ
		|	Справочник.ИА_ГруппыКомпаний.ДочерниеОрганизации КАК ИА_ГруппыКомпанийДочерниеОрганизации
		|ГДЕ
		|	ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка.ГоловнаяОрганизация = &Организация
		|	И НЕ ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИА_ГруппыКомпаний.ГоловнаяОрганизация КАК Организация
		|ПОМЕСТИТЬ ОбъедОрг
		|ИЗ
		|	ГКВсе КАК ГКВсе
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_ГруппыКомпаний КАК ИА_ГруппыКомпаний
		|		ПО ГКВсе.Ссылка = ИА_ГруппыКомпаний.Ссылка
		|ГДЕ
		|	НЕ ИА_ГруппыКомпаний.ГоловнаяОрганизация.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИА_ГруппыКомпанийДочерниеОрганизации.Организация
		|ИЗ
		|	ГКВсе КАК ГКВсе
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_ГруппыКомпаний.ДочерниеОрганизации КАК ИА_ГруппыКомпанийДочерниеОрганизации
		|		ПО ГКВсе.Ссылка = ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка
		|ГДЕ
		|	НЕ ИА_ГруппыКомпанийДочерниеОрганизации.Организация.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|	И НЕ Организации.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъедОрг.Организация
		|ИЗ
		|	ОбъедОрг КАК ОбъедОрг
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъедОрг.Организация";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Массив.Добавить(ВыборкаДетальныеЗаписи.Организация);
		КонецЦикла;
		
	КонецЕсли;
	Возврат Массив;
	
КонецФункции

процедура ОбработатьТЧЗаказыПоВалюте(ЭтотОбъект, тз_заказы) Экспорт
	СтруктураНастройкиРеквизитов = ИА_ФП_ПовторИсп.ПолучитьЗначениеКонстанты_ФП_НастройкиРеквизитов(); 
	
	СуммаДокумента = 0;
	Попытка 
		СуммаДокумента = ЭтотОбъект.СуммаДокумента;
	Исключение
	КонецПопытки;
	
	Если СуммаДокумента = 0 ИЛИ тз_заказы.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ВалютаУПР = ИА_ФП_ПовторИсп.ПолучитьЗначениеКонстанты_ФП(СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаУПР);
	ВалютаДокумента = ЭтотОбъект[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаДокумента];
	
	Если ВалютаДокумента = ВалютаУПР Тогда
		возврат;
	КонецЕсли;
	
	СтрокаКурсыВалют = ПолучитьКурсКратностьВалют(ЭтотОбъект.Дата,ВалютаУПР, ВалютаДокумента);
	
	Для каждого стр из тз_заказы Цикл
		стр.Сумма = ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаУПР,ВалютаДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КратностьУпрУчета,  СтрокаКурсыВалют.КратностьДокумента, Истина);
	КонецЦикла;
	
КонецПроцедуры

Функция СтатусыОдобрено(ВключаяЗакрытие = ложь) Экспорт
	рез = новый Массив;
	рез.Добавить(Перечисления.ИА_СостояниеЗаказа.ОдобренПолностью_ВсёВыплачено);
	рез.Добавить(Перечисления.ИА_СостояниеЗаказа.ОдобренПолностью_НетВыплат);
	рез.Добавить(Перечисления.ИА_СостояниеЗаказа.ОдобренПолностью_ЧастичныеВыплаты);
	рез.Добавить(Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_ВсёВыплачено);
	рез.Добавить(Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_НетВыплат);
	рез.Добавить(Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_ЧастичныеВыплаты);
	
	Если ВключаяЗакрытие Тогда
		рез.Добавить(Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_Закрыт);
		рез.Добавить(Перечисления.ИА_СостояниеЗаказа.ОдобренПолностью_Закрыт);
		рез.Добавить(Перечисления.ИА_СостояниеЗаказа.Закрыт);
	КонецЕсли;
	
	Возврат рез;
КонецФункции

Процедура КСУ_ПриЗаписиВходящейПлажекиПриЗаписи(Источник, Отказ) Экспорт
	ссылкаВДПС = ИА_ФПСервер.ПолучитьСсылкуНаВДПС(Источник.ссылка);
	
	Если не ЗначениеЗаполнено(ссылкаВДПС) тогда
		возврат;
	КонецЕсли;
	
	ВДПС_об = ссылкаВДПС.ПолучитьОбъект();
	Если ВДПС_об.проведен тогда
		ВДПС_об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	ВДПС_об.Заполнить(новый Структура("Ссылка, ЭтоПлатежка", Источник.ссылка, Истина));
	ВДПС_об.Записать(РежимЗаписиДокумента.Запись);
	
	Если Источник.Проведен Тогда
		
		Если ВДПС_об.СуммаДокумента <> ВДПС_об.ИА_ЗаказыНаПриобретение.Итог("Сумма") + ВДПС_об.ИА_Фонды.Итог("Сумма") Тогда 
			Сообщить("Документ """+Источник.ссылка+""" связан с """ + ссылкаВДПС + """. Обнаружено расхождение в суммах. Вам необходимо открыть 
				|Внедоходное поступление из платежного документа, проверить и
				|скорректировать суммы распределения по фондам или заказам на приобретение.", СтатусСообщения.ОченьВажное);
			возврат;
		КонецЕсли;
		
		Попытка
			ВДПС_об.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Внимание! Не удалось провести Внедоходное поступление! Откройте его по ссылке, откорректируйте и проведите!", СтатусСообщения.Важное);
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры


Процедура КСУ_ПриЗаписиСтатьиДДСПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.этогруппа Тогда
		возврат;
	КонецЕсли;
	
	Если Константы.КСУ_СинхронизацияСтатейИПодразделений.Получить() = ложь тогда
		возврат;
	КонецЕсли;
	
	фонд = Константы.КСУ_ФондДляНовыхСтатей.Получить();
	
	Если фонд.Пустая() тогда
		возврат;
	КонецЕсли;
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_СтатьиРасходов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КСУ_СтатьиРасходов КАК КСУ_СтатьиРасходов
	               |ГДЕ
	               |	КСУ_СтатьиРасходов.Статья = &Статья";
	Запрос.УстановитьПараметр("Статья", Источник.ссылка);
	выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		об  = выборка.Ссылка.ПолучитьОбъект();
	Иначе
		об = Справочники.КСУ_СтатьиРасходов.СоздатьЭлемент();
	КонецЕсли;
	
	об.Владелец = фонд;
	об.статья =Источник.ссылка; 
	об.Наименование = Источник.Наименование;
	об.ПометкаУдаления = Источник.ПометкаУдаления;
	
	об.Записать();
КонецПроцедуры

Процедура КСУ_ПриЗаписиПодразделенияПриЗаписи(Источник, Отказ) Экспорт
	
	Если Константы.КСУ_СинхронизацияСтатейИПодразделений.Получить() = ложь тогда
		возврат;
	КонецЕсли;
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ЦФО.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ИА_ЦФО КАК ИА_ЦФО
	               |ГДЕ
	               |	ИА_ЦФО.Подразделение = &Подразделение";
	Запрос.УстановитьПараметр("Подразделение", Источник.ссылка);
	выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		об  = выборка.Ссылка.ПолучитьОбъект();
	Иначе
		об = Справочники.ИА_ЦФО.СоздатьЭлемент();
	КонецЕсли;
	
	об.Подразделение =Источник.ссылка; 
	об.Наименование = Источник.Наименование;
	об.ПометкаУдаления = Источник.ПометкаУдаления;
	
	об.Записать();
КонецПроцедуры

Процедура ИА_ОтменыПроведенияПлатежкиОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	попытка 
		ич = Источник.ИА_ЗаказыНаПриобретение;
	Исключение
		Возврат;
	КонецПопытки;
	
	Для каждого стр из Источник.ИА_ЗаказыНаПриобретение Цикл
		Движение = РегистрыСведений.КСУ_ЛентаСобытий.СоздатьМенеджерЗаписи();
		Движение.ПериодСобытия = Источник.Дата;
		Движение.ДатаСобытия = ТекущаяДата();
		Движение.Объект = стр.ЗП;		
		Движение.Событие = "Отмена выплаты №" + Источник.Номер+" на сумму "+ формат(стр.Сумма,"ЧДЦ=2");
		Движение.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Движение.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ИА_ОбработкаОтменыПроведенияВходящейПлатежкиОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	попытка 
		ич = Источник.ИА_ЗаказыНаПриобретение;
	Исключение
		Возврат;
	КонецПопытки;
	
	Для каждого стр из Источник.ИА_ЗаказыНаПриобретение Цикл
		Движение = РегистрыСведений.КСУ_ЛентаСобытий.СоздатьМенеджерЗаписи();
		Движение.ПериодСобытия = Источник.Дата;
		Движение.ДатаСобытия = ТекущаяДата();
		Движение.Объект = стр.ЗП;		
		Движение.Событие = "Отмена Возврата средств №" + Источник.Номер+" на сумму "+ формат(стр.Сумма,"ЧДЦ=2");
		Движение.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Движение.Записать();
	КонецЦикла;
КонецПроцедуры
