#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.СчетФактураВыданный";
    КомандаПечати.Идентификатор = "СчетФактура";
    КомандаПечати.Представление = НСтр("ru = 'Счет-фактура'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.СчетФактураВыданный";
    КомандаПечати.Идентификатор = "УПД";
    КомандаПечати.Представление = НСтр("ru = 'Универсальный передаточный документ'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"СчетФактура", 
			НСтр("ru = 'Счет-фактура'"), 
			ПечатьСчетФактуры(МассивОбъектов, ОбъектыПечати));
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УПД") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"УПД", 
			НСтр("ru = 'Универсальный передаточный документ'"), 
			ПечатьУПД(МассивОбъектов, ОбъектыПечати));
	
		КонецЕсли;
		
КонецПроцедуры

Функция ПечатьСчетФактуры(МассивОбъектов, ОбъектыПечати) Экспорт
	
 	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_СчетФактура";
	//Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура981"); //ПолучитьОбщийМакет("ПФ_MXL_СчетФактура981");
	
	ПервыйДокумент = Истина;
	Для каждого ДокументПечати из МассивОбъектов Цикл
		Если ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
			ДокументСчетФактуры = НайтиСчетФактуру(ДокументПечати);
			Если ДокументСчетФактуры = Неопределено Тогда
				ТекстОшибки = НСтр("ru = 'Для документа %1 не введен счет-фактура'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", Строка(ДокументПечати));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
				Возврат ТабличныйДокумент;
			Иначе
				ДанныеДляПечати = СобратьДанныеДляПечатиСчетФактурыПоРеализацииТоваровИУслуг(ДокументПечати, ДокументСчетФактуры);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.Монтаж") Тогда
			ДокументСчетФактуры = НайтиСчетФактуру(ДокументПечати);
			Если ДокументСчетФактуры = Неопределено Тогда
				ТекстОшибки = НСтр("ru = 'Для документа %1 не введен счет-фактура'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", Строка(ДокументПечати));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
				Возврат ТабличныйДокумент;
			Иначе
				ДанныеДляПечати = СобратьДанныеДляПечатиСчетФактурыПоМонтажу(ДокументПечати, ДокументСчетФактуры);
			КонецЕсли;

		ИначеЕсли ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			Если ТипЗнч(ДокументПечати.Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
				ДанныеДляПечати = СобратьДанныеДляПечатиСчетФактурыПоРеализацииТоваровИУслуг(ДокументПечати.Основание, ДокументПечати);
			ИначеЕсли ТипЗнч(ДокументПечати.Основание) = Тип("ДокументСсылка.Монтаж") Тогда
				ДанныеДляПечати = СобратьДанныеДляПечатиСчетФактурыПоМонтажу(ДокументПечати.Основание, ДокументПечати);
			КонецЕсли;
		КонецЕсли;
		
		ДанныеПечати = ДанныеДляПечати.Выбрать(); 
		Если ДанныеПечати.Следующий() Тогда
			
			Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.Монтаж") Тогда
				ДатаПодписанияДокумента = ОбщийМодульСервер.ПолучитьДатуПодписанияДокументаМонтажа(ДанныеПечати.Ссылка);
			Иначе
				ДатаПодписанияДокумента = ДанныеПечати.Дата;
			КонецЕсли;
			
			Если ДанныеПечати.Дата < '20210701' Тогда
				ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_СчетФактура";
				Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура981");
			Иначе
				ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_СчетФактура534";
				Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура534");				
			КонецЕсли;
	
			КоличествоСтраниц = 1;
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			// раньше было отдельной строкой 
			Если ДанныеПечати.Дата < '20210701' Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокПФ");
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
			КоличествоСтрок = 0;			
			ТЧТовары = ДанныеПечати.Товары.Выгрузить();
			ТЧТовары.Свернуть("ТоварКодТНВЭД,Акциз,СтранаПроисхожденияКод,ПредставлениеСтраны,ПредставлениеГТД,
							|Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,ЕдиницаИзмерения,ЕдиницаИзмеренияКод,Коэффициент,Цена,СтавкаНДС",
    						"Количество,Всего,СуммаНДС,Стоимость");	
			КоличествоСтрок = ТЧТовары.Количество();
			ЕстьУслуги = Ложь;
			Попытка 
				ТЧУслуги = ДанныеПечати.Услуги.Выгрузить();
				ТЧУслуги.Свернуть("ТоварКодТНВЭД,Акциз,СтранаПроисхожденияКод,ПредставлениеСтраны,ПредставлениеГТД,
							|Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,ЕдиницаИзмеренияКод,Коэффициент,Цена,СтавкаНДС",
    						"Количество,Всего,СуммаНДС,Стоимость");	
				КоличествоСтрок = КоличествоСтрок + ТЧУслуги.Количество();
				ЕстьУслуги = Истина;
			Исключение
			КонецПопытки;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер);
			СведенияОбОрганизации = ОбщийМодульСервер.СведенияОбОрганизации(ДанныеПечати.Организация, ДанныеПечати.Дата);
			СведенияОбКонтрагенте = ОбщийМодульСервер.СведенияОКонтрагенте(ДанныеПечати.Контрагент, ДанныеПечати.Дата);
			
			Если ДанныеПечати.Дата < '20210701' Тогда
				//ОбластьМакета.Параметры.Номер = "Счет-фактура № " + НомерДокумента + " от " + Формат(ДанныеПечати.Дата,"ДФ='dd MMMM yyyy ''г.'''");
				ОбластьМакета.Параметры.Номер = "Счет-фактура № " + НомерДокумента + " от " + Формат(ДатаПодписанияДокумента,"ДФ='dd MMMM yyyy ''г.'''");
				
				ОбластьМакета.Параметры.НомерИсправления = "Исправление № -- от --";
				ЗаголовокПоставщика      = "Продавец: ";
				ЗаголовокАдресПоставщика = "Адрес: ";
				ЗаголовокИННпоставщика   = "ИНН/КПП продавца: ";
				ЗаголовокГрузоотправителя = "Грузоотправитель и его адрес: ";
				ЗаголовокГрузополучателя  = "Грузополучатель и его адрес: ";
				ЗаголовокПРД = "К платежно-расчетному документу № ";
				
				ЗаголовокПокупателя      = "Покупатель: ";
				ЗаголовокАдресПокупателя = "Адрес: ";
				ЗаголовокИННПокупателя   = "ИНН/КПП покупателя: ";
				ЗаголовокВалюта = "Валюта: наименование, код ";
			Иначе
				ОбластьМакета.Параметры.Номер = НомерДокумента;
				//ОбластьМакета.Параметры.Дата = Формат(ДанныеПечати.Дата, "ДФ='dd MMMM yyyy ''г.'''");
				ОбластьМакета.Параметры.Дата = Формат(ДатаПодписанияДокумента, "ДФ='dd MMMM yyyy ''г.'''");
				ОбластьМакета.Параметры.НомерИсправления = "--";
				ОбластьМакета.Параметры.ДатаИсправления = "--";
				ЗаголовокПоставщика      = "";
				ЗаголовокАдресПоставщика = "";
				ЗаголовокИННпоставщика   = "";
				ЗаголовокГрузоотправителя = "";
				ЗаголовокГрузополучателя  = "";
				ЗаголовокПРД = "";
				
				ЗаголовокПокупателя      = "";
				ЗаголовокАдресПокупателя = "";
				ЗаголовокИННПокупателя   = "";
				
				ЗаголовокВалюта = "";		
			КонецЕсли;			
			
			ОбластьМакета.Параметры.ПредставлениеПоставщика	= ЗаголовокПоставщика + ДанныеПечати.ОрганизацияПолноеНаименование;
			ОбластьМакета.Параметры.АдресПоставщика	= ЗаголовокАдресПоставщика + СведенияОбОрганизации.ЮридическийАдрес;
			ОбластьМакета.Параметры.ИННПоставщика	= ЗаголовокИННпоставщика + ?(ЗначениеЗаполнено(ДанныеПечати.ИНН), ДанныеПечати.ИНН, "") + ?(ЗначениеЗаполнено(ДанныеПечати.КПП), "/"+ДанныеПечати.КПП, "");
			ОбластьМакета.Параметры.ПредставлениеГрузоотправителя	= ЗаголовокГрузоотправителя + "--";													
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя	= ЗаголовокГрузополучателя + "--";													
			ОбластьМакета.Параметры.ПоДокументу		= ЗаголовокПРД + "-- от --";
			Если ДанныеПечати.Дата >= '20210701' Тогда
				ОбластьМакета.Параметры.ДокументыОбОтгрузке = СведенияОДокументеОтгрузки(ДанныеПечати, КоличествоСтрок);
			КонецЕсли;				
			ОбластьМакета.Параметры.ПредставлениеПокупателя	= ЗаголовокПокупателя + ДанныеПечати.КонтрагентНаименованиеПолное;
			ОбластьМакета.Параметры.АдресПокупателя	= ЗаголовокАдресПокупателя + СведенияОбКонтрагенте.ЮридическийАдрес; 
			ОбластьМакета.Параметры.ИННПокупателя	= ЗаголовокИННПокупателя + ?(ЗначениеЗаполнено(ДанныеПечати.КонтрагентИНН), ДанныеПечати.КонтрагентИНН, "") + ?(ЗначениеЗаполнено(ДанныеПечати.КонтрагентКПП), "/"+ДанныеПечати.КонтрагентКПП, "");		
			ОбластьМакета.Параметры.Валюта	= ЗаголовокВалюта + ДанныеПечати.ВалютаНаименование + ", " + ДанныеПечати.ВалютаКод;														
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// раньше было отдельной строкой 
			Если ДанныеПечати.Дата < '20210701' Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
				ОбластьМакета.Параметры.ИдентификаторГосКонтракта = "Идентификатор государственного контракта, договора (соглашения) (при наличии): " + ДанныеПечати.ИдентификаторГосКонтракта;													
				ТабличныйДокумент.Вывести(ОбластьМакета);												
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			НомерСтроки = 1;
			НомерЛиста = 1;
						
			Для Каждого ТекущаяСтрока Из ТЧТовары Цикл
				ДопПараметрыСтроки = Новый Структура("НомерСтроки", НомерСтроки+1);
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Заполнить(ТекущаяСтрока);		
				ОбластьМакета.Параметры.Заполнить(ДопПараметрыСтроки);
				
				//++ №12909
				//ПредставлениеНоменклатуры = Строка(ТекущаяСтрока.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(ТекущаяСтрока.ХарактеристикаНоменклатуры));
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры);
				//-- №12909
				
				ОбластьМакета.Параметры.ТоварНаименование = ПредставлениеНоменклатуры;
				
				Если НомерСтроки > 1
					И НЕ ПроверитьВыводСчетаФактурыИУПДНаСтраницу(ТабличныйДокумент, ОбластьМакета, (НомерСтроки = КоличествоСтрок), Макет, НомерЛиста, НомерДокумента) Тогда
				
					КоличествоСтраниц = КоличествоСтраниц + 1;
				
				КонецЕсли; 				
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
			
			УслугиИтогСуммаНДС = 0;
			УслугиИтогВсего = 0;
			УслугиИтогСтоимость = 0;
			
			Если ЕстьУслуги Тогда
				Для Каждого ТекущаяСтрока Из ТЧУслуги Цикл
					ОбластьМакета = Макет.ПолучитьОбласть("Строка");
					ДопПараметрыСтроки = Новый Структура("НомерСтроки", НомерСтроки+1);
					ОбластьМакета = Макет.ПолучитьОбласть("Строка");
					ОбластьМакета.Параметры.Заполнить(ТекущаяСтрока);		
					ОбластьМакета.Параметры.Заполнить(ДопПараметрыСтроки);
					ПредставлениеНоменклатуры = Строка(ТекущаяСтрока.Номенклатура) + Строка(ОбщийМодульСервер.ПредставлениеХарактеристики(ТекущаяСтрока.ХарактеристикаНоменклатуры));
					ОбластьМакета.Параметры.ТоварНаименование = ПредставлениеНоменклатуры;
					
					Если НомерСтроки > 1
						И НЕ ПроверитьВыводСчетаФактурыИУПДНаСтраницу(ТабличныйДокумент, ОбластьМакета, (НомерСтроки = КоличествоСтрок), Макет, НомерЛиста, НомерДокумента) Тогда
				
						КоличествоСтраниц = КоличествоСтраниц + 1;
				
					КонецЕсли; 
				
					ТабличныйДокумент.Вывести(ОбластьМакета);
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла;
				
				УслугиИтогСуммаНДС =  ТЧУслуги.Итог("СуммаНДС");
				УслугиИтогВсего = ТЧУслуги.Итог("Всего");
				УслугиИтогСтоимость = ТЧУслуги.Итог("Стоимость");
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");		
			ОбластьМакета.Параметры.ИтогоСуммаНДС = ТЧТовары.Итог("СуммаНДС") + УслугиИтогСуммаНДС; 
			ОбластьМакета.Параметры.ИтогоВсего = ТЧТовары.Итог("Всего") + УслугиИтогВсего;
			ОбластьМакета.Параметры.ИтогоСтоимость = ТЧТовары.Итог("Стоимость") + УслугиИтогСтоимость ;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.ФИОРуководителя = ДанныеПечати.ФИОРуководителя;
			ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = ДанныеПечати.ФИОГлавногоБухгалтера;													
			ТабличныйДокумент.Вывести(ОбластьМакета);

					
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
					НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьУПД(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_УПД";
	
	ПервыйДокумент = Истина;
	Для каждого ДокументПечати из МассивОбъектов Цикл		 
		
		СтатусУПД = 1; // №6374 статус УПД зависит от наличия СФ
		НомерСчетФатуры = ""; // Если есть СФ, необходимо выводить её номер
		Если ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") ИЛИ ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.Монтаж") Тогда
			Если НайтиСчетФактуру(ДокументПечати) = Неопределено Тогда
				СтатусУПД = 2;
				
				// №6374 запретить формировать УПД, если нет счёт-фактуры и в документе есть позиции с НДС
				ЕстьНДС = Ложь;
				
				// Проверим по ТЧ "Товары" (РТиУ) или "ТоварыУслуги" (Монтаж)
				НаименованиеТабличнойЧасти = "Товары";
				Если ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.Монтаж") Тогда
					НаименованиеТабличнойЧасти = "ТоварыУслуги";
				КонецЕсли;
				Для Каждого ТекущаяСтрока Из ДокументПечати[НаименованиеТабличнойЧасти] Цикл
					Если НЕ ТекущаяСтрока.СтавкаНДС.Пустая() И НЕ ТекущаяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
						ЕстьНДС = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				// Проверим по ТЧ "Услуги" (РТиУ)
				Если НЕ ЕстьНДС И ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
					Для Каждого ТекущаяСтрока Из ДокументПечати.Услуги Цикл
						Если НЕ ТекущаяСтрока.СтавкаНДС.Пустая() И НЕ ТекущаяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
							ЕстьНДС = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				// Нет СФ и есть НДС, пропускаем документ
				Если ЕстьНДС Тогда
					Сообщить("В документе " + ДокументПечати + " указана ставка НДС, для печати УПД требуется наличие счёт-фактуры, документ пропущен.");
					Продолжить;
				КонецЕсли;
					
			КонецЕсли;
		КонецЕсли;		
		
		ЭтоМонтаж = Ложь;
		Если ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
			ДанныеДляПечати = СобратьДанныеДляПечатиУПДПоРеализацииТоваровИУслуг(ДокументПечати);
			
		ИначеЕсли ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.Монтаж") Тогда
			ДанныеДляПечати = СобратьДанныеДляПечатиУПДПоМонтажу(ДокументПечати);
			ЭтоМонтаж = Истина;

		ИначеЕсли ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			Если ТипЗнч(ДокументПечати.Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
				ДанныеДляПечати = СобратьДанныеДляПечатиУПДПоРеализацииТоваровИУслуг(ДокументПечати.Основание);
			ИначеЕсли ТипЗнч(ДокументПечати.Основание) = Тип("ДокументСсылка.Монтаж") Тогда
				ДанныеДляПечати = СобратьДанныеДляПечатиУПДПоМонтажу(ДокументПечати.Основание);
				ЭтоМонтаж = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ДанныеПечати = ДанныеДляПечати.Выбрать();		
			
		Если ДанныеПечати.Следующий() Тогда
			
			//++ 16688
			РасчетнаяДатаПечати = ДанныеПечати.Дата; // для варианта ПустаяСсылка / НеЗаполнять / ДатойДокумента 
			Если ЭтоМонтаж Тогда
				РасчетнаяДатаПечати = ОбщийМодульСервер.ПолучитьДатуПодписанияДокументаМонтажа(ДанныеПечати.Ссылка);
			КонецЕсли;	
			//-- 16688
		
			//Если ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.Монтаж") Тогда
			//	Если ДанныеПечати.Дата = Дата(1, 1, 1)  Тогда
			//		Сообщить("Документ " + ДокументПечати + " не в статусе ""Выполнен"" / ""Закрыт"". Документ пропущен.");
			//		Продолжить;	
			//	КонецЕсли;
			//КонецЕсли;
			
			Если ДанныеПечати.Дата < '20171001' Тогда
				Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_УПД");
			ИначеЕсли ДанныеПечати.Дата < '20210701' Тогда
				Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_УПД981");
			Иначе
				Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_УПД534");				
			КонецЕсли;			
			
			КоличествоСтраниц = 1;
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			КоличествоСтрок = 0;			
			ТЧТовары = ДанныеПечати.Товары.Выгрузить();
			ТЧТовары.Свернуть("Код,Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,ЕдиницаИзмерения,ЕдиницаИзмеренияКод,Коэффициент,Цена,СтавкаНДС, ТоварКодТНВЭД,СтранаПроисхожденияКод,ПредставлениеСтраны,ПредставлениеГТД",
    						"Количество,Сумма,СуммаНДС,СуммаБезНДС");			
			КоличествоСтрок = ТЧТовары.Количество();
			ЕстьУслуги = Ложь;
			Попытка 
				ТЧУслуги = ДанныеПечати.Услуги.Выгрузить();
				ТЧУслуги.Свернуть("Код,Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,ЕдиницаИзмеренияКод,Коэффициент,Цена,СтавкаНДС, ТоварКодТНВЭД,СтранаПроисхожденияКод,ПредставлениеСтраны,ПредставлениеГТД",
    						"Количество,Сумма,СуммаНДС,СуммаБезНДС");
				КоличествоСтрок = КоличествоСтрок + ТЧУслуги.Количество();
				ЕстьУслуги = Истина;
			Исключение
			КонецПопытки;
			
			Если ДанныеПечати.Дата >= '20210701' Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокПФ");
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
			Если НачалоДня(ДанныеПечати.Дата) >= Дата(2017, 7, 1) И НачалоДня(ДанныеПечати.Дата) < Дата(2017, 10, 1) Тогда // И НЕ ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.Монтаж") Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка625");
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			КонецЕсли;			
			
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.НомерДокумента);
			СведенияОбОрганизации = ОбщийМодульСервер.СведенияОбОрганизации(ДанныеПечати.Организация, РасчетнаяДатаПечати);
			СведенияОбКонтрагенте = ОбщийМодульСервер.СведенияОКонтрагенте(ДанныеПечати.Контрагент, РасчетнаяДатаПечати);
			
			ДопПараметрыШапки = Новый Структура("ПредставлениеПоставщика, АдресПоставщика, ОрганизацияЮридическийАдрес", СведенияОбОрганизации.Представление, СведенияОбОрганизации.ЮридическийАдрес, СведенияОбОрганизации.ЮридическийАдрес);
			//++16688
			// ОбластьМакета.Параметры.ДатаДокумента = Формат(ДанныеПечати.Дата,"ДЛФ=Д");
			ОбластьМакета.Параметры.ДатаДокумента = Формат(РасчетнаяДатаПечати,"ДЛФ=Д");
			//--16688
			ОбластьМакета.Параметры.НомерДокумента = НомерДокумента; // + " от " + Формат(ДанныеПечати.Дата,"ДФ='dd MMMM yyyy ''г.'''");
			//ОбластьМакета.Параметры.ОрганизацияЮридическийАдрес = СведенияОбОрганизации.ЮридическийАдрес;
			ОбластьМакета.Параметры.Заполнить(ДопПараметрыШапки);
			
			ОбластьМакета.Параметры.ИННПоставщика = ?(ЗначениеЗаполнено(ДанныеПечати.ИНН), ДанныеПечати.ИНН, "") + ?(ЗначениеЗаполнено(ДанныеПечати.КПП), "/"+ДанныеПечати.КПП, "");
			ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "он же";
			
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Строка(ДанныеПечати.КонтрагентНаименованиеПолное) + ", " + СведенияОбКонтрагенте.ФактическийАдрес;
			ОбластьМакета.Параметры.ПредставлениеПокупателя = ДанныеПечати.КонтрагентНаименованиеПолное;
			
			Если ДанныеПечати.Дата >= '20210701' Тогда
				ОбластьМакета.Параметры.ДокументыОбОтгрузке = СведенияОДокументеОтгрузки(ДанныеПечати, КоличествоСтрок);
			КонецЕсли;
			
			ОбластьМакета.Параметры.АдресПокупателя = СведенияОбКонтрагенте.ЮридическийАдрес;
			ОбластьМакета.Параметры.ИННПокупателя = ?(ЗначениеЗаполнено(ДанныеПечати.КонтрагентИНН), ДанныеПечати.КонтрагентИНН, "") + ?(ЗначениеЗаполнено(ДанныеПечати.КонтрагентКПП), "/"+ДанныеПечати.КонтрагентКПП, "");
			
			ОбластьМакета.Параметры.СтатусУПД = СтатусУПД;
			//ОбластьМакета.Параметры.Валюта	= "Валюта: наименование, код " + ДанныеПечати.ВалютаНаименование + ", " + ДанныеПечати.ВалютаКод;
			ОбластьМакета.Параметры.Валюта	= ДанныеПечати.ВалютаНаименование + ", " + ДанныеПечати.ВалютаКод;
			
			Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
				ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
					ТабличныйДокумент,
					Макет, 
					ОбластьМакета,
					ДанныеПечати.Ссылка);
			Иначе
				Попытка
					ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.КартинкаШтрихкода);
				Исключение
				КонецПопытки;
			КонецЕсли;
				
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			НомерСтроки = 1;
			НомерЛиста = 1;
			
			Для Каждого ТекущаяСтрока Из ТЧТовары Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				
				//++ №12909
				//ПредставлениеНоменклатуры = Строка(ТекущаяСтрока.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(ТекущаяСтрока.ХарактеристикаНоменклатуры));
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры);
				//-- №12909
				
				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
				
				Если НомерСтроки > 1
					И НЕ ПроверитьВыводСчетаФактурыИУПДНаСтраницу(ТабличныйДокумент, ОбластьМакета, (НомерСтроки = КоличествоСтрок), Макет, НомерЛиста, НомерДокумента, Истина) Тогда
				
					КоличествоСтраниц = КоличествоСтраниц + 1;
				
				КонецЕсли; 
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
			
			УслугиИтогСуммаНДС = 0;
			УслугиИтогВсего = 0;
			УслугиИтогСуммаБезНДС = 0;
			
			Если ЕстьУслуги Тогда
				Для Каждого ТекущаяСтрока Из ТЧУслуги Цикл
					ОбластьМакета = Макет.ПолучитьОбласть("Строка");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					
					//++ №12909
					//ПредставлениеНоменклатуры = Строка(ТекущаяСтрока.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(ТекущаяСтрока.ХарактеристикаНоменклатуры));
					ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры);
					//-- №12909
					
					ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
					
					Если НомерСтроки > 1
						И НЕ ПроверитьВыводСчетаФактурыИУПДНаСтраницу(ТабличныйДокумент, ОбластьМакета, (НомерСтроки = КоличествоСтрок), Макет, НомерЛиста, НомерДокумента, Истина) Тогда
				
						КоличествоСтраниц = КоличествоСтраниц + 1;
				
					КонецЕсли; 
				
					ТабличныйДокумент.Вывести(ОбластьМакета);
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла;
				
				УслугиИтогСуммаНДС =  ТЧУслуги.Итог("СуммаНДС");
				УслугиИтогВсего = ТЧУслуги.Итог("Сумма");
				УслугиИтогСуммаБезНДС = ТЧУслуги.Итог("СуммаБезНДС");

			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");		
			ОбластьМакета.Параметры.ИтогоСуммаНДС = ТЧТовары.Итог("СуммаНДС") + УслугиИтогСуммаНДС; ; 
			ОбластьМакета.Параметры.ИтогоСумма = ТЧТовары.Итог("Сумма") + УслугиИтогВсего; 
			ОбластьМакета.Параметры.ИтогоСуммаБезНДС = ТЧТовары.Итог("СуммаБезНДС") + УслугиИтогСуммаБезНДС; 
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			//++ 16306 2023-07-11
			Если ДанныеПечати.Организация.ВидОрганизации = Перечисления.ВидКонтрагента.ЮрЛицо Тогда
				ОбластьМакета.Параметры.ФИОРуководителя = ДанныеПечати.ФИОРуководителя;
			КонецЕсли;
			Если ДанныеПечати.Организация.ВидОрганизации = Перечисления.ВидКонтрагента.ИндивидуальныйПредприниматель Тогда
				ОбластьМакета.Параметры.ФИОПБОЮЛ = ДанныеПечати.ФИОРуководителя;
			КонецЕсли;
			//++ 16306 2023-07-11
			ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = ДанныеПечати.ФИОГлавногоБухгалтера;													
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалНакладной");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
			ОбластьМакета.Параметры.ДатаДокумента = Формат(РасчетнаяДатаПечати, "ДЛФ=Д");
			ОбластьМакета.Параметры.ПредставлениеОрганизации = Строка(ДанныеПечати.ОрганизацияПолноеНаименование) + ", ИНН/КПП " + ?(ЗначениеЗаполнено(ДанныеПечати.ИНН), ДанныеПечати.ИНН, "--") + ?(ЗначениеЗаполнено(ДанныеПечати.КПП), "/"+ДанныеПечати.КПП, "");
			ОбластьМакета.Параметры.ПредставлениеКонтрагента = Строка(ДанныеПечати.КонтрагентНаименованиеПолное)  + ", ИНН/КПП " + ?(ЗначениеЗаполнено(ДанныеПечати.КонтрагентИНН), ДанныеПечати.КонтрагентИНН, "--") + ?(ЗначениеЗаполнено(ДанныеПечати.КонтрагентКПП), "/"+ДанныеПечати.КонтрагентКПП, "");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
					НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СобратьДанныеДляПечатиСчетФактурыПоРеализацииТоваровИУслуг(ДокументРеализации, ДокументСчетФактуры)

    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	РеализацияТоваровИУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровИУслуг.Номер КАК НомерОснования,
	|	РеализацияТоваровИУслуг.Дата КАК ДатаОснования,
    |	СчетФактураВыданный.Номер,
    |	СчетФактураВыданный.Дата,
	|	СчетФактураВыданный.Организация КАК Организация,
    |	СчетФактураВыданный.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
    |	СчетФактураВыданный.Организация.ИНН КАК ИНН,
    |	СчетФактураВыданный.Организация.КПП КАК КПП,
    |	СчетФактураВыданный.ИдентификаторГосКонтракта,
    |	ВЫБОР
    |		КОГДА НЕ СчетФактураВыданный.Контрагент.НаименованиеПолное = """"
    |			ТОГДА СчетФактураВыданный.Контрагент.НаименованиеПолное
    |		ИНАЧЕ СчетФактураВыданный.Контрагент.Наименование
    |	КОНЕЦ КАК КонтрагентНаименованиеПолное,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
    |	СчетФактураВыданный.Контрагент.ИНН КАК КонтрагентИНН,
    |	СчетФактураВыданный.Контрагент.КПП КАК КонтрагентКПП,
    |	СчетФактураВыданный.Валюта.Код КАК ВалютаКод,
    |	СчетФактураВыданный.Валюта.НаименованиеПолное КАК ВалютаНаименование,
    |	СчетФактураВыданный.Организация.Руководитель КАК ФИОРуководителя,
    |	СчетФактураВыданный.Организация.ГлавныйБухгалтер КАК ФИОГлавногоБухгалтера,
    |	РеализацияТоваровИУслуг.Товары.(
    |		Ссылка,
    |		НомерСтроки,
    |		""--"" КАК ТоварКодТНВЭД,
    |		""без акциза"" КАК Акциз,
    |		""--"" КАК СтранаПроисхожденияКод,
    |		""--"" КАК ПредставлениеСтраны,
    |		""--"" КАК ПредставлениеГТД,
	|		ВЫБОР
	|			КОГДА &КолонкаАртикул
    |				ТОГДА Номенклатура.Артикул
	|			ИНАЧЕ Номенклатура.Код
	|		КОНЕЦ КАК Код,
    |		Номенклатура,
    |		ХарактеристикаНоменклатуры,
    |		СерияНоменклатуры,
    |		ЕдиницаИзмерения,
    |		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
    |		Коэффициент,
    |		Количество,
    |		Сумма КАК Всего,
    |		СтавкаНДС,
    |		СуммаНДС,
    |		РеализацияТоваровИУслуг.Товары.Сумма - РеализацияТоваровИУслуг.Товары.СуммаНДС КАК Стоимость,
    |		(РеализацияТоваровИУслуг.Товары.Сумма - РеализацияТоваровИУслуг.Товары.СуммаНДС) / РеализацияТоваровИУслуг.Товары.Количество КАК Цена
    |	) КАК Товары,
    |	РеализацияТоваровИУслуг.Услуги.(
    |		Ссылка,
    |		НомерСтроки,
    |		""--"" КАК ТоварКодТНВЭД,
    |		""без акциза"" КАК Акциз,
    |		""--"" КАК СтранаПроисхожденияКод,
    |		""--"" КАК ПредставлениеСтраны,
    |		""--"" КАК ПредставлениеГТД,
	|		ВЫБОР
	|			КОГДА &КолонкаАртикул
    |				ТОГДА Номенклатура.Артикул
	|			ИНАЧЕ Номенклатура.Код
	|		КОНЕЦ КАК Код,
	|		Номенклатура,
    |		Номенклатура КАК ТоварНаименование,
	|		ХарактеристикаНоменклатуры,
    |		ЕдиницаИзмерения,
    |		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
    |		Коэффициент,
    |		Количество,
    |		Сумма КАК Всего,
    |		СтавкаНДС,
    |		СуммаНДС,
    |		РеализацияТоваровИУслуг.Услуги.Сумма - РеализацияТоваровИУслуг.Услуги.СуммаНДС КАК Стоимость,
    |		(РеализацияТоваровИУслуг.Услуги.Сумма - РеализацияТоваровИУслуг.Услуги.СуммаНДС) / РеализацияТоваровИУслуг.Услуги.Количество КАК Цена
    |	) КАК Услуги
    |ИЗ
    |	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
    |		ПО РеализацияТоваровИУслуг.Ссылка = СчетФактураВыданный.Основание
    |			И (СчетФактураВыданный.Ссылка = &ДокументСчетФактуры)
    |ГДЕ
    |	РеализацияТоваровИУслуг.Ссылка = &ДокументРеализации";
    Запрос.УстановитьПараметр("ДокументРеализации", ДокументРеализации);
	Запрос.УстановитьПараметр("ДокументСчетФактуры", ДокументСчетФактуры);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());

	ДанныеДляПечати = Запрос.Выполнить();
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция СобратьДанныеДляПечатиСчетФактурыПоМонтажу(ДокументМонтажа, ДокументСчетФактуры)

    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	Монтаж.Ссылка КАК Ссылка,
	|	Монтаж.Номер КАК НомерОснования,
	|	Монтаж.Дата КАК ДатаОснования,
    |	СчетФактураВыданный.Номер,
    |	СчетФактураВыданный.Дата,
	|	СчетФактураВыданный.Организация КАК Организация,
    |	СчетФактураВыданный.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
    |	СчетФактураВыданный.Организация.ИНН КАК ИНН,
    |	СчетФактураВыданный.Организация.КПП КАК КПП,
    |	СчетФактураВыданный.ИдентификаторГосКонтракта,
    |	ВЫБОР
    |		КОГДА НЕ СчетФактураВыданный.Контрагент.НаименованиеПолное = """"
    |			ТОГДА СчетФактураВыданный.Контрагент.НаименованиеПолное
    |		ИНАЧЕ СчетФактураВыданный.Контрагент.Наименование
    |	КОНЕЦ КАК КонтрагентНаименованиеПолное,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
    |	СчетФактураВыданный.Контрагент.ИНН КАК КонтрагентИНН,
    |	СчетФактураВыданный.Контрагент.КПП КАК КонтрагентКПП,
    |	СчетФактураВыданный.Валюта.Код КАК ВалютаКод,
    |	СчетФактураВыданный.Валюта.НаименованиеПолное КАК ВалютаНаименование,
    |	СчетФактураВыданный.Организация.Руководитель КАК ФИОРуководителя,
    |	СчетФактураВыданный.Организация.ГлавныйБухгалтер КАК ФИОГлавногоБухгалтера,
    |	Монтаж.ТоварыУслуги.(
    |		Ссылка,
    |		НомерСтроки,
    |		""--"" КАК ТоварКодТНВЭД,
    |		""без акциза"" КАК Акциз,
    |		""--"" КАК СтранаПроисхожденияКод,
    |		""--"" КАК ПредставлениеСтраны,
    |		""--"" КАК ПредставлениеГТД,
	|		ВЫБОР
	|			КОГДА &КолонкаАртикул
    |				ТОГДА Номенклатура.Артикул
	|			ИНАЧЕ Номенклатура.Код
	|		КОНЕЦ КАК Код,
    |		Номенклатура,
    |		ХарактеристикаНоменклатуры,
    |		СерияНоменклатуры,
    |		ЕдиницаИзмерения,
    |		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
    |		Коэффициент,
    |		Количество,
    |		Сумма КАК Всего,
    |		СтавкаНДС,
    |		СуммаНДС,
    |		Монтаж.ТоварыУслуги.Сумма - Монтаж.ТоварыУслуги.СуммаНДС КАК Стоимость,
    |		(Монтаж.ТоварыУслуги.Сумма - Монтаж.ТоварыУслуги.СуммаНДС) / Монтаж.ТоварыУслуги.Количество КАК Цена
    |	) КАК Товары
    |ИЗ
    |	Документ.Монтаж КАК Монтаж
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
    |		ПО Монтаж.Ссылка = СчетФактураВыданный.Основание
    |			И (СчетФактураВыданный.Ссылка = &ДокументСчетФактуры)
    |ГДЕ
    |	Монтаж.Ссылка = &ДокументМонтажа";
    Запрос.УстановитьПараметр("ДокументМонтажа", ДокументМонтажа);
	Запрос.УстановитьПараметр("ДокументСчетФактуры", ДокументСчетФактуры);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());

	ДанныеДляПечати = Запрос.Выполнить();
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция СобратьДанныеДляПечатиУПДПоРеализацииТоваровИУслуг(ДокументПечати)

    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК НомерОснования,
	|	ДанныеДокумента.Дата КАК ДатаОснования,
    |	ЕстьNULL(СчетФактураВыданный.Номер, ДанныеДокумента.Номер) КАК НомерДокумента,
    |	ЕстьNULL(СчетФактураВыданный.Дата, ДанныеДокумента.Дата) КАК Дата,
    |	""строковое значение"" КАК ДатаДокумента,
    |	ДанныеДокумента.Проведен КАК Проведен,
    |	ДанныеДокумента.Валюта.Код КАК ВалютаКод,
    |	ДанныеДокумента.Валюта.НаименованиеПолное КАК ВалютаНаименование,
    |	ДанныеДокумента.ВидЦен КАК ВидЦен,
    |	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |	ДанныеДокумента.Комментарий КАК Комментарий,
    |	ДанныеДокумента.Контрагент КАК Контрагент,
    |	ДанныеДокумента.Организация КАК Организация,
    |	ДанныеДокумента.Автор КАК Автор,
    |	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
    |	0 КАК ИтогоСуммаНДС,
    |	0 КАК ИтогоСуммаБезНДС,
    |	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
    |	ДанныеДокумента.Основание КАК Основание,
    |	ДанныеДокумента.Товары.(
    |		Ссылка,
    |		НомерСтроки,
	|		ВЫБОР
	|			КОГДА &КолонкаАртикул
    |				ТОГДА Номенклатура.Артикул
	|			ИНАЧЕ Номенклатура.Код
	|		КОНЕЦ КАК Код,
    |		Номенклатура,
    |		ХарактеристикаНоменклатуры,
    |		СерияНоменклатуры,
    |		ЕдиницаИзмерения,
    |		Коэффициент,
    |		Количество,
    |		Сумма,
    |		СтавкаНДС,
    |		СуммаНДС,
    |		ДанныеДокумента.Товары.Сумма - ДанныеДокумента.Товары.СуммаНДС КАК СуммаБезНДС,
    |		(ДанныеДокумента.Товары.Сумма - ДанныеДокумента.Товары.СуммаНДС) / ДанныеДокумента.Товары.Количество КАК Цена,
    |		ЕдиницаИзмерения.Код,
	|		""--"" КАК ТоварКодТНВЭД,
	|		""--"" КАК СтранаПроисхожденияКод,
	|		""--"" КАК ПредставлениеСтраны,
	|		""--"" КАК ПредставлениеГТД
    |	) КАК Товары,
    |	ДанныеДокумента.Услуги.(
    |		Ссылка,
    |		НомерСтроки,
    |		ВЫБОР
	|			КОГДА &КолонкаАртикул
    |				ТОГДА Номенклатура.Артикул
	|			ИНАЧЕ Номенклатура.Код
	|		КОНЕЦ КАК Код,
    |		Номенклатура,
	|		ХарактеристикаНоменклатуры,
    |		ЕдиницаИзмерения,
    |		Коэффициент,
    |		Количество,
    |		Сумма,
    |		СтавкаНДС,
    |		СуммаНДС,
    |		ДанныеДокумента.Услуги.Сумма - ДанныеДокумента.Услуги.СуммаНДС КАК СуммаБезНДС,
    |		(ДанныеДокумента.Услуги.Сумма - ДанныеДокумента.Услуги.СуммаНДС) / ДанныеДокумента.Услуги.Количество КАК Цена,
    |		ЕдиницаИзмерения.Код,
	|		""--"" КАК ТоварКодТНВЭД,
	|		""--"" КАК СтранаПроисхожденияКод,
	|		""--"" КАК ПредставлениеСтраны,
	|		""--"" КАК ПредставлениеГТД
    |	) КАК Услуги,
    |	ДанныеДокумента.Организация.ИНН КАК ИНН,
    |	ДанныеДокумента.Организация.КПП КАК КПП,
    //|	РеализацияТоваровИУслуг.Организация.Руководитель КАК ФИОРуководителя,
    //|	РеализацияТоваровИУслуг.Организация.ГлавныйБухгалтер КАК ФИОГлавногоБухгалтера,
    |	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
    |	ВЫБОР
    |		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
    |			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
    |		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
    |	КОНЕЦ КАК КонтрагентНаименованиеПолное,
    |	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.Контрагент.ИНН КАК ИННПокупателя,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.Руководитель.Должность
    |		ИНАЧЕ ДанныеДокумента.Руководитель.Должность
    |	КОНЕЦ КАК ДолжностьРуководителя,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.Руководитель.РасшифровкаПодписи
    //++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Руководитель)
	|		ИНАЧЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОРуководителя,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.ГлавныйБухгалтер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.ГлавныйБухгалтер.РасшифровкаПодписи
    //++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.ГлавныйБухгалтер)
	|		ИНАЧЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОГлавногоБухгалтера,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Автор.Сотрудник.Должность
    |		ИНАЧЕ ДанныеДокумента.Отпустил.Должность
    |	КОНЕЦ КАК ДолжностьКладовщика,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Автор.Сотрудник.РасшифровкаПодписи
	//++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Отпустил)
	|		ИНАЧЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОКладовщика,
	|	СчетФактураВыданный.ИдентификаторГосКонтракта
    |ИЗ
    |	Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
    |		ПО ДанныеДокумента.Ссылка = СчетФактураВыданный.Основание
    |			И СчетФактураВыданный.Проведен
    |ГДЕ
    |	ДанныеДокумента.Ссылка = &ДокументПечати";
    Запрос.УстановитьПараметр("ДокументПечати", ДокументПечати);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());
	
	ДанныеДляПечати = Запрос.Выполнить();
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция СобратьДанныеДляПечатиУПДПоМонтажу(ДокументПечати)

    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК НомерОснования,
	|	ДанныеДокумента.Дата КАК ДатаОснования,
    |	ЕСТЬNULL(СчетФактураВыданный.Номер, ДанныеДокумента.Номер) КАК НомерДокумента,
    //|	ЕСТЬNULL(СчетФактураВыданный.Дата, ВЫБОР КОГДА ДанныеДокумента.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Закрыт) ИЛИ ДанныеДокумента.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.ВЫПОЛНЕН) ТОГДА ДанныеДокумента.Дата ИНАЧЕ ДАТАВРЕМЯ(1,1,1)  КОНЕЦ) КАК Дата,
	//|	ЕСТЬNULL(СчетФактураВыданный.Дата, ВЫБОР КОГДА ДанныеДокумента.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Закрыт) ИЛИ ДанныеДокумента.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.ВЫПОЛНЕН) ТОГДА ДанныеДокумента.ДатаВыполнения ИНАЧЕ ВЫБОР КОГДА НЕ ДанныеДокумента.ДатаМонтажа = ДАТАВРЕМЯ(1,1,1) ТОГДА ДанныеДокумента.ДатаМонтажа ИНАЧЕ ДанныеДокумента.Дата КОНЕЦ КОНЕЦ) КАК Дата,
    |	""строковое значение"" КАК ДатаДокумента,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ДатаМонтажа КАК ДатаМонтажа,
	|	ДанныеДокумента.ДатаВыполнения КАК ДатаВыполнения,
	|	ДанныеДокумента.ДатаПодписанияДокументов КАК ДатаПодписанияДокументов,
	|	ДанныеДокумента.Валюта.Код КАК ВалютаКод,
    |	ДанныеДокумента.Валюта.НаименованиеПолное КАК ВалютаНаименование,
    |	ДанныеДокумента.ВидЦен КАК ВидЦен,
    |	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |	ДанныеДокумента.Комментарий КАК Комментарий,
    |	ДанныеДокумента.Контрагент КАК Контрагент,
    |	ДанныеДокумента.Организация КАК Организация,
    |	ДанныеДокумента.Автор КАК Автор,
    |	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
    |	0 КАК ИтогоСуммаНДС,
    |	0 КАК ИтогоСуммаБезНДС,
    |	ДанныеДокумента.ТоварыУслуги.(
    |		Ссылка,
    |		НомерСтроки,
    |		ВЫБОР
	|			КОГДА &КолонкаАртикул
    |				ТОГДА Номенклатура.Артикул
	|			ИНАЧЕ Номенклатура.Код
	|		КОНЕЦ КАК Код,
    |		Номенклатура,
    |		ХарактеристикаНоменклатуры,
    |		СерияНоменклатуры,
    |		ЕдиницаИзмерения,
    |		Коэффициент,
    |		Количество,
    |		СуммаСкидки,
    |		Сумма,
    |		СтавкаНДС,
    |		СуммаНДС,
    |		ДанныеДокумента.ТоварыУслуги.Сумма - ДанныеДокумента.ТоварыУслуги.СуммаНДС КАК СуммаБезНДС,
    |		(ДанныеДокумента.ТоварыУслуги.Сумма - ДанныеДокумента.ТоварыУслуги.СуммаНДС) / ДанныеДокумента.ТоварыУслуги.Количество КАК Цена,
    |		ЕдиницаИзмерения.Код,
	|		""--"" КАК ТоварКодТНВЭД,
	|		""--"" КАК СтранаПроисхожденияКод,
	|		""--"" КАК ПредставлениеСтраны,
	|		""--"" КАК ПредставлениеГТД
    |	) КАК Товары,
    |	ДанныеДокумента.Организация.ИНН КАК ИНН,
    |	ДанныеДокумента.Организация.КПП КАК КПП,
    //|	Монтаж.Организация.Руководитель КАК ФИОРуководителя,
    //|	Монтаж.Организация.ГлавныйБухгалтер КАК ФИОГлавногоБухгалтера,
    |	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
    |	ВЫБОР
    |		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
    |			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
    |		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
    |	КОНЕЦ КАК КонтрагентНаименованиеПолное,
    |	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.ИНН КАК ИННПокупателя,
	|	ДанныеДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.Руководитель.Должность
    |		ИНАЧЕ ДанныеДокумента.Руководитель.Должность
    |	КОНЕЦ КАК ДолжностьРуководителя,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.Руководитель.РасшифровкаПодписи
    //++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Руководитель)
	|		ИНАЧЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОРуководителя,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.ГлавныйБухгалтер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.ГлавныйБухгалтер.РасшифровкаПодписи
    //++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.ГлавныйБухгалтер)
	|		ИНАЧЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОГлавногоБухгалтера,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Автор.Сотрудник.Должность
    |		ИНАЧЕ ДанныеДокумента.Отпустил.Должность
    |	КОНЕЦ КАК ДолжностьКладовщика,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Автор.Сотрудник.РасшифровкаПодписи
	//++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Отпустил)
	|		ИНАЧЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОКладовщика,
	|	СчетФактураВыданный.ИдентификаторГосКонтракта,
	|	ДанныеДокумента.ВариантЗаполненияДатыПодписания
    |ИЗ
    |	Документ.Монтаж КАК ДанныеДокумента
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
    |		ПО ДанныеДокумента.Ссылка = СчетФактураВыданный.Основание
    |			И (СчетФактураВыданный.Проведен)
    |ГДЕ
    |	ДанныеДокумента.Ссылка = &ДокументПечати";
    Запрос.УстановитьПараметр("ДокументПечати", ДокументПечати);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());
	
	ДанныеДляПечати = Запрос.Выполнить();
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция НайтиСчетФактуру(ДокументОснование) Экспорт
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") 
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Монтаж") Тогда			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СчетФактураВыданный.Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Проведен 
		|	И СчетФактураВыданный.Основание = &Основание";
		
		Запрос.УстановитьПараметр("Основание", ДокументОснование);
		РезультатЗапроса = Запрос.Выполнить();		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПроверитьВыводСчетаФактурыИУПДНаСтраницу(ТабДокумент, ОбластьТекСтроки, ЭтоПоследняяСтрока, Макет, НомерЛиста, НомерСчетаФактуры, ЭтоУниверсальныйПередаточныйДокумент = Ложь) Экспорт
	
	// Проверим возможность вывода табличного документа
	СтрокаСПодвалом = Новый Массив;
	СтрокаСПодвалом.Добавить(ОбластьТекСтроки);
	Если ЭтоПоследняяСтрока Тогда
		// Если последняя строка, то должен поместиться еще итог и подвал
		СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("Итого"));
		СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("Подвал"));
		Если ЭтоУниверсальныйПередаточныйДокумент Тогда
			СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("ПодвалНакладной"));
		КонецЕсли;
	КонецЕсли;
	
	РезультатПроверки = ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом);
	
	Если НЕ РезультатПроверки Тогда
		// Вывод разделителя и заголовка таблицы на новой странице
		
		НомерЛиста = НомерЛиста + 1;
		
		ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
		ОбластьНумерацияЛистов.Параметры.Номер = НомерСчетаФактуры;
		ОбластьНумерацияЛистов.Параметры.НомерЛиста = НомерЛиста;
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДокумент.Вывести(ОбластьНумерацияЛистов);
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ЗаголовокТаблицы"));
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

// Проверяет, умещаются ли переданные табличные документы на страницу при печати.
//
// Параметры
//  ТабДокумент       – Табличный документ
//  ВыводимыеОбласти  – Массив из проверяемых таблиц или табличный документ
//  РезультатПриОшибке - Какой возвращать результат при возникновении ошибки
//
// Возвращаемое значение:
//   Булево   – умещаются или нет переданные документы
//
Функция ПроверитьВыводТабличногоДокумента(ТабДокумент, ВыводимыеОбласти, РезультатПриОшибке = Истина)

	Попытка
		Возврат ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
	Исключение
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
			НСТр("ru = 'Невозможно получить информацию о текущем принтере (возможно, в системе не установлено ни одного принтера)'"),
			УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки.Описание);
		Возврат РезультатПриОшибке;
	КонецПопытки;

КонецФункции

Функция СведенияОДокументеОтгрузки(ДанныеШапки, КоличествоСтрок) Экспорт
	
	ПерваяСтрокаПоДокументуОтгрузки = 1;
	ПоследняяСтрокаПоДокументуОтгрузки = КоличествоСтрок;
	ШаблонПодстрокиДокументаОбОтгрузке = "№ п/п %1 №%2 от %3";
	ДокументыОбОтгрузке = "";
	
	Если ПерваяСтрокаПоДокументуОтгрузки = ПоследняяСтрокаПоДокументуОтгрузки Тогда
		ДиапазонСтрок = "" + ПерваяСтрокаПоДокументуОтгрузки;
	Иначе
		ДиапазонСтрок = "" + ПерваяСтрокаПоДокументуОтгрузки + "-" + ПоследняяСтрокаПоДокументуОтгрузки;
	КонецЕсли;
	ДокументОтгрузки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПодстрокиДокументаОбОтгрузке,
				ДиапазонСтрок,
				ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеШапки.НомерОснования),
				Формат(ДанныеШапки.ДатаОснования, "ДЛФ='Д'") + " г.");
	
	Возврат ДокументОтгрузки;	
	
КонецФункции
	
#КонецОбласти

#Область СозданиеНаОсновании

// Добавляет команду создания документа "Счет-фактура выданный"
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.СчетФактураВыданный) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.СчетФактураВыданный.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.СчетФактураВыданный.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли