#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если НЕ ДанныеЗаполнения = Неопределено Тогда
		Если НЕ ДанныеЗаполнения.Организация.ЯвляетсяПлательщикомНДС Тогда
			ТекстОшибки = НСтр("ru='Организация не является плательщиком НДС. Ввод счет-фактуры не требуется'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	ДатаВыставления = ТекущаяДатаСеанса();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Валюта = ДанныеЗаполнения.Валюта;
		Основание = ДанныеЗаполнения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Валюта = ДанныеЗаполнения.Валюта;
		Основание = ДанныеЗаполнения;
	КонецЕсли;
	
	НайденныйСчетФактура = ОбщийМодульСервер.ПолучитьПодчиненныйСчетФактуру(Основание);
	Если ЗначениеЗаполнено(НайденныйСчетФактура) И НайденныйСчетФактура <> Ссылка Тогда			
		ШаблонТекст = НСтр("ru = 'Для документа ""%1"" 
				|уже введен счет-фактура ""%2"".
				|Запись еще одного документа ""Счет-фактура"" не допускается!'");
			
		ВызватьИсключение СтрШаблон(ШаблонТекст, Основание, НайденныйСчетФактура);			
	КонецЕсли;
		
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
		
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли