#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         	НСтр("ru = 'Не указан Период регистрации!'"), ,
        	"ОтображениеПериодаРегистрации",,Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГрафикРаботыЗамерщиков.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ГрафикРаботыЗамерщиков КАК ГрафикРаботыЗамерщиков
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ГрафикРаботыЗамерщиков.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И ГрафикРаботыЗамерщиков.Проведен
		|	И ГрафикРаботыЗамерщиков.Ссылка <> &Ссылка";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Существует документ за данный период: " + Строка(Выборка.Ссылка) + "! Проведение невозможно!", , ,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Невыходы
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Сотрудник");
	//ТаблицаДвижений.Колонки.Добавить("ТочкаПродаж");
	ТаблицаДвижений.Колонки.Добавить("Дата", новый ОписаниеТипов("Дата"));
	ТаблицаДвижений.Колонки.Добавить("ВремяНачала", новый ОписаниеТипов("Дата"));
	ТаблицаДвижений.Колонки.Добавить("ВремяОкончания", новый ОписаниеТипов("Дата"));
	ТаблицаДвижений.Колонки.Добавить("Комментарий", новый ОписаниеТипов("Строка"));
	ТаблицаДвижений.Колонки.Добавить("КодСтроки", новый ОписаниеТипов("Число"));

	ВремяНачалаГрафика    = Константы.НачалоРабочегоВремениЗамеров.Получить();
	ВремяОкончанияГрафика = Константы.КонецРабочегоВремениЗамеров.Получить();
	
	//нужно невыход разбить на дневные интервалы, т.к. в регистре запись хранится в разрезе дней
	Для Каждого ТекущаяСтрока Из Сотрудники Цикл
		ВремДатаНачала = ТекущаяСтрока.ДатаНачала;
		Пока ВремДатаНачала <= ТекущаяСтрока.ДатаОкончания Цикл
			НоваяСтрока = ТаблицаДвижений.Добавить();
			НоваяСтрока.Сотрудник = ТекущаяСтрока.Сотрудник;
			//НоваяСтрока.ТочкаПродаж = ТочкаПродаж;
			НоваяСтрока.Комментарий = ТекущаяСтрока.Комментарий;
			НоваяСтрока.Дата = ВремДатаНачала;
			НоваяСтрока.ВремяНачала = Макс(?(ВремДатаНачала = ТекущаяСтрока.ДатаНачала, ТекущаяСтрока.ВремяНачала, Дата(1,1,1,0,0,1)), ВремяНачалаГрафика);
			НоваяСтрока.ВремяОкончания = Мин(?(ВремДатаНачала < ТекущаяСтрока.ДатаОкончания, Дата(1,1,1,23,59,59), ТекущаяСтрока.ВремяОкончания), ВремяОкончанияГрафика);
			НоваяСтрока.КодСтроки = ТекущаяСтрока.НомерСтроки;
			ВремДатаНачала = ВремДатаНачала + 86400;
		КонецЦикла;
		
	КонецЦикла;
		
	Движения.Невыходы.Записывать = Истина;	
	Для Каждого ТекущаяСтрока Из ТаблицаДвижений Цикл
		Движение = Движения.Невыходы.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекущаяСтрока);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти