
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФотоСтатусУтв = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КСУ_СтатусУтверждена, УникальныйИдентификатор);
	ФотоСтатусЧерн = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КСУ_СтатусЧерновик, УникальныйИдентификатор);
	
	//Список.Параметры.УстановитьЗначениеПараметра("ФотоСтатусУтв", ФотоСтатусУтв);
	//Список.Параметры.УстановитьЗначениеПараметра("ФотоСтатусЧерн", ФотоСтатусЧерн);

	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Отчеты(Команда)
	сп = новый СписокЗначений;
	сп.Добавить("КСУ_ДвиженияПоФондам","Движение по фондам");
	сп.Добавить("КСУ_СостояниеФондов","Остатки на счетах и фондах");
	сп.Добавить("КСУ_РасходыПоПодразделениям","Расходы по подразделениям");
	сп.Добавить("КСУ_ВедомостьПоОтложенномуДоходу","Ведомость по отложенному доходу");
	сп.Добавить("КСУ_ВедомостьПоЗаймам","Ведомость по займам");
	сп.Добавить("КСУ_НезакрытыеЗаказы","Незакрытые заказы");
	сп.Добавить("ИА_КонтрольПлатежейВнеФондов","Контроль платежей вне фондов");
		
	оп = новый ОписаниеОповещения("ВыбОтчет", ЭтотОбъект);
	ПоказатьВыборИзСписка(оп, сп, Элементы.Декорация2);
КонецПроцедуры

&НаКлиенте
Процедура ВыбОтчет(выбЗн, ДопПарам) Экспорт
	Если выбЗн <> Неопределено Тогда
		ОткрытьФорму("Отчет."+выбЗн.Значение+".Форма");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)	
	Для каждого стр из Строки Цикл
		стрД = стр.Значение.Данные;
		Если ЗначениеЗаполнено(стрД.КонецНедели) Тогда
			//стрД.ГраницыНедели = "[ "+стрД.НомерНедели+" ]  "+формат(стрД.НачалоНедели, "ДФ=dd.MM") + " – " + формат(стрД.КонецНедели, "ДФ=dd.MM") + "  (" + стрД.КолДней+ " дн)";
			стрД.ГраницыНедели = формат(стрД.НачалоНедели, "ДФ=dd.MM") + " – " + формат(стрД.КонецНедели, "ДФ=dd.MM") + "  (" + стрД.КолДней+ " дн)";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стрД.ТБ) Тогда
			стрД.ТочкаБезубыточности = "ТБ №"+стрД.НомерТБ+" от "+ФОРМАТ(стрД.ДатаТБ, "ДФ=dd.MM.yyyy");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТочкаБезубыточности" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТБ) Тогда
		СтандартнаяОбработка = ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.ТБ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Периоды(Команда)
	ОткрытьФорму("РегистрСведений.ИА_РаспределениеНедель.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПомеченные(Команда)
	Элементы.КомандаПоказатьПомеченные.Пометка = не Элементы.КомандаПоказатьПомеченные.Пометка;
	
	УстОтборПомеченных(Элементы.КомандаПоказатьПомеченные.Пометка);
КонецПроцедуры

&НаСервере
Процедура УстОтборПомеченных(ТекЗн)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ТекЗн);
КонецПроцедуры
