
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзПостроителя(Команда)
	
	ОткрытьФорму("Справочник.Фактура.Форма.ФормаЗагрузкиИзПостроителя");

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаФактурыИзExcel.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтандартнымиДанными(Команда)
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьСтандартнымиДаннымиПослеВопроса", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещенияВопрос, "Заполнить справочник фактур и цветов стандартными данными?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтандартнымиДаннымиПослеВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ЗаполнитьСтандартнымиДаннымиНаСервере();
	Элементы.Список.Обновить();
	ПоказатьОповещениеПользователя("Готово");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтандартнымиДаннымиНаСервере()
	ТаблицаСтандартныхФактур = КлассификаторСтандартныхФактур();
	ТаблицаСтандартныхФактур.Колонки.Добавить("Ссылка");
	ТаблицаСтандартныхФактур.Колонки.Добавить("ГруппаНоменклатурыСсылка");
	ТаблицаСтандартныхЦветовФактур = КлассификаторСтандартныхЦветовФактур();
	
	НомерПравила = Константы.ПорядокФормированияНаименованияФактуры.Получить();
	
	//определим группу номенклатуры, куда будут записываться номенклатура цветов
	РодительскаяГруппаНоменклатурыЦветов = "Полотна";
	РодительскаяГруппаЦветовФактуры = Справочники.Номенклатура.НайтиПоНаименованию(РодительскаяГруппаНоменклатурыЦветов, Истина);
	Если РодительскаяГруппаЦветовФактуры.Пустая() Тогда
		РодительскаяГруппаЦветовФактуры = Справочники.Номенклатура.СоздатьГруппу();
		РодительскаяГруппаЦветовФактуры.Наименование = РодительскаяГруппаНоменклатурыЦветов;
		РодительскаяГруппаЦветовФактуры.Записать();
		Попытка
			РодительскаяГруппаЦветовФактуры.Записать();
			РодительскаяГруппаЦветовФактуры = РодительскаяГруппаЦветовФактуры.Ссылка;
		Исключение
			Сообщить("Не удалось записать элемент """ + РодительскаяГруппаНоменклатурыЦветов + """. Заполнение прервано.");
			Возврат;
		КонецПопытки;		
	КонецЕсли;
	
	// создаем фактуры
	Для каждого ЭлементФактура из ТаблицаСтандартныхФактур Цикл
		Если ЭлементФактура.ЭтоГруппа Тогда
			НаименованиеГруппы = ЭлементФактура.Наименование;
			НаименованиеРодителя = ЭлементФактура.Родитель;
			РодительФактуры = Справочники.Фактура.ПустаяСсылка();
			Если НЕ ПустаяСтрока(НаименованиеРодителя) Тогда
				
				НайденныеСтроки = ТаблицаСтандартныхФактур.НайтиСтроки(Новый Структура("ЭтоГруппа,Наименование", Истина, НаименованиеРодителя));
				Если НайденныеСтроки.Количество() > 0 Тогда
					РодительФактуры = НайденныеСтроки[0].Ссылка;
				Иначе
					Сообщить("Не найдена группа """ + НаименованиеРодителя + """. Заполнение прервано.");
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			ГруппаФактуры = Справочники.Фактура.НайтиПоНаименованию(НаименованиеГруппы, Истина, РодительФактуры);
			Если ГруппаФактуры.Пустая() Тогда
				ГруппаФактуры = Справочники.Фактура.СоздатьГруппу();
			Иначе
				ГруппаФактуры = ГруппаФактуры.Ссылка.ПолучитьОбъект();
			КонецЕсли;
			ГруппаФактуры.Наименование = НаименованиеГруппы;
			ГруппаФактуры.Родитель = РодительФактуры;
			Попытка
				ГруппаФактуры.Записать();
				ЭлементФактура.Ссылка = ГруппаФактуры.Ссылка;
			Исключение
				Сообщить("Не удалось записать группу """ + НаименованиеРодителя + """. Заполнение прервано.");
				Возврат;
			КонецПопытки;
					
		Иначе 
			// создаем фактуру
			НаименованиеФактуры = ЭлементФактура.Наименование;
			ШиринаФактуры = ЭлементФактура.Ширина;
			НаименованиеРодителя = ЭлементФактура.Родитель;
			РодительФактуры = Справочники.Фактура.ПустаяСсылка();
			НайденныеСтроки = ТаблицаСтандартныхФактур.НайтиСтроки(Новый Структура("ЭтоГруппа,Наименование", Истина, НаименованиеРодителя));
			Если НайденныеСтроки.Количество() > 0 Тогда
				РодительФактуры = НайденныеСтроки[0].Ссылка;
			Иначе
				Сообщить("Не найдена группа """ + НаименованиеРодителя + """. Заполнение прервано.");
				Возврат;
			КонецЕсли;
		
			ИзмФактура = Справочники.Фактура.НайтиПоНаименованиюИШирине(НаименованиеФактуры, ШиринаФактуры);
			
			Если ИзмФактура.Пустая() Тогда
				ИзмФактура = Справочники.Фактура.СоздатьЭлемент();
			Иначе
				ИзмФактура = ИзмФактура.Ссылка.ПолучитьОбъект();
			КонецЕсли;
			ИзмФактура.Наименование 	= ОбменСEasyCeiling.ПолучитьНаименованиеФактуры(НаименованиеФактуры, ШиринаФактуры, НомерПравила);
			ИзмФактура.ШиринаПолотна 	= ШиринаФактуры;
			ИзмФактура.Материал 		= НаименованиеФактуры;
			ИзмФактура.Каталог 			= НаименованиеРодителя;
			ИзмФактура.Родитель 		= РодительФактуры;
			Попытка
				ИзмФактура.Записать();
				ЭлементФактура.Ссылка = ИзмФактура.Ссылка;
			Исключение
				Сообщить("Не удалось записать элемент """ + НаименованиеФактуры + ", " + ШиринаФактуры + """. Заполнение прервано.");
				Возврат;
			КонецПопытки;
			
			//создаем группу номенклатуры для цветов
			ГруппаНоменклатурыЦветов = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеРодителя, Истина, РодительскаяГруппаЦветовФактуры);
			Если ГруппаНоменклатурыЦветов.Пустая() Тогда
				ГруппаНоменклатурыЦветов = Справочники.Номенклатура.СоздатьГруппу();
				ГруппаНоменклатурыЦветов.Наименование = НаименованиеРодителя;
				ГруппаНоменклатурыЦветов.Родитель = РодительскаяГруппаЦветовФактуры;
				Попытка
					ГруппаНоменклатурыЦветов.Записать();
					ГруппаНоменклатурыЦветов = ГруппаНоменклатурыЦветов.Ссылка;
				Исключение
					Сообщить("Не удалось записать элемент """ + РодительскаяГруппаНоменклатурыЦветов + """. Заполнение прервано.");
					Возврат;
				КонецПопытки;		
			КонецЕсли;
			ЭлементФактура.ГруппаНоменклатурыСсылка = ГруппаНоменклатурыЦветов;
			
		КонецЕсли;
	КонецЦикла;
	
	// создаем цвета		
	Для каждого ЭлементФактура из ТаблицаСтандартныхФактур Цикл
		Если НЕ ЭлементФактура.ЭтоГруппа Тогда	
			ВладелецЦвета = ЭлементФактура.Ссылка;	
			Для каждого ЭлементЦветФактуры из ТаблицаСтандартныхЦветовФактур Цикл
				НаименованиеЦвета = ЭлементЦветФактуры.Наименование;    
				ИскомыйЦвет = Справочники.ЦветФактуры.НайтиПоНаименованию(НаименованиеЦвета, Истина, , ВладелецЦвета);
				Если ИскомыйЦвет.Пустая() Тогда						
					НовыйЦвет = Справочники.ЦветФактуры.СоздатьЭлемент();
					НовыйЦвет.Наименование = НаименованиеЦвета;
					НовыйЦвет.Владелец = ВладелецЦвета;
					Попытка
						НовыйЦвет.Записать();
						ИскомыйЦвет = НовыйЦвет.Ссылка;
					Исключение
						Сообщить("Не удалось записать цвет """ + НаименованиеЦвета + """ фактуры """ + Строка(ВладелецЦвета) + """. " + ОписаниеОшибки());
						Возврат;
					КонецПопытки;				
				КонецЕсли;
				
				//проверим и создадим соответствующую номенклатуру
				Если ИскомыйЦвет.Номенклатура.Пустая() Тогда
					НаименованиеНоменклатуры = ОбменСEasyCeiling.ПолучитьНаименованиеПленки(ИскомыйЦвет.Наименование, ИскомыйЦвет.Владелец.Материал, ИскомыйЦвет.Владелец.ШиринаПолотна);
					Попытка
						ЭтоНовыйЭлементНоменклатура = Ложь;
						ИскомыйЭлемент = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеНоменклатуры, Истина);
						Если ИскомыйЭлемент.Пустая() Тогда
							НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
							ЭтоНовыйЭлементНоменклатура = Истина;
						Иначе
							НоваяНоменклатура = ИскомыйЭлемент.ПолучитьОбъект();
						КонецЕсли;
						
						НоваяНоменклатура.Наименование = НаименованиеНоменклатуры;
						НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно;
						НоваяНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
						НоваяНоменклатура.Родитель = ЭлементФактура.ГруппаНоменклатурыСсылка;
						НоваяНоменклатура.ШиринаПолотна = ИскомыйЦвет.Владелец.ШиринаПолотна; // №8266
						
						НоваяНоменклатура.Записать();
						
						ЦветОбъект = ИскомыйЦвет.ПолучитьОбъект();
						ЦветОбъект.Номенклатура = НоваяНоменклатура.Ссылка;
						ЦветОбъект.Записать();
						
						Если ЭтоНовыйЭлементНоменклатура Тогда
							ЕдИзмАльтернативная = Справочники.ЕдиницыИзмерений.СоздатьЭлемент();
							ЕдИзмАльтернативная.Владелец = НоваяНоменклатура.Ссылка;
							ЕдИзмАльтернативная.Наименование = Справочники.КлассификаторЕдиницИзмерения.МетрПогонный;
							ЕдИзмАльтернативная.Коэффициент = ИскомыйЦвет.Владелец.ШиринаПолотна / 100;
							ЕдИзмАльтернативная.Записать();
							НоваяНоменклатура.АльтернативнаяЕдиницаИзмерения = ЕдИзмАльтернативная.Ссылка;
							НоваяНоменклатура.Записать();
						КонецЕсли;
						
					Исключение
						Сообщить("Ошибка создания номенклатуры """ + НаименованиеНоменклатуры + """. " + ОписаниеОшибки());
						Результат = Ложь;
						Возврат;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;	    
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КлассификаторСтандартныхФактур() 
	ТаблицаСтандартныхФактур = Новый ТаблицаЗначений;
	
	Макет = Справочники.Фактура.ПолучитьМакет("КлассификаторСтандартныхФактур");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Макет.ПолучитьТекст());
	
	Если Не ЧтениеXML.Прочитать() Тогда
		ВызватьИсключение НСтр("ru = 'Пустой набор стандартных фактур'");
	ИначеЕсли ЧтениеXML.Имя <> "Items" Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка в наборе данных'");
	КонецЕсли;
	
	ИменаКолонок = СтрЗаменить(ЧтениеXML.ПолучитьАтрибут("Columns"), ",", Символы.ПС);
	КоличествоКолонок = СтрЧислоСтрок(ИменаКолонок);
	
	Для Сч = 1 По КоличествоКолонок Цикл
		ИмяКолонки = СтрПолучитьСтроку(ИменаКолонок, Сч);
		
		Если ИмяКолонки = "ЭтоГруппа" Тогда
			ТаблицаСтандартныхФактур.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Булево"));
		ИначеЕсли ИмяКолонки = "Ширина" Тогда
			ТаблицаСтандартныхФактур.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Число"));
		Иначе
			ТаблицаСтандартныхФактур.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Строка"));
		КонецЕсли;
	КонецЦикла;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Items" Тогда
			Прервать;
		ИначеЕсли ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		ИначеЕсли ЧтениеXML.Имя <> "Item" Тогда
			ВызватьИсключение НСтр("ru = 'Ошибка в наборе данных'");
		КонецЕсли;
		
		новСтр = ТаблицаСтандартныхФактур.Добавить();
		Для Сч = 1 По КоличествоКолонок Цикл
			ИмяКолонки = СтрПолучитьСтроку(ИменаКолонок, Сч);
			
			Если ИмяКолонки = "ЭтоГруппа" Тогда
				новСтр[Сч-1] = Булево(СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЧтениеXML.ПолучитьАтрибут(ИмяКолонки)));
			ИначеЕсли ИмяКолонки = "Ширина" Тогда
				новСтр[Сч-1] = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЧтениеXML.ПолучитьАтрибут(ИмяКолонки));
			Иначе
				новСтр[Сч-1] = ЧтениеXML.ПолучитьАтрибут(ИмяКолонки);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаСтандартныхФактур;

КонецФункции

&НаСервере
Функция КлассификаторСтандартныхЦветовФактур() 
	ТаблицаСтандартныхЦветовФактур = Новый ТаблицаЗначений;
	
	Макет = Справочники.Фактура.ПолучитьМакет("КлассификаторСтандартныхЦветовФактур");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Макет.ПолучитьТекст());
	
	Если Не ЧтениеXML.Прочитать() Тогда
		ВызватьИсключение НСтр("ru = 'Пустой набор стандартных цветов фактур'");
	ИначеЕсли ЧтениеXML.Имя <> "Items" Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка в наборе данных'");
	КонецЕсли;
	
	ИменаКолонок = СтрЗаменить(ЧтениеXML.ПолучитьАтрибут("Columns"), ",", Символы.ПС);
	КоличествоКолонок = СтрЧислоСтрок(ИменаКолонок);
	
	Для Сч = 1 По КоличествоКолонок Цикл
		ИмяКолонки = СтрПолучитьСтроку(ИменаКолонок, Сч);		
		ТаблицаСтандартныхЦветовФактур.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Строка"));
	КонецЦикла;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Items" Тогда
			Прервать;
		ИначеЕсли ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		ИначеЕсли ЧтениеXML.Имя <> "Item" Тогда
			ВызватьИсключение НСтр("ru = 'Ошибка в наборе данных'");
		КонецЕсли;
		
		новСтр = ТаблицаСтандартныхЦветовФактур.Добавить();
		Для Сч = 1 По КоличествоКолонок Цикл
			ИмяКолонки = СтрПолучитьСтроку(ИменаКолонок, Сч);		
			новСтр[Сч-1] = ЧтениеXML.ПолучитьАтрибут(ИмяКолонки);		
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаСтандартныхЦветовФактур;

КонецФункции

#КонецОбласти