#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпособыДоставкиТовара.Ссылка КАК Ссылка,
	|	СпособыДоставкиТовара.Наименование КАК Наименование
	|ИЗ
	|	Справочник.СпособыДоставкиТовара КАК СпособыДоставкиТовара
	|ГДЕ
	|	НЕ СпособыДоставкиТовара.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	// №14861 сортировка нужна по наименованию
	//|	СпособыДоставкиТовара.Код
	|	СпособыДоставкиТовара.Наименование
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл		
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецЕсли