Процедура ПересчитатьПлановыеДаты(Точка, Карта = Неопределено) Экспорт
    ИмяЗадачи = ИА_БПС.ПолучитьИмяЗадачи();
    Если ИмяЗадачи = Неопределено Тогда
        ИмяЗадачи = "ИА_БПЗадачаНосителя";
    КонецЕсли; 
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ  разрешенные
    |   ИА_БПНоситель.Ссылка КАК БП
    |ИЗ
    |   БизнесПроцесс.ИА_БПНоситель КАК ИА_БПНоситель
    |ГДЕ
    |   НЕ ИА_БПНоситель.ПометкаУдаления
    |   И (&Карта_НО
    |           ИЛИ ИА_БПНоситель.ИА_КартаМаршрутаБП = &Карта)";
    
    Если НЕ ЗначениеЗаполнено(Карта) И ЗначениеЗаполнено(Точка) Тогда
        Карта = Точка.Владелец;
    КонецЕсли; 
    
    Запрос.УстановитьПараметр("Карта", Карта);
    Запрос.УстановитьПараметр("Карта_НО", НЕ ЗначениеЗаполнено(Карта));
    
    Результат = Запрос.Выполнить();
    Если НЕ Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        
        Счетчик = 0;
        Всего = Выборка.Количество();
        
        //НачатьТранзакцию();
        Пока Выборка.Следующий() Цикл
            Счетчик = Счетчик + 1;
            БП = Выборка.БП.ПолучитьОбъект();
            БП.ДополнительныеСвойства.Вставить("ИА_РасчетаПлановыхДатВыполненияЗадач", Истина);
            БП.Записать();        
        КонецЦикла;
        
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Выполнен пересчет плановых дат у " + Выборка.Количество() + " бизнес-процессов!";
        Сообщение.Сообщить(); 
        //ЗафиксироватьТранзакцию();    
    КонецЕсли; 
    
КонецПроцедуры

Функция СоздатьБП(ВыполнитьЗапуск, Маршрут
    , Дата = Неопределено
    , Владелец = Неопределено
    , Ответственный = Неопределено
    , ВедущаяЗадача = Неопределено
    , ТаблицаДопРеквизитов = Неопределено ) Экспорт
    
    БП = БизнесПроцессы.ИА_БПНоситель.СоздатьБизнесПроцесс();
    БП.Дата = ?(Дата = Неопределено, ТекущаяДата(), Дата);
    
    Если ТипЗнч(Маршрут) = Тип("СправочникСсылка.ИА_БПМаршрутЗадач") Тогда
        БП.ИА_МаршрутЗадачБП  = Маршрут;
        БП.ИА_КартаМаршрутаБП = БП.ИА_МаршрутЗадачБП.ТекущаяКартаМаршрута;
    Иначе
        БП.ИА_КартаМаршрутаБП = Маршрут;
    КонецЕсли; 
    
    
    БП.ИА_Владелец = Владелец;
    БП.ИА_Ответственный = Ответственный;
    Если ВедущаяЗадача <> Неопределено Тогда
        БП.ВедущаяЗадача = ВедущаяЗадача;
    КонецЕсли; 
    
    Если ТаблицаДопРеквизитов <> Неопределено Тогда
        БП.ИА_Реквизиты.Загрузить(ТаблицаДопРеквизитов);
    Иначе
        ТаблицаДопРеквизитов = ИА_БФС.Запрос_ВыполнитьВТЗ(
        #Область ТекстЗапроса
        "ВЫБРАТЬ   разрешенные
        |	ИА_БПРеквизиты.Ссылка КАК Реквизит,
        |	ИА_БПРеквизиты.ЗначениеПоУмолчанию КАК Значение
        |ИЗ
        |	ПланВидовХарактеристик.ИА_БПРеквизиты КАК ИА_БПРеквизиты
        |ГДЕ
        |	НЕ ИА_БПРеквизиты.ПометкаУдаления
        |	И ИА_БПРеквизиты.ВладелецРеквизита = &ВладелецРеквизита"
        #КонецОбласти 
        , Новый Структура("ВладелецРеквизита", БП.ИА_МаршрутЗадачБП));
        БП.ИА_Реквизиты.Загрузить(ТаблицаДопРеквизитов);
    КонецЕсли; 
    
    БП.Записать();
    Если ВыполнитьЗапуск Тогда
        БП.Старт();
    КонецЕсли; 
    Возврат БП.Ссылка;
КонецФункции

Функция ПолучитьАктуальныйБППоВладельцу(Владелец) Экспорт
    Таб = ПолучитьВсеБПППоВладельцу(Владелец);
    
    Если Таб.Количество() > 0 Тогда
        Результат = Таб[Таб.Количество() - 1].БП;
    Иначе
        Результат = БизнесПроцессы.ИА_БПНоситель.ПустаяСсылка();
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции    

Функция ПолучитьВсеБПППоВладельцу(Владелец) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ   разрешенные
    |	ИА_БПНоситель.Ссылка БП,
    |	ИА_БПНоситель.Дата КАК Дата
    |ИЗ
    |	БизнесПроцесс.ИА_БПНоситель КАК ИА_БПНоситель
    |ГДЕ
    |	НЕ ИА_БПНоситель.ПометкаУдаления
    |	И ИА_БПНоситель.ИА_Владелец = &ИА_Владелец
    |
    |УПОРЯДОЧИТЬ ПО
    |	Дата";
    Запрос.УстановитьПараметр("ИА_Владелец", Владелец);
    Результат = Запрос.Выполнить().Выгрузить();
    Возврат Результат;
КонецФункции

Процедура ЗавершитьБП(БП, ИсключитьИзСтатистики = Ложь) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        БП = БизнесПроцессы.ИА_БПНоситель.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    Если НЕ ЗначениеЗаполнено(БП) Тогда
    	Возврат
    КонецЕсли; 
    
    ТабЗадач = ИА_БФС.Запрос_ВыполнитьВТЗ(
    //#Область ТекстЗапроса
    СтрЗаменить("ВЫБРАТЬ  разрешенные
    |   Т.Ссылка КАК Задача
    |ИЗ
    |   Задача.ИА_БПЗадачаНосителя КАК Т
    |ГДЕ
    |   Т.БизнесПроцесс = &БП
    |   И НЕ Т.Выполнена"
    , "Задача.ИА_БПЗадачаНосителя"
    , "Задача." + ИА_БПС.ПолучитьИмяЗадачи())
    //#КонецОбласти 
    , Новый Структура("БП", БП)); 
    
    ДатаЗавершения = ТекущаяДата();
    
    НачатьТранзакцию();
    Для каждого Стр Из ТабЗадач Цикл
    	Эл = Стр.Задача.ПолучитьОбъект();
        Эл.Выполнена = Истина;
        Эл.ИА_БПДатаЗавершения = ДатаЗавершения;
        
        Если ИсключитьИзСтатистики Тогда
            Эл.ИА_ИсключенаИзОбработки = Истина;
            Если ИА_БФКС.РеквизитЕсть(Эл, "ИА_НеУчитыватьДляСтатистики") Тогда
            	Эл.ИА_НеУчитыватьДляСтатистики = Истина;
            КонецЕсли; 
        КонецЕсли; 
        
        Эл.Записать();
    КонецЦикла;  
    
    Если НЕ БП.Завершен Тогда
    	Эл = БП.ПолучитьОбъект();
        Эл.Стартован = Истина;
        Эл.Завершен  = Истина;
        Эл.ИА_БПДатаЗавершения = ДатаЗавершения;
        Эл.ИА_БПИзмененРедактором = Истина;
        Эл.Записать();
    КонецЕсли; 
    ЗафиксироватьТранзакцию();
КонецПроцедуры

//_____________________________________________________________
Функция ПолучитьРеквизиты(БП, СписокРеквизитов = Неопределено) Экспорт
	#ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        БП = БизнесПроцессы.ИА_БПНоситель.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    Таб = Справочники.ИА_БПМаршрутЗадач.ПолучитьТаблицуДопРеквизитов(БП.ИА_МаршрутЗадачБП);
    Если СписокРеквизитов <> Неопределено Тогда
    	ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(Таб
        , "Контекст.Найти(СтрокаТЗ.Реквизит) = Неопределено"
        , СписокРеквизитов);
    КонецЕсли; 
    Таб.Колонки.Добавить("Значение", Метаданные.ПланыВидовХарактеристик.ИА_БПРеквизиты.Тип);
    Для каждого Стр Из БП.ИА_Реквизиты Цикл
    	НайдСтрока = Таб.Найти(Стр.Реквизит, "Реквизит");
        Если НайдСтрока <> Неопределено Тогда
        	НайдСтрока.Значение = Стр.Значение;
        КонецЕсли; 
    КонецЦикла;  
    
    Возврат Таб;
КонецФункции
 