
Процедура ТелоБППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
    ФормируемыеЗадачи.Очистить();
КонецПроцедуры

Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
    Если ЭтоНовый() Тогда
    	Записать();
    КонецЕсли; 
    ИА_БПС.Обработчик_БП_ПередСтартом(ЭтотОбъект, Отказ);
    ЭтотОбъект.ИА_БПДатаЗапуска = ТекущаяДата();
КонецПроцедуры

Функция СформироватьПланВыполнения() Экспорт
    Таб = Справочники.ИА_БПКартыМаршрутов.РассчитатьПлановыеДатыВыполненияЗадач(ЭтотОбъект.ИА_КартаМаршрутаБП, ЭтотОбъект.Дата);
    ПФ = ИА_БФС.ТЗ_ВывестиВТабДок(Таб);
    
    Результат = Новый Структура("Таб, ПФ", Таб, ПФ);
    Возврат Результат;
КонецФункции

Процедура ПередЗаписью(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
    
    Если Не ЗначениеЗаполнено(ИА_МаршрутЗадачБП)
        И ЗначениеЗаполнено(ИА_КартаМаршрутаБП)
        Тогда
    	ИА_МаршрутЗадачБП = ИА_КартаМаршрутаБП.МаршрутЗадач;
    КонецЕсли; 
    
    Если ЭтоНовый()
        ИЛИ Ссылка.Дата <> Дата
        ИЛИ Ссылка.ИА_КартаМаршрутаБП <> ИА_КартаМаршрутаБП
        Тогда
    	ДополнительныеСвойства.Вставить("ИА_РасчетаПлановыхДатВыполненияЗадач", Истина);
    КонецЕсли; 
     
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
    
    Если ДополнительныеСвойства.Свойство("ИА_РасчетаПлановыхДатВыполненияЗадач")
        И ДополнительныеСвойства.ИА_РасчетаПлановыхДатВыполненияЗадач
        Тогда
        РезультатРасчета = ЭтотОбъект.СформироватьПланВыполнения(); 
        
        НЗ = РегистрыСведений.ИА_БППлановыеДатыВыполненияЗадач.СоздатьНаборЗаписей();
        НЗ.Отбор.БизнесПроцесс.Установить(Ссылка);
        Для каждого СтрокаТЗ Из РезультатРасчета.Таб Цикл
            Движение = НЗ.Добавить();
            ЗаполнитьЗначенияСвойств(Движение, СтрокаТЗ);
            Движение.БизнесПроцесс = Ссылка;
        КонецЦикла; 
        НЗ.Записать();
    КонецЕсли; 
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
    ИА_Файлы.Очистить();
КонецПроцедуры
 

