&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидКонтрагента.ЮрЛицо") Тогда
		Элементы.Наименование.Заголовок = "Наименование организации";
		Элементы.ИНН.Видимость = Истина;
		Элементы.КПП.Видимость = Истина;
		Элементы.ЮридическийАдрес.Видимость = Истина;
	Иначе     
		Элементы.Наименование.Заголовок = "ФИО";
		Элементы.ИНН.Видимость = Ложь;
		Элементы.КПП.Видимость = Ложь;
		Элементы.ЮридическийАдрес.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Вид = Перечисления.ВидКонтрагента.ЮрЛицо;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидКонтрагента.ЮрЛицо") И НЕ Объект.Страна = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"Использовать плательщика - юридическое лицо можно только для плательщиков, зарегистрированных в Российской Федерации");
	КонецЕсли;
КонецПроцедуры
