
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтароеЗначение_КонтрольОстатковДенег = Константы.НеКонтролироватьОстатокДенежныхСредств.Получить();
	СтароеЗначение_КонтрольОстатковНаСкладах = Константы.НеКонтролироватьОстаткиНаСкладах.Получить();
		
	//ОбработкаОбязательныхОбъектов = Параметры.ОбработкаОбязательныхОбъектов;
	Параметры.Свойство("ОбработкаОбязательныхОбъектов", ОбработкаОбязательныхОбъектов);
	ОбработкаОбязательныхОбъектов = ?(ОбработкаОбязательныхОбъектов = Неопределено, Ложь, ОбработкаОбязательныхОбъектов); 

	Если Параметры.Свойство("ВыборочнаяОбработка", ВыборочнаяОбработка) Тогда
		Для каждого СтрокаМассива из Параметры.ВыборочныеОбъектыКОбработке Цикл
			НоваяСтрока = ДокументыКОбработке.Добавить();
			НоваяСтрока.ВерсияПрограммы = СтрокаМассива.ВерсияПрограммы;
			НоваяСтрока.ВерсияПрограммыЧисло = СтрокаМассива.ВерсияПрограммыЧисло;
			НоваяСтрока.Документ = СтрокаМассива.ОбъектСсылка;
			НоваяСтрока.ДокументДата = СтрокаМассива.ОбъектДата;
			НоваяСтрока.ОбязательнаяОбработка = СтрокаМассива.ОбязательнаяОбработка;			
		КонецЦикла;
	КонецЕсли;
	
	//#14069
	Если ОбработкаОбязательныхОбъектов Тогда
		ПерейтиКОбработкеНеобязательных = НЕ ВыборочнаяОбработка; //Истина;
		Элементы.ПерейтиКОбработкеНеобязательных.Видимость = Истина;
	Иначе	
		Элементы.ПерейтиКОбработкеНеобязательных.Видимость = Ложь;
	КонецЕсли;
	
	ВсеОбъектыУспешноОбработаны = Неопределено;
		
	ОбновитьЭлементыФормы();
	
	УстановитьВидимостьГруппыДатыЗапрета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//если это служебный пользователь "УстановкаОбновлений", сразу начнем выполнение работ
	// #7604 закомментировано
	//Если НРег(ИмяПользователя()) = НРег("УстановкаОбновлений") Тогда
	//	ВыполнитьОбработкуДокументов(Неопределено);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтключитьКОнтрольПоСкладамПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьКонтрольОстаткаДенежныхСредствПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнятьОбработкуНаСервереПриИзменении(Элемент)
	
	Элементы.Пауза.Видимость = НЕ ВыполнятьОбработкуНаСервере;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбработкуДокументов(Команда)
	
	ПередНачаломВыполненияОбработкиНаСервере();
	
	ВыполнитьОбработкуДокументовКлиент();
	
	//#14069 если все обязательные объекты успешно обработались и нет ни одного обязательного к обработке, 
	// не прерывать выполнение а начинать обрабатывать необязательные.
	Если ОбработкаОбязательныхОбъектов 
		И ПерейтиКОбработкеНеобязательных 
		И НЕ ЕстьОбязательныеОбъектыКОбработке() Тогда		
		
		// сбрасываем настройки как ПриСозданииНаСервере
		ПерейтиКОбработкеНеобязательных = Ложь;
		Элементы.ПерейтиКОбработкеНеобязательных.Видимость = Ложь;
		
		ОбработкаОбязательныхОбъектов = Ложь;
		ВыборочнаяОбработка = Ложь;
		ДокументыКОбработке.Очистить();
		
		ВсеОбъектыУспешноОбработаны = Неопределено;
		
		ОбновитьЭлементыФормы();
		
		// переходим к обработке
		ВыполнитьОбработкуДокументовКлиент();
	КонецЕсли;
	
	ПослеЗавершенияВыполненияОбработкиНаСервере();
	ПоказатьПредупреждение(,"Обработка объектов завершена");
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуСРезультатом(Команда)
	
	Закрыть(ВсеОбъектыУспешноОбработаны);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкаДатыЗапретаНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.ДатыЗапретаИзменения.Форма.ДатыЗапретаИзменения");
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбработки

&НаСервере
Процедура ПередНачаломВыполненияОбработкиНаСервере()
	
	Если ОтключитьКонтрольОстаткаДенежныхСредств Тогда
		Константы.НеКонтролироватьОстатокДенежныхСредств.Установить(Истина);
	КонецЕсли;
	Если ОтключитьКонтрольПоСкладам Тогда
		Константы.НеКонтролироватьОстаткиНаСкладах.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗавершенияВыполненияОбработкиНаСервере()
	
	Если ОтключитьКонтрольОстаткаДенежныхСредств Тогда
		Константы.НеКонтролироватьОстатокДенежныхСредств.Установить(СтароеЗначение_КонтрольОстатковДенег);
	КонецЕсли;
	Если ОтключитьКонтрольПоСкладам Тогда
		Константы.НеКонтролироватьОстаткиНаСкладах.Установить(СтароеЗначение_КонтрольОстатковНаСкладах);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуДокументовКлиент()
	// частный случай
	ТребуетсяДопОбработка2001 = ТребуетсяДопОбработка2001();
	
	Элементы.ДекорацияИнформация.Видимость = Истина;
	Элементы.ДекорацияИнформацияПрерывание.Видимость = НЕ ВыполнятьОбработкуНаСервере;
	Элементы.ИнформацияПоОбработкеОбъектов.Видимость = НЕ ВыполнятьОбработкуНаСервере;

	Индикатор = 0;
	Элементы.Индикатор.Видимость = НЕ ВыполнятьОбработкуНаСервере;
	ПолучитьСписокДокументовКОбработке();
	
	КоличествоОбъектов = ДокументыКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;	
	
	Если ВыполнятьОбработкуНаСервере Тогда
		ВыполнитьОбработкуНаСервере();
	Иначе
		ВсеОбъектыУспешноОбработаны = Истина;
		Для Каждого ТекущийДокумент Из ДокументыКОбработке Цикл
			ОбработкаПрерыванияПользователя();
			
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("ВерсияПрограммы", 		ТекущийДокумент.ВерсияПрограммы);
			СтруктураДанных.Вставить("ВерсияПрограммыЧисло", 	ТекущийДокумент.ВерсияПрограммыЧисло);
			СтруктураДанных.Вставить("Документ", 				ТекущийДокумент.Документ);
			СтруктураДанных.Вставить("ОбъектДата", 				ТекущийДокумент.ДокументДата);
			СтруктураДанных.Вставить("ОбязательнаяОбработка", 	ТекущийДокумент.ОбязательнаяОбработка);
			
			РезультатОбработки = ОбработатьОбъект(СтруктураДанных);
			
			Если ВсеОбъектыУспешноОбработаны И НЕ РезультатОбработки Тогда
				ВсеОбъектыУспешноОбработаны = Ложь;
			КонецЕсли;
		
			ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
						
			Если НЕ Пауза = 0 Тогда
				Пауза(Пауза);
			КонецЕсли;
			Индикатор = Индикатор + 1;
			ОбновитьОтображениеДанных();
		КонецЦикла;
		
	КонецЕсли;
	
	// частный случай
	// для версии 2.0.0.0($abcd) в процессе обработки в регистр добавляются заказы покупаетлей (для проверки возможности смены статуса в Выполнен) с версией "2.0.0.1"
	// их надо повторно обработать
	Если ТребуетсяДопОбработка2001 Тогда
		Индикатор = 0;
		ПолучитьСписокДокументовКОбработке("2.0.0.1", " И ТИПЗНАЧЕНИЯ(Документ) = ТИП(Документ.ЗаказПокупателя)");
		
		Если ВыполнятьОбработкуНаСервере Тогда
			ВыполнитьОбработкуНаСервере();
		Иначе		
			Для Каждого ТекущийДокумент Из ДокументыКОбработке Цикл
				ОбработкаПрерыванияПользователя();
				
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("ВерсияПрограммы", 		ТекущийДокумент.ВерсияПрограммы);
				СтруктураДанных.Вставить("ВерсияПрограммыЧисло", 	ТекущийДокумент.ВерсияПрограммыЧисло);
				СтруктураДанных.Вставить("Документ", 				ТекущийДокумент.Документ);
				СтруктураДанных.Вставить("ОбъектДата", 				ТекущийДокумент.ДокументДата);
				СтруктураДанных.Вставить("ОбязательнаяОбработка", 	ТекущийДокумент.ОбязательнаяОбработка);
				
				ОбработатьОбъект(СтруктураДанных);
				
				Если НЕ Пауза = 0 Тогда
					Пауза(Пауза);
				КонецЕсли;
				Индикатор = Индикатор + 1;
				ОбновитьОтображениеДанных();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокДокументовКОбработке(ВерсияПрограммы = "", ДопУсловия="")
	
	// при выборочной обработке таблица заполняется ПриСозданииНаСервере
	Если ВыборочнаяОбработка Тогда
		Элементы.Индикатор.МаксимальноеЗначение = 1;
		Возврат;
	КонецЕсли;
	
	ДокументыКОбработке.Очистить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтборПоВерсии", НЕ ПустаяСтрока(ВерсияПрограммы));
	Запрос.УстановитьПараметр("ВерсияПрограммы", ВерсияПрограммы);
	Запрос.УстановитьПараметр("ОбработкаОбязательныхОбъектов", ОбработкаОбязательныхОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы КАК ВерсияПрограммы,
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммыЧисло КАК ВерсияПрограммыЧисло,
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.Документ КАК Документ,
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ДокументДата КАК ДокументДата,
	|	ЛОЖЬ КАК ОбязательнаяОбработка,
	//++ №480
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ОбъектыКОбработкеПослеОбновленияРекомендуемые.РезультатОбработки КАК СТРОКА (1)) = """" 
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК СортировкаРезультат
	//-- №480
	|ИЗ
	|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые КАК ОбъектыКОбработкеПослеОбновленияРекомендуемые
	|ГДЕ
	|	(&ОбработкаОбязательныхОбъектов = Ложь ИЛИ &ОбработкаОбязательныхОбъектов = Неопределено)
	|	И ВЫБОР
	|			КОГДА &ОтборПоВерсии
	|				ТОГДА ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы = &ВерсияПрограммы
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ" + ДопУсловия + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ВерсияПрограммы КАК ВерсияПрограммы,
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ВерсияПрограммыЧисло КАК ВерсияПрограммыЧисло,
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ОбъектСсылка КАК Документ,
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ОбъектДата КАК ДокументДата,
	|	ИСТИНА КАК ОбязательнаяОбработка,
	//++ №480
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ОбъектыКОбработкеПослеОбновленияОбязательные.РезультатОбработки КАК СТРОКА (1)) = """" 
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК СортировкаРезультат
	//-- №480
	|ИЗ
	|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияОбязательные КАК ОбъектыКОбработкеПослеОбновленияОбязательные
	|ГДЕ
	|	(&ОбработкаОбязательныхОбъектов = Истина ИЛИ &ОбработкаОбязательныхОбъектов = Неопределено)
	|";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДокументыКОбработке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	ДокументыКОбработке.Сортировать("ВерсияПрограммыЧисло Возр, СортировкаРезультат Возр, ДокументДата Возр"); //++ №480 добавлена сортировка по результату
	Элементы.Индикатор.МаксимальноеЗначение = Выборка.Количество();
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	
	ВсеОбъектыУспешноОбработаны = Истина; 
	Для Каждого ТекущийДокумент Из ДокументыКОбработке Цикл		
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ВерсияПрограммы", 		ТекущийДокумент.ВерсияПрограммы);
		СтруктураДанных.Вставить("ВерсияПрограммыЧисло", 	ТекущийДокумент.ВерсияПрограммыЧисло);
		СтруктураДанных.Вставить("Документ", 				ТекущийДокумент.Документ);
		СтруктураДанных.Вставить("ОбъектДата", 				ТекущийДокумент.ДокументДата);
		СтруктураДанных.Вставить("ОбязательнаяОбработка", 	ТекущийДокумент.ОбязательнаяОбработка);
		
		РезультатОбработки = ОбработатьОбъект(СтруктураДанных);
		
		Если ВсеОбъектыУспешноОбработаны И НЕ РезультатОбработки Тогда
			ВсеОбъектыУспешноОбработаны = Ложь;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Функция ОбработатьОбъект(СтруктураДанных)
	
	Возврат ОбработкаОбновлений.ОбработатьОбъект(СтруктураДанных, СтруктураДанных.ОбязательнаяОбработка);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВыборочнаяОбработка", ВыборочнаяОбработка);
	Запрос.УстановитьПараметр("ОбъектыКОбработке", ДокументыКОбработке.Выгрузить());
	Запрос.УстановитьПараметр("ОбработкаОбязательныхОбъектов", ОбработкаОбязательныхОбъектов);
	//Запрос.УстановитьПараметр("УчитыватьРасположениеОбъектов", УчитыватьРасположениеОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыКОбработке.ВерсияПрограммы КАК ВерсияПрограммы,
	|	ОбъектыКОбработке.Документ КАК Документ,
	|	ОбъектыКОбработке.ДокументДата КАК ДокументДата
	|ПОМЕСТИТЬ ВТ_ОбъектыКОбработке
	|ИЗ
	|	&ОбъектыКОбработке КАК ОбъектыКОбработке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы КАК ВерсияПрограммы,
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммыЧисло КАК ВерсияПрограммыЧисло,
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ДокументДата КАК ДокументДата
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые КАК ОбъектыКОбработкеПослеОбновленияРекомендуемые
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъектыКОбработке КАК ВТ_ОбъектыКОбработке
	|		ПО (ВТ_ОбъектыКОбработке.ВерсияПрограммы = ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы)
	|			И (ВТ_ОбъектыКОбработке.Документ = ОбъектыКОбработкеПослеОбновленияРекомендуемые.Документ)
	|			И (ВТ_ОбъектыКОбработке.ДокументДата = ОбъектыКОбработкеПослеОбновленияРекомендуемые.ДокументДата)
	|ГДЕ
	|	(&ОбработкаОбязательныхОбъектов = Ложь ИЛИ &ОбработкаОбязательныхОбъектов = Неопределено)
	|	И ВЫБОР
	|			КОГДА &ВыборочнаяОбработка
	|				ТОГДА НЕ ВТ_ОбъектыКОбработке.Документ ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ВерсияПрограммы,
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ВерсияПрограммыЧисло КАК ВерсияПрограммыЧисло,
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ОбъектДата
	|ИЗ
	|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияОбязательные КАК ОбъектыКОбработкеПослеОбновленияОбязательные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъектыКОбработке КАК ВТ_ОбъектыКОбработке
	|		ПО (ВТ_ОбъектыКОбработке.ВерсияПрограммы = ОбъектыКОбработкеПослеОбновленияОбязательные.ВерсияПрограммы)
	|			И (ВТ_ОбъектыКОбработке.Документ = ОбъектыКОбработкеПослеОбновленияОбязательные.ОбъектСсылка)
	|			И (ВТ_ОбъектыКОбработке.ДокументДата = ОбъектыКОбработкеПослеОбновленияОбязательные.ОбъектДата)
	|ГДЕ
	|	(&ОбработкаОбязательныхОбъектов = Истина ИЛИ &ОбработкаОбязательныхОбъектов = Неопределено)
	|	И ВЫБОР
	|			КОГДА &ВыборочнаяОбработка
	|				ТОГДА НЕ ВТ_ОбъектыКОбработке.Документ ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.ВерсияПрограммы КАК ВерсияПрограммы,
	|	ВТ.ДокументДата КАК ДокументДата,
	|	1 КАК КоличествоДокументов
	|ИЗ
	|	ВТ КАК ВТ
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.ВерсияПрограммыЧисло
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ДокументДата КАК ДокументДата
	|ИЗ
	|	ВТ КАК ОбъектыКОбработкеПослеОбновленияРекомендуемые
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата";
		
	РезультатЗапросаПакета = Запрос.ВыполнитьПакет();
	РезультатЗапроса = РезультатЗапросаПакета[2].Выгрузить();
	РезультатЗапроса.Свернуть("ВерсияПрограммы", "КоличествоДокументов");
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		//все хорошо, выполнять дополнительные операции не требуется
		Элементы.ВыполнитьОбработкуДокументов.Видимость = Ложь;
		Элементы.Пауза.Видимость = Ложь;
		Элементы.ДекорацияДокументыКОбработке.Заголовок = "Все операции обновления выполнены. Дополнительная обработка не требуется.";
		ВсеОбъектыУспешноОбработаны = Истина;
	Иначе
		//имеются необработанные документы
		Элементы.Пауза.Видимость = (РезультатЗапроса.Количество() > 1); //Истина;
		Элементы.ВыполнитьОбработкуДокументов.Видимость = Истина;
		
		//РезультатЗапроса.Сортировать("ВерсияПрограммы Возр");
		НадписьСпискаДокументов = "";
		Для Каждого ТекущаяВерсия Из РезультатЗапроса Цикл
			НадписьСпискаДокументов = НадписьСпискаДокументов + "Версия: " + ТекущаяВерсия.ВерсияПрограммы + " Объектов к обработке: " + ТекущаяВерсия.КоличествоДокументов + Символы.ПС;
		КонецЦикла;
		Элементы.ДекорацияДокументыКОбработке.Заголовок = НадписьСпискаДокументов;
	КонецЕсли;
	
	Выборка = РезультатЗапросаПакета[3].Выбрать();
	МинимальнаяДатаДокумента = ТекущаяДатаСеанса();
	Если Выборка.Следующий() Тогда
		МинимальнаяДатаДокумента = Выборка.ДокументДата;
	КонецЕсли;
	
	Элементы.ДекорацияИнформация.Видимость = Ложь;
	Элементы.ДекорацияИнформацияПрерывание.Видимость = Ложь;
	Элементы.ИнформацияПоОбработкеОбъектов.Видимость = Ложь;
	
	Элементы.Индикатор.Видимость = Ложь;
	
	Элементы.ДекорацияНапоминаниеКонтроль.Видимость = Ложь;
	Элементы.ДекорацияНапоминаниеКонтроль.Видимость = ОтключитьКонтрольОстаткаДенежныхСредств ИЛИ ОтключитьКонтрольПоСкладам;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГруппыДатыЗапрета()
	
	ЕстьЗапрет = ОбщийМодульСервер.ЕстьЗапретИзмененияДанных(МинимальнаяДатаДокумента);
	Элементы.ГруппаДатаЗапрета.Видимость = ЕстьЗапрет; 

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно)
	
	Если РезультатОбработки Тогда
		КоличествоОбъектовУспешно = КоличествоОбъектовУспешно + 1;
	Иначе
		КоличествоОбъектовНеуспешно = КоличествоОбъектовНеуспешно + 1;
	КонецЕсли;
	
	ШрифтСообщения = Новый Шрифт(,,Истина);
	ЦветСообщения = WebЦвета.Черный;
	ЦветУспешногоОбъекта = WebЦвета.ЗеленыйЛес;
	ЦветПроблемногоОбъекта = WebЦвета.Красный;
	
	ФормСтрока1 = Новый ФорматированнаяСтрока("Всего объектов к обработке: " + Строка(КоличествоОбъектов) + ", ", ШрифтСообщения, ЦветСообщения);  
	ФормСтрока2 = Новый ФорматированнаяСтрока("обработано успешно: " + Строка(КоличествоОбъектовУспешно) + ", ", ШрифтСообщения, ЦветУспешногоОбъекта);
	ФормСтрока3 = Новый ФорматированнаяСтрока("неуспешно: " + Строка(КоличествоОбъектовНеуспешно), ШрифтСообщения, ЦветПроблемногоОбъекта);

	МассивСтрокСообщения = Новый Массив;
	МассивСтрокСообщения.Добавить(ФормСтрока1);
	МассивСтрокСообщения.Добавить(ФормСтрока2);
	МассивСтрокСообщения.Добавить(ФормСтрока3);
	
	ИнформацияПоОбработкеОбъектов = Новый ФорматированнаяСтрока(МассивСтрокСообщения);
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяДопОбработка2001()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы КАК ВерсияПрограммы
	|ИЗ
	|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияРекомендуемые КАК ОбъектыКОбработкеПослеОбновленияРекомендуемые
	|ГДЕ
	|	ОбъектыКОбработкеПослеОбновленияРекомендуемые.ВерсияПрограммы В (""2.0.0.$a"", ""2.0.0.$b"", ""2.0.0.$c"", ""2.0.0.$d"")";
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Процедура Пауза(КоличествоСекунд)
	
	ВС_Шелл = Новый COMОбъект("WScript.Shell");
	ВС_Шелл.Run("ping 127.0.0.1 -n "+КоличествоСекунд, 0, 1);
	
КонецПроцедуры

&НаСервере
Функция ЕстьОбязательныеОбъектыКОбработке()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОбъектыКОбработкеПослеОбновленияОбязательные.ВерсияПрограммы КАК ВерсияПрограммы
	|ИЗ
	|	РегистрСведений.ОбъектыКОбработкеПослеОбновленияОбязательные КАК ОбъектыКОбработкеПослеОбновленияОбязательные";	
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти
