
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = Константы.ИспользоватьПодключаемоеОборудование.Получить();

	Заказ = Параметры.ЗаказНаПроизводство;
	Для каждого СтрокаТЧ из Заказ.материалы Цикл
		ЗаполнитьЗначенияСвойств(Материалы.Добавить(), СтрокаТЧ);	
	КонецЦикла;
	
	Параметры.Свойство("ПредставлениеПродукции", ПредставлениеПродукции);
	
	//#15805
	Элементы.ИзменитьКоличество.Видимость = ОбщийМодульСервер.НастройкаПользователя("РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда 
		Если ИмяСобытия = "ScanData" Тогда
			ОчиститьСообщения();
			ОбработатьШтрихкоды(МенеджерОборудованияПотолкиКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;	
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выпуск(Команда)
	
	ВыпускКлиент(Команда.Имя);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпускКлиент(ИмяКоманды)
	
	ПараметрыЗаказа = ПолучитьПараметрыЗаказаНаСервере(Заказ);
	
	Если ИмяКоманды = "Выпуск" Тогда
		
	ИначеЕсли ИмяКоманды = "ВыпускИзОстатков" Тогда
		ПараметрыЗаказа.Вставить("ВыпускИзОстатков", Истина);
	ИначеЕсли ИмяКоманды = "ВыпускИзМатериаловЗаказчика" Тогда
		ПараметрыЗаказа.Вставить("ВыпускИзМатериаловЗаказчика", Истина);
	КонецЕсли;
	
	Если МатериалыИзменены Тогда
		ПараметрыЗаказа.Вставить("Материалы", ТаблицаМатериалов());		
	КонецЕсли;
	
	//++ #14923
	//ОбщийМодульКлиент.ПеревестиЗаказНаПроизводствоВСтатусПроизведен(Заказ, ПараметрыЗаказа, Истина);	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("ЗначениеЗаполнения", ПараметрыЗаказа);
	ПараметрыВыполнения.Вставить("ОписаниеОшибки", "");
	
	СозданиеНаОснованииПотолкиКлиент.ВыпускПродукцииСоздатьНаОснованииЗаказаНаПроизводство(Заказ, ПараметрыВыполнения);
	//-- #14923
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОписаниеОшибки) Тогда
		Закрыть(ПараметрыВыполнения.ОписаниеОшибки);
	Иначе	
		Закрыть(Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьМатериал(Команда)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущийМатериал = ТекущиеДанные.Номенклатура;
	
	ПараметрыФормы = Новый Структура("ТекущаяСтрока", ТекущиеДанные.Номенклатура);
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаменитьМатериалФрагмент", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораДляСотрудникаПроизводства", ПараметрыФормы,,,,, ОписаниеОповещения); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьМатериалФрагмент(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МатериалыИзменены = Истина;
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	//ТекущаяСтрока = Материалы.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);	
	ТекущиеДанные.Номенклатура = ВыбранноеЗначение;
	МатериалыНоменклатураПриИзменении(Неопределено);
	
	//ОписаниеОповещения = Новый ОписаниеОповещения("ЗаменитьМатериалЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	//ПоказатьВводЧисла(ОписаниеОповещения, ТекущиеДанные.Количество, "Укажите количество", 15, 2);
	
	ИзменитьКоличествоМатериалаИнтерактивно(ТекущиеДанные);
	
КонецПроцедуры	

//&НаКлиенте
//Процедура ЗаменитьМатериалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
//	
//	Если ВыбранноеЗначение = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;	
//	ТекущиеДанные.Количество = ВыбранноеЗначение;
//	
//КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьЕдиницуИзмеренияДляПроизводства(ТекущиеДанные.Номенклатура);	
				
	Если ТипЗнч(ТекущиеДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущиеДанные.Коэффициент = 1;
	ИначеЕсли ТипЗнч(ТекущиеДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
		ТекущиеДанные.Коэффициент = ОбщийМодульВызовСервера.ПолучитьКоэффициентЕдиницыИзмерения(ТекущиеДанные.ЕдиницаИзмерения);
	КонецЕсли;
	
	ПроверитьШиринуПолотнаНоменклатурыИОчиститьКоличествоПриРазличии(ТекущиеДанные.Количество, ТекущиеДанные.Номенклатура, ПредыдущийМатериал);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличество(Команда)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьКоличествоМатериалаИнтерактивно(ТекущиеДанные)
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоМатериалаИнтерактивно(ТекущиеДанные)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Введите количество");
	ПараметрыФормы.Вставить("ЧислоВвода", ТекущиеДанные.Количество);
	ПараметрыФормы.Вставить("КоличествоСимволовПослеЗапятой", 3);
	
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", Элементы.Материалы.ТекущаяСтрока);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьКоличествоЗавершение", ЭтотОбъект, ДополнительныеПараметры);	
	ОткрытьФорму("Обработка.РабочееМестоСотрудникаПроизводства.Форма.ФормаВводаЧисла", ПараметрыФормы,,,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоЗавершение(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	СтрокаТабличнойЧасти = Материалы.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		СтрокаТабличнойЧасти.Количество = РезультатОткрытияФормы.ВведенноеЧисло;
		
		МатериалыИзменены = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	ШК = Данные.Штрихкод; // Штрихкод[0].Штрихкод;
	
	Если ПустаяСтрока(ШК) Тогда
		ПоказатьПредупреждение(,"Штрих-код не распознан");
		Возврат;
	КонецЕсли;

	//#14336
	Если Лев(ШК, 12) = "000000000000" Тогда
		Закрыть();
		Возврат;
	ИначеЕсли Лев(ШК, 12) = "000000000001" Тогда
		ВыпускКлиент("Выпуск");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыЗаказаНаСервере(ЗаказНаПроизводство)
	
	ПараметрыЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаказНаПроизводство, "Номер, Дата, ТекущийСтатус");
	ПараметрыЗаказа.Вставить("Заказ", ЗаказНаПроизводство);
	Возврат ПараметрыЗаказа;
	
КонецФункции

&НаСервере
Процедура ПроверитьШиринуПолотнаНоменклатурыИОчиститьКоличествоПриРазличии(Количество, НовыйМатериал, ПредыдущийМатериал)
	
	Если Константы.ПриЗаменеПленкиВВыпускеПродукцииНаПленкуДругойШириныОчищатьКоличествоКСписанию.Получить() 
		И НовыйМатериал.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно
		И ПредыдущийМатериал.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно
		И НЕ ПредыдущийМатериал.ШиринаПолотна = НовыйМатериал.ШиринаПолотна
	Тогда	
		
		Количество = 0;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТаблицаМатериалов()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Материалы.Выгрузить());
	
КонецФункции

#КонецОбласти



