
#Область ПроцедурыЗаписиДокументоа

Процедура ПроверитьИПровестиДокумент(Параметры, ПроверятьМодифицированность = Ложь) Экспорт
	
	Форма  = Параметры.Форма;
	Объект = Форма.Объект;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		ИЛИ НЕ Объект.Проведен
		ИЛИ (ПроверятьМодифицированность И Форма.Модифицированность) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикВопросаОНеобходимостиПроведенияДокумента", ЭтотОбъект, Параметры);
		ТекстВопроса = "Для продолжения документ следует провести. 
						|Провести документ?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Параметры.ДействиеПослеЗаписи, Параметры);
		
КонецПроцедуры

Процедура ОбработчикВопросаОНеобходимостиПроведенияДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	ОчиститьСообщения();
	Форма = ДополнительныеПараметры.Форма;
	РезультатЗаписиДокумента = Форма.Записать(ПараметрыЗаписи);
	
	Если РезультатЗаписиДокумента И ДополнительныеПараметры.Свойство("ДействиеПослеЗаписи") Тогда
		//ДействиеПослеЗаписи = Новый ОписаниеОповещения("ДействиеПослеЗаписи", Форма);
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ДействиеПослеЗаписи, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСРегистромИсторииДокумента

// Процедура - ДобавитьЗаписьВИсториюДокумента
//
// Параметры:
//  Форма			 - 	 Управляемая форма 
//  СтруктураИстории - 	 Структура("ИмяРеквизита, ОбработчикОповещения") 
//
Процедура ДобавитьЗаписьВИсториюДокумента(Форма, СтруктураИстории) Экспорт
		
	РеквизитФормы = Форма[СтруктураИстории.ИмяРеквизита];
	
	Если ПустаяСтрока(РеквизитФормы) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Запись в историю"" не заполнено",, СтруктураИстории.ИмяРеквизита);
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ДобавитьЗаписьВИсториюДокументаЗавершение", Форма);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ НЕ Объект.Проведен Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ДополнительныеПараметры.Вставить("ДействиеПослеЗаписи", ОписаниеОповещенияЗавершение);
		ДополнительныеПараметры.Вставить("ТекстЗаписиИстории", РеквизитФормы);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикВопросаОНеобходимостиПроведенияДокумента", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = "Для продолжения документ следует провести. 
						|Провести документ?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекстЗаписиИстории", РеквизитФормы);		
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершение, ДополнительныеПараметры);
		
КонецПроцедуры

#КонецОбласти

#Область ПредпросмотрИРаботаСФайлами

Процедура ПредпросмотрФайла(АдресФайла, Знач РасширениеФайла, РеквизитФормыДляВывода, ЭлементФормыДляВывода) Экспорт
	
	ЭлементФормыДляВывода.Вид = ВидПоляФормы.ПолеHTMLДокумента;
	
	// №7253
	Если АдресФайла = Неопределено Тогда
		РеквизитФормыДляВывода = "";
		Возврат;
	КонецЕсли;

	//ВременноеИмяФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	
	ВременноеИмяФайла = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + "." + РасширениеФайла;
	
	Результат = ПолучитьФайл(АдресФайла, ВременноеИмяФайла, Ложь);
	Если Результат Тогда	
		ОбъектФайл = Новый Файл(ВременноеИмяФайла);
		РасширениеФайла = НРег(ОбъектФайл.Расширение);
		
		Если РасширениеФайла = ".png"  
			ИЛИ РасширениеФайла = ".bmp"  
			ИЛИ РасширениеФайла = ".jpg"  
			ИЛИ РасширениеФайла = ".jpeg" 
			ИЛИ РасширениеФайла = ".gif"  
			ИЛИ РасширениеФайла = ".tiff"  
			ИЛИ РасширениеФайла = ".wmf" Тогда
		
			ОбъектКартинка = Новый Картинка(ВременноеИмяФайла);
			Если НЕ ОбъектКартинка.Формат() = ФорматКартинки.НеизвестныйФормат Тогда
				//РеквизитФормыДляВывода = "<HTML><img src=""file:\\" + ВременноеИмяФайла + """ width=""100%"" height=""100%""></img></HTML>";		
				ЭлементФормыДляВывода.Вид = ВидПоляФормы.ПолеКартинки;
				ЭлементФормыДляВывода.РазмерКартинки = РазмерКартинки.АвтоРазмер;
				РеквизитФормыДляВывода = АдресФайла;
			КонецЕсли;
			
		ИначеЕсли РасширениеФайла = ".txt" ИЛИ РасширениеФайла = ".ini" Тогда
			ЭлементФормыДляВывода.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;
			ТекстовыйФайл = Новый ТекстовыйДокумент;
			ТекстовыйФайл.Прочитать(ВременноеИмяФайла);
			РеквизитФормыДляВывода = ТекстовыйФайл.ПолучитьТекст();

		ИначеЕсли РасширениеФайла = ".doc" ИЛИ РасширениеФайла = ".docx" Тогда
			Word = ПолучитьCOMОбъект("", "Word.Application");
			Document = Word.Documents.Open(ВременноеИмяФайла);
			
			ВременноеИмяФайлаCOM = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + ".html";
			
			//ВременноеИмяФайлаCOM = ПолучитьИмяВременногоФайла(".html");
			Document.SaveAs(ВременноеИмяФайлаCOM, 8);
			Word.Quit();
			Word = Неопределено;
			РеквизитФормыДляВывода = ВременноеИмяФайлаCOM;
			
		ИначеЕсли РасширениеФайла = ".xls" ИЛИ РасширениеФайла = ".xlsx" Тогда
			Excel = ПолучитьCOMОбъект("", "Excel.Application");
			WorkBook = Excel.WorkBooks.Open(ВременноеИмяФайла);
			
			ВременноеИмяФайлаCOM = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + ".html";
			
			//ВременноеИмяФайлаCOM = ПолучитьИмяВременногоФайла(".html");
			WorkBook.SaveAs(ВременноеИмяФайлаCOM, 44);
			Excel.Quit();
			Excel = Неопределено;
			РеквизитФормыДляВывода = ВременноеИмяФайлаCOM; 
			
		ИначеЕсли РасширениеФайла = ".pdf" ИЛИ РасширениеФайла = ".xml" ИЛИ РасширениеФайла = ".html" Тогда
			РеквизитФормыДляВывода = ВременноеИмяФайла;
			
		Иначе
			//РеквизитФормыДляВывода = "";
			ЭлементФормыДляВывода.Вид = ВидПоляФормы.ПолеКартинки;
			ЭлементФормыДляВывода.РазмерКартинки = РазмерКартинки.АвтоРазмер;
			РеквизитФормыДляВывода = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ПросмотрНедоступен);
		КонецЕсли;
	Иначе
		РеквизитФормыДляВывода = "";
	КонецЕсли;

КонецПроцедуры

Процедура ПослеВыбораСсылкиДляПрикрепленияФайла(ВыбранныйЭлемент, ДопПараметры = Неопределено) Экспорт
	
	Результат = Ложь;
	
	// №7722 признак выбора только изображений и вывода сообщений при успешном результате
	ТолькоИзображения = Ложь;
	ВыводитьСообщенияПриУспешномРезультате = Истина;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		
		Если ДопПараметры.Свойство("ТолькоИзображения") Тогда
			ТолькоИзображения = ДопПараметры.ТолькоИзображения;
		КонецЕсли;
		
		Если ДопПараметры.Свойство("ВыводитьСообщенияПриУспешномРезультате") Тогда
			ВыводитьСообщенияПриУспешномРезультате = ДопПараметры.ВыводитьСообщенияПриУспешномРезультате;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранныйЭлемент) = Тип("ЭлементСпискаЗначений") Тогда	
		ВыбраннаяСсылка = ВыбранныйЭлемент.Значение;
	Иначе
		ВыбраннаяСсылка = ВыбранныйЭлемент;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	
	// №7722 признак выбора только изображений
	Если ТолькоИзображения Тогда
		ДиалогОткрытияФайла.Фильтр = ОбщийМодульКлиентСервер.ФильтрФайловИзображений();
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	Если НЕ ДопПараметры = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДополнительныеПараметры, ДопПараметры);	
	КонецЕсли;
	ДополнительныеПараметры.Вставить("ВыбраннаяСсылка", ВыбраннаяСсылка);
	Если НЕ ДопПараметры = Неопределено И ДопПараметры.Свойство("ДействиеПослеПрикрепления") Тогда
		ДополнительныеПараметры.Вставить("ДействиеПослеПрикрепления", ДопПараметры.ДействиеПослеПрикрепления);
	Иначе
		ДополнительныеПараметры.Вставить("ДействиеПослеПрикрепления", Неопределено);
	КонецЕсли;
	ДополнительныеПараметры.Вставить("ВыводитьСообщенияПриУспешномРезультате", ВыводитьСообщенияПриУспешномРезультате);

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФайловДляПрикрепления", ЭтотОбъект, ДополнительныеПараметры);
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

Процедура ПослеВыбораФайловДляПрикрепления(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	СтруктураРезультата = Новый Структура("Результат, ПрисоединенныеФайлы", Ложь, Новый Массив);
	
	Если ВыбранныеФайлы = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
		Возврат;
	КонецЕсли;
	
	ДействиеПослеПрикрепления = Неопределено;
	Если ДополнительныеПараметры.Свойство("ДействиеПослеПрикрепления", ДействиеПослеПрикрепления) Тогда
		ДополнительныеПараметры.Удалить("ДействиеПослеПрикрепления");
	КонецЕсли;
	
	Для Каждого ИмяФайла Из ВыбранныеФайлы Цикл
		ВыбФайл = Новый Файл(ИмяФайла);
		ПрисоединенныйФайл = ПредопределенноеЗначение("Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка");
		Если ОбщийМодульВызовСервера.СохранитьПрикрепленныеДанные(ДополнительныеПараметры.ВыбраннаяСсылка, 
																ВыбФайл.ИмяБезРасширения, 
																СтрЗаменить(ВыбФайл.Расширение,".",""), 
																ОбщийМодуль.Сериализовать(Новый ДвоичныеДанные(ИмяФайла)), 
																ДополнительныеПараметры, 
																ПрисоединенныйФайл) Тогда
																
			Если ДополнительныеПараметры.ВыводитьСообщенияПриУспешномРезультате Тогда
				Сообщить("Файлы успешно прикреплены");
			КонецЕсли;	
			СтруктураРезультата.Результат = Истина;
			СтруктураРезультата.ПрисоединенныеФайлы.Добавить(ПрисоединенныйФайл);
		Иначе
			Сообщить("Не удалось прикрепить файлы!", СтатусСообщения.Важное);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ДействиеПослеПрикрепления = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДействиеПослеПрикрепления, СтруктураРезультата);	
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьФайлыВДереве(Форма, ФайлыДерево, ЭлементыФайлыДерево) Экспорт
	
	МассивФайловКУдалению = Новый Массив;
	ВыбранныеЭлементы = ЭлементыФайлыДерево.ВыделенныеСтроки;	
	
	Если ВыбранныеЭлементы.Количество() > 0 Тогда
		Для каждого ЭлементДляПечати из ВыбранныеЭлементы Цикл
			СтрФайл = ФайлыДерево.НайтиПоИдентификатору(ЭлементДляПечати);
			
			// если выделен корень дерева, то пропускаем
			Если СтрФайл.ПолучитьРодителя() = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			КлючЗаписи = Новый Структура("Период,ВидФайлаПрограммыПостроителя,СсылкаНаОбъект,ИмяФайла");
			ЗаполнитьЗначенияСвойств(КлючЗаписи, СтрФайл);
			МассивФайловКУдалению.Добавить(КлючЗаписи);			
		КонецЦикла;
	Иначе
		ПоказатьПредупреждение(,"Выберите файл(ы) в списке");
	КонецЕсли;
	
	Если МассивФайловКУдалению.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Выберите файл(ы) в списке");
	Иначе
		ПараметрыУдаления = Новый Структура("МассивФайловКУдалению", МассивФайловКУдалению);
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбУдаленииФайловВДереве", Форма, ПараметрыУдаления);
		ПоказатьВопрос(Оповещение, "Удалить выбранные файлы из базы?", РежимДиалогаВопрос.ДаНет, 0);
	КонецЕсли;
	
КонецПроцедуры

//++ №13833
Процедура ОтправитьВсеВложенныеФайлыЗаказаНаПроизводствоНаПринтер(ДокументСсылка, УникальныйИдентификатор) Экспорт
	
	ФайлыЗаказа = ОбщийМодульВызовСервера.ПолучитьМассивФайловЗНП(ДокументСсылка);
	
	Для Каждого ДанныеФайла Из ФайлыЗаказа Цикл
		
		АдресФайла = ОбщийМодульВызовСервера.ПолучитьДанныеФайла(ДанныеФайла.Номенклатура, ДанныеФайла.ИмяФайла,, УникальныйИдентификатор);
		
		ВременноеИмя = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + "." + ДанныеФайла.Расширение;
		
		//ВременноеИмя = ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
		ПолучитьФайл(АдресФайла, ВременноеИмя, Ложь);
		
		Shell = Новый COMОбъект("Shell.Application");
		Shell.ShellExecute(ВременноеИмя, "", "", "print", 0);
		
		// пауза
		ДатаВыхода = ТекущаяДата() + 2;
		Пока ТекущаяДата() < ДатаВыхода Цикл
			ОбработкаПрерыванияПользователя();
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
//-- №13833


#Область ПросмотрФайловВПроводнике

Процедура ПросмотретьВсеФайлы(ФайлыДерево, СинонимВызываемогоОбъекта, УникальныйИдентификатор, ТолькоВыбранные = Ложь) Экспорт
	
	WSS = Новый COMОбъект("WScript.Shell");
	ПапкаМоиДокументы = WSS.SpecialFolders().Item("MyDocuments");
	
	Если ПустаяСтрока(ПапкаМоиДокументы) Тогда
		Возврат;
	КонецЕсли;
	ИмяКаталога = ПапкаМоиДокументы + "\" + СинонимВызываемогоОбъекта;
	
	КаталогНаДиске = Новый Файл(ИмяКаталога);
	Если НЕ КаталогНаДиске.Существует() Тогда
		СоздатьКаталог(ИмяКаталога);
	КонецЕсли;
	Если НЕ КаталогНаДиске.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	МассивПолучаемыхФайлов = Новый Массив;

	СтрокиДерева = ФайлыДерево.ПолучитьЭлементы();
	Для каждого СтрокаДокумента из СтрокиДерева Цикл
		Если ТолькоВыбранные И НЕ СтрокаДокумента.ПометкаДляВыбора Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКаталогаОбъекта = ИмяКаталога + "\" + СтрокаДокумента.СинонимОбъекта;
		КаталогОбъектаНаДиске = Новый Файл(ИмяКаталогаОбъекта);
		Если НЕ КаталогОбъектаНаДиске.Существует() Тогда
			СоздатьКаталог(ИмяКаталогаОбъекта);
		КонецЕсли;
		Если НЕ КаталогОбъектаНаДиске.Существует() Тогда
			Возврат;
		КонецЕсли;
		ПодстрокиДерева = СтрокаДокумента.ПолучитьЭлементы();
		Для Каждого СтрокаФайла Из ПодстрокиДерева Цикл
			АдресФайла = ОбщийМодульВызовСервера.ПолучитьДанныеФайла(СтрокаФайла.Документ, СтрокаФайла.ИмяФайла, , УникальныйИдентификатор);
			Если НЕ АдресФайла = Неопределено Тогда // №7253
				ВременноеИмя = ИмяКаталогаОбъекта + "\" + СтрокаФайла.НаименованиеФайла;			
				МассивПолучаемыхФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(ВременноеИмя, АдресФайла));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если МассивПолучаемыхФайлов.Количество() > 0 Тогда
		НачатьПолучениеФайлов(Новый ОписаниеОповещения("ПросмотретьВсеФайлыФрагмент", ЭтотОбъект, ИмяКаталога), МассивПолучаемыхФайлов,, Ложь);
	КонецЕсли;
	
КонецПроцедуры 	

Процедура ПросмотретьВсеФайлыФрагмент(ПолученныеФайлы, ДополнительныеПараметры) Экспорт 
    
    Если ПолученныеФайлы = Неопределено
        И Не (ТипЗнч(ПолученныеФайлы) = Тип("Массив")
            И ПолученныеФайлы.Количество()) Тогда
        Возврат;
    КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьЗапускПроводника", ЭтотОбъект,, "ОткрытьПроводникПриОбработкеОшибки", ЭтотОбъект);
	//НачатьЗапускПриложения(Оповещение, "explorer.exe """ + ДополнительныеПараметры + """");
	НачатьЗапускПриложения(Оповещение, "file:///" + ДополнительныеПараметры);
		
КонецПроцедуры

Процедура ОткрытьПроводникПриОбработкеОшибки(ИнформацияОбОшибке, СтандартнаяОбработка, Контекст) Экспорт 
	
	СтандартнаяОбработка = Ложь;
	ОткрытьПроводникОповеститьОбОшибке("", Контекст);
	
КонецПроцедуры

Процедура ОткрытьПроводникОповеститьОбОшибке(ОписаниеОшибки, Контекст)
	
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда 
		ПоказатьПредупреждение(, ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершитьЗапускПроводника(КодВозврата, ДополнительныеПараметры) Экспорт
	//не удалять	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЗагрузкаИзПостроителя

Процедура ВыборФайловПостроителя(Форма, ОповещениеПослеВыборФайлов, МножественныйВыбор = Истина, Знач ДляРозницы = Ложь) Экспорт
	
	НачальныйКаталог = ОбщийМодуль.ПолучитьКаталогВыгрузиИзПостроителяДляТекущегоПользователя(ДляРозницы);
	
	Если ОбменСEasyCeiling.ИспользоватьСтандартныйДиалогWindowsДляВыбораФайлаВыгрузкиИзПостроителя() Тогда		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Каталог = НачальныйКаталог;
		Фильтр = "Выгрузка из построителя (*.ini, *.json)|*.ini;*.json";
		Диалог.Фильтр = Фильтр;
		Диалог.МножественныйВыбор = МножественныйВыбор;
		Диалог.Заголовок = "Выберите файлы";	
		Диалог.Показать(ОповещениеПослеВыборФайлов);		
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НачальныйКаталог", НачальныйКаталог);
		ПараметрыФормы.Вставить("МножественныйВыбор", МножественныйВыбор);
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораФайла", ПараметрыФормы, Форма,,,,ОповещениеПослеВыборФайлов);					
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#Область РаботаСЗаказами

// Функция создает Выпуск продукции по Заказу на производство
// Параметры:
// - СсылкаНаЗаказНаПроизводство - ссылка на документ "Заказ на производство"
// - ПараметрыЗаказа - структура ("Номер, Дата, ТекущийСтатус")
//						При вызове из формы "ШКИсполнителиВыпуск" дополнительные ключи: "ВыпускИзОстатков", "ВыпускИзМатериаловЗаказчика"
// - ИзФормыШКИсполнители - признак вызова из формы "ШКИсполнителиВыпуск"
//
//Процедура ПеревестиЗаказНаПроизводствоВСтатусПроизведен(СсылкаНаЗаказНаПроизводство, ПараметрыЗаказа, ИзАРМСотрудникаПроизводства = Ложь) Экспорт
//	
//	Если СсылкаНаЗаказНаПроизводство.Пустая() Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ИмяСписка = "СписокВсе";
//	
//	Если ОбщийМодульВызовСервера.ОснованимЗаказаНаПроизводствоЯвляетсяЗаказПокупателя(СсылкаНаЗаказНаПроизводство) Тогда
//		СтруктураПроверки = ОбщийМодуль.ЗаказНаПроизводствоСоответствуетЗаказуПокупателя(СсылкаНаЗаказНаПроизводство, ОбщийМодульВызовСервера.ПолучитьСсылкуНаОснование(СсылкаНаЗаказНаПроизводство));
//		Если НЕ СтруктураПроверки.Результат Тогда
//			
//			Если ОбщийМодульВызовСервера.ЭтоПроизводствоУникальнойПродукции(СсылкаНаЗаказНаПроизводство) Тогда 
//				Если СтруктураПроверки.ЕстьПотолок Тогда
//					Парам = Новый Структура;
//					Парам.Вставить("ЗаказНаПроизводство", СсылкаНаЗаказНаПроизводство);
//					Парам.Вставить("ЗаказНаПроизводствоОснование", ОбщийМодульВызовСервера.ПолучитьСсылкуНаОснование(СсылкаНаЗаказНаПроизводство));
//					Парам.Вставить("ДоступноИзменениеПриНаличииВыпуска", СтруктураПроверки.ДоступноИзменениеПриНаличииВыпуска); // #13200 
//					Оп = Новый ОписаниеОповещения("НачалоПерезаполненияЗаказаНаПроизводствоПоОснованию", ОбщийМодульКлиент, Парам);
//					
//					ПоказатьВопрос(Оп,"Сведения по потолку и его производственным услугам в заказе покупателя, являющемся основанием, отличаются от данных в " + СсылкаНаЗаказНаПроизводство + ".
//					|Необходимо предварительно перезаполнить текущий заказ на произвосдтво по документу-основанию.
//					|Выполнить перезаполнение заказа на производство (документ будет автоматически записан)?", РежимДиалогаВопрос.ДаНет);
//				Иначе
//					Сообщить("В заказе покупателя (основании) отсутствует данный потолок!");
//				КонецЕсли;
//			Иначе
//				Парам = Новый Структура;
//				Парам.Вставить("ЗаказНаПроизводство", СсылкаНаЗаказНаПроизводство);
//				Парам.Вставить("ЗаказНаПроизводствоОснование", ОбщийМодульВызовСервера.ПолучитьСсылкуНаОснование(СсылкаНаЗаказНаПроизводство));
//				Парам.Вставить("ДоступноИзменениеПриНаличииВыпуска", СтруктураПроверки.ДоступноИзменениеПриНаличииВыпуска); // #13200
//				Оп = Новый ОписаниеОповещения("НачалоПерезаполненияЗаказаНаПроизводствоПоОснованию", ОбщийМодульКлиент, Парам);
//				
//				ПоказатьВопрос(Оп,"Сведения по продукции в заказе покупателя, являющемся основанием, отличаются от данных в " + СсылкаНаЗаказНаПроизводство + ".
//				|Необходимо предварительно перезаполнить текущий заказ на производство по документу-основанию.
//				|Выполнить перезаполнение заказа на производство (документ будет автоматически записан)?", РежимДиалогаВопрос.ДаНет);
//			КонецЕсли;
//			Возврат;
//			
//		КонецЕсли;
//	КонецЕсли;
//			
//	Если ПараметрыЗаказа.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.ВПроизводстве") Тогда
//		
//		СсылкаНаДокументВыпуска = ОбщийМодульВызовСервера.НайтиДокументВыпускаПродукции(СсылкаНаЗаказНаПроизводство);
//		
//		Если НЕ ОбщийМодульВызовСервера.ДокументПроведен(СсылкаНаЗаказНаПроизводство) Тогда
//			ПоказатьПредупреждение(,"Не все выбранные заказы проведены. Перед изменением статуса документа, его следует провести");
//			Возврат;
//		ИначеЕсли СсылкаНаДокументВыпуска = ПредопределенноеЗначение("Документ.ВыпускПродукции.ПустаяСсылка") Тогда
//			//если не нашли проведенный документ выпуска, попробуем найти созданный но не проведенный.
//			СсылкаНаДокументВыпуска = ОбщийМодульВызовСервера.ЕстьНеПроведенныйДокументВыпускаПоЭтомуЗаказу(СсылкаНаЗаказНаПроизводство); 
//			ПараметрыНовогоДокумента = Новый Структура;
//			//#13345
//			//ПараметрыНовогоДокумента.Вставить("Основание", СсылкаНаЗаказНаПроизводство);
//			ПараметрыНовогоДокумента.Вставить("ЗначенияЗаполнения", ПараметрыЗаказа);
//			ПараметрыНовогоДокумента.Вставить("Основание", ПараметрыЗаказа);
//			ПараметрыНовогоДокумента.Вставить("Ключ", СсылкаНаДокументВыпуска);
//			
//			ПараметрыОповещенияПослеЗакрытия = Новый Структура;
//			ПараметрыОповещенияПослеЗакрытия.Вставить("Дата", ПараметрыЗаказа.Дата);
//			ПараметрыОповещенияПослеЗакрытия.Вставить("Номер", ПараметрыЗаказа.Номер);
//			ПараметрыОповещенияПослеЗакрытия.Вставить("ИмяСписка", ИмяСписка);
//			ПараметрыОповещенияПослеЗакрытия.Вставить("Основание", СсылкаНаЗаказНаПроизводство);
//			ПараметрыОповещенияПослеЗакрытия.Вставить("Ключ", СсылкаНаДокументВыпуска);
//			
//			Если ИзАРМСотрудникаПроизводства Тогда
//				
//				ОписаниеОшибки = "";
//				//#13345
//				//СозданныйВыпускПродукции = ОбщийМодульВызовСервера.СоздатьНовыйВыпускПродукции(СсылкаНаЗаказНаПроизводство, СсылкаНаДокументВыпуска, ОписаниеОшибки);
//				СозданныйВыпускПродукции = ОбщийМодульВызовСервера.СоздатьНовыйВыпускПродукции(ПараметрыЗаказа, СсылкаНаДокументВыпуска, ОписаниеОшибки);
//				
//				Если СозданныйВыпускПродукции <> Неопределено
//					И НЕ СозданныйВыпускПродукции.Пустая() Тогда
//					ПослеСозданияДокументаВыпуска(Неопределено, ПараметрыОповещенияПослеЗакрытия);
//					////Нужно оповестить форму АРМ? - теперь в ПослеСозданияДокументаВыпуска есть оповещение
//					//Оповестить("ЗаписанЗаказНаПроизводство", СсылкаНаЗаказНаПроизводство, "ЗаказНаПроизводство");
//				Иначе
//					//ПоказатьПредупреждение(,"Не удалось создать выпуск продукции по заказу на производство " + СсылкаНаЗаказНаПроизводство + ": " + ОписаниеОшибки);
//				КонецЕсли;
//			Иначе	
//				ОткрытьФорму("Документ.ВыпускПродукции.Форма.ФормаДокумента", ПараметрыНовогоДокумента,, новый УникальныйИдентификатор(),,,Новый ОписаниеОповещения("ПослеСозданияДокументаВыпуска", ОбщийМодульКлиент, ПараметрыОповещенияПослеЗакрытия));
//			КонецЕсли;	
//		Иначе
//			//проверим, существующий заказ на производство соответсвует выпуску?
//			Если ОбщийМодульВызовСервера.ВыпускСоответствуетЗаказу(СсылкаНаДокументВыпуска, СсылкаНаЗаказНаПроизводство) Тогда
//				ПараметрыОповещенияПослеЗакрытия = Новый Структура;
//				ПараметрыОповещенияПослеЗакрытия.Вставить("Дата", ПараметрыЗаказа.Дата);
//				ПараметрыОповещенияПослеЗакрытия.Вставить("Номер", ПараметрыЗаказа.Номер);
//				ПараметрыОповещенияПослеЗакрытия.Вставить("ИмяСписка", ИмяСписка);
//				ПараметрыОповещенияПослеЗакрытия.Вставить("Основание", СсылкаНаЗаказНаПроизводство);				
//				ПараметрыОповещенияПослеЗакрытия.Вставить("Ключ", СсылкаНаДокументВыпуска);
//				ПослеСозданияДокументаВыпуска(Неопределено, ПараметрыОповещенияПослеЗакрытия);
//			Иначе
//				//предлагаем перезаполнить выпуск
//				ПараметрыНовогоДокумента = Новый Структура;
//				ПараметрыНовогоДокумента.Вставить("Ключ", СсылкаНаДокументВыпуска);
//				ПараметрыНовогоДокумента.Вставить("Основание", СсылкаНаЗаказНаПроизводство);				
//				ПараметрыНовогоДокумента.Вставить("Перезаполнить", Истина);
//				ПараметрыНовогоДокумента.Вставить("Дата", ПараметрыЗаказа.Дата);
//				ПараметрыНовогоДокумента.Вставить("Номер", ПараметрыЗаказа.Номер);
//				ПараметрыНовогоДокумента.Вставить("ИмяСписка", ИмяСписка);
//				
//				ПослеВопросаОПерезаполнении = Новый ОписаниеОповещения("ПослеВопросаОПерезаполненииВыпуска", ОбщийМодульКлиент, ПараметрыНовогоДокумента);
//				ПоказатьВопрос(ПослеВопросаОПерезаполнении, "На основании данного заказа уже оформлен выпуск продукции, но он не соответствует заказу. Перезаполнить существующий выпуск?", РежимДиалогаВопрос.ДаНет);
//			КонецЕсли;
//		КонецЕсли;
//		
//	Иначе
//		Состояние("В статус ""Произведен"" можно перевести заказ только из статуса ""В производстве""");
//	КонецЕсли;
//	
//КонецПроцедуры

//Процедура ПослеСозданияДокументаВыпуска(Результат, Параметры) Экспорт
//	
//	Заказ = Параметры.Основание;
//	Выпуск = ОбщийМодульВызовСервера.НайтиДокументВыпускаПродукции(Параметры.Основание);
//	
//	Если Выпуск = Неопределено или Выпуск = ПредопределенноеЗначение("Документ.ВыпускПродукции.ПустаяСсылка") Тогда
//		ПоказатьПредупреждение(,"Перевод в статус ""Произведен"" отменен - нет документа выпуска");
//	ИначеЕсли ОбщийМодульВызовСервера.ВыпускСоответствуетЗаказу(Выпуск, Заказ) Тогда
//		Номер = "";
//		Дата = "";
//		ИмяСписка = "";
//		Параметры.Свойство("Номер", Номер);
//		Параметры.Свойство("Дата", Дата);
//		Параметры.Свойство("ИмяСписка", ИмяСписка);
//		Если Не Номер = "" и НЕ Дата = "" и НЕ ИмяСписка = "" Тогда
//			ОбщийМодульВызовСервера.ИзменитьСтатусЗаказаНаПроизводствоНаПроизведен(, Номер, Дата);
//			//Элементы[ИмяСписка].Обновить();
//		КонецЕсли;
//	Иначе
//		ПоказатьПредупреждение(,"Заказ на производство не может быть переведен в статус ""Произведен"", т.к. выпуск не полностью соответствует заказу");
//	КонецЕсли;
//	
//	Оповестить("ЗаписанЗаказНаПроизводство", Заказ, "ЗаказНаПроизводство");
//				
//КонецПроцедуры

Функция ТекстВопросаПерезаполненииЗаказаНаПроизводствоПоОснованию(СтруктураПроверки) Экспорт
	
	ТекстСообщения = "Сведения в заказе покупателя, являющемся основанием, отличаются от данных в этом заказе на производство.
					|Необходимо предварительно перезаполнить текущий заказ на производство по документу-основанию.";
	//#13200
	Если НЕ СтруктураПроверки.ЕстьВыпуск ИЛИ СтруктураПроверки.ДоступноИзменениеПриНаличииВыпуска Тогда
		ТекстСообщения = ТекстСообщения + "
		|Выполнить перезаполнение заказа на производство (документ будет автоматически записан)?";
	Иначе
		ТекстСообщения = ТекстСообщения + "
		|По заказу имеется выпуск: необходимо его отменить";
	КонецЕсли;
	
	Возврат ТекстСообщения;
				
КонецФункции

//Процедура НачалоПерезаполненияЗаказаНаПроизводствоПоОснованию(Результат, Параметры) Экспорт
//	
//	Если Результат = КодВозвратаДиалога.Да Тогда
//		ДоступноИзменениеПриНаличииВыпуска = Параметры.ДоступноИзменениеПриНаличииВыпуска; // #13200
//		Если ОбщийМодульВызовСервера.ЭтоПроизводствоУникальнойПродукции(Параметры.ЗаказНаПроизводство) Тогда
//			СтруктураПотолка = ОбщийМодульВызовСервера.ПолучитьПотолокЗаказаНаПроизводство(Параметры.ЗаказНаПроизводство);
//			ОбщийМодуль.ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя(Параметры.ЗаказНаПроизводство, СтруктураПотолка.Потолок, Параметры.ЗаказНаПроизводствоОснование,,СтруктураПотолка.УИстроки, ДоступноИзменениеПриНаличииВыпуска);
//		Иначе
//			ОбщийМодуль.ОбновитьЗаказНаТиповоеПроизводствоПоЗаказуПокупателя(Параметры.ЗаказНаПроизводство, Параметры.ЗаказНаПроизводствоОснование, , ДоступноИзменениеПриНаличииВыпуска);
//		КонецЕсли;
//		
//		ПоказатьПредупреждение(,"Заказ на производство перезаполнен");
//		
//    КонецЕсли;

//КонецПроцедуры

Процедура ПослеВопросаОПерезаполненииВыпуска(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		//пользователь согласился с перезаполнением документа
		ПараметрыОповещенияПослеЗакрытия = Новый Структура;
		ПараметрыОповещенияПослеЗакрытия.Вставить("Дата", Параметры.Дата);
		ПараметрыОповещенияПослеЗакрытия.Вставить("Номер", Параметры.Номер);
		ПараметрыОповещенияПослеЗакрытия.Вставить("ИмяСписка", Параметры.ИмяСписка);
		ПараметрыОповещенияПослеЗакрытия.Вставить("Основание", Параметры.Основание);				
		ПараметрыОповещенияПослеЗакрытия.Вставить("Ключ", Параметры.Ключ);
		ОткрытьФорму("Документ.ВыпускПродукции.Форма.ФормаДокумента", Параметры,,,,,Новый ОписаниеОповещения("ПослеСозданияДокументаВыпуска", ОбщийМодульКлиент, ПараметрыОповещенияПослеЗакрытия));
	Иначе
		//пользователь отказался
		ПоказатьПредупреждение(,"Выпуск должен соответствовать заказу");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеревестиЗаказыНаПроизводствоВСтатусОтменен(МассивЗаказовКОтмене) Экспорт
	
	ТекстВопроса = "На основании заказа покупателя имеются заказы на производство, которые еще не были произведены. Перевести их в статус ""Отменен""?
	|Список заказов на производство к отмене:";
	Для каждого ЭлементМассива из МассивЗаказовКОтмене Цикл
		ТекстВопроса = ТекстВопроса + Строка(ЭлементМассива) + Символы.ПС;
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура("МассивЗаказовКОтмене", МассивЗаказовКОтмене);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОбОтменеЗаказовНаПроизводство", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура ПослеВопросаОбОтменеЗаказовНаПроизводство(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для каждого ЭлементМассива из ДополнительныеПараметры.МассивЗаказовКОтмене Цикл
			ОбщийМодульВызовСервера.ИзменитьСтатусЗаказНаПроизводство(ЭлементМассива, ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.Отменен"));
		КонецЦикла;
		ПоказатьПредупреждение(,"Перевод заказов на производство в статус ""Отменен"" завершен");
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РаботаСЗаказДоговоромИПредварительнымРасчетом

// Обработчик команды "+ Потолок из программы-построителя
Процедура ЗагрузитьПотолокИзПостроителя(Форма, ТипДокументаСтрокой, ВМатериалы = Ложь, ВСписокМатериалов = Ложь) Экспорт
	
	Если НЕ ПроверитьДоступностиРасширенногоФункционала() тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
		
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;	
	Если ВМатериалы Тогда
		ТекущиеДанные = Элементы.ДеревоМатериалов.ТекущиеДанные;
	КонецЕсли;
	
	ТекущаяКомната = "";
	Если НЕ ВСписокМатериалов Тогда
		Если ТекущиеДанные = Неопределено Тогда
			ПоказатьОповещениеПользователя("Выберите комнату");
			Возврат;
		КонецЕсли;
		
		Если ПустаяСтрока(ТекущиеДанные.Комната) Тогда
			ПоказатьОповещениеПользователя("Выберите комнату");
			Возврат;
		КонецЕсли;
		
		ТекущаяКомната = ТекущиеДанные.Комната;
	КонецЕсли;
	
	//ДополнительныеПараметры = Новый Структура("ТекущаяКомната, ВМатериалы, ВСписокМатериалов, Форма, ТипДокументаСтрокой", ТекущаяКомната, ВМатериалы, ВСписокМатериалов, Форма, ТипДокументаСтрокой);
	ДополнительныеПараметры = Новый Структура("ТекущаяКомната, ВМатериалы, ВСписокМатериалов, Форма", ТекущаяКомната, ВМатериалы, ВСписокМатериалов, Форма);
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьПотолокИзПостроителяПослеВыбораФайлов", ЭтотОбъект, ДополнительныеПараметры);
	
	ВыборФайловПостроителя(Форма, Оповещение, Истина, Истина);

	//НачальныйКаталог = ОбщийМодуль.ПолучитьКаталогВыгрузиИзПостроителяДляТекущегоПользователя(Истина);
	//
	//Если ОбменСEasyCeiling.ИспользоватьСтандартныйДиалогWindowsДляВыбораФайлаВыгрузкиИзПостроителя() Тогда		
	//	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//	Диалог.Каталог = НачальныйКаталог;
	//	Фильтр = "Выгрузка из построителя (*.ini)|*.ini";
	//	Диалог.Фильтр = Фильтр;
	//	Диалог.МножественныйВыбор = Истина;
	//	Диалог.Заголовок = "Выберите файлы";	
	//	Диалог.Показать(Оповещение);		
	//Иначе
	//	ОткрытьФорму("ОбщаяФорма.ФормаВыбораФайла", Новый Структура("НачальныйКаталог", НачальныйКаталог), Форма, , , , Оповещение);					
	//КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьПотолокИзПостроителяПослеВыбораФайлов(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//ПеренестиДеревоВТабличнуюЧасть();
	
	СписокФайлов = Новый СписокЗначений;
	СписокФайлов.ЗагрузитьЗначения(ВыбранныеФайлы);
	
	ОповещениеПослеЗакрытия = Новый ОписаниеОповещения("ЗагрузитьПотолокИзПостроителяЗавершение", ДополнительныеПараметры.Форма, ДополнительныеПараметры);			
	ПараметрыФормыЗагрузки = Новый Структура;
	ПараметрыФормыЗагрузки.Вставить("ЗапускатьПриОткрытии", Истина);
	ПараметрыФормыЗагрузки.Вставить("НаКлиенте", 			Истина);
	
	ПараметрыФормыЗагрузки.Вставить("СписокФайлов", 		СписокФайлов);
	ПараметрыФормыЗагрузки.Вставить("ПоВладельцу", 			Истина);
	
	ПараметрыФормыЗагрузки.Вставить("ЭтоРозница", 			Истина);
	//ПараметрыФормыЗагрузки.Вставить("ТипДокументаСтрокой", 	ДополнительныеПараметры.ТипДокументаСтрокой);
	ПараметрыФормыЗагрузки.Вставить("УчитыватьНДС",			ДополнительныеПараметры.Форма.УчитыватьНДС);
	ПараметрыФормыЗагрузки.Вставить("Комната", 				ДополнительныеПараметры.ТекущаяКомната);	
	ПараметрыФормыЗагрузки.Вставить("ВМатериалы", 			ДополнительныеПараметры.ВМатериалы ИЛИ ДополнительныеПараметры.ВСписокМатериалов);
	
	ОткрытьФорму("ОбщаяФорма.ФормаЗагрузкиИзПостроителя", ПараметрыФормыЗагрузки, ДополнительныеПараметры.Форма, , , , ОповещениеПослеЗакрытия);

КонецПроцедуры

Функция РасширеннаяОбработкаДобавленнойПродукции(Форма, ВидЗаказа, ВМатериалы=Ложь, Комната, СтруктураПродукции, ЭтоПродукция = Ложь) Экспорт
	
	//#11670 обработка по расширенным правилам
	
	Объект = Форма.Объект;

	ОписаниеОшибки = "";
	
	//++ №13814
	Если ЭтоПродукция Тогда
		СтруктураПродукцииПотолка = новый Структура("ПродукцияНоменклатура, ВидНоменклатурыПотолка, КоличествоПродукция", СтруктураПродукции.Номенклатура, ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция"), СтруктураПродукции.Количество);
	//-- №13814
	Иначе
		СтруктураПродукцииПотолка = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(СтруктураПродукции.Номенклатура,,,,,,, ОписаниеОшибки);
	КонецЕсли;
	
	Если СтруктураПродукцииПотолка <> Неопределено И Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		//++ №13814
		Если ЭтоПродукция Тогда
			НомерРасчета = СтруктураПродукции.НомерРасчета;
		Иначе
			НомерРасчета = СтруктураПродукцииПотолка.НомерРасчетаЗаказа;
		КонецЕсли;
		//-- №13814
			
		ДоговорКонтрагента = Неопределено;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ДоговорКонтрагента") Тогда
			ДоговорКонтрагента = Объект.ДоговорКонтрагента	
		КонецЕсли;
	
		ДанныеЗаказа = ОбменСEasyCeiling.СтруктураДанныхЗаказа(Объект.Организация, Объект.Подразделение, ,
							  				 Объект.ВидЦен, Объект.Валюта, Объект.Дата, Форма.УчитыватьНДС, , ДоговорКонтрагента);
		СтруктураЗаказа = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураПродукцииПотолка, ВидЗаказа, ДанныеЗаказа, Истина);
				
		Для Каждого ТекущаяСтрока Из СтруктураЗаказа.Товары Цикл
			Если НЕ ТекущаяСтрока.РасширеннаяОбработка Тогда
				Продолжить;
			КонецЕсли;
			//НоваяСтрока = Объект.ТоварыУслуги.Добавить();
			НоваяСтрока = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Коэффициент, Бесплатно, Комната, УИСтроки, 
											|ЗагруженоИзПостроителя, НомерПотолка, ПроцентСкидки, Спецификация, СтавкаНДС, Сумма, СуммаНДС, СуммаПоПрайсу, СуммаСкидки,
											|ЦветФактуры, Цена, ЦенаПоПрайсу");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Комната = Комната;
			НоваяСтрока.НомерПотолка = НомерРасчета;
			НоваяСтрока.УИСтроки = СтруктураПродукции.УИСтроки;
			Если ВМатериалы = Неопределено Тогда
				НоваяСтрокаТаблицы = Объект.ТоварыУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
			Иначе
				Розница_ДобавитьСтрокуВДеревоТоваров(Форма, НоваяСтрока, Ложь);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из СтруктураЗаказа.Услуги Цикл
			Если НЕ ТекущаяСтрока.РасширеннаяОбработка Тогда
				Продолжить;
			КонецЕсли;
			//НоваяСтрока = Объект.ТоварыУслуги.Добавить();
			НоваяСтрока = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Коэффициент, Бесплатно, Комната, УИСтроки, 
											|ЗагруженоИзПостроителя, НомерПотолка, ПроцентСкидки, Спецификация, СтавкаНДС, Сумма, СуммаНДС, СуммаПоПрайсу, СуммаСкидки,
											|ЦветФактуры, Цена, ЦенаПоПрайсу");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Комната = Комната;
			НоваяСтрока.НомерПотолка = НомерРасчета;
			НоваяСтрока.УИСтроки = СтруктураПродукции.УИСтроки;
			Если ВМатериалы = Неопределено Тогда
				НоваяСтрокаТаблицы = Объект.ТоварыУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
			Иначе
				Розница_ДобавитьСтрокуВДеревоТоваров(Форма, НоваяСтрока, Ложь);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из СтруктураЗаказа.Материалы Цикл
			Если НЕ ТекущаяСтрока.РасширеннаяОбработка Тогда
				Продолжить;
			КонецЕсли;
			//НоваяСтрока = Объект.Материалы.Добавить();	
			НоваяСтрока = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Коэффициент, Комната, УИСтроки, НоменклатураТоваров");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);			
			НоваяСтрока.Комната = Комната;
			Если ВМатериалы = Ложь Тогда
				НоваяСтрока.НоменклатураТоваров = СтруктураПродукции.Номенклатура;
			КонецЕсли;
			НоваяСтрока.УИСтроки = СтруктураПродукции.УИСтроки;
			Если ВМатериалы = Неопределено Тогда
				НоваяСтрокаТаблицы = Объект.Материалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
			Иначе
				Розница_ДобавитьСтрокуВДеревоМатериалов(Форма, НоваяСтрока, Ложь);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция Розница_КомнатаЗаполнена(ТекущиеДанные) Экспорт
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущиеДанные.Комната) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
	
//++ №12433
//Процедура Розница_ДобавитьНоменклатуруВДерево(Форма, ДеревоЗначений, ДанныеСтроки, ПереходНаСтроку = Истина, ТекущийЭлемент="", РежимИзмененияСтроки = Истина) Экспорт
Процедура Розница_ДобавитьНоменклатуруВДерево(Форма, ИмяДереваЗначений, ДанныеСтроки, ПереходНаСтроку = Истина, РежимИзмененияСтроки = Истина) Экспорт
//-- №12433
	
	//++ №12433
	//СтрокиКомнат = ДеревоЗначений.ПолучитьЭлементы(); 
	СтрокиКомнат = Форма[ИмяДереваЗначений].ПолучитьЭлементы(); 
	//-- №12433
	
	Для Каждого СтрокаКомнаты из СтрокиКомнат Цикл
		Если СтрокаКомнаты.Комната = ДанныеСтроки.Комната Тогда
			СтрокиНоменклатуры = СтрокаКомнаты.ПолучитьЭлементы();
			
			НоваяСтрока = СтрокиНоменклатуры.Добавить();
			НоваяСтрока.Номенклатура = ДанныеСтроки.Номенклатура;
			НоваяСтрока.Комната = ДанныеСтроки.Комната;			
			НоваяСтрока.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(НоваяСтрока.Номенклатура);
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Количество = 1;
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "УИСтроки") Тогда
				НоваяСтрока.УИСтроки = Новый УникальныйИдентификатор;
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "Уровень") Тогда
				НоваяСтрока.Уровень = 1;
			КонецЕсли;
			
			Если ПереходНаСтроку Тогда
				//++ №12433 исправлем обращение
				//Форма.Элементы.ДеревоЗначений.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
				//Форма.Элементы.ДеревоЗначений.ТекущийЭлемент = Форма.Элементы[ТекущийЭлемент];
				Форма.Элементы[ИмяДереваЗначений].ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
				Форма.Элементы[ИмяДереваЗначений].ТекущийЭлемент = Форма.Элементы[ИмяДереваЗначений + "Количество"];
				//-- №12433
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);
			
			Если РежимИзмененияСтроки Тогда				
				
				//++ №12433 исправлем обращение
				//Форма.Элементы[ДеревоЗначений].ИзменитьСтроку();
				Форма.Элементы[ИмяДереваЗначений].ИзменитьСтроку();
				//-- №12433 исправлем обращение
				
			КонецЕсли;
			Прервать;
		КонецЕсли
	КонецЦикла;	
	
КонецПроцедуры

Процедура Розница_ДобавитьСтрокуВДеревоМатериалов(Форма, ДанныеСтроки, ПереходНаСтроку = Истина, РежимИзмененияСтроки = Ложь) Экспорт
	
	//++ №12433
	//Розница_ДобавитьНоменклатуруВДерево(Форма, Форма.ДеревоМатериалов, ДанныеСтроки,  ПереходНаСтроку, "ДеревоМатериаловКоличество", РежимИзмененияСтроки);
	Розница_ДобавитьНоменклатуруВДерево(Форма, "ДеревоМатериалов", ДанныеСтроки,  ПереходНаСтроку, РежимИзмененияСтроки);
	//-- №12433
	
	Форма.КоличествоСтрокМатериалов = Форма.КоличествоСтрокМатериалов + 1;
	
КонецПроцедуры

Процедура Розница_ДобавитьСтрокуВДеревоТоваров(Форма, ДанныеСтроки, ПереходНаСтроку = Истина, РежимИзмененияСтроки = Ложь)
	
	//++ №12433
	//Розница_ДобавитьНоменклатуруВДерево(Форма, Форма.ДеревоТоваров, ДанныеСтроки, ПереходНаСтроку, "ДеревоТоваровКоличество", РежимИзмененияСтроки);
	Розница_ДобавитьНоменклатуруВДерево(Форма, "ДеревоТоваров", ДанныеСтроки, ПереходНаСтроку, РежимИзмененияСтроки);
	//-- №12433
	
	Форма.КоличествоСтрокТоваров = Форма.КоличествоСтрокТоваров + 1;

КонецПроцедуры

Процедура Розница_ДобавитьКомнату(Параметры) Экспорт
	
	Если Параметры.ПереключательНаНазваниеКомнат Тогда
		ПараметрыФормыВыбора = Новый Структура("ПодборВЗаказДоговор", Истина);
		// #10992 изменена схема наименования комнаты
		//ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКомнаты", ЭтотОбъект);
		//ОткрытьФорму("Справочник.НазваниеКомнат.ФормаВыбора", ПараметрыФормыВыбора, , , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ОткрытьФорму("Справочник.НазваниеКомнат.ФормаВыбора", ПараметрыФормыВыбора, Параметры.Форма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Розница_ДобавитьКомнатуЗавершение(Параметры, Неопределено);
	КонецЕсли;
		
КонецПроцедуры

Процедура Розница_ДобавитьКомнатуЗавершение(Параметры, ДанныеВыборкаКомнаты) Экспорт
	
	Форма = Параметры.Форма;
	
	МассивКомнат = Новый Массив;
	СтрокиКомнат = Форма.ДеревоТоваров.ПолучитьЭлементы();
	Для каждого СтрокаКомнаты из СтрокиКомнат Цикл
		МассивКомнат.Добавить(СтрокаКомнаты.Комната);
	КонецЦикла;
	
	//добавим комнату в товары
	ИмяНовойКомнаты = "";
	Если ДанныеВыборкаКомнаты = Неопределено Тогда
		// простое добавление комнаты с номером
		ИмяНовойКомнаты = ОбщийМодульВызовСервера.Розница_ПолучитьНаименованиеНовойКомнаты(МассивКомнат, Неопределено);
	Иначе
		// добавление из справочника		
		ИмяНовойКомнаты = СокрЛП(ДанныеВыборкаКомнаты.Комната);
		Если НЕ ДанныеВыборкаКомнаты.НеДобавлятьПрефиксКомнаты Тогда
			// с префиксом "Комната Х ..."
			ИмяНовойКомнаты = ОбщийМодульВызовСервера.Розница_ПолучитьНаименованиеНовойКомнаты(МассивКомнат, ДанныеВыборкаКомнаты.Комната);
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаКомнаты из СтрокиКомнат Цикл
		Если СтрокаКомнаты.Комната = ИмяНовойКомнаты Тогда
			ТекстСообщения = "Комната с наименованием """ + ИмяНовойКомнаты + """ уже имеется в заказе";
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ПоказатьПредупреждение(, ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	НоваяСтрокаТовары = СтрокиКомнат.Добавить();
	НоваяСтрокаТовары.Комната = ИмяНовойКомнаты;
	Форма.Элементы.ДеревоТоваров.ТекущаяСтрока = НоваяСтрокаТовары.ПолучитьИдентификатор();

	//добавим комнату в материалах
	ЕстьРеквизитЗМ = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ЗаполнениеМатериаловПоЗаказам");
	
	Если НЕ ЕстьРеквизитЗМ ИЛИ Форма.ЗаполнениеМатериаловПоЗаказам Тогда
		НоваяСтрокаМатериалы = Форма.ДеревоМатериалов.ПолучитьЭлементы().Добавить();
		НоваяСтрокаМатериалы.Комната = ИмяНовойКомнаты;
	КонецЕсли;
	
	Форма.РассчитатьИтоговыеПоказателиКлиент();

КонецПроцедуры

Процедура Розница_ПереименоватьКомнату(ПараметрыПереименования) Экспорт
	
	ПослеВводаНовогоНаименованияКомнаты = Новый ОписаниеОповещения("Розница_ПослеВводаНовогоНаименованияКомнаты", ЭтотОбъект, ПараметрыПереименования);
	ПоказатьВводСтроки(ПослеВводаНовогоНаименованияКомнаты, ПараметрыПереименования.СтароеНаименование, "Введите название комнаты");
	
КонецПроцедуры

Процедура Розница_ПослеВводаНовогоНаименованияКомнаты(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    //проверим на наличие такого наименования
	ПараметрыПереименования = Новый Структура;
	ПараметрыПереименования.Вставить("НовоеНаименование",		Результат);
	ПараметрыПереименования.Вставить("СтароеНаименование",		Параметры.СтароеНаименование);
	ПараметрыПереименования.Вставить("ИдТекущейСтрокиКомнаты",	Параметры.ИдТекущейСтрокиКомнаты);
	
	ИдИмеющейсяСтрокиКомнаты = 0;
	ЕстьКомната = Ложь;
	СтрокиКомнат = Параметры.Форма.ДеревоТоваров.ПолучитьЭлементы();
	Для каждого СтрокаКомнаты из СтрокиКомнат Цикл
		Если СтрокаКомнаты.Комната = Результат Тогда
			ЕстьКомната = Истина;
			ИдИмеющейсяСтрокиКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПереименования.Вставить("ИдИмеющейсяСтрокиКомнаты", ИдИмеющейсяСтрокиКомнаты);
	ПараметрыПереименования.Вставить("ЕстьКомната",				 ЕстьКомната);
	ПараметрыПереименования.Вставить("Форма",				 	 Параметры.Форма);
	
	Если ЕстьКомната Тогда
		ПереименоватьКомнатуПодтверждение = Новый ОписаниеОповещения("Розница_ПереименоватьКомнатуПодтверждение", ЭтотОбъект, ПараметрыПереименования);
		ПоказатьВопрос(ПереименоватьКомнатуПодтверждение,"В документе уже есть комната """+Результат+""""+Символы.ПС
		+"Если присвоить такое же наименование, все товары текущей комнаты будут добавлены к существующей."
		+Символы.ПС+"Продолжить?",РежимДиалогаВопрос.ДаНет)
	Иначе
		Розница_ПереименоватьКомнатуПодтверждение(КодВозвратаДиалога.Да, ПараметрыПереименования);
	КонецЕсли;

КонецПроцедуры

Процедура Розница_ПереименоватьКомнатуПодтверждение(Результат, ДополнительныеПараметры) Экспорт
	
    Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
	КонецЕсли;

	Форма = ДополнительныеПараметры.Форма;
	
	Если НЕ ДополнительныеПараметры.ЕстьКомната Тогда
		//товары
		СтрокаКомнаты = Форма.ДеревоТоваров.НайтиПоИдентификатору(ДополнительныеПараметры.ИдТекущейСтрокиКомнаты);	
		СтрокаКомнаты.Комната = ДополнительныеПараметры.НовоеНаименование;
		СтрокиТоваров = СтрокаКомнаты.ПолучитьЭлементы();
		Для каждого СтрокаТовара из СтрокиТоваров Цикл
			СтрокаТовара.Комната = ДополнительныеПараметры.НовоеНаименование;	
		КонецЦикла;
		
		//материалы
		Для Каждого ТекущаяСтрокаДерева Из Форма.ДеревоМатериалов.ПолучитьЭлементы() Цикл
			Если ТекущаяСтрокаДерева.Комната = ДополнительныеПараметры.СтароеНаименование Тогда
				ТекущаяСтрокаДерева.Комната = ДополнительныеПараметры.НовоеНаименование;				
				Для Каждого ТекущаяСтрока Из ТекущаяСтрокаДерева.ПолучитьЭлементы() Цикл
					Если ТекущаяСтрока.Комната = ДополнительныеПараметры.СтароеНаименование Тогда
						ТекущаяСтрока.Комната = ДополнительныеПараметры.НовоеНаименование;
					КонецЕсли;
				КонецЦикла;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		//товары
		СтрокаКомнаты = Форма.ДеревоТоваров.НайтиПоИдентификатору(ДополнительныеПараметры.ИдТекущейСтрокиКомнаты);
		СтрокаНовойКомнаты = Форма.ДеревоТоваров.НайтиПоИдентификатору(ДополнительныеПараметры.ИдИмеющейсяСтрокиКомнаты);
		СтрокиТоваров = СтрокаКомнаты.ПолучитьЭлементы();
		Для каждого СтрокаТовара из СтрокиТоваров Цикл
			НоваяСтрокаТовара = СтрокаНовойКомнаты.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовара, СтрокаТовара);
			НоваяСтрокаТовара.Комната = ДополнительныеПараметры.НовоеНаименование;	
		КонецЦикла;
		Форма.ДеревоТоваров.ПолучитьЭлементы().Удалить(СтрокаКомнаты);
		Форма.Элементы.ДеревоТоваров.ТекущаяСтрока = ДополнительныеПараметры.ИдИмеющейсяСтрокиКомнаты;
		
		//материалы
		СтрокаКомнатыМатериалов = Неопределено;
		СтрокаНовойКомнатыМатериалов = Неопределено;
		Для Каждого ТекущаяСтрокаДерева Из Форма.ДеревоМатериалов.ПолучитьЭлементы() Цикл
			Если ТекущаяСтрокаДерева.Комната = ДополнительныеПараметры.СтароеНаименование Тогда
				СтрокаКомнатыМатериалов = ТекущаяСтрокаДерева;	
			КонецЕсли;
			Если ТекущаяСтрокаДерева.Комната = ДополнительныеПараметры.НовоеНаименование Тогда
				СтрокаНовойКомнатыМатериалов = ТекущаяСтрокаДерева;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ СтрокаКомнатыМатериалов = Неопределено И НЕ СтрокаНовойКомнатыМатериалов = Неопределено Тогда			
			Для каждого СтрокаМатериала из СтрокаКомнатыМатериалов.ПолучитьЭлементы() Цикл
				НоваяСтрокаМатериала = СтрокаНовойКомнатыМатериалов.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаМатериала, СтрокаМатериала);
				НоваяСтрокаМатериала.Комната = ДополнительныеПараметры.НовоеНаименование;	
			КонецЦикла;
			Форма.ДеревоМатериалов.ПолучитьЭлементы().Удалить(СтрокаКомнатыМатериалов);
		КонецЕсли;
		
		Форма.РассчитатьИтоговыеПоказателиКлиент();

	КонецЕсли;
	
	Форма.Модифицированность = Истина;

КонецПроцедуры

Процедура Розница_ПеренестиПозициюВДругуюКомнату(Параметры) Экспорт

	Форма = Параметры.Форма;
	СписокКомнат = ПолучитьСписокКомнатПоДереву(Форма.ДеревоТоваров, Параметры.ТекущаяКомната);		
	ПеренестиВДругуюКомнатуПодтверждение = Новый ОписаниеОповещения("Розница_ПеренестиВДругуюКомнатуПодтверждение", ЭтотОбъект, Параметры);
	СписокКомнат.ПоказатьВыборЭлемента(ПеренестиВДругуюКомнатуПодтверждение, "Выберите комнату");
	
КонецПроцедуры 

Процедура Розница_ПеренестиВДругуюКомнатуПодтверждение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    //ПеренестиВДругуюКомнатуПодтверждениеНаСервере(ВыбранныйЭлемент.Значение, ДополнительныеПараметры);
	
	ИмяКомнаты = ВыбранныйЭлемент.Значение;
	Если ИмяКомнаты = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Форма = ДополнительныеПараметры.Форма;
	//ТекущаяСтрока = Форма.ДеревоТоваров.НайтиПоИдентификатору(ДополнительныеПараметры.ИдТекущейСтроки);
	//Если ИмяКомнаты = ТекущаяСтрока.Комната Тогда
	//	Возврат;
	//КонецЕсли;
	
	ЭлементыДерева = Форма.ДеревоТоваров.ПолучитьЭлементы();
	Для Каждого ТекЭлемент из ЭлементыДерева Цикл		
		Если СокрЛП(ТекЭлемент.Комната) = СокрЛП(ИмяКомнаты) Тогда
			СтрокиКомнатыПриемника = ТекЭлемент.ПолучитьЭлементы();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	МассивСтрок = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтрок, ДополнительныеПараметры.ВыделенныеСтроки);
	Для каждого ИдТекущейСтроки из МассивСтрок Цикл
		ТекущаяСтрока = Форма.ДеревоТоваров.НайтиПоИдентификатору(ИдТекущейСтроки);
		Если ИмяКомнаты = ТекущаяСтрока.Комната Тогда
			Продолжить;
		КонецЕсли;
	 
		// добавляем новую строку
		УИСтроки = ТекущаяСтрока.УИСтроки;
		НоваяСтрока = СтрокиКомнатыПриемника.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока, , "Комната");
		НоваяСтрока.Комната = ИмяКомнаты;
		ИдНовойСтроки = НоваяСтрока.ПолучитьИдентификатор();		
	
		// удаляем перенесенную	
		РодительКомната     = ТекущаяСтрока.ПолучитьРодителя();	
		РодительКомната.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
	
		// перенесем материалы, относящиеся к товару
		НоваяКомнатаМатериалов = Неопределено;
		СтрокиДереваМатериалов = Форма.ДеревоМатериалов.ПолучитьЭлементы();
		Для Каждого СтрокаКомнаты из СтрокиДереваМатериалов Цикл
			Если СокрЛП(СтрокаКомнаты.Комната) = СокрЛП(ИмяКомнаты) Тогда
				НоваяКомнатаМатериалов = СтрокаКомнаты.ПолучитьЭлементы();
			КонецЕсли;
		КонецЦикла;
		Если НЕ НоваяКомнатаМатериалов = Неопределено Тогда
			//добавляем
			Для Каждого СтрокаКомнаты из СтрокиДереваМатериалов Цикл		
				Если СокрЛП(СтрокаКомнаты.Комната) = СокрЛП(ДополнительныеПараметры.ТекущаяКомната) Тогда
					Для Каждого СтрокаМатериала Из СтрокаКомнаты.ПолучитьЭлементы() Цикл
						Если СтрокаМатериала.УИСтроки = УИСтроки Тогда
							НоваяСтрока = НоваяКомнатаМатериалов.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМатериала, , "Комната");
							НоваяСтрока.Комната = ИмяКомнаты;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			//удаляем
			Для Каждого СтрокаКомнаты из СтрокиДереваМатериалов Цикл		
				Если СокрЛП(СтрокаКомнаты.Комната) = СокрЛП(ДополнительныеПараметры.ТекущаяКомната) Тогда
					СтрокиМатериалов = СтрокаКомнаты.ПолучитьЭлементы();
					КоличествоСтрокМатериалов = СтрокиМатериалов.Количество();
					//обратный обход для удаления
					Для Индекс = 1 По КоличествоСтрокМатериалов Цикл
						СтрокаМатериала = СтрокиМатериалов[КоличествоСтрокМатериалов-Индекс];
						Если СтрокаМатериала.УИСтроки = УИСтроки Тогда
							
							ИдентификаторСтроки = СтрокаМатериала.ПолучитьИдентификатор();
							ТекущаяСтрокаМатериалов  = Форма.ДеревоМатериалов.НайтиПоИдентификатору(ИдентификаторСтроки);	
							РодительКомната     = ТекущаяСтрокаМатериалов.ПолучитьРодителя();	
							РодительКомната.ПолучитьЭлементы().Удалить(ТекущаяСтрокаМатериалов);
							
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;				
		КонецЕсли;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
	Форма.РассчитатьИтоговыеПоказателиКлиент();	
	Форма.Элементы.ДеревоТоваров.ТекущаяСтрока = ИдНовойСтроки;
	
КонецПроцедуры

#Область КомандыУстановкиСкидок

Процедура Розница_ИзменитьСкидку(Параметры) Экспорт
	
	УстановитьСкидку = 0;
	ПроцедураПослеВВодаСкидки = Новый ОписаниеОповещения("Розница_ИзменитьСкидкуПослеВводаСкидки", ЭтотОбъект, Параметры);
	ПоказатьВводЗначения(ПроцедураПослеВВодаСкидки, УстановитьСкидку, Параметры.ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура Розница_ИзменитьСкидкуПослеВводаСкидки(ЗначениеСкидки, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеСкидки = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ЕстьСтрокиСВыполненнымиМонтажами = Ложь;
	
	Предмет  = ДополнительныеПараметры.Предмет;	
	Форма    = ДополнительныеПараметры.Форма;
	ЭтоЗаказ = ДополнительныеПараметры.ЭтоЗаказ;
	
	СтрокиКомнат = Форма.ДеревоТоваров.ПолучитьЭлементы(); 
	Для Каждого СтрокаКомнаты из СтрокиКомнат Цикл
		СтрокиНоменклатуры = СтрокаКомнаты.ПолучитьЭлементы();		
		Для каждого СтрокаНоменклатуры из СтрокиНоменклатуры Цикл
			
			ЭтоПотолок = (СтрокаНоменклатуры.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок"))
				ИЛИ (СтрокаНоменклатуры.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"))
				ИЛИ (СтрокаНоменклатуры.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.ТиповойОтрез")
				ИЛИ (СтрокаНоменклатуры.УчитыватьКакПотолок) // №14690
			);
			
			Если (Предмет = "Товары" И СтрокаНоменклатуры.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Материал") И НЕ СтрокаНоменклатуры.УчитыватьКакПотолок)
				ИЛИ (Предмет = "Услуги" И СтрокаНоменклатуры.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Услуга") И НЕ СтрокаНоменклатуры.УчитыватьКакПотолок)
				ИЛИ (Предмет = "Потолок" И ЭтоПотолок)
				ИЛИ (Предмет = "Все") // №14690
			Тогда
				
				ТребуетсяИзменениеСкидки = Истина;
				Если ЭтоЗаказ Тогда
					Если СтрокаНоменклатуры.МонтажСтатус = ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Выполнен") 
						ИЛИ СтрокаНоменклатуры.МонтажСтатус = ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Закрыт") Тогда
						ЕстьСтрокиСВыполненнымиМонтажами = Истина;
						ТребуетсяИзменениеСкидки = Ложь;
					КонецЕсли;
				КонецЕсли;
				
				Если ТребуетсяИзменениеСкидки Тогда
					СтрокаНоменклатуры.ПроцентСкидки = ЗначениеСкидки;					
					
					ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(СтрокаНоменклатуры, "ПроцентСкидки", "СуммаСкидки");
					ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаНоменклатуры, Ложь, "СуммаСкидки");
					ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуПоПрайсуВСтрокеТЧ(СтрокаНоменклатуры);
					ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаНоменклатуры, Форма.УчитыватьНДС);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;	
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеИзмененияСкидки, ЕстьСтрокиСВыполненнымиМонтажами);
	Если ЕстьСтрокиСВыполненнымиМонтажами Тогда
		Сообщить("При установке скидки были пропущены строки по выполненным и закрытым монтажам");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура Розница_ЗаполнитьКомнатуПоШаблону(Форма, ЗапретРедактированияЦен) Экспорт
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;	
	
	Если ПустаяСтрока(ТекущиеДанные.Комната) Тогда		
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ВидЦены",				Объект.ВидЦен);
	ПараметрыПодбора.Вставить("Валюта",					Объект.Валюта);
	ПараметрыПодбора.Вставить("ЗапретРедактированияЦен",ЗапретРедактированияЦен);
	
	ЕстьРеквизитКонтрагент = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Контрагент");
	Если ЕстьРеквизитКонтрагент Тогда
		ПараметрыПодбора.Вставить("Контрагент",				Объект.Контрагент);
	КонецЕсли;	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ДоговорКонтрагента") Тогда
		ПараметрыПодбора.Вставить("ДоговорКонтрагента",		Объект.ДоговорКонтрагента);
	ИначеЕсли ЕстьРеквизитКонтрагент И ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыПодбора.Вставить("ДоговорКонтрагента",		ОбщийМодульВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ОсновнойДоговор"));
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ШаблоныКомнатДляЗаказДоговора.Форма.ФормаПодбора", ПараметрыПодбора, Форма, Форма.УникальныйИдентификатор);
	
КонецПроцедуры

Процедура Розница_ОбработкаВыбораЗаполненияПоШаблону(Форма, ОповещениеЗаполнитьКомнатуПоШаблонуЗавершение, ВыбранноеЗначение) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущаяСтрока;	
	СтрокаКомнаты = Форма.ДеревоТоваров.НайтиПоИдентификатору(ТекущаяСтрока);
	Если НЕ СтрокаКомнаты.ПолучитьРодителя() = Неопределено Тогда
		СтрокаКомнаты = СтрокаКомнаты.ПолучитьРодителя();
	КонецЕсли;
	СтрокиТоваров = СтрокаКомнаты.ПолучитьЭлементы(); //.Удалить();
	
	Если СтрокиТоваров.Количество() = 0 Тогда
		Розница_ЗаполнитьКомнатуПоШаблонуЗавершение(ОповещениеЗаполнитьКомнатуПоШаблонуЗавершение, ВыбранноеЗначение);
	Иначе
		ТекстВопроса = "Комната не пустая. Очистить комнату перед заполнением?";
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("СтрокаКомнаты", СтрокаКомнаты);
		ДополнительныеПараметры.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
		ДополнительныеПараметры.Вставить("ОповещениеЗаполнитьКомнатуПоШаблонуЗавершение", ОповещениеЗаполнитьКомнатуПоШаблонуЗавершение);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ОписаниеОповещения = Новый ОписаниеОповещения("Розница_ЗаполнитьКомнатуПоШаблонуФрагмент", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

Процедура Розница_ЗаполнитьКомнатуПоШаблонуФрагмент(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		// очищаем строки товаров в выбранной комнате
		СтрокиТоваров = ДополнительныеПараметры.СтрокаКомнаты.ПолучитьЭлементы();
		КоличествоСтрок = СтрокиТоваров.Количество();
		Для Индекс = 1 по КоличествоСтрок Цикл 
			СтрокиТоваров.Удалить(СтрокиТоваров[КоличествоСтрок - Индекс]);
		КонецЦикла;
		ДополнительныеПараметры.Форма.Элементы.ДеревоТоваров.ТекущаяСтрока = ДополнительныеПараметры.СтрокаКомнаты.ПолучитьИдентификатор();		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		// не очищаем	
	Иначе
		Возврат;
	КонецЕсли;
	
	Розница_ЗаполнитьКомнатуПоШаблонуЗавершение(ДополнительныеПараметры.ОповещениеЗаполнитьКомнатуПоШаблонуЗавершение, ДополнительныеПараметры.ВыбранноеЗначение);
	
КонецПроцедуры

Процедура Розница_ЗаполнитьКомнатуПоШаблонуЗавершение(ОповещениеЗаполнитьКомнатуПоШаблонуЗавершение, ВыбранноеЗначение)
	
	ВыполнитьОбработкуОповещения(ОповещениеЗаполнитьКомнатуПоШаблонуЗавершение, ВыбранноеЗначение);
	//ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
КонецПроцедуры

&НаКлиенте
Процедура Розница_ТоварыСуммаПриИзменении(Форма, СтрокаТабличнойЧасти, ЭтоДерево = Истина) Экспорт
	
	//корневые строки редактировать нельзя
	Если ЭтоДерево И СтрокаТабличнойЧасти.ПолучитьРодителя() = Неопределено Тогда
		СтрокаТабличнойЧасти.Сумма = 0;
		Возврат;
	КонецЕсли;	
	
	СтрокаТабличнойЧасти.Бесплатно = Ложь;
	
	//++ #15423	
	//Если НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
	//	Если СтрокаТабличнойЧасти.ПроцентСкидки = 100 Тогда
	//		СтрокаТабличнойЧасти.Цена = 0;
	//	ИначеЕсли НЕ СтрокаТабличнойЧасти.ПроцентСкидки = 0 Тогда
	//		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / ((1 - СтрокаТабличнойЧасти.ПроцентСкидки / 100) * СтрокаТабличнойЧасти.Количество);
	//	Иначе
	//		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	//	КонецЕсли;
	//КонецЕсли;
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(СтрокаТабличнойЧасти, "ПроцентСкидки", "СуммаСкидки");
	Если НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = (СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.СуммаСкидки) / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;	
	//-- #15423
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, Форма.УчитыватьНДС);
	Форма.РассчитатьИтоговыеПоказателиКлиент(); 
	
КонецПроцедуры

#КонецОбласти

#Область Штрихкодирование

Функция ПолучитьНоменклатуруПоШтрихКоду(Штрихкод) Экспорт
	
	СтруктураТовара = Новый Структура;
	СтруктураТовара.Вставить("Номенклатура", 				ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	СтруктураТовара.Вставить("ХарактеристикаНоменклатуры", 	ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	СтруктураТовара.Вставить("СерияНоменклатуры", 			ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка"));
	СтруктураТовара.Вставить("ЕдиницаИзмерения", 			ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка"));
	СтруктураТовара.Вставить("Штрихкод", 					"");
	
	Если Штрихкод.Количество() = 0 Тогда
		Возврат ШтрихКод;
	КонецЕсли;
	 
	СтруктураТовара.Вставить("Штрихкод", Штрихкод[0].Штрихкод);
	
	ОбщийМодульВызовСервера.ЗаполнитьСтруктуруТовараПоШтрихКоду(СтруктураТовара);
	
	Возврат СтруктураТовара;	
	
КонецФункции

Процедура ОткрытьФормуПечатиШК(ЗначениеКода, ТипШтрихкода = Неопределено, ЗаголовокКода="") Экспорт
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("ПотолкиПечатьШтрихкода", Истина);
	//++ №13526 по умолчанию EAN13
	//ПараметрыОткрытия.Вставить("ПотолкиТипШтрихкода", ?(ТипШтрихкода = Неопределено, ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.Code128"), ТипШтрихкода));
	ПараметрыОткрытия.Вставить("ПотолкиТипШтрихкода", ?(ТипШтрихкода = Неопределено, ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.EAN13"), ТипШтрихкода));
	//-- №13526
	ПараметрыОткрытия.Вставить("ПотолкиЗначениеКода", ЗначениеКода);
	ПараметрыОткрытия.Вставить("ПотолкиЗаголовокКода", ЗаголовокКода);
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, , КлючУникальности);
	
КонецПроцедуры
	
#КонецОбласти

#Область Розница

Функция СоздатьЗаказКлиента(Команда) Экспорт
	
	Если Команда.Имя = "СоздатьЗаказДоговор" Тогда
		ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Договор");
	ИначеЕсли Команда.Имя = "СоздатьЗаказНаПродажу" Тогда
		ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Продажа");
	ИначеЕсли Команда.Имя = "СоздатьЗаказНаРекламацию" Тогда
		ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Рекламация");
	ИначеЕсли Команда.Имя = "СоздатьЗаказНаСервис" Тогда
		ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.СервиснаяЗаявка");			
	КонецЕсли;
	
	ПараметрыНовогоДокумента = Новый Структура("ЗначенияЗаполнения", Новый Структура("ВидЗаказа", ВидЗаказа));				
	ОткрытьФорму("Документ.ЗаказДоговор.ФормаОбъекта", ПараметрыНовогоДокумента);
	
КонецФункции

Функция СоздатьМонтаж(Команда) Экспорт
	
	Если Команда.Имя = "СоздатьМонтажМонтаж" Тогда
		ВидОперации = ПредопределенноеЗначение("Справочник.ВидыМонтажа.Монтаж");
	ИначеЕсли Команда.Имя = "СоздатьМонтажПродажа" Тогда
		ВидОперации = ПредопределенноеЗначение("Справочник.ВидыМонтажа.Продажа");
	ИначеЕсли Команда.Имя = "СоздатьМонтажРекламация" Тогда
		ВидОперации = ПредопределенноеЗначение("Справочник.ВидыМонтажа.Рекламация");
	ИначеЕсли Команда.Имя = "СоздатьМонтажСервис" Тогда
		ВидОперации = ПредопределенноеЗначение("Справочник.ВидыМонтажа.СервиснаяЗаявка");			
	КонецЕсли;
	
	ПараметрыНовогоДокумента = Новый Структура("ЗначенияЗаполнения", Новый Структура("ВидОперации", ВидОперации));				
	ОткрытьФорму("Документ.Монтаж.ФормаОбъекта", ПараметрыНовогоДокумента);
	
КонецФункции


Функция СоздатьМонтажНаОсновании(Основание, Команда) Экспорт
	
	Если Команда.Имя = "СоздатьМонтажМонтаж" Тогда
		ВидОперации = ПредопределенноеЗначение("Справочник.ВидыМонтажа.Монтаж");
	ИначеЕсли Команда.Имя = "СоздатьМонтажПродажа" Тогда
		ВидОперации = ПредопределенноеЗначение("Справочник.ВидыМонтажа.Продажа");
	ИначеЕсли Команда.Имя = "СоздатьМонтажРекламация" Тогда
		ВидОперации = ПредопределенноеЗначение("Справочник.ВидыМонтажа.Рекламация");
	ИначеЕсли Команда.Имя = "СоздатьМонтажСервис" Тогда
		ВидОперации = ПредопределенноеЗначение("Справочник.ВидыМонтажа.СервиснаяЗаявка");			
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;				
	ЗначенияЗаполнения.Вставить("ВидОперации", ВидОперации);
	ЗначенияЗаполнения.Вставить("Основание", Основание);
	
	ПараметрыНовогоДокумента = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);				
	ОткрытьФорму("Документ.Монтаж.ФормаОбъекта", ПараметрыНовогоДокумента);
	
КонецФункции


Функция СоздатьЗаказНаОсновании(Основание, Команда) Экспорт
	
	Если Команда.Имя = "СоздатьЗаказРекламация" Тогда
		ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.Рекламация");
	ИначеЕсли Команда.Имя = "СоздатьЗаказСервис" Тогда
		ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказДоговоров.СервиснаяЗаявка");			
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;				
	ЗначенияЗаполнения.Вставить("ВидЗаказа", ВидЗаказа);
	ЗначенияЗаполнения.Вставить("Основание", Основание);
	
	ПараметрыНовогоДокумента = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);				
	ОткрытьФорму("Документ.ЗаказДоговор.ФормаОбъекта", ПараметрыНовогоДокумента);
	
КонецФункции



#КонецОбласти

#Область ПроцедурыИФункцииРМК

// Открывает форму ФормаРМКУправляемаяИнформацииОбОшибке в модальном режиме из РМК (управляемый режим).
//
Функция ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации, 
												ОбработчикОповещения = Неопределено,
												ВладелецФормы = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокИнформации", ПараметрыИнформации.ЗаголовокИнформации);
	
	Если ПараметрыИнформации.Свойство("ТекстИнформации") Тогда
		ПараметрыФормы.Вставить("ТекстИнформации", ПараметрыИнформации.ТекстИнформации);
	КонецЕсли;
	
	Если ПараметрыИнформации.Свойство("ТипОтвета") И ЗначениеЗаполнено(ПараметрыИнформации.ТипОтвета) Тогда
		ПараметрыФормы.Вставить("ТипОтвета", ПараметрыИнформации.ТипОтвета);
	КонецЕсли;
	
	Если ПараметрыИнформации.Свойство("ОтветПоУмолчанию") И ЗначениеЗаполнено(ПараметрыИнформации.ОтветПоУмолчанию) Тогда
		ПараметрыФормы.Вставить("ОтветПоУмолчанию", ПараметрыИнформации.ОтветПоУмолчанию);
	КонецЕсли;
	
	Если ПараметрыИнформации.Свойство("ПоказатьПодсказку") И ПараметрыИнформации.ПоказатьПодсказку Тогда
		ПараметрыФормы.Вставить("Подсказка", ПараметрыИнформации.Подсказка);
	КонецЕсли;
	
	Если ВладелецФормы = Неопределено Тогда
		Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
				
		ОткрытьФорму("ОбщаяФорма.ФормаРМКУправляемаяИнформацииОбОшибке", ПараметрыФормы,,,,, ОбработчикОповещения, Режим); 
	Иначе
		Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
				
		ОткрытьФорму("ОбщаяФорма.ФормаРМКУправляемаяИнформацииОбОшибке", ПараметрыФормы, ВладелецФормы,,,, ОбработчикОповещения, Режим); 
	КонецЕсли;
	
КонецФункции

// Процедура открывает форму ФормаРМКУправляемаяИнформацииОбОшибке с текстом информации.
//
Процедура ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, 
											 ТекстИнформации = Неопределено, 
											 ОбработчикОповещения = Неопределено, 
											 ВладелецФормы = Неопределено,
											 Подсказка = Неопределено) Экспорт
	
	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	ПараметрыИнформации.ЗаголовокИнформации = ЗаголовокИнформации;
	Если ТекстИнформации = Неопределено Тогда
		ПараметрыИнформации.ТекстИнформации = Символы.Таб;
	Иначе
		ПараметрыИнформации.ТекстИнформации = ТекстИнформации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подсказка) Тогда
		ПараметрыИнформации.ПоказатьПодсказку = Истина;
		ПараметрыИнформации.Подсказка = Подсказка;
	КонецЕсли;
	
	ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации, ОбработчикОповещения, ВладелецФормы);
	
КонецПроцедуры

// Открывает форму ФормаРМКУправляемаяИнформацииОбОшибке с текстом вопроса.
//
Функция ВывестиВопросДляРМКУправляемой(ЗаголовокИнформации, 
									   ТекстИнформации = Неопределено, 
									   ОтветПоУмолчанию = "Нет", 
									   ОбработчикОповещения = Неопределено,
									   ВладелецФормы = Неопределено) Экспорт

	ПараметрыИнформации = ОбщийМодульКлиентСервер.ВыводимаяВРМКИнформация();
	ПараметрыИнформации.ЗаголовокИнформации = ЗаголовокИнформации;
	Если ТекстИнформации = Неопределено Тогда
		ПараметрыИнформации.ТекстИнформации = Символы.Таб;
	Иначе
		ПараметрыИнформации.ТекстИнформации = ТекстИнформации;
	КонецЕсли;
	ПараметрыИнформации.ТипОтвета           = "Вопрос";
	ПараметрыИнформации.ОтветПоУмолчанию    = ОтветПоУмолчанию;
	
	ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации, ОбработчикОповещения, ВладелецФормы);
	
КонецФункции

//// Процедура - подключение открытия РМК (управляемый режим)события таймера.
////
//Процедура ОткрытьМеню() Экспорт
//	
//	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
//		ПодключитьОбработчикОжидания("ОткрытьМенюРМКУправляемыйРежимПриЗапуске",0.1,Истина);
//	#КонецЕсли
//	
//КонецПроцедуры

//// Процедура открывает меню РМК.
////
//Процедура ОткрытьМенюРМКУправляемыйРежим() Экспорт
//	
//			 		
//	ФормаРабочегоМестаКассира = ОбщегоНазначенияРТВызовСервера.ЗначениеПараметраСеанса("ФормаРабочегоМестаКассира");
//	
//	Если Не ЗначениеЗаполнено(ФормаРабочегоМестаКассира) Тогда
//        
//        // &ЗамерПроизводительности 	
//        ОценкаПроизводительностиРТКлиент.НачатьЗамер(
//                 Истина, "Обработка.РМКУправляемыйРежим.Форма.ФормаМеню.ПриОткрытии");

//		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуРМКУправляемый", ЭтотОбъект);
//		Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
//		ОткрытьФорму("Обработка.РМКУправляемыйРежим.Форма.ФормаМеню",,,,,, ОбработчикОповещения, Режим);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//// Обработка результата открытия формы РМК управляемый.
////
//Процедура ОповещениеОткрытьФормуРМКУправляемый(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
//	Если РезультатОткрытияФормы = "ЗавершитьРаботуСистемы" Тогда
//		ЗавершитьРаботуСистемы(Ложь);
//	КонецЕсли;
//КонецПроцедуры

// Устанавливает заголовок в РМК, учитывая текущую операцию и прочие параметры.
//
// Параметры:
//  СтруктураДанных - Структура.
//  Элементы - ВсеЭлементыФормы.
//  НадписьЗаголовок - Строка.
//
Процедура УстановитьЗаголовокВРМК(СтруктураДанных, Элементы, НадписьЗаголовок) Экспорт 
	
	ВидОперации                  = СтруктураДанных.ВидОперации;
	ОперацияСДенежнымиСредствами = СтруктураДанных.ОперацияСДенежнымиСредствами;
	//ПродажаПоЗаказу              = СтруктураДанных.ПродажаПоЗаказу;
	//ДокументРасчета              = СтруктураДанных.ДокументРасчета;
	//ЭтоЗачетАванса               = СтруктураДанных.ЭтоЗачетАванса;
	//НомерЗаказа                  = СтруктураДанных.НомерЗаказа;
	//ЭтоОплатаРассрочки           = СтруктураДанных.ЭтоОплатаРассрочки;
	Продавец                     = СтруктураДанных.Продавец;
	//РеверсКнопкиПродавец         = СтруктураДанных.РеверсКнопкиПродавец;
	//ИмяКнопкиПродавец            = СтруктураДанных.ИмяКнопкиПродавец;
	ЦветПродажи                  = СтруктураДанных.ЦветПродажи;
	//СуммаОстаткаДокументаРасчета = СтруктураДанных.СуммаОстаткаДокументаРасчета;
	
	СтрокаЗаголовок = "";
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Возврат") Тогда
		Если ОперацияСДенежнымиСредствами Тогда
			СтрокаЗаголовок = НСтр("ru = 'Возврат денежных средств без передачи товаров'");
		Иначе
			СтрокаЗаголовок = НСтр("ru = 'Возврат'") 
		КонецЕсли;
		ЗаголовокЧ004Возврат = ПолучитьТекстЗаголовка(НСтр("ru = 'Продажа (F5)'"));
		Элементы.КартинкаЧО04Возврат.Заголовок = ЗаголовокЧ004Возврат;
		Элементы.КартинкаЧО04Возврат.ТекстНевыбраннойКартинки = ЗаголовокЧ004Возврат;
		Элементы.КартинкаЧО04Возврат.ЦветТекста = WebЦвета.Красный;
		
		//ЗаголовокЧ009ДС = ПолучитьТекстЗаголовка(НСтр("ru = 'Без передачи товаров (Shift + F10)'"));
		//Элементы.КартинкаЧО09ОперацияДС.Заголовок = ЗаголовокЧ009ДС;
		//Элементы.КартинкаЧО09ОперацияДС.ТекстНевыбраннойКартинки = ЗаголовокЧ009ДС;
	Иначе
		Если ОперацияСДенежнымиСредствами Тогда
			СтрокаЗаголовок = НСтр("ru = 'Прием денежных средств без передачи товаров'");
		Иначе
			СтрокаЗаголовок = НСтр("ru = 'Продажа'");
		КонецЕсли;
		ЗаголовокЧ004Возврат = ПолучитьТекстЗаголовка(НСтр("ru = 'Возврат (F5)'"));
		Элементы.КартинкаЧО04Возврат.Заголовок = ЗаголовокЧ004Возврат;
		Элементы.КартинкаЧО04Возврат.ТекстНевыбраннойКартинки = ЗаголовокЧ004Возврат;
		Элементы.КартинкаЧО04Возврат.ЦветТекста = ЦветПродажи;
		
		//ЗаголовокЧ009ДС = ПолучитьТекстЗаголовка(НСтр("ru = 'Без передачи товаров (Shift + F10)'"));
		//Элементы.КартинкаЧО09ОперацияДС.Заголовок = ЗаголовокЧ009ДС;
		//Элементы.КартинкаЧО09ОперацияДС.ТекстНевыбраннойКартинки = ЗаголовокЧ009ДС;
	КонецЕсли;
	
	//Если ОперацияСДенежнымиСредствами Тогда
	//	Элементы.КартинкаЧО09ОперацияДС.ЦветТекста = WebЦвета.Синий;
	//Иначе
	//	Элементы.КартинкаЧО09ОперацияДС.ЦветТекста = ЦветПродажи;
	//КонецЕсли;
	
	//Если ПродажаПоЗаказу Тогда
	//	
	//	СтрокаЗаголовок = СтрокаЗаголовок + НСтр("ru = ' по заказу №'") + НомерЗаказа;
	//	
	//ИначеЕсли ЗначениеЗаполнено(ДокументРасчета) И ЭтоЗачетАванса Тогда
	//	
	//	СтрокаЗаголовок = СтрокаЗаголовок + НСтр("ru = ' Зачет аванса '") +
	//		Формат(СуммаОстаткаДокументаРасчета, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧГ=3,0");
	//	
	//ИначеЕсли ЗначениеЗаполнено(ДокументРасчета) И ЭтоОплатаРассрочки Тогда
	//	
	//	СтрокаЗаголовок = СтрокаЗаголовок + НСтр("ru = ' Остаток рассрочки '") +
	//		Формат(СуммаОстаткаДокументаРасчета, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧГ=3,0");
	//КонецЕсли;
	
	//Пользователь = глЗначениеПеременной("ПользовательИзмененныхПрав");
	//
	//Если Пользователь = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Пользователь) Тогда
	//	Элементы.НадписьЗаголовок.ЦветТекста = WebЦвета.Зеленый;
	//Иначе
	//	СтрокаЗаголовок = "" + Пользователь + " - " + СтрокаЗаголовок;
	//	Элементы.НадписьЗаголовок.ЦветТекста = WebЦвета.Красный;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Продавец) Тогда
		СтрокаЗаголовок = СтрокаЗаголовок + " - "+ Продавец
	КонецЕсли;
	
	НадписьЗаголовок = СтрокаЗаголовок;
	
	//УстановитьРеверсныеИменаКнопокНижнейПанели(РеверсКнопкиПродавец, ИмяКнопкиПродавец, Элементы, Продавец);
	
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ИсходныйЗаголок)
	
#Если ВебКлиент Тогда 
	НовыйЗаголовок = "";
	НомерСимвола = СтрНайти(ИсходныйЗаголок, "(");
	Если НомерСимвола = 0 Тогда 
		Возврат ИсходныйЗаголок;
	КонецЕсли;
	НовыйЗаголовок = Лев(ИсходныйЗаголок, НомерСимвола - 2);
	
	Возврат НовыйЗаголовок;
#Иначе
	Возврат ИсходныйЗаголок;
#КонецЕсли
	
КонецФункции

// Формирует структуру, которая содержит массив КассККМ и Организаций.
//
// Параметры:
//   * ТаблицаБыстрыхТоваров - Таблица значений - таблица с колонками:
//     * Организация - СправочникСсылка.Организации.
//     * КассаККМ - СпрсвочникСсылка.КассыККМ.
//     * ТипОборудования - ПеречислениеСсылка.ТипыПодключаемогоОборудования.
//     * СтрокаОбработана - Булево.
//
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * КассыККМ - Массив.
//   * Организации - Массив.
//
Функция КассыККМИОрганизацииРМК(ТаблицаКассККМОрганизаций) Экспорт 
	
	КассыККМ = Новый Массив();
	ОрганизацииККМ = Новый Массив();
	
	Для каждого Строка Из ТаблицаКассККМОрганизаций Цикл
		Если ЗначениеЗаполнено(Строка.КассаККМ) И КассыККМ.Найти(Строка.КассаККМ) = Неопределено Тогда
			КассыККМ.Добавить(Строка.КассаККМ);
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Организация) И ОрганизацииККМ.Найти(Строка.Организация) = Неопределено Тогда
			ОрганизацииККМ.Добавить(Строка.Организация);
		КонецЕсли;
	КонецЦикла;
	
	КассыККМИОрганизации = Новый Структура();
	КассыККМИОрганизации.Вставить("КассыККМ", КассыККМ);
	КассыККМИОрганизации.Вставить("Организации", ОрганизацииККМ);
	
	Возврат КассыККМИОрганизации;
	
КонецФункции

// Обновляет табло в РМК, учитывая текущую операцию и прочие параметры.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура.
//  Элементы - ВсеЭлементыФормы.
//  СтруктураДанных - Структура.
//  НадписьИнформацияОТоваре - Строка.
//  НадписьТекущаяСумма - Строка.
//
Процедура ОбновитьТаблоНоменклатуры(Объект, Элементы, СтруктураДанных, НадписьИнформацияОТоваре, НадписьТекущаяСумма) Экспорт 
	
	ВыведеныЧеки            = СтруктураДанных.ВыведеныЧеки;
	ОставлятьФлагТаблоСдачи = СтруктураДанных.ОставлятьФлагТаблоСдачи;
	ВыведенаСдача           = СтруктураДанных.ВыведенаСдача;
	//ДисконтнаяКарта         = СтруктураДанных.ДисконтнаяКарта;
	//ВладелецДисконтнойКарты = СтруктураДанных.ВладелецДисконтнойКарты;
	
	Если ВыведеныЧеки Тогда
		Возврат;
	КонецЕсли;
	
	//ОбновитьТекстПроСкидку(ДисконтнаяКарта, ВладелецДисконтнойКарты, Элементы);
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Если Объект.Товары.Количество() > 0 Тогда
			Элементы.Товары.ТекущаяСтрока = Объект.Товары[Объект.Товары.Количество() - 1].ПолучитьИдентификатор();
			ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		НадписьИнформацияОТоваре = "";
		НадписьТекущаяСумма = "";
		
		Возврат;
	КонецЕсли;
	
	Если ОставлятьФлагТаблоСдачи Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаИнформации;
	
	ВыведенаСдача = Ложь;
	
	ИнформацияОТоваре = СокрЛП(ТекущаяСтрока.Номенклатура);
	Если ЗначениеЗаполнено(ТекущаяСтрока.ПредставлениеТабло) Тогда
		ИнформацияОТоваре = СокрЛП(ТекущаяСтрока.ПредставлениеТабло);
	КонецЕсли;
	
	//Если ТекущаяСтрока.ИспользоватьСерийныеНомера Тогда
	//	СтруктураПоиска = Новый Структура;
	//	СтруктураПоиска.Вставить("КлючСвязиСерийныхНомеров", ТекущаяСтрока.КлючСвязиСерийныхНомеров);
	//	ИнформацияОСерийныхНомерах = НСтр("ru = '№№ %1'");
	//	СерийныеНомераСтрокой = "";
	//	СтрокиСерийныхНомеров = Объект.СерийныеНомера.НайтиСтроки(СтруктураПоиска);
	//	Для каждого СтрокаСерийныхНомеров Из СтрокиСерийныхНомеров Цикл
	//		СерийныеНомераСтрокой = СерийныеНомераСтрокой +", "+СтрокаСерийныхНомеров.СерийныйНомер;
	//	КонецЦикла;
	//	Если ЗначениеЗаполнено(СерийныеНомераСтрокой)  Тогда
	//		СерийныеНомераСтрокой = Сред(СерийныеНомераСтрокой, 3);
	//	Иначе
	//		СерийныеНомераСтрокой = НСтр("ru = '?????'");
	//	КонецЕсли;
	//	ИнформацияОСерийныхНомерах = СтрШаблон(ИнформацияОСерийныхНомерах, СерийныеНомераСтрокой);
	//	ИнформацияОТоваре = ИнформацияОТоваре + " - " + ИнформацияОСерийныхНомерах;
	//КонецЕсли;
	
	ИнформацияОПродавце = НСтр("ru = '(продавец: %1)'");
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Продавец) Тогда
		ИнформацияОТоваре = ИнформацияОТоваре + " " + СтрШаблон(ИнформацияОПродавце, СокрЛП(ТекущаяСтрока.Продавец));
	КонецЕсли;
	
	НадписьИнформацияОТоваре = ИнформацияОТоваре;
	
	ИспользуемоеКоличество = ТекущаяСтрока.Количество;
	УпаковкаСтроки = СокрЛП(ТекущаяСтрока.ЕдиницаИзмерения);
	//Если ЗначениеЗаполнено(ТекущаяСтрока.Упаковка) Тогда
	//	ИспользуемоеКоличество = ТекущаяСтрока.КоличествоУпаковок;
	//	УпаковкаСтроки = СокрЛП(ТекущаяСтрока.Упаковка);
	//КонецЕсли;
	
	СуммаСтрокиТовара = ТекущаяСтрока.Цена * ИспользуемоеКоличество;
	
	НадписьТекущаяСумма = "";
	Если НЕ СуммаСтрокиТовара = 0 Тогда
		
		ПредставлениеТекущейСтроки = "%1 х %2 %3 = %4";
		
		ЦенаСтроки = ОбщийМодульКлиентСервер.ФорматСумм(ТекущаяСтрока.Цена);
		КоличествоСтроки = Формат(ИспользуемоеКоличество, "ЧН=0");
		
		СкидкаСтроки = "";
		Скидка = СуммаСтрокиТовара - ТекущаяСтрока.Сумма;
		
		Если (Скидка > 0.01 ИЛИ Скидка < -0.01) Тогда
			
			ПредставлениеТекущейСтроки = "%1 х %2 %3 %5 = %4";
			
			СкидкаСтроки = "%1 %2 (%1 %3)";
			Если Скидка > 0 Тогда
				ЗнакСкидки = "-";
				ОбщийПроцентСкидкиСтрокой = Формат(Окр(100*Скидка/СуммаСтрокиТовара, 2, 1), "ЧДЦ=2") + "%";
				СуммаСкидкиСтрокой = ОбщийМодульКлиентСервер.ФорматСумм(Скидка);
			Иначе
				ЗнакСкидки = "+";
				ОбщийПроцентСкидкиСтрокой = Формат(-1*Окр(100*Скидка/СуммаСтрокиТовара, 2, 1), "ЧДЦ=2") + "%";
				СуммаСкидкиСтрокой = ОбщийМодульКлиентСервер.ФорматСумм(-1*Скидка);
			КонецЕсли;
			
			СкидкаСтроки = СтрШаблон(СкидкаСтроки, ЗнакСкидки, СуммаСкидкиСтрокой, ОбщийПроцентСкидкиСтрокой);
			
			НадписьТекущаяСумма = СтрШаблон(ПредставлениеТекущейСтроки,
				ЦенаСтроки, КоличествоСтроки, УпаковкаСтроки, ОбщийМодульКлиентСервер.ФорматСумм(ТекущаяСтрока.Сумма), СкидкаСтроки);
		Иначе
			
			НадписьТекущаяСумма = СтрШаблон(ПредставлениеТекущейСтроки,
				ЦенаСтроки, КоличествоСтроки, УпаковкаСтроки, ОбщийМодульКлиентСервер.ФорматСумм(ТекущаяСтрока.Сумма));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет глобальную переменной НомерДокументаКассыККМ
//
// КассаККМ - СправочникСсылка.КассыККМ - кассаККМ по которой необходимо заполнить номер документа.
//
Процедура ЗаполнитьНомерДокументаКассыККМ(КассаККМ) Экспорт
	
	Если ЗначениеЗаполнено(КассаККМ) И НомерДокументаКассыККМ[КассаККМ] = Неопределено Тогда
		НомерЧекаККМ = ОбщийМодульВызовСервера.ПоследнийНомерДокументаКассыККМ(КассаККМ);
	КонецЕсли; 
	Если Не (НомерЧекаККМ <> Неопределено И НомерЧекаККМ <> 0) Тогда
		НомерЧекаККМ = 1;
	КонецЕсли; 
	НомерДокументаКассыККМ.Вставить(КассаККМ, НомерЧекаККМ);
		
КонецПроцедуры

#КонецОбласти

#Область Прочие

Процедура СкопироватьВБуферОбмена(Текст, ТекстОповещения) Экспорт
// работает только, если разрешен программный доступ к буферу обмена в IE

#Если Не ВебКлиент И Не МобильныйКлиент Тогда
	
	Попытка
		ОбъектЗапись = Новый COMОбъект("htmlfile");
		ОбъектЗапись.ParentWindow.ClipboardData.Setdata("Text", Текст);
		ПоказатьОповещениеПользователя(НСтр("ru = 'Успешно'"),
				, ТекстОповещения);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Возникла ошибка при копировании в буфер обмена.
				|Воспользуйтесь комбинацией клавиш Ctrl+C.'"));
	КонецПопытки;
	
#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область Доставка

// Актуализирует КИ из текста редактирования поля ввода.
//
// Параметры:
//		Элемент - ПолеФормы - элемент формы для ввода адреса;
//		АдресПредставление - Строка - представление адреса;
//		АдресЗначенияПолей - Строка - служебная информация, значения полей адреса.
//		ОчищатьПустоеПредставление - Булево - истина, очищать.
//
Процедура ПриИзмененииПредставленияАдреса(Элемент, АдресПредставление, АдресЗначенияПолей, ОчищатьПустоеПредставление = Истина) Экспорт
	
	Если Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
		АдресПредставление = Элемент.ТекстРедактирования;
		
		Если ОчищатьПустоеПредставление
			И АдресПредставление = "" Тогда
			ОчиститьПредставлениеАдреса(АдресПредставление, АдресЗначенияПолей);
		КонецЕсли;
		
		ОбщийМодульВызовСервера.ЗаполнитьЗначенияПолейКИПоПредставлению(АдресПредставление, АдресЗначенияПолей);
	КонецЕсли;
	
КонецПроцедуры

// Производит очистку полей КИ при очистке текста редактирования поля ввода.
//
// Параметры:
//		АдресПредставление - Строка - представление адреса.
//		АдресЗначенияПолей - Строка - служебная информация, значения полей адреса.
//
Процедура ОчиститьПредставлениеАдреса(АдресПредставление, АдресЗначенияПолей) Экспорт
	
	АдресПредставление = "";
	АдресЗначенияПолей = "";
	
КонецПроцедуры

// Заполняет реквизиты доставки из структуры в соответствии с выбранным адресом
//
// Параметры:
//  ЭлементыФормы		 - ВсеЭлементыФормы	 - элементы формы, в которой происходит выбор адреса (для получения списков выбора);
//  ДокОбъект			 - ДокументОбъект	 - объект, в котором происходит выбор адреса, реквизиты этого объекта заполняются
//  	реквизитами доставки;
//  ИмяЭлементаФормы	 - Строка			 - имя элемента формы, в котором происходит выбор адреса;
//  ВыбранноеЗначение	 - Структура		 - реквизиты доставки, соответствующая выбранному адресу.
//
Процедура АдресДоставкиОбработкаВыбора(ЭлементыФормы, ДокОбъект, ИмяЭлементаФормы, ВыбранноеЗначение) Экспорт
	
	Если ИмяЭлементаФормы = "АдресДоставки" Тогда
		ЗаполнитьЗначенияСвойств(ДокОбъект, ВыбранноеЗначение);
	КонецЕсли;
		
КонецПроцедуры

// Открывает форму ввода адреса с заполненными из параметра значениями полей адреса.
//
// Параметры:
//	Элемент - ПолеФормы - элемент формы для ввода адреса;
//	Объект - ДанныеФормыКоллекция - объект, для которого выполняется событие;
//	ИмяРеквизитаАдресаДоставки - Строка - имя реквизита;
//	СтандартнаяОбработка - Булево - Истина, признак выполнения стандартной обработки события начало выбора.
//
Процедура ОткрытьФормуВыбораАдресаИОбработатьРезультат(Элемент, Объект, ИмяРеквизитаАдресаДоставки, СтандартнаяОбработка = Ложь) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	АдресПредставление = Объект[ИмяРеквизитаАдресаДоставки];
	АдресЗначенияПолей = Объект[ИмяРеквизитаАдресаДоставки + "ЗначенияПолей"];
	//АдресЗначение = Объект[ИмяРеквизитаАдресаДоставки + "Значение"];
	
	Если Не ЗначенияПолейАдресаДоставкиВалидны(АдресЗначенияПолей) Тогда
		АдресЗначенияПолей = "";
		ОбщийМодульВызовСервера.ЗаполнитьЗначенияПолейКИПоПредставлению(АдресПредставление, АдресЗначенияПолей);
	КонецЕсли;
	
	ПриИзмененииПредставленияАдреса(Элемент, АдресПредставление, АдресЗначенияПолей, Ложь);
	
	// Откроем диалог редактирования КИ
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента"));
	ПараметрыОткрытия.Вставить("ЗначенияПолей",           ОбщийМодульКлиентСервер.ПреобразоватьСтрокуВСписокПолей(АдресЗначенияПолей));
	//ПараметрыОткрытия.Вставить("Значение",                АдресЗначение);
	ПараметрыОткрытия.Вставить("Представление",           АдресПредставление);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект",						Объект);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаАдресаДоставки", 	ИмяРеквизитаАдресаДоставки);
	ДополнительныеПараметры.Вставить("Элемент", 					Элемент);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение", 
		ОбщийМодульКлиент, ДополнительныеПараметры);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия,,Оповещение);
		
КонецПроцедуры

Процедура ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Элемент 					= ДополнительныеПараметры.Элемент;
	Объект 						= ДополнительныеПараметры.Объект;
	ИмяРеквизитаАдресаДоставки	= ДополнительныеПараметры.ИмяРеквизитаАдресаДоставки;
		
	Если ТипЗнч(Результат) = Тип("Структура") Тогда // КИ введена
		
		// Перенесем данные в форму
		Объект[ИмяРеквизитаАдресаДоставки + "ЗначенияПолей"] = Результат.КонтактнаяИнформация;
		//Объект[ИмяРеквизитаАдресаДоставки + "Значение"] = Результат.Значение;
		Объект[ИмяРеквизитаАдресаДоставки] = Результат.Представление;
		
		// Установим признак модифицированности
		Родитель = Элемент.Родитель;
		Пока ТипЗнч(Родитель) <> Тип("УправляемаяФорма") Цикл
			Родитель = Родитель.Родитель;
		КонецЦикла;
		
		Родитель.Модифицированность = Истина;
		Родитель.ОбновитьОтображениеДанных();
		
	КонецЕсли;

КонецПроцедуры

Функция ЗначенияПолейАдресаДоставкиВалидны(АдресЗначенияПолей)
	
	ЗначенияПолейВалидны = ПустаяСтрока(АдресЗначенияПолей)
		Или (СтрНачинаетсяС(АдресЗначенияПолей, "<")
		И СтрЗаканчиваетсяНа(АдресЗначенияПолей, ">"))
		Или (СтрНачинаетсяС(АдресЗначенияПолей, "{")
		И СтрЗаканчиваетсяНа(АдресЗначенияПолей, "}"));
		
	Возврат ЗначенияПолейВалидны;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРМРаботникаСклада

Функция РМРаботникаСклада_ОписаниеДействия(Действие, ИспользоватьСтатусыСборки, Сотрудник = Неопределено) Экспорт
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Действие", Действие);
	СтруктураРезультата.Вставить("ИзменитьСтатусСборки", Ложь);	
	СтруктураРезультата.Вставить("СтатусСборки", ПредопределенноеЗначение("Справочник.СтатусыСборкиЗаказов.ПустаяСсылка"));
	СтруктураРезультата.Вставить("Отгрузить", Ложь);
	СтруктураРезультата.Вставить("ДобавитьСборщика", Ложь);
	
	Если НЕ Сотрудник = Неопределено Тогда
		СтруктураРезультата.Вставить("Сотрудник", Сотрудник);
	КонецЕсли;
	
	Если Действие = "ЗаказПокупателяИзменитьСборщика" Тогда
		СтруктураРезультата.ДобавитьСборщика = Ложь;
	ИначеЕсли Действие = "ЗаказПокупателяДобавитьСборщика" Тогда
		СтруктураРезультата.ДобавитьСборщика = Истина;
	ИначеЕсли Действие = "ЗаказПокупателяИдетСборка" Тогда
		СтруктураРезультата.ДобавитьСборщика = Истина;
		СтруктураРезультата.ИзменитьСтатусСборки = Истина;
		СтруктураРезультата.СтатусСборки = ПредопределенноеЗначение("Справочник.СтатусыСборкиЗаказов.ИдетСборка");
		
	ИначеЕсли Действие = "ЗаказПокупателяСобранПолностью" Тогда
		СтруктураРезультата.ДобавитьСборщика = Истина;
		СтруктураРезультата.ИзменитьСтатусСборки = Истина;
		СтруктураРезультата.СтатусСборки = ПредопределенноеЗначение("Справочник.СтатусыСборкиЗаказов.СобранПолностью");
		
	ИначеЕсли Действие = "ЗаказПокупателяСобранЧастично" Тогда 
		СтруктураРезультата.ДобавитьСборщика = Истина;
		СтруктураРезультата.ИзменитьСтатусСборки = Истина;
		СтруктураРезультата.СтатусСборки = ПредопределенноеЗначение("Справочник.СтатусыСборкиЗаказов.СобранЧастично");
		
	//#14607
	ИначеЕсли Действие = "ЗаказПокупателяСобранПолностьюОтгрузить" Тогда
		СтруктураРезультата.Отгрузить = Истина;
		СтруктураРезультата.ДобавитьСборщика = Истина;
		
		Если ИспользоватьСтатусыСборки Тогда
			СтруктураРезультата.ИзменитьСтатусСборки = Истина;
			СтруктураРезультата.СтатусСборки = ПредопределенноеЗначение("Справочник.СтатусыСборкиЗаказов.СобранПолностью");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

#КонецОбласти

#Область ЗаписьОбъектов

// Записать объект и замерить длительность его записи.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма в которой выполняется вызов этой функции.
//  ЕстьВопросыПередЗаписью - Булево - Истина, если при записи могут отображаться вопросы пользователю.
//  ДействиеПослеЗаписи - ОписаниеОповещения - обработчик, выполняемый после записи объекта.
//
Процедура Записать(Форма, ЕстьВопросыПередЗаписью = Ложь, ДействиеПослеЗаписи = Неопределено) Экспорт
	
	ПараметрыЗаписи = СтруктураПараметровЗаписиОбъекта();
	ПараметрыЗаписи.ЕстьВопросыПередЗаписью = ЕстьВопросыПередЗаписью;
	
	Если ДействиеПослеЗаписи <> Неопределено Тогда
		ПараметрыЗаписи.Вставить("ДействиеПослеЗаписи", ДействиеПослеЗаписи);
	КонецЕсли;
	
	ЗаписатьОбъект(Форма, ПараметрыЗаписи);
	
КонецПроцедуры

// Записать объект, замерить длительность его записи и закрыть форму объекта.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма в которой выполняется вызов этой функции.
//  ЕстьВопросыПередЗаписью - Булево - Истина, если при записи могут отображаться вопросы пользователю.
//  ДействиеПослеЗаписи - ОписаниеОповещения - обработчик, выполняемый после записи объекта.
//
Процедура ЗаписатьИЗакрыть(Форма, ЕстьВопросыПередЗаписью = Ложь, ДействиеПослеЗаписи = Неопределено) Экспорт
	
	ПараметрыЗаписи = СтруктураПараметровЗаписиОбъекта();
	ПараметрыЗаписи.ЕстьВопросыПередЗаписью = ЕстьВопросыПередЗаписью;
	
	Если ДействиеПослеЗаписи <> Неопределено Тогда
		ПараметрыЗаписи.Вставить("ДействиеПослеЗаписи", ДействиеПослеЗаписи);
	КонецЕсли;
	
	ЗаписатьОбъектИЗакрыть(Форма, ПараметрыЗаписи);
	
КонецПроцедуры

// Провести документ и замерить длительность его проведения.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма в которой выполняется вызов этой функции.
//  ЕстьВопросыПередЗаписью - Булево - Истина, если при записи могут отображаться вопросы пользователю.
//  ДействиеПослеЗаписи - ОписаниеОповещения - обработчик, выполняемый после записи объекта.
//
Процедура Провести(Форма, ЕстьВопросыПередЗаписью = Ложь, ДействиеПослеЗаписи = Неопределено) Экспорт
	
	ПараметрыЗаписи = СтруктураПараметровЗаписиОбъекта();
	ПараметрыЗаписи.ЕстьВопросыПередЗаписью = ЕстьВопросыПередЗаписью;
	ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;
	
	Если ДействиеПослеЗаписи <> Неопределено Тогда
		ПараметрыЗаписи.Вставить("ДействиеПослеЗаписи", ДействиеПослеЗаписи);
	КонецЕсли;
	
	ЗаписатьОбъект(Форма, ПараметрыЗаписи);
	
КонецПроцедуры

// Провести документ, замерить длительность его проведения и закрыть форму документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма в которой выполняется вызов этой функции.
//  ЕстьВопросыПередЗаписью - Булево - Истина, если при проведении могут отображаться вопросы пользователю.
//  ДействиеПослеЗаписи - ОписаниеОповещения - обработчик, выполняемый после записи объекта.
//
Процедура ПровестиИЗакрыть(Форма, ЕстьВопросыПередЗаписью = Ложь, ДействиеПослеЗаписи = Неопределено) Экспорт
	
	ПараметрыЗаписи = СтруктураПараметровЗаписиОбъекта();
	ПараметрыЗаписи.ЕстьВопросыПередЗаписью = ЕстьВопросыПередЗаписью;
	ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;
	
	Если ДействиеПослеЗаписи <> Неопределено Тогда
		ПараметрыЗаписи.Вставить("ДействиеПослеЗаписи", ДействиеПослеЗаписи);
	КонецЕсли;
	
	ЗаписатьОбъектИЗакрыть(Форма, ПараметрыЗаписи);
	
КонецПроцедуры

// Выполняет запись документа в форме
//
// Параметры:
//  Форма - РасширениеУправляемойФормыДляОбъектов - Форма документа в которой выполняется вызов этой функции:
//  	* Объект - ДокументОбъект -
//	ПараметрыЗаписи - Структура - 
//
Функция ЗаписатьОбъект(Форма, ПараметрыЗаписи)
	
	Перем Проведен, ДействиеПослеЗаписи;
	
	ОчиститьСообщения();
	
	Если Не ПараметрыЗаписи.ЕстьВопросыПередЗаписью Тогда
		Если Не Форма.Объект.Свойство("Проведен", Проведен) Тогда
			Проведен =  Ложь;
		КонецЕсли;
		
		Если Проведен И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ДействиеПослеЗаписи", ДействиеПослеЗаписи) Тогда
		ПараметрыЗаписи.Удалить("ДействиеПослеЗаписи");
	КонецЕсли;
	
	Результат = Форма.Записать(ПараметрыЗаписи);
	
	Если ДействиеПослеЗаписи <> Неопределено Тогда
		Если Результат Тогда
			ВыполнитьОбработкуОповещения(ДействиеПослеЗаписи, Результат);
		КонецЕсли;
		
		ПараметрыЗаписи.Вставить("ДействиеПослеЗаписи", ДействиеПослеЗаписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Выполняет запись документа в форме
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма документа в которой выполняется вызов этой функции:
//  	* Объект - ДокументОбъект -
//	ПараметрыЗаписи - Структура - 
//
Процедура ЗаписатьОбъектИЗакрыть(Форма, ПараметрыЗаписи)
	
	ПараметрыЗаписи.ПринудительноЗакрытьФорму = Истина;
	ОчиститьСообщения();
	
	Если ПараметрыЗаписи.ЕстьВопросыПередЗаписью Тогда
		ПараметрыЗаписи.НовыйОбъект = Не ЗначениеЗаполнено(Форма.Объект.Ссылка);
		Форма.ПринудительноЗакрытьФорму = ПараметрыЗаписи.ПринудительноЗакрытьФорму;
		Форма.Записать(ПараметрыЗаписи);
	Иначе
		Если ЗаписатьОбъект(Форма, ПараметрыЗаписи) Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ЕстьВопросыПослеЗаписи") 
				И Форма.ЕстьВопросыПослеЗаписи Тогда
				// закрытие формы будет осуществлять сама форма
				Возврат;
			КонецЕсли;
			Форма.Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция СтруктураПараметровЗаписиОбъекта()
	
	ПараметрыЗаписи = Новый Структура;
	
	ПараметрыЗаписи.Вставить("ЕстьВопросыПередЗаписью", Ложь);
	//ПараметрыЗаписи.Вставить("ЕстьВопросыПослеЗаписи", Ложь);
	ПараметрыЗаписи.Вставить("НовыйОбъект", Ложь);
	ПараметрыЗаписи.Вставить("ПринудительноЗакрытьФорму", Ложь);
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	ПараметрыЗаписи.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный);
	
	Возврат ПараметрыЗаписи;
	
КонецФункции

Процедура ЗаписатьОбъектПриНеобходимости(Форма, ПараметрыЗаписи, Отказ = Ложь, ПроверкиПройдены = Ложь) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ПараметрыДляЗаписи   = ПараметрыЗаписи;
	НеобходимаОтложеннаяЗапись = ПараметрыЗаписи.Свойство("ДействиеПослеЗаписи");
	Если НеобходимаОтложеннаяЗапись Или ПроверкиПройдены Тогда
		Отказ = Истина;
		Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбработатьЗаписьОбъекта", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
// 	Форма - РасширениеУправляемойФормыДляОбъектов - Форма документа:
// 		* Объект - ДокументОбъект - 
// 	ПараметрыЗаписи - Структура - 
// 	Отказ - Булево - Описание
// Возвращаемое значение:
// 	Булево - Описание
Функция ОбработатьЗаписьОбъектаВФорме(Форма, ПараметрыЗаписи, Отказ = Ложь) Экспорт
	
	ДействиеПослеЗаписи = Неопределено;
	Если ПараметрыЗаписи.Свойство("ДействиеПослеЗаписи", ДействиеПослеЗаписи) Тогда
		ПараметрыЗаписи.Удалить("ДействиеПослеЗаписи");
	КонецЕсли;
	
	Результат = Ложь;
	
	Если Отказ Тогда
		Возврат Результат;
	КонецЕсли;

	Форма.НеВыполнятьПроверкуПередЗаписью = Истина;
	
	Отказ = Истина;
	ПараметрыЗаписи.Вставить("ПринудительноЗакрытьФорму", Форма.ПринудительноЗакрытьФорму);
	ПараметрыЗаписи.Вставить("НовыйОбъект", Не ЗначениеЗаполнено(Форма.Объект.Ссылка));
	Результат = Форма.Записать(ПараметрыЗаписи);
	
	Форма.ПринудительноЗакрытьФорму = Ложь;
	Форма.НеВыполнятьПроверкуПередЗаписью = Ложь;
	
	Если Результат И ДействиеПослеЗаписи <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДействиеПослеЗаписи, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Описание
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа:
// 		* Объект - ДокументОбъект -
// 	Объект - ДокументОбъект - 
// 	ПараметрыЗаписи  - Структура - 
Процедура ВыполнитьДействияПослеЗаписи(Форма, Объект, ПараметрыЗаписи) Экспорт
	
	Если Не ПараметрыЗаписи.Свойство("НовыйОбъект") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.НовыйОбъект Тогда
		ТекстЗаголовка = НСтр("ru='Создание:'");
	Иначе
		ТекстЗаголовка = НСтр("ru='Изменение:'");
	КонецЕсли;
	ОповеститьПользователяОбИзмененииОбъекта(Объект.Ссылка, ТекстЗаголовка);
	
	Если Форма.ПринудительноЗакрытьФорму Тогда
		Форма.ПодключитьОбработчикОжидания("Подключаемый_ЗакрытьФорму", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура оповещение и записывает в историю пользователя изменение объекта, как делает платформа.
//
// Параметры:
//	СсылкаНаОбъект       - ЛюбаяСсылка - измененный объект.
//	ТекстЗаголовка - Строка - Текст заголовка
Процедура ОповеститьПользователяОбИзмененииОбъекта(СсылкаНаОбъект, ТекстЗаголовка = "") Экспорт
	
	Если ПустаяСтрока(ТекстЗаголовка) Тогда	
		ТекстЗаголовка = НСтр("ru='Изменение:'");
	КонецЕсли;
	ТекстСообщения = Строка(СсылкаНаОбъект);
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект);
	ПоказатьОповещениеПользователя(ТекстЗаголовка, НавигационнаяСсылка, ТекстСообщения, БиблиотекаКартинок.Информация32);

	ИсторияРаботыПользователя.Добавить(НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьИзменениеМенеджера(Форма) Экспорт
	
	Если Форма.ИзмененМенеджер Тогда
		ПоказатьОповещениеПользователя("Изменен менеджер", , "Изменен менеджер документа на сотрудника текущего пользователя");
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//
Функция ПроверитьДоступностиРасширенногоФункционала() Экспорт
	
	Доступен = ОбщийМодуль.РасширенныйФункционалДоступен();
	
	Если Доступен Тогда
		Возврат Истина;
	Иначе
		ОткрытьФорму("ОбщаяФорма.ФормаТехническаяПоддержка",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Процедура проверяет возможность заполнения табличной части "Распределение" в документах расхода по кнопке Подбор по остаткам.
//
// Параметры:
//	ВозможноЗаполнениеТабличнойЧасти - ОписаниеОповещения - оповещение о возможности заполнения табличной части
//	Форма - УправляемаяФорма - Форма документа
//	ТабличнаяЧасть - ДанныеФормыКоллекция - Проверяемая табличная часть
//	СтруктураРеквизитов - Структура - Проверяемые реквизиты
//	ПроверятьПроведенность - Булево - Необходимость проверки того, что документ не проведен.
//
Процедура ПроверитьВозможностьПодбораЗаказовВДокументРасхода(ВозможноЗаполнениеТабличнойЧасти, Форма, ТабличнаяЧасть, ПроверятьПроведенность = Истина, НазваниеТабличнойЧасти = "") Экспорт 
	
	Отказ = Ложь;
	ОчиститьСообщения();
		
	Если Не ЗначениеЗаполнено(Форма.Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Организация"" не заполнено",, "Организация", "Объект", Отказ);			
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Форма.Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Контрагент"" не заполнено",, "Контрагент", "Объект", Отказ);			
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если (ПроверятьПроведенность И Форма.Объект.Проведен)
		ИЛИ (ТабличнаяЧасть.Количество() > 0)  Тогда
		
		Если ПроверятьПроведенность 
			И Форма.Объект.Проведен 
			И (ТабличнаяЧасть.Количество() = 0) Тогда
			ТекстВопроса = НСтр("ru = 'Заполнение %1 возможно только в непроведенном документе, отменить проведение?'");
		ИначеЕсли ТабличнаяЧасть.Количество() > 0
			И (НЕ ПроверятьПроведенность 
			ИЛИ НЕ Форма.Объект.Проведен) Тогда
			ТекстВопроса = НСтр("ru = 'Табличная часть %1 будет очищена, продолжить?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Заполнение %1 возможно только в непроведенном документе.
				|Табличная часть будет очищена. Очистить и отменить проведение?'");
		КонецЕсли;
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, НазваниеТабличнойЧасти);
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "  ", " ");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВозможноЗаполнениеТабличнойЧасти", ВозможноЗаполнениеТабличнойЧасти);
		ДополнительныеПараметры.Вставить("ПроверятьПроведенность", ПроверятьПроведенность);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьВозможностьПодбораЗаказовВДокументРасходаПослеВопроса", ЭтотОбъект, ДополнительныеПараметры), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ВозможноЗаполнениеТабличнойЧасти, Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроверитьВозможностьПодбораЗаказовВДокументРасходаПослеВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВозможноЗаполнениеТабличнойЧасти = ДополнительныеПараметры.ВозможноЗаполнениеТабличнойЧасти;
	ПроверятьПроведенность = ДополнительныеПараметры.ПроверятьПроведенность;
	Форма = ДополнительныеПараметры.Форма;
	
	КодОтвета = РезультатВопроса;
	Если КодОтвета = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверятьПроведенность И Форма.Объект.Проведен Тогда
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
		Если Не Форма.Записать(ПараметрыЗаписи) Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Не удалось отменить проведение документа'"));
			Возврат;
		КонецЕсли;
			
	КонецЕсли;
		
	ВыполнитьОбработкуОповещения(ВозможноЗаполнениеТабличнойЧасти, Истина);

КонецПроцедуры

#Область РучнаяКорректировкаВыработки

Процедура РучнаяКорректировкаВыработкиПриИзменении(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	// Если галочку сняли и объект проведен, нужно записать объект, чтобы выработка в регистре была автоматический начисленная
	Если НЕ Объект.РучнаяКорректировкаВыработки И Объект.Проведен Тогда
		Объект.РучнаяКорректировкаВыработки = Истина;
		ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОЗаписиДокументаРучнаяКорректировка", ОбщийМодульКлиент, новый Структура("Форма, Объект", Форма, Объект)), "При продолжении документ будет записан, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбщийМодульВызовСервера.РучнаяКорректировкаВыработкиПриИзмененииНаСервере(Объект);
		КопироватьДанныеФормы(Объект, Форма.Объект);
		Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.Лид") Тогда
			Форма.ОбновитьЭлементыФормыНаСервере();
		ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") 
			ИЛИ ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
			Форма.ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог();
		Иначе	
			Форма.ОбновитьДанныеДокумента();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВопросаОЗаписиДокументаРучнаяКорректировка(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Форма = ДопПараметры.Форма;
		Объект = ДопПараметры.Объект;
		
		Попытка
			Объект.РучнаяКорректировкаВыработки = Ложь;
			Форма.Записать(новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
			ОбщийМодульВызовСервера.РучнаяКорректировкаВыработкиПриИзмененииНаСервере(Объект);
			КопироватьДанныеФормы(Объект, Форма.Объект);
			Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.Лид") Тогда
				Форма.ОбновитьЭлементыФормыНаСервере();
			ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя")
				ИЛИ ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
				Форма.ОпределитьВидимостьТаблицыВыработкиИРассчитатьИтог();
			Иначе	
				Форма.ОбновитьДанныеДокумента();
			КонецЕсли;
		Исключение
			Объект.РучнаяКорректировкаВыработки = Истина;
			ПоказатьПредупреждение(, "Не удалось записать документ: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДанныеВыбораВидаИсполнителя(ВидДокументаРасчета, ДанныеВыбора, Текст="", СтандартнаяОбработка) Экспорт

	Если ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ВыпускПродукции") Тогда		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		СформироватьДанныеВыбораВидаИсполнителяПоВыпуску(ДанныеВыбора);
	ИначеЕсли ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.ЗаказПокупателя") Тогда		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		СформироватьДанныеВыбораВидаИсполнителяПоЗаказуПокупателя(ДанныеВыбора);
	ИначеЕсли ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Лид") Тогда		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		СформироватьДанныеВыбораВидаИсполнителяПоЛиду(ДанныеВыбора);
	ИначеЕсли ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Монтаж") 
		//ИЛИ ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Рекламация")
		//ИЛИ ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.СервиснаяЗаявка")
		Тогда		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		СформироватьДанныеВыбораВидаИсполнителяПоМонтажу(ДанныеВыбора);
	//ИначеЕсли ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.Продажа") Тогда		
	//	СтандартнаяОбработка = Ложь;
	//	ДанныеВыбора = Новый СписокЗначений;
	//	СформироватьДанныеВыбораВидаИсполнителяПоМонтажуПродаже(ДанныеВыбора);
	ИначеЕсли ВидДокументаРасчета = ПредопределенноеЗначение("Справочник.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг") Тогда		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		СформироватьДанныеВыбораВидаИсполнителяПоРеализации(ДанныеВыбора);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДанныеВыбораВидаИсполнителяПоВыпуску(ДанныеВыбора, Текст="")
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.Менеджер"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.Менеджер"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерКонтрагента"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерКонтрагента"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЗаказеПокупателя"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЗаказеПокупателя"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.СотрудникПроизводства"));	
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.СотрудникПроизводства"), ПредставлениеЭлемента);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДанныеВыбораВидаИсполнителяПоЗаказуПокупателя(ДанныеВыбора, Текст="")
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерКонтрагента"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерКонтрагента"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЗаказеПокупателя"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЗаказеПокупателя"), ПредставлениеЭлемента);
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьДанныеВыбораВидаИсполнителяПоЛиду(ДанныеВыбора, Текст="")
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЛиде"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЛиде"), ПредставлениеЭлемента);
	КонецЕсли;
	
	//#13943
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерВЛиде"));	
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерВЛиде"), ПредставлениеЭлемента);
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьДанныеВыбораВидаИсполнителяПоМонтажу(ДанныеВыбора, Текст="")
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.Бригадир"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.Бригадир"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.ЗамерщикЗаказДоговора"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.ЗамерщикЗаказДоговора"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерЗаказДоговора"));	
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерЗаказДоговора"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерКонтрагента"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерКонтрагента"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.Монтажник"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.Монтажник"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.НазначилЗамерВЛиде"));	
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.НазначилЗамерВЛиде"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВМонтаже"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВМонтаже"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЗаказДоговоре"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЗаказДоговоре"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЛиде"));	
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЛиде"), ПредставлениеЭлемента);
	КонецЕсли;
	
	//#13943
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерВЛиде"));	
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерВЛиде"), ПредставлениеЭлемента);
	КонецЕсли;
	
	//#16755 
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.ОтветственныйВЛиде"));	
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.ОтветственныйВЛиде"), ПредставлениеЭлемента);
	КонецЕсли;
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.ЗамерщикВЛиде"));	
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.ЗамерщикВЛиде"), ПредставлениеЭлемента);
	КонецЕсли;
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.ТехнологВЛиде"));	
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.ТехнологВЛиде"), ПредставлениеЭлемента);
	КонецЕсли;

КонецПроцедуры

//Процедура СформироватьДанныеВыбораВидаИсполнителяПоМонтажуПродаже(ДанныеВыбора, Текст="")
//	
//	//ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.Бригадир"));
//	//Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
//	//	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.Бригадир"), ПредставлениеЭлемента);
//	//КонецЕсли;
//	
//	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.ЗамерщикЗаказДоговора"));
//	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
//		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.ЗамерщикЗаказДоговора"), ПредставлениеЭлемента);
//	КонецЕсли;
//	
//	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерЗаказДоговора"));	
//	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
//		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерЗаказДоговора"), ПредставлениеЭлемента);
//	КонецЕсли;
//	
//	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерКонтрагента"));
//	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
//		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерКонтрагента"), ПредставлениеЭлемента);
//	КонецЕсли;
//	
//	//ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.Монтажник"));
//	//Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
//	//	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.Монтажник"), ПредставлениеЭлемента);
//	//КонецЕсли;
//	
//	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.НазначилЗамерВЛиде"));	
//	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
//		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.НазначилЗамерВЛиде"), ПредставлениеЭлемента);
//	КонецЕсли;
//	
//	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВМонтаже"));
//	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
//		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВМонтаже"), ПредставлениеЭлемента);
//	КонецЕсли;
//	
//	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЗаказДоговоре"));
//	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
//		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЗаказДоговоре"), ПредставлениеЭлемента);
//	КонецЕсли;
//	
//	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЛиде"));	
//	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
//		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЛиде"), ПредставлениеЭлемента);
//	КонецЕсли;
//	
//	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерВЛиде"));	
//	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
//		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерВЛиде"), ПредставлениеЭлемента);
//	КонецЕсли;
//	
//КонецПроцедуры

Процедура СформироватьДанныеВыбораВидаИсполнителяПоРеализации(ДанныеВыбора, Текст="")
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерКонтрагента"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерКонтрагента"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЗаказеПокупателя"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВЗаказеПокупателя"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВРеализации"));
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.АвторВРеализации"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерВЗаказеПокупателя"));	
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерВЗаказеПокупателя"), ПредставлениеЭлемента);
	КонецЕсли;
	
	ПредставлениеЭлемента = Строка(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерВРеализации"));	
	Если ПустаяСтрока(Текст) ИЛИ СтрНайти(ВРег(ПредставлениеЭлемента), ВРег(Текст)) Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыИсполнителей.МенеджерВРеализации"), ПредставлениеЭлемента);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыработкаВыбор(Элемент, Поле, СтандартнаяОбработка) Экспорт
	
	Если Поле.Имя = "ВыработкаДокументУСВ" Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументУСВ) Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.ДокументУСВ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыработкаПлановаяВыбор(Элемент, Поле, СтандартнаяОбработка) Экспорт
	
	Если Поле.Имя = "ВыработкаПлановаяДокументУСВ" Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументУСВ) Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.ДокументУСВ);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьСписокКомнатПоДереву(Дерево, ИсключитьКомнату = Неопределено) Экспорт
	
	СписокКомнат = Новый СписокЗначений;
	
	СтрокиДерева = Дерево.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СписокКомнат.НайтиПоЗначению(СтрокаДерева.Комната) = Неопределено И НЕ СтрокаДерева.Комната = ИсключитьКомнату Тогда
			СписокКомнат.Добавить(СтрокаДерева.Комната);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокКомнат;
	
КонецФункции

#Область ГрафикЗамеровИМонтажей

Процедура ПриИзмененииДатыНачалаГрафика(Форма) Экспорт
	
	Если Форма.ИмяФормы = "Документ.Монтаж.Форма.ФормаДокумента" Тогда
		Объект = Форма;
	Иначе
		Объект = Форма.Отчет;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
			 Объект.ДатаОкончания = Объект.ДатаНачала;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	ОбновитьСостояниеКнопокИнтервалаПриИзмененииДат(ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ПриИзмененииДатыОкончанияГрафика(Форма) Экспорт
	
	Если Форма.ИмяФормы = "Документ.Монтаж.Форма.ФормаДокумента" Тогда
		Объект = Форма;
	Иначе
		Объект = Форма.Отчет;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
			 Объект.ДатаНачала = Объект.ДатаОкончания;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	ОбновитьСостояниеКнопокИнтервалаПриИзмененииДат(ДополнительныеПараметры);
	
КонецПроцедуры
	
Процедура ПоказатьДиалогВыбораПериода(Форма, ОписаниеОповещенияПослеВыбораПериода) Экспорт
	
	//#8387	
	Элементы = Форма.Элементы;
	
	//++ №10185
	Если Форма.ИмяФормы = "Документ.Монтаж.Форма.ФормаДокумента" Тогда
		Отчет = Форма;
	Иначе
	//-- №10185
		Отчет = Форма.Отчет;
	КонецЕсли;
	
    Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Если Элементы.УстановитьДень.Пометка Тогда
		Диалог.Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня);
	ИначеЕсли Элементы.УстановитьНеделя.Пометка Тогда
		Диалог.Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтаНеделя);
	ИначеЕсли Элементы.УстановитьМесяц.Пометка Тогда
		Диалог.Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);
	Иначе
    	Диалог.Период = Новый СтандартныйПериод(Отчет.ДатаНачала, Отчет.ДатаОкончания);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияПослеВыбораПериода", ОписаниеОповещенияПослеВыбораПериода);
	ДополнительныеПараметры.Вставить("Форма", Форма);
    ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект, ДополнительныеПараметры);
    Диалог.Показать(ОписаниеОповещения);

КонецПроцедуры

Процедура ВыбратьПериодЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы = ДополнительныеПараметры.Форма.Элементы;
	
	//++ №10185
	Если ДополнительныеПараметры.Форма.ИмяФормы = "Документ.Монтаж.Форма.ФормаДокумента" Тогда
		Отчет = ДополнительныеПараметры.Форма;
	Иначе
	//-- №10185
		Отчет = ДополнительныеПараметры.Форма.Отчет;
	КонецЕсли;
	
	Если Результат <> Неопределено Тогда
        Отчет.ДатаНачала    = Результат.ДатаНачала;
        Отчет.ДатаОкончания = Результат.ДатаОкончания;
	КонецЕсли;
	ОбновитьСостояниеКнопокИнтервалаПриИзмененииДат(ДополнительныеПараметры);
	
	//ДатаИнтервалаПриИзменении();
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияПослеВыбораПериода);
	
КонецПроцедуры
	
Процедура ОбновитьСостояниеКнопокИнтервалаПриИзмененииДат(ДополнительныеПараметры)
	
	Элементы = ДополнительныеПараметры.Форма.Элементы;
	
	//++ №10185
	Если ДополнительныеПараметры.Форма.ИмяФормы = "Документ.Монтаж.Форма.ФормаДокумента" Тогда
		Отчет = ДополнительныеПараметры.Форма;
	Иначе
	//-- №10185
		Отчет = ДополнительныеПараметры.Форма.Отчет;
	КонецЕсли;
	
	//#8387
	СнятьПометкиКнопокИнтервалаГрафика(Элементы);
	Если НачалоДня(Отчет.ДатаНачала) = НачалоДня(Отчет.ДатаОкончания) Тогда
		Элементы.УстановитьДень.Пометка = Истина;
		
	ИначеЕсли НачалоДня(Отчет.ДатаОкончания) = НачалоДня(Отчет.ДатаНачала + 60*60*24*6) Тогда
		Элементы.УстановитьНеделя.Пометка = Истина;
		
	ИначеЕсли НачалоДня(Отчет.ДатаОкончания) = НачалоДня(ДобавитьМесяц(Отчет.ДатаНачала, 1) - 86400) Тогда
		Элементы.УстановитьМесяц.Пометка = Истина;
		
	КонецЕсли;
	
	ОбновитьДоступностьКнопокСдвигаПриИзмененииДат(ДополнительныеПараметры);
	
КонецПроцедуры

Процедура СнятьПометкиКнопокИнтервалаГрафика(Элементы) Экспорт
	
	//#8387	
	Элементы.УстановитьДень.Пометка = Ложь;  
	Элементы.УстановитьНеделя.Пометка = Ложь; 
	Элементы.УстановитьМесяц.Пометка = Ложь;  

КонецПроцедуры
	
Процедура ОбновитьДоступностьКнопокСдвигаПриИзмененииДат(ДополнительныеПараметры)
	
	Элементы = ДополнительныеПараметры.Форма.Элементы;

	ДоступностьКнопокСдвига = Элементы.УстановитьДень.Пометка ИЛИ Элементы.УстановитьНеделя.Пометка ИЛИ Элементы.УстановитьМесяц.Пометка;
	Элементы.СдвинутьИнтервалВлево.Доступность  = ДоступностьКнопокСдвига;
	Элементы.СдвинутьИнтервалВправо.Доступность = ДоступностьКнопокСдвига;

КонецПроцедуры

Процедура СдвинутьДатуГрафика(Форма, Знак=1, ОписаниеОповещенияПослеВыбораПериода) Экспорт
	
	//#8387
	
	Элементы = Форма.Элементы;
	
	//++ №10185
	Если Форма.ИмяФормы = "Документ.Монтаж.Форма.ФормаДокумента" Тогда
		Отчет = Форма;
	Иначе
	//-- №10185
		Отчет = Форма.Отчет;
	КонецЕсли;
	
	Если Элементы.УстановитьДень.Пометка Тогда
		Отчет.ДатаНачала 	= Отчет.ДатаНачала + Знак*86400;
		Отчет.ДатаОкончания = Отчет.ДатаНачала;
		
	ИначеЕсли Элементы.УстановитьНеделя.Пометка Тогда
		Отчет.ДатаНачала 	= Отчет.ДатаНачала + Знак*86400*7;
		Отчет.ДатаОкончания = Отчет.ДатаОкончания + Знак*86400*7;
		
	ИначеЕсли Элементы.УстановитьМесяц.Пометка Тогда
		Отчет.ДатаНачала 	= ДобавитьМесяц(Отчет.ДатаНачала, Знак);
		Отчет.ДатаОкончания = ДобавитьМесяц(Отчет.ДатаОкончания, Знак);
		
	КонецЕсли;
	
	//ДатаИнтервалаПриИзменении();
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияПослеВыбораПериода);
		
КонецПроцедуры

Процедура УстановитьПериодГрафикаДень(Форма, ОписаниеОповещенияПриИзмененииДатИнтервала=Неопределено, СброситьДаты = Истина) Экспорт
	
	//++ №10185
	Если Форма.ИмяФормы = "Документ.Монтаж.Форма.ФормаДокумента" Тогда
		Отчет = Форма;
	Иначе
	//-- №10185
		Отчет = Форма.Отчет;
	КонецЕсли;
		
	Элементы = Форма.Элементы;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	Если СброситьДаты Тогда
		Отчет.ДатаНачала = ТекущаяДата();
		Отчет.ДатаОкончания = ТекущаяДата();
	КонецЕсли;
	
	СнятьПометкиКнопокИнтервалаГрафика(Элементы);  	//#8387
	Элементы.УстановитьДень.Пометка = Истина;  				//#8387
	ОбновитьДоступностьКнопокСдвигаПриИзмененииДат(ДополнительныеПараметры);
	
	Если НЕ ОписаниеОповещенияПриИзмененииДатИнтервала = Неопределено Тогда	
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияПриИзмененииДатИнтервала);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПериодГрафикаНеделя(Форма, ОписаниеОповещенияПриИзмененииДатИнтервала) Экспорт
	
	//++ №10185
	Если Форма.ИмяФормы = "Документ.Монтаж.Форма.ФормаДокумента" Тогда
		Отчет = Форма;
	Иначе
	//-- №10185
		Отчет = Форма.Отчет;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	Отчет.ДатаНачала = ТекущаяДата();
	Отчет.ДатаОкончания = ТекущаяДата() + 60*60*24*6;
	
	СнятьПометкиКнопокИнтервалаГрафика(Элементы);  	//#8387
	Элементы.УстановитьНеделя.Пометка = Истина;  			//#8387
	ОбновитьДоступностьКнопокСдвигаПриИзмененииДат(ДополнительныеПараметры);
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияПриИзмененииДатИнтервала);
	
КонецПроцедуры

Процедура УстановитьПериодГрафикаМесяц(Форма, ОписаниеОповещенияПриИзмененииДатИнтервала) Экспорт
	
	//++ №10185
	Если Форма.ИмяФормы = "Документ.Монтаж.Форма.ФормаДокумента" Тогда
		Отчет = Форма;
	Иначе
	//-- №10185
		Отчет = Форма.Отчет;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	Отчет.ДатаНачала = ТекущаяДата();
	Отчет.ДатаОкончания = ДобавитьМесяц(ТекущаяДата(), 1) - 86400;
	
	СнятьПометкиКнопокИнтервалаГрафика(Элементы);  	//#8387
	Элементы.УстановитьМесяц.Пометка = Истина;  			//#8387
	ОбновитьДоступностьКнопокСдвигаПриИзмененииДат(ДополнительныеПараметры);
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияПриИзмененииДатИнтервала);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииФормированияКомандныхПанелейФорм

// Результат - ДокументСсылка, из формы которого производится запуск команды
// ДополнительныеПараметры - Структура
Процедура ВыполнитьОбработкуОбновления(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ОбработкаОбязательныхОбъектов", Неопределено);
	
	ВыборочныеОбъектыКОбработке = ОбщийМодульВызовСервера.ПолучитьДанныеИзРегистровОбработкиОбновления(Результат);
	
	//++ №11768 для версии 2.8.0.$a производится ручная обработка
	ПроверочнаяВерсия = "2.8.0.$a";
	Если ЕстьОбъектыКОбработкеВерсии(ПроверочнаяВерсия, ВыборочныеОбъектыКОбработке) Тогда
		
		ВыполнитьОбработку_2_8_0_Sa(ПроверочнаяВерсия, 0, Результат, ДополнительныеПараметры);
		Возврат;
		
	КонецЕсли;
	//-- №11768
		
	ПараметрыОбработки.Вставить("ВыборочнаяОбработка", Истина);
	ПараметрыОбработки.Вставить("ВыборочныеОбъектыКОбработке", ВыборочныеОбъектыКОбработке);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОбработкуОбновленияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.ОбработкаДокументовПослеОбновления", ПараметрыОбработки, ДополнительныеПараметры.Форма, , , , ОписаниеОповещения);
	
КонецПроцедуры

Процедура ВыполнитьОбработкуОбновленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		ДополнительныеПараметры.Форма.Прочитать();
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДополнительныеПараметры.Форма, "ТребуетсяВыводКомандыОбработкиОбновления") Тогда
			ДополнительныеПараметры.Форма.ТребуетсяВыводКомандыОбработкиОбновления = 
				ОбщийМодульВызовСервера.ТребуетсяВыводКомандыПодключеннойКОбъекту(ДополнительныеПараметры.Источник.Ссылка, ДополнительныеПараметры.ОписаниеКоманды);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСАдресами

//++ №10663 перенесено из формы лида, чтобы использовать в других формах
Процедура ОбработкаСобытияАдресОбработкаВыбора(Форма, ОбъектАдрес, ОбъектИдентификаторУлицы, РеквизитВремАдрес, ЭлементАдрес, ИмяОбработчикаОжидания, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Если НЕ ВыбранноеЗначение.Свойство("ЭтоДом") Тогда
			//выбрали улицу
			ОбъектИдентификаторУлицы = ВыбранноеЗначение.Идентификатор;
			ОбъектАдрес = Строка(ВыбранноеЗначение.Представление);
			ЭлементАдрес.ОбновитьТекстРедактирования();
			Форма.ПодключитьОбработчикОжидания(ИмяОбработчикаОжидания, 0.1, Истина);
			РеквизитВремАдрес = ОбъектАдрес;
		Иначе
			//выбрали дом 
			ОбъектАдрес = РеквизитВремАдрес + ", " + ВыбранноеЗначение.Представление + ", квартира ";
			ЭлементАдрес.ОбновитьТекстРедактирования();
			Форма.ПодключитьОбработчикОжидания(ИмяОбработчикаОжидания, 0.1, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// на основе Обработка.РасширенныйВводКонтактнойИнформации.ВводАдреса - процедура УлицаАвтоПодбор
Процедура УлицаАвтоПодбор(ИдентификаторНаселенногоПункта, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений;
	
	//ИдентификаторНаселенногоПункта = ИдентификаторАдреса(НаселенныйПунктДетально, Ложь);
	//Если СтрДлина(Текст) < 2 Или Не ЗначениеЗаполнено(ИдентификаторНаселенногоПункта)Тогда
	//	// Нет вариантов, список пуст, стандартную обработку не надо трогать.
	//	Возврат;
	//КонецЕсли;
	
	Результат = ВариантыУлицПоТексту(Текст, ИдентификаторНаселенногоПункта);

	Если Результат.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//Если Результат.Данные.Количество() = 0 Тогда
	//	АдаптацияИдентификатораНаселенногоПункта(ИдентификаторНаселенногоПункта);
	//	Результат = ВариантыУлицПоТексту(Текст);

	//	Если Результат.Отказ Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	ДанныеВыбора = Результат.Данные;
	
	// Стандартную обработку отключаем, только если есть наши варианты.
	Если ДанныеВыбора.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция ВариантыУлицПоТексту(Знач Текст, ИдентификаторНаселенногоПункта)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Идентификатор", ИдентификаторНаселенногоПункта);
	ДополнительныеПараметры.Вставить("ТипАдреса",     "Административно-территориальный");
	ДополнительныеПараметры.Вставить("Уровень",       7);
	
	ДополнительныеПараметры.Вставить("ИзФормыДокумента", Истина); //++
	
	Результат = ОбщийМодульВызовСервера.СписокАвтоподбораУлицы(Текст, ДополнительныеПараметры);
	Возврат Результат;

КонецФункции

// Вызовы
// - Лид.ФормаДокумента (адрес, адрес выезда)
// - ЗаявкаНаДоставку.ФормаДокумента (адрес)
Процедура ОбработкаСобытияАдресАвтоПодбор(Форма, ИдентификаторУлицы, ИдентификаторНаселенногоПункта, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка) Экспорт
	
	Если Ожидание = 0 Тогда
		// Формирование списка быстрого выбора, стандартную обработку не надо трогать.
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(Текст) < 3 ИЛИ НЕ ЗначениеЗаполнено(ИдентификаторНаселенногоПункта) Тогда 
		// Нет вариантов, список пуст, стандартную обработку не надо трогать.
		Возврат;
	КонецЕсли;
	
	ЧислоВхождений = СтрЧислоВхождений(Текст, ",");
	
	Если ЧислоВхождений = 0 Тогда
		//запятых нет, предлагаем улицы
		
		//#17014 переделываем на "стандарт" классификатора
		
		////улица уже могла быть сохранена в виде строки "ул Название". Разделяем строку на значения, разделитель - пробел. пытаемся найти улицу по второму слову, если оно есть, иначе - по первому
		//ИскомаяСтрока = Текст;
		//СписокСлов = СтрРазделить(Текст, " ", ложь);
		//Если СписокСлов.Количество() > 1 Тогда
		//	Для НомерПозиции = 1 По СписокСлов.Количество()-1 Цикл
		//		ИскомаяСтрока = ИскомаяСтрока + " " + СокрЛП(СписокСлов[НомерПозиции]);
		//	КонецЦикла;
		//	ИскомаяСтрока = СокрЛП(ИскомаяСтрока);
		//ИначеЕсли СписокСлов.Количество() > 0 Тогда
		//	ИскомаяСтрока = СокрЛП(СписокСлов[0]);
		//КонецЕсли;
		//
		//СтандартнаяОбработка = Ложь;
		//
		//КодГорода = Форма.КодГорода;
		//КодНасПункта = Форма.КодНасПункта;
		//КодСубъектаРФ = Форма.КодСубъектаРФ;
		//ИдентификаторРодителя = Форма.ИдентификаторРодителя;
		//
		//Если ЭтоВыезд И Форма.Объект.АдресВыездаОтличаетсяОтАдресаЛида Тогда
		//	
		//	КодГорода = Форма.КодГородаВыезда;
		//	КодНасПункта = Форма.КодНасПунктаВыезда;
		//	КодСубъектаРФ = Форма.КодСубъектаРФВыезда;
		//	ИдентификаторРодителя = Форма.ИдентификаторРодителяВыезда;
		//	
		//КонецЕсли;
		//
		//СписокУлиц = ОбщийМодульВызовСервера.ПолучитьСписокУлицПоЧастиНаименования(ИскомаяСтрока, КодГорода, КодНасПункта, КодСубъектаРФ, ИдентификаторРодителя);
		//Если НЕ СписокУлиц.Количество() = 0 Тогда
		//	ДанныеВыбора = СписокУлиц;
		//КонецЕсли;
		УлицаАвтоПодбор(ИдентификаторНаселенногоПункта, Текст, ДанныеВыбора, СтандартнаяОбработка);
		
	ИначеЕсли ЧислоВхождений = 1 
		ИЛИ (ЧислоВхождений = 2 И СтрНайти(НРег(Текст), "дом") = 0 И СтрНайти(НРег(Текст), "квартира") = 0 И СтрНайти(НРег(Текст), "кв.") = 0) Тогда		
		//есть одна запятая или 2 запятые (но не указан дом, улица с микрорайоном), предлагаем дома
		СтандартнаяОбработка = Ложь;
		ПолныйСписокДомов = ОбщийМодульВызовСервера.СписокАвтоподбораДомов(ИдентификаторУлицы);
		Если НЕ ПолныйСписокДомов.Количество() = 0 Тогда
			ДанныеВыбора = ПолныйСписокДомов;
		КонецЕсли;
	Иначе
		//слишком много запятых. ничего не предлагаем
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
//-- №10663

#КонецОбласти

#Область ИзменениеСтатусаЗаявкиНаДоставку

//++ №10663
Процедура ИзменитьТекущийСтатусЗаявкиНаДоставку(Форма, ИмяСписка) Экспорт
	
	Элементы = Форма.Элементы;
	
	ОчиститьСообщения();
	
	МассивДокументов = Новый Массив;
	
	Если Форма.Элементы[ИмяСписка].ВыделенныеСтроки.Количество() = 0 Тогда
		Сообщить("Нет выделенных документов");
		Возврат;
	КонецЕсли;
		
	Для НомерСтроки = 0 По Элементы[ИмяСписка].ВыделенныеСтроки.Количество()-1 Цикл			
		МассивДокументов.Добавить(Элементы[ИмяСписка].ВыделенныеСтроки.Получить(НомерСтроки)); 
	КонецЦикла;
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораНовогоСтатуса", ЭтотОбъект, новый Структура("Форма, ИмяСписка, МассивДокументов", Форма, ИмяСписка, МассивДокументов));
	ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", новый Структура("ДоступныеЗначения", ОбщийМодульВызовСервера.ВернутьСписокСтатустовЗаявокНаДоставку()),,,,, ОписаниеОповещения);
	
КонецПроцедуры

Процедура ПослеВыбораНовогоСтатуса(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Вставить("Статус", Результат);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаИзменитьСтатусДокументов", ЭтотОбъект, ДопПараметры);
	ТекстСообщения = "Перевести заявки на доставку в количестве " + ДопПараметры.МассивДокументов.Количество() + " шт. в статус """ + Результат + """? 
					|Документы будут автоматически записаны.";
	ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

Процедура ПослеВопросаИзменитьСтатусДокументов(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийМодульВызовСервера.ИзменитьСтатусДокументовНаСервере(ДопПараметры.МассивДокументов, ДопПараметры.Статус);
	ДопПараметры.Форма.Элементы[ДопПараметры.ИмяСписка].Обновить();
	
	ПоказатьОповещениеПользователя("Выполнено");
		
КонецПроцедуры
//-- №10663

#КонецОбласти

//++ №11768 для версии 2.8.0.$a производится ручная обработка
Функция ЕстьОбъектыКОбработкеВерсии(Версия, ВыборочныеОбъектыКОбработке) Экспорт
	
	Для Каждого ТекущаяСтрока Из ВыборочныеОбъектыКОбработке Цикл
		Если ТекущаяСтрока.ВерсияПрограммы = Версия Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ВыполнитьОбработку_2_8_0_Sa(Версия, ВерсияПрограммыЧисло, ДокументСсылка, ДополнительныеПараметры)
	
	ИнформацияПоСвязке = ОбщийМодульВызовСервера.ПолучитьИнформациюПоСвязкеЗамераЛидаИЗаказДоговора(ДокументСсылка);
	
	Если ИнформацияПоСвязке.УказанЗамер И ИнформацияПоСвязке.ЗамерщикСовпадает Тогда
		
		// убираем из обработки
		ОбщийМодульВызовСервера.ЗафиксироватьУспешнуюОбработку(Версия, ВерсияПрограммыЧисло, ДокументСсылка, Ложь);
		ДополнительныеПараметры.Форма.Прочитать();
		Возврат;
		
	ИначеЕсли НЕ ИнформацияПоСвязке.УказанЗамер Или НЕ ИнформацияПоСвязке.ЗамерщикСовпадает Тогда
		
		ТекстВопроса = "Внимание! В заказ-договоре не указан замер и/или замерщик не совпадает с данными замера, считать эти данные верными?";
		
		СтруктураПараметров = новый Структура;
		СтруктураПараметров.Вставить("Форма", ДополнительныеПараметры.Форма);
		СтруктураПараметров.Вставить("Версия", Версия);
		СтруктураПараметров.Вставить("ВерсияПрограммыЧисло", ВерсияПрограммыЧисло);
		СтруктураПараметров.Вставить("ДокументСсылка", ДокументСсылка);
		
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВопросаОКорректностиДанныхПоЗамеруВЗаказДоговоре", ОбщийМодульКлиент, СтруктураПараметров);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВопросаОКорректностиДанныхПоЗамеруВЗаказДоговоре(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ОбщийМодульВызовСервера.ЗафиксироватьУспешнуюОбработку(ДополнительныеПараметры.Версия, ДополнительныеПараметры.ВерсияПрограммыЧисло, ДополнительныеПараметры.ДокументСсылка, Ложь);
		ДополнительныеПараметры.Форма.Прочитать();
		
	КонецЕсли;
	
КонецПроцедуры
//-- №11768

//++ #12364 
Процедура ФормаДополнительнойИнформацииКонтрагента(Контрагент) Экспорт
	
	ПараметрыФормы = Новый Структура("Контрагент", Контрагент);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаДополнительнойИнформации", ПараметрыФормы, Новый УникальныйИдентификатор);
	
КонецПроцедуры

Процедура ЕстьИндивидуальныеЦеныКонтрагента(Контрагент, Дата) Экспорт
	
	ПараметрыФормы = Новый Структура("Контрагент", Контрагент);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаИндивидуальныеЦены", ПараметрыФормы, Новый УникальныйИдентификатор);
	
КонецПроцедуры
//-- #12364 

// Ищем элемент дерева по идентификатору и путь к элементу в дереве сохраняем в соответсвии "ВеткиДерева"
// Идентификатор - то что ищем в дереве
// Элемент       - дерево значений или ветка элементов где ищем
Функция ПолучитьВетвьДоЭлемента(Идентификатор, Элемент, Уровень = 0, ВеткиДерева = Неопределено) Экспорт
	Если ВеткиДерева = Неопределено Тогда
		ВеткиДерева = Новый Соответствие;
	КонецЕсли;	
	ЭлементыДерева=Элемент.ПолучитьЭлементы();
	Для инд=0 по ЭлементыДерева.Количество()-1 Цикл
		Если Идентификатор = ЭлементыДерева[инд].ПолучитьИдентификатор() Тогда
			ВеткиДерева.Вставить(Уровень,инд);
			Возврат ВеткиДерева;
		КонецЕсли;
		Если ПолучитьВетвьДоЭлемента(Идентификатор, ЭлементыДерева[инд], Уровень+1, ВеткиДерева) <> Ложь  Тогда
			ВеткиДерева.Вставить(Уровень,инд);
			Возврат ВеткиДерева;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

// Получаем идентификатор строки в дереве по полученной функцией "ПолучитьВетвьДоЭлемента" ветке
Функция ПолучитьидентификаторПоВетке(ЗНАЧ Элемент, ВеткиДерева) Экспорт
	ЭлементыДерева=Элемент.ПолучитьЭлементы();
	Для Уровень=0 По 9999 Цикл
	     ИндексСтроки = ВеткиДерева.Получить(Уровень);
		 Если ИндексСтроки <> Неопределено Тогда
			 Идентификатор = ЭлементыДерева[ИндексСтроки].ПолучитьИдентификатор();	
			 ЭлементыДерева=ЭлементыДерева[ИндексСтроки].ПолучитьЭлементы();
		 Иначе	 
			 Возврат Идентификатор;
		 КонецЕсли;	 
	КонецЦикла;	
КонецФункции


#Область ФункцииСопутствующейНоменклатуры

Функция ПолучитьСвязанныеСопутствующиеТоварыПоВыделеннымСтрокам(ЭлементыДеревоТоваров, ДеревоТоваров) Экспорт
	
	МассивСвязанных = Новый Массив;
	ВыбранныеСтроки = ЭлементыДеревоТоваров.ВыделенныеСтроки;
	
	Для Каждого ВыделеннаяСтрока Из ЭлементыДеревоТоваров.ВыделенныеСтроки Цикл
		ТекущиеДанные = ДеревоТоваров.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		РодительскийЭлемент = ТекущиеДанные.ПолучитьРодителя();		 
		Если РодительскийЭлемент = Неопределено Тогда   // Это комната
			ПодчиненныеСтроки = ТекущиеДанные.ПолучитьЭлементы();
			Для каждого СтрокаТовара из ПодчиненныеСтроки Цикл
				СтрокаКомнаты = СтрокаТовара.ПолучитьРодителя();		 
				СтрокиТоваров = СтрокаКомнаты.ПолучитьЭлементы();
				НайтиСвязанныеСтрокиПоСопуствующимТоварам(СтрокиТоваров, ВыбранныеСтроки, СтрокаТовара.УИСтроки, МассивСвязанных);
			КонецЦикла;		
		Иначе		 
			СтрокиТоваров = РодительскийЭлемент.ПолучитьЭлементы();
			НайтиСвязанныеСтрокиПоСопуствующимТоварам(СтрокиТоваров, ВыбранныеСтроки, ТекущиеДанные.УИСтроки, МассивСвязанных);
		КонецЕсли;		
		
		//Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		//	// строка комнаты
		//	//Продолжить;
		//	Возврат МассивСвязанных;
		//КонецЕсли;
		// СтрокаКомнаты = ТекущиеДанные.ПолучитьРодителя();		 
		//СтрокиТоваров = СтрокаКомнаты.ПолучитьЭлементы();
		//НайтиСвязанныеСтрокиПоСопуствующимТоварам(СтрокиТоваров, ВыбранныеСтроки, ТекущиеДанные.УИСтроки, МассивСвязанных);
	КонецЦикла;
	Возврат МассивСвязанных;
	
КонецФункции

Процедура НайтиСвязанныеСтрокиПоСопуствующимТоварам(СтрокиТоваров, ВыбранныеСтроки, УИСтроки, МассивСвязанных)
	
	Для Каждого СтрокаТовара Из СтрокиТоваров Цикл
		Если СтрокаТовара.УИСтрокиРодителя = УИСтроки
			И МассивСвязанных.Найти(СтрокаТовара.ПолучитьИдентификатор()) = Неопределено 
			// проверяем, что найденная строка нет среди удаляемых пользователем
			И ВыбранныеСтроки.Найти(СтрокаТовара.ПолучитьИдентификатор()) = Неопределено
			Тогда
			МассивСвязанных.Добавить(СтрокаТовара.ПолучитьИдентификатор());
			НайтиСвязанныеСтрокиПоСопуствующимТоварам(СтрокиТоваров, ВыбранныеСтроки, СтрокаТовара.УИСтроки, МассивСвязанных)
		КонецЕсли; 			
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСопутствующиеТовары(ДеревоТоваров, МассивСопутстующихТоваровНаУдаление) Экспорт
	
	Для Каждого ИдентификаторСтроки Из МассивСопутстующихТоваровНаУдаление Цикл
		ЭлементКомнаты = ДеревоТоваров.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЭлементКомнаты = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Комната = ЭлементКомнаты.ПолучитьРодителя();
		СтрокиНоменклатурыКомнаты = Комната.ПолучитьЭлементы();
		СтрокиНоменклатурыКомнаты.Удалить(ЭлементКомнаты);
	КонецЦикла;
	
КонецПроцедуры

Функция ИзменитьКоличествоСопутствущихТоваров(ДеревоТоваров, Номенклатура, Характеристика, УИСтроки, Количество, ИдКомнаты, ИзмененныеСтроки = Неопределено) Экспорт
	
	Если ИзмененныеСтроки = Неопределено Тогда
		ИзмененныеСтроки = Новый Массив;
	КонецЕсли;	
	СтрокаКомнаты = ДеревоТоваров.НайтиПоИдентификатору(ИдКомнаты);	
	СтрокиНоменклатурыКомнаты = СтрокаКомнаты.ПолучитьЭлементы();
	
	Позиция = Новый Структура;
	Позиция.Вставить("Номенклатура",								Номенклатура);
	Позиция.Вставить("ХарактеристикаНоменклатуры",		Характеристика);
	Позиция.Вставить("УИСтроки",										УИСтроки);
	Позиция.Вставить("Количество",									Количество);
	ТаблицаСопутствующейНоменклатуры = СопутствующиеТоварыВызовСервера.ПодборСопутствующейНоменклатурыНаСервере(Позиция);
	
	Для Каждого СтрокаТовара Из СтрокиНоменклатурыКомнаты Цикл
		ТекущийРодитель = СтрокаТовара.УИСтрокиРодителя;
		Для Каждого Запись из ТаблицаСопутствующейНоменклатуры Цикл
			Если СтрокаТовара.УИСтрокиРодителя = Запись.УИСтрокиРодителя
				И СтрокаТовара.Номенклатура = Запись.Номенклатура
				И СтрокаТовара.ХарактеристикаНоменклатуры = Запись.Характеристика Тогда 
				НовыйУИ = СтрокаТовара.УИСтроки;
				СтарыйУИ = Запись.УИСтроки;
				Для Каждого СтрокаКорректировкиУИ Из ТаблицаСопутствующейНоменклатуры Цикл  // приводим в соответсвие УИ
					Если СтрокаКорректировкиУИ.УИСтроки = СтарыйУИ Тогда
						СтрокаКорректировкиУИ.УИСтроки = НовыйУИ;
					КонецЕсли;	
					Если СтрокаКорректировкиУИ.УИСтрокиРодителя = СтарыйУИ Тогда
						СтрокаКорректировкиУИ.УИСтрокиРодителя = НовыйУИ;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;	
	
	Для Каждого Запись из ТаблицаСопутствующейНоменклатуры Цикл
		Для Каждого СтрокаТовара Из СтрокиНоменклатурыКомнаты Цикл
			Если СтрокаТовара.УИСтроки = Запись.УИСтроки И СтрокаТовара.Номенклатура = Запись.Номенклатура  И СтрокаТовара.ХарактеристикаНоменклатуры = Запись.Характеристика Тогда
				СтрокаТовара.Количество = Запись.Количество;
				ИзмененныеСтроки.Добавить(СтрокаТовара);
			КонецЕсли; 			
		КонецЦикла;
	КонецЦикла;
		
	Возврат ИзмененныеСтроки;
	
КонецФункции

Функция ПолучитьИдентификаторПоУИстроки(ДеревоТоваров, УИСтроки) Экспорт
	СтрокиКорня = ДеревоТоваров.ПолучитьЭлементы();
	Для каждого Строка Из СтрокиКорня Цикл
		СтрокиНоменклатуры = Строка.ПолучитьЭлементы();
		Для Каждого СтрокаНоменклатуры Из СтрокиНоменклатуры Цикл
			Если СтрокаНоменклатуры.УИСТроки = УИСтроки Тогда
				Возврат  СтрокаНоменклатуры.ПолучитьИдентификатор();
			КонецЕсли;	
		КонецЦикла;   	   
	КонецЦикла;   
КонецФункции


#КонецОбласти  



