Функция ПолучитьПодчиненныеДокументы(ДокументСсылка, СписокСвязанныхДокументов = Неопределено, мУжеВСписке = Неопределено) Экспорт
    
    Если СписокСвязанныхДокументов = Неопределено Тогда 
        СписокСвязанныхДокументов = Новый СписокЗначений;
    КонецЕсли;
    Если мУжеВСписке = Неопределено Тогда 
        мУжеВСписке = Новый Соответствие;
    КонецЕсли;
    
    Таблица = ПолучитьВыборкуПоКритериюОтбора("СвязанныеДокументы", ДокументСсылка);    
    КэшПоТипамДокументов = Новый Соответствие;
    
    Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
        МетаданныеДокумента = СтрокаТаблицы.Ссылка.Метаданные();
        Если Не ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
            Продолжить;
        КонецЕсли;            
        ИмяДокумента = МетаданныеДокумента.Имя;
        СинонимДокумента = МетаданныеДокумента.Синоним;
        
        СтруктураТипа = КэшПоТипамДокументов[ИмяДокумента];
        Если СтруктураТипа = Неопределено Тогда
            СтруктураТипа = Новый Структура("Синоним, МассивСсылок", СинонимДокумента, Новый Массив);
            КэшПоТипамДокументов.Вставить(ИмяДокумента, СтруктураТипа);
        КонецЕсли;
        СтруктураТипа.МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);        
    КонецЦикла;
    
    ЕСли КэшПоТипамДокументов.Количество() = 0 Тогда 
        Возврат СписокСвязанныхДокументов;
    КонецЕсли;
    
    ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
    ТекстЗапросаКонец = ") КАК ПодчиненныеДокументы ";
    Запрос = Новый Запрос;
    Для Каждого КлючИЗначение ИЗ КэшПоТипамДокументов Цикл
        Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "
                    |ВЫБРАТЬ ", "
                    |ОБЪЕДИНИТЬ ВСЕ
                    |ВЫБРАТЬ") + "
                    |Ссылка
                    |ИЗ Документ." + КлючИЗначение.Ключ + "
                    |ГДЕ Ссылка В (&" + КлючИЗначение.Ключ + ")";
                    
        Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение.МассивСсылок);        
    КонецЦикла;
    
    Запрос.Текст = ТекстЗапросаНачало + Запрос.Текст + ТекстЗапросаКонец;
    
    Выборка = Запрос.Выполнить().Выбрать();    
    Пока Выборка.Следующий() Цикл
        Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
            СписокСвязанныхДокументов.Добавить(Выборка.Ссылка);
            мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
            СписокСвязанныхДокументов = ПолучитьПодчиненныеДокументы(Выборка.Ссылка, СписокСвязанныхДокументов, мУжеВСписке);
        КонецЕсли;
    КонецЦикла;
    
    Возврат СписокСвязанныхДокументов;
    
КонецФункции

Функция ПолучитьВыборкуПоКритериюОтбора(ИмяКритерияОтбора, ЗначениеКритерия) Экспорт
       
    Запрос = Новый Запрос;
    ТекстЗапроса = "";
   
    Для Каждого ЭлементСостава ИЗ Метаданные.КритерииОтбора[ИмяКритерияОтбора].Состав Цикл
       
        Если Не ЭлементСостава.Тип.СодержитТип(ТипЗнч(ЗначениеКритерия)) Тогда
            Продолжить;
        КонецЕсли;
       
        ПутьКДанным = ЭлементСостава.ПолноеИмя();
        СтруктураПутьКДанным = РазобратьПутьКОбъектуМетаданных(ПутьКДанным, ЭлементСостава.Родитель());
       
		//ЕСли НЕ ПравоДоступа("Чтение", СтруктураПутьКДанным.Метаданные) Тогда
		//    Продолжить;
		//КонецЕсли;
       
        ИмяОбъекта = СтруктураПутьКДанным.ТипОбъекта + "." + СтруктураПутьКДанным.ВидОбъекта;
        ПсевдонимТаблицы = СтруктураПутьКДанным.ТипОбъекта + "_" + СтруктураПутьКДанным.ВидОбъекта + "_" + СтруктураПутьКДанным.ИмяТаблЧасти;
       
        ТекущаяСтрокаГДЕ = "ГДЕ " + ПсевдонимТаблицы + "." +СтруктураПутьКДанным.ИмяРеквизита + " = &ЗначениеКритерияОтбора";
           
        ИмяТЧ = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".")-1);
        ИмяРеквизита = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".")-1);
        ТекстЗапроса = ТекстЗапроса + (?(ТекстЗапроса = "", "ВЫБРАТЬ", "ОБЪЕДИНИТЬ ВСЕ
        |ВЫБРАТЬ") + "
        |" + ПсевдонимТаблицы + ".Ссылка ИЗ " + ИмяОбъекта + "." + СтруктураПутьКДанным.ИмяТаблЧасти + " КАК " + ПсевдонимТаблицы + "
        |" + СтрЗаменить(ТекущаяСтрокаГДЕ, "..", ".") + "
        |");
       
    КонецЦикла;
   
    Если ТекстЗапроса = "" Тогда
        Возврат Новый ТаблицаЗначений;
    КонецЕсли;
   
    Запрос.Текст = ТекстЗапроса;
    Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗначениеКритерия);
    Возврат Запрос.Выполнить().Выгрузить();
   
КонецФункции  

Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным, МетаданныеОбъекта = Неопределено) Экспорт
   
    Структура = Новый Структура;
   
    СоответствиеИмен = Новый Массив();
    СоответствиеИмен.Добавить("ТипОбъекта");
    СоответствиеИмен.Добавить("ВидОбъекта");
    СоответствиеИмен.Добавить("ПутьКДанным");
    СоответствиеИмен.Добавить("ИмяТаблЧасти");
    СоответствиеИмен.Добавить("ИмяРеквизита");
   
    Для индекс = 1 по 3 Цикл
       
        Точка = Найти(ПутьКДанным, ".");
        ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
        Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
        ПутьКДанным = Сред(ПутьКДанным, Точка+1);
       
    КонецЦикла;
   
    ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
   
    Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
       
        Для индекс = 4 по 5  Цикл
           
            Точка = Найти(ПутьКДанным, ".");
            Если Точка = 0 Тогда
                ТекущееЗначение = ПутьКДанным;
            Иначе
                ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
            КонецЕсли;
           
            Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
            ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
           
        КонецЦикла;
       
    Иначе
       
        Структура.Вставить(СоответствиеИмен[3], "");
        Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
       
    КонецЕсли;
   
    Если МетаданныеОбъекта <> Неопределено Тогда
        Структура.Вставить("Метаданные", МетаданныеОбъекта);
    Иначе
        Если Структура.ТипОбъекта = "Документ" Тогда
            Структура.Вставить("Метаданные", Метаданные.Документы[Структура.ВидОбъекта]);
        Иначе
            Структура.Вставить("Метаданные", Метаданные.Справочники[Структура.ВидОбъекта]);
        КонецЕсли;
    КонецЕсли;
   
    Возврат Структура;
   
КонецФункции

Функция ПолучитьЯчейку(Номенклатура, Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураСкладскиеЯчейки.Ячейка КАК Ячейка
		|ИЗ
		|	Справочник.Номенклатура.СкладскиеЯчейки КАК НоменклатураСкладскиеЯчейки
		|ГДЕ
		|	НоменклатураСкладскиеЯчейки.Ссылка = &Номенклатура
		|	И НоменклатураСкладскиеЯчейки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ячейка;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции