// перенесено в модуль объекта для обхода ограничений по Регистратор и ОбъектВыработки, накладываемые СКД
// при отсутствии прав на один из видов документов составного типа реквизитов

Функция ТекстЗапроса()
Возврат
"ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ВыработкаИсполнителейРозницыОбороты.НомерСтроки КАК НомерСтроки,
|	ВыработкаИсполнителейРозницыОбороты.Регистратор КАК Регистратор,
|	ВыработкаИсполнителейРозницыОбороты.ПериодСекунда КАК ПериодСекунда,
|	ВыработкаИсполнителейРозницыОбороты.ПериодМинута КАК ПериодМинута,
|	ВыработкаИсполнителейРозницыОбороты.ПериодЧас КАК ПериодЧас,
|	ВыработкаИсполнителейРозницыОбороты.ПериодДень КАК ПериодДень,
|	ВыработкаИсполнителейРозницыОбороты.ПериодНеделя КАК ПериодНеделя,
|	ВыработкаИсполнителейРозницыОбороты.ПериодДекада КАК ПериодДекада,
|	ВыработкаИсполнителейРозницыОбороты.ПериодМесяц КАК ПериодМесяц,
|	ВыработкаИсполнителейРозницыОбороты.ПериодКвартал КАК ПериодКвартал,
|	ВыработкаИсполнителейРозницыОбороты.ПериодПолугодие КАК ПериодПолугодие,
|	ВыработкаИсполнителейРозницыОбороты.ПериодГод КАК ПериодГод,
|	ВыработкаИсполнителейРозницыОбороты.Сотрудник КАК Сотрудник,
|	ВыработкаИсполнителейРозницыОбороты.Номенклатура КАК Номенклатура,
|	ВыработкаИсполнителейРозницыОбороты.СтоимостьОборот КАК Стоимость,
|	ВыработкаИсполнителейРозницыОбороты.ВидНачисления КАК ВидНачисления,
|	ВыработкаИсполнителейРозницыОбороты.ОбъектВыработки КАК ОбъектВыработки,
|	ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаИсполнителейРозницыОбороты.ОбъектВыработки.Адрес, ЕСТЬNULL(ВыработкаИсполнителейРозницыОбороты.ОбъектВыработки.АдресМонтажа, """")) КАК СТРОКА(150)) КАК ОбъектВыработкиАдрес,
|	ВыработкаИсполнителейРозницыОбороты.ОбъектВыработки.СуммаДокумента КАК ОбъектВыработкиСуммаДокумента,
|	ВыработкаИсполнителейРозницыОбороты.ОбъектВыработки.СуммаДокумента КАК ОбъектВыработкиСуммаБезИтога,
|	ВыработкаИсполнителейРозницыОбороты.Регистратор.Адрес КАК РегистраторАдрес,
|	ВыработкаИсполнителейРозницыОбороты.Регистратор.СуммаДокумента КАК РегистраторСуммаДокумента,
|	ВыработкаИсполнителейРозницыОбороты.Регистратор.СуммаДокумента КАК РегистраторСуммаБезИтога,
|	ВыработкаИсполнителейРозницыОбороты.ОбъектВыработки.Дата КАК РегистраторДата,
|	ВыработкаИсполнителейРозницыОбороты.Регистратор.Основание.Дата КАК РегистраторОснованиеДата,
|	ВыработкаИсполнителейРозницыОбороты.Регистратор.Основание.Основание.Дата КАК РегистраторОснованиеОснованиеДата,
|	ВыработкаИсполнителейРозницыОбороты.Регистратор.Основание.ТочкаПродаж КАК РегистраторОснованиеТочкаПродаж,
|	ВыработкаИсполнителейРозницыОбороты.КоличествоОборот КАК КоличествоОборот
|ИЗ
|	РегистрНакопления.ВыработкаИсполнителейРозницы.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ВыработкаИсполнителейРозницыОбороты"
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ПолеСтоимость = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Поля.Найти("Стоимость");
	Если НЕ ПолеСтоимость = Неопределено Тогда
		ПолеСтоимость.Заголовок = "Стоимость выработки, " + Строка(ПолучитьФункциональнуюОпцию("ВалютаУчета"));
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();

	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//++ #12385
	//ПараметрНачалоПериода = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	//НачалоПериода = ПараметрНачалоПериода.Значение;
	//Если ТипЗнч(НачалоПериода) = Тип("СтандартнаяДатаНачала") Тогда
	//	НачалоПериода = НачалоДня(НачалоПериода.Дата);
	//ИначеЕсли ТипЗнч(НачалоПериода) = Тип("Дата") Тогда
	//	НачалоПериода = НачалоДня(НачалоПериода);
	//КонецЕсли;
	//Если НЕ ПараметрНачалоПериода.Использование Тогда
	//	НачалоПериода = Дата(1,1,1);
	//КонецЕсли;
	//	
	//ПараметрКонецПериода = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	//КонецПериода = ПараметрКонецПериода.Значение;
	//Если ТипЗнч(КонецПериода) = Тип("СтандартнаяДатаНачала") Тогда
	//	Если КонецПериода.Дата = Дата(1,1,1) Тогда
	//		КонецПериода = Дата(3999,12,31);
	//	Иначе
	//		КонецПериода = КонецДня(КонецПериода.Дата);
	//	КонецЕсли;
	//ИначеЕсли ТипЗнч(КонецПериода) = Тип("Дата") Тогда
	//	КонецПериода = КонецДня(КонецПериода);
	//КонецЕсли;
	//Если НЕ ПараметрКонецПериода.Использование Тогда
	//	КонецПериода = Дата(3999,12,31);
	//КонецЕсли; 
	
	ПараметрСтПериод = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтПериод"));
	Если ПараметрСтПериод.Использование Тогда
		НачалоПериода = ПараметрСтПериод.Значение.ДатаНачала;
		КонецПериода  = ПараметрСтПериод.Значение.ДатаОкончания;
	Иначе
		НачалоПериода = Дата(1,1,1);
		КонецПериода  = Дата(3999,12,31);
	КонецЕсли;
	//-- #12385

	Запрос = новый запрос;
	Запрос.Текст = ТекстЗапроса();
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода",  Новый Граница(КонецПериода, ВидГраницы.Включая));
	ВТ_Выработка = Запрос.Выполнить().Выгрузить();

	
	ВнешнийНаборДанных = Новый Структура("ВТ_Выработка", ВТ_Выработка);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);

	ДокументРезультат.Очистить();

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры
