#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПредварительныйРасчетЗаказДоговора) Тогда 
		// Коммерческое предложение
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.Лид";
		КомандаПечати.Идентификатор = "КоммерческоеПредложение";
		КомандаПечати.Представление = НСтр("ru = 'Коммерческое предложение'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
		КомандаПечати.Порядок = 1;
		КомандаПечати.ЗаголовокФормы = "Коммерческое предложение";
		КомандаПечати.ДополнительныеПараметры.Вставить("ИмяВложенияИзЗаголовкаФормы", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КоммерческоеПредложение") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"КоммерческоеПредложение",
			НСтр("ru = 'Коммерческое предложение'"),
			Документы.ПредварительныйРасчетЗаказДоговора.ПечатьКоммерческоеПредложение(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ПредварительныйРасчетЗаказДоговора.ПФ_MXL_КоммерческоеПредложение"
		);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Добавляет команду создания документа "Лид".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.Лид) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.Лид.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.Лид.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция СформироватьОписаниеЗамерщиковHTML(ФильтрТочкаПродаж) Экспорт
	
	ОписаниеЗамерщиковHTMLНачало = 
	"<!DOCTYPE html>
	|  <html lang='ru'>
	|    <head>
	|      <meta charset='utf-8'>
	|  <style>
	|  table {
	|    font-family: ""Arial"", Sans-Serif;
	|  	font-size: 14px;
	|  	color: #666666;
	|  	border-collapse: collapse;
	|  }
	|  th, td {
	|  	background: #FFEF9C;
	|  	color: #635129;
	|  	padding: 10px 20px;
	|  }
	|  td {
	|  	border-style: solid;
	|  	border-width: 0 1px 1px 0;
	|  	border-color: white;
	|    padding: 5px 5px;
	|  }
	|  td {
	|  	background: #F7F3DE;
	|  }
	|  a {
	|  	color: #635129;
	|  }
	|  </style>
	|    
	|    </head>
	|  <body>
	|    <table>
	|    <tr>
	|      <th>Замерщик</th>
	|      <th>Описание замерщиков</th>
	|  
	|      </tr>";

	ОписаниеЗамерщиков = МодульОтчетов.ПолучитьТаблицуЗамерщиков(ФильтрТочкаПродаж);
	
	ОписаниеЗамерщиковHTMLПродолжение = "";
	Если ОписаниеЗамерщиков.Количество() >0 Тогда
		Для каждого СтрокаТЗ из ОписаниеЗамерщиков Цикл
			Если НЕ ПустаяСтрока(СтрокаТЗ.Комментарий) Тогда
				СсылкаНаЭлемент = ЗначениеВСтрокуВнутр(СтрокаТЗ.Сотрудник);
				ОписаниеЗамерщиковHTMLПродолжение = ОписаниеЗамерщиковHTMLПродолжение +
				"     <tr>
				|      <td><a href = v8:" + СсылкаНаЭлемент + ">" + СтрокаТЗ.Сотрудник + "</a></td>
				|      <td>" + СтрЗаменить(СтрокаТЗ.Комментарий, Символы.ПС, "<br>") + "</td>
				|     </tr>";
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;

	ОписаниеЗамерщиковHTMLПродолжение = ОписаниеЗамерщиковHTMLПродолжение +
	"</table></body></html>";
	
	ОписаниеЗамерщиковHTML = ОписаниеЗамерщиковHTMLНачало + ОписаниеЗамерщиковHTMLПродолжение;
	
	Возврат ОписаниеЗамерщиковHTML;
	
КонецФункции

//++ №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора
//Функция ПолучитьМассивРеквизитовПоЦенам() Экспорт
//	
//	МассивИменЭлементов = Новый Массив;
//	
//	МассивИменЭлементов.Добавить("ДеревоТоваровЦена");
//	МассивИменЭлементов.Добавить("ДеревоТоваровСумма");
//	
//	Возврат МассивИменЭлементов;
//	
//КонецФункции
//	
//Функция ПолучитьМассивРеквизитовПоСкидкам() Экспорт
//	
//	МассивИменЭлементов = Новый Массив;
//	
//	МассивИменЭлементов.Добавить("ДеревоТоваровПроцентСкидки");
//	МассивИменЭлементов.Добавить("ДеревоТоваровСуммаСкидки");
//	
//	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуНаПотолок");
//	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуНаУслуги");
//	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуТовары");
//	
//	МассивИменЭлементов.Добавить("ИзменитьСуммуДокумента");
//	МассивИменЭлементов.Добавить("ВидСкидки");
//	
//	Возврат МассивИменЭлементов;
//	
//КонецФункции
//-- №10184 перенесено в документ ПредварительныйРасчетЗаказДоговора

Функция ОпределитьНазначенИлиИзмененЗамерИлиВыезд(ТекстВИсторию, ПредыдущаяТаблица, ТекущаяТаблица, ЭтоВыезды = Ложь) Экспорт
	
	ИмяПоляДата = ?(ЭтоВыезды, "Дата", "ДатаЗамера");
	ИмяПоляНачала = ?(ЭтоВыезды, "ВремяНачала", "ВремяНачалаЗамера");
	ИмяПоляОкончания = ?(ЭтоВыезды, "ВремяОкончания", "ВремяОкончанияЗамера");
	ИмяПоляИсполнитель = ?(ЭтоВыезды, "Исполнитель", "ИсполнительЗамера");
	
	ЕстьИзменения = Ложь;
	ЕстьНовые = Ложь;
	
	Для каждого СтрокаЗамераВыезда из ТекущаяТаблица Цикл
		НайденныеСтроки = ПредыдущаяТаблица.НайтиСтроки(Новый Структура("ИДЗамера", СтрокаЗамераВыезда.ИДЗамера));
		Если НайденныеСтроки.Количество() > 0 Тогда	
			Если НЕ СтрокаЗамераВыезда[ИмяПоляДата] = НайденныеСтроки[0][ИмяПоляДата] 
				ИЛИ НЕ СтрокаЗамераВыезда[ИмяПоляНачала] = НайденныеСтроки[0][ИмяПоляНачала] 
				ИЛИ НЕ СтрокаЗамераВыезда[ИмяПоляИсполнитель] = НайденныеСтроки[0][ИмяПоляИсполнитель] Тогда
				
				ТекстВИсторию = "%1 перенесен. Старые значения Дата: %2 %3. Исполнитель: %4. Новые значения Дата: %5 %6. Исполнитель: %7";
				ТекстВИсторию = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВИсторию,
									?(ЭтоВыезды, "Выезд", "Замер"),
									Формат(НайденныеСтроки[0][ИмяПоляДата],"ДЛФ=Д"),
									Формат(НайденныеСтроки[0][ИмяПоляНачала],"ДЛФ=В"),
									НайденныеСтроки[0][ИмяПоляИсполнитель],
									Формат(СтрокаЗамераВыезда[ИмяПоляДата],"ДЛФ=Д"),
									Формат(СтрокаЗамераВыезда[ИмяПоляНачала],"ДЛФ=В"),
									СтрокаЗамераВыезда[ИмяПоляИсполнитель]);
				ЕстьИзменения = Истина;
			КонецЕсли;
		Иначе
			ТекстВИсторию = "Назначен %1. Дата: %2 %3. Исполнитель: %4";
			ТекстВИсторию = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВИсторию,
									?(ЭтоВыезды, "выезд", "замер"),
									Формат(СтрокаЗамераВыезда[ИмяПоляДата],"ДЛФ=Д"),
									Формат(СтрокаЗамераВыезда[ИмяПоляНачала],"ДЛФ=В"),
									СтрокаЗамераВыезда[ИмяПоляИсполнитель]);
			ЕстьНовые = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьНовые ИЛИ ЕстьИзменения;
	
КонецФункции

#КонецОбласти

#КонецЕсли