
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда			
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ИсключающиеСвойства = "";
	// #16000
	МенеджерОбъектаДетализации = Справочники.ДетализацияУчетаЛидов;
	Если НЕ МенеджерОбъектаДетализации.Организация.Использовать Тогда
		ИсключающиеСвойства = ИсключающиеСвойства + ?(ПустаяСтрока(ИсключающиеСвойства), "", ",") + "Организация"	
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект, ИсключающиеСвойства);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ИмяКлиента = ДанныеЗаполнения.Контрагент;		
		
		ТелефонКлиента  = ОбщийМодульСервер.ПолучитьТелефонИзКонтактнойИнформации(ДанныеЗаполнения.Контрагент);
		ВидИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
		УправлениеКонтактнойИнформациейПотолки.ЗаписатьКонтактнуюИнформацию(ЭтотОбъект, ТелефонКлиента, ВидИнформации, ТипИнформации, Новый УникальныйИдентификатор);
			
		ЭлектроннаяПочтаКлиента = ОбщийМодульСервер.ПолучитьЭлектроннуюПочтуИзКонтактнойИнформации(ДанныеЗаполнения.Контрагент);
		ВидИнформации = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
		ТипИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		УправлениеКонтактнойИнформациейПотолки.ЗаписатьКонтактнуюИнформацию(ЭтотОбъект, ЭлектроннаяПочтаКлиента, ВидИнформации, ТипИнформации, Новый УникальныйИдентификатор);
		
		РекламныйИсточник = Справочники.РекламныеИсточники.ПовторныйКлиент;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Лид") Тогда
		ИмяКлиента = ДанныеЗаполнения.ИмяКлиента;
		
		ТелефонКлиента  = ОбщийМодульСервер.ПолучитьТелефонИзКонтактнойИнформации(ДанныеЗаполнения.Контрагент);
		ВидИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
		УправлениеКонтактнойИнформациейПотолки.ЗаписатьКонтактнуюИнформацию(ЭтотОбъект, ТелефонКлиента, ВидИнформации, ТипИнформации, Новый УникальныйИдентификатор);
			
		ЭлектроннаяПочтаКлиента = ОбщийМодульСервер.ПолучитьЭлектроннуюПочтуИзКонтактнойИнформации(ДанныеЗаполнения.Контрагент);
		ВидИнформации = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
		ТипИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		УправлениеКонтактнойИнформациейПотолки.ЗаписатьКонтактнуюИнформацию(ЭтотОбъект, ЭлектроннаяПочтаКлиента, ВидИнформации, ТипИнформации, Новый УникальныйИдентификатор);
		
		РекламныйИсточник = Справочники.РекламныеИсточники.ПовторныйКлиент;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭлектронноеПисьмо") Тогда		
		ЭлектроннаяПочтаКлиента = ДанныеЗаполнения.АдресОтправителя;
		ВидКонтакта = Справочники.ВидыКонтактов.ЭлектроннаяПочта;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		//вызывается в частности с графика замеров
		Если ДанныеЗаполнения.Свойство("ЗаявкаНаЗамер") Тогда
			ТекущийСтатус = Справочники.СтатусыЛида.НазначитьЗамер;
			
			ТекущийПользователь = Пользователи.ТекущийПользователь();
			
			НоваяСтрока = Замеры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеЗаполнения);
			НоваяСтрока.Портал_id = ОбщийМодуль.ПолучитьТекущееUnixTime();
			НоваяСтрока.НазначилЗамер = ОбщийМодульСервер.НастройкаПользователя("Сотрудник", ТекущийПользователь);
			НоваяСтрока.НазначилЗамерПользователь = ТекущийПользователь; // №13942
			НоваяСтрока.ДатаНазначенияЗамера = ТекущаяДатаСеанса();

		КонецЕсли;
		// #15439 автор/менеджер при полуении истории
		Если ДанныеЗаполнения.Свойство("Автор") Тогда
        	Автор = ДанныеЗаполнения.Автор;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда 
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты();
		
	Выезды.Очистить();	
	Замеры.Очистить();
	ДополнительныеСвойстваЛида.Очистить();
	ИсторияСтатусов.Очистить();
	
	ПовторныеКонтакты.Очистить();
	Выработка.Очистить();
	
	СпособСоздания = Перечисления.СпособыСозданияЛида.Вручную;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//++ №8495 добавим в проверку заполненности реквизитов обязательные поля из настройки
	ТаблицаОбязательныхПолей = ОбщийМодульСервер.ПолучитьНастройкуОбязательныхПолейКЗаполнениюЛида();
	Для Каждого ТекущаяСтрока Из ТаблицаОбязательныхПолей Цикл
		
		Если НЕ ТекущаяСтрока.Заполнять Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоляПроверки = ТекущаяСтрока.ИмяПоля;
		
		//++ #17179	ниже ПередЗаписью	
		Если ИмяПоляПроверки = "КонтактнаяИнформация.Телефон" ИЛИ ИмяПоляПроверки = "КонтактнаяИнформация.ЭлектроннаяПочта" Тогда			
			Продолжить;
		КонецЕсли;
		//-- #17179
		
		// сначала проверим, вдруг это поле уже обязательно к заполнению
		НайденныйРеквизит = ПроверяемыеРеквизиты.Найти(ИмяПоляПроверки);		
		// если поля нет, добавим в проверку
		Если НайденныйРеквизит = Неопределено Тогда			
			ПроверяемыеРеквизиты.Добавить(ИмяПоляПроверки);			
		КонецЕсли;
		
	КонецЦикла;
	//-- №8495
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	ДополнительныеСвойства.Вставить("ПредыдущийСтатусПроведения",        Ссылка.Проведен);
	ДополнительныеСвойства.Вставить("ПредыдущийАвтор",     				 Ссылка.Автор);
	ДополнительныеСвойства.Вставить("ПредыдущаяДатаСледующегоКонтакта",  Ссылка.ПоследняяДатаПерезвонить);
	ДополнительныеСвойства.Вставить("ПредыдущийАвтор",    				 Ссылка.Автор);
	ДополнительныеСвойства.Вставить("ПредыдущийСтатус",   				 Ссылка.ТекущийСтатус);
	
	Телефоны = "";
	АдресаЭлектроннойПочты = "";
	ТелефоныМассив = Новый Массив;
	ЭлектронныеАдресаМассив = Новый Массив;
	Для каждого СтрокаКонтактнойИнформацииОбъекта из ДополнительнаяКонтактнаяИнформация Цикл
	Если СтрокаКонтактнойИнформацииОбъекта.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон 
			И ТелефоныМассив.Найти(СтрокаКонтактнойИнформацииОбъекта.Представление) = Неопределено Тогда
			ТелефоныМассив.Добавить(СтрокаКонтактнойИнформацииОбъекта.Представление);
		ИначеЕсли СтрокаКонтактнойИнформацииОбъекта.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты 
			И ЭлектронныеАдресаМассив.Найти(СтрокаКонтактнойИнформацииОбъекта.Представление) = Неопределено Тогда
			ЭлектронныеАдресаМассив.Добавить(СтрокаКонтактнойИнформацииОбъекта.Представление);
		КонецЕсли;		
	КонецЦикла;
	
	Если ТелефоныМассив.Количество() > 0 Тогда
		Телефоны = СтрСоединить(ТелефоныМассив, ",");
	КонецЕсли;
	Если ЭлектронныеАдресаМассив.Количество() > 0 Тогда
		АдресаЭлектроннойПочты = СтрСоединить(ЭлектронныеАдресаМассив, ",");
	КонецЕсли;
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ #17179
	ТаблицаОбязательныхПолей = ОбщийМодульСервер.ПолучитьНастройкуОбязательныхПолейКЗаполнениюЛида();
	Для Каждого ТекущаяСтрока Из ТаблицаОбязательныхПолей Цикл		
		Если НЕ ТекущаяСтрока.Заполнять Тогда
			Продолжить;
		КонецЕсли;		
		ИмяПоляПроверки = ТекущаяСтрока.ИмяПоля;				
		Если ИмяПоляПроверки = "КонтактнаяИнформация.Телефон" ИЛИ ИмяПоляПроверки = "КонтактнаяИнформация.ЭлектроннаяПочта" Тогда			
			ШаблонСообщения = "Поле ""%ПредставлениеРеквизита%"" не заполнено";
			
			ВидКИ = ?(ИмяПоляПроверки = "КонтактнаяИнформация.Телефон", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
			ПредставлениеРеквизита = ?(ИмяПоляПроверки = "КонтактнаяИнформация.Телефон", "Телефон", "Электронная почта");
			НС = ДополнительнаяКонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", ВидКИ));
			Если НС.Количество() = 0 Тогда					
				СообщениеОбОшибке = СтрЗаменить(ШаблонСообщения, "%ПредставлениеРеквизита%", ПредставлениеРеквизита);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, , , , Отказ);
			КонецЕсли;			
		КонецЕсли;				
	КонецЦикла;
	//-- #17179
	
	Если ЭтоНовый() Тогда
		
		ДатаИзмененияДанныхКлиента 	= ТекущаяДатаСеанса();
		
		// №9558
		Если НЕ ЗначениеЗаполнено(ПоследняяДатаПерезвонить) Тогда  //#10805
			//#11632
			//ПоследняяДатаПерезвонить 	= Дата;
			//ПоследнееВремяПерезвонить 	= Дата;
			ВремяСдвигаВСекундах = ОбщийМодульСервер.ПолучитьВремяСдвигаДатыСледующегоКонтактаЛида(Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида.ПередЗаписьюЛида);
			НоваяДатаСледующегоКонтакта = Дата + ВремяСдвигаВСекундах;			
			ПоследняяДатаПерезвонить 	= НоваяДатаСледующегоКонтакта;
			//#11632 реквизит ПоследнееВремяПерезвонить удален
			//ПоследнееВремяПерезвонить 	= НоваяДатаСледующегоКонтакта;
		КонецЕсли;
		
	КонецЕсли;
	
	// №9093 проверка заполненности статуса
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ТекущийСтатус.Пустая() Тогда
		Сообщить("Не указан текущий статус лида.");
		Отказ = Истина;
	КонецЕсли;
	
	//#8756 
	КоличествоСтрок = Выезды.Количество();
	Для Индекс = 1 по КоличествоСтрок Цикл
		СтрокаТЧ = Выезды[КоличествоСтрок-Индекс];	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Исполнитель)  
			И НЕ ЗначениеЗаполнено(СтрокаТЧ.ВремяНачала) И НЕ ЗначениеЗаполнено(СтрокаТЧ.ВремяОкончания) Тогда
			Выезды.Удалить(КоличествоСтрок-Индекс);	
		КонецЕсли;
	КонецЦикла;
	КоличествоСтрок = Замеры.Количество();
	Для Индекс = 1 по КоличествоСтрок Цикл
		СтрокаТЧ = Замеры[КоличествоСтрок-Индекс];	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ИсполнительЗамера) И НЕ ЗначениеЗаполнено(СтрокаТЧ.НазначилЗамер)  
			И НЕ ЗначениеЗаполнено(СтрокаТЧ.ВремяНачалаЗамера) И НЕ ЗначениеЗаполнено(СтрокаТЧ.ВремяОкончанияЗамера) Тогда
			Замеры.Удалить(КоличествоСтрок-Индекс);	
		КонецЕсли;
	КонецЦикла;
	
	//проверяем все строки в ТЧ "Замеры" и заполняем ИДЗамера
	Для Каждого ТекСтрока Из Замеры Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ИДЗамера) Тогда
			ТекСтрока.ИДЗамера = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	//проверяем все строки в ТЧ "Выезды" и заполняем ИДЗамера
	Для Каждого ТекСтрока Из Выезды Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ИДЗамера) Тогда
			ТекСтрока.ИДЗамера = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#9710 проверяем пересечение графика	
	Для Каждого ТекСтрока Из Замеры Цикл		
		Если НЕ ТекСтрока.ЗамерВыполнен И НЕ ЗначениеЗаполнено(ТекСтрока.РезультатЗамера) Тогда
			ТекстСообщения = "Время замера %1 пересекается с другими запланированными замерами/выездами";
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ТекСтрока.НомерСтроки);
			
			//Если ТипЗнч(ТекСтрока.ИсполнительЗамера) = Тип("СправочникСсылка.Сотрудники") Тогда					
			//	Если НЕ ТекСтрока.ИсполнительЗамера.НеПроверятьПересечениеЗамеровВГрафике 
			//		И НЕ ОбщийМодуль.ПроверитьСвободныйИнтервалЗамеров(ТекСтрока.ДатаЗамера, ТекСтрока.ИсполнительЗамера, 
			//														   ТекСтрока.ВремяНачалаЗамера, ТекСтрока.ВремяОкончанияЗамера, Ссылка) Тогда
			//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			//	КонецЕсли;
			//КонецЕсли;
			ПараметрыЗамера = Новый Структура("ИдЗамера, ДатаЗамера, ИсполнительЗамера, ВремяНачала, ВремяОкончания", 
												Строка(ТекСтрока.ИДЗамера), ТекСтрока.ДатаЗамера, ТекСтрока.ИсполнительЗамера);
			ПараметрыЗамера.ВремяНачала = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(ТекСтрока.ДатаЗамера, ТекСтрока.ВремяНачалаЗамера); 
			ПараметрыЗамера.ВремяОкончания = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(ТекСтрока.ДатаЗамера, ТекСтрока.ВремяОкончанияЗамера);								
			Результат = МодульОтчетов.ПроверитьСвободныйИнтервалЗамеров(ПараметрыЗамера, ТочкаПродаж);
			Если НЕ Результат Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекСтрока Из Выезды Цикл
		Если НЕ ТекСтрока.Выполнен И НЕ ЗначениеЗаполнено(ТекСтрока.Результат) Тогда
			ТекстСообщения = "Время выезда %1 пересекается с другими запланированными замерами/выездами";
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ТекСтрока.НомерСтроки);
			
			//Если ТипЗнч(ТекСтрока.Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда	
			//	Если НЕ ТекСтрока.Исполнитель.НеПроверятьПересечениеЗамеровВГрафике 
			//		И НЕ ОбщийМодуль.ПроверитьСвободныйИнтервалЗамеров(ТекСтрока.Дата, ТекСтрока.Исполнитель, 
			//														   ТекСтрока.ВремяНачала, ТекСтрока.ВремяОкончания, Ссылка) Тогда
			//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			//	КонецЕсли;
			//КонецЕсли;
			ПараметрыЗамера = Новый Структура("ИдЗамера, ДатаЗамера, ИсполнительЗамера, ВремяНачала, ВремяОкончания", 
												Строка(ТекСтрока.ИДЗамера), ТекСтрока.Дата, ТекСтрока.Исполнитель);
			ПараметрыЗамера.ВремяНачала = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(ТекСтрока.Дата, ТекСтрока.ВремяНачала); 
			ПараметрыЗамера.ВремяОкончания = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(ТекСтрока.Дата, ТекСтрока.ВремяОкончания);									
			Результат = МодульОтчетов.ПроверитьСвободныйИнтервалЗамеров(ПараметрыЗамера, ТочкаПродаж);
			Если НЕ Результат Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// №9558
	Если Не Отказ
		И (ТекущийСтатус = Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера
			ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.ДоговорОформлен
			ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.Отказ
			ИЛИ ТекущийСтатус = Справочники.СтатусыЛида.НеЦелевой)
		И НЕ ТекущийСтатус = Ссылка.ТекущийСтатус
	Тогда
		
		ПоследняяДатаПерезвонить = Дата(1,1,1);
		//#11632 реквизит ПоследнееВремяПерезвонить удален
		//ПоследнееВремяПерезвонить = Дата(1,1,1);
		
	КонецЕсли;
	
	// #9756 проверка на дублирующиеся строки в дополнительных свойствах
	Для Каждого СтрокаТабличнойЧасти Из ДополнительныеСвойстваЛида Цикл
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("Свойство", СтрокаТабличнойЧасти.Свойство);
		РезПоиска = ДополнительныеСвойстваЛида.НайтиСтроки(СтруктураПоиска);
		Если РезПоиска.Количество() > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружено дублирующееся свойство: " + СтрокаТабличнойЧасти.Свойство, , , , Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВходящиеКонтакты
	Движения.ВходящиеКонтакты.Записывать = Истина;
	Движение = Движения.ВходящиеКонтакты.Добавить();
	Движение.Сотрудник = Автор;
	Движение.Дата = Дата;
	Движение.ВидКонтакта = ВидКонтакта;
	Движение.ВходящийКонтакт = Ссылка;
	Движение.РекламныйИсточник = РекламныйИсточник;
	Движение.Результат = ТекущийСтатус;
	
	// регистр КонверсияВходящихКонтактов 
	Движения.КонверсияВходящихКонтактов.Записывать = Истина;
	Движение = Движения.КонверсияВходящихКонтактов.Добавить();
	Движение.Период = Дата;
	Движение.Контакт = Ссылка;
	Движение.РекламныйИсточник = РекламныйИсточник;
	Движение.ТочкаПродаж = ТочкаПродаж;
	Движение.КоличествоЛидов = 1;	
	
	//++ №10986 комментируем, т.к. теперь данные берутся напрямую из регистра "Замеры"
	//Если Замеры.Количество() > 0 Тогда
	//	НомерСтроки = Замеры.Количество()-1;
	//	Движение.КоличествоЗамеровНазначено = 1;
	//	Если Замеры[НомерСтроки].ЗамерВыполнен Тогда
	//		Движение.КоличествоЗамеров = 1;
	//	КонецЕсли;
	//	Если Замеры[НомерСтроки].РезультатЗамера = Справочники.РезультатЗамераЛида.ЗаключенДоговор Тогда
	//		Движение.КоличествоЗамеровУспех = 1;
	//	КонецЕсли;	
	//	Если Замеры[НомерСтроки].РезультатЗамера = Справочники.РезультатЗамераЛида.ДоговорНеЗаключен Тогда
	//		Движение.КоличествоЗамеровОтказ = 1;
	//	КонецЕсли;	
	//	Если Замеры[НомерСтроки].РезультатЗамера = Справочники.РезультатЗамераЛида.ЗамерНеПроизводился Тогда
	//		Движение.КоличествоЗамеровНевыполнен = 1;
	//	КонецЕсли;	
	//	//Если Замеры[НомерСтроки].УДАЛИТЬ_Отменен Тогда
	//	Если Замеры[НомерСтроки].РезультатЗамера = Справочники.РезультатЗамераЛида.ЗамерОтменен Тогда
	//		Движение.КоличествоЗамеровОтменен = 1;
	//	КонецЕсли;	
	//КонецЕсли;
	//-- №10986
	
	ТелефонКлиентаПоУмолчанию = УправлениеКонтактнойИнформациейПотолки.ПолучитьТелефонИзКонтактнойИнформацииОбъекта(ЭтотОбъект);
	
	//регистр Замеры - Замеры
	Движения.Замеры.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из Замеры Цикл
		Если НЕ ТекущаяСтрока.ДатаЗамера = Дата(1,1,1) Тогда // И НЕ ТекущаяСтрока.УДАЛИТЬ_Отменен Тогда			
			Попытка
				Движение = Движения.Замеры.Добавить();
				Движение.Дата = ТекущаяСтрока.ДатаЗамера;
				Движение.Сотрудник = ТекущаяСтрока.ИсполнительЗамера;
				Движение.ВремяНачала = ТекущаяСтрока.ВремяНачалаЗамера;
				Движение.ВремяОкончания = ТекущаяСтрока.ВремяОкончанияЗамера;
				Движение.Замер = Ссылка;
				Движение.ИмяКлиента = ИмяКлиента;
				Движение.ТелефонКлиента = ТелефонКлиентаПоУмолчанию;
				Движение.Адрес = Адрес;
				Движение.Результат = ТекущаяСтрока.РезультатЗамера;
				Движение.ЗамерВыполнен = ТекущаяСтрока.ЗамерВыполнен;
				Движение.СуммаДоговора = ТекущаяСтрока.СуммаДоговораНаЗамере;
				Движение.Комментарий = ТекущаяСтрока.КомментарийКЗамеру;
				Движение.ДокументЗамер = Ссылка;
				Движение.КомментарийЗамерщика = ТекущаяСтрока.КомментарийЗамерщика;
				Движение.ТочкаПродаж = ТочкаПродаж;
				Движение.Город = Город;
				Движение.ИДЗамера = ТекущаяСтрока.ИДЗамера;
				Движение.ИдентификаторСтрокой = Строка(ТекущаяСтрока.ИДЗамера);
				Движение.ДатаНазначенияЗамера = ТекущаяСтрока.ДатаНазначенияЗамера;
				//++ №6952 новое измерение и ресурс
				Движение.НазначилЗамер = ТекущаяСтрока.НазначилЗамер;
				Движение.НазначилЗамерПользователь = ТекущаяСтрока.НазначилЗамерПользователь; // №13942
				Движение.ПричинаОтказа = ТекущаяСтрока.ПричинаОтказа;
				//-- №6952
				Движение.Геометка = Геометка;
			Исключение
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	//регистр Замеры - Выезды
	Для Каждого ТекущаяСтрока Из Выезды Цикл
		Если НЕ ТекущаяСтрока.Дата = Дата(1,1,1) Тогда			
			Попытка
				Движение = Движения.Замеры.Добавить();
				Движение.Дата = ТекущаяСтрока.Дата;
				Движение.Сотрудник = ТекущаяСтрока.Исполнитель;
				Движение.ВремяНачала = ТекущаяСтрока.ВремяНачала;
				Движение.ВремяОкончания = ТекущаяСтрока.ВремяОкончания;
				Движение.Замер = Ссылка;
				Движение.ИмяКлиента = ИмяКлиента;
				Движение.ТелефонКлиента = ТелефонКлиентаПоУмолчанию;
				Движение.Адрес = ?(АдресВыездаОтличаетсяОтАдресаЛида, АдресВыезда, Адрес); // №9853 адрес зависит от галочки, было: Движение.Адрес = ?(ПустаяСтрока(АдресВыезда), Адрес, АдресВыезда);
				Движение.ЗамерВыполнен = ТекущаяСтрока.Выполнен;				
				Движение.ДокументЗамер = Ссылка;
				Движение.ТочкаПродаж = ТочкаПродаж;
				Движение.ЭтоВыезд = Истина;
				Движение.Город = ?(АдресВыездаОтличаетсяОтАдресаЛида, ГородВыезда, Город); // №9853 город зависит от галочки, было: Движение.Город = Город;
				Движение.ИДЗамера = ТекущаяСтрока.ИДЗамера;
				Движение.ИдентификаторСтрокой = Строка(ТекущаяСтрока.ИДЗамера);
				Движение.Комментарий = ТекущаяСтрока.КомментарийКВыезду;
				Движение.КомментарийЗамерщика = ТекущаяСтрока.КомментарийЗамерщика;
				Движение.НазначилЗамер = ТекущаяСтрока.Назначил; //#5147
				Движение.НазначилЗамерПользователь = ТекущаяСтрока.НазначилПользователь; // №13942
				Движение.Геометка = ?(АдресВыездаОтличаетсяОтАдресаЛида, ГеометкаВыезда, Геометка);
				//++ №14649
				Движение.Результат = ТекущаяСтрока.Результат;
				Движение.ДатаНазначенияЗамера = ТекущаяСтрока.ДатаНазначения;
				//-- №14649
			Исключение
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	//регистр история статусов
	Движения.ИсторияСтатусовЛидов.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из ИсторияСтатусов Цикл
		Попытка
			Движение = Движения.ИсторияСтатусовЛидов.Добавить();
			Движение.Дата = ТекущаяСтрока.Дата;
			Движение.Статус = ТекущаяСтрока.Статус;
			Движение.Лид = Ссылка;
		Исключение
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
	//регистр ВыработкаИсполнителейРозницы
	Движения.ВыработкаИсполнителейРозницы.Записывать = Истина;
	
	Если РучнаяКорректировкаВыработки Тогда // №1083 теперь доступно ручное изменение зарплаты
		НаборЗаписейПоВыработке = Выработка.Выгрузить();
		ДополнитьТаблицуВыработки(НаборЗаписейПоВыработке);
	Иначе
		НаборЗаписейПоВыработке = Зарплата.РассчитатьВыработкуПоДокументу(Ссылка);
	КонецЕсли;
	
	Для Каждого СтрокаВыработки Из НаборЗаписейПоВыработке Цикл
		Если НЕ СтрокаВыработки.Стоимость = 0 Тогда
			Движение = Движения.ВыработкаИсполнителейРозницы.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаВыработки);
		КонецЕсли;
	КонецЦикла;
	
	//если нужно, поставим лид в очередь на выгрузку в ройстат
	Если Константы.ИспользуетсяИнтеграцияСРойстат.Получить() Тогда
		НаборЗаписей = РегистрыСведений.ЛидыДляВыгрузкиВРойстат.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Лид.Установить(Ссылка); 
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Лид = Ссылка;
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	//++ #16089
	Если ДополнительныеСвойства.ЭтоНовый
		ИЛИ (НЕ ДополнительныеСвойства.ЭтоНовый
			 И НЕ ДополнительныеСвойства.ПредыдущийАвтор = Автор)
		ИЛИ (НЕ ДополнительныеСвойства.ЭтоНовый
			 И НЕ ДополнительныеСвойства.ПредыдущийСтатус = ТекущийСтатус)
		ИЛИ (НЕ ДополнительныеСвойства.ЭтоНовый
			 И НЕ ДополнительныеСвойства.ПредыдущаяДатаСледующегоКонтакта = ПоследняяДатаПерезвонить)
		ИЛИ (НЕ ДополнительныеСвойства.ЭтоНовый
			 И НЕ ДополнительныеСвойства.ПредыдущийСтатусПроведения = Проведен)
		Тогда
		
		ПараметрыЗадания = ОбщийМодульСервер.ПараметрыЗаданияРасчетаКоличестваСтатусаЛидов(ДополнительныеСвойства.ЭтоНовый, 
																		 ДополнительныеСвойства.ПредыдущийАвтор, Автор,
																		 ДополнительныеСвойства.ПредыдущийСтатус, ТекущийСтатус,
																		 ДополнительныеСвойства.ПредыдущаяДатаСледующегоКонтакта, ПоследняяДатаПерезвонить);
		ОбщийМодульСервер.ПроверитьЗапуститьФоновоеЗаданиеРасчетаКоличестваЛидов(ПараметрыЗадания);
	КонецЕсли;
	//-- #16089

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		ПланыОбмена.Портал.ЗарегистрироватьОбъектКОбмену(Ссылка);
		ОбменСБитрикс24ВызовСервера.ЗарегистрироватьОбъектКОбмену(ЭтотОбъект);
		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	ИспользоватьОтправкуСМС = РаботаССМС.ИспользоватьОтправкуСМС();
	СМСОтправлятьЗамерщикуПриПланированииЗамера = ИспользоватьОтправкуСМС И Константы.ОтправлятьСМСЗамерщикуПриПланированииЗамера.Получить();
	СМСОтправлятьКлиентуПриПланированииЗамера   = ИспользоватьОтправкуСМС И Константы.ОтправлятьСМСКлиентуПриПланированииЗамера.Получить();
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	//#13943
	Если Константы.СпособЗаполненияМенеджераВЛиде.Получить() = Перечисления.ВариантыЗаполненияМенеджера.ЗаполнятьСотрудникомПользователя 
		И ЗначениеЗаполнено(Автор) Тогда
		Менеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Автор, "Сотрудник");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ДополнитьТаблицуВыработки(ТаблицаПоВыработке)
	
	ТаблицаПоВыработке.Колонки.Добавить("Период");
	ТаблицаПоВыработке.Колонки.Добавить("Регистратор");
	ТаблицаПоВыработке.Колонки.Добавить("ОбъектВыработки");
	
	ТаблицаПоВыработке.ЗаполнитьЗначения(?(Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Дата), "Период");
	ТаблицаПоВыработке.ЗаполнитьЗначения(Ссылка, "Регистратор");
	ТаблицаПоВыработке.ЗаполнитьЗначения(Ссылка, "ОбъектВыработки");
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли