#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Счет на оплату
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ЗаказПокупателя";
    КомандаПечати.Идентификатор = "СчетНаОплату";
    КомандаПечати.Представление = НСтр("ru = 'Счет на оплату'");
    //КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Счет на оплату'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаВыбора"; // чтобы не выводилось в АРМ
	
	// Счет на оплату (с печатью и подписями) 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ЗаказПокупателя";
	КомандаПечати.Идентификатор  = "СчетНаОплатуСПечатью";
	КомандаПечати.Представление  = НСтр("ru = 'Счет на оплату (с печатью и подписями) '");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Счет на оплату'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаВыбора";

	Если ПолучитьФункциональнуюОпцию("ДополнительнаяОценкаЗапасовВВалюте") Тогда
		//Счет на оплату (вал)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ЗаказПокупателя";
		КомандаПечати.Идентификатор = "СчетНаОплатуВал";
		КомандаПечати.Представление = НСтр("ru = 'Счет на оплату (вал.)'");
		//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
		КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Счет на оплату (вал.)'");
		КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаВыбора";
		
		// Счет на оплату (с печатью и подписями) (вал) 
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ЗаказПокупателя";
		КомандаПечати.Идентификатор  = "СчетНаОплатуСПечатьюВал";
		КомандаПечати.Представление  = НСтр("ru = 'Счет на оплату (с печатью и подписями) (вал.)'"); 
		КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Счет на оплату (вал.)'");
		КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаВыбора";
	КонецЕсли;

	//Товарная накладная с весом
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати 	= "Документ.ЗаказПокупателя";
    КомандаПечати.Идентификатор 	= "ЗаказПокупателя";
    КомандаПечати.Представление 	= НСтр("ru = 'Заказ покупателя'");
    //КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы 	= НСтр("ru = 'Заказ покупателя'");
	
	//Упаковка
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати 	= "Документ.ЗаказПокупателя";
    КомандаПечати.Идентификатор 	= "Упаковка";
    КомандаПечати.Представление 	= НСтр("ru = 'Упаковка'");
    //КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы 	= НСтр("ru = 'Упаковка'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаВыбора";
	
	//
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати 	= "Документ.ЗаказПокупателя";
    КомандаПечати.Идентификатор 	= "ЗаказПокупателяСводно";
    КомандаПечати.Представление 	= НСтр("ru = 'Заказы сводно'"); 
	КомандаПечати.СписокФорм = "АРМПроизводства";
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаказПокупателя") Тогда
         УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        														КоллекцияПечатныхФорм,
        														"ЗаказПокупателя",
        														НСтр("ru = 'Заказ покупателя'"),
        														ПечатьЗаказПокупателя(МассивОбъектов, ОбъектыПечати),
        														,
        														"Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя");
	КонецЕсли;
															
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаказПокупателяСводно") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        	КоллекцияПечатныхФорм,
        	"ЗаказПокупателяСводно",
        	НСтр("ru = 'ЗаказПокупателяСводно'"),
        	СформироватьПечатнуюФормуЗаказаПокупателяСводно(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Упаковка") Тогда
         УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        														КоллекцияПечатныхФорм,
        														"Упаковка",
        														НСтр("ru = 'Упаковка'"),
        														ПечатьУпаковка(МассивОбъектов, ОбъектыПечати, Ложь),
       															,
        														"Документ.ЗаказПокупателя.ПФ_MXL_Упаковка");
	КонецЕсли;
															
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплату") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "СчетНаОплату",
        НСтр("ru = 'Счет на оплату'"),
        ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплатуСПечатью") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "СчетНаОплатуСПечатью",
        НСтр("ru = 'Счет на оплату (с печатью и подписями)'"),
        ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, Истина));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплатуВал") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "СчетНаОплатуВал",
        НСтр("ru = 'Счет на оплату (вал.)'"),
        ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, , Истина));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплатуСПечатьюВал") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "СчетНаОплатуСПечатьюВал",
        НСтр("ru = 'Счет на оплату (с печатью и подписями) (вал.)'"),
        ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, Истина, Истина));
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	""01.01.0001"" КАК Дата,
	|	ДанныеДокумента.АдресМонтажа КАК АдресМонтажа,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.ВидЦен КАК ВидЦен,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Организация.ПолноеНаименование = """"
	|			ТОГДА ДанныеДокумента.Организация.ПолноеНаименование
	|		ИНАЧЕ ДанныеДокумента.Организация.Наименование
	|	КОНЕЦ КАК ПредставлениеОрганизации,
	|	ДанныеДокумента.Склад КАК Склад,
	|	ДанныеДокумента.БанковскийСчет КАК БанковскийСчет,
	|	ДанныеДокумента.БанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
	|	ДанныеДокумента.БанковскийСчет.БИК КАК БанковскийСчетБИК,
	|	ДанныеДокумента.БанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
	|	ДанныеДокумента.БанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
	|	ДанныеДокумента.ИнтернетОплатаСсылка КАК ИнтернетОплатаСсылка,
	|	ДанныеДокумента.ИнтернетОплатаНомерТелефонаПлательщика КАК ИнтернетОплатаНомерТелефонаПлательщика,
	|	ДанныеДокумента.ИнтернетОплатаЭлектроннаяПочтаПлательщика КАК ИнтернетОплатаЭлектроннаяПочтаПлательщика,
	|	ДанныеДокумента.Организация.ИНН КАК ИНН,
	|	ДанныеДокумента.Организация.КПП КАК КПП,
	|	ДанныеДокумента.Организация.Руководитель КАК ОрганизацияРуководитель,
	|	ДанныеДокумента.Организация.ГлавныйБухгалтер КАК ОрганизацияГлавныйБухгалтер,
	|	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
	|	ДанныеДокумента.Организация.ЯвляетсяПлательщикомНДС КАК ОрганизацияЯвляетсяПлательщикомНДС,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.СуммаБонусовКСписаниюПоДисконтнойКарте КАК СуммаБонусовКСписанию,
	|	""текст расшифровки НДС"" КАК НДС,
	|	0 КАК ИтогоСуммаНДС,
	|	0 КАК ИтогоСуммаБезНДС,
	|	0 КАК СуммаРучнойСкидки,
	|	0 КАК Скидка,
	|	0 КАК ИтогоВес,
	|	0 КАК Вес,
	|	0 КАК Сумма,
	|	0 КАК КолвоПозиций,
	|	ДанныеДокумента.Примечание КАК Примечание
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.АдресМонтажа КАК АдресМонтажа,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.ЦенаВал КАК ЦенаВал,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ДанныеДокумента.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	
	// #15133 добавлен учет бонусов
	//|	ДанныеДокумента.СуммаРучнойСкидки КАК РучнаяСкидка,
	//|	ДанныеДокумента.Сумма + ДанныеДокумента.СуммаРучнойСкидки КАК СуммаБезСкидки,
	|	ДанныеДокумента.СуммаРучнойСкидки + ДанныеДокумента.СкидкаБонусами КАК Скидка,
	|	ДанныеДокумента.СкидкаБонусами КАК СкидкаБонусами,
	|	ДанныеДокумента.Сумма + ДанныеДокумента.СуммаРучнойСкидки + ДанныеДокумента.СкидкаБонусами КАК СуммаБезСкидки,
	
	|	ДанныеДокумента.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ДанныеДокумента.НомерУпаковки КАК НомерУпаковки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерений)
	|			ТОГДА ДанныеДокумента.ЕдиницаИзмерения.Вес * ДанныеДокумента.Количество
	|		ИНАЧЕ ДанныеДокумента.Номенклатура.Вес * ДанныеДокумента.Количество
	|	КОНЕЦ КАК Вес,
	|	ДанныеДокумента.Потолок КАК Потолок,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ
	|	КОЛИЧЕСТВО(НомерСтроки),
	|	СУММА(Сумма),
	|	СУММА(СуммаРучнойСкидки),
	|	СУММА(Скидка),
	|	СУММА(Вес),
	|	СУММА(СуммаНДС)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка
	|ИТОГИ ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиТовары = МассивРезультатов[1];
	РезультатПоНомерамУпаковки      = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары, РезультатПоНомерамУпаковки",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиТовары, РезультатПоНомерамУпаковки);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам=Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	РезультатЗапроса.Колонки.Добавить("РасширенноеПредставлениеОрганизации");
	РезультатЗапроса.Колонки.Добавить("РасширенноеПредставлениеКонтрагента");
	
	РезультатЗапроса.Колонки.Добавить("ВремяФормированияПФ");
	РезультатЗапроса.Колонки.Добавить("ВалютаУчета");
	РезультатЗапроса.Колонки.Добавить("ТекущийДолг"); 
	РезультатЗапроса.Колонки.Добавить("ОстатокПоЗаказам");	

	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента, "ДЛФ=Д");		
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
		
		Если НЕ ВыборкаПоТоварам = Неопределено Тогда
			СтруктураПоиска = Новый Структура("Ссылка", ТекущаяСтрока.Ссылка);
			ВыборкаПоТоварам.Сбросить();
			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда
				ТекущаяСтрока.СуммаРучнойСкидки = ВыборкаПоТоварам.СуммаРучнойСкидки;
				ТекущаяСтрока.Скидка = ВыборкаПоТоварам.Скидка;
				ТекущаяСтрока.ИтогоВес = ВыборкаПоТоварам.Вес;
				ТекущаяСтрока.Вес = ВыборкаПоТоварам.Вес;
				ТекущаяСтрока.ИтогоСуммаНДС = ВыборкаПоТоварам.СуммаНДС;
				ТекущаяСтрока.ИтогоСуммаБезНДС = ВыборкаПоТоварам.Сумма - ВыборкаПоТоварам.СуммаНДС;
				ТекущаяСтрока.Сумма = ВыборкаПоТоварам.Сумма;	
				ТекущаяСтрока.КолвоПозиций = ВыборкаПоТоварам.НомерСтроки;
			КонецЕсли;						
		КонецЕсли;
		
		Если ТекущаяСтрока.ИтогоСуммаНДС = 0 Тогда			
			ТекущаяСтрока.НДС = "Без налога (НДС)";		
		Иначе			
			ТекущаяСтрока.НДС = "В том числе НДС:";	
		КонецЕсли;
		
		СведенияОбОрганизации = ОбщийМодульСервер.СведенияОбОрганизации(ТекущаяСтрока.Организация, ТекущаяСтрока.ДатаДокумента);
		СведенияОКонтрагенте  = ОбщийМодульСервер.СведенияОКонтрагенте(ТекущаяСтрока.Контрагент, ТекущаяСтрока.ДатаДокумента);
		
		Сведения = "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны";
		ТекущаяСтрока.РасширенноеПредставлениеОрганизации = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОбОрганизации, Сведения);
		ТекущаяСтрока.РасширенноеПредставлениеКонтрагента = ОбщийМодульСервер.ОписаниеОрганизации(СведенияОКонтрагенте, Сведения);
		
		//#13516
		ТекущаяСтрока.ВремяФормированияПФ = ТекущаяДатаСеанса();
		ТекущаяСтрока.ВалютаУчета = Константы.ВалютаУчета.Получить().Наименование;
		// в валюте учета
		ТекущаяСтрока.ТекущийДолг = ОбщийМодульСервер.ПолучитьТекущийДолгКлиента(ТекущаяСтрока.ВремяФормированияПФ, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент, ТекущаяСтрока.ДоговорКонтрагента);
		ТекущаяСтрока.ОстатокПоЗаказам = ОбщийМодульСервер.ПолучитьОстатокПоЗаказамПокупателей(ТекущаяСтрока.ВремяФормированияПФ, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);

		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);
	КонецЦикла;		
	
КонецПроцедуры

Функция ПечатьЗаказПокупателя(МассивОбъектов, ОбъектыПечати = Неопределено) Экспорт
    
    ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ТоварнаяНакладнаяСВесом";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя");
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
	
	// Изменения размера колоноки, в зависимости от вывода Артикула
	Если Не ВыводитьАртикул Тогда
		Попытка
			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		Исключение
		КонецПопытки;
	КонецЕсли;
		
    ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСкидка = ДанныеПечати.СуммаРучнойСкидки > 0;		
		ЕстьБонусы = ДанныеПечати.СуммаБонусовКСписанию > 0;		
		
		ВставкаСкидок = ?(ЕстьСкидка, "Скидка","");
		ВставкаСкидок = ?(ЕстьБонусы, ВставкаСкидок+"Бонус", ВставкаСкидок);
		
		ТекстЗаголовка = "Заказ покупателя №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD");
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка				
				ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			Исключение
			КонецПопытки;
			
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
				ТабличныйДокумент,
				Макет,
				ОбластьМакета,
				ДанныеПечати.Ссылка);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//#13343 
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//#13343 
		Если ЗначениеЗаполнено(ДанныеПечати.АдресМонтажа) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("АдресМонтажа");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		//// Изменения размера колоноки, в зависимости от вывода Артикула
		//Если Не ВыводитьАртикул Тогда
		//	Попытка
		//		Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		//	Исключение
		//	КонецПопытки;
		//КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
				
		Исключение
		КонецПопытки;
		
		// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату
		ВариантФормированияПФЗаказаПокупателя = Константы.ВариантФормированияПФЗаказаПокупателя.Получить();
		
		МассивДопРеквизитов = Новый Массив;
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Артикул", 			Новый ОписаниеТипов("Строка")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Вес", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Скидка", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "СуммаБезСкидки", 		Новый ОписаниеТипов("Число")));
		
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ВидНоменклатуры", 	Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЕстьПотолок", 		Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЭтоПотолок", 			Новый ОписаниеТипов("Булево")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "НомерСтрокиПотолка", 	Новый ОписаниеТипов("Число")));

		ТаблицаТоварыИУслуги = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("ЗаказПокупателя", "Товары", МассивДопРеквизитов);
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		
		СоответствиеНомеровСтрокПотолков = Новый Соответствие;
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока = ТаблицаТоварыИУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
				
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 1;
					ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
					СоответствиеНомеровСтрокПотолков.Вставить(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.НомерСтрокиПотолка);
					ТекущаяСтрока.ЭтоПотолок = Истина;
					
				ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 3;
				Иначе
					ТекущаяСтрока.ВидНоменклатуры = 2;
				КонецЕсли;
				Если ТекущаяСтрока.Потолок.Пустая() Тогда
					ТекущаяСтрока.ЕстьПотолок = 2;
				Иначе
					ТекущаяСтрока.ЕстьПотолок = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		
		Если ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4 Тогда
			Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
				Если НЕ СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок) = Неопределено Тогда
					ТекущаяСтрока.НомерСтрокиПотолка = СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок);
				Иначе
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//0. Потолок - товар - услуга - потолок - товар - услуга
		//4. Потолок - товар - услуга - ПОДЫТОГ - потолок - товар - услуга - ПОДЫТОГ
		//1. Потолок, Потолок, Товары, Товары, услуги, услуги
		//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются)
		//3. Без сортировки
		Если ВариантФормированияПФЗаказаПокупателя = 0 Тогда
			//#11059
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 4 Тогда			
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 1 Тогда
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 2 Тогда
			ТаблицаТоварыИУслуги.Свернуть("АдресМонтажа, Артикул, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, СуммаРучнойСкидки, ВидНоменклатуры", "Вес, Количество, Сумма");
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 3 Тогда	
			//не сортируем
		КонецЕсли;
		
		ИтогоВес = 0;
		Сумма = 0;
		НомерСтроки = 1;
		
		СуммаПодытог = 0;
		ВесПодытог = 0;
		
		ТекНомерСтрокиПотолка = 1;
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл //Шапка.Товары Цикл
			Попытка
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|НомерСтроки");
				
				ОбластьМакета.Параметры.Заполнить(Товары);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Артикул");
					ОбластьМакета.Параметры.Заполнить(Товары);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Данные");
				ОбластьМакета.Параметры.Заполнить(Товары);
				
				//++ №12909
				//ПредставлениеНоменклатуры = Строка(Товары.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Товары.ХарактеристикаНоменклатуры));
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Товары.Номенклатура, Товары.ХарактеристикаНоменклатуры);
				//-- №12909
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И НЕ Товары.ЭтоПотолок 
					И Товары.ЕстьПотолок = 1 Тогда
					ПредставлениеНоменклатуры = "    " + ПредставлениеНоменклатуры;	
				КонецЕсли;
				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И Товары.ВидНоменклатуры = 1 Тогда
					//ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,4,1,4);
					ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
					ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
					ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
				КонецЕсли;

				//Вес = Товары.Вес * Товары.Количество;
				//Попытка
				//	ОбластьМакета.Параметры.Вес = Вес;
				//Исключение
				//КонецПопытки;
								
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				НомерСтроки = НомерСтроки + 1;

				ИтогоВес = ИтогоВес + Товары.Вес;
				Сумма = Сумма + Товары.Сумма;
			Исключение
			КонецПопытки;
			
			Если ВариантФормированияПФЗаказаПокупателя = 4 Тогда
				ТребуетсяВыводПодытога = Ложь;
				Если Товары.ЕстьПотолок = 1 Тогда
					Если ТаблицаТоварыИУслуги.Индекс(Товары)+1 = ТаблицаТоварыИУслуги.Количество() Тогда // последняя строка
						ТребуетсяВыводПодытога = Истина;
					Иначе
						СледующаяСТрокаТЗ = ТаблицаТоварыИУслуги[ТаблицаТоварыИУслуги.Индекс(Товары)+1];
						Если НЕ СледующаяСТрокаТЗ.НомерСтрокиПотолка = Товары.НомерСтрокиПотолка Тогда
							ТребуетсяВыводПодытога = Истина;
							ТекНомерСтрокиПотолка = СледующаяСТрокаТЗ.НомерСтрокиПотолка;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ВесПодытог   = ВесПодытог + Товары.Вес;
				СуммаПодытог = СуммаПодытог + Товары.Сумма;
					
				Если ТребуетсяВыводПодытога Тогда
					
					Попытка
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|НомерСтроки");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Если ВыводитьАртикул Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Артикул");
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(Товары);
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;	
						
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Данные");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ОбластьМакета.Параметры.Сумма = СуммаПодытог;
						ОбластьМакета.Параметры.Вес   = ВесПодытог;
						ТабличныйДокумент.Присоединить(ОбластьМакета);
						
					Исключение
					КонецПопытки;
					
					СуммаПодытог = 0;
					ВесПодытог = 0;
				Иначе
					//ВесПодытог   = ВесПодытог + Вес;
					//СуммаПодытог = СуммаПодытог + Товары.Сумма;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ПрефиксОбласти = ?(ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС, "ИтогоНДС", "Итого");
			  
		Попытка
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|НомерСтроки"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|НомерСтроки"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Артикул"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Артикул"));
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Данные"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Данные"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				Если ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС И ДанныеПечати.ИтогоСуммаНДС = 0 Тогда			
					ОбластьМакета.Параметры.ИтогоСуммаНДС = "-";
				КонецЕсли;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка 
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВсегоИПрописью");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				ОбластьМакета.Параметры.СуммаДокументаПрописью = 
					РаботаСВалютой.СформироватьЧислоПрописьюВсп(ДанныеПечати.СуммаДокумента, ДанныеПечати.Валюта, "Л=ru_RU;ДП=Ложь");
			Исключение
			КонецПопытки;		
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		// #13343 		
		Если ЗначениеЗаполнено(ДанныеПечати.Примечание) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Примечание");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
		Если НЕ ОбъектыПечати = Неопределено Тогда
	        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
	            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		КонецЕсли;	
    КонецЦикла;
    Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуЗаказаПокупателяСводно(МассивОбъектов, ОбъектыПечати) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Контрагент КАК Контрагент
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() > 1 Тогда
		ВызватьИсключение "Контрагенты в выделенных документах различаются, печать сводной таблицы невозможна.";	
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати 	= "ПараметрыПечати_ЗаказПокупателя_Сводно";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя");
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ШапкаОрганизация = "";
	ШапкаПредставлениеКонтрагента = "";
	Если ТаблицаДанныеПечати.Количество() > 0 Тогда
		 ШапкаОрганизация = ТаблицаДанныеПечати[0].Организация;
	     ШапкаПредставлениеКонтрагента = ТаблицаДанныеПечати[0].ПредставлениеКонтрагента;
	 КонецЕсли;
	 
	ИтогоСумма = 0;
	
	Попытка
		ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
		ТекстЗаголовка = "Заказы покупателей";
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьОрганизация 	= Макет.ПолучитьОбласть("Организация");
		ОбластьОрганизация.Параметры.РасширенноеПредставлениеОрганизации = ШапкаОрганизация; // №12321 было: ОбластьОрганизация.Параметры.Организация = ШапкаОрганизация;
		ТабличныйДокумент.Вывести(ОбластьОрганизация);
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьКонтрагент 	= Макет.ПолучитьОбласть("Покупатель");
		ОбластьКонтрагент.Параметры.РасширенноеПредставлениеКонтрагента = ШапкаПредставлениеКонтрагента; // №12321 было: ОбластьКонтрагент.Параметры.ПредставлениеКонтрагента = ШапкаПредставлениеКонтрагента;
		ТабличныйДокумент.Вывести(ОбластьКонтрагент);
	Исключение
	КонецПопытки;
	
	// Изменения размера колоноки, в зависимости от вывода Артикула
	Если Не ВыводитьАртикул Тогда
		Попытка
			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Если ВыводитьАртикул Тогда
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
		ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицы);
	КонецЕсли;	
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицы);
	
	Для каждого ДанныеПечати из ТаблицаДанныеПечати Цикл
		
		Попытка 
			НомерЧисло = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер);
		Исключение
			НомерЧисло = ДанныеПечати.Номер;
		КонецПопытки;
		
		ОбластьСтрокаСводно = Макет.ПолучитьОбласть("СтрокаСводно|НомерСтроки");
		ОбластьСтрокаСводно.Параметры.Заполнить(ДанныеПечати);
		Попытка 
			ОбластьСтрокаСводно.Параметры.Номер = НомерЧисло;
			ОбластьСтрокаСводно.Параметры.ДатаФормат = Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=D");
		Исключение
		КонецПопытки;
		ТабличныйДокумент.Вывести(ОбластьСтрокаСводно);
		
		Если ВыводитьАртикул Тогда
			ОбластьСтрокаСводно = Макет.ПолучитьОбласть("СтрокаСводно|Артикул");
			ОбластьСтрокаСводно.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьСтрокаСводно);
		КонецЕсли;
		
		ОбластьСтрокаСводно = Макет.ПолучитьОбласть("СтрокаСводно|Данные");
		ОбластьСтрокаСводно.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьСтрокаСводно);
				
		ИтогоСумма = ИтогоСумма + ДанныеПечати.СуммаДокумента;
		НомерСтроки = 1;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл				
				
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка|НомерСтроки");
				ОбластьСтрока.Параметры.Заполнить(Выборка);
				ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				Если ВыводитьАртикул Тогда
					ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Артикул");
					ОбластьСтрока.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Присоединить(ОбластьСтрока);
				КонецЕсли;
				
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Данные");
				ОбластьСтрока.Параметры.Заполнить(Выборка);
				ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(ОбщийМодульСервер.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
				ОбластьСтрока.Параметры.Номенклатура = ПредставлениеНоменклатуры;
				
				Попытка
					Вес = Выборка.Вес * Выборка.Количество;
					ОбластьСтрока.Параметры.Вес = Вес;
				Исключение
				КонецПопытки;
				ТабличныйДокумент.Присоединить(ОбластьСтрока);
				
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
	
	Попытка
		ОбластьИтогоСводно = Макет.ПолучитьОбласть("ИтогоСводно|НомерСтроки");
		ОбластьИтогоСводно.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьИтогоСводно);
		
		Если ВыводитьАртикул Тогда
			ОбластьИтогоСводно = Макет.ПолучитьОбласть("ИтогоСводно|Артикул");
			ОбластьИтогоСводно.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьИтогоСводно);
		КонецЕсли;
		
		ОбластьИтогоСводно = Макет.ПолучитьОбласть("ИтогоСводно|Данные");
		ОбластьИтогоСводно.Параметры.Заполнить(ДанныеПечати);
		ОбластьИтогоСводно.Параметры.ИтогоСумма = ИтогоСумма;
		ТабличныйДокумент.Присоединить(ОбластьИтогоСводно);
		
	Исключение	
	КонецПопытки;
		
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//особенность этой формы в том, что она печатает на каждый номер упаковки из табличной части "Товаров" отдельную страницу
Функция ПечатьУпаковка(МассивОбъектов, ОбъектыПечати, СПечатью)
	
    // Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Упаковка";
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.ПФ_MXL_Упаковка");
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоУпаковкам = СтруктураДанныхДляПечати.РезультатПоНомерамУпаковки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);	
	
    ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.ПФ_MXL_Упаковка");
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоУпаковкам.Сбросить();
		Если ВыборкаПоУпаковкам.НайтиСледующий(СтруктураПоиска) Тогда			
			ВыборкаПоНомерамУпаковки = ВыборкаПоУпаковкам.Выбрать();			
			Пока ВыборкаПоНомерамУпаковки.Следующий() Цикл
				Если ВыборкаПоНомерамУпаковки.НомерУпаковки = 0 Тогда
					Продолжить;
				КонецЕсли;
		
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Изменения размера колоноки, в зависимости от вывода Артикула
				Если Не ВыводитьАртикул Тогда
					Попытка
						Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
					Исключение
					КонецПопытки;
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;	
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				НомерСтроки  = 1;
				СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
				ВыборкаПоТоварам.Сбросить();
				Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
					Выборка = ВыборкаПоТоварам.Выбрать();			
					Пока Выборка.Следующий() Цикл				
				
						Если НЕ Выборка.НомерУпаковки = ВыборкаПоНомерамУпаковки.НомерУпаковки Тогда
							Продолжить;
						КонецЕсли;
					
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Если ВыводитьАртикул Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(Выборка);
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;
						
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);						
						Попытка
							ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(ОбщийМодульСервер.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));						
						Исключение
							ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура);
						КонецПопытки;
						ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
						
						ЦветФактура = Справочники.Номенклатура.ПолучитьОсновнуюФактуруИЦветПотолка(Выборка.Номенклатура);
						ОбластьМакета.Параметры.ШиринаПолотна = ЦветФактура.ПродукцияФактура.ШиринаПолотна / 100;
						Если НЕ ОбластьМакета.Параметры.ШиринаПолотна = 0 Тогда
							ОбластьМакета.Параметры.ДлинаПолотна = Выборка.Количество / ОбластьМакета.Параметры.ШиринаПолотна;
						КонецЕсли;
						
						ТабличныйДокумент.Присоединить(ОбластьМакета);
						НомерСтроки = НомерСтроки + 1;
					КонецЦикла;
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЦикла;
		КонецЕсли;
				
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
    КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, СПечатью = Ложь, ВВалюте = Ложь)
	
	Возврат ОбщийМодульСервер.ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, СПечатью, ВВалюте);
	
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати 	= "ПараметрыПечати_ЗаказПокупателя_СчетНаОплату";
	//ТабличныйДокумент.АвтоМасштаб			= Истина;
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.ПФ_MXL_СчетНаОплату");
	//ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	//
	//Запрос = Новый Запрос();
	//Запрос.Текст = ПолучитьТекстЗапроса();
	//Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	//
	////подготовим итоговую таблицу с данными
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	//
	//Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
	//	ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента,"ДЛФ=Д");
	//	Попытка
	//		ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
	//	Исключение
	//	КонецПопытки;
	//	ТекущаяСтрока.ИтогоСуммаНДС = ТекущаяСтрока.Товары.Итог("СуммаНДС");
	//	ТекущаяСтрока.ИтогоСуммаБезНДС = ТекущаяСтрока.СуммаДокумента - ТекущаяСтрока.ИтогоСуммаНДС;
	//	Если ТекущаяСтрока.ИтогоСуммаНДС = 0 Тогда			
	//		ТекущаяСтрока.НДС = "Без налога (НДС)";		
	//	Иначе			
	//		ТекущаяСтрока.НДС = "В том числе НДС:";	
	//	КонецЕсли;
	//	
	//	ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);
	//КонецЦикла;
	//
	//НеВыводитьБанковскиеРеквизитыВСчетеНаОплатуБанковскойКартой = Константы.НеВыводитьБанковскиеРеквизитыВСчетеНаОплатуБанковскойКартой.Получить();
	//
	//ПервыйДокумент = Истина;
	//Для Каждого Шапка Из РезультатЗапроса Цикл
	//    Если Не ПервыйДокумент Тогда
	//        // Все документы нужно выводить на разных страницах.
	//        ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//    КонецЕсли;
	//    ПервыйДокумент = Ложь;
	//    // Запомним номер строки, с которой начали выводить текущий документ.
	//    НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	//	
	//	//ЕстьСекция_СтрокаТабличнойЧастиТовары = Ложь;
	//	//ЕстьСекция_СтрокаТабличнойЧастиПредставители = Ложь;
	//	//ЕстьСекция_СтрокаТабличнойЧастиГрафикПлатежей = Ложь;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Заглавие");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		
	//		ДвоичныеДанныеПодписи = Шапка.Организация.ФайлЛоготип.Файл.Получить();
	//		Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
	//			ОбластьМакета.Рисунки.Логотип.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
	//		КонецЕсли;	
	//		
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	Если НеВыводитьБанковскиеРеквизитыВСчетеНаОплатуБанковскойКартой И НЕ ПустаяСтрока(Шапка.ИнтернетОплатаСсылка) Тогда
	//		//не выводим область
	//	Иначе
	//		Попытка
	//			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Вывести(ОбластьМакета);
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//	Если НЕ ПустаяСтрока(Шапка.ИнтернетОплатаСсылка) Тогда
	//		Попытка
	//			ОбластьМакета = Макет.ПолучитьОбласть("СсылкаОплатыКартой");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Вывести(ОбластьМакета);
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату
	//	ВариантФормированияПФСчетаНаОплату = Константы.ВариантФормированияПФСчетаНаОплату.Получить();
	//	ТаблицаТоварыИУслуги = Шапка.Товары.Скопировать();
	//	ТаблицаТоварыИУслуги.Колонки.Добавить("ВидНоменклатуры");
	//	ТаблицаТоварыИУслуги.Колонки.Добавить("ЕстьПотолок");
	//	
	//	Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
	//		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
	//			ТекущаяСтрока.ВидНоменклатуры = 1;
	//			ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
	//		Иначе
	//			ТекущаяСтрока.ВидНоменклатуры = 2;
	//		КонецЕсли;
	//		Если ТекущаяСтрока.Потолок.Пустая() Тогда
	//			ТекущаяСтрока.ЕстьПотолок = 2;
	//		Иначе
	//			ТекущаяСтрока.ЕстьПотолок = 1;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	//0. Потолок - товар - услуга - потолок - товар - услуга
	//	//1. Потолок, Потолок, Товары, Товары, услуги, услуги
	//	//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются) 
	//	//3. Без группировок
	//	Если ВариантФормированияПФСчетаНаОплату = 0 Тогда
	//		ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");		
	//	ИначеЕсли ВариантФормированияПФСчетаНаОплату = 1 Тогда
	//		ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
	//	ИначеЕсли ВариантФормированияПФСчетаНаОплату = 2 Тогда
	//		ТаблицаТоварыИУслуги.Свернуть("Артикул, Номенклатура, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, Скидка, ВидНоменклатуры, ХарактеристикаНоменклатуры", "Количество, Сумма, СуммаБезСкидки");
	//		ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
	//	ИначеЕсли ВариантФормированияПФСчетаНаОплату = 3 Тогда
	//		//не сортируем
	//	КонецЕсли;
	//	
	//	//Вычислим есть ли скидки, наценки нас не интересуют
	//	ЕстьСкидки = Ложь;
	//	Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
	//		Если ТекущаяСтрока.Сумма < ТекущаяСтрока.СуммаБезСкидки Тогда
	//			ЕстьСкидки = Истина;
	//			Прервать; //Дальше идти нет смысла
	//		КонецЕсли;	
	//	КонецЦикла;
	//	
	//	Если НЕ ЕстьСкидки Тогда
	//		//без скидки
	//		// уменьшим
	//		Если НЕ ВВалюте Тогда
	//			Макет.Область("Товар").ШиринаКолонки = Макет.Область("Товар").ШиринаКолонки + 24;
	//			Макет.Область("Сумма").ШиринаКолонки = 4;
	//		КонецЕсли
	//	КонецЕсли;
	//	
	//	// увеличим колонку товар, если не выводим артикул
	//	Если НЕ ВыводитьАртикул Тогда
	//		Макет.Область("Товар").ШиринаКолонки = Макет.Область("Товар").ШиринаКолонки + 8;
	//	КонецЕсли;

	//	Попытка
	//		
	//		ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("ШапкаТаблицыВалюта|НомерСтроки"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|НомерСтроки"), Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки")));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("ШапкаТаблицыВалюта|Артикул"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|Артикул"), Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул")));
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("ШапкаТаблицыВалюта|Данные"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|Данные"), Макет.ПолучитьОбласть("ШапкаТаблицы|Данные")));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		
	//		ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("ШапкаТаблицыВалюта|Сумма"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|Сумма"), Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма")));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		
	//	Исключение
	//	КонецПопытки;
	//	
	//	НомерСтроки = 1;
	//	Попытка
	//		Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
	//			
	//			ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("СтрокаВалюта|НомерСтроки"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|НомерСтроки"), Макет.ПолучитьОбласть("Строка|НомерСтроки")));
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
	//			ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
	//			ТабличныйДокумент.Вывести(ОбластьМакета);
	//			
	//			Если ВыводитьАртикул Тогда
	//				ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("СтрокаВалюта|Артикул"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|Артикул"), Макет.ПолучитьОбласть("Строка|Артикул")));
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
	//				ТабличныйДокумент.Присоединить(ОбластьМакета);
	//			КонецЕсли;	
	//			
	//			ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("СтрокаВалюта|Данные"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|Данные"), Макет.ПолучитьОбласть("Строка|Данные")));
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
	//			ПредставлениеНоменклатуры = Строка(ТекущаяСтрока.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(ТекущаяСтрока.ХарактеристикаНоменклатуры));
	//			ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
	//			//Наценки не отражаем в ПФ
	//			Если ТекущаяСтрока.СуммаБезСкидки < ТекущаяСтрока.Сумма Тогда						
	//				ОбластьМакета.Параметры.Цена = Окр(ТекущаяСтрока.Сумма / ?(ТекущаяСтрока.Количество > 0, ТекущаяСтрока.Количество, 1), 2);
	//			КонецЕсли;
	//			
	//			Если ВариантФормированияПФСчетаНаОплату = 0 И ТекущаяСтрока.ВидНоменклатуры = 1 Тогда
	//				ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
	//				ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
	//				ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
	//			КонецЕсли;
	//			ТабличныйДокумент.Присоединить(ОбластьМакета);
	//			
	//			ОбластьМакета = ?(ВВалюте, Макет.ПолучитьОбласть("СтрокаВалюта|Сумма"), ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|Сумма"), Макет.ПолучитьОбласть("Строка|Сумма")));
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
	//						
	//			Если ТекущаяСтрока.СуммаБезСкидки < ТекущаяСтрока.Сумма И ЕстьСкидки Тогда
	//				ОбластьМакета.Параметры.СуммаБезСкидки = ТекущаяСтрока.Сумма;
	//				ОбластьМакета.Параметры.Скидка = 0;
	//			КонецЕсли;
	//			ТабличныйДокумент.Присоединить(ОбластьМакета);
	//			
	//			НомерСтроки = НомерСтроки + 1;
	//		КонецЦикла;
	//	Исключение
	//	КонецПопытки;
	//	
	//	//подвал
	//	Попытка
	//		ОбластьМакета = ?(Шапка.ОрганизацияЯвляетсяПлательщикомНДС, Макет.ПолучитьОбласть("ИтогоКОплатеНДС|НомерСтроки"), Макет.ПолучитьОбласть("ИтогоКОплате|НомерСтроки"));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = ?(Шапка.ОрганизацияЯвляетсяПлательщикомНДС, Макет.ПолучитьОбласть("ИтогоКОплатеНДС|Артикул"), Макет.ПолучитьОбласть("ИтогоКОплате|Артикул"));
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = ?(Шапка.ОрганизацияЯвляетсяПлательщикомНДС, Макет.ПолучитьОбласть("ИтогоКОплатеНДС|Данные"), Макет.ПолучитьОбласть("ИтогоКОплате|Данные"));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		
	//		ОбластьМакета = ?(Шапка.ОрганизацияЯвляетсяПлательщикомНДС, Макет.ПолучитьОбласть("ИтогоКОплатеНДС|Сумма"), Макет.ПолучитьОбласть("ИтогоКОплате|Сумма"));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Попытка
	//			Если Шапка.ОрганизацияЯвляетсяПлательщикомНДС И Шапка.ИтогоСуммаНДС = 0 Тогда			
	//				ОбластьМакета.Параметры.ИтогоСуммаНДС = "-";
	//			КонецЕсли;
	//		Исключение
	//		КонецПопытки;
	//		ТабличныйДокумент.Присоединить(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	Попытка 
	//		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВсегоИПрописью");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ОбластьМакета.Параметры.КолвоПозиций = НомерСтроки - 1;
	//		ОбластьМакета.Параметры.СуммаДокументаПрописью = 
	//				РаботаСВалютой.СформироватьЧислоПрописьюВсп(Шапка.СуммаДокумента, Шапка.Валюта, "Л=ru_RU;ДП=Ложь");
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	Если НЕ СПечатью Тогда
	//		Попытка 
	//			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Вывести(ОбластьМакета);
	//		Исключение
	//		КонецПопытки;
	//	Иначе
	//		
	//		Попытка 
	//			Если Макет.Области.Найти("ПодвалСчетаСПечатью") <> Неопределено Тогда
	//				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчетаСПечатью");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//				
	//				ДвоичныеДанныеПодписи = Шапка.Организация.ФайлПечать.Файл.Получить();
	//				Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
	//					ОбластьМакета.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
	//				КонецЕсли;	
	//				ДвоичныеДанныеПодписи = Шапка.Организация.ФайлПодписьРуководителя.Файл.Получить();
	//				Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
	//					ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
	//				КонецЕсли;
	//				ДвоичныеДанныеПодписи = Шапка.Организация.ФайлПодписьГлавногоБухгалтера.Файл.Получить();
	//				Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
	//					ОбластьМакета.Рисунки.ПодписьГлавногоБухгалтера.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
	//				КонецЕсли;
	//			
	//				ТабличныйДокумент.Вывести(ОбластьМакета);				
	//			КонецЕсли;	
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//	
	//    // В табличном документе необходимо задать имя области, в которую был 
	//    // выведен объект. Нужно для возможности печати комплектов документов.
	//    УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
	//        НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	//КонецЦикла;
	//Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ВозвратПродукции.ДобавитьКомандуСоздатьНаОснованииЗаказаПокупателя(КомандыСозданияНаОсновании);
	
	Документы.ВозвратТовараОтПокупателя.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ЗаказНаПроизводство.ДобавитьКомандуСоздатьНаОснованииЗаказаПокупателя(КомандыСозданияНаОсновании);
	
	Документы.ЗаказПоставщику.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ЗаявкаНаДоставку.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	Документы.ЗаявкаНаРасходованиеДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
		
	Документы.НачислениеЗарплаты.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОснованииОплатаКредитомМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.ОтправкаСМС.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПеремещениеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПлатежноеПоручениеИсходящее.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПоступлениеНаРасчетныйСчет.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.ПоступлениеТоваровИУслуг.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.РеализацияТоваровИУслуг.ДобавитьКомандуСоздатьНаОснованииЗаказаПокупателя(КомандыСозданияНаОсновании);
	
	Документы.Резервирование.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.СнятиеРезервов.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.СписаниеСРасчетногоСчета.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.СчетНаОплату.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);  
	
	Документы.Штраф.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Заказ покупателя".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаказПокупателя) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаказПокупателя.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ЗаказПокупателя.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Добавляет команду создания документа "Заказ покупателя" для документов "Заказ-договор" и "Монтаж".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОснованииДляДокументаРозницы(КомандыСозданияНаОсновании, ФункциональныеОпции="") Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаказПокупателя) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.ЗаказПокупателяСоздатьНаОснованииДокументаРозницы";
		КомандаСоздатьНаОсновании.Представление = "Заказ покупателя (на производство)"; //Метаданные.Документы.ЗаказПокупателя.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";		
		КомандаСоздатьНаОсновании.МножественныйВыбор = Ложь;
		КомандаСоздатьНаОсновании.ФункциональныеОпции = ФункциональныеОпции;
		КомандаСоздатьНаОсновании.ВидимостьВФормах = "ФормаДокумента"; // !!! не отображаем в форме списка
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область ПроверкиВводаНаОсновании

Процедура ПроверитьВозможностьВводаНаОснованииЗаказа(МассивЗаказов, Знач ИсключитьПроверкуСтатусаНовый = Ложь, ТипСоздаваемогоДокумента="") Экспорт
	
	МассивДокументов = Новый Массив;
	Если НЕ ТипЗнч(МассивЗаказов) = Тип("Массив") Тогда
		МассивДокументов.Добавить(МассивЗаказов);
	Иначе
		МассивДокументов = МассивЗаказов;
	КонецЕсли;
	
	Если ТипСоздаваемогоДокумента = "ЗаказНаПроизводство" Тогда
		ИсключитьПроверкуСтатусаНовый = Истина;
	КонецЕсли;
	
	Для каждого ДокументЗаказ из МассивДокументов Цикл
		Если НЕ ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ДокументЗаказ.Проведен Тогда				
			ТекстОшибки = НСтр("ru='Документ %Документ% не проведен. Ввод на основании разрешен только в проведенном состоянии'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказ);	
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		Если ДокументЗаказ.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Новый И НЕ ИсключитьПроверкуСтатусаНовый Тогда				
			ТекстОшибки = НСтр("ru='Документ %Документ% находится в статусе ""%Статус%"". Ввод на основании в текущем статусе не разрешен'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказ);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Статус%",   ДокументЗаказ.ТекущийСтатус);	
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		//Если ДокументЗаказ.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Отменен Тогда				
		//	ТекстОшибки = НСтр("ru='Документ %Документ% находится в статусе ""%Статус%"". Ввод на основании в текущем статусе не разрешен'");
		//	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказ);
		//	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Статус%",   ДокументЗаказ.ТекущийСтатус);	
		//	ВызватьИсключение ТекстОшибки;
		//КонецЕсли;
		
		Если ТипСоздаваемогоДокумента = "ЗаказНаПроизводство" Тогда
			Если НЕ ДокументЗаказ.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.ВРаботе Тогда				
				ТекстОшибки = НСтр("ru='Документ %Документ% находится в статусе ""%Статус%"". Ввод на основании в текущем статусе не разрешен'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказ);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Статус%",   ДокументЗаказ.ТекущийСтатус);	
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
		ИначеЕсли ТипСоздаваемогоДокумента = "Реализация" Тогда
			Если ЗначениеЗаполнено(ДокументЗаказ.НастройкаИнтеркампани) Тогда
				Если ДокументЗаказ.НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
					ТекстОшибки = НСтр("ru='Документ %Документ% с настройкой интеркампани с одной организацией производства и продажи. Ввод реализации не требуется'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказ);	
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
			КонецЕсли;
			//#7806
			Если ДокументЗаказ.ВнутреннийЗаказ Тогда
				ТекстОшибки = НСтр("ru='Документ %Документ% является внутренним заказом. Ввод реализации не требуется'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказ);	
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			
		ИначеЕсли ТипСоздаваемогоДокумента = "Резервирование" Тогда
			Если ЗначениеЗаполнено(ДокументЗаказ.НастройкаИнтеркампани) Тогда
				Если ДокументЗаказ.НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
					ТекстОшибки = НСтр("ru='Документ %Документ% с настройкой интеркампани с одной организацией производства и продажи. Ввод резервирования не требуется'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказ);	
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеНаОснованииЗаказа(ДокументОбъект, Отказ, РежимЗаписи, ТипДокументаСтрокой="") Экспорт
	
	ДокументЗаказ = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "Основание") Тогда
		ДокументЗаказ = ДокументОбъект.Основание;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ДокументОснование") Тогда
		ДокументЗаказ = ДокументОбъект.ДокументОснование;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ЗаказПокупателя") Тогда
		ДокументЗаказ = ДокументОбъект.ЗаказПокупателя;
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//проверка по основанию
		Если ТипЗнч(ДокументЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") 
			И ЗначениеЗаполнено(ДокументЗаказ) Тогда			
			Если НЕ ДокументЗаказ.Проведен Тогда				
				ТекстОшибки = НСтр("ru='Документ %Документ% не проведен. Ввод на основании разрешен только в проведенном состоянии'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказ);	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , , Отказ);
			КонецЕсли;
			
			//Если ДокументЗаказ.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Отменен Тогда				
			//	ТекстОшибки = НСтр("ru='Документ %Документ% находится в статусе ""%Статус%"". Ввод на основании в текущем статусе не разрешен'");
			//	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказ);
			//	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Статус%",   ДокументЗаказ.ТекущийСтатус);	
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , , Отказ);
			//КонецЕсли;
			
			Если ТипДокументаСтрокой = "Резервирование" И ЗначениеЗаполнено(ДокументЗаказ.НастройкаИнтеркампани) Тогда
				Если ДокументЗаказ.НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
					ТекстОшибки = НСтр("ru='Документ %Документ% с настройкой интеркампани с одной организацией производства и продажи. Ввод резервирования не требуется'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказ);	
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , , Отказ);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// по табличной части
		ТЧОснования = Неопределено;
		Если ОбщийМодуль.ЕстьРеквизитТабЧастиОбъекта("Основание", ДокументОбъект.Метаданные(), "Основания") Тогда
			ТЧОснования = ДокументОбъект.Основания;
			ИмяРеквизитаОснования = "Основание";
		КонецЕсли;
		Если ОбщийМодуль.ЕстьРеквизитТабЧастиОбъекта("Документ", ДокументОбъект.Метаданные(), "ДокументыОснования") Тогда
			ТЧОснования = ДокументОбъект.ДокументыОснования;
			ИмяРеквизитаОснования = "Документ";
		КонецЕсли;
		Если ОбщийМодуль.ЕстьРеквизитТабЧастиОбъекта("Документ", ДокументОбъект.Метаданные(), "РаспределениеПлатежа") Тогда
			ТЧОснования = ДокументОбъект.РаспределениеПлатежа;
			ИмяРеквизитаОснования = "Документ";
		КонецЕсли;
		
		Если НЕ ТЧОснования = Неопределено Тогда
			Для каждого ДокументОснование из ТЧОснования Цикл
				ДокументЗаказОснование = ДокументОснование[ИмяРеквизитаОснования];
				
				Если ТипЗнч(ДокументЗаказОснование) = Тип("ДокументСсылка.ЗаказПокупателя") 
					И ЗначениеЗаполнено(ДокументЗаказОснование) Тогда
					
					Если НЕ ДокументЗаказОснование.Проведен Тогда				
						ТекстОшибки = НСтр("ru='Документ %Документ% не проведен. Ввод на основании разрешен только в проведенном состоянии'");
						ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказОснование);	
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , , Отказ);
					КонецЕсли;
					
					//Если ДокументЗаказОснование.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Отменен Тогда				
					//	ТекстОшибки = НСтр("ru='Документ %Документ% находится в статусе ""%Статус%"". Ввод на основании в текущем статусе не разрешен'");
					//	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументЗаказОснование);
					//	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Статус%",   ДокументЗаказОснование.ТекущийСтатус);	
					//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , , Отказ);
					//КонецЕсли;
					
				КонецЕсли;			
			КонецЦикла;				
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункцииИПроцедуры

Функция ПодготовитьСписокТоваровДляВыбораПользователемКПроизводству(СсылкаНаОбъект) Экспорт
	
	// №14932 ЗаказыватьТовары = Константы.ЗаказыватьТоварыПриОформленииЗаказаНаПроизводствоНаОснованииЗаказаПокупателя.Получить();
	
	РезультатыПараметры = Новый Структура("СписокПотолков, СписокУслуг, СписокМатериалов, НастройкаИнтеркампани");
	
	СписокПотолков   = Новый Массив;
	СписокУслуг      = Новый Массив;
	СписокМатериалов = Новый Массив;
	СписокТоваров = Новый Массив;
	
	ДобавлятьКомнату = Константы.ДобавлятьНаименованиеКомнатыВАдресПриСозданииЗаказаНаПроизводство.Получить(); //#10994
	
	// №14932
	МассивРазрешенныхНоменклатур = ПолучитьНоменклатуруКЗаказуНаПроизводствоПоОтбору(СсылкаНаОбъект.Товары.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура"));
	
	Для Каждого ТекущаяСтрока Из СсылкаНаОбъект.Товары Цикл
		
		//++ №14932 смотрим по настройкам
		//ЭтоНоменклатураПотолок = Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура);
		////Начало изменен при переходе на 2.0
		////Если ЭтоНоменклатураПотолок	ИЛИ ЗаказыватьТовары Тогда
		//Если ЭтоНоменклатураПотолок //потолки всегда добавляем в список
		//	ИЛИ (ЗаказыватьТовары И ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал И ТекущаяСтрока.Потолок.Пустая()) //если разрешено, в таблицу потолков добавляем товары из корня дерева
		//	//
		//	ИЛИ Справочники.ВидыНоменклатуры.ЭтоНоменклатураПродукция(ТекущаяСтрока.Номенклатура)
		//	//
		//	Тогда
		//	//Конец изменен при переходе на 2.0	
		
		Если МассивРазрешенныхНоменклатур.Найти(ТекущаяСтрока.Номенклатура) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Если это не (потолок / отрез / конструкция) - нужно проверить, что у этой позиции нет привязки к продукции
		Если Не Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура)
			И Не Справочники.ВидыНоменклатуры.ЭтоНоменклатураПродукция(ТекущаяСтрока.Номенклатура)
			И Не ТекущаяСтрока.Потолок.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		//-- №14932
			
		СтруктураТовара = Новый Структура;
		СтруктураТовара.Вставить("Номенклатура", 		ТекущаяСтрока.Номенклатура);
		СтруктураТовара.Вставить(
			"ХарактеристикаНоменклатуры", 				ТекущаяСтрока.ХарактеристикаНоменклатуры);
		СтруктураТовара.Вставить("Количество", 			ТекущаяСтрока.Количество);
		СтруктураТовара.Вставить("ЕдиницаИзмерения", 	ТекущаяСтрока.ЕдиницаИзмерения);
		СтруктураТовара.Вставить("Спецификация", 		ТекущаяСтрока.Спецификация);
		СтруктураТовара.Вставить("НомерСтроки", 		ТекущаяСтрока.НомерСтроки);
		СтруктураТовара.Вставить("ЗаказНаПроизводство", ТекущаяСтрока.ЗаказНаПроизводство);
		СтруктураТовара.Вставить("СтатусПроизводства",  ТекущаяСтрока.ЗаказНаПроизводство.ТекущийСтатус);
		СтруктураТовара.Вставить("Коэффициент", 		ТекущаяСтрока.Коэффициент);
		СтруктураТовара.Вставить("ПроцентРучнойСкидки", ТекущаяСтрока.ПроцентРучнойСкидки);
		СтруктураТовара.Вставить("Цена", 				ТекущаяСтрока.Цена);
		СтруктураТовара.Вставить("СуммаРучнойСкидки", 	ТекущаяСтрока.СуммаРучнойСкидки);
		СтруктураТовара.Вставить("Сумма", 				ТекущаяСтрока.Сумма);
		СтруктураТовара.Вставить("Потолок", 			ТекущаяСтрока.Потолок);
		СтруктураТовара.Вставить("УИСтроки", 			ТекущаяСтрока.УИСтроки);
		СтруктураТовара.Вставить("КоличествоКВыработке",ТекущаяСтрока.КоличествоКВыработке); //Переход на 2.0
		СтруктураТовара.Вставить("Назначение", 			"Потолок");
		СтруктураТовара.Вставить("Заказ", 				СсылкаНаОбъект);
		АдресМонтажа = ?(НЕ ПустаяСтрока(СсылкаНаОбъект.АдресМонтажа), СсылкаНаОбъект.АдресМонтажа, ТекущаяСтрока.АдресМонтажа); //#10994 адрес с шапки приоритетно
		Если ДобавлятьКомнату И НЕ ПустаяСтрока(ТекущаяСтрока.Комната) Тогда
			АдресМонтажа = АдресМонтажа + ?(НЕ ПустаяСтрока(АдресМонтажа), ", ", "") + ТекущаяСтрока.Комната;                    //#10994
		КонецЕсли;
		СтруктураТовара.Вставить("АдресМонтажа", 		АдресМонтажа);
		СтруктураТовара.Вставить("СкладОтгрузки", 		СсылкаНаОбъект.Склад);	//20210917
		СтруктураТовара.Вставить("Срочно",		 		СсылкаНаОбъект.СрочныйЗаказ); // №13803
		
		СписокПотолков.Добавить(СтруктураТовара);
		
		//формируем массив услуг по потолку
		Для каждого СтрокаУслуги Из СсылкаНаОбъект.Товары Цикл
			ЭтоУслуга = Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаУслуги.Номенклатура);
			Если ЭтоУслуга и СтрокаУслуги.Потолок = ТекущаяСтрока.Номенклатура 
				И СтрокаУслуги.УИСтрокиРодителя = ТекущаяСтрока.УИСтроки
				Тогда
				
				СтруктураТовара = Новый Структура;
				СтруктураТовара.Вставить("Номенклатура", 		СтрокаУслуги.Номенклатура);
				СтруктураТовара.Вставить("Количество", 			СтрокаУслуги.Количество);
				СтруктураТовара.Вставить("ЕдиницаИзмерения", 	СтрокаУслуги.ЕдиницаИзмерения);
				СтруктураТовара.Вставить("Спецификация", 		ТекущаяСтрока.Спецификация);
				СтруктураТовара.Вставить("НомерСтроки", 		СтрокаУслуги.НомерСтроки);
				СтруктураТовара.Вставить("ЗаказНаПроизводство", СтрокаУслуги.ЗаказНаПроизводство);
				СтруктураТовара.Вставить("Коэффициент", 		СтрокаУслуги.Коэффициент);
				СтруктураТовара.Вставить("ПроцентРучнойСкидки", СтрокаУслуги.ПроцентРучнойСкидки);
				СтруктураТовара.Вставить("Цена", 				СтрокаУслуги.Цена);
				СтруктураТовара.Вставить("СуммаРучнойСкидки", 	СтрокаУслуги.СуммаРучнойСкидки);
				СтруктураТовара.Вставить("Сумма", 				СтрокаУслуги.Сумма);
				СтруктураТовара.Вставить("Потолок", 			СтрокаУслуги.Потолок);
				СтруктураТовара.Вставить("КоличествоКВыработке",СтрокаУслуги.КоличествоКВыработке); //Переход на 2.0
				СтруктураТовара.Вставить("УИСтроки", 			СтрокаУслуги.УИСтроки);
				СтруктураТовара.Вставить("УИСтрокиРодителя",	СтрокаУслуги.УИСтрокиРодителя);
				СтруктураТовара.Вставить("Назначение", 			"Услуги");
				СтруктураТовара.Вставить("Заказ", 				СсылкаНаОбъект);
				СтруктураТовара.Вставить("АдресМонтажа", 		АдресМонтажа);
				СписокУслуг.Добавить(СтруктураТовара);
			КонецЕсли;
		КонецЦикла;
		
		//формируем массив материалов по потолку
		Для Каждого СтрокаМатериал Из СсылкаНаОбъект.Материалы Цикл				
			Если СтрокаМатериал.Потолок = ТекущаяСтрока.Номенклатура
				И СтрокаМатериал.УИСтроки = ТекущаяСтрока.УИСтроки
				Тогда
				
				СтруктураТовара = Новый Структура;
				СтруктураТовара.Вставить("Номенклатура", 		СтрокаМатериал.Номенклатура);
				СтруктураТовара.Вставить("Количество", 			СтрокаМатериал.Количество);
				СтруктураТовара.Вставить("ЕдиницаИзмерения", 	СтрокаМатериал.ЕдиницаИзмерения);
				СтруктураТовара.Вставить("НомерСтроки", 		СтрокаМатериал.НомерСтроки);					
				СтруктураТовара.Вставить("Коэффициент", 		СтрокаМатериал.Коэффициент);					
				СтруктураТовара.Вставить("Потолок", 			СтрокаМатериал.Потолок);
				СтруктураТовара.Вставить("УИСтроки", 			СтрокаМатериал.УИСтроки);
				СтруктураТовара.Вставить("КоличествоКВыработке",СтрокаМатериал.КоличествоКВыработке); //Переход на 2.0
				СтруктураТовара.Вставить("Назначение", 			"Материалы");
				СтруктураТовара.Вставить("Заказ", 				СсылкаНаОбъект);
				СтруктураТовара.Вставить("АдресМонтажа", 		АдресМонтажа);
				
				СписокМатериалов.Добавить(СтруктураТовара);
			КонецЕсли;
		КонецЦикла;
			
		//КонецЕсли;	
	КонецЦикла;
	РезультатыПараметры.СписокПотолков = СписокПотолков;
	РезультатыПараметры.СписокУслуг = СписокУслуг;
	РезультатыПараметры.СписокМатериалов = СписокМатериалов;
	РезультатыПараметры.НастройкаИнтеркампани = СсылкаНаОбъект.НастройкаИнтеркампани;

	Возврат РезультатыПараметры;
	
КонецФункции

//++ №14932 определяем номенклатуру по отбору для заказа в производство
Функция ПолучитьНоменклатуруКЗаказуНаПроизводствоПоОтбору(МассивИсходныхНоменклатур) Экспорт
	
	СхемаКД = ПолучитьОбщийМакет("СхемаНастроекПоНоменклатуреКПроизводству");
	
	НастройкиКомпоновкиДанных = Константы.НастройкиКомпоновкиПоНоменклатуреКПроизводству.Получить().Получить();
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКД)); 
	
	Если ЗначениеЗаполнено(НастройкиКомпоновкиДанных) Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКД.НастройкиПоУмолчанию);
	КонецЕсли;
	
	СписокНоменклатуры = новый СписокЗначений;
	//СписокНоменклатуры.ЗагрузитьЗначения(ТаблицаТоваровИсходная.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	СписокНоменклатуры.ЗагрузитьЗначения(МассивИсходныхНоменклатур);
	
	Для Каждого ТекПараметрСКД Из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл	
		Если ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("Номенклатура") Тогда		
			ТекПараметрСКД.Использование = Истина;
			ТекПараметрСКД.Значение = СписокНоменклатуры;			
		КонецЕсли;		
	КонецЦикла;
	
	//Для Каждого ТекОтборСКД Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл		
	//	ТекОтборСКД.Использование = ЗначениеЗаполнено(ТекОтборСКД.ПравоеЗначение);		
	//КонецЦикла;
	
	Запрос = Новый Запрос;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКД, КомпоновщикНастроек.ПолучитьНастройки(),,, Тип("ГенераторМакетаКомпоновкиДанных"));
	Запрос.Текст = МакетКомпоновкиДанных.НаборыДанных.ОсновнойНаборДанных.Запрос;
	
	Для Каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Запрос.Параметры.Вставить(Параметр.Имя, Параметр.Значение);
	КонецЦикла;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции
//-- №14932

Функция ВсеТоварыПоЗаказуОтгружены(СсылкаНаЗаказ, ТоварыТЧ) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Описание", Истина, "");
	
	ОднаОрганизацияПроизводстваИПродажиПотолков = Ложь;
	Если НЕ СсылкаНаЗаказ.НастройкаИнтеркампани.Пустая() Тогда		
		ОднаОрганизацияПроизводстваИПродажиПотолков = СсылкаНаЗаказ.НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков;
	КонецЕсли;
	Если ОднаОрганизацияПроизводстваИПродажиПотолков Тогда 
		// Если ОднаОрганизация, то РТИУ не будет и поэтому надо разрешить проводить без проверки отгруженности
	    Возврат СтруктураВозврата;
	КонецЕсли;
	
	ТоварыТЗ = ТоварыТЧ.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", ТоварыТЗ);
	Запрос.УстановитьПараметр("Заказ", СсылкаНаЗаказ);
	Запрос.УстановитьПараметр("Организация", СсылкаНаЗаказ.Организация);
	Запрос.УстановитьПараметр("Контрагент", СсылкаНаЗаказ.Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(Товары.Количество * Товары.Коэффициент КАК ЧИСЛО(15, 2)) КАК Заказано,
	|	ВЫРАЗИТЬ(Товары.Сумма КАК ЧИСЛО(15, 2)) КАК СуммаЗаказано
	|ПОМЕСТИТЬ ВТ_ТоварыВрем
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТоварыВрем.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_ТоварыВрем.Заказано) КАК Заказано,
	|	СУММА(ВТ_ТоварыВрем.СуммаЗаказано) КАК СуммаЗаказано
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	ВТ_ТоварыВрем КАК ВТ_ТоварыВрем
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыВрем.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	//++ №8749 те позиции что отгружены, а потом возвращены покупателем и при этом отсутствуют в заказе покупателя не мешали провести документ
	|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейОбороты.Номенклатура КАК Номенклатура,
	//++ №12533 переделываем, т.к. не учитывал частичный возврат
	//|	СУММА(ВЫБОР
	//|			КОГДА ЗаказыПокупателейОбороты.Регистратор ССЫЛКА Документ.ВозвратТовараОтПокупателя
	//|					ИЛИ ЗаказыПокупателейОбороты.Регистратор ССЫЛКА Документ.ВозвратПродукции
	//|				ТОГДА -1 * ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0)
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК КоличествоВозврат,
	//|	СУММА(ВЫБОР
	//|			КОГДА ЗаказыПокупателейОбороты.Регистратор ССЫЛКА Документ.ВозвратТовараОтПокупателя
	//|					ИЛИ ЗаказыПокупателейОбороты.Регистратор ССЫЛКА Документ.ВозвратПродукции
	//|				ТОГДА 0
	//|			ИНАЧЕ ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0)
	//|		КОНЕЦ) КАК КоличествоОтгружено,
	//|	СУММА(ВЫБОР
	//|			КОГДА ЗаказыПокупателейОбороты.Регистратор ССЫЛКА Документ.ВозвратТовараОтПокупателя
	//|					ИЛИ ЗаказыПокупателейОбороты.Регистратор ССЫЛКА Документ.ВозвратПродукции
	//|				ТОГДА -1 * ЕСТЬNULL(ЗаказыПокупателейОбороты.СуммаРасход, 0)
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаВозврат,
	//|	СУММА(ВЫБОР
	//|			КОГДА ЗаказыПокупателейОбороты.Регистратор ССЫЛКА Документ.ВозвратТовараОтПокупателя
	//|					ИЛИ ЗаказыПокупателейОбороты.Регистратор ССЫЛКА Документ.ВозвратПродукции
	//|				ТОГДА 0
	//|			ИНАЧЕ ЕСТЬNULL(ЗаказыПокупателейОбороты.СуммаРасход, 0)
	//|		КОНЕЦ) КАК СуммаОтгружено
	|	СУММА(ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0)) КАК КоличествоОтгружено,
	|	СУММА(ЕСТЬNULL(ЗаказыПокупателейОбороты.СуммаРасход, 0)) КАК СуммаОтгружено
	//-- №12533 переделываем, т.к. не учитывал частичный возврат
	|ПОМЕСТИТЬ ВТ_ЗаказыПокупателейОбороты
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Регистратор, ЗаказНаПроизводство = &Заказ И Организация = &Организация И Контрагент = &Контрагент) КАК ЗаказыПокупателейОбороты
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПокупателейОбороты.Номенклатура
	|;
	|///////////////////////////////////////////////////////////////////////////////
	//-- №8749
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТ_Товары.Номенклатура, ЗаказыПокупателейОбороты.Номенклатура) КАК Номенклатура,
	//++ №8749
	//|	ЕСТЬNULL(ВТ_Товары.Заказано, 0) - ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0)
	//|	ВЫБОР
	// в заказе нет товара, он отгружен и полностью возвращен, такую позицию пропускаем
	//++ №12533 переделываем, т.к. не учитывал частичный возврат
	//|		КОГДА ЕСТЬNULL(ВТ_Товары.Заказано, 0) = 0 И ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоВозврат, 0) > 0
	//|			И ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоВозврат, 0) = ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоОтгружено, 0)
	//|				ТОГДА 0
	//|		ИНАЧЕ ЕСТЬNULL(ВТ_Товары.Заказано, 0) - ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоОтгружено, 0)
	//|	КОНЕЦ КАК КоличествоОстаток,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ВТ_Товары.СуммаЗаказано, 0) = 0 И ЕСТЬNULL(ЗаказыПокупателейОбороты.СуммаВозврат, 0) > 0
	//|			И ЕСТЬNULL(ЗаказыПокупателейОбороты.СуммаВозврат, 0) = ЕСТЬNULL(ЗаказыПокупателейОбороты.СуммаОтгружено, 0)
	//|				ТОГДА 0
	//|		ИНАЧЕ ЕСТЬNULL(ВТ_Товары.СуммаЗаказано, 0) - ЕСТЬNULL(ЗаказыПокупателейОбороты.СуммаОтгружено, 0)
	//|	КОНЕЦ КАК СуммаОстаток
	|	ЕСТЬNULL(ВТ_Товары.Заказано, 0) - ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоОтгружено, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_Товары.СуммаЗаказано, 0) - ЕСТЬNULL(ЗаказыПокупателейОбороты.СуммаОтгружено, 0) КАК СуммаОстаток
	//++ №12533 переделываем, т.к. не учитывал частичный возврат
	|
	//-- №8749
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	//++ №8749
	//|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Обороты(, , , ЗаказНаПроизводство = &Заказ) КАК ЗаказыПокупателейОбороты
	//|		ПО ВТ_Товары.Номенклатура = ЗаказыПокупателейОбороты.Номенклатура
	|
	|	ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПокупателейОбороты КАК ЗаказыПокупателейОбороты
	|	ПО ВТ_Товары.Номенклатура = ЗаказыПокупателейОбороты.Номенклатура
	//-- №8749
	|
	|
	|";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КоличествоОстаток > 0 Тогда
			СтруктураВозврата.Результат = Ложь;
			СтруктураВозврата.Описание = СтруктураВозврата.Описание + 
				"По данному заказу номенклатуры """ + Выборка.Номенклатура + """ отгружено на " + Выборка.КоличествоОстаток + " ед. меньше, чем заказано." + Символы.ПС;
			
		//++ #9777	
		ИначеЕсли Выборка.СуммаОстаток > 0 Тогда
			СтруктураВозврата.Результат = Ложь;
			СтруктураВозврата.Описание = СтруктураВозврата.Описание + 
				"По данному заказу номенклатуры """ + Выборка.Номенклатура + """ отгружено на сумму " + Выборка.СуммаОстаток + " меньше, чем заказано." + Символы.ПС;
		//-- #9777
		
		ИначеЕсли Выборка.КоличествоОстаток  < 0 Тогда
			СтруктураВозврата.Результат = Ложь;
			СтруктураВозврата.Описание = СтруктураВозврата.Описание + 
				"По данному заказу номенклатуры """ + Выборка.Номенклатура + """ отгружено на " + (-1)*Выборка.КоличествоОстаток + " ед. больше, чем заказано." + Символы.ПС;			
			
		//++ #9777
		ИначеЕсли Выборка.СуммаОстаток  < 0 Тогда
			СтруктураВозврата.Результат = Ложь;
			СтруктураВозврата.Описание = СтруктураВозврата.Описание + 
				"По данному заказу номенклатуры """ + Выборка.Номенклатура + """ отгружено на сумму " + (-1)*Выборка.СуммаОстаток + " больше, чем заказано." + Символы.ПС;
		//-- #9777	
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

//возвращает "Истина" при наличии РТиУ по заказу
Функция ЕстьРеализацииПоЗаказу(Знач ЗаказПокупателя, Знач ВыдаватьСообщения = Истина) Экспорт
	
	Если НЕ ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейОбороты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказПокупателя) КАК ЗаказыПокупателейОбороты
	|
	//++ №8460 не учитываем реализации, по которым полностью возвращены товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты() КАК Продажи
	|		ПО ЗаказыПокупателейОбороты.Регистратор = Продажи.ДокументПродажи
	|		И НЕ Продажи.Номенклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.Услуга)
	//-- №8460
	|
	|ГДЕ
	|	ЗаказыПокупателейОбороты.КоличествоРасход > 0
	//++ №8460
	|	И НЕ ЕСТЬNULL(Продажи.КоличествоОборот, 0) = 0
	//-- №8460
	|";
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Истина;
		Если ВыдаватьСообщения Тогда
			Сообщить("По " + ЗаказПокупателя + " имеется документ расхода - " + Выборка.Регистратор);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//возвращает "Истина" при наличии выпусков продукции по потолкам, присутствубщим в данном заказе
Функция ЕстьВыпускиПродукцииПоПотолкамЗаказа(Знач ЗаказПокупателя, Знач ВыдаватьСообщения = Истина) Экспорт
	
	Если НЕ ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СписокПотолков = Новый СписокЗначений;
	
	Для Каждого ТекущаяСтрока Из ЗаказПокупателя.Товары Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			СписокПотолков.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	//++ №13857
	//
	// прежний вариант:
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТоварыНаСкладахОбороты.Регистратор КАК Регистратор,
	//|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	//|ИЗ
	//|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, Номенклатура В (&СписокПотолков)) КАК ТоварыНаСкладахОбороты
	//|ГДЕ
	//|	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ВыпускПродукции
	//|	И ТоварыНаСкладахОбороты.КоличествоПриход > 0";
	
	// новый вариант:
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОбороты.Регистратор КАК Регистратор,
	|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, Номенклатура В (&СписокПотолков)) КАК ТоварыНаСкладахОбороты
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателейВПроизводстве.Обороты(,, Регистратор, Номенклатура В (&СписокПотолков) И ЗаказПокупателя = &ЗаказПокупателя) КАК ЗаказыПокупателейВПроизводствеОбороты
	|		ПО ТоварыНаСкладахОбороты.Регистратор = ЗаказыПокупателейВПроизводствеОбороты.Регистратор
	|
	|ГДЕ
	|	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|	И ТоварыНаСкладахОбороты.КоличествоПриход > 0";
	//-- №13857
	
	Запрос.УстановитьПараметр("СписокПотолков", СписокПотолков);
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя); // №13857
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Истина;
		Если ВыдаватьСообщения Тогда
			Сообщить("По " + Выборка.Номенклатура + " имеется документ выпуска - " + Выборка.Регистратор);
		КонецЕсли;
	КонецЦикла;
	
	Возврат  Результат;
	
КонецФункции

//возвращает "Истина" при наличии РТиУ по заказу
Функция ЕстьЗаказыНаПроизводствоВработе(Знач ЗаказПокупателя, Знач ВыдаватьСообщения = Истина) Экспорт
	
	Если НЕ ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Ложь;
	
	//проверяем на отсутствие ЗнП или РТиУ по данному заказу
	СписокСтатусовЗнП = Новый СписокЗначений;
	СписокСтатусовЗнП.Добавить(Справочники.СтатусыЗаказовНаПроизводство.ВПроизводстве);
	СписокСтатусовЗнП.Добавить(Справочники.СтатусыЗаказовНаПроизводство.Произведен);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказНаПроизводство.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.ДокументОснование = &ДокументОснование
	|	И ЗаказНаПроизводство.Проведен
	|	И ЗаказНаПроизводство.ТекущийСтатус В(&ТекущийСтатус)";
	Запрос.УстановитьПараметр("ДокументОснование", ЗаказПокупателя);
	Запрос.УстановитьПараметр("ТекущийСтатус", СписокСтатусовЗнП);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Истина;
		Если ВыдаватьСообщения Тогда
			Сообщить("По данному заказу имеется - " + Выборка.Ссылка + ", который находится в статусе ""В производстве"" или ""Произведен""");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВозможенПереводВСтатусОтменен(Знач ЗаказПокупателя, Знач ВыдаватьСообщения = Истина) Экспорт
	
	Результат = Истина;
	
	//проверяем на отсутствие ЗнП или РТиУ по данному заказу
	Если ЕстьЗаказыНаПроизводствоВработе(ЗаказПокупателя, ВыдаватьСообщения) Тогда
		Результат = Ложь;
	КонецЕсли;
	
	//проверяем отсутствие отгрузок по данному заказу
	Если ЕстьРеализацииПоЗаказу(ЗаказПокупателя, ВыдаватьСообщения) Тогда
		Результат = Ложь;
	КонецЕсли;
	
	//проверяем отсутствие выпусков по данному заказу
	Если ЕстьВыпускиПродукцииПоПотолкамЗаказа(ЗаказПокупателя, ВыдаватьСообщения) Тогда
		Если НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешеноПереводитьЗаказыПокупателейВСтатусОтмененПриНаличииВыпускаПотолков") Тогда
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

//nva+++
Функция ЕстьЗаказныеПозицииИСозданЗаказПоставщику(ЗаказПокупателя, Товары, ВыдаватьСообщения = Истина) Экспорт
	
	Если НЕ ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Товары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&ВТ_Товары КАК ВТ_Товары
	|ГДЕ
	|	ВТ_Товары.Номенклатура В ИЕРАРХИИ(&ГруппаЗаказныхТоваров)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Товары.Количество КАК ЗаказПокупателяКоличество,
	|	ЗаказПоставщикуТовары.Количество КАК ЗаказПоставщикуКоличество
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО ВТ_Товары.Номенклатура = ЗаказПоставщикуТовары.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка.Основание = &ЗаказПокупателя
	|	И ЗаказПоставщикуТовары.Ссылка.ТекущийСтатус <> ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПоставщику.Отменен)";
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.УстановитьПараметр("ВТ_Товары", Товары);
	Запрос.УстановитьПараметр("ГруппаЗаказныхТоваров",  Справочники.Номенклатура.НайтиПоКоду("000382380")); //Заказные товары
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЗаказПокупателяКоличество <> Выборка.ЗаказПоставщикуКоличество Тогда
			Результат = Ложь;
			Если ВыдаватьСообщения Тогда
				Сообщить("По номенклатуре """ + Выборка.Номенклатура + """ не создан документ ""Заказ поставщику"" или не соответствует количество");
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
//nva---

Функция ПолучитьТекстЗапросаСписка(МассивУказателей) Экспорт
	
	// ПРИ ИЗМЕНЕНИИ ЗАПРОСОВ ПРОВЕРИТЬ ПРОЦЕДУРУ ЗаказПокупателяОсобыйОтборПриИзмененииНаСервере()
	// В АРМ ПРОИЗВОДСТВА
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПокупателя.НастройкаИнтеркампани КАК НастройкаИнтеркампани
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивСсылок)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	// оплата
	Если НЕ МассивУказателей.Найти(0) = Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеРегистра.Заказ КАК Ссылка,
		|	ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) КАК Оплачено ,
		|	ЕСТЬNULL(ДанныеРегистра.СуммаПриход, 0) - ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) КАК КОплате,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) = 0
		|				ИЛИ ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) = 0
		|			ТОГДА 2
		|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) = ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0)
		|				И ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) > 0
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) < ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0)
		|				И ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) > 0
		|			ТОГДА 7
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СостояниеОплаты
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Обороты(, , , Заказ В (&МассивСсылок)) КАК ДанныеРегистра
		|	ПО ВТ_Заказы.Ссылка = ДанныеРегистра.Заказ
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
	
	КонецЕсли;
	
	// долг контрагента и долг контрагента с учетом заказов в работе
	Если НЕ МассивУказателей.Найти(1) = Неопределено Тогда
		
		// ВНИМАНИЕ: в запросе есть вспомогательный запрос (временная таблица),
		// это учтено при переборе результатов пакета в формах списков заказов покупателей
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Заказы.Ссылка КАК Ссылка,
		|	СУММА(ЕСТЬNULL(ЗаказыПокупателейОстатки.СуммаОстаток, 0)) КАК СуммаЗаказовВРаботе
		|ПОМЕСТИТЬ ВТ_СтоимостьЗаказовВРаботе
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(
		|			,
		|			ВЫРАЗИТЬ(ЗаказНаПроизводство КАК Документ.ЗаказПокупателя).ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)) КАК ЗаказыПокупателейОстатки
		|	ПО ВТ_Заказы.Контрагент = ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.ЗаказНаПроизводство КАК Документ.ЗаказПокупателя).Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Заказы.Ссылка
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Заказы.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(ДанныеРегистра.СуммаОстаток, 0) КАК ДолгКонтрагента,
		|	ЕСТЬNULL(ДанныеРегистра.СуммаОстаток, 0) + ЕСТЬNULL(ЗаказыВРаботе.СуммаЗаказовВРаботе, 0) КАК ДолгСУчетомЗаказовВРаботе
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ДанныеРегистра
		|	ПО ВТ_Заказы.Контрагент = ДанныеРегистра.Контрагент
		|		И ВТ_Заказы.Организация = ДанныеРегистра.Организация
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьЗаказовВРаботе КАК ЗаказыВРаботе
		|	ПО ВТ_Заказы.Ссылка = ЗаказыВРаботе.Ссылка
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
	
	КонецЕсли;
		
	// доставка
	Если НЕ МассивУказателей.Найти(2) = Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкаНаДоставку.Основание КАК Ссылка,
		|	ВЫБОР
		|		КОГДА НЕ МАКСИМУМ(ЗаявкаНаДоставку.Ссылка.ОжидаемаяДатаОтправки) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьДоставкаСегодня
		|ИЗ
		|	Документ.ЗаявкаНаДоставку.Основания КАК ЗаявкаНаДоставку
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ЗаявкаНаДоставку.Ссылка.ОжидаемаяДатаОтправки, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекДата, ДЕНЬ)
		|	И ЗаявкаНаДоставку.Ссылка.Результат = &ТекущийСтатусДоставки
		|	И ЗаявкаНаДоставку.Основание В(&МассивСсылок)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаДоставку.Основание
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
	
	КонецЕсли;
	
	// показатель "Отгружен"
	Если НЕ МассивУказателей.Найти(3) = Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеРегистра.ЗаказНаПроизводство КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ДанныеРегистра.КоличествоРасход = 0
		|			ТОГДА 2
		|		КОГДА ДанныеРегистра.КоличествоПриход > 0 
		|			И ДанныеРегистра.КоличествоРасход = ДанныеРегистра.КоличествоПриход
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Отгружен
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , , ЗаказНаПроизводство В (&МассивСсылок)) КАК ДанныеРегистра
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗаказыПокупателейВПроизводствеОбороты.ЗаказПокупателя КАК Ссылка,
	//|	ЗаказыПокупателейВПроизводствеОбороты.КоличествоРасход КАК КоличествоРасход,
	//|	ЗаказыПокупателейВПроизводствеОбороты.КоличествоПриход КАК КоличествоПриход,
	//|	ВЫБОР
	//|		КОГДА ЗаказыПокупателейВПроизводствеОбороты.КоличествоРасход = 0
	//|			ТОГДА 2
	//|		КОГДА ЗаказыПокупателейВПроизводствеОбороты.КоличествоРасход = ЗаказыПокупателейВПроизводствеОбороты.КоличествоПриход
	//|			ТОГДА 0
	//|		ИНАЧЕ 1
	//|	КОНЕЦ КАК Произведен
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПокупателейВПроизводстве.Обороты(, , , ЗаказПокупателя В (&МассивСсылок)) КАК ЗаказыПокупателейВПроизводствеОбороты
	//|;
	//|
	
	// СМС
	Если НЕ МассивУказателей.Найти(4) = Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтправкаСМС.Основание КАК Ссылка,
		|	ВЫБОР
		|		КОГДА СУММА(1) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СМСОтправлено	
		|ИЗ
		|	Документ.ОтправкаСМС КАК ОтправкаСМС
		|ГДЕ
		|	ОтправкаСМС.Основание В(&МассивСсылок)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтправкаСМС.Основание
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	// ПотолкиВНаличии
	Если НЕ МассивУказателей.Найти(5) = Неопределено Тогда
	
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыПокупателейПотолки.ЗаказНаПроизводство КАК Ссылка,
		|	СУММА(ЗаказыПокупателейПотолки.КоличествоПриход) КАК Заказано,
		|	СУММА(ЗаказыПокупателейПотолки.КоличествоПриход - ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)) КАК Потребность
		|ПОМЕСТИТЬ ВТ_ПотребностьПотолков
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Обороты(
		|			,
		|			,
		|			,
		|			ЗаказНаПроизводство В (&МассивСсылок)
		|				И (Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
		|					ИЛИ Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
		|					ИЛИ Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез))) КАК ЗаказыПокупателейПотолки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ЗаказыПокупателейПотолки.Номенклатура)
		|			И (ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ЗаказыПокупателейПотолки.ХарактеристикаНоменклатуры)
		|			И (ТоварыНаСкладахОстатки.СерияНоменклатуры = ЗаказыПокупателейПотолки.СерияНоменклатуры)
		|			И (ТоварыНаСкладахОстатки.Склад = ЗаказыПокупателейПотолки.ЗаказНаПроизводство.Склад)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейПотолки.ЗаказНаПроизводство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ПотребностьПотолков.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ВТ_ПотребностьПотолков.Заказано > 0
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_ПотребностьПотолков.Потребность >= ВТ_ПотребностьПотолков.Заказано
		|						ТОГДА 2
		|					КОГДА ВТ_ПотребностьПотолков.Потребность <= 0
		|						ТОГДА 0
		|					КОГДА ВТ_ПотребностьПотолков.Потребность < ВТ_ПотребностьПотолков.Заказано
		|						ТОГДА 1
		|					ИНАЧЕ -1
		|				КОНЕЦ
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК ПотолкиВНаличии,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказыПокупателейВПроизводствеОбороты.КоличествоПриход, 0) = 0
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗаказанВПроизводство
		|ИЗ
		|	ВТ_ПотребностьПотолков КАК ВТ_ПотребностьПотолков
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателейВПроизводстве.Обороты КАК ЗаказыПокупателейВПроизводствеОбороты
		|		ПО ВТ_ПотребностьПотолков.Ссылка = ЗаказыПокупателейВПроизводствеОбороты.ЗаказПокупателя
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;

	// заказы по интеркампани с одной организацией
	Если НЕ МассивУказателей.Найти(6) = Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_Заказы КАК ЗаказПокупателя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиИнтеркампани КАК СпрНастройкиИнтеркампани
		|		ПО (СпрНастройкиИнтеркампани.Ссылка = ЗаказПокупателя.НастройкаИнтеркампани)
		|			И (СпрНастройкиИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	/// №7702 статус закупки
	//- если нет ни одного заказа поставщику по заказу покупателя, то ячейка пустая
	//- если есть хотябы один заказ поставщику, но не по всем заказам поставщику есть ПТиУ, то показываем полый зеленый кружок
	//- если по всем заказам поставщику получены все товары или есть хотябы одна птиу без заказа поставщику, то рисуем полный зеленый кружок.
	Если НЕ МассивУказателей.Найти(7) = Неопределено Тогда
	
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|   ВЫРАЗИТЬ(ЗаказыПоставщикамОбороты.ЗаказПоставщику.Основание КАК Документ.ЗаказПокупателя) КАК ЗаказПокупателя,
		|	СУММА(ЗаказыПоставщикамОбороты.КоличествоПриход) КАК КоличествоПриход,
		|	СУММА(ЗаказыПоставщикамОбороты.КоличествоРасход) КАК КоличествоРасход
		|ПОМЕСТИТЬ ВТ_ЗаказыПоставщикамОбороты
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.Обороты(, , , ) КАК ЗаказыПоставщикамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(ЗаказыПоставщикамОбороты.ЗаказПоставщику.Основание КАК Документ.ЗаказПокупателя)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументЗаказПокупателя.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоПриход, 0) > 0
		|				И ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоРасход, 0) = 0
		|			ТОГДА 2
		|		КОГДА ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоПриход, 0) > 0
		|				И ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоРасход, 0) < ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоПриход, 0)
		|			ТОГДА 1
		|		КОГДА (ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоПриход, 0) > 0
		|				И ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоРасход, 0) >= ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоПриход, 0))
		|					ИЛИ (ЕСТЬNULL(ПоступлениеТоваровИУслугПоЗаказуПокупателя.КоличествоОборот, 0) > 0)
		|			ТОГДА 0		
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СтатусЗакупки
		|ИЗ
		|	ВТ_Заказы КАК ДокументЗаказПокупателя
		|
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Обороты() КАК ЗаказыПоставщикамОбороты
		//|       ПО ДокументЗаказПокупателя.Ссылка = ЗаказыПоставщикамОбороты.ЗаказПоставщику.Основание
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПоставщикамОбороты КАК ЗаказыПоставщикамОбороты
		|   	ПО ДокументЗаказПокупателя.Ссылка = ЗаказыПоставщикамОбороты.ЗаказПокупателя
		|	
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки.Обороты(,, Регистратор) КАК ПоступлениеТоваровИУслугПоЗаказуПокупателя
		|       ПО ЗаказПокупателя.Ссылка = ПоступлениеТоваровИУслугПоЗаказуПокупателя.Регистратор.Основание
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;

	// показатель "Производство"
	Если НЕ МассивУказателей.Найти(8) = Неопределено Тогда			
		// запрос (#8808)
		//-1 - пусто. если нет ни одного заказа на производство
		//2 - пустой кружок - если есть хотябы один заказ на производство но нет ни одного выпуска
		//1 - частично закрашен - есть хотябы один выпуск но не все произведено
		//0 - полностью закрашен - все заказано в производство и все произведено
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыПокупателейВПроизводствеОбороты.ЗаказПокупателя КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказыПокупателейВПроизводствеОбороты.КоличествоПриход, 0) > 0
		|				И ЕСТЬNULL(ЗаказыПокупателейВПроизводствеОбороты.КоличествоРасход, 0) = 0
		|			ТОГДА 2
		|		КОГДА ЕСТЬNULL(ЗаказыПокупателейВПроизводствеОбороты.КоличествоПриход, 0) > 0
		|				И ЕСТЬNULL(ЗаказыПокупателейВПроизводствеОбороты.КоличествоРасход, 0) < ЕСТЬNULL(ЗаказыПокупателейВПроизводствеОбороты.КоличествоПриход, 0)
		|			ТОГДА 1
		|		КОГДА ЕСТЬNULL(ЗаказыПокупателейВПроизводствеОбороты.КоличествоПриход, 0) > 0
		|				И ЕСТЬNULL(ЗаказыПокупателейВПроизводствеОбороты.КоличествоРасход, 0) >= ЕСТЬNULL(ЗаказыПокупателейВПроизводствеОбороты.КоличествоПриход, 0)
		|			ТОГДА 0
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК Производство
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателейВПроизводстве.Обороты(, , , ЗаказПокупателя В (&МассивСсылок)) КАК ЗаказыПокупателейВПроизводствеОбороты
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	// показатель "Состояние обеспеченности"
	Если НЕ МассивУказателей.Найти(9) = Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + 
		
		//++ №13231 комментируем, прежний вариант
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ВЫРАЗИТЬ(ВТ.ЗаказНаПроизводство КАК Документ.ЗаказПокупателя) КАК ДокументЗаказ,
		//|	ВТ.Номенклатура КАК Номенклатура,
		//|	ВТ.ХарактеристикаНоменклатуры,
		//|	ВТ.СерияНоменклатуры,
		//|	ВЫБОР КОГДА ВТ.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ ЭтоУслуга,
		//|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		//|	ЕСТЬNULL(ВТ.КоличествоОстаток, 0) КАК Потребность,
		//|	ЕСТЬNULL(ТоварыВРезервеПоЗаказуОстатки.КоличествоОстаток, 0) КАК ВРезервеПодЗаказ,
		//|	ЕСТЬNULL(ТоварыВРезервеПоЗаказамОстатки.КоличествоОстаток, 0) КАК ВРезервеОбщее
		//|ПОМЕСТИТЬ ВТ_ОбеспеченностьВрем
		//|ИЗ 
		//|	РегистрНакопления.ЗаказыПокупателей.Остатки
		//|												(,
		//|												ВЫРАЗИТЬ(ЗаказНаПроизводство КАК Документ.ЗаказПокупателя).ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)
		//|												И ЗаказНаПроизводство В (&МассивСсылок)
		//|	) КАК ВТ
		//
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		//|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ВТ.Номенклатура)
		//|			И (ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ВТ.ХарактеристикаНоменклатуры)
		//|			И (ТоварыНаСкладахОстатки.СерияНоменклатуры = ВТ.СерияНоменклатуры)
		//|			//И (ТоварыНаСкладахОстатки.Склад = ВТ.Ссылка.Склад)
		//|			И (ТоварыНаСкладахОстатки.Склад = ВЫРАЗИТЬ(ВТ.ЗаказНаПроизводство КАК Документ.ЗаказПокупателя).Склад)
		//|			И (ВЫБОР
		//|					КОГДА &ОбщиеСклады
		//|						ТОГДА ИСТИНА
		//|					ИНАЧЕ ТоварыНаСкладахОстатки.Организация = ВЫРАЗИТЬ(ВТ.ЗаказНаПроизводство КАК Документ.ЗаказПокупателя).Организация
		//|				КОНЕЦ)
		//|			
		//|		//++ #12484					
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеПоЗаказуОстатки
		//|		ПО (ТоварыВРезервеПоЗаказуОстатки.Номенклатура = ВТ.Номенклатура)
		//|			И (ТоварыВРезервеПоЗаказуОстатки.ХарактеристикаНоменклатуры = ВТ.ХарактеристикаНоменклатуры)
		//|			И (ТоварыВРезервеПоЗаказуОстатки.СерияНоменклатуры = ВТ.СерияНоменклатуры)
		//|			//И (ТоварыВРезервеПоЗаказуОстатки.ДокументРезерва = ВТ.Ссылка)
		//|			И (ТоварыВРезервеПоЗаказуОстатки.ДокументРезерва = ВЫРАЗИТЬ(ВТ.ЗаказНаПроизводство КАК Документ.ЗаказПокупателя))
		//|				
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеПоЗаказамОстатки
		//|		ПО (ТоварыВРезервеПоЗаказамОстатки.Номенклатура = ВТ.Номенклатура)
		//|			И (ТоварыВРезервеПоЗаказамОстатки.ХарактеристикаНоменклатуры = ВТ.ХарактеристикаНоменклатуры)
		//|			И (ТоварыВРезервеПоЗаказамОстатки.СерияНоменклатуры = ВТ.СерияНоменклатуры)
		//|		//-- #12484
		//|		
		//|ГДЕ
		//|	ЕСТЬNULL(ВТ.КоличествоОстаток, 0) > 0 // #12484
		//|
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ВТ_ОбеспеченностьВрем.ДокументЗаказ КАК ДокументЗаказ,		
		//|	СУММА(ВЫБОР
		//|			КОГДА НЕ ВТ_ОбеспеченностьВрем.ЭтоУслуга 
		//|				И ((ВТ_ОбеспеченностьВрем.Потребность > ВТ_ОбеспеченностьВрем.КоличествоОстаток)
		//|				ИЛИ (ВТ_ОбеспеченностьВрем.Потребность > ВТ_ОбеспеченностьВрем.КоличествоОстаток - (ВТ_ОбеспеченностьВрем.ВРезервеОбщее - ВТ_ОбеспеченностьВрем.ВРезервеПодЗаказ)))
		//|				ТОГДА 1 // позиция не обеспечена
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК СостояниеОбеспеченности,
		//|	СУММА(1) КАК КоличествоПозиций,
		//|	СУММА(ВЫБОР КОГДА ВТ_ОбеспеченностьВрем.ЭтоУслуга ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК КоличествоУслуг
		//|ПОМЕСТИТЬ ВТ_Обеспеченность
		//|ИЗ
		//|	ВТ_ОбеспеченностьВрем КАК ВТ_ОбеспеченностьВрем
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ОбеспеченностьВрем.ДокументЗаказ
		//|;
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ВТ_Обеспеченность.ДокументЗаказ КАК Ссылка,
		//|	ВЫБОР
		//|       КОГДА НЕ ВТ_Обеспеченность.ДокументЗаказ.Проведен 
		//|			ТОГДА -1
		//|       // все остатки по заказу - это услуги
		//|		КОГДА ЕСТЬNULL(ВТ_Обеспеченность.КоличествоПозиций, 0) = ЕСТЬNULL(ВТ_Обеспеченность.КоличествоУслуг, 0)
		//|			ТОГДА -1
		//|       // все позиции не обеспечены
		//|		КОГДА ЕСТЬNULL(ВТ_Обеспеченность.КоличествоПозиций, 0) = ЕСТЬNULL(ВТ_Обеспеченность.СостояниеОбеспеченности, 0)
		//|			ТОГДА 2
		//|		КОГДА ЕСТЬNULL(ВТ_Обеспеченность.СостояниеОбеспеченности, 1) = 0
		//|			ИЛИ (ЕСТЬNULL(ВТ_Обеспеченность.КоличествоПозиций, 0) - ЕСТЬNULL(ВТ_Обеспеченность.КоличествоУслуг, 0) = ЕСТЬNULL(ВТ_Обеспеченность.СостояниеОбеспеченности, 0))
		//|			ТОГДА 0 // обеспечен полностью
		//|		КОГДА НЕ ЕСТЬNULL(ВТ_Обеспеченность.СостояниеОбеспеченности, 1) = 0
		//|			И ВТ_Обеспеченность.ДокументЗаказ.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)
		//|			И ВТ_Обеспеченность.ДокументЗаказ.Проведен
		//|		    ТОГДА 1
		//|		ИНАЧЕ -1 
		//|	КОНЕЦ КАК СостояниеОбеспеченности
		//|ИЗ
		//|	ВТ_Обеспеченность КАК ВТ_Обеспеченность
		//|
		//|;
		//|////////////////////////////////////////////////////////////////////////////////
		//|";
		//-- №13231 комментируем, прежний вариант
		
		//++ №13231 новый вариант
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ВТ.ЗаказНаПроизводство КАК Документ.ЗаказПокупателя) КАК ДокументЗаказ,
		|	ВЫРАЗИТЬ(ВТ.ЗаказНаПроизводство КАК Документ.ЗаказПокупателя).Склад КАК Склад,
		|	ВЫРАЗИТЬ(ВТ.ЗаказНаПроизводство КАК Документ.ЗаказПокупателя).Организация КАК Организация,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.ХарактеристикаНоменклатуры,
		|	ВТ.СерияНоменклатуры,
		|	ВЫБОР КОГДА ВТ.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ ЭтоУслуга,
		|	ЕСТЬNULL(ВТ.КоличествоОстаток, 0) КАК Потребность
		|ПОМЕСТИТЬ ВТ_ЗаказыПокупателей
		|ИЗ 
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказНаПроизводство ССЫЛКА Документ.ЗаказПокупателя
		|												И ВЫРАЗИТЬ(ЗаказНаПроизводство КАК Документ.ЗаказПокупателя).ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)
		|												И ЗаказНаПроизводство В (&МассивСсылок)
		|	) КАК ВТ
		|ГДЕ
		|	ЕСТЬNULL(ВТ.КоличествоОстаток, 0) > 0 // #12484
		|
		|;
		|/////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.ДокументЗаказ КАК ДокументЗаказ,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.ХарактеристикаНоменклатуры,
		|	ВТ.СерияНоменклатуры,
		|	ВТ.ЭтоУслуга,
		|	ВТ.Потребность,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ТоварыВРезервеПоЗаказуОстатки.КоличествоОстаток, 0) КАК ВРезервеПодЗаказ,
		|	ЕСТЬNULL(ТоварыВРезервеПоЗаказамОстатки.КоличествоОстаток, 0) КАК ВРезервеОбщее
		|ПОМЕСТИТЬ ВТ_ОбеспеченностьВрем
		|ИЗ 
		|	ВТ_ЗаказыПокупателей КАК ВТ
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|		ПО ВТ.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И ВТ.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
		|			И ВТ.СерияНоменклатуры = ТоварыНаСкладахОстатки.СерияНоменклатуры
		|			И ВТ.Склад = ТоварыНаСкладахОстатки.Склад
		|			И (ВЫБОР
		|					КОГДА &ОбщиеСклады
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ВТ.Организация = ТоварыНаСкладахОстатки.Организация
		|				КОНЕЦ)
		|		
		|		//++ #12484					
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеПоЗаказуОстатки
		|		ПО (ТоварыВРезервеПоЗаказуОстатки.Номенклатура = ВТ.Номенклатура)
		|			И (ТоварыВРезервеПоЗаказуОстатки.ХарактеристикаНоменклатуры = ВТ.ХарактеристикаНоменклатуры)
		|			И (ТоварыВРезервеПоЗаказуОстатки.СерияНоменклатуры = ВТ.СерияНоменклатуры)
		|			//И (ТоварыВРезервеПоЗаказуОстатки.ДокументРезерва = ВТ.Ссылка)
		|			И (ТоварыВРезервеПоЗаказуОстатки.ДокументРезерва = ВТ.ДокументЗаказ)
		|				
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеПоЗаказамОстатки
		|		ПО (ТоварыВРезервеПоЗаказамОстатки.Номенклатура = ВТ.Номенклатура)
		|			И (ТоварыВРезервеПоЗаказамОстатки.ХарактеристикаНоменклатуры = ВТ.ХарактеристикаНоменклатуры)
		|			И (ТоварыВРезервеПоЗаказамОстатки.СерияНоменклатуры = ВТ.СерияНоменклатуры)
		|		//-- #12484
		|		
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОбеспеченностьВрем.ДокументЗаказ КАК ДокументЗаказ,		
		|	СУММА(ВЫБОР
		|			КОГДА НЕ ВТ_ОбеспеченностьВрем.ЭтоУслуга 
		|				И ((ВТ_ОбеспеченностьВрем.Потребность > ВТ_ОбеспеченностьВрем.КоличествоОстаток)
		|				ИЛИ (ВТ_ОбеспеченностьВрем.Потребность > ВТ_ОбеспеченностьВрем.КоличествоОстаток - (ВТ_ОбеспеченностьВрем.ВРезервеОбщее - ВТ_ОбеспеченностьВрем.ВРезервеПодЗаказ)))
		|				ТОГДА 1 // позиция не обеспечена
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоНеобеспеченных,
		|	СУММА(1) КАК КоличествоПозиций,
		|	СУММА(ВЫБОР КОГДА ВТ_ОбеспеченностьВрем.ЭтоУслуга ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК КоличествоУслуг
		|ПОМЕСТИТЬ ВТ_Обеспеченность
		|ИЗ
		|	ВТ_ОбеспеченностьВрем КАК ВТ_ОбеспеченностьВрем
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОбеспеченностьВрем.ДокументЗаказ
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Обеспеченность.ДокументЗаказ КАК Ссылка,
		|	ВЫБОР
		|       КОГДА НЕ ВТ_Обеспеченность.ДокументЗаказ.Проведен 
		|			ТОГДА -1
		|       // все остатки по заказу - это услуги
		|		КОГДА ЕСТЬNULL(ВТ_Обеспеченность.КоличествоПозиций, 0) = ЕСТЬNULL(ВТ_Обеспеченность.КоличествоУслуг, 0)
		|			ТОГДА -1
		|       // все позиции не обеспечены
		// #15215
		//|		КОГДА ЕСТЬNULL(ВТ_Обеспеченность.КоличествоПозиций, 0) = ЕСТЬNULL(ВТ_Обеспеченность.КоличествоНеобеспеченных, 0)
		|		КОГДА ЕСТЬNULL(ВТ_Обеспеченность.КоличествоПозиций, 0) - ЕСТЬNULL(ВТ_Обеспеченность.КоличествоУслуг, 0)
		|			= ЕСТЬNULL(ВТ_Обеспеченность.КоличествоНеобеспеченных, 0)
		|			ТОГДА 2
		|        // обеспечен полностью
		|		КОГДА ЕСТЬNULL(ВТ_Обеспеченность.КоличествоНеобеспеченных, 1) = 0
		// #14816 закомментировано: услуги тоже влияют на показатель КоличествоНеобеспеченных 
		//|			ИЛИ (ЕСТЬNULL(ВТ_Обеспеченность.КоличествоПозиций, 0) - ЕСТЬNULL(ВТ_Обеспеченность.КоличествоУслуг, 0) = ЕСТЬNULL(ВТ_Обеспеченность.КоличествоНеобеспеченных, 0))
		|			ТОГДА 0 
		|		КОГДА НЕ ЕСТЬNULL(ВТ_Обеспеченность.КоличествоНеобеспеченных, 1) = 0
		|			И ВТ_Обеспеченность.ДокументЗаказ.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)
		|			И ВТ_Обеспеченность.ДокументЗаказ.Проведен
		|		    ТОГДА 1
		|		ИНАЧЕ -1 
		|	КОНЕЦ КАК СостояниеОбеспеченности
		|ИЗ
		|	ВТ_Обеспеченность КАК ВТ_Обеспеченность
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		//-- №13231 новый вариант
		
	КонецЕсли;

	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьТекстЗапросаСпискаВыбора() Экспорт
			
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	РасчетыПоЗаказамОстатки.СуммаОстаток КАК КОплате,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Оплачен,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) > 0 И ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) < ЗаказПокупателя.СуммаДокумента
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЧастичноОплачен
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя 
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|		ПО ЗаказПокупателя.Ссылка = РасчетыПоЗаказамОстатки.Заказ
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В (&МассивСсылок)
	|";

КонецФункции

Функция ТребуетсяЗаполнениеЦен(Знач ОбъектЗаказПокупателя) Экспорт
	
	ТребуетсяЗаполнениеЦен = Истина;
	
	ОднаОрганизацияПроизводстваИПродажиПотолков = Ложь;
	Если НЕ ОбъектЗаказПокупателя.НастройкаИнтеркампани.Пустая() Тогда //И ОбъектЗаказПокупателя.ЭтоЗаказОтРозницы Тогда
		ТребуетсяЗаполнениеЦен = НЕ ОбъектЗаказПокупателя.НастройкаИнтеркампани.ОднаОрганизацияПроизводстваИПродажиПотолков;
	КонецЕсли;
	
	//#7806
	Если ОбъектЗаказПокупателя.ВнутреннийЗаказ Тогда
		Если ТребуетсяЗаполнениеЦен И НЕ Константы.ОтображатьЦеныВоВнутреннихЗаказах.Получить() Тогда
			ТребуетсяЗаполнениеЦен = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТребуетсяЗаполнениеЦен;
	
КонецФункции

Функция ОстаткиПоРезервам(Знач ЗаказПокупателяСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВРезервеНаСкладахОстатки.Склад,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Количество
	|ИЗ
	|   РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ДокументРезерва) КАК ТоварыВРезервеНаСкладахОстатки";
	Запрос.УстановитьПараметр("ДокументРезерва", ЗаказПокупателяСсылка);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса);
	
КонецФункции
	
#КонецОбласти

#Область Прочее

Функция ПолучитьМассивРеквизитовПоЦенам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ТоварыДеревоЦена");
	МассивИменЭлементов.Добавить("ТоварыДеревоСумма");
	
	МассивИменЭлементов.Добавить("ТоварыЦена");
	МассивИменЭлементов.Добавить("ТоварыСумма");

	Возврат МассивИменЭлементов;
	
КонецФункции
	
Функция ПолучитьМассивРеквизитовПоСкидкам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ТоварыДеревоПроцентРучнойСкидки");
	МассивИменЭлементов.Добавить("ТоварыДеревоСуммаРучнойСкидки");
	МассивИменЭлементов.Добавить("ТоварыПроцентРучнойСкидки");
	МассивИменЭлементов.Добавить("ТоварыСуммаРучнойСкидки");
		
	МассивИменЭлементов.Добавить("ТоварыДеревоОчиститьСкидки");
	МассивИменЭлементов.Добавить("ТоварыДеревоОкруглить");
	МассивИменЭлементов.Добавить("ТоварыДеревоОкруглитьСтоимостьПотолков");

	МассивИменЭлементов.Добавить("ТоварыОчиститьСкидки");
	МассивИменЭлементов.Добавить("ТоварыОкруглить");
	МассивИменЭлементов.Добавить("ТоварыОкруглитьСтоимостьПотолков");
	
	МассивИменЭлементов.Добавить("ВидСкидки");
	МассивИменЭлементов.Добавить("УстановитьОбщийПроцентСкидки");
	
	Возврат МассивИменЭлементов;
	
КонецФункции

#КонецОбласти

#Область АвтоматическоеФормированиеПеремещения

// Формирует или актуализирует документ "Перемещение товаров" по заказу покупателя.
//
// Перемещение содержит продукцию заказа — номенклатуру с видом "Потолок" или "Отрез", у которой
// заполнен реквизит "ЗаказНаПроизводство", а связанный заказ на производство в статусе "В производстве".
//
// Склады перемещения: отправитель = ЗаказПокупателя.СкладМатериалов, получатель = ЗаказПокупателя.Склад.
// Если склад товаров совпадает со складом материалов, перемещение не требуется (не создаётся,
// а имеющееся помечается на удаление).
// Синхронизируются склады и строки (добавление/удаление/количество); если подходящих строк
// не осталось — перемещение помечается на удаление.
//
// Создание нового документа выполняется только при СоздаватьНовое = Истина (вызывается по завершении
// оформления заказов на производство). При проведении заказа покупателя (СоздаватьНовое = Ложь)
// лишь актуализируется ранее созданное перемещение — это исключает дубли при пакетном
// (поочерёдном) оформлении заказов на производство.
//
// Параметры:
//   Заказ          - ДокументОбъект.ЗаказПокупателя, ДокументСсылка.ЗаказПокупателя - заказ покупателя.
//   СоздаватьНовое - Булево - создавать перемещение, если оно ещё не существует.
//
Процедура СформироватьПеремещениеТоваровПоЗаказу(Заказ, СоздаватьНовое = Истина) Экспорт

	// Обязательное условие: статус заказа покупателя — "В работе".
	Если НЕ Заказ.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.ВРаботе Тогда
		Возврат;
	КонецЕсли;

	// Перемещение формируется автоматически — снимаем ограничения прав доступа.
	// Привилегированный режим автоматически сбрасывается при выходе из процедуры.
	УстановитьПривилегированныйРежим(Истина);

	// Перемещение нужно только если склад товаров отличается от склада материалов.
	// При совпадении складов продукцию считаем пустой: новое не создаётся, а имеющееся
	// очищается и помечается на удаление в АктуализироватьПеремещениеТоваров.
	Если Заказ.Склад = Заказ.СкладМатериалов Тогда
		СтрокиПродукции = Новый Массив;
	Иначе
		СтрокиПродукции = ПродукцияВПроизводстве(Заказ);
	КонецЕсли;

	ПеремещениеСсылка = ПеремещениеТоваровПоЗаказу(Заказ.Ссылка);

	Если ЗначениеЗаполнено(ПеремещениеСсылка) Тогда
		АктуализироватьПеремещениеТоваров(ПеремещениеСсылка, Заказ, СтрокиПродукции);
	ИначеЕсли СоздаватьНовое И СтрокиПродукции.Количество() > 0 Тогда
		СоздатьПеремещениеТоваровПоЗаказу(Заказ, СтрокиПродукции);
	КонецЕсли;

КонецПроцедуры

// Возвращает продукцию заказа покупателя — потолки/отрезы, привязанные к заказу на производство
// в статусе "В производстве".
//
// Данные читаются ЗАПРОСОМ (а не через Заказ.Товары): при пакетном оформлении реквизит строки
// "ЗаказНаПроизводство" проставляется фоновыми заданиями (другими сессиями), и кэш объектов по
// ссылке в текущей сессии может быть устаревшим — запрос всегда возвращает актуальные данные из БД.
//
// Параметры:
//   Заказ - ДокументОбъект.ЗаказПокупателя, ДокументСсылка.ЗаказПокупателя
//
// Возвращаемое значение:
//   Массив из Структур с полями строки: Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры,
//   ЕдиницаИзмерения, Коэффициент, Количество, ЗаказНаПроизводство.
//
Функция ПродукцияВПроизводстве(Заказ)

	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", Заказ.Ссылка);
	Запрос.УстановитьПараметр("Статус", Справочники.СтатусыЗаказовНаПроизводство.ВПроизводстве);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварыЗаказа.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТоварыЗаказа.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТоварыЗаказа.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТоварыЗаказа.Коэффициент КАК Коэффициент,
	|	ТоварыЗаказа.Количество КАК Количество,
	|	ТоварыЗаказа.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ТоварыЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство КАК ЗаказПроизводства
	|		ПО ТоварыЗаказа.ЗаказНаПроизводство = ЗаказПроизводства.Ссылка
	|			И ЗаказПроизводства.ТекущийСтатус = &Статус
	|ГДЕ
	|	ТоварыЗаказа.Ссылка = &Заказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыЗаказа.НомерСтроки";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Выборка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаПродукции = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Количество, ЗаказНаПроизводство");
		ЗаполнитьЗначенияСвойств(СтрокаПродукции, Выборка);
		Результат.Добавить(СтрокаПродукции);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает ссылку на ранее сформированное автоматически перемещение по заказу покупателя.
// Автоматическое перемещение определяется по реквизитам шапки: "Основание" = заказ покупателя
// и "ВидПеремещения" = "Перемещение готовой продукции".
//
// Параметры:
//   ЗаказСсылка - ДокументСсылка.ЗаказПокупателя
//
// Возвращаемое значение:
//   ДокументСсылка.ПеремещениеТоваров - найденное перемещение либо пустая ссылка.
//
Функция ПеремещениеТоваровПоЗаказу(ЗаказСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", ЗаказСсылка);
	Запрос.УстановитьПараметр("ВидПеремещения", Справочники.ВидыПеремещений.ПеремещениеГотовойПродукции);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПеремещениеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Основание = &Основание
	|	И ПеремещениеТоваров.ВидПеремещения = &ВидПеремещения
	|	И НЕ ПеремещениеТоваров.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещениеТоваров.Дата,
	|	ПеремещениеТоваров.Ссылка";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();

КонецФункции

// Создаёт и записывает новое перемещение товаров в статусе "Заявка".
//
// Параметры:
//   ЗаказОбъект     - ДокументОбъект.ЗаказПокупателя - заказ-источник.
//   СтрокиПродукции - Массив - строки ТЧ "Товары" заказа (потолки/отрезы в производстве).
//
Процедура СоздатьПеремещениеТоваровПоЗаказу(ЗаказОбъект, СтрокиПродукции)

	ПеремещениеОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ПеремещениеОбъект);

	Если НЕ ЗначениеЗаполнено(ПеремещениеОбъект.Дата) Тогда
		ПеремещениеОбъект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	ПеремещениеОбъект.Организация = ЗаказОбъект.Организация;
	ПеремещениеОбъект.ВидПеремещения = Справочники.ВидыПеремещений.ПеремещениеГотовойПродукции;
	ПеремещениеОбъект.СкладОтправитель = ЗаказОбъект.СкладМатериалов;
	ПеремещениеОбъект.СкладПолучатель = ЗаказОбъект.Склад;
	ПеремещениеОбъект.Основание = ЗаказОбъект.Ссылка;

	// Документ — заявка на перемещение: движений по регистрам не формирует.
	ПеремещениеОбъект.СозданПриИспользованииСтатусовПеремещений = Истина;
	ПеремещениеОбъект.ТекущийСтатус = Перечисления.СтатусыПеремещений.Заявка;

	ЗаполнитьСтрокиПеремещения(ПеремещениеОбъект, СтрокиПродукции);

	ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Запись);

КонецПроцедуры

// Заполняет табличную часть "Товары" перемещения строками продукции заказа покупателя.
// Существующие строки очищаются.
//
// Параметры:
//   ПеремещениеОбъект - ДокументОбъект.ПеремещениеТоваров
//   СтрокиПродукции   - Массив - строки ТЧ "Товары" заказа покупателя.
//
Процедура ЗаполнитьСтрокиПеремещения(ПеремещениеОбъект, СтрокиПродукции)

	ПеремещениеОбъект.Товары.Очистить();

	Для Каждого СтрокаЗаказа Из СтрокиПродукции Цикл
		НоваяСтрока = ПеремещениеОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = СтрокаЗаказа.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаЗаказа.ХарактеристикаНоменклатуры;
		НоваяСтрока.СерияНоменклатуры = СтрокаЗаказа.СерияНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения = СтрокаЗаказа.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = СтрокаЗаказа.Коэффициент;
		НоваяСтрока.Количество = СтрокаЗаказа.Количество;
		НоваяСтрока.Заказ = СтрокаЗаказа.ЗаказНаПроизводство;
	КонецЦикла;

КонецПроцедуры

// Актуализирует ранее созданное перемещение при повторном проведении заказа покупателя:
// обновляет склады и синхронизирует строки (добавление/удаление/количество).
// Если подходящих строк не осталось — помечает перемещение на удаление.
// Отправленные, полученные и отменённые перемещения не изменяются.
//
// Параметры:
//   ПеремещениеСсылка - ДокументСсылка.ПеремещениеТоваров
//   ЗаказОбъект       - ДокументОбъект.ЗаказПокупателя - проводимый заказ покупателя.
//   СтрокиПродукции   - Массив - актуальные строки продукции заказа (потолки/отрезы в производстве).
//
Процедура АктуализироватьПеремещениеТоваров(ПеремещениеСсылка, ЗаказОбъект, СтрокиПродукции)

	ПеремещениеОбъект = ПеремещениеСсылка.ПолучитьОбъект();

	Если НЕ ПеремещениеМожноИзменять(ПеремещениеОбъект.ТекущийСтатус) Тогда
		Возврат;
	КонецЕсли;

	ЕстьИзменения = Ложь;

	Если НЕ ПеремещениеОбъект.ВидПеремещения = Справочники.ВидыПеремещений.ПеремещениеГотовойПродукции Тогда
		ПеремещениеОбъект.ВидПеремещения = Справочники.ВидыПеремещений.ПеремещениеГотовойПродукции;
		ЕстьИзменения = Истина;
	КонецЕсли;

	Если НЕ ПеремещениеОбъект.СкладОтправитель = ЗаказОбъект.СкладМатериалов Тогда
		ПеремещениеОбъект.СкладОтправитель = ЗаказОбъект.СкладМатериалов;
		ЕстьИзменения = Истина;
	КонецЕсли;

	Если НЕ ПеремещениеОбъект.СкладПолучатель = ЗаказОбъект.Склад Тогда
		ПеремещениеОбъект.СкладПолучатель = ЗаказОбъект.Склад;
		ЕстьИзменения = Истина;
	КонецЕсли;

	Если НЕ СтрокиПеремещенияСовпадают(ПеремещениеОбъект.Товары, СтрокиПродукции) Тогда
		ЗаполнитьСтрокиПеремещения(ПеремещениеОбъект, СтрокиПродукции);
		ЕстьИзменения = Истина;
	КонецЕсли;

	// Строк не осталось — перемещение больше не нужно, помечаем на удаление.
	Если ПеремещениеОбъект.Товары.Количество() = 0 И НЕ ПеремещениеОбъект.ПометкаУдаления Тогда
		ПеремещениеОбъект.ПометкаУдаления = Истина;
		ЕстьИзменения = Истина;
	КонецЕсли;

	Если ЕстьИзменения Тогда
		ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;

КонецПроцедуры

// Сравнивает строки перемещения с актуальными строками продукции заказа
// (по номенклатуре, характеристике, серии, единице, коэффициенту, заказу на производство и количеству).
//
// Параметры:
//   ТоварыПеремещения - ТабличнаяЧастьДокумента.ПеремещениеТоваров.Товары
//   СтрокиПродукции   - Массив - строки ТЧ "Товары" заказа покупателя.
//
// Возвращаемое значение:
//   Булево - Истина, если наборы строк совпадают.
//
Функция СтрокиПеремещенияСовпадают(ТоварыПеремещения, СтрокиПродукции)

	Если ТоварыПеремещения.Количество() <> СтрокиПродукции.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;

	ПодписиТекущие  = ПодписиСтрок(ТоварыПеремещения, "Заказ");
	ПодписиЖелаемые = ПодписиСтрок(СтрокиПродукции, "ЗаказНаПроизводство");

	Если ПодписиТекущие.Количество() <> ПодписиЖелаемые.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого Элемент Из ПодписиЖелаемые Цикл
		Если ПодписиТекущие[Элемент.Ключ] <> Элемент.Значение Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

// Строит соответствие "подпись строки" -> "количество вхождений" для набора строк.
//
// Параметры:
//   Коллекция          - Массив, ТабличнаяЧасть - строки с реквизитами номенклатуры и количества.
//   ИмяРеквизитаЗаказ  - Строка - имя реквизита ссылки на заказ на производство в строке.
//
// Возвращаемое значение:
//   Соответствие - ключ: строковая подпись строки, значение: число повторов.
//
Функция ПодписиСтрок(Коллекция, ИмяРеквизитаЗаказ)

	Подписи = Новый Соответствие;

	Для Каждого Строка Из Коллекция Цикл
		Подпись = XMLСтрока(Строка.Номенклатура) + "|"
			+ XMLСтрока(Строка.ХарактеристикаНоменклатуры) + "|"
			+ XMLСтрока(Строка.СерияНоменклатуры) + "|"
			+ XMLСтрока(Строка.ЕдиницаИзмерения) + "|"
			+ XMLСтрока(Строка.Коэффициент) + "|"
			+ XMLСтрока(Строка.Количество) + "|"
			+ XMLСтрока(Строка[ИмяРеквизитаЗаказ]);
		Подписи[Подпись] = ?(Подписи[Подпись] = Неопределено, 0, Подписи[Подпись]) + 1;
	КонецЦикла;

	Возврат Подписи;

КонецФункции

// Истина, если перемещение в статусе, допускающем автоматическую актуализацию складов
// (не заполнен / "Заявка" / "Собран"). Статусы "Отправлен", "Получен", "Отменен" не изменяем.
//
// Параметры:
//   ТекущийСтатус - ПеречислениеСсылка.СтатусыПеремещений
//
// Возвращаемое значение:
//   Булево
//
Функция ПеремещениеМожноИзменять(ТекущийСтатус)

	Возврат НЕ ЗначениеЗаполнено(ТекущийСтатус)
		ИЛИ ТекущийСтатус = Перечисления.СтатусыПеремещений.Заявка
		ИЛИ ТекущийСтатус = Перечисления.СтатусыПеремещений.Собран;

КонецФункции

#КонецОбласти

#КонецЕсли