&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Настройки);	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СохранитьПользовательскиеНастройкиНаСервере();	
КонецПроцедуры

&НаСервере
Процедура СохранитьПользовательскиеНастройкиНаСервере()
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
КонецПроцедуры	

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Контрагент
	Попытка
		Если НЕ Параметры.Контрагент.Пустая() Тогда
			Отчет.Контрагент = Параметры.Контрагент.Ссылка;
		КонецЕсли;	
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если НЕ Отчет.Контрагент.Пустая() Тогда
		ИдНастройкиКонтрагент = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(1).ИдентификаторПользовательскойНастройки;
		КонтрагентСКД = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдНастройкиКонтрагент);
		КонтрагентСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонтрагентСКД.Использование = Истина;
		КонтрагентСКД.ПравоеЗначение = Отчет.Контрагент;
		Отчет.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

