#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Листок";
	КомандаПечати.Представление = НСтр("ru = 'Информационный лист дилера'");
	//КомандаПечати.СписокФорм = "ФормаЭлемента,ФормаСписка";
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Информационный лист дилера'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Листок") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        	КоллекцияПечатныхФорм,
        	"Листок",
        	НСтр("ru = 'Информационный лист дилера'"),
        	СформироватьПечатнуюФормуИнформации(МассивОбъектов, ОбъектыПечати));
    КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуИнформации(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Контрагент";
	Макет = ПолучитьМакет("Макет");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Листок");
	ОбластьМакета.Параметры.Заполнить(МассивОбъектов[0]);
	ОбластьМакета.Параметры.АдресДилерскогоСайта = Константы.АдресДилерскогоСайта.Получить();
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

Процедура ПеревестиПризнакиОптРозницаВГруппыДоступаККонтрагентам() Экспорт
	
	// №6293 необходимо получить контрагентов, у которых:
	//	- установлена одна из галочек Опт или Розница
	//  - текущая группа доступа НЕ из предопределенных
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникКонтрагенты.Ссылка,
		|	СправочникКонтрагенты.ГруппаДоступа,
		|	СправочникКонтрагенты.УДАЛИТЬ_Опт КАК Опт,
		|	СправочникКонтрагенты.УДАЛИТЬ_Розница Розница,
		|	ВЫБОР
		|   	КОГДА СправочникКонтрагенты.УДАЛИТЬ_Опт И СправочникКонтрагенты.УДАЛИТЬ_Розница
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.Общие)
		|		КОГДА СправочникКонтрагенты.УДАЛИТЬ_Опт
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентОпта)
		|		КОГДА СправочникКонтрагенты.УДАЛИТЬ_Розница
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентРозницы)
		|		ИНАЧЕ Значение(Справочник.ГруппыДоступаККонтрагентам.ПустаяСсылка)
		|	КОНЕЦ КАК НоваяГруппаДоступа
		|ИЗ
		|	Справочник.Контрагенты КАК СправочникКонтрагенты
		|ГДЕ
		|	(СправочникКонтрагенты.УДАЛИТЬ_Опт
		|		ИЛИ СправочникКонтрагенты.УДАЛИТЬ_Розница)
		|	И НЕ СправочникКонтрагенты.ГруппаДоступа В (Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентОпта), 
		|												Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентРозницы), 
		|												Значение(Справочник.ГруппыДоступаККонтрагентам.Общие))
		|	И ВЫБОР
		|		КОГДА &ТолькоЗаполненные
		|			ТОГДА НЕ СправочникКонтрагенты.ГруппаДоступа = Значение(Справочник.ГруппыДоступаККонтрагентам.ПустаяСсылка)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	
	// 1. Сначала подготовим группы доступа, сюда попадут все созданные вручную, по ним нужно создать дубликаты с постфиксом -Опт - Розница - Общая
	Запрос.УстановитьПараметр("ТолькоЗаполненные", Истина);
	ГруппыДоступа = Запрос.Выполнить().Выгрузить();
	ГруппыДоступа.Свернуть("Опт, Розница, ГруппаДоступа");
	ГруппыДоступа.Колонки.Добавить("НоваяГруппаДоступа", новый ОписаниеТипов("СправочникСсылка.ГруппыДоступаККонтрагентам"));
	
	Для Каждого ТекущаяСтрока Из ГруппыДоступа Цикл
		
		Наименование = ТекущаяСтрока.ГруппаДоступа.Наименование;
		// Проверим, не созданная ли это группа доступа нами, если да, то просто её подставим иначе создадим новую (с предварительным поиском)
		Если СтрНайти(Врег(Наименование), "-ОПТ") = 0 И СтрНайти(Врег(Наименование), "-РОЗНИЦА") = 0 И СтрНайти(Врег(Наименование), "-ОБЩАЯ") = 0 Тогда
			
			Постфикс = "";
			Если ТекущаяСтрока.Опт И ТекущаяСтрока.Розница Тогда
				Постфикс = "-Общая";
			ИначеЕсли ТекущаяСтрока.Опт Тогда
				Постфикс = "-Опт";
			ИначеЕсли ТекущаяСтрока.Розница Тогда
				Постфикс = "-Розница";
			КонецЕсли;	
				
			НайденныйЭлемент = Справочники.ГруппыДоступаККонтрагентам.НайтиПоНаименованию(Наименование + Постфикс, Истина);
			Если НЕ НайденныйЭлемент.Пустая() Тогда
				
				ТекущаяСтрока.НоваяГруппаДоступа = НайденныйЭлемент;
				
			Иначе
				
				ОбъектГруппаДоступа = Справочники.ГруппыДоступаККонтрагентам.СоздатьЭлемент();
				ОбъектГруппаДоступа.Наименование = Наименование + Постфикс;
				
				Попытка
					ОбъектГруппаДоступа.Записать();
					ТекущаяСтрока.НоваяГруппаДоступа = ОбъектГруппаДоступа.Ссылка;
				Исключение
					ЗаписьЖурналаРегистрации("Справочник ""Группы доступа к контрагентам"" создание нового элемента", УровеньЖурналаРегистрации.Ошибка,, ОбъектГруппаДоступа.Ссылка, "Не удалось создать группу доступа: " + ОписаниеОшибки());
				КонецПопытки;
				
			КонецЕсли;	
			
		Иначе
			
			ТекущаяСтрока.НоваяГруппаДоступа = ТекущаяСтрока.ГруппаДоступа;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// 2. Теперь меняем в карточке контрагента
	Запрос.УстановитьПараметр("ТолькоЗаполненные", Ложь);
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если у контрагента не задана группа доступа и установлено:
	//	- только галочка "Контрагент розницы", то ставить ему предопределенную группу доступа "Розница"
	//	- только галочка "Контрагент опта", то ставить ему предопределенную группу доступа "Контрагент опта"
	//	- галочка "Контрагент опта" и "Контрагент розницы", то ставить ему предопределенную группу доступа "Общие"
	// Если у контрагента задана группа доступа и установлено:
	//	- только галочка "Контрагент розницы", создавать новую группу доступа с наименованием предыдущей группы доступа и через тире добавить "Розница" и присвоить данную группу данному контрагенту
	//	- только галочка "Контрагент опта", создавать новую группу доступа с наименованием предыдущей группы доступа и через тире добавить "Опт" и присвоить данную группу данному контрагенту
	//	- галочка "Контрагент опта" + "Контрагент розницы", создавать новую группу доступа с наименованием предыдущей группы доступа и через тире добавить "Общая" и присвоить данную группу данному контрагенту
			
	Пока Выборка.Следующий() Цикл
		
		КонтрагентОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		// группа доступа не указана, просто установим предопределенную группу доступа в зависимости от галочек
		Если Выборка.ГруппаДоступа.Пустая() Тогда
			
			КонтрагентОбъект.ГруппаДоступа = Выборка.НоваяГруппаДоступа;
			
		// группа доступа указана, нужно получить соответствие на неё из таблицы
		Иначе
			
			НайденнаяГруппаДоступа = ГруппыДоступа.НайтиСтроки(новый Структура("Опт, Розница, ГруппаДоступа", Выборка.Опт, Выборка.Розница, Выборка.ГруппаДоступа));
			Если НайденнаяГруппаДоступа.Количество() > 0 Тогда
				КонтрагентОбъект.ГруппаДоступа = НайденнаяГруппаДоступа[0].НоваяГруппаДоступа;
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			КонтрагентОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Справочник ""Контрагенты"" установка группы доступа", УровеньЖурналаРегистрации.Ошибка,, Выборка.Ссылка, "Не удалось установить группу доступа: " + ОписаниеОшибки());
		КонецПопытки;
			
	КонецЦикла;
	
	// 3. если у пользователя был настроен доступ к контрагентам через галочки, то выдать ему права доступа на соответствующие группы доступа контрагентов
	// в т.ч. к вновь созданным если они должны быть ему доступны и включить ограничение доступа по группам доступа контрагентов
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникПользователи.Ссылка,
		|	СправочникПользователи.УДАЛИТЬ_Опт КАК Опт,
		|	СправочникПользователи.УДАЛИТЬ_Розница Розница,
		|	ВЫБОР
		|		КОГДА СправочникПользователи.УДАЛИТЬ_ОграничиватьВидимостьКонтрагентов И (СправочникПользователи.УДАЛИТЬ_Опт ИЛИ СправочникПользователи.УДАЛИТЬ_Розница)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВключитьОграничениеДоступаККонтрагентамПоГруппаДоступа,
		|	ВЫБОР
		|   	КОГДА СправочникПользователи.УДАЛИТЬ_Опт И СправочникПользователи.УДАЛИТЬ_Розница
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.Общие)
		|		КОГДА СправочникПользователи.УДАЛИТЬ_Опт
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентОпта)
		|		КОГДА СправочникПользователи.УДАЛИТЬ_Розница
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентРозницы)
		|		ИНАЧЕ Значение(Справочник.ГруппыДоступаККонтрагентам.ПустаяСсылка)
		|	КОНЕЦ КАК НоваяГруппаДоступа
		|ИЗ
		|	Справочник.Пользователи КАК СправочникПользователи
		|ГДЕ
		|	(СправочникПользователи.УДАЛИТЬ_ОграничиватьВидимостьКонтрагентов И (СправочникПользователи.УДАЛИТЬ_Опт ИЛИ СправочникПользователи.УДАЛИТЬ_Розница))
		|		ИЛИ	СправочникПользователи.ДоступныеГруппыКонтрагентов.ГруппаКонтрагентов В (&ГруппыДоступа)";
	Запрос.УстановитьПараметр("ГруппыДоступа", ГруппыДоступа.ВыгрузитьКолонку("ГруппаДоступа"));
	
	// в выборку попадают пользователи, у которых:
	//	- было включено ограничение по Рознице или Опт (галочка Ограничивать видимость также должна быть установлена)
	//	- у пользователей задана группа доступа, по которой создавались новые с постфиксами -Опт, -Розница, -Общие (нужно их указать пользователю)
	
	// Галочка "ОграничиватьДоступККонтрагентамПоГруппамДоступа" будет установлена, если только у пользователя установлена галочка "ОграничиватьВидимостьКонтрагентов" и есть один из признаков Опт или Розница
	// в других случаях мы просто добавляем созданные группы доступа в доступные
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПользовательОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		// Проверим и при необходимости добавим группы доступа с постфиксами
		Для Каждого ТекущаяСтрока Из ПользовательОбъект.ДоступныеГруппыКонтрагентов Цикл
			
			НайденныеГруппыДоступа = ГруппыДоступа.НайтиСтроки(новый Структура("ГруппаДоступа", ТекущаяСтрока.ГруппаКонтрагентов));
			
			Для Каждого ТекущаяГруппа Из НайденныеГруппыДоступа Цикл
				
				// Проверим, может уже есть у пользователя данная группа доступа, повторно добавлять не требуется
				НайденнаяГруппаУПользователя = ПользовательОбъект.ДоступныеГруппыКонтрагентов.НайтиСтроки(новый Структура("ГруппаКонтрагентов", ТекущаяГруппа.НоваяГруппаДоступа));
				Если НайденнаяГруппаУПользователя.Количество() = 0 Тогда
					
					// в ТЧ нет, добавляем
					НоваяСтрока = ПользовательОбъект.ДоступныеГруппыКонтрагентов.Добавить();
					НоваяСтрока.ГруппаКонтрагентов = ТекущаяГруппа.НоваяГруппаДоступа;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Выборка.ВключитьОграничениеДоступаККонтрагентамПоГруппаДоступа Тогда
			
			ПользовательОбъект.ОграничиватьДоступККонтрагентамПоГруппамДоступа = Истина;
			
			// Нужно добавить соответсвующую группу доступа (опираясь на выставленные галочки)
			НайденнаяГруппаУПользователя = ПользовательОбъект.ДоступныеГруппыКонтрагентов.НайтиСтроки(новый Структура("ГруппаКонтрагентов", Выборка.НоваяГруппаДоступа));
			Если НайденнаяГруппаУПользователя.Количество() = 0 Тогда
				
				// в ТЧ нет, добавляем
				НоваяСтрока = ПользовательОбъект.ДоступныеГруппыКонтрагентов.Добавить();
				НоваяСтрока.ГруппаКонтрагентов = Выборка.НоваяГруппаДоступа;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			ПользовательОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Справочник ""Пользователи"" запись объекта", УровеньЖурналаРегистрации.Ошибка,, ПользовательОбъект.Ссылка, ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецЕсли