
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа И ЭтоНовый() Тогда
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ГруппаДоступаДляНовыхКонтрагентов, Сотрудник, АвтоматическиЗаполнятьМенеджераКонтрагента", ТекущийПользователь);
		
		// №6293 определяем для нового элемента группу доступа из карточки пользователя
		ГруппаДоступа = РеквизитыПользователя.ГруппаДоступаДляНовыхКонтрагентов;
		
		ДатаСоздания = ТекущаяДатаСеанса(); // №6377
		Автор = ТекущийПользователь; //#10640
		//#10640
		Если РеквизитыПользователя.АвтоматическиЗаполнятьМенеджераКонтрагента Тогда
			Менеджер = РеквизитыПользователя.Сотрудник;	
		КонецЕсли;
	
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
				
		Если ДанныеЗаполнения.Свойство("ДополнительнаяКонтактнаяИнформация") И ЗначениеЗаполнено(ДанныеЗаполнения.ДополнительнаяКонтактнаяИнформация) Тогда
			Для каждого СтрокаКИ из ДанныеЗаполнения.ДополнительнаяКонтактнаяИнформация Цикл
				ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(СтрокаКИ.Представление, СтрокаКИ.Вид);
				УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ЭтотОбъект, ЗначенияПолей, СтрокаКИ.Вид, СтрокаКИ.Тип);
			КонецЦикла;
		КонецЕсли;		
		
		Если ДанныеЗаполнения.Свойство("ФактическийАдрес") И ЗначениеЗаполнено(ДанныеЗаполнения.ФактическийАдрес) Тогда
			ВидИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
			ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
			
			ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(ДанныеЗаполнения.ФактическийАдрес, ВидИнформации);
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ЭтотОбъект, ЗначенияПолей, ВидИнформации, ТипИнформации);
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ЮридическийАдрес") И ЗначениеЗаполнено(ДанныеЗаполнения.ЮридическийАдрес) Тогда
			ВидИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
			ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
			
			ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(ДанныеЗаполнения.ЮридическийАдрес, ВидИнформации);
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ЭтотОбъект, ЗначенияПолей, ВидИнформации, ТипИнформации);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// №14571 если предыдущий вид контрагента выгружался как компания, а новый как контакт (или наоборот) нужно очистить идентификатор Б24
	Если НЕ ЭтоНовый() И ЗначениеЗаполнено(ИдентификаторБ24) И НЕ ВидКонтрагента = Ссылка.ВидКонтрагента Тогда
		ОбменСБитрикс24ВызовСервера.ПроверитьСоответствиеВидаКонтрагента(ЭтотОбъект, ВидКонтрагента, Ссылка.ВидКонтрагента);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// №14571 регистрация на выгрузку в Б24
	Если Не Отказ Тогда
		ОбменСБитрикс24ВызовСервера.ЗарегистрироватьОбъектКОбмену(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли