
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Задание = ТекущийОбъект.СуществующееЗадание();
	
	Если Не Задание = Неопределено Тогда
		
		Если ТипЗнч(Задание.Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
			РасписаниеРегламентногоЗадания = Задание.Расписание;
		ИначеЕсли ТипЗнч(Задание.Расписание) = Тип("ХранилищеЗначения") Тогда
			РасписаниеРегламентногоЗадания = Задание.Расписание.Получить();
		Иначе
			РасписаниеРегламентногоЗадания = Неопределено;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьНадписьРасписания();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ИспользоватьРегламентноеЗадание
		И РасписаниеРегламентногоЗадания = Неопределено
		Тогда
		
		ТекущийОбъект.ИспользоватьРегламентноеЗадание = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);	
	ТекущийОбъект.ВключитьОтключитьРегламентноеЗадание(РасписаниеРегламентногоЗадания);	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОбъектЗагрузкиПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентноеЗаданиеПриИзменении(Элемент)
	
	УправлениеФормой();
	
	Если Объект.ИспользоватьРегламентноеЗадание Тогда		
		ВыполнитьНастройкуРасписания();	
		УстановитьНадписьРасписания();
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.Фильтр = "Файлы Excel|*.xls;*.xlsx";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл Excel";
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, Параметры) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0  Тогда
		Объект.ПутьКФайлу = ВыбранныеФайлы[0];	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПоискаНоменклатурыПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьРасписаниеЗагрузки(Команда)
	
	ВыполнитьНастройкуРасписания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступностьФайла(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ПустаяСтрока(Объект.ПутьКФайлу) Тогда
		ПроверитьДоступностьФайлаНаСервере();
	Иначе
		Сообщить("Не указан путь к файлу!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДоступностьФайлаНаСервере()
	
	Если Объект.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлExcel 
		ИЛИ Объект.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSV
		Тогда
		Файл = Новый Файл(Объект.ПутьКФайлу);
		Если НЕ Файл.Существует() Тогда
			Сообщить("Файл недоступен или не существует");
		Иначе
			Сообщить("Успешно");
		КонецЕсли;
		
	ИначеЕсли Объект.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлExcelURL
		ИЛИ Объект.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSVURL Тогда		
		РезультатПроверки = ОбщийМодульКлиентСервер.ПолучитьФайлЗаписиПоHttpСсылке(Объект.ПутьКФайлу, Истина);

		Если РезультатПроверки.КодОтвета = 200 Тогда
			Сообщить("Успешно");
		Иначе
			Сообщить("Ошибка получения файла, код: " + РезультатПроверки.КодОтвета);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеПоНастройке(Команда)
	
	ОчиститьСообщения();
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Настройка должна быть записана");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанныеПоНастройкеНаСервере();
	ПоказатьПредупреждение(, "Загрузка данных завершена");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеПоНастройкеНаСервере()
	
	ЗагрузкаДанныхИзВнешнихИсточников.ЗагрузкаДанных(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Если Объект.ОбъектЗагрузки = Перечисления.ТипыОбъектовЗагрузкиИзВнешнихИсточников.ПустаяСсылка() Тогда
		Элементы.СтраницыТиповОбъектов.ТекущаяСтраница = Элементы.СтраницаЗаглушка;
		
	ИначеЕсли Объект.ОбъектЗагрузки = Перечисления.ТипыОбъектовЗагрузкиИзВнешнихИсточников.СправочникНоменклатура Тогда
		Элементы.СтраницыТиповОбъектов.ТекущаяСтраница = Элементы.СтраницаСправочникНоменклатура;	
		
	ИначеЕсли Объект.ОбъектЗагрузки = Перечисления.ТипыОбъектовЗагрузкиИзВнешнихИсточников.ДокументУстановкаЦенНоменклатуры Тогда
		Элементы.СтраницыТиповОбъектов.ТекущаяСтраница = Элементы.СтраницаДокументУстановкаЦенНоменклатуры;	
			
	КонецЕсли;
	
	ЛокальныйФайл = (Объект.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлExcel) 
				ИЛИ (Объект.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSV);
	Элементы.ПутьКФайлу.КнопкаВыбора  = ЛокальныйФайл;
	Элементы.ПутьКФайлу1.КнопкаВыбора = ЛокальныйФайл;
	
	ФайлCSV = (Объект.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSV) 
				ИЛИ (Объект.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSVURL);
	Элементы.РазделительCSV.Видимость  = ФайлCSV;
	Элементы.РазделительCSV1.Видимость = ФайлCSV;
	Элементы.КодировкаФайла.Видимость  = ФайлCSV;
	Элементы.КодировкаФайла1.Видимость = ФайлCSV;

	Элементы.ОбновлятьДанныеНоменклатуры.Видимость = (Объект.СпособПоискаНоменклатуры = Перечисления.СпособыПоискаНоменклатуры.ТолькоПоАртикулу);
	
	// регламентное задание
	Элементы.НастроитьРасписаниеЗагрузки.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписания()
	
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьНастройкуРасписанияЗавершение", ЭтотОбъект);

	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписанияЗавершение(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = РасписаниеЗадания;
	
	УстановитьНадписьРасписания();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьРасписания()
	
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		ТекстЗаголовка = НСтр("ru='Настроить расписание загрузки'");
	Иначе
		ТекстЗаголовка = РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Элементы.НастроитьРасписаниеЗагрузки.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

#КонецОбласти



