#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая() Тогда
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	СпособУточненияЦены = ?(Объект.ВидЦеныНаУслугиПроизводства.Пустая(), 0, 1);
	
	УстановитьВидимость();
	
	УстановитьУсловноеОформление();
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("УглыНоменклатураАртикул");
	МассивЭлементов.Добавить("ВырезыApplyНоменклатураАртикул");
	МассивЭлементов.Добавить("ФотопечатьНоменклатураАртикул");
	МассивЭлементов.Добавить("ДлинаШвовНоменклатураАртикул");
	МассивЭлементов.Добавить("ДлинаШвовМногофактурныйНоменклатураАртикул");
	МассивЭлементов.Добавить("ДлинаПользовательскихШвовНоменклатураАртикул");
	МассивЭлементов.Добавить("ВнутренниеВырезыНоменклатураАртикул");
	МассивЭлементов.Добавить("КривыеНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	//#12301
	Элементы.ВариантОценкиВнутренниеВырезы.Доступность = Ложь;
	Элементы.ВариантОценкиВырезыApply.Доступность = Ложь;
	Элементы.ВариантОценкиДлинаПользовательскихШвов.Доступность = Ложь;
	Элементы.ВариантОценкиДлинаШвов.Доступность = Ложь;
	Элементы.ВариантОценкиДлинаШвовМногофактурный.Доступность = Ложь;
	Элементы.ВариантОценкиКривые.Доступность = Ложь;
	Элементы.ВариантОценкиУглы.Доступность = Ложь;
	Элементы.ВариантОценкиФотопечать.Доступность = Ложь;
	
	ОбщийМодульКлиентСервер.ЗаполнитьПризнакПересеченияИнтерваловВЦенахНаУслугиПроизводства(Объект.Углы);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если СпособУточненияЦены = 1 
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУстановкиИндивидуальныхЦен.Установка")
		И НЕ ЗначениеЗаполнено(Объект.ВидЦеныНаУслугиПроизводства) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Вид цены на услуги производства""!", 
					, "Объект.ВидЦеныНаУслугиПроизводства", , Отказ); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщийМодульКлиентСервер.ЗаполнитьПризнакПересеченияИнтерваловВЦенахНаУслугиПроизводства(Объект.Углы);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУточненияЦеныПриИзменении(Элемент)
	
	Если СпособУточненияЦены = 0 Тогда
		Объект.ВидЦеныНаУслугиПроизводства = ПредопределенноеЗначение("Справочник.ЦеныУслугРаскроя.ПустаяСсылка");
	КонецЕсли;
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиЦеныУслугРаскроя

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	//Определим вкладку
	ТекущаяВкладка = Элементы.ГруппаЦеныУслугРаскроя.ТекущаяСтраница.Имя;
	
	//"ГруппаУглы" - "Углы"
	ТЧ = Прав(ТекущаяВкладка, СтрДлина(ТекущаяВкладка)-6);
	
	Если НЕ ЗначениеЗаполнено(ТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект[ТЧ].Количество() = 0 Тогда
		ДобавитьУслугиПоУмолчанию(ТЧ);
	Иначе
		ОП = новый ОписаниеОповещения("ПослеВопросаОбОчисткеТабличнойЧасти", ЭтотОбъект, новый Структура("ТЧ", ТЧ));
		ПоказатьВопрос(ОП, "Табличная часть " + ТЧ + " будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеТабличнойЧасти(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект[ДопПараметры.ТЧ].Очистить();
		ДобавитьУслугиПоУмолчанию(ДопПараметры.ТЧ);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУслугиПоУмолчанию(ТЧ)
	
	Если ТЧ = "Углы" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Углы (раскрой)");
		Номенклатура2 = Справочники.Номенклатура.НайтиПоНаименованию("Угол бесплатный (раскрой)");		
	ИначеЕсли ТЧ = "ВырезыApply" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Apply вырез");
	ИначеЕсли ТЧ = "Фотопечать" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Фотопечать");
	ИначеЕсли ТЧ = "ДлинаШвов" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Прямолинейный шов");
	ИначеЕсли ТЧ = "ДлинаШвовМногофактурный" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Прямолинейный шов");
	ИначеЕсли ТЧ = "ДлинаПользовательскихШвов" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Криволинейный шов");
	ИначеЕсли ТЧ = "ВнутренниеВырезы" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Внутренний вырез (раскрой)");
	ИначеЕсли ТЧ = "Кривые" Тогда
		Номенклатура1 = Справочники.Номенклатура.НайтиПоНаименованию("Криволинейный участок (раскрой)");	
	КонецЕсли;
	
	Если ТЧ = "Углы" И Номенклатура2 <> Неопределено И НЕ Номенклатура2.Пустая() Тогда
		НоваяСтрока = Объект[ТЧ].Добавить();
		НоваяСтрока.Номенклатура = Номенклатура2;
		НоваяСтрока.КоличествоДо = 4;
	КонецЕсли;
	
	Если Номенклатура1 <> Неопределено И НЕ Номенклатура1.Пустая() Тогда
		НоваяСтрока = Объект[ТЧ].Добавить();
		НоваяСтрока.Номенклатура = Номенклатура1;
		НоваяСтрока.КоличествоДо = 999999;
		Если ТЧ = "Углы" Тогда
			НоваяСтрока.КоличествоОт = 5;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеФункцииПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	//Подсветка операции Отмена
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВидОперации.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидОперации");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	
	// подсветка пересекающихся диапазонов
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Пересекающиеся диапазоны";
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Углы");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Углы.ЕстьПересечение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
	
КонецПроцедуры

&НаСервере
Функция УстановитьВидимость()
	
	Элементы.ГруппаВкладкиДокумента.Видимость = НЕ Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена;	
	Элементы.СпособУточненияЦены.Видимость = НЕ Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена;
	Элементы.ГруппаВкладкиДокумента.ТекущаяСтраница = ?(СпособУточненияЦены = 0, Элементы.ВкладкаЦеныУслугРаскроя, Элементы.ВкладкаДругойВидЦены);
	
КонецФункции

&НаКлиенте
Процедура УглыПриИзменении(Элемент)
	
	ОбщийМодульКлиентСервер.ЗаполнитьПризнакПересеченияИнтерваловВЦенахНаУслугиПроизводства(Объект.Углы);
	
КонецПроцедуры

#КонецОбласти

