
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТекущийСтатус", Справочники.СтатусыЗаказовПоставщику.ВРаботе, , , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", ПараметрыСеанса.ТекущийПользователь, , , Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	ОтборПоСтатусу = Справочники.СтатусыЗаказовПоставщику.ВРаботе;
	УстановитьОтбор(ЭтаФорма, "Список", "ТекущийСтатус", ОтборПоСтатусу, Истина, "ТекущийСтатус");
	//Ответственный = ПараметрыСеанса.ТекущийПользователь;
	//УстановитьОтбор(ЭтаФорма, "Список", "Ответственный", Ответственный, Истина, "Отвественный");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

//++ №11352
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ДокументОплаты" Тогда
		Элементы.Список.Обновить();
		
	ИначеЕсли ИмяСобытия = "ЗаписанПоступлениеТоваровИУслуг" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры
//-- №11352

#КонецОбласти

&НаСервере
Процедура ОчиститьОтбор(Форма, ИмяСписка, ИмяРеквизита)
	
	//Очистка элемента отбора
	Для Каждого ЭлементОтбора Из Форма[ИмяСписка].Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяРеквизита) Тогда
			Форма[ИмяСписка].Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	
	
&НаСервере
Процедура УстановитьОтбор(Форма, ИмяСписка, ИмяРеквизита, ЗначениеОтбора, ЗначениеИспользование, Представление)
	
	//установка элемента отбора
	ЭлементОтбора = Форма[ИмяСписка].Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ИдентификаторПользовательскойНастройки = ИмяРеквизита;	
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ИмяРеквизита);
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение   	= ЗначениеОтбора;
	ЭлементОтбора.Использование 	= ЗначениеИспользование;
	ЭлементОтбора.ПредставлениеПользовательскойНастройки = Представление;

КонецПроцедуры

//Отбор по Ответственному
&НаСервере
Процедура ОтборПоАвторуПриИзмененииНаСервере()
	
 ОчиститьОтбор(ЭтаФорма, "Список", "Автор");
	
 Если НЕ Автор.Пустая() Тогда
	 УстановитьОтбор(ЭтаФорма, "Список", "Автор", Автор, Истина, "Автор");
 КонецЕсли;
 
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоАвторуПриИзменении(Элемент)
	ОтборПоАвторуПриИзмененииНаСервере();
КонецПроцедуры

//Отбор по Статусу
&НаСервере
Процедура ОтборПоСтатусуПриИзмененииНаСервере()
	
 ОчиститьОтбор(ЭтаФорма, "Список", "ТекущийСтатус");
	
 Если НЕ ОтборПоСтатусу.Пустая() Тогда
	 УстановитьОтбор(ЭтаФорма, "Список", "ТекущийСтатус", ОтборПоСтатусу, Истина, "ТекущийСтатус");
 КонецЕсли;
   
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуПриИзменении(Элемент)
	ОтборПоСтатусуПриИзмененииНаСервере();
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Оповестить("Запись_ЗаказПоставщикуСписок", ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
