
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Текст = Список.ТекстЗапроса;
	
	ИмяЗадачи = ИА_БПС.ПолучитьИмяЗадачи();
	Текст = СтрЗаменить(Текст, "ИА_БПЗадачаНосителя", ИмяЗадачи);
	Текст = СтрЗаменить(Текст, "неопределено Как БизнесПроцесс", "Т.БизнесПроцесс Как БизнесПроцесс");
    Текст = СтрЗаменить(Текст, "неопределено Как Адресат", "Т." + ИА_БПС.ПолучитьИмяРеквизитаАдресацииИсполнителя() + " Как Адресат");
	
	Список.ТекстЗапроса = Текст;
	Список.ОсновнаяТаблица = "Задача." + ИмяЗадачи;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ИмяСобытия = "ОбновитьКарты" Тогда
        // 28.11.2014 ИА_ Аврамов (5) ToDo: Правильно будет обновить, только если стоит отбор по БП
        Элементы.Список.Обновить();
    КонецЕсли; 
КонецПроцедуры
