
&НаСервере
Процедура СохранитьНастройкиДляОбщегоПрайслистаНаСервере()
	НастройкиСКД = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста = ЗНАЧЕНИЕ(Справочник.СтраницыПрайсЛиста.Полотна)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НастройкаПрайсЛистаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Иначе
		НастройкаПрайсЛистаОбъект = Справочники.НастройкиПрайсЛиста.СоздатьЭлемент();
		НастройкаПрайсЛистаОбъект.СтраницаПрайсЛиста = Справочники.СтраницыПрайсЛиста.Полотна;
	КонецЕсли;
	
	НастройкаПрайсЛистаОбъект.Настройки = Новый ХранилищеЗначения(НастройкиСКД);
	
	НастройкаПрайсЛистаОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиДляОбщегоПрайслиста(Команда)
	СохранитьНастройкиДляОбщегоПрайслистаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	СтандартнаяОбработка =  Ложь;
	
	//Если ЗначениеЗаполнено(ИмяВарианта)  Тогда
	//	Настройки=СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВарианта].Настройки;
	//КонецЕсли;                         
	
	ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрПериод.Значение = ТекущаяДата();
	ПараметрПериод.Использование = Истина;

	//Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение.Дата = ТекущаяДата();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкуНаСервере(Настройка)
	
	Настройки = Настройка.Настройки.Получить();
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);	
	
	//Если ЗначениеЗаполнено(ИмяВарианта)  Тогда
	//	Настройки=СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВарианта].Настройки;
	//КонецЕсли;                         
	
	ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрПериод.Значение = ТекущаяДата();
	ПараметрПериод.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройку(Команда)
	ВосстановитьНастройкуНаСервере(Настройка);
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуНаСервере(Настройка)
	
	НастройкаПрайсЛистаОбъект = Настройка.ПолучитьОбъект();
	
	НастройкаПрайсЛистаОбъект.Настройки = Новый ХранилищеЗначения(Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	НастройкаПрайсЛистаОбъект.Записать();

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	Если НЕ ЗначениеЗаполнено(Настройка) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкуНаСервере(Настройка); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
    Форма = ПолучитьФорму("Справочник.НастройкиПрайсЛиста.ФормаВыбора",, Элемент);
    ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтраницаПрайсЛиста");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = ПолучитьСсылкуСтраницуПрайсЛистаПотолок();  
    Форма.Открыть(); 
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьСсылкуСтраницуПрайсЛистаПотолок()
	Возврат Справочники.СтраницыПрайсЛиста.Полотна.Ссылка;
КонецФункции	
