#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	ОрганизацияПолучатель = Организация;
	
	Если ЭтоНовый() Тогда
		СлужебныйКонтролироватьЗаполнениеЗаявки = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств");
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		Организация = ДанныеЗаполнения.Организация;
		ОрганизацияПолучатель = ДанныеЗаполнения.Организация;
		КассаОтправитель = ДанныеЗаполнения.Касса;
		Основание = ДанныеЗаполнения.Ссылка;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаПеремещениеДенежныхСредств") Тогда	
		
		ФинансыСервер.ПроверитьВозможностьВводаНаОснованииЗаявки(ДанныеЗаполнения);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,
			"Организация, ОрганизацияПолучатель, КассаОтправитель, КассаПолучатель, Валюта, ВалютаПолучатель, Сумма, СуммаПолучатель, Статья");
		Основание = ДанныеЗаполнения.Ссылка;
		Если ДанныеЗаполнения.ЖелательнаяДатаПлатежа <> Дата(1,1,1) тогда
			Дата = ДанныеЗаполнения.ЖелательнаяДатаПлатежа;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПолеСтатьяДДСОбязательно = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();	
	Если НЕ ЗначениеЗаполнено(Статья) И ПолеСтатьяДДСОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         	НСтр("ru = 'Не заполнена статья движения денежных средств!'"), ЭтотОбъект,
        	"Статья",,Отказ);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ФинансыСервер.ПроверитьЗаполнениеНаОснованииЗаявкиНаПеремещение(ЭтотОбъект, Отказ, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ КассаОтправитель.Валюта = Валюта Тогда
		Если КассаОтправитель.КонтролироватьВалюту Тогда
			Сообщить("Касса " + КассаОтправитель + " хранит только валюту " + КассаОтправитель.Валюта + ". В документе указана валюта " + Валюта + ". Проведение отменено.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НЕ КассаПолучатель.Валюта = ВалютаПолучатель Тогда
		Если КассаПолучатель.КонтролироватьВалюту Тогда
			Сообщить("Касса " + КассаПолучатель + " хранит только валюту " + КассаПолучатель.Валюта + ". В документе указана валюта " + ВалютаПолучатель + ". Проведение отменено.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НЕ КассаОтправитель.Владелец = Организация Тогда
		Сообщить("Касса " + КассаОтправитель + " не принадлежит организации "+Организация+". Проведение отменено.");
		Отказ = Истина;
	КонецЕсли;
	Если НЕ КассаПолучатель.Владелец = ОрганизацияПолучатель Тогда
		Сообщить("Касса " + КассаПолучатель + " не принадлежит организации "+ОрганизацияПолучатель+". Проведение отменено.");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Константы.НеКонтролироватьОстатокДенежныхСредств.Получить() Тогда
		//контроль остатка денежных средств
		ДатаДокумента = Дата;
		Если ДатаДокумента = Дата(1,1,1) Тогда
			ДатаДокумента = ТекущаяДатаСеанса();
		КонецЕсли;
		СуммаОстаток = 0;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(
		|			&ДатаОстатков,
		|			Валюта = &Валюта
		|				И Организация = &Организация
		|				И СчетКасса = &СчетКасса) КАК ДенежныеСредстваОстатки";
		Запрос.УстановитьПараметр("ДатаОстатков",ДатаДокумента);
		Запрос.УстановитьПараметр("Валюта",Валюта);
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.УстановитьПараметр("СчетКасса",КассаОтправитель);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СуммаОстаток = Выборка.СуммаОстаток;
		КонецЦикла;
		Если СуммаОстаток < Сумма Тогда
			Сообщить("В кассе "+КассаОтправитель+" организации "+Организация+" остаток средств = " + СуммаОстаток + " " + Валюта + ". не хватает " + (Сумма - СуммаОстаток)+ " " + Валюта);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// регистр ДенежныеСредства Расход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.СчетКасса = КассаОтправитель;
	Движение.Валюта = Валюта;
	Движение.Сумма = Сумма;

	// регистр ДенежныеСредства Приход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = ОрганизацияПолучатель;
	Движение.СчетКасса = КассаПолучатель;
	Движение.Валюта = ВалютаПолучатель;
	Движение.Сумма = СуммаПолучатель;
	
	// регистр ДвиженияДенежныеСредства Расход
	Если ЗначениеЗаполнено(Статья) И ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоСтатьямДДС") Тогда
		Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СчетКасса = КассаОтправитель;
		Движение.СуммаРасход = Сумма;
		Движение.Статья = Статья;
		Движение.Валюта = Валюта;
	КонецЕсли;
	
	// регистр ДвиженияДенежныеСредства Приход
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Движение = Движения.ДвиженияДенежныхСредств.Добавить();
	Движение.Период = Дата;
	Движение.Организация = ОрганизацияПолучатель;
	Движение.СчетКасса = КассаПолучатель;
	Движение.СуммаПриход = СуммаПолучатель;
	Движение.Статья = Статья;
	Движение.Валюта = ВалютаПолучатель;

	// регистр ДенежныеСредстваКВыплате Расход
	Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаПеремещениеДенежныхСредств") Тогда
		Движения.ДенежныеСредстваКВыплате.Записывать = Истина;
		Движение = Движения.ДенежныеСредстваКВыплате.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Заявка = Основание;
		Движение.Сумма  = Сумма;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли