
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОб = РеквизитФормыВЗначение("Объект");
    Фото = ПоместитьВоВременноеХранилище(ТекОб.Фото.Получить(), УникальныйИдентификатор);
	
	Элементы.ГруппаМобильныйПостроитель.Видимость = Константы.ИспользоватьОбменСПорталом.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Врем = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	ТекущийОбъект.Фото = Врем;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ФотоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	АдресФайла = ОткрытьФотоНаСервере();
	Если Не АдресФайла = Неопределено Тогда
		ПолучитьФайл(АдресФайла, СокрЛП(Объект.Наименование) + ".jpg");
	Иначе
		Если Вопрос("Изображение отсутствует. Загрузить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ИзменитьФото(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОткрытьФотоНаСервере()
	ТекОб = РеквизитФормыВЗначение("Объект");
	Хранилище = ТекОб.Фото.Получить();
	Если Не Хранилище = Неопределено Тогда
		Возврат ПоместитьВоВременноеХранилище(Хранилище, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ИзменитьФото(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Фильтр = ОбщийМодульКлиентСервер.ФильтрФайловИзображений();
	ДиалогОткрытияФайла.Заголовок = "Выберите изображение";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьФотоФрагмент", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры
		
&НаКлиенте	
Процедура ИзменитьФотоФрагмент(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
		
	Если ВыбранныеФайлы = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Файл не выбран!'; en = 'File not selected!'"));
		Возврат;
	КонецЕсли;
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ИзменитьФотоЗавершение", ЭтотОбъект),, ВыбранныеФайлы[0], Ложь, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФотоЗавершение(Успешно, АдресВХранилище, ВыбранноеИмяФайла, ДопПараметры) Экспорт
	
	Если Не Успешно Тогда
		Возврат;
	КонецЕсли;
	
	Фото = АдресВХранилище; //НавигационнаяСсылкаКартинки(АдресВХранилище, УникальныйИдентификатор);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(Данные, ИдентификаторФормы)
	
	Хранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(Данные));
	АдресКартинки = ПоместитьВоВременноеХранилище(Хранилище.Получить(), ИдентификаторФормы);
	Возврат АдресКартинки;
	
КонецФункции