
&НаСервере
Функция ВыполнитьОбменПолныйНаСервере()
	Возврат ОбщийМодуль.ОбменСПорталомПолный(Объект.Ссылка);
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПолномОбмене(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    Если ВыполнитьОбменПолныйНаСервере() Тогда
		ПоказатьПредупреждение(,"Обмен выполнен успешно");
	Иначе
		ПоказатьПредупреждение(,"Ошибка выполнения обмена. Описание ошибки смотри в журнале регистрации");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменПолный(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПолномОбмене", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Выполнение ПОЛНОГО обмена может занимать продолжительное время. Продолжить?", Режим, 0);

КонецПроцедуры

&НаСервере
Функция ВыполнитьОбменНаСервере()
	Возврат ОбщийМодуль.ОбменСПорталомПоИзменениям(Объект.Ссылка);
КонецФункции

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОбмене", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Выполнение обмена может занимать продолжительное время. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОбмене(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    Если ВыполнитьОбменНаСервере() Тогда
		ПоказатьПредупреждение(,"Обмен выполнен успешно");
	Иначе
		ПоказатьПредупреждение(,"Ошибка выполнения обмена. Описание ошибки смотри в журнале регистрации");
	КонецЕсли;

КонецПроцедуры
