Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//++ №8747 комментируем
	//Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СебестоимостьУслугВСебестоимостиПотолка"));
	//Параметр.Значение = Константы.ВключатьВыработкуСотрудниковПроизводстваВСебестоимостьПродукции.Получить();
	//-- №8747
	
	Настройки = КомпоновщикНастроек.Настройки;
	//#14828
	ОтчетыПотолки.НастроитьОтображениеГруппировкиПодразделение(Настройки);
				
КонецПроцедуры