Функция ОтправитьСМС(пЗадача) Экспорт
	
	
	//Арчил Тваладзе 2016.04.25
    ПользовательЗадачи = пЗадача.Пользователь;	
	// для монолита
	Если ПользовательЗадачи.Пустая() Тогда
		ВызватьИсключение "Для отправки sms должен быть указан пользователь!";
	КонецЕсли;
	
	ФизЛицоПользователяЗадачи =РегистрыСведений.ИА_ДанныеФизЛиц.ПолучитьПользователяФизЛица(ПользовательЗадачи);
	Если ФизЛицоПользователяЗадачи.Пустая() Тогда
		ВызватьИсключение "Для отправки sms должено быть указано физ. лицо, в регистре сведений Данные физлиц!";
	КонецЕсли;
	
	//фл = пЗадача.Пользователь.ФизЛицо;
	//Конец Арчил Тваладзе
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект
	               |	И КонтактнаяИнформация.Тип = &Тип";
	Запрос.УстановитьПараметр("Объект", ФизЛицоПользователяЗадачи);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Выборка = Запрос.Выполнить().Выбрать();
	
	тел = "";
	Пока Выборка.Следующий() Цикл
		врТел = УдалитьБуквыИзНомераТелефона(Выборка.Представление);
		Если СтрДлина(врТел) = 11 Тогда
			Если лев(врТел,1) = "8" Тогда
				врТел = "7" + Сред(врТел, 2, 10);
			КонецЕсли;
			тел = врТел;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если тел="" Тогда
		ВызватьИсключение "У "+ФизЛицоПользователяЗадачи+" не найден номер сотового телефона!";
	КонецЕсли;
	
	/////// ИЗМЕНИТЬ!!!! /////
	учетка = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоКоду("000000006");
	
	/////// ИЗМЕНИТЬ!!!! /////
	кудаОтправляем = "mvernig@mail.ru";
	
	НовПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	НовПисьмо.Дата = ТекущаяДата();
	НовПисьмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;	
	НовПисьмо.УчетнаяЗапись = учетка;
	
	кому = НовПисьмо.КомуТЧ.Добавить(); 
	кому.АдресЭлектроннойПочты = кудаОтправляем;
	кому.Представление = кудаОтправляем;
	
	НовПисьмо.Кому = кудаОтправляем;
	НовПисьмо.КомуПредставление = кудаОтправляем;
	
	НовПисьмо.ЗаполнитьПредставленияПолейКомуКопии();
	
	/////// ИЗМЕНИТЬ!!!! /////
	НовПисьмо.ТекстПисьма = "тест" + Символы.ПС + "ляляля";
	//НовПисьмо.Записать();
	НовПисьмо.ОтправитьПисьмо();
	
КонецФункции

Функция УдалитьБуквыИзНомераТелефона(НомерТелефона) 
	ТолькоЦифрыНомера = "";
	Для а=1 По СтрДлина(НомерТелефона) Цикл
		Если СтрЧислоВхождений("1234567890",Сред(НомерТелефона,а,1)) > 0 Тогда
			ТолькоЦифрыНомера = ТолькоЦифрыНомера + Сред(НомерТелефона,а,1);
		КонецЕсли;
	КонецЦикла;
	Возврат ТолькоЦифрыНомера;
КонецФункции