
&НаСервере
Процедура СохранитьНастройкиНаСервере()
	НастройкиСКД = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста = ЗНАЧЕНИЕ(Справочник.СтраницыПрайсЛиста.Полотна)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НастройкаПрайсЛистаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Иначе
		НастройкаПрайсЛистаОбъект = Справочники.НастройкиПрайсЛиста.СоздатьЭлемент();
		НастройкаПрайсЛистаОбъект.СтраницаПрайсЛиста = Справочники.СтраницыПрайсЛиста.Полотна;
		НастройкаПрайсЛистаОбъект.Наименование = "ПОЛОТНА";
	КонецЕсли;
	
	НастройкаПрайсЛистаОбъект.Настройки = Новый ХранилищеЗначения(НастройкиСКД);
	
	НастройкаПрайсЛистаОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	СтандартнаяОбработка =  Ложь;
	
	// получаем сохранённые настройки, если они есть
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста = ЗНАЧЕНИЕ(Справочник.СтраницыПрайсЛиста.Полотна)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Настройки = ВыборкаДетальныеЗаписи.Ссылка.Настройки.Получить();
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;	
	
	//Если ЗначениеЗаполнено(ИмяВарианта)  Тогда
	//	Настройки=СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВарианта].Настройки;
	//КонецЕсли;                         
	
	ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрПериод.Значение = ТекущаяДата();
	ПараметрПериод.Использование = Истина;

	//Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение.Дата = ТекущаяДата();
	
КонецПроцедуры
