#Область ОбработкаСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	Валюта = Константы.ВалютаУчета.Получить();
	
	//МассивВидов = Новый Массив;
	//МассивВидов.Добавить(Справочники.ВидыНоменклатуры.Отрез);
	//МассивВидов.Добавить(Справочники.ВидыНоменклатуры.ТиповойОтрез);
	//МассивВидов.Добавить(Справочники.ВидыНоменклатуры.Потолок);	
	//Для каждого ЭлементМассива из МассивВидов Цикл
	//	НоваяСтрока = ВидыНоменклатурыПотолка.Добавить();	
	//	НоваяСтрока.ВидНоменклатуры = ЭлементМассива;
	//	НоваяСтрока.КлючСвязи = Строка(Новый УникальныйИдентификатор);
	//КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидПродукции"));	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Валюта.Пустая() Тогда
		Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Материалы Цикл
		Если ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена Тогда
			ТекСтрока.Цена = 0;
			ТекСтрока.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
			ТекСтрока.ЦенаСФотопечатью = 0;
			ТекСтрока.ВидЦеныСФотопечатью = Справочники.ВидыЦен.ПустаяСсылка();
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрока.ВидЦены) Тогда
			ТекСтрока.Цена = 0;                                     
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрока.ВидЦеныСФотопечатью) Тогда
			ТекСтрока.ЦенаСФотопечатью = 0;                                     
		КонецЕсли;
	КонецЦикла;
	
	//#12615	
	Если ЦенаСФотопечатьюОтличается	И ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
		ЦенаСФотопечатьюОтличается = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ЭтоПродукция = Ложь;
	Если ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция") Тогда
		ЭтоПродукция = Истина;
		ЦеныНаПродукциюПоШаблону    = (СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоШаблону);
		ЦеныНаПродукциюПоПараметрам = (СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоПараметрам);
		ЦеныНаПродукциюПоНоменклатуре = (СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоНоменклатуре);
	КонецЕсли;
	
	ЭтоПотолокОтрез = (ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок")
					ИЛИ ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"));
	
	// регистр ЦеныМатериаловИндивидуальные
	Если ЭтоПотолокОтрез 
		ИЛИ (ЭтоПродукция И ЦеныНаПродукциюПоШаблону) 
		ИЛИ (ЭтоПродукция И ЦеныНаПродукциюПоНоменклатуре)
		Тогда
		
		Движения.ЦеныМатериаловИндивидуальные.Записывать = Истина;
		Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
			ЦенаСФотопечатью = ?(ЦенаСФотопечатьюОтличается, ТекСтрокаМатериалы.ЦенаСФотопечатью, ТекСтрокаМатериалы.Цена); //#12615
			Движение = Движения.ЦеныМатериаловИндивидуальные.Добавить();
			Движение.Период 			= Дата;
			Движение.Валюта 			= Валюта;
			Движение.Контрагент 		= Контрагент;
			Движение.ДоговорКонтрагента = ДоговорКонтрагента;
			Движение.ВидНоменклатуры 	= ВидНоменклатуры;
			Движение.Цена 				= ТекСтрокаМатериалы.Цена;
			Движение.ВидЦены 			= ТекСтрокаМатериалы.ВидЦены;		
			Движение.Наценка 			= ТекСтрокаМатериалы.Наценка;		
			Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
				Если ЦеныНаПродукциюПоШаблону Тогда
					Движение.Шаблон 		= ТекСтрокаМатериалы.Шаблон;
				ИначеЕсли ЦеныНаПродукциюПоНоменклатуре Тогда
					Движение.Номенклатура 		= ТекСтрокаМатериалы.Номенклатура;
					Движение.ЕдиницаИзмерения 	= ТекСтрокаМатериалы.ЕдиницаИзмерения;
				КонецЕсли;
			Иначе
				Движение.Фактура 		= ТекСтрокаМатериалы.Фактура;
				Движение.ЦветФактуры 	= ТекСтрокаМатериалы.ЦветФактуры;
				Движение.ВидЦеныСФотопечатью	= ТекСтрокаМатериалы.ВидЦеныСФотопечатью;
				Движение.НаценкаСФотопечатью 	= ТекСтрокаМатериалы.НаценкаСФотопечатью;		
				Движение.ЦенаСФотопечатью 		= ЦенаСФотопечатью;
			КонецЕсли;
			Движение.Отменена			= (ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена);
		КонецЦикла;
		
	КонецЕсли;	
	
	// регистр ЦеныПараметровПродукцииИндивидуальные
	Если ЭтоПродукция И ЦеныНаПродукциюПоПараметрам Тогда
		Движения.ЦеныПараметровПродукцииИндивидуальные.Записывать = Истина;
		Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
			Движение = Движения.ЦеныПараметровПродукцииИндивидуальные.Добавить();
			Движение.Период 			= Дата;
			Движение.Валюта 			= Валюта;
			Движение.Контрагент 		= Контрагент;
			Движение.ДоговорКонтрагента = ДоговорКонтрагента;
			Движение.ВидПродукции 		= ВидПродукции;
			Движение.ПараметрПродукции 	= ТекСтрокаМатериалы.ПараметрПродукции;
			Движение.Цена 				= ТекСтрокаМатериалы.Цена;
			Движение.ВидЦены 			= ТекСтрокаМатериалы.ВидЦены;		
			Движение.Наценка 			= ТекСтрокаМатериалы.Наценка;		
			
			Движение.Отменена			= (ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
