
Процедура ПередЗаписью(Отказ)
	Если не ЭтоНовый() Тогда
		НачатьТранзакцию();
		Попытка
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ИА_НастройкаФППолитикаРаспределенияПервичная.Ссылка
			               |ИЗ
			               |	Документ.ИА_ФП_Настройка.Политика1 КАК ИА_НастройкаФППолитикаРаспределенияПервичная
			               |ГДЕ
			               |	ИА_НастройкаФППолитикаРаспределенияПервичная.Значение ПОДОБНО ""%Итог:"+ссылка.Наименование+"]%""
						   | ОБЪЕДИНИТЬ ВСЕ 
						   |ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ПолитикаРаспределения.Ссылка
			               |ИЗ
			               |	Документ.ИА_ФП_Настройка.Политика2 КАК ПолитикаРаспределения
			               |ГДЕ
			               |	ПолитикаРаспределения.Значение ПОДОБНО ""%Итог:"+ссылка.Наименование+"]%"" ";
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ДокОб = Выборка.Ссылка.ПолучитьОбъект();
				Для каждого стр из ДокОб.Политика1 Цикл
					стр.Значение = СтрЗаменить(стр.Значение,"Итог:"+ссылка.Наименование+"]", "Итог:"+ЭтотОбъект.Наименование+"]"); 
				КонецЦикла;
				
				Для каждого стр из ДокОб.Политика2 Цикл
					стр.Значение = СтрЗаменить(стр.Значение,"Итог:"+ссылка.Наименование+"]", "Итог:"+ЭтотОбъект.Наименование+"]"); 
				КонецЦикла;
				
				ДокОб.Записать();
			КонецЦикла;
		Исключение               
			Сообщить(ОписаниеОшибки());
			ОтменитьТранзакцию();
			Отказ = истина;
			Возврат;
		КонецПопытки;
		
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры
