
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеОткрытьФормуВопроса(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		Если ВРЕГ(РезультатОткрытияФормы) = "ДА" Тогда
			ЗакрытьСПередачейРезультата();
		КонецЕсли;
	КонецЕсли;
	ПервыйВвод = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоСимволовПослеЗапятой = 2;
	ПервыйВвод = Истина;
	
	Если Параметры.Свойство("ФорматироватьСтроку") Тогда
		ФорматироватьСтроку = Параметры.ФорматироватьСтроку;
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("МаксимальноеЗначение") Тогда
		МаксимальноеЗначение = Параметры.МаксимальноеЗначение;
	КонецЕсли;
	
	Если Параметры.Свойство("ЧислоВвода") Тогда
		ЧислоВвода    = Параметры.ЧислоВвода;
		ВводимаяСумма = Формат(ЧислоВвода, "ЧЦ=15 ЧДЦ=2");
	КонецЕсли;
	
	Если Параметры.Свойство("Отрицательное") Тогда
		Отрицательное = Параметры.Отрицательное;
	КонецЕсли;
	
	Если Параметры.Свойство("АвторизацияЭТ") Тогда
		АвторизацияЭТ = Параметры.АвторизацияЭТ;
	КонецЕсли;
	
	Если Параметры.Свойство("ВозвращатьЧислоСтрокой") Тогда
		ВозвращатьЧислоСтрокой = Параметры.ВозвращатьЧислоСтрокой;
	КонецЕсли;
	
	Если Параметры.Свойство("ПроверяемоеМинимальноеЗначение") Тогда
		ПроверяемоеМинимальноеЗначение = Параметры.ПроверяемоеМинимальноеЗначение;
	КонецЕсли;
	
	Если Параметры.Свойство("ПроверочныйВопрос") Тогда
		ПроверочныйВопрос = Параметры.ПроверочныйВопрос;
	КонецЕсли;
	
	Если Не АвторизацияЭТ Тогда
		
		//Элементы.ДекорацияНомерКарты.Видимость = Ложь;
		
	КонецЕсли;
	
	ВидимостьКомандыПовтора = Ложь;
	Если Параметры.Свойство("КодПроверкиСМС") Тогда
		КодПроверкиСМС = Параметры.КодПроверкиСМС;
		ВидимостьКомандыПовтора = Истина;
		// эти параметры должны идти только вместе
		НомерТелефонаСМС = Параметры.НомерТелефонаСМС;
	КонецЕсли;
	Элементы.ОтправитьКодПодтвержденияПовторноПраваяКлавиатура.Видимость = ВидимостьКомандыПовтора;
	Элементы.ОтправитьКодПодтвержденияПовторно.Видимость = ВидимостьКомандыПовтора;
	Элементы.ПолеКартинкаПустая.Видимость = НЕ ВидимостьКомандыПовтора;
	Элементы.ПолеКартинкаПустаяПраваяКлавиатура.Видимость = НЕ ВидимостьКомандыПовтора;		
	
	//Элементы.ДекорацияНомерКарты.Заголовок = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
				|""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КомандаСумма(Неопределено);
	
	Если АвторизацияЭТ Тогда
		// Проверка и подключение считывателей МК.
		//ПоддерживаемыеТипыПО = Новый Массив();
		//ПоддерживаемыеТипыПО.Добавить("СчитывательМагнитныхКарт");
		//ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);  
		//МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(,ЭтотОбъект, ПоддерживаемыеТипыПО);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если АвторизацияЭТ Тогда
		// Отключение считывателей МК
		//ПоддерживаемыеТипыПО = Новый Массив();
		//ПоддерживаемыеТипыПО.Добавить("СчитывательМагнитныхКарт");

		//МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(,ЭтотОбъект, ПоддерживаемыеТипыПО);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Если Источник = "ПодключаемоеОборудование"
	//   И ВводДоступен() Тогда
	//	Если ИмяСобытия = "TracksData" Тогда
	//		ТекКод = Параметр[0];
	//		ПодключаемоеОборудованиеРТКлиент.ВыбратьМагнитныйКод(ТекКод);
	//		Если ПустаяСтрока(ТекКод) Тогда
	//			Возврат;
	//		КонецЕсли;
	//		ВводимоеЧисло = ТекКод;
	//		ПервыйВвод = Истина;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		
		ОписаниеСобытия = Новый Структура();
		ОписаниеОшибки  = "";
		ОписаниеСобытия.Вставить("Источник", Источник);
		ОписаниеСобытия.Вставить("Событие",  Событие);
		ОписаниеСобытия.Вставить("Данные",   Данные);
		
		Результат = МенеджерОборудованияКлиент.ПолучитьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
		Если Результат = Неопределено Тогда 
			ЗаголовокСообщения = НСтр("ru = 'При обработке внешнего события от устройства произошла ошибка:'");
			ОбщийМодульКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокСообщения, ОписаниеОшибки);
		Иначе
			ОбработкаОповещения(Результат.ИмяСобытия, Результат.Параметр, Результат.Источник);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда0(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда0ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаТочка(Команда)
	
	Если ПервыйВвод Тогда
		ВводимаяСумма = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	
	Если ВводимаяСумма = "" Тогда
		ВводимаяСумма = "0";
	КонецЕсли;
	
	ЧислоВхождений = СтрЧислоВхождений(ВводимаяСумма, ",");
	
	Если Не ЧислоВхождений > 0 Тогда
		ВводимаяСумма = ВводимаяСумма + ",";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтереть(Команда)
	ВводимаяСумма = "";
	ПервыйВвод = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КомандаEnter(Команда)
	
	ЗаданПроверочныйВопрос = Ложь;
	Если ЗначениеЗаполнено(ПроверяемоеМинимальноеЗначение)
		И ЗначениеЗаполнено(ПроверочныйВопрос) Тогда
		ВведенноеЧисло = ПривестиСтрокуКЧислу(ВводимаяСумма, Ложь);
		Если ВведенноеЧисло < ПроверяемоеМинимальноеЗначение Тогда
			
			ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВопроса", ЭтотОбъект);
			ОбщийМодульКлиент.ВывестиВопросДляРМКУправляемой(ЭтотОбъект.Заголовок,ПроверочныйВопрос,,ОбработчикОповещения);
			
			ЗаданПроверочныйВопрос = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗаданПроверочныйВопрос Тогда
	
		ЗакрытьСПередачейРезультата();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКодПроверкиПовторно(Команда)
	
	РезультатОтправки = ОтправитьСообщениеСКодом();
	Если НЕ РезультатОтправки.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось отправить сообщение с кодом проверки по причине:'") + Символы.ПС + РезультатОтправки.ОписаниеОшибки;
		ЗаголовокИнформации = НСтр("ru = 'Выбор карты не возможен'");
		ОбщийМодульКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции


//	
//	Если ПервыйВвод Тогда
//		ВводимоеЧисло = "";
//		ПервыйВвод = Ложь;
//	КонецЕсли;
//	
//	Запятая = Сред(ВводимоеЧисло, СтрДлина(ВводимоеЧисло) - КоличествоСимволовПослеЗапятой, 1);
//	
//	Если НЕ Запятая = "," Тогда
//		ВводимоеЧисло = ВводимоеЧисло + ВведеннаяЦифраСтрокой;
//	КонецЕсли;
//	
//	Если ПолеРедактирования = "Количество" Тогда
//		ВводимоеКоличество = ВводимоеЧисло;
//	ИначеЕсли ПолеРедактирования = "Цена" Тогда
//		ВводимаяЦена = ВводимоеЧисло;
//	КонецЕсли;
//	
//	ТекущийЭлемент = Элементы.КомандаEnter;
	
&НаКлиенте
Процедура ДобавитьЦифру(ВведеннаяЦифраСтрокой)
	
	Если ПолеРедактирования = "Сумма" Тогда
		ВводимоеЧисло = ВводимаяСумма;
		КоличествоСимволовПослеЗапятой = 2;
	ИначеЕсли ПолеРедактирования = "НомерКарты" Тогда
		ВводимоеЧисло = ВводимыйНомерКарты;
		КоличествоСимволовПослеЗапятой = 0;
	Иначе
		Возврат;
	КонецЕсли;

	Если ПервыйВвод Тогда
		ВводимоеЧисло = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	
	Запятая = Сред(ВводимоеЧисло, СтрДлина(ВводимоеЧисло) - КоличествоСимволовПослеЗапятой, 1);
	
	Если НЕ Запятая = "," Тогда
		ВводимоеЧисло = ВводимоеЧисло + ВведеннаяЦифраСтрокой;
	КонецЕсли;
	
	Если ПолеРедактирования = "Сумма" Тогда
		
		ЧислоВвода = ПривестиСтрокуКЧислу(ВводимоеЧисло, Истина);
		
		Если ЗначениеЗаполнено(МаксимальноеЗначение) И ЧислоВвода > МаксимальноеЗначение Тогда
			ЧислоВвода = МаксимальноеЗначение;
			ВводимоеЧисло = Формат(ЧислоВвода, "ЧЦ=15; ЧДЦ=2");
		КонецЕсли;
		
		Если ФорматироватьСтроку 
			И СтрДлина(ВводимаяСумма)>20 Тогда
			ВводимоеЧисло = Формат(ЧислоВвода, "ЧЦ=15; ЧДЦ=2");			
		КонецЕсли;
		
		ВводимаяСумма = ВводимоеЧисло;
		
	ИначеЕсли ПолеРедактирования = "НомерКарты" Тогда
		ВводимыйНомерКарты = ВводимоеЧисло;
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.КомандаEnter;
	
КонецПроцедуры

// Функция выполняет приведение строки к числу.
// Параметры:
//  ЧислоСтрокой           - Строка - Строка приводимая к числу.
//  ВозвращатьНеопределено - Булево - Если Истина и строка содержит некорректное значение, то возвращать Неопределено.
//
// Возвращаемое значение:
//  Число
//
&НаКлиенте
Функция ПривестиСтрокуКЧислу(ЧислоСтрокой, ВозвращатьНеопределено = Ложь)
	
	Если ЗначениеЗаполнено(ЧислоСтрокой) Тогда
		ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
		ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);
	Иначе
		ЗначениеЧисла = 0;
	КонецЕсли;
		
	Если ВозвращатьНеопределено И (ЗначениеЧисла = 0) Тогда
		
		Стр = Строка(ЧислоСтрокой);
		Если Стр = "" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Стр = СтрЗаменить(СокрЛП(Стр), "0", "");
		Если (Стр <> "") И (Стр <> ".") И (Стр <> ",") Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеЧисла;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьСПередачейРезультата()
	
	СтруктураОтвета = Новый Структура;
	Если ВозвращатьЧислоСтрокой Тогда
		СтруктураОтвета.Вставить("ВведенноеЧисло", ВводимаяСумма);
	Иначе
		СтруктураОтвета.Вставить("ВведенноеЧисло", ПривестиСтрокуКЧислу(ВводимаяСумма, Истина));
	КонецЕсли;
	
	СтруктураОтвета.Вставить("ДанныеКарты", ДанныеКарты);
	СтруктураОтвета.Вставить("НомерКарты", 	ВводимыйНомерКарты);
	СтруктураОтвета.Вставить("ВидКарты", 	ВводимыйВидКарты);
	
	Закрыть(СтруктураОтвета)
	
КонецПроцедуры

&НаСервере
Функция ОтправитьСообщениеСКодом()
	
	Возврат 0; //РозничныеПродажиСервер.ОтправитьСообщениеСКодом(КодПроверкиСМС, НомерТелефонаСМС);
	
КонецФункции

&НаКлиенте
Процедура КомандаСумма(Команда)

	ПолеРедактирования = "Сумма";
	ПервыйВвод = Истина;
	Элементы.ВводимаяСумма.ТолькоПросмотр = Ложь;
	Элементы.ВводимыйНомерКарты.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНомерКарты(Команда)
	
	ПолеРедактирования = "НомерКарты";
	ПервыйВвод = Истина;
	Элементы.ВводимаяСумма.ТолькоПросмотр = Истина;
	Элементы.ВводимыйНомерКарты.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВидКарты(Команда)
	
	ПолеРедактирования = "ВидКарты";
	ПервыйВвод = Истина;
	
	Элементы.ВводимаяСумма.ТолькоПросмотр = Истина;
	Элементы.ВводимыйНомерКарты.ТолькоПросмотр = Истина;
    
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВыбораВидаКарты", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Справочник.ВидыПлатежныхКарт.ФормаВыбора",,,,,, ОбработчикОповещения, Режим);

КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВыбораВидаКарты(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатОткрытияФормы) Тогда
		ВводимыйВидКарты = РезультатОткрытияФормы;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

