
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Основание = Параметры.Основание;
	МассивОснований = новый Массив;
	МассивНоменклатуры = Новый Массив;
	
	// документы: основание и основания основания
	МассивОснований.Добавить(Основание);
	//МетаданныеОснования = Основание.Метаданные();	
	//Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Основание", МетаданныеОснования) Тогда
	//	ДокументСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Основание");
	//	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
	//		МассивОснований.Добавить(ДокументСсылка);
	//	КонецЕсли;
	//КонецЕсли;
	//Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДокументОснование", МетаданныеОснования) Тогда
	//	ДокументСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ДокументОснование");
	//	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
	//		МассивОснований.Добавить(ДокументСсылка);
	//	КонецЕсли;
	//КонецЕсли;
	//Если НЕ Основание.Метаданные().ТабличныеЧасти.Найти("Основания") = Неопределено ТОгда
	//	Для каждого СтрокаТЧ из Основание.Основания Цикл
	//		Если ЗначениеЗаполнено(СтрокаТЧ.Основание) И МассивОснований.Найти(СтрокаТЧ.Основание) = Неопределено Тогда
	//			МассивОснований.Добавить(СтрокаТЧ.Основание);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	СтруктураПодчиненностиПотолки.ПолучитьРодительскиеДокументы(Основание, МассивОснований);
	
	// номенклатура в документах 
	Для каждого ДокументСсылка из МассивОснований Цикл
		МетаданныеДокумента = ДокументСсылка.Метаданные();
		Для каждого ТабличнаяЧасть из МетаданныеДокумента.ТабличныеЧасти Цикл
			Если НЕ ТабличнаяЧасть.Реквизиты.Найти("Номенклатура") = Неопределено Тогда
				Для каждого СтрокаТЧ из ДокументСсылка[ТабличнаяЧасть.Имя] Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
						МассивНоменклатуры.Добавить(СтрокаТЧ.Номенклатура);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОснований, МассивНоменклатуры, Истина);
	
	ОбщийМодульСервер.ОбновитьСписокФайлов(ЭтотОбъект, МассивОснований);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	КоллекцияЭлементовДерева = ФайлыДерево.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Элементы.ФайлыДерево.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	//	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ФайлыДеревоДокумент.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФайлыДерево.НаименованиеФайла");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ФайлыДеревоНаименованиеФайла.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФайлыДерево.НаименованиеФайла");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	
	ТекущиеДанные = Элементы.ФайлыДерево.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено тогда
		Сообщить("Не выбран файл");
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Сообщить("Не выбран файл");
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Документ, ИмяФайла, Расширение", ТекущиеДанные.Документ, ТекущиеДанные.ИмяФайла, ТекущиеДанные.Расширение);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьФайл(Неопределено);
	
КонецПроцедуры




