
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РезультатПроверки = Параметры.РезультатПроверки;
	Если НЕ ТипЗнч(РезультатПроверки) = Тип("Структура") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ РезультатПроверки.ПроверкаТребуется Тогда
		Элементы.ГруппаПроверкаНеТребуется.Видимость = Истина;
		Элементы.ГруппаМобильныйЗамерщик.Видимость = Ложь;
		Элементы.ГруппаМобильныйМонтажника.Видимость = Ложь;
		Элементы.ГруппаПроверкиПотолка.Видимость = Ложь;
		
	Иначе
		Если НЕ РезультатПроверки.МобильныйЗамерщик_ПроверкаТребуется Тогда
			Элементы.ГруппаМобильныйЗамерщик.Видимость = Ложь;
		Иначе			
			Если РезультатПроверки.МобильныйЗамерщик_Результат Тогда
				Элементы.ДекорацияМобильныйЗамерщикИстина.Видимость = Истина;
				Элементы.ДекорацияМобильныйЗамерщикЛожь.Видимость = Ложь;
			Иначе
				Элементы.ДекорацияМобильныйЗамерщикИстина.Видимость = Ложь;
				Элементы.ДекорацияМобильныйЗамерщикЛожь.Видимость = Истина;
			КонецЕсли;
			Элементы.ДекорацияМобильныйЗамерщикТекст.Заголовок = РезультатПроверки.МобильныйЗамерщик_ТекстОтвета;
		КонецЕсли;
		
		Если НЕ РезультатПроверки.МобильныйМонтажник_ПроверкаТребуется Тогда
			Элементы.ГруппаМобильныйМонтажника.Видимость = Ложь;
		Иначе
			Если РезультатПроверки.МобильныйМонтажник_Результат Тогда
				Элементы.ДекорацияМобильныйМонтажникИстина.Видимость = Истина;
				Элементы.ДекорацияМобильныйМонтажникЛожь.Видимость = Ложь;
			Иначе
				Элементы.ДекорацияМобильныйМонтажникИстина.Видимость = Ложь;
				Элементы.ДекорацияМобильныйМонтажникЛожь.Видимость = Истина;
			КонецЕсли;
			Элементы.ДекорацияМобильныйМонтажникТекст.Заголовок = РезультатПроверки.МобильныйМонтажник_ТекстОтвета;
		КонецЕсли;
		
		Если НЕ РезультатПроверки.ПроверкаПотолка_ПроверкаТребуется Тогда
			Элементы.ГруппаПроверкиПотолка.Видимость = Ложь;
		Иначе
			Если РезультатПроверки.ПроверкаПотолка_Результат Тогда
				Элементы.ДекорацияПроверкаПотолкаИстина.Видимость = Истина;
				Элементы.ДекорацияПроверкаПотолкаЛожь.Видимость = Ложь;
			Иначе
				Элементы.ДекорацияПроверкаПотолкаИстина.Видимость = Ложь;
				Элементы.ДекорацияПроверкаПотолкаЛожь.Видимость = Истина;
			КонецЕсли;
			Элементы.ДекорацияПроверкаПотолкаТекст.Заголовок = РезультатПроверки.ПроверкаПотолка_ТекстОтвета;
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры
