// #14083

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга;
	БазоваяЕдиницаИзмерения= Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
	УчитыватьКакПотолокВОтчетахПоЭффективности = Истина;
	ШаблонНаименования = "Натяжной потолок, [Фактура], [Цвет], [Ширина]";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Цвет,
	|	ДанныеСправочника.Владелец КАК Фактура,
	|	ДанныеСправочника.Номенклатура КАК Полотно,
	|	ДанныеСправочника.УслугаУстановкиПотолка КАК Услуга,
	|	ДанныеСправочника.Владелец.ШиринаПолотна КАК Ширина
	|ИЗ
	|	Справочник.ЦветФактуры КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ПометкаУдаления
	|	И ДанныеСправочника.УслугаУстановкиПотолка = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеСправочника.Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТаблицаЦветов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для каждого СтрокаТЗ из ТаблицаЦветов Цикл
		НаименованиеУслуги = СтрЗаменить(ШаблонНаименования, "[Фактура]", 	Строка(СтрокаТЗ.Фактура));
		НаименованиеУслуги = СтрЗаменить(НаименованиеУслуги, "[Цвет]", 		Строка(СтрокаТЗ.Цвет));
		НаименованиеУслуги = СтрЗаменить(НаименованиеУслуги, "[Ширина]", 	Формат(СтрокаТЗ.Ширина, "ЧДЦ=; ЧГ="));
		СтрокаТЗ.НаименованиеУслуги = НаименованиеУслуги;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьПометки(Команда)
	
	Признак = (Команда.Имя = "УстановитьПометки");
	Для каждого СтрокаТЗ из ТаблицаЦветов Цикл
		СтрокаТЗ.Пометка = Признак;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатурыУслуг(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	СоздатьНоменклатурыУслугНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНоменклатурыУслугНаСервере()
	
	ПараметрыНоменклатуры = Новый Структура("Родитель, БазоваяЕдиницаИзмерения, ВидНоменклатуры, УчитыватьКакПотолокВОтчетахПоЭффективности");
	ЗаполнитьЗначенияСвойств(ПараметрыНоменклатуры, ЭтотОбъект);
	
	Для каждого СтрокаТЗ из ТаблицаЦветов Цикл
		Если НЕ СтрокаТЗ.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ЦветОбъект = СтрокаТЗ.Цвет.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ЦветОбъект.УслугаУстановкиПотолка) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыНоменклатуры.Вставить("Наименование", СтрокаТЗ.НаименованиеУслуги);
		ПараметрыНоменклатуры.Вставить("НаименованиеДляПечати", СтрокаТЗ.НаименованиеУслуги);
		
		Попытка
			СпрОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			СпрОбъект.Заполнить(ПараметрыНоменклатуры);			
			СпрОбъект.Записать();
			
			ЦветОбъект.УслугаУстановкиПотолка = СпрОбъект.Ссылка;			
			ЦветОбъект.Записать();
			
			СтрокаТЗ.Услуга = СпрОбъект.Ссылка;
		Исключение
			
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
