
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекстВопроса") Тогда
		ТекстВопроса = Параметры.ТекстВопроса;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьСПередачейРезультата(Результат)
	//СтруктураОтвета = Новый Структура;
	//СтруктураОтвета.Вставить("Ответ", Результат);
	//Закрыть(СтруктураОтвета)
	Закрыть(Результат)
КонецПроцедуры

&НаКлиенте
Процедура КомандаДа(Команда)
	 ЗакрытьСПередачейРезультата(КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНет(Команда)
	 ЗакрытьСПередачейРезультата(КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	 ЗакрытьСПередачейРезультата(КодВозвратаДиалога.Отмена);
КонецПроцедуры

#КонецОбласти