Функция   ФП2(Дата) Экспорт
    ДатаПерехода = ИА_БФСПИ.Константа_Значение("ДатаНачалаИспользованияФП2");
    Если ТипЗнч(ДатаПерехода) <> Тип("Дата")
        ИЛИ НЕ ЗначениеЗаполнено(ДатаПерехода)
        Тогда
        ДатаПерехода = Дата(2099,1,1);
    КонецЕсли; 
    
	Возврат НЕ ЗначениеЗаполнено(Дата) ИЛИ НачалоДня(Дата) >= ДатаПерехода;
КонецФункции

Функция   СтруктураВТЗ(Струк)
    ТЗ = ИА_БФС.ТЗ_НоваяТаблицаЗначений("Ключ, Значение");
    Для каждого КиЗ Из Струк Цикл
        ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), КиЗ);
    КонецЦикла;		
    
    Возврат ТЗ;
КонецФункции

Процедура ЗаполнитьЗапросы(Док, ДокНастройка, ПараметрыЗапросов, ПользовательскиеНастройки)
	Док.ЗапросыДанных.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_ЗапросыДанныхФондов.Ссылка,
	|	""[Запрос:"" + ИА_ЗапросыДанныхФондов.Наименование + ""]"" КАК Наименование
	|ИЗ
	|	Справочник.ИА_ЗапросыДанныхФондов КАК ИА_ЗапросыДанныхФондов
	|ГДЕ
	|	ИА_ЗапросыДанныхФондов.ПометкаУдаления = ЛОЖЬ";
	
	тз_Запросы = Запрос.Выполнить().Выгрузить();
	
	Если тз_Запросы.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ИспЗапросы = Новый Массив;
	
	Для каждого стрФ из ДокНастройка.ВидыДоходов Цикл
		Для каждого стрЗапр из тз_Запросы Цикл
			Если найти("[Запрос:"+стрФ.Значение +"]",стрЗапр.Наименование)>0 Тогда
				ИспЗапросы.Добавить(Новый Структура("Ссылка, Наименование, ИД",стрЗапр.Ссылка, стрЗапр.Наименование,  СтрЗаменить(стрФ.ИДСтроки, " ", ""))); 
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого стрФ из ДокНастройка.Политика1 Цикл
		Для каждого стрЗапр из тз_Запросы Цикл
			Если найти("[Запрос:"+стрФ.Значение+"]",стрЗапр.Наименование)>0 Тогда
				ИспЗапросы.Добавить(Новый Структура("Ссылка, Наименование, ИД",стрЗапр.Ссылка, стрЗапр.Наименование,  СтрЗаменить(стрФ.ИДСтрокиРаспределения, " ", ""))); 
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого стрФ из ДокНастройка.Политика2 Цикл
		Для каждого стрЗапр из тз_Запросы Цикл
			Если найти("[Запрос:"+стрФ.Значение+"]",стрЗапр.Наименование)>0 Тогда
				ИспЗапросы.Добавить(Новый Структура("Ссылка, Наименование, ИД",стрЗапр.Ссылка, стрЗапр.Наименование,  СтрЗаменить(стрФ.ИДСтрокиРаспределения, " ", ""))); 
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	Для каждого Запр из ИспЗапросы Цикл
		ПараметрыЗапроса1 = Новый Структура("ДатаНачала, ДатаКонца, Организация");
        ЗаполнитьЗначенияСвойств(ПараметрыЗапроса1, ПараметрыЗапросов);
		ПараметрыЗапроса1 = ДополнитьПользовательскимиПараметрами(ПараметрыЗапросов, Запр.ИД, ПользовательскиеНастройки); 
		
		Данные = КСУ_ФП_Веб_Общее.ВыполнитьЗапрос(Запр.Ссылка, ПараметрыЗапроса1);
		
		НовСтр = Док.ЗапросыДанных.Добавить();
		НовСтр.ИДСтроки = Запр.ИД;
		НовСтр.Запрос = Запр.Ссылка;
		НовСтр.ИмяПараметра = Запр.Наименование;
		
        Если Данные.Выполнен Тогда
            НовСтр.Сумма = Окр(Данные.Таб.Итог("Сумма"), 2);
            НовСтр.Расшифровка = ЗначениеВСтрокуВнутр(Данные);
        Иначе
            НовСтр.Сумма = 0;
            ВызватьИсключение ИА_БФКС.Стр_ПодставитьПараметрыВСтроку(
            "При получении данных по запрос '%1' возникла ошибка: %2"
            , Запр.Ссылка, Данные.ТекстОшибки);
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокумент(Док
    , ЗаполнитьДоходы           = Истина
    , ЗаполнитьДоходыИтого      = Истина
    , ЗаполнитьПолитику1        = Истина
	, ЗаполнитьПолитику2        = Истина
	, ЗаполнитьЗапросы          = Ложь
	, НеОчищатьРучные           = Ложь
	, ДокПредФП 				= Неопределено
	, ФпТБ 						= ложь 
	, ДокНастройка				= Неопределено
	, ИспДоходыПоПодразделениям	= ложь) Экспорт
    
    ФППоОрганизациям              = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	
	ТекПарамПериодов = ПолучитьПараметрыТекРаспределения(док.Организация, Док.Дата);
	
	Если ТекПарамПериодов <> Неопределено тогда
		Док.НеделяТБ = ТекПарамПериодов.ТекНеделя;
		Док.МесяцТБ = ТекПарамПериодов.ТекМесяц;
	КонецЕсли;
    
    Если ФППоОрганизациям Тогда
        ОтборДокументовФП = Новый Структура("Организация", Док.Организация);
    Иначе
        ОтборДокументовФП = Новый Структура;
    КонецЕсли; 
	
	док.МаржаПоПодразделениям.Очистить();
	док.ИтогоВЗаливкуПодразделениям.Очистить();
	
	Если ДокНастройка = Неопределено Тогда 
		Если ТекПарамПериодов = Неопределено Тогда
			ДокНастройка = Документы.ИА_ФП_Настройка.ПустаяСсылка();
			Док.ТБ =  ДокНастройка;
		Иначе
    		Запрос = новый запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ИА_ФП_Настройка.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.ИА_ФП_Настройка КАК ИА_ФП_Настройка
			               |ГДЕ
			               |	ИА_ФП_Настройка.Организация = &Организация
			               |	И ИА_ФП_Настройка.Проведен = ИСТИНА
			               |	И ИА_ФП_Настройка.Месяц = &Месяц
			               |	И ИА_ФП_Настройка.Месяц <> ДАТАВРЕМЯ(1, 1, 1)
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ИА_ФП_Настройка.Дата УБЫВ";
			Запрос.УстановитьПараметр("Организация", Док.Организация);
			Запрос.УстановитьПараметр("Месяц", ТекПарамПериодов.ТекМесяц);
			Выборка = запрос.Выполнить().Выбрать();
			Если выборка.Следующий() Тогда
				ДокНастройка = выборка.ссылка;		
			Иначе
				ДокНастройка = Документы.ИА_ФП_Настройка.ПустаяСсылка();
				Сообщить("На выбранный период нет ТБ!");
			КонецЕсли;
			Док.ТБ =  ДокНастройка;
		КонецЕсли;
		
		Док.ДатаПроведенияТБ =  Док.ТБ.ДатаПроведения;
	КонецЕсли;
	
	
    
    //ПараметрыЗапросов = Новый Структура("ДатаНачала, ДатаКонца, Организация", ?(ЗначениеЗаполнено(ДокПредФП), ДокПредФП.Дата, Дата(1,1,1)) + 1, Док.Дата, Док.Организация);
	Если ЗначениеЗаполнено(Док.Доходы_ДатаНачала) тогда
		Доходы_ДатаНачала = Док.Доходы_ДатаНачала;
		Доходы_ДатаКонца = Док.Дата;
	Иначе
		Если ДокПредФП = Неопределено тогда
	    	ДокПредФП    = НайтиПоследнийПоДатеДокумент("ИА_ФинансовоеПланирование", Док.Дата, Док.Ссылка, ОтборДокументовФП); 
		КонецЕсли;
		Доходы_ДатаНачала = ?(ЗначениеЗаполнено(ДокПредФП), ДокПредФП.Дата, Док.Дата - 60*60*24*7) + 1;
		Доходы_ДатаКонца = Док.Дата;
	КонецЕсли;
	
	ПараметрыЗапросов = Новый Структура("ДатаНачала, ДатаКонца, Организация", Доходы_ДатаНачала, Доходы_ДатаКонца, Док.Организация);
	
    ДанныеРасчета = Новый Структура;
    // "Доходы"
    ДанныеРасчета.Вставить("Доходы", ИА_БФС.ТЗ_НоваяТаблицаЗначений("Подразделение, ВидДохода, СпособЗаполнения, Сумма, СуммаНал, СуммаБезнал, ДанныеРасшифровки"));
    ДанныеРасчета.Вставить("ДоходыИзСпецДоходов", ИА_БФС.ТЗ_НоваяТаблицаЗначений("Подразделение, ВидДохода, Сумма, СуммаБезНал, СуммаНал"));
    ДанныеРасчета.Вставить("ДоходыИзСписанияФондов", ИА_БФС.ТЗ_НоваяТаблицаЗначений("Подразделение, ВидДохода, Сумма, СуммаБезНал, СуммаНал"));
    ДанныеРасчета.Вставить("ДоходыВСпецДоход", ИА_БФС.ТЗ_НоваяТаблицаЗначений("Подразделение, ВидДохода, Сумма, СуммаБезНал, СуммаНал"));
    ДанныеРасчета.Вставить("ДоходыИтого", ИА_БФС.ТЗ_НоваяТаблицаЗначений("Подразделение, ВидДохода, Сумма, СуммаБезНал, СуммаНал"));
	
    // Распределение политика 1
    ДанныеРасчета.Вставить("Политика1", ИА_БФС.ТЗ_НоваяТаблицаЗначений("ВидДохода, Раздел, Подразделение, Статья, СпособРасчета, Сумма, СуммаАвто, ДанныеРасшифровки,Вручную"));
	ДанныеРасчета.Вставить("Политика2", ИА_БФС.ТЗ_НоваяТаблицаЗначений("ВидДохода, Раздел, Подразделение, Статья, СпособРасчета, Сумма, ДанныеРасшифровки,Вручную"));
	ДанныеРасчета.Вставить("УчредительскиеФонды", ИА_БФС.ТЗ_НоваяТаблицаЗначений("Подразделение, Фонд, Сумма"));
	
	ПользовательскиеНастройки = ДокНастройка.ХранилищеПараметров.Получить();
	
	Если ЗаполнитьЗапросы Тогда
		ЗаполнитьЗапросы(Док, ДокНастройка, ПараметрыЗапросов, ПользовательскиеНастройки);
	КонецЕсли;
	
	Если ЗаполнитьДоходы Тогда
		//ПредТЗРучные = Док.Доходы.Выгрузить();
		//ПредТЗРучные.Очистить();
		док.ЕстьАвтодоходы = ложь;
		
        Для каждого Стр Из ДокНастройка.ВидыДоходов Цикл
            НовСтрока = ДанныеРасчета.Доходы.Добавить();
			НовСтрока.Подразделение = Стр.Подразделение;
            НовСтрока.ВидДохода = Стр.ВидДохода;
			
			Если Стр.СпособЗаполнения = Перечисления.ИА_ВариантыПолученияДанныхВидыДоходов.Запрос ИЛИ Стр.СпособЗаполнения = Перечисления.ИА_ВариантыПолученияДанныхВидыДоходов.ВычисляемоеВыражение Тогда
				док.ЕстьАвтодоходы = истина;	
			КонецЕсли;
			
			Если док.АвтосборДоходов Тогда
	            Если     Стр.СпособЗаполнения = Перечисления.ИА_ВариантыПолученияДанныхВидыДоходов.Вручную Тогда
	                //НовСтрока.Сумма = Стр.Значение;
					НстрокиД = Док.Доходы.НайтиСтроки(Новый структура("Подразделение,ВидДохода", Стр.Подразделение, стр.ВидДохода));
					Если НстрокиД.Количество()>0 Тогда
						//НовстрПред = ПредТЗРучные.добавить();
						//ЗаполнитьЗначенияСвойств(НовстрПред, НстрокиД[0]);
						НовСтрока.Сумма = НстрокиД[0].СуммаБезнал;
					КонецЕсли;
				ИначеЕсли Стр.СпособЗаполнения = Перечисления.ИА_ВариантыПолученияДанныхВидыДоходов.Запрос Тогда
					
					Отбор = Новый Структура("Запрос, ИДСтроки", Стр.Значение, Стр.ИДСтроки);
					нСтр = Док.ЗапросыДанных.НайтиСтроки(Отбор);
					Если нСтр.Количество() = 0 Тогда
						ВызватьИсключение "При получении дохода '"+Стр.ВидДохода+"' произошла ошибка: не вычислен запрос - "+ Стр.Значение;
					Иначе
					    НовСтрока.Сумма = нСтр[0].Сумма;
					    НовСтрока.ДанныеРасшифровки = нСтр[0].Расшифровка;
					КонецЕсли;

	            ИначеЕсли Стр.СпособЗаполнения = Перечисления.ИА_ВариантыПолученияДанныхВидыДоходов.ВычисляемоеВыражение Тогда
					ПараметрыФормулы = Новый Структура("ДатаНачала, ДатаКонца, Организация");
					ЗаполнитьЗначенияСвойств(ПараметрыФормулы, ПараметрыЗапросов);
	                
	                Данные = ВычислитьФормулуФП(Док, Стр.Значение, ПараметрыФормулы, стр.ИДСтроки, ДанныеРасчета);
	                НовСтрока.Сумма = Данные.Значение;
	                НовСтрока.ДанныеРасшифровки = ЗначениеВСтрокуВнутр(Данные);
	                
	                Если Не Данные.Вычислено Тогда
	                    ВызватьИсключение ИА_БФКС.Стр_ПодставитьПараметрыВСтроку(
	                    "При вычислении формулы '%1' (%2) (ВидДохода: '%3') произошла ошибка: %4"
	                    ,Данные.Формула, Данные.ФормулаРезультат, Стр.ВидДохода, Данные.ТекстОшибки);
	                КонецЕсли; 
				КонецЕсли;
			Иначе
				НовСтрока.Сумма = 0;
			КонецЕсли;
            НовСтрока.СуммаБезнал = НовСтрока.Сумма;
        КонецЦикла;
        
        Док.Доходы.Загрузить(ДанныеРасчета.Доходы); // В_ФП
    Иначе
        ДанныеРасчета.Доходы = Док.Доходы.Выгрузить();
        ДобавитьКолонкуСумма(ДанныеРасчета.Доходы);
    КонецЕсли;
    
    Если ЗаполнитьДоходыИтого Тогда
        Для каждого Стр Из Док.ДоходыБП_Распределение Цикл
            НовСтрока = ДанныеРасчета.ДоходыИзСпецДоходов.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
            НовСтрока.Сумма = Стр.СуммаНал + Стр.СуммаБезнал;
            НовСтрока.ВидДохода = Стр.ВидДоходаПолучатель;
        КонецЦикла;  	
        
        Для каждого Стр Из Док.РаспределениеСредствСФондов Цикл
        	НовСтрока = ДанныеРасчета.ДоходыИзСписанияФондов.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
            НовСтрока.Сумма = НовСтрока.СуммаНал + НовСтрока.СуммаБезнал;
        КонецЦикла;  	
        
        Для каждого Стр Из Док.ДоходыБП Цикл
        	НовСтрока = ДанныеРасчета.ДоходыВСпецДоход.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
            НовСтрока.СуммаНал      = -НовСтрока.СуммаНал;
            НовСтрока.СуммаБезнал   = -НовСтрока.СуммаБезнал;
            НовСтрока.Сумма         = НовСтрока.СуммаНал + НовСтрока.СуммаБезнал;
		КонецЦикла;  
		
		// удалим откладывание доходов, которых нет
		счОтл = Док.ОтложенныйДоход.Количество() - 1;
		Пока счОтл >= 0 Цикл
			стрОтл = Док.ОтложенныйДоход[счОтл];
			
			Если стрОтл.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить и ЗначениеЗаполнено(стрОтл.ВидДохода) тогда
				СтруктПоиск = новый Структура("ВидДохода", стрОтл.ВидДохода);
				Если ИспДоходыПоПодразделениям и ЗначениеЗаполнено(стрОтл.Подразделение) тогда
					СтруктПоиск.Вставить("Подразделение", стрОтл.Подразделение);
				КонецЕсли;
				НСтроки =  ДанныеРасчета.Доходы.НайтиСтроки(СтруктПоиск);
				
				Если НСтроки.Количество() = 0 тогда
					Док.ОтложенныйДоход.удалить(счОтл);
				КонецЕсли;
			КонецЕсли;
			
			счОтл = счОтл - 1;
		КонецЦикла;
		
		Для каждого Стр Из Док.ОтложенныйДоход Цикл
            НовСтрока = ДанныеРасчета.ДоходыИзСпецДоходов.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
			Если стр.ТипОперации = Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить Тогда
				НовСтрока.Сумма = - НовСтрока.Сумма;
			КонецЕсли;
			НовСтрока.СуммаБезнал = НовСтрока.Сумма;
        КонецЦикла;
        
        Для каждого Стр Из ДанныеРасчета.Доходы Цикл
            ЗаполнитьЗначенияСвойств(ДанныеРасчета.ДоходыИтого.Добавить(), Стр);
        КонецЦикла;  
        Для каждого Стр Из ДанныеРасчета.ДоходыИзСписанияФондов Цикл
            ЗаполнитьЗначенияСвойств(ДанныеРасчета.ДоходыИтого.Добавить(), Стр);
        КонецЦикла;  
        
        Для каждого Стр Из ДанныеРасчета.ДоходыИзСпецДоходов Цикл
            ЗаполнитьЗначенияСвойств(ДанныеРасчета.ДоходыИтого.Добавить(), Стр);
        КонецЦикла;  
        Для каждого Стр Из ДанныеРасчета.ДоходыВСпецДоход Цикл
            ЗаполнитьЗначенияСвойств(ДанныеРасчета.ДоходыИтого.Добавить(), Стр);
        КонецЦикла;  
        
        ДанныеРасчета.ДоходыИтого.Свернуть("Подразделение, ВидДохода", "Сумма, СуммаНал, СуммаБезНал");
        
        Док.ДоходыИтого.Загрузить(ДанныеРасчета.ДоходыИтого);  // В_ФП
	Иначе
		
        ДанныеРасчета.ДоходыИтого = Док.ДоходыИтого.Выгрузить();
        ДобавитьКолонкуСумма(ДанныеРасчета.ДоходыИтого);
    КонецЕсли; 
    
	Если ЗаполнитьПолитику1 Тогда
		ЗаполнитьДокумент_РасчетПолитика1(Док, ДанныеРасчета, ДокНастройка, ПараметрыЗапросов, НеОчищатьРучные, ФпТБ, ИспДоходыПоПодразделениям, ТекПарамПериодов);
	Иначе
		ДанныеРасчета.Политика1 = Док.Политика1.Выгрузить();
	КонецЕсли; 
	
	ИтогоДоход = ДанныеРасчета.ДоходыИтого.Итог("Сумма");
	Док.ИтогоДоход = ИтогоДоход;
	Док.ИтогоЧистыйДоход = ДанныеРасчета.Доходы.Итог("Сумма");
	
	ДанныеРасчета.Вставить("ВаловаяПрибыль", ИтогоДоход - ДанныеРасчета.Политика1.Итог("Сумма"));
	
	Если ЗаполнитьПолитику2 Тогда
		Если ФпТБ Тогда
			ДанныеРасчета.Вставить("МаржинальнаяПрибыль", ДанныеРасчета.ДоходыИтого.Итог("Сумма") - ДанныеРасчета.Политика1.Итог("Сумма"));
			Док.МаржинальнаяПрибыль = ДанныеРасчета.МаржинальнаяПрибыль;
						
			ЗаполнитьУчредительскиеФонды(Док, ДанныеРасчета, ИспДоходыПоПодразделениям);
			
			ДанныеРасчета.Вставить("ИтогоВЗаливку", Док.МаржинальнаяПрибыль - ДанныеРасчета.УчредительскиеФонды.Итог("Сумма"));
			Док.ИтогоВЗаливку = ДанныеРасчета.ИтогоВЗаливку;
			
			Док.Политика2.Очистить();
			ЗаполнитьЗаливкуФондов(Док,ДанныеРасчета, ИспДоходыПоПодразделениям, ТекПарамПериодов);
		Иначе
			ЗаполнитьДокумент_РасчетПолитика2(Док, ДанныеРасчета, ДокНастройка, ПараметрыЗапросов, НеОчищатьРучные);
		КонецЕсли;
	Иначе
		ДанныеРасчета.Политика2 = Док.Политика2.Выгрузить();
    КонецЕсли; 
КонецПроцедуры

Функция ПолучитьПараметрыТекРаспределения(Организация, ДатаДокФП) Экспорт
	ФпНаСледДень = не Константы.ИА_ФП_НачалоПланирования.Получить();
	ДатаФП = ДатаДокФП;
	Если ФпНаСледДень Тогда
		ДатаФП = ДатаФП - 60*60*24;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);	
	Запрос.УстановитьПараметр("ДатаФП", ДатаФП);	
	
	// получение конца месяца
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ИА_РаспределениеНедель.КонецНедели) КАК КонецПоследнейНедели,
	               |	МАКСИМУМ(ИА_РаспределениеНедель.Период) КАК НачалоПоследнейНедели,
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_РаспределениеНедель.Период >= ПодЗапрМесяц.неделя
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КолНедельДоКонцаМесяца,
	               |	ПодЗапрМесяц.Месяц,
	               |	ПодЗапрМесяц.неделя КАК ТекНеделя
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИА_РаспределениеНедель.Месяц КАК Месяц,
	               |			ИА_РаспределениеНедель.Период КАК неделя
	               |		ИЗ
	               |			РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |		ГДЕ
	               |			ИА_РаспределениеНедель.Период <= &ДатаФП
	               |			И КОНЕЦПЕРИОДА(ИА_РаспределениеНедель.КонецНедели, ДЕНЬ) >= &ДатаФП) КАК ПодЗапрМесяц
	               |		ПО ИА_РаспределениеНедель.Месяц = ПодЗапрМесяц.Месяц
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПодЗапрМесяц.Месяц,
	               |	ПодЗапрМесяц.неделя";
	Выборка = Запрос.Выполнить().Выбрать();
	Если не Выборка.Следующий() ТОгда
		Сообщить("Заполните распределение недель по месяцам");
		Возврат Неопределено;
	КонецЕсли;
	
	ТекМесяц = выборка.Месяц;
	ТекНеделя = выборка.ТекНеделя;
	ЭтоПоследняяНеделя = ДатаФП > Выборка.НачалоПоследнейНедели;	
	КолНедельДоКонца = Выборка.КолНедельДоКонцаМесяца;
	
	Возврат Новый Структура("ТекМесяц, ТекНеделя, ЭтоПоследняяНеделя, КолНедельДоКонца, ДатаФП, ПоследняяНеделя,ДатаДокФП", 
							 ТекМесяц, ТекНеделя, ЭтоПоследняяНеделя, КолНедельДоКонца, ДатаФП, Выборка.НачалоПоследнейНедели, ДатаДокФП -1);
КонецФункции

Процедура ЗаполнитьОстаткиДоФП(Запрос) Экспорт

	Запрос.Текст = "ВЫБРАТЬ
	               |	ТекРаспр.Подразделение,
	               |	ТекРаспр.Фонд,
	               |	СУММА(ТекРаспр.СуммаОстаток) КАК СуммаОстаток
	               |ПОМЕСТИТЬ ОстаткиДоФП
	               |ИЗ
	               |	РегистрНакопления.КСУ_РаспределениеТБ.Остатки(
	               |			&ДатаФП,
	               |			Неделя < &ТекНеделя
	               |					И (Организация = &Организация
	               |				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК ТекРаспр
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |		ПО (ИА_РаспределениеНедель.Период = ТекРаспр.Неделя)
	               |			И (ИА_РаспределениеНедель.Месяц = &ТекМесяц)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТекРаспр.Подразделение,
	               |	ТекРаспр.Фонд";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗаполнитьУчредительскиеФонды(Док, ДанныеРасчета, ИспДоходыПоПодразделениям)
	ДанныеРасчета.УчредительскиеФонды.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_ПравилоУчредительскихФондов.Подразделение КАК Подразделение,
	               |	КСУ_ПравилоУчредительскихФондов.Фонд КАК Фонд,
	               |	КСУ_ПравилоУчредительскихФондов.Процент КАК Процент
	               |ИЗ
	               |	РегистрСведений.КСУ_ПравилоУчредительскихФондов КАК КСУ_ПравилоУчредительскихФондов
	               |ГДЕ
	               |	КСУ_ПравилоУчредительскихФондов.Месяц = &Месяц
	               |	И (КСУ_ПравилоУчредительскихФондов.Организация = &Организация
	               |			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Месяц", Док.МесяцТБ);
	Запрос.УстановитьПараметр("Организация", Док.Организация);
	тз_Учр = Запрос.Выполнить().Выгрузить();
	
	ТЗ_Подр_Доходы = ДанныеРасчета.ДоходыИтого.Скопировать();
	ТЗ_Подр_Доходы.Свернуть("Подразделение", "Сумма");
	
	Для каждого стрДоходПодр из ТЗ_Подр_Доходы Цикл
		Если ИспДоходыПоПодразделениям Тогда
			СтрокиРасходы = ДанныеРасчета.Политика1.НайтиСтроки(Новый Структура("Подразделение", стрДоходПодр.Подразделение));
		Иначе
			СтрокиРасходы = ДанныеРасчета.Политика1;
		КонецЕсли;
		ИтогоПеремРасходы = 0;
		Для каждого стр из СтрокиРасходы Цикл
			ИтогоПеремРасходы = ИтогоПеремРасходы + стр.Сумма;
		КонецЦикла;
		
		маржа = стрДоходПодр.Сумма - ИтогоПеремРасходы; 
		
		НовстрТЧ = док.МаржаПоПодразделениям.Добавить();
		НовстрТЧ.Подразделение = стрДоходПодр.Подразделение;
		НовстрТЧ.Сумма = маржа;
		
		Если ИспДоходыПоПодразделениям Тогда
			СтрокиУФ = тз_Учр.НайтиСтроки(Новый Структура("Подразделение", стрДоходПодр.Подразделение));
		Иначе
			СтрокиУФ = тз_Учр;
		КонецЕсли;
		
		Для каждого стрУФ из СтрокиУФ Цикл
			Новстр = ДанныеРасчета.УчредительскиеФонды.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр, стрУФ);
			Новстр.сумма = окр(маржа / 100 * стрУФ.Процент, 2); 
		КонецЦикла;
	КонецЦикла;
	
	Док.УчредительскиеФонды.Загрузить(ДанныеРасчета.УчредительскиеФонды);
КонецПроцедуры


Процедура ЗаполнитьЗаливкуФондов(Док, ДанныеРасчета, ИспДоходыПоПодразделениям, ТекПарам)
	Док.ЗаливкаФондов.Очистить();
	
	Если ТекПарам = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Док.Организация);	
	Запрос.УстановитьПараметр("ДатаФП", ТекПарам.ДатаФП);
	Запрос.УстановитьПараметр("ДатаДокФП", ТекПарам.ДатаДокФП);
	Запрос.УстановитьПараметр("КолНедельДоКонца", ТекПарам.КолНедельДоКонца);	
	Запрос.УстановитьПараметр("ТекМесяц", ТекПарам.ТекМесяц);	
	Запрос.УстановитьПараметр("ТекНеделя", ТекПарам.ТекНеделя);	
	
	ЗаполнитьОстаткиДоФП(Запрос);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТекРаспр.Подразделение КАК Подразделение,
	               |	ТекРаспр.Фонд КАК Фонд,
	               |	ТекРаспр.СуммаОстаток + ЕСТЬNULL(ОстаткиДоФП.СуммаОстаток, 0) / &КолНедельДоКонца КАК СуммаПоФП,
	               |	ТекРаспр.Неделя КАК Неделя,
	               |	КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Порядок КАК Порядок
	               |ИЗ
	               |	РегистрНакопления.КСУ_РаспределениеТБ.Остатки(
	               |			&ДатаДокФП,
	               |			Неделя >= &ТекНеделя
	               |				И (Организация = &Организация
	               |					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК ТекРаспр
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КСУ_ПорядокРаспределенияПоФондам.СрезПоследних(
	               |				&ДатаДокФП,
	               |				(НомерПолитики = 2)
	               |					И (Организация = &Организация
	               |						ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК КСУ_ПорядокРаспределенияПоФондамСрезПоследних
	               |		ПО ТекРаспр.Подразделение = КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Подразделение
	               |			И ТекРаспр.Фонд = КСУ_ПорядокРаспределенияПоФондамСрезПоследних.Фонд
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |		ПО (ИА_РаспределениеНедель.Период = ТекРаспр.Неделя)
	               |			И (ИА_РаспределениеНедель.Месяц = &ТекМесяц)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиДоФП КАК ОстаткиДоФП
	               |		ПО ТекРаспр.Подразделение = ОстаткиДоФП.Подразделение
	               |			И ТекРаспр.Фонд = ОстаткиДоФП.Фонд
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТекРаспр.Неделя,
	               |	Порядок";
	
	тз = Запрос.Выполнить().Выгрузить();
	Док.ЗаливкаФондовСостояние.Загрузить(тз);
	
	// ЗАЛИВКА
	
	
	Если ИспДоходыПоПодразделениям тогда
		тз_ДоходыПоПодр = ДанныеРасчета.ДоходыИтого.Скопировать(); 
		тз_ДоходыПоПодр.Свернуть("Подразделение", "Сумма");
		тз_РасходыПоПодр = ДанныеРасчета.Политика1.Скопировать();
		тз_РасходыПоПодр.Свернуть("Подразделение", "Сумма");
		тз_УчредПоПодр = ДанныеРасчета.УчредительскиеФонды.Скопировать();
		тз_УчредПоПодр.Свернуть("Подразделение", "Сумма");
		
		Для каждого стрДох из тз_ДоходыПоПодр Цикл
			нстр = тз_РасходыПоПодр.найти(стрДох.Подразделение);
			Если нстр<> Неопределено Тогда
				стрДох.Сумма = стрДох.Сумма - нстр.Сумма; 
			КонецЕсли;
			
			нстр = тз_УчредПоПодр.найти(стрДох.Подразделение);
			Если нстр<> Неопределено Тогда
				стрДох.Сумма = стрДох.Сумма - нстр.Сумма; 
			КонецЕсли;
			
			НовстрТЧ = док.ИтогоВЗаливкуПодразделениям.Добавить();
			НовстрТЧ.Подразделение = стрДох.Подразделение;
			НовстрТЧ.Сумма = стрДох.Сумма;
		КонецЦикла;
		
		тз.Сортировать("Подразделение, Неделя, Порядок");
		
		Для каждого стрДох из тз_ДоходыПоПодр Цикл
			СтрокиПланЗаливки = тз.НайтиСтроки(Новый Структура("Подразделение", стрДох.Подразделение));
			
			сч = 0;
			кол = СтрокиПланЗаливки.Количество()-1;
			Пока сч <= кол  и стрДох.Сумма > 0 Цикл
				Текстр = СтрокиПланЗаливки[сч];
			
				НовСтр = Док.ЗаливкаФондов.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Текстр);
				НовСтр.Сумма = мин(Текстр.СуммаПоФП, стрДох.Сумма);
				стрДох.Сумма = стрДох.Сумма - НовСтр.Сумма;
				
				сч = сч + 1;
			КонецЦикла;
			Если стрДох.Сумма>0 и НовСтр <> Неопределено Тогда // Весь месяц залили, а деньги остались. Кидаем на последний
				НовСтр.Сумма = НовСтр.Сумма + стрДох.Сумма;
			КонецЕсли;
		КонецЦикла;

	Иначе
		НовстрТЧ = док.ИтогоВЗаливкуПодразделениям.Добавить();
		НовстрТЧ.Сумма = ДанныеРасчета.ИтогоВЗаливку;
			
		сч = 0;
		кол = тз.Количество()-1;
		СуммаРаспр = ДанныеРасчета.ИтогоВЗаливку;
		Пока сч <= кол  и СуммаРаспр > 0 Цикл
			Текстр = тз[сч];
		
			НовСтр = Док.ЗаливкаФондов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Текстр);
			НовСтр.Сумма = мин(Текстр.СуммаПоФП, СуммаРаспр);
			СуммаРаспр = СуммаРаспр - НовСтр.Сумма;
			
			сч = сч + 1;
		КонецЦикла;
		Если СуммаРаспр>0 и НовСтр <> Неопределено Тогда // Весь месяц залили, а деньги остались. Кидаем на последний
			НовСтр.Сумма = НовСтр.Сумма + СуммаРаспр;
		КонецЕсли;
	КонецЕсли;
	
	     	
КонецПроцедуры

Функция   СформироватьОтчетРасшифровкиВидаДохода(Док, ВидДохода, Подразделение, ВыводитьОбщийДоход = Ложь) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Док = Документы.ИА_ФинансовоеПланирование.СоздатьДокумент();
    #КОНЕЦЕСЛИ
    
    ТабДок = Новый ТабличныйДокумент;
    Макет = Новый ТабличныйДокумент;
    
    Заголовок = "Вид дохода: " + ВидДохода;
    Результат = Новый Структура("Сформирован, ТабДок, Заголовок", Ложь, ТабДок, Заголовок);
    Данные = Неопределено;
    
    НайдСтроки = Док.Доходы.НайтиСтроки(Новый структура("ВидДохода,Подразделение", ВидДохода,Подразделение));
    
    Обл = Макет.ПолучитьОбласть(1,1,1,1);
    Обл.Область(1,1,1,1).Текст = Заголовок;
    ТабДок.Вывести(Обл);
    
	Если НайдСтроки.Количество() > 0 Тогда
		НайдСтрока = НайдСтроки[0];
        Попытка
            Данные = ЗначениеИзСтрокиВнутр(НайдСтрока.ДанныеРасшифровки);
        Исключение
            ТекстОшибки = ОписаниеОшибки();
        КонецПопытки; 
        
        Если ТипЗнч(Данные) = Тип("Структура") Тогда
            Если ИА_БФКС.РеквизитЕсть(Данные, "Таб") Тогда
                ТабДок.Область(2, 1, 2, 1).Текст = "Сумма дохода = " + Данные.Таб.Итог("Сумма");
                
                ТЗ = СтруктураВТЗ(Данные.Параметры);  
                
                ТабДокВрем = ИА_БФС.ТЗ_ВывестиВТабДок(ТЗ, "Параметры запроса",,Истина,Истина);
                ТабДок.Вывести(ТабДокВрем);
                
                ТабДокВрем = ИА_БФС.ТЗ_ВывестиВТабДок(Данные.Таб, "Результат запроса",,Истина,Истина);
                ТабДок.Вывести(ТабДокВрем);
            ИначеЕсли ИА_БФКС.РеквизитЕсть(Данные, "Формула") Тогда
                
                ТабДок.НачатьГруппуСтрок();
                
                Обл.Область(1,1,1,1).Текст = "Формула: " + Данные.Формула;
                ТабДок.Вывести(Обл);
                Обл.Область(1,1,1,1).Текст = "Расчет: " + Данные.ФормулаРезультат;
                ТабДок.Вывести(Обл);
                
                Обл.Область(1,1,1,1).Текст = "Параметры формулы:";
                ТабДок.Вывести(Обл);
                Обл.Область(1,1,1,1).Текст = "";
                ТабДок.Вывести(Обл);
                
                
                
                Для каждого Стр Из Данные.Расшифровка Цикл
                    Обл.Область(1,1,1,1).Текст = ИА_БФКС.Стр_ПодставитьПараметрыВСтроку(
                    "'%1' = %2"
                    ,Стр.Параметр,Стр.Значение);
                    ТабДок.Вывести(Обл);
                    ТабДок.НачатьГруппуСтрок();
                    Если ТипЗнч(Стр.Расшифровка) = Тип("Структура") Тогда
                        ТабДок.Вывести(ИА_БФС.ТЗ_ВывестиВТабДок(СтруктураВТЗ(Стр.Расшифровка.Параметры), "Параметры запроса:",,Истина,Истина));
                        ТабДок.Вывести(ИА_БФС.ТЗ_ВывестиВТабДок(Стр.Расшифровка.Таб, "Результат запроса:",,Истина,Истина));
                    КонецЕсли; 
                    Обл.Область(1,1,1,1).Текст = "";
                    ТабДок.Вывести(Обл);
                    
                    ТабДок.ЗакончитьГруппуСтрок();
                КонецЦикла;  
                
                ТабДок.ЗакончитьГруппуСтрок();
            КонецЕсли; 
            
            Результат.Сформирован = Истина;
        КонецЕсли; 
    КонецЕсли; 
    
    
    Если ВыводитьОбщийДоход Тогда
        Результат.Сформирован = Истина;
        
        Отбор = Новый Структура("ВидДохода,Подразделение", ВидДохода, Подразделение);
        
        ВывестиТаблицуДокумента(Док.ДоходыБП, Отбор,                        "Спец. доход. ", ТабДок);
        ВывестиТаблицуДокумента(Док.ДоходыБП_Распределение, Отбор,          "Распределение спец. дохода. ", ТабДок);
        ВывестиТаблицуДокумента(Док.РаспределениеСредствСФондов, Отбор,     "Распределение с фондов. ", ТабДок);
        
    КонецЕсли; 
    
    
    Возврат Результат;
КонецФункции

Процедура ВывестиТаблицуДокумента(ТЧ, Отбор, Заголовок, ТабДок)
    ТЗ = ИА_БФС.ТЗ_ФильтрПоОтбору(ТЧ, Отбор);
    ТЗ.Колонки.Удалить("Номерстроки");
    ТЗ.Колонки.Удалить("ВидДохода");
    ТекстИтога = "Итог = " + ТЗ.Итог("СуммаБезнал");
    ТабДок.Вывести(ИА_БФС.ТЗ_ВывестиВТабДок(ТЗ, Заголовок + " " + ТекстИтога,,Истина,Истина));
КонецПроцедуры
 
Функция   СформироватьОтчетРасшифровкиПолитика(Док, КлючиПоиска, НомерПолитики) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ИА_ФинансовоеПланирование.ПолучитьМакет("РасшифровкаПолитики");
	
	Отбор = Новый Структура("Подразделение, Статья");
	ЗаполнитьЗначенияСвойств(Отбор, КлючиПоиска);
	
	Если ИА_БФКС.РеквизитЕсть(КлючиПоиска, "Раздел") и КлючиПоиска.Раздел<>Неопределено Тогда
		Отбор.Вставить("Раздел", КлючиПоиска.Раздел);
	КонецЕсли;
	
	Если ИА_БФКС.РеквизитЕсть(КлючиПоиска, "ВидДохода") Тогда
		Отбор.Вставить("ВидДохода", КлючиПоиска.ВидДохода);
	КонецЕсли;
	
	Если НомерПолитики = 1 Тогда
		ТабПолитика1 = ИА_БФС.ТЗ_ФильтрПоОтбору(Док.Политика1, Отбор);
	Иначе
		ТабПолитика1 = ИА_БФС.ТЗ_ФильтрПоОтбору(Док.Политика2, Отбор);
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////////////////
	
	Заголовок = "Расшифровка статьи """ + Отбор.Статья + """";
	Результат = Новый Структура("Сформирован, ТабДок, Заголовок", Ложь, ТабДок, Заголовок);	

	Для каждого СтрПолитика1 Из ТабПолитика1 Цикл
		Результат.Сформирован = Истина;
		
		Если НомерПолитики = 1 Тогда
			Обл = Макет.ПолучитьОбласть("ВидДохода");
			ЗаполнитьЗначенияСвойств(обл.Параметры, СтрПолитика1); 
			ТабДок.Вывести(Обл);		
		КонецЕсли;		
		
		ДанныеРасшифровки =  Неопределено;
		Попытка
			ДанныеРасшифровки =  ЗначениеИзСтрокиВнутр(СтрПолитика1.ДанныеРасшифровки);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
		КонецПопытки; 
		
		Если ТипЗнч(ДанныеРасшифровки) = Тип("Структура") Тогда
									
			Обл = Макет.ПолучитьОбласть("Формула");
			ЗаполнитьЗначенияСвойств(обл.Параметры, ДанныеРасшифровки); 
			ТабДок.Вывести(Обл);		
			
			Если ДанныеРасшифровки.Свойство("Расшифровка") И ДанныеРасшифровки.Расшифровка.Количество()>0 Тогда
				Обл = Макет.ПолучитьОбласть("ПараметрыШапка");
				ТабДок.Вывести(Обл);						
				
				Для каждого Стр Из ДанныеРасшифровки.Расшифровка Цикл
					
					Обл = Макет.ПолучитьОбласть("Параметр");
					ЗаполнитьЗначенияСвойств(обл.Параметры, Стр); 
					ТабДок.Вывести(Обл);

					Если ТипЗнч(Стр.Расшифровка) = Тип("Структура") Тогда
						ТабДок.Вывести(ИА_БФС.ТЗ_ВывестиВТабДок(СтруктураВТЗ(Стр.Расшифровка.Параметры), "Параметры запроса:",,Истина,Истина));
						ТабДок.Вывести(ИА_БФС.ТЗ_ВывестиВТабДок(Стр.Расшифровка.Таб, "Результат запроса:",,Истина,Истина));
						Обл = Макет.ПолучитьОбласть("ПустаяСтрока");
						ТабДок.Вывести(Обл);						
					КонецЕсли; 															
				КонецЦикла;  
			КонецЕсли;
			
			Обл = Макет.ПолучитьОбласть("ПустаяСтрока");
			ТабДок.Вывести(Обл);						
		КонецЕсли; 
	КонецЦикла;  
	
	Возврат Результат	
КонецФункции

Функция   ПодразделениеПоСтатьеРасходов(СтатьяРасходов) Экспорт
   Возврат СтатьяРасходов.ИА_ОсновноеПодразделение; 
КонецФункции
 
Процедура Форма_УстановитьОграничениеТипаИсточникСпецДохода(Форма, Элемент) Экспорт
    Элемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИА_ИсточникиСпецДохода");
КонецПроцедуры


Функция МассивОрганизацийФП(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ГруппыКомпанийДочерниеОрганизации.Организация
	|ИЗ
	|	Справочник.ИА_ГруппыКомпаний.ДочерниеОрганизации КАК ИА_ГруппыКомпанийДочерниеОрганизации
	|ГДЕ
	|	ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|
	|СГРУППИРОВАТЬ ПО
	|	ИА_ГруппыКомпанийДочерниеОрганизации.Организация";
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Массив = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Массив.Добавить(ВыборкаДетальныеЗаписи.Организация);
	КонецЦикла;
	Если Массив.Найти(Организация) = Неопределено Тогда 
		Массив.Добавить(Организация);
	КонецЕсли;
	Возврат Массив;
	
КонецФункции

Процедура ДобавитьКолонкуСумма(ТЗ)
	ТЗ.Колонки.Добавить("Сумма");
    Для каждого Стр Из ТЗ Цикл
    	Стр.Сумма = Стр.СуммаНал + Стр.СуммаБезНал;
    КонецЦикла;  
КонецПроцедуры

Процедура ЗаполнитьДокумент_РасчетПолитика2(Док, ДанныеРасчета, ДокНастройка, ПараметрыЗапросов, НеОчищатьРучные)
	
	ИмяТч = "Политика2";
	
    Если НеОчищатьРучные Тогда
    	ТабСтарыхДанных = ИА_БФС.ТЗ_ФильтрПоОтбору(Док[ИмяТч], Новый Структура("Вручную", Истина));
    Иначе
        ТабСтарыхДанных = Док[ИмяТч].ВыгрузитьКолонки();
    КонецЕсли; 
    
    мен = Перечисления.ИА_РежимРасчетаСуммы;
                
    Для каждого Стр Из ДокНастройка.Политика2 Цикл
        НовСтрока = ДанныеРасчета.Политика2.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
		НовСтрока.Статья = Стр.Статья;
        
        Если      Стр.СпособРасчета = мен.ФиксированнаяСумма Тогда
            Если ТипЗнч(Стр.Значение) = тип("Строка") ТОгда
            	НовСтрока.Сумма = число(Стр.Значение);
			Иначе
				НовСтрока.Сумма = Стр.Значение;
			КонецЕсли;
			
			расш = Новый Структура("Формула,ФормулаРезультат");
			расш.Формула = "Фиксированная сумма"; 
			расш.ФормулаРезультат = "" + НовСтрока.Сумма; 
			НовСтрока.ДанныеРасшифровки = ЗначениеВСтрокуВнутр(расш);
        ИначеЕсли Стр.СпособРасчета = мен.Процент Тогда
            НовСтрока.Сумма = Окр(ДанныеРасчета.ВаловаяПрибыль * ?(ЗначениеЗаполнено(Стр.Значение),Стр.Значение,0) / 100, 2);
			//
			расш = Новый Структура("Формула,ФормулаРезультат");
			расш.Формула = "Валовая прибыль * " + Стр.Значение + "%"; 
			расш.ФормулаРезультат = ""+ДанныеРасчета.ВаловаяПрибыль + " * " + Стр.Значение + "% = " + НовСтрока.Сумма; 
			
			НовСтрока.ДанныеРасшифровки = ЗначениеВСтрокуВнутр(расш);
		ИначеЕсли Стр.СпособРасчета = мен.РучнойВвод Тогда 
			Если ТипЗнч(Стр.Значение) = тип("Строка") ТОгда
				Если сокрлп(Стр.Значение) = "" Тогда
					НовСтрока.Сумма = 0;
				Иначе
            		НовСтрока.Сумма = число(Стр.Значение);
				КонецЕсли;
			Иначе
				НовСтрока.Сумма = Стр.Значение;
			КонецЕсли;
			
            расш = Новый Структура("Формула,ФормулаРезультат");
			расш.Формула = "Ручной ввод"; 
			расш.ФормулаРезультат = ""; 
			НовСтрока.ДанныеРасшифровки = ЗначениеВСтрокуВнутр(расш);
		ИначеЕсли Стр.СпособРасчета = мен.ВычисляемоеВыражение Тогда
            ПараметрыФормулы = Новый Структура("ДатаНачала, ДатаКонца, Организация");
            ЗаполнитьЗначенияСвойств(ПараметрыФормулы, ПараметрыЗапросов);
			
            Данные = ВычислитьФормулуФП(Док, Стр.Значение, ПараметрыФормулы, Стр.ИДСтрокиРаспределения, ДанныеРасчета);
            НовСтрока.Сумма = Данные.Значение;
            НовСтрока.ДанныеРасшифровки = ЗначениеВСтрокуВнутр(Данные);
            
            Если Не Данные.Вычислено Тогда
                ИА_БФКС.СообщениеОбОшибке(ИА_БФКС.Стр_ПодставитьПараметрыВСтроку(
                    "При вычислении формулы произошла ошибка по условию: Подразделение: '%3', Статья: '%4'"  + Символы.ПС
                    + " — Формула:    %1" + Символы.ПС
                    + " — Вычисление: %2" + Символы.ПС
                    + " — Описание ошибки: %5" 
                    , Данные.Формула, Данные.ФормулаРезультат, Стр.Подразделение, Стр.Статья, Данные.ТекстОшибки));
            КонецЕсли; 
		КонецЕсли;
		
		Если НеОчищатьРучные Тогда
			ОтборПД = Новый Структура("Раздел,Подразделение,Статья");
			ЗаполнитьЗначенияСвойств(ОтборПД,Стр);
			МСтарых = ТабСтарыхДанных.НайтиСтроки(ОтборПД);
			Для каждого стрСтар из МСтарых Цикл
				ЗаполнитьЗначенияСвойств(НовСтрока, стрСтар); 
			КонецЦикла;				
		КонецЕсли;
    КонецЦикла; 
    
    //{ В_ФП
    Док[ИмяТч].Загрузить(ДанныеРасчета.Политика2); 
	
КонецПроцедуры

функция ПолучитьФиксСуммуПоТБ(ТекНеделя, Организация, Подразделение, Фонд, ВидДохода)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	п1.Сумма
	               |ИЗ
	               |	РегистрНакопления.КСУ_ЗаливкаПолитики1 КАК п1
	               |ГДЕ
	               |	п1.Неделя = &Неделя
				   |	И п1.ВидДохода = &ВидДохода
	               |	И п1.Подразделение = &Подразделение
	               |	И п1.Фонд = &Фонд
	               |	И (п1.Организация = &Организация
	               |			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	               |	И п1.ВидДвижения = ЗНАЧЕНИЕ(виддвижениянакопления.приход)";
	Запрос.УстановитьПараметр("Неделя", ТекНеделя);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Фонд", Фонд);
	Запрос.УстановитьПараметр("ВидДохода", ВидДохода);
	
	Выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() тогда
		возврат выборка.Сумма;
	Иначе
		возврат 0;
	КонецЕсли;
КонецФункции

Процедура ЗаполнитьДокумент_РасчетПолитика1(Док, ДанныеРасчета, ДокНастройка, ПараметрыЗапросов, НеОчищатьРучные, ФпТБ, ИспДоходыПоПодразделениям, ТекПарам)
	
	ИмяТч = "Политика1";
	
    Если НеОчищатьРучные Тогда
    	ТабСтарыхДанных = ИА_БФС.ТЗ_ФильтрПоОтбору(Док[ИмяТч], Новый Структура("Вручную", Истина));
    Иначе
        ТабСтарыхДанных = Док[ИмяТч].ВыгрузитьКолонки();
	КонецЕсли; 
	
	СчитатьФиксПоТБ = ФпТБ и ТипЗнч(ДокНастройка)<>Тип("ДокументОбъект.ИА_ФП_Настройка");
	Если СчитатьФиксПоТБ Тогда	
		Если ТекПарам = Неопределено Тогда 
			Возврат; 
		КонецЕсли;
	КонецЕсли;
    
    мен = Перечисления.ИА_РежимРасчетаСуммы;
	Для каждого СтрДоход Из ДанныеРасчета.ДоходыИтого Цикл
		Если ИспДоходыПоПодразделениям тогда
        	Таб = ИА_БФС.ТЗ_ФильтрПоОтбору(ДокНастройка.Политика1, Новый Структура("ВидДохода, Подразделение", СтрДоход.ВидДохода, СтрДоход.Подразделение));
		Иначе
			Таб = ИА_БФС.ТЗ_ФильтрПоОтбору(ДокНастройка.Политика1, Новый Структура("ВидДохода", СтрДоход.ВидДохода));
		КонецЕсли;
                
        Для каждого Стр Из Таб Цикл
            НовСтрока = ДанныеРасчета.Политика1.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
			
			Если Стр.СпособРасчета = мен.ФиксированнаяСумма Тогда
				Если СчитатьФиксПоТБ Тогда
					НовСтрока.Сумма = ПолучитьФиксСуммуПоТБ(ТекПарам.ТекНеделя, док.Организация, Стр.Подразделение, стр.Статья, стр.ВидДохода);
				Иначе
					Если ТипЗнч(Стр.Значение) = тип("Строка") ТОгда
	                	НовСтрока.Сумма = число(Стр.Значение);
					Иначе
						НовСтрока.Сумма = Стр.Значение;
					КонецЕсли;
				КонецЕсли;
				
				расш = Новый Структура("Формула,ФормулаРезультат");
				расш.Формула = "Фиксированная сумма"; 
				расш.ФормулаРезультат = "" + НовСтрока.Сумма; 
				НовСтрока.ДанныеРасшифровки = ЗначениеВСтрокуВнутр(расш);
			ИначеЕсли Стр.СпособРасчета = мен.Процент Тогда
                НовСтрока.Сумма = Окр(СтрДоход.Сумма * ?(ЗначениеЗаполнено(Стр.Значение),Стр.Значение,0) / 100, 2);
				//
				расш = Новый Структура("Формула,ФормулаРезультат");
				расш.Формула = ""+СтрДоход.ВидДохода + " * " + Стр.Значение + "%"; 
				расш.ФормулаРезультат = ""+СтрДоход.Сумма + " * " + Стр.Значение + "% = " + НовСтрока.Сумма; 
				НовСтрока.ДанныеРасшифровки = ЗначениеВСтрокуВнутр(расш);
			ИначеЕсли Стр.СпособРасчета = мен.РучнойВвод Тогда 
				Если ТипЗнч(Стр.Значение) = тип("Строка") ТОгда
					Если сокрлп(Стр.Значение) = "" Тогда
						НовСтрока.Сумма = 0;
					Иначе
                		НовСтрока.Сумма = число(Стр.Значение);
					КонецЕсли;
				Иначе
					НовСтрока.Сумма = Стр.Значение;
				КонецЕсли;
				
				расш = Новый Структура("Формула,ФормулаРезультат");
				расш.Формула = "Ручной ввод"; 
				расш.ФормулаРезультат = ""; 
				НовСтрока.ДанныеРасшифровки = ЗначениеВСтрокуВнутр(расш);
			ИначеЕсли Стр.СпособРасчета = мен.ВычисляемоеВыражение Тогда
                ПараметрыФормулы = Новый Структура("ДатаНачала, ДатаКонца, Организация");
                ЗаполнитьЗначенияСвойств(ПараметрыФормулы, ПараметрыЗапросов);
				
				ОтПодр = ?(ИспДоходыПоПодразделениям, стр.Подразделение, Неопределено);
                Данные = ВычислитьФормулуФП(Док, Стр.Значение, ПараметрыФормулы, стр.ИДСтрокиРаспределения, ДанныеРасчета, стр.ВидДохода, ОтПодр);
                НовСтрока.Сумма = Данные.Значение;
                НовСтрока.ДанныеРасшифровки = ЗначениеВСтрокуВнутр(Данные);
                
                Если Не Данные.Вычислено Тогда
                    ИА_БФКС.СообщениеОбОшибке(ИА_БФКС.Стр_ПодставитьПараметрыВСтроку(
                    "При вычислении формулы произошла ошибка по условию: ВидДохода: '%3', Подразделение: '%4', Статья: '%5'"  + Символы.ПС
                    + " — Формула:    %1" + Символы.ПС
                    + " — Вычисление: %2" + Символы.ПС
                    + " — Описание ошибки: %6" 
                    , Данные.Формула, Данные.ФормулаРезультат,Стр.ВидДохода, Стр.Подразделение, Стр.Статья, Данные.ТекстОшибки));
                КонецЕсли; 
			КонецЕсли;             
			
			НовСтрока.СуммаАвто = НовСтрока.Сумма;

			Если НеОчищатьРучные Тогда
				ОтборПД = Новый Структура("ВидДохода,Раздел,Подразделение,Статья");
				ЗаполнитьЗначенияСвойств(ОтборПД,Стр);
				МСтарых = ТабСтарыхДанных.НайтиСтроки(ОтборПД);
				Для каждого стрСтар из МСтарых Цикл
					ЗаполнитьЗначенияСвойств(НовСтрока, стрСтар,"Сумма,Вручную"); 
				КонецЦикла;				
			КонецЕсли;
        КонецЦикла;  
    КонецЦикла;  
    
    Док[ИмяТч].Загрузить(ДанныеРасчета.Политика1);  
	
КонецПроцедуры

Функция   НайтиПоследнийПоДатеДокумент(ИмяДокумента, Дата
    , ИсключаемыйДокумент = Неопределено, ДопПараметры = Неопределено) Экспорт
    
    ТекстЗапроса =
    #Область ТекстЗапроса
    "ВЫБРАТЬ
    |   Т.Ссылка,
    |   Т.Дата
    |ПОМЕСТИТЬ Таб
    |ИЗ
    |   Документ.АвансовыйОтчет КАК Т
    |ГДЕ
    |   Т.Проведен
    |   И Т.Дата <= &Дата
    |   И &ДопОтборИзмерения
    |   И Т.Ссылка <> &ИсключаемыйДокумент
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   Таб.Ссылка Результат
    |ИЗ
    |   (ВЫБРАТЬ
    |       МАКСИМУМ(Таб.Дата) КАК Дата
    |   ИЗ
    |       Таб КАК Таб) КАК ВложенныйЗапрос
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Таб КАК Таб
    |       ПО ВложенныйЗапрос.Дата = Таб.Дата";
    #КонецОбласти 
    
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.АвансовыйОтчет", "Документ." + ИмяДокумента);
    
    ПЗ = Новый Структура("Дата, ИсключаемыйДокумент, ДопОтборИзмерения"
    , Дата
    , ИсключаемыйДокумент
    , Истина);
    Если ДопПараметры <> Неопределено Тогда
        ТекстУсловия = "";
        Для каждого КиЗ Из ДопПараметры Цикл
            ТекстУсловия = ТекстУсловия + Символы.ПС
            + " И " + КиЗ.Ключ + " = " + "&Парам_" + КиЗ.Ключ;
            ПЗ.Вставить("Парам_" + КиЗ.Ключ, КиЗ.Значение);
        КонецЦикла;  
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ДопОтборИзмерения", ТекстУсловия);
    КонецЕсли; 
    
    Результат = ИА_БФС.Запрос_ВыполнитьСкалярный(ТекстЗапроса, ПЗ);
    
    Возврат Результат;
КонецФункции

Функция   ВычислитьФормулуФП(Док, ТекстФормулы, ПараметрыФормулы, ИДСтроки, ДанныеРасчета, ОтборВидДохода = Неопределено, ОтборПодразделение = Неопределено)
    Формула = ТекстФормулы;
    Результат = Новый Структура("Вычислено, Формула,ФормулаРезультат, Значение, ТекстОшибки, Расшифровка", Ложь, ТекстФормулы, "", 00000000000000.00, "");    
    Параметры = ИА_БФС.ТЗ_НоваяТаблицаЗначений("Параметр, Значение, Расшифровка");
	
	// запросы
	Нстр = Док.ЗапросыДанных.НайтиСтроки(Новый Структура("ИДСтроки", ИДСтроки));
	Для каждого Стр Из Нстр Цикл
		Если Найти(Формула, Стр.ИмяПараметра) > 0 Тогда
        	ИА_БФС.ТЗ_ДобавитьСтроку(Параметры, Стр.ИмяПараметра, Стр.Сумма, Стр.Расшифровка);
		КонецЕсли;
    КонецЦикла;
 
    
    // доходы
	Для каждого Стр Из ДанныеРасчета.ДоходыИтого Цикл
		Если ЗначениеЗаполнено(ОтборПодразделение) и Стр.Подразделение <> ОтборПодразделение Тогда
			Продолжить;
		КонецЕсли;
		
        Представление = "[Доход:" + Стр.ВидДохода + "]";
        Если Найти(Формула, Представление) > 0 Тогда
            ИА_БФС.ТЗ_ДобавитьСтроку(Параметры, Представление, Стр.Сумма);
        КонецЕсли; 
    КонецЦикла;  
    Представление   = "[ДоходыИтого]";
    Сумма           = ДанныеРасчета.ДоходыИтого.Итог("Сумма");
    Если Найти(Формула, Представление) > 0 Тогда
        ИА_БФС.ТЗ_ДобавитьСтроку(Параметры, Представление, Сумма);
    КонецЕсли;     
    

	// политика 1
	ВхСальдо = Сумма; // (доходы итого)
	ДанныеРасчета.Политика1.Сортировать("Раздел");
	сч = 0;
	кол = ДанныеРасчета.Политика1.Количество();
	ПредРаздел = Неопределено;
	СуммаРаздела = 0;
	Для каждого СтрСтатьи Из ДанныеРасчета.Политика1 Цикл
		Если СтрСтатьи.Сумма = Неопределено ТОгда
			Продолжить;
		КонецЕсли;
		
		Если ОтборВидДохода <> Неопределено И СтрСтатьи.ВидДохода<>ОтборВидДохода ТОгда
			Продолжить;
		КонецЕсли;
		
		Если ПредРаздел = Неопределено Тогда
			ПредРаздел = СтрСтатьи.Раздел;
		КонецЕсли;
		
		Представление = "[П1 Сумма:" + СтрСтатьи.Подразделение + "$" + СтрСтатьи.Статья+ "]";
		Если Найти(Формула, Представление) > 0 Тогда
			НовСтрокаПР1 = Параметры.Добавить();
	        НовСтрокаПР1.Параметр = Представление;
	        НовСтрокаПР1.Значение = СтрСтатьи.Сумма;
		КонецЕсли;
		
		сч = сч + 1;
		Если сч = Кол Тогда
			ВхСальдо = ВхСальдо - СтрСтатьи.Сумма;
			СуммаРаздела = СуммаРаздела + СтрСтатьи.Сумма; 
		КонецЕсли;
		
		Если сч = Кол ИЛИ СтрСтатьи.Раздел <> ПредРаздел Тогда	
			Представление = "[П1 СКД:"+ПредРаздел+"]";
			Если Найти(Формула, Представление) > 0 Тогда
				НовСтрокаПР1 = Параметры.Добавить();
		        НовСтрокаПР1.Параметр = Представление;
		        НовСтрокаПР1.Значение = ВхСальдо;
			КонецЕсли;
			
			Представление = "[П1 Итог:"+ПредРаздел+"]";
			Если Найти(Формула, Представление) > 0 Тогда
				НовСтрокаПР1 = Параметры.Добавить();
		        НовСтрокаПР1.Параметр = Представление;
		        НовСтрокаПР1.Значение = СуммаРаздела;
			КонецЕсли;
			
			СуммаРаздела = 0;
		КонецЕсли;
		
		ВхСальдо = ВхСальдо - СтрСтатьи.Сумма;
		СуммаРаздела = СуммаРаздела + СтрСтатьи.Сумма; 
		ПредРаздел = СтрСтатьи.Раздел;
	КонецЦикла; 
	
	Если Найти(Формула, "[ВалПрибыль]") > 0 Тогда
		ВалПриб = Параметры.Добавить();
	    ВалПриб.Параметр = "[ВалПрибыль]";
	    ВалПриб.Значение = ДанныеРасчета.ВаловаяПрибыль;
	КонецЕсли;
	
	// политика 2
	Если ДанныеРасчета.Свойство("ВаловаяПрибыль") Тогда
		ВхСальдо = ДанныеРасчета.ВаловаяПрибыль; 
	Иначе
		ВхСальдо = 0; // это формула политики 1. Тут не нужна вал прибыль
	КонецЕсли;
	ДанныеРасчета.Политика2.Сортировать("Раздел");
	сч = 0;
	кол = ДанныеРасчета.Политика2.Количество();
	ПредРаздел = Неопределено;
	СуммаРаздела = 0;
	Для каждого СтрСтатьи Из ДанныеРасчета.Политика2 Цикл
		Если СтрСтатьи.Сумма = Неопределено ТОгда
			СтрСтатьи.Сумма = 0;
			//Продолжить;
		КонецЕсли;
		
		Если ПредРаздел = Неопределено Тогда
			ПредРаздел = СтрСтатьи.Раздел;
		КонецЕсли;
		
		Представление = "[П2 Сумма:" + СтрСтатьи.Подразделение + "$" + СтрСтатьи.Статья+ "]";
		Если Найти(Формула, Представление) > 0 Тогда
	        НовСтрокаПР1 = Параметры.Добавить();
	        НовСтрокаПР1.Параметр = Представление;
	        НовСтрокаПР1.Значение = СтрСтатьи.Сумма;
		КонецЕсли;
		
		//ВхСальдо = ВхСальдо - СтрСтатьи.Сумма;
		//СуммаРаздела = СуммаРаздела + СтрСтатьи.Сумма; 
		
		сч = сч + 1;
		Если сч = Кол Тогда
			ВхСальдо = ВхСальдо - СтрСтатьи.Сумма;
			СуммаРаздела = СуммаРаздела + СтрСтатьи.Сумма; 
		КонецЕсли;
		Если сч = Кол ИЛИ СтрСтатьи.Раздел <> ПредРаздел Тогда	
			Представление = "[П2 СКД:"+ПредРаздел+"]";
			Если Найти(Формула, Представление) > 0 Тогда
				НовСтрокаПР1 = Параметры.Добавить();
		        НовСтрокаПР1.Параметр = Представление;
		        НовСтрокаПР1.Значение = ВхСальдо;
			КонецЕсли;
			
			Представление = "[П2 Итог:"+ПредРаздел+"]";
			Если Найти(Формула, Представление) > 0 Тогда
				НовСтрокаПР1 = Параметры.Добавить();
		        НовСтрокаПР1.Параметр = Представление;
		        НовСтрокаПР1.Значение = СуммаРаздела;
			КонецЕсли;
			
			СуммаРаздела = 0;
		КонецЕсли;
		
		ВхСальдо = ВхСальдо - СтрСтатьи.Сумма;
		СуммаРаздела = СуммаРаздела + СтрСтатьи.Сумма; 
		ПредРаздел = СтрСтатьи.Раздел;
    КонецЦикла;

	
	//
    Для каждого Стр Из Параметры Цикл
        Формула = СтрЗаменить(Формула, Стр.Параметр, Формат(число(Стр.Значение), "ЧРД=.; ЧН=; ЧГ="));
    КонецЦикла;  
    
    Результат.Расшифровка = Параметры;
    
    Попытка
        //Формула = СтрЗаменить(Формула, ",", ".");
        Результат.ФормулаРезультат = Формула;
        
        Если ЗначениеЗаполнено(Формула) Тогда
        	Результат.Значение = Вычислить(Формула);
        Иначе
            Результат.Значение = 0;
        КонецЕсли; 
        
        
        Результат.Значение = Окр(Результат.Значение, 2);
        Результат.Вычислено = Истина;
    Исключение
        Результат.ТекстОшибки = ОписаниеОшибки();
    КонецПопытки; 
    
    Возврат Результат;
КонецФункции
  
Функция ДополнитьПользовательскимиПараметрами(ПараметрыЗапросов, ИДСтроки, ПользовательскиеПараметры)
	Если ПользовательскиеПараметры <> Неопределено И ПользовательскиеПараметры.Свойство(ИДСтроки) Тогда 
		ПараметрыСтроки = ПользовательскиеПараметры[ИДСтроки];
		Для каждого Элемент Из ПараметрыСтроки Цикл 
			ПараметрыЗапросов.Вставить(Элемент.Ключ, Элемент.Значение);		
		КонецЦикла;
	КонецЕсли; 
	Возврат ПараметрыЗапросов; 
КонецФункции

Функция ФП_ПолучитьОстаткиНаФондах(МоментВремени, Организация) Экспорт
    МассивОрганизаций = МассивОрганизацийФП(Организация);
    
    Результат = ИА_БФС.Запрос_ВыполнитьВСтруктуру(
    "ВЫБРАТЬ
    |   СУММА(Т.ОстатокНал) КАК ОстатокСвНал,
    |   СУММА(Т.ОстатокБезНал) КАК ОстатокСвБезНал,
    |   СУММА(Т.Остаток) КАК ОстатокСв,
    |   СУММА(Т.ОстатокРезервНал) КАК ОстатокРезервНал,
    |   СУММА(Т.ОстатокРезервБезНал) КАК ОстатокРезервБезНал,
    |   СУММА(Т.ОстатокРезерв) КАК ОстатокРезерв,
    |   СУММА(Т.ОстатокРезерв + Т.Остаток) КАК ОстатокВсего
    |ИЗ
    |   (ВЫБРАТЬ
    |       ИА_СредстваНаФондахОстатки.СуммаНалОстаток КАК ОстатокНал,
    |       ИА_СредстваНаФондахОстатки.СуммаБезналОстаток КАК ОстатокБезНал,
    |       ИА_СредстваНаФондахОстатки.СуммаНалОстаток + ИА_СредстваНаФондахОстатки.СуммаБезналОстаток КАК Остаток,
    |       0 КАК ОстатокРезервНал,
    |       0 КАК ОстатокРезервБезНал,
    |       0 КАК ОстатокРезерв
    |   ИЗ
    |       РегистрНакопления.ИА_СредстваНаФондах.Остатки(&МВ, Организация В (&СписокОрганизация)) КАК ИА_СредстваНаФондахОстатки
    |   
    |   ОБЪЕДИНИТЬ ВСЕ
    |   
    |   ВЫБРАТЬ
    |       0,
    |       0,
    |       0,
    |       ИА_СредстваВРезервеНаФондахОстатки.СуммаНалОстаток,
    |       ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток,
    |       ИА_СредстваВРезервеНаФондахОстатки.СуммаНалОстаток + ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток
    |   ИЗ
    |       РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(&МВ, Организация В (&СписокОрганизация)) КАК ИА_СредстваВРезервеНаФондахОстатки) КАК Т"
    , Новый Структура("МВ, СписокОрганизация", МоментВремени, МассивОрганизаций)); 
    
    
    Возврат Результат;    
КонецФункции

Функция ПолучитьТЗЗаймов(НаДату, Организация, НеРазделять, ТаблицаТекДок, ВключаяТекЗаймы = истина) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТекДок.ид КАК ид,
	|	ТекДок.Фонд КАК Фонд,
	|	ТекДок.Подразделение КАК Подразделение,
	|	ТекДок.СФонда КАК СФонда,
	|	ТекДок.СПодразделения КАК СПодразделения,
	|	ТекДок.ПричинаЗайма КАК ПричинаЗайма,
	|	ТекДок.Комментарий КАК Комментарий,
	|	ТекДок.КрайнийСрок КАК КрайнийСрок,
	|	ТекДок.СуммаБезнал КАК СуммаБезнал,
	|	ТекДок.ЗаймВозврат КАК ЗаймВозврат,
	|	ТекДок.ИсточникОтложенногоДохода КАК ИсточникОтложенногоДохода
	|ПОМЕСТИТЬ ВТЗ
	|ИЗ
	|	&ТЗ КАК ТекДок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛОЖЬ КАК Выбрать,
	|	ПодЗапрос.ид КАК ид,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.ПричинаЗайма
	|		ИНАЧЕ ПодЗапрос.ид.ПричинаЗайма
	|	КОНЕЦ КАК ПричинаЗайма,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ЭтоТекДок И ПодЗапрос.Сумма > 0
	|			ТОГДА &НаДату
	|		ИНАЧЕ ПодЗапрос.ид.ДатаЗайма
	|	КОНЕЦ КАК ДатаЗайма,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.Сфонда
	|		ИНАЧЕ ПодЗапрос.ид.НаФонд
	|	КОНЕЦ КАК Фонд,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.СПодразделения
	|		ИНАЧЕ ПодЗапрос.ид.НаПодразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.Фонд
	|		ИНАЧЕ ПодЗапрос.ид.СФонда
	|	КОНЕЦ КАК СФонда,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.Подразделение
	|		ИНАЧЕ ПодЗапрос.ид.СПодразделения
	|	КОНЕЦ КАК СПодразделения,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.Комментарий
	|		ИНАЧЕ ПодЗапрос.ид.Комментарий
	|	КОНЕЦ КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.КрайнийСрок
	|		ИНАЧЕ ПодЗапрос.ид.КрайнийСрок
	|	КОНЕЦ КАК КрайнийСрок,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.ИсточникОтложенногоДохода
	|		ИНАЧЕ ПодЗапрос.ид.ИсточникОтложенногоДохода
	|	КОНЕЦ КАК ИсточникОтложенногоДохода,
	|	СУММА(ПодЗапрос.Сумма) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИА_ЗаймыСФондовОстатки.Фонд КАК Фонд,
	|		ИА_ЗаймыСФондовОстатки.Подразделение КАК Подразделение,
	|		ИА_ЗаймыСФондовОстатки.НаФонд КАК СФонда,
	|		ИА_ЗаймыСФондовОстатки.НаПодразделение КАК СПодразделения,
	|		ИА_ЗаймыСФондовОстатки.ПричинаЗайма КАК ПричинаЗайма,
	|		ИА_ЗаймыСФондовОстатки.ид.Комментарий КАК Комментарий,
	|		ИА_ЗаймыСФондовОстатки.КрайнийСрок КАК КрайнийСрок,
	|		ИА_ЗаймыСФондовОстатки.ИсточникОтложенногоДохода КАК ИсточникОтложенногоДохода,
	|		ИА_ЗаймыСФондовОстатки.СуммаБезналОстаток КАК Сумма,
	|		ИА_ЗаймыСФондовОстатки.ид КАК ид,
	|		ЛОЖЬ КАК ЭтоТекДок
	|	ИЗ
	|		РегистрНакопления.ИА_ЗаймыСФондов.Остатки(
	|				&НаДату,
	|				Организация = &Организация
	|					ИЛИ &НеРазделять) КАК ИА_ЗаймыСФондовОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТекДок.Фонд,
	|		ТекДок.Подразделение,
	|		ТекДок.СФонда,
	|		ТекДок.СПодразделения,
	|		ТекДок.ПричинаЗайма,
	|		ТекДок.ид.Комментарий,
	|		ТекДок.КрайнийСрок,
	|		ТекДок.ИсточникОтложенногоДохода,
	|		-ТекДок.СуммаБезнал,
	|		ТекДок.ид,
	|		ИСТИНА
	|	ИЗ
	|		ВТЗ КАК ТекДок
	|	ГДЕ
	|		ТекДок.ЗаймВозврат = ЗНАЧЕНИЕ(Перечисление.ИА_ЗаймВозврат.Возврат)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТекДок.СФонда,
	|		ТекДок.СПодразделения,
	|		ТекДок.Фонд,
	|		ТекДок.Подразделение,
	|		ТекДок.ПричинаЗайма,
	|		ТекДок.Комментарий,
	|		ТекДок.КрайнийСрок,
	|		ТекДок.ИсточникОтложенногоДохода,
	|		ТекДок.СуммаБезнал,
	|		ТекДок.ид,
	|		ИСТИНА
	|	ИЗ
	|		ВТЗ КАК ТекДок
	|	ГДЕ
	|		ТекДок.ЗаймВозврат = ЗНАЧЕНИЕ(Перечисление.ИА_ЗаймВозврат.Займ)
	|		И &ВключаяТекЗаймы = ИСТИНА) КАК ПодЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодЗапрос.ид,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.ПричинаЗайма
	|		ИНАЧЕ ПодЗапрос.ид.ПричинаЗайма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ЭтоТекДок И ПодЗапрос.Сумма > 0
	|			ТОГДА &НаДату
	|		ИНАЧЕ ПодЗапрос.ид.ДатаЗайма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.Сфонда
	|		ИНАЧЕ ПодЗапрос.ид.НаФонд
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.СПодразделения
	|		ИНАЧЕ ПодЗапрос.ид.НаПодразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.Фонд
	|		ИНАЧЕ ПодЗапрос.ид.СФонда
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.Подразделение
	|		ИНАЧЕ ПодЗапрос.ид.СПодразделения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.Комментарий
	|		ИНАЧЕ ПодЗапрос.ид.Комментарий
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.КрайнийСрок
	|		ИНАЧЕ ПодЗапрос.ид.КрайнийСрок
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПодЗапрос.ид = ЗНАЧЕНИЕ(Справочник.КСУ_Займы.ПереходНа84)
	|				ИЛИ ПодЗапрос.ЭтоТекДок
	|			ТОГДА ПодЗапрос.ИсточникОтложенногоДохода
	|		ИНАЧЕ ПодЗапрос.ид.ИсточникОтложенногоДохода
	|	КОНЕЦ  
	|    
	|ИМЕЮЩИЕ
	|	СУММА(ПодЗапрос.Сумма) > 0";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НеРазделять", НеРазделять);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("ТЗ", ТаблицаТекДок);
	Запрос.УстановитьПараметр("ВключаяТекЗаймы", ВключаяТекЗаймы);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьНедели(месяц) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_РаспределениеНедель.Период КАК НачалоНедели,
	               |	КОЛИЧЕСТВО(Периоды.Период) КАК КолДней,
	               |	ИА_РаспределениеНедель.КонецНедели КАК КонецНедели
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_Календарь КАК Периоды
	               |		ПО (Периоды.Период МЕЖДУ ИА_РаспределениеНедель.Период И ИА_РаспределениеНедель.КонецНедели)
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Месяц = &Месяц
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_РаспределениеНедель.Период,
	               |	ИА_РаспределениеНедель.КонецНедели
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НачалоНедели";
	Запрос.УстановитьПараметр("Месяц", Месяц);	
	
	тз = Запрос.Выполнить().Выгрузить();
	Возврат тз;
КонецФункции

Функция ПолучитьФСЧисла(пЧисло) Экспорт
	ЦелаяЧасть = Цел(пЧисло);
	Копейки = (пЧисло - ЦелаяЧасть) * 100;
	ЦветТ = ?(пЧисло = 0, Новый цвет(170, 170, 170),  Новый цвет(0, 0, 0));
	ШрифтТ = Новый шрифт(,12);
	ШрифтТк = Новый шрифт(,8);
	рез1 = новый ФорматированнаяСтрока(формат(ЦелаяЧасть,"ЧДЦ=0; ЧН="),ШрифтТ, ЦветТ);
	рез2 = новый ФорматированнаяСтрока("," + формат(Копейки,"ЧЦ=2; ЧДЦ=0; ЧН=; ЧВН="),ШрифтТк, ЦветТ);
	
	возврат новый ФорматированнаяСтрока(рез1,рез2);
КонецФункции

Функция ОстатокРезерва(заказ, Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату", дата);
	Запрос.УстановитьПараметр("заказ", заказ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток, 0) КАК ОстатокРезерва
	               |ИЗ
	               |	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(&НаДату, ЗП = &заказ) КАК ИА_СредстваВРезервеНаФондахОстатки";
	Выборка = запрос.Выполнить().Выбрать();
	рез = 0;
	Если выборка.Следующий() Тогда
		рез = выборка.ОстатокРезерва;
	КонецЕсли;
	
	Возврат рез;
КонецФункции

Функция ПолучитьТекстСсылкиНаВДПС(ссылкаПлатежка) Экспорт
	сс = ПолучитьСсылкуНаВДПС(ссылкаПлатежка);
	Если сс = Неопределено Тогда
		возврат "";
	Иначе
		возврат строка(сс);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСсылкуНаВДПС(ссылкаПлатежка) Экспорт
	если ссылкаПлатежка.пустая() Тогда
		возврат Неопределено;
	КонецЕсли;
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_ВнедоходноеПоступлениеСредств.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.КСУ_ВнедоходноеПоступлениеСредств КАК КСУ_ВнедоходноеПоступлениеСредств
	               |ГДЕ
	               |	КСУ_ВнедоходноеПоступлениеСредств.Основание = &Основание
	               |	И КСУ_ВнедоходноеПоступлениеСредств.ПометкаУдаления = ложь";
	Запрос.УстановитьПараметр("Основание", ссылкаПлатежка);
	Выборка = запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() Тогда
		Возврат выборка.ссылка;		
	КонецЕсли;
	
	возврат Неопределено;
КонецФункции

Функция СоздатьВДПС(ссылкаПлатежка) Экспорт
	если ссылкаПлатежка.пустая() Тогда
		возврат Неопределено;
	КонецЕсли;
	
	ДокОб = Документы.КСУ_ВнедоходноеПоступлениеСредств.СоздатьДокумент();
	ДокОб.Заполнить(новый Структура("Ссылка, ЭтоПлатежка", ссылкаПлатежка, Истина));
	ДокОб.Записать();
	
	возврат ДокОб.Ссылка;
КонецФункции

Процедура ИзменитьПорядокВидаСтатистики(пВид, Направление, СПомеченными) Экспорт
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ВидыСтатистик.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ИА_ВидыСтатистик КАК ИА_ВидыСтатистик
	               |ГДЕ
	               |	ИА_ВидыСтатистик.Родитель = &Родитель
	               |	И (ИА_ВидыСтатистик.ПометкаУдаления = ЛОЖЬ
	               |			ИЛИ &СПомеченными = ИСТИНА)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ВидыСтатистик.Порядок";
	Запрос.УстановитьПараметр("Родитель", Справочники.ИА_ВидыСтатистик.СтатистикиФП);
	Запрос.УстановитьПараметр("СПомеченными", СПомеченными);
	тз = запрос.Выполнить().Выгрузить();
	
	стр = тз.Найти(пВид);
	Если стр <> Неопределено Тогда
		Попытка
			тз.Сдвинуть(стр, Направление);
		Исключение
			возврат;
		КонецПопытки;
		
		ТекПорядок = 1;
		для каждого стрВид из тз цикл
			об = стрВид.Ссылка.ПолучитьОбъект();
			об.Порядок = ТекПорядок;
			об.записать();
			
			ТекПорядок = ТекПорядок + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьОстатокОтлДохода(НаДату, Организация)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ИА_ДоходыБудущихПериодов.СуммаБезналОстаток),0) КАК СуммаБезналОстаток
	               |ИЗ
	               |	РегистрНакопления.ИА_ДоходыБудущихПериодов.Остатки(
	               |			&ДатаОстатков,
	               |			Организация = &Организация
	               |				ИЛИ &НеРазделять) КАК ИА_ДоходыБудущихПериодов
	               |ГДЕ
	               |	ИА_ДоходыБудущихПериодов.СуммаБезналОстаток > 0";
	Запрос.УстановитьПараметр("ДатаОстатков", новый Граница(НаДату,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НеРазделять", не Константы.ИА_ФП_ВестиФППоОрганизациям.Получить());
	
	Выборка = запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() тогда
		возврат выборка.СуммаБезналОстаток;
	Иначе
		возврат 0;
	КонецЕсли;

КонецФункции

Функция ПолучитьОрганизацииДляОтчетов() Экспорт
	//Рез = новый массив;
	//ИспользуютсяГруппыКомпаний = Справочники.ИА_ГруппыКомпаний.ПолучитьПризнакИспользованияГруппКомпаний();
	
	//Если ИспользуютсяГруппыКомпаний ТОгда
	//	Выборка= Справочники.ИА_ГруппыКомпаний.Выбрать();
	//	Пока выборка.Следующий() Цикл
	//		Если не выборка.ПометкаУдаления Тогда
	//			Рез.Добавить(Выборка.ГоловнаяОрганизация);
	//		КонецЕсли;
	//	КонецЦикла;
	//Иначе
	//	Выборка= Справочники.Организации.Выбрать();
	//	Пока выборка.Следующий() Цикл
	//		Если не выборка.ПометкаУдаления Тогда
	//			Рез.Добавить(Выборка.Ссылка);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИА_ГруппыКомпанийДочерниеОрганизации.Организация КАК Орг
	               |ПОМЕСТИТЬ Подчиненные
	               |ИЗ
	               |	Справочник.ИА_ГруппыКомпаний.ДочерниеОрганизации КАК ИА_ГруппыКомпанийДочерниеОрганизации
	               |ГДЕ
	               |	ИА_ГруппыКомпанийДочерниеОрганизации.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Организации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Подчиненные КАК Подчиненные
	               |		ПО (Подчиненные.Орг = Организации.Ссылка)
	               |ГДЕ
	               |	Организации.ПометкаУдаления = ЛОЖЬ
	               |	И Подчиненные.Орг ЕСТЬ NULL
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Организации.Наименование";
	тз = запрос.Выполнить().Выгрузить();
	рез = тз.ВыгрузитьКолонку("Ссылка");
	
	возврат рез;
КонецФункции

Функция естьБудущиеДоки(организация, дата) Экспорт
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_СредстваНаФондах.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.ИА_СредстваНаФондах КАК ИА_СредстваНаФондах
	               |ГДЕ
	               |	ИА_СредстваНаФондах.Организация = &Организация
	               |	И ИА_СредстваНаФондах.Период > &Период";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Дата);
	Выборка = запрос.Выполнить().Выбрать();
	
	возврат выборка.Следующий();
КонецФункции

Функция УбратьНули(номер) Экспорт
	рез = номер; 
	Пока Лев(рез, 1) = "0" Цикл 
	    рез = Прав(рез, СтрДлина(рез) - 1);
	КонецЦикла;
	Возврат рез;
КонецФункции

Функция ИдИсточника(Источник) Экспорт
	если ТипЗнч(Источник) = тип("Строка") тогда
		возврат Источник;
	КонецЕсли;
	возврат Источник.НаименованиеИД;
КонецФункции

Функция ПолучитьПредставлениеНедели(НачНедели) Экспорт	
	Если НачНедели = дата(1,1,1) тогда
		возврат "";
	КонецЕсли;
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ИА_РаспределениеНедель.Период КАК Период,
	               |	ИА_РаспределениеНедель.КонецНедели КАК КонецНедели,
	               |	ИА_РаспределениеНедель.Месяц КАК Месяц
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Период = &Период";
	Запрос.УстановитьПараметр("Период", НачНедели);
	Выборка = запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат формат(Выборка.Период, "ДФ=dd.MM") + " — " + формат(Выборка.КонецНедели, "ДФ=dd.MM") + " ("+ формат(выборка.Месяц, "ДФ=ММММ") +")";
	Иначе
		возврат "";
	КонецЕсли;
КонецФункции

Функция ПолучитьДоступныеНедели(ДатаДокумента) Экспорт	
	Если ДатаДокумента = дата(1,1,1) тогда
		возврат новый СписокЗначений;
	КонецЕсли;
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ИА_РаспределениеНедель.Период КАК Период,
	               |	ИА_РаспределениеНедель.КонецНедели КАК КонецНедели,
	               |	ИА_РаспределениеНедель.Месяц КАК Месяц
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Период <= &Период И КОНЕЦПЕРИОДА(ИА_РаспределениеНедель.КонецНедели,ДЕНЬ)>= &Период";
	Запрос.УстановитьПараметр("Период", ДатаДокумента);
	Выборка = запрос.Выполнить().Выбрать();
	
	Рез = новый СписокЗначений;
	Если Выборка.Следующий() Тогда
		Рез.Добавить(Выборка.Период, формат(Выборка.Период, "ДФ=dd.MM") + " — " + формат(Выборка.КонецНедели, "ДФ=dd.MM") + " ("+ формат(выборка.Месяц, "ДФ=ММММ") +")");
		
		// пред неделя
		
		Запрос.УстановитьПараметр("Период", Выборка.период - 60*60*24);
		Выборка = запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			Рез.Добавить(Выборка.Период, формат(Выборка.Период, "ДФ=dd.MM") + " — " + формат(Выборка.КонецНедели, "ДФ=dd.MM") + " ("+ формат(выборка.Месяц, "ДФ=ММММ") +")");
		КонецЕсли;
	КонецЕсли;	 
	
	Возврат Рез;
КонецФункции

Функция ЭтоНачалонедели(НачНедели) Экспорт		
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ИА_РаспределениеНедель.Период КАК Период,
	               |	ИА_РаспределениеНедель.КонецНедели КАК КонецНедели,
	               |	ИА_РаспределениеНедель.Месяц КАК Месяц
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Период = &Период";
	Запрос.УстановитьПараметр("Период", НачалоДня(НачНедели));
	Выборка = запрос.Выполнить().Выбрать();
	
	Возврат выборка.Следующий();
КонецФункции
