
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	Дата = Параметры.Дата;
	Лид  = Параметры.Лид;
	Пользователь = Параметры.Пользователь;
	Комментарий  = Параметры.Комментарий;
	ИДЗаписи  = Параметры.ИДЗаписи;

	КомментарийHTML = 
	"<!DOCTYPE html>
	|  <html lang='ru'>
	|    <head>
	|      <meta charset='utf-8'>
	|  <style>
	|  body {
	|   font-family: ""Arial"", Sans-Serif;
	|  	font-size: 14px;
	|  	color: #666666;
	|  }
	|  a {
	|  	color: #635129;
	|  }
	|  </style>
	|    </head>
	|    <body>"
	+
	СтрЗаменить(Комментарий, Символы.ПС, "<br/>")
	+
	"    </body>
	|  </html>";
	
	//#12137
	МенеджерЗаписи = РегистрыСведений.ИсторияЛида.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Лид= Лид; 
	МенеджерЗаписи.Дата = Дата; 
	МенеджерЗаписи.Пользователь = Пользователь; 
	МенеджерЗаписи.ИДЗаписи = ИДЗаписи;	
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Если НЕ ПустаяСтрока(МенеджерЗаписи.ТекстПисьмаHTML) Тогда
			СодержимоеПисьма = МенеджерЗаписи.ТекстПисьмаHTML;
			
		ИначеЕсли НЕ ПустаяСтрока(МенеджерЗаписи.ТекстПисьмаТекст) Тогда
			СодержимоеПисьма =
			"<!DOCTYPE html>
			|  <html lang='ru'>
			|    <head>
			|    </head>
			|    <body>"
			+
			СтрЗаменить(МенеджерЗаписи.ТекстПисьмаТекст, Символы.ПС, "<p>")
			+
			"    </body>
			|  </html>";			
		КонецЕсли;
			
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СодержимоеПисьма) Тогда			
		Элементы.КомментарийHTML.Высота = 5;
	Иначе
		Элементы.СодержимоеПисьма.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомментарийHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВРег(ДанныеСобытия.Element.tagName) = "A" Тогда
		
		СсылкаТекст = Сред(ДанныеСобытия.Element.href, 4);
		СсылкаПисьмо = ОбъектПоВнутреннемуПредставлению(СсылкаТекст);
		Если НЕ СсылкаПисьмо.Пустая()  Тогда 
			ПоказатьЗначение(, СсылкаПисьмо);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбъектПоВнутреннемуПредставлению(СсылкаТекст) 
	Возврат ЗначениеИзСтрокиВнутр(СсылкаТекст);
КонецФункции

