
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьМакетHTML();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМакетHTML()

	ТекстСоглашения = ПолучитьОбщийМакет("ЛицензионноеСоглашение").ПолучитьТекст();

Конецпроцедуры

&НаКлиенте
Процедура НеПринимаю(Команда)
	НеПринимаюНаСервере();
	ПрекратитьРаботуСистемы();
КонецПроцедуры

&НаКлиенте
Процедура Принимаю(Команда)
	
	РазрешеноЗакрытие = Истина; // №13385
	
	ПринимаюНаСервере();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПринимаюНаСервере()
	//Константы.ЛицензионноеСоглашениеПринято.Установить(Истина);
	
	// Заявка №4877
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.ПринятиеЛицензионногоСоглашения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Принято = Истина;
	МенеджерЗаписи.ДатаПринятия = ТекущаяДатаСеанса();
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура НеПринимаюНаСервере()
	//Константы.ЛицензионноеСоглашениеПринято.Установить(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//++ №13385
	Если НЕ РазрешеноЗакрытие Тогда
		Отказ = Истина;
	КонецЕсли;
	//-- №13385
	
КонецПроцедуры
