Процедура ИзменитьВидИсполнителяВДокументах(ВидДокументаРасчета, СтарыйВидИсполнителя, НовыйВидИсполнителя, ДополнительныеСвойства = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидДокументаРасчета", ВидДокументаРасчета);
	Запрос.УстановитьПараметр("ВидИсполнителя", СтарыйВидИсполнителя);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УстановкаСтоимостиВыработкиПоНоменклатуре КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидДокументаРасчета = &ВидДокументаРасчета
	|	И ДанныеДокумента.ВидИсполнителя = &ВидИсполнителя";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ВидИсполнителя = НовыйВидИсполнителя;
		
		Если НЕ ДополнительныеСвойства = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Докобъект, ДополнительныеСвойства);
		КонецЕсли; 	
		
		Если Докобъект.Проведен Тогда
			Попытка			
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
			Исключение
				ЗаписьЖурналаРегистрации("Обновление", УровеньЖурналаРегистрации.Ошибка, , ОписаниеОшибки());
			КонецПопытки;
		Иначе
			Попытка			
				ДокОбъект.Записать(); 
			Исключение
				ЗаписьЖурналаРегистрации("Обновление", УровеньЖурналаРегистрации.Ошибка, , ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры