#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//++ №1083 закомментировано т.к. данный реквизит теперь не используется
	//Если ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ЗаказПокупателя Тогда
	//	ПроверяемыеРеквизиты.Добавить("СтатусЗаказа");
	//КонецЕсли;
	//-- №1083
	
	Если ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж Тогда
		//ПроверяемыеРеквизиты.Добавить("ВидМонтажа");  //#16346 реквизит удален
		Если ВидИсполнителя = Справочники.ВидыИсполнителей.Монтажник Тогда
			ПроверяемыеРеквизиты.Добавить("СпособРаспределенияВыработкиПоМонтажникам");
		КонецЕсли;
	КонецЕсли;
	
	//#6265
	Если ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции
		Или ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж // №14035
	Тогда
		ПроверяемыеРеквизиты.Добавить("ВыработкаПоВидамНоменклатуры.Применение");
		ПроверяемыеРеквизиты.Добавить("ВыработкаПоНоменклатуре.Применение");
	КонецЕсли;
				
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг Тогда
		ИсточникЗаказаПокупателя = Справочники.РекламныеИсточники.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг 
		И НЕ ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж 
		//И НЕ ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Рекламация
		//И НЕ ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.СервиснаяЗаявка
		//И НЕ ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Продажа // #16346
		Тогда
		ВидДокументаОснования = Справочники.ВидыДокументовОснованийРасчетаВыработки.ПустаяСсылка();
	КонецЕсли;
			
	//#6265
	Если НЕ ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции
		И НЕ ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Монтаж // №14035
		//И НЕ ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Рекламация
		//И НЕ ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.СервиснаяЗаявка
		//И НЕ ВидДокументаРасчета = Справочники.ВидыДокументовРасчетаВыработки.Продажа // #16346
	Тогда
		Для Каждого ТекущаяСтрока Из ВыработкаПоВидамНоменклатуры Цикл
			ТекущаяСтрока.Применение = Перечисления.ПрименениеНоменклатурыДляВыработки.ПустаяСсылка();
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из ВыработкаПоНоменклатуре Цикл
			ТекущаяСтрока.Применение = Перечисления.ПрименениеНоменклатурыДляВыработки.ПустаяСсылка();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// #6347 Регистр сведений "СтоимостьВыработкиНоменклатурыИВида" переименовать в "УДАЛИТЬ_". Закомментирвоать все обращения к нему	

КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	// №6687
	СпособНачисленияВыработки = ?(Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить(), Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации, Перечисления.СпособыНачисленияВыработки.Бригадная);
		
	// #16579
	//УчитыватьПроцентОтклоненияОтПрайса = ПолучитьФункциональнуюОпцию("ПриРасчетеВыработкиПоМонтажуУчитыватьПроцентОтклоненияОтПрайса");
		
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
