#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыборДляМессенджера") Тогда
		Элементы.ВыбратьКонтакт.Заголовок = "Отправить сообщение";
	Иначе
		Элементы.ВыбратьКонтакт.Заголовок = "Позвонить";
		Элементы.ВыбратьКонтакт.Картинка = БиблиотекаКартинок.Позвонить;
	КонецЕсли;
	
	ПолучитьНомераТелефонов(Параметры.СсылкаОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыборКонтактаЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрСсылкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ПоказатьЗначение(Новый ОписаниеОповещения("ПараметрСсылкаНажатиеЗавершение", ЭтаФорма), ПараметрСсылкаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрСсылкаНажатиеЗавершение(ДополнительныеПараметры) Экспорт
    // не удалять
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьКонтакт(Команда)
	
	ВыборКонтактаЗавершение();
	 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция ПолучитьНомераТелефонов(СсылкаОбъект)
	
	ТипДокументы=Документы.ТипВсеСсылки();
	ПараметрСсылка="";
	
	ПараметрСсылкаНаОбъект = СсылкаОбъект;
	ПараметрСсылкаФорма = СсылкаОбъект;
	ТипЗначенияОбъекта=ТипЗнч(ПараметрСсылкаНаОбъект);
	
	ЭтоЛид 			= (ТипЗначенияОбъекта = Тип("ДокументСсылка.Лид"));
	ЭтоПользователь = (ТипЗначенияОбъекта = Тип("СправочникСсылка.Пользователи"));
	ЭтоСотрудник 	= (ТипЗначенияОбъекта = Тип("СправочникСсылка.Сотрудники"));	
	ЭтоКонтрагент	= (ТипЗначенияОбъекта = Тип("СправочникСсылка.Контрагенты"));
	
	Если ТипДокументы.СодержитТип(ТипЗначенияОбъекта) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", СсылкаОбъект.Метаданные()) Тогда
			ПараметрСсылкаФорма = СсылкаОбъект.Контрагент;
			ЭтоКонтрагент = Истина;
		КонецЕсли;		
	КонецЕсли;
	
	ТипыКИ = Новый Массив;
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПараметрСсылкаФорма);
	
	Если ЭтоЛид Тогда
		
		КонтактЛида = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрСсылкаФорма, "ИмяКлиента");
		КонтактнаяИнформацияОбъектов = УправлениеКонтактнойИнформациейПотолки.КонтактнаяИнформацияОбъектов(МассивОбъектов, ТипыКИ);
		Для каждого СтрокаКИ из КонтактнаяИнформацияОбъектов Цикл
			Если ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда 
				НоваяСтрока = Список.Добавить();	
				НоваяСтрока.Контакт = Строка(КонтактЛида);
				НоваяСтрока.НомерТелефона = СтрокаКИ.Представление;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
	
	Если ЭтоКонтрагент Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПараметрСсылка", ПараметрСсылкаФорма);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.ОбъектВладелец = &ПараметрСсылка";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивОбъектов.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;		
	
	Если ЭтоСотрудник ИЛИ ЭтоПользователь ИЛИ ЭтоКонтрагент Тогда
		КонтактнаяИнформацияОбъектов = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов, ТипыКИ);
		Для каждого Контакт из КонтактнаяИнформацияОбъектов Цикл
			Если ЗначениеЗаполнено(Контакт.Представление) Тогда 
				НоваяСтрока = Список.Добавить();	
				НоваяСтрока.Контакт = Строка(ПараметрСсылкаФорма);
				НоваяСтрока.НомерТелефона = Контакт.Представление;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ВыборКонтактаЗавершение()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	Закрыть(ТекДанные.НомерТелефона);
	 
КонецПроцедуры

#КонецОбласти




