&НаКлиенте
Перем уид1, уид2;

&НаКлиенте
Процедура ФотоФизЛицаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка =Ложь;
	ДобавитьИзображение(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(ТекущийЭлемент, СтандартнаяОбработка)
	
	ДополнительныеПараметры = Новый Структура("Аватар", ТекущийЭлемент = Элементы.ФотоФизЛицаАватар);	
	Оповещение = Новый ОписаниеОповещения("ДобавитьИзображениеЗавершение", ЭтаФорма, ДополнительныеПараметры);
	НачатьПомещениеФайла(Оповещение,,, Истина, УникальныйИдентификатор);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеЗавершение(Результат, Адрес, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		Если ДополнительныеПараметры.Аватар Тогда 			
			ИА_КСУОбщийСервер.ОбновитьАватар(,,Адрес,АдресКартинкиАватар, уид2);
		Иначе
			АдресКартинки = Адрес;
			ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьИзображениеЗавершениеЗавершение", ЭтотОбъект, Новый Структура("Адрес, уид2", Адрес, уид2)), "Обновить аватар?",РежимДиалогаВопрос.ДаНет);
            Возврат;
		КонецЕсли;
		
		ДобавитьИзображениеЗавершениеФрагмент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеЗавершениеЗавершение(РезультатВопроса, ДополнительныеПараметры1) Экспорт
	
	Адрес = ДополнительныеПараметры1.Адрес;
	уид2 = ДополнительныеПараметры1.уид2;
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ИА_КСУОбщийСервер.ОбновитьАватар(,,Адрес,АдресКартинкиАватар, уид2);
	КонецЕсли;
	
	ДобавитьИзображениеЗавершениеФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеЗавершениеФрагмент()
	
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		
		Фото   = ПолучитьИзВременногоХранилища(АдресКартинки);
		Данные = ИА_КСУОбщийСервер.Картинки_ИзменитьРазмер(Фото, 220, 220, 0.75);
		
		Если Данные.Выполнено Тогда
			Фото = Данные.ДДКартинки;
		КонецЕсли;
		
		ТекущийОбъект.Фото = Новый ХранилищеЗначения(Фото, Новый СжатиеДанных());
		
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресКартинкиАватар) Тогда
		
		Фото   = ПолучитьИзВременногоХранилища(АдресКартинкиАватар);		
		ТекущийОбъект.ФотоАватар = Новый ХранилищеЗначения(Фото, Новый СжатиеДанных());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уид1 = новый УникальныйИдентификатор;
	уид2 = новый УникальныйИдентификатор;
	
	Если ЗначениеЗаполнено(Запись.ФизЛицо) Тогда
		АдресКартинки = ИА_КСУОбщийСервер.ОбновитьИзображение(Запись.ФизЛицо,,уид1);
		АдресКартинкиАватар = ИА_КСУОбщийСервер.ОбновитьИзображение(Запись.ФизЛицо, "Аватар",уид2);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ЗакрытиеФормыФЛ_КЦ");
КонецПроцедуры
