
&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Настройки);	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СохранитьПользовательскиеНастройкиНаСервере();	
КонецПроцедуры

&НаСервере
Процедура СохранитьПользовательскиеНастройкиНаСервере()
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
			
	НовоеПисьмо = ОтправитьПоПочтеНаСервере();
	
	Попытка
		ИдДатаС = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачала").ИдентификаторПользовательскойНастройки;
		ИдДатаПо = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОкончания").ИдентификаторПользовательскойНастройки;
		ДатаС = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдДатаС).Значение;
		ДатаПо = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдДатаПо).Значение;
	Исключение
		ДатаС = "";
		ДатаПо = "";
	КонецПопытки;
	
	ИмяФайла = КаталогВременныхФайлов() + "Детализация заказов на производство за период с " + Формат(ДатаС.Дата, "ДЛФ=Д") 
	+ " по " + Формат(ДатаПо.Дата,"ДЛФ=Д") + ".xls";
	Результат.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	ИмяБезРасширения = КаталогВременныхФайлов() + "Детализация заказов на производство за период с " + Формат(ДатаС.Дата, "ДЛФ=Д") 
	+ " по " + Формат(ДатаПо.Дата,"ДЛФ=Д"); 
	Расширение = ".xls";
	
	ВложитьФайлНаСервере(НовоеПисьмо, ИмяБезРасширения, Расширение, ОбщийМодуль.Сериализовать(Новый ДвоичныеДанные(ИмяФайла)));
	
	ПараметрыНовойФормы = Новый Структура("Ключ", НовоеПисьмо);
	ОткрытьФорму("Документ.ЭлектронноеПисьмо.ФормаОбъекта", ПараметрыНовойФормы);
			
КонецПроцедуры

&НаСервере
Процедура ВложитьФайлНаСервере(Ссылка, ИмяФайла, Расширение, Данные)
	РаботаСЭлектроннойПочтой.СохранитьВложение(Ссылка, ИмяФайла, Расширение, Данные);
КонецПроцедуры

&НаСервере
Функция ОтправитьПоПочтеНаСервере()
	
	Попытка
		ИдДатаС = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачала").ИдентификаторПользовательскойНастройки;
		ИдДатаПо = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОкончания").ИдентификаторПользовательскойНастройки;
		ДатаС = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдДатаС).Значение;
		ДатаПо = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдДатаПо).Значение;
	Исключение
		ДатаС = "";
		ДатаПо = "";
	КонецПопытки;
	
	ЗаголовокНовогоПисьма = "Детализация заказов на производство за период с " + Формат(ДатаС.Дата, "ДЛФ=Д") 
	+ " по " + Формат(ДатаПо.Дата, "ДЛФ=Д");
	
	ТекстПисьма = "Добрый день!
	|Высылаем вам детализацию заказов на производство.";	
	
	НовоеПисьмо = РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмо(ЗаголовокНовогоПисьма, , ТекстПисьма);
	
	Возврат НовоеПисьмо;				
				
КонецФункции

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
КонецПроцедуры
