
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//#11632
	//КоличествоЧасовПерезвонить = Константы.КоличествоЧасовПерезвонитьПриОтказеНаЗамере.Получить();
	//ДатаПерезвонить = ТекущаяДатаСеанса() + КоличествоЧасовПерезвонить*60*60;
	//Дата = Дата(Год(ДатаПерезвонить), Месяц(ДатаПерезвонить), День(ДатаПерезвонить));
	//Время = Дата(Год(ДатаПерезвонить), Месяц(ДатаПерезвонить), День(ДатаПерезвонить), Час(ДатаПерезвонить), Минута(ДатаПерезвонить), Секунда(ДатаПерезвонить));
	ВремяСдвигаВСекундах = ОбщийМодульСервер.ПолучитьВремяСдвигаДатыСледующегоКонтактаЛида(Перечисления.СобытияИзмененияДатыСледующегоКонтактаЛида.ПриОтказеЗаключитьДоговорНаЗамере);
	НоваяДатаСледующегоКонтакта = ТекущаяДатаСеанса() + ВремяСдвигаВСекундах;
	Дата = НоваяДатаСледующегоКонтакта;
	//Время = НоваяДатаСледующегоКонтакта;
	
	//#8113
	ИнформацияОСтатусеЛида = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Статус лида: %1 -> %2", Параметры.ТекущийСтатус, Параметры.СтатусПерехода);
	
	// №9558
	ДатаСледующегоКонтакта = Параметры.ДатаСледующегоКонтакта;
	
	//#15955 
	ПричинаОтказаЗамера = Справочники.ПричиныОтказаЗамера.ПричинаПоУмолчанию();	
	ПроверятьКомментарий = Константы.КонтролироватьЗаполнениеКомментарияПриОтказеПоЗамеру.Получить();
	Элементы.Комментарий.АвтоОтметкаНезаполненного = ПроверятьКомментарий;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьИнформациюОДатеСледующегоКонтакта();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если ПричинаОтказаЗамера.Пустая() Тогда
		ПоказатьОповещениеПользователя("Не указана причина отказа");
		Возврат;
	КонецЕсли;
	Если ПроверятьКомментарий И ПустаяСтрока(Комментарий) Тогда
		ПоказатьОповещениеПользователя("Не указан комментарий");
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Дата",Дата);
	//СтруктураОтвета.Вставить("Время",Время);
	СтруктураОтвета.Вставить("Комментарий",Комментарий);
	СтруктураОтвета.Вставить("ПричинаОтказаЗамера",ПричинаОтказаЗамера);
	Закрыть(СтруктураОтвета);
			
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОДатеСледующегоКонтакта()
	
	//НоваяДатаСледующегоКонтакта = СокрЛП(Формат(Дата, "ДФ=dd.MM.yyyy") + " " + Формат(Время, "ДФ=HH:mm"));
	НоваяДатаСледующегоКонтакта = СокрЛП(Формат(Дата, "ДФ='dd.MM.yyyy HH:mm'"));
	ИнформацияОДатеСледующегоКонтакта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"Дата следующего контакта: %1 -> %2"
		, ?(ПустаяСтрока(ДатаСледующегоКонтакта), """Пустая""", ДатаСледующегоКонтакта)
		, ?(ПустаяСтрока(НоваяДатаСледующегоКонтакта), """Пустая""", НоваяДатаСледующегоКонтакта)
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьИнформациюОДатеСледующегоКонтакта();
	
КонецПроцедуры

