Функция ОпределитьСостояниеОплаты(ДокументЗаявки, ИсключаемыйДокументОплаты = Неопределено) Экспорт
	
	СостояниеОплачено = Ложь;
	ОстатокКВыплате = ОпределитьОстатокКВыплате(ДокументЗаявки, ИсключаемыйДокументОплаты);
	
	Если ОстатокКВыплате <= 0 Тогда
		СостояниеОплачено = Истина;
	КонецЕсли;
	
	Возврат СостояниеОплачено;
		
КонецФункции

Функция ОпределитьОстатокКВыплате(ДокументЗаявки, ИсключаемыйДокументОплаты = Неопределено) Экспорт
	
	ОстатокКВыплате = 0;
	УстановитьПривилегированныйРежим(Истина);	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ЕСТЬNULL(ДенежныеСредстваКВыплатеОстаткиИОбороты.СуммаПриход, 0) - ЕСТЬNULL(ДенежныеСредстваКВыплатеОстаткиИОбороты.СуммаРасход, 0)), 0) КАК НеОплачено
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.ОстаткиИОбороты(, , Авто, , Заявка = &ДокументЗаявки) КАК ДенежныеСредстваКВыплатеОстаткиИОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИсключитьДокументОплаты
	|				ТОГДА НЕ ДенежныеСредстваКВыплатеОстаткиИОбороты.Регистратор = &ДокументОплаты
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДокументЗаявки", ДокументЗаявки);
	Запрос.УстановитьПараметр("ДокументОплаты", ИсключаемыйДокументОплаты);
	Запрос.УстановитьПараметр("ИсключитьДокументОплаты", НЕ ИсключаемыйДокументОплаты = Неопределено);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ОстатокКВыплате = Выборка.НеОплачено;
	КонецЕсли;
			
	Возврат ОстатокКВыплате;
		
КонецФункции

