&НаСервере
Перем НастройкиРС;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ОбновитьВсе();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсе()
	НастройкиРС = КСУ_РС_Владельца.ПолучитьНастройки();
	//
	ТекИндСтат = 0;
	КСУ_РС_Владельца.УстановитьПериодСтатистик(НастройкиРС, ДатаНачалаСтатФП,ДатаКонцаСтатФП,ДатаНачалаСтат,ДатаКонцаСтат);	
	КСУ_РС_Владельца.ЗаполнитьСтатистикиФП(ТабСтатФП);		
	
	//
	ОбновитьВиджетФП();
	ОбновитьВиджетКЦ();
	ОбновитьВиджетСтратегия();
	ОбновитьВиджетДИ();
	ОбновитьВиджетПланы();
	ОбновитьВиджетСтатистики();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетФП()
	ОбновитьВиджетФП_Показатели();
	ОбновитьВиджетФП_Статистика(ТабСтатФП[ТекИндСтат].ВидСтатистики, ТабСтатФП[ТекИндСтат].Заголовок);
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетФП_Статистика(видСтат, ЗаголовокСтат)
	тз = ИА_Статистики.ПолучитьДанныеСтатистики(ДатаНачалаСтатФП, ДатаКонцаСтатФП, Перечисления.ИА_ПериодыДетализации.Неделя, видСтат, Неопределено, Неопределено, Неопределено);
	
	ДиаграммаФП.Обновление = ложь;
	ДиаграммаФП.Очистить();
	ДиаграммаФП.ОбластьЗаголовка.Текст = ЗаголовокСтат; 
	
	СерияДиаг = ДиаграммаФП.Серии.Добавить("ЗаголовокСтат"); 
	Для каждого стр из тз Цикл
		ТекстТчк = формат(стр.ДатаНачала,"ДФ=dd.MM") + "-" + формат(стр.ДатаКонца,"ДФ=dd.MM");
		точкаДиаг = ДиаграммаФП.Точки.Добавить();
		ДиаграммаФП.УстановитьЗначение(точкаДиаг, СерияДиаг, окр(стр.Значение),,ТекстТчк + " " +строка(окр(стр.Значение))); 
	КонецЦикла;
	
	ДиаграммаФП.Обновление = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетФП_Показатели()
	фпПок = КСУ_РС_Владельца.ПолучитьФП_Показатели();
	
	
	Если ЗначениеЗаполнено(фпПок.Вал) Тогда
		Элементы.ДекВалЗн.Заголовок = Формат(фпПок.Вал,"ЧДЦ=0; ЧН=");
		Элементы.ДекМаржаЗн.Заголовок = Формат(фпПок.Маржа,"ЧДЦ=0; ЧН=");
	Иначе
		Элементы.ДекВалЗн.Заголовок = "-";
		Элементы.ДекМаржаЗн.Заголовок = "-";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(фпПок.Счета) Тогда
		Элементы.ДекСчетаЗн.Заголовок = Формат(фпПок.Счета,"ЧДЦ=0; ЧН=");
	Иначе
		Элементы.ДекСчетаЗн.Заголовок = "-";
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	ТекИндСтат = ТекИндСтат + 1;
	если ТекИндСтат >= ТабСтатФП.Количество() Тогда
		ТекИндСтат = 0;
	КонецЕсли;
	
	ОбновитьВиджетФП_Статистика(ТабСтатФП[ТекИндСтат].ВидСтатистики, ТабСтатФП[ТекИндСтат].Заголовок);
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетКЦ()
	Выборка = КСУ_РС_Владельца.ПолучитьДанныеКЦ(НастройкиРС);
	
	//Удаление элементов
	колУд = Элементы.ГруппаКЦПост.ПодчиненныеЭлементы.Количество();
	Пока колУд>2 Цикл
		Элементы.Удалить(Элементы["ДекПост" + строка(колУд-1)]);
		Элементы.Удалить(Элементы["ДекВсегоЗадач" + строка(колУд-1)]);
		Элементы.Удалить(Элементы["ДекВыполнено" + строка(колУд-1)]);
		Элементы.Удалить(Элементы["ДекПросрочено" + строка(колУд-1)]);
		
		колУд = колУд - 1;
	КонецЦикла;
	
	Если выборка.Количество() =0 Тогда
		Элементы.ДекПост1.Заголовок = "-";
		Элементы.ДекВсегоЗадач1.Заголовок = "-";
		Элементы.ДекВыполнено1.Заголовок = "-";
		Элементы.ДекПросрочено1.Заголовок = "-";
	иначе
		сч = 1;
		Пока выборка.Следующий() Цикл
			Если сч > 1 Тогда
				ДобавитьПодобныйЭлемент("ДекПост",сч, Элементы.ГруппаКЦПост);				
				ДобавитьПодобныйЭлемент("ДекВсегоЗадач",сч, Элементы.ГруппаКЦВсего);
				ДобавитьПодобныйЭлемент("ДекВыполнено",сч, Элементы.ГруппаКЦВыполнено);
				ДобавитьПодобныйЭлемент("ДекПросрочено",сч, Элементы.ГруппаКЦПросрочено);
			КонецЕсли;
			
			Элементы["ДекПост" + сч].Заголовок = Выборка.НаимПоста;
			Элементы["ДекВсегоЗадач" + сч].Заголовок = Выборка.Всего;
			Элементы["ДекВыполнено" + сч].Заголовок = Выборка.ВыполненоЗаНед;
			Элементы["ДекПросрочено" + сч].Заголовок = Выборка.Просрочено;
			
			сч = сч + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПодобныйЭлемент(ИмяЭл,сч,РодительЭл)
	НовЭл = Элементы.Добавить(ИмяЭл + сч, тип("ДекорацияФормы"), РодительЭл);
	ЗаполнитьЗначенияСвойств(НовЭл, Элементы[ИмяЭл+"1"],,"Имя");
КонецПроцедуры

&НаКлиенте
Процедура Декорация3Нажатие(Элемент)
	ОткрытьФорму("Обработка.КСУ_РабочийСтолВладельца.Форма.Настройки",,,,,, Новый ОписаниеОповещения("Декорация3НажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Декорация3НажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат<> Неопределено и Результат ТОгда
		ОбновитьВсе();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетСтратегия()
	
	//Удаление элементов
	колУд = Элементы.ГруппаСтрПрограмма.ПодчиненныеЭлементы.Количество();
	Пока колУд>2 Цикл
		Элементы.Удалить(Элементы["ДекПрограмма" + строка(колУд-1)]);
		Элементы.Удалить(Элементы["ДекПроцВып" + строка(колУд-1)]);
		Элементы.Удалить(Элементы["ДекВыпЗадач" + строка(колУд-1)]);
		Элементы.Удалить(Элементы["ДекСтратегПросрочено" + строка(колУд-1)]);
		
		колУд = колУд - 1;
	КонецЦикла;
	
	Если НастройкиРС.СТ_Программы .Количество() =0 Тогда
		Элементы.ДекПрограмма1.Заголовок = "-";
		Элементы.ДекПроцВып1.Заголовок = "-";
		Элементы.ДекВыпЗадач1.Заголовок = "-";
		Элементы.ДекСтратегПросрочено1.Заголовок = "-";
	КонецЕсли;

	
	сч = 1;
	Для каждого программаСп из  НастройкиРС.СТ_Программы Цикл
		программа = программаСп.значение;
		
		Выборка = КСУ_РС_Владельца.ПолучитьДанныеПрограммы(программа);
		
		
		выборка.Следующий();
		Если сч > 1 Тогда
			ДобавитьПодобныйЭлемент("ДекПрограмма",сч, Элементы.ГруппаСтрПрограмма);				
			ДобавитьПодобныйЭлемент("ДекПроцВып",сч, Элементы.ГруппаПроцВып);
			ДобавитьПодобныйЭлемент("ДекВыпЗадач",сч, Элементы.ГруппаВыпЗадач);
			ДобавитьПодобныйЭлемент("ДекСтратегПросрочено",сч, Элементы.ГруппаСтратегПросрочено);
		КонецЕсли;
				
		Элементы["ДекПрограмма" + сч].Заголовок = Программа;
		Элементы["ДекПроцВып" + сч].Заголовок = ?(ЗначениеЗаполнено(Выборка.ПроцентВыполнения),Окр(Выборка.ПроцентВыполнения,0),0);
		Элементы["ДекВыпЗадач" + сч].Заголовок = ?(ЗначениеЗаполнено(Выборка.ЗадачВыполнено),Окр(Выборка.ЗадачВыполнено,0),0);
		Элементы["ДекСтратегПросрочено" + сч].Заголовок = ?(ЗначениеЗаполнено(Выборка.ЗадачПросрочено),Окр(Выборка.ЗадачПросрочено,0),0);
				
		сч = сч + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетДИ()
	
	выборка = КСУ_РС_Владельца.ПолучитьДанныеДИ();
		
	выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.КоличествоДИ) Тогда
		Элементы.ДекВсегоДИ.Заголовок = Выборка.КоличествоДИ;
		Элементы.ДекОтправленоДИ.Заголовок = ?(ЗначениеЗаполнено(Выборка.Отправлено),Окр(Выборка.Отправлено,0),0);
		Элементы.ДекСданоДИ.Заголовок = ?(ЗначениеЗаполнено(Выборка.Сдано),Окр(Выборка.Сдано,0),0);
		Элементы.ДекПросроченоДИ.Заголовок = ?(ЗначениеЗаполнено(Выборка.Просрочено),Окр(Выборка.Просрочено,0),0);
		
		Элементы.ДекОтправленоДИ_Проц.Заголовок = Окр((Выборка.Отправлено / Выборка.КоличествоДИ) * 100,0);
		Элементы.ДекСданоДИ_Проц.Заголовок = Окр((Выборка.Сдано / Выборка.КоличествоДИ) * 100,0);
		Элементы.ДекПросроченоДИ_Проц.Заголовок = Окр((Выборка.Просрочено / Выборка.КоличествоДИ) * 100,0);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетПланы()
	
	//Удаление элементов
	колУд = Элементы.ГруппаБППост.ПодчиненныеЭлементы.Количество();
	Пока колУд>2 Цикл
		Элементы.Удалить(Элементы["ДекПостБП" + строка(колУд-1)]);
		Элементы.Удалить(Элементы["ДекПроцентБП" + строка(колУд-1)]);		
		колУд = колУд - 1;
	КонецЦикла;
	
	выборка = КСУ_РС_Владельца.ПолучитьДанныеПланов(НастройкиРС);
	
	
	Если выборка.Количество() =0 Тогда
		Элементы.ДекПостБП1.Заголовок = "-";
		Элементы.ДекПроцентБП1.Заголовок = "-";
	иначе
		сч = 1;
		Пока выборка.Следующий() Цикл
			Если сч > 1 Тогда
				ДобавитьПодобныйЭлемент("ДекПостБП",сч, Элементы.ГруппаБППост);				
				ДобавитьПодобныйЭлемент("ДекПроцентБП",сч, Элементы.ГруппаБППроцент);		
			КонецЕсли;
			
			Элементы["ДекПостБП" + сч].Заголовок = Выборка.НаимПоста;
			Элементы["ДекПроцентБП" + сч].Заголовок = формат(?(Выборка.ИтогоВремя = 0, 0, Выборка.ВыполненоВремя / Выборка.ИтогоВремя * 100),"ЧДЦ=; ЧН="); 			
			
			сч = сч + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетСтатистики()
	
	//Удаление элементов
	колУд = Элементы.ГруппаСтатВид.ПодчиненныеЭлементы.Количество();
	Пока колУд>2 Цикл
		Элементы.Удалить(Элементы["ДекВидСтат" + строка(колУд-1)]);
		Элементы.Удалить(Элементы["ДекПредСтат" + строка(колУд-1)]);		
		Элементы.Удалить(Элементы["ДекТекСтат" + строка(колУд-1)]);		
		Элементы.Удалить(Элементы["ГруппаПокСтат" + строка(колУд-1)]);		
		колУд = колУд - 1;
	КонецЦикла;
		
	
	настрСтат = НастройкиРС.Стат_Настройка.Статистики;
	
	Если настрСтат.Количество() =0 Тогда
		Элементы.ДекВидСтат1.Заголовок = "-";
		Элементы.ДекПредСтат1.Заголовок = "-";
		Элементы.ДекТекСтат1.Заголовок = "-";
		Элементы.ДекТрендСтат1.Картинка = новый Картинка();
	иначе
		сч = 1;
		Для каждого стр из настрСтат Цикл
			Если сч > 1 Тогда
				ДобавитьПодобныйЭлемент("ДекВидСтат",сч, Элементы.ГруппаСтатВид);				
				ДобавитьПодобныйЭлемент("ДекПредСтат",сч, Элементы.ГруппаСтатПред);		
				//
				НовГр = Элементы.Добавить("ГруппаПокСтат" + сч, тип("ГруппаФормы"), Элементы.ГруппаСтатТек);
				ЗаполнитьЗначенияСвойств(НовГр, Элементы.ГруппаПокСтат1,,"Имя,ПутьКДаннымЗаголовка");
				//
				ДобавитьПодобныйЭлемент("ДекТекСтат",сч, НовГр);		
				ДобавитьПодобныйЭлемент("ДекТрендСтат",сч, НовГр);		
			КонецЕсли;
			
			тз = ИА_Статистики.ПолучитьДанныеСтатистики(ДатаНачалаСтат, ДатаКонцаСтат, НастройкиРС.Стат_Период, стр.ВидСтатистики, стр.Аналитика1, стр.Аналитика2, стр.Аналитика3);
			ПредЗн = тз[0].Значение;
			ТекЗн = тз[1].Значение;
			
			Элементы["ДекВидСтат" + сч].Заголовок = стр.НаименованиеДляЛегенды;
			Элементы["ДекПредСтат" + сч].Заголовок = Формат(ПредЗн,"ЧДЦ=2; ЧН="); 			
			Элементы["ДекТекСтат" + сч].Заголовок = Формат(ТекЗн,"ЧДЦ=2; ЧН="); 
			Если стр.ВидСтатистики.ПеревернутаяСтатистика Тогда				
				Элементы["ДекТрендСтат" + сч].Картинка = ?(ТекЗн<ПредЗн, БиблиотекаКартинок.КСУ_СтрелкаВверх,БиблиотекаКартинок.КСУ_СтрелкаВниз); 			
			Иначе
				Элементы["ДекТрендСтат" + сч].Картинка = ?(ТекЗн>ПредЗн, БиблиотекаКартинок.КСУ_СтрелкаВверх,БиблиотекаКартинок.КСУ_СтрелкаВниз); 			
			КонецЕсли;
			
			сч = сч + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОбновитьНажатие(Элемент)
	ОбновитьВсе();
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияОбновить1Нажатие(Элемент)
	настрСтат = КСУ_РС_Владельца.ПолучитьНастройкуСтат();
	Если ЗначениеЗаполнено(настрСтат) Тогда
		Ф = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма.Форма",,,истина); 
		Ф.Открыть();
		Ф.Объект.Настройка = настрСтат;
		Ф.НастройкаПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура PDF(Команда)
	почта = "";
	ПоказатьВводСтроки(Новый ОписаниеОповещения("PDFЗавершение", ЭтотОбъект, Новый Структура("почта", почта)), почта,"Куда отправить?");
КонецПроцедуры

&НаКлиенте
Процедура PDFЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	почта = ?(Строка = Неопределено, ДополнительныеПараметры.почта, Строка);
	
	
	Если (Строка <> Неопределено) Тогда
		имяПДФ = КСУ_РС_Владельца.ОтправитьPDF(почта);
		Если ЗначениеЗаполнено(имяПДФ) Тогда
			ПодключитьОбработчикОжидания("УдалитьPDF",5,истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьPDF() Экспорт
	УдалитьPDFСервер();
КонецПроцедуры

&НаСервере
Процедура УдалитьPDFСервер() Экспорт
	Попытка 
		Если имяПДФ <> "" Тогда
			УдалитьФайлы(имяПДФ);
		КонецЕсли;
	Исключение
	КонецПопытки;		
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияPDFНажатие(Элемент)
	PDF(Неопределено);
КонецПроцедуры

