#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	Если ИмяСобытия = "УстановкаКонтактногоЛицаПодписантаВыполнена" Тогда
		Элементы.Список.ТекущаяСтрока = Параметр;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаИспользоватьКакПодписанта.Доступность = Не Элементы.Список.ТекущиеДанные.ЭтоПодписант;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКакПодписанта(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.ЭтоПодписант Тогда		
		Возврат;		
	КонецЕсли;
	
	// Если открыта форма контрагента, то изменение основного контактного лица выполняем в ней	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Контрагент",		ТекущиеДанные.ОбъектВладелец);
	СтруктураПараметров.Вставить("КонтактноеЛицо",	ТекущиеДанные.Ссылка);
	
	Оповестить("УстановкаКонтактногоЛицаПодписанта", СтруктураПараметров, ЭтотОбъект);
		
КонецПроцедуры
