// Проверяет и возвращает признак того, есть ли у текущего пользователя права на изменение состояния
//
//	Возвращаемое значение:
//  Булево - Истина, если у текущего пользователя есть права на изменение состояния оригинала.
//
Функция ПраваНаИзменениеСостояния(Знач Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("Массив") Тогда
		Ссылка = Ссылка[0];
	КонецЕсли;
	
	ИмяРоли = "ИзменениеСостоянийОригиналовПервичныхДокументов" + Ссылка.Метаданные().Имя;
	Если РольДоступна(ИмяРоли) Тогда
		Возврат Истина; 
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции
