//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОбработчикиСобытий

//#КонецОбласти

//#Область ОбновлениеИнформационнойБазы

//// Процедура заполняет справочник по умолчанию
////
//Процедура ЗаполнитьПоставляемыеДанные() Экспорт
//	
//	СоздатьОбновитьПредопределенныйЭлемент("Телефон", "Телефон");
//	СоздатьОбновитьПредопределенныйЭлемент("ЭлектроннаяПочта", "Электронная почта");
//	СоздатьОбновитьПредопределенныйЭлемент("ИнтернетСайт", "Интернет-сайт");
//	
//КонецПроцедуры

//Процедура СоздатьОбновитьПредопределенныйЭлемент(ТекЭлемент, ТекЭлементНаименование) Экспорт
//	
//	СпрСсылка = Справочники.ВидыКонтактов.НайтиПоНаименованию(ТекЭлементНаименование, Истина);
//	Если СпрСсылка.Пустая() Тогда
//		СпрОбъект = Справочники.ВидыКонтактов.СоздатьЭлемент();
//		СпрОбъект.Наименование = ТекЭлементНаименование;
//		СпрОбъект.ИмяПредопределенныхДанных = ТекЭлемент;
//		СпрОбъект.Записать();
//	Иначе
//		СпрОбъект = СпрСсылка.ПолучитьОбъект();
//		СпрОбъект.ИмяПредопределенныхДанных = ТекЭлемент;
//		СпрОбъект.Записать();
//	КонецЕсли;	
//		
//КонецПроцедуры

//#КонецОбласти

//#КонецЕсли