
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 1
	НоваяСтрока = ТаблицаЗаданий.Добавить();
	НоваяСтрока.Порядок = 1;
	НоваяСтрока.Задание = "Письма";
	НоваяСтрока.ВыполняемыйМетод = "РаботаСЭлектроннойПочтой.ПроверитьРекламныеЭлектронныеЯщикиПоФоновомуЗаданию";
	НоваяСтрока.ПараметрыОперации = Новый Структура;
	НоваяСтрока.Используется = РаботаСЭлектроннойПочтой.ЕстьЭлектронныеЯщикиавтоматическогоСозданияЛидов();
	
	//2
	НоваяСтрока = ТаблицаЗаданий.Добавить();
	НоваяСтрока.Порядок = 2;
	НоваяСтрока.Задание = "Б24";
	НоваяСтрока.ВыполняемыйМетод = "ОбменСБитрикс24КлиентСервер.ВыполнитьСинхронизациюПоФоновомуЗаданию";	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("НастройкаСинхронизации", Справочники.НастройкиСинхронизацииСБитрикс24.Основная);
	ПараметрыОперации.Вставить("ВидСинхронизации"	   , 2);
	
	НоваяСтрока.ПараметрыОперации = ПараметрыОперации;	
	НоваяСтрока.Используется = ПолучитьФункциональнуюОпцию("ИспользоватьОбменСБитрикс24");
	
	//
	Первый = Истина;
	Для каждого СтрокаТЗ из ТаблицаЗаданий Цикл
		ПорядокСтрокой = Формат(СтрокаТЗ.Порядок, "ЧГ=");
		
		Элементы["Группа" + ПорядокСтрокой].Видимость = СтрокаТЗ.Используется;
		
		Если СтрокаТЗ.Используется Тогда
			Если Первый Тогда
				Первый = Ложь;
			КонецЕсли;

			Элементы["ДекорацияОжидается" + ПорядокСтрокой].Видимость = Истина;
			Элементы["ДекорацияБублик"    + ПорядокСтрокой].Видимость = Ложь;
			Элементы["ДекорацияЗавершено" + ПорядокСтрокой].Видимость = Ложь;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ЗапуститьЗадания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьЗадания()
	
	ОчиститьСообщения();	
	ЗапуститьСледующийЭтапВФоне();
	
КонецПроцедуры

&НаКлиенте
Функция ЗапуститьСледующийЭтапВФоне()
	
	// Инициализируем 
	ЗаданияЗапущены = Истина;
	ЗаданияЗавершены = Истина;
	
	ЕстьНевыполненноеЗадание = Ложь;
	ПрерватьЦикл = Ложь;
	Для каждого СтрокаЗадания из ТаблицаЗаданий Цикл
		Если НЕ СтрокаЗадания.Используется Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаЗадания.Выполнено Тогда
			Продолжить;
		Иначе
		
			ЗаданияЗавершены = Ложь;
			НовыйПорядок = Формат(СтрокаЗадания.Порядок, "ЧГ=");
			
			// "переключаемся" на текущую строку
			ТекущийПорядок = СтрокаЗадания.Порядок;
			ТекущийПорядокСтрокой = Формат(СтрокаЗадания.Порядок, "ЧГ=");
			Элементы["ДекорацияОжидается" + ТекущийПорядокСтрокой].Видимость = Ложь;
			Элементы["ДекорацияБублик"    + ТекущийПорядокСтрокой].Видимость = Истина;
			Элементы["ДекорацияЗавершено" + ТекущийПорядокСтрокой].Видимость = Ложь;
			
			СтрокаЗадания.Выполнено = Истина;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура("ТекущийПорядок", ТекущийПорядок);		
		
		СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(СтрокаЗадания.ВыполняемыйМетод, СтрокаЗадания.ПараметрыОперации, УникальныйИдентификатор);
		ИдентификаторЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.Интервал = 2;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект, ДополнительныеПараметры), ПараметрыОжидания);
					
	КонецЦикла;
	
	Если ЗаданияЗавершены Тогда
		Элементы["ДекорацияОжидается" + ТекущийПорядок].Видимость = Ложь;
		Элементы["ДекорацияБублик"    + ТекущийПорядок].Видимость = Ложь;
		Элементы["ДекорацияЗавершено" + ТекущийПорядок].Видимость = Истина;
		
	КонецЕсли;
		
	Возврат ЗаданияЗапущены;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьФоновоеЗаданиеНаСервере(ВыполняемыйМетод, ПараметрыЗапуска, УникальныйИдентификатор)

	НаименованиеЗадания = НСтр("ru = 'Запуск длительной операции'");

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		//ЗафиксироватьПроблемуРасчета(ДополнительныеПараметры);
		
		Элементы["ДекорацияОжидается" + ТекущийПорядок].Видимость = Ложь;
		Элементы["ДекорацияБублик"    + ТекущийПорядок].Видимость = Ложь;
		Элементы["ДекорацияЗавершено" + ТекущийПорядок].Видимость = Истина;
		
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		// обрабатываем результат
		//РезультатЗадания = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Элементы["ДекорацияОжидается" + ТекущийПорядок].Видимость = Ложь;
		Элементы["ДекорацияБублик"    + ТекущийПорядок].Видимость = Ложь;
		Элементы["ДекорацияЗавершено" + ТекущийПорядок].Видимость = Истина;		
			
		ЗапуститьСледующийЭтапВФоне();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗакрытьНаСервере()
	
	// снимаем признаки с заданий
	Для каждого СтрокаЗадания из ТаблицаЗаданий Цикл
		СтрокаЗадания.Используется = Ложь;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
		Если ФоновоеЗадание <> Неопределено Тогда
			ФоновоеЗадание.Отменить();
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	
	ЗакрытьНаСервере();	
	Закрыть();
	
КонецПроцедуры


