&НаСервере
Функция ПолучитьСписокМесяцев(Год)
	
	СписокМесяцев = Новый СписокЗначений;
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,1,1,0,0,1)),"Январь");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,2,1,0,0,1)),"Февраль");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,3,1,0,0,1)),"Март");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,4,1,0,0,1)),"Апрель");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,5,1,0,0,1)),"Май");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,6,1,0,0,1)),"Июнь");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,7,1,0,0,1)),"Июль");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,8,1,0,0,1)),"Август");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,9,1,0,0,1)),"Сентябрь");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,10,1,0,0,1)),"Октябрь");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,11,1,0,0,1)),"Ноябрь");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,12,1,0,0,1)),"Декабрь");
	
	Возврат СписокМесяцев;
	
КонецФункции

&НаСервере
Функция СформироватьНаСервере()
	
	ТекОбъект = ЭтаФорма.РеквизитФормыВЗначение("Отчет");
	Макет = ТекОбъект.ПолучитьМакет("Макет");
	Возврат МодульОтчетов.СформироватьОтчетИсполнениеПланаПродажТехнологовЗамера(Макет, Отчет.Год, Отчет.Месяц, Отчет.Технолог);
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Если Отчет.Месяц = Дата("00010101") Тогда
		Сообщить("Месяц отчета не выбран");
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Год = Год(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборМесяца(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Отчет.Месяц = ВыбранныйЭлемент.Значение;
	Элементы.ДекорацияМесяц.Заголовок = "Месяц: " + Формат(Отчет.Месяц,"ДФ=ММММ");
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц(Команда)
	СписокВариантов = ПолучитьСписокМесяцев(Отчет.Год);
		
	Оп = Новый ОписаниеОповещения("ВыборМесяца", ЭтаФорма);
	ПоказатьВыборИзМеню(Оп, СписокВариантов, Элементы.ВыбратьМесяц);
КонецПроцедуры

&НаКлиенте
Процедура ГодПланаПриИзменении(Элемент)
	Отчет.Месяц = Дата("00010101");
	Элементы.ДекорацияМесяц.Заголовок = "Месяц не выбран";
КонецПроцедуры

