
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ РежимРедактирования Тогда
		
		Если ТипЗнч(Объект.НастраиваемыйОбъект) = Тип("СправочникСсылка.ПроизвольныеОтчеты") Тогда
			Отказ = Истина;
			ОткрытьФорму("Справочник.ПроизвольныеОтчеты.Форма.ФормаОтображенияОтчетаУправляемая", Новый Структура("Ключ, СохраненнаяНастройка", Объект.НастраиваемыйОбъект, Объект.Ссылка));
		ИначеЕсли ТипЗнч(Объект.НастраиваемыйОбъект) = Тип("СправочникСсылка.ПанелиОтчетов") Тогда
			Отказ = Истина;
			ОткрытьФорму("Справочник.ПанелиОтчетов.Форма.ФормаЭлемента_Управляемая", Новый Структура("Ключ, СохраненнаяНастройка", Объект.НастраиваемыйОбъект, ОБъект.Ссылка));
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимРедактирования = Параметры.РежимРедактирования = Истина;
	
КонецПроцедуры
