// СписокИДЭлементов - массив структур , ID - ID на ангийском, Заголовок - представление (заголовок), Текст - начлаьное заполнение поля
Функция ПолучитьРедакторHTML(СписокИДЭлементов, ТолькоПросмотр) Экспорт
	КатВР = КаталогВременныхФайлов();
	ПутьКИконкам = КатВР+"html_icons_1c.gif";
	ПутьКРедактору = КатВР + "1c_html_edit.html"; 
	
		Иконки = ИА_РедакторТекстаHTML.ПолучитьИконкиРедактораHTML();
		Иконки.Записать(ПутьКИконкам);
		
		ТекстРедактора = ИА_РедакторТекстаHTML.ПолучитьРедакторHTML_Шаблон();
		ТекстРедактора = СтрЗаменить(ТекстРедактора, "%iconsPath%" ,"file://"+СтрЗаменить(ПутьКИконкам,"\","/"));
	
	//СписокКнопок = "'save','bold','italic','underline','left','center','right','justify','ol','ul','fontSize','forecolor','bgcolor'";
	СписокКнопок = "'save','bold','italic','underline','left','center','right','justify','ol','ul','fontSize'";
	ТекстРедактора = СтрЗаменить(ТекстРедактора, "%buttonList%" ,?(ТолькоПросмотр,"",СписокКнопок));
	ТекстРедактора = СтрЗаменить(ТекстРедактора, "%contentEditable%" ,?(ТолькоПросмотр,"false","true"));
	
	ТекстПолей = "";
	для каждого стр из СписокИДЭлементов Цикл
		ТекстПолей = ТекстПолей + "<b>"+стр.Заголовок+":</b><br>";
		ТекстПолей = ТекстПолей + "<textarea name=""area1"" id = """+стр.ID+""" style=""width: 100%;"">"+стр.Текст+"</textarea><br>";
	КонецЦикла;
	ТекстРедактора = СтрЗаменить(ТекстРедактора, "%ТекстПолей%" ,ТекстПолей);
	
	ТекстДляЗаписи = Новый ЗаписьТекста(ПутьКРедактору,КодировкаТекста.UTF8);
	ТекстДляЗаписи.Записать(ТекстРедактора);
	ТекстДляЗаписи.Закрыть();
	
	Возврат ПутьКРедактору
КонецФункции

Функция ПолучитьТекстИзHTML(ТекстHTML) Экспорт
	
	фд = Новый ФорматированныйДокумент();
	вл = новый Структура();
	фд.УстановитьHTML(ТекстHTML, вл);
	рез = Строка(фд.ПолучитьФорматированнуюСтроку());

	Возврат рез;
КонецФункции

Функция ОчиститьПустуюСтроку(пСтрока) Экспорт
	//пСтрока = СтрЗаменить(пСтрока,"&lt;","<");
	//пСтрока = СтрЗаменить(пСтрока,"&gt;",">");
	Возврат ?(ВРЕГ(пСтрока)="<BR>","",пСтрока);
КонецФункции
