
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП, Элементы.ФормаЗаписатьЗакрыть);
	
	Право = ИА_АдминшкалаСервер.ПолучитьПравоНаОбъект(Объект.Ссылка);
	Если право=Неопределено Тогда
		Отказ = Истина;
		Сообщить("У вас нет прав на открытие данного объекта");
		возврат;
	КонецЕсли;
	
	Если Право = Перечисления.ИА_ПраваНаОбъекты.Просмотр Тогда
		ЭтаФорма.ТолькоПросмотр = истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДоступныеЭлементы()
	ДоступныеЭлементы.Очистить();
	макет = ПолучитьОбщийМакет("ИА_ДоступныеЭлементыСтратегПланирования");
	сч = 1;
	ИмяТипа = СокрЛП(Макет.Область(сч,1,сч,1).Текст);
	ДостЭл = СокрЛП(Макет.Область(сч,2,сч,2).Текст);
	Пока ИмяТипа <> "" Цикл
		Если ДостЭл <> "" Тогда
			тд = Новый ТекстовыйДокумент;
			тд.УстановитьТекст(ДостЭл);
			
			для счЭл = 1 По тд.КоличествоСтрок() Цикл
				текСтрока = СокрЛП(тд.ПолучитьСтроку(счЭл));
				Если текСтрока <> "" Тогда
					Новстр = ДоступныеЭлементы.Добавить();
					Новстр.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления[ИмяТипа];
					Новстр.ИмяЭлемента = текСтрока;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		
		сч = сч + 1;
		ИмяТипа = СокрЛП(Макет.Область(сч,1,сч,1).Текст);
		ДостЭл = СокрЛП(Макет.Область(сч,2,сч,2).Текст);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.ТипЗадачи") и не ЗначениеЗаполнено(Объект.ТипЗадачи) Тогда
		ПоказатьПредупреждение(,"Укажите тип задачи!");
		Отказ = Истина;
		возврат;
	КонецЕсли;
	Объект.Наименование = Лев(СокрЛП(Объект.Содержание),50);
	
	ТекПольз = ТекПользователь();
	Если Объект.Права.Количество() = 1 и Объект.Права[0].Пользователь <> ТекПольз и не ПропуститьПроверку Тогда
		отказ = Истина;
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПриЗаписи", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "В правах только 1 пользователь и он не совпадает с вами! Продолжить?", Режим, 0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПриЗаписи(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПропуститьПроверку = истина;
        Записать();
		Закрыть();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементов()
	Для каждого элем из Элементы.ГруппаРеквизитов.ПодчиненныеЭлементы Цикл
		элем.Видимость = Ложь;	
	КонецЦикла;
	
	Отбор = новый Структура("ТипЭлемента", Объект.ТипЭлемента);
	ДостЭл = ДоступныеЭлементы.НайтиСтроки(Отбор);
	Для каждого рекв из ДостЭл Цикл
		Элементы[рекв.ИмяЭлемента].Видимость = Истина;
		Элементы.Переместить(Элементы[рекв.ИмяЭлемента], Элементы.ГруппаРеквизитов);
	КонецЦикла;
	
	Элементы.ФормаСохранитьВАрхив.Видимость = ЗначениеЗаполнено(Объект.Ссылка) и ОБъект.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Программа;
	Элементы.ЗависитОтЗадачи.Видимость = ЗначениеЗаполнено(Объект.Ссылка) и ОБъект.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Задача;
	
	Если Элементы.ЗависитОтЗадачи.Видимость Тогда
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_СтратегическоеУправление.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ИА_СтратегическоеУправление КАК ИА_СтратегическоеУправление
		               |ГДЕ
		               |	ИА_СтратегическоеУправление.Родитель = &Родитель
		               |	И ИА_СтратегическоеУправление.ПометкаУдаления = ЛОЖЬ
		               |	И ИА_СтратегическоеУправление.Ссылка <> &Ссылка
		               |	И ИА_СтратегическоеУправление.ТипЭлемента = &ТипЭлемента";
		запрос.УстановитьПараметр("Родитель", Объект.Родитель);
		запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		запрос.УстановитьПараметр("ТипЭлемента", Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Задача);
		масс = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ссылка");
		Элементы.ЗависитОтЗадачи.СписокВыбора.ЗагрузитьЗначения(масс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьЭлментов()
	Элементы.СоздатьЗадачу.Доступность = (НЕ ЗначениеЗаполнено(Объект.Задача)) и (не Объект.Выполнено)
										И объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача")
										и (не объект.ЭтоАрхив )
										и (не объект.ЭтоКоррекция )
										И ИА_АдминшкалаСервер.МожноВыполнитьЗадачу(Объект.Ссылка);
	
	Если Объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача") Тогда
		Элементы.Выполнено.Доступность = ЗначениеЗаполнено(Объект.Ссылка) И ИА_АдминшкалаСервер.МожноВыполнитьЗадачу(Объект.Ссылка);
	КонецЕсли;
	
	ПользНаПосту = ПользовательНаПосту(Объект.УведомлятьОВыполнении);
	Элементы.ЗапретРедактированияБезЗРС.Доступность = ЗначениеЗаполнено(Объект.УведомлятьОВыполнении) и ПользНаПосту;
	Элементы.УведомлятьОВыполненииПоле.Доступность = не ЗначениеЗаполнено(Объект.УведомлятьОВыполнении) ИЛИ ПользНаПосту; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПользовательНаПосту(пПост)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_АдресацияЗадачПланаДействий.Пост
	               |ИЗ
	               |	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |ГДЕ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь = &Пользователь
	               |	И ИА_АдресацияЗадачПланаДействий.Пост = &Пост";
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Пост", пПост);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
КонецФункции

&НаКлиенте
Процедура ТипЗадачиПриИзменении(Элемент)
	Объект.Содержание = Объект.ТипЗадачи;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.Задача) И НЕ Объект.Выполнено Тогда
		Если Объект.Срок < НачалоДня(ТекущаяДата()) И ЗначениеЗаполнено(Объект.Срок) Тогда 
			ПоказатьПредупреждение(,"Крайний срок задачи не может быть меньше текущей даты.");
			Возврат;
		КонецЕсли;
		Объект.Задача = ИА_АдминшкалаСервер.СоздатьЗадачуСервер(Объект.Ответственный,Объект.Содержание, Объект.Срок, Объект.Содержание, Объект.Ссылка);
		Записать();
    КонецЕсли; 
    
	ОбновитьДоступностьЭлментов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Автор = ПолучитьТекПользователя();
	КонецЕсли;
	ЗагрузитьДоступныеЭлементы();
	ОбновитьВидимостьЭлементов();
	ОбновитьДоступностьЭлментов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура ВыполненоПриИзменении(Элемент)
	Если Объект.Выполнено Тогда
		Объект.ДатаВыполнения = ТекущаяДата();
		Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Записать();
		КонецЕсли;
		
		Если НадоЗавершитьЗадачу(Объект.Задача) Тогда
			ИА_АдминшкалаСервер.ЗавершитьЗадачу(Объект.Задача);
		КонецЕсли;
	Иначе
		Объект.ДатаВыполнения = Дата(1,1,1);
		Объект.ОтчетОтправлен = ложь;
    КонецЕсли;
		
	ОбновитьДоступностьЭлментов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекПользователь()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаСервереБезКонтекста
Функция НадоЗавершитьЗадачу(пЗадача)
	Возврат (не пЗадача.Пустая()) и не пЗадача.Выполнена;
КонецФункции

&НаКлиенте
Процедура ТипОбъектаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	массивПодч = ИА_АдминшкалаСервер.ПолучитьВозможныхПодчиненныхТипов(Объект.Родитель);
	Элемент.СписокВыбора.ЗагрузитьЗначения(массивПодч);
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьВАрхивНаСервере(программа)
	АрхивПрограммы = Справочники.ИА_СтратегическоеУправление.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(АрхивПрограммы, программа, ,"Код, Ссылка, Владелец");
	АрхивПрограммы.ЭтоАрхив = истина;
	АрхивПрограммы.СсылкаНаКоррЭлемент = программа; 
	АрхивПрограммы.ДатаАрхива = ТекущаяДата();
	АрхивПрограммы.Наименование = "[Архив от "+ТекущаяДата()+"] " + АрхивПрограммы.Наименование;
	АрхивПрограммы.Содержание = "[Архив от "+ТекущаяДата()+"] " + АрхивПрограммы.Содержание;
	АрхивПрограммы.Права.Загрузить(программа.Права.Выгрузить());
	АрхивПрограммы.Записать();
	
	СкопироватьЭлементы(программа, АрхивПрограммы.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкопироватьЭлементы(изПрограммы, вПрограмму)
	Выборка = Справочники.ИА_СтратегическоеУправление.Выбрать(изПрограммы);
	Пока Выборка.Следующий() Цикл
		НовЭлемент = Справочники.ИА_СтратегическоеУправление.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовЭлемент, Выборка, ,"Код, Ссылка, Родитель, Владелец");
		НовЭлемент.ЭтоАрхив = истина;
		НовЭлемент.Родитель = вПрограмму;
		НовЭлемент.Права.Загрузить(Выборка.Права.Выгрузить());
		НовЭлемент.Записать();	
		
		СкопироватьЭлементы(Выборка.Ссылка, НовЭлемент.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВАрхив(Команда)
	СохранитьВАрхивНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура УведомлятьОВыполненииПолеПриИзменении(Элемент)
	Если не ЗначениеЗаполнено(Объект.УведомлятьОВыполнении) ТОгда
		Объект.ЗапретРедактированияБезЗРС = ложь;
	КонецЕсли;
	ОбновитьДоступностьЭлментов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависитОтЗадачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
