// Проверка двух смежных ячеек на идентичночность
Функция ОбъединятьЯчейки(ТабДок, индСтр, индКол)
	
	Ячейка = ТабДок.Область(индСтр, индКол);
	ЯчейкаСлед = ТабДок.Область(индСтр, индКол+1);
	
	НомерНижнейСтрокиОбъедЯчейки = Сред(Ячейка.Имя, СтрНайти(Ячейка.Имя, "R", НаправлениеПоиска.СКонца) + 1, СтрНайти(Ячейка.Имя, "C", НаправлениеПоиска.СКонца) - СтрНайти(Ячейка.Имя, "R", НаправлениеПоиска.СКонца)-1);
	НомерНижнейСтрокиОбъедЯчейкиСлед = Сред(ЯчейкаСлед.Имя, СтрНайти(ЯчейкаСлед.Имя, "R", НаправлениеПоиска.СКонца) + 1, СтрНайти(ЯчейкаСлед.Имя, "C", НаправлениеПоиска.СКонца) - СтрНайти(ЯчейкаСлед.Имя, "R", НаправлениеПоиска.СКонца)-1);
	
	Если ПустаяСтрока(Ячейка.Текст) Тогда
		
		Возврат ложь
		
	ИначеЕсли
		//Проверяем на соответствие заголовка
		Ячейка.Текст = ЯчейкаСлед.Текст
		// Проверяем на соответствие имени (отсеиваем уже объединенные ячейки) 
		
		и НомерНижнейСтрокиОбъедЯчейки = НомерНижнейСтрокиОбъедЯчейкиСлед Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат ложь
		
	КонецЕсли;
	
КонецФункции

// Обработка заголовков таблицы
//
// Параметры
// Табл - < Тип.ТабличныйДокумент> - Табличный документ формы
Процедура ОбработатьЗаголовки(ТабДок)
	
	ОбъединяемаяОбласть = Неопределено;
	
	//Для оптимизации здесь нужно будет ограничить высоту таблицы
	//Для индСтр=1 По ТабДок.ВысотаТаблицы Цикл 
	Для индСтр=1 По 4 Цикл	
		
		НачальнаяКолонка = 0;
		Для индКол=1 По ТабДок.ШиринаТаблицы Цикл
			
			// определяем начало объединения
			Если ОбъединятьЯчейки(ТабДок, индСтр, индКол) Тогда
				
				Если не НачальнаяКолонка Тогда
					
					НачальнаяКолонка = индКол;
					
				КонецЕсли;
				
			ИначеЕсли НачальнаяКолонка Тогда
				// завершаем объединение
				
				ТекстЗаголовка = ТабДок.Область(индСтр, индКол).Текст;
				ОбъединяемаяОбласть = ТабДок.Область(индСтр, НачальнаяКолонка, индСтр, индКол);
				ОбъединяемаяОбласть.Объединить();
				ОбъединяемаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
				ОбъединяемаяОбласть.Текст = ТекстЗаголовка;
				НачальнаяКолонка = 0;
				
			Иначе
				
				НачальнаяКолонка = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Если нашли в строке области для объединения то прекращаем дальнейшие поиски
		Если не ОбъединяемаяОбласть = Неопределено Тогда
			
			возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьКолонкиГруппировокПоСкладам(ТабДок); 
	
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии,1);
	
	//R1C8:R3C8 
	Для инд = 1 по 50 Цикл
	//ТабДок.Область(1,8,50,8).ФорматСтрок = ТабДок.Область(1,1,50,1).ФорматСтрок;
	ТабДок.Область(инд,8,инд,8).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(инд,8,инд,8).ЦветФона = Новый Цвет();
	ТабДок.Область(инд,8,инд,8).Текст = ""; 
	ТабДок.Область(инд,8,инд,8).ШиринаКолонки = 7;
	
	ТабДок.Область(инд,15,инд,15).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(инд,15,инд,15).ЦветФона = Новый Цвет();
	ТабДок.Область(инд,15,инд,15).Текст = "";
	ТабДок.Область(инд,15,инд,15).ШиринаКолонки = 7; 
	
	ТабДок.Область(инд,22,инд,22).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(инд,22,инд,22).ЦветФона = Новый Цвет();
	ТабДок.Область(инд,22,инд,22).Текст = "";
	ТабДок.Область(инд,22,инд,22).ШиринаКолонки = 7;
	//ТабДок.Область(инд,15,инд,15)
	КонецЦикла;
	//ТабДок.Область(1,15,50,15).ФорматСтрок = ТабДок.Область(1,1,50,1).ФорматСтрок;
	
	Для инд = 1 По ТабДок.КоличествоУровнейГруппировокКолонок() Цикл
    	ТабДок.Область(, 1, , ТабДок.ШиринаТаблицы).Разгруппировать();
	КонецЦикла;

КонецПроцедуры	

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; // отключаем стандартный вывод отчета - будем выводить программно 

	Настройки = КомпоновщикНастроек.ПолучитьНастройки() ;// Получаем настройки отчета 
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; // Создаем данные расшифровки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 
	// Инициализируем макет компоновки используя схему компоновки данных 
	// и созданные ранее настройки и данные расшифровки
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();

	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ОбработатьЗаголовки(ДокументРезультат);
	
	ОчиститьКолонкиГруппировокПоСкладам(ДокументРезультат);
	
КонецПроцедуры
