&НаКлиенте
Перем КонтрольРазмераВкл;

&НаКлиенте
Процедура Обновить(Команда)
	
	Если Объект.Настройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаНачала>Объект.ДатаКонца Тогда 
		Сообщить("Неверно указаны даты построения графиков!");
		Возврат;
	КонецЕсли;

	тз_Подчиненные.Очистить();
	ОбновитьПер = ДеревоСтатистик.ПолучитьЭлементы().Количество() = 0;
	ЗагрузитьНастройку(-1,РучнойТипПериода,ложь,ложь,ОбновитьПер, ложь,истина);
	НарисоватьДиаграммы();
	ВидимостьКнопокКонтекстногоМеню();
	
КонецПроцедуры


&НаКлиенте
Процедура НарисоватьДиаграммы(Пересчитывать = истина) Экспорт
	
	Если Объект.ДатаКонца<=Объект.ДатаНачала Тогда
		Возврат;
	КонецЕсли;
	
	       
	Если ВебКлиент Тогда
		СформироватьКартинкуВеб(Пересчитывать);
	ИНАЧЕ	
		// Определение разрешения экрана
		ОпределитьРазрешениеЭкрана();
		
		ДанныеХТМЛ_текст = СформироватьКартинку(Пересчитывать);
		РезСтраницаИмя = ИА_Статистики_Клиент.ПолучитьФайлСтраницы(ДанныеХТМЛ_текст,"stat");		
			
		НадоОбновить = ДанныеХТМЛ<>"";
		
		ДанныеХТМЛ = РезСтраницаИмя;
		Если НадоОбновить Тогда
			
			Попытка
				Элементы.ПолеХТМЛ.Документ.location.reload();
			Исключение
				Попытка
					Элементы.ПолеХТМЛ.Документ.parentWindow.location.reload();
				Исключение
					Элементы.ПолеХТМЛ.Документ.window.location.reload();
				КонецПопытки;
			КонецПопытки;
			
		КонецЕсли;
	КОНЕЦЕСЛИ
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКартинкуВеб(Пересчитывать)
	деревоСТ = РеквизитФормыВЗначение("ДеревоСтатистик");
	ИА_Статистики.СформироватьКартинкуВеб(ЭтаФорма,Объект, деревоСТ, Пересчитывать, ложь , ложь, ложь, ложь, Неопределено, Неопределено);	
	ЗначениеВРеквизитФормы(деревоСТ,"ДеревоСтатистик");
КонецПроцедуры

&НаСервере
Функция СформироватьКартинку(Пересчитывать, ВызовИЦО = Ложь, ВызовМоиСтатистики = Ложь, НаПечать = Ложь, Зарплата = ложь, ДопПараметры = Неопределено, ПериодДетализации = Неопределено) Экспорт
	
	деревоСТ = РеквизитФормыВЗначение("ДеревоСтатистик");
	
	ТекстХТМЛ = ИА_Статистики.СформироватьКартинку(Объект,sw,деревоСТ, Пересчитывать, ВызовИЦО , ВызовМоиСтатистики, НаПечать, Зарплата, ДопПараметры, ПериодДетализации);	
	
	ЗначениеВРеквизитФормы(деревоСТ, "ДеревоСтатистик");
	          	
	Возврат ТекстХТМЛ;
КонецФункции

&НаКлиенте
Процедура ОпределитьРазрешениеЭкрана()	
	Попытка
		к = Элементы.ПолеХТМЛ.Документ.body.clientWidth;
		sw = к;
	Исключение
		sw = 800;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент) Экспорт
	
	ПодключитьОбработчикОжидания("НастройкаПриИзмененииОтложенная",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПриИзмененииОтложенная() Экспорт
	
	тз_Подчиненные.Очистить();
	ЗагрузитьНастройку();
		
	Если не Объект.Настройка.Пустая() И ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаКонца) Тогда
		НарисоватьДиаграммы();
	КонецЕсли;
	
	ВидимостьКнопокКонтекстногоМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкуБезПериодов() Экспорт
	
	тз_Подчиненные.Очистить();
	ЗагрузитьНастройку(,,,,Ложь);
		
	Если не Объект.Настройка.Пустая() И ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаКонца) Тогда
		НарисоватьДиаграммы();
	КонецЕсли;
	ВидимостьКнопокКонтекстногоМеню();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПериоды(ТипПериода)
		
	Если ДатаКонцаПредопределенная = Дата(1,1,1) Тогда
		текДата = ТекущаяДата();
	Иначе
		текДата = ДатаКонцаПредопределенная;
	КонецЕсли;
		
	Если ТипПериода = Перечисления.ИА_ПериодыДетализации.День тогда
		Если ТолькоЗавершПериоды Тогда
			Объект.ДатаКонца = КонецДня(текДата) - 60*60*24;
		Иначе
			Объект.ДатаКонца = КонецДня(текДата);
		КонецЕсли;
		
		Объект.ДатаНачала = Объект.ДатаКонца - 60*60*24 * (Объект.Настройка.КоличествоПериодов-1);
		
	ИначеЕсли ТипПериода = Перечисления.ИА_ПериодыДетализации.Неделя  тогда
		
		НачалоНедели = Константы.ИА_НачалоНедели.Получить();
		
		Если НачалоНедели > 1 Тогда
			
			Объект.ДатаКонца = ИА_Статистики.ИА_КонецНедели(текДата);
			Если ТолькоЗавершПериоды и ДеньНедели(текДата) <> НачалоНедели-1 Тогда
				Объект.ДатаКонца = Объект.ДатаКонца - 60*60*24*7;
			КонецЕсли;		
			
			Объект.ДатаНачала = Объект.ДатаКонца - 60*60*24*7 * (Объект.Настройка.КоличествоПериодов) + 60*60*24;			
		Иначе
			
			Объект.ДатаКонца = КонецНедели(текДата);
			Если ТолькоЗавершПериоды Тогда
				Объект.ДатаКонца = Объект.ДатаКонца - 60*60*24*7;
			КонецЕсли;
			
			Объект.ДатаНачала = НачалоНедели(Объект.ДатаКонца) - 60*60*24*7 * (Объект.Настройка.КоличествоПериодов-1);			
		КонецЕсли;

		
	ИначеЕсли ТипПериода = Перечисления.ИА_ПериодыДетализации.Месяц тогда 
		
		Объект.ДатаКонца = КонецМесяца(текДата);
		
		Если ТолькоЗавершПериоды и КонецДня(текДата) <> КонецДня(Объект.ДатаКонца) Тогда
			Объект.ДатаКонца = КонецМесяца(ДобавитьМесяц(НачалоМесяца(текДата),-1));
		КонецЕсли;
		
		Объект.ДатаНачала = НачалоМесяца(ДобавитьМесяц(Объект.ДатаКонца, -(Объект.Настройка.КоличествоПериодов-1)));
		
	ИначеЕсли ТипПериода = Перечисления.ИА_ПериодыДетализации.Квартал тогда
		
		Объект.ДатаКонца = КонецКвартала(текДата);
		
		Если ТолькоЗавершПериоды и КонецДня(текДата) <> КонецДня(Объект.ДатаКонца) Тогда
			Объект.ДатаКонца = КонецМесяца(ДобавитьМесяц(НачалоМесяца(Объект.ДатаКонца),-3));
		КонецЕсли;
		
		Объект.ДатаНачала = НачалоМесяца(ДобавитьМесяц(Объект.ДатаКонца+1, -(Объект.Настройка.КоличествоПериодов)*3));
		
	ИначеЕсли ТипПериода = Перечисления.ИА_ПериодыДетализации.Год тогда
		
		Объект.ДатаКонца = КонецГода(текДата);
		Если ТолькоЗавершПериоды и КонецДня(текДата) <> КонецДня(Объект.ДатаКонца) Тогда
			Объект.ДатаКонца = КонецГода(ДобавитьМесяц(текДата,-12));
		КонецЕсли;
		
		Объект.ДатаНачала = НачалоГода(ДобавитьМесяц(Объект.ДатаКонца, -(Объект.Настройка.КоличествоПериодов-1)*12));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройку(ФильтрНомерСтатистики = -1, ПериодДетализации = Неопределено, ЭтоМойРабочийСтол = Ложь, ВыводДетализации = Ложь, ОбновитьПериоды1 = Истина, ЭтоИЦО = ложь, ОбновитьКолВСтроке=истина) Экспорт
	// проверка на корректность
	Для каждого стр из Объект.Настройка.Статистики Цикл
		Если сокрлп(стр.ЗаголовокДиаграммы) = "" Тогда
			Сообщить("Должны быть заполнены заголовки диаграмм!");
			Возврат;
		КонецЕсли;
		Если стр.ПериодДетализации.Пустая() Тогда
			Сообщить("Укажите детализацию статистик!");
			Возврат;
		КонецЕсли;
	КонецЦикла;
    
    Для каждого КиЗ из СписокВыбранныхНастроекСтатистик Цикл
        Для каждого стр из КиЗ.Настройка.Статистики Цикл
            Если сокрлп(стр.ЗаголовокДиаграммы) = "" Тогда
                Сообщить("Должны быть заполнены заголовки диаграмм!");
                Возврат;
            КонецЕсли;
            Если стр.ПериодДетализации.Пустая() Тогда
                Сообщить("Укажите детализацию статистик!");
                Возврат;
            КонецЕсли;
        КонецЦикла;
	КонецЦикла;
    
	// установка периодов
	Если Объект.Настройка.КоличествоПериодов <> 0 и не Объект.Настройка.ОсновнойПериод.Пустая() И ОбновитьПериоды1 Тогда
		РучнойТипПериода = Перечисления.ИА_ПериодыДетализации.ПустаяСсылка();
		ОбновитьПериоды(Объект.Настройка.ОсновнойПериод);	
	КонецЕсли;
	
	// загрузка
	ДеревоСтатистик.ПолучитьЭлементы().Очистить();
    
	Если ВыводДетализации Тогда
		ДеревоСт = СформироватьДеревоСтатистикПоАналитикам();
	Иначе
		ДеревоСт = СформироватьДеревоСтатистик(ЭтоМойРабочийСтол, ЭтоИЦО);
	КонецЕсли;
    
	ЭлДерева = ДеревоСтатистик.ПолучитьЭлементы();
	сч = 0;
	Для каждого стр0 из ДеревоСт.Строки Цикл
		Для каждого стр1 из Стр0.Строки Цикл
			Для каждого стр2 из стр1.Строки Цикл
				Если ФильтрНомерСтатистики > -1 И сч <> ФильтрНомерСтатистики Тогда
					сч = сч + 1;
					Продолжить;
				КонецЕсли;
				Новстр2 = ЭлДерева.Добавить();
				ЗаполнитьЗначенияСвойств(Новстр2, стр2);
				Если ПериодДетализации <> Неопределено и не ПериодДетализации.Пустая() Тогда
					Новстр2.ПериодДетализации = ПериодДетализации;
				КонецЕсли;
				Для каждого стр3 из стр2.Строки Цикл
					Новстр3 = Новстр2.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(Новстр3, стр3);
					Если ПериодДетализации <> Неопределено и не ПериодДетализации.Пустая() Тогда
						Новстр3.ПериодДетализации = ПериодДетализации;
					КонецЕсли;
				КонецЦикла;
				сч = сч + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если (не ВыводДетализации) и ОбновитьКолВСтроке Тогда
		Объект.КоличествоВСтроке = Объект.Настройка.КоличествоВСтроке;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьДеревоСтатистик(ЭтоМойРабочийСтол = Ложь, ЭтоИЦО = ложь)
	
    Если СписокВыбранныхНастроекСтатистик.Количество() < 2 Тогда
        Запрос = Новый Запрос;	
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_КвотыСтатистикСрезПоследних.ВидСтатистики,
		               |	ИА_КвотыСтатистикСрезПоследних.ПериодДетализации,
		               |	ИА_КвотыСтатистикСрезПоследних.Аналитика1,
		               |	ИА_КвотыСтатистикСрезПоследних.Аналитика2,
		               |	ИА_КвотыСтатистикСрезПоследних.Аналитика3,
		               |	ИА_КвотыСтатистикСрезПоследних.ТипКвоты,
		               |	ИА_КвотыСтатистикСрезПоследних.Квота
		               |ПОМЕСТИТЬ вт
		               |ИЗ
		               |	РегистрСведений.ИА_КвотыСтатистик.СрезПоследних(&ДатаКонца, ) КАК ИА_КвотыСтатистикСрезПоследних
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЗаголовокДиаграммы КАК ЗаголовокДиаграммы,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика1,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика2,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика3,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ПериодДетализации КАК ПериодДетализации,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЦветГрафикаХран КАК ЦветГрафика,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЦветГрафикаНарастающейКвотыХран КАК ЦветГрафикаНарастающейКвоты,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.НаименованиеДляЛегенды,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ПоказыватьВИЦО КАК ПоказыватьВИЦО,
		               |	ЕСТЬNULL(вт.ТипКвоты, ЗНАЧЕНИЕ(Перечисление.ИА_ТипыКвот.ПустаяСсылка)) КАК ТипКвоты,
		               |	ЕСТЬNULL(вт.Квота, 0) КАК Квота,
		               |	ЕСТЬNULL(вт.ПериодДетализации, ЗНАЧЕНИЕ(Перечисление.ИА_ПериодыДетализации.ПустаяСсылка)) КАК ПериодДетализацииКвоты,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики.ШиринаЛинии КАК ШиринаЛинии,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.УзорТочки,
		               |	ЗНАЧЕНИЕ(Справочник.Оргсхема.ПустаяСсылка) КАК Пост,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.МаштабМинимум,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.МаштабМаксимум,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.СдвигПериода,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСдвигаПериода
		               |ИЗ
		               |	Справочник.ИА_НастройкиРабочегоСтолаСтатистик.Статистики КАК ИА_НастройкиРабочегоСтолаСтатистикСтатистики
		               |		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		               |		ПО ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики = вт.ВидСтатистики
		               |			И ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика1 = вт.Аналитика1
		               |			И ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика2 = вт.Аналитика2
		               |			И ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика3 = вт.Аналитика3
		               |			И ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ИА_ПериодКвоты = вт.ПериодДетализации
		               |			И ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ИА_ТипКвоты = вт.ТипКвоты
		               |ГДЕ
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Ссылка = &Ссылка
		               |	И ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики <> ЗНАЧЕНИЕ(Справочник.ИА_ВидыСтатистик.ПустаяСсылка)
		               |	И 1 = 1
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.НомерСтроки
		               |ИТОГИ
		               |	МАКСИМУМ(ПоказыватьВИЦО),МИНИМУМ(МаштабМинимум),МАКСИМУМ(МаштабМаксимум)
		               |ПО
		               |	Пост,
		               |	ЗаголовокДиаграммы,
		               |	ПериодДетализации
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ вт";

        ЗАпрос.УстановитьПараметр("Ссылка", Объект.Настройка);
	иначе
		ТЗ1 = ИА_БФС.ТЗ_НоваяТаблицаЗначений(Новый Структура("Настройка, Порядок, Пост"
		,Новый ОписаниеТипов("СправочникСсылка.ИА_НастройкиРабочегоСтолаСтатистик")
		,Новый ОписаниеТипов("Число")
		,Новый ОписаниеТипов("СправочникСсылка.ОргСхема")
		));
		                           
		Ц = 0;
		Для каждого КиЗ Из СписокВыбранныхНастроекСтатистик Цикл
		    Ц = Ц + 1;
		    НовСтрока = ТЗ1.Добавить();	
		    НовСтрока.Настройка = КиЗ.Настройка;
			НовСтрока.Пост = КиЗ.Пост;
		    НовСтрока.Порядок = Ц;
		КонецЦикла;
        
        Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТЗ.Настройка КАК Настройка,
		               |	ТЗ.Пост КАК Пост,
		               |	ТЗ.Порядок КАК Порядок
		               |ПОМЕСТИТЬ ТЗ
		               |ИЗ
		               |	&ТЗ КАК ТЗ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЗаголовокДиаграммы КАК ЗаголовокДиаграммы,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика1,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика2,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика3,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ПериодДетализации КАК ПериодДетализации,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЦветГрафикаХран КАК ЦветГрафика,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЦветГрафикаНарастающейКвотыХран КАК ЦветГрафикаНарастающейКвоты,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.НаименованиеДляЛегенды,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ПоказыватьВИЦО КАК ПоказыватьВИЦО,
		               |	ТЗ.Порядок * 1000 + ИА_НастройкиРабочегоСтолаСтатистикСтатистики.НомерСтроки КАК Порядок,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ИА_ПериодКвоты,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ИА_ТипКвоты,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики.ШиринаЛинии КАК ШиринаЛинии,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.УзорТочки,
		               |	ТЗ.Пост,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.МаштабМинимум,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.МаштабМаксимум,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.СдвигПериода,
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСдвигаПериода
		               |ПОМЕСТИТЬ Таб
		               |ИЗ
		               |	Справочник.ИА_НастройкиРабочегоСтолаСтатистик.Статистики КАК ИА_НастройкиРабочегоСтолаСтатистикСтатистики
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ
		               |		ПО ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Ссылка = ТЗ.Настройка
		               |ГДЕ
		               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики <> ЗНАЧЕНИЕ(Справочник.ИА_ВидыСтатистик.ПустаяСсылка)
		               |	И 1 = 1
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИА_КвотыСтатистикСрезПоследних.ВидСтатистики,
		               |	ИА_КвотыСтатистикСрезПоследних.ПериодДетализации,
		               |	ИА_КвотыСтатистикСрезПоследних.Аналитика1,
		               |	ИА_КвотыСтатистикСрезПоследних.Аналитика2,
		               |	ИА_КвотыСтатистикСрезПоследних.Аналитика3,
		               |	ИА_КвотыСтатистикСрезПоследних.ТипКвоты,
		               |	ИА_КвотыСтатистикСрезПоследних.Квота
		               |ПОМЕСТИТЬ вт
		               |ИЗ
		               |	РегистрСведений.ИА_КвотыСтатистик.СрезПоследних(&ДатаКонца, ) КАК ИА_КвотыСтатистикСрезПоследних
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Т.ЗаголовокДиаграммы КАК ЗаголовокДиаграммы,
		               |	Т.ВидСтатистики,
		               |	Т.Аналитика1,
		               |	Т.Аналитика2,
		               |	Т.Аналитика3,
		               |	Т.ПериодДетализации КАК ПериодДетализации,
		               |	Т.ЦветГрафика,
		               |	Т.ЦветГрафикаНарастающейКвоты,
		               |	Т.НаименованиеДляЛегенды,
		               |	Т.ПоказыватьВИЦО КАК ПоказыватьВИЦО,
		               |	ЕСТЬNULL(вт.ТипКвоты, ЗНАЧЕНИЕ(Перечисление.ИА_ТипыКвот.ПустаяСсылка)) КАК ТипКвоты,
		               |	ЕСТЬNULL(вт.Квота, 0) КАК Квота,
		               |	ЕСТЬNULL(вт.ПериодДетализации, ЗНАЧЕНИЕ(Перечисление.ИА_ПериодыДетализации.ПустаяСсылка)) КАК ПериодДетализацииКвоты,
		               |	Т.ШиринаЛинии КАК ШиринаЛинии,
		               |	Т.УзорТочки КАК УзорТочки,
		               |	Т.Пост КАК Пост,
		               |	Т.МаштабМинимум,
		               |	Т.МаштабМаксимум,
		               |	Т.СдвигПериода,
		               |	Т.ВидСдвигаПериода,
					   |    0 как НомерТекущейДаты
		               |ИЗ
		               |	Таб КАК Т
		               |		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		               |		ПО Т.ВидСтатистики = вт.ВидСтатистики
		               |			И Т.Аналитика1 = вт.Аналитика1
		               |			И Т.Аналитика2 = вт.Аналитика2
		               |			И Т.Аналитика3 = вт.Аналитика3
		               |			И Т.ИА_ПериодКвоты = вт.ПериодДетализации
		               |			И Т.ИА_ТипКвоты = вт.ТипКвоты
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Т.Порядок
		               |ИТОГИ
		               |	МАКСИМУМ(ПоказыватьВИЦО),МИНИМУМ(МаштабМинимум),МАКСИМУМ(МаштабМаксимум)
		               |ПО
		               |	Пост,
		               |	ЗаголовокДиаграммы,
		               |	ПериодДетализации
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ вт";
	    Запрос.УстановитьПараметр("ТЗ", ТЗ1);
	КонецЕсли;
	
	Если ЭтоМойРабочийСтол Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1",
			"ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ИА_НеОтображатьНаРабочемСтоле = ЛОЖЬ ");
	КонецЕсли;		
	Если ЭтоИЦО Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1",
			"ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ПоказыватьВИЦО = ИСТИНА ");
	КонецЕсли;			
	
	ЗАпрос.УстановитьПараметр("ДатаКонца", КонецДня(Объект.ДатаКонца) + 1);
    ДеревоСт = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Возврат ДеревоСт;
	
КонецФункции

&НаСервере
Функция Абс(ч)
	Возврат МАКС(ч, -ч);
КонецФункции

&НаКлиенте
Процедура ТаблицаСтатистикВидСтатистикиПриИзменении(Элемент)
	ДанныеСтроки = Элементы.ТаблицаСтатистик.ТекущиеДанные;
	ДанныеСтроки.Аналитика1 = Неопределено;
	ДанныеСтроки.Аналитика2 = Неопределено;
	ДанныеСтроки.Аналитика3 = Неопределено;
	
	структДанных = Новый Структура("ВидСтатистики,Аналитика1,Аналитика2,Аналитика3");
	ЗаполнитьЗначенияСвойств(структДанных,ДанныеСтроки);
	
	СтатистикиВидСтатистикиПриИзменении_Сервер(структДанных);
	
	ЗаполнитьЗначенияСвойств(ДанныеСтроки,структДанных);
КонецПроцедуры

&НаСервере
Процедура СтатистикиВидСтатистикиПриИзменении_Сервер(структДанных)
	Если не структДанных.ВидСтатистики.Пустая() Тогда
 		Если не структДанных.ВидСтатистики.Аналитика1.Пустая() Тогда
			УстановитьТип1(структДанных.ВидСтатистики.Аналитика1.ТипАналитикиПолный,структДанных.Аналитика1);	
		Конецесли;
		
		Если не структДанных.ВидСтатистики.Аналитика2.Пустая() Тогда
			УстановитьТип1(структДанных.ВидСтатистики.Аналитика2.ТипАналитикиПолный,структДанных.Аналитика2);
		Конецесли;
		
		Если не структДанных.ВидСтатистики.Аналитика3.Пустая() Тогда
			УстановитьТип1(структДанных.ВидСтатистики.Аналитика3.ТипАналитикиПолный,структДанных.Аналитика3);
		Конецесли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьТип1(ЗначТип, ЗначСтр)	
	ЗначТип1 = ЗначТип;
	ЗначТип1 = СтрЗаменить(ЗначТип1, "СправочникСсылка", "Справочники");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ДокументСсылка", "Документы");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ПеречислениеСсылка", "Перечисления");
	Если ЗначТип1 = "" Тогда 		
		ЗначСтр = Справочники.ИА_ЗначениеАналитики.ПустаяСсылка();
	ИначеЕсли ЗначТип1 = "Булево" тогда 
		 ЗначСтр = Ложь;
	ИначеЕсли  ЗначТип1 = "Строка" тогда	
		ЗначСтр = "";
	ИначеЕсли ЗначТип1 = "Число" тогда
		ЗначСтр = 0;
	ИначеЕсли ЗначТип1 = "Дата" тогда
		ЗначСтр = Дата("01010001");
	Иначе
		ЗначСтр = Вычислить(ЗначТип1+".ПустаяСсылка()");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатистикАналитика1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.ТаблицаСтатистик.ТекущиеДанные;
	НачалоВыбораАналитики(1, Элемент, тд, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатистикАналитика2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.ТаблицаСтатистик.ТекущиеДанные;
	НачалоВыбораАналитики(2, Элемент, тд, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатистикАналитика3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.ТаблицаСтатистик.ТекущиеДанные;
	НачалоВыбораАналитики(1, Элемент, тд, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАналитики(номерАналитики, Элемент, тд, СтандартнаяОбработка)
	пт = ПолучитьПолныйТип(тд.ВидСтатистики, номерАналитики);
	Если пт = "СправочникСсылка.ИА_ЗначениеАналитики" или пт = "" Тогда
		СтандартнаяОбработка = Ложь;
		
		СтруктураОтбора = Новый Структура("Владелец", ПолучитьЗначениеАналитики(тд.ВидСтатистики,номерАналитики));
		ПараметрыВыбора = Новый Структура("Отбор", СтруктураОтбора);
		
		зн = Неопределено;

		
		ОткрытьФорму("Справочник.ИА_ЗначениеАналитики.Форма.ФормаВыбораУпр", ПараметрыВыбора,,,,, Новый ОписаниеОповещения("НачалоВыбораАналитикиЗавершение", ЭтотОбъект, Новый Структура("номерАналитики, тд", номерАналитики, тд)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАналитикиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	номерАналитики = ДополнительныеПараметры.номерАналитики;
	тд = ДополнительныеПараметры.тд;
	
	
	зн = Результат;
	
	Если ЗначениеЗаполнено(зн) Тогда
		тд["Аналитика"+номерАналитики] = зн;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПолныйТип(ВидСтатистики, номерАналитики)
	Возврат ВидСтатистики["Аналитика"+номерАналитики].ТипАналитикиПолный;
КонецФункции

&НаСервере
Функция ПолучитьЗначениеАналитики(ВидСтатистики, номерАналитики)
	Возврат ВидСтатистики["Аналитика"+номерАналитики];
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	Если ПолучитьПечатьВЭксель() Тогда
		ВывестиВExcel();
	Иначе		
		//
		ДанныеХТМЛ_текст = СформироватьКартинку(Ложь, , , Истина);
		
		РезСтраницаИмя = ИА_Статистики_Клиент.ПолучитьФайлСтраницы(ДанныеХТМЛ_текст,"print");		
		//
		ф = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма.ФормаПечати");
		ф.ДанныеХТМЛ = РезСтраницаИмя;
		ф.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТипГрафикаЭксель()
	ТипГрафика = Константы.ИА_ТипДиаграммыВЭксель.Получить();
	Если ТипГрафика = Перечисления.ИА_ТипыДиаграммыВЭксель.Графики Тогда
		ТипДиаграммыЭксель = 4;
	Иначе
		ТипДиаграммыЭксель = 1;
	КонецЕсли;
	Возврат ТипДиаграммыЭксель;
КонецФункции

&НаСервере
Функция ПолучитьТипГрафикаЭксельСравнить()
	
	ТипГрафика = Константы.ИА_ТипДиаграммыВЭксель.Получить();
	
	Если ТипГрафика = Перечисления.ИА_ТипыДиаграммыВЭксель.Графики Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦвет(ЦветРГБСтрока)
	ЦветГрафика = Вычислить("Новый Цвет("+ЦветРГБСтрока+")");
	Возврат RGB(ЦветГрафика.Красный,ЦветГрафика.Зеленый, ЦветГрафика.Синий);
КонецФункции

&НаСервере
Функция ПолучитьДеревоСтатистик()
	
	ПрНедели = Константы.ИА_ПредставлениеНедели.Получить();
	
	Цвет_Серый = RGB(190,190,190);
	Цвет_Зеленый = RGB(50,205,50);
	Цвет_Красный = RGB(255,48,48);
	Цвет_Черный = RGB(0,0,0);
	Цвет_Желтый = RGB(255,255,0);
	Цвет_Синий = RGB(50,50,255);

	
	ТипГрафика = Константы.ИА_ТипДиаграммыВЭксель.Получить();
	деревоСТ = РеквизитФормыВЗначение("ДеревоСтатистик");
	
	ДреревоСТДляКлиента = Новый Массив;

	счСтатистик = 0;
	
	Пока счСтатистик < деревоСТ.Строки.Количество() Цикл
		
		счСтрока = ИА_Защита_Статистика.ФЧ(счСтатистик);
	
		СтрокаСтатистик = деревоСТ.Строки[счСтатистик];
		СтатистикиДляПостроения = СтрокаСтатистик.Строки;
				
		Кол = СтатистикиДляПостроения[0].Данные.Количество();		 
		
		Если СтатистикиДляПостроения[0].Данные.Количество() > 0 Тогда
			МинЗн = СтатистикиДляПостроения[0].Данные[0].Значение;
			МаксЗн = СтатистикиДляПостроения[0].Данные[0].Значение;
		Иначе
			МинЗн = 0;
			МаксЗн = 0;
		КонецЕсли;
		
		Для каждого стрСтат из СтатистикиДляПостроения Цикл
			Для каждого стр из стрСтат.данные Цикл
				Если не стр.РеальныеДанные Тогда
					прервать;
				КонецЕсли;
		
				МинЗн = Мин(МинЗн, стр.Значение);
				МаксЗн = Макс(МаксЗн, стр.Значение);
			КонецЦикла;
			Если стрСтат.Квота <> 0 И стрСтат.ТипКвоты = Перечисления.ИА_ТипыКвот.Обычная Тогда 
				МаксЗн = Макс(стрСтат.Квота, МаксЗн);
			ИначеЕсли стрСтат.Квота <> 0 И стрСтат.ТипКвоты = Перечисления.ИА_ТипыКвот.Нарастающая Тогда
				МаксЗн = Макс(стрСтат.Квота, МаксЗн);
				МаксЗн = Макс(стрСтат.Данные.Итог("Значение"), МаксЗн);
			КонецЕсли;
		КонецЦикла;
		
		Если СтатистикиДляПостроения[0].ВидСтатистики.ПеревернутаяСтатистика Тогда
			//врМин = МинЗн;
			//МинЗн = -МаксЗн;
			//МаксЗн = -врМин;
		КонецЕсли;
		
		Если МаксЗн - МинЗн = 0 Тогда
			
			МаксЗн = МаксЗн * 1.1;
			Если МаксЗн = 0 Тогда
				МаксЗн = 10;
			КонецЕсли;
			МинЗн = 0;
		КонецЕсли;
		
		Если МинЗн > 0 и МаксЗн = 0 Тогда
			МаксЗн = МинЗн * 2;
		КонецЕсли;
		
		Если НЕ СтатистикиДляПостроения[0].ВидСтатистики.ПеревернутаяСтатистика И МинЗн > МаксЗн Тогда
			МаксЗн = МинЗн + МинЗн - МаксЗн;
		КонецЕсли;
		
		Если МаксЗн > 100 Тогда
			МаксЗн = Окр(МаксЗн,0);
		Иначе
			МаксЗн = Окр(МаксЗн,1);
		КонецЕсли;
		Если МаксЗн > 100 Тогда
			МинЗн = Окр(МинЗн,0);
		Иначе
			МинЗн = Окр(МинЗн,1);
		КонецЕсли;
		
		МассивГрафиков = Новый Массив;
		ЕщеСтатистика = 1;
		
		Для каждого стрСтатистик из СтатистикиДляПостроения Цикл
			Квота = 0;
			Если стрСтатистик.ТипКвоты = Перечисления.ИА_ТипыКвот.Нарастающая Тогда
				КолКвот = 2;
				Квота = стрСтатистик.Квота / (Кол -1);
			ИначеЕсли стрСтатистик.ТипКвоты = Перечисления.ИА_ТипыКвот.Обычная Тогда
				КолКвот = 1;
				Квота = стрСтатистик.Квота;
			Иначе
				КолКвот = 0;
			КонецЕсли;
			
			Для НомерКвоты = 0 по КолКвот Цикл
				сч = 0; 
				ПредЗначение = 0;
				ИтогЗнУ = 0;
				ИтогКвота = 0;
				СтруктураСтатистикиДляПостроенияДляКлиента = Новый Структура("ЗаголовокДиаграммы, Период, ЗагаловокЛегенды, МассивЦветов, МассивЗначений, МассивЦветов, МассивЗначений, ПеревернутаяСтатистика, ЦветГрафикаПустая");
				
				ТекстПодписи = "Период";
				Если СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День тогда
					ТекстПодписи = "День (Период)";
				ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Неделя тогда
					ТекстПодписи = "Неделя (Период)";
				ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Месяц тогда
					ТекстПодписи = "Месяц (Период)";
				ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Квартал тогда
					ТекстПодписи = "Квартал (Период)";
				ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Год тогда
					ТекстПодписи = "Год (Период)";
				КонецЕсли;
				Если СтатистикиДляПостроения.Количество() + КолКвот > 1 Тогда
					СтруктураСтатистикиДляПостроенияДляКлиента.Вставить("ЗаголовокДиаграммы",стрСтатистик.ЗаголовокДиаграммы);
				Иначе                                                      		
					СтруктураСтатистикиДляПостроенияДляКлиента.Вставить("ЗаголовокДиаграммы",стрСтатистик.ЗаголовокДиаграммы + "  " + ?(стрСтатистик.ВидСтатистики.ПеревернутаяСтатистика,-1,1)* СтатистикиДляПостроения[ЕщеСтатистика - 1].Данные.Итог("Значение"));
				КонецЕсли;	
				СтруктураСтатистикиДляПостроенияДляКлиента.Вставить("Период", ТекстПодписи);
				СтруктураСтатистикиДляПостроенияДляКлиента.Вставить("ЗагаловокЛегенды",?(ЗначениеЗаполнено(стрСтатистик.НаименованиеДляЛегенды), стрСтатистик.НаименованиеДляЛегенды,"Значение статистики"));
			
			
				МассивЦветов = Новый Массив;
				МассивЗначений = Новый Массив;
				
				Пока сч < Кол Цикл
					//Если не стрСтатистик.данные[сч].РеальныеДанные Тогда
					//	Прервать;
					//КонецЕсли; 
					Если КолКвот = 2 Тогда
						
					КонецЕсли;
					
					СтрутураЗначений = Новый Структура("Дата", "ЗНУ");
					//знУ = ?(стрСтатистик.ВидСтатистики.ПеревернутаяСтатистика,-1,1)*СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].Значение;
					знУ = СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].Значение;
					//Если ЕщеСтатистика = 1 Тогда
						ТекстПодписи = "";
						Если СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День тогда
							ТекстПодписи = Формат(СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].ДатаНачала,"ДФ=dd.MM");
						ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Неделя тогда
							Если ПрНедели = Перечисления.ИА_ПредставлениеНедели.Начало Тогда								
								ТекстПодписи = Формат(СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].ДатаНачала,"ДФ=dd.MM");
							ИначеЕсли ПрНедели = Перечисления.ИА_ПредставлениеНедели.Конец Тогда								
								ТекстПодписи = Формат(СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].ДатаКонца,"ДФ=dd.MM");
							Иначе
								ТекстПодписи = Формат(СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].ДатаНачала,"ДФ=dd.MM")+"-" + Формат(СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].ДатаКонца,"ДФ=dd.MM");
							КонецЕсли;
							
						ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Месяц тогда
							ТекстПодписи = Формат(СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].ДатаНачала,"ДФ=MM.yyyy");
						ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Квартал тогда
							ТекстПодписи = Формат(СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].ДатаНачала,"ДФ=MM.yyyy")+"-" + Формат(СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].ДатаКонца,"ДФ=MM.yyyy");
						ИначеЕсли СтрокаСтатистик.ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Год тогда
							ТекстПодписи = Формат(СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].ДатаНачала,"ДФ=yyyy");
						КонецЕсли;
					
						ЗначениеСтатистики = СтатистикиДляПостроения[ЕщеСтатистика - 1 - НомерКвоты].Данные[сч].Значение;
						ЗначениеСтатистики = окр(ЗначениеСтатистики,1);
						ЗначениеПодписи = Формат(ЗначениеСтатистики,"ЧН=; ЧГ=");
						СтрутураЗначений.Вставить("Дата",ТекстПодписи);
					//КонецЕсли;
					
					ИтогЗнУ = ИтогЗнУ + знУ;
					
					Если НомерКвоты = 2 Тогда
						СтрутураЗначений.Вставить("ЗНУ",ИтогЗнУ);
					ИначеЕсли НомерКвоты = 1 И КолКвот = 1 Тогда
						СтрутураЗначений.Вставить("ЗНУ",Квота);
					ИначеЕсли НомерКвоты = 1 Тогда						
						СтрутураЗначений.Вставить("ЗНУ",ИтогКвота);
					Иначе
						СтрутураЗначений.Вставить("ЗНУ",знУ);
					КонецЕсли;
					ИтогКвота = ИтогКвота + Квота;
					
					МассивЗначений.Добавить(СтрутураЗначений);
										 
					Если ТипГрафика = Перечисления.ИА_ТипыДиаграммыВЭксель.Графики Тогда
						Если сч > 0 Тогда
							Если НомерКвоты = 2 Тогда
								МассивЦветов.Добавить(Цвет_Зеленый);
							ИначеЕсли НомерКвоты = 1 И КолКвот = 2 Тогда 
								
								Если стрСтатистик.ЦветГрафикаНарастающейКвоты="" Тогда
									МассивЦветов.Добавить(Цвет_Синий);
								Иначе
									МассивЦветов.Добавить(ПолучитьЦвет(стрСтатистик.ЦветГрафикаНарастающейКвоты));
								КонецЕсли;
							ИначеЕсли НомерКвоты = 1 Тогда
								МассивЦветов.Добавить(Цвет_Зеленый);
							Иначе								
								Если стрСтатистик.ЦветГрафика="" Тогда
									Если ?(стрСтатистик.ВидСтатистики.ПеревернутаяСтатистика,знУ < ПредЗначение,знУ > ПредЗначение) Тогда
										МассивЦветов.Добавить(Цвет_Синий);
									Иначе
										МассивЦветов.Добавить(Цвет_Красный);
									КонецЕсли;
								Иначе
									МассивЦветов.Добавить(ПолучитьЦвет(стрСтатистик.ЦветГрафика));
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;  
					ПредЗначение = знУ;
					сч = сч + 1;
				КонецЦикла;
				
				Если ТипГрафика = Перечисления.ИА_ТипыДиаграммыВЭксель.СОбластями Тогда
					Если НомерКвоты = 2 Тогда
						МассивЦветов.Добавить(Цвет_Зеленый);
					ИначеЕсли НомерКвоты = 1 И КолКвот = 2 Тогда 
						
						Если стрСтатистик.ЦветГрафикаНарастающейКвоты="" Тогда
							МассивЦветов.Добавить(Цвет_Синий);
						Иначе
							МассивЦветов.Добавить(ПолучитьЦвет(стрСтатистик.ЦветГрафикаНарастающейКвоты));
						КонецЕсли;
					ИначеЕсли НомерКвоты = 1 Тогда
						МассивЦветов.Добавить(Цвет_Зеленый);
					Иначе
						Если стрСтатистик.ЦветГрафика="" Тогда
							МассивЦветов.Добавить(Цвет_Синий);
						Иначе
							МассивЦветов.Добавить(ПолучитьЦвет(стрСтатистик.ЦветГрафика));	
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				СтруктураСтатистикиДляПостроенияДляКлиента.Вставить("МассивЦветов",МассивЦветов);
				СтруктураСтатистикиДляПостроенияДляКлиента.Вставить("МассивЗначений",МассивЗначений);   
				СтруктураСтатистикиДляПостроенияДляКлиента.Вставить("ПеревернутаяСтатистика",стрСтатистик.ВидСтатистики.ПеревернутаяСтатистика);
				СтруктураСтатистикиДляПостроенияДляКлиента.Вставить("ЦветГрафикаПустая",стрСтатистик.ЦветГрафика = "");
				МассивГрафиков.Добавить(СтруктураСтатистикиДляПостроенияДляКлиента);
				ЕщеСтатистика = ЕщеСтатистика + 1;
			КонецЦикла;
		КонецЦикла;
		СтруктураДреревоСТДляКлиента = Новый Структура("Кол, МаксЗн, МинЗн, МассивГрафиков");
		СтруктураДреревоСТДляКлиента.Вставить("Кол",Кол);
		СтруктураДреревоСТДляКлиента.Вставить("МаксЗн",МаксЗн);
		СтруктураДреревоСТДляКлиента.Вставить("МинЗн",МинЗн);
		СтруктураДреревоСТДляКлиента.Вставить("МассивГрафиков", МассивГрафиков);
		СтруктураДреревоСТДляКлиента.Вставить("МаштабМинимум", СтрокаСтатистик.МаштабМинимум);
		СтруктураДреревоСТДляКлиента.Вставить("МаштабМаксимум", СтрокаСтатистик.МаштабМаксимум);

		ДреревоСТДляКлиента.Добавить(СтруктураДреревоСТДляКлиента);
		счСтатистик = счСтатистик + 1;
	КонецЦикла;
	
	Возврат ДреревоСТДляКлиента;

КонецФункции

&НаСервере
Функция  ПолучитьПечатьВЭксель()
	Возврат Константы.ИА_ПечатьСтатистикВЭксель.Получить();
КонецФункции

&НаСервере
Функция ПолучитьВерсиюЭксель(Version) 
	Попытка
		Если Число(Лев(Version, 2)) < 15 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Исключение
		Возврат Истина;
	КонецПопытки;	
КонецФункции

&НаКлиенте
Процедура ВывестиВExcel()
	Если Объект.ДатаНачала > Объект.ДатаКонца Тогда          
		Возврат;
	КонецЕсли;

	ТипДиаграммыЭксель = ПолучитьТипГрафикаЭксель();
				
	счСтатистик = 0;

	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = Истина;
		Эксель.ScreenUpdating = 0;
		Эксель.EnableEvents = 1;
		Эксель.Visible = 0;		
		
		WorkBook=Эксель.Workbooks.Add();
		
	Исключение
		Сообщить(ОписаниеОшибки()); 
		Возврат;
	КонецПопытки;

	ВерсияЭксель = ПолучитьВерсиюЭксель(Эксель.Version);
	Эксель.ActiveSheet.Name="Данные";
	WorkBook.ActiveSheet.Range("A1:A10000").NumberFormat = "@";
	Left=1;
	Top=1;
	Height=489;
	Width=665;	

	ПоложениеЯчейки = 0;

	деревоСТ = ПолучитьДеревоСтатистик();
	Пока счСтатистик < деревоСТ.Количество() Цикл
								
		Кол = деревоСТ[счСтатистик].Кол;
		Если Кол <= 1 Тогда
			счСтатистик = счСтатистик + 1;
			Продолжить;
		КонецЕсли;
		
		Если ИспользоватьРучнойМаштабГрафиков и (деревоСТ[счСтатистик].МаштабМинимум<>0 ИЛИ деревоСТ[счСтатистик].МаштабМаксимум<>0) Тогда
			МинЗн = деревоСТ[счСтатистик].МаштабМинимум;
			МаксЗн = деревоСТ[счСтатистик].МаштабМаксимум;			
		Иначе
			МаксЗн = деревоСТ[счСтатистик].МаксЗн;
			МинЗн = деревоСТ[счСтатистик].МинЗн;
		КонецЕсли;

		ЕщеСтатистика = 1;
		
		Для каждого стрСтатистик из деревоСТ[счСтатистик].МассивГрафиков Цикл
			WorkBook.WorkSheets.Item("Данные").Select();
			сч = 0; 
			ПредЗначение = 0;
			ИтогЗнУ = 0;
			
			Если ЕщеСтатистика = 1 Тогда
				//WorkBook.WorkSheets.Item("Данные").Cells(1 + ПоложениеЯчейки,1).Value = стрСтатистик.ЗаголовокДиаграммы;
				//		
				//ПоложениеЯчейки = ПоложениеЯчейки + 1; 

				WorkBook.WorkSheets.Item("Данные").Cells(1 + ПоложениеЯчейки,1).Value = стрСтатистик.Период;
				
				WorkBook.WorkSheets.Item("Данные").Cells(1 + ПоложениеЯчейки,1 + ЕщеСтатистика).Value = стрСтатистик.ЗагаловокЛегенды;
				ПоложениеЯчейки = ПоложениеЯчейки + 1;
			Иначе
				ПоложениеЯчейки = ПоложениеЯчейки - Кол;
				WorkBook.WorkSheets.Item("Данные").Cells(0 + ПоложениеЯчейки,1 + ЕщеСтатистика).Value = стрСтатистик.ЗагаловокЛегенды;	
			КонецЕсли;
			
							
			Пока сч < Кол Цикл

				Если ЕщеСтатистика = 1 Тогда					
					WorkBook.WorkSheets.Item("Данные").Cells(1 + ПоложениеЯчейки,1).Value = стрСтатистик.МассивЗначений[сч].Дата;
					
				КонецЕсли;
				
				WorkBook.WorkSheets.Item("Данные").Cells(1 + ПоложениеЯчейки,1 + ЕщеСтатистика).Value = стрСтатистик.МассивЗначений[сч].знУ;						
				
				ПоложениеЯчейки = ПоложениеЯчейки + 1;
				
				ИтогЗнУ = ИтогЗнУ + стрСтатистик.МассивЗначений[сч].знУ; 
				ПредЗначение = стрСтатистик.МассивЗначений[сч].знУ;
				сч = сч + 1;
			КонецЦикла;
			
			Если ВерсияЭксель Тогда
				WorkBook.WorkSheets.Item(2).Select();
				Эксель.ActiveSheet.Name= "Графики";
			Иначе
				Попытка
			    	WorkBook.WorkSheets.Item("Графики").Select();
				Исключение
					 Эксель.Sheets.Add(Эксель.ActiveSheet);
	           		 WorkBook.WorkSheets.Item("Лист2").Select();
					 Эксель.ActiveSheet.Name= "Графики";
				КонецПопытки;
			КонецЕсли;			
			
			ПоложениеЯчейки1Формат = Строка(Формат(ПоложениеЯчейки+1 - Кол,"ЧГ=0"));
			ПоложениеЯчейки2Формат = Формат(ПоложениеЯчейки,"ЧГ=0");
			
			Если ЕщеСтатистика = 1 Тогда
				ОбластьГрафика = ?(ВерсияЭксель,"A", "B") + ПоложениеЯчейки1Формат + ":" + "B" + ПоложениеЯчейки2Формат;  
				XValues = "=Данные!$A$" + Строка(Формат(ПоложениеЯчейки+1 - Кол + ?(ВерсияЭксель,0,0),"ЧГ=0")) + ":$A$" + ПоложениеЯчейки2Формат + "";
				ГрафикСМаркерами = НарисоватьДиаграммуПрямоВExcel(Эксель,WorkBook,Left,Top,Height,Width,0,65,ОбластьГрафика,стрСтатистик.ЗаголовокДиаграммы,
				МаксЗн,МинЗн, стрСтатистик.МассивЦветов, стрСтатистик.ПеревернутаяСтатистика, ?(деревоСТ[счСтатистик].МассивГрафиков.Количество() > 1,Ложь,Истина), ТипДиаграммыЭксель, ВерсияЭксель, XValues, стрСтатистик.ЦветГрафикаПустая);
				Top = Top + Height + 7;
				
				ГрафикСМаркерами.SeriesCollection(1).ApplyDataLabels(2);
			Иначе
				Если ЕщеСтатистика = 2 Тогда
					ОбластьГрафика = ?(ВерсияЭксель,"A", "B") + ПоложениеЯчейки1Формат + ":" + "C" + ПоложениеЯчейки2Формат;
					//ОбластьГрафика = "A" + Строка(ПоложениеЯчейки - Кол) + ":" + "C" + ПоложениеЯчейки;
				ИначеЕсли ЕщеСтатистика = 3 Тогда
					ОбластьГрафика = ?(ВерсияЭксель,"A", "B") + ПоложениеЯчейки1Формат + ":" + "D" + ПоложениеЯчейки2Формат;
				ИначеЕсли ЕщеСтатистика = 4 Тогда
					ОбластьГрафика = ?(ВерсияЭксель,"A", "B") + ПоложениеЯчейки1Формат + ":" + "E" + ПоложениеЯчейки2Формат;
				ИначеЕсли ЕщеСтатистика = 5 Тогда
					ОбластьГрафика = ?(ВерсияЭксель,"A", "B") + ПоложениеЯчейки1Формат + ":" + "F" + ПоложениеЯчейки2Формат;
				Иначе
					ОбластьГрафика = ?(ВерсияЭксель,"A", "B") + ПоложениеЯчейки1Формат + ":" + "G" + ПоложениеЯчейки2Формат;
				КонецЕсли;
				ActiveChart=Эксель.ActiveChart;	
				
				Range=WorkBook.WorkSheets.Item("Данные").Range(ОбластьГрафика);   
				ActiveChart.SetSourceData(Range);
				
				Если Не ВерсияЭксель Тогда
			   		ActiveChart.FullSeriesCollection(1).XValues = XValues;
				КонецЕсли;
				
				Если ПолучитьТипГрафикаЭксельСравнить() Тогда
				    Если  стрСтатистик.ЦветГрафикаПустая Тогда
						Для ы=2 По ActiveChart.SeriesCollection(ЕщеСтатистика).Points().Count() Цикл
							ActiveChart.SeriesCollection(ЕщеСтатистика).Points(ы).Select();
							Эксель.Selection.Format.Line.Visible=1;
							Если  ТипЗнч(стрСтатистик.МассивЦветов)=Тип("Массив") Тогда
								//Эксель.Selection.Format.Line.ForeColor.RGB = стрСтатистик.МассивЦветов[ы-2];
								Попытка
									Эксель.Selection.Format.Line.ForeColor.RGB = стрСтатистик.МассивЦветов[ы-2];
								Исключение
									Эксель.Selection.Format.Line.ForeColor.RGB = стрСтатистик.МассивЦветов[ы-3];
								КонецПопытки;
							КонецЕсли;
						КонецЦикла;
						
						Для ы=1 По ActiveChart.SeriesCollection(ЕщеСтатистика).Points().Count() Цикл
							ActiveChart.SeriesCollection(ЕщеСтатистика).Points(ы).Select();
							Эксель.Selection.Format.Fill.Visible=1;
							Если  ТипЗнч(стрСтатистик.МассивЦветов)=Тип("Массив") Тогда
								Эксель.Selection.Format.Fill.ForeColor.RGB = RGB(0,0,0);	
							КонецЕсли;
						КонецЦикла;
					Иначе
						ActiveChart.SeriesCollection(ЕщеСтатистика).Select();
						Если  ТипЗнч(стрСтатистик.МассивЦветов)=Тип("Массив") Тогда
							Эксель.Selection.Format.Line.ForeColor.RGB = стрСтатистик.МассивЦветов[0];
						КонецЕсли;
					КонецЕсли;
				Иначе
					ActiveChart.SeriesCollection(ЕщеСтатистика).Select();
					Эксель.Selection.Format.Fill.Visible = 1;
					Эксель.Selection.Format.Fill.ForeColor.RGB = стрСтатистик.МассивЦветов[0];
					Эксель.Selection.Format.Fill.Transparency = 0.5;
					Эксель.Selection.Format.Fill.Solid();
				КонецЕсли;
				
				ActiveChart.SeriesCollection(ЕщеСтатистика).ApplyDataLabels(2);
			КонецЕсли;
			ЕщеСтатистика = ЕщеСтатистика + 1;
		КонецЦикла;	
		счСтатистик = счСтатистик + 1;
	КонецЦикла;
	WorkBook.WorkSheets.Item("Данные").Select();
	WorkBook.ActiveSheet.Columns("A:A").ColumnWidth = 20;
	WorkBook.ActiveSheet.Columns("B:B").ColumnWidth = 20;
	WorkBook.ActiveSheet.Columns("C:C").ColumnWidth = 20;
	WorkBook.ActiveSheet.Columns("D:D").ColumnWidth = 20;
	WorkBook.ActiveSheet.Columns("E:E").ColumnWidth = 20;
	WorkBook.ActiveSheet.Columns("F:F").ColumnWidth = 20;
	WorkBook.ActiveSheet.Columns("G:G").ColumnWidth = 20;

	//WorkBook.WorkSheets.Item("Данные").Range("A"+ 1 + ПоложениеЯчейки).NumberFormat = "@";

	WorkBook.WorkSheets.Item("Графики").Select();
	ActiveChart = Эксель.ActiveSheet;
	
	//Эксель.ActiveChart.SeriesCollection(1).ApplyDataLabels(2);
	
	ActiveChart.PageSetup.Orientation = 2;
	Эксель.ActiveWindow.View = 3;

	Эксель.Visible = 1;
	Эксель.ScreenUpdating = 1;
		
КонецПроцедуры

&НаКлиенте
Функция НарисоватьДиаграммуПрямоВExcel(Excel,WorkBook,Left,Top,Height,Width, xlLegendPosition=-4152,SourceSheetIndex=Неопределено,SourceData=Неопределено,Title="",МаксЗн,МинЗн, МассивЦветов, ПеревернутаяСтатистика, Легенда, ChartType, ВерсияЭксель, XValues, ЦветГрафикаПустая) Экспорт
	
	// некоторые константы Excel . Остальные есть в текстовом макете отчета.
	msoFalse=0;
	msoTrue=1;
	xlColumns=2;
	xlRows=1;
	xlCategory = 1;
	xlSeriesAxis = 3;
	xlValue = 2 ;

	WorkBook.ActiveSheet.Shapes.AddChart(ChartType,Left,Top,Width,Height).Select();

	Excel.ActiveChart.ChartArea.Format.Fill.Visible = msoFalse;  // делаем диаграмму прозрачной
	Excel.ActiveChart.ChartArea.Format.Line.Visible = msoFalse;

	ActiveChart=Excel.ActiveChart;
	Если ПолучитьТипГрафикаЭксельСравнить() Тогда
		ActiveChart.ApplyLayout (3);
	Иначе
		ActiveChart.ApplyLayout (1);
	КонецЕсли;	

	ActiveChart.Axes(xlCategory).AxisBetweenCategories = False;	

	Если ЗначениеЗаполнено(Title) Тогда
		ActiveChart.HasTitle = True; 
		ActiveChart.ChartTitle.Text = Title;
		ActiveChart.ChartTitle.Format.TextFrame2.TextRange.Font.Name  = "Arial Narrow"; // поменяйте на свой шрифт
	    ActiveChart.ChartTitle.Format.TextFrame2.TextRange.Font.Size  = 16;

	КонецЕсли;


	Если ЗначениеЗаполнено(SourceData) И ТипЗнч(SourceData)=Тип("Строка") Тогда
		
		Range=WorkBook.WorkSheets.Item("Данные").Range(SourceData);   // выделяем область данных
		ActiveChart.SetSourceData(Range);	
		
	    Если Не ВерсияЭксель Тогда
	   		ActiveChart.FullSeriesCollection(1).XValues = XValues;
		КонецЕсли;
		
		ActiveChart.ChartArea.Select();
	    ActiveChart.Axes(xlValue).Select();

	    ActiveChart.Axes(xlValue).MaximumScale = МаксЗн;
	    ActiveChart.Axes(xlValue).MinimumScale = МинЗн;
	    ActiveChart.Axes(xlValue).MajorUnit = (МаксЗн - МинЗн)/10;
	    ActiveChart.Axes(xlValue).MinorUnit = (МаксЗн - МинЗн)/10;
		//ActiveChart.PlotArea.Select();
		//Excel.Selection.Format.Fill.Visible = msoFalse;		// делаем область построения прозрачной 
				
	КонецЕсли;

	Если ПеревернутаяСтатистика Тогда
		ActiveChart.ChartArea.Select();
	    ActiveChart.Axes(xlValue).Select();
	    ActiveChart.Axes(xlValue).ReversePlotOrder = True;
	КонецЕсли;

	 	
	Если ПолучитьТипГрафикаЭксельСравнить() Тогда	
		Если  ЦветГрафикаПустая Тогда
			Для ы=2 По ActiveChart.SeriesCollection(1).Points().Count() Цикл
				ActiveChart.SeriesCollection(1).Points(ы).Select();
				Excel.Selection.Format.Line.Visible=msoTrue;
				//Excel.Selection.Format.Fill.Solid();
				Если  ТипЗнч(МассивЦветов)=Тип("Массив") Тогда
					Попытка
						Excel.Selection.Format.Line.ForeColor.RGB = МассивЦветов[ы-2];
					Исключение
						Excel.Selection.Format.Line.ForeColor.RGB = МассивЦветов[ы-3];
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
			
			Для ы=1 По ActiveChart.SeriesCollection(1).Points().Count() Цикл
				ActiveChart.SeriesCollection(1).Points(ы).Select();
				Excel.Selection.Format.Fill.Visible=msoTrue;
				//Excel.Selection.Format.Fill.Solid();
				Если  ТипЗнч(МассивЦветов)=Тип("Массив") Тогда
					Excel.Selection.Format.Fill.ForeColor.RGB = RGB(0,0,0);	
				КонецЕсли;
			КонецЦикла;
		Иначе	
			ActiveChart.SeriesCollection(1).Select();
			Если  ТипЗнч(МассивЦветов)=Тип("Массив") Тогда
				Excel.Selection.Format.Line.ForeColor.RGB = МассивЦветов[0];
			КонецЕсли;
		КонецЕсли;	
		Если Легенда Тогда
			ActiveChart.Legend.Select();
		    Excel.Selection.Delete();
		КонецЕсли;
	Иначе
		ActiveChart.Legend.Select();
		Excel.Selection.Position = - 4107;
		ActiveChart.Axes(2).AxisTitle.Select();
	   	Excel.Selection.Delete();
		ActiveChart.SeriesCollection(1).Select();
		Excel.Selection.Format.Fill.Visible = msoTrue;
	    Excel.Selection.Format.Fill.ForeColor.RGB = МассивЦветов[0];
		Excel.Selection.Format.Fill.Transparency = 0.5;
		Excel.Selection.Format.Fill.Solid();
	КонецЕсли; 

	Return ActiveChart;
КонецФункции

&НаСервереБезКонтекста
Функция RGB(Red,Green,Blue) Экспорт
	Возврат Red+Green*256+Blue*256*256;
КонецФункции


&НаКлиенте
Процедура ВывестиРасшифровку(НомерСтат) Экспорт
	
	нСт = число(номерСтат)-1; 
	СтрокиСтат = ДеревоСтатистик.ПолучитьЭлементы()[нСт].ПолучитьЭлементы();
	
	//ИА 20151026 Выведем поля по группировкам для каждого вида статистики
	СписокВидовСтатистики = Новый СписокЗначений;
	Для Каждого Стр Из СтрокиСтат Цикл
		Если СписокВидовСтатистики.НайтиПоЗначению(Стр.ВидСтатистики) = Неопределено Тогда 
			СписокВидовСтатистики.Добавить(Стр.ВидСтатистики);
		КонецЕсли;
	КонецЦикла;
	
	формаРасшифровки = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма.ФормаРасшифровки",,ЭтаФорма);
	формаРасшифровки.НомерСтатистики = нСт;
	формаРасшифровки.СписокВидовСтатистики = СписокВидовСтатистики;
	формаРасшифровки.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиПользователя(МассивВидовСтатистики)
	
	СоответствиеНастроек = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_НастройкиПользователей.Настройка,
	|	ИА_НастройкиПользователей.ВидСтатистики
	|ИЗ
	|	РегистрСведений.ИА_НастройкиРасшифровкиСтатистик КАК ИА_НастройкиПользователей
	|ГДЕ
	|	ИА_НастройкиПользователей.Пользователь = &Пользователь
	|	И ИА_НастройкиПользователей.ВидСтатистики В(&МассивВидовСтатистики)";
	
	Запрос.УстановитьПараметр("МассивВидовСтатистики", МассивВидовСтатистики);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеНастроек.Вставить(ВыборкаДетальныеЗаписи.ВидСтатистики, ВыборкаДетальныеЗаписи.Настройка.Получить());
	КонецЦикла;
	
	Возврат СоответствиеНастроек;
	
КонецФункции

&НаСервере
Процедура ВывестиОтчет_расшифровку(номерСтатистики, СоответствиеМассиваГруппировок = неопределено, Отказ = Ложь) Экспорт
	
	Макет = Обработки.ИА_РабочийСтолСтатистик_Упр_HTML.ПолучитьМакет("Расшифровка");;
	ТабДокРасшифровка.Очистить();
	
	СтрокаДереваСтатистик = ДеревоСтатистик.ПолучитьЭлементы()[номерСтатистики];
	СтрокиСтатистик       = СтрокаДереваСтатистик.ПолучитьЭлементы();
	//ИА_Арчил Тваладзе 2016.10.05
	ЕстьСдвигиПериода = ЕстьСдвигиПериода(СтрокаДереваСтатистик);
	//Конец ИА_Арчил Тваладзе 2016.10.05
	
	СводнаяТаблица = ПолучитьИзВременногоХранилища(СтрокаДереваСтатистик.СсылкаНаСводнуюТаблицу);
	
	СписокДанных = Новый СписокЗначений;
	
	ТаблицаПериодов = Неопределено;
	
	Для каждого СтрокаСтатистик Из СтрокиСтатистик Цикл
		
		Если СоответствиеМассиваГруппировок = Неопределено Тогда 
			массивПолейРасшифровки = Неопределено;
		Иначе
			массивПолейРасшифровки = СоответствиеМассиваГруппировок.Получить(СтрокаСтатистик.ВидСтатистики);
		КонецЕсли;
				
		Если массивПолейРасшифровки = Неопределено или массивПолейРасшифровки.Количество() = 0 Тогда
			массивПолейРасшифровки = Новый Массив;
			массивПолейРасшифровки.Добавить(Перечисления.ИА_ПоляРасшифровки.Период);
			Если ЗначениеЗаполнено(СтрокаСтатистик.ВидСтатистики.Аналитика1) Тогда
				массивПолейРасшифровки.Добавить(Перечисления.ИА_ПоляРасшифровки.Аналитика1);
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаСтатистик.ВидСтатистики.Аналитика2) Тогда
				массивПолейРасшифровки.Добавить(Перечисления.ИА_ПоляРасшифровки.Аналитика2);
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаСтатистик.ВидСтатистики.Аналитика3) Тогда
				массивПолейРасшифровки.Добавить(Перечисления.ИА_ПоляРасшифровки.Аналитика3);
			КонецЕсли;
		КонецЕсли;
		
		СтарыеДанные = СтрокаСтатистик.Данные.Выгрузить();
		СписокДанных.Добавить(СтарыеДанные,?(СокрЛП(СтрокаСтатистик.НаименованиеДляЛегенды)="", Строка(СтрокаСтатистик.ВидСтатистики), СтрокаСтатистик.НаименованиеДляЛегенды));
		
		Если СтрокаСтатистик.СдвигПериода <> 0 Тогда
			
			СдвинутыеДатыНачалаКонца = Новый Структура("ДатаНачала, ДатаКонца", Объект.ДатаНачала, Объект.ДатаКонца);
			Если Не ИА_Статистики.ПолучитьСдвинутыеДатыНачалаКонца(Объект, СтрокаСтатистик, СдвинутыеДатыНачалаКонца) Тогда
				
				Сообщение = Новый СообщениеПользователю;  
				Сообщение.Текст = "В строке "+СтрокаСтатистик.НаименованиеДляЛегенды+" ""Вид сдвига периода"" меньше ""Периода детализации""! "+Символы.ПС + "Невозможно вывести статистики!";
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
				Возврат;
				
			КонецЕсли;
			
			ДатаНачала = СдвинутыеДатыНачалаКонца.ДатаНачала;
			ДатаКонца  = СдвинутыеДатыНачалаКонца.ДатаКонца;
			
		Иначе
			
			ДатаНачала = Объект.ДатаНачала;
			ДатаКонца  = Объект.ДатаКонца;
			
		КонецЕсли;
		
		ИА_Статистики.ПолучитьТаблицуПериодов(ДатаНачала, ДатаКонца, СтрокаСтатистик, Объект.Настройка);

		ТаблицаПериодов = СтрокаСтатистик.Данные.Выгрузить();
		
		ПериодДетализации = СтрокаСтатистик.ПериодДетализации;
		
		НомерТаблицы = СписокДанных.Количество();
		
		ИмяКолонкиДатаНачала = "ДатаНачала" + НомерТаблицы; 
		ИмяКолонкиЗначение   = "Значение" + НомерТаблицы; 
		
		
		грПоля = "";
		заголовокКолонки ="";
		ЭтоПервый = Истина;
		Для каждого стр из массивПолейРасшифровки Цикл
			Если не ЭтоПервый Тогда
				грПоля = грПоля + " , ";
				заголовокКолонки = заголовокКолонки + " / ";
			КонецЕсли;
			
			грПоля = грПоля + " ПодЗапрос."+стр;
			
			ПолеЗаголовка = стр;
			Если ПолеЗаголовка = Перечисления.ИА_ПоляРасшифровки.Аналитика1 тогда
				ПолеЗаголовка = СтрокаСтатистик.ВидСтатистики.Аналитика1; 
			ИначеЕсли ПолеЗаголовка = Перечисления.ИА_ПоляРасшифровки.Аналитика2 тогда
				ПолеЗаголовка = СтрокаСтатистик.ВидСтатистики.Аналитика2;
			ИначеЕсли ПолеЗаголовка = Перечисления.ИА_ПоляРасшифровки.Аналитика3 тогда
				ПолеЗаголовка = СтрокаСтатистик.ВидСтатистики.Аналитика3;
			КонецЕсли;
			
			заголовокКолонки = заголовокКолонки + ПолеЗаголовка;
			ЭтоПервый = Ложь;
		КонецЦикла;
		
		
		РезТЗ_Данные = ИА_Защита_Статистика.ПолучитьТЗДанныеСтатистики(СтрокаСтатистик, ДатаНачала, ДатаКонца);
		РезТЗ_Данные1 = ИА_БФС.ТЗ_УдалитьПустыеТипы(РезТЗ_Данные, истина,истина);
				
		// делаем итоговый запрос
		АгрФункция = "СУММА(Количество)";				
		Агрегат =    "СУММА(ПодЗапрос.Количество)";
		Если СтрокаСтатистик.ВидСтатистики.ВидИтоговЗаОдинПериод = Перечисления.ИА_ВидыИтоговЗаОдинПериод.СреднееЗначение Тогда
			АгрФункция = "СРЕДНЕЕ(Количество)";
			Агрегат =     "СРЕДНЕЕ(ПодЗапрос.Количество)";
		ИначеЕсли СтрокаСтатистик.ВидСтатистики.ВидИтоговЗаОдинПериод = Перечисления.ИА_ВидыИтоговЗаОдинПериод.КоличествоРазличных Тогда
			АгрФункция = "КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Количество)";
			Агрегат =    "КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПодЗапрос.Количество)";
		КонецЕсли;

		ЗапросДанных = Новый Запрос;
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросДанных.Текст = "ВЫБРАТЬ
		               |	ТЗ.ДатаНачала КАК ДатаНачала,
		               |	ТЗ.ДатаКонца КАК ДатаКонца
		               |ПОМЕСТИТЬ ТЗПериоды
		               |ИЗ
		               |	&ТЗ КАК ТЗ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТЗДанные.Период КАК Период,
					   |	ТЗДанные.Аналитика1 КАК Аналитика1,
					   |	ТЗДанные.Аналитика2 КАК Аналитика2,
					   |	ТЗДанные.Аналитика3 КАК Аналитика3,
		               |	ТЗДанные.Количество КАК Количество,
					   |	ТЗДанные.Вопрос КАК Вопрос,
		               |	ТЗДанные.Ответ КАК Ответ
		               |ПОМЕСТИТЬ ТЗДанные
		               |ИЗ
		               |	&ТЗДанные КАК ТЗДанные
		               |;
		               | ";
					   
		ЗапросДанных.УстановитьПараметр("ТЗ",ТаблицаПериодов);
		ЗапросДанных.УстановитьПараметр("ТЗДанные",РезТЗ_Данные1);					   
		ЗапросДанных.Выполнить();		
		
		ЗапросДанных.Текст = "ВЫБРАТЬ Разрешенные "+грПоля+"
			   |	,"+Агрегат+" КАК Количество
			   |ИЗ
			   |	(ВЫБРАТЬ 
			   |		ТЗПериоды.ДатаНачала КАК Период,
			   |		ТЗДанные.Аналитика1 КАК Аналитика1,
			   |		ТЗДанные.Аналитика2 КАК Аналитика2,
			   |		ТЗДанные.Аналитика3 КАК Аналитика3,
			   |		ТЗДанные.Количество КАК Количество,
			   |		ТЗДанные.Вопрос КАК Вопрос,
			   |		ТЗДанные.Ответ КАК Ответ
			   |	ИЗ
			   |		ТЗДанные КАК ТЗДанные
			   |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗПериоды КАК ТЗПериоды ПО (ТЗДанные.Период МЕЖДУ ТЗПериоды.ДатаНачала И ТЗПериоды.ДатаКонца)			   
			   |) КАК ПодЗапрос
			   |
			   |СГРУППИРОВАТЬ ПО
			   |	"+грПоля+"
			   |УПОРЯДОЧИТЬ ПО
			   |	"+грПоля+"
			   |ИТОГИ
			   |	"+АгрФункция+"
			   |ПО
			   |	ОБЩИЕ,
			   |	"+СтрЗаменить(грПоля,"ПодЗапрос.","");
		
				
		Итого = 0;
		Выборка = ЗапросДанных.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Итого = Выборка.Количество;
		КонецЕсли;
		
		ЕстьКвота = ЗначениеЗаполнено(СтрокаСтатистик.Квота) И ЗначениеЗаполнено(СтрокаСтатистик.ТипКвоты);
		
		ОблШапка = ?(ЕстьКвота,
					Макет.ПолучитьОбласть("ШапкаСКвотой"),
					Макет.ПолучитьОбласть("Шапка"));
		ОблШапка.Параметры.Итог = Итого;
		СреднееИСостояние = Ложь;
		ВыводитьСреднее = Истина;
		Если СтрокаСтатистик.ВидСтатистики.ВидИтогов = Перечисления.ИА_ВидыИтогов.СреднееЗначение и СтрокаСтатистик.ВидСтатистики.ЗапросОтображаетСостояние Тогда
			ОблШапка.Параметры.Итог = Итого/ТаблицаПериодов.Количество();
			СреднееИСостояние = Истина;
		КонецЕсли;
		ОблШапка.Параметры.Заголовок = заголовокКолонки;
		ОблШапка.Параметры.ЗаголовокСтатистики = ?(СокрЛП(СтрокаСтатистик.НаименованиеДляЛегенды)="", СтрокаСтатистик.ВидСтатистики, СтрокаСтатистик.НаименованиеДляЛегенды);
		Если ЕстьКвота Тогда
			ОблШапка.Параметры.Квота = Формат(СтрокаСтатистик.Квота, "ЧДЦ=2");
		КонецЕсли;
		
		ТабДокРасшифровка.Вывести(ОблШапка);
			
		дерево = ЗапросДанных.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		ТабДокРасшифровка.НачатьАвтогруппировкуСтрок();
		
		Если дерево.Строки.Количество()>0 Тогда
			тзОтклоненияКвот = Неопределено; 
			Если ЕстьКвота Тогда
				тзОтклоненияКвот = ИА_Статистики.ПолучитьОтклонениеКвоты(СтарыеДанные, СтрокаСтатистик.Квота, СтрокаСтатистик.ТипКвоты);
			КонецЕсли;	
			ВывестиСтрокиВОтчет(дерево.Строки[0].Строки,ТабДокРасшифровка,1,массивПолейРасшифровки, макет, СтрокаСтатистик.ПериодДетализации, СреднееИСостояние, ВыводитьСреднее, тзОтклоненияКвот, СтрокаСтатистик);
		КонецЕсли;
		
		ТабДокРасшифровка.ЗакончитьАвтогруппировкуСтрок();
		
		//
		СтрокаСтатистик.Данные.Загрузить(СтарыеДанные);
	КонецЦикла;
	
	// сводка по нескольким графикам по периодам
	КоличествоТаблиц = СписокДанных.Количество();
	Если СписокДанных.Количество()>1 Тогда
		ОблШапка = Макет.ПолучитьОбласть("ШапкаСводно");
		ТабДокРасшифровка.Вывести(ОблШапка);
		
		ОблШапка = Макет.ПолучитьОбласть("ШапкаТаблицыСводно");
		ТабДокРасшифровка.Вывести(ОблШапка);
		
		
		Для каждого стрСтат из СписокДанных Цикл
			ОблКолонка = Макет.ПолучитьОбласть("КолонкаСтатистика");
			ОблКолонка.Параметры.Статистика = стрСтат.Представление;
			ТабДокРасшифровка.Присоединить(ОблКолонка);
		КонецЦикла;
		
		// данные
		Для каждого стрПериод Из СводнаяТаблица Цикл
		//Для каждого стрПериод Из СводнаяТаблицаПериодов Цикл
			
			ОблКолонка = Макет.ПолучитьОбласть("СтрокаПериод");
			ПараметрыПериод = "";
			
			//ИА_Арчил Тваладзе 2016.10.05
			ПараметрыПериод = ИА_Статистики.ПолучитьПараметрПериодДляСводнойТаблицыРасшифровки(ПараметрыПериод, ЕстьСдвигиПериода, КоличествоТаблиц, ПериодДетализации, стрПериод);
			//ИА_Арчил Тваладзе 2016.10.05
			
			ОблКолонка.Параметры.Период = ПараметрыПериод;
			ТабДокРасшифровка.Вывести(ОблКолонка);
			
			Для НомерТаблицы =1 по КоличествоТаблиц Цикл
				
				ОблКолонка = Макет.ПолучитьОбласть("КолонкаЗначение");
				
				ИмяКолонкиДатаНачала = "ДатаНачала_" + НомерТаблицы; 
				ИмяКолонкиЗначение   = "Значение_"   + НомерТаблицы; 
				
				ПараметрЗначение = " ";
				СтрокаПериода = СписокДанных[НомерТаблицы-1].Значение.Найти(стрПериод[ИмяКолонкиДатаНачала], "ДатаНачала");
				Если СтрокаПериода <> Неопределено Тогда
					
					ЗначениеЗначения = СтрокаПериода.Значение;
					Если ЗначениеЗначения = null Тогда
						ЗначениеЗначения = " ";
					КонецЕсли;
					
					ПараметрЗначение = ЗначениеЗначения;
					
				КонецЕсли;
				
				ОблКолонка.Параметры.Значение = ПараметрЗначение;
				ТабДокРасшифровка.Присоединить(ОблКолонка);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВывестиСтрокиВОтчет(строки, ТабДокРасшифровка,уровень,массивПолей, макет, ПериодДет, СреднееИСостояние, ВыводитьСреднее, тзОтклоненияКвот = Неопределено, СтрокаСтатистик)
	
	ВыводитьСреднее1 = ВыводитьСреднее;
	
	Для каждого стр из строки цикл
		Если стр[строка(массивПолей[0])] = null или уровень > массивПолей.Количество() Тогда // общий итог
			Продолжить;
		КонецЕсли;
		
		Если уровень = 1 И тзОтклоненияКвот <> Неопределено Тогда
			Если массивПолей[уровень-1] = Перечисления.ИА_ПоляРасшифровки.Период Тогда			
				ОбластьСтрока = Макет.ПолучитьОбласть("ПериодСКвотой");
			ИначеЕсли массивПолей[уровень-1] = Перечисления.ИА_ПоляРасшифровки.Аналитика1 Тогда
				ОбластьСтрока = Макет.ПолучитьОбласть("Аналитика1СКвотой");
			ИначеЕсли массивПолей[уровень-1] = Перечисления.ИА_ПоляРасшифровки.Аналитика2 Тогда
				ОбластьСтрока = Макет.ПолучитьОбласть("Аналитика2СКвотой");
			ИначеЕсли массивПолей[уровень-1] = Перечисления.ИА_ПоляРасшифровки.Аналитика3 Тогда
				ОбластьСтрока = Макет.ПолучитьОбласть("Аналитика3СКвотой");
			КонецЕсли;	
			ОбластьСтрока.Параметры.Заполнить(стр);
			ПериодП = Неопределено;
			ПолучитьПериод(стр, ПериодП);
			с = тзОтклоненияКвот.Найти(ПериодП, "ДатаНачала");
			Если Не с = Неопределено Тогда
				ОбластьСтрока.Параметры.Заполнить(с);
				ОбластьСтрока.Параметры.Количество = с.Значение;
			КонецЕсли;	
		Иначе
			ОбластьСтрока = Макет.ПолучитьОбласть(Строка(массивПолей[уровень-1]));
			ОбластьСтрока.Параметры.Заполнить(стр);
		КонецЕсли; 
		
		//
		Если массивПолей[уровень-1] = Перечисления.ИА_ПоляРасшифровки.Период Тогда
			ОбластьСтрока.Параметры.Период = ПолучитьПредставлениеТочкиПериода(ПериодДет, стр.Период);
			ВыводитьСреднее1 = Ложь;	
		КонецЕсли;
		//
		Если СреднееИСостояние и ВыводитьСреднее1 и стр.Строки.Количество()>0 Тогда
			ОбластьСтрока.Параметры.Количество = стр.Количество / стр.Строки.Количество();
		КонецЕсли;
        
        //{ Вывод расшифровки
        ИА_Поле = Строка(массивПолей[уровень-1]);
        ИА_ПолеРасшифровка = ИА_Поле + "Объект";
        Если ИА_БФКС.РеквизитЕсть(ОбластьСтрока.Параметры, ИА_ПолеРасшифровка) Тогда
        	ОбластьСтрока.Параметры[ИА_ПолеРасшифровка] = ОбластьСтрока.Параметры[ИА_Поле];
        КонецЕсли; 
        //} 
		
		//ИА_Арчил Тваладзе 2016.10.05
		ВидСтатистики = СтрокаСтатистик.ВидСтатистики;
		СтруктураРасшифровки = Новый Структура("ВидСтатистики", ВидСтатистики);
		
		Для каждого Поле  Из массивПолей  Цикл
			СтруктураРасшифровки.Вставить(Строка(Поле), стр[Строка(Поле)]); 
		КонецЦикла;
		Если СтруктураРасшифровки.Свойство("Период") Тогда
			
			Если стр.Период = null Тогда
				СтруктураРасшифровки.Период = стр.Период;
			Иначе
				СтруктураРасшифровки.Период = ПолучитьГраницыПериода(ПериодДет, стр.Период);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаСтатистик.Аналитика1) Тогда
			СтруктураРасшифровки.Вставить("Аналитика1", СтрокаСтатистик.Аналитика1);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаСтатистик.Аналитика2) Тогда
			СтруктураРасшифровки.Вставить("Аналитика2", СтрокаСтатистик.Аналитика2);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаСтатистик.Аналитика3) Тогда
			СтруктураРасшифровки.Вставить("Аналитика3", СтрокаСтатистик.Аналитика3);
		КонецЕсли;
		  
		ОбластьСтрока.Параметры.СтруктураРасшифровки =  СтруктураРасшифровки;
		//Конец ИА_Арчил Тваладзе 2016.10.05
		
		ОбластьСтрока.Параметры[Строка(массивПолей[уровень-1])] = Лев("          ", уровень-1) + ОбластьСтрока.Параметры[Строка(массивПолей[уровень-1])]; 
		ТабДокРасшифровка.Вывести(ОбластьСтрока, уровень,,ложь);
		
		ВывестиСтрокиВОтчет(стр.Строки,ТабДокРасшифровка,уровень + 1,массивПолей, макет, ПериодДет, СреднееИСостояние, ВыводитьСреднее1,,СтрокаСтатистик);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьПериод(стр, ПериодП)
	Если не ЗначениеЗаполнено(стр.Период) Тогда
		ПолучитьПериод(стр.Строки[0], ПериодП);
	Иначе
		ПериодП = стр.Период;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеТочкиПериода(ПериодДет, ДатаНач)
	Если ПериодДет = Перечисления.ИА_ПериодыДетализации.День тогда
		Возврат Формат(ДатаНач,"ДФ=dd.MM.yy");
	ИначеЕсли ПериодДет = Перечисления.ИА_ПериодыДетализации.Неделя тогда
		Возврат Формат(ДатаНач,"ДФ=dd.MM.yy")+"-" + Формат(ДатаНач + 60*60*24*6,"ДФ=dd.MM.yy");
	ИначеЕсли ПериодДет = Перечисления.ИА_ПериодыДетализации.Месяц тогда
		Возврат Формат(ДатаНач,"ДФ=MM.yyyy");
	ИначеЕсли ПериодДет = Перечисления.ИА_ПериодыДетализации.Квартал тогда
		Возврат Формат(ДатаНач,"ДФ=MM.yyyy");
	ИначеЕсли ПериодДет = Перечисления.ИА_ПериодыДетализации.Год тогда
		Возврат Формат(ДатаНач,"ДФ=yyyy");
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВыборПериода(Команда)
	Период  = Новый СтандартныйПериод(Объект.ДатаНачала,Объект.ДатаКонца);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	Если Диалог.Редактировать() Тогда 
		Период = Диалог.Период;
		Объект.ДатаНачала = Период.ДатаНачала;
		Объект.ДатаКонца = Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Поле2ПриИзменении(Элемент)
	НарисоватьДиаграммы(ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если не ИА_Защита_Общий.ЛицензияДоступна("Статистика") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
    
    РольСтатистикиПросмотрДоступна 		 = ИА_КСУОбщийСервер.ПросмотрСтатистикДоступен();
	РольСтатистикиРедактированиеДоступна = ИА_КСУОбщийСервер.РедактированиеСтатистикДоступно();
		
	#Если ВебКлиент Тогда
		ВебКлиент = истина;
		Элементы.Печать.Видимость = ложь;
	#КонецЕсли
	
	//////////////////////// ОТЛАДКА!!!!!!!!!!!!!!!!!
	//ВебКлиент = истина;
	////////////////////////////////////////////
	
	Если не ВебКлиент тогда
		ПодключитьОбработчикОжидания("ПроверитьИзменениеРазмераОкна",2,ложь);
		КонтрольРазмераВкл = истина;
	КонецЕсли;
	
	Элементы.ПолеХТМЛ.Видимость = не ВебКлиент;
КонецПроцедуры

&НаКлиенте
Процедура КонтрольИзмененияРазмера_Включить()
	КонтрольРазмераВкл = истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтрольИзмененияРазмера_Выключить()
	КонтрольРазмераВкл = ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИзменениеРазмераОкна()
	Если не КонтрольРазмераВкл Тогда
		Возврат;
	КонецЕсли;
	                 
	Если ДеревоСтатистик.ПолучитьЭлементы().Количество()>0 Тогда // статистики сформированы
		предРазмер = sw;
		ОпределитьРазрешениеЭкрана();
		Если предРазмер > sw + 50 ИЛИ предРазмер < sw - 50 Тогда
			НарисоватьДиаграммы(ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначение(номерСтатСтр, ЭтоРС = ложь) Экспорт
	номерСтат = число(номерСтатСтр)-1;
	
	Если ДеревоСтатистик.ПолучитьЭлементы()[номерСтат].ПолучитьЭлементы().Количество()>1 Тогда
		СписокДляВыбора = Новый СписокЗначений;
		Для каждого стрСтрСтат из ДеревоСтатистик.ПолучитьЭлементы()[номерСтат].ПолучитьЭлементы() Цикл 
			струкДоб = Новый Структура("ВидСтатистики,Аналитика1,Аналитика2,Аналитика3");
			ЗаполнитьЗначенияСвойств(струкДоб, стрСтрСтат);
			СписокДляВыбора.Добавить(струкДоб, Строка(струкДоб.ВидСтатистики) + "," + струкДоб.Аналитика1 + "," + струкДоб.Аналитика2 + "," + струкДоб.Аналитика3);		
		КонецЦикла;
		
		Парам = Новый Структура("СписокСтатистик",СписокДляВыбора);
		ОткрытьФорму("ОбщаяФорма.ИА_ВыборСтатистики",Парам,,,,, Новый ОписаниеОповещения("ДобавитьЗначениеЗавершение", ЭтотОбъект, Новый Структура("номерСтат, ЭтоРС", номерСтат, ЭтоРС)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
        Возврат;
	Иначе
		СтрокаГраф = ДеревоСтатистик.ПолучитьЭлементы()[номерСтат].ПолучитьЭлементы()[0];
	КонецЕсли;
	
	ДобавитьЗначениеФрагмент(НомерСтат, СтрокаГраф, ЭтоРС);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	номерСтат = ДополнительныеПараметры.номерСтат;
	ЭтоРС = ДополнительныеПараметры.ЭтоРС;
	
	
	СтрокаГраф = Результат;
	
	Если СтрокаГраф = Неопределено Тогда
		возврат;
	КонецЕсли;
	СтрокаГраф = СтрокаГраф.Значение;
	
	ДобавитьЗначениеФрагмент(НомерСтат, СтрокаГраф, ЭтоРС);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначениеФрагмент(Знач НомерСтат, Знач СтрокаГраф, Знач ЭтоРС)
	
	Перем ФДок;
	
	Если не СтатистикаРучная(СтрокаГраф.ВидСтатистики) Тогда
		ПоказатьПредупреждение(,"Значения данной статистики нельзя редактировать вручную!");
		Возврат;
	КонецЕсли;
	
	Парам = Новый Структура("БыстрыйРежим,ВидСтатистики",истина,СтрокаГраф.ВидСтатистики);
	Если ЗначениеЗаполнено(СтрокаГраф.Аналитика1) Тогда
		Парам.Вставить("Аналитика1", СтрокаГраф.Аналитика1);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаГраф.Аналитика2) Тогда
		Парам.Вставить("Аналитика2", СтрокаГраф.Аналитика2);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаГраф.Аналитика3) Тогда
		Парам.Вставить("Аналитика3", СтрокаГраф.Аналитика3);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ИА_Статистика.Форма.ФормаДокументаУпр",Парам,,,,, Новый ОписаниеОповещения("ДобавитьЗначениеФрагментЗавершение", ЭтотОбъект, Новый Структура("НомерСтат, ЭтоРС", НомерСтат, ЭтоРС)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначениеФрагментЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НомерСтат = ДополнительныеПараметры.НомерСтат;
	ЭтоРС = ДополнительныеПараметры.ЭтоРС;	
	
	Если ЭтоРС Тогда
		Оповестить("КСУ_ОбновитьМС");
	Иначе
		ПересчитатьСтатистику(НомерСтат);
		НарисоватьДиаграммы(ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СтатистикаРучная(ВидСтатистики)
	Возврат ВидСтатистики.ВариантПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхСтатистик.ДокументомСтатистика;
КонецФункции

&НаСервере
Процедура ПересчитатьСтатистику(НомерСтат)
	деревоСТ = РеквизитФормыВЗначение("ДеревоСтатистик");
	Выходные = ИА_Защита_Статистика.ПолучитьВыходныеЗаПериод(Объект.ДатаНачала, Объект.ДатаКонца);
	
	СтрокаСтатистикИсходная = деревоСТ.Строки[НомерСтат];
	Для Каждого СтрокаСтатистик Из ДеревоСТ.Строки Цикл
		ОбновлятьСтатистику = Ложь;
		Для Каждого СтрокаСтрокаСтатистик Из СтрокаСтатистик.Строки Цикл
			Если СтрокаСтрокаСтатистик.ВидСтатистики = СтрокаСтатистикИсходная.Строки[0].ВидСтатистики Тогда
				ОбновлятьСтатистику = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ОбновлятьСтатистику Тогда
			ИА_Статистики.ПолучитьТочки(Объект,Выходные, СтрокаСтатистик);
			ЗначениеВРеквизитФормы(деревоСТ, "ДеревоСтатистик");
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтарыйБраузер = Константы.ИА_СтарыйБраузер.Получить(); 
	ТолькоЗавершПериоды = истина;
	ОтображатьОдинБудущийПериодСтатистики = Константы.ИА_ОтображатьОдинБудущийПериодСтатистики.Получить();
	
	Если ОтображатьОдинБудущийПериодСтатистики Тогда
		ТолькоЗавершПериоды = Ложь;
	КонецЕсли;
	
	ВыводитьПодписиЗначенийПриПечати = ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.ВыводитьПодписиЗначенийПриПечати);
	ИспользоватьРучнойМаштабГрафиков = Константы.ИА_ИспользоватьРучнойМаштабГрафиков.Получить();

КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	КонтрольИзмененияРазмера_Выключить();
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	КонтрольИзмененияРазмера_Включить();
КонецПроцедуры


&НаКлиенте
Процедура ДатаКонцаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	КонтрольИзмененияРазмера_Выключить();
КонецПроцедуры


&НаКлиенте
Процедура ДатаКонцаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	КонтрольИзмененияРазмера_Включить();
КонецПроцедуры


&НаКлиенте
Процедура ПолеКолДиагИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	КонтрольИзмененияРазмера_Выключить();
КонецПроцедуры


&НаКлиенте
Процедура ПолеКолДиагОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	КонтрольИзмененияРазмера_Включить();
КонецПроцедуры


&НаКлиенте
Процедура НастройкаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	КонтрольИзмененияРазмера_Выключить();
КонецПроцедуры


&НаКлиенте
Процедура НастройкаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	КонтрольИзмененияРазмера_Включить();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодчиненные(номерСтатСтр)
	
	номерСтат = число(номерСтатСтр)-1;
	
	ВывестиДетализациюКлиент(номерСтат);
	ВидимостьКнопокКонтекстногоМеню();
	
КонецПроцедуры	     

&НаСервереБезКонтекста
Функция ПолучитьКоличествоАналитик(пВидСтатистики)
	кол = 0;
	Если ЗначениеЗаполнено(пВидСтатистики.Аналитика1) Тогда
		кол = кол + 1;
	Иначе
		Возврат кол;
	КонецЕсли;
	Если ЗначениеЗаполнено(пВидСтатистики.Аналитика2) Тогда
		кол = кол + 1;
	Иначе
		Возврат кол;
	КонецЕсли;
	Если ЗначениеЗаполнено(пВидСтатистики.Аналитика3) Тогда
		кол = кол + 1;
	Иначе
		Возврат кол;
	КонецЕсли;
	
	Возврат кол;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекУровеньДетализации(СтрокаДетализации)
	//Если тз_Подчиненные.Количество() = 0 Тогда
	//	возврат 0;
	//Иначе
	//	тз_Подчиненные.Сортировать("УровеньДетализации УБЫВ");	
	//	возврат тз_Подчиненные[0].УровеньДетализации;
	//КонецЕсли;
	кол = 0;
	Если ЗначениеЗаполнено(СтрокаДетализации.Аналитика1) Тогда
		кол = кол + 1;
	Иначе
		Возврат кол;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаДетализации.Аналитика2) Тогда
		кол = кол + 1;
	Иначе
		Возврат кол;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаДетализации.Аналитика3) Тогда
		кол = кол + 1;
	Иначе
		Возврат кол;
	КонецЕсли;
	
	Возврат кол;
КонецФункции

&НаКлиенте
Процедура ВывестиДетализациюКлиент(номерСтатистики)
				 	
	Если не ПодготовитьДетализацию(номерСтатистики) Тогда
		Возврат;
	КонецЕсли;
	
	НарисоватьДиаграммы(истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАналитикиДетализации(СтрокаДерева,ОбъектДатаНачала, ОбъектДатаКонца, НомерАналитики)
	РезТЗ_Данные = ИА_Защита_Статистика.ПолучитьТЗДанныеСтатистики(СтрокаДерева, ОбъектДатаНачала, ОбъектДатаКонца);
	Аналитика = "Аналитика"+ НомерАналитики;
	
	РезТЗ_Данные.Свернуть(Аналитика);
	Рез = новый Массив;
	Для каждого стр из РезТЗ_Данные Цикл
		Если ЗначениеЗаполнено(стр[Аналитика]) Тогда
			рез.Добавить(стр[Аналитика]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
КонецФункции

&НаСервере
Функция ПодготовитьДетализацию(номерСтатистики)
	
	деревоСТ = РеквизитФормыВЗначение("ДеревоСтатистик");
	
	СтрокиДетализации = деревоСТ.Строки[номерСтатистики].Строки;

	СтрокаДетализации = СтрокиДетализации[0];
	СтатистикаДетализации = СтрокаДетализации.ВидСтатистики;
	
	ТекУровень = ПолучитьТекУровеньДетализации(СтрокаДетализации);
	МаксУровень = ПолучитьКоличествоАналитик(СтатистикаДетализации);
	
	Если ТекУровень >= МаксУровень Тогда
		Сообщить("Достигнут максимальный уровень детализации!");
		возврат ложь;
	КонецЕсли;
	
	НомерТекущейАналитики = ТекУровень + 1;
	
	//
	ВозможныеАналитики =  ПолучитьАналитикиДетализации(СтрокаДетализации,Объект.ДатаНачала, Объект.ДатаКонца, НомерТекущейАналитики);
	Если ВозможныеАналитики.Количество() = 0 Тогда
		Сообщить("Невозможно вывести подчиненные статистики т.к. нет значений в указанном периоде по данной детализации.");
		Возврат ложь;
	КонецЕсли;
	
	Для каждого значАналитики из ВозможныеАналитики Цикл
		Новстр = тз_Подчиненные.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, СтрокаДетализации);
		Новстр["Аналитика"+НомерТекущейАналитики] = значАналитики;
		Новстр.УровеньДетализации =  НомерТекущейАналитики;
		
		Новстр.ЗаголовокДиаграммы = Новстр.ЗаголовокДиаграммы + " (" + СокрЛП(значАналитики) + ")";
	КонецЦикла;
	//
	
	тз_Подчиненные.Сортировать("ЗаголовокДиаграммы");
	инд = 1;
	Для каждого стр из тз_Подчиненные Цикл
		стр.ПорядковыйНомер = инд;
		инд = инд + 1;
	КонецЦикла;
	
	ЗагрузитьНастройку(,,,Истина,Ложь,,ложь);
	
	возврат истина;
	
КонецФункции

&НаКлиенте
Процедура НазадОтПодчиненных(Команда)
	
	ОбновитьТекущуюТЗ();
	Если тз_Подчиненные.Количество()>0 Тогда 
		ЗагрузитьНастройку(,,, Истина,Ложь,,ложь);
		НарисоватьДиаграммы(истина);
	Иначе
		ЗагрузитьНастройкуБезПериодов();
	КонецЕсли;
	
	ВидимостьКнопокКонтекстногоМеню();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекУровеньДетализацииПоПодч()
	Если тз_Подчиненные.Количество() = 0 Тогда
		возврат 0;
	Иначе
		тз_Подчиненные.Сортировать("УровеньДетализации УБЫВ");	
		возврат тз_Подчиненные[0].УровеньДетализации;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ОбновитьТекущуюТЗ()
	ТекУр = ПолучитьТекУровеньДетализацииПоПодч(); 
	сч = тз_Подчиненные.Количество() - 1;
	Пока сч>=0 Цикл
		Если тз_Подчиненные[сч].УровеньДетализации =  ТекУр Тогда
			тз_Подчиненные.Удалить(сч);
		КонецЕсли;
		сч = сч - 1;
	КонецЦикла;
КонецФункции 

&НаКлиенте
Функция ВидимостьКнопокКонтекстногоМеню()
	кнНазад = Элементы.ПолеХТМЛКонтекстноеМенюНазадОтПодчиненных;
	кнНазад.Видимость = тз_Подчиненные.Количество()>0;
КонецФункции // ВидимостьКнопокКонтекстногоМеню()


&НаСервере
Функция СформироватьДеревоСтатистикПоАналитикам()
	                    	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	тз.ЗаголовокДиаграммы,
	               |	тз.ВидСтатистики,
	               |	тз.Аналитика1,
	               |	тз.Аналитика2,
	               |	тз.Аналитика3,
	               |	тз.ПериодДетализации,
	               |	тз.ЦветГрафика,
	               |	тз.ЦветГрафикаНарастающейКвоты,
	               |	тз.НаименованиеДляЛегенды,
	               |	тз.ПоказыватьВИЦО,
	               |	тз.ИА_ШиринаЛинии,
	               |	тз.ПорядковыйНомер,
	               |	тз.ТипКвоты,
	               |	тз.ПериодДетализацииКвоты,
	               |	тз.УзорТочки
	               |ПОМЕСТИТЬ втТЗ
	               |ИЗ
	               |	&ТаблицаЗначений КАК тз
	               |ГДЕ
	               |	тз.УровеньДетализации = &ТекУр
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_КвотыСтатистикСрезПоследних.ВидСтатистики,
	               |	ИА_КвотыСтатистикСрезПоследних.ПериодДетализации,
	               |	ИА_КвотыСтатистикСрезПоследних.Аналитика1,
	               |	ИА_КвотыСтатистикСрезПоследних.Аналитика2,
	               |	ИА_КвотыСтатистикСрезПоследних.Аналитика3,
	               |	ИА_КвотыСтатистикСрезПоследних.ТипКвоты,
	               |	ИА_КвотыСтатистикСрезПоследних.Квота
	               |ПОМЕСТИТЬ втКвоты
	               |ИЗ
	               |	РегистрСведений.ИА_КвотыСтатистик.СрезПоследних(&ДатаКонца, ) КАК ИА_КвотыСтатистикСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТЗ.ЗаголовокДиаграммы КАК ЗаголовокДиаграммы,
	               |	втТЗ.ВидСтатистики,
	               |	втТЗ.Аналитика1,
	               |	втТЗ.Аналитика2,
	               |	втТЗ.Аналитика3,
	               |	втТЗ.ПериодДетализации КАК ПериодДетализации,
	               |	втТЗ.ЦветГрафика,
	               |	втТЗ.ЦветГрафикаНарастающейКвоты,
	               |	втТЗ.НаименованиеДляЛегенды,
	               |	втТЗ.ПоказыватьВИЦО КАК ПоказыватьВИЦО,
	               |	втТЗ.ИА_ШиринаЛинии КАК ШиринаЛинии,
	               |	втТЗ.УзорТочки КАК УзорТочки,
	               |	ЕСТЬNULL(втКвоты.ТипКвоты, ЗНАЧЕНИЕ(Перечисление.ИА_ТипыКвот.ПустаяСсылка)) КАК ТипКвоты,
	               |	ЕСТЬNULL(втКвоты.Квота, 0) КАК Квота,
	               |	ЕСТЬNULL(втКвоты.ПериодДетализации, ЗНАЧЕНИЕ(Перечисление.ИА_ПериодыДетализации.ПустаяСсылка)) КАК ПериодДетализацииКвоты,
	               |	втТЗ.ПорядковыйНомер КАК ПорядковыйНомер,
	               |	ЗНАЧЕНИЕ(Справочник.Оргсхема.ПустаяСсылка) КАК Пост
	               |ИЗ
	               |	втТЗ КАК втТЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКвоты КАК втКвоты
	               |		ПО втТЗ.ВидСтатистики = втКвоты.ВидСтатистики
	               |			И втТЗ.Аналитика1 = втКвоты.Аналитика1
	               |			И втТЗ.Аналитика2 = втКвоты.Аналитика2
	               |			И втТЗ.Аналитика3 = втКвоты.Аналитика3
	               |			И втТЗ.ПериодДетализацииКвоты = втКвоты.ПериодДетализации
	               |			И втТЗ.ТипКвоты = втКвоты.ТипКвоты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПорядковыйНомер
	               |ИТОГИ
	               |	МАКСИМУМ(ПоказыватьВИЦО)
	               |ПО
	               |	Пост,
	               |	ПорядковыйНомер,
	               |	ПериодДетализации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втКвоты";
		
	
	ТаблицаЗначений = РеквизитФормыВЗначение("тз_Подчиненные");	
	ТекУр = ПолучитьТекУровеньДетализацииПоПодч();
	Запрос.УстановитьПараметр("ТаблицаЗначений", ТаблицаЗначений);
	Запрос.УстановитьПараметр("ТекУр", ТекУр);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(Объект.ДатаКонца) + 1);
	
    ДеревоСт = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Для каждого с0 из ДеревоСт.Строки Цикл
	  	Для каждого с из с0.Строки Цикл
			с.ЗаголовокДиаграммы = с.Строки[0].Строки[0].ЗаголовокДиаграммы;
			с.Строки[0].ЗаголовокДиаграммы = с.Строки[0].Строки[0].ЗаголовокДиаграммы;
		КонецЦикла;
	КонецЦикла;
	
    Возврат ДеревоСт;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСостояния(Команда)
	Ф = ОткрытьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма.ФормаСостояний");
	Если Не Ф.Открыта() Тогда
		Ф.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмзменитьПериодДетализации(пСобытие)
	
	Отказ = Ложь;
	
	Если пСобытие = "det_day" Тогда
		новПериод = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День");
	ИначеЕсли пСобытие = "det_week" Тогда
		новПериод = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя");
	ИначеЕсли пСобытие = "det_month" Тогда
		новПериод = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Месяц");
	ИначеЕсли пСобытие = "det_year" Тогда
		новПериод = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Год");
	Иначе
		НастройкаПриИзменении(Неопределено);
		Возврат;
	КонецЕсли;
	
	РучнойТипПериода = новПериод;
	
	Для каждого стр Из ДеревоСтатистик.ПолучитьЭлементы() Цикл
		
		Если Не ТиповыеПериоды_БольшеИлиРавно(стр.ВидСдвигаПериода, новПериод) Тогда
			Отказ = Истина;
			Прервать;
		КонецЕсли;
		
		стр.ПериодДетализации = новПериод;
		Для каждого стр1 Из стр.ПолучитьЭлементы() Цикл
			
			Если Не ТиповыеПериоды_БольшеИлиРавно(стр1.ВидСдвигаПериода, новПериод) Тогда
				Отказ = Истина;
				Прервать;
			КонецЕсли;
			стр1.ПериодДетализации = новПериод;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		//ОбновитьПериоды(новПериод);
		НарисоватьДиаграммы();
		
	Иначе 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя вывести статистики с детализацией "+новПериод+", так у одной из статистик ""Вид сдвига периода"" меньше!";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТиповыеПериоды_БольшеИлиРавно(ТиповойПериод1, ТиповойПериод2)
	Возврат ИА_Статистики.ТиповыеПериоды_БольшеИлиРавно(ТиповойПериод1, ТиповойПериод2);
КонецФункции

&НаКлиенте
Процедура ПолеХТМЛПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеХТМЛ = "" Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		событие = Элементы.ПолеХТМЛ.Документ.parentWindow.CurEvent;
		НомерЭл = Элементы.ПолеХТМЛ.Документ.parentWindow.CurEventSource;
	Исключение
		событие = Элементы.ПолеХТМЛ.Документ.window.CurEvent;
		НомерЭл = Элементы.ПолеХТМЛ.Документ.window.CurEventSource;
	КонецПопытки;
	
	Если событие<>"" Тогда
		Если событие = "report" Тогда
			ВывестиРасшифровку(НомерЭл);
		ИначеЕсли событие = "add" Тогда
			ДобавитьЗначение(НомерЭл);
		ИначеЕсли событие = "incl" Тогда
			ПоказатьПодчиненные(НомерЭл);
		ИначеЕсли лев(событие,4) = "det_" Тогда
			ИмзменитьПериодДетализации(событие);
		КонецЕсли;
		Попытка
			Элементы.ПолеХТМЛ.Документ.parentWindow.setCurEvent("","");
		Исключение
			Элементы.ПолеХТМЛ.Документ.window.setCurEvent("","");
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
//ИА_Арчил Тваладзе 2016.10.05
&НаСервере
Функция ЕстьСдвигиПериода(СтрокаГрафика) Экспорт
	
	СтрокиДетализации = СтрокаГрафика.ПолучитьЭлементы();
	Для каждого СтрДетализации Из СтрокиДетализации Цикл
		Если СтрДетализации.СдвигПериода > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьГраницыПериода(ПериодДетализации, ДатаНачала)
	
	Период = Новый СтандартныйПериод;
	Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Период.ДатаНачала = НачалоДня(ДатаНачала);
	
	Если ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День тогда
		Период.ДатаОкончания = КонецДня(ДатаНачала);
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Неделя тогда
		Период.ДатаОкончания = КонецДня(ДатаНачала + 60*60*24*6);
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Месяц тогда
		Период.ДатаОкончания = КонецМесяца(ДатаНачала);
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Квартал тогда
		Период.ДатаОкончания = КонецКвартала(ДатаНачала);
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Год тогда
		Период.ДатаОкончания = КонецГода(ДатаНачала);
	КонецЕсли;
	
	Возврат Период;
	
КонецФункции

&НаКлиенте
Процедура КнопкаВывестиРасшифровку(Команда)
	НомерЭл = число(Сред(ТекущийЭлемент.Имя,10))+1;
	ВывестиРасшифровку(НомерЭл);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьЗначение(Команда)
	НомерЭл = число(Сред(ТекущийЭлемент.Имя,10))+1;
	ДобавитьЗначение(НомерЭл);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаПоказатьПодчиненные(Команда)
	НомерЭл = число(Сред(ТекущийЭлемент.Имя,10))+1;
	ПоказатьПодчиненные(НомерЭл);
КонецПроцедуры

//Конец ИА_Арчил Тваладзе 2016.10.05
