
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = Истина;
	Контрагент = ОбщийМодульВызовСервера.ПолучитьКонтрагентаПоНомеруТелефона(Запись.Номер);
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитов(Команда)
	
	Если ДоступнаРольАдминистратора() Тогда
		ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступнаРольАдминистратора()
	Возврат РольДоступна("АдминистраторСистемы");
КонецФункции
