
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//++ №12136
	НастройкиОтчета = КомпоновщикНастроек.Настройки;
	
	Параметр = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИспользоватьОтборПоСотруднику"));
	Если Не Параметр = Неопределено Тогда
		Параметр.Значение = ПараметрыСеанса.ТекущийПользователь.ОграничениеДоступаКЛидамДляЗамерщика;
	КонецЕсли;
	
	Параметр = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОтборСотрудник"));
	Если Не Параметр = Неопределено Тогда
		Параметр.Значение = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	КонецЕсли;
	//-- №12136
	
КонецПроцедуры

