#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередУдалением(Отказ)
	
	УдалитьЗаданиеОбмена("ОбменТоварами");
	ИдентификаторРегламентногоЗаданияОбменаТоварами = Неопределено;
	
	УдалитьЗаданиеОбмена("ОбменЗаказами");
	ИдентификаторРегламентногоЗаданияОбменаЗаказами = Неопределено;
	
	УдалитьЗаданиеОбмена("ОбменОплатами");
	ИдентификаторРегламентногоЗаданияОбменаОплатами = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПустаяСтрока(Код) Тогда
		УстановитьНовыйКод();
	КонецЕсли;
		
	Если НЕ ОбменТоварами
		И НЕ ОбменЗаказами 
		И НЕ ОбменОплатами
		Тогда
		
		Отказ = Истина;
		Сообщение = НСтр("ru = 'Режим обмена не выбран!'");
		Поле = "ОбменТоварами";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, ЭтотОбъект, Поле);
		
	КонецЕсли;

	ДобавитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	ИдентификаторРегламентногоЗаданияОбменаТоварами = Неопределено;
	ИдентификаторРегламентногоЗаданияОбменаЗаказами = Неопределено;
	ИдентификаторРегламентногоЗаданияОбменаОплатами = Неопределено;
	
	ИспользоватьРегламентноеЗаданиеОбменаТоварами = Ложь;
	ИспользоватьРегламентноеЗаданиеОбменаЗаказами = Ложь;
	ИспользоватьРегламентноеЗаданиеОбменаОплатами = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Управляет регламентным заданием узла обмена.  Расписание задания задается в форме узла обмена.
// Предусматривает работу через подсистему "СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий".
//
// Параметры:
//  РасписаниеРегламентногоЗадания - РасписаниеРегламентногоЗадания - расписание регламентного задания.
//
Процедура ВключитьОтключитьРегламентноеЗадание(РежимОбмена, РасписаниеРегламентногоЗадания) Экспорт
		
	Задание = СуществующееЗадание(РежимОбмена);
	
	Если РежимОбмена = "ОбменТоварами" Тогда
		
		Если ИспользоватьРегламентноеЗаданиеОбменаТоварами Тогда
			МетаданныеРЗ = Метаданные.РегламентныеЗадания.ОбменСWikkiВыгрузкаТоваров;		
			ВключитьРегламентноеЗадание(Задание, МетаданныеРЗ, РасписаниеРегламентногоЗадания, ИдентификаторРегламентногоЗаданияОбменаТоварами);		
		Иначе
			ОтключитьРегламентноеЗадание(Задание, ИдентификаторРегламентногоЗаданияОбменаТоварами);		
		КонецЕсли;
		
	ИначеЕсли РежимОбмена = "ОбменЗаказами" Тогда
		
		Если ИспользоватьРегламентноеЗаданиеОбменаЗаказами Тогда
			МетаданныеРЗ = Метаданные.РегламентныеЗадания.ОбменСWikkiОбменЗаказами;		
			ВключитьРегламентноеЗадание(Задание, МетаданныеРЗ, РасписаниеРегламентногоЗадания, ИдентификаторРегламентногоЗаданияОбменаЗаказами);		
		Иначе
			ОтключитьРегламентноеЗадание(Задание, ИдентификаторРегламентногоЗаданияОбменаЗаказами);		
		КонецЕсли;
		
	ИначеЕсли РежимОбмена = "ОбменОплатами" Тогда
		
		Если ИспользоватьРегламентноеЗаданиеОбменаОплатами Тогда
			МетаданныеРЗ = Метаданные.РегламентныеЗадания.ОбменСWikkiОбменОплатами;		
			ВключитьРегламентноеЗадание(Задание, МетаданныеРЗ, РасписаниеРегламентногоЗадания, ИдентификаторРегламентногоЗаданияОбменаОплатами);		
		Иначе
			ОтключитьРегламентноеЗадание(Задание, ИдентификаторРегламентногоЗаданияОбменаОплатами);		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВключитьРегламентноеЗадание(Задание, МетаданныеРЗ, РасписаниеРЗ, ИдентификаторРЗ)
	
	ПараметрыЗадания = СвойстваЗадания(МетаданныеРЗ, РасписаниеРЗ);
	
	Если Задание = Неопределено Тогда
		
		ПараметрыЗадания.Вставить("Метаданные", МетаданныеРЗ);
		ПараметрыЗадания.Вставить("Ключ", Строка(Новый УникальныйИдентификатор));
		ПараметрыЗадания.Вставить("Использование", Истина);
		
		ИдентификаторРЗ = НовоеЗадание(ПараметрыЗадания);

	Иначе
		УстановитьПараметрыЗадания(Задание, ПараметрыЗадания);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтключитьРегламентноеЗадание(Задание, ИдентификаторРЗ)
	
	Если Задание <> Неопределено Тогда
		УдалитьЗадание(Задание);
	КонецЕсли;
	ИдентификаторРЗ = Неопределено;
	
КонецПроцедуры
	
// Получение свойств регламентного задания.
//
// Параметры:
//  РасписаниеЗадания - РасписаниеРегламентногоЗадания - расписание регламентного задания.
// 
// Возвращаемое значение:
//  Структура - свойства существующего регламентного задания.
//
Функция СвойстваЗадания(МетаданныеРЗ, РасписаниеЗадания = Неопределено) Экспорт
	
	Параметры = Новый Массив;
	Параметры.Добавить(Код);
	
	ПараметрыЗадания = Новый Структура;
	Если Не РасписаниеЗадания = Неопределено Тогда
		ПараметрыЗадания.Вставить("Расписание", РасписаниеЗадания);
	КонецЕсли;
	ПараметрыЗадания.Вставить("Параметры", Параметры);
	ПараметрыЗадания.Вставить("ИмяМетода", МетаданныеРЗ.ИмяМетода);
	ПараметрыЗадания.Вставить("Наименование", НаименованиеРегламентногоЗадания(МетаданныеРЗ));

	Возврат ПараметрыЗадания;
	
КонецФункции

Функция УдалитьЗаданиеОбмена(РежимОбмена)
	
	Задание = СуществующееЗадание(РежимОбмена);
	Если Задание <> Неопределено Тогда
		УдалитьЗадание(Задание);
	КонецЕсли;
	
КонецФункции
	
// Функция - Существующее задание
// 
// Возвращаемое значение:
//   РегламентноеЗадание - регламентное задание - регламентное задание, соответствующее узлу плана обмена.
//							Если задания нет - возвращается "Неопределено".
//
Функция СуществующееЗадание(РежимОбмена) Экспорт
	
	Если РежимОбмена = "ОбменТоварами" Тогда
		ИдентификаторРЗ = ИдентификаторРегламентногоЗаданияОбменаТоварами;
		МетаданныеРЗ = Метаданные.РегламентныеЗадания.ОбменСWikkiВыгрузкаТоваров;
	ИначеЕсли РежимОбмена = "ОбменЗаказами" Тогда
		ИдентификаторРЗ = ИдентификаторРегламентногоЗаданияОбменаЗаказами;
		МетаданныеРЗ = Метаданные.РегламентныеЗадания.ОбменСWikkiОбменЗаказами;
	ИначеЕсли РежимОбмена = "ОбменОплатами" Тогда
		ИдентификаторРЗ = ИдентификаторРегламентногоЗаданияОбменаОплатами;
		МетаданныеРЗ = Метаданные.РегламентныеЗадания.ОбменСWikkiОбменОплатами;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
	Отбор = Новый Структура;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Отбор.Вставить("Ключ", ИдентификаторРЗ);
	Иначе
		Если ЗначениеЗаполнено(ИдентификаторРЗ) Тогда
			Отбор.Вставить("Идентификатор", Новый УникальныйИдентификатор(ИдентификаторРЗ));
		КонецЕсли;
		Отбор.Вставить("Наименование", НаименованиеРегламентногоЗадания(МетаданныеРЗ));
		
	КонецЕсли;

	Отбор.Вставить("Метаданные", МетаданныеРЗ);
	
	Найденные = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	Задание = ?(Найденные.Количество() = 0, Неопределено, Найденные[0]);
	
	Возврат Задание;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты)
	
	Если ОбменЗаказами Тогда
		
		Если ЗагрузкаЗаказов Тогда
			ПроверяемыеРеквизиты.Добавить("ДатаНачалаЗагрузкиЗаказов");
		КонецЕсли;
		Если ВыгрузкаЗаказов Тогда
			ПроверяемыеРеквизиты.Добавить("ДатаНачалаВыгрузкиЗаказов");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НаименованиеРегламентногоЗадания(МетаданныеРЗ)
	
	Если МетаданныеРЗ = Метаданные.РегламентныеЗадания.ОбменСWikkiВыгрузкаТоваров Тогда	
		НаименованиеШаблон = НСтр("ru = 'Обмен с Wikki (выгрузка товаров) (%1)'");
		
	ИначеЕсли МетаданныеРЗ = Метаданные.РегламентныеЗадания.ОбменСWikkiОбменЗаказами Тогда	
		НаименованиеШаблон = НСтр("ru = 'Обмен с Wikki (обмен заказами) (%1)'");
		
	ИначеЕсли МетаданныеРЗ = Метаданные.РегламентныеЗадания.ОбменСWikkiОбменОплатами Тогда	
		НаименованиеШаблон = НСтр("ru = 'Обмен с Wikki (обмен оплатами) (%1)'");
		
	КонецЕсли;
	
	НаименованиеЗадания = СтрШаблон(НаименованиеШаблон, Код);
	
	Возврат НаименованиеЗадания;
	
КонецФункции

// Удаляет регламентное задание, соответствующее объекту.
//
// Параметры:
// нет
// 
// Возвращаемое значение:
// нет
//
Процедура УдалитьЗадание(Задание)
	
	РегламентныеЗаданияСервер.УдалитьЗадание(Задание);
	
КонецПроцедуры

Функция НовоеЗадание(ПараметрыЗадания)
	
	РегламентноеЗадание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	
	Если ТипЗнч(РегламентноеЗадание) = Тип("СтрокаТаблицыЗначений") Тогда
		Идентификатор = РегламентноеЗадание.Ключ;
	Иначе
		Идентификатор = Строка(РегламентноеЗадание.УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

Процедура УстановитьПараметрыЗадания(Задание, СвойстваЗадания)
	
	Если Задание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, СвойстваЗадания);
	
	УстановитьПривилегированныйРежим(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли