
//_____________________________________________________________
////#Область ОтборСКД

Процедура ОтборСКД_ОткрытьРедакторСКД(Данные, ФормаВладелец) Экспорт
    П = Новый Структура("ДанныеНастроек", Данные);
    ОткрытьФорму("ОбщаяФорма.ИА_БФРедакторОтбораСКД", П, ФормаВладелец);
КонецПроцедуры


Функция   ОтборСКД_ВыбраноЗначение(ВыбранноеЗначение) Экспорт
    Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
        И ВыбранноеЗначение.Свойство("Вид")
        И ВыбранноеЗначение.Вид = "РедакторОтбораСКД"
        Тогда
        Возврат Истина;
    Иначе
        Возврат Ложь;
    КонецЕсли; 
КонецФункции

////#КонецОбласти 


////#Область РедакторТекста

Процедура РедакторТекста_Открыть(Параметры, Форма) Экспорт
    Владелец = Форма;
    Если Параметры.Свойство("Уникальность") Тогда
        Уникальность = Параметры.Уникальность;
    Иначе
        Уникальность = Владелец;
    КонецЕсли; 
    ОткрытьФорму("ОбщаяФорма.ИА_БФРедакторТекста"
    , Параметры, Владелец, Уникальность);
КонецПроцедуры

Функция   РедакторТекста_ВыбраноЗначение(ВыбранноеЗначение) Экспорт
    Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
        И ВыбранноеЗначение.Свойство("Вид")
        И ВыбранноеЗначение.Вид = "РедакторТекста"
        Тогда
        Возврат Истина;
    Иначе
        Возврат Ложь;
    КонецЕсли; 
КонецФункции

Функция   РедакторТекста_ПолучитьРезультат(ВыбранноеЗначение) Экспорт
    Результат = Новый Структура("Текст, ИД", "", "");
    Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
        И ВыбранноеЗначение.Свойство("Вид")
        И ВыбранноеЗначение.Вид = "РедакторТекста"
        Тогда
        ЗаполнитьЗначенияСвойств(Результат, ВыбранноеЗначение);
        Возврат Результат;
    Иначе
        Возврат Неопределено;
    КонецЕсли; 
КонецФункции

////#КонецОбласти 

////#Область РедакторФормул

Процедура РедакторФормул_Открыть(Параметры, Форма) Экспорт
    Владелец = Форма;
    Если Параметры.Свойство("Уникальность") Тогда
        Уникальность = Параметры.Уникальность;
    Иначе
        Уникальность = Владелец;
    КонецЕсли; 
    ОткрытьФорму("ОбщаяФорма.ИА_БФРедакторФормул", Параметры, Владелец, Уникальность); 
    
КонецПроцедуры

////#КонецОбласти 

////#Область ТабличныйДокумент

Процедура ТабДок_Вывести(ТабДок, Заголовок = "", НаЭкран = Истина) Экспорт
    Если ТипЗнч(ТабДок) <> Тип("ТабличныйДокумент") Тогда
        Возврат;
    КонецЕсли; 
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ТабДок = Новый ТабличныйДокумент;
    #КОНЕЦЕСЛИ
    
    
    ТабДок.ОтображатьГруппировки = Истина;
    ТабДок.ОтображатьСетку       = Ложь;
    ТабДок.ОтображатьЗаголовки   = Ложь;
    ТабДок.ТолькоПросмотр        = Истина;
    ТабДок.Показать(Заголовок);
КонецПроцедуры

////#КонецОбласти 

////#Область Теги

Процедура Теги_Редактор(ИсточникТегов, Форма) Экспорт
    СписокТегов = Новый Массив;
    Для каждого Стр Из ИсточникТегов Цикл
        СписокТегов.Добавить(Стр.Тег);
    КонецЦикла;  
    
    ДанныеТегов = Новый Структура("ИД, Заголовок, Теги"
    , "" + Форма.УникальныйИдентификатор
    , "Теги по: " + Форма.Заголовок
    , СписокТегов);
    
    П = Новый Структура("ДанныеТегов", ДанныеТегов);
    ОткрытьФорму("Справочник.ИА_БФТегиОбъектов.Форма.РедакторТегов", П, Форма);
КонецПроцедуры

Процедура Теги_ОбновитьЗаголовок(ИсточникТегов, ЭлементЗаголовок) Экспорт
    Если ИсточникТегов.Количество() > 0 Тогда
        Текст = "";
        Для каждого Стр Из ИсточникТегов Цикл
            Текст = Текст + "; " + Стр.Тег;
        КонецЦикла;  
        Текст = "Теги: " + Сред(Текст, 3);
    Иначе
        Текст = "Тегов нет";
    КонецЕсли; 
    ЭлементЗаголовок.Заголовок = Текст;
КонецПроцедуры

Процедура Теги_ОбработкаОповещенияВОбъекте(ИмяСобытия, Параметр, Источник, Форма, ИсточникТегов, ЭлементЗаголовок) Экспорт
    Если ИмяСобытия = "ТегиОбновлены" Тогда
        Если ТипЗнч(Параметр) = Тип("Структура")
            И Параметр.Свойство("ИД")
            И Параметр.ИД = "" + Форма.УникальныйИдентификатор
            Тогда
            ИсточникТегов.Очистить();
            Форма.Модифицированность = Истина;
            Для каждого Эл Из Параметр.Теги Цикл
                НовСтрока =ИсточникТегов.Добавить();
                НовСтрока.Тег = Эл;
            КонецЦикла;  
            Теги_ОбновитьЗаголовок(ИсточникТегов, ЭлементЗаголовок);
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

Процедура Теги_ВызовОтбора(Форма, ДинСписок, ОтборТеги, Условие_ИЛИ) Экспорт
    ДанныеТегов = Новый Структура("ИД, Теги, Условие_ИЛИ"
    , "" + Форма.УникальныйИдентификатор
    , ОтборТеги.ВыгрузитьЗначения()
    , Условие_ИЛИ);  
    ОткрытьФорму("Справочник.ИА_БФТегиОбъектов.Форма.ФормаВыбораТегов"
    , Новый Структура("ДанныеТегов", ДанныеТегов));
КонецПроцедуры

Функция   Теги_ОбработкаОповещенияВСписке(ИмяСобытия, Параметр, Источник
    , Форма, ОтборТеги, Условие_ИЛИ, СписокОбъектов, ИмяОбъектаМД) Экспорт
    Если ИмяСобытия = "ТегиУстановленОтбор" Тогда
        Если ТипЗнч(Параметр) = Тип("Структура")
            И Параметр.Свойство("ИД")
            И Параметр.ИД = "" + Форма.УникальныйИдентификатор
            Тогда
            Условие_ИЛИ = Параметр.Условие_ИЛИ;
            ОтборТеги.Очистить();            
            Для каждого Эл Из Параметр.Теги Цикл
                ОтборТеги.Добавить(Эл);
            КонецЦикла;  
            
            ПараметрыСписка = Новый Структура;
            
            Если ОтборТеги.Количество() = 0 Тогда
            	ПараметрыСписка.Вставить("Теги_НетОтбора",    Истина);
                ПараметрыСписка.Вставить("Теги_СписокСсылок", Новый Массив);
            Иначе
                ПараметрыСписка.Вставить("Теги_НетОтбора",    Ложь);
                Список = ИА_БФС.Теги_СформироватьСписокОбъектовПоСпискуТегов(ИмяОбъектаМД
                , ОтборТеги.ВыгрузитьЗначения(), Условие_ИЛИ);
                ПараметрыСписка.Вставить("Теги_СписокСсылок",    Список);
            КонецЕсли; 
            
            Для каждого КиЗ Из ПараметрыСписка Цикл
                Эл = СписокОбъектов.Параметры.Элементы.Найти(КиЗ.Ключ);
                Если Эл <> Неопределено Тогда
                    Эл.Значение = КиЗ.Значение;
                    Эл.Использование = Истина;
                КонецЕсли;
            КонецЦикла;              
            Возврат Истина;
        КонецЕсли;         
    КонецЕсли;	
    Возврат Ложь;
КонецФункции

////#КонецОбласти 

////#Область РаботаСУниверсальнымОтчетом

Процедура УниОтчет_Открыть(Параметры, Отказ) Экспорт
    Отказ = Истина;
    ОткрытьФорму("ОбщаяФорма.ИА_УниОтчет", Параметры);
КонецПроцедуры


Процедура УниОтчет_ОткрытьИзОбычнойФормы(Объект, Отказ, СтандартнаяОбработка) Экспорт
    Отказ                = Истина;
    СтандартнаяОбработка = Ложь;
    ПараметрыОтчета      = ИА_БФС.УниОтчет_ПодготовитьДанные(Объект);
    УниОтчет_Открыть(ПараметрыОтчета, Отказ)
КонецПроцедуры

////#КонецОбласти 

////#Область ДеревоФормы

Процедура ДФ_РазвернутьВсеВетки(ДеревоФормы, ЭлементДеревоФормы) Экспорт
    Для каждого Стр Из ДеревоФормы.ПолучитьЭлементы() Цикл
        ЭлементДеревоФормы.Развернуть(Стр.ПолучитьИдентификатор(), Истина);
    КонецЦикла;  
КонецПроцедуры
 

////#КонецОбласти 


//#Область УФ_СортировкаЭлементовДанных

Процедура УФ_СортировкаЭлементовДанных_Нажатие(Форма, Команда) Экспорт
    Настройки = Форма.УФ_СЭД_Настройки;
    ЭФСписок = Форма.Элементы [Настройки.ИмяЭФСписка];
    ТекСтрока = ЭФСписок.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
    	Элемент = ТекСтрока[Настройки.ИмяПоля];
        Направление = ?(Найти(Команда.Имя, "Вниз"), 1, -1);
        ИА_БФС.УФ_СортировкаЭлементовДанных_ИзменитьПорядок(Настройки, Элемент, Направление);
        ЭФСписок.Обновить();
    КонецЕсли; 
КонецПроцедуры
 	
//#КонецОбласти 