
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Цех.Видимость = Константы.НесколькоТочекПроизводства.Получить();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	//Если ПравоДоступа("Добавление", Метаданные.Документы.ВозвратПродукции)
	//	И Элементы.ПодменюСоздатьНаОсновании.ПодчиненныеЭлементы.Количество() > 5 Тогда
	//	Элементы.Переместить(Элементы.ФормаОформитьВыпускПродукции, Элементы.ПодменюСоздатьНаОсновании, Элементы.ПодменюСоздатьНаОсновании.ПодчиненныеЭлементы[5]);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Оповестить("Запись_ЗаказНаПроизводствоСписок", ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

//------------Процедуры создания документа выпуска продукции -----------

//++ #14923 убрано
//&НаКлиенте
//Процедура ОформитьВыпускПродукции(Команда)
//	ТекущийДокумент = Элементы.Список.ТекущиеДанные.Ссылка;
//	Если НЕ ПолучитьТекущийСтатусЗаказа(ТекущийДокумент) = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.ВПроизводстве") Тогда
//		Состояние("Выпуск продукции можно оформить только по заказу в статусе ""В производстве""");
//		Возврат;
//	КонецЕсли;
//	Если НЕ ЕстьДокументВыпускаПоЭтомуЗаказу(ТекущийДокумент) Тогда
//		ПараметрыНовогоДокумента = Новый Структура;
//		ПараметрыНовогоДокумента.Вставить("Основание", ТекущийДокумент);
//		ОткрытьФорму("Документ.ВыпускПродукции.Форма.ФормаДокумента", ПараметрыНовогоДокумента);
//	Иначе
//		Состояние("По данному заказу уже оформлялся выпуск. Оформление второго выпуска не возможно.");
//	КонецЕсли;
//КонецПроцедуры

//&НаСервере
//Функция ЕстьДокументВыпускаПоЭтомуЗаказу(ЗаказНаПроизводство)
//	Результат = Ложь;
//	НайденныйДокументВыпуска = НайтиДокументВыпускаПродукции(ЗаказНаПроизводство);
//	Если НайденныйДокументВыпуска = Документы.ВыпускПродукции.ПустаяСсылка() Тогда
//		Результат = Ложь;
//	Иначе
//		Результат = Истина;
//	КонецЕсли;
//	Возврат Результат;
//КонецФункции

//&НаСервере 
//Функция НайтиДокументВыпускаПродукции(ЗаказНаПроизводство)
//	
//	Результат = Документы.ВыпускПродукции.ПустаяСсылка();
//	
//	ОсновнаяФактура = ПолучитьОсновнуюФактуруИЦвет(ЗаказНаПроизводство);
//	
//	//подберем последний документ выпуска продукции по данному заказу на производство
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ЗаказыНаПроизводствоОбороты.Регистратор
//	|ИЗ
//	|	РегистрНакопления.ЗаказыНаПроизводство.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыНаПроизводствоОбороты
//	|ГДЕ
//	|	ЗаказыНаПроизводствоОбороты.КоличествоРасход > 0
//	|	И ЗаказыНаПроизводствоОбороты.Фактура = &Фактура
//	|	И ЗаказыНаПроизводствоОбороты.ЦветФактуры = &ЦветФактуры
//	|	И ЗаказыНаПроизводствоОбороты.НомерРасчета = &НомерРасчета";
//	Запрос.УстановитьПараметр("ЗаказНаПроизводство",ЗаказНаПроизводство);
//	Запрос.УстановитьПараметр("Фактура",ОсновнаяФактура.ПродукцияФактура);
//	Запрос.УстановитьПараметр("ЦветФактуры",ОсновнаяФактура.ПродукцияЦвет);
//	Запрос.УстановитьПараметр("НомерРасчета",ЗаказНаПроизводство.ПродукцияНомерРасчета);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл
//		ВыпускПродукции = Выборка.Регистратор;
//		Результат = Выборка.Регистратор;
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции

//&НаСервере
//Функция ПолучитьОсновнуюФактуруИЦвет(ЗаказНаПроизводство)
//	
//	СтруктураОтвета = Новый Структура;
//	СтруктураОтвета.Вставить("ПродукцияФактура",Справочники.Фактура.ПустаяСсылка()); 
//	СтруктураОтвета.Вставить("ПродукцияЦвет",Справочники.ЦветФактуры.ПустаяСсылка());
//	
//	Для Каждого ТекущаяСтрока Из ЗаказНаПроизводство.ФактураПотолка Цикл
//		Если ТекущаяСтрока.Основная Тогда
//			СтруктураОтвета.ПродукцияФактура = ТекущаяСтрока.ПродукцияФактура;
//			СтруктураОтвета.ПродукцияЦвет = ТекущаяСтрока.ПродукцияЦвет;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат СтруктураОтвета;
//	
//КонецФункции

//&НаСервере
//Функция ПолучитьТекущийСтатусЗаказа(ЗаказНаПроизводство) 
//	Возврат ЗаказНаПроизводство.ТекущийСтатус;
//КонецФункции

//-- #14923

//Начало исключен при переходе на 2.0
//------------Процедуры создания документа реализации товаров и услуг -----------
//&НаКлиенте
//Процедура ОформитьРеализацию(Команда)
//	
//	ТекущийДокумент = Элементы.Список.ТекущиеДанные.Ссылка;
//	
//	ПродажаТовара = НайтиДокументПродажи(ТекущийДокумент);
//	Если НЕ ПродажаТовара.Пустая() Тогда
//		Если Вопрос("По данному заказу на производство уже оформлена реализация. Создать новый документ реализации?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;
//	
//	ПараметрыНовогоДокумента = Новый Структура;
//	ПараметрыНовогоДокумента.Вставить("Основание", ТекущийДокумент);
//	ОткрытьФорму("Документ.РеализацияТоваровИУслуг.Форма.ФормаДокумента", ПараметрыНовогоДокумента);
//	
//КонецПроцедуры

//&НаСервере 
//Функция НайтиДокументПродажи(ТекущийДокумент)
//	
//	ПродажаТовара = Документы.РеализацияТоваровИУслуг.ПустаяСсылка();
//	
//	//подберем последний документ выпуска продукции по данному заказу на производство
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ЗаказыНаПроизводствоОбороты.Регистратор
//	|ИЗ
//	|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Регистратор, ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыНаПроизводствоОбороты
//	|ГДЕ
//	|	ЗаказыНаПроизводствоОбороты.КоличествоРасход > 0";
//	Запрос.УстановитьПараметр("ЗаказНаПроизводство",ТекущийДокумент);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл
//		ПродажаТовара = Выборка.Регистратор;
//	КонецЦикла;
//	
//	Возврат ПродажаТовара;
//	
//КонецФункции
//Конец исключен при переходе на 2.0


//----остальные процедуры