
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТолькоСчетаОрганизации", ТолькоСчетаОрганизации, Истина);

	ОтборОпределен = Параметры.Отбор.Свойство("Владелец") И ЗначениеЗаполнено(Параметры.Отбор.Владелец);
	Элементы.ТолькоСчетаОрганизации.Видимость = НЕ ОтборОпределен;
	Элементы.ФормаОсновнойСчет.Доступность    = ОтборОпределен;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТолькоСчетаОрганизацииПриИзменении(Элемент)	
	
	УстановитьОтбор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура ОсновнойСчет(Команда)
	
	//#16679 
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнойСчетНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.Владелец, Истина);
	Элементы.Список.Обновить();
	Оповестить("ИзменилсяОсновнойСчет", ТекущиеДанные.Владелец);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура УстановитьОтбор()	
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТолькоСчетаОрганизации", ТолькоСчетаОрганизации, Истина);

КонецПроцедуры

&НаСервере
Процедура ОсновнойСчетНаСервере(СчетСсылка, ВладелецСсылка, СбросДоговора)
	
	ИмяРеквизита = "ОсновнойБанковскийСчет";
	
	Попытка
		СпрОбъект = ВладелецСсылка.ПолучитьОбъект();
		СпрОбъектМодифицирован = Ложь;
		Если НЕ СпрОбъект[ИмяРеквизита] = СчетСсылка Тогда
			СпрОбъект[ИмяРеквизита] = СчетСсылка;
			СпрОбъектМодифицирован = Истина;
		Иначе
			Если СбросДоговора Тогда
				// нажали кнопку "Основной счет" на основном счете - снимаем признак
				СпрОбъект[ИмяРеквизита] = Справочники.БанковскиеСчета.ПустаяСсылка();
				СпрОбъектМодифицирован = Истина;
			КонецЕсли;
		КонецЕсли;
		Если СпрОбъектМодифицирован Тогда
			СпрОбъект.Записать();
		КонецЕсли;
	Исключение
		Сообщить("Ошибка смены основного договора: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
