
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
    Фото = ПоместитьВоВременноеХранилище(ТекОбъект.Фото.Получить(),УникальныйИдентификатор);
	
	ИспользоватьКартыЯндекс = НЕ ПустаяСтрока(Константы.КлючAPIЯндексКарты.Получить());
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "ГруппаКонтактнаяИнформация", ПоложениеЗаголовкаЭлементаФормы.Лево);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
		
	Элементы.Подразделение.Видимость = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ПараметрыЗаписи.Свойство("ВопросЗадан") И ЕстьДублиПоФИО() Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтаФорма, ПараметрыЗаписи);
		ТекстВопроса = "В базе имеется сотрудник с аналогичным ФИО. Вы действительно хотите записать карточку сотрудника?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Фото) Тогда		
		Врем = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
		ТекущийОбъект.Фото = Врем;
	Иначе
		ТекущийОбъект.Фото = Неопределено;
	КонецЕсли;
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи = Новый Структура();
		ПараметрыЗаписи.Вставить("Закрыть", Истина);
		Если Записать(ПараметрыЗаписи) Тогда
			Закрыть();
		КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры
	 
&НаКлиенте
Процедура ПоказатьВопросЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗадан", Истина);
		Если Записать(ПараметрыЗаписи) И ПараметрыЗаписи.Свойство("Закрыть") Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	ПараметрыЗаписи = Новый Структура();	
	Записать(ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("Закрыть", Истина);
	
	Если Записать(ПараметрыЗаписи) Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры
	 
&НаКлиенте
Процедура ОбновитьФорму()
		
	//Если ПраваПользователей.РазрешеноИспользованиеСофтФона() Тогда
	//	Элементы.ПозвонитьПоНомеру.Видимость = Истина;
	//	Элементы.ПозвонитьПоНомеру.Видимость = Истина;
	//Иначе
	//	Элементы.ПозвонитьПоНомеру.Видимость = Ложь;
	//КонецЕсли;
	
	Элементы.НеПроверятьПересечениеЗамеровВГрафике.Видимость = Объект.ВыполняетЗамеры;
	
	Если ИспользоватьКартыЯндекс И Объект.ВыполняетЗамеры тогда
		Элементы.ЦветМеткиЗамераНаКартеЯндекс.Видимость = Истина;
	Иначе
		Элементы.ЦветМеткиЗамераНаКартеЯндекс.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПозвонитьПоНомеру(Команда)
//	СофтФонКлиент.ПозвонитьПоНомеру(Объект.КонтактныйТелефон, Объект.Наименование);
//КонецПроцедуры

//&НаКлиенте
//Процедура ПозвонитьПоЛичномуНомеру(Команда)
//	СофтФонКлиент.ПозвонитьПоНомеру(Объект.ЛичныйТелефон, Объект.Наименование);
//КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

//&НаКлиенте
//Процедура ВыбратьАдресФП(Команда)
//	ОбработкаВыбораАдресаФП = Новый ОписаниеОповещения("ОбработкаВыбораАдресаФП", ЭтаФорма);
//	ПараметрыАдреса = Новый Структура;
//	ПараметрыАдреса.Вставить("Представление", Объект.АдресФактическогоПроживания);
//	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводАдреса",ПараметрыАдреса,ЭтаФорма,,,,ОбработкаВыбораАдресаФП);
//	Модифицированность = Истина;
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаВыбораАдресаФП(ЗначениеВыбора, Источник) Экспорт
//	Если НЕ ЗначениеВыбора = Неопределено Тогда
//    	Объект.АдресФактическогоПроживания = ЗначениеВыбора.Представление;
//	КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура ВыбратьАдресРег(Команда)
	
	ОбработкаВыбораАдресаРег = Новый ОписаниеОповещения("ОбработкаВыбораАдресаРег", ЭтаФорма);

	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("Представление",Объект.ПаспортАдресРегистрации);
	ПараметрыАдреса.Вставить("ОткрытаПоСценарию", Истина);
	ПараметрыАдреса.Вставить("ВидКонтактнойИнформации", Новый Структура("ПроверятьКорректность", Ложь));

	//ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводАдреса",ПараметрыАдреса,ЭтаФорма,,,,ОбработкаВыбораАдресаРег);
	ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса",ПараметрыАдреса,ЭтаФорма,,,,ОбработкаВыбораАдресаРег);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораАдресаРег(ЗначениеВыбора, Источник) Экспорт
	Если НЕ ЗначениеВыбора = Неопределено Тогда
    	Объект.ПаспортАдресРегистрации = ЗначениеВыбора.Представление;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОткрытьФотоНаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Хранилище = ТекОбъект.Фото.Получить();
	Если Не Хранилище = Неопределено Тогда
		Возврат ПоместитьВоВременноеХранилище(Хранилище, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ФотоНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	АдресФайла = ОткрытьФотоНаСервере();
	Если Не АдресФайла = Неопределено Тогда
		ПолучитьФайл(АдресФайла, СокрЛП(Объект.Наименование) + ".jpg");
	Иначе
		Если Вопрос("Изображение отсутствует. Загрузить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ИзменитьФото(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(Данные, ИдентификаторФормы)
	Хранилище = Новый ХранилищеЗначения(Данные);
	АдресКартинки = ПоместитьВоВременноеХранилище(Хранилище.Получить(), ИдентификаторФормы);
	Возврат АдресКартинки;
КонецФункции

&НаКлиенте
Процедура ИзменитьФото(Команда)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Фильтр = "Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
		                            + "|Все файлы(*.*)|*.*"
		                            + "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
		                            + "|Формат GIF(*.gif*)|*.gif"
		                            + "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
		                            + "|Формат PNG(*.png*)|*.png"
		                            + "|Формат TIFF(*.tif)|*.tif"
		                            + "|Формат icon(*.ico)|*.ico"
		                            + "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf";
	ДиалогОткрытияФайла.Заголовок = "Выберите изображение";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			Попытка
				Фото = НавигационнаяСсылкаКартинки(Новый ДвоичныеДанные(ИмяФайла), УникальныйИдентификатор);
				Модифицированность = Истина;
			Исключение
				Сообщить("Не удалось прикрепить изображение! " + ОписаниеОшибки(), СтатусСообщения.Важное);
			КонецПопытки;
		КонецЦикла;
	Иначе
		Предупреждение("Изображение не выбрано!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФото(Команда)
	Если ЗначениеЗаполнено(Фото) Тогда
		Фото = "";
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполняетЗамерыПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

// #13536 закомментировано
//&НаСервере
//Функция ПараметрыШК()
//	
//	//Сформируем ш/к [88] [00000] [КодСотрудника(последние 5)]		
//	КодСотрудника = Формат(Прав(Объект.Код, 5), "ЧЦ=5; ЧВН=; ЧГ=");
//	Штрихкод = "8800000" + КодСотрудника;
//	Штрихкод = Штрихкод + ОбщийМодульВызовСервера.КонтрольныйСимволEAN(ШтрихКод, 13);
//	Возврат Новый Структура("ЗначениеКода, Заголовок", Штрихкод, Строка(Объект.Наименование));
//	
//КонецФункции

//&НаКлиенте
//Процедура ПечатьШК(Команда)
//	
//	Если ЗначениеЗаполнено(Объект.Ссылка) И Не Модифицированность Тогда	
//		ПараметрыШК = ПараметрыШК();
//		ОбщийМодульКлиент.ОткрытьФормуПечатиШК(ПараметрыШК.ЗначениеКода, , ПараметрыШК.Заголовок);
//	Иначе		
//		Сообщить("Предварительно необходимо записать элемент!");
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Функция ЕстьДублиПоФИО()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка <> &Ссылка
	|	И Сотрудники.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

//++ #4051
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЗаполнитьРасшифровкуПодписиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументПраваПодписиПриИзменении(Элемент)
	ЗаполнитьРасшифровкуПодписиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НомерДокументаПраваПодписиПриИзменении(Элемент)
	ЗаполнитьРасшифровкуПодписиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокументаПраваПодписиПриИзменении(Элемент)
	ЗаполнитьРасшифровкуПодписиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасшифровкуПодписиНаСервере()
	
	Перем РасшифровкаПодписи, ОснованиеПраваПодписи;
	
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		РасшифровкаПодписи = Объект.Наименование; //ОбщийМодуль.ФамилияИнициалы(Объект.Наименование);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РасшифровкаПодписи)
		И ЗначениеЗаполнено(Объект.ДокументПраваПодписи) Тогда
		
		ОснованиеПраваПодписи =
			Объект.ДокументПраваПодписи 
			+ ?(ПустаяСтрока(Объект.НомерДокументаПраваПодписи), "", " № " + Объект.НомерДокументаПраваПодписи)
			+ ?(НЕ ЗначениеЗаполнено(Объект.ДатаДокументаПраваПодписи),  "", " " + НСтр("ru = 'от'") + " " + Формат(Объект.ДатаДокументаПраваПодписи, "ДЛФ=D") + " " + НСтр("ru = 'г.'"));

			
		ШаблонСтроки = НСтр("ru ='%1 (%2)'");
		РасшифровкаПодписи = СтрШаблон(ШаблонСтроки, РасшифровкаПодписи, ОснованиеПраваПодписи);
		
	КонецЕсли;
	
	Объект.РасшифровкаПодписи = РасшифровкаПодписи;
	
КонецПроцедуры	
//-- #4051

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.КонтактнаяИнформация

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#КонецОбласти