#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.ВыборГруппИЭлементов <> ИспользованиеГруппИЭлементов.Группы
		И Не Параметры.Отбор.Свойство("Неактивный") Тогда
		
		Параметры.Отбор.Вставить("Неактивный", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Печать
	
// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// ШК сотрудника
    КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюПотолкиКлиент.ПечатьШКСотрудника";
    КомандаПечати.Идентификатор = "ПечатьШКСотрудника";
    КомандаПечати.Представление = НСтр("ru = 'Печать ШК'");
	КомандаПечати.Порядок = 30;
	
	// Генерация ШК для "Сотрудник + Производственная операция"
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюПотолкиКлиент.ГенерацияШКСотрудникПроизводственнаяОперация";
    КомандаПечати.Идентификатор = "ГенерацияШКСотрудникПроизводственнаяОперация";
    КомандаПечати.Представление = НСтр("ru = 'Генерация ШК для производственной операции'");
	КомандаПечати.Порядок = 20;
	
	//#14908 закомментировано
	// Генерация ШК для "Сотрудник + Операция над документами"
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Обработчик = "УправлениеПечатьюПотолкиКлиент.ГенерацияШКСотрудникОперацияНадДокументами";
	//КомандаПечати.Идентификатор = "ГенерацияШКСотрудникОперацияНадДокументами";
	//КомандаПечати.Представление = НСтр("ru = 'Генерация ШК для операции над документами'");
	//КомандаПечати.Порядок = 10;
	
	// Генерация ШК для РМ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюПотолкиКлиент.ГенерацияШКРМ";
    КомандаПечати.Идентификатор = "ГенерацияШКРМ";
    КомандаПечати.Представление = НСтр("ru = 'Генерация ШК для рабочего места'");
	КомандаПечати.Порядок = 40;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли