
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Объект.Владелец.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно
			И Константы.ИспользоватьАвтоматическуюНумерациюСерийНоменклатуры.Получить() Тогда
			
			ПрисвоитьНаименованиеИНомерПоПравилам();
			
		КонецЕсли;
	КонецЕсли;
	
	УправлениеЭлементамиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// #5951 проверяем условие уникальности наименования полотен
	Если Объект.Владелец.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.Владелец КАК Номенклатура,
		|	ДанныеСправочника.Наименование КАК Наименование
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК ДанныеСправочника
		|ГДЕ
		|	ДанныеСправочника.Наименование = &Наименование
		|	И ДанныеСправочника.Ссылка <> &Ссылка
		|	И ДанныеСправочника.Владелец.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Полотно)
		|	И ВЫБОР
		|			КОГДА &ПоискУникальностиПоВладельцу
		|				ТОГДА ДанныеСправочника.Владелец = &Владелец
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		// №7350 новая настройка "Не контролировать уникальность номеров серии пленки во всем справочнике"
		Запрос.УстановитьПараметр("ПоискУникальностиПоВладельцу", Константы.НеКонтролироватьУникальностьНомеровСерииПленкиВоВсемСправочнике.Получить());
		Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ТекстСообщения = "Серия с таким наименованием уже существует для позиции: " + Выборка.Номенклатура + ". Введите другую серию.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Наименование", , Отказ);
		КонецЕсли;
		
	//#14000 
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.Владелец КАК Номенклатура,
		|	ДанныеСправочника.Наименование КАК Наименование
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК ДанныеСправочника
		|ГДЕ
		|	ДанныеСправочника.Наименование = &Наименование
		|	И ДанныеСправочника.Ссылка <> &Ссылка
		|	И ДанныеСправочника.Владелец = &Владелец
		|";
		Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ТекстСообщения = "Серия с таким наименованием уже существует для позиции: " + Выборка.Номенклатура + ". Введите другую серию.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Наименование", , Отказ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ВладелецПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВладелецПриИзмененииНаСервере()
	
	Если НЕ Объект.Владелец.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда 
		Объект.НомерСерии = 0;
	КонецЕсли;
	УправлениеЭлементамиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСерииПриИзменении(Элемент)
	НомерСерииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НомерСерииПриИзмененииНаСервере()
	
	Если Объект.Владелец.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно
		И Константы.ИспользоватьАвтоматическуюНумерациюСерийНоменклатуры.Получить() Тогда
		
		Объект.Наименование = ОбщийМодуль.ПолучитьНаименованиеСерииНоменклатурыПоТекущемуШаблону(Объект.Владелец, Объект.НомерСерии);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПечатьШК(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И Не Модифицированность Тогда	
		//#5951 Кнопку "Печать ШК" разместить рядом с полем "Наименование" и печатать ШК по наименованию, а не по номеру серии
		//Штрихкод = Формат(Объект.НомерСерии, "ЧГ=");
		Штрихкод = Формат(Объект.Наименование);
		ОбщийМодульКлиент.ОткрытьФормуПечатиШК(Штрихкод);
	Иначе		
		Сообщить("Предварительно необходимо записать элемент!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиНаСервере()
	
	Элементы.НомерСерии.Видимость = (Объект.Владелец.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно);	
	Элементы.ПрисвоитьНовыйНомер.Видимость = (Объект.Владелец.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисвоитьНовыйНомер(Команда)
	ПрисвоитьНаименованиеИНомерПоПравилам();	
КонецПроцедуры

&НаСервере
Процедура ПрисвоитьНаименованиеИНомерПоПравилам()
	
	Объект.НомерСерии = ОбщийМодуль.ПолучитьПорядковыйНомерНовойСерииНоменклатуры();
	Объект.Наименование = ОбщийМодуль.ПолучитьНаименованиеСерииНоменклатурыПоТекущемуШаблону(Объект.Владелец, Объект.НомерСерии);
	
КонецПроцедуры



	

