&НаКлиенте
Процедура ЭлектронноеПисьмо(Команда)
	ЗапуститьПриложение("mailto:help@smartceilings.ru");
КонецПроцедуры

&НаКлиенте
Процедура СтраницаВИнтернете(Команда)
	ЗапуститьПриложение("https://help.smartceilings.ru");
КонецПроцедуры

&НаКлиенте
Процедура СкачатьСкайп(Команда)
	ЗапуститьПриложение("https://www.skype.com/ru/");
КонецПроцедуры

&НаКлиенте
Процедура СкачатьТимВьювер(Команда)
	ЗапуститьПриложение("https://www.teamviewer.com/ru/download/windows/");
КонецПроцедуры

&НаКлиенте
Процедура КаналЮтюб(Команда)
	ЗапуститьПриложение("https://www.youtube.com/channel/UCOrNe57B8iuHSzxv9hOVaeg");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НеНапоминатьДней = 1;
	Элементы.ГруппаНеНапоминать.Видимость = Параметры.ПоказатьНеНапоминать;
	
	РезультатПроверки = ОбщийМодуль.ОпределитьМассивПеременныхСеанса();
	Если НЕ РезультатПроверки.Лицензия Тогда
		ЗакрытьПрограммуПриЗакрытииФормы = Истина;
	КонецЕсли;
	Если РезультатПроверки.Лицензия и РезультатПроверки.Поддержка  Тогда
		ОсталосьПоддержки = ОбщийМодуль.ПолучитьСрокЗавершенияПоддержки();
		Если ОсталосьПоддержки <= 30 И НЕ РезультатПроверки.Коробка = 3 тогда
			Если РезультатПроверки.Коробка = 0 Тогда
				//коробка
				Элементы.ИнформационныйТекстЗаканчиваетсяПоддержка.Заголовок = "Внимание! Срок поддержки вашей конфигурации закончится через "+ОсталосьПоддержки+" дней.
				|
				|При отсутствии действующего договора сопровождения вам будут не доступны:
				|* обновления программы
				|* консультации по настройке и работе в программе
				|* индивидуальные настройки и доработки
				|* дополнительные сервисы и интеграция с другими программами
				|(более подробный список расширенного функционала при наличии ИТС см. на сайте разработчика)
				|
				|
				|Вам необходимо обратиться в отдел продаж или техническую службу по указанным ниже реквизитам.
				|
				|
				|";
			ИначеЕсли РезультатПроверки.Коробка = 1 Тогда
				//облако
				Элементы.ИнформационныйТекстЗаканчиваетсяПоддержка.Заголовок = "Внимание! Срок аренды вашей конфигурации закончится через "+ОсталосьПоддержки+" дней. 
				|
				|ПОСЛЕ ЗАВЕРШЕНИЯ СРОКА АРЕНДЫ ПРОГРАММА БУДЕТ ДОСТУПНА ТОЛЬКО В РЕЖИМЕ ПРОСМОТРА. 
				|
				|ВСЕ ПОЛЬЗОВАТЕЛЬСКИЕ ДАННЫЕ БУДУТ УДАЛЕНЫ ЧЕРЕЗ МЕСЯЦ ПОСЛЕ ОКОНЧАНИЯ АРЕНДЫ БЕЗ ВОЗМОЖНОСТИ ВОССТАНОВЛЕНИЯ
				|
				|Вам необходимо обратиться в отдел продаж или техническую службу по указанным ниже реквизитам.
				|
				|
				|";
			ИначеЕсли РезультатПроверки.Коробка = 2 Тогда
				//подписка
				Элементы.ИнформационныйТекстЗаканчиваетсяПоддержка.Заголовок = "Внимание! Срок аренды вашей конфигурации закончится через "+ОсталосьПоддержки+" дней. 
				|
				|ПОСЛЕ ЗАВЕРШЕНИЯ СРОКА АРЕНДЫ ПРОГРАММА БУДЕТ ДОСТУПНА ТОЛЬКО В РЕЖИМЕ ПРОСМОТРА. 
				|
				|
				|Вам необходимо обратиться в отдел продаж или техническую службу по указанным ниже реквизитам.
				|
				|
				|";
			КонецЕсли;
			Элементы.ИнформационныйТекстЗаканчиваетсяПоддержка.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли РезультатПроверки.Лицензия и НЕ РезультатПроверки.Поддержка  Тогда
		Если РезультатПроверки.Коробка = 0 Тогда
				//коробка
				Элементы.ИнформационныйТекстНетПоддержки.Заголовок = "ВНИМАНИЕ! У Вас завершился срок действия договора сопровождения!
					|
					|При отсутствии действующего договора сопровождения не доступны:
					|* обновления программы
					|* консультации по настройке и работе в программе
					|* индивидуальные настройки и доработки
					|* дополнительные сервисы и интеграция с другими программами
					|(более подробный список расширенного функционала при наличии ИТС см. на сайте разработчика)
					|
					|Вам необходимо обратиться в отдел продаж по указанным ниже реквизитам.
					|
					|Информационно техническое сопровождение (ИТС) осуществляется только при наличии активной подписки и по актуальным версиям конфигураций.  
					|Для восстановления не продленного договора ИТС необходимо иметь актуальную версию конфигурации.Стоимость установки обновлений в таких случаях определяется индивидуально.
					|
					|
					|";
				Элементы.ГруппаКонтактыТехПоддержки.Видимость = Ложь;
			ИначеЕсли РезультатПроверки.Коробка = 1 Тогда
				//облако
				Элементы.ИнформационныйТекстНетПоддержки.Заголовок = "ВНИМАНИЕ! У Вас завершился срок аренды программы!
					|
					|ПРОГРАММА НЕ ДОСТУПНА ДЛЯ РАБОТЫ.
					|
					|ВСЕ ПОЛЬЗОВАТЕЛЬСКИЕ ДАННЫЕ БУДУТ УДАЛЕНЫ ЧЕРЕЗ МЕСЯЦ ПОСЛЕ ОКОНЧАНИЯ АРЕНДЫ БЕЗ ВОЗВОЖНОСТИ ВОССТАНОВЛЕНИЯ.
					|
					|Вам необходимо обратиться в отдел продаж по указанным ниже реквизитам.
					|
					|
					|";
				Элементы.ГруппаКонтактыТехПоддержки.Видимость = Ложь;
			ИначеЕсли РезультатПроверки.Коробка = 2 Тогда
				//подписка
				Элементы.ИнформационныйТекстНетПоддержки.Заголовок = "ВНИМАНИЕ! У Вас завершился срок аренды программы!
					|
					|ПРОГРАММА ДОСТУПНА ТОЛЬКО В РЕЖИМЕ ПРОСМОТРА.
					|
					|
					|Вам необходимо обратиться в отдел продаж по указанным ниже реквизитам.
					|
					|
					|";
				Элементы.ГруппаКонтактыТехПоддержки.Видимость = Ложь;
			КонецЕсли;
		Элементы.ИнформационныйТекстНетПоддержки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронноеПисьмоОтделПродаж(Команда)
	ЗапуститьПриложение("mailto:info@smartceilings.ru");
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьНеНапоминать(Команда)
	ПрименитьНеНапоминатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрименитьНеНапоминатьНаСервере()
		
	ОбщийМодульВызовСервера.УстановитьСрокиНеНапоминатьОЗавершенииТехПоддержки(Мин(НеНапоминатьДней, ОсталосьПоддержки));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗакрытьПрограммуПриЗакрытииФормы Тогда
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСайта(Команда)
	ЗапуститьПриложение("http://smartceilings.ru");
КонецПроцедуры
