
Функция Печать() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ФинансовоеПланирование_ПФ_Лист1";
	
	РазделятьНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	Если РазделятьНалБезнал Тогда
		макет = ПолучитьМакет("ФинансоваяДирективаЛист1");
	Иначе
		макет = ПолучитьМакет("ФинансоваяДирективаЛист1Свернуто");
	КонецЕсли;
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапка.Параметры.Номер = Число(Прав(СсылкаНаОбъект.Номер,5));
	ОблШапка.Параметры.ДатаНачала = Формат(СсылкаНаОбъект.Дата+ 60*60*24, "ДФ='dd MMMM yyyy ""г.""'");
	ОблШапка.Параметры.ДатаКонца = Формат(СсылкаНаОбъект.Дата + 60*60*24*7 , "ДФ='dd MMMM yyyy ""г.""'");
	ОблШапка.Параметры.ПредварительнаяСуммаКРаспределению = СсылкаНаОбъект.ПредварительнаяСуммаКРаспределениюНал + СсылкаНаОбъект.ПредварительнаяСуммаКРаспределениюБезнал;
	ОблШапка.Параметры.Организация = ВРЕГ(СсылкаНаОбъект.Организация);
	ТабДокумент.Вывести(ОблШапка);
	
	//доходы
	Для каждого стр из СсылкаНаОбъект.Доходы Цикл
		ОблСтрока = Макет.ПолучитьОбласть("СтрокаДоход");
		ОблСтрока.Параметры.Заполнить(стр);
		ОблСтрока.Параметры.Сумма = стр.СуммаБезнал + стр.СуммаНал;
		ТабДокумент.Вывести(ОблСтрока);
	КонецЦикла;
	
	//политика 1
	ОблШапка = Макет.ПолучитьОбласть("ШапкаПолитика");
	ОблШапка.Параметры.НомерСВД = "";
	ОблШапка.Параметры.Заполнить(СсылкаНаОбъект);
	Если РазделятьНалБезнал Тогда
		ОблШапка.Параметры.МаржинальнаяПрибыльНал = СсылкаНаОбъект.ПредварительнаяСуммаКРаспределениюНал1; 
		ОблШапка.Параметры.МаржинальнаяПрибыльБезНал = СсылкаНаОбъект.ПредварительнаяСуммаКРаспределениюБезНал1; 
	КонецЕсли;
	ОблШапка.Параметры.МаржинальнаяПрибыльИтого = СсылкаНаОбъект.ПредварительнаяСуммаКРаспределениюНал1 + СсылкаНаОбъект.ПредварительнаяСуммаКРаспределениюБезНал1; 
	ТабДокумент.Вывести(ОблШапка);
	Для каждого стр из СсылкаНаОбъект.ПолитикаРаспределенияПервичная Цикл
		ОблСтрока = Макет.ПолучитьОбласть("СтрокаПолитика");
		ОблСтрока.Параметры.Заполнить(стр);
		ОблСтрока.Параметры.Сумма = стр.СуммаБезнал + стр.СуммаНал;		
		ТабДокумент.Вывести(ОблСтрока);
	КонецЦикла;
	
	//Доходы БП
	ОблШапка = Макет.ПолучитьОбласть("ШапкаДоходыБП");
	Если РазделятьНалБезнал Тогда
		ОблШапка.Параметры.Нал = СсылкаНаОбъект.ДоходыБП.Итог("СуммаНал"); 
		ОблШапка.Параметры.Безнал = СсылкаНаОбъект.ДоходыБП.Итог("СуммаБезНал");
	КонецЕсли;
	ОблШапка.Параметры.Итого = СсылкаНаОбъект.ДоходыБП.Итог("СуммаНал") + СсылкаНаОбъект.ДоходыБП.Итог("СуммаБезНал"); 
	ТабДокумент.Вывести(ОблШапка);
	Для каждого стр из СсылкаНаОбъект.ДоходыБП Цикл
		ОблСтрока = Макет.ПолучитьОбласть("СтрокаПолитика");
		ОблСтрока.Параметры.Заполнить(стр);
		ОблСтрока.Параметры.Фонд = стр.ВидДохода;
		ОблСтрока.Параметры.Сумма = стр.СуммаБезнал + стр.СуммаНал;		
		ТабДокумент.Вывести(ОблСтрока);
	КонецЦикла;
	
	//Доходы БП Распределение
	ОблШапка = Макет.ПолучитьОбласть("ШапкаДоходыБП");
	ОблШапка.Параметры.Распределение = "Распределение";
	Если РазделятьНалБезнал Тогда
		ОблШапка.Параметры.Нал = СсылкаНаОбъект.ДоходыБП_Распределение.Итог("СуммаНал"); 
		ОблШапка.Параметры.Безнал = СсылкаНаОбъект.ДоходыБП_Распределение.Итог("СуммаБезНал");
	КонецЕсли;
	ОблШапка.Параметры.Итого = СсылкаНаОбъект.ДоходыБП_Распределение.Итог("СуммаНал") + СсылкаНаОбъект.ДоходыБП_Распределение.Итог("СуммаБезНал"); 
	ТабДокумент.Вывести(ОблШапка);
	Для каждого стр из СсылкаНаОбъект.ДоходыБП_Распределение Цикл
		ОблСтрока = Макет.ПолучитьОбласть("СтрокаПолитика");
		ОблСтрока.Параметры.Заполнить(стр);
		ОблСтрока.Параметры.Фонд = стр.ВидДохода;
		ОблСтрока.Параметры.Сумма = стр.СуммаБезнал + стр.СуммаНал;		
		ТабДокумент.Вывести(ОблСтрока);
	КонецЦикла;

	
	//политика 2
	ОблШапка = Макет.ПолучитьОбласть("ШапкаПолитика");
	ОблШапка.Параметры.НомерСВД = "1";
	ОблШапка.Параметры.Заполнить(СсылкаНаОбъект);
	ОблШапка.Параметры.МаржинальнаяПрибыльИтого = СсылкаНаОбъект.МаржинальнаяПрибыльБезнал + СсылкаНаОбъект.МаржинальнаяПрибыльНал; 
	ТабДокумент.Вывести(ОблШапка);
	Для каждого стр из СсылкаНаОбъект.ПолитикаРаспределения Цикл
		ОблСтрока = Макет.ПолучитьОбласть("СтрокаПолитика");
		ОблСтрока.Параметры.Заполнить(стр);
		ОблСтрока.Параметры.Сумма = стр.СуммаБезнал + стр.СуммаНал;		
		ТабДокумент.Вывести(ОблСтрока);
	КонецЦикла;
	
	//свд2
	ОблШапка = Макет.ПолучитьОбласть("СВД2");
	ОблШапка.Параметры.Заполнить(СсылкаНаОбъект);
	ОблШапка.Параметры.СуммаКРаспределениюИтого = СсылкаНаОбъект.СуммаКРаспределениюБезнал + СсылкаНаОбъект.СуммаКРаспределениюНал;
	ТабДокумент.Вывести(ОблШапка);
	
	//подвал
	ОблШапка = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОблШапка);
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	Возврат ТабДокумент;	
КонецФункции