
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДисконтныеКарты.Ссылка,
	|	ДисконтныеКарты.Владелец
	|ИЗ
	|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|ГДЕ
	|	НЕ ДисконтныеКарты.Ссылка = &Ссылка
	|	И ДисконтныеКарты.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить("Карта " + Объект.Наименование + " уже присвоена контрагенту " + Выборка.Владелец + ". Запись отменена");
		Отказ = Истина;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
