
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаКатегорий.Очистить();
	Для каждого ОписаниеКатегории из Параметры.МассивКатегорий Цикл
		НоваяСтрока = ТаблицаКатегорий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеКатегории);  
	КонецЦикла;
	
	ТаблицаКатегорий.Сортировать("ИДРодителя, Позиция");
	
	СтрокиДерева = ДеревоКатегорий.ПолучитьЭлементы();
	ДобавитьДочерниеКатегории(СтрокиДерева, "0");
	
КонецПроцедуры
 
&НаСервере
Процедура ДобавитьДочерниеКатегории(СтрокиДерева, ИдРодителя)
	
	НС = ТаблицаКатегорий.НайтиСтроки(Новый Структура("ИДРодителя", ИдРодителя));
	Для каждого НСтрока из НС Цикл
		СтрокаДерева = СтрокиДерева.Добавить();	
		ЗаполнитьЗначенияСвойств(СтрокаДерева, НСтрока);
		
		ДобавитьДочерниеКатегории(СтрокаДерева.ПолучитьЭлементы(), СтрокаДерева.ИД);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтрокиДерева = ДеревоКатегорий.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл    
		ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор();
		Элементы.ДеревоКатегорий.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
	
КонецПроцедуры
