//_____________________________________________________________
// ИНТЕРФЕЙС

Функция ПолучитьВходящиеТочки(Точка) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Точка = Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ  разрешенные
    |   ИА_БПТочкиМаршрутаИсходящиеЛинии.Ссылка КАК Точка
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута.ИсходящиеЛинии КАК ИА_БПТочкиМаршрутаИсходящиеЛинии
    |ГДЕ
    |   ИА_БПТочкиМаршрутаИсходящиеЛинии.Адрес = &Адрес
    |   И НЕ ИА_БПТочкиМаршрутаИсходящиеЛинии.Ссылка.ПометкаУдаления";
    Запрос.УстановитьПараметр("Адрес", Точка);
    Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Точка");
    Возврат Результат
КонецФункции

Функция ПолучитьИсходящиеТочки(Точка, Вариант = Неопределено) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Точка = Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ  разрешенные
    |   ИА_БПТочкиМаршрутаИсходящиеЛинии.Адрес
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута.ИсходящиеЛинии КАК ИА_БПТочкиМаршрутаИсходящиеЛинии
    |ГДЕ
    |   ИА_БПТочкиМаршрутаИсходящиеЛинии.Ссылка = &Ссылка
    |   И НЕ ИА_БПТочкиМаршрутаИсходящиеЛинии.Адрес.ПометкаУдаления
    |   И (&Вариант_НО
    |           ИЛИ ИА_БПТочкиМаршрутаИсходящиеЛинии.Вариант = &Вариант)";
    Запрос.УстановитьПараметр("Ссылка", Точка);
    Запрос.УстановитьПараметр("Вариант_НО", НЕ ЗначениеЗаполнено(Вариант));
    Запрос.УстановитьПараметр("Вариант",    Вариант);
    Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Адрес");
    Возврат Результат;
КонецФункции

Функция ВТочкеТребуетсяВыборВарианта(Точка) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Точка = Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    Результат = Точка.Тип = Перечисления.ИА_БПТипыТочекМаршрута.Условие;
    Возврат Результат;
КонецФункции

Функция ПолучитьМассивСобытий(ТипТочки) Экспорт
    Мен = Перечисления.ИА_БПТипыТочекМаршрута;
    МенСобытий  = Перечисления.ИА_БПСобытияТочекБП;
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ТипТочки = мен.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    Результат = Новый Массив;
    
	Если ТипТочки = мен.Условие Тогда
        Результат.Добавить(МенСобытий.Условие_ПроверкаУсловия);
        Результат.Добавить(МенСобытий.ФормированиеНаименования);
        Результат.Добавить(МенСобытий.ФормированиеСодержания);
		Результат.Добавить(МенСобытий.УстановкаОтветственного); 
    ИначеЕсли ТипТочки = мен.Действие Тогда
        Результат.Добавить(МенСобытий.Действие_ПриВыполнении);
        Результат.Добавить(МенСобытий.ФормированиеНаименования);
        Результат.Добавить(МенСобытий.ФормированиеСодержания);
        Результат.Добавить(МенСобытий.УстановкаОтветственного); 
    ИначеЕсли ТипТочки = мен.ВложенныйБизнесПроцесс Тогда
        Результат.Добавить(МенСобытий.ФормированиеНаименования);
        Результат.Добавить(МенСобытий.ФормированиеСодержания);
        Результат.Добавить(МенСобытий.УстановкаОтветственного); 
    КонецЕсли; 
    Возврат Результат;
КонецФункции

Процедура ЗаполнитьЗначенияОбработчиковПоУмолчаниюВТочке(Точка) Экспорт
    //{ Заполним связанную информацию по "Событиям"
    Для каждого СтрокаТЧ Из Точка.Обработчики Цикл
        Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Обработчик) Тогда
            Если Точка.Тип = Перечисления.ИА_БПТипыТочекМаршрута.Условие
                И СтрокаТЧ.Событие = Перечисления.ИА_БПСобытияТочекБП.Условие_ПроверкаУсловия
                Тогда
                СтрокаТЧ.Обработчик = Перечисления.ИА_БПВариантыОбработчиков.Интерактивно;
            Иначе
                СтрокаТЧ.Обработчик = Перечисления.ИА_БПВариантыОбработчиков.Нет;
            КонецЕсли; 
        КонецЕсли; 	
    КонецЦикла; 
КонецПроцедуры

//_____________________________________________________________
