Процедура ЗаполнитьСвязанныеРеквизиты() Экспорт
    Если Тип = Перечисления.ИА_БПТипыТочекМаршрута.Условие Тогда
        НайдСтрока = Обработчики.Найти(Перечисления.ИА_БПСобытияТочекБП.Условие_ПроверкаУсловия, "Событие");
        ПрограммнаяОбработка = НайдСтрока <> Неопределено
        и НайдСтрока.Обработчик <> Перечисления.ИА_БПВариантыОбработчиков.Нет
        и НайдСтрока.Обработчик <> Перечисления.ИА_БПВариантыОбработчиков.Интерактивно;
    Иначе
        ПрограммнаяОбработка = Ложь;
    КонецЕсли;		
КонецПроцедуры
 
//_____________________________________________________________

Процедура ПередЗаписью(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
    
    Если ЗначениеЗаполнено(ДлительностьВыполнения) И НЕ ЗначениеЗаполнено(ВариантДлительности) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не указан ""ВариантДлительности"" в """ + ЭтотОбъект + """!";
        Сообщение.Сообщить(); 
    	Отказ = Истина;
    КонецЕсли; 
    
    Если ЭтоНовый() и НЕ ЗначениеЗаполнено(Ответственный) Тогда
    	Ответственный = Перечисления.ИА_БПТипыАдресацииЗадач.ОтветственныйЗаБП;
    КонецЕсли; 
    
    
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(РеквизитыВложенногоБП
    , "СтрокаТЗ.СпособЗаполнения = Перечисления.ИА_БПСпособыЗаполненияДопРеквизитов.НеИзменять");
    
    
    Если ЭтоУведомление И ЗначениеЗаполнено(ДлительностьВыполнения) Тогда
    	ДлительностьВыполнения = Неопределено;
    КонецЕсли; 
    
    Справочники.ИА_БПТочкиМаршрута.ЗаполнитьЗначенияОбработчиковПоУмолчаниюВТочке(ЭтотОбъект);
    
    Для каждого Стр Из Обработчики Цикл
    	Если Стр.Обработчик <> Перечисления.ИА_БПВариантыОбработчиков.ПрограммныйОбработчик Тогда
        	Стр.Код = "";
        КонецЕсли; 
    КонецЦикла; 
    
    МассивДопустимыхСобытий = Справочники.ИА_БПТочкиМаршрута.ПолучитьМассивСобытий(Тип);
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(Обработчики
    , "Контекст.Найти(СтрокаТЗ.Событие) = Неопределено"
    , МассивДопустимыхСобытий);
    
    ЗаполнитьСвязанныеРеквизиты();
    
    ТЗ = ИсходящиеЛинии.Выгрузить();
    ТЗ.Свернуть("Адрес, Идентификатор, Представление, Вариант");
    
    ИсходящиеЛинии.Загрузить(ТЗ);
    
    ИА_Защита_НФ.ТочкаМаршрута_ОбновитьВарианты(ЭтотОбъект);

    ЛинияДляУсловияИстинно = Неопределено;
    ЛинияДляУсловияЛожно = Неопределено;
    Если Тип = Перечисления.ИА_БПТипыТочекМаршрута.Условие И ИсходящиеЛинии.Количество() = 2 Тогда
        Для каждого СтрокаТЧ Из ИсходящиеЛинии Цикл
            Представление = Врег(СокрЛП(СтрокаТЧ.Представление));
        	Если Представление = "ДА" Тогда
            	ЛинияДляУсловияИстинно = СтрокаТЧ.Вариант;
        	ИначеЕсли Представление = "НЕТ" Тогда
            	ЛинияДляУсловияЛожно   = СтрокаТЧ.Вариант;
            КонецЕсли; 
        КонецЦикла;
        
        Если НЕ ЗначениеЗаполнено(ЛинияДляУсловияИстинно) Тогда
            ИА_БФКС.СообщениеОбОшибке("В условие """ + ЭтотОбъект + """ не найдена ветка ""Да"" !", Отказ); 
        КонецЕсли; 
        
        Если НЕ ЗначениеЗаполнено(ЛинияДляУсловияЛожно) Тогда
            ИА_БФКС.СообщениеОбОшибке("В условие """ + ЭтотОбъект + """ не найдена ветка ""Нет"" !", Отказ); 
        КонецЕсли; 
        //////ЛинияДляУсловияЛожно = Неопределено;
        //////Если ПрограммнаяОбработка Тогда
        //////    Если ЗначениеЗаполнено(ЛинияДляУсловияИстинно) И ЛинияДляУсловияИстинно.Владелец <> Ссылка Тогда
        //////        ЛинияДляУсловияИстинно = Неопределено;
        //////    КонецЕсли; 
        //////    
        //////    Если ЗначениеЗаполнено(ЛинияДляУсловияИстинно) Тогда
        //////        Для каждого СтрокаТЗ Из ИсходящиеЛинии Цикл
        //////            Если СтрокаТЗ.Вариант <> ЛинияДляУсловияИстинно Тогда
        //////                ЛинияДляУсловияЛожно = СтрокаТЗ.Вариант;
        //////                Прервать;
        //////            КонецЕсли; 
        //////        КонецЦикла; 
        //////    КонецЕсли; 
        //////Иначе
        //////    ЛинияДляУсловияИстинно = Неопределено;
        //////КонецЕсли; 
    КонецЕсли; 
    
    Обработчики.Сортировать("Событие"); 
    
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ВыводимыеРеквизиты, "Не ЗначениеЗаполнено(СтрокаТЗ.Реквизит)");
    ИА_БФС.ТЗ_УдалитьДубликаты(ВыводимыеРеквизиты, "Реквизит");
    
    Если Ссылка.ДлительностьВыполнения <> ДлительностьВыполнения
        ИЛИ Ссылка.ВариантДлительности <> ВариантДлительности
        Тогда
        ДополнительныеСвойства.Вставить("ИА_ПересчетБП", Истина);
    КонецЕсли; 
КонецПроцедуры



Процедура ПриЗаписи(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
    
    
        
    Если ДополнительныеСвойства.Свойство("ИА_ПересчетБП")
        И ДополнительныеСвойства.ИА_ПересчетБП
        Тогда
        
        Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИА_БПНоситель.Ссылка) КАК Количество
        |ИЗ
        |	БизнесПроцесс.ИА_БПНоситель КАК ИА_БПНоситель
        |ГДЕ
        |	ИА_БПНоситель.ИА_КартаМаршрутаБП = &ИА_КартаМаршрутаБП
        |	И НЕ ИА_БПНоситель.ПометкаУдаления");
        Запрос.УстановитьПараметр("ИА_КартаМаршрутаБП", Владелец);
        Выборка = Запрос.Выполнить().Выбрать();
        Если Выборка.Следующий() Тогда
            Колво = Выборка.Количество;
        Иначе	
            Колво = 0;
        КонецЕсли; 
        Если Колво > 0 Тогда
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Изменена длительность выполнения ""точки"". Не забудьте пересчитать плановые даты (Через карту маршрута) !";
            Сообщение.Сообщить(); 
            //БизнесПроцессы.ИА_БПНоситель.ПересчитатьПлановыеДаты(Ссылка);    	
        КонецЕсли; 
    КонецЕсли;      
КонецПроцедуры

