
&НаКлиенте
Процедура ВыполнитьСинхронизацию(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НастройкаСинхронизации", ТекущиеДанные.Ссылка);
		ПараметрыФормы.Вставить("ВидСинхронизации"		, 2);
		
		ОткрытьФорму("Справочник.НастройкиСинхронизацииСБитрикс24.Форма.ФормаВыполнениеСинхронизации", ПараметрыФормы,, ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры
