#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровИУслуг";
    КомандаПечати.Идентификатор = "Акт";
    КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровИУслуг";
    КомандаПечати.Идентификатор = "СчетФактура";
    КомандаПечати.Представление = НСтр("ru = 'Счет-фактура'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровИУслуг";
    КомандаПечати.Идентификатор = "ТоварнаяНакладнаяСУслугами";
    КомандаПечати.Представление = НСтр("ru = 'Товарная накладная с услугами'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровИУслуг";
    КомандаПечати.Идентификатор = "ТоварнаяНакладная";
    КомандаПечати.Представление = НСтр("ru = 'Товарная накладная'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	Если Константы.ТелефонияСтрана.Получить() = Справочники.СтраныМира.Литва Тогда
		КомандаПечати = КомандыПечати.Добавить();
    	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровИУслуг";
    	КомандаПечати.Идентификатор = "ТоварнаяНакладнаяЛитва";
    	КомандаПечати.Представление = НСтр("ru = 'Товарная накладная (Литва)'");
	КонецЕсли;
	
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровИУслуг";
    КомандаПечати.Идентификатор = "ТОРГ12";
    КомандаПечати.Представление = НСтр("ru = 'ТОРГ-12'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровИУслуг";
    КомандаПечати.Идентификатор = "УПД";
    КомандаПечати.Представление = НСтр("ru = 'Универсальный передаточный документ'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ12") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ТОРГ12", 
			НСтр("ru = 'ТОРГ-12'"), 
			ТОРГ12(МассивОбъектов, ОбъектыПечати), , "Документ.РеализацияТоваровИУслуг.ПФ_MXL_ТОРГ12");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"Акт", 
			НСтр("ru = 'Акт об оказании услуг'"), 
			ПечатьАкта(МассивОбъектов, ОбъектыПечати), , "Документ.РеализацияТоваровИУслуг.ПФ_MXL_Акт");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УПД") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"УПД", 
			НСтр("ru = 'Универсальный передаточный документ'"), ПечатьУПД(МассивОбъектов, ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"СчетФактура", 
			НСтр("ru = 'Счет-фактура'"), 
			ПечатьСчетФактуры(МассивОбъектов, ОбъектыПечати));	
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварнаяНакладная") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ТоварнаяНакладная", 
			НСтр("ru = 'Товарная накладная'"), 
			СформироватьПечатнуюФормуТоварнойНакладной(МассивОбъектов, ОбъектыПечати, Ложь), 
			, 
			"Документ.РеализацияТоваровИУслуг.ПФ_MXL_ТоварнаяНакладная");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварнаяНакладнаяСУслугами") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ТоварнаяНакладнаяСУслугами", 
			НСтр("ru = 'Товарная накладная с услугами'"), 
			СформироватьПечатнуюФормуТоварнойНакладной(МассивОбъектов, ОбъектыПечати, Истина), 
			, 
			"Документ.РеализацияТоваровИУслуг.ПФ_MXL_ТоварнаяНакладная");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварнаяНакладнаяЛитва") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ТоварнаяНакладнаяЛитва", 
			НСтр("ru = 'Товарная накладная (Литва)'"), 
			СформироватьПечатнуюФормуТоварнойНакладнойЛитва(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, ВключатьТовары = Истина, ВключатьУслуги = Истина) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВключатьТовары", ВключатьТовары);
	Запрос.УстановитьПараметр("ВключатьУслуги", ВключатьУслуги);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());
	Запрос.Текст = 	
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеДокумента.Ссылка КАК Ссылка,
    |	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления,
    |	ДанныеДокумента.Номер КАК Номер,
    |	ДанныеДокумента.Дата КАК Дата,
	|	""01.01.2001"" КАК ДатаДокумента,
    |	ДанныеДокумента.Проведен КАК Проведен,
    |	ДанныеДокумента.Склад КАК Склад,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.АдресДоставки КАК АдресДоставки,
	|	ДанныеДокумента.АдресМонтажа КАК АдресМонтажа,
    |	ДанныеДокумента.ВидЦен КАК ВидЦен,
    |	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |	ДанныеДокумента.Комментарий КАК Комментарий,
    |	ДанныеДокумента.Контрагент КАК Контрагент,
    |	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
    |	ДанныеДокумента.Автор КАК Автор,
    |	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Организация.ПолноеНаименование = """"
	|			ТОГДА ДанныеДокумента.Организация.ПолноеНаименование
	|		ИНАЧЕ ДанныеДокумента.Организация.Наименование
	|	КОНЕЦ КАК ПредставлениеОрганизации,
    |	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
    |	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
    |	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.БИК КАК БанковскийСчетБИК,
    |	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
    |	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
	|	ДанныеДокумента.Организация.ИдентификационныйНомерПлательщикаЕвропейскогоНДС КАК ИдентификационныйНомерПлательщикаЕвропейскогоНДС,
    |	ДанныеДокумента.Организация.ИНН КАК ИНН,
    |	ДанныеДокумента.Организация.КПП КАК КПП,
    |	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
	|	ДанныеДокумента.Организация.СтавкаНДСПоУмолчанию КАК СтавкаНДС,
	|	ДанныеДокумента.Организация.ЯвляетсяПлательщикомНДС КАК ОрганизацияЯвляетсяПлательщикомНДС,
    |	ВЫБОР
    |		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
    |			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
    |		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
    |	КОНЕЦ КАК КонтрагентНаименованиеПолное,
	 |	ВЫБОР
    |		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
    |			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
    |		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
    |	КОНЕЦ КАК ПредставлениеКонтрагента,
    |	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.Контрагент.ИдентификационныйНомерПлательщикаЕвропейскогоНДС КАК КонтрагентИдентификационныйНомерПлательщикаЕвропейскогоНДС,
    |	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.НомерСчета КАК КонтрагентБанковскийСчетНомерСчета,
    |	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.БИК КАК КонтрагентБанковскийСчетБИК,
    |	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.КоррСчет КАК КонтрагентБанковскийСчетКоррСчет,
    |	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.НаименованиеБанка КАК КонтрагентБанковскийСчетНаименованиеБанка,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.Руководитель.Должность
    |		ИНАЧЕ ДанныеДокумента.Руководитель.Должность
    |	КОНЕЦ КАК ДолжностьРуководителя,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.Руководитель.РасшифровкаПодписи
	//++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Руководитель)
	|		ИНАЧЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОРуководителя,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.ГлавныйБухгалтер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Организация.ГлавныйБухгалтер.РасшифровкаПодписи
	//++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.ГлавныйБухгалтер)
	|		ИНАЧЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОГлавБухгалтера,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Автор.Сотрудник.Должность
    |		ИНАЧЕ ДанныеДокумента.Отпустил.Должность
    |	КОНЕЦ КАК ДолжностьКладовщика,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА ДанныеДокумента.Автор.Сотрудник.РасшифровкаПодписи
	//++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Отпустил)
	|		ИНАЧЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОКладовщика,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ДанныеДокумента.Основание.Дата КАК ДатаОснования,
	|	""01.01.2001"" КАК ДатаДокументаОснования,
	|	ДанныеДокумента.Основание.Номер КАК НомерОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ""Заказ покупателя""
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказДоговор
	|			ТОГДА ""Заказ-договор""
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ПоступлениеТоваровИУслуг
	|			ТОГДА ""Поступление товаров и услуг""
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ПеремещениеТоваров
	|			ТОГДА ""Перемещение товаров""
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|			ТОГДА ""Заказ на производство""
	|	КОНЕЦ КАК ВидОснования,
	|	ДанныеДокумента.СуммаБонусовКСписанию КАК СуммаБонусовКСписанию,
	|	ДанныеДокумента.СуммаБонусовКСписаниюПоДисконтнойКарте КАК БонусовСписано,
	|	ДанныеДокумента.СуммаБонусовКНачислениюПоДисконтнойКарте КАК БонусовНачислено,
	|	ЕСТЬNULL(БонусыКонтрагентовОстатки.СуммаОстаток, 0) КАК БонусОстатки,
	|	ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК ДолгПоРеализации,
	|	ДанныеДокумента.СуммаДокумента - ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК ОплаченоПоРеализации,
	|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК ТекущийДолг,
	|	0 КАК ДолгКонтрагентаНаДатуДокумента,
	|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК ДолгКонтрагентаНаТекущуюДату,
	|	0 КАК ОстатокБонусовКонтрагентаНаДатуДокумента,
	|	0 КАК ОстатокБонусовКонтрагентаНаТекущуюДату,
	|	КонстантаВалютаУчета.Значение КАК ВалютаУчета,
	|	0 КАК ИтогоВес,
	|	0 КАК КоличествоПозиций,
	|	0 КАК ИтогоСумма,
	|	0 КАК ИтогоСуммаНДС,
    |	0 КАК ИтогоСуммаБезНДС,
	|	""текст расшифровки НДС"" КАК НДС
    |ИЗ
    |	Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БонусыКонтрагентов.Остатки КАК БонусыКонтрагентовОстатки
	|		ПО ДанныеДокумента.Контрагент = БонусыКонтрагентовОстатки.Контрагент
	|			И ДанныеДокумента.ДисконтнаяКарта = БонусыКонтрагентовОстатки.ДисконтнаяКарта
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|		ПО ДанныеДокумента.Ссылка = РасчетыПоЗаказамОстатки.Заказ
	|			И ДанныеДокумента.Контрагент = РасчетыПоЗаказамОстатки.Контрагент
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ 
	|							ВзаиморасчетыОстатки.Организация,
	|							ВзаиморасчетыОстатки.Контрагент, 
	|							СУММА(ВзаиморасчетыОстатки.СуммаОстаток) КАК СуммаОстаток
	|						ИЗ
	|							РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыОстатки
	|						СГРУППИРОВАТЬ ПО
	|							Организация, 
	|							Контрагент
	|						) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ПО ДанныеДокумента.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
	|			И ДанныеДокумента.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация
	
	|	, Константа.ВалютаУчета КАК КонстантаВалютаУчета
    |ГДЕ
    |	ДанныеДокумента.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	""Товары"" КАК ИмяТЧ,
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ВЫБОР
    |		КОГДА &КолонкаАртикул
    |			ТОГДА ДанныеТабличнойЧасти.Номенклатура.Артикул
    |		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Код
    |	КОНЕЦ КАК Код,
    |	ДанныеТабличнойЧасти.Номенклатура.Артикул КАК Артикул,
    |	ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
    |	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ДанныеТабличнойЧасти.СерияНоменклатуры КАК СерияНоменклатуры,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ДанныеТабличнойЧасти.Цена КАК Цена,
    |	ДанныеТабличнойЧасти.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
    |	ДанныеТабличнойЧасти.Сумма КАК Сумма,
    |	ДанныеТабличнойЧасти.СтавкаНДС КАК СтавкаНДС,
    |	ДанныеТабличнойЧасти.СуммаНДС КАК СуммаНДС,
    |	ДанныеТабличнойЧасти.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
    |	ДанныеТабличнойЧасти.Количество * ДанныеТабличнойЧасти.Цена КАК СуммаБезСкидки,
    |	ДанныеТабличнойЧасти.Количество * ДанныеТабличнойЧасти.Цена - ДанныеТабличнойЧасти.Сумма КАК Скидка,
    |	ДанныеТабличнойЧасти.Сумма - ДанныеТабличнойЧасти.СуммаНДС КАК СуммаБезНДС,
    |	ДанныеТабличнойЧасти.Сумма КАК СуммаСНДС,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеТабличнойЧасти.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерений)
	|			ТОГДА ДанныеТабличнойЧасти.ЕдиницаИзмерения.Вес * ДанныеТабличнойЧасти.Количество
	|		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Вес * ДанныеТабличнойЧасти.Количество
	|	КОНЕЦ КАК Вес,
	|	ДанныеТабличнойЧасти.Потолок КАК Потолок
    |ПОМЕСТИТЬ ВТ_ДанныеТабличнойЧасти
    |ИЗ
    |	Документ.РеализацияТоваровИУслуг.Товары КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
	|	И &ВключатьТовары
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	""Услуги"",
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки,
    |	ВЫБОР
    |		КОГДА &КолонкаАртикул
    |			ТОГДА ДанныеТабличнойЧасти.Номенклатура.Артикул
    |		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Код
    |	КОНЕЦ,
    |	ДанныеТабличнойЧасти.Номенклатура.Артикул,
    |	ДанныеТабличнойЧасти.Номенклатура,
    |	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры,
    |	NULL,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент,
    |	ДанныеТабличнойЧасти.Количество,
    |	ДанныеТабличнойЧасти.Цена,
    |	ДанныеТабличнойЧасти.СуммаРучнойСкидки,
    |	ДанныеТабличнойЧасти.Сумма,
    |	ДанныеТабличнойЧасти.СтавкаНДС,
    |	ДанныеТабличнойЧасти.СуммаНДС,
    |	ДанныеТабличнойЧасти.ПроцентРучнойСкидки,
    |	ДанныеТабличнойЧасти.Количество * ДанныеТабличнойЧасти.Цена,
    |	ДанныеТабличнойЧасти.Количество * ДанныеТабличнойЧасти.Цена - ДанныеТабличнойЧасти.Сумма,
    |	ДанныеТабличнойЧасти.Сумма - ДанныеТабличнойЧасти.СуммаНДС,
    |	ДанныеТабличнойЧасти.Сумма,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения.Код,
	|	0,
	|	ДанныеТабличнойЧасти.Потолок КАК Потолок
    |ИЗ
    |	Документ.РеализацияТоваровИУслуг.Услуги КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
	|	И &ВключатьУслуги
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ВТ_ДанныеТабличнойЧасти.ИмяТЧ КАК ИмяТЧ,
    |	ВТ_ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ВТ_ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ВТ_ДанныеТабличнойЧасти.Код КАК Код,
    |	ВТ_ДанныеТабличнойЧасти.Артикул КАК Артикул,
    |	ВТ_ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
    |	ВТ_ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ВТ_ДанныеТабличнойЧасти.СерияНоменклатуры КАК СерияНоменклатуры,
    |	ВТ_ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ВТ_ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ВТ_ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ВТ_ДанныеТабличнойЧасти.Цена КАК Цена,
    |	ВТ_ДанныеТабличнойЧасти.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
    |	ВТ_ДанныеТабличнойЧасти.Сумма КАК Сумма,
    |	ВТ_ДанныеТабличнойЧасти.СтавкаНДС КАК СтавкаНДС,
    |	ВТ_ДанныеТабличнойЧасти.СуммаНДС КАК СуммаНДС,
    |	ВТ_ДанныеТабличнойЧасти.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
    |	ВТ_ДанныеТабличнойЧасти.СуммаБезСкидки КАК СуммаБезСкидки,
    |	ВТ_ДанныеТабличнойЧасти.Скидка КАК Скидка,
    |	ВТ_ДанныеТабличнойЧасти.СуммаБезНДС КАК СуммаБезНДС,
    |	ВТ_ДанныеТабличнойЧасти.СуммаСНДС КАК СуммаСНДС,
    |	ВТ_ДанныеТабличнойЧасти.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	ВТ_ДанныеТабличнойЧасти.Вес КАК Вес,
	|	ВТ_ДанныеТабличнойЧасти.Потолок КАК Потолок
    |ИЗ
    |	ВТ_ДанныеТабличнойЧасти КАК ВТ_ДанныеТабличнойЧасти
    |
    |УПОРЯДОЧИТЬ ПО
    |	ВТ_ДанныеТабличнойЧасти.Ссылка,
    |	ВТ_ДанныеТабличнойЧасти.ИмяТЧ,
    |	ВТ_ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ
	|	КОЛИЧЕСТВО(НомерСтроки),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	СУММА(Вес)
	|ПО
    |	Ссылка";    
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	                                               РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
    
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварамУслугам = Неопределено) Экспорт
	
	//РезультатЗапроса.Колонки.Добавить("ДатаДокумента");
	РезультатЗапроса.Колонки.Добавить("ИтогоТоваровУслуг", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10, 0)));
	РезультатЗапроса.Колонки.Добавить("ИтогоСуммаТоваровУслуг", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ТекущаяСтрока.ДатаДокумента = Формат(ТекущаяСтрока.Дата, "ДЛФ=Д");
		ТекущаяСтрока.ДатаДокументаОснования = Формат(ТекущаяСтрока.ДатаОснования, "ДЛФ=Д");
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
		Попытка
			ТекущаяСтрока.НомерОснования = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.НомерОснования);
		Исключение
		КонецПопытки;
		
		ТекущаяСтрока.ОстатокБонусовКонтрагентаНаДатуДокумента = БонусыСервер.ОстатокБонусов(ТекущаяСтрока.Контрагент, ТекущаяСтрока.Дата);
		ТекущаяСтрока.ОстатокБонусовКонтрагентаНаТекущуюДату = БонусыСервер.ОстатокБонусов(ТекущаяСтрока.Контрагент);
		ТекущаяСтрока.ДолгКонтрагентаНаДатуДокумента = ОбщийМодульСервер.ДолгКонтрагента(ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент, ТекущаяСтрока.Дата);
		
		Если НЕ ВыборкаПоТоварамУслугам = Неопределено Тогда
			ИтогоТоваровУслуг = 0;
			ИтогоСуммаТоваровУслуг = 0;
			//ИтогоСуммаНДС = 0;
			СтруктураПоиска = Новый Структура("Ссылка", ТекущаяСтрока.Ссылка);
			ВыборкаПоТоварамУслугам.Сбросить();
			Если ВыборкаПоТоварамУслугам.НайтиСледующий(СтруктураПоиска) Тогда				
				Выборка = ВыборкаПоТоварамУслугам.Выбрать();
				Пока Выборка.Следующий() Цикл					 
					ИтогоТоваровУслуг = ИтогоТоваровУслуг + 1;
					ИтогоСуммаТоваровУслуг = ИтогоСуммаТоваровУслуг + Выборка.Сумма;
					//ИтогоСуммаНДС = ИтогоСуммаНДС + Выборка.СуммаНДС;
				КонецЦикла;
				
				ТекущаяСтрока.ИтогоСумма = ВыборкаПоТоварамУслугам.Сумма;
				ТекущаяСтрока.ИтогоСуммаНДС = ВыборкаПоТоварамУслугам.СуммаНДС;
				ТекущаяСтрока.ИтогоВес = ВыборкаПоТоварамУслугам.Вес;
				ТекущаяСтрока.КоличествоПозиций = ВыборкаПоТоварамУслугам.НомерСтроки;
			КонецЕсли;						
			ТекущаяСтрока.ИтогоТоваровУслуг = ИтогоТоваровУслуг;
			ТекущаяСтрока.ИтогоСуммаТоваровУслуг = ИтогоСуммаТоваровУслуг;
			//ТекущаяСтрока.ИтогоСуммаНДС = ИтогоСуммаНДС;
			ТекущаяСтрока.ИтогоСуммаБезНДС = ИтогоСуммаТоваровУслуг - ТекущаяСтрока.ИтогоСуммаНДС;			
			
		КонецЕсли;
		
		Если ТекущаяСтрока.ИтогоСуммаНДС = 0 Тогда			
			ТекущаяСтрока.НДС = "Без налога (НДС)";		
		Иначе			
			ТекущаяСтрока.НДС = "В том числе НДС:";	
		КонецЕсли;
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);
	КонецЦикла;
	
КонецПроцедуры

Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_АКТ";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровИУслуг.ПФ_MXL_АКТ");
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, Ложь);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоУслугам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоУслугам);
	
	// Изменения размера колоноки, в зависимости от вывода Артикула
	Если Не ВыводитьАртикул Тогда
		Попытка
			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		Исключение
		КонецПопытки;
	КонецЕсли;
		
    ПервыйДокумент = Истина;	
    Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
        Если Не ПервыйДокумент Тогда
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		/////////////////////////////////////////////
		ТекстЗаголовка = "Акт об оказании услуг №" + ДанныеПечати.Номер + " от " + ДанныеПечати.ДатаДокумента;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			Исключение
			КонецПопытки;
			
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
				ТабличныйДокумент,
				Макет,
				ОбластьМакета,
				ДанныеПечати.Ссылка);
				
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		НомерСтроки = 1;
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоУслугам.Сбросить();
		Если ВыборкаПоУслугам.НайтиСледующий(СтруктураПоиска) Тогда				
			Выборка = ВыборкаПоУслугам.Выбрать();
			Пока Выборка.Следующий() Цикл				
				Попытка
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					
					//++ №12909
					//ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
					ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);
					//-- №12909
					
					ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					
					НомерСтроки = НомерСтроки + 1;
				Исключение
				КонецПопытки;
			КонецЦикла;		
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Всего = ДанныеПечати.ИтогоСуммаТоваровУслуг;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			Если ДанныеПечати.БонусовСписано = 0 И ДанныеПечати.БонусОстатки = 0 Тогда
				//пропускаем
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Бонусы");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований " + ДанныеПечати.ИтогоТоваровУслуг + ", на сумму " + Формат(ДанныеПечати.ИтогоСуммаТоваровУслуг, "ЧДЦ=2") + " " + ДанныеПечати.Валюта;
			Исключение
			КонецПопытки;
			Попытка
				ОбластьМакета.Параметры.СуммаПрописью = РаботаСВалютой.СформироватьЧислоПрописью(ДанныеПечати.ИтогоСуммаТоваровУслуг, ДанныеПечати.Валюта, Ложь);
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
				
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
    КонецЦикла;
    Возврат ТабличныйДокумент;
	
КонецФункции

Функция ТОРГ12(МассивОбъектов, ОбъектыПечати)
	
	Возврат ОбщийМодульСервер.ПечатьТОРГ12(МассивОбъектов, ОбъектыПечати);
	
КонецФункции

Функция ПечатьУПД(МассивОбъектов, ОбъектыПечати)
	
	Возврат Документы.СчетФактураВыданный.ПечатьУПД(МассивОбъектов, ОбъектыПечати);
	
КонецФункции

Функция ПечатьСчетФактуры(МассивОбъектов, ОбъектыПечати)
	
	Возврат Документы.СчетФактураВыданный.ПечатьСчетФактуры(МассивОбъектов, ОбъектыПечати);
	
КонецФункции

Функция СформироватьПечатнуюФормуТоварнойНакладной(МассивОбъектов, ОбъектыПечати, ВключатьУслуги=Истина) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ТоварнаяНакладная";
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, Истина, ВключатьУслуги);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
    
    ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровИУслуг.ПФ_MXL_ТоварнаяНакладная");
        Если Не ПервыйДокумент Тогда
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
				ТабличныйДокумент,
				Макет,
				ОбластьМакета,
				ДанныеПечати.Ссылка);
				
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Получатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//добавим адрес доставки, если поле не пустое		
		Попытка
			Если НЕ ПустаяСтрока(ДанныеПечати.АдресДоставки) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("АдресДоставки");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		//добавим адрес монтажа, если поле не пустое		
		Попытка
			Если НЕ ПустаяСтрока(ДанныеПечати.АдресМонтажа) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("АдресМонтажа");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);		
		Исключение
		КонецПопытки;
		
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.Основание) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Основание");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		// Изменения размера колонки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);			
		Исключение
		КонецПопытки;
		
		//Сумма = 0;
		//Количество = 0;
		
		НомерСтроки = 1;
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоТоварам.Сбросить();
		
		Если НЕ ВключатьУслуги Тогда
			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда				
				Выборка = ВыборкаПоТоварам.Выбрать();
				Пока Выборка.Следующий() Цикл
					Попытка
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Если ВыводитьАртикул Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(Выборка);
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;
						
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						
						//++ №12909
						//ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
						ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);
						//-- №12909
						
						ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
						ТабличныйДокумент.Присоединить(ОбластьМакета);

					Исключение
					КонецПопытки;		
				КонецЦикла;
			КонецЕсли;
		Иначе
			// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату
			ВариантФормированияПФ = Константы.ВариантФормированияПФРТИУ.Получить();
		
			МассивДопРеквизитов = Новый Массив;
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Артикул", 			Новый ОписаниеТипов("Строка")));
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Вес", 				Новый ОписаниеТипов("Число")));
		
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ВидНоменклатуры", 	Новый ОписаниеТипов("Число")));
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЕстьПотолок", 		Новый ОписаниеТипов("Число")));
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЭтоПотолок", 			Новый ОписаниеТипов("Булево")));
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "НомерСтрокиПотолка", 	Новый ОписаниеТипов("Число")));
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ГруппаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"))); //#12807

			ТаблицаТоварыИУслуги = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("РеализацияТоваровИУслуг", "Товары", МассивДопРеквизитов);
			
			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
				Выборка = ВыборкаПоТоварам.Выбрать();			
				Пока Выборка.Следующий() Цикл
					ТекущаяСтрока = ТаблицаТоварыИУслуги.Добавить();
					ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
					
					Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
						ТекущаяСтрока.ВидНоменклатуры = 1;
						ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
						ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
						ТекущаяСтрока.ЭтоПотолок = Истина;
						
					ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
						ТекущаяСтрока.ВидНоменклатуры = 3;
					Иначе
						ТекущаяСтрока.ВидНоменклатуры = 2;
					КонецЕсли;
					Если ТекущаяСтрока.Потолок.Пустая() Тогда
						ТекущаяСтрока.ЕстьПотолок = 2;
					Иначе
						ТекущаяСтрока.ЕстьПотолок = 1;
					КонецЕсли;
					
					ТекущаяСтрока.ГруппаНоменклатуры = ТекущаяСтрока.Номенклатура.Родитель; //#12807
				КонецЦикла;
			КонецЕсли;			
			
			ОтступНоменклатуры = "";
			
			//0. Потолок - товар - услуга - потолок - товар - услуга
			//1. Потолок, Потолок, Товары, Товары, услуги, услуги
			//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются) - услуга (все одинаковые позиции сворачиваются)
			//3. Без группировок
			//4. По группам номенклатуры
			//5. По группам номенклатуры (одинаковые позиции объединяются)
			Если ВариантФормированияПФ = 0 Тогда
				ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");		
			ИначеЕсли ВариантФормированияПФ = 1 Тогда
				ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
			ИначеЕсли ВариантФормированияПФ = 2 Тогда
				ТаблицаТоварыИУслуги.Свернуть("Артикул, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, ВидНоменклатуры", "Количество, Сумма, СуммаРучнойСкидки");
				ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
			ИначеЕсли ВариантФормированияПФ = 3 Тогда	
				//не сортируем
			ИначеЕсли ВариантФормированияПФ = 4 Тогда
				ОтступНоменклатуры = "   ";
				ТаблицаТоварыИУслуги.Сортировать("ГруппаНоменклатуры");
			//++ №13374
			ИначеЕсли ВариантФормированияПФ = 5 Тогда
				ТаблицаТоварыИУслуги.Свернуть("Артикул, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, ГруппаНоменклатуры", "Количество, Сумма, СуммаРучнойСкидки");
				ОтступНоменклатуры = "   ";
				ТаблицаТоварыИУслуги.Сортировать("ГруппаНоменклатуры");
			//-- №13374
			КонецЕсли;
			
			НомерСтроки = 1;
			ТекущаяГруппа = Неопределено;
		
			Для каждого Выборка из ТаблицаТоварыИУслуги Цикл 
				
				//#12807
				Если ВариантФормированияПФ = 4
					Или ВариантФормированияПФ = 5 // №13374
				Тогда
					Если НЕ ТекущаяГруппа = Выборка.ГруппаНоменклатуры Тогда
						ТекущаяГруппа = Выборка.ГруппаНоменклатуры;
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
						ТабличныйДокумент.Вывести(ОбластьМакета);
						Если ВыводитьАртикул Тогда						
							ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;					
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
						ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ?(ТекущаяГруппа.Пустая(), "<...>", ТекущаяГруппа);
						
						ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
						ШрифтПотолка = Новый Шрифт(ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
						ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
						
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;
				КонецЕсли;
				
				ДопДанныеСтроки = Новый Структура("НомерСтроки", НомерСтроки);
				
				Попытка
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ОбластьМакета.Параметры.Заполнить(ДопДанныеСтроки);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;	
					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					СтолбецНоменклатуры = 1; // номер столбца в текущей области
					Если ВариантФормированияПФ = 0 И Выборка.ВидНоменклатуры = 1 Тогда
						ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1, СтолбецНоменклатуры, 1, СтолбецНоменклатуры);
						ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
						ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
					ИначеЕсли ВариантФормированияПФ = 0 и НЕ Выборка.Потолок.Пустая() Тогда
						ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1, СтолбецНоменклатуры, 1, СтолбецНоменклатуры);
						ОбластьМакета.ТекущаяОбласть.Отступ = 2;
					КонецЕсли;
					
					//++ №12909
					//Попытка
					//	ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
					//Исключение
					//	ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура);
					//КонецПопытки;
					ПредставлениеНоменклатуры = ОтступНоменклатуры + ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);
					//-- №12909
					
					ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
					ТабличныйДокумент.Присоединить(ОбластьМакета);					
					
				Исключение			
				КонецПопытки;
				
				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
		КонецЕсли; //Если НЕ ВключатьУслуги Тогда
		
		ПрефиксОбласти = ?(ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС, "ИтогоНДС", "Итого");
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть(ПрефиксОбласти + "|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть(ПрефиксОбласти + "|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть(ПрефиксОбласти + "|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка 
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВсегоИПрописью");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				ОбластьМакета.Параметры.ИтогоСуммаПрописью = 
					РаботаСВалютой.СформироватьЧислоПрописьюВсп(ДанныеПечати.ИтогоСумма, ДанныеПечати.Валюта, "Л=ru_RU;ДП=Ложь");
			Исключение
			КонецПопытки;		
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			Если ДанныеПечати.БонусовСписано = 0 И ДанныеПечати.БонусовСписано = 0 И ДанныеПечати.БонусОстатки = 0 Тогда
				//пропускаем
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Бонусы");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;
			
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Долг");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати); 	
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);		
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуТоварнойНакладнойЛитва(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ТоварнаяНакладнаяЛитва";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровИУслуг.ПФ_MXL_ТоварнаяНакладнаяЛитва");
	
	//СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	//ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	//ВыборкаПоТоварамУслугам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварамУслугам);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДляПечатиТоварнойНакладной();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента,"ДФ=yyyy-MM-dd");
		//Попытка
		//	ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		//Исключение
		//КонецПопытки;
		ТекущаяСтрока.ИтогоСуммаНДС = ТекущаяСтрока.Товары.Итог("СуммаНДС") + ТекущаяСтрока.Услуги.Итог("СуммаНДС");
		ТекущаяСтрока.ИтогоСуммаБезНДС = ТекущаяСтрока.СуммаДокумента - ТекущаяСтрока.ИтогоСуммаНДС;
	КонецЦикла;
    
    ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из РезультатЗапроса Цикл
		Если Не ПервыйДокумент Тогда
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		// подготовим табличную часть в зависимости от варианта формирования ПФ 
		ВариантФормированияПФРТИУ = Константы.ВариантФормированияПФРТИУ.Получить();
		ТаблицаТоварыИУслуги = ДанныеПечати.Товары.Скопировать();
		ТаблицаТоварыИУслуги.Колонки.Добавить("ВидНоменклатуры");
		ТаблицаТоварыИУслуги.Колонки.Добавить("ЕстьПотолок");
		
		Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
				ТекущаяСтрока.ВидНоменклатуры = 1;
			Иначе
				ТекущаяСтрока.ВидНоменклатуры = 2;
			КонецЕсли;
			Если ТекущаяСтрока.Потолок.Пустая() Тогда
				ТекущаяСтрока.ЕстьПотолок = 2;
			Иначе
				ТекущаяСтрока.ЕстьПотолок = 1;
			КонецЕсли;
			
			ТекущаяСтрока.СтавкаНДСЧислом = УчетНДС.ПолучитьСтавкуНДС(ТекущаяСтрока.СтавкаНДС);
			ТекущаяСтрока.ЦенаБезНДС = ТекущаяСтрока.Цена - УчетНДС.РассчитатьСуммуНДС(ТекущаяСтрока.Цена, ТекущаяСтрока.СуммаНДС > 0, , ТекущаяСтрока.СтавкаНДСЧислом);
			
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из ДанныеПечати.Услуги Цикл
			НоваяСтрока = ТаблицаТоварыИУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ВидНоменклатуры = 3;
			Если ТекущаяСтрока.Потолок.Пустая() Тогда
				НоваяСтрока.ЕстьПотолок = 2;
			Иначе
				НоваяСтрока.ЕстьПотолок = 1;
			КонецЕсли;
		КонецЦикла;
		
		//0. Потолок - товар - услуга - потолок - товар - услуга
		//1. Потолок, Потолок, Товары, Товары, услуги, услуги
		//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются)
		//3. Без группировок
		Если ВариантФормированияПФРТИУ = 0 Тогда
			ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");		
		ИначеЕсли ВариантФормированияПФРТИУ = 1 Тогда
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
		ИначеЕсли ВариантФормированияПФРТИУ = 2 Тогда
			ТаблицаТоварыИУслуги.Свернуть("Номенклатура, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, ВидНоменклатуры", "Количество, Сумма, СуммаРучнойСкидки");
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
		ИначеЕсли ВариантФормированияПФРТИУ = 3 Тогда	
			//не сортируем
		КонецЕсли;
		
		Сумма = 0;
		Количество = 0;
		НомерСтроки = 1;
		Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл //Шапка.Товары Цикл
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
				
				Если ВариантФормированияПФРТИУ = 0 И ТекущаяСтрока.ВидНоменклатуры = 1 Тогда
					ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,4,1,4);
					ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
					ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
				ИначеЕсли ВариантФормированияПФРТИУ = 0 и НЕ ТекущаяСтрока.Потолок.Пустая() Тогда
					//ОбластьМакета.Параметры.Отступ = "  ";
					ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,4,1,4);
					ОбластьМакета.ТекущаяОбласть.Отступ = 2;
				КонецЕсли;
				
				//++ №12909
				//Попытка
				//	ПредставлениеНоменклатуры = Строка(ТекущаяСтрока.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(ТекущаяСтрока.ХарактеристикаНоменклатуры));
				//Исключение
				//	ПредставлениеНоменклатуры = Строка(ТекущаяСтрока.Номенклатура);
				//КонецПопытки;
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры);
				//-- №12909
				
				ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
				Попытка
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				Исключение
				КонецПопытки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				НомерСтроки = НомерСтроки + 1;			
				Количество = Количество + ТекущаяСтрока.Количество;
				Сумма = Сумма + ТекущаяСтрока.Сумма;
			Исключение			
			КонецПопытки;		
		КонецЦикла;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);				
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ТекстЗапросаДляПечатиТоварнойНакладной() Экспорт
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровИУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровИУслуг.Номер КАК Номер,
	|	РеализацияТоваровИУслуг.Дата КАК ДатаДокумента,
	|	""01.01.2001"" КАК Дата,
	|	РеализацияТоваровИУслуг.Склад КАК Склад,
	|	РеализацияТоваровИУслуг.Валюта КАК Валюта,
	|	РеализацияТоваровИУслуг.АдресДоставки КАК АдресДоставки,
	|	РеализацияТоваровИУслуг.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровИУслуг.Организация.ПолноеНаименование = """"
	|			ТОГДА РеализацияТоваровИУслуг.Организация.ПолноеНаименование
	|		ИНАЧЕ РеализацияТоваровИУслуг.Организация.Наименование
	|	КОНЕЦ КАК ПредставлениеОрганизации,
	|	РеализацияТоваровИУслуг.Организация.ОсновнойБанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
	|	РеализацияТоваровИУслуг.Организация.ОсновнойБанковскийСчет.БИК КАК БанковскийСчетБИК,
	|	РеализацияТоваровИУслуг.Организация.ОсновнойБанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
	|	РеализацияТоваровИУслуг.Организация.ОсновнойБанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
	|	РеализацияТоваровИУслуг.Организация.ИдентификационныйНомерПлательщикаЕвропейскогоНДС КАК ИдентификационныйНомерПлательщикаЕвропейскогоНДС,
	|	РеализацияТоваровИУслуг.Организация.ИНН КАК ИНН,
	|	РеализацияТоваровИУслуг.Организация.КПП КАК КПП,
	//|	РеализацияТоваровИУслуг.Организация.ЮридическийАдрес КАК ЮридическийАдрес,
	|	РеализацияТоваровИУслуг.Организация.СтавкаНДСПоУмолчанию КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровИУслуг.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровИУслуг.Организация.Руководитель.РасшифровкаПодписи
	//++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ РеализацияТоваровИУслуг.Отпустил.РасшифровкаПодписи = """"
	//|			ТОГДА РеализацияТоваровИУслуг.Отпустил.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(РеализацияТоваровИУслуг.Отпустил)
	|		ИНАЧЕ РеализацияТоваровИУслуг.Отпустил.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК Отпустил,
	//++ №4051 ФИО Руководителя по новому
	//|	РеализацияТоваровИУслуг.Руководитель.РасшифровкаПодписи КАК ФИОРуководителя,
	|	ВЫБОР
    |		КОГДА РеализацияТоваровИУслуг.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА РеализацияТоваровИУслуг.Организация.Руководитель.РасшифровкаПодписи
    |		ИНАЧЕ РеализацияТоваровИУслуг.Руководитель.РасшифровкаПодписи
	//-- №4051
    |	КОНЕЦ КАК ФИОРуководителя,
	//++ №4051 ФИО Гл. бухглатера по новому
	//|	РеализацияТоваровИУслуг.ГлавныйБухгалтер.РасшифровкаПодписи КАК ФИОГлавногоБухгалтера,
	|	ВЫБОР
    |		КОГДА РеализацияТоваровИУслуг.ГлавныйБухгалтер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |			ТОГДА РеализацияТоваровИУслуг.Организация.ГлавныйБухгалтер.РасшифровкаПодписи
    |		ИНАЧЕ РеализацияТоваровИУслуг.ГлавныйБухгалтер.РасшифровкаПодписи
	|	КОНЕЦ КАК ФИОГлавногоБухгалтера,
	//-- №4051
	|	РеализацияТоваровИУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровИУслуг.Контрагент.НаименованиеПолное = """"
	|			ТОГДА РеализацияТоваровИУслуг.Контрагент.НаименованиеПолное
	|		ИНАЧЕ РеализацияТоваровИУслуг.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	РеализацияТоваровИУслуг.ВерсияДанных КАК ВерсияДанных,
	|	РеализацияТоваровИУслуг.ПометкаУдаления КАК ПометкаУдаления,
	|	РеализацияТоваровИУслуг.Проведен КАК Проведен,
	|	РеализацияТоваровИУслуг.Автор КАК Автор,
	|	РеализацияТоваровИУслуг.АдресМонтажа КАК АдресМонтажа,
	|	РеализацияТоваровИУслуг.ВидЦен КАК ВидЦен,
	|	РеализацияТоваровИУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровИУслуг.Комментарий КАК Комментарий,
	|	РеализацияТоваровИУслуг.Основание КАК Основание,
	|	РеализацияТоваровИУслуг.Основание.Дата КАК ДатаДокументаОснования,
	|	""01.01.2001"" КАК ДатаОснования,
	|	РеализацияТоваровИУслуг.Основание.Номер КАК НомерОснования,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровИУслуг.Основание ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ""Заказ покупателя""
	|		КОГДА РеализацияТоваровИУслуг.Основание ССЫЛКА Документ.ЗаказДоговор
	|			ТОГДА ""Заказ-договор""
	|		КОГДА РеализацияТоваровИУслуг.Основание ССЫЛКА Документ.ПоступлениеТоваровИУслуг
	|			ТОГДА ""Поступление товаров и услуг""
	|		КОГДА РеализацияТоваровИУслуг.Основание ССЫЛКА Документ.ПеремещениеТоваров
	|			ТОГДА ""Перемещение товаров""
	|		КОГДА РеализацияТоваровИУслуг.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|			ТОГДА ""Заказ на производство""
	|	КОНЕЦ КАК ВидОснования,
	|	РеализацияТоваровИУслуг.СуммаБонусовКСписанию КАК СуммаБонусовКСписанию,
	|	РеализацияТоваровИУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровИУслуг.СуммаДокумента КАК ИтогоСумма,
	|	0 КАК ИтогоСуммаНДС,
	|	0 КАК ИтогоСуммаБезНДС,
	|	РеализацияТоваровИУслуг.Подразделение КАК Подразделение,
	|	РеализацияТоваровИУслуг.Представление КАК Представление,
	|	РеализацияТоваровИУслуг.МоментВремени КАК МоментВремени,
	|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК ТекущийДолг,
	|	ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК ДолгПоРеализации,
	|	РеализацияТоваровИУслуг.СуммаДокумента - ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК ОплаченоПоРеализации,
	|	КонстантаВалютаУчета.Значение.Ссылка КАК ВалютаУчета,
	|	РеализацияТоваровИУслуг.Контрагент.ОсновнойБанковскийСчет.НомерСчета КАК КонтрагентБанковскийСчетНомерСчета,
	|	РеализацияТоваровИУслуг.Контрагент.ОсновнойБанковскийСчет.БИК КАК КонтрагентБанковскийСчетБИК,
	|	РеализацияТоваровИУслуг.Контрагент.ОсновнойБанковскийСчет.КоррСчет КАК КонтрагентБанковскийСчетКоррСчет,
	|	РеализацияТоваровИУслуг.Контрагент.ОсновнойБанковскийСчет.НаименованиеБанка КАК КонтрагентБанковскийСчетНаименованиеБанка,
	|	РеализацияТоваровИУслуг.Контрагент.ИНН КАК КонтрагентИНН,
	|	РеализацияТоваровИУслуг.Контрагент.ИдентификационныйНомерПлательщикаЕвропейскогоНДС КАК КонтрагентИдентификационныйНомерПлательщикаЕвропейскогоНДС,
	|	РеализацияТоваровИУслуг.СуммаБонусовКСписаниюПоДисконтнойКарте КАК БонусовСписано,
	|	РеализацияТоваровИУслуг.СуммаБонусовКНачислениюПоДисконтнойКарте КАК БонусовНачислено,
	|	ЕСТЬNULL(БонусыКонтрагентовОстатки.СуммаОстаток, 0) КАК БонусОстатки,
	|	РеализацияТоваровИУслуг.Товары.(
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Цена КАК Цена,
	|		0 КАК ЦенаБезНДС,
	|		Сумма КАК Сумма,
	|		СтавкаНДС КАК СтавкаНДС,
	|		0 КАК СтавкаНДСЧислом,
	|		СуммаНДС КАК СуммаНДС,
	|		НомерСтроки КАК НомерСтроки,
	|		Ссылка КАК Ссылка,
	|		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СерияНоменклатуры КАК СерияНоменклатуры,
	|		Коэффициент КАК Коэффициент,
	|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|		ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|		Заказ КАК Заказ,
	|		Потолок КАК Потолок
	|	) КАК Товары,
	|	РеализацияТоваровИУслуг.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура КАК Номенклатура,
	|		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Коэффициент КАК Коэффициент,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		0 КАК ЦенаБезНДС,
	|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|		Сумма КАК Сумма,
	|		СтавкаНДС КАК СтавкаНДС,
	|		0 КАК СтавкаНДСЧислом,
	|		СуммаНДС КАК СуммаНДС,
	|		ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|		Заказ КАК Заказ,
	|		Потолок КАК Потолок
	|	) КАК Услуги
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ПО РеализацияТоваровИУслуг.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
	|			И РеализацияТоваровИУслуг.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|		ПО РеализацияТоваровИУслуг.Ссылка = РасчетыПоЗаказамОстатки.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БонусыКонтрагентов.Остатки КАК БонусыКонтрагентовОстатки
	|		ПО РеализацияТоваровИУслуг.Контрагент = БонусыКонтрагентовОстатки.Контрагент
	|			И РеализацияТоваровИУслуг.ДисконтнаяКарта = БонусыКонтрагентовОстатки.ДисконтнаяКарта,
	|	Константа.ВалютаУчета КАК КонстантаВалютаУчета
	|ГДЕ
	|	РеализацияТоваровИУслуг.Ссылка В(&МассивОбъектов)";
	
КонецФункции

#КонецОбласти

#Область ПечатьЧека

// Возвращает предварительные параметры фискализации чека для документа.
//
// Параметры:
//   ДокументСсылка - ДокументСсылка.ПриходныйКассовыйОрдер - Документ.
//   ВерсияФФД - Строка - Версия ФФД.
//
// ВозвращаемоеЗначение:
//  Неопределено, Структура - см. функцию МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека().
//
Функция ПараметрыОперацииФискализацииЧека(ДокументСсылка, ВерсияФФД = Неопределено, ЭкземплярПодключаемогоОборудования = Неопределено) Экспорт
	
	// Общие параметры чека
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
		
	// Общие реквизиты для всех типов оборудования.
	ПотолкиКассыОнлайн.ЗаполнитьОбщиеРеквизиты(ДокументСсылка, ОбщиеПараметры, ЭкземплярПодключаемогоОборудования);
	
	// Товарные позиции И Таблица оплат
	ПотолкиКассыОнлайн.ДополнитьТоварамиПараметрыПриПробитииЧекаПоДокументуПродажи(ДокументСсылка, ОбщиеПараметры);
	
	Возврат ОбщиеПараметры;
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция ПолучитьМассивРеквизитовПоЦенам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ТоварыЦена");
	МассивИменЭлементов.Добавить("ТоварыСумма");
	
	МассивИменЭлементов.Добавить("УслугиЦена");
	МассивИменЭлементов.Добавить("УслугиСумма");
	
	Возврат МассивИменЭлементов;
	
КонецФункции
	
Функция ПолучитьМассивРеквизитовПоСкидкам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ТоварыПроцентРучнойСкидки");
	МассивИменЭлементов.Добавить("ТоварыСуммаРучнойСкидки");
	
	МассивИменЭлементов.Добавить("УслугиПроцентРучнойСкидки");
	МассивИменЭлементов.Добавить("УслугиСуммаРучнойСкидки");
	
	Возврат МассивИменЭлементов;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ВозвратПродукции.ДобавитьКомандуСоздатьНаОснованииЗаказаПокупателя(КомандыСозданияНаОсновании);
	
	Документы.ВозвратТовараОтПокупателя.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ЗаявкаНаДоставку.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	Документы.ЗаявкаНаРасходованиеДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.НачислениеБонусовКонтрагентам.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.НачислениеЗарплаты.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОснованииОплатаКредитомМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.ПлатежноеПоручениеИсходящее.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПоступлениеНаРасчетныйСчет.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.ПоступлениеТоваровИУслуг.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.СписаниеСРасчетногоСчета.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.СчетНаОплату.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.СчетФактураВыданный.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания данного документа
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровИУслуг) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровИУслуг.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.РеализацияТоваровИУслуг.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Добавляет команду создания документа "Реализация товаров и услуг" для заказа покупателя (одного или нескольких).
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОснованииЗаказаПокупателя(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровИУслуг) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.РеализацияТоваровИУслугСоздатьНаОснованииЗаказаПокупателя";
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.РеализацияТоваровИУслуг.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли