#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда			
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	// #12298   #14947 закомментировано ПараметрыСеанса.ТекущийПользователь.Склад - склад отгрузки
	//Если ДанныеЗаполнения = Неопределено И Константы.СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции.Получить() Тогда
	//	Склад = ПараметрыСеанса.ТекущийПользователь.СкладОтгрузки;	
	//КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("МассивДокументов") Тогда
			Если ДанныеЗаполнения.МассивДокументов.Количество() > 0 Тогда
				Если ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения.МассивДокументов);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		// Заполнение шапки
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		Основание = ДанныеЗаполнения.Ссылка;
		НомерРозничногоДоговора	= ДанныеЗаполнения.НомерРозничногоДоговора; //#7381
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
			НоваяСтрока.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
			//2017-08-02
			НоваяСтрока.Потолок = ?(Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекСтрокаТовары.Номенклатура), ТекСтрокаТовары.Номенклатура, Неопределено);

		КонецЦикла;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаУслуги.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Коэффициент = ТекСтрокаУслуги.Коэффициент;
			НоваяСтрока.Номенклатура = ТекСтрокаУслуги.Номенклатура;
			НоваяСтрока.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
		КонецЦикла;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		// Заполнение шапки
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.СкладПолучатель;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
			НоваяСтрока.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
			//2017-08-02
			НоваяСтрока.Потолок = ?(Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекСтрокаТовары.Номенклатура), ТекСтрокаТовары.Номенклатура, Неопределено);
		КонецЦикла;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		// Заполнение шапки
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Организация = ДанныеЗаполнения.Организация;
		Основание = ДанныеЗаполнения.Ссылка;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Валюта = ДанныеЗаполнения.Валюта;
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		Склад = ОбщийМодульСервер.НастройкаПользователя("СкладРозница");
		
		ТекущаяКомната = Неопределено;
		Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.ТоварыУслуги Цикл
			Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
				НоваяСтрока = Услуги.Добавить();
			Иначе
				НоваяСтрока = Товары.Добавить();
			КонецЕсли;
			
			// ищем потолок в комнате			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
				ТекущийПотолок = ТекущаяСтрока.Номенклатура;
			Иначе				
				Если ТекущаяСтрока.Комната <> ТекущаяКомната Тогда
					ТекущийПотолок = Неопределено;
					ПараметрыОтбора = Новый Структура("Комната", ТекущаяСтрока.Комната);
					НайденныеСтроки = ДанныеЗаполнения.ТоварыУслуги.НайтиСтроки(ПараметрыОтбора);
					Для каждого Строка Из НайденныеСтроки Цикл
						Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Строка.Номенклатура) Тогда
							ТекущийПотолок = Строка.Номенклатура;
							Прервать;					
						КонецЕсли; 				
					КонецЦикла;	
					ТекущаяКомната = ТекущаяСтрока.Комната;
				КонецЕсли; 
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
			НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация), , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
			НоваяСтрока.Потолок = ТекущийПотолок;
		//КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
	КонецЕсли;
		
	//заполним адрес доставки по адресу контрагента 	
	Если НЕ ЗначениеЗаполнено(АдресДоставки)
		И НЕ ДанныеЗаполнения = Неопределено И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Если не ДанныеЗаполнения.Метаданные().Реквизиты.Найти("Контрагент") = Неопределено Тогда 
			//ТаблицаАдресов = ДанныеЗаполнения.Контрагент.АдресаДоставки.Выгрузить();
			//Если ТаблицаАдресов.Количество() > 0 Тогда 
			//	ОсновнойАдресКонтрагента = ТаблицаАдресов.Найти(Истина,"Основной");
			//	Если ОсновнойАдресКонтрагента = Неопределено Тогда 
			//		АдресДоставки = ТаблицаАдресов[0].Адрес;
			//	Иначе 
			//		АдресДоставки = ОсновнойАдресКонтрагента.Адрес;
			//	КонецЕсли;
			//КонецЕсли;
			АдресДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеЗаполнения.Контрагент, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
		КонецЕсли;
	КонецЕсли;
	
	ОбщийМодуль.ОбработкаЗаполненияПодписей(ЭтотОбъект);
	
	СтатьяДоходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект);
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты();
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
	Для каждого СтрокаТЧ из Товары Цикл	
		СтрокаТЧ.СкидкаБонусами    = 0; //#14482
		СтрокаТЧ.БонусыКНачислению = 0; //#14482
		
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТЧ, Ложь, , Истина);
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТЧ, УчитыватьНДС);
	КонецЦикла;

	Для каждого СтрокаТЧ из Услуги Цикл	
		СтрокаТЧ.СкидкаБонусами    = 0; //#14482
		СтрокаТЧ.БонусыКНачислению = 0; //#14482
		
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТЧ, Ложь, , Истина);
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТЧ, УчитыватьНДС);
	КонецЦикла;
	
	UDS_КодСкидки = "";
	UDS_СуммаСкидки = 0;
	UDS_ИдентификаторОперации = "";
	UDS_ДатаОперации = Дата(1,1,1);
	
	ДозаполнитьПоУмолчанию();

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Товары.Количество() = 0 И Услуги.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Запрещено проводить документ с пустыми табличными частями ""Товары""/""Услуги""!'"),,, "Объект.Товары", Отказ);
	КонецЕсли;
			
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи);
	
	Если ЭтоНовый() И ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Контрагент) Тогда
		//#10822
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОрганизацияПроизводства", Организация);
		Запрос.УстановитьПараметр("КонтрагентРозницы", 		 Контрагент);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШапкаПланаОбмена.Ссылка КАК Узел
		|ИЗ
		|	ПланОбмена.ОбменБазаПроизводстваБазаРозницы КАК ШапкаПланаОбмена
		|ГДЕ
		|	НЕ ШапкаПланаОбмена.ЭтотУзел
		|	И ШапкаПланаОбмена.ЭтоБазаПроизводства
		|	И ШапкаПланаОбмена.ОрганизацияПроизводства = &ОрганизацияПроизводства
		|	И ШапкаПланаОбмена.КонтрагентРозницы = &КонтрагентРозницы
		|	И НЕ ШапкаПланаОбмена.ПометкаУдаления";		
			
		РезультатЗапроса = Запрос.Выполнить();
		АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуУП = НЕ РезультатЗапроса.Пустой();
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	//проверки
	Для каждого ТекущаяСтрока из Услуги Цикл
		СтруктураПараметров = Новый Структура("Ссылка, ТабличнаяЧасть, ИмяТабличнойЧасти, НомерСтроки", ЭтотОбъект, "Услуги", "Услуги", ТекущаяСтрока.НомерСтроки);
		ОбработкаТабличныхЧастейСервер.ПроверитьЦенуСтроки(ТекущаяСтрока, СтруктураПараметров, Отказ);
	КонецЦикла;	
	
	Для каждого ТекущаяСтрока из Товары Цикл
		СтруктураПараметров = Новый Структура("Ссылка, ТабличнаяЧасть, ИмяТабличнойЧасти, НомерСтроки", ЭтотОбъект, "Товары", "Товары", ТекущаяСтрока.НомерСтроки);
		ОбработкаТабличныхЧастейСервер.ПроверитьЦенуСтроки(ТекущаяСтрока, СтруктураПараметров, Отказ);
	КонецЦикла;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	//ДВИЖЕНИЯ
	//списание со склада
	ДатаДвижения = Дата;
	Если ДатаДвижения = Дата(1,1,1) Тогда
		ДатаДвижения = ТекущаяДатаСеанса();
	КонецЕсли;
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, Склад, Товары, ДатаДвижения);
	Если Отказ Тогда
		Возврат;
	Иначе
		//++ №8793 товары нужно свернуть, чтобы корректно списать себестоимость
		мТовары = Товары.Выгрузить();
		мТовары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество"); 
		//-- №8793
		Для Каждого Товар Из мТовары Цикл
			Расход = Движения.ТоварыНаСкладах.Добавить();
			Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
			Расход.Период = ДатаДвижения;
			Расход.Организация = ОрганизацияТоваров;
			Расход.Склад = Склад;
			Расход.Номенклатура = Товар.Номенклатура;
			Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Расход.СерияНоменклатуры = Товар.СерияНоменклатуры;
			Расход.Количество = Товар.Количество * Товар.Коэффициент;
			//#8288
			//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, Склад, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
			СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, Склад, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
			Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
			Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
		КонецЦикла;
	КонецЕсли;
	
	// В случае, если основанием является заказ покупателя спишем резервы
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") И НЕ Основание.Пустая() Тогда
		
		Движения.ТоварыВРезервеНаСкладах.Записывать = Истина;
		
		СписокТоваров = Товары.Выгрузить();
		СписокТоваров.Очистить();
		
		Для Каждого ТекущаяСтрока Из Товары Цикл
			
			Если Не ТипЗнч(ТекущаяСтрока.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") И Не ЗначениеЗаполнено(ТекущаяСтрока.Заказ) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = СписокТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);			
			НоваяСтрока.Количество = НоваяСтрока.Количество * НоваяСтрока.Коэффициент;
			
		КонецЦикла;
		
		СписокТоваров.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
		СписокТоваров.ЗаполнитьЗначения(Перечисления.ВидыТабличнойЧасти.Товары, "ВидТабличнойЧасти");
		
		СписокТоваров.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		СписокТоваров.ЗаполнитьЗначения(Склад, "Склад");
		
		СписокТоваров.Свернуть("Склад, ВидТабличнойЧасти, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Заказ", "Количество");
		
		ОстаткиРезервов = РегистрыНакопления.ТоварыВРезервеНаСкладах.ПолучитьОстаткиПоРезервам(Дата, СписокТоваров, ОрганизацияТоваров);
		
		Для Каждого ОстатокРезерва Из ОстаткиРезервов Цикл
			
			Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ОстатокРезерва);
			Движение.Количество = Мин(ОстатокРезерва.КоличествоВДокументе, ОстатокРезерва.КоличествоВРезерве);
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// запись взаиморасчетов
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = ДоговорКонтрагента;
	//Движение.Документ = Ссылка;
	Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаДокумента);
	Движение.Организация = Организация;
	
	// Взаиморасчеты с контрагентами в валюте
	Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
	Движение.ВидДвижения =ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.Договор = ДоговорКонтрагента;
	Движение.Валюта = Валюта;
	Движение.Сумма = СуммаДокумента;
	
	// заказы покупателей
	Движения.ЗаказыПокупателей.Записывать = Истина;
	ВременнаяТаблицаТоваровИУслуг = Новый ТаблицаЗначений;
	ВременнаяТаблицаТоваровИУслуг.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВременнаяТаблицаТоваровИУслуг.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВременнаяТаблицаТоваровИУслуг.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ВременнаяТаблицаТоваровИУслуг.Колонки.Добавить("Количество",Новый ОписаниеТипов("число"));
	ВременнаяТаблицаТоваровИУслуг.Колонки.Добавить("Коэффициент",Новый ОписаниеТипов("число"));
	ВременнаяТаблицаТоваровИУслуг.Колонки.Добавить("Сумма",Новый ОписаниеТипов("число"));
	ВременнаяТаблицаТоваровИУслуг.Колонки.Добавить("Заказ");
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		ДокументЗаказа = Неопределено;
		
		// попробуем получить документ заказа из табличной части
		Если (ТипЗнч(ТекущаяСтрока.Заказ) = Тип("ДокументСсылка.ЗаказНаПроизводство")
				Или ТипЗнч(ТекущаяСтрока.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя"))
			И ЗначениеЗаполнено(ТекущаяСтрока.Заказ) Тогда
			ДокументЗаказа = ТекущаяСтрока.Заказ;
		КонецЕсли;
		
		// если в табличной части документ заказа не указан, попробуем получить его из шапки документа
		Если ДокументЗаказа = Неопределено
			И (ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство")
				Или ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя"))
			И ЗначениеЗаполнено(Основание) Тогда
			ДокументЗаказа = Основание;
		КонецЕсли;
		
		Если НЕ ДокументЗаказа = Неопределено Тогда
			
			НоваяСтрока = ВременнаяТаблицаТоваровИУслуг.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Заказ = ДокументЗаказа;
			
			Если СписыватьБонусы Тогда // №13299 сумму бонусами наращиваем только если они списывались этим документом
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма + ТекущаяСтрока.СкидкаБонусами; //#10397
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из Услуги Цикл
		
		ДокументЗаказа = Неопределено;
		
		// попробуем получить документ заказа из табличной части
		Если (ТипЗнч(ТекущаяСтрока.Заказ) = Тип("ДокументСсылка.ЗаказНаПроизводство")
				Или ТипЗнч(ТекущаяСтрока.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя"))
			И ЗначениеЗаполнено(ТекущаяСтрока.Заказ) Тогда
			ДокументЗаказа = ТекущаяСтрока.Заказ;
		КонецЕсли;
		
		// если в табличной части документ заказа не указан, попробуем получить его из шапки документа
		Если ДокументЗаказа = Неопределено
			И (ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство")
				Или ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя"))
			И ЗначениеЗаполнено(Основание) Тогда
			ДокументЗаказа = Основание;
		КонецЕсли;
		
		Если НЕ ДокументЗаказа = Неопределено Тогда
			
			НоваяСтрока = ВременнаяТаблицаТоваровИУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			НоваяСтрока.Заказ = ДокументЗаказа;
			
			Если СписыватьБонусы Тогда // №13299 сумму бонусами наращиваем только если они списывались этим документом
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма + ТекущаяСтрока.СкидкаБонусами; //#10397
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВремТаблицаЗаказов = ВременнаяТаблицаТоваровИУслуг.Скопировать();
	ВремТаблицаЗаказов.Свернуть("Заказ");
	
	Для Каждого ТекущийЗаказ Из ВремТаблицаЗаказов Цикл
		Если НЕ РегистрыНакопления.ЗаказыПокупателей.КонтрольОстатков(Ссылка,ТекущийЗаказ.Заказ, ВременнаяТаблицаТоваровИУслуг) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		Для Каждого ТекущаяСтрока Из ВременнаяТаблицаТоваровИУслуг Цикл
			Движение = Движения.ЗаказыПокупателей.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ЗаказНаПроизводство = ТекущаяСтрока.Заказ;
			Движение.Организация = ТекущаяСтрока.Заказ.Организация;
			Движение.Контрагент = ТекущаяСтрока.Заказ.Контрагент;
			Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
			Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
			Движение.Сумма = ТекущаяСтрока.Сумма; //#9777
			
			//если идет закрытие заказов покупателей по заказу на производство, нужно так же закрывать заказ покупателя, если заказ на производство создан на оснвоании заказа покупателя
			// с 2.0 ЗаказНаПроизводство в ТЧ Реализации не участвует
			//Если ТипЗнч(ТекущаяСтрока.Заказ) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
			//	Если ТипЗнч(ТекущаяСтрока.Заказ.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") и НЕ ТекущаяСтрока.Заказ.ДокументОснование.Пустая() Тогда
			//		Движение = Движения.ЗаказыПокупателей.Добавить();
			//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//		Движение.Период = Дата;
			//		Движение.ЗаказНаПроизводство = ТекущаяСтрока.Заказ.ДокументОснование;
			//		Движение.Организация = ТекущаяСтрока.Заказ.ДокументОснование.Организация;
			//		Движение.Контрагент = ТекущаяСтрока.Заказ.ДокументОснование.Контрагент;
			//		Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
			//		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
			//	КонецЕсли;
			//КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	//продажи
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение;
		Движение.Склад = Склад; //#12367
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ДокументПродажи = Ссылка;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.Организация = Организация;
		Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		Движение.ДисконтнаяКарта = ДисконтнаяКарта;
		Движение.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;         //#14300
		Движение.КоличествоВЕдиницахДокумента = ТекущаяСтрока.Количество;	//#14300
		Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		Движение.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Валюта, ВалютаУчета, Дата, ТекущаяСтрока.Сумма);
		Движение.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма); //#8288
		
		ЗаполнитьДанныеПоЗаказамВПродажах(Движение, ТекущаяСтрока);
		
	КонецЦикла;
	Для Каждого ТекущаяСтрока Из Услуги Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение;
		Движение.Склад = Склад; //#12367
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ДокументПродажи = Ссылка;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		Движение.Организация = Организация;
		Движение.ДисконтнаяКарта = ДисконтнаяКарта;
		Движение.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;         //#14300
		Движение.КоличествоВЕдиницахДокумента = ТекущаяСтрока.Количество;	//#14300
				
		Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		Движение.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Валюта, ВалютаУчета, Дата, ТекущаяСтрока.Сумма);
		Движение.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма); //#8288
		
		ЗаполнитьДанныеПоЗаказамВПродажах(Движение, ТекущаяСтрока);
				
	КонецЦикла;
	
	//Бонусы контрагентов
	Движения.БонусыКонтрагентов.Записывать = Истина;
	//Если СуммаБонусовКСписанию > 0 Тогда
	//	Движение = Движения.БонусыКонтрагентов.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.Контрагент = Контрагент;
	//	Движение.Сумма = СуммаБонусовКСписанию;
	//КонецЕсли;
	
	//Отгрузки с произодства для розницы
	Движения.ОтгрузкиСПроизодстваДляРозницы.Записывать = Истина;
	//++ 8373 комментируем, т.к. теперь смотрим по галочкам
	//Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") И ЗначениеЗаполнено(Основание) Тогда
	//	Если Основание.ЭтоЗаказОтРозницы Тогда
	//		Движение = Движения.ОтгрузкиСПроизодстваДляРозницы.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		Движение.Период = Дата;
	//		Движение.Реализация = Ссылка;			
	//		Движение.Оприходовать = 1;
	//		
	//	//#7381
	//	ИначеЕсли ПолучитьФункциональнуюОпцию("СоздаватьДокументыПоступленийПоРучнымЗаказам") Тогда
	//		Если РегистрыСведений.СвязкиОрганизацийПроизводстваКонтрагентРозницы.ОтгрузкаПоСвязкеОрганизацииПроизводстваКонтрагентаРозницы(Организация, Контрагент) Тогда
	//			Движение = Движения.ОтгрузкиСПроизодстваДляРозницы.Добавить();
	//			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//			Движение.Период = Дата;
	//			Движение.Реализация = Ссылка;
	//			Движение.ОприходоватьПоРучнымЗаказам = 1;			
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//-- 8373 комментируем, т.к. теперь смотрим по галочкам
	
	//++ №8373 новые условия
	Если АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуПоИнтеркампани ИЛИ АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуСозданныхВручную Тогда
		Движение = Движения.ОтгрузкиСПроизодстваДляРозницы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Реализация = Ссылка;			
		Если АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуПоИнтеркампани Тогда
			Движение.Оприходовать = 1;
		Иначе
			Движение.ОприходоватьПоРучнымЗаказам = 1;
		КонецЕсли;		
	КонецЕсли;
	//-- №8373
	
	//начисление выработки по реализации
	Движения.ВыработкаИсполнителейПроизводства.Записывать = Истина;
	Движения.ВыработкаИсполнителейРозницы.Записывать = Истина;
	
	Если РучнаяКорректировкаВыработки Тогда // №1083 теперь доступно ручное изменение зарплаты
		НаборЗаписейПоВыработке = Выработка.Выгрузить();
		ДополнитьТаблицуВыработки(НаборЗаписейПоВыработке);
	Иначе	
		НаборЗаписейПоВыработке = Зарплата.РассчитатьВыработкуПоДокументу(Ссылка);
	КонецЕсли;
	
	Для Каждого СтрокаВыработки Из НаборЗаписейПоВыработке Цикл
		Если СтрокаВыработки.ЭтоРозница Тогда
			Движение = Движения.ВыработкаИсполнителейРозницы.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаВыработки);
		Иначе
			Движение = Движения.ВыработкаИсполнителейПроизводства.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаВыработки);
		КонецЕсли;
	КонецЦикла;	
	
	Если Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить() Тогда
		//РасчетыПоЗаказам
		Движения.РасчетыПоЗаказам.Записывать = Истина;
		Движение = Движения.РасчетыПоЗаказам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Заказ = Ссылка;
		Движение.Сумма = СуммаДокумента;
		Движение.Контрагент = Контрагент; // №6496 добавлен контрагент в измерение
		
		//РасчетыПоЗаказам добавим расход бонусов
		Если СуммаБонусовКСписаниюПоДисконтнойКарте > 0
			И ?(СлужебныйУчетБонусовПоДисконтнымКартам, НЕ ДисконтнаяКарта.Пустая(), Истина) // №6316 нужно проверить заполнение дисконтной карты	
		Тогда
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор")
				или ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство")
				или ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда		
				
				Движение = Движения.РасчетыПоЗаказам.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Заказ = Основание;
				Движение.Сумма = СуммаБонусовКСписаниюПоДисконтнойКарте;
				Движение.Контрагент = Контрагент; // №6496 добавлен контрагент в измерение
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;			
	
	//БонусыКонтрагентов
	Если СлужебныйВидБонуснойСистемы = Перечисления.ВидыБонусныхСистем.Внутренняя Тогда
		//Если Константы.АвтоматическоеНачислениеБонусов.Получить() Тогда
		Если НачислятьБонусы 
			И ?(СлужебныйУчетБонусовПоДисконтнымКартам, НЕ ДисконтнаяКарта.Пустая(), Истина) // №6316 нужно проверить заполнение дисконтной карты
			Тогда
			Если НЕ СуммаБонусовКНачислениюПоДисконтнойКарте = 0 Тогда
				Движение = Движения.БонусыКонтрагентов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Контрагент = Контрагент;
				Движение.ДисконтнаяКарта = ДисконтнаяКарта;
				Движение.Сумма = СуммаБонусовКНачислениюПоДисконтнойКарте;
				Движение.ДокументНАНБ = ДокументНАНБ;
				Движение.КатегорияКонтрагента = КатегорияКонтрагента;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ СуммаБонусовКСписаниюПоДисконтнойКарте = 0
			И СписыватьБонусы // №13299
			И ?(СлужебныйУчетБонусовПоДисконтнымКартам, НЕ ДисконтнаяКарта.Пустая(), Истина) // №6316 нужно проверить заполнение дисконтной карты
			Тогда
			
			//#13339 
			Если НЕ РегистрыНакопления.БонусыКонтрагентов.КонтрольОстатков(Ссылка, Контрагент, ДисконтнаяКарта, СуммаБонусовКСписаниюПоДисконтнойКарте) Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Движение = Движения.БонусыКонтрагентов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.ДисконтнаяКарта = ДисконтнаяКарта;
			Движение.Сумма = СуммаБонусовКСписаниюПоДисконтнойКарте;
		КонецЕсли;
		
	КонецЕсли;
	
	// регистр ДоходыРасходы
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод
			Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движения.ДоходыРасходы.Записывать = Истина;
			Для Каждого ТекущаяСтрока Из Товары Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяДоходов.Пустая(), ТекущаяСтрока.СтатьяДоходов, СтатьяДоходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
				Движение.СуммаРасходов 	= 0;				
			КонецЦикла;
			
			Для Каждого ТекущаяСтрока Из Услуги Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяДоходов.Пустая(), ТекущаяСтрока.СтатьяДоходов, СтатьяДоходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;				
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
				Движение.СуммаРасходов 	= 0;				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	// №6960 настройки по бонусам делаем только если глобально включен учет бонусов
	Если ПолучитьФункциональнуюОпцию("УчетБонусов") Тогда
		
		//#13834 изменена настройка
		//НачислятьБонусы 						= Константы.АвтоматическоеНачислениеБонусов.Получить();
		НачислятьБонусы 						= Константы.АвтоматическиНачислятьБонусы.Получить();
		СписыватьБонусы							= Константы.СписыватьБонусыПоДокументуРеализацияТоваровИУслуг.Получить(); // №13299
		СлужебныйУчитыватьБонусы 				= Константы.УчитыватьБонусы.Получить();
		СлужебныйУчетБонусовПоДисконтнымКартам 	= Константы.УчетБонусовПоДисконтнымКартам.Получить();
		СлужебныйВидБонуснойСистемы 			= Константы.ВидБонуснойСистемы.Получить();
		
		НачислятьБонусыПоДисконтнойКартеПриЗачетеБонусовКакСкидку = Константы.НачислятьБонусыПоДисконтнойКартеПриЗачетеБонусовКакСкидку.Получить();
		
	Иначе
		НачислятьБонусы = Ложь;
		СписыватьБонусы = Ложь;
		СлужебныйУчитыватьБонусы = Ложь;
		СлужебныйУчетБонусовПоДисконтнымКартам = Ложь;
		НачислятьБонусыПоДисконтнойКартеПриЗачетеБонусовКакСкидку = Ложь;
	КонецЕсли;
	
	ДисконтнаяКарта = Справочники.ДисконтныеКарты.ПустаяСсылка();
	СуммаБонусовКНачислениюПоДисконтнойКарте = 0;
	СуммаБонусовКСписанию					 = 0;
	СуммаБонусовКСписаниюПоДисконтнойКарте	 = 0;
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	//#13943
	Если Константы.СпособЗаполненияМенеджераВРеализации.Получить() = Перечисления.ВариантыЗаполненияМенеджера.ЗаполнятьСотрудникомПользователя 
		И ЗначениеЗаполнено(Автор) Тогда
		Менеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Автор, "Сотрудник");
		
	ИначеЕсли Константы.СпособЗаполненияМенеджераВРеализации.Получить() = Перечисления.ВариантыЗаполненияМенеджера.ЗаполнятьМенеджеромДокументаОснования
		И ЗначениеЗаполнено(Основание)
		И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Менеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Менеджер");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		КатегорияКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Категория");
		
		//#13359
		Если СлужебныйВидБонуснойСистемы = Перечисления.ВидыБонусныхСистем.UDS Тогда
			UDS_ОбщийМодульСервер.ЗаполнитьРеквизитыДокумента(ЭтотОбъект);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоЗаказамВПродажах(Движение, ТекущаяСтрока)
	
	// заказ на производство
	// #13068 измерение более не используется
	//Если ЗначениеЗаполнено(ТекущаяСтрока.Потолок) Тогда
	//	Движение.ЗаказНаПроизводство = ОбщийМодуль.НайтиЗаказНаПроизводствоПоПотолку(ТекущаяСтрока.Потолок);
	//КонецЕсли;	
	
	// заказ покупателя
	Если ТипЗнч(ТекущаяСтрока.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") И НЕ ТекущаяСтрока.Заказ.Пустая() Тогда
		Движение.ЗаказПокупателя = ТекущаяСтрока.Заказ;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") И НЕ Основание.Пустая() Тогда
		Движение.ЗаказПокупателя = Основание;
	КонецЕсли;
	
	// подразделение заказа, адрес монтажа
	//заказ на производство приоритетнее
	//Если ЗначениеЗаполнено(Движение.ЗаказНаПроизводство) Тогда
	//	//Движение.АдресМонтажа = Движение.ЗаказНаПроизводство.АдресМонтажа;
	//	Движение.ПодразделениеЗаказа = Движение.ЗаказНаПроизводство.Подразделение;
	//Иначе
	Если ЗначениеЗаполнено(Движение.ЗаказПокупателя) Тогда
		//Движение.АдресМонтажа = Движение.ЗаказПокупателя.АдресМонтажа;
		Движение.ПодразделениеЗаказа = Движение.ЗаказПокупателя.Подразделение;		
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов 	= ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивДокументов, , "Реализация");
	
	Основание 			= МассивДокументов[0];
	Организация 		= МассивДокументов[0].Организация;
	Подразделение 		= МассивДокументов[0].Подразделение; //#5775
	Контрагент 			= МассивДокументов[0].Контрагент;
	ДоговорКонтрагента 	= МассивДокументов[0].ДоговорКонтрагента;
	ВидЦен 				= МассивДокументов[0].ВидЦен;
	Склад 				= МассивДокументов[0].Склад;
	Валюта 				= МассивДокументов[0].Валюта;
	АдресМонтажа 		= МассивДокументов[0].АдресМонтажа;
	Менеджер 			= МассивДокументов[0].Менеджер;
	ДисконтнаяКарта		= МассивДокументов[0].ДисконтнаяКарта; // №13705
	НомерРозничногоДоговора	= МассивДокументов[0].НомерРозничногоДоговора; //#7381
	
	СпособДоставки      = МассивДокументов[0].СпособДоставки;
	ГородДоставки       = МассивДокументов[0].ГородДоставки;
	АдресДоставки       = МассивДокументов[0].АдресДоставки;
	АдресДоставкиЗначенияПолей = МассивДокументов[0].АдресДоставкиЗначенияПолей;
	
	//++ №15928
	Если Константы.ПереноситьКомментарийИзЗаказаПокупателяПриСозданииРеализации.Получить() Тогда
		Комментарий 	= МассивДокументов[0].Комментарий;
	КонецЕсли;
	//-- №15928
	
	БонусыУчтеныПоЗаказу = Ложь; // №13299
	
	Для каждого ЭлементМассива из МассивДокументов Цикл
		
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание реализации невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		//#15370
		Если Организация <> ЭлементМассива.Организация Тогда
			Текст = НСтр("ru = 'Организации в выделенных документах различаются, создание реализации невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		//++ №13299
		Если ЭлементМассива.СписыватьБонусы Тогда
			БонусыУчтеныПоЗаказу = Истина;
		КонецЕсли;
		//-- №13299
	
		Для Каждого ТекущаяСтрокаТоварыОснования Из ЭлементМассива.Товары Цикл
			
			Если ТекущаяСтрокаТоварыОснования.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
				НоваяСтрока = Услуги.Добавить();
			Иначе
				НоваяСтрока = Товары.Добавить();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяСтрокаТоварыОснования);
			//НоваяСтрока.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
			//НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация), , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
			//НоваяСтрока.Потолок = ?(Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрокаТоварыОснования.Номенклатура), ТекущаяСтрокаТоварыОснования.Номенклатура, Неопределено);
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(НоваяСтрока.Номенклатура) Тогда 
				НоваяСтрока.Потолок = НоваяСтрока.Номенклатура; 
			КонецЕсли;
			
			//НоваяСтрока.Заказ = ТекущаяСтрокаТоварыОснования.ЗаказНаПроизводство;
			//2.0
			НоваяСтрока.Заказ = ЭлементМассива;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//++ №13299 если хотя бы по одному заказу установлен флаг "Списывать бонусы" - в реализации запрещаем списывать
	Если БонусыУчтеныПоЗаказу Тогда
		СписыватьБонусы = Ложь;
	КонецЕсли;
	//-- №13299
	
	//в таблицу оснований добавляем все основания кроме первого, так как он указан в шапке
	Для Инд = 1 по МассивДокументов.Количество() - 1 Цикл
		НоваяСтрока = Основания.Добавить();
		НоваяСтрока.Основание = МассивДокументов[Инд];
	КонецЦикла;	
	
	//а теперь проверим все что было отгружено по этому заказу и "вычтем" из товаров\услуг текущей реализации
	ТаблицаТоваровРеализации = Товары.Выгрузить();
	ТаблицаТоваровРеализации.Колонки.Добавить("СуммаВПересчетеНаЕдиницу", Новый ОписаниеТипов("число"));
	ТаблицаТоваровРеализации.Колонки.Добавить("СуммаСкидкиВПересчетеНаЕдиницу", Новый ОписаниеТипов("число"));
	ТаблицаТоваровРеализации.Колонки.Добавить("СуммаБонусовВПересчетеНаЕдиницу", Новый ОписаниеТипов("число")); // №13299
	
	Для Каждого ТекущаяСтрока Из ТаблицаТоваровРеализации Цикл
		Если НЕ ТекущаяСтрока.Количество = 0 Тогда
			ТекущаяСтрока.СуммаВПересчетеНаЕдиницу = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
			ТекущаяСтрока.СуммаСкидкиВПересчетеНаЕдиницу = ТекущаяСтрока.СуммаРучнойСкидки / ТекущаяСтрока.Количество;
			ТекущаяСтрока.СуммаБонусовВПересчетеНаЕдиницу = ТекущаяСтрока.СкидкаБонусами / ТекущаяСтрока.Количество; // №13299
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаУслугРеализации = Услуги.Выгрузить();
	ТаблицаУслугРеализации.Колонки.Добавить("СуммаВПересчетеНаЕдиницу", Новый ОписаниеТипов("число"));
	ТаблицаУслугРеализации.Колонки.Добавить("СуммаСкидкиВПересчетеНаЕдиницу", Новый ОписаниеТипов("число"));
	ТаблицаУслугРеализации.Колонки.Добавить("СуммаБонусовВПересчетеНаЕдиницу", Новый ОписаниеТипов("число")); // №13299
	Для Каждого ТекущаяСтрока Из ТаблицаУслугРеализации Цикл
		Если НЕ ТекущаяСтрока.Количество = 0 Тогда
			ТекущаяСтрока.СуммаВПересчетеНаЕдиницу = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
			ТекущаяСтрока.СуммаСкидкиВПересчетеНаЕдиницу = ТекущаяСтрока.СуммаРучнойСкидки / ТекущаяСтрока.Количество;
			ТекущаяСтрока.СуммаБонусовВПересчетеНаЕдиницу = ТекущаяСтрока.СкидкаБонусами / ТекущаяСтрока.Количество; // №13299
		КонецЕсли;
	КонецЦикла;
	
	ЗапросОтгружено = Новый Запрос;
	ЗапросОтгружено.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейОбороты.ЗаказНаПроизводство КАК Заказ,
	|	ЗаказыПокупателейОбороты.Номенклатура КАК Номенклатура,
	//++ #14419 если есть возврат, то есть строка КоличествоРасход с минусом
	//|	ЗаказыПокупателейОбороты.КоличествоРасход КАК КоличествоРасход
	|	СУММА(ЗаказыПокупателейОбороты.КоличествоРасход) КАК КоличествоРасход
	//-- #14419
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Регистратор, ЗаказНаПроизводство В (&Заказы)) КАК ЗаказыПокупателейОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоДокументу
	|				ТОГДА НЕ ЗаказыПокупателейОбороты.Регистратор = &Ссылка
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	//++ #14419
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПокупателейОбороты.ЗаказНаПроизводство,
	|	ЗаказыПокупателейОбороты.Номенклатура
	//-- #14419
	|";

	ЗапросОтгружено.УстановитьПараметр("Заказы", МассивДокументов);
	ЗапросОтгружено.УстановитьПараметр("ОтборПоДокументу", НЕ Ссылка.Пустая());
	ЗапросОтгружено.УстановитьПараметр("Ссылка", Ссылка); // отбор нужен для работы кнопки заполнить по заказу покупателя на форме документа
	ТаблицаОтгружено = ЗапросОтгружено.Выполнить().Выгрузить();
	
	Для Каждого СтрокаОтгружено Из ТаблицаОтгружено Цикл
		Вычесть = СтрокаОтгружено.КоличествоРасход;
		
		Для Каждого СтрокаТовар Из ТаблицаТоваровРеализации Цикл
			Если Вычесть > 0 И СтрокаТовар.Номенклатура = СтрокаОтгружено.Номенклатура И СтрокаТовар.Заказ = СтрокаОтгружено.Заказ Тогда
				Зачтем = Мин(СтрокаТовар.Количество,Вычесть);
				СтрокаТовар.Количество = СтрокаТовар.Количество - Зачтем;
				Вычесть = Вычесть - Зачтем;
				СтрокаТовар.Сумма = СтрокаТовар.СуммаВПересчетеНаЕдиницу * СтрокаТовар.Количество;
				СтрокаТовар.СуммаРучнойСкидки = СтрокаТовар.СуммаСкидкиВПересчетеНаЕдиницу * СтрокаТовар.Количество;
				СтрокаТовар.СкидкаБонусами = СтрокаТовар.СуммаБонусовВПересчетеНаЕдиницу * СтрокаТовар.Количество; // №13299
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаТовар Из ТаблицаУслугРеализации Цикл
			Если Вычесть > 0 И СтрокаТовар.Номенклатура = СтрокаОтгружено.Номенклатура И СтрокаТовар.Заказ = СтрокаОтгружено.Заказ Тогда
				Зачтем = Мин(СтрокаТовар.Количество,Вычесть);
				СтрокаТовар.Количество = СтрокаТовар.Количество - Зачтем;
				Вычесть = Вычесть - Зачтем;
				СтрокаТовар.Сумма = СтрокаТовар.СуммаВПересчетеНаЕдиницу * СтрокаТовар.Количество;
				СтрокаТовар.СуммаРучнойСкидки = СтрокаТовар.СуммаСкидкиВПересчетеНаЕдиницу * СтрокаТовар.Количество;
				СтрокаТовар.СкидкаБонусами = СтрокаТовар.СуммаБонусовВПересчетеНаЕдиницу * СтрокаТовар.Количество; // №13299
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
	
	Товары.Очистить();
	Для Каждого СтрокаТовар Из ТаблицаТоваровРеализации Цикл
		Если СтрокаТовар.Количество > 0 Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовар);
			//НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация), , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
			ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
		КонецЕсли;
	КонецЦикла;
	
	Услуги.Очистить();
	Для Каждого СтрокаУслуги Из ТаблицаУслугРеализации Цикл
		Если СтрокаУслуги.Количество > 0 Тогда
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуги);
			//НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация), , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
			ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
		КонецЕсли;
	КонецЦикла;
	
	//++ №8373 признак создания ПТиУ
	//#11380 - смотрим не на ДанныеЗаполнения, а на Основание, так как не срабатывает при групповой отгрузке 
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		УстановитьПривилегированныйРежим(Истина);		
		РегламентноеЗаданиеПоИнтеркампани = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.СозданиеПоступленийТоваровОтПроизводства);
		Если Основание.ЭтоЗаказОтРозницы 
			И (Константы.РучнойЗапускОбработкиСозданияДокументовПоступленийПотолковВРозницеОтПроизводства.Получить() ИЛИ РегламентноеЗаданиеПоИнтеркампани.Использование) Тогда
			
			АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуПоИнтеркампани = Истина;
			НастройкаИнтеркампани = Основание.НастройкаИнтеркампани; //++ №7764
			
		ИначеЕсли ПолучитьФункциональнуюОпцию("СоздаватьДокументыПоступленийПоРучнымЗаказам") 
			//++ №7764 
			//И РегистрыСведений.СвязкиОрганизацийПроизводстваКонтрагентРозницы.ОтгрузкаПоСвязкеОрганизацииПроизводстваКонтрагентаРозницы(Организация, Контрагент, УДАЛИТЬ_ОрганизацияПоступления, УДАЛИТЬ_КонтрагентПоступления, УДАЛИТЬ_СкладПоступления)
			И РегистрыСведений.СвязкиОрганизацийПроизводстваКонтрагентРозницы.ОтгрузкаПоСвязкеОрганизацииПроизводстваКонтрагентаРозницы(Организация, Контрагент) Тогда
			//-- №7764						
		
			АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуСозданныхВручную = Истина;			
			
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
	//КонецЕсли;
	//-- №8373
	
	//nva+++
	НоваяСтрока = ИсторияВыдачи.Добавить();
	НоваяСтрока.Дата = ТекущаяДатаСеанса();
	НоваяСтрока.Пользователь = Пользователи.ТекущийПользователь(); 
	
	СтатусОтгрузки = Справочники.СтатусыОтгрузки.ВыполнитьСборку; 
	
	НоваяСтрока.Статус = СтатусОтгрузки;
	//nva---
	
КонецПроцедуры

Процедура ДополнитьТаблицуВыработки(ТаблицаПоВыработке)
	
	ТаблицаПоВыработке.Колонки.Добавить("Период");
	ТаблицаПоВыработке.Колонки.Добавить("Регистратор");
	ТаблицаПоВыработке.Колонки.Добавить("ОбъектВыработки");
	ТаблицаПоВыработке.Колонки.Добавить("Подразделение");
	ТаблицаПоВыработке.Колонки.Добавить("ЭтоРозница");
	
	ТаблицаПоВыработке.ЗаполнитьЗначения(?(Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Дата), "Период");
	ТаблицаПоВыработке.ЗаполнитьЗначения(Ссылка, "Регистратор");
	ТаблицаПоВыработке.ЗаполнитьЗначения(Ссылка, "ОбъектВыработки");
	ТаблицаПоВыработке.ЗаполнитьЗначения(Подразделение, "Подразделение");
	ТаблицаПоВыработке.ЗаполнитьЗначения(ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор"), "ЭтоРозница");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли