
&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	М = Новый Массив;
	Для Каждого Стр Из ВыбранныеЗначения Цикл
		М.Добавить(Стр.Значение);
	КонецЦикла;
	
	Закрыть(М);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	
	Ф = ПолучитьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, Элементы.ВыбранныеЗначения, Элементы.ВыбранныеЗначения);
	
	Если Ф = Неопределено Тогда 
		//Форма не найдена
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ТекстОшибки = "Форма выбора не найдена";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Ф.ВладелецФормы = Элементы.ВыбранныеЗначения;
	Ф.ЗакрыватьПриВыборе = Ложь;
	
	РеквизитСписок = Неопределено;
	//Пытаемся найти основной реквизит формы - динамический список/Справочник список, с обычными именами
	МасРеквФормы = Новый Массив;
	МасРеквФормы.Добавить("СправочникСписок");
	МасРеквФормы.Добавить("ПользователиСписок");
	МасРеквФормы.Добавить("Список");
	Для Каждого Эл Из МасРеквФормы Цикл
		Попытка
			РеквизитСписок = Ф[Эл];
			ИмяДинСписка = "" + Эл;
			Прервать;
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	Если РеквизитСписок = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ТекстОшибки = "Список формы не найден!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(Ф) = Тип("УправляемаяФорма") Тогда
					
		Отбор = РеквизитСписок.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
		Элемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Элемент.ПравоеЗначение = Ложь;
		
	ИначеЕсли ТипЗнч(Ф) = Тип("Форма") Тогда
		
		ЭлементПометка = Ф[ИмяДинСписка].Отбор.ПометкаУдаления;
		ЭлементПометка.Использование = Истина;
		ЭлементПометка.Значение = Ложь;
		
	КонецЕсли;
	
	Ф.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеЗначенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыбранныеЗначения.Добавить().Значение = ВыбранноеЗначение;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.Значения) = Тип("Массив") Тогда
		Для Каждого М из Параметры.Значения Цикл
			ВыбранныеЗначения.Добавить().Значение = М;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
