
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сайт", СайтУзлаОбмена(ПараметрКоманды));
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
 
	ОткрытьФорму("РегистрСведений.ИдентификаторыОбъектовWikki.ФормаСписка", 
				ПараметрыФормы, 
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Уникальность,
				ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

&НаСервере
Функция СайтУзлаОбмена(УзелОбмена)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелОбмена, "Сайт");
	
КонецФункции

