
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
                                    Новый Структура("ЗаказПокупателя", ПараметрКоманды), 
                                    "ВаловаяПрибыльПроизводство", 
                                    Истина);

	ОткрытьФорму("Отчет.ВаловаяПрибыльПроизводство.Форма", 
				 ПараметрыФормы, 
				 ПараметрыВыполненияКоманды.Источник, 
				 Новый УникальныйИдентификатор, //ПараметрыВыполненияКоманды.Уникальность, 
				 ПараметрыВыполненияКоманды.Окно, 
				 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
