//_____________________________________________________________
// Вид:
// 0 - Элементы дерева переменных
// 1 - Нельзя выбрать в формулу, используется для группировки
// 2 - строковые выражения, к-е можно редактировать
// 3 - строковые константы

&НаСервере
Процедура СкомпоноватьФормулу()
    Если РежимРаботы = Перечисления.ИА_БФФормулыТип.ОдноЗначение Тогда
        Пока ТабФормула.Количество() > 1 Цикл
            ТабФормула.Удалить(0);
        КонецЦикла; 
    КонецЕсли; 
    
    Текст = "";
    Для каждого Стр Из ТабФормула Цикл
        ЭтоОперация = Истина; // 13.04.2015 ИА_ Аврамов (1) ToDo:  
        ПредставлениеЭлемента = Стр.Данные;
        Текст = Текст + ПредставлениеЭлемента;
    КонецЦикла; 
    ПредставлениеФормулы = Текст;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлемент(Представление, Данные, Вид = 2)
    НС = ТабФормула.Добавить();
    НС.Представление = Представление;
    НС.Данные = Данные;
    НС.Вид = Вид;
    
    СкомпоноватьФормулу();
КонецПроцедуры

&НаСервере
Функция СобратьДанныеДляВозврата(Отказ)
    СкомпоноватьФормулу();
    
    Контекст = ИА_БФКС.РедакторФормул_СформироватьПустуюФормулу();
    Контекст.Вид                   = ИсходныеДанныеФормулы.Вид;
    Контекст.Переменные            = ИА_БФС.ДЗ2ДЗФ(РеквизитФормыВЗначение("Переменные"));
    Контекст.СоставФормулы         = ИА_БФС.ТЗ2ТЗФ(ТабФормула.Выгрузить());
    Контекст.ПредставлениеФормулы  = ПредставлениеФормулы;
    Контекст.ОбработкаПроверкиФормулы = ИсходныеДанныеФормулы.ОбработкаПроверкиФормулы;
    
    Если ЗначениеЗаполнено(Контекст.ОбработкаПроверкиФормулы) Тогда
        Попытка
            ФормулаВерна = Вычислить(Контекст.ОбработкаПроверкиФормулы);
        Исключение
            ФормулаВерна = Ложь;
            ТекстОшибки = ОписаниеОшибки();
            ИА_БФКС.СообщениеОбОшибке("Ошибка проверки формулы: " + ТекстОшибки, Отказ); 
        КонецПопытки; 
        Отказ = НЕ ФормулаВерна;
    КонецЕсли; 
    
    Возврат Контекст;
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
    Элементы.ОперацииСтрока.Видимость = РежимРаботы = Перечисления.ИА_БФФормулыТип.Строка;
КонецПроцедуры

//_____________________________________________________________



&НаКлиенте
Процедура ОК(Команда)
    Отказ = Ложь;
    Данные = Новый Структура("ДанныеФормулы, Вид, Уникальность"
    , СобратьДанныеДляВозврата(Отказ)
    , "РедакторФормул"
    , Уникальность);
    Если НЕ Отказ Тогда
        ОповеститьОВыборе(Данные);
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТабФормулаПриИзменении(Элемент)
    СкомпоноватьФормулу();
КонецПроцедуры

&НаКлиенте
Процедура ПеременныеПередРазворачиванием(Элемент, Строка, Отказ)
    ПеременныеПередРазворачиваниемНаСервере(Строка);
КонецПроцедуры

&НаСервере
Процедура ПеременныеПередРазворачиваниемНаСервере(Строка)
    ТекСтрока = Переменные.НайтиПоИдентификатору(Строка);
    Если ТекСтрока <> Неопределено Тогда
        Ветки = ТекСтрока.ПолучитьЭлементы();        
        Если Ветки.Количество() = 1 И Ветки[0].Представление="стаб" Тогда
            Ветки.Очистить();
            ТабТипов = ПолучитьТипыНаСервере(ТекСтрока.ОписаниеТипа);
            
            
            ТолькоОдинТип = ТабТипов.Количество() = 1;
            
            Если ТолькоОдинТип Тогда
                ДостроитьДерево(Ветки
                , ТабТипов[0].ИмяДляЗапроса
                , ТекСтрока.ПутьДанных
                , ТабТипов[0].МенеджерМД
                , ТабТипов[0].ИмяМД);
            Иначе
                Для каждого СтрТипа Из ТабТипов Цикл
                    Если ЗначениеЗаполнено(СтрТипа.ИмяДляЗапроса) Тогда
                        НовВеткаТипа = Ветки.Добавить();
                        НовВеткаТипа.Представление = СтрТипа.ИмяДляЗапроса;
                        Ветки2 = НовВеткаТипа.ПолучитьЭлементы();
                        
                        ДостроитьДерево(Ветки2
                        , СтрТипа.ИмяДляЗапроса
                        , ТекСтрока.ПутьДанных
                        , СтрТипа.МенеджерМД
                        , СтрТипа.ИмяМД);
                    КонецЕсли; 
                КонецЦикла; 
            КонецЕсли; 
            
            
            Эл = ТекСтрока.ПутьДанных;
        КонецЕсли; 
    КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипыНаСервере(ОписаниеТипа)
    ТабТипов = ИА_БФС.Типы_ОписаниеТипов2ТаблицаСтроковыхТипов(ОписаниеТипа);
    ТабТипов = ИА_БФС.ТЗ2ТЗФ(ТабТипов);
    Возврат ТабТипов;
КонецФункции

//&НаКлиенте
&НаСервере
Процедура ДостроитьДерево(Ветки, ИмяДляЗапроса, ПутьДо, МенеджерМД, ИмяМД)
    
    ТабРеквизиты = ИА_БФС.Запрос_ВыполнитьВТЗ("ВЫБРАТЬ ТаблицаВсехРеквизитов.* ИЗ " + ИмяДляЗапроса + " как ТаблицаВсехРеквизитов ГДЕ ЛОЖЬ");
    Для каждого Стр Из ТабРеквизиты.Колонки Цикл
        Таб  = ИА_БФС.Типы_ОписаниеТипов2ТаблицаСтроковыхТипов(Стр.ТипЗначения);
        ЭтоСсылочныйТип = ИА_БФС.ТЗ_ФильтрПоОтбору(Таб, Новый Структура("Ссылочный", Истина)).Количество() > 0;
        ЭтоТЗ           = ИА_БФС.ТЗ_ФильтрПоОтбору(Таб, Новый Структура("Имя", "ТаблицаЗначений")).Количество() > 0;
        Если ЭтоТЗ Тогда
            Продолжить;
        КонецЕсли; 
        
        ПредставлениеРеквизита = ДостроитьДеревоПолучитьДанныхМД(ИмяМД, МенеджерМД, Стр);
        
        
        
        НовВетка = Ветки.Добавить();
        НовВетка.Представление = ПредставлениеРеквизита;
        НовВетка.ПутьДанных    = ПутьДо + "." + Стр.Имя;
        НовВетка.ОписаниеТипа  = Стр.ТипЗначения;
        
        Если ЭтоСсылочныйТип Тогда
            ВеткаСтаб = НовВетка.ПолучитьЭлементы().Добавить();
            ВеткаСтаб.Представление = "стаб";
        КонецЕсли; 
        
    КонецЦикла;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДостроитьДеревоПолучитьДанныхМД(ИмяМД, МенеджерМД, Стр)
    ПредставлениеРеквизита = Стр.Имя;
    Попытка
        Реквизит = Метаданные[МенеджерМД][ИмяМД].Реквизиты.Найти(Стр.Имя);
        Если Реквизит <> Неопределено Тогда
            ПредставлениеРеквизита  = Реквизит.Синоним;
        КонецЕсли; 
    Исключение
        ТекстОшибки = ОписаниеОшибки();
    КонецПопытки;
    Возврат ПредставлениеРеквизита;
    
КонецФункции

&НаКлиенте
Процедура ДеревоВывестиРеквизиты()
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ДанныеФормулы = ИА_БФКС.РедакторФормул_СформироватьПустуюФормулу();
    Если Параметры.Свойство("ДанныеФормулы") Тогда
        ЗаполнитьЗначенияСвойств(ДанныеФормулы, Параметры.ДанныеФормулы);
    КонецЕсли; 
    
    РежимРаботы = ДанныеФормулы.Вид;
    // 15.04.2015 ИА_ Аврамов (1) ToDo: Перечисления.ИА_БФФормулыТип обработать разные режимы работы: строки, число и т.п.
    
    Параметры.Свойство("Уникальность", Уникальность);
    
    ИсходныеДанныеФормулы = ДанныеФормулы;
    
    ДЗ = ИА_БФС.ДЗФ2ДЗ(ДанныеФормулы.Переменные);
    ЗначениеВРеквизитФормы(ДЗ, "Переменные");
    
    ТЗ = ИА_БФС.ТЗФ2ТЗ(ДанныеФормулы.СоставФормулы);
    ТабФормула.Загрузить(ТЗ);
    СкомпоноватьФормулу();
    УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ТабФормулаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
    Если Строка = Неопределено Тогда
        Индекс = -1;
    Иначе
        Индекс = ТабФормула.Индекс(ТабФормула.НайтиПоИдентификатору(Строка)) + 1;
    КонецЕсли; 
    
    ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
    СтандартнаяОбработка = Ложь;
    
    Для каждого Эл Из ПараметрыПеретаскивания.Значение Цикл
        Если НЕ ИА_БФКС.РеквизитЕсть(Эл, "Вид") Тогда
            Продолжить;
        КонецЕсли; 
        ДобавитьЭлементВФормулу(Эл, Индекс);
    КонецЦикла; 
    СкомпоноватьФормулу();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементВФормулу(СтрокаПеременной, Индекс)
    Если СтрокаПеременной.Вид = 0 Тогда
        Если Индекс < 0 Тогда
            НовСтрока = ТабФормула.Добавить();	
        Иначе
            НовСтрока = ТабФормула.Вставить(Индекс);
        КонецЕсли; 
        
        ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаПеременной);
        НовСтрока.Данные         = "<" + НовСтрока.Представление + ">";
        НовСтрока.Представление  = НовСтрока.Данные;
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьСтроку(Команда)
    стр = "";
    ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавитьСтрокуЗавершение", ЭтотОбъект, Новый Структура("стр", стр)), стр, "Введите строку:"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	стр = ?(Строка = Неопределено, ДополнительныеПараметры.стр, Строка);
	
	
	Если (Строка <> Неопределено) Тогда
		ДобавитьЭлемент(Стр, Стр, 2);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТабФормулаПриАктивизацииЯчейки(Элемент)
    
    
КонецПроцедуры

&НаКлиенте
Процедура ТабФормулаПередНачаломИзменения(Элемент, Отказ)
    ТекСтрока = Элементы.ТабФормула.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        Отказ = ТекСтрока.Вид = 0 ИЛИ ТекСтрока.Вид = 1 ИЛИ ТекСтрока.Вид = 3;
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПереводСтроки(Команда)
    ДобавитьЭлемент("<<Перевод строки>>", Символы.ПС, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПробел(Команда)
    ДобавитьЭлемент("<<Пробел>>", " ", 3);
КонецПроцедуры

&НаКлиенте
Процедура ПеременныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    ТекСтрока = Элемент.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        СтандартнаяОбработка = Ложь;
        ДобавитьЭлементВФормулу(ТекСтрока, -1);
        СкомпоноватьФормулу();
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеДанные(Команда)
    Элементы.ТабФормулаПутьДанных.Видимость = Истина;
    Элементы.ПеременныеПутьДанных.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабФормулаПредставлениеПриИзменении(Элемент)
    ТекСтрока = Элементы.ТабФормула.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        Если ТекСтрока.Вид = 2 Тогда
            ТекСтрока.Данные = ТекСтрока.Представление;
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры
