
&НаСервере
Процедура СформироватьНаСервере()
	ИспПодр = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	ДоходыПодр = Константы.КСУ_ДоходыПоПодразделениям.Получить();
	ПодрДетализация = ИспПодр и не ДоходыПодр; 
	
	ТабДок.Очистить();
	
	отч = РеквизитФормыВЗначение("Отчет");
	макет = отч.ПолучитьМакет("Макет");
	
	Обл = макет.ПолучитьОбласть("Шапка");
	обл.параметры.ДатаОтчета = ТекущаяДата();
	обл.параметры.Период = формат(ДатаНачала,"ДФ=dd.MM.yyyy") + " - " + формат(ДатаКонца,"ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	ВыбФонды = Новый массив;
	Для каждого стр из Фонды Цикл
		Если стр.выбрать Тогда
			ВыбФонды.Добавить(стр.фонд);
		КонецЕсли;
	КонецЦикла;
	ВсеФонды = ВыбФонды.Количество() = Фонды.Количество();
	
	ВыбОперации = Новый массив;
	Для каждого стр из ВидыОпераций Цикл
		Если стр.выбрать Тогда
			ВыбОперации.Добавить(стр.ВидОперации);
		КонецЕсли;
	КонецЦикла;
	ВсеОперации = ВыбОперации.Количество() = ВидыОпераций.Количество();
	
	Если не ВсеФонды Тогда
		Обл = макет.ПолучитьОбласть("НеВсеФонды");		
		ТабДок.Вывести(обл);
	КонецЕсли;
	
	Если не ВсеОперации Тогда
		Обл = макет.ПолучитьОбласть("НеВсеОперации");		
		ТабДок.Вывести(обл);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДатаКонца));
	Запрос.УстановитьПараметр("Фонды", ВыбФонды);
	Запрос.УстановитьПараметр("Операции", ВыбОперации);
	
	для каждого стрОрг из Организации Цикл
		если не стрОрг.Выбрать тогда
			Продолжить;
		КонецЕсли;
		
		/////////// ОРГАНИЗАЦИЯ
		Обл = макет.ПолучитьОбласть("ГруппаОрганизация");
		обл.параметры.Организация = стрОрг.Организация;
		ТабДок.Вывести(обл);
		
		// подготовка данных
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд.Счет КАК Счет,
		               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд КАК Фонд,
		               |	0 КАК Лимит,
		               |	СУММА(ИА_СредстваНаФондахОстаткиИОбороты.СуммаБезналНачальныйОстаток) КАК НачальныйОстаток,
		               |	СУММА(ИА_СредстваНаФондахОстаткиИОбороты.СуммаБезналПриход) КАК Приход,
		               |	СУММА(ИА_СредстваНаФондахОстаткиИОбороты.СуммаБезналРасход) КАК Расход,
		               |	СУММА(ИА_СредстваНаФондахОстаткиИОбороты.СуммаБезналКонечныйОстаток) КАК КонечныйОстаток,
		               |	ВЫБОР
		               |		КОГДА &ИспПодр
		               |			ТОГДА ИА_СредстваНаФондахОстаткиИОбороты.Подразделение
		               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
		               |	КОНЕЦ КАК Подразделение,
		               |	ВЫБОР
		               |		КОГДА &ИспПодр
		               |			ТОГДА ИА_СредстваНаФондахОстаткиИОбороты.Подразделение.Наименование
		               |		ИНАЧЕ """"
		               |	КОНЕЦ КАК ПодразделениеНаименование
		               |ИЗ
		               |	РегистрНакопления.ИА_СредстваНаФондах.ОстаткиИОбороты(
		               |			&ДатаНачала,
		               |			&ДатаКонца,
		               |			Период,
		               |			,
		               |			Организация = &Организация
		               |				И Фонд В (&Фонды)) КАК ИА_СредстваНаФондахОстаткиИОбороты		             
					   |СГРУППИРОВАТЬ ПО
		               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд.Счет,
		               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд,
		               |	ВЫБОР
		               |		КОГДА &ИспПодр
		               |			ТОГДА ИА_СредстваНаФондахОстаткиИОбороты.Подразделение
		               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА &ИспПодр
		               |			ТОГДА ИА_СредстваНаФондахОстаткиИОбороты.Подразделение.Наименование
		               |		ИНАЧЕ """"
		               |	КОНЕЦ
		               |
		               |ИМЕЮЩИЕ
		               |	(СУММА(ИА_СредстваНаФондахОстаткиИОбороты.СуммаБезналНачальныйОстаток) > 0
		               |		ИЛИ СУММА(ИА_СредстваНаФондахОстаткиИОбороты.СуммаБезналПриход) > 0
		               |		ИЛИ СУММА(ИА_СредстваНаФондахОстаткиИОбороты.СуммаБезналРасход) > 0
		               |		ИЛИ СУММА(ИА_СредстваНаФондахОстаткиИОбороты.СуммаБезналКонечныйОстаток) > 0)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд.Счет.Наименование,
		               |	ПодразделениеНаименование,
		               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд.Наименование";
		Запрос.УстановитьПараметр("Организация", стрОрг.Организация);
		Запрос.УстановитьПараметр("ИспПодр", ИспПодр);
		тз_счетаФонды = запрос.Выполнить().Выгрузить();
		тз_счета = тз_счетаФонды.Скопировать();
		Если ДоходыПодр Тогда
			тз_счета.Свернуть("Счет,Подразделение", "НачальныйОстаток,Приход,Расход,КонечныйОстаток"); 
		Иначе
			тз_счета.Свернуть("Счет", "НачальныйОстаток,Приход,Расход,КонечныйОстаток"); 
		КонецЕсли;
		
		Если тз_счетаФонды.Количество() = 0 Тогда
			Обл = макет.ПолучитьОбласть("НетДвижений");		
			ТабДок.Вывести(обл);
		
			Продолжить;
		КонецЕсли;
		
		тзПодрДоход = тз_счетаФонды.Скопировать();		
		Если ДоходыПодр Тогда
			тзПодрДоход.Свернуть("Подразделение");
		Иначе
			тзПодрДоход.Очистить();
			нСтр = тзПодрДоход.Добавить();
		КонецЕсли;
		
		Для каждого стрподрДоход из тзПодрДоход Цикл
			
			Если ДоходыПодр Тогда
				Обл = макет.ПолучитьОбласть("ДетализацияШапкаПодр");
				обл.параметры.Подразделение = "Подразделение: " + стрподрДоход.Подразделение;					
				ТабДок.Вывести(обл);
			КонецЕсли;									
		
			/////////// СЧЕТА
			ВыводитьСчета = Настройки[0].Выбрать;
			
			Если ДоходыПодр Тогда
				СтрокиСчета = тз_счета.НайтиСтроки(Новый Структура("Подразделение", стрподрДоход.Подразделение)); 
			Иначе
				СтрокиСчета = тз_счета; 
			КонецЕсли;
			
			Если ВыводитьСчета Тогда
				Обл = макет.ПолучитьОбласть("СчетаШапка");
				ТабДок.Вывести(обл);
				
				НачальныйОстаток = 0;
				Приход = 0;
				Расход = 0;
				КонечныйОстаток = 0;
				Для каждого стрСчет из СтрокиСчета Цикл
					Обл = макет.ПолучитьОбласть("СчетаСтрока");
					ЗаполнитьЗначенияСвойств(обл.параметры, стрСчет);
					ТабДок.Вывести(обл);
					
					НачальныйОстаток = НачальныйОстаток + стрСчет.НачальныйОстаток;
					Приход = Приход + стрСчет.Приход;
					Расход = Расход + стрСчет.Расход;
					КонечныйОстаток = КонечныйОстаток + стрСчет.КонечныйОстаток;
				КонецЦикла;
				
				Обл = макет.ПолучитьОбласть("СчетаИтого");
				обл.параметры.НачальныйОстаток = НачальныйОстаток;
				обл.параметры.Приход = Приход;
				обл.параметры.Расход = Расход;
				обл.параметры.КонечныйОстаток = КонечныйОстаток;
				ТабДок.Вывести(обл);
			КонецЕсли;
			
			/////////// ФОНДЫ
			ВыводитьФонды = Настройки[1].Выбрать;
			
			Если ВыводитьФонды Тогда
				Обл = макет.ПолучитьОбласть("ФондыШапка");
				ТабДок.Вывести(обл);
				
				
				Для каждого стрСчет из СтрокиСчета Цикл
					Если ПодрДетализация Тогда
						Обл = макет.ПолучитьОбласть("ФондыШапкаСчет_подр");
					Иначе
						Обл = макет.ПолучитьОбласть("ФондыШапкаСчет");
					КонецЕсли;
						
					обл.параметры.Счёт = стрСчет.Счет;
					ТабДок.Вывести(обл);
					
					Если ДоходыПодр Тогда
						СтрокиФонда = тз_счетаФонды.НайтиСтроки(Новый Структура("счет, Подразделение", стрСчет.Счет, стрподрДоход.Подразделение));
					Иначе
						СтрокиФонда = тз_счетаФонды.НайтиСтроки(Новый Структура("счет", стрСчет.Счет));
					КонецЕсли;
					
					НачальныйОстаток = 0;
					Приход = 0;
					Расход = 0;
					КонечныйОстаток = 0;
					Для каждого стрФонд из СтрокиФонда Цикл
						Если ПодрДетализация Тогда
							Обл = макет.ПолучитьОбласть("ФондыСтрока_подр");
						Иначе
							Обл = макет.ПолучитьОбласть("ФондыСтрока");
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(обл.параметры, стрФонд);
						Если стрФонд.Лимит > 0 Тогда
							обл.параметры.Фонд =  строка(стрФонд.Фонд) + " ( лимит " + формат(стрФонд.Лимит,"ЧДЦ=2") + " )";
						КонецЕсли;
						ТабДок.Вывести(обл);
						
						НачальныйОстаток = НачальныйОстаток + стрФонд.НачальныйОстаток;
						Приход = Приход + стрФонд.Приход;
						Расход = Расход + стрФонд.Расход;
						КонечныйОстаток = КонечныйОстаток + стрФонд.КонечныйОстаток;
					КонецЦикла;
					
					Обл = макет.ПолучитьОбласть("ФондыИтого");
					обл.параметры.НачальныйОстаток = НачальныйОстаток;
					обл.параметры.Приход = Приход;
					обл.параметры.Расход = Расход;
					обл.параметры.КонечныйОстаток = КонечныйОстаток;
					ТабДок.Вывести(обл);
				КонецЦикла;
			КонецЕсли;
			
			/////////// ФОНДЫ ДЕТАЛИЗАЦИЯ
			ВыводитьДетализациюФонды = Настройки[2].Выбрать;
			
			Если ВыводитьДетализациюФонды тогда
				Обл = макет.ПолучитьОбласть("ДетализацияШапка");
				ТабДок.Вывести(обл);
				
				Если ПодрДетализация Тогда				
					тзПодр = тз_счетаФонды.Скопировать();
					тзПодр.Свернуть("Подразделение");
					Для каждого стрподр из тзПодр Цикл
						Обл = макет.ПолучитьОбласть("ДетализацияШапкаПодр");
						обл.параметры.Подразделение = "Подразделение: " + стрподр.Подразделение;					
						ТабДок.Вывести(обл);
						
						СтрокиПодр = тз_счетаФонды.НайтиСтроки(Новый Структура("Подразделение", стрподр.Подразделение));
						ВывестиДетализацию(запрос, макет, табдок, СтрокиПодр, ВсеОперации, ДатаНачала, стрподр.Подразделение);
					КонецЦикла;
				Иначе
					Если ДоходыПодр Тогда
						СтрокиПодр = тз_счетаФонды.НайтиСтроки(Новый Структура("Подразделение", стрподрДоход.Подразделение));
						ВывестиДетализацию(запрос, макет, табдок, СтрокиПодр, ВсеОперации, ДатаНачала, стрподрДоход.Подразделение);
					Иначе
						СтрокиПодр = тз_счетаФонды; 
						ВывестиДетализацию(запрос, макет, табдок, СтрокиПодр, ВсеОперации, ДатаНачала);
					КонецЕсли;										
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; // по Подразделениям
	КонецЦикла; // по организациям
	
	Обл = макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(обл);
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	
	Элементы.ТабДок.РежимМасштабированияПросмотра = РежимМасштабированияПросмотра.Обычный;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиДетализацию(запрос, макет, табдок, тз_счетаФонды, ВсеОперации, ДатаНачала, ОтборПодр = Неопределено)
	для каждого стрФонд из тз_счетаФонды Цикл
		Если ВсеОперации Тогда
			Обл = макет.ПолучитьОбласть("ДетализацияШапкаФонд");
		Иначе
			Обл = макет.ПолучитьОбласть("ДетализацияШапкаФондБезОстатка");
		КонецЕсли;
		Обл.Параметры.Фонд = стрФонд.Фонд;
		Если стрФонд.Лимит > 0 Тогда
			обл.параметры.Фонд =  строка(стрФонд.Фонд) + " ( лимит " + формат(стрФонд.Лимит,"ЧДЦ=2") + " )";
		КонецЕсли;
		ТабДок.Вывести(обл);

		// начальный остаток
		ВхОст = стрФонд.НачальныйОстаток; 
		
		Если ВсеОперации Тогда					
			Обл = макет.ПолучитьОбласть("ДетализацияСтрока");
			обл.параметры.Период = ДатаНачала;
			обл.параметры.Операция = "Остаток на начало периода";
			обл.параметры.Остаток = ВхОст;
			ТабДок.Вывести(обл);
		КонецЕсли;
		
		запрос.Текст = "ВЫБРАТЬ
		               |	ИА_СредстваНаФондах.Период КАК Период,
		               |	ИА_СредстваНаФондах.Регистратор КАК Регистратор,
		               |	ИА_СредстваНаФондах.ВидДвижения КАК ВидДвижения,
		               |	ВЫБОР
		               |		КОГДА ИА_СредстваНаФондах.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
		               |			ТОГДА ИА_СредстваНаФондах.СуммаБезнал
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Приход,
		               |	ВЫБОР
		               |		КОГДА ИА_СредстваНаФондах.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
		               |			ТОГДА ИА_СредстваНаФондах.СуммаБезнал
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Расход,
		               |	ИА_СредстваНаФондах.Операция КАК Операция,
		               |	ИА_СредстваНаФондах.ПояснениеТекст КАК ПояснениеТЕкст,
		               |	ИА_СредстваНаФондах.ПояснениеСсылка КАК ПояснениеСсылка
		               |ИЗ
		               |	РегистрНакопления.ИА_СредстваНаФондах КАК ИА_СредстваНаФондах
		               |ГДЕ
		               |	ИА_СредстваНаФондах.Период МЕЖДУ &ДатаНачала И &ДатаКонца
		               |	И ИА_СредстваНаФондах.Организация = &Организация
		               |	И (ИА_СредстваНаФондах.Подразделение = &ОтборПодр ИЛИ &ОтборПодр = НЕОПРЕДЕЛЕНО)
					   |	И ИА_СредстваНаФондах.Фонд = &Фонд
		               |	И ИА_СредстваНаФондах.Операция В(&Операции)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ИА_СредстваНаФондах.Период";
		Запрос.УстановитьПараметр("Фонд", стрФонд.Фонд);
		Запрос.УстановитьПараметр("ОтборПодр", ОтборПодр);
		
		тзДетал = запрос.Выполнить().Выгрузить();
		Для каждого стрДет из тзДетал Цикл
			ВхОст = ВхОст + стрДет.Приход - стрДет.Расход;
			
			Если ВсеОперации Тогда
				Обл = макет.ПолучитьОбласть("ДетализацияСтрока");
			Иначе
				Обл = макет.ПолучитьОбласть("ДетализацияСтрокаБезОстатка");
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(обл.параметры, стрДет);
			обл.параметры.ПояснениеТекст = стрДет.ПояснениеТЕкст + " " + стрДет.ПояснениеСсылка; 
			Если ВсеОперации тогда
				обл.параметры.Остаток = ВхОст;
			КонецЕсли;
			ТабДок.Вывести(обл);
		КонецЦикла;
		
		Если ВсеОперации Тогда
			Обл = макет.ПолучитьОбласть("ДетализацияИтого");
		Иначе
			Обл = макет.ПолучитьОбласть("ДетализацияИтогоБезОстатка");
		КонецЕсли;

		обл.параметры.Приход = тзДетал.итог("Приход");
		обл.параметры.Расход = тзДетал.итог("Расход");
		Если ВсеОперации тогда
			обл.параметры.Остаток = ВхОст;
		КонецЕсли;
		ТабДок.Вывести(обл);
	КонецЦикла;
КонецПроцедуры
	
&НаКлиенте
Процедура Сформировать(Команда)

	если ДатаНачала = Дата(1,1,1) или ДатаКонца = Дата(1,1,1) ТОгда
		ПоказатьПредупреждение(,"Заполните период отчета!");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНастройки();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Сводные данные по счетам";
	НовстрН.Выбрать = истина;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Сводные данные по фондам";
	НовстрН.Выбрать = истина;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Детализация по фондам";
	НовстрН.Выбрать = истина;
	
	//
	МассОрг = ИА_ФПСервер.ПолучитьОрганизацииДляОтчетов();
	Для каждого орг из МассОрг Цикл
		НовстрН = Организации.Добавить();
		НовстрН.Организация = орг;
		НовстрН.Выбрать = истина;
	КонецЦикла;
	Если не Константы.ИА_ФП_ВестиФППоОрганизациям.Получить() Тогда
		НовстрН = Организации.Добавить();
		НовстрН.Организация = Справочники.Организации.ПустаяСсылка();
		НовстрН.Выбрать = истина;
	КонецЕсли;
	
	//
	ЭтоРСФ = иа_фп.ЭтоРСФ();
	Выборка= Справочники.ИА_Фонды.Выбрать(,,,"Наименование");
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			Если ЭтоРСФ или выборка.Защищенный = ложь Тогда
				НовстрН = Фонды.Добавить();
				НовстрН.Фонд = Выборка.Ссылка;
				НовстрН.Выбрать = истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	//
	для каждого во из Перечисления.КСУ_ОперацииПоФондам Цикл		
		НовстрН = ВидыОпераций.Добавить();
		НовстрН.ВидОперации = во;
		НовстрН.Выбрать = истина;		
	КонецЦикла;
	
	НовстрН = ВидыОпераций.Добавить();
	НовстрН.ВидОперации = Перечисления.КСУ_ОперацииПоФондам.ПустаяСсылка();
	НовстрН.Выбрать = истина;		
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьСкрытьФильтры(Команда)
	Элементы.ГруппаПравая.Видимость = не Элементы.ГруппаПравая.Видимость;
	Элементы.ПоказатьСкрытьФильтры.Заголовок = ?(Элементы.ГруппаПравая.Видимость, "Скрыть фильтры", "Показать фильтры")
КонецПроцедуры


&НаКлиенте
Процедура НастройкиВыбратьПриИзменении(Элемент)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Настройки1ВыбратьПриИзменении(Элемент)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ФондыВыбратьПриИзменении(Элемент)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВидыОперацийВыбратьПриИзменении(Элемент)
	Элементы.ГруппаВидыОпераций.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из ВидыОпераций Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаВидыОпераций.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеНастройки(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехНастроек(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Настройки Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеОрганизации(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехОрганизаций(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Организации Цикл
		стр.выбрать = ложь;
	КонецЦикла;

	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеФонды(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехФондов(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Фонды Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеОперации(Команда)
	Элементы.ГруппаВидыОпераций.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из ВидыОпераций Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыбоСоВсехОпераций(Команда)
	Элементы.ГруппаВидыОпераций.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из ВидыОпераций Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура СброситьФильтры(Команда)
	ВыбратьВсеНастройки(Неопределено);
	ВыбратьВсеОрганизации(Неопределено);
	ВыбратьВсеФонды(Неопределено);
	ВыбратьВсеОперации(Неопределено);
	
	Элементы.СброситьФильтры.Видимость = ложь;
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Скрыть();
	Элементы.ГруппаФонды.Скрыть();
	Элементы.ГруппаНастройки.Скрыть();
	Элементы.ГруппаВидыОпераций.Скрыть();
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Показать();
	Элементы.ГруппаФонды.Показать();
	Элементы.ГруппаНастройки.Показать();
	Элементы.ГруппаВидыОпераций.Показать();
КонецПроцедуры


&НаКлиенте
Процедура pdf(Команда)
	Оповещение  = Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтаФорма);
    ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогВыбора.ПолноеИмяФайла = "Движение по фондам "+ формат(ДатаНачала, "ДФ=dd.MM.yyyy") +"-" + формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	ДиалогВыбора.Расширение = "pdf";
    ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(МассивФайлов, ДопПараметры) Экспорт
    Если МассивФайлов = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ТабДок.Записать(МассивФайлов[0], ТипФайлаТабличногоДокумента.PDF);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаКонца = ТекущаяДата();
	ДатаНачала = ДатаКонца - 60*60*24 * 7;
КонецПроцедуры

