&НаКлиенте
Процедура ПрименитьПодсветку()	
	ОчиститьОформлениеНаСервере();
	ДобавитьУсловноеОформление();
	ЭтаФорма.СкомпоноватьРезультат();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПодсветку()
	ОчиститьОформлениеНаСервере();
	ЭтаФорма.СкомпоноватьРезультат();
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление()

    ЭлементОформления1 = Отчет.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления1.Представление = "ПодсветкаПредстоящихПлатежей";
	
	Группа1 = ЭлементОформления1.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    Группа1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
    Группа1.Использование = Истина;
	
    ЭлементыОтбора1 = Группа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементыОтбора1.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
    ЭлементыОтбора1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокПлатежа");
    ЭлементыОтбора1.ПравоеЗначение = ПериодПодсветкиНачало;
    ЭлементыОтбора1.Использование = Истина;
	
	ЭлементыОтбора2 = Группа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементыОтбора2.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементыОтбора2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокПлатежа");
	ЭлементыОтбора2.ПравоеЗначение = ПериодПодсветкиОкончание;
	ЭлементыОтбора2.Использование = Истина;

    ЭлементыОтбора3 = Группа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементыОтбора3.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
    ЭлементыОтбора3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОстатокДолга");
    ЭлементыОтбора3.ПравоеЗначение = 0;
    ЭлементыОтбора3.Использование = Истина;
    ЭлементОформления1.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
           
    ПоляОформления1 = ЭлементОформления1.Поля.Элементы.Добавить();
    ПоляОформления1.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьОформлениеНаСервере()
	Для каждого УслОформ из Отчет.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы Цикл
		Если УслОформ.Представление = "ПодсветкаПредстоящихПлатежей" Тогда
			НовоеОформление = УслОформ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ НовоеОформление = Неопределено Тогда	
		Отчет.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Удалить(НовоеОформление);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВариантовПериодовПодсветки();
	ПериодПодсветки = 0;
	ПериодПодсветкиНачало = Неопределено;
	ПериодПодсветкиОкончание = Неопределено;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВариантовПериодовПодсветки()
	Элементы.ПериодПодсветки.СписокВыбора.Добавить(0, "(не указан)");
	Элементы.ПериодПодсветки.СписокВыбора.Добавить(1, "За сегодня");
	Элементы.ПериодПодсветки.СписокВыбора.Добавить(2, "За предстоящую неделю");
	Элементы.ПериодПодсветки.СписокВыбора.Добавить(3, "За предстоящий месяц");
	Элементы.ПериодПодсветки.СписокВыбора.Добавить(4, "За произвольный период");
КонецПроцедуры

&НаКлиенте
Процедура ПериодПодсветкиПриИзменении(Элемент)
	Если ПериодПодсветки = 0 Тогда
		ПериодПодсветкиНачало = Неопределено;
		ПериодПодсветкиОкончание = Неопределено;
	ИначеЕсли ПериодПодсветки = 1 Тогда
		ПериодПодсветкиНачало = НачалоДня(ТекущаяДата());
		ПериодПодсветкиОкончание = ТекущаяДата();
	ИначеЕсли ПериодПодсветки = 2 Тогда
		ПериодПодсветкиНачало = НачалоДня(ТекущаяДата());
		ПериодПодсветкиОкончание = НачалоДня(ТекущаяДата()) + 604800;
	ИначеЕсли ПериодПодсветки = 3 Тогда
		ПериодПодсветкиНачало = НачалоДня(ТекущаяДата());
		ПериодПодсветкиОкончание = ДобавитьМесяц(НачалоДня(ТекущаяДата()), 1);	
	КонецЕсли;
	
	Если ПериодПодсветки = 0 Тогда
		ОчиститьПодсветку();
	Иначе
		ПрименитьПодсветку();
	конецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПодсветкиНачалоПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(ПериодПодсветкиНачало) Тогда
		ПериодПодсветки = 0;
		ОчиститьПодсветку();
		ПериодПодсветкиОкончание = Неопределено;
	Иначе
		ПериодПодсветки = 4;
		ПрименитьПодсветку();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПодсветкиОкончаниеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(ПериодПодсветкиОкончание) Тогда
		ПериодПодсветки = 0;
		ОчиститьПодсветку();
		ПериодПодсветкиНачало = Неопределено;
	Иначе
		ПериодПодсветки = 4;
		ПрименитьПодсветку();
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Настройки);	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СохранитьПользовательскиеНастройкиНаСервере();	
КонецПроцедуры

&НаСервере
Процедура СохранитьПользовательскиеНастройкиНаСервере()
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
КонецПроцедуры	

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
КонецПроцедуры
