
&НаСервере
Функция СкачатьОбработкуНаСервере()
	
	ВременноеИмяФайла = ПолучитьИмяВременногоФайла("epf");
	
	МакетСДанными = ПолучитьОбщийМакет("ОбработкаЗагрузкиДанныхВБухгалтерию");
	МакетСДанными.Записать(ВременноеИмяФайла);
	
	АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременноеИмяФайла), ЭтаФорма.УникальныйИдентификатор);
	
	ВерсияОбработки = "1.0.0.0";
	Попытка
        АдресОбработки  = ВнешниеОбработки.Подключить(АдресВХ,, Ложь);
        Обработка       = ВнешниеОбработки.Создать(АдресОбработки, Ложь);
		ВерсияОбработки = Обработка.ВерсияОбработки();
    Исключение
	КонецПопытки;
	
	Возврат Новый Структура("АдресВХ, ВерсияОбработки", АдресВХ, ВерсияОбработки);
	
КонецФункции

&НаКлиенте
Процедура СкачатьОбработку(Команда)
	
	ДанныеФайла = СкачатьОбработкуНаСервере();
	ВременноеИмя = СтрШаблон("Перенос документов из SmartCeilings в 1СБухгалтерия %1.epf", ДанныеФайла.ВерсияОбработки);
	
	ПолучитьФайл(ДанныеФайла.АдресВХ, ВременноеИмя, Истина);
	//НачатьПолучениеФайлаССервера(ДанныеФайла.АдресВХ, ВременноеИмя,
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработку(Команда)
	
	ОткрытьФорму("Обработка.ВыгрузкаДокументовИзSmartCeilingsВ1СБухгалтерия.Форма.Форма");
	
КонецПроцедуры
