
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОчиститьПользователяВЗаписях(Пользователь) Экспорт
	
	// вызывается при удалении пользователя
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка
	|ИЗ
	|	Справочник.ЭтапыВнедрения КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.КтоВыполнил = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.КтоВыполнил = Справочники.Пользователи.ПустаяСсылка();
		СпрОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли