&НаСервере
Процедура ОбновитьФормуДокумента()
	
	Элементы.ТекстСообщения.Доступность = Объект.ШаблонСМС.Пустая();
	
КонецПроцедуры

&НаСервере
Процедура ВызватьПроведениеДокумента()
	Объект.Ссылка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолучателейПоГруппеКатегории(ГруппаКонтрагентов, КатегорияКонтрагентов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Контрагент,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления
	|	И КонтрагентыКонтактнаяИнформация.Ссылка.НеОтправлятьСМС = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ФильтроватьПоГруппе
	|				ТОГДА КонтрагентыКонтактнаяИнформация.Ссылка В ИЕРАРХИИ (&ГруппаКонтрагентов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФильтроватьПоКатегории
	|				ТОГДА КонтрагентыКонтактнаяИнформация.Ссылка.Категория = &КатегорияКонтрагентов
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("ФильтроватьПоГруппе", ?(ГруппаКонтрагентов = Неопределено, Ложь, Истина));
	Запрос.УстановитьПараметр("ГруппаКонтрагентов", ГруппаКонтрагентов);
	Запрос.УстановитьПараметр("ФильтроватьПоКатегории", ?(КатегорияКонтрагентов = Неопределено, Ложь, Истина));
	Запрос.УстановитьПараметр("КатегорияКонтрагентов", КатегорияКонтрагентов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Получатели.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновнойТелефонКонтрагента(Контрагент)
	
	ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Сотрудники") Тогда		
		ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника;		
	КонецЕсли;
	
	НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, ВидТелефона);
	НомерТелефона = СофтФон.ОставитьТолькоЦифры(НомерТелефона);
	
КонецФункции
	
&НаКлиенте
Процедура ПолучателиКонтрагентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Получатели.ТекущиеДанные;
	НомерТелефона = ПолучитьОсновнойТелефонКонтрагента(ТекущиеДанные.Контрагент);	
	ТекущиеДанные.НомерТелефона = НомерТелефона;		
	ТекущиеДанные.Сумма = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппе(Команда)
	
	ПроцедураПослеВыбора = Новый ОписаниеОповещения("ПослеВводаЗначения",ЭтотОбъект,Параметры);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбораГруппы",,ЭтаФорма,,,,ПроцедураПослеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда
        ЗаполнитьПолучателейПоГруппеКатегории(ВыбЗнач, Неопределено);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаСпискаПоЗапросу(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
        Объект.Получатели.Очистить();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписок(Команда)
	ПроцедураОчистки = Новый ОписаниеОповещения("ОчисткаСпискаПоЗапросу",ЭтотОбъект,Параметры);
	Режим = РежимДиалогаВопрос.ДаНет;
	ПоказатьВопрос(ПроцедураОчистки,"Очистить список получателей?",Режим);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	ОбновитьФормуДокумента();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если Объект.Отправлено Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ПолучателиГруппаЗаполнить.Доступность = Ложь;
		Элементы.ФормаЗаписатьИОтправить.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.Основание) Тогда			
			Объект.Отправлено = Ложь;
		КонецЕсли;
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
		
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИОтправитьПослеВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Попытка			
			Объект.Отправлено = Истина;
			ЭтаФорма.Записать();			
			ВызватьПроведениеДокумента();
			ЭтаФорма.Закрыть(Объект.Ссылка);
		Исключение
			Объект.Отправлено = Ложь;
			ЭтаФорма.Записать();
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИОтправить(Команда)
	Доступно = ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала();
	Если НЕ Доступно Тогда
		Возврат;
	КонецЕсли;
		
	ПроцедураОтправки = Новый ОписаниеОповещения("ЗаписатьИОтправитьПослеВопроса",ЭтотОбъект,Параметры);
	Режим = РежимДиалогаВопрос.ДаНет;
	ПоказатьВопрос(ПроцедураОтправки,"Отправляем СМС?",Режим);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДнюРождения(Команда)	
	
	ДатаРождения = ТекущаяДата();
	ВведеннаяДата = ВвестиДату(ДатаРождения, "Введите дату рождения", ЧастиДаты.Дата);
	Если ВведеннаяДата И ДатаРождения <> Дата(1,1,1) Тогда
		ПослеЗакрытияВопросаОЗаполненииПоДатеРожденияНаСервере(ДатаРождения);
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Процедура ПослеЗакрытияВопросаОЗаполненииПоДатеРожденияНаСервере(ДатаРождения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Контрагент,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|	И КонтрагентыКонтактнаяИнформация.Ссылка.ВидКонтрагента = &ВидКонтрагента
	|	И КонтрагентыКонтактнаяИнформация.Ссылка.ДатаРождения = &ДатаРождения
	|	И КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И КонтрагентыКонтактнаяИнформация.Ссылка.НеОтправлятьСМС = ЛОЖЬ";
	Запрос.УстановитьПараметр("ВидКонтрагента", Перечисления.ВидКонтрагента.ФизЛицо);
	Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Получатели.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры 

//-------------------------------- Получение текста по шаблону ----------------------------------------

&НаСервере
Процедура ШаблонСМСПриИзмененииНаСервере()
	Объект.ТекстСообщения = Объект.ШаблонСМС.Текст;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонСМСПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ТекстСообщения) Тогда
		ОП = новый ОписаниеОповещения("ПослеВопросаОИзмененииТекстаПоШаблону", ЭтотОбъект);
		ПоказатьВопрос(ОП, "Текст СМС будет очищен, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ШаблонСМСПриИзмененииНаСервере();
	КонецЕсли;
	
	ОбновитьФормуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОИзмененииТекстаПоШаблону(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ШаблонСМСПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры
//-------------------------------- //Получение текста по шаблону ----------------------------------------

&НаКлиенте
Процедура ЗаполнитьПоКатегории(Команда)
	ПроцедураПослеВыбора = Новый ОписаниеОповещения("ПослеВыбораКатегорииКонтрагента",ЭтотОбъект,Параметры);
	ОткрытьФорму("Справочник.КатегорииКонтрагентов.ФормаВыбора",,ЭтаФорма,,,,ПроцедураПослеВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКатегорииКонтрагента(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач <> Неопределено Тогда
        ЗаполнитьПолучателейПоГруппеКатегории(Неопределено, ВыбЗнач);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСуммеПродажЗаПериод(Команда)
	ПроцедураПослеВыбора = Новый ОписаниеОповещения("ПослеУказанияПериодаИСуммПродаж",ЭтотОбъект);
	ПФ = новый Структура("ТипЗаполнения", "ПоСуммеПродажЗаПериод");
	ОткрытьФорму("Документ.ОтправкаСМС.Форма.ФормаЗаполнения", ПФ, ЭтаФорма,,,,ПроцедураПослеВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПослеУказанияПериодаИСуммПродаж(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач <> Неопределено Тогда
        ЗаполнитьПолучателейПоСуммеПродажЗаПериод(ВыбЗнач);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолучателейПоСуммеПродажЗаПериод(ВыбЗнач)
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 //++ №6401 закомментировано, т.к. запрос не учитывает суммы возвратов
	 //	ниже новый запрос
	 //
	 //"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 //|	ПродажиОбороты.Контрагент,
	 //|	ПродажиОбороты.Контрагент.ОсновнойТелефон КАК НомерТелефона,
	 //|	СУММА(ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0)) КАК Сумма
	 //|ИЗ
	 //|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
	 //|ГДЕ
	 //|	ПродажиОбороты.СуммаОборот МЕЖДУ &НачальнаяСумма И &КонечнаяСумма
	 //|	И ПродажиОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	 //|
	 //|СГРУППИРОВАТЬ ПО ПродажиОбороты.Контрагент, ПродажиОбороты.Контрагент.ОсновнойТелефон";
	 
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ПродажиОбороты.Контрагент КАК Контрагент,
	 |	СУММА(ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0)) КАК Сумма
	 |	
	 |ПОМЕСТИТЬ ВТ
	 |
	 |ИЗ
	 |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ПродажиОбороты
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ПродажиОбороты.Контрагент
	 |	
	 |;
	 |///////////////////////////////////	
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ПродажиИтого.Контрагент,
	 |	ПродажиИтого.Сумма
	 |ИЗ
	 |	ВТ КАК ПродажиИтого
	 |ГДЕ
	 |	ПродажиИтого.Сумма МЕЖДУ &НачальнаяСумма И &КонечнаяСумма
	 |	";
	 //-- №6401
	 
	 Запрос.УстановитьПараметр("НачальнаяСумма", ВыбЗнач.НачальнаяСумма);
	 Запрос.УстановитьПараметр("КонечнаяСумма", ВыбЗнач.КонечнаяСумма);
	 Запрос.УстановитьПараметр("НачалоПериода", ВыбЗнач.НачалоПериода);
	 Запрос.УстановитьПараметр("КонецПериода", ВыбЗнач.КонецПериода);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
	 	НоваяСтрока = Объект.Получатели.Добавить();
	 	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		НоваяСтрока.НомерТелефона = ПолучитьОсновнойТелефонКонтрагента(Выборка.Контрагент);
	 КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьПоТекущемДолгу(Команда)
	ПроцедураПослеВыбора = Новый ОписаниеОповещения("ПослеУказанияСуммДолга",ЭтотОбъект);
	ПФ = новый Структура("ТипЗаполнения", "ПоСуммеДолга");
	ОткрытьФорму("Документ.ОтправкаСМС.Форма.ФормаЗаполнения", ПФ, ЭтаФорма,,,,ПроцедураПослеВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПослеУказанияСуммДолга(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач <> Неопределено Тогда
        ЗаполнитьПолучателейПоТекущемуДолгу(ВыбЗнач);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолучателейПоТекущемуДолгу(ВыбЗнач)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент КАК Контрагент,
	|	СУММА(ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0)) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток МЕЖДУ &НачальнаяСумма И &КонечнаяСумма
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент";
	Запрос.УстановитьПараметр("НачальнаяСумма", ВыбЗнач.НачальнаяСумма);
	Запрос.УстановитьПараметр("КонечнаяСумма", ВыбЗнач.КонечнаяСумма); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Получатели.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		НоваяСтрока.НомерТелефона = ПолучитьОсновнойТелефонКонтрагента(Выборка.Контрагент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоНоменклатуре(Команда)
	ПроцедураПослеВыбора = Новый ОписаниеОповещения("ПослеУказанияНоменклатуры",ЭтотОбъект);
	ПФ = новый Структура("ТипЗаполнения", "ПоНоменклатуре");
	ОткрытьФорму("Документ.ОтправкаСМС.Форма.ФормаЗаполнения", ПФ, ЭтаФорма,,,,ПроцедураПослеВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПослеУказанияНоменклатуры(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач <> Неопределено Тогда
        ЗаполнитьПолучателейПоПроданнойНоменклатуре(ВыбЗнач);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолучателейПоПроданнойНоменклатуре(ВыбЗнач)
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ПродажиОбороты.Контрагент
	 |ИЗ
	 |	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
	 |ГДЕ
	 |	ВЫБОР
	 |			КОГДА &Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	 |				ТОГДА ИСТИНА
	 |			ИНАЧЕ ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&Номенклатура)
	 |		КОНЕЦ
	 |	И ВЫБОР
	 |			КОГДА &КатегорияНоменклатуры = ЗНАЧЕНИЕ(Справочник.КатегорияНоменклатуры.ПустаяСсылка)
	 |				ТОГДА ИСТИНА
	 |			ИНАЧЕ ПродажиОбороты.Номенклатура.Категория = &КатегорияНоменклатуры
	 |		КОНЕЦ
	 |	И ПродажиОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ПродажиОбороты.Контрагент";
	 Запрос.УстановитьПараметр("НачалоПериода", ВыбЗнач.НачалоПериода);
	 Запрос.УстановитьПараметр("КонецПериода", ВыбЗнач.КонецПериода);
	 Запрос.УстановитьПараметр("Номенклатура", ВыбЗнач.Номенклатура);
	 Запрос.УстановитьПараметр("КатегорияНоменклатуры", ВыбЗнач.КатегорияНоменклатуры); 
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
	 	НоваяСтрока = Объект.Получатели.Добавить();
	 	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		НоваяСтрока.НомерТелефона = ПолучитьОсновнойТелефонКонтрагента(Выборка.Контрагент);
	КонецЦикла;
	
КонецПроцедуры

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

