
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ВидЦены = Параметры.ВидЦены;
	Если ВидЦены.Пустая() Тогда
		ВидЦены = ПолучитьОсновнойТипЦенПродажи();
	КонецЕсли;
		
	Валюта = Параметры.Валюта;
	Если Валюта.Пустая() Тогда
		Валюта = ПолучитьФункциональнуюОпцию("ВалютаУчета");
	КонецЕсли;
	
	ИспользоватьИндивидуальныеЦены = ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены");
			
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВДокумент И НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		АдресВХранилище = ЗаписатьПодборВХранилище(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	Иначе
		АдресВХранилище = Неопределено;
	КонецЕсли;
	
	Если АдресВХранилище <> Неопределено Тогда
		Структура = Новый Структура("АдресВХранилище", АдресВХранилище);
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДокумента = Новый Структура("ИспользоватьИндивидуальныеЦены, Валюта, ВидЦены, Контрагент, ДоговорКонтрагента");
	ЗаполнитьЗначенияСвойств(ПараметрыДокумента, ЭтотОбъект);
	ДанныеШаблона = ПолучитьДанныеШаблона(ТекущиеДанные.Ссылка, ПараметрыДокумента);
	Состав.Очистить();
	Для каждого СтрокаТЗ из ДанныеШаблона.Состав Цикл
		НоваяСтрока = Состав.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеШаблона(ШаблонСсылка, ПараметрыДокумента)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ШаблонСсылка);
	Запрос.УстановитьПараметр("ИспользоватьИндивидуальныеЦены", ПараметрыДокумента.ИспользоватьИндивидуальныеЦены);
	Запрос.УстановитьПараметр("Валюта", ПараметрыДокумента.Валюта);
	Запрос.УстановитьПараметр("ВидЦены", ПараметрыДокумента.ВидЦены);
	Запрос.УстановитьПараметр("Контрагент", ПараметрыДокумента.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ПараметрыДокумента.ДоговорКонтрагента);
	Запрос.Текст = 
	
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.Цена
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Отменена КАК Отменена
	|ПОМЕСТИТЬ ВТ_ИндивидуальныеЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыИндивидуальные.СрезПоследних(
	|			,
	|			Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента
	|				И Валюта = &Валюта) КАК ЦеныНоменклатурыИндивидуальныеСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Состав.Номенклатура КАК Номенклатура,
	|	Состав.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Состав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Состав.Коэффициент КАК Коэффициент,
	|	Состав.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ЦеныНоменклатурыИндивидуальныеСрезПоследних.Цена ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ЦеныНоменклатурыИндивидуальныеСрезПоследних.Отменена
	|						ТОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.Цена
	|					ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	Справочник.ШаблоныКомнатДляЗаказДоговора.ТоварыУслуги КАК Состав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				,
	|				ВидЦены = &ВидЦены
	|					И Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО Состав.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И Состав.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|			И Состав.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальныеЦены КАК ЦеныНоменклатурыИндивидуальныеСрезПоследних
	|		ПО (&ИспользоватьИндивидуальныеЦены)
	|			И Состав.Номенклатура = ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура
	|			И (Состав.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры)
	|			И Состав.ЕдиницаИзмерения = ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения
	|ГДЕ
	|	Состав.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Состав.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	Результат.Вставить("Состав", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса.Выгрузить()));
	
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
		
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОсновнойТипЦенПродажи()
	Возврат Справочники.ВидыЦен.ОсновнаяЦенаПродажи;
КонецФункции

&НаСервере
Функция ЗаписатьПодборВХранилище(УникальныйИдентификаторВладельца) 
		
	АдресВХранилище = Неопределено;	
	Если ПеренестиВДокумент Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(Состав.Выгрузить(), УникальныйИдентификаторВладельца);	
	КонецЕсли;
	
	Возврат АдресВХранилище;
	
КонецФункции

&НаКлиенте
Процедура СоставПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
