
&НаКлиенте
Процедура ВыбратьФайл(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Показать(Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура РазместитьЗапись(Команда)
	
	Если НЕ ПустаяСтрока(access_token) Тогда
		Если Не ПустаяСтрока(file_name) Тогда
			
			Если Лев(owner_id, 1) = "-" Тогда
				uid = "";
				gid = Сред(owner_id, 2);
			Иначе
				uid = owner_id;
				gid = "";
			КонецЕсли;
			
			Попытка
				Параметрыизображения = РаботаССайтомВКонтакте.ЗагрузитьФотографиюНаСтену(access_token, uid, gid, Новый ДвоичныеДанные(file_name));
				attachments = РаботаССайтомВКонтакте.СохранитьЗагруженныйДокумент(access_token,
				Параметрыизображения.server, Параметрыизображения.photo, Параметрыизображения.hash, uid, gid).id;
			Исключение
				Сообщить("Ошибка при загрузке изображения на стену: " + ОписаниеОшибки());
				Возврат;
			КонецПопытки;
			
		КонецЕсли;
		
		Попытка
			post_id = РаботаССайтомВКонтакте.РазместитьЗаписьНаСтене(access_token, owner_id, message, attachments);
			Сообщить("Запись на стене успешно размещена. post_id = " + post_id);
		Исключение
			Сообщить("Ошибка при размещении записи на стене: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	access_token = Параметры.access_token;
	
КонецПроцедуры


&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДопПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		file_name = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры