&НаСервере
Функция ПолучитьДанные(СсылкаНаОбъект, ИмяФайла)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанныеЭлектронныхПисем.Данные
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанныеЭлектронныхПисем КАК ПрикрепленныеДанныеЭлектронныхПисем
	|ГДЕ
	|	ПрикрепленныеДанныеЭлектронныхПисем.СсылкаНаОбъект = &Ссылка
	|	И ПрикрепленныеДанныеЭлектронныхПисем.ИмяФайла = &ИмяФайла";
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИмяФайла",ИмяФайла);
	
	
	Данные = Неопределено;
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() > 0 тогда
		Данные = Выборка[0].Данные.Получить();
	КонецЕсли;
	 
	Возврат ПоместитьВоВременноеХранилище(Данные, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяВременногоФайлаСерв(Расширение)
	Возврат ПолучитьИмяВременногоФайла(Расширение);
КонецФункции

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	АдресФайла = ПолучитьДанные(Элементы.Список.ТекущиеДанные.СсылкаНаОбъект, Элементы.Список.ТекущиеДанные.ИмяФайла);
	ВременноеИмя=ПолучитьИмяВременногоФайлаСерв(Элементы.Список.ТекущиеДанные.Расширение);
    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.ОбъектОтбор = Неопределено Тогда
		ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
		ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СсылкаНаобъект");
		ЭО.ПравоеЗначение=Параметры.ОбъектОтбор.Ссылка;
		ЭО.Использование=Истина;
	КонецЕсли;
	
КонецПроцедуры
