//уменьшение суммы взаиморасчетов - увеличение дебиторской задолженности
Функция ВыполнитьРасход(Знач Документ, Знач Организация, Знач Контрагент, Знач Договор, Знач Сумма) Экспорт
	
	Результат = Истина;
	
	Попытка
		НаборЗаписей = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Документ);
		НаборЗаписей.Прочитать();
		
		Расход = НаборЗаписей.Добавить();
		Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
		Расход.Период = Документ.Дата;
		Расход.Контрагент = Контрагент;
		Расход.Договор = Договор;
		Расход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Документ, Сумма);
		Расход.Организация = Организация;
		
		НаборЗаписей.Записать();
	Исключение
		Результат = Ложь;
		Сообщить("Ошибка записи взаиморасчетов! " + ОписаниеОшибки(),СтатусСообщения.Важное);
	КонецПопытки;
	
	Возврат Результат;

	
КонецФункции

//увеличение суммы взаиморасчетов - увеличение кредиторской задолженности
Функция ВыполнитьПриход(Знач Документ, Знач Организация, Знач Контрагент, Знач Договор, Знач Сумма) Экспорт
	
	Результат = Истина;
	
	Попытка
		НаборЗаписей = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Документ);
		НаборЗаписей.Прочитать();
		
		Приход = НаборЗаписей.Добавить();
		Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
		Приход.Период = Документ.Дата;
		Приход.Контрагент = Контрагент;
		Приход.Договор = Договор;
		Приход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Документ, Сумма);
		Приход.Организация = Организация;
		
		НаборЗаписей.Записать();
	Исключение
		Результат = Ложь;
		Сообщить("Ошибка записи взаиморасчетов! " + ОписаниеОшибки(),СтатусСообщения.Важное);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции