&НаКлиенте
Перем ФормаСтатистик, ФормыЗадач, СоотвИДпользователей, ПредВыбЗадача;

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	#ЕСЛИ ВебКлиент ТОГДА
		ВебКлиент = Истина;
		Элементы.РазвернутьСтатистики.Пометка = истина;
		Элементы.РазвернутьСтатистики.Видимость = ложь;
		РазвернутьСтатистики_сервер();
		
		Элементы.ГруппаКЦ_Стат.Высота =20;
		Элементы.ГруппаПланы.Высота =20;
	#КОНЕЦЕСЛИ
	
	СоотвИДпользователей = новый Соответствие;
	
	экраны = ПолучитьИнформациюЭкрановКлиента();
	Если экраны[0].Ширина<1400 Тогда
		Элементы.Предпросмотр.Видимость = ложь;
		СкрытьЛенту = истина;
	КонецЕсли;
	
	Если экраны[0].Высота<1000 Тогда
		ЭтаФорма.ВертикальнаяПрокрутка = ВертикальнаяПрокруткаФормы.Использовать;
	КонецЕсли;


	Если не (ИА_Защита_Общий.ЛицензияДоступна("КЦ") И ИА_Защита_Общий.ЛицензияДоступна("БП") И ИА_Защита_Общий.ЛицензияДоступна("Статистика")) Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	
	Если ВебКлиент Тогда
		Элементы.ПолеГлСтатистика.Видимость = ложь;
		//Элементы.ГруппаКЦ_Стат.РастягиватьПоВертикали = ложь;
	КонецЕсли;

	
	//статистики
	ДатаКонца_МС = ТекущаяДата();
		
	Если ПериодДетализации_МС.Пустая() Тогда
		ПериодДетализации_МС = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День");
	КонецЕсли;
	
	Если КоличествоПериодов_МС = 0 Тогда
		КоличествоПериодов_МС = 21;
	КонецЕсли;
	ПересчитатьПериод(ДатаНачала_МС, ДатаКонца_МС, ПериодДетализации_МС, КоличествоПериодов_МС, ОтображатьНезавершенныеПериоды, ОтображатьОдинБудущийПериодСтатистики);
	
	//главные статистики
	ТекстСтатистики = "";
	ОбновитьМоиСтатистики();
	
	РольСтатистикиПросмотрДоступна 		 = ИА_КСУОбщийСервер.ПросмотрСтатистикДоступен();
	РольСтатистикиРедактированиеДоступна = ИА_КСУОбщийСервер.РедактированиеСтатистикДоступно();
	
	
	// Обновление корзин и уведомлений
	ОбновитьВсеКорзиныПоРегистрамИУведомления();
	
	ФормыЗадач = Новый Массив;
	ПодключитьОбработчикОжидания("ОбновитьКорзиныПоРегистрам", 30, ложь);
	ПодключитьОбработчикОжидания("ПроверитьФормыЗадач", 3, ложь);
	
	//
	
	обновитьНовыеСостояния();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФормыЗадач()
	сч = ФормыЗадач.Количество() -1;
	Пока сч>=0 Цикл
		ф = ФормыЗадач[сч];
		Если не ф.Открыта() Тогда
			ОбновитьВсеКорзиныПоРегистрамИУведомления();
			ФормыЗадач.Удалить(сч);
		КонецЕсли;
		
		сч = сч -1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКорзиныПоРегистрам()
	ТекСтр = Элементы.ГруппаКоммцентр.ТекущаяСтраница;
	Если ТекСтр = Элементы.Входящие или ТекСтр = Элементы.Исходящие или ТекСтр = Элементы.ВРаботе Тогда
		ОбновитьКорзину(ТекСтр.Имя);
	КонецЕсли;
	Если ВводДоступен() Тогда
		ОбновитьУведомленияИСведенияДляЗаголовков();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсеКорзиныПоРегистрамИУведомления()
	ОбновитьКорзину("Входящие");
	ОбновитьКорзину("ВРаботе");
	ОбновитьКорзину("Исходящие");
	ОбновитьУведомленияИСведенияДляЗаголовков();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКорзину(ИмяКорзины)
	ТипыЗадач = Неопределено;
	кол = ИА_ОбщиеПроцедуры_Технология_КоммЦентр_Сервер.ОбновитьДанныеКорзины(ИмяКорзины,ТипыЗадач);
	
	Если ТипыЗадачСписок.Количество() =0 И ИмяКорзины = "Исходящие" Тогда
		Для каждого стрТип из ТипыЗадач Цикл
			Если стрТип <> Тип("Null") и стрТип <> Тип("ЗадачаСсылка.ИА_ЗадачаПланаДействий") Тогда
				ТипыЗадачСписок.Добавить(стрТип);
			КонецЕсли;
		КонецЦикла;
		СоздатьКнопкиСозданияЗадач();
	КонецЕсли;
	
	эл = Элементы["Таблица"+ИмяКорзины];
	эл.Обновить();
	
	
	// обновление количества в дереве корзин
	корзина = ПредопределенноеЗначение("Справочник.ИА_РасширенияКомцентра."+ИмяКорзины);
	Для каждого стр из ДеревоКорзин.ПолучитьЭлементы() Цикл
		если стр.корзина = корзина Тогда
			стр.Количество = кол; 
			
			Если стр.ПолучитьЭлементы().Количество() >0 Тогда // обновить вложенные корзины
				КолВл = ПолучитьКоличествоВоВложенныхКорзинах(стр.Корзина, ТекПользователь);
				Для каждого ВлКорз из стр.ПолучитьЭлементы() Цикл
					к = КолВл.Получить(ВлКорз.Корзина);
					ВлКорз.Количество = ?(к = Неопределено, 0 , к);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСерверебезКонтекста
Функция ПолучитьКоличествоВоВложенныхКорзинах(Корзина, ТекПользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ГруппыКЦ.Группа КАК Группа,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИА_ГруппыКЦ.Задача) КАК Кол
	               |ИЗ
	               |	РегистрСведений.ИА_ГруппыКЦ КАК ИА_ГруппыКЦ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ЗадачиКЦ КАК РегистрСведенийИА_ЗадачиКЦ
	               |		ПО (РегистрСведенийИА_ЗадачиКЦ.ПользовательКЦ = ИА_ГруппыКЦ.Пользователь)
	               |			И (РегистрСведенийИА_ЗадачиКЦ.Ссылка = ИА_ГруппыКЦ.Задача)
	               |			И ИА_ГруппыКЦ.Группа.Корзина = РегистрСведенийИА_ЗадачиКЦ.Корзина
	               |ГДЕ
	               |	ИА_ГруппыКЦ.Пользователь = &Пользователь
	               |	И ИА_ГруппыКЦ.Группа.Корзина = &Корзина
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_ГруппыКЦ.Группа";
	Запрос.УстановитьПараметр("Корзина", Корзина);
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	рез = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		рез.Вставить(Выборка.Группа, Выборка.Кол);
	КонецЦикла;
	
	Возврат рез;
КонецФункции

&НаСервере
Процедура СоздатьКнопкиСозданияЗадач()
	сч = 0;
	Для каждого стрТип из ТипыЗадачСписок Цикл
		Кмд = ЭтаФорма.Команды.Добавить("КомандаНетиповойЗадач"+сч);
		Кмд.Действие = "СоздатьНетиповуюЗадачу";
		
		НовЭл = Элементы.Добавить("КнопкаНетиповойЗадач"+сч, Тип("КнопкаФормы"), Элементы.ГруппаСоздать);
		НовЭл.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовЭл.ИмяКоманды = "КомандаНетиповойЗадач"+сч;
		
		НовЭл.Заголовок = стрТип;
		НовЭл.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
		НовЭл.Отображение = ОтображениеКнопки.КартинкаИТекст;
		сч = сч + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьУведомленияИСведенияДляЗаголовков()
	
	Если Взаимодействия1с Тогда
		Элементы.ДекорацияУведомления.Видимость  = ложь;
		Элементы.ДекорацияУведКартинка.Видимость = ложь;
	Иначе
		Результат = ПолучитьКоличествоУведомлений(ТекПользователь);
		КоличествоУведомлений = Результат.КоличествоУведомлений; 
		Элементы.ДекорацияУведомления.Видимость  = КоличествоУведомлений>0;
		Элементы.ДекорацияУведКартинка.Видимость = КоличествоУведомлений>0;
		Элементы.ДекорацияУведомления.Заголовок = "Уведомления ("+ КоличествоУведомлений + ")";
	КонецЕсли;
	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоУведомлений(ТекПользователь)
    
	Результат =  Новый Структура;
    
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_УведомленияКЦ.Задача
	               |ИЗ
	               |	РегистрСведений.ИА_УведомленияКЦ КАК ИА_УведомленияКЦ
	               |ГДЕ
	               |	ИА_УведомленияКЦ.Пользователь = &Пользователь";
				   
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
    
    Результат.Вставить("КоличествоУведомлений",Запрос.Выполнить().Выбрать().Количество());
    
	Возврат Результат;
КонецФункции


&НаСервере
Процедура СформироватьКартинкуВеб(ОбъектСтрукт)
	деревоСТ = РеквизитФормыВЗначение("ДеревоСтатистик");
	ИА_Статистики.СформироватьКартинкуВеб(ЭтаФорма,ОбъектСтрукт,деревоСТ, ИСТИНА,ЛОЖЬ , ИСТИНА, ложь, ложь, Неопределено, ПериодДетализации_МС);	
	ЗначениеВРеквизитФормы(деревоСТ,"ДеревоСтатистик");
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьДерево(СтрИз, СтрВ)
	Для каждого стр из СтрИз.ПолучитьЭлементы() Цикл
		НовСтр = стрВ.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, стр,,"Данные");
		
		Для каждого стрД из стр.Данные Цикл
			НовстрД = НовСтр.Данные.Добавить();
			ЗаполнитьЗначенияСвойств(НовстрД, стрД);
		КонецЦикла;
		
		СкопироватьДерево(Стр, НовСтр)
	КонецЦикла;
КонецПроцедуры	
	
&НаКлиенте
Процедура ОбновитьМоиСтатистики()
    СписокВыбранныхНастроек = ПолучитьМоюНастройкуСтатистик();
    Если СписокВыбранныхНастроек = Неопределено ИЛИ СписокВыбранныхНастроек.Количество() = 0 Тогда
    	Возврат;
    КонецЕсли;
    МояНастройкаСтатистики = СписокВыбранныхНастроек[0];
	
	Если ФормаСтатистик = Неопределено тогда
		Попытка
			ФормаСтатистик = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма",,,ЭтаФорма.УникальныйИдентификатор);
		Исключение
			Возврат; // скорее всего нет прав
		КонецПопытки;
	КонецЕсли;				
	
	//
	ШиринаЭкрана = 340;
	
	ФормаСтатистик.Объект.Настройка = МояНастройкаСтатистики;
    ФормаСтатистик.СписокВыбранныхНастроекСтатистик.Очистить();
    Для каждого Эл Из СписокВыбранныхНастроек Цикл
    	НовЭл = ФормаСтатистик.СписокВыбранныхНастроекСтатистик.Добавить();
		НовЭл.Настройка = Эл; 
    КонецЦикла; 
    
	ФормаСтатистик.ЗагрузитьНастройку(-1,ПериодДетализации_МС, Истина);
	ФормаСтатистик.Объект.ДатаНачала = ДатаНачала_МС;
	ФормаСтатистик.Объект.ДатаКонца = ДатаКонца_МС;
	
	ФормаСтатистик.Объект.КоличествоВСтроке = 1;
	ФормаСтатистик.sw = ШиринаЭкрана;
	//
	
	Если ВебКлиент Тогда
		ДеревоСтатистик.ПолучитьЭлементы().Очистить();
		СкопироватьДерево(ФормаСтатистик.ДеревоСтатистик, ДеревоСтатистик);
		
		ОбъектСтрукт = Новый Структура("ДатаНачала,ДатаКонца,Настройка,КоличествоВСтроке");
		ЗаполнитьЗначенияСвойств(ОбъектСтрукт, ФормаСтатистик.Объект);
		
		СформироватьКартинкуВеб(ОбъектСтрукт);	
		
		ФормаСтатистик.ДеревоСтатистик.ПолучитьЭлементы().Очистить();
		СкопироватьДерево(ДеревоСтатистик, ФормаСтатистик.ДеревоСтатистик);
	Иначе
		//ДанныеХТМЛ_текст = ПолучитьТекстПоНастройке_МоиСтатистики(МояНастройкаСтатистики, СписокВыбранныхНастроек);
		
		ДанныеХТМЛ_текст = ФормаСтатистик.СформироватьКартинку(Истина, Ложь, Истина, ,,, ПериодДетализации_МС);
		
		РезСтраницаИмя = ИА_Статистики_Клиент.ПолучитьФайлСтраницы(ДанныеХТМЛ_текст,"MS");		
			
		НадоОбновить = ДанныеХТМЛ_ГлавнаяСтатистика<>"";
		
		ДанныеХТМЛ_ГлавнаяСтатистика = РезСтраницаИмя;
		Если НадоОбновить Тогда
			Попытка
				Элементы.ПолеГлСтатистика.Документ.parentWindow.location.reload();
			Исключение
				Элементы.ПолеГлСтатистика.Документ.window.location.reload();
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМоюНастройкуСтатистик()
	ЗапросПоста = Новый Запрос;
	ЗапросПоста.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
                        |   ИА_АдресацияЗадачПланаДействий.Пост,
                        |   1000 КАК Уровень,
                        |   1000 КАК УровеньПоТипуТерминала,
                        |   ИА_АдресацияЗадачПланаДействий.Пост.НастройкаСтатистик КАК НастройкаСтатистик
                        |ИЗ
                        |   РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
                        |ГДЕ
                        |   ИА_АдресацияЗадачПланаДействий.Пользователь = &Пользователь
                        |   И ИА_АдресацияЗадачПланаДействий.Пост <> ЗНАЧЕНИЕ(Справочник.ОргСхема.ПустаяСсылка)";
	ЗапросПоста.УстановитьПараметр("Пользователь", ТекПользователь);
	ТЗ = ЗапросПоста.Выполнить().Выгрузить();
	
	Для каждого стр из ТЗ Цикл
		стр.Уровень = стр.Пост.Уровень();
		стр.УровеньПоТипуТерминала = ПолучитьУровеньПоТипуТерминала(стр.Пост.ТипТерминала);
	КонецЦикла;
	
	Тз.Сортировать("Уровень Возр, УровеньПоТипуТерминала Возр");
	
	Если ТЗ.Количество() = 0 Тогда
		Сообщить("У вас не указаны занимаемые посты!");
		Возврат Неопределено;
	КонецЕсли;
    
    Результат = Новый Массив;
    Для каждого СтрокаТЗ Из ТЗ Цикл
        Если ЗначениеЗаполнено(СтрокаТЗ.НастройкаСтатистик) Тогда
            ИА_БФКС.Массив_ДобавитьЕслиНет(Результат, СтрокаТЗ.НастройкаСтатистик);	
        КонецЕсли;     	
    КонецЦикла;     
    
    Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьУровеньПоТипуТерминала(ТипТерминала)
	
	Если ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Организация Тогда
		Возврат 1;
	ИначеЕсли ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Учредитель Тогда
		Возврат 2;
	ИначеЕсли ТипТерминала = Перечисления.ТипТерминалаОргСхемы.РуководящийСостав Тогда
		Возврат 3;
	ИначеЕсли ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент Тогда
		Возврат 4;
	ИначеЕсли ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел Тогда
		Возврат 5;
	ИначеЕсли ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Секция Тогда
		Возврат 6;
	ИначеЕсли ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сотрудник Тогда
		Возврат 7;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПересчитатьПериод(ДатаНачала, ДатаКонца, ПериодДетализации, КоличествоПериодов, ОтображатьНезавершенныеПериод, ОтображатьОдинБудущийПериодСтатистики = ложь)
	
	текДата = ТекущаяДата();
		
	Если ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День тогда
		
		ДатаКонца = НачалоДня(текДата)-1;
		
		Если ОтображатьНезавершенныеПериод ТОгда
			ДатаКонца = текДата;
		КонецЕсли;		
		
		ДатаНачала = ДатаКонца - 60*60*24 * (КоличествоПериодов-1);
		
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Неделя  тогда
		
		НачалоНедели = Константы.ИА_НачалоНедели.Получить();
		
		Если НачалоНедели > 1 Тогда
			
			ДатаКонца = КонецНедели(текДата) - (7 - НачалоНедели + 1)*60*60*24;
			
			Если ДеньНедели(текДата) < НачалоНедели-1 и Не ОтображатьНезавершенныеПериод Тогда
				ДатаКонца = ДатаКонца - 60*60*24*7;
			КонецЕсли;
			
			ДатаНачала = ДатаКонца - 60*60*24*7 * (КоличествоПериодов) + 60*60*24;
			
		Иначе
			
			Если ОтображатьНезавершенныеПериод Тогда
				ДатаКонца = КонецНедели(текДата);
			Иначе
				ДатаКонца = НачалоНедели(текДата)-1;
			КонецЕсли;
			
			//ДатаКонца = ДатаКонца - 60*60*24*7;
			ДатаНачала = НачалоНедели(ДатаКонца) - 60*60*24*7 * (КоличествоПериодов-1);
			
		КонецЕсли;
		
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Месяц тогда
		
		ДатаКонца = КонецМесяца(текДата);
		
		Если КонецДня(текДата) <> КонецДня(ДатаКонца) и не ОтображатьНезавершенныеПериод Тогда
			ДатаКонца = КонецМесяца(ДобавитьМесяц(НачалоМесяца(текДата),-1));
		КонецЕсли;
		
		ДатаНачала = НачалоМесяца(ДобавитьМесяц(ДатаКонца, -(КоличествоПериодов-1)));
		
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Квартал тогда
		
		ДатаКонца = КонецКвартала(текДата);
		
		Если КонецДня(текДата) <> КонецДня(ДатаКонца) и не ОтображатьНезавершенныеПериод Тогда
			ДатаКонца = КонецМесяца(ДобавитьМесяц(НачалоМесяца(ДатаКонца),-3));
		КонецЕсли;
		
		ДатаНачала = НачалоМесяца(ДобавитьМесяц(ДатаКонца+1, -(КоличествоПериодов)*3));
		
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Год тогда
		
		ДатаКонца = КонецГода(текДата);
		
		Если КонецДня(текДата) <> КонецДня(ДатаКонца) и не ОтображатьНезавершенныеПериод Тогда
			ДатаКонца = КонецГода(ДобавитьМесяц(текДата,-12));
		КонецЕсли;
		
		ДатаНачала = НачалоГода(ДобавитьМесяц(ДатаКонца, -(КоличествоПериодов-1)*12));		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьЗапросКорзины(Корзина)
	
	ДанныеКорзины = Вычислить("Задачи"+Корзина);
	Расшир = Справочники.ИА_РасширенияКомцентра[Корзина];
	
	ДанныеКорзины.ТекстЗапроса = Расшир.ТекстЗапроса;
	Попытка
		ДанныеКорзины.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекПользователь);
	Исключение
	КонецПопытки;
	Попытка
		ДанныеКорзины.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
	Исключение
	КонецПопытки;
	парам = Расшир.ТабПараметровЗапроса.Получить();
	Если парам <> Неопределено Тогда
		Для каждого стр из парам Цикл
			ДанныеКорзины.Параметры.УстановитьЗначениеПараметра(стр.ИмяПараметра, стр.Значение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Взаимодействия1с = Константы.КСУ_КЦ_ИспользоватьВзаимодействия1С.Получить();
	
	Элементы.ОткрытьРСВладельца.Видимость = РольДоступна("КСУ_Владелец");
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		
	ОтображатьНезавершенныеПериоды = ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.ОтображатьНезавершенныеПериодыНаРС);
	ОтображатьОдинБудущийПериодСтатистики = Константы.ИА_ОтображатьОдинБудущийПериодСтатистики.Получить();
	Элементы.ДекорацияЦель.Заголовок = Константы.ИА_ЦельКомпании.Получить();
	
	// коммцентр. Простые корзины - Архив и Все. Просто устанавливаем запрос и параметры
	УстановитьЗапросКорзины("Архив");
	УстановитьЗапросКорзины("Все");
	
	// сложные корзины. Обновляем данные регистра для отображение
	ЗадачиВходящие.Параметры.УстановитьЗначениеПараметра("ПользовательКЦ", ТекПользователь);
	ЗадачиВходящие.Параметры.УстановитьЗначениеПараметра("ОтборГруппа", Неопределено);
	
	ЗадачиВРаботе.Параметры.УстановитьЗначениеПараметра("ПользовательКЦ", ТекПользователь);
	ЗадачиВРаботе.Параметры.УстановитьЗначениеПараметра("ОтборГруппа", Неопределено);
	
	ЗадачиИсходящие.Параметры.УстановитьЗначениеПараметра("ПользовательКЦ", ТекПользователь);
	ЗадачиИсходящие.Параметры.УстановитьЗначениеПараметра("ОтборГруппа", Неопределено);
	//
	
	УстановитьПараметрыОтбораВсе();
	
	// коммцентр. Отборы
	СоздатьОтборыВсе();    
	
	//
	СоздатьКорзины();
	//
	Лого = Константы.ИА_ЛоготипКомпании.Получить();
	Если ЗначениеЗаполнено(лого) ТОгда
		дд = лого.Получить();
		Если ЗначениеЗаполнено(дд) Тогда
			уид1 = Новый УникальныйИдентификатор;
			АдресКартинкиЛоготип = ПоместитьВоВременноеХранилище(дд,уид1);
		КонецЕсли;
	КонецЕсли;
	Элементы.ПолеЛоготип.Видимость = АдресКартинкиЛоготип<>"";
	
	ВостановитьНастройкиДинамическихСписковИВидимости();
	
	///
	
	МоиПосты = МоиПолучитьПосты();
	Элементы.ПостДневник.СписокВыбора.ЗагрузитьЗначения(МоиПосты);
	Если МоиПосты.Количество() > 0 Тогда
		ПостДневник = МоиПосты[0];
	КонецЕсли;
	ОбновитьДневникСервер();
	//
	Элементы.ГруппаДневник.Видимость = ИА_НастройкиСПИ.ЗначениеНастройки(ПараметрыСеанса.ТекущийПользователь,ПланыВидовХарактеристик.ИА_НастройкиПользователей.ОткрыватьДневникНаРС);
	//
	ИА_Планы.УстановитьРабочееВремя(ПланировщикДень);
	//
	ОбновитьПериодыПланов();
	ОбновитьНедельныеПланы();	
	ОбновитьДневныеПланы();
	ОбновитьНовости();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНовости()
	новость = КСУ_Новости.ПолучитьНовостьКСУ(ложь);
	Элементы.ДекорацияНовостиКСУ.Видимость = новость<>"";
КонецПроцедуры
	
&НаСервере
Процедура СоздатьКорзины()
	НовСтр = ДеревоКорзин.ПолучитьЭлементы().Добавить();
	НовСтр.Корзина = Справочники.ИА_РасширенияКомцентра.Входящие;
	НовСтр.ИдСтроки = 0;
	ДобавитьВложеннуюКорзину(НовСтр);
	
	НовСтр = ДеревоКорзин.ПолучитьЭлементы().Добавить();
	НовСтр.Корзина = Справочники.ИА_РасширенияКомцентра.ВРаботе;
	НовСтр.ИдСтроки = 1;
	ДобавитьВложеннуюКорзину(НовСтр);
	
	НовСтр = ДеревоКорзин.ПолучитьЭлементы().Добавить();
	НовСтр.Корзина = Справочники.ИА_РасширенияКомцентра.Исходящие;
	НовСтр.ИдСтроки = 2;
	ДобавитьВложеннуюКорзину(НовСтр);
	
	НовСтр = ДеревоКорзин.ПолучитьЭлементы().Добавить();
	НовСтр.Корзина = Справочники.ИА_РасширенияКомцентра.Архив;
	НовСтр.ИдСтроки = 3;
	
	НовСтр = ДеревоКорзин.ПолучитьЭлементы().Добавить();
	НовСтр.Корзина = Справочники.ИА_РасширенияКомцентра.Все;
	НовСтр.ИдСтроки = 4;
КонецПроцедуры

&НаСервере
Процедура ДобавитьВложеннуюКорзину(КорзинаСтр)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ГруппыКЦ.Ссылка
	               |ИЗ
	               |	Справочник.ИА_ГруппыКЦ КАК ИА_ГруппыКЦ
	               |ГДЕ
	               |	ИА_ГруппыКЦ.Корзина = &Корзина
	               |	И ИА_ГруппыКЦ.Пользователь = &Пользователь
	               |	И ИА_ГруппыКЦ.ПометкаУдаления = ложь";
	Запрос.УстановитьПараметр("Корзина", КорзинаСтр.Корзина);
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		Новстр = КорзинаСтр.ПолучитьЭлементы().Добавить();
		НовСтр.Корзина = Выборка.ссылка;
		НовСтр.ИдСтроки = КорзинаСтр.ИдСтроки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОтбораВсе()
	попытка
		ЗадачиВсе.Параметры.УстановитьЗначениеПараметра("ОтборПоПользователю", ОтборПоПользователю);
	Исключение
	КонецПопытки;
	
	Попытка 
		ЗадачиВсе.Параметры.УстановитьЗначениеПараметра("ОтборПоТексту", ОтборПоТексту);
	Исключение
	КонецПопытки;
КонецПроцедуры

	
&НаСервере
Процедура СоздатьОтборыВсе()
	ЗадачиВсе.Отбор.Элементы.Очистить();
	
	Элемент = ЗадачиВсе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Автор");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = ТекПользователь;
	Элемент.Использование = Ложь;

	Элемент1 = ЗадачиВсе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь");
	Элемент1.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент1.Использование = Ложь;
	
	Элемент2 = ЗадачиВсе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пост");
	Элемент2.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент2.Использование = Ложь;
	
	Элемент3 = ЗадачиВсе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выполнена");
	Элемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент3.ПравоеЗначение = Ложь;
	Элемент3.Использование = Ложь;
		
	Элемент5 = ЗадачиВсе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент5.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокИсполнения");
	Элемент5.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	Элемент5.ПравоеЗначение = ТекущаяДата();
	Элемент5.Использование = Ложь;
	
	Элемент6 = ЗадачиВсе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент6.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наименование");
	Элемент6.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	Элемент6.Использование = Ложь;
	
	//Рафаэль
	Элемент7 = ЗадачиВсе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент7.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пост");
	Элемент7.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Элемент7.Использование = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура ПолеКоличествоПериодов1ПриИзменении(Элемент)
	ПересчитатьПериод(ДатаНачала_МС, ДатаКонца_МС, ПериодДетализации_МС, КоличествоПериодов_МС, ОтображатьНезавершенныеПериоды, ОтображатьОдинБудущийПериодСтатистики);
	ОбновитьМС(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПолеПериодДетализации1ПриИзменении(Элемент)
	ПересчитатьПериод(ДатаНачала_МС, ДатаКонца_МС, ПериодДетализации_МС, КоличествоПериодов_МС, ОтображатьНезавершенныеПериоды, ОтображатьОдинБудущийПериодСтатистики);
	ОбновитьМС(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМС(Команда)
	Если ДатаНачала_МС < ДатаКонца_МС Тогда
		ОбновитьМоиСтатистики();
	Иначе
		ПоказатьПредупреждение(,"Указан неверный период статистик!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПослание(Команда)
	Отбор = Новый Структура("ЭтоПослание", Истина);
	ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.ФормаОбъекта",Отбор, ЭтаФорма); 	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.ФормаОбъекта",,ЭтаФорма); 	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗРС(Команда)
	Отбор = Новый Структура("ЭтоЗРС", Истина);
	ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.ФормаОбъекта",Отбор, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруМоейСтатистики(пНомер)
	стр = Новый Структура("ВидСтатистики,Аналитика1,Аналитика2,Аналитика3");
	ЗаполнитьЗначенияСвойств(стр, МояНастройкаСтатистики.Статистики[пНомер]);
	Возврат стр;
КонецФункции
  

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытиеЗадачиБП" Тогда
		
		ОбновитьВсеКорзиныПоРегистрамИУведомления();
   		
	ИначеЕсли ИмяСобытия = "ИА_ОбновитьУведомления" Тогда	
		ОбновитьУведомленияИСведенияДляЗаголовков();
	ИначеЕсли ИмяСобытия = "КСУ_ОбновитьМС" Тогда
		ОбновитьМоиСтатистики();
	ИначеЕсли ИмяСобытия = "КСУ_ОбновитьКорзины" Тогда
		ОбновитьКорзины();
	ИначеЕсли ИмяСобытия = "ОбновитьНовостиКСУ" Тогда
		ОбновитьНовости();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура перенестиТабДок(приемник, источник)
	приемник.Вывести(источник);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомления(Команда)
	парам = Новый Структура("Фильтр", Истина);
	форм = ПолучитьФорму("РегистрСведений.ИА_УведомленияКЦ.ФормаСписка", парам);
	форм.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПолеДатаНачала1ПриИзменении(Элемент)
	ОбновитьМС(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПолеДатаКонца1ПриИзменении(Элемент)
	ОбновитьМС(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоТекстуПриИзменении(Элемент)
	УстановитьПараметрыОтбораВсе();
	Элементы.ТаблицаВсе.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПользователюПриИзменении(Элемент)
	УстановитьПараметрыОтбораВсе();
	Элементы.ТаблицаВсе.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПолеГлСтатистикаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Если ДанныеХТМЛ_ГлавнаяСтатистика = "" Тогда
		возврат;
	КонецЕсли;
	
	Попытка
		событие = Элементы.ПолеГлСтатистика.Документ.parentWindow.CurEvent;
		НомерЭл = Элементы.ПолеГлСтатистика.Документ.parentWindow.CurEventSource;
	Исключение
		событие = Элементы.ПолеГлСтатистика.Документ.window.CurEvent;
		НомерЭл = Элементы.ПолеГлСтатистика.Документ.window.CurEventSource;
	КонецПопытки;
	
	
	Если событие<>"" Тогда
		Если событие = "report" Тогда
			ФормаСтатистик.ВывестиРасшифровку(НомерЭл);
		ИначеЕсли событие = "add" Тогда
			ФормаСтатистик.ДобавитьЗначение(НомерЭл, истина);
			ОбновитьМоиСтатистики();
		КонецЕсли;
		
		
		Попытка
			Элементы.ПолеГлСтатистика.Документ.parentWindow.setCurEvent("","");
		Исключение
			Элементы.ПолеГлСтатистика.Документ.window.setCurEvent("","");
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВходящиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Попытка
		ТекСсылка = Элемент.ТекущиеДанные.Ссылка
	Исключение
		возврат;
	КонецПопытки;
	
	Если ТипЗнч(ТекСсылка) = Тип("ЗадачаСсылка.ИА_ЗадачаПланаДействий") Тогда
		Парам = Новый Структура;
		Парам.Вставить("Ключ",ТекСсылка);
		Парам.Вставить("НазваниеТаблицы",Элемент.Имя);
		ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.ФормаОбъекта",Парам);
	Иначе
		имяФормыОб = ПолучитьИмяФормы(ТекСсылка);
		парам = Новый Структура("Ключ", ТекСсылка);
		формаОб = ОткрытьФорму(имяФормыОб,парам); 
		
		формыЗадач.Добавить(формаОб);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФормы(пСсылка)
	мд = пСсылка.Метаданные();
	Возврат мд.ПолноеИмя()+ ".ФормаОбъекта";
КонецФункции

&НаКлиенте
Процедура ГруппаКоммцентрПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.Входящие или ТекущаяСтраница = Элементы.Исходящие или ТекущаяСтраница = Элементы.ВРаботе Тогда
		ОбновитьКорзину(ТекущаяСтраница.Имя);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВходящиеПередУдалением(Элемент, Отказ)
	Отказ = истина;
	
	Попытка
		ТекСсылка = Элемент.ТекущиеДанные.Ссылка
	Исключение
		возврат;
	КонецПопытки;
	
	Если ТипЗнч(ТекСсылка) = Тип("ЗадачаСсылка.ИА_ЗадачаПланаДействий") Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ТаблицаВходящиеПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("ТекСсылка", ТекСсылка)), "Вы уверены?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВходящиеПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекСсылка = ДополнительныеПараметры.ТекСсылка;
	
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		УдалитьЗадачу(ТекСсылка);
		ОбновитьКорзиныПоРегистрам();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьЗадачу(пСсылка)
	пСсылка.ПолучитьОбъект().УстановитьПометкуУдаления(истина);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНетиповуюЗадачу(Команда)
	индТипа = число(СтрЗаменить(Команда.Имя,"КомандаНетиповойЗадач",""));
	ТипЗадачи = ТипыЗадачСписок[индТипа].Значение;
	
	м = Новый массив;
	м.Добавить(ТипЗадачи);
	
	ОпТипа = Новый ОписаниеТипов(м);
	ПустаяСсылка = ОпТипа.ПривестиЗначение();
	имяФормыОб = ПолучитьИмяФормы(ПустаяСсылка);
	формаОб = ОткрытьФорму(имяФормыОб);
	
	формыЗадач.Добавить(формаОб);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПереместитьЗадачиВГруппу(пСсылки, пГруппа, Пользователь)
	Для каждого стрСсылка из пСсылки Цикл 
		Набор = РегистрыСведений.ИА_ГруппыКЦ.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Установить(Пользователь);
		Набор.Отбор.Задача.Установить(стрСсылка);
		
		мен = Набор.Добавить();
		мен.Задача = стрСсылка;
		мен.Группа = пГруппа;
		мен.Пользователь = Пользователь;
		Набор.Записать(истина);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокГрупп(ГруппаИскл, корзина, ТекПользователь)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ГруппыКЦ.Ссылка
	               |ИЗ
	               |	Справочник.ИА_ГруппыКЦ КАК ИА_ГруппыКЦ
	               |ГДЕ
	               |	ИА_ГруппыКЦ.Пользователь = &Пользователь
	               |	И ИА_ГруппыКЦ.Корзина = &Корзина
	               |	И ИА_ГруппыКЦ.Ссылка <> &Ссылка
	               |	И ИА_ГруппыКЦ.ПометкаУдаления = ложь";
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	Запрос.УстановитьПараметр("Ссылка", ГруппаИскл);
	Запрос.УстановитьПараметр("Корзина", Справочники.ИА_РасширенияКомцентра[корзина]);
	м = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Рез = Новый СписокЗначений;
	Рез.ЗагрузитьЗначения(м);
	Возврат Рез;
КонецФункции

&НаСервере
Процедура СохранитьНастройкиДинамическихСписковИВидимости()
	
	СписокИменКорзин = СписокИменКорзин();
	
	СтруктураСохраняемыхНастроек = Новый Структура;
	
	//СтруктураСохраняемыхНастроек.Вставить("СтатистикиВидимость", Элементы.ГруппаМоиСтат.Видимость);
	//СтруктураСохраняемыхНастроек.Вставить("ПланыВидимость", Элементы.ГруппаПланы.Видимость);
	
	Для каждого КорзинаИзСписка Из СписокИменКорзин Цикл
		
		ИмяКорзины = КорзинаИзСписка.Значение;
		СтруктураСохраняемыхНастроекКорзины = Новый Структура;
		ДобавитьНастройкиГруппировкиВСтруктуру(СтруктураСохраняемыхНастроекКорзины, ИмяКорзины);
		
		СтруктураСохраняемыхНастроек.Вставить("Настройки" + ИмяКорзины, СтруктураСохраняемыхНастроекКорзины); 
	КонецЦикла; 
	
	СохранитьВХранилищеСистемныхНастроек(СтруктураСохраняемыхНастроек);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВХранилищеСистемныхНастроек(СтруктураСохраняемыхНастроек)
	
	ХранилищеСистемныхНастроек.Сохранить("ПользовательскиеНастройкиКЦ",, СтруктураСохраняемыхНастроек); 

КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройкиГруппировкиВСтруктуру(СтруктураСохраняемыхНастроекКорзины, ИмяКорзины)
	
	 СтруктураСохраняемыхНастроекКорзины.Вставить("Группировки"+ИмяКорзины, ЭтаФорма[ИмяКорзины].Группировка);
	
КонецПроцедуры

&НаСервере
Процедура ВостановитьНастройкиДинамическихСписковИВидимости()
	
	СтруктураСохраняемыхНастроек = ЗагрузитьИзХранилищаСистемныхНастроек();	

	Если ТипЗнч(СтруктураСохраняемыхНастроек) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	
	//Если СтруктураСохраняемыхНастроек.Свойство("СтатистикиВидимость") Тогда
	//	Элементы.ГруппаМоиСтат.Видимость =  СтруктураСохраняемыхНастроек.СтатистикиВидимость;
	//КонецЕсли;
	//Если СтруктураСохраняемыхНастроек.Свойство("ПланыВидимость") Тогда
	//	Элементы.ГруппаПланы.Видимость =  СтруктураСохраняемыхНастроек.ПланыВидимость;
	//КонецЕсли;
	
	СписокИменКорзин = СписокИменКорзин();
	
	Для каждого КорзинаИзСписка Из СписокИменКорзин Цикл
		
		ИмяКорзины = КорзинаИзСписка.Значение;
		
		Если Не СтруктураСохраняемыхНастроек.Свойство("Настройки"+ИмяКорзины) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураСохраняемыхНастроекКорзины = СтруктураСохраняемыхНастроек["Настройки"+ИмяКорзины];
		Если ТипЗнч(СтруктураСохраняемыхНастроекКорзины) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
	
		ВостановитьНастройкиГруппировкиИзСтруктуры(СтруктураСохраняемыхНастроекКорзины, ИмяКорзины);
		
	КонецЦикла; 
		
КонецПроцедуры

&НаСервере
Процедура ВостановитьНастройкиГруппировкиИзСтруктуры(СтруктураСохраняемыхНастроекКорзины, ИмяКорзины)
	
	Корзина = ЭтаФорма[ИмяКорзины];
	
	ЭлементыГруппировкиКорзины = Корзина.Группировка.Элементы;
	ЭлементыГруппировкиКорзины.Очистить();
	
	ЭлементыСохраняемыхНастроекГруппировкиКорзины = СтруктураСохраняемыхНастроекКорзины["Группировки"+ИмяКорзины].Элементы;
	
	Для каждого ЭлементСохраняемыхНастроекГруппировкиКорзины Из ЭлементыСохраняемыхНастроекГруппировкиКорзины Цикл
		
		ЭлементГруппировкиКорзины = ЭлементыГруппировкиКорзины.Добавить(ТипЗнч(ЭлементСохраняемыхНастроекГруппировкиКорзины));
		ЗаполнитьЗначенияСвойств(ЭлементГруппировкиКорзины, ЭлементСохраняемыхНастроекГруппировкиКорзины); 
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьИзХранилищаСистемныхНастроек()
	Возврат ХранилищеСистемныхНастроек.Загрузить("ПользовательскиеНастройкиКЦ");	
КонецФункции

&НаСервереБезКонтекста
Функция СписокИменКорзин()
	
	СписокИменКорзин = Новый СписокЗначений;
	
	СписокИменКорзин.Добавить("ЗадачиАрхив");
	СписокИменКорзин.Добавить("ЗадачиВРаботе");
	СписокИменКорзин.Добавить("ЗадачиВсе");
	СписокИменКорзин.Добавить("ЗадачиВходящие");
	СписокИменКорзин.Добавить("ЗадачиИсходящие");
	
	Возврат СписокИменКорзин;	
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСкрытьСтатистики(Команда)
	Элементы.ГруппаМоиСтат.Видимость = не Элементы.ГруппаМоиСтат.Видимость;
КонецПроцедуры

&НаКлиенте                           
Процедура ПоказатьСкрытьПланы(Команда)
	Элементы.ГруппаПланы.Видимость = не Элементы.ГруппаПланы.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКорзинПриАктивизацииСтроки(Элемент)
	тд = Элементы.ДеревоКорзин.ТекущиеДанные;
	
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	текКорзина = тд.Корзина;
	ОтборКорзина = Неопределено;
	Если тд.ПолучитьРодителя()<>Неопределено Тогда
		ОтборКорзина = текКорзина;
		текКорзина = тд.ПолучитьРодителя().Корзина;
	КонецЕсли;
	
	ИмяСтрКорзины = СтрЗаменить(текКорзина," ","");
	Элементы.ГруппаКоммцентр.ТекущаяСтраница = Элементы[ИмяСтрКорзины];
	Если текКорзина = ПредопределенноеЗначение("Справочник.ИА_РасширенияКомцентра.Входящие") ИЛИ текКорзина = ПредопределенноеЗначение("Справочник.ИА_РасширенияКомцентра.ВРаботе")
		ИЛИ текКорзина = ПредопределенноеЗначение("Справочник.ИА_РасширенияКомцентра.Исходящие") Тогда
		
		Если тд.ПолучитьРодителя() = Неопределено И ИА_НастройкиСПИ.ЗначениеНастройки(ТекПользователь, ПредопределенноеЗначение("ПланВидовХарактеристик.ИА_НастройкиПользователей.СкрытьЗадачиРаспределенныеВГруппы")) Тогда
			ОтборКорзина = ПредопределенноеЗначение("Справочник.ИА_ГруппыКЦ.ПустаяСсылка");
		КонецЕсли;

		ЭтаФорма["Задачи" + ИмяСтрКорзины].Параметры.УстановитьЗначениеПараметра("ОтборГруппа", ОтборКорзина);
		ОбновитьКорзину(ИмяСтрКорзины);		
	КонецЕсли;
	
	ТаблицаПриАктивизацииСтроки(Элементы["Таблица"+ИмяСтрКорзины]);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриАктивизацииСтроки(Элемент)
	тд = Элемент.ТекущиеДанные;
	
	Если тд<>Неопределено Тогда
		НетСсылки = не тд.Свойство("ссылка");
		Если (НетСсылки ИЛИ тд.ссылка = ПредВыбЗадача) Тогда
			Если НетСсылки Тогда
				Предпросмотр = новый ТабличныйДокумент;
				ПредВыбЗадача = ПредопределенноеЗначение("Задача.ИА_ЗадачаПланаДействий.ПустаяСсылка");
			КонецЕсли;
			возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.Предпросмотр.Видимость Тогда
		СтруктПредставления = Новый Структура("Ссылка,Дата,Наименование,Автор,Пользователь,Пост");
		Если тд <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтруктПредставления, тд);
		КонецЕсли;
		
		#ЕСЛИ ВебКлиент Тогда
			ВывестиПредставление(СтруктПредставления, СоотвИДпользователей);
		#ИНАЧЕ
			табДок = ПолучитьПредставление(СтруктПредставления,Взаимодействия1с, СоотвИДпользователей);  
			Предпросмотр = табДок;
		#КОНЕЦЕСЛИ
		
		Если тд = Неопределено Тогда
			возврат;
		КонецЕсли;
		
		Обл = Предпросмотр.Область("R1C1");
		Элементы.Предпросмотр.ТекущаяОбласть = Обл;
	КонецЕсли;
	
	Если тд = Неопределено Тогда
		возврат;
	Иначе
		ПредВыбЗадача = тд.ссылка;
	КонецЕсли;
		
	Если Элемент = Элементы.ТаблицаВходящие и тд.Свойство("Ссылка") Тогда
		Если УбратьПризнакНовой(тд.Ссылка, ТекПользователь)	Тогда
			Элемент.обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВывестиПредставление(СтруктПредставления, СоотвИДпользователей)
	табДок = ПолучитьПредставление(СтруктПредставления,Взаимодействия1с, СоотвИДпользователей);  
	Предпросмотр.Очистить();
	Предпросмотр.Вывести(табДок);
КонецПроцедуры

&НаСервереБезКонтекста
Функция УбратьПризнакНовой(задача, Пользователь)
	мен = РегистрыСведений.ИА_НовыеЗадачи.СоздатьМенеджерЗаписи();
	мен.Пользователь = Пользователь; 
	мен.Задача = задача;
	мен.Прочитать();
	
	Если мен.Выбран() Тогда
		мен.Удалить();
		возврат Истина;
	Иначе
		Возврат ложь;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПредставление(данные,Взаимодействия1с,СоотвИДпользователей)
	
	Предпросмотр = новый ТабличныйДокумент;
	Если данные.ссылка = Неопределено Тогда
		возврат Предпросмотр;
	КонецЕсли;
	
	макет = Обработки.ИА_КСУ_РабочийСтол.ПолучитьМакет("ПредставлениеЗадачи");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_ЗадачаПланаДействий.Ссылка,	               
	               |	ИА_ЗадачаПланаДействий.Номер,
	               |	ИА_ЗадачаПланаДействий.Дата,
	               |	ИА_ЗадачаПланаДействий.Наименование,
	               |	ИА_ЗадачаПланаДействий.Содержание,
	               |	ИА_ЗадачаПланаДействий.Исполнитель,	               
	               |	ИА_ЗадачаПланаДействий.ДатаВыполнения,
	               |	ИА_ЗадачаПланаДействий.Автор,	               
	               |	ИА_ЗадачаПланаДействий.ЭтоПослание,
	               |	ИА_ЗадачаПланаДействий.ПостАвтора,
	               |	ИА_ЗадачаПланаДействий.ЭтоЗРС,
	               |	ИА_ЗадачаПланаДействий.Ситуация,
	               |	ИА_ЗадачаПланаДействий.Данные,
	               |	ИА_ЗадачаПланаДействий.ПрикрепленныйОбъект,
	               |	ИА_ЗадачаПланаДействий.ИсполнительЗРС,
	               |	ИА_ЗадачаПланаДействий.СодержаниеТекст,
	               |	ИА_ЗадачаПланаДействий.СитуацияТекст,
	               |	ИА_ЗадачаПланаДействий.ДанныеТекст,
	               |	ИА_ЗадачаПланаДействий.ДокладОбИсполнении,	               
	               |	ИА_ЗадачаПланаДействий.Пользователь,
	               |	ИА_ЗадачаПланаДействий.Пост,
	               |	ИА_ЗадачаПланаДействий.ХодВыполнения.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Дата,
	               |		Пользователь,
	               |		Комментарий,
	               |		ЭтоКомментарий
	               |	)
	               |ИЗ
	               |	Задача.ИА_ЗадачаПланаДействий КАК ИА_ЗадачаПланаДействий
	               |ГДЕ
	               |	ИА_ЗадачаПланаДействий.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", данные.Ссылка);				   
	Выборка = Запрос.Выполнить().Выбрать();
	ЭтоЗадача = Выборка.Следующий();
	
	// шапка
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ЗаполнитьЗначенияСвойств(ОблШапка.Параметры, данные);	
	Автор = данные.Автор;
	Если (не ЗначениеЗаполнено(Автор) ИЛИ не ЗначениеЗаполнено(ОблШапка.Параметры.Дата)) и ЭтоЗадача ТОгда
		ЗаполнитьЗначенияСвойств(ОблШапка.Параметры, Выборка);	
		Автор = Выборка.Автор;
	КонецЕсли;
	Фото = РегистрыСведений.ИА_ДанныеФизЛиц.ПолучитьФотоПользователя(Автор,"Аватар");
	Если Фото <> Неопределено Тогда
		ОблШапка.Рисунки[0].Картинка = Новый Картинка(Фото,истина);
	КонецЕсли;
	Предпросмотр.Вывести(ОблШапка);
	
	
	Если ТипЗнч(данные.Ссылка) <> Тип("ЗадачаСсылка.ИА_ЗадачаПланаДействий") Тогда
		возврат Предпросмотр;
	КонецЕсли;
	
	// содержание
	ОблСод = Макет.ПолучитьОбласть("Содержание");
	ОблСод.Параметры.Текст = Выборка.Содержание;
	ОблСод.Параметры.Заголовок = "Содержание задачи:";	
	
	Если Выборка.ЭтоПослание Тогда
		ОблСод.Параметры.Заголовок = "Содержание послания:";	
	ИначеЕсли Выборка.ЭтоЗРС Тогда
		ОблСод.Параметры.Заголовок = "Ситуация:";	
		ОблСод.Параметры.Текст = Выборка.Ситуация;
	КонецЕсли;
	Предпросмотр.Вывести(ОблСод);
	
	Если Выборка.ЭтоЗРС Тогда
		ОблСод.Параметры.Заголовок = "Данные:";	
		ОблСод.Параметры.Текст = Выборка.Данные;		
		Предпросмотр.Вывести(ОблСод);
		
		ОблСод.Параметры.Заголовок = "Решение:";	
		ОблСод.Параметры.Текст = Выборка.Содержание;		
		Предпросмотр.Вывести(ОблСод);
	КонецЕсли;
	
	Если Выборка.ДокладОбИсполнении <> "" Тогда
		ОблСод.Параметры.Заголовок = "Доклад об исполнении:";	
		ОблСод.Параметры.Текст = Выборка.ДокладОбИсполнении;		
		Предпросмотр.Вывести(ОблСод);
	КонецЕсли;
	
	// лента
	Если не Выборка.ЭтоПослание Тогда
		
		Если Взаимодействия1с Тогда
			ход = ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПолучитьТЗСообщенийОбсужденийзадачи(данные.Ссылка,СоотвИДпользователей); 
			Если ход = Неопределено Тогда
				возврат Предпросмотр;
			КонецЕсли;
		Иначе
			ход = Выборка.ХодВыполнения.Выгрузить();
		КонецЕсли;
		
		ход.Сортировать("Дата УБЫВ");
		Если ход.Количество()>0 Тогда
			Обл1 = Макет.ПолучитьОбласть("Лента");
			Предпросмотр.Вывести(Обл1);
			
			Для каждого стр из ход Цикл
				Обл1 = Макет.ПолучитьОбласть("Ход");
				ЗаполнитьЗначенияСвойств(Обл1.Параметры, стр);	
				Фото = РегистрыСведений.ИА_ДанныеФизЛиц.ПолучитьФотоПользователя(стр.Пользователь,"Аватар");
				Если Фото <> Неопределено Тогда				
					Обл1.Рисунки[0].Картинка = Новый Картинка(Фото,истина);
				КонецЕсли;
				Предпросмотр.Вывести(Обл1);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	возврат Предпросмотр;
	
КонецФункции

&НаКлиенте
Процедура ДеревоКорзинПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	
	Если ЗначениеЗаполнено(Строка) И ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура") и ПараметрыПеретаскивания.Значение.Свойство("ЭтоЗадача") Тогда
		СтрокаКорз = ДеревоКорзин.НайтиПоИдентификатору(Строка);
		СтрокаРод = строкаКорз.ПолучитьРодителя();
		Если СтрокаРод <> Неопределено Тогда
			Если ЗадачаВКорзине(ПараметрыПеретаскивания.Значение.Задача, СтрокаРод.корзина, ТекПользователь) Тогда
				ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВходящиеНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ПараметрыПеретаскивания.Значение = Новый Структура("ЭтоЗадача,Задача",истина,Элемент.ТекущиеДанные.Ссылка);	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗадачаВКорзине(задача, корзина, ТекПользователь)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ЗадачиКЦ.Ссылка
	               |ИЗ
	               |	РегистрСведений.ИА_ЗадачиКЦ КАК ИА_ЗадачиКЦ
	               |ГДЕ
	               |	ИА_ЗадачиКЦ.ПользовательКЦ = &ПользовательКЦ
	               |	И ИА_ЗадачиКЦ.Корзина = &Корзина
	               |	И ИА_ЗадачиКЦ.Ссылка = &задача";
	Запрос.УстановитьПараметр("ПользовательКЦ", ТекПользователь);
	Запрос.УстановитьПараметр("Корзина", Корзина);
	Запрос.УстановитьПараметр("задача", задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
КонецФункции

&НаКлиенте
Процедура ДеревоКорзинПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = ложь;
	
	СтрокаКорз = ДеревоКорзин.НайтиПоИдентификатору(Строка);
	
	ТекСсылки = новый Массив;
	ТекСсылки.Добавить(ПараметрыПеретаскивания.Значение.Задача);
	ПереместитьЗадачиВГруппу(ТекСсылки,СтрокаКорз.Корзина, ТекПользователь);
	ОбновитьКорзину(СтрЗаменить(СтрокаКорз.ПолучитьРодителя().Корзина," ",""));
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы=Неопределено ИЛИ не ЗавершениеРаботы Тогда
		СохранитьНастройкиДинамическихСписковИВидимости();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Техподдержка(Команда)
	ОткрытьФорму("ОбщаяФорма.ИА_ОбращениеВТехподдержку",,,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВывестиРасшифровку(Команда)
	НомерЭл = число(Сред(ТекущийЭлемент.Имя,10))+1;
	ФормаСтатистик.ВывестиРасшифровку(НомерЭл);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьЗначение(Команда)
	НомерЭл = число(Сред(ТекущийЭлемент.Имя,10))+1;
	ФормаСтатистик.ДобавитьЗначение(НомерЭл);
КонецПроцедуры




//////////////////// ПЛАНЫ
&НаСервере
Процедура ОбновитьПериодыПланов()
	НачалоНедели = Константы.ИА_НачалоНедели.Получить();
	
	текДата = ТекущаяДата();
	ДатаКонцаНедельныхПланов = ИА_Статистики.ИА_КонецНедели(текДата);
	ДатаНачалаНедельныхПланов = ДатаКонцаНедельныхПланов - 60*60*24*7+1;			
	
	ДневныеНачало = ДатаНачалаНедельныхПланов;
	ДневныеКонец = Конецдня(ДатаКонцаНедельныхПланов);
	
	Если РежимНедели = -1 Тогда
		ДатаНачалаНедельныхПланов = ДатаНачалаНедельныхПланов - 60*60*24*7;			
		ДневныеНачало = ДневныеНачало - 60*60*24*7;
		ДневныеКонец = ДневныеКонец - 60*60*24*7;
	КонецЕсли;
	
	Если РежимНедели > 0 Тогда
		ДатаКонцаНедельныхПланов = ДатаКонцаНедельныхПланов + 60*60*24*7*РежимНедели;			
		ДневныеНачало = ДневныеНачало + 60*60*24*7*РежимНедели;
		ДневныеКонец = ДневныеКонец + 60*60*24*7*РежимНедели;
	КонецЕсли;
		
	ПланировщикНеделя.ТекущиеПериодыОтображения.Очистить();
	ПланировщикНеделя.ТекущиеПериодыОтображения.Добавить(ДатаНачалаНедельныхПланов, КонецДня(ДатаКонцаНедельныхПланов));
	
	//
	
	ОбновитьДневныеПериоды(ДневныеНачало, ДневныеКонец);	
	ОбновитьДневныеПланы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНедельныеПланы()
	Запрос = Новый Запрос;
	ИА_Планы.ЗаполнитьТаблицуПлановВЗапросе(Запрос,ДатаНачалаНедельныхПланов,ДатаКонцаНедельныхПланов);
	
	запрос.УстановитьПараметр("ТолькоНевып", Элементы.ТолькоНевыполненные.Пометка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_ЗадачиПлана.Ссылка КАК Ссылка,
	               |	ИА_ЗадачиПлана.ВерсияДанных КАК ВерсияДанных,
	               |	ИА_ЗадачиПлана.ПометкаУдаления КАК ПометкаУдаления,
	               |	ИА_ЗадачиПлана.Владелец КАК Владелец,
	               |	ИА_ЗадачиПлана.Код КАК Код,
	               |	ИА_ЗадачиПлана.Наименование КАК Наименование,
	               |	ИА_ЗадачиПлана.Группировка КАК Группировка,
	               |	ИА_ЗадачиПлана.Содержание КАК Содержание,
	               |	ИА_ЗадачиПлана.Продукт КАК Продукт,
	               |	ИА_ЗадачиПлана.СрокИсполнения КАК СрокИсполнения,
	               |	ИА_ЗадачиПлана.ВремяПлан КАК ВремяПлан,
	               |	ИА_ЗадачиПлана.ВремяФакт КАК ВремяФакт,
	               |	ИА_ЗадачиПлана.Выполнено КАК Выполнено,
	               |	ИА_ЗадачиПлана.Время КАК Время,
	               |	ИА_ЗадачиПлана.Предопределенный КАК Предопределенный,
	               |	ИА_ЗадачиПлана.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	               |	НедельныеПланы.ДатаНачала КАК ДатаНачала,
	               |	ЛОЖЬ КАК гугл
	               |ИЗ
	               |	Справочник.ИА_ЗадачиПлана КАК ИА_ЗадачиПлана
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НедельныеПланы КАК НедельныеПланы
	               |		ПО (НедельныеПланы.План = ИА_ЗадачиПлана.Владелец)
	               |ГДЕ
	               |	ИА_ЗадачиПлана.ПометкаУдаления = ЛОЖЬ
	               |	И (ИА_ЗадачиПлана.Выполнено = ложь или &ТолькоНевып = ложь)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ЗадачиПлана.Группировка.Порядок,
	               |	ИА_ЗадачиПлана.Порядок,
	               |	ИА_ЗадачиПлана.Код";
	
	ПланировщикНеделя.Элементы.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	сч = 1;
	длительность1ед = 60*60;
	Пока Выборка.Следующий() Цикл
		ДатаНачала    = Выборка.ДатаНачала + сч * длительность1ед;
		ДатаОкончания = ДатаНачала + длительность1ед;
		НовыйЭлемент = ПланировщикНеделя.Элементы.Добавить(ДатаНачала, ДатаОкончания);
		
		Если ЗначениеЗаполнено(Выборка.ВремяФакт) Тогда
			НовыйЭлемент.Текст = Формат(Выборка.ВремяФакт,"ДФ=HH:mm")+ " ";
		ИначеЕсли ЗначениеЗаполнено(Выборка.ВремяПлан) Тогда
			НовыйЭлемент.Текст = Формат(Выборка.ВремяПлан,"ДФ=HH:mm")+ " ";
		КонецЕсли;
		НовыйЭлемент.Текст = НовыйЭлемент.Текст + Выборка.Содержание;
		Если ЗначениеЗаполнено(Выборка.Продукт) Тогда
			НовыйЭлемент.Текст = НовыйЭлемент.Текст + ". Продукт: "+ Выборка.Продукт;		
		КонецЕсли;
		
		НовыйЭлемент.Значение = выборка.ссылка;
		
		ИА_Планы.ПрименитьОформлениеСтроки(Выборка, НовыйЭлемент);
		
		
		сч = сч + 2;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция МоиПолучитьПосты()
	
	Польз = ПараметрыСеанса.ТекущийПользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_АдресацияЗадачПланаДействий.Пост,
	               |	ИА_АдресацияЗадачПланаДействий.Пост.ТипТерминала.Порядок КАК Порядок
	               |ИЗ
	               |	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |ГДЕ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь = &Пользователь
	               |	И ИА_АдресацияЗадачПланаДействий.Пост.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_АдресацияЗадачПланаДействий.Пост.ТипТерминала.Порядок";
	Запрос.УстановитьПараметр("Пользователь", польз);
	
	ТЗ = Запрос.Выполнить().Выгрузить();

	Если ТЗ.Количество() > 0 Тогда
		Возврат ТЗ.ВыгрузитьКолонку("Пост");
	Иначе
		Возврат новый Массив;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПланировщикНеделяПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикНеделяВыбор(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Если Элементы.ПланировщикНеделя.ВыделенныеЭлементы.Количество() > 0 Тогда
		задача = Элементы.ПланировщикНеделя.ВыделенныеЭлементы[0].Значение;
		Если ЗначениеЗаполнено(задача) Тогда
			план = ПолучитьПланЗадачи(задача);
			
			Оп = Новый ОписаниеОповещения("ЗакрытиеНедПлана", ЭтаФорма, план);
			ОткрытьФорму("Справочник.ИА_ПланыДействий.ФормаОбъекта",новый структура("Ключ", План),,,,,Оп);
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеНедПлана(Закрытие, ДопПарам) Экспорт
	ОбновитьНедельныеПланы();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПланЗадачи(задача)
	возврат задача.владелец;	
КонецФункции

&НаКлиенте
Процедура ПланировщикНеделяПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДневныеПериоды(Начало, Конец)
	
	ДатаНачалаДневныхПланов = Начало;
	ДатаКонцаДневныхПланов = Конец;
	
	ПланировщикДень.ТекущиеПериодыОтображения.Очистить();
	выходные = ИА_Защита_Статистика.ПолучитьВыходныеЗаПериод(Начало, Конец);
	
	ТекНачало = Начало;
	Пока ТекНачало < Конец Цикл
		если выходные.найти(ТекНачало) = Неопределено Тогда
			ПланировщикДень.ТекущиеПериодыОтображения.Добавить(ТекНачало, КонецДня(ТекНачало));
		КонецЕсли;
		ТекНачало = ТекНачало + 60*60*24;
	КонецЦикла;
	
	ПланировщикДень.ИнтервалыФона.Очистить();
	интФ = ПланировщикДень.ИнтервалыФона.Добавить(НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата()));
	интФ.Цвет = новый цвет(235,235,255);
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикНеделяПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)  // один клик на свободной области
	СтандартнаяОбработка = Ложь;
	
	ОбновитьДневныеПериоды(Начало, Конец-1);
	
	ЕстьПлан = ЕстьПлан(ПланировщикНеделя,Начало,Конец);
	Если ЕстьПлан Тогда
		ОбновитьДневныеПланы();
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ПланировщикНеделяПередСозданиемЗавершение", ЭтаФорма, новый Структура("Начало, Конец",Начало, Конец)), "Создать недельный план?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьПлан(Планировщик, Начало,Конец, ИсключаяЗадачу = Неопределено)
	Для каждого эл из Планировщик.Элементы Цикл
		если эл.Начало >= Начало И эл.Конец <= Конец и ИсключаяЗадачу<>эл.Значение и эл.Значение<>Неопределено Тогда // план уже есть
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ПланировщикНеделяПередСозданиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПредПлан = ПолучитьПредНедПлан(ДополнительныеПараметры.Начало);
		
		Оп = Новый ОписаниеОповещения("ЗакрытиеНедПлана", ЭтаФорма, ПредПлан);
		
		парам = Новый Структура("ЗначениеКопирования, Начало", ПредПлан, ДополнительныеПараметры.Начало);
		ОткрытьФорму("Справочник.ИА_ПланыДействий.ФормаОбъекта",парам,,,,,Оп);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредНедПлан(ТекНачало)
	ДатаКонца = ТекНачало - 1;
	ДатаНачала = ДобавитьМесяц(ДатаКонца,-1);	
	Запрос = Новый Запрос;
	ИА_Планы.ЗаполнитьТаблицуПлановВЗапросе(Запрос,ДатаНачала,ДатаКонца);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_ПланыДействий.План КАК План
	               |ИЗ
	               |	НедельныеПланы КАК ИА_ПланыДействий	             
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ПланыДействий.ДатаНачала УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		возврат Выборка.План;
	Иначе
		Возврат неопределено;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПланировщикНеделяПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикНеделяПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	ОтменаРедактирования = истина;
	
	Текстрока = Элемент.ВыделенныеЭлементы[0];
	текЗадача = Текстрока.Значение;
	Начало = НачалоДня(Текстрока.Начало);
	Конец = Начало + 60*60*24*7 -1 ;
	ЕстьПлан = ЕстьПлан(ПланировщикНеделя,Начало,Конец, текЗадача);
	
	Если ЕстьПлан ТОгда
		ПеренестиЗадачуВНедельныйПлан(текЗадача, Начало, Конец);
	Иначе
		//ПоказатьВопрос(Новый ОписаниеОповещения("ПланировщикНеделяПередСозданиемЗавершение", ЭтаФорма, новый Структура("Начало, Конец",Начало, Конец)), "Сначала необходимо создать план. Создать?",РежимДиалогаВопрос.ДаНет);	
		Сообщить("Сначала создайте недельный план");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПеренестиЗадачуВНедельныйПлан(Задача, Начало, Конец)
	Владелец = ПолучитьНедельныйПлан(Начало);
	Если не ЗначениеЗаполнено(Владелец) Тогда
		возврат;
	КонецЕсли;
	
	НовЗадача = Задача.Скопировать();
	НовЗадача.Владелец = Владелец;
	НовЗадача.Выполнено = ложь;
	НовЗадача.Выполнено = ложь;
	НовЗадача.ВремяФакт = Дата(1,1,1);
	НовЗадача.записать();
	
	ОбновитьНедельныеПланы();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНедельныйПлан(Начало)
	Запрос = Новый Запрос;
	ИА_Планы.ЗаполнитьТаблицуПлановВЗапросе(Запрос,начало,начало);	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ПланыДействий.План
	               |ИЗ
	               |	НедельныеПланы КАК ИА_ПланыДействий";
	Выборка = Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		возврат выборка.План;
	Иначе
		возврат Неопределено;
	КонецЕсли;
КонецФункции
	
&НаКлиенте
Процедура ВыполнитьНедЗадачу(Команда)
	ВыполнитьЗадачу();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу()
		
	для каждого эл из Элементы.ПланировщикНеделя.ВыделенныеЭлементы цикл
		Если ЗначениеЗаполнено(эл.Значение) Тогда
			ВыполнитьДневнуюЗадачуСервер(эл.Значение);			
			ИА_Планы_Клиент.ЗавершитьЗадачуОснование(эл.Значение);
		КонецЕсли;
	КонецЦикла;
	ОбновитьОформлениеНедельныхЗадач();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОформлениеНедельныхЗадач()
	для каждого эл из Элементы.ПланировщикНеделя.ВыделенныеЭлементы цикл
		Если ЗначениеЗаполнено(эл.Значение) Тогда
			данные = новый Структура("Группировка,Выполнено,гугл,СрокИсполнения", эл.Значение.Группировка, эл.Значение.Выполнено, ложь,эл.Значение.СрокИсполнения);
			ИА_Планы.ПрименитьОформлениеСтроки(данные, эл);			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УказатьФактическоеВремя(Команда)
	если  Элементы.ПланировщикНеделя.ВыделенныеЭлементы.Количество() >0 Тогда
		Задача = Элементы.ПланировщикНеделя.ВыделенныеЭлементы[0].Значение;
		Если ЗначениеЗаполнено(Задача) Тогда
			опОповещ = новый ОписаниеОповещения("УказатьВремя", ЭтаФорма,Задача); 
			ПоказатьВводДаты(опОповещ,,"Укажите фактически потраченное время на задачу",ЧастиДаты.Время);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УказатьВремя(ВыбЗначение, ДопПарам) Экспорт
	Если ЗначениеЗаполнено(ВыбЗначение) Тогда
		УказатьФактВремя(ДопПарам, ВыбЗначение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УказатьФактВремя(задача, время)
	об = задача.получитьОБъект();
	об.ВремяФакт = время;
	об.записать();
	
	ОбновитьНедельныеПланы();
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПлан(Команда)
	РежимНедели = 0;
	ОбновитьПериодыПланов();
	ОбновитьНедельныеПланы();
	ОбновитьДневныеПланы();
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИПредыдущийПлан(Команда)
	РежимНедели = -1;
	ОбновитьПериодыПланов();
	ОбновитьНедельныеПланы();
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИСледующийПлан(Команда)
	РежимНедели = 1;
	ОбновитьПериодыПланов();
	ОбновитьНедельныеПланы();
КонецПроцедуры

&НаКлиенте
Процедура ДетальныеПланы(Команда)
    
    ОтборПост     = ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка");    
    Парам = Новый Структура("ОтборПланыПодчиненных, ОтборПост", Истина, ОтборПост);
	ОткрытьФорму("Обработка.ИА_КСУ_РабочийСтол.Форма.ПланыСотрудников", Парам);                             
    
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ЕстьПлан = ЕстьПлан(ПланировщикДень,НачалоДня(Начало),КонецДня(Конец));
	Если не ЕстьПлан Тогда		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПланировщикДеньПередСозданиемЗавершение", ЭтаФорма, новый Структура("Начало, Конец",Начало, Конец)), "Создать дневной план?",РежимДиалогаВопрос.ДаНет);
	Иначе
		План = ПолучитьДневнойПлан(НачалоДня(Начало),неопределено);//МРД_Вызов дневного плана из любого времени дня		
		Оп = Новый ОписаниеОповещения("ЗакрытиеДневногоПлана", ЭтаФорма, план);
		ОткрытьФорму("Справочник.ИА_ПланыДействий.ФормаОбъекта",новый структура("Ключ", План),,,,,Оп);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПередСозданиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НедПлан = ПолучитьНедельныйПлан(ДатаНачалаДневныхПланов);
		Оп = Новый ОписаниеОповещения("ЗакрытиеДневногоПлана", ЭтаФорма, НедПлан);		
		парам = Новый Структура("Родитель,ДатаДневногоПлана", НедПлан,ДополнительныеПараметры.Начало);
		ОткрытьФорму("Справочник.ИА_ПланыДействий.ФормаОбъекта",парам,,,,,Оп);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеДневногоПлана(Закрытие, ДопПарам) Экспорт
	ОбновитьДневныеПланы();
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
	СтандартнаяОбработка = ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	МассивВыбора = ПараметрыПеретаскивания.Значение;
	Если ТипЗнч(МассивВыбора) = Тип("Массив") или ТипЗнч(МассивВыбора) = Тип("ФиксированныйМассив") Тогда
		Выбор = МассивВыбора[0];
	Иначе
		Выбор = МассивВыбора;
	КонецЕсли;
	
	ДневнойПлан = ПолучитьДневнойПлан(Дата);
	Если ТипЗнч(Выбор) = тип("ЭлементПланировщика") Тогда
		недельнаяЗадача = Выбор.Значение;
		Если ЗначениеЗаполнено(недельнаяЗадача) Тогда
			Если ДневнойПлан = Неопределено Тогда
				НедПлан = ПолучитьПланЗадачи(недельнаяЗадача);
				Оп = Новый ОписаниеОповещения("ЗакрытиеДневногоПлана", ЭтаФорма, НедПлан);		
				парам = Новый Структура("Родитель,ДатаДневногоПлана,ЗадачаОснование", НедПлан,Дата,недельнаяЗадача);
				ОткрытьФорму("Справочник.ИА_ПланыДействий.ФормаОбъекта",парам,,,,,Оп);
			Иначе
				ПеренестиЗадачуИзНедельногоВДневной(ДневнойПлан,недельнаяЗадача, дата);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Выбор) = тип("Структура") Тогда
		Если ДневнойПлан = Неопределено Тогда
			НедПлан = ПолучитьНедельныйПлан(ДатаНачалаДневныхПланов);
			Если НедПлан = Неопределено Тогда
				сообщить("Сначала создайте недельный план!");
				возврат;
			КонецЕсли;
			
			Оп = Новый ОписаниеОповещения("ЗакрытиеДневногоПлана", ЭтаФорма, НедПлан);		
			парам = Новый Структура("Родитель,ДатаДневногоПлана,ЗадачаОснование", НедПлан,Дата,Выбор.Задача);
			ОткрытьФорму("Справочник.ИА_ПланыДействий.ФормаОбъекта",парам,,,,,Оп);
		Иначе
			ПеренестиЗадачуИзКЦВДневной(ДневнойПлан,Выбор.Задача, дата);
			ПодключитьОбработчикОжидания("ОбновитьКорзины",1,истина);
		Конецесли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДневнойПлан(дата, ИсключаяЗадачу = Неопределено)
	для каждого эл из ПланировщикДень.Элементы Цикл
		если НачалоДня(эл.Начало) = НачалоДня(дата) и ИсключаяЗадачу<>эл.Значение и эл.Значение<>Неопределено И ТипЗнч(эл.значение)=тип("СправочникСсылка.ИА_ЗадачиПлана") Тогда
			возврат эл.значение.Владелец;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;	
КонецФункции

&НаСервере
Процедура ПеренестиЗадачуИзКЦВДневной(ДневнойПлан,ЗадачаКЦ, дата)
	Если ДневнойПлан <> Неопределено Тогда
		обЗадача = ЗадачаКЦ.получитьобъект();
		обЗадача.Отложена = истина;
		обЗадача.записать();		
		
		новЗадача = Справочники.ИА_ЗадачиПлана.СоздатьЭлемент();
		новЗадача.владелец = ДневнойПлан;
		новЗадача.ЗадачаОснование = ЗадачаКЦ;
		новЗадача.Пост = ЗадачаКЦ.Пост;
		Если новЗадача.Пост.Пустая() ТОгда
			новЗадача.Пост = ДневнойПлан.Пост;
		КонецЕсли;
		
		новЗадача.Группировка = Перечисления.ИА_ТипыЗадачБП.Задачи;
		новЗадача.Содержание = ЗадачаКЦ.Наименование;
		новЗадача.ВремяНачала = Дата - ИА_Планы.ВремяВЧисло(НачалоДня(Дата));
		новЗадача.ВремяКонца = новЗадача.ВремяНачала+ 60*60;
		новЗадача.ВремяПлан = Дата(1,1,1,1,0,0);
		новЗадача.ВремяФакт = Дата(1,1,1,0,0,0);
		новЗадача.Записать();
		
		ОбновитьДневныеПланы();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПеренестиЗадачуИзНедельногоВДневной(ДневнойПлан,недельнаяЗадача, дата)
	Если ДневнойПлан <> Неопределено Тогда
		новЗадача = недельнаяЗадача.Скопировать();
		новЗадача.Выполнено = ложь;
		новЗадача.владелец = ДневнойПлан;
		новЗадача.ВремяНачала = Дата - ИА_Планы.ВремяВЧисло(НачалоДня(Дата));
		новЗадача.ВремяКонца = новЗадача.ВремяНачала+ 60*60;
		новЗадача.ВремяПлан = Дата(1,1,1,1,0,0);
		новЗадача.ВремяФакт = Дата(1,1,1,0,0,0);
		новЗадача.Записать();
		
		ОбновитьДневныеПланы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
	СтандартнаяОбработка = ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикНеделяНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньВыбор(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Если Элементы.ПланировщикДень.ВыделенныеЭлементы.Количество() > 0 Тогда		
		задача = Элементы.ПланировщикДень.ВыделенныеЭлементы[0].Значение;
		Если ТипЗнч(задача) = тип("Строка") Тогда // гугл
			возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(задача) Тогда
			план = ПолучитьПланЗадачи(задача);
			
			Оп = Новый ОписаниеОповещения("ЗакрытиеДневногоПлана", ЭтаФорма, план);
			ОткрытьФорму("Справочник.ИА_ПланыДействий.ФормаОбъекта",новый структура("Ключ", План),,,,,Оп);
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	Если НовыйЭлемент Тогда
		ОтменаРедактирования = истина;
	Иначе	
		Если Элемент.ВыделенныеЭлементы.Количество() = 1 Тогда
			ТекЭлем = Элемент.ВыделенныеЭлементы[0];
			Если ЗначениеЗаполнено(ТекЭлем.Значение) Тогда
				Если ТипЗнч(ТекЭлем.Значение) = тип("Строка") Тогда // гугл
					ОтменаРедактирования = истина;
					Возврат;
				КонецЕсли;

				Допуск = 60*15;
				// исправим наложения блоков друг на друга
				для каждого стрЭл из ПланировщикДень.Элементы Цикл
					Если стрЭл <> ТекЭлем и НачалоДня(стрЭл.Начало) = НачалоДня(ТекЭлем.Начало) Тогда
						В_Дельта = ИА_Планы_Клиент.ВремяВЧисло(стрЭл.Конец) - ИА_Планы_Клиент.ВремяВЧисло(ТекЭлем.Начало);
						если В_Дельта > 0 И В_Дельта < Допуск И (ТекЭлем.Начало + В_Дельта) < ТекЭлем.Конец-Допуск Тогда
							ТекЭлем.Начало = ТекЭлем.Начало + В_Дельта;
						КонецЕсли;
						
						Н_Дельта = ИА_Планы_Клиент.ВремяВЧисло(ТекЭлем.Конец) - ИА_Планы_Клиент.ВремяВЧисло(стрЭл.Начало);
						если Н_Дельта > 0 И Н_Дельта < Допуск И (ТекЭлем.Конец - Н_Дельта) < ТекЭлем.НАчало + Допуск Тогда
							ТекЭлем.Конец = ТекЭлем.Конец - Н_Дельта;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				//
				ДнПлан = Неопределено;
				Если ИзмененияВОдномДне(ТекЭлем.Значение,ТекЭлем.Начало) Тогда
					ЗаписатьИзмененияЗадачи(Новый Структура("Задача, ВремяНачала, ВремяКонца",ТекЭлем.Значение,ТекЭлем.Начало, ТекЭлем.Конец),ОтменаРедактирования,ДнПлан);
				Иначе
					ОтменаРедактирования = истина;
					ДнПлан = ПолучитьДневнойПлан(НачалоДня(ТекЭлем.Начало), ТекЭлем.Значение);
					
					Если ДнПлан = Неопределено Тогда
						НедПлан = ПолучитьНедельныйПлан(ДатаНачалаДневныхПланов);
						Оп = Новый ОписаниеОповещения("ЗакрытиеДневногоПлана", ЭтаФорма, НедПлан);		
						парам = Новый Структура("Родитель,ДатаДневногоПлана,ЗадачаОснование", НедПлан,НачалоДня(ТекЭлем.Начало),ТекЭлем.Значение);
						ОткрытьФорму("Справочник.ИА_ПланыДействий.ФормаОбъекта",парам,,,,,Оп);
					Иначе
						ЗаписатьИзмененияЗадачи(Новый Структура("Задача, ВремяНачала, ВремяКонца",ТекЭлем.Значение,ТекЭлем.Начало, ТекЭлем.Конец),ОтменаРедактирования,ДнПлан);
						ОбновитьДневныеПланы();
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзмененияВОдномДне(задача,ВремяНачала)
	Возврат задача.Владелец.ДатаНачала = НачалоДня(ВремяНачала);
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьИзмененияЗадачи(данные,ОтменаРедактирования,ДнПлан)
	Если ДнПлан = Неопределено Тогда // изменения в рамках одного дневного плана
		об = данные.задача.ПолучитьОбъект();
		об.ВремяНачала = данные.ВремяНачала - ИА_Планы.ВремяВЧисло(НачалоДня(данные.ВремяНачала));
		об.ВремяКонца = данные.ВремяКонца - ИА_Планы.ВремяВЧисло(НачалоДня(данные.ВремяКонца));
		об.ВремяФакт = об.ВремяКонца - ИА_Планы.ВремяВЧисло(об.ВремяНачала);

		об.записать();
	Иначе
		об = данные.задача.Скопировать();
		об.Выполнено = ложь;
		об.владелец = ДнПлан;
		об.ВремяНачала = данные.ВремяНачала;
		об.ВремяКонца = данные.ВремяКонца;
		об.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДневнуюЗадачуСервер(пЗадача)
	об = пЗадача.получитьОБъект();
	об.Выполнено = не об.Выполнено;
	об.записать();	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДневнуюЗадачу()
	
	для каждого эл из Элементы.ПланировщикДень.ВыделенныеЭлементы цикл
		Если ЗначениеЗаполнено(эл.Значение) Тогда
			Если ТипЗнч(эл.Значение) = тип("Строка") ТОгда
				ПоказатьПредупреждение(,"События google нельзя выполнить. Только удалить.");
				Продолжить;
			Иначе
				ВыполнитьДневнуюЗадачуСервер(эл.Значение);			
				ИА_Планы_Клиент.ЗавершитьЗадачуОснование(эл.Значение);		
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ОбновитьОформлениеДневныхЗадач();
	
КонецПроцедуры



&НаСервере
Процедура ОбновитьОформлениеДневныхЗадач()
	для каждого эл из Элементы.ПланировщикДень.ВыделенныеЭлементы цикл
		Если ЗначениеЗаполнено(эл.Значение) Тогда
			Если ТипЗнч(эл.Значение) = тип("Строка") Тогда
				данные = новый Структура("Группировка,Выполнено,гугл,СрокИсполнения", Перечисления.ИА_ТипыЗадачБП.Задачи, ложь, истина, дата(1,1,1));
			Иначе
				данные = новый Структура("Группировка,Выполнено,гугл,СрокИсполнения", эл.Значение.Группировка, эл.Значение.Выполнено, ложь,эл.Значение.СрокИсполнения);
			КонецЕсли;
			ИА_Планы.ПрименитьОформлениеСтроки(данные, эл);			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДневнуюЗадачу1(Команда)
	ВыполнитьДневнуюЗадачу();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДневнуюЗадачу(Команда)
	УдалитьДневнуюЗадачу1();
КонецПроцедуры

&НаСервере
Процедура УдалитьДневнуюЗадачу1()
	
	для каждого эл из Элементы.ПланировщикДень.ВыделенныеЭлементы цикл
		Если ЗначениеЗаполнено(эл.Значение) Тогда
			Если ТипЗнч(эл.Значение) = тип("Строка") ТОгда
				ИА_Планы.УдалитьзадачуГугл(эл.Значение);
			Иначе
				об = эл.Значение.получитьОБъект();
				об.УстановитьПометкуУдаления(истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ОбновитьДневныеПланы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДневныеПланы()
	ИА_Планы.ОбновитьДневныеПланы(ПланировщикДень, ДатаНачалаДневныхПланов,ДатаКонцаДневныхПланов);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНедельнуюЗадачу(Команда)
	УдалитьНедельнуюЗадачу1();
КонецПроцедуры

&НаСервере
Процедура УдалитьНедельнуюЗадачу1()
	
	для каждого эл из Элементы.ПланировщикНеделя.ВыделенныеЭлементы цикл
		Если ЗначениеЗаполнено(эл.Значение) Тогда
			об = эл.Значение.получитьОБъект();
			об.УстановитьПометкуУдаления(истина);
		КонецЕсли;
	КонецЦикла;
	ОбновитьНедельныеПланы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПланыНаСервере()
	ОбновитьНедельныеПланы();
	ОбновитьДневныеПланы();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПланы(Команда)
	ОбновитьПланыНаСервере();
	ОбновитьДневник();
КонецПроцедуры

////////// ДНЕВНИК

&НаКлиенте
Процедура ДневникПриИзменении(Элемент)
	тд = Элементы.Дневник.ТекущиеДанные;
	
	Если тд<>Неопределено Тогда 
		стрДн = Новый Структура("Период,ИД,Пост,Наклон,Состояние,Шаг,Задача,Выполнено,ДатаВыполнения");
		ЗаполнитьЗначенияСвойств(стрДн, тд);
		ИА_Планы.СохранитьИзмененияДневника(стрДн);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДневникПриАктивизацииПоля(Элемент)
	тд = Элементы.Дневник.ТекущиеДанные;
	Если тд<>Неопределено Тогда
		массивШагов = ИА_Планы.ПолучитьШагиСостояния(тд.Состояние); 
		Элемент.ПодчиненныеЭлементы.ДневникГруппа2.ПодчиненныеЭлементы.ДневникШаг.СписокВыбора.ЗагрузитьЗначения(массивШагов);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДневникПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура ДневникПослеУдаления(Элемент)
	обновитьНовыеСостояния();
КонецПроцедуры

&НаКлиенте
Процедура ДневникПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ПоказатьВопрос(Новый ОписаниеОповещения("ДневникПередУдалениемЗавершение", ЭтотОбъект), "Вы уверены?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ДневникПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		тд = Элементы.Дневник.ТекущиеДанные;
	
		Если тд<>Неопределено Тогда 
			ИА_Планы.УдалитьСтрокуДневника(тд.ИД);
			Дневник.Удалить(тд);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДневникПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
КонецПроцедуры

&НаКлиенте
Процедура ДневникПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	МассивВыбора = ПараметрыПеретаскивания.Значение;
	Если ТипЗнч(МассивВыбора) = Тип("Массив") или ТипЗнч(МассивВыбора) = Тип("ФиксированныйМассив") Тогда
		Выбор = МассивВыбора[0];
	Иначе
		Выбор = МассивВыбора;
	КонецЕсли;

	Если ТипЗнч(Выбор) = тип("ЭлементПланировщика") и ЗначениеЗаполнено(Выбор.значение) Тогда
		Если типзнч(Выбор.значение) = тип("Строка") Тогда
			предст = Выбор.значение;
		Иначе
			предст = ПолучитьСодержаниеЗадачи(Выбор.значение);
		КонецЕсли;
		ДобавитьСтрокуВДневникКлиент(предст);
	ИначеЕсли ТипЗнч(Выбор) = тип("Структура") Тогда
		предст = ПолучитьНаименованиеЗадачи(Выбор.Задача);
		ДобавитьСтрокуВДневникКлиент(предст);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСодержаниеЗадачи(з)
	возврат з.Содержание;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеЗадачи(з)
	возврат з.Наименование;
КонецФункции

&НаКлиенте
Процедура ДневникНаклонПриИзменении(Элемент)
	тд = Элементы.Дневник.ТекущиеДанные;
	
	Если тд<>Неопределено Тогда 
		Если тд.наклон.Пустая() Тогда
			тд.ИндексКартинки = -1;
		Иначе
			тд.ИндексКартинки = ИА_Планы.ПолучитьПорядок(тд.Наклон);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДневникСостояниеПриИзменении(Элемент)
	тд = Элементы.Дневник.ТекущиеДанные;
	тд.Шаг = ИА_Планы.ПолучитьПервыйШаг(тд.Состояние);
	
	ДневникПриИзменении(Неопределено);
	обновитьНовыеСостояния();
КонецПроцедуры

&НаКлиенте
Процедура обновитьНовыеСостояния()
	ПредСост = Неопределено;
	инд = Дневник.Количество()-1;
	
	Пока инд >= 0 Цикл
		стр = Дневник[инд];
		Стр.НовоеСостояние = стр.Состояние <> ПредСост и ПредСост<>Неопределено;
		ПредСост = стр.Состояние;
		
		инд = инд - 1;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ДневникВыполненоПриИзменении(Элемент)
	тд = Элементы.Дневник.ТекущиеДанные;
	
	Если тд<>Неопределено Тогда 
		Если тд.Выполнено Тогда
			тд.ДатаВыполнения = ТекущаяДата();
		Иначе
			тд.ДатаВыполнения = Дата(1,1,1);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДневник(Команда)
	ДобавитьСтрокуВДневникКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДневникКлиент(Задача = "")
	Если ПостДневник.Пустая() Тогда
		Сообщить("Укажите пост!");
		Возврат;
	КонецЕсли;
		
	новстр = Дневник.Вставить(0);
	новстр.ИД = новый УникальныйИдентификатор;
	новстр.Период = ТекущаяДата();
	новстр.пост = ПостДневник;
	новстр.Задача =  Задача;
	
	Если Дневник.Количество()>1 Тогда
		ПредСтрока = Дневник[1];
		новстр.Шаг = ПредСтрока.Шаг;
		новстр.Состояние = ПредСтрока.Состояние;
	КонецЕсли;
	
	Элементы.Дневник.ТекущаяСтрока = новстр.ПолучитьИдентификатор();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДневникСервер()
	КонПер = КонецДня(ТекущаяДата());
	НачПер = ДобавитьМесяц(КонПер,-2);
	тз = ИА_Планы.ПолучитьДневникСервер(НачПер, КонПер, ПостДневник);
	ЗначениеВРеквизитФормы(тз ,"Дневник");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДневник()
	ОбновитьДневникСервер();
	обновитьНовыеСостояния();
КонецПроцедуры


&НаКлиенте
Процедура ПостДневникПриИзменении(Элемент)
	ОбновитьДневник();
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьСкрытьДневник(Команда)
	Элементы.ГруппаДневник.Видимость = не Элементы.ГруппаДневник.Видимость;
КонецПроцедуры


&НаКлиенте
Процедура НапомнитьВовремя(Команда)
	УстановитьНапоминание(0);
КонецПроцедуры


&НаКлиенте
Процедура НапомнитьЗа5Минут(Команда)
	УстановитьНапоминание(60*5);
КонецПроцедуры


&НаКлиенте
Процедура НапомнитьЗа15минут(Команда)
	УстановитьНапоминание(60*15);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНапоминание(СдвигВремени)
	Если Элементы.ПланировщикДень.ВыделенныеЭлементы.Количество() = 1 и ЗначениеЗаполнено(Элементы.ПланировщикДень.ВыделенныеЭлементы[0].Значение) Тогда
		зн = Элементы.ПланировщикДень.ВыделенныеЭлементы[0].Значение;		
		СоздатьНапоминание(зн, СдвигВремени);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьНапоминание(ОбъектН,СдвигВремени)	
	мен = РегистрыСведений.КСУ_Напоминания.СоздатьМенеджерЗаписи();
	мен.Тема = "Напоминание!";
	мен.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	мен.Объект = ОбъектН;
	
	Если ТипЗнч(ОбъектН) = тип("строка") Тогда // гугл
		менНап = РегистрыСведений.КСУ_СобытияКалендаряGoogle.СоздатьМенеджерЗаписи();
		менНап.идСобытия = ОбъектН;
		менНап.Прочитать();
		
		мен.Период = менНап.ДатаНачала - СдвигВремени;
		мен.Текст = менНап.Описание;
	Иначе
		мен.Период = ОбъектН.Владелец.ДатаНачала + ИА_Планы.ВремяВЧисло(ОбъектН.ВремяНачала) - СдвигВремени;
		мен.Текст = ОбъектН.содержание;
	КонецЕсли;

	мен.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ПланировщикНеделяПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
	СтандартнаяОбработка = ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	МассивВыбора = ПараметрыПеретаскивания.Значение;
	Если ТипЗнч(МассивВыбора) = Тип("Массив") или ТипЗнч(МассивВыбора) = Тип("ФиксированныйМассив") Тогда
		Выбор = МассивВыбора[0];
	Иначе
		Выбор = МассивВыбора;
	КонецЕсли;
	
	Если ТипЗнч(Выбор) = тип("Структура") Тогда
		ПеренестиЗадачуИзКЦВНедельный(Выбор.Задача, дата);
		
		ПодключитьОбработчикОжидания("ОбновитьКорзины",1,истина);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПеренестиЗадачуИзКЦВНедельный(ЗадачаКЦ, дата)
	НедПлан = ПолучитьНедельныйПланПоПроизвДате(Дата);
	Если НедПлан <> Неопределено Тогда
		обЗадача = ЗадачаКЦ.получитьобъект();
		обЗадача.Отложена = истина;
		обЗадача.записать();
		
		новЗадача = Справочники.ИА_ЗадачиПлана.СоздатьЭлемент();
		новЗадача.владелец = НедПлан;
		новЗадача.ЗадачаОснование = ЗадачаКЦ;
		новЗадача.Пост = ЗадачаКЦ.Пост;
		Если новЗадача.Пост.Пустая() ТОгда
			новЗадача.Пост = НедПлан.Пост;
		КонецЕсли;
		
		новЗадача.Группировка = Перечисления.ИА_ТипыЗадачБП.Задачи;
		новЗадача.Содержание = ЗадачаКЦ.Наименование;
		новЗадача.ВремяНачала = Дата;
		новЗадача.ВремяКонца = новЗадача.ВремяНачала+ 60*60;
		новЗадача.ВремяПлан = Дата(1,1,1,1,0,0);
		новЗадача.ВремяФакт = Дата(1,1,1,0,0,0);
		новЗадача.Записать();
		
		ОбновитьНедельныеПланы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикНеделяПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	МассивВыбора = ПараметрыПеретаскивания.Значение;
	Если ТипЗнч(МассивВыбора) = Тип("Массив") или ТипЗнч(МассивВыбора) = Тип("ФиксированныйМассив") Тогда
		Выбор = МассивВыбора[0];
	Иначе
		Выбор = МассивВыбора;
	КонецЕсли;
	
	Если ТипЗнч(Выбор) = тип("Структура") Тогда
		
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
		СтандартнаяОбработка = ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьНедельныйПланПоПроизвДате(Начало)
	Запрос = Новый Запрос;
	ИА_Планы.ЗаполнитьТаблицуПлановВЗапросе(Запрос,ДатаНачалаНедельныхПланов,ДатаКонцаНедельныхПланов);	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ПланыДействий.План
	               |ИЗ
	               |	НедельныеПланы КАК ИА_ПланыДействий ГДЕ ИА_ПланыДействий.ДатаНАчала <= &Дата и ИА_ПланыДействий.ДатаКонца >= &Дата";
	Запрос.УстановитьПараметр("Дата",Начало);
	Выборка = Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		возврат выборка.План;
	Иначе
		возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбновитьКорзины() Экспорт
	Элементы.ТаблицаВходящие.Обновить();
	Элементы.ТаблицаВРаботе.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРСВладельца(Команда)
	ОткрытьФорму("Обработка.КСУ_РабочийСтолВладельца.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	Если Элемент.ВыделенныеЭлементы.Количество() = 1 Тогда
		ТекЭлем = Элемент.ВыделенныеЭлементы[0];
		Если ЗначениеЗаполнено(ТекЭлем.Значение) и ТипЗнч(ТекЭлем.Значение) = тип("Строка") Тогда // гугл
			СтандартнаяОбработка = ложь;
			возврат;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикДеньНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = тип("Строка") Тогда // гугл
		Выполнение = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНовостиКСУНажатие(Элемент)
	ОткрытьФорму("ОбщаяФорма.КСУ_Новости", Новый структура("новость", новость));	
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьКЦ(Команда)
	Элементы.РазвернутьКЦ.Пометка = не Элементы.РазвернутьКЦ.Пометка;
	РазвКЦ = Элементы.РазвернутьКЦ.Пометка;
	Элементы.ГруппаМоиСтат.Видимость = не (РазвКЦ или Элементы.РазвернутьПланы.Пометка);
	Элементы.Предпросмотр.Видимость = РазвКЦ или не СкрытьЛенту;
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьСтатистики(Команда)
	Элементы.РазвернутьСтатистики.Пометка = не Элементы.РазвернутьСтатистики.Пометка;
	
	РазвернутьСтатистики_сервер();
	
КонецПроцедуры

&НаСервере
Процедура РазвернутьСтатистики_сервер()	
	Если Элементы.РазвернутьСтатистики.Пометка Тогда
		Элементы.Переместить(Элементы.ГруппаПланы, Элементы.ГруппаКЦ_Стат_Пл);
	Иначе
		Элементы.Переместить(Элементы.ГруппаПланы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьПланы(Команда)
	Если Элементы.РазвернутьСтатистики.Пометка Тогда
		Элементы.РазвернутьСтатистики.Пометка = ложь;
		РазвернутьСтатистики_сервер();
	КонецЕсли;
	
	Элементы.РазвернутьПланы.Пометка = не Элементы.РазвернутьПланы.Пометка;
	РазвПл = Элементы.РазвернутьПланы.Пометка;
	Элементы.ГруппаМоиСтат.Видимость = не (РазвПл или Элементы.РазвернутьКЦ.Пометка);
	Элементы.ГруппаКЦ_Стат.Высота = ?(РазвПл, 15, 0);
	Элементы.ГруппаКЦ_Стат.РастягиватьПоВертикали = ?(РазвПл, ложь, Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура ТолькоНевыполненные(Команда)
	Элементы.ТолькоНевыполненные.Пометка = не Элементы.ТолькоНевыполненные.Пометка;
	ОбновитьНедельныеПланы();
КонецПроцедуры


&НаКлиенте
Процедура ТекущийИ2СледующихПлана(Команда)
	РежимНедели = 2;
	ОбновитьПериодыПланов();
	ОбновитьНедельныеПланы();
КонецПроцедуры


&НаКлиенте
Процедура СоздатьЗаказНаПриобретение(Команда)
	ОткрытьФорму("Документ.ИА_ЗаказНаПриобретение.ФормаОбъекта");
КонецПроцедуры
	