
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
                                    Новый Структура("ДокументРезерва", ПараметрКоманды), 
                                    "Основной", 
                                    Истина);

	ОткрытьФорму("Отчет.ВедомостьПоТоварамВРезерве.Форма", 
				 ПараметрыФормы, 
				 ПараметрыВыполненияКоманды.Источник, 
				 Новый УникальныйИдентификатор,
				 ПараметрыВыполненияКоманды.Окно, 
				 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
