#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
	СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);	
	ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		
		ФинансыСервер.ПроверитьВозможностьВводаНаОснованииЗаявки(ДанныеЗаполнения, Ложь);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,
			"Договор, Контрагент, НазначениеПлатежа, Организация, Подразделение, 
			| Статья, СтатьяРасходов, СтатьяРасходовПоНачислению, Счет, СчетКонтрагента, 
			| ИдентификаторПлатежа, ПеречислениеВБюджет, СтатусСоставителя, КодБК, КодОКАТО, 
			| ПоказательОснования, ПоказательПериода, ПоказательНомера, ПоказательДаты, ПоказательТипа,
			| ТипПлатежногоДокумента, ОчередностьПлатежа,
			| СтавкаНДС, СуммаНДС, ПериодРегистрации"); //, ВидНачисления"); 
		ВидОперации = ДанныеЗаполнения.ВидОперацииСРС;
		Сумма = ДанныеЗаполнения.СуммаДокумента;
		Валюта = ДанныеЗаполнения.ВалютаДокумента;
		Основание = ДанныеЗаполнения;
		
		Если ДанныеЗаполнения.ЖелательнаяДатаПлатежа <> Дата(1,1,1) Тогда
			Дата = ДанныеЗаполнения.ЖелательнаяДатаПлатежа;
		КонецЕсли;
		Для каждого ЭлементТЗ из ДанныеЗаполнения.ЗарплатаСотрудникам Цикл
			НоваяСтрока = ЗарплатаСотрудникам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЗ);
		КонецЦикла;
		Для каждого ЭлементТЗ из ДанныеЗаполнения.РаспределениеПлатежа Цикл
			НоваяСтрока = РаспределениеПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЗ);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,
			"Валюта, ВидОперации, Договор, ИсхДата, ИсхНомер, Контрагент, НазначениеПлатежа, Организация, Подразделение, 
			| Статья, СтатьяРасходов, СтатьяРасходовПоНачислению, Сумма, Счет, СчетКонтрагента, 
			| ИдентификаторПлатежа, ПеречислениеВБюджет, СтатусСоставителя, КодБК, КодОКАТО, 
			| ПоказательОснования, ПоказательПериода, ПоказательНомера, ПоказательДаты, ПоказательТипа,
			| ТипПлатежногоДокумента, ОчередностьПлатежа,
			| СтавкаНДС, СуммаНДС, ПериодРегистрации"); //, ВидНачисления");

		Основание = ДанныеЗаполнения;
		
		Для каждого ЭлементТЗ из ДанныеЗаполнения.ЗарплатаСотрудникам Цикл
			НоваяСтрока = ЗарплатаСотрудникам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЗ);
		КонецЦикла;
		Для каждого ЭлементТЗ из ДанныеЗаполнения.РаспределениеПлатежа Цикл
			НоваяСтрока = РаспределениеПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЗ);
		КонецЦикла; 
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		// Заполнение шапки
		Основание = ДанныеЗаполнения.Ссылка;
		Валюта = ДанныеЗаполнения.Валюта;
		ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента; //ДанныеЗаполнения.Контрагент.ОсновнойДоговор; #11702
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение; // №12857
		Сумма = ДанныеЗаполнения.СуммаДокумента;
		Счет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
		
		ИсхДата = ТекущаяДатаСеанса();
		НазначениеПлатежа = "По " + Строка(Договор) + ". Сумма " + Формат(Сумма, "ЧДЦ=2; ЧРД=-; ЧГ=0" ) + ". Без налога (НДС)";
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
		Основание = ДанныеЗаполнения.Ссылка;
		Валюта = ДанныеЗаполнения.Валюта;
		ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента; //ДанныеЗаполнения.Контрагент.ОсновнойДоговор; #11702
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение; // №12857		
		
		Сумма = Документы.ЗаказПоставщику.СуммаКОплате(ДанныеЗаполнения); //ДанныеЗаполнения.СуммаДокумента; //#14377
		Счет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
		
		ИсхДата = ТекущаяДатаСеанса();
		НазначениеПлатежа = "По " + Строка(Договор) + ". Сумма " + Формат(Сумма, "ЧДЦ=2; ЧРД=-; ЧГ=0" ) + ". Без налога (НДС)";

		//заполнение распределения
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения.Ссылка;
		НоваяСтрока.Сумма = Сумма;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда	
		Если ТипЗнч(ДанныеЗаполнения.Ссылка) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам;
			Основание = ДокументОснование.Ссылка;
			Организация = ДокументОснование.Организация;
			ОчередностьПлатежа = 3;
			ПериодРегистрации = ДокументОснование.ПериодРегистрации;
			
			ВременнаяТаблица = Новый ТаблицаЗначений;
			ВременнаяТаблица.Колонки.Добавить("Сотрудник");	
			//ВременнаяТаблица.Колонки.Добавить("ВидНачисления");
			ВременнаяТаблица.Колонки.Добавить("Сумма");			
			
			Для Каждого ТекущаяСтрока Из ДокументОснование.Начисление Цикл
				НоваяСтрока = ВременнаяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			КонецЦикла;
			//#6576 
			//ВременнаяТаблица.Свернуть("Сотрудник, ВидНачисления", "Сумма");
			ВременнаяТаблица.Свернуть("Сотрудник", "Сумма");
	
			Для Каждого ТекСотрудник из ВременнаяТаблица Цикл
				НоваяСтрока = ЗарплатаСотрудникам.Добавить();
				НоваяСтрока.Сотрудник = ТекСотрудник.Сотрудник;
				//НоваяСтрока.ВидНачисления = ТекСотрудник.ВидНачисления; //#6576 закомментировано
				НоваяСтрока.Сумма = ТекСотрудник.Сумма;
				НоваяСтрока.СчетСотрудника = ФинансыСервер.ПолучитьСчетСотрудника(НоваяСтрока.Сотрудник);
			КонецЦикла;		
		КонецЕсли;	
	КонецЕсли;
	
	ФинансыСервер.ДокументРасходаОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
	СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, ВидОперации, Ложь);
	СтатьяРасходовПоНачислению = СтатьяРасходов; //#9708
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПолеПериодРегистрацииОбязательно = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();	
	Если Не ЗначениеЗаполнено(ПериодРегистрации) И ПолеПериодРегистрацииОбязательно 
		И (ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         	НСтр("ru = 'Не указан Период регистрации!'"), ,
        	"ОтображениеПериодаРегистрации",,Отказ);	
	КонецЕсли;
	
	ПолеСтатьяДДСОбязательно = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();	
	Если НЕ ЗначениеЗаполнено(Статья) И ПолеСтатьяДДСОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         	НСтр("ru = 'Не заполнена статья движения денежных средств!'"), ЭтотОбъект,
        	"Статья",,Отказ);
	КонецЕсли;
		
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю // №12420
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПеречислениеНалоговИВзносов
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику
		//ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам   #13333 закомментировано
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику
	Тогда
		   	ПроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;	
		
	//++ №12420
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику
		Или ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю
		Или ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПеречислениеНалоговИВзносов
	Тогда
		ПроверяемыеРеквизиты.Добавить("Договор");
	КонецЕсли;
	//-- №12420
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПеречислениеВБюджет Тогда
		СтатусСоставителя = "";
		КодБК = "";
		КодОКАТО = "";
		ПоказательОснования = "";
		ПоказательПериода = "";
		ПоказательНомера = "";
		ПоказательДаты = "";
		ПоказательТипа = "";
	КонецЕсли;
		
	ФинансыСервер.ПроверитьЗаполнениеНаОснованииЗаявкиНаРасходование(ЭтотОбъект, Отказ, РежимЗаписи);

	ФинансыСервер.ДокументРасходаПередЗаписью(ЭтотОбъект, Ложь, ВидОперации, Отказ, РежимЗаписи, РежимПроведения);
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ Счет.Владелец = Организация Тогда
		Сообщить("Счет " + Счет + " не принадлежит организации "+Организация+". Проведение отменено.");
		Отказ = Истина;
	КонецЕсли;
	
	ИспользуетсяПериодРегистрации = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();
	
	ФинансыСервер.КонтрольОстатковДС(ЭтотОбъект, Ложь, Отказ);
		
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику Тогда
		// регистр ВзаиморасчетыСКонтрагентами Приход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		//Движение.Документ = Ссылка;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		
		//Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения =ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Валюта = Валюта;
		Движение.Сумма = Сумма;
		
		// 2017-08-22 регистр РасчетыСКонтрагентами Приход
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ РаспределениеПлатежа.Количество() > 0 Тогда
			Движения.РасчетыСКонтрагентами.Записывать = Истина;
			
			Если РаспределениеПлатежа.Количество() > 0 Тогда
				Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
					Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
						Движение = Движения.РасчетыСКонтрагентами.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
						Движение.Период 	 = Дата;
						Движение.Заказ 		 = ТекущаяСтрока.Документ;
						Движение.Контрагент  = Контрагент;
						Движение.Организация = Организация;
						Движение.Сумма 		 = ТекущаяСтрока.Сумма;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Движение = Движения.РасчетыСКонтрагентами.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период 	 = Дата;
				Движение.Заказ 		 = Основание;
				Движение.Контрагент  = Контрагент;
				Движение.Организация = Организация;
				Движение.Сумма 		 = Сумма;
			КонецЕсли;
		КонецЕсли;	
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю Тогда		
		// регистр ВзаиморасчетыСКонтрагентами Приход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		//Движение.Документ = Ссылка;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		
		//Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения =ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Валюта = Валюта;
		Движение.Сумма = Сумма;		
		
		// регистр РасчетыПоЗаказам
		Движения.РасчетыПоЗаказам.Записывать = Истина;
		Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
			Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказДоговор")
				ИЛИ ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.Монтаж") 
				ИЛИ ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказПокупателя") 
				ИЛИ ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") 
				ИЛИ ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.СчетНаОплату") Тогда
				Движение = Движения.РасчетыПоЗаказам.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Заказ = ТекущаяСтрока.Документ;
				Движение.Сумма = -РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(ТекущаяСтрока.Документ, ТекущаяСтрока.Сумма);
				Движение.Контрагент = Контрагент; // №6496 добавлен контрагент в измерение
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам Тогда
		// регистр РасчетыСПерсоналом Расход
		Движения.РасчетыСПерсоналом.Записывать = Истина;
		Для Каждого ТекСтрокаНачисление Из ЗарплатаСотрудникам Цикл
			Движение = Движения.РасчетыСПерсоналом.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата; 
			Движение.ПериодРегистрации = ?(ИспользуетсяПериодРегистрации, ПериодРегистрации, Дата(1,1,1));
			Движение.Организация = Организация;
			Движение.Сотрудник = ТекСтрокаНачисление.Сотрудник;
			//Движение.ВидНачисления = ТекСтрокаНачисление.ВидНачисления; //#6576 закомментировано
			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекСтрокаНачисление.Сумма);
		КонецЦикла;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику Тогда
		// регистр РасчетыСПерсоналом Расход
		Движения.РасчетыСПерсоналом.Записывать = Истина;
		Движение = Движения.РасчетыСПерсоналом.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата; 
		Движение.ПериодРегистрации = ?(ИспользуетсяПериодРегистрации, ПериодРегистрации, Дата(1,1,1));
		Движение.Организация = Организация;
		Движение.Сотрудник = Контрагент;
		//Движение.ВидНачисления = ВидНачисления;  //#6576 закомментировано
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику Тогда
		// регистр РасчетыСПодотчетникамиПоДокументамАвансов Приход
		Движения.РасчетыСПодотчетникамиПоДокументамАвансов.Записывать = Истина;
		Движение = Движения.РасчетыСПодотчетникамиПоДокументамАвансов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сотрудник = Контрагент;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		Движение.ДокументВыдачиДС = Ссылка;
		
		// регистр РасчетыСПодрядчиками Приход
		Движения.РасчетыСПодотчетниками.Записывать = Истина;
		Движение = Движения.РасчетыСПодотчетниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сотрудник = Контрагент;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);		
		
	#Область ВозвратКредита_ИЛИ_ВыдачаЗайма
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаЗайма Тогда

        // регистр КредитыИЗаймы Приход
		Движения.КредитыИЗаймы.Записывать = Истина;		
		Движение = Движения.КредитыИЗаймы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент  = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);		
				
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратКредита Тогда

        // регистр КредитыИЗаймы Приход
		Движения.КредитыИЗаймы.Записывать = Истина;		
		Движение = Движения.КредитыИЗаймы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент  = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаОсновногоТелаЗайма);		
			
	#КонецОбласти

	КонецЕсли;

	// регистр ДенежныеСредства Расход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.СчетКасса = Счет;
	Движение.Валюта = Валюта;
	Движение.Сумма = Сумма;
	
	// регистр ДвиженияДенежныеСредства Расход
	Если ЗначениеЗаполнено(Статья) И ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоСтатьямДДС") Тогда
		Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СчетКасса = Счет;
		Движение.СуммаРасход = Сумма;
		Движение.Статья = Статья;
		Движение.Валюта = Валюта;
	КонецЕсли;

	// регистр ДенежныеСредстваКВыплате Расход
	Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		Движения.ДенежныеСредстваКВыплате.Записывать = Истина;
		Движение = Движения.ДенежныеСредстваКВыплате.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Заявка = Основание;
		Движение.Сумма = Сумма;
	КонецЕсли;
	
	// регистр ВзаиморасчетыСКонтрагентамиПоЗаказам Приход
	Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
		Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Движение = Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Заказ = ТекущаяСтрока.Документ;
			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
		КонецЕсли;					
	КонецЦикла;

	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов И НЕ (ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратКредита ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаЗайма) Тогда
		Если ВидОперации <> Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ИнкассацияИзБанка
			И НЕ СтатьяРасходов.Пустая() И ПараметрыСеанса.ФинРезультатКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//кассовый метод
			Движения.ДоходыРасходы.Записывать = Истина;
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяРасходов;
			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
			Движение.СуммаДоходов 	= 0;
			Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		КонецЕсли;
		//#9708
		Если ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПрочееСписание 
			И НЕ СтатьяРасходовПоНачислению.Пустая() И ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод
			Движения.ДоходыРасходы.Записывать = Истина;
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяРасходовПоНачислению;
			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движение.СуммаДоходов 	= 0;
			Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов И ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратКредита И СуммаПроцентовПоЗайму > 0 Тогда
		Движения.ДоходыРасходы.Записывать = Истина;
		Движение = Движения.ДоходыРасходы.Добавить();
		Движение.Период 		= Дата;
		Движение.Организация 	= Организация;
		Движение.Подразделение 	= Подразделение;
		Движение.Статья 		= СтатьяРасходов;
		Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
		Движение.СуммаДоходов 	= 0;
		Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаПроцентовПоЗайму);
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	СлужебныйКонтролироватьЗаполнениеЗаявки = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств");
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	Если ЗначениеЗаполнено(Организация)
		И Не ЗначениеЗаполнено(СтавкаНДС)
		И ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю Тогда
		УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
		СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
	
		ФинансыКлиентСервер.ПересчитатьСуммуНДС(ЭтотОбъект, УчитыватьНДС);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли