#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СтандартныеПодсистемыПечать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Договор
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ПредварительныйРасчетЗаказДоговора";
    КомандаПечати.Идентификатор = "КоммерческоеПредложение";
    КомандаПечати.Представление = НСтр("ru = 'Коммерческое предложение'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 1;
	КомандаПечати.ЗаголовокФормы = "Коммерческое предложение";
	КомандаПечати.ДополнительныеПараметры.Вставить("ИмяВложенияИзЗаголовкаФормы", Истина);
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КоммерческоеПредложение") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "КоммерческоеПредложение",
        НСтр("ru = 'Коммерческое предложение'"),
        ПечатьКоммерческоеПредложение(МассивОбъектов, ОбъектыПечати),
        ,
        "Документ.ПредварительныйРасчетЗаказДоговора.ПФ_MXL_КоммерческоеПредложение");
    КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00.00.0000"" КАК Дата,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	ДанныеДокумента.Автор КАК Менеджер,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.ВидЦен КАК ВидЦен,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.ВидСкидки КАК ВидСкидки,
	|	ДанныеДокумента.СуммаДокументаПоПрайсу КАК СуммаДокументаПоПрайсу,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	0 КАК СуммаСкидки,
	|	0 КАК СуммаБезСкидки,
	|	0 КАК СуммаТоваров,
	|	0 КАК СуммаУслуг,
	|	0 КАК СуммаНДС,
	|	0 КАК ПлощадьПотолков,
	|	0 КАК КоличествоКомнат,
	|	0 КАК КолвоПозиций,
	|	0 КАК ИтогоСуммаНДС,
	|	Лид.Автор КАК АвторЛида,
	|	Лид.Номер КАК НомерЛида,
	|	Лид.Дата КАК ДатаЛида,
	|	Лид.Комментарий КАК КомментарийЛида,
	|	Лид.Адрес КАК Адрес,
	|	Лид.ВидКонтакта КАК ВидКонтакта,
	|	Лид.ВидНецелевогоЛида КАК ВидНецелевогоЛида,
	|	Лид.ДатаСоздания КАК ДатаСоздания,
	|	Лид.ИмяКлиента КАК ИмяКлиента,
	|	Лид.Телефоны КАК Телефоны,
	|	Лид.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты,
	|	Лид.ПоследнееВремяНачалаЗамера КАК ПоследнееВремяНачалаЗамера,
	|	Лид.ПоследнееВремяОкончанияЗамера КАК ПоследнееВремяОкончанияЗамера,
	|	Лид.ПоследнееЗамерВыполнен КАК ПоследнееЗамерВыполнен,
	|	Лид.ПоследнийИсполнительЗамера КАК ПоследнийИсполнительЗамера,
	|	Лид.ПоследнийКомментарий КАК ПоследнийКомментарий,
	|	Лид.ПоследнийКомментарийКЗамеру КАК ПоследнийКомментарийКЗамеру,
	|	Лид.ПоследнийРезультатЗамера КАК ПоследнийРезультатЗамера,
	|	Лид.ПоследняяДатаЗамера КАК ПоследняяДатаЗамера,
	|	Лид.ПоследняяДатаПерезвонить КАК ПоследняяДатаПерезвонить,
	|	Лид.ПоследняяСуммаДоговораНаЗамере КАК ПоследняяСуммаДоговораНаЗамере,
	|	Лид.ПредполагаемыйМонтажВремя КАК ПредполагаемыйМонтажВремя,
	|	Лид.ПредполагаемыйМонтажДата КАК ПредполагаемыйМонтажДата,
	|	Лид.ПредполагаемыйМонтажДатаМонтажаНеОпределена КАК ПредполагаемыйМонтажДатаМонтажаНеОпределена,
	|	Лид.ПричинаОтказа КАК ПричинаОтказа,
	|	Лид.ПричинаПерезвонить КАК ПричинаПерезвонить,
	|	Лид.РекламнаяАкция КАК РекламнаяАкция,
	|	Лид.РекламныйИсточник КАК РекламныйИсточник,
	|	Лид.ТекущийСтатус КАК ТекущийСтатус,
	|	Лид.ТочкаПродаж КАК ТочкаПродаж,
	|	Лид.ЭлектроннаяПочтаАдрес КАК ЭлектроннаяПочтаАдрес
	|ИЗ
	|	Документ.ПредварительныйРасчетЗаказДоговора КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид КАК Лид
	|		ПО ДанныеДокумента.Основание = Лид.Ссылка
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Комната КАК Комната,
	|	ДанныеДокумента.Комната КАК КоличествоКомнат,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.НомерПотолка КАК НомерПотолка,
	|	ДанныеДокумента.ПроцентСкидки КАК ПроцентСкидки,
	|	ДанныеДокумента.Спецификация КАК Спецификация,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаПоПрайсу КАК СуммаПоПрайсу,
	|	ДанныеДокумента.СуммаСкидки КАК СуммаСкидки,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|	ДанныеДокумента.ЦветФактуры КАК ЦветФактуры,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.ЦенаПоПрайсу КАК ЦенаПоПрайсу,
	|	ДанныеДокумента.ЗагруженоИзПостроителя КАК ЗагруженоИзПостроителя,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЭтоПотолок,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
    |			ТОГДА ДанныеДокумента.Количество
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК ПлощадьПотолков,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал)
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЭтоТовар,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал)
    |			ТОГДА ДанныеДокумента.Сумма
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК СуммаТоваров,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЭтоУслуга,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
    |			ТОГДА ДанныеДокумента.Сумма
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК СуммаУслуг
	|ИЗ
	|	Документ.ПредварительныйРасчетЗаказДоговора.ТоварыУслуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Комната,
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ
	//|	КОЛИЧЕСТВО(НомерСтроки),
	|	МАКСИМУМ(НомерСтроки),
	|	СУММА(Сумма),
	|	СУММА(СуммаСкидки),
	|	СУММА(СуммаТоваров),
	|	СУММА(СуммаУслуг),
	|	СУММА(ПлощадьПотолков),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоКомнат)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Комната КАК Комната,
	|	ДанныеДокумента.Комната КАК КоличествоКомнат,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.НомерПотолка КАК НомерПотолка,
	|	ДанныеДокумента.ПроцентСкидки КАК ПроцентСкидки,
	|	ДанныеДокумента.Спецификация КАК Спецификация,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаПоПрайсу КАК СуммаПоПрайсу,
	|	ДанныеДокумента.СуммаСкидки КАК СуммаСкидки,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|	ДанныеДокумента.ЦветФактуры КАК ЦветФактуры,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.ЦенаПоПрайсу КАК ЦенаПоПрайсу,
	|	ДанныеДокумента.ЗагруженоИзПостроителя КАК ЗагруженоИзПостроителя,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЭтоПотолок,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.УчитыватьКакПотолокВОтчетахПоЭффективности
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
    |				ИЛИ ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ТиповойОтрез)
    |			ТОГДА ДанныеДокумента.Количество
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК ПлощадьПотолков,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал)
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЭтоТовар,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал)
    |			ТОГДА ДанныеДокумента.Сумма
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК СуммаТоваров,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЭтоУслуга,
	|	ВЫБОР
    |		КОГДА ДанныеДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
    |			ТОГДА ДанныеДокумента.Сумма
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК СуммаУслуг
	|ИЗ
	|	Документ.ПредварительныйРасчетЗаказДоговора.ТоварыУслуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Комната,
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ
	//|	КОЛИЧЕСТВО(НомерСтроки),
	|	МАКСИМУМ(НомерСтроки),
	|	СУММА(Сумма),
	|	СУММА(СуммаСкидки),
	|	СУММА(СуммаТоваров),
	|	СУММА(СуммаУслуг),
	|	СУММА(ПлощадьПотолков),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоКомнат)
	|ПО
	|	Ссылка,
	|	Комната
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.Комната КАК Комната
	|ИЗ
	|	Документ.ПредварительныйРасчетЗаказДоговора.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиТовары  = МассивРезультатов[1];
	РезультатПоТабличнойЧастиТоварыПоКомнатам = МассивРезультатов[2];
	РезультатПоТабличнойЧастиМатериалы        = МассивРезультатов[3];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары, РезультатПоТабличнойЧастиТоварыПоКомнатам, РезультатПоТабличнойЧастиМатериалы",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиТовары, РезультатПоТабличнойЧастиТоварыПоКомнатам, РезультатПоТабличнойЧастиМатериалы);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам = Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	РезультатЗапроса.Колонки.Добавить("ЗамерщикКонтактныйТелефон");
	РезультатЗапроса.Колонки.Добавить("ЗамерщикЛичныйТелефон");
	
	РезультатЗапроса.Колонки.Добавить("НомерДокумента", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(11)));
	РезультатЗапроса.Колонки.Добавить("СуммаСтрокой", Новый ОписаниеТипов("строка"));
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента,"ДЛФ=Д");
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
		ТекущаяСтрока.НомерДокумента = ТекущаяСтрока.Номер;
		Попытка
			ТекущаяСтрока.СуммаСтрокой = РаботаСВалютой.СформироватьЧислоПрописью(ТекущаяСтрока.СуммаДокумента, ТекущаяСтрока.Валюта);
		Исключение
		КонецПопытки;
		
		Если НЕ ВыборкаПоТоварам = Неопределено Тогда
			СтруктураПоиска = Новый Структура("Ссылка", ТекущаяСтрока.Ссылка);
			ВыборкаПоТоварам.Сбросить();
			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда
				ТекущаяСтрока.СуммаСкидки = ВыборкаПоТоварам.СуммаСкидки;
				ТекущаяСтрока.СуммаБезСкидки = ВыборкаПоТоварам.Сумма + ВыборкаПоТоварам.СуммаСкидки;
				ТекущаяСтрока.СуммаТоваров = ВыборкаПоТоварам.СуммаТоваров;
				ТекущаяСтрока.СуммаУслуг = ВыборкаПоТоварам.СуммаУслуг;
				ТекущаяСтрока.ПлощадьПотолков = ВыборкаПоТоварам.ПлощадьПотолков;
				ТекущаяСтрока.СуммаНДС = ВыборкаПоТоварам.СуммаНДС;
				//ТекущаяСтрока.ИтогоСуммаБезНДС = ВыборкаПоТоварам.Сумма - ВыборкаПоТоварам.СуммаНДС;
				ТекущаяСтрока.КоличествоКомнат = ВыборкаПоТоварам.КоличествоКомнат;	
				ТекущаяСтрока.КолвоПозиций = ВыборкаПоТоварам.НомерСтроки;
				
				ТекущаяСтрока.ИтогоСуммаНДС = ВыборкаПоТоварам.СуммаНДС;
			КонецЕсли;						
		КонецЕсли;
				
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация);
		Если ЗначениеЗаполнено(ТекущаяСтрока.ПоследнийИсполнительЗамера) Тогда
			ТекущаяСтрока.ЗамерщикКонтактныйТелефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущаяСтрока.ПоследнийИсполнительЗамера, Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника);
			ТекущаяСтрока.ЗамерщикЛичныйТелефон     = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущаяСтрока.ПоследнийИсполнительЗамера, Справочники.ВидыКонтактнойИнформации.ЛичныйТелефонСотрудника);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Функция ПечатьКоммерческоеПредложение(МассивОбъектов, ОбъектыПечати) Экспорт
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_КоммерческоеПредложение";
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоТоварамПоКомнатамГруппировка = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТоварыПоКомнатам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоМатериалам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиМатериалы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
	
    ПервыйДокумент = Истина;
    Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСкидка = (ДанныеПечати.СуммаСкидки > 0);
		ВставкаСкидок = ?(ЕстьСкидка, "Скидка","");
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПредварительныйРасчетЗаказДоговора.ПФ_MXL_КоммерческоеПредложение");
		
		//шапка макета
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		// Изменения размера колоноки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		//// Изменения размера колонки, в зависимости от вывода Артикула, Скидки
		//ШиринаУвеличенияКолонкиТовар = 0;
		//Попытка
		//	Если НЕ ЕстьСкидка Тогда
		//		ШиринаУвеличенияКолонкиТовар = ШиринаУвеличенияКолонкиТовар + (Макет.Область("Скидка").ШиринаКолонки * 2); // умножаем на две колонки
		//	КонецЕсли;		
		//	Если Не ВыводитьАртикул Тогда
		//		ШиринаУвеличенияКолонкиТовар = ШиринаУвеличенияКолонкиТовар + Макет.Область("Артикул").ШиринаКолонки;
		//	КонецЕсли;
		//Исключение
		//КонецПопытки;
		//
		//Если Не ШиринаУвеличенияКолонкиТовар = 0 Тогда
		//	Попытка
		//		Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + ШиринаУвеличенияКолонкиТовар;
		//	Исключение
		//	КонецПопытки;
		//КонецЕсли;
				
		//шапка таблицы
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			//Если ЕстьСкидка Тогда
			//	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
			//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			//	ТабличныйДокумент.Присоединить(ОбластьМакета);
			//КонецЕсли;	
			//
			//ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
			//ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			//ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//Комнаты
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварамПоКомнатамГруппировка.Сбросить();
		Если ВыборкаПоТоварамПоКомнатамГруппировка.НайтиСледующий(СтруктураПоиска) Тогда			
			ВыборкаПоКомнатам = ВыборкаПоТоварамПоКомнатамГруппировка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);			
			Пока ВыборкаПоКомнатам.Следующий() Цикл
				Попытка
					
					НомерСтроки = 1;
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКомната"+ВставкаСкидок+"|НомерСтроки");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(ВыборкаПоКомнатам);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКомната"+ВставкаСкидок+"|Артикул");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(ВыборкаПоКомнатам);
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКомната"+ВставкаСкидок+"|Данные");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(ВыборкаПоКомнатам);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					
					//Если ЕстьСкидка Тогда
					//	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКомната|Скидка");
					//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					//	ОбластьМакета.Параметры.Заполнить(ВыборкаПоКомнатам);
					//	ТабличныйДокумент.Присоединить(ОбластьМакета);
					//КонецЕсли;	
					//
					//ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКомната|Сумма");
					//ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					//ОбластьМакета.Параметры.Заполнить(ВыборкаПоКомнатам);
					//ТабличныйДокумент.Присоединить(ОбластьМакета);
					
					ВыборкаПоТоварам = ВыборкаПоКомнатам.Выбрать();
					Пока ВыборкаПоТоварам.Следующий() Цикл
						//товары в комнате
						Попытка
							
								ОбластьМакета = Макет.ПолучитьОбласть("СтрокаНоменклатура"+ВставкаСкидок+"|НомерСтроки");
								ОбластьМакета.Параметры.Заполнить(ДанныеПечати); 
								ОбластьМакета.Параметры.Заполнить(ВыборкаПоТоварам);
								ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
								ТабличныйДокумент.Вывести(ОбластьМакета);
								
								Если ВыводитьАртикул Тогда
									ОбластьМакета = Макет.ПолучитьОбласть("СтрокаНоменклатура"+ВставкаСкидок+"|Артикул");
									ОбластьМакета.Параметры.Заполнить(ДанныеПечати); 
									ОбластьМакета.Параметры.Заполнить(ВыборкаПоТоварам);
									ТабличныйДокумент.Присоединить(ОбластьМакета);
								КонецЕсли;
								
								ОбластьМакета = Макет.ПолучитьОбласть("СтрокаНоменклатура"+ВставкаСкидок+"|Данные");
								ОбластьМакета.Параметры.Заполнить(ДанныеПечати); 
								ОбластьМакета.Параметры.Заполнить(ВыборкаПоТоварам);
								
								//++ №12909
								//ПредставлениеНоменклатуры = Строка(ВыборкаПоТоварам.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(ВыборкаПоТоварам.ХарактеристикаНоменклатуры));
								ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(ВыборкаПоТоварам.Номенклатура, ВыборкаПоТоварам.ХарактеристикаНоменклатуры);
								//-- №12909
								
								ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
								ТабличныйДокумент.Присоединить(ОбластьМакета);
								
								//Если ЕстьСкидка Тогда
								//	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаНоменклатура|Скидка");
								//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати); 
								//	ОбластьМакета.Параметры.Заполнить(ВыборкаПоТоварам);
								//	ТабличныйДокумент.Присоединить(ОбластьМакета);
								//КонецЕсли;
								//
								//ОбластьМакета = Макет.ПолучитьОбласть("СтрокаНоменклатура|Сумма");
								//ОбластьМакета.Параметры.Заполнить(ДанныеПечати); 
								//ОбластьМакета.Параметры.Заполнить(ВыборкаПоТоварам);
								//ТабличныйДокумент.Присоединить(ОбластьМакета);
								
								НомерСтроки = НомерСтроки + 1;								
							
						Исключение
						КонецПопытки;
					КонецЦикла;
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		//подвал
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Если ЕстьСкидка Тогда
				Попытка
					ОбластьМакета.Параметры.ШаблонСуммаСкидки = "Скидка: " + Формат(ДанныеПечати.СуммаСкидки, "ЧДЦ=2") + " " + Строка(ДанныеПечати.Валюта);				
					ОбластьМакета.Параметры.ШаблонСуммаБезСкидки = "Сумма без скидки: " + Формат(ДанныеПечати.СуммаБезСкидки, "ЧДЦ=2") + " " + Строка(ДанныеПечати.Валюта);				
				Исключение
				КонецПопытки;
			КонецЕсли;	
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
    КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция ПолучитьМассивРеквизитовПоЦенам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ДеревоТоваровЦена");
	МассивИменЭлементов.Добавить("ДеревоТоваровСумма");
	
	Возврат МассивИменЭлементов;
	
КонецФункции
	
Функция ПолучитьМассивРеквизитовПоСкидкам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ДеревоТоваровПроцентСкидки");
	МассивИменЭлементов.Добавить("ДеревоТоваровСуммаСкидки");
	
	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуНаПотолок");
	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуНаУслуги");
	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуТовары");
	
	МассивИменЭлементов.Добавить("ИзменитьСуммуДокумента");
	МассивИменЭлементов.Добавить("ВидСкидки");
	
	Возврат МассивИменЭлементов;
	
КонецФункции

#КонецОбласти

#КонецЕсли

