#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Лид") Тогда		
		Основание = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;		
	КонецЕсли;
		
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// #13826 
	Для Индекс = 0 по Материалы.Количество()-1 Цикл
		СтрокаТабличнойЧасти = Материалы[Индекс];
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаТабличнойЧасти.Номенклатура) Тогда
			ТекстОшибки = "В строке " + Строка(Индекс+1) + " таблицы ""Материалы"" выбрана номенклатура-услуга";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Материалы["+Формат(Индекс, "ЧГ=0")+"].Номенклатура", , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	//добавим первую комнату, если товаров нет
	Если НЕ Константы.ИспользоватьСправочникКомнатВРознице.Получить() И ТоварыУслуги.Количество() = 0 Тогда
		НоваяСтрока = ТоварыУслуги.Добавить();
		НоваяСтрока.Комната = "Комната 1";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли