&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("КОплате") Тогда
		КОплате = Параметры.КОплате;	
	КонецЕсли;
	Если КОплате  > 0 Тогда
		ТекущийЭлемент = Элементы.Внесено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	Закрыть(КОплате);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
		
	Если Внесено >= КОплате Тогда
		Сдача = Внесено - КОплате;

		ЦветСдачи   = Новый Цвет(45, 115, 44);
		ЦветВнесено = Новый Цвет();
	Иначе
		Сдача = 0;
		
		ЦветСдачи   = Новый Цвет();
		
		Если Внесено = 0 Тогда
			ЦветВнесено =  Новый Цвет();
		Иначе
			ЦветВнесено =  Новый Цвет(190, 32, 80);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Сдача.ЦветТекстаЗаголовка = ЦветСдачи;
	Элементы.Сдача.ЦветТекста          = ЦветСдачи;
	
	Элементы.Внесено.ЦветТекстаЗаголовка = ЦветВнесено;
	Элементы.Внесено.ЦветТекста          = ЦветВнесено;
	
КонецПроцедуры

&НаКлиенте
Процедура КОплатеПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ВнесеноПриИзменении(Элемент)
	ОбновитьФорму();	
КонецПроцедуры

//&НаКлиенте
//Процедура ВнесеноИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	Если Число(Текст) <> Внесено Тогда
//		ПодключитьОбработчикОжидания("ПослеИзмененияТекстаВнесено", 0.3, Истина);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПослеИзмененияТекстаВнесено()
//	
//	Текст = Элементы.Внесено.ТекстРедактирования;
//	//Внесено = Число(Текст);
//	ОбновитьФорму();
//	
//КонецПроцедуры


