#Область ПеременныеФормы

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	УстановитьУсловноеОформление(); 
	
	//nva+++
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ДополнительныеПраваЗапретРедактированияЦенВДокументах");
	
	ЗапретИзмененияЦен = РеквизитыПользователя.ДополнительныеПраваЗапретРедактированияЦенВДокументах;
	
	//управление доступностью элементов
	Если ЗапретИзмененияЦен Тогда
		МассивИменЭлементов = Документы.ПоступлениеТоваровИУслуг.ПолучитьМассивРеквизитовПоЦенам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
	
	ИспользоватьКонтрольКратности = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольКратностиЕдиницИзмерения");
	//nva---
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	ВалютаУчета = ПолучитьФункциональнуюОпцию("ВалютаУчета");
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	
	//Если ПараметрыСеанса.ТекущийПользователь.ДополнительныеПраваЗапретРедактированияДокументовПоступления Тогда
	//	ЭтаФорма.ТолькоПросмотр = Истина;
	//КонецЕсли;
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
	ЭтоДокументОбеспеченияРозницы = ЗначениеЗаполнено(Объект.Основание) 
	И (ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") ИЛИ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Монтаж"));	
	Элементы.ТоварыГруппаРозница.Видимость = ЭтоДокументОбеспеченияРозницы;
	Если ЭтоДокументОбеспеченияРозницы Тогда
		СписокКомнатОснования.ЗагрузитьЗначения(Документы.ЗаказДоговор.ПолучитьМассивКомнатДоговора(Объект.Основание));
	КонецЕсли;
	//#14675
	Элементы.ТоварыКомната.Видимость = Объект.СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам;
	
	ФинансыСервер.УстановитьОтметкуНезаполненныхСтатейДоходовРасходов(Элементы);
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ТоварыСтатьяРасходов");
	МассивЭлементов.Добавить("УслугиСтатьяРасходов");
	ФинансыСервер.УстановитьВидимостьКолонокСтатейДиРВТабличнойЧасти(ЭтаФорма, МассивЭлементов, Истина);
	
	ИспользоватьПодключаемоеОборудование = Константы.ИспользоватьПодключаемоеОборудование.Получить();
	
	ОбщийМодульСервер.ДобавитьИндикаторРаботыСоСканерамиШК(ЭтотОбъект);
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("ТоварыНоменклатураАртикул");
	МассивЭлементов.Добавить("УслугиНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
	//#10822
	Элементы.ПоступлениеОтПроизводстваУИБ.Видимость = Объект.ПоступлениеОтПроизводстваУИБ ИЛИ Константы.СоздаватьДокументыПоступленийПоУдаленнойБазе.Получить();
	
	//#7805
	//УправлениеРеквизитомАдресаМонтажа();  // закомментироано в рамках заявки #10837 
	
	//#9470
	ОтображатьПредыдущуюЦенуПоступления = Константы.ОтображатьПредыдущуюЦенуПоступленияВДокументахЗакупки.Получить();
	Элементы.ТоварыЦенаПредыдущегоПоступления.Видимость = ОтображатьПредыдущуюЦенуПоступления;
	Элементы.УслугиЦенаПредыдущегоПоступления.Видимость = ОтображатьПредыдущуюЦенуПоступления;
	ЗаполнитьЦеныПредыдущегоПоступления();
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	Если НЕ Константы.РазрешитьПоступлениеПоНулевойЦене.Получить() Тогда
		Элементы.ТоварыЦена.АвтоОтметкаНезаполненного = Истина;
		Элементы.УслугиЦена.АвтоОтметкаНезаполненного = Истина;
		Элементы.ТоварыСумма.АвтоОтметкаНезаполненного = Истина;
		Элементы.УслугиСумма.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
	// №14786
	КонтролироватьПрайсЛистыПриПоступленииТоваров = ПолучитьФункциональнуюОпцию("КонтролироватьПрайсЛистыПриПоступленииТоваров");
	
	УчитыватьНДС = Истина;
	СтавкаНДСПоУмолчанию = Перечисления.СтавкиНДС.БезНДС;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
		
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//++ 16321
	Если Объект.Товары.Количество() > 0 И НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщить("Поле Склад не заполнено.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//-- 16321
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = НЕ ПраваПользователей.РазрешеноПриходоватьНаСклад(Объект.Склад);
		Если Отказ Тогда
			Сообщить("У текущего пользователя нет прав для оформления прихода на склад """ + Объект.Склад + """");
			Возврат;
		КонецЕсли;
		
		// #13896 проверку на 0 цену делать из формы документа
		Если НЕ Константы.РазрешитьПоступлениеПоНулевойЦене.Получить() Тогда
			МассивТЧДляПроверки = Новый Массив;
			МассивТЧДляПроверки.Добавить("Товары");
			МассивТЧДляПроверки.Добавить("Услуги");
			Для каждого ИмяТЧ из МассивТЧДляПроверки Цикл
				Для каждого СтрокаТЧ из Объект[ИмяТЧ] Цикл
					// #14331 контролировать на нулевое значение только сумму. Цену не контролировать.
					//Если СтрокаТЧ.Цена = 0 Тогда
					//	ТекстОшибки = СтрШаблоН("Не заполнена колонка ""Цена"" в строке %1 списка ""%2""", СтрокаТЧ.НомерСтроки, ИмяТЧ);
					//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					//		ТекстОшибки,
					//		Объект.Ссылка,
					//		ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект." + ИмяТЧ, СтрокаТЧ.НомерСтроки, "Цена"),
					//		,
					//		Отказ);
					//КонецЕсли;
					Если СтрокаТЧ.Сумма = 0 Тогда
						ТекстОшибки = СтрШаблоН("Не заполнена колонка ""Сумма"" в строке %1 списка ""%2""", СтрокаТЧ.НомерСтроки, ИмяТЧ);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстОшибки,
						Объект.Ссылка,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект." + ИмяТЧ, СтрокаТЧ.НомерСтроки, "Сумма"),
						,
						Отказ);
					КонецЕсли;	
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	// проверяем заполненность статей доходов/расходов
	ФинансыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанПоступлениеТоваровИУслуг", Объект.Основание, "ПоступлениеТоваровИУслуг");
	Оповестить("Запись_ПоступлениеТоваровИУслуг", Объект.Ссылка);
	
	Если (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
		ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) 
		И ЭтоДокументОбеспеченияРозницы Тогда	
		Оповестить("ЗаписьДокументаОбеспеченияРозницы", Объект.Основание, "ПоступлениеТоваровИУслуг");
	КонецЕсли;
	
	//++ №3172
	Если ПолучитьФункциональнуюОпциюНаСервере("АвтоматическиПереводитьЗаказПоставщикуВСтатусВыполненПриПолномПоступлении")
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПоставщику")
		И ЗначениеЗаполнено(Объект.Основание) 
		Тогда
		Оповестить("ЗакрытиеЗаказаПоставщику", Объект.Основание, Объект.Ссылка);
	КонецЕсли;
	//-- №3172
	
	//++ №14786
	ЕстьВопросыПослеЗаписи = Ложь; 
	//ПринудительноЗакрытьФорму = ПараметрыЗаписи.ПринудительноЗакрытьФорму; // нет при отмене проведения
	Если Не ПараметрыЗаписи.Свойство("ПринудительноЗакрытьФорму", ПринудительноЗакрытьФорму) Тогда
		ПринудительноЗакрытьФорму = Ложь;
	КонецЕсли;
	Если КонтролироватьПрайсЛистыПриПоступленииТоваров И НЕ Объект.ПометкаУдаления Тогда
		
		МассивЦенКУстановке = УстановкаЦенВызовСервера.ВыполнитьКонтрольПрайсЛистов(Объект.Ссылка);
		
		// Если есть номенклатура, которая не прошла по минимальной наценке, предлагаем по ней установку цен
		Если МассивЦенКУстановке.Количество() > 0 Тогда
			
			ПараметрыФормы = новый Структура;
			ПараметрыФормы.Вставить("МассивЦен", 		МассивЦенКУстановке); 
			ПараметрыФормы.Вставить("Основание", 		Объект.Ссылка);
			ПараметрыФормы.Вставить("Валюта", 			Объект.Валюта);
			
			//ПринудительноЗакрытьФормуПослеЗаписи = Истина;
			ЕстьВопросыПослеЗаписи = Истина;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеКонтроляПослеЗаписи", ЭтотОбъект, );
			ОткрытьФорму("Документ.НастройкиКонтроляПрайсЛистов.Форма.ВыборПозицийКУстановке", ПараметрыФормы, , , , , ОписаниеОповещения);
			
		КонецЕсли;
		
	КонецЕсли;
	//-- №14786
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеКонтроляПослеЗаписи(Результат, ДополнительныеПараметры) Экспорт
	
	//#17006 перенесено сюда из условия
	ЕстьВопросыПослеЗаписи = Ложь;
	
	Если ПринудительноЗакрытьФорму Тогда
		//ЕстьВопросыПослеЗаписи = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	ЗаполнитьЦеныПредыдущегоПоступления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда		
		Если ЕстьВопросыПослеЗаписи Тогда
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаНоменклатурыИзExcel.Форма.ЗагрузкаВТабличнуюЧасть" Тогда
		
		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменениеПлощадиПотолкаВКарточкеНоменклатуры" и Источник = "Номенклатура" Тогда
		ОбработатьИзменениеПлощадиПотолкаНаСервере(Параметр);
	ИначеЕсли Источник = "ПодключаемоеОборудование" И ИмяСобытия = "ScanData" И ВводДоступен() И НЕ ЭтаФорма.ТолькоПросмотр Тогда		
		ОбработатьШтрихкод(Параметр);
	КонецЕсли;
КонецПроцедуры

//nva+++
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	//#2792
	Если ИспользоватьКонтрольКратности Тогда
		ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(Отказ, Объект, Перечисления.ВидыДокументовПроверкиКратности.ПоступлениеТоваровИУслуг);
	КонецЕсли;
	
КонецПроцедуры
//nva---


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	ЗаполнитьСтатьюДоходовРасходовСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	//#7805
	//УправлениеРеквизитомАдресаМонтажа(); // закомментироано в рамках заявки #10837
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
	Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор; 
	Объект.СтатьяРасходов = Объект.Контрагент.СтатьяРасходов; //nva
	ДоговорКонтрагентаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	ДоговорКонтрагентаПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере()
	
	Объект.ВидЦеныПоставщика = Объект.ДоговорКонтрагента.ВидЦеныПоставщика;
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	ЗаполнитьЦеныПредыдущегоПоступления();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ЗаполнитьЦеныПредыдущегоПоступления();
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщийМодульКлиент.Провести(ЭтаФорма, Ложь); //Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщийМодульКлиент.ПровестиИЗакрыть(ЭтаФорма, Ложь); // Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщийМодульКлиент.Записать(ЭтаФорма, Ложь); //Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	
	Если НЕ Объект.Основание = Неопределено и НЕ Объект.Основание.Пустая() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаполненииПоОснованию", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Заполнить документ по выбранному основанию?", Режим, 0);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаполненииПоОснованию(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоОснованиюНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованиюНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.Товары.Очистить();
	ДокументОбъект.Услуги.Очистить();
	
	ДокументОбъект.Заполнить(Объект.Основание);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура НайтиИВыделить(Команда)
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаСтрокиПоиска", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаАльтернативногоПоиска", , ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтрокиПоиска(СтрокаПоиска, Параметры) Экспорт
	
	// Разметка выделяемых строк
	Если СтрокаПоиска <> "" И СтрокаПоиска <> Неопределено  Тогда
		Элементы.ТоварыСнятьВыделениеПоНайти.Видимость=Истина;
		Элементы.ТоварыНайтиИВыделить.Видимость=Ложь;
		Для каждого Строка Из Объект.Товары	Цикл
			Если СтрНайти(Строка.Номенклатура, СтрокаПоиска) > 0 ИЛИ СтрНайти(Строка.ХарактеристикаНоменклатуры, СтрокаПоиска) > 0  Тогда
				Строка.ВыделятьПриПоиске = Истина;
			Иначе
				Строка.ВыделятьПриПоиске = Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Элементы.ТоварыСнятьВыделениеПоНайти.Видимость=Ложь;
		Элементы.ТоварыНайтиИВыделить.Видимость=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеПоНайти(Команда)
	Для каждого Строка Из Объект.Товары	Цикл
		Строка.ВыделятьПриПоиске = Ложь;
	КонецЦикла;
	Элементы.ТоварыСнятьВыделениеПоНайти.Видимость=Ложь;
	Элементы.ТоварыНайтиИВыделить.Видимость=Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыТовары

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
        //#15677 закомментировано
		// Элемент.ТекущиеДанные.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	//ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Для Каждого ВыделеннаяСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ВыделеннаяСтрока);	
		Если ЭтоПотолокИУНегоЕстьУслугиВТЧ(ТекущиеДанные.Номенклатура) Тогда
			//Если это потолок и у него есть услуги в ТЧ, зададим вопрос об удалении их из ТЧ
			ОП = новый ОписаниеОповещения("ПослеВопросаОУдаленииУслугиПоПотолку", ЭтотОбъект, новый Структура("Потолок", ТекущиеДанные.Номенклатура));
			ПоказатьВопрос(ОП, "В табличной части услуги есть позиции, которые привязаны к данному потолоку, удалить услуги?", РежимДиалогаВопрос.ДаНет,,, "Удаление связанных услуг по потолку");		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяРасходов");
	
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	
	//nva+++
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Количество");
	//nva---
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	//СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	//Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
	//	СтрокаТабличнойЧасти.Коэффициент = 1;
	//Иначе
	//	СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	//КонецЕсли;
	//
	//СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	//
	//ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	//ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

	//ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти); 
	
	//nva+++
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Коэффициент, Количество");  //#2792 добавлено Количество
	
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);
	//nva---
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ОчиститьСообщения(); //nva
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	//nva+++
	Если ИспользоватьКонтрольКратности Тогда
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
		ОтказВИзмененииКоличества = Ложь;
		ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества);
		Если ОтказВИзмененииКоличества Тогда
			СтрокаТабличнойЧасти.Количество = 0;
		КонецЕсли;
	КонецЕсли;
	//nva---
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

//nva+++
&НаСервере
Процедура ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества)
	
	ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(ОтказВИзмененииКоличества, СтруктураДанные, Перечисления.ВидыДокументовПроверкиКратности.ПоступлениеТоваровИУслуг);
	
КонецПроцедуры
//nva---


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПотолокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если ЭтоПотолокИлиОтрез(ТекущаяСтрока.Номенклатура) Тогда
			ДанныеВыбора.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКомнатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(СписокКомнатОснования.ВыгрузитьЗначения());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыУслуги

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
        //#15677 закомментировано
		//Элемент.ТекущиеДанные.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
		
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
	
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
		
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяРасходов");
	
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	Если НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

&НаКлиенте
Процедура УслугиПотолокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если ЭтоПотолокИлиОтрез(ТекущаяСтрока.Номенклатура) Тогда
			ДанныеВыбора.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбщихКомандТаблицТоварыУслуги

&НаКлиенте
Процедура ЗаполнитьЦеныПоставщика(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидЦеныПоставщика) Тогда
		ТекстОшибки = "Не указан вид цены поставщика!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "Объект.ВидЦеныПоставщика");
		Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда 
		ИмяТабличнойЧасти = "Товары";
		Если Команда.Имя = "ЗаполнитьЦеныУслугПоставщика" Тогда
			ИмяТабличнойЧасти = "Услуги";
		КонецЕсли;
		Если Объект[ИмяТабличнойЧасти].Количество() = 0 Тогда
			Сообщить ("Таблица товаров пустая");
		Иначе
			ОП = Новый ОписаниеОповещения ("ЗаполнитьЦеныПоставщикаНаКлиенте", ЭтотОбъект, Новый Структура("ИмяТабличнойЧасти", ИмяТабличнойЧасти));
			ПоказатьВопрос(ОП, "Для каждой строки будут установлены цены поставщика, 
			|если они зарегистрированы в базе.
			|Продолжить?", РежимДиалогаВопрос.ДаНет,,,"Загрузить цены?");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоставщикаНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ЗаполнитьЦеныПоставщикаНаСервере(ДополнительныеПараметры.ИмяТабличнойЧасти);
		Модифицированность = Истина;
		ПоказатьОповещениеПользователя("Цены перезаполнены");
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоставщикаНаСервере(ИмяТабличнойЧасти)
	
	ОбработкаТабличныхЧастейСервер.ЗаполнитьЦеныПоставщика(ЭтотОбъект, ИмяТабличнойЧасти);
	РассчитатьИтоговыеПоказателиСервер();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоПредыдущимЗакупкам(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ИмяТабличнойЧасти = "Товары";
		Если Команда.Имя = "ЗаполнитьЦеныУслугПоПредыдущимЗакупкам" Тогда
			ИмяТабличнойЧасти = "Услуги";
		КонецЕсли;
		Если Объект[ИмяТабличнойЧасти].Количество() = 0 Тогда
			Сообщить ("Табличная часть """ + ИмяТабличнойЧасти + """ пустая");
		Иначе	
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОПерезаполненииЦенПоПредыдущимЗакупкам", ЭтотОбъект, Новый Структура("ИмяТабличнойЧасти", ИмяТабличнойЧасти));
			ПоказатьВопрос(ОписаниеОповещения, "Заполнить цены по предыдущим закупкам?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПерезаполненииЦенПоПредыдущимЗакупкам(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьЦеныПоПредыдущимЗакупкамНаСервере(ДополнительныеПараметры.ИмяТабличнойЧасти);
		Модифицированность = Истина;
		ПоказатьОповещениеПользователя("Цены перезаполнены");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоПредыдущимЗакупкамНаСервере(ИмяТабличнойЧасти)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗакупкиОбороты.КоличествоОборот КАК КоличествоОборот,
	|	ЗакупкиОбороты.СуммаОборот КАК СуммаОборот,
	|	ЗакупкиОбороты.Период КАК Период
	|ИЗ
	|	РегистрНакопления.Закупки.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента
	|				И Номенклатура = &Номенклатура
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ЗакупкиОбороты
	|ГДЕ
	|	ЗакупкиОбороты.Период < &Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("Период",Объект.Дата);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент",Объект.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Объект.ДоговорКонтрагента);
	
	Для Каждого ТекущаяСтрока Из Объект[ИмяТабличнойЧасти] Цикл
		
		ТекущаяСтрока.Цена = 0;
		//ТекущаяСтрока.Сумма = 0;
		
		Запрос.УстановитьПараметр("Номенклатура", ТекущаяСтрока.Номенклатура);
		Если ИмяТабличнойЧасти = "Услуги" Тогда
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Иначе
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.КоличествоОборот = 0 Тогда
				ТекущаяСтрока.Цена = (Выборка.СуммаОборот / Выборка.КоличествоОборот) * ТекущаяСтрока.Коэффициент;
				//ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, Ложь, Ложь, Ложь);
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
		
	КонецЦикла;
	
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ОткрытьФорму(
	"Обработка.ЗагрузкаНоменклатурыИзExcel.Форма.ЗагрузкаВТабличнуюЧасть",
	ПараметрыФормы,
	ЭтаФорма,
	УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		Если СтрокаТоваров.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
			СтрокаТЧТовары = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров);
		Иначе
			СтрокаТЧТовары = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров);
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьЦеныПредыдущегоПоступления();
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандТаблицыТовары

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	//ПараметрыПодбора.Вставить("Склад",					Объект.Склад);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыТовары());
	ПараметрыПодбора.Вставить("ИспользоватьЦеныПоставщиков", Истина);
	ПараметрыПодбора.Вставить("ВидЦеныПоставщика", Объект.ВидЦеныПоставщика);
	ПараметрыПодбора.Вставить("Поставщик", Объект.Контрагент);
	
	//nva+++
	Если ИспользоватьКонтрольКратности Тогда
		ПараметрыПодбора.Вставить("ВидДокументаПроверкиКратности",ПредопределенноеЗначение("Перечисление.ВидыДокументовПроверкиКратности.ПоступлениеТоваровИУслуг")); //#2792
	КонецЕсли;
	//nva---
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НоваяСтрока, Ложь, Ложь, Ложь);
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
	КонецЦикла;
	ЗаполнитьЦеныПредыдущегоПоступления();
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоПотребностиЗаказДоговора(Команда)
	
	Если НЕ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") ИЛИ НЕ ЗначениеЗаполнено(Объект.Основание) Тогда
		ПоказатьПредупреждение(,"Документ не на основании заказ-договора");
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОРаспределенииПоОбеспечению", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Распределить по потребности заказ-договора?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОРаспределенииПоОбеспечению(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		РаспределитьПоПотребностиЗаказДоговораНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоПотребностиЗаказДоговораНаСервере()
	
	ТоварыДокумента = Объект.Товары.Выгрузить();
	ТоварыРаспределение = ТоварыДокумента.СкопироватьКолонки();
	ТоварыДокумента.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, Потолок", "Количество, Сумма");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Основание", Объект.Основание);
	СтруктураПараметров.Вставить("Ссылка", Объект.Ссылка);
	СтруктураПараметров.Вставить("УчетОбеспеченностиРозницыПоКомнатам", Объект.СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам);
	
	ОбработкаТабличныхЧастейСервер.РаспределитьПоПотребностиЗаказДоговора(ТоварыДокумента, ТоварыРаспределение, СтруктураПараметров); 
	
	Объект.Товары.Загрузить(ТоварыРаспределение);
	ЗаполнитьЦеныПредыдущегоПоступления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандТаблицыУслуги

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ОбновитьВидимостьИОстаткиВзаиморасчетов()
	
	Если Объект.Контрагент.Пустая() Тогда
		//Элементы.ГруппаТекущийДолг.Видимость = Ложь;
		Элементы.ГруппаДолги.Видимость = Ложь;
		Возврат;
	Иначе
		//Элементы.ГруппаТекущийДолг.Видимость = Истина;
		Элементы.ГруппаДолги.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);
		Элементы.ДекорацияНадписьВалютаДолгаКонтрагента.Заголовок = ВалютаУчета;
	КонецЕсли;		
	
	Если РаботаСВалютой.ОтображатьЗадолженностьКонтрагентаВВалюте() Тогда
		Элементы.ГруппаТекущийДолг1.Видимость = Истина;
		Элементы.ДекорацияДолгВВалюте.Заголовок = РаботаСВалютой.ПолучитьТекстНадписиДолгаКонтрагентаВВалютеОтображенияЗадолженности(, Объект.Контрагент, Объект.Организация);
	Иначе
		Элементы.ГруппаТекущийДолг1.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущийДолгКлиента(Знач Организация, Знач Контрагент, Знач Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			Договор = &Договор
	|				И Контрагент = &Контрагент
	|				И Организация = &Организация) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокВидовНоменклатурыТовары()
	
	Возврат Справочники.Номенклатура.ПолучитьСписокВидовНоменклатурыТовары();
	
КонецФункции

&НаСервере
Процедура ОбработатьИзменениеПлощадиПотолкаНаСервере(Параметр)
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если ТекущаяСтрока.Номенклатура = Параметр.Номенклатура Тогда
			ТекущаяСтрока.Количество = Параметр.НоваяПлощадьПотолка;
			//ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, Ложь, Ложь, Ложь);
			ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Параметр)
	
	СтруктураТовара = ОбщийМодульКлиент.ПолучитьНоменклатуруПоШтрихКоду(МенеджерОборудованияКлиентПереопределяемый.ПреобразоватьДанныеСоСканераВМассив(Параметр));
	
	Если НЕ СтруктураТовара.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда
		
		//Попробуем найти в ТЧ
		СтруктураПоиска = новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения", СтруктураТовара.Номенклатура, СтруктураТовара.ХарактеристикаНоменклатуры, СтруктураТовара.СерияНоменклатуры, СтруктураТовара.ЕдиницаИзмерения);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураТовара);
			НоваяСтрока.Количество = 1;
			Если ТипЗнч(НоваяСтрока.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
				НоваяСтрока.Коэффициент = 1;
			Иначе
				НоваяСтрока.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.ЕдиницаИзмерения);
			КонецЕсли;
			НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
			НоваяСтрока.Количество = НоваяСтрока.Количество + 1;
		КонецЕсли;	
		
		//НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НоваяСтрока, Ложь, Ложь, Ложь);
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
	Иначе
		Сообщить("Не удалось найти номенклатуру со штрих-кодом " + СтруктураТовара.ШтрихКод);
	КонецЕсли;	
	
КонецПроцедуры

//#7805
&НаСервере
Процедура УДАЛИТЬ_УправлениеРеквизитомАдресаМонтажа()
	
	// №10128 видимость всегда Истина, было: ВидимостьЭлемента = Ложь;
	ЗначениеРеквизита = "";
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		
		Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			НастройкаИнтеркампани = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Основание, "НастройкаИнтеркампани");
			Если ЗначениеЗаполнено(НастройкаИнтеркампани) Тогда
				// №10128 видимость всегда Истина, было: ВидимостьЭлемента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаИнтеркампани, "ОтображатьАдресМонтажаВШапкеДокумента");
				ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Основание, "АдресМонтажа");
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
			//РеквизитыРеализации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание, "Организация, Контрагент");
			//МенеджерЗаписи = РегистрыСведений.СвязкиОрганизацийПроизводстваКонтрагентРозницы.СоздатьМенеджерЗаписи();
			//МенеджерЗаписи.Организация = РеквизитыРеализации.Организация;
			//МенеджерЗаписи.Контрагент  = РеквизитыРеализации.Контрагент;
			//МенеджерЗаписи.Прочитать();
			//Если МенеджерЗаписи.Выбран() Тогда
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание, "АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуПоИнтеркампани, АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуСозданныхВручную, АдресМонтажа");
			ПоступлениеПоИнтеркампани = РеквизитыОснования.АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуПоИнтеркампани ИЛИ РеквизитыОснования.АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуСозданныхВручную;
			Если ПоступлениеПоИнтеркампани Тогда
				// №10128 видимость всегда Истина, было: ВидимостьЭлемента = МенеджерЗаписи.ОтображатьАдресМонтажаВШапкеДокумента;
				ЗначениеРеквизита = РеквизитыОснования.АдресМонтажа;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	//#10822
	Если Объект.ПоступлениеОтПроизводстваУИБ Тогда
		ЗначениеРеквизита = Объект.АдресМонтажа;	
	КонецЕсли;
	
	АдресМонтажа = ЗначениеРеквизита;
	Элементы.АдресМонтажа.Видимость = Истина; // №10128 видимость всегда Истина, было: ВидимостьЭлемента;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(УсловноеОформление.Элементы, Элементы.ТоварыЦенаПредыдущегоПоступления.Имя, 
		Новый ПолеКомпоновкиДанных("Объект.Товары.ЦенаПредыдущегоПоступления"), ВидСравненияКомпоновкиДанных.Больше, Новый ПолеКомпоновкиДанных("Объект.Товары.Цена"), WebЦвета.ЗеленыйЛес);
	
	//
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(УсловноеОформление.Элементы, Элементы.ТоварыЦенаПредыдущегоПоступления.Имя, 
			Новый ПолеКомпоновкиДанных("Объект.Товары.ЦенаПредыдущегоПоступления"), ВидСравненияКомпоновкиДанных.Меньше, Новый ПолеКомпоновкиДанных("Объект.Товары.Цена"), WebЦвета.Красный);
	
	//
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(УсловноеОформление.Элементы, Элементы.УслугиЦенаПредыдущегоПоступления.Имя, 
			Новый ПолеКомпоновкиДанных("Объект.Услуги.ЦенаПредыдущегоПоступления"), ВидСравненияКомпоновкиДанных.Больше, Новый ПолеКомпоновкиДанных("Объект.Услуги.Цена"), WebЦвета.ЗеленыйЛес);
	
	//
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(УсловноеОформление.Элементы, Элементы.УслугиЦенаПредыдущегоПоступления.Имя, 
			Новый ПолеКомпоновкиДанных("Объект.Услуги.ЦенаПредыдущегоПоступления"), ВидСравненияКомпоновкиДанных.Меньше, Новый ПолеКомпоновкиДанных("Объект.Услуги.Цена"), WebЦвета.Красный);
			
	//++ #4208		
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	ГруппаОтбора1 = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВыделятьПриПоиске");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ВесеннеЗеленый);		
	//-- #4208		
			
КонецПроцедуры

//#9470
&НаСервере
Процедура ЗаполнитьЦеныПредыдущегоПоступления(Отбор=Неопределено)
	
	Если ОтображатьПредыдущуюЦенуПоступления Тогда	
		ОбщийМодульСервер.ЗаполнитьЦеныПредыдущегоПоступления(Объект, "Товары", Отбор);
		ОбщийМодульСервер.ЗаполнитьЦеныПредыдущегоПоступления(Объект, "Услуги", Отбор);
	КонецЕсли;
	
КонецПроцедуры

//#9470
&НаКлиенте
Процедура ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти)
	ЗаполнитьЦеныПредыдущегоПоступления(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, , Ложь);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФункциональнуюОпциюНаСервере(ИмяФункциональнойОпции)
	
	Возврат ПолучитьФункциональнуюОпцию(ИмяФункциональнойОпции);
	
КонецФункции

&НаСервере
Функция ПолучитьЦенуПоставщика(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения)
	
	Отбор = Новый Структура;
	Отбор.Очистить();
	Отбор.Вставить("Поставщик",			Объект.Контрагент);
	Отбор.Вставить("Валюта",			Объект.Валюта);
	Отбор.Вставить("Номенклатура", 		Номенклатура);
	Отбор.Вставить("ХарактеристикаНоменклатуры", 		ХарактеристикаНоменклатуры);
	Отбор.Вставить("ЕдиницаИзмерения", 	ЕдиницаИзмерения);
	Отбор.Вставить("ВидЦеныПоставщика", Объект.ВидЦеныПоставщика);
	Выборка = РегистрыСведений.ЦеныПоставщиков.ПолучитьПоследнее(Объект.Дата, Отбор);
	
	Возврат Выборка.Цена;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьИтоговыеПоказателиКлиент()
	
	ИтогСумма = 0;
	РассчитатьИтоговыеПоказатели(Объект.Товары, Объект.Услуги, ИтогСумма, ИтогСуммаНДС);
	Если НЕ Объект.СуммаДокумента = ИтогСумма Тогда
		Объект.СуммаДокумента = ИтогСумма;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоговыеПоказателиСервер()
	
	ИтогСумма = 0;
	РассчитатьИтоговыеПоказатели(Объект.Товары, Объект.Услуги, ИтогСумма, ИтогСуммаНДС);
	Если НЕ Объект.СуммаДокумента = ИтогСумма Тогда
		Объект.СуммаДокумента = ИтогСумма;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказатели(ТаблицаТоваров, ТаблицаУслуг, ИтогСумма, ИтогСуммаНДС)

	ИтогСумма = 0;
	ИтогСуммаНДС = 0;
	
	Для каждого СтрокаТабличнойЧасти из ТаблицаТоваров Цикл
		ИтогСумма = ИтогСумма + СтрокаТабличнойЧасти.Сумма;
		ИтогСуммаНДС = ИтогСуммаНДС + СтрокаТабличнойЧасти.СуммаНДС;		
	КонецЦикла;
	Для каждого СтрокаТабличнойЧасти из ТаблицаУслуг Цикл
		ИтогСумма = ИтогСумма + СтрокаТабличнойЧасти.Сумма;
		ИтогСуммаНДС = ИтогСуммаНДС + СтрокаТабличнойЧасти.СуммаНДС;		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаСервере
Функция ЭтоПотолокИлиОтрез(ПозицияНоменклатуры)
	Возврат Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ПозицияНоменклатуры);
КонецФункции

&НаСервере
Функция	ЭтоПотолокИУНегоЕстьУслугиВТЧ(Номенклатура)
	
	УсловиеВыполнено = Ложь;
	
	Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Номенклатура) Тогда
		Для Каждого СтрокаУслуга Из Объект.Услуги Цикл
			Если СтрокаУслуга.Потолок = Номенклатура И НЕ СтрокаУслуга.Потолок.Пустая() Тогда
				УсловиеВыполнено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат УсловиеВыполнено;
	
КонецФункции

&НаКлиенте
Процедура ПослеВопросаОУдаленииУслугиПоПотолку(Ответ, ДопПараметры) ЭКСПОРТ
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Для Каждого СтрокаУслуга Из Объект.Услуги Цикл
			Если СтрокаУслуга.Потолок = ДопПараметры.Потолок И НЕ СтрокаУслуга.Потолок.Пустая() Тогда
				Объект.Услуги.Удалить(СтрокаУслуга);		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьПотолокПоОснованию(Команда)
	
	СписокВариантов = ПолучитьСписокПотолковОснования();
	
	Если СписокВариантов.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"В документе-основании нет потолков");
		Возврат;
	КонецЕсли;	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборПотолкаДляЗаполненияПоОснованию", ЭтаФорма);
	
	СписокВариантов.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите потолок");	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПотолковОснования()
	
	СписокПотолков = Новый СписокЗначений;
	
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") или ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Для Каждого СтрокаОснования из Объект.Основание.Товары Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаОснования.Номенклатура) Тогда
				СписокПотолков.Добавить(СтрокаОснования.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		Для Каждого СтрокаОснования из Объект.Основание.ТоварыУслуги Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаОснования.Номенклатура) Тогда
				СписокПотолков.Добавить(СтрокаОснования.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокПотолков;
	
КонецФункции

&НаКлиенте
Процедура ВыборПотолкаДляЗаполненияПоОснованию(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		ВыборПотолкаДляЗаполненияПоОснованиюНаСервере(ВыбранныйЭлемент.Значение);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыборПотолкаДляЗаполненияПоОснованиюНаСервере(ВыбранныйПотолок)
	
	//удалим выбранный потолок и все что с ним связано из ТЧ Товары
	КопияТЧТовары = Объект.Товары.Выгрузить();
	Объект.Товары.Очистить();
	Для Каждого СтрокаКопии Из КопияТЧТовары Цикл
		Если СтрокаКопии.Номенклатура = ВыбранныйПотолок ИЛИ СтрокаКопии.Потолок = ВыбранныйПотолок Тогда
			продолжить;
		Иначе
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКопии);
		КонецЕсли;
	КонецЦикла;
	
	КопияТЧУслуги = Объект.Услуги.Выгрузить();
	Объект.Услуги.Очистить();
	Для Каждого СтрокаКопии Из КопияТЧУслуги Цикл
		Если СтрокаКопии.Номенклатура = ВыбранныйПотолок ИЛИ СтрокаКопии.Потолок = ВыбранныйПотолок Тогда
			продолжить;
		Иначе
			НоваяСтрока = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКопии);
		КонецЕсли;
	КонецЦикла;
	
	
	//добавим выбранный потолок и все его подчиненные строки	
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") или ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Для Каждого ТекСтрокаОснования Из Объект.Основание.Товары Цикл
			Если ТекСтрокаОснования.Номенклатура = ВыбранныйПотолок ИЛИ ТекСтрокаОснования.Потолок = ВыбранныйПотолок Тогда
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаОснования.Номенклатура) Тогда
					НоваяСтрока = Объект.Услуги.Добавить();
					Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования);
					Иначе
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования, "Номенклатура, Количество, ЕдиницаИзмерения, Коэффициент, Потолок");
					КонецЕсли;
				Иначе
					НоваяСтрока = Объект.Товары.Добавить();
					Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования);
					Иначе
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования, "Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Коэффициент, Потолок");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		Для Каждого ТекСтрокаОснования Из Объект.Основание.ТоварыУслуги Цикл
			Если ТекСтрокаОснования.Номенклатура = ВыбранныйПотолок ИЛИ ТекСтрокаОснования.НомерПотолка = ВыбранныйПотолок.Потолок_НомерРасчета Тогда
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаОснования.Номенклатура) Тогда
					НоваяСтрока = Объект.Услуги.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования, "Номенклатура, Количество, ЕдиницаИзмерения, Коэффициент");
					НоваяСтрока.Потолок = ВыбранныйПотолок;
				Иначе
					НоваяСтрока = Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования, "Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Коэффициент, Комната");
					НоваяСтрока.Потолок = ВыбранныйПотолок;
					НоваяСтрока.Назначение = "Товары";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

//nva+++
&НаКлиенте 
Функция СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ИмяТаблицы = "Товары")
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",			ИмяТаблицы);
	СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 	СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 			СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 				Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				"");
	СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	СтруктураДанные.Вставить("Организация",			Объект.Организация);
	СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	СтруктураДанные.Вставить("Контрагент",			Объект.Контрагент);
	СтруктураДанные.Вставить("ДоговорКонтрагента", 	Объект.ДоговорКонтрагента);
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);

	Возврат СтруктураДанные;
	
КонецФункции 

&НаСервере
Функция СтруктураДанныхПоСтрокеТабличнойЧастиСервер(СтрокаТабличнойЧасти, ИмяТаблицы = "Товары")
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",			ИмяТаблицы);                          //#2792
	СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);  //#2792
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 	СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 			СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 				Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				"");
	СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	СтруктураДанные.Вставить("Организация",			Объект.Организация);
	СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	СтруктураДанные.Вставить("Контрагент",			Объект.Контрагент);
	СтруктураДанные.Вставить("ДоговорКонтрагента", 	Объект.ДоговорКонтрагента);
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные)
	
	ОбщиеДанныеНоменклатуры = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ОбщиеДанныеНоменклатуры, СтруктураДанные);
	ОбщиеДанныеНоменклатуры = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(ОбщиеДанныеНоменклатуры);
	
	СтруктураДанные.Вставить("СтатьяДоходов",  ОбщиеДанныеНоменклатуры.СтатьяДоходов);
	СтруктураДанные.Вставить("СтатьяРасходов", ОбщиеДанныеНоменклатуры.СтатьяРасходов);

	//Цена = ПолучитьЦенуНоменклатуры(СтруктураДанные);	
	//СтруктураДанные.Вставить("Цена", Цена);
	
	Если ТипЗнч(СтруктураДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтруктураДанные.Вставить("Коэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("Коэффициент", ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтруктураДанные.ЕдиницаИзмерения));
	КонецЕсли;
		
	Если СтруктураДанные.ИспользоватьКонтрольКратности 
		И НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешитьНесоответствиеКратностиЕдиницИзмерения") Тогда
		
		СтруктураПоиска = Новый Структура("ВидДокумента, ЕдиницаИзмерения", Перечисления.ВидыДокументовПроверкиКратности.РеализацияТоваровИУслуг, СтруктураДанные.ЕдиницаИзмерения);
		НайденныеСтроки = СтруктураДанные.Номенклатура.Кратность.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда		
			СтруктураДанные.Вставить("Количество", 0); //#2792
		Иначе
			СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
		КонецЕсли;
	Иначе
		СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции
//nva---



