
&НаСервере
Функция СформироватьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Замеры.Дата КАК ДатаЗамера,
	|	Замеры.ВремяНачала КАК ВремяЗамера,
	|	Замеры.ВремяОкончания КАК ВремяОкончания,
	|	ВЫБОР
	|		КОГДА Замеры.Город = ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка)
	|			ТОГДА Замеры.Адрес
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Замеры.Адрес = """" 
	|               	ТОГДА Замеры.Город.Наименование
	|				ИНАЧЕ Замеры.Город.Наименование + "", "" + Замеры.Адрес
	|			КОНЕЦ
	|	КОНЕЦ КАК Адрес,
	|	Замеры.ИмяКлиента КАК ФИОКлиента,
	|	Замеры.Регистратор.ОсновнойТелефонКлиента КАК ТелефонКлиента,
	|	Замеры.Комментарий КАК Комментарий,
	|	Замеры.Сотрудник КАК Замерщик
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	Замеры.Дата МЕЖДУ &НачалоДатаЗамера И &КонецДатаЗамера
	|	И ВЫБОР
	|			КОГДА &Замерщик = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Замеры.Сотрудник = &Замерщик
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Замеры.Регистратор.ПоследнийНазначилЗамер = &НазначилЗамер
	|		КОНЕЦ
	|	И НЕ Замеры.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился), ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЗамера,
	|	ВремяЗамера";
	Запрос.УстановитьПараметр("Замерщик", Замерщик);
	Запрос.УстановитьПараметр("НазначилЗамер", НазначилЗамер);
	Запрос.УстановитьПараметр("НачалоДатаЗамера", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонецДатаЗамера", КонецДня(Период.ДатаОкончания));	
	
	ТабЗнач = Запрос.Выполнить().Выгрузить();
	Даты = ТабЗнач.Скопировать();
	Даты.Свернуть("ДатаЗамера");
	
	ТаблицаЗамерщиков = ТабЗнач.Скопировать();
	ТаблицаЗамерщиков.Свернуть("Замерщик");
	
	Таб = Новый ТабличныйДокумент;
	
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = ЭтотОтчет.ПолучитьМакет("УДАЛИТЬ_Макет");
	
	ОбластьКлиент = Макет.Область("Клиент");
	ОбластьКлиент.ШиринаКолонки = ?(НеВыводитьТелефоны, 9.5, 4.75);
	
	Если ЗначениеЗаполнено(Замерщик) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Замерщик");
		ОбластьМакета.Параметры.Замерщик = Замерщик;
		Таб.Вывести(ОбластьМакета);
	КонецЕсли;
	Если ЗначениеЗаполнено(НазначилЗамер) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("НазначилЗамер");
		ОбластьМакета.Параметры.НазначилЗамер = НазначилЗамер;
		Таб.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Если Даты.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ЗамеровНет");
		Таб.Вывести(ОбластьМакета);
		Возврат Таб;
	КонецЕсли;
	
	Для Каждого Строка из Даты Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ДатаЗамера");
		ОбластьМакета.Параметры.Дата = Формат(Строка.ДатаЗамера, "ДФ=dd.MM.yyyy");
		Таб.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Замер");
		Таб.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Клиент");
		Таб.Присоединить(ОбластьМакета);
		Если НЕ НеВыводитьТелефоны Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Телефон");
			Таб.Присоединить(ОбластьМакета);
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Комментарий");
		Таб.Присоединить(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Конец");
		Таб.Присоединить(ОбластьМакета);
		
		Для каждого СтрокаЗамерщик из ТаблицаЗамерщиков Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ДатаЗамера", Строка.ДатаЗамера);
			Отбор.Вставить("Замерщик", СтрокаЗамерщик.Замерщик);			
			СтрокиЗамеров = ТабЗнач.НайтиСтроки(Отбор);
			Если СтрокиЗамеров.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамерщик|Замер");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаЗамерщик);
			Таб.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамерщик|Клиент");
			Таб.Присоединить(ОбластьМакета);
			Если НЕ НеВыводитьТелефоны Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамерщик|Телефон");
				Таб.Присоединить(ОбластьМакета);
			КонецЕсли;
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамерщик|Комментарий");
			Таб.Присоединить(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамерщик|Конец");
			Таб.Присоединить(ОбластьМакета);
									
			Для Каждого СтрокаЗамера Из СтрокиЗамеров Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Замер");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаЗамера);
				ОбластьМакета.Параметры.ВремяЗамера = Формат(СтрокаЗамера.ВремяЗамера, "ДФ=HH:mm") + " - " + Формат(СтрокаЗамера.ВремяОкончания, "ДФ=HH:mm");
				Таб.Вывести(ОбластьМакета);
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Клиент");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаЗамера);
				Таб.Присоединить(ОбластьМакета);
				Если НЕ НеВыводитьТелефоны Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Телефон");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаЗамера);
					Таб.Присоединить(ОбластьМакета);
				КонецЕсли;
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Комментарий");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаЗамера);
				Таб.Присоединить(ОбластьМакета);
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Конец");
				Таб.Присоединить(ОбластьМакета);
				
			КонецЦикла;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал|Замер");
		Таб.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал|Клиент");
		Таб.Присоединить(ОбластьМакета);
		Если НЕ НеВыводитьТелефоны Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал|Телефон");
			Таб.Присоединить(ОбластьМакета);
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал|Комментарий");
		Таб.Присоединить(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал|Конец");
		Таб.Присоединить(ОбластьМакета);
	КонецЦикла;
	Возврат Таб;
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Результат = СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = ТекущаяДатаСеанса();
	Период.ДатаОкончания = ТекущаяДатаСеанса();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) И Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Период.ДатаНачала = ТекущаяДатаСеанса();
		Период.ДатаОкончания = ТекущаяДатаСеанса();
	ИначеЕсли Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		Период.ДатаНачала = Период.ДатаОкончания;
	ИначеЕсли Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Период.ДатаОкончания = Период.ДатаНачала;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры
