////#Область Прочее

Функция   КопияОбъекта(Объект) Экспорт
    Результат = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(Объект));
    Возврат Результат;
КонецФункции

Функция   РеквизитыОбъекта(Объект, СписокРеквизитов) Экспорт
    Результат = Новый Структура(СписокРеквизитов);
    ЗаполнитьЗначенияСвойств(Результат, Объект);
    Возврат Результат;
КонецФункции

// Возвращает авторизованного в системе пользователя (СправочникСсылка.Пользователи)
Функция   ТекущийПользователь() Экспорт
    Возврат ИА_БФСПИ.ТекущийПользователь();
КонецФункции

Функция   Хеш_MD5(Строка) Экспорт
    Результат = "";
    Код = СтрЗаменить(
    "Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
    |Хеш.Добавить(Строка);
    |Результат = СтрЗаменить('' + Хеш.ХешСумма, ' ', '')", "'", """");
    Выполнить Код;
    Возврат Результат; 
КонецФункции

Функция   ДатаСозданияСсылки(Ссылка) Экспорт
    ГУИД = Ссылка.УникальныйИдентификатор();
    Строка16 = Сред(ГУИД, 16, 3) + Сред(ГУИД, 10, 4) + Сред(ГУИД, 1, 8);
    Разрядность = СтрДлина(Строка16);
    ЧислоСек = 0;
    Для Позиция = 1 По Разрядность Цикл
        ЧислоСек = ЧислоСек + Найти("123456789abcdef",Сред(Строка16,Позиция,1))*Pow(16,Разрядность - Позиция);
    КонецЦикла;
    ЧислоСек = ЧислоСек / 10000000;
    Возврат Дата(1582, 10, 15, 04, 00, 00) + ЧислоСек;
КонецФункции 

////#КонецОбласти

//_____________________________________________________________

////#Область Таблицы_значений

// Функция создает новую таблицу значений на основе строкового списка колонок или структуры вида "ИмяКолонки" - "ОписаниеТипа"
// Параметры:
// Колонки - Строки, Структура - Список колонок ИЛИ структура вида "ИмяКолонки" - "ОписаниеТипа"
Функция   ТЗ_НоваяТаблицаЗначений(Колонки) Экспорт
    ТЗ = Новый ТаблицаЗначений;
    СтрКолонки = ?(ТипЗнч(Колонки) = Тип("Строка"), Новый Структура(Колонки), Колонки);
    Для каждого Эл Из СтрКолонки Цикл
        ТЗ.Колонки.Добавить(Эл.Ключ, Эл.Значение);
    КонецЦикла;      
    Возврат ТЗ;
КонецФункции

// Функция создает и заполняет таблицу значений по исходным данным
// Параметры:
// Колонки - Строки, Структура - Список колонок ИЛИ структура вида "ИмяКолонки" - "ОписаниеТипа"
// П1 .. П100 - данные, которые необходимо поместить в соответствующие колонки/строки новой таблицы значений
Функция   ТЗ_Создать(Колонки
    ,  П1 = "m42c-511-13!",  П2 = "m42c-511-13!",  П3 = "m42c-511-13!",  П4 = "m42c-511-13!",  П5 = "m42c-511-13!"
    ,  П6 = "m42c-511-13!",  П7 = "m42c-511-13!",  П8 = "m42c-511-13!",  П9 = "m42c-511-13!", П10 = "m42c-511-13!"
    , П11 = "m42c-511-13!", П12 = "m42c-511-13!", П13 = "m42c-511-13!", П14 = "m42c-511-13!", П15 = "m42c-511-13!"
    , П16 = "m42c-511-13!", П17 = "m42c-511-13!", П18 = "m42c-511-13!", П19 = "m42c-511-13!", П20 = "m42c-511-13!"
    , П21 = "m42c-511-13!", П22 = "m42c-511-13!", П23 = "m42c-511-13!", П24 = "m42c-511-13!", П25 = "m42c-511-13!"
    , П26 = "m42c-511-13!", П27 = "m42c-511-13!", П28 = "m42c-511-13!", П29 = "m42c-511-13!", П30 = "m42c-511-13!"
    , П31 = "m42c-511-13!", П32 = "m42c-511-13!", П33 = "m42c-511-13!", П34 = "m42c-511-13!", П35 = "m42c-511-13!"
    , П36 = "m42c-511-13!", П37 = "m42c-511-13!", П38 = "m42c-511-13!", П39 = "m42c-511-13!", П40 = "m42c-511-13!"
    , П41 = "m42c-511-13!", П42 = "m42c-511-13!", П43 = "m42c-511-13!", П44 = "m42c-511-13!", П45 = "m42c-511-13!"
    , П46 = "m42c-511-13!", П47 = "m42c-511-13!", П48 = "m42c-511-13!", П49 = "m42c-511-13!", П50 = "m42c-511-13!"
    , П51 = "m42c-511-13!", П52 = "m42c-511-13!", П53 = "m42c-511-13!", П54 = "m42c-511-13!", П55 = "m42c-511-13!"
    , П56 = "m42c-511-13!", П57 = "m42c-511-13!", П58 = "m42c-511-13!", П59 = "m42c-511-13!", П60 = "m42c-511-13!"
    , П61 = "m42c-511-13!", П62 = "m42c-511-13!", П63 = "m42c-511-13!", П64 = "m42c-511-13!", П65 = "m42c-511-13!"
    , П66 = "m42c-511-13!", П67 = "m42c-511-13!", П68 = "m42c-511-13!", П69 = "m42c-511-13!", П70 = "m42c-511-13!"
    , П71 = "m42c-511-13!", П72 = "m42c-511-13!", П73 = "m42c-511-13!", П74 = "m42c-511-13!", П75 = "m42c-511-13!"
    , П76 = "m42c-511-13!", П77 = "m42c-511-13!", П78 = "m42c-511-13!", П79 = "m42c-511-13!", П80 = "m42c-511-13!"
    , П81 = "m42c-511-13!", П82 = "m42c-511-13!", П83 = "m42c-511-13!", П84 = "m42c-511-13!", П85 = "m42c-511-13!"
    , П86 = "m42c-511-13!", П87 = "m42c-511-13!", П88 = "m42c-511-13!", П89 = "m42c-511-13!", П90 = "m42c-511-13!"
    , П91 = "m42c-511-13!", П92 = "m42c-511-13!", П93 = "m42c-511-13!", П94 = "m42c-511-13!", П95 = "m42c-511-13!"
    , П96 = "m42c-511-13!", П97 = "m42c-511-13!", П98 = "m42c-511-13!", П99 = "m42c-511-13!", П100 = "m42c-511-13!") Экспорт 
    
    ПустоеЗначение = "m42c-511-13!";
    ВсегоПараметров = 100;
    
    ТЗ = ИА_БФС.ТЗ_НоваяТаблицаЗначений(Колонки);
    КоличествоКолонок = ТЗ.Колонки.Количество();
    МассивДанных = Новый Массив;
    
    //{ Перенесем параметры в массив
    Код = "";
    Ц = ВсегоПараметров;
    Пока Ц > 0 Цикл
        Код = Код + Символы.ПС + "Если П" + Ц + " <> ПустоеЗначение Тогда МассивДанных.Вставить(0, П" + Ц + ") КонецЕсли;";
        Ц = Ц - 1;
    КонецЦикла; 
    Выполнить(Код);
    //}
    
    
    Ц = 0;
    СтрокаТЗ = Неопределено;
    Для каждого Эл Из МассивДанных Цикл
        Если СтрокаТЗ = Неопределено Тогда
        	СтрокаТЗ = ТЗ.Добавить();
        КонецЕсли; 
        СтрокаТЗ[Ц] = Эл;
        Ц = Ц + 1;
        Если Ц = КоличествоКолонок Тогда
            СтрокаТЗ = Неопределено;
        	Ц = 0;
        КонецЕсли; 
    КонецЦикла; 
    
    Возврат ТЗ;
КонецФункции

// Выполняет удаление строк из ТЗ(Или другой коллекции, для которой возможно обращение к строкам и удаление через индекс)
// Параметры:
// Таб - ТаблицаЗначений, ТабличнаяЧасть - То, откуда надо удалить строки
//                                         Или другая коллекция, для которой возможно обращение к строкам и удаление через индекс.
// Условие - Строка - Фрагмент кода, который будет выполнен через "Вычислить".
//                    Обращаться к строке надо через "СтрокаТЗ."
//                    Должен вернуть ИСТИНА, если надо удалить строку, иначе ЛОЖЬ.
// Контекст - Произвольный - Для передачи любых данных. Обычно удобно использовать структуру.
Процедура ТЗ_УдалитьСтрокиПоУсловию(Таб, Условие, Контекст=Неопределено) Экспорт
    Ц = 0;
    Пока Ц < Таб.Количество() Цикл
        СтрокаТЗ = Таб[Ц];
        УдалитьСтроку = Вычислить(Условие);
        Если УдалитьСтроку Тогда
            Таб.Удалить(Ц);
        Иначе
            Ц = Ц + 1;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

// Создаёт отфильтрованную копию ТЗ или ТЧ, с помощью "ТЗ_УдалитьСтрокиПоУсловию"
// Пример:  ТЗ_ФильтрПоУсловию(ТЗ, "СтрокаТЗ.Количество >  0 ИЛИ СтрокаТЗ.Номенклатура=Контекст", ВыбНоменклатура);
// Параметры:
// ТЗ - ТаблицаЗначений, ТабличнаяЧасть - Источник. Должен поддерживать получение копии через "Скопировать" или "Выгрузить".
// Условие - Строка - Фрагмент кода, который будет выполнен через "Вычислить".
//                    Обращаться к строке надо через "СтрокаТЗ."
//                    Должен вернуть ИСТИНА, если надо удалить строку, иначе ЛОЖЬ.
// Контекст - Произвольный - Для передачи любых данных. Обычно удобно использовать структуру.
Функция   ТЗ_ФильтрПоУсловию(ТЗ, Условие, Контекст=Неопределено) Экспорт
    Попытка
        Таб = ТЗ.Выгрузить();
    Исключение
        Таб = ТЗ.Скопировать();
    КонецПопытки;
    ТЗ_УдалитьСтрокиПоУсловию(Таб, "НЕ (" + Условие + ") ", Контекст);
    Возврат Таб;
КонецФункции

// Создаёт отфильтрованную копию ТЗ или ТЧ, с помощью "НайтиСтроки"
// Параметры:
// ТЗ - ТаблицаЗначений, ТабличнаяЧасть - Источник. Должен поддерживать получение копии через "Скопировать" или "Выгрузить".
// Отбор - Структура - Структура для поиска через "НайтиСтроки"
Функция   ТЗ_ФильтрПоОтбору(ИсходнаяТЗ, Отбор) Экспорт
    Попытка
        Таб = ИсходнаяТЗ.Выгрузить();
    Исключение
        Таб = ИсходнаяТЗ.Скопировать();
    КонецПопытки;
    Возврат Таб.Скопировать(Таб.НайтиСтроки(Отбор));
КонецФункции

//   Выполняет вычитание таблицы из "ТЗ1" "ТЗ2" значений в разрезе "измерений" по суммовым колонкам "Ресурсы"
// и если "УдалятьСтрокиСРесурсами0" = ИСТИНЕ удаляет строки со всеми нулевыми ресурсами
// ПРИМЕР
// ТЗ1:______________________________________
// |Код |Контрагент|Договор|Количество|Сумма|
// |0001|Молоко    |Дог1   |      1   | 1500|
// |0002|Молоко    |Дог1   |      2   | 1500|
// |0002|Молоко    |Дог1   |      2   | 1500|
// |0003|Второй    |Дог1   |      0   |    0|
//
// ТЗ2:______________________________________
// |Код |Контрагент|Договор|Количество|Сумма|
// |0001|Молоко    |Дог1   |      1   | 1500|
// |0002|Молоко    |Дог1   |      2   | 1500|
// |0003|Второй    |Дог1   |      1   |   10|
// 
// ВЫПОЛНЕНИЕ: ТЗ_Вычесть(ТЗ1, ТЗ2, "Код, Договор", "Количество, Сумма")
// |0002|Молоко    |Дог1   |      2   | 1500|
// |0003|Второй    |Дог1   |     -1   |  -10|
// 
// Параметры:
// {НаименованиеПараметра} - % (тип параметра) - % (описание параметра)
// {НаименованиеПараметра} - % (описание параметра) 
Функция   ТЗ_Вычесть(ТЗ1, ТЗ2, Измерения, Ресурсы, УдалятьСтрокиСРесурсами0 = Истина) Экспорт
    КолонкиРесурсы = Новый Структура(Ресурсы);
    //{ Колонки-"ресурсы" м.б. с типом "неотрицательное"
    Таб = ТЗ1.СкопироватьКолонки();
    Для каждого Эл Из КолонкиРесурсы Цикл
        Таб.Колонки.Удалить(Эл.Ключ);
        Таб.Колонки.Добавить(Эл.Ключ);
    КонецЦикла;
    //}
    
    //{ Заполнение временной таблицы
    Для каждого СтрокаТЗ Из ТЗ1 Цикл
        ЗаполнитьЗначенияСвойств(Таб.Добавить(), СтрокаТЗ);
    КонецЦикла;
    
    Для каждого СтрокаТЗ Из ТЗ2 Цикл
        НовСтрока = Таб.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЗ);
        Для каждого Эл Из КолонкиРесурсы Цикл
            НовСтрока[Эл.Ключ] = -НовСтрока[Эл.Ключ];
        КонецЦикла;
    КонецЦикла;
    Таб.Свернуть(Измерения, Ресурсы);
    //}
    
    //{ Удалим строки с ресурсами =0
    Если УдалятьСтрокиСРесурсами0 Тогда
        Ц = 0;
        Пока Ц < Таб.Количество() Цикл
            НадоУдалить = Истина;
            СтрокаТЗ = Таб[Ц];
            Для каждого Эл Из КолонкиРесурсы Цикл
                Если СтрокаТЗ[Эл.Ключ] <> 0 Тогда
                    НадоУдалить = Ложь;
                    Прервать;
                КонецЕсли;
            КонецЦикла;
            Если НадоУдалить Тогда
                Таб.Удалить(Ц);
            Иначе
                Ц = Ц + 1;
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
    //}
    Возврат Таб;
КонецФункции

Процедура ТЗ_ЗаполнитьПоТаблице(ТЗИсточник, ТЗПриемник, ОчиститьПриемник = Истина) Экспорт
    Если ОчиститьПриемник Тогда
        ТЗПриемник.Очистить();
    КонецЕсли; 
    Для каждого СтрокаТЗ Из ТЗИсточник Цикл
        ЗаполнитьЗначенияСвойств(ТЗПриемник.Добавить(), СтрокаТЗ);
    КонецЦикла; 
КонецПроцедуры

Процедура ТЗ_ВыполнитьПоСтроке(ТЗ, Код, Контекст = Неопределено) Экспорт
    ОбщийКод = "Для каждого СтрокаТЗ Из ТЗ Цикл " + Код + " КонецЦикла;";
	УстановитьБезопасныйРежим(Истина);
    Выполнить(ОбщийКод);
	УстановитьБезопасныйРежим(Ложь);
КонецПроцедуры

Функция   ТЗ_ПредставлениеСтроки(ДанныеСтроки, КолонкиТаблицы = Неопределено, ПорядокСледования="", ИсключенныеКолонки="", СписокОбъектовМДДляСинонимов=Неопределено, Кэш = Неопределено) Экспорт
    Если КолонкиТаблицы = Неопределено Тогда
    	КолонкиТаблицы = ДанныеСтроки.Владелец().Колонки;
    КонецЕсли; 
    
    Если Кэш <> Неопределено Тогда
        СписокКолонок = Кэш;
    Иначе
        Стр = СтрЗаменить("," + ПорядокСледования + ",", ",", Символы.ПС);
        
        СписокКолонок = Новый ТаблицаЗначений;
        СписокКолонок.Колонки.Добавить("Имя");
        СписокКолонок.Колонки.Добавить("Синоним");
        СписокКолонок.Колонки.Добавить("Значение");
        
        Для Ц = 1 По СтрЧислоВхождений(Стр, Символы.ПС) Цикл
            ПодСтрока = СокрЛП(Врег(СтрПолучитьСтроку(Стр, Ц)));
             Если ЗначениеЗаполнено(ПодСтрока) И СписокКолонок.Найти(ПодСтрока, "Имя") = Неопределено Тогда
                НовСтрока = СписокКолонок.Добавить();
				НовСтрока.Имя = ПодСтрока;
				НовСтрока.Синоним = СокрЛП(СтрПолучитьСтроку(Стр, Ц));
            КонецЕсли; 
        КонецЦикла; 
        
        СтрИсключенныеКолонки = Новый Структура(Врег(ИсключенныеКолонки));
        Для каждого Колонка Из КолонкиТаблицы Цикл
            Имя = Врег(Колонка.Имя);
            Если СписокКолонок.Найти(Имя, "Имя") = Неопределено
                И НЕ СтрИсключенныеКолонки.Свойство(Имя)
                Тогда
                НовСтрока = СписокКолонок.Добавить();
                НовСтрока.Имя = Имя;
                НовСтрока.Синоним = Колонка.Имя;
            КонецЕсли; 
        КонецЦикла; 
        
        Если СписокОбъектовМДДляСинонимов <> Неопределено Тогда
            Для каждого СтрокаТЗ Из СписокКолонок Цикл
                Для каждого Эл Из СписокОбъектовМДДляСинонимов Цикл
                    Элемент = Эл.Найти(СтрокаТЗ.Имя);
                    Если Элемент <> Неопределено Тогда
                        СтрокаТЗ.Синоним = Элемент.Синоним;
                        Прервать;
                    КонецЕсли; 
                КонецЦикла; 
                Если НЕ ЗначениеЗаполнено(СтрокаТЗ.Синоним) Тогда
                    СтрокаТЗ.Синоним = Трег(СтрокаТЗ.Имя);
                КонецЕсли; 
            КонецЦикла; 
        КонецЕсли; 
        Для каждого СтрокаТЗ Из СписокКолонок Цикл
            Если НЕ ЗначениеЗаполнено(СтрокаТЗ.Синоним) Тогда
            	СтрокаТЗ.Синоним = СтрокаТЗ.Имя;
            КонецЕсли; 
        КонецЦикла;
        Кэш = СписокКолонок;
    КонецЕсли; 
    Результат = "";
    
    Для каждого СтрокаТЗ Из СписокКолонок Цикл
        Попытка
            Значение = ДанныеСтроки[СтрокаТЗ.Имя];
            Если НЕ ЗначениеЗаполнено(Значение) Тогда
                Значение = "<пусто>";
            КонецЕсли; 
            Результат = Результат + "; " + СтрокаТЗ.Синоним + " = " + Значение;
        Исключение
            Ошибка = ОписаниеОшибки();
        КонецПопытки; 
    КонецЦикла; 
    
    Результат = Сред(Результат, 3);
    Возврат Результат;
КонецФункции

Функция   ТЗ_ВыгрузитьУникальныеЗначенияКолонки(ТЗ, ИмяКолонки) Экспорт
    ВремТаб = ТЗ.Скопировать(,ИмяКолонки);
    ВремТаб.Свернуть(ИмяКолонки);
    Возврат ВремТаб.ВыгрузитьКолонку(ИмяКолонки);
КонецФункции

Функция   ТЗ_ПоПолюМакс(ТЗ, ИмяПоля) Экспорт
    Если ТЗ.Количество() = 0 Тогда
        ВремТЗ = ТЗ.СкопироватьКолонки();
        ТЗ_УдалитьПустыеТипы(ВремТЗ);
        Результат = ВремТЗ.Добавить()[ИмяПоля];
    Иначе
        Результат = ТЗ[0][ИмяПоля];
        Для каждого СтрокаТЗ Из ТЗ Цикл
            Значение = СтрокаТЗ[ИмяПоля];
            Если Результат < Значение Тогда
                Результат = Значение;
            КонецЕсли; 
        КонецЦикла; 
    КонецЕсли; 
    Возврат Результат;
КонецФункции

Функция   ТЗ_ПоПолюМин(ТЗ, ИмяПоля) Экспорт
    Если ТЗ.Количество() = 0 Тогда
        ВремТЗ = ТЗ.СкопироватьКолонки();
        ТЗ_УдалитьПустыеТипы(ВремТЗ);
        Результат = ВремТЗ.Добавить()[ИмяПоля];
    Иначе
        Результат = ТЗ[0][ИмяПоля];
        Для каждого СтрокаТЗ Из ТЗ Цикл
            Значение = СтрокаТЗ[ИмяПоля];
            Если Результат > Значение Тогда
                Результат = Значение;
            КонецЕсли; 
        КонецЦикла; 
    КонецЕсли; 
    Возврат Результат;
КонецФункции

Функция   ТЗ_ВывестиВТабДок(ТЗ
    , Заголовок = Неопределено
    , ВыводитьНПП = Истина
    , СоздатьФорматСтрок = Ложь
    , СгруппироватьСтроки = Ложь
    , НастройкиОформления = Неопределено
    ) Экспорт
    
    ТабНастройкиПолей = Новый ТаблицаЗначений;
    ТабНастройкиПолей.Колонки.Добавить("Имя");
    ТабНастройкиПолей.Колонки.Добавить("Заголовок");
    ТабНастройкиПолей.Колонки.Добавить("ТипЗначения");
    ТабНастройкиПолей.Колонки.Добавить("Ресурс");
    
    Если ТипЗнч(НастройкиОформления) = Тип("Структура") Тогда
        Если НастройкиОформления.Свойство("Поля") Тогда
            Для каждого Стр Из НастройкиОформления.Поля Цикл
                НовСтрока = ТабНастройкиПолей.Добавить();
            	ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
                НовСтрока.Ресурс = НовСтрока.Ресурс = Истина;
            КонецЦикла;  
        КонецЕсли; 
    Иначе
        НастройкиОформления = Новый Структура;
    КонецЕсли; 
    
    ИмяКолонкиНПП = "__НПП__";
    Результат = ТЗ.Скопировать();	
    Если ВыводитьНПП Тогда
        Результат.Колонки.Вставить(0, ИмяКолонкиНПП);
        Ц = 1;
        Для каждого СтрокаТЗ Из Результат Цикл
            СтрокаТЗ[ИмяКолонкиНПП] = Ц;
            Ц = Ц + 1;
        КонецЦикла; 
    КонецЕсли; 
    
    СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
    
    Источник = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
    Источник.Имя = "ЛокальнаяБаза";
    Источник.СтрокаСоединения = "";
    Источник.ТипИсточникаДанных = "Local";
    
    НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
    НаборДанных.Имя = "Реестр";
    НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
    НаборДанных.ИмяОбъекта = "Реестр";
    ЕстьСумма = Ложь;
    Для каждого ТекКолонка Из Результат.Колонки Цикл
        ПолеНабораДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") );
        ПолеНабораДанных.Поле = ТекКолонка.Имя;
        ПолеНабораДанных.ПутьКДанным = ТекКолонка.Имя;
        
        
        СтрокаОформления = ТабНастройкиПолей.Найти(ТекКолонка.Имя, "Имя");
        Если СтрокаОформления = Неопределено Тогда
        	ПолеНабораДанных.Заголовок = ТекКолонка.Имя;
        Иначе
            ПолеНабораДанных.Заголовок   = СтрокаОформления.Заголовок;
            Если СтрокаОформления.ТипЗначения <> Неопределено Тогда
            	ПолеНабораДанных.ТипЗначения = СтрокаОформления.ТипЗначения;
            КонецЕсли; 
        КонецЕсли; 
    КонецЦикла;
    
    Настройки = СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки;
    
    // Общие настройки СКД
    Для каждого Эл Из Настройки.ПараметрыВывода.Элементы Цикл
        Если Эл.Параметр = Новый ПараметрКомпоновкиДанных("МакетОформления")
            И НастройкиОформления.Свойство("МакетОформления") Тогда
            Эл.Значение = НастройкиОформления.МакетОформления;
            Эл.Использование =Истина;
        ИначеЕсли Эл.Параметр = Новый ПараметрКомпоновкиДанных("АвтоПозицияРесурсов") Тогда
            Эл.Значение = АвтоПозицияРесурсовКомпоновкиДанных.НеИспользовать;
            Эл.Использование = Истина;
        КонецЕсли; 
    КонецЦикла;  

    // Ресурсы
    Для каждого Стр Из ТабНастройкиПолей Цикл
    	Если Стр.Ресурс Тогда
        	Эл                  = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
            Эл.ПутьКДанным      = Стр.Имя;
            Эл.Выражение        = "Сумма(" + Стр.Имя + ")";
        КонецЕсли; 
    КонецЦикла;  
    
    
    НоваяГруппировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
    ////ЭлементУсловногоОформления = НоваяГруппировка.УсловноеОформление.Элементы.Добавить();
    ////ЭлементУсловногоОформления.Использование = Истина;
    
    НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
    НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
    
    
    Для каждого ТекКолонка Из Результат.Колонки Цикл
        ВыбПоле = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
        ВыбПоле.Использование = Истина;
        Если ТекКолонка.Имя = ИмяКолонкиНПП Тогда
            ВыбПоле.Заголовок = "№ п/п";
        Иначе
            СтрокаОформления = ТабНастройкиПолей.Найти(ТекКолонка.Имя, "Имя");
            Если СтрокаОформления = Неопределено Тогда
                ВыбПоле.Заголовок = ТекКолонка.Заголовок;
            Иначе
                ВыбПоле.Заголовок   = СтрокаОформления.Заголовок;
            КонецЕсли; 
        КонецЕсли; 
        ВыбПоле.Поле = Новый ПолеКомпоновкиДанных(ТекКолонка.Имя);
    КонецЦикла;
    
    // СКД_СохранитьВФайл(СхемаКомпоновкиДанных, "C:\temp\схема.xml"); // Отладка с записью в файл
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(Макет, Новый Структура("Реестр", Результат), ДанныеРасшифровки);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    
    ТабДок = Новый ТабличныйДокумент;
    
    Если Заголовок <> Неопределено Тогда
        Макет = Новый ТабличныйДокумент;
        Обл = Макет.Область(2, 1, 2, 1);
        Обл.Текст = "" + Заголовок;
        Обл.Шрифт = Новый Шрифт(,,Истина);
        ТабДок.Вывести(Макет);
    КонецЕсли; 
    
    ПроцессорВывода.УстановитьДокумент(ТабДок);
    Если СгруппироватьСтроки  Тогда
        ТабДок.НачатьГруппуСтрок();
    КонецЕсли; 
    
    ПроцессорВывода.НачатьВывод();
    ЭлементРезультата = ПроцессорКомпоновки.Следующий();
    Пока НЕ ЭлементРезультата = Неопределено Цикл
        #Если Клиент Тогда
            ОбработкаПрерыванияПользователя();
        #КонецЕсли 
        ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
        Если ЭлементРезультата.ЗначенияПараметров.Количество() > 0 Тогда
            Для счКол = 1 по ТабДок.ШиринаТаблицы Цикл
                ТекРасшифровкаИдентификатор = ТабДок.Область(ТабДок.ВысотаТаблицы,счКол).Расшифровка;
                Попытка
                    ТабДок.Область(ТабДок.ВысотаТаблицы,счКол).Расшифровка = ДанныеРасшифровки.Элементы[ТекРасшифровкаИдентификатор].ПолучитьПоля()[0].Значение
                Исключение
                КонецПопытки; 
            КонецЦикла;
        КонецЕсли;
        ЭлементРезультата = ПроцессорКомпоновки.Следующий();
    КонецЦикла;
    ПроцессорВывода.ЗакончитьВывод();
    
    Если СгруппироватьСтроки  Тогда
        ТабДок.ЗакончитьГруппуСтрок();
    КонецЕсли;
    
    Если НастройкиОформления.Свойство("СкрытьШапку") Тогда
        ТабДок.УдалитьОбласть(
        ТабДок.Область(?(Заголовок <> Неопределено, 3, 1), 1, ТабДок.ФиксацияСверху, ТабДок.ШиринаСтраницы)
        , ТипСмещенияТабличногоДокумента.ПоВертикали);
    КонецЕсли; 

    Если СоздатьФорматСтрок Тогда
    	ТабДок.Область().СоздатьФорматСтрок();
    КонецЕсли; 
    
    ТабДок.ОтображатьСетку = Ложь;
    ТабДок.ТолькоПросмотр = Истина;
    Возврат ТабДок; 
КонецФункции

Процедура ТЗ_УдалитьДубликаты(ТЗ, Измерения) Экспорт
    Отбор = Новый Структура(Измерения);
    
    Ц = 0;
    Пока Ц < ТЗ.Количество() Цикл
        СтрокаТЗ = ТЗ[Ц];
        ЗаполнитьЗначенияСвойств(Отбор, СтрокаТЗ);
        Удалять = ТЗ.НайтиСтроки(Отбор).Количество() > 1;
        Если Удалять Тогда
            ТЗ.Удалить(Ц);
        Иначе
            Ц = Ц + 1;
        КонецЕсли; 
    КонецЦикла; 
КонецПроцедуры

Процедура ТЗ_ДобавитьСтроку(ТЗ
    , Значение1 = Неопределено
    , Значение2 = Неопределено
    , Значение3 = Неопределено
    , Значение4 = Неопределено
    , Значение5 = Неопределено
    , Значение6 = Неопределено
    , Значение7 = Неопределено
    , Значение8 = Неопределено
    , Значение9 = Неопределено) Экспорт
    
    М = Новый Массив;
    М.Добавить(Значение1);
    М.Добавить(Значение2);
    М.Добавить(Значение3);
    М.Добавить(Значение4);
    М.Добавить(Значение5);
    М.Добавить(Значение6);
    М.Добавить(Значение7);
    М.Добавить(Значение8);
    М.Добавить(Значение9);
    
    НовСтрока = ТЗ.Добавить();
    
    Для Счетчик = 1 По 9 Цикл
        Значение = М[Счетчик - 1];
        Если Значение = Неопределено ИЛИ ТЗ.Колонки.Количество() < Счетчик Тогда
            Прервать;
        КонецЕсли;
        ИмяКолонки = ТЗ.Колонки[Счетчик - 1].Имя;
        НовСтрока[ИмяКолонки] = Значение;
    КонецЦикла;
КонецПроцедуры

Функция   ТЗ_СвернутьСДопКолонками(ТЗ, Измерения, Ресурсы, ДопКолонки = Неопределено, ИсключаемыеДопКолонки = "") Экспорт
    струкИзмерения = Новый Структура(Измерения);
    струкРесурсы   = Новый Структура(Ресурсы);
    струкИсключаемыеДопКолонки = Новый Структура(ИсключаемыеДопКолонки);
    Если ДопКолонки = Неопределено Тогда
        ДопКолонки = "";
        Для каждого Колонка Из ТЗ.Колонки Цикл
            Если НЕ струкИзмерения.Свойство(Колонка.Имя)
                И НЕ струкРесурсы.Свойство(Колонка.Имя)
                И Не струкИсключаемыеДопКолонки.Свойство(Колонка.Имя)
                Тогда
                ДопКолонки = ДопКолонки + "," + Колонка.Имя;
            КонецЕсли; 
        КонецЦикла;
        ДопКолонки = Сред(ДопКолонки, 2);
    КонецЕсли; 
    струкДопКолонки = Новый Структура(ДопКолонки);
    
    СтрокаКолонокИзмеренийРесурсов = Сред(?(ЗначениеЗаполнено(Измерения), "," + Измерения, "")
    + ?(ЗначениеЗаполнено(Ресурсы), "," + Ресурсы, ""), 2);
    
    СтрокаКолонокВсех = Сред(
    ?(ЗначениеЗаполнено(СтрокаКолонокИзмеренийРесурсов), "," + СтрокаКолонокИзмеренийРесурсов, "")
    + ?(ЗначениеЗаполнено(ДопКолонки), "," + ДопКолонки, ""), 2);
    
    ТабРезультат = ТЗ.СкопироватьКолонки(СтрокаКолонокВсех);
    Для каждого КиЗ Из струкИсключаемыеДопКолонки Цикл
        Если ТабРезультат.Колонки.Найти(КиЗ.Ключ) <> Неопределено Тогда
            ТабРезультат.Колонки.Удалить(КиЗ.Ключ);
        КонецЕсли; 
    КонецЦикла; 
    
    Таб = ТЗ.Скопировать(, СтрокаКолонокИзмеренийРесурсов);
    Таб.Свернуть(Измерения, Ресурсы);
    
    Для каждого СтрокаТЗ Из Таб Цикл
        НовСтрока = ТабРезультат.Добавить();
        
        ЗаполнитьЗначенияСвойств(струкИзмерения, СтрокаТЗ);
        М = ТЗ.НайтиСтроки(струкИзмерения);
        Если М.Количество() > 0 Тогда
            СтрокаИсточник = М[0];
            ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаИсточник);	
        КонецЕсли; 
        
        ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЗ);
    КонецЦикла; 
    
    Возврат ТабРезультат;
КонецФункции

Процедура ТЗ_ВставитьТЗПоИзмерениямВДругую(ТЗ, ТЗПриемник, Отбор) Экспорт
    // Удалим старое
    М = ТЗПриемник.НайтиСтроки(Отбор);
    Для каждого СтрокаТЗ Из М Цикл
        ТЗПриемник.Удалить(СтрокаТЗ);
    КонецЦикла;
    
    // Добавим новое
    Для каждого СтрокаТЗ Из ТЗ Цикл
        ЗаполнитьЗначенияСвойств(ТЗПриемник.Добавить(), СтрокаТЗ);
    КонецЦикла; 
КонецПроцедуры

Процедура ТЗ_ВставитьСтрокиТаблицуВДругуюПоКлючевымРеквзитам(ТЗИсточник, ТЗПриемник
    , Измерения, Дополнить = Истина, УдалитьЛишнее = Ложь) Экспорт
    
    Отбор = Новый Структура(Измерения);
    Для каждого Стр Из ТЗИсточник Цикл
    	ЗаполнитьЗначенияСвойств(Отбор, Стр);
        М = ТЗПриемник.НайтиСтроки(Отбор);
        Если      М.Количество() = 0 Тогда
            Если НЕ Дополнить Тогда
            	Продолжить;
            КонецЕсли; 
            СтрокаПриемник = ТЗПриемник.Добавить();
            ЗаполнитьЗначенияСвойств(СтрокаПриемник, Отбор);
        ИначеЕсли М.Количество() > 1 Тогда
            СтрокаПриемник = М[0];
            Для Ц = 1 По М.Количество() - 1 Цикл
            	ТЗПриемник.Удалить(М[Ц]);
            КонецЦикла;             
        Иначе
            СтрокаПриемник = М[0];
        КонецЕсли; 
        ЗаполнитьЗначенияСвойств(СтрокаПриемник, Стр);
    КонецЦикла; 
    
    Если УдалитьЛишнее Тогда
    	Ц = 0;
        Пока Ц < ТЗПриемник.Количество() Цикл
        	Стр = ТЗПриемник[Ц];
            ЗаполнитьЗначенияСвойств(Отбор, Стр);
            М = ТЗИсточник.НайтиСтроки(Отбор);
            Если М.Количество() > 0 Тогда
            	Ц= Ц + 1;
            Иначе
                ТЗПриемник.Удалить(Ц);
            КонецЕсли; 
        КонецЦикла; 
    КонецЕсли; 
    
КонецПроцедуры

Функция   ТЗ_ПровестиСписаниеПоПартиям(ТабДляСписания, ТаблицаПартий, Измерения, Ресурс, КолонкиПартий, КолонкиСортировки = "") Экспорт
    ТЗ  = ИА_БФС.ТЗ_СвернутьСДопКолонками(ТабДляСписания, Измерения, Ресурс);
    ТЗ.Колонки.Добавить("__Списано"  , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(25, 8)));
    ТЗ.Колонки.Добавить("__НеХватает", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(25, 8)));
    
    СтрукКолонкиПартий = Новый Структура(КолонкиПартий);
    Для каждого КиЗ Из СтрукКолонкиПартий Цикл
        ТЗ.Колонки.Добавить(КиЗ.Ключ);
    КонецЦикла; 
    
    ТабРез = ТЗ.СкопироватьКолонки();
    
    ТабПартий = ТаблицаПартий.Скопировать();
    Если ЗначениеЗаполнено(КолонкиСортировки) Тогда
    	ТабПартий.Сортировать(КолонкиСортировки);
    КонецЕсли; 
    
    
    Отбор = Новый Структура(Измерения);
    Для каждого СтрокаСписания Из ТЗ Цикл
        ЗаполнитьЗначенияСвойств(Отбор, СтрокаСписания);
        М = ТабПартий.НайтиСтроки(Отбор);
        Если М.Количество() = 0 Тогда
            НовСтрока = ТабРез.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаСписания);
            НовСтрока.__НеХватает = СтрокаСписания[Ресурс];
        Иначе
            ОсталосьСписать = СтрокаСписания[Ресурс];
            
            Ц =  0;
            Пока ОсталосьСписать > 0 И Ц < М.Количество() Цикл
                СтрокаТЗ = М[Ц];
                Если СтрокаТЗ[Ресурс] > 0 Тогда
                    Списываем = Мин(СтрокаТЗ[Ресурс], ОсталосьСписать);
                    СтрокаТЗ[Ресурс] = СтрокаТЗ[Ресурс] - Списываем;
                    ОсталосьСписать = ОсталосьСписать - Списываем;
                    
                    НовСтрока = ТабРез.Добавить();
                    ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаСписания);
                    ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЗ, КолонкиПартий);
                    НовСтрока.__Списано   = Списываем;
                    НовСтрока.__НеХватает = 0;
                КонецЕсли; 
                Ц =  Ц + 1;
            КонецЦикла; 
            
            Если НовСтрока = Неопределено Тогда
				НовСтрока = ТабРез.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаСписания);
            КонецЕсли;
            НовСтрока.__НеХватает = ОсталосьСписать;
        КонецЕсли; 
    КонецЦикла; 
    Возврат ТабРез
КонецФункции

Функция   ТЗ_СтрокаТЗ2Структура(СтрокаТЗ) Экспорт
    Результат = Новый Структура;
    
    ТЗ = СтрокаТЗ.Владелец();
    Для каждого Колонка Из ТЗ.Колонки Цикл
        М = Колонка.ТипЗначения.Типы();
        Ц = 0;
        Пока Ц < М.Количество() Цикл
            Если М[Ц] = Тип("Null") Тогда
                М.Удалить(Ц);
            Иначе
                Ц = Ц + 1;
            КонецЕсли; 
        КонецЦикла; 
        
        ОписаниеТипа = Новый ОписаниеТипов(М); 
        ПустоеЗначение = ОписаниеТипа.ПривестиЗначение(Неопределено);
    	Результат.Вставить(Колонка.Имя, ПустоеЗначение);
    КонецЦикла; 
    
    ЗаполнитьЗначенияСвойств(Результат, СтрокаТЗ);
    Возврат Результат
КонецФункции

Функция   ТЗ_УдалитьПустыеТипы(ТЗ, ДобавитьПустойТипЕслиТиповНет = Ложь, ДляСтрокНеограниченнойДлиныЗадатьДлину = Ложь) Экспорт
    Результат = Новый ТаблицаЗначений;
	Для каждого Колонка Из ТЗ.Колонки Цикл
        М = Колонка.ТипЗначения.Типы();
        Если ДобавитьПустойТипЕслиТиповНет И М.Количество() = 0 Тогда
            ТипДанных = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150));
        Иначе
            Ц = 0;
            Пока Ц < М.Количество() Цикл
                Если М[Ц] = Тип("Null") Тогда
                    М.Удалить(Ц);
                Иначе
                    Ц = Ц + 1;
                КонецЕсли; 
            КонецЦикла; 
            
            ДлинаСтроки = Колонка.ТипЗначения.КвалификаторыСтроки.Длина;
            Если ДлинаСтроки = 0
                И ДляСтрокНеограниченнойДлиныЗадатьДлину
                И М.Найти(Тип("Строка")) <> Неопределено
                Тогда
                Для каждого СтрокаТЗ Из ТЗ Цикл
            	    ДлинаСтроки = Макс(ДлинаСтроки, СтрДлина(СтрокаТЗ[Колонка.Имя]));
                КонецЦикла;
                Если ДлинаСтроки = 0 Тогда
                	ДлинаСтроки = 1;
                КонецЕсли; 
            КонецЕсли; 
            ТипДанных = Новый ОписаниеТипов(М,,Новый КвалификаторыСтроки(ДлинаСтроки));
        КонецЕсли; 
        
        Результат.Колонки.Добавить(Колонка.Имя, ТипДанных);
    КонецЦикла; 
    
    Для каждого СтрокаТЗ Из ТЗ Цикл
    	ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрокаТЗ);
    КонецЦикла; 
    
    Возврат Результат;
КонецФункции

Функция   ТЗ_РазностьТаблиц(ТЗ1, ТЗ2, Измерения = "") Экспорт
    ИмяКолонки = "__Сравнение__";
    
    Если Измерения = "" Тогда
        Для каждого Колонка Из ТЗ1.Колонки Цикл
            Измерения = Измерения + ", " + Колонка.Имя;
        КонецЦикла; 
        Измерения = Сред(Измерения, 3);
    КонецЕсли; 
    
    Таб1 = ТЗ1.Скопировать();
    Таб1.Колонки.Добавить(ИмяКолонки);
    Таб1.ЗаполнитьЗначения(1, ИмяКолонки);
    
    
    Таб2 = ТЗ2.Скопировать();
    Таб2.Колонки.Добавить(ИмяКолонки);
    Таб2.ЗаполнитьЗначения(1, ИмяКолонки);
    
    Результат = ТЗ_Вычесть(Таб1, Таб2, Измерения, ИмяКолонки, Истина);
    Результат.Сортировать(Измерения);
    Возврат Результат;
КонецФункции

Функция   ТЗ_ПолучитьТипизированнуюТаблицу(ТЗ) Экспорт
    Таб = Новый ТаблицаЗначений;
    
    Для Ц = 1 По ТЗ.Количество() Цикл Таб.Добавить() КонецЦикла; 
    
    Для каждого Колонка Из ТЗ.Колонки Цикл
        МассивЗначений = ТЗ.ВыгрузитьКолонку(Колонка);
        
        // Получаем типы значений, которые используются в колонке
        Соответствие = Новый Соответствие;
        СтТипЗначения = ТипЗнч(Неопределено);
        Для каждого Значение Из МассивЗначений Цикл
            ТипЗначения = ТипЗнч(Значение);
            Если СтТипЗначения <> ТипЗначения Тогда
                СтТипЗначения = ТипЗначения;
                Соответствие.Вставить(ТипЗначения);
            КонецЕсли;
        КонецЦикла;
        
         // Преобразуем соответствие в массив типов значений
        МассивТипов = Новый Массив;
        Для каждого КлючИЗначение Из Соответствие Цикл
            МассивТипов.Добавить(КлючИЗначение.Ключ);
        КонецЦикла;
        
        Если МассивТипов.Количество() = 0 или МассивТипов.Количество() = 1 и МассивТипов[0] = ТипЗнч(Неопределено) Тогда
            ОпТипов = Новый ОписаниеТипов("Строка")
        Иначе
            ОпТипов = Новый ОписаниеТипов(МассивТипов);
        КонецЕсли;    
        Таб.Колонки.Добавить(Колонка.Имя, ОпТипов);
        Таб.ЗагрузитьКолонку(МассивЗначений, Колонка.Имя);
    КонецЦикла; 
    
    Возврат Таб
КонецФункции

Функция   ТЗ_ОтсортироватьПоДругойТЗ(ТЗДляСортировки, ТЗДляПорядкаСортировки, СтруктураКлючей) Экспорт
	ВремТЗ    = ТЗДляСортировки.Скопировать();
    Результат = ТЗДляСортировки.СкопироватьКолонки();
    Отбор = Новый Структура(СтруктураКлючей);
    Для каждого Стр Из ТЗДляПорядкаСортировки Цикл
        ЗаполнитьЗначенияСвойств(Отбор, Стр);
    	М = ВремТЗ.НайтиСтроки(Отбор);
        Для каждого СтрТЗ Из М Цикл
        	ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрТЗ);
            ВремТЗ.Удалить(СтрТЗ);
        КонецЦикла;        
    КонецЦикла;  
    
    Для каждого СтрТЗ Из ВремТЗ Цикл
    	ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрТЗ);
    КонецЦикла; 
    
    Возврат Результат;
КонецФункции

Процедура ТЗ_УдалитьТипыДанныхКолонок(ТЗ, ИменаКолонок = Неопределено) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ТЗ = Новый ТаблицаЗначений;
    #КОНЕЦЕСЛИ
    
    Если ИменаКолонок = Неопределено Тогда
        ИменаКолонок = "";
    	Для каждого Колонка Из ТЗ.Колонки Цикл
        	ИменаКолонок = ИменаКолонок + "," + Колонка.Имя;
        КонецЦикла; 
        ИменаКолонок = Сред(ИменаКолонок, 2);
    КонецЕсли; 
    
    СтрукКолонок = Новый Структура(ИменаКолонок);
    Для каждого КиЗ Из СтрукКолонок Цикл
        ИмяКолонки = КиЗ.Ключ;
        ИмяВремКолонки = "__ВРЕМ_" + ИмяКолонки;
        Колонка = ТЗ.Колонки[ИмяКолонки]; 
        ВремКолонка = ТЗ.Колонки.Вставить(ТЗ.Колонки.Индекс(Колонка), ИмяВремКолонки, , Колонка.Заголовок, Колонка.Ширина);
        МассивЗначений = ТЗ.ВыгрузитьКолонку(ИмяКолонки);
        ТЗ.ЗагрузитьКолонку(МассивЗначений, ВремКолонка);
        ТЗ.Колонки.Удалить(ИмяКолонки);
        ВремКолонка.Имя = ИмяКолонки;
    КонецЦикла; 
    
КонецПроцедуры

Функция   ТЗ_Свернуть(ТЗ, Измерения, КолонкиСумма = "", КолонкиМинимум = "", КолонкиМаксимум = "") Экспорт
	Результат = Новый ТаблицаЗначений;
    
    // Создадим колонки
    СтрукКолонок = Новый Структура(Измерения);
    Для каждого КиЗ Из СтрукКолонок Цикл
        Колонка = ТЗ.Колонки[КиЗ.Ключ];
    	Результат.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения, Колонка.Заголовок, Колонка.Ширина);
    КонецЦикла; 
    
    отЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(20, 10, ДопустимыйЗнак.Любой));
    
    СтрукКолонок = Новый Структура(КолонкиСумма
    + ?(ЗначениеЗаполнено(КолонкиМинимум),  "," + КолонкиМинимум, "")
    + ?(ЗначениеЗаполнено(КолонкиМаксимум), "," + КолонкиМаксимум, ""));
    Для каждого КиЗ Из СтрукКолонок Цикл
        Колонка = ТЗ.Колонки[КиЗ.Ключ];
        Результат.Колонки.Добавить(Колонка.Имя, отЧисло, Колонка.Заголовок, Колонка.Ширина);
    КонецЦикла; 
    
    ВремТЗ = ТЗ.Скопировать();
    ВремТЗ.Колонки.Добавить("__Сорт__");
    СтрукКолонокИзмерения = Новый Структура(Измерения);
    Для каждого Стр Из ВремТЗ Цикл
    	Стр.__Сорт__ = "";
        Для каждого КиЗ Из СтрукКолонокИзмерения Цикл
        	Если ИА_БФКС.РеквизитЕсть(Стр [КиЗ.Ключ] , "Ссылка") Тогда
            	Стр.__Сорт__ = Стр.__Сорт__ + "|" + Стр [КиЗ.Ключ].УникальныйИдентификатор();
            КонецЕсли; 
        КонецЦикла;  
    КонецЦикла;  
    
    ВремТЗ.Сортировать(Измерения + ?(ЗначениеЗаполнено(Измерения), ",", "") + " __Сорт__");
    ВремТЗ.Добавить();
    
    ПредСтрока = Новый Структура(Измерения);
    СтрукМин   = Неопределено;
    СтрукМакс  = Неопределено;
    СтрукСумма = Неопределено;
    НовСтрока  = Неопределено;
    
    Для каждого Стр Из ВремТЗ Цикл
        ТекСтрока = ИА_БФКС.Струк_Новый(Измерения, Стр);
        Если ИА_БФКС.Струк_Равны(ПредСтрока, ТекСтрока) Тогда
            Для каждого КиЗ Из СтрукМин Цикл
                ТекущееЗначение = Стр [КиЗ.Ключ];
            	Если КиЗ.Значение > ТекущееЗначение Тогда
                	СтрукМин.Вставить(КиЗ.Ключ, ТекущееЗначение);
                КонецЕсли; 
            КонецЦикла; 
            
            Для каждого КиЗ Из СтрукМакс Цикл
                ТекущееЗначение = Стр [КиЗ.Ключ];
            	Если КиЗ.Значение < ТекущееЗначение Тогда
                	СтрукМакс.Вставить(КиЗ.Ключ, ТекущееЗначение);
                КонецЕсли; 
            КонецЦикла; 
            
            Для каждого КиЗ Из СтрукСумма Цикл
                ТекущееЗначение = Стр [КиЗ.Ключ];
                СтрукСумма[КиЗ.Ключ] = СтрукСумма[КиЗ.Ключ] + ТекущееЗначение;
            КонецЦикла; 
        Иначе // Изменились "измерения", надо добавить строку
            Если НовСтрока <> Неопределено Тогда // Исключим первый вход
                ЗаполнитьЗначенияСвойств(НовСтрока, СтрукМин);
                ЗаполнитьЗначенияСвойств(НовСтрока, СтрукМакс);
                ЗаполнитьЗначенияСвойств(НовСтрока, СтрукСумма);
            КонецЕсли; 
            
            // Добавим в результат новую строку
            НовСтрока = Результат.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, Стр, Измерения);
            
            
            СтрукМин   = ИА_БФКС.Струк_Новый(КолонкиМинимум, Стр);
            СтрукМакс  = ИА_БФКС.Струк_Новый(КолонкиМаксимум, Стр);
            СтрукСумма = ИА_БФКС.Струк_Новый(КолонкиСумма, Стр);
            ПредСтрока = ТекСтрока;
        КонецЕсли; 
    КонецЦикла; 
    
    Возврат Результат;
КонецФункции

Функция   ТЗ_ПреобразоватьВСтруктуру(ТЗ, ИмяПоляКлюч, ИмяПоляЗначение = Неопределено) Экспорт
	Результат = Новый Структура;
    
    ИменаКолонокЗначений = "";
    Если ИмяПоляЗначение = Неопределено Тогда
        Для каждого Колонка Из ТЗ.Колонки Цикл
            ИменаКолонокЗначений = ИменаКолонокЗначений + "," + Колонка.Имя;
        КонецЦикла; 
        ИменаКолонокЗначений = Сред(ИменаКолонокЗначений, 2);
    КонецЕсли;
    
    Для каждого Стр Из ТЗ Цикл        
        Если ИмяПоляЗначение = Неопределено Тогда
        	Значение = Новый Структура(ИменаКолонокЗначений);
            ЗаполнитьЗначенияСвойств(Значение, Стр);
        Иначе
            Значение = Стр [ИмяПоляЗначение];
        КонецЕсли; 
    	Результат.Вставить(Стр[ИмяПоляКлюч], Значение);
    КонецЦикла;  
    
    Возврат Результат;
КонецФункции

Функция   ТЗ_РаспределитьСумму(ТЗ, ИмяКолонкиБазы, СуммаКРаспределению, ЗнаковПослеЗапятой = 2, ИмяКолонкиРезультат = "__Сумма") Экспорт
    
    отЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(20, ЗнаковПослеЗапятой));
    
	Таб = ТЗ.Скопировать();
    Таб.Колонки.Добавить(ИмяКолонкиРезультат, отЧисло);
    
    СуммаНакопленная        = 0;
    МаксЗначение            = 0;
    МаксЗначениеИндекс      = 0;
    Счетчик                 = 0;
    
    
    База = Таб.Итог(ИмяКолонкиБазы);
    Для каждого Стр Из Таб Цикл
        ЗначениеПоМодулю = Макс (Стр [ИмяКолонкиБазы], -Стр [ИмяКолонкиБазы]);
        
        Если ЗначениеПоМодулю > МаксЗначение Тогда
        	МаксЗначение       = ЗначениеПоМодулю;
            МаксЗначениеИндекс = Счетчик;
        КонецЕсли; 
        
        Если База = 0 Тогда
        	Доля = 0;
        Иначе
            Доля = Стр [ИмяКолонкиБазы] / База;
        КонецЕсли; 
    	
        Стр [ИмяКолонкиРезультат]  = СуммаКРаспределению * Доля;
        СуммаНакопленная = СуммаНакопленная + Стр [ИмяКолонкиРезультат];
        Счетчик = Счетчик + 1;
    КонецЦикла;  
    
    Дельта = СуммаКРаспределению - СуммаНакопленная;
    Если Дельта <> 0 Тогда
        Стр                         = Таб[МаксЗначениеИндекс];
        ЗначениеКорректировки       = Стр[ИмяКолонкиРезультат] + Дельта;
        Стр[ИмяКолонкиРезультат]    = ЗначениеКорректировки;
    КонецЕсли; 
    
    Возврат Таб;
КонецФункции

Функция   ТЗ_НайтиСтроку(ТЗ, Значение, Колонки = Неопределено, НеопределеноЕслиНеНайдено = Ложь) Экспорт
    ВремТаб = ТЗ.СкопироватьКолонки();
    НайдСтрока = Неопределено;
    
    Если ТипЗнч(Значение) = Тип("Структура") И Колонки = Неопределено Тогда        
        М = ТЗ.НайтиСтроки(Значение);
        Если М.Количество() >  0 Тогда
            НайдСтрока = М [0];
        КонецЕсли; 
    Иначе
        НайдСтрока = ТЗ.Найти(Значение, Колонки);
    КонецЕсли; 
    Если НайдСтрока <> Неопределено Тогда
        НовСтрока = ВремТаб.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, НайдСтрока);
    КонецЕсли; 
    
    Если ВремТаб.Количество() = 0 Тогда
        Если НеопределеноЕслиНеНайдено Тогда
            Возврат Неопределено;
        Иначе
            ВремТаб.Добавить();
        КонецЕсли; 
    КонецЕсли; 
    
    СтрокаТЗ = ВремТаб[0]; 
    Результат = Новый Структура;
    Для каждого Колонка Из ВремТаб.Колонки Цикл
        Результат.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
    КонецЦикла;  
    Возврат Результат;
КонецФункции

Функция   ТЗ_СгруппироватьСДеталями(ТЗ, Измерения, КолонкиСумма = "", ИмяКолонкиДетали = "__Детали") Экспорт
    ВсеКолонки = Измерения + ?(КолонкиСумма = "", "", ", " + КолонкиСумма);
	Результат = ТЗ.Скопировать(, ВсеКолонки);
    Результат.Свернуть(Измерения, КолонкиСумма);
    Результат.Колонки.Добавить(ИмяКолонкиДетали);
    
    Отбор = Новый Структура(Измерения);
    Для каждого Стр Из Результат Цикл
    	ЗаполнитьЗначенияСвойств(Отбор, Стр);
        Стр[ИмяКолонкиДетали] = ИА_БФС.ТЗ_ФильтрПоОтбору(ТЗ, Отбор);
    КонецЦикла;  
    
    Возврат Результат;
КонецФункции

////#КонецОбласти 

//_____________________________________________________________
////#Область Таблицы_значений_фиктивные

Функция   ТЗФ_Создать(ТЗ) Экспорт
    СтруктураКолонок = "";
    Для каждого Колонка Из ТЗ.Колонки Цикл
        СтруктураКолонок = СтруктураКолонок + ", " + Колонка.Имя;
    КонецЦикла; 
    СтруктураКолонок = Сред(СтруктураКолонок, 3);
    
    Результат = Новый Массив;
    Для каждого СтрокаТЗ Из ТЗ Цикл
        Эл = Новый Структура(СтруктураКолонок);
        ЗаполнитьЗначенияСвойств(Эл, СтрокаТЗ);
        Результат.Добавить(Эл);
    КонецЦикла; 
    
    Возврат Результат;
КонецФункции

Функция   ТЗФ_ПолучитьТЗ(ТЗФ) Экспорт
    Результат = Новый ТаблицаЗначений;
    Если ТЗФ.Количество() > 0 Тогда
        СтруктураКолонок = ТЗФ[0];
        
        Для каждого КиЗ Из ТЗФ[0] Цикл
            Результат.Колонки.Добавить(КиЗ.Ключ);
        КонецЦикла; 
        
        Для каждого СтрокаТЗФ Из ТЗФ Цикл
            ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрокаТЗФ);
        КонецЦикла; 
    КонецЕсли;
    
    Возврат Результат;
КонецФункции

Функция   ТЗФ2ТЗ(ТЗФ) Экспорт
    Возврат ТЗФ_ПолучитьТЗ(ТЗФ);
КонецФункции
 
Функция   ТЗ2ТЗФ(ТЗ) Экспорт
    Возврат ТЗФ_Создать(ТЗ);
КонецФункции

Функция   ТЗФ_ВывестиВТабДок(ТЗФ) Экспорт
    ТЗ = ТЗФ2ТЗ(ТЗФ);
    ТабДок = ТЗ_ВывестиВТабДок(ТЗ);
    Возврат ТабДок;
КонецФункции

////#КонецОбласти 

//_____________________________________________________________
////#Область ДеревоЗначений

Функция   ДЗ2ДЗФ(ДЗ) Экспорт
    // Массив из структур: <Строки> - массив, ссылка на ветку, <НаименованиеКолонок>
    Результат = Новый Структура("Колонки, Строки", Новый Структура, Новый Массив);
    
    ИменаКолонок = "";
    Для каждого Колонка Из ДЗ.Колонки Цикл
    	ИменаКолонок = ИменаКолонок + "," + Колонка.Имя;
        Результат.Колонки.Вставить(Колонка.Имя, Колонка.ТипЗначения);
    КонецЦикла; 
    ИменаКолонок = Сред(ИменаКолонок, 2);
    
    Результат.Строки = ДЗ2ДЗФ_Итератор(ИменаКолонок, ДЗ.Строки);
    
    Возврат Результат;
КонецФункции

Функция   ДЗ2ДЗФ_Итератор(ИменаКолонок, СтрокиДерева)
    М = Новый Массив;
	Для каждого Стр Из СтрокиДерева Цикл
    	Данные = Новый Структура(ИменаКолонок);
        ЗаполнитьЗначенияСвойств(Данные, Стр);
        
      	Ветки = ДЗ2ДЗФ_Итератор(ИменаКолонок, Стр.Строки);
        Данные.Вставить("Строки", Ветки);
        
        М.Добавить(Данные);
    КонецЦикла; 
    Возврат М;
КонецФункции

Функция   ДЗФ2ДЗ(ДЗФ) Экспорт
	ДЗ = Новый ДеревоЗначений;
    Для каждого КиЗ Из ДЗФ.Колонки Цикл
    	ДЗ.Колонки.Добавить(КиЗ.Ключ, КиЗ.Значение);
    КонецЦикла; 
    ДЗФ2ДЗ_Итератор(ДЗ.Строки, ДЗФ.Строки);
    Возврат ДЗ;
КонецФункции

Процедура ДЗФ2ДЗ_Итератор(ДЗСтроки, Ветки)
    Для каждого Ветвь Из Ветки Цикл
        Ветка = ДЗСтроки.Добавить();
        ЗаполнитьЗначенияСвойств(Ветка, Ветвь); 
        ДЗФ2ДЗ_Итератор(Ветка.Строки, Ветвь.Строки);
    КонецЦикла;	
КонецПроцедуры

Функция   ДЗ2ТЗ(ДеревоЗначений) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ДеревоЗначений = Новый ДеревоЗначений;
    #КОНЕЦЕСЛИ
    
    Результат = Новый ТаблицаЗначений;
    Для каждого Колонка Из ДеревоЗначений.Колонки Цикл
    	Результат.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения, Колонка.Заголовок, Колонка.Ширина);
    КонецЦикла; 
    
    Результат.Колонки.Добавить("ДеревоИдентификаторСтроки",   Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
    Результат.Колонки.Добавить("ДеревоИдентификаторРодителя", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
    
    ДЗ2ТЗ_Итератор(ДеревоЗначений.Строки, Результат, "");
    
    Возврат Результат
КонецФункции

Процедура ДЗ2ТЗ_Итератор(СтрокиДерева, ТЗ, ИДРодителя)
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        СтрокиДерева = Новый ДеревоЗначений; СтрокиДерева = СтрокиДерева.Строки;
    #КОНЕЦЕСЛИ
    
    Для каждого Стр Из СтрокиДерева Цикл
        НовСтрока                       = ТЗ.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
        НовСтрока.ДеревоИдентификаторСтроки   = ИА_БФКС.СформироватьУИД();
        НовСтрока.ДеревоИдентификаторРодителя = ИДРодителя; 
        ДЗ2ТЗ_Итератор(Стр.Строки, ТЗ, НовСтрока.ДеревоИдентификаторСтроки)
    КонецЦикла; 
КонецПроцедуры

Функция   ТЗ2ДЗ(ТЗ, ИсходноеДерево = Неопределено, ПростаяКонвертация = Ложь) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ТЗ = Новый ТаблицаЗначений;
    #КОНЕЦЕСЛИ
    
    Если ИсходноеДерево = Неопределено Тогда
        Результат = Новый ДеревоЗначений;
        СписокИсключенных = ИА_БФКС.Массив_Новый(ВРЕГ("ДеревоИдентификаторСтроки"), ВРЕГ("ДеревоИдентификаторРодителя"));
        Для каждого Колонка Из ТЗ.Колонки Цикл
            Если НЕ ИА_БФКС.Массив_Содержит(СписокИсключенных, ВРЕГ(Колонка.Имя)) Тогда
                Результат.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения, Колонка.Заголовок, Колонка.Ширина);
            КонецЕсли; 
        КонецЦикла; 
    Иначе
        Результат = ИсходноеДерево;
        Результат.Строки.Очистить();
    КонецЕсли; 
    
    Если ПростаяКонвертация Тогда
        // Перенесём строки ТЗ в строки ДЗ без иерархии
        Для каждого Стр Из ТЗ Цикл
        	НовСтрока = Результат.Строки.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
        КонецЦикла;  
    Иначе
    	ТЗ2ДЗ_Итератор(ТЗ, Результат.Строки, "");
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции

Процедура ТЗ2ДЗ_Итератор(ТЗ, СтрокиДерева, ИДРодителя)
    М = ТЗ.НайтиСтроки(Новый Структура("ДеревоИдентификаторРодителя", ИДРодителя));
    
    Для каждого Стр Из М Цикл
    	НовСтрока = СтрокиДерева.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
        ТЗ2ДЗ_Итератор(ТЗ, НовСтрока.Строки, Стр.ДеревоИдентификаторСтроки)
    КонецЦикла; 
    
КонецПроцедуры
 
  
////#КонецОбласти 

//_____________________________________________________________
////#Область УниверсальныйОтчет

Процедура УО_УстановитьИспользование(Строки, ИменаДляВключения) Экспорт
    Имена = Врег("/" + ИменаДляВключения + "/");
    Для каждого Строка Из Строки Цикл
        ЭтоРазрешеннаяСтрока =  Найти(Имена, "/" + Врег(Строка.Имя) + "/");
        Строка.Использование = ЭтоРазрешеннаяСтрока;
        УО_УстановитьИспользование(Строка.Строки, ИменаДляВключения);
    КонецЦикла; 
КонецПроцедуры

////#КонецОбласти 

//_____________________________________________________________
////#Область РаботаСОбъектамиМетаданных

Функция   МД_ПолучитьРегистраторов(НаборЗаписей, ТолькоСПроведением = Ложь) Экспорт
    Результат = Новый Массив;
    Для Ц = 0 по НаборЗаписей.Отбор.Регистратор.ТипЗначения.Типы().Количество() - 1 цикл
        Тип = НаборЗаписей.Отбор.Регистратор.ТипЗначения.Типы()[Ц];
        МД = Метаданные.НайтиПоТипу(Тип);
        Если МД <> Неопределено тогда
            Если НЕ ТолькоСПроведением
                ИЛИ 
                МД.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
                Результат.Добавить(МД);
            КонецЕсли; 
        КонецЕсли;
    КонецЦикла;
    Возврат Результат;
КонецФункции

Функция   Перечисление_Имя(ЗначениеПеречисления) Экспорт
    ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
    ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
    ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
    Возврат ИмяЗначенияПеречисления;
КонецФункции
 
////#КонецОбласти

//_____________________________________________________________
////#Область Типы

Функция   Типы_ОписаниеТипов2ТаблицаСтроковыхТипов(ОписаниеТипов) Экспорт
    Таб = ТЗ_НоваяТаблицаЗначений(Новый Структура("Имя, ИмяДляЗапроса, МенеджерМД, ИмяМД, Ссылочный"
    , Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1024))
    , Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1024))
    , Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1024))
    , Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1024))
    , Новый ОписаниеТипов("Булево")));
    
    Если ОписаниеТипов.СодержитТип(Тип("Булево")) Тогда
        ТЗ_ДобавитьСтроку(Таб, "Булево");
    КонецЕсли; 
    
    Если ОписаниеТипов.СодержитТип(Тип("Строка")) Тогда
        ТЗ_ДобавитьСтроку(Таб, "Строка");
    КонецЕсли; 
    
    Если ОписаниеТипов.СодержитТип(Тип("Число")) Тогда
        ТЗ_ДобавитьСтроку(Таб, "Число");
    КонецЕсли; 
    
    Если ОписаниеТипов.СодержитТип(Тип("Дата")) Тогда
        ТЗ_ДобавитьСтроку(Таб, "Дата");
    КонецЕсли; 
    
    Если ОписаниеТипов.СодержитТип(Тип("ТаблицаЗначений")) Тогда
        ТЗ_ДобавитьСтроку(Таб, "ТаблицаЗначений");
    КонецЕсли; 
    
    Для каждого ЭлМД из Метаданные.Справочники Цикл
        Имя = "СправочникСсылка." + ЭлМД.Имя;
        Если ОписаниеТипов.СодержитТип(Тип(Имя))  Тогда
            ТЗ_ДобавитьСтроку(Таб, Имя, "Справочник." + ЭлМД.Имя, "Справочники", ЭлМД.Имя, Истина);
        КонецЕсли;
    КонецЦикла;
    
    Для каждого ЭлМД из Метаданные.Документы Цикл
        Имя = "ДокументСсылка." + ЭлМД.Имя;
        Если ОписаниеТипов.СодержитТип(Тип(Имя)) Тогда
            ТЗ_ДобавитьСтроку(Таб, Имя, "Документ." + ЭлМД.Имя, "Документы", ЭлМД.Имя, Истина);
        КонецЕсли;
    КонецЦикла;
    
    Для каждого ЭлМД из Метаданные.Перечисления Цикл
        Имя = "ПеречислениеСсылка." + ЭлМД.Имя;
        Если ОписаниеТипов.СодержитТип(Тип(Имя)) Тогда
            НС = Таб.Добавить(); НС.Имя = Имя;
            ТЗ_ДобавитьСтроку(Таб, Имя, "Перечисление." + ЭлМД.Имя, "Перечисления", ЭлМД.Имя, Истина);
        КонецЕсли;
    КонецЦикла;
    
    Для каждого ЭлМД из Метаданные.ПланыВидовХарактеристик Цикл
        Имя = "ПланВидовХарактеристикСсылка." + ЭлМД.Имя;
        Если ОписаниеТипов.СодержитТип(Тип(Имя)) Тогда
            ТЗ_ДобавитьСтроку(Таб, Имя, "ПланВидовХарактеристик." + ЭлМД.Имя, "ПланыВидовХарактеристик", ЭлМД.Имя, Истина);
        КонецЕсли;
    КонецЦикла;
    
    Для каждого ЭлМД из Метаданные.ПланыВидовРасчета Цикл
        Имя = "ПланВидовРасчетаСсылка." + ЭлМД.Имя;
        Если ОписаниеТипов.СодержитТип(Тип(Имя)) Тогда
            ТЗ_ДобавитьСтроку(Таб, Имя, "ПланВидовРасчета." + ЭлМД.Имя, "ПланыВидовРасчета", ЭлМД.Имя, Истина);
        КонецЕсли;
    КонецЦикла;
    
    Для каждого ЭлМД из Метаданные.ПланыСчетов Цикл
        Имя = "ПланСчетовСсылка." + ЭлМД.Имя;
        Если ОписаниеТипов.СодержитТип(Тип(Имя)) Тогда
            ТЗ_ДобавитьСтроку(Таб, Имя, "ПланСчетов." + ЭлМД.Имя, "ПланыСчетов", ЭлМД.Имя, Истина);
        КонецЕсли;
    КонецЦикла;
    
    Для каждого ЭлМД из Метаданные.БизнесПроцессы Цикл
        Имя = "БизнесПроцессСсылка." + ЭлМД.Имя;
        Если ОписаниеТипов.СодержитТип(Тип(Имя)) Тогда
            ТЗ_ДобавитьСтроку(Таб, Имя, "БизнесПроцесс." + ЭлМД.Имя, "БизнесПроцессы", ЭлМД.Имя, Истина);
        КонецЕсли;
    КонецЦикла;
    
    Для каждого ЭлМД из Метаданные.Задачи Цикл
        Имя = "ЗадачаСсылка." + ЭлМД.Имя;
        Если ОписаниеТипов.СодержитТип(Тип(Имя)) Тогда
            ТЗ_ДобавитьСтроку(Таб, Имя, "Задача." + ЭлМД.Имя, "Задачи", ЭлМД.Имя, Истина);
        КонецЕсли;
    КонецЦикла;
    
    Для каждого ЭлМД из Метаданные.ПланыОбмена Цикл
        Имя = "ПланОбменаСсылка." + ЭлМД.Имя;
        Если ОписаниеТипов.СодержитТип(Тип(Имя)) Тогда
            ТЗ_ДобавитьСтроку(Таб, Имя, "ПланОбмена." + ЭлМД.Имя, "ПланыОбмена", ЭлМД.Имя, Истина);
        КонецЕсли;
    КонецЦикла;
    
    Возврат Таб;
КонецФункции


Функция   Типы_ТаблицаСтроковыхТипов2ОписаниеТипов(Таблица) Экспорт
    М = Новый Массив;
    Для каждого СтрокаТЗ Из Таблица Цикл
        М.Добавить(Тип(СтрокаТЗ.Имя));
    КонецЦикла; 
    
    Результат = Новый ОписаниеТипов(М);
    Возврат Результат;
КонецФункции

////#КонецОбласти

//_____________________________________________________________
////#Область Кэш

Процедура Кэш_Вставить(Кэш, СтруктураКлючей, Значение) Экспорт
    Если Кэш = Неопределено Тогда
        Кэш = ТЗ_НоваяТаблицаЗначений("__Значение__");
        Для каждого КиЗ Из СтруктураКлючей Цикл
            Кэш.Колонки.Добавить(КиЗ.Ключ);
        КонецЦикла;
    КонецЕсли; 
    
    М = Кэш.НайтиСтроки(СтруктураКлючей);
    КоличествоСтрок = М.Количество();
    Если КоличествоСтрок = 1 Тогда
        СтрокаКэша = М[0];
    ИначеЕсли КоличествоСтрок = 0 Тогда
        СтрокаКэша = Кэш.Добавить();
        ЗаполнитьЗначенияСвойств(СтрокаКэша, СтруктураКлючей);
    ИначеЕсли КоличествоСтрок > 1 Тогда
        // Удалим дубли
        Для Ц = 1 По КоличествоСтрок - 1 Цикл
            СтрокаКэша = М[Ц];
            Кэш.Удалить(СтрокаКэша);
        КонецЦикла; 
        СтрокаКэша = М[0];
    КонецЕсли; 
    
    СтрокаКэша.__Значение__ = Значение;
КонецПроцедуры

Функция   Кэш_Получить(Кэш, СтруктураКлючей, ЗначениеЕслиНеНайдено = Неопределено) Экспорт
    Если Кэш = Неопределено Тогда
        Возврат ЗначениеЕслиНеНайдено;
    КонецЕсли; 
    
    М = Кэш.НайтиСтроки(СтруктураКлючей);
    Если М.Количество() = 0 Тогда
        Возврат ЗначениеЕслиНеНайдено;
    Иначе
        Возврат М[0].__Значение__;
    КонецЕсли; 
КонецФункции

Функция   Кэш_СформироватьИзТЗ(ТЗ, СтруктураКлючей, ИмяПоляЗначения = "Значение", Оптимизировать = Ложь) Экспорт
    Кэш = ТЗ_НоваяТаблицаЗначений("__Значение__");
    Для каждого КиЗ Из СтруктураКлючей Цикл
        Кэш.Колонки.Добавить(КиЗ.Ключ);
    КонецЦикла;
    
    Для каждого Стр Из ТЗ Цикл
        НовСтрока = Кэш.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
        
        Если ИмяПоляЗначения = Истина Тогда
        	НовСтрока.__Значение__ = ТЗ_СтрокаТЗ2Структура(Стр);
        Иначе
            НовСтрока.__Значение__ = Стр[ИмяПоляЗначения];
        КонецЕсли; 
    КонецЦикла;
    
    Если Оптимизировать Тогда
    	Кэш_Оптимизация(Кэш);
    КонецЕсли; 
    
    Возврат Кэш
КонецФункции

Процедура Кэш_Оптимизация(Кэш, Оптимизировать = Истина) Экспорт
    Если Кэш <> Неопределено Тогда
        Если Оптимизировать  Тогда
            ИменаКлючей = "";
            Для каждого Колонка Из Кэш.Колонки Цикл
                Если Колонка.Имя <> "__Значение__" Тогда
                    ИменаКлючей = ИменаКлючей + ", " + Колонка.Имя;
                КонецЕсли;         	
            КонецЦикла;
            ИменаКлючей  = Сред(ИменаКлючей, 3);
            Кэш.Индексы.Добавить(ИменаКлючей);
        Иначе
            Кэш.Индексы.Очистить();
        КонецЕсли; 
    КонецЕсли;
КонецПроцедуры

////#КонецОбласти 

//_____________________________________________________________
////#Область Excel 

Функция   Excel_ЗагрузитьФайлВТЗ(ИмяФайла, НомерЛиста = 1, ЗадатьТипСтрока = Ложь, ИспользоватьФайлКэша = Ложь) Экспорт
    Данные = ИА_БФКС.Excel_ЗагрузитьФайлВТЗФ(ИмяФайла, НомерЛиста, ЗадатьТипСтрока, ИспользоватьФайлКэша);
    Данные.Таб = ИА_БФС.ТЗФ2ТЗ(Данные.Таб);
    Возврат Данные;
КонецФункции	

////#КонецОбласти 

//_____________________________________________________________
////#Область ОтборСКД

Функция   ОтборСКД_ПолучитьДанные(ВыбранноеЗначение) Экспорт
    Данные = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.ДанныеНастроек);
    Возврат Данные;
КонецФункции

Функция   ОтборСКД_Выполнить(ДанныеНастроекИлиАдрес, ПараметрыВыполнения = Неопределено) Экспорт
    Если ТипЗнч(ДанныеНастроекИлиАдрес) = Тип("Строка") Тогда
        ДанныеНастроек = ПолучитьИзВременногоХранилища(ДанныеНастроекИлиАдрес);
    Иначе
        ДанныеНастроек = ДанныеНастроекИлиАдрес;
    КонецЕсли; 
    
    СхемаКомпоновкиДанных = ДанныеНастроек.СКД;
    Настройки = ДанныеНастроек.Настройки;
    Если Настройки = Неопределено Тогда
        Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
    КонецЕсли; 
    Если ПараметрыВыполнения <> Неопределено Тогда
        Если ПараметрыВыполнения.Свойство("ПараметрыДанных") Тогда
            Для каждого КиЗ Из ПараметрыВыполнения.ПараметрыДанных Цикл
                Эл = СхемаКомпоновкиДанных.Параметры.Найти(КиЗ.Ключ);
                Если Эл <> Неопределено Тогда
                	Эл.Значение = КиЗ.Значение;
                КонецЕсли; 
            КонецЦикла; 
        КонецЕсли; 
    КонецЕсли; 
    
    //создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
    КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
    КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
    КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
    КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
    
    
    //Формируем макет, с помощью компоновщика макета
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    //Передаем в макет компоновки схему, настройки и данные расшифровки
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки
    ,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    
    //Выполним компоновку с помощью процессора компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
    Возврат Результат;
КонецФункции

////#КонецОбласти 

//_____________________________________________________________
////#Область Запросы

Функция   Запрос_Выполнить(ТекстЗапроса, СтруктураПараметров = Неопределено) Экспорт
    Запрос = Новый Запрос(ТекстЗапроса);
    Если СтруктураПараметров <> Неопределено Тогда
        Для каждого КиЗ Из СтруктураПараметров Цикл
            Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);	
        КонецЦикла; 
    КонецЕсли; 
    Результат = Запрос.Выполнить();
    Возврат Результат;
КонецФункции

Функция   Запрос_ВыполнитьПакет(ТекстЗапроса, СтруктураПараметров = Неопределено) Экспорт
    Запрос = Новый Запрос(ТекстЗапроса);
    Если СтруктураПараметров <> Неопределено Тогда
        Для каждого КиЗ Из СтруктураПараметров Цикл
            Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);	
        КонецЦикла; 
    КонецЕсли; 
    Результат = Запрос.ВыполнитьПакет();
    Возврат Результат;
КонецФункции

Функция   Запрос_ВыполнитьПакетСИменами(ТекстЗапроса
    , СтруктураПараметров = Неопределено
    , ВыгрузитьВТЗ = Ложь
    , УдалятьПустыеТипы = Истина) Экспорт
    
    Маркер = "БФ_ИмяТаб";
    Запрос = Новый Запрос(ТекстЗапроса);
    Если СтруктураПараметров <> Неопределено Тогда
        Для каждого КиЗ Из СтруктураПараметров Цикл
            Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);	
        КонецЦикла; 
    КонецЕсли; 
    
    ТабИмен = ТЗ_НоваяТаблицаЗначений("Номер, Имя");
    МассивЗапросов = иа_бфкс.Строка2Массив(ТекстЗапроса + ";", ";", """");
    
    НомерЗапроса = 0;
    Для каждого ТекстПодзапроса Из МассивЗапросов Цикл                
        ПозицияИмени = Найти(Врег(ТекстПодзапроса), Врег(" КАК " + Маркер));
    	Если ПозицияИмени > 0 Тогда
        	// "" как БФ_ИмяТаб 
            Счетчик             = ПозицияИмени;
            ПозицияНачала       = 0;
            ПозицияКонца        = 0;
            
            Пока Счетчик >= 0 Цикл
                Если Сред(ТекстПодзапроса, Счетчик, 1) = """" Тогда
                	Если ПозицияКонца = 0 Тогда
                    	ПозицияКонца  = Счетчик;
                    Иначе
                        ПозицияНачала = Счетчик + 1;
                        Прервать;
                    КонецЕсли; 
                КонецЕсли; 
                
            	Счетчик = Счетчик - 1;
            КонецЦикла; 
            
            ИмяТаблицы = Сред(ТекстПодзапроса, ПозицияНачала, ПозицияКонца - ПозицияНачала);
            
            НовСтрока = ТабИмен.Добавить();
            НовСтрока.Номер = НомерЗапроса;
            НовСтрока.Имя   = ИмяТаблицы;
        КонецЕсли; 
        НомерЗапроса = НомерЗапроса + 1;
    КонецЦикла;  
    
    Пакет = Запрос.ВыполнитьПакет();
    
    Результат = Новый Структура;
    Для каждого Стр Из ТабИмен Цикл
        Данные = Пакет[Стр.Номер];
        
        Если ВыгрузитьВТЗ Тогда
        	Данные = Данные.Выгрузить();
            
            Если УдалятьПустыеТипы Тогда
    	        Данные = ТЗ_УдалитьПустыеТипы(Данные);
            КонецЕсли; 
        КонецЕсли; 
        
    	Результат.Вставить(Стр.Имя, Данные);
    КонецЦикла;  
    
    Возврат Результат;
КонецФункции



Функция   Запрос_ВыполнитьСкалярный(ТекстЗапроса, СтруктураПараметров = Неопределено, ИмяПоля = "Результат", ЗначениеПоУмолчанию = Неопределено) Экспорт
    Результат = ЗначениеПоУмолчанию;
    Запрос = Новый Запрос(ТекстЗапроса);
    
    Если СтруктураПараметров <> Неопределено Тогда
        Для каждого КиЗ Из СтруктураПараметров Цикл
            Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);	
        КонецЦикла; 
    КонецЕсли; 
    
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    Если Выборка.Следующий() Тогда
        Результат = Выборка[ИмяПоля];
    Иначе
        ТЗ = РезультатЗапроса.Выгрузить();
        ТЗ = ТЗ_УдалитьПустыеТипы(ТЗ);
        Результат = ТЗ.Добавить().Результат;
    КонецЕсли; 
    Возврат Результат;
КонецФункции

Функция   Запрос_ВыполнитьВСтруктуру(ТекстЗапроса, СтруктураПараметров= Неопределено) Экспорт
    Результат = Новый Структура;
    Запрос = Новый Запрос(ТекстЗапроса);
    
    Если СтруктураПараметров <> Неопределено Тогда
        Для каждого КиЗ Из СтруктураПараметров Цикл
            Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);	
        КонецЦикла; 
    КонецЕсли;
    
    РезультатЗапроса = Запрос.Выполнить();
    Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
        М = Колонка.ТипЗначения.Типы();
        Ц = 0;
        Пока Ц < М.Количество() Цикл
            Если М[Ц] = Тип("Null") Тогда
                М.Удалить(Ц);
            Иначе
                Ц = Ц + 1;
            КонецЕсли; 
        КонецЦикла; 
        
        ОписаниеТипа = Новый ОписаниеТипов(М); 
        ПустоеЗначение = ОписаниеТипа.ПривестиЗначение(Неопределено);
    	Результат.Вставить(Колонка.Имя, ПустоеЗначение);
    КонецЦикла; 
    
    Если НЕ РезультатЗапроса.Пустой() Тогда
        Выборка = РезультатЗапроса.Выбрать();
        Выборка.Следующий();
        ЗаполнитьЗначенияСвойств(Результат, Выборка);
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции

Функция   Запрос_ВыполнитьВТЗ(ТекстЗапроса, СтруктураПараметров = Неопределено, УдалятьПустыеТипы = Истина) Экспорт
    Результат = Новый Структура;
    Запрос = Новый Запрос(ТекстЗапроса);
    Если СтруктураПараметров <> Неопределено Тогда
        Для каждого КиЗ Из СтруктураПараметров Цикл
            Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);	
        КонецЦикла; 
    КонецЕсли; 
    
    Результат = Запрос.Выполнить().Выгрузить();
    
    Если УдалятьПустыеТипы Тогда
    	Результат = ТЗ_УдалитьПустыеТипы(Результат);
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции

////#КонецОбласти 

//_____________________________________________________________
//#Область Функции для работы с "ЗначениеВФайл" на "тонком клиенте"

Функция   Значение2ДвоичныеДанные(Значение) Экспорт
    ИмяФайла = ПолучитьИмяВременногоФайла();
	ЗначениеВФайл(ИмяФайла, Значение);
    Результат = Новый ДвоичныеДанные(ИмяФайла);
    УдалитьФайлы(ИмяФайла);
    
    Возврат Результат;
КонецФункции
 
Функция   ДвоичныеДанные2Значение(ДвоичныеДанные) Экспорт
    ИмяФайла = ПолучитьИмяВременногоФайла();
    ДвоичныеДанные.Записать(ИмяФайла);
	Результат = ЗначениеИзФайла(ИмяФайла);
    УдалитьФайлы(ИмяФайла);
    
    Возврат Результат;
КонецФункции

//#КонецОбласти 


////#Область РедакторФормул

Функция   РедакторФормул_Выполнить(ДанныеФормулы, Контекст) Экспорт
    Результат = Новый Структура("Результат");
    ТЗФ = КопияОбъекта(ДанныеФормулы.СоставФормулы);
    
    Если ДанныеФормулы.Вид = Перечисления.ИА_БФФормулыТип.Строка Тогда
        Для каждого Стр Из ТЗФ Цикл
            Попытка
                Если Стр.Вид = 0 Тогда
                	Значение = Вычислить(Стр.ПутьДанных);
                Иначе
                    Значение = Стр.Данные;
                КонецЕсли; 
            Исключение
                ТекстОшибки = ОписаниеОшибки();
                Значение = "{Ошибка: " + ТекстОшибки + "}"
            КонецПопытки; 
            
            Стр.Вставить("Значение", "" + Значение);
        КонецЦикла; 
        
        Текст = "";
        Для каждого Стр Из ТЗФ Цикл
            Текст = Текст + Стр.Значение;
        КонецЦикла;
        
        Результат.Результат = Текст;
    ИначеЕсли ДанныеФормулы.Вид = Перечисления.ИА_БФФормулыТип.ОдноЗначение Тогда
        Если ТЗФ.Количество() = 0 Тогда
        	Значение = Неопределено;
        Иначе
            Стр = ТЗФ[0];
            Попытка
                Если Стр.Вид = 0 Тогда
                	Значение = Вычислить(Стр.ПутьДанных);
                Иначе
                    Значение = Стр.Данные;
                КонецЕсли; 
            Исключение
                ТекстОшибки = ОписаниеОшибки();
                Значение = "{Ошибка: " + ТекстОшибки + "}"
            КонецПопытки; 
        КонецЕсли; 
               
        Результат.Результат = Значение;
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции

////#КонецОбласти 

////#Область  СКД

// Программный вывод СКД в указанный табличный документ. http://infostart.ru/public/358495/
//  Для корректного выполнения отчета нужно ограничить использование параметров.
//  Для (надеюсь временного) костыля используется перебор пользовательских параметров.
//
// Параметры:
//      СКД                         - СхемаКомпоновкиДанных - СКД которую нужно вывести
//      СтруктураПараметров         - Структура             - Структура параметров СКД
//                                                              Ключ        - Имя параметра
//                                                              Значение    - Значение параметра
//      СтруктураИсточниковДанных   - Структура             - Структура источников данных.
//                                                              Ключ        - Имя таблицы
//                                                              Значение    - Таблица источника
//      СтруктураОтборов            - Структура             - Структура отборов.
//                                                              Ключ        - Имя поля (или "СложныйОтбор")
//                                                              Значение    - Структура, Строка.
//                                                              Если "Имя поля":        Ключ - Имя параметра. Значение - Значение параметра
//                                                                                              Пример: СтруктураПараметровПроцедуры = Новый Структура("ПравоеЗначение, ВидСравнения, Представление, Использование, РежимОтображения, ИдентификаторПользовательскойНастройки");
//                                                              Если "СложныйОтбор":    ОбщиеПроцедуры.УстановитьОбщийОтбор(Отбор);
//      ИмяВариантаНастроек         - Строка                - Имя варианта настроек
//      ОграничениеИспользованияПараметров  - Булево        - Признак необходимости ограничения использования параметров
//      ЗаменитьРасшифровкуНаЗначение       - Число         - 0 - нет; 1 - На значение, 2 - структура с полями: Вид, Расшифровка, ИД, СоответствиеПолей
//      ВидРасшифровки                      - Число         - будет помещено в структуру расшифровки по полю "вид"
//
// Возвращаемое значение:
//      Структура
//
Функция   СКД_Выполнить(СКД
    , СтруктураПараметров = Неопределено
    , Вид = 0
    , СтруктураИсточниковДанных = Неопределено
    , СтруктураОтборов = Неопределено
    , ИмяВариантаНастроек = ""
    , ОграничениеИспользованияПараметров = Неопределено
    , ВариантРасшифровки = 0 // 0 - Системная; 1 - Значение; 2 - Соответствие в формате СКД_ПолучитьПоляРасшифровки
    ) Экспорт
    
    ТабДокумент = Новый ТабличныйДокумент;
    
    Результат = Новый Структура("Выполнено, ОписаниеОшибки, ТабДок, Коллекция, ДанныеРасшифровки"
    , Ложь, "", ТабДокумент, , Новый ДанныеРасшифровкиКомпоновкиДанных);
    
    Если Вид = 2 Тогда
        Результат.Коллекция = Новый ТаблицаЗначений;
    Иначе
        Результат.Коллекция = Новый ДеревоЗначений;
    КонецЕсли;    
    

    Если СтруктураПараметров = Неопределено Тогда
        СтруктураПараметров = Новый Структура;
    КонецЕсли;
    Если СтруктураОтборов = Неопределено Тогда
        СтруктураОтборов = Новый Структура;
    КонецЕсли;
    МассивПараметровОтбора = Новый Массив;
    МассивПараметровОтбора.Добавить("ПравоеЗначение");
    МассивПараметровОтбора.Добавить("ВидСравнения");
    МассивПараметровОтбора.Добавить("Представление");
    МассивПараметровОтбора.Добавить("Использование");
    МассивПараметровОтбора.Добавить("РежимОтображения");
    МассивПараметровОтбора.Добавить("ИдентификаторПользовательскойНастройки");


    Для каждого ТекущийПараметр Из СтруктураПараметров Цикл

        СКД_УстановитьПараметрСКД(СКД.Параметры, ТекущийПараметр.Ключ, ТекущийПараметр.Значение, ОграничениеИспользованияПараметров);

    КонецЦикла;

    Если ПустаяСтрока(ИмяВариантаНастроек) Тогда
        Настройки = СКД.НастройкиПоУмолчанию;
	ИначеЕсли ТипЗнч(ИмяВариантаНастроек)=Тип("НастройкиКомпоновкиДанных") Тогда
		Настройки = ИмяВариантаНастроек;
    Иначе
        НайденныйВариант = СКД.ВариантыНастроек.Найти(ИмяВариантаНастроек);
        Если НайденныйВариант = Неопределено Тогда
            Результат.ОписаниеОшибки = "Не найден вариант настроек " + НайденныйВариант;
            Возврат Результат;
        КонецЕсли;
        Настройки = НайденныйВариант.Настройки;
    КонецЕсли;

    Отбор = Настройки.Отбор;

    Для каждого ТекущийПараметр Из Настройки.ПараметрыДанных.Элементы Цикл
        // Надеюсь, временный костыль. Нужно перебрать параметры варианта и установить их.

        ИмяПараметра        = Строка(ТекущийПараметр.Параметр);
        ЗначениеПараметра   = Неопределено;
        Если СтруктураПараметров.Свойство(ИмяПараметра, ЗначениеПараметра) Тогда
            ТекущийПараметр.Использование   = Истина;
            ТекущийПараметр.Значение        = ЗначениеПараметра;
        КонецЕсли;

    КонецЦикла;

    Для каждого ТекущийОтбор Из СтруктураОтборов Цикл

        Если ТекущийОтбор.Ключ = "СложныйОтбор" Тогда
            // Если в качестве ключа строка "СложныйОтбор", значит установка отбора через общие процедуры:
            //  ОбщиеПроцедуры.УстановитьУниверсальныйОтбор(Отбор);

            Выполнить ТекущийОтбор.Значение;

        Иначе

            СтруктураПараметровПроцедуры = Новый Структура("ПравоеЗначение, ВидСравнения, Представление, Использование, РежимОтображения, ИдентификаторПользовательскойНастройки");

            Для каждого ТекущийПараметрОтбора Из МассивПараметровОтбора Цикл

                Если ТекущийОтбор.Значение.Свойство(ТекущийПараметрОтбора) Тогда

                    СтруктураПараметровПроцедуры.Вставить(ТекущийПараметрОтбора, ТекущийОтбор.Значение[ТекущийПараметрОтбора]);

                КонецЕсли;

            КонецЦикла;

            СКД_внутр_УстановитьЭлементОтбора(Настройки.Отбор, ТекущийОтбор.Ключ, СтруктураПараметровПроцедуры.ПравоеЗначение,
                                                                    СтруктураПараметровПроцедуры.ВидСравнения,
                                                                    СтруктураПараметровПроцедуры.Представление,
                                                                    СтруктураПараметровПроцедуры.Использование,
                                                                    СтруктураПараметровПроцедуры.РежимОтображения,
                                                                    СтруктураПараметровПроцедуры.ИдентификаторПользовательскойНастройки);

        КонецЕсли;

    КонецЦикла;


    КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
    ДанныеРасшифровкиКД = Новый ДанныеРасшифровкиКомпоновкиДанных;
    Если      Вид = 0 Тогда
        МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СКД, Настройки, ДанныеРасшифровкиКД);
    ИначеЕсли Вид = 1 или Вид = 2 Тогда
        МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СКД, Настройки, ДанныеРасшифровкиКД,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    КонецЕсли; 
    

    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    Если Не СтруктураИсточниковДанных = Неопределено Тогда
        ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, СтруктураИсточниковДанных, ДанныеРасшифровкиКД, Истина);
    Иначе
        ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровкиКД, Истина);
    КонецЕсли;

    Если      Вид = 0 Тогда
        ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
        ПроцессорВывода.УстановитьДокумент(ТабДокумент);
        ////ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
        
        ПроцессорВывода.НачатьВывод();
        ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
        Пока НЕ ЭлементРезультата = Неопределено Цикл
            #Если Клиент Тогда
                ОбработкаПрерыванияПользователя();
            #КонецЕсли 
            ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
            Если ВариантРасшифровки = 1 Тогда
                Если ЭлементРезультата.ЗначенияПараметров.Количество() > 0 Тогда
                    Для счКол = 1 по ТабДокумент.ШиринаТаблицы Цикл
                        ТекРасшифровкаИдентификатор = ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,счКол).Расшифровка;
                        Попытка
                            ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,счКол).Расшифровка = ДанныеРасшифровкиКД.Элементы[ТекРасшифровкаИдентификатор].ПолучитьПоля()[0].Значение
                        Исключение
                        КонецПопытки; 
                    КонецЦикла;
                КонецЕсли;
            КонецЕсли; 
            ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
        КонецЦикла;
        ПроцессорВывода.ЗакончитьВывод();
    ИначеЕсли Вид = 1 или Вид = 2 Тогда
        ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
        ПроцессорВывода.УстановитьОбъект(Результат.Коллекция);
        ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
    КонецЕсли; 

    Если ВариантРасшифровки = 2 Тогда
        Для СчетчикСтрок = 1 По ТабДокумент.ВысотаТаблицы Цикл
            Для СчетчикКолонок = 1 по ТабДокумент.ШиринаТаблицы Цикл
                ТекРасшифровка = ТабДокумент.Область(СчетчикСтрок, СчетчикКолонок).Расшифровка;
                Если ТипЗнч(ТекРасшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
                    Значение = ИА_БФС.СКД_ПолучитьПоляРасшифровки(ДанныеРасшифровкиКД.Элементы[ТекРасшифровка]);
                    ТабДокумент.Область(СчетчикСтрок, СчетчикКолонок).Расшифровка = Значение;
                КонецЕсли; 
            КонецЦикла;
        КонецЦикла;
    КонецЕсли; 
    
    Результат.Вставить("ТабДок", ТабДокумент);
    Результат.Вставить("ДанныеРасшифровки", ДанныеРасшифровкиКД);
    Результат.Вставить("Выполнено", Истина);

    Возврат Результат;

КонецФункции // ВыполнитьСКД

//{ Блок вспомогательных процедур

// Поиск и установка значения параметра схемы компоновки данных
// Параметры:
//        ПараметрыСКД        - ПараметрыСхемыКомпоновкиДанных - Параметры СКД
//        ИмяПараметра        - Строка        - Имя параметра
//        ЗначениеПараметра    - Произвольное    - Устанавливаемое значение параметра
//
Процедура     СКД_УстановитьПараметрСКД(ПараметрыСКД, ИмяПараметра, ЗначениеПараметра, ОграничениеИспользования = Неопределено) 
    
    НайденныйПараметр = ПараметрыСКД.Найти(ИмяПараметра);
    Если НайденныйПараметр = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    НайденныйПараметр.Значение        = ЗначениеПараметра;
    
    Если Не ОграничениеИспользования = Неопределено Тогда
        НайденныйПараметр.ОграничениеИспользования = ОграничениеИспользования;
    КонецЕсли;
    
КонецПроцедуры // УстановитьПараметрСКД

Функция       СКД_внутр_ИзменитьЭлементыОтбора(ОбластьПоиска,
								Знач ИмяПоля = Неопределено,
								Знач Представление = Неопределено,
								Знач ПравоеЗначение = Неопределено,
								Знач ВидСравнения = Неопределено,
								Знач Использование = Неопределено,
								Знач РежимОтображения = Неопределено,
								Знач ИдентификаторПользовательскойНастройки = Неопределено)
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	СКД_внутр_НайтиРекурсивно(ОбластьПоиска.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если ИмяПоля <> Неопределено Тогда
			Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
		Если Представление <> Неопределено Тогда
			Элемент.Представление = Представление;
		КонецЕсли;
		Если Использование <> Неопределено Тогда
			Элемент.Использование = Использование;
		КонецЕсли;
		Если ВидСравнения <> Неопределено Тогда
			Элемент.ВидСравнения = ВидСравнения;
		КонецЕсли;
		Если ПравоеЗначение <> Неопределено Тогда
			Элемент.ПравоеЗначение = ПравоеЗначение;
		КонецЕсли;
		Если РежимОтображения <> Неопределено Тогда
			Элемент.РежимОтображения = РежимОтображения;
		КонецЕсли;
		Если ИдентификаторПользовательскойНастройки <> Неопределено Тогда
			Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЭлементов.Количество();
	
КонецФункции

Процедура     СКД_внутр_УстановитьЭлементОтбора(ОбластьПоискаДобавления,
								Знач ИмяПоля,
								Знач ПравоеЗначение = Неопределено,
								Знач ВидСравнения = Неопределено,
								Знач Представление = Неопределено,
								Знач Использование = Неопределено,
								Знач РежимОтображения = Неопределено,
								Знач ИдентификаторПользовательскойНастройки = Неопределено)
	
	ЧислоИзмененных = СКД_внутр_ИзменитьЭлементыОтбора(ОбластьПоискаДобавления, ИмяПоля, Представление,
							ПравоеЗначение, ВидСравнения, Использование, РежимОтображения, ИдентификаторПользовательскойНастройки);
	
	Если ЧислоИзмененных = 0 Тогда
		Если ВидСравнения = Неопределено Тогда
			Если ТипЗнч(ПравоеЗначение) = Тип("Массив")
				Или ТипЗнч(ПравоеЗначение) = Тип("ФиксированныйМассив")
				Или ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений") Тогда
				ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Иначе
				ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
		КонецЕсли;
		Если РежимОтображения = Неопределено Тогда
			РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
		СКД_внутр_ДобавитьЭлементКомпоновки(ОбластьПоискаДобавления, ИмяПоля, ВидСравнения,
								ПравоеЗначение, Представление, Использование, РежимОтображения, ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	
КонецПроцедуры

Процедура     СКД_внутр_НайтиРекурсивно(КоллекцияЭлементов, МассивЭлементов, СпособПоиска, ЗначениеПоиска)
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если СпособПоиска = 1 Тогда
				Если ЭлементОтбора.ЛевоеЗначение = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			ИначеЕсли СпособПоиска = 2 Тогда
				Если ЭлементОтбора.Представление = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			СКД_внутр_НайтиРекурсивно(ЭлементОтбора.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
			
			Если СпособПоиска = 2 И ЭлементОтбора.Представление = ЗначениеПоиска Тогда
				МассивЭлементов.Добавить(ЭлементОтбора);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция       СКД_внутр_ДобавитьЭлементКомпоновки(ОбластьДобавления,
									Знач ИмяПоля,
									Знач ВидСравнения,
									Знач ПравоеЗначение = Неопределено,
									Знач Представление  = Неопределено,
									Знач Использование  = Неопределено,
									знач РежимОтображения = Неопределено,
									знач ИдентификаторПользовательскойНастройки = Неопределено)
	
	Элемент = ОбластьДобавления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент.ВидСравнения = ВидСравнения;
	
	Если РежимОтображения = Неопределено Тогда
		Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
		Элемент.РежимОтображения = РежимОтображения;
	КонецЕсли;
	
	Если ПравоеЗначение <> Неопределено Тогда
		Если ТипЗнч(ПравоеЗначение) = Тип("Массив") Тогда
			Если ПравоеЗначение.Количество() = 1 Тогда
				Элемент.ПравоеЗначение         = ПравоеЗначение[0];
			ИначеЕсли ПравоеЗначение.Количество() > 1 Тогда
				ЗначениеСписок = Новый СписокЗначений;
				ЗначениеСписок.ЗагрузитьЗначения(ПравоеЗначение);
				Элемент.ПравоеЗначение         = ЗначениеСписок;
			Иначе
				Элемент.ПравоеЗначение         = ПравоеЗначение;
			КонецЕсли;
		Иначе
			Элемент.ПравоеЗначение         = ПравоеЗначение;
		КонецЕсли;
	КонецЕсли;
	
	Если Представление <> Неопределено Тогда
		Элемент.Представление = Представление;
	КонецЕсли;
	
	Если Использование <> Неопределено Тогда
		Элемент.Использование = Использование;
	КонецЕсли;
	
	// Важно: установка идентификатора должна выполняться
	// в конце настройки элемента, иначе он будет скопирован
	// в пользовательские настройки частично заполненным.
	Если ИдентификаторПользовательскойНастройки <> Неопределено Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
	ИначеЕсли Элемент.РежимОтображения <> РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИмяПоля;
	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

//}

//   Возвращает  - данные расшифровки разобранные в данные "соответствие".
// - Ключи - Колонки стоящие на пересечении ячейки (все группировки + ресурс + "__АктивноеПоле" - имя поля расшифровки).
// - Значение - для "группировок" доступно значение, для ресурсов всегда NULL
// Параметры:
// ЭлементРасшифровки - ЭлементРасшифровкиКомпоновкиДанныхПоля - Пример получения: ДанныеРасшифровки.Элементы[Расшифровка]
// внутрРасшифровка - Внутренняя переменная, не использовать
Функция   СКД_ПолучитьПоляРасшифровки(ЭлементРасшифровки, внутрРасшифровка = Неопределено) Экспорт
    ПервыйУровень = Ложь;
    Если внутрРасшифровка = Неопределено Тогда
        внутрРасшифровка = Новый Соответствие;
        внутрРасшифровка.Вставить("__АктивноеПоле", "");
        ПервыйУровень = Истина;
    КонецЕсли; 
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		ПоляЭлементаРасшифровки 	= ЭлементРасшифровки.ПолучитьПоля();
		Для каждого текПоле из ПоляЭлементаРасшифровки Цикл
            Если внутрРасшифровка.Получить(СокрЛП(текПоле.Поле)) = Неопределено Тогда
                Если ПервыйУровень Тогда
                	внутрРасшифровка.Вставить("__АктивноеПоле", СокрЛП(текПоле.Поле));
                КонецЕсли; 
				внутрРасшифровка.Вставить(СокрЛП(текПоле.Поле),текПоле.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
    
    РодителиЭлементаРасшифровки = ЭлементРасшифровки.ПолучитьРодителей();
    Для каждого текРодительРасшифровки из РодителиЭлементаРасшифровки Цикл
        СКД_ПолучитьПоляРасшифровки(текРодительРасшифровки, внутрРасшифровка)
    КонецЦикла;
    Возврат внутрРасшифровка;
КонецФункции

Функция   СКД_УстановитьПараметр(ОбъектИлиПараметрыДанных, ИмяПараметра, Значение, Использование  = Истина) Экспорт
    Если ТипЗнч(ОбъектИлиПараметрыДанных) = Тип("ЗначенияПараметровДанныхКомпоновкиДанных") Тогда
    	ПараметрыДанных = ОбъектИлиПараметрыДанных;
    Иначе
        ПараметрыДанных = ОбъектИлиПараметрыДанных.КомпоновщикНастроек.Настройки.ПараметрыДанных;
    КонецЕсли; 
    
    Эл = ПараметрыДанных.Элементы.Найти(ИмяПараметра);
    Если Эл <> Неопределено Тогда
        Эл.Значение = Значение;
        Эл.Использование = Использование;
        Возврат Истина
    Иначе
        Возврат Ложь
    КонецЕсли; 
КонецФункции

Функция   СКД_ПодготовитьПараметрыОткрытияОтчета(ИмяОтчета, ПараметрыПользовательскихНастроек, СформироватьПриОткрытии = Ложь) Экспорт
	ПользовательскиеНастройки = Отчеты[ИмяОтчета].Создать().КомпоновщикНастроек.ПользовательскиеНастройки;
    
    Параметры = Новый Структура("СформироватьПриОткрытии, ПользовательскиеНастройки"
    , СформироватьПриОткрытии, ПользовательскиеНастройки);
    
    Для Каждого Элемент Из ПользовательскиеНастройки.Элементы Цикл
        Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
            Для каждого КиЗ Из ПараметрыПользовательскихНастроек Цикл
            	Если ВРЕГ(Строка(Элемент.Параметр)) = ВРЕГ(КиЗ.Ключ) Тогда
                    Элемент.Значение = КиЗ.Значение;
                    Элемент.Использование = Истина;
                КонецЕсли; 
            КонецЦикла;  
        КонецЕсли;
    КонецЦикла;
    
    Результат = Новый Структура("ИмяФормы, Параметры"
    , "Отчет." + ИмяОтчета + ".ФормаОбъекта"
    , Параметры);
    
    Возврат Результат;
КонецФункции

Процедура СКД_СохранитьВФайл(СКД, ИмяФайла) Экспорт
    ЗаписьXML = Новый ЗаписьXML;
    ЗаписьXML.ОткрытьФайл(ИмяФайла);
    СериализаторXDTO.ЗаписатьXML(ЗаписьXML,
    СКД, 
    "dataComposition",
    "http://v8.1c.ru/8.1/data-composition-system/composition-template");
КонецПроцедуры

Функция   СКД_ПрочитатьИзФайла(ИмяФайла) Экспорт
    Чтение = Новый ЧтениеXML;
    НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
    Чтение.ОткрытьФайл(ИмяФайла);
    Результат = НовыйСXDTO.ПрочитатьXML(Чтение, Тип("СхемаКомпоновкиДанных"));
    
    Возврат Результат;
КонецФункции

Функция   СКДТабДок_ПолучитьМассивОбластейШапок(ДокументРезультат) Экспорт
    МассивОбластей = Новый Массив;
    
    Для НомерСтроки = 1 По ДокументРезультат.ВысотаТаблицы Цикл
        Если НЕ СКДТабДок_ЭтоЯчейкаШапки(ДокументРезультат.Область(НомерСтроки, 1)) Тогда
            Продолжить;
        КонецЕсли;
        
        ПоследняяСтрокаШапки = НомерСтроки;
        Для Счетчик = НомерСтроки + 1 По ДокументРезультат.ВысотаТаблицы Цикл
            Если НЕ СКДТабДок_ЭтоЯчейкаШапки(ДокументРезультат.Область(Счетчик, 1)) Тогда
                Прервать;
            КонецЕсли;
            ПоследняяСтрокаШапки = Счетчик;
        КонецЦикла;
        
        Для НомерКолонки = -ДокументРезультат.ШиринаТаблицы По -1 Цикл
            Если СКДТабДок_ЭтоЯчейкаШапки(ДокументРезультат.Область(НомерСтроки, -НомерКолонки)) Тогда
                Прервать;
            КонецЕсли;
        КонецЦикла;
        КоординатыПравогоНижнегоУглаШапки = Новый Структура("Верх,Лево", ПоследняяСтрокаШапки, -НомерКолонки);
        
        МассивОбластей.Добавить(
        ДокументРезультат.Область(
        НомерСтроки,
        1, 
        КоординатыПравогоНижнегоУглаШапки.Верх,
        КоординатыПравогоНижнегоУглаШапки.Лево )
        );
        
        НомерСтроки = КоординатыПравогоНижнегоУглаШапки.Верх;
    КонецЦикла;
    
    Возврат МассивОбластей;
КонецФункции

Функция       СКДТабДок_ЭтоЯчейкаШапки(Ячейка)
    Возврат Ячейка.РежимИзмененияРазмераКолонки = РежимИзмененияРазмера.БыстроеИзменение;
КонецФункции

////#КонецОбласти 

////#Область ДинамическийСписок

Функция   ДС_ПолучитьИтоги(Список, ЭФСписок, КолонкиИтогов)  Экспорт
    Схема     = ЭФСписок.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = ЭФСписок.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    Настройки.Структура.Очистить();
    Настройки.Выбор.Элементы.Очистить();
    НоваяГруппировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
    НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
    
    СтруктураИтогов = Новый Структура(КолонкиИтогов);
    Для каждого КиЗ Из СтруктураИтогов Цикл
        Эл = Настройки.ПользовательскиеПоля.Элементы.Добавить(Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных"));
        Эл.УстановитьВыражениеИтоговыхЗаписей ("Сумма(" + КиЗ.Ключ + ")");
        Эл.УстановитьВыражениеДетальныхЗаписей("Сумма(" + КиЗ.Ключ + ")");
        СтруктураИтогов.Вставить(КиЗ.Ключ, Эл.ПутьКДанным);
        
        ВыбПоле = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
        ВыбПоле.Использование = Истина;
        ВыбПоле.Поле = Новый ПолеКомпоновкиДанных(Эл.ПутьКДанным);
    КонецЦикла;  
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки
    ,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений ;
    
    ТЗ =  Новый ТаблицаЗначений;
    ПроцессорВывода.УстановитьОбъект(ТЗ); 
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
    
    Для каждого КиЗ Из СтруктураИтогов Цикл
        ИмяПоля = СтрЗаменить(КиЗ.Значение, ".", "");
        Значение = ТЗ.Итог(ИмяПоля);
    	СтруктураИтогов.Вставить(КиЗ.Ключ, Значение);
    КонецЦикла;  
    
    Возврат СтруктураИтогов;
КонецФункции
	
////#КонецОбласти 

////#Область ТабличныйДокумент
	

Процедура ТабДок_ВывестиОбласть(ТабДок, Макет, ИмяОбласти, Контекст = Неопределено, Уровень = Неопределено) Экспорт
    Область = Макет.ПолучитьОбласть(ИмяОбласти);
    
    Если Контекст <> Неопределено Тогда
        Если ТипЗнч(Контекст) = Тип("Массив") Тогда
            Для каждого Эл Из Контекст Цикл
                Область.Параметры.Заполнить(Эл);
            КонецЦикла; 
        Иначе
            Область.Параметры.Заполнить(Контекст);
        КонецЕсли; 
    КонецЕсли; 
    
    Если Уровень = Неопределено Тогда
        ТабДок.Вывести(Область);
    Иначе
        ТабДок.Вывести(Область, Уровень);
    КонецЕсли; 
КонецПроцедуры

Процедура ТабДок_ОбъединитьСмежныеЯчейки(ТабДок) Экспорт
    ОбъединяемаяОбласть = Неопределено;
    //Для оптимизации здесь нужно будет ограничить высоту таблицы
    Для индСтр=1 По ТабДок.ВысотаТаблицы Цикл
        НачальнаяКолонка = 0;
        Для индКол=1 По ТабДок.ШиринаТаблицы Цикл
            // определяем начало объединения
            
            Ячейка = ТабДок.Область(индСтр, индКол);
            ЯчейкаСлед = ТабДок.Область(индСтр, индКол+1);
            Если ПустаяСтрока(Ячейка.Текст) Тогда
                ОбъединятьЯчейки = Ложь;
            ИначеЕсли
                //Проверяем на соответствие заголовка
                Ячейка.Текст = ЯчейкаСлед.Текст
                // Проверяем на соответствие имени (отсеиваем уже объединенные ячейки)
                //и Ячейка.Имя = "R"+индСтр+"C"+индКол
                Тогда
                ОбъединятьЯчейки = Истина;
            Иначе
                ОбъединятьЯчейки = Ложь;
            КонецЕсли;
            
            Если ОбъединятьЯчейки Тогда
                Если не НачальнаяКолонка Тогда
                    НачальнаяКолонка = индКол;
                КонецЕсли;
            ИначеЕсли НачальнаяКолонка Тогда
                // завершаем объединение
                ТекстЗаголовка = ТабДок.Область(индСтр, индКол).Текст;
                ОбъединяемаяОбласть = ТабДок.Область(индСтр, НачальнаяКолонка, индСтр, индКол);
                ОбъединяемаяОбласть.Объединить();
                ОбъединяемаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
                ОбъединяемаяОбласть.Текст = ТекстЗаголовка;
                НачальнаяКолонка = 0;
            Иначе
                НачальнаяКолонка = 0;
            КонецЕсли;
        КонецЦикла;
        // Если нашли в строке области для объединения то прекращаем дальнейшие поиски
        Если не ОбъединяемаяОбласть = Неопределено Тогда
            возврат;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

//{ http://infostart.ru/public/546665/

Процедура ТабДок_ЗадатьФорматСтрок(ТабДок) Экспорт
	// задает индивидуальный формат строк для табличного документа, сохраняя ширину колонок при выводе его в другой табличный документ
	ТабДок.Область(1,,ТабДок.ВысотаТаблицы).СоздатьФорматСтрок();
КонецПроцедуры

Функция   ТабДок_ПрисоединитьТабДок(ТабличныйДокументОсновной, ТабличныйДокументПрисоединяемый) Экспорт
	// идея взята с форума: http://forum.infostart.ru/forum86/topic157420/message1610993/#message1610993
	ТабличныйДокументОбъединенный = Новый ТабличныйДокумент;
	
	Область = ТабличныйДокументОсновной.ПолучитьОбласть(1,1, ТабличныйДокументОсновной.ВысотаТаблицы, ТабличныйДокументОсновной.ШиринаТаблицы);
	
	ТабличныйДокументОбъединенный.Вывести(Область);
	ТабличныйДокументОбъединенный.Присоединить(ТабличныйДокументПрисоединяемый);
	
	Возврат ТабличныйДокументОбъединенный;
КонецФункции

Процедура ТабДок_ОбъединитьЯчейкиПоМаркеру(ТабличныйДокумент, МаркерОбъединения) Экспорт
	// Находит ячейки, содержащие в тексте МаркерОбъединения
	// Объединяет ячейки, располагающиеся рядом, содержащие одинаковый текст и маркер объединения 
	
	ОбъединяемыеЯчейки = ТабДок_внутр_НайтиОбластиПоВхождениюПодстроки(ТабличныйДокумент, МаркерОбъединения);
	ОбъединяемыеЯчейки.Колонки.Добавить("Диапазон");
	ОбъединяемыеЯчейки.Сортировать("Верх,Лево");
	
	Для Каждого Строка из ОбъединяемыеЯчейки Цикл
		Отбор = Новый Структура("Текст,Верх,Лево", Строка.Текст, Строка.Верх-1, Строка.Лево);
		НайденныеСтроки = ОбъединяемыеЯчейки.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() Тогда
			Строка.Диапазон = НайденныеСтроки[0].Диапазон;
			Строка.Диапазон.Низ = Макс(Строка.Диапазон.Низ, Строка.Верх);
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("Текст,Верх,Лево", Строка.Текст, Строка.Верх, Строка.Лево-1);
		НайденныеСтроки = ОбъединяемыеЯчейки.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() Тогда
			Строка.Диапазон = НайденныеСтроки[0].Диапазон;
			Строка.Диапазон.Право = Макс(Строка.Диапазон.Право, Строка.Лево);
			Продолжить;
		КонецЕсли;
		
		Строка.Диапазон = Новый Структура("Текст,Верх,Лево,Низ,Право", Строка.Текст, Строка.Верх, Строка.Лево, Строка.Верх, Строка.Лево);
	КонецЦикла;
	
	ОбъединяемыеЯчейки.Свернуть("Диапазон");
	Для Каждого Строка Из ОбъединяемыеЯчейки Цикл
		Диапазон = Строка.Диапазон;
		Область = ТабличныйДокумент.Область(Диапазон.Верх, Диапазон.Лево, Диапазон.Низ, Диапазон.Право);
		Область.Объединить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ТабДок_СкрытьСтрокиПоМаркеру(ТабличныйДокумент, МаркерУдаления) Экспорт
	
	НайденныеОбласти = ТабДок_внутр_НайтиОбластиПоВхождениюПодстроки(ТабличныйДокумент, МаркерУдаления);
	НайденныеОбласти.Свернуть("Верх");
	
	Для каждого Строка из НайденныеОбласти Цикл
		Область = ТабличныйДокумент.Область(Строка.Верх, , Строка.Верх, );
		Область.Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

Функция   ТабДок_внутр_НайтиОбластиПоВхождениюПодстроки(ТабличныйДокумент, ПодстрокаПоиска)
	
	НайденныеОбласти = Новый ТаблицаЗначений;
	НайденныеОбласти.Колонки.Добавить("Область");
	НайденныеОбласти.Колонки.Добавить("Текст");
	НайденныеОбласти.Колонки.Добавить("Верх");
	НайденныеОбласти.Колонки.Добавить("Лево");
	
	НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска);
	
	Пока НЕ НайденнаяОбласть = Неопределено Цикл
		
		НоваяСтрока = НайденныеОбласти.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяОбласть);
		НоваяСтрока.Область = НайденнаяОбласть;
		
		НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска, НайденнаяОбласть);
		
	КонецЦикла;
	
	Возврат НайденныеОбласти;
	
КонецФункции

Процедура ТабДок_ЗаменитьТекст(ТабличныйДокумент, ПодстрокаПоиска, ПодстрокаЗамены) Экспорт
	НайденныеОбласти = ТабДок_внутр_НайтиОбластиПоВхождениюПодстроки(ТабличныйДокумент, ПодстрокаПоиска);
	Для каждого Строка из НайденныеОбласти Цикл
		Строка.Область.Текст = СтрЗаменить(Строка.Область.Текст, ПодстрокаПоиска, ПодстрокаЗамены);
	КонецЦикла;
КонецПроцедуры

//}

////#КонецОбласти 


////#Область РаботаСФормами

Процедура ФормаУпр_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, Форма) Экспорт
    ЭФ          = Форма.Элементы;
    Параметры   = Форма.Параметры;
    
    // Включение режима выбора в "формах списка"
    Если  ИА_БФКС.РеквизитЕсть(ЭФ,          "Список")
        И ИА_БФКС.РеквизитЕсть(ЭФ.Список,   "РежимВыбора")
        И ИА_БФКС.РеквизитЕсть(Параметры,   "РежимВыбора")
        И НЕ ЭФ.Список.РежимВыбора
        И Параметры.РежимВыбора = Истина
        Тогда
        ЭФ.Список.РежимВыбора = Параметры.РежимВыбора; 
        
        Если ИА_БФКС.РеквизитЕсть(Параметры, "МножественныйВыбор")
            И Параметры.МножественныйВыбор <> Неопределено
            Тогда
            ЭФ.Список.МножественныйВыбор = Параметры.МножественныйВыбор;
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры



////#Область Теги

Процедура Теги_УстановитьОтбор(ИмяОбъектаМД, СписокОбъектов, ОтборТеги, Условие_ИЛИ) Экспорт
    Список = ОтборТеги.ВыгрузитьЗначения();
    
    СписокСсылок = Теги_СформироватьСписокОбъектовПоСпискуТегов(ИмяОбъектаМД, Список, Условие_ИЛИ);
    
    СКД_УстановитьПараметр(СписокОбъектов.Параметры, "Теги_Условие_ИЛИ", Условие_ИЛИ);
    СКД_УстановитьПараметр(СписокОбъектов.Параметры, "Теги_СписокТегов", Список);
    СКД_УстановитьПараметр(СписокОбъектов.Параметры, "Теги_СписокСсылок", СписокСсылок);
    СКД_УстановитьПараметр(СписокОбъектов.Параметры, "Теги_НетОтбора",   Список.Количество() = 0);
КонецПроцедуры

Функция   Теги_СформироватьСписокОбъектовПоСпискуТегов(ИмяОбъектаМД, СписокТегов, Условие_ИЛИ) Экспорт
    Таб = ИА_БФС.Запрос_ВыполнитьВТЗ(
    СтрЗаменить("ВЫБРАТЬ
    |   Т.Ссылка,
    |   КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Т.Тег) КАК КоличествоТегов
    |ПОМЕСТИТЬ Таб
    |ИЗ
    |   Задача.ИА_БПЗадачаНосителя.Теги КАК Т
    |ГДЕ
    |   Т.Тег В(&СписокТегов)
    |
    |СГРУППИРОВАТЬ ПО
    |   Т.Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   Таб.Ссылка
    |ИЗ
    |   Таб КАК Таб
    |ГДЕ
    |   ВЫБОР
    |           КОГДА &Условие_ИЛИ
    |               ТОГДА ИСТИНА
    |           ИНАЧЕ Таб.КоличествоТегов = &КоличествоТегов
    |       КОНЕЦ", "Задача.ИА_БПЗадачаНосителя", ИмяОбъектаМД)
    , Новый Структура("СписокТегов, Условие_ИЛИ, КоличествоТегов"
    , СписокТегов
    , Условие_ИЛИ
    , СписокТегов.Количество())); 
    
    Результат = Таб.ВыгрузитьКолонку("Ссылка");
    Возврат Результат;
КонецФункции
 
////#КонецОбласти 


////#Область КэшСтроковыхКонстант

Функция   КэшСтр_Получить(ИсходнаяСтрока) Экспорт
    Хеш = Хеш_MD5(ИсходнаяСтрока);
    
    Данные = ИА_БФС.Запрос_ВыполнитьВСтруктуру(
    "ВЫБРАТЬ
    |   Т.Хеш,
    |   Т.Значение,
    |   Т.ДатаСоздания,
    |   Т.ОбъектСвязи
    |ИЗ
    |   РегистрСведений.ИА_КэшСтроковыхКонстант КАК Т
    |ГДЕ
    |   Т.Хеш = &Хеш"
    , Новый Структура("Хеш", Хеш)); 
    
    Данные.Вставить("Найдено", Данные.Хеш = Хеш);
    
    Возврат Данные;
КонецФункции

Процедура КэшСтр_Вставить(ИсходнаяСтрока, Текст, ОбъектСвязи = Неопределено) Экспорт
	Хеш = Хеш_MD5(ИсходнаяСтрока);
    
    МЗ              = РегистрыСведений.ИА_КэшСтроковыхКонстант.СоздатьМенеджерЗаписи();
    МЗ.Хеш          = Хеш;
    МЗ.ДатаСоздания = ТекущаяДата();
    МЗ.Значение     = Текст;
    МЗ.ОбъектСвязи  = ОбъектСвязи;
    МЗ.Записать();
КонецПроцедуры

Процедура КэшСтр_Удалить(ИсходнаяСтрока = Неопределено, ОбъектСвязи = Неопределено) Экспорт
	Если ИсходнаяСтрока <> Неопределено Тогда
        Хеш = Хеш_MD5(ИсходнаяСтрока);
        МЗ              = РегистрыСведений.ИА_КэшСтроковыхКонстант.СоздатьМенеджерЗаписи();
        МЗ.Хеш          = Хеш;
        МЗ.Удалить();
    Иначе // Удаление пакетное записей
        Таб = ИА_БФС.Запрос_ВыполнитьВТЗ(
        "ВЫБРАТЬ
        |   Т.Хеш
        |ИЗ
        |   РегистрСведений.ИА_КэшСтроковыхКонстант КАК Т"
        + ?(ОбъектСвязи = Неопределено, "", " ГДЕ Т.ОбъектСвязи = &ОбъектСвязи")
        , Новый Структура("ОбъектСвязи", ОбъектСвязи)); 
        Для каждого Стр Из Таб Цикл
            МЗ              = РегистрыСведений.ИА_КэшСтроковыхКонстант.СоздатьМенеджерЗаписи();
            МЗ.Хеш          = Стр.Хеш;
            МЗ.Удалить();
        КонецЦикла;  
    КонецЕсли; 
КонецПроцедуры
 
 
////#КонецОбласти 

////#Область УниОтчет

Функция   УниОтчет_ПодготовитьДанные(ОтчетОбъект, УИД = Неопределено, ПараметрыФормы = Неопределено) Экспорт
    Если УИД = Неопределено Тогда
    	УИД = новый УникальныйИдентификатор;
    КонецЕсли; 
        
    Данные = Новый Структура("СКД, Настройки, НаименованиеОтчета, ПолноеНаименованиеОтчета, СформироватьПриОткрытии, ПользовательскиеНастройки"
    , ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных")
    , ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки()
    , ОтчетОбъект.Метаданные().ПолноеИмя()
    , ОтчетОбъект.Метаданные().Представление()
    , Ложь
    , Неопределено
    );
    
    Если ПараметрыФормы <> Неопределено Тогда
        Если ПараметрыФормы.Свойство("СформироватьПриОткрытии") Тогда
        	Данные.СформироватьПриОткрытии = ПараметрыФормы.СформироватьПриОткрытии;
        КонецЕсли; 
        Если ПараметрыФормы.Свойство("ПользовательскиеНастройки") Тогда
        	Данные.ПользовательскиеНастройки = ПараметрыФормы.ПользовательскиеНастройки;
        КонецЕсли; 
    КонецЕсли; 
    
    ВремХран = ПоместитьВоВременноеХранилище(Данные, УИД);
    
    Возврат Новый Структура("ИА_ПараметрыУниОтчета", ВремХран);
КонецФункции

Процедура УниОтчет_ПриСозданииНаСервере(Форма) Экспорт
    РеквизитХранения = Вычислить("Новый РеквизитФормы(""ИА_ПараметрыУниОтчета"",Новый ОписаниеТипов())");
    М = Новый Массив;
    М.Добавить(РеквизитХранения);
    Форма.ИзменитьРеквизиты(М);
    
    Форма.ИА_ПараметрыУниОтчета = УниОтчет_ПодготовитьДанные(
    Форма.РеквизитФормыВЗначение("Отчет")
    , Форма.УникальныйИдентификатор
    , Форма.Параметры);
КонецПроцедуры
 
////#КонецОбласти 


////#Область РегистрацияСообщений

Функция   РегистрацияСообщений_Активно() Экспорт
    Попытка
        Текст = ПараметрыСеанса.ИА_БуферСообщений;
    Исключение
        Текст = "";
        ПараметрыСеанса.ИА_БуферСообщений = "";
        ТекстОшибки = ОписаниеОшибки();
    КонецПопытки; 
    
    Возврат Текст <> "";
КонецФункции

Процедура РегистрацияСообщений_Начать() Экспорт
    Если НЕ РегистрацияСообщений_Активно() Тогда
    	ПараметрыСеанса.ИА_БуферСообщений = "!";
        ОбновитьПовторноИспользуемыеЗначения();
    КонецЕсли; 
КонецПроцедуры

Процедура РегистрацияСообщений_Зафиксировать(Сообщение) Экспорт
    Если РегистрацияСообщений_Активно() Тогда
        ПараметрыСеанса.ИА_БуферСообщений = ПараметрыСеанса.ИА_БуферСообщений + Символы.ПС  + Сообщение;
    КонецЕсли; 
КонецПроцедуры

Функция   РегистрацияСообщений_Закончить() Экспорт
    Если РегистрацияСообщений_Активно() Тогда
        Результат = ПараметрыСеанса.ИА_БуферСообщений;
        Результат = Сред(Результат, 3);
        ПараметрыСеанса.ИА_БуферСообщений = "";
    Иначе
        Результат = "";
    КонецЕсли;
    
    Возврат Результат;
КонецФункции

////#КонецОбласти 

////#Область НаборыЗаписей

Процедура ТЗ_В_НаборЗаписей(ТЗ, Менеджер, Регистратор, ОбменДаннымиЗагрузка = Ложь, Замещать = Истина) Экспорт
    НЗ = Менеджер.СоздатьНаборЗаписей();
    НЗ.Отбор.Регистратор.Установить(Регистратор);
    НЗ.ОбменДанными.Загрузка = ОбменДаннымиЗагрузка;
    НЗ.Загрузить(ТЗ);
	НЗ.Записать(Замещать);
КонецПроцедуры

Функция   НаборЗаписей_В_ТЗ(Менеджер, Регистратор) Экспорт
    НЗ = Менеджер.СоздатьНаборЗаписей();
    НЗ.Отбор.Регистратор.Установить(Регистратор);
    НЗ.Прочитать();
    Возврат НЗ.Выгрузить();
КонецФункции

Процедура Проводки_ПоменятьМестамиСчетаИСубконто(Проводка, СторноСуммы = Ложь) Экспорт
    ЗначенияДт = Новый Соответствие;
    СчетДт     = Проводка.СчетДт;
    
    Для каждого СтрокаВидаСубконто Из Проводка.СчетДт.ВидыСубконто Цикл
        ВидСубконто = СтрокаВидаСубконто.ВидСубконто;
        
    	ЗначенияДт.Вставить(ВидСубконто, Проводка.СубконтоДт[ВидСубконто]);
        Проводка.СубконтоДт.Удалить(ВидСубконто);
    КонецЦикла;  
    
    Проводка.СчетДт = Проводка.СчетКт;
    Для каждого СтрокаВидаСубконто Из Проводка.СчетКт.ВидыСубконто Цикл
        ВидСубконто = СтрокаВидаСубконто.ВидСубконто;

        Проводка.СубконтоДт.Вставить(ВидСубконто, Проводка.СубконтоКт[ВидСубконто]);
        Проводка.СубконтоКт.Удалить(ВидСубконто);
    КонецЦикла;  
    
    Проводка.СчетКт = СчетДт;
    Для каждого КиЗ Из ЗначенияДт Цикл
        Проводка.СубконтоКт.Вставить(КиЗ.Ключ, КиЗ.Значение);
    КонецЦикла;  
    
    Если СторноСуммы Тогда
    	Проводка.Сумма = -Проводка.Сумма;
    КонецЕсли; 
    
КонецПроцедуры

////#КонецОбласти 

//#Область УФ_СортировкаЭлементовДанных
// Встраивание:
// 1) Добавить в МД реквизит сортировки "число" "ИА_ПорядокСортировки" (либо передать имя)
// 2) Вывести его на форму в список и установить по нему сортировку
// 3) В модуль формы добавить обработчик и вызов инициализации:
// Код:
//       &НаКлиенте
//       Процедура ИА_СортировщикСтрок_Нажатие(Команда)
//           ИА_БФК.УФ_СортировкаЭлементовДанных_Нажатие(ЭтаФорма, Команда);
//       КонецПроцедуры
//
//       &НаСервере
//       Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//           ИА_БФС.УФ_СортировкаЭлементовДанных_Инициализация(ЭтаФорма
//           , "Справочник.Контрагенты"
//           , "Список"
//           , "Список"
//           , "Ссылка");
//       КонецПроцедуры
Процедура УФ_СортировкаЭлементовДанных_Инициализация(Форма
    , ГруппаКнопокПриемник
    , ИмяОбъектаМД
    , ИмяСписка = "Список"
    , ИмяЭФСписка = "Список"
    , ИмяПоля = "Ссылка"
    , ИмяПоляПорядка = "ИА_ПорядокСортировки"
    , Иерархия = Неопределено) Экспорт
    Форма[ИмяСписка].УстановитьОбязательноеИспользование(ИмяПоля, Истина);
    
    /////   РЕКВИЗИТЫ   //////////
    
    МассивДобавляемыхРеквизитов = Новый Массив;
    
    // ******   Реквизит формы "УФ_СЭД_Настройки"    ***********
    
    НовыйРеквизит = Новый РеквизитФормы("УФ_СЭД_Настройки", Новый ОписаниеТипов());
    НовыйРеквизит.Заголовок = "Сортировщик строк данные";
    НовыйРеквизит.СохраняемыеДанные = Ложь;
    МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
    
    Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
    
    Форма.УФ_СЭД_Настройки = Новый Структура("ИмяОбъектаМД, ИмяЭФСписка, ИмяПоля, ИмяПоляПорядка, Иерархия"
    , ИмяОбъектаМД
    , ИмяЭФСписка
    , ИмяПоля
    , ИмяПоляПорядка
    , Иерархия);
    
    Если Иерархия = Неопределено Тогда
        СтруктураМД = ИА_БФС.Запрос_ВыполнитьВСтруктуру("ВЫБРАТЬ * ИЗ " + ИмяОбъектаМД + " КАК Т ГДЕ ЛОЖЬ");
        Иерархия = ИА_БФКС.РеквизитЕсть(СтруктураМД, "Родитель");
        Форма.УФ_СЭД_Настройки.Вставить("Иерархия", Иерархия);
    КонецЕсли; 
    
    /////   КОМАНДЫ   //////////
    
    // ******   Команда формы "ИА_СортировщикСтрок_Вверх"    ***********
    
    НоваяКоманда = Форма.Команды.Добавить("ИА_СортировщикСтрок_Вверх");
    НоваяКоманда.Действие = "ИА_СортировщикСтрок_Нажатие";
    НоваяКоманда.Заголовок = "Переместить вверх";
    НоваяКоманда.Подсказка = "Переместить вверх";
    //НоваяКоманда.ИзменяетСохраняемыеДанные = Ложь;
    НоваяКоманда.Отображение = ОтображениеКнопки.Картинка;
    НоваяКоманда.Картинка = БиблиотекаКартинок.ПереместитьВверх;
    
    // ******   Команда формы "ИА_СортировщикСтрок_Вниз"    ***********
    
    НоваяКоманда = Форма.Команды.Добавить("ИА_СортировщикСтрок_Вниз");
    НоваяКоманда.Действие = "ИА_СортировщикСтрок_Нажатие";
    НоваяКоманда.Заголовок = "Переместить Вниз";
    //НоваяКоманда.ИзменяетСохраняемыеДанные = Ложь;
    НоваяКоманда.Отображение = ОтображениеКнопки.Картинка;
    НоваяКоманда.Подсказка = "Переместить вниз";
    НоваяКоманда.Картинка = БиблиотекаКартинок.ПереместитьВниз;
    
    /////   ЭЛЕМЕНТЫ   //////////
    
    
    // ******   Кнопка формы "ФормаИА_СортировщикСтрок_Вниз"    ***********
    
    НовыйЭлемент = Форма.Элементы.Вставить("ФормаИА_СортировщикСтрок_Вниз",Тип("КнопкаФормы")
    , ГруппаКнопокПриемник
    , );
    НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
    НовыйЭлемент.ИмяКоманды = "ИА_СортировщикСтрок_Вниз";
    
    // ******   Кнопка формы "ФормаИА_СортировщикСтрок_Вверх"    ***********
    
    НовыйЭлемент = Форма.Элементы.Вставить("ФормаИА_СортировщикСтрок_Вверх",Тип("КнопкаФормы")
    , ГруппаКнопокПриемник);
    НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
    НовыйЭлемент.ИмяКоманды = "ИА_СортировщикСтрок_Вверх";
КонецПроцедуры

Процедура УФ_СортировкаЭлементовДанных_ИзменитьПорядок(Настройки, Реквизит, Направление) Экспорт
	Если Не ЗначениеЗаполнено(Реквизит) Тогда
    	Возврат
    КонецЕсли;
    
    ТекстЗапроса =
    "ВЫБРАТЬ
    |   Т.Ссылка КАК Спр,
    |   Т.ИА_ПорядокСортировки КАК ПорядокСтарый,
    |   Т.ИА_ПорядокСортировки КАК ПорядокНовый,
    |   ВЫБОР
    |       КОГДА Т.Ссылка = &Спр
    |           ТОГДА ИСТИНА
    |       ИНАЧЕ ЛОЖЬ
    |   КОНЕЦ КАК Изменяемый
    |ИЗ
    |   Справочник.Контрагенты КАК Т
    |ГДЕ
    |   НЕ Т.ЭтоГруппа
    |   И Т.Родитель = &Родитель
    |
    |УПОРЯДОЧИТЬ ПО
    |   ПорядокСтарый,
    |   Т.Наименование";
    
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Контрагенты", Настройки.ИмяОбъектаМД);
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИА_ПорядокСортировки",   Настройки.ИмяПоляПорядка);
    
    Если НЕ Настройки.Иерархия Тогда
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕ Т.ЭтоГруппа",   "истина");
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Т.Родитель = &Родитель",   "");
    КонецЕсли; 
    
    Таб = ИА_БФС.Запрос_ВыполнитьВТЗ(ТекстЗапроса, Новый Структура("Спр, Родитель", Реквизит, Реквизит.Родитель));
    
    Ц =  0;
    Для каждого Стр Из Таб Цикл
        Ц = Ц + 1;
        Стр.ПорядокНовый = Ц;
    КонецЦикла;
    
    СтрокаИзменяемого = Таб.Найти(Истина, "Изменяемый");
    Если СтрокаИзменяемого = Неопределено Тогда
        Возврат;
    КонецЕсли; 
    
    СтрокаИзменяемого.ПорядокНовый = СтрокаИзменяемого.ПорядокНовый + Направление;
    
    Если СтрокаИзменяемого.ПорядокНовый = 0 И СтрокаИзменяемого.ПорядокСтарый = 1 Тогда
        // В конец
    	СтрокаИзменяемого.ПорядокНовый = Таб.Количество() + 1;
    ИначеЕсли СтрокаИзменяемого.ПорядокНовый = Таб.Количество() + 1 И СтрокаИзменяемого.ПорядокСтарый = Таб.Количество() Тогда
        // В начало
    	СтрокаИзменяемого.ПорядокНовый = 0;
    КонецЕсли;
    
    Таб.Сортировать("ПорядокНовый, Изменяемый " + ?(Направление > 0, "", "УБЫВ"));
    
    Ц =  0;
    Для каждого Стр Из Таб Цикл
        Ц = Ц + 1;
        Стр.ПорядокНовый = Ц;
    КонецЦикла;
    
    // Изменим в базе
    НачатьТранзакцию();
    Для каждого Стр Из Таб Цикл
    	Если Стр.ПорядокНовый <> Стр.ПорядокСтарый Тогда
        	Спр = Стр.Спр.ПолучитьОбъект();
            Спр [Настройки.ИмяПоляПорядка]  = Стр.ПорядокНовый;
            Спр.Записать();
        КонецЕсли; 
    КонецЦикла; 
    ЗафиксироватьТранзакцию();
КонецПроцедуры

//#КонецОбласти 