&НаКлиенте
Процедура Отчеты(Команда)
	сп = новый СписокЗначений;
	сп.Добавить("КСУ_ДвиженияПоФондам","Движение по фондам");
	сп.Добавить("КСУ_СостояниеФондов","Остатки на счетах и фондах");
	сп.Добавить("ИА_КонтрольПлатежейВнеФондов","Контроль платежей вне фондов");
		
	оп = новый ОписаниеОповещения("ВыбОтчет", ЭтотОбъект);
	ПоказатьВыборИзСписка(оп, сп, Элементы.Декорация6);
КонецПроцедуры

&НаКлиенте
Процедура ВыбОтчет(выбЗн, ДопПарам) Экспорт
	Если выбЗн <> Неопределено Тогда
		ОткрытьФорму("Отчет."+выбЗн.Значение+".Форма");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПомеченные(Команда)
	Элементы.КомандаПоказатьПомеченные.Пометка = не Элементы.КомандаПоказатьПомеченные.Пометка;
	
	УстОтборПомеченных(Элементы.КомандаПоказатьПомеченные.Пометка);
КонецПроцедуры

&НаСервере
Процедура УстОтборПомеченных(ТекЗн)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ТекЗн);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПомеченные", ложь);
КонецПроцедуры
