
Процедура ПриЗаписи(Отказ)
	
	ЕстьКонтрольПоТипамИнструкций = Константы.ИА_ДИ_КонтрольПоТипамИнструкций.Получить();
	ЕстьКонтрольПоСтатусам        = Константы.ИА_ДИ_КонтрольПоСтатусам.Получить();
	ЕстьКонтрольПоСериям          = Константы.ИА_ДИ_КонтрольПоСериям.Получить();
	
	//////////// Обновление доступных инструкций ////////////////
	Набор = РегистрыСведений.ИА_ДоступныеИнструкции.СоздатьНаборЗаписей();
	Набор.Отбор.Инструкция.Значение = Ссылка;
	Набор.Отбор.Инструкция.Использование = Истина;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СписокАдминов = Новый СписокЗначений;
	//Админы
	Запрос.Текст = Запрос.Текст + " ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИА_УровниДоступаПользователей.Пользователь, 1 КАК ЕстьДоступ
	|ИЗ
	|	РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
	|ГДЕ
	|	ИА_УровниДоступаПользователей.ОбъектДоступа = &Админ И ИА_УровниДоступаПользователей.Пользователь <> ЗНАЧЕНИЕ(справочник.пользователи.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Админ", Справочники.ОргСхема.ПустаяСсылка());
	ВыборкаПольз = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПольз.Следующий() Цикл
		НовЗап = Набор.Добавить();
		НовЗап.Инструкция = Ссылка;
		НовЗап.Пользователь = ВыборкаПольз.Пользователь;
		
		СписокАдминов.Добавить(ВыборкаПольз.Пользователь);
	КонецЦикла;
	
	
	СписокПольз = Новый СписокЗначений;
	// ПОСТЫ
	Для каждого стр из КодыРаспределения Цикл
		Если стр.КодРаспределения.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИА_УровниДоступаПользователей.Пользователь
		|ИЗ
		|	РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
		|ГДЕ
		|	ИА_УровниДоступаПользователей.ОбъектДоступа = &ОбъектДоступа";
		Запрос.УстановитьПараметр("ОбъектДоступа", стр.КодРаспределения);
		Если стр.ВсемСотрудникам Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "= &ОбъектДоступа", "В ИЕРАРХИИ(&ОбъектДоступа)");
		КонецЕсли;
		
		ВыборкаПольз = Запрос.Выполнить().Выбрать();
		Пока ВыборкаПольз.Следующий() Цикл
			Если СписокПольз.НайтиПоЗначению(ВыборкаПольз.Пользователь) = Неопределено Тогда
				СписокПольз.Добавить(ВыборкаПольз.Пользователь);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	1 КАК Доступно
	|ПОМЕСТИТЬ ДоступПоПостам
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	&Отбор = Ложь ИЛИ Пользователи.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Отбор", КодыРаспределения.Количество()>0);
	Запрос.УстановитьПараметр("Ссылка", СписокПольз);
	Запрос.Выполнить();
	
	// главный запрос
	
	счОтборов = 1;
	ТекстЗапроса = "ВЫБРАТЬ
	|	Подзапрос.Пользователь,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Подзапрос.Доступно) КАК Доступно
	|ИЗ 
	|	
	|    (ВЫБРАТЬ
	|		ДоступПоПостам.Пользователь КАК Пользователь,
	|		1 КАК Доступно
	|	ИЗ
	|		ДоступПоПостам КАК ДоступПоПостам
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДоступПоПостам.Пользователь ";
	Если ЕстьКонтрольПоСериям Тогда
		ТекстЗапроса = ТекстЗапроса+"		   
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИА_УровниДоступаПользователей.Пользователь,
		|		2
		|	ИЗ
		|		РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
		|	ГДЕ
		|		(ИА_УровниДоступаПользователей.ОбъектДоступа В (&Серии)
		|				ИЛИ &ОтборПоСериям = ЛОЖЬ)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИА_УровниДоступаПользователей.Пользователь";
		счОтборов = счОтборов + 1;
	КонецЕсли;
	
	Если ЕстьКонтрольПоТипамИнструкций Тогда
		ТекстЗапроса = ТекстЗапроса+"
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИА_УровниДоступаПользователей.Пользователь,
		|		3
		|	ИЗ
		|		РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
		|	ГДЕ
		|		(ИА_УровниДоступаПользователей.ОбъектДоступа = &ТипИснтрукции
		|				ИЛИ &ОтборПоТипу = ЛОЖЬ)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИА_УровниДоступаПользователей.Пользователь ";
		счОтборов = счОтборов + 1;
	КонецЕсли;
	
	Если ЕстьКонтрольПоСтатусам Тогда
		ТекстЗапроса = ТекстЗапроса+"
		
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИА_УровниДоступаПользователей.Пользователь,
		|		4
		|	ИЗ
		|		РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
		|	ГДЕ
		|		(ИА_УровниДоступаПользователей.ОбъектДоступа = &Статус
		|				ИЛИ &ОтборПоСтатусу = ЛОЖЬ)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИА_УровниДоступаПользователей.Пользователь";
		счОтборов = счОтборов + 1;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса+"
	|) КАК Подзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Пользователь
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Подзапрос.Доступно) = &счОтборов";
	
	Запрос.УстановитьПараметр("счОтборов", счОтборов);
	Запрос.Текст = ТекстЗапроса;			
	Если ЕстьКонтрольПоСериям Тогда	
		Запрос.УстановитьПараметр("Серии", Серии.ВыгрузитьКолонку("Серия"));
		Запрос.УстановитьПараметр("ОтборПоСериям", Серии.Количество()>0);
	КонецЕсли;
	
	Если ЕстьКонтрольПоТипамИнструкций Тогда
		Запрос.УстановитьПараметр("ТипИснтрукции", ТипИнструкции);
		Запрос.УстановитьПараметр("ОтборПоТипу", ЗначениеЗаполнено(ТипИнструкции));
	КонецЕсли;
	
	Если ЕстьКонтрольПоСтатусам Тогда
		Запрос.УстановитьПараметр("Статус", Статус);
		Запрос.УстановитьПараметр("ОтборПоСтатусу", ЗначениеЗаполнено(Статус));
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СписокАдминов.НайтиПоЗначению(Выборка.Пользователь) = Неопределено ТОгда
			НовЗап = Набор.Добавить();
			НовЗап.Инструкция = Ссылка;
			НовЗап.Пользователь = Выборка.Пользователь;
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
	// обновим теги для поиска
	ИА_Инструкции.ОбновитьТегиПоИнструкции(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		СписокТегов.Очистить();
		
		стр = Теги;
		стр = СтрЗаменить(стр, ".", " ");
		стр = СтрЗаменить(стр, ",", " ");
		стр = СтрЗаменить(стр, "+", " ");
		стр = СтрЗаменить(стр, "-", " ");
		стр = СтрЗаменить(стр, "/", " ");
		
		// уберем двойной пробел
		Пока Найти(Стр,"  ")>0 Цикл
			стр = СтрЗаменить(стр, "  ", " ");
		КонецЦикла;
		
		стр = СтрЗаменить(стр, " ", Символы.ПС);
		
		Для Н = 1 по СтрЧислоСтрок(стр) Цикл
			СписокТегов.Добавить().Тег = ВРЕГ(СтрПолучитьСтроку(Стр, Н));
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

