&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрДС(Элементы, Имя, Значение)
    Эл = Элементы.Найти(Имя);
    Если Эл <> Неопределено Тогда
        Эл.Значение = Значение;
        Эл.Использование = Истина;
    КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимостьДоступность()
    Элементы.ГрафСхема.ТолькоПросмотр = НЕ РежимРедактирования;
    
    ////Элементы.кпГрафСхема.Видимость = РежимРедактирования;
    
    Элементы.ФормаГрупповаяУстановкаРеквизитовТочек.Видимость = НЕ РежимРедактирования;
    Элементы.ГруппаПакетнаяОбработка.Видимость = НЕ РежимРедактирования И РежимПакетнойУстановкиРеквизитовТочек;
    
    Элементы.ГруппаРеквизиты.Видимость = НЕ РежимПакетнойУстановкиРеквизитовТочек;
КонецПроцедуры


&НаСервере
Процедура ВывестиСхему()
    Если НЕ РежимРедактирования Тогда
        Карта = Справочники.ИА_БПКартыМаршрутов.ПолучитьКартуМаршрута(Объект.ТекущаяКартаМаршрута);
        ГрафСхема = Карта;
    Иначе
        // Тут заполним "Ответственных"
        Карта = ИА_БФС.КопияОбъекта(ГрафСхема);
        Справочники.ИА_БПКартыМаршрутов.ЗаполнитьВКартеСвязанныеДанные(Карта, Объект.ТекущаяКартаМаршрута);
        ГрафСхема = Карта;
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СоздатьВерсию()
    Справочники.ИА_БПМаршрутЗадач.СоздатьНовуюВерсиюДляМаршрутаЗадач(Объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура НачатьРедактирование(СоздаватьНовуюВерсию)
    Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
        ЭтаФорма.Записать();
    КонецЕсли; 
    
    Если НЕ Объект.Ссылка.Пустая()  Тогда
        Если СоздаватьНовуюВерсию Тогда
            СоздатьВерсию();    
            ОповеститьОбИзменении(Объект.Ссылка);
            ЭтаФорма.Прочитать();
            ЭтаФорма.ОбновитьОтображениеДанных();
            ВывестиСхему();
        КонецЕсли; 
        // ИА_Аврамов 15.04.2015  ПоказатьЗначение(,Объект.ТекущаяКартаМаршрута);
        
        Элементы.ФормаРедактировать.Пометка = НЕ Элементы.ФормаРедактировать.Пометка;
        РежимРедактирования = Элементы.ФормаРедактировать.Пометка;
        УстановитьВидимостьДоступность();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьКоличествоБП()
    Колво = 0;
    Если НЕ Объект.Ссылка.Пустая() Тогда
        М = Справочники.ИА_БПКартыМаршрутов.ПолучитьСписокБППоКартеМаршрута(Объект.Ссылка, "Стартован И НЕ Завершен");
        Колво = М.Количество();
    КонецЕсли;
    
    Если Колво = 0 Тогда
        Элементы.НадписьБП.Заголовок = "Выполняемых процессов нет";
    Иначе
        Элементы.НадписьБП.Заголовок = "Выполняемых процессов: " + Колво;
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Пакет_ДобавитьТочку(Точка)
	НовСтрока = ТаблицаТочек.Добавить();
    НовСтрока.Точка = Точка;
    
    Пакет_ПроверитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура Пакет_ПроверитьТаблицуНаСервере()
    СписокТипов = ИА_БФКС.Массив_Новый(
    Перечисления.ИА_БПТипыТочекМаршрута.Действие
    ,Перечисления.ИА_БПТипыТочекМаршрута.Условие);
    
	ТЗ = ТаблицаТочек.Выгрузить();
    ИА_БФС.ТЗ_УдалитьДубликаты(ТЗ, "Точка");    
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ТЗ, "НЕ ИА_БФКС.Массив_Содержит(Контекст, СтрокаТЗ.Точка.Тип)", СписокТипов);    
    
    ТаблицаТочек.Загрузить(ТЗ);
КонецПроцедуры
 
 
//_____________________________________________________________

&НаКлиенте
Процедура ОбновлениеГрафСхемыНачать()
    ГрафСхемаКопия = ГрафСхема;
    ГрафСхема = Неопределено;
    ПодключитьОбработчикОжидания("ОбновлениеГрафСхемыЗакончить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеГрафСхемыЗакончить()
    ГрафСхема = ГрафСхемаКопия;
КонецПроцедуры



//_____________________________________________________________

&НаКлиенте
Процедура ГрафСхемаВыбор(Элемент)
    Если Элемент.ТекущийЭлемент <> Неопределено Тогда
        
        Если РежимПакетнойУстановкиРеквизитовТочек Тогда
            Точка = ПолучитьТочкуНаСервере(Элемент.ТекущийЭлемент.Имя);
            Если ЗначениеЗаполнено(Точка) Тогда
                Пакет_ДобавитьТочку(Точка);
            КонецЕсли;            
        Иначе
            ОткрытьТочку(Элемент.ТекущийЭлемент.Имя);
        КонецЕсли; 
        
        
    КонецЕсли;     
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТочку(ИмяТочки)
    Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
    	ЭтаФорма.Записать();
    КонецЕсли; 
    
    Если НЕ Объект.Ссылка.Пустая() Тогда
        Точка = ПолучитьТочкуНаСервере(ИмяТочки);
        Если ЗначениеЗаполнено(Точка) Тогда
            П = Новый Структура("Ключ, ТолькоПросмотр", Точка, НЕ РежимРедактирования);
            ОткрытьФорму("Справочник.ИА_БПТочкиМаршрута.ФормаОбъекта", П);
        КонецЕсли; 
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТочкуНаСервере(ИмяТочки)
    Точка = Справочники.ИА_БПКартыМаршрутов.ПолучитьТочку(Объект.ТекущаяКартаМаршрута, ИмяТочки);
    Возврат Точка;    
КонецФункции

&НаКлиенте
Процедура ТекущаяКартаМаршрутаПриИзменении(Элемент)
    ВывестиСхему();
    ОбновлениеГрафСхемыНачать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если НЕ ИА_Защита_Общий.ЛицензияДоступна("НФ", Отказ) Тогда Возврат КонецЕсли; 
    
    ЭтоНовый = Объект.Ссылка.Пустая();
    ВывестиСхему();
    
    Если ЭтоНовый Тогда
        Элементы.странцаВерсииМаршрута.Видимость = Ложь;
    Иначе        
        УстановитьПараметрДС(СписокКарт.Параметры.Элементы, "МаршрутЗадач", Объект.Ссылка);	
    КонецЕсли; 
    СформироватьКоличествоБП();
    ТипыВладельцев_Загрузить();
    
    Контекст = Новый Структура("Параметры, Объект, Форма", Параметры, Объект, ЭтаФорма);
    ИА_БПСПереопределяемый.Формы_Точка_Маршрут_ПриСозданииНаСервере(Контекст);
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
    РежимПакетнойУстановкиРеквизитовТочек = Ложь;
    
    Если РежимРедактирования Тогда
        ЭтаФорма.Записать(); // Запишем всё и карту
        РежимРедактирования = Ложь; // Отключим режим
        Элементы.ФормаРедактировать.Пометка = РежимРедактирования;
        
        УстановитьВидимостьДоступность();
        Возврат;
    КонецЕсли; 
    
    
    
    Если НЕ ЗначениеЗаполнено(Объект.ТекущаяКартаМаршрута) Тогда
        НачатьРедактирование(Истина);
    Иначе
        Режим = РежимДиалогаВопрос.ОКОтмена;  
        СЗ = Новый СписокЗначений;
        СЗ.Добавить(КодВозвратаДиалога.Да, "Текущую");
        СЗ.Добавить(КодВозвратаДиалога.Нет, "Создать новую");
        СЗ.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
        Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
        ПоказатьВопрос(Оповещение, "Вы хотите отредактировать текущую карту маршрута или создать новую ?
        |ВНИМАНИЕ! Редактирование текущей карты может привести к неработоспособности уже запущенных по ней процессов", СЗ, 0, КодВозвратаДиалога.Да);
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        НачатьРедактирование(Ложь);
    ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
        НачатьРедактирование(Истина);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ИмяСобытия = "ОбновитьКарты" И Объект.ТекущаяКартаМаршрута = Параметр Тогда
        ВывестиСхему();
        ОбновлениеГрафСхемыНачать();
        СформироватьКоличествоБП();
    ИначеЕсли ИмяСобытия = "ИА_ТочкаКМИзменена" И Параметр.ВладелецФормы = ЭтаФорма Тогда
        УстановитьРеквизитыТочек(Параметр.ДанныеПакета);
        ТаблицаТочек.Очистить();
        Оповестить("ОбновитьКарты", Объект.ТекущаяКартаМаршрута);
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеДанные(Команда)
    Элементы.ГруппаСлужебные.ТолькоПросмотр = Ложь;     
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    Элементы.странцаВерсииМаршрута.Видимость = Истина;
    УстановитьПараметрДС(СписокКарт.Параметры.Элементы, "МаршрутЗадач", Объект.Ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура НадписьБПНажатие(Элемент)
    Если НЕ Объект.Ссылка.Пустая() Тогда
        Отбор = Новый Структура("ИА_МаршрутЗадачБП, Стартован, Завершен"
        , Объект.Ссылка, Истина, Ложь);
        
        П = Новый Структура("Отбор, ", Отбор);
        ОткрытьФорму("БизнесПроцесс.ИА_БПНоситель.ФормаСписка", П,,ЭтаФорма.УникальныйИдентификатор);
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеВладельцыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    //Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ТекущийОбъект = Справочники.ИА_БПМаршрутЗадач.СоздатьЭлемент();
    #КОНЕЦЕСЛИ
    
    Если РежимРедактирования Тогда
        Спр = ТекущийОбъект.ТекущаяКартаМаршрута.ПолучитьОбъект();
        Спр.Карта = Новый ХранилищеЗначения(ГрафСхема);
        Спр.Записать();
    КонецЕсли; 
    
КонецПроцедуры

&НаСервере
Процедура ТипыВладельцев_Загрузить()
    ОТ = ИА_БФС.Типы_ТаблицаСтроковыхТипов2ОписаниеТипов(Объект.ДоступныеВладельцы.Выгрузить());
    ОписаниеТиповВладельцев = ОТ;
КонецПроцедуры

&НаСервере
Процедура ТипыВладельцев_Выгрузить()
    Объект.ДоступныеВладельцы.Очистить();
    Таб = ИА_БФС.Типы_ОписаниеТипов2ТаблицаСтроковыхТипов(ОписаниеТиповВладельцев);
    Объект.ДоступныеВладельцы.Загрузить(Таб);
КонецПроцедуры


&НаКлиенте
Процедура ОписаниеТиповВладельцевПриИзменении(Элемент)
    ТипыВладельцев_Выгрузить();
    Модифицированность = Истина
КонецПроцедуры


&НаКлиенте
Процедура ДопРеквизиты(Команда)
    Если Объект.Ссылка.Пустая() Тогда
        ЭтаФорма.Записать();
    КонецЕсли; 
    
    Если НЕ Объект.Ссылка.Пустая() Тогда
        ОткрытьФорму("ПланВидовХарактеристик.ИА_БПРеквизиты.ФормаСписка"
        , Новый Структура("Отбор", Новый Структура("ВладелецРеквизита", Объект.Ссылка) ));
    КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ГрафСхемаПриИзменении(Элемент)
    Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимостьДоступность();
КонецПроцедуры


&НаКлиенте
Процедура ГрафСхемаПриАктивизации(Элемент)
    //    ИА_БФКС.СообщениеОбОшибке(""+Элемент.текущийЭлемент); 
КонецПроцедуры

&НаКлиенте
Процедура ГрупповаяУстановкаРеквизитовТочек(Команда)
    РежимПакетнойУстановкиРеквизитовТочек     = НЕ РежимПакетнойУстановкиРеквизитовТочек;
    Если РежимПакетнойУстановкиРеквизитовТочек Тогда
    	Пакет_Ответственный = Истина;
        Пакет_ДлительностьВыполнения = Истина;
    КонецЕсли; 
    
    Элементы.ФормаГрупповаяУстановкаРеквизитовТочек.Пометка = РежимПакетнойУстановкиРеквизитовТочек;
    УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРеквизиты(Команда)
    Пакет_ПроверитьТаблицуНаСервере();
    Если ТаблицаТочек.Количество() = 0 Тогда
    	ИА_БФКС.СообщениеОбОшибке("Нет точек для установки!"); 
        Возврат;
    КонецЕсли; 
    Если НЕ Пакет_Ответственный
        И НЕ Пакет_ДлительностьВыполнения
        Тогда
        ИА_БФКС.СообщениеОбОшибке("Не заданы устанавливаемые реквизиты!"); 
    	Возврат
    КонецЕсли; 
    
    ПерваяТочка = ТаблицаТочек[0].Точка;
    СписокТочек = Новый Массив;
    Для каждого Стр Из ТаблицаТочек Цикл
    	СписокТочек.Добавить(Стр.Точка);
    КонецЦикла; 
    ДанныеПакета = Новый Структура("СписокТочек, Пакет_Ответственный, Пакет_ДлительностьВыполнения"
    , СписокТочек
    , Пакет_Ответственный
    , Пакет_ДлительностьВыполнения);
    
    
    П = Новый Структура("Ключ, РежимПакета, ДанныеПакета", ПерваяТочка, Истина, ДанныеПакета);
    ОткрытьФорму("Справочник.ИА_БПТочкиМаршрута.ФормаОбъекта", П
    , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);    
КонецПроцедуры

&НаСервере
Процедура УстановитьРеквизитыТочек(ДанныеПакета)
	СписокТочек                  = ДанныеПакета.СписокТочек;
    Пакет_Ответственный          = ДанныеПакета.Пакет_Ответственный;
    Пакет_ДлительностьВыполнения = ДанныеПакета.Пакет_ДлительностьВыполнения;
    
    ПерваяТочка = Неопределено;
    
    Для каждого Точка Из  СписокТочек Цикл
    	Если ПерваяТочка = Неопределено Тогда
        	ПерваяТочка = Точка;
        Иначе
            Спр = Точка.ПолучитьОбъект();
            #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
                Спр = Справочники.ИА_БПТочкиМаршрута.СоздатьЭлемент(); ПерваяТочка = Спр.Ссылка;
            #КОНЕЦЕСЛИ
            
            Если Пакет_Ответственный Тогда
                Спр.Ответственный = ПерваяТочка.Ответственный;
                
                Отбор = Новый Структура("Событие", Перечисления.ИА_БПСобытияТочекБП.УстановкаОтветственного);
                ТабСобытие = ИА_БФС.ТЗ_ФильтрПоОтбору(ПерваяТочка.Обработчики.Выгрузить(), Отбор);
                
                Таб = Спр.Обработчики.Выгрузить();
                ИА_БФС.ТЗ_ВставитьТЗПоИзмерениямВДругую(ТабСобытие, Таб, Отбор);
                Спр.Обработчики.Загрузить(Таб);
            КонецЕсли; 
            
            Если Пакет_ДлительностьВыполнения Тогда
                ЗаполнитьЗначенияСвойств(Спр, ПерваяТочка
                , "ВариантДлительности, ДлительностьВыполнения");
            КонецЕсли; 
            
            Спр.Записать();
        КонецЕсли; 
    КонецЦикла; 
    
КонецПроцедуры
 