
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// при создании из-под контрагентов заполняется ОбъектВладелец
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда	
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ №14571 регистрация на выгрузку в Б24 (если указан владелец и он проходит по отбору)
	Если Не Отказ И ЗначениеЗаполнено(ОбъектВладелец) Тогда
		ОбменСБитрикс24ВызовСервера.ЗарегистрироватьОбъектКОбмену(ЭтотОбъект);
	КонецЕсли;
	//-- №14571
	
КонецПроцедуры
