//#12463 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПерсональныеНастройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПанелиОтчетИзбранное", "КоличествоКолонок");
	Если ПерсональныеНастройки <> Неопределено Тогда
		КоличествоКолонок = ПерсональныеНастройки;
	Иначе
		КоличествоКолонок = 2;
	КонецЕсли;
	
	ЗаполнитьТаблицуОтчетов();	
	ОбновитьПредставленияОтчетов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаПанели(Команда)
	
	ПараметрыВыбора = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаПанелиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВариантыОтчетов.Форма.ФормаНастройкиПанелиИзбранное", ПараметрыВыбора, ЭтаФорма, УникальныйИдентификатор, , , ОписаниеОповещения);	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПанелиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоКолонок = Результат;
	
	ЗаполнитьТаблицуОтчетов();	
	ОбновитьПредставленияОтчетов(Истина, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеОбработчикиЭлементовФормы

&НаКлиенте
Процедура Подключаемый_ОтчетНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УИД = СтрЗаменить(Элемент.Имя, "Поле_", "");
	ДанныеОтчета = ДанныеОтчетаПоИдентификатору(УИД);
	Если НЕ ЗначениеЗаполнено(ДанныеОтчета.Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеОтчета.Вариант) = Тип("СправочникСсылка.ВариантыОтчетов") Тогда
		ОткрытьОтчет(ДанныеОтчета.Вариант);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗаполнитьТаблицуОтчетов()
	
	ТаблицаОтчетов.Очистить();	
	ТаблицаОтчетов.Загрузить(ОтчетыПотолки.ТаблицаОтчетовПользователяНаНачальнойСтранице());	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставленияОтчетов(УдалитьЭлементы = Ложь, УдалятьСвязанныеРеквизиты = Ложь, ДобавлятьРеквизитыФормы = Истина)
	
	Если УдалитьЭлементы Тогда
		УдаляемыеРеквизиты = УдалитьЭлементыПредставленияОтчетов();		
		
		// удаляем реквизиты с формы
		Если УдалятьСвязанныеРеквизиты Тогда
			ИзменитьРеквизиты(, УдаляемыеРеквизиты);
		КонецЕсли;
	КонецЕсли;
		
	Если ДобавлятьРеквизитыФормы Тогда
		// для каждого отчета создаем реквизит формы типа Строка, который будет выведен на форму как "Поле картинки"	
		ДобавляемыеРеквизиты = Новый Массив;
		Для каждого СтрокаТЗ Из ТаблицаОтчетов Цикл
			
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Поле_" + СтрокаТЗ.УИД, 
				Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(0))));
			
		КонецЦикла;	

		Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		КонецЕсли;
	КонецЕсли;
	
	КоличествоКнопок = ТаблицаОтчетов.Количество();
	СчКолонок = 1;
	Для Индекс = 1 По КоличествоКнопок Цикл
		СтрокаТЗ = ТаблицаОтчетов[Индекс-1];
		
		ИмяГруппы = "Группа" + Строка(СчКолонок);
		
		ВывестиПредставлениеОтчетаНаФорму(СтрокаТЗ, Элементы[ИмяГруппы]);
		
		СчКолонок = СчКолонок + 1;
		СчКолонок = ?(СчКолонок > КоличествоКолонок, 1, СчКолонок);
	КонецЦикла;
	
	КоличествоЗаглушек = КоличествоКолонок - (СчКолонок-1);
	Для Индекс = 1 По КоличествоЗаглушек Цикл

		ИмяГруппы = "Группа" + Строка(СчКолонок);
		
		ДекорацияЗаглушка = Элементы.Добавить("Заглушка_Декорация" + Строка(Индекс), Тип("ДекорацияФормы"), Элементы[ИмяГруппы]);
		ДекорацияЗаглушка.Вид = ВидДекорацииФормы.Картинка;
		ДекорацияЗаглушка.РастягиватьПоГоризонтали = Истина;
		ДекорацияЗаглушка.Ширина = ШиринаПредставленияОтчета();
		
		СчКолонок = СчКолонок + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВывестиПредставлениеОтчетаНаФорму(СтрокаТЗ, ГруппаОтчета)
	
	ПредставлениеОтчета = Элементы.Добавить("Поле_" + СтрокаТЗ.УИД, Тип("ПолеФормы"), ГруппаОтчета);
	ПредставлениеОтчета.Вид = ВидПоляФормы.ПолеКартинки;
	ПредставлениеОтчета.ПутьКДанным = "Поле_" + СтрокаТЗ.УИД;
	ПредставлениеОтчета.Заголовок = "";
	ПредставлениеОтчета.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	//ПредставлениеОтчета.РазмерКартинки = РазмерКартинки.Пропорционально;
	//ПредставлениеОтчета.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная, 1);
	//ПредставлениеОтчета.ЦветРамки = ЦветаСтиля.ЦветТекстаНевыбраннойКартинки;
		
	ТекстНевыбраннойКартинки = СтрШаблон("%1%2(%3)", 
											СтрЗаменить(Строка(СтрокаТЗ.Отчет), "(Отчет)", ""),
											Символы.ПС, // перенос работает только при масштабировании
											СтрокаТЗ.Наименование);	
	ПредставлениеОтчета.ТекстНевыбраннойКартинки = ТекстНевыбраннойКартинки;
	
	ПредставлениеОтчета.Ширина = ШиринаПредставленияОтчета();
	ПредставлениеОтчета.Высота = 7;
	//ПредставлениеОтчета.Высота = Окр(25 / КоличествоОтчетовВСтроке() * ?(ШиринаЭкрана = 0, 1, (ШиринаЭкрана - 160) / 1209));
	ПредставлениеОтчета.РастягиватьПоВертикали = Ложь;
	ПредставлениеОтчета.Шрифт = Новый Шрифт(ПредставлениеОтчета.Шрифт, , 12, Истина);
	ПредставлениеОтчета.ЦветТекста = Новый Цвет(100, 176, 16);//WebЦвета.ЦветМорскойВолныНейтральный;
	ПредставлениеОтчета.Гиперссылка = Истина;
	ПредставлениеОтчета.УстановитьДействие("Нажатие", "Подключаемый_ОтчетНажатие");
	ПредставлениеОтчета.Подсказка = СтрокаТЗ.Описание;
			
	Возврат ПредставлениеОтчета;
	
КонецФункции

&НаСервере
Функция ШиринаПредставленияОтчета()
	
	Возврат 20;
	
КонецФункции

&НаСервере
Функция УдалитьЭлементыПредставленияОтчетов()
	
	ЭлементыКУдалению  = Новый Массив;
	СвязанныеРеквизиты = Новый Массив;
	
	Для каждого Элемент из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") И НЕ СтрНайти(Элемент.Имя, "Поле_") = 0 Тогда
			
			Для каждого Кнопка Из Элемент.КонтекстноеМеню.ПодчиненныеЭлементы Цикл
				ЭлементыКУдалению.Добавить(Кнопка);
				Команды.Удалить(Команды[Кнопка.ИмяКоманды]);
			КонецЦикла;
			
			ЭлементыКУдалению.Добавить(Элемент);
			СвязанныеРеквизиты.Добавить(Элемент.ПутьКДанным);
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("ДекорацияФормы") 
			И НЕ СтрНайти(Элемент.Имя, "Заглушка_Декорация") = 0 
			И СтрНайти(Элемент.Имя, "РасширеннаяПодсказка") = 0
			Тогда
			ЭлементыКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Элемент Из ЭлементыКУдалению Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	Возврат СвязанныеРеквизиты;
			
КонецФункции

&НаКлиенте
Функция ДанныеОтчетаПоИдентификатору(УИД)
	
	Результат = Новый Структура("Вариант, КлючВарианта, Отчет, Наименование");
	
	НайденныеСтроки = ТаблицаОтчетов.НайтиСтроки(Новый Структура("УИД", УИД));
	Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, НайденныеСтроки[0]);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьОтчет(Вариант)
	
	ПараметрыОткрытия = Новый Структура;	
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтаФорма, Вариант, ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти
