
Функция ПолучитьЦенуМатериалаВВалютеУчета(Знач ДатаЦены, Знач Контрагент, Знач Фактура, Знач ЦветФактуры, Знач ВидНоменклатуры = Неопределено, Знач ВидЦеныПоставщика) Экспорт
	
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныМатериаловСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныМатериаловПоставщиков.СрезПоследних(
	|			&ДатаЦены,
	|			Валюта = &Валюта
	|				И Контрагент = &Контрагент
	|				И ВидНоменклатуры = &ВидНоменклатуры
	|				И ЦветФактуры = &ЦветФактуры
	|				И Фактура = &Фактура
	|				И ВидЦеныПоставщика = &ВидЦеныПоставщика) КАК ЦеныМатериаловСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЦены",КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("Валюта",Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ЦветФактуры",ЦветФактуры);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Фактура",Фактура);
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	Запрос.УстановитьПараметр("ВидЦеныПоставщика",ВидЦеныПоставщика);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьЦенуМатериалаВВалютеУчетаСФотопечатью(Знач ДатаЦены, Знач Контрагент, Знач Фактура, Знач ЦветФактуры, Знач ВидНоменклатуры = Неопределено, Знач ВидЦеныПоставщика) Экспорт
	
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныМатериаловСрезПоследних.ЦенаСФотопечатью КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныМатериаловПоставщиков.СрезПоследних(
	|			&ДатаЦены,
	|			Валюта = &Валюта
	|				И Контрагент = &Контрагент
	|				И ВидНоменклатуры = &ВидНоменклатуры
	|				И ЦветФактуры = &ЦветФактуры
	|				И Фактура = &Фактура
	|				И ВидЦеныПоставщика = &ВидЦеныПоставщика) КАК ЦеныМатериаловСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЦены",КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("Валюта",Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ЦветФактуры",ЦветФактуры);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Фактура",Фактура);
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	Запрос.УстановитьПараметр("ВидЦеныПоставщика",ВидЦеныПоставщика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьЦенуМатериалаВВалюте(Знач ДатаЦены, Знач Контрагент, Знач Фактура, Знач ЦветФактуры, Знач Валюта, Знач ВидНоменклатуры = Неопределено, Знач ВидЦеныПоставщика) Экспорт
	
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныМатериаловСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныМатериаловПоставщиков.СрезПоследних(
	|			&ДатаЦены,
	|			Валюта = &Валюта
	|				И Контрагент = &Контрагент
	|				И ВидНоменклатуры = &ВидНоменклатуры
	|				И Фактура = &Фактура
	|				И ЦветФактуры = &ЦветФактуры
	|				И ВидЦеныПоставщика = &ВидЦеныПоставщика) КАК ЦеныМатериаловСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЦены",КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("ЦветФактуры",ЦветФактуры);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Фактура",Фактура);
	Запрос.УстановитьПараметр("Валюта",Валюта);
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	Запрос.УстановитьПараметр("ВидЦеныПоставщика",ВидЦеныПоставщика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьЦенуМатериалаВВалютеСФотопечатью(Знач ДатаЦены, Знач Контрагент, Знач Фактура, Знач ЦветФактуры, Знач Валюта, Знач ВидНоменклатуры = Неопределено, Знач ВидЦеныПоставщика) Экспорт
	
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныМатериаловСрезПоследних.ЦенаСФотопечатью КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныМатериаловПоставщиков.СрезПоследних(
	|			&ДатаЦены,
	|				Валюта = &Валюта
	|				И Контрагент = &Контрагент
	|				И ВидНоменклатуры = &ВидНоменклатуры
	|				И Фактура = &Фактура
	|				И ЦветФактуры = &ЦветФактуры
	|				И ВидЦеныПоставщика = &ВидЦеныПоставщика) КАК ЦеныМатериаловСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЦены",КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("ЦветФактуры",ЦветФактуры);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Фактура",Фактура);
	Запрос.УстановитьПараметр("Валюта",Валюта);
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	Запрос.УстановитьПараметр("ВидЦеныПоставщика",ВидЦеныПоставщика);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьЦенуМатериала(Знач Контрагент, Знач Фактура, Знач ЦветФактуры, ДатаЦены, ВалютаДокумента, Знач ВидНоменклатуры = Неопределено, Знач ВидЦеныПоставщика) Экспорт
	
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
	КонецЕсли;
	
	ЦенаНоменклатуры = ПолучитьЦенуМатериалаВВалюте(КонецДня(ДатаЦены),Контрагент, Фактура, ЦветФактуры, ВалютаДокумента, ВидНоменклатуры, ВидЦеныПоставщика);
	
	Если НЕ ЦенаНоменклатуры = 0 Тогда
		Возврат ЦенаНоменклатуры;
	КонецЕсли;
		
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	ОсновнаяВалютаПересчетаЦены = Константы.ОсновнаяВалютаПересчетаЦены.Получить();
	
	//++ №12971 комментируем
	//Если (ВалютаДокумента = ВалютаУчета)
	//	и (НЕ ВалютаДокумента = ОсновнаяВалютаПересчетаЦены) Тогда
	//	//пробуем получить цену по основной валюте пересчета цен, если валюта документа = валюта учета
	//	ЦенаНоменклатуры = ПолучитьЦенуМатериалаВВалюте(КонецДня(ДатаЦены), Контрагент, Фактура, ЦветФактуры, ОсновнаяВалютаПересчетаЦены, ВидНоменклатуры, ВидЦеныПоставщика);
	//	Если НЕ ЦенаНоменклатуры = 0 Тогда
	//		ДатаКурса = ДатаЦены;
	//		Если ДатаКурса = Дата(1,1,1) Тогда
	//			ДатаКурса = ТекущаяДатаСеанса();
	//		КонецЕсли;
	//		Результат = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ОсновнаяВалютаПересчетаЦены, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
	//	КонецЕсли;
	//Иначе
	//	//пробуем получить цену из прайса валюты учета и пересчитать по курсу документаНоменклатуры
	//	ЦенаНоменклатуры = ПолучитьЦенуМатериалаВВалютеУчета(КонецДня(ДатаЦены), Контрагент, Фактура, ЦветФактуры, ВидНоменклатуры, ВидЦеныПоставщика);
	//	ДатаКурса = ДатаЦены;
	//	Если ДатаКурса = Дата(1,1,1) Тогда
	//		ДатаКурса = ТекущаяДатаСеанса();
	//	КонецЕсли;
	//	Результат = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
	//КонецЕсли;
	//-- №12971 комментируем
	
	//++ №12971 по новому
	// 1. Если не нашли цену по валюте документа и задана валюта пересчета, ищем прайс в валюте пересчета
	//	(если нашли, то ставим цену в валюте документа по курсу к валюте пересчета)
	Если ЗначениеЗаполнено(ОсновнаяВалютаПересчетаЦены) Тогда
		
		ЦенаНоменклатуры = ПолучитьЦенуМатериалаВВалюте(КонецДня(ДатаЦены), Контрагент, Фактура, ЦветФактуры, ОсновнаяВалютаПересчетаЦены, ВидНоменклатуры, ВидЦеныПоставщика);
		
		Если НЕ ЦенаНоменклатуры = 0 Тогда
			
			ДатаКурса = ДатаЦены;
			
			Если ДатаКурса = Дата(1,1,1) Тогда
				ДатаКурса = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Возврат РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ОсновнаяВалютаПересчетаЦены, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// 2. Если не нашли цену по валюте пересчета, то ищем прайс в валюте учета (если валюта документа отличается от валюты учёта)
	//	(если нашли, то ставим цену в валюте документа по курсу к валюте учета)
	Если НЕ ВалютаДокумента = ВалютаУчета Тогда
		
		ЦенаНоменклатуры = ПолучитьЦенуМатериалаВВалютеУчета(КонецДня(ДатаЦены), Контрагент, Фактура, ЦветФактуры, ВидНоменклатуры, ВидЦеныПоставщика);
		
		Если НЕ ЦенаНоменклатуры = 0 Тогда
			
			ДатаКурса = ДатаЦены;
			
			Если ДатаКурса = Дата(1,1,1) Тогда
				ДатаКурса = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Возврат РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
			
		КонецЕсли;
		
	КонецЕсли;
	//-- №12971 по новому
		
	Возврат ЦенаНоменклатуры;
	
КонецФункции

Функция ПолучитьЦенуМатериалаСФотопечатью(Знач Контрагент, Знач Фактура, Знач ЦветФактуры, ДатаЦены, ВалютаДокумента, Знач ВидНоменклатуры = Неопределено, Знач ВидЦеныПоставщика) Экспорт
	
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
	КонецЕсли;
	Результат = 0;
	ЦенаНоменклатуры = ПолучитьЦенуМатериалаВВалютеУчетаСФотопечатью(КонецДня(ДатаЦены),Контрагент, Фактура, ЦветФактуры, ВидНоменклатуры, ВидЦеныПоставщика);
	
	Если ЦенаНоменклатуры = 0 Тогда
		
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		ОсновнаяВалютаПересчетаЦены = Константы.ОсновнаяВалютаПересчетаЦены.Получить();
		
		Если (ВалютаДокумента = ВалютаУчета)
			и (НЕ ВалютаДокумента = ОсновнаяВалютаПересчетаЦены) Тогда
			//пробуем получить цену по основной валюте пересчета цен, если валюта документа = валюта учета
			ЦенаНоменклатуры = ПолучитьЦенуМатериалаВВалютеУчетаСФотопечатью(КонецДня(ДатаЦены), Контрагент, Фактура, ЦветФактуры, ВидНоменклатуры, ВидЦеныПоставщика);
			Если НЕ ЦенаНоменклатуры = 0 Тогда
				ДатаКурса = ДатаЦены;
				Если ДатаКурса = Дата(1,1,1) Тогда
					ДатаКурса = ТекущаяДатаСеанса();
				КонецЕсли;
				Результат = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ОсновнаяВалютаПересчетаЦены, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
			КонецЕсли;
		Иначе
			//пробуем получить цену из прайса валюты учета и пересчитать по курсу документаНоменклатуры
			ЦенаНоменклатуры = ПолучитьЦенуМатериалаВВалютеУчетаСФотопечатью(КонецДня(ДатаЦены), Контрагент, Фактура, ЦветФактуры, ВидНоменклатуры, ВидЦеныПоставщика);
			ДатаКурса = ДатаЦены;
			Если ДатаКурса = Дата(1,1,1) Тогда
				ДатаКурса = ТекущаяДатаСеанса();
			КонецЕсли;
			Результат = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
		КонецЕсли;
	Иначе
		Результат = ЦенаНоменклатуры;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
