
&НаСервере
Процедура НомерТелефонаПриИзмененииНаСервере()
	УстановитьФильтрПоНомеруТелефона();
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)
	НомерТелефонаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьФильтрПоНомеруТелефона();
КонецПроцедуры

&НаСервере
Процедура КомандаНайтиНаСервере()
	УстановитьФильтрПоНомеруТелефона();
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайти(Команда)
	КомандаНайтиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтрПоНомеруТелефона()
	
	ЗначениеНомера = НомерТелефона; 
	Если НЕ ПустаяСтрока(ЗначениеНомера) Тогда
		Лиды.Параметры.УстановитьЗначениеПараметра("Телефон", "%" + ЗначениеНомера + "%");
	Иначе 
		Лиды.Параметры.УстановитьЗначениеПараметра("Телефон", "НеУказан");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛидыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//++ 16259
	СтандартнаяОбработка = Ложь;
	Ключ = Новый Структура("Ключ", ВыбраннаяСтрока);
	Форма = ПолучитьФорму("Документ.Лид.Форма.ФормаДокумента", Ключ); 
	Форма.Открыть();
	//-- 16259
КонецПроцедуры
