
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОчиститьПользователяВЗаписях(Пользователь) Экспорт
	
	// вызывается при удалении пользователя
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеРегистра.*
	|ИЗ
	|	РегистрСведений.ИсторияЗвонковАТС КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ИсторияЗвонковАТС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Дата.Установить(Выборка.Дата);
		НаборЗаписей.Отбор.Направление.Установить(Выборка.Направление);
		НаборЗаписей.Отбор.ВнутреннийНомер.Установить(Выборка.ВнутреннийНомер);
		НаборЗаписей.Отбор.Номер.Установить(Выборка.Номер);
		НаборЗаписей.Отбор.ИД.Установить(Выборка.ИД);
		НаборЗаписей.Отбор.Логин.Установить(Выборка.Логин);
		НаборЗаписей.Отбор.ИДВАТС.Установить(Выборка.ИДВАТС);
		НаборЗаписей.Прочитать();		
		
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Пользователь = Справочники.Пользователи.ПустаяСсылка();
		КонецЦикла;
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли