
Процедура ПередЗаписью(Отказ, Замещение)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НаборКонстант = Константы.СоздатьНабор("АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкам, 
									|АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкамТолькоСРекламнымИсточником,
									|ДатаНачалаАвтоматическогоСозданияЛидовПоПропущеннымЗвонкам,
									|АвтоматическиСоздаватьЛидыПоПринятымЗвонкамОффлайн,
									|ДатаНачалаАвтоматическогоСозданияЛидовПоПринятымЗвонкамОффлайн");
	НаборКонстант.Прочитать();
		
	Если НаборКонстант.АвтоматическиСоздаватьЛидыПоПринятымЗвонкамОффлайн Тогда
		МассивВН = СофтФон.ВнутренниеНомераПринимающиеЗвонки();
	КонецЕсли;
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		
		//ТекЗапись.НомерТолькоЦифры = СофтФон.ОставитьТолькоЦифры(ТекЗапись.Номер);
		ТекЗапись.НомерФормат = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ТекЗапись.Номер);
		
		Если НЕ ТекЗапись.Обработан И НЕ ЗначениеЗаполнено(ТекЗапись.Лид) И ЗначениеЗаполнено(ТекЗапись.ИД) Тогда
			СтруктураВозврата = ОбщийМодуль.ПолучитьЛидПоIDЗвонка(ТекЗапись.ИД);
			ТекЗапись.Лид = СтруктураВозврата.ЛидСсылка;
			Если ЗначениеЗаполнено(ТекЗапись.Лид) Тогда
				ТекЗапись.Обработан 	= Истина;
				ТекЗапись.Действие 		= ?(СтруктураВозврата.Новый, Справочники.АвтоматическиеДействия.СозданНовыйЛид, Справочники.АвтоматическиеДействия.ОбновленЛид);
				ТекЗапись.Пользователь  = ?(СтруктураВозврата.Новый, ТекЗапись.Лид.Автор, Справочники.Пользователи.ПустаяСсылка());
				ТекЗапись.ДатаОбработки = СтруктураВозврата.Дата;
			Иначе
				НомерВИсключениях = СофтФонВызовСервера.НомерТелефонаВИсключениях(ТекЗапись.Номер);
				//#4889
				Если НЕ НомерВИсключениях И НЕ ПустаяСтрока(ТекЗапись.ЛинияНомер) Тогда
					ЛинияНомерМФ = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ТекЗапись.ЛинияНомер);
					НомерВИсключениях = СофтФонВызовСервера.НомерТелефонаВИсключениях(ЛинияНомерМФ);
				КонецЕсли;
				
				ДанныеЗвонка = Новый Структура("ИДЗвонка, ИДСессииЗвонка, ИДВАТС, НомерКлиента, ВнешняяЛиния, Пропущен, НовыйЗвонок, ЗвонокОффлайн",
												ТекЗапись.ИД, "", ТекЗапись.ИДВАТС, ТекЗапись.НомерФормат, ТекЗапись.ЛинияНомер, ТекЗапись.Пропущен, Ложь, Ложь);
				
				Если ТекЗапись.Пропущен 
					И НаборКонстант.АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкам
					И ТекЗапись.Дата >= НаборКонстант.ДатаНачалаАвтоматическогоСозданияЛидовПоПропущеннымЗвонкам
					И ТекЗапись.Направление = Перечисления.НаправлениеЗвонка.Входящий // №6325 необходимо создавать лиды только по входящим пропущенным звонкам
					И НЕ НомерВИсключениях
					Тогда
					
					// ищем Лид (без учета ИД)
					ДанныеЗвонка.ИДЗвонка = "";
					ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, Новый Структура, Ложь);
					// #15439 не заполнять автора
					//ПользовательЛида = СофтФон.НайтиПользователяПоВнутреннемуНомеру(ТекЗапись.ВнутреннийНомер);
					ПользовательЛида = Справочники.Пользователи.ПустаяСсылка();
					//++#6672
					РекламныйИсточник = Справочники.РекламныеИсточники.ПустаяСсылка();
					Если Не ПустаяСтрока(ТекЗапись.ЛинияНомер) Тогда
						РекламныйИсточник = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточникПоНомеруТелефонаНаСервере(ТекЗапись.ЛинияНомер);
					КонецЕсли;
					//--#6672
					
					//++ №6369 если включено создание лидов по пропущенным только когда определен рекламный источник
					Если НаборКонстант.АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкамТолькоСРекламнымИсточником И НЕ ЗначениеЗаполнено(РекламныйИсточник) Тогда
						Продолжить;
					КонецЕсли;
					//-- №6369
					
					РеквизитыЛида = Новый Структура("РекламныйИсточник, СпособСоздания, ДатаЗвонкаСоздавшегоЛид, ПользовательЛида", 
										   РекламныйИсточник, Перечисления.СпособыСозданияЛида.АвтоматическиПриРазбореИсторииАТС, ТекЗапись.Дата, ПользовательЛида); //#8090				
										   
					ДанныеЗвонка.ИДЗвонка = ТекЗапись.ИД;					   
					Если НЕ ЗначениеЗаполнено(ЛидСсылка) Тогда
						//++#6672
						ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, РеквизитыЛида, Истина);
						//--#6672
						ТекЗапись.Лид = ЛидСсылка;
						ТекЗапись.Обработан = Истина;
						ТекЗапись.Действие = Справочники.АвтоматическиеДействия.СозданНовыйЛид;
						ТекЗапись.ДатаОбработки = ТекущаяДатаСеанса();
						ТекЗапись.Пользователь  = ПользовательЛида;
						
						ОбщийМодуль.УстановитьНеобходимостьОбновленияАРМРозницы(); //Т.к. создался новый лид, нужно установить потребность обновления АРМ
					Иначе
						// вызовем ПолучитьЛидВРаботе для записи в историю лида и звонки лида
						//++#6672
						РеквизитыЛида.Вставить("Ссылка", ЛидСсылка);
						ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, РеквизитыЛида, Истина);
						//--#6672
						ТекЗапись.Лид = ЛидСсылка;
						ТекЗапись.Обработан = Истина;
						ТекЗапись.Действие = Справочники.АвтоматическиеДействия.ОбновленЛид;
						ТекЗапись.ДатаОбработки = ТекущаяДатаСеанса();
						ТекЗапись.Пользователь  = ПользовательЛида;
					КонецЕсли;
					
				// #16235 
				ИначеЕсли НЕ ТекЗапись.Пропущен
					И ТекЗапись.Направление = Перечисления.НаправлениеЗвонка.Входящий
					И ЗначениеЗаполнено(ТекЗапись.ВнутреннийНомер)
					И НаборКонстант.АвтоматическиСоздаватьЛидыПоПринятымЗвонкамОффлайн
					И ТекЗапись.Дата >= НаборКонстант.ДатаНачалаАвтоматическогоСозданияЛидовПоПринятымЗвонкамОффлайн					 
					И НЕ НомерВИсключениях
					
					Тогда
					Если НЕ МассивВН.Найти(ТекЗапись.ВнутреннийНомер) = Неопределено Тогда						
						
						ДанныеЗвонка.ЗвонокОффлайн = Истина;
						ДанныеЗвонка.ИДЗвонка = "";
						ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, Новый Структура, Ложь);					
						ПользовательЛида = Справочники.Пользователи.ПустаяСсылка();
						
						РекламныйИсточник = Справочники.РекламныеИсточники.ПустаяСсылка();
						Если Не ПустаяСтрока(ТекЗапись.ЛинияНомер) Тогда
							РекламныйИсточник = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточникПоНомеруТелефонаНаСервере(ТекЗапись.ЛинияНомер);
						КонецЕсли;
										
						РеквизитыЛида = Новый Структура("РекламныйИсточник, СпособСоздания, ДатаЗвонкаСоздавшегоЛид, ПользовательЛида", 
										   РекламныйИсточник, Перечисления.СпособыСозданияЛида.АвтоматическиПриРазбореИсторииАТС, ТекЗапись.Дата, ПользовательЛида); //#8090				
					    ДанныеЗвонка.ИДЗвонка = ТекЗапись.ИД;
						
						Если НЕ ЗначениеЗаполнено(ЛидСсылка) Тогда
							ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, РеквизитыЛида, Истина);
						
							ТекЗапись.Лид = ЛидСсылка;
							ТекЗапись.Обработан = Истина;
							ТекЗапись.Действие = Справочники.АвтоматическиеДействия.СозданНовыйЛид;
							ТекЗапись.ДатаОбработки = ТекущаяДатаСеанса();
							ТекЗапись.Пользователь  = ПользовательЛида;
						
							ОбщийМодуль.УстановитьНеобходимостьОбновленияАРМРозницы(); //Т.к. создался новый лид, нужно установить потребность обновления АРМ
						Иначе
							// вызовем ПолучитьЛидВРаботе для записи в историю лида и звонки лида
							РеквизитыЛида.Вставить("Ссылка", ЛидСсылка);
							ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, РеквизитыЛида, Истина);
							//--#6672
							ТекЗапись.Лид = ЛидСсылка;
							ТекЗапись.Обработан = Истина;
							ТекЗапись.Действие = Справочники.АвтоматическиеДействия.ОбновленЛид;
							ТекЗапись.ДатаОбработки = ТекущаяДатаСеанса();
							ТекЗапись.Пользователь  = ПользовательЛида;						
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекЗапись.Лид) И НЕ ТекЗапись.Обработан Тогда
			ТекЗапись.Обработан 	= Истина;
			ТекЗапись.Пользователь  = ТекЗапись.Лид.Автор;
	    	ТекЗапись.ДатаОбработки = ТекущаяДатаСеанса();
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры
