
&НаСервере
Процедура ОКНаСервере()
	СтруктКонст = константы.КСУ_НастройкиРСВладельца.Получить().Получить();
	ЗаполнитьЗначенияСвойств(СтруктКонст,ЭтаФорма);
	Константы.КСУ_НастройкиРСВладельца.Установить(Новый ХранилищеЗначения(СтруктКонст));
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	Закрыть(истина);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктКонст = константы.КСУ_НастройкиРСВладельца.Получить().Получить();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктКонст);
КонецПроцедуры

&НаКлиенте
Процедура СписокПрограммЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Рез = Неопределено;

	ОткрытьФорму("Обработка.КСУ_РабочийСтолВладельца.Форма.Программы",,,,,, Новый ОписаниеОповещения("СписокПрограммЗначениеНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СписокПрограммЗначениеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Рез = Результат;
	Если ЗначениеЗаполнено(рез) тогда
		СТ_Программы.НайтиПоИдентификатору(Элементы.СписокПрограмм.ТекущаяСтрока).Значение = рез;	
	КонецЕсли;
	
КонецПроцедуры

