
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОбщееКоличество.Видимость = (Запись.ВариантОпределенияКоличества = 2);
	ЗаполнитьСписокВыбораТЧ();
	
	УправлениеФормой();
	
	ОбщийМодульСервер.ЗаполнитьПредопределенныеПорядкиОкругления(Элементы.ПорядокОкругления);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Запись.ВариантОпределенияКоличества = 0 Тогда
		Запись.ВариантОпределенияКоличества = 1;
		Модифицированность = Истина;
		ВариантОпределенияКоличестваПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПравилаПриИзменении(Элемент)
	УправлениеФормой();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТЧ()
	
	ДанныеСпискаВыбора = Новый СписокЗначений;
			
	Если Запись.ВидЗаказа = Перечисления.ВидыЗаказов.ЗаказПокупателя Тогда
		ДанныеСпискаВыбора.Добавить("Товары");
		ДанныеСпискаВыбора.Добавить("Материалы");
		
	ИначеЕсли Запись.ВидЗаказа = Перечисления.ВидыЗаказов.ЗаказНаПроизводство Тогда
		ДанныеСпискаВыбора.Добавить("Материалы"); //#14862
		
	ИначеЕсли Запись.ВидЗаказа = Перечисления.ВидыЗаказов.ЗаказДоговор Тогда
		ДанныеСпискаВыбора.Добавить("ТоварыУслуги", "Товары и услуги");
		//ДанныеСпискаВыбора.Добавить("Услуги"); // №5793, услуги в ТЧ ТоварыУслуги
		ДанныеСпискаВыбора.Добавить("Материалы");
		
	ИначеЕсли Запись.ВидЗаказа = Перечисления.ВидыЗаказов.Монтаж Тогда // №5793, добавлен монтаж
		ДанныеСпискаВыбора.Добавить("Материалы");
	КонецЕсли;
	
	Элементы.ТабличнаяЧастьЗаказа.СписокВыбора.ЗагрузитьЗначения(ДанныеСпискаВыбора.ВыгрузитьЗначения());

КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораТЧ();
	Запись.ТабличнаяЧастьЗаказа = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ВариантОпределенияКоличестваПриИзмененииНаСервере()
	Элементы.ОбщееКоличество.Видимость = (Запись.ВариантОпределенияКоличества = 2);
КонецПроцедуры

&НаКлиенте
Процедура ВариантОпределенияКоличестваПриИзменении(Элемент)
	
	//ВариантОпределенияКоличестваПриИзмененииНаСервере();
	Если НЕ Запись.ВариантОпределенияКоличества = 1 Тогда
		Запись.Коэффициент = 1; //#13814 
	КонецЕсли;
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Запись.ЕдиницаИзмерения = Запись.Номенклатура.БазоваяЕдиницаИзмерения;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПравилоБезПараметраПриИзменении(Элемент)
	
	УправлениеФормой(Истина);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой(СброситьЗначения = Ложь)
	
	Элементы.ПараметрФайла.Доступность = НЕ Запись.ЭтоПравилоБезПараметра;
	Элементы.ВариантОпределенияКоличества.Доступность = НЕ Запись.ЭтоПравилоБезПараметра;
	Если СброситьЗначения И Запись.ЭтоПравилоБезПараметра Тогда
		Запись.ПараметрФайла = Справочники.ПараметрыФайлаПрограммыПостроителя.ПустаяСсылка();
		Запись.ВариантОпределенияКоличества = 2;
		Запись.Коэффициент = 1; //#13814
	КонецЕсли;
	Элементы.ОбщееКоличество.Видимость = (Запись.ВариантОпределенияКоличества = 2);

	Элементы.ГруппаСтраницы.ТекущаяСтраница = ?(Запись.ВидПравила = ПредопределенноеЗначение("Перечисление.ВидыПравилОбработкиФайлаПрограммыПостроителя.ОбработкаНоменклатурыПродукции"),
												Элементы.СтраницаОбработка,
												Элементы.СтраницаДобавление);
												
	ЭтоПродукция = (Запись.ВидСоздаваемойНоменклатуры = Справочники.ВидыНоменклатуры.Продукция);
	
	Элементы.ГруппаДополнительныеУсловия.Видимость = (НЕ ЭтоПродукция);
	Элементы.ГруппаПараметрПравила.Видимость = (НЕ ЭтоПродукция);	
	Элементы.ВидПродукции.Видимость = ЭтоПродукция;
	
	Элементы.Коэффициент.Видимость = (Запись.ВариантОпределенияКоличества = 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = новый СписокЗначений;
	
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ЗаказПокупателя"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ЗаказНаПроизводство")); //#14862	
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ЗаказДоговор"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказов.Монтаж")); // №5793
	
КонецПроцедуры

//++ №13814
&НаКлиенте
Процедура ВидСоздаваемойНоменклатурыПриИзменении(Элемент)
	
	ЭтоПродукция = (Запись.ВидСоздаваемойНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция"));
	
	Запись.ЭтоПравилоБезПараметра = ЭтоПродукция;
	Если НЕ ЭтоПродукция Тогда
		Запись.ВидПродукции = ПредопределенноеЗначение("Справочник.ВидыПродукции.ПустаяСсылка");	
	КонецЕсли;
	
	УправлениеФормой(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(Запись.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры
//-- №13814


