
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//Если Параметры.Свойство("ДополнительныйКлючОтчета") Тогда
	//	ДополнительныйКлючОтчета = Параметры.ДополнительныйКлючОтчета;
	//КонецЕсли;
	
	ВыводитьДетальныеЗаписи = Истина;
	Если Параметры.Свойство("ВыводитьДетальныеЗаписи") Тогда
		ВыводитьДетальныеЗаписи = Параметры.ВыводитьДетальныеЗаписи;
	КонецЕсли;
	Если НЕ ВыводитьДетальныеЗаписи Тогда
		ВыводитьГруппы = Ложь;
		Элементы.ВыводитьГруппы.Видимость = Ложь;
	КонецЕсли;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетМетаданные = ОтчетОбъект.Метаданные();
	ОтчетПолноеИмя  = ОтчетМетаданные.ПолноеИмя();
	
	//Если ОтчетПолноеИмя = "Отчет.ЭффективностьПоЛидам" И ПустаяСтрока(ДополнительныйКлючОтчета) Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	ОтчетНаименование = ОтчетМетаданные.Синоним;
	Если Параметры.Свойство("ОтчетНаименование") Тогда
		ОтчетНаименование = Параметры.ОтчетНаименование;	
	КонецЕсли;
	ОтчетИмя = ОтчетМетаданные.Имя;
	ИмяОтчетаДляЗадания = ОтчетМетаданные.Имя;
	
	ПредставлениеПоказателя = ОтчетОбъект.ПредставлениеПоказателя(); //ДополнительныйКлючОтчета);
	ТипДанныхПоказателяСтрокой = ОтчетОбъект.ТипДанныхПоказателяСтрокой();
	
	Если НЕ ПустаяСтрока(ПредставлениеПоказателя) Тогда
		Элементы.ОтборПоПоказателю.Заголовок = ПредставлениеПоказателя;
		
		Элементы.ПоказательОтчета.ОграничениеТипа = Новый ОписаниеТипов(ТипДанныхПоказателяСтрокой);	
	Иначе
		Элементы.ГруппаОтборПоПоказателю.Видимость = Ложь;
	КонецЕсли;

	//	
	Информация = ВариантыОтчетов.СформироватьИнформациюОбОтчетеПоПолномуИмени(ОтчетПолноеИмя);
	ОтчетСсылка = Информация.Отчет; // строка, если внешний 
	ЭтоВнешнийОтчет = (Информация.ТипОтчета = Перечисления.ТипыОтчетов.Внешний);
	Если ЭтоВнешнийОтчет Тогда	
		ИмяОтчетаДляЗадания = ОтчетОбъект.ИспользуемоеИмяФайла;
	КонецЕсли;
	
	// получаем варианты отчета
	ВариантыНастроек = ОтчетыЭффективности.ВариантыОтчета(ОтчетСсылка);
	Для Каждого Вариант Из ВариантыНастроек Цикл
		НоваяСтрока = ВариантыОтчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Вариант);
	КонецЦикла;
		
	//// получаем предопределенные варианты отчета
	//ВариантыНастроек = ОтчетОбъект.ВариантыОтчета(ОтчетСсылка, ДополнительныйКлючОтчета, Истина);	
	//Для Каждого Вариант Из ВариантыНастроек Цикл
	//	НоваяСтрока = ВариантыОтчета.Добавить();
	//	НоваяСтрока = ВариантыОтчета.Добавить();
	//	НоваяСтрока.КлючВарианта = Вариант.КлючВарианта;
	//	НоваяСтрока.ИмяКоманды = Вариант.КлючВарианта;
	//	НоваяСтрока.Представление = Вариант.Представление;
	//	НоваяСтрока.Предопределенный = Истина;
	//	НоваяСтрока.ТолькоДляАвтора = Ложь;
	//КонецЦикла;
	//
	//// получаем пользовательские варианты отчета
	//ВариантыНастроек = ОтчетОбъект.ВариантыОтчета(ОтчетСсылка, ДополнительныйКлючОтчета, Ложь);	
	//Для Каждого Вариант Из ВариантыНастроек Цикл
	//	ДобавитьВариантОтчета(ВариантыОтчета, Вариант, Ложь);
	//КонецЦикла;
	
	// при открытии из формы элемента Вариант отчета или из панели отчеты (Избранное)
	СсылкаТекущийВариант = Неопределено;
	Параметры.Свойство("Ссылка", СсылкаТекущийВариант);
	
	УстановитьКлючТекущегоВарианта(ОтчетПолноеИмя, СсылкаТекущийВариант);
	
	ВариантыОтчета.Сортировать("Представление");
	// выводим варианты в подменю		
	ОбновитьКомандыВыбораВариантов();
	
	ЗагрузитьПользовательскиеНастройкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассчитатьПоказатели();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииВариантаНаСервере(Настройки)
	
	// так как команда СохранитьВариантОтчета переопрделено, то эта процедура не будет использоваться 
	
	// переопределяем настройки варианта отчета: срабатывает стандартный механизм ХранилищеВариантовОтчетов.ОбработкаСохранения
	//НовыеНастройки = Новый Структура;
	//НовыеНастройки.Вставить("ТаблицаПоказателей", ТаблицаТекущихПоказателей.Выгрузить(, "ИдПоказателя"));
	//НовыеНастройки.Вставить("ВнутреннийИДОтчета", ВнутреннийИДОтчета);
	//
	//Настройки.ДополнительныеСвойства.Вставить("Адрес", ПоместитьВоВременноеХранилище(НовыеНастройки));
	//
	//// загружаем настройки сохраненного варианта
	//СохранитьВариантОтчетаЗавершениеСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ОбновитьКомандыВыбораВариантов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если СтрНайти(ИсточникВыбора.ИмяФормы, "ФормаНастроекЭффективности") > 0 Тогда	
		ОбработкаИзмененияНастроекКлиент(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПоказательОтчетаПриИзменении(Элемент)
	
	ОтборПоПоказателю = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОтборПоОрганизации = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриАктивизации(Элемент)	
	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамически", 0.2, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
			
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтчетИмя", ОтчетИмя);
	ПараметрыФормы.Вставить("ТаблицаВыбранныхПоказателей", ТаблицаТекущихПоказателей());
	
	//ПараметрыФормы.Вставить("ДополнительныйКлючОтчета", ДополнительныйКлючОтчета);
	
	ИмяФормыФ = ОтчетПолноеИмя + ".ФормаНастроек";
	ОткрытьФорму(ИмяФормыФ, ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариантОтчета(Команда)
	
	ПараметрыСохранения = Новый Структура(ВариантыОтчетовКлиентСервер.СвойстваСохраненияВариантаОтчета());
	ЗаполнитьЗначенияСвойств(ПараметрыСохранения, ЭтотОбъект);
	
	//ПараметрыСохранения.ВариантОтчета = НастройкиОтчета.ВариантСсылка;
	ПараметрыСохранения.ИмяОтчета = ОтчетПолноеИмя;
	//ПараметрыСохранения.НастройкиВариантаОтчета = Отчет.КомпоновщикНастроек.Настройки;
		
	ПараметрыСохранения.Вставить("КлючОбъекта", ОтчетПолноеИмя);
	ПараметрыСохранения.Вставить("КлючТекущихНастроек", КлючТекущегоВарианта);
	//ПараметрыСохранения.Вставить("ДополнительныйКлючОтчета", ДополнительныйКлючОтчета);	
	ПараметрыСохранения.Вставить("АдресНастроек", АдресНастроек());
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьВариантОтчетаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму(
		"ОбщаяФорма.СохранениеВариантаОтчетаЭффективности",
		ПараметрыСохранения,
		ЭтотОбъект, ,,, ОписаниеОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариантОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючТекущегоВарианта = Результат.КлючНастроек;	
	СохранитьВариантОтчетаЗавершениеСервер();
	 
КонецПроцедуры

&НаСервере
Процедура СохранитьВариантОтчетаЗавершениеСервер()

	// загружаем настройки сохраненного варианта
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	// получаем пользовательские варианты отчета
	//ВариантыНастроек = ОтчетОбъект.ВариантыОтчета(ОтчетСсылка, ДополнительныйКлючОтчета, Ложь);	
	ВариантыНастроек = ОтчетыЭффективности.ВариантыОтчета(ОтчетСсылка);
	Для Каждого Вариант Из ВариантыНастроек Цикл
		СтруктураВарианта = Новый Структура("КлючВарианта", Вариант.КлючВарианта);
		Найденные = ВариантыОтчета.НайтиСтроки(СтруктураВарианта);
		Если Найденные.Количество() = 0 Тогда
			ДобавитьВариантОтчета(ВариантыОтчета, Вариант, Ложь);
		КонецЕсли;
		
		Если Вариант.КлючВарианта = КлючТекущегоВарианта Тогда
			ИмяКоманды = Вариант.ИмяКоманды;
		КонецЕсли;
	КонецЦикла;
	
	ВариантыОтчета.Сортировать("Представление");
	
	ОбновитьКомандыВыбораВариантов();
	
	ЗагрузитьНастройкиВариантаОтчета(ИмяКоманды, КлючТекущегоВарианта, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗагрузитьВариантОтчета(Команда)
	
	// выбор варианта отчета в меню
	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("ИмяКоманды", Команда.Имя));
	Если Найденные.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Вариант отчета не найден.'"));
		Возврат;
	КонецЕсли;
	
	УстановитьТекущийВариант(Найденные[0].КлючВарианта);
	
	ЗагрузитьНастройкиВариантаОтчета(Найденные[0].ИмяКоманды, КлючТекущегоВарианта, Найденные[0].Предопределенный);
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");	
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеИФормированиеОтчета

&НаКлиенте
Процедура ОтчетСкомпоноватьРезультат(Команда)
			
	Сформировать();
		
КонецПроцедуры

&НаКлиенте
Процедура Сформировать()
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТаблицаТекущихПоказателей.Количество() = 0 Тогда
		Сообщить("Не выбраны показатели к выводу!");
		Возврат;	
	КонецЕсли;
	
	СохранитьПользовательскиеНастройкиНаСервере();
		
	РезультатФоновогоЗадания = ФоновоеЗаданиеЗапустить();
	Если РезультатФоновогоЗадания = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		ПоказатьОшибкиФормирования(РезультатФоновогоЗадания);
	ИначеЕсли РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда 
		//ОперацииПослеФормирования();
	Иначе
		Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеВыполнено", ЭтотОбъект, Истина);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Обработчик, ПараметрыОжидания);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеВыполнено(Результат, ЗагрузитьРезультатФормированияОтчета) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус = "Выполнено" Тогда 
		ФоновоеЗаданиеЗагрузитьРезультат(Результат);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьОшибкиФормирования(Результат);
	КонецЕсли;
	
	//ОперацииПослеФормирования();
	
КонецПроцедуры

&НаСервере
Процедура ФоновоеЗаданиеЗагрузитьРезультат(Знач РезультатФоновогоЗадания)
	
	Если НЕ ЭтоАдресВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата) Тогда
		Возврат;
	КонецЕсли; 
	
	РезультатФормирования = ПолучитьИзВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата);
	
	//НастройкиПечатиСохранить();
	ТабличныйДокумент = РезультатФормирования.ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	//НастройкиПечатиВосстановить();
	
	ТаблицаДанных.Загрузить(РезультатФормирования.ТаблицаДанных); //для расшифровки
		
	ОтображениеСостояния = Элементы.ТабличныйДокумент.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Ложь;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = "";
	
	УдалитьИзВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеЗапустить()
	
	ТабличныйДокумент.Очистить();
	
	// Запуск фонового задания
	
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("ТаблицаПоказателей", ТаблицаТекущихПоказателей.Выгрузить());
	//СтруктураПараметров.Вставить("Период", Период);	
	
	ПараметрыФормированияОтчета = Новый Структура;
	
	ПараметрыФормированияОтчета.Вставить("ТаблицаПоказателей", ТаблицаТекущихПоказателей.Выгрузить());
	ПараметрыФормированияОтчета.Вставить("Период", Период);
	ПараметрыФормированияОтчета.Вставить("ВыводитьГруппы", ВыводитьГруппы);	
	ПараметрыФормированияОтчета.Вставить("ВыводитьДетальныеЗаписи", ВыводитьДетальныеЗаписи);
	
	//#13446
	ПараметрыФормированияОтчета.Вставить("ОтборПоОрганизации", ОтборПоОрганизации);
	ПараметрыФормированияОтчета.Вставить("Организация", Организация);
	
	ПараметрыФормированияОтчета.Вставить("ОтборПоПоказателю", ОтборПоПоказателю);
	ПараметрыФормированияОтчета.Вставить("Показатель", ПоказательОтчета);
			
	ПараметрыФормированияОтчета.Вставить("ТекстЗапроса", ТекстЗапросаОтчета());
	
	ПараметрыФормированияОтчета.Вставить("ИмяОтчета", ОтчетИмя); //ИмяОтчетаДляЗадания);	
	ПараметрыФормированияОтчета.Вставить("ПредставлениеОтчета", ОтчетНаименование);
	ПараметрыФормированияОтчета.Вставить("ПредставлениеПоказателя", ПредставлениеПоказателя);

	ПараметрыФормированияОтчета.Вставить("КлючВарианта", КлючТекущегоВарианта);
	//Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("КлючВарианта", КлючТекущегоВарианта));
	//Если Найденные.Количество() > 0 Тогда
	//	ПараметрыФормированияОтчета.Вставить("ИмяВарианта", );	
	//КонецЕсли;
	//ПараметрыФормированияОтчета.Вставить("ИмяМетода", "СформироватьТабличныйДокумент");
	//ПараметрыФормированияОтчета.Вставить("ПараметрыВыполнения", СтруктураПараметров);
	ПараметрыФормированияОтчета.Вставить("ЭтоВнешнийОтчет", ЭтоВнешнийОтчет);
	
	ИнформацияОбОшибке = Неопределено;
	Попытка
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		
		//ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОтчета";
		ВыполняемыйМетод = "ОтчетыЭффективности.СформироватьТабличныйДокумент";
		
		РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
			ВыполняемыйМетод,
			ПараметрыФормированияОтчета,
			ПараметрыВыполнения);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	
	Если ИнформацияОбОшибке <> Неопределено Тогда
		ПоказатьОшибкиФормирования(ПоляПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат Неопределено;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
		
		ФоновоеЗаданиеЗагрузитьРезультат(РезультатФоновогоЗадания);
		
	ИначеЕсли РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		
		ПоказатьОшибкиФормирования(РезультатФоновогоЗадания);
		
	ИначеЕсли РезультатФоновогоЗадания.Статус = "Выполняется" Тогда
		
		ОтображениеСостояния = Элементы.ТабличныйДокумент.ОтображениеСостояния;
		ОтображениеСостояния.Видимость                      = Истина;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
		ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет формируется...'");
		
	КонецЕсли;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоляПредставлениеОшибки(Знач ИнформацияОбОшибке)
	
	Результат = Новый Структура;
	КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	ПодробноеПредставлениеОшибки = НСтр("ru = 'Ошибка при формировании:'") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	Если ПустаяСтрока(КраткоеПредставлениеОшибки) Тогда
		КраткоеПредставлениеОшибки = ПодробноеПредставлениеОшибки;
	КонецЕсли;
	Результат.Вставить("КраткоеПредставлениеОшибки", КраткоеПредставлениеОшибки);
	Результат.Вставить("ПодробноеПредставлениеОшибки", ПодробноеПредставлениеОшибки);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПоказатьОшибкиФормирования(Знач ДанныеОшибки)
	
	Если ТипЗнч(ДанныеОшибки) = Тип("Структура") Тогда
		КраткоеПредставлениеОшибки = ДанныеОшибки.КраткоеПредставлениеОшибки;
		ПодробноеПредставлениеОшибки = ДанныеОшибки.ПодробноеПредставлениеОшибки;
	Иначе
		КраткоеПредставлениеОшибки = ДанныеОшибки;
		ПодробноеПредставлениеОшибки = "";
	КонецЕсли;
	
	ОтображениеСостояния = Элементы.ТабличныйДокумент.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = КраткоеПредставлениеОшибки;
	
	Если ПустаяСтрока(ПодробноеПредставлениеОшибки) Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область Расшифровка

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	// описание показателя
	Если ТипЗнч(Расшифровка) = Тип("Строка") Тогда
		 //ПоказатьЗначение(, Расшифровка);
		 ПараметрыФормы = Новый Структура;
		 ПараметрыФормы.Вставить("Заголовок", "Описание показателя");	
		 ПараметрыФормы.Вставить("Текст", Расшифровка);
		 ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		 
		 ОткрытьФорму("ОбщаяФорма.ВводМногострочногоТекста", ПараметрыФормы, ЭтаФорма);
		 
	// 
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Сотрудники") Тогда
		 ПоказатьЗначение(, Расшифровка);	

	// расшифровка показателя по исполнителю
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		
		ПараметрыФормы = Новый Структура;
		//Если СтрНайти(ОтчетПолноеИмя, "ЭффективностьЗамерщиков") > 0 Тогда
		//	ЗаголовокФормыРасшифровки = НСтр("ru = 'Эффективность замерщиков: лиды'");
		//	ТекстОтборов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документы по замерщику: %1, за период: с %2 по %3'"),
		//		?(ЗначениеЗаполнено(Расшифровка.Исполнитель), Расшифровка.Исполнитель, НСтр("ru = '<не указан>'")),
		//		Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy"),
		//		Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
		//Иначе
			ЗаголовокФормыРасшифровки = ОтчетНаименование + " (расшифровка)";
			ТекстОтборов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Период: с %1 по %2'"),
				Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy"),
				Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
		//КонецЕсли;
		
		ПараметрыФормы.Вставить("ЗаголовокФормы", ЗаголовокФормыРасшифровки);
		ПараметрыФормы.Вставить("ПредставлениеОтборов", Новый ФорматированнаяСтрока(ТекстОтборов, Новый Шрифт(,,Истина)));
		ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровку(Расшифровка, УникальныйИдентификатор));
		
		//ИмяФормыФ = ОтчетПолноеИмя + ".Форма.ДополнительнаяРасшифровка";
		ИмяФормыФ = "ОбщаяФорма.ДополнительнаяРасшифровка";
		ОткрытьФорму(ИмяФормыФ, ПараметрыФормы, ЭтаФорма, Истина);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция СформироватьРасшифровку(СтруктураРасшифровки, УникальныйИдентификатор)
	
	//ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	//Возврат ОтчетОбъект.СформироватьРасшифровку(ТаблицаДанных, СтруктураРасшифровки, УникальныйИдентификатор);
	Возврат ОтчетыЭффективности.СформироватьРасшифровку(ТаблицаДанных, СтруктураРасшифровки, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

#Область РасчетПоказателейВыделенныхЯчеек

&НаКлиенте
Процедура РассчитатьСумму(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличество(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСреднее(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМинимум(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМаксимум(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВсеПоказатели(Команда)
	УстановитьВидимостьПоказателей(Не Элементы.РассчитатьВсеПоказатели.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПоказатели(Команда)
	УстановитьВидимостьПоказателей(Ложь);
КонецПроцедуры

// Выполняет расчет и вывод показателей выделенной области ячеек.
// См. обработчик события ОтчетТабличныйДокументПриАктивизацииОбласти.
//
&НаКлиенте
Процедура РассчитатьПоказателиДинамически()
	Перем ТекущаяКоманда;
	
	КомандыПоказателей = КомандыПоказателей();
	Для Каждого Команда Из КомандыПоказателей Цикл 
		Если Элементы[Команда.Ключ].Пометка Тогда 
			ТекущаяКоманда = Команда.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьПоказатели(ТекущаяКоманда);
КонецПроцедуры

// Выполняет расчет и вывод показателей выделенных областей ячеек табличного документа.
//
// Параметры:
//  ТекущаяКоманда - Строка - имя команды расчета показателя, например, "РассчитатьСумму".
//                      Определяет, какой показатель является основным.
//
&НаКлиенте
Процедура РассчитатьПоказатели(ТекущаяКоманда = "РассчитатьСумму")
	// Расчет показателей.
	ПараметрыРасчета = ОбщегоНазначенияСлужебныйКлиент.ПараметрыРасчетаПоказателейЯчеек(ТабличныйДокумент);
	Если ПараметрыРасчета.РассчитатьНаСервере Тогда 
		РасчетныеПоказатели = РасчетныеПоказателиСервер(ПараметрыРасчета);
	Иначе
		РасчетныеПоказатели = ОбщегоНазначенияСлужебныйКлиентСервер.РасчетныеПоказателиЯчеек(
			ТабличныйДокумент, ПараметрыРасчета.ВыделенныеОбласти);
	КонецЕсли;
	
	// Установка значений показателей.
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РасчетныеПоказатели);
	
	// Переключение и форматирование показателей.
	КомандыПоказателей = КомандыПоказателей();
	Для Каждого Команда Из КомандыПоказателей Цикл 
		Элементы[Команда.Ключ].Пометка = Ложь;
		
		ЗначениеПоказателя = РасчетныеПоказатели[Команда.Значение];
		РазрядностьПоказателя = Мин(СтрДлина(Макс(ЗначениеПоказателя, -ЗначениеПоказателя) % 1) - 2, 4);
		
		Элементы[Команда.Значение].ФорматРедактирования = "ЧДЦ=" + РазрядностьПоказателя + "; ЧРГ=' '; ЧН=0";
	КонецЦикла;
	Элементы[ТекущаяКоманда].Пометка = Истина;
	
	// Вывод основного показателя.
	ТекущийПоказатель = КомандыПоказателей[ТекущаяКоманда];
	Показатель = ЭтотОбъект[ТекущийПоказатель];
	Элементы.Показатель.ФорматРедактирования = Элементы[ТекущийПоказатель].ФорматРедактирования;
	Элементы.ГруппаВидыПоказателей.Картинка = БиблиотекаКартинок[ТекущийПоказатель];
	//Элементы.ГруппаВидыПоказателейЕще.Картинка = БиблиотекаКартинок[ТекущийПоказатель];
	
КонецПроцедуры

// Рассчитывает показатели числовых ячеек в табличном документе.
//  см. ОтчетыКлиентСервер.РасчетныеПоказателиЯчеек.
//
&НаСервере
Функция РасчетныеПоказателиСервер(ПараметрыРасчета)
	Возврат ОбщегоНазначенияСлужебныйКлиентСервер.РасчетныеПоказателиЯчеек(ТабличныйДокумент, ПараметрыРасчета.ВыделенныеОбласти);
КонецФункции

// Определяет соответствие между командами расчета показателей и показателями.
//
// Возвращаемое значение:
//   Соответствие - Ключ - имя команды, Значение - имя показателя.
//
&НаКлиенте
Функция КомандыПоказателей()
	КомандыПоказателей = Новый Соответствие();
	КомандыПоказателей.Вставить("РассчитатьСумму", "Сумма");
	КомандыПоказателей.Вставить("РассчитатьКоличество", "Количество");
	КомандыПоказателей.Вставить("РассчитатьСреднее", "Среднее");
	КомандыПоказателей.Вставить("РассчитатьМинимум", "Минимум");
	КомандыПоказателей.Вставить("РассчитатьМаксимум", "Максимум");
	
	Возврат КомандыПоказателей;
КонецФункции

// Управляет признаком видимости панели расчетных показателей.
//
// Параметры:
//  Видимость - Булево - Признак включения / выключения видимости панели показателей.
//              См. также Синтакс-помощник: ГруппаФормы.Видимость.
//
&НаКлиенте
Процедура УстановитьВидимостьПоказателей(Видимость)
	Элементы.ОбластьПоказателей.Видимость = Видимость;
	Элементы.РассчитатьВсеПоказатели.Пометка = Видимость;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьКлючТекущегоВарианта(ОтчетПолноеИмя, СсылкаТекущийВариант)
	
	Если СсылкаТекущийВариант = Неопределено Тогда
		// вызов только ПриСозданииНаСервере - КлючТекущегоВарианта сохраняем / загружаем сами
		Если ЗначениеЗаполнено(ДополнительныйКлючОтчета) Тогда 
			КлючОбъекта = ОтчетПолноеИмя + "/" + ДополнительныйКлючОтчета + "/КлючТекущегоВарианта";
		Иначе
			КлючОбъекта = ОтчетПолноеИмя + "/КлючТекущегоВарианта";
		КонецЕсли;		
		КлючТекущегоВарианта = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта, "");
	
		НайденныеСтроки = ВариантыОтчета.НайтиСтроки(Новый Структура("КлючВарианта", КлючТекущегоВарианта));		
	Иначе
		НайденныеСтроки = ВариантыОтчета.НайтиСтроки(Новый Структура("Ссылка", СсылкаТекущийВариант));	
	КонецЕсли;
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		// данный вариант отчета не поддерживается
		КлючТекущегоВарианта = ВариантыОтчета[0].КлючВарианта;
		ИмяКоманды = ВариантыОтчета[0].ИмяКоманды;
		Предопределенный = Истина;
	Иначе
		КлючТекущегоВарианта = НайденныеСтроки[0].КлючВарианта; // для случая когда СсылкаТекущийВариант <> Неопределено
		ИмяКоманды = НайденныеСтроки[0].ИмяКоманды;
		Предопределенный = НайденныеСтроки[0].Предопределенный;
	КонецЕсли;	
	
	ЗагрузитьНастройкиВариантаОтчета(ИмяКоманды, КлючТекущегоВарианта, Предопределенный);
	
КонецПроцедуры

&НаСервере
Функция АдресНастроек()
	
	// структура настроек пользовательского варианта отчета
	НовыеНастройки = Новый Структура;
	НовыеНастройки.Вставить("ТаблицаПоказателей", ТаблицаТекущихПоказателей.Выгрузить(, "ИдПоказателя"));
	//НовыеНастройки.Вставить("ДополнительныйКлючОтчета", ДополнительныйКлючОтчета);
	
	АдресНастроек = ПоместитьВоВременноеХранилище(НовыеНастройки, УникальныйИдентификатор);
	
	Возврат АдресНастроек;
	
КонецФункции

&НаСервере
Процедура ДобавитьВариантОтчета(ВариантыОтчета, Вариант, Предопределенный)
	
	НоваяСтрока = ВариантыОтчета.Добавить();
	НоваяСтрока.КлючВарианта 		= Вариант.КлючВарианта;
	НоваяСтрока.ИмяКоманды 			= Вариант.ИмяКоманды;
	НоваяСтрока.Представление 		= Вариант.Представление;
	НоваяСтрока.Предопределенный 	= Предопределенный;
	НоваяСтрока.ТолькоДляАвтора 	= Вариант.ТолькоДляАвтора;
	НоваяСтрока.Автор 				= Вариант.Автор;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомандыВыбораВариантов()
	
	// выводим варианты в подменю		
	Для Каждого СтрокаТаблицы Из ВариантыОтчета Цикл
		Если СтрокаТаблицы.ТолькоДляАвтора = Истина
			И СтрокаТаблицы.Автор <> Пользователи.АвторизованныйПользователь() Тогда
			Продолжить;
		КонецЕсли;
		
		Найденные = ВариантыФормы.НайтиСтроки(Новый Структура("КлючВарианта", СтрокаТаблицы.КлючВарианта));
		Если Найденные.Количество() = 0 Тогда
		
			Команда = Команды.Добавить(СтрокаТаблицы.ИмяКоманды);
			Команда.Действие = "Подключаемый_ЗагрузитьВариантОтчета";
			
			Кнопка = Элементы.Добавить(СтрокаТаблицы.ИмяКоманды, Тип("КнопкаФормы"), Элементы.ГруппаВариантыОтчета);
			Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			Кнопка.ИмяКоманды = СтрокаТаблицы.ИмяКоманды;
			Кнопка.Заголовок = СтрокаТаблицы.Представление;	
			
			ВариантФормы = ВариантыФормы.Добавить();
			ЗаполнитьЗначенияСвойств(ВариантФормы, СтрокаТаблицы);
			
		Иначе
			
			Кнопка = Элементы.Найти(СтрокаТаблицы.ИмяКоманды);
			Элементы.Переместить(Кнопка, Элементы.ГруппаВариантыОтчета);
			
		КонецЕсли;
		
		Кнопка.Пометка = (КлючТекущегоВарианта = СтрокаТаблицы.КлючВарианта);
	КонецЦикла;
	
КонецПроцедуры
	
&НаСервере
Функция ТаблицаТекущихПоказателей()
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТекущихПоказателей.Выгрузить());
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкиВариантаОтчета(ИмяКоманды, КлючТекущегоВарианта, Предопределенный)
	
	// Заголовок.
	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("КлючВарианта", КлючТекущегоВарианта));
	Если Найденные.Количество() > 0 Тогда
		Заголовок = СтрШаблон("%1 (%2)", ОтчетНаименование, Найденные[0].Представление);
	Иначе
		Заголовок = ОтчетНаименование;
	КонецЕсли;
	
	// сохраняем выбранный вариант отчета в настройках пользователя
	Если ЗначениеЗаполнено(ДополнительныйКлючОтчета) Тогда 
		КлючОбъекта = ОтчетПолноеИмя + "/" + ДополнительныйКлючОтчета + "/КлючТекущегоВарианта";
	Иначе
		КлючОбъекта = ОтчетПолноеИмя + "/КлючТекущегоВарианта";
	КонецЕсли;		
	ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить(КлючОбъекта, "", КлючТекущегоВарианта);
	
	// загрузить таблицу выводимых показателей
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ТаблицаПоказателей = ОтчетОбъект.НастройкиВариантаОтчета(ОтчетСсылка, КлючТекущегоВарианта, Предопределенный); //ДополнительныйКлючОтчета, Предопределенный);
		
	ТаблицаТекущихПоказателей.Очистить();
	
	Для Каждого ТекущаяСтрока из ТаблицаПоказателей Цикл
		НоваяСтрока = ТаблицаТекущихПоказателей.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	// обновляем наименование показателя, если оно зависит от варианта отчета 
	ПредставлениеПоказателя = ОтчетОбъект.ПредставлениеПоказателя(КлючТекущегоВарианта);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПользовательскиеНастройкиНаСервере()
	ОтчетыЭффективности.СохранитьПользовательскиеНастройки(ЭтаФорма); //, ДополнительныйКлючОтчета);	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПользовательскиеНастройкиНаСервере()
	ОтчетыЭффективности.ЗагрузитьПользовательскиеНастройки(ЭтаФорма); //, ДополнительныйКлючОтчета);	
КонецПроцедуры

&НаСервере
Функция ЗначениеПоказателя(ТаблицаДанныхДляПоиска, СтруктураПоиска)
	
	ЗначениеПоказателя = 0;

	НайденныеСтроки = ТаблицаДанныхДляПоиска.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЗначениеПоказателя = НайденныеСтроки[0].ЗначениеПоказателя;
	КонецЕсли;
	
	Возврат ЗначениеПоказателя;
	
КонецФункции

&НаСервере
Функция ФорматЯчейки(Значение, Формат)
	
	Если Формат = "Сумма" Тогда
		Возврат Формат(Значение, "ЧДЦ=2");
	ИначеЕсли Формат = "Количество" Тогда
		Возврат Формат(Значение, "ЧДЦ=0");
	Иначе
		Возврат Значение;		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ФорматСумм(Значение)
		
	Возврат Формат(Значение, "ЧДЦ=2");
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияНастроекКлиент(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");
	ОбработкаИзмененияНастроекСервер(ВыбранноеЗначение);
	Сформировать();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаИзмененияНастроекСервер(ВыбранноеЗначение)
	
	ТаблицаПоказателей = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	ТаблицаТекущихПоказателей.Очистить();
	
	Для Каждого ТекущаяСтрока из ТаблицаПоказателей Цикл
		НоваяСтрока = ТаблицаТекущихПоказателей.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаОтчета()

	ТекстЗапроса = "";
	Первый = Истина;
	
	Для каждого СтрокаПоказателя из ТаблицаТекущихПоказателей Цикл
		
		Если НЕ Первый Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + СтрокаПоказателя.ТекстЗапроса;
		Если Первый Тогда
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(ТекстЗапроса, 8);
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Символы.ПС + "ИЗ", Символы.ПС + "ПОМЕСТИТЬ ВТ" + Символы.ПС + "ИЗ");
			Первый = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	// из-за отборов сначала помещаем все во временную таблицу, а затем применяем отборы
	ТекстЗапроса = ТекстЗапроса + 
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.*
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА &ОтборПоПоказателю 
	|			ТОГДА ВТ.Исполнитель = &Показатель
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ

	|	И ВЫБОР 
	|		КОГДА &ОтборПоОрганизации 
	|			ТОГДА ВТ.Организация = &Организация
	// так как для отдельных показателей отбор по организации применяется сразу, то в итоговой таблице Организация = НЕОПРЕДЕЛЕНО
	|				ИЛИ ВТ.Организация = НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|
	|;
	|";	
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ДополнитьТекстЗапросаВТ(ТекстЗапроса);
	
	Возврат ТекстЗапроса;
	
КонецФункции
	
#КонецОбласти

