
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заказ = Параметры.Заказ;
	
	ПроверитьНеобходимостьОтгрузки();
	ПроверитьНеобходимостьОплаты();
	
	Если СоздатьОтгрузку Тогда
		Элементы.ГруппаОтгрузкаНеТребуется.Видимость = Ложь;
		Элементы.ГруппаСозданиеОтгрузки.Видимость = Истина;
		
		Если НЕ Заказ.Организация.ЯвляетсяПлательщикомНДС Тогда
			Элементы.СоздатьСчетФактуру.Видимость = Ложь;
			Элементы.ПФ_Отгрузка_СчетФактура.Видимость = Ложь;
		КонецЕсли;
	Иначе 
		Элементы.ГруппаОтгрузкаНеТребуется.Видимость = Истина;
		Элементы.ГруппаСозданиеОтгрузки.Видимость = Ложь;
	КонецЕсли;
	
	Если СоздатьОплату Тогда
		Элементы.ГруппаОплатаНеТребуется.Видимость = Ложь;
		Элементы.ГруппаСозданиеОплаты.Видимость = Истина;
	Иначе 
		Элементы.ГруппаОплатаНеТребуется.Видимость = Истина;
		Элементы.ГруппаСозданиеОплаты.Видимость = Ложь;
	КонецЕсли;
	
	Контрагент = Заказ.Контрагент;
	СлужебныйУчетБонусовПоДисконтнымКартам = Константы.УчетБонусовПоДисконтнымКартам.Получить();
	
	Если СлужебныйУчетБонусовПоДисконтнымКартам Тогда
		Элементы.ГруппаДисконтнаяКарта.Видимость = Истина;
	Иначе
		Элементы.ГруппаДисконтнаяКарта.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНеобходимостьОтгрузки()
	
	СуммаОтгрузки = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки КАК ЗаказыПокупателейОстатки
	|ГДЕ
	|	ЗаказыПокупателейОстатки.ЗаказНаПроизводство = &ЗаказНаПроизводство
	|	И ЗаказыПокупателейОстатки.КоличествоОстаток > 0";
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		СоздатьОтгрузку = Истина;
		ОпределитьСуммуОтгрузки();
	КонецЕсли;
	
	Если СоздатьОтгрузку Тогда
		Если СуммаНДСЗаказа() > 0 Тогда
			СоздатьСчетФактуру = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьСуммуОтгрузки()
	
	СуммаОтгрузки = 0;
	Товары.Очистить();
	Услуги.Очистить();
	
	Для Каждого ТекущаяСтрокаТоварыОснования Из Заказ.Товары Цикл
		
		Если ТекущаяСтрокаТоварыОснования.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
			НоваяСтрока = Услуги.Добавить();
		Иначе
			НоваяСтрока = Товары.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяСтрокаТоварыОснования);
		
	КонецЦикла;
	
	//а теперь проверим все что было отгружено по этому заказу и "вычтем" из товаров\услуг текущей реализации
	ТаблицаТоваровРеализации = Товары.Выгрузить();
	ТаблицаТоваровРеализации.Колонки.Добавить("СуммаВПересчетеНаЕдиницу", Новый ОписаниеТипов("число"));
	Для Каждого ТекущаяСтрока Из ТаблицаТоваровРеализации Цикл
		Если НЕ ТекущаяСтрока.Количество = 0 Тогда
			ТекущаяСтрока.СуммаВПересчетеНаЕдиницу = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаУслугРеализации = Услуги.Выгрузить();
	ТаблицаУслугРеализации.Колонки.Добавить("СуммаВПересчетеНаЕдиницу", Новый ОписаниеТипов("число"));
	Для Каждого ТекущаяСтрока Из ТаблицаУслугРеализации Цикл
		Если НЕ ТекущаяСтрока.Количество = 0 Тогда
			ТекущаяСтрока.СуммаВПересчетеНаЕдиницу = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
		КонецЕсли;
	КонецЦикла;
	
	ЗапросОтгружено = Новый Запрос;
	ЗапросОтгружено.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейОбороты.ЗаказНаПроизводство КАК Заказ,
	|	ЗаказыПокупателейОбороты.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОбороты.КоличествоРасход КАК КоличествоРасход
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Регистратор, ЗаказНаПроизводство = &Заказ) КАК ЗаказыПокупателейОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоДокументу
	|				ТОГДА НЕ ЗаказыПокупателейОбороты.Регистратор = &Ссылка
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";

	ЗапросОтгружено.УстановитьПараметр("Заказ", Заказ);
	ЗапросОтгружено.УстановитьПараметр("ОтборПоДокументу", Ложь);
	ЗапросОтгружено.УстановитьПараметр("Ссылка", Неопределено); 
	ТаблицаОтгружено = ЗапросОтгружено.Выполнить().Выгрузить();
	
	Для Каждого СтрокаОтгружено Из ТаблицаОтгружено Цикл
		Вычесть = СтрокаОтгружено.КоличествоРасход;
		
		Для Каждого СтрокаТовар Из ТаблицаТоваровРеализации Цикл
			Если Вычесть > 0 И СтрокаТовар.Номенклатура = СтрокаОтгружено.Номенклатура Тогда
				Зачтем = Мин(СтрокаТовар.Количество,Вычесть);
				СтрокаТовар.Количество = СтрокаТовар.Количество - Зачтем;
				Вычесть = Вычесть - Зачтем;
				СтрокаТовар.Сумма = СтрокаТовар.СуммаВПересчетеНаЕдиницу * СтрокаТовар.Количество;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаТовар Из ТаблицаУслугРеализации Цикл
			Если Вычесть > 0 И СтрокаТовар.Номенклатура = СтрокаОтгружено.Номенклатура Тогда
				Зачтем = Мин(СтрокаТовар.Количество,Вычесть);
				СтрокаТовар.Количество = СтрокаТовар.Количество - Зачтем;
				Вычесть = Вычесть - Зачтем;
				СтрокаТовар.Сумма = СтрокаТовар.СуммаВПересчетеНаЕдиницу * СтрокаТовар.Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Товары.Очистить();
	Для Каждого СтрокаТовар Из ТаблицаТоваровРеализации Цикл
		Если СтрокаТовар.Количество > 0 Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовар);
		КонецЕсли;
	КонецЦикла;
	
	Услуги.Очистить();
	Для Каждого СтрокаУслуги Из ТаблицаУслугРеализации Цикл
		Если СтрокаУслуги.Количество > 0 Тогда
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуги);
		КонецЕсли;
	КонецЦикла;
	
	СуммаОтгрузки = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
Функция СуммаНДСЗаказа()
	Возврат Заказ.Товары.Итог("СуммаНДС");
КонецФункции

&НаСервере
Процедура ПроверитьНеобходимостьОплаты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоЗаказамОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|ГДЕ
	|	РасчетыПоЗаказамОстатки.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СуммаОстаток > 0 Тогда
			СоздатьОплату = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ЕстьОшибки = Ложь;
	
	Если СоздатьОтгрузку Тогда
		ДокументОтгрузки = СоздатьДокументОтгрузки();
		Если ДокументОтгрузки = Неопределено Тогда
			ПоказатьПредупреждение(,"Не удалось создать документ реализации");
			ЕстьОшибки = Истина;
		Иначе
			Если ПФ_Отгрузка_ТоварнаяНакладная Тогда
				СформироватьПечатнуюФормуДокумента(ДокументОтгрузки, "ТоварнаяНакладная", "Товарная накладная");
			КонецЕсли;
			Если ПФ_Отгрузка_Торг12 Тогда                                
				СформироватьПечатнуюФормуДокумента(ДокументОтгрузки, "ТОРГ12", "ТОРГ-12");
			КонецЕсли;
			Если ПФ_Отгрузка_АктОбОказанииУслуг Тогда                                
				СформироватьПечатнуюФормуДокумента(ДокументОтгрузки, "Акт", "Акт об оказании услу");
			КонецЕсли;
			Если ПФ_Отгрузка_СчетФактура Тогда                                
				СформироватьПечатнуюФормуДокумента(ДокументОтгрузки, "СчетФактура", "Счет-фактура");
			КонецЕсли;
			Если ПФ_Отгрузка_ТоварнаяНакладнаяСУслугами Тогда                                
				СформироватьПечатнуюФормуДокумента(ДокументОтгрузки, "ТоварнаяНакладнаяСУслугами", "Товарная накладная");
			КонецЕсли;
			Если ПФ_Отгрузка_УПД Тогда                                
				СформироватьПечатнуюФормуДокумента(ДокументОтгрузки, "УПД", "УПД");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЕстьОшибки Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументОтгрузки()
	
	Попытка
		Док = Документы.РеализацияТоваровИУслуг.СоздатьДокумент();
		Док.Дата = ТекущаяДатаСеанса();
		Док.Заполнить(Заказ);
		Док.СуммаДокумента = Док.Товары.Итог("Сумма") + Док.Услуги.Итог("Сумма");
		Док.ДисконтнаяКарта = ДисконтнаяКарта;
		Док.ПересчитатьБонусыПоДокументу();
		Док.Записать(РежимЗаписиДокумента.Проведение);
		
		Если СоздатьСчетФактуру Тогда
			ДокСФ =  Документы.СчетФактураВыданный.СоздатьДокумент();
			ДокСФ.Дата = ТекущаяДатаСеанса();
			ДокСФ.Заполнить(Док.Ссылка);
			ДокСФ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		Возврат Док.Ссылка;
	Исключение
		Сообщить("" + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура СформироватьПечатнуюФормуДокумента(ДокументСсылка, ИмяМакета, ЗаголовокМакета)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокументСсылка);
	
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ИмяМенеджераПечати = УправлениеПечатьюВызовСервера.ПолучитьПолноеИмяОбъектаПоМетаданным(ДокументСсылка);
	ПараметрыОткрытия.ИменаМакетов		 = ИмяМакета;
	ПараметрыОткрытия.ПараметрКоманды	 = МассивОбъектов;
	ПараметрыОткрытия.ПараметрыПечати	 = Новый Структура("ОбъектыПечати, ЗаголовокПечатнойФормы, ЗаголовокФормы", МассивОбъектов, "" + ДокументСсылка, ЗаголовокМакета + " " + ДокументСсылка);
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКонтрагентаПоДисконтнойКарте(Команда)
	ОП = Новый ОписаниеОповещения("ПослеПолученияКонтрагентаПоДисконтнойКарте", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ПолучитьКонтрагентаПоДисконтнойКарте",,,,,,ОП);
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияКонтрагентаПоДисконтнойКарте(ПараметрыВозврата, ДопПараметры) Экспорт
	
	Если НЕ ПараметрыВозврата = Неопределено Тогда
		ДисконтнаяКарта = ПараметрыВозврата.ДисконтнаяКарта;
		ОпределитьОстатокПоДисконтнойКарте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДисконтнаяКартаПриИзменении(Элемент)
	ОпределитьОстатокПоДисконтнойКарте()
КонецПроцедуры

&НаСервере
Процедура ОпределитьОстатокПоДисконтнойКарте()
	
	ДатаЗапроса = ТекущаяДатаСеанса();
	Если ДатаЗапроса = Дата(1,1,1) Тогда
		ДатаЗапроса = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ОстатокПоДисконтнойКарте = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА &УчетБонусовПоДисконтнымКартам И (&ДисконтнаяКарта = Значение(Справочник.ДисконтныеКарты.ПустаяСсылка))
	|			ТОГДА 0
	|		ИНАЧЕ БонусыКонтрагентовОстатки.СуммаОстаток
	|	КОНЕЦ КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.БонусыКонтрагентов.Остатки(
	|			&ДатаЗапроса,
	|			Контрагент = &Контрагент
	|				И ДисконтнаяКарта = &ДисконтнаяКарта) КАК БонусыКонтрагентовОстатки";
	Запрос.УстановитьПараметр("ДатаЗапроса", КонецДня(ДатаЗапроса));
	Запрос.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("УчетБонусовПоДисконтнымКартам", СлужебныйУчетБонусовПоДисконтнымКартам); // №6316 нужно проверить заполненность дисконтной карты
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОстатокПоДисконтнойКарте = Выборка.СуммаОстаток;
	КонецЦикла;
	
КонецПроцедуры
