
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешеноВыгружатьИЗагружатьКонтрагентовИзФайловXLS") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Обрабатываем и закрываем форму т.к. на ней всего одна кнопка
	СохранитьВExcel(Неопределено);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция СкачатьШаблонНаСервере()
	
	ВременноеИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	ТаблицаНоменклатуры = ЗаполнитьСписокКонтрагентов();
	ТабДок = новый ТабличныйДокумент;
	
	Построитель = новый ПостроительОтчета();
	Построитель.ИсточникДанных = новый ОписаниеИсточникаДанных(ТаблицаНоменклатуры);
	Построитель.ВыводитьЗаголовокОтчета = Ложь;
	Построитель.Вывести(ТабДок);
	ТабДок.Записать(ВременноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременноеИмяФайла), ЭтотОбъект.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	
	АдресФайла = СкачатьШаблонНаСервере();
	ВременноеИмя = "Список контрагентов.xlsx";
    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокКонтрагентов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Код КАК Код,
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.ВидКонтрагента КАК ВидКонтрагента,
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.Дополнительно КАК Дополнительно,
		|	Контрагенты.ДатаРождения КАК ДатаРождения,
		|	КонтрагентыКонтактнаяИнформация2.АдресЭП КАК АдресЭП,
		|	КонтрагентыКонтактнаяИнформация3.НомерТелефона КАК НомерТелефона,
		|	КонтрагентыКонтактнаяИнформация1.Представление КАК Адрес
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация1
		|		ПО Контрагенты.Ссылка = КонтрагентыКонтактнаяИнформация1.Ссылка
		|			И (КонтрагентыКонтактнаяИнформация1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (КонтрагентыКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(КонтрагентыКонтактнаяИнформация.АдресЭП) КАК АдресЭП,
		|			КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
		|			КонтрагентыКонтактнаяИнформация.Тип КАК Тип,
		|			КонтрагентыКонтактнаяИнформация.Вид КАК Вид
		|		ИЗ
		|			Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		
		|		СГРУППИРОВАТЬ ПО
		|			КонтрагентыКонтактнаяИнформация.Ссылка,
		|			КонтрагентыКонтактнаяИнформация.Тип,
		|			КонтрагентыКонтактнаяИнформация.Вид) КАК КонтрагентыКонтактнаяИнформация2
		|		ПО Контрагенты.Ссылка = КонтрагентыКонтактнаяИнформация2.Ссылка
		|			И (КонтрагентыКонтактнаяИнформация2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|			И (КонтрагентыКонтактнаяИнформация2.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(КонтрагентыКонтактнаяИнформация.НомерТелефона) КАК НомерТелефона,
		|			КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
		|			КонтрагентыКонтактнаяИнформация.Тип КАК Тип,
		|			КонтрагентыКонтактнаяИнформация.Вид КАК Вид
		|		ИЗ
		|			Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		
		|		СГРУППИРОВАТЬ ПО
		|			КонтрагентыКонтактнаяИнформация.Ссылка,
		|			КонтрагентыКонтактнаяИнформация.Тип,
		|			КонтрагентыКонтактнаяИнформация.Вид) КАК КонтрагентыКонтактнаяИнформация3
		|		ПО Контрагенты.Ссылка = КонтрагентыКонтактнаяИнформация3.Ссылка
		|			И (КонтрагентыКонтактнаяИнформация3.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|			И (КонтрагентыКонтактнаяИнформация3.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И НЕ Контрагенты.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагенты.Наименование";
		
	ТаблицаКонтрагентов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаКонтрагентов;
	
КонецФункции



