//#13359

#Область ПрограммныйИнтерфейс

Функция ПолучитьИнформациюССервераUDS(Организация, UDS_КодСкидки, UDS_НомерТелефона) Экспорт
		
	НастройкиUDS = UDS_ОбщийМодульВызовСервера.ПолучитьНастройки(Организация);
	Если ПустаяСтрока(НастройкиUDS.IDКомпании) Тогда
		Сообщить("Не заполнены настройки для организации");
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаЗапросаПоКомпании = "partner/v2/settings";
	СведенияПоКомпании = ВыполнитьЗапрос(НастройкиUDS, "GET", СтрокаЗапросаПоКомпании);
	Если НЕ ЗначениеЗаполнено(СведенияПоКомпании.Данные) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПроверкаПройдена = ПроверитьОтветСервераНаОшибки(СведенияПоКомпании.Данные, "Получить");
	
	Если ПроверкаПройдена = Ложь Тогда
		// сообщения в ПроверитьОтветСервераНаОшибки
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаЗапросаПоКлиенту = "";
	КодUDS = "";
	Если ЗначениеЗаполнено(UDS_КодСкидки) И СтрДлина(UDS_КодСкидки) = 6 Тогда
		КодUDS = UDS_КодСкидки;
		СтрокаЗапросаПоКлиенту = "/partner/v2/customers/find?code=" + КодUDS;
		// теперь есть два варианта https://api.uds.app/partner/v2/customers/find?code=456123&phone=+71234567898&uid=23684cea-ca50-4c5c-b399-eb473e85b5ad
		// и 'https://api.uds.app/partner/v2/customers/'.$customerId
		
	ИначеЕсли ЗначениеЗаполнено(UDS_НомерТелефона) И СтрДлина(UDS_НомерТелефона) = 10 Тогда
		КодUDS = UDS_НомерТелефона;
		СтрокаЗапросаПоКлиенту = "/partner/v2/customers/find?phone=%2B7" + КодUDS;
		
	//Иначе
	//	ПараметрыПользователяЮДС = "/partner/v2/customers/find?uid=" + КодUDS;
	
	КонецЕсли;

	Если ПустаяСтрока(СтрокаЗапросаПоКлиенту) Тогда
		Сообщить("Введены неверный код/телефон");
		Возврат Неопределено;	
	КонецЕсли;
	
	СведенияПоКлиенту = ВыполнитьЗапрос(НастройкиUDS, "GET", СтрокаЗапросаПоКлиенту);
	Если НЕ ЗначениеЗаполнено(СведенияПоКлиенту.Данные) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПроверкаПройдена = ПроверитьОтветСервераНаОшибки(СведенияПоКлиенту.Данные, "Получить" ,КодUDS);
	
	Если ПроверкаПройдена = Ложь Тогда
		// сообщения в ПроверитьОтветСервераНаОшибки
		Возврат Неопределено;
	КонецЕсли;
	СтруктураОтвета = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураОтвета, СведенияПоКлиенту.Данные, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураОтвета, СведенияПоКомпании.Данные, Истина);
	
	//
	Если СтрДлина(КодUDS) = 10 И НЕ НастройкиUDS.РазрешитьСписаниеБонусовПоНомеруТелефона Тогда
		СтруктураОтвета.user.participant.points = 0;
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ОтразитьОперациюНаСервереUDS(Организация, СтруктураОтправкиДанных) Экспорт	
	
	НастройкиUDS = UDS_ОбщийМодульВызовСервера.ПолучитьНастройки(Организация);
	Если ПустаяСтрока(НастройкиUDS.IDКомпании) Тогда
		Сообщить("Не заполнены настройки для организации");
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Истина;
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "");	
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтправкиДанных);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	СтрокаЗапроса = "partner/v2/operations";
	
	СтруктураОтвета = ВыполнитьЗапрос(НастройкиUDS, "POST", СтрокаЗапроса, СтрокаJSON);
	Если НЕ ЗначениеЗаполнено(СтруктураОтвета.Данные) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПроверкаПройдена = ПроверитьОтветСервераНаОшибки(СтруктураОтвета.Данные, "Отправить");
	Если ПроверкаПройдена = Ложь Тогда
		// сообщения в ПроверитьОтветСервераНаОшибки
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтруктураОтвета.Свойство("errorCode") Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИдентификаторОперации = Формат(СтруктураОтвета.Данные.id, "ЧН=0; ЧГ=");

	Возврат ИдентификаторОперации;
	
КонецФункции

Функция ОтразитьВозвратНаСервереUDS(Организация, ИдентификаторОперации, СуммаВозврата) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторОперации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиUDS = UDS_ОбщийМодульВызовСервера.ПолучитьНастройки(Организация);
	Если ПустаяСтрока(НастройкиUDS.IDКомпании) Тогда
		Сообщить("Не заполнены настройки для организации");
		Возврат Неопределено;
	КонецЕсли;
		
	СтруктураОтправкиДанных = Новый Структура;
	СтруктураОтправкиДанных.Вставить("partialAmount", СуммаВозврата);
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Истина;
		
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "");	
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтправкиДанных);
	СтрокаJSON = ЗаписьJSON.Закрыть();
		
	СтрокаЗапроса = "/partner/v2/operations/"+ИдентификаторОперации+"/refund";
		
	СтруктураОтвета = ВыполнитьЗапрос(НастройкиUDS, "POST", СтрокаЗапроса, СтрокаJSON);
	Если НЕ ЗначениеЗаполнено(СтруктураОтвета.Данные) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПроверкаПройдена = ПроверитьОтветСервераНаОшибки(СтруктураОтвета.Данные, "Отправить");
	Если ПроверкаПройдена = Ложь Тогда
		// сообщения в ПроверитьОтветСервераНаОшибки
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтруктураОтвета.Свойство("errorCode") Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИдентификаторОперации = Формат(СтруктураОтвета.Данные.id, "ЧН=0; ЧГ=");

	Возврат ИдентификаторОперации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСоединение() Экспорт
	
	Соединение = Новый HTTPСоединение("api.uds.app",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Возврат Соединение;
	
КонецФункции

// HttpМетод = {"GET", "POST", "PATCH"}
Функция ВыполнитьЗапрос(ПараметрыАвторизации, HttpМетод, Ресурс, ТелоЗапроса=Неопределено, ПрочитатьВСоответствие = Ложь) Экспорт
	
	HttpМетод = ВРег(HttpМетод);
	
	Результат = Ложь;	
	СтруктураОтвета = Новый Структура("Результат, КодОтвета, ОписаниеОшибки, Данные", Результат, 0, "", "");
	
	Соединение = ПолучитьСоединение();
	
	СтрокаАвторизации = Строка(ПараметрыАвторизации.IDКомпании) + ":" + Строка(ПараметрыАвторизации.APIKey);
	СтрокаАвторизации = ПолучитьBase64СтрокуИзДвоичныхДанных(ПолучитьДвоичныеДанныеИзСтроки(СтрокаАвторизации, КодировкаТекста.OEM, Ложь));
	СтрокаАвторизации = СтрЗаменить(СтрЗаменить(СтрокаАвторизации, Символ(13), "") , Символ(10), "");
	
	#Если Сервер Или ВнешнееСоединение Тогда
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	#ИначеЕсли Клиент Тогда
		ТекущаяДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	#КонецЕсли
	
	XOriginRequestId = Строка(Новый УникальныйИдентификатор());
	XTimestamp = Строка(Формат(ТекущаяДатаСеанса, "ДФ=yyyy-MM-ddT05hh:mm:ssZ"));
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Origin-Request-Id", Строка(XOriginRequestId));
	Заголовки.Вставить("X-Timestamp", Строка(XTimestamp));
	Заголовки.Вставить("Authorization", "Basic " + СтрокаАвторизации);											   
											   
	Запрос = Новый HTTPЗапрос(Ресурс, Заголовки);
	// для "POST", "PATCH"
	Если НЕ ТелоЗапроса=Неопределено Тогда
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, "windows-1251", ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	
	Если HttpМетод = "GET" Тогда
		HTTPОтвет = Соединение.Получить(Запрос);	
	ИначеЕсли HttpМетод = "POST" Тогда
		HTTPОтвет = Соединение.ОтправитьДляОбработки(Запрос);
	ИначеЕсли HttpМетод = "PATCH" Тогда
		HTTPОтвет = Соединение.Изменить(Запрос);
	ИначеЕсли HttpМетод = "PUT" Тогда
		HTTPОтвет = Соединение.Записать(Запрос);
	Иначе
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	КодОтвета = HTTPОтвет.КодСостояния;
	СтруктураОтвета.КодОтвета = КодОтвета;
	
	//Если HttpМетод = "GET" И КодОтвета = 204 Тогда
	//	// запрос успешен, нет данных согласно фильтру
	//	СтруктураОтвета.Результат = Истина;
	//	Возврат СтруктураОтвета;
	//КонецЕсли;
	//
	//Если HttpМетод = "POST" И КодОтвета = 204 И СтрНайти(Ресурс, "/unlink") > 0 Тогда
	//	// Сущности отвязаны успешно
	//	СтруктураОтвета.Результат = Истина;
	//	Возврат СтруктураОтвета;
	//КонецЕсли;
	//
	//Если НЕ КодОтвета = 200 Тогда
		Попытка
			// текст ошибки
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));  
			Данные = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, "dateCreated");
			СтруктураОтвета.Данные = Данные;
		Исключение
			Сообщить("Ошибка чтения ответа сервера");
		КонецПопытки;
	//	Возврат СтруктураОтвета;
	//КонецЕсли;
	
	//СтруктураОтвета.Результат = Истина;
	//СтруктураОтвета.Данные = Данные;
	//
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПроверитьОтветСервераНаОшибки(СтруктураОтвета, Режим, КодЮДС="") Экспорт
	
	Для Каждого ПроверяемаяСтрока из СтруктураОтвета Цикл
		
		Если ПроверяемаяСтрока.Ключ = "errorCode" Тогда
			
			Если ПроверяемаяСтрока.Значение = "unauthorized" Тогда
				Сообщить("Не пройдена авторизация на сервере.");
				
			ИначеЕсли ПроверяемаяСтрока.Значение = "forbidden" Тогда
				Сообщить("Ключ АПИ не совпадает со значением на сервере.");
				
			ИначеЕсли ПроверяемаяСтрока.Значение = "notFound" Тогда
				Если Режим = "Получить" Тогда
					Если СтрДлина(КодЮДС) = 10 Тогда
						Сообщить("Клиент с указанным номером телефона обслуживается впервые. Баллы будут начисленны по номеру телефона.");
					Иначе
						Сообщить("По данному коду имя клиента не найдено! Проверьте код скидки и сделайте поиск дисконтной карты ещё раз! Транзакция прервана!");
					КонецЕсли;
				ИначеЕсли Режим = "Отправить" Тогда
					Сообщить("Код на проведение оплаты не актуален, введите код скидки или номер телефона повторно.");
				ИначеЕсли Режим = "Возврат" Тогда
					Сообщить("Номер операции для возврата не найден");
				КонецЕсли;
				
			ИначеЕсли ПроверяемаяСтрока.Значение = "discountLimitExceed" Тогда
				Сообщить("Превышен процент счета, доступный к погашению баллами");
				
			ИначеЕсли ПроверяемаяСтрока.Значение = "badRequest" Тогда
				Если СтруктураОтвета.errors[0].errorCode = "invalid.phoneNumber" Тогда
					Сообщить("Ошибка в номере телефона! Транзакция прервана!");
				ИначеЕсли СтруктураОтвета.errors[0].errorCode = "uuid.invalid" Тогда
					Сообщить("Ошибка в идентификаторе клиента! Транзакция прервана!");
				Иначе
					Сообщить("Возвращаемая ошибка: "+СтруктураОтвета.errors[0].type+"; "+СтруктураОтвета.errors[0].message+"; "+СтруктураОтвета.errors[0].field);
				КонецЕсли;
				
			ИначеЕсли ПроверяемаяСтрока.Значение = "insufficientFunds" Тогда
				Сообщить("Попытка списания баллов больше чем есть у клиента на балансе");
				
			ИначеЕсли ПроверяемаяСтрока.Значение = "companyIsInactive" Тогда
				Сообщить("Компания не активна. Продлите пожалуйста подписку UDS");
				
			ИначеЕсли ПроверяемаяСтрока.Значение = "invalidChecksum" Тогда
				Сообщить("Не верная контрольная сумма. Сумма оплаты + сумма баллов должна равняться сумме докумета реализации");
				
			ИначеЕсли ПроверяемаяСтрока.Значение = "cashierNotFound" Тогда
				Сообщить("Внешний идентификатор кассира не совпадает с именем пользователя! Транзакция на сервере отменена! Баллы не начислены и не списаны! Исправьте ошибку и проведите процедуру оплаты заново, либо проведите оплату по мобильному приложению UDS Cashier");
				
			ИначеЕсли ПроверяемаяСтрока.Значение = "withdrawNotPermitted" Тогда
				Сообщить("По номеру телефона невозможно списывать баллы, только накапливать");
				
			КонецЕсли;
			
			Отказ = Истина;
			Возврат Ложь;
			
		КонецЕсли;
	КонецЦикла;
	
	Если Режим = "Отправить" Тогда
		Сообщить("Оплата на сервере UDS Game выполнена успешно!");
		
	ИначеЕсли Режим = "Возврат" Тогда
		Сообщить("Возврат на сервере UDS Game выполнен успешно!");
		
	КонецЕсли;
	
	Возврат Истина; //СтруктураОтвета;
	
КонецФункции

#КонецОбласти

