
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	текдата = ТекущаяДата();
	Период = новый СтандартныйПериод(текдата - 60*60*24 * 7, текдата);
	
	ИзмПериодВыплат();
КонецПроцедуры

&НаСервере
Процедура ИзмПериодВыплат()
	Выплаты.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Период.ДатаНачала);
	Выплаты.Параметры.УстановитьЗначениеПараметра("ДатаКонца", КонецДня(Период.ДатаОкончания));
	Выплаты.Параметры.УстановитьЗначениеПараметра("Поиск", Поиск);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ИзмПериодВыплат();
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	тд = Элементы.Выплаты.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	если поле = Элементы.ВыплатыРегистратор тогда		
		СтандартнаяОбработка = ложь;
		ПоказатьЗначение(, тд.Регистратор);
	ИначеЕсли поле = Элементы.ВыплатыЗаказы тогда
		Если тд.Заказы<>"" тогда
			СтандартнаяОбработка = ложь;
			
			СписокЗаказов = ПолучитьСписокЗаказов(тд.Регистратор);
			Если СписокЗаказов.Количество() = 1 тогда
				ПоказатьЗначение(, СписокЗаказов[0]);
			Иначе
				сп = Новый СписокЗначений;
				сп.ЗагрузитьЗначения(СписокЗаказов);
				
				ОпОп = новый ОписаниеОповещения("ВыборРег", ЭтотОбъект);
				ПоказатьВыборИзСписка(ОпОп, сп);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокЗаказов(рег)
	возврат рег.иа_ЗаказыНаПриобретение.выгрузитьКолонку("ЗП");
КонецФункции

&НаКлиенте
Процедура ВыборРег(ВыбЗн, дп) Экспорт
	если ВыбЗн<>Неопределено Тогда
		ПоказатьЗначение(, ВыбЗн.Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отчеты(Команда)
	сп = новый СписокЗначений;
	сп.Добавить("КСУ_РасходыПоПодразделениям","Расходы по подразделениям");	
	сп.Добавить("КСУ_СостояниеФондов","Остатки на счетах и фондах");
	сп.Добавить("КСУ_ДвиженияПоФондам","Движение по фондам");
	сп.Добавить("ИА_КонтрольПлатежейВнеФондов","Контроль платежей вне фондов");	
		
	оп = новый ОписаниеОповещения("ВыбОтчет", ЭтотОбъект);
	ПоказатьВыборИзСписка(оп, сп, Элементы.Декорация1);
КонецПроцедуры

&НаКлиенте
Процедура ВыбОтчет(выбЗн, ДопПарам) Экспорт
	Если выбЗн <> Неопределено Тогда
		ОткрытьФорму("Отчет."+выбЗн.Значение+".Форма");
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВыплатыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Запрос = новый запрос;              
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_СредстваВРезервеНаФондахОбороты.Регистратор КАК Регистратор,
	               |	ИА_СредстваВРезервеНаФондахОбороты.ЗП КАК ЗП,
	               |	ИА_СредстваВРезервеНаФондахОбороты.ЗП.Номер КАК ЗПНомер
	               |ИЗ
	               |	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(&ДатаНачала, &датаКонца, Регистратор, ) КАК ИА_СредстваВРезервеНаФондахОбороты";
	Для каждого парам из  Настройки.ПараметрыДанных.Элементы цикл
		запрос.УстановитьПараметр(строка(парам.параметр), парам.Значение);
	КонецЦикла;
	тз_заказы = запрос.Выполнить().Выгрузить();
	
	Для каждого стр из Строки Цикл
		стрД = стр.Значение.Данные;
		Если ЗначениеЗаполнено(стрД.Контрагент) Тогда		
			стрД.КонтрагентКомментарий = стрД.Контрагент;
		Иначе
			стрД.КонтрагентКомментарий = стрД.Комментарий;
		КонецЕсли;
		
		стрД.РегистраторСтрока = стрД.Регистратор.метаданные().Синоним + " №" + ИА_ФПСервер.УбратьНули(стрД.РегистраторНомер);
		
		//
		СтрокиЗаказы = тз_заказы.НайтиСтроки(Новый Структура("Регистратор", стрД.Регистратор));
		ПредстЗаказов = "";
		Для каждого стрзаказ из СтрокиЗаказы цикл
			Если ПредстЗаказов <> "" Тогда
				ПредстЗаказов = ПредстЗаказов + ", ";
			КонецЕсли;
			ном = ИА_ФПСервер.УбратьНули(стрзаказ.ЗПНомер);
			
			ПредстЗаказов = ПредстЗаказов + ном;	
		КонецЦикла;
		
		стрД.Заказы = ПредстЗаказов;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПоискПриИзменении(Элемент)
	ИзмПериодВыплат();
КонецПроцедуры

