&НаКлиенте
перем ТекущаяПозицияНоменклатуры;
&НаСервере
перем ИндексГруппы;

&НаКлиенте
Процедура Выбрать(Команда)
	Выбор = Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура;
	Если Выбор = неопределено или НЕ Значениезаполнено(Выбор) тогда
		Сообщить("Значение не было найдено в форме выбора справочника");
	КонецЕсли;
	ЭтаФорма.ОповеститьОВыборе(Выбор); 
КонецПроцедуры

&НаКлиенте
Процедура ЛистатьГруппыВверх(Команда)
	ТекущиеДанные = Элементы.ГруппаНоменклатуры.ТекущиеДанные;
	СледующийЭлемент = ПредыдущийЭлементПоВложенности(ТекущиеДанные.Ссылка);
	Если Элементы.ГруппаНоменклатуры.Развернут(СледующийЭлемент) Тогда
		Если Элементы.ГруппаНоменклатуры.ТекущаяСтрока > 0 Тогда
			Элементы.ГруппаНоменклатуры.ТекущаяСтрока = Элементы.ГруппаНоменклатуры.ТекущаяСтрока - 1;
		КонецЕсли;
	Иначе
		Элементы.ГруппаНоменклатуры.Развернуть(СледующийЭлемент, Ложь);
		Элементы.ГруппаНоменклатуры.ТекущаяСтрока = СледующийЭлемент;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПредыдущийЭлементПоВложенности(Ссылка)
	Индекс = 0;
	ДеревоЗначений = РеквизитФормыВЗначение("ГруппаНоменклатуры");
	НайдСтрока = ДеревоЗначений.Строки.Найти(Ссылка, "Ссылка", Истина);
	ТекущийИндекс = НайдСтрока.Индекс;
	Если ТекущийИндекс > 0 Тогда
		НайдРодитель = ДеревоЗначений.Строки.Найти(НайдСтрока.Родитель.Ссылка, "Ссылка", Истина);
		Если ТекущийИндекс = НайдРодитель.Строки[0].Индекс Тогда //Если первый элемент то возвращаем индекс родителя 
			Возврат НайдРодитель.Индекс;
		КонецЕсли;	
		Для Номерстроки = 0 По НайдРодитель.Строки.Количество()-1 Цикл // Если нет то ищем по списку
			Если ТекущийИндекс = НайдРодитель.Строки[Номерстроки].Индекс Тогда
				Возврат Индекс;
			КонецЕсли;	
			Индекс = НайдРодитель.Строки[Номерстроки].Индекс;
		КонецЦикла;	
	КонецЕсли;	
	Возврат Индекс;
КонецФункции


&НаКлиенте
Процедура ЛистатьГруппыВниз(Команда)
	Если Элементы.ГруппаНоменклатуры.ТекущаяСтрока < КоличествоГруппНоменклатуры Тогда
		Элементы.ГруппаНоменклатуры.Развернуть(Элементы.ГруппаНоменклатуры.ТекущаяСтрока + 1, Ложь);
		Элементы.ГруппаНоменклатуры.ТекущаяСтрока = Элементы.ГруппаНоменклатуры.ТекущаяСтрока + 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЛистатьВверх(Команда)
	Если СписокНоменклатуры.Количество() > 0 Тогда
		ИдентификаторСтроки = Элементы.СписокНоменклатуры.ТекущаяСтрока; 
		СтрокаТЗ = СписокНоменклатуры.НайтиПоИдентификатору(ИдентификаторСтроки);
		Индекс = СписокНоменклатуры.Индекс(СтрокаТЗ);
		Если Индекс > 0 Тогда
			Индекс = Индекс - 1;
		КонецЕсли;	
		СтрокаТЗ = СписокНоменклатуры[Индекс];
		ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
		Элементы.СписокНоменклатуры.ТекущаяСтрока = ИдентификаторСтроки;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЛистатьВниз(Команда)
	Если СписокНоменклатуры.Количество() > 0 Тогда
		ИдентификаторСтроки = Элементы.СписокНоменклатуры.ТекущаяСтрока; // Получаем идентификатор в Таблице
		СтрокаТЗ = СписокНоменклатуры.НайтиПоИдентификатору(ИдентификаторСтроки);
		Индекс = СписокНоменклатуры.Индекс(СтрокаТЗ);
		Если Индекс < СписокНоменклатуры.Количество()-1 Тогда
			Индекс = Индекс + 1;
		КонецЕсли;	
		СтрокаТЗ = СписокНоменклатуры[Индекс];
		ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
		Элементы.СписокНоменклатуры.ТекущаяСтрока = ИдентификаторСтроки;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьДеревоГрупп();
	ДеревоЗначений = РеквизитФормыВЗначение("ГруппаНоменклатуры");
	Если Параметры.Свойство("ТекущаяСтрока") Тогда
		ТекущаяСтрокаНоменклатуры = Параметры.ТекущаяСтрока;
		НайдСтрока = ДеревоЗначений.Строки.Найти(ТекущаяСтрокаНоменклатуры.Родитель, , Истина);
		Если НайдСтрока <> Неопределено Тогда
			Элементы.ГруппаНоменклатуры.ТекущаяСтрока = НайдСтрока.Индекс;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДеревоГрупп()
	
	ДеревоЗначений = РеквизитФормыВЗначение("ГруппаНоменклатуры");
	КоличествоГруппНоменклатуры = 0;
	
	ИндексГруппы = 1;
	
	Корень = ДеревоЗначений.Строки.Добавить();
	Корень.Ссылка = Справочники.Номенклатура.ПустаяСсылка();
	Корень.Наименование = "Номенклатура";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Представление КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И Номенклатура.ЭтоГруппа = ИСТИНА";
	
	ВыборкаГрупп = Запрос.Выполнить().Выбрать();
	КоличествоГруппНоменклатуры = ВыборкаГрупп.Количество();
	Пока ВыборкаГрупп.Следующий() Цикл
		Подгруппа = Корень.Строки.Добавить();
		Подгруппа.Наименование = ВыборкаГрупп.Наименование;
		Подгруппа.Ссылка = ВыборкаГрупп.Ссылка;
		Подгруппа.Индекс = ИндексГруппы;
		ИндексГруппы = ИндексГруппы + 1;
		ДобавитьПодгруппы(Подгруппа);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ГруппаНоменклатуры");
КонецПроцедуры

&НаСервере
Процедура ДобавитьПодгруппы(Группа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Представление КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель = &Родитель
	|	И Номенклатура.ЭтоГруппа = ИСТИНА";
	
	Запрос.Параметры.Вставить("Родитель", Группа.Ссылка);
	
	ВыборкаГрупп = Запрос.Выполнить().Выбрать();
	КоличествоГруппНоменклатуры = КоличествоГруппНоменклатуры + ВыборкаГрупп.Количество();
	Пока ВыборкаГрупп.Следующий() Цикл
		Подгруппа = Группа.Строки.Добавить();
		Подгруппа.Наименование = ВыборкаГрупп.Наименование;
		Подгруппа.Ссылка = ВыборкаГрупп.Ссылка;
		Подгруппа.Индекс = ИндексГруппы;
		ИндексГруппы = ИндексГруппы + 1;
		ДобавитьПодгруппы(Подгруппа);
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ГруппаНоменклатурыПриАктивизацииСтроки(Элемент)
	ЗаполнитьНоменклатуру(Элемент.ТекущиеДанные.Ссылка);
	Если СписокНоменклатуры.Количество() > 0 Тогда
		СтрокаТЗ = СписокНоменклатуры[0];
		ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
		Элементы.СписокНоменклатуры.ТекущаяСтрока = ИдентификаторСтроки;
	КонецЕсли;
	//Развернут = Элементы.ГруппаНоменклатуры.Развернут(Элементы.ГруппаНоменклатуры.ТекущаяСтрока);
	Элементы.ГруппаНоменклатуры.Развернуть(Элементы.ГруппаНоменклатуры.ТекущаяСтрока, Ложь);
	//Развернут = Элементы.ГруппаНоменклатуры.Развернут(Элементы.ГруппаНоменклатуры.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНоменклатуру(Ссылка)
	
	СписокНоменклатуры.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпрНоменклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Родитель = &Родитель
	|	И СпрНоменклатура.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Родитель", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", ТекущаяСтрокаНоменклатуры);
	СтрокаТЗ = СписокНоменклатуры.НайтиСтроки(Отбор);
	ИдентификаторСтроки = СтрокаТЗ[0].ПолучитьИдентификатор();
	Элементы.СписокНоменклатуры.ТекущаяСтрока = ИдентификаторСтроки;
КонецПроцедуры



