
Процедура ИА_КСУДействие() Экспорт
	ОткрытьФорму("Справочник.ИА_ВидыСтатистик.Форма.ФормаСпискаФинПоказателей");
КонецПроцедуры

Процедура СкрытьРамкиНедоступныхЭлементов(пЭлементыФормы, СкрытьВсегда = ложь) Экспорт
	цвФормы = ИА_КСУОбщийСервер.ПолучитьЦветФормы();
	для каждого эл из пЭлементыФормы Цикл
		Если типзнч(эл) = тип("ПолеФормы") Тогда
			Если (эл.ТолькоПросмотр или не эл.Доступность) ИЛИ СкрытьВсегда Тогда
				эл.ЦветРамки = цвФормы;
			ИначеЕсли эл.ЦветРамки <> цвФормы Тогда
				эл.ЦветРамки = Новый Цвет();
			КонецЕсли;
		ИначеЕсли типзнч(эл) = тип("ГруппаФормы") Тогда
			Если (эл.ТолькоПросмотр или не эл.Доступность) ИЛИ СкрытьВсегда Тогда
				СкрытьРамкиНедоступныхЭлементов(эл.ПодчиненныеЭлементы, истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры