
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.Материалы) = Тип("Массив") Тогда
		Для Каждого Материал Из Параметры.Материалы Цикл
			НоваяСтрока = Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Материал);
			Если СтрНайти(НоваяСтрока.Номенклатура.Наименование, "Гарпун") > 0 
				ИЛИ СтрНайти(НоваяСтрока.Номенклатура.Наименование, "гарпун") > 0 
			Тогда
				НоваяСтрока.Отметка = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, "МатериалыНоменклатураАртикул");
	
КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	
	Если КоличествоГарпун = 0 Тогда
		
		Сообщить("Введите количество гарпуна!");
		
	Иначе	
	
		ДанныеНаВозврат = новый Структура;
		ДанныеНаВозврат.Вставить("КоличествоГарпун", КоличествоГарпун);
		МассивГарпунов = новый Массив;
		
		Для Каждого Материал Из Материалы Цикл
			
			Если НЕ Материал.Отметка Тогда
				Продолжить;			
			КонецЕсли;	
			
			СтруктураСтроки = новый Структура("НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Количество",
										       Материал.НомерСтроки, Материал.Номенклатура, Материал.ХарактеристикаНоменклатуры, Материал.СерияНоменклатуры, Материал.Количество);
			МассивГарпунов.Добавить(СтруктураСтроки);
			
		КонецЦикла;
		
		ДанныеНаВозврат.Вставить("Материалы", МассивГарпунов);
		Закрыть(ДанныеНаВозврат);
		
	КонецЕсли;
	
КонецПроцедуры
