&НаСервере
Процедура ЗаполнитьНоменклатуруПоГруппе(ГруппаНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатура)
	|	И Номенклатура.ЭтоГруппа = Ложь";
	Запрос.УстановитьПараметр("ГруппаНоменклатура",ГруппаНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СтоимостьВыработки.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Ссылка;
		НоваяСтрока.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьГруппуНоменклатуры(Команда)
	
    ФормаНоменклатура = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора", );
	ФормаНоменклатура.Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы;
    ВыбраннаяНоменклатура = ФормаНоменклатура.ОткрытьМодально();
	Если ВыбраннаяНоменклатура <> Неопределено Тогда
		Если Объект.СтоимостьВыработки.Количество() > 0 Тогда
			Если Вопрос("Табличная часть не пустая. Очистить?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.СтоимостьВыработки.Очистить();
			КонецЕсли;
		КонецЕсли;
		ЗаполнитьНоменклатуруПоГруппе(ВыбраннаяНоменклатура);
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура КомандаУстановитьСтоимостьВыработкиНаСервере(НоваяСтоимость, КолонкаТаблицы)
	Для Каждого ТекущаяСтрока Из Объект.СтоимостьВыработки Цикл
		ТекущаяСтрока[КолонкаТаблицы] = НоваяСтоимость;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСтоимостьВыработки(Команда)
	НоваяСтоимость = 0;
	ВвестиЗначение(НоваяСтоимость,"Введите цену", Новый ОписаниеТипов("число"));
	
	КомандаУстановитьСтоимостьВыработкиНаСервере(НоваяСтоимость, "Стоимость");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		ОбщийМодуль.ЗаполнитьШапкуДокумента(Объект);
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	Элементы.СтоимостьВыработкиГруппаСтоимость.Заголовок = "Цена выработки, " + Константы.ВалютаУчета.Получить().Наименование;
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьВыработкиНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.СтоимостьВыработки.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаКлиенте
Процедура СтоимостьВыработкиЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.СтоимостьВыработки.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;  	

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьЦенуВыработкиДляМенеджера(Команда)
	НоваяСтоимость = 0;
	ВвестиЗначение(НоваяСтоимость,"Введите цену", Новый ОписаниеТипов("число"));
	
	КомандаУстановитьСтоимостьВыработкиНаСервере(НоваяСтоимость, "СтоимостьДляМенеджера");
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	//Элементы.СтоимостьЗаПозициюПродукцииРаскройщику.Видимость = Объект.УстановитьСтоимостьЗаПозициюВВыпуске;
	Элементы.ГруппаСтоимостьЗаПозициюДляРаскройщиков.Видимость = Объект.УстановитьСтоимостьЗаПозициюВВыпуске;
	Элементы.СтоимостьЗаПозициюПродукцииМенеджеру.Видимость = Объект.УстановитьСтоимостьЗаПозициюВВыпуске;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтоимостьЗаПозициюВВыпускеПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементыФормы();
КонецПроцедуры
