
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсторияЗвонковАТС, "НомерФормат", Параметры.ИсторияОтборПоНомеру);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсторияЗвонковАТС, "ДатаГраница", КонецДня(Параметры.ИсторияДатаОкончания));
	
	РазрешеноИспользованиеIPТелефонии = СофтФон.ТекущемуПользователюРазрешеноИспользованиеIPТелефонии();
	Элементы.ФормаСкачатьЗаписьЗвонка.Видимость = РазрешеноИспользованиеIPТелефонии;
	Элементы.ФормаПрослушатьЗаписьЗвонка.Видимость = РазрешеноИспользованиеIPТелефонии;
	
КонецПроцедуры

// аналогичная функция в АРМ Розницы
&НаКлиенте
Процедура ПрослушатьЗаписьЗвонка(Команда)
	
	ТекДанные=Элементы.ИсторияЗвонковАТС.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СофтФонКлиент.ПрослушатьЗаписьЗвонка(ТекДанные.ИДВАТС, ТекДанные.ИД, ТекДанные.ЕстьЗапись, ТекДанные.ФайлЗаписиСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СкачатьЗаписьЗвонка(Команда)
	
	ТекДанные=Элементы.ИсторияЗвонковАТС.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СофтФонКлиент.СкачатьЗаписьЗвонка(ТекДанные.ИДВАТС, ТекДанные.ИД, ТекДанные.ЕстьЗапись, ТекДанные.ФайлЗаписиСсылка);

КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗвонковАТСПередУдалением(Элемент, Отказ)
	
	Если НЕ ДоступнаРольАдминистратора() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступнаРольАдминистратора()
	Возврат РольДоступна("АдминистраторСистемы");
КонецФункции

