
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ПериодПродажНачало = Дата("00010101") Тогда
		Объект.ПериодПродажНачало = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	КонецЕсли;
	Если Объект.ПериодПродажКонец = Дата("00010101") Тогда
		Объект.ПериодПродажКонец = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	КонецЕсли;
	Если Константы.УчетБонусовПоДисконтнымКартам.Получить() Тогда
		Элементы.БонусыДисконтнаяКарта.Видимость = Истина;
	Иначе
		Элементы.БонусыДисконтнаяКарта.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуБонусовПоПроценту()
	Для Каждого ТекущаяСтрока Из Объект.Бонусы Цикл
		ТекущаяСтрока.Сумма = ОКР(ТекущаяСтрока.СуммаПродаж * (Объект.ПроцентОтПродажДляНачисленияБонусов / 100));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопрос(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПересчитатьСуммуБонусовПоПроценту();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроцентОтПродажДляНачисленияБонусовПриИзменении(Элемент)
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопрос", ЭтаФорма, Параметры),"Пересчитать сумму бонусов к начислению?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеОПродажахНаСервере()
	
	Объект.Бонусы.Очистить();
	
	Если Константы.УчетБонусовПоКонтрагентам.Получить() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажиОбороты.Контрагент,
		|	ПродажиОбороты.СуммаОборот КАК СуммаПродаж,
		|	ВзаиморасчетыСКонтрагентамиОбороты.СуммаРасход КАК СуммаПоступившихОплат,
		|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК СуммаЗадолженности
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ПериодПродажНачало, &ПериодПродажКонец, , ) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(&ПериодПродажНачало, &ПериодПродажКонец, , ) КАК ВзаиморасчетыСКонтрагентамиОбороты
		|		ПО ПродажиОбороты.Контрагент = ВзаиморасчетыСКонтрагентамиОбороты.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ПериодПродажКонец, ) КАК ВзаиморасчетыСКонтрагентамиОстатки
		|		ПО ПродажиОбороты.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент";
		Запрос.УстановитьПараметр("ПериодПродажНачало",НачалоДня(Объект.ПериодПродажНачало));
		Запрос.УстановитьПараметр("ПериодПродажКонец",КонецДня(Объект.ПериодПродажКонец));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Бонусы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	ИначеЕсли Константы.УчетБонусовПоДисконтнымКартам.Получить() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажиОбороты.Контрагент,
		|	ПродажиОбороты.СуммаОборот КАК СуммаПродаж,
		|	ВзаиморасчетыСКонтрагентамиОбороты.СуммаРасход КАК СуммаПоступившихОплат,
		|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК СуммаЗадолженности,
		|	ПродажиОбороты.ДисконтнаяКарта
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ПериодПродажНачало, &ПериодПродажКонец, , ) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(&ПериодПродажНачало, &ПериодПродажКонец, , ) КАК ВзаиморасчетыСКонтрагентамиОбороты
		|		ПО ПродажиОбороты.Контрагент = ВзаиморасчетыСКонтрагентамиОбороты.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ПериодПродажКонец, ) КАК ВзаиморасчетыСКонтрагентамиОстатки
		|		ПО ПродажиОбороты.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент";
		Запрос.УстановитьПараметр("ПериодПродажНачало",НачалоДня(Объект.ПериодПродажНачало));
		Запрос.УстановитьПараметр("ПериодПродажКонец",КонецДня(Объект.ПериодПродажКонец));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Бонусы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
	Объект.Бонусы.Сортировать("СуммаПродаж Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеОПродажах(Команда)
	ПолучитьДанныеОПродажахНаСервере();
КонецПроцедуры

&НаСервере
Функция НачислитьБонусыНаСервере()
	
	Результат = Неопределено;
	
	Если Объект.Бонусы.Итог("Сумма") > 0 тогда
		Попытка
			НовыйДокумент = Документы.НачислениеБонусовКонтрагентам.СоздатьДокумент();
			НовыйДокумент.Дата = КонецМесяца(Объект.ПериодПродажКонец);
			НовыйДокумент.Заполнить(Неопределено); 
			Для Каждого ТекущаяСтрока Из Объект.Бонусы Цикл
				Если ТекущаяСтрока.Сумма > 0 Тогда
					НоваяСтрока = НовыйДокумент.Бонусы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				КонецЕсли;
			КонецЦикла;
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создан новый документ " + НовыйДокумент);
			Результат = НовыйДокумент.Ссылка;
		Исключение
			Сообщить("Не удалось создать документ начисления бонусов. " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачислитьБонусы(Команда)
	СозданныйДокумент = НачислитьБонусыНаСервере();
	Если НЕ СозданныйДокумент = Неопределено Тогда
		ПараметрыДокумента = новый Структура;
		ПараметрыДокумента.Вставить("Ключ",СозданныйДокумент);
		ОткрытьФорму("Документ.НачислениеБонусовКонтрагентам.ФормаОбъекта",ПараметрыДокумента);
	КонецЕсли;
КонецПроцедуры
