//Основа взята здесь:
//http://devtrainingforum.v8.1c.ru/forum/thread.jsp?id=583504
//дополнительно "курим" здесь
//http://www.1c-pro.ru/topic26882.html

//Создание Внешней Обработки Для перенумерации всего.
//пока переименовывает справочники
//	Контрагенты
//	Организации
//	ФизическиеЛица
//
//Полная глупость - это задание "правой" части кода в количесве символов
//	По хорошему - надо узнать "полный размер" поля, вычесть оттуда 3 (!!!) символа (00-)
//	и посмотреть, сколько останется до "полного размера"

//1. Создаём внешнюю обработку. Для Управляемого Приложения. Для Тонкого Клиента.
//2. Переходим в Модуль Объекта этой Внешней Обработки.
//3. Делаем переменную, в которую поместим идентификатор команды, которая у нас будет выполняться
// Мы заполним её стразу при входе в нашу обработку, то есть в самом низу
// Пригодится если будем сравнивать её с чем-нибудь. Переменную сравнивать проще, чем литерал
Перем Команда_Нашей_Обработки_Идентификатор;

//4. Создаём служебную функцию
Функция СведенияОВнешнейОбработке() Экспорт
/// Создаём Структуру для дальнейшей работы, через неё параметры будем перекидывать туда куда надо
ПараметрыРегистрации = Новый Структура;

// Начинаем набивать параметры в созданную структуру

// ПАРАМЕТР Вид
//ПараметрыРегистрации.Вставить("Вид", ВыбранныйВид);
// Строка, вид обработки, один из возможных вариантов: "ДополнительнаяОбработка", "ДополнительныйОтчет", "ЗаполнениеОбъекта", "Отчет", "ПечатнаяФорма" или "СозданиеСвязанныхОбъектов"
//
//Это обработка, следовательно:
ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");

// ПАРАМЕТР Назначение
// Массив строк имен объектов метаданных в формате: <ИмяКлассаОбъектаМетаданного>.[ * | <ИмяОбъектаМетаданных>]. Например, "Документ.СчетЗаказ" или "Справочник.*".
// Делаем массив для запихивания в параметры регистрации
//
Назначение = Новый Массив;
//Если бы работали, предположим, с
//	с объектом «ОтчетОРозничныхПродажах, то сделали бы так
//	Назначение.Добавить("Документ.ОтчетОРозничныхПродажах");
//
//Вообще - не очень понятно, что у нас, поэтому - пока вообще пустой массив :)
// Запихиваем массив в параметры
//
ПараметрыРегистрации.Вставить("Назначение", Назначение);

// ПАРАМЕТР Наименование
// Наименование обработки, которым будет заполнено наименование элемента справочника, краткое описание для идентификации обработки администратором.
//
ПараметрыРегистрации.Вставить("Наименование", "Установка разные режимов для интерфейса Такси" );

// ПАРАМЕТР Версия
// Версия обработки в формате “<старший номер>.<младший номер>” используется при загрузке обработок в информационную базу.
//
ПараметрыРегистрации.Вставить("Версия", "0.001");

// ПАРАМЕТР Безопасный режим
// Принимает значение Истина или Ложь, в зависимости от того, требуется ли устанавливать или отключать безопасный режим исполнения обработок.
// Если истина, обработка будет запущена в безопасном режиме.  Более подробно о безопасном режиме см. документацию к платформе 1С:Предприятие.
//
ПараметрыРегистрации.Вставить("БезопасныйРежим", ИСТИНА);
//ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);

// ПАРАМЕТР Информация
// Краткая информация по обработке, описание обработки.
//
ПараметрыРегистрации.Вставить("Информация", "Обработка, устанавливающая компактный/авто режим для форм ТАКСИ.");

// ПАРАМЕТР Таблица Команд – его надо сначала создать
// Из чего состоит Таблица Команд, как она устроена - это можно посмотреть в функции ПолучитьТаблицуКоманд()
//
ТаблицаКоманд = ПолучитьТаблицуКоманд();

// После создания Таблицы Команд – заносим в неё ровно одну команду
//
//ДобавитьКоманду(ТаблицаКоманд, "Заполним таблицу Товары", Команда_Нашей_Обработки_Идентификатор, "ОткрытиеФормы", ЛОЖЬ);
ДобавитьКоманду(ТаблицаКоманд, "УстановкаРежимаДляИнтерфейсаТакси", Команда_Нашей_Обработки_Идентификатор, "ОткрытиеФормы", ЛОЖЬ);

// Забрасываем созданную и заполненную Таблицу Команд в параметры регистрации
//
ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);

//
Возврат ПараметрыРегистрации;

КонецФункции
//////////////////////////////////////////////////////


// Здесь можно посмотреть как устроена Таблица Команда
Функция ПолучитьТаблицуКоманд()

// Таблица Команд – это таблица значений – вот её и создаём
//
Команды = Новый ТаблицаЗначений;

// Начинаем делать колонки для таблицы команд

// КОЛОНКА Представление
// Представление – представление команды в пользовательском интерфейсе;
//
Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));

// КОЛОНКА Идентификатор
// Идентификатор – идентификатор команды; любая строка, уникальная в пределах данной обработки (отчета). 
// Для обработок с печатными формами на основе макета табличного документа должен содержать список макетов, на основе которых нужно получить печатную форму (см. описание параметра ИменаМакетов процедуры УправлениеПечатьюКлиент.ВыполнитьКомандуПечати в разделе Печать).
//
Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));

// КОЛОНКА Использование 
// Использование – вариант запуска команды – их всего Три – они задаются строками:
// ● "ОткрытиеФормы" – открыть форму обработки;
// ● "ВызовКлиентскогоМетода" – вызвать клиентскую экспортную процедуру из модуля формы обработки;
// ● "ВызовСерверногоМетода" – вызвать серверную экспортную процедуру из модуля объекта обработки.
//
Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));

// КОЛОНКА Показывать Оповещение
// ПоказыватьОповещение – Истина, если требуется показать оповещение при начале и при завершении работы обработки. Например, при запуске обработки без открытия формы.
//
Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));

// КОЛОНКА Модификатор
// Модификатор – дополнительный модификатор команды. Используется для дополнительных обработок печатных форм на основе табличных макетов, для таких команд должен содержать строку ПечатьMXL (см. пример в демонстрационной конфигурации Библиотеки Стандартных Подсистем).
//
Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));

// Созданную пустую таблицу возвращают назад
Возврат Команды;

КонецФункции
///////////////////////////////////////////////

// ТУТ ВСЁ ПОНЯТНО
Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
//
НоваяКоманда = ТаблицаКоманд.Добавить();
//
НоваяКоманда.Представление = Представление;
НоваяКоманда.Идентификатор = Идентификатор;
НоваяКоманда.Использование = Использование;
НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
НоваяКоманда.Модификатор = Модификатор;
//
КонецПроцедуры


Команда_Нашей_Обработки_Идентификатор = "ПереключениеРежимовДляИнтерфейсаТакси";
