
&НаСервере
Функция СформироватьНаСервереВидыКонтактов()
	
	Возврат МодульОтчетов.СформироватьОтчетПоВходящимКонтактамВРазрезеВидовКонтактов(Отчет.ДатаНачала, Отчет.ДатаОкончания);		
	
КонецФункции

&НаСервере
Функция СформироватьНаСервереМенеджеры()
	
	Возврат МодульОтчетов.СформироватьОтчетПоВходящимКонтактамВРазрезеМенеджеров(Отчет.ДатаНачала, Отчет.ДатаОкончания);
	
КонецФункции

&НаСервере
Функция СформироватьНаСервереРекламныеИсточники()
	
	Возврат МодульОтчетов.СформироватьОтчетПоВходящимКонтактамВРазрезеРекламныхИсточников(Отчет.ДатаНачала, Отчет.ДатаОкончания);
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Если ВидОтчета = "" Тогда 
		ПоказатьПредупреждение(, "Не выбран Вид отчета");
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Анализ, "НеИспользовать");

	Если ВидОтчета = "ВидыКонтактов" Тогда 
		Анализ = СформироватьНаСервереВидыКонтактов();
	ИначеЕсли ВидОтчета = "Менеджеры" Тогда 
		Анализ = СформироватьНаСервереМенеджеры();
	ИначеЕсли ВидОтчета = "РекламныеИсточники" Тогда 
		Анализ = СформироватьНаСервереРекламныеИсточники();		
	КонецЕсли;
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Если Отчет.ДатаНачала = Дата("00010101") Тогда
		Отчет.ДатаНачала = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	Если Отчет.ДатаОкончания = Дата("00010101") Тогда
		Отчет.ДатаОкончания = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Анализ, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	// 2017-07-12 обработка расшифровки 
	СтандартнаяОбработка = Ложь;	
	ПараметрыФормы = Новый Структура("ДатаНачала, ДатаОкончания", Отчет.ДатаНачала, Отчет.ДатаОкончания);
	
	Если Расшифровка.Свойство("ВидКонтакта") Тогда
		ПараметрыФормы.Вставить("ВидКонтакта", Расшифровка.ВидКонтакта);
	КонецЕсли;
	
	Если Расшифровка.Свойство("ИспользоватьВидКонтакта") Тогда
		ПараметрыФормы.Вставить("ИспользоватьВидКонтакта", Истина);
	КонецЕсли;
	
	Если Расшифровка.Свойство("СтолбецЗамеры") Тогда
		ПараметрыФормы.Вставить("СтолбецЗамеры", Истина);
	КонецЕсли;
	Если Расшифровка.Свойство("Сотрудник") Тогда
		ПараметрыФормы.Вставить("Сотрудник", Расшифровка.Сотрудник);
	КонецЕсли;
	
	Если Расшифровка.Свойство("РекламныйИсточник") Тогда
		ПараметрыФормы.Вставить("РекламныйИсточник", Расшифровка.РекламныйИсточник);
		ПараметрыФормы.Вставить("ОтборРекламныйИсточник", Истина);
	КонецЕсли;
		
	Форма = ПолучитьФорму("РегистрСведений.ВходящиеКонтакты.Форма.ФормаСпискаРасшифровка", ПараметрыФормы); 
	Форма.Открыть();	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетовПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Анализ, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Анализ, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Анализ, "НеАктуальность");
КонецПроцедуры
