
Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() И НЕ ЭтоГруппа Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Для каждого стр из Статистики Цикл
		Если не ЗначениеЗаполнено(стр.Аналитика1) Тогда
			стр.Аналитика1 = Неопределено;
		КонецЕсли;
		
		Если не ЗначениеЗаполнено(стр.Аналитика2) Тогда
			стр.Аналитика2 = Неопределено;
		КонецЕсли;
		
		Если не ЗначениеЗаполнено(стр.Аналитика3) Тогда
			стр.Аналитика3 = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Для каждого СтрокаСтатистики Из Статистики Цикл
	//	Если СтрокаСтатистики.СдвигПериода <> 0 Тогда
	//		ПроверяемыеРеквизиты.Добавить("Статистики.ВидСдвигаПериода");
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры
