&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Декорация1.Видимость = Ложь;
	Элементы.Декорация2.Видимость = Ложь;
	
	
	Если Параметры.КоличествоПросроченных > 0 Тогда
		Элементы.Декорация1.Видимость = Истина;
		Если Параметры.ИзСпискаУведомления Тогда
			Элементы.Декорация1.Заголовок = "Имеются просроченные менеджерами лиды";
		Иначе	
			Элементы.Декорация1.Заголовок = "Внимание! У вас имеются просроченные лиды: " + Параметры.КоличествоПросроченных + " шт.";
		КонецЕсли;		
	Иначе
		Элементы.Декорация2.Видимость = Истина;
		Если Параметры.ИзСпискаУведомления Тогда
			Элементы.Декорация2.Заголовок = "У менеджеров нет просроченных лидов!";
		Иначе	
			Элементы.Декорация2.Заголовок = "У Вас нет просроченных лидов!";
		КонецЕсли;		
	КонецЕсли;
	
	СписокЛидов.Очистить();
	Для Каждого ПросроченныйЛид из Параметры.СписокПросроченных Цикл
		Ссылка = ПросроченныйЛид.Значение;
		//ТекОбъект = Ссылка.ПолучитьОбъект();
		НоваяСтрока = СписокЛидов.Добавить();
		//НоваяСтрока.ДатаПоследнейРеакции = ТекОбъект.ДатаПоследнейРеакции; //#11632 закомментировано
		НоваяСтрока.ДатаСледущегоКонтакта = Ссылка.ПоследняяДатаПерезвонить; //#11632 
		НоваяСтрока.Автор = Ссылка.Автор;
		НоваяСтрока.ТекущийСтатус = Ссылка.ТекущийСтатус;
		НоваяСтрока.Номер = Ссылка.Номер;
		НоваяСтрока.ВидКонтакта = Ссылка.ВидКонтакта;
		НоваяСтрока.ИмяКлиента = Ссылка.ИмяКлиента;
		НоваяСтрока.Ссылка = Ссылка.Ссылка;
		НоваяСтрока.ДатаЛида = Ссылка.Дата;
		НоваяСтрока.Менеджер = Ссылка.Менеджер;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛидовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущийДок = Элементы.СписокЛидов.ТекущиеДанные;
	ПараметрыНов = новый Структура("Ключ", ТекущийДок.Ссылка);
	ОткрытьФорму("Документ.Лид.Форма.ФормаДокумента", ПараметрыНов);
КонецПроцедуры
