
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// #13253 
	Если Объект.Предопределенный Тогда
		Элементы.ДекорацияНепредопределенный.Видимость = Ложь;
		Если Объект.Ссылка = Справочники.СтатусыЗаказовПокупателей.Новый Тогда
			//++ №13631 у статуса новый запрещаем редактировать наименование и код
			Элементы.Код.Доступность = Ложь;
			Элементы.Наименование.Доступность = Ложь;
			//-- №13631
		Иначе
			ТолькоПросмотр = Истина;
		КонецЕсли;		
	Иначе
		Элементы.ДекорацияНепредопределенный.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры
