#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования) 
	
	ОтправленEMail = Ложь;	
	//УДАЛИТЬ_ОтправленоСМС = Ложь;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Результат = Справочники.СтатусыЗаявокНаДоставку.Заявка; // №10663 заменено на справочник, было: Перечисления.СтатусыДоставкиТовара.Заявка;
	ОжидаемаяДатаОтправки = ТекущаяДатаСеанса();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") И ДанныеЗаполнения.Количество() > 0 Тогда
		
		Если ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Или ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
			ЗаполнитьПоЗаказуПокупателяИлиРеализацииТоваровИУслуг(ДанныеЗаполнения);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения);
		КонецЕсли;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		
		ЗаполнитьПоЗаказуПокупателяИлиРеализацииТоваровИУслуг(ДанныеЗаполнения); // №10663 унифицировано для массового создания
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//++ №11954
	Если НЕ Метаданные.Документы.ЗаявкаНаДоставку.Реквизиты.Найти("ТекущийСтатус") = Неопределено
		И НЕ ПроверяемыеРеквизиты.Найти("ТекущийСтатус") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ТекущийСтатус"))
	КонецЕсли;
	//-- №11954
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи); 	
	
	//nva+++
	Если НЕ ЗначениеЗаполнено(ТелефонКонтактногоЛица) Тогда
		Отказ = Истина; 
		ТекстОшибки = НСтр("ru='Заполнение телефона контактного лица обязательно'");	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ТелефонКонтактногоЛица", "Объект", Отказ);
	КонецЕсли;
	//Если СпособДоставки = Справочники.СпособыДоставкиТовара.СобственныйТранспорт Тогда
	//	Если НЕ ЗначениеЗаполнено(ТранспортноеСредство) Тогда
	//		Отказ = Истина; 
	//		ТекстОшибки = НСтр("ru='Если доставка осуществляется собственным транспортом, то заполнение транспортного средства обязательно'");	
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ТранспортноеСредство", "Объект", Отказ);
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если Результат = Справочники.СтатусыЗаявокНаДоставку.Отправлено ИЛИ Результат = Справочники.СтатусыЗаявокНаДоставку.Доставлено Тогда
	//	Если СтоимостьДоставки + СтоимостьДоставки*0.2 <= СуммаЗатратНаДоставку Тогда
	//		Отказ = Истина; 
	//		ТекстОшибки = НСтр("ru='Если стомость доставки отличается от суммы оплаты компанией, то заполнение комментария обязательно'");	
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Комментарий", "Объект", Отказ);
	//	КонецЕсли;
	//КонецЕсли;	
	//nva---
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьПоЗаказуПокупателяИлиРеализацииТоваровИУслуг(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивДокументов, Истина); //nva
	КонецЕсли;
	
	Организация = МассивДокументов[0].Организация;
	Получатель 	= МассивДокументов[0].Контрагент;
	
	Если ЗначениеЗаполнено(МассивДокументов[0].АдресДоставки) Тогда
		АдресДоставки = МассивДокументов[0].АдресДоставки;
	Иначе
		АдресДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	КонецЕсли;
	
	// #16795
	Город = МассивДокументов[0].ГородДоставки;
	СпособДоставки = МассивДокументов[0].СпособДоставки;
	
	Для Каждого ЭлементМассива из МассивДокументов Цикл
		
		Если Получатель <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		Если Организация <> ЭлементМассива.Организация Тогда
			Текст = НСтр("ru = 'Организации в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		Для Каждого ТекущаяСтрокаТоварыОснования Из ЭлементМассива.Товары Цикл
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрокаТоварыОснования.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
				
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрокаТоварыОснования);
			НоваяСтрока.Основание = ЭлементМассива;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Организация = МассивДокументов[0].Организация;
	Получатель 	= МассивДокументов[0].Контрагент;
	
	АдресДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	
	// #16795
	//Город = МассивДокументов[0].ГородДоставки;
	СпособДоставки = МассивДокументов[0].СпособДоставкиТовара;
	
	Для Каждого ЭлементМассива из МассивДокументов Цикл
		
		Если Получатель <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		Если Организация <> ЭлементМассива.Организация Тогда
			Текст = НСтр("ru = 'Организации в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		Для Каждого ТекущаяСтрокаТоварыОснования Из ЭлементМассива.Товары Цикл
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрокаТоварыОснования.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
				
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрокаТоварыОснования);
			НоваяСтрока.Основание = ЭлементМассива;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОснование(ДанныеЗаполнения) Экспорт
	
	НайденныеСтроки = Основания.НайтиСтроки(Новый Структура("Основание", ДанныеЗаполнения));
	Если  НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = Основания.Добавить();
		НоваяСтрока.Основание = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТоварыПоОснованиям() Экспорт
	
	Товары.Очистить();
	
	Для Каждого СтрокаОснования Из Основания Цикл
		
		Если СтрокаОснования.Основание = Неопределено Или НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаОснования.Основание, "Товары") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из СтрокаОснования.Основание.Товары Цикл
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
				
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Основание = СтрокаОснования.Основание;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

//nva+++
Процедура ПриЗаписи(Отказ)
	Если ДополнительныеСвойства.Свойство("ПредыдущаяОжидаемаяДатаОтправки")
		И НЕ ОжидаемаяДатаОтправки = ДополнительныеСвойства.ПредыдущаяОжидаемаяДатаОтправки Тогда
		// при программном создании / записи заказа свойство заполняется в "ИнициализироватьСлужебныеРеквизиты"
		// при создании через форму в "ПередЗаписьюНаСервере"
		ТекстКомментария = СтрШаблон("Изменена дата доставки с ""%1"" на ""%2""", ДополнительныеСвойства.ПредыдущаяОжидаемаяДатаОтправки, ОжидаемаяДатаОтправки);
		РегистрыСведений.NVA_ИсторияЗаявкиНаДоставку.ДобавитьЗаписьВИсторию(Ссылка, ТекущаяДатаСеанса(), Пользователи.ТекущийПользователь(), ТекстКомментария);
	КонецЕсли;
КонецПроцедуры
//nva---
