
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//++ №13259 прежняя версия
	//НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	//
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СебестоимостьУслугВСебестоимостиПотолка"));

	//ИспользуетсяПР = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();
	//
	////#12385
	////ПараметрНП = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("НачалоПериода"));
	////ПараметрКП = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("КонецПериода"));
	//ПараметрСтПериод = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("СтПериод"));
	//
	//ПараметрНПР = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("НачалоПериодаПР"));
	//ПараметрКПР = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("КонецПериодаПР"));
	//
	//ПараметрНРег = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("НачалоПериодаРег"));
	//ПараметрКРег = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("КонецПериодаРег"));
	//
	//Если ИспользуетсяПР Тогда
	//	ПараметрНРег.Значение = Дата(1,1,1);
	//	ПараметрКРег.Значение = Дата(3999,12,31);
	//	//ПараметрНПР.Использование  = ПараметрНП.Использование;
	//	//ПараметрКПР.Использование  = ПараметрКП.Использование;
	//	//ПараметрНПР.Значение  = ?(ПараметрНП.Использование, ПараметрНП.Значение, Дата(1,1,1));
	//	//ПараметрКПР.Значение  = ?(ПараметрКП.Использование, ПараметрКП.Значение, Дата(3999,12,31));
	//	ПараметрНПР.Использование  = ПараметрСтПериод.Использование;
	//	ПараметрКПР.Использование  = ПараметрСтПериод.Использование;
	//	ПараметрНПР.Значение  = ?(ПараметрСтПериод.Использование, ПараметрСтПериод.Значение.ДатаНачала, Дата(1,1,1));
	//	ПараметрКПР.Значение  = ?(ПараметрСтПериод.Использование, ПараметрСтПериод.Значение.ДатаОкончания, Дата(3999,12,31));
	//Иначе		
	//	ПараметрНПР.Значение = Дата(1,1,1);
	//	ПараметрКПР.Значение = Дата(3999,12,31);
	//	//ПараметрНРег.Использование  = ПараметрНП.Использование;
	//	//ПараметрКРег.Использование  = ПараметрКП.Использование;
	//	//ПараметрНРег.Значение  = ?(ПараметрНП.Использование, ПараметрНП.Значение, Дата(1,1,1));
	//	//ПараметрКРег.Значение  = ?(ПараметрКП.Использование, ПараметрКП.Значение, Дата(3999,12,31));
	//	ПараметрНРег.Использование  = ПараметрСтПериод.Использование;
	//	ПараметрКРег.Использование  = ПараметрСтПериод.Использование;
	//	ПараметрНРег.Значение  = ?(ПараметрСтПериод.Использование, ПараметрСтПериод.Значение.ДатаНачала, Дата(1,1,1));
	//	ПараметрКРег.Значение  = ?(ПараметрСтПериод.Использование, ПараметрСтПериод.Значение.ДатаОкончания, Дата(3999,12,31));
	//КонецЕсли;
	//
	//КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	//-- №13259 прежняя версия
	
	//++ №13259 новая версия
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ИспользуетсяПериодРегистрации = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();
	
	ПараметрСтПериод = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("СтПериод"));
	НачалоПериода = ПараметрСтПериод.Значение.ДатаНачала;
	КонецПериода = ПараметрСтПериод.Значение.ДатаОкончания;
	
	ВключеноНачалоПериода = (ЗначениеЗаполнено(НачалоПериода) И ПараметрСтПериод.Использование);
	ВключеноКонецПериода = (ЗначениеЗаполнено(КонецПериода) И ПараметрСтПериод.Использование);
	
	ПараметрПолучитьОстаток = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("ПолучитьОстатокПоПериодуРегистрации"));
	ПараметрПолучитьОстаток.Значение = (ИспользуетсяПериодРегистрации И ВключеноНачалоПериода);
	
	НачалоПериодаСтандартное = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("НачалоПериодаСтандартное"));
	КонецПериодаСтандартное = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("КонецПериодаСтандартное"));
	
	НачалоПериодаРегистрации = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("НачалоПериодаРегистрации"));
	КонецПериодаРегистрации = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("КонецПериодаРегистрации"));
	
	НачалоПериодаСтандартное.Использование = (НЕ ИспользуетсяПериодРегистрации И ВключеноНачалоПериода);
	КонецПериодаСтандартное.Использование = (НЕ ИспользуетсяПериодРегистрации И ВключеноКонецПериода);
	
	НачалоПериодаСтандартное.Значение = НачалоПериода;
	КонецПериодаСтандартное.Значение = КонецПериода;
	
	НачалоПериодаРегистрации.Использование = (ИспользуетсяПериодРегистрации И ВключеноНачалоПериода);
	КонецПериодаРегистрации.Использование = (ИспользуетсяПериодРегистрации И ВключеноКонецПериода);
	
	НачалоПериодаРегистрации.Значение = НачалоПериода;
	КонецПериодаРегистрации.Значение = КонецПериода;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	//-- №13259 новая версия
		
КонецПроцедуры
