///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет изменить работу интерфейса при встраивании.
//
// Параметры:
//  НастройкиРаботыИнтерфейса - Структура - содержит свойство:
//   * ИспользоватьВнешнихПользователей - Булево - начальное значение Ложь,
//     если установить Истина, тогда даты запрета можно будет настраивать для внешних пользователей.
//
Процедура НастройкаИнтерфейса(НастройкиРаботыИнтерфейса) Экспорт
	
	
	
КонецПроцедуры

// Заполняет разделы дат запрета изменения, используемые при настройке дат запрета.
// Если не указать ни одного раздела, тогда будет доступна только настройка общей даты запрета.
//
// Параметры:
//  Разделы - ТаблицаЗначений - с колонками:
//   * Имя - Строка - имя, используемое в описании источников данных в
//       процедуре ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
//
//   * Идентификатор - УникальныйИдентификатор - идентификатор ссылки элемента плана видов характеристик.
//       Чтобы получить идентификатор, нужно в режиме 1С:Предприятие выполнить метод платформы:
//       "ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПолучитьСсылку().УникальныйИдентификатор()".
//       Не следует указывать идентификаторы, полученные любым другим способом,
//       так как это может нарушить их уникальность.
//
//   * Представление - Строка - представляет раздел в форме настройки дат запрета.
//
//   * ТипыОбъектов  - Массив - типы ссылок объектов, в разрезе которых можно настроить даты запрета,
//       например Тип("СправочникСсылка.Организации"); если не указано ни одного типа,
//       то даты запрета будут настраиваться только с точностью до раздела.
//
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	ДобавитьРаздел(Разделы, "АвансовыйОтчет", 					"87c5048f-ca48-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Авансовые отчеты'"));
	ДобавитьРаздел(Разделы, "АктСверкиВзаиморасчетов", 			"f04f1a8c-ca47-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Акт сверки расчетов с контрагентом'"));
	ДобавитьРаздел(Разделы, "ВводОстатков", 					"bbe0b262-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Ввод остатков'"));
	ДобавитьРаздел(Разделы, "ВнутреннееПеремещениеДенежныхСредств", "bbe0b259-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Внутреннее перемещение денежных средств'"));
	ДобавитьРаздел(Разделы, "ВозвратМатериаловИзЭксплуатации", 	"bbe0b25a-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Возврат материалов из эксплуатации'"));
	ДобавитьРаздел(Разделы, "ВозвратПродукции", 				"bbe0b25b-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Возврат уникальной продукции'"));
	ДобавитьРаздел(Разделы, "ВозвратТовараОтПокупателя", 		"bbe0b25c-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Возврат товаров от покупателя'"));
	ДобавитьРаздел(Разделы, "ВозвратТовараПоставщику", 			"bbe0b25d-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Возврат товара поставщику'"));
	ДобавитьРаздел(Разделы, "ВыплатаЗарплатыВНатуральнойФорме", "bbe0b25e-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Выплата зарплаты в натуральной форме'"));
	ДобавитьРаздел(Разделы, "ВыпускПродукции", 					"bbe0b25f-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Выпуск продукции'"));
	ДобавитьРаздел(Разделы, "ГрафикРаботыЗамерщиков", 			"bbe0b260-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'График работы замерщиков'"));
	ДобавитьРаздел(Разделы, "ГрафикРаботыМонтажныхБригад", 		"bbe0b261-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'График работы монтажных бригад'"));
	ДобавитьРаздел(Разделы, "Доверенность", 					"bbe0b263-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Доверенность'"));
	ДобавитьРаздел(Разделы, "ЗаказДоговор", 					"bbe0b264-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Заказ-договор'"));
	ДобавитьРаздел(Разделы, "ЗаказНаПроизводство", 				"c4cfe9e9-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Заказ на производство'"));
	ДобавитьРаздел(Разделы, "ЗаказПокупателя", 					"c4cfe9dc-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Заказ покупателя'"));
	ДобавитьРаздел(Разделы, "ЗаказПоставщику", 					"c4cfe9dd-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Заказ поставщику'"));
	ДобавитьРаздел(Разделы, "Замена", 							"c4cfe9de-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Замена'"));
	ДобавитьРаздел(Разделы, "ЗаявкаНаДоставку", 				"c4cfe9df-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Заявка на доставку'"));
	ДобавитьРаздел(Разделы, "ЗаявкаНаПеремещениеДенежныхСредств",  "c4cfe9e0-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Заявка на перемещение денежных средств'"));
	ДобавитьРаздел(Разделы, "ЗаявкаНаРасходованиеДенежныхСредств", "c4cfe9e1-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Заявка на расходование денежных средств'"));
	ДобавитьРаздел(Разделы, "Инвентаризация", 					"c4cfe9e2-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Инвентаризация'"));
	ДобавитьРаздел(Разделы, "КассоваяСмена", 					"c4cfe9e3-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Кассовая смена'"));
	ДобавитьРаздел(Разделы, "Комплектация", 					"c4cfe9e4-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Комплектация'"));
	ДобавитьРаздел(Разделы, "КорректировкаДолга", 				"c4cfe9e5-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Корректировка долга'"));
	ДобавитьРаздел(Разделы, "Лид", 								"c4cfe9e6-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Лид'"));
	ДобавитьРаздел(Разделы, "МинимальныеОстаткиНоменклатуры", 	"c4cfe9e7-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Установка минимальных остатков'"));
	ДобавитьРаздел(Разделы, "Монтаж", 							"c4cfe9e8-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Монтаж'"));
	ДобавитьРаздел(Разделы, "НастройкаАвтоматическихНачисленийБонусов", "c4cfe9ea-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Настройка автоматических начислений бонусов'"));
	ДобавитьРаздел(Разделы, "НастройкаКатегорийКонтрагентов", 	"c4cfe9eb-cc5d-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Настройка категорий контрагентов'"));
	ДобавитьРаздел(Разделы, "НастройкаКонтроляМатериаловВПроизводстве", "2650bf47-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Настройка контроля материалов в производстве'"));
	ДобавитьРаздел(Разделы, "НастройкиКонтроляПрайсЛистов", 	"2650bf39-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Настройки контроля прайс-листов'"));
	ДобавитьРаздел(Разделы, "НачислениеБонусовКонтрагентам", 	"2650bf3a-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Начисление и списание бонусов'"));
	ДобавитьРаздел(Разделы, "НачислениеЗарплаты", 				"2650bf3b-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Начисление зарплаты'"));
	ДобавитьРаздел(Разделы, "ОбзвонКлиентов", 					"2650bf3c-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Обзвон клиентов'"));
	ДобавитьРаздел(Разделы, "ОплатаБанковскойКартой", 			"2650bf3d-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Оплата банковской картой и кредитом'"));
	ДобавитьРаздел(Разделы, "ОприходованиеТоваров", 			"2650bf3e-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Оприходование товаров'"));
	ДобавитьРаздел(Разделы, "ОтправкаСМС", 						"2650bf3f-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Отправка СМС'"));
	ДобавитьРаздел(Разделы, "ПередачаМатериаловВЭксплуатацию", 	"2650bf40-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Передача материалов в эксплуатацию'"));
	ДобавитьРаздел(Разделы, "ПеремещениеТоваров", 				"2650bf41-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Перемещение товаров'"));
	ДобавитьРаздел(Разделы, "ПланированиеВходящихКонтактов", 	"2650bf42-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Планирование входящих контактов'"));
	ДобавитьРаздел(Разделы, "ПланированиеПродажМенеджеров", 	"2650bf43-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Планирование продаж менеджеров'"));
	ДобавитьРаздел(Разделы, "ПланированиеПродажПоТочкамПродаж", "2650bf44-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Планирование продаж по точкам продаж'"));
	ДобавитьРаздел(Разделы, "ПланированиеПродажТехнологовЗамера", "2650bf45-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Планирование продаж технологов замера'"));
	ДобавитьРаздел(Разделы, "ПлатежноеПоручениеИсходящее", 		"2650bf46-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Платежное поручение (исходящее)'"));
	ДобавитьРаздел(Разделы, "ПоступлениеНаРасчетныйСчет", 		"2650bf48-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Поступление на расчетный счет'"));
	ДобавитьРаздел(Разделы, "ПоступлениеТоваровИУслуг", 		"2650bf49-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Поступление товаров и услуг'"));
	ДобавитьРаздел(Разделы, "ПредварительныйРасчетЗаказДоговора", "f6608b78-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Предварительный расчет'"));
	ДобавитьРаздел(Разделы, "Премия", 							"f0573f7c-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Премия'"));
	ДобавитьРаздел(Разделы, "ПриходныйКассовыйОрдер", 			"f0573f7d-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Приходный кассовый ордер'"));
	ДобавитьРаздел(Разделы, "Разукомплектация", 				"f0573f7e-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Разукомплектация'"));
	ДобавитьРаздел(Разделы, "РасходныйКассовыйОрдер", 			"f0573f7f-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Расходный кассовый ордер'"));
	ДобавитьРаздел(Разделы, "РеализацияТоваровИУслуг", 			"f0573f80-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Реализация товаров и услуг'"));
	ДобавитьРаздел(Разделы, "Резервирование", 					"f0573f81-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Резервирование'"));
	ДобавитьРаздел(Разделы, "СнятиеРезервов", 					"f0573f82-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Снятие резервов'"));
	ДобавитьРаздел(Разделы, "СоглашениеОРасторженииДоговора", 	"f0573f83-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Соглашение о расторжении договора'"));
	ДобавитьРаздел(Разделы, "СоставПроизводственнойСмены", 		"f0573f84-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Состав производственной смены'"));
	ДобавитьРаздел(Разделы, "СписаниеСРасчетногоСчета", 		"f0573f85-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Списание с расчетного счета'"));
	ДобавитьРаздел(Разделы, "СписаниеТоваров", 					"f0573f86-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Списание товаров'"));
	ДобавитьРаздел(Разделы, "СчетНаОплату", 					"f0573f87-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Счет на оплату'"));
	ДобавитьРаздел(Разделы, "СчетФактураВыданный", 				"f0573f88-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Счет-фактура выданный'"));
	ДобавитьРаздел(Разделы, "УстановкаАвтоматическихСкидок", 	"f0573f89-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Установка автоматических скидок'"));
	ДобавитьРаздел(Разделы, "УстановкаИндивидуальныхЦенМатериалов", 			"f0573f8b-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Установка индивидуальных цен на продукцию'"));
	ДобавитьРаздел(Разделы, "УстановкаИндивидуальныхЦенНаУслугиПроизводства", 	"f0573f8c-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Установка индивидуальных цен на услуги производства'"));
	ДобавитьРаздел(Разделы, "УстановкаИндивидуальныхЦенНоменклатуры", 			"f0573f8d-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Установка индивидуальных цен номенклатуры'"));
	ДобавитьРаздел(Разделы, "УстановкаМинимальнойСтоимостиПродукции", 			"f0573f8e-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Установка минимальной стоимости продукции'"));
	ДобавитьРаздел(Разделы, "УстановкаСтоимостиВыработкиПоНоменклатуре", 		"f6608b74-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Установка стоимости выработки'"));
	ДобавитьРаздел(Разделы, "УстановкаЦенМатериалов", 			"f6608b75-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Установка цен на продукцию'"));
	ДобавитьРаздел(Разделы, "УстановкаЦенМатериаловПоставщиков", "f6608b76-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Установка цен на продукцию поставщиков'"));
	ДобавитьРаздел(Разделы, "УстановкаЦенНоменклатуры", 		"f6608b77-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Установка цен на номенклатуру'"));
	ДобавитьРаздел(Разделы, "УстановкаЦенПоставщика", 			"f6608b79-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Установка цен на номенклатуру поставщиков'"));
	ДобавитьРаздел(Разделы, "ЧекККМ", 							"f6608b7a-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Чек ККМ'"));
	ДобавитьРаздел(Разделы, "Штраф", 							"f6608b7b-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Штраф'"));
	ДобавитьРаздел(Разделы, "ЭлектронноеПисьмо", 				"f6608b7c-cc5f-11ed-80d9-04d9f5cee27d", НСтр("ru = 'Электронное письмо'"));

КонецПроцедуры

// Позволяет задать таблицы и поля объектов для проверки запрета изменения данных.
// Для добавления нового источника в ИсточникиДанных см. ДатыЗапретаИзменения.ДобавитьСтроку.
//
// Вызывается из процедуры ИзменениеЗапрещено общего модуля ДатыЗапретаИзменения,
// используемой в подписке на событие ПередЗаписью объекта для проверки наличия
// запретов и отказа от изменений запрещенного объекта.
//
// Параметры:
//  ИсточникиДанных - ТаблицаЗначений - с колонками:
//   * Таблица     - Строка - полное имя объекта метаданных,
//                   например Метаданные.Документы.ПриходнаяНакладная.ПолноеИмя().
//   * ПолеДаты    - Строка - имя реквизита объекта или табличной части,
//                   например: "Дата", "Товары.ДатаОтгрузки".
//   * Раздел      - Строка - имя раздела дат запрета, указанного в
//                   процедуре ПриЗаполненииРазделовДатЗапретаИзменения (см. выше).
//   * ПолеОбъекта - Строка - имя реквизита объекта или реквизита табличной части,
//                   например: "Организация", "Товары.Склад".
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
		
	//Планы видов характеристик.РазделыДатЗапретаИзменения - добавить / удалить предопределенный элемент
	
	//ПО ОБЪЕКТАМ	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.АвансовыйОтчет.ПолноеИмя(), "Дата", "АвансовыйОтчет", );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.АктСверкиВзаиморасчетов.ПолноеИмя(), "Дата", "АктСверкиВзаиморасчетов" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВводОстатков.ПолноеИмя(), "Дата", "ВводОстатков" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВнутреннееПеремещениеДенежныхСредств.ПолноеИмя(), "Дата", "ВнутреннееПеремещениеДенежныхСредств" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВозвратМатериаловИзЭксплуатации.ПолноеИмя(), "Дата", "ВозвратМатериаловИзЭксплуатации" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВозвратПродукции.ПолноеИмя(), "Дата", "ВозвратПродукции" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВозвратТовараОтПокупателя.ПолноеИмя(), "Дата", "ВозвратТовараОтПокупателя" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВозвратТовараПоставщику.ПолноеИмя(), "Дата", "ВозвратТовараПоставщику" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВыплатаЗарплатыВНатуральнойФорме.ПолноеИмя(), "Дата", "ВыплатаЗарплатыВНатуральнойФорме" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВыпускПродукции.ПолноеИмя(), "Дата", "ВыпускПродукции" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ГрафикРаботыЗамерщиков.ПолноеИмя(), "Дата", "ГрафикРаботыЗамерщиков" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ГрафикРаботыМонтажныхБригад.ПолноеИмя(), "Дата", "ГрафикРаботыМонтажныхБригад" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Доверенность.ПолноеИмя(), "Дата", "Доверенность" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаказДоговор.ПолноеИмя(), "Дата", "ЗаказДоговор" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаказНаПроизводство.ПолноеИмя(), "Дата", "ЗаказНаПроизводство" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаказПокупателя.ПолноеИмя(), "Дата", "ЗаказПокупателя" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаказПоставщику.ПолноеИмя(), "Дата", "ЗаказПоставщику" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Замена.ПолноеИмя(), "Дата", "Замена" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаявкаНаДоставку.ПолноеИмя(), "Дата", "ЗаявкаНаДоставку" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаявкаНаПеремещениеДенежныхСредств.ПолноеИмя(), "Дата", "ЗаявкаНаПеремещениеДенежныхСредств" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя(), "Дата", "ЗаявкаНаРасходованиеДенежныхСредств" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Инвентаризация.ПолноеИмя(), "Дата", "Инвентаризация" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.КассоваяСмена.ПолноеИмя(), "Дата", "КассоваяСмена", );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Комплектация.ПолноеИмя(), "Дата", "Комплектация" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.КорректировкаДолга.ПолноеИмя(), "Дата", "КорректировкаДолга" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Лид.ПолноеИмя(), "Дата", "Лид" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.МинимальныеОстаткиНоменклатуры.ПолноеИмя(), "Дата", "МинимальныеОстаткиНоменклатуры" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Монтаж.ПолноеИмя(), "Дата", "Монтаж" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.НастройкаАвтоматическихНачисленийБонусов.ПолноеИмя(), "Дата", "НастройкаАвтоматическихНачисленийБонусов" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.НастройкаКатегорийКонтрагентов.ПолноеИмя(), "Дата", "НастройкаКатегорийКонтрагентов" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.НастройкаКонтроляМатериаловВПроизводстве.ПолноеИмя(), "Дата", "НастройкаКонтроляМатериаловВПроизводстве" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.НастройкиКонтроляПрайсЛистов.ПолноеИмя(), "Дата", "НастройкиКонтроляПрайсЛистов" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.НастройкаАвтоматическихНачисленийБонусов.ПолноеИмя(), "Дата", "НастройкаАвтоматическихНачисленийБонусов" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.НачислениеБонусовКонтрагентам.ПолноеИмя(), "Дата", "НачислениеБонусовКонтрагентам" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.НачислениеЗарплаты.ПолноеИмя(), "Дата", "НачислениеЗарплаты" , );
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УДАЛИТЬ_Невыходы.ПолноеИмя(), "Дата", "Невыходы" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ОбзвонКлиентов.ПолноеИмя(), "Дата", "ОбзвонКлиентов" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ОплатаБанковскойКартой.ПолноеИмя(), "Дата", "ОплатаБанковскойКартой" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ОприходованиеТоваров.ПолноеИмя(), "Дата", "ОприходованиеТоваров" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ОтправкаСМС.ПолноеИмя(), "Дата", "ОтправкаСМС", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПередачаМатериаловВЭксплуатацию.ПолноеИмя(), "Дата", "ПередачаМатериаловВЭксплуатацию" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПеремещениеТоваров.ПолноеИмя(), "Дата", "ПеремещениеТоваров" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПланированиеВходящихКонтактов.ПолноеИмя(), "Дата", "ПланированиеВходящихКонтактов" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПланированиеПродажМенеджеров.ПолноеИмя(), "Дата", "ПланированиеПродажМенеджеров" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПланированиеПродажПоТочкамПродаж.ПолноеИмя(), "Дата", "ПланированиеПродажПоТочкамПродаж" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПланированиеПродажТехнологовЗамера.ПолноеИмя(), "Дата", "ПланированиеПродажТехнологовЗамера" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПлатежноеПоручениеИсходящее.ПолноеИмя(), "Дата", "ПлатежноеПоручениеИсходящее" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПоступлениеНаРасчетныйСчет.ПолноеИмя(), "Дата", "ПоступлениеНаРасчетныйСчет" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПоступлениеТоваровИУслуг.ПолноеИмя(), "Дата", "ПоступлениеТоваровИУслуг" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПредварительныйРасчетЗаказДоговора.ПолноеИмя(), "Дата", "ПредварительныйРасчетЗаказДоговора" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Премия.ПолноеИмя(), "Дата", "Премия" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПриходныйКассовыйОрдер.ПолноеИмя(), "Дата", "ПриходныйКассовыйОрдер" , );	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Разукомплектация.ПолноеИмя(), "Дата", "Разукомплектация" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.РасходныйКассовыйОрдер.ПолноеИмя(), "Дата", "РасходныйКассовыйОрдер" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.РеализацияТоваровИУслуг.ПолноеИмя(), "Дата", "РеализацияТоваровИУслуг" , );
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УДАЛИТЬ_СервисныеЗаявки.ПолноеИмя(), "Дата", "УДАЛИТЬ_СервисныеЗаявки" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Резервирование.ПолноеИмя(), "Дата", "Резервирование" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СнятиеРезервов.ПолноеИмя(), "Дата", "СнятиеРезервов" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СоглашениеОРасторженииДоговора.ПолноеИмя(), "Дата", "СоглашениеОРасторженииДоговора" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СоставПроизводственнойСмены.ПолноеИмя(), "Дата", "СоставПроизводственнойСмены" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СписаниеСРасчетногоСчета.ПолноеИмя(), "Дата", "СписаниеСРасчетногоСчета" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СписаниеТоваров.ПолноеИмя(), "Дата", "СписаниеТоваров" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СчетНаОплату.ПолноеИмя(), "Дата", "СчетНаОплату" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СчетФактураВыданный.ПолноеИмя(), "Дата", "СчетФактураВыданный" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаАвтоматическихСкидок.ПолноеИмя(), "Дата", "УстановкаАвтоматическихСкидок" , );
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УДАЛИТЬ_УстановкаИндивидуальныхЦен.ПолноеИмя(), "Дата", "УстановкаИндивидуальныхЦен" , );	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаИндивидуальныхЦенНоменклатуры.ПолноеИмя(), "Дата", "УстановкаИндивидуальныхЦенНоменклатуры", );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаИндивидуальныхЦенМатериалов.ПолноеИмя(), "Дата", "УстановкаИндивидуальныхЦенМатериалов", );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаИндивидуальныхЦенНаУслугиПроизводства.ПолноеИмя(), "Дата", "УстановкаИндивидуальныхЦенНаУслугиПроизводства", );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаМинимальнойСтоимостиПродукции.ПолноеИмя(), "Дата", "УстановкаМинимальнойСтоимостиПродукции" , );
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УДАЛИТЬ_УстановкаПроцентаВыработкиПроизводства.ПолноеИмя(), "Дата", "УДАЛИТЬ_УстановкаПроцентаВыработкиПроизводства" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ПолноеИмя(), "Дата", "УстановкаСтоимостиВыработкиПоНоменклатуре" , );
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УДАЛИТЬ_УстановкаСтоимостиВыработкиПроизводства.ПолноеИмя(), "Дата", "УДАЛИТЬ_УстановкаСтоимостиВыработкиПроизводства" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаЦенМатериалов.ПолноеИмя(), "Дата", "УстановкаЦенМатериалов" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаЦенМатериаловПоставщиков.ПолноеИмя(), "Дата", "УстановкаЦенМатериаловПоставщиков" , );	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаЦенНоменклатуры.ПолноеИмя(), "Дата", "УстановкаЦенНоменклатуры" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаЦенПоставщика.ПолноеИмя(), "Дата", "УстановкаЦенПоставщика" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЧекККМ.ПолноеИмя(), "Дата", "ЧекККМ" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Штраф.ПолноеИмя(), "Дата", "Штраф" , );	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЭлектронноеПисьмо.ПолноеИмя(), "Дата", "ЭлектронноеПисьмо" , );
	
	//ПО РАЗДЕЛАМ
	//ОптовыеПродажи
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.РеализацияТоваровИУслуг.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СчетФактураВыданный.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВозвратПродукции.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВозвратТовараОтПокупателя.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаказПокупателя.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаявкаНаДоставку.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.НачислениеБонусовКонтрагентам.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СчетНаОплату.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаЦенНоменклатуры.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаИндивидуальныхЦенНоменклатуры.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаИндивидуальныхЦенМатериалов.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаИндивидуальныхЦенНаУслугиПроизводства.ПолноеИмя(), "Дата", "ОптовыеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Резервирование.ПолноеИмя(), "Дата", "ОптовыеПродажи" , "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СнятиеРезервов.ПолноеИмя(), "Дата", "ОптовыеПродажи" , "");
	//
	////Склад
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.АвансовыйОтчет.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Доверенность.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаказПоставщику.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Инвентаризация.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.МинимальныеОстаткиНоменклатуры.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ОприходованиеТоваров.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПеремещениеТоваров.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПоступлениеТоваровИУслуг.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Комплектация.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Разукомплектация.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СписаниеТоваров.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаЦенПоставщика.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВозвратТовараПоставщику.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаЦенМатериаловПоставщиков.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВозвратМатериаловИзЭксплуатации.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПередачаМатериаловВЭксплуатацию.ПолноеИмя(), "Дата", "Склад", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Резервирование.ПолноеИмя(), "Дата", "Склад" , "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СнятиеРезервов.ПолноеИмя(), "Дата", "Склад" , "");
	//
	////Финансы
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВнутреннееПеремещениеДенежныхСредств.ПолноеИмя(), "Дата", "Финансы", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.КорректировкаДолга.ПолноеИмя(), "Дата", "Финансы", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ОплатаБанковскойКартой.ПолноеИмя(), "Дата", "Финансы", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПоступлениеНаРасчетныйСчет.ПолноеИмя(), "Дата", "Финансы", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПриходныйКассовыйОрдер.ПолноеИмя(), "Дата", "Финансы", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.РасходныйКассовыйОрдер.ПолноеИмя(), "Дата", "Финансы", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПлатежноеПоручениеИсходящее.ПолноеИмя(), "Дата", "Финансы" , "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СписаниеСРасчетногоСчета.ПолноеИмя(), "Дата", "Финансы", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.КассоваяСмена.ПолноеИмя(), "Дата", "Финансы", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.АктСверкиВзаиморасчетов.ПолноеИмя(), "Дата", "Финансы", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаявкаНаПеремещениеДенежныхСредств.ПолноеИмя(), "Дата", "Финансы", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя(), "Дата", "Финансы", "");
	//	
	////Производство
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВыпускПродукции.ПолноеИмя(), "Дата", "Производство", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаказНаПроизводство.ПолноеИмя(), "Дата", "Производство", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СоставПроизводственнойСмены.ПолноеИмя(), "Дата", "Производство", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УДАЛИТЬ_УстановкаСтоимостиВыработкиПроизводства.ПолноеИмя(), "Дата", "Производство", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаЦенМатериалов.ПолноеИмя(), "Дата", "Производство", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаПроцентаВыработкиПроизводства.ПолноеИмя(), "Дата", "Производство", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Резервирование.ПолноеИмя(), "Дата", "Производство" , "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СнятиеРезервов.ПолноеИмя(), "Дата", "Производство" , "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаМинимальнойСтоимостиПродукции.ПолноеИмя(), "Дата", "Производство" , "");
	//
	////РозничныеПродажи
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВходящийКонтакт.ПолноеИмя(), "Дата", "РозничныеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗаказДоговор.ПолноеИмя(), "Дата", "РозничныеПродажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаАвтоматическихСкидок.ПолноеИмя(), "Дата", "РозничныеПродажи", "");	
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СоглашениеОРасторженииДоговора.ПолноеИмя(), "Дата", "СоглашениеОРасторженииДоговора" , );
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЧекККМ.ПолноеИмя(), "Дата", "ЧекККМ" , );
	//
	////Лиды
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Замер.ПолноеИмя(), "Дата", "Лиды", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИсходящийКонтакт.ПолноеИмя(), "ПланируемаяДата", "Лиды", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ОбзвонКлиентов.ПолноеИмя(), "Дата", "Лиды", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПланированиеВходящихКонтактов.ПолноеИмя(), "Дата", "Лиды", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПланированиеПродажМенеджеров.ПолноеИмя(), "Дата", "Лиды", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПланированиеПродажПоТочкамПродаж.ПолноеИмя(), "Дата", "Лиды", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПланированиеПродажТехнологовЗамера.ПолноеИмя(), "Дата", "Лиды", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Лид.ПолноеИмя(), "Дата", "Лиды", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УДАЛИТЬ_Невыходы.ПолноеИмя(), "Дата", "Лиды", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ГрафикРаботыЗамерщиков.ПолноеИмя(), "Дата", "Лиды", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПредварительныйРасчетЗаказДоговора.ПолноеИмя(), "Дата", "Лиды", "");
	//
	////Монтажи
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Монтаж.ПолноеИмя(), "Дата", "Монтажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Замена.ПолноеИмя(), "Дата", "Монтажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УДАЛИТЬ_СервисныеЗаявки.ПолноеИмя(), "Дата", "Монтажи", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ГрафикРаботыМонтажныхБригад.ПолноеИмя(), "Дата", "Монтажи", "");

	////Зарплата
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.НачислениеЗарплаты.ПолноеИмя(), "Дата", "Зарплата", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УстановкаСтоимостиВыработкиПоНоменклатуре.ПолноеИмя(), "Дата", "Зарплата", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УДАЛИТЬ_УстановкаСтоимостиВыработкиРозницы.ПолноеИмя(), "Дата", "Зарплата", ""); 	
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.УДАЛИТЬ_УстановкаПроцентаВыработкиРозницы.ПолноеИмя(), "Дата", "Зарплата", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Штраф.ПолноеИмя(), "Дата", "Зарплата", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Премия.ПолноеИмя(), "Дата", "Зарплата", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВыплатаЗарплатыВНатуральнойФорме.ПолноеИмя(), "Дата", "Зарплата", "");

	////Маркетинг
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ОтправкаСМС.ПолноеИмя(), "Дата", "Маркетинг", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЭлектронноеПисьмо.ПолноеИмя(), "Дата", "Маркетинг", "");
	//
	////Для тех, кто использует интеграцию с КСУ (эти виды объектов есть не у всех клиентов, поэтому они в обертке)
	//Попытка
	//	// Инсайт КСУ
	//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИА_Статистика.ПолноеИмя(), "Дата", "Маркетинг", "");
	//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИА_ФинансовоеПланирование.ПолноеИмя(), "Дата", "Маркетинг", "");
	//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИА_ПротоколРС.ПолноеИмя(), "Дата", "Маркетинг", "");
	//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИА_ЗаказНаПриобретение.ПолноеИмя(), "Дата", "Маркетинг", "");
	//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИА_ЗакрытиеЗаказаНаПриобретение.ПолноеИмя(), "Дата", "Маркетинг", "");
	//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИА_УстановкаКвотыСтатистик.ПолноеИмя(), "Дата", "Маркетинг", "");
	//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИА_УстановкаБаллов.ПолноеИмя(), "Дата", "Маркетинг", "");
	//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИА_УстановкаКоэффициентовСостояний.ПолноеИмя(), "Дата", "Маркетинг", "");
	//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИА_НачислениеЗарплаты.ПолноеИмя(), "Дата", "Маркетинг", "");
	//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИА_ЗаявкаНаОбязательства.ПолноеИмя(), "Дата", "Маркетинг", "");
	//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИА_ФП_Настройка.ПолноеИмя(), "Дата", "Маркетинг", "");
	//Исключение
	//КонецПопытки
	
КонецПроцедуры

// Позволяет переопределить выполнение проверки запрета изменения произвольным образом.
//
// Если проверка выполняется в процессе записи документа, то в свойстве ДополнительныеСвойства документа Объект
// имеется свойство РежимЗаписи.
//  
// Параметры:
//  Объект       - СправочникОбъект,
//                 ДокументОбъект,
//                 ПланВидовХарактеристикОбъект,
//                 ПланСчетовОбъект,
//                 ПланВидовРасчетаОбъект,
//                 БизнесПроцессОбъект,
//                 ЗадачаОбъект,
//                 ПланОбменаОбъект, 
//                 РегистрСведенийНаборЗаписей,
//                 РегистрНакопленияНаборЗаписей,
//                 РегистрБухгалтерииНаборЗаписей,
//                 РегистрРасчетаНаборЗаписей - проверяемый элемент данных или набор записей 
//                 (который передается из обработчиков ПередЗаписью и ПриЧтенииНаСервере).
//
//  ПроверкаЗапретаИзменения    - Булево - установить в Ложь, чтобы пропустить проверку запрета изменения данных.
//  УзелПроверкиЗапретаЗагрузки - ПланыОбменаСсылка, Неопределено - установить в Неопределено, чтобы 
//                                пропустить проверку запрета загрузки данных.
//  ВерсияОбъекта               - Строка - установить "СтараяВерсия" или "НоваяВерсия", чтобы
//                                выполнить проверку только старой (в базе данных) 
//                                или только новой версии объекта (в параметре Объект).
//                                По умолчанию содержит значение "" - проверяются обе версии объекта сразу.
//
Процедура ПередПроверкойЗапретаИзменения(Объект,
                                         ПроверкаЗапретаИзменения,
                                         УзелПроверкиЗапретаЗагрузки,
                                         ВерсияОбъекта) Экспорт
	
	//++ Потолки									 
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.УДАЛИТЬ_НастройкаНачисленийБонусовПоПродажам") 
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.УДАЛИТЬ_Невыходы")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.УДАЛИТЬ_СервисныеЗаявки")	
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.УДАЛИТЬ_УстановкаСтоимостиВыработкиПроизводства")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.УДАЛИТЬ_УстановкаИндивидуальныхЦен")
		Тогда
		ПроверкаЗапретаИзменения = Ложь;
	КонецЕсли;
	//-- Потолки
	
КонецПроцедуры

Процедура ДобавитьРаздел(Разделы, Имя, ИдентификаторСтрокой, Представление)
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = Имя;
	Раздел.Идентификатор = Новый УникальныйИдентификатор(ИдентификаторСтрокой);
	Раздел.Представление = Представление;

КонецПроцедуры

#КонецОбласти
