
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект = Параметры.Объект;
	
	ИсторияЗамеров.Очистить();
	Для Каждого ТекущийЗамер Из Объект.Замеры Цикл
		НоваяСтрока = ИсторияЗамеров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийЗамер);
		НоваяСтрока.Назначил = ТекущийЗамер.НазначилЗамер; //#5147
	КонецЦикла;
	
	//++ №9853
	Для Каждого ТекущийЗамер Из Объект.Выезды Цикл
		
		НоваяСтрока = ИсторияЗамеров.Добавить();
		НоваяСтрока.ДатаЗамера 				= ТекущийЗамер.Дата;
		НоваяСтрока.ВремяНачалаЗамера 		= ТекущийЗамер.ВремяНачала;
		НоваяСтрока.ВремяОкончанияЗамера 	= ТекущийЗамер.ВремяОкончания;
		НоваяСтрока.ИсполнительЗамера 		= ТекущийЗамер.Исполнитель;
		НоваяСтрока.ЗамерВыполнен 			= ТекущийЗамер.Выполнен;
		НоваяСтрока.Назначил 				= ТекущийЗамер.Назначил; //#5147
		
		НоваяСтрока.ЭтоВыезд = Истина;
		
	КонецЦикла;
	
	ИсторияЗамеров.Сортировать("ДатаЗамера, ВремяНачалаЗамера, ЭтоВыезд");
	//-- №9853
	
КонецПроцедуры
