#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиОформления = Параметры.НастройкиОформления;
	
	Элементы.ФормаГруппаУстановитьЦветМонтажи.Видимость = Ложь;
	Элементы.ФормаГруппаУстановитьЦветЗамеры.Видимость = Ложь;
	
	Если Параметры.Свойство("Заказы") Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗаказы;
		ПоЗаказам = Истина;
		
		ВремяПодсветкиЗнППоДатеОжидаемойОтгрузки = Параметры.ВремяПодсветкиЗнППоДатеОжидаемойОтгрузки;
		ВремяПодсветкиЗППоДатеОжидаемойОтгрузки  = Параметры.ВремяПодсветкиЗППоДатеОжидаемойОтгрузки;
		
		// НастройкиОформления - структура, каждый элемент которой массив структур
		
		Для каждого НастройкаДокумента из НастройкиОформления Цикл
			
			ЗаголовокГруппы = "";
			Если НастройкаДокумента.Ключ = "ЗП" Тогда
				ЗаголовокГруппы = "Заказы покупателей";
			ИначеЕсли НастройкаДокумента.Ключ = "ЗНП" Тогда
				ЗаголовокГруппы = "Заказы на производство";		 
			КонецЕсли;
			
			Для каждого НастройкаЦвета из НастройкаДокумента.Значение Цикл
				//НастройкаЦвета = Структура("Настройка, Цвет, Подсказка, Использовать"
				ВидимостьГруппы = Истина;
				
				// скроем элементы, которые не используется 
				Если НастройкаДокумента.Ключ = "ЗП" Тогда
					ИспользоватьСтатусНовыйВЗаказеПокупателя = Справочники.СтатусыЗаказовПокупателей.Новый.Использовать;
					//Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСтатусНовыйВЗаказеПокупателя") И НастройкаЦвета.Настройка = "Новый" Тогда
					Если НЕ ИспользоватьСтатусНовыйВЗаказеПокупателя И НастройкаЦвета.Настройка = "Новый" Тогда
						ВидимостьГруппы = Ложь;
					ИначеЕсли НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСтатусЗакрытВЗаказеПокупателя") И НастройкаЦвета.Настройка = "Закрыт" Тогда
						ВидимостьГруппы = Ложь;
					КонецЕсли;
				КонецЕсли;
				
				ИмяНастройки = НастройкаДокумента.Ключ + НастройкаЦвета.Настройка;
				ИмяГруппыНастройки = "Группа" + ИмяНастройки;
				Элементы[ИмяГруппыНастройки].Видимость = ВидимостьГруппы;
				
				ИмяДекорацииЦвет = "ДекорацияЦвет" + ИмяНастройки;
				Элементы[ИмяДекорацииЦвет].ЦветФона = НастройкаЦвета.Цвет;
				Элементы[ИмяДекорацииЦвет].ЦветТекста = НастройкаЦвета.Цвет;
				
				// галочка Использовать
				ИмяГалкаИспользовать = "Использовать" + ИмяНастройки;
				ЭтаФорма[ИмяГалкаИспользовать] = НастройкаЦвета.Использовать;
				
			КонецЦикла;
		КонецЦикла;
		
	//#6985
	ИначеЕсли Параметры.Свойство("ГрафикМонтажей") Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаГрафикМонтажей;
		ПоГрафикуМонтажей = Истина;
		
		Элементы.ФормаГруппаУстановитьЦветМонтажи.Видимость = Истина;
		
		// НастройкиОформления - структура, каждый элемент которой массив структур
		
		Для каждого НастройкаЦвета из НастройкиОформления.ГМ Цикл
			
			ИмяНастройки = НастройкаЦвета.Настройка;
			
			ИмяДекорацииЦвет = "ГМДекорацияЦвет" + ИмяНастройки;
			Элементы[ИмяДекорацииЦвет].ЦветФона = НастройкаЦвета.Цвет;
			Элементы[ИмяДекорацииЦвет].ЦветТекста = НастройкаЦвета.Цвет;
			
			// кнопки установки цвета по умолчанию
			ИмяКоманды = "УстановитьЦвет" + ИмяНастройки;
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие   = "Добавленный_УстановитьЦветПоУмолчаниюМонтажа";
			НоваяКоманда.Заголовок  = НастройкаЦвета.Подсказка;	
			НовыйЭлемент = Элементы.Добавить("Форма" + ИмяКоманды, Тип("КнопкаФормы"), Элементы.ФормаГруппаУстановитьЦветЭлементаМонтажи);
			НовыйЭлемент.ИмяКоманды = ИмяКоманды;
		КонецЦикла;
		
	//#11453
	ИначеЕсли Параметры.Свойство("ГрафикЗамеров") Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаГрафикЗамеров;
		ПоГрафикуЗамеров = Истина;
		
		Элементы.ФормаГруппаУстановитьЦветЗамеры.Видимость = Истина;
		
		// НастройкиОформления - структура, каждый элемент которой массив структур
		
		Для каждого НастройкаЦвета из НастройкиОформления.ГЗ Цикл
			
			ИмяНастройки = НастройкаЦвета.Настройка;
			
			ИмяДекорацииЦвет = "ГЗДекорацияЦвет" + ИмяНастройки;
			Элементы[ИмяДекорацииЦвет].ЦветФона = НастройкаЦвета.Цвет;
			Элементы[ИмяДекорацииЦвет].ЦветТекста = НастройкаЦвета.Цвет;			
			
			// кнопки установки цвета по умолчанию
			ИмяКоманды = "УстановитьЦвет" + ИмяНастройки;
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие   = "Добавленный_УстановитьЦветПоУмолчаниюЗамера";
			НоваяКоманда.Заголовок  = НастройкаЦвета.Подсказка;	
			НовыйЭлемент = Элементы.Добавить("Форма" + ИмяКоманды, Тип("КнопкаФормы"), Элементы.ФормаГруппаУстановитьЦветЭлементаЗамеры);
			НовыйЭлемент.ИмяКоманды = ИмяКоманды;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОк(Команда)
	
	Если ПоЗаказам Тогда
		Результат = Новый Структура;	
		РезультатПоДокументуЗП = Новый Массив;				
		РезультатПоДокументуЗНП = Новый Массив;
		Для каждого ЭлементФормы из Элементы Цикл				
			Если ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы") 
				И Лев(ЭлементФормы.Имя, 13) = "ДекорацияЦвет" 
				И СтрНайти(ЭлементФормы.Имя, "РасширеннаяПодсказка") = 0 Тогда
				
				КлючДокумента = Сред(ЭлементФормы.Имя, 14, 2);
				Если НЕ КлючДокумента = "ЗН" И НЕ КлючДокумента = "ЗП" Тогда
					Продолжить;
				КонецЕсли;
				Если КлючДокумента = "ЗН" Тогда
					КлючДокумента = "ЗНП";
				КонецЕсли;
				
				ИмяНастройки = Сред(ЭлементФормы.Имя, 14);						
				ЭлементДекорацияНадпись = Элементы["ДекорацияНадпись" + ИмяНастройки];
				ИмяГалкаИспользовать = "Использовать" + ИмяНастройки;
				ИмяНастройки = СтрЗаменить(ИмяНастройки, КлючДокумента, "");
				
				Если КлючДокумента = "ЗП" Тогда
					РезультатПоДокументуЗП.Добавить(Новый Структура("Настройка, Цвет, Подсказка, Использовать", ИмяНастройки, ЭлементФормы.ЦветФона, ЭлементДекорацияНадпись.Заголовок, ЭтаФорма[ИмяГалкаИспользовать]));
				ИначеЕсли КлючДокумента = "ЗНП" Тогда
					РезультатПоДокументуЗНП.Добавить(Новый Структура("Настройка, Цвет, Подсказка, Использовать", ИмяНастройки, ЭлементФормы.ЦветФона, ЭлементДекорацияНадпись.Заголовок, ЭтаФорма[ИмяГалкаИспользовать]));
				КонецЕсли;	
				
			КонецЕсли;
		КонецЦикла;
		
		Результат.Вставить("ЗП",  РезультатПоДокументуЗП);
		Результат.Вставить("ЗНП", РезультатПоДокументуЗНП);
		
		СтруктураВозврата = Новый Структура("НастройкиОформления, ВремяПодсветкиЗнППоДатеОжидаемойОтгрузки, ВремяПодсветкиЗППоДатеОжидаемойОтгрузки", Результат, ВремяПодсветкиЗНППоДатеОжидаемойОтгрузки, ВремяПодсветкиЗППоДатеОжидаемойОтгрузки);
		Закрыть(СтруктураВозврата);
		
	//#6985
	ИначеЕсли ПоГрафикуМонтажей Тогда
		Результат = Новый Массив;	
		Для каждого ЭлементФормы из Элементы Цикл				
			Если ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы") 
				И Лев(ЭлементФормы.Имя, 15) = "ГМДекорацияЦвет" 
				И СтрНайти(ЭлементФормы.Имя, "РасширеннаяПодсказка") = 0 Тогда
								
				ИмяНастройки = Сред(ЭлементФормы.Имя, 16);						
				ЭлементДекорацияНадпись = Элементы["ГМДекорацияНадпись" + ИмяНастройки];
				ИмяНастройки = СтрЗаменить(ИмяНастройки, КлючДокумента, "");
				
				Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", ИмяНастройки, ЭлементФормы.ЦветФона, ЭлементДекорацияНадпись.Заголовок));				
			КонецЕсли;
		КонецЦикла;
		
		СтруктураВозврата = Новый Структура("ГМ", Результат);		
		Закрыть(СтруктураВозврата);
		
	//#11453
	ИначеЕсли ПоГрафикуЗамеров Тогда
		Результат = Новый Массив;	
		Для каждого ЭлементФормы из Элементы Цикл				
			Если ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы") 
				И Лев(ЭлементФормы.Имя, 15) = "ГЗДекорацияЦвет" 
				И СтрНайти(ЭлементФормы.Имя, "РасширеннаяПодсказка") = 0 Тогда
								
				ИмяНастройки = Сред(ЭлементФормы.Имя, 16);						
				ЭлементДекорацияНадпись = Элементы["ГЗДекорацияНадпись" + ИмяНастройки];
				ИмяНастройки = СтрЗаменить(ИмяНастройки, КлючДокумента, "");
				
				Результат.Добавить(Новый Структура("Настройка, Цвет, Подсказка", ИмяНастройки, ЭлементФормы.ЦветФона, ЭлементДекорацияНадпись.Заголовок));				
			КонецЕсли;
		КонецЦикла;
		
		СтруктураВозврата = Новый Структура("ГЗ", Результат);		
		Закрыть(СтруктураВозврата);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Добавленный_ДекорацияНажатие(Элемент)

	ИмяЭлемента = СтрЗаменить(Элемент.Имя, "ДекорацияНадпись", "ДекорацияЦвет");
	
	ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
	ДиалогВыбораЦвета.Цвет = Элементы[ИмяЭлемента].ЦветФона;
	
	Оповещение = Новый ОписаниеОповещения("ВыборЦветаЗавершение", ЭтотОбъект, ИмяЭлемента);
	ДиалогВыбораЦвета.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЦветаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда	
		Элементы[ДополнительныеПараметры].ЦветФона = Результат;
		Элементы[ДополнительныеПараметры].ЦветТекста = Результат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиМонтажи

&НаКлиенте
Процедура УстановитьЦветПоУмолчаниюДляВсехМонтажей(Команда)
	
	НастройкиОформления = ПолучитьНастройкиОформленияГрафикаМонтажей();
	Для каждого ЭлементМассива из НастройкиОформления.ГМ Цикл
		ИмяЭлементаСоЦветом = "ГМДекорацияЦвет" + ЭлементМассива.Настройка;
		Элементы[ИмяЭлементаСоЦветом].ЦветФона = ЭлементМассива.Цвет;
		Элементы[ИмяЭлементаСоЦветом].ЦветТекста = ЭлементМассива.Цвет;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Добавленный_УстановитьЦветПоУмолчаниюМонтажа(Элемент)
	
	ИмяНастройки = СтрЗаменить(Элемент.Имя, "УстановитьЦвет", "");	
	ИмяЭлементаСоЦветом = "ГМДекорацияЦвет" + ИмяНастройки;
	
	НастройкиОформления = ПолучитьНастройкиОформленияГрафикаМонтажей();
	Для каждого ЭлементМассива из НастройкиОформления.ГМ Цикл
		Если ИмяНастройки  = ЭлементМассива.Настройка Тогда
			Элементы[ИмяЭлементаСоЦветом].ЦветФона = ЭлементМассива.Цвет;
			Элементы[ИмяЭлементаСоЦветом].ЦветТекста = ЭлементМассива.Цвет;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЗамеры

&НаКлиенте
Процедура УстановитьЦветПоУмолчаниюДляВсехЗамеров(Команда)
	
	НастройкиОформления = ПолучитьНастройкиОформленияГрафикаЗамеров();
	Для каждого ЭлементМассива из НастройкиОформления.ГЗ Цикл
		ИмяЭлементаСоЦветом = "ГЗДекорацияЦвет" + ЭлементМассива.Настройка;
		Элементы[ИмяЭлементаСоЦветом].ЦветФона = ЭлементМассива.Цвет;
		Элементы[ИмяЭлементаСоЦветом].ЦветТекста = ЭлементМассива.Цвет;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Добавленный_УстановитьЦветПоУмолчаниюЗамера(Элемент)
	
	ИмяНастройки = СтрЗаменить(Элемент.Имя, "УстановитьЦвет", "");	
	ИмяЭлементаСоЦветом = "ГЗДекорацияЦвет" + ИмяНастройки;
	
	НастройкиОформления = ПолучитьНастройкиОформленияГрафикаЗамеров();
	Для каждого ЭлементМассива из НастройкиОформления.ГЗ Цикл
		Если ИмяНастройки  = ЭлементМассива.Настройка Тогда
			Элементы[ИмяЭлементаСоЦветом].ЦветФона = ЭлементМассива.Цвет;
			Элементы[ИмяЭлементаСоЦветом].ЦветТекста = ЭлементМассива.Цвет;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция ПолучитьНастройкиОформленияГрафикаЗамеров()
	
	Возврат ОбщийМодульСервер.ПолучитьНастройкиОформленияГрафикаЗамеров();
			
КонецФункции

&НаСервере
Функция ПолучитьНастройкиОформленияГрафикаМонтажей()
	
	Возврат ОбщийМодульСервер.ПолучитьНастройкиОформленияГрафикаМонтажей();
			
КонецФункции

#КонецОбласти
