#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
// Вызывается в обработчике события формы отчета после выполнения кода формы.
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   Настройки - НастройкиКомпоновкиДанных - Настройки для загрузки в компоновщик настроек.
//
Процедура ПриЗагрузкеВариантаНаСервере(Форма, Настройки) Экспорт
	
	Поле = Новый ПолеКомпоновкиДанных("ВидДокумента");
	ПолеОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Поле);
	Если ПолеОтбора <> Неопределено Тогда			
		ДоступныеЗначения = ПолеОтбора.ДоступныеЗначения;
		Если ТипЗнч(ДоступныеЗначения) = Тип("СписокЗначений") И ЗначениеЗаполнено(ДоступныеЗначения) Тогда
			
			НайденныйЭлемент = ДоступныеЗначения.НайтиПоЗначению(Тип("ДокументСсылка.ЗаказНаПроизводство"));
			Если НайденныйЭлемент <> Неопределено Тогда 
				ДоступныеЗначения.Удалить(НайденныйЭлемент);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли