////#Область Константы

Функция Константа_ПолучитьЭлемент(ИмяПеременной) Экспорт
    Возврат Справочники.ИА_Константы.ПолучитьЭлемент(ИмяПеременной);
КонецФункции

Функция Константа_Значение(ИмяПеременной) Экспорт
    Возврат Справочники.ИА_Константы.ЗначениеКонстанты(ИмяПеременной);
КонецФункции

Функция Константа_ЗначениеСписка(ИмяПеременной) Экспорт
    Возврат Справочники.ИА_Константы.ПолучитьЭлемент(ИмяПеременной).Данные.ВыгрузитьКолонку("Значение1");
КонецФункции

Функция Константа_Получить(ИмяКонстанты) Экспорт
	Возврат Константы[ИмяКонстанты].Получить();
КонецФункции
 

////#КонецОбласти 

////#Область Общие
	
Функция ВычислитьВыражение(Код, Контекст = Неопределено) Экспорт
	Результат = Вычислить(Код);
	Возврат Результат;
КонецФункции
 
////#КонецОбласти

Функция ТекущийПользователь() Экспорт
    Контекст = Новый Структура("Пользователь", Неопределено);    
    Если ИА_БФКС.РеквизитЕсть(ПараметрыСеанса, "ТекущийПользователь") Тогда
        Контекст.Пользователь = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
    
    ИА_БФСПереопределяемый.ТекущийПользователь(Контекст);
    
    Возврат Контекст.Пользователь;		
КонецФункции


