
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	//++ №9754 регулирование статусов по галочке в документе "Создан при использовании статуса "Закрыт"
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	// По умолчанию смотрим на константу
	ИспользоватьСтатусЗакрыт = Константы.ИспользоватьСтатусЗакрытВМонтаже.Получить();
	
	// Если выбираем статус из формы монтажа, то в параметрах ожидаем признак
	Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("СозданПриИспользованииСтатусаЗакрыт") Тогда
		ИспользоватьСтатусЗакрыт = Параметры.СозданПриИспользованииСтатусаЗакрыт;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИспользоватьСтатусЗакрыт", ИспользоватьСтатусЗакрыт);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезультатыМонтажа.Ссылка КАК Статус,
	|	РезультатыМонтажа.Наименование КАК Наименование
	|ИЗ
	|	Справочник.РезультатыМонтажа КАК РезультатыМонтажа
	|ГДЕ
	|	НЕ РезультатыМонтажа.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА НЕ &ИспользоватьСтатусЗакрыт
	|				ТОГДА НЕ РезультатыМонтажа.Ссылка = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Закрыт)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл		
		ДанныеВыбора.Добавить(Выборка.Статус, Выборка.Наименование);		
	КонецЦикла;
	//-- №9754
	
КонецПроцедуры