
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если НеУчитыватьСтоимостьВЗаказахНаПроизводство Тогда
	Если ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПроизводствоВидЦенТовары"));
	КонецЕсли;
	
	Если НЕ Константы.ИспользоватьПодразделения.Получить() Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПроизводствоПодразделение"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	//НАЧАЛО: Переход на 2.0
	//Если НЕ ЗаказПоставщикуЗаказыватьМатериалы И НЕ ЗаказПоставщикуЗаказыватьТовары Тогда
	//	ВыделятьТоварыИМатериалыВОтдельныйЗаказ = Ложь;
	//КонецЕсли;
	//КОНЕЦ: Переход на 2.0
		
	//Если НеУчитыватьСтоимостьВЗаказахНаПроизводство Тогда
	Если ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
		ПроизводствоВидЦенТовары = Справочники.ВидыЦен.ПустаяСсылка();
		СкладРозницыПриПоступленииТоваровОтПроизводства = Справочники.Склады.ПустаяСсылка();  //#7764
	КонецЕсли;
	
	//Если НЕ ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
	//	РазрешитьПереводЗаказаВОтгруженБезОформленияРеализации = Ложь; 
	//КонецЕсли;
	
	//Если НЕ Константы.ИспользоватьСтатусНовыйВЗаказеПокупателя.Получить() Тогда
	//	СтатусНовогоЗаказаПокупателя = Справочники.СтатусыЗаказовПокупателей.ПустаяСсылка();
	//КонецЕсли;
	
КонецПроцедуры
