
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	ФинансыСервер.УстановитьОтметкуНезаполненныхСтатейДоходовРасходов(Элементы);
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ДеревоТоваровСтатьяДоходов");
	ФинансыСервер.УстановитьВидимостьКолонокСтатейДиРВТабличнойЧасти(ЭтаФорма, МассивЭлементов, Истина);
	
	ВидСпецификацииПоУмолчанию = Перечисления.ВидыСпецификации.СопутствующиеМатериалы;
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("ДеревоТоваровНоменклатураАртикул");
	МассивЭлементов.Добавить("МатериалыНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ДополнительныеПраваЗапретРедактированияЦенВДокументах, ДополнительныеПраваЗапретПримененияСкидок");
	
	//управление доступностью элементов
	Если РеквизитыПользователя.ДополнительныеПраваЗапретРедактированияЦенВДокументах Тогда
		МассивИменЭлементов = Документы.СоглашениеОРасторженииДоговора.ПолучитьМассивРеквизитовПоЦенам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
	//#7771
	Если РеквизитыПользователя.ДополнительныеПраваЗапретПримененияСкидок Тогда
		МассивИменЭлементов = Документы.СоглашениеОРасторженииДоговора.ПолучитьМассивРеквизитовПоСкидкам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
	
	//построим дерево
	ПерестроитьДеревоНаФорме();
	
	ПереключательНаНазваниеКомнат = Константы.ИспользоватьСправочникКомнатВРознице.Получить();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// видимость СуммаДополнительныхЗатрат
	Элементы.СуммаДополнительныхЗатрат.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьВедениеУчетаДоходовРасходов");
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мИспользоватьАвтоматическиеСкидки = ПолучитьЗначениеКонстантыАвтоматическихСкидок();
	ОбновитьВидимостьИДоступностьЭлементов();
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаСервере 
Функция ПолучитьЗначениеКонстантыАвтоматическихСкидок()
	Возврат Константы.ИспользоватьАвтоматическиеСкидки.Получить();
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//проверки
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ДеревоТовары = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
		
		Для Каждого ТекущаяКомната из ДеревоТовары.Строки Цикл
			Для Каждого ТекущаяНоменклатура из ТекущаяКомната.Строки Цикл
				
				ТекстСообщения = ("Товары и услуги. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указана цена");
				СтруктураПараметров = Новый Структура("Ссылка, ТабличнаяЧасть, ИмяТабличнойЧасти, ТекстСообщения", Объект.Ссылка, "ТоварыУслуги", "", ТекстСообщения);
				ОбработкаТабличныхЧастейСервер.ПроверитьЦенуСтроки(ТекущаяНоменклатура, СтруктураПараметров, Отказ);
				
				Если ТекущаяНоменклатура.Количество = 0 Тогда
					Отказ = Истина;
					Сообщить("Товары и услуги. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указано количество");
				КонецЕсли;
				Если ПустаяСтрока(ТекущаяНоменклатура.ЕдиницаИзмерения) Тогда
					Отказ = Истина;
					Сообщить("Товары и услуги. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указана единица измерения");
				КонецЕсли;
				Если ТекущаяНоменклатура.Коэффициент = 0 Тогда
					Отказ = Истина;
					Сообщить("Товары и услуги. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указан коэффициент единицы измерения");
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
		Для Каждого ТекущаяНоменклатура из Объект.Материалы Цикл
			Если ТекущаяНоменклатура.Количество = 0 Тогда
				Отказ = Истина;
				Сообщить("Материалы. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указано количество");
			КонецЕсли;
			Если ПустаяСтрока(ТекущаяНоменклатура.ЕдиницаИзмерения) Тогда
				Отказ = Истина;
				Сообщить("Материалы. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указана единица измерения");
			КонецЕсли;
			Если ТекущаяНоменклатура.Коэффициент = 0 Тогда
				Отказ = Истина;
				Сообщить("Материалы. Комната: " + ТекущаяНоменклатура.Комната + ", Номенклатура: " + ТекущаяНоменклатура.Номенклатура + " не указан коэффициент единицы измерения");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// проверяем заполненность статей доходов/расходов
	ФинансыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, , Объект.СуммаДополнительныхЗатрат > 0);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// №6828 закомментировано, т.к. должна быть возможность перевода в статус из списка СоРД
	// #12975 раскомментировано, в список добавлена обработка события "СписокПриИзменении"
	Если Объект.Проведен И НЕ ЗаказДоговорВСтатусеОтменен() Тогда
		Оповестить("ЦентрСобытий_РасторжениеЗаказДоговора", Объект.ЗаказДоговор, Объект.Ссылка);
		//ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОПереводеЗаказДоговорВСтатусРасторгнут", ЭтотОбъект), "Перевести договор в статус расторгнут?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьОтображениеЭлементовФормы();
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоТоваровПредставлениеВидаНоменлатуры");

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоТоваров.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоТоваров.ВидНоменклатуры");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.ВидыНоменклатуры.Продукция;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Продукция");
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоТоваровПредставлениеВидаНоменлатуры");

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоТоваров.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоТоваров.ВидНоменклатуры");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.ВидыНоменклатуры.Потолок;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Потолок");
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоТоваровПредставлениеВидаНоменлатуры");

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоТоваров.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоТоваров.ВидНоменклатуры");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.ВидыНоменклатуры.Услуга;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Услуга");
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоТоваровПредставлениеВидаНоменлатуры");

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоТоваров.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоТоваров.ВидНоменклатуры");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.ВидыНоменклатуры.Отрез;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Отрез");
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоТоваровПредставлениеВидаНоменлатуры");

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоТоваров.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	СЗ_НеТовар = Новый СписокЗначений;
	СЗ_НеТовар.Добавить(Справочники.ВидыНоменклатуры.Продукция);
	СЗ_НеТовар.Добавить(Справочники.ВидыНоменклатуры.Отрез);
	СЗ_НеТовар.Добавить(Справочники.ВидыНоменклатуры.Потолок);
	СЗ_НеТовар.Добавить(Справочники.ВидыНоменклатуры.Услуга);
	СЗ_НеТовар.Добавить(Справочники.ВидыНоменклатуры.ТиповойОтрез);
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоТоваров.ВидНоменклатуры");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборЭлемента.ПравоеЗначение = СЗ_НеТовар;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Товар");
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()

	Объект.СтатьяДоходов  = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, "Доход");
	Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, "Расход", Ложь);

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбновитьВидимостьИДоступностьЭлементов()
	
	//Элементы.СкладСписанияТоваров.Доступность 	  = Объект.СписатьТовары;
	//Элементы.СкладСписанияМатериалов.Доступность  = Объект.СписатьМатериалы;
	//Элементы.ГруппаВзаиморасчетыСумма.Доступность = Объект.БезВозвратаДенегКлиенту;
		
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьТоварыПоДоговору(Команда)
	
	Если Объект.ТоварыУслуги.Количество() > 0 Тогда
		ПоказатьВопросОбОчищенииТабличнойЧастиТоварыПриЗаполненииПоДоговору();
	Иначе
		ЗаполнитьТоварыПоДоговоруНаСервере();
		РазвернутьДеревоТоваров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОбОчищенииТабличнойЧастиТоварыПриЗаполненииПоДоговору()
	
	ОП = Новый ОписаниеОповещения("ПослеВопросаОбОчищенииТабличнойЧастиТоварыПриЗаполненииПоДоговору", ЭтотОбъект);
	ПоказатьВопрос(ОП, "В табличной части ""Товары и услуги"" присутствуют позиции, табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчищенииТабличнойЧастиТоварыПриЗаполненииПоДоговору(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТоварыПоДоговоруНаСервере();
		РазвернутьДеревоТоваров();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоДоговоруНаСервере()
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ЗаполнитьТоварыПоДоговору();
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
	ПерестроитьДеревоНаФорме();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатерилыПоДоговору(Команда)
	
	ЗаполнитьМатерилыПоДоговоруНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатерилыПоДоговоруНаСервере()
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ЗаполнитьМатериалыПоДоговору();
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьСуммуВзаиморасчетов(Команда)
//	
//	ЗаполнитьСуммуВзаиморасчетовНаСервере();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьСуммуВзаиморасчетовНаСервере()
//	
//	мОбъект = РеквизитФормыВЗначение("Объект");
//	мОбъект.ЗаполнитьСуммуВзаиморасчетов();
//	ЗначениеВРеквизитФормы(мОбъект, "Объект");
//	Модифицированность = Истина;
//	
//КонецПроцедуры

&НаКлиенте
Процедура БезВозвратаДенегКлиентуПриИзменении(Элемент)
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписатьТоварыПриИзменении(Элемент)
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписатьМатериалыПриИзменении(Элемент)
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварыПоМонтажу(Команда)
	
	СписокМонтажей = ПолучитьСписокМонтажейНаСервере();
	
	Если СписокМонтажей.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "По договору не были найдены монтажи.");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = новый Структура("СписокМонтажей, НазваниеТЧ, ОчищатьТЧ, ТипДокумента", СписокМонтажей, "ТоварыУслуги", Истина, Тип("ДокументСсылка.Монтаж"));
	Если Объект.ТоварыУслуги.Количество() > 0 Тогда
		ПоказатьВопросОбОчищенииТабличнойЧасти(ПараметрыЗаполнения);
	Иначе
		ПоказатьВыборМонтажаДляЗаполнения(ПараметрыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокМонтажейНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Монтажи.Ссылка
		|ИЗ 
		|   Документ.Монтаж КАК Монтажи
		|ГДЕ
		|	Монтажи.Основание = &ЗаказДоговор
		|	И НЕ Монтажи.Основание = Значение(Документ.ЗаказДоговор.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.ЗаказДоговор);
	
	СписокМонтажей = новый СписокЗначений;
	СписокМонтажей.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокМонтажей;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВопросОбОчищенииТабличнойЧасти(ПараметрыЗаполнения)
	
	ОП = Новый ОписаниеОповещения("ПослеВопросаОбОчищенииТабличнойЧасти", ЭтотОбъект, ПараметрыЗаполнения);
	ПоказатьВопрос(ОП, "В табличной части """ + ПараметрыЗаполнения.НазваниеТЧ + """ присутствуют позиции, очистить данные?
		| Да = очистить
		| Нет = дополнить данные
		| Отмена = отменить действие", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчищенииТабличнойЧасти(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да ИЛИ Ответ = КодВозвратаДиалога.Нет Тогда
		ДопПараметры.ОчищатьТЧ = (Ответ = КодВозвратаДиалога.Да);
		Если ДопПараметры.ТипДокумента = Тип("ДокументСсылка.Монтаж") Тогда
			ПоказатьВыборМонтажаДляЗаполнения(ДопПараметры);
		ИначеЕсли ДопПараметры.ТипДокумента = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
			ПоказатьВыборПоступленияДляЗаполнения(ДопПараметры);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыборМонтажаДляЗаполнения(ПараметрыЗаполнения)
	
	Если ПараметрыЗаполнения.СписокМонтажей.Количество() = 1 Тогда
		ЗаполнитьТоварыПоМонтажуНаСервере(ПараметрыЗаполнения.СписокМонтажей[0].Значение, ПараметрыЗаполнения);
	Иначе
		ОП = Новый ОписаниеОповещения("ПослеВыбораМонтажаДляЗаполнения", ЭтотОбъект, ПараметрыЗаполнения);
		ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", новый Структура("ДоступныеЗначения", ПараметрыЗаполнения.СписокМонтажей), ЭтотОбъект,,,, ОП);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораМонтажаДляЗаполнения(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.Монтаж") Тогда
		
		ЗаполнитьТоварыПоМонтажуНаСервере(ВыбранноеЗначение, ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоМонтажуНаСервере(Монтаж, ПараметрыЗаполнения)
	
	Если ПараметрыЗаполнения.ОчищатьТЧ Тогда
		Объект[ПараметрыЗаполнения.НазваниеТЧ].Очистить();
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Монтаж[ПараметрыЗаполнения.НазваниеТЧ] Цикл
		
		Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект[ПараметрыЗаполнения.НазваниеТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоМонтажу(Команда)
	
	СписокМонтажей = ПолучитьСписокМонтажейНаСервере();
	
	Если СписокМонтажей.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "По договору не были найдены монтажи.");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = новый Структура("СписокМонтажей, НазваниеТЧ, ОчищатьТЧ, ТипДокумента", СписокМонтажей, "Материалы", Истина, Тип("ДокументСсылка.Монтаж"));
	Если Объект.Материалы.Количество() > 0 Тогда
		ПоказатьВопросОбОчищенииТабличнойЧасти(ПараметрыЗаполнения);
	Иначе
		ПоказатьВыборМонтажаДляЗаполнения(ПараметрыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура, Количество", СтрокаТабличнойЧасти.Номенклатура, 1);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, Количество");
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаказДоговорВСтатусеОтменен()
	
	Возврат (Объект.ЗаказДоговор.ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.Отменен);
	
КонецФункции

&НаКлиенте
Процедура ПослеВопросаОПереводеЗаказДоговорВСтатусРасторгнут(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПеревестиДоговорВСтатусРасторгнут();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеревестиДоговорВСтатусРасторгнут()
	
	ДокументОбъект = Объект.ЗаказДоговор.ПолучитьОбъект();
	ДокументОбъект.ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.Отменен;
	
	Попытка
		ДокументОбъект.Записать(?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	Исключение
		Сообщить("Не удалось перевести договор в статус ""Расторгнут""." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПеренестиДеревоВТабличнуюЧасть();
	
	// Проверка на выполненные или монтажи в работе
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Статусы = новый Массив;
		Статусы.Добавить(ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Выполнен"));
		Статусы.Добавить(ПредопределенноеЗначение("Справочник.РезультатыМонтажа.ЧастичноВыполнен"));
		Статусы.Добавить(ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Закрыт"));
		
		ВыполненныеМонтажи = ПолучитьМонтажиВСтатусе(Статусы);
		
		Если ВыполненныеМонтажи.Количество() > 0 Тогда
			Отказ = Истина;
			ПоказатьПредупреждение(, "По заказ-договору имеются выполненные (закрытые) монтажи. Проведение документа отменено.");
			Возврат;
		КонецЕсли;
		
		Статусы.Очистить();
		Статусы.Добавить(ПредопределенноеЗначение("Справочник.РезультатыМонтажа.ВРаботе"));
		
		МонтажиВРаботе = ПолучитьМонтажиВСтатусе(Статусы);
		
		Если МонтажиВРаботе.Количество() > 0 Тогда
			Отказ = Истина;
			ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОбОтменеМонтажейВРаботе", ЭтотОбъект, новый Структура("МонтажиВРаботе", МонтажиВРаботе)), "По заказ-договору имеются монтажи в работе. Для проведения документа необходимо их отменить.
				|Отменить монтажи по данному заказ-договору в работе?", РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМонтажиВСтатусе(Статусы)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Монтажи.Ссылка
		|ИЗ
		|   Документ.Монтаж КАК Монтажи
		|ГДЕ
		|   Монтажи.Основание = &ЗаказДоговор
		|	И Монтажи.Результат В (&Статусы)
		|	И НЕ Монтажи.ПометкаУдаления
		|	И НЕ Монтажи.Основание = Значение(Документ.ЗаказДоговор.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.ЗаказДоговор);
	
	Запрос.УстановитьПараметр("Статусы", Статусы);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ПослеВопросаОбОтменеМонтажейВРаботе(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		//Необходимо перевести монтажи в работе в статус "Отменен"
		ПеревестиМонтажиВРаботеВСтатусОтменен(ДопПараметры.МонтажиВРаботе);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеревестиМонтажиВРаботеВСтатусОтменен(МонтажиВРаботе)
	
	Успешно = Истина;
	
	Для Каждого Монтаж Из МонтажиВРаботе Цикл
		ДокОбъект = Монтаж.ПолучитьОбъект();
		ДокОбъект.Результат = Справочники.РезультатыМонтажа.Отменен;
		Попытка
			Если ДокОбъект.Проведен Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокОбъект.Записать();
			КонецЕсли;
		Исключение
			Успешно = Ложь;
			Сообщить("Ошибка при переводе монтажа " + Монтаж + " в статус ""Отменен"": " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;	
		
	Если Успешно Тогда
		Сообщить("Монтажи в работе успешно переведены в статус ""Отменен"".");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаказДоговорПриИзмененииНаСервере()
	Объект.Организация = Объект.ЗаказДоговор.Организация;
	Объект.Подразделение = Объект.ЗаказДоговор.Подразделение;
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорПриИзменении(Элемент)
	ЗаказДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоПоступлениямДоговора(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ЗаказДоговор) Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать договор");
		Возврат;
	КонецЕсли;
	
	СписокПоступленийПоДоговору = ПолучитьСписокПоступленийПоДоговору();
	
	Если СписокПоступленийПоДоговору.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "По договору не были найдены документы ""Поступление товаров и услуг"".");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = новый Структура("СписокПоступлений, НазваниеТЧ, ОчищатьТЧ, ТипДокумента", СписокПоступленийПоДоговору, "Материалы", Истина, Тип("ДокументСсылка.ПоступлениеТоваровИУслуг"));
	Если Объект.Материалы.Количество() > 0 Тогда
		ПоказатьВопросОбОчищенииТабличнойЧасти(ПараметрыЗаполнения);
	Иначе
		ПоказатьВыборПоступленияДляЗаполнения(ПараметрыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПоступленийПоДоговору()
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваровИУслуг.Ссылка
		|ИЗ 
		|   Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
		|ГДЕ
		|	ПоступлениеТоваровИУслуг.Основание = &ЗаказДоговор
		|	И НЕ ПоступлениеТоваровИУслуг.Основание = Значение(Документ.ЗаказДоговор.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.ЗаказДоговор);
	
	СписокПоступлений = новый СписокЗначений;
	СписокПоступлений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СписокПоступлений;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВыборПоступленияДляЗаполнения(ПараметрыЗаполнения)
	
	// Если документ для заполнения один, то сразу по нему и заполним
	Если ПараметрыЗаполнения.СписокПоступлений.Количество() = 1 Тогда
		ЗаполнитьМатериалыПоПоступлениямДоговораНаСервере(ПараметрыЗаполнения.СписокПоступлений[0].Значение, ПараметрыЗаполнения);
	Иначе	
		ОП = Новый ОписаниеОповещения("ПослеВыбораПоступленияДляЗаполнения", ЭтотОбъект, ПараметрыЗаполнения);
		ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", новый Структура("ДоступныеЗначения", ПараметрыЗаполнения.СписокПоступлений), ЭтотОбъект,,,, ОП);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПоступленияДляЗаполнения(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		
		ЗаполнитьМатериалыПоПоступлениямДоговораНаСервере(ВыбранноеЗначение, ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоПоступлениямДоговораНаСервере(ДокументПоступления, ПараметрыЗаполнения)
	
	Если ПараметрыЗаполнения.ОчищатьТЧ Тогда
		Объект[ПараметрыЗаполнения.НазваниеТЧ].Очистить();
	КонецЕсли;
		
	Для Каждого ТекущаяСтрока Из ДокументПоступления.Товары Цикл
		
		Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект[ПараметрыЗаполнения.НазваниеТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

// ПроцедурыИФункции документа ЗаказДоговор (адаптированные под расторжение)
#Область ПроцедурыИФункцииДокументаЗаказДоговор

&НаСервере
Процедура ПерестроитьДеревоНаФорме()
	
	//ТОВАРЫ И УСЛУГИ
	//ключ строки дерева: комната
	ТЗКомнаты = Объект.ТоварыУслуги.Выгрузить(, "Комната");
	Для Каждого Стр из Объект.Материалы Цикл
		НоваяСтрока = ТЗКомнаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	ТЗКомнаты.Свернуть("Комната");
	// сортировку не делаем, при наличии комнат более 10 будет сортировка по строкам, а не по числам, что приведет к "проблеме"
	
	СписокКомнат.ЗагрузитьЗначения(ТЗКомнаты.ВыгрузитьКолонку("Комната"));
	
	Комната = "";
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
	
	Для каждого СтрокаКомнаты из ТЗКомнаты Цикл
		СтрДерево = Дерево.Строки.Добавить();
		СтрДерево.Комната = СтрокаКомнаты.Комната;
		Комната = СтрокаКомнаты.Комната;
	КонецЦикла;
	
	Для Каждого Стр из Объект.ТоварыУслуги Цикл
		//Если Стр.Комната <> Комната Тогда
		//	СтрДерево = Дерево.Строки.Добавить();
		//	СтрДерево.Комната = Стр.Комната;
		//	Комната = Стр.Комната;
		//КонецЕсли;
		СтрДерево = Дерево.Строки.Найти(Стр.Комната, "Комната");
		Если НЕ Стр.Номенклатура.Пустая() Тогда
			СтрДеревоВид = СтрДерево.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДеревоВид, Стр);
			СтрДеревоВид.ВидНоменклатуры = Стр.Номенклатура.ВидНоменклатуры;
		КонецЕсли;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЦенаПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Цена = 0;
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуСтроки(Элементы.ДеревоТоваров.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПроцентСкидкиПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.ПроцентСкидки = 0;
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуСтроки(Элементы.ДеревоТоваров.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;	
	ОбщийМодульКлиент.Розница_ТоварыСуммаПриИзменении(ЭтотОбъект, СтрокаТабличнойЧасти); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровСуммаСкидкиПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.СуммаСкидки = 0;
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если НЕ ТекущаяСтрока.СуммаСкидки = 0 Тогда
		Если НЕ ТекущаяСтрока.Количество = 0 и НЕ ТекущаяСтрока.Цена = 0 Тогда
			ТекущаяСтрока.ПроцентСкидки = Окр((ТекущаяСтрока.СуммаСкидки / (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена)) * 100,2);
			РассчитатьСуммуСтроки(ТекущаяСтрока, Истина);
		Иначе
			ТекущаяСтрока.ПроцентСкидки = 100;
			РассчитатьСуммуСтроки(ТекущаяСтрока, Истина);
		КонецЕсли;
	Иначе 
		ТекущаяСтрока.ПроцентСкидки = 0;
		РассчитатьСуммуСтроки(ТекущаяСтрока, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПриИзменении(Элемент)
	
	//в этом методе нелья вызывать ПеренестиДеревоВТабличнуюЧасть(), т.к. иначе если при обрабтке изменения значения реквизита вызвать асинхронный дилог вопроса, то 
	//к тому времени как пользователь даст ответ на вопрос, его внесенные данные будут затерты в дереве
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущаяСтрока = Неопределено, НеПересчитыватьСуммуРучнойСкидки = Ложь)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущаяСтрока.ПроцентСкидки = 100 Тогда
		ТекущаяСтрока.Сумма = 0;
		Если НЕ НеПересчитыватьСуммуРучнойСкидки Тогда
			ТекущаяСтрока.СуммаСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		КонецЕсли;
	Иначе
		Если НЕ ТекущаяСтрока.ПроцентСкидки = 0 Тогда
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * (1 - ТекущаяСтрока.ПроцентСкидки / 100);
			Если НЕ НеПересчитыватьСуммуРучнойСкидки Тогда
				ТекущаяСтрока.СуммаСкидки = (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена) - ТекущаяСтрока.Сумма;
			КонецЕсли;
		Иначе
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			Если НЕ НеПересчитыватьСуммуРучнойСкидки Тогда
				ТекущаяСтрока.СуммаСкидки = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТекущаяСтрока.СуммаПоПрайсу = ТекущаяСтрока.ЦенаПоПрайсу * ТекущаяСтрока.Количество;
	
	РассчитатьСуммуНДСТабЧасти(ТекущаяСтрока);
	
	ПеренестиДеревоВТабличнуюЧасть();
	ПересчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти)
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
	ПеренестиДеревоВТабличнуюЧасть();												   
	Если УчитыватьНДС Тогда
		Элементы.ИтогиВсегоНДС.Заголовок = Объект.ТоварыУслуги.Итог("СуммаНДС");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиДеревоВТабличнуюЧасть()
	
	//ТОВАРЫ И УСЛУГИ
	Объект.ТоварыУслуги.Очистить();
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Для Каждого СтрНоменклатура из Строка.Строки Цикл
			Если НЕ СтрНоменклатура.Номенклатура.Пустая() Тогда				
				Стр = Объект.ТоварыУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(Стр, СтрНоменклатура);
				Стр.СуммаПоПрайсу = Стр.ЦенаПоПрайсу * Стр.Количество;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
	ПересчитатьСуммуДокументаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	ПересчитатьСуммуДокументаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуДокументаНаСервере()
	
	Объект.СуммаДокумента = Объект.ТоварыУслуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементовФормы(Знач ТекущаяКомната = Неопределено, Знач ТекущаяНоменклатура = Неопределено)
	
	Если НЕ Элементы.ДеревоТоваров.ТекущиеДанные = Неопределено Тогда
		Если ТекущаяКомната = Неопределено Тогда
			ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
		КонецЕсли;
		Если ТекущаяНоменклатура = Неопределено Тогда
			ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();	
	РазвернутьДеревоТоваров(ТекущаяКомната,ТекущаяНоменклатура);
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
	Элементы.ДеревоТоваровСтавкаНДС.Видимость 	= УчитыватьНДС;
	Элементы.ДеревоТоваровСуммаНДС.Видимость 	= УчитыватьНДС;
	Элементы.ГруппаНДС.Видимость				= УчитыватьНДС;
	Если УчитыватьНДС Тогда
		Элементы.ИтогиВсегоНДС.Заголовок = Объект.ТоварыУслуги.Итог("СуммаНДС");
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ДеревоТоваровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПередНачаломИзменения(Элемент, Отказ)
	
	//ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	//
	//Если ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если ТекущиеДанные.Номенклатура.Пустая() Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	//
	//мСпецификация = ТекущиеДанные.Спецификация;
	//мНоменклатура = ТекущиеДанные.Номенклатура;
	//
	////запрещаем редактировать строки, у которых статус монтажа = "Выполнен" или "Закрыт"
	//Если ТекущиеДанные.МонтажСтатус = ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Выполнен") или ТекущиеДанные.МонтажСтатус = ПредопределенноеЗначение("Справочник.РезультатыМонтажа.Закрыт") Тогда
	//	ПоказатьПредупреждение(,"Запрещено редактировать строки по выполненным или закрытым монтажам");
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	//
	//ТекущиеДанные.ЕстьЗаказПокупателяПоПотолку = ПолучитьПризнакЕстьЗаказПокупателяПоПотолку(ТекущиеДанные.Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, ТекущиеДанные.НомерПотолка);
	//	
	//Если ТекущиеДанные.ЕстьЗаказПокупателяПоПотолку	Тогда
	//	Отказ = Истина;
	//	ПоказатьПредупреждение(,"По данному потолку имеется заказ покупателя (на производство). Редактирование не доступно." + Символы.ПС + "Предварительно следует отменить заказ покупателя.");
	//КонецЕсли;
	//
	//Если НЕ ПустаяСтрока(ТекущиеДанные.НомерПотолка) Тогда 
	//	
	//	Потолок = ПолучитьНоменклатуруПотолкаДереваПоНомеруПотолка(ТекущиеДанные.НомерПотолка);
	//	
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("Потолок", Потолок);
	//	НайденныеСтроки = ПодчиненныеДокументыПоПотолку.НайтиСтроки(Отбор);
	//	Если НайденныеСтроки.Количество() > 0 Тогда
	//		
	//		ТекстВопроса = "По " + Потолок + " имеются проведенные документы: " + Символы.ПС;
	//		Для чНом = 0 По НайденныеСтроки.Количество() - 1 Цикл
	//			ТекстВопроса = ТекстВопроса + НайденныеСтроки[чНом].Документ + Символы.ПС;
	//		КонецЦикла;
	//		ТекстВопроса = ТекстВопроса + "Продолжить?";
	//		
	//		ЗадатьВопросПередИзменениемСтроки(Отказ, Элемент, ТекстВопроса);
	//		
	//	КонецЕсли;
	//	
	//Иначе
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("Потолок", ТекущиеДанные.Номенклатура);
	//	НайденныеСтроки = ПодчиненныеДокументыПоПотолку.НайтиСтроки(Отбор);
	//	Если НайденныеСтроки.Количество() > 0 Тогда
	//		
	//		ТекстВопроса = "По " + ТекущиеДанные.Номенклатура + " имеются проведенные документы: " + Символы.ПС;
	//		Для чНом = 0 По НайденныеСтроки.Количество() - 1 Цикл
	//			ТекстВопроса = ТекстВопроса + НайденныеСтроки[чНом].Документ + Символы.ПС;
	//		КонецЦикла;
	//		ТекстВопроса = ТекстВопроса + "Продолжить?";
	//		
	//		ЗадатьВопросПередИзменениемСтроки(Отказ, Элемент, ТекстВопроса);
	//		
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 Тогда
		//не даем удалить саму комнату, иначе нижние проверки не сработают
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = ПолучитьКомнатуИНоменклатуруСледущийСтроки();
	ВремТекущаяКомната = СтруктураОтвета.ТекущаяКомната;
	ВремТекущаяНоменклатура = СтруктураОтвета.ТекущаяНоменклатура;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКомнатуИНоменклатуруСледущийСтроки()
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ТекущаяКомната","");
	СтруктураОтвета.Вставить("ТекущаяНоменклатура",Неопределено);
	Нашли = Ложь;
	
	ВремДеревоТоваров = РеквизитФормыВЗначение("ДеревоТоваров");
	Для Каждого ТекущаяСтрокаКомната Из ВремДеревоТоваров.Строки Цикл
		Если ТекущаяСтрокаКомната.Комната = ВремТекущаяКомната и ТекущаяСтрокаКомната.Номенклатура = ВремТекущаяНоменклатура Тогда
			Нашли = Истина;
			Продолжить;
		Иначе
			Если Нашли Тогда
				СтруктураОтвета.ТекущаяКомната = ТекущаяСтрокаКомната.Комната;
				СтруктураОтвета.ТекущаяНоменклатура = Неопределено;
				Возврат СтруктураОтвета;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрокаНоменклатура Из ТекущаяСтрокаКомната.Строки Цикл
			Если ТекущаяСтрокаНоменклатура.Комната = ВремТекущаяКомната и ТекущаяСтрокаНоменклатура.Номенклатура = ВремТекущаяНоменклатура Тогда
				Нашли = Истина;
			Иначе
				Если Нашли Тогда
					СтруктураОтвета.ТекущаяКомната = ТекущаяСтрокаНоменклатура.Комната;
					СтруктураОтвета.ТекущаяНоменклатура = ТекущаяСтрокаНоменклатура.Номенклатура;
					Возврат СтруктураОтвета;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//случай удаления самой последней строки дерева
	Для Каждого ТекущаяСтрокаКомната Из ВремДеревоТоваров.Строки Цикл
		
		Если ТекущаяСтрокаКомната.Комната = ВремТекущаяКомната и ТекущаяСтрокаКомната.Номенклатура = ВремТекущаяНоменклатура Тогда
			Продолжить;
		Иначе
			СтруктураОтвета.ТекущаяКомната = ТекущаяСтрокаКомната.Комната;
			СтруктураОтвета.ТекущаяНоменклатура = Неопределено;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрокаНоменклатура Из ТекущаяСтрокаКомната.Строки Цикл
			Если ТекущаяСтрокаНоменклатура.Комната = ВремТекущаяКомната и ТекущаяСтрокаНоменклатура.Номенклатура = ВремТекущаяНоменклатура Тогда
			Иначе
				СтруктураОтвета.ТекущаяКомната = ТекущаяСтрокаНоменклатура.Комната;
				СтруктураОтвета.ТекущаяНоменклатура = ТекущаяСтрокаНоменклатура.Номенклатура;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаКлиенте
Процедура ДеревоТоваровПослеУдаления(Элемент)
	
	ПеренестиДеревоВТабличнуюЧасть();
	ПерестроитьДеревоНаФорме();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	РазвернутьДеревоТоваров(ВремТекущаяКомната, ВремТекущаяНоменклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровНоменклатураПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяДоходов, ВидНоменклатуры");
	
	СтрокаТабличнойЧасти.Количество = ПолучитьКоличествоНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтрокаТабличнойЧасти.ПроцентСкидки = ПолучитьПроцентВидаСкидки();
	СтрокаТабличнойЧасти.ЦенаПоПрайсу = СтрокаТабличнойЧасти.Цена;
	РассчитатьСуммуСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоНоменклатуры(Номенклатура)
	
	Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Номенклатура) Тогда
		Если Номенклатура.Потолок_КоличествоПродукция > 0 Тогда
			Возврат Номенклатура.Потолок_КоличествоПродукция;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции

&НаКлиенте
Процедура ДеревоТоваровХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтрокаТабличнойЧасти.ЦенаПоПрайсу = СтрокаТабличнойЧасти.Цена;
	РассчитатьСуммуСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровКоличествоПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Количество = 0;
		Возврат;
	КонецЕсли;
	
	ПроцентАвтоматическойСкидки = ПолучитьПроцентАвтоматическойСкидкиСервер(Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура, Элементы.ДеревоТоваров.ТекущиеДанные.Количество);
	Если НЕ ПроцентавтоматическойСкидки = 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОбИзмененииАвтоматическойСкидки",ЭтаФорма, Элементы.ДеревоТоваров.ТекущиеДанные), "Изменить скидку согласно настроек автоматических скидок?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ПослеИзмененияКоличестваТоваров(Элементы.ДеревоТоваров.ТекущиеДанные, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбИзмененииАвтоматическойСкидки(Результат, ТекущаяСтрока) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        ПослеИзмененияКоличестваТоваров(ТекущаяСтрока, Ложь);
	Иначе
		ПослеИзмененияКоличестваТоваров(ТекущаяСтрока, Истина);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияКоличестваТоваров(ТекущаяСтрока, Знач ПерезаполнитьСкидки = Истина)
	
	//проставим автоматическую скидку + скидку вида
	Если ПерезаполнитьСкидки Тогда
		ТекущаяСтрока.ПроцентСкидки = ПолучитьПроцентАвтоматическойСкидкиСервер(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Количество) + ПолучитьПроцентВидаСкидки();
	КонецЕсли;
	
	РассчитатьСуммуСтроки(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры = Неопределено, ЕдиницаИзмерения = Неопределено,
	//#12539 , Фактура = "", ЦветФактуры = "")
	Количество = 1)
												
	Возврат ЦеныКомпании.ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество,
												Объект.Дата, Объект.ЗаказДоговор.ВидЦен, Объект.ЗаказДоговор.Валюта, 												 
												Объект.Организация, Объект.Подразделение, 
												Объект.ЗаказДоговор.Контрагент, Объект.ЗаказДоговор.ДоговорКонтрагента);
												
КонецФункции

&НаСервере
Функция ПолучитьПроцентВидаСкидки(ВидСкидки = Неопределено)
	
	Если НЕ ВидСкидки = Неопределено Тогда
		Если ВидСкидки.Пустая() Тогда
			Возврат 0;
		Иначе
			Возврат ВидСкидки.Процент;
		КонецЕсли;
	КонецЕсли;

	Если Объект.ЗаказДоговор.ВидСкидки.Пустая() Тогда
		Возврат 0;
	Иначе
		Возврат Объект.ЗаказДоговор.ВидСкидки.Процент;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьВидаСкидки()
	
	Возврат Объект.ЗаказДоговор.ВидСкидки;
	
КонецФункции

&НаСервере
Функция ПолучитьПроцентАвтоматическойСкидкиСервер(Номенклатура,Количество)
	
	Скидка = 0;
	
	Если мИспользоватьАвтоматическиеСкидки Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияАвтоматическихСкидокСрезПоследних.КоличествоОт,
		|	ЗначенияАвтоматическихСкидокСрезПоследних.РазмерСкидки
		|ИЗ
		|	РегистрСведений.ЗначенияАвтоматическихСкидок.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЗначенияАвтоматическихСкидокСрезПоследних";
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда 
			Возврат Скидка;
		КонецЕсли;
		
		ТаблицаСкидок = РезультатЗапроса.Выгрузить();
		ТаблицаСкидок.Сортировать("КоличествоОт");
		Для Каждого Стр из ТаблицаСкидок Цикл
			Если Количество >= Стр.КоличествоОт Тогда 
				Скидка = Стр.РазмерСкидки;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
	Возврат Скидка;
	
	
КонецФункции

&НаКлиенте
Процедура ДеревоТоваровЕдиницаИзмеренияПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.ЕдиницаИзмерения = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровКоэффициентПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.Коэффициент = 0;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровБесплатноПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если ТекущиеДанные.Бесплатно Тогда
			ТекущиеДанные.Цена = 0;
			ТекущиеДанные.ПроцентСкидки = 0;
			ТекущиеДанные.СуммаСкидки = 0;
			ТекущиеДанные.Сумма = 0;
			ТекущиеДанные.СуммаНДС = 0;
			ПеренестиДеревоВТабличнуюЧасть();
			ПересчитатьСуммуДокумента();
		Иначе                            
			ТекущиеДанные.Цена = ПолучитьЦенуНоменклатуры(ТекущиеДанные.Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, ТекущиеДанные.ЕдиницаИзмерения);
			ТекущиеДанные.ПроцентСкидки = ПолучитьПроцентВидаСкидки() + ПолучитьПроцентАвтоматическойСкидкиСервер(ТекущиеДанные.Номенклатура, ТекущиеДанные.Количество);
			РассчитатьСуммуСтроки(Элементы.ДеревоТоваров.ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	РассчитатьСуммуНДСТабЧасти(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровНомерПотолкаПриИзменении(Элемент)
	
	//корневые строки редактировать нельзя
	Если Элементы.ДеревоТоваров.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ДеревоТоваров.ТекущиеДанные.НомерПотолка = "";
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомнату(Команда)
		
	Если ПереключательНаНазваниеКомнат Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКомнаты", ЭтотОбъект);
		ОткрытьФорму("Справочник.НазваниеКомнат.ФормаВыбора",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ДобавитьКомнатуЗавершение(Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКомнаты(Результат, ДопПараметры)  Экспорт
	
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;	
	ДобавитьКомнатуЗавершение(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомнатуЗавершение(НазваниеКомнаты)
	
	ИмяНовойКомнаты = ДобавитьКомнатуНаСервере(НазваниеКомнаты);
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам(); 
	РазвернутьДеревоТоваров(ИмяНовойКомнаты, ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	
КонецПроцедуры

&НаСервере
Функция ДобавитьКомнатуНаСервере(НазваниеКомнаты)
	
	//добавим комнату в товары
	НоваяСтрокаТовары = Объект.ТоварыУслуги.Добавить();
	НоваяСтрокаТовары.Комната = ПолучитьНаименованиеНовойКомнаты(НазваниеКомнаты);
	
	////добавим комнату в материалах
	//НоваяСтрокаМатериалы = Объект.Материалы.Добавить();
	//НоваяСтрокаМатериалы.Комната = НоваяСтрокаТовары.Комната;
	
	ПерестроитьДеревоНаФорме();
	
	Возврат НоваяСтрокаТовары.Комната;
	
КонецФункции

&НаСервере
Функция ПолучитьНаименованиеНовойКомнаты(НазваниеКомнаты)
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	
	ТаблицаНомеров = Новый ТаблицаЗначений;
	ТаблицаНомеров.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число"));	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НазваниеКомнат.Наименование КАК НазКомнаты
	|ИЗ
	|	Справочник.НазваниеКомнат КАК НазваниеКомнат";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Для Каждого ТекущаяСтрока Из Дерево.Строки Цикл
		НоваяСтрока = ТаблицаНомеров.Добавить();
		Попытка
			СтрокаЗамены = СтрЗаменить(ТекущаяСтрока.Комната, "Комната ", "");
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл
				Если Найти(СтрокаЗамены, Выборка.НазКомнаты) Тогда
					СтрокаЗамены = СтрЗаменить(СтрокаЗамены, " - " + Выборка.НазКомнаты, "");
					СтрокаЗамены = СтрЗаменить(СтрокаЗамены, Выборка.НазКомнаты, "");
					СтрокаЗамены = СтрЗаменить(СтрокаЗамены, " ", "");
				КонецЕсли;
			КонецЦикла;
			
			НоваяСтрока.Номер = Число(СтрокаЗамены);
			
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ТаблицаНомеров.Свернуть("Номер");
	ТаблицаНомеров.Сортировать("Номер Убыв");
	
	Если НЕ НазваниеКомнаты = Неопределено Тогда
		Если ТаблицаНомеров.Количество() > 0 Тогда
			Возврат "Комната " + СтрЗаменить(Строка(ТаблицаНомеров[0].Номер+1), Символ(160), "") + " - " + НазваниеКомнаты;
		Иначе
			Возврат "Комната 1" + " - " + НазваниеКомнаты;
		КонецЕсли;
	Иначе
		Если ТаблицаНомеров.Количество() > 0 Тогда
			Возврат "Комната " + СтрЗаменить(Строка(ТаблицаНомеров[0].Номер+1), Символ(160), "");
		Иначе
			Возврат "Комната 1";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам()
	
	//заполняем данные по остаткам на складах
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	
	ВремТаблицаТоваров = Объект.ТоварыУслуги.Выгрузить();
	ВремТаблицаТоваров.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, Коэффициент, НомерПотолка","Количество");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДокумента",		ВремТаблицаТоваров);
	Запрос.УстановитьПараметр("Организация",			Объект.Организация);
	Запрос.УстановитьПараметр("Склад",					ОбщийМодульСервер.НастройкаПользователя("СкладРозница"));
	Запрос.УстановитьПараметр("ЗаказДоговор",			Объект.ЗаказДоговор);
	Запрос.УстановитьПараметр("ИспользуютсяОбщиеСклады",Константы.ОбщиеСклады.Получить());
	Запрос.УстановитьПараметр("ИспользоватьРезервирование", Константы.ИспользоватьРезервирование.Получить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ТЗЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТЗЗаказПокупателяТовары.Количество КАК Количество,
	|	ТЗЗаказПокупателяТовары.Коэффициент КАК Коэффициент,
	|	ТЗЗаказПокупателяТовары.НомерПотолка КАК НомерПотолка
	|ПОМЕСТИТЬ ВремЗаказПокупателяТоварыДоп
	|ИЗ
	|	&ТаблицаДокумента КАК ТЗЗаказПокупателяТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремЗаказПокупателяТоварыДоп.Номенклатура КАК Номенклатура,
	|	ВремЗаказПокупателяТоварыДоп.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВремЗаказПокупателяТоварыДоп.Количество КАК Количество,
	|	ВремЗаказПокупателяТоварыДоп.Коэффициент КАК Коэффициент,
	|	ВремЗаказПокупателяТоварыДоп.НомерПотолка КАК НомерПотолка,
	|	ЕСТЬNULL(СправочникНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Потолок
	|ПОМЕСТИТЬ ВремЗаказПокупателяТовары
	|ИЗ
	|	ВремЗаказПокупателяТоварыДоп КАК ВремЗаказПокупателяТоварыДоп
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО (СправочникНоменклатура.Потолок_НомерРасчета = ВремЗаказПокупателяТоварыДоп.НомерПотолка)
	|			И (СправочникНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок))
	|			И (НЕ ВремЗаказПокупателяТоварыДоп.НомерПотолка = """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.Потолок КАК Потолок,
	|	ЕСТЬNULL(ЗаказыПоПотолкам.КоличествоПриход, 0) > 0 КАК ЕстьЗаказПокупателяПоПотолку,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|			ТОГДА ТоварыНаСкладахОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
	|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
	|	КОНЕЦ КАК ОстатокНаСкладе,
	|	ЕСТЬNULL(ВЫБОР		
	|		КОГДА &ИспользоватьРезервирование
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|						ТОГДА ВРезервеОстатки.КоличествоОстаток / ЗаказПокупателяТовары.Коэффициент
	|					ИНАЧЕ ВРезервеОстатки.КоличествоОстаток
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ, 0) КАК ВРезерве,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Коэффициент <> 0
	|			ТОГДА ЗаказПокупателяТовары.Количество - ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0) / ЗаказПокупателяТовары.Коэффициент
	|		ИНАЧЕ ЗаказПокупателяТовары.Количество - ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0)
	|	КОНЕЦ КАК КОтгрузке
	|ИЗ
	|	ВремЗаказПокупателяТовары КАК ЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ
	|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО ЗаказПокупателяТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Обороты(, , , ЗаказНаПроизводство = &ЗаказДоговор) КАК ЗаказыПокупателейОбороты
	|		ПО ЗаказПокупателяТовары.Номенклатура = ЗаказыПокупателейОбороты.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Обороты(, , , ЗаказНаПроизводство <> &ЗаказДоговор) КАК ЗаказыПоПотолкам
	|		ПО ЗаказПокупателяТовары.Потолок = ЗаказыПоПотолкам.Номенклатура
	|			И (НЕ ЗаказПокупателяТовары.Потолок = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(,
	|				Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ) КАК ВРезервеОстатки
	|		ПО (ЗаказПокупателяТовары.Номенклатура = ВРезервеОстатки.Номенклатура)
	|			И (ЗаказПокупателяТовары.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры)";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяСтрокаКомната Из Дерево.Строки Цикл
		Для Каждого ТекущаяСтрока Из ТекущаяСтрокаКомната.Строки Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",ТекущаяСтрока.Номенклатура);
			Отбор.Вставить("ХарактеристикаНоменклатуры",ТекущаяСтрока.ХарактеристикаНоменклатуры);
			НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, НайденныеСтроки[0],
					"КОтгрузке, ОстатокНаСкладе, ЕстьЗаказПокупателяПоПотолку, ВРезерве");
				ТекущаяСтрока.Доступно = ТекущаяСтрока.ОстатокНаСкладе - ТекущаяСтрока.ВРезерве;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказДоговор", Объект.ЗаказДоговор);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбеспечениеЗаказовРозницы.Комната КАК Комната,
	|	ОбеспечениеЗаказовРозницы.Номенклатура КАК Номенклатура,
	|	ОбеспечениеЗаказовРозницы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОбеспечениеЗаказовРозницы.КоличествоПоФакту) КАК Заказано
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказовРозницы КАК ОбеспечениеЗаказовРозницы
	|ГДЕ
	|	ОбеспечениеЗаказовРозницы.Заказ = &ЗаказДоговор
	|	И ОбеспечениеЗаказовРозницы.Назначение = ""Товары""
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбеспечениеЗаказовРозницы.Комната,
	|	ОбеспечениеЗаказовРозницы.Номенклатура,
	|	ОбеспечениеЗаказовРозницы.ХарактеристикаНоменклатуры";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() > 0 Тогда
		Для Каждого ТекущаяСтрокаКомната Из Дерево.Строки Цикл
			Для Каждого ТекущаяСтрока Из ТекущаяСтрокаКомната.Строки Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("Комната",ТекущаяСтрока.Комната);
				Отбор.Вставить("Номенклатура",ТекущаяСтрока.Номенклатура);
				Отбор.Вставить("ХарактеристикаНоменклатуры",ТекущаяСтрока.ХарактеристикаНоменклатуры);
				НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(ТекущаяСтрока, НайденныеСтроки[0]);			
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоТоваров(Комната = Неопределено, Номенклатура = Неопределено, ИдСтроки = Неопределено)
	
	Если Номенклатура = Неопределено Тогда
		Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	Если Комната = Неопределено Тогда
		Комната = "";
	КонецЕсли;
	
	КоллекцияЭлементовДерева = ЭтаФорма.ДеревоТоваров.ПолучитьЭлементы();
	Если НЕ ИдСтроки = Неопределено Тогда
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Элементы.ДеревоТоваров.Развернуть(ИдентификаторСтроки, Истина);
		КонецЦикла;	
		Элементы.ДеревоТоваров.ТекущаяСтрока = ИдСтроки;
	Иначе		
		ИдТекущейСтроки = Неопределено;
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Для Каждого СтрокаВКомнате Из Строка.ПолучитьЭлементы() Цикл
				Если СтрокаВКомнате.Комната = Комната И СтрокаВКомнате.Номенклатура = Номенклатура Тогда
					ИдТекущейСтроки = СтрокаВКомнате.ПолучитьИдентификатор();
				КонецЕсли;
			КонецЦикла;
			// для случаев добавления новой комнаты / переименования
			Если Строка.Комната = Комната И (Строка.ПолучитьЭлементы().Количество() = 0 ИЛИ Номенклатура = Неопределено ИЛИ Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка")) Тогда
				ИдТекущейСтроки = ИдентификаторСтроки;			
			КонецЕсли;
			Элементы.ДеревоТоваров.Развернуть(ИдентификаторСтроки, Истина);
		КонецЦикла;
		Элементы.ДеревоТоваров.ТекущаяСтрока = ИдТекущейСтроки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТоваров.ТекущиеДанные;
	Если НЕ ОбщийМодульКлиент.Розница_КомнатаЗаполнена(ТекущиеДанные) Тогда
		ПоказатьОповещениеПользователя("Выберите комнату");
		Возврат;
	КонецЕсли;
	
	СтрокаКомнаты = ТекущиеДанные;
	Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда	
		СтрокаКомнаты = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	ИдКомнаты = СтрокаКомнаты.ПолучитьИдентификатор();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораНоменклатуры", ЭтотОбъект, ИдКомнаты);
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ТипДокумента",		"ЗаказДоговор");
	ПараметрыПодбора.Вставить("Назначение",			"Товары");
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыПодбора,,,,,ОписаниеОповещения);
		
	Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНоменклатуры(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
		
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ДобавленнаяСтрока = ДобавитьНоменклатуруВДеревоТоваровКлиент(ВыбранноеЗначение.Номенклатура, ВыбранноеЗначение.Количество, ДополнительныеПараметры);
	Иначе
		// ДополнительныеПараметры = Имя комнаты
		ДобавленнаяСтрока = ДобавитьНоменклатуруВДеревоТоваровКлиент(ВыбранноеЗначение, , ДополнительныеПараметры)
	КонецЕсли;
	
	ПеренестиДеревоВТабличнуюЧасть();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	
	//РассчитатьИтоговыеПоказателиКлиент();
	
	Если НЕ ДобавленнаяСтрока = Неопределено Тогда
		ОбновитьОтображениеЭлементовФормы(ДобавленнаяСтрока.Комната, ДобавленнаяСтрока.Номенклатура);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораНоменклатурыНаСервере(ВыбЗнач, ДопПараметры)
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Если Строка.Комната = ДопПараметры Тогда
			Стр = Строка.Строки.Добавить();
			Стр.Номенклатура = ВыбЗнач;
			Стр.Комната = ДопПараметры;
			
			СтруктураДанные = Новый Структура;
			СтруктураДанные.Вставить("Номенклатура", Стр.Номенклатура);
			СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);			
			ЗаполнитьЗначенияСвойств(Стр, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяДоходов");

			Стр.Количество = 1;
			Стр.Цена = ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Стр.ХарактеристикаНоменклатуры, Стр.ЕдиницаИзмерения);
			Стр.ПроцентСкидки = ПолучитьПроцентВидаСкидки() + ПолучитьПроцентАвтоматическойСкидкиСервер(Стр.Номенклатура, Стр.Количество);
			Стр.ЦенаПоПрайсу = Стр.Цена;
			РассчитатьСуммуСтрокиНаСервере(Стр);
			
			ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
			Возврат;
		КонецЕсли
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьНоменклатуруВДеревоТоваровКлиент(Номенклатура, Количество = 1, ИдКомнаты)
	
	СтрокаКомнаты = ДеревоТоваров.НайтиПоИдентификатору(ИдКомнаты);	
	СтрокиНоменклатуры = СтрокаКомнаты.ПолучитьЭлементы();
			
	СтрокаТабличнойЧасти = СтрокиНоменклатуры.Добавить();
	СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
	СтрокаТабличнойЧасти.Комната = СтрокаКомнаты.Комната;
	
	СтруктураДанные = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ВидСпецификации, Количество, ВидСкидки", 
									СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, ВидСпецификацииПоУмолчанию, Количество, ПолучитьВидаСкидки());
	СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, Количество, ВидНоменклатуры");
	
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Цена, ЦенаПоПрайсу, ПроцентСкидки"); 
	
	РассчитатьСуммуСтроки(СтрокаТабличнойЧасти);
	
	Элементы.ДеревоТоваров.ТекущаяСтрока = СтрокаТабличнойЧасти.ПолучитьИдентификатор();
	
	Возврат СтрокаТабличнойЧасти;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("Цена", ПолучитьЦенуНоменклатуры(СтруктураДанные.Номенклатура, СтруктураДанные.ХарактеристикаНоменклатуры, СтруктураДанные.ЕдиницаИзмерения));
	СтруктураДанные.Вставить("ПроцентСкидки", ПолучитьПроцентВидаСкидки(СтруктураДанные.ВидСкидки));
	СтруктураДанные.Вставить("ЦенаПоПрайсу", СтруктураДанные.Цена);
	
	Возврат СтруктураДанные;
	
КонецФункции


&НаСервере
Процедура РассчитатьСуммуСтрокиНаСервере(ТекущаяСтрока = Неопределено)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = Элементы.ТоварыУслуги.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущаяСтрока.ПроцентСкидки = 100 Тогда
		ТекущаяСтрока.Сумма = 0;
		ТекущаяСтрока.СуммаСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	Иначе
		Если НЕ ТекущаяСтрока.ПроцентСкидки = 0 Тогда
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * (1 - ТекущаяСтрока.ПроцентСкидки / 100);
			ТекущаяСтрока.СуммаСкидки = (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена) - ТекущаяСтрока.Сумма;
		Иначе
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			ТекущаяСтрока.СуммаСкидки = 0;
		КонецЕсли;
	КонецЕсли;
	ТекущаяСтрока.СуммаПоПрайсу = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаПоПрайсу;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуДерева(ДеревоПоиска, Комната, Номенклатура, Характеристика = Неопределено, ЕдиницаИзмерения = Неопределено)
	
	ЭлементыДерева = ДеревоПоиска.ПолучитьЭлементы();
	Для Каждого ТекЭлемент из ЭлементыДерева Цикл
		ПодчиненныеСтроки = ТекЭлемент.ПолучитьЭлементы();
		Для Каждого ПодчиненыйЭлемент Из ПодчиненныеСтроки Цикл
			Если СокрЛП(ПодчиненыйЭлемент.Комната) = СокрЛП(Комната)
				и ПодчиненыйЭлемент.Номенклатура = Номенклатура
				//Добавлено услове по ед. измерения и характестики при добавлении по ШК
				И (?(Характеристика = Неопределено, Истина, ПодчиненыйЭлемент.ХарактеристикаНоменклатуры = Характеристика И ПодчиненыйЭлемент.ЕдиницаИзмерения = ЕдиницаИзмерения))
			Тогда
				Возврат ПодчиненыйЭлемент;
			КонецеСли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ЗапретРедактированияЦен()
	Возврат ОбщийМодульСервер.НастройкаПользователя("ДополнительныеПраваЗапретРедактированияЦенВДокументах");	
КонецФункции

&НаКлиенте
Процедура ПодобратьНоменклатуру(Команда)
	
	Если Элементы.ДеревоТоваров.ТекущиеДанные <> Неопределено  Тогда
		Если Не ПустаяСтрока(Элементы.ДеревоТоваров.ТекущиеДанные.Комната) Тогда
			ПараметрыПодбора = Новый Структура;
			ПараметрыПодбора.Вставить("Дата",				Объект.Дата);
			ПараметрыПодбора.Вставить("Организация",		Объект.Организация);
			ПараметрыПодбора.Вставить("ВидЦены",			ПолучитьВидЦенПоДоговору());
			ПараметрыПодбора.Вставить("ТипДокумента",		"ЗаказДоговор");
			ПараметрыПодбора.Вставить("Назначение",			"Товары");
			ПараметрыПодбора.Вставить("ЗапретРедактированияЦен",ЗапретРедактированияЦен());
			ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
		Иначе
			ПоказатьОповещениеПользователя("Выберите комнату");
		КонецЕсли;	
	Иначе
		ПоказатьОповещениеПользователя("Выберите комнату");	
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидЦенПоДоговору()
	Возврат Объект.ЗаказДоговор.ВидЦен;
КонецФункции	

&НаСервере
Процедура ОбработатьПодборНаСервере(ВыбранноеЗначение, ТекущаяКомната)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Если Строка.Комната = ТекущаяКомната Тогда
			Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
				СтрокаТабличнойЧасти = Строка.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ТекущаяСтрока);
				
				СтруктураДанные = Новый Структура("Номенклатура, ВидСпецификации", СтрокаТабличнойЧасти.Номенклатура, ВидСпецификацииПоУмолчанию);
				СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ВидНоменклатуры");

				СтрокаТабличнойЧасти.Комната = ТекущаяКомната;
				СтрокаТабличнойЧасти.ПроцентСкидки = ПолучитьПроцентВидаСкидки();
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаТабличнойЧасти.Номенклатура) Тогда
					СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
				КонецЕсли;	
				СтрокаТабличнойЧасти.ЦенаПоПрайсу = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
				РассчитатьСуммуСтрокиНаСервере(СтрокаТабличнойЧасти);
			КонецЦикла;
			
			ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ТекущаяСтрока = Элементы.ДеревоТоваров.ТекущиеДанные;
	ТекущаяКомната = ТекущаяСтрока.Комната;
	
	ОбработатьПодборНаСервере(ВыбранноеЗначение, ТекущаяКомната);
	ПеренестиДеревоВТабличнуюЧасть();
	ЗаполнитьДанныеКОтгрузкеИОстаткиПоТоварам();
	РазвернутьДеревоТоваров();
	ОбновитьОтображениеЭлементовФормы(ТекущаяКомната, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуНаПотолок(Команда)
	
	Если ДеревоТоваров.ПолучитьЭлементы().Количество() > 0 Тогда
		УстановитьСкидку = 0;
		ПараметрыПроцедуры = Новый Структура;
		ПараметрыПроцедуры.Вставить("Предмет","Потолок");
		ОП = Новый ОписаниеОповещения("ПроцедураПослеВВодаСкидки", ЭтаФорма, ПараметрыПроцедуры);
		ПоказатьВводЗначения(ОП, УстановитьСкидку, "Введите % скидки на полотно");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуНаУслуги(Команда)
	
	Если ДеревоТоваров.ПолучитьЭлементы().Количество() > 0 Тогда
		УстановитьСкидку = 0;
		ПараметрыПроцедуры = Новый Структура;
		ПараметрыПроцедуры.Вставить("Предмет","Услуги");
		ОП = Новый ОписаниеОповещения("ПроцедураПослеВВодаСкидки", ЭтаФорма, ПараметрыПроцедуры);
		ПоказатьВводЗначения(ОП, УстановитьСкидку, "Введите % скидки на услуги");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСкидкуТовары(Команда)
	
	Если ДеревоТоваров.ПолучитьЭлементы().Количество() > 0 Тогда
		УстановитьСкидку = 0;
		ПараметрыПроцедуры = Новый Структура;
		ПараметрыПроцедуры.Вставить("Предмет","Товары");
		ОП = Новый ОписаниеОповещения("ПроцедураПослеВВодаСкидки", ЭтаФорма, ПараметрыПроцедуры);
		ПоказатьВводЗначения(ОП, УстановитьСкидку, "Введите % скидки на товары");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцедураПослеВВодаСкидки(ВыбЗнач, Параметры) Экспорт
	
	ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
	ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
	
	ПроцедураПослеВВодаСкидкиНаСервере(ВыбЗнач, Параметры);
	ПеренестиДеревоВТабличнуюЧасть();
	Состояние("Скидка установлена");
	
	ОбновитьОтображениеЭлементовФормы(ТекущаяКомната, ТекущаяНоменклатура);
	
КонецПроцедуры

&НаСервере
Процедура ПроцедураПослеВВодаСкидкиНаСервере(ВыбЗнач, Параметры)
	
	Если ВыбЗнач<>Неопределено Тогда
		Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
		Предмет = "";
		Если Параметры.Свойство("Предмет",Предмет) Тогда
			Если Предмет = "Товары" Тогда
				Для Каждого ТекСтрокаДерева Из Дерево.Строки Цикл
					Для Каждого ТекущаяСтрока Из ТекСтрокаДерева.Строки Цикл
						Если ЭтоТовар(ТекущаяСтрока.Номенклатура) Тогда
							ТекущаяСтрока.ПроцентСкидки = ВыбЗнач;
							РассчитатьСуммуСтрокиНаСервере(ТекущаяСтрока);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			ИначеЕсли Предмет = "Услуги" Тогда
				Для Каждого ТекСтрокаДерева Из Дерево.Строки Цикл
					Для Каждого ТекущаяСтрока Из ТекСтрокаДерева.Строки Цикл
						Если ЭтоУслуга(ТекущаяСтрока.Номенклатура) Тогда
							ТекущаяСтрока.ПроцентСкидки = ВыбЗнач;
							РассчитатьСуммуСтрокиНаСервере(ТекущаяСтрока);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			ИначеЕсли Предмет = "Потолок" Тогда
				Для Каждого ТекСтрокаДерева Из Дерево.Строки Цикл
					Для Каждого ТекущаяСтрока Из ТекСтрокаДерева.Строки Цикл
						Если ЭтоПотолок(ТекущаяСтрока.Номенклатура) Тогда
							ТекущаяСтрока.ПроцентСкидки = ВыбЗнач;
							РассчитатьСуммуСтрокиНаСервере(ТекущаяСтрока);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭтоТовар(Номенклатура)
	Если Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ЭтоУслуга(Номенклатура)
	Если Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ЭтоПотолок(Номенклатура)
	Возврат Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Номенклатура);
КонецФункции

&НаКлиенте
Процедура ОчиститьСкидки(Команда)
	
	ОчиститьСкидкиНаСервере();
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСкидкиНаСервере()
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Для Каждого СтрНоменклатура из Строка.Строки Цикл
			СтрНоменклатура.ПроцентСкидки = 0;
			РассчитатьСуммуСтрокиНаСервере(СтрНоменклатура);
		КонецЦикла;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	ПеренестиДеревоВТабличнуюЧасть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМатериал(Команда)
	
	Если СписокКомнат.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя("В табличной части ""Товары и услуги"" не определены комнаты.");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", новый Структура("ДоступныеЗначения", СписокКомнат), ЭтотОбъект,,,, новый ОписаниеОповещения("ПослеВыбораКомнатыПриДобавленииМатериала", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКомнатыПриДобавленииМатериала(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ВыбранноеЗначение) Тогда
		ПараметрыПодбора = Новый Структура;
		ПараметрыПодбора.Вставить("ТипДокумента",		"ЗаказДоговор");
		ПараметрыПодбора.Вставить("Назначение",			"Материалы");
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("ПослеВыбораНоменклатурыМатериала", ЭтотОбъект, ВыбранноеЗначение));
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораНоменклатурыМатериала(ВыбЗнач, ДопПараметры) Экспорт
	
	Если НЕ ВыбЗнач = Неопределено Тогда
		ДобавитьМатериалНаСервере(ВыбЗнач, ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьМатериалНаСервере(НоменклатураМатериала, Комната)
	
	СтрокаТабличнойЧасти = Объект.Материалы.Добавить();
	СтрокаТабличнойЧасти.Номенклатура = НоменклатураМатериала;
	СтрокаТабличнойЧасти.Комната = Комната;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура, Количество", СтрокаТабличнойЧасти.Номенклатура, 1);
	СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, Количество");
		
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьМатериалы(Команда)
	
	Если СписокКомнат.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя("В табличной части ""Товары и услуги"" не определены комнаты.");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", новый Структура("ДоступныеЗначения", СписокКомнат), ЭтотОбъект,,,, новый ОписаниеОповещения("ПослеВыбораКомнатыПриПодбореМатериала", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКомнатыПриПодбореМатериала(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ВыбранноеЗначение) Тогда
		
		ПараметрыПодбора = Новый Структура;
		ПараметрыПодбора.Вставить("Организация",		Объект.Организация);
		ПараметрыПодбора.Вставить("ВидЦены",			ПолучитьВидЦенПоДоговору());
		ПараметрыПодбора.Вставить("ТипДокумента",		"ЗаказДоговор");
		ПараметрыПодбора.Вставить("Назначение",			"Материалы");
		
		ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора,,,,, новый ОписаниеОповещения("ПослеПодбораМатериалов", ЭтотОбъект, ВыбранноеЗначение));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбораМатериалов(ВозвращенноеЗначение, Комната) Экспорт
	
	Если НЕ ВозвращенноеЗначение = Неопределено Тогда
		ОбработатьПодборМатериаловНаСервере(ВозвращенноеЗначение, Комната);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборМатериаловНаСервере(ВозвращенноеЗначение, ТекущаяКомната)
	
	Для Каждого ТекущаяСтрока из ВозвращенноеЗначение Цикл
		Стр = Объект.Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, ТекущаяСтрока);
		Стр.Комната = ТекущаяКомната;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереименоватьКомнату(Команда)
	
	ТекущееНаименование = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
	
	ПараметрыПереименования = Новый Структура;
	ПараметрыПереименования.Вставить("СтароеНаименование",ТекущееНаименование);
	
	ПослеВводаНовогоНаименованияКомнаты = Новый ОписаниеОповещения("ПослеВводаНовогоНаименованияКомнаты",ЭтаФорма,ПараметрыПереименования);
	ПоказатьВводСтроки(ПослеВводаНовогоНаименованияКомнаты,ТекущееНаименование,"Введите название комнаты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНовогоНаименованияКомнаты(Строка, Параметры) Экспорт
	
	Если НЕ Строка = Неопределено Тогда
        //проверим на наличие такого наименования
		ПараметрыПереименования = Новый Структура;
		ПараметрыПереименования.Вставить("НовоеНаименование",Строка);
		ПараметрыПереименования.Вставить("СтароеНаименование",Параметры.СтароеНаименование);
		
		Отбор = Новый Структура("Комната", Строка);
		НайденныеСтроки = Объект.ТоварыУслуги.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ПереименоватьКомнатуПодтверждение = Новый ОписаниеОповещения("ПереименоватьКомнатуПодтверждение", ЭтаФорма, ПараметрыПереименования);
			ПоказатьВопрос(ПереименоватьКомнатуПодтверждение,"В документе уже есть комната """+Строка+""""+Символы.ПС
			+"Если присвоить такое же наименование, все товары текущей комнаты будут добавлены к существующей."
			+Символы.ПС+"Продолжить?",РежимДиалогаВопрос.ДаНет)
		Иначе
			ПереименоватьКомнатуПодтверждение(КодВозвратаДиалога.Да, ПараметрыПереименования);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереименоватьКомнатуПодтверждение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	ПереименоватьКомнатуПодтверждениеНаСервере(Параметры);
	РазвернутьДеревоТоваров(Параметры.НовоеНаименование, );
	
КонецПроцедуры

&НаСервере
Процедура ПереименоватьКомнатуПодтверждениеНаСервере(Параметры) Экспорт
	
	//товары и услуги
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого ТекущаяСтрокаДерева Из Дерево.Строки Цикл
		Если ТекущаяСтрокаДерева.Комната = Параметры.СтароеНаименование Тогда
			ТекущаяСтрокаДерева.Комната = Параметры.НовоеНаименование;
		КонецЕсли;
		Для Каждого ТекущаяСтрока Из ТекущаяСтрокаДерева.Строки Цикл
			Если ТекущаяСтрока.Комната = Параметры.СтароеНаименование Тогда
				ТекущаяСтрока.Комната = Параметры.НовоеНаименование;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
	
	//материалы
	Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
		Если ТекущаяСтрока.Комната = Параметры.СтароеНаименование Тогда
			ТекущаяСтрока.Комната = Параметры.НовоеНаименование;
		КонецЕсли;
	КонецЦикла;
	
	ПеренестиДеревоВТабличнуюЧасть();
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДругуюКомнату(Команда)
	ТекущаяНоменклатура = Элементы.ДеревоТоваров.ТекущиеДанные.Номенклатура;
	ТекущаяКомната = Элементы.ДеревоТоваров.ТекущиеДанные.Комната;
	Если ТекущаяНоменклатура.Пустая() Тогда
		ПоказатьПредупреждение(,"Выберите товар или услугу комнаты, который нужно перенести");
	Иначе
		СписокКомнат = ПолучитьСписокКомнат();
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ТекущаяНоменклатура",ТекущаяНоменклатура);
		ДопПараметры.Вставить("ТекущаяКомната",ТекущаяКомната);
		
		ПеренестиВДругуюКомнатуПодтверждение = Новый ОписаниеОповещения("ПеренестиВДругуюКомнатуПодтверждение",ЭтаФорма,ДопПараметры);
		СписокКомнат.ПоказатьВыборЭлемента(ПеренестиВДругуюКомнатуПодтверждение,"Выберите комнату");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКомнат()
	
	СписокКомнат = Новый СписокЗначений;
	
	Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
	Для Каждого ТекущаяСтрокаДерева Из Дерево.Строки Цикл
		Если СписокКомнат.НайтиПоЗначению(ТекущаяСтрокаДерева.Комната) = Неопределено Тогда
			СписокКомнат.Добавить(ТекущаяСтрокаДерева.Комната);
		КонецЕсли;
		Для Каждого ТекущаяСтрока Из ТекущаяСтрокаДерева.Строки Цикл
			Если СписокКомнат.НайтиПоЗначению(ТекущаяСтрока.Комната) = Неопределено Тогда
				СписокКомнат.Добавить(ТекущаяСтрока.Комната);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокКомнат;
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВДругуюКомнатуПодтверждение(ВыбранныйЭлемент, СписокПараметров) Экспорт
    Если ВыбранныйЭлемент <> Неопределено Тогда
       ПеренестиВДругуюКомнатуПодтверждениеНаСервере(ВыбранныйЭлемент.Значение, СписокПараметров);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПеренестиВДругуюКомнатуПодтверждениеНаСервере(ВыбранныйЭлемент, СписокПараметров)
    Если ВыбранныйЭлемент <> Неопределено Тогда
		Дерево = ДанныеФормыВЗначение(ДеревоТоваров, Тип("ДеревоЗначений"));
		
		//Нужно найти родителя
		РодительНовойКомнаты = Неопределено;
		Для Каждого ТекущаяСтрокаДерева Из Дерево.Строки Цикл
			Если ТекущаяСтрокаДерева.Комната = ВыбранныйЭлемент Тогда 
				РодительНовойКомнаты = ТекущаяСтрокаДерева;
			КонецЕсли;
		КонецЦикла;
		
		Если РодительНовойКомнаты = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрокаДерева Из Дерево.Строки Цикл
			Для Каждого ТекущаяСтрока Из ТекущаяСтрокаДерева.Строки Цикл
				Если (ТекущаяСтрока.Комната = СписокПараметров.ТекущаяКомната)
					и (ТекущаяСтрока.Номенклатура = СписокПараметров.ТекущаяНоменклатура) Тогда
					
					ТекущаяСтрока.Комната = ВыбранныйЭлемент;												
					НоваяСтрока = РодительНовойКомнаты.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
					
					ТекущаяСтрокаДерева.Строки.Удалить(ТекущаяСтрока);
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
			
		ЗначениеВДанныеФормы(Дерево, ДеревоТоваров);
		ПеренестиДеревоВТабличнуюЧасть();
		Модифицированность = Истина;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДобавитьПотолок(Команда)
	
	СписокПотолковДоговора = ПолучитьСписокПотолковДоговора();
	
	Если СписокПотолковДоговора.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя("В договоре не найдены потолки.");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", новый Структура("ДоступныеЗначения", СписокПотолковДоговора),,,,, новый ОписаниеОповещения("ПослеВыбораПотолкаДоговора", ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПотолковДоговора()
	
	КВозврату = новый СписокЗначений;
	
	Для Каждого ТекущаяСтрока Из Объект.ЗаказДоговор.ТоварыУслуги Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			КВозврату.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Возврат КВозврату;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораПотолкаДоговора(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПослеВыбораПотолкаДоговораНаСервере(ВыбранноеЗначение);
	ПерестроитьДеревоНаФорме();
	РазвернутьДеревоТоваров();
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораПотолкаДоговораНаСервере(ВыбранноеЗначение)
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение.Потолок_НомерРасчета) Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтрокиВДоговоре = Объект.ЗаказДоговор.ТоварыУслуги.НайтиСтроки(новый Структура("НомерПотолка", ВыбранноеЗначение.Потолок_НомерРасчета));
	
	Для Каждого ТекущаяСтрока Из НайденныеСтрокиВДоговоре Цикл
		НоваяСтрока = Объект.ТоварыУслуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура РассчитатьИтоговыеПоказателиКлиент(ФормаТолькоПросмотр = Ложь) Экспорт
	//#7556
		
	ИтогСумма = 0;
	ИтогСуммаБезСкидки = 0;
	ИтогСуммаПоПрайсу = 0;
	ИтогСуммаНДС = 0;
	ИтогСуммаСкидки = 0;
	ИтогКоличествоКомнат = 0;
	
	ИтогКоличествоПотолков = 0; // реквизит формы
	ИтогПлощадьПотолков = 0; // реквизит формы
	
	ЭлементыДерева = ДеревоТоваров.ПолучитьЭлементы();
	ИтогКоличествоКомнат = ЭлементыДерева.Количество();
	
	Для Каждого СтрокаКомнаты из ЭлементыДерева Цикл
		
		СуммаПоКомнате = 0;
		СуммаПоПрайсуКомнате = 0;
		ИтогБесплатноПоКомнате = 0;
		ИтогПлатноПоКомнате = 0;
		
		Для Каждого СтрокаТовара Из СтрокаКомнаты.ПолучитьЭлементы() Цикл
			ИтогСумма = ИтогСумма + СтрокаТовара.Сумма;
			ИтогСуммаБезСкидки = ИтогСуммаБезСкидки + СтрокаТовара.Количество * СтрокаТовара.Цена;
			ИтогСуммаПоПрайсу = ИтогСуммаПоПрайсу + СтрокаТовара.СуммаПоПрайсу;
			ИтогСуммаНДС = ИтогСуммаНДС + СтрокаТовара.СуммаНДС;
			ИтогСуммаСкидки = ИтогСуммаСкидки + СтрокаТовара.СуммаСкидки;			
			Если ЗначениеЗаполнено(СтрокаТовара.Номенклатура) И ОбщийМодульВызовСервера.ЭтоНоменклатураПотолкаРозницы(СтрокаТовара.Номенклатура) Тогда
				ИтогКоличествоПотолков = ИтогКоличествоПотолков + 1; 
				ИтогПлощадьПотолков = ИтогПлощадьПотолков + СтрокаТовара.Количество;	
			КонецЕсли;
			
			СуммаПоКомнате = СуммаПоКомнате + СтрокаТовара.Сумма;
			СуммаПоПрайсуКомнате = СуммаПоПрайсуКомнате + СтрокаТовара.СуммаПоПрайсу;			
			ИтогБесплатноПоКомнате = ИтогБесплатноПоКомнате + ?(СтрокаТовара.Бесплатно, 1, 0);
			ИтогПлатноПоКомнате    = ИтогПлатноПоКомнате    + ?(СтрокаТовара.Бесплатно, 0, 1);
		КонецЦикла;
		
		СтрокаКомнаты.Сумма = СуммаПоКомнате;
		СтрокаКомнаты.СуммаПоПрайсу = СуммаПоПрайсуКомнате;
		СтрокаКомнаты.Бесплатно = (ИтогБесплатноПоКомнате > 0 И ИтогПлатноПоКомнате = 0);
	КонецЦикла;
	ИтогОтклонениеОтПрайса = ИтогСумма - ИтогСуммаПоПрайсу; //как в отчете по эффективностям
	
	Если НЕ ФормаТолькоПросмотр Тогда
		//Если Объект.КоличествоКомнат <> ИтогКоличествоКомнат Тогда
		//	Объект.КоличествоКомнат = ИтогКоличествоКомнат;
		//	Модифицированность = Истина;
		//КонецЕсли;
		
		Если Объект.СуммаДокумента <> ИтогСумма Тогда 
			Объект.СуммаДокумента = ИтогСумма;
			Модифицированность = Истина;
		КонецЕсли;
		//Если Объект.СуммаДокументаПоПрайсу <> ИтогСуммаПоПрайсу Тогда
		//	Объект.СуммаДокументаПоПрайсу = ИтогСуммаПоПрайсу;
		//	Модифицированность = Истина;
		//КонецЕсли;
		//Если Объект.ОтклонениеОтПрайса <> ИтогОтклонениеОтПрайса Тогда
		//	Объект.ОтклонениеОтПрайса = ИтогОтклонениеОтПрайса;
		//	Модифицированность = Истина;
		//КонецЕсли;
		//Если Объект.СуммаСкидки <> ИтогСуммаСкидки Тогда
		//	Объект.СуммаСкидки = ИтогСуммаСкидки;
		//	Объект.ПроцентСкидки = ИтогСуммаСкидки;
		//	Если ИтогСуммаБезСкидки <> 0 Тогда
		//		Объект.ПроцентСкидки = Окр(100*ИтогСуммаСкидки / (ИтогСуммаБезСкидки), 2);
		//	Иначе
		//		Объект.ПроцентСкидки = 0;
		//	КонецЕсли;
		//	Модифицированность = Истина;
		//КонецЕсли;
	КонецЕсли;

	СуммаНДС = ИтогСуммаНДС;	
	//Если УчитыватьНДС Тогда
	//	Элементы.ИтогиВсегоНДС.Заголовок = Формат(ИтогСуммаНДС, "ЧРГ=; ЧН=0,00");
	//КонецЕсли;
		
КонецПроцедуры


