
Функция Печать() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИА_ФинансовоеПланирование_ФП1";
	
	Макет = ПолучитьМакет("ФП1");
	
	РазделениеНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	
	ДатаНачалаОтчета =  ?(СсылкаНаОбъект.НачалоПланирования,СсылкаНаОбъект.Дата,СсылкаНаОбъект.Дата + 60*60*24);
																	 
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапка.Параметры.Номер = Число(Прав(СсылкаНаОбъект.Номер,5));
	
	ОблШапка.Параметры.ДатаНачала = Формат(ДатаНачалаОтчета, "ДФ='dd MMMM yyyy ""г.""'");    
	ОблШапка.Параметры.ДатаКонца = Формат(ДатаНачалаОтчета + 60*60*24*6 , "ДФ='dd MMMM yyyy ""г.""'");
	
	ТабДокумент.Вывести(ОблШапка);
	
	ОблШапкаПФ = Макет.ПолучитьОбласть("ШапкаТаблицы|ПодразделениеФонд");
	ОблШапкаСумма = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
	ТабДокумент.Вывести(ОблШапкаПФ);
	
	
	Если РазделениеНалБезнал Тогда
		ОблШапкаСумма.Параметры.НалБезнал = "нал";
		ТабДокумент.Присоединить(ОблШапкаСумма);
		
		ОблШапкаСумма.Параметры.НалБезнал = "нал (в месяц)";
		ТабДокумент.Присоединить(ОблШапкаСумма);

		ОблШапкаСумма.Параметры.НалБезнал = "безнал" ;
		ТабДокумент.Присоединить(ОблШапкаСумма);
		
		ОблШапкаСумма.Параметры.НалБезнал = "безнал (в месяц)";
		ТабДокумент.Присоединить(ОблШапкаСумма);
	Иначе
		ТабДокумент.Присоединить(ОблШапкаСумма);
		ОблШапкаСумма.Параметры.НалБезнал = "(в месяц)";
		ТабДокумент.Присоединить(ОблШапкаСумма);
	КонецЕсли;
	
	
	ОблСтрокаПФ = Макет.ПолучитьОбласть("Строка|ПодразделениеФонд");
	ОблСтрокаИтого = Макет.ПолучитьОбласть("СтрокаИтог|ПодразделениеФонд");
	ОблСтрокаСумма = Макет.ПолучитьОбласть("Строка|Сумма");
	ОблСтрокаСуммаИтого = Макет.ПолучитьОбласть("СтрокаИтог|Сумма");
	
	Для каждого стр из СсылкаНаОбъект.ФП1 Цикл
		ОблСтрокаПФ.Параметры.Заполнить(стр) ;
		ТабДокумент.Вывести(ОблСтрокаПФ);
		
		Если РазделениеНалБезнал Тогда
			ОблСтрокаСумма.Параметры.Сумма = Формат(стр.СуммаНал,"ЧЦ=15; ЧДЦ=2") ;
			ТабДокумент.Присоединить(ОблСтрокаСумма);
			
			ОблСтрокаСумма.Параметры.Сумма = Формат(стр.СуммаНалМесяц,"ЧЦ=15; ЧДЦ=2") ;
			ТабДокумент.Присоединить(ОблСтрокаСумма);
			
			ОблСтрокаСумма.Параметры.Сумма = Формат(стр.СуммаБезнал,"ЧЦ=15; ЧДЦ=2") ;
			ТабДокумент.Присоединить(ОблСтрокаСумма);
			
			ОблСтрокаСумма.Параметры.Сумма = Формат(стр.СуммаБезналМесяц,"ЧЦ=15; ЧДЦ=2") ;
			ТабДокумент.Присоединить(ОблСтрокаСумма);
		Иначе
			ОблСтрокаСумма.Параметры.Сумма = Формат(стр.СуммаБезнал,"ЧЦ=15; ЧДЦ=2");
			ТабДокумент.Присоединить(ОблСтрокаСумма);
			
			ОблСтрокаСумма.Параметры.Сумма = Формат(стр.СуммаБезналМесяц,"ЧЦ=15; ЧДЦ=2");
			ТабДокумент.Присоединить(ОблСтрокаСумма);
		КонецЕсли;		
		
	КонецЦикла;
	
	// ИТОГИ
	ТабДокумент.Вывести(ОблСтрокаИтого);
	Если РазделениеНалБезнал Тогда
		ОблСтрокаСуммаИтого.Параметры.Сумма = Формат(СсылкаНаОбъект.ФП1.Итог("СуммаНал"),"ЧЦ=15; ЧДЦ=2") ;
		ТабДокумент.Присоединить(ОблСтрокаСуммаИтого);
		ОблСтрокаСуммаИтого.Параметры.Сумма = Формат(СсылкаНаОбъект.ФП1.Итог("СуммаНалМесяц"),"ЧЦ=15; ЧДЦ=2") ;
		ТабДокумент.Присоединить(ОблСтрокаСуммаИтого);
		
		ОблСтрокаСуммаИтого.Параметры.Сумма = Формат(СсылкаНаОбъект.ФП1.Итог("СуммаБезнал"),"ЧЦ=15; ЧДЦ=2") ;
		ТабДокумент.Присоединить(ОблСтрокаСуммаИтого);
		ОблСтрокаСуммаИтого.Параметры.Сумма = Формат(СсылкаНаОбъект.ФП1.Итог("СуммаБезналМесяц"),"ЧЦ=15; ЧДЦ=2") ;
		ТабДокумент.Присоединить(ОблСтрокаСуммаИтого);
	Иначе
		ОблСтрокаСуммаИтого.Параметры.Сумма = Формат(СсылкаНаОбъект.ФП1.Итог("СуммаБезнал"),"ЧЦ=15; ЧДЦ=2");
		ТабДокумент.Присоединить(ОблСтрокаСуммаИтого);
		ОблСтрокаСуммаИтого.Параметры.Сумма = Формат(СсылкаНаОбъект.ФП1.Итог("СуммаБезналМесяц"),"ЧЦ=15; ЧДЦ=2");
		ТабДокумент.Присоединить(ОблСтрокаСуммаИтого);
	КонецЕсли;
	
	// ПОДВАЛ
	
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОблПодвал);
	
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб=Истина;
	
	Возврат ТабДокумент;
	
	
КонецФункции