
Процедура ВыполнитьАвторизацию(ОповещениеЗавершение) Экспорт
	
	ПараметрыАвторизации = РаботаСGoogleAPIВызовСервера.ПолучитьПараметрыАвторизации(Истина);
	
	ДопПараметры = Новый Структура("ПараметрыАвторизации, ОповещениеЗавершение", ПараметрыАвторизации, ОповещениеЗавершение);
	
	ОткрытьФорму("ОбщаяФорма.ФормаАвторизацииGoogle", новый Структура("ПараметрыАвторизации", ПараметрыАвторизации), ЭтотОбъект,,,, Новый ОписаниеОповещения("Авторизация_Окончание", ЭтотОбъект, ДопПараметры));
	
КонецПроцедуры

&НаКлиенте
Процедура Авторизация_Окончание(РезультатЗакрытия, ДопПараметры) Экспорт 
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда 
		РаботаСGoogleAPIВызовСервера.СохранитьПараметрыАвторизации(РезультатЗакрытия, ДопПараметры.ПараметрыАвторизации);
		ВыполнитьОбработкуОповещения(ДопПараметры.ОповещениеЗавершение, Истина);
	КонецЕсли;	
	
КонецПроцедуры
