
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьПередСозданиемЗадач(Источник, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	НоваяЗадача = Задачи.Задачи.СоздатьЗадачу();
	ЗаполнитьЗначенияСвойств(НоваяЗадача, Источник, , "РезультатИсполнения");
	НоваяЗадача.Заполнить(Неопределено);
	НоваяЗадача.БизнесПроцесс = Источник.Ссылка;
	НоваяЗадача.ТочкаМаршрута = БизнесПроцессы.Задание.ТочкиМаршрута.Выполнить;
	НоваяЗадача.Наименование = Источник.Заголовок;
	НоваяЗадача.УстановитьНовыйНомер(Строка(Источник.Номер));
	//НоваяЗадача.Ответственный = Ссылка.Исполнитель;
	Если ТипЗнч(Источник.Исполнитель) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
		НоваяЗадача.РольИсполнителя = Источник.Исполнитель;
		НоваяЗадача.Исполнитель = Неопределено;
	Иначе	
		НоваяЗадача.Исполнитель = Источник.Исполнитель;
	КонецЕсли;
	НоваяЗадача.Записать();
	
	ФормируемыеЗадачи.Добавить(НоваяЗадача);
	
	//запись в регистр напоминаний
	НаборДанных = РегистрыСведений.УведомленияОНовыхЗадачах.СоздатьНаборЗаписей();
	НаборДанных.Отбор.Задача.Установить(НоваяЗадача.Ссылка);
	НаборДанных.Прочитать();
	НаборДанных.Очистить();
	
	Если ТипЗнч(Источник.Исполнитель) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
		НаборИсполнителей = РегистрыСведений.ИсполнителиЗадач.СоздатьНаборЗаписей();
		НаборИсполнителей.Отбор.РольИсполнителя.Установить(Источник.Исполнитель);
		НаборИсполнителей.Прочитать();
		Для каждого ИсполнительРоли из НаборИсполнителей Цикл
			Движение = НаборДанных.Добавить();
			Движение.Период = ТекущаяДатаСеанса();
			Движение.Исполнитель = ИсполнительРоли.Исполнитель;
			Движение.Задача = НоваяЗадача.Ссылка;
		КонецЦикла;
	Иначе
		Движение = НаборДанных.Добавить();
		Движение.Период = ТекущаяДатаСеанса();
		Движение.Исполнитель = Источник.Исполнитель;
		Движение.Задача = НоваяЗадача.Ссылка;
		//Движение.Количество = 1;
	КонецЕсли;
	
	НаборДанных.Записать();
	
	//отправим уведомление на е-майл
	Если РаботаСЭлектроннойПочтой.ОтправлятьEMailПриПостановкеЗадачи() Тогда
		СсылкаНаЭлектронноеПисьмо = РаботаСЭлектроннойПочтой.СоздатьПисьмоСУведомлениемОПостановкеЗадачи(НоваяЗадача);
		Если НЕ СсылкаНаЭлектронноеПисьмо.Пустая() Тогда
			РезультатОтправки = Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(СсылкаНаЭлектронноеПисьмо);
			Если НЕ ПустаяСтрока(РезультатОтправки) Тогда
				Сообщить("Ошибка отправки электронного письма исполнителю: " + РезультатОтправки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ) Экспорт
		
	//отправим уведомление на е-майл
	Если РаботаСЭлектроннойПочтой.ОтправлятьEMailПриПостановкеЗадачи() Тогда
		СсылкаНаЭлектронноеПисьмо = РаботаСЭлектроннойПочтой.СоздатьПисьмоСУведомлениемОВыполненииЗадачи(Задача);
		Если НЕ СсылкаНаЭлектронноеПисьмо.Пустая() Тогда
			РезультатОтправки = Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(СсылкаНаЭлектронноеПисьмо);
			Если НЕ ПустаяСтрока(РезультатОтправки) Тогда
				Сообщить("Ошибка отправки электронного письма автору задачи: " + РезультатОтправки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
