#Область ОбработкаСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда	
		Если ПроверяемыеРеквизиты.Найти("Материалы.Фактура") <> Неопределено Тогда			
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Материалы.Фактура"));
		КонецЕсли;
		Если ПроверяемыеРеквизиты.Найти("Материалы.ЦветФактуры") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Материалы.ЦветФактуры"));
		КонецЕсли;
		Если ПроверяемыеРеквизиты.Найти("Материалы.ПорядокНаценки") <> Неопределено Тогда			
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Материалы.ПорядокНаценки"));
		КонецЕсли;
		Если ПроверяемыеРеквизиты.Найти("Материалы.СпособОпределения") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Материалы.СпособОпределения"));
		КонецЕсли;
	Иначе
		Если ПроверяемыеРеквизиты.Найти("Материалы.Шаблон") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Материалы.Шаблон"));
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр МинимальнаяСтоимостьПродукции
	Движения.МинимальнаяСтоимостьПродукции.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		Движение = Движения.МинимальнаяСтоимостьПродукции.Добавить();
		Движение.Период = Дата;
		Движение.Валюта = Валюта;
		Движение.ВидНоменклатуры = ВидНоменклатуры;
		Движение.ВидЦены = ВидЦены;
		Движение.Организация = Организация;
		// №13380 Движение.Подразделение = УДАЛТИТЬ_Подразделение;
		Движение.Стоимость = ТекСтрокаМатериалы.МинимальнаяСтоимость;
		Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
			Движение.Шаблон 		= ТекСтрокаМатериалы.Шаблон;
		Иначе
			Движение.Фактура 		= ТекСтрокаМатериалы.Фактура;
			Движение.ЦветФактуры 	= ТекСтрокаМатериалы.ЦветФактуры;
		
			Движение.СпособОпределения = ТекСтрокаМатериалы.СпособОпределения;
			Движение.ПорядокНаценки = ТекСтрокаМатериалы.ПорядокНаценки;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


