
#Область ПрограммныйИнтерфейс

// Возвращает таблицу, содержащую контактную информацию нескольких объектов. 
//
// Параметры:
//    СсылкиИлиОбъекты         - Массив - владельцы контактной информации.
//    ТипыКонтактнойИнформации - Массив, ПеречислениеСсылка.ТипыКонтактнойИнформации - Если указаны, то будет получена
//        контактная информация только этих типов.
//    ВидыКонтактнойИнформации - Массив, СправочникСсылка.ВидыКонтактнойИнформации   - Если указаны, то будет возвращена
//                               контактная информация только этих видов контактной информации.
//    Дата                     - Дата   - необязательный, дата с которой действует запись контактной информации,
//                              используется при хранении истории изменения контактной информации.
//                              Если владелец хранит историю изменений, то при несоответствии параметра
//                              дате будет вызвано исключение.
//
// Возвращаемое значение:
//  ТаблицаЗначений -  таблица с контактной информацией объектов содержащая колонки:
//    * СсылкиИлиОбъекты - Ссылка - Владелец контактной информации.
//    * Вид              - СправочникСсылка.ВидыКонтактнойИнформации - Вид контактной информации.
//    * Тип              - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации.
//    * Значение         - Строка - контактная информация во внутреннем формате JSON.
//    * Представление    - Строка - Представление контактной информации.
//    * Дата             - Дата - Дата, с которой действует запись контактной информации.
//    * ИдентификаторСтрокиТабличнойЧасти - Число - Идентификатор строки этой табличной части
//    * ЗначенияПолей    - Строка - устаревший XML, соответствующий XDTO пакетам КонтактнаяИнформация или Адрес. Для
//                                  обратной совместимости.
//
Функция КонтактнаяИнформацияОбъектов(СсылкиИлиОбъекты, Знач ТипыКонтактнойИнформации = Неопределено, Знач ВидыКонтактнойИнформации = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ТипЗнч(ТипыКонтактнойИнформации) = Тип("ПеречислениеСсылка.ТипыКонтактнойИнформации") Тогда
		ТипыКонтактнойИнформации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипыКонтактнойИнформации);
	КонецЕсли;
	
	Если ТипЗнч(ВидыКонтактнойИнформации) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
		ВидыКонтактнойИнформации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидыКонтактнойИнформации);
	КонецЕсли;
	
	СоздатьВТКонтактнаяИнформация(Запрос.МенеджерВременныхТаблиц, СсылкиИлиОбъекты, ТипыКонтактнойИнформации, ВидыКонтактнойИнформации);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект КАК Объект,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти КАК ИдентификаторСтрокиТабличнойЧасти,
	|	КонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	ВТКонтактнаяИнформация КАК КонтактнаяИнформация
	|УПОРЯДОЧИТЬ ПО
	|	КонтактнаяИнформация.НомерСтроки
	|";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу, содержащую контактную информацию объекта.
// Поведение, при котором возвращалось представление контактной информации, теперь считается устаревшим
// и сохранено для обратной совместимости. Для получения представления контактной информации рекомендуется
// использовать функцию ПредставлениеКонтактнойИнформацииОбъекта.
//
// Параметры:
//  СсылкаИлиОбъект          - ЛюбаяСсылка, Объект - Ссылка или объект-владелец контактной информации (организация,
//                                            контрагент, партнер и т.д.).
//  ВидКонтактнойИнформации  - СправочникСсылка.ВидыКонтактнойИнформации - Необязательный, отбор по виду контактной информации.
//  ТолькоПредставление      - Булево - Если Истина, то возвращает только представление, иначе таблицу значений.
//                                      Для получения представления рекомендуется использовать функцию ПредставлениеКонтактнойИнформацииОбъекта.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с контактной информацией объекта содержащая колонки:
//    * СсылкиИлиОбъекты - Ссылка - Владелец контактной информации.
//    * Вид              - СправочникСсылка.ВидыКонтактнойИнформации   - Вид контактной информации.
//    * Тип              - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации.
//    * Значение         - Строка - контактная информация во внутреннем формате JSON.
//    * Представление    - Строка - Представление контактной информации.
//    * Дата             - Дата   - дата, с которой действует запись контактной информации.
//    * ИдентификаторСтрокиТабличнойЧасти - Число - Идентификатор строки этой табличной части
//    * ЗначенияПолей    - Строка - устаревший XML, соответствующий XDTO пакетам КонтактнаяИнформация или Адрес. Для
//                                  обратной совместимости.
//
Функция КонтактнаяИнформацияОбъекта(СсылкаИлиОбъект, ВидКонтактнойИнформации, ТолькоПредставление=Истина, РезультатМассивом = Ложь) Экспорт
	
	Если ТолькоПредставление Тогда
		// Оставлено для обратной совместимости.
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(СсылкаИлиОбъект.Ссылка);
		
		Если НЕ ЗначениеЗаполнено(ВидКонтактнойИнформации) Тогда
			Возврат "";
		КонецЕсли;
		
		КонтактнаяИнформацияОбъекта = КонтактнаяИнформацияОбъектов(МассивОбъектов,, ВидКонтактнойИнформации);
		
		Если КонтактнаяИнформацияОбъекта.Количество() > 0 Тогда
			Возврат КонтактнаяИнформацияОбъекта[0].Представление;
		КонецЕсли;
		
		Возврат "";
	Иначе
		СсылкиИлиОбъекты = Новый Массив;
		СсылкиИлиОбъекты.Добавить(СсылкаИлиОбъект);
		
		Если ТипЗнч(ВидКонтактнойИнформации) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
			ВидыКонтактнойИнформации = Новый Массив;
			ВидыКонтактнойИнформации.Добавить(ВидКонтактнойИнформации);
			ТипыКонтактнойИнформации = Новый Массив;
			ТипыКонтактнойИнформации.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидКонтактнойИнформации, "Тип"));
		Иначе
			ВидыКонтактнойИнформации = Неопределено;
		КонецЕсли;
		
		КонтактнаяИнформацияОбъекта = КонтактнаяИнформацияОбъектов(СсылкиИлиОбъекты, ТипыКонтактнойИнформации, ВидыКонтактнойИнформации);
		Если РезультатМассивом Тогда
			Возврат КонтактнаяИнформацияОбъекта.ВыгрузитьКолонку("Представление");
		Иначе
			Возврат КонтактнаяИнформацияОбъекта;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Формирует новую таблицу контактной информации.
//
// Параметры:
//  КолонкаОбъект - Булево - Если Истина, то таблица будет содержать колонку "Объект".
//                           Это нужно, если в таблице необходимо хранить контактной информацию для нескольких объектов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - с колонками:
//       * Объект        - ЛюбаяСсылка - владелец контактной информации.
//       * Вид           - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации.
//       * Тип           - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип контактной информации.
//       * Значение      - Строка - JSON, соответствующий структуре контактной информации.
//       * ЗначенияПолей - Строка - XML, соответствующий XDTO пакету КонтактнаяИнформация или Адрес.
//       * Представление - Строка - представление контактной информации.
//       * Дата          - Дата   - дата, с которой действует запись контактной информации.
//       * ИдентификаторСтрокиТабличнойЧасти - Число - идентификатор строки этой табличной части
//
Функция НоваяКонтактнаяИнформация(КолонкаОбъект = Истина) Экспорт
	
	КонтактнаяИнформация = Новый ТаблицаЗначений;
	ОписаниеТиповСтрока1500 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1500));
	
	Если КолонкаОбъект Тогда
		КонтактнаяИнформация.Колонки.Добавить("Объект");
	КонецЕсли;
	
	КонтактнаяИнформация.Колонки.Добавить("Представление",                     ОписаниеТиповСтрока1500);
	КонтактнаяИнформация.Колонки.Добавить("Вид",                               Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"));
	КонтактнаяИнформация.Колонки.Добавить("Тип",                               Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"));
	КонтактнаяИнформация.Колонки.Добавить("ИдентификаторСтрокиТабличнойЧасти", Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	Возврат КонтактнаяИнформация;
	
КонецФункции

//// Добавляет или изменяет контактную информацию у владельца контактной информации.
////
//// Параметры:
////  СсылкаИлиОбъект      - Произвольный    - ссылка или объект владелец контактной информации.
////                                           Для ссылки после добавления контактной информации владелец будет записан.
////                                           Если передан объект, то контактная информация будет добавлена без записи.
////                                           Для сохранения изменений объект необходимо будет записать отдельно.
////  КонтактнаяИнформация - ТаблицаЗначений - таблица, содержащая контактную информацию
////                                           Описание колонок см. функцию НоваяКонтактнаяИнформация.
////                                           Важно! Если передана пустая таблица значений и указан режим замещения, то
////                                           произойдет очистка всей контактной информации владельца контактной информации.
////  Замещать             - Булево          - Если Истина(по умолчанию), то будет заменена
////                                           вся контактная информация по переданном виду контактной информации.
////                                           Если Ложь, то запись будет добавлена. Если вид контактной информации 
////                                           не разрешает ввод нескольких значений, а контактная информация объекта
////                                           уже содержит запись, то запись не будет добавлена.
////
Процедура УстановитьКонтактнуюИнформациюОбъекта(СсылкаИлиОбъект, Знач КонтактнаяИнформация, Замещать = Истина) Экспорт
	
	ЭтоСсылка = ОбщегоНазначения.ЗначениеСсылочногоТипа(СсылкаИлиОбъект);
	Объект =?(ЭтоСсылка, СсылкаИлиОбъект.ПолучитьОбъект(), СсылкаИлиОбъект);
	
//	Если ТипЗнч(СсылкаИлиОбъект) <> Тип("ДанныеФормыСтруктура") Тогда
//		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаИлиОбъект));
//	Иначе
//		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаИлиОбъект.Ссылка));
//	КонецЕсли;
//	
//	Если МетаданныеОбъекта = Неопределено
//		Или МетаданныеОбъекта.ТабличныеЧасти.Найти("КонтактнаяИнформация") = Неопределено Тогда
//		ВызватьИсключение НСтр("ru = 'Добавление контактной информации невозможно, у объекта нет таблицы с контактной информацией.'");;
//	КонецЕсли;
//	
	// Очистка контактной информации пустой таблицей.
	Если КонтактнаяИнформация.Количество() = 0 Тогда
		Если Замещать Тогда
			Объект.ДополнительнаяКонтактнаяИнформация.Очистить();
			Если ЭтоСсылка Тогда
				Объект.Записать();
			КонецЕсли;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
//	Периодическая = МетаданныеОбъекта.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Найти("ДействуетС") <> Неопределено;
//	БезИдентификатораТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Найти("ИдентификаторСтрокиТабличнойЧасти") = Неопределено;
//	
//	Для каждого СтрокаКонтактнойИнформации Из КонтактнаяИнформация Цикл
//		ВосстановитьПустыеЗначениеПредставление(СтрокаКонтактнойИнформации);
//	КонецЦикла;
//	
//	Если Замещать Тогда
//		
//		Для каждого СтрокаКонтактнойИнформацииОбъекта Из КонтактнаяИнформация Цикл
//			
//			ДатаОтбора = ?(Периодическая, СтрокаКонтактнойИнформацииОбъекта.Дата, Неопределено);
//			НайденныеСтроки = НайтиСтрокиКонтактнойИнформации(СтрокаКонтактнойИнформацииОбъекта.Вид, ДатаОтбора, Объект.КонтактнаяИнформация);
//			
//			Для каждого Строка Из НайденныеСтроки Цикл
//				Объект.КонтактнаяИнформация.Удалить(Строка);
//			КонецЦикла;
//			
//		КонецЦикла;
//		
//	КонецЕсли;

	Телефоны = Новый Массив;
	ЭлектронныеАдреса = Новый Массив;
	Для каждого СтрокаКонтактнойИнформацииОбъекта Из КонтактнаяИнформация Цикл
//		
//		ХранитьИсториюИзменений = Периодическая И СтрокаКонтактнойИнформацииОбъекта.Вид.ХранитьИсториюИзменений;
//		
		Если Замещать Тогда
//			
//			ИдентификаторСтрокиТабличнойЧасти = ?(БезИдентификатораТабличнойЧасти, Неопределено, СтрокаКонтактнойИнформацииОбъекта.ИдентификаторСтрокиТабличнойЧасти);
//			Если ЗапрещенВводНесколькихЗначений(СтрокаКонтактнойИнформацииОбъекта.Вид, Объект.КонтактнаяИнформация, СтрокаКонтактнойИнформацииОбъекта.Дата, ИдентификаторСтрокиТабличнойЧасти) Тогда
//				Продолжить;
//			КонецЕсли;
			СтрокаКонтактнойИнформации = Объект.ДополнительнаяКонтактнаяИнформация.Добавить();
//			
		//Иначе
		//	
		//	Отбор = Новый Структура();
		//	Отбор.Вставить("Вид", СтрокаКонтактнойИнформацииОбъекта.Вид);
		//	Отбор.Вставить("Вид", СтрокаКонтактнойИнформацииОбъекта.Вид);
//			Если ХранитьИсториюИзменений Тогда
//				Отбор.Вставить("ДействуетС", СтрокаКонтактнойИнформацииОбъекта.Дата);
//				НайденныеСтроки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
//			ИначеЕсли ЗначениеЗаполнено(СтрокаКонтактнойИнформацииОбъекта.Значение) Тогда
//				Отбор.Вставить("Значение", СтрокаКонтактнойИнформацииОбъекта.Значение);
//				НайденныеСтроки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
//			Иначе
//				Отбор.Вставить("ЗначенияПолей", СтрокаКонтактнойИнформацииОбъекта.ЗначенияПолей);
//				НайденныеСтроки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
//			КонецЕсли;
//			
//			Если НЕ ХранитьИсториюИзменений
//				 И ЗапрещенВводНесколькихЗначений(СтрокаКонтактнойИнформацииОбъекта.Вид, Объект.КонтактнаяИнформация, СтрокаКонтактнойИнформацииОбъекта.Дата)
//				 ИЛИ НайденныеСтроки.Количество() > 0 Тогда
//					Продолжить;
//			КонецЕсли;
//			
//			СтрокаКонтактнойИнформации = Объект.КонтактнаяИнформация.Добавить();
//			
		КонецЕсли;
		
		ЗаполнитьКонтактнуюИнформациюОбъектаИзСтроки(СтрокаКонтактнойИнформацииОбъекта, СтрокаКонтактнойИнформации);
		
		Если СтрокаКонтактнойИнформацииОбъекта.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон 
			И Телефоны.Найти(СтрокаКонтактнойИнформацииОбъекта.Представление) = Неопределено Тогда
			Телефоны.Добавить(СтрокаКонтактнойИнформацииОбъекта.Представление);
		ИначеЕсли СтрокаКонтактнойИнформацииОбъекта.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты 
			И ЭлектронныеАдреса.Найти(СтрокаКонтактнойИнформацииОбъекта.Представление) = Неопределено Тогда
			ЭлектронныеАдреса.Добавить(СтрокаКонтактнойИнформацииОбъекта.Представление);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтоСсылка Тогда
		//Объект.Телефоны = "";
		//Объект.АдресаЭлектроннойПочты = "";
		//Если Телефоны.Количество() > 0 Тогда
		//	Объект.Телефоны = СтрСоединить(Телефоны, ",");
		//КонецЕсли;
		//Если ЭлектронныеАдреса.Количество() > 0 Тогда
		//	Объект.АдресаЭлектроннойПочты = СтрСоединить(ЭлектронныеАдреса, ",");
		//КонецЕсли;
		Объект.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Создает временную таблицу с контактной информацией нескольких объектов.
//
// Параметры:
//    МенеджерВременныхТаблиц  - МенеджерВременныхТаблиц - В менеджере создается временная таблица
//     ВТКонтактнаяИнформация с полями:
//     * Объект        - Ссылка - владелец контактной информации.
//     * Вид           - СправочникСсылка.ВидыКонтактнойИнформации - Ссылка на вид контактной информации.
//     * Тип           - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации.
//     * ЗначенияПолей - Строка - XML соответствующий XDTO пакету КонтактнаяИнформация или Адрес.
//     * Представление - Строка - Представление контактной информации.
//    МассивОбъектов           - Массив - Владельцы контактной информации.
//    ТипыКонтактнойИнформации - Массив - Если указаны, то временная таблица будет содержать только контактную
//                                        информацию этих типов.
//    ВидыКонтактнойИнформации - Массив - Если указаны, то временная таблица будет содержать только контактную
//                                        информацию этих видов.
//    Дата                     - Дата   - Дата, с которой действует запись контактной информации, используется при
//                                        хранении истории изменения контактной информации. Если владелец хранит историю
//                                        изменений, то при несоответствии параметра дате будет вызвано исключение.
//
Процедура СоздатьВТКонтактнаяИнформация(МенеджерВременныхТаблиц, МассивОбъектов, ТипыКонтактнойИнформации = Неопределено, ВидыКонтактнойИнформации = Неопределено, Дата = Неопределено) Экспорт
	
	Если ТипЗнч(МассивОбъектов) <> Тип("Массив") ИЛИ МассивОбъектов.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Неверное значение для массива владельцев контактной информации.'");
	КонецЕсли;
	
	ОбъектыСГруппировкойПоТипам = Новый Соответствие;
	Для каждого Ссылка Из МассивОбъектов Цикл
		ТипОбъекта = ТипЗнч(Ссылка);
		НайденныйОбъект = ОбъектыСГруппировкойПоТипам.Получить(ТипОбъекта);
		Если НайденныйОбъект = Неопределено Тогда
			НаборСсылок = Новый Массив;
			НаборСсылок.Добавить(Ссылка);
			ОбъектыСГруппировкойПоТипам.Вставить(ТипОбъекта, НаборСсылок);
		Иначе
			НайденныйОбъект.Добавить(Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	ТекстЗапросаПодготовкаДанных = "";
	СтрокаРАЗРЕШЕННЫЕ = " РАЗРЕШЕННЫЕ ";
	СтрокаВременнойТаблицы = "ПОМЕСТИТЬ ВТКонтактнаяИнформация";
	
	Для каждого ОбъектСКонтактнойИнформацией Из ОбъектыСГруппировкойПоТипам Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ОбъектСКонтактнойИнформацией.Ключ);
		Если МетаданныеОбъекта.ТабличныеЧасти.Найти("ДополнительнаяКонтактнаяИнформация") = Неопределено Тогда
			ВызватьИсключение  МетаданныеОбъекта.Имя + " " + НСтр("ru = 'не содержит контактную информацию.'");
		КонецЕсли;
		ИмяТаблицы = МетаданныеОбъекта.Имя;
		Если МетаданныеОбъекта.ТабличныеЧасти.ДополнительнаяКонтактнаяИнформация.Реквизиты.Найти("ДействуетС") <> Неопределено Тогда
			ТекстЗапросаПодготовкаДанных = ТекстЗапросаПодготовкаДанных + "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтактнаяИнформация.Ссылка КАК Объект,
			|	КонтактнаяИнформация.Вид КАК Вид
			|ПОМЕСТИТЬ СрезКонтактнойИнформации" + ИмяТаблицы + "
			|ИЗ
			|	" + МетаданныеОбъекта.ПолноеИмя() + ".ДополнительнаяКонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Ссылка В (&МассивОбъектов" + ИмяТаблицы + ")
			|	И КонтактнаяИнформация.Вид <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
			|	И КонтактнаяИнформация.Тип <> ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	КонтактнаяИнформация.Вид, КонтактнаяИнформация.Ссылка
			|;"
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = "";
	Для каждого ОбъектСКонтактнойИнформацией Из ОбъектыСГруппировкойПоТипам Цикл
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), Символы.ПС + " ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС, "");
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ОбъектСКонтактнойИнформацией.Ключ);
		ИмяТаблицы = МетаданныеОбъекта.Имя;
		
		ЕстьИдентификаторСтрокиТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.ДополнительнаяКонтактнаяИнформация.Реквизиты.Найти("ИдентификаторСтрокиТабличнойЧасти") <> Неопределено;
		ТекстЗапросаИдентификаторСтрокиТабличнойЧасти = "";
		Если ЕстьИдентификаторСтрокиТабличнойЧасти Тогда
			ТекстЗапросаИдентификаторСтрокиТабличнойЧасти = "КонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти КАК ИдентификаторСтрокиТабличнойЧасти";
		Иначе
			ТекстЗапросаИдентификаторСтрокиТабличнойЧасти = "0 КАК ИдентификаторСтрокиТабличнойЧасти";
		КонецЕсли;		
		
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ " + СтрокаРАЗРЕШЕННЫЕ + "
		|	КонтактнаяИнформация.Ссылка КАК Объект,
		|	КонтактнаяИнформация.НомерСтроки КАК НомерСтроки,
		|	КонтактнаяИнформация.Вид КАК Вид,
		|	КонтактнаяИнформация.Тип КАК Тип,
		|	КонтактнаяИнформация.Представление КАК Представление,
		|	" + ТекстЗапросаИдентификаторСтрокиТабличнойЧасти + "
		|	" + СтрокаВременнойТаблицы + "
		|ИЗ
		|	" + МетаданныеОбъекта.ПолноеИмя() + ".ДополнительнаяКонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		| КонтактнаяИнформация.Вид <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
		| И КонтактнаяИнформация.Тип <> ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка)
		| И КонтактнаяИнформация.Ссылка В (&МассивОбъектов" + ИмяТаблицы + ")
		|	" + ?(ТипыКонтактнойИнформации = Неопределено, "", "И КонтактнаяИнформация.Тип В (&ТипыКонтактнойИнформации)") + "
		|	" + ?(ВидыКонтактнойИнформации = Неопределено, "", "И КонтактнаяИнформация.Вид В (&ВидыКонтактнойИнформации)") + "
		|";
		
		СтрокаРАЗРЕШЕННЫЕ ="";
		СтрокаВременнойТаблицы = "";
		
		Запрос.УстановитьПараметр("МассивОбъектов" + ИмяТаблицы, ОбъектСКонтактнойИнформацией.Значение);
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапросаПодготовкаДанных + ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТипыКонтактнойИнформации", ТипыКонтактнойИнформации);
	Запрос.УстановитьПараметр("ВидыКонтактнойИнформации", ВидыКонтактнойИнформации);
	Запрос.Выполнить();
	
КонецПроцедуры

// Обработчик для события формы ПриСозданииНаСервере.
// Вызывается из модуля формы объекта-владельца КИ при внедрении подсистемы.
//
// Параметры:
//    Форма                - ФормаКлиентскогоПриложения - Форма объекта-владельца, предназначенная для вывода контактной
//                                                        информации.
//    Объект               - Произвольный - Объект-владелец контактной информации. Если это ссылка, то контактная информация
//                                          будет получена из объекта по ссылке, иначе из таблицы КонтактнаяИнформация объекта.
//    ДополнительныеПараметры - Структура - Описание настроек контактной информации - см. ПараметрыКонтактнойИнформации.
//                                          Предыдущее название параметра ИмяЭлементаДляРазмещения. Устарел, следует
//                                          использовать ДополнительныеПараметры. Группа, куда будут размещены элементы
//                                          контактной информации.
Процедура ПриСозданииНаСервере(Форма, Объект, ДополнительныеПараметры) Экспорт
	
//	ТипПомещения = Неопределено;
//	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
//		
//		ДополнительныеПараметры.Свойство("ТипПомещения", ТипПомещения);
//		ОтложеннаяИнициализация  = ?(ДополнительныеПараметры.Свойство("ОтложеннаяИнициализация"), ДополнительныеПараметры.ОтложеннаяИнициализация, Ложь);
//		ПоложениеЗаголовкаКИ     = ?(ДополнительныеПараметры.Свойство("ПоложениеЗаголовкаКИ"), ДополнительныеПараметры.ПоложениеЗаголовкаКИ, "");
//		ИсключаемыеВиды          = ?(ДополнительныеПараметры.Свойство("ИсключаемыеВиды"), ДополнительныеПараметры.ИсключаемыеВиды, Неопределено);
//		СкрываемыеВиды           = ?(ДополнительныеПараметры.Свойство("СкрываемыеВиды"), ДополнительныеПараметры.СкрываемыеВиды, Неопределено);
//		ИмяЭлементаДляРазмещения = ?(ДополнительныеПараметры.Свойство("ИмяЭлементаДляРазмещения"), ДополнительныеПараметры.ИмяЭлементаДляРазмещения, "ГруппаКонтактнаяИнформация");
//		ОбработкаНавигационнойСсылки = ?(ДополнительныеПараметры.Свойство("ОбработкаНавигационнойСсылки"), ДополнительныеПараметры.ОбработкаНавигационнойСсылки, Ложь);
//	Иначе
		ИмяЭлементаДляРазмещения = ДополнительныеПараметры.ИмяЭлементаДляРазмещения;
//		ОтложеннаяИнициализация  = УдалитьОтложеннаяИнициализация;
//		ИсключаемыеВиды          = УдалитьИсключаемыеВиды;
//		СкрываемыеВиды           = Неопределено;
//		ПоложениеЗаголовкаКИ     = УдалитьПоложениеЗаголовкаКИ;
//		ОбработкаНавигационнойСсылки = Ложь;
//	КонецЕсли;
//	
//	Если ИсключаемыеВиды = Неопределено Тогда
//		ИсключаемыеВиды = Новый Массив;
//	КонецЕсли;
//	
//	Если СкрываемыеВиды = Неопределено Тогда
//		СкрываемыеВиды = Новый Массив;
//	КонецЕсли;
//	
	ДобавляемыеРеквизиты = Новый Массив;
	ПроверитьНаличиеРеквизитовКонтактнойИнформации(Форма, ДобавляемыеРеквизиты);
	
	// Кэширование часто используемых значений
	СсылкаНаОбъект             = Объект.Ссылка;
	МетаданныеОбъекта          = СсылкаНаОбъект.Метаданные();
	ПолноеИмяОбъектаМетаданных = МетаданныеОбъекта.ПолноеИмя();
	ИмяОбъекта                 = МетаданныеОбъекта.Имя;
	
//	ГруппаВидовКонтактнойИнформации  = ГруппаВидовКонтактнойИнформацииОбъекта(ПолноеИмяОбъектаМетаданных);
//	ИспользуетсяКонтактнаяИнформация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаВидовКонтактнойИнформации, "Используется");
//	Если ИспользуетсяКонтактнаяИнформация = Ложь Тогда
//		
//		ПараметрыВыводаКонтактнойИнформации = Новый Структура();
//		ПараметрыВыводаКонтактнойИнформации.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
//		ПараметрыВыводаКонтактнойИнформации.Вставить("ПоложениеЗаголовкаКИ", ПоложениеЗаголовкаКИ);
//		ПараметрыВыводаКонтактнойИнформации.Вставить("ОтложеннаяИнициализация", ОтложеннаяИнициализация);
//		ПараметрыВыводаКонтактнойИнформации.Вставить("ИсключаемыеВиды", ИсключаемыеВиды);
//		ПараметрыВыводаКонтактнойИнформации.Вставить("СкрываемыеВиды", СкрываемыеВиды);
//		ПараметрыВыводаКонтактнойИнформации.Вставить("СсылкаНаОбъект", СсылкаНаОбъект);
//		
//		СкрытьКонтактнуюИнформацию(Форма, ДобавляемыеРеквизиты, ПараметрыВыводаКонтактнойИнформации);
//		Возврат;
//	КонецЕсли;
//	
//	РеквизитыОбъекта           = МетаданныеОбъекта.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
//	ЕстьКолонкаДействуетС      = (РеквизитыОбъекта.Найти("ДействуетС") <> Неопределено);
//	ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти = (РеквизитыОбъекта.Найти("ИдентификаторСтрокиТабличнойЧасти") <> Неопределено);

	ВидыКИ = Новый ТаблицаЗначений;
	ВидыКИ.Колонки.Добавить("Вид", 					Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"));
	ВидыКИ.Колонки.Добавить("ЗаголовокЭлемента", 	Новый ОписаниеТипов("Строка"));
	ВидыКИ.Колонки.Добавить("Обязательное", 		Новый ОписаниеТипов("Булево")); // признак необходимости отображения на форме
	ВидыКИ.Колонки.Добавить("Порядок", 				Новый ОписаниеТипов("Число"));

	НС = ВидыКИ.Добавить();
	НС.Порядок = 1;
	НС.ЗаголовокЭлемента = "Телефон";
	НС.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	НС.Обязательное = Истина;
	
	НС = ВидыКИ.Добавить();
	НС.Порядок = 2;
	НС.ЗаголовокЭлемента = "Электронная почта";
	НС.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
	НС.Обязательное = Ложь;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Вид КАК Справочник.ВидыКонтактнойИнформации) КАК Вид,
	|	КонтактнаяИнформация.Обязательное КАК Обязательное,
	|	КонтактнаяИнформация.Порядок КАК Порядок,
	|	КонтактнаяИнформация.ЗаголовокЭлемента КАК ЗаголовокЭлемента
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВидыКИ КАК КонтактнаяИнформация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Вид КАК Вид,
	|	ВТ.Обязательное КАК Обязательное,
	|	ВТ.Порядок КАК Порядок,
	|	ВТ.Вид.Тип КАК Тип,
	|	ВТ.Вид.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(200)) КАК ИмяРеквизита,
	|	ВТ.ЗаголовокЭлемента КАК ЗаголовокЭлемента,
	|	ЕСТЬNULL(КонтактнаяИнформация.НомерСтроки, 0) КАК НомерСтроки,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Представление,
	|	ЕСТЬNULL(КонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти, НЕОПРЕДЕЛЕНО) КАК ИдентификаторСтрокиТабличнойЧасти
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ " +  ПолноеИмяОбъектаМетаданных + ".ДополнительнаяКонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ВТ.Вид = КонтактнаяИнформация.Вид
	|			И (КонтактнаяИнформация.Ссылка = &Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ВидыКИ", ВидыКИ);

	УстановитьПривилегированныйРежим(Истина);
	КонтактнаяИнформация = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
//	КонвертацияКонтактнойИнформацииВJSON(КонтактнаяИнформация);
//	
//	КонтактнаяИнформация.Сортировать("РеквизитДопУпорядочивания, НомерСтроки");
	СоздатьРеквизитыКонтактнойИнформации(Форма, ДобавляемыеРеквизиты, ИмяОбъекта, КонтактнаяИнформация);
	
	ПараметрыКонтактнойИнформации = ПараметрыВыводаДополнительнойКонтактнойИнформации(Форма, ИмяЭлементаДляРазмещения);
//	ПараметрыКонтактнойИнформации.Владелец                     = СсылкаНаОбъект;
//	ПараметрыКонтактнойИнформации.ПараметрыАдреса.ТипПомещения = ТипПомещения;
//	ПараметрыКонтактнойИнформации.ОбработкаНавигационнойСсылки = ОбработкаНавигационнойСсылки;
	
	// Кеш значений всех видов контактной информации у данного объекта.	
	ДанныеВидовКонтактнойИнформации = УправлениеКонтактнойИнформациейСлужебный.ДанныеВидовКонтактнойИнформации(
		КонтактнаяИнформация.ВыгрузитьКолонку("Вид"));
		
	Для каждого КлючЗначение из ДанныеВидовКонтактнойИнформации Цикл		
		Если КлючЗначение.Значение.ИмяПредопределенныхДанных = "ТелефонКонтрагента" Тогда
			КлючЗначение.Значение.Вставить("ЗаголовокЭлемента", "Телефон");
		ИначеЕсли КлючЗначение.Значение.ИмяПредопределенныхДанных = "EmailКонтрагента" Тогда
			КлючЗначение.Значение.Вставить("ЗаголовокЭлемента", "Электронная почта");
		КонецЕсли;
	КонецЦикла;
	
//	Отбор = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
//	КоличествоАдресов = КонтактнаяИнформация.НайтиСтроки(Отбор).Количество();
//	
//	// Создадим элементы на форме и заполним значения реквизитов.
//	СозданныеЭлементы = ОбщегоНазначения.СкопироватьРекурсивно(ИсключаемыеВиды);
	ПредыдущийВид = Неопределено;
	
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		
//		Если СтрокаКИ.ЭтоРеквизитТабличнойЧасти Тогда
//			СоздатьЭлементыТабличнойЧасти(Форма, ИмяОбъекта, ИмяЭлементаДляРазмещения, СтрокаКИ, ДанныеВидовКонтактнойИнформации);
//			Продолжить;
//		КонецЕсли;
//		
//		Если СтрокаКИ.ПометкаУдаления И ПустаяСтрока(СтрокаКИ.ЗначенияПолей) И ПустаяСтрока(СтрокаКИ.Значение) Тогда
//			Продолжить;
//		КонецЕсли;

		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И НЕ ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
			СтрокаКИ.Представление = ДополнительныеПараметры.КодСтраны;	
		КонецЕсли;
		
		

		
//		ИндексЭлемента     = СозданныеЭлементы.Найти(СтрокаКИ.Вид);
//		СтатическийЭлемент = ИндексЭлемента <> Неопределено;
		ЭтоНовыйВидКИ      = (СтрокаКИ.Вид <> ПредыдущийВид);
//		
//		Если ОтложеннаяИнициализация Тогда
//			
//			ДобавитьРеквизитВОписание(Форма, СтрокаКИ, ДанныеВидовКонтактнойИнформации, ЭтоНовыйВидКИ,, 
//				СтатическийЭлемент, ИмяЭлементаДляРазмещения);
//			Если СтатическийЭлемент Тогда
//				СозданныеЭлементы.Удалить(ИндексЭлемента);
//			КонецЕсли;
//			Продолжить;
//		КонецЕсли;
//		
		ДобавитьРеквизитВОписание(Форма, СтрокаКИ, ДанныеВидовКонтактнойИнформации, ЭтоНовыйВидКИ, ИмяЭлементаДляРазмещения);
		
//		Если СтатическийЭлемент Тогда
//			СозданныеЭлементы.Удалить(ИндексЭлемента);
//		Иначе
//			
//			СледующаяСтрока = ?(СозданныеЭлементы.Количество() = 0, Неопределено,
//				ОпределитьСледующуюСтроку(Форма, КонтактнаяИнформация, СтрокаКИ));
//			
			Если ЗначениеЗаполнено(СтрокаКИ.Представление) ИЛИ СтрокаКИ.Обязательное Тогда
				ДобавитьСтрокуКонтактнойИнформации(Форма, СтрокаКИ, ИмяЭлементаДляРазмещения);
			КонецЕсли;
//			
//		КонецЕсли;
//		
//		Если НЕ СтрокаКИ.ЭтоИсторическаяКонтактнаяИнформация  Тогда
			ПредыдущийВид = СтрокаКИ.Вид;
//		КонецЕсли;
//		
	КонецЦикла;
	
//	ОбновитьКонтекстноеМеню(Форма, ИмяЭлементаДляРазмещения);
//	
//	Если Не ОтложеннаяИнициализация 
//		И Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].СписокДобавляемыхЭлементов.Количество() > 0 Тогда
//		ДобавитьКнопкуДополнительногоПоляКонтактнойИнформации(Форма, ИмяЭлементаДляРазмещения);
//	Иначе
//		ДобавитьПояснениеПоСбросуНастроекФормы(Форма, ИмяЭлементаДляРазмещения, ОтложеннаяИнициализация);
//	КонецЕсли;
	
КонецПроцедуры

// Обработчик для события формы ПередЗаписьюНаСервере.
// Вызывается из модуля формы объекта-владельца КИ при внедрении подсистемы.
//
// Параметры:
//    Форма  - УправляемаяФорма - Форма объекта-владельца, предназначенная для вывода контактной информации.
//    Объект - СправочникОбъект, ДокументСсылка - Объект-владелец контактной информации.
//             ДанныеФормыСтруктура - Объект, содержащий табличную часть с контактной информацией. Поддерживает работу
//                                    со скрываемыми видами контактной информации только для уже существующих объектов,
//                                    из-за невозможности установить ссылку для нового объекта.
//    Отказ  - Булево - Если Истина, то объект не был записан, т.к. во время записи возникли ошибки.
//
Процедура ПередЗаписьюНаСервере(Форма, Объект, Отказ = Ложь) Экспорт
	
	КонтактнаяИнформация = КонтактнаяИнформацияИзРеквизитовФормы(Форма, Объект);
	
//	ЭтоПараметрыОсновногоОбъекта  = Истина;
//	ПараметрыКонтактнойИнформации = Неопределено;
//	СкрываемыеВиды                = Новый Массив;
//	
//	ОпределитьПараметрыКонтактнойИнформацииПоВладельцу(Форма, Объект, ПараметрыКонтактнойИнформации, ЭтоПараметрыОсновногоОбъекта, СкрываемыеВиды);
//	
//	Если Объект.Ссылка.Пустая() И ТипЗнч(Объект) <> Тип("ДанныеФормыСтруктура") Тогда
//		
//		Если ЭтоПараметрыОсновногоОбъекта Тогда
//			
//			НоваяСсылка = Объект.ПолучитьСсылкуНового();
//			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
//			Если НоваяСсылка = МенеджерОбъекта.ПустаяСсылка() Тогда
//				Объект.УстановитьСсылкуНового(МенеджерОбъекта.ПолучитьСсылку());
//			КонецЕсли;
//			ПараметрыКонтактнойИнформации.Владелец = Объект.ПолучитьСсылкуНового();
//			
//		Иначе
//			Возврат;
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если СкрываемыеВиды.Количество() = 0 Тогда
		Объект.ДополнительнаяКонтактнаяИнформация.Очистить();
//	Иначе
//		
//		Индекс = Объект.КонтактнаяИнформация.Количество() -1;
//		Пока Индекс >= 0 Цикл
//			СтрокаТаблицы = Объект.КонтактнаяИнформация.Получить(Индекс);
//			Если СкрываемыеВиды.Найти(СтрокаТаблицы.Вид) = Неопределено Тогда
//				Объект.КонтактнаяИнформация.Удалить(СтрокаТаблицы);
//			КонецЕсли;
//			Индекс = Индекс - 1;
//		КонецЦикла;
//		
//	КонецЕсли;
//	
	УстановитьКонтактнуюИнформациюОбъекта(Объект, КонтактнаяИнформация);
	
КонецПроцедуры

// Добавляет (удаляет) поле ввода или комментарий на форму, обновляя данные.
// Вызывается из модуля формы объекта-владельца контактной информации.
//
// Параметры:
//    Форма     - ФормаКлиентскогоПриложения - Форма объекта-владельца, предназначенная для вывода контактной информации.
//    Объект    - Произвольный     - Объект-владелец контактной информации.
//    Результат - Произвольный     - Необязательный служебный реквизит, полученный из предыдущего обработчика события.
//
// Возвращаемое значение:
//    Неопределено - значение не используется, обратная совместимость.
//
Функция ОбновитьКонтактнуюИнформацию(Форма, Объект, Результат = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
//	Если Результат.Свойство("ЭтоДобавлениеКомментария") Тогда
//		ИзменитьКомментарий(Форма, Результат.ИмяРеквизита, Результат.ИмяЭлементаДляРазмещения);
//	Иначе
	Если Результат.Свойство("ДобавляемыйВид") Тогда
		ДобавитьСтрокуКонтактнойИнформации(Форма, Результат, Результат.ИмяЭлементаДляРазмещения);
//	ИначеЕсли Результат.Свойство("ПоменятьМестамиЭлементы") Тогда
//		
//		Отбор = Новый Структура("ИмяРеквизита", Результат.ПервыйЭлемент);
//		ОписаниеКонтактнойИнформации = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
//		ПервыйЭлемент = ОписаниеКонтактнойИнформации.НайтиСтроки(Отбор)[0];
//		Отбор = Новый Структура("ИмяРеквизита", Результат.ВторойЭлемент);
//		ВторойЭлемент = ОписаниеКонтактнойИнформации.НайтиСтроки(Отбор)[0];
//		
//		СписокПереносимыхСвойств = "Комментарий,Представление,Значение";
//		ВременныйБуфер = Новый Структура(СписокПереносимыхСвойств);
//		
//		ЗаполнитьЗначенияСвойств(ВременныйБуфер, ПервыйЭлемент);
//		ЗаполнитьЗначенияСвойств(ПервыйЭлемент, ВторойЭлемент, СписокПереносимыхСвойств);
//		ЗаполнитьЗначенияСвойств(ВторойЭлемент, ВременныйБуфер);
//		
//		Форма[Результат.ПервыйЭлемент] = ПервыйЭлемент.Представление;
//		Форма[Результат.ВторойЭлемент] = ВторойЭлемент.Представление;
//		
//		Форма.Элементы[Результат.ПервыйЭлемент].РасширеннаяПодсказка.Заголовок = ПервыйЭлемент.Комментарий;
//		Форма.Элементы[Результат.ВторойЭлемент].РасширеннаяПодсказка.Заголовок = ВторойЭлемент.Комментарий;
//		
	КонецЕсли;
	
	Если Результат.Свойство("ЗаполнитьКодСтраны") Тогда
		ИмяРеквизита = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1%2",
			"КонтактнаяИнформацияПоле",
			СтрЗаменить(Результат.ИдентификаторСтрокиТабличнойЧасти, "-", "x"));
		Форма[ИмяРеквизита] = СофтФон.ПолучитьТелефонныйКодСтраныПользователя();
	КонецЕсли;

//	Если Результат.Свойство("ОбновитьКонтекстноеМеню") Тогда
//		Если Результат.Свойство("ИмяЭлементаДляРазмещения") Тогда
//			ОбновитьКонтекстноеМеню(Форма, Результат.ИмяЭлементаДляРазмещения);
//			
//			Если Результат.Свойство("ИмяРеквизита") Тогда
//				ОписаниеКонтактнойИнформации = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
//				Отбор = Новый Структура("ИмяРеквизита", Результат.ИмяРеквизита);
//				НайденнаяСтрока = ОписаниеКонтактнойИнформации.НайтиСтроки(Отбор)[0];
//				Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(НайденнаяСтрока.Значение) Тогда
//					КонтактнаяИнформацияПоПолям = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(НайденнаяСтрока.Значение);
//					КонтактнаяИнформацияПоПолям.Comment = ?(Результат.Свойство("Комментарий"), Результат.Комментарий, "");
//					НайденнаяСтрока.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(КонтактнаяИнформацияПоПолям);
//				КонецЕсли;
//			КонецЕсли;
//			
//		Иначе
//			Для каждого ИмяЭлементаРазмещения Из Форма.ПараметрыКонтактнойИнформации Цикл
//				ОбновитьКонтекстноеМеню(Форма, ИмяЭлементаРазмещения.Ключ);
//			КонецЦикла;
//		КонецЕсли;
//	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Записывает контактную информацию в поля табличной части Контактная информация объекта.
//
// Параметры:
//    Объект - ЛюбаяСсылка -  ссылка на объект конфигурации, содержащий табличную часть контактная информация..
//    ВидИнформации - Справочник.ВидыКонтактнойИнформация - ссылка на вид контактной информации.
//    ТипИнформации - Перечисление.ТипыКонтактнойИнформация - тип контактной информации.
//    ИдентификаторСтроки - Число - идентификатор строки табличной части.
//   
Процедура ЗаписатьКонтактнуюИнформацию(Объект, Представление, ВидИнформации, ТипИнформации, ИдентификаторСтроки = 0) Экспорт
	
	Если ПустаяСтрока(Представление) Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.ДополнительнаяКонтактнаяИнформация.Добавить();
	НоваяСтрока.Представление = Представление;
	НоваяСтрока.Вид           = ВидИнформации;
	НоваяСтрока.Тип           = ТипИнформации;
	
	Если ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
		НоваяСтрока.ИдентификаторСтрокиТабличнойЧасти = ИдентификаторСтроки;
	КонецЕсли;
	
	// Заполнение дополнительных реквизитов ТЧ.
	ЗаполнитьТехническиеПоляКонтактнойИнформации(НоваяСтрока, ТипИнформации);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьРеквизитыКонтактнойИнформации(Знач Форма, Знач ДобавляемыеРеквизиты, Знач ИмяОбъекта, КонтактнаяИнформация)
	
	Строка1500           = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1500));
	ФорматированнаяСтрока = Новый ОписаниеТипов("ФорматированнаяСтрока");
	
//	СозданныеРеквизиты = ОбщегоНазначения.СкопироватьРекурсивно(ИсключаемыеВиды);
//	ПредыдущийВид      = Неопределено;
//	ПорядковыйНомер    = 1;
	
	Для Каждого ОбъектКонтактнойИнформации Из КонтактнаяИнформация Цикл
		
		Если НЕ ОбъектКонтактнойИнформации.Обязательное И НЕ ЗначениеЗаполнено(ОбъектКонтактнойИнформации.Представление) Тогда
			Продолжить;	
		КонецЕсли;
			
		Если ОбъектКонтактнойИнформации.Обязательное И НЕ ЗначениеЗаполнено(ОбъектКонтактнойИнформации.ИдентификаторСтрокиТабличнойЧасти) Тогда
			ОбъектКонтактнойИнформации.ИдентификаторСтрокиТабличнойЧасти = Новый УникальныйИдентификатор;	
		КонецЕсли;
		
//		
//		Если ОбъектКонтактнойИнформации.ЭтоРеквизитТабличнойЧасти Тогда
//			
//			ИмяВидаКИ = ОбъектКонтактнойИнформации.ИмяПредопределенногоВида;
//			Позиция = СтрНайти(ИмяВидаКИ, ИмяОбъекта);
//			ИмяТабличнойЧасти = Сред(ИмяВидаКИ, Позиция + СтрДлина(ИмяОбъекта));
//			
//			ПредыдущийВид = Неопределено;
//			ИмяРеквизита = "";
//			
//			ОбъектКонтактнойИнформации.Строки.Сортировать("РеквизитДопУпорядочивания");
//			
//			Для Каждого СтрокаКИ Из ОбъектКонтактнойИнформации.Строки Цикл
//				
//				ТекущийВид = СтрокаКИ.Вид;
//				Если ТекущийВид <> ПредыдущийВид Тогда
//					
					//ИмяРеквизита = "КонтактнаяИнформацияПоле" + ИмяТабличнойЧасти + СтрЗаменить(ТекущийВид.УникальныйИдентификатор(), "-", "x")
					//	+ ОбъектКонтактнойИнформации.Строки.Индекс(СтрокаКИ);
					//ПутьРеквизитов = "Объект." + ИмяТабличнойЧасти;
					//
					//ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, Строка1500, ПутьРеквизитов, СтрокаКИ.Наименование, Истина));
//					ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита + "Значение", Новый ОписаниеТипов("Строка"), ПутьРеквизитов,, Истина));
//					ПредыдущийВид = ТекущийВид;
//					
//				КонецЕсли;
//				
//				СтрокаКИ.ИмяРеквизита = ИмяРеквизита;
//				
//			КонецЦикла;
//			
//		Иначе
//			
//			Если ОбъектКонтактнойИнформации.ЭтоИсторическаяКонтактнаяИнформация Тогда
//				СкорректироватьКонтактнуюИнформацию(Форма, ОбъектКонтактнойИнформации);
//				Продолжить;
//			КонецЕсли;
//			
//			ТекущийВид = ОбъектКонтактнойИнформации.Вид;
//			
//			Если ТекущийВид <> ПредыдущийВид Тогда
//				ПредыдущийВид = ТекущийВид;
//				ПорядковыйНомер = 1;
//			Иначе
//				ПорядковыйНомер = ПорядковыйНомер + 1;
//			КонецЕсли;
//			
//			Индекс = СозданныеРеквизиты.Найти(ТекущийВид);
//			Если Индекс = Неопределено Тогда
				ОбъектКонтактнойИнформации.ИмяРеквизита = "КонтактнаяИнформацияПоле" + СтрЗаменить(ОбъектКонтактнойИнформации.ИдентификаторСтрокиТабличнойЧасти, "-", "x");
//					+ ПорядковыйНомер;
//				Если Не ОтложеннаяИнициализация Тогда
//					
					ТипРеквизита = Строка1500;
//					Если ОбъектКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница И ОбработкаНавигационнойСсылки Тогда
//						ТипРеквизита = ФорматированнаяСтрока;
//					КонецЕсли;
//					
					ДобавляемыеРеквизиты.Добавить(
						Новый РеквизитФормы(ОбъектКонтактнойИнформации.ИмяРеквизита, ТипРеквизита,, ОбъектКонтактнойИнформации.Наименование, Истина));
//				КонецЕсли;
//			Иначе
//				ОбъектКонтактнойИнформации.ИмяРеквизита = "КонтактнаяИнформацияПоле" + ОбъектКонтактнойИнформации.ИмяПредопределенногоВида;
//				СозданныеРеквизиты.Удалить(Индекс);
//			КонецЕсли;
//			
//			СкорректироватьКонтактнуюИнформацию(Форма, ОбъектКонтактнойИнформации);
//		КонецЕсли;
	КонецЦикла;
//	
	// Добавим новые реквизиты
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьСтрокуКонтактнойИнформации(Форма, Результат, ИмяЭлементаДляРазмещения)
	
	// если добавление через кнопку 
	ДобавлениеНовогоЗначения = ТипЗнч(Результат) = Тип("Структура");
	
	Если ДобавлениеНовогоЗначения Тогда
		Результат.Свойство("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		
		ДобавляемыйВид = Результат.ДобавляемыйВид;
		Если ТипЗнч(ДобавляемыйВид)= Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
//			ИнформацияОВидеКИ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДобавляемыйВид, "Тип, Наименование, РедактированиеТолькоВДиалоге, ВидПоляДругое");
		Иначе
			ИнформацияОВидеКИ = ДобавляемыйВид;
			ДобавляемыйВид    = ДобавляемыйВид.Ссылка;
		КонецЕсли;
	Иначе
		ИнформацияОВидеКИ = Результат;
		ДобавляемыйВид    = Результат.Вид;
	КонецЕсли;
	
	ТаблицаКонтактнойИнформации = Форма.ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов;
	ОтборПоВиду = Новый Структура("Вид", ДобавляемыйВид);
	
	Если ДобавлениеНовогоЗначения Тогда
		
		НайденныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(ОтборПоВиду);
		
		КоличествоСтрокВида = НайденныеСтроки.Количество();
		Если КоличествоСтрокВида > 0 Тогда
			ПоследняяСтрока = НайденныеСтроки.Получить(КоличествоСтрокВида - 1);
			ИндексДобавляемойСтроки = ТаблицаКонтактнойИнформации.Индекс(ПоследняяСтрока) + 1;
		Иначе
			//ИндексДобавляемойСтроки = 0;
			Если ДобавляемыйВид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента ТОгда
				ИндексДобавляемойСтроки = 0;	
			Иначе
				// email в конец
				ИндексДобавляемойСтроки = ТаблицаКонтактнойИнформации.Количество();
			КонецЕсли;
		КонецЕсли;
		
		ЭтоПоследняяСтрока = Ложь;
		Если ИндексДобавляемойСтроки = ТаблицаКонтактнойИнформации.Количество() Тогда
			ЭтоПоследняяСтрока = Истина;
		КонецЕсли;
		
		//ИдентификаторСтрокиТабличнойЧасти = Новый УникальныйИдентификатор;
		НоваяСтрока  = ТаблицаКонтактнойИнформации.Вставить(ИндексДобавляемойСтроки);
		ИмяРеквизита = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1%2",
			"КонтактнаяИнформацияПоле",
			СтрЗаменить(Результат.ИдентификаторСтрокиТабличнойЧасти, "-", "x"));
		НоваяСтрока.ИмяРеквизита              = ИмяРеквизита;
		НоваяСтрока.Вид                       = ДобавляемыйВид;
		НоваяСтрока.Тип                       = ИнформацияОВидеКИ.Тип;
		НоваяСтрока.ИмяЭлементаДляРазмещения  = ИмяЭлементаДляРазмещения;
		НоваяСтрока.ИдентификаторСтрокиТабличнойЧасти = Результат.ИдентификаторСтрокиТабличнойЧасти;
		
		ПараметрыДополнительнойКонтактнойИнформации = ПараметрыДополнительнойКонтактнойИнформацииФормы(Форма.ПараметрыДополнительнойКонтактнойИнформации, ИмяЭлементаДляРазмещения);
//		ОбработкаНавигационнойСсылки = ПараметрыКонтактнойИнформации.ОбработкаНавигационнойСсылки;
//		
//		Если ОбработкаНавигационнойСсылки = Истина Тогда
//			ОписаниеТипаРеквизита = Новый ОписаниеТипов("ФорматированнаяСтрока");
//		Иначе
			ОписаниеТипаРеквизита = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500));
//		КонецЕсли;
//		
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита, ОписаниеТипаРеквизита,, ИнформацияОВидеКИ.Наименование, Истина));
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
//		
//		ЕстьКомментарий = Ложь;
//		ОбязательноеЗаполнение = Ложь;
	Иначе
		ЭтоПоследняяСтрока = Истина; //СледующаяСтрока = Неопределено;
		ИмяРеквизита = ИнформацияОВидеКИ.ИмяРеквизита;
//		ЕстьКомментарий = ЗначениеЗаполнено(ИнформацияОВидеКИ.Комментарий);
//		ОбязательноеЗаполнение = ИнформацияОВидеКИ.ОбязательноеЗаполнение;
	КонецЕсли;
	
	// Отрисовка на форме
	ГруппаСтроки = Группа("Группа" + ИмяРеквизита, Форма, ДобавляемыйВид.Наименование, ИмяЭлементаДляРазмещения);
	
//	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
//		ГруппаСтроки.ОтображатьЗаголовок = Истина;
//	КонецЕсли;
	
	Родитель = Родитель(Форма, ИмяЭлементаДляРазмещения);
	Если Не ЭтоПоследняяСтрока Тогда
//		Если СледующаяСтрока = Неопределено Тогда
			ИмяСледующейГруппы = "Группа" + ПоследняяСтрока.ИмяРеквизита;
			Если Форма.Элементы.Найти(ИмяСледующейГруппы) <> Неопределено Тогда
				ИндексСледующейГруппы = Родитель.ПодчиненныеЭлементы.Индекс(Форма.Элементы[ИмяСледующейГруппы]) + 1;
				СледующаяГруппа = Родитель.ПодчиненныеЭлементы.Получить(ИндексСледующейГруппы);
			КонецЕсли;
//		Иначе
//			ИмяГруппы = "Группа" + СледующаяСтрока.ИмяРеквизита;
//			Если Форма.Элементы.Найти(ИмяГруппы) <> Неопределено Тогда
//				СледующаяГруппа = Форма.Элементы[ИмяГруппы];
//			КонецЕсли;
//		КонецЕсли;
		Форма.Элементы.Переместить(ГруппаСтроки, Родитель, СледующаяГруппа);
//	ИначеЕсли ДобавлениеНовогоЗначения Тогда
//		СледующаяГруппа = Форма.Элементы[Результат.ИмяКоманды].Родитель;
//		Форма.Элементы.Переместить(ГруппаСтроки, Родитель, СледующаяГруппа);
	КонецЕсли;
//	
//	// Обработка ситуации, когда на форме выводится одновременно множественная динамическая и статическая контактная информация.
//	ИмяСледующейГруппыТекущегоВида = "Группа" + ИмяРеквизита;
//	Если Форма.Элементы.Найти(ИмяСледующейГруппыТекущегоВида) <> Неопределено Тогда
//		
//		Отбор = Новый Структура("ИмяРеквизита", ИмяРеквизита);
//		НайденныеСтрокиТекущегоВида = ТаблицаКонтактнойИнформации.НайтиСтроки(Отбор);
//		Если НайденныеСтрокиТекущегоВида.Количество() > 0 Тогда
//			ТекущийВид = НайденныеСтрокиТекущегоВида[0].Вид;
//		КонецЕсли;
//		
//		ИндексПредыдущейГруппыВида = Родитель.ПодчиненныеЭлементы.Индекс(Форма.Элементы[ИмяСледующейГруппыТекущегоВида]) - 1;
//		Если ИндексПредыдущейГруппыВида >= 0 Тогда
//			ПредыдущаяГруппаВида = Родитель.ПодчиненныеЭлементы.Получить(ИндексПредыдущейГруппыВида);
//			
//			Если ПредыдущаяГруппаВида <> Неопределено Тогда
//			
//			Отбор = Новый Структура("ИмяРеквизита", СтрЗаменить(ПредыдущаяГруппаВида.Имя, "Группа", ""));
//			НайденныеСтрокиПредыдущегоВида = ТаблицаКонтактнойИнформации.НайтиСтроки(Отбор);
//			Если НайденныеСтрокиПредыдущегоВида.Количество() > 0 Тогда
//				ПредыдущийВид = НайденныеСтрокиПредыдущегоВида[0].Вид;
//			КонецЕсли;
//			
//			Если ТекущийВид <> ПредыдущийВид Тогда
//				ЭтоНовыйВидКИ = Истина;
//			КонецЕсли;
//			КонецЕсли;
//		Иначе
//			ЭтоНовыйВидКИ = Истина;
//		КонецЕсли;
//	КонецЕсли;
	
	ПолеВвода = СоздатьПолеВвода(Форма, ГруппаСтроки, ИнформацияОВидеКИ, ИмяРеквизита, ИмяЭлементаДляРазмещения);
	
//	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
//		ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
//	КонецЕсли;
//	
//	Если ЕстьКомментарий Тогда
//		ПолеВвода.РасширеннаяПодсказка.Заголовок              = ИнформацияОВидеКИ.Комментарий;
//		ПолеВвода.РасширеннаяПодсказка.АвтоМаксимальнаяШирина = Ложь;
//		ПолеВвода.РасширеннаяПодсказка.МаксимальнаяШирина     = ПолеВвода.Ширина;
//		ПолеВвода.РасширеннаяПодсказка.Ширина                 = ПолеВвода.Ширина;
//	КонецЕсли;
//	
//	Если КоличествоАдресов = Неопределено Тогда
//		ОтборПоТипу = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
//		КоличествоАдресов = ТаблицаКонтактнойИнформации.НайтиСтроки(ОтборПоТипу).Количество();
//	КонецЕсли;
//	
//	СоздатьДействие(Форма, ИнформацияОВидеКИ, ИмяРеквизита, ГруппаСтроки, КоличествоАдресов, ЕстьКомментарий, ИмяЭлементаДляРазмещения);
//	
//	Если Не ЭтоНовыйВидКИ Тогда
//		Если ТаблицаКонтактнойИнформации.Количество() > 1 И ТаблицаКонтактнойИнформации[0].Свойство("ЭтоИсторическаяКонтактнаяИнформация") Тогда
//			ПунктКонтекстногоМенюПеремещения(ПолеВвода, Форма, 1, ИмяЭлементаДляРазмещения);
//			НайденныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(ОтборПоВиду);
//			Если НайденныеСтроки.Количество() > 1 Тогда
//				ПредыдущаяСтрока = НайденныеСтроки.Получить(НайденныеСтроки.Количество() - 2);
//				ПунктКонтекстногоМенюПеремещения(Форма.Элементы[ПредыдущаяСтрока.ИмяРеквизита], Форма, - 1, ИмяЭлементаДляРазмещения);
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Если ДобавлениеНовогоЗначения Тогда
//		Форма.ТекущийЭлемент = Форма.Элементы[ИмяРеквизита];
//		Если ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес
//			И ИнформацияОВидеКИ.РедактированиеТолькоВДиалоге Тогда
//			Результат.Вставить("ЭлементФормыАдреса", ИмяРеквизита);
//		КонецЕсли;
//	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьПолеВвода(Форма, Родитель, ИнформацияОВидеКИ, ИмяРеквизита, ИмяЭлементаДляРазмещения)
	
//	ПараметрыДополнительнойКонтактнойИнформации = ПараметрыДополнительнойКонтактнойИнформацииФормы(Форма.ПараметрыДополнительнойКонтактнойИнформации, ИмяЭлементаДляРазмещения);
//	ОбработкаНавигационнойСсылки = ПараметрыКонтактнойИнформации.ОбработкаНавигационнойСсылки;
//	
//	ЗаголовокСлева = ЗаголовокСлева(ПараметрыКонтактнойИнформации.ПоложениеЗаголовка);
	Элемент = Форма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Родитель);
	Элемент.ПутьКДанным = ИмяРеквизита;
	Элемент.Заголовок = ИнформацияОВидеКИ.ЗаголовокЭлемента;
	
//	Если ИнформацияОВидеКИ.РедактированиеТолькоВДиалоге И ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
//		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
//		Элемент.Гиперссылка = Истина;
//		Элемент.УстановитьДействие("Нажатие", "Подключаемый_КонтактнаяИнформацияПриНажатии");
//		Если ПустаяСтрока(Форма[ИмяРеквизита]) Тогда
//			Форма[ИмяРеквизита] = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки();
//		КонецЕсли;
//		
//	ИначеЕсли ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница И ОбработкаНавигационнойСсылки Тогда
//		
//		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
//		Элемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки");
//		
//		Если ТипЗнч(ИнформацияОВидеКИ) <> Тип("Структура") И УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(ИнформацияОВидеКИ.Значение) Тогда
//			КонтактнаяИнформация = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(ИнформацияОВидеКИ.Значение, Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
//			АдресСайта    = КонтактнаяИнформация.value;
//			Представление = ?(КонтактнаяИнформация.Свойство("name") И ЗначениеЗаполнено(КонтактнаяИнформация.name), КонтактнаяИнформация.name, ИнформацияОВидеКИ.Представление);
//		Иначе
//			АдресСайта = "";
//			Представление = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки();
//		КонецЕсли;
//		
//		Форма[ИмяРеквизита] = УправлениеКонтактнойИнформациейКлиентСервер.АдресСайта(Представление, АдресСайта);
//		
//	Иначе
//		
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
//		Элемент.УстановитьДействие("Очистка",         "Подключаемый_КонтактнаяИнформацияОчистка");
//		
		Если ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
//			Элемент.УстановитьДействие("Автоподбор",      "Подключаемый_КонтактнаяИнформацияАвтоподбор");
//			Элемент.УстановитьДействие("ОбработкаВыбора", "Подключаемый_КонтактнаяИнформацияОбработкаВыбора");
			Элемент.УстановитьДействие("Открытие", 	   "Подключаемый_ДополнительнаяКонтактнаяИнформацияОткрытие");
			Элемент.КнопкаОткрытия = Истина;
		КонецЕсли;
//		Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
//			Элемент.МногострочныйРежим = Истина;
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
//	Элемент.РастягиватьПоГоризонтали = Ложь;
//	Элемент.РастягиватьПоВертикали = Ложь;
//	
//	Элемент.ВысотаЗаголовка = ?(ОбщегоНазначения.ЭтоМобильныйКлиент(), 1, 2);
//	
//	Если ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
//		Элемент.Ширина = 70;
//	ИначеЕсли ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
//		Если ИнформацияОВидеКИ.ВидПоляДругое = "МногострочноеШирокое" Тогда
//			Элемент.Высота = 3;
//			Элемент.Ширина = 70;
//			Элемент.МногострочныйРежим = Истина;
//		ИначеЕсли ИнформацияОВидеКИ.ВидПоляДругое = "ОднострочноеШирокое" Тогда
//			Элемент.Высота = 1;
//			Элемент.Ширина = 70;
//			Элемент.МногострочныйРежим = Ложь;
//		Иначе // ОднострочноеУзкое
//			Элемент.Высота = 1;
//			Элемент.Ширина = 35;
//			Элемент.МногострочныйРежим = Ложь;
//		КонецЕсли;
//	Иначе
//		Элемент.Ширина = 35;
//	КонецЕсли;
//	
//	Если Не ЭтоНовыйВидКИ Тогда
//		Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
//		Элемент.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветФонаФормы;
//	КонецЕсли;
//	
//	Элемент.ПоложениеЗаголовка = ?(ЗаголовокСлева, ПоложениеЗаголовкаЭлементаФормы.Лево, ПоложениеЗаголовкаЭлементаФормы.Верх);
//	Если ЗаголовокСлева Тогда
//		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
//	Иначе
//		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
//	КонецЕсли;
//	
//	ПараметрыДополнительнойКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяРеквизита, 2, Ложь);
	
//	// Устанавливаем свойства поля ввода.
//	Если ИнформацияОВидеКИ.Тип <> Перечисления.ТипыКонтактнойИнформации.Другое И Не ИнформацияОВидеКИ.ПометкаУдаления Тогда
//		// Ввод комментария через контекстное меню.
//		ИмяКоманды = "КонтекстноеМеню" + ИмяРеквизита;
//		Кнопка = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), Элемент.КонтекстноеМеню);
//		Кнопка.Заголовок = НСтр("ru = 'Ввести комментарий'");
//		Команда = Форма.Команды.Добавить(ИмяКоманды);
//		Команда.Подсказка = НСтр("ru = 'Ввести комментарий'");
//		Команда.Картинка = БиблиотекаКартинок.Комментарий;
//		Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
//		Команда.ИзменяетСохраняемыеДанные = Истина;
//		Кнопка.ИмяКоманды = ИмяКоманды;
//		
//		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
//		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
//	КонецЕсли;
//	
//	Если ИнформацияОВидеКИ.ХранитьИсториюИзменений И Не ИнформацияОВидеКИ.ПометкаУдаления Тогда
//		// Вывод истории контактной информации через контекстное меню.
//		ИмяКоманды = "КонтекстноеМенюИстория" + ИмяРеквизита;
//		Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элемент.КонтекстноеМеню);
//		Кнопка.Заголовок = НСтр("ru = 'История изменений...'");
//		Команда = Форма.Команды.Добавить(ИмяКоманды);
//		Команда.Картинка = БиблиотекаКартинок.ИсторияИзменений;
//		Команда.Подсказка = НСтр("ru = 'Показывает историю изменения контактной информации'");
//		Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
//		Команда.ИзменяетСохраняемыеДанные = Ложь;
//		Кнопка.ИмяКоманды = ИмяКоманды;
//		
//		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
//		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
//	КонецЕсли;
//	
//	Если ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
//		ГруппаРазделительКарты = Форма.Элементы.Добавить("ПодменюРазделительКонтекстКарты" + ИмяРеквизита, Тип("ГруппаФормы"), Элемент.КонтекстноеМеню);
//		ГруппаРазделительКарты.Вид = ВидГруппыФормы.ГруппаКнопок;
//		
//		ИмяКоманды = "КонтекстноеМенюКартаЯндекс" + ИмяРеквизита;
//		Кнопка = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРазделительКарты);
//		Кнопка.Заголовок = НСтр("ru = 'Адрес на Яндекс.Картах'");
//		Команда = Форма.Команды.Добавить(ИмяКоманды);
//		Команда.Картинка = БиблиотекаКартинок.ЯндексКарты;
//		Команда.Подсказка = НСтр("ru = 'Показывает адрес на картах Яндекс.Карты'");
//		Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
//		Кнопка.ИмяКоманды = ИмяКоманды;
//		
//		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
//		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
//		
//		ИмяКоманды = "КонтекстноеМенюКартаGoogle" + ИмяРеквизита;
//		Кнопка = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРазделительКарты);
//		Кнопка.Заголовок = НСтр("ru = 'Адрес на Google Maps'");
//		Команда = Форма.Команды.Добавить(ИмяКоманды);
//		Команда.Картинка = БиблиотекаКартинок.GoogleMaps;
//		Команда.Подсказка = НСтр("ru = 'Показывает адрес на карте Google Maps'");
//		Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
//		Кнопка.ИмяКоманды = ИмяКоманды;
//		
//		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
//		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
//		
//		ГруппКнопокРазделитель = Форма.Элементы.Добавить("ПодменюРазделительКарты" + ИмяРеквизита, Тип("ГруппаФормы"), Элемент.КонтекстноеМеню);
//		ГруппКнопокРазделитель.Вид = ВидГруппыФормы.ГруппаКнопок;
//		
//		Если Не ИнформацияОВидеКИ.ПометкаУдаления Тогда
//			// Заполнить
//			ГруппаПодменюАдреса = Форма.Элементы.Добавить("КонтекстноеПодменюКопироватьАдреса" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппКнопокРазделитель);
//			ГруппаПодменюАдреса.Вид = ВидГруппыФормы.Подменю;
//			ГруппаПодменюАдреса.Отображение = ОтображениеКнопки.Текст;
//			ГруппаПодменюАдреса.Заголовок = НСтр("ru='Заполнить'");
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если ОбязательноеЗаполнение И ЭтоНовыйВидКИ И Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
//		Элемент.АвтоОтметкаНезаполненного = Истина;
//	КонецЕсли;
//	
//	// Редактирование в диалоге
//	Если ДляТипаКонтактнойИнформацииДоступноРедактированиеВДиалоге(ИнформацияОВидеКИ.Тип) 
//		И Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
//		
//		Элемент.КнопкаВыбора = Не ИнформацияОВидеКИ.ПометкаУдаления;
//		Если ИнформацияОВидеКИ.РедактированиеТолькоВДиалоге Тогда
//			Элемент.РедактированиеТекста = Ложь;
//			Элемент.ЦветФона = ЦветаСтиля.КонтактнаяИнформацияСРедактированиемВДиалогеЦвет;
//		КонецЕсли;
//		Элемент.УстановитьДействие("НачалоВыбора", "Подключаемый_КонтактнаяИнформацияНачалоВыбора");
//		
//	КонецЕсли;
	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ДополнительнаяКонтактнаяИнформацияПриИзменении");
	
	
//	Если ИнформацияОВидеКИ.ПометкаУдаления Тогда
//		
//		Элемент.ШрифтЗаголовка       = Новый Шрифт(,,,,, Истина);
//		Если Не ИнформацияОВидеКИ.РедактированиеТолькоВДиалоге Тогда
//			Элемент.КнопкаОчистки        = Истина;
//			Элемент.РедактированиеТекста = Ложь;
//		Иначе
//			Элемент.ТолькоПросмотр       = Истина;
//		КонецЕсли;
//		
//	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

Функция Группа(ИмяГруппы, Форма, Заголовок, ИмяЭлементаДляРазмещения)
	
	Группа = Форма.Элементы.Найти(ИмяГруппы);
	
	Если Группа = Неопределено Тогда
		Родитель = Родитель(Форма, ИмяЭлементаДляРазмещения);
		Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
			Родитель.ШрифтЗаголовка = Новый Шрифт(,, Истина);
		КонецЕсли;
		Группа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Родитель);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Заголовок = Заголовок;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.РазрешитьИзменениеСостава = Ложь;
		Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		//ПараметрыДополнительнойКонтактнойИнформации = ПараметрыДополнительнойКонтактнойИнформацииФормы(Форма.ПараметрыДополнительнойКонтактнойИнформации, ИмяЭлементаДляРазмещения);
		//ПараметрыДополнительнойКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяГруппы, 5);
	КонецЕсли;
	
	Возврат Группа;
	
КонецФункции

Процедура ПроверитьНаличиеРеквизитовКонтактнойИнформации(Форма, МассивДобавляемыхРеквизитов)
	
	СписокРеквизитовФормы = Форма.ПолучитьРеквизиты();
	
	СоздатьПараметрыКонтактнойИнформации = Истина;
	СоздатьТаблицуКонтактнойИнформации = Истина;
	Для Каждого Реквизит Из СписокРеквизитовФормы Цикл
		Если Реквизит.Имя = "ПараметрыДополнительнойКонтактнойИнформации" Тогда
			СоздатьПараметрыКонтактнойИнформации = Ложь;
		ИначеЕсли Реквизит.Имя = "ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов" Тогда
			СоздатьТаблицуКонтактнойИнформации = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Строка500 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500));
	ИмяОписания = "ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов";
	
	Если СоздатьТаблицуКонтактнойИнформации Тогда		
		// Создадим таблицу значений
		ИмяОписания = "ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов";
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяОписания, Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИмяРеквизита", Строка500, ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяОписания));
//		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Значение", Новый ОписаниеТипов("Строка"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Представление", Строка500, ИмяОписания));
//		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Комментарий", Новый ОписаниеТипов("Строка"), ИмяОписания));
//		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЭтоРеквизитТабличнойЧасти", Новый ОписаниеТипов("Булево"), ИмяОписания));
//		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЭтоИсторическаяКонтактнаяИнформация", Новый ОписаниеТипов("Булево"), ИмяОписания));
//		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДействуетС", Новый ОписаниеТипов("Дата"), ИмяОписания));
//		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ХранитьИсториюИзменений", Новый ОписаниеТипов("Булево"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИмяЭлементаДляРазмещения", Строка500, ИмяОписания));
//		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("МеждународныйФорматАдреса", Новый ОписаниеТипов("Булево"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИдентификаторСтрокиТабличнойЧасти", Новый ОписаниеТипов("УникальныйИдентификатор"), ИмяОписания));
	Иначе
		РеквизитыТаблицы = Форма.ПолучитьРеквизиты("ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов");
		РеквизитыДляСоздания = Новый Соответствие;
		РеквизитыДляСоздания.Вставить("ИмяЭлементаДляРазмещения",            Истина);
//		РеквизитыДляСоздания.Вставить("ХранитьИсториюИзменений",             Истина);
//		РеквизитыДляСоздания.Вставить("ДействуетС",                          Истина);
//		РеквизитыДляСоздания.Вставить("ЭтоИсторическаяКонтактнаяИнформация", Истина);
//		РеквизитыДляСоздания.Вставить("Значение",                            Истина);
//		РеквизитыДляСоздания.Вставить("МеждународныйФорматАдреса",           Истина);
		
		Для Каждого Реквизит Из РеквизитыТаблицы Цикл
			Если РеквизитыДляСоздания[Реквизит.Имя] <> Неопределено Тогда
				РеквизитыДляСоздания[Реквизит.Имя] = Ложь;
			КонецЕсли;
		КонецЦикла;
		
//		Если РеквизитыДляСоздания["Значение"] Тогда
//			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Значение", Новый ОписаниеТипов("Строка"), ИмяОписания));
//		КонецЕсли;
//		
//		Если РеквизитыДляСоздания["МеждународныйФорматАдреса"] Тогда
//			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("МеждународныйФорматАдреса", Новый ОписаниеТипов("Булево"), ИмяОписания));
//		КонецЕсли;
//		
//		Если РеквизитыДляСоздания["ИмяЭлементаДляРазмещения"] Тогда
//			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИмяЭлементаДляРазмещения", Строка500, ИмяОписания));
//		КонецЕсли;
//		
//		Если РеквизитыДляСоздания["ХранитьИсториюИзменений"] Тогда
//			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ХранитьИсториюИзменений", Новый ОписаниеТипов("Булево"), ИмяОписания));
//		КонецЕсли;
//		
//		Если РеквизитыДляСоздания["ДействуетС"] Тогда
//			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДействуетС", Новый ОписаниеТипов("Дата"), ИмяОписания));
//		КонецЕсли;
//		
//		Если РеквизитыДляСоздания["ЭтоИсторическаяКонтактнаяИнформация"] Тогда
//			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЭтоИсторическаяКонтактнаяИнформация", Новый ОписаниеТипов("Булево"), ИмяОписания));
//		КонецЕсли;
//		
	КонецЕсли;
	
	Если СоздатьПараметрыКонтактнойИнформации Тогда
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПараметрыДополнительнойКонтактнойИнформации", Новый ОписаниеТипов()));
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРеквизитВОписание(Форма, СтрокаКонтактнойИнформации, ДанныеВидовКонтактнойИнформации, ЭтоНовыйВидКИ, ИмяЭлементаДляРазмещения)
	
	Если ЗначениеЗаполнено(СтрокаКонтактнойИнформации.Представление) ИЛИ СтрокаКонтактнойИнформации.Обязательное Тогда
	НоваяСтрока = Форма.ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов.Добавить();
	НоваяСтрока.ИмяРеквизита  = СтрокаКонтактнойИнформации.ИмяРеквизита;
	НоваяСтрока.Вид           = СтрокаКонтактнойИнформации.Вид;
	НоваяСтрока.Тип           = СтрокаКонтактнойИнформации.Тип;
	НоваяСтрока.ИмяЭлементаДляРазмещения  = ИмяЭлементаДляРазмещения; 	
//	НоваяСтрока.Значение      = СтрокаКонтактнойИнформации.Значение;
	НоваяСтрока.Представление = СтрокаКонтактнойИнформации.Представление;
//	НоваяСтрока.Комментарий   = СтрокаКонтактнойИнформации.Комментарий;
	НоваяСтрока.ИдентификаторСтрокиТабличнойЧасти = СтрокаКонтактнойИнформации.ИдентификаторСтрокиТабличнойЧасти;
	
//	Если ЗаполнятьЗначениеРеквизита И Не ЭтоРеквизитТабличнойЧасти Тогда
//		Если СтрокаКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес 
//			И СтрокаКонтактнойИнформации.РедактированиеТолькоВДиалоге
//			И ПустаяСтрока(СтрокаКонтактнойИнформации.Представление) Тогда
//			Форма[СтрокаКонтактнойИнформации.ИмяРеквизита] = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки();
//		Иначе
			Форма[СтрокаКонтактнойИнформации.ИмяРеквизита] = СтрокаКонтактнойИнформации.Представление;
//		КонецЕсли;
//		
	КонецЕсли;
	
	ДанныеВидаКонтактнойИнформации = ДанныеВидовКонтактнойИнформации[СтрокаКонтактнойИнформации.Вид];
	ДанныеВидаКонтактнойИнформации.Вставить("Ссылка", СтрокаКонтактнойИнформации.Вид);
	
	Если ЭтоНовыйВидКИ Тогда
		ПараметрыДополнительнойКонтактнойИнформации = ПараметрыДополнительнойКонтактнойИнформацииФормы(Форма.ПараметрыДополнительнойКонтактнойИнформации, ИмяЭлементаДляРазмещения);
		ПараметрыДополнительнойКонтактнойИнформации.СписокДобавляемыхЭлементов.Добавить(ДанныеВидаКонтактнойИнформации, СтрокаКонтактнойИнформации.ЗаголовокЭлемента); //СтрокаКонтактнойИнформации.Вид.Наименование);
	КонецЕсли;
	
КонецПроцедуры

Функция Родитель(Форма, ИмяЭлементаДляРазмещения)
	
	Возврат ?(ПустаяСтрока(ИмяЭлементаДляРазмещения), Форма, Форма.Элементы[ИмяЭлементаДляРазмещения])
	
КонецФункции

Функция ПараметрыВыводаДополнительнойКонтактнойИнформации(Форма, ИмяЭлементаДляРазмещения)
	
	Если ТипЗнч(Форма.ПараметрыДополнительнойКонтактнойИнформации) <> Тип("Структура") Тогда
		Форма.ПараметрыДополнительнойКонтактнойИнформации = Новый Структура;
	КонецЕсли;
	
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОтправкаSMS") Тогда
//		МодульОтправкаSMS  = ОбщегоНазначения.ОбщийМодуль("ОтправкаSMS");
//		МожноОтправлятьSMS = МодульОтправкаSMS.ДоступнаОтправкаSMS();
//	Иначе
//		МожноОтправлятьSMS = Ложь;
//	КонецЕсли;
//	
	ПараметрыКонтактнойИнформации = Новый Структура;
	ПараметрыКонтактнойИнформации.Вставить("ГруппаДляРазмещения",              ИмяЭлементаДляРазмещения);
//	ПараметрыКонтактнойИнформации.Вставить("ПоложениеЗаголовка",               ЗначениеПоложенияЗаголовкаКИ(ПоложениеЗаголовкаКИ));
//	ПараметрыКонтактнойИнформации.Вставить("ДобавленныеРеквизиты",             Новый СписокЗначений); 
//	ПараметрыКонтактнойИнформации.Вставить("ОтложеннаяИнициализация",          ОтложеннаяИнициализация);
//	ПараметрыКонтактнойИнформации.Вставить("ИсключаемыеВиды",                  ИсключаемыеВиды);
//	ПараметрыКонтактнойИнформации.Вставить("ВыполненаОтложеннаяИнициализация", Ложь);
//	ПараметрыКонтактнойИнформации.Вставить("ДобавленныеЭлементы",              Новый СписокЗначений);
	ПараметрыКонтактнойИнформации.Вставить("СписокДобавляемыхЭлементов",       Новый СписокЗначений);
//	ПараметрыКонтактнойИнформации.Вставить("МожноОтправлятьSMS",               МожноОтправлятьSMS);
//	ПараметрыКонтактнойИнформации.Вставить("Владелец",                         Неопределено);
//	ПараметрыКонтактнойИнформации.Вставить("ОбработкаНавигационнойСсылки",     Ложь);
//	ПараметрыКонтактнойИнформации.Вставить("СкрываемыеВиды",                   СкрываемыеВиды);
//	
//	ПараметрыАдреса = Новый Структура("ТипПомещения, Страна, Индекс", "Квартира");
//	ПараметрыКонтактнойИнформации.Вставить("ПараметрыАдреса", ПараметрыАдреса);
	
	Форма.ПараметрыДополнительнойКонтактнойИнформации.Вставить(ИмяЭлементаДляРазмещения, ПараметрыКонтактнойИнформации);
	Возврат Форма.ПараметрыДополнительнойКонтактнойИнформации[ИмяЭлементаДляРазмещения];
	
КонецФункции

Функция ПараметрыДополнительнойКонтактнойИнформацииФормы(ПараметрыДополнительнойКонтактнойИнформации, ИмяЭлементаДляРазмещения)
	
	Если НЕ ЗначениеЗаполнено(ИмяЭлементаДляРазмещения) ИЛИ НЕ ПараметрыДополнительнойКонтактнойИнформации.Свойство(ИмяЭлементаДляРазмещения) Тогда
		Для каждого ПерваяЗапись Из ПараметрыДополнительнойКонтактнойИнформации Цикл
			Возврат ПерваяЗапись.Значение;
		КонецЦикла;
		Возврат ПараметрыДополнительнойКонтактнойИнформации;
	КонецЕсли;
	
	Возврат ПараметрыДополнительнойКонтактнойИнформации[ИмяЭлементаДляРазмещения];
	
КонецФункции

Функция КонтактнаяИнформацияИзРеквизитовФормы(Форма, Объект)
	
	КонтактнаяИнформация = НоваяКонтактнаяИнформация(Ложь);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	ИмяОбъектаМетаданных = МетаданныеОбъекта.Имя;
	ПолноеИмяОбъектаМетаданных = МетаданныеОбъекта.ПолноеИмя();
//	ГруппаВидовКонтактнойИнформации = ГруппаВидовКонтактнойИнформацииОбъекта(ПолноеИмяОбъектаМетаданных);
//	ИменаТабличныхЧастейПоВидамКИ = Неопределено;

	КодСтраны = СофтФон.ПолучитьТелефонныйКодСтраныПользователя();

	Для Каждого СтрокаТаблицы Из Форма.ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов Цикл
		
		ИмяРеквизита  = СтрокаТаблицы.ИмяРеквизита;
		
		Элемент = Форма.Элементы.Найти(ИмяРеквизита);
//		Если Элемент <> Неопределено Тогда
//			Если Элемент.Вид = ВидПоляФормы.ПолеНадписи И Элемент.Гиперссылка Тогда
				Если ПустаяСтрока(СтрокаТаблицы.Представление)
					ИЛИ СтрокаТаблицы.Представление = КодСтраны Тогда
					Продолжить;
				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//		
//		ВосстановитьПустыеЗначениеПредставление(СтрокаТаблицы);
//		
//		Если СтрокаТаблицы.ЭтоРеквизитТабличнойЧасти Тогда
//			
//			Если ИменаТабличныхЧастейПоВидамКИ = Неопределено Тогда
//				Отбор = Новый Структура("ЭтоРеквизитТабличнойЧасти", Истина);
//				ВидыКИТабличнойЧасти = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Выгрузить(Отбор, "Вид");
//				ИменаТабличныхЧастейПоВидамКИ = ИменаТабличныхЧастейПоВидамКИ(ВидыКИТабличнойЧасти, ИмяОбъектаМетаданных);
//			КонецЕсли;
//			
//			ИмяТабличнойЧасти = ИменаТабличныхЧастейПоВидамКИ[СтрокаТаблицы.Вид];
//			ТабличнаяЧастьФормы = Форма.Объект[ИмяТабличнойЧасти];
//			Для Каждого СтрокаТабличнойЧастиФормы Из ТабличнаяЧастьФормы Цикл
//				
//				ИдентификаторСтроки = СтрокаТабличнойЧастиФормы.ПолучитьИдентификатор();
//				СтрокаТабличнойЧастиФормы.ИдентификаторСтрокиТабличнойЧасти = ИдентификаторСтроки;
//				
//				СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти][СтрокаТабличнойЧастиФормы.НомерСтроки - 1];
//				СтрокаТабличнойЧасти.ИдентификаторСтрокиТабличнойЧасти = ИдентификаторСтроки;
//				
//				Значение = СтрокаТабличнойЧастиФормы[ИмяРеквизита + "Значение"];
//				
//				ПеренестиЗаписьКонтактнойИнформацииИзФормыВТаблицу(КонтактнаяИнформация, СтрокаТаблицы, Значение, ИдентификаторСтроки);
//				
//			КонецЦикла;
//			
//		Иначе
//			
//			Если СтрокаТаблицы.Вид.Родитель <> ГруппаВидовКонтактнойИнформации Тогда
//				Продолжить;
//			КонецЕсли;
//			
			ПеренестиЗаписьКонтактнойИнформацииИзФормыВТаблицу(КонтактнаяИнформация, СтрокаТаблицы);
			
//		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КонтактнаяИнформация;
	
КонецФункции

Процедура ПеренестиЗаписьКонтактнойИнформацииИзФормыВТаблицу(КонтактнаяИнформация, СтрокаТаблицы)
	
	//Если ПустаяСтрока(СтрокаТаблицы.Представление) Тогда
	//	Возврат;
	//КонецЕсли;
	
//	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(Значение) Тогда
//		ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияВСтруктуруJSON(Значение, СтрокаТаблицы.Тип);
//	Иначе
//		ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(Значение, СтрокаТаблицы.Тип);
//	КонецЕсли;
//	
//	Если Не УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияЗаполнена(ОбъектКИ) Тогда
//		Возврат;
//	КонецЕсли;
//	
	СтрокаКонтактнойИнформации = КонтактнаяИнформация.Добавить();
//	
//	ДействуетС = ?(СтрокаТаблицы.Свойство("ДействуетС"), СтрокаТаблицы.ДействуетС, Неопределено);
	ЗаполнитьЗначенияСвойств(СтрокаКонтактнойИнформации, СтрокаТаблицы, "Вид,Тип,Представление,ИдентификаторСтрокиТабличнойЧасти");
	
//	СтрокаКонтактнойИнформации.Представление = ОбъектКИ.Value;
//	СтрокаКонтактнойИнформации.Значение      = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(ОбъектКИ);
//	СтрокаКонтактнойИнформации.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзJSONВXML(ОбъектКИ, СтрокаТаблицы.Тип);
//	
//	Если ЗначениеЗаполнено(ДействуетС) Тогда
//		СтрокаКонтактнойИнформации.Дата    = ДействуетС;
//	КонецЕсли;
	
//	СтрокаКонтактнойИнформации.ИдентификаторСтрокиТабличнойЧасти = ИдентификаторСтроки;
	
КонецПроцедуры

// Убирает разделители в номере телефона.
//
// Параметры:
//    НомерТелефона - Строка - номер телефона или факса.
//
// Возвращаемое значение:
//     Строка - номер телефона или факса без разделителей.
//
Функция УбратьРазделителиВНомерТелефона(Знач НомерТелефона)
	
	Поз = СтрНайти(НомерТелефона, ",");
	Если Поз <> 0 Тогда
		НомерТелефона = Лев(НомерТелефона, Поз-1);
	КонецЕсли;
	
	НомерТелефона = СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, " ", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "+", "");
	
	Возврат НомерТелефона;
	
КонецФункции

Процедура ЗаполнитьТехническиеПоляКонтактнойИнформации(СтрокаКонтактнойИнформации, ТипКонтактнойИнформации)
	
	// Заполнение дополнительных реквизитов ТЧ.
	Если ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
//		ЗаполнитьРеквизитыТабличнойЧастиДляАдресаЭлектроннойПочты(СтрокаКонтактнойИнформации, Объект);
//		
//	ИначеЕсли ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
//		ЗаполнитьРеквизитыТабличнойЧастиДляАдреса(СтрокаКонтактнойИнформации, Объект);
		
	ИначеЕсли ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ЗаполнитьРеквизитыТабличнойЧастиДляТелефона(СтрокаКонтактнойИнформации);
		
//	ИначеЕсли ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
//		ЗаполнитьРеквизитыТабличнойЧастиДляТелефона(СтрокаКонтактнойИнформации, Объект);
//		
//	ИначеЕсли ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
//		ЗаполнитьРеквизитыТабличнойЧастиДляВебСтраницы(СтрокаКонтактнойИнформации, Объект);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет дополнительные реквизиты табличной части "Контактная информация" для телефона и факса.
//
// Параметры:
//    СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - заполняемая строка табличной части "Контактная информация".
//
Процедура ЗаполнитьРеквизитыТабличнойЧастиДляТелефона(СтрокаТабличнойЧасти)
	
	// Умолчания
	НомерАбонента = СтрокаТабличнойЧасти.Представление;
	СтрокаТабличнойЧасти.НомерТелефона = СофтФон.ОставитьТолькоЦифры(НомерАбонента);
	
КонецПроцедуры

Функция ПолучитьДанныеИзКонтактнойИнформацииФормыПоВиду(Форма, Вид, ТолькоПредставление) Экспорт
	
	Результат = Новый Массив;
	ОтборПоВиду = Новый Структура("Вид", Вид);
	НайденныеСтроки = Форма.ДополнительнаяКонтактнаяИнформацияОписаниеРеквизитов.НайтиСтроки(ОтборПоВиду);
	Для каждого СтрокаКИ из НайденныеСтроки Цикл
		Результат.Добавить(СтрокаКИ.Представление);
	КонецЦикла;
	
	Если ТолькоПредставление Тогда
		Если Результат.Количество() > 0 Тогда
			Возврат Результат[0];	
		Иначе			
			Возврат "";
		КонецЕсли;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТелефонИзКонтактнойИнформацииФормы(Форма, ТолькоПредставление) Экспорт
	
	Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента");
	Возврат ПолучитьДанныеИзКонтактнойИнформацииФормыпоВиду(Форма, Вид, ТолькоПредставление);
		
КонецФункции

Функция ПолучитьАдресПочтыИзКонтактнойИнформацииФормы(Форма, ТолькоПредставление) Экспорт
	
	Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailКонтрагента");
	Возврат ПолучитьДанныеИзКонтактнойИнформацииФормыПоВиду(Форма, Вид, ТолькоПредставление);
		
КонецФункции

Функция ПолучитьДанныеИзКонтактнойИнформацииОбъектаПоВиду(СсылкаИлиОбъект, ВидКИ, ТолькоПредставление) Экспорт
	
	// ДокументСсылка
	Если ТипЗнч(СсылкаИлиОбъект) = Тип("ДокументСсылка.Лид") Тогда
		Если ТолькоПредставление Тогда
			Возврат КонтактнаяИнформацияОбъекта(СсылкаИлиОбъект, ВидКИ, Истина);
		Иначе
		    Возврат КонтактнаяИнформацияОбъекта(СсылкаИлиОбъект, ВидКИ, Ложь, Истина);
		КонецЕсли;
	КонецЕсли;	
	
	// ДокументОбъект
	Результат = Новый Массив;
	
	ОтборПоВиду = Новый Структура("Вид", ВидКИ);
	НайденныеСтроки = СсылкаИлиОбъект.ДополнительнаяКонтактнаяИнформация.НайтиСтроки(ОтборПоВиду);	
	Для каждого СтрокаКИ из НайденныеСтроки Цикл
		Результат.Добавить(СтрокаКИ.Представление);
	КонецЦикла;
	
	Если ТолькоПредставление Тогда
		Если Результат.Количество() > 0 Тогда
			Возврат Результат[0];	
		Иначе			
			Возврат "";
		КонецЕсли;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТелефонИзКонтактнойИнформацииОбъекта(СсылкаИлиОбъект, ТолькоПредставление = Истина) Экспорт
	
	ВидКИ = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента");
	Возврат ПолучитьДанныеИзКонтактнойИнформацииОбъектаПоВиду(СсылкаИлиОбъект, ВидКИ, ТолькоПредставление);
	
КонецФункции

Функция ПолучитьАдресПочтыИзКонтактнойИнформацииОбъекта(СсылкаИлиОбъект, ТолькоПредставление) Экспорт

	ВидКИ = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailКонтрагента");
	Возврат ПолучитьДанныеИзКонтактнойИнформацииОбъектаПоВиду(СсылкаИлиОбъект, ВидКИ, ТолькоПредставление);
	
КонецФункции

Процедура ЗаполнитьКонтактнуюИнформациюОбъектаИзСтроки(СтрокаКонтактнойИнформацииОбъекта, СтрокаКонтактнойИнформации)
	
	ЗаполнитьЗначенияСвойств(СтрокаКонтактнойИнформации, СтрокаКонтактнойИнформацииОбъекта);
	
	Если ЗначениеЗаполнено(СтрокаКонтактнойИнформации.Представление) Тогда
		ЗаполнитьТехническиеПоляКонтактнойИнформации(СтрокаКонтактнойИнформации, СтрокаКонтактнойИнформацииОбъекта.Тип);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
