&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановкаФильтраНеВыполнены(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФильтраНеВыполнены(Команда)
	
	Если НЕ Элементы.ФормаУстановитьФильтрНеВыполнены.Пометка Тогда
		ЭО = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Выполнено");
		ЭО.ПравоеЗначение = Ложь;
		ЭО.Использование  = Истина;	
		Элементы.ФормаУстановитьФильтрНеВыполнены.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФильтрВсе(Команда)
	
	Элементы.ФормаУстановитьФильтрНеВыполнены.Пометка = Ложь;
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Выполнено");
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоМонтажам(Команда)
	
	ОткрытьФорму("Документ.ОбзвонКлиентов.Форма.ФормаСозданияПоМонтажам");
	
КонецПроцедуры
