
&НаКлиенте
Процедура КомандаОК(Команда)
	
	//превращаем дерево в таблицу
	СконвертироватьДерево();
	
	Струк = Новый Структура("СредстваКРаспределению, СальдоСредствКРаспределениюВзять,СДругихФондов,ТаблицаФондов,Займ,КрайнийСрок,ПричинаЗайма,Комментарий", 
							СредстваКРаспределению, СальдоСредствКРаспределениюВзять , СДругихФондов, ТаблицаФондовВозврат,Займ,КрайнийСрок,ПричинаЗайма, Комментарий);
	Закрыть(Струк);
	
КонецПроцедуры 

&НаСервере
Процедура СконвертироватьДерево()
	СконвертироватьДеревоВТаблицуФондов(ДеревоФондов)
КонецПроцедуры

&НаСервере
Процедура СконвертироватьДеревоВТаблицуФондов(ДеревоФондов)
	
	ЭлементыДерева = ДеревоФондов.ПолучитьЭлементы();
	Для каждого ЭлементДерева Из ЭлементыДерева  Цикл
		 Если ЭлементДерева.Редактирование Тогда
		 	   ЭлементТаблицыФондов = ТаблицаФондовВозврат.Добавить();
			   ЗаполнитьЗначенияСвойств(ЭлементТаблицыФондов, ЭлементДерева);
		 КонецЕсли;
		 СконвертироватьДеревоВТаблицуФондов(ЭлементДерева)  
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ВыводитьГруппировкуПоСчетам =  Константы.ИА_ФП_ВыводитьГруппировкуПоСчетам.Получить();
	ВыводитьГруппировкуПоСчетам = ложь;
	ИспПодразделения =  Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	Элементы.ДеревоФондовПодразделение.Видимость = ИспПодразделения;
	
	ЗаймПерем = ИА_НастройкиСПИ.ЗначениеНастройки(ПараметрыСеанса.ТекущийПользователь, ПредопределенноеЗначение("ПланВидовХарактеристик.ИА_НастройкиПользователей.ЗаймПеремещение"));
	Если ЗаймПерем = Перечисления.ИА_ТипПеремещенияСредств.Займ Тогда
		Займ = Истина;
	КонецЕсли;
	//

	Заполнить();
	
	ТаблицаФондов = Новый ТаблицаЗначений;
	
	ТаблицаФондов.Колонки.Добавить("Счет",          Новый ОписаниеТипов("СправочникСсылка.ИА_Счета"));
	ТаблицаФондов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ИА_ЦФО"));
	ТаблицаФондов.Колонки.Добавить("Фонд",          Новый ОписаниеТипов("СправочникСсылка.ИА_Фонды"));
	ТаблицаФондов.Колонки.Добавить("Остаток", Новый ОписаниеТипов("Число"));
	ТаблицаФондов.Колонки.Добавить("Взять",   Новый ОписаниеТипов("Число"));
	
	Для каждого СтрокаИсхТаблицы из ИсхТаблица Цикл
		Если ЗначениеЗаполнено(СтрокаИсхТаблицы.Фонд) и (ЗначениеЗаполнено(СтрокаИсхТаблицы.Подразделение) ИЛИ не ИспПодразделения) и не (СтрокаИсхТаблицы.Фонд = Фонд и СтрокаИсхТаблицы.Подразделение = Подразделение) Тогда
			Остаток = СтрокаИсхТаблицы.ПослеФП_Остаток;
		
			Если Остаток > 0 Тогда
				СтрокаТаблицаФондов                = ТаблицаФондов.Добавить();
				СтрокаТаблицаФондов.Счет           = СтрокаИсхТаблицы.Счет;
				СтрокаТаблицаФондов.Подразделение  = СтрокаИсхТаблицы.Подразделение;
				СтрокаТаблицаФондов.Фонд           = СтрокаИсхТаблицы.Фонд;
				СтрокаТаблицаФондов.Остаток        = Остаток;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыводитьГруппировкуПоСчетам Тогда
		ТаблицаФондов.Свернуть("Счет, Подразделение, Фонд, Остаток, Взять");	
	иначе
		ТаблицаФондов.Свернуть("Подразделение, Фонд, Остаток, Взять");	
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаФондов", ТаблицаФондов);
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаФондов.Подразделение КАК Подразделение,
	               |	ТаблицаФондов.Фонд КАК Фонд,
	               |	ТаблицаФондов.Остаток КАК Остаток,
	               |	ТаблицаФондов.Взять КАК Взять
	               |ПОМЕСТИТЬ ТаблицаФондов
	               |ИЗ
	               |	&ТаблицаФондов КАК ТаблицаФондов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаФондов.Подразделение КАК Подразделение,
	               |	ТаблицаФондов.Фонд КАК Фонд,
	               |	ТаблицаФондов.Остаток КАК Остаток,
	               |	ТаблицаФондов.Взять КАК Взять,
	               |	ИА_ЦФО.Наименование КАК ПодразделениеНаименование,
	               |	ИА_Фонды.Код КАК ФондКод,
	               |	ИА_Фонды.Наименование КАК ФондНаименование,
	               |	ИСТИНА КАК Редактирование
	               |ПОМЕСТИТЬ ТаблицаФондовДоп
	               |ИЗ
	               |	ТаблицаФондов КАК ТаблицаФондов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_ЦФО КАК ИА_ЦФО
	               |		ПО ТаблицаФондов.Подразделение = ИА_ЦФО.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_Фонды КАК ИА_Фонды
	               |		ПО ТаблицаФондов.Фонд = ИА_Фонды.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаФондовДоп.Подразделение КАК Подразделение,
	               |	ТаблицаФондовДоп.Фонд КАК Фонд,
	               |	ТаблицаФондовДоп.Остаток КАК Остаток,
	               |	ТаблицаФондовДоп.Остаток КАК ОстатокИсх,
	               |	ТаблицаФондовДоп.Взять КАК Взять,
	               |	ТаблицаФондовДоп.ПодразделениеНаименование КАК ПодразделениеНаименование,
	               |	ТаблицаФондовДоп.ФондНаименование КАК ФондНаименование,
	               |	ТаблицаФондовДоп.Редактирование КАК Редактирование
	               |ИЗ
	               |	ТаблицаФондовДоп КАК ТаблицаФондовДоп
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПодразделениеНаименование,
	               |	ФондНаименование";
	
	Если ВыводитьГруппировкуПоСчетам Тогда
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		
		ЗапросСхемы0 = СхемаЗапроса.ПакетЗапросов[0];
		ВыбираемыеПоля0 =  ЗапросСхемы0.Операторы[0].ВыбираемыеПоля;
		ВыбираемыеПоля0.Добавить("ТаблицаФондов.Счет");
		
		ЗапросСхемы1 = СхемаЗапроса.ПакетЗапросов[1];
		ВыбираемыеПоля1 =  ЗапросСхемы1.Операторы[0].ВыбираемыеПоля;
		ВыбираемыеПоля1.Добавить("ТаблицаФондов.Счет");
		ВыбираемыеПоля1.Добавить("ВЫБОР КОГДА ТаблицаФондов.Счет = ЗНАЧЕНИЕ(Справочник.ИА_Счета.ГлавныйСчет) ТОГДА 0 ИНАЧЕ 200 КОНЕЦ");
		
		ЗапросСхемы1.Колонки[8].Псевдоним = "СчетПорядок";
		
		ЗапросСхемы2 = СхемаЗапроса.ПакетЗапросов[2];
		ВыбираемыеПоля2 =  ЗапросСхемы2.Операторы[0].ВыбираемыеПоля;
		ВыбираемыеПоля2.Добавить("ТаблицаФондовДоп.Счет");
		ВыбираемыеПоля2.Добавить("ТаблицаФондовДоп.СчетПорядок");
	
		
		Порядок = ЗапросСхемы2.Порядок;
				
		Порядок.Добавить(ЗапросСхемы2.Колонки[8]);
		Порядок.Сдвинуть(2,0);
		
		КонтрольныеТочкиИтогов = ЗапросСхемы2.КонтрольныеТочкиИтогов;
		КонтрольныеТочкиИтогов.Добавить(ЗапросСхемы2.Колонки[7]);	
		
		ВыраженияИтогов = ЗапросСхемы2.ВыраженияИтогов;
		ВыраженияИтогов.Добавить(Новый ВыражениеСхемыЗапроса("СУММА(Остаток)"));
		ВыраженияИтогов.Добавить(Новый ВыражениеСхемыЗапроса("СУММА(Взять)"));
		
		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Дерево = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Дерево.Колонки.Удалить("ПодразделениеНаименование");
	Дерево.Колонки.Удалить("ФондНаименование");
	Дерево.Колонки.Добавить("ИдентификаторТекущихДанных", Новый ОписаниеТипов("Число"));
	
	Если НЕ ВыводитьГруппировкуПоСчетам Тогда
		Дерево.Колонки.Добавить("Счет", Новый ОписаниеТипов("СправочникСсылка.ИА_Счета"));
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево,"ДеревоФондов");
	
	Элементы.ДеревоФондовСчет.Видимость = ВыводитьГруппировкуПоСчетам;
	
	Если ВыводитьГруппировкуПоСчетам Тогда
		Элементы.ДеревоФондов.Отображение = ОтображениеТаблицы.Дерево;
	иначе	
		Элементы.ДеревоФондов.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Заполнить()
	
	ПараметрыОтбора =  Неопределено;
	
	Если Параметры.Свойство("ПараметрыОтбора") Тогда
		ПараметрыОтбора =  Параметры.ПараметрыОтбора;
	КонецЕсли;
	
	Если ПараметрыОтбора <> Неопределено	Тогда 
		
		ВыходнаяТаблица = Параметры.ПараметрыОтбора.ВыходнаяТаблица;
		
		Если ВыходнаяТаблица.Количество() > 0 Тогда
			ИсхТаблица.Загрузить(ДанныеФормыВЗначение(ВыходнаяТаблица, Тип("ТаблицаЗначений")));
		КонецЕсли;
		
		ИсходнаяСумма = Параметры.ПараметрыОтбора.ИсходнаяСумма;
		Фонд = Параметры.ПараметрыОтбора.Фонд;
		Подразделение = Параметры.ПараметрыОтбора.Подразделение;
		СальдоСредствКРаспределению = Параметры.ПараметрыОтбора.СальдоСредствКРаспределению;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчитатьДеревоФондов();
	ПересчитатьОставшуюсяСумму();
	ВидимостьЭлПоЗайму();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлПоЗайму()
	Элементы.КрайнийСрок.Видимость = Займ;
	Элементы.ГруппаКоммент.Видимость = Займ;
КонецПроцедуры
	
&НаКлиенте
Процедура ПересчитатьОставшуюсяСумму()
	
	ОсталосьДобрать = ИсходнаяСумма - СальдоСредствКРаспределениюВзять- ИтогДеревоФондов;
	ОстатокПосле = - ОсталосьДобрать;
	Если ОстатокПосле < 0 Тогда		
		Элементы.ОстатокПосле.ЦветТекста = Новый Цвет(255,0,0);		
		Элементы.ДекорацияВосполнен.Видимость = ложь;
	Иначе	
		Элементы.ОстатокПосле.ЦветТекста = Новый Цвет(0,0,0);	
		Элементы.ДекорацияВосполнен.Видимость = истина;
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура ДеревоФондовВзятьПриИзменении(Элемент)
	
	тд = Элементы.ДеревоФондов.ТекущиеДанные;	
	Если тд.Взять > тд.ОстатокИсх Тогда
		тд.Взять = тд.ОстатокИсх;
	КонецЕсли;
	
	тд.Остаток = тд.ОстатокИсх - тд.Взять; 
	
	ПересчитатьДеревоФондов();
	ПересчитатьОставшуюсяСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДеревоФондов()
	
	ИтОстаток = 0;
	ИтВзять = 0;
	для каждого стр из ДеревоФондов.ПолучитьЭлементы() Цикл
		ИтОстаток = ИтОстаток + стр.Остаток;
		ИтВзять = ИтВзять + стр.Взять;
	КонецЦикла;

	ИтогДеревоФондов = ИтВзять;
	Элементы.ДеревоФондовОстаток.ТекстПодвала = Формат(ИтОстаток, "ЧДЦ=2; ЧН=");
	Элементы.ДеревоФондовВзять.ТекстПодвала = Формат(ИтВзять, "ЧДЦ=2; ЧН=");
	
	Если ИтОстаток + ИтВзять < ИсходнаяСумма тогда
		Элементы.ДеревоФондовОстаток.ЦветТекстаПодвала = новый цвет(255,0,0);
		Элементы.ДеревоФондовФонд.ТекстПодвала = "На фондах недостаточно средств для пополнения фонда";
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДеревоФондовПриАктивизацииСтроки(Элемент)
	Элементы.ДеревоФондовВзять.ТолькоПросмотр = истина;
	
	тд = Элементы.ДеревоФондов.ТекущиеДанные;
	
	Если тд<>Неопределено И тд.Редактирование Тогда
		Элементы.ДеревоФондовВзять.ТолькоПросмотр = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаймПриИзменении(Элемент)
	ВидимостьЭлПоЗайму();
КонецПроцедуры
