
&НаКлиенте
Процедура КомандаОК(Команда)
	
	ОбработкаВыбора();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоИсточника()

	Дерево = РеквизитФормыВЗначение("ДеревоИсточников");
	
	НоваяСтрокаКорень = Дерево.Строки.Добавить();
	НоваяСтрокаКорень.Представление = "Документы";

	Для Каждого МетаданныеДокумент Из Метаданные.Документы Цикл
		Документ = НоваяСтрокаКорень.Строки.Добавить();
		Документ.Представление = МетаданныеДокумент.Представление();
		Документ.Имя = "Документ." + МетаданныеДокумент.Имя;
		Для каждого тч из МетаданныеДокумент.ТабличныеЧасти Цикл
			ТабЧасть = Документ.Строки.Добавить();
			ТабЧасть.Представление = тч.Представление() + " (таб. часть)";
			ТабЧасть.Имя = Документ.Имя + "." + тч.Имя;
		КонецЦикла;	
	КонецЦикла;
	
	НоваяСтрокаКорень = Дерево.Строки.Добавить();
	НоваяСтрокаКорень.Представление = "Регистры сведений";

	Для Каждого МетаданныеРегистр Из Метаданные.РегистрыСведений Цикл

		Если МетаданныеРегистр.Ресурсы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Регистр = НоваяСтрокаКорень.Строки.Добавить();
		Регистр.Представление = МетаданныеРегистр.Представление();
		Регистр.Имя = "РегистрСведений." + МетаданныеРегистр.Имя;
		Если Не МетаданныеРегистр.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			//Регистр = НоваяСтрокаКорень.Строки.Добавить();
			//Регистр.Представление = МетаданныеРегистр.Представление() + " (срез первых)";
			//Регистр.Имя = "РегистрСведений." + МетаданныеРегистр.Имя + ".СрезПервых";
			Регистр = НоваяСтрокаКорень.Строки.Добавить();
			Регистр.Представление = МетаданныеРегистр.Представление() + " (срез последних)";
			Регистр.Имя = "РегистрСведений." + МетаданныеРегистр.Имя + ".СрезПоследних";
		КонецЕсли;	
	КонецЦикла;
	
	НоваяСтрокаКорень = Дерево.Строки.Добавить();
	НоваяСтрокаКорень.Представление = "Регистры накопления";

	Для Каждого МетаданныеРегистр Из Метаданные.РегистрыНакопления Цикл

        Если МетаданныеРегистр.Ресурсы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		Регистр = НоваяСтрокаКорень.Строки.Добавить();
		Регистр.Представление = МетаданныеРегистр.Представление();
		Регистр.Имя = "РегистрНакопления." + МетаданныеРегистр.Имя;
		Если МетаданныеРегистр.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Обороты Тогда
			Регистр = НоваяСтрокаКорень.Строки.Добавить();
			Регистр.Представление = МетаданныеРегистр.Представление() + " (обороты)";
			Регистр.Имя = "РегистрНакопления." + МетаданныеРегистр.Имя + ".Обороты";
		ИначеЕсли МетаданныеРегистр.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
			Регистр = НоваяСтрокаКорень.Строки.Добавить();
			Регистр.Представление = МетаданныеРегистр.Представление() + " (обороты)";
			Регистр.Имя = "РегистрНакопления." + МетаданныеРегистр.Имя + ".Обороты";
			Регистр = НоваяСтрокаКорень.Строки.Добавить();
			Регистр.Представление = МетаданныеРегистр.Представление() + " (остатки)";
			Регистр.Имя = "РегистрНакопления." + МетаданныеРегистр.Имя + ".Остатки";
			//Регистр = НоваяСтрокаКорень.Строки.Добавить();
			//Регистр.Представление = МетаданныеРегистр.Представление() + " (остатки и обороты)";
			//Регистр.Имя = "РегистрНакопления." + МетаданныеРегистр.Имя + ".ОстаткиИОбороты";
		КонецЕсли;	
			
	КонецЦикла;
	
	НоваяСтрокаКорень = Дерево.Строки.Добавить();
	НоваяСтрокаКорень.Представление = "Регистры бухгалтерии";

	Для Каждого МетаданныеРегистр Из Метаданные.РегистрыБухгалтерии Цикл
		
		Если МетаданныеРегистр.Ресурсы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Регистр = НоваяСтрокаКорень.Строки.Добавить();
		Регистр.Представление = МетаданныеРегистр.Представление();
		Регистр.Имя = "РегистрБухгалтерии." + МетаданныеРегистр.Имя + ".ДвиженияССубконто";
	КонецЦикла;
		
	ЗначениеВРеквизитФормы(Дерево, "ДеревоИсточников");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.ЭтоАналитика Тогда
		ЗаполнитьДеревоАналитик(); 
	Иначе
		ЗаполнитьДеревоИсточника();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИсточниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработкаВыбора();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора()
	
	тд = Элементы.ДеревоИсточников.ТекущиеДанные;
	Если тд <> Неопределено И тд.Имя <> "" Тогда
		Структура = Новый Структура("Представление, Имя, Тип", тд.Представление, тд.Имя, тд.Тип);
		Закрыть(Структура);
	Иначе
		ПоказатьПредупреждение(,"Нельзя выбрать данный элемент",, "Выбор источника");
	КонецЕсли;    
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДеревоАналитик()
	 
	ЗаполнитьДерево(-1, "*", Параметры.Источник);

КонецПроцедуры // ЗаполнитьДеревоАналитик()

&НаСервере
Процедура ЗаполнитьДерево(ид, ПутьКДанным, ИмяТаблицы)	
	
	Если ид = -1 Тогда
		Строки = ДеревоИсточников.ПолучитьЭлементы();
	Иначе
		Строки = ДеревоИсточников.НайтиПоИдентификатору(ид).ПолучитьЭлементы();
	КонецЕсли;
	
	Строки.Очистить();
	
	Если ид = -1 и Параметры.ЭтоКоличество Тогда
		НовСтр = Строки.Добавить();
		НовСтр.Представление = "КОЛИЧЕСТВО ЗАПИСЕЙ";
		НовСтр.Имя = "1";
		НовСтр.Тип = "Число";
	КонецЕсли;
	
	времИТ = ИмяТаблицы;
	Если Найти(времИТ, ".Обороты") <> 0  Тогда
			времИТ = времИТ + "(,,Регистратор,)";
	КонецЕсли;
			
	ТекстЗапр = "ВЫБРАТЬ ИсточникДанных." + ПутьКДанным + " ИЗ " + времИТ + " КАК ИсточникДанных";
			
	Постр = Новый ПостроительОтчета(ТекстЗапр);
	Постр.ЗаполнитьНастройки();

	Поля = Постр.ДоступныеПоля;
	Если ПутьКДанным <> "*" Тогда
		Для каждого стрПоле из Поля Цикл
			Если стрПоле.Поле Тогда
				Поля = стрПоле.Поля;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрПоле из Поля Цикл
		Если не СтрПоле.Поле Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = Строки.Добавить();
		НовСтр.Представление = СтрПоле.Имя;
		НовСтр.Тип = Строка(СтрПоле.ТипЗначения);
		
		РезПуть = СтрПоле.Имя;
		ТекРодитель = Новстр.ПолучитьРодителя();
		Пока ТекРодитель <> Неопределено Цикл
			РезПуть = ТекРодитель.Имя + "." + РезПуть;
			ТекРодитель = ТекРодитель.ПолучитьРодителя();
		КонецЦикла;
		
		НовСтр.Имя = РезПуть;	
		
		Если Строка(СтрПоле.ТипЗначения) <> "Число" И Строка(СтрПоле.ТипЗначения) <> "Дата" 
			И Строка(СтрПоле.ТипЗначения) <> "Строка" И Строка(СтрПоле.ТипЗначения) <> "Булево" Тогда
			ВремСтрока = Новстр.ПолучитьЭлементы().Добавить();
			ВремСтрока.Имя = "1";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИсточниковПередРазворачиванием(Элемент, Строка, Отказ)
	Если Параметры.ЭтоАналитика Тогда
		стр = ДеревоИсточников.НайтиПоИдентификатору(Строка);
		Если стр.ПолучитьЭлементы().Количество() = 1 Тогда		
			ЗаполнитьДерево(Строка, стр.Имя, Параметры.Источник);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры






