#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "ГруппаКонтактнаяИнформация", ПоложениеЗаголовкаЭлементаФормы.Лево);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

	ПолеЛоготип = ПолучитьНавигационнуюСсылку(Объект.ФайлЛоготип, "Файл");
	ПолеПечать = ПолучитьНавигационнуюСсылку(Объект.ФайлПечать, "Файл");
	ПолеПодписьРуководителя = ПолучитьНавигационнуюСсылку(Объект.ФайлПодписьРуководителя, "Файл");
	ПолеПодписьГлавногоБухгалтера = ПолучитьНавигационнуюСсылку(Объект.ФайлПодписьГлавногоБухгалтера, "Файл");
	
	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СтавкаНДСПоУмолчанию.Доступность = Объект.ЯвляетсяПлательщикомНДС;
	Элементы.СуммаВключаетНДС.Доступность = Объект.ЯвляетсяПлательщикомНДС;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменилсяОсновнойСчет" И Параметр = Объект.Ссылка Тогда
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УправлениеФормойНаСервере()
	
	ЭтоСтранаЕС = (Константы.ТелефонияСтрана.Получить() = Справочники.СтраныМира.Литва);
	Элементы.ИдентификационныйНомерПлательщикаЕвропейскогоНДС.Видимость = ЭтоСтранаЕС;
	
	Элементы.ОсновнаяНастройкаИнтеркампани.Видимость = Константы.ИспользоватьИнтеркампани.Получить() И (Константы.ИсточникНастроекИнтеркампани.Получить() = 5);
	
	// №12800
	Элементы.ПрефиксОрганизации.Видимость = Константы.ИспользоватьПрефиксОрганизацииВНомереДокумента.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинку(ПолеКартинки, ОбъектКартинки)
	ИмяФайла = "";
	ПутьФайла = "";
	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда	
		ПолеКартинки = ПутьФайла;

		УстановитьКартинку(ПолеКартинки, ОбъектКартинки);
		Модифицированность=Истина;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура УдалитьКартинку(ОбъектКартинки)
	
	СпрОбъект = ОбъектКартинки.ПолучитьОбъект();
	Если НЕ СпрОбъект = Неопределено Тогда
		СпрОбъект.Удалить();
	КонецЕсли;
	
КонецПроцедуры
		
&НаКлиенте
Процедура ОчиститьКартинку(ПолеКартинки, ОбъектКартинки)
	
	Если ОбъектКартинки.Пустая() = Ложь Тогда		
		УдалитьКартинку(ОбъектКартинки);
		ОбъектКартинки = Неопределено;
		ПолеКартинки = "";
		Модифицированность = Истина;
	конецесли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинку(ПолеКартинки, ОбъектКартинки)
	
	НовыйФайл = Справочники.ОрганизацииФайлы.СоздатьЭлемент();
	НовыйФайл.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ПолеКартинки));
	ПолеКартинки = ПоместитьВоВременноеХранилище(НовыйФайл.Файл.Получить());
	НовыйФайл.Записать();
	
	Если ОбъектКартинки.Пустая() = Ложь и ОбъектКартинки.ПолучитьОбъект()<>Неопределено Тогда		
		СтарыйФайл = ОбъектКартинки.ПолучитьОбъект();
		СтарыйФайл.Удалить();
	КонецЕсли;

	ОбъектКартинки = НовыйФайл.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьКартинку(ПолеКартинки, ОбъектКартинки)	
	Если ОбъектКартинки.Пустая() Тогда
		ЗагрузитьКартинку(ПолеКартинки, ОбъектКартинки);
	Иначе
		ОчиститьКартинку(ПолеКартинки, ОбъектКартинки);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьЛоготип(Команда)
	ЗагрузитьОчиститьКартинку(ПолеЛоготип, Объект.ФайлЛоготип);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьПечать(Команда)
	ЗагрузитьОчиститьКартинку(ПолеПечать, Объект.ФайлПечать);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьПодписьРуководителя(Команда)
	ЗагрузитьОчиститьКартинку(ПолеПодписьРуководителя, Объект.ФайлПодписьРуководителя);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьПодписьГлавногоБухгалтера(Команда)
	ЗагрузитьОчиститьКартинку(ПолеПодписьГлавногоБухгалтера, Объект.ФайлПодписьГлавногоБухгалтера);
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтавкуНДСПоУмолчанию()
	Если НЕ Объект.ЯвляетсяПлательщикомНДС Тогда
	   Объект.СтавкаНДСПоУмолчанию = Перечисления.СтавкиНДС.БезНДС;	
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ЯвляетсяПлательщикомНДСПриИзменении(Элемент)
	Элементы.СтавкаНДСПоУмолчанию.Доступность = Объект.ЯвляетсяПлательщикомНДС;
	Элементы.СуммаВключаетНДС.Доступность = Объект.ЯвляетсяПлательщикомНДС;
	ОбновитьСтавкуНДСПоУмолчанию();
КонецПроцедуры

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#КонецОбласти


