&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоЗагрузка = Параметры.Свойство("Загрузка");
	
	Если ЭтоЗагрузка Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗагрузки;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВыгрузки;		
		
		// загружаем статусы
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЛида.Ссылка КАК ПредставлениеСтатуса
		|ИЗ
		|	Справочник.СтатусыЛида КАК СтатусыЛида
		|ГДЕ
		|	НЕ СтатусыЛида.ПометкаУдаления
		|	И НЕ СтатусыЛида.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.ЗаполнитьДанныеЗамера)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтатусыЛида.РеквизитДопУпорядочивания";
		
		Статусы.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПредставлениеСтатуса"));	
		Статусы.ЗаполнитьПометки(Истина);
	КонецЕсли;
	
	Формат = 0;

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = ?(ЭтоЗагрузка, РежимДиалогаВыбораФайла.Открытие, РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "leads_SmartCeilings_" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + ?(НЕ Формат = 0, ".xml", ".txt");
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Введите название файла";
	
	Фильтр =  ?(Формат = 0, "Файл txt|*.txt", "Файл xml|*.xml");
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, Параметры) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0  Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

#Область ВыгрузкаДанных

&НаКлиенте
Процедура ВыгрузитьЛиды(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Необходимо указать расположение файла для выгрузки данных!");
		Возврат;
	КонецЕсли;
	
	Данные = СформироватьДанныеНаСервере();
	
	Если Формат = 0 Тогда
		//формируем jSON с данными
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, КодировкаТекста.UTF8,, Новый ПараметрыЗаписиJSON(, Символы.Таб));
		ЗаписатьJSON(ЗаписьJSON, Данные);
		
		ЗаписьJSON.Закрыть();
		
	Иначе
		// формируем xml
		//ЗаписьXML = Новый ЗаписьXML;
		//ЗаписьXML.ОткрытьФайл(ПутьКФайлу);
		//ЗаписьXML.ЗаписатьОбъявлениеXML();
		//ЗаписьXML.ЗаписатьНачалоЭлемента("Документы");
		//
		//Для каждого Строка Из Данные Цикл			
		//	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");
		//	Для каждого КлючИЗначение из Строка Цикл
		//		Если НЕ КлючИЗначение.Ключ = "ИсторияЛида" Тогда
		//			ЗаписьXML.ЗаписатьАтрибут(КлючИЗначение.Ключ, XMLСтрока(КлючИЗначение.Значение));
		//		Иначе
		//			ЗаписьXML.ЗаписатьНачалоЭлемента("ИсторияЛида");
		//			Для каждого СтрокаИстории из Строка.ИсторияЛида Цикл
		//				ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаИстории");
		//				Для каждого КлючИЗначениеИстории из СтрокаИстории Цикл
		//					ЗаписьXML.ЗаписатьАтрибут(КлючИЗначениеИстории.Ключ, XMLСтрока(КлючИЗначениеИстории.Значение));
		//				КонецЦикла;
		//				ЗаписьXML.ЗаписатьКонецЭлемента();
		//			КонецЦикла;
		//			ЗаписьXML.ЗаписатьКонецЭлемента();
		//		КонецЕсли;
		//	КонецЦикла;
		//	ЗаписьXML.ЗаписатьКонецЭлемента();			
		//КонецЦикла;
		//ЗаписьXML.ЗаписатьКонецЭлемента();
		//ЗаписьXML.Закрыть();
		
	КонецЕсли;
	
	ПоказатьОповещениеПользователя("Выгрузка завершена.");
	
КонецПроцедуры

&НаСервере
Функция СформироватьДанныеНаСервере()
	
	ДанныеКВыгрузке = Новый Массив;	
	
	ВыгружаемыеРеквизиты = Новый Массив; 
	ВыгружаемыеСсылочныеРеквизиты = Новый Массив;
	ЗаполнитьВыгружаемыеРеквизиты(ВыгружаемыеРеквизиты, ВыгружаемыеСсылочныеРеквизиты);
	
	Запрос = Новый Запрос; 
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументЛид.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Лиды
	|ИЗ
	|	Документ.Лид КАК ДокументЛид
	|ГДЕ
	|	ДокументЛид.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И ДокументЛид.ТекущийСтатус В(&ВыгружаемыеСтатусы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ВыгружаемыеПоля,
	|	ДокументЛид.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лид КАК ДокументЛид
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Лиды КАК ВТ_Лиды
	|		ПО (ВТ_Лиды.Ссылка = ДокументЛид.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументЛид.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Тип) КАК Тип,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Вид) КАК Вид,
	|	ДанныеДокумента.Представление КАК Представление,
	|	ДанныеДокумента.ИдентификаторСтрокиТабличнойЧасти КАК ИдентификаторСтрокиТабличнойЧасти,
	|	ДанныеДокумента.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Документ.Лид.ДополнительнаяКонтактнаяИнформация КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Лиды КАК ВТ_Лиды
	|		ПО (ВТ_Лиды.Ссылка = ДанныеДокумента.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияЛида.Лид КАК Ссылка,
	|	ИсторияЛида.Дата КАК ДатаИстории,
	|	ПРЕДСТАВЛЕНИЕ(ИсторияЛида.Пользователь) КАК ПользовательИстории,
	|	ИсторияЛида.ИДЗаписи КАК ИДЗаписиИстории,
	|	ИсторияЛида.Комментарий КАК КомментарийИстории
	|ИЗ
	|	РегистрСведений.ИсторияЛида КАК ИсторияЛида
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Лиды КАК ВТ_Лиды
	|		ПО (ВТ_Лиды.Ссылка = ИсторияЛида.Лид)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	ВыгружаемыеПоля = "";
	Для каждого ИмяРеквизита из ВыгружаемыеРеквизиты Цикл
		ВыгружаемыеПоля = ВыгружаемыеПоля + ?(ПустаяСтрока(ВыгружаемыеПоля), "", ", ") + "ДокументЛид." + ИмяРеквизита;	
	КонецЦикла;
	Для каждого ИмяРеквизита из ВыгружаемыеСсылочныеРеквизиты Цикл
		ВыгружаемыеПоля = ВыгружаемыеПоля + ?(ПустаяСтрока(ВыгружаемыеПоля), "", ", ") + "ДокументЛид." + ИмяРеквизита;	
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыгружаемыеПоля", ВыгружаемыеПоля);
	
	ВыгружаемыеСтатусы = Новый Массив;
	Для каждого СтрокаСтатуса из Статусы Цикл
		Если СтрокаСтатуса.Пометка Тогда 
			ВыгружаемыеСтатусы.Добавить(СтрокаСтатуса.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ВыгружаемыеСтатусы", ВыгружаемыеСтатусы);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаПоЛидам = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаПоЛидам.Следующий() Цикл
				
		СтруктураЛида = СтруктураЛидаПоВыгружаемымРеквизитам(ВыгружаемыеРеквизиты);
		ЗаполнитьЗначенияСвойств(СтруктураЛида, ВыборкаПоЛидам);

		//#9756  
		ДополнитьДополнительнымиСвойствамиЛида(СтруктураЛида, ВыборкаПоЛидам.Ссылка);
		
		Для каждого СсылочноеПоле из ВыгружаемыеСсылочныеРеквизиты Цикл
			СтруктураСсылочногоПоля = Новый Структура;
			СтруктураСсылочногоПоля.Вставить("Значение", Строка(ВыборкаПоЛидам[СсылочноеПоле]));
			СтруктураСсылочногоПоля.Вставить("Тип", ВыборкаПоЛидам[СсылочноеПоле].Метаданные().ПолноеИмя());
			СтруктураЛида.Вставить(СсылочноеПоле, СтруктураСсылочногоПоля);					
		КонецЦикла;			
		
		// контактная информация лида
		МассивКИ = Новый Массив;
		ВыборкаКИ = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаПоЛидам.Ссылка);		
		ВыборкаКИ.Сбросить();
		Если ВыборкаКИ.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаКИ.Выбрать();			
			Пока Выборка.Следующий() Цикл				
				СтруктураКИ = Новый Структура;
				СтруктураКИ.Вставить("Тип", 			Выборка.Тип);
				СтруктураКИ.Вставить("Вид", 			Выборка.Вид);			
				СтруктураКИ.Вставить("Представление", 	Выборка.Представление);
				МассивКИ.Добавить(СтруктураКИ);	
			КонецЦикла;
		КонецЕсли;		
		Если МассивКИ.Количество() Тогда		
			СтруктураЛида.Вставить("КонтактнаяИнформация", МассивКИ);
		КонецЕсли;
		
		// история лида
		МассивИстории = Новый Массив;
		ВыборкаПоИстории = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		ВыборкаПоИстории.Сбросить();
		Если ВыборкаПоИстории.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоИстории.Выбрать();			
			Пока Выборка.Следующий() Цикл

				Если НЕ ЗначениеЗаполнено(Выборка.ДатаИстории) Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураИстории = Новый Структура;
				СтруктураИстории.Вставить("Дата", 			Выборка.ДатаИстории);
				СтруктураИстории.Вставить("Пользователь", 	Выборка.ПользовательИстории);			
				СтруктураИстории.Вставить("ИДЗаписи", 		Строка(Выборка.ИДЗаписиИстории));
				СтруктураИстории.Вставить("Комментарий", 	Выборка.КомментарийИстории);
				МассивИстории.Добавить(СтруктураИстории);	
			КонецЦикла;
		КонецЕсли;		
		Если МассивИстории.Количество() Тогда		
			СтруктураЛида.Вставить("ИсторияЛида", МассивИстории);
		КонецЕсли;
		
		ДанныеКВыгрузке.Добавить(СтруктураЛида);
	КонецЦикла;	
		
	Возврат ДанныеКВыгрузке;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДанных

&НаКлиенте
Процедура ЗагрузитьЛиды(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Необходимо указать расположение файла для загрузки данных!");
		Возврат;
	КонецЕсли;
	
	Попытка
		ЧтениеJSON = новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьФайл(ПутьКФайлу);
		
		// Укажем названия реквизитов дат, которые необходимо преобразовать к дате
		МассивФорматаДат = новый Массив;
		МассивФорматаДат.Добавить("Дата");
		МассивФорматаДат.Добавить("ДатаИстории");
		//МассивФорматаДат.Добавить("ДатаПоследнейРеакции"); //#11632 закомментировано
		МассивФорматаДат.Добавить("ПоследняяДатаПерезвонить");
		
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Ложь, МассивФорматаДат, ФорматДатыJSON.ISO);
		ЧтениеJSON.Закрыть();
	Исключение
		Сообщить("Не удалось прочитать файл: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	// Проверки корректности структуры в файле
	Если НЕ ТипЗнч(ДанныеJSON) = Тип("Массив") Тогда
		Сообщить("В файле отсутствуют ""Лиды"".");
		Возврат;
	КонецЕсли;
	
	ФайлЗагрузкиJSONОбработатьНаСервере(ДанныеJSON);

	ПоказатьОповещениеПользователя("Загрузка завершена.");

КонецПроцедуры

&НаСервере
Процедура ФайлЗагрузкиJSONОбработатьНаСервере(ДокументыJSON)
	
	ВыгружаемыеРеквизиты = Новый Массив; 
	ВыгружаемыеСсылочныеРеквизиты = Новый Массив;
	ЗаполнитьВыгружаемыеРеквизиты(ВыгружаемыеРеквизиты, ВыгружаемыеСсылочныеРеквизиты, Истина);
	
	Для каждого СтрокаДокумента из ДокументыJSON Цикл
		СтруктураЛида = СтруктураЛидаПоВыгружаемымРеквизитам(ВыгружаемыеРеквизиты);
		ЗаполнитьЗначенияСвойств(СтруктураЛида, СтрокаДокумента);
		
		ДокументСсылка = ПодобратьЛид(СтруктураЛида.Номер, СтруктураЛида.Дата);
		Если НЕ ДокументСсылка.Пустая() Тогда
			Продолжить;	
		КонецЕсли;
		
		ДокументОбъект = Документы.Лид.СоздатьДокумент();
		ДокументОбъект.Заполнить(Неопределено);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, СтруктураЛида);
		
		//#9756
		ЗаполнитьДополнительныеСвойстваЛида(ДокументОбъект, СтруктураЛида);
		
		СтруктураЛида = СтруктураЛидаПоВыгружаемымРеквизитам(ВыгружаемыеСсылочныеРеквизиты);
		ЗаполнитьЗначенияСвойств(СтруктураЛида, СтрокаДокумента);
		Для каждого СсылочныйРеквизит из СтруктураЛида Цикл
			ЗначениеЭлемента = СсылочныйРеквизит.Значение.Значение;
			ТипСтрокой = СсылочныйРеквизит.Значение.Тип;
			Если ПустаяСтрока(ЗначениеЭлемента) Тогда
				Продолжить;
			КонецЕсли;
			
			НаименованиеСправочника = СтрЗаменить(ТипСтрокой, "Справочник.", "");
			ДокументОбъект[СсылочныйРеквизит.Ключ] = Справочники[НаименованиеСправочника].НайтиПоНаименованию(ЗначениеЭлемента, Истина);			
		КонецЦикла;
		
		// контактная информация
		Для каждого СтрокаКИ из СтрокаДокумента.КонтактнаяИнформация Цикл			
			Если СтрокаКИ.Тип = "Телефон" Тогда
				ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
				ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			ИначеЕсли СтрокаКИ.Тип = "Адрес электронной почты" Тогда
				ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
			Иначе
				Продолжить;
			КонецЕсли;
			
			СтруктураКИ = Новый Структура("Тип, Вид, Представление", ТипКИ, ВидКИ, СтрокаКИ.Представление);
			НС = ДокументОбъект.ДополнительнаяКонтактнаяИнформация.НайтиСтроки(СтруктураКИ);
			Если НС.Количество() = 0 Тогда
				УправлениеКонтактнойИнформациейПотолки.ЗаписатьКонтактнуюИнформацию(ДокументОбъект, СтрокаКИ.Представление, ВидКИ, ТипКИ, Новый УникальныйИдентификатор);
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		// история лида
		Для каждого СтрокаИстории из СтрокаДокумента.ИсторияЛида Цикл
			СтруктураСтрокиИстории = Новый Структура;
			СтруктураСтрокиИстории.Вставить("Дата", 			СтрокаИстории.Дата);						
			СтруктураСтрокиИстории.Вставить("ИДЗаписи", 		Новый УникальныйИдентификатор(СтрокаИстории.ИДЗаписи));
			СтруктураСтрокиИстории.Вставить("Комментарий", 		СтрокаИстории.Комментарий);
			Если НЕ ПустаяСтрока(СтрокаИстории.Пользователь) Тогда
				СтруктураСтрокиИстории.Вставить("Пользователь",  Справочники.Пользователи.НайтиПоНаименованию(СтрокаИстории.Пользователь, Истина));
			Иначе	
				СтруктураСтрокиИстории.Вставить("Пользователь",  Справочники.Пользователи.ПустаяСсылка());			
			КонецЕсли;
			СтруктураСтрокиИстории.Вставить("Лид", ДокументОбъект.Ссылка); 
			МенеджерЗаписи = РегистрыСведений.ИсторияЛида.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураСтрокиИстории);
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
		СтруктураСтрокиИстории = Новый Структура;
		СтруктураСтрокиИстории.Вставить("Дата", 			ТекущаяДатаСеанса());						
		СтруктураСтрокиИстории.Вставить("ИДЗаписи", 		Новый УникальныйИдентификатор());
		СтруктураСтрокиИстории.Вставить("Комментарий", 		"Загружен из файла");	
		СтруктураСтрокиИстории.Вставить("Пользователь",  Пользователи.ТекущийПользователь());
		СтруктураСтрокиИстории.Вставить("Лид", ДокументОбъект.Ссылка); 
		МенеджерЗаписи = РегистрыСведений.ИсторияЛида.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураСтрокиИстории);
		МенеджерЗаписи.Записать(Истина);			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПодобратьЛид(Номер, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лид.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.Дата = &Дата
	|	И Лид.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.Лид.ПустаяСсылка();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗаполнитьВыгружаемыеРеквизиты(ВыгружаемыеРеквизиты, ВыгружаемыеСсылочныеРеквизиты, ДополнятьДопСвойствами = Ложь)
	
	ВыгружаемыеРеквизиты = Новый Массив;
	ВыгружаемыеРеквизиты.Добавить("Номер");
	ВыгружаемыеРеквизиты.Добавить("Дата");
	ВыгружаемыеРеквизиты.Добавить("ИмяКлиента");
	ВыгружаемыеРеквизиты.Добавить("Адрес");
	//ВыгружаемыеРеквизиты.Добавить("ДатаПоследнейРеакции"); //#11632 закомментировано
	ВыгружаемыеРеквизиты.Добавить("ПоследняяДатаПерезвонить");
	
	Если ДополнятьДопСвойствами Тогда
		ВыгружаемыеРеквизиты.Добавить("ЛидID");
		ВыгружаемыеРеквизиты.Добавить("ЭлектроннаяПочтаИД");
		ВыгружаемыеРеквизиты.Добавить("ЯндексID");
		ВыгружаемыеРеквизиты.Добавить("ГуглID");
		ВыгружаемыеРеквизиты.Добавить("ИД_Битрикс24");
	КонецЕсли;

	ВыгружаемыеСсылочныеРеквизиты = Новый Массив;
	ВыгружаемыеСсылочныеРеквизиты.Добавить("Организация");
	ВыгружаемыеСсылочныеРеквизиты.Добавить("ТекущийСтатус");
	ВыгружаемыеСсылочныеРеквизиты.Добавить("Город");
	ВыгружаемыеСсылочныеРеквизиты.Добавить("Автор");
	
КонецПроцедуры
	
&НаСервере
Функция СтруктураЛидаПоВыгружаемымРеквизитам(ВыгружаемыеРеквизиты)
	
	СтруктураЛида = Новый Структура;
	Для каждого ЭлементМассива из ВыгружаемыеРеквизиты Цикл
		СтруктураЛида.Вставить(ЭлементМассива);
	КонецЦикла;
	
	Возврат СтруктураЛида;
	
КонецФункции

&НаСервере
Процедура ДополнитьДополнительнымиСвойствамиЛида(СтруктураЛида, ДокументСсылка)
	
	СтруктураЛида.Вставить("ЛидID", 			ОбщийМодульСервер.ЗначениеДополнительногоСвойстваЛида(ДокументСсылка, Справочники.ВидыДополнительныхСвойствЛида.ЛидID));
	СтруктураЛида.Вставить("ЭлектроннаяПочтаИД", ОбщийМодульСервер.ЗначениеДополнительногоСвойстваЛида(ДокументСсылка, Справочники.ВидыДополнительныхСвойствЛида.ПисьмоID));
	СтруктураЛида.Вставить("ЯндексID", 			ОбщийМодульСервер.ЗначениеДополнительногоСвойстваЛида(ДокументСсылка, Справочники.ВидыДополнительныхСвойствЛида.ЯндексID));
	СтруктураЛида.Вставить("ГуглID", 			ОбщийМодульСервер.ЗначениеДополнительногоСвойстваЛида(ДокументСсылка, Справочники.ВидыДополнительныхСвойствЛида.GoogleID));
	СтруктураЛида.Вставить("ИД_Битрикс24", 		ОбщийМодульСервер.ЗначениеДополнительногоСвойстваЛида(ДокументСсылка, Справочники.ВидыДополнительныхСвойствЛида.Битрикс24ID));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеСвойстваЛида(ДокументОбъект, СтруктураЛида)

	Если СтруктураЛида.Свойство("ЛидID") Тогда
		ОбщийМодульСервер.ЗаполнитьДополнительноеСвойствоЛида(ДокументОбъект, Справочники.ВидыДополнительныхСвойствЛида.ЛидID, СтруктураЛида.ЛидID);	
	КонецЕсли;
	Если СтруктураЛида.Свойство("ЭлектроннаяПочтаИД") Тогда
		ОбщийМодульСервер.ЗаполнитьДополнительноеСвойствоЛида(ДокументОбъект, Справочники.ВидыДополнительныхСвойствЛида.ПисьмоID, СтруктураЛида.ЭлектроннаяПочтаИД);	
	КонецЕсли;
	Если СтруктураЛида.Свойство("ЯндексID") Тогда
		ОбщийМодульСервер.ЗаполнитьДополнительноеСвойствоЛида(ДокументОбъект, Справочники.ВидыДополнительныхСвойствЛида.ЯндексID, СтруктураЛида.ЯндексID);	
	КонецЕсли;
	Если СтруктураЛида.Свойство("ГуглID") Тогда
		ОбщийМодульСервер.ЗаполнитьДополнительноеСвойствоЛида(ДокументОбъект, Справочники.ВидыДополнительныхСвойствЛида.GoogleID, СтруктураЛида.ГуглID);	
	КонецЕсли;
	Если СтруктураЛида.Свойство("ИД_Битрикс24") Тогда
		ОбщийМодульСервер.ЗаполнитьДополнительноеСвойствоЛида(ДокументОбъект, Справочники.ВидыДополнительныхСвойствЛида.Битрикс24ID, СтруктураЛида.ИД_Битрикс24);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
