&НаКлиенте
Процедура ОК(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	Если Элементы.СписокНоменклатуры.ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура) Тогда
		ПоказатьПредупреждение(, "Номенклатура не выбрана");
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура",			 Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Количество",			 Количество);
	ПараметрыФормы.Вставить("ЗапрашиватьКоличество", Истина);
	ПараметрыФормы.Вставить("ЗапрашиватьЦену",		 Ложь);
	ОткрытьФорму("ОбщаяФорма.ЗапросКоличестваИЦены", ПараметрыФормы, ЭтаФорма,,,, Новый ОписаниеОповещения("ПослеВыбораКоличества", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Количество = 0;
	ПередатьПараметрыВСписокНоменклатруры();	
КонецПроцедуры

&НаКлиенте
Процедура ФактураПриИзменении(Элемент)
	ПередатьПараметрыВСписокНоменклатруры();
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	ПередатьПараметрыВСписокНоменклатруры();
КонецПроцедуры

&НаКлиенте
Процедура ПередатьПараметрыВСписокНоменклатруры()
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Фактура", Фактура);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Цвет", Цвет);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура",			 Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Количество",			 Количество);
	ПараметрыФормы.Вставить("ЗапрашиватьКоличество", Истина);
	ПараметрыФормы.Вставить("ЗапрашиватьЦену",		 Ложь);
	ОткрытьФорму("ОбщаяФорма.ЗапросКоличестваИЦены", ПараметрыФормы, ЭтаФорма,,,, Новый ОписаниеОповещения("ПослеВыбораКоличества", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКоличества(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Количество = Результат.Количество;
	Если Количество > 0 Тогда
		Закрыть(Новый Структура("Номенклатура, Количество",Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура, Количество));
	КонецЕсли;	
КонецПроцедуры
