
#Область ОбработкаСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		Валюта 		= ДанныеЗаполнения.Валюта;
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Основание 	= ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
				СтруктураЦветаИФактуры = Справочники.ЦветФактуры.ПолучитьЦветИФактуруНоменклатуры(ТекСтрокаТовары.Номенклатура);
				Если СтруктураЦветаИФактуры.Результат Тогда				
					НоваяСтрока = Материалы.Добавить();
					НоваяСтрока.Фактура 	= СтруктураЦветаИФактуры.Фактура;
					НоваяСтрока.ЦветФактуры = СтруктураЦветаИФактуры.ЦветФактуры;
					НоваяСтрока.Цена 		= ТекСтрокаТовары.Цена;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидПродукции"));	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//#12615	
	Если ЦенаСФотопечатьюОтличается	И ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
		ЦенаСФотопечатьюОтличается = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ЭтоПродукция = Ложь;
	Если ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция") Тогда
		ЭтоПродукция = Истина;
		ЦеныНаПродукциюПоШаблону    = (СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоШаблону);
		ЦеныНаПродукциюПоПараметрам = (СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоПараметрам);
		ЦеныНаПродукциюПоНоменклатуре = (СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоНоменклатуре);
	КонецЕсли;
	
	ЭтоПотолокОтрез = (ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок")
				       ИЛИ ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"));
					   
	// регистр ЦеныМатериалов
	Если ЭтоПотолокОтрез 
		ИЛИ (ЭтоПродукция И ЦеныНаПродукциюПоШаблону) 
		ИЛИ (ЭтоПродукция И ЦеныНаПродукциюПоНоменклатуре)
		Тогда
		Движения.ЦеныМатериалов.Записывать = Истина;
		Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
			ЦенаСФотопечатью = ?(ЦенаСФотопечатьюОтличается, ТекСтрокаМатериалы.ЦенаСФотопечатью, ТекСтрокаМатериалы.Цена); //#12615
			Если НеРегистрироватьНулевыеЦены И ТекСтрокаМатериалы.Цена = 0 И ЦенаСФотопечатью = 0 Тогда
				Продолжить;
			КонецЕсли;
			Движение = Движения.ЦеныМатериалов.Добавить();
			Движение.Период				= Дата;
			Движение.Валюта 			= Валюта;
			Движение.ВидНоменклатуры 	= ВидНоменклатуры;
			Движение.ВидЦен 			= ТекСтрокаМатериалы.ВидЦены;
			Движение.Цена 				= ТекСтрокаМатериалы.Цена;
			Если ЭтоПродукция Тогда
				Если ЦеныНаПродукциюПоШаблону Тогда
					Движение.Шаблон 			= ТекСтрокаМатериалы.Шаблон;
				ИначеЕсли ЦеныНаПродукциюПоНоменклатуре Тогда
					Движение.Номенклатура 		= ТекСтрокаМатериалы.Номенклатура;
					Движение.ЕдиницаИзмерения 	= ТекСтрокаМатериалы.ЕдиницаИзмерения;
				КонецЕсли;
			Иначе
				Движение.Фактура 			= ТекСтрокаМатериалы.Фактура;
				Движение.ЦветФактуры 		= ТекСтрокаМатериалы.ЦветФактуры;		
				Движение.ЦенаСФотопечатью 	= ЦенаСФотопечатью;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// регистр ЦеныПараметровПродукции
	Если ЭтоПродукция И ЦеныНаПродукциюПоПараметрам Тогда
		Движения.ЦеныПараметровПродукции.Записывать = Истина;
		Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
			Если НеРегистрироватьНулевыеЦены И ТекСтрокаМатериалы.Цена = 0 Тогда
				Продолжить;
			КонецЕсли;
			Движение = Движения.ЦеныПараметровПродукции.Добавить();
			Движение.Период				= Дата;
			Движение.Валюта 			= Валюта;
			Движение.ВидПродукции 		= ВидПродукции;
			Движение.ВидЦены 			= ТекСтрокаМатериалы.ВидЦены;		
			Движение.ПараметрПродукции 	= ТекСтрокаМатериалы.ПараметрПродукции;
			Движение.Цена 				= ТекСтрокаМатериалы.Цена;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
