Функция СформироватьДвигательСтатистик(Пересоздать = ложь, Постфикс = "") Экспорт
		
	катБибл = КаталогДокументов();
	ПостФ = ?(Постфикс = "","",Постфикс + "\");
	катБибл = катБибл +"KSU\Stat_bibl\" + ПостФ;
	папка = Новый Файл(катБибл);
	Если Пересоздать или не папка.Существует() или НачалоДня(папка.ПолучитьВремяИзменения())<>НачалоДня(ТекущаяДата()) Тогда
		СоздатьКаталог(катБибл);
		двДанныеАрхив = ИА_Статистики.ПолучитьДвигательСтатистик();
		имяАрхива = катБибл + "engine.zip"; 
		двДанныеАрхив.Записать(имяАрхива);
		
		ЧтениеАрхива = Новый ЧтениеZipФайла(имяАрхива);
		ЧтениеАрхива.ИзвлечьВсе(катБибл);
	КонецЕсли;
	
	возврат катБибл;
КонецФункции

Функция ПолучитьФайлСтраницы(Данные, Постфикс) Экспорт
	катБибл = СформироватьДвигательСтатистик(,Постфикс);
	РезСтраницаИмя = катБибл + "index_"+Постфикс+".html";
	РезСтраница = Новый ТекстовыйДокумент;
	
	//
	РезСтраница.УстановитьТекст(Данные);
	счПопыток = 0;
	Пока счПопыток < 20 Цикл
		Попытка
			РезСтраница.Записать(РезСтраницаИмя);
			счПопыток = 1000;
		Исключение
		КонецПопытки;
		счПопыток = счПопыток + 1;
	КонецЦикла;
	
	возврат РезСтраницаИмя;
КонецФункции