
&НаКлиенте
Процедура ОчиститьЛог(Команда)
	
	ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОбОчисткеЛога", ЭтотОбъект), "История обмена будет полностью очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеЛога(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьЛогНаСервере();
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЛогНаСервере()
	
	НаборЗаписей = РегистрыСведений.ЛогОбменаССайтом.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекущиеДанные =  Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		АдресФайла = ПолучитьДанные(ТекущиеДанные.УзелОбмена, ТекущиеДанные.ИдентификаторСессии, ТекущиеДанные.НомерСообщения);
		ВременноеИмя = ПолучитьИмяВременногоФайла(ТекущиеДанные.Расширение);
    	ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные(УзелОбмена, ИдентификаторСессии, НомерСообщения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛогОбменаССайтом.Данные
	|ИЗ
	|	РегистрСведений.ЛогОбменаССайтом КАК ЛогОбменаССайтом
	|ГДЕ
	|	ЛогОбменаССайтом.УзелОбмена = &УзелОбмена
	|	И ЛогОбменаССайтом.ИдентификаторСессии = &ИдентификаторСессии
	|	И ЛогОбменаССайтом.НомерСообщения = &НомерСообщения";
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	Запрос.УстановитьПараметр("ИдентификаторСессии", ИдентификаторСессии);
	Запрос.УстановитьПараметр("НомерСообщения", НомерСообщения);
		
	Данные = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Данные = Выборка.Данные.Получить();
	КонецЕсли;
	 
	Возврат ПоместитьВоВременноеХранилище(Данные, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Элементы.ОткрытьФайл.Доступность = (НЕ ТекущиеДанные = Неопределено И ТекущиеДанные.ЕстьФайл);
	
КонецПроцедуры
