
Процедура ПередЗаписью(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
    
    Если НЕ ЭтоНовый() Тогда
    	КартаСтарая = ЭтотОбъект.Ссылка.Карта.Получить();
        КартаНовая  = ЭтотОбъект.Карта.Получить();
        
        Если КартаСтарая <> Неопределено И КартаНовая <> Неопределено Тогда
        	КартаБылаОчищена = КартаСтарая.ЭлементыГрафическойСхемы.Количество() > 4
            И КартаНовая.ЭлементыГрафическойСхемы.Количество() = 0;
            
            Если КартаБылаОчищена Тогда
            	ИА_БФКС.СообщениеОбОшибке("Невозможно записать пустую карту маршрута, если в ней были элементы!", Отказ); 
            КонецЕсли; 
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
    
    // 1) Пометим на удаление существующие
    ИА_Защита_НФ.КМ_ПометитьНаУдалениеВсеЭлементы(Ссылка);
    
    Схема = Карта.Получить();
    Если Схема <> Неопределено Тогда
        ИА_Защита_НФ.КМ_РаспарситьКартуМаршрута(Схема, Ссылка);
    КонецЕсли; 
    
    Если ДополнительныеСвойства.Свойство("ИА_ОбъектКопирования") Тогда
        ВыполнитьПереносДанныхТочекСОбъектаКопирования(ДополнительныеСвойства.ИА_ОбъектКопирования);
        ДополнительныеСвойства.Удалить("ИА_ОбъектКопирования");
    КонецЕсли; 
КонецПроцедуры    

Процедура ПриКопировании(ОбъектКопирования)
    Если ТипЗнч(ОбъектКопирования) = Тип("СправочникСсылка.ИА_БПКартыМаршрутов") Тогда
        ДополнительныеСвойства.Вставить("ИА_ОбъектКопирования", ОбъектКопирования);
    КонецЕсли; 
КонецПроцедуры

Процедура ВыполнитьПереносДанныхТочекСОбъектаКопирования(КартаМаршрутаИсходная)
    // Перенесем данные "точек"
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   ИА_БПТочкиМаршрута.Ссылка КАК Точка
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута КАК ИА_БПТочкиМаршрута
    |ГДЕ
    |   НЕ ИА_БПТочкиМаршрута.ПометкаУдаления
    |   И ИА_БПТочкиМаршрута.Владелец = &КартаТекущая
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ  *
    | ИЗ
    |   Справочник.ИА_БПТочкиМаршрута КАК ИА_БПТочкиМаршрута
    |ГДЕ
    |   НЕ ИА_БПТочкиМаршрута.ПометкаУдаления
    |   И ИА_БПТочкиМаршрута.Владелец = &КартаКопирования";
    Запрос.УстановитьПараметр("КартаКопирования", КартаМаршрутаИсходная);
    Запрос.УстановитьПараметр("КартаТекущая", Ссылка);
    Пакет = Запрос.ВыполнитьПакет();
    
    ТочкиКопирования = Пакет[1].Выгрузить();
    
    Выборка = Пакет[0].Выбрать();
    Пока Выборка.Следующий() Цикл
        Спр = Выборка.Точка.ПолучитьОбъект();
        НайдСтрока = ТочкиКопирования.Найти(Спр.Имя, "Имя");
        Если НайдСтрока <> Неопределено Тогда
            ЗаполнитьЗначенияСвойств(Спр, НайдСтрока,, "Код, Наименование, Владелец, Тип, Имя");
            ИменаТЧДляКопирования = Новый Структура("Обработчики, РеквизитыВложенногоБП, ВыводимыеРеквизиты");
            Для каждого КиЗ Из ИменаТЧДляКопирования Цикл
            	Спр[КиЗ.Ключ].Загрузить(НайдСтрока[КиЗ.Ключ]);
            КонецЦикла; 
        КонецЕсли; 
        Спр.Записать();
    КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ИА_БПКартыМаршрутов") Тогда
        СтандартнаяОбработка = Ложь;
        ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Код, Наименование, Владелец");
        ДополнительныеСвойства.Вставить("ИА_ОбъектКопирования", ДанныеЗаполнения);
    КонецЕсли; 
КонецПроцедуры

