
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АвторСообщения = Параметры.АвторСообщения;
	ДатаСообщения = Параметры.ДатаСообщения;
	ДатаСообщенияUNIX = Параметры.ДатаСообщенияUNIX;
	ИД = Параметры.ИД;
	ИДКанала = Параметры.ИДКанала;
	ИДЧата = Параметры.ИДЧата;
	ИмяАвтора = Параметры.ИмяАвтора;
	МедиаКонтент = Параметры.МедиаКонтент;
	ПрочитаноПользователем = Параметры.ПрочитаноПользователем;
	Статус = Параметры.Статус;
	Текст = Параметры.Текст;
	ТипАвтора = Параметры.ТипАвтора;
	ТипКанала = Параметры.ТипКанала;
	ТипСообщения = Параметры.ТипСообщения;
КонецПроцедуры
