
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    Отбор = Новый Структура("ВладелецРеквизита", ПараметрКоманды);
    
    ПараметрыФормы = Новый Структура("Отбор", Отбор);
    ОткрытьФорму("ПланВидовХарактеристик.ИА_БПРеквизиты.ФормаСписка"
    , ПараметрыФормы
    , ПараметрыВыполненияКоманды.Источник
    , ПараметрыВыполненияКоманды.Уникальность
    //, ПараметрыВыполненияКоманды.Окно
    //, ПараметрыВыполненияКоманды.НавигационнаяСсылка
    );
КонецПроцедуры
