
Функция ОтгрузкаПоСвязкеОрганизацииПроизводстваКонтрагентаРозницы(Организация, Контрагент, ОрганизацияПоступления = Неопределено, КонтрагентПоступления = Неопределено, СкладПоступления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Связки.Организация КАК Организация,
	|	Связки.Контрагент КАК Контрагент,
	//++ 8373
	|	Связки.ОрганизацияПоступления КАК ОрганизацияПоступления,
	|	Связки.КонтрагентПоступления КАК КонтрагентПоступления,
	//-- 8373
	//++ #7764
	|	Связки.СкладПоступления КАК СкладПоступления
	//-- #7764
	|ИЗ
	|	РегистрСведений.СвязкиОрганизацийПроизводстваКонтрагентРозницы КАК Связки
	|ГДЕ
	|	Связки.Организация = &Организация
	|	И Связки.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//++ №8373 проставим организацию и контрагента поступления
	//Возврат НЕ РезультатЗапроса.Пустой();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		//++ №7764 комментируем, т.к. реквизиты в РТиУ удалены
		//ОрганизацияПоступления = Выборка.ОрганизацияПоступления;
		//КонтрагентПоступления  = Выборка.КонтрагентПоступления;
		//СкладПоступления  	   = Выборка.СкладПоступления;
		//-- №7764
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	//-- №8373
	
КонецФункции