#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ВидимостьДисконтнойКарты = Объект.СлужебныйУчетБонусовПоДисконтнымКартам; //Константы.УчетБонусовПоДисконтнымКартам.Получить();
	Элементы.БонусыДисконтнаяКарта.Видимость = ВидимостьДисконтнойКарты;
	Элементы.СписаниеБонусовДисконтнаяКарта.Видимость = ВидимостьДисконтнойКарты;
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	УчетБонусовПо = ?(Объект.СлужебныйУчетБонусовПоДисконтнымКартам, 1, 0);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьПоГруппе(Команда)
	
	//ГруппаКонтрагентов = ОткрытьФормуМодально("Справочник.Контрагенты.ФормаВыбораГруппы");
	//Если ЗначениеЗаполнено(ГруппаКонтрагентов) Тогда 
	//	ДобавитьПоГруппеНаСервере(ГруппаКонтрагентов);
	//КонецЕсли;
	ИмяТЧ = "Бонусы";
	Если Команда.Имя = "ДобавитьПоГруппеСписание" Тогда
		ИмяТЧ = "СписаниеБонусов";
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьПоГруппеПриЗавершенииВыбора", ЭтотОбъект, ИмяТЧ);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбораГруппы", , ЭтаФорма, ,,, ОписаниеОповещения);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ДобавитьПоГруппеПриЗавершенииВыбора(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДобавитьПоГруппеНаСервере(Результат, ДопПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоГруппеНаСервере(ГруппаКонтрагентов, ИмяТЧ)
	
	//Если Константы.УчетБонусовПоКонтрагентам.Получить() Тогда
	Если НЕ Объект.СлужебныйУчетБонусовПоДисконтнымКартам Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка В ИЕРАРХИИ(&ГруппаКонтрагентов)";
		Запрос.УстановитьПараметр("ГруппаКонтрагентов",ГруппаКонтрагентов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	//ИначеЕсли Константы.УчетБонусовПоДисконтнымКартам.Получить() Тогда
	Иначе	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДисконтныеКарты.Ссылка КАК ДисконтнаяКарта,
		|	ДисконтныеКарты.Владелец КАК Контрагент
		|ИЗ
		|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
		|ГДЕ
		|	ДисконтныеКарты.Владелец В ИЕРАРХИИ(&ГруппаКонтрагентов)";
		Запрос.УстановитьПараметр("ГруппаКонтрагентов",ГруппаКонтрагентов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

//++ 16254
&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере(ДатаСписания)
	
	// Ищем бонусы контрагентов с бонусами больше нуля
	Запрос = Новый Запрос;
	Если УчетБонусовПо = 1 Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БонусыКонтрагентовОстатки.Контрагент КАК Контрагент,
		|	БонусыКонтрагентовОстатки.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	БонусыКонтрагентовОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.БонусыКонтрагентов.Остатки(&Период, ) КАК БонусыКонтрагентовОстатки
		|ГДЕ
		|	БонусыКонтрагентовОстатки.СуммаОстаток > 0
		|	И НЕ БонусыКонтрагентовОстатки.ДисконтнаяКарта = ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БонусыКонтрагентовОстатки.Контрагент КАК Контрагент,
		|	БонусыКонтрагентовОстатки.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	БонусыКонтрагентовОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.БонусыКонтрагентов.Остатки(&Период, ) КАК БонусыКонтрагентовОстатки
		|ГДЕ
		|	БонусыКонтрагентовОстатки.СуммаОстаток > 0
		|	И БонусыКонтрагентовОстатки.ДисконтнаяКарта = ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", ДатаСписания);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Сообщить("Не удалось найти начисленных бонусов на дату " + ДатаСписания);
		Возврат;
	КонецЕсли;	
	Объект.СписаниеБонусов.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Объект.СписаниеБонусов.Добавить();
		НоваяЗапись.Контрагент = Выборка.Контрагент;
		НоваяЗапись.ДисконтнаяКарта = Выборка.ДисконтнаяКарта;
		НоваяЗапись.Сумма = Выборка.Сумма;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Результат.ВведеннаяДата) Тогда
		Возврат;
	КонецЕсли;
	ВведеннаяДата = Результат.ВведеннаяДата; 
	ЗаполнитьПоОстаткамНаСервере(ВведеннаяДата);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	ОповещениеПослеВводаДаты = Новый ОписаниеОповещения("ПослеВводаДаты", ЭтаФорма);
	ПараметрыФормыВводаДаты = Новый Структура("ДатаПоУмолчанию, Заголовок", ТекущаяДата(), "Введите дату на которую" + Символы.ПС + "будет определяться остаток");
	ОткрытьФорму("ОбщаяФорма.ФормаВводаДаты", ПараметрыФормыВводаДаты, ЭтаФорма, , , , ОповещениеПослеВводаДаты, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//-- 16254

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

